{
  "approved_at_utc": null,
  "subreddit": "stocks",
  "selftext": "The first time that I entered the stock market was way back in 2017, when AMD was still at $11. I was 100% sure that it would go up since semiconductors are the future, and it was being shorted and so undervalued. But as a newbie in the stock market, I panic sold at a loss (I could've been up 900% if I had held!). For years, I was on and off the stock market just looking at different tickers. Since I was a very low-risk taker back then, I didn't try to time the market.\n\nThen 2021 happened. I saw the $GME post before it went up. I was very skeptical of him. I didn't buy $GME. But a few days later, $GME went through the roof. I missed out on it. I said to myself, \"Never again.\"\n\nHaving missed on $GME, this is where I go full on YOLO \"trader\". At first, I bought $ID*ě*X stocks, which increased my investments three-fold. Then, $SN\\*L. I thought to myself, \"There's going to be a future cannabis federal legalization.\" (It didn't happen though.) I YOLOed all of my earnings again, and I gained an additional 300% off of them. I also invested heavily in $SOXL but didn't have a lot of gain from it. I converted my motorcycle into a bobber with the profits. It took a while to get it fixed (about 6 months), and so I used my scooter as a daily driver.\n\nBut things took to a dive. I got into a self-caused accident. (There was a hump in the middle of the road, and I was driving about 30 mph. I flew). I was reckless. I didn't use a helmet. I didn't even have any gear - just a short sleeve and shorts, but I still survived. I was bedridden for weeks. The pain in my body was so bad that the pain meds didn't do crap. It really gave me a view of reality that life isn't about having money but having the best of life. Luxury goods give you an ego boost for a few days, but it will always fade away. That's just me though. I really don't care about yachts or lambos. I started doing things that I didn't want to do, and it made me happy. I experienced things that I wouldn't have dreamed of. Get away from your comfort zone. You can be taken at any time without even reaping the benefits of your labor.\n\nFast forward to today. Half of my portfolio is down ($SPY, $SDIV, some gaming stocks, and *ě*TH).\n\nIf you're thinking of ending your life, please don't.\n\nYou can not buy another life, but life can get you another money.\n\nTL;DR: I made some money in the stock market. I got into a motorcycle crash without even benefiting from it. I changed my view of life from focusing on just getting money to focusing on having fun and getting money. Life is more than just money, so don't kill yourself.",
  "author_fullname": "t2_8a1mh1rx",
  "saved": false,
  "mod_reason_title": null,
  "gilded": 0,
  "clicked": false,
  "title": "Life is more than money and you shouldn't take your life due to it.",
  "link_flair_richtext": [],
  "subreddit_name_prefixed": "r/stocks",
  "hidden": false,
  "pwls": 6,
  "link_flair_css_class": "advice",
  "downs": 0,
  "top_awarded_type": null,
  "hide_score": false,
  "name": "t3_uny0ns",
  "quarantine": false,
  "link_flair_text_color": "light",
  "upvote_ratio": 0.81,
  "author_flair_background_color": null,
  "subreddit_type": "public",
  "ups": 220,
  "total_awards_received": 0,
  "media_embed": {},
  "author_flair_template_id": null,
  "is_original_content": false,
  "user_reports": [],
  "secure_media": null,
  "is_reddit_media_domain": false,
  "is_meta": false,
  "category": null,
  "secure_media_embed": {},
  "link_flair_text": "Advice",
  "can_mod_post": false,
  "score": 220,
  "approved_by": null,
  "is_created_from_ads_ui": false,
  "author_premium": false,
  "thumbnail": "",
  "edited": false,
  "author_flair_css_class": null,
  "author_flair_richtext": [],
  "gildings": {},
  "content_categories": null,
  "is_self": true,
  "mod_note": null,
  "created": 1652351442,
  "link_flair_type": "text",
  "wls": 6,
  "removed_by_category": null,
  "banned_by": null,
  "author_flair_type": "text",
  "domain": "self.stocks",
  "allow_live_comments": false,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;The first time that I entered the stock market was way back in 2017, when AMD was still at $11. I was 100% sure that it would go up since semiconductors are the future, and it was being shorted and so undervalued. But as a newbie in the stock market, I panic sold at a loss (I could&amp;#39;ve been up 900% if I had held!). For years, I was on and off the stock market just looking at different tickers. Since I was a very low-risk taker back then, I didn&amp;#39;t try to time the market.&lt;/p&gt;\n\n&lt;p&gt;Then 2021 happened. I saw the $GME post before it went up. I was very skeptical of him. I didn&amp;#39;t buy $GME. But a few days later, $GME went through the roof. I missed out on it. I said to myself, &amp;quot;Never again.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Having missed on $GME, this is where I go full on YOLO &amp;quot;trader&amp;quot;. At first, I bought $ID&lt;em&gt;ě&lt;/em&gt;X stocks, which increased my investments three-fold. Then, $SN*L. I thought to myself, &amp;quot;There&amp;#39;s going to be a future cannabis federal legalization.&amp;quot; (It didn&amp;#39;t happen though.) I YOLOed all of my earnings again, and I gained an additional 300% off of them. I also invested heavily in $SOXL but didn&amp;#39;t have a lot of gain from it. I converted my motorcycle into a bobber with the profits. It took a while to get it fixed (about 6 months), and so I used my scooter as a daily driver.&lt;/p&gt;\n\n&lt;p&gt;But things took to a dive. I got into a self-caused accident. (There was a hump in the middle of the road, and I was driving about 30 mph. I flew). I was reckless. I didn&amp;#39;t use a helmet. I didn&amp;#39;t even have any gear - just a short sleeve and shorts, but I still survived. I was bedridden for weeks. The pain in my body was so bad that the pain meds didn&amp;#39;t do crap. It really gave me a view of reality that life isn&amp;#39;t about having money but having the best of life. Luxury goods give you an ego boost for a few days, but it will always fade away. That&amp;#39;s just me though. I really don&amp;#39;t care about yachts or lambos. I started doing things that I didn&amp;#39;t want to do, and it made me happy. I experienced things that I wouldn&amp;#39;t have dreamed of. Get away from your comfort zone. You can be taken at any time without even reaping the benefits of your labor.&lt;/p&gt;\n\n&lt;p&gt;Fast forward to today. Half of my portfolio is down ($SPY, $SDIV, some gaming stocks, and &lt;em&gt;ě&lt;/em&gt;TH).&lt;/p&gt;\n\n&lt;p&gt;If you&amp;#39;re thinking of ending your life, please don&amp;#39;t.&lt;/p&gt;\n\n&lt;p&gt;You can not buy another life, but life can get you another money.&lt;/p&gt;\n\n&lt;p&gt;TL;DR: I made some money in the stock market. I got into a motorcycle crash without even benefiting from it. I changed my view of life from focusing on just getting money to focusing on having fun and getting money. Life is more than just money, so don&amp;#39;t kill yourself.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "likes": null,
  "suggested_sort": "confidence",
  "banned_at_utc": null,
  "view_count": null,
  "archived": false,
  "no_follow": false,
  "is_crosspostable": false,
  "pinned": false,
  "over_18": false,
  "awarders": [],
  "media_only": false,
  "link_flair_template_id": "823be0a6-65e6-11e5-9784-125ee764bc01",
  "can_gild": false,
  "spoiler": false,
  "locked": false,
  "author_flair_text": null,
  "treatment_tags": [],
  "visited": false,
  "removed_by": null,
  "num_reports": null,
  "distinguished": null,
  "subreddit_id": "t5_2qjfk",
  "author_is_blocked": false,
  "mod_reason_by": null,
  "removal_reason": null,
  "link_flair_background_color": "#646d73",
  "id": "uny0ns",
  "is_robot_indexable": true,
  "report_reasons": null,
  "author": "in_fo",
  "discussion_type": null,
  "num_comments": 19,
  "send_replies": false,
  "whitelist_status": "all_ads",
  "contest_mode": false,
  "mod_reports": [],
  "author_patreon_flair": false,
  "author_flair_text_color": null,
  "permalink": "/r/stocks/comments/uny0ns/life_is_more_than_money_and_you_shouldnt_take/",
  "parent_whitelist_status": "all_ads",
  "stickied": false,
  "url": "https://www.reddit.com/r/stocks/comments/uny0ns/life_is_more_than_money_and_you_shouldnt_take/",
  "subreddit_subscribers": 4023982,
  "created_utc": 1652365373,
  "num_crossposts": 0,
  "media": null,
  "is_video": false,
  "original_created_utc": 1652351442,
  "the_new_excerpt": "The first time that I entered the stock market was way back in 2017, when AMD\nwas still at $11. I was 100% sure that it would go up since semiconductors are\nthe future, and it was being shorted and so undervalued. But as a newbie in the\nstock market, I panic sold at a loss (I could've been up 900%…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私が初めて株式市場に参入したのは、2017年に遡り、AMDが\nがまだ11ドルだった頃で、半導体は上がるものだから100％上がると思ってい\nは未来であり、空売りされていたので、割安感がありました。しかし、株初心者の私は\n株式市場初心者だった私は、慌てて損切りしてしまいました（900％上がっていたかも...）。",
      "title": "命はお金よりも大切なものであり、お金によって命を絶つようなことがあってはならないのです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我第一次进入股票市场是在2017年，当时AMD还在11美元。\n我百分之百相信它会上涨，因为半导体是未来，而且它被做空，被低估。\n未来，而且它被做空，价值被低估了。但是，作为一个股票市场的新手\n但作为一个股市新手，我在亏损的情况下恐慌性卖出（我本来可以上涨900%...",
      "title": "生命比金钱更重要，你不应该因为它而剥夺你的生命。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我第一次進入股票市場是在2017年，當時AMD還在11美元。\n我百分之百相信它會上漲，因爲半導體是未來，而且它被做空，被低估。\n未來，而且它被做空，價值被低估了。但是，作爲一個股票市場的新手\n但作爲一個股市新手，我在虧損的情況下恐慌性賣出（我本來可以上漲900%...",
      "title": "生命比金錢更重要，你不應該因爲它而剝奪你的生命。"
    }
  ],
  "source_updated_at": 1653039957249
}