{
  "author": "Xoraz",
  "the_new_excerpt": "I want to preface this by saying that I am of course not an expert, and this is\nnot financial advice, but simply general information and advice that I have\ngathered over the years. I first invested in Bitcoin when it was at $3000, and\nwould be retired if I had simply held until today, but of course,…",
  "original_created_utc": 1616189713,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我想先说，我当然不是专家，这是我的观点。\n不是财务建议，只是一般的信息和建议，我有。\n多年来收集的。我第一次投资比特币的时候，比特币的价格是3000美元，而。\n如果我坚持到今天就会退休，但当然，...",
      "title": "新手的5个重要加密技巧"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我想先說，我當然不是專家，這是我的觀點。\n不是財務建議，只是一般的信息和建議，我有。\n多年來收集的。我第一次投資比特幣的時候，比特幣的價格是3000美元，而。\n如果我堅持到今天就會退休，但當然，...",
      "title": "新手的5個重要加密技巧"
    }
  ],
  "title": "5 Important Crypto Tips for Newcomers",
  "created_utc": 1616207886,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I want to preface this by saying that I am of course not an expert, and this is not financial advice, but simply general information and advice that I have gathered over the years. I first invested in Bitcoin when it was at $3000, and would be retired if I had simply held until today, but of course, I did not and made many mistakes along the way! From losing access to a wallet with shitcoins that had gone up 5600% in 2017, to day trading thousands down the drain, I&#39;ve done a lot of wrong, but I have also never been as passionate about something as I am now about Blockchain and Cryptos. I&#39;m still very far from retirement, but I am beyond excited for the future.</p>\n\n<p>Here are some tips about Security and Investing in Crypto that I hope can help some of you out there!</p>\n\n<p><strong>1.</strong> <strong>Wallets and Security.</strong> This is probably the most important part for anyone new to this. Getting setup to enter the world of Cryptos can be tricky, and seem overwhelming at first, especially because you want to make sure your funds are secure. Luckily, there are a lot of resources out there to help you understand it, but here are some of the most important parts to keep in mind.</p>\n\n<ul>\n<li>There are many types of wallets out there, and you will hear terms like &quot;Cold Wallet&quot; and &quot;Hot Wallet&quot; a lot, as well as hardware, exchange, browser, and desktop app. All of these function in similar way, but the way YOU access them is what&#39;s important. For the vast majority of wallets, when creating it, you will be given a phrase that consists of 12-24 random words. This is your &quot;<strong>Seed Phrase</strong>&quot; or  &quot;<strong>Mnemonic Phrase&quot;</strong> and it is the <strong>MOST IMPORTANT</strong> part of your wallet. It is what will be used for wallets to get your <strong>Private key</strong>, which will give you complete access to all your Cryptos on that wallet.</li>\n<li><strong>YOU. MUST. NEVER. SHARE. THIS. WITH. ANYONE.</strong> There will <strong>NEVER</strong> be any reason for an exchange, an APP, a website, Elon Musk or your long lost Rich Uncle to EVER need this information. There are no such thing as Giveaways that will give you free anything for this information either. <strong>Your Seed Phrase and your Private Key are 100% ownership of YOUR MONEY</strong>.  You can note it down on paper, on metal, or create a complex secret algorithm for you to remember if you want, but keep it safe from everyone, and also, very importantly, from being <strong>lost</strong> or damaged. You can make tons of copies and put them in <a href=\"https://www.investopedia.com/news/how-winklevoss-twins-store-their-crypto-fortune/\">vaults across the world</a>, but you must be in control of this completely. Another solution is using a Hardware Wallet, which will basically act as a lock, and you will have to use the hardware to unlock your wallet. No one without that piece of hardware will be able to get into your wallet, but then again, you will have a backup phrase to recover the Hardware wallet if lost, which, once again, will be something you must keep very safe.</li>\n<li>The only security concern other than human error with this type of security is if your computer or mobile gets hacked, specifically by a Key Logger, and then when you enter your key to recover or import your wallet, you will ultimately be giving your key away to the hacker, and lose everything. This is why many suggest using a clean machine to do Crypto stuff. That means a computer that doesn&#39;t do anything but Crypto. No games, no Facebook, no Pornhub, no Roblox, nothing. but. crypto. Also best to use general security tips for online browsing, keep your stuff up to date, and NEVER download or click any links from any telegram groups, reddit posts, twitter post, ect, especially if related to Crypto, unless you trust it 100%.</li>\n<li>This brings us to Exchanges, and as they say, not your keys, not your coins. This is true, and while its generally safe to rely on exchanges, there have been numerous times when people have lost everything. Mt.Gox and QuadrigaX are some examples of when people lost everything due to the exchange getting hacked or scam from the owners. Exchanges are also businesses, and are centralized, which means they care about profit more than about you, and there has been plenty of fraudulent ones in the past. In any case, you MUST activate 2 Factor Authentication when using an exchange, and it is highly recommended that you use the Authenticator Apps, and not the Mobile 2FA (as people can clone your SIM and get the 2FA). This will make it so that no one can access or withdraw your money from exchanges without the physical phone that has the App on it. Note that Decentralized Exchanges (DEX) like Uniswap are a good alternative to those because you can buy cryptos directly from your wallet instead (Metamask and Trust Wallet are some of the most popular ones for this)</li>\n<li>Once again, you will NEED to secure your Backup Phrases for these Authenticator apps, for every exchange it is linked to, in case you lose your phone. Of course, you must also be secure with your password and create unique and complicated ones, though, on the bright side, if you lose your info, most exchanges can help you recover your account (though some like Binance have terrible customer service and will take a long time, if ever). The general consensus is that, when using exchanges, it is best to transfer funds to it, buy and trade for whichever Cryptos you want, and then transfer them to your own wallets, since holding large amount of funds in an exchange long term can be risky. When doing this, try to be careful about Fees because doing cash-crypto-exchange-crypto-wallet can add up to multiple transactions and cost you more than you think.</li>\n</ul>\n\n<p><strong>2. DYOR. Do Your Own Research.</strong></p>\n\n<ul>\n<li>There is a goldmine of information available online about every possible crypto project, and plenty of shills and bots who will want many people to purchase their favorite project so that they can make the big bucks off of you. There are also plenty of bots, scams and rug pull where people create coins with a fancy looking website and everything, only to cash out and disappear with millions (have a look at all these Crypto Moonshot subreddits for examples).</li>\n<li>There are also plenty of people who shill their projects due to passion and excitement (me included). There are TONS of amazing blockchain and crypto ideas out there, and some are truly game changing. A lot of the advice will be actually good, and can make you money. That&#39;s why its important for you to always DYOR and try to check both sides of the story. Dig deeper, look at the number, volume, Marketcap, team behind the project, their LinkedIn and experience, use case, adoption so far, and so on. I personally try and focus on project who have an actual real world product. During the Bullrun of 2017, every project was the &quot;next big thing&quot; yet the vast majority of them don&#39;t exist anymore, except the ones who were actually building something that has value in the world right now.</li>\n<li>Lastly, the vast majority of people who make a living shilling their favorite coins to you (like a lot of Youtubers) usually have ulterior motives, though, there is still some valuable information that can be gained, especially from them interviewing CEOs and such.</li>\n</ul>\n\n<p><strong>3. Moonshots and Marketcaps</strong></p>\n\n<ul>\n<li>If it sounds too good to be true, it usually is. There are tons of project who will turn your $1000 into 100k or even 1mil over time, but usually, if you hear about it from tons of people shilling it, its too late. You will often make these types of gain when you get in and can find barely anyone talking about it. The bull market is unpredictable, and very volatile, but not every coin can do a 1000x, no matter how good they all are. Also remember that for everyone making tons of money on Crypto, there is often someone losing tons somewhere else.</li>\n<li>The most important thing to keep in mind when wanting to know the potential of a coin is the Marketcap. You calculate this by taking the Total Supply of a coin and multiplying it by its price. If your coin is worth 0.01 cent each, but there&#39;s a 100 billion coin available, its Marketcap is at 1 Billion. Now think about what a $1 a coin would mean for this project. 100 billion Marketcap. That&#39;s half of what Ethereum is worth.  Ask yourself, does it really deserve that spot? Is it actually being used and adopted enough to be one of the most valuable cryptos in the world? Very often, the answer is no. Can that project grow and get there one day? Maybe! But in a week from shilling the reddit daily? No. There are of course exception, and the market is not always rational, but generally speaking, projects don&#39;t go from being 225 in Marketcap to being as valuable as Ethereum in a few weeks.</li>\n<li>Find yourself real projects with good value that you believe in for the long term, follow their development, engage in discussion about it, join the telegram and follow their announcements, and enjoy the gains when they keep releasing things as they promised, and you will be better off in the long run than trying to throw $100 at every $SAFEOBJECTS and $ZOOANIMAL#123 coins in hopes that you are the one pulling out your money first before it crashes.</li>\n</ul>\n\n<p><strong>4. HODL</strong></p>\n\n<ul>\n<li>You will hear this a lot, and it is generally the best strategy for regular people like you and me. Year after year, Cryptos like Bitcoin have shown that holding them over a long period of time has always granted more gains than any other strategy. The vast majority of people who try and trade and sell at the top only to rebuy for cheaper get burned. Do not become the Buy High Sell Low meme, and invest in projects that you believe in for the long term. Its perfectly fine to diversify, or even to switch some holdings around when you discover new projects, as well as <strong>taking profits along the way</strong> when coins are blowing up, but Day Trading works for less than 5% of people who attempt it, and if you are new in the scene, you are not part of that 5%.</li>\n<li>Also remember that everyone is a genius during a Bull Market and every project is the next 100x, but as I said earlier, projects with real fundamentals are the only ones who have survived past bear markets. We will one day reach a point where real world adoption of a Blockchain Project will be what drives the price up, instead of hype. I ultimately plan on holding on my own portfolio, forever, while taking small profit here and there, because I believe one day our entire economy will be ran through the Blockchain and there will be no point in converting it to FIAT (those pieces of paper people call money that are backed by nothing and that are worth less and less every day)</li>\n</ul>\n\n<p><strong>5. PRIVACY</strong></p>\n\n<ul>\n<li>Your Portfolio is not your Instagram page, keep that shit to yourself. I cannot stress this enough. <strong>DO NOT SHARE HOW MUCH YOU HAVE, OR WHAT YOU ARE WORTH, ONLINE, EVER</strong>.</li>\n<li>The world is a scary place and there are a lot of people out there that will rob you blind and not give it a second thought. Here is a little story:\n\n<ul>\n<li>You go on Reddit right now and share that you have 0.5 BTC and 2 ETH as well as shill your favorite project in which you got a million coins for pennies. No Big Deal right?</li>\n<li>You also go on a subreddit about cats and share pictures of your cat in your yard, and go on your local&#39;s city subreddit and share about where you live and what school you went to, next in between calling people Apes on WSB, you talk about gaming and something unique that happened to you once on WoW and share a screenshot of your account, and so on.</li>\n<li>Fast-forward to 2023, when your net worth is now at over 3 million and someone tracks down your post history and finds out exactly who you are and what kind of wallet you use, what your yard and street looks like, the breed of your cat, your mother&#39;s maiden name and your online handle cause you were a blabbermouth in 2021</li>\n<li>One day you come home to find that you were robbed, and they stole your Ledger and that little piece of paper with all your private keys. Congratulation, you doxed yourself and lost all your crypto!</li>\n</ul></li>\n<li>All of this to say, when interacting on the internet, we share way too much about ourselves, and could end up making you a giant target for thieves as well as hacker. I can guarantee you right now there are plenty of hackers who will target you for some scams and get a keylogger on your PC or Phone after you reveal how many BTCs you have, and there have been stories of people being hurt or abducted for their crypto to be taken away from them before, and there will be plenty more in the future.</li>\n<li>BE SAFE AND BE HUMBLE! Feel free to share what project you are passionate about, and why that is, have discussion and arguments about its future, but you don&#39;t need to go into details about your position, and lets be real, the majority of us don&#39;t have huge amounts, but it could one day be huge and you do not want to put a target on your back.</li>\n</ul>\n</div><!-- SC_ON -->",
  "score": 680,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/Y0kHKjyqCTuFbH3yf2ZR65ZmxHhoAfweYs0oeMYf6PQ.jpg?auto=webp&s=329aadfe31473fe006a18657080284a0da9b8e5b",
          "width": 600,
          "height": 380
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/Y0kHKjyqCTuFbH3yf2ZR65ZmxHhoAfweYs0oeMYf6PQ.jpg?width=108&crop=smart&auto=webp&s=0fae3018cad78522c96d2e868f5ab8edc4c8e42b",
            "width": 108,
            "height": 68
          },
          {
            "url": "https://external-preview.redd.it/Y0kHKjyqCTuFbH3yf2ZR65ZmxHhoAfweYs0oeMYf6PQ.jpg?width=216&crop=smart&auto=webp&s=534323e351d8ad06f35bd6daa29f4d17ee17989d",
            "width": 216,
            "height": 136
          },
          {
            "url": "https://external-preview.redd.it/Y0kHKjyqCTuFbH3yf2ZR65ZmxHhoAfweYs0oeMYf6PQ.jpg?width=320&crop=smart&auto=webp&s=10f8a3f7cc706c822a273aaf0486979db52a20e7",
            "width": 320,
            "height": 202
          }
        ],
        "variants": {},
        "id": "e2pDCuATe0n2EPoZwsoswzr1lKVQCH-LmLL8vs45TrU"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/m8rq5g/5_important_crypto_tips_for_newcomers/",
  "subreddit": "CryptoCurrency",
  "id": "m8rq5g",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1616752815288
}