{
  "approved_at_utc": null,
  "subreddit": "Bogleheads",
  "selftext": "# Buffettology/New Buffettology/The Essential Buffett/How to Pick Stocks like Warren Buffett\n\n- Buffett Indicator - single best indicator of where valuation are at any given moment\n  - Total Market Cap/GDP as a %. Example – Wilshire 5000 20T/US GDP 20T = 100%\n- Warren practices a selective contrarian investment strategy and is price dictated.\n- 95% of investors are short term orientated and chasing a quick dollar. IE = Investing based on articles, quarterly earnings, momentum investing – buying or selling on stock movement. Buffett never looks at charts. People gamble on the short-term fluctuations in the market, this is where long term investors can take advantage.\n- Enthusiastic stock price - one that has recently been going up and then gets coupled with good news will often send its stock into the stratosphere. The opposite is also true. The long-term economics of the company are usually ignored so the long-term investor can take advantage of the bad news phenomenon\n- You want companies that have a DCA with either a product or service. Both are fine\n- Higher interest rates make business earnings worth less to the investor and will drive down stock prices. Lower interest rates will drive up stock prices.\n- The most common reason for low stock prices is pessimism and we should take advantage of this\n- The perfect contrarian buying situation can be created when a stock market panic is coupled with bad news about a company. Do not buy or sell on what you think the market will do. Do it on price.\n- Shop when stocks are unpopular and are cheap\n- Don&amp;#39;t buy just because a stock is cheap. You want to buy high quality companies with durable competitive advantage. Don&amp;#39;t bottom pick\n- Overvalued stocks will eventually come back and undervalued will eventually be revalued up\n- Price competitive business - usually commodity business that only competes on price. IE = Airlines. Low barriers to entry. Lot of companies in this area which equals lower margins. Low cost provider usually wins and management has a very difficult job to stay on top\n- Durable competitive business – Very few of these companies. It is best to buy these types of business if you can. Have good business economics and sells BRAND name product or service without regard to price and can increase price without losing business. Companies can raise prices easier than price competitive business and can stand a down turn better. Don&amp;#39;t buy just because it has a DCA, wait for the right price-this doesn&amp;#39;t occur very often\n- Ideal Company to purchase – one with a DCA or &amp;quot;wide moat&amp;quot;, high barrier to entry which increases profit margins, low R+D/capital expense budget and doesn&amp;#39;t require intellectuals to run the business. IE – Hersey chocolate, alcohol, etc\n- If they have been making the same product for 10+ years, they will probably continue to do so. IE – alcohol\n- You don&amp;#39;t want to buy companies that require large R+D budgets to stay competitive (Intel) or ones that require intellectuals as they can &amp;quot;walk&amp;quot; and take the business with them (Goldman Sachs)\n- Don&amp;#39;t buy companies that need large capital expenses to make money (steel companies, car manufactures)\n- Buffett invests like he is buying the entire business outright and thinks about what his estimated return would be.\n- Be greedy when others are fearful and fearful when other are greedy\n- Times to look for value are bear markets, industry recessions, one-time bad news, structural changes, war\n- Buying opportunity is price dictated and must make business sense\n- Do not buy based on what the market is doing. Buy based on the business like an owner.\n- Certain industries have more DCA companies. They usually fill a repetitive consumer need with products that wear out fast or are used up quickly and have brand name appeal that merchants must carry.\n- Warren&amp;#39;s stock selection criteria\n  - Return on equity(ROE) greater than 15% for 10+ years\n  - Return on total capital(ROTC) greater than 20%\n  - Long term debt less than 5x net earnings after taxes\n  - Consistent earnings increase and in an upward direction\n  - Company has DCA(Durable Competitive Advantage) and is not in a PCB(Price completive business)\n  - Stay away from business that are heavy in unions. Usually in a PCB\n  - The price you pay will determine your rate of return. Lower price = Higher return.\n  - Invest in companies that can increase prices with inflation without losing business\n- Math examples of above\n  - You buy a rental property for 200k. Put 50k down and take a loan for the other 150k. The rental property nets you 5k last year. ROE would be 5/50 or 10%. ROTC would be 5/200 or 2.5%.\n  - Shareholder equity or book value - Company has 10 million in assets, 4 million in liabilities and made 1.5 million last year. 1.5 million net profit divided by 6 million shareholder equity = 25% ROE\n  - Company makes 200 million in net profit, the LTD should be less than 1 Billion.\n  - $5 EPS/$25 stock price = 20% return on investment. $5/$40 = 12.5% return\n- Don&amp;#39;t use debt/equity ratio. It adds in equipment/assets which is only good in a bankruptcy.\n- You want companies with predictable earnings that are showing an upward trend. If they have negative earnings, be careful.\n- Higher ROE is better\n- Low debt companies tend to be more DCA companies and heavy debt tend to be PCB (Price Competitive Business). The low debt allows DCA to survive recessions and problems.\n- If a company has a high dividend or buys back shares, the ROE will be artificially high. Look at ROTC also to see if this is the case. It screens out companies that have a high ROE artificially.\n- Earnings Per Share(EPS) = Net earnings/shares outstanding\n- DCA companies are usually only cheap in a total stock recession where all stocks are down, in an industry recession, or a business calamity. If you invest in a business calamity, make sure this isn&amp;#39;t a permanent situation. One time solvable problems is a great time to buy a DCA stock.\n- You want to invest in the #1 or #2 business in that field. You want companies that keep producing and selling the same product year after year. IE – Alcohol. Not computer chip makers.\n- If a DCA company issues debt to acquire another DCA company, this can be good. If a DCA company issues debt to acquire a PCB, then this usually ends up bad.\n- Decide what companies you like then wait for the right price.\n- Take the per share earnings and divide it by the stock price. This determines your initial rate of return. $5 in earnings with a $25 stock price = 20%.\n- Share repurchases = increase in EPS and it increases your percent ownership in the company without you doing anything\n- You want to buy a DCA company when they experience a downturn in the stock price\n- A $1500 stock maybe cheap and a $1 stock expensive\n- Don&amp;#39;t buy companies that have to spend large amounts of retained earnings on equipment. DCA have more cash to expand, buy new business, re-purchase shares, or pay a dividend. PCB have to spend more on equipment just to stay afloat and have little left over.\n- In the short term the market is a voting machine, letting whim, fear and greed dictate how it votes. But in the long term, the market is a weighing machine that values a company according to the weight of its intrinsic value.\n- A mediocre business will likely remain that way.\n- Two types of business\n  - Commodity type – consistently inferior results. Lots of competition in the market. Price is the single most important factor in consumer demand. Low cost provider wins. Lots of capital expenses which eat up retained earnings. Management has to be smart. Low ROE, profit margins, no brand name loyalty and erratic profits. Examples below\n    - Textile\n    - Producers of raw foodstuffs such as corn and rice\n    - Steel producers\n    - Oil and gas companies\n    - Lumber industry\n    - Paper manufactures\n  - Consumer monopoly – excellent business. Have brand name loyalty. Don&amp;#39;t have to spend lots of money on plants, equipment or land. Question to ask yourself if it is a consumer monopoly? If I had billions of dollars, top managers, could I start a business and compete with them. If the answer is no, then you have a consumer monopoly\n  - How to determine if a business is excellent\n    - Does it have and an identifiable consumer monopoly\n    - Are earnings of the company strong and in an upward trend\n    - Is it conservatively financed\n    - Does it consistently get high ROE\n    - Does it get to retain its earnings\n    - How much does it have to spend on maintaining operations\n    - Is it free to invest retained earnings in new business, expansions, dividends, share repurchases\n    - Can it adjust prices to inflation\n    - Will the added value by retained earnings increase the market value of the company\n  - Where to look for excellent business\n    - Business that make products that wear out quickly or used up quickly, that have brand name appeal and have merchants that have to carry it(Coke)\n    - Communications business that provide a repetitive service manufactures must use to persuade the public to buy their products(TV)\n    - Business that provide repetitive services that people and business are consistently in need of(Amex)\n- If a company has low capital requirements but no prospects for capital employment that would bring a high rate of return, then it should pay out earnings via dividends. If it can employ them with a high return, it should retain them and grow the business\n- Buy companies whose products don&amp;#39;t become obsolete by technical advancement. If you don&amp;#39;t understand it leave it alone.\n- It is the business economics, not the management, the investor should first look to determine whether to invest. You want a business so good, a fool could run it.\n- Honesty is the most important trait of management.\n- The short term is the dominant force in the marketplace and so will determine the stock price. This is where the long term business investor derives a buying opportunity.\n- Don&amp;#39;t invest in long-term bonds.\n- Management&amp;#39;s ability to grow the EPS of a company is key to growth of the shareholders&amp;#39; value in the company\n- If the P/E of the market is 40+ then it is time to get out.\n- Very difficult to see problems with financial companies until they become huge. They can easily hide them.\n- You want a company with a ROE and ROTC greater than 12%\n- Use return on total assets for financial companies. ROTC doesn&amp;#39;t work with them. 1% is good and 1.5% is great.\n\nThe Essential Buffett\n\n- Analyze stocks as business. Most investors spend far too much time and effort watching, predicting, and anticipating price changes and far too little understanding the business\n  - Look at the company&amp;#39;s economics and look at it as if you were taking over as CEO tomorrow…. then look at the price\n- Manage a focused, low turnover portfolio\n  - Best way to hit a home run: Don&amp;#39;t swing at everything; wait for a fat pitch\n  - Best way to outperform the market: Don&amp;#39;t load up on hundreds of stocks; wait for a few outstanding opportunities\n  - If you want to be a &amp;quot;easy&amp;quot; investor, own an index fund and dollar-cost average your purchases\n  - It is foolish to use short term price movements to judge a company&amp;#39;s success\n  - See yourself as owning a portfolio of business, not a portfolio of stocks. This will prevent you from selling your best business\n  - Be patient\n- Understand the difference between investment and speculation\n  - Keynes &amp;quot;Investment is an activity of forecasting the yield over the life of the asset; speculation is the activity of forecasting the psychology of the market.&amp;quot;\n  - Graham &amp;quot;An investment operation is one which, upon thorough analysis, promises safety of principal and a satisfactory return. Operations not meeting this requirement are speculative.&amp;quot;\n  - Buffett &amp;quot;If you&amp;#39;re an investor, you are looking at what the asset will do. If you are a speculator, you are primarily forecasting on what the price will do independent of the business.&amp;quot;\n  - There are no predictable patterns for guessing the future direction of the stock market.\n- Buffett criteria is straightforward: a simple, understandable business with consistent earning power, good ROE, little debt, and good management\n- He is not interested in turnarounds, hostile takeovers, or tentative situations\n- Buffett paid 3x book value for See&amp;#39;s Candy in 1971.\n- Buffett uses a compensation system that rewards managers for performance\n- It has been Buffett&amp;#39;s goal to increase book value per share at 15% per year\n- 1999 annual report Buffett stated that &amp;quot;truly large superiorities over the S+P 500 index are a thing of the past.&amp;quot; Now his goal is to beat the S+P &amp;quot;modestly.&amp;quot;\n- Graham\n\n- According to Graham, 3 forces were responsible for the 1929 crash\n  - Manipulation of stocks by the exchanges and investment firms\n  - Practice of lending money for the purpose of buying stock\n  - Uncontrolled optimism\n- Graham had 2 ways he thought to invest\n  - Cross section approach – equivalent to current index investing\n  - Margin of safety – main point of Graham&amp;#39;s strategy\n    - Purchase shares of the company when the overall market is trading at low prices (usually during a bear market or correction). This can be difficult. This makes you try to &amp;quot;time&amp;quot; the market which is difficult. Or you have to wait for long periods.\n    - Purchase the stock when it trades below intrinsic value even though the overall market isn&amp;#39;t substantially cheap. This is what Graham thought worked best. With this you don&amp;#39;t need to worry about the overall market level. Much easier to do. And you don&amp;#39;t have to try to &amp;quot;time&amp;quot; the market\n  - When a stock is priced well below its intrinsic value, a margin of safety exists\n  - The single most import factor in determining a company&amp;#39;s value was its future earnings power\n  - Use of the intrinsic value approach was limited by the analyst&amp;#39;s imprecise calculations for a company&amp;#39;s economic future. Any number of problems could pop up that negate your estimates\n  - Graham said is was not essential to determine a company&amp;#39;s exact intrinsic value, a range of value was acceptable\n  - Graham had 2 rules for investing\n    - Buy a company for less than 2/3 of its net asset value\n    - Focus on stocks with low P/E&amp;#39;s\n    - Any stock that meets these criteria is out of favor with the market\n  - Graham thought the market mispriced stocks, usually because of fear and greed\n    - At the height of optimism, greed moves stocks beyond their intrinsic value. Be careful during these times.\n    - At other times, pessimism moved stocks below their intrinsic value. Take advantage during these times.\n    - He also believed in &amp;quot;revision to the mean&amp;quot;\n      - Horace &amp;quot;Many shall be restored that now are fallen, and many shall fall that now are in honor.&amp;quot;\n- Phil Fisher\n- Fisher believed that superior profits could be made by\n  - Investing in companies with above-average potential\n  - Aligning oneself with the most capable management\n- Fisher did not believe that superior investment returns could be obtained by investing in marginal companies\n- Only invest in companies that are within your circle of competence\n- Be careful with companies that have to issue new equity to grow. If a company is only able to grow by issuing new equity, the larger number of shares will dilute out any benefits the stockholders might realize from increased growth\n- Look at how managers communicate with shareholders. Do they talk freely when things are good and clam up when bad? Do they take credit for things outside their control?\n- You want companies with good working relations with its employees\n- Charlie Munger\n- Look for companies that generate high cash earnings and require low capital expenditures – he talked Buffett into buying See&amp;#39;s Candies even though it sold at 3x book value with didn&amp;#39;t meet Grahams criteria\n- It is far better to pay a fair price for a great company than a great price for a fair company\n- Blending the 3 together\n- Buffett realized only investing based on Grahams approach wasn&amp;#39;t the best. Sometimes he bought cheap stocks that met Grahams criteria but were cheap because their underlying business was suffering\n- Buffet blended Grahams &amp;quot;margin of safety&amp;quot; with a quantitative understanding of price and value with Fisher&amp;#39;s qualitive understanding of the business and management into one.\n- Buffett buys companies stock like he would buy their whole company\n- He looks for companies he understands, that have favorable long term prospects, are operated by honest and competent people and are available at attractive prices\n- Buffet has 12 tenets he uses to pick companies\n  - Business\n    - Must be simple and understandable – stay within your circle of competence\n    - Consistent operating history – invest with companies that have been producing the same product or service for years. Turnarounds seldom turn. Purchase good business at reasonable prices, rather than difficult business at cheap prices\n    - Favorable long-term prospects – Do you have a franchise or commodity business?\n      - Is it needed or desired?\n      - Has no close substitute\n      - Not heavily regulated\n  - Management\n    - Rational – The biggest test of managements rationality is the decision on how to allocate extra cash once they are in the later stages of the cycle. This is based on where the company is in the business cycle (Development, Rapid Growth, Maturity, Decline). They have 3 choices\n      - Ignore the problem and continue to reinvest at below average rates\n      - Buy Growth through other companies\n      - Return the money to shareholders – as dividends or buy backs = best\n    - Candor\n      - Find managers who discuss openly both positive and negative developments and don&amp;#39;t try to hide\n    - When a management with a reputation for brilliance tackles a business with a reputation for poor fundamental economics, it is the reputation of the business that stays intact.\n  - Financial\n    - Focus on ROE, not EPS. And look for companies with little to no debt\n  - Market Tenets\n    - Determine the value – the best way to determine the value of a business was determined by John Burr Williams in the Theory of Investment Value. The value of a business is the total of the net cash flows (owner earnings) expected to occur over the life of the business, discounted by an appropriate interest rate. You can do this with any investment – bonds, stocks, apartment buildings, oil wells, farms, etc. Look for companies that have predictable future earnings. The appropriate discount rate is the risk-free rate or the current rate of long-term government bonds. (30-year treasury).\n    - Focus on business that are understandable, have enduring economics, and are sun by shareholder-orientated managers, but you still have to buy at a sensible price. Invest with a margin of safety.\n- Invest like you only have 20 investments to make in your lifetime\n- Higher turnover = lower returns\n- True investors are pleased when the rest of the world turns pessimistic. Pessimism is the most common cause of low prices. Buffett likes to do business during pessimism because of the prices it produces\n- To have the best chance of doing better than average, investors must be willing to go against the crowd\n\nHow to Pick Stocks Like Warren Buffett\n\n- If you wish to enhance returns, you must buy at the lowest possible price\n- No asset can outrun its own fundamentals forever, in the long run, there is a perfect correlation between price and value.\n- Benjamin Graham said that the biggest trap investors fall is to decouple price from value, and to base your decisions on the actions of others. If you expect to get rich trying to predict the trading of others, &amp;quot;you must be expecting to try to do what countless others are aiming at, and to be able to do it better than your numerous competitors in the market.&amp;quot;\n- Higher interest rates have a downward pull on stock market prices\n- Don&amp;#39;t actively trade your portfolio. Charles Ellis found that the more you trade stocks, the lower your returns. The commissions, spreads, taxes, etc. force you to beat the market by a higher percentage to make up these costs\n- Short term, the market is perfectly random and unpredictable. You can&amp;#39;t make money short term trading, you have to be right too often for it to work\n- Complicated investing systems have a high failure rate because of the chain of errors. As your system gets more complicated, the chance of parts of it being wrong increase.\n- Try to avoid the temptation to buy stocks simply because you have cash on hand. Wait for the correct time. Buffett had 35B in cash in 1999.\n- History tells us that the stock market cannot outperform the economy for long\n- When P/E are high, be careful. In 1982 the average P/E was just 7(a great buying opportunity). In 1999, the average P/E was 34(bad time to buy)\n- The general rule is to buy during a recession when P/E ratios are lower and sell or stay out during a boom when P/E ratios are high\n- Follow your own counsel, not the advises of other\n- Never assume the market is always right\n- Ignore the day to day fluctuations in the market\n- Avoid relying on forecasts",
  "author_fullname": "t2_6ucr2",
  "saved": false,
  "mod_reason_title": null,
  "gilded": 1,
  "clicked": false,
  "title": "Warren Buffett Book Summaries",
  "link_flair_richtext": [],
  "subreddit_name_prefixed": "r/Bogleheads",
  "hidden": false,
  "pwls": 7,
  "link_flair_css_class": null,
  "downs": 0,
  "top_awarded_type": null,
  "hide_score": false,
  "name": "t3_r97mey",
  "quarantine": false,
  "link_flair_text_color": "dark",
  "upvote_ratio": 0.87,
  "author_flair_background_color": null,
  "subreddit_type": "public",
  "ups": 42,
  "total_awards_received": 2,
  "media_embed": {},
  "author_flair_template_id": null,
  "is_original_content": false,
  "user_reports": [],
  "secure_media": null,
  "is_reddit_media_domain": false,
  "is_meta": false,
  "category": null,
  "secure_media_embed": {},
  "link_flair_text": null,
  "can_mod_post": false,
  "score": 42,
  "approved_by": null,
  "is_created_from_ads_ui": false,
  "author_premium": true,
  "thumbnail": "",
  "edited": false,
  "author_flair_css_class": null,
  "author_flair_richtext": [],
  "gildings": {
    "gid_2": 1
  },
  "content_categories": null,
  "is_self": true,
  "mod_note": null,
  "created": 1638678941,
  "link_flair_type": "text",
  "wls": 7,
  "removed_by_category": null,
  "banned_by": null,
  "author_flair_type": "text",
  "domain": "self.Bogleheads",
  "allow_live_comments": true,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;h1&gt;Buffettology/New Buffettology/The Essential Buffett/How to Pick Stocks like Warren Buffett&lt;/h1&gt;\n\n&lt;ul&gt;\n&lt;li&gt;Buffett Indicator - single best indicator of where valuation are at any given moment\n\n&lt;ul&gt;\n&lt;li&gt;Total Market Cap/GDP as a %. Example – Wilshire 5000 20T/US GDP 20T = 100%&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;li&gt;Warren practices a selective contrarian investment strategy and is price dictated.&lt;/li&gt;\n&lt;li&gt;95% of investors are short term orientated and chasing a quick dollar. IE = Investing based on articles, quarterly earnings, momentum investing – buying or selling on stock movement. Buffett never looks at charts. People gamble on the short-term fluctuations in the market, this is where long term investors can take advantage.&lt;/li&gt;\n&lt;li&gt;Enthusiastic stock price - one that has recently been going up and then gets coupled with good news will often send its stock into the stratosphere. The opposite is also true. The long-term economics of the company are usually ignored so the long-term investor can take advantage of the bad news phenomenon&lt;/li&gt;\n&lt;li&gt;You want companies that have a DCA with either a product or service. Both are fine&lt;/li&gt;\n&lt;li&gt;Higher interest rates make business earnings worth less to the investor and will drive down stock prices. Lower interest rates will drive up stock prices.&lt;/li&gt;\n&lt;li&gt;The most common reason for low stock prices is pessimism and we should take advantage of this&lt;/li&gt;\n&lt;li&gt;The perfect contrarian buying situation can be created when a stock market panic is coupled with bad news about a company. Do not buy or sell on what you think the market will do. Do it on price.&lt;/li&gt;\n&lt;li&gt;Shop when stocks are unpopular and are cheap&lt;/li&gt;\n&lt;li&gt;Don&amp;#39;t buy just because a stock is cheap. You want to buy high quality companies with durable competitive advantage. Don&amp;#39;t bottom pick&lt;/li&gt;\n&lt;li&gt;Overvalued stocks will eventually come back and undervalued will eventually be revalued up&lt;/li&gt;\n&lt;li&gt;Price competitive business - usually commodity business that only competes on price. IE = Airlines. Low barriers to entry. Lot of companies in this area which equals lower margins. Low cost provider usually wins and management has a very difficult job to stay on top&lt;/li&gt;\n&lt;li&gt;Durable competitive business – Very few of these companies. It is best to buy these types of business if you can. Have good business economics and sells BRAND name product or service without regard to price and can increase price without losing business. Companies can raise prices easier than price competitive business and can stand a down turn better. Don&amp;#39;t buy just because it has a DCA, wait for the right price-this doesn&amp;#39;t occur very often&lt;/li&gt;\n&lt;li&gt;Ideal Company to purchase – one with a DCA or &amp;quot;wide moat&amp;quot;, high barrier to entry which increases profit margins, low R+D/capital expense budget and doesn&amp;#39;t require intellectuals to run the business. IE – Hersey chocolate, alcohol, etc&lt;/li&gt;\n&lt;li&gt;If they have been making the same product for 10+ years, they will probably continue to do so. IE – alcohol&lt;/li&gt;\n&lt;li&gt;You don&amp;#39;t want to buy companies that require large R+D budgets to stay competitive (Intel) or ones that require intellectuals as they can &amp;quot;walk&amp;quot; and take the business with them (Goldman Sachs)&lt;/li&gt;\n&lt;li&gt;Don&amp;#39;t buy companies that need large capital expenses to make money (steel companies, car manufactures)&lt;/li&gt;\n&lt;li&gt;Buffett invests like he is buying the entire business outright and thinks about what his estimated return would be.&lt;/li&gt;\n&lt;li&gt;Be greedy when others are fearful and fearful when other are greedy&lt;/li&gt;\n&lt;li&gt;Times to look for value are bear markets, industry recessions, one-time bad news, structural changes, war&lt;/li&gt;\n&lt;li&gt;Buying opportunity is price dictated and must make business sense&lt;/li&gt;\n&lt;li&gt;Do not buy based on what the market is doing. Buy based on the business like an owner.&lt;/li&gt;\n&lt;li&gt;Certain industries have more DCA companies. They usually fill a repetitive consumer need with products that wear out fast or are used up quickly and have brand name appeal that merchants must carry.&lt;/li&gt;\n&lt;li&gt;Warren&amp;#39;s stock selection criteria\n\n&lt;ul&gt;\n&lt;li&gt;Return on equity(ROE) greater than 15% for 10+ years&lt;/li&gt;\n&lt;li&gt;Return on total capital(ROTC) greater than 20%&lt;/li&gt;\n&lt;li&gt;Long term debt less than 5x net earnings after taxes&lt;/li&gt;\n&lt;li&gt;Consistent earnings increase and in an upward direction&lt;/li&gt;\n&lt;li&gt;Company has DCA(Durable Competitive Advantage) and is not in a PCB(Price completive business)&lt;/li&gt;\n&lt;li&gt;Stay away from business that are heavy in unions. Usually in a PCB&lt;/li&gt;\n&lt;li&gt;The price you pay will determine your rate of return. Lower price = Higher return.&lt;/li&gt;\n&lt;li&gt;Invest in companies that can increase prices with inflation without losing business&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;li&gt;Math examples of above\n\n&lt;ul&gt;\n&lt;li&gt;You buy a rental property for 200k. Put 50k down and take a loan for the other 150k. The rental property nets you 5k last year. ROE would be 5/50 or 10%. ROTC would be 5/200 or 2.5%.&lt;/li&gt;\n&lt;li&gt;Shareholder equity or book value - Company has 10 million in assets, 4 million in liabilities and made 1.5 million last year. 1.5 million net profit divided by 6 million shareholder equity = 25% ROE&lt;/li&gt;\n&lt;li&gt;Company makes 200 million in net profit, the LTD should be less than 1 Billion.&lt;/li&gt;\n&lt;li&gt;$5 EPS/$25 stock price = 20% return on investment. $5/$40 = 12.5% return&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;li&gt;Don&amp;#39;t use debt/equity ratio. It adds in equipment/assets which is only good in a bankruptcy.&lt;/li&gt;\n&lt;li&gt;You want companies with predictable earnings that are showing an upward trend. If they have negative earnings, be careful.&lt;/li&gt;\n&lt;li&gt;Higher ROE is better&lt;/li&gt;\n&lt;li&gt;Low debt companies tend to be more DCA companies and heavy debt tend to be PCB (Price Competitive Business). The low debt allows DCA to survive recessions and problems.&lt;/li&gt;\n&lt;li&gt;If a company has a high dividend or buys back shares, the ROE will be artificially high. Look at ROTC also to see if this is the case. It screens out companies that have a high ROE artificially.&lt;/li&gt;\n&lt;li&gt;Earnings Per Share(EPS) = Net earnings/shares outstanding&lt;/li&gt;\n&lt;li&gt;DCA companies are usually only cheap in a total stock recession where all stocks are down, in an industry recession, or a business calamity. If you invest in a business calamity, make sure this isn&amp;#39;t a permanent situation. One time solvable problems is a great time to buy a DCA stock.&lt;/li&gt;\n&lt;li&gt;You want to invest in the #1 or #2 business in that field. You want companies that keep producing and selling the same product year after year. IE – Alcohol. Not computer chip makers.&lt;/li&gt;\n&lt;li&gt;If a DCA company issues debt to acquire another DCA company, this can be good. If a DCA company issues debt to acquire a PCB, then this usually ends up bad.&lt;/li&gt;\n&lt;li&gt;Decide what companies you like then wait for the right price.&lt;/li&gt;\n&lt;li&gt;Take the per share earnings and divide it by the stock price. This determines your initial rate of return. $5 in earnings with a $25 stock price = 20%.&lt;/li&gt;\n&lt;li&gt;Share repurchases = increase in EPS and it increases your percent ownership in the company without you doing anything&lt;/li&gt;\n&lt;li&gt;You want to buy a DCA company when they experience a downturn in the stock price&lt;/li&gt;\n&lt;li&gt;A $1500 stock maybe cheap and a $1 stock expensive&lt;/li&gt;\n&lt;li&gt;Don&amp;#39;t buy companies that have to spend large amounts of retained earnings on equipment. DCA have more cash to expand, buy new business, re-purchase shares, or pay a dividend. PCB have to spend more on equipment just to stay afloat and have little left over.&lt;/li&gt;\n&lt;li&gt;In the short term the market is a voting machine, letting whim, fear and greed dictate how it votes. But in the long term, the market is a weighing machine that values a company according to the weight of its intrinsic value.&lt;/li&gt;\n&lt;li&gt;A mediocre business will likely remain that way.&lt;/li&gt;\n&lt;li&gt;Two types of business\n\n&lt;ul&gt;\n&lt;li&gt;Commodity type – consistently inferior results. Lots of competition in the market. Price is the single most important factor in consumer demand. Low cost provider wins. Lots of capital expenses which eat up retained earnings. Management has to be smart. Low ROE, profit margins, no brand name loyalty and erratic profits. Examples below&lt;/li&gt;\n&lt;li&gt;Textile&lt;/li&gt;\n&lt;li&gt;Producers of raw foodstuffs such as corn and rice&lt;/li&gt;\n&lt;li&gt;Steel producers&lt;/li&gt;\n&lt;li&gt;Oil and gas companies&lt;/li&gt;\n&lt;li&gt;Lumber industry&lt;/li&gt;\n&lt;li&gt;Paper manufactures&lt;/li&gt;\n&lt;li&gt;Consumer monopoly – excellent business. Have brand name loyalty. Don&amp;#39;t have to spend lots of money on plants, equipment or land. Question to ask yourself if it is a consumer monopoly? If I had billions of dollars, top managers, could I start a business and compete with them. If the answer is no, then you have a consumer monopoly&lt;/li&gt;\n&lt;li&gt;How to determine if a business is excellent&lt;/li&gt;\n&lt;li&gt;Does it have and an identifiable consumer monopoly&lt;/li&gt;\n&lt;li&gt;Are earnings of the company strong and in an upward trend&lt;/li&gt;\n&lt;li&gt;Is it conservatively financed&lt;/li&gt;\n&lt;li&gt;Does it consistently get high ROE&lt;/li&gt;\n&lt;li&gt;Does it get to retain its earnings&lt;/li&gt;\n&lt;li&gt;How much does it have to spend on maintaining operations&lt;/li&gt;\n&lt;li&gt;Is it free to invest retained earnings in new business, expansions, dividends, share repurchases&lt;/li&gt;\n&lt;li&gt;Can it adjust prices to inflation&lt;/li&gt;\n&lt;li&gt;Will the added value by retained earnings increase the market value of the company&lt;/li&gt;\n&lt;li&gt;Where to look for excellent business&lt;/li&gt;\n&lt;li&gt;Business that make products that wear out quickly or used up quickly, that have brand name appeal and have merchants that have to carry it(Coke)&lt;/li&gt;\n&lt;li&gt;Communications business that provide a repetitive service manufactures must use to persuade the public to buy their products(TV)&lt;/li&gt;\n&lt;li&gt;Business that provide repetitive services that people and business are consistently in need of(Amex)&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;li&gt;If a company has low capital requirements but no prospects for capital employment that would bring a high rate of return, then it should pay out earnings via dividends. If it can employ them with a high return, it should retain them and grow the business&lt;/li&gt;\n&lt;li&gt;Buy companies whose products don&amp;#39;t become obsolete by technical advancement. If you don&amp;#39;t understand it leave it alone.&lt;/li&gt;\n&lt;li&gt;It is the business economics, not the management, the investor should first look to determine whether to invest. You want a business so good, a fool could run it.&lt;/li&gt;\n&lt;li&gt;Honesty is the most important trait of management.&lt;/li&gt;\n&lt;li&gt;The short term is the dominant force in the marketplace and so will determine the stock price. This is where the long term business investor derives a buying opportunity.&lt;/li&gt;\n&lt;li&gt;Don&amp;#39;t invest in long-term bonds.&lt;/li&gt;\n&lt;li&gt;Management&amp;#39;s ability to grow the EPS of a company is key to growth of the shareholders&amp;#39; value in the company&lt;/li&gt;\n&lt;li&gt;If the P/E of the market is 40+ then it is time to get out.&lt;/li&gt;\n&lt;li&gt;Very difficult to see problems with financial companies until they become huge. They can easily hide them.&lt;/li&gt;\n&lt;li&gt;You want a company with a ROE and ROTC greater than 12%&lt;/li&gt;\n&lt;li&gt;Use return on total assets for financial companies. ROTC doesn&amp;#39;t work with them. 1% is good and 1.5% is great.&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;The Essential Buffett&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;Analyze stocks as business. Most investors spend far too much time and effort watching, predicting, and anticipating price changes and far too little understanding the business\n\n&lt;ul&gt;\n&lt;li&gt;Look at the company&amp;#39;s economics and look at it as if you were taking over as CEO tomorrow…. then look at the price&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;li&gt;Manage a focused, low turnover portfolio\n\n&lt;ul&gt;\n&lt;li&gt;Best way to hit a home run: Don&amp;#39;t swing at everything; wait for a fat pitch&lt;/li&gt;\n&lt;li&gt;Best way to outperform the market: Don&amp;#39;t load up on hundreds of stocks; wait for a few outstanding opportunities&lt;/li&gt;\n&lt;li&gt;If you want to be a &amp;quot;easy&amp;quot; investor, own an index fund and dollar-cost average your purchases&lt;/li&gt;\n&lt;li&gt;It is foolish to use short term price movements to judge a company&amp;#39;s success&lt;/li&gt;\n&lt;li&gt;See yourself as owning a portfolio of business, not a portfolio of stocks. This will prevent you from selling your best business&lt;/li&gt;\n&lt;li&gt;Be patient&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;li&gt;Understand the difference between investment and speculation\n\n&lt;ul&gt;\n&lt;li&gt;Keynes &amp;quot;Investment is an activity of forecasting the yield over the life of the asset; speculation is the activity of forecasting the psychology of the market.&amp;quot;&lt;/li&gt;\n&lt;li&gt;Graham &amp;quot;An investment operation is one which, upon thorough analysis, promises safety of principal and a satisfactory return. Operations not meeting this requirement are speculative.&amp;quot;&lt;/li&gt;\n&lt;li&gt;Buffett &amp;quot;If you&amp;#39;re an investor, you are looking at what the asset will do. If you are a speculator, you are primarily forecasting on what the price will do independent of the business.&amp;quot;&lt;/li&gt;\n&lt;li&gt;There are no predictable patterns for guessing the future direction of the stock market.&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;li&gt;Buffett criteria is straightforward: a simple, understandable business with consistent earning power, good ROE, little debt, and good management&lt;/li&gt;\n&lt;li&gt;He is not interested in turnarounds, hostile takeovers, or tentative situations&lt;/li&gt;\n&lt;li&gt;Buffett paid 3x book value for See&amp;#39;s Candy in 1971.&lt;/li&gt;\n&lt;li&gt;Buffett uses a compensation system that rewards managers for performance&lt;/li&gt;\n&lt;li&gt;It has been Buffett&amp;#39;s goal to increase book value per share at 15% per year&lt;/li&gt;\n&lt;li&gt;1999 annual report Buffett stated that &amp;quot;truly large superiorities over the S+P 500 index are a thing of the past.&amp;quot; Now his goal is to beat the S+P &amp;quot;modestly.&amp;quot;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Graham&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;According to Graham, 3 forces were responsible for the 1929 crash&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;Manipulation of stocks by the exchanges and investment firms&lt;/li&gt;\n&lt;li&gt;Practice of lending money for the purpose of buying stock&lt;/li&gt;\n&lt;li&gt;Uncontrolled optimism&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Graham had 2 ways he thought to invest&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;Cross section approach – equivalent to current index investing&lt;/li&gt;\n&lt;li&gt;Margin of safety – main point of Graham&amp;#39;s strategy&lt;/li&gt;\n&lt;li&gt;Purchase shares of the company when the overall market is trading at low prices (usually during a bear market or correction). This can be difficult. This makes you try to &amp;quot;time&amp;quot; the market which is difficult. Or you have to wait for long periods.&lt;/li&gt;\n&lt;li&gt;Purchase the stock when it trades below intrinsic value even though the overall market isn&amp;#39;t substantially cheap. This is what Graham thought worked best. With this you don&amp;#39;t need to worry about the overall market level. Much easier to do. And you don&amp;#39;t have to try to &amp;quot;time&amp;quot; the market&lt;/li&gt;\n&lt;li&gt;When a stock is priced well below its intrinsic value, a margin of safety exists&lt;/li&gt;\n&lt;li&gt;The single most import factor in determining a company&amp;#39;s value was its future earnings power&lt;/li&gt;\n&lt;li&gt;Use of the intrinsic value approach was limited by the analyst&amp;#39;s imprecise calculations for a company&amp;#39;s economic future. Any number of problems could pop up that negate your estimates&lt;/li&gt;\n&lt;li&gt;Graham said is was not essential to determine a company&amp;#39;s exact intrinsic value, a range of value was acceptable&lt;/li&gt;\n&lt;li&gt;Graham had 2 rules for investing&lt;/li&gt;\n&lt;li&gt;Buy a company for less than 2/3 of its net asset value&lt;/li&gt;\n&lt;li&gt;Focus on stocks with low P/E&amp;#39;s&lt;/li&gt;\n&lt;li&gt;Any stock that meets these criteria is out of favor with the market&lt;/li&gt;\n&lt;li&gt;Graham thought the market mispriced stocks, usually because of fear and greed&lt;/li&gt;\n&lt;li&gt;At the height of optimism, greed moves stocks beyond their intrinsic value. Be careful during these times.&lt;/li&gt;\n&lt;li&gt;At other times, pessimism moved stocks below their intrinsic value. Take advantage during these times.&lt;/li&gt;\n&lt;li&gt;He also believed in &amp;quot;revision to the mean&amp;quot;\n\n&lt;ul&gt;\n&lt;li&gt;Horace &amp;quot;Many shall be restored that now are fallen, and many shall fall that now are in honor.&amp;quot;&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Phil Fisher&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Fisher believed that superior profits could be made by&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;Investing in companies with above-average potential&lt;/li&gt;\n&lt;li&gt;Aligning oneself with the most capable management&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Fisher did not believe that superior investment returns could be obtained by investing in marginal companies&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Only invest in companies that are within your circle of competence&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Be careful with companies that have to issue new equity to grow. If a company is only able to grow by issuing new equity, the larger number of shares will dilute out any benefits the stockholders might realize from increased growth&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Look at how managers communicate with shareholders. Do they talk freely when things are good and clam up when bad? Do they take credit for things outside their control?&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;You want companies with good working relations with its employees&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Charlie Munger&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Look for companies that generate high cash earnings and require low capital expenditures – he talked Buffett into buying See&amp;#39;s Candies even though it sold at 3x book value with didn&amp;#39;t meet Grahams criteria&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;It is far better to pay a fair price for a great company than a great price for a fair company&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Blending the 3 together&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Buffett realized only investing based on Grahams approach wasn&amp;#39;t the best. Sometimes he bought cheap stocks that met Grahams criteria but were cheap because their underlying business was suffering&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Buffet blended Grahams &amp;quot;margin of safety&amp;quot; with a quantitative understanding of price and value with Fisher&amp;#39;s qualitive understanding of the business and management into one.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Buffett buys companies stock like he would buy their whole company&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;He looks for companies he understands, that have favorable long term prospects, are operated by honest and competent people and are available at attractive prices&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Buffet has 12 tenets he uses to pick companies&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;Business&lt;/li&gt;\n&lt;li&gt;Must be simple and understandable – stay within your circle of competence&lt;/li&gt;\n&lt;li&gt;Consistent operating history – invest with companies that have been producing the same product or service for years. Turnarounds seldom turn. Purchase good business at reasonable prices, rather than difficult business at cheap prices&lt;/li&gt;\n&lt;li&gt;Favorable long-term prospects – Do you have a franchise or commodity business?\n\n&lt;ul&gt;\n&lt;li&gt;Is it needed or desired?&lt;/li&gt;\n&lt;li&gt;Has no close substitute&lt;/li&gt;\n&lt;li&gt;Not heavily regulated&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;li&gt;Management&lt;/li&gt;\n&lt;li&gt;Rational – The biggest test of managements rationality is the decision on how to allocate extra cash once they are in the later stages of the cycle. This is based on where the company is in the business cycle (Development, Rapid Growth, Maturity, Decline). They have 3 choices\n\n&lt;ul&gt;\n&lt;li&gt;Ignore the problem and continue to reinvest at below average rates&lt;/li&gt;\n&lt;li&gt;Buy Growth through other companies&lt;/li&gt;\n&lt;li&gt;Return the money to shareholders – as dividends or buy backs = best&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;li&gt;Candor\n\n&lt;ul&gt;\n&lt;li&gt;Find managers who discuss openly both positive and negative developments and don&amp;#39;t try to hide&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;li&gt;When a management with a reputation for brilliance tackles a business with a reputation for poor fundamental economics, it is the reputation of the business that stays intact.&lt;/li&gt;\n&lt;li&gt;Financial&lt;/li&gt;\n&lt;li&gt;Focus on ROE, not EPS. And look for companies with little to no debt&lt;/li&gt;\n&lt;li&gt;Market Tenets&lt;/li&gt;\n&lt;li&gt;Determine the value – the best way to determine the value of a business was determined by John Burr Williams in the Theory of Investment Value. The value of a business is the total of the net cash flows (owner earnings) expected to occur over the life of the business, discounted by an appropriate interest rate. You can do this with any investment – bonds, stocks, apartment buildings, oil wells, farms, etc. Look for companies that have predictable future earnings. The appropriate discount rate is the risk-free rate or the current rate of long-term government bonds. (30-year treasury).&lt;/li&gt;\n&lt;li&gt;Focus on business that are understandable, have enduring economics, and are sun by shareholder-orientated managers, but you still have to buy at a sensible price. Invest with a margin of safety.&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Invest like you only have 20 investments to make in your lifetime&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Higher turnover = lower returns&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;True investors are pleased when the rest of the world turns pessimistic. Pessimism is the most common cause of low prices. Buffett likes to do business during pessimism because of the prices it produces&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;To have the best chance of doing better than average, investors must be willing to go against the crowd&lt;/p&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;How to Pick Stocks Like Warren Buffett&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;If you wish to enhance returns, you must buy at the lowest possible price&lt;/li&gt;\n&lt;li&gt;No asset can outrun its own fundamentals forever, in the long run, there is a perfect correlation between price and value.&lt;/li&gt;\n&lt;li&gt;Benjamin Graham said that the biggest trap investors fall is to decouple price from value, and to base your decisions on the actions of others. If you expect to get rich trying to predict the trading of others, &amp;quot;you must be expecting to try to do what countless others are aiming at, and to be able to do it better than your numerous competitors in the market.&amp;quot;&lt;/li&gt;\n&lt;li&gt;Higher interest rates have a downward pull on stock market prices&lt;/li&gt;\n&lt;li&gt;Don&amp;#39;t actively trade your portfolio. Charles Ellis found that the more you trade stocks, the lower your returns. The commissions, spreads, taxes, etc. force you to beat the market by a higher percentage to make up these costs&lt;/li&gt;\n&lt;li&gt;Short term, the market is perfectly random and unpredictable. You can&amp;#39;t make money short term trading, you have to be right too often for it to work&lt;/li&gt;\n&lt;li&gt;Complicated investing systems have a high failure rate because of the chain of errors. As your system gets more complicated, the chance of parts of it being wrong increase.&lt;/li&gt;\n&lt;li&gt;Try to avoid the temptation to buy stocks simply because you have cash on hand. Wait for the correct time. Buffett had 35B in cash in 1999.&lt;/li&gt;\n&lt;li&gt;History tells us that the stock market cannot outperform the economy for long&lt;/li&gt;\n&lt;li&gt;When P/E are high, be careful. In 1982 the average P/E was just 7(a great buying opportunity). In 1999, the average P/E was 34(bad time to buy)&lt;/li&gt;\n&lt;li&gt;The general rule is to buy during a recession when P/E ratios are lower and sell or stay out during a boom when P/E ratios are high&lt;/li&gt;\n&lt;li&gt;Follow your own counsel, not the advises of other&lt;/li&gt;\n&lt;li&gt;Never assume the market is always right&lt;/li&gt;\n&lt;li&gt;Ignore the day to day fluctuations in the market&lt;/li&gt;\n&lt;li&gt;Avoid relying on forecasts&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "likes": null,
  "suggested_sort": null,
  "banned_at_utc": null,
  "view_count": null,
  "archived": false,
  "no_follow": false,
  "is_crosspostable": false,
  "pinned": false,
  "over_18": false,
  "awarders": [],
  "media_only": false,
  "can_gild": false,
  "spoiler": false,
  "locked": false,
  "author_flair_text": null,
  "treatment_tags": [],
  "visited": false,
  "removed_by": null,
  "num_reports": null,
  "distinguished": null,
  "subreddit_id": "t5_2shb7",
  "author_is_blocked": false,
  "mod_reason_by": null,
  "removal_reason": null,
  "link_flair_background_color": "",
  "id": "r97mey",
  "is_robot_indexable": true,
  "report_reasons": null,
  "author": "captmorgan50",
  "discussion_type": null,
  "num_comments": 2,
  "send_replies": false,
  "whitelist_status": "some_ads",
  "contest_mode": false,
  "mod_reports": [],
  "author_patreon_flair": false,
  "author_flair_text_color": null,
  "permalink": "/r/Bogleheads/comments/r97mey/warren_buffett_book_summaries/",
  "parent_whitelist_status": "some_ads",
  "stickied": false,
  "url": "https://www.reddit.com/r/Bogleheads/comments/r97mey/warren_buffett_book_summaries/",
  "subreddit_subscribers": 117502,
  "created_utc": 1638712321,
  "num_crossposts": 0,
  "media": null,
  "is_video": false,
  "original_created_utc": 1638678941,
  "the_new_excerpt": "BUFFETTOLOGY/NEW BUFFETTOLOGY/THE ESSENTIAL BUFFETT/HOW TO PICK STOCKS LIKE\nWARREN BUFFETT\n\n * Buffett Indicator - single best indicator of where valuation are at any given\n   moment\n   * Total Market Cap/GDP as a %. Example – Wilshire 5000 20T/US GDP 20T = 100%\n * Warren practices a selective…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "バフェットロジー/ニューバフェットロジー/ザ・エッセンシャルバフェット/バフェット的銘柄選択法\nウォーレン・バフェット（WARREN BUFFETT\n\n * バフェット指標 - バリュエーションがどのような状況にあるかを示す最も優れた指標です。\n   瞬間\n   * 時価総額/GDPの割合。例：ウィルシャー5000 20T/US GDP 20T = 100\n * ウォーレンが実践しているのは、選択的な...",
      "title": "ウォーレン・バフェットの本の要約"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "巴菲特学/新巴菲特学/基本巴菲特学/如何像巴菲特一样挑选股票\n沃伦-巴菲特\n\n * 巴菲特指标--在任何特定时刻，衡量估值的最佳指标\n   瞬间\n   * 总市值/GDP的百分比。例如 - 威尔希尔5000指数20T/美国GDP20T=100%。\n * 沃伦有选择地进行投资...",
      "title": "沃伦-巴菲特书籍摘要"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "巴菲特學/新巴菲特學/基本巴菲特學/如何像巴菲特一樣挑選股票\n沃倫-巴菲特\n\n * 巴菲特指標--在任何特定時刻，衡量估值的最佳指標\n   瞬間\n   * 總市值/GDP的百分比。例如 - 威爾希爾5000指數20T/美國GDP20T=100%。\n * 沃倫有選擇地進行投資...",
      "title": "沃倫-巴菲特書籍摘要"
    }
  ],
  "source_updated_at": 1639129309432
}