{
  "author": "gigabyteIO",
  "original_created_utc": 1636757385,
  "title": "Algorand has over 1.7 Billion in volume on Coinbase and it's continuing to go up.",
  "created_utc": 1636771551,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Algorand has had relatively large price movement over the last 24 hours. It&#39;s trading volume is up to over 1.7 billion which is the largest I&#39;ve ever seen it. Additionally, it&#39;s price action is inverse to the rest of the market. Bitcoin, Ethereum, Cardano, and Solana are all red while Algorand is massively green. This is huge for the Algorand ecosystem and we could see Algorand realize it&#39;s actual place in the market before Christmas (which would mean a marketcap similar to Cardano&#39;s). If this were the case ALGO&#39;s would be trading at around $10 each. Personally, I think this is just the beginning for Algorand, it&#39;s marketcap could easily be as big as Ethereum or even Bitcoins in the coming years.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/6cdooyg6u8z71.png?width=806&amp;format=png&amp;auto=webp&amp;s=65fe2d10655e61e85e99242e9c7db2649d11bafc\">Algorand green, while everything else is red. </a></p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/al4hczeau8z71.png?width=1002&amp;format=png&amp;auto=webp&amp;s=6dc77185b354ab5bd6052e71e4af85efa961644c\">1.7B trade volume, highest I&#39;ve ever seen.</a></p>\n\n<p>My speculation is that something huge is happening behind the scenes. Algorand&#39;s Decipher event is at the end of November and they&#39;re supposed to announce some huge things. My guess is people who know what&#39;s going on are loading up.</p>\n\n<p>&#x200B;</p>\n\n<p><strong>TL;DR:</strong> Algorand is beginning to break out and take it&#39;s rightful place at the top. Huge things happening on Algorand right now.</p>\n</div><!-- SC_ON -->",
  "score": 213,
  "permalink": "/r/CryptoCurrency/comments/qsn09v/algorand_has_over_17_billion_in_volume_on/",
  "subreddit": "CryptoCurrency",
  "id": "qsn09v",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Algorand has had relatively large price movement over the last 24 hours. It's\ntrading volume is up to over 1.7 billion which is the largest I've ever seen it.\nAdditionally, it's price action is inverse to the rest of the market. Bitcoin,\nEthereum, Cardano, and Solana are all red while Algorand is…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "アルゴランドは、ここ24時間で比較的大きな値動きをしています。アルゴランドの\n取引量は17億を超え、私がこれまでに見た中で最大となりました。\nさらに、その値動きは市場の他の部分とは逆になっています。ビットコイン。\nイーサリアム、カルダノ、ソラナは赤で、アルゴランドは...",
      "title": "アルゴランドはCoinbaseで17億以上の出来高があり、上がり続けています。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "Algorand在过去24小时内有比较大的价格变动。它的\n交易量超过17亿，这是我见过的最大的交易量。\n此外，它的价格行动与市场的其他部分是相反的。比特币。\n以太坊、Cardano和Solana都是红色，而Algorand是...",
      "title": "Algorand在Coinbase上的交易量超过17亿，而且还在继续上升。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "Algorand在過去24小時內有比較大的價格變動。它的\n交易量超過17億，這是我見過的最大的交易量。\n此外，它的價格行動與市場的其他部分是相反的。比特幣。\n以太坊、Cardano和Solana都是紅色，而Algorand是...",
      "title": "Algorand在Coinbase上的交易量超過17億，而且還在繼續上升。"
    }
  ]
}