{
  "author": "hustlebriefs",
  "original_created_utc": 1649107984,
  "title": "Growth hacking side projects",
  "created_utc": 1649153183,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;&lt;strong&gt;TL;DR:&lt;/strong&gt; I&amp;#39;d like to help &lt;a href=\"/r/SideProject\"&gt;r/SideProject&lt;/a&gt; makers growth hack their bootstrapped side projects to profitable customer-funded businesses in exchange for testimonials and case studies.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m an avid fan of this subreddit primarily because it showcases what passion and ingenuity can do.&lt;/p&gt;\n\n&lt;p&gt;Sadly, the biggest thing I&amp;#39;ve noticed is there&amp;#39;s a LOT of &amp;quot;if you build it, they will come&amp;quot; mindset. So much time, effort, and experience spent on building something cool with no idea of how to market, much less validate their idea, and that sucks.&lt;/p&gt;\n\n&lt;p&gt;That&amp;#39;s why you see so many makers rush off to Product Hunt only to be met with crickets or cross-post here on Reddit to oblivion--it&amp;#39;s hard to get a SaaS product, game or tool off the ground with no budget or plan to grow.&lt;/p&gt;\n\n&lt;p&gt;After thinking on it for a while, I came up with a growth hacking plan I think that could turn a bootstrapped side project into a profitable customer-funded business. I&amp;#39;d like to offer it 100% free to the makers of &lt;a href=\"/r/sideproject\"&gt;r/sideproject&lt;/a&gt; in exchange for testimonials and case studies because ultimately, I&amp;#39;d like to turn it into a consulting business or info product down the road.&lt;/p&gt;\n\n&lt;p&gt;Shoot me a chat if you&amp;#39;re interested!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 5,
  "permalink": "/r/SideProject/comments/twdqb9/growth_hacking_side_projects/",
  "subreddit": "SideProject",
  "id": "twdqb9",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "TL;DR: I'd like to help r/SideProject [/r/SideProject] makers growth hack their\nbootstrapped side projects to profitable customer-funded businesses in exchange\nfor testimonials and case studies.\n\nI'm an avid fan of this subreddit primarily because it showcases what passion\nand ingenuity can…"
}