{
  "author": "SEAR_ME",
  "the_new_excerpt": "Edit: Price was 30k at the time of posting this. I'm not just guessing. I\nanalyzed a couple of news and information which i have access to. Also this Bet\nis Legit til end of the January. You can edit your comment later\n\n\nEDIT 2: I CAN'T GIVE AWAY MORE THAN $1100 WITH FEES INCLUDED, SO IT ONLY GOES…",
  "original_created_utc": 1611280589,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "编辑：我不是随便猜的。我分析了几个新闻。另外这个赌局是合法的\n直到1月底。你可以稍后编辑你的评论编辑2：我不能给\n走了1100多块钱，包括费用，所以只给100条评论排序。\n按时间发布。",
      "title": "我的经验说28kUSD附近是底部。你可以标记这个帖子！如果BTC低于28k，我会给任何在这里发帖的人他们的接收地址10美元的BTC。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "編輯：我不是隨便猜的。我分析了幾個新聞。另外這個賭局是合法的\n直到1月底。你可以稍後編輯你的評論編輯2：我不能給\n走了1100多塊錢，包括費用，所以只給100條評論排序。\n按時間發佈。",
      "title": "我的經驗說28kUSD附近是底部。你可以標記這個帖子！如果BTC低於28k，我會給任何在這裏發帖的人他們的接收地址10美元的BTC。"
    }
  ],
  "title": "My experience says near 28kUSD is Bottom. You can mark this Post! if BTC went under 28k i will give anyone who posts here their receiving address $10 in BTC",
  "created_utc": 1611323129,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Edit: Price was 30k at the time of posting this. I&#39;m not just guessing. I analyzed a couple of news and information which i have access to. \nAlso this Bet is Legit til end of the January. You can edit your comment later</p>\n\n<h2>Edit 2: I can&#39;t give away more than $1100 with fees included,  so it only goes to 100 comments sorted by time posted. thx</h2>\n\n<p>EDIT 3: So much negatively poison here, If you want Bitcoin to go down this much, Then why cry when it does?! What i predicated was based on Insider sources information which not everybody has access to. Don&#39;t get fooled by TAs you see on google.</p>\n</div><!-- SC_ON -->",
  "score": 752,
  "permalink": "/r/Bitcoin/comments/l2dd51/my_experience_says_near_28kusd_is_bottom_you_can/",
  "subreddit": "Bitcoin",
  "id": "l2dd51",
  "is_self": true,
  "media": null,
  "is_video": false
}