{
  "author": "Hard_working247",
  "the_new_excerpt": "Shares of Romeo Power Inc. ran up 40.2% in afternoon trading Tuesday, enough to\npace all NYSE gainers, after the energy technology company announced a five-year\nagreement to supply battery packs and battery management software for Paccar\nInc.'s battery electric vehicles (BEVs). Trading volume…",
  "original_created_utc": 1617734433,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ロメオパワー社の株式は、火曜日の午後の取引で40.2%上昇し、ニューヨーク証券取引所のすべての上昇銘柄の中でトップとなりました。\nロメオパワー社は、パックカー社にバッテリーパックとバッテリー管理ソフトウェアを供給する5年間の契約を発表しました。\nPaccar Inc.のバッテリーパックとバッテリー管理ソフトウェアを供給する5年間の契約を発表したことで、Romeo Power Inc.\nInc.のバッテリー電気自動車（BEV）向けに、バッテリーパックとバッテリー管理ソフトウェアを供給する5年間の契約を発表しました。取引量は...",
      "title": "ロメオパワー社、Paccar社製EVへの電池供給契約によりNYSEの上昇率トップに躍り出る"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "罗密欧电力公司的股价在周二下午的交易中上涨了40.2%，足以\n在能源技术公司宣布了一项为期5年的新政后，该公司在纽约证券交易所的所有涨幅中名列前茅。\n为Paccar提供电池组和电池管理软件的协议。\n公司的电池电动车（BEV）。交易量...",
      "title": "为Paccar电动车供应电池后，Romeo Power股价飙升，紧跟纽约证交所涨幅。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "羅密歐電力公司的股價在週二下午的交易中上漲了40.2%，足以\n在能源技術公司宣佈了一項爲期5年的新政後，該公司在紐約證券交易所的所有漲幅中名列前茅。\n爲Paccar提供電池組和電池管理軟件的協議。\n公司的電池電動車（BEV）。交易量...",
      "title": "爲Paccar電動車供應電池後，Romeo Power股價飆升，緊跟紐約證交所漲幅。"
    }
  ],
  "title": "Romeo Power stock soars to pace NYSE gainers after battery supply pact for Paccar's EVs",
  "created_utc": 1617764735,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Shares of Romeo Power Inc.   ran up 40.2% in afternoon trading Tuesday, enough to pace all  NYSE gainers, after the energy technology company announced a five-year  agreement to supply battery packs and battery management software for  Paccar Inc.&#39;s   battery electric vehicles (BEVs). Trading volume ballooned to  83.6 million shares, compared with the full-day average of about 6.8  million shares over the past 30 days. Under the agreement, Romeo Power  said it will supply batteries for Paccar&#39;s Peterbilt 579 and 520 BEVs in  the U.S. and Canada through 2025. Paccar shares slipped 0.8% in  afternoon trading. Romeo Power&#39;s stock is on track to snap a 10-day  losing streak in which it plunged 40.2% to Monday&#39;s record low close of  $8.02. It has shed 50.0% year to date, while Paccar shares have gained  8.1% and the S&amp;P 500  has tacked on 8.6%. </p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://www.marketwatch.com/story/romeo-power-stock-soars-to-pace-nyse-gainers-after-battery-supply-pact-for-paccars-evs-2021-04-06?mod=mw_quote_news\">https://www.marketwatch.com/story/romeo-power-stock-soars-to-pace-nyse-gainers-after-battery-supply-pact-for-paccars-evs-2021-04-06?mod=mw_quote_news</a></p>\n</div><!-- SC_ON -->",
  "score": 45,
  "permalink": "/r/stocks/comments/mlikgr/romeo_power_stock_soars_to_pace_nyse_gainers/",
  "subreddit": "stocks",
  "id": "mlikgr",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1617961880354
}