{
  "author": "p0lygl0t74",
  "original_created_utc": 1630604296,
  "title": "How do women wearing tampons have spontaneous sex?",
  "created_utc": 1630619560,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Genuinely curious how women can still be ‘in the moment’ when things get sexually heated but they need to dispose of their tampon (which is usually a pretty grim affair). When I had a partner I would have to pre-empt if we may have sex that day and not wear a tampon for that reason because I didn’t fancy pulling it out in front of him or excusing myself to go to the bathroom as it just ruined the moment. I’m wondering because I know of so many women who wear tampons, but how do you still keep the spontaneity?</p>\n</div><!-- SC_ON -->",
  "score": 102,
  "permalink": "/r/TooAfraidToAsk/comments/pgmq3i/how_do_women_wearing_tampons_have_spontaneous_sex/",
  "subreddit": "TooAfraidToAsk",
  "id": "pgmq3i",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Genuinely curious how women can still be ‘in the moment’ when things get\nsexually heated but they need to dispose of their tampon (which is usually a\npretty grim affair). When I had a partner I would have to pre-empt if we may\nhave sex that day and not wear a tampon for that reason because I didn’t…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "純粋に興味があるのは、女性が性的に盛り上がったときに、タンポンを捨てなければならないときに\nタンポンを捨てなければならない時に、女性はどのようにして「その場にいる」ことができるのでしょうか？\n女性はどのようにして「その瞬間」を過ごすことができるのでしょうか？) 私にパートナーがいたときは、その日にセックスするかどうかを先読みして、タンポンをつけないようにしていました。\nパートナーがいたときは、その日にセックスをするかどうかを先読みして、そのためにタンポンをつけないようにしていました。",
      "title": "タンポンをつけている女性は、どのようにして自発的なセックスをしているのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "真正好奇的是，当事情发展到一定程度时，女性如何仍能 \"在当下\"。\n当事情变得激烈的时候，女人怎么还能 \"沉浸 \"在性爱中，但她们需要处理她们的卫生棉条（这通常是一件\n这通常是一件相当严峻的事情）。) 当我有一个伴侣时，我必须预先判断我们是否会在当天发生性行为，并且不戴卫生巾。\n当天发生性关系时，我不得不预先判断我们是否会发生性关系，并为此不戴卫生棉条，因为我不...",
      "title": "佩戴卫生棉条的妇女如何进行自发的性行为？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "真正好奇的是，當事情發展到一定程度時，女性如何仍能 \"在當下\"。\n當事情變得激烈的時候，女人怎麼還能 \"沉浸 \"在性愛中，但她們需要處理她們的衛生棉條（這通常是一件\n這通常是一件相當嚴峻的事情）。) 當我有一個伴侶時，我必須預先判斷我們是否會在當天發生性行爲，並且不戴衛生巾。\n當天發生性關係時，我不得不預先判斷我們是否會發生性關係，併爲此不戴衛生棉條，因爲我不...",
      "title": "佩戴衛生棉條的婦女如何進行自發的性行爲？"
    }
  ]
}