{
  "author": "dailyidea",
  "original_created_utc": 1654085436,
  "title": "An Automated Assistant to Increase Cold Email Response Rates",
  "created_utc": 1654103157,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hey guys! Every week I post here with a business idea from my newsletter, Daily Idea. If you’d like to find more of these ideas, I’ll leave a link to our archive at the bottom of this post.&lt;/p&gt;\n\n&lt;p&gt;Cold emails are a great sales mechanism. It is estimated that over 300 billion emails are sent every day. &lt;/p&gt;\n\n&lt;p&gt;So how can we help to stop these emails from falling on deaf ears?&lt;/p&gt;\n\n&lt;p&gt;The common answer in the cold email community is with something called a “first line.” If you’re not familiar with the term, here’s how it works.&lt;/p&gt;\n\n&lt;p&gt;Let’s say you receive an email that says something like “I saw your website and thought it could use some work. Would you like to discuss how I could help you improve it?” Immediately, this message is probably going to your trash bin. It was clearly automated, they’ve never even seen your site. That’s not the type of person that you want to work with.&lt;/p&gt;\n\n&lt;p&gt;Now let’s say you get another email that says “I was reading your twitter thread about ________. I took the link at the end to your website and identified a few places where you’re leaving money on the table. Do you have a few minutes so that I can share them with you?” &lt;/p&gt;\n\n&lt;p&gt;Okay, so let’s be honest. You’re probably still going to ignore it. But there’s a much higher chance that you reply to this one than the first. It’s clear that it’s a real person, because the message engages with some content that you actually produced. &lt;/p&gt;\n\n&lt;p&gt;This is the magic of a first-line. You create a hook that’s based on something that the person said or did, and use that the segue into your (non-customized) pitch. It breaks down some of the barriers, since it’s clear that you’re a real person.&lt;/p&gt;\n\n&lt;p&gt;It gets you the response rates of a fully-customized email, while only requiring you to actually customize a little bit (just the first line or two).&lt;/p&gt;\n\n&lt;h1&gt;The Cliff Notes Version&lt;/h1&gt;\n\n&lt;p&gt;So here’s the problem. Creating first lines takes a long time. Even the fastest first line writers can only do like 15 good ones an hour. So how can we automate this?&lt;/p&gt;\n\n&lt;p&gt;That’s the crux of the idea. It’s an AI tool built on GPT-3 that can automatically scrape the internet and generate a first line for that particular company for just a fraction of the cost and time of a human writer. Even if they are slightly less effective, you would be able to go from hundreds of emails per day to hundreds of thousands.&lt;/p&gt;\n\n&lt;h1&gt;The Longer Version&lt;/h1&gt;\n\n&lt;p&gt;The process for making first lines isn’t difficult. It’s just time consuming. Here’s how it goes for a human. &lt;/p&gt;\n\n&lt;p&gt;First, you need to figure out what you’re going to reference in the first line. You might go through the site’s blog, try to find the owner on twitter, or see if it is referenced in any articles.&lt;/p&gt;\n\n&lt;p&gt;Then you’ll use that context to write a quick line showing that you read and understood it, and then explaining how it caused you to want to reach out.&lt;/p&gt;\n\n&lt;p&gt;Both of these can be automated. This would be software that first automates finding the material by:&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;Scraping the site to try and find the twitter account of the owner&lt;/li&gt;\n&lt;li&gt;Scraping the site’s blog for interesting articles&lt;/li&gt;\n&lt;li&gt;Scraping the backlinks of the site to find relevant articles&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;It would then choose the most relevant piece of content (this would be a little tricky but I’m not going to focus on it).&lt;/p&gt;\n\n&lt;p&gt;Second, it would use GPT-3 or some other text-generation AI model to analyze the content and output a first line based on other successful ones you have used in the past.&lt;/p&gt;\n\n&lt;p&gt;This could all be automated through an API or done manually in batches.&lt;/p&gt;\n\n&lt;p&gt;With a little bit of background magic you could get it working through Zapier.&lt;/p&gt;\n\n&lt;p&gt;With this tool you would be able to scale your cold email outreach massively, since you wouldn’t be relying on human writers.&lt;/p&gt;\n\n&lt;p&gt;What do you think of this idea? Do you do any cold emailing? Would this be a useful tool for you? Let me know!&lt;/p&gt;\n\n&lt;p&gt;If you want to find some more of the ideas I’ve posted, you can go to our archive at lp.dailyidea.com&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 5,
  "permalink": "/r/SideProject/comments/v2fj48/an_automated_assistant_to_increase_cold_email/",
  "subreddit": "SideProject",
  "id": "v2fj48",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Hey guys! Every week I post here with a business idea from my newsletter, Daily\nIdea. If you’d like to find more of these ideas, I’ll leave a link to our\narchive at the bottom of this post.\n\nCold emails are a great sales mechanism. It is estimated that over 300 billion\nemails are sent every…"
}