{
  "author": "Successful_Craft3076",
  "original_created_utc": 1648116977,
  "title": "Another green day for the market saw ADA reach monthly high!",
  "created_utc": 1648141601,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Is it alt season already? Following the news of Apes (bored ones) working with GME, market saw a rally around metaverse projects. Apecoin itself saw more than 15% rise in price (currently rank 86). Several other metaverse projects (like Axis infinity and its SLP, enjin, star Atlas) saw some nice gains too. it is very hard to say if it is just a phase or gonna have long lasting effect on the whole trend tho.&lt;/p&gt;\n\n&lt;p&gt;Altcoins also saw some long overdue rises. Carano saw almost 17% to the monthly high of 1.15$ which is by no mean near ATH of 3.09$ but still a source of joy for long time hodlers struggling with sluggish price action for several months now.\nOther big gainers include: Dogecoin (14.6%) and Near(10.2%). &lt;/p&gt;\n\n&lt;p&gt;Most alts are green today and most stablecoins are red. Just how we like it! (Unless you missed the last dip like me which is very very sad).\nMarket doesn&amp;#39;t seem whiling to give up 2 trillion floor too. Which is a nice change of scenery to be honest. &lt;/p&gt;\n\n&lt;p&gt;Have fun you all!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 320,
  "permalink": "/r/CryptoCurrency/comments/tm2n39/another_green_day_for_the_market_saw_ada_reach/",
  "subreddit": "CryptoCurrency",
  "id": "tm2n39",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Is it alt season already? Following the news of Apes (bored ones) working with\nGME, market saw a rally around metaverse projects. Apecoin itself saw more than\n15% rise in price (currently rank 86). Several other metaverse projects (like\nAxis infinity and its SLP, enjin, star Atlas) saw some nice…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "もうアルトの季節か？Apes（暇人）たちが、\"alt \"と協働しているというニュースを受けて\nGMEは、メタバースプロジェクトを中心に市場が盛り上がった。Apecoin自体も\n15%上昇した（現在86位）。他のいくつかのメタバースプロジェクト（例えば\nAxis infinityとそのSLP、enjin、star Atlas）には、いくつかの素晴らしい...",
      "title": "ADAが月初高値を更新した。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "现在已经到了祭祀季节了吗？在猿人（无聊的人）与GME合作的消息传出后\nGME合作的消息后，市场上出现了元组项目的反弹。阿佩克恩本身看到了超过\n15%的价格上涨（目前排名86）。其他几个元组项目（如\nAxis infinity和它的SLP，enjin，star Atlas）看到了一些不错的...",
      "title": "市场的另一个绿色日子看到ADA达到了月度高点!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "現在已經到了祭祀季節了嗎？在猿人（無聊的人）與GME合作的消息傳出後\nGME合作的消息後，市場上出現了元組項目的反彈。阿佩克恩本身看到了超過\n15%的價格上漲（目前排名86）。其他幾個元組項目（如\nAxis infinity和它的SLP，enjin，star Atlas）看到了一些不錯的...",
      "title": "市場的另一個綠色日子看到ADA達到了月度高點!"
    }
  ]
}