{
  "author": "Deep-Art3195",
  "original_created_utc": 1627007711,
  "title": "Crisis in Ethiopia",
  "created_utc": 1627050653,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Guys, Ethiopia is facing massive inflation mostly due to the war funded by their Govt. Another example of what we can avoid by achieving the Bitcoin Standard. As we all know, Bitcoin is money no one can fuck with. These Govt depend on fiat which they control and can print whenever they want and fund such wars. Ethiopians should read The Bitcoin Standard and The Bullish case for Bitcoin. We already have a financial system that can fix and help many countries. As Jack Dorsey said - &quot;I hope Bitcoin brings world peace” We need to create more awareness about how Bitcoin can help.</p>\n\n<p>My heart goes out to the people of Ethiopia and rest of Africa.</p>\n</div><!-- SC_ON -->",
  "score": 157,
  "permalink": "/r/Bitcoin/comments/opt06t/crisis_in_ethiopia/",
  "subreddit": "Bitcoin",
  "id": "opt06t",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Guys, Ethiopia is facing massive inflation mostly due to the war funded by their\nGovt. Another example of what we can avoid by achieving the Bitcoin Standard. As\nwe all know, Bitcoin is money no one can fuck with. These Govt depend on fiat\nwhich they control and can print whenever they want and fund…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "みんな、エチオピアは政府が資金提供した戦争のせいで大規模なインフレに直面しています。\nビットコイン・スタンダードを実現することで回避できるもう一つの例です。ご存知の通り\nビットコインは誰にも扱えないお金です。政府は不換紙幣に依存しています。\n彼らがコントロールし、好きな時に印刷して資金を供給することができる...",
      "title": "エチオピアの危機"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "伙计们，埃塞俄比亚正面临着大规模的通货膨胀，主要是由于他们政府资助的战争。\n另一个例子说明我们可以通过实现比特币标准来避免什么。正如\n我们都知道，比特币是没有人可以搞的钱。这些国家的政府依赖法币\n他们控制的货币，可以随时印制，并为其提供资金...",
      "title": "埃塞俄比亚的危机"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "夥計們，埃塞俄比亞正面臨着大規模的通貨膨脹，主要是由於他們政府資助的戰爭。\n另一個例子說明我們可以通過實現比特幣標準來避免什麼。正如\n我們都知道，比特幣是沒有人可以搞的錢。這些國家的政府依賴法幣\n他們控制的貨幣，可以隨時印製，併爲其提供資金...",
      "title": "埃塞俄比亞的危機"
    }
  ]
}