{
  "author": "jcarunningman",
  "original_created_utc": 1625295085,
  "title": "Should we challenge consumerism? (AKA the trend towards acquiring more and more stuff)",
  "created_utc": 1625370473,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I started a company that is a marketplace where neighbors can rent things from one another in a safe and secure environment. Our company aims to challenge the trend towards acquiring more and more stuff (AKA consumerism) by proposing an alternative where we can bring communities together to share the items they need. Sharing brings neighbors together while reducing environmental waste that comes from buying items new! </p>\n\n<p>Do you agree or disagree? </p>\n\n<p>Do you think consumerism is worth challenging? Are you concerned about the environment? </p>\n\n<p>Would you go out of your way to use a service like this?</p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/TrueAskReddit/comments/ocsv9q/should_we_challenge_consumerism_aka_the_trend/",
  "subreddit": "TrueAskReddit",
  "id": "ocsv9q",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I started a company that is a marketplace where neighbors can rent things from\none another in a safe and secure environment. Our company aims to challenge the\ntrend towards acquiring more and more stuff (AKA consumerism) by proposing an\nalternative where we can bring communities together to share…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は、安全で安心な環境で、近所の人たちがお互いに物を借りることができるマーケットプレイスの会社を立ち上げました。\n安心・安全な環境で、近所の人たちがお互いに物を借りることができる市場です。私たちの会社は、モノをどんどん手に入れようとする傾向（消費主義）に\n私たちの会社は、より多くのものを手に入れようとする傾向（別名：消費主義）に挑戦することを目的としています。\n私たちの会社は、物をどんどん手に入れようとする傾向（別名：消費主義）に異議を唱え、地域社会が一緒になって物を共有できるような選択肢を提案することを目指しています。",
      "title": "コンシューマリズムに挑戦すべきか？より多くのものを手に入れようとする傾向のことです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我创办了一家公司，这是一个市场，邻居们可以在安全的环境中相互租赁物品。\n邻居们可以在一个安全的环境中相互租赁物品。我们公司的目标是挑战\n我们的公司旨在挑战获得越来越多的东西（又称消费主义）的趋势，提出一种\n替代方案，在那里我们可以把社区聚集在一起，分享...",
      "title": "我们应该挑战消费主义吗？(又称获取越来越多的东西的趋势)"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我創辦了一家公司，這是一個市場，鄰居們可以在安全的環境中相互租賃物品。\n鄰居們可以在一個安全的環境中相互租賃物品。我們公司的目標是挑戰\n我們的公司旨在挑戰獲得越來越多的東西（又稱消費主義）的趨勢，提出一種\n替代方案，在那裏我們可以把社區聚集在一起，分享...",
      "title": "我們應該挑戰消費主義嗎？(又稱獲取越來越多的東西的趨勢)"
    }
  ]
}