{
  "author": "bigblueberryboobies",
  "the_new_excerpt": "I like to draw and paint, I've had a Deviantart profile since 2009. It's been\nfun and very creative for years. Until like four years ago and a ton of fucking\nporn showed up and now I have girls messaging me asking me to subscribe to their\nOnlyfans. It sucks, I miss the old Deviantart.\n\nI don't know…",
  "original_created_utc": 1614987355,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我喜欢画画，从2009年开始我就有了Deviantart的个人资料。它已经是\n乐趣和非常有创意的多年。直到像四年前和一吨他妈的\n色情片出现了，现在有女孩给我发信息，让我订阅她们的。\nOnlyfans。它吮吸，我怀念旧Deviantart。\n\n我不知道...",
      "title": "是我的原因还是网络上到处都是色情（情色内容）？我感觉这年头躲也躲不掉。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我喜歡畫畫，從2009年開始我就有了Deviantart的個人資料。它已經是\n樂趣和非常有創意的多年。直到像四年前和一噸他媽的\n色情片出現了，現在有女孩給我發信息，讓我訂閱她們的。\nOnlyfans。它吮吸，我懷念舊Deviantart。\n\n我不知道...",
      "title": "是我的原因還是網絡上到處都是色情（情色內容）？我感覺這年頭躲也躲不掉。"
    }
  ],
  "title": "Is it me or is there porn (erotic content) everywhere on the internet? I feel like you can't avoid it these days.",
  "created_utc": 1615002683,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I like to draw and paint, I&#39;ve had a Deviantart profile since 2009. It&#39;s been fun and very creative for years. Until like four years ago and a ton of fucking porn showed up and now I have girls messaging me asking me to subscribe to their Onlyfans. It sucks, I miss the old Deviantart. </p>\n\n<p>I don&#39;t know if TikTok knows I&#39;m a guy but I swear to Christ every TikTok I see and flip through is a beatiful woman. Or a woman with big boobs just jiggling around. I am a heterosexual guy, I&#39;m attracted to woman but I&#39;m not this horny all the time. It&#39;s like annoying now. I was looking at youtube and I saw this ad on the front page of &#39;Sexy Chinese Woman near you!&#39; First off I live in Amish country so, big fucking chance they like to come to Amish country to knock on my door. </p>\n\n<p>I don&#39;t know I&#39;m sick of this. I miss the days if I wanted porn I went and found it. I&#39;m tired of it being thrown in my face constantly and girls begging me to subscribe to their only fans via dm. I don&#39;t know if it&#39;s just me but it feels like it&#39;s infecting everything lately.</p>\n</div><!-- SC_ON -->",
  "score": 104,
  "permalink": "/r/NoStupidQuestions/comments/lyovgo/is_it_me_or_is_there_porn_erotic_content/",
  "subreddit": "NoStupidQuestions",
  "id": "lyovgo",
  "is_self": true,
  "media": null,
  "is_video": false
}