{
  "author": "binaryfinancial",
  "the_new_excerpt": "[update: here's another way to start to understand this situation if what's\nwritten below is too dense\nAnthony Denier, CEO of Webull on the Robinhood/GameStop situation\nhttps://www.youtube.com/watch?v=4RS4JIEVyXM]\n\nThis explanation is from Silent Cal…",
  "original_created_utc": 1611928656,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "[更新：这里有另一种方法可以开始了解这种情况，如果什么是。\n语焉不详\nWebull首席执行官Anthony Denier谈Robinhood/GameStop的情况\nhttps://www.youtube.com/watch?v=4RS4JIEVyXM]\n\n这个解释来自《沉默的卡尔... ...",
      "title": "解释为什么@RobinhoodApp非恶意限制交易？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "[更新：這裏有另一種方法可以開始瞭解這種情況，如果什麼是。\n語焉不詳\nWebull首席執行官Anthony Denier談Robinhood/GameStop的情況\nhttps://www.youtube.com/watch?v=4RS4JIEVyXM]\n\n這個解釋來自《沉默的卡爾... ...",
      "title": "解釋爲什麼@RobinhoodApp非惡意限制交易？"
    }
  ],
  "title": "An explanation of why @RobinhoodApp non-nefariously restricted trading",
  "created_utc": 1611964608,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>[update:  here&#39;s another way to start to understand this situation if what&#39;s written below is too dense<br/>\nAnthony Denier, CEO of Webull on the Robinhood/GameStop situation<br/>\n<a href=\"https://www.youtube.com/watch?v=4RS4JIEVyXM\">https://www.youtube.com/watch?v=4RS4JIEVyXM</a>]  </p>\n\n<p>This explanation is from Silent Cal @KralcTrebor</p>\n\n<p><a href=\"https://twitter.com/KralcTrebor/status/1354952686165225478\">https://twitter.com/KralcTrebor/status/1354952686165225478</a></p>\n\n<p>Ok - here&#39;s my best explanation of why @RobinhoodApp restricted trading in the short-squeeze stocks.</p>\n\n<p>Spoiler: the story isn&#39;t the Ken Griffen called Janet Yellen who instructed DTCC to raise margin on Robinhood to force them to shut down the speculative buying.</p>\n\n<p>Here goes ...</p>\n\n<p>Robinhood (RH) is a broker. They don&#39;t execute stock orders themselves. They sign up customers, route their orders to executing brokers, and keep track of who owns what. RH is also its own clearing broker, so they directly settle and custody their clients&#39; securities.</p>\n\n<p>Yes, RH is paid by Citadel to handle executing some of its order flow. This isn&#39;t as nefarious as it sounds - Citadel Equity Securities is paying to execute retail orders because they aren&#39;t pernicious (like having 500x the size behind them).</p>\n\n<p>RH customers buy and sell stocks. Those trades don&#39;t settle (settle = closing, the exchange of cash for security) until T+2, two days later. Depending on the net of buys/sells, RH is on the hook to pay or recieve that net cash. That&#39;s credit risk.</p>\n\n<p>NSCC is the entity that takes that credit risk. It matches up the net buyers and sellers, post-trade, and handles the exchange of cash for security. To mitigate the credit risk that one of the clearing brokers fails, they demand the brokers post a clearing deposit with them.</p>\n\n<p>The NSCC is required to do this by SEC rule, tracing to Dodd-Frank.</p>\n\n<p>Here&#39;s the details: <a href=\"https://sec.gov/rules/sro/nscc-an/2018/34-82631.pdf\">https://sec.gov/rules/sro/nscc-an/2018/34-82631.pdf</a></p>\n\n<p>Everyone posts, and if a broker fails, then NSCC takes any losses out of that broker&#39;s deposit, then some from NSCC, then from everyone else (the other brokers).</p>\n\n<p>This is a post-crisis idea encoded in Dodd-Frank that making everyone post collateral reduces the credit risk and systemic risk and such.</p>\n\n<p>So how does the NSCC clearing deposit get calculated?</p>\n\n<p>It&#39;s basically Deposit = min( 99% 2d VaR + Gap Risk Measure, Deposit Floor Calc) + Mark-to-Market ... math and jargon!</p>\n\n<p>Let&#39;s use an example. Say Fidelity has clients who bought 2bn of stock and sold 1.5bn of stocks. First, net down buy/sell between customers in the same stock.</p>\n\n<p>Say that leaves 1bn buy and 0.5bn sell. Run some math to answer &quot;that won&#39;t move more than X with 99% odds in the next 2 days.&quot; Let&#39;s say that&#39;s 3% of the net, so 3% * (1bn-0.5bn) = 0.15bn = 15m. That the 99% 2d VaR.</p>\n\n<p>Next, we ask &quot;is any one stock net more than 30% of the net buy/sell&quot; ... and if it is, then we take 10% of that amount and add it as the Gap Risk Measure. So if Fidelity customers bought 200m IBM, then add 20m to that 15m. That&#39;s Gap Risk Measure.</p>\n\n<p>Deposit Floor Calc is some thing that looks at the 1bn buy and the 0.5bn sell and does a small calc and adds them, so that if the first calc (99% 2d VaR + Gap Risk Measure) is small, then this floor will keep the overall from being tiny.</p>\n\n<p>Then, last, you add Mark-to-Market. Basically if your customers bought IBM at 140/shr and it goes to 110/shr before it settles for cash at 140/shr, the NSCC has 30/shr of credit exposure to the clearing broker and that amount gets added to the required collateral posted to NSCC.</p>\n\n<p>There are some other items, but that&#39;s the basic idea - full details are here: <a href=\"https://dtcc.com/-/media/Files/Downloads/legal/policy-and-compliance/NSCC_Disclosure_Framework.pdf\">https://dtcc.com/-/media/Files/Downloads/legal/policy-and-compliance/NSCC_Disclosure_Framework.pdf</a></p>\n\n<p>The NSCC sets the framework, but it is spelled out in Dodd-Frank that they have to do so by law.</p>\n\n<p>These deposits are held in the Clearing Fund at the NSCC.</p>\n\n<p>Financials are here: <a href=\"https://dtcc.com/legal/financial-statements\">https://dtcc.com/legal/financial-statements</a></p>\n\n<p>They had 10.5bn in the Clearing Fund as of Sep 30, 2020.</p>\n\n<p>This is the regime post-Dodd-Frank. NSCC updated it&#39;s rules in 2018 to improve the VaR calc and to add the Gap Risk Measure.</p>\n\n<p>How did this impact Robinhood?</p>\n\n<p>Well, let&#39;s say Robinhood had $20bn of client assets starting 2021. Those customers used to trade $1bn/d say. What is the context for Clearing Deposit? Say 2 days it&#39;s a little unbalanced and it&#39;s 1.2bn buy and 0.8bn sell. Ok, that&#39;s probably around 12m, maybe 20m deposit.</p>\n\n<p>If they take in $600m of new deposits and say $400m wants to buy GME. Plus of their $20bn existing, say there is $400m of GME buys over the past 2d. Then the picture could look like 2.0bn buys and 1.0bn sells, which might normally be 30m deposit. But volatility went up. A bit.</p>\n\n<p>Now 99% 2d VaR is much higher. It should be 20x higher for their net portfolio, but the formula will smooth it out some. Maybe it&#39;s ~4x bigger. So just on VaR, they have to post 120m now. That they should have.</p>\n\n<p>The Gap Risk Measure is what kills them.</p>\n\n<p>If GME is over 30% of their net unsettled portfolio, then they are required to post 10% of all the GME buys. So if that&#39;s 800m, they have to post another 80m. And there is no limit to it. As long as their clients are up P&amp;L, the mark-to-market covers it.</p>\n\n<p>But if RH takes in 500m of new money and 300m buys GME, then at minimum they are looking at posting 30m+ from just that exposure at NSCC. They cannot use client money - RH has to use their own resources to post. And if GME stock drops, RH has to post the loss pre-settlement.</p>\n\n<p>This would also explain why RH drew its credit lines and said vague things about clearing requirements.</p>\n\n<p>Robinhood Is Said to Draw on Bank Credit Lines Amid Tumult\n<a href=\"https://www.bloomberg.com/news/articles/2021-01-28/robinhood-is-said-to-draw-on-credit-lines-from-banks-amid-tumult\">https://www.bloomberg.com/news/articles/2021-01-28/robinhood-is-said-to-draw-on-credit-lines-from-banks-amid-tumult</a>\n(alternative URL:  <a href=\"https://archive.is/sLhsm\">https://archive.is/sLhsm</a>)</p>\n\n<p>The policy goal here is to avoid the central plumbing entities from taking credit risk. In reality, such regulations raise costs and create barriers to entry. It raises profits for entities like DTCC (which owns NSCC and is itself owned by Wall St)</p>\n\n<p>RH offered to open up stock market investing more broadly. They succeeded, clearly. But the regulations didn&#39;t change - there are still pro-Wall St, pro-incumbent rules and capital requirements. It&#39;s one of the most highly regulated industries in our nation.</p>\n\n<p>So @aoc is right to ask how it can be that Robinhood stopped its clients from buying certain securities. And what she&#39;ll find is that the reason is that Dodd-Frank requires brokers like RH to post collateral to cover their clients&#39; trading risk pre-settlement.</p>\n\n<p>And it isn&#39;t the Fed or SEC who sets the rules. It&#39;s the Wall St owned central clearing entity itself, DTCC, that makes its own rules. So when the retail masses decided to squeeze the short-sellers, in the middle of crushing them, it was govt regulations which tripped them up.</p>\n</div><!-- SC_ON -->",
  "score": 291,
  "permalink": "/r/investing/comments/l7t4pg/an_explanation_of_why_robinhoodapp_nonnefariously/",
  "subreddit": "investing",
  "id": "l7t4pg",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1612518532617
}