{
  "author": "SelectAllLemons",
  "the_new_excerpt": "First of all, I'm not an economist, I'm an idiot, so my questions will probably\nsound really stupid...\n\nWhy do people talk as if Fed were idiots and didn't realise that constant \"USD\nprinting\" can cause lessening trust in USD and inflation.\n\nThey are fully aware of that.\n\nSo if they \"printed\" all…",
  "original_created_utc": 1609022568,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "首先，我不是经济学家，我是个白痴，所以我的问题可能会\n听起来真的很蠢..。\n\n为什么人们说得好像美联储是白痴，没有意识到常量“美元”\n印刷“可能会导致人们对美元的信任下降和通货膨胀。\n\n他们完全意识到这一点。\n\n所以如果他们“打印”了所有的…",
      "title": "如果美联储能够停止“印钞”并在未来加息，人们为什么会对“美元贬值”感到恐慌？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "首先，我不是經濟學家，我是個白癡，所以我的問題可能會\n聽起來真的很蠢..。\n\n爲什麼人們說得好像美聯儲是白癡，沒有意識到常量“美元”\n印刷“可能會導致人們對美元的信任下降和通貨膨脹。\n\n他們完全意識到這一點。\n\n所以如果他們“打印”了所有的…",
      "title": "如果美聯儲能夠停止“印鈔”並在未來加息，人們爲什麼會對“美元貶值”感到恐慌？"
    }
  ],
  "title": "Why are people panicking about \"USD losing value\" if Fed can stop \"printing it\" and rise rates in future?",
  "created_utc": 1609101631,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>First of all, I&#39;m not an economist, I&#39;m an idiot, so my questions will probably sound really stupid...</p>\n\n<p>Why do people talk as if Fed were idiots and didn&#39;t realise that constant &quot;USD printing&quot; can cause lessening trust in USD and inflation.</p>\n\n<p>They are fully aware of that.</p>\n\n<p>So if they &quot;printed&quot; all this money during the Corona crisis (because of the crisis). Then why do people assume they will keep doing it forever and will ruin the trust in USD and cause &quot;uncontrolled inflation&quot;. They can increase rates, correct? They can just stop printing this much, correct?</p>\n\n<p>So why do people panic about &quot;new world order&quot;, &quot;great reset&quot;, &quot;new currency&quot; and &quot;USD being dethroned&quot;?</p>\n</div><!-- SC_ON -->",
  "score": 60,
  "permalink": "/r/investing/comments/kkrmm0/why_are_people_panicking_about_usd_losing_value/",
  "subreddit": "investing",
  "id": "kkrmm0",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1609495333657
}