{
  "author": "Nickanator8",
  "original_created_utc": 1630805521,
  "title": "Your $100 investment won't make you rich.",
  "created_utc": 1630819834,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>But $100 each week might. I did a poll here about a week ago asking what everyone&#39;s portfolio values were. The majority of people (12% of those polled) were in the $1000-$5000 range. For many, this is a huge sum of money. Depending on where you live or your living conditions this could range from a month&#39;s pay to a year&#39;s, and if you have your entire year&#39;s salary invested that&#39;s awesome! That being said, unless I miss my guess the majority of the members of this subreddit are from the US, Canada, and UK. </p>\n\n<p>Here&#39;s the thing: if you want life changing wealth, whatever that means to you, you need to invest a decent chunk of change. If you threw $100 into the market just to &quot;see what happens&quot; it&#39;s not going to do much unless you&#39;re making some extremely risky plays which may as well be scratch off lottery tickets.</p>\n\n<p>If you want to build wealth it will take time and money, and a lot of both. Get into the habit of putting a percentage of your paycheck directly into your investments. Crypto, stocks, precious metals, NFTs, whatever, just always be buying, especially when you&#39;re starting out. </p>\n\n<p>DCA every day, this is the Gwei.</p>\n</div><!-- SC_ON -->",
  "score": 158,
  "permalink": "/r/CryptoCurrency/comments/pi3w2f/your_100_investment_wont_make_you_rich/",
  "subreddit": "CryptoCurrency",
  "id": "pi3w2f",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "But $100 each week might. I did a poll here about a week ago asking what\neveryone's portfolio values were. The majority of people (12% of those polled)\nwere in the $1000-$5000 range. For many, this is a huge sum of money. Depending\non where you live or your living conditions this could range from a…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "しかし、毎週100ドルならいいかもしれない。一週間ほど前にここで、みんなのポートフォリオの価値を尋ねる投票を行いました。\nみんなのポートフォリオの価値は？大多数の人（投票者の12％）は\nは1000ドルから5000ドルの範囲でした。多くの人にとって、これは大きな金額です。住んでいる場所や生活環境によって\n住んでいる場所や生活環境によっては、1,000～5,000ドルの範囲に入ることもあります。",
      "title": "100ドルの投資では、お金持ちにはなれません。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "但每周100美元可能会。大约一周前，我在这里做了一个调查，问大家的投资组合价值是多少？\n大家的投资组合价值是多少。大多数人（占被调查者的12%）都在1美元左右。\n是在1000-5000美元之间。对许多人来说，这是一笔巨大的资金。根据\n根据你居住的地方或你的生活条件，这可能是一个范围。",
      "title": "你的100美元投资不会让你发财。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "但每週100美元可能會。大約一週前，我在這裏做了一個調查，問大家的投資組合價值是多少？\n大家的投資組合價值是多少。大多數人（佔被調查者的12%）都在1美元左右。\n是在1000-5000美元之間。對許多人來說，這是一筆巨大的資金。根據\n根據你居住的地方或你的生活條件，這可能是一個範圍。",
      "title": "你的100美元投資不會讓你發財。"
    }
  ]
}