{
  "author": "ImLinker",
  "original_created_utc": 1638493893,
  "title": "Affordable Loss Check: If you lost all your crypto holdings right now, how would it effect you?",
  "created_utc": 1638513793,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Everyone knows the golden rule of crypto, right?&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Only invest what you can afford to lose!&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;So this post is a simple check-in for you to see where you are at with your investing. &lt;/p&gt;\n\n&lt;p&gt;If you were hacked, lost your seed phrase in a boating accident or any other way of losing your crypto, how would it effect you and would you financially (and mentally) be okay?&lt;/p&gt;\n\n&lt;p&gt;This is an incredibly important thing to be aware of and to keep in mind while we are getting into the can of worms which is crypto trading. &lt;/p&gt;\n\n&lt;p&gt;Especially if you already have trouble managing finances, I really encourage everyone to be as aware of their situation and what would truly happen if you lost all your holdings.&lt;/p&gt;\n\n&lt;p&gt;I know I would be pretty devastated from losing my holdings &amp;amp; I think mentally it would be hard for me. However financially I think I would be okay short term &amp;amp; long term.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 176,
  "permalink": "/r/CryptoCurrency/comments/r7mgs6/affordable_loss_check_if_you_lost_all_your_crypto/",
  "subreddit": "CryptoCurrency",
  "id": "r7mgs6",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Everyone knows the golden rule of crypto, right?\n\n\"Only invest what you can afford to lose!\"\n\nSo this post is a simple check-in for you to see where you are at with your\ninvesting.\n\nIf you were hacked, lost your seed phrase in a boating accident or any other way\nof losing your crypto, how would it…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "暗号の黄金律はみんな知ってるよね？\n\n\"損してもいいものだけを投資しろ！\"\n\nだから、この投稿は、あなたがどこにいるのかを見るための簡単なチェックインです。\n投資しています。\n\nハッキングされたり、ボート事故でシードフレーズを失ったり、その他の方法で\n暗号を失った場合、それはどのように...",
      "title": "アフォーダブル・ロス・チェック もし今、保有している暗号の全てを失ったら、どのような影響があるでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "每个人都知道加密货币的黄金法则，对吗？\n\n\"只投资你能承受的损失！\"\n\n因此，这篇文章是一个简单的检查，让你看看你的投资处于什么位置。\n投资的情况。\n\n如果你被黑客攻击，在一次划船事故中失去了你的种子短语，或以任何其他方式\n失去你的加密货币，它将如何...",
      "title": "负担得起的损失检查。如果你现在失去了所有的加密货币持有量，会对你有什么影响？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "每個人都知道加密貨幣的黃金法則，對嗎？\n\n\"只投資你能承受的損失！\"\n\n因此，這篇文章是一個簡單的檢查，讓你看看你的投資處於什麼位置。\n投資的情況。\n\n如果你被黑客攻擊，在一次划船事故中失去了你的種子短語，或以任何其他方式\n失去你的加密貨幣，它將如何...",
      "title": "負擔得起的損失檢查。如果你現在失去了所有的加密貨幣持有量，會對你有什麼影響？"
    }
  ]
}