{
  "author": "iamtheprimeminister",
  "the_new_excerpt": "What’s everyone’s thoughts on AMD as a long term growth stock?\n\nAfter releasing their 2020 figures last week it looks like they are performing\nvery well and they seem anything but over valued to me at their current pricing.\n($85)\n\nWith the 5nm Zen4 chips reportedly releasing this year that could…",
  "original_created_utc": 1612103645,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "大家对AMD作为长期成长股有什么看法？\n\n上周公布了他们的2020年数据后，看起来他们的表现是\n很好，他们似乎什么都没有，但在他们目前的定价我高估。\n($85)\n\n据报道，随着5纳米Zen4芯片今年的发布，可能...",
      "title": "先进微器件"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "大家對AMD作爲長期成長股有什麼看法？\n\n上週公佈了他們的2020年數據後，看起來他們的表現是\n很好，他們似乎什麼都沒有，但在他們目前的定價我高估。\n($85)\n\n據報道，隨着5納米Zen4芯片今年的發佈，可能...",
      "title": "先進微器件"
    }
  ],
  "title": "Advanced Micro Devices (AMD)",
  "created_utc": 1612133696,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>What’s everyone’s thoughts on AMD as a long term growth stock? </p>\n\n<p>After releasing their 2020 figures last week it looks like they are performing very well and they seem anything but over valued to me at their current pricing. ($85) </p>\n\n<p>With the 5nm Zen4 chips reportedly releasing this year that could also be another positive factor for a price rise considering their 7nm tech is far ahead of intel’s which is not yet in the market, and Nvidia plan to use TSMC for their tech. \nAMD also plan to release a new data centre processor and are on course to take more of the data centre market. Not to mention the ongoing shortage in their Semi-conductor GPU’s for Xbox and ps5. </p>\n\n<p>I’ve had it on my watchlist for a while and after the stock market volatility recently it’s surely a good buy tomorrow when the markets re-open. </p>\n\n<p>It seems like there will be more hype around GME tomorrow so I’m expecting to see a drop in loads of stocks tomorrow. </p>\n\n<p>Personally, I think AMD is a solid buy but I would like to hear thoughts from other folk.</p>\n</div><!-- SC_ON -->",
  "score": 70,
  "permalink": "/r/stocks/comments/l9deye/advanced_micro_devices_amd/",
  "subreddit": "stocks",
  "id": "l9deye",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1612518539360
}