{
  "author": "Secure-Ad1612",
  "the_new_excerpt": "Listen up retards, Cramer is not your friend and he never was. He is nothing but\na hedge fund gimp hungry for them to plow his ass one more time. He is the\nGollum to WSBs Frodo.\n\nAll of you soy boys fan girling over him mentioning WSB on national television\nare the absolute retards of the retards…",
  "original_created_utc": 1610996412,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "听着弱智们，克拉默不是你们的朋友，他也从来不是。他只是\n一个对冲基金的皮条客 渴望他们再给他一次机会。他是...\n咕噜对WSB的佛罗多。\n\n你们这些酱油男孩的粉丝们都为他在全国电视上提到WSB而鼓掌。\n是绝对的弱智的弱智... ...",
      "title": "你们这群笨蛋需要意识到，克拉默不是你们的朋友，他是咕噜噜。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "聽着弱智們，克拉默不是你們的朋友，他也從來不是。他只是\n一個對沖基金的皮條客 渴望他們再給他一次機會。他是...\n咕嚕對WSB的佛羅多。\n\n你們這些醬油男孩的粉絲們都爲他在全國電視上提到WSB而鼓掌。\n是絕對的弱智的弱智... ...",
      "title": "你們這羣笨蛋需要意識到，克拉默不是你們的朋友，他是咕嚕嚕。"
    }
  ],
  "title": "You dipshits need to realize that Cramer is not your friend, he is Gollum",
  "created_utc": 1611003950,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Listen up retards, Cramer is not your friend and he never was. He is nothing but a hedge fund gimp hungry for them to plow his ass one more time. He is the Gollum to WSBs Frodo.</p>\n\n<p>All of you soy boys fan girling over him mentioning WSB on national television are the absolute retards of the retards here. What has he ever done in support of the sub? He talked shit about PLTR, relentlessly shilled TSLA, and now the gimp man himself is bashing GME. </p>\n\n<p>The dude even called GME HQ in an attempt to persuade them into doing an offering to COMPLETELY LET THE SHORTS OFF THE HOOK. You would have to be an absolute moron to not see the writing on the wall. Cramer is an absolute Judas and should be treated as such. </p>\n\n<p>Not to mention he attempted to manipulate all of us into selling out with his congratulations/victory bullshit about the short squeeze and how it had been accomplished, which implies that he truly believes we are too stupid to check the current short interest on GME through other means. </p>\n\n<p>Additionally, if you have been actually paying attention  to what he’s saying about WSB instead of jerking off to him and his boy toy every night on CNBC you would realize that we are being set up to get taken down. The story of GME is being morphed into an orchestrated effort by WSB to burn the shorts, thus painting us as a market manipulating internet chat room (goddamn I hate boomer speak) rather than a bunch of tards that saw the value in GME and invested. On top of that, the media coverage that gimpy has brought to us has led to numerous other articles discussing how WSB is responsible for the current (and undeniable) bubble that’s forming in the market</p>\n\n<p>Cramer is a shill. He will always be a shill. He is the worthless ass puppet of Wall Street hedge funds and should be treated as the whore of a cum dumpster he is. Those of you who have bought into his bullshit will be manipulated, and many of you already have been. If you believed in him as your savior, you probably already sold out because “the squeeze is over” and GME is “inherently a POS” haven’t you?</p>\n\n<p>Read between the lines. He has betrayed us, and may have started us on the path towards our eventual demise.</p>\n</div><!-- SC_ON -->",
  "score": 18524,
  "permalink": "/r/wallstreetbets/comments/l01542/you_dipshits_need_to_realize_that_cramer_is_not/",
  "subreddit": "wallstreetbets",
  "id": "l01542",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1611311226483
}