{
  "author": "jacksepticgranny",
  "original_created_utc": 1626624181,
  "title": "How can a person stop touching themselves (inappropriately) ?",
  "created_utc": 1626631169,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I M19 masturbate 2 times a day. And I&#39;m ashamed of it. Nowadays I only do it at evening in bed and sometimes when I wake up. </p>\n\n<p>I got down from 9-4 times to 2 times so that&#39;s already good, but how can some people only do it &#39;a few times a week&#39; HOW??</p>\n\n<p>And how can I stop finding random stranger so fcking sexy? I see people on the street/school (all are 18+ no weird sh!t) but why and how do I find people sexy and hot now. now that it shouldn&#39;t matter anymore.</p>\n</div><!-- SC_ON -->",
  "score": 142,
  "permalink": "/r/TooAfraidToAsk/comments/omtcre/how_can_a_person_stop_touching_themselves/",
  "subreddit": "TooAfraidToAsk",
  "id": "omtcre",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I M19 masturbate 2 times a day. And I'm ashamed of it. Nowadays I only do it at\nevening in bed and sometimes when I wake up.\n\nI got down from 9-4 times to 2 times so that's already good, but how can some\npeople only do it 'a few times a week' HOW??\n\nAnd how can I stop finding random stranger so…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "M19 1日2回のオナニーをしています。それが恥ずかしいんです。最近では、夜寝るときと、たまに起きるときにしかしません。\n最近は夜寝るときと、起きたときにしかしません。\n\n9-4回から2回に減ったのはいいのですが、「週に数回」しかしない人がいるのはなぜ？\nしかし、「週に数回」しかしない人もいるなんて、どうなんでしょう？\n\nそして、どうしたら見知らぬ人を見つけるのをやめることができるのでしょうか...。",
      "title": "どうしたら自分の体に触れることをやめられるのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我每天都会自慰2次。而且我为此感到羞耻。现在我只在\n晚上在床上做，有时在我醒来时做。\n\n我从9-4次下降到2次，所以这已经很好了，但有些人怎么可能\n但有些人怎么能只做 \"一周几次 \"呢？\n\n我怎样才能不随便找陌生人，所以...",
      "title": "一个人如何才能停止触摸自己（不适当的）？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我每天都會自慰2次。而且我爲此感到羞恥。現在我只在\n晚上在牀上做，有時在我醒來時做。\n\n我從9-4次下降到2次，所以這已經很好了，但有些人怎麼可能\n但有些人怎麼能只做 \"一週幾次 \"呢？\n\n我怎樣才能不隨便找陌生人，所以...",
      "title": "一個人如何才能停止觸摸自己（不適當的）？"
    }
  ]
}