{
  "author": "RusticBohemian",
  "original_created_utc": 1636898987,
  "title": "The \"maritime city-state with imperial ambitions\" model seemed to be a winning strategy, at least in the medium term. Athens, Venice, Genoa, Pisa — they all grew prosperous and dominated overseas, but failed to hold their own hinterlands. How and why did this model work?",
  "created_utc": 1636938268,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;m fascinated by the idea of small city-states being able to punch far above their weight class, but mostly overseas. They had a far harder time dominating their own &quot;countries.&quot; Athens couldn&#39;t conquer the mainland Greek states, and Venice, Genoa, Pisa, etc, did poorly when they tried to dominate the other Italian city-states. </p>\n\n<p>Part of the picture is clear — they had plenty of money from trade, which gave them resources they could use to conquer overseas territories. </p>\n\n<p>But Look at Pisa, as an example. Pisa&#39;s fleet and army made conquests on Sicily Northern Africa, Sardinia, and the Balearic Islands, feats of logistics and manpower that even major powers like the Byzantines and Romans had failed at. Many of these places had strongly placed defenders and considerable resources. Why were the Pisans able to defeat them with relative ease, but they could make no inroads in Italy proper?</p>\n\n<p>More broadly, why did this model work to an extent, but never really allowed the city-states to become larger empires?</p>\n\n<p>_______________-<br/>\nI could add Carthage to the list, but they seemed to hold a lot of territory in Africa, which perhaps makes them more of an empire with lots of overseas holdings and strong fleet/merchant marine rather than a &quot;maritime city-state with imperial ambitions.&quot;</p>\n</div><!-- SC_ON -->",
  "score": 107,
  "permalink": "/r/AskHistorians/comments/qtqknf/the_maritime_citystate_with_imperial_ambitions/",
  "subreddit": "AskHistorians",
  "id": "qtqknf",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I'm fascinated by the idea of small city-states being able to punch far above\ntheir weight class, but mostly overseas. They had a far harder time dominating\ntheir own \"countries.\" Athens couldn't conquer the mainland Greek states, and\nVenice, Genoa, Pisa, etc, did poorly when they tried to dominate…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は、小さな都市国家が自分の体重よりもはるかに大きな力を発揮するというアイデアに魅了されています。\n主に海外での活動ですが。自分たちの国を支配することは、はるかに困難でした。\n自分たちの \"国 \"を支配することははるかに困難でした。アテネはギリシャ本土を征服することはできませんでしたし\nヴェネツィア、ジェノバ、ピサなどは支配しようとしてもうまくいかなかった...。",
      "title": "帝国的野心を持つ海洋都市国家」というモデルは、少なくとも中期的には勝利の戦略であるように思われた。アテネ、ヴェネツィア、ジェノバ、ピサ......いずれも繁栄して海外を支配しましたが、自国のヒンターランドを保持することはできませんでした。このモデルはどのように、そしてなぜうまくいったのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我对小城邦能够远超其重量级的想法很着迷。\n但主要是在海外。他们更难支配\n自己的 \"国家\"。雅典无法征服希腊大陆的国家，而\n威尼斯、热那亚、比萨等国在试图统治时表现不佳......",
      "title": "至少从中期来看，\"具有帝国野心的海上城邦 \"模式似乎是一种成功的策略。雅典、威尼斯、热那亚、比萨--它们都在海外获得了繁荣和统治地位，但却没能守住自己的腹地。这种模式是如何以及为什么成功的？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我對小城邦能夠遠超其重量級的想法很着迷。\n但主要是在海外。他們更難支配\n自己的 \"國家\"。雅典無法征服希臘大陸的國家，而\n威尼斯、熱那亞、比薩等國在試圖統治時表現不佳......",
      "title": "至少從中期來看，\"具有帝國野心的海上城邦 \"模式似乎是一種成功的策略。雅典、威尼斯、熱那亞、比薩--它們都在海外獲得了繁榮和統治地位，但卻沒能守住自己的腹地。這種模式是如何以及爲什麼成功的？"
    }
  ]
}