{
  "author": "dreadful_name",
  "original_created_utc": 1657403481,
  "title": "My great-grandad was a monolingual Welsh speaker until adulthood when he became a sailor. He refused to teach any of his children Welsh given the limiting effect he felt it had on his career. How common a viewpoint was this? And how limiting would not speaking English have been for him growing up?",
  "created_utc": 1657432197,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;For some context, I don’t know exactly when he was born as I never met him. But he was old enough to have been an adult when he helped firefighters after the San Francisco ‘big one’ earthquake in 1906. He lived until the late 60s I think but I could be wrong.&lt;/p&gt;\n\n&lt;p&gt;He didn’t settle in California though and returned to Liverpool where lots of other family members had left Anglesey (where he grew up).&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 104,
  "permalink": "/r/AskHistorians/comments/vvc34q/my_greatgrandad_was_a_monolingual_welsh_speaker/",
  "subreddit": "AskHistorians",
  "id": "vvc34q",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "For some context, I don’t know exactly when he was born as I never met him. But\nhe was old enough to have been an adult when he helped firefighters after the\nSan Francisco ‘big one’ earthquake in 1906. He lived until the late 60s I think\nbut I could be wrong.\n\nHe didn’t settle in California though…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "事情があって、会ったことがないので、いつ生まれたか正確にはわかりません。しかし\n1906年のサンフランシスコ大地震のとき、消防士を手伝ったのは大人になってからだった。\n1906年のサンフランシスコ大地震のとき、消防士を手伝ったとき、彼は大人になっていた。彼は60歳代後半まで生きていたと思う。\nでも、間違っているかもしれない。\n\nでも、彼はカリフォルニアに定住したわけではないんだ......。",
      "title": "私の曾祖父は、船乗りになる成人までウェールズ語のモノリンガルでした。彼は、ウェールズ語が自分のキャリアに影響を及ぼすと考え、子供たちにウェールズ語を教えることを拒みました。このような考え方は、一般的なものだったのだろうか。また、英語を話せないということは、彼にとってどれほどの制約になるのでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "对于一些背景，我不知道他到底是什么时候出生的，因为我从未见过他。但是\n他在1906年旧金山 \"大地震 \"后帮助消防员时，已经大到足以成为一个成年人。\n1906年旧金山 \"大地震 \"后，他帮助消防员时，他的年龄足以成为成年人。我想他一直活到60年代末\n但我可能是错的。\n\n但他并没有在加利福尼亚定居......",
      "title": "我的曾祖父在成年之前一直是讲威尔士语的单语者，后来他成为一名水手。他拒绝教他的任何孩子学习威尔士语，因为他觉得这对他的事业有限制性影响。这种观点有多普遍？不说英语对他的成长会有多大的限制？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "對於一些背景，我不知道他到底是什麼時候出生的，因爲我從未見過他。但是\n他在1906年舊金山 \"大地震 \"後幫助消防員時，已經大到足以成爲一個成年人。\n1906年舊金山 \"大地震 \"後，他幫助消防員時，他的年齡足以成爲成年人。我想他一直活到60年代末\n但我可能是錯的。\n\n但他並沒有在加利福尼亞定居......",
      "title": "我的曾祖父在成年之前一直是講威爾士語的單語者，後來他成爲一名水手。他拒絕教他的任何孩子學習威爾士語，因爲他覺得這對他的事業有限制性影響。這種觀點有多普遍？不說英語對他的成長會有多大的限制？"
    }
  ]
}