{
  "author": "AskScienceModerator",
  "original_created_utc": 1657882822,
  "title": "AskScience AMA Series: We are Cosmologists, Experts on the Cosmic Microwave Background, The Cosmic Web, Dark Matter, Dark Energy and much more! Ask Us Anything!",
  "created_utc": 1657892405,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;We are a bunch of cosmology researchers from the Cosmology from Home 2022 conference. Ask us anything, from our daily research to the organization of a large, innovative and successful online conference!&lt;/p&gt;\n\n&lt;p&gt;We have some special experts on:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;Inflation: The mind-bogglingly fast expansion of the Universe in a fraction of the first second. It turned tiny quantum fluctuation into the seeds for the galaxies and clusters we see today&lt;/li&gt;\n&lt;li&gt;The Cosmic Microwave Background: The radiation reaching us from a few hundred thousand years after the Big Bang. It shows us how our universe was like, 13.8 billion years ago&lt;/li&gt;\n&lt;li&gt;Large-Scale Structure: Matter in the Universe forms a &amp;quot;cosmic web&amp;quot; with clusters, filaments and voids. The positions of galaxies in the sky shows imprints of the physics in the early universe&lt;/li&gt;\n&lt;li&gt;Dark Matter: Most matter in the universe seems to be &amp;quot;Dark Matter&amp;quot;, i.e. not noticeable through any means except for its effect on light and other matter via gravity&lt;/li&gt;\n&lt;li&gt;Dark Energy: The unknown force causing the universe&amp;#39;s expansion to accelerate today&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;And ask anything else you want to know!&lt;/p&gt;\n\n&lt;p&gt;Those of us answering your questions tonight will include&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;Shaun Hotchkiss: &lt;a href=\"/u/just_shaun\"&gt;u/just_shaun&lt;/a&gt; large scale structure, fuzzy dark matter, compact objects in the early universe, inflation. Twitter: @just_shaun&lt;/li&gt;\n&lt;li&gt;Ali Rida Khalife: &lt;a href=\"/u/A-R-Khalifeh\"&gt;u/A-R-Khalifeh&lt;/a&gt; Dark Energy, Neutrinos, Neutrinos in the curved universe&lt;/li&gt;\n&lt;li&gt;Benjamin Wallisch: &lt;a href=\"/u/cosmo-ben\"&gt;u/cosmo-ben&lt;/a&gt; Neutrinos, dark matter, cosmological probes of particle physics, early universe, probes of inflation, cosmic microwave background, large-scale structure of the universe.&lt;/li&gt;\n&lt;li&gt;Niko Sarcevic: &lt;a href=\"/u/NikoSarcevic\"&gt;u/NikoSarcevic&lt;/a&gt; cosmology (lss, weak lensing), astrophysics, noble gas detectors&lt;/li&gt;\n&lt;li&gt;Neil Shah: &lt;a href=\"/u/neildymium\"&gt;/u/neildymium&lt;/a&gt; Stochastic Inflation, Dark Matter, Modified Gravity, Machine Learning, Cosmic Strings&lt;/li&gt;\n&lt;li&gt;Ryan Turner: &lt;a href=\"/u/cosmo-ryan\"&gt;/u/cosmo-ryan&lt;/a&gt; Large-scale structure, peculiar velocities, Hubble constant&lt;/li&gt;\n&lt;li&gt;Sanket Dave: &lt;a href=\"/u/sanket_dave_15\"&gt;/u/sanket_dave_15&lt;/a&gt; Early Universe Physics, Cosmic Inflation, Primordial black hole formation.&lt;/li&gt;\n&lt;li&gt;Matthijs van der Wild: &lt;a href=\"/u/matthijsvanderwild\"&gt;u/matthijsvanderwild&lt;/a&gt; quantum gravity, quantum cosmology, inflation, modified gravity&lt;/li&gt;\n&lt;li&gt;Luz Ángela García: &lt;a href=\"/u/Astro_Lua\"&gt;u/Astro_Lua&lt;/a&gt; dark energy, reionization, early Universe. Twitter: @PenLua.&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;We&amp;#39;ll start answering questions from 18:00 GMT/UTC on Friday (11pm PDT, 2pm EDT, 7pm BST, 8pm CEST) as well as live streaming our discussion of our answers via &lt;a href=\"https://www.youtube.com/watch?v=ORWs4-WmyiM\"&gt;YouTube&lt;/a&gt; (also starting 18:00 UTC). Looking forward to your questions, ask us anything!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 130,
  "permalink": "/r/askscience/comments/vzlvs8/askscience_ama_series_we_are_cosmologists_experts/",
  "subreddit": "askscience",
  "id": "vzlvs8",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "We are a bunch of cosmology researchers from the Cosmology from Home 2022\nconference. Ask us anything, from our daily research to the organization of a\nlarge, innovative and successful online conference!\n\nWe have some special experts on:\n\n * Inflation: The mind-bogglingly fast expansion of the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私たちは、「うちからコスモロジー2022」の宇宙論研究者の集まりです。\nの宇宙論研究者の集まりです。日頃の研究内容から、会議の運営まで、何でも聞いてください。\n私たちの日々の研究から、大規模で革新的で成功したオンライン会議の運営まで、何でも聞いてください。\n\n私たちには、以下のような特別な専門家がいます。\n\n * インフレーション。インフレ：インフレのスピードは驚異的です。",
      "title": "AskScience AMAシリーズ。私たちは宇宙論者であり、宇宙マイクロ波背景、宇宙ウェブ、ダークマター、ダークエネルギー、その他多くの専門家です。何でも聞いてください"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我们是一群来自家门口的宇宙学研究者，2022年的宇宙学。\n会议。问我们任何问题，从我们的日常研究到组织一个\n从我们的日常研究到组织一个大型的、创新的和成功的在线会议，都可以问我们\n\n我们有一些特别的专家。\n\n * 膨胀。令人匪夷所思的快速扩张的...",
      "title": "AskScience AMA系列。我们是宇宙学家，是宇宙微波背景、宇宙网、暗物质、暗能量等方面的专家! 向我们提出任何问题!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我們是一羣來自家門口的宇宙學研究者，2022年的宇宙學。\n會議。問我們任何問題，從我們的日常研究到組織一個\n從我們的日常研究到組織一個大型的、創新的和成功的在線會議，都可以問我們\n\n我們有一些特別的專家。\n\n * 膨脹。令人匪夷所思的快速擴張的...",
      "title": "AskScience AMA系列。我們是宇宙學家，是宇宙微波背景、宇宙網、暗物質、暗能量等方面的專家! 向我們提出任何問題!"
    }
  ]
}