{
  "author": "take_eacy",
  "original_created_utc": 1624403717,
  "title": "What it felt like buying the bottom in 2018 and 2020: a fool's errand",
  "created_utc": 1624416031,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Seeing a bunch of posts brag about buying the dip as a sale or how we&#39;re getting close to the bottom, I wanted to share my &quot;veteran&quot; experience about how this is definitely not the bottom of a long bear market. It was pretty similar then - people were making up stories about how the dip after early 2018 was going to be short-lived and cited Chinese New Year, banker bonuses, etc. People talked about how they were loading up their bags while it was a &quot;fire sale&quot; and how this opportunity would never come around again. I was also buying in a lot before I started to DCA.</p>\n\n<p>&#x200B;</p>\n\n<p><strong>The dip that never stopped dipping</strong></p>\n\n<p>As my bags got heavier, people stopped talking so much, and it soon felt like no one was posting at all. This was months after the suicide hotline was posted; it was months after people were done showing off loss porn. Following my plan to DCA became extremely painful; I was wondering if I was just throwing my money away. How could it possibly go lower? Was crypto totally over? It seemed like the big banks had won, and we were just bag holders (certain true for some shitcoins).</p>\n\n<p>&#x200B;</p>\n\n<p><strong>2018</strong></p>\n\n<p>At the bottom in 2018 when Ethereum was $86, I was still DCA-ing but got lazier about it. I didn&#39;t follow my investment plan as religiously as I did when it was in the $500s. At this point, I was only putting in lunch money, and I wondered if it was even worth it. Why put in money when Ethereum (I was an ETH maxi) was probably going to fall to it&#39;s prior sub$10 prices? Was crypto even worth anything?  I&#39; was honestly thinking the money would be better spent on a couple of beers.</p>\n\n<p>Fuck it, I threw in some beer money as well and figured it was like playing the Lotto. Put in a few bucks for fun and expect nothing back.</p>\n\n<p>&#x200B;</p>\n\n<p><strong>2020</strong></p>\n\n<p>The market came up from then, but I was still expecting it to go lower until it never did. ETH retested $300 a few times, but I thought crypto was pretty much over. It seemed like a pipe dream that crypto would ever hit its prior peaks. Just when it started to approach $300 in early 2020, COVID hit.</p>\n\n<p>Y&#39;all know what that felt like. No one cared at first until we were all wondering if the world was ending. Markets were selling out of pantry food, toilet paper, and masks. No one gave a fuck about investing money into crypto; it seemed like the US economy was going to go belly up anyways. All assets were dropping. Again, to put in money, I felt like I should have saved it for the zombie apocalypse, but I figured everything was going down like TITAN and the Titanic, so fuck it. I put in some beer money and hoped that if we all made it out of this, I hoped that ETH would double or triple from the ~$110 dollar low.</p>\n\n<p>&#x200B;</p>\n\n<p><strong>Conclusions; tldr</strong></p>\n\n<p>So that is to say, while people are yapping and yelling, it&#39;s not rock bottom yet. The absolute bottom will come at a point when it&#39;s quiet, when everyone has moved on, and when it seemed like crypto was just a passing joke. To make clear my position, I believe DCA-ing is the way to go; all I&#39;m saying is that we&#39;re not at the absolute bottom - don&#39;t dump everything in now thinking that this is the bottom. </p>\n\n<p>&#x200B;</p>\n\n<p>So that&#39;s my veteran experience, but don&#39;t ask me about how I did on the way up lol. I unloaded too much around ETH $300 and then at the 2018 high price. That&#39;s another experience I&#39;m still learning about</p>\n\n<p>Disclaimer: This is not financial advice and is merely a perspective on the market</p>\n</div><!-- SC_ON -->",
  "score": 279,
  "permalink": "/r/CryptoCurrency/comments/o5zxmo/what_it_felt_like_buying_the_bottom_in_2018_and/",
  "subreddit": "CryptoCurrency",
  "id": "o5zxmo",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Seeing a bunch of posts brag about buying the dip as a sale or how we're getting\nclose to the bottom, I wanted to share my \"veteran\" experience about how this is\ndefinitely not the bottom of a long bear market. It was pretty similar then -\npeople were making up stories about how the dip after early…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ディップをセールで買ったとか、底値に近づいているとか、自慢げに書いている記事が多いので\n私の「ベテラン」としての経験から、これは間違いなく長い弱気市場の底ではないということをお伝えしたいと思います。\nこれが長い弱気市場の底ではないことは間違いありません。当時も似たようなものでした。\n序盤のディップは...という話をみんなが作っていました。",
      "title": "2018年と2020年に底値を買って感じたこと：愚直なまでの努力"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "看到很多帖子都在吹嘘把下跌当作销售来买，或者我们如何接近底部。\n我想分享我的 \"老手 \"经验，说明这绝对不是长期熊市的底部。\n绝对不是长期熊市的底部。\n\n人们在编造故事，说早些时候的下跌是怎样的...",
      "title": "2018年和2020年买入底部的感觉：傻傻分不清楚"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "看到很多帖子都在吹噓把下跌當作銷售來買，或者我們如何接近底部。\n我想分享我的 \"老手 \"經驗，說明這絕對不是長期熊市的底部。\n絕對不是長期熊市的底部。\n\n人們在編造故事，說早些時候的下跌是怎樣的...",
      "title": "2018年和2020年買入底部的感覺：傻傻分不清楚"
    }
  ]
}