{
  "author": "eragonisdragon",
  "original_created_utc": 1650859846,
  "title": "When and why did Christians, Catholics in particular, begin believing that human life begins at conception?",
  "created_utc": 1650893891,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Apologies if this has been asked before, but I searched and only found one unanswered post.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s my understanding that the idea of life beginning at conception is a relatively recent one, especially since until recently, no one even really knew exactly what conceiving a child actually meant, in the sense of a sperm cell merging with an egg, which develops into a fetus. According to &lt;a href=\"http://www.thechristianleftblog.org/blog-home/the-bible-tells-us-when-a-fetus-becomes-a-living-being?fbclid=IwAR1Uwof9d-xJ-2uybDcQRlSMac-xqDVpAacTY2tk9GgvU7YOGqt9ZyrIZLY\"&gt;this article,&lt;/a&gt; the bible only mentions a human soul entering their body when the child draws its first breath, which would suggest that babies weren&amp;#39;t even fully considered human until they were born. It also mentions verses where a woman is explicitly given an abortion remedy, which is framed as a good thing. As well, &lt;a href=\"https://origins.osu.edu/history-news/abortion-history-and-beginning-life?language_content_entity=en\"&gt;this article&lt;/a&gt; talks about how Christians in medieval times had complex and fluid views on abortion, but never considered it to be murder, exactly, with some venerated saints even having supposedly performed miraculous abortions.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m aware that until a few decades ago, the question of abortion was called the &amp;quot;Catholic problem,&amp;quot; as protestants didn&amp;#39;t really have firm views on it even then, but my question, I guess, is when did even the Catholics start preaching against abortion, and when did they propose the idea of life beginning at conception, and with what evidence and/or reason?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 105,
  "permalink": "/r/AskHistorians/comments/ubcfj4/when_and_why_did_christians_catholics_in/",
  "subreddit": "AskHistorians",
  "id": "ubcfj4",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Apologies if this has been asked before, but I searched and only found one\nunanswered post.\n\nIt's my understanding that the idea of life beginning at conception is a\nrelatively recent one, especially since until recently, no one even really knew\nexactly what conceiving a child actually meant, in…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "以前にも質問されていたら申し訳ないのですが、検索しても1つしか見つかりませんでした。\nを見つけました。\n\n受胎から人生が始まるという考え方は、比較的最近のものだと理解しています。\n特に最近まで、子供を妊娠することが実際に何を意味するのか、誰も知らなかったので、比較的最近のものです。\n特に最近まで、子供を妊娠することが実際に何を意味するのか、誰も正確には知りませんでした。",
      "title": "キリスト教、特にカトリックでは、いつから、なぜ、人の命は受胎から始まると考えるようになったのでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "如果以前有人问过这个问题，请原谅，但我搜索了一下，只找到一个\n未回答的帖子。\n\n我的理解是，生命从受孕开始的概念是一个相对较新的概念。\n尤其是直到最近，甚至没有人真正知道\n确切地说，怀上孩子意味着什么，在...",
      "title": "基督徒，特别是天主教徒，何时以及为何开始相信人的生命从受孕开始？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "如果以前有人問過這個問題，請原諒，但我搜索了一下，只找到一個\n未回答的帖子。\n\n我的理解是，生命從受孕開始的概念是一個相對較新的概念。\n尤其是直到最近，甚至沒有人真正知道\n確切地說，懷上孩子意味着什麼，在...",
      "title": "基督徒，特別是天主教徒，何時以及爲何開始相信人的生命從受孕開始？"
    }
  ]
}