{
  "author": "Wolf_Of_1337_Street",
  "the_new_excerpt": "> Today, we reveal how Clover Health and its Wall Street celebrity promoter,\n> Chamath Palihapitiya, misled investors about critical aspects of Clover’s\n> business in the run-up to the company’s SPAC go-public transaction last month.\n> \n> Our investigation into Clover Health has spanned almost 4…",
  "original_created_utc": 1612447593,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "> 今天，我们就来揭秘一下三叶草健康公司及其华尔街名人发起人是如何。\n> Chamath Palihapitiya，在Clover的关键方面误导了投资者。\n在上个月该公司SPAC上市交易的运行过程中，>业务。\n> \n> 我们对科洛弗健康的调查已经跨越了近4...",
      "title": "兴登堡研究 - Clover Health: \"SPACs之王 \"如何引诱散户投资者进入一个面临司法部积极调查的破产企业？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "> 今天，我們就來揭祕一下三葉草健康公司及其華爾街名人發起人是如何。\n> Chamath Palihapitiya，在Clover的關鍵方面誤導了投資者。\n在上個月該公司SPAC上市交易的運行過程中，>業務。\n> \n> 我們對科洛弗健康的調查已經跨越了近4...",
      "title": "興登堡研究 - Clover Health: \"SPACs之王 \"如何引誘散戶投資者進入一個面臨司法部積極調查的破產企業？"
    }
  ],
  "title": "Hindenburg Research - Clover Health: How the “King of SPACs” Lured Retail Investors Into a Broken Business Facing an Active, Undisclosed DOJ Investigation",
  "created_utc": 1612453334,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><blockquote>\n<p>Today, we reveal how Clover Health and its Wall Street celebrity promoter, Chamath Palihapitiya, misled investors about critical aspects of Clover’s business in the run-up to the company’s SPAC go-public transaction last month.</p>\n\n<p>Our investigation into Clover Health has spanned almost 4 months and has included more than a dozen interviews with former employees, competitors, and industry experts, dozens of calls to doctor’s offices, and a review of thousands of pages of government reports, insurance filings, regulatory filings, and company marketing materials.</p>\n\n<p>Critically, Clover has not disclosed that its business model and its software offering, called the Clover Assistant, are under active investigation by the Department of Justice (DOJ), which is investigating at least 12 issues ranging from kickbacks to marketing practices to undisclosed third-party deals, according to a Civil Investigative Demand (similar to a subpoena) we obtained.</p>\n</blockquote>\n\n<p><a href=\"https://hindenburgresearch.com/clover/\">https://hindenburgresearch.com/clover/</a></p>\n\n<p><a href=\"https://twitter.com/HindenburgRes/status/1357317294473547777\">https://twitter.com/HindenburgRes/status/1357317294473547777</a></p>\n</div><!-- SC_ON -->",
  "score": 126,
  "permalink": "/r/investing/comments/lcgcm3/hindenburg_research_clover_health_how_the_king_of/",
  "subreddit": "investing",
  "id": "lcgcm3",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613123198800
}