{
  "author": "satorsquarepants",
  "original_created_utc": 1647610900,
  "title": "Philosophers who were the \"village idiot\"?",
  "created_utc": 1647656652,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So while being rather different in their philosophies, I&amp;#39;ve always seen a similarity between Diogenes and Thoreau in that they were the &amp;quot;village eccentric&amp;quot; in a way, living within a community that seemed both amused and bewildered by their behavior. I&amp;#39;ve always found this rather funny, and a refreshing change from the idea of a philosopher who lives tucked away in the confines of academia or surrounded by intellectuals. Are there any other philosophers who lived very much among the &amp;quot;common man&amp;quot;, in a more traditional community setting?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 105,
  "permalink": "/r/askphilosophy/comments/th1lo8/philosophers_who_were_the_village_idiot/",
  "subreddit": "askphilosophy",
  "id": "th1lo8",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "So while being rather different in their philosophies, I've always seen a\nsimilarity between Diogenes and Thoreau in that they were the \"village\neccentric\" in a way, living within a community that seemed both amused and\nbewildered by their behavior. I've always found this rather funny, and…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "だから、思想は違うけれども、私はいつも、この二人に共感しているんです。\nディオゲネスとソローの共通点は、彼らが「村人」であったことです。\nある意味「変人」であり、面白くもあり、また面白くもある共同体の中で生きている。\nその行動に困惑している。私はいつもこれを面白いと思っていますし、...",
      "title": "村八分」だった哲学者たち？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "因此，虽然他们的哲学相当不同，但我一直认为第欧根尼和梭罗之间有一个相似之处。\n我一直认为第欧根尼和梭罗之间有一个相似之处，那就是他们都是 \"乡村怪人\"。\n在某种程度上，他们是 \"村里的怪人\"，生活在一个对他们的行为既感到有趣又感到困惑的社区里。\n对他们的行为感到迷惑不解。我一直觉得这相当有趣，而且...",
      "title": "哲学家们谁是 \"乡村白痴\"？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "因此，雖然他們的哲學相當不同，但我一直認爲第歐根尼和梭羅之間有一個相似之處。\n我一直認爲第歐根尼和梭羅之間有一個相似之處，那就是他們都是 \"鄉村怪人\"。\n在某種程度上，他們是 \"村裏的怪人\"，生活在一個對他們的行爲既感到有趣又感到困惑的社區裏。\n對他們的行爲感到迷惑不解。我一直覺得這相當有趣，而且...",
      "title": "哲學家們誰是 \"鄉村白癡\"？"
    }
  ]
}