{
  "author": "gnarley_quinn",
  "original_created_utc": 1633834890,
  "title": "I think my ex-wife tried to steal some of my crypto",
  "created_utc": 1633872641,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>My ex and I have a generally amicable setup. Picking up and dropping off the kids etc. Sometimes I might stay at hers for a chat, she might stay here for half an hour and we&#39;d talk about the kids etc. All in all, it seems fairly amicable. </p>\n\n<p>Anyway, a few days ago she was here to pick up the kids and I was outside in the garden. The kids were out with me riding their scooters. She asked if she could quickly use my computer to check something. Thinking nothing of it, I said sure. I was outside the whole time, and my phone was in my bedroom. About 20 minutes later, she and the kids left. </p>\n\n<p>Later that afternoon, I came inside for a dink and to check any messages. I didn&#39;t notice if my phone was in a slightly different place on the bed. But I did notice that there appeared to be some SMS authentications from Binance that had come through earlier. Panicked I ran to the computer to check on my accounts concerned I may have been hacked. Was someone trying to gain access, shit.</p>\n\n<p>After checking everything, Binance, metamaks, crypto, coinbase, etc... Relief poured over me when I learned that all my assets were still in place on my various wallets and exchanges. I&#39;m fortunate to be fairly competent with security. Aside from phone 2FA, I also have email authorisations, Google Authenticator, <em>very</em> long and unique passwords and a Yubikey.  It hadn&#39;t occurred to me that a lot of these could be relatively easily usurped from within my own home. </p>\n\n<p>I don&#39;t know of anyway to track use of Google Authenticator. There was nothing in my emails, but that doesn&#39;t mean they weren&#39;t sent and deleted. I don&#39;t have any evidence aside from what I&#39;ve described above that it was her, it could have been someone external of course. </p>\n\n<p>Even days later, I&#39;m still a little freaked out. I&#39;m still unsure how to proceed. Haven&#39;t mentioned this to anyone yet.  I guess the moral is that the more secure your accounts the better, but its possible that your next hacker may not be a total stranger.</p>\n</div><!-- SC_ON -->",
  "score": 157,
  "permalink": "/r/CryptoCurrency/comments/q4ztxo/i_think_my_exwife_tried_to_steal_some_of_my_crypto/",
  "subreddit": "CryptoCurrency",
  "id": "q4ztxo",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "My ex and I have a generally amicable setup. Picking up and dropping off the\nkids etc. Sometimes I might stay at hers for a chat, she might stay here for\nhalf an hour and we'd talk about the kids etc. All in all, it seems fairly\namicable.\n\nAnyway, a few days ago she was here to pick up the kids and…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "元彼とはおおむね円満な設定になっています。の送迎をしています。\n子供の送迎など。時々、私は彼女の家に泊まって話をしたり、彼女はここに30分ほど滞在したりします。\n30分ほど滞在して、子供のことなどを話します。全体的に見て、それはかなり\n友好的です。\n\nとにかく、数日前、彼女は子供たちを迎えに来て、そして...",
      "title": "元妻が私の暗号の一部を盗もうとしたようです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我的前妻和我有一个总体上友好的设置。接送孩子\n孩子等等。有时我可能会留在她家聊天，她可能会在这里呆上半小时。\n半个小时，我们会谈谈孩子们的事情等等。总而言之，这看起来相当\n睦。\n\n总之，几天前，她来这里接孩子，然后......",
      "title": "我想我的前妻试图偷我的一些加密货币"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我的前妻和我有一個總體上友好的設置。接送孩子\n孩子等等。有時我可能會留在她家聊天，她可能會在這裏呆上半小時。\n半個小時，我們會談談孩子們的事情等等。總而言之，這看起來相當\n睦。\n\n總之，幾天前，她來這裏接孩子，然後......",
      "title": "我想我的前妻試圖偷我的一些加密貨幣"
    }
  ]
}