{
  "author": "slvbtc",
  "original_created_utc": 1639621296,
  "title": "This is the real flippening",
  "created_utc": 1639636395,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;People have always said your bitcoin gains are unrealised until you &amp;quot;cash out&amp;quot; into fiat. But one day soon people will realise the bitcoin world is far safer than the traditional financial system. Its at that point people in the fiat world will need to &amp;quot;cash out&amp;quot; into bitcoin just to protect their money from inflation and bank failures.&lt;/p&gt;\n\n&lt;p&gt;The real flippening is when people stop cashing out from bitcoin to fiat to lock in wealth, and start cashing out of fiat and into bitcoin to lock in wealth.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 169,
  "permalink": "/r/Bitcoin/comments/rhg0bi/this_is_the_real_flippening/",
  "subreddit": "Bitcoin",
  "id": "rhg0bi",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "People have always said your bitcoin gains are unrealised until you \"cash out\"\ninto fiat. But one day soon people will realise the bitcoin world is far safer\nthan the traditional financial system. Its at that point people in the fiat\nworld will need to \"cash out\" into bitcoin just to protect their…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ビットコインの利益は、「キャッシュアウト」するまで含み損になると言われてきました。\nフィアット（不換紙幣）へ。しかし、近い将来、人々はビットコインの世界がはるかに安全であることに気づくでしょう。\n従来の金融システムより その時、不換紙幣の人々は\nそのためには、ビットコインに「キャッシュアウト」する必要があります。",
      "title": "これが本当のノリ"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "人们总是说你的比特币收益是未实现的，直到你 \"套现 \"到法币中。\n兑现成法币。但很快有一天，人们会意识到比特币世界远比\n比传统金融系统安全得多。在那个时候，人们在法币\n的人将需要 \"套现 \"到比特币中，以保护他们的...",
      "title": "这就是真正的翻天覆地"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "人們總是說你的比特幣收益是未實現的，直到你 \"套現 \"到法幣中。\n兌現成法幣。但很快有一天，人們會意識到比特幣世界遠比\n比傳統金融系統安全得多。在那個時候，人們在法幣\n的人將需要 \"套現 \"到比特幣中，以保護他們的...",
      "title": "這就是真正的翻天覆地"
    }
  ]
}