{
  "author": "decopper",
  "original_created_utc": 1626005461,
  "title": "Experience in incesting matters",
  "created_utc": 1626014272,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Before I began investing, I read a lot about the market. Bear markets, bull markets, technical analysis and fundamental analysis were all on my reading list.</p>\n\n<p>I invested my money at a point I thought was good (mistake, I should&#39;ve DCA&#39;d) and let it sit.</p>\n\n<p>I now see my mistake. But more importantly, I see why I learned from it. If I had put a smaller sum down, I would have learned the exact same lesson, but still had money to put in while the market moves sideways.</p>\n\n<p>My takeaway from this is that you should definitely DCA slowly if your a first year crypto investor. Trust this advice from somebody who bought at the top.</p>\n\n<p>Edit: What have I done</p>\n</div><!-- SC_ON -->",
  "score": 870,
  "permalink": "/r/CryptoCurrency/comments/oi3c2c/experience_in_incesting_matters/",
  "subreddit": "CryptoCurrency",
  "id": "oi3c2c",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Before I began investing, I read a lot about the market. Bear markets, bull\nmarkets, technical analysis and fundamental analysis were all on my reading\nlist.\n\nI invested my money at a point I thought was good (mistake, I should've DCA'd)\nand let it sit.\n\nI now see my mistake. But more importantly, I…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "投資を始める前に、市場についていろいろと読んでみました。弱気の市場、強気の市場、テクニカル分析、ファンダメンタル分析\n市場、テクニカル分析、ファンダメンタル分析など、すべてが私の読書リストに入っていました。\n読んでいました。\n\n良いと思ったポイントで資金を投入し（ミス、DCAを行うべきだった）、放置していました。\nそしてそれを放置しました。\n\n今になって自分の間違いがわかりました。しかし、もっと重要なことは、私は...",
      "title": "インセストーション問題の経験"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在我开始投资之前，我读了很多关于市场的文章。熊市、牛市\n市场，技术分析和基本面分析都在我的阅读清单上。\n列表。\n\n我在一个我认为不错的点上投资了我的钱（错了，我应该是DCA的）。\n并让它闲置。\n\n我现在看到了我的错误。但更重要的是，我...",
      "title": "乱伦事务方面的经验"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在我開始投資之前，我讀了很多關於市場的文章。熊市、牛市\n市場，技術分析和基本面分析都在我的閱讀清單上。\n列表。\n\n我在一個我認爲不錯的點上投資了我的錢（錯了，我應該是DCA的）。\n並讓它閒置。\n\n我現在看到了我的錯誤。但更重要的是，我...",
      "title": "亂倫事務方面的經驗"
    }
  ]
}