{
  "author": "BlankProgram",
  "original_created_utc": 1625936428,
  "title": "Why were people not supposed to interact with GDR authorities when crossing from West Germany to West Berlin?",
  "created_utc": 1625993610,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I was recently watching a video meant for British travellers travelling by car from Helmstedt to Berlin across East Germany. The video generally explains the procedure for crossing the Soviet and Alied checkpoints and what you should do in between, but something I found interesting was the repeated insistence throughout the entire video that you should not interact with GDR police or authorities in any way at all. They stress several times that if you are stopped or if an accident or breakdown happens, you should wait for either allied assistance or a Soviet soldier, but never under any circumstances to show any documents or provide any information to anyone representing the GDR. They even say you can pay road fines to Soviet officers but not GDR officers.</p>\n\n<p>My question is why is that? What was the effective difference between these two groups in the GDR? If the Soviets had the same (or greater) control, then why was there any difference between giving information to the Soviets vs giving information to the GDR?</p>\n\n<p>Thank you. This is the video in question: <a href=\"https://youtu.be/QS1xvtLV8Xw\">https://youtu.be/QS1xvtLV8Xw</a></p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/AskHistorians/comments/ohmfcd/why_were_people_not_supposed_to_interact_with_gdr/",
  "subreddit": "AskHistorians",
  "id": "ohmfcd",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I was recently watching a video meant for British travellers travelling by car\nfrom Helmstedt to Berlin across East Germany. The video generally explains the\nprocedure for crossing the Soviet and Alied checkpoints and what you should do\nin between, but something I found interesting was the repeated…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "最近、車で東ドイツをヘルムシュテットからベルリンまで移動するイギリス人旅行者向けのビデオを見ていました。\n東ドイツのヘルムシュテットからベルリンまで車で移動するイギリス人向けのビデオを見ました。このビデオでは、ソビエトとアリドの検問所を通過する際の手順や\nソビエトとアリドの検問所を通過する際の手順と、その間に何をすべきかを説明しています。\nしかし、私が興味深かったのは、繰り返し出てくる...",
      "title": "西ドイツから西ベルリンに移動する際に、ドイツ連邦政府の担当者と交流してはいけないとされていたのはなぜですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我最近在看一个视频，是为乘车旅行的英国人准备的\n从黑姆施泰特到柏林，穿越东德。该视频大致解释了\n该视频大致解释了通过苏联和Alied检查站的程序，以及你在两者之间应该做什么。\n但我发现一个有趣的现象，那就是反复...",
      "title": "为什么人们在从西德穿越到西柏林时不应该与东德当局互动？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我最近在看一個視頻，是爲乘車旅行的英國人準備的\n從黑姆施泰特到柏林，穿越東德。該視頻大致解釋了\n該視頻大致解釋了通過蘇聯和Alied檢查站的程序，以及你在兩者之間應該做什麼。\n但我發現一個有趣的現象，那就是反覆...",
      "title": "爲什麼人們在從西德穿越到西柏林時不應該與東德當局互動？"
    }
  ]
}