{
  "author": "BilldaCat10",
  "the_new_excerpt": "I wrote this post a month ago about how Tanger Outlets was a short squeeze\ntarget, got a lot of upvotes/links/etc:\n\nhttps://www.reddit.com/r/wallstreetbets/comments/l7g8a0/the_bullish_case_for_tanger_outlets_skt/\n\nMuch is the same, other posters have made other DD comments recently, the…",
  "original_created_utc": 1614816760,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我在一个月前写过这篇文章，说的是Tanger Outlets的短线挤压\n目标，得到了大量的upvotes/links/等。\n\nhttps://www.reddit.com/r/wallstreetbets/comments/l7g8a0/the_bullish_case_for_tanger_outlets_skt/\n\n很多都是一样的，最近其他发帖人也做了其他DD的评论，...",
      "title": "1个月后，Tanger Outlets的看涨案例。让我们来挖掘10-K! $SKT."
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我在一個月前寫過這篇文章，說的是Tanger Outlets的短線擠壓\n目標，得到了大量的upvotes/links/等。\n\nhttps://www.reddit.com/r/wallstreetbets/comments/l7g8a0/the_bullish_case_for_tanger_outlets_skt/\n\n很多都是一樣的，最近其他發帖人也做了其他DD的評論，...",
      "title": "1個月後，Tanger Outlets的看漲案例。讓我們來挖掘10-K! $SKT."
    }
  ],
  "title": "The bullish case for Tanger Outlets, 1 month later. Let's dig into the 10-K! $SKT.",
  "created_utc": 1614831623,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I wrote this post a month ago about how Tanger Outlets was a short squeeze target, got a lot of upvotes/links/etc:</p>\n\n<p><a href=\"https://www.reddit.com/r/wallstreetbets/comments/l7g8a0/the_bullish_case_for_tanger_outlets_skt/\">https://www.reddit.com/r/wallstreetbets/comments/l7g8a0/the_bullish_case_for_tanger_outlets_skt/</a></p>\n\n<p>Much is the same, other posters have made other DD comments recently, the short interest has been beaten to death, you can read about that elsewhere.  The annual report has come out since I last posted, and since I actually sit down and read 10-K&#39;s now (yes i am old), so I&#39;ll share my thoughts:</p>\n\n<p>Before I do that though, this guy from Seeking Alpha did the same, and has pretty graphs to go along with that.  I&#39;m not going to try to write out ascii charts here in reddit markdown, so here you go:  <a href=\"https://seekingalpha.com/article/4408746-s-official-tanger-survived-pandemic\">https://seekingalpha.com/article/4408746-s-official-tanger-survived-pandemic</a></p>\n\n<p>I&#39;m going to repeat some of the things he does, but here&#39;s my take on the 10-K (which you can read here:  <a href=\"http://d18rn0p25nwr6d.cloudfront.net/CIK-0000899715/cb76277e-f5f1-4304-9899-6e8259a30b10.pdf\">http://d18rn0p25nwr6d.cloudfront.net/CIK-0000899715/cb76277e-f5f1-4304-9899-6e8259a30b10.pdf</a>)</p>\n\n<p>Bullish case:</p>\n\n<ul>\n<li><p>99% of stores back open, 99% leased square footage.  Traffic levels back to 96%, 99% if you exclude Canada.  I live very near the Tanger Outlets in Rehoboth Beach, and it is PACKED, and tourist season hasn&#39;t even started here.  Nike and Crocs in particular always seem to have lines out the door.</p></li>\n<li><p>For those that don&#39;t know, these aren&#39;t just strip malls or outlets in middle America -- they choose vacation/tourist destinations, where when you take a week&#39;s vacation, &quot;going to the outlets&quot; is something you do on one of the days.  <em>I</em> don&#39;t do it, I hate shopping, but it&#39;s unquestionable this happens.</p></li>\n<li><p>Given that these outlets are in tourist destinations, this is generally high value real estate, which obviously has shot up in value.  The 10-K states that out of the 31 outlet centers they own, they own the land underlying in 25 of them, and ground leases on 6 -- the nearest lease expires in 2024 (Riverhead, NY) but they have a 15 year option on renewal.  Granted these types of real estate holdings are relatively illiquid, but the value gives them plenty of access to credit.</p></li>\n<li><p>Speaking of credit, their loans are at very low interest rates, and they have plenty of available credit on hand.  Given the worst has passed, and they&#39;ve already reinstated a dividend (though not fully back to what it was), there&#39;s really no risk here in regards to this.</p></li>\n<li><p>95% of 4th quarter rents collected, 1% deferred, 1% under negotiation, 1% concessions/lease restructuring, only 2% at risk due to bankruptcy of tenants/financial weakness.  The stores are open, paying on time, all is basically back to normal already.</p></li>\n<li><p>New CEO, Stephen Yalof, starts off 2021 -- came from Simon Property Group, which is <em>great</em> -- I&#39;ll get into that bit later.</p></li>\n</ul>\n\n<p>Bearish cases / danger signs:</p>\n\n<p>As the SA article said, Tanger gets 16% of their rent from 4 companies:</p>\n\n<ul>\n<li>The Gap (Gap, Banana Republic, Janie &amp; Jack, Old Navy)</li>\n<li>PVH Corp (Tommy Hilfiger, Van Heusen, Calvin Klein)</li>\n<li>Ascena Retail Group (LOFT, Ann Taylor, Lane Bryant, Justice)</li>\n<li>Under Armour (duh)</li>\n</ul>\n\n<p>While some of those have struggled, usually there are other stores in the portfolio picking up the slack.  GAP/Banana Republic isn&#39;t doing as well, but Old Navy has been crushing it, for instance.</p>\n\n<p>The risk is some of those companies don&#39;t bounce back as expected and enter bankruptcy.  Generally, the outlet stores though are the <em>last</em> to close.. random mall stores will be first, outlets will go out last.  I&#39;m not overly familiar with what&#39;s up and coming in new clothing stores / chains / etc, so this is where, for me, it gets a little nebulous.</p>\n\n<p>The base rent per square foot took a dive in 2020, but to be expected.  It was 21.10, 92% occupancy.  2019 was 97%, 25.35/sqft.  Going back further years, those #s are pretty steady -- 2016 was the best, 98%, 26.10/sqft.  So we have had some slippage, though pretty minor, from 2016-2019.  It&#39;s a question of what they can get 2021 sqft/occupancy levels back to and how quickly.</p>\n\n<hr/>\n\n<p>One thing that annoys me about Tanger Outlets though from an investor standpoint, is that restaurants are not a real part of the outlets they have.  The one by me has a Chipotle and a lol Applebee&#39;s, and that&#39;s basically it for food options.  </p>\n\n<p>Having more mid-tier sit down restaurants in the outlets, so people can come shop, eat, and then shop some more, is what I&#39;d like to see.  Given the new CEO comes from <a href=\"https://www.simon.com/\">Simon Property Group</a>, and they have more restaurants in their tenant list, I&#39;m hopeful that if there are vacancies, we&#39;ll see restaurants fill in the gap.</p>\n\n<p>Disclosures:</p>\n\n<p>I&#39;ve been long on Tanger for a while now, own 1100 shares of stock, and Jan 2022 20c and 30c options.  My intent is to hold onto the shares for some time as I&#39;m happy with the dividend and want to see what the new CEO does with it, but close out call positions if we get a significant pop.</p>\n</div><!-- SC_ON -->",
  "score": 129,
  "permalink": "/r/investing/comments/lx859p/the_bullish_case_for_tanger_outlets_1_month_later/",
  "subreddit": "investing",
  "id": "lx859p",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614937740768
}