{
  "author": "Some1fromReddit",
  "original_created_utc": 1645911929,
  "title": "Cash transactions in person are 100% decentralized, and are not on a public ledger. That's why drug dealers, and criminals use it over CC, debit, or cash app. Crypto is on a public ledger, and you can track it. Yet somehow, crypto is the bad guy.",
  "created_utc": 1645943468,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Read all of it because it makes one good point here that everyone should realize. &lt;/p&gt;\n\n&lt;p&gt;You can track Bitcoin on a public ledger.  That&amp;#39;s why when someone who got a few million stolen from them can call the FBI, and they track the wallet waiting for a transaction to pop up, and when it does...the person gets nailed.        &lt;/p&gt;\n\n&lt;p&gt;You can&amp;#39;t call the FBI, tell them 2M in cash was stolen from your safe, and have them wait for the criminal to spend some of it so they know his location. &lt;/p&gt;\n\n&lt;p&gt;Only dumb criminals get caught...like when someone is paying  $25,000,000 all cash for new condo complex in Hawaii.  That&amp;#39;s when someone gets suspicious and calls the FBI.    That&amp;#39;s pretty much the only time they can catch you in cash transaction....when someone calls them on you. &lt;/p&gt;\n\n&lt;p&gt;With a Bitcoin transaction, the probability of you being caught after stealing a wallet they are now keeping track of actually goes up.     Yeah, there&amp;#39;s ways to unload it into different cryptos using an encrypted throwaway mobile that&amp;#39;s not connected to you or anyone you know but it&amp;#39;s actually a tedious process if you don&amp;#39;t want to get caught.     Using &amp;quot;stolen cash&amp;quot; or using cash from illegal earnings is much much easier than using a stolen BTC wallet. &lt;/p&gt;\n\n&lt;p&gt;You use just $10 in Bitcoin from that wallet, and you can get nailed.       If you use a couple of $100 cash at a random store..  nobody is calling the FBI on you.  Because it&amp;#39;s a normal everyday transaction. &lt;/p&gt;\n\n&lt;p&gt;So you can have 2M in stolen cash and just sit on that for life using little by little, doing lightweight money laundering that doesn&amp;#39;t look too suspicious and nobody will suspect anything.     You can&amp;#39;t sit on a stolen BTC wallet for life and use it little by little without jumping through fire hoops or paranoid about being caught everytime you use it. &lt;/p&gt;\n\n&lt;p&gt;That&amp;#39;s the point I&amp;#39;m trying to make.   They are lying to everyone about how dangerous BTC usage is.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 325,
  "permalink": "/r/CryptoCurrency/comments/t27wfy/cash_transactions_in_person_are_100_decentralized/",
  "subreddit": "CryptoCurrency",
  "id": "t27wfy",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Read all of it because it makes one good point here that everyone should\nrealize.\n\nYou can track Bitcoin on a public ledger. That's why when someone who got a few\nmillion stolen from them can call the FBI, and they track the wallet waiting for\na transaction to pop up, and when it does...the person…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "この記事には、誰もが知っておくべき、ある良い点が書かれているので、全部読んでみてください。\nを実感してください。\n\nビットコインは公開台帳で追跡できます。そのため、数枚のビットコインを手に入れた人が\nFBIに電話すると、FBIはそのウォレットを追跡して\nその時、その人は...",
      "title": "対面での現金取引は100％非中央集権的であり、公開台帳には載らない。そのため、麻薬の売人や犯罪者は、クレジットカードやデビットカード、現金アプリよりも現金取引を利用するのです。暗号は公開台帳上にあり、それを追跡することができます。しかし、どういうわけか、暗号は悪者になっています。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "阅读全部内容，因为它在这里提出了一个很好的观点，每个人都应该意识到。\n认识到。\n\n你可以在公共账本上追踪比特币。这就是为什么当有人被偷了几百万的时候\n这就是为什么有人被偷了几百万，可以打电话给FBI，他们会追踪钱包，等待交易出现。\n他们跟踪钱包，等待交易的出现，当交易出现时......这个人......",
      "title": "个人的现金交易是100%去中心化的，而且不在公共账本上。这就是为什么毒贩和犯罪分子使用它而不是信用卡、借记卡或现金应用程序。加密货币在公共账簿上，你可以跟踪它。然而，不知何故，加密货币是个坏人。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "閱讀全部內容，因爲它在這裏提出了一個很好的觀點，每個人都應該意識到。\n認識到。\n\n你可以在公共賬本上追蹤比特幣。這就是爲什麼當有人被偷了幾百萬的時候\n這就是爲什麼有人被偷了幾百萬，可以打電話給FBI，他們會追蹤錢包，等待交易出現。\n他們跟蹤錢包，等待交易的出現，當交易出現時......這個人......",
      "title": "個人的現金交易是100%去中心化的，而且不在公共賬本上。這就是爲什麼毒販和犯罪分子使用它而不是信用卡、借記卡或現金應用程序。加密貨幣在公共賬簿上，你可以跟蹤它。然而，不知何故，加密貨幣是個壞人。"
    }
  ]
}