{
  "author": "Some1fromReddit",
  "original_created_utc": 1645911929,
  "title": "Cash transactions in person are 100% decentralized, and are not on a public ledger. That's why drug dealers, and criminals use it over CC, debit, or cash app. Crypto is on a public ledger, and you can track it. Yet somehow, crypto is the bad guy.",
  "created_utc": 1645943468,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Read all of it because it makes one good point here that everyone should realize. &lt;/p&gt;\n\n&lt;p&gt;You can track Bitcoin on a public ledger.  That&amp;#39;s why when someone who got a few million stolen from them can call the FBI, and they track the wallet waiting for a transaction to pop up, and when it does...the person gets nailed.        &lt;/p&gt;\n\n&lt;p&gt;You can&amp;#39;t call the FBI, tell them 2M in cash was stolen from your safe, and have them wait for the criminal to spend some of it so they know his location. &lt;/p&gt;\n\n&lt;p&gt;Only dumb criminals get caught...like when someone is paying  $25,000,000 all cash for new condo complex in Hawaii.  That&amp;#39;s when someone gets suspicious and calls the FBI.    That&amp;#39;s pretty much the only time they can catch you in cash transaction....when someone calls them on you. &lt;/p&gt;\n\n&lt;p&gt;With a Bitcoin transaction, the probability of you being caught after stealing a wallet they are now keeping track of actually goes up.     Yeah, there&amp;#39;s ways to unload it into different cryptos using an encrypted throwaway mobile that&amp;#39;s not connected to you or anyone you know but it&amp;#39;s actually a tedious process if you don&amp;#39;t want to get caught.     Using &amp;quot;stolen cash&amp;quot; or using cash from illegal earnings is much much easier than using a stolen BTC wallet. &lt;/p&gt;\n\n&lt;p&gt;You use just $10 in Bitcoin from that wallet, and you can get nailed.       If you use a couple of $100 cash at a random store..  nobody is calling the FBI on you.  Because it&amp;#39;s a normal everyday transaction. &lt;/p&gt;\n\n&lt;p&gt;So you can have 2M in stolen cash and just sit on that for life using little by little, doing lightweight money laundering that doesn&amp;#39;t look too suspicious and nobody will suspect anything.     You can&amp;#39;t sit on a stolen BTC wallet for life and use it little by little without jumping through fire hoops or paranoid about being caught everytime you use it. &lt;/p&gt;\n\n&lt;p&gt;That&amp;#39;s the point I&amp;#39;m trying to make.   They are lying to everyone about how dangerous BTC usage is.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 325,
  "permalink": "/r/CryptoCurrency/comments/t27wfy/cash_transactions_in_person_are_100_decentralized/",
  "subreddit": "CryptoCurrency",
  "id": "t27wfy",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Read all of it because it makes one good point here that everyone should\nrealize.\n\nYou can track Bitcoin on a public ledger. That's why when someone who got a few\nmillion stolen from them can call the FBI, and they track the wallet waiting for\na transaction to pop up, and when it does...the person…"
}