{
  "author": "YoghurtSolid8125",
  "original_created_utc": 1641426127,
  "title": "If you can’t handle the 50% dump you don’t deserve the 500% pump…",
  "created_utc": 1641443641,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;If you can’t handle the 50% dump you don’t deserve the 500% pump…&lt;/p&gt;\n\n&lt;p&gt;Words (insert eg x% )that was used years ago as the go to for panic posts- &lt;/p&gt;\n\n&lt;p&gt;Since we are seeing a bit of volatility today and I’m starting to see panic posts some words from veterans here from years ago to keep the chin up and HODL strong. &lt;/p&gt;\n\n&lt;p&gt;The market tend to have a bullwhip effect vs normal stock market nowadays so any move is exponentially larger. Part of the risk and excitement of being in the crypt. If you haven’t been here long (most people here have got into the crypt the last 4 months) this is part of the game and likely will be for a time. This is good as this also gives the gainz over time more than traditional markets. &lt;/p&gt;\n\n&lt;p&gt;The market is more mature than years gone by but the volatility is still there albeit less pronounced eg 80% drop in 2hrs - keep it simple (dont over trade)and HODL in what you believe in and may the gwei be with you….&lt;/p&gt;\n\n&lt;p&gt;PS this is something that has been part of crypto since the early days that hardens one to a new level of apathy and diamond hands the real test comes in when suicide lines come in at the post 30% drops to 80% drops. Again only have skin in the game in what you believe and make sure it’s quality bags!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 773,
  "permalink": "/r/CryptoCurrency/comments/rx0ati/if_you_cant_handle_the_50_dump_you_dont_deserve/",
  "subreddit": "CryptoCurrency",
  "id": "rx0ati",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "If you can’t handle the 50% dump you don’t deserve the 500% pump…\n\nWords (insert eg x% )that was used years ago as the go to for panic posts-\n\nSince we are seeing a bit of volatility today and I’m starting to see panic\nposts some words from veterans here from years ago to keep the chin up and…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "50％ダンプを処理できないなら、500％パンプに値しない...。\n\n数年前、パニックに陥った時に使われた言葉（例：x％）。\n\n今日は少しボラティリティが高いので、パニックになりそうな気配がします。\n数年前からのベテランの方々の、顎を上げるための言葉や、...",
      "title": "50％ダンプを処理できないなら、500％パンプを受ける資格はない...。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "如果你不能处理好50%的抛售，你就不配得到500%的抽水...。\n\n几年前，人们用这句话（插入例如x%）来形容恐慌性的帖子。\n\n由于我们今天看到了一些波动，我开始看到恐慌性的\n几年前，这里的一些老手说过一些话，以保持下巴和...",
      "title": "如果你不能处理好50%的倾销，你就不配得到500%的泵...。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "如果你不能處理好50%的拋售，你就不配得到500%的抽水...。\n\n幾年前，人們用這句話（插入例如x%）來形容恐慌性的帖子。\n\n由於我們今天看到了一些波動，我開始看到恐慌性的\n幾年前，這裏的一些老手說過一些話，以保持下巴和...",
      "title": "如果你不能處理好50%的傾銷，你就不配得到500%的泵...。"
    }
  ]
}