{
  "author": "RandyThePandy",
  "original_created_utc": 1638496297,
  "title": "Tax Tidbits From a CPA (US)",
  "created_utc": 1638513793,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Without doxxing myself, I&amp;#39;ve been a CPA (specifically,  a tax accountant) in the US for about 10 years.  Recently at my firm, I&amp;#39;ve been included in a small group of professionals forming a network of crypto tax consultants and specialists.  As I truly love the crypto community, the best contribution to this sub I can think of is to try to 1) put together a few tax tidbits and 2) to answer every tax question that I can in the comments.  Reading alot of comments and posts in the sub, I&amp;#39;m a bit concerned that my fellow crypto enthusiasts are going to put themselves at risk of the IRS by not fully understanding the extent of their activities.  Now before I start answering, I&amp;#39;ll add that anything I say should be used as a guide to either do further research on your own to understand your tax situation as it relates to crypto, or to acknowledge that your tax situation may be over your head and you should seek out a tax professional.  There are tax resources such as koinly, and while I don&amp;#39;t use them personally,  I believe they are worth the investment - but I also want people to understand their own tax situation to make sure any paid service is handling your situation correctly. &lt;/p&gt;\n\n&lt;p&gt;Without further adieu,  here are a few items of general knowledge and feel free to ask questions below and I&amp;#39;ll try to answer everything (I&amp;#39;m operating under the assumption this post will generate probably 25 comments, so if for some reason it blows up, be patient and I&amp;#39;ll try to get to everything). This will also be entirely US specific, anyone outside of the US, I&amp;#39;m sorry but I&amp;#39;m in no position to give tax opinions.&lt;/p&gt;\n\n&lt;p&gt;1) Your exchange, wallet, etc will likely not issue you a 1099-B for your trading activity, so don&amp;#39;t count on getting any help from them, other than your transaction details. This won&amp;#39;t be required for a few years and was part of the infrastructure bill.&lt;/p&gt;\n\n&lt;p&gt;2) Every crypto you swap, exchange, convert, sell, earn lending/bonding reward, mine, earn staking rewards, receive airdrops on is a taxable event in the current year. &lt;/p&gt;\n\n&lt;p&gt;3) To emphasize the point above, this includes MOONS. Yes, all of those MOONS you receive via karma distribution should be picked up on your tax return. Same as BAT rewards by using Brave.&lt;/p&gt;\n\n&lt;p&gt;4) The value you pick up on any rewards, mining, staking, airdrops, faucets is the fair market value at the time of receipt. You should be tracking this on your own or using a service. &lt;/p&gt;\n\n&lt;p&gt;5) The amount you pick up into income is now your basis. Basis is &amp;quot;cost&amp;quot;.&lt;/p&gt;\n\n&lt;p&gt;6) Mining is considered self-employment income and should be reported on Schedule C, which differs from staking which would be picked up as other income,  along with the other items not including selling, swapping, exchanging.&lt;/p&gt;\n\n&lt;p&gt;7) Sending a crypto from one wallet or exchange to another is not a taxable event  - though you should track your transaction fees to include in your basis.&lt;/p&gt;\n\n&lt;p&gt;8) NFTs are treated the same way as everything above. &lt;/p&gt;\n\n&lt;p&gt;9) Keep good records.  If you do not maintain good records or lose them and are not able to substantiate your cost basis, the IRS could make it $0, which would increase taxes you owe.&lt;/p&gt;\n\n&lt;p&gt;10) Holding period can give tax benefits. If you sell something you&amp;#39;ve held for a year, it&amp;#39;s a long term capital gain and is taxed at preferential rates. Less than a year is at ordinary rates.&lt;/p&gt;\n\n&lt;p&gt;11) You are supposed to report the date purchased, date sold, cost, and sales proceeds of EVERY sell (exchange, sell, swap). Even if this results in $0 gain or loss.&lt;/p&gt;\n\n&lt;p&gt;12) Wash sale rules don&amp;#39;t apply, however, selling something and immediately buying it back for tax loss harvesting could violate economic substance rules and on audit, the loss could be disallowed (it would likely be incorporated back into your basis).&lt;/p&gt;\n\n&lt;p&gt;13) Monero won&amp;#39;t save you from paying taxes. Nor will boating accidents.&lt;/p&gt;\n\n&lt;p&gt;14) You can trade crypto using crypto/bitcoin IRAs and the gains are tax free,  but you can&amp;#39;t pull out until retirement.  I don&amp;#39;t utilize these services, but they exist. &lt;/p&gt;\n\n&lt;p&gt;That&amp;#39;s what I can think of for the time being, I&amp;#39;ll make an edit if anything else important pops into my head.  I hope this and any questions provide some useful information to people in this sub. Best of luck to all!&lt;/p&gt;\n\n&lt;p&gt;TLDR: Taxes are hard, if you don&amp;#39;t have your arms around it, seek a professional and bite the bullet and pay.  Feel free to ask tax questions below and I&amp;#39;ll answer what I can.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 296,
  "permalink": "/r/CryptoCurrency/comments/r7n8yd/tax_tidbits_from_a_cpa_us/",
  "subreddit": "CryptoCurrency",
  "id": "r7n8yd",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Without doxxing myself, I've been a CPA (specifically, a tax accountant) in the\nUS for about 10 years. Recently at my firm, I've been included in a small group\nof professionals forming a network of crypto tax consultants and specialists. As\nI truly love the crypto community, the best contribution…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は公認会計士（特に税理士）です。\n米国で約10年。最近、私の事務所で、私は小さなグループに入っています。\n暗号税のコンサルタントや専門家のネットワークを形成している専門家たち。として\n暗号コミュニティが本当に大好きです！最高の貢献...",
      "title": "CPAからのTax Tidbits From a CPA (US)"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在不影响我自己的情况下，我在美国做注册会计师（特别是税务会计）大约10年了。\n在美国做了大约10年。最近在我的公司，我被纳入一个小团体\n组成了一个加密货币税务顾问和专家网络的专业人士。由于\n我真的很喜欢加密货币社区，最好的贡献...",
      "title": "注册会计师的税务趣闻(美国)"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在不影響我自己的情況下，我在美國做註冊會計師（特別是稅務會計）大約10年了。\n在美國做了大約10年。最近在我的公司，我被納入一個小團體\n組成了一個加密貨幣稅務顧問和專家網絡的專業人士。由於\n我真的很喜歡加密貨幣社區，最好的貢獻...",
      "title": "註冊會計師的稅務趣聞(美國)"
    }
  ]
}