{
  "author": "pokejock",
  "the_new_excerpt": "PLEASE DROP AN UPVOTE AND/OR COMMENT IF YOU USE. IT TOOK ME A FEW HOURS TO MAKE\nTHIS SPREADSHEET AND I WOULD LIKE TO HELP AS MANY PEOPLE AS POSSIBLE. I SEE A\nLOT OF PEOPLE OPENING AND DUPLICATING THE SHEET, PLEASE HELP PAY IT FORWARD.\n\nDisclaimer: I originally created this tool for WSB, but it looks…",
  "original_created_utc": 1611522154,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "如果您使用，请投上一票和/或评论。我花了几个小时来做\n这个spreadsheet，我想帮助尽可能多的人。我看到一个\n很多人打开和复制的表，请帮助它向前。\n\n声明：我最初是为WSB创建这个工具的，但它看起来... ...",
      "title": "计算GME退出策略、投资回报率计算和盈亏平衡分析的电子表格。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "如果您使用，請投上一票和/或評論。我花了幾個小時來做\n這個spreadsheet，我想幫助儘可能多的人。我看到一個\n很多人打開和複製的表，請幫助它向前。\n\n聲明：我最初是爲WSB創建這個工具的，但它看起來... ...",
      "title": "計算GME退出策略、投資回報率計算和盈虧平衡分析的電子表格。"
    }
  ],
  "title": "Spreadsheet to calculate GME Exit Strategy, ROI Calculations & Breakeven Analysis",
  "created_utc": 1611529350,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><strong>PLEASE DROP AN UPVOTE AND/OR COMMENT IF YOU USE. IT TOOK ME A FEW HOURS TO MAKE THIS SPREADSHEET AND I WOULD LIKE TO HELP AS MANY PEOPLE AS POSSIBLE. I SEE A LOT OF PEOPLE OPENING AND DUPLICATING THE SHEET, PLEASE HELP PAY IT FORWARD.</strong></p>\n\n<p>Disclaimer: I originally created this tool for WSB, but it looks like I am muted there for some reason, so I figured I would share on some other subs where people are also talking about GME.</p>\n\n<p>This whole experience has been (and will be) a crazy trip, but you don&#39;t want to be the one caught holding the bag when it eventually comes crashing down to earth. <strong>HAVE AN EXIT STRATEGY.</strong> Everyone has different levels of expendable capital and risk tolerance. Some of us can afford to YOLO away six-figure investments, while others would be more than happy to simply turn a few hundred dollars into a grand.</p>\n\n<p>Your exit strategy should depend on how much money you are comfortable losing, and how much profits you would be happy taking. I&#39;m not here to tell you what your strategy should be, but I did make a tool so you can figure it out for yourself: <a href=\"https://docs.google.com/spreadsheets/d/13twJC8Ldy3p7iS7fp5htOjfhTYZIE_Fqa5Rn9wgqv8c/edit?usp=sharing\">Exit Strategy Calculator (Google Sheet)</a></p>\n\n<p>&#x200B;</p>\n\n<p><strong>HOW TO USE THE EXIT STRATEGY PLANNER</strong></p>\n\n<p>- Note 1: <strong>This is for shares only</strong>. I&#39;m not smart enough to make this work for options.</p>\n\n<p>- Note 2: The link I provided is READ ONLY, so the first step is to <strong>make a copy</strong> for your own use (File --&gt; make a copy)</p>\n\n<p>- <strong>Now, enter your current position.</strong> Provide the number of shares you have in A3, and your average cost basis in B3 (these cells are highlighted in yellow). Your total investment will automatically calculate in C3.</p>\n\n<p>- <strong>Columns E-F are the ROI calculator.</strong> Column F tells you what the share price will need to reach in order to hit the ROI listed in Column E. Column G tells you what your total value would be at that share price.</p>\n\n<p>- <strong>Columns I-K are your break-even analysis</strong>, which basically tells you what the share price would need to be for you to break even by selling X number of your shares, and what your profit would be if you sold all of them at said price. <em>You will probably want to adjust the #s in Column I based on how many shares you currently have in your position</em>. Columns J &amp; K will automatically update when you do.</p>\n\n<p>- <strong>Columns M-N calculate your profits at different share prices.</strong> How much money will you make if you sell when GME hits $80? What about $100, or $250, or even $1,000? These columns will tell you. Feel free to adjust the share prices in column M if you want, but I have most of the big milestones covered.</p>\n\n<p>- <strong>Columns P-R are your exit strategy planner.</strong> <em>You will need to provide the following information: # of shares (if any) you want to hold long term, post-squeeze [cell P4]. Maximum dollar amount from your initial investment that you can stomach losing [Q4]. Profit amount you would be 100% happy cashing out with no FOMO of future gains [R3].</em> Cell Q6 will calculate your &quot;worst case scenario&quot; sell price. <strong>Set a stop loss order at this price to maximize your losses</strong> to the amount you entered in Q4, while still holding your desired # of long-term shares. Cell Q7 will calculate your &quot;best case scenario&quot; sell price. <strong>Set a limit order at this price to cash out with your &quot;100% satisfied profit&quot;</strong> you entered in R4, while still holding your desired # of long-term shares.</p>\n\n<p>- <strong>Columns T-V is an incremental sales planner.</strong> Some of you may want to sell a portion of your shares when certain benchmarks are hit (ie sell 10 shares when it hits $100, another 10 at $150, etc.). Simply enter in how many shares you want to sell at each price point [column U], and the sheet will calculate your cumulative revenues, net profit, and remaining shares.</p>\n\n<p>TLDR: Use this spreadsheet to avoid getting caught holding the bag on GME when all of the shorts are officially squeezed. Make a copy for yourself and change the cells highlighted in yellow to account for your personal position and risk/reward preferences.</p>\n\n<p>Of course you can use this spreadsheet for your other investments, but let&#39;s be honest... half of us seem to be all in on GME right now. Big week ahead, may all of our profits be plentiful!</p>\n\n<p><strong>EDIT:</strong> A few people have mentioned that the file traffic was too high and it was not allowing them to make a copy. Fear not! I have made some alternate sheets you can use instead (they are all the same).</p>\n\n<ol>\n<li><a href=\"https://docs.google.com/spreadsheets/d/1-6XkMn0c6OkHvyA0fWeTDVumpmU6btFYnsbY1z0GecM/edit?usp=sharing\">Alt 1</a></li>\n<li><a href=\"https://docs.google.com/spreadsheets/d/1HrkHCwhpCWtCQbvW2NJ5Zwo_kU65oDgDyRf3sLket6E/edit?usp=sharing\">Alt 2</a></li>\n<li><a href=\"https://docs.google.com/spreadsheets/d/1XZpIwY-KIZHXZUcLBTT7yVUq2oBsQg6IE44odsxSLsw/edit?usp=sharing\">Alt 3</a></li>\n<li><a href=\"https://docs.google.com/spreadsheets/d/1sCxovPWEHj11IuK2a1U4fyqqqYYxYwcsBNRVcT4gfdI/edit?usp=sharing\">Alt 4</a></li>\n<li><a href=\"https://docs.google.com/spreadsheets/d/1m1M3FDN0t62SqSH2U5lOZ602hdOF_x6d5rM33qe5l7Y/edit?usp=sharing\">Alt 5</a></li>\n</ol>\n</div><!-- SC_ON -->",
  "score": 1754,
  "permalink": "/r/investing/comments/l47jf5/spreadsheet_to_calculate_gme_exit_strategy_roi/",
  "subreddit": "investing",
  "id": "l47jf5",
  "is_self": true,
  "media": null,
  "is_video": false
}