{
  "author": "noitahaxan",
  "original_created_utc": 1660244903,
  "title": "Were US prisoners of war during WWII given some sort of weekend recreational release?",
  "created_utc": 1660265911,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;My grandpa was telling me a story last night, he said that when he was a kid during WWII in San Francisco, Italian families in his neighborhood used to go “sign out for” Italian POW’s and take them to Sunday dinner and play soccer. I was pretty blown away by this story. Is this something that would have been common in this time? Was this allowed for other POW’s such as the Japanese? Was he possibly BS’ing me?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 106,
  "permalink": "/r/AskHistorians/comments/wlzgtg/were_us_prisoners_of_war_during_wwii_given_some/",
  "subreddit": "AskHistorians",
  "id": "wlzgtg",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "My grandpa was telling me a story last night, he said that when he was a kid\nduring WWII in San Francisco, Italian families in his neighborhood used to go\n“sign out for” Italian POW’s and take them to Sunday dinner and play soccer. I\nwas pretty blown away by this story. Is this something that would…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "昨日の夜、おじいちゃんが話してくれたんだけど、子供のころは\n第二次世界大戦中のサンフランシスコで、近所のイタリア人家族がイタリア人捕虜のために\n「イタリア兵捕虜をサインアウトして、日曜日の夕食に招待したり、サッカーをしたりしたそうです。I\nこの話にはかなり驚かされました。こんなことがあるのだろうか......。",
      "title": "第二次世界大戦中のアメリカの捕虜は、週末のレクリエーションで解放されていたのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我爷爷昨晚给我讲了一个故事，他说当他还是个孩子时\n二战期间在旧金山，他附近的意大利家庭经常去\n为意大利战俘 \"签名\"，带他们去吃周日晚餐和踢足球。I\n我对这个故事感到非常震惊。这是不是会...",
      "title": "二战期间的美国战俘是否得到某种周末娱乐性的释放？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我爺爺昨晚給我講了一個故事，他說當他還是個孩子時\n二戰期間在舊金山，他附近的意大利家庭經常去\n爲意大利戰俘 \"簽名\"，帶他們去喫週日晚餐和踢足球。I\n我對這個故事感到非常震驚。這是不是會...",
      "title": "二戰期間的美國戰俘是否得到某種週末娛樂性的釋放？"
    }
  ]
}