{
  "author": "joethemaker22",
  "the_new_excerpt": "I didnt get to invest in 2020. I finally started in Feb this year after my\nfriends kept telling me how easy it was to make money in stock market all their\nstocks were up at least 50%. So I am not sitting on gains. With how the charts\non many of the tech/growth stocks look like. It is looking like I…",
  "original_created_utc": 1620303433,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は2020年に投資をすることができませんでした。今年の2月にようやく始めました。\n今年の2月にようやく投資を始めたのは、友人たちが株で儲けるのは簡単だと言っていたからです。\n今年の2月にようやく始めました。だから、利益が出ていないわけではありません。多くのハイテク/成長株のチャートが\n多くのハイテク/成長株のチャートがどのように見えるか。それはまるで私が...",
      "title": "2021年2月に投資を始めました。初期投資を失った時、どうやって嵐を乗り切ればいいのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我没能在2020年投资。我终于在今年2月开始投资，因为我的朋友们一直告诉我在股市中赚钱有多么容易。\n我的朋友一直告诉我在股市中赚钱是多么容易，他们所有的\n股票都至少上涨了50%。所以我没有坐等收益。随着图表的变化\n许多科技/成长型股票的图表来看。它看起来像我...",
      "title": "我在2021年2月开始投资。当我失去自己的初始投资时，我怎样才能渡过难关？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我沒能在2020年投資。我終於在今年2月開始投資，因爲我的朋友們一直告訴我在股市中賺錢有多麼容易。\n我的朋友一直告訴我在股市中賺錢是多麼容易，他們所有的\n股票都至少上漲了50%。所以我沒有坐等收益。隨着圖表的變化\n許多科技/成長型股票的圖表來看。它看起來像我...",
      "title": "我在2021年2月開始投資。當我失去自己的初始投資時，我怎樣才能渡過難關？"
    }
  ],
  "title": "I started investing in February 2021. How do I ride out the storm when im losing my own initial investment?",
  "created_utc": 1620308371,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I didnt get to invest in 2020. I finally started in Feb this year after my friends kept telling me how easy it was to make money in stock market all their stocks were up at least 50%. So I am not sitting on gains. With how the charts on many of the tech/growth stocks look like. It is looking like I bought all my tech stocks at their ATH many of them are now down at least 50%.  </p>\n\n<p>How do I ride this out? It feels like things are going to worse. And it also isn&#39;t the easy mode my friends were talking about  they had in 2020. I&#39;d feel better if it was gains I was losing and had that cushion. Im currently down 40%. It would be worse but I got lucky with the Dog coin and put some of my money in SPY/VOO.</p>\n</div><!-- SC_ON -->",
  "score": 2443,
  "permalink": "/r/stocks/comments/n65x7r/i_started_investing_in_february_2021_how_do_i/",
  "subreddit": "stocks",
  "id": "n65x7r",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620985995608
}