{
  "author": "Reidith",
  "the_new_excerpt": "The title is pretty self-explanatory, but I have currently added $10000 to my\nbrokerage account and I am trying to think about which stocks I want to\npurchase. Honestly, I think my portfolio is pretty trash as I got into too many\ntechnology stocks at the worst time. I am looking for some good…",
  "original_created_utc": 1617942615,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "表題の通りですが、現在、私の証券口座には10000ドルが追加されています。\nどの銘柄を買おうか考えています。\n購入しようとしています。正直なところ、私のポートフォリオは、最悪の時期にテクノロジー株を買いすぎたため、かなりゴミ同然だと思っています。\n正直なところ、私のポートフォリオはかなりのゴミだと思います。私は何か良いものを探しています...",
      "title": "もし10000円あったら、何に使いますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "题目很不言而喻，但我目前已经在我的 \"我的 \"中增加了10000美元。\n经纪账户，我正在努力思考我想要的股票，以\n购买。说实话，我觉得我的投资组合很垃圾，因为我进入了太多的\n科技股在最坏的时候。我正在寻找一些好...",
      "title": "如果你有10000元，你会花在什么地方？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "題目很不言而喻，但我目前已經在我的 \"我的 \"中增加了10000美元。\n經紀賬戶，我正在努力思考我想要的股票，以\n購買。說實話，我覺得我的投資組合很垃圾，因爲我進入了太多的\n科技股在最壞的時候。我正在尋找一些好...",
      "title": "如果你有10000元，你會花在什麼地方？"
    }
  ],
  "title": "If you had $10000 what would you spend it on?",
  "created_utc": 1618001520,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>The title is pretty self-explanatory, but I have currently added $10000 to my brokerage account and I am trying to think about which stocks I want to purchase. Honestly, I think my portfolio is pretty trash as I got into too many technology stocks at the worst time. I am looking for some good investments to put the $10000 into in which I can see my money grow. I would like to invest at least half of it into high dividend stocks, some of it into growth stocks, and a little bit of it on some high volatility plays. So back to my question: which stocks would you invest in if you had $10000?</p>\n\n<p>&#x200B;</p>\n\n<p>Stocks I am considering:</p>\n\n<p>PLTR (already have 100)</p>\n\n<p>VNQ</p>\n\n<p>VOO</p>\n\n<p>V</p>\n\n<p>CHPT</p>\n</div><!-- SC_ON -->",
  "score": 60,
  "permalink": "/r/stocks/comments/mn9kbq/if_you_had_10000_what_would_you_spend_it_on/",
  "subreddit": "stocks",
  "id": "mn9kbq",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1618566617817
}