{
  "author": "pm_me_cute_sloths_",
  "the_new_excerpt": "Based on how desperate some of the people on here are sounding, you have way too\nmuch invested. There was someone in the daily sounding exactly like every other\ncomment in WSB during the GME crash, saying that if everyone on the sub bought\nthat we could reverse the dip\n\nIf you’re one of these…",
  "original_created_utc": 1621226130,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ここにいる一部の人たちの必死な様子を見ると、あなたはあまりにも多くの投資をしています。\n投資が多すぎます。GMEが暴落した時、WSBのコメントと全く同じようなことを言っている人がデイリーにいました。\nGMEの暴落の時にWSBのコメントと全く同じようなことを言っていた人がいて、サブのみんなが買えば\nと言っていました。\n\nもしあなたがこのような人なら...",
      "title": "ランボルギーニはかっこいいけど、家族が食べていけることに勝るものはない。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "基于这里的一些人听起来有多绝望，你有太多的投资。\n投资太多了。在GME崩溃期间，有一个人在日报上的声音与WSB的其他评论一模一样。\n在GME暴跌期间，WSB的评论说，如果子网站上的每个人都购买\n我们就能扭转下跌趋势\n\n如果你是这些人中的一个...",
      "title": "兰博车很酷，但没有什么比能为你的家人提供食物更重要。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "基於這裏的一些人聽起來有多絕望，你有太多的投資。\n投資太多了。在GME崩潰期間，有一個人在日報上的聲音與WSB的其他評論一模一樣。\n在GME暴跌期間，WSB的評論說，如果子網站上的每個人都購買\n我們就能扭轉下跌趨勢\n\n如果你是這些人中的一個...",
      "title": "蘭博車很酷，但沒有什麼比能爲你的家人提供食物更重要。"
    }
  ],
  "title": "Lambos are cool, but nothing is as important as being able to put food on the table for your family",
  "created_utc": 1621265432,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Based on how desperate some of the people on here are sounding, you have way too much invested. There was someone in the daily sounding exactly like every other comment in WSB during the GME crash, saying that if everyone on the sub bought that we could reverse the dip </p>\n\n<p>If you’re one of these people, just do yourself a favor and pull out now, count your losses and move on with life and consider reinvesting a small amount later on (or just leave a small amount you’re comfortable with, but I’d recommend just not having any in right now as you’d be too tempted to chuck the rest back in)</p>\n\n<p>Seriously, don’t wait for the market to recover. It might, it might not. Don’t tell yourself you’re too deeply invested but you’re going to wait for the recovery that might never come, not for a while. It could happen tomorrow, but it might be 3 years from now. You don’t know, it could drop a lot further and you be even more screwed. It’s a gamble with your life savings and that’s not something you should do, <em>ever</em>. </p>\n\n<p>I don’t care if you have a 70% chance to win big and make your “moon”, but the 30% chance you don’t win, you lose all your money. You don’t take that risk.</p>\n\n<p>Being alive and being able to feed yourself and your family is way more important than any lambo you may get from “making it”. The gains <em>are not</em> worth the risk of losing everything and ruining yours and your family’s lives. </p>\n\n<p>People don’t always win big in crypto, for every person who “makes it”, there’s 1000 who lost it all.</p>\n\n<p>Edit: rewording to make the hypothetical a bit less outlandish and not a 99% chance to win $200 billion lol</p>\n</div><!-- SC_ON -->",
  "score": 300,
  "permalink": "/r/CryptoCurrency/comments/ne6rzb/lambos_are_cool_but_nothing_is_as_important_as/",
  "subreddit": "CryptoCurrency",
  "id": "ne6rzb",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1621590799672
}