{
  "author": "TurbulentMoon",
  "the_new_excerpt": "As someone who’s been around since the 2017 bull market, this dip ain’t shit. In\nfact, I’m glad I see red candles. Now’s a great time to build your stacks.\nRemember: time in the market beats timing the market. So have patience, the\nmarket needs to stabilize a little before going up again. Did you…",
  "original_created_utc": 1614093761,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "作为一个从2017年牛市开始就一直存在的人，这个跌幅不是狗屎。在\n事实上，我很高兴看到红蜡烛。现在是建立你的堆栈的好时机。\n记住：市场中的时间胜过市场中的时间。所以，要有耐心。\n市场需要稳定一下再涨。你有没有...",
      "title": "这是一个健康的、亟待纠正的问题。直到看到首页钉着的自杀热线电话，我才会关注。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "作爲一個從2017年牛市開始就一直存在的人，這個跌幅不是狗屎。在\n事實上，我很高興看到紅蠟燭。現在是建立你的堆棧的好時機。\n記住：市場中的時間勝過市場中的時間。所以，要有耐心。\n市場需要穩定一下再漲。你有沒有...",
      "title": "這是一個健康的、亟待糾正的問題。直到看到首頁釘着的自殺熱線電話，我纔會關注。"
    }
  ],
  "title": "This is a healthy and much-needed correction. I’m not concerned until I see the Suicide Hotline number pinned to the front page.",
  "created_utc": 1614120075,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>As someone who’s been around since the 2017 bull market, this dip ain’t shit. In fact, I’m glad I see red candles. Now’s a great time to build your stacks. Remember: time in the market beats timing the market. So have patience, the market needs to stabilize a little before going up again. Did you get into crypto expecting an unlimited money printer that goes BRRR?</p>\n\n<p>If you just recently jumped into crypto, I can certainly understand why this dip would make you uneasy. It must feel like you lit your money on fire if your entire portfolio is red and you have no gains to show for it. You’ll know the market is truly in a bad place once the Suicide Hotline number is pinned to the front page. That’s the biggest buy signal you’ll see on this subreddit.</p>\n\n<p>My take? This is just a pit stop before we see higher highs later this year. Don’t be surprised if we stabilize and go flat for a while. But of course, this is not financial advice and everything could come crashing down. Don’t take my word for it. I’m just some dude on Reddit.</p>\n\n<p>Take care of yourself. Stop staring at the charts, go drink some water, get 5,000-10,000 steps in. Crypto ain’t leaving.</p>\n</div><!-- SC_ON -->",
  "score": 279,
  "permalink": "/r/CryptoCurrency/comments/lqkv28/this_is_a_healthy_and_muchneeded_correction_im/",
  "subreddit": "CryptoCurrency",
  "id": "lqkv28",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614332880687
}