{
  "author": "100aozach",
  "original_created_utc": 1657828746,
  "title": "How do I prevent my aging parents from consuming “entertainment news” media and believing the lies that come with it?",
  "created_utc": 1657842644,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;As my parents grow older, they’ve become much more susceptible to anything targeted at the less informed. In their case, this means watching far-right news outlets and buzzword-loving talking heads has become a daily occurrence, and their beliefs have begun to shift as a result. Today my mother sent me a debunked Fox News article about cash laced with fentanyl causing overdoses across the United States. She was understandably worried, as she had no doubts as to the validity of the article - however, she was not receptive to a conversation about the truth of these things she’s being made to believe.&lt;/p&gt;\n\n&lt;p&gt;I don’t intend to change their political standing, that ship has long sailed, but is there anything that can be done to educate them about the damage they’re being subjected to by consuming endless sources of fabricated outrage?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 112,
  "permalink": "/r/NoStupidQuestions/comments/vz4uhh/how_do_i_prevent_my_aging_parents_from_consuming/",
  "subreddit": "NoStupidQuestions",
  "id": "vz4uhh",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "As my parents grow older, they’ve become much more susceptible to anything\ntargeted at the less informed. In their case, this means watching far-right news\noutlets and buzzword-loving talking heads has become a daily occurrence, and\ntheir beliefs have begun to shift as a result. Today my mother…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "親が高齢になり、何かにつけて敏感に反応するようになったため\n影響を受けやすくなっています。両親の場合、極右のニュース番組や流行語大賞を見ることが\nを見るのが日課になり、信念を持ち始めた。\nその結果、彼らの信念は変化し始めた。今日、母は...",
      "title": "高齢の両親が「芸能ニュース」メディアを消費し、それに伴う嘘を信じることを防ぐにはどうしたらいいのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "随着我父母年龄的增长，他们变得更容易受到任何东西的影响。\n针对不了解情况的人。在他们看来，这意味着观看极右翼的新闻机构和喜欢热闹的脱口秀。\n在他们看来，这意味着观看极右翼新闻机构和热爱流行语的谈话者已经成为一种日常行为，而他们的信仰也因此开始发生变化。\n他们的信仰也因此开始转变。今天，我母亲...",
      "title": "我如何防止我年迈的父母消费 \"娱乐新闻 \"媒体并相信其中的谎言？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "隨着我父母年齡的增長，他們變得更容易受到任何東西的影響。\n針對不瞭解情況的人。在他們看來，這意味着觀看極右翼的新聞機構和喜歡熱鬧的脫口秀。\n在他們看來，這意味着觀看極右翼新聞機構和熱愛流行語的談話者已經成爲一種日常行爲，而他們的信仰也因此開始發生變化。\n他們的信仰也因此開始轉變。今天，我母親...",
      "title": "我如何防止我年邁的父母消費 \"娛樂新聞 \"媒體並相信其中的謊言？"
    }
  ]
}