{
  "author": "00nizarsoccer",
  "the_new_excerpt": "Sabre is a leading technology solutions provider to the global travel industry.\nIt trades on NASDAQ under the ticker $SABR and currently has a share price of\n$12.73 with a market cap of $4.04 billion. Sabre holds the number-two share of\nglobal distribution system air bookings (38.8% as of the end of…",
  "original_created_utc": 1612476751,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "Sabre是全球旅游行业领先的技术解决方案供应商。\n它在纳斯达克交易，股票代码为$SABR，目前的股价为$SABR。\n12.73美元，市值40.4亿美元。赛伯乐占据了第二名的份额。\n全球分销系统航空预订量（截至年底为38.8%，...",
      "title": "Sabre $SABR蓄势待发。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "Sabre是全球旅遊行業領先的技術解決方案供應商。\n它在納斯達克交易，股票代碼爲$SABR，目前的股價爲$SABR。\n12.73美元，市值40.4億美元。賽伯樂佔據了第二名的份額。\n全球分銷系統航空預訂量（截至年底爲38.8%，...",
      "title": "Sabre $SABR蓄勢待發。"
    }
  ],
  "title": "Sabre $SABR is poised for a breakout",
  "created_utc": 1612496182,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Sabre is a leading technology solutions provider to the global travel industry. It trades on NASDAQ under the ticker $SABR and currently has a share price of $12.73 with a market cap of $4.04 billion. Sabre holds the number-two share of global distribution system air bookings (38.8% as of the end of 2019 versus 37.1% in 2018). The global distribution system segment represented 73% of total 2019 revenue. The company also has a growing IT solutions division (27% of revenue) that focuses on the airline, hospitality, and travel agent end markets. Transaction fees, which are tied to volume and not price, account for the bulk of revenue and profits. Beyond just being a good short squeeze opportunity, I think this company has potential to be a great long-term hold given its trading at ~45% bellow COVID-19 highs.</p>\n\n<p>Thesis 1) Potential Short Squeeze Opportunity:</p>\n\n<p>Keeping with our current theme, the biggest catalyst Sabre has is the fact that it currently has a 19.45% short interest. It has 274,710,000 shares outstanding with 61,700,000 shares being shorted. Due to its moderate volume, the short interest ratio / days to cover is 7 days making it a prime candidate for a short squeeze. Given some positive catalysts such as their recently announced Google Partnership as well as the fast vaccination rollout in the U.S., I think now is an excellent time to start buying the stock.</p>\n\n<p>Thesis 2) Newly Forged Google Partnership:</p>\n\n<p>On January 21, Google Cloud announced it has joined forces with Sabre Corporation to help digitally transform the traveler’s experience and co-create the future of travel. The 10-year-strategic partnership between Google and Sabre will enable the travel provider to improve operational agility while developing new services and creating a new marketplace for its airline, hospitality and travel agency customers. I think this a great initiative from management and the company, and it will reap the benefits from this partnership. </p>\n\n<p>• Improving Sabre’s technology capability: Sabre will begin the process of migrating its IT infrastructure to Google Cloud’s highly available and secure services. The partnership provides Sabre advanced support and greater flexibility to meet its technology objectives. </p>\n\n<p>• Using Google Cloud tools to enhance and optimize travel: Google Cloud’s data analytics tools will enable Sabre to enhance the capabilities of current and future products. They will provide Sabre with insights to help them improve operational efficiency and create and optimize travel options, improving both loyalty and revenues for its customers. </p>\n\n<p>• Driving a broader innovation framework: The two companies have aligned upon a framework that leverages talent and assets of both companies to imagine, develop and deploy future capabilities that will advance the travel ecosystem, benefiting all market participants.</p>\n\n<p>Thesis 3) Vaccination Roll-Out:</p>\n\n<p>Finally, travel should recover to pre-COVID levels once vaccines are rolled-out. Luckily for America, it has been doing a pretty good job at it. In the U.S., more Americans have now received at least one dose than have tested positive for the virus since the pandemic began. So far, 35 million doses have been given, according to a state-by-state tally. In the last week, an average of 1.34 million doses per day were administered. In the U.S., the latest vaccination rate is 1,335,310 doses per day, on average. At this rate, it will take 11 months to cover 75% of the population with a two-dose vaccine. All in all, before the year is out we should see a meaningful progress towards achieving full immunity which means we can go back to travelling! This increase in travel will obviously benefit Sabre as well as the broader airline and travel adjacent industries.</p>\n\n<p>In conclusion, I think now is a great opportunity to pick up some Sabre shares which is a fundamentally strong business that is trading at a steep discount (deep value anyone?). It has several favorable catalysts that will help share prices in the short term while also being a great long-term holding due the fundamental strength of the business. I’m long</p>\n\n<p>Disclaimer: I am not a financial advisor, and this is not financial advice. Do you own due diligence.</p>\n</div><!-- SC_ON -->",
  "score": 104,
  "permalink": "/r/investing/comments/lcrpek/sabre_sabr_is_poised_for_a_breakout/",
  "subreddit": "investing",
  "id": "lcrpek",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613123198805
}