{
  "author": "iskren124",
  "original_created_utc": 1637829072,
  "title": "What is the smartest rug pull people have fallen for?",
  "created_utc": 1637844751,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>By smart I mean that there has been a team/face behind it, some technologies revealed and projects in the making which would make the coin look like something real. But then something has happened and all the people got scammed out of their money.  </p>\n\n<p>Squid token for example wouldn&#39;t be a really good and thought out scam , people that invested were just clearly uninformed or caught the notion and tried to time the market for quick money.</p>\n\n<p>&#x200B;</p>\n\n<p>I am relatively new to crypto and have probably missed it so I was interested in learning about it and not making the mistake as other people before me.</p>\n</div><!-- SC_ON -->",
  "score": 192,
  "permalink": "/r/CryptoCurrency/comments/r1rz6w/what_is_the_smartest_rug_pull_people_have_fallen/",
  "subreddit": "CryptoCurrency",
  "id": "r1rz6w",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "By smart I mean that there has been a team/face behind it, some technologies\nrevealed and projects in the making which would make the coin look like\nsomething real. But then something has happened and all the people got scammed\nout of their money.\n\nSquid token for example wouldn't be a really good…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "スマートというのは、その背後にチームや顔があり、いくつかの技術が公開されていて、コインのように見えるプロジェクトが進行中であるということです。\nこのコインを本物のように見せるための技術やプロジェクトが明らかになっていることです。\nのように見せることができます。しかし、何かが起こり、すべての人々がお金を騙し取られてしまったのです。\nお金を奪われてしまいました。\n\n例えば、Squid tokenは、本当に良いコインとは言えないでしょう。",
      "title": "人が引っかかったスマートなラグプルとは？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我所说的聪明是指它背后有一个团队/面孔，一些技术\n揭示的技术和正在进行的项目，这将使该币看起来像\n某种真实的东西。但后来发生了一些事情，所有的人都被骗了\n骗走了他们的钱。\n\n例如，乌贼代币就不是一个真正的好东西。",
      "title": "人们上当的最聪明的地毯式拉法是什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我所說的聰明是指它背後有一個團隊/面孔，一些技術\n揭示的技術和正在進行的項目，這將使該幣看起來像\n某種真實的東西。但後來發生了一些事情，所有的人都被騙了\n騙走了他們的錢。\n\n例如，烏賊代幣就不是一個真正的好東西。",
      "title": "人們上當的最聰明的地毯式拉法是什麼？"
    }
  ]
}