{
  "author": "RusticBohemian",
  "original_created_utc": 1658669170,
  "title": "The Gilgamesh epic mentions multiple assemblies ruling over Uruk. There were some for younger men, older men, and women. How did the division of power between these assemblies work? How much power did they have? Was there any sort of \"executive figure\" reigning over them all?",
  "created_utc": 1658684677,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;According to the Gilgamesh story, which is set in Uruk, one of the leaders of the youth assembly manages to become lugal, or king.&lt;/p&gt;\n\n&lt;p&gt;So what was the role of the assemblies for the young vs the old. Did some have more power? Was there always a king reigning over them?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 101,
  "permalink": "/r/AskHistorians/comments/w6vlc6/the_gilgamesh_epic_mentions_multiple_assemblies/",
  "subreddit": "AskHistorians",
  "id": "w6vlc6",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "According to the Gilgamesh story, which is set in Uruk, one of the leaders of\nthe youth assembly manages to become lugal, or king.\n\nSo what was the role of the assemblies for the young vs the old. Did some have\nmore power? Was there always a king reigning over them?",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ウルクを舞台としたギルガメッシュ物語によると、リーダーの一人である\nルガル（王）になる。\n\nでは、若者と年寄りの集会はどのような役割を担っていたのだろうか。ある者はより大きな力を持ち\nより権力があったのだろうか。常に王が君臨していたのだろうか。",
      "title": "ギルガメシュ叙事詩では、ウルクを支配する複数の集会が記されている。若い男性のためのもの、年配の男性のためのもの、そして女性のためのものがあった。これらの議会はどのように機能していたのだろうか。また、どの程度の権力をもっていたのでしょうか。また、それらを統括する「幹部」のようなものはいたのでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "根据以乌鲁克为背景的《吉尔伽美什》故事，其中一个领导人是\n青年集会的一个领导人设法成为卢格尔，或国王。\n\n那么，年轻人和老年人的集会的作用是什么？有些人是否有\n更多的权力？总是有一个国王在统治他们吗？",
      "title": "吉尔伽美什史诗中提到了统治乌鲁克的多个集会。有一些是为年轻男子、年长男子和妇女设立的。这些议会之间的权力划分是如何进行的？他们的权力有多大？是否有任何一种 \"行政人物 \"统治着他们所有人？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "根據以烏魯克爲背景的《吉爾伽美什》故事，其中一個領導人是\n青年集會的一個領導人設法成爲盧格爾，或國王。\n\n那麼，年輕人和老年人的集會的作用是什麼？有些人是否有\n更多的權力？總是有一個國王在統治他們嗎？",
      "title": "吉爾伽美什史詩中提到了統治烏魯克的多個集會。有一些是爲年輕男子、年長男子和婦女設立的。這些議會之間的權力劃分是如何進行的？他們的權力有多大？是否有任何一種 \"行政人物 \"統治着他們所有人？"
    }
  ]
}