{
  "author": "BeachOutEast",
  "the_new_excerpt": "There was a post in here a few ago from someone where she wanted to buckle down\nand learn stocks, so I followed that post. Someone more experienced copied and\npasted their write up with advice. I followed that write up, researched stocks,\nlooked at earnings reports, etc.\n\nBut so far the only stock…",
  "original_created_utc": 1620744296,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "数年前にこのサイトで、ある人が株の勉強をしたいという投稿をしていたので\nという投稿があったので、その投稿を参考にしました。経験豊富な方がその方の書き込みをコピー＆ペーストして\nアドバイスを書いた文章をコピー＆ペーストしました。私はその書き込みに従い、銘柄を研究しました。\n決算報告書を見たりしました。\n\nしかし、今のところ唯一の銘柄は...",
      "title": "今まで買った株は全て損をしています。何かアドバイスはありませんか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "几年前，有人在这里发了一个帖子，说她想好好学习\n并学习股票，所以我跟了那个帖子。一个更有经验的人复制并\n粘贴了他们写的建议。我按照那篇帖子，研究了股票。\n看收益报告，等等。\n\n但到目前为止，唯一的股票...",
      "title": "到目前为止，我买的每只股票都是亏损的。有什么建议吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "幾年前，有人在這裏發了一個帖子，說她想好好學習\n並學習股票，所以我跟了那個帖子。一個更有經驗的人複製並\n粘貼了他們寫的建議。我按照那篇帖子，研究了股票。\n看收益報告，等等。\n\n但到目前爲止，唯一的股票...",
      "title": "到目前爲止，我買的每隻股票都是虧損的。有什麼建議嗎？"
    }
  ],
  "title": "Every stock I buy so far has been a loss. Any advice?",
  "created_utc": 1620788860,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>There was a post in here a few ago from someone where she wanted to buckle down and learn stocks, so I followed that post. Someone more experienced copied and pasted their write up with advice. I followed that write up, researched stocks, looked at earnings reports, etc. </p>\n\n<p>But so far the only stock gaining me money is the one stock I thought wouldn’t (Vaxart is positive when all indications I could find in my research were negative).</p>\n\n<p>GE I’ve lost $150.</p>\n\n<p>Gold was positive, but now it’s lost me $50 too.</p>\n\n<p>Almost bought into some REITs, but every single one I looked at is going down.</p>\n\n<p>Every stock on my list is negative except Vaxart, which seems ironic cause everything else on my list is supposedly safer stocks like materials and utilities and real estate. Tangible assets. All negative.</p>\n\n<p>Avoided buying tech stocks like NIO and PLTR cause a lot of people here say people are dumping tech stocks. </p>\n\n<p>Feels like I should just go back to ETF funds and high interest savings accounts.</p>\n\n<p>This feels like a waste of both time and money in comparison.</p>\n\n<p>Any advice? Down $300 right now in only a few days lol</p>\n</div><!-- SC_ON -->",
  "score": 42,
  "permalink": "/r/stocks/comments/n9ymq4/every_stock_i_buy_so_far_has_been_a_loss_any/",
  "subreddit": "stocks",
  "id": "n9ymq4",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620985996882
}