{
  "author": "cpa_xlsx",
  "the_new_excerpt": "As the allegedly largest crypto channel on YouTube, it’s no doubt he has the\naudience necessary to move markets, at least with small cap coins. Yesterday, he\ndropped a video titled “Top 5 coins CRUSHING the market NOW (MASSIVE Crypto\nGAINS)”. Ok, ignoring the incredibly sensationalist and clickbait…",
  "original_created_utc": 1613582998,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "作为号称YouTube上最大的加密频道，毫无疑问，他拥有的是\n听众必要，至少是用小盘币来感动市场。昨天，他\n掉了一个视频，题为 \"5大币现在粉碎市场（大规模的Crypto）\"。\nGAINS）\"。好吧，忽略那些令人难以置信的耸人听闻和点击率... ...",
      "title": "我相信YouTuber BitBoy Crypto可能会故意在小盘币上进行抽水马桶式的操作。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "作爲號稱YouTube上最大的加密頻道，毫無疑問，他擁有的是\n聽衆必要，至少是用小盤幣來感動市場。昨天，他\n掉了一個視頻，題爲 \"5大幣現在粉碎市場（大規模的Crypto）\"。\nGAINS）\"。好吧，忽略那些令人難以置信的聳人聽聞和點擊率... ...",
      "title": "我相信YouTuber BitBoy Crypto可能會故意在小盤幣上進行抽水馬桶式的操作。"
    }
  ],
  "title": "I believe YouTuber BitBoy Crypto may be intentionally running pump & dumps on small cap coins",
  "created_utc": 1613594209,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>As the allegedly largest crypto channel on YouTube, it’s no doubt he has the audience necessary to move markets, at least with small cap coins. Yesterday, he dropped a video titled “Top 5 coins CRUSHING the market NOW (MASSIVE Crypto GAINS)”. Ok, ignoring the incredibly sensationalist and clickbait title, the video showcased his top 5 altcoin picks for short term gains. His top pick was Frontier, a relatively small &lt;$100m market cap coin. He didn’t even give any reasons why this was his top pick, all he did was tease a video he was going to drop the next day. Immediately, Frontier doubled in price. Is this legal? I’m not at liberty to say. I don’t believe there are any regulations requiring he disclose his positions, like there are in US equity markets for example. Is it ethical? I don’t believe so. Even if he’s not required to disclose his positions, I absolutely think from an ethical perspective that he should. If he owns Frontier, he has a financial interest in its movement, and I believe that is a material conflict of interest.</p>\n</div><!-- SC_ON -->",
  "score": 1640,
  "permalink": "/r/CryptoCurrency/comments/llzs5r/i_believe_youtuber_bitboy_crypto_may_be/",
  "subreddit": "CryptoCurrency",
  "id": "llzs5r",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613728620221
}