{
  "author": "Matteustheone",
  "the_new_excerpt": "So August 2020 I went blank, in a middle of a Zoom meeting!\n\nTurned out it was the beginning of a Burn-out and subsequent Depression. I\nactually had a cool life: House, Wife, and two kids. (third was born in\nNovember, birth, I did not get to enjoy) I had no reason to be unhappy.\nNevertheless I…",
  "original_created_utc": 1623542513,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "2020年8月、私はZoomミーティングの最中に頭が真っ白になりました。\n\nそれがバーンアウト（燃え尽き症候群）とそれに続く鬱病の始まりだと判明しました。I\n家、妻、2人の子供というクールな生活を送っていたのですが（3人目は11月生まれ\n3人目は11月に生まれましたが、私は楽しむことができませんでした）私には不幸になる理由がありませんでした。\nそれなのに、私は...。",
      "title": "暗号通貨が私の人生を救ったかもしれない！？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "2020年8月，我在Zoom会议上脑子一片空白！结果发现这是我倦怠的开始。\n\n结果发现这是倦怠和随后的抑郁症的开始。I\n其实我有一个很酷的生活：房子，妻子，和两个孩子。\n11月出生，我没有享受到）我没有理由不快乐。\n然而，我...",
      "title": "加密货币可能救了我的命!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "2020年8月，我在Zoom會議上腦子一片空白！結果發現這是我倦怠的開始。\n\n結果發現這是倦怠和隨後的抑鬱症的開始。I\n其實我有一個很酷的生活：房子，妻子，和兩個孩子。\n11月出生，我沒有享受到）我沒有理由不快樂。\n然而，我...",
      "title": "加密貨幣可能救了我的命!"
    }
  ],
  "title": "Crypto Currency might have saved my life!",
  "created_utc": 1623555466,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So August 2020 I went blank, in a middle of a Zoom meeting!</p>\n\n<p>Turned out it was the beginning of a Burn-out and subsequent Depression. \nI actually had a cool life: House, Wife, and two kids. (third was born in November, birth, I did not get to enjoy) I had no reason to be unhappy. Nevertheless I crashed. I was plagued with Panic-Attacks, crippling anxiety and I quickly became suicidal. </p>\n\n<p>I lost my job but thanks to a little cash saved, we still survived. </p>\n\n<p>In January my wife told me to find a hobby to fill the void left by my all-encompassing job. </p>\n\n<p>I was never a “hobby-kind-of-guy” so after googling some ideas, I by accident arrived at an article about the Blockchain and all the different Crypto coins. I was fascinated! I read like 50 Whitepapers in a week! I was hooked. I start buying some coins of projects I liked, and I joined this amazing community. \nAm I 100% cured? not at all, but I got a new job, got rid of the antidepressants, and I can&#39;t even remember the last time I had a panic attack. It&#39;s a step in the right direction. </p>\n\n<p>Just so you know, I only invest what I can afford, and even though prices  had gone south since I started, a don&#39;t care! I am in this for the long haul. </p>\n\n<p>Again guys, thank you! You just might have saved my life.</p>\n</div><!-- SC_ON -->",
  "score": 858,
  "permalink": "/r/CryptoCurrency/comments/nyk784/crypto_currency_might_have_saved_my_life/",
  "subreddit": "CryptoCurrency",
  "id": "nyk784",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1624009737363
}