{
  "author": "DaybreakHonor",
  "original_created_utc": 1648316374,
  "title": "Why does Hydrochloric Acid dissociates more than Sulfuric Acid, or more than most other acids for that matter?",
  "created_utc": 1648330836,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;This question comes from one I asked my chemistry teacher: how can we tell apart strong acids and bases  from weaker acids and bases by JUST knowing their name (ie KOH, H3PO4, etc) and properties we can derive from the periodic table, atomic structure, so on. My teacher&amp;#39;s answer kept coming down &amp;quot;strong acids and bases dissociates more than weak acids and bases&amp;quot; and I kept asking &amp;quot;Why? Why does [random acid] dissociate more than [weaker random acid]? What properties do they differ that allows one acid to be stronger than the other?&amp;quot; . . . and eventually my teacher just said &amp;quot;I don&amp;#39;t know.&amp;quot; Needless to say I&amp;#39;m unsatisfied, any help please?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 123,
  "permalink": "/r/askscience/comments/toyobm/why_does_hydrochloric_acid_dissociates_more_than/",
  "subreddit": "askscience",
  "id": "toyobm",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "This question comes from one I asked my chemistry teacher: how can we tell apart\nstrong acids and bases from weaker acids and bases by JUST knowing their name\n(ie KOH, H3PO4, etc) and properties we can derive from the periodic table,\natomic structure, so on. My teacher's answer kept coming down…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "この質問は、私が化学の先生にした質問からきています。\n強酸塩基と弱酸塩基の名前を知っているだけで、強酸塩基と弱酸塩基を使い分けることができます。\n(KOH、H3PO4など）、周期表から導き出される性質があります。\n原子構造など。先生の答えがどんどん降りてきて...。",
      "title": "なぜ塩酸は硫酸よりも、あるいは他の多くの酸よりも解離が大きいのですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这个问题来自于我问过我的化学老师的一个问题：我们怎样才能通过知道它们的名字来区分\n强酸和强碱与弱酸和弱碱的区别，只需知道它们的名称\n(即KOH、H3PO4等）和我们可以从元素周期表中得出的属性。\n原子结构，等等。我的老师的答案一直在下降...",
      "title": "为什么盐酸的解离度比硫酸高，或者比其他大多数的酸高？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這個問題來自於我問過我的化學老師的一個問題：我們怎樣才能通過知道它們的名字來區分\n強酸和強鹼與弱酸和弱鹼的區別，只需知道它們的名稱\n(即KOH、H3PO4等）和我們可以從元素週期表中得出的屬性。\n原子結構，等等。我的老師的答案一直在下降...",
      "title": "爲什麼鹽酸的解離度比硫酸高，或者比其他大多數的酸高？"
    }
  ]
}