{
  "author": "TheVanillaMiller",
  "the_new_excerpt": "I like Lithium America (LAC), iShares Global Clean Energy ETF (ICLN), and Novus\n(NOVS) which will soon become AppHarvest, possibly the future of North American\nagriculture.\n\nI’ve been doing my research lately and just bought 100 shares of each. Not the\nbiggest investment in the world but not small…",
  "original_created_utc": 1609226065,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我喜欢Lithium America(LAC)、iShares Global Clean Energy ETF(ICLN)和Novus\n(NOVS)，它很快就会成为AppHeavest，可能是北美的未来\n农业。\n\n我最近一直在做研究，刚各买了100股。不是\n世界上最大的投资，但不是小…",
      "title": "我对未来几年的可再生能源持110%的乐观态度。(以及更远的地方)"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我喜歡Lithium America(LAC)、iShares Global Clean Energy ETF(ICLN)和Novus\n(NOVS)，它很快就會成爲AppHeavest，可能是北美的未來\n農業。\n\n我最近一直在做研究，剛各買了100股。不是\n世界上最大的投資，但不是小…",
      "title": "我對未來幾年的可再生能源持110%的樂觀態度。(以及更遠的地方)"
    }
  ],
  "title": "I am 110% bull on renewable energy over the next few years. (And beyond)",
  "created_utc": 1609245619,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I like Lithium America (LAC), iShares Global Clean Energy ETF (ICLN), and Novus (NOVS) which will soon become AppHarvest, possibly the future of North American agriculture. </p>\n\n<p>I’ve been doing my research lately and just bought 100 shares of each. Not the biggest investment in the world but not small by any means. I’m big on anything renewable and have no problem playing the long-term game. I actually prefer it. </p>\n\n<p>How do you all feel about these? </p>\n\n<p>Also, additional opinions I would love from any of you would be your thoughts on Sunrun (RUN), Palantir (PLTR), Canadian Solar (CSIQ), and First Trust Global Wind Energy ETF (FAN). I am very high on all of these over the next 5 years. </p>\n\n<p>Thanks in advance, and I’m still learning along with everyone else. Warren Buffett said, invest in what you know, and it’s better to get a good company at an okay price, than an okay company at a good price. I’m less concerned about the week to week or month to month, and more so confident in renewable energy taking over during the next decade. It’s not a matter of opinion, and it’s not if, but when! </p>\n\n<p>Thanks all and Happy Holidays and Happy New Year.</p>\n</div><!-- SC_ON -->",
  "score": 1253,
  "permalink": "/r/investing/comments/km9iw6/i_am_110_bull_on_renewable_energy_over_the_next/",
  "subreddit": "investing",
  "id": "km9iw6",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1609495334772
}