{
  "author": "thowawayforlearn",
  "original_created_utc": 1629174744,
  "title": "How far apart can your boobs be without them looking weird?",
  "created_utc": 1629197283,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;ve always ben self conscious about my boobs so I told myself &quot;they probably look fine and I&#39;m the only one who&#39;ll care.&quot; I didn&#39;t realize how bad it was until I saw a botched boob job where hers had a similar distance to mine. If I&#39;m not wearing a bra I can fit my entire hand between the gap and I want to know if this is normal. I wish I didn&#39;t have these hideous growths on my body.</p>\n</div><!-- SC_ON -->",
  "score": 104,
  "permalink": "/r/TooAfraidToAsk/comments/p5ws1j/how_far_apart_can_your_boobs_be_without_them/",
  "subreddit": "TooAfraidToAsk",
  "id": "p5ws1j",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I've always ben self conscious about my boobs so I told myself \"they probably\nlook fine and I'm the only one who'll care.\" I didn't realize how bad it was\nuntil I saw a botched boob job where hers had a similar distance to mine. If I'm\nnot wearing a bra I can fit my entire hand between the gap and I…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はいつも自分のおっぱいを気にしていたので、「きっと大丈夫、気にするのは私だけ」と自分に言い聞かせていました。\nと自分に言い聞かせていました。自分のおっぱいがこんなにもひどいとは\n私のおっぱいと似たような距離にある、失敗したおっぱい手術を見るまでは、それがどれほど悪いことなのか気づきませんでした。もし私が\nブラジャーをしていなければ、その隙間に手がすっぽり入ってしまうほどです。",
      "title": "オッパイがどれくらい離れていても変に見えないか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我一直对自己的胸部有自知之明，所以我告诉自己：\"它们可能看起来很好，只有我才会关心。\n它们可能看起来很好，而且我是唯一一个关心它们的人\"。我没有意识到这有多糟糕\n直到我看到一个失败的隆胸手术，她的乳房与我的有类似的距离。如果我\n如果我不戴胸罩，我的整只手就能伸进缝隙中，而我......",
      "title": "你的胸部可以相隔多远而不显得奇怪？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我一直對自己的胸部有自知之明，所以我告訴自己：\"它們可能看起來很好，只有我纔會關心。\n它們可能看起來很好，而且我是唯一一個關心它們的人\"。我沒有意識到這有多糟糕\n直到我看到一個失敗的隆胸手術，她的乳房與我的有類似的距離。如果我\n如果我不戴胸罩，我的整隻手就能伸進縫隙中，而我......",
      "title": "你的胸部可以相隔多遠而不顯得奇怪？"
    }
  ]
}