{
  "author": "nick83487",
  "original_created_utc": 1647788472,
  "title": "How about instead of making fun of people down ~40%, we applaud them for buying at or near the ATH.",
  "created_utc": 1647815901,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I know there has been a chain of posts addressing each other recently so I&amp;#39;ll keep this short. I&amp;#39;ve seen a lot of perspectives on this around the sub recently but one point I haven&amp;#39;t seen is that it takes a lot of nerve to buy at or near the ATH. &lt;/p&gt;\n\n&lt;p&gt;You can say &amp;quot;buy the dip&amp;quot; all you want but if it weren&amp;#39;t for people buying at or near the ATH, we would never reach new highs. So how about instead of making fun of people who are deep in the red right now, we appreciate the risk they took by buying at those prices and not criticize them for getting excited when we see green days.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 316,
  "permalink": "/r/CryptoCurrency/comments/timxyr/how_about_instead_of_making_fun_of_people_down_40/",
  "subreddit": "CryptoCurrency",
  "id": "timxyr",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I know there has been a chain of posts addressing each other recently so I'll\nkeep this short. I've seen a lot of perspectives on this around the sub recently\nbut one point I haven't seen is that it takes a lot of nerve to buy at or near\nthe ATH.\n\nYou can say \"buy the dip\" all you want but if it…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "最近、連鎖的にお互いを取り上げる投稿があるようなので、私は\n手短に説明します。最近、サブのあたりでいろいろな視点を見かけますが\nが、一点、見かけないのは、その近辺で買うにはかなりの神経を使うということです。\nATH。\n\nディップを買え」と言うのは勝手だが、もしそれが...",
      "title": "40%も下がった人を馬鹿にするのではなく、ATHかその近辺で買った人を褒めるのはどうでしょう。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我知道最近有一连串的帖子在互相讨论，所以我将会\n我就不多说了。我最近在子网站上看到了很多关于这个问题的观点\n但有一点我没有看到，那就是要有很大的胆量才能在或接近\nATH。\n\n你可以说 \"买跌停\"，但如果它...",
      "title": "与其取笑跌幅达40%的人，不如为他们在ATH或接近ATH时买入而喝彩。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我知道最近有一連串的帖子在互相討論，所以我將會\n我就不多說了。我最近在子網站上看到了很多關於這個問題的觀點\n但有一點我沒有看到，那就是要有很大的膽量才能在或接近\nATH。\n\n你可以說 \"買跌停\"，但如果它...",
      "title": "與其取笑跌幅達40%的人，不如爲他們在ATH或接近ATH時買入而喝彩。"
    }
  ]
}