{
  "author": "DetroitMotorShow",
  "original_created_utc": 1633898768,
  "title": "If SHIB has to go to even 10 cents, it will multiply the entire crypto market cap by 20x. It wont, it is just a shitcoin",
  "created_utc": 1633909040,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>SHIB is grossly over valued, just like dogecoin was overvalued back in March, and everyone who called it out back then was spot on. </p>\n\n<p>Of course, the SHIB shills are peddling the narrative that it will go to $1. </p>\n\n<p>Currently, one SHIB = $0.00002715</p>\n\n<p>To go to $1, it has to go up by 3,683,141%. Yes, it has to go up by 3 million %... </p>\n\n<p>To go to even 10c, it has to go up by 362,884%</p>\n\n<p>Apparently, there are 394,796,000,000,000 SHIBs in circulation. </p>\n\n<p>Even at 10c, the market cap of SHIB alone will be over $39 Trillion. </p>\n\n<p>To be specific, a market cap of Thirty-Nine Trillion, Four Hundred Seventy-Nine Billion Six Hundred Million dollars</p>\n\n<p>Today, the entire crypto market cap is around $2.3 Trillion. So even at 10c, SHIB will be worth 20x today&#39;s crypto market cap. </p>\n\n<p>Firstly, this is not happening anytime soon. </p>\n\n<p>Secondly, this is not happening anytime in the future either.</p>\n\n<p>There is a higher probability of SHIB going to zero over it going to $1 or even 10c. </p>\n\n<p>Hundreds of shitcoins bust onto the scene during a crypto boom cycle, only to disappear during the bust. </p>\n\n<p>SHIB is a token that has no real value, apart from exploiting amateur investors and unit bias and traders riding it for quick gains. Almost everyone is in SHIB purely for profit. Many want over night riches and plan to hold till $1, which they believe will come soon.. many others are riding it got quick gains, and there is nothing wrong in that. Many shitcoins can give quick gains. But for them to claim there is something innovative or anything resembling new technology in SHIB is just delusional. </p>\n\n<p>The whole project is quite an exquisite combination of several pyramid scheme elements, and is quite well done. The devs have really delivered on their promise of making themselves rich.</p>\n</div><!-- SC_ON -->",
  "score": 383,
  "permalink": "/r/CryptoCurrency/comments/q5gdtj/if_shib_has_to_go_to_even_10_cents_it_will/",
  "subreddit": "CryptoCurrency",
  "id": "q5gdtj",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "SHIB is grossly over valued, just like dogecoin was overvalued back in March,\nand everyone who called it out back then was spot on.\n\nOf course, the SHIB shills are peddling the narrative that it will go to $1.\n\nCurrently, one SHIB = $0.00002715\n\nTo go to $1, it has to go up by 3,683,141%. Yes, it…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "3月にdogecoinが過大評価されたように、SHIBは著しく過大評価されています。\nそして、当時それを指摘した誰もが正しかった。\n\nもちろん、SHIBのシラーたちは、1ドルになるというシナリオを売り込んでいる。\n\n現在、1枚のSHIBは0.00002715ドルです。\n\n1ドルになるためには、3,683,141%も上昇しなければなりません。そう、それは...",
      "title": "もしSHIBが10セントにでもなれば、暗号化された市場全体のキャップを20倍にすることができます。そんなことはありません、ただのクソコインです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "SHIB的估值严重过高，就像3月份的时候dogecoin被高估一样。\n每个人在当时都指出了这一点。\n\n当然，SHIB的骗子们正在兜售它将涨到1美元的说法。\n\n目前，一个SHIB=0.00002715美元\n\n要涨到1美元，它必须上涨3,683,141%。是的，它...",
      "title": "如果SHIB要涨到哪怕10美分，它将使整个加密货币的市值翻20倍。它不会的，它只是一个狗屎币。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "SHIB的估值嚴重過高，就像3月份的時候dogecoin被高估一樣。\n每個人在當時都指出了這一點。\n\n當然，SHIB的騙子們正在兜售它將漲到1美元的說法。\n\n目前，一個SHIB=0.00002715美元\n\n要漲到1美元，它必須上漲3,683,141%。是的，它...",
      "title": "如果SHIB要漲到哪怕10美分，它將使整個加密貨幣的市值翻20倍。它不會的，它只是一個狗屎幣。"
    }
  ]
}