{
  "author": "Accomplished-Cup6902",
  "original_created_utc": 1646628362,
  "title": "How do I clean my penis?",
  "created_utc": 1646648925,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;This might be somewhat disgusting to read so I apologize in advance.&lt;/p&gt;\n\n&lt;p&gt;I am 16 years old, uncircumcised, and I was never really taught how to do it. I recently learned that you have to pull down your foreskin, then clean with soap and water. I remember trying to pull down my foreskin as a kid, but it hurt so I never did it again. Now, in the shower, I have managed to pull it down to base of the head but it hurts a little bit, but what hurts even more is letting the water fall down on it from the shower, or trying to touch it. I am not sure what I should do.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 102,
  "permalink": "/r/TooAfraidToAsk/comments/t8hacv/how_do_i_clean_my_penis/",
  "subreddit": "TooAfraidToAsk",
  "id": "t8hacv",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": true,
  "the_new_excerpt": "This might be somewhat disgusting to read so I apologize in advance.\n\nI am 16 years old, uncircumcised, and I was never really taught how to do it. I\nrecently learned that you have to pull down your foreskin, then clean with soap\nand water. I remember trying to pull down my foreskin as a kid, but…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "読んでいて多少嫌な気分になるかもしれないので、あらかじめ謝っておきます。\n\n私は16歳、未開封で、やり方もあまり教えてもらったことがありません。I\n最近知ったのですが、包皮を剥いてから石鹸で洗うといいそうです。\nと水。子供の頃、包皮を引っ込めようとした記憶がありますが...",
      "title": "ペニスの掃除はどうすればいいですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这读起来可能有些恶心，所以我提前道歉。\n\n我今年16岁，没有割过包皮，也没有人真正教过我怎么做。I\n我最近才知道，你必须拉下你的包皮，然后用肥皂和水清洗。\n和水清洗。我记得小时候曾试图拉下我的包皮，但...",
      "title": "我如何清洁我的阴茎？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這讀起來可能有些噁心，所以我提前道歉。\n\n我今年16歲，沒有割過包皮，也沒有人真正教過我怎麼做。I\n我最近才知道，你必須拉下你的包皮，然後用肥皂和水清洗。\n和水清洗。我記得小時候曾試圖拉下我的包皮，但...",
      "title": "我如何清潔我的陰莖？"
    }
  ]
}