{
  "author": "PM_ME_PLASTIC_BAGS",
  "the_new_excerpt": "I just managed to get an extra large Big Mac meal at McDonald's without having\nto spend any Fiat!!\n\nWhen going to pay at the counter, the cashier asked card or cash? I responded by\nsaying that I can pay with Nano which is fast and feeless, arriving in their\nwallet in under 1 second.\n\nShe looked a…",
  "original_created_utc": 1616055523,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我刚刚在麦当劳吃到了一个超大的巨无霸餐，而没有...\n要花任何菲亚特!\n\n去柜台付款时，收银员问卡还是现金？我的回答是\n说，我可以用Nano支付，这是快速和无感的，到达他们的。\n钱包在1秒内。\n\n她看起来...",
      "title": "麦当劳采用纳米技术的真实世界!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我剛剛在麥當勞喫到了一個超大的巨無霸餐，而沒有...\n要花任何菲亞特!\n\n去櫃檯付款時，收銀員問卡還是現金？我的回答是\n說，我可以用Nano支付，這是快速和無感的，到達他們的。\n錢包在1秒內。\n\n她看起來...",
      "title": "麥當勞採用納米技術的真實世界!"
    }
  ],
  "title": "Real world Nano adoption by McDonald's!",
  "created_utc": 1616067565,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I just managed to get an extra large Big Mac meal at McDonald&#39;s without having to spend any Fiat!!</p>\n\n<p>When going to pay at the counter, the cashier asked card or cash? I responded by saying that I can pay with Nano which is fast and feeless, arriving in their wallet in under 1 second.</p>\n\n<p>She looked a little funny at me and said they only accept Visa or Mastercard. I responded by saying that this isn&#39;t dirty centralised fiat money which is being hyperinflated to nothing by &quot;money printers going brrrrr&quot; (I made hand signals to emphasise how fast the printing is).</p>\n\n<p>At this point she looked really scared but I think that&#39;s because she understood the reality how badly the dollar value is being inflated.</p>\n\n<p>She called her manager to presumably explain this amazing opportunity, whilst I pulled out a map of some Nano faucets we could go to and test out how amazing Nano is.</p>\n\n<p>The manager said I can take the meal if I promise to leave immediately. I&#39;m assuming it&#39;s because he was so excited to close up and start adopting Nano.</p>\n\n<p>I can&#39;t believe it, not only is Nano fast and feeless but it also gets you free things!!! This is real world adoption and I can&#39;t wait to get every single McDonald&#39;s on the Nano train.</p>\n\n<p>P.S. Please don&#39;t harass front line workers. Remember that most people don&#39;t know about cryptos and try not to come of too strong when trying to get adoption.</p>\n</div><!-- SC_ON -->",
  "score": 7559,
  "permalink": "/r/CryptoCurrency/comments/m7m7om/real_world_nano_adoption_by_mcdonalds/",
  "subreddit": "CryptoCurrency",
  "id": "m7m7om",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1616752815278
}