{
  "author": "bawdyanarchist",
  "the_new_excerpt": "https://www.occ.gov/news-issuances/news-releases/2021/nr-occ-2021-2a.pdf\n\nTLDR:\n\n> National banks and Federal savings associations (collectively referred to as\n> \"banks\") may use new technologies, including INVNs and related stablecoins, to\n> perform bank-permissible functions\n> \n> ...…",
  "original_created_utc": 1610918277,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "https://www.occ.gov/news-issuances/news-releases/2021/nr-occ-2021-2a.pdf\n\nTLDR。\n\n> 国家银行和联邦储蓄协会(统称为：国家银行和联邦储蓄协会)\n> \"银行\"）可能会使用新技术，包括INVN和相关稳定币，以\n> 履行银行允许的职能\n> \n> ...…",
      "title": "美国政府宣布所有用于银行业务的隐私币合法化"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "https://www.occ.gov/news-issuances/news-releases/2021/nr-occ-2021-2a.pdf\n\nTLDR。\n\n> 國家銀行和聯邦儲蓄協會(統稱爲：國家銀行和聯邦儲蓄協會)\n> \"銀行\"）可能會使用新技術，包括INVN和相關穩定幣，以\n> 履行銀行允許的職能\n> \n> ...…",
      "title": "美國政府宣佈所有用於銀行業務的隱私幣合法化"
    }
  ],
  "title": "USGovt Declares all Privacy Coins Legal for Banking Purposes",
  "created_utc": 1610947083,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><a href=\"https://www.occ.gov/news-issuances/news-releases/2021/nr-occ-2021-2a.pdf\">https://www.occ.gov/news-issuances/news-releases/2021/nr-occ-2021-2a.pdf</a></p>\n\n<p>TLDR:</p>\n\n<blockquote>\n<p>National banks and Federal savings associations (collectively referred to as &quot;banks&quot;) may use new technologies, including INVNs and related stablecoins, to perform bank-permissible functions</p>\n\n<p>... cryptocurrencies can present risks under AML and countering the financing of terrorism ... because cryptocurrencies may be used by bad actors for the purposes of avoiding the financial system or engaging in other illicit activities.  <strong>However, banks have significant experience with developing BSA/AML compliance programs to assure compliance</strong> </p>\n</blockquote>\n\n<p><em>An INVN is an &quot;Independent Node Verification Network.&quot; In other words, all blockchains, among other distributed, node structured databases.</em></p>\n\n<p>In other words, the lead regulatory office for all United States banks just declared that even though some cryptocurrencies present additional risks, they are nonetheless permissible, and they expect that banks are experienced enough to implement proper compliance programs. Much like they do with cash. </p>\n\n<p>This is huge. Many large corporations and even banks have significant need of privacy, to protect trade secrets, business partnerships, and prevent telegraphing of their movements to competitors. This is also pretty big news in light of the fact that Kraken just received its own banking license, and lists the top privacy coin in crypto right now.</p>\n</div><!-- SC_ON -->",
  "score": 346,
  "permalink": "/r/CryptoCurrency/comments/kzf8m3/usgovt_declares_all_privacy_coins_legal_for/",
  "subreddit": "CryptoCurrency",
  "id": "kzf8m3",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1611311214984
}