{
  "author": "Wiardv",
  "original_created_utc": 1634538580,
  "title": "Be greedy when others are greedy, and be greedy when others are fearful. Always be greedy",
  "created_utc": 1634553316,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><strong>Always be greedy</strong>, regardless of how others are feeling. This advice contradicts Warren Buffet&#39;s advice, but what does he know about crypto? He called Bitcoin rat poison. So don&#39;t take his advice, take mine instead, here is why.</p>\n\n<p>If you were around in 2017 and you bought BTC at 10K, then it went to 17K, then to 3k, when was the right time to buy? Well: All the time right? Even if you bought the top in 2017, you would be in profit.</p>\n\n<p>Because you can&#39;t time the market, you&#39;re probably better of just always being greedy. Buy every top and every bottom and get as much BTC as you can. When you think about selling, stop thinking. When you think about buying, go ahead.</p>\n\n<p>BTC will not always go up, but it&#39;s more likely to go up than the dollar. Feeling greedy? Good. Feeling fearful? Bad, be greedy instead.</p>\n</div><!-- SC_ON -->",
  "score": 158,
  "permalink": "/r/CryptoCurrency/comments/qah0dg/be_greedy_when_others_are_greedy_and_be_greedy/",
  "subreddit": "CryptoCurrency",
  "id": "qah0dg",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Always be greedy, regardless of how others are feeling. This advice contradicts\nWarren Buffet's advice, but what does he know about crypto? He called Bitcoin\nrat poison. So don't take his advice, take mine instead, here is why.\n\nIf you were around in 2017 and you bought BTC at 10K, then it went to…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "人の気持ちを気にせず、常に貪欲に。このアドバイスは矛盾する\nウォーレン・バフェットのアドバイスですが、彼は暗号について何を知っているのでしょうか？彼はビットコインを\n殺鼠剤と呼んでいます。だから、彼のアドバイスを受けないで、代わりに私のアドバイスを受けてください、その理由はこうです。\n\nもしあなたが2017年にいて、BTCを10Kで買ったとしたら、その後、BTCは...",
      "title": "他人が欲張っているときは欲張りに、他人が恐れているときは欲張りに。常に貪欲であれ"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "始终保持贪婪，不管别人的感受如何。这个建议与\n沃伦-巴菲特的建议，但他对加密货币了解多少呢？他称比特币为\n鼠药。所以不要听他的建议，而要听我的，原因就在这里。\n\n如果你在2017年的时候，你在10K的时候买了BTC，然后它到了...",
      "title": "在别人贪婪的时候要贪婪，在别人恐惧的时候要贪婪。始终保持贪婪"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "始終保持貪婪，不管別人的感受如何。這個建議與\n沃倫-巴菲特的建議，但他對加密貨幣瞭解多少呢？他稱比特幣爲\n鼠藥。所以不要聽他的建議，而要聽我的，原因就在這裏。\n\n如果你在2017年的時候，你在10K的時候買了BTC，然後它到了...",
      "title": "在別人貪婪的時候要貪婪，在別人恐懼的時候要貪婪。始終保持貪婪"
    }
  ]
}