{
  "author": "TechnoForBreakfast",
  "the_new_excerpt": "My account moves between 0.5%-2% daily. so I understand that Im not going to see\nbig fluctuations when I check my account. However I can't seem to stop looking\nat my portfolio multiple times a day and have a constant habit of refreshing the\npage. I have considered deleting my broker app from my…",
  "original_created_utc": 1619205582,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私の口座は毎日0.5%～2%の間で動いているので、口座を確認しても大きな変動は見られないと理解しています。\n大きな変動が見られないことは理解しています。しかし、1日に何度も自分のポートフォリオを見るのをやめることができません。\n一日に何度も自分のポートフォリオを見るのをやめられず、常にページを更新する癖がついています。\nページを更新する癖があります。ブローカーアプリを削除することも考えましたが...",
      "title": "一日に何度もポートフォリオをチェックする"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我的账户每天的波动在0.5%-2%之间，所以我明白我在查看账户时不会看到\n大的波动。然而，我似乎无法停止每天多次查看我的投资组合\n每天多次查看我的投资组合，并有不断刷新页面的习惯。\n页面。我曾考虑从我的经纪人应用程序中删除。",
      "title": "每天多次检查你的投资组合"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我的賬戶每天的波動在0.5%-2%之間，所以我明白我在查看賬戶時不會看到\n大的波動。然而，我似乎無法停止每天多次查看我的投資組合\n每天多次查看我的投資組合，並有不斷刷新頁面的習慣。\n頁面。我曾考慮從我的經紀人應用程序中刪除。",
      "title": "每天多次檢查你的投資組合"
    }
  ],
  "title": "Checking your portfolio multiple times a day",
  "created_utc": 1619228993,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>My account moves between 0.5%-2% daily. so I understand that Im not going to see big fluctuations when I check my account. However I can&#39;t seem to stop looking at my portfolio multiple times a day and have a constant habit of refreshing the page. I have considered deleting my broker app from my phone but I don&#39;t want to give up the option to check if and when I need to. I even have limits set for some investments that I want to switch in/out from. So Im not really making any moves on any given day. Checking it this regularly feels like an unhealthy habit.</p>\n\n<p>how often do you check your portfolio? How do you stop yourself from looking at it very regularly?</p>\n</div><!-- SC_ON -->",
  "score": 102,
  "permalink": "/r/stocks/comments/mx2ww6/checking_your_portfolio_multiple_times_a_day/",
  "subreddit": "stocks",
  "id": "mx2ww6",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619776214690
}