{
  "author": "Lady_Harubun",
  "original_created_utc": 1638437806,
  "title": "Is there a silly \"non-vulgar\" slang term for a women's genitals? Like how men have \"pp\"?",
  "created_utc": 1638445589,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;This question randomly came to mind while I was talking to my boyfriend. The word &amp;quot;pussy&amp;quot; just doesn&amp;#39;t fit the tone of most scenarios, ya know? It&amp;#39;s just not a word I feel comfortable dropping casually? Whereas if you say &amp;quot;pp&amp;quot; everyone will just laugh along without it feeling too out of left field. &lt;/p&gt;\n\n&lt;p&gt;Am I over-thinking this? Do I just not know enough slang? Am I on to something? I have no clue lmao&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 116,
  "permalink": "/r/TooAfraidToAsk/comments/r73rfq/is_there_a_silly_nonvulgar_slang_term_for_a/",
  "subreddit": "TooAfraidToAsk",
  "id": "r73rfq",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "This question randomly came to mind while I was talking to my boyfriend. The\nword \"pussy\" just doesn't fit the tone of most scenarios, ya know? It's just not\na word I feel comfortable dropping casually? Whereas if you say \"pp\" everyone\nwill just laugh along without it feeling too out of left…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "この質問は、ボーイフレンドと話しているときに、ランダムに思いついたものです。その\n\"pussy \"という単語は、ほとんどのシナリオのトーンに合わないんだ、わかる？それはちょうど\n何気なく使う言葉？一方、\"pp \"と言えば、誰もが\nというような、あまり違和感のない笑い方をします。",
      "title": "女性の性器を表す、くだらない「下品でない」俗語はありますか？男性が「pp」を持つように？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这个问题是我在和我的男朋友聊天时随机想到的。这个词\n\"pussy \"这个词并不适合大多数情况下的语气，你知道吗？它只是不\n一个我觉得很舒服的词，随口一说？而如果你说 \"pp\"，每个人\n大家就会跟着笑，而不会觉得太离谱......",
      "title": "有没有一个愚蠢的 \"非粗俗 \"的俚语来形容女性的生殖器？就像男人有 \"pp \"那样？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這個問題是我在和我的男朋友聊天時隨機想到的。這個詞\n\"pussy \"這個詞並不適合大多數情況下的語氣，你知道嗎？它只是不\n一個我覺得很舒服的詞，隨口一說？而如果你說 \"pp\"，每個人\n大家就會跟着笑，而不會覺得太離譜......",
      "title": "有沒有一個愚蠢的 \"非粗俗 \"的俚語來形容女性的生殖器？就像男人有 \"pp \"那樣？"
    }
  ]
}