{
  "author": "thekookreport",
  "the_new_excerpt": "Let me start by saying I've invested nearly $6MM in what I believe to be a\ngenerational investment opportunity brought about by significant cost disruption\nin satellite launch costs, innovations in marrying satellite technology to\nlow-earth orbit (\"LEO\") applications, and advances in LTE network…",
  "original_created_utc": 1623851075,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "まずは、私が世代を超えた投資機会だと信じているものに、約600万ドルを投資していることからお話します。\n衛星打ち上げコストの大幅な削減と、衛星技術との融合による\n衛星打ち上げコストの大幅な削減、衛星技術と低地球軌道（LEO）アプリケーションとの融合におけるイノベーション、LTEネットワークの進歩によってもたらされる、世代を超えた投資機会だと考え、約600万ドルを投資しました。\nこれは、衛星打ち上げコストの大幅な削減、衛星技術と低軌道（LEO）アプリケーションとの連携の革新、LTEネットワークの進化によってもたらされる、世代を超えた投資機会だと考えています。",
      "title": "$ASTS - 携帯電話のためのSpaceX - 6MMドルのYOLOを実際のDDで実現。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "让我先说一下，我已经投资了近600万美元，我相信这是一个由显著的成本颠覆带来的代际投资机会。\n我相信这是一个由卫星发射成本的重大破坏所带来的一代投资机会。\n卫星发射成本的重大颠覆，将卫星技术与低地球轨道（\"LEO\"）应用相结合的创新，以及LTE网络的进步所带来的\n低地球轨道（\"LEO\"）应用的创新，以及LTE网络的进步所带来的一代投资机会......",
      "title": "ASTS美元--手机的SpaceX--6百万美元的YOLO与真实的DD"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "讓我先說一下，我已經投資了近600萬美元，我相信這是一個由顯著的成本顛覆帶來的代際投資機會。\n我相信這是一個由衛星發射成本的重大破壞所帶來的一代投資機會。\n衛星發射成本的重大顛覆，將衛星技術與低地球軌道（\"LEO\"）應用相結合的創新，以及LTE網絡的進步所帶來的\n低地球軌道（\"LEO\"）應用的創新，以及LTE網絡的進步所帶來的一代投資機會......",
      "title": "ASTS美元--手機的SpaceX--6百萬美元的YOLO與真實的DD"
    }
  ],
  "title": "$ASTS - The SpaceX for Mobile Phones - $6MM YOLO with Real DD",
  "created_utc": 1623864092,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Let me start by saying I&#39;ve invested nearly $6MM in what I believe to be a generational investment opportunity brought about by significant cost disruption in satellite launch costs, innovations in marrying satellite technology to low-earth orbit (&quot;LEO&quot;) applications, and advances in LTE network architecture.  We are early in the commercialization of LEO and $ASTS is at the vanguard.</p>\n\n<p>Inside of SpaceX, most investors rest their hat on the value of Starlink, which will provide FIXED-POINT broadband to customers, albeit at very high costs and with unclear quality.  They value is at $40bn+.  This equates to $200 per share for $ASTS, by way of comparison.  So there &quot;is a there, there&quot; in terms of what we are playing for here.</p>\n\n<p>Just like Facebook found out after it&#39;s IPO, the real market is and always will be in <strong>MOBILE</strong>. Starlink cannot translate to mobile unless you intend to haul a trailer behind you with a satellite dish.  See below for an artist rendition of Starlink&#39;s mobile solution vs. ASTS&#39; actual mobile solution - your existing handset</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/g1qny0og6k571.png?width=918&amp;format=png&amp;auto=webp&amp;s=a6899104fbe13f6bf1e69417ade25940a9aee38b\">Haha - let&#39;s get back to business...read on</a></p>\n\n<p>$ASTS AST Spacemobile has re-imagined what&#39;s possible after the significant cost disruption in satellite launch, which has allowed it to marry two key innovations to provide satellite connectivity to A REGULAR MOBILE DEVICE:</p>\n\n<p>&#x200B;</p>\n\n<ol>\n<li>Because launch costs are just a fraction of what they used to be, $ASTS is launching satellites 10x as large as those of traditional satellite phone satellites. This allows the satellite to do the work, not the phone</li>\n<li>By innovating with software, $ASTS can make the satellite connection work with existing LTE      networks by only working with the carriers&#39; ground terminals to compensate for the Doppler effect; importantly, ASTS works with any normal phone without requiring any modifications</li>\n</ol>\n\n<p>Here is the overview of the <strong>FACTS</strong></p>\n\n<p><strong>PRODUCT:</strong></p>\n\n<p>• ASTS is building the first-of-a kind and <strong>only</strong> space-based cellular broadband network that is <strong>direct-to-device</strong>; a consumer’s existing handset will work with ASTS’s service in tandem with traditional terrestrial mobile service - ASTS also works with IoT enabled devices</p>\n\n<p>• The constellation utilizes low and mid-band frequencies shared with partners on a non-interference basis; ASTS does not use mobile satellite spectrum but instead delivers service over spectrum allocated for terrestrial mobile use</p>\n\n<p>• ASTS utilizes high throughput backhaul to terrestrial networks</p>\n\n<p>• The service will eliminate coverage gaps, is compatible with all phones, provides broadband data speeds, and is accessible via one-click on a user’s device</p>\n\n<p><strong>MARKET:</strong></p>\n\n<p>• ASTS is targeting the large mobile 5G market, specifically in markets where terrestrial infrastructure (e.g. towers) is less developed</p>\n\n<p>• ASTS is a beneficiary of the following secular trends: i) falling launch costs, ii) high smartphone penetration, iii) broadband demand iv) 5G IoT proliferation</p>\n\n<p>• ASTS cites 3.3BN people who are covered but not connected to cellular broadband and another 700MM people who are not covered by existing networks and not connected</p>\n\n<p>• Key regional opportunities include India, Africa, and Equatorial regions</p>\n\n<p>• The service is well-suited for low/medium density sites as well as for emergency back-up during natural disasters</p>\n\n<p><strong>MANAGEMENT:</strong></p>\n\n<p>• CEO Avellan holds 18 patents and was the founder of Emerging Markets Communications (sold for $550MM in 2016)</p>\n\n<p>• The deep executive ranks include executives from Orbital ATK, Globecomm, NASA, and Maxar • The team has 161 scientists and engineers, 34 of whom are PhDs</p>\n\n<p><strong>COMPETITION:</strong></p>\n\n<p>• ASTS competes with high-cost legacy providers, including Iridium • Legacy satellite providers require unique handsets for users to connect</p>\n\n<p>• ASTS also competes with the build-out of standard terrestrial 5G mobile equipment • Competitor Lynk advertises a similar product but appears significantly behind both with respect to commercial, financial and technical milestones</p>\n\n<p><strong>OTHER:</strong> Investors include Vodafone, Rakuten, American Tower, and Samsung; all of whom recently invested in the Company&#39;s latest financing.  The Company&#39;s own coverage banker at Barclays QUIT his job to join ASTS.  The dogs are eating the dog food.</p>\n\n<p><strong>TIMELINE:</strong></p>\n\n<p>• April 2019 – BW 1 was launched (the test satellite), validating system architecture and proving they could connect a mobile phone to a satellite and connect to an LTE system  • 2H 2021E will launch BW3, which is a scaled version of the constellation satellite • 2H 2022E/1H 2023E first commercial launches of 20 satellites for Equatorial coverage, with 110 satellites by YE 2023 and 168 satellites by YE 2024</p>\n\n<p><strong>ANALYSIS - THIS IS MY OPINION, AND SUBJECT TO DISCUSSION AND DISAGREEMENT</strong></p>\n\n<p>• ASTS is an exciting event-driven story stock with open-ended upside that is cemented in reality by proven entrepreneurs, significant industry backing, and <em>bone fide</em> strategic agreements in place that address key commercial aspects of the business</p>\n\n<p>• Management funded the seed capital for the business, highlighting their confidence and ‘skin in the game’</p>\n\n<p>• Targeting mobile 5G is a ‘<strong>big idea</strong>’ that augments that excitement generated by fixed-broadband players such as Starlink while addressing the cost accessibility issues that are likely to be present in developing markets</p>\n\n<p>• The stock benefits from a dynamic where it cannot be disproven, leaving investors free to speculate and discount key assumptions, including service penetration among partner carriers and ARPU</p>\n\n<p>• The investment set-up is favorable since a high capital intensity space venture is poorly suited for private markets, yet requires the capital available in the SPAC market – the set-up is not a ‘foist’ by private market investors onto unsuspecting retail investors but instead a legitimate capital raising exercise to fully-fund the project and remove financing risk</p>\n\n<p>• With 1-year lock-ups on existing investors and PIPE investors, there will be limited free float in what amounted to a “public Series C” financing</p>\n\n<p>• Given future CAPEX, Wall Street banks will see a large future banking opportunity and likely initiate favorable coverage on the Company</p>\n\n<p><strong>RISKS:</strong></p>\n\n<p>• While the <em>BlueWalker</em> satellite provided proof-of-concept, there are questions around whether ASTS will work at scale when the constellation is deployed</p>\n\n<p>• Users might experience significant battery drain on their devices when using the service, reducing appeal for full tower placement</p>\n\n<p>• Realized user penetration and ARPU remain uncertain as well as the ability to raise future capital for full system deployment at prices that avoid excessive dilution</p>\n\n<p>• ASTS will depend on capital markets to fully fund its growth and is susceptible to potential funding risk</p>\n\n<p><strong>INVESTMENT CHECKLIST:  Good hygiene to make sure something can make money as an investment</strong></p>\n\n<p><strong><em>BUSINESS MODEL</em></strong>:  ASTS will receive a 50/50 revenue split with its carrier partners including Vodafone and AT&amp;T; given its large, fixed cost base, the Company expects to generate 90% asset-level EBITDA margins that provide significant operating leverage and cash flow</p>\n\n<p><strong><em>GO-TO-MARKET:</em></strong>  In-place binding agreements with carriers provide ASTS with access to &gt;1.3BN existing customers without having to independently market to or acquire customers (or directly bear the cost of churn) • Phase 1 will target key Equatorial regions and cover 1.6BN people; subsequent phases expand into Europe and N. America – the total system will require 168 satellites by 2024</p>\n\n<p><strong><em>DEFENSIBILITY</em></strong>: ASTS has 750+ patents as well as a first-mover advantage • Commercial progress reinforces the Company’s technical lead in the market</p>\n\n<p><strong><em>CAPITAL</em></strong>: ASTS is capital intensive and subject to capital availability to complete its full system • Once the constellation is complete, the Company benefits from extreme operating leverage and should have extremely high cash flow conversation</p>\n\n<p><strong><em>TRACTION</em></strong>: ASTS appears to have extraordinary commercial partnership traction, however, it is yet unclear what end-user uptake the usage will be • Technical traction was ‘proved’ by the April 2019 launch of the <em>Bluewalker 1</em> test satellite</p>\n\n<p><strong><em>FINANCIALS</em></strong>:  With a market cap of ~$1.8bn, the company is expected to generate &gt;$1bn of EBITDA by 2024 based on 168 satellites launched, 27MM total subscribers, with an ARPU of $2.50 per user</p>\n\n<p>Below are projections:</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/q78k3rkk6k571.png?width=878&amp;format=png&amp;auto=webp&amp;s=7d03a94e2c9ae9c58e278e62d613cbf19d02dee8\">https://preview.redd.it/q78k3rkk6k571.png?width=878&amp;format=png&amp;auto=webp&amp;s=7d03a94e2c9ae9c58e278e62d613cbf19d02dee8</a></p>\n\n<p>When thinking about a hypothetical valuation, I pro-forma the numbers and apply a multiple in-line with the tower companies.  I treat depreciation as a real cash expense</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/xp15x4om6k571.png?width=488&amp;format=png&amp;auto=webp&amp;s=8fb6a1526b293fc54c82ed510c351f8288b69a1b\">https://preview.redd.it/xp15x4om6k571.png?width=488&amp;format=png&amp;auto=webp&amp;s=8fb6a1526b293fc54c82ed510c351f8288b69a1b</a></p>\n\n<p><strong>TECHNOLOGY DETAILS</strong></p>\n\n<p><strong><em>OVERVIEW</em></strong>: AST &amp; Science (“ASTS”) has designed a large aperture satellite system to provide ‘direct-to-device’ service to normal phones</p>\n\n<p><strong><em>BOOMBOX IN SPACE:</em></strong>  ASTS’ satellites are ~10x bigger than the norm because they are essentially cell-phone towers in space. With a 900-square meter array, the system is a large <strong>“loud”</strong> system that can connect with a regular mobile phone. Traditional satellite phones “listen hard” whereas ASTS simply produces a loud signal to connect to regular mobile phones</p>\n\n<p><strong><em>SOFTWARE:</em></strong>  ASTS’ system does not require a special chipset on the phone because of its proprietary back-end software system that allows for interconnection to existing terrestrial spectrum and telecom networks. The “magic” of the technology is the back-end software that allows the system to utilize terrestrial spectrum, seamlessly interconnect over existing networks, and talk directly to an LTE system; ASTS is 6G forward compatible</p>\n\n<p><strong><em>BACKHAUL</em></strong>:  Once the signal is collected from a handset, ASTS sends the data back on B-Band satellite spectrum to a ground gateway system. The phone-satellite connection is native to the carrier’s terrestrial spectrum</p>\n\n<p><strong><em>CAPACITY</em></strong>:  Each satellite can handle 1.2MM GB per month; extra capacity can be added by directing additional satellites at an area</p>\n\n<p><strong><em>WHAT DO WE KNOW</em></strong>:  What has ASTS done to prove its system?</p>\n\n<p>o <em>Bluewalker1</em> proved the RF could close (e.g. the power was sufficient to connect a normal phone) and that an LTE connection was achievable utilizing ASTS’ ‘magic’ software; ASTS launched a handset into space with the satellite on the ground to cost-effectively check an important element of technical diligence. <em>Bluewalker1</em> allowed for end-to-end connectivity testing, which has been reviewed over the last 1.5 years</p>\n\n<p>o <em>Bluewalker3</em> (2H 2021 launch) will be a scaled version of the system, which will de-risk components and demonstrate the full technology. BW3 will allow for software debugging to tune the full system</p>\n\n<p><strong><em>RISKS</em></strong>:  Most of the risks are timing risks. For instance, <em>Bluewalker3</em> could spur the need to tune microns, which could delay the system deployment by months. The troubleshooting required will be the beam forming in patterns to maintain a connection while managing handoffs</p>\n\n<p>A launch vehicle delay could delay the testing by 60 to 90 days</p>\n\n<p><strong><em>BENT PIPE</em></strong>:  The satellite itself is not complex – it is bent pipe in the sky; most of the design relates to distributing power. The satellite itself is not involved with processing or routing</p>\n\n<p>DISCLOSURE: I own 500,401 shares of common. Yes, this is a huge position. You only live once...invest carefully and with great vision.  To avoid accusations of being a shill, below is proof of my position.  I&#39;m grateful for the moderators working with me so that I can meet the requirements to post!  I have a new appreciation for the depth of validation they require.</p>\n\n<p>I don&#39;t want to test my luck, but I have a bunch of cool memes to share later...made them while passing those long, cold days when this stock seriously sucked.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/xyq67h3p6k571.png?width=1107&amp;format=png&amp;auto=webp&amp;s=981c4fb304754aeec4ffe3416055839e19594b73\">Proof of life (or future death if this investment doesn&#39;t work)</a></p>\n\n<p>Same account from mobile phone:</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/tz7oz0ur6k571.png?width=319&amp;format=png&amp;auto=webp&amp;s=6ed58161df770aaf3f907e02ead30b9a11ae7cd7\">https://preview.redd.it/tz7oz0ur6k571.png?width=319&amp;format=png&amp;auto=webp&amp;s=6ed58161df770aaf3f907e02ead30b9a11ae7cd7</a></p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/cugjotqs6k571.png?width=309&amp;format=png&amp;auto=webp&amp;s=145dfab9a474127880916d636f06bf2678f47253\">Some trade lots for further proof</a></p>\n</div><!-- SC_ON -->",
  "score": 1826,
  "permalink": "/r/wallstreetbets/comments/o1583q/asts_the_spacex_for_mobile_phones_6mm_yolo_with/",
  "subreddit": "wallstreetbets",
  "id": "o1583q",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1624009750297
}