{
  "author": "metalslimesolid",
  "original_created_utc": 1649176452,
  "title": "According to the recent news reports, Russia seems to be targeting and destroying Ukrainian culture such as museums, libraries and art galleries in an intentional effort to delete Ukrainian cultural heritage. Did similar things happen in the past?",
  "created_utc": 1649211552,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Besides recent attempts by groups like ISIS, do we have documented cases where erasing cultural heritage was something intentionally done by other empires or nations? I&amp;#39;ve heard about Napoleon shooting off noses of statues but I&amp;#39;m not sure if that was true or not&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 106,
  "permalink": "/r/AskHistorians/comments/twyzgr/according_to_the_recent_news_reports_russia_seems/",
  "subreddit": "AskHistorians",
  "id": "twyzgr",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Besides recent attempts by groups like ISIS, do we have documented cases where\nerasing cultural heritage was something intentionally done by other empires or\nnations? I've heard about Napoleon shooting off noses of statues but I'm not\nsure if that was true or not",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ISISのような集団による最近の試みの他に、以下のような事例が記録されているのでしょうか？\n文化遺産の抹消は、他の帝国や企業が意図的に行ったものである。\n国家は？ナポレオンが銅像の鼻を撃ち落としたという話は聞いたことがありますが\nそれが事実かどうかはわからないが",
      "title": "最近の報道によると、ロシアはウクライナの文化遺産を削除するために、博物館、図書館、アートギャラリーなどのウクライナ文化を意図的に狙い、破壊しているようです。過去にも同じようなことがあったのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "除了像ISIS这样的组织最近的尝试，我们是否有记录在案的案例，即\n抹去文化遗产是其他帝国或国家有意为之的事情？\n国家有意为之？我听说过拿破仑射掉雕像的鼻子，但我不确定这是不是真的。\n但我不确定这是否是真的",
      "title": "根据最近的新闻报道，俄罗斯似乎正在瞄准和破坏乌克兰文化，如博物馆、图书馆和艺术馆，有意删除乌克兰文化遗产。过去是否发生过类似的事情？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "除了像ISIS這樣的組織最近的嘗試，我們是否有記錄在案的案例，即\n抹去文化遺產是其他帝國或國家有意爲之的事情？\n國家有意爲之？我聽說過拿破崙射掉雕像的鼻子，但我不確定這是不是真的。\n但我不確定這是否是真的",
      "title": "根據最近的新聞報道，俄羅斯似乎正在瞄準和破壞烏克蘭文化，如博物館、圖書館和藝術館，有意刪除烏克蘭文化遺產。過去是否發生過類似的事情？"
    }
  ]
}