{
  "author": "leonidasthegeek",
  "original_created_utc": 1631735116,
  "title": "If You Don't Own Small Cap Altcoins, You're Missing Out: Here's the Hard Data.",
  "created_utc": 1631748994,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>TL;DR: Small-cap altcoins, on average, outperform the biggest cryptos. I&#39;ve got the data to back it up, and <a href=\"https://cryptopragmatist.com/sign-up/\">a way for you to find them.</a>  </p>\n\n<p><strong>Part One: The Problem</strong></p>\n\n<p>There’s one thing that’s become evident in crypto in the last market cycle: the biggest gains are no longer available for those who own Ethereum and Bitcoin.</p>\n\n<p>**Don&#39;t downvote me yet! I&#39;ve got the data to back it up:**</p>\n\n<p>While Bitcoin and Ethereum both seem like relatively secure bets in terms in at least holding their value over the long term, they pay for that (relative) security in terms of potential upside.</p>\n\n<p>Even if Bitcoin goes to liberal price targets of $500,000 to $1,000,000 dollars, that still only represents a return of 10x to 20x. Those multiples are similar when we look at Ethereum price targets of $50,000: about 15x from where we sit today. Nothing to scoff at, but nowhere near those 100x returns that blue-chip currencies once promised.</p>\n\n<p><strong>Part Two: The Solution</strong></p>\n\n<p>So where are these returns available? Small-cap altcoins—those small-cap, rising cryptocurrencies that come to the marketplace with a problem to solve and the promise that providing a solution can generate billions of dollars in value for founders and investors alike.</p>\n\n<p>Currencies like Solana, Terra Luna, and MATIC are all examples of investments that once fit under this &#39;small-cap altcoin&#39; label.</p>\n\n<p><strong>A Case Study</strong></p>\n\n<p>To emphasize my point, let’s put together three hypothetical $10,000 portfolios and pit them against each other, with a start date of January 1st, 2021 and an end date of September 14: a little under nine months.</p>\n\n<ul>\n<li><strong>Portfolio 1:</strong> $5000 invested in each of the top 2 cryptocurrencies (Ethereum and Bitcoin) on Jan 1</li>\n<li><strong>Portfolio 2:</strong> $1000 invested in each of the top 10 cryptocurrencies on Jan 1</li>\n<li><strong>Portfolio 3:</strong> $1000 invested in cryptocurrencies 91 - 100 by market cap on Jan 1</li>\n</ul>\n\n<p><a href=\"https://preview.redd.it/fxeby8faspn71.png?width=968&amp;format=png&amp;auto=webp&amp;s=fe064341b36baa3b1a1ac1779069eeaf60e37825\">https://preview.redd.it/fxeby8faspn71.png?width=968&amp;format=png&amp;auto=webp&amp;s=fe064341b36baa3b1a1ac1779069eeaf60e37825</a></p>\n\n<p>First of all, the worst of these portfolios returned 3x, which means if you invest in crypto at all, you’re well ahead of those who invest in real estate, stocks, bonds, or any other mainstream assets.</p>\n\n<p>But take a look at this portfolio of RANDOM altcoins (numbers 91-100 by market cap), which did better than the most popular altcoins, which in turn did better than the two most popularThat’s pretty striking, and upon reflection makes a lot of sense. Of course smaller, less known cryptocurrencies have higher upside potential! For a billion-dollar altcoin to double, it needs to increase in market cap by a billion dollars. For a $100 billion altcoin to double, it needs to increase in market cap by $100 billion. That feat is mathematically 100x as difficult.</p>\n\n<p>These smaller altcoins are not as well known, and they’re not as well understood. They’re bringing new ideas to the marketplace, unproved ones that will either bring them to incredible valuations or lead them to fail in a dramatic fashion.</p>\n\n<p>But if you can pick out which ideas are valuable, which theses will be validated and identify which ones have unsustainable economics and sketchy value propositions, the market will reward you to the tune of exponential returns.</p>\n\n<p><strong>Average Returns by Ranking:</strong></p>\n\n<p>I can see how that table of hypothetical portfolios could be seen as misleading, so I&#39;ve taken a look at the Top 190 cryptos by market cap (I eliminated all dollar-pegged stablecoins) to see the average returns.</p>\n\n<p><a href=\"https://preview.redd.it/gea4oxbdupn71.png?width=1600&amp;format=png&amp;auto=webp&amp;s=55705e4f4ee268db0529f5204d581cadc69209d3\">(A note: coins that returned over 25x are included in the data set, but aren&#39;t displayed on the graph. They are the following: NPXS (25.05x), QNT (34.62x), DOGE (41.5x), ONE (43.43x), LUNA (57.3x), MATIC (70.19x), (FTM 75.45x)</a></p>\n\n<p>Then I performed a linear regression on the data set. Cryptos 101-190 (again, eliminating altcoins) returned, on average, an additional 200%+ compared to their original values. The first 100 cryptos returned an average of 5.48x, while the second 90 returned an average of 7.59x.</p>\n\n<p><strong>For every $1000 invested, the smaller-cap cryptos would have returned, on average, an extra $2000 compared to large-cap cryptos!</strong></p>\n\n<p>Here&#39;s a table of the data:</p>\n\n<table><thead>\n<tr>\n<th align=\"left\">Average Return, 1-100</th>\n<th align=\"left\">5.48x</th>\n</tr>\n</thead><tbody>\n<tr>\n<td align=\"left\">Average Return, 50 - 150</td>\n<td align=\"left\">7.13x</td>\n</tr>\n<tr>\n<td align=\"left\">Average Return, 101-190</td>\n<td align=\"left\">7.59x</td>\n</tr>\n<tr>\n<td align=\"left\">Average Return, All Data</td>\n<td align=\"left\">6.48x</td>\n</tr>\n</tbody></table>\n\n<p>&#x200B;</p>\n\n<p><strong>Blue-Chip Cryptos are Still Important:</strong></p>\n\n<p>Large cap cryptos have a tremendous still have a tremendous advantage over small cap cryptos, in two main ways:</p>\n\n<ol>\n<li>Volatility</li>\n<li>Downside Risk</li>\n</ol>\n\n<p>While only 5% of the top 100 cryptos lost money over the last 9 months, almost 10% of cryptos 101-190 did. And, since it&#39;s easier to move the prices of small-cap cryptos up, well, it&#39;s easier to move them down as well, leading to volatility. Those blue-chip cryptos hold onto a lot of more their value in downturns/bear markets/dumps, while small cryptos can lose a lot.</p>\n\n<p>If you&#39;re scared of downside risk, buy Bitcoin. It&#39;s a lot less likely for you to lose all of your money.</p>\n\n<p>&#x200B;</p>\n\n<p><strong>Altcoin Strategy</strong></p>\n\n<p>There&#39;s one thing incredibly important to note: this style of investing is based on <strong>averages</strong>.</p>\n\n<p>Here&#39;s a quote that characterizes altcoin investing:</p>\n\n<blockquote>\n<p>“If you make 100 investments and just one yields a 1000x return, the other 99 investments could go to zero and you would still see a return of 10x for your portfolio.”  </p>\n\n<p>- <strong>Naval Ravikant</strong></p>\n</blockquote>\n\n<p>If you&#39;re psychologically unprepared to take a big loss, altcoin investing isn&#39;t for you. As with investing in startups, it&#39;s a game of bets and probabilities.</p>\n\n<p>You&#39;ve got to be willing to lose all of your money on some investments. Of the top 10 cryptos, not a single one of them lost money YTD. Of the smallest 90 cryptos I analyzed, 80% returned below-average for their cohort.</p>\n\n<p>But the BEST ones outperformed enough to bring the overall portfolio to stratospheric levels.</p>\n\n<p>&#x200B;</p>\n\n<p><strong>Portfolio Construction</strong></p>\n\n<p>So by understanding the data, we can come to a simple answer for how to construct a portfolio: you must closely analyze altcoins and construct a portfolio of multiple coins that have:</p>\n\n<ol>\n<li>Minimal risk</li>\n<li>Maximal upside</li>\n</ol>\n\n<p>As to how you accomplish that, well, we&#39;ll get to that another day.</p>\n\n<p>EDIT: I know Reddit doesn&#39;t like self-promo, but I write about making money with altcoins in my email newsletter: Check it out here: <a href=\"https://cryptopragmatist.com/sign-up/\">cryptopragmatist.com/sign-up/</a></p>\n</div><!-- SC_ON -->",
  "score": 200,
  "permalink": "/r/CryptoCurrency/comments/poxezk/if_you_dont_own_small_cap_altcoins_youre_missing/",
  "subreddit": "CryptoCurrency",
  "id": "poxezk",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "TL;DR: Small-cap altcoins, on average, outperform the biggest cryptos. I've got\nthe data to back it up, and a way for you to find them.\n[https://cryptopragmatist.com/sign-up/]\n\nPart One: The Problem\n\nThere’s one thing that’s become evident in crypto in the last market cycle: the\nbiggest gains are no…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "TL;DR：小型株のアルトコインは、平均して最大のクリプトをアウトパフォームする。私が持っている\nそれを裏付けるデータがあり、あなたがそれを見つける方法もあります。\n[https://cryptopragmatist.com/sign-up/]\n\nパート1：問題点\n\n過去の市場サイクルにおいて、暗号で明らかになったことが1つあります。\n最大の利益は...",
      "title": "スモールキャップのアルトコインを所有していない人は損をしている：ここにハードデータがあります。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "TL;DR：平均而言，小市值的altcoins表现优于最大的cryptos。我已经有\n数据来支持它，并为你提供了一个找到它们的方法。\n[https://cryptopragmatist.com/sign-up/]\n\n第一部分：问题\n\n在过去的市场周期中，有一件事在加密货币中变得很明显：最大的收益没有\n最大的收益并不是...",
      "title": "如果你不拥有小市值的新币，你就错过了：这是硬数据。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "TL;DR：平均而言，小市值的altcoins表現優於最大的cryptos。我已經有\n數據來支持它，併爲你提供了一個找到它們的方法。\n[https://cryptopragmatist.com/sign-up/]\n\n第一部分：問題\n\n在過去的市場週期中，有一件事在加密貨幣中變得很明顯：最大的收益沒有\n最大的收益並不是...",
      "title": "如果你不擁有小市值的新幣，你就錯過了：這是硬數據。"
    }
  ]
}