{
  "author": "Snooboo00",
  "original_created_utc": 1659412635,
  "title": "Guys, what do you think about your partner farting in front of you?",
  "created_utc": 1659447250,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I’ve dated my bf for almost 4 years now and still don’t have the courage to let it out in front of him out of embarrassment. I’ve always been this way even growing up I couldn’t let it out in front of my best friend, or family or anyone. I just don’t have that comfortability but I wanna get there lol. So yeah; what do you guys really think of your gf letting one rip in front of you?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 106,
  "permalink": "/r/TooAfraidToAsk/comments/we1kpj/guys_what_do_you_think_about_your_partner_farting/",
  "subreddit": "TooAfraidToAsk",
  "id": "we1kpj",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I’ve dated my bf for almost 4 years now and still don’t have the courage to let\nit out in front of him out of embarrassment. I’ve always been this way even\ngrowing up I couldn’t let it out in front of my best friend, or family or\nanyone. I just don’t have that comfortability but I wanna get there…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "4年近く付き合っている彼氏がいるのですが、恥ずかしくてまだ告白する勇気がありません。\n恥ずかしくて言い出せません。幼い頃からずっとそうで\n親友の前でも、家族の前でも、誰の前でも、その気持ちを吐き出すことができません。\n誰にも言えない。ただ、その心地よさがないだけなんだ......でも、そこにたどり着きたい。",
      "title": "みんな、パートナーが目の前でおならをすることについてどう思う？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我已经和我的男朋友约会了近4年，但仍然没有勇气让他离开我。\n在他面前说出来，因为感到尴尬。我一直都是这样，甚至\n在成长过程中，我不能在我最好的朋友、家人或任何人面前说出来。\n任何人。我只是没有那种舒适感，但我想达到这个目的......",
      "title": "伙计们，对于你的伴侣在你面前放屁，你有什么看法？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我已經和我的男朋友約會了近4年，但仍然沒有勇氣讓他離開我。\n在他面前說出來，因爲感到尷尬。我一直都是這樣，甚至\n在成長過程中，我不能在我最好的朋友、家人或任何人面前說出來。\n任何人。我只是沒有那種舒適感，但我想達到這個目的......",
      "title": "夥計們，對於你的伴侶在你面前放屁，你有什麼看法？"
    }
  ]
}