{
  "author": "Ultomatoe",
  "original_created_utc": 1649858528,
  "title": "Is Russia truly doing such a poor job in the invasion of Ukraine or are we just being fed propaganda?",
  "created_utc": 1649863504,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Propaganda is certainly in full swing on both sides but the narrative, from a western perspective, is that Russia has royally screwed the pooch during this invasion. If we are to believe what is being spoken it seems like they are just throwing meat and materials into the grinder in Ukraine and getting obliterated. Are the Russians truly taking such monumental losses and is their economy soon to be as fucked as people claim?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 450,
  "permalink": "/r/NoStupidQuestions/comments/u2r0y1/is_russia_truly_doing_such_a_poor_job_in_the/",
  "subreddit": "NoStupidQuestions",
  "id": "u2r0y1",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Propaganda is certainly in full swing on both sides but the narrative, from a\nwestern perspective, is that Russia has royally screwed the pooch during this\ninvasion. If we are to believe what is being spoken it seems like they are just\nthrowing meat and materials into the grinder in Ukraine and…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "プロパガンダは確かに双方とも盛んだが、物語、からすると\n西側の視点に立つと、ロシアはこの事件で見事に失敗してしまったということになる。\nの侵攻を防ぐことができます。もしこの話を信じるなら、彼らはただ単に\nウクライナの粉砕機に肉と材料を投入して...",
      "title": "ロシアは本当にウクライナ侵攻でこれほどお粗末な仕事をしているのか、それともプロパガンダに踊らされているだけなのか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "双方的宣传当然都在如火如荼地进行，但从西方的角度看，叙述的内容是俄罗斯在这次事件中彻底搞砸了。\n但从西方的角度来看，俄罗斯在这次入侵中把事情搞砸了。\n入侵。如果我们相信人们所说的，那么他们似乎只是\n他们只是把肉和材料扔进了乌克兰的研磨机，而...",
      "title": "俄罗斯在入侵乌克兰的过程中是否真的做得如此糟糕，还是我们只是被灌输了宣传？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "雙方的宣傳當然都在如火如荼地進行，但從西方的角度看，敘述的內容是俄羅斯在這次事件中徹底搞砸了。\n但從西方的角度來看，俄羅斯在這次入侵中把事情搞砸了。\n入侵。如果我們相信人們所說的，那麼他們似乎只是\n他們只是把肉和材料扔進了烏克蘭的研磨機，而...",
      "title": "俄羅斯在入侵烏克蘭的過程中是否真的做得如此糟糕，還是我們只是被灌輸了宣傳？"
    }
  ]
}