{
  "author": "lucrica",
  "the_new_excerpt": "First of all I want to thank everyone in this subreddit, expecially those of you\nwho write beautiful stuff to enrich my knowledge in cryptocurrency.\n\nSo I am from one of the developing countries and many people don't know about\ncrypto currency, I have a former school mate who holds masters in…",
  "original_created_utc": 1613567840,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "首先，我要感谢这个次元的每一个人，尤其是你们这些人\n谁写的东西很美，以丰富我在加密货币方面的知识。\n\n所以，我来自发展中国家，很多人不了解\n加密货币，我有一个以前的同学，他拥有硕士... ...",
      "title": "因为比特币达到5万，所以捐给了农村饥民"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "首先，我要感謝這個次元的每一個人，尤其是你們這些人\n誰寫的東西很美，以豐富我在加密貨幣方面的知識。\n\n所以，我來自發展中國家，很多人不瞭解\n加密貨幣，我有一個以前的同學，他擁有碩士... ...",
      "title": "因爲比特幣達到5萬，所以捐給了農村饑民"
    }
  ],
  "title": "Donated to rural famers because Bitcoin reached 50k",
  "created_utc": 1613608247,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>First of all I want to thank everyone in this subreddit, expecially those of you who write beautiful stuff to enrich my knowledge in cryptocurrency.</p>\n\n<p>So I am from one of the developing countries and many people don&#39;t know about crypto currency, I have a former school mate who holds masters in finance but does not believe in Bitcoin and calls bitcoin a bubble.\nSo when bitcoin reached 20k I told him bitcoin will get to 50k by end of year and he told its a lie, it&#39;s going to burst like 2017.</p>\n\n<p>So we bet $100 each,  if by end of year bitcoin hits 50k all the $ 200 is mine and if it doesn&#39;t hit 50k I loose my $100 so we bet. And lo and behold bitcoin is over 51k today.</p>\n\n<p>I took the money and decided to donate to rural animal famers education project.</p>\n\n<p>Modes can reach me for donations receipts.</p>\n\n<p>Thank you all.</p>\n</div><!-- SC_ON -->",
  "score": 168,
  "permalink": "/r/CryptoCurrency/comments/lluapu/donated_to_rural_famers_because_bitcoin_reached/",
  "subreddit": "CryptoCurrency",
  "id": "lluapu",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613728620218
}