{
  "author": "naturestroll",
  "the_new_excerpt": "Hello. I am investing my after-tax dollars into VTI, the Vanguard Total stock\nmarket index fund. As you know, the stock market is at or near an all-time high.\nI am a long-term investor who primarily has dollar cost averaged. This is not a\ntrade. Even so, should I still be taking some of the money…",
  "original_created_utc": 1623758606,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "こんにちは。私は税引き後のお金をVTI（バンガード・トータル・ストック・マーケット・インデックス・ファンド）に投資しています。\n市場インデックスファンドです。ご存知の通り、株式市場は史上最高値かそれに近い状態です。\n私は主にドルコスト平均法を行っている長期投資家です。これはトレードではありません。\nトレードではありません。そうは言っても、やはり一部のお金を取るべきなのでしょうか...。",
      "title": "市場が上昇しているときには、インデックスファンドから利益を得るべきでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "你好。我将我的税后资金投资于VTI，即Vanguard Total Stock\n市场指数基金。如你所知，股市正处于或接近历史高点。\n我是一个长期投资者，主要有美元成本平均法。这不是一个\n交易。即便如此，我是否仍应将部分资金...",
      "title": "当市场上涨时，我应该从指数基金中获利吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "你好。我將我的稅後資金投資於VTI，即Vanguard Total Stock\n市場指數基金。如你所知，股市正處於或接近歷史高點。\n我是一個長期投資者，主要有美元成本平均法。這不是一個\n交易。即便如此，我是否仍應將部分資金...",
      "title": "當市場上漲時，我應該從指數基金中獲利嗎？"
    }
  ],
  "title": "Should I take profits from index fund when market is up?",
  "created_utc": 1623771264,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hello. I am investing my after-tax dollars into VTI, the Vanguard Total stock market index fund. As you know, the stock market is at or near an all-time high. I am a long-term investor who primarily has dollar cost averaged. This is not a trade. Even so, should I still be taking some of the money out of that account when the stock market does well? I suppose that would be with the view of reinvesting some of that money if the market were to go down considerably. If I should take some money out, how much? Please note that I am aware that I would have to pay taxes on that. Any guidance you could provide would be helpful. Most of the info out there pertains to taking money from Individual stocks, not index funds. Regards.</p>\n</div><!-- SC_ON -->",
  "score": 280,
  "permalink": "/r/investing/comments/o0cqt1/should_i_take_profits_from_index_fund_when_market/",
  "subreddit": "investing",
  "id": "o0cqt1",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1624009742348
}