{
  "author": "HugoWullAMA",
  "original_created_utc": 1656160711,
  "title": "90’s Norwegian black metal bands were infamously violent towards Christianity and churches. Did this antagonism originate within the metal subculture, or did it have roots in other movements of the time?",
  "created_utc": 1656172513,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;In the early 90s, black metal musicians in Norway were famously anti-Christian, explicitly promoted Satanism and Paganism, and were collectively  responsible for a string of church burnings. Did this approach to religion originate within that particular community, or was it based on other cultural trends or non-metal subcultures? In particular, I’m interested in the calls to action against places of worship, and the motivated return to worshipping historic Norse Gods.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 114,
  "permalink": "/r/AskHistorians/comments/vke6wh/90s_norwegian_black_metal_bands_were_infamously/",
  "subreddit": "AskHistorians",
  "id": "vke6wh",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "In the early 90s, black metal musicians in Norway were famously anti-Christian,\nexplicitly promoted Satanism and Paganism, and were collectively responsible for\na string of church burnings. Did this approach to religion originate within that\nparticular community, or was it based on other cultural…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "90年代初頭、ノルウェーのブラックメタルミュージシャンは、反キリスト教的であったことで有名です。\n悪魔崇拝や異教徒崇拝を露骨に推進し、教会を次々と焼いたことで有名です。\n教会を焼き討ちする事件が相次ぎました。このような宗教へのアプローチは、その特定のコミュニティで生まれたものなのでしょうか。\nそれとも、他の文化に基づくものなのだろうか？",
      "title": "90年代のノルウェーのブラックメタルバンドは、キリスト教や教会に対して悪名高く暴力的であった。この反感は、メタルというサブカルチャーの中で生まれたものなのか、それとも当時の他のムーブメントに根差したものなのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在90年代初，挪威的黑金属音乐人是著名的反基督教者。\n明确宣扬撒旦主义和异教，并对一连串烧毁教堂的事件负有集体责任。\n一系列烧毁教堂的事件。这种对宗教的态度是源自于那个特定的社区，还是基于\n这种对宗教的态度是源于那个特定的社区，还是基于其他文化...",
      "title": "90年代的挪威黑金属乐队对基督教和教堂的暴力行为是臭名昭著的。这种对立情绪是源于金属亚文化，还是源于当时的其他运动？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在90年代初，挪威的黑金屬音樂人是著名的反基督教者。\n明確宣揚撒旦主義和異教，並對一連串燒燬教堂的事件負有集體責任。\n一系列燒燬教堂的事件。這種對宗教的態度是源自於那個特定的社區，還是基於\n這種對宗教的態度是源於那個特定的社區，還是基於其他文化...",
      "title": "90年代的挪威黑金屬樂隊對基督教和教堂的暴力行爲是臭名昭著的。這種對立情緒是源於金屬亞文化，還是源於當時的其他運動？"
    }
  ]
}