{
  "approved_at_utc": null,
  "subreddit": "Bogleheads",
  "selftext": "I am a long-time Boglehead and index fund investor. Recently I am ruminating on some things and it is causing me to question my assumptions about investing in general, and about the stock market in particular. \n\nI would like to hear everyone's thoughts on the following--Is it possible that we have a widespread cultural delusion that stocks have more value than they actually have? \n\nThe thing that is nagging me is my corporations class from law school many years ago. That class is just case study after case study in which minority shareholders in closely-held corporations are effectively frozen out. Our casebook is filled with examples of people finding out that, despite owing large numbers of shares in a profitable business, their shares were effectively worthless. They had nothing. Sometimes the court would provide a remedy (forcing the board to issue a dividend or awarding damages), but more often than not the plaintiffs were left with useless shares. They couldn't even be sold because nobody would want to buy them. \n\nThe concept of \"investing\" is a very seductive one--the idea that you can defer rewards now for greater rewards later; that you can take at least partial ownership of a business and that your personal fortune will rise and fall with it. For many it is just a means of managing their finances. For others, I suspect it may be more than that. In our consumer society, we are making statements about ourselves by what we do and do not consume. For instance, Bogleheads might be saying \"look at me, I am living within my means and preparing for a rainy day. I'm responsible. I'm not taken in by hype or temporary fads. I stay the course. The numbers bear me out too. Historically, the American stock market has never lost in the long term, so I don't panic and sell at precisely the wrong time like other short-sighted people have done.\"\n\nBut what is \"investing\" really? Particularly, what is the value of a share of stock in a publicly-traded corporation? Take Meta (FB) for instance? Mark Zuckerberg personally controls over 50% of the voting shares of this company. What that means is that he has total control over the board of directors. Sure you can buy shares in the company, but not only will you never have enough shares to control a board seat, there is no possibility for anyone else to do so either. No private equity group or activist investor will ever try to buy your shares in order to attempt to take control of the company (unless Zuckerberg dies and divides his shares up amongst his heirs and some of them are willing to sell). Further, Meta does not issue a dividend. \n\nTherefore the only ways you can obtain any benefit from owing a share of FB would be the following:\n\n1. FB decides to issue a dividend in the future\n2. FB decides to \"wind up\" / conclude its business--they sell everything, pay off their creditors and pay out the remaining \"residual\" value of whatever is left to the shareholders (this number is usually 0 when this happens). \n3. You join in some sort of class action / derivative suit to sue the board and maybe win some paltry damages that mostly go to paying your attorney. \n4. You sell your share to some other rube. \n\nIf I'm not mistaken, there are numerous companies like FB where a single person or family or firm maintains control of a majority of voting shares, such that your shares have extremely limited utility. Yet under the passive indexing model, these shares are not discounted in any way. \n\nAm I mistaken in my analysis or does that mean that a tremendous number of publicly-traded shares of stock are presumed to have value that is not really there? I understand that markets determine the value of these shares. What I want to know is, do you think there is a realistic scenario in which the markets permanently change their minds about the \"value\" of stock shares? \n\nFor instance, in Japan, where share values have gone sideways for decades, shares of domestic stocks in retail companies come with kabu nushi yutai ken (shareholder benefits). If you have 100 shares in a movie theater company, you get two free movie tickets per year, or if you have shares in a fast food company, you get a free meal, etc. Accordingly, shares of stock in these companies come with actual benefits for the shareholders. In the U.S. we have nothing like this, but still we take it as an article of faith that our shares have \"value\" and we are willing to park our life savings in them. Do you think a permanent collapse in stock market value is possible? \n\nSome might say, \"even if such a scenario is possible, the value of your portfolio will be the least of your worries,\" to which I would say that is not necessarily the case. Think about things like the East Asian financial crisis, the Argentinian default or Germany's interwar inflation crisis. In those cases people's \"investment\" values were wiped out, but life still went on.",
  "author_fullname": "t2_as1t2",
  "saved": false,
  "mod_reason_title": null,
  "gilded": 0,
  "clicked": false,
  "title": "Are stocks real?",
  "link_flair_richtext": [],
  "subreddit_name_prefixed": "r/Bogleheads",
  "hidden": false,
  "pwls": 6,
  "link_flair_css_class": null,
  "downs": 0,
  "top_awarded_type": null,
  "hide_score": false,
  "name": "t3_udawra",
  "quarantine": false,
  "link_flair_text_color": "dark",
  "upvote_ratio": 0.73,
  "author_flair_background_color": null,
  "subreddit_type": "public",
  "ups": 77,
  "total_awards_received": 0,
  "media_embed": {},
  "author_flair_template_id": null,
  "is_original_content": false,
  "user_reports": [],
  "secure_media": null,
  "is_reddit_media_domain": false,
  "is_meta": false,
  "category": null,
  "secure_media_embed": {},
  "link_flair_text": null,
  "can_mod_post": false,
  "score": 77,
  "approved_by": null,
  "is_created_from_ads_ui": false,
  "author_premium": false,
  "thumbnail": "",
  "edited": false,
  "author_flair_css_class": null,
  "author_flair_richtext": [],
  "gildings": {},
  "content_categories": null,
  "is_self": true,
  "mod_note": null,
  "created": 1651085705,
  "link_flair_type": "text",
  "wls": 6,
  "removed_by_category": null,
  "banned_by": null,
  "author_flair_type": "text",
  "domain": "self.Bogleheads",
  "allow_live_comments": false,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I am a long-time Boglehead and index fund investor. Recently I am ruminating on some things and it is causing me to question my assumptions about investing in general, and about the stock market in particular. &lt;/p&gt;\n\n&lt;p&gt;I would like to hear everyone&amp;#39;s thoughts on the following--Is it possible that we have a widespread cultural delusion that stocks have more value than they actually have? &lt;/p&gt;\n\n&lt;p&gt;The thing that is nagging me is my corporations class from law school many years ago. That class is just case study after case study in which minority shareholders in closely-held corporations are effectively frozen out. Our casebook is filled with examples of people finding out that, despite owing large numbers of shares in a profitable business, their shares were effectively worthless. They had nothing. Sometimes the court would provide a remedy (forcing the board to issue a dividend or awarding damages), but more often than not the plaintiffs were left with useless shares. They couldn&amp;#39;t even be sold because nobody would want to buy them. &lt;/p&gt;\n\n&lt;p&gt;The concept of &amp;quot;investing&amp;quot; is a very seductive one--the idea that you can defer rewards now for greater rewards later; that you can take at least partial ownership of a business and that your personal fortune will rise and fall with it. For many it is just a means of managing their finances. For others, I suspect it may be more than that. In our consumer society, we are making statements about ourselves by what we do and do not consume. For instance, Bogleheads might be saying &amp;quot;look at me, I am living within my means and preparing for a rainy day. I&amp;#39;m responsible. I&amp;#39;m not taken in by hype or temporary fads. I stay the course. The numbers bear me out too. Historically, the American stock market has never lost in the long term, so I don&amp;#39;t panic and sell at precisely the wrong time like other short-sighted people have done.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;But what is &amp;quot;investing&amp;quot; really? Particularly, what is the value of a share of stock in a publicly-traded corporation? Take Meta (FB) for instance? Mark Zuckerberg personally controls over 50% of the voting shares of this company. What that means is that he has total control over the board of directors. Sure you can buy shares in the company, but not only will you never have enough shares to control a board seat, there is no possibility for anyone else to do so either. No private equity group or activist investor will ever try to buy your shares in order to attempt to take control of the company (unless Zuckerberg dies and divides his shares up amongst his heirs and some of them are willing to sell). Further, Meta does not issue a dividend. &lt;/p&gt;\n\n&lt;p&gt;Therefore the only ways you can obtain any benefit from owing a share of FB would be the following:&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;FB decides to issue a dividend in the future&lt;/li&gt;\n&lt;li&gt;FB decides to &amp;quot;wind up&amp;quot; / conclude its business--they sell everything, pay off their creditors and pay out the remaining &amp;quot;residual&amp;quot; value of whatever is left to the shareholders (this number is usually 0 when this happens). &lt;/li&gt;\n&lt;li&gt;You join in some sort of class action / derivative suit to sue the board and maybe win some paltry damages that mostly go to paying your attorney. &lt;/li&gt;\n&lt;li&gt;You sell your share to some other rube. &lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;If I&amp;#39;m not mistaken, there are numerous companies like FB where a single person or family or firm maintains control of a majority of voting shares, such that your shares have extremely limited utility. Yet under the passive indexing model, these shares are not discounted in any way. &lt;/p&gt;\n\n&lt;p&gt;Am I mistaken in my analysis or does that mean that a tremendous number of publicly-traded shares of stock are presumed to have value that is not really there? I understand that markets determine the value of these shares. What I want to know is, do you think there is a realistic scenario in which the markets permanently change their minds about the &amp;quot;value&amp;quot; of stock shares? &lt;/p&gt;\n\n&lt;p&gt;For instance, in Japan, where share values have gone sideways for decades, shares of domestic stocks in retail companies come with kabu nushi yutai ken (shareholder benefits). If you have 100 shares in a movie theater company, you get two free movie tickets per year, or if you have shares in a fast food company, you get a free meal, etc. Accordingly, shares of stock in these companies come with actual benefits for the shareholders. In the U.S. we have nothing like this, but still we take it as an article of faith that our shares have &amp;quot;value&amp;quot; and we are willing to park our life savings in them. Do you think a permanent collapse in stock market value is possible? &lt;/p&gt;\n\n&lt;p&gt;Some might say, &amp;quot;even if such a scenario is possible, the value of your portfolio will be the least of your worries,&amp;quot; to which I would say that is not necessarily the case. Think about things like the East Asian financial crisis, the Argentinian default or Germany&amp;#39;s interwar inflation crisis. In those cases people&amp;#39;s &amp;quot;investment&amp;quot; values were wiped out, but life still went on.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "likes": null,
  "suggested_sort": null,
  "banned_at_utc": null,
  "view_count": null,
  "archived": false,
  "no_follow": false,
  "is_crosspostable": false,
  "pinned": false,
  "over_18": false,
  "awarders": [],
  "media_only": false,
  "can_gild": false,
  "spoiler": false,
  "locked": false,
  "author_flair_text": null,
  "treatment_tags": [],
  "visited": false,
  "removed_by": null,
  "num_reports": null,
  "distinguished": null,
  "subreddit_id": "t5_2shb7",
  "author_is_blocked": false,
  "mod_reason_by": null,
  "removal_reason": null,
  "link_flair_background_color": "",
  "id": "udawra",
  "is_robot_indexable": true,
  "report_reasons": null,
  "author": "Vanderkaum037",
  "discussion_type": null,
  "num_comments": 45,
  "send_replies": true,
  "whitelist_status": "all_ads",
  "contest_mode": false,
  "mod_reports": [],
  "author_patreon_flair": false,
  "author_flair_text_color": null,
  "permalink": "/r/Bogleheads/comments/udawra/are_stocks_real/",
  "parent_whitelist_status": "all_ads",
  "stickied": false,
  "url": "https://www.reddit.com/r/Bogleheads/comments/udawra/are_stocks_real/",
  "subreddit_subscribers": 157054,
  "created_utc": 1651104375,
  "num_crossposts": 0,
  "media": null,
  "is_video": false,
  "original_created_utc": 1651085705,
  "the_new_excerpt": "I am a long-time Boglehead and index fund investor. Recently I am ruminating on\nsome things and it is causing me to question my assumptions about investing in\ngeneral, and about the stock market in particular.\n\nI would like to hear everyone's thoughts on the following--Is it possible that\nwe have a…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は長年ボーグルヘッドでインデックスファンドに投資している者です。最近、私はあることを反芻しています。\n投資全般、特に株式市場について、自分の思い込みに疑問を感じています。\n特に株式市場について。\n\n私は、次のことについて皆の考えを聞きたい--それは、可能ですか？\n私たちは...",
      "title": "株は本物か？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我是一个长期的Boglehead和指数基金投资者。最近我在思考\n一些事情，它使我对自己关于投资的假设产生了怀疑。\n特别是关于股票市场。\n\n我想听听大家对以下问题的看法--是否有可能\n我们有一个...",
      "title": "股票是真的吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我是一個長期的Boglehead和指數基金投資者。最近我在思考\n一些事情，它使我對自己關於投資的假設產生了懷疑。\n特別是關於股票市場。\n\n我想聽聽大家對以下問題的看法--是否有可能\n我們有一個...",
      "title": "股票是真的嗎？"
    }
  ],
  "source_updated_at": 1651225505353
}