{
  "author": "cassivelllaunus",
  "original_created_utc": 1625805228,
  "title": "During the time of the Hundred Years' War (1337-1453), England was estimated to have 15-20% of the population of France based on medieval demography. How could England wage a war under these conditions?",
  "created_utc": 1625835745,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>The demography data I was able to come by stems from the Wikipedia page on Medieval Demography and the corresponding estimates. I understand that at this time, far from being nationalistic, military matters were somewhat feudal and relied on small professional armies, and that the House of Plantagenet relied on some allies on the continent. Nonetheless, this population difference seems massive. How was the House of Valois not able to absolutely dominate the war?</p>\n</div><!-- SC_ON -->",
  "score": 110,
  "permalink": "/r/AskHistorians/comments/ogo6kl/during_the_time_of_the_hundred_years_war_13371453/",
  "subreddit": "AskHistorians",
  "id": "ogo6kl",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "The demography data I was able to come by stems from the Wikipedia page on\nMedieval Demography and the corresponding estimates. I understand that at this\ntime, far from being nationalistic, military matters were somewhat feudal and\nrelied on small professional armies, and that the House of…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私が入手できた人口統計データは、ウィキペディアの「中世の人口統計」のページから得たものです。\n中世の人口統計と、それに対応する推定値です。私の理解では、この時代\nこの時代、軍事的には国粋主義とは程遠い、やや封建的なものであり\n小規模なプロの軍隊に頼っていたと理解していますし、家...",
      "title": "百年戦争（1337〜1453年）の頃、中世の人口統計からイングランドの人口はフランスの15〜20％と推定されていました。このような状況下で、イングランドはどのようにして戦争をしたのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我能够得到的人口数据源于维基百科上的\n中世纪的人口统计和相应的估计。我了解到，在这一时期\n我了解到，在这一时期，军事事务远非民族主义，而是有点封建的，并依赖于小规模的亲信。\n依靠小规模的职业军队，而且，在这一时期的家族中，有很多人都是 \"小人物\"。",
      "title": "在百年战争（1337-1453）期间，根据中世纪的人口统计，英国的人口估计为法国的15-20%。在这种情况下，英国如何能发动战争？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我能夠得到的人口數據源於維基百科上的\n中世紀的人口統計和相應的估計。我瞭解到，在這一時期\n我瞭解到，在這一時期，軍事事務遠非民族主義，而是有點封建的，並依賴於小規模的親信。\n依靠小規模的職業軍隊，而且，在這一時期的家族中，有很多人都是 \"小人物\"。",
      "title": "在百年戰爭（1337-1453）期間，根據中世紀的人口統計，英國的人口估計爲法國的15-20%。在這種情況下，英國如何能發動戰爭？"
    }
  ]
}