{
  "author": "litlee",
  "original_created_utc": 1637932748,
  "title": "Why I think the dip will dip more",
  "created_utc": 1637959289,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Not TA. More like <a href=\"/r/cc\">r/cc</a> - A.</p>\n\n<p>I&#39;ve been on this sub nearly a year and it&#39;s a much more accurate gauge of the market fear and greed than anything else I&#39;ve seen</p>\n\n<p>Sentiment flips quicker than the minute charts.</p>\n\n<p>Right now there&#39;s still just a little too much hope in the posts imo.</p>\n\n<p>&quot;Black friday sale&quot; just feels like too much optimism to me.</p>\n\n<p>My thoughts are that we will go up a little say btc to 56/57 again over the next 2 days and we&#39;ll have a lot of &quot;I bought the dip!&quot; Posts and then we&#39;ll get a nice drop to around 50/51 and shake out a few more of the hopeful people. </p>\n\n<p>Hopefully we get some &quot;I&#39;m done buying dips now!&quot; Posts or even some &quot;why I&#39;m leaving crypto for good!&quot; Posts</p>\n\n<p>Then will be the time to buy in big! </p>\n\n<p>In all seriousness if you are trying to  &quot;be greedy when others are fearful&quot; then having a quick scroll on new will let you know the general semtiment to go against! </p>\n\n<p>Maybe it is an unforseen benefit of moons. If people are being incentivised to post more then many more regular opinion posts will appear even from people who never post in other subs</p>\n</div><!-- SC_ON -->",
  "score": 208,
  "permalink": "/r/CryptoCurrency/comments/r2nawr/why_i_think_the_dip_will_dip_more/",
  "subreddit": "CryptoCurrency",
  "id": "r2nawr",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Not TA. More like r/cc [/r/cc] - A.\n\nI've been on this sub nearly a year and it's a much more accurate gauge of the\nmarket fear and greed than anything else I've seen\n\nSentiment flips quicker than the minute charts.\n\nRight now there's still just a little too much hope in the posts imo.\n\n\"Black…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "Not TA. r/cc [/r/cc] - A.のようなものです。\n\n私はこのサブを1年近く使っていますが、市場の恐怖や欲を測るのに、他の何よりも正確に測ることができます。\n市場の恐怖と貪欲さを測るのに、他の何よりも正確だと思います。\n\nセンチメントは分足チャートよりも早く反転します。\n\n今はまだ、書き込みに希望がありすぎると思います。\n\n\"ブラック...",
      "title": "ディップがもっとディップすると思う理由"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "不是TA。更像是r/cc [/r/cc] - A。\n\n我已经在这个子上呆了将近一年了，它对市场的恐惧和贪婪的衡量比我看到的任何其他东西都要准确得多。\n市场的恐惧和贪婪，比我见过的任何其他东西都要准确。\n\n情绪的翻转比分钟图更快。\n\n现在，我觉得帖子里的希望还是有点大。\n\n\"黑...",
      "title": "为什么我认为下挫会更多"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "不是TA。更像是r/cc [/r/cc] - A。\n\n我已經在這個子上呆了將近一年了，它對市場的恐懼和貪婪的衡量比我看到的任何其他東西都要準確得多。\n市場的恐懼和貪婪，比我見過的任何其他東西都要準確。\n\n情緒的翻轉比分鐘圖更快。\n\n現在，我覺得帖子裏的希望還是有點大。\n\n\"黑...",
      "title": "爲什麼我認爲下挫會更多"
    }
  ]
}