{
  "author": "Greengod215",
  "original_created_utc": 1626128709,
  "title": "Why is there such a focus on \"canceling student loans\" instead of just canceling student loan interest?",
  "created_utc": 1626142542,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Background: I graduated from college 8 years ago. Upon completion, I had borrowed a total of $42,000. However after several false starts attempting to get settled into a career, I had to defer payments for a time before I had any significant and steady income. By the time I began making payments in 2015, my loan balance had ballooned to roughly $55k.</p>\n\n<p>After 6 straight years of paying above the minimum, as well as a few larger chunks when I recieved sudden windfalls, I have paid a total of $17,989</p>\n\n<p>My current balance? ....$44,191.00</p>\n\n<p>Still a full $2,190 MORE than I ever borrowed. </p>\n\n<p>If the primary argument against canceling student loan debt is that it is not fair to allow people to get out of paying back money they borrowed, I can totally support that. I don&#39;t expect it to be given for for nothing. I used that money for a host of other things besides tuition. Rent, clothes, vodka, etc. So I&#39;m more than willing to pay back what I borrowed. If INTEREST were forgiven, my current balance would be roughly $24,000. </p>\n\n<p>Many students who have been paying longer than me have already made payments totaling GREATER than the sum of their loans, and could even get money BACK.</p>\n\n<p>Seeing how quickly my principal has dropped during the interest freeze due to the pandemic has shown just how much faster the money can be paid back if it wasn&#39;t being diverted and simply generating additional revenue for the federal government.</p>\n\n<p>(Edit: formatting)</p>\n</div><!-- SC_ON -->",
  "score": 123,
  "permalink": "/r/TooAfraidToAsk/comments/oj21dw/why_is_there_such_a_focus_on_canceling_student/",
  "subreddit": "TooAfraidToAsk",
  "id": "oj21dw",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Background: I graduated from college 8 years ago. Upon completion, I had\nborrowed a total of $42,000. However after several false starts attempting to\nget settled into a career, I had to defer payments for a time before I had any\nsignificant and steady income. By the time I began making payments in…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "背景を説明します。私は8年前に大学を卒業しました。卒業時には\n42,000ドルを借りました。しかし、仕事を始めようとして何度か失敗した後\nしかし、仕事を始めようとして何度か失敗し、大きな安定した収入を得るまでの間、支払いを延期しなければなりませんでした。\n安定した収入を得るまでの間、支払いを延期しなければなりませんでした。支払いを開始したときには...。",
      "title": "なぜ、学生ローンの利息を帳消しにするのではなく、「学生ローンを帳消しにする」ことに注目が集まっているのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "背景。我8年前从大学毕业。毕业时，我\n共借了42,000美元。然而，经过几次错误的开始，试图\n我不得不推迟付款，直到我有了任何迹象。\n在我有任何重大和稳定的收入之前，我不得不推迟付款。当我开始还款时，我已经开始了。",
      "title": "为什么人们如此关注 \"取消学生贷款\"，而不是仅仅取消学生贷款利息？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "背景。我8年前從大學畢業。畢業時，我\n共借了42,000美元。然而，經過幾次錯誤的開始，試圖\n我不得不推遲付款，直到我有了任何跡象。\n在我有任何重大和穩定的收入之前，我不得不推遲付款。當我開始還款時，我已經開始了。",
      "title": "爲什麼人們如此關注 \"取消學生貸款\"，而不是僅僅取消學生貸款利息？"
    }
  ]
}