{
  "author": "ShiftyDM",
  "original_created_utc": 1630403892,
  "title": "I bought $100 worth of IOTA in 2018. Today it is worth $106.57. Ask Me Anything.",
  "created_utc": 1630409437,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>The title is half joking, half truth. </p>\n\n<p>Looking down the top 100, it may seem like you can just buy anything to 10x your investment, but this is a bull year, and that&#39;s survivorship bias in the coin rankings. (You&#39;re not seeing the 50 that fell out of the top 100.) </p>\n\n<p>Usually when you&#39;re feeling fomo around a growing project, you&#39;re already too late for x10 gains. If you&#39;re following hype pumps, you need to recognize when you&#39;re early and when you&#39;re late. That&#39;s not easy.</p>\n\n<p>The better strategy is to dollar-cost-average into sturdy, longterm projects. Even a coin that &quot;only&quot; does x2 every year or two can be one of the best investments of your entire life—if it lasts.</p>\n\n<p>Speaking of which, if I had DCA&#39;d into IOTA all bear market instead of just buying during the pump, I&#39;d be up almost x4 by now...</p>\n</div><!-- SC_ON -->",
  "score": 341,
  "permalink": "/r/CryptoCurrency/comments/pf2qap/i_bought_100_worth_of_iota_in_2018_today_it_is/",
  "subreddit": "CryptoCurrency",
  "id": "pf2qap",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "The title is half joking, half truth.\n\nLooking down the top 100, it may seem like you can just buy anything to 10x your\ninvestment, but this is a bull year, and that's survivorship bias in the coin\nrankings. (You're not seeing the 50 that fell out of the top 100.)\n\nUsually when you're feeling fomo…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "このタイトルは半分冗談で、半分真実です。\n\n上位100位までを見ると、何でも買って投資額の10倍にすればいいように思えるかもしれません。\n思われるかもしれませんが、今年は強気の年であり、コインランキングには生存者バイアスがかかっています。\nランキングの生存者バイアスです。(トップ100から落ちた50枚は見ていないことになります）。)\n\n通常、あなたがフォモを感じているときは...",
      "title": "2018年に100ドル分のIOTAを購入しました。今日は106.57ドルの価値があります。何でも聞いてみてください。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这个标题一半是开玩笑的，一半是事实。\n\n纵观前100名，似乎你可以随便购买任何东西来10倍于你的\n但今年是个牛年，这就是钱币排名中的幸存者偏差。\n排名。(你没有看到跌出前100名的那50个）。)\n\n通常情况下，当你觉得自己很幸运的时候，你就会觉得自己很幸运。",
      "title": "我在2018年买了价值100美元的IOTA。今天它的价值是106.57美元。问我任何问题。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這個標題一半是開玩笑的，一半是事實。\n\n縱觀前100名，似乎你可以隨便購買任何東西來10倍於你的\n但今年是個牛年，這就是錢幣排名中的倖存者偏差。\n排名。(你沒有看到跌出前100名的那50個）。)\n\n通常情況下，當你覺得自己很幸運的時候，你就會覺得自己很幸運。",
      "title": "我在2018年買了價值100美元的IOTA。今天它的價值是106.57美元。問我任何問題。"
    }
  ]
}