{
  "author": "DandyDawner",
  "original_created_utc": 1628674999,
  "title": "What does one do when they find out their family member is a rapist?",
  "created_utc": 1628708220,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>To make a long story, it became apparent that a very close family member had committed a horrible crime. (Police are aware, family member does not deny it, and formal proceedings are well underway.) </p>\n\n<p>The societal expectations seems to be that we would cut all contact with him and just never speak to or see him again. </p>\n\n<p>It’s weird and probably wrong, but while I absolute abhor what he did, I still love him. The years and years of family bond and love and significance of the role he and only he can play in my life don’t just go away because he’s done this horrible, awful, unforgivable thing. </p>\n\n<p>Do people typically just work through those things independently and cut the person off regardless, or is there a world in which you both acknowledge what they’ve done and continue to forge some form of meaningful relationship with them (without then being a bad person yourself/somehow seeming as though you condone the crime by not cutting ties?) </p>\n\n<p>Basically — what does one typically do in this situation?</p>\n</div><!-- SC_ON -->",
  "score": 107,
  "permalink": "/r/TooAfraidToAsk/comments/p29sos/what_does_one_do_when_they_find_out_their_family/",
  "subreddit": "TooAfraidToAsk",
  "id": "p29sos",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "To make a long story, it became apparent that a very close family member had\ncommitted a horrible crime. (Police are aware, family member does not deny it,\nand formal proceedings are well underway.)\n\nThe societal expectations seems to be that we would cut all contact with him and\njust never speak to…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "話せば長くなりますが、とても身近な家族が恐ろしい犯罪を犯したことが明らかになりました。\n恐ろしい罪を犯してしまったのです。(警察は認識しているが、家族は否定していない。\n正式な手続きが進んでいます）。)\n\n社会的な期待は、私たちが彼とのすべての接触を断ち切り、決して話さないようにすることだと思われます。\n話すことはない...",
      "title": "自分の家族がレイプ犯だとわかったとき、人はどうするのか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "说来话长，很明显，一个非常亲密的家庭成员犯下了可怕的罪行。\n犯了一项可怕的罪行。(警察知道，家庭成员不否认。\n而且正式的诉讼程序正在进行中）。)\n\n社会的期望似乎是，我们将切断与他的所有联系，并且\n永远不要和他说话。",
      "title": "当人们发现自己的家庭成员是强奸犯时，他们会怎么做？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "說來話長，很明顯，一個非常親密的家庭成員犯下了可怕的罪行。\n犯了一項可怕的罪行。(警察知道，家庭成員不否認。\n而且正式的訴訟程序正在進行中）。)\n\n社會的期望似乎是，我們將切斷與他的所有聯繫，並且\n永遠不要和他說話。",
      "title": "當人們發現自己的家庭成員是強姦犯時，他們會怎麼做？"
    }
  ]
}