{
  "author": "unlvbroncoscubs",
  "the_new_excerpt": "In February of this year my sister unfortunately passed away from covid and I\nwas the beneficiary of her roth ira. I set up a beneficiary roth ira at fidelity\nto try to take advantage of the tax free benefits of a roth ira instead of\ntaking a lump sum. From my understanding I have 10 years to grow…",
  "original_created_utc": 1621070511,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "今年の2月、私の姉は不幸にもコヴィドで亡くなりました。\nは彼女のロスIRAの受益者でした。私はフィデリティで受益者用のロスIRAを設定しました。\nロースIRAの非課税メリットを利用しようと、フィデリティで受益者ロースIRAを設定しました。\n一括払いではなく、ロスIRAの非課税メリットを利用しようと、フィデリティで受益者ロスIRAを設定しました。私の理解では、私は10年間成長させることができます...",
      "title": "今後10年間の成長株"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "今年2月，我的妹妹不幸因癌症去世，我是她的罗斯福养老金的受益人。\n是她ROTH IRA的受益人。我在富达公司设立了一个受益人的罗斯养老金账户\n试图利用ROTH IRA的免税利益，而不是一次性付款。\n而不是采取一次性付款的方式。根据我的理解，我有10年的时间来增长...",
      "title": "未来10年的增长型股票"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "今年2月，我的妹妹不幸因癌症去世，我是她的羅斯福養老金的受益人。\n是她ROTH IRA的受益人。我在富達公司設立了一個受益人的羅斯養老金賬戶\n試圖利用ROTH IRA的免稅利益，而不是一次性付款。\n而不是採取一次性付款的方式。根據我的理解，我有10年的時間來增長...",
      "title": "未來10年的增長型股票"
    }
  ],
  "title": "Growth stocks for the next 10 years",
  "created_utc": 1621094823,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>In February of this year my sister unfortunately passed away from covid and I was the beneficiary of her roth ira. I set up a beneficiary roth ira at fidelity to try to take advantage of the tax free benefits of a roth ira instead of taking a lump sum. From my understanding I have 10 years to grow that account as much as I can without any penalties as long as it&#39;s fully distributed before 10 years after her passing.</p>\n\n<p>My question for you is if you had $15k that you had to remove in 10 years what are your highest conviction stocks? I&#39;m mostly an etf/index fund investor so this is a little different than my normal portfolio. I just want to try to grow this as much as I can before I have to withdraw it.</p>\n</div><!-- SC_ON -->",
  "score": 89,
  "permalink": "/r/stocks/comments/ncutxn/growth_stocks_for_the_next_10_years/",
  "subreddit": "stocks",
  "id": "ncutxn",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1621590803297
}