{
  "author": "francaisefry",
  "original_created_utc": 1658178386,
  "title": "Why do Muslim women cover their hair for modesty, but still wear makeup?",
  "created_utc": 1658187496,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;My (admittedly limited) understanding of the purpose of a hijab is to protect female modesty and avert unwanted male gaze within Muslim teaching. I believe it has something to do with avoiding the focus to be on physical, or sexualized, attributes such as long female hair, and neck. To avoid male lust over pyhysical body or beauty.\nHowever, I have known many Muslim women to wear hijab and also wear a full face of makeup. Thus putting time and effort into physically looking striking and beautiful. Does that not somewhat counter the point of wearing a hijab? &lt;/p&gt;\n\n&lt;p&gt;To be clear, this post is not meant to be judgemental or critical or Muslim culture. Just genuinely curious as an outsider looking in. I respect their beliefs and am trying to further my understanding.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 149,
  "permalink": "/r/TooAfraidToAsk/comments/w2a9bb/why_do_muslim_women_cover_their_hair_for_modesty/",
  "subreddit": "TooAfraidToAsk",
  "id": "w2a9bb",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "My (admittedly limited) understanding of the purpose of a hijab is to protect\nfemale modesty and avert unwanted male gaze within Muslim teaching. I believe it\nhas something to do with avoiding the focus to be on physical, or sexualized,\nattributes such as long female hair, and neck. To avoid male…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ヒジャブの目的について、私の（限られた）理解は、「守る」ということです。\nイスラム教の教えの中で、女性の慎み深さを守り、男性の不要な視線を避けるためです。私はそれを信じています。\nを避けるためだと思います。\n女性の長い髪や首などの属性に焦点が当たるのを避けるためだと思います。男性の視線を避けるために...",
      "title": "イスラム教の女性は、慎みのために髪を覆っているのに、なぜ化粧をするのですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我对头巾的目的的理解（公认是有限的）是为了保护\n我对头巾的理解是，在穆斯林教义中，头巾的目的是保护女性的谦逊，避免男性不必要的注视。我相信它\n与避免将注意力集中在身体或性方面有关。\n诸如女性的长发和脖子等属性。为了避免男性对女性的注视，我认为这与避免关注女性的身体或性特征有关。",
      "title": "为什么穆斯林妇女为了保持谦虚而遮住头发，但仍然化妆？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我對頭巾的目的的理解（公認是有限的）是爲了保護\n我對頭巾的理解是，在穆斯林教義中，頭巾的目的是保護女性的謙遜，避免男性不必要的注視。我相信它\n與避免將注意力集中在身體或性方面有關。\n諸如女性的長髮和脖子等屬性。爲了避免男性對女性的注視，我認爲這與避免關注女性的身體或性特徵有關。",
      "title": "爲什麼穆斯林婦女爲了保持謙虛而遮住頭髮，但仍然化妝？"
    }
  ]
}