{
  "author": "dr5c",
  "original_created_utc": 1656202794,
  "title": "What actions seemed to historically work in combating fascism?",
  "created_utc": 1656232629,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;In doing my own independent reading, it seems like many more countries besides the ones that I grew up learning about (Italy, Germany, Spain, etc) had fascist movements. What seems to have been the major political, social, or economic differences that lead to some countries succumbing to fascism and others not?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 104,
  "permalink": "/r/AskHistorians/comments/vks7o2/what_actions_seemed_to_historically_work_in/",
  "subreddit": "AskHistorians",
  "id": "vks7o2",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "In doing my own independent reading, it seems like many more countries besides\nthe ones that I grew up learning about (Italy, Germany, Spain, etc) had fascist\nmovements. What seems to have been the major political, social, or economic\ndifferences that lead to some countries succumbing to fascism…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私自身が独自に読み解く限りでは、他の多くの国もそうであるようです。\n私が学んできた国（イタリア、ドイツ、スペインなど）以外にも、多くの国でファシスト運動があったようです。\n運動があったようです。政治的、社会的、経済的に大きな違いは何だったのでしょうか？\nファシズムに屈した国があるのは、政治的、社会的、経済的な違いが大きいのでしょうか。",
      "title": "歴史的にファシズムに対抗するために、どのような行動が有効だと思われますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在我自己的独立阅读中，除了我长大后了解到的那些国家（意大利、德国、西班牙等）之外，似乎还有许多国家有法西斯主义。\n除了我从小学习的那些国家（意大利、德国、西班牙等）有法西斯主义\n运动。似乎是什么主要的政治、社会或经济差异导致了一些国家的法西斯运动？\n导致一些国家屈服于法西斯主义的主要政治、社会或经济差异......",
      "title": "历史上有哪些行动在打击法西斯主义方面似乎是有效的？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在我自己的獨立閱讀中，除了我長大後瞭解到的那些國家（意大利、德國、西班牙等）之外，似乎還有許多國家有法西斯主義。\n除了我從小學習的那些國家（意大利、德國、西班牙等）有法西斯主義\n運動。似乎是什麼主要的政治、社會或經濟差異導致了一些國家的法西斯運動？\n導致一些國家屈服於法西斯主義的主要政治、社會或經濟差異......",
      "title": "歷史上有哪些行動在打擊法西斯主義方面似乎是有效的？"
    }
  ]
}