{
  "author": "QuicklyThisWay",
  "original_created_utc": 1637516374,
  "title": "Cryptocurrency, while far from a safe bet, is still better than actual gambling.",
  "created_utc": 1637530290,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So I’m in Vegas for the first time being old enough to gamble, and I thought the slot machines would be at least be as fun as arcade games that spit out tickets or coins. I walked around for a half hour trying to pick one that made any sense (they don’t), and decided to only spend the $4 in cash I had with me at the time. It’s gone. I didn’t have fun. I demand Dave and Busters style gambling! </p>\n\n<p>While I have been told many times that cryptocurrency is a very unsafe bet, and that I might as well just straight up gamble. My total return went up $10 last night as I slept. </p>\n\n<p>I enjoy being part of they crypto community, I don’t sell at a loss, and while I have made some poor decisions, I ultimately feel well informed and that over time I can at least break even or continue to make small gains.</p>\n\n<p>I just wanted to share my perspective. However, I am certainly not providing financial advice. There are worse ways to invest your time and money. And if I somehow hit the jackpot, it still won’t compare to the vast complexities of crypto and all that it offers outside of financial benefits alone.</p>\n</div><!-- SC_ON -->",
  "score": 215,
  "permalink": "/r/CryptoCurrency/comments/qz01jj/cryptocurrency_while_far_from_a_safe_bet_is_still/",
  "subreddit": "CryptoCurrency",
  "id": "qz01jj",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "So I’m in Vegas for the first time being old enough to gamble, and I thought the\nslot machines would be at least be as fun as arcade games that spit out tickets\nor coins. I walked around for a half hour trying to pick one that made any sense\n(they don’t), and decided to only spend the $4 in cash I…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はギャンブルができる年齢になって初めてラスベガスに来たのですが、スロットマシンは少なくともチケットを出すアーケードゲームと同じくらい楽しいものだと思っていました。\nスロットマシンは、少なくともチケットやコインが出てくるアーケードゲームと同じくらい楽しいものだと思っていました。\nと思っていました。意味のあるものを選ぼうと30分ほど歩き回りました。\n(そして、4ドルの現金だけを使うことにしました。",
      "title": "暗号通貨は、安全な賭けとは程遠いものの、実際のギャンブルよりはまだマシです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我是第一次到拉斯维加斯，已经到了可以赌博的年龄，我以为老虎机至少会像吐票的街机游戏一样有趣。\n我以为老虎机至少会像吐出票子或硬币的街机游戏一样有趣。\n或硬币。我走了半个小时，试图挑选一个有意义的机器。\n(他们没有），并决定只花4美元的现金，我...",
      "title": "加密货币虽然远不是一个安全的赌注，但仍然比实际的赌博要好。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我是第一次到拉斯維加斯，已經到了可以賭博的年齡，我以爲老虎機至少會像吐票的街機遊戲一樣有趣。\n我以爲老虎機至少會像吐出票子或硬幣的街機遊戲一樣有趣。\n或硬幣。我走了半個小時，試圖挑選一個有意義的機器。\n(他們沒有），並決定只花4美元的現金，我...",
      "title": "加密貨幣雖然遠不是一個安全的賭注，但仍然比實際的賭博要好。"
    }
  ]
}