{
  "author": "NiMiHa",
  "original_created_utc": 1629389828,
  "title": "Be sure to thank your significant other if they support you even though they don't get Bitcoin.",
  "created_utc": 1629416055,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;ve been working on my wife for 10 months now, and while she probably 30% understands Bitcoin she has 100% trusted and supported me. This doesn&#39;t go unnoticed. Nothing says &quot;I love you&quot; more than her letting me spend large chucks of money on magical internet money. Be sure to share the credit with them.</p>\n</div><!-- SC_ON -->",
  "score": 151,
  "permalink": "/r/Bitcoin/comments/p7i14y/be_sure_to_thank_your_significant_other_if_they/",
  "subreddit": "Bitcoin",
  "id": "p7i14y",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I've been working on my wife for 10 months now, and while she probably 30%\nunderstands Bitcoin she has 100% trusted and supported me. This doesn't go\nunnoticed. Nothing says \"I love you\" more than her letting me spend large chucks\nof money on magical internet money. Be sure to share the credit with…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は10ヶ月前から妻のために仕事をしていますが、妻はビットコインを30％程度しか理解していません。\nビットコインの理解度は30％程度ですが、私を100％信頼して応援してくれています。これは気づかれないことでは\n気付かれないわけがありません。彼女が私に大金を使わせてくれること以上に「愛している」と言えることはありません。\n大金を魔法のようなインターネットのお金に使わせてくれることほど、「愛してる」と言えることはありません。必ず信用を共有してください...",
      "title": "大切な人が、ビットコインをもらえなくてもあなたを応援してくれたら、必ずお礼を言いましょう。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我已经为我的妻子做了10个月的工作，虽然她可能有30％的\n理解比特币，但她100%信任和支持我。这并不\n没有人注意到。没有什么比她让我花大笔钱在神奇的网络货币上更能表达 \"我爱你 \"了。\n的钱在神奇的网络货币上。一定要把功劳分享给...",
      "title": "如果你的另一半支持你，即使他们没有得到比特币，也一定要感谢他们。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我已經爲我的妻子做了10個月的工作，雖然她可能有30％的\n理解比特幣，但她100%信任和支持我。這並不\n沒有人注意到。沒有什麼比她讓我花大筆錢在神奇的網絡貨幣上更能表達 \"我愛你 \"了。\n的錢在神奇的網絡貨幣上。一定要把功勞分享給...",
      "title": "如果你的另一半支持你，即使他們沒有得到比特幣，也一定要感謝他們。"
    }
  ]
}