{
  "author": "nitelight7",
  "the_new_excerpt": "Some people here think the world owes them guaranteed profits. You have invested\nin a project you believe will reward you with something bigger in return, yet\nyou lose your cool every time you see red or it has been a “stablecoin” lately.\nI think this bunch of people either bought when lumens was at…",
  "original_created_utc": 1614371318,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "这里有些人认为世界欠他们的利润保证。你已经投资了\n在一个你认为会给你带来更大回报的项目中，但\n每次看到红色你都会失去冷静，或者说最近它一直是个 \"稳定币\"。\n我觉得这帮人要么是在流明在的时候买的...",
      "title": "恒星流明(XLM)。不是一个稳定的币，只是一个弱者"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這裏有些人認爲世界欠他們的利潤保證。你已經投資了\n在一個你認爲會給你帶來更大回報的項目中，但\n每次看到紅色你都會失去冷靜，或者說最近它一直是個 \"穩定幣\"。\n我覺得這幫人要麼是在流明在的時候買的...",
      "title": "恆星流明(XLM)。不是一個穩定的幣，只是一個弱者"
    }
  ],
  "title": "Stellar Lumens(XLM): Not a Stablecoin, Just an Underdog",
  "created_utc": 1614387942,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Some people here think the world owes them guaranteed profits. You have invested in a project you believe will reward you with something bigger in return, yet you lose your cool every time you see red or it has been a <em>“stablecoin”</em> lately. I think this bunch of people either bought when lumens was at .40-60.</p>\n\n<p>I believe that the people who have the largest holdings don’t even moan about this price. They have a strategy instead. They don’t constantly check the price and complain about how XLM is dipping or not pumping up hard lately. They are probably buying this dip more, or they have cashed out their initial investments and let the profits ride. They are probably more interested in learning what Stellar does to check if its mission is still being actively developed and upheld by SDF, so they’ll have the assurance albeit <strong>not guaranteed</strong> that they have put their money in the right project. They are probably the most patient ones cause they are secured by the fact that Stellar has gained more adoptions, and it has been around since 2014. It has survived the harsh crypto winter by developing more projects.</p>\n\n<p>Cryptos have definitely caused a lot of “investors” (might as well say speculators) to have short-term memories and expect numbers to go up instantly. When they don’t, they think the coin is a shitcoin and jump into another one.</p>\n\n<p>It is funny how we even call it cryptocurrencies when people don’t treat them as currencies but assets.</p>\n\n<p>I get that it is highly frustrating knowing how XLM still hasn’t reached its ATH while some coins did. What this just shows me is that the market is irrational.</p>\n\n<p>Consider Doge, a memecoin but went parabolic; XRP with Ripple being sued for selling XRP for profit yet it is still soaring; CAKE and BAKE which rose to a high price because of the DeFi hype; ADA with no real projects built yet but future speculations; ETH with congested network and high gas fees; and BTC which has failed to become a digital P2P currency and is now branded as a store of value.</p>\n\n<p>If we talk about fundamentals, Algorand (I don’t hold any) and Stellar are at the forefront. The Marshall Islands used Algorand to issue their national digital currency called SOV. LTO has also gained partnerships with UN and the Netherlands Government.</p>\n\n<p>We can say as well that Ethereum is at the forefront(heck even Bitcoin as it has the institutional backing), but until now it hasn’t fixed its scalability issues and the high gas fees. Sure, Layer2 exists like Loopring but majority of people still use Layer1 and using Layer2 solutions is actually not user-friendly. If Cardano can indeed deliver, then I don’t think Ethereum will be the main player in the long run.</p>\n\n<p>If you look at CoinMarketCap though, most of the projects in cryptocurrency space are either a knock-off of Ethereum or trying to be the next Ethereum.</p>\n\n<p>You have Binance launching its own DEX and taking opportunity of the crazy yield farming hype. You also have ATOM launching its own interconnected blockchain which sounds really cool, and you earn some sweet stakes at 10% APY, but the question that always crosses my mind is this: <em>what important problems are they trying to solve, and have they really solved at least one thing?</em></p>\n\n<p>Because all I see when it comes to these projects are: GREED. GAINS. SHORT-TERM. <em>HYPE.</em></p>\n\n<p>You can even earn 30% APY on some. How sustainable is this?</p>\n\n<p><strong>It’s clear. The market is irrational.</strong></p>\n\n<p>When all this hype goes down, I hope projects tackling important problems like Stellar will rise up, and maybe just maybe, XLM will be valued fairly.</p>\n\n<p><strong>We know that XLM is undervalued.</strong> We know that many traders use it as their bridge currency for exchanging their cryptos or moving coins between exchanges. We and they know that XLM has a great potential.\nJust a day ago, a leading mobile operator in Turkey, Paycell, announced support for buying and selling of cryptos and guess what? <a href=\"https://www.coinkolik.com/turkcellin-paycell-uygulamasi-ile-artik-kripto-para-alim-satimi-yapilabilecek/\">XLM is supported again next to ETH and BTC.</a></p>\n\n<p>*<a href=\"https://finance.yahoo.com/news/croatia-tifon-gas-stations-hope-161428643.html\">Ever heard of the gas station in Croatia accepting XLM, BTC, and ETH too?</a></p>\n\n<p>*<a href=\"https://www.coindesk.com/bermuda-to-pilot-digital-dollar-for-rum-sales\">Buying rums in Bermuda with a digital dollar issued on Stellar</a></p>\n\n<p><em><a href=\"https://paymynt.money/#blockchain\">Getting cashback rewards</a></em></p>\n\n<p><em>Have you also heard that you can send absolutely send remittances now to Mexico, Brazil, Argentina, Tanzania, South Africa, and Nigeria using Stellar?</em> You can. Just use a Stellar wallet like Lobstr.</p>\n\n<p><em>What about creating NFT on Stellar without paying huge fees? You just need 2 XLM at most.</em></p>\n\n<p>*Do you even know that Stellar has an in-built DEX? Right. What does that mean? Well, if you download or use any Stellar Wallet, you can do P2P trades (buy, sell, or swap) for a fraction of a cent. In a simple word? You have instant access to a decentralized exchange. Stellar is a payment and a DEX platform at the same time.</p>\n\n<p>The most famous Stellar tokens gaining traction? Well, Smartlands (SLT) with 7 million total supply tokenizing assets like real estate and agriculture and has a fee-pool incentive of 33% going to SLT holders holding €1000 of SLT as well as AKON which is being adopted in Africa.</p>\n\n<p>As you can see, the tokens listed on Stellar are actually solving different purposes. They are not just a knock-off of Uniswap.</p>\n\n<p>Listen. All major exchanges have stellar lumens (XLM) too. Another news? Coinbase will be launching their own debit card with 4% XLM cashback.</p>\n\n<p>Lumens can be moved easily fast and cheap. It fits the most crypto of crypto as a currency.</p>\n\n<p>Stellar is not all about hype and future speculations. They have the products working already. I believe if we value XLM based on fundamentals? It is easily a top 3 coin.</p>\n\n<p>Its founder Jed McCaleb is also not a shiller. Some might say Stellar should up their marketing game, and they are working on that now. But I appreciate Jed for not being like the rest of the founders and devs who participate in Twitter shilling.</p>\n\n<p>It’s clear. You can’t really call it a <em>failing crypto</em> or mock it as a <em>stablecoin.</em> I’ll wait till this underdog rises up. If I lose money, so be it. I have principles even in investing: I only invest in projects that solve important problems and do the work diligently without building so much hype than putting my money in projects fueled with hype but can’t offer anything tangible on the table.</p>\n\n<p>To hotdogs and rums. <em>Only Lumenauts will probably get this.</em></p>\n\n<p>Edit: removed author by request.</p>\n</div><!-- SC_ON -->",
  "score": 539,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/EZL0Ah0noUOHg4Gga4DC9EzCr-XOzxOHRK3dTYVpJu4.jpg?auto=webp&s=a777f6d3d1c4aee22c3def72bd86fe4cc3c13aa9",
          "width": 1024,
          "height": 512
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/EZL0Ah0noUOHg4Gga4DC9EzCr-XOzxOHRK3dTYVpJu4.jpg?width=108&crop=smart&auto=webp&s=5eaea504da96d912e8cfc9f577d6319cef26703c",
            "width": 108,
            "height": 54
          },
          {
            "url": "https://external-preview.redd.it/EZL0Ah0noUOHg4Gga4DC9EzCr-XOzxOHRK3dTYVpJu4.jpg?width=216&crop=smart&auto=webp&s=ad1a3e75d651a07e99d2af6c4ceba47e9a6ba769",
            "width": 216,
            "height": 108
          },
          {
            "url": "https://external-preview.redd.it/EZL0Ah0noUOHg4Gga4DC9EzCr-XOzxOHRK3dTYVpJu4.jpg?width=320&crop=smart&auto=webp&s=65ace7abb4aab9c5a07a7a51d08341c1a01f905f",
            "width": 320,
            "height": 160
          },
          {
            "url": "https://external-preview.redd.it/EZL0Ah0noUOHg4Gga4DC9EzCr-XOzxOHRK3dTYVpJu4.jpg?width=640&crop=smart&auto=webp&s=ceda7ce143cdc17c583620d1ea9a89a603e03dfe",
            "width": 640,
            "height": 320
          },
          {
            "url": "https://external-preview.redd.it/EZL0Ah0noUOHg4Gga4DC9EzCr-XOzxOHRK3dTYVpJu4.jpg?width=960&crop=smart&auto=webp&s=d478a086537d3660ca7a6136dac7e50ff7b5307f",
            "width": 960,
            "height": 480
          }
        ],
        "variants": {},
        "id": "DsIceFrbl5cUxjUei6eGGnjtrPT7hskzZyGget2I_TY"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/lt70px/stellar_lumensxlm_not_a_stablecoin_just_an/",
  "subreddit": "CryptoCurrency",
  "id": "lt70px",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614937735130
}