{
  "author": "abcdefghijklmnop987",
  "original_created_utc": 1628258063,
  "title": "I asked my mom, grandma, best friend, and wife to call our senator about the new Crypto amendments. Ask your family, too!",
  "created_utc": 1628297232,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>My mom texted me to tell me she called our two Senators. This led to a conversation with my mom that I thought you all might find funny:</p>\n\n<p>Me: It means a lot! Crypto is one of the few things that give me hope for the future. If they overregulate crypto - I know this sounds dramatic - I don&#39;t think the world will be around much longer after it!</p>\n\n<p>Mom: Isn&#39;t it SUPER bad for the environment?</p>\n\n<p>Me: Is Crypto bad for the environment?</p>\n\n<p>Mom: I think there is mining for the parts to do the math problems</p>\n\n<p>Me: 1. The legislation they are trying to push would significantly harm Proof of Stake systems.</p>\n\n<p>Proof of stake is SIGNIFICANTLY better for the environment than Proof of work (e.g mining)</p>\n\n<ol>\n<li><p>Bitcoin is a proof of work network. Although it isn&#39;t great for the environment-this bill doesn&#39;t effect Proof of Work crypto at all. </p></li>\n<li><p>Energy should be a utility, and solar/wind/hydro electricity would remove all negative effect of BTC&#39;s proof of work system. But the government doesn&#39;t care label energy as a utility as that would hurt their lobbyist.</p></li>\n<li><p>Lastly, we live in an inflationary environment. An inflationary environment promotes inefficiency, whereas a deflationary environment promotes efficiency. For a company to succeed in inflation, they have to produce MORE goods, wast MORE resources, pay MORE people, make people work MORE time. If we use an asset like Bitcoin as currency that isn&#39;t inflationary, companies (and the government) are incentivized to be much more efficient (I.e. work from home 15 hours a week because that&#39;s all we actually need you for), products would start to cost less and less and people would be incentivized to save rather than spend credit (I.e. get loans for homes, cars, student loans, etc.)</p></li>\n</ol>\n\n<p>Changing our system makes us much more efficient and uses WAY less resources than we currently do.</p>\n\n<p>BUT, I love Cardano because it&#39;s a Proof of Stake system that is way more energy efficient than Bitcoin and this law basically means Proof of Stake systems in America are toast</p>\n\n<p>Mom: Lol, ok</p>\n\n<p>I’m glad my mom called, it meant a lot to me! Ask your friends and family to do the same! </p>\n\n<p>Here&#39;s the number and the script is on the website below: 5172009518</p>\n\n<p><a href=\"https://www.fightforthefuture.org/actions/stop-the-senate-from-sneaking-through-total-surveillance-of-the-crypto-economy\">https://www.fightforthefuture.org/actions/stop-the-senate-from-sneaking-through-total-surveillance-of-the-crypto-economy</a></p>\n\n<p>Edit: Spelling errors</p>\n</div><!-- SC_ON -->",
  "score": 152,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/1cl72v5d_tfwCWTVh9jqj9JKRx0HE9uCMOk1k7nGIuY.jpg?auto=webp&s=b29030b1b12d74e762004869160fc4a798be6224",
          "width": 1200,
          "height": 630
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/1cl72v5d_tfwCWTVh9jqj9JKRx0HE9uCMOk1k7nGIuY.jpg?width=108&crop=smart&auto=webp&s=74877dca1327bbd71e6726f080a6a6491c89fdb9",
            "width": 108,
            "height": 56
          },
          {
            "url": "https://external-preview.redd.it/1cl72v5d_tfwCWTVh9jqj9JKRx0HE9uCMOk1k7nGIuY.jpg?width=216&crop=smart&auto=webp&s=8615532eab1d4e782435dec0a8a5af5d57c08de6",
            "width": 216,
            "height": 113
          },
          {
            "url": "https://external-preview.redd.it/1cl72v5d_tfwCWTVh9jqj9JKRx0HE9uCMOk1k7nGIuY.jpg?width=320&crop=smart&auto=webp&s=9d8f98ecb209a19a54bb6fc6eb65c1564744671f",
            "width": 320,
            "height": 168
          },
          {
            "url": "https://external-preview.redd.it/1cl72v5d_tfwCWTVh9jqj9JKRx0HE9uCMOk1k7nGIuY.jpg?width=640&crop=smart&auto=webp&s=a6b044c24e5f482654c29d247f1d0b156818cd4f",
            "width": 640,
            "height": 336
          },
          {
            "url": "https://external-preview.redd.it/1cl72v5d_tfwCWTVh9jqj9JKRx0HE9uCMOk1k7nGIuY.jpg?width=960&crop=smart&auto=webp&s=5884b2d1bc9eeaf1f4bba3faffb2c0a7bf8024eb",
            "width": 960,
            "height": 504
          },
          {
            "url": "https://external-preview.redd.it/1cl72v5d_tfwCWTVh9jqj9JKRx0HE9uCMOk1k7nGIuY.jpg?width=1080&crop=smart&auto=webp&s=31b426a36831e4d711e3bd4f2e3a84dd0a3ce059",
            "width": 1080,
            "height": 567
          }
        ],
        "variants": {},
        "id": "wFiBTfJZdGuVPmf7wjU1_znFrMztdl01T9MFJIBT_XM"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/oz73fe/i_asked_my_mom_grandma_best_friend_and_wife_to/",
  "subreddit": "CryptoCurrency",
  "id": "oz73fe",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "My mom texted me to tell me she called our two Senators. This led to a\nconversation with my mom that I thought you all might find funny:\n\nMe: It means a lot! Crypto is one of the few things that give me hope for the\nfuture. If they overregulate crypto - I know this sounds dramatic - I don't\nthink…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "母は、2人の上院議員に電話したとメールしてきました。これがきっかけで\n母との会話の中で、皆さんが面白いと思ってくれたことがあります。\n\n私：本当にありがとうございます。暗号は、私に未来への希望を与えてくれる数少ないものの1つです。\n未来への希望を与えてくれる数少ないもののひとつです。もし暗号が過剰に規制されたら......大げさに聞こえるかもしれませんが、私はそうは思いません。\n思うのですが...",
      "title": "私は、母、祖母、親友、妻に、新しいCrypto改正案について上院議員に電話するように頼みました。あなたの家族にもお願いしてみてください。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我妈妈发短信告诉我，她给我们的两位参议员打了电话。这导致了\n与我妈妈的对话，我想你们都会觉得很有趣。\n\n我：这意味着很多! 低碳货币是为数不多的让我对未来充满希望的东西之一。\n未来的希望。如果他们过度监管加密货币--我知道这听起来很戏剧化--我不\n认为...",
      "title": "我让我的妈妈、奶奶、最好的朋友和妻子给我们的参议员打电话询问新的加密货币修正案。也问问你的家人吧!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我媽媽發短信告訴我，她給我們的兩位參議員打了電話。這導致了\n與我媽媽的對話，我想你們都會覺得很有趣。\n\n我：這意味着很多! 低碳貨幣是爲數不多的讓我對未來充滿希望的東西之一。\n未來的希望。如果他們過度監管加密貨幣--我知道這聽起來很戲劇化--我不\n認爲...",
      "title": "我讓我的媽媽、奶奶、最好的朋友和妻子給我們的參議員打電話詢問新的加密貨幣修正案。也問問你的家人吧!"
    }
  ]
}