{
  "author": "bigboyransom",
  "the_new_excerpt": "So, I’m 17 and I have a job and I found out one of my co workers was telling\nothers that they think I’m weird. I’m pretty quiet since I’ve only worked 5\nshifts and I’m sorta awkward at first but I’m slowly getting more comfortable\nand social. I have a good friend group and attend many parties and…",
  "original_created_utc": 1619326888,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は17歳で仕事をしていますが、同僚の一人が私のことを変人だと思っていると他の人に話していることがわかりました。\n私のことを変人だと思っていると他の人に話していることがわかりました。私はまだ5回しか働いていないので、かなり無口です。\n私はまだ5回しか働いていないので、とても静かで、最初はぎこちなかったのですが、少しずつ慣れて社交的になってきました。\n社交的になってきました。私は良い友人グループを持っていて、多くのパーティーや...",
      "title": "人に変だと思われても気にする必要があるのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我17岁，有一份工作，我发现我的一个同事告诉别人他们认为我很奇怪。\n他们认为我很奇怪。我很安静，因为我只上过五次班。\n我很安静，因为我只上过5次班，一开始我有点尴尬，但我慢慢地变得更舒服了\n和社交。我有一个很好的朋友圈，参加很多聚会和...",
      "title": "我应该关心人们是否认为我很奇怪吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我17歲，有一份工作，我發現我的一個同事告訴別人他們認爲我很奇怪。\n他們認爲我很奇怪。我很安靜，因爲我只上過五次班。\n我很安靜，因爲我只上過5次班，一開始我有點尷尬，但我慢慢地變得更舒服了\n和社交。我有一個很好的朋友圈，參加很多聚會和...",
      "title": "我應該關心人們是否認爲我很奇怪嗎？"
    }
  ],
  "title": "Should I care if people think I’m weird?",
  "created_utc": 1619358229,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So, I’m 17 and I have a job and I found out one of my co workers was telling others that they think I’m weird. I’m pretty quiet since I’ve only worked 5 shifts and I’m sorta awkward at first but I’m slowly getting more comfortable and social. I have a good friend group and attend many parties and I’m preparing for college with my best friends as roommates, and I was voted bachelor in my school. </p>\n\n<p><a href=\"https://imgur.com/a/0Asfjn5\">https://imgur.com/a/0Asfjn5</a></p>\n\n<p>This is what I look like, incase my looks are why I’m weird. Anyways, again I’m pretty awkward and shy when meeting people but once I’m comfortable I’m pretty outgoing. I do have a unique humor that people either find super funny or don’t really understand if.</p>\n\n<p>Should I feel bad that my coworkers find me weird? Idk, it just hurt my feels and I already have bad self esteem problems and a lot of insecurities. My sister also works there and tells them I’m super weird and a bunch of bad shit about me. Idk. I just am upset.</p>\n</div><!-- SC_ON -->",
  "score": 102,
  "permalink": "/r/NoStupidQuestions/comments/my1a2z/should_i_care_if_people_think_im_weird/",
  "subreddit": "NoStupidQuestions",
  "id": "my1a2z",
  "is_self": true,
  "media": null,
  "is_video": false
}