{
  "author": "alexo12",
  "original_created_utc": 1650287427,
  "title": "What makes you stay in the crypto market even after knowing it’s a volatile market and you could lose all of your investment.",
  "created_utc": 1650310336,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;For me only thing makes me still stay in the crypto market is that there’s not better option for me in a third world country?&lt;/p&gt;\n\n&lt;p&gt;A job doesn’t pay enough to even make little  impact on my life. I’m not looking to make millions in this market, I’m just looking to make some money so I could have a better life than before. &lt;/p&gt;\n\n&lt;p&gt;40% down in a year, but I still don’t want to sell because I don’t see any better option for me other than crypto. So I’m here until Satoshi rugpull us all or we all become rich AF.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 314,
  "permalink": "/r/CryptoCurrency/comments/u6csva/what_makes_you_stay_in_the_crypto_market_even/",
  "subreddit": "CryptoCurrency",
  "id": "u6csva",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "For me only thing makes me still stay in the crypto market is that there’s not\nbetter option for me in a third world country?\n\nA job doesn’t pay enough to even make little impact on my life. I’m not looking\nto make millions in this market, I’m just looking to make some money so I could\nhave a…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私にとっては、暗号市場にとどまる唯一の理由は、そのようなことがないことです。\n第三国では、もっと良い選択肢があるのでは？\n\n仕事は、私の人生に少しも影響を与えないほどの給料ではありません。僕は別に\nこの市場で何百万ドルも稼ぎたいんだ。\nを持つ。",
      "title": "暗号市場が不安定で、投資額をすべて失う可能性があるとわかっていても、暗号市場に留まる理由は何でしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "对我来说，唯一让我仍然留在加密货币市场的原因是，这里没有\n我在第三世界国家有更好的选择？\n\n一份工作的薪水甚至不足以对我的生活产生一点影响。我不是想\n在这个市场上赚取数百万美元，我只是想赚一些钱，以便我可以\n有一个...",
      "title": "是什么让你在知道这是一个不稳定的市场，你可能会失去所有的投资后，仍然留在加密货币市场。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "對我來說，唯一讓我仍然留在加密貨幣市場的原因是，這裏沒有\n我在第三世界國家有更好的選擇？\n\n一份工作的薪水甚至不足以對我的生活產生一點影響。我不是想\n在這個市場上賺取數百萬美元，我只是想賺一些錢，以便我可以\n有一個...",
      "title": "是什麼讓你在知道這是一個不穩定的市場，你可能會失去所有的投資後，仍然留在加密貨幣市場。"
    }
  ]
}