{
  "author": "OceanBlue85",
  "the_new_excerpt": "Revenue: $6.64 billion versus $6.63 billion expected\n\nEarnings per share: $1.19 versus $1.36 expected\n\nGlobal paid subscriber additions: 8.51 million versus 6.03 million expected\n\nNetflix said Tuesday it plans to be cash-flow neutral this year and cash-flow\npositive every year after 2021, and will…",
  "original_created_utc": 1611092060,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "收入：66.4亿美元，预期66.3亿美元。\n\n每股收益。1.19美元，预期为1.36美元\n\n全球付费用户新增。851万，而预期为603万\n\nNetflix周二表示，计划在今年实现现金流中性，现金流。\n2021年以后每年都是正数，并将...",
      "title": "Netflix财报超预期，可能回购"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "收入：66.4億美元，預期66.3億美元。\n\n每股收益。1.19美元，預期爲1.36美元\n\n全球付費用戶新增。851萬，而預期爲603萬\n\nNetflix週二表示，計劃在今年實現現金流中性，現金流。\n2021年以後每年都是正數，並將...",
      "title": "Netflix財報超預期，可能回購"
    }
  ],
  "title": "Netflix earnings report beat, possible buyback",
  "created_utc": 1611122685,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Revenue: $6.64 billion versus $6.63 billion expected</p>\n\n<p>Earnings per share: $1.19 versus $1.36 expected</p>\n\n<p>Global paid subscriber additions: 8.51 million versus 6.03 million expected</p>\n\n<p>Netflix said Tuesday it plans to be cash-flow neutral this year and cash-flow positive every year after 2021, and will no longer need external financing to fund its operations, ending a decade-long trend and vindicating investors who have plowed money into the company despite its cash-burning ways.</p>\n\n<p>Netflix also said it will consider share buybacks, a practice it hasn’t done since 2011 — the last time the company was cash-flow positive. The announcement came as part of Netflix’s earnings announcement, where the company also announced EPS of $1.19 on revenues of $6.64 billion for the fourth quarter, and 203.66 million global subscribers, up from 26 million at the end of 2011. Shares were up about 10% on the news.</p>\n\n<p>For the past 10 years, Netflix has upended the media industry by taking a leap of faith. It has spent billions of dollars on licensed and original content each year to boost its catalog, and along the way morphed into a replacement product for traditional pay-TV in millions of households. Since 2011, Netflix has raised $15 billion in debt to help pay for this content. The company said it plans to pay back its outstanding debt that matures in 2021 with its more than $8 billion of cash on hand.</p>\n\n<p>Over the years, Netflix skeptics, such as Wedbush analyst Michael Pachter, have pointed out that Netflix’s increasing debt load should be concerning for investors as content spending ballooned and the company burned more cash.</p>\n\n<p>“Netflix has burned more cash every year since 2013,” Pachter told CNBC in June 2018. “What happens when they need to keep increasing their spending and suddenly they have $10 billion of debt? People are going to start asking, ‘can this company pay us back?’ If that happens, their lending rate will spike. If Netflix needs to raise capital, they’ll issue stock. And that’s when investors will get spooked.”</p>\n\n<p>But that hasn’t happened. The cost of original programming hasn’t doomed the company. And Tuesday’s announcement suggests it won’t. Meanwhile, as Netflix has grown, the number of U.S. households with traditional pay TV has dropped from a peak of 100 million in 2012 to about 75 million today. Media executives are now planning for a world where that figure falls to between 50 million and 60 million in five years.</p>\n\n<p>Netflix’s market capitalization in Jan. 2011 was $11.5 billion. Today, it’s more than $220 billion.</p>\n\n<p>Pandemic quarantines have jump-started Netflix’s return to positive cash flow. With production stalled amid coronavirus shutdowns and people around the world stuck at home, Netflix added 36.57 million subscribers in 2020 while spending less money on content than usual. Last year, Netflix reported positive quarterly free cash flow for three consecutive quarters for the first time since 2014.</p>\n\n<p>The acceleration in subscribers and subsequent movement of all media companies toward streaming has given CEOs Reed Hastings and Ted Sarandos confidence that Netflix will be able to limit churn and start consistently making money.</p>\n\n<p>Netflix investor narrative</p>\n\n<p>The unknown question is how investors will respond to the change in Netflix’s narrative. While operating a sustainable business without the need for outside debt and share buybacks is “Business 101,” Netflix’s stock has risen as investors have increasingly come to the conclusion that Netflix would make good on that promise.</p>\n\n<p>“We intend to be a much larger and much more profitable self-funding company over time,” Hastings said during Netflix’s 2019 first-quarter earnings conference call. “That is the path we’re on. As we talked about in the letter, we’re committed to improve our cash flow profile meaningfully, starting in 2020 and then each year thereafter.”</p>\n\n<p>As Netflix’s days of cash burn are behind it, it’s possible Netflix may need a new Wall Street narrative to convince investors its future growth story is worthy of the company’s lofty valuation.</p>\n\n<p>Perhaps that new narrative will be the complete toppling of pay-TV with a Netflix-centered bundle of streaming services. The entire entertainment industry has reorganized to prepare for such an occurrence with each major media company developing its own streaming service in the past year or so.</p>\n\n<p>But it’s also possible rising competition from Disney, Apple, WarnerMedia and others may stagnate Netflix’s subscriber growth. Investors could punish Netflix for share buybacks instead of using it for more content. Activist investor Daniel Loeb has pushed Disney to eliminate its dividend to focus more on new original programming.</p>\n\n<p>If Netflix is choosing to use excess cash for buybacks, it may be because Hastings and Sarandos think the company’s status -- and ability to raise prices in the future -- is so strong that they can start to transition the company into a new, more mature phase without seeing a subsequent loss in value.</p>\n\n<p><a href=\"https://www.cnbc.com/2021/01/19/netflix-says-cash-flow-positive-after-2021-no-more-external-financing.html?utm_content=Main&amp;utm_medium=Social&amp;utm_source=Facebook&amp;fbclid=IwAR10NVgE5VvGtbKnK_KOD73-FJ6yfjEhSCuqhnCzOBYKzgNJoGVKlehK2Yo#Echobox=1611090627\">Netflix earnings </a></p>\n</div><!-- SC_ON -->",
  "score": 55,
  "permalink": "/r/stocks/comments/l0tuot/netflix_earnings_report_beat_possible_buyback/",
  "subreddit": "stocks",
  "id": "l0tuot",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1611311219653
}