{
  "author": "JoannieStiver",
  "the_new_excerpt": "Tech earnings are receiving all the hype recently, and if you guys are like me,\nyou’re looking for stocks to get into at low prices, and ride out the growth\n(we’re all aiming for the next TSLA). While tech like TSLA is always in the\nnews, I’m starting to think more about COVID stocks and those who…",
  "original_created_utc": 1620309974,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "最近、ハイテク企業の業績が大々的に報じられていますが、もし皆さんが私のように\n私のように、低価格で参入し、成長を乗り切るための銘柄を探している人は多いでしょう。\n次のTSLAを目指しています）。TSLAのような技術は常にニュースになっていますが\n私は、COVIDのような銘柄や、そのような技術を持つ人たちのことを考え始めています。",
      "title": "あなたのPPEメーカープレイとは？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "最近，科技行业的收益被炒得沸沸扬扬，如果你们像我一样。\n如果你们像我一样，你们正在寻找可以以低价进入的股票，并度过增长期\n我们都在寻找下一个TSLA）。虽然像TSLA这样的科技公司总是出现在新闻中\n我开始更多地考虑COVID股票，以及那些有能力的人。",
      "title": "你的个人防护设备制造商在玩什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "最近，科技行業的收益被炒得沸沸揚揚，如果你們像我一樣。\n如果你們像我一樣，你們正在尋找可以以低價進入的股票，並度過增長期\n我們都在尋找下一個TSLA）。雖然像TSLA這樣的科技公司總是出現在新聞中\n我開始更多地考慮COVID股票，以及那些有能力的人。",
      "title": "你的個人防護設備製造商在玩什麼？"
    }
  ],
  "title": "What Are Your PPE Manufacturer Plays?",
  "created_utc": 1620314365,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Tech earnings are receiving all the hype recently, and if you guys are like me, you’re looking for stocks to get into at low prices, and ride out the growth (we’re all aiming for the next TSLA). While tech like TSLA is always in the news, I’m starting to think more about COVID stocks and those who provide COVID related supplies, because let’s face it, Coronavirus is not over and spikes in India, Brazil, and even the EU are unfortunate examples that immediate medical response and prevention measures are still needed. </p>\n\n<p>Some may look at PPE as a summer 2020 trend but that is far from true and PPE stocks will continue to perform well. One that I came across recently is Optec International (OTC:OPTI), a manufacturing company of LED and PPE product. OPTI announced really impressive financials this week, <a href=\"https://otcmarkets.com/stock/OPTI/news/OPTEC-International-Reports-4391-Year-over-Year-Revenue-Increase-for-the-3rd-Quarter-2021?id=301349\">4391% YOY Q3 growth</a> and revenue at $11 million. OPTI’s been making a slew of acquisitions, but one that I’m interested in is a company called WeShield. They have audited revenues of $55 million in 2020 and projected revenues of over <a href=\"https://www.otcmarkets.com/stock/OPTI/news/OPTEC-International-Inc-To-Acquire-WeShield-An-Established-AI-Driven-NY-MedTech-Company-In-PPE-Space?id=295925\">$100 million for 2021</a>. The company says this growth is due to proprietary AI tech.  </p>\n\n<p>Either way, OPTI is an example of an affordable PPE stock that I have on my radar, today they’re trading at around $0.09 a share. Other suppliers to keep in mind from an investing standpoint are 3M (MMM), DuPont (DD), and Owens &amp; Minor (OMI) - these are top PPE manufacturers and suppliers. 3M is being traded at just under $200, with DuPont at $79 and Owens at $35. These companies are established healthcare suppliers with Owens &amp; Minor, for example, being established in 1882. And like I was saying above, the demand for PPE IS NOT going anywhere. In April, Plastic News published an article citing Owens’ performance and stated that the pandemic will continue to boost the medical supply market as health systems expand their PPE supply. </p>\n\n<p>I genuinely think that PPE is going overlooked and that there are exciting new companies that will emerge in the medical supplier space. Interested in hearing other PPE plays or your guys take.</p>\n</div><!-- SC_ON -->",
  "score": 192,
  "permalink": "/r/investing/comments/n6822k/what_are_your_ppe_manufacturer_plays/",
  "subreddit": "investing",
  "id": "n6822k",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620985994593
}