{
  "author": "ClassicAny59",
  "original_created_utc": 1627238744,
  "title": "Successfully mining 3 coins eth, xmr, and rayven for a year to date. My wife didn't think I could.",
  "created_utc": 1627321298,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;m not a smart man by any means look at my punctuation, but I got the bright idea in November to begin mining never used a mining software barley knew anything about computers. I went head deep in and has been very successful now mining three separate coins with 2 cpu rigs and 1 4x gpu rig. My wife didn&#39;t think I would be able to do it or even figure it out, this learning step has been one of my proudest. Most the people in my circles believe crypto is magic internet money so i wanted to tell a community, Prove em wrong everytime!</p>\n</div><!-- SC_ON -->",
  "score": 151,
  "permalink": "/r/CryptoCurrency/comments/orhb8r/successfully_mining_3_coins_eth_xmr_and_rayven/",
  "subreddit": "CryptoCurrency",
  "id": "orhb8r",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I'm not a smart man by any means look at my punctuation, but I got the bright\nidea in November to begin mining never used a mining software barley knew\nanything about computers. I went head deep in and has been very successful now\nmining three separate coins with 2 cpu rigs and 1 4x gpu rig. My wife…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は決して賢い人間ではありませんが、私の句読点を見てください。\nマイニングソフトを使ったこともないし、コンピュータのこともほとんど知らない。\nコンピュータについては何も知りませんでした。私は頭から突っ込んで、今ではとても成功しています。\n2つのCPUリグと1つの4x Gpuリグで3つのコインを採掘しています。私の妻は...",
      "title": "eth、xmr、rayvenの3つのコインのマイニングに1年前から成功。妻は私ができるとは思っていなかったようです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我不是一个聪明人，看看我的标点符号，但我有一个聪明的想法，那就是\n我在11月有了一个聪明的想法，开始挖矿，从来没有使用过挖矿软件，我对电脑一无所知。\n关于计算机的任何知识。我一头扎了进去，现在已经非常成功了\n用2台cpu设备和1台4倍gpu设备挖了三个独立的币。我的妻子...",
      "title": "迄今为止，成功地挖掘了3个硬币 eth, xmr, and rayven一年。我的妻子认为我不可能。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我不是一個聰明人，看看我的標點符號，但我有一個聰明的想法，那就是\n我在11月有了一個聰明的想法，開始挖礦，從來沒有使用過挖礦軟件，我對電腦一無所知。\n關於計算機的任何知識。我一頭紮了進去，現在已經非常成功了\n用2臺cpu設備和1臺4倍gpu設備挖了三個獨立的幣。我的妻子...",
      "title": "迄今爲止，成功地挖掘了3個硬幣 eth, xmr, and rayven一年。我的妻子認爲我不可能。"
    }
  ]
}