{
  "author": "slightlystronger",
  "the_new_excerpt": "I recently made a post in this subreddit.\n\nIt was removed by the automoderator.\n\nThe automoderator sent me the following message:\n\n> Sorry your post was removed in r/stocks [/r/stocks] because of rule 4: The\n> R***hd app should be discussed in r/R**hd . We already whitelisted discussions\n> regarding…",
  "original_created_utc": 1613257761,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我最近在这个subreddit发了一个帖子。\n\n它被automoderator删除了。\n\n自动管理人给我发了以下信息。\n\n> 对不起，你的帖子在r/stocks[/r/stocks]被删除了，因为规则4：\n> R***hd应用应该在r/R**hd讨论。我们已经将讨论列入白名单\n> 关于...",
      "title": "这个分论坛的版主设定的期望值非常不明确，在没有正当理由的情况下禁言。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我最近在這個subreddit發了一個帖子。\n\n它被automoderator刪除了。\n\n自動管理人給我發了以下信息。\n\n> 對不起，你的帖子在r/stocks[/r/stocks]被刪除了，因爲規則4：\n> R***hd應用應該在r/R**hd討論。我們已經將討論列入白名單\n> 關於...",
      "title": "這個分論壇的版主設定的期望值非常不明確，在沒有正當理由的情況下禁言。"
    }
  ],
  "title": "The mods of this subreddit set very unclear expectations and ban people without just cause.",
  "created_utc": 1613269749,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I recently made a post in this subreddit.</p>\n\n<p>It was removed by the automoderator.</p>\n\n<p>The automoderator sent me the following message:</p>\n\n<blockquote>\n<p>Sorry your post was removed in <a href=\"/r/stocks\">r/stocks</a> because of rule 4: The R*<em>**h</em><em>d app should be discussed in r/R</em><em>**h</em><em>d . We already whitelisted discussions regarding R</em><em>**h</em>*d IPO, so message the mods if your post is regarding the IPO &amp; still was removed, if not see below:</p>\n\n<p>READ CAREFULLY:\nIf you&#39;re making a post and mentioning you use R*<em>**h</em><em>d , please don&#39;t, the app is shilled so much that it&#39;s spam, please copy your post and repost without mentioning R</em><em>**h</em><em>d or the app/broker you use.\nIf you&#39;re trying to get help with R</em><em>**h</em><em>d , then post to r/R</em><em>**h</em><em>d that includes how to use options or asking why a stock/etf is missing on R</em><em>**h</em><em>d \nIf you&#39;re looking for a list of brokers, click here.\nIf this isn&#39;t a discussion on R</em><em>**h</em><em>d , please resubmit your post without the word R</em><em>**h</em>*d .\nAnd absolutely no referral links!!! See rule 2!\nA list of the rules can be found here, and if you&#39;re new to <a href=\"/r/stocks\">r/stocks</a> please see the wiki and/or read this post.</p>\n\n<p>I am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.</p>\n</blockquote>\n\n<p>So you know what I did? I followed the instruction in the message that said &quot;please copy your post and repost without mentioning R*<em>**h</em>*d .&quot;</p>\n\n<p>So my next post didn&#39;t say R*<em>**h</em>*d on it in any way shape or form.</p>\n\n<p>It was also removed by the automoderator. </p>\n\n<p>I got this message: </p>\n\n<blockquote>\n<p>Sorry your post was removed in <a href=\"/r/stocks\">r/stocks</a> because the title tells me you&#39;re new, so we&#39;re going to get you setup:</p>\n\n<p>See our wiki which has virtually everything on stock picking\nIf instead you just want the fast route to investing, see here.\nA list of brokers here.\nNeed to practice?\nBook recommendations\nWebsites that&#39;ll help you get better or get stock info.\nDid you need a trading system? Try uptrends or look for buy signals.; here&#39;s 4 methods of Trend Trading.\nMake sure you know our sub reddit rules here and read our sticky posts like this one.</p>\n\n<p>Finally after reading the wiki if you have specific questions, or want to share what you learned/gained/lost, feel free to post them at <a href=\"/r/stocks\">r/stocks</a>, just make sure not to put in the title &quot;noob, newbie, newcomer, or beginner.&quot; Thanks.</p>\n</blockquote>\n\n<p>Okay, sure. Fair enough. I wanted to <strong>share what I learned</strong> which was CLEARLY encouraged in the message from the automoderator.</p>\n\n<p>So I modified my post A THIRD TIME. This time, it didn&#39;t get automatically removed. It had a score of 21 and had received a wholesome award by the time it was removed. Along with my removal, I got a THREE DAY BAN and this message from the mod team:</p>\n\n<blockquote>\n<p>You have been temporarily banned from participating in <a href=\"/r/stocks\">r/stocks</a>. This ban will last for 3 days. You can still view and subscribe to <a href=\"/r/stocks\">r/stocks</a>, but you won&#39;t be able to post or comment.</p>\n\n<p>Note from the moderators:</p>\n\n<p>Stop making new posts we have had 100+ lessons learned GME posts in the last few days. Use the Stickied threads or existing GME threads.</p>\n\n<p>If you have a question regarding your ban, you can contact the moderator team for <a href=\"/r/stocks\">r/stocks</a> by replying to this message.</p>\n</blockquote>\n\n<p>At this point, I felt like I hadn&#39;t violated any rules, especially to an extent that deserved a ban. The reason they gave me for my ban is to &quot;stop making Ga me st op posts.&quot; Well... that&#39;s not in the rules, is it?</p>\n\n<p>So I reached out to the mod team and said:</p>\n\n<blockquote>\n<p>A ban without a warning is pretty uncool. More people seemed to like my post than dislike it.</p>\n\n<p>Probably won&#39;t be returning to this subreddit since I feel so unwelcomed.</p>\n</blockquote>\n\n<p>And they sent me this message:</p>\n\n<blockquote>\n<p>Automoderator did warn you, twice. Generally we perma ban for this, but the other mod gave you a 3 day temp ban with only 2 more days to go, so you&#39;re over reacting.</p>\n\n<p>Next time read the automod messages that are sent you to.</p>\n</blockquote>\n\n<p>So that&#39;s my whole story here. Citizens of <a href=\"/r/stocks\">/r/stocks</a>, you tell me. Was my ban deserved? Or was the mod team out of line?</p>\n</div><!-- SC_ON -->",
  "score": 869,
  "permalink": "/r/stocks/comments/ljbprd/the_mods_of_this_subreddit_set_very_unclear/",
  "subreddit": "stocks",
  "id": "ljbprd",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613728623046
}