{
  "author": "screwyoushadowban",
  "original_created_utc": 1650923217,
  "title": "At what point in Europe and the Americas did seeing a mouse or a rat in the home go from \"oh hi, Jeff\" to \"we need to deal with this RIGHT NOW\" and how closely does that track with awareness of modern germ theory?",
  "created_utc": 1650968533,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So in a lot of developed cities and in rural places all over the world encountering a couple rodents in a subway station or in the barn is not at all unusual even if personally or economically undesirable and is generally handled by the city or the farmer as just the cost of living life or doing business - and lots of people in the country regard a barn cat or two as sufficient, regardless of how questionable the net effect of that is. But a rodent in the house is something that needs to be more or less immediately dealt with, possibly by an expensive professional depending on the severity, local health concerns (my region of the U.S. is home to hantaviruses and the plague), and homeowner&amp;#39;s proclivities.&lt;/p&gt;\n\n&lt;p&gt;But I imagine this wasn&amp;#39;t always the case and one point rodents in the home could be expected as normal part of life, even if never exactly desirable (like how most people don&amp;#39;t freak out or even care if a moth is fluttering around, especially if they don&amp;#39;t have any fur or cashmere clothes). So when did that change? And does it have any relation to public awareness of modern germ theory or were they separate developments?&lt;/p&gt;\n\n&lt;p&gt;Thanks!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 106,
  "permalink": "/r/AskHistorians/comments/ubwf4p/at_what_point_in_europe_and_the_americas_did/",
  "subreddit": "AskHistorians",
  "id": "ubwf4p",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "So in a lot of developed cities and in rural places all over the world\nencountering a couple rodents in a subway station or in the barn is not at all\nunusual even if personally or economically undesirable and is generally handled\nby the city or the farmer as just the cost of living life or doing…"
}