{
  "author": "screwyoushadowban",
  "original_created_utc": 1650923217,
  "title": "At what point in Europe and the Americas did seeing a mouse or a rat in the home go from \"oh hi, Jeff\" to \"we need to deal with this RIGHT NOW\" and how closely does that track with awareness of modern germ theory?",
  "created_utc": 1650968533,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So in a lot of developed cities and in rural places all over the world encountering a couple rodents in a subway station or in the barn is not at all unusual even if personally or economically undesirable and is generally handled by the city or the farmer as just the cost of living life or doing business - and lots of people in the country regard a barn cat or two as sufficient, regardless of how questionable the net effect of that is. But a rodent in the house is something that needs to be more or less immediately dealt with, possibly by an expensive professional depending on the severity, local health concerns (my region of the U.S. is home to hantaviruses and the plague), and homeowner&amp;#39;s proclivities.&lt;/p&gt;\n\n&lt;p&gt;But I imagine this wasn&amp;#39;t always the case and one point rodents in the home could be expected as normal part of life, even if never exactly desirable (like how most people don&amp;#39;t freak out or even care if a moth is fluttering around, especially if they don&amp;#39;t have any fur or cashmere clothes). So when did that change? And does it have any relation to public awareness of modern germ theory or were they separate developments?&lt;/p&gt;\n\n&lt;p&gt;Thanks!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 106,
  "permalink": "/r/AskHistorians/comments/ubwf4p/at_what_point_in_europe_and_the_americas_did/",
  "subreddit": "AskHistorians",
  "id": "ubwf4p",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "So in a lot of developed cities and in rural places all over the world\nencountering a couple rodents in a subway station or in the barn is not at all\nunusual even if personally or economically undesirable and is generally handled\nby the city or the farmer as just the cost of living life or doing…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "だから、世界中の多くの先進都市や地方都市で\n地下鉄の駅や納屋で数匹のネズミに遭遇することは、個人的あるいは経済的に好ましくないとしても、まったく珍しいことではありません。\n個人的に、あるいは経済的に好ましくないことであっても、珍しいことではありません。\n都市や農家では、生活や仕事の代償として処理されます。",
      "title": "ヨーロッパやアメリカでは、ネズミを見たときに「やあ、ジェフ」から「今すぐ対処しなければ」となったのはどの時点なのか、また、現代の細菌説の認識とどの程度一致しているのでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "因此，在很多发达城市和世界各地的农村地区\n在地铁站或谷仓里遇到几只老鼠一点也不稀奇\n即使在个人或经济上是不可取的，而且一般都是由城市或农民处理的。\n被城市或农民作为生活或工作的成本来处理。",
      "title": "在欧洲和美洲，从什么时候开始，看到家里有老鼠，从 \"哦，你好，杰夫 \"到 \"我们需要马上处理这个问题\"，这与现代细菌理论的认识有多密切？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "因此，在很多發達城市和世界各地的農村地區\n在地鐵站或穀倉裏遇到幾隻老鼠一點也不稀奇\n即使在個人或經濟上是不可取的，而且一般都是由城市或農民處理的。\n被城市或農民作爲生活或工作的成本來處理。",
      "title": "在歐洲和美洲，從什麼時候開始，看到家裏有老鼠，從 \"哦，你好，傑夫 \"到 \"我們需要馬上處理這個問題\"，這與現代細菌理論的認識有多密切？"
    }
  ]
}