{
  "author": "Flying_Koeksister",
  "original_created_utc": 1659588594,
  "title": "Rant: Why I'm done with SOL, and why you should pull out too.",
  "created_utc": 1659618843,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Typed on mobile. &lt;/p&gt;\n\n&lt;p&gt;Somewhere in this sub I read about DCA&amp;#39;ing top ten coins outperformed trying to find the next moonshot over the long term. SOL was a top ten coin at some point in time . So I decided time to expand my portfolio and buy some SOL. &lt;/p&gt;\n\n&lt;p&gt;At first it was quite nice, the concentrated liquidity pools (Whirlpools) on the Orca DEX was really nice and I was making sweet returns (provided I monitored the price range closely)&lt;/p&gt;\n\n&lt;p&gt;Then came many network issues (down times). Orca didn&amp;#39;t work because the SOL network was down. My whirlpool fell below my liquidity range due to the price drop and I lost because I couldn&amp;#39;t pull out my liquidity. &lt;/p&gt;\n\n&lt;p&gt;Not learning my lesson, I continued on until yesterday. &lt;/p&gt;\n\n&lt;p&gt;Then came yesterday&amp;#39;s hack. Hot wallets being drained, no one knows what&amp;#39;s happening. &lt;/p&gt;\n\n&lt;p&gt;I log in into my Solflair wallet - nothing.  F*** looks like I got hacked.  I decide to check out the Blockchain explorer, enter my wallet address and I get &amp;quot;error not found&amp;quot;.  OMW did this hacker hack me so hard my wallet is off the network??? &lt;/p&gt;\n\n&lt;p&gt;I double checked my wallet addresses and I tried opened my  different devices and browsers  (using my seed phrase). Still nothing. My SOL (and liquidity pools) were gone!  &lt;/p&gt;\n\n&lt;p&gt;Like any investor   I made peace with this and move on with my day. After all SOL was simply one coin in a balanced portfolio. &lt;/p&gt;\n\n&lt;p&gt;Last night I thought let me report my wallet as being affected by the hack in case there are compensation schemes. But first I&amp;#39;ll double check my wallets. &lt;/p&gt;\n\n&lt;p&gt;And my word. All my SOL, all my liquidity pools, all there like magic. I&amp;#39;m grateful, I swapped into ETH. But I&amp;#39;m also done with SOL&lt;/p&gt;\n\n&lt;p&gt;So if your still into SOL as an investor ask yourself:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;p&gt;How can this  crapchain can be restarted by Dev&amp;#39;s on demand?&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Why does  crap chain has multiple downtime a year?&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Why the hell can your coins not be seen the morning of the hack? Is the network so overwhelmed that you can&amp;#39;t even see coins in the Blockchain explorer?   (I thought SOL was supposed to be super fast?)&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;why the hell must we defend poor service? Other Blockchains offer speed, reliability and Defi too. &lt;/p&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;I&amp;#39;m grateful I finally pulled out with no losses.  And I hope you manage to pull out too.  SOL has a long way to go before it reaches the reliability and uptime  of other Blockchains. &lt;/p&gt;\n\n&lt;p&gt;Thank you for reading.&lt;/p&gt;\n\n&lt;p&gt;TL; Dr : I&amp;#39;ve pulled out of SOL. &lt;/p&gt;\n\n&lt;p&gt;Network downtime losses me money.  Inability to track my coins during hacks/network overloads  on the block explorer shatters my confidence in the network.&lt;/p&gt;\n\n&lt;p&gt;You should pull out too&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 564,
  "permalink": "/r/CryptoCurrency/comments/wfs403/rant_why_im_done_with_sol_and_why_you_should_pull/",
  "subreddit": "CryptoCurrency",
  "id": "wfs403",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Typed on mobile.\n\nSomewhere in this sub I read about DCA'ing top ten coins outperformed trying to\nfind the next moonshot over the long term. SOL was a top ten coin at some point\nin time . So I decided time to expand my portfolio and buy some SOL.\n\nAt first it was quite nice, the concentrated…"
}