{
  "author": "SHAPE-SHIFTIN-LIZARD",
  "original_created_utc": 1627341636,
  "title": "You cannot recover the vault of a deleted Reddit account.",
  "created_utc": 1627356646,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Unfortunately with some things I said in worldnews against what I believed was a shill, I was targeted by down vote bots and every post would be negative 20 karma after I instantly posted. So I deleted my account. </p>\n\n<p>Attempting to recover my vault, it denied my seed phrase and said &quot;This vault is used by another member&quot;. </p>\n\n<p>The moons are gone. </p>\n\n<p>If you need to delete your reddit account, I suggest just leave it inactive and let your moons sit there until you move them. </p>\n\n<p>For anyone who asks, it was only 100 moons but I hope my mistake can help.</p>\n\n<p>Edit: Not a moon farming post just a headsup.</p>\n\n<p>EDIT: Some users have said you can import to another wallet outside of Reddit, I will try this and report back.</p>\n</div><!-- SC_ON -->",
  "score": 203,
  "permalink": "/r/CryptoCurrency/comments/osarcq/you_cannot_recover_the_vault_of_a_deleted_reddit/",
  "subreddit": "CryptoCurrency",
  "id": "osarcq",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Unfortunately with some things I said in worldnews against what I believed was a\nshill, I was targeted by down vote bots and every post would be negative 20\nkarma after I instantly posted. So I deleted my account.\n\nAttempting to recover my vault, it denied my seed phrase and said \"This vault is\nused…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "残念なことに、私がワールドニュースで発言したことの中には、偽者と思われる人物に対して\nしていましたが、残念なことに、私はダウンボーレートボットに狙われ、すべての投稿がマイナス20\nカルマがマイナス20になってしまいました。そこで私は自分のアカウントを削除しました。\n\n金庫を復元しようとすると、私のシードフレーズが拒否され、\"This vault is used....\nused...",
      "title": "削除されたRedditアカウントのVaultを復元することはできません。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "不幸的是，由于我在世界新闻中说了一些反对我认为是骗子的话语\n骗局，我被降票机器人盯上了，每一个帖子都会被负20\nkarma后，我立即发帖。所以我删除了我的账户。\n\n在试图恢复我的金库时，它拒绝了我的种子词组，并说 \"这个金库是\n已使用...",
      "title": "你无法恢复已删除的Reddit账户的金库。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "不幸的是，由於我在世界新聞中說了一些反對我認爲是騙子的話語\n騙局，我被降票機器人盯上了，每一個帖子都會被負20\nkarma後，我立即發帖。所以我刪除了我的賬戶。\n\n在試圖恢復我的金庫時，它拒絕了我的種子詞組，並說 \"這個金庫是\n已使用...",
      "title": "你無法恢復已刪除的Reddit賬戶的金庫。"
    }
  ]
}