{
  "author": "kayaarr",
  "the_new_excerpt": "Choi Won-seok reports in the Korean Ghosun Libo news publication that according\nto an official from the Japanese automotive industry Toyota and Tesla have been\nreviewing the partnership since last year and are approaching the final stage.\n\nHere are some of the highlights of Toyota Tesla partnership.…",
  "original_created_utc": 1617083224,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "崔元锡在韩国《高顺立博》新闻刊物上报道称，据。\n对日本汽车行业的一位官员来说，丰田和特斯拉已经被。\n从去年开始审查合作关系，目前已接近最后阶段。\n\n以下是丰田特斯拉合作的一些亮点....。",
      "title": "特斯拉和丰田正考虑联合开发小型电动SUV平台"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "崔元錫在韓國《高順立博》新聞刊物上報道稱，據。\n對日本汽車行業的一位官員來說，豐田和特斯拉已經被。\n從去年開始審查合作關係，目前已接近最後階段。\n\n以下是豐田特斯拉合作的一些亮點....。",
      "title": "特斯拉和豐田正考慮聯合開發小型電動SUV平臺"
    }
  ],
  "title": "Tesla and Toyota Are Considering Jointly Developing a Small Electric SUV Platform",
  "created_utc": 1617089959,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Choi Won-seok reports in the Korean Ghosun Libo news publication that according to an official from the Japanese automotive industry Toyota and Tesla have been reviewing the partnership since last year and are approaching the final stage.</p>\n\n<p>Here are some of the highlights of Toyota Tesla partnership. When the partnership with Toyota is established, Tesla will be able to launch a compact SUV EV at low cost using the Toyota platform.</p>\n\n<p>The Ghosun IIbo is the biggest newspaper in SK. A Tesla source Sawyer Merritt, tweets that he has been told &quot;the reporter of the story is also highly regarded. We&#39;ll see if it&#39;s true.&quot;</p>\n\n<p>Toyota provides the vehicle platform to Tesla, and instead, Tesla provides some of the electronic control platform and software technology installed in its vehicle to Toyota.</p>\n\n<p>When the partnership with Toyota is established, Tesla will be able to launch a compact SUV electric vehicle at low cost using the Toyota platform. In addition, Tesla&#39;s sales in Japan, which are around 1,000 units per year, are likely to increase significantly.</p>\n\n<p>Tesla CEO Elon Musk said at the &#39;Battery Day&#39; in September of last year, that Tesla &quot;will release a $25,000 compact and affordable electric car in 2023. However, among experts, there were several opinions that it would be difficult for Tesla to find a way to sell electric cars at such low prices. Especially considering Tesla has already developed the Model 3 in 2017, The model electric crossover in 2020, the exoskeleton of the Cybertruck and working on the Semi truck. at this moment we have no idea about Tesla&#39;s affordable compact vehicle, which now it looks like may be produced in partnership with Toyota, if this report is true.</p>\n\n<p>I think this is a smart move for both Tesla and Toyota. Some people may be skeptical of a Tesla Toyota partnership, but remember that Tesla helped built Toyota RAV4 in 2012. I am sure you guys remember when Toyota sold its Tesla stocks in 2017.</p>\n\n<p>&#x200B;</p>\n\n<p><strong>What&#39;s in it for Toyota?</strong></p>\n\n<p>Toyota can also significantly reduce the resources and time spent on innovation of its vehicle&#39;s integrated electronic control platform ( ECU ) and operating system ( OS ) by using Tesla technology. Toyota is evaluating that the integrated ECU and OS technology that can control and improve vehicle functions through wireless updates (Over The Air) is lagging behind Tesla. In other words, through cooperation between the two companies, Tesla can reduce the cost and period of developing small electric SUVs and Toyota&#39;s benefit is the gain in ECU and OS development. It aims for a win-win effect by reducing the time it takes for the two companies to compensate for each other&#39;s weaknesses, allowing them to focus more on their own strengths.</p>\n\n<p>&#x200B;</p>\n\n<p>Tesla and Toyota have previously partnered. The two companies agreed to jointly develop electric vehicles in 2010, and in 2012 marketed Toyota&#39;s RAV4 electric vehicle equipped with Tesla&#39;s battery system. However, due to various reasons such as poor sales, the alliance between the Toyota and Tesla ended in 2017. Yet, the close relationship between Musk and Toyota CEO Akio Toyoda was maintained, leaving room for a reunion between the two companies in the future.</p>\n\n<p>&#x200B;</p>\n\n<p>Tesla&#39;s Fremont Factory is an automobile manufacturing plant in Fremont, California, operated by Tesla. But the facility opened as the General Motors Fremont Assembly in 1962, and was later operated by NUMMI, a former GM–Toyota joint venture. Tesla took ownership in 2010.</p>\n\n<p>&#x200B;</p>\n\n<p>Last year, Toyota sold 9.35 million vehicles, surpassing Volkswagen and returned to the world&#39;s top sales in five years. Toyota, along with Isuzu and its truck subsidiary Hino, plans to accelerate the electric and autonomous driving of commercial vehicles. Prior to this, Toyota also established a hydrogen fuel cell development joint venture with five Chinese automobile and technology companies, including Tsinghua University, Beijing, Cheil, Dongfeng, and Guangzhou Motors. The jointly developed hydrogen fuel cell system will be installed on Chinese trucks and buses from 2022. In addition, Toyota is striving to maximize economies of scale related to electrification and autonomous driving, including successive capital alliances with rivals Mazda and Suzuki.</p>\n\n<p>&#x200B;</p>\n\n<p>Meanwhile, Tesla CEO Elon Musk wrote on Twitter on the 27th of March that “the likelihood that Tesla will soon become the largest company in the world is higher than 0%.” Although the context is not clear, it was also written “probably within a few months,” an expression that can be interpreted as referring to a period, and was soon deleted. Currently, Tesla&#39;s market capitalization is about $ 590 billion, which is one-third of the world&#39;s largest market capitalization company, Apple.</p>\n\n<p>&#x200B;</p>\n\n<p>Tesla&#39;s share price continued to rise even after surpassing Toyota, which was the first in the industry&#39;s market capitalization at the time, in July of last year. Tesla, in particular, has a task to achieve economies of scale, with only 500,000 vehicles sold as of last year. If the alliance with Toyota is established, it can receive great power to expand mass production faster and at lower cost.</p>\n\n<p><a href=\"https://www.torquenews.com/1/tesla-and-toyota-are-considering-jointly-developing-small-electric-suv-platform\">Source</a></p>\n</div><!-- SC_ON -->",
  "score": 4523,
  "permalink": "/r/stocks/comments/mg91ws/tesla_and_toyota_are_considering_jointly/",
  "subreddit": "stocks",
  "id": "mg91ws",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1617357142658
}