{
  "author": "Leponneur",
  "the_new_excerpt": "Hello,\n\nI'm a french \"millenial\", and quite often, especially when I talk with\nindividuals of the previous generation (the \"boomers\"), they jokingly, or with a\ncertain tone of disdain, tell me that my generation doesn't read anymore, and\nthat THEY were way more cultured, in all sorts of way…",
  "original_created_utc": 1612953055,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "你好啊\n\n我是一个法国的 \"千禧年\"，而且经常，特别是当我和你聊天的时候。\n上一代人(\"潮人\")，他们开玩笑地说，或者带着 \"潮人 \"的口吻。\n某种不屑的语气，告诉我我们这一代人已经不读书了，而且。\n他们更有文化，在各种方式... ...",
      "title": "当今的年轻人读书真的比上一代人少吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "你好啊\n\n我是一個法國的 \"千禧年\"，而且經常，特別是當我和你聊天的時候。\n上一代人(\"潮人\")，他們開玩笑地說，或者帶着 \"潮人 \"的口吻。\n某種不屑的語氣，告訴我我們這一代人已經不讀書了，而且。\n他們更有文化，在各種方式... ...",
      "title": "當今的年輕人讀書真的比上一代人少嗎？"
    }
  ],
  "title": "Does the youth of today really read less books than the previous generation ?",
  "created_utc": 1612968328,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hello,</p>\n\n<p>I&#39;m a french &quot;millenial&quot;, and quite often, especially when I talk with individuals of the previous generation (the &quot;boomers&quot;), they jokingly, or with a certain tone of disdain, tell me that my generation doesn&#39;t read anymore, and that THEY were way more cultured, in all sorts of way (especially because they didn&#39;t have phones).\n But when I talk with people of my age (25), I recall having multiple conversations about books we read. \n Are the adults right ? Did people in the 60&#39;s/70&#39;s/80&#39;s read more books and were more interested in culture ? </p>\n\n<p>Subsidiary question : In case of an affirmative answer, what did they read ? Mostly &quot;classics&quot; that we learn in school ?</p>\n\n<p>Thanks for the answer</p>\n</div><!-- SC_ON -->",
  "score": 102,
  "permalink": "/r/AskHistorians/comments/lgqxyq/does_the_youth_of_today_really_read_less_books/",
  "subreddit": "AskHistorians",
  "id": "lgqxyq",
  "is_self": true,
  "media": null,
  "is_video": false
}