{
  "author": "Weary_Strawberry2679",
  "original_created_utc": 1656185620,
  "title": "Blockchain not as decentralised as many assume, finds Pentagon sponsored research",
  "created_utc": 1656215282,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Trail of Bits: &amp;quot;We believe the risks inherent in blockchains and cryptocurrencies have been poorly described and are often ignored—or even mocked—by those seeking to cash in on this decade’s gold rush.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Key findings&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;Blockchain immutability can be broken not by exploiting cryptographic vulnerabilities, but instead by subverting the properties of a blockchain’s implementations, networking, and consensus protocols. We show that a subset of participants can garner undue, centralized control over the entire system:\n\n&lt;ul&gt;\n&lt;li&gt;While the encryption used within cryptocurrencies is for all intents and purposes secure, it does not &lt;em&gt;guarantee&lt;/em&gt; security, as touted by proponents.&lt;/li&gt;\n&lt;li&gt;Bitcoin traffic is unencrypted; any third party on the network route between nodes (e.g., internet service providers, Wi-Fi access point operators, or governments) can observe and choose to drop any messages they wish.&lt;/li&gt;\n&lt;li&gt;Tor is now the largest network provider in Bitcoin; just about 55% of Bitcoin nodes were addressable &lt;em&gt;only&lt;/em&gt; via Tor (as of March 2022). A malicious Tor exit node can modify or drop traffic.&lt;/li&gt;\n&lt;/ul&gt;&lt;/li&gt;\n&lt;li&gt;More than one in five Bitcoin nodes are running an old version of the Bitcoin core client that is known to be vulnerable.&lt;/li&gt;\n&lt;li&gt;The standard protocol for coordination within blockchain mining pools, Stratum, is unencrypted and, effectively, unauthenticated.&lt;/li&gt;\n&lt;li&gt;The number of entities sufficient to disrupt a blockchain is relatively low: four for Bitcoin, two for Ethereum, and less than a dozen for most proof-of-stake networks.&lt;/li&gt;\n&lt;li&gt;When nodes have an out-of-date or incorrect view of the network, this lowers the percentage of the hashrate necessary to execute a standard 51% attack. During the first half of 2021, the actual cost of a 51% attack on Bitcoin was closer to 49% of the hashrate—and this can be lowered substantially through network delays.&lt;/li&gt;\n&lt;li&gt;For a blockchain to be optimally distributed, there must be a so-called Sybil cost. There is currently no known way to implement Sybil costs in a permissionless blockchain like Bitcoin or Ethereum without employing a centralized trusted third party (TTP). Until a mechanism for enforcing Sybil costs without a TTP is discovered, it will be almost impossible for permissionless blockchains to achieve satisfactory decentralization.&lt;/li&gt;\n&lt;li&gt;Of all Bitcoin traffic, 60% traverses just three ISPs.&lt;/li&gt;\n&lt;li&gt;The Ethereum ecosystem has a significant amount of code reuse: 90% of recently deployed Ethereum smart contracts are at least 56% similar to each other.&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Conclusion&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;In this report, Trail of Bits has identified several scenarios in which blockchain immutability is called into question not by exploiting cryptographic vulnerabilities but instead by subverting the properties of a blockchain’s implementation, networking, or consensus protocol. A subset of a blockchain’s participants can garner excessive, centralized control over the entire system. The majority of Bitcoin nodes have significant incentives to behave dishonestly, and in fact, there is no known way to create any permissionless blockchain that is impervious to malicious nodes without having a TTP&lt;/p&gt;\n\n&lt;p&gt;See full report here: &lt;a href=\"https://assets-global.website-files.com/5fd11235b3950c2c1a3b6df4/62af6c641a672b3329b9a480_Unintended_Centralities_in_Distributed_Ledgers.pdf\"&gt;https://assets-global.website-files.com/5fd11235b3950c2c1a3b6df4/62af6c641a672b3329b9a480_Unintended_Centralities_in_Distributed_Ledgers.pdf&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 333,
  "permalink": "/r/CryptoCurrency/comments/vkmjjh/blockchain_not_as_decentralised_as_many_assume/",
  "subreddit": "CryptoCurrency",
  "id": "vkmjjh",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Trail of Bits: \"We believe the risks inherent in blockchains and\ncryptocurrencies have been poorly described and are often ignored—or even\nmocked—by those seeking to cash in on this decade’s gold rush.\"\n\nKey findings\n\n * Blockchain immutability can be broken not by exploiting cryptographic\n  …"
}