{
  "author": "roberthonker",
  "original_created_utc": 1634075994,
  "title": "With Shiba Inu nearly in the top 10, I think we can admit that the only thing that matters in crypto is hype.",
  "created_utc": 1634087617,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I thought shit was crazy when DOGE entered the top 10, but little did I know I hadn’t seen shit yet. If things continue at the rate SHIB will be in the top 10 within a few days.</p>\n\n<p>I think this is undeniable proof that the only thing that matters in crypto is hype. It doesn’t matter if your project has a great use case and fundamentals like ALGO and LINK, all that matter is hype. It’s honestly crazy to me that SHIB can be 10 spots ahead of ALGO.</p>\n\n<p>Hype dies eventually, so I’m sure that ALGO and LINK will outperform SHIB in the long term. But for right now, SHIB has been going crazy.</p>\n\n<p><strong>TL;DR: It’s absolutely crazy that SHIB is 10 spots ahead of insanely good projects like ALGO and LINK. This is proof that hype is all that matters in crypto.</strong></p>\n</div><!-- SC_ON -->",
  "score": 539,
  "permalink": "/r/CryptoCurrency/comments/q6wqyo/with_shiba_inu_nearly_in_the_top_10_i_think_we/",
  "subreddit": "CryptoCurrency",
  "id": "q6wqyo",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I thought shit was crazy when DOGE entered the top 10, but little did I know I\nhadn’t seen shit yet. If things continue at the rate SHIB will be in the top 10\nwithin a few days.\n\nI think this is undeniable proof that the only thing that matters in crypto is\nhype. It doesn’t matter if your project…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "DOGEがトップ10に入ったとき、私はクレイジーだと思いましたが、私が見ていなかったことを知りました。\nまだ何も見ていなかったとは。このままいけば、SHIBは数日以内にトップ10入りするでしょう。\n数日のうちにトップ10に入るでしょう。\n\nこれは、暗号化において重要なのは誇大広告だけであるという紛れもない証拠だと思います。\nハイプです。あなたのプロジェクトが...なんて関係ない。",
      "title": "柴犬がほぼトップ10に入っていることから、暗号で重要なのはハイプだけだと認めることができると思います。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "当DOGE进入前十名时，我认为这一切都很疯狂，但我不知道我\n我还没有看到狗屎。如果事情继续发展下去，SHIB将在几天内进入前十名。\n在几天之内。\n\n我认为这是不可否认的证明，在加密货币中唯一重要的是\n炒作。如果你的项目......这并不重要。",
      "title": "Shiba Inu几乎进入前10名，我想我们可以承认，加密货币中唯一重要的是炒作。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "當DOGE進入前十名時，我認爲這一切都很瘋狂，但我不知道我\n我還沒有看到狗屎。如果事情繼續發展下去，SHIB將在幾天內進入前十名。\n在幾天之內。\n\n我認爲這是不可否認的證明，在加密貨幣中唯一重要的是\n炒作。如果你的項目......這並不重要。",
      "title": "Shiba Inu幾乎進入前10名，我想我們可以承認，加密貨幣中唯一重要的是炒作。"
    }
  ]
}