{
  "author": "leftsideupside",
  "original_created_utc": 1635201890,
  "title": "Do men judge what a woman's labia look like?",
  "created_utc": 1635212642,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;ve never been sexually active but I&#39;ve seen a lot of porn, and my labia look nothing like what I&#39;ve seen in those videos.</p>\n\n<p>Even when I was a little girl who had no idea what sex was, I remember thinking my body was uneven - one &#39;lip&#39; (shudder) is large and frilly, and sticks out. The other lip is small and tucked in. I used to wish I could cut off the large side so that it was even. </p>\n\n<p>I&#39;m worried that men will think I look disgusting down there. The large lip sticks out, so that it is always visible.</p>\n</div><!-- SC_ON -->",
  "score": 144,
  "permalink": "/r/TooAfraidToAsk/comments/qfsg27/do_men_judge_what_a_womans_labia_look_like/",
  "subreddit": "TooAfraidToAsk",
  "id": "qfsg27",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I've never been sexually active but I've seen a lot of porn, and my labia look\nnothing like what I've seen in those videos.\n\nEven when I was a little girl who had no idea what sex was, I remember thinking\nmy body was uneven - one 'lip' (shudder) is large and frilly, and sticks out.\nThe other lip is…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は性行為をしたことがありませんが、AVをたくさん見てきたので、私の大陰唇は以下のように見えます。\n私の大陰唇はそれらのビデオで見たものとは全く違います。\n\nセックスが何であるかを知らなかった少女時代にも、次のように考えていました。\n私の体は凸凹していて、片方の「唇」（震え声）は大きくてフリフリしていて、突き出ている。\nもう片方の唇は...。",
      "title": "男性は女性の大陰唇の形を判断しますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我从来没有过性生活，但我看过很多色情片，我的阴唇看起来\n与我在那些视频中看到的完全不同。\n\n即使当我还是一个不知道性是什么的小女孩时，我记得我认为\n我的身体是不均匀的--一个 \"嘴唇\"（颤抖）很大，有褶皱，而且伸出来。\n另一个嘴唇是...",
      "title": "男人会判断女人的阴唇是什么样子吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我從來沒有過性生活，但我看過很多色情片，我的陰脣看起來\n與我在那些視頻中看到的完全不同。\n\n即使當我還是一個不知道性是什麼的小女孩時，我記得我認爲\n我的身體是不均勻的--一個 \"嘴脣\"（顫抖）很大，有褶皺，而且伸出來。\n另一個嘴脣是...",
      "title": "男人會判斷女人的陰脣是什麼樣子嗎？"
    }
  ]
}