{
  "author": "No_Weather682",
  "original_created_utc": 1637076823,
  "title": "Imagine if 3 months ago I told you that some people would \"freak out\" for a 60k BTC dip",
  "created_utc": 1637095156,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Seriously, 10% in 1 day? Those are rookie numbers! Bitcoin is chilling at 60k, you don&#39;t need to freak out for a healthy price correction. \nIf you&#39;re a beginner, get used to it. We all know that crypto is volatile, and you can&#39;t expect to make 10x in 1 year if you sell when you are 10% down in 1 day. \nThis bull run is far from over, just keep DCA and chill. Remember that 1 month ago Bitcoin wasn&#39;t even at $60k. Keep in mind that those who panic sell are not rewarded, don&#39;t let FUD or emotions control your investment choices.</p>\n\n<p>TLDR: It&#39;s just a healthy price correction, chill.</p>\n</div><!-- SC_ON -->",
  "score": 171,
  "permalink": "/r/CryptoCurrency/comments/qvaefq/imagine_if_3_months_ago_i_told_you_that_some/",
  "subreddit": "CryptoCurrency",
  "id": "qvaefq",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Seriously, 10% in 1 day? Those are rookie numbers! Bitcoin is chilling at 60k,\nyou don't need to freak out for a healthy price correction. If you're a\nbeginner, get used to it. We all know that crypto is volatile, and you can't\nexpect to make 10x in 1 year if you sell when you are 10% down in 1 day.…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "1日で10％ってマジ？それは新人の数字だ！ビットコインは60kで冷えています。\n健全な価格修正のためにビクビクする必要はありません。あなたが初心者なら\n初心者の方は、それに慣れてください。私たちは皆、暗号が不安定であることを知っており、1年で10倍の利益を期待することはできません。\n1日で10％下がったときに売っても、1年で10倍になることは期待できない....",
      "title": "もし3ヶ月前に私が、60k BTCのディップで「パニックになる」人がいると言っていたらと想像してみてください。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "说真的，1天内完成10%？这些都是新秀的数字! 比特币在6万的时候就已经很冷了。\n你不需要为一个健康的价格修正而大惊小怪。如果你是一个\n初学者，要习惯它。我们都知道，加密货币是不稳定的，而且你不能\n如果你在1天内下跌10%时卖出，你不能期望在1年内赚到10倍....",
      "title": "想象一下，如果3个月前我告诉你，有些人会因为6万BTC的下跌而 \"抓狂\""
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "說真的，1天內完成10%？這些都是新秀的數字! 比特幣在6萬的時候就已經很冷了。\n你不需要爲一個健康的價格修正而大驚小怪。如果你是一個\n初學者，要習慣它。我們都知道，加密貨幣是不穩定的，而且你不能\n如果你在1天內下跌10%時賣出，你不能期望在1年內賺到10倍....",
      "title": "想象一下，如果3個月前我告訴你，有些人會因爲6萬BTC的下跌而 \"抓狂\""
    }
  ]
}