{
  "author": "Anon-Dude-Bitcoin",
  "the_new_excerpt": "Anonymous account for obvious reasons but I wanted to share my story.\n\nEdit: I was making 18k per year while working construction in 2012 because I had\ntrouble finding work in my field of study. I worked hard, made a career change,\nand my first \"real\" salary was 52k per year.\n\nI started buying…",
  "original_created_utc": 1608742649,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "匿名账号的原因很明显，但我想分享我的故事。\n\n编辑：我在2012年做建筑工作时每年赚18K，因为我有\n在我的专业领域找工作很困难。我努力工作，转行，\n我的第一份“真正”薪水是每年52000英镑。\n\n我开始买…",
      "title": "我之前在BTC上下了很大的赌注。这是我的故事。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "匿名賬號的原因很明顯，但我想分享我的故事。\n\n編輯：我在2012年做建築工作時每年賺18K，因爲我有\n在我的專業領域找工作很困難。我努力工作，轉行，\n我的第一份“真正”薪水是每年52000英鎊。\n\n我開始買…",
      "title": "我之前在BTC上下了很大的賭注。這是我的故事。"
    }
  ],
  "title": "I previously went all-in on BTC. Here's my story.",
  "created_utc": 1608795274,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Anonymous account for obvious reasons but I wanted to share my story.</p>\n\n<p>Edit: I was making 18k per year while working construction in 2012 because I had trouble finding work in my field of study. I worked hard, made a career change, and my first &quot;real&quot; salary was 52k per year.</p>\n\n<p>I started buying Bitcoin in June of 2017. I continued to buy small amounts as the price increased. I was convinced I would &quot;never&quot; be able to afford an entire Bitcoin but I kept at it. I was only making about $59k per year at the time ($10,000 below the median income for my area) and still trying to pay off what had started off as over $100,000 in student loan debt. </p>\n\n<p>Like many others, I was discouraged by some of my purchasing decisions (like buying at 17k), but I kept buying until I had my first whole Bitcoin around October of 2018. Even then, I was only down about 35% because I had made purchases starting in June of 2017. Then, shit hit the fan in November of 2018 and I watched as I was suddenly down more than 65%. My bags were heavy and I truly understood this was the despair stage. However, I didn&#39;t give up and I actually bought another full Bitcoin at $4,100 in April of 2018 despite feeling like my anus had been stretched to the max.   </p>\n\n<p>I didn&#39;t really buy any more Bitcoin after that for a long while. I felt that I had reached the &quot;don&#39;t invest more than you can afford to lose&quot; limit and I was a member of the 10 million club with my 2.1 BTC. I paid off debt, lived life, fixed up my house, etc. I thought I was done buying Bitcoin. I finally &quot;broke even&quot; around the $7,700 price mark.   </p>\n\n<p>Fast forward to March of 2020 when we crashed because of Covid, I was kicking myself because I didn&#39;t really have money at the time to buy more. I only had a couple thousand in an emergency fund and I don&#39;t touch that unless there is a true emergency.   </p>\n\n<p>Then a perfect storm happened. I got a new job close by that was paying significantly more money and I needed to sell my house. A house that I had built up a lot of equity in over a short period of time. I went from only having a $2,000 emergency fund (plus 2.1 Bitcoin that was worth about $22,000 at the time) and a standard 401k from my previous employer worth about 55k, to about $65,000 in cash from the sale of my house and $55k in a 401k that I could now put into an IRA.   </p>\n\n<p>I put 10% down on the purchase of a new home, bought some stuff, and I had $30,000 in cash once the dust settled. At first, I thought that money would simply be my 3-6 month emergency fund and it would sit in cash in my checking account, earning 0.0007% interest. That&#39;s the responsible thing to do, right? Around this same time, I rolled my 401k from my previous employer into an IRA in part because they wouldn&#39;t let me buy GBTC. I found an IRA provider who allowed me to buy GBTC and I sent the money over. It took me 7 years to build up a 401k worth $55,000. (I think I averaged about 13% annual returns).    </p>\n\n<p>Between the cash and the new IRA, I had over $85,000 just sitting on the sidelines, waiting to pull the trigger. This was more money than I had ever had before. BTC sat around $9,000 for several weeks and I was convinced we would retrace back down to 7 or 8k before the next bull cycle. I hesitated out of fear, because of all the FUD surrounding Covid.   </p>\n\n<p>Then I saw the news about Microstrategy, then the price pumped to over 11k (Fuck! I can&#39;t buy 3 whole Bitcoin anymore with my 30k). I knew I was FOMOing in, but I figured it wouldn&#39;t matter much in 10 years if I bought at 9.5k or 10k or 11k. I think seeing institutional investors was the thing that pushed my hand to go &quot;all-in&quot;. That, and I still have a good 30 years of work ahead of me so if I go bust, then at least I can start again. I bought $30,000 worth of Bitcoin at $11,100 and I bought about $55k worth of GBTC when BTC was around $11,300.   </p>\n\n<p>Now, I&#39;ve more than doubled my net worth in a matter of months and it feels fucking great. Altogether, I&#39;ve put about $100,000 into Bitcoin which is now worth more than $260,000. I&#39;m hopeful for the future and I think 2021 is going to be a great year for Bitcoin. I don&#39;t plan on selling my Bitcoin for anything other than paying off my mortgage. I&#39;ve already decided that whenever my $30,000 BTC buy becomes enough to pay capital gains taxes and my mortgage, I will sell. I&#39;m making the decision now so that I won&#39;t have to later. I will always HODL at least 2.1 BTC to give to my kid or a charity if my kid turns out to be a little shit.  I&#39;ll start to sell some of my GBTC in 20 years when I&#39;m getting ready to retire. I hope they launch a Bitcoin ETF before then so that I don&#39;t have to pay 2% every year. I&#39;ve already been through a full bull/bear cycle so I feel I am better prepared for when it happens next. I&#39;ve only sold once before early on, and I regretted it so now I have diamond hands.   </p>\n\n<p>Onward and upward.</p>\n\n<p>Edit: For all of the folks who are saying I shouldn&#39;t pay off my mortgage, I understand what you&#39;re saying. I could make considerably more money if I just HODL for 30 years. I could also lose it all because even though I&#39;m a believer, Bitcoin isn&#39;t a sure thing. A paid for house is. It&#39;s also a great way to give myself a 25% pay raise which would give me far more cash flow to invest in businesses or give to others in need or improve the quality of life for me and my family or even to buy more Bitcoin. I have very personal reasons for wanting to pay off my mortgage. It&#39;s a goal I&#39;ve had years before I ever heard of Bitcoin. 2.1 Bitcoin + my Greyscale funds will be enough to live comfortably well into the future. I don&#39;t want to be greedy.</p>\n</div><!-- SC_ON -->",
  "score": 1192,
  "permalink": "/r/Bitcoin/comments/kiwnpn/i_previously_went_allin_on_btc_heres_my_story/",
  "subreddit": "Bitcoin",
  "id": "kiwnpn",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1609271710881
}