{
  "author": "PeekingPotato",
  "the_new_excerpt": "Hey there guys, I just started analyzing stocks more and I thought I´ll try to\ndo that and post it here. That´s my first analysis that I post anywhere. If you\nhave any feedback for me that would be great and highly appreciated. If you have\nquestions feel free to ask, I´ll try to answer…",
  "original_created_utc": 1621884208,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "皆さん、こんにちは。私は株の分析を始めたばかりですが、私もやってみようと思いました。\nして、ここに投稿しようと思いました。これが、私がどこかに投稿する最初の分析です。もしあなたが\nご意見、ご感想がありましたら、とてもありがたいです。もし質問があれば\nご質問があれば、お気軽にお尋ねください。",
      "title": "アップルの株価分析。AAPLは買いなのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "嘿，各位，我刚刚开始分析股票，我想我将试着去做。\n并在这里发表。这是我第一次在任何地方发布分析报告。如果你们\n对我有任何反馈意见，那将是非常好的，非常感谢。如果你有\n问题，请随时提出，我将尽力回答......",
      "title": "苹果股票分析。AAPL是一个好的买点吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "嘿，各位，我剛剛開始分析股票，我想我將試着去做。\n並在這裏發表。這是我第一次在任何地方發佈分析報告。如果你們\n對我有任何反饋意見，那將是非常好的，非常感謝。如果你有\n問題，請隨時提出，我將盡力回答......",
      "title": "蘋果股票分析。AAPL是一個好的買點嗎？"
    }
  ],
  "title": "Apple Stock Analysis: Is AAPL a good buy?",
  "created_utc": 1621951531,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hey there guys, I just started analyzing stocks more and I thought I´ll try to do that and post it here. That´s my first analysis that I post anywhere. If you have any feedback for me that would be great and highly appreciated. If you have questions feel free to ask, I´ll try to answer everything. </p>\n\n<p>&#x200B;</p>\n\n<p>Today we will look through the basics of Apple´s business and then see if we can come up with a fair value for Apple´s stock using discounted free cashflow. </p>\n\n<p>This is not financial advice and I personally own shares in Apple. Nevertheless I will try to stay as unbiased and objective as I can.</p>\n\n<p>First let´s review their different revenue streams. Their biggest stream, around <strong>50%</strong> of their sales comes from the <strong>iPhone</strong>. The <strong>Mac</strong> makes up around <strong>11%</strong>, the <strong>iPad</strong> around <strong>9%</strong>, <strong>Services</strong> around <strong>19%</strong> and <strong>Wearables, Home and Accessories</strong> around <strong>11%</strong>. </p>\n\n<p>For the valuation: </p>\n\n<p>We take <strong>analyst estimates</strong>, we discount that by our <strong>required return of 8%</strong>. Then we use the <strong>perpetual growth rate of 2,5%</strong> and that gave us a fair value for Apple´s stock of <strong>$90 per share</strong>. But because we have to account for <strong>Apple´s debt</strong> as well, our <strong>fair value of equity</strong> would be <strong>$86 per share</strong>.</p>\n\n<p>Now feel free to include a margin of safety to that. </p>\n\n<p>Because Apple´s price is higher right now, I don´t think buying more is a good idea. Although you can always dollar-cost-average. That´s where you invest every month the same amount.</p>\n\n<p>Where I see Apple´s stock price in 5 years. We can calculate where the price might be in 5 years with the <strong>Earnings Per Share (EPS TTM)</strong>, the <strong>Estimated Growth Rate</strong> and the <strong>Future P/E Value</strong>. With this method I get a stock price of <strong>$242 per share</strong> which is higher than what it is now. </p>\n\n<p>What I´ll do. I believe in Apple. I think they will stay for a long time and innovate even more. That´s why, although the price is not where I would want it to be, I will continue to <strong>dollar-cost-average</strong>. That way I don´t mind the volatile market and hold for the longterm. </p>\n\n<p>Thank you for reading and I hope I´ll see you again.</p>\n</div><!-- SC_ON -->",
  "score": 46,
  "permalink": "/r/stocks/comments/nk5zl6/apple_stock_analysis_is_aapl_a_good_buy/",
  "subreddit": "stocks",
  "id": "nk5zl6",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1622197389734
}