{
  "author": "woodfast88",
  "original_created_utc": 1625056252,
  "title": "So I had an argument with my dad about Crypto",
  "created_utc": 1625072418,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Once in a while I think by myself &quot;lets give my mom and dad a visit&quot;, since I am obviously the most favorite son of 3. So I went there to watch some football and it was all nice and fun. All of a sudden, during the commercial brake, my dad asked: &quot;Son, do you have money invested in Bitcoin?&quot;. I replied &quot;of course I did.&quot;, knowing that he (as an old fashioned-, retired-, stock guy who likes to argue) was starting an argument about it. He started ranting on how it is just one big scam and &quot;all those other bitcoins&quot; (meaning altcoins red.) are even more so. And they have no real value or use, now or in the future. So I asked why he was thinking that, giving the fact that his statement was so absolute. The poor man based his assumption on just one (!) article in the financial times, &quot;and other articles&quot; but he couldn&#39;t clarify which ones. He also stated that he never seen any blockchain is use in practice. So I started to explain what blockchain does and what the difference is between different coins or tokens. He simply replied: &quot;if you believe that, than you are a believer and just as well join a church&quot;. With those kind of arguments, you can basically never lose one.. However, long story short: don&#39;t try to be a good son, don&#39;t argue with your dad and don&#39;t cut the brakes on your dads car, you will regret it.</p>\n</div><!-- SC_ON -->",
  "score": 302,
  "permalink": "/r/Bitcoin/comments/oawc0n/so_i_had_an_argument_with_my_dad_about_crypto/",
  "subreddit": "Bitcoin",
  "id": "oawc0n",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Once in a while I think by myself \"lets give my mom and dad a visit\", since I am\nobviously the most favorite son of 3. So I went there to watch some football and\nit was all nice and fun. All of a sudden, during the commercial brake, my dad\nasked: \"Son, do you have money invested in Bitcoin?\". I…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "たまには「パパとママに会いに行こう」と一人で考えています。\nサッカーを見に行ったんだ。\n楽しくて仕方がありませんでした。突然、コマーシャルブレークの間に、父が\n尋ねた。\"息子よ、お前はビットコインに投資しているか？I...",
      "title": "父とCryptoについて議論しました。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "偶尔我也会自己想，\"让我们去看看我的爸爸妈妈\"，因为我是\n显然，我是3个孩子中最喜欢的儿子。所以我去那里看了一些足球，一切都很愉快。\n这一切都很好，很有趣。突然，在商业刹车时，我爸爸\n问道。\"儿子，你有投资比特币的钱吗？\"。I...",
      "title": "所以我和我的父亲就加密货币发生了争执"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "偶爾我也會自己想，\"讓我們去看看我的爸爸媽媽\"，因爲我是\n顯然，我是3個孩子中最喜歡的兒子。所以我去那裏看了一些足球，一切都很愉快。\n這一切都很好，很有趣。突然，在商業剎車時，我爸爸\n問道。\"兒子，你有投資比特幣的錢嗎？\"。I...",
      "title": "所以我和我的父親就加密貨幣發生了爭執"
    }
  ]
}