{
  "author": "Some1fromReddit",
  "the_new_excerpt": "The FK'in Humanity.\n\nAnd they have no problem setting an example to their children that it's ok to\nspend probably over God knows how many thousands over 40 years of their adult\nlife slapping $10, $20, maybe even $100 down because the number has risen to a\n$1,000,000,000 jackpot, and this will…",
  "original_created_utc": 1621828921,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "FK'in Humanity。\n\nそして、彼らは自分の子供たちに、大人になってからの40年間、おそらく神のみぞ知る何千ドルものお金を使っても良いという手本を示すことに何の問題もありません。\n大人になってからの40年間で、おそらく神のみぞ知る何千人もの人々が\n10ドル、20ドル、もしかしたら100ドルの大当たりが出たからといって\n10億ドルの大当たりが出たからといって、10ドル、20ドル、100ドルを叩いてもいいんだ、と...",
      "title": "しかし、300,000,000分の1の確率の宝くじに3年間で100ドル、1000ドルを費やすことには何の問題もありません(笑)"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "人类的FK'in。\n\n他们毫无顾忌地给自己的孩子树立了一个榜样，那就是可以\n天知道在他们成年后的40年里花了多少钱？\n在他们成年后的40年里，花了大概几千块钱，拍下10美元、20美元，甚至100美元，因为这个数字已经上升到一个\n1,000,000,000美元的大奖，而这将...",
      "title": "没有人说 \"加密货币不好，你做HODL的事情可能会失去你的钱\"，但在3年内花100美元甚至1000美元购买300,000,000比1赔率的彩票却没有问题。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "人類的FK'in。\n\n他們毫無顧忌地給自己的孩子樹立了一個榜樣，那就是可以\n天知道在他們成年後的40年裏花了多少錢？\n在他們成年後的40年裏，花了大概幾千塊錢，拍下10美元、20美元，甚至100美元，因爲這個數字已經上升到一個\n1,000,000,000美元的大獎，而這將...",
      "title": "沒有人說 \"加密貨幣不好，你做HODL的事情可能會失去你的錢\"，但在3年內花100美元甚至1000美元購買300,000,000比1賠率的彩票卻沒有問題。"
    }
  ],
  "title": "No coiners say \"Crypto bad, You can lose your money doing the HODL thing\" but have no problem spending $100s or even $1000s on lottery tickets over 3 years at 300,000,000 to 1 odds lol",
  "created_utc": 1621892029,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>The FK&#39;in Humanity. </p>\n\n<p>And they have no problem setting an example to their children that it&#39;s ok to spend probably over God knows how many thousands over 40 years of their adult life slapping $10, $20, maybe even $100 down because the number has risen to a $1,000,000,000 jackpot, and this will inevitably lead to buying scratch off tickets at least once. </p>\n\n<p>&quot;but you never know tho&quot;...</p>\n\n<p>YOU NEVER KNOW WITH CRYPTO EITHER but I can promise you the odds are better than 300,000,000 to 1.  </p>\n\n<p>If you bought lottery tickets over the course of your life and then spread fud about crypto... Just go...rub strawberry syrup all over yourself and sleep outside naked... In a bush of gnats and mosquitos</p>\n\n<p>Because that&#39;s how it feels to me.. . They are like gnats flying around in the crypto space.  Probably the IQ of a gnat too when it comes to financial concerns of others.</p>\n</div><!-- SC_ON -->",
  "score": 165,
  "permalink": "/r/CryptoCurrency/comments/njp2lj/no_coiners_say_crypto_bad_you_can_lose_your_money/",
  "subreddit": "CryptoCurrency",
  "id": "njp2lj",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1622197385280
}