{
  "author": "QuirkyBooks",
  "original_created_utc": 1630616238,
  "title": "How can Texas push policies that \"protect the rights of the individual\" (i.e., outlaw mask mandates) while simultaneously stripping rights from individuals (i.e., 6-week abortion ban)? How do people not realize this is crazy town?",
  "created_utc": 1630636864,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I am sincerely confused by the political battlefield that is Texas currently. People are both ferociously pushing for the &quot;individual right&quot; to wear a mask or get the vax or not, but very few of these same people are pushing back against the systematic demolishment of women&#39;s reproductive rights. How is it that people can argue &quot;My body, my choice&quot; for masks (an issue of public safety at pandemic levels), but it&#39;s &quot;My body, State&#39;s choice&quot; for abortions (an issue of personal safety)? I mean, I realize hypocrisy is intensely prevalent, but I didn&#39;t think citizens would allow officials to be this brazen about it.</p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/TooAfraidToAsk/comments/pgqlwc/how_can_texas_push_policies_that_protect_the/",
  "subreddit": "TooAfraidToAsk",
  "id": "pgqlwc",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I am sincerely confused by the political battlefield that is Texas currently.\nPeople are both ferociously pushing for the \"individual right\" to wear a mask or\nget the vax or not, but very few of these same people are pushing back against\nthe systematic demolishment of women's reproductive rights.…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は、現在のテキサス州の政治的戦場に心から困惑しています。\n人々は、マスクをするかしないかという「個人の権利」を激しく主張しています。\nしかし、女性のリプロダクティブ・ライツが組織的に破壊されていることに反発する人はほとんどいません。\n女性のリプロダクティブ・ライツが組織的に破壊されていることに反発している人はほとんどいません。....",
      "title": "テキサス州では、「個人の権利を守る」という政策（マスク着用義務の禁止など）を推し進める一方で、個人の権利を奪う政策（6週齢の妊娠中絶の禁止など）を行うことができるのでしょうか？これがクレイジー・タウンであることに、人々はどうして気づかないのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我对目前德克萨斯州的政治战场感到由衷的困惑。\n人们都在激烈地推动戴口罩或不戴口罩的 \"个人权利\"。\n但这些人中却很少有人反对 \"个人权利\"，即戴口罩或不接种疫苗。\n系统地拆毁妇女的生殖权利....",
      "title": "德州怎么能一边推行 \"保护个人权利 \"的政策（即取缔面具任务），一边剥夺个人的权利（即禁止6周堕胎）？人们怎么没有意识到这是一个疯狂的小镇？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我對目前德克薩斯州的政治戰場感到由衷的困惑。\n人們都在激烈地推動戴口罩或不戴口罩的 \"個人權利\"。\n但這些人中卻很少有人反對 \"個人權利\"，即戴口罩或不接種疫苗。\n系統地拆毀婦女的生殖權利....",
      "title": "德州怎麼能一邊推行 \"保護個人權利 \"的政策（即取締面具任務），一邊剝奪個人的權利（即禁止6周墮胎）？人們怎麼沒有意識到這是一個瘋狂的小鎮？"
    }
  ]
}