{
  "author": "clodhopper88",
  "original_created_utc": 1629648013,
  "title": "This just in - Leaving positive karma on a post when you leave is the best way to improve visibility on your comment and help the community at the same time!",
  "created_utc": 1629653440,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Maybe it&#39;s just me, but if I comment on a post I subsequently updoot the comment I respond to, and the post itself....</p>\n\n<p>I recently read a post on the front page that stated <a href=\"/r/CC\">/r/CC</a> is #2 on reddit for comments karma, and north of #600 for post karma. </p>\n\n<p>There&#39;s no reason that a quality post should have less than 10 karma and 80+ comments. </p>\n\n<p>If you have something to say on a post, be a good person a leave a thumbs up on the way out. Lead by example and show others that they can be rewarded for quality content on this sub!</p>\n\n<p>Edit: Holy shit this is blowing up. I want to clarify for any mods that stumble on that this post is in no way begging for updoots or condoning updooting for no reason. It&#39;s solely to bring light to the fact that people need to reward helpful content instead of being passive. </p>\n\n<p>Cheers everyone!</p>\n</div><!-- SC_ON -->",
  "score": 276,
  "permalink": "/r/CryptoCurrency/comments/p9f23s/this_just_in_leaving_positive_karma_on_a_post/",
  "subreddit": "CryptoCurrency",
  "id": "p9f23s",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Maybe it's just me, but if I comment on a post I subsequently updoot the comment\nI respond to, and the post itself....\n\nI recently read a post on the front page that stated /r/CC is #2 on reddit for\ncomments karma, and north of #600 for post karma.\n\nThere's no reason that a quality post should have…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私だけかもしれませんが、ある記事にコメントすると、その後コメントをアップしてしまうことがあります。\nその記事自体にも反応してしまいます....\n\n最近読んだフロントページの記事によると、/r/CCはコメントのカルマではredditで2位、投稿のカルマでは600位を超えているそうです。\nコメントのカルマはredditで2位、投稿のカルマは600位を超えています。\n\nこのような状況では、質の高い投稿をしても、その投稿にカルマがかかるのは当然です。",
      "title": "コメントを残す際にプラスのカルマを残すことは、コメントの視認性を高め、同時にコミュニティを助ける最良の方法です。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "也许这只是我的问题，但如果我在一个帖子上发表评论，我随后就会更新评论。\n我回应了，而该帖子本身....。\n\n我最近在首页上看到一个帖子，说/r/CC在reddit上的评论业力排名第二，帖子业力排名第六。\n评论业力排名第二，而帖子业力排名则在600名以后。\n\n没有理由一个高质量的帖子应该有...",
      "title": "这个消息刚刚传来--当你离开时，在帖子上留下积极的因果关系是提高你的评论能见度并同时帮助社区的最好方法"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "也許這只是我的問題，但如果我在一個帖子上發表評論，我隨後就會更新評論。\n我回應了，而該帖子本身....。\n\n我最近在首頁上看到一個帖子，說/r/CC在reddit上的評論業力排名第二，帖子業力排名第六。\n評論業力排名第二，而帖子業力排名則在600名以後。\n\n沒有理由一個高質量的帖子應該有...",
      "title": "這個消息剛剛傳來--當你離開時，在帖子上留下積極的因果關係是提高你的評論能見度並同時幫助社區的最好方法"
    }
  ]
}