{
  "author": "jam-hay",
  "the_new_excerpt": "The digital yuan may give China a technological advantage over the dollar but at\nthe end of the day both the dollar and the yuan are mass printed worthless\npieces of government branded toilet paper.\n\nThe economy that will come out on top, is that with the largest stockpile of\nquality decentralised…",
  "original_created_utc": 1618099653,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "デジタル人民元は、中国がドルに対して技術的に優位に立てるかもしれませんが、結局のところ\n結局、ドルも元も大量に印刷された価値のない政府ブランドのトイレットペーパーだ。\n政府ブランドのトイレットペーパーに過ぎません。\n\n頂点に立つ経済は、質の高い非中央集権的な・・・・・・の最大の備蓄を持つ経済です。\n質の高い分散型の...",
      "title": "世界第2位の経済大国が、第1位の経済大国に先んじてデジタル通貨を発表する中、最終的に真の勝者は、最大のビットコインと主要な分散型暗号通貨の埋蔵量を持つ国となるでしょう。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "数字化人民币可能会让中国拥有对美元的技术优势，但在。\n归根结底，美元和人民币都是一文不值的印刷品。\n政府品牌卫生纸的碎片。\n\n将会脱颖而出的经济体，是拥有最大库存的经济体。\n优质的分散式...",
      "title": "作为世界第二大经济体推出数字货币，以领先于第一大经济体......最终，真正的赢家将是拥有最大的比特币和主要去中心化加密货币储备的国家。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "數字化人民幣可能會讓中國擁有對美元的技術優勢，但在。\n歸根結底，美元和人民幣都是一文不值的印刷品。\n政府品牌衛生紙的碎片。\n\n將會脫穎而出的經濟體，是擁有最大庫存的經濟體。\n優質的分散式...",
      "title": "作爲世界第二大經濟體推出數字貨幣，以領先於第一大經濟體......最終，真正的贏家將是擁有最大的比特幣和主要去中心化加密貨幣儲備的國家。"
    }
  ],
  "title": "As the world's second largest economy launches its digital currency to get ahead of the first.. in the end the real winner will be the country with the largest Bitcoin and major decentralised cryptocurrency reserves.",
  "created_utc": 1618155726,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>The digital yuan may give China a technological advantage over the dollar but at the end of the day both the dollar and the yuan are mass printed worthless pieces of government branded toilet paper.</p>\n\n<p>The economy that will come out on top, is that with the largest stockpile of quality decentralised cryptocurrencies such as Bitcoin</p>\n</div><!-- SC_ON -->",
  "score": 161,
  "permalink": "/r/Bitcoin/comments/mog7pm/as_the_worlds_second_largest_economy_launches_its/",
  "subreddit": "Bitcoin",
  "id": "mog7pm",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1618566611412
}