{
  "author": "IHateElon",
  "the_new_excerpt": "I know its not easy to divert your attention from the market, especially with\nthe shitstorm thats going on right now, but a lot of you guys are way too\nstressed and worried about the market rn. I've seen some rather worrying\ncomments on the daily today and i think some of you need to delete your…",
  "original_created_utc": 1623164614,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "市場から目をそらすのは簡単ではないと思います。\nしかし、皆さんの多くは今の市場にストレスや不安を感じすぎているようです。\nしかし、皆さんの多くは今の市場にストレスを感じ、心配しすぎています。私はいくつかの心配なコメントを見ました。\n今日のデイリーでもかなり心配なコメントを目にしましたが、何人かの方は自分の...",
      "title": "10秒ごとに価格をチェックするのはやめよう。外に出て太陽の光を浴びてください。豊かさよりも大切なのは、心の健康"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我知道要把你的注意力从市场上转移开来并不容易，尤其是在现在的狗屎风暴中。\n但你们中的很多人对市场的压力和担忧都太大了。\n紧张和担心现在的市场。我看到了一些相当令人担忧的\n我认为你们中的一些人需要删除你们的评论。",
      "title": "不要每隔10秒就查看价格。到外面去晒晒太阳。你的心理健康比你的财富更重要"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我知道要把你的注意力從市場上轉移開來並不容易，尤其是在現在的狗屎風暴中。\n但你們中的很多人對市場的壓力和擔憂都太大了。\n緊張和擔心現在的市場。我看到了一些相當令人擔憂的\n我認爲你們中的一些人需要刪除你們的評論。",
      "title": "不要每隔10秒就查看價格。到外面去曬曬太陽。你的心理健康比你的財富更重要"
    }
  ],
  "title": "Stop checking prices every 10 seconds. Go outside and get some sun. Your mental health is more important than your wealth",
  "created_utc": 1623184578,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I know its not easy to divert your attention from the market, especially with the shitstorm thats going on right now, but a lot of you guys are way too stressed and worried about the market rn. I&#39;ve seen some rather worrying comments on the daily today and i think some of you need to delete your apps and get off your damn devices.</p>\n\n<p>Mental health comes first and foremost over wealth. Suicide rates are higher than ever right now and when the market is performing poorly this could push people over the edge as they have a lot riding on crypto. IF this is you, please detach yourself from the market for a while and go out in the world. You havent lost money until you sell. the market WILL go up. maybe not today, or tomorrow but it will and that is almost a guarantee.</p>\n\n<p>Lastly, i want us all to spread more positivity in these times because people need it more than ever. That one upvote, or free award you give someone could literally save their life. Little things matter the most and can make someones day.</p>\n\n<p>Stay strong guys, we are all in this together and good days will come soon.</p>\n\n<p>&#x200B;</p>\n\n<p>edit: who tf downvoted all the comments? some of you people are so sad.</p>\n\n<p>&#x200B;</p>\n\n<p>NFA</p>\n</div><!-- SC_ON -->",
  "score": 717,
  "permalink": "/r/CryptoCurrency/comments/nv63pn/stop_checking_prices_every_10_seconds_go_outside/",
  "subreddit": "CryptoCurrency",
  "id": "nv63pn",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1623404884251
}