{
  "author": "Educational_Job2260",
  "original_created_utc": 1645060511,
  "title": "You know it wouldn't kill you to not be so bitter to each other all the time",
  "created_utc": 1645079746,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Someone hears about Bitcoin one day, reads about cryptocurrencies, gets on reddit, wow so many subreddits talking about the thing i love, and then makes the mistake of joining this one.&lt;/p&gt;\n\n&lt;p&gt;I understand you lost some money after being an &amp;quot;expert&amp;quot; in crypto for a year, let&amp;#39;s hate on the newbies trying to figure out there way and asking questions on this subreddit. &amp;quot;Hey what are you smoking bro, crack?&amp;quot; You got the whole squad laughing, man. Just be a guiding hand to the newbies or can it with the harsh salty comments and criticism.&lt;/p&gt;\n\n&lt;p&gt;To make this platform a better space and to push people forward you need to be able to see to remove yourself from your own perspective and see it from another&amp;#39;s eyes, less bias, less cult like mentality towards your favorite coins, and it&amp;#39;ll be smoother for all of us.&lt;/p&gt;\n\n&lt;p&gt;Through support we can build a better community and some newbies here may go on to form their own startups and build the next big thing in crypto, what comes to mind when I think about supporting the community are launchpads like solanaprime that a providing a good platform for startups and support in their ventures for a change. Let&amp;#39;s just be supportive and see how that plays out.&lt;/p&gt;\n\n&lt;p&gt;We can see you&amp;#39;re trying to moon farm by making OP fall on their face, that&amp;#39;s really pathetic. Be the bigger person, help them help you. That&amp;#39;s my 2 cents on the matter.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 336,
  "permalink": "/r/CryptoCurrency/comments/subyqr/you_know_it_wouldnt_kill_you_to_not_be_so_bitter/",
  "subreddit": "CryptoCurrency",
  "id": "subyqr",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Someone hears about Bitcoin one day, reads about cryptocurrencies, gets on\nreddit, wow so many subreddits talking about the thing i love, and then makes\nthe mistake of joining this one.\n\nI understand you lost some money after being an \"expert\" in crypto for a year,\nlet's hate on the newbies trying…"
}