{
  "author": "Educational_Job2260",
  "original_created_utc": 1645060511,
  "title": "You know it wouldn't kill you to not be so bitter to each other all the time",
  "created_utc": 1645079746,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Someone hears about Bitcoin one day, reads about cryptocurrencies, gets on reddit, wow so many subreddits talking about the thing i love, and then makes the mistake of joining this one.&lt;/p&gt;\n\n&lt;p&gt;I understand you lost some money after being an &amp;quot;expert&amp;quot; in crypto for a year, let&amp;#39;s hate on the newbies trying to figure out there way and asking questions on this subreddit. &amp;quot;Hey what are you smoking bro, crack?&amp;quot; You got the whole squad laughing, man. Just be a guiding hand to the newbies or can it with the harsh salty comments and criticism.&lt;/p&gt;\n\n&lt;p&gt;To make this platform a better space and to push people forward you need to be able to see to remove yourself from your own perspective and see it from another&amp;#39;s eyes, less bias, less cult like mentality towards your favorite coins, and it&amp;#39;ll be smoother for all of us.&lt;/p&gt;\n\n&lt;p&gt;Through support we can build a better community and some newbies here may go on to form their own startups and build the next big thing in crypto, what comes to mind when I think about supporting the community are launchpads like solanaprime that a providing a good platform for startups and support in their ventures for a change. Let&amp;#39;s just be supportive and see how that plays out.&lt;/p&gt;\n\n&lt;p&gt;We can see you&amp;#39;re trying to moon farm by making OP fall on their face, that&amp;#39;s really pathetic. Be the bigger person, help them help you. That&amp;#39;s my 2 cents on the matter.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 336,
  "permalink": "/r/CryptoCurrency/comments/subyqr/you_know_it_wouldnt_kill_you_to_not_be_so_bitter/",
  "subreddit": "CryptoCurrency",
  "id": "subyqr",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Someone hears about Bitcoin one day, reads about cryptocurrencies, gets on\nreddit, wow so many subreddits talking about the thing i love, and then makes\nthe mistake of joining this one.\n\nI understand you lost some money after being an \"expert\" in crypto for a year,\nlet's hate on the newbies trying…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ある日、ビットコインのことを耳にし、暗号通貨について読み、ネットにアクセスする。\nredditには、私が好きなものについて話しているサブレディがたくさんあります。\nこの会社に入ったのが間違いだった。\n\n1年間暗号の \"専門家 \"をしていたのに、損をしたそうですね。\n初心者を恨もうよ...。",
      "title": "そんなに憎まれ口を叩かないでよ"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "某人有一天听说了比特币，阅读了关于加密货币的资料，上了\nreddit，哇，这么多subreddits在讨论我喜欢的东西，然后就犯了\n错了，加入了这个。\n\n我知道你在做了一年的加密货币 \"专家 \"后损失了一些钱。\n让我们憎恨那些尝试的新手......",
      "title": "你知道，如果你不总是对对方如此痛苦的话，也不会死。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "某人有一天聽說了比特幣，閱讀了關於加密貨幣的資料，上了\nreddit，哇，這麼多subreddits在討論我喜歡的東西，然後就犯了\n錯了，加入了這個。\n\n我知道你在做了一年的加密貨幣 \"專家 \"後損失了一些錢。\n讓我們憎恨那些嘗試的新手......",
      "title": "你知道，如果你不總是對對方如此痛苦的話，也不會死。"
    }
  ]
}