{
  "author": "tanmay1010",
  "original_created_utc": 1639860144,
  "title": "Most of the crypto games are unplayable by the current standards of gaming- only selling points are their play-to-earn model and everything NFT strategy",
  "created_utc": 1639895605,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;These games are all reminiscent of early 2000s or before. GTA Vice City which was launched in 2002 could beat all these flagship crypto games to sleep. &lt;/p&gt;\n\n&lt;p&gt;Most of these games have no story, no character development, no world-building, no graphics (many look like pixelated flash games even), nothing. &lt;/p&gt;\n\n&lt;p&gt;By design most of these games are same- you&amp;#39;ve a territory which you need to protect somehow or you&amp;#39;re building up your life by buying a fresh piece of land and then working on that piece of land to create more in-game money which are transferable to Fiat.&lt;/p&gt;\n\n&lt;p&gt;And then they convert everything into an NFT to fish you in. You buy anything and you&amp;#39;ll get an NFT. Plus if you&amp;#39;re lucky, you might win a few pennies worth coins which could be traded for Fiat.&lt;/p&gt;\n\n&lt;p&gt;All these popular games (axie infinity, decentraland, etc) would fit in the mould that i just described. Then what is this hype around gaming? Please, someone enlighten me too.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 155,
  "permalink": "/r/CryptoCurrency/comments/rjg4s5/most_of_the_crypto_games_are_unplayable_by_the/",
  "subreddit": "CryptoCurrency",
  "id": "rjg4s5",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "These games are all reminiscent of early 2000s or before. GTA Vice City which\nwas launched in 2002 could beat all these flagship crypto games to sleep.\n\nMost of these games have no story, no character development, no world-building,\nno graphics (many look like pixelated flash games even),…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "これらのゲームは、いずれも2000年代前半あるいはそれ以前を彷彿とさせるものばかりです。GTAバイスシティ\n2002年に発売されたこれらの主力暗号ゲームは、すべて眠らせることができます。\n\nこれらのゲームのほとんどは、ストーリーもなく、キャラクターも育たず、世界観もない。\nグラフィックがない（まるでドット絵のフラッシュゲームのようなものも多い）、...。",
      "title": "暗号ゲームのほとんどは、現在のゲームの基準ではプレイできないもので、唯一のセールスポイントは、プレイ・トゥー・アーンのモデルとNFT戦略です。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这些游戏都让人联想到21世纪初或之前。GTA副城\n2002年推出的《GTA副城》可以把所有这些旗舰级的加密货币游戏打入梦乡。\n\n这些游戏中的大多数没有故事，没有人物发展，没有世界建设。\n没有图形（许多看起来甚至像像素化的Flash游戏），...",
      "title": "按照目前的游戏标准，大多数加密货币游戏是不可玩的--唯一的卖点是他们的游戏赚取模式和一切NFT战略。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這些遊戲都讓人聯想到21世紀初或之前。GTA副城\n2002年推出的《GTA副城》可以把所有這些旗艦級的加密貨幣遊戲打入夢鄉。\n\n這些遊戲中的大多數沒有故事，沒有人物發展，沒有世界建設。\n沒有圖形（許多看起來甚至像像素化的Flash遊戲），...",
      "title": "按照目前的遊戲標準，大多數加密貨幣遊戲是不可玩的--唯一的賣點是他們的遊戲賺取模式和一切NFT戰略。"
    }
  ]
}