{
  "author": "herereadthis",
  "original_created_utc": 1636046811,
  "title": "You're kidding yourself if you think Millennials and Gen Z will inherit anything from the boomers. If you want wealth, create it for yourself.",
  "created_utc": 1636058416,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>This is in response to another post where OP talks about $30T of wealth from boomers eventually being transferred to the next generation. OP tells us to be patient with our crypto investing and wait until the boomers give us money.</p>\n\n<p>Get out of here with that trickle-down nonsense. Given everything we know about the boomer generation, do you honestly expect to get anything? The boomer generation is all about hoarding resources. They see the younger generations struggling with multiple jobs. What about owning a house or having enough extra money to raise family? Total fantasies. </p>\n\n<p>Boomers. Don&#39;t. Care. They insult us for our participation trophies. They mock us for being &quot;woke.&quot; They tell us to stop eating avocado toast.</p>\n\n<p>In fact, this whole narrative of, &quot;just be patient, you&#39;ll get your opportunity someday,&quot; sounds exactly like something a boomer would say. Translated, it means, &quot;Don&#39;t upset the status quo. That might threaten our power and wealth.&quot;  OP links to two articles articles about how millenials and gen z should be excited about receiving crumbs in the future. Unsurprisingly, the sources are from wealth services catered for boomers.</p>\n\n<p>For the rest of us: If you want wealth, create your own wealth. If you think crypto is the way forward, then good luck. It might save us from the boomers.</p>\n\n<p>Lastly, let&#39;s not be like the boomers when we get old. Should any of us acquire wealth beyond our means, please share with the next generation that comes after us. I like that one dad who created crypto wallets for his kids. They shouldn&#39;t have to suffer the way we did.</p>\n</div><!-- SC_ON -->",
  "score": 371,
  "permalink": "/r/CryptoCurrency/comments/qmpryx/youre_kidding_yourself_if_you_think_millennials/",
  "subreddit": "CryptoCurrency",
  "id": "qmpryx",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "This is in response to another post where OP talks about $30T of wealth from\nboomers eventually being transferred to the next generation. OP tells us to be\npatient with our crypto investing and wait until the boomers give us money.\n\nGet out of here with that trickle-down nonsense. Given everything…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "これは別の投稿に対するもので、OPが30Tの富を団塊の世代から次世代に移すと話しています。\n団塊の世代から得られた30Tの富が、最終的に次世代に移されるという話です。OPは、私たちに\n団塊の世代が私たちにお金をくれるまで、暗号化投資を我慢して待ちなさいということです。\n\nトリクルダウンなんてくだらないことはやめてくれ。すべてを考えると...",
      "title": "ミレニアル世代やジェネレーションZが、団塊世代から何かを受け継ぐと考えているなら、それは冗談です。豊かさを求めるのであれば、自分で作り出すことです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这是对另一个帖子的回应，在这个帖子中，OP谈到了30亿美元的财富来自于婴儿期，最终将转移到下一代。\n蓬勃发展的一代最终将被转移到下一代。OP告诉我们要\n对我们的加密货币投资要有耐心，等潮人给我们钱。\n\n滚出这里，不要再胡说八道了。鉴于一切...",
      "title": "如果你认为 \"千禧一代 \"和 \"Z世代 \"会从 \"潮人 \"那里继承什么，那是在自欺欺人。如果你想要财富，就为自己创造财富。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這是對另一個帖子的迴應，在這個帖子中，OP談到了30億美元的財富來自於嬰兒期，最終將轉移到下一代。\n蓬勃發展的一代最終將被轉移到下一代。OP告訴我們要\n對我們的加密貨幣投資要有耐心，等潮人給我們錢。\n\n滾出這裏，不要再胡說八道了。鑑於一切...",
      "title": "如果你認爲 \"千禧一代 \"和 \"Z世代 \"會從 \"潮人 \"那裏繼承什麼，那是在自欺欺人。如果你想要財富，就爲自己創造財富。"
    }
  ]
}