{
  "author": "Iestwyn",
  "original_created_utc": 1637101108,
  "title": "If the trope of the king spending all day in the throne room conducting business is false, then what did the average day for the court look like? Where did the king and household work?",
  "created_utc": 1637134709,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;ve recently learned that the stereotype of the monarch sitting on the throne all day, listening to pleas and rendering judgement, is false. It&#39;s my understanding that the throne room was only used to &quot;preside in majesty&quot; over formal ceremonies and welcome important guests.</p>\n\n<p>If that&#39;s the case, then what did the king/queen do all day? Where did it happen? Did they have an office with a desk? What did the court do, if not stand sycophantically at the monarch&#39;s elbows on the throne?</p>\n</div><!-- SC_ON -->",
  "score": 103,
  "permalink": "/r/AskHistorians/comments/qvjqi8/if_the_trope_of_the_king_spending_all_day_in_the/",
  "subreddit": "AskHistorians",
  "id": "qvjqi8",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I've recently learned that the stereotype of the monarch sitting on the throne\nall day, listening to pleas and rendering judgement, is false. It's my\nunderstanding that the throne room was only used to \"preside in majesty\" over\nformal ceremonies and welcome important guests.\n\nIf that's the case,…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "最近知ったのですが、「君主は玉座に座っている」という固定観念は\n一日中、王座に座って訴えを聞き、判断を下すという固定観念は誤りであることを最近知りました。私の理解では\n私の理解では、玉座は正式な儀式を「威厳をもって」執り行い、重要なゲストを迎え入れるためだけに使われていました。\n大切なお客様をお迎えするために使われていたと理解しています。\n\nもしそうだとしたら",
      "title": "王が一日中、玉座の間で仕事をしているという図式が嘘だとしたら、宮廷の平均的な一日はどのようなものだったのでしょうか。王と家人はどこで働いていたのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我最近了解到，君主整天坐在宝座上的刻板印象\n整天坐在宝座上，听着恳求并作出判决，这是不正确的。我的理解是\n我的理解是，宝座室只用于 \"威严地主持 \"正式仪式和欢迎重要客人。\n正式仪式和欢迎重要客人。\n\n如果是这样的话，...",
      "title": "如果国王整天在王室里处理事务的说法是错误的，那么宫廷的平均一天是什么样的？国王和家人在哪里工作？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我最近了解到，君主整天坐在寶座上的刻板印象\n整天坐在寶座上，聽着懇求並作出判決，這是不正確的。我的理解是\n我的理解是，寶座室只用於 \"威嚴地主持 \"正式儀式和歡迎重要客人。\n正式儀式和歡迎重要客人。\n\n如果是這樣的話，...",
      "title": "如果國王整天在王室裏處理事務的說法是錯誤的，那麼宮廷的平均一天是什麼樣的？國王和家人在哪裏工作？"
    }
  ]
}