{
  "author": "BallinCupEnthusiast",
  "the_new_excerpt": "I have a feeling I’m not alone in this situation. Last week I finally decided\n“fuck robinhood eat my ass vlad” and started an account transfer to fidelity on\nWednesday. Fidelity has processed it but jabroni Robinhood says it might take\n5-7 days for it to process and clear. Let’s say GME squeezes…",
  "original_created_utc": 1616272855,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我有一种感觉，我不是一个人在这种情况下。上周我终于决定\n\"去他妈的罗宾汉，吃了我的屁股弗拉德\"，并开始帐户转移到Fidelity上。\n周三。Fidelity已经处理好了，但jabroni Robinhood说可能需要。\n5-7天的时间来处理和结算。比如说GME挤压... ...",
      "title": "大杜鹃"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我有一種感覺，我不是一個人在這種情況下。上週我終於決定\n\"去他媽的羅賓漢，吃了我的屁股弗拉德\"，並開始帳戶轉移到Fidelity上。\n週三。Fidelity已經處理好了，但jabroni Robinhood說可能需要。\n5-7天的時間來處理和結算。比如說GME擠壓... ...",
      "title": "大杜鵑"
    }
  ],
  "title": "The Great Cuckening",
  "created_utc": 1616292052,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I have a feeling I’m not alone in this situation. Last week I finally decided “fuck robinhood eat my ass vlad” and started an account transfer to fidelity on Wednesday. Fidelity has processed it but jabroni Robinhood says it might take 5-7 days for it to process and clear. Let’s say GME squeezes this week, theoretically of course, will I be stuck dick in hand unable to do anything? Of course I can always buy more at $500 on fidelity because I like the stock and know $500 is merely the bottom of stratosphere on the rocket ride to the moon but I’m definitely curious if my $147 avg cost shares will be untouchable. \nThanks retards.</p>\n\n<p>1k upvotes on this autistic ass question? Just goes to show how much each individual here hates you vlad, I hope you see this.</p>\n</div><!-- SC_ON -->",
  "score": 5529,
  "permalink": "/r/wallstreetbets/comments/m9fpoq/the_great_cuckening/",
  "subreddit": "wallstreetbets",
  "id": "m9fpoq",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1616752826455
}