{
  "author": "datamonkeyz",
  "the_new_excerpt": "Reports of the semiconductor shortage\n[https://thehill.com/policy/technology/538474-biden-to-sign-executive-order-addressing-chip-supply-chain-shortage]\nin early February had me take deeper look into the industry. Wanted to share my\nthoughts with the sub!\n\nThe market is essentially split into two…",
  "original_created_utc": 1615742166,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "关于半导体短缺的报告\n[https://thehill.com/policy/technology/538474-biden-to-sign-executive-order-addressing-chip-supply-chain-shortage]\n在2月初让我对这个行业有了更深的了解。想分享我的\n与子的想法!\n\n市场基本上分为两...",
      "title": "我对半导体的看法 - 台积电DD"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "關於半導體短缺的報告\n[https://thehill.com/policy/technology/538474-biden-to-sign-executive-order-addressing-chip-supply-chain-shortage]\n在2月初讓我對這個行業有了更深的瞭解。想分享我的\n與子的想法!\n\n市場基本上分爲兩...",
      "title": "我對半導體的看法 - 臺積電DD"
    }
  ],
  "title": "My Take on Semiconductors - TSMC DD",
  "created_utc": 1615750189,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Reports of the <a href=\"https://thehill.com/policy/technology/538474-biden-to-sign-executive-order-addressing-chip-supply-chain-shortage\">semiconductor shortage</a> in early February had me take deeper look into the industry. Wanted to share my thoughts with the sub!</p>\n\n<p>The market is essentially split into two parts. Companies like AMD, NVIDIA, and QCOM design chips. Companies like TSM, UMC, and Samsung produce them. The shortage here is exclusively on the production side. We can&#39;t make chips fast enough and many industries (car makers in particular) are complaining really loudly about the shortage. Some of this is self-inflicted and short-term. Automakers cut back production forecasts because of COVID and rely heavily on just-in-time production supply chains to cut back on costs. This means that they were largely caught with their pants down when demand started to pick back up. </p>\n\n<p>There are strong longer-term trends driving the shortage here too. Cars are getting more complicated and EVs need more/better hardware/chips. Right now, auto-makers are generally looking at 14nm chips (<a href=\"https://onlyusedtesla.com/teslas-media-control-unit-mcu1-vs-mcu2/\">Tesla&#39;s MCU2</a> is based on the Intel AtomE8000). This is an older process node, Intel was <a href=\"https://en.wikipedia.org/wiki/List_of_Intel_Core_i5_processors#Skylake_microarchitecture_(6th_generation\">releasing 14nm chips</a>) in 2015. I think ultimately, car production is going to have to be cut back, prices are going to go up, automakers are going to rush to lock in future supply, and producers (not designers) are going to benefit.</p>\n\n<p>The producer market is really interesting. It takes a LONG time to spin up a new factory (fab). Generally speaking, it&#39;s 3-4 years before a factory goes from planning to production. We can&#39;t really throw money at this problem to fix this in the short-term. The producer market is also very clearly split into two parts: those who can make 10nm chips and below and those who can&#39;t. This <a href=\"https://s3.i-micronews.com/uploads/2021/03/ILLUS_HIGH-PERFORMANCE-PACKAGING_Overview_SemiconIndustry_YOLE_March2021.jpg\">chart</a> breaks it down at a high level. There are only three companies that can make chips that we&#39;ll want in the next 5 years (Intel, Samsung, TSMC), and one of them can&#39;t really do it. Intel has gotten 10nm reasonably figured <a href=\"https://www.tomshardware.com/news/intel-announces-delay-to-7nm-processors-now-one-year-behind-expectations\">out but can&#39;t break 7.</a> They&#39;ve given up the production race and <a href=\"https://www.bloomberg.com/news/articles/2021-01-08/intel-talks-with-tsmc-samsung-to-outsource-some-chip-production\">plan on outsourcing</a> their future designs to TSMC and Samsung. </p>\n\n<p>Between Samsung and TSM, TSM is investing much more aggressively for the future. They&#39;ve already planning on building out a 5nm production line in Arizona for <a href=\"https://www.theburnin.com/industry/tsmc-increasing-spending-arizona-chip-factory-35b-2021-03-09/\">~20K wafers</a> which should increase their global production by 20%. There are <a href=\"https://www.tomshardware.com/news/tsmc-arizona-fab-potential-expansion\">rumors</a> that they are expanding production to 100K wafers which would double their global 5nm capacity. Samsung is still figuring out <a href=\"https://www.anandtech.com/show/16483/samsung-in-the-usa-a-17-billion-usd-fab-by-late-2023\">where they want to build</a>. It also looks like <a href=\"https://www.pcgamer.com/tsmc-3nm-2021-apple-chips/\">TSM</a> is going to beat <a href=\"https://www.theburnin.com/industry/samsung-beginning-3nm-chip-mass-production-2022-2020-11-19/\">Samsung</a> to 3nm by almost a full year. </p>\n\n<p>That said, the stock is not cheap. It&#39;s got a PE ratio of 53. But the steep technological moat, aggressive investment in future production, and long-term demand increases (cars/computers/phones aren&#39;t getting any simpler or less popular) makes me confident they&#39;ll grow into their price. </p>\n\n<p>TLDR: We need more chips. TSM makes the best chips.</p>\n</div><!-- SC_ON -->",
  "score": 261,
  "permalink": "/r/stocks/comments/m4zabk/my_take_on_semiconductors_tsmc_dd/",
  "subreddit": "stocks",
  "id": "m4zabk",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1616147382526
}