{
  "author": "TNGSystems",
  "original_created_utc": 1651249297,
  "title": "Safemoon down 45% in a day (-96.5% from ATH) as Coffeezilla's latest expose on CEO fraud finally hits home.",
  "created_utc": 1651265329,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Weirdly enough, the previous two videos detailing extraordinary allegations, with proof, on the massive scale of fraud that permeates Safemoon didn&amp;#39;t seem to do it, but the truth from the latest video has finally sunk in, with a top whale selling off four Billion tokens (worth nearly $2m).  &lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://bscscan.com/tx/0x5b2f84b56d66f807cf5aa8f05ba8848875dba3a19f7a4c33717bae6182e90874\"&gt;Transaction 1&lt;/a&gt;  &lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://bscscan.com/tx/0xde60375cf511084a1b1f17841f26a06050b30cde0d7b7a9f46a02d4c675e56d3\"&gt;Transaction 2&lt;/a&gt;&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;&lt;a href=\"https://www.youtube.com/watch?v=kIUrE7Ovm5k\"&gt;Coffeezilla&amp;#39;s latest video&lt;/a&gt;  &lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;This one is much quicker, snappier, and devastating.  &lt;/p&gt;\n\n&lt;p&gt;The gist of it is that the Safemoon community has spent the last week and a half fervently denying that the wallets Coffee speculated were CEO John Karony&amp;#39;s was a personal wallet, and therefore the movements in and out of the liquidity pools and receiving large payments from Bitmart etc were all kosher.  &lt;/p&gt;\n\n&lt;p&gt;Someone tipped Coffee off to &lt;em&gt;yet another&lt;/em&gt; pump-and-dump scheme organised by Ben Phillips, where Karony spent $300,000 on shitcoins. Ben Phillips also was part of some Hotdog NFT bullshit, and Karony mentioned he liked one publicly on twitter... that very safe NFT is owned by a wallet that Coffee uncovers.  &lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;The video does a much better job of explaining it than I do, but we&amp;#39;re in the Endgame now fellas.  &lt;/p&gt;\n\n&lt;p&gt;My RES tags on Reddit have been pulling overtime with all the people I&amp;#39;ve tagged as &amp;quot;Safemoon Cultist&amp;quot;  &lt;/p&gt;\n\n&lt;p&gt;What do they have to say? Let&amp;#39;s find out.  &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Whale sold. Watch this dip get eaten.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Awwww. Just because you lost YOUR life savings and are butter hurt, doesn&amp;#39;t mean everyone else is. Don&amp;#39;t be mad... once FOMO hits, you&amp;#39;ll be back.  &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Please stop buying bro karoney is stealing 100 trillion money i saw on ioutube truste me please stop ✋ 😭😭😭😭😭😭😭😭  &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;We have less whales than most crypto tokens. Just check babscan!  &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Well, if you would have paid attention you would know that when the youtuber posted his first video the price went down 25%... this time he posted and the price stayed pretty much the same. That&amp;#39;s all  &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;(That one aged like milk on a hot Texas day)  &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;“Why isn’t my fud working? Why aren’t they selling? Time to make up more shit!”&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;If it is a rug pull, would it be logical to spent 1 mln on a bill board, hire top qualified personnel, launch wallet, work on exchange, blockchain, card, websites, cross chain, etc. Would you start a LLC with liability, would you doxx, etc.  &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;I haven’t watched any of his videos. Don’t need to  &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Stopped reading at copy and paste wallet, that&amp;#39;s a marching order term right there&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;I&amp;#39;m fairly confident that this will be remembered as Safemoon&amp;#39;s low point.  &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;I believe this is all fud to make the price drop on purpose 😉&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;So we have a mixed bag really. Most of the people who haven&amp;#39;t already sold are just sticking their heads in the sand but the mounting volume of proof is starting to resonate with more and more people.  &lt;/p&gt;\n\n&lt;p&gt;There&amp;#39;s still quite a sizeable portion of people that think a turnaround is about to happen... So I guess let&amp;#39;s sit back, crack open the popcorn and keep watching this incredible shit-show.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 302,
  "permalink": "/r/CryptoCurrency/comments/uepl7y/safemoon_down_45_in_a_day_965_from_ath_as/",
  "subreddit": "CryptoCurrency",
  "id": "uepl7y",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Weirdly enough, the previous two videos detailing extraordinary allegations,\nwith proof, on the massive scale of fraud that permeates Safemoon didn't seem to\ndo it, but the truth from the latest video has finally sunk in, with a top whale\nselling off four Billion tokens (worth nearly…"
}