{
  "author": "yeehawcowboyinboots",
  "original_created_utc": 1650959187,
  "title": "How should one ask for help when they want to comitt suicide?",
  "created_utc": 1650978633,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I’ve planned suicide, I’ve messed it up, I’ve decided to live because my dog won’t leave me alone and he deserves my having to fight to stay with him.&lt;/p&gt;\n\n&lt;p&gt;I want to ask my parents for help because no one else is around. We’ve been fighting the last few weeks and I want it to be a one time action. I want to ask them for help. I just don’t know how without it being waved off again.&lt;/p&gt;\n\n&lt;p&gt;My apologies if it doesn’t go here. I just want to have a fighting chance. I still see death as my only escape. But if I don’t fight against it for my good fluffy boy I will never feel at peace. He deserves to have someone that will do everything they have to do to make him happy and I will be damned if I’m the reason he’ll cry.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 109,
  "permalink": "/r/TooAfraidToAsk/comments/uc781x/how_should_one_ask_for_help_when_they_want_to/",
  "subreddit": "TooAfraidToAsk",
  "id": "uc781x",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": true,
  "the_new_excerpt": "I’ve planned suicide, I’ve messed it up, I’ve decided to live because my dog\nwon’t leave me alone and he deserves my having to fight to stay with him.\n\nI want to ask my parents for help because no one else is around. We’ve been\nfighting the last few weeks and I want it to be a one time action. I…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "自殺を計画したことも、失敗したことも、生きることを決意したことも、愛犬のために\n愛犬が一人にしてくれないから、一緒にいるために戦うのは当然だからです。\n\n周りに誰もいないから親に助けを求めたい。私たちはずっと\nここ数週間は喧嘩ばかりで、一回きりの行動にしたいです。I...",
      "title": "自殺したいとき、どのように相談したらいいのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我计划过自杀，我搞砸了，我决定活下去，因为我的狗\n我决定活下去，因为我的狗不愿意离开我，它值得我为它而奋斗。\n\n我想向我的父母求助，因为周围没有其他人。我们已经\n过去几周我们一直在吵架，我希望这只是一次性的行动。I..."
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我計劃過自殺，我搞砸了，我決定活下去，因爲我的狗\n我決定活下去，因爲我的狗不願意離開我，它值得我爲它而奮鬥。\n\n我想向我的父母求助，因爲周圍沒有其他人。我們已經\n過去幾周我們一直在吵架，我希望這只是一次性的行動。I...",
      "title": "自殺したいとき、どのように相談したらいいのでしょうか？"
    }
  ]
}