{
  "author": "azdabber47",
  "the_new_excerpt": "I have been looking to invest in sectors that I believe will have the greatest\nchance of significant growth over the next 10 to 20 years. Here is a list and a\nquick reason for my thinking about each sector:\n\nElectric vehicles/renewable energy- The future of automobiles is electric.\nAlmost all major…",
  "original_created_utc": 1612057749,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我一直在寻找投资于我认为会有最大的收益的行业。\n在未来10到20年内大幅增长的机会。以下是一份清单和\n我对每个行业的思考的快速原因。\n\n电动车/可再生能源--汽车的未来是电动的。\n几乎所有的主要...",
      "title": "未来10-20年最具增长潜力的行业。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我一直在尋找投資於我認爲會有最大的收益的行業。\n在未來10到20年內大幅增長的機會。以下是一份清單和\n我對每個行業的思考的快速原因。\n\n電動車/可再生能源--汽車的未來是電動的。\n幾乎所有的主要...",
      "title": "未來10-20年最具增長潛力的行業。"
    }
  ],
  "title": "Sectors with the most growth potential over the next 10-20 years",
  "created_utc": 1612072656,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I have been looking to invest in sectors that I believe will have the greatest chance of significant growth over the next 10 to 20 years.  Here is a list and a quick reason for my thinking about each sector: </p>\n\n<p>Electric vehicles/renewable energy- The future of automobiles is electric.  Almost all major auto makers are producing some line of electric vehicles, not to mention TESLA and NIO as fully eclectic companies with massive growth last year. </p>\n\n<p>Marijuana- The mj industry is still just beginning compared to where it will be at in 20 years from now.  More and more states will legalize allowing for huge growth especially if it is legalized on a federal level.  When/if it is legalized on a federal level, I  believe both the medical and recreational  aspects of mj will take a bigger role creating more consumers. </p>\n\n<p>Healthcare- According to AARP, 10,000 people turn 65 everyday in the United States.  Life expectancy will likely continue to lengthen creating more revenue on average per person over their life.  This number will only increase in the coming years as well.  Advancing healthcare technology such as stem cell research for example will continue to innovate and create new treatments and cures creating a bigger market and more growth.  </p>\n\n<p>Autonomous technology-  Self driving cars, robots, AI, are all growing industries.  They are the way of the future.  Technology is advancing at an exponential pace creating exponential growth.  Self serving cars for citizens as well as self driving semi trucks are coming very soon.  There are companies already testing self driving semi trucks and they will possibly wipe out the human trucking industry within the next 10 years. </p>\n\n<p>I would love to hear some other ideas you may have!</p>\n</div><!-- SC_ON -->",
  "score": 278,
  "permalink": "/r/investing/comments/l91jxi/sectors_with_the_most_growth_potential_over_the/",
  "subreddit": "investing",
  "id": "l91jxi",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1612518534773
}