{
  "author": "jrjocham",
  "original_created_utc": 1655943573,
  "title": "When an astronaut in space talks to Houston, what is the technology that makes the call?",
  "created_utc": 1655961347,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m sure the technology changed over the years, so I&amp;#39;ll ask this in a two parter with the technology of the Apollo missions and the technology of today. Radio towers only have a certain distance on Earth they can broadcast, and if the space shuttle is currently in orbit on the exact opposite side of the Earth as the antenna, the communications would have cut out. So back when the space program was just starting, what was the technology they used to talk to people in space. Was it a series of broadcasting antennas around the globe? Something that has a strong enough broadcast range to pass through planetary bodies? Some kind of aimed technology like a satellite dish that could track the ship in orbit? What was the communication infrastructure they had to build and how has it changed to today?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 133,
  "permalink": "/r/askscience/comments/vijndx/when_an_astronaut_in_space_talks_to_houston_what/",
  "subreddit": "askscience",
  "id": "vijndx",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I'm sure the technology changed over the years, so I'll ask this in a two parter\nwith the technology of the Apollo missions and the technology of today. Radio\ntowers only have a certain distance on Earth they can broadcast, and if the\nspace shuttle is currently in orbit on the exact opposite side…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "年月が経つにつれて技術も変化していると思うので、2回に分けてお聞きします\nアポロ計画当時の技術と、現在の技術でお聞きします。ラジオ\n電波塔は、地球上で一定の距離しか放送できません。\nスペースシャトルがその反対側の軌道を周回しているとしたら...。",
      "title": "宇宙にいる宇宙飛行士がヒューストンと通話するとき、その通話を行う技術は何でしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我确信这些年来技术发生了变化，所以我将分两部分来问这个问题\n阿波罗任务的技术和今天的技术。电台\n塔台在地球上只有一定的距离可以广播，如果\n如果航天飞机目前在轨道上，正好在对面... ...",
      "title": "当太空中的宇航员与休斯敦通话时，进行通话的技术是什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我確信這些年來技術發生了變化，所以我將分兩部分來問這個問題\n阿波羅任務的技術和今天的技術。電臺\n塔臺在地球上只有一定的距離可以廣播，如果\n如果航天飛機目前在軌道上，正好在對面... ...",
      "title": "當太空中的宇航員與休斯敦通話時，進行通話的技術是什麼？"
    }
  ]
}