{
  "author": "AcclimateToMind",
  "original_created_utc": 1636089251,
  "title": "What causes the sensation of one's \"blood running cold\"?",
  "created_utc": 1636110267,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I got a call from my confused and hysterical girlfriend in the hospital last night, after she gave her head a good crack on the floor, falling down some stairs. The combination of SOMETHING being wrong, but NOT being able to tell me herself because of memory loss/confusion, made me experience the most novel sensation.\nThe nape of my neck, down and around my shoulders, and some of my back and then down deep deep in my tummy, I simultaneously felt something like a bizarre cool icy stingy feeling. The phrase &quot;my blood ran cold&quot; suddenly made sense. </p>\n\n<p>Is this side effect of some sort of hormonal stress response? Is it related to the &quot;freeze&quot; response in prey animals? Is the experience of this sensation universally similar?</p>\n</div><!-- SC_ON -->",
  "score": 116,
  "permalink": "/r/askscience/comments/qn3yq2/what_causes_the_sensation_of_ones_blood_running/",
  "subreddit": "askscience",
  "id": "qn3yq2",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I got a call from my confused and hysterical girlfriend in the hospital last\nnight, after she gave her head a good crack on the floor, falling down some\nstairs. The combination of SOMETHING being wrong, but NOT being able to tell me\nherself because of memory loss/confusion, made me experience the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "昨晩、病院にいる混乱してヒステリックな彼女から電話があった。\n階段から落ちて床に頭を強打し、混乱した彼女から電話があった。\n階段から落ちて床に頭を打ち付けた。何かが間違っていたが、記憶喪失や混乱のために自分では言えなかった。\n何かが間違っていて、しかも記憶喪失や混乱のために私に伝えることができないという組み合わせで、私は経験しました...",
      "title": "血の気が引くような感覚の原因は？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "昨晚，我接到我在医院的困惑和歇斯底里的女友的电话。\n昨晚，她的头在地板上狠狠地撞了一下，摔倒了一些\n楼梯。有什么不对劲的地方，但又不能告诉我，因为她失去了记忆/混乱。\n她自己因为失忆/混乱而无法告诉我，这让我经历了......",
      "title": "是什么导致了一个人 \"血脉喷张 \"的感觉？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "昨晚，我接到我在醫院的困惑和歇斯底里的女友的電話。\n昨晚，她的頭在地板上狠狠地撞了一下，摔倒了一些\n樓梯。有什麼不對勁的地方，但又不能告訴我，因爲她失去了記憶/混亂。\n她自己因爲失憶/混亂而無法告訴我，這讓我經歷了......",
      "title": "是什麼導致了一個人 \"血脈噴張 \"的感覺？"
    }
  ]
}