{
  "author": "Onelinersandblues",
  "original_created_utc": 1647878765,
  "title": "People posting about “adoption” in third world countries have no bloody clue",
  "created_utc": 1647898457,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So for a little inductive context: My salary (way high on the spectrum) is not even 20k. 52% annual inflation. I’m not even in one of the worst ones. People can barely manage to survive in most cases. And people here talk about percentages of adoption? My god they need to get their heads out of their asses. I really wish you make loads of profits in crypto; then please allocate some of that to a trip to latin america and see how things are. We lose perspective behind a screen all day and it couldn’t be more obvious when you read some of the things here. Wishful thinking doesn’t even cut it, it is just pure dissociation from reality. Rant over.&lt;/p&gt;\n\n&lt;p&gt;Update: Just wow. The entitlement of some people. I invite anyone to check the comments. You have two things: 1) actual Latin Americans saying “same bro” &lt;strong&gt;and&lt;/strong&gt; 2) people from the USA/EU telling us we just don’t know about the actual place we live in. Astonishing&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 331,
  "permalink": "/r/CryptoCurrency/comments/tjf92f/people_posting_about_adoption_in_third_world/",
  "subreddit": "CryptoCurrency",
  "id": "tjf92f",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "So for a little inductive context: My salary (way high on the spectrum) is not\neven 20k. 52% annual inflation. I’m not even in one of the worst ones. People\ncan barely manage to survive in most cases. And people here talk about\npercentages of adoption? My god they need to get their heads out of…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "そこで、少し帰納的な文脈で。私の給料は（かなり高い方ですが）、1万円にもなりません。\n2万円でも 年間インフレ率52％。最悪の部類にすら入っていない。人\nは、ほとんどの場合、生きていくのがやっとです。そして、ここで人々が語るのは\n養子縁組の割合？そんなことより、頭を冷やせ...",
      "title": "第三国での「養子縁組」について投稿している人たちは、何もわかっていない。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "因此，对于一个小的归纳背景。我的工资（在光谱上是很高的）还不到\n甚至2万。52%的年通货膨胀率。我甚至不在最差的那一个。人们\n在大多数情况下只能勉强维持生计。这里的人还在谈论\n收养的百分比？我的上帝，他们需要把他们的头从...",
      "title": "在第三世界国家发布 \"收养 \"信息的人没有任何血腥的线索。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "因此，對於一個小的歸納背景。我的工資（在光譜上是很高的）還不到\n甚至2萬。52%的年通貨膨脹率。我甚至不在最差的那一個。人們\n在大多數情況下只能勉強維持生計。這裏的人還在談論\n收養的百分比？我的上帝，他們需要把他們的頭從...",
      "title": "在第三世界國家發佈 \"收養 \"信息的人沒有任何血腥的線索。"
    }
  ]
}