{
  "author": "StepheninVancouver",
  "original_created_utc": 1629779533,
  "title": "The Seven Rules of Bitcoin Investing",
  "created_utc": 1629801788,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I am a long term hodler from 2013. Here is my personal advice for new investors, I hope it will help someone.</p>\n\n<p>1.) Don&#39;t invest more than you can afford to lose. Bitcoin may go to $1M and it may go to $1. I give either one about an equal chance at this point. Bitcoin has been good to me but it is very volatile and high risk so invest according to your risk profile.</p>\n\n<p>2.) Keep your coins safe, ideally in a hardware wallet . If you want to use an exchange Coinbase is at least a public company registered with the SEC.  </p>\n\n<p>3.) Stay away from shitcoins. </p>\n\n<p>4.) Don&#39;t trade bitcoin. No one can make sense of the swings, buy and hold for 5 years and see how much you make.  </p>\n\n<p>5.) Don&#39;t get too caught up in in the swings. Over the years I have seen my coins go up 1000% and then down 80%. Don&#39;t get caught up in the fud or fomo, think long term. </p>\n\n<p>6.) Plan your personal moon. Have an exist strategy to pay off your mortgage, college loans etc. when you hit certain amounts.</p>\n\n<p>7.) Always keep some. You never know how high it will go in the future so always keep some BTC long term.</p>\n\n<p>Good luck friends</p>\n</div><!-- SC_ON -->",
  "score": 195,
  "permalink": "/r/Bitcoin/comments/pagb15/the_seven_rules_of_bitcoin_investing/",
  "subreddit": "Bitcoin",
  "id": "pagb15",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I am a long term hodler from 2013. Here is my personal advice for new investors,\nI hope it will help someone.\n\n1.) Don't invest more than you can afford to lose. Bitcoin may go to $1M and it\nmay go to $1. I give either one about an equal chance at this point. Bitcoin has\nbeen good to me but it is…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "2013年から長らくホドホドにお世話になっています。ここでは、新しい投資家のための私の個人的なアドバイスです。\n誰かの参考になれば幸いです。\n\n1.) 失う可能性がある以上の投資をしないこと。ビットコインは100万ドルになるかもしれないし、1ドルになるかもしれない。\n現時点ではどちらも同じくらいの確率だと思っています。ビットコインは\n私にとっては良いものでしたが、それは...",
      "title": "ビットコイン投資の7つのルール"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我是一个从2013年开始的长期Hodler。以下是我对新投资者的个人建议。\n我希望它能帮助别人。\n\n1.) 不要投资超过你能承受的损失。比特币可能涨到100万美元，也可能涨到1美元。\n在这一点上，我认为两者的机会是相同的。比特币已经\n对我很好，但它是...",
      "title": "比特币投资的七个规则"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我是一個從2013年開始的長期Hodler。以下是我對新投資者的個人建議。\n我希望它能幫助別人。\n\n1.) 不要投資超過你能承受的損失。比特幣可能漲到100萬美元，也可能漲到1美元。\n在這一點上，我認爲兩者的機會是相同的。比特幣已經\n對我很好，但它是...",
      "title": "比特幣投資的七個規則"
    }
  ]
}