{
  "author": "__-_____-_-__---_",
  "original_created_utc": 1638110615,
  "title": "Should we even bother reading pop history books if they are riddled with inaccuracies and hasty conclusions?",
  "created_utc": 1638159759,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>After some time browsing this sub, I&#39;ve often come across the realization that many a pop-history book I had read and enjoyed in the past was actually sloppy and questionable. I&#39;ve had this happen with Guns, germs and steel (apparently common enough that it&#39;s become a meme in and of itself for historians), that book about how Nazis used drugs a lot, Mao the Unknown story, and a couple of other titles that I&#39;ve forgotten over the years.</p>\n\n<p>Should we even bother with pop-history at this point? Is it the equivalent of browsing <a href=\"/r/history\">/r/history</a> i.e. entertaining bro-level half-truths that shouldn&#39;t be taken seriously?</p>\n</div><!-- SC_ON -->",
  "score": 104,
  "permalink": "/r/AskHistorians/comments/r45sfd/should_we_even_bother_reading_pop_history_books/",
  "subreddit": "AskHistorians",
  "id": "r45sfd",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "After some time browsing this sub, I've often come across the realization that\nmany a pop-history book I had read and enjoyed in the past was actually sloppy\nand questionable. I've had this happen with Guns, germs and steel (apparently\ncommon enough that it's become a meme in and of itself for…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "このサブサイトをしばらく見ていると、これまで読んで楽しんでいたポップヒストリーの本が\n過去に読んで面白かったポップ・ヒストリーの本が、実はずさんで疑わしいものが多かったことに気づくことが多い。\n疑問に思うことがあります。銃と病原菌と鋼鉄』でもそうでした。\nそれ自体がミームになっているほどよくあることですが...",
      "title": "不正確な情報や早急な結論に満ちたポップな歴史書をわざわざ読む必要があるのだろうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在浏览了一段时间后，我经常会发现\n许多我过去读过并喜欢的流行历史书实际上是马虎的\n和有问题。我曾在《枪炮、病菌和钢铁》中遇到过这种情况（显然\n足够普遍，以至于它本身就成了一个备忘录......",
      "title": "如果流行的历史书充斥着不准确和草率的结论，我们甚至应该费心去读它们吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在瀏覽了一段時間後，我經常會發現\n許多我過去讀過並喜歡的流行歷史書實際上是馬虎的\n和有問題。我曾在《槍炮、病菌和鋼鐵》中遇到過這種情況（顯然\n足夠普遍，以至於它本身就成了一個備忘錄......",
      "title": "如果流行的歷史書充斥着不準確和草率的結論，我們甚至應該費心去讀它們嗎？"
    }
  ]
}