{
  "author": "FinancialWhoas",
  "the_new_excerpt": "TLDR: I did a bunch of math based on some reasonably good ideas to determine a\nselection of stocks worth investing/reviewing. Lists of stocks found in 2020 and\n2021 Experiment sections.\n\n\nOBSERVATIONS/ASSUMPTIONS\n\n * Index funds have been shown to be the most successful stock investing\n   instrument…",
  "original_created_utc": 1620410066,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "TLDR: 私はいくつかの合理的なアイデアに基づいてたくさんの計算をして、投資/レビューする価値のある銘柄を決定しました。\n投資/検討する価値のある銘柄を選びました。2020年と2021年の実験で見つけた銘柄のリスト\n2021年実験編。\n\n\n考察・仮定\n\n * インデックスファンドは、最も成功した株式投資の手段であることが示されている。\n   インスト...",
      "title": "数学とデューデリジェンスを駆使したインデックスファンドの構築"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "简而言之：我根据一些合理的好主意做了一堆数学计算，以确定一个\n选择值得投资/审查的股票。股票清单在2020年和\n2021年的实验部分。\n\n\n观察/假设\n\n * 指数基金已被证明是最成功的股票投资\n   工具...",
      "title": "使用数学，然后通过一些尽职调查来建立一个指数基金"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "簡而言之：我根據一些合理的好主意做了一堆數學計算，以確定一個\n選擇值得投資/審查的股票。股票清單在2020年和\n2021年的實驗部分。\n\n\n觀察/假設\n\n * 指數基金已被證明是最成功的股票投資\n   工具...",
      "title": "使用數學，然後通過一些盡職調查來建立一個指數基金"
    }
  ],
  "title": "Using math followed by some due diligence to build an index fund",
  "created_utc": 1620446287,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>TLDR:    I did a bunch of math based on some reasonably good ideas to  determine  a  selection of stocks worth investing/reviewing. Lists of  stocks found  in  2020 and 2021 Experiment sections.</p>\n\n<h1>Observations/Assumptions</h1>\n\n<ul>\n<li><a href=\"https://freakonomics.com/podcast/stupidest-money/\">Index funds have been shown to be the most successful stock investing instrument for most people</a></li>\n<li><a href=\"https://www.investopedia.com/top-10-s-and-p-500-stocks-by-index-weight-4843111\">Index    fund returns, such as the S&amp;P 500, are now predominately   determined  by a handful of extremely large, mostly tech stocks.</a></li>\n<li><a href=\"https://finance.yahoo.com/news/dont-pay-investment-adviser-beat-144400899.html\">Most funds do not beat the index over a long period</a>.</li>\n<li>The cost of stock trades at most firms is now $0.00 and some allow for fractional shares.</li>\n<li>During times of volatility, companies that had poor financials will likely find it challenging to survive.</li>\n<li><a href=\"https://finance.yahoo.com/news/zombie-companies-hiding-uncomfortable-truth-183246812.html\">Zombie companies</a> are able to survive for longer periods during times of extremely cheap debt.</li>\n<li>Index funds have these 3 issues that are hard to get around:\n\n<ul>\n<li>You are unable to effectively <a href=\"https://www.investopedia.com/articles/taxes/08/tax-loss-harvesting.asp\">Tax-Loss Harvest</a>even though many of the holdings that make up the index would have  had   losses, thereby reducing the return compared to directly investing  in   that same set of stocks in the same proportions.</li>\n<li>You have no control over the holdings within the fund and may be supporting things you don’t want to support.</li>\n<li>Due    to the way the index works, any large stock that becomes part of the    index is potentially a huge drag on the index. This happened when  Tesla   was going to be added on 12/21/2020, which was announced on  11/16/2020,   forcing funds to buy the stock at the same time driving up  the price,   which had already been driven up by people buying the  stock knowing it   was then going to get added to the index forcing more  people to buy the   stock. If you think it sounds kind of circular,  that’s because it is.</li>\n</ul></li>\n<li>For most people it is impossible to time the market</li>\n<li>Stock prices have all available information at the time priced into them.</li>\n<li>The markets are relatively efficient over the long-term.</li>\n<li>Companies    with strong financials, a competitive advantage, good management, a    sustainable business model, etc. tend to do better than companies    missing one or more of those attributes over the long-term.</li>\n<li>Tech  seems to be heavily weighted in most indexes. I don&#39;t see this as    necessarily a problem. In my mind the digital landscape is infinite    compared to the physical world&#39;s finite space. With more tech being    found in every day devices, the advancement of <a href=\"https://www.ibm.com/topics/industry-4-0\">Industry 4.0</a>, and younger generations more tech heavy than older generations will continue that trend in my opinion.</li>\n</ul>\n\n<h1>Hypothesis</h1>\n\n<p>Using industry bench marking against the <a href=\"https://www.youtube.com/watch?v=_huL5ynaI8Y\">best of the best of the best</a>companies in each industry in equal measure should provide a well    diversified portfolio that over the long term should be able to beat the    S&amp;P 500.</p>\n\n<p>Industry Classification</p>\n\n<ul>\n<li>For Experiment 2020 the Sector was used to determine where companies should be compared.\n\n<ul>\n<li>This is made up of 11 sectors such as Information Technology, Communication Services, Utilities, etc.</li>\n<li>This    seemed to be too restrictive and compared companies against each  other   that aren’t really accurate comparisons. See the example on ROE  below.</li>\n</ul></li>\n<li>So, for Experiment 2021 I used the Microsoft Excel Stock function to pull industries for all the stocks.\n\n<ul>\n<li>This looks like it pulls data mostly from Industry and Sub-industry.</li>\n<li>This was successful on 98% of the stocks and for the final 2% I manually classified based on the taxonomy in the <a href=\"https://en.wikipedia.org/wiki/Global_Industry_Classification_Standard\">Global Industry Classification Standard</a>.</li>\n<li>I    ended up needing to collapse the structure a little further.   Originally  there were 55 classes with many of the classes having less   than 10  parts.  I was able to collapse this to 44 classes. This will   likely be  tweaked a little further next year as I had mathematical   issues dealing  with averages/medians that were negative. There were   also just too many  categories with similar enough results that they   could be combined.</li>\n</ul></li>\n</ul>\n\n<h1>Experiment 2020</h1>\n\n<p>750    stocks were analyzed against their peers in their industry. Stocks   were  given a score based on their relative percentage compared to the    industry index. For example, each companies’ average ROE of the last 4    years was compared to this index value with the following type of    breakdown:</p>\n\n<ul>\n<li>ROE &lt; Index ROE = Poor = 1</li>\n<li>ROE &gt; Index ROE = Good = 2</li>\n<li>ROE &gt; 150% of Index ROE = Great = 3</li>\n</ul>\n\n<p>For    example, the ROE communication services industry index value used was    10.10%. If a communication services company had a ROE average of 9%,    they would receive a poor rating. If they had a ROE of 10.5% they  would   receive a good rating. If they had a ROE of 25% they would  receive a   great rating.</p>\n\n<p>This was done for all of the metrics below:</p>\n\n<ul>\n<li>ROE</li>\n<li>Revenue Growth %</li>\n<li>EBITDA %</li>\n<li>FCF %</li>\n</ul>\n\n<p>The    relative scores used for each of the metrics was tweaked until there    was a good distribution of results. e.g., if the 150% revenue growth    only found 5 companies with a Great rating, that may need to be    decreased to 125% for a better distribution.</p>\n\n<p>Any stock that received a poor in any of the 4 metrics was eliminated.</p>\n\n<p>Example on ROE <a href=\"https://imgur.com/a/kujNkWE\">https://imgur.com/a/kujNkWE</a></p>\n\n<p>That left 53 stocks. EBITDA was then analyzed to see if it was declining, and if so, it too was eliminated.</p>\n\n<p>This    left 45 stocks. These 45 were reviewed more thoroughly. What did the    company do? What were their competitive advantages? Are they currently    in any lawsuits? Does their debt look out of control? Do I see them    being a long-term sustainable choice? Is their IP about to expire?    Essentially boiling down to: Is there any reason that I want to exclude    them?</p>\n\n<p>That left 26 across 7 sectors. <a href=\"https://imgur.com/a/NsBdPtb\">https://imgur.com/a/NsBdPtb</a></p>\n\n<p>These    26 stocks were bought in equal amounts in July 2020, August 2020, and    September 2020. To easily perform time weighted analysis of these   stocks  and determine if there was an opportunity cost, 10% of the total    purchase each period was also allocated to VFIAX.</p>\n\n<p>The    chart below shows the total return of each stock including reinvested    dividends. MATH INDEX, second to the bottom, is the average of  returns.    <a href=\"https://imgur.com/a/al60PZN\">https://imgur.com/a/al60PZN</a></p>\n\n<p>2020 LIST OF STOCKS:</p>\n\n<ul>\n<li>ABMD</li>\n<li>ADBE</li>\n<li>ANET</li>\n<li>BWXT</li>\n<li>CRL</li>\n<li>DG</li>\n<li>ENR</li>\n<li>ETSY</li>\n<li>EXEL</li>\n<li>ISRG</li>\n<li>KLAC</li>\n<li>LKQ</li>\n<li>LRCX</li>\n<li>MNST</li>\n<li>MPWR</li>\n<li>MTCH</li>\n<li>OLED</li>\n<li>PAYC</li>\n<li>PHM</li>\n<li>PRAH</li>\n<li>TER</li>\n<li>TTD</li>\n<li>UI</li>\n<li>VEEV</li>\n<li>VMW</li>\n<li>VRTX</li>\n</ul>\n\n<p>You can see VFIAX returned 28.20% vs the MATH INDEX of 36.56% over the same period, 30% higher returns.</p>\n\n<p>For    those wondering how the exclusions did, they were only tracked  against   the first July purchase, but that comparison to date,  including   dividends for July purchase only, would be:</p>\n\n<ul>\n<li>MATH INDEX return of 39.24%</li>\n<li>Exclusions return of 33.75%</li>\n<li>VFIAX return of 30.05%</li>\n</ul>\n\n<p>Overall after ~10 months we have 2 excellent results.</p>\n\n<ol>\n<li>The full set of initial stocks had a greater return than the S&amp;P 500</li>\n<li>The ones that passed the more extensive due diligence returned an additional 5.5%</li>\n</ol>\n\n<p>This is obviously a short period. Can we do it again this year? Should we go bigger? Yes.</p>\n\n<h1>Experiment 2021</h1>\n\n<p>2,850    tickers of the largest US stocks were identified as the initial list.    The stocks had their last 5 years averaged for each of nine metrics:</p>\n\n<ul>\n<li>Revenue Growth % - shows growth rate of the company</li>\n<li>Profit Margin – shows how effective the business is at making money</li>\n<li>Operating Margin – shows how much money the company earns on its revenue</li>\n<li>FCF Margin – shows how efficient a company is with their cash</li>\n<li>EBITDA Margin – shows a companies’ operating profitability</li>\n<li>ROE – shows how well management balances profits, leverage, and assets to make money</li>\n<li>ROA – shows how effectively a company utilizes its assets to generate profits</li>\n<li>ROIC – shows how effective the company is at using its money to generate returns</li>\n<li>Debt/Equity Ratio – shows the financial stability of a company</li>\n</ul>\n\n<p>More    metrics were used due to the increased data set. These stocks were   then  grouped by industry, and the average of the averages is taken to    determine the industry average for the last 5 years; I switched to    median based on a few outliers really throwing the average for some of    the metrics. If that was confusing, here is an example:</p>\n\n<ul>\n<li>3    stocks that make up an industry averaged -10%, 15%, and 20% ROE over    the last 5 years. The median over the last 5 years for that industry  is   then 15% and all 3 of those stocks will be compared to that  benchmark.</li>\n</ul>\n\n<p>Each   stock  was compared against its Industry benchmark for each of the   metrics  and given a score 1=Poor, 2=Good, 3=Great as well as a composite   score  out of 27. 9 metrics with a max score of 3 in each of the   metrics.  The scores are based on how much better they are then the   average. I  measured them against the benchmark using the same   methodology as  previously performed: Poor &lt; 100%, Good &lt; 150%,   Great &gt; 150%.  Again, these may be tweaked slightly depending on the   particular  metric to find a useful distribution.</p>\n\n<p>I    also ranked every stock against the entire list for each of the   metrics  and overall. For those wondering, the best stock in this   ranking was  CORT with a score of 2,097 and the worst was CYCN with a   score of  23,095. Because the overall rank is a combination of 9   categories with  values ranging from 1-2791, the theoretical best a   company could do  would be 9 and the theoretical worst a company could   do would be 25,119.  Anyone wondering why the number of stocks doesn’t   match the original  input is primarily due to mergers/acquisitions or   the stock being taken  private. Another stock was acquired during the   analysis, changing the  max number yet again.</p>\n\n<p>Here is an example showing Aerospace &amp; Defense scoring: <a href=\"https://imgur.com/a/fKDYNXE\">https://imgur.com/a/fKDYNXE</a></p>\n\n<p>Here is an example showing growth scoring (the Revenue Growth column is the company’s most recent year): <a href=\"https://imgur.com/a/6hy5NuM\">https://imgur.com/a/6hy5NuM</a></p>\n\n<p>Here is an example of the visualizations for the data:<a href=\"https://imgur.com/a/bMH98rM\">https://imgur.com/a/bMH98rM</a></p>\n\n<p>I    applied a series of filters to eliminated unwanted noise. I looked at    the top 5 stocks per industry (extending out for any ties), any stock    that scored a 25, 26, or 27 on the composite, or any stock that had a    high enough overall rank to justify being reviewed.</p>\n\n<p>Next,    I read the description of ~300 stocks and looked through their    financials for any inconsistencies, such as one huge year throwing off    their average, profit margins higher than operating margins, highly    leveraged companies with poor growth, etc. My favorite find was that    Chemed Corporation provides hospice/palliative care and owns    Roto-Rooter. Yes, I did end up keeping them, no there are not great    synergies between the sectors of the business, yes, they are aware of    this. I also eliminated industries I wasn’t interested in reviewing,    such as REITS due to the need to look at different metrics like FFO, Oil    and Gas because it’s oil and gas, etc. These activities eliminated    ~150. I would like to get back to REITs, but I’d need to build a    separate model.</p>\n\n<p>I then looked at    each stock in more detail compared to its peers that made the cut. Are    all the rest of them in the double digits for growth, are the profit    margins substantially less, which one is in a better debt situation,    etc. Who deserves to be on this list? This eliminated ~75.</p>\n\n<p>We    were down to 84 stocks at this point. I then attempted to look at  each   company&#39;s investor presentation, annual report, etc. to better    understand what the company does, their revenue model, risks, etc. I was    not nearly as thorough on this portion this year compared to last  year   just due to the substantial increase in companies, 26 vs 84. I  only   eliminated 1 company which left us at the grand total of 83  companies   across 31 industries. Breakdown here: <a href=\"https://imgur.com/a/8P9dmd9\">https://imgur.com/a/8P9dmd9</a></p>\n\n<p>I then purchased all of these in equal proportion a few days ago:</p>\n\n<ul>\n<li>AAON</li>\n<li>AAPL</li>\n<li>ACN</li>\n<li>ADBE</li>\n<li>AEIS</li>\n<li>ALGN</li>\n<li>AMAT</li>\n<li>ANET</li>\n<li>APH</li>\n<li>ATR</li>\n<li>ATVI</li>\n<li>AX</li>\n<li>BLD</li>\n<li>CDNS</li>\n<li>CGNX</li>\n<li>CHD</li>\n<li>CHE</li>\n<li>CORT</li>\n<li>CPRT</li>\n<li>DLB</li>\n<li>DORM</li>\n<li>EPAM</li>\n<li>ESNT</li>\n<li>ETSY</li>\n<li>EW</li>\n<li>EXPD</li>\n<li>EXPO</li>\n<li>FAST</li>\n<li>FB</li>\n<li>FIX</li>\n<li>FOXF</li>\n<li>FTNT</li>\n<li>GGG</li>\n<li>GOOG</li>\n<li>GRMN</li>\n<li>HEI.A</li>\n<li>IDA</li>\n<li>INS</li>\n<li>INTC</li>\n<li>INTU</li>\n<li>IRBT</li>\n<li>ISRG</li>\n<li>JCOM</li>\n<li>KLAC</li>\n<li>LRCX</li>\n<li>LULU</li>\n<li>MASI</li>\n<li>MED</li>\n<li>MKSI</li>\n<li>MKTX</li>\n<li>MNST</li>\n<li>MORN</li>\n<li>MPWR</li>\n<li>MSFT</li>\n<li>NMIH</li>\n<li>NRC</li>\n<li>NVDA</li>\n<li>ODFL</li>\n<li>OLED</li>\n<li>OLLI</li>\n<li>PAYC</li>\n<li>PAYX</li>\n<li>PRLB</li>\n<li>QLYS</li>\n<li>REGN</li>\n<li>RMR</li>\n<li>ROAD</li>\n<li>SCCO</li>\n<li>SFBS</li>\n<li>SLP</li>\n<li>STMP</li>\n<li>TDY</li>\n<li>TER</li>\n<li>TREX</li>\n<li>TROW</li>\n<li>TTD</li>\n<li>TYL</li>\n<li>UI</li>\n<li>V</li>\n<li>VEEV</li>\n<li>VRTX</li>\n<li>WAL</li>\n<li>YETI</li>\n</ul>\n\n<p>Notes</p>\n\n<ul>\n<li>I    partnered up for both the 2020 and 2021 experiments. This was  critical   for both expanding my initial idea, brainstorming methods to  build the   model, assistance on the code, gathering data, and reviewing  for  errors.  This was a team effort, and I by no means deserve all the   credit.</li>\n<li>All data is shown through close of market 4/30/2021.</li>\n<li>Unless specified, all returns are showing reinvested dividends in the total return.</li>\n<li>Interestingly    5 out of the 19 stocks that were eliminated in the last round of the    2020 experiment made it to this year’s list. 15 out of 26 of last  year’s   final picks also made it. I’ll post an update once I have more  than a   few data points. If you have any questions, I’ll do my best to  answer   them. Hope you enjoyed the journey.</li>\n<li>The indexes ended up heavily weighted in tech/semiconductors. This is the way the math pointed me, so that&#39;s the way I went.</li>\n</ul>\n\n<p>*I    am not a financial advisor or anything else I should put here to   ensure  it is clear that I did this for myself and am sharing my results   and am  in no way forcing you to push buttons to buy things you don’t    understand or requiring justification for this run on sentence and    henceforth. You are welcome to do whatever you like with the    information, though if you’re going to sell it that’s some pretty messed    up ****. Past results are no guarantee of future returns.</p>\n</div><!-- SC_ON -->",
  "score": 80,
  "permalink": "/r/investing/comments/n74k0c/using_math_followed_by_some_due_diligence_to/",
  "subreddit": "investing",
  "id": "n74k0c",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620985994595
}