{
  "author": "the_lost_investor",
  "the_new_excerpt": "Nokia aren't just selling shitty phones and shitty software anymore, they've\nexpanded into the 5G infrastructure market, and according to the research outfit\nMarketsandMarkets, it should grow at a compound annual rate of 67% to $47.8\nbillion by 2027.\n\nThe financial health of the company is a big…",
  "original_created_utc": 1611590808,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "诺基亚不只是卖低劣的手机和低劣的软件了，他们已经。\n拓展到5G基础设施市场，而据研究机构\nMarketsandMarkets，它应该以67%的年复合增长率增长，到2027年达到478亿美元。\n亿美元，到2027年。\n\n该公司的财务健康状况是一个大...",
      "title": "NOK（诺基亚）是下一个预定登月的火箭。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "諾基亞不只是賣低劣的手機和低劣的軟件了，他們已經。\n拓展到5G基礎設施市場，而據研究機構\nMarketsandMarkets，它應該以67%的年複合增長率增長，到2027年達到478億美元。\n億美元，到2027年。\n\n該公司的財務健康狀況是一個大...",
      "title": "NOK（諾基亞）是下一個預定登月的火箭。"
    }
  ],
  "title": "NOK (Nokia) is the next scheduled rocket to the moon.",
  "created_utc": 1611599713,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Nokia aren&#39;t just selling shitty phones and shitty software anymore, they&#39;ve expanded into the 5G infrastructure market, and according to the research outfit MarketsandMarkets, it should grow at a compound annual rate of 67% to $47.8 billion by 2027.</p>\n\n<p>The financial health of the company is a big indicator of its potential, NOK&#39;s short term assets (€17.4B) exceed its <strong>short</strong> term liabilities (€11.4B). Furthermore NOK&#39;s short term assets (€17.4B) also exceed its <strong>long</strong> term liabilities (€12.2B). Their debt to equity ratio (37.9%) is considered satisfactory. Some may be concerned by the fact that NOK&#39;s debt to equity ratio has increased from 30.1% to 37.9% over the past 5 years. However NOK&#39;s debt is well covered by operating cash flow (42.8%) so I&#39;m not stressing and neither should you.</p>\n\n<p>NOKIA&#39;s board of directors are considered experienced (3.7 years average tenure). This gives me hope that they oversea successful management of a relatively new leadership team (1.4 years average tenure).</p>\n\n<p>As always do your own DD but I do believe this is a good stock to get before it blows like every other  hype stock so buy now and settle in for a trip.</p>\n</div><!-- SC_ON -->",
  "score": 538,
  "permalink": "/r/stocks/comments/l4qv83/nok_nokia_is_the_next_scheduled_rocket_to_the_moon/",
  "subreddit": "stocks",
  "id": "l4qv83",
  "is_self": true,
  "media": null,
  "is_video": false
}