{
  "author": "thechadley",
  "original_created_utc": 1630908561,
  "title": "Using Cryptos to Earn Passive Income - My Experience and Results Over the Past 60 Days",
  "created_utc": 1630917036,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hello,</p>\n\n<p>My name is Chadley. For the past year I have gotten very into the defi scene and using bots and a variety of other strategies to make passive income with cryptos. I normally do not have additional fiat to invest into cryptos, so my goal for the past year has been to use my cryptos to accumulate more coins, and more value. I wanted to make money when the market was static, when the prices were going down, and ofcourse beat the market average when the market was trending upwards. I wanted to have more coins each day than I did the previous day. I did not want to simply hodl my coins, I wanted to multiply them. There are a large number of defi tools that allow you to do this as well as many different types of trading bots that can be utilized to varying degrees of effectiveness. I wanted to make a post to cover the a few of the most common strategies that are used to earn passive income with cryptos and outline my experience/opinions/results with each strategy. I have a lot of experience with all of them at this point.  I am a moderator of a crypto farming group, so I consider myself experienced enough to make a post to help others understand how they can possibly utilize the tools available.</p>\n\n<p><strong>The Experiment</strong></p>\n\n<p>Over the past 2 months I have carefully monitored my results with a variety of strategies. I won&#39;t share the exact numbers of my investments and revenues, but I will share the % profits I&#39;ve made over the past 60 days. There is a lot of misinformation spreading over many of these methods, so I wanted to include my written analysis of each in an effort to dispel some common misinformation, and show people what is possible/likely.</p>\n\n<p>The 6 methods I wanted to cover are:</p>\n\n<ol>\n<li>Staking</li>\n<li>Lending</li>\n<li>Yield Farming</li>\n<li>Leveraged Yield Farming</li>\n<li>Grid Trading</li>\n<li>Prestaking/Prefarming</li>\n</ol>\n\n<h1>Results</h1>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/kp75adh2ptl71.png?width=552&amp;format=png&amp;auto=webp&amp;s=baed5b0a1d7e8a0f05a2c5bc1d656b6cdd4a97a5\">Passive Earning Strategy Results and Ratings</a></p>\n\n<p>As you can see from my above table, I rated each strategy based on the effort required, the profit, and how I perceive the risk. The final column is my profit as a % of amount invested over 60 days.</p>\n\n<p>&#x200B;</p>\n\n<ul>\n<li><strong>Effort Rating</strong> - Each strategy varies in exactly how passive it is. Staking often requires little to no effort, perhaps maybe compounding every once in awhile. Prefarming/Prestaking is super simple, but finding and vetting the opportunities requires lots of research and an understanding of what makes a good project. I also consider how often you have to check in on an app that you are utilizing for each particular strategy. Simply put, the effort rating I assigned was how much time and &quot;skill&quot; each of these strategies requires to do well. Anyone can throw money into a farm and get lucky/unlucky, but careful selection and risk management takes some degree of research, understanding, and practice.</li>\n<li><strong>Profit Rating</strong> - Profit was a bit difficult to assign for some methods. I suspect some of my results may be a good bit below the average for a skilled investor. I&#39;m certain a good grid trader could do way better than I did. I made some careless mistakes like not checking my investments often enough. I could&#39;ve compounded my farms more, or adjusted grid trading parameters more frequently. With most of these strategies you could do do far better or worse than me. Also I tried to consider opportunity cost (with grid trading) into my rating. Most importantly, please note -- I DID NOT CONSIDER THE PRICE CHANGES OF THE ASSETS. I ONLY CONSIDERED HOW MANY MORE COINS I HAD AT THE END OF THE 60 DAYS THAN AT THE BEGINNING OF THE 60 DAYS. So I tried to keep my numbers totally independent of any price changes in the underlying assets, but that becomes very difficult to do with yield farming and leveraged yield farming.</li>\n<li><strong>Risk</strong> <strong>Rating -</strong> By risk I don&#39;t necessarily mean how likely you are to lose money. I am also considering things like what is the worst possible outcome (even if I haven&#39;t experienced it) ?And what is the opportunity cost of using that particular strategy compared to simply hodling? Anytime you send your money to a dapp, there is some added risk. For example, some may perceive lending as super low risk, but to get a decent revenue from lending, you must send your money to 3rd party dapps, which inherently has more risk than keeping your coins in your wallet. Or with grid trading, on longer timelines it becomes nearly impossible to lose money, but you may lose exposure and partially miss out on benefits of a bull market run, that you would have had if you were simply hodling.</li>\n<li><strong>My Profit Over 60 Days -</strong> My profits may not be indicative of how these opportunities will play out for you, as I happen to run my experiment over a particularly great 60 days. But these numbers should be ballpark of what you can expect.</li>\n</ul>\n\n<p>&#x200B;</p>\n\n<h1>Important Information to Consider</h1>\n\n<p><strong>How to Assess Profits</strong></p>\n\n<p>When assessing how much I earned with each strategy, please note I did not consider the profits my cryptos increasing in value. If I was lending ETH for example, I did not consider the fact that my ETH went from 2,000 to 3,900 during this experiment. I simply considered how much more ETH I had at the end of the 60 days than at the beginning of the 60 days. I also tried to control for inflation in my profit numbers by doing my best to pick coins with little inflation, but this is impossible to do perfectly as there are soo many variables with little to no data.</p>\n\n<p><strong>Tokenomics</strong></p>\n\n<p>When judging profits, simply looking at how many coins you gained is not a good strategy. It is important to understand the tokenomics of the underlying assets. For example, a coin like ALGO is roughly inflated by 6% every year, as all holders earn 6% staking fees on their ALGO. So the fact that your ALGO holdings multiply by 0.06 each year DOES NOT MEAN YOU ARE MAKING 6% ADDITIONAL PROFIT! It just means that ALGO should perform 6% worse than it would if it weren&#39;t paying the additional 6%, or roughly 6% worse than a coin that has a 1:1 market cap correlation with ALGO but does not pay the staking rewards. To understand this, imagine if 2 coins both had their market caps double. One is a stakable coin, one is a proof of work coin. The stakable coin pays 6% staking rewards, and 100% of coin holders are staking it. You would make the same profit on each coin, despite one paying 6% staking rewards, while the other pays nothing. I would rather earn 5% on a coin that has no inflation, like BTC, than I would earn 50% on a coin that has a 60% inflation rate. If you earn equal to or less than the inflation rate, you&#39;re moving backwards or staying the same.</p>\n\n<p>** Note, I&#39;m not bashing ALGO and I do hold some in my portfolio. I just think the staking mechanism is a bit misleading, and does not provide additional value. Coinbase makes it sound like if you hold ALGO you&#39;re printing money.</p>\n\n<p>It is also important to calculate in any burns that are included in the tokenomics. Consider CAKE for example. CAKE historically has paid out 150% APR staking rewards. That sounds great, until you consider than 99% of Cake holders were staking for that same 150% APR. So at first glance, CAKE staking seems to be worthless, you&#39;re just keeping up with inflation. But when you consider that the Pancakeswap team does massive monthly burns, equal to roughly half of the inflation, you realize that CAKE staking actually was effectively paying out decent yields, all things considered. But this was due moreso to the burns than to the crazy high staking yields. A good rule of thumb for finding good staking coins is to look for coins that pay a decent staking yield AND are difficult to stake, as they will likely have less people staking them, thus they will have lower inflation, and thus the profits should be greater relative to the inflation. If you can earn a staking yield on a deflationary coin backed by a strong project, that is an excellent opportunity.</p>\n\n<h1>My Analysis on Each Earning Strategy</h1>\n\n<p><strong>Staking</strong></p>\n\n<p>I typically do not stake any coins that can be automatically staked on major platforms like Binance and Coinbase. You get more coins, but typically only at the rate of inflation. If you aren&#39;t earning faster than the inflation of that coin, you&#39;re moving backwards or staying the same. Instead I like to stake coins like BNB that require you to transfer them to a Wallet and lock a certain amount in for X days. Most BNB holders were not staking their BNB, thus the inflation was low. Staking is simple enough and you can find plenty of resources on it, so I won&#39;t cover it in detail here. A great POS coin, in my opinion, has to be locked in to earn maximum profits, requires you to hold a certain amount in order to stake it, is backed by a strong project, and has some kind of burn or other deflationary mechanism. If you read the documentation for any POS project, you should be able to compare the staking rate to rate of inflation for that project. There are worthy POS coins on CEX apps, but in general I try to stay away from coins that are autostaked on all centralized exchanges, as the rewards are ubiquitous.</p>\n\n<p>EDIT: To rephrase this, I do hold some coins that are stakable on major platforms, but I hold those because they have interesting projects, not because I intend to earn substantial value from the staking rewards. There are some POS coins on Binance/Coinbase that I believe offer great speculative value, I just think the large inflation from ubiquitously staked coins largely negates the benefits of staking rewards. I&#39;m not intending to bash any projects, just dispel the myth that staking is inherently profitable. If you receive 100% of your staking rewards, you are at the very least keeping up with inflation. I just don&#39;t like centralized exchanges that siphon a portion of the staking rewards while claim that you are printing money by auto staking coins with them. It seems predatory to me.</p>\n\n<p><strong>Lending</strong></p>\n\n<p>There are many ways to lend coins, but in general, but in general I&#39;ve found the best rates on defi. CEX lending is safer, but the rates tend to be lower. Defi lending rates vary wildly, the newer/smaller the platform, typically the higher the lending rates are. On leveraged yield farming platforms i&#39;ve seen lending opportunities paying rates over 100% APR, but these typically do not last long. Overall lending rates tend to range from 4-30% per year on longer timescales. Best rates are normally on stable coins. Anytime you have to send your coins out of your wallet to some defi app, there is some risk though. The fact that you can earn on coins that have no inflation, or are deflationary, makes lending a substantially better option than staking in my opinion.</p>\n\n<p><strong>Yield Farming -</strong> Yield farming is a very interesting way to earn passive income. It can get very complex if you want to understand it comprehensively, however the basics are as follows: you provide 2 coins into a liquidity pool on some AMM dapp, or some 3rd party dapp that aggregates your funds in order to provide liquidity on your behalf. The liquidity allows others to trade between the 2 coins in the liquidity pool. You earn a portion of the trading fees between those 2 coins, and normally other rewards as incentives. You can then periodically reinvest your earnings, to create an exponential gain in profit over time. Yield farming is not without risk. Your exposure changes when you trade your tokens for LP tokens. Your new exposure includes a ratio between the 2 coins prices&#39;, in addition to exposure to the actual price of the coins. It becomes possible for you to lose money when both of the 2 coins you are using to farming increase, if they do not stay in the same proportion to each other. Losing value due to the change in price ratio is called impermanent loss, and is fairly complex to build an intuition around. Overall though, if you pick a pair that has 80%+ price correlation, the IL becomes negligible on longer timescales in comparison to the compounded yields. To summarize this method, you are providing a financial service that is typically provided by banks or (in the case of crypto on centralized exchanges) by CEX themselves. You are acting as a bank would, and earning a rate similar to what bank or CEX would. You take on additional risk, for additional rewards. If you do not carefully pick your pairs, there is a lot of risk here. Do not fall into the trap of going for pairs that pay absurdly high APR/APY. They are almost always a shitty deal. You want 2 coins that have a large correlation in their prices. For most farms on good coins over long timescales, you can expect to earn somewhere between 20%-60% APR. Compounding your earnings over years can work out to astronomical amounts. Sometimes you&#39;ll get lucky and find a great pair paying 80%+ APR, but if it&#39;s truly great, that opportunity won&#39;t last long, the APR will come down as more people provide liquidity for that pair. Never yield farm a coin that hit it&#39;s highest point shortly after launch. Never yield farm coins with lower than 2m 24h volume, or super low market caps. Never yield farm tokens if you do not understand their tokenomics or the service the associated project provides. Be very weary of any farms paying over 150% APR, there is a reason they are paying those absurdly high rates. I&#39;ve watched YT videos and read discussions of people saying that they aim to make 1% per day for months or even years which is simply not realistic.</p>\n\n<p><strong>Leveraged Yield Farming -</strong> There exist a small number of platforms that will allow you to borrow money to yield farm. With leveraged yield farming, you can borrow A LOT. Some platforms will let you borrow as much as 50x your investment, because your collateral stays on their platform, and they will automatically liquidate your position the second that you get too close to going negative in balance. This gets risky, as now you are paying interest. You must consider how much of which coins you are borrowing, you must consider the payout, and the impermanent loss. If things go south, your position can be liquidated, and you will lose your entire investment. But if done properly, you can make a lot of money with this strategy. You have to be very careful and really understand what you&#39;re doing in order to have success with leveraged yield farming. However this method of borrowing to earn is way more profitable and less risky than the leveraged futures that many centralized exchanges offer. This strategy can be great during bear or static markets, but is risky during bull markets. With leveraged yield farming you generally want to avoid pairs in which one coin is stable and one coin is not, as these pairs introduce a guarantee of higher impermanent loss. You can implement high level strategies here, like borrowing one coin of your pair to essentially short that coin while going long on the other -- all while earning nice yields. The key factor with leveraged yield farming is to pick 2 coins that have very high correlations, like MATIC/QUICK, or ETH/BTC.</p>\n\n<p><strong>Grid Trading -</strong> I could write a dissertation on the nuances of grid trading. This is one method that is readily available on some common CEX&#39;s, but I have noticed that few people understand what they are doing and how to optimize it, nor the risks that accompany it. Basically grid trading is a strategy in which you put up a bunch of buy and sell offers. Anytime the price rises x%, you sell. Anytime the price falls x%, you buy. Then the offer is replaced with the opposite. There are bots that automate this entire process. You input a few parameters, such as the desired coin to trade, the number of offers you want to set, a buy-in price, an exit price, and then the bot does the rest for you. What most people don&#39;t realize with this strategy though, is that to truly optimize it, you have to set narrow parameters and check back frequently. Also, during a bull run, you may lose your exposure to the assets you are trading, because the bot sold you out as the price started to climb. This means that situations are possible where you would&#39;ve been better off simply holding your coins. Grid trading is low risk though as there is almost no chance to lose money on longer time scales, unless the assets price continually drops forever. The risk of grid trading comes from opportunity cost, the potential to miss out on an upside. Overall this method is great during bear market phases or during static market phases. Just keep in mind the trading fees, and the opportunity cost that you take on by selling out of the assets if the market takes off. If you check on your bot daily, set narrow parameters, buy and sell every time the price changes 1%, you can achieve better profits than me. You must also utilize an exit point to avoid losing more exposure than you&#39;d like if your selected asset moons.</p>\n\n<p><strong>Prefarming/Prestaking -</strong> The last and most profitable of the strategies I experimented with is prefarming/prestaking. When a new coin/project launches, their first priority is to acquire a lot of liquidity, so people will have confidence that they can freely trade in and out of their coin on AMM dapps. So they need to acquire liquidity before launching. To do this they will provide great incentives for people to provide liquidity prior to their launch. This is definitely the least passive of the methods I have covered, but if you monitor a handful of websites closely, you can find some great opportunities to get in on brand new projects prelaunch. These opportunities are almost always limited though, they will only let you invest a certain amount. I have done 6 prefarms, and all 6/6 have gone well, with the lowest being 50% profit, and the highest being 500% profit in a matter of weeks. Please keep in mind my experience here is positive but limited. I have never invested large sums into a single prefarm before as I simply did not have the balls to do it. There is risk here, there is always potential that the project is scammy or garbage, or the site running the prefarm is exploited in some way. I&#39;ve had some of my prefarms suffer technical difficulties or be the victim of an exploit before I could cash out, but in the end I&#39;ve always walked away with more than I invested. It&#39;s definitely possible to lose 100% of your investment in a worst case scenario though. And i&#39;m sure there are examples of that. I&#39;m sure there are failed prefarming projects that I am not aware of. I chose each of the prefarms I participated in very carefully. You MUST do your due diligence here. Make sure every coin you prefarm has a website, discord, twitter, and they provide a service that is unique in some way. Generally, I wouldn&#39;t hold onto these coins long unless you really believe in their project. I like to get in during the prefarm, and then get out as soon as the assets price sees ANY downward momentum. Also, it&#39;s worth noting you will have typically have to take on exposure to their new coin, or some other undesirable asset for a period of time, but good platforms will make it worth your while by rewarding you for taking on risk to help them get started. Because this method is a type of farm, and could be potentially be automated with a complex bot, I opted to include it in my experiment, even though it is not passive in the way that the other methods are. It&#39;s a great tool to utilize if your goal is to use your coins to earn optimally and you are willing to put a good bit of time into research.</p>\n\n<p><strong>Conclusion</strong></p>\n\n<p>In conclusion, there are a number of ways to earn with your coins. You can accumulate value without putting any more fiat into your portfolio. You can do it with the coins you already hold. Many of these strategies aren&#39;t available on every exchange, so you&#39;ll have to explore a bit, but they&#39;re out there if you&#39;re willing to take on a bit more risk. If you want to earn optimally you will probably have to familiarize yourself with defi and the dapp tools, but that should be an interesting and useful exercise for most investors anyway. My results should shine a light on the options and capabilities available to every crypto investor, and the power and excitement that is the modern defi scene. You can use your cryptos to earn in ways that historically were only available to large corporations or those with massive amounts of wealth. You can act as a bank, and earn like a bank. You can provide liquidity. You can facilitate payments. You can earn from market volatility. You can fund a crypto startup project. I hope some people find this information useful, or at the very least interesting. Thank you for reading!</p>\n\n<p>Edit: Upon rereading, I realized this initially came off like I was kind of bashing centralized exchanges.  I know most investors use CEX&#39;s because they are safer and more user friendly. I&#39;ve used them primarily for the majority of my time in crypto. I just feel like they misrepresent the benefits of staking/lending coins on their apps. But CEX have a very important role in crypto, and I use them on a daily basis. If you have an appetite for risk, and are willing to move some coins into a capable wallet, you can earn more with the tools available to you in defi. For grid trading though, the best bot I have found is in fact on a CEX.</p>\n\n<p>If you are getting into defi and have not explored it before, I&#39;d advise visiting websites like <strong>AAVE, BALancer, COMPound, SUSHIswap, panCAKEswap</strong>...  Google those projects, each of those major coins has an entire website associated with it that offers various tools to help you earn passively. If you are interested in using your coins to earn and haven&#39;t at least visited those project&#39;s websites, i&#39;d advise you to check them out ASAP! Dappradar is also great website to monitor all defi apps and the trends surrounding them. Dappradar has helped me find almost all of my greatest investment opportunities.</p>\n</div><!-- SC_ON -->",
  "score": 207,
  "permalink": "/r/CryptoCurrency/comments/pitnji/using_cryptos_to_earn_passive_income_my/",
  "subreddit": "CryptoCurrency",
  "id": "pitnji",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Hello,\n\nMy name is Chadley. For the past year I have gotten very into the defi scene and\nusing bots and a variety of other strategies to make passive income with\ncryptos. I normally do not have additional fiat to invest into cryptos, so my\ngoal for the past year has been to use my cryptos to…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "こんにちは。\n\n私の名前はChadleyです。この1年、私はデフィーの世界にどっぷりと浸かってきました。\nボットやその他の様々な戦略を使って、クリプトで受動的な収入を得ています。\nクリプトで受動的な収入を得ています。私は通常、暗号に投資するための追加のフィアットを持っていません。\n去年の目標は、自分の暗号を使って...",
      "title": "クリプトを使ってパッシブインカムを得る - 過去60日間の私の経験と成果"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "你好。\n\n我的名字叫查德利。在过去的一年里，我非常投入到defi场景中，并且\n使用机器人和其他各种策略来赚取被动收入。\n加密货币。我通常没有额外的法币来投资加密货币，所以我的\n过去一年的目标是用我的加密货币来...",
      "title": "使用加密货币赚取被动收入--我在过去60天的经验和成果"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "你好。\n\n我的名字叫查德利。在過去的一年裏，我非常投入到defi場景中，並且\n使用機器人和其他各種策略來賺取被動收入。\n加密貨幣。我通常沒有額外的法幣來投資加密貨幣，所以我的\n過去一年的目標是用我的加密貨幣來...",
      "title": "使用加密貨幣賺取被動收入--我在過去60天的經驗和成果"
    }
  ]
}