{
  "author": "thebitcoin10",
  "original_created_utc": 1630688843,
  "title": "Bloomberg has published the September edition of its Crypto Outlook report and says Bitcoin is set to reach $100,000 soon and become the world's reserve asset as its unique properties become more evident.",
  "created_utc": 1630705236,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Bloomberg has published the September edition of its Crypto Outlook report, sharing how the company&#39;s analysts are navigating the market and measuring adoption rates as well as demand and supply dynamics. According to the report, Bitcoin is set to reach the $100,000 mark soon, a &quot;path of least resistance,&quot; as well as establish itself as the global reserve asset.</p>\n\n<p><a href=\"https://assets.bbhub.io/promo/sites/12/1338231_Crypto-September2021Outlook.pdf\">https://assets.bbhub.io/promo/sites/12/1338231_Crypto-September2021Outlook.pdf</a></p>\n</div><!-- SC_ON -->",
  "score": 191,
  "permalink": "/r/Bitcoin/comments/ph9dto/bloomberg_has_published_the_september_edition_of/",
  "subreddit": "Bitcoin",
  "id": "ph9dto",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Bloomberg has published the September edition of its Crypto Outlook report,\nsharing how the company's analysts are navigating the market and measuring\nadoption rates as well as demand and supply dynamics. According to the report,\nBitcoin is set to reach the $100,000 mark soon, a \"path of least…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ブルームバーグは、Crypto Outlookレポートの9月版を発表しました。\nこのレポートでは、同社のアナリストが市場をどのようにナビゲートしているか、また採用率をどのように測定しているかを紹介しています。\nこのレポートでは、同社のアナリストがどのように市場をナビゲートし、採用率や需要と供給のダイナミクスを測定しているかを紹介しています。同レポートによると\nビットコインは間もなく10万ドルの大台に乗りそうだ。\"Path of least...",
      "title": "ブルームバーグは、Crypto Outlookレポートの9月版を発表し、ビットコインは、そのユニークな特性が明らかになるにつれ、まもなく10万ドルに達し、世界の基軸資産となるだろうと述べています。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "彭博社发布了9月版的《加密货币前景报告》。\n分享了该公司的分析师如何引导市场和衡量\n采用率以及需求和供应的动态。根据该报告。\n比特币将很快达到10万美元大关，这是一条 \"最小的路径\"。",
      "title": "彭博社发布了9月版的《加密货币展望》报告，称随着比特币的独特属性越来越明显，它将很快达到10万美元，并成为世界上的储备资产。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "彭博社發佈了9月版的《加密貨幣前景報告》。\n分享了該公司的分析師如何引導市場和衡量\n採用率以及需求和供應的動態。根據該報告。\n比特幣將很快達到10萬美元大關，這是一條 \"最小的路徑\"。",
      "title": "彭博社發佈了9月版的《加密貨幣展望》報告，稱隨着比特幣的獨特屬性越來越明顯，它將很快達到10萬美元，併成爲世界上的儲備資產。"
    }
  ]
}