{
  "author": "harlesraye",
  "original_created_utc": 1635289681,
  "title": "Should I send a letter explaining to an ex why I was forced to dump him?",
  "created_utc": 1635317305,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So when I was 14 I was dating a boy and we were super in love. Dated for a year. Unfortunately my grandma was racist and very abusive(she had custody of me) and he was black. She caught us kissing and basically told me that if I didn&#39;t break up with him then I would be sent to a mental institution, and she would call his parents (who were strict) and tell them that he raped me and that she would press charges on him for rape. She said he gave me diseases and that I had to break it off and she didn&#39;t care how. So I tried to push it off as long as possible but it ended being virtually impossible to talk to him or his sister (who was a good friend) without my grandma hovering and demanding to know if I was talking to any black boys. I had a rough childhood....parents on drugs and absent, sexual assault, abusive grandmother. So when it came to breaking up, I guess I didn&#39;t have the right words to convey how damaged I was and what was happening so I made up a lie and said that I was moving away and we had to break up. Naturally, he was devastated,  even more so when weeks went by and I was still there. He tried to get back with me and I was terrified so I said no. I basically shot down everything he tried. This severely messed my head up and actually caused me to spiral into a deep depression. I just would up actually moving to get away from how ashamed I was. I never told the guy the truth. Well, he never deleted me off of Facebook and a couple months ago he was selling an Xbox on facebook and I needed one so I offered to buy it. He came to my place but didn&#39;t come inside. We just stood outside and kept hugging and talking. He told me several times that I looked really good. He also said that he was in a relationship with someone he wasn&#39;t too sure about but that they were gonna try living together. I am single, but I have an 8 year old daughter(full custody). But my feelings for him never went away. I never wanted us to break up and I have thought about him constantly over the years. I think that he and his girlfriend recently broke up (neither of their social media&#39;s have each other on them and hers used to have him) and I was considering writing a letter explaining what happened when we were teenagers, but I am conflicted. We are both now 28 years old. I just don&#39;t know if I sound like a crazy person for wanting him to know that I didn&#39;t mean for any of that to happen and I would love a second chance. Should I write the letter or let it go?</p>\n</div><!-- SC_ON -->",
  "score": 106,
  "permalink": "/r/TooAfraidToAsk/comments/qgird9/should_i_send_a_letter_explaining_to_an_ex_why_i/",
  "subreddit": "TooAfraidToAsk",
  "id": "qgird9",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "So when I was 14 I was dating a boy and we were super in love. Dated for a year.\nUnfortunately my grandma was racist and very abusive(she had custody of me) and\nhe was black. She caught us kissing and basically told me that if I didn't break\nup with him then I would be sent to a mental institution,…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私が14歳の時、ある男の子と付き合っていたのですが、私たちはとても恋をしていました。1年間付き合いました。\n残念なことに、私の祖母は人種差別主義者で、私をとても虐待していました（彼女は私の親権を持っていました）。\n彼は黒人だったの。おばあちゃんは私たちがキスしているところを見つけて、もし彼と別れなければ\n彼と別れなければ精神病院に送られると言われました...。",
      "title": "元彼に、無理やり振られた理由を説明する手紙を送るべきでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "所以当我14岁的时候，我在和一个男孩约会，我们超级相爱。我们交往了一年。\n不幸的是，我的祖母是种族主义者，而且非常虐待我（她有我的监护权），他是黑人。\n他是黑人。她发现我们在接吻，基本上告诉我，如果我不和他分手\n就会被送进精神病院，......",
      "title": "我是否应该寄信向前任解释我为什么被迫甩掉他？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "所以當我14歲的時候，我在和一個男孩約會，我們超級相愛。我們交往了一年。\n不幸的是，我的祖母是種族主義者，而且非常虐待我（她有我的監護權），他是黑人。\n他是黑人。她發現我們在接吻，基本上告訴我，如果我不和他分手\n就會被送進精神病院，......",
      "title": "我是否應該寄信向前任解釋我爲什麼被迫甩掉他？"
    }
  ]
}