{
  "author": "FredCoupon",
  "the_new_excerpt": "I’ve seen a lot of people push MMEDF this past week and I have good feeling that\nonly a few looked deeper than the 1 month chart. To be blunt, MMMEDF is not a\ngoing concern.\n\nGoing concern is a term used for companies that have operations that appear to\nbe sustainable and there are no foreseeable…",
  "original_created_utc": 1608040074,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "在过去的一周里，我看到很多人在推动MMEDF，我有很好的预感\n只有几个人看起来比1个月图更深入。坦率地说，MMMEDF不是\n持续经营的公司。\n\n持续经营是一个术语，用来指那些运营看起来像是\n是可持续的，并且没有可预见的…",
      "title": "注意有关MMEDF的泵和转储"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在過去的一週裏，我看到很多人在推動MMEDF，我有很好的預感\n只有幾個人看起來比1個月圖更深入。坦率地說，MMMEDF不是\n持續經營的公司。\n\n持續經營是一個術語，用來指那些運營看起來像是\n是可持續的，並且沒有可預見的…",
      "title": "注意有關MMEDF的泵和轉儲"
    }
  ],
  "title": "Beware of Pump and Dumps regarding MMEDF",
  "created_utc": 1608047217,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I’ve seen a lot of people push MMEDF this past week and I have good feeling that only a few looked deeper than the 1 month chart. To be blunt, MMMEDF is not a going concern.   </p>\n\n<p>Going concern is a term used for companies that have operations that appear to be sustainable and there are no foreseeable issues that infer that the company will not be around &gt;1 year out.</p>\n\n<p>Provided that MMEDF has no stage three treatments nor FDA approved treatments they are pretty far from bringing anything to market. According to their financials the way they finance this continuous loss is through dilution. As a shareholder, you should hate this.</p>\n\n<p>Stage 3 is notoriously difficult to pass through and is where many projects fail. MMEDF has only several treatments in the pipeline. There is significant risk due to the similarities in treatments that a denial by the FDA could send share prices into a free fall. The opposite is also true with an approval. However, they are years away from that being possible. As a result, expect your shares to continually get diluted.</p>\n\n<p>Lastly, the valuation is out of control. This company is smaller than most mom and pops, yet has amassed a $1.419 billion market cap. Now from my own experience companies without a stage 3 trade &lt;100 million.</p>\n\n<p>Ultimately, this is not a company I will be investing in.  I’ve seen a lot of people say this will be going to $10. That would give it a market cap of over 2.5 billion. For reference, that would bring it closer to Cerence (CRNC) that does $100 million in revenue.</p>\n\n<p>Remember to make the most informed decision by considering all the available information. The only positive I have seen is that they <em>may</em> break into the NASDAQ.</p>\n</div><!-- SC_ON -->",
  "score": 338,
  "permalink": "/r/stocks/comments/kdm0m0/beware_of_pump_and_dumps_regarding_mmedf/",
  "subreddit": "stocks",
  "id": "kdm0m0",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1609260495583
}