{
  "author": "Boring_Dependent",
  "original_created_utc": 1631901571,
  "title": "Why do so many people think Biden is incapable and a \"moron\" because of the way he speaks, but these same people supported Trump who always spoke incoherently, and said the absolute dumbest things?",
  "created_utc": 1631915215,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>EDIT: I should preface this by adding that I&#39;m not a &quot;Biden supporter&quot;; I didn&#39;t vote. However, I did feel like he would be a much better president simply because he&#39;s been in politics his whole life. He just seems more qualified for the role than Trump.</p>\n\n<p>When I watched Biden speak, he just seems like an old man who isn&#39;t a good public speaker, paired with all of the speech issues he&#39;s had his whole life. His mental state seems normal for his age, not worse than it should be. He just seems to talk slow, pausing while he thinks of how to word things.</p>\n\n<p>Just because he&#39;s not a good orator, doesn&#39;t make him unfit for his position.</p>\n\n<p>Meanwhile, Trump starts speaking about one thing, then changes it to 5 other things in the same sentence as if he&#39;s forgetting what his point was for each. The only difference is he&#39;s quick with it, not pausing. One prime example was this:</p>\n\n<p>“Look, having nuclear — my uncle was a great professor and scientist and engineer, Dr. John Trump at MIT; good genes, very good genes, OK, very smart, the Wharton School of Finance, very good, very smart — you know, if you’re a conservative Republican, if I were a liberal, if, like, OK, if I ran as a liberal Democrat, they would say I’m one of the smartest people anywhere in the world — it’s true! — but when you’re a conservative Republican they try — oh, do they do a number — that’s why I always start off: Went to Wharton, was a good student, went there, went there, did this, built a fortune — you know I have to give my like credentials all the time, because we’re a little disadvantaged — but you look at the nuclear deal, the thing that really bothers me — it would have been so easy, and it’s not as important as these lives are — nuclear is so powerful; my uncle explained that to me many, many years ago, the power and that was 35 years ago; he would explain the power of what’s going to happen and he was right, who would have thought? — but when you look at what’s going on with the four prisoners — now it used to be three, now it’s four — but when it was three and even now, I would have said it’s all in the messenger; fellas, and it is fellas because, you know, they don’t, they haven’t figured that the women are smarter right now than the men, so, you know, it’s gonna take them about another 150 years — but the Persians are great negotiators, the Iranians are great negotiators, so, and they, they just killed, they just killed us, this is horrible.”</p>\n\n<p>Or he says dumb things like, &quot;The closest thing is in 1917, they say, the great pandemic. It certainly was a terrible thing where they lost anywhere from 50 to 100 million people. Probably ended the Second World War. All the soldiers were sick.&quot; (The year is wrong about the Spanish flu, and it didn&#39;t end a war that didn&#39;t start until over 20 years later.)</p>\n\n<p>This isn&#39;t even getting into the blatant lies and misinformation he spreads due to wanting to appear intelligent. Trump always said what people WANTED to hear.</p>\n</div><!-- SC_ON -->",
  "score": 117,
  "permalink": "/r/TooAfraidToAsk/comments/pq58ur/why_do_so_many_people_think_biden_is_incapable/",
  "subreddit": "TooAfraidToAsk",
  "id": "pq58ur",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "EDIT: I should preface this by adding that I'm not a \"Biden supporter\"; I didn't\nvote. However, I did feel like he would be a much better president simply\nbecause he's been in politics his whole life. He just seems more qualified for\nthe role than Trump.\n\nWhen I watched Biden speak, he just seems…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "EDIT: 前置きが長くなりましたが、私は「Biden支持者」ではありません。\n投票しませんでした。しかし、私は彼がより良い大統領になると感じました。\n彼は人生のすべてを政治に捧げてきたからです。トランプ氏よりも適任だと思います。\nトランプ氏よりも適任だと思います。\n\nバイデンのスピーチを見たとき、彼はただ...。",
      "title": "バイデンは話し方が無能で「バカ」だと思う人が多いのに、同じ人が、いつも支離滅裂な話し方をして、絶対にバカなことを言うトランプを支持したのはなぜ？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "编辑：我应该在前面补充一点，我不是 \"拜登的支持者\"；我没有\n投票。然而，我确实觉得他将是一个更好的总统，只是\n因为他一生都在从政。他似乎更有资格担任\n他似乎比特朗普更适合这个角色。\n\n当我看拜登讲话时，他只是看起来...",
      "title": "为什么这么多人认为拜登没有能力，是个 \"白痴\"，因为他说话的方式，而这些人却支持总是语无伦次、说着绝对愚蠢的话的特朗普？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "編輯：我應該在前面補充一點，我不是 \"拜登的支持者\"；我沒有\n投票。然而，我確實覺得他將是一個更好的總統，只是\n因爲他一生都在從政。他似乎更有資格擔任\n他似乎比特朗普更適合這個角色。\n\n當我看拜登講話時，他只是看起來...",
      "title": "爲什麼這麼多人認爲拜登沒有能力，是個 \"白癡\"，因爲他說話的方式，而這些人卻支持總是語無倫次、說着絕對愚蠢的話的特朗普？"
    }
  ]
}