{
  "author": "VaderHater21",
  "the_new_excerpt": "Look, the PayPal news is really good. PayPal is huge and has the opportunity to\nbring crypto to people who would have never considered it. PayPal can be used on\nmost sites as a purchasing option. This brings us more adoption. It doesn't come\nwithout it's flaws though.\n\nHere's one problem, custodial…",
  "original_created_utc": 1617177069,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "你看，PayPal的消息真的很好。PayPal是巨大的，有机会\n将加密技术带给那些从未考虑过的人。PayPal可以在\n大多数网站作为购买选项。这给我们带来了更多的采用。它并不是\n虽然没有它的缺陷。\n\n这里有一个问题，保管...",
      "title": "在PayPal上拥有加密货币并不比在Robinhood上更好。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "你看，PayPal的消息真的很好。PayPal是巨大的，有機會\n將加密技術帶給那些從未考慮過的人。PayPal可以在\n大多數網站作爲購買選項。這給我們帶來了更多的採用。它並不是\n雖然沒有它的缺陷。\n\n這裏有一個問題，保管...",
      "title": "在PayPal上擁有加密貨幣並不比在Robinhood上更好。"
    }
  ],
  "title": "Owning Crypto on PayPal is No Better than on Robinhood",
  "created_utc": 1617215430,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Look, the PayPal news is really good. PayPal is huge and has the opportunity to bring crypto to people who would have never considered it. PayPal can be used on most sites as a purchasing option. This brings us more adoption. It doesn&#39;t come without it&#39;s flaws though.</p>\n\n<p>Here&#39;s one problem, custodial ownership. Custodial ownership is awful. It gives you no control. You must have direct ownership of your coins if you want to safeguard your assets. The old adage, not your keys, not your coins comes into play. If the big bad government decides they don&#39;t like you, such as India or Nigeria, you&#39;re screwed if you don&#39;t have full control.</p>\n\n<p>The companies that offer custodial ownership have a very low barrier to entry. This is what makes them appealing. You don&#39;t need to be verified. I have someone at work who has purchased BTC out of ease compared to when he tried to deal with the exchanges. I get it, you want to be able to have a chunk of the pie without jumping through all the hoops. Although having a halt on PayPal would be extremely unlikely, I don&#39;t want anything to ever happen like what Robinhood did to GME and other stocks.</p>\n\n<p>Another problem, especially in the US, is taxes. I will never be spending my crypto on small day-to-day items until the tax laws change in this country. If I have to pay capital gains and then sales tax, the item I might be purchasing could be worth less than the taxes. It&#39;s rare, but possible. Unfortunately, I don&#39;t see this changing anytime soon. </p>\n\n<p>PayPal news is huge and really good. Baby steps will put us in the right direction. Big institutions and major retail players will continue us in the right direction. We can&#39;t expect full adoption overnight. We need to curb our expectations a little bit. It has taken over 10 years to get this point. In 10 years time I expect adoption to be much further along. That being said, crypto veterans or anyone with a substantial amount of money invested, should consider a wallet and getting control over your coins. Not your keys, not your coins. Avoid custodial ownership!</p>\n</div><!-- SC_ON -->",
  "score": 206,
  "permalink": "/r/CryptoCurrency/comments/mh0zgb/owning_crypto_on_paypal_is_no_better_than_on/",
  "subreddit": "CryptoCurrency",
  "id": "mh0zgb",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1617357138673
}