{
  "author": "ButtFlapMan",
  "the_new_excerpt": "Seriously, I need to vent a bit.\n\nI considered some companies out there to be overvalued last year, but they've\ndoubled, tripled, or even grew ten-fold in value in the past year. Why are they\ntrading at 100x their top line?! Some companies are burning money like never\nbefore, have a smaller revenue…",
  "original_created_utc": 1612900782,
  "localize": [
    {
      "locale": "zh",
      "title": "我相信我们是在泡沫中[我需要发泄...]。",
      "the_new_excerpt": "说真的，我需要发泄一下。\n\n我认为去年有些公司的价值被高估了，但它们在过去一年中已经\n在过去一年里，它们的价值翻了一番、三番，甚至增长了十倍。为什么他们\n它们的交易价格是其顶线的100倍？一些公司正在以前所未有的方式烧钱\n前，有一个较小的收入..."
    },
    {
      "locale": "zh-Hant",
      "title": "我相信我們是在泡沫中[我需要發泄...]。",
      "the_new_excerpt": "說真的，我需要發泄一下。\n\n我認爲去年有些公司的價值被高估了，但它們在過去一年中已經\n在過去一年裏，它們的價值翻了一番、三番，甚至增長了十倍。爲什麼他們\n它們的交易價格是其頂線的100倍？一些公司正在以前所未有的方式燒錢\n前，有一個較小的收入..."
    }
  ],
  "title": "I believe we are in a bubble [I need to vent...]",
  "created_utc": 1612931361,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Seriously, I need to vent a bit.</p>\n\n<p>I considered some companies out there to be overvalued last year, but they&#39;ve doubled, tripled, or even grew ten-fold in value in the past year. Why are they trading at 100x their top line?! Some companies are burning money like never before, have a smaller revenue than before, and are firing people left and right, but they still grew 700%. wtf. Take SPWR as an example, or LMND. I walk past the LMND offices every day, I met Shai Wininger in person. I&#39;m not going to rant about that specific company, but the market is disconnected from reality. LMND has 80M in revenue, burns money, doesn&#39;t grow, but tripled in value in 6 months. Why??</p>\n\n<p>Half of the stock charts that I&#39;m looking at seem normal and then in 2020 they shoot up like never before. You can let a 5 year old pick any 5 stocks and it would have netted you a 30% return on average, easy!</p>\n\n<p>What&#39;s happening? This is unprecedented.</p>\n\n<p>I need someone to prove me wrong, or at least provide me with some rationale as to what is happening.</p>\n\n<p>With all of that said, I&#39;m still investing big on margin, but I&#39;m strongly considering changing my portfolio to things that I believe are more solid, and jump out of the 10x bandwagons. I made insane gains last year, but this party can&#39;t go on forever and it needs to come down to earth.</p>\n</div><!-- SC_ON -->",
  "score": 239,
  "permalink": "/r/investing/comments/lgbz3u/i_believe_we_are_in_a_bubble_i_need_to_vent/",
  "subreddit": "investing",
  "id": "lgbz3u",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613123199881
}