{
  "author": "deez_nuts100",
  "original_created_utc": 1647132666,
  "title": "Am I being unrealistic for holding a standard to losing my virginity?",
  "created_utc": 1647137726,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I want to lose my virginity to someone who is very attractive and that I have a good connection with, not just some average looking person who has sex with anyone and that I’ll be embarrassed to tell others about. Is that stupid? How do you feel about the person you lost your virginity too? What do you say when people ask?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 112,
  "permalink": "/r/TooAfraidToAsk/comments/tcv8et/am_i_being_unrealistic_for_holding_a_standard_to/",
  "subreddit": "TooAfraidToAsk",
  "id": "tcv8et",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": true,
  "the_new_excerpt": "I want to lose my virginity to someone who is very attractive and that I have a\ngood connection with, not just some average looking person who has sex with\nanyone and that I’ll be embarrassed to tell others about. Is that stupid? How do\nyou feel about the person you lost your virginity too? What do…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は、とても魅力的で、自分が納得できる人に処女を捧げたいのです。\n普通の人とセックスしているような人ではなく、良い関係を築くことができる。\n誰にでも言えるし、人に言うのも恥ずかしい。そんなの馬鹿げてる？どうですか？\n童貞を失った相手についてどう思いますか？どうすれば...",
      "title": "処女を失うことに基準を置いている私は非現実的なのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我想把我的处女之身交给一个非常有吸引力的人，而且我和他有良好的联系。\n的人，而不是一些长相普通的人，他们和任何人都有性关系。\n我想失去我的童贞给一个非常有吸引力的人，而且我和他有很好的联系，而不是一个和任何人都有性关系的长相一般的人，这样我就会不好意思告诉别人。这很愚蠢吗？你如何看待\n你对你失去童贞的人有什么感觉？你怎么...",
      "title": "我对失去童贞持一个标准，是不是不现实？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我想把我的處女之身交給一個非常有吸引力的人，而且我和他有良好的聯繫。\n的人，而不是一些長相普通的人，他們和任何人都有性關係。\n我想失去我的童貞給一個非常有吸引力的人，而且我和他有很好的聯繫，而不是一個和任何人都有性關係的長相一般的人，這樣我就會不好意思告訴別人。這很愚蠢嗎？你如何看待\n你對你失去童貞的人有什麼感覺？你怎麼...",
      "title": "我對失去童貞持一個標準，是不是不現實？"
    }
  ]
}