{
  "author": "harjeet_hellboy321",
  "original_created_utc": 1624891029,
  "title": "My friends sold at a loss and are now blaming me for not stopping them.",
  "created_utc": 1624900924,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I told my friends and relatives about crypto back in March. And they bought shit tonnes of it without any research. They would, again and again, ask for my assurance for their money, as if I was the one responsible for their profits. Fast forward to June and almost all their coins are in deep red. And I have hundreds of hateful messages from my OWN relatives and friends. They accused me of scamming them and one even asked me if I was the one who stole their money. Most of them sold everything last week, taking heavy losses. And today I wake up and see that one of the shit coin they bought (won&#39;t mention the name to avoid shilling) has risen almost 20%. And you know what, they are again texting me and ranting about how I didn&#39;t force them to not sell since I was an &quot;expert&quot;.</p>\n\n<p>TLDR : Never f*cking talk about crypto with ANYONE. You&#39;ll only end up making you look like a moron.</p>\n</div><!-- SC_ON -->",
  "score": 792,
  "permalink": "/r/CryptoCurrency/comments/o9lj9j/my_friends_sold_at_a_loss_and_are_now_blaming_me/",
  "subreddit": "CryptoCurrency",
  "id": "o9lj9j",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I told my friends and relatives about crypto back in March. And they bought shit\ntonnes of it without any research. They would, again and again, ask for my\nassurance for their money, as if I was the one responsible for their profits.\nFast forward to June and almost all their coins are in deep red.…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は3月に友人や親戚に暗号について話しました。そして、彼らは何の調査もせずに\n何の調査もせずに大量に購入しました。彼らは何度も何度も、私にお金の保証を求めました。\nまるで私が彼らの利益の責任者であるかのように、何度も何度も私にお金の保証を求めました。\n6月に入り、彼らが買ったほとんどのコインは大赤字になっています....",
      "title": "私の友人は損をして売ってしまい、今では止めなかった私を責めています。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "早在3月份，我就告诉我的朋友和亲戚关于加密货币。而他们在没有任何研究的情况下买了\n吨，没有任何研究。他们会一次又一次地问我\n保证他们的钱，仿佛我是对他们的利润负责的人。\n快进到6月，他们几乎所有的硬币都在深红....。",
      "title": "我的朋友们亏本出售，现在责怪我没有阻止他们。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "早在3月份，我就告訴我的朋友和親戚關於加密貨幣。而他們在沒有任何研究的情況下買了\n噸，沒有任何研究。他們會一次又一次地問我\n保證他們的錢，彷彿我是對他們的利潤負責的人。\n快進到6月，他們幾乎所有的硬幣都在深紅....。",
      "title": "我的朋友們虧本出售，現在責怪我沒有阻止他們。"
    }
  ]
}