{
  "data/ph-top/2021/12/botify-ai.json": "Create photorealistic avatars for engaging conversations. Have fun interacting with your Digital Human.",
  "data/ph-top/2021/12/boldvoice-2-0.json": "BoldVoice helps non-native English speakers communicate clearly and confidently in English. The app gives you video lessons from Hollywood accent coaches and instant feedback on your pronunciation from speech AI. Get it on iOS & Android!",
  "data/ph-top/2021/12/june-for-ios.json": "Introducing June for iOS. The easiest way to take your startup metrics, on the go 🏃‍♂️ ⚡️ Fast and easy to set up (< 2 minutes) 👶 No expertise required 📚 Out-of-the-box templates 📱 iOS widget for iPhone and MacOS 👉 try it: https://widgets.june.so/",
  "data/ph-top/2021/12/wonder-13.json": "Build new connections: create real relationships Move freely: invite serendipity into virtual Leave energized: break out of the videoconferencing box Join us at our exclusive https://www.eventbrite.com/e/exclusive-guided-tour-product-hunt-tickets-217589394737 OR Check out our https://app.wonder.me/?spaceId=110e7dd5-e5ff-48ae-a842-46e114ce6ab1 https://app.wonder.me/?spaceId=110e7dd5-e5ff-48ae-a842-46e114ce6ab1",
  "data/ph-top/2021/12/the-best-mvp-no-code-tools.json": "Looking to build MVP? Try these awesome no-code tools to release your minimum viable product 10x faster and cheaper!",
  "data/ph-top/2021/12/strapi-0ea3c5eb-2b7c-4521-b51c-9b583f125665.json": "A brand new developer experience, smooth plugin creation, precise database query engine, powerful content API. That's what Strapi v4 is about, a step towards a smooth developer experience and a rich ecosystem. We'd love to hear what you think about it!",
  "data/ph-top/2021/12/treblle.json": "Treblle makes it easy to understand what’s going on with your APIs and the apps that use them. Out of the box, you get features like; real-time API monitoring, logging and error tracking, auto-generated docs, API analytics a quality score of your API and more.",
  "data/ph-top/2021/12/constructor.json": "Constructor is the lightweight tracking tool for software teams who don’t want a ton of process. With a clean UI, a deep GitHub integration, and assignable comment threads, Constructor helps developers and managers stay focused and collaborate smoothly.",
  "data/ph-top/2021/12/top-30-breakout-apps-for-2022.json": "Gear up for 2022 🎆. Discover next-gen productivity apps before they breakout. One every day in December🎄 Get a short intro on how you can make the most of the app, right in your inbox 📬. A lot of them are either free or in private beta!",
  "data/ph-top/2021/12/4-day-week-2.json": "The place to find remote software jobs with a 4 day work week. For engineers, product managers and marketing execs.",
  "data/ph-top/2021/12/resume-builder-for-developers-by-arc.json": "Clear. ATS-friendly. Free to use. Upload your existing resume to this developer resume optimizer, or build a new one from scratch. Showcase your skills and experience to tech recruiters, and land your next dev job.",
  "data/ph-top/2021/12/metaplane.json": "Metaplane is the Datadog for Data — a data observability tool that continuously monitors your data stack, alerts you when something goes wrong, and provides relevant metadata to help you debug.",
  "data/ph-top/2021/12/nft-price-floor.json": "NFT Price Floor shows most used metrics by NFT art collectors like price floor, average price, listed ratio, etc., and show them altogether (kind of a coingecko-like for NFTs.",
  "data/ph-top/2021/12/grapic.json": "Do you miss being able to use the whiteboard in the new hybrid world? We too, that is why we made Grapic. Share your real whiteboard or notebook directly into your Zoom meeting, FigJam session, or any browser, using just your iPhone.",
  "data/ph-top/2021/12/astramind-for-makers.json": "Astramind is a platform where makers build in public and engage with potential customers, fellow makers.🔥 Ship with faster feedback📜 Posts shown through timelines make it fun🛠️ Easy tools to save drafts & create posts🖋️ Support for Markdown in editor",
  "data/ph-top/2021/12/indie-app-santa-2021.json": "Counting down the days to Christmas has never been more exciting with Indie App Santa advent calendar! Get ready for 24 days of surprise: 24 doors to open and as much great applications from indie developers to discover with exciting discounts!",
  "data/ph-top/2021/12/family-time-scheduler-by-ursor.json": "The family time scheduler is a super simple and FREE tool that helps you prioritise 15 minutes of family mindfulness with meditation. Everyday, in your calendar.",
  "data/ph-top/2021/12/trackprogress.json": "At TrackProgress, we believe that regularly reviewing and incrementally improving your goals helps you achieve the best outcomes. It’s often hard to find a way to manage that, so we’re working hard to do it for you.",
  "data/ph-top/2021/12/2021-wrapped-by-spotify.json": "Explore your top songs, artists, and podcasts from a year that was far from normal.",
  "data/ph-top/2021/12/momentum-ff747c7c-2e9c-461b-be02-7312c399635a.json": "Momentum is a habit tracker that helps you to build good habits, break bad ones, reach your goals and keep motivated with streaks and charts. All on Notion.",
  "data/ph-top/2021/12/etsyhunt.json": "Improve your Etsy shop rank and visibility. Backed by data from 27,000,000 product listings, EtsyHunt makes it easy to research and optimize your Etsy SEO, product listings and tags.",
  "data/ph-top/2021/12/highlight-5.json": "Highlight keeps your web app stable and your customers happy! With pixel-perfect session replay, you'll get full visibility into the issues and interactions that are slowing down your users.",
  "data/ph-top/2021/12/ux-notion.json": "UX Notion is a UX toolkit built in Notion to help solopreneurs, indie hackers, Jr. UX Designers, and first-time founders enhance their UX knowledge in a short amount of time.",
  "data/ph-top/2021/12/zen-wireframe.json": "Zen Wireframe is the simplest tool to create wireframes of your websites, mobile apps, and any projects in just minutes.",
  "data/ph-top/2021/12/rows-1.json": "Slick design, built-in integrations and revolutionary sharing. We reimagined spreadsheets from the ground up, so you can get done more, crazy fast.",
  "data/ph-top/2021/12/odet-playground-1.json": "Odet is an intelligence platform for engineering teams to view and diagnose potential blockers through end-to-end visibility into the SDLC process. It provides a custom query & rule engine for teams to design guardrails (policy-as-code) and track initiatives.",
  "data/ph-top/2021/12/github-wrap.json": "2021 is coming to an end, let's wrap it by showcasing the impact you made in open-source. Get your commits, pull requests, issues, and new repositories created in 2021.",
  "data/ph-top/2021/12/metapass-by-zelf.json": "ZELF launches banking in Discord to power the play-to-earn revolution, positioning ZELF as the first bank of the Metaverse. Get your ZELF MetaPass card in 30 seconds, works with Apple Pay and Google Pay.",
  "data/ph-top/2021/12/terrain.json": "Imagine a world where you got paid to learn, experiment, and then share your results to help the community grow.",
  "data/ph-top/2021/12/hive-index.json": "A directory of 1100+ online communities organized by topic, platform, and community features. Discover the perfect community for you, or list your own for free.",
  "data/ph-top/2021/12/calendly-meeting-polls.json": "With Calendly Meeting Polls, your invitees vote on preferred times so you can easily accommodate personal preferences and time zones when scheduling with multiple people. Unlike other scheduling tools, Polls is completely free and has zero ads.",
  "data/ph-top/2021/12/stage-81d273dd-4cd3-420c-8813-c3306b8528ef.json": "TikTok meets TheVoice: always-on music competitions powered by the blockchain. Vote for your favorite artists and share their success.",
  "data/ph-top/2021/12/ditch-mqls.json": "Learn practical PQL-acquiring strategies used by modern B2B marketers ❌ See why you should ditch MQLs (or emails slapped with MQL tags) 💡Learn the concept of Product-Qualified Leads 🌱 Erect your PQL-acquiring foundation 🚀 4 ways to acquire PQLs at scale",
  "data/ph-top/2021/12/blockify-yourself.json": "Want to join the Block party? Yes, you can. Change your profile photo and blockify yourself!",
  "data/ph-top/2021/12/google-search-scanner-by-liner.json": "Google Search Scanner is a new feature of Search assistant & Web Highlighting service, LINER. LINER scans the entire Google search results and returns only the ones relevant for you, saving tons of time spent on research.",
  "data/ph-top/2021/12/trustpage-cookies.json": "We believe in a future where everyone can browse the internet without fear of their privacy being invaded. That's why we’re giving away 300 boxes of (edible) cookies. Get yours today before they’re all gone. #goodcookiesonly",
  "data/ph-top/2021/12/100-ui-ux-tips.json": "This is a collection of Dos and Dont's for making your UI better. 100 pages = 100 tips. Almost every tip has an illustration, some of them have additional links to external resources.",
  "data/ph-top/2021/12/thundra-foresight-v2.json": "Monitor and Debug your CI Pipelines & Tests with Foresight.Monitor all of your CI Workflows & Tests at the same time!Gain Insight into your all CI Workflows and tests by accessing key CI metrics.",
  "data/ph-top/2021/12/reachfluencer.json": "https://reachfluencer.com/ helps entrepreneurs and makers to build an engaged and active community. 👋 Invite people you know in your network ✍️ Post content on LinkedIn, Twitter, Medium or Quora 📋 Paste content URL in your network 🔥 Get dozens of likes automatically!",
  "data/ph-top/2021/12/leadstory.json": "Follow breaking news stories on News Radar map. Watch news that you're interested in or in places you care about. Take complete control over where you get your news from.",
  "data/ph-top/2021/12/sandpack-by-codesandbox.json": "Sandpack is a toolkit for building live coding experiences that run fully in the browser. ✨ Full-featured editor experience ✨ Lightning-fast browser bundler ✨ Direct CodeSandbox integration",
  "data/ph-top/2021/12/plainadmin.json": "PlainAdmin is an Open-source freemium Bootstrap 5 based vanilla JS multipurpose admin template comes with - all essential dashboard components, pages, UI elements, charts, graphs, libraries and everything you may need for a data-rich backends.",
  "data/ph-top/2021/12/kizie-for-twitter.json": "Introducing Kizie, a new way to browse Twitter 🐤 ✨ cleaner, better, ad-free home and profile timelines ⚡️ pro features to do more with twitter(read first comment for the list 👇) 📱 works on web and as PWA 👉 try it: https://kizie.co",
  "data/ph-top/2021/12/lofly.json": "Enjoy lofi beats with nature sounds. Choose from 17+ nature sounds and 17+ lo-fi tracks. Increase your productivity and stay organized with Pomodoro. Enjoy chatting with members and have fun.",
  "data/ph-top/2021/12/high-signal.json": "High Signal is a small community for founders making revenue. We meet for Zoom calls every week in order to share our progress, talk through our goals and get help when we get stuck. We also have a Telegram group for sharing advice.",
  "data/ph-top/2021/12/glyde-3.json": "we do everything on our phones, so why not taxes too? with glyde, you can pre-fill your ITR with incomes, deductions, tax credits, bank accounts. import trades from your broker and investment platform & much more. save, pay, file & track taxes with a few taps.",
  "data/ph-top/2021/12/job-search-journey.json": "Job searching doesn't have to be hard. Find templates and scripts designed by award-winning resume writers and career experts on the world's first career marketplace.",
  "data/ph-top/2021/12/defly-ai.json": "You may have heard of or even experienced the pain of losing your Ethereum transaction fee because your trade failed. defly.ai uses real-time blockchain data & Spice.ai machine learning for the safest AI-powered estimates to save lost fees when using Uniswap.",
  "data/ph-top/2021/12/notion-travel-template.json": "🙅🏽‍♀️ Forget spreadsheets, e-mails, booking sites and a dozen documents cluttering your hard drives or limited cloud storage. 💻 Use this Notion travel template to everything in one place and move from clutter to clarity when travelling.",
  "data/ph-top/2021/12/openin-3.json": "OpenIn helps you manage how links and files open on your Mac. For every link, you can select from multiple browsers, mail clients or apps for files, or configure based on where the file or link is opened, or based on location or domain.",
  "data/ph-top/2021/12/explodingcommunities.json": "ExplodingCommunites is a database with the fastest-growing online communities on Reddit that can sustain your next business. It helps you discover trending communities early, uncover hidden business opportunities, and build community-based products.",
  "data/ph-top/2021/12/jobstack.json": "Structure your job search process: 📈 Personal Resume Builder with 15+ templates 😃 Easy Networking Guides with 3000+ shortlisted profiles ✍🏻 Ready to use Personal CRM for over 16 roles",
  "data/ph-top/2021/12/ultimate-free-trial-card.json": "Use Zerobalance virtual cards for all your Free-Trial Signups and never worry about getting charged or cancellations. Explore our library of 100+ free trials across different categories and enjoy all the benefits without a worry.",
  "data/ph-top/2021/12/office-club-illustration-pack.json": "Whether you’re creating a website or mobile app, showcasing a portfolio, publishing a blog, or an e-commerce store — Office Club’s 100 illustrations and designed art directions help you create the best possible products. Live: https://overflow.design/",
  "data/ph-top/2021/12/gtd-dashboard.json": "A comprehensive Notion dashboard that helps you save time, and get more done.",
  "data/ph-top/2021/12/passky-2.json": "Passky is a simple, modern, lightweight, open-source and secure password manager.",
  "data/ph-top/2021/12/instaasnap.json": "InstaaSnap is a open-source Instagram post saver API, WebApp, iOS and Andoid app. I created it to save some important feeds from Instagram. It's Privacy-friendly, no database, no analytics, no logs, no cookies, plus open-source.",
  "data/ph-top/2021/12/fisio.json": "Fisio resume builder allows you to create an original resule quickly and easily with an intuitive tool.",
  "data/ph-top/2021/12/dash-6-0.json": "Dash instantly searches offline documentation sets for 200+ APIs, 100+ cheat sheets and more. Dash is also a code snippet manager and supports snippet expansion using abbreviations.",
  "data/ph-top/2021/12/w3schools-spaces.json": "W3Schools allows you to create your own website and share it with others.",
  "data/ph-top/2021/12/porndora.json": "Porndora is personalized erotica. We use AI to learn what you like over time and build a personalized pleasure profile for every user. We’re building an adult site that works for everyone, regardless of gender, sexual orientation, or kink.",
  "data/ph-top/2021/12/lllook.json": "A collection of customizable SVG emoji line icons. Adjust the color, size and stroke width right in the browser, and then use the SVG icons to add some fun little expressive characters to your designs.",
  "data/ph-top/2021/12/authorizer.json": "Authorizer is an open-source authentication and authorization solution for your applications. Bring your database and have complete control over the user information. You can self-host authorizer instances and connect to any SQL database.",
  "data/ph-top/2021/12/health-hub-os-notion-template.json": "❤️ An Operating System Template with +15 unique templates & +10 trackers to help you track everything health-related in one connected Hub.",
  "data/ph-top/2021/12/aguapro.json": "Hire motivated talent from the exclusive, distinct & top communities in ‘product’ and ‘growth’ domain. Using sophisticated techniques, job requirements are aligned to community values and match with the right applicant.",
  "data/ph-top/2021/12/insite-2.json": "Insite is a powerful yet simple tool that helps you learn what your customers want from you. Embed a custom, elegant feedback survey into your website in under 5 minutes.",
  "data/ph-top/2021/12/favelent.json": "We want to crystalize your most-favourite content and let you represent it to the world! Share your Profile with your audience whenever they ask for recommendations. Collect E-Mails and add your social links Discover the best findings of others.",
  "data/ph-top/2021/12/snout.json": "Snout works hard from sniffing public data on the internet to find emails and social networks of people and companies. Find customers, influencers, investors, employees and more. ★ 200+ Countries ★ 57M+ Companies ★ 800M+ people ★ 150M+ emails address",
  "data/ph-top/2021/12/able-28-day-affirmation-plan.json": "Daily affirmations help shift your mindset to positive thinking. Get a personalized plan for 28 days that will help you become grateful, inspired, content, and just happier by verbally affirming your dreams and ambitions!",
  "data/ph-top/2021/12/showping.json": "Showping is the power of word of mouth in your pocket. Showping is a unique app where you can share your Wish and Bought list with friends. It's a place where people can read reviews from someone they trust and do shopping together through screen sharing.",
  "data/ph-top/2021/12/passcard-2.json": "PASSCARD is an app that helps you to remember card passwords. The app saves passwords on your device offline and securely. The app will never save or collect any information.",
  "data/ph-top/2021/12/convert-menu.json": "Automatically convert paper menus into a digital QR menu. Just upload your (pdf) paper menu and we do the rest. A digital menu should be ready within 32 hours.",
  "data/ph-top/2021/12/lalo.json": "Lalo is a platform for remembrance. We give you the tools to tell the story of those you love. Preserve your memories in a safe, ad-free place.",
  "data/ph-top/2021/12/teamble.json": "Give and get 👍 simple, 🔁 continuous, and 🎯 actionable feedback with https://teamble.com. Seamlessly on https://slack.com/apps/AS8DW2X44-teamble and https://teams.microsoft.com/l/app/ee7907e3-f0b3-4e18-b882-baa83e87812f. Leverage powerful tools, templates, and nudges to build a continuous feedback culture in your team. Start using teamble for FREE.",
  "data/ph-top/2021/12/growthpost.json": "GrowthPost helps you discover 100+ jobs from niche newsletters written by top Entrepreneurs, Investors from the likes of Sahil Bloom, Julian Shapiro, Greg Isenberg, Lenny, and many more. GrowthPost does all tedious work & sends you weekly updates of new jobs.",
  "data/ph-top/2021/12/nifty-generator.json": "Nifty Generator lets you generate NFT collections with different traits, complete with metadata for Solana or Ethereum—no coding needed. Just connect your image layers to our tool, and we’ll handle the generation!",
  "data/ph-top/2021/12/moonship-personalized-ai-discounts.json": "Moonship enables Shopify merchants to offer personalized AI discounts to price sensitive customers who need a little nudge to buy. We use machine learning models to enable ecomm merchants to increase their sales by an average of 20% and as much as 80%.",
  "data/ph-top/2021/12/weekend-club-2-0.json": "The community of 65+ bootstrapped founders launching & growing profitable internet businesses together. Meet founders at our remote & IRL co-working events, stay accountable with masterminds, learn from in-house mentors and save with 100+ great discounts.",
  "data/ph-top/2021/12/huenit.json": "The robotic arm which has AI vision, voice recognition, 3D printing, laser engraving, a suction grabber, and a pen tool. It can aslo be programmed via block coding, python, Arduino C++, or G-code.",
  "data/ph-top/2021/12/valuer.json": "Does combing through hundreds of thousands of global data points to find the most innovative technologies and companies sound sexy? We didn't think so. Which is why we have developed an AI-driven platform to do the heavy lifting for you. Basically, we make innovation sourcing easy and personal.",
  "data/ph-top/2021/12/100-free-userpics.json": "Collection of a hundred free userpics especially for your design projects. Each avatar is available in circle and square formats. Edit images as you wish to make them fit your view of design. Fully vector, compatible with Figma.",
  "data/ph-top/2021/12/pm-vs-pm-challenge.json": "That inner voice doubting you - “Am I a PM? No, I am a PM!” This is an end to exactly that. But if you aren’t okay facing harsh reality checks, leave rn. Don’t tell us we didn’t warn you. Jk will be fun. Or will it? :P",
  "data/ph-top/2021/12/rebox.json": "Easy to use design, Ability to schedule your returns. We reimagined how products should be returned, So you don't have to!",
  "data/ph-top/2021/12/passthru.json": "PassThru allows you to store and manage all your tickets, vouchers and reservations safely in one place. Regardless of the ticket provider; it works with every system.",
  "data/ph-top/2021/12/trydraw.json": "Improve your line art and observational skills with our tool that highlights your mistakes. Gone are the days of waiting for a teacher to correct your mistakes. Get guided by simple STEP BY STEP tutorials that will teach you at your own pace.",
  "data/ph-top/2021/12/betts-connect-2.json": "By leveraging over a decade of recruiting experience, we created a platform that reduces time to hire and saves money on recruiting fees. Simply choose the roles you’re hiring for, filter candidates by KPIs like quota and deal size, and schedule interviews.",
  "data/ph-top/2021/12/founders-at-work-9.json": "Jessica Livingston's book \"Founders at work\" (2007, 32 stories) inspired thousands of founders to start startup. I find 150+ founders stories to inspire new wave of founders. I hope, that FoundersAtWork.io saves 50-100 hours for 1000+ new founders.",
  "data/ph-top/2021/12/progressive-upload-by-api-video.json": "⏺ Record and upload videos simultaneously ⚡️ Offer lightning-fast screen and camera recordings to your users 📺 Enrich your products and apps with video messaging 💻&nbsp; Demo: https://upstream.a.video/ 🎁 50% on plans for 3 months: email us at hello@api.video",
  "data/ph-top/2021/12/directus-9.json": "Directus turns any SQL database into a no-code app and powerful API. Our open-source platform is completely migration-free, seamlessly layering on top of your new or existing database, providing you with a suite of tools to manage and connect your content.",
  "data/ph-top/2021/12/alfread.json": "Alfread is a new kind of a read later app. It helps you to actually read saved articles. Or skip them. No pressure. Alfread helps you rediscover your love for reading what you've saved. One article at a time.",
  "data/ph-top/2021/12/designify-pro.json": "Bulk-edit any number of product photos, get high-res downloads, save your designs and integrate the Designify Pro API into your website, app, or workflow. Let our visual AI handle your product photos - automatically and in seconds! 👉&nbsp; https://www.designify.com/pro",
  "data/ph-top/2021/12/zero-to-mvp.json": "Learn to build apps without coding in one week. 21 chapters that take you through the app-building process without coding, with bonus curation of 120+ No-code tools having over 2,000+ downloads.",
  "data/ph-top/2021/12/seoforlunch-newsletter-2-0.json": "Hundreds of SEO related updates and articles are published each week. The #SEOForLunch is a once-a-week email curating only the best content. Cut out the clutter and get all critical updates sent directly to your inbox.",
  "data/ph-top/2021/12/collaboration-suite-by-editor-x.json": "Work together on the same visual canvas and build powerful sites together with your team on Editor X. Streamline your work process with concurrent editing, live comments, custom roles & permissions and shareable design libraries.",
  "data/ph-top/2021/12/shopgram-bd95c824-eef3-4908-bec8-52607dc5ffb0.json": "Shopgram is a search engine for Shopify stores and products. It gives you instant access to the data and analytics of more than 1.2 Million Shopify stores and products based on different metrics.",
  "data/ph-top/2021/12/zyro-online-success-builder.json": "Zyro is an AI powered no-code website builder that allows even total beginners to create a website or online store in under 1 hour. We use AI tools to create online success for our users - https://zyro.com/product-hunt and start building today.",
  "data/ph-top/2021/12/sql-playground.json": "Create a private PostgreSQL database with a predefined structure & test data in the shortest time. No local installations or spinning up cloud instances. Choose a database type, and get a unique connection string right away.",
  "data/ph-top/2021/12/social-media-pricing-calculator.json": "Planable, along with pricing experts from Soft Fight, built the pricing calculator that agencies & freelancers need. No complicated formulas. No boring spreadsheets. Simply fill out a brief form & find out how much to charge for your social media services.",
  "data/ph-top/2021/12/no-code-showcase-by-heep.json": "No-code showcase featuring selected projects built by Heep makers. Discover apps, websites, and automation created using low-code, no-code, and automation tools. A little experiment from our team built with the new Bubble responsive engine.",
  "data/ph-top/2021/12/resumey-pro-2-0.json": "Get shortlisted for your dream job with a resume that helps you stand out. With Resumey.Pro, highlight your skills, ensure proper visual hierarchy and always maintain consistency. Our Markdown editor helps you focus on writing, while we take care of the rest",
  "data/ph-top/2021/12/previewify.json": "Your competitor isn't designing those images by hand. They're generating them via platforms like Previewify. They save more time and have a bigger conversion rate.",
  "data/ph-top/2021/12/personalization-decoded.json": "Every two weeks, we break down a website and write a short case study showing how to personalize the customer experience.",
  "data/ph-top/2021/12/modern-for-wikipedia.json": "Enhance your Wikipedia experience with a beautiful, clean, modern design that's fully customizable. Once installed, this free extension will simply apply the new look and features to existing Wikipedia article pages, without you having to do anything.",
  "data/ph-top/2021/12/pro-article-writer.json": "Texta.ai is a Pro Article Writer that automatically generates and optimizes articles. Save yourself 90% of your time by letting a powerful system create outstanding articles (1500-2000 words) from a simple description.",
  "data/ph-top/2021/12/fable-18ba2a08-fbc3-4ca5-9c5f-605660835fcc.json": "Fable is motion design software for the next generation of creators that's powerful for pros, intuitive for beginners, and collaborative for teams. Start animating with Fable and we can't wait to welcome you into our community.",
  "data/ph-top/2021/12/taco-digest.json": "Customizable personal email newsletter created from your favorite sources. The simplest way to follow the news across the web.",
  "data/ph-top/2021/12/retrera.json": "Retrera helps distributed and remote companies book, coordinate and evaluate team events. We make it easy to: 🛏️ Find a vetted venue 💬 Survey your team ✈️ Manage employee travel 💸 Track expenses & manage budget 🗣️ Send pulse surveys & collect feedback",
  "data/ph-top/2021/12/webflow-tv.json": "Webflow TV is a streaming platform #MadeInWebflow featuring original productions as well as a highly curated collection of inspiring stories about creativity, no-code, design, and entrepreneurship.",
  "data/ph-top/2021/12/chainrunner-q.json": "The simplest way to optimize your DeFi investment. Take advantage of pre-built DeFi strategies in just one platform. Deposit, borrow, transfer, buy, leverage and more - all in one place.",
  "data/ph-top/2021/12/ffflux.json": "An online tool that makes it easy to generate fluid and organic-feeling gradients, then export them as lightweight SVG files to be used as backgrounds in your designs.",
  "data/ph-top/2021/12/pixlr-2022.json": "✨ Animate your artwork/designs in one click ✨ Remove unwanted objects from photos seamlessly ✨ Draw with customised pen pressure and brush sensitivity ✨ Edit up to 50 images at once ✨ Export & publish your designs in any format i.e. GIF, MP4, PDF etc.",
  "data/ph-top/2021/12/office-health-safety-by-tactic.json": "We've been on a mission to make work better. Now, we're making it safer too.❤️ With vaccination policy management, health alerts & visitor management, you can take a proactive approach to office safety, while preparing for developing guidelines & regulations.",
  "data/ph-top/2021/12/airtaste.json": "AirTaste is the first dual-layer cookware that lets you cook nutritious meals effortlessly. Its chamber of air acts like the thick walls of a Dutch Oven — but better, and lighter! — heating food thoroughly and without burning, even if you don’t stir!",
  "data/ph-top/2021/12/arctype.json": "Arctype is a fast, beautiful database GUI for developers and teams. With SQL autocomplete, spreadsheet-style editing, one-click visualizations, collaboration, and the best support for Postgres, MySQL, and PlanetScale - you'll finally love working with your DB.",
  "data/ph-top/2021/12/peersolver.json": "Problem-solution pairs that tell you what works and what doesn't. These are the categories we tackle: * Ideation * Hiring * Leadership * Marketing * Getting investors * Time management * Idea validation * Market needs * Growth Hacking",
  "data/ph-top/2021/12/screeb.json": "In-app NPS surveys with a non-intrusive, breakthrough respondent experience, powerful targeting capabilities and pre-built reports. Available for SaaS, Android and iOS apps, for free without any limitation on your number of users or the number of responses.",
  "data/ph-top/2021/12/tailwind-css-cheat-sheet.json": "Get access and search for every utility class from Tailwind CSS on a single page and accelerate your development process.",
  "data/ph-top/2021/12/fathom-2.json": "Fathom records, transcribes, and replaces note taking with a click of a button on your Zoom calls, so you can simply focus on the conversation at hand. Easily share call highlights with your team via email, Slack, or auto-generated summaries sent to your CRM.",
  "data/ph-top/2021/12/openscout-by-landscape.json": "With OpenScout, investors can access diverse dealflow from handpicked scouts. Venture scouts can share deals with an entire marketplace of investors, and get paid a success fee ($5k-50k!). Apply to join as a scout or as an investor for our invite-only beta!",
  "data/ph-top/2021/12/cloudtalk-for-mobile.json": "CloudTalk Go allows Sales, Support & Operation teams to stay connected and professionally handle customer calls outside of the office using WiFi or mobile networks. Available on the iOS App Store and the Android Play Store.",
  "data/ph-top/2021/12/the-state-of-customer-onboarding-2022.json": "100+ customer onboarding professionals share the challenges, goals, and trends they foresee in 2022. Click ‘Get it’ to download your copy of The State of Customer Onboarding report.",
  "data/ph-top/2021/12/gentler.json": "Knowing your activity levels and having them guide your active life lowers the chances of fatigue, burnout, injury. Gentler monitors your fitness progress and nudges you to slow down, step up, or rest. It is personalized, appropriate for all fitness levels.",
  "data/ph-top/2021/12/patchstack.json": "Monitor all your WordPress sites for security vulnerabilities found by our community of ethical hackers. Add up to 99 websites for free!",
  "data/ph-top/2021/12/matrix-playground.json": "At Spline, we love the Matrix so we built a fun side project for everyone to play around! You can upload your 3d models, see yourself inside Matrix code using the webcam, and change the parameters of the particles.",
  "data/ph-top/2021/12/link-in-bio-1.json": "One page for all your links with a video. Claim a unique URL and share in your bio. Add your links, pick your theme and you're good to go. All built in no-code: Webflow + Bubble in 4 weeks.",
  "data/ph-top/2021/12/the-cold-start-problem.json": "Based on 100s of interviews with founding teams at Twitch, Tinder, Uber, Airbnb, Pinterest, and many more, Andrew Chen explores how tech’s most successful companies solved the dreaded \"cold start problem” using network effects to launch and scale.",
  "data/ph-top/2021/12/altcoffee.json": "It's basically a crypto version of buy me a coffee.",
  "data/ph-top/2021/12/clubs-poker-for-companies.json": "Ditch the virtual happy hours and host a poker night instead with Clubs Poker's new product --> \"For Companies\" 💚 Just send a link to your colleagues and start playing 💚 Add your company logo to the table and card decks 💚 Dedicated event host (optional)",
  "data/ph-top/2021/12/okr-for-jira-2.json": "Best way to manage your OKRs in Jira. Align your daily work to the company strategy with OKRs. Focus on what really matters by tracking your OKRs in Jira.",
  "data/ph-top/2021/12/founders-book-2-0.json": "The knowledge gap in founders and founding teams to build on and scale their ideas is real, expensive and time-consuming. This gap hurt our ideas, confidence and ambition! Hence Founders’ Book to support their venture building process.",
  "data/ph-top/2021/12/bookstash.json": "Bookstash is a free library of curated summaries from top nonfiction books. We pick a book for you and give you all the key ideas and you get to save your favorites for later & track your reading progress.",
  "data/ph-top/2021/12/wannadocs.json": "Create public product docs for your customers or internal knowledge base for your team, all within the same awesome UI 🖖",
  "data/ph-top/2021/12/universal-ui-kit-web-v1-0.json": "Powerful Web UI kit for creating landing pages, websites and dashboards in Figma. Save hundreds of hours with our UI Kit.",
  "data/ph-top/2021/12/stytch.json": "Stytch is a full stack authentication and authorization platform, whose APIs make it simple to seamlessly onboard, authenticate and engage users. Improve security and user experience by going passwordless.",
  "data/ph-top/2021/12/weweb-2-0.json": "WeWeb is the fastest way to build production-ready web apps: - connect multiple data sources (e.g. Airtable, REST APIs, XANO, PostgreSQL) - visually design your frontend or add custom components (vue.js / react) - build no-code workflows or add custom JS",
  "data/ph-top/2021/12/quarkly-2-0.json": "Have you been searching for a no-code fast-to-market builder in React with in-depth controls when needed? Are you interested in quickly creating a UI with a good balance between GUI and code input? Good news for you — now you can use Quarkly.",
  "data/ph-top/2021/12/nanonets-table-extractor.json": "Save time, effort & resources&nbsp;spent on extracting tabular data from all kinds of documents with Nanonets’ no-code table extractor. Automatically capture any “table-like” structure, extract entire tables or just pull data from specific cells/rows/columns.",
  "data/ph-top/2021/12/ycode-3.json": "Ycode is a visual development platform that enables creators to build custom web projects without having to hire developers. Ycode's mission is to make visual development as powerful as coding by hand—just faster and more accessible.",
  "data/ph-top/2021/12/chatwoot-2-0.json": "Chatwoot is an open-source, self-hosted customer engagement suite. With Chatwoot, you can view and manage your customer data, communicate with them irrespective of which medium they use, and re-engage them based on their profile.",
  "data/ph-top/2021/12/status-page-by-spike-sh.json": "Create beautiful and branded Status Pages for your website, app and store. 🚀 Fast setup - create your branded status page in 2 minutes. Share real time updates about incidents and planned maintenances. 🎁 Unlimited Status Pages for free in December!",
  "data/ph-top/2021/12/acquireflow.json": "AcquireFlow is the UK & Europe's free private acquisition marketplace for buyers and sellers of digital startups. We focus on the key areas of SaaS, e-commerce and Amazon FBA.",
  "data/ph-top/2021/12/fundraising-market-map.json": "Getting funding for your startup is hard, but there are hundreds of companies helping you with your fundraising efforts. This map is a visual overview of every player in the fundraising ecosystem.",
  "data/ph-top/2021/12/headroom-2-0.json": "Headroom enables natural video calls. Our AI recognizes gestures, provides real-time transcripts and summaries, and allows you to search across replays, transcripts and notes. ​​Focus on people and let Headroom automate away the work.",
  "data/ph-top/2021/12/mrr-meter-generator.json": "Generate cool progress bars to showcase your MRR progress toward your dream goals. 🤑 Perfect for indie hackers & entrepreneurs who build in public their open startups.",
  "data/ph-top/2021/12/the-ultimate-google-sheet-toolkit.json": "We put together a curated list of templates, videos, and tutorials that can help you build your analytics expertise. Browse through this directory to find the right tools for your task.",
  "data/ph-top/2021/12/co-lab-learning.json": "A new multiplayer-method of learning online. Watch videos, do activities, share perspectives and make friends via Co.Lab’s hybrid-live, instructor-less courses. Go deeper by learning with and from one another in small intimate groups. #LearnTogether",
  "data/ph-top/2021/12/emojination-3.json": "A simple design tool combining emojis and modern aesthetics. Create fun engaging visuals in seconds. Grow your social media, express your company culture, standout and most importantly have fun!",
  "data/ph-top/2021/12/podcast-audiogram-creator-by-milk-video.json": "This is a tool to quickly turn podcasts into social audiograms. There is no sign up and it's free! How it works: * Upload a podcast * Add titles and set colors * Clip a key moment * Download and share If you have a podcast, we would love your feedback!",
  "data/ph-top/2021/12/zuq-ai-for-facebook-messenger.json": "Zuq learns your FAQ and instantly provides your customers with relevant answers to repetitive questions. Zuq is like a perfect customer support AI agent that will work around the clock, always be polite, only get smarter, and will never quit.",
  "data/ph-top/2021/12/biport-wallet.json": "Start your blockchain journey with Biport Multichain Wallet for Bitcoin, Ethereum, BSC, and beyond. Biport allows you to manage cryptocurrencies scattered across different blockchains all in one place without switching blockchain networks.",
  "data/ph-top/2021/12/wicked-launchers.json": "Wicked Launchers is a collection of 13 heros made with Tailwind CSS ready to get Sign Ups, connect it to your data base, use your copy and you are ready to go!",
  "data/ph-top/2021/12/fantasy-startup.json": "With this real-to-life simulation, you will - Experience 10 yrs of investing in a few weeks; - Grasp the illiquid nature of equity; - Build patience, discipline & perseverance; - Discover how to protect your net worth; and - Become Financially Sophisticated",
  "data/ph-top/2021/12/reward-hunt.json": "$75.000 active review reward programs on Capterra, G2, Trustpilot etc. Get paid by making review about your favorite products or discovering new ones! Product Hunt for Reward Programs",
  "data/ph-top/2021/12/okel.json": "Okel is a social platform that connects users over sharing meals at local restaurants. Similar to how dating apps function, Okel matches users based on shared interests, favorite cuisines, and times of availability. Waitlist 👉 https://www.joinokel.com/",
  "data/ph-top/2021/12/bifi-x.json": "BiFi X is a DeFi service that enables you to get maximum leverage in a single transaction using flash loans on yield farming and margin trading positions.",
  "data/ph-top/2021/12/superdms.json": "SuperDMs helps you grow your following by sending bulk DMs to your tweet responders. You can use SuperDMs to send your: - Giveaways - Newsletters - Offers that are unique - Specially-curated content SuperDMs is ideal for all active Twitter users.",
  "data/ph-top/2021/12/runbooks-by-airplane.json": "Airplane Runbooks make it easy to turn small amounts of code into complex internal workflows. Model onboarding flows, admin operations, cron-like schedules and more and share with your team. It's like Zapier but for first-party operations that touch prod data.",
  "data/ph-top/2021/12/outdone.json": "Special occasions are stressful. Outdone's Ai-powered gift recommender gives you one less thing to worry about. For now, Outdone's engine recommends apparel brands, but we plan to expand into other gift categories and drive users to specific products soon!",
  "data/ph-top/2021/12/quire-nested-kanban-board.json": "Quire is a modern collaborative app made to help visionary teams with big ideas. Well-known for Nested Task List View, now introducing Nested Kanban Board View. Featured as one of the best project management software on Inc and Huffington Post.",
  "data/ph-top/2021/12/sleek-3.json": "Discover a new delightful way to create and manage your to-do's. Introducing a new colorful Rank system for tasks and reminders. Sleek is completely customizable! You can change themes and fonts. Set due dates and reminders, add notes, links and more!",
  "data/ph-top/2021/12/younote.json": "YouNote is an extremely simple web application that allows users to watch a YouTube video and take notes next to it in RichText format. Currently in Beta.",
  "data/ph-top/2021/12/neuralcam-5.json": "NeuralCam 5 is the most advanced Computational Photography Camera App for the iPhone for both Night and Day photos. Capture better photos with AI powered 48MP Super-resolution, Macro-Mode and NeuralHDR. More details here: https://neural.cam/news/ https://neural.cam/news/nightmode5/",
  "data/ph-top/2021/12/uko.json": "Uko is a Free Figma Dashboards & Design System Bundle with lots of Components and pages",
  "data/ph-top/2021/12/gwaber.json": "Gwaber is an easy platform that connect between remote job seekers and remote companies in one place.",
  "data/ph-top/2021/12/snoozz.json": "\"Snoozz\" tabs and windows now and they will reopen automatically later - Snooze individual tabs, selected tabs, or full windows - Snooze once or at repeated intervals (weekly or monthly) - Extremely lightweight and open source Read more on the https://snoozz.me",
  "data/ph-top/2021/12/inloop-2.json": "InLoop helps creators launch a membership NFT for their community with 0 code and art. Generate unique NFT membership cards, design a custom storefront, and gate exclusive content behind token ownership.",
  "data/ph-top/2021/12/dear-sun.json": "Dear Sun is a reliable Mac menu bar app that shows accurate weather at a peak. How? You pick the most accurate weather data source for you. No data hoarding trackers or complex mambo-jambo interfaces.",
  "data/ph-top/2021/12/pinchat-2.json": "PinChat provides you with an easier way to start a chat with others. With your PinChat link and QR code, others can start a chat with you instantly without having to log in or sign up.",
  "data/ph-top/2021/12/break-015dfe20-416d-4905-a4a1-c144718c9481.json": "See when your friends are available and signal when you need a break - to live your social life in full. Send a signal to a group of people you choose and have a spontaneous audio chat, grab a cup of coffee together or meet for lunch to catch up.",
  "data/ph-top/2021/12/1-minute-writing-challenge.json": "Get into the habit of writing by dedicating just 1 minute everyday. 👩‍🎨 Find beautiful backgrounds curated by best designers. 🥳 A community of 3000+ folks to keep you motivated 🚀 Leaderboard, streak tracking 💡 New ideas everyday",
  "data/ph-top/2021/12/novi-from-meta.json": "Novi is a digital wallet from Meta that helps you send and receive money instantly and securely. Move money across borders for everyday needs, monthly expenses, and special occasions — today with no fees.",
  "data/ph-top/2021/12/movingto.json": "Moving to Different Countries has never been so seamless, stress-free, and cost-effective. We compare visas and law firms for you to make sure you get the best prices and service.",
  "data/ph-top/2021/12/style-dictionary-play.json": "- Experiment with style-dictionary in your browser - Live preview window - Mobile - Desktop view - Share URL to share project - Open source - No signup / No login 👉 https://www.style-dictionary-play.dev",
  "data/ph-top/2021/12/work-with-data.json": "Explore data in all its forms on 4M+ topics and entities - backed by our knowledge graph combining numerous reliable sources.",
  "data/ph-top/2021/12/screenrec.json": "📹 ScreenREC : A really simple web screen recorder. ✨ Features ✔️ Export type selector (currently MP4/Webm) ✔️ Video preview ✔️ Video download ✔️ Dark/Light mode toggle ✔️ Open Source",
  "data/ph-top/2021/12/jsonverify.json": "Debugging JSON can get really complicated especially when they are huge, so using the JSONverify will make the process of debugging much simpler and faster. Also, the application can be sued to format JSON objects.",
  "data/ph-top/2021/12/marble-4.json": "Build the ultimate content experience for your audience and your sponsors by putting all your content in one place to increase engagement and level up your ad revenue. Combine your Instagram, TikTok, Youtube, Spotify, Facebook, Twitter and your external links.",
  "data/ph-top/2021/12/stenography.json": "Stenography combines state of the art AI technology (OpenAI Codex) and code parsing techniques to create a smart codebase documenter. Stenography is designed to to fit the natural dev flow and do what dev tools have always promised us: decrease cognitive load!",
  "data/ph-top/2021/12/sttr.json": "sttr is command-line software that allows you to quickly run various transformation operations on the string.",
  "data/ph-top/2021/12/forte-4.json": "Forte² is here to help you track your progress as you build new habits or quit old ones. Unlike other habits trackers, Forte² doesn't set you back to zero for missing one day; Forte² gives you a score for each habit instead of just counting streaks.",
  "data/ph-top/2021/12/musicmatch.json": "Music is best when shared. With MusicMatch, friends can share and open music links even if they use different streaming services, like Spotify and Apple Music.",
  "data/ph-top/2021/12/task-muncher.json": "Task Muncher has been developed by Adam Ali of the #EverydayHustle. Stay Laser-focused on munching your weekly tasks. Prioritize what’s important with our smart, simple, and powerful task management app. Now get to munching those tasks!!",
  "data/ph-top/2021/12/gitploy.json": "Gitploy makes your team or organization build the deployment system around GitHub in minutes. Now, do not waste the time building the deployment system.",
  "data/ph-top/2021/12/bucket4j.json": "Java rate-limiting library based on the token-bucket algorithm. The library includes many huge features to provide rate-limiting to your API.",
  "data/ph-top/2021/12/2021-your-year-in-meetings.json": "Take a free space flight to get a personalized report showing unique insights into your meetings from 2021. From total hours in meetings to number of people you met & other fun trends! Claim your bragging rights by sharing your meeting report!",
  "data/ph-top/2021/12/buymeacryptocoffee.json": "Move on from traditional currency, and easily get support from your audience in Crypto. Not a creator? You can show support to your favorite creators with just their wallet addresses! And also add a few words of gratitude.",
  "data/ph-top/2021/12/workbase-3.json": "Alerts, watchlists, and automations powered by custom stackable formulas. Workbase automatically scans and runs triggers over your data sources including Salesforce, Snowflake, and other live systems.",
  "data/ph-top/2021/12/free-logos-by-larkef.json": "Get access to a huge library of logos from an incredible designer, Jord Riekwel. This ten-year-old archive is a collection of all unused client logos, which Jord kind donated for anyone to use in their next project.",
  "data/ph-top/2021/12/trello-annual-report.json": "Wanna Know What Happened In Trello This Year? Say *Trello* to Your New Favorite Power-Up 😎 Fun & free, the Trello Annual Report Power-Up generates interesting stats and awards from your team’s Trello activity over the past year",
  "data/ph-top/2021/12/static-app-1.json": "Static.app is the easiest way to host a static HTML website online. Drag-and-drop an archive with your page or an entire website and we will take care of the rest. Everything is included: SSL certificate, code editor, forms and media storage all in one place.",
  "data/ph-top/2021/12/marketing4makers-community.json": "Marketing4Makers is a private community of makers that wants to grow their marketing skills Every day, we share our struggles and wins, and we help each other in our marketing efforts. We have a weekly call to share our current actions and celebrate our wins",
  "data/ph-top/2021/12/free-ai-email-subject-line-generator.json": "Are you tired of all the basic subject line generators that give you the same old cookie-cutter ideas? Create unique subject lines with a free AI email subject line generator based on GPT-3. Simply enter the topic of the email and let the AI do its magic.",
  "data/ph-top/2021/12/successrate.json": "You are welcome to submit your draft application before a deadline to get alumni feedback. The sooner you submit more feedback you get.",
  "data/ph-top/2021/12/platypus-beta.json": "Create your Platypus Print by reflecting on what is most important to your professional life. Explore teams with your cultural priorities who care about the same things that you do. Become a Platypus early adopter and help us shape the future of recruitment.",
  "data/ph-top/2021/12/thirdweb.json": "⛏️ **Build** features such as NFT's, marketplaces, tokens, and more in a few clicks 🧰 **Utility** SDK's, widgets, and interfaces to integrate web3 features into your app 🕹️ **Powers** blockchain games, DAO's, NFT card platforms, generative art drops and more",
  "data/ph-top/2021/12/github-wrapped-2021.json": "Get your personalized Year in Review video of your GitHub activity. Enter your name and a downloaded video will be generated immediately! Post it on social media using the hashtag&nbsp;#GithubWrapped.",
  "data/ph-top/2021/12/popify.json": "With Popify, you can create awesome designed popup notifications of special promotions and build FOMO (fear of missing out) by showing recent customer's activities like recent sales, add to cart, live visitor counter, and reviews.",
  "data/ph-top/2021/12/bitsfordigits.json": "BitsForDigits is the world’s #1 partial buyout marketplace. We make it anonymous, easy and free for founders to sell minority and majority stakes to professional investors. List your business today to get offers from the +100 investors already on the platform!",
  "data/ph-top/2021/12/nativebase-startup.json": "NativeBase Startup+ is a bundle of 100+ responsive, accessible, dark mode supported and production ready React Native screens for mobile and web. Rely on the trust of NativeBase v3 and use these highly themeable screens to build your next dream project.",
  "data/ph-top/2021/12/archimedes-2-0.json": "Archimedes simplifies investing into easy, actionable steps, no matter your experience. As your approachable investment coach, we empower you to manage your money the way you want to achieve your goals.",
  "data/ph-top/2021/12/buildblocks.json": "BuildBlocks is a user-curated resource platform to help solve your niche no-code problems in minutes. Discover and add resources, ask questions and become a part of the community.",
  "data/ph-top/2021/12/delta-investment-tracker.json": "World’s number one Investment Tracking app. Forget about spreadsheets and manage all your investments in one place. If you’re invested in or following one or multiple asset classes, such as stocks, cryptos or ETFs, Delta is the tool you were looking for.",
  "data/ph-top/2021/12/mysuper-fan.json": "With the MySuper.fan, you can create a leaderboard of your superfans; instantly generate a superfan profile and do a deep dive into your superfan's engagement across your content.",
  "data/ph-top/2021/12/seoptimer.json": "SEOptimer is a full-featured SEO Audit & Reporting platform which can comprehensively review a website in under 30 seconds. Digital agencies can use SEOptimer to produce simple and beautiful PDF reports for their clients and prospects.",
  "data/ph-top/2021/12/triage-2.json": "Triage is first aid for people who struggle to stay on top of their inbox. It doesn’t try to replace traditional email software, but lets you use your downtime to quickly remove the noise and stress.",
  "data/ph-top/2021/12/sales-automation-playbook-by-nethunt-crm.json": "Picture this as a cookbook for sales automation. Step-by-step, it walks you through automation for all your sales processes, from pre-sale to post-sale; why, when, and how we should utilize it.",
  "data/ph-top/2021/12/customer-service-tips-by-labidesk.json": "50+ Customer Service Tips! We put together a list of common rules and best practices that helped so many companies grow with the help of the way their customer service was organized and how they handled each and every customer support inquiry.",
  "data/ph-top/2021/12/pockettube-3-0.json": "PocketTube is a brand new YouTube experience. Manage and sort your subscriptions, create groups, use auto tags, mark as watched, filter your video feed effortlessly, all its within YouTube's own interface. Available for your browser",
  "data/ph-top/2021/12/zen-flowchart-2-0.json": "Zen Flowchart is the simplest flowchart maker. Loved by 1.6M users worldwide. Rebuilt from scratch with new powerful features: - Live Collaboration - More flowchart shapes - Cleaner & faster UI - Icons - Custom colors",
  "data/ph-top/2021/12/github-wrapped-4.json": "You coded a lot in 2021 - commits, pull requests, and reviews. Reflect on your year, the projects you contributed to, and the developers you supported. Open source. Share on Twitter or add to your personal Readme. Made by the team at Neat.",
  "data/ph-top/2021/12/how-much-is-your-saas-worth.json": "You deserve a higher valuation. Now you have the data to get it. Use our real-time insights to make sure you get what you’re worth.",
  "data/ph-top/2021/12/first-1000-users-guide.json": "A fully interactive guide on going from ideation to 1000 users within 1 month! Composed of tons of resources from tech figures like Paul Graham and Lenny Rachitsky, as well as an interactive interface where you can record and learn from your findings!",
  "data/ph-top/2021/12/onpodium.json": "This is a successor of my previous project Podsite that was launched last year. We’re constantly improving OnPodium according to the feedback we get from existing customers.",
  "data/ph-top/2021/12/spatial-4.json": "Spatial is the metaverse for culture, where we can all experience one-click NFT galleries & exhibitions together. Creators, collectors & brands can host beautiful immersive experiences across web, mobile, and VR for free.",
  "data/ph-top/2021/12/podbuddy.json": "PodBuddy makes animated videos from your podcast episode, perfect for sharing on social media. It takes seconds to create an animated post. Simply pick your podcast episode clip and PodBuddy will create a post based on your podcast's artwork.",
  "data/ph-top/2021/12/unicorns-to-the-moon.json": "Unicorns To The Moon is an action-packed tabletop game that turns your dreams of being a hotshot venture capitalist (VC) into a reality! Your job as a VC? Invest in unicorn companies, and send them to the moon.",
  "data/ph-top/2021/12/trivia-game-center-1.json": "Don’t you hate it when your Monday blues end on Friday nights? Fret not! Play Quizzes and Pictionary with your team in real-time group calls and bond with your team virtually. No installation required! Fire up your browsers and get ready to have some fun 🎉",
  "data/ph-top/2021/12/smart-vc-search-by-unicorn-nest.json": "We've built an algorithm that analyses historical data of 38,000 VC funds and suggests relevant investors for startups (seed, round A, B and C). Fill in the questionnaire ➡️ Get a list of VCs (incl. decision makers) ➡️ Start investor outreach immediately 🚀",
  "data/ph-top/2021/12/zeroblur.json": "ZeroBlur is a 100% free Chrome extension to quickly blur sensitive information. Stop worrying about leaking sensitive data when delivering a product demo or a sales call. In few clicks you'll be able to blur any element or page area of any web app or website.",
  "data/ph-top/2021/12/around-3-0.json": "Around's radically unique video calls are designed to help hybrid-remote teams create, collaborate and celebrate together. Now comes with music and games for team bonding and connection. Try it for your next happy hour or co-working session.",
  "data/ph-top/2021/12/tella-for-chrome.json": "Tella for Chrome, the screen and camera recorder that makes your work look great. Record fully customisable, instantly shareable videos from anywhere in Chrome.",
  "data/ph-top/2021/12/albert-5.json": "Albert teaches cybersecurity basics to your team over Slack. The courses are short, dynamically customized for each employee, interactive, and sent all year long. That's why your team will love it.",
  "data/ph-top/2021/12/adobe-creative-cloud-express.json": "Creative Cloud Express (formerly Adobe Spark) makes it easy to get started with thousands of beautiful templates, plus assets for social media content, logos, and more.",
  "data/ph-top/2021/12/pretty-progress.json": "Pretty Progress allows you to add beautiful & personalized Countdown & Progress Bar widgets on your iPhone's Home Screen. Track and remind yourself about the important things on the device you use every day. Clear and convenient.",
  "data/ph-top/2021/12/the-battle-of-mars.json": "The Battle of Mars is a PVP NFT game where you can challenge each other and take your opponent's Martian away. 1. Mint a Martian (10,000 unique martians available) 2. Join a crypto faction 3. Challenge a friend and take their Martian away",
  "data/ph-top/2021/12/pilot-8.json": "Pilot provides payroll, benefits, and compliance for US-based companies with remote teams. Easily onboard and pay employees in 160+ countries and contractors in 240+ countries. Offering special pricing for Product Hunt users: pilot.co/producthunt",
  "data/ph-top/2021/12/carrot-4400273f-0d5e-4a81-a978-0f2477a39ad6.json": "Can’t keep track of the stuff you want to buy? Meet Carrot, the extension that automatically collects your carts as you shop. You can get back to products with a click, create shareable and gift-able collections, get price drop alerts, and it's totally free!",
  "data/ph-top/2021/12/commercebooster.json": "CommerceBooster is the first open-source, UI template for B2B eCommerce. It’s available for free on the Figma Community and optimized for commercetools and Vue Storefront. It literally saves months of work for anyone starting B2B eCommerce projects.",
  "data/ph-top/2021/12/christmas-design-assets-by-iconfinder.json": "Sprinkle up your seasonal content with these festive goodies. Here come the elves with a Christmas freebie full of design assets that are perfect for your holiday newsletters, presentations & social media posts.",
  "data/ph-top/2021/12/hiho.json": "HiHo is a face-forward social app for meeting interesting people and having great video conversations. With asynchronous replies and infinite threading, everyone can participate at any time. The app offers both public forums as well as private DMs.",
  "data/ph-top/2021/12/creativity-booster-by-alpe-audio.json": "No more writers block. Don't stay stuck wondering how to open your lesson, article or video. Automatically generate great opening hooks, stories and relevant examples about anything you want to teach or write about!",
  "data/ph-top/2021/12/magic-sidebar-by-blackmagic-so.json": "Magic Sidebar is the best browser extension for Twitter. Use it today and unlock insights you never knew about, communicate better with your audience, and build strong 1:1 relationships. Mobile apps for iOS and Android are also available!",
  "data/ph-top/2021/12/autocloud.json": "For anyone running workloads on AWS, Azure, and GCP, AutoCloud automates architecture diagrams, compliance checks, and drift detection. Explore insights using a 3D environment or by querying a GraphQL endpoint.",
  "data/ph-top/2021/12/ripple-13.json": "Ripple is a mood tracking app that helps people improve their mental health by getting rid of anxiety, depression, and toxicity. Just choose your satisfaction and energy level on a scale of 1 to 10. Ripple will translate your emotions and put them into words!",
  "data/ph-top/2021/12/face-swapper.json": "Forget about overused faces from stock photos. Forget about photos with an inappropriate license. Change faces or bodies and use them in ads, e-commerce, social media, education, glossy magazines, etc. Exceptional quality. Unrivaled resolution.",
  "data/ph-top/2021/12/multiversial.json": "MultiVersial is a daily newsletter with the latest in tech business in Spanish. Languages are still a barrier to accessing knowledge. A fun and simple newsletter that allows you to stay up to date, understand tech strategy, and grow professionally in 5 mins",
  "data/ph-top/2021/12/opal-c1.json": "We’re building Opal for anyone who’s primary connection to their job – their team, their employees, their customers – is through video calls. We want to make it easy for everyone to have a professional setup, with a single plug and play system.",
  "data/ph-top/2021/12/2021-looped.json": "Curious to know how you spend your time at work? 2021 Looped rounds up your calendar year and generates unique insights like time spent in meetings, the number of people met along with some other cool stats.",
  "data/ph-top/2021/12/detail-2.json": "Record and stream high-quality video with your Mac. Turn your Mac into a production studio with Scenes, multi-cam, and auto framing. Detail works with your iPhone, iPad, built-in webcam, or any other camera.",
  "data/ph-top/2021/12/virtual-event-chat-kit.json": "100+ polished screens coalesce into mapped-out flows so you and your team can jump into Figma and create your own custom event chat faster than ever. The sample app shows Stream's chat API, also free for personal use and small projects, powering the backend.",
  "data/ph-top/2021/12/pioneer-3-0.json": "We’re adding a new option to the Pioneer offer: 2% of your company for a $20k investment, in addition to all the existing benefits of becoming a Pioneer. We're also adding a monthlong trip to Silicon Valley with fellow founders.",
  "data/ph-top/2021/12/typewise-text-prediction-api-beta.json": "Add advanced text prediction and autocorrect AI to your software or platform in minutes with Typewise API (Beta): 🤖 Next-word and sentence prediction 🔤 Autocorrection (-75% typos) 🌎 Language Detection 😵‍ Emoji Search 🔒 100% Privacy, made in 🇨🇭",
  "data/ph-top/2021/12/nuka.json": "Hi, it's nuka.me! BBC featured & 3 times reddot awarded eternal stationery Reusable notebook & never-ending pencil It comes with an app that turns handwriting into digital Shipping started Oct. Currently sold out 6500/6500 https://nuka.me/buy/ with -30%, get one in Feb",
  "data/ph-top/2021/12/fanalyze-voice.json": "The SIRI for all your NFL Fantasy or sports betting questions. Ask questions about NFL statistics, player and team info, over/under predictions, odds, and more through your voice or text input.",
  "data/ph-top/2021/12/potential.json": "Potential helps you reclaim your attention and habits — giving you control over what you do, how you feel, and who you become.",
  "data/ph-top/2021/12/360-okr-examples-directory.json": "Goals are some of the hardest things for leaders and ICs to come up with. That’s why we’ve expanded our library to include over 360 goal and OKR examples, including contributions from G2, GitLab, and Privy.",
  "data/ph-top/2021/12/ngage-2.json": "Engage audiences for meetings & events throughout the year with live presentations, live polls, quizzes, Q & A, and word cloud. Build interactive slides with the easy-to-use online editor. Add live streaming to your presentations and gamify interaction.",
  "data/ph-top/2021/12/web3-army.json": "The 10% of global GDP (~$9.7 Trillion) will be on the blockchain by 2027. There's a whole new world to build and we need an army of ambitious professionals to make it. Web3Army helps you find the best opportunities to jump into the industry.",
  "data/ph-top/2021/12/heylogin.json": "Login management with a focus on user experience makes heylogin simple and convenient. Just swipe on your Smartphone and you can log into any of your web accounts with just one click. No more passwords needed.",
  "data/ph-top/2021/12/hackerrank-interview.json": "An all-in-one solution for remote technical interviewing. Simultaneously edit code, collaborate on virtual whiteboards, and access a sample set of interview questions all within your browser. No downloads required.",
  "data/ph-top/2021/12/amon-wallet.json": "Amon was founded by millennials who strive for a world where crypto & fiat co-exist. We make crypto services simple with our Amon Wallet, Amon Earn and the forthcoming Amon Card.",
  "data/ph-top/2021/12/songtastic.json": "Spotify Wrapped is everywhere showcasing our love for songs. But how well do you really know your most listened songs? Take Songtastic for a spin and get to know your score!",
  "data/ph-top/2021/12/odyssey-2.json": "Odyssey is a learning DAO on a mission to onboard the next 1 million people to web3. We've written quality ELI5 guides for intro to web3, DeFi, DAOs, NFTs, and more. Start learning now 👇",
  "data/ph-top/2021/12/podcast-cover-template.json": "You'll Have These When You Buy 😊 ▶ 101 Podcast Covers ▶ 101 Instagram Posts ▶ 101 Pieces Youtube Thumbnails Fully Editable Podcast Cover Designs Figma • Adobe XD • Photoshop (Comig Soon)",
  "data/ph-top/2021/12/eesel-extensions.json": "eesel is a filter on your browser history to just show pages relevant for work. It works with pretty much any tool. It runs locally, so your work never leaves your computer. A few months after our launch on Chrome, we’re now on Firefox too!",
  "data/ph-top/2021/12/project-shasta-from-adobe.json": "Project Shasta brings AI-powered audio recording and editing to the web, no download required. Now anyone can create audio that sounds professional, without needing to be a professional.",
  "data/ph-top/2021/12/250-trends-for-2022.json": "250+ trends for 2022 from 70+ recently released trend reports. ft: Accenture, Benedict Evans, Deloitte, Dentsu, Forrester, Forbes, Fjord, Gartner, Instagram, McKinsey, Next Atlas, Ogilvy, PWC, Pinterest, Springwise, Sparks & Honey, Trendhunter, Unity, & more.",
  "data/ph-top/2021/12/greety.json": "Looking for a special gift for Christmas? Simply fill out a form, attach a Youtube video and get a link to a video-based greeting card to surprise your friends and family.",
  "data/ph-top/2021/12/saas-advent-calendar-2021-1.json": "For each day of advent, unlock exclusive deals on some of the best French SaaS companies. Some you'll know, some you won't; but most of them you'll love. Come join Santa's slede and have some fun 😀",
  "data/ph-top/2021/12/havoc-shield.json": "An affordable, all-in-one cybersecurity platform built for small business. Get peace of mind through a dozen tools in one dashboard offering vulnerability scans, global password manager, antivirus/anti-malware threat protection, policy management and more.",
  "data/ph-top/2021/12/qrtoon-toonified-qr-maker.json": "Turn your boring QR codes into catchy artworks. No worries, they will still work the same way as your original codes. Just provide a QR code and a selfie and get ready to share its Toon version with everybody!",
  "data/ph-top/2021/12/hypervault.json": "Say goodbye to flat text “secure notes” to store anything that’s not a password. Hypervault offers the solution for businesses to securely store, share and organize many types of sensitive data, not just passwords. Great for IT, Devs, Agencies, and Startups!",
  "data/ph-top/2021/12/incoggo.json": "- ⛔️ Incoggo is a free adblocker for paywalls. Available for Mac, coming soon for Windows! - 📚 Automatically unlock news and articles for free and get easier access to news and information! - 🗞️ 15+ top pubs unlocked. Full list at go.incoggo.com/pubs",
  "data/ph-top/2021/12/paperback-3.json": "Paperback is a simpler and tidier alternative to wiki pages. Instead of burying stuff in deep hierarchies, it lets you create concise lists with your links, files, and notes. Then, people can actually find what they need, instead of asking around all the time.",
  "data/ph-top/2021/12/santa-hat-profile-pic-maker.json": "Celebrate 2021 Christmas by adding a Santa hat to your social media profile picture on Twitter, Instagram, LinkedIn, and Tiktok. We remove your background & add cool background images & effects automatically!",
  "data/ph-top/2021/12/getmails.json": "We hated cold outreach because most of the tools are either too complicated or they need a lot of other tools parallel to make the outreach work. So, we decided to simplify the cold outreach process for marketers. Welcome to GetMails Family ❤️",
  "data/ph-top/2021/12/webbag.json": "With the help of our product, you can no longer carry a heavy briefcase. Books, notebooks, diaries and tests will be available in just one click",
  "data/ph-top/2021/12/otpninja.json": "OtpNinja is a Plug and play Otp service for Apps And businesses who wish to add 2Auth layer and send code Verification By sms for their clients. The Api is super easy creates and send the code by SMS also send back to the app the Verification results.",
  "data/ph-top/2021/12/emailengine.json": "EmailEngine is a self-hosted application that opens IMAP and SMTP connections against registered email accounts to translate API requests to IMAP commands, send emails, and monitor changes on these accounts. It sends a webhook for every update on the account.",
  "data/ph-top/2021/12/travelcase.json": "Planning travel is hard, workations even more so. What if the top travel influencers planned your workation and vacation experiences? Blogs, too long Reels, too short Travelcase, just right Quick comprehensive guides to get you to your next destination!",
  "data/ph-top/2021/12/parrotbay.json": "ParrotBay provides a unique URL that you can execute any type of HTTP requests against it. allows you to inspect your HTTP requests, design webhooks, and mimic your entire backend endpoints with static and dynamic JSON responses.",
  "data/ph-top/2021/12/christmas-raffle.json": "You can easily organize a raffle via yilbasicekilisi.online, send matching results to participants' emails.",
  "data/ph-top/2021/12/osint-tool.json": "OSINT-tool.com is two things. 1) A website where you can look up things using either public available links, or your favorite enrichment provider via APIs and 2) a Chrome extension that allows you highlight text or images and enrich it using 1)",
  "data/ph-top/2021/12/5-minutes-daily-sketching-community.json": "Let your creativity flow with just 5 minutes of daily sketching. 👩‍🎨 Ideal for beginners, amateurs and hobbyists 🥳 A community of 4000+ folks to keep you motivated 🚀 Leaderboard, streak tracking 💡 New ideas, discussion and events",
  "data/ph-top/2021/12/edudo-2-0.json": "EduDo is a video discussion platform",
  "data/ph-top/2021/12/istock-inside-invideo.json": "iStock provides 5M+ premium stock videos and it’s now available inside InVideo. InVideo makes the user journey to create B-rolls or to just use stock videos 10X easier and cheaper",
  "data/ph-top/2021/12/crypto-for-charity.json": "Today, the vast majority of charities have no technical capacity to accept crypto donations. Crypto for Charity unlocks access to the $2+ trillion crypto market by making it safe, quick, and tax-efficient to donate to essentially any 501(c)3 charity in the US.",
  "data/ph-top/2021/12/sensorpad.json": "Event-based 💡 monitoring and 📈 reporting tool for cron jobs, data pipelines,CI & CD builds according to the rules you set up. You hardly need any programming knowledge to set up such monitoring.",
  "data/ph-top/2021/12/feedir.json": "Feedir makes it easy to find job listings on Twitter. From the click of a button you will be shown tweets from companies hiring today.",
  "data/ph-top/2021/12/ground-zero-2.json": "Return an app to the state it was in when it was first installed, without deleting the app. Fix issues and get back the default settings. Reclaim disk space by cleaning up data that would normally be left behind when uninstalling an app.",
  "data/ph-top/2021/12/mmmotif.json": "An SVG generator that makes it easy to generate patterns of shapes that have a 3D look and feel, thanks to isometric design.",
  "data/ph-top/2021/12/cofinds.json": "Find cofounders, founding team or other professionals by pitching your startup in 200 characters or less.",
  "data/ph-top/2021/12/apple-music-wrapped.json": "If you're an Apple Music user like me, you felt left out during Spotify Wrapped season🥲. Yes we had Replay but I think we all wanted a bit more. So in 8 days I built something much more fun and in depth😁Hope you enjoy!",
  "data/ph-top/2021/12/simfolio.json": "Simfolio is a tool that shows you how all your investment accounts will grow together to give you an idea of your future net worth. Along with projections, the app lets you compare your account performance to benchmarks.",
  "data/ph-top/2021/12/happyo.json": "Happyō is a completely new social experience - video platform uniting people through real life actions. To get your INVITE, download the app from the AppStore and press this LINK to register an account: https://ppa.happyo.app/share/invite/CQMTTD32",
  "data/ph-top/2021/12/crypto-as-a-service-by-mudrex.json": "With Mudrex’s Crypto-as-a-Service platform, fintech enterprises, super apps, portfolio management services, etc. can provide simple yet secure crypto exposure to their customers without worrying about the compliances and the technology.",
  "data/ph-top/2021/12/get-funded-with-finmark.json": "Finmark has partnered with dozens of the best early-stage investors across the globe to help founders get funded faster. Upload your pitch deck into Finmark and get matched with investors like Bessemer, Village Global, Draper & Associates, and more.",
  "data/ph-top/2021/12/modern-data-stack.json": "A platform for everything you need to know about the Modern Data Stack ⭐️ Companies & Categories shaping the Modern Data Stack 📚 Data stacks of the world's top companies 📖 Resources to get updates on the latest in this space 🛠 Jobs in data engineering",
  "data/ph-top/2021/12/ambire-wallet.json": "Ambire Wallet is the first DeFi cryptocurrency wallet that combines power with ease of use, solving common pain points of DeFi. Available on Ethereum, Polygon, Avalanche and BSC.",
  "data/ph-top/2021/12/samosabot-by-threado.json": "Gratitude is that thing we always love to feel more of & always feels great to give more of. So why not make it easier to do? We made this FREE Slackbot to help do that. SamosaBot by Threado is a fun, simple way to give gratitude in your Slack community.",
  "data/ph-top/2021/12/colorhuddle.json": "Meet ColorHuddle –&nbsp;a free collection of 11 hand-crafted, ready-to-use color palettes with a live landing page example. Simply click on any element on the page to copy its color 🌈",
  "data/ph-top/2021/12/vmaker-learners-hub.json": "A free platform that has the best tutorials for different software hand-picked from YouTube. Learners can now find the best videos without having to scroll through multiple videos and creators can increase their video reach for their content.",
  "data/ph-top/2021/12/punkscape-builder.json": "The imbalance is obvious: #PFP (profile photo) NFTs are everywhere. #PFBs (profile banners) are the next frontier. PunkScapes are a collection of 10.000 unique landscapes stored on the Ethereum Blockchain. Perfect as Twitter, Discord and OpenSea banners.",
  "data/ph-top/2021/12/tact-2.json": "Tact is a simple native chat app for iOS, iPadOS and macOS. It works with iCloud and does not require you to create an account — this means it is private and free of unwanted connections.",
  "data/ph-top/2021/12/alertss.json": "Simplicity always wins. Create subtle, but powerful popups that increase conversions without ruining user experience. Get more leads. Create more FOMO. Increase conversions in a few clicks.",
  "data/ph-top/2021/12/app-marketer-s-playbook-for-ios-15.json": "Filled with insights from industry-leading companies and experts, our latest guide covers everything you need to know about the new era of mobile growth in the App Store.",
  "data/ph-top/2021/12/flixgem-by-polymer-search-2.json": "We built the best way to find hidden gems on Netflix: 💯 Only top-rated movies and shows are included. No junk 🔍 The only way to explore thousands of attributes 🎥 Find highly-rated content that isn't so well-known Built with zero code using Polymer Search.",
  "data/ph-top/2021/12/herd-social.json": "Herd is a social platform that helps you find friends. Each week, we match members through their shared interests in a group chat & photo feed. We have 0 metrics, making it easy to express yourself authentically. The app is free to use globally on iOS.",
  "data/ph-top/2021/12/search-party-by-something-good.json": "Search Party by Something Good makes finding a Christmas movie together fun and fast.",
  "data/ph-top/2021/12/monq-aiops-platform.json": "Monq is the world’s only self-hosted freemium platform for automated data collection and analysis. It turns your observability into proactive monitoring, helping IT teams prevent possible outages while minimizing costs and efforts.",
  "data/ph-top/2021/12/slidekick.json": "Slidekick is your personal AI presentation assistant. It asks you a few questions about the slide deck you want to make and then creates it for you. This is a beta version. It has 1 use case: creating a startup pitch deck. More use cases will be added soon.",
  "data/ph-top/2021/12/hexometer-3-0.json": "Get 24/7 peace of mind and catch website issues before they impact your business.",
  "data/ph-top/2021/12/bouncebuster-by-overloop.json": "Bouncebuster is a real-time email verifier that helps you fight bounce & increase email deliverability. Verify email addresses before sending and protect your domain reputation.",
  "data/ph-top/2021/12/quest-nft-platform.json": "We have built a super-easy way for Creators, Brands, and Communities to create NFTs straight from your social media channels for free and in under 2 minutes!",
  "data/ph-top/2021/12/xtra-clipboard.json": "Xtra Clipboard is a developer-friendly clipboard manager that is super fast and easy to use. Everything you copy in your device can be found in the clipboard history. It smartly sorts texts, websites, and code snippets separately.",
  "data/ph-top/2021/12/clips-by-riverside-fm.json": "Clips is a way to transform your long-form content into multiple pieces of short-form content. Easily sharable on social media to reach more people with the same effort. You record once, we help you reach everyone!",
  "data/ph-top/2021/12/glitch-image-generator.json": "A generative tool which allows you to create and save unique glitchy images. ⚡️",
  "data/ph-top/2021/12/mindgarden.json": "Get 1% happier every day through daily gratitudes, mood checks & meditation that you'll actually stick with. Grow/collect beautiful plants and at the end of each month cultivate a beautiful calendar (your MindGarden).",
  "data/ph-top/2021/12/avda-find-jobs-careers.json": "AVDA is a mobile app that simplifies job placements by translating resumes into easy to comprehend data that can be filtered and searched while giving the user a modern day dating like experience all while helping to decrease downtime and save company's money.",
  "data/ph-top/2021/12/wishtender.json": "The safest and most flexible universal wishlist for content creators. Easily list items and get funds from fans. With WishTender you can: ✅ Get cash for your gifts ✅ Send photo thank-you messages ✅ 34+ countries Sex Worker Friendly!",
  "data/ph-top/2021/12/presentation-camera.json": "Make your presentations or screen recordings more engaging by showing yourself on your desktop. Record a YouTube video, remove background from camera footage without requiring a green screen. Keep focus on your face just like iPad's centre stage, but on Mac.",
  "data/ph-top/2021/12/fugue-3-0.json": "Finding the right music for a video can be challenging. And buying a proper license can be tricky. That's why the new Fugue comes with 5X more curated tracks and simple pricing. So you can get more music on a budget.",
  "data/ph-top/2021/12/outlet-finance.json": "The Outlet Finance app allows your to replace your bank account with a simple and easy to use crypto wallet that is designed for the non crypto person.",
  "data/ph-top/2021/12/newsly-2-0.json": "Newsly picks up the most trending topics on the web and reads them in a natural voice. Now you can follow any topic you can think of, be it NFT, Metaverse, or The Kardashians! The entire web becomes listenable! Now also with podcasts, read mode and weather.",
  "data/ph-top/2021/12/d2c-hunt.json": "D2C Hunt helps you find hundreds of brands Indian D2C brands ( Direct to consumer brands) you can collaborate with!! Saves you hundreds of hours of googling and scrolling through Instagram.",
  "data/ph-top/2021/12/bikespot.json": "BikeSpot.fr is a crowdsourced app for sharing and downloading GPS bike routes. Our mission: Allow riders discovering the unexplored and connect them together. Find your next ride on BikeSpot!",
  "data/ph-top/2021/12/elecjet-apollo-ultra.json": "Introducing Apollo Ultra, The World’s Fastest Charging Power Bank. Thanks to graphene enhancement, this 10,000mAh power bank charges itself at 100W in just under 27 minutes. You can even fast charge all of your devices with up to 85W of power.",
  "data/ph-top/2021/12/youtube-transcripts-2-0.json": "You wouldn't expect to rank highly on Google without SEO. - Video transcriptions are crucial for the YT algorithm to know what your video is about. Auto-generated ones don't count. - Get fast, accurate and cheap transcriptions to get you the views you deserve.",
  "data/ph-top/2021/12/pokoy.json": "App for Meditation. It uses your cognitive biases of time estimates and encourages you to meditate more often.",
  "data/ph-top/2021/12/fugo-tv-dashboards.json": "Until now, there have been few ways to share critical data across whole organizations at scale. TV Dashboards let you replace unnecessary meetings, interruptions, emails & link sharing by putting your data up on your workplace TV screens for all to see.",
  "data/ph-top/2021/12/homemovie.json": "HomeMovie brings back the nostalgia of the Camcorder with a twist. Create and record together with friends. As you capture the moment, you see all clips from everyone on the tape come in as they happen. It's a fun way to create memories together!",
  "data/ph-top/2021/12/glitche-nft-tool.json": "New version of Glitché is a perfect NFT-art tool with glitch-filters based on random data that cannot be recreated. Datamosh up to three videos from your camera roll or experiment with real-time recording.",
  "data/ph-top/2021/12/image-to-cartoon.json": "ImagetoCartoon is an online AI cartoonizer that could convert your face to cartoon or anime style. Not only make cartoon avatars but also emoji yourself. Powered by the best AI technology, you can convert image to cartoon in seconds.",
  "data/ph-top/2021/12/orgpad.json": "OrgPad is a universal tool. It is good for planning, brainstorming, presentations, storing information, but it's also good for long-term work like learning for an exam or tracking a project. At first, it'll remind you of Mind Maps but it's so much more!",
  "data/ph-top/2021/12/minulle.json": "minulle allows you to preview your YouTube thumbnails and titles on the home, search and the subscription page of YouTube. I challenged myself to build a SaaS app in just 3 hours and this is the result of that 🚀",
  "data/ph-top/2021/12/the-ultimate-mouse-mover.json": "This software allows you to simulate real mouse movements on your Windows PC! Most importantly you get the source code & guarantee virus-free! Don't worry anymore about your computer logging off or the work status changing. Stay always Online!",
  "data/ph-top/2021/12/icon-shelf.json": "Icon Shelf is a free and open-source SVG icon manager for web developers. Improve how you add icons to your frontend project. All your icons in one place, easily copyable as code.",
  "data/ph-top/2021/12/wagmi-cards.json": "Looking for a way to introduce your friends and family to the magical world of Cryptocurrency? This holiday season, use Wagmi.Cards to gift them some MATIC",
  "data/ph-top/2021/12/techspecs-vs.json": "Hello Product hunters, Stop comparing smartphones manually. Use TechSpecs AI technology to automatically compare and find the best smartphone.",
  "data/ph-top/2021/12/otis-house.json": "Otis House is a marketplace, auction platform, and vault for physical items, built on top of Ethereum. The physical items are stored, secured, and insured by Otis. We then mint an NFT for each item representing ownership of the asset.",
  "data/ph-top/2021/12/flickcall.json": "Flickcall is a privacy-focused browser extension to watch movies & TV shows together. Your personal chats & video stream are delivered directly to peers (without backend servers). Supports Netflix, Youtube, Primevideo, Hotstar, & Zee5.",
  "data/ph-top/2021/12/st0nk.json": "Hey Product Hunt, Swadesh is back with another gem of a drop. You can gift Indian stocks to your friends and family which will be a really interesting Christmas gift. It’s open to anyone in the United States right now!",
  "data/ph-top/2021/12/wikifox.json": "Wikifox (beta) is a clean and simplified version of the real Wikipedia! This works with official Wikipedia, so nothing to worry about!. It has a good and clean user interface with Dark, Light and custom themes! Check it out : https://wikifox.ml/",
  "data/ph-top/2021/12/rewalt.json": "Introducing rewalt - A community marketplace for all the unused rewards. Type of rewards/coupons: 1. Amazon Pay Rewards 2. Google Pay Rewards 3. PhonePe Rewards 4. Walmart/Target/Best Buy Rewards 6. All types of transferrable rewards/coupons",
  "data/ph-top/2021/12/bricks-design-system.json": "BRICKS is a full Design System, based on ! ♻️ Open source 🔥 50+ components 🎨 Design Tokens system 📚 Embedded Interactive documentation 🌗 Dark mode",
  "data/ph-top/2021/12/voiceliner.json": "The fastest way to capture and structure your thoughts: through voice. Hold record, speak, and release. Just like you'd expect from an outliner, create hierarchies and rearrange. Notes are auto-transcribed and searchable. Local-first and open source.",
  "data/ph-top/2021/12/flip-clock.json": "This is the web version of the famous flip clock that we see all over the internet",
  "data/ph-top/2021/12/deeplobe.json": "A no-code machine learning platform built to unleash the power of computer vision and automation. It's a smart, scalable, cost-effective ML API as a service platform that trains and integrates state-of-the-art machine learning and deep learning.",
  "data/ph-top/2021/12/1tagline.json": "Get advice from the great marketers who can help you craft catchy taglines for your product or article.",
  "data/ph-top/2021/12/chord-commerce.json": "Chord is a commerce-as-a-service software for fast-growing D2C brands. We offer a flexible (headless) tech stack for commerce companies that is fully equipped with sophisticated data insights for the optimal customer experience.",
  "data/ph-top/2021/12/momento-07d123f1-ae84-470f-bb5f-4053d3b75197.json": "Momento is a tool to help you take action. Your life is very precious so make it worth it.",
  "data/ph-top/2021/12/product-prediction.json": "I love generating ideas with GPT-3 and I had an idea to feed it with products created by the top (and my favorite) makers and then I told it to predict what their next projects will be. I thought the results were interesting!",
  "data/ph-top/2021/12/product-ideas-on-demand.json": "We leverage AI (with a human touch) to generate product ideas based on your interests, skills, and past projects.",
  "data/ph-top/2021/12/sendspark-for-linkedin.json": "See up to 4x more replies from LinkedIn outreach with video! Just install the Sendspark Chrome Extension to record and insert videos right from Sales Navigator and the LinkedIn message composer.",
  "data/ph-top/2021/12/notion-diary.json": "A simple application that bootstraps your notion pages to a blog site. No more complicated setups, users can simply log in and add database id, that's it. Moreover, user can add their social links to increase their reach. Showcase: https://www.notiondiary.xyz/lakshya",
  "data/ph-top/2021/12/pipecandy-prospector.json": "PipeCandy is now the only company that tracks all eCommerce companies with at least $10,000 annual revenue. With this launch, we also track 150,000 DTC brands.",
  "data/ph-top/2021/12/my-year-in-review.json": "myyearinreview helps you reflect on your year in a simple, guided and fun way",
  "data/ph-top/2021/12/writex-io.json": "Online editor with super powers. Customise your writing experience, build your Wikis, use power of AI analysis to check readability and phonetic quality, use extremely advanced spell check for more than 20 languages, export your books. Write smarter.",
  "data/ph-top/2021/12/postly-4.json": "With Postly you can write your Social Media Post once, and Publish it on the most popular social media platforms: LIVE PLATFORMS Facebook Instagram Twitter LinkedIn YouTube Pinterest TikTok Reddit COMING SOON WordPress WhatsApp RSS Feed",
  "data/ph-top/2021/12/tesla-version-11-0.json": "Introducing some of Tesla's most creative features, from a new Light Show function that lets you choreograph light shows to your own music, to new games and entertainment experiences, safety features, customizable controls and an all-new user-interface design.",
  "data/ph-top/2021/12/100daysofnocode-challenge.json": "Learn to no-code by committing to the 100DaysOfNoCode challenge. It has 3 rules: 1. Publicly commit 2. Learn to no-code for at least 30 mins every day 3. Share your progress Get free daily lessons straight to your inbox. Commit now. Start Jan 1st, 2022 ⚡",
  "data/ph-top/2021/12/scale-to-the-moon.json": "Find tools and services faster for your eCommerce business. Reduce 100+ hours of research time, 200+ tools at your disposal. Designed to help entrepreneurs, eCommerce owners or anyone setting out to start their own business.",
  "data/ph-top/2021/12/nativebase-v3-figma-kit.json": "A Figma design kit that emulates all of the utility props from NativeBase. Seamlessly integrate style guides, UI components, and pages into your web and mobile apps.",
  "data/ph-top/2021/12/article-to-audio-conversion-kit.json": "Convert articles, summaries or newsletters into high quality audio readthroughs tailored for memory and helping you get what you need to know faster.",
  "data/ph-top/2021/12/crypto-3d-icons.json": "It's a pack of custom 3D icons suitable for any crypto product. Create stunning, unique projects with these hand crafted icons, easily editable in Figma. 3D icons rock!",
  "data/ph-top/2021/12/baloonnft.json": "We are making NFT simple, for simple people. No wallet? No crypto? No problem! Mint NFT from real money.",
  "data/ph-top/2021/12/currsive.json": "Currsive is a platform that allows writers to write great engaging stories and lets users listen to the same! Even you can write and have your own audio blogs. You can also share it and embed it on your blog! What's stopping you? We are excited to listen!",
  "data/ph-top/2021/12/snakeplant.json": "Snakeplant is a growing collection of vector icons for Google Slides, starting with the Feather icon collection. Snakeplant is an independent project created by Neil Shankar (@tallneil).",
  "data/ph-top/2021/12/daily-prompt-web-app.json": "Make daily progress towards your writing goals.📚 Library of 1000+ writing prompts🗣 Give and receive feedback on how to improve📅 Make writing a habit and become a better writer🖥 On iOS and now on web!",
  "data/ph-top/2021/12/lockscreen-tasks.json": "See your tasks list on your lock screen. How to use it? - Add tasks to the list - Choose priority - Click on the device frame - Export - Set as Lock screen https://twitter.com/vyshnav_xyz/status/1475784509790601216?s=20",
  "data/ph-top/2021/12/makememe-ai.json": "With your text as an input, the AI system will select a relevant meme and overlay your text with hopes to give you and others a quick laugh. We hope you and your friends enjoy creating memes.",
  "data/ph-top/2021/12/kitchenful.json": "Kitchenful is an app for personalized recommendations of recipes that also gets you the ingredients delivered from a local grocery store. They offer the same convenience as meal kits do, but with better personalization at a lower price point.",
  "data/ph-top/2021/12/2021-shout-outs.json": "'Tis the time to express gratitude! So we are bringing Shout-Outs back! Highlight and celebrate makers and products that made 2021 incredible. Add your thanks and give recognition to those you appreciate.",
  "data/ph-top/2021/12/navi-5.json": "Navi brings transcription and live translation to FaceTime through SharePlay. The app opens FaceTime up to people with hearing impairments and other disabilities that prevent them from engaging easily in a video call environment.",
  "data/ph-top/2021/12/gelato-ops.json": "Gelato Ops makes it easy to automate arbitrary smart contract functions on blockchains like Ethereum. Create and manage automated tasks that act like cron jobs within seconds. Our decentralized, highly reliable bot infrastructure does the rest for you🍦 🤖️",
  "data/ph-top/2021/12/urbanpinion.json": "Citizens engagement platform that lets you create a landing page with an interactive map in just a few steps, launch a survey and collect citizens' ideas and votes - and make the right decisions for the city development.",
  "data/ph-top/2021/12/renett.json": "ReNett is a place for asynchronous group video messaging in communities. Think Reddit meets Snapchat. The new product includes a mobile app for video communication in communities ReNett and a video commentary plugin for websites ReCommentt.",
  "data/ph-top/2021/12/manyflights.json": "Are flight fares for your favorite destinations too high? 🤔 No worries, we’ll let you know when they go cheap 😊",
  "data/ph-top/2021/12/blobby.json": "Blobby is your cute buddy to help you develop healthy habits in the most important aspects of your life, with a strong focus on keeping balance. It uses the power of range-goals, lets you write a daily journal, and has a lot of great hairstyles for Blobby!",
  "data/ph-top/2021/12/remmo.json": "Remmo is an app that turns your iPhone or iPad into a remote control for your computer. Whether you have a Macbook or an iMac, we've got you!",
  "data/ph-top/2021/12/metaseo.json": "Generate meta tags in one click for the best SEO of your website, rank high in search results, and appear unique when someone shares your link!",
  "data/ph-top/2021/12/a-to-z-of-product-led-growth.json": "Learn how successful product companies leverage product-led growth. 💡 Learn the basic concepts 🚀 Product-led strategies 🌱 Grow organically without ads 🌍&nbsp; Real-World Examples of Product-Led Growth 🤖 Transition from Sales-led to Product-led",
  "data/ph-top/2021/12/colour-palette.json": "Hi, I am Saharsh. I am a 11 year old and have made this product. Pick up your favorite color palette and drop it into your CSS to match the latest design trends with ease. Colour palette is a collection of 75+ curated colors in a variety of styles. Enjoy!!!",
  "data/ph-top/2021/12/twttr.json": "Twttr streamlines your twitter surfing process by prioritizing user-friendly features.",
  "data/ph-top/2021/12/nocodez-2-0.json": "NoCodeZ creates web, IOS and Android apps using the power of AI. You write a business story. You answer questions about what you see in the app and how the app should work. Our AI automagically builds the apps for you with complete infrastructure.",
  "data/ph-top/2021/12/clipbox.json": "Clipbox is a modern, powerful clipboard manager with a rich feature set to help you type less and boost your productivity. Some features : • Copy text from anywhere on your screen • Paste consequtive items on the clipboard without copying them each time"
}