{
  "data/ph-top/2020/12/merico-build.json": "Like a fitness tracker for your code. Our contribution analytics empower devs with insight. Let the code speak for itself with dashboards & badges focused on self-improvement & career growth. See where you measure up & translate commits into insights.",
  "data/ph-top/2020/12/konsey-dev.json": "Konsey.dev is an application that allows you to manage all your advertising work for different platforms in one place. Currently you can manage your Facebook & Google Ads accounts +TikTok Ads is coming soon!",
  "data/ph-top/2020/12/edudo.json": "EduDo is a mobile learning platform with short user-generated interactive videos to watch on the go",
  "data/ph-top/2020/12/the-club-by-allcall.json": "A members-only club for COVID conscious trip planning and on demand recommendations, curated by our in-the-know community.",
  "data/ph-top/2020/12/background-remover.json": "Need to clip the background out of a photo to use on an e-commerce store or web design? No problem! Just upload your images to the background remover, and our AI will handle the rest. - 1-click simplicity - High-quality image masking - Bulk processing",
  "data/ph-top/2020/12/artify-illustrations.json": "A new release from the Artify crew featuring 5000+ unique illustrations available for download in high quality PNG files as well as vector sources, there are over 70 illustration styles from high quality 3D styles to minimalistic and abstract lines!",
  "data/ph-top/2020/12/radix-ui.json": "An open-source UI component library for building high-quality, accessible design systems and web apps.",
  "data/ph-top/2020/12/dlinks.json": "dLinks lets you build a decentralized profile on Web 3.0 in seconds. Built using Handshake and Sia: Handshake names are decentralized domains that no one can block access to. Skynet offers decentralized backend hosting that cannot be taken down.",
  "data/ph-top/2020/12/saas-advent-calendar-2020.json": "Chocolate is sweet but SaaS surprises are sweeter - and we have two a day! At the stroke of midnight SaaS Advent Calendar unlocks an exclusive deal from well-established SaaS companies as well as a free SaaS in beta that needs valuable feedback.",
  "data/ph-top/2020/12/improved-google-search-by-liner.json": "The fastest way to the smartest Google Search. 'Picked by LINER' is the most powerful assistant that will take your Google Search to the next level. Do not scan through all results. View only the pages selected by LINER. Available as browser extensions.",
  "data/ph-top/2020/12/qlo.json": "QLO is a browser-based interactive 3D tool to generate custom clothing mockups. Our 3D digital avatars can fit into your brand, just upload your design, adjust settings and download your images directly in your Browser.",
  "data/ph-top/2020/12/filterpixel.json": "FilterPixel is an AI desktop application that helps photographers to select photos faster. Get rid of your tedious, tiring & time-consuming photo selection process so that you can spend more time doing what you love.",
  "data/ph-top/2020/12/mailchimp-newsletters-widget-by-livechat.json": "LiveChat newest integration with Mailchimp helps you get in touch with your website visitors by displaying an interactive greeting that allows them to sign up to your newsletter list.",
  "data/ph-top/2020/12/prostyle-camera-by-neuralcam.json": "ProStyles is an AI camera app that edits your photos & videos in the style of pro photographers as you shoot them. The built-in Style Store features AI style models created by some of the best photographers out there.",
  "data/ph-top/2020/12/a-z0-9_-3-16.json": "/^[a-z0-9_-]{3,16}$/ is a podcast where Eugene Kudashev shares some tips and tricks and useful regular expressions for day-to-day work",
  "data/ph-top/2020/12/kudos-by-dailybot.json": "Kudos is the easiest way to celebrate wins with your team and align everyone around your core values. Create reward systems and encourage a culture of positive feedback across the company, right from your favorite chat platform.",
  "data/ph-top/2020/12/gumaffiliates.json": "Gumroad affiliation & referral marketing made simple: promote your products through affiliations & make your audience profitable! Gumaffialites is for you if: ○ You have a product and want to promote it ○ You have an audience and would like to monetize it",
  "data/ph-top/2020/12/company-in-a-box.json": "Company in a Box is a GPT-3 powered tool that creates compelling landing pages for your startup idea in seconds. Vet more ideas, focus on the ones that stick, and start collecting leads! Coming soon: deploy ads & plug in your own Typeform waitlist.",
  "data/ph-top/2020/12/photoroom-android.json": "In one tap, remove the background and compose an image that will showcase a product or a model. PhotoRoom is an image editing app that lets you capture, edit, and mix images by editing objects.",
  "data/ph-top/2020/12/ratio-4.json": "Ratio is an Android home screen designed to turn mindless distraction into mindful productivity. 3 screens with everything you need on unlock. No more endless switching between apps, use social media less and supercharge your productivity.",
  "data/ph-top/2020/12/axel-1.json": "Axel is a virtual assistant who helps you develop a culture of transparency and ownership in your team. You set up the right 1:1 and weekly check-in from templates in a few clicks. Our secret sauce: no need to add another tool, everything is done in Slack.",
  "data/ph-top/2020/12/makeena.json": "Makeena rewards consumers for buying “better,” while providing brands with real-time shopper insights. Our app captures all receipt data, as well as other engagements, while our dashboard provides brands access to that data to drive repeat purchase behavior.",
  "data/ph-top/2020/12/automatic-out-of-office-calendar-1.json": "Planning to take time off this holiday season? The automatic out-of-office calendar from Clockwise makes it effortless to coordinate with your team. Simply mark your calendar OOO and Clockwise will sync your availability to the shared team calendar.",
  "data/ph-top/2020/12/2020-year-in-review-by-codersrank.json": "A lot happened in 2020. Despite everything, developers coded, learned new stuff, deployed and debugged. Here are a few highlights from a year to remember (or, you know, forget).",
  "data/ph-top/2020/12/propel-4.json": "Join a curated network of rising stars who want to build the next big thing as founders or executives. Accelerate your career with access to ambitious peers, mentorship, events, courses, and much more.",
  "data/ph-top/2020/12/tomato-2.json": "Tomato 2 is a Pomodoro timer. It's simple, pretty and still pretty powerful– it has goal tracking, various modes of operation, website/app blocking and fun stats.",
  "data/ph-top/2020/12/delight-2.json": "The best way to help save local businesses is getting more people in the door. Delight is the simplest way to tell a friend about a business. - Find your favorite spot, send the link to a friend and we'll donate money to that business when they check it out.",
  "data/ph-top/2020/12/the-work-from-home-backdrop.json": "Does a bad backdrop mean your video calls, virtual dates and zoom meetings are letting the team down? Is your virtual backdrop failing to impress? The Work-From-Home Backdrop installs in seconds and instantly transforms your space into a dynamic domain.",
  "data/ph-top/2020/12/roadtrip-4.json": "Host a listening party, hang with friends or meet new people while listening to great music and building playlists together. Let’s make the internet a little less quiet. Come say hi.",
  "data/ph-top/2020/12/edith.json": "Edith is an open-source voice assistant for VSCode. Checkout : https://github.com/Navan0/edith",
  "data/ph-top/2020/12/save-the-world.json": "'Save the World' is a game for 3 or more people where players compete, collaborate and everything in between to save the world. The goal of the game is for everyone to agree on a solution to a randomly chosen disaster, like an asteroid strike.",
  "data/ph-top/2020/12/privacygrader.json": "PrivacyGrader.com provides an online assessment within 24 hours that measures how well a business’s website upholds consumer data protection laws, assesses privacy functionality, and highlights potential gaps and issues with the site.",
  "data/ph-top/2020/12/accountable-2-0.json": "Introducing Accountable 2.0 - the all new way to become HIPAA compliant. Designed to simplify the entire process of achieving and managing HIPAA compliance, from HIPAA training to policy management. And did we mention $100k HIPAA breach guarantee?",
  "data/ph-top/2020/12/monet.json": "Sometimes words just aren't enough... on Monet, send a drawing to make a new connection. :~)",
  "data/ph-top/2020/12/mywebar-2-0-1.json": "MyWebAR is the easiest way to build cross-platform augmented reality instantly available in a browser. Whether you are a professional developer or have no prior experience, we have the set of tools that will allow you to get started in the matter of minutes.",
  "data/ph-top/2020/12/flex-widgets.json": "Flex Widgets is the first real widget editor for iPhone and iPad. It allows you to build widgets freely by placing elements on them and then editing, moving, resizing and layering those elements. All in a super intuitive editor.",
  "data/ph-top/2020/12/welovenocode.json": "Need landing page in Webflow, web-platform in Bubble, mobile app in Adalo or an automation in Zapier? Don't spend time on learning NoCode platforms. With WeLoveNoCode you can send unlimited NoCode projects to a team of Nocode developers for a monthly fee",
  "data/ph-top/2020/12/fuel-fund.json": "Fuel fund showcases selected startups to 1000s of handpicked investors in the US. Think of it as a fund's demo day but asynchronous and massively scalable. When a startup lists on wantfuel.com, we forward their details to almost 5000+ investors on our rolodex.",
  "data/ph-top/2020/12/free-christmas-icons-in-3d.json": "12 illustrative Christmas icons in 3D. Available in large PNGs or source files in PSD and C4D. Free to be used for commercial or personal purposes. All we ask is to attribute Iconfinder.",
  "data/ph-top/2020/12/rally-18d5f31b-60d8-466a-afec-996b694d6e70.json": "A community of once rejected YC founders to share experiences, discuss less tedious ways to get funding, and alternate options to grow their business. Join to connect and learn with a group of motivated founders!",
  "data/ph-top/2020/12/5-years-of-design.json": "5 Years of Design is collection of beautiful, handpicked designs I've saved as inspiration and shared on my newsletter the past five years. Select a year, spot trends and find inspiration 🌌.",
  "data/ph-top/2020/12/30-second-dance-party.json": "Bring this unprecedented piece of engineering achievement home as the centerpiece of your life and home. ⠀ Now featuring 50% more dance party than 20 second dance party.",
  "data/ph-top/2020/12/momento-78e9df9c-1cfe-48b1-8654-585588dc836a.json": "Momento provide a powerful tool to help you manage your domains and SSL certificates to prevent you from forgetting. With Momento you can renew your domains, manage your DNS and buy new domains from all your registrars. Everything in one place.",
  "data/ph-top/2020/12/christmas-zoom-backgrounds.json": "We have you covered as you jingle all the way from your bed to the living room. Dress up your festivities with animated, illustrated, or traditional Christmas video backgrounds by Icons8.",
  "data/ph-top/2020/12/fresh-cards.json": "Finally, a flashcard app that just works—for iOS and macOS. Thoughtfully designed, Fresh Cards is a joy to use. Using a swipe interface, card review is quick and best of all, cards are auto-scheduled for review again based on how well you did.",
  "data/ph-top/2020/12/tunnels.json": "Tunnels is a text-based \"Choose-your-own-ending\" game set in a world post-apocalypse. --- It contains: - 21 hand-drawn illustrations - 9 main story endings - 3 unlockable side stories, each with 3 different endings --- Collect them all!",
  "data/ph-top/2020/12/gumdrop.json": "Gumdrop is a matchmaking community that values more than just looks. Go beyond text & pictures and discover people you vibe with on more than just a surface level. Come join the invite-only matchmaking movement. After all, it's who you are that counts.",
  "data/ph-top/2020/12/beacon-9.json": "Calculate a website’s environmental impact, see the breakdown and learn what measures can be taken to improve it.",
  "data/ph-top/2020/12/ethi.json": "Ethi helps you find out how Facebook tracks you across the internet, across the world, collects hundreds of interests about you and tracks your social life. Then we help you delete what you no longer want them to keep!",
  "data/ph-top/2020/12/flexipass-by-travelstride.json": "1 pass. 7 continents. 23 brands. Thousands of trips from luxury journeys to group tours to private adventures. One price. Zero risk. Lock in your travel dreams today with full peace of mind and flexibility. Cancel any time. Redeem by 2023. Save $600.",
  "data/ph-top/2020/12/404-page-inspiration.json": "Find your 404 page design inspiration! We've collected some of the best 404 page designs from around the web.",
  "data/ph-top/2020/12/fastdok.json": "Stop spending a lot of time searching templates for documents in multiple sectors including IT, Business, HR, Legal, Medicine, Education, and Finance. Use Fastdok to generate ready-to-use documents that work in minutes by answering a few questions.",
  "data/ph-top/2020/12/letterloop.json": "Letterloop lets you create private group newsletters with friends and family. Stay in touch, grow closer together, and discover things you never knew with the most important people in your life — all over email. ⠀ Get started at letterloop.co",
  "data/ph-top/2020/12/gsweets.json": "gSweets slash commands save you time, and keep you in a state of flow. Our first batch of shortcuts let you format text, add screenshots, and search emojis, GIFs, and stock photos. Add it to Chrome for free today. Designed to be 100% private.",
  "data/ph-top/2020/12/pc-builder.json": "PC Builder is a website which helps people build a list of compatible PC parts without getting into any compatibility issues. The website is created by keeping beginners in mind, and the main goal of this website is to make compatibility easy for everyone.",
  "data/ph-top/2020/12/tokkingheads-by-rosebud.json": "Instantly create photo-real avatars of friends, family, celebrities, paintings, by using any photo with a face! In one click, make them sing, say anything you want, puppet their face like you an Animoji. Check out our new holiday backgrounds too!",
  "data/ph-top/2020/12/1question.json": "1Question asks a quick study question before granting children access to their favorite apps...like sneaking vegetables into cake! Instead of complete restriction, 1Question creates unlimited opportunities for children to learn as they play.",
  "data/ph-top/2020/12/crowdfunded.json": "Crowdfunded provides a database with extensive data on 2,000+ crowdfunding campaigns. You can use it to understand customer demand, discover successful product categories, see what competitors are launching, and find promising product ideas.",
  "data/ph-top/2020/12/clothes-for-language.json": "A hilarious, practical, in-depth guide to typography for designers and authors.",
  "data/ph-top/2020/12/savetax.json": "Find a simple tax saving strategy that’s personalized for you in less than a minute. (Indian Tax Laws Supported Right Now)",
  "data/ph-top/2020/12/entry-dev.json": "Entry-level developer jobs from all over the web, in one spot.",
  "data/ph-top/2020/12/blueq.json": "Pick the change that matters to you. Personalize, email, print, or mail your greeting card in seconds — a meaningful gift that never disappoints.",
  "data/ph-top/2020/12/startup-valuation-nest.json": "Discover aggregate data on average startup valuations and revenue multipliers in 55 industry groups, based on real data sourced from 200,000+ deals. Learn who are the top VC investors in rounds like yours.",
  "data/ph-top/2020/12/retentionx.json": "RetentionX translates your data into clear actions. Take the best business decisions based on AI-driven data analysis and replace the power of an entire data science team with just one, easy-to-use tool.",
  "data/ph-top/2020/12/due-work-2-0.json": "- Team & Tasks&nbsp; - Notes & docs&nbsp; - Discussions&nbsp; - Feedback & Roadmap&nbsp; - Knowledge base",
  "data/ph-top/2020/12/testimonial.json": "Text testimonials look less authentic. Testimonial.to helps you collect video testimonials from your customers so you can better promote your product. You just share the link, and your customers can record their videos on any device, no login required!",
  "data/ph-top/2020/12/unubo-phase-zero.json": "Unubo makes it easy for you to track progress by bringing metrics from your favourite tools into one place.",
  "data/ph-top/2020/12/the-chartmogul-iphone-app.json": "Take your metrics on the go with our iPhone app! The ChartMogul Subscription Data Platform makes it easy to import your billing data and then analyze it like a pro with industry-leading subscription analytics.",
  "data/ph-top/2020/12/toast-log-2-0.json": "See errors, warnings, and logs as they happen on your site — without having to open the browser’s console. Find bugs you didn't know were there via notifications in toast format.",
  "data/ph-top/2020/12/open-source-stash.json": "'Open Source Stash', the easiest way to find the best open-source alternative for design, analytics, video and more. Building something extra-ordinary need not be an expensive affair while you begin a project, start with open-source and scale gradually.",
  "data/ph-top/2020/12/disk-space-fan.json": "- Disk Space Fan is a super-fast + easy to use disk space analyzer - DSF's utilises Master File Table (MFT) tech to deliver the fastest disk scan speeds - Other features incl smart space usage visualizations + powerful tools to identify big/duplicate files",
  "data/ph-top/2020/12/tech-expert-video-calls.json": "Hello, would you like to book a call with technology experts? Hacker Noon started a marketplace for on demand video calls with experts in programming, cryptocurrency, ux, remote work, outer space, startups, and futurism.",
  "data/ph-top/2020/12/producthunt-wrapped.json": "Hey you! Yes, you! You're part of the Product Hunt community! Whether you are making those great products, hunting the amazing ones, upvoting the ones you especially love, or just dicussing them - see how you impacted PH this year with ProductHunt Wrapped!",
  "data/ph-top/2020/12/fastival.json": "Fastival is an intermittent fasting app which supports you to take breaks from eating to feel healthier and lose weight. Intermittent fasting boosts your immune system by giving your body time to digest food better and in turn strengthen the body’s defenses.",
  "data/ph-top/2020/12/woofbuzz.json": "Is Woofbuzz just another dog training app? No. It is a full platform that will provide answers to ALL of your canine queries. Yes, we provide free behavioral content, all originally illustrated, but Woofbuzz goes a lot further than this.",
  "data/ph-top/2020/12/the-prediction-game.json": "A prediction contest for 2021, where the winner at the end of the year gets a fund with $1k invested at the beginning of the year 😬📈",
  "data/ph-top/2020/12/hashtag-slayer.json": "Researching hashtags is tedious, taking away time from engagement or content creation. Save time and find the best hashtags easily using the official Instagram API. Grow your account safely and easily. Reach more ideal clients with optimized hashtags.",
  "data/ph-top/2020/12/christmas-design-kit.json": "176 Customizable Figma Templates special for Product Hunt, Twitter, Facebook, Instagram and IndieHackers. Increase your engagement, celebrate the main event of the year together with your audience. Merry Christmas!",
  "data/ph-top/2020/12/free-3d-slam-illustrations.json": "Discover 16 free objects created with Cinema 4D. Virtual reality tools and other gadgets are embodied in volumetric graphics. Customize any object in Cinema 4D to get your perfect one. All elements are fully editable.",
  "data/ph-top/2020/12/timestripe-2.json": "Timestripe is a productivity app with multiple planning layouts and tools to manage goals, build powerful habits and organize your life. Here is a demo https://www.youtube.com/watch?v=b6DsADKrGnk https://youtu.be/EtJ6sDMCylo (4 minutes)",
  "data/ph-top/2020/12/spaces-a28ad742-d0f2-46ca-bb92-cb261f64103c.json": "Spaces provides a clean, distraction free writing environment with intelligent features. Create beautiful notes, add infinite tags & connect everything via backlinks, all in real time. Available on iPhone, iPad & Mac.",
  "data/ph-top/2020/12/honk-2.json": "Honk is the new way to chat with your friends in real-time, with messages shown live as you type! Fast, fun, private. Speak your mind and be yourself—it's a whole new way to chat.",
  "data/ph-top/2020/12/reslash-for-christmas.json": "Reslash is the most fun way to get together online. Recreate the feel of a Christmas party, virtually. Break away from the stress of zoom calls or the hassle of breakout rooms. It's time to celebrate and have fun this holiday season with Reslash!",
  "data/ph-top/2020/12/video-messages-from-canva.json": "Connect with your loved ones and create lasting memories, with video messages from Canva. There’s always an occasion to celebrate, create customized video messages by yourself or with a group and make every moment special.",
  "data/ph-top/2020/12/postpace.json": "Postpace is a productivity platform for writers, bloggers, marketers and teams to automate their topic research workflow and rapidly build a content brief. Postpace helps study a topic by analyzing the top 15-20 organic results from Google for any keyword.",
  "data/ph-top/2020/12/yak-tack-mobile-app.json": "We designed Yak Tack to help you boost your vocabulary in a matter of days. We use a simple, scientifically proven technique called spaced repetition to get people past the \"Ebbinghaus Forgetting Curve\" when learning new words.",
  "data/ph-top/2020/12/escapista.json": "Choose a channel and let your mind wander with the continuous stream of videos we handpicked from the best YouTube creators. Relax with the natural images and sounds while you work, put on your TV or invite your friends to watch together.",
  "data/ph-top/2020/12/sketchar-masks-for-snapchat.json": "The SketchAR Mask Editor lets our users make custom AR lenses on Snapchat in minutes. Tap “Create AR Mask” on SketchAR. You can fill in a special template expressively or step by step. Then, tap “Try Lens”. Finally, transfer the mask to Snapchat.",
  "data/ph-top/2020/12/contterio.json": "Contterio is a service where you can create unique cool designs for your content with the help of smart algorithms. And you can get all this in less than a couple of seconds. The number of templates for your content is unlimited because it is created instantly.",
  "data/ph-top/2020/12/how-bad-is-your-spotify.json": "Think you've got a great taste in music? Are you down with the latest trends? Consider yourself a bit of music connoisseur, ey!?..Well, let's see what this AI thinks about that! 🤖",
  "data/ph-top/2020/12/minimal-calendar-for-2021.json": "✨ It's a minimal calendar for 2021 ✨ You'll get 24 PDF files (white & black version) to print and hang on your office's wall.",
  "data/ph-top/2020/12/pizazz.json": "Pizazz helps you engage viewers and capture attention during video meetings in three simple steps - select a background, upload your slides and voila! Pizazz is FREE for the launch!",
  "data/ph-top/2020/12/aesthetic-icons-app-by-icons8.json": "Update your phones look with over 4,500 aesthetic icons made by pro designers and trending Dribbble artists. Our iOS app makes it easy to browse aesthetic themes and download any icon you want –from minimal monochromes to Futurama characters. Plus, it’s free!",
  "data/ph-top/2020/12/circle-15.json": "We make shapes that can talk. Shapes with personalities, with edges and corners.",
  "data/ph-top/2020/12/digital-stocking-stuffers.json": "Download all sorts of goodies you can email to friends and family. Don't stroll the mall, scroll the list. Save lives by staying home and emailing your gifts to your favorite bootstrappers, self funders and indiehackers.",
  "data/ph-top/2020/12/incharge-x-2.json": "InCharge X is the world's only 100W 6-in-1 keyring cable. Thanks to its 6 charging combinations, you can charge almost any device at super high speed. Available in a 5 foot long version, too!",
  "data/ph-top/2020/12/rolley-scooterson.json": "Rolley Scooterson is an award-winning intelligent electric scooter, easy-to-ride, energy-efficient, and fully controlled from your smartphone. With its AI-powered algorithms, Scooterson's app makes riding Rolley seamless and effortless.",
  "data/ph-top/2020/12/free-deca-ui-kit.json": "Clean and clear UI Kit with necessary stuff to create design projects. It’s the simplest way to work with buttons, charts, inputs, and popups with saving huge amount of time. Let your workflow become pleasant and trust such things to Deca UI Kit.",
  "data/ph-top/2020/12/linvo.json": "Are you lazy? Don’t have time for Linkedin? Meet Linvo. Linvo allows you to grow your network faster to achieve your goals more quickly. Instead of getting five connections every day and five messages. You get 80 connections every day and 80 messages.",
  "data/ph-top/2020/12/snapsmile.json": "SnapSmile is an app that uses your eating habits + images of your teeth to provide you with the insights, and recommendations you need to improve your oral health at home. Think of SnapSmile like your own Dental Coach.",
  "data/ph-top/2020/12/3d-hand-gestures.json": "This is my first 3D illustration pack, I've prepared 15 3D hand gestures in cartoon style that can be used for user interfaces, social media posts, presentations, infographics and banners.",
  "data/ph-top/2020/12/deepfake-christmas-ongratulations.json": "We made deepfake save simple and legal for you 🙂. So now you can have fun with this technology. Try more than 30 templates with 12 voices. Send to a friend a parody Merry Christmas greeting from celebrities 🤣🎉",
  "data/ph-top/2020/12/public-apis-3.json": "Find public API for your next projects!",
  "data/ph-top/2020/12/looxie-2.json": "It's easy: go on the map, tap on another user, and send them a request for a photo! Gallery uploads are not allowed, so any photo they send will be taken on the spot, which means extra fresh photos on delivery!",
  "data/ph-top/2020/12/unloved.json": "Imagine selling off all those annual subscriptions you don't use anymore and can't refund. We help you do exactly that. In a nutshell - unloved is a platform for buying and selling pre-owned tech subscriptions.",
  "data/ph-top/2020/12/samplescope.json": "🔎 Samplescope is free simple tool to aggregate audio samples from the Internet.",
  "data/ph-top/2020/12/scanly.json": "Scanly aims to help small businesses fight the pandemic. Free, fast, simple and user-friendly digital menus with QR codes should make business safer and increase sales by 20-40%.",
  "data/ph-top/2020/12/jumpr-2.json": "Jumpr is the world’s first AR jump rope! Simply place your iPhone upright on the floor, Jumpr uses AI-powered body tracking to detect your movement and give you a virtual jump rope on the screen to begin skipping away!",
  "data/ph-top/2020/12/9-questions.json": "9 QUESTIONS 24/7 Live Youtube stream quiz game. Rounds of 9 Questions. 15 seconds for each question. You can play with a team or solo. A relaxing quiz game experience. Thousands of quality questions.",
  "data/ph-top/2020/12/thank-you-for-reading.json": "Reading and gaining knowledge shouldn't be a chore. Get one weekly Substack email digest from your favorite Substack writers.",
  "data/ph-top/2020/12/brainie.json": "Brainie uses music patterns to help your brain be more focused or relaxed. Designed for deep work to achieve flow or for relaxing sessions when you need to recharge. You can switch to different music patterns with different tempos to fit your needs.",
  "data/ph-top/2020/12/guided-annual-review-by-reflection-app.json": "Look Back On Your Year Our guided annual review helps bring perspective and closure to the past year before you dive into the year ahead.",
  "data/ph-top/2020/12/snipp-in.json": "Snipp.in is a tiny in browser notes taking interface and snippet manager built for speed. Without any bs the app stores everything just inside your browser without even having you to sign up.",
  "data/ph-top/2020/12/lose-the-very.json": "Write concisely by substituting \"very\" + \"adjective\" with a more concise adjective that has the spirit of very contained within it.",
  "data/ph-top/2020/12/case-4.json": "Showcase your talent! A simple and free online portfolio for designers. Made by a designer for designers. 😊",
  "data/ph-top/2020/12/blanc-mask.json": "🖤 Blanc is the one and only full-face mask to protect your eyes, nose and mouth from the outside world, make sure you breathe fresh and clean air thanks to its 2 high-efficiency HEPA filters. Keep your identity safe and fit your outfit.",
  "data/ph-top/2020/12/placement.json": "Placement is Everyone's Talent Agent. We help people get jobs through modern technology plus human support. Fly through your job search at Placement.com.",
  "data/ph-top/2020/12/podpage-1.json": "Podpage makes it easy to create a podcast website with just a few clicks. Every page is optimized to be found on Google and stays up-to-date forever. No technical knowledge necessary.",
  "data/ph-top/2020/12/flipp-2.json": "Imagine all the money we could unlock by selling subscriptions that we bought but don't really use anymore. flipp is a platform to post your pre-owned subscriptions for sale. we already have 500+ users interested in buying pre-owned subscriptions at unloved.",
  "data/ph-top/2020/12/stackwhats.json": "Chat with website visitors via WhatsApp chat. Get a free Live WhatsApp button for your website! Increase leads by 200% or more.",
  "data/ph-top/2020/12/easyqr.json": "https://easyqr.menu/ is a fully self-hosted, all-in-one QR Code Stores platform. ☑️ Online payments via Paypal, Stripe ☑️ Integrated proper analytics ☑️ SEO ready, lightweight and performant store pages ☑️ Highly customizable store pages and many more..",
  "data/ph-top/2020/12/payrequest-2-0.json": "PayRequest makes it easy to create your own branded payment page, and to send payment links to all your customers.",
  "data/ph-top/2020/12/ioon.json": "IOON is an innovative technology that helps you turn drinking water into a sanitizer with help of silver particles. It is safe for kids, pets, people with allergies and can be even used on food. It’s portable, stylish and you can recycle it!",
  "data/ph-top/2020/12/qooore.json": "Easy-to-understand smart-insight investment tool that innovates the trading market, brings together investing education resources with coolest designs for Millennials and Gen Z.",
  "data/ph-top/2020/12/boost-ctor.json": "A variety of copy templates for different industries (E-commerce, SaaS, Travel, Content, Finance, Fashion etc) specifically designed for your needs (Welcome, Free Trial, Newsletters, Feedback, Account Upgrade, Anniversary, Announcement, Consent, Offer etc)",
  "data/ph-top/2020/12/fuckin-kill-it-calendar-2021-edition.json": "The Fuckin' Kill it Calendar is an evidence-based motivational cum productivity tool designed to force you to finish a task everyday. The Fuckin' Kill it Calendar is designed to break your procrastination habits by forcing you to complete one task everyday",
  "data/ph-top/2020/12/refcareer.json": "- Ref Career is a tool to maximise your chances of getting referred to an opening in any firm looking for candidates. - Get in touch with employees currently working with the firm willing to refer a potential candidate for the job opening.",
  "data/ph-top/2020/12/hacker-news-front-page-explorer.json": "Hacker News Front Page Explorer is a database of Ranked Hacker News Front Page posts. Some Example Use Cases:- - find ways to rank your post on the Front Page - discover top trends in HN Community. - build an App using this data",
  "data/ph-top/2020/12/tappity-4.json": "Tappity is building the world’s largest library of interactive lessons for kids—starting with science. Find 100+ popular science topics taught by live-action characters who appear to magically interact with your kids in real time.",
  "data/ph-top/2020/12/malist.json": "Malist – simple browser extension that takes your email book to a browser. Whenever you need somebody's email, simply click the button in the toolbar and get the email. No more need to ask for an email over and over again or to search in the contact book.",
  "data/ph-top/2020/12/linkish.json": "Turn your browser bookmarks into embedded cards and watch YouTube/Vimeo videos, listen to audio, see images, read articles and more right from one dashboard. Now offers : • Nested folders • Link shortener • Saving links as PDF • Highlighting text on web",
  "data/ph-top/2020/12/storylines-by-fundstory.json": "Use StoryLines to track milestones and funding events throughout your funding story. As your StoryLine grows, share your progress on social or publish it our StoryLine directory.",
  "data/ph-top/2020/12/2021-simple-calendar.json": "Simple Calendar is a calendar that gives you more clarity and efficiency. Choose from 10 different styles of your choice today.",
  "data/ph-top/2020/12/blowup-2020.json": "This is a custom minecraft server and every time someone writes fuck 2020 into the twitch chat or clicks the button on the website, it will add a 🧨 TNT block to the block text 2020.",
  "data/ph-top/2020/12/x-planet.json": "Derived from the concept of planet rotation and all things of cosmos, The X Planet, an exquisite car freshener, is ingeniously designed in the shape of a planet.",
  "data/ph-top/2020/12/meteostat.json": "Meteostat is a meteorological database which provides historical weather and climate data for thousands of weather stations and places worldwide. The project features a convenient web app and data interfaces for developers.",
  "data/ph-top/2020/12/the-alpha-ace-ev.json": "The clean, uncomplicated lines of classic European sports coupes like the BMW 3-series and Alpha Romeo Giulia are something that's been sorely missing from EVs for at least a decade. This changes with Alpha's ACE.",
  "data/ph-top/2020/12/referrer.json": "Help your friends get a job by embedding a widget on your website where you point visitors to your friends for jobs that you're not available for. Create your widget in the online generator and embed it on your website using an iframe. It's as simple as that.",
  "data/ph-top/2020/12/zenml-1.json": "Ever spent hours training ML models only to have them crash and burn in production? ZenML is here to help. Track metadata, compare results, and scale to the cloud. It’s open-source, extensible, and integrates with battle-tested MLOps tooling off-the-shelf.",
  "data/ph-top/2020/12/the-abacus.json": "In the information age, access to global networking is a basic human right. We made the Abacus because the world deserves an affordable & biodegradable PC that is made with the same care and craftsmanship as a Mac.",
  "data/ph-top/2020/12/notelet-2.json": "Write in Notion, publish to the web. Add custom domain, analytics, themes and more.",
  "data/ph-top/2020/12/feenancy-3d-icons.json": "Feenancy is a pack of custom 3D icons suitable for any fintech product. Create stunning, unique projects with these hand crafted icons, easily editable in Figma, and fully customizable in Cinema 4D. 3D icons rock!",
  "data/ph-top/2020/12/culturely-2.json": "Culturely empowers your people with better culture to improve performance and enhance organizational growth. It also brings managers and employees together using 🎯 OKRs, 🎭 1:1 Meetings and other best-in-class tools.",
  "data/ph-top/2020/12/250-trends-for-2021.json": "250+ trends for 2021 from 35+ recently released trend reports. - ft: Adobe, CB Insights, Deloitte, Facebook, Fjord, Forrester, Frog, Gartner, Google, Hootsuite, Hubspot, Isobar, JWT, Pinterest, PSFK, Springwise, Trendhunter, Trendwatching, We Are Social, WGSN.",
  "data/ph-top/2020/12/what-to-sell-online.json": "Stuck finding a winning product to sell online? We have some ideas for you. By Productbyte.co",
  "data/ph-top/2020/12/privacy-hunt.json": "Privacy policies and data request forms SHOULD be easy to find, but many companies hide them deep in their UI. Privacy hunt is a simple, free, crowd-sourced repository to reduce that to 1 click! 😁 Find a company, click on the link, and reclaim YOUR data. 🙌",
  "data/ph-top/2020/12/buddio.json": "Buddio is a mental health app to help support with depression, stress, and anxiety. Developed by software developers and psychologists based on the principles of science-backed therapies.",
  "data/ph-top/2020/12/thruhikes.json": "A growing list of long distance hikes around the world.",
  "data/ph-top/2020/12/the-startup-s-gambit.json": "To quote Netflix's Queen's Gambit \"Chess isn't always competitive. Chess can also be beautiful.\" The Oxford Companion to Chess lists numerous openings that involve all kinds of wild tactical play. Find out which one best captures your startup’s strategy.",
  "data/ph-top/2020/12/launch-2530c773-14b9-404b-9ef2-401b8f35a284.json": "Launch is the place to discover #nocode tools and products in a product hunt style website. New tools and product are hunted daily by the #nocode community. A project by NoCodeDevs!",
  "data/ph-top/2020/12/hal-2.json": "Say hello to Hal - Easy as texting your friend, powerful as your grandma advise.",
  "data/ph-top/2020/12/virtual-ghost-writer.json": "A simple application that allows you to generate various copy with just a prompt. Its use ranges from summarizing long text, answering questions, completing thoughts and writing articles. The tool is powered completed by OpenAI's GPT-3 algorithm.",
  "data/ph-top/2020/12/validated-ideas-2-0.json": "A list of 9,000 badly executed products and apps. Are you looking for project ideas? Then this list could be useful to you. - 2,599 iOS Apps - 1,226 Chrome Extensions - 240 Web Apps (from ProductHunt) - 4,999 Android Apps Airtable access + JSON files",
  "data/ph-top/2020/12/record-webcam-screen-share.json": "Record Screen or Webcam and Share instantly. No need to install any application. Just super fast recording and share. Live Streaming Feature to be added very soon. Super fast recordings to give feedback to your team, education, creating product demos.",
  "data/ph-top/2020/12/year-of-colour-2020.json": "How colorful was your Instagram in 2020? Get an interactive report about the most prominent colors you've shared in your posts throughout the year. Discover your personal or brand palette or reconnect with your most colourful experiences. Now on iOS & Android.",
  "data/ph-top/2020/12/niceboard-2-0.json": "Niceboard is the easiest way to start your own niche job board business, without writing a single line of code. Set up your board in minutes, connect your own domain, view real-time application stats, backfill jobs, translate it, use the private API and more!",
  "data/ph-top/2020/12/picturethis-2-0.json": "PictureThis® identifies 1,000,000+ plants every day with 98% accuracy-better than most human experts. Get your gardening questions answered and become a “green thumb”! Simply take a photo of the plant and PictureThis answers all the questions for you!",
  "data/ph-top/2020/12/profitable-design-apps-database.json": "Insights report and database of 60+ hand-curated profitable design apps. This database and report will save you hours of researching and collecting data about design apps",
  "data/ph-top/2020/12/gumroad-university.json": "Gumroad University is a curated collection of interviews, challenges, guides, documentation, and workshops, designed to help creators get inspired, create something fantastic, and bring it to market sucessfully."
}