{
  "data/ph-top/2022/5/live-stream-polls.json": "An interactive tool to engage your audience. Easily customize a poll with predefined answers to get fast responses from viewers. Users use comments or FB reactions to vote, while the results are calculated in real-time and presented with cool visualizations.",
  "data/ph-top/2022/5/expplore.json": "Explore is a powerful Facebook™ Ads intelligence tool that allows you to target hidden Facebook™ Ads interests by using the latest AI-enabled technology that your competition is not aware of, and create massive ROI on every ad campaign!",
  "data/ph-top/2022/5/array-builder.json": "A free tool to visualize the output of array operations Provide an array, write code inside map/reduce/filter blocks & see the results live in the adjacent column. It simplifies writing blocks of code & debugging chained operations",
  "data/ph-top/2022/5/leadmonk.json": "First online appointment booking software in the market which lets your customers book time with you using their mobile number or email address without the back-and-forth emails or messages.",
  "data/ph-top/2022/5/snipli.json": "Ever wanted to share a file of your codebase and had to copy and paste the content and create a new GitHub gist? Presenting Snipli, a minimal command-line interface to create GitHub gists of your local files at blazing fast speeds ⚡",
  "data/ph-top/2022/5/weavit.json": "We suffer from information overload in a world filled with noise and yet we need to surface knowledge 'fast'. With so many productivity apps out there - why are none able to capture thoughts messily and organise them intuitively? Well...say hello to Weavit.",
  "data/ph-top/2022/5/outcode-2.json": "Outcode is a data platform for your team. Its databoard enables you to work with data and workflow components directly from any data source in a flexible, integrated, and collaborative manner.",
  "data/ph-top/2022/5/the-digital-dogs.json": "Digital Pets are interoperable, persistent-State, NFT-secured companions, utilizing AI technologies to improve people's mental health and well-being in Virtual environments, inspired by real-life Dogs' social and emotional benefits for human beings.",
  "data/ph-top/2022/5/product-strategy-of-a-great-saas-product.json": "Learn how successful SaaS products of this decade disrupted the market with their product strategies. 💡&nbsp; Learn the 3 elements of a product strategy 🛠 &nbsp; Know about the best practices in defining your strategy 🌱 Product strategy of the company",
  "data/ph-top/2022/5/no-code-builder.json": "No-Code builder is a tool built for solopreneurs, dreamers and builders who have ideas that they want to execute but can’t find the right tools to build on. Use this tool so that you spend less time thinking and more time building.",
  "data/ph-top/2022/5/tableful-2.json": "Tableful is an application designed primarily for frontend developers who want to connect their application to a backend or some database, but do not want to waste time developing a backend.",
  "data/ph-top/2022/5/storekeep-io.json": "Store Keep provides 100% Colorado based mom and pop style support for your customers."
}