{
  "data/ph-top/2021/7/tl-dv-for-google-meet.json": "Link your meeting minutes to the exact moment in your video recording & transcript. Instantly share the important takeaways, fully contextualized. Works with your favorite async collaboration app & CRM. Catch up on meetings in minutes.",
  "data/ph-top/2021/7/attrack.json": "Straight forward time tracking app for those who appreciate the flexibility, and likes to have a choice. AtTrack’s modular architecture gives the opportunity to select and use only the functionality which is essential to your work and business.",
  "data/ph-top/2021/7/smartwriter.json": "😱 Generate personalised emails that get you 8x more replies with 1-Click. ✅ Never waste time researching or writing 'personalised' emails again. ⚡Automate your entire outreach process. 🔝Build 1000s of Backlinks, Personalise LinkedIn Outreach & Book Meetings",
  "data/ph-top/2021/7/glyph-neue-icons-by-icons8.json": "1,500+ monochrome icons in the universal Glyph Neue style. Simple yet catchy icons with a high level of detail will look great everywhere: from modern high-res screens to indoor and outdoor navigation. Use for free, but set a link to Icons8!",
  "data/ph-top/2021/7/brickit.json": "1. Scan your pile of Legos 2. We'll show you what you can build with the bricks you have. 3. Choose the idea that catches your fancy and follow our handy instructions.",
  "data/ph-top/2021/7/pixel-hunter.json": "Pixelhunter is a smart image resizer for media publications. Our AI adjusts pictures to the best quality to fit the most popular dimensions on media platforms. It recognizes objects and crops pictures automatically to streamline your needs on media platforms.",
  "data/ph-top/2021/7/telegram-to-notion.json": "The Telegram Bot to keep your flow productive; send anything to the chat and the content will get saved directly in your Notion",
  "data/ph-top/2021/7/around-for-ios-android.json": "Stay connected with your team on the go with our mobile app, an audio-first experience optimized for walking meetings. Join or start an Around call, instantly handoff from computer to phone (and back), react or respond to conversations with chat messages etc",
  "data/ph-top/2021/7/uxpin-and-storybook-integration.json": "Design and development have never been closer! Try out UXPin and Storybook integration and design with the same UI code components that developers use to build products. Enjoy full interactivity of elements and prototype 10x faster.",
  "data/ph-top/2021/7/expose-3.json": "Expose is a fully open-source tunnel solution that allows you to create public URLs for local sites through any firewall. Receive webhooks on your machine, test local sites on mobile devices or share them with others",
  "data/ph-top/2021/7/readbit.json": "A text-to-speech audiobook reader and summarizer that saves you hundreds of hours of reading. Upload or scan books and documents, get their key points, characters, and places chapter by chapter, and listen anytime, anywhere!",
  "data/ph-top/2021/7/dell-ultrasharp-webcam.json": "Turn every angle into your best angle with a webcam engineered with a powerful 4K camera featuring a large 4K Sony STARVIS™ CMOS sensor.",
  "data/ph-top/2021/7/wheel-of-life.json": "The Wheel of Life enables you to take a closer look at the 12 most important categories of life, while also maintaining a birds eye view. Stop feeling overwhelmed, get ahead of life and figure out what's important to you. Identify pros + cons, goals and tasks.",
  "data/ph-top/2021/7/music-rooms-by-presence.json": "Jam together with your remote teammates by listening to music together w/ quick spontaneous voice chats 📻",
  "data/ph-top/2021/7/notiv-notetaker.json": "Meet Better. Stay on task with automatic action items, highlights and summaries based on real-time transcription. Notiv is a collaborative meeting app to help teams save time and drive business outcomes.",
  "data/ph-top/2021/7/maker-swipe-file-1.json": "As a maker, building a Twitter audience will help you meet new people, get feedback on your product and makes sales. This free resource contains 100+ high performing tweets by fellow makers so you can get started or keep building your audience.",
  "data/ph-top/2021/7/triage-timeline-by-linear.json": "An issue tracking tool that levels up as you scale. Linear streamlines complex processes including roadmap planning and issue triaging. Customize your workspace with automated workflows and integrations for customer support.",
  "data/ph-top/2021/7/dollo.json": "Create your own avatar, mix and match skin color, hairstyle, eyes, clothes, accessories, and more. Over 300&nbsp;customizable components. Compatible with&nbsp;Sketch, Figma, SVG, PNG.",
  "data/ph-top/2021/7/notion-gratitude-journal.json": "Launching Notion ‘Gratitude Journal’ to write down all the things you are grateful for: Features: 💡A motivating quote at the beginning 💭Recurring lists to fill in grateful thoughts 📃Archive section to view lists for the past week/month Get it Now 🔥",
  "data/ph-top/2021/7/gpt-j.json": "GPT⁠⁠-⁠J-6B, a 6 billion parameter model trained on the Pile, is now available for use with our new codebase, Mesh Transformer JAX.",
  "data/ph-top/2021/7/everyhour.json": "everyhour increases your awareness of how you spend your time, tracks your life balance and helps uncover your unconscious priorities.",
  "data/ph-top/2021/7/mydone.json": "✅ Organise all your business streams, from development to HR to marketing ✅ Manage tasks for each stream separately ✅ Overview status on each level",
  "data/ph-top/2021/7/moderncloud.json": "ModernCloud is a browser-based, open-source serverless platform that lets you build your endpoints and functions in minutes, with a fast and super-friendly UI. We support inline editor with auto-complete support for Python and NodeJS. Based on Terraform.",
  "data/ph-top/2021/7/live-audio-rooms-by-facebook.json": "Live Audio Rooms on Facebook enable you to discover, listen in on and join live conversations with anyone about topics you’re interested in. Any listeners in the room can be invited to be a speaker in advance or during the conversation.",
  "data/ph-top/2021/7/volant-ai.json": "Save time and money in AI model development. Our marketplace uses the crowdsourced expertise of data scientists to empower anyone—be it a Hacker, Kaggler or Small/Medium Business—to build with AI using high-performing AI models, faster and cheaper than ever.",
  "data/ph-top/2021/7/remote-planning-poker-on-jira.json": "Agile planning & estimation tool. Quickly estimate user stories while having fun with team in Jira Agile Planning Poker session",
  "data/ph-top/2021/7/reddit-list-2.json": "Reddit is an amazing source of information. But finding the right subreddit to follow can be time-consuming. Reddit List makes your life easier in this regard.",
  "data/ph-top/2021/7/uxmeter.json": "There are more examples of good web design than Apple's website. At UXmeter we showcase top website designs from finance to sports. These are ranked purely based on UX design by industry professionals & general public using universal scoring system UX Points®.",
  "data/ph-top/2021/7/sitapp.json": "Slouching in front of a computer all day isn’t great for your body and over time can lead to lots of issues. SitApp monitors your posture in real time and reminds you to sit up straight when you start to slouch.",
  "data/ph-top/2021/7/traveledmap.json": "By using TraveledMap, we allow you to make customizable maps for your travels thanks to the use of markers, routes and photos, which you can share or add on your website if you are a travel business (in white label if needed) or on your blog.",
  "data/ph-top/2021/7/emoji-4.json": "3d emoji. Add emotions to your project with large set of high quality illustrations. Big variety of icons from smiling to rainbow and robots. Fully customisable. For Figma and Blender",
  "data/ph-top/2021/7/buzzer.json": "Never miss the next moment. Follow your favorite sports stars and teams and get notified when the next comeback, buzzer beater, or last second shot is about to happen. Then tap in and watch it live. Only on Buzzer.",
  "data/ph-top/2021/7/7todos.json": "The Blessing and The Curse Working on multiple projects can be a blessing and a curse. You want to find out what works out in the world. Keeping track of everything is hard 😵‍💫 Let 7todos help you to get an overview 🦄",
  "data/ph-top/2021/7/smart-text-editor.json": "Smart Text Editor is a vanilla JavaScript PWA that allows you to work on your coding projects from any device, in any browser, even if you don't have Internet access. Want to edit HTML files in real time, right from the browser? Open it with Smart Text Editor!",
  "data/ph-top/2021/7/intch.json": "Intch is a networking tool based on mutual help and collaboration rather than random meetings. Join the networking space that allows you to help and get expert assistance, introduce and be introduced to people that matter, and manage your network!",
  "data/ph-top/2021/7/schema-api.json": "View the internet through the eyes of Google, and extract structured metadata from any webpage in JSON/LD format as standardized by Schema.org with simple and extremely easy-to-use API. Try it today for free at https://schema.api.page",
  "data/ph-top/2021/7/systeme-io-3.json": "A free all-in-one marketing platform that's simple, fast, and intuitive. Run your entire business in the same place without any tech knowledge or developers. https://systeme.io/",
  "data/ph-top/2021/7/floral-zebra.json": "Floral Zebra allows Clubhouse users to have a text conversation over audio chat. Upvoting system shows the most interesting and important questions or comments, so no more boring events and questions. Floral Zebra - Add color to monotonous events.",
  "data/ph-top/2021/7/faketweetmaker.json": "Ftm helps memers to make and download tweets for free. Just type in the tweet and press download. No extra hassle!!",
  "data/ph-top/2021/7/notion-finance-tracker-3.json": "- Bird Eye will let you see the total balance of all your accounts. The Final Amount is calculated automatically. Only the initial Amount should be entered by the user. - Detailed will give the full details on where you spend the money and when you spend it.",
  "data/ph-top/2021/7/170-gpt-3-resources.json": "For the past few months, I am working on collecting all the GPT-3 related resources, that includes, tweets,repos,articles, and much more. By now, the resource count have reached almost 170+ and thought of putting this valuable database to public and here I am.",
  "data/ph-top/2021/7/developer-typing-game.json": "Developer typing game is a platform where developers can train their coding typing speed and accuracy, they get to listen to lofi music while typing, and the top 10 fastest developers will be featured on the landing page.",
  "data/ph-top/2021/7/d2desk-web-based-remote-access-app.json": "Web-Based Remote Access Application the All-In-One solution for remote Access/Support D2Desk helps as time tracking & productivity monitoring software for your business.",
  "data/ph-top/2021/7/listiee-1.json": "Listiee is your platform for broadcasting any kind of lists. Published Lists can be personalized & customized for it's category, geographical reach, privacy, contribution etc, Join us for sharing your lists, building new audience & connecting with people.",
  "data/ph-top/2021/7/making-things-more-brilliant-the-guide.json": "So you see a solution to a problem. Perhaps it's a product that you sell, a painting idea, or something completely different. But how to iteratively make it more brilliant? Inspiration comes and goes. Our methods last.",
  "data/ph-top/2021/7/renderro.json": "Use high-performance cloud desktops for your everyday video editing, graphic design, and animation tasks. Collaborate with your team effortlessly by sharing media and resources.",
  "data/ph-top/2021/7/gamify-your-life.json": "Turn your workspace into a... → Highly functional system that motivates you to complete goals and tasks on time. → Engaging feedback loop that rewards you for building strong habits. → Exciting multiplayer experience you can share with your family.",
  "data/ph-top/2021/7/streets-of-food.json": "Street food is finally getting the recognition it deserves. Discover and navigate to the world's best street eats with our trusted guides. http://www.streetsoffood.com",
  "data/ph-top/2021/7/windowswap-2-0.json": "WindowSwap: Open a new window somewhere in the world. A global community sharing the view from their windows to brighten someone’s day, somewhere in the world. WindowSwap is currently used by thousands as a way to relax, reflect, focus or for travel inspo.",
  "data/ph-top/2021/7/vuetify-for-figma.json": "A huge Design System for Figma, based on Vuetify, one of the most used Vue UI frameworks",
  "data/ph-top/2021/7/parrity-2-0.json": "Parrity 2.0 - A growing collection of free business books from top academic institutions & business writers readable directly in your browser. No additional apps, readers, or downloads.",
  "data/ph-top/2021/7/clayio.json": "3D App icons set for personal devices and commercial projects. Feel free to use them as your home-screen refreshment or asset for next commercial project.",
  "data/ph-top/2021/7/massager.json": "Relax with our vibrating app. Choose from a variety of phone vibration settings. Enjoy strong vibration for especially tense places and use it as a back massager or loosen up the rest of your body on the relaxing mode.",
  "data/ph-top/2021/7/virtual-window-by-virtualvacation.json": "Virtual Window by VirtualVacation is a webapp that lets you experience views from windows around the globe. Window viewing is an everyday occurrence. Whether that be from the office, or your house, Virtual Window lets you expand your reach on the world. ✨🌎",
  "data/ph-top/2021/7/droplet-5.json": "Audio creators don’t have a platform to share. That's why we've built Droplet. Droplet is an audio social media app where users can create and consume audio content in the form of 5-60 second sound bites, ‘Drops’.",
  "data/ph-top/2021/7/tinybird.json": "Tinybird helps data teams deliver real-time answers at scale through analytical API endpoints that take minutes to build.",
  "data/ph-top/2021/7/unspun.json": "After being heads-down for months on our first app, we're excited to officially launch our public beta today & we're hungry for feedback! :) If you're willing to give it a go today, we'll build you custom jeans for less than what it costs us to make them. 🤓",
  "data/ph-top/2021/7/100-mesh-gradients.json": "Download 100 free mesh gradients to make your website look beautiful!",
  "data/ph-top/2021/7/lemlist-3-0.json": "lemlist allows you to create warm relationships with your target from day 1 thanks to ultra-personalization, multichannel campaigns and the best deliverability of the market.",
  "data/ph-top/2021/7/springverify.json": "SpringVerify’s advanced background screening solutions help employers streamline and automate their hiring process. Integrate your HR systems with our robust API seamlessly in hours, not days. Tailored background checks for modern enterprises and startups.",
  "data/ph-top/2021/7/similar-inc.json": "Similar is an AI powered Chrome Extension that has the ability to make any page on the internet shoppable. Similar finds the best prices, coupon codes and lets you wishlist anything with a click.",
  "data/ph-top/2021/7/remotion-2-0.json": "Bring your hybrid team to life, right on your desktop. Connect like everyone's together and include your remote teammates with quick calls, hybrid music rooms, emoji badging, live selfies, and more.",
  "data/ph-top/2021/7/rrweb-1-0.json": "Today we are very happy to annouce rrweb 1.0 is general availability! Highlights: - Support record same-origin non-sandboxed iframe. - Support record open-mode shadow DOM. - Implement the plugin API. - Very detailed recipes for developers.",
  "data/ph-top/2021/7/removal-ai-for-desktop.json": "Remove background from multiple images in a single upload straight to your desktop using Bulk Photo Background Remover for Windows/Mac: ✅ Drag & Drop Images ✅ Optimize Product Images ✅ Select Background ✅ Set Image Size ✅ Exceptional Cut-out ✅ API access",
  "data/ph-top/2021/7/tailwindcss-buttons.json": "A copy & paste collection of TailwindCSS buttons. Browse through this collection of awesome and unique buttons and use them in any of your upcoming or exiting TailwindCSS project 😉",
  "data/ph-top/2021/7/venus-dashboard-builder-for-figma.json": "Create awesome dashboards with less effort directly in Figma! The first easy-to-use Dashboard Builder for Figma with more than 25+ widgets/cards that allows you to design dashboards quickly with world-class standards out-of-the-box. 🔥",
  "data/ph-top/2021/7/loot-2.json": "Loot is a one-click chrome extension that pops up with discounts right at the checkout page to help you save on software purchases. Simply put, Loot helps you not overpay for software. Loot has 150+ software discounts, and more are being added daily.",
  "data/ph-top/2021/7/moko.json": "Store graphics and animations in cloud folders for usage in presentations, online projects, and prototypes by your team. Change the colors and size of the animation in the app and export them to various formats under specific links.",
  "data/ph-top/2021/7/super-agent.json": "Super Agent fills out cookie consent forms based on your preferences, saving you time and letting you take control of your privacy.",
  "data/ph-top/2021/7/dailybot-2-0.json": "DailyBot is a chatbot that runs daily stand-ups, check-ins, tracks team motivation and promotes collaboration. Version 2.0 comes with a fresh design and hot features 🔥 — Forms, Pomodoro, Watercooler, Countdown, ChatOps/workflows, and more.",
  "data/ph-top/2021/7/blockman.json": "VSCode extension - Blockman. You can customize block colors, depth, turn on/off focus, curly/square/round brackets, and more... Supports Python, Dart, Rust, Swift, R, Go, PHP, JavaScript, JSX, TypeScript, TSX, C, C#, C++, Java, HTML, CSS and more...",
  "data/ph-top/2021/7/weferral.json": "Weferral provides all the tools needed to start, manage, and grow your affiliate program. Weferral affiliate management software is simple, powerful, and easily customizable based on your needs",
  "data/ph-top/2021/7/aircart.json": "aircart makes it really easy to sell an ebook, app, design files, album or any digital product you can think of fast and easy using only your paypal account.",
  "data/ph-top/2021/7/universal-data-visualization-1-0.json": "Universal Data Visualization is a high-quality tool for creating charts and infographics in Figma. Easy way to visualize your data in seconds.",
  "data/ph-top/2021/7/discover-2-0-by-route.json": "Introducing Discover 2.0 by Route. A new way to connect with products and brands that you'll love.",
  "data/ph-top/2021/7/social-tags.json": "Social Tags is a tool you can use to quickly generate essential meta tags that makes your website even more presentable and thus boosts social media engagement.",
  "data/ph-top/2021/7/typedream.json": "✨ Build a page quickly through a familiar Notion-like interface and focus on content ⠀ 🖼️ Beautiful & modern defaults that make any website look good with minimal effort ⠀ 🏃 High performing static pages and optimized images powered by NextJS on Vercel",
  "data/ph-top/2021/7/papaya-global-2.json": "Hire fearlessly with our total people, payroll, and payment management solution. Papaya Global supports all types of global employment (payroll, EoR, and contractors) in over 140 countries. Provides a unified solution, from onboarding to on-going management and cross-border payments.",
  "data/ph-top/2021/7/inodash.json": "Inodash helps you validate early-stage startup ideas with the right strategies and tools on Notion & Miro. New strategies to be renewed 🧠 Resources 📚 Chance to get feedbacks from mentors 💬 Access to the community of founders 🌐",
  "data/ph-top/2021/7/y-combinator-co-founder-matching.json": "Find a high-quality co-founder on our platform of 4500 founders. Tell us about yourself and your preferences and we’ll show you profiles of your ideal candidates. If there’s mutual interest, we match the two of you.",
  "data/ph-top/2021/7/palettehq-2.json": "No more spreadsheets, no more headaches. PaletteHQ is a SaaS platform that makes it easy for B2B companies to calculate sales commissions and boost sales performance. Motivate your sales team thanks to clear goals and immediate rewards!",
  "data/ph-top/2021/7/multicolor-illustrations-by-scale.json": "Scale 2.0 now offers high-quality multi-color illustrations that can be customized using our ready-made color swatches or even your own preferences! Of course: - It is totally FREE - Requires NO attribution - A NEW illustration will be added each day",
  "data/ph-top/2021/7/workflows-by-approveit.json": "Approveit presents the most anticipated tool - Workflows, a new way to build and manage your team's approval workflows in Slack. Create your custom approval workflows in Slack with a simple yet powerful visual builder.",
  "data/ph-top/2021/7/self-test-by-ahead-app.json": "Unconscious bias – the Dunning Kruger Effect – is responsible for our misconception of believing we are better at things than we actually are. ⠀ Use this test to figure out how good you really are at receiving feedback, convincing others, staying calm, etc.",
  "data/ph-top/2021/7/deed-3.json": "Deed's platform helps companies like Airbnb and Stripe retain employees by doing good deeds. Employees can find good causes to share their money, time, and skills with, while employers can match, measure, and share that impact with the world.",
  "data/ph-top/2021/7/notion-knowledge-automation-by-back.json": "Let your company wiki work for you and give employees easy access to the information they need. Back uses policies and how-tos from a Notion database of your choice to deliver instant answers directly in Slack, Teams, or Google Chat.",
  "data/ph-top/2021/7/instachamp.json": "The world's first Instagram-approved direct messaging & engagement tools. InstaChamp drives Instagram growth and engagement through direct message automation for Creators, Coaches and B2C Brands.",
  "data/ph-top/2021/7/koji-2-0.json": "Koji is the world's most powerful Link in Bio, with hundreds of free apps to customize and monetize.",
  "data/ph-top/2021/7/freelancer-tools.json": "A curated list of the best tools that you may need as a freelancer on your journey. The list will be regularly updated with new links that are worth checking out.",
  "data/ph-top/2021/7/300-excel-templates.json": "An ultimate pack of professionally curated list of Excel templates. Our library of excel templates includes some of the most powerful and user-friendly tools you can find. Every template is free to download and use!",
  "data/ph-top/2021/7/jestor.json": "Jestor is a no-code tool for COOs that need to scale their operations fast. - Build your own App to manage people in the field. - Create automations with a few clicks (Slack, Gmail and more). - Connect all processes with powerful workflows. Don't wait, make.",
  "data/ph-top/2021/7/sequel-by-runway.json": "Professional video editing powered by machine learning. Masking, VFX, color correction, generation, and compositing — all in your browser.",
  "data/ph-top/2021/7/instakin.json": "InstaKin’s marketplace enables immigrants to easily connect & transact with vendors back home (pay home bills, send gifts, hire runners etc.). We already helped thousands of Pakistani migrants & now expanding to more communities in the US. Secure & convenient.",
  "data/ph-top/2021/7/howbout.json": "Organising plans sucks...so we fixed it. Howbout is a free iOS & Android app that lets you: 🥳 easily organise any social plan ⏰ instantly find when you're all free 📅 share calendars with friends 💬 chat on every event 📫 invite anyone on or off the app",
  "data/ph-top/2021/7/glitch-instant-database-starters.json": "Glitch lets you build a real, full-stack web app instantly powered by databases like SQLite, Cassandra (using DataStax Astra), or even Airtable. Everything's configured, ready for you to share with your team or add a domain and be running in a minute.",
  "data/ph-top/2021/7/codility-51acb2ad-d281-4052-abc6-f731482e4030.json": "Codility is a technical skills assessment platform that helps test your candidates’ real-life coding proficiency and problem-solving abilities, enabling you to make evidence-based hiring decisions with ease.",
  "data/ph-top/2021/7/breaking-equity.json": "Platform built for retail traders to design, develop, test, analyze, and run their algorithmic trades for stock and options. Hedge fund grade tools with ease of use and at your fingertips.",
  "data/ph-top/2021/7/inappstory.json": "Give the audience personalized storytelling via in-app Stories. Add widgets or games. Gather unique insights and analytics to boost in-app engagement and improve conversion rates. ⠀ 😻 In-Stories https://inappstory.com/s/5jls00o game begins. ⠀ Share screenshots in the comments 🙀",
  "data/ph-top/2021/7/petcube-bites-2-lite.json": "Affordable pet camera that allows pet parents to watch, talk to, and treat pets remotely by tossing their favorite treats. All controlled with an app.",
  "data/ph-top/2021/7/forest-admin-for-partners.json": "Share subsets of your internal tool with all your external partners through Forest Admin for Partners. No hassle, easy to set up, and ready for all your data management and operational needs.",
  "data/ph-top/2021/7/uxproof.json": "Create an excellent design with the help of experienced designers who are ready to provide you their feedback on your prototypes.",
  "data/ph-top/2021/7/algolia-recommend.json": "A robust & flexible API to build unique product recommendations into any digital ecommerce experience.",
  "data/ph-top/2021/7/cove-identity-your-safe-space-online.json": "The internet can be a dark place, but you can rest easy with our military-grade end-to-end encryption. You'll be able to control your digital identity and have one less thing to worry about!",
  "data/ph-top/2021/7/hostman.json": "💡Hostman automates all the heavy lifting for developers ✔️Connect your repository, deploy, and watch your app go live 🔥Don’t overpay for servers when you’re not using their full capacity - pay for the number of servers you need, deploy as many apps as you want",
  "data/ph-top/2021/7/readian-news.json": "Readian lets you stay up to date with what is happening around the world, to learn new skills and to find relevant information for your work, by granting you access to unlimited amount of news and useful articles from anywhere you wish it to be from.",
  "data/ph-top/2021/7/podcast-transcription.json": "✍️ Super simple, fast & accurate podcast transcription. Completely free.",
  "data/ph-top/2021/7/learners.json": "Learners is a community of people willing to share their knowledge through P2P mentoring. Register, find a mentor, and grow!",
  "data/ph-top/2021/7/digger.json": "AWS is hard. Digger makes it simple by automatically generating infrastructure for your code. Deploy containers, webapps and functions in one click. Easier than Heroku and 2-10x cheaper. Customise with Terraform under the hood. Use your AWS free credits!",
  "data/ph-top/2021/7/sizze.json": "Sizze is no-code solution for creating a mobile application. You will finally be able to convert your design into code React Native from Figma with ease and build logic of app without losing quality. Now front-end application is in the hands of designers.",
  "data/ph-top/2021/7/znaplink-2-0.json": "Say Hello to Znaplink. Connect audiences to all of your content with just one link. Znaplink is the launchpad to your latest video, article, recipe, tour, store, website, social post - everywhere you are online. Znaplink is 100% free, forever.",
  "data/ph-top/2021/7/livekit.json": "LiveKit is free, open source infrastructure for building and scaling real-time audio and video experiences in your applications. Use our APIs to easily build audio-only spaces, live classrooms, in-game video chat, collaborative screen sharing, and more.",
  "data/ph-top/2021/7/mumu-x.json": "Mumu finds your emoji faster with synonyms, so you don’t have to remember the emoji name when searching.",
  "data/ph-top/2021/7/hackmd-4.json": "HackMD is where your short-term and long-term memory live together. Since launch, more than 3,000,000 notes have been created and more than 13,000 teams have been collaborated in HackMD.",
  "data/ph-top/2021/7/sideit.json": "SideIt is an online tool made to make your life easier. You don't need to open huge apps like Photoshop or Canvas just to merge images. You can do it with just 3 steps, online, and for free.",
  "data/ph-top/2021/7/the-gen-z-guide-to-freelancing.json": "The by creatives, for creatives guide to starting and elevating your freelance business. Created by Continuum.works",
  "data/ph-top/2021/7/swipe-de6c1efc-c839-404e-85f6-438aec561038.json": "Swipe is an app that lets Indian small business owners manage invoices, inventory, and taxes without the need of accountants. We replace paper processes and allow to share the bills on WhatsApp along with payment options to collect payments faster.",
  "data/ph-top/2021/7/pay-as-you-go-vpn-paygvpn.json": "Pay As You Go VPN provides a cost-effective solution to the waste of money problem in subscription-based payment models. Subscription model charges you the same amount of money even when you never use the service, while PAYG model only charges you for what you use.",
  "data/ph-top/2021/7/kodex-2.json": "Kodex is the easiest way for companies to process, and respond to, information requests from governments and law enforcement all around the world. The most common requests include preservation holds & subpoenas for user data from agencies like the FBI.",
  "data/ph-top/2021/7/windframe.json": "Create TailwindCSS websites using a No code drag and drop builder in record time. Windframe gives you the ability to build TailwindCSS websites using a drag and drop interface with immeasurable customization options, preview your designs and export the code.",
  "data/ph-top/2021/7/daisho.json": "Daisho is No-Code Data Science for Business Users and Problems. Select the problem you want to solve and point at the data: Daisho does the rest. Daisho automatically does the math, so you can focus on BUSINESS INSIGHTS.",
  "data/ph-top/2021/7/prest.json": "We are on a mission to make the process of new business development faster by making data access fast, secure and scalable. We want to reach a world where access to large volumes of data is simple without complex software development!",
  "data/ph-top/2021/7/wellput.json": "Export your favourite Kindle highlights with Wellput. Review them in your personally organised library and stick the important ideas in your mind.",
  "data/ph-top/2021/7/shortski.json": "Mac OS keyboard substitution's for most useful thing's like URLs, emojis, icons and etc.",
  "data/ph-top/2021/7/scoby-social.json": "Discover, Host & Join Live Sessions! The world is going live. Shared experiences have the power to transform, surprise and delight. If you are passionate about your calling, love engaging with others, and are ready to rise to your destiny, you belong with us.",
  "data/ph-top/2021/7/glass-ui-generator.json": "Get started with this free CSS generator based on the glassmorphism design specifications.",
  "data/ph-top/2021/7/awesome-peers.json": "Awesome Peers has a curated list that includes 900+ people who are waiting for you to meet for free!",
  "data/ph-top/2021/7/pitch-bear.json": "Database of 1500+ early stage startup investors looking for their next investment opportunity. Complete with verified contact information.",
  "data/ph-top/2021/7/scenic-background-animations.json": "This is one of our favourite illustrations packs! Scenic Background Animations comes with 21 beautiful scenes from around the globe. Each scene comes with a day, sunset and night animation - totalling to 63 animations & illustrations.",
  "data/ph-top/2021/7/notion-library-2.json": "A Free Notion Book Tracking Template to keep track of your books and manage all the related aspects. 📚Mark books as favorite 🔎 Archive books 🔖Sort books by genre, language 🧾Track reading progress 📔Keep a dictionary of unfamiliar words Get it now🔥",
  "data/ph-top/2021/7/praxis-2.json": "Ever wondered if you’re training correctly when you practice with your favorite YouTube coach? Try Praxis and get a self view (no more missing mirrors at the gym!) with Skeleton Overlays that track your movements and show you your alignments in real time.",
  "data/ph-top/2021/7/droyd.json": "⚙️ Let https://droyd.io/product-hunt run your reporting. Follow metrics & goals in Slack. 🙌 Connect your apps (CRM, Billing, Warehouse...) in minutes, sync your key metrics or goals and build reports. ✅ Schedule automatic updates to Slack or email and follow progress as a team!",
  "data/ph-top/2021/7/browser-kit-for-figma.json": "Browser Kit is a set of components for getting screenshots onto your Figma designs. Screenshots go from your browser directly into your design file, all thanks to the magic of Figma components. All major browsers supported; mobile and desktop included; Win/Mac",
  "data/ph-top/2021/7/nintendo-switch-oled-model.json": "The new system features a vibrant 7-inch OLED screen, a wide adjustable stand, a dock with a wired LAN port, 64 GB of internal storage, and enhanced audio.",
  "data/ph-top/2021/7/dashboard-server-by-squaredup.json": "If you're an IT pro and want an enterprise dashboarding tool that's quick to implement, easy to set up, and effortless to maintain, you need SquaredUp Dashboard Server! You can connect to anything and get powerful visualizations fast.",
  "data/ph-top/2021/7/epsilon3.json": "Epsilon3 makes complex operational procedures easy, saving operators time and reducing errors. Think of it like supercharged checklists and version control (like Asana + Github), tailor-made for teams with complex workflows and tracking requirements.",
  "data/ph-top/2021/7/sparkstudio.json": "SparkStudio.co teaches Art, Music & Communication through 1:4 (teacher:student) live classes; along curriculum designed by experts/artists. - 100% Online - Minimal parent involvement - Kids create in & outside class - Individual attention + friendships!",
  "data/ph-top/2021/7/2themoon.json": "Look what you would have earned if you started investing a year ago 💵",
  "data/ph-top/2021/7/bypass-paywalls-2.json": "Bypass annoying paywalls across the web with a simple browser extension available for free on Github.",
  "data/ph-top/2021/7/focus-dude.json": "I made this simple Chrome extension to block a listed website so I can stay focused 🧘‍♀️ when I'm working with my computer on the web. 🌈",
  "data/ph-top/2021/7/music-widget-for-apple-music-on-macos.json": "Music Widget is a remote app for Apple Music on macOS. It's a take on the original iTunes Widget introduced with Dashboard in Mac OS X 'Tiger' back in 2005. Music Widget looks extra sharp on retina displays because most of its interface is drawn in code.",
  "data/ph-top/2021/7/hipcv.json": "hipCV is an online resume and cover letter builder tool.",
  "data/ph-top/2021/7/find-your-first-frontend-job.json": "Learning to code is just the first step. Finding a job is often much harder. The competition in the software development market is fierce. We get over hundred CVs for one junior position. To find a job you need to stand out. This book will help you do it.",
  "data/ph-top/2021/7/frido-2.json": "Frido is a to-do app designed to free you from the burden of creating endless to-do lists you eventually give up on.",
  "data/ph-top/2021/7/colorgizes-by-alphabag.json": "Colorgizes is a color tool powered by Alphabag. It is designed for layman use for building color palettes. People can manage their color palettes on the mobile with simple steps.",
  "data/ph-top/2021/7/readstack.json": "Save the latest stories, news, articles you want to read later in your Readstack Reading List. When you finished reading - just swipe it to remove. Readstack is designed to bring you zero-stress and zero-procrastination reading experience",
  "data/ph-top/2021/7/project-adulthood.json": "Ever feel like two kids in a trench coat pretending to be an adult? You're not the only one. Project Adulthood is a weekly newsletter with tips and tricks on how to be a grown up, covering everything from budgeting to cooking to investing. 🎉",
  "data/ph-top/2021/7/livestream-panels.json": "Generate custom ready-to-use livestream panels with multiple customization options such as icons, colored backgrounds, gradient backgrounds and patterns for free.",
  "data/ph-top/2021/7/xclipper.json": "XClipper is a smart clipboard manager for Windows & Android which helps to track clipboard activities and makes it easier to interact with them with lots of features. It also helps to synchronize your clipboard between these two platforms.",
  "data/ph-top/2021/7/guess-the-stock.json": "Test your knowledge of the stock market! Can you guess the stock from its chart? We decided to turn this into a basic web app after sending each other pictures of charts and trying to guess the stock. Quickly built for fun. (We are not UI designers...)",
  "data/ph-top/2021/7/lineicons-3-0.json": "Lineicons is free and premium vector line icon pack that comes with 5000+ diverse, carefully crafted, beautifully designed icons for modern UI design and development projects. Download Package and Files Available in - SVG, Ai, Icon Font, PNG, and React.",
  "data/ph-top/2021/7/thankme.json": "With so many things going around in the pandemic, people have been constant. Know people who did good karma? Or do you know how many lives have you touched? Just create a thankme page for *literallly anyone* and share it across the web :)",
  "data/ph-top/2021/7/big-emojis.json": "These are 1623 emojis upscaled from 160x160px to 2560x2560px using A.I. See one of my favorites in full size https://drive.google.com/uc?id=1eUHq3DE7m4F9H3gtrtJldR4SGqOsxPr_.",
  "data/ph-top/2021/7/flacked-ai.json": "Flacked AI is an AI Writer that simplifies the process of writing by helping people organize their thoughts and streamline their writing in a much shorter time.",
  "data/ph-top/2021/7/design-kit.json": "Introducing Design Kit, is one of the largest libraries of design that make it easy to design, build,or research. Built for Founder/CEO,PM, UI/UX, Dev. - 9 main sections - 70+ the design patterns have been classified - 100+ UIKIT - 100+ Case studies & Showcase",
  "data/ph-top/2021/7/notions-plants-manager.json": "Are you one of those people who love plants, have more and more of them at home, but often forget when to water them? With this template, you will be able to take care of your plants like never before!",
  "data/ph-top/2021/7/console-devtools.json": "Console is a free weekly email digest of the best tools and beta releases for developers. We keep track of everything - dev tools, devops, cloud, and APIs - so you don't have to.",
  "data/ph-top/2021/7/lonely-walls.json": "With Lonely Walls, any business (coffee shops, restaurants, hotel lobbies, etc.) turns into an art venue. We connect local artists with businesses and help them create unique art exhibitions which are then accessible to collectors via our venue map.",
  "data/ph-top/2021/7/nomad-visa.json": "Remote work is an ever-growing trend. Explore the new digital nomad visas and other visa possibilities to travel the world without a rush while working remotely. Nomad Visa helps you compare visas and find out how long you can stay in a country.",
  "data/ph-top/2021/7/remote-game-jobs.json": "Remote Game Jobs is a job board dedicated to remote work in the game industry. Jobs that are remote long term even after the pandemic are marked 100% REMOTE.",
  "data/ph-top/2021/7/obsidian-for-mobile.json": "After months of private beta, the Obsidian mobile app is finally here! It has almost all the features of the desktop app, plus mobile-centric features like customizable toolbar and pull-down Quick Action. ⠀ Get it today for a second brain on the go!",
  "data/ph-top/2021/7/boldvoice.json": "BoldVoice is an accent coaching app for non-native English speakers that helps them be as well-understood and confident in English as in their own language. You get personalized daily video lessons by a Hollywood coach and immediate pronunciation feedback.",
  "data/ph-top/2021/7/papyras.json": "Why you should have a blog in Papyras? 1. You can host it in your own domain for free. 2. It has blog editor, email collectors, forms, analytics. 3. We are regularly adding free themes. 4. It takes only 5 minutes to set up. 5. Whole thing is free!",
  "data/ph-top/2021/7/framer-for-developers.json": "Introducing Framer For Developers. Your home for everything code in Framer — see what’s new: • 10x faster code editor • NPM support (beta) • Use Smart Components in code • Auto Size in code •&nbsp;Sharing code with a link Explore the rest — https://bit.ly/3wzGcXJ",
  "data/ph-top/2021/7/official.json": "You’ve swiped through what seems like everyone in your area, found your match, and now you get to delete your old dating apps. Yay! But now what? Well, let us help you answer that: meet Official.",
  "data/ph-top/2021/7/crescent.json": "💰 Earn high-yield interest on your personal or corporate U.S. Dollars treasury. 🛡 We comply with best-in-class security and compliance requirements. 🌱 1% interest on top of your guaranteed 4% interest is directed to carbon removal technologies.",
  "data/ph-top/2021/7/the-graph.json": "Build APIs on top of decentralized networks like Ethereum & IPFS Earn query fees for curating on APIs that are published to the network. One of the first curation markets to go live on Ethereum at scale. Dev guide https://www.youtube.com/watch?v=HfDgC2oNnwo",
  "data/ph-top/2021/7/unremot-personal-office.json": "We've bundled email, calendar & zoom to create an elegant personal office for you. Your office comes with a dedicated URL (eg. unremot.com/@sr) to give your business a permanent address on the internet; loaded with video calls, screen share & more.",
  "data/ph-top/2021/7/carculator.json": "Did you know that you can share your car for a few days a month, and completely cover your monthly payment? We built https://carculator.io to scour the web for the best deals from Carvana, Vroom, and Carmax, that you can buy entirely online, and pay for with Turo.",
  "data/ph-top/2021/7/oopy.json": "Turn your content in Notion into a business. Make money from subscriptions powered by Stripe. All without writing single line of code. Oopy host website, manage membership, and handle Stripe API so that you can focus on creating valuable content.",
  "data/ph-top/2021/7/swiftle.json": "Need to develop a complex platform that combines Bubble and Javascript, but wants to start from a landing page on Webflow? Test your ideas with Swiftle and scale the successful ones within one development team. Choosing developers has never been so easy!",
  "data/ph-top/2021/7/strive-5.json": "Strive teaches K12 math through code via live 1-1 online classes. In Strive classes, students code games and visualisations that are aligned to their school math syllabus. In the process, kids learn the most valuable skill in the 21st century: coding.",
  "data/ph-top/2021/7/screengrab-2.json": "Taking screenshot of a particular screen in a multidisplay setup is painstakingly hard and tedious. ScreenGrab Solves this in a click! 1. Select any screen or window. 2. Preview what you are capturing before taking screenshot! 3. Take screenshot!!!",
  "data/ph-top/2021/7/enso-7.json": "Enso (YC S21) lets you analyze, visualize, and automate data processing simply by connecting visual components together. It is powered by a new generation visual programming language, that you can extend with Java, JavaScript, R, and Python (more coming soon).",
  "data/ph-top/2021/7/fellow-3-0.json": "Introducing the latest and greatest Fellow features: Comments & Reactions 🔥, Meeting Feedback 👍, Dark Mode 🌚… and more! Fellow is the meeting productivity app where teams collaborate on agendas, record action items, and keep each other accountable!",
  "data/ph-top/2021/7/wknd.json": "WKND is an on-demand “retreats-as-a-service” platform that intelligently personalizes local weekend adventures packages. WKND helps millennials who desire a break from the city to fill in their weekends with one-of-a-kind life experiences. Try it out today!",
  "data/ph-top/2021/7/dead-startup-toys.json": "Toy versions of iconic failed startups.",
  "data/ph-top/2021/7/notioncharts.json": "Create beautiful embeddable charts from your Notion Tables. Choose from 9 chart types, select a Notion Table and get a chart embed url.",
  "data/ph-top/2021/7/musixmatch-pro.json": "Musixmatch is announcing a new service aimed to provide a self-service platform for all music creators and professionals to verify music credits, claim and administrate copyrights, distribute music, and get paid.",
  "data/ph-top/2021/7/crypto-carbon-footprint-calculator.json": "Cryptocurrencies produce a substantial carbon footprint. Canopi enables anyone to measure and eliminate those emissions. The calculator is powered by our Climate API, which is also helping companies across fintech, e-commerce, transportation, & travel.",
  "data/ph-top/2021/7/aq-attention-quotient.json": "AQ™ is the first biomarker-based personalized mindfulness app. Be mentally fit with AQ™ by: - Tracking your mental fitness in real-time, 24/7 - Receiving relaxing music and nature soundscapes when most needed, and - Training with guided meditations and lessons based on your current mental fitness needs.",
  "data/ph-top/2021/7/the-backstage-pass.json": "Building a community of 10,000 community builders, and sharing everything I do — what works, what doesn't, and why — along the way. After only a few weeks, we're already over 1,100 members who are learning the tools to build their own communities.",
  "data/ph-top/2021/7/conectohub.json": "OKR Integrated Agile Work OS for Non-Technical Teams Bridge the gap between strategy and execution! ConectoHub helps teams become more goal oriented, work aligned and more productive 🎯",
  "data/ph-top/2021/7/volopay.json": "Volopay is a free tool that companies can use to manage expenses and employee reimbursements including reporting, receipt upload, approval flows, claims processing, and accounting automation, giving businesses complete visibility over all their spendings.",
  "data/ph-top/2021/7/matter-eb43d1fd-9b3c-4755-bd47-7167859477fe.json": "Recognize your team members with Kudos, gather continuous feedback, and so much more. Matter for Teams include unlimited seats, Slack integration, and Feedback Ritual.",
  "data/ph-top/2021/7/what-is-the-plant.json": "Can not find out what sort of the plant is? Do not know the proper scientific name of the trees and flowers? Now you can try WhatisthePlant, the AI Plant identifier online tool. Upload a plant picture and our system will tell you its name with the wiki page.",
  "data/ph-top/2021/7/wized.json": "\"The no-code tool the Webflow community has been waiting for.\" Wized enables you to build 100% custom web applications on top of your Webflow projects.",
  "data/ph-top/2021/7/harvestr-2-0.json": "The all-in-one product management tool where impact-driven teams collaborate to build successful products.",
  "data/ph-top/2021/7/spot-06fd1bba-059a-44a8-a346-e6580c0b6dae.json": "Spot is the knowledge base that works with your existing tools: write bite-size documentation on the fly, backup what would otherwise be lost in Slack, and search for the knowledge scattered across Drive, Notion, Intercom, Zendesk and many more.",
  "data/ph-top/2021/7/clutch-3.json": "Clutch is an advanced visual product builder that combines the speed and familiarity of design tools with the power of development tools. Quickly launch your MVP with starter kits, scaffolds, and components. Add data, logic, and code to get to 1.0 and beyond.",
  "data/ph-top/2021/7/face-maker-ai.json": "Face Maker AI takes a sketch and generates a photorealistic face",
  "data/ph-top/2021/7/tilde.json": "Tilde is a meeting space that makes meetings more efficient, effective, and inclusive. We hope to improve recurring meetings like your daily stand-up or weekly one-on-ones. You can spin up a free and instant meeting at https://tilde.so — no sign up required.",
  "data/ph-top/2021/7/clover-6.json": "Clover is a creative workspace with notes, whiteboarding, todos, and a daily planner. It combines the power of a text editor with the flexibility of a whiteboard for spatial note-taking, brainstorming, presentations, diagramming, wireframes, and more.",
  "data/ph-top/2021/7/weekly-planner-2.json": "The weekly planner is perfect for those that need a little \"extra\". Planning your week is one thing, but having enough space to add notes, goals and tasks was something I've always missed with other planners. The integrated mood tracker is a bonus. Enjoy!",
  "data/ph-top/2021/7/webcrate.json": "Stand out from the crowd, and show off what you can do! Create an account, upload your resume, projects, and socials, and have your personal portfolio website live in minutes, hassle-free & mobile-friendly!",
  "data/ph-top/2021/7/wizintro.json": "- WizIntro helps you make or request a warm intro in 30 seconds - No more email writing for anyone! Forward, accept, or decline requests with a push of a button - A centralized location to view all intro requests",
  "data/ph-top/2021/7/procreate-import-for-figma.json": "Import yourprocreate files into Figma, complete with named layers, blend modes, and clipping masks.",
  "data/ph-top/2021/7/hone-2.json": "30 MILLION men over 35 have low testosterone. It’s pretty common. It results in low energy, low focus, low libido, poor sleep, and keeps us from being our best. We offer at-home blood tests, 30 minute telehealth visits, and treatment shipped to your home.",
  "data/ph-top/2021/7/iris-f2b7efba-80a9-41b1-915f-96bf029071da.json": "Invest with friends with Iris. • Real-time trade notifications and leaderboards • Group messaging and DMs • Access to influencers' portfolios: @Litquidity, @InTheMoney,.. • Support for Robinhood, WeBull, TD, and Fidelity Download now — www.iris.finance",
  "data/ph-top/2021/7/galora.json": "Galora let's you find neighbors that are growing or making great food at home. Find and buy homegrown fruits, veggies, eggs, cannabis, kombucha, homemade breads, cakes, desserts, and so much more. Send them a message on the app and offer to buy or trade.",
  "data/ph-top/2021/7/reframe-1.json": "Reframe is a neuroscience based app to help you quit or cut back on drinking alcohol.",
  "data/ph-top/2021/7/circle-ai.json": "Billions of AI-generated wallpapers for your device. Tap to create a new unique image. All wallpapers support dark mode.",
  "data/ph-top/2021/7/financial-choice.json": "Unify your checking and investment activities through Financial Choice: Get market returns while retaining instant access to your cash to pay for rent and bills.",
  "data/ph-top/2021/7/masslight.json": "We don't just advise startups, we help build them. In exchange for equity, we provide capital and a dedicated tech team. We're looking to invest $100,000USD and provide a tech team to 6 startups this year. ➡️ Interested? Applications are due September 1st.",
  "data/ph-top/2021/7/mediaflows-by-cloudinary-labs.json": "Enables developers and technical users to design, deploy and scale custom media applications and process. Low-code widgets representing key media tasks can be connected to program the behavior of a developer’s application. Integrated with Cloudinary APIs.",
  "data/ph-top/2021/7/blogboard.json": "Blogboard helps you discover, search and follow the best engineering blogs. We pull thousands of articles from official engineering blogs of top tech companies. With the built in search engine you can browse by topic or look up articles by similarity.",
  "data/ph-top/2021/7/leavewizard.json": "LeaveWizard is an employee holiday planner and absence management system that helps organisations get in control of their leave management process by reducing stress, increasing visibility, streamlining approvals, and policing rules. Growing since 2011!",
  "data/ph-top/2021/7/omnichannel-chat-widget-by-rasayel.json": "Make it easier for your visitors to reach you on all your social media and chat apps. A free Omnichannel Chat Widget from the https://octopods.io and https://rasayel.io team.",
  "data/ph-top/2021/7/wellbees.json": "Wellbees is a wellbeing platform which aims to create good new habits for employees to increase their overall wellbeing by using the power of social connection. Wellbees offers expert support, competitions, contents and seminars as a one-stop-shop platform.",
  "data/ph-top/2021/7/lance-2.json": "Lance is the business account that puts your money on autopilot. Set your stacks, and watch your income get auto-allocated toward salary, savings, taxes, and expenses — just how you want. Best part? Lance pays your taxes (to the IRS), and your salary (to you).",
  "data/ph-top/2021/7/startup-concepts.json": "Startup concepts in a comic book format. Understand complex startup concepts through simple explanations.",
  "data/ph-top/2021/7/synder-2.json": "If you run Shopify and Amazon stores with several payment methods or a subscription-based business, you can finally connect them into one ecosystem and get an instant overview of your multi-channel cash flow, automate accounting and inventory management.",
  "data/ph-top/2021/7/direcon-for-spotify-greenroom.json": "Direcon was the first-ever analytics tool for Clubhouse. Starting today, it becomes the first-ever analytics platform for Social Audio. We're proud to announce that Direcon now supports Spotify Greenroom and will support Twitter Spaces in a month.",
  "data/ph-top/2021/7/jam-on-chrome.json": "Jam on Chrome is a chrome extension that lets you comment, annotate, and even update your website copy, right on the page.",
  "data/ph-top/2021/7/workomo-2.json": "Workomo is the easiest way to manage your network on WhatsApp. Save hours every week by creating an automatic Rolodex from calendars & address books, & manage it directly via a WhatsApp “assistant”.",
  "data/ph-top/2021/7/gamerpay.json": "We are the marketplace that makes it safe to trade gaming skins and assets. We are integrated with the gaming platform Steam for validation & our product enables scam free cash transfers between gamers worldwide.",
  "data/ph-top/2021/7/hexomatic.json": "Hexomatic is a no-code data extraction and work automation platform that enables you to harness the internet as your own data source and leverage ready made automations to delegate time consuming tasks. Brought to you by the team behind Hexometer & Hexowatch",
  "data/ph-top/2021/7/marq-2.json": "Marq is a Nextgen e-learning app that allows you to acquire a new language in a context by using 4 complex features: - daily short lessons, - vocabulary trainer, - smart push notifications - 15 minute speaking sessions with a teacher.",
  "data/ph-top/2021/7/muse-b668a046-5e8b-4f0b-990a-bcca109b5304.json": "Muse allows you to build immersive 3D websites that act as virtual worlds. Websites no longer need to be static and boring. Transform boring links, e-commerce stores, and more into fun and immersive experiences today. Compatible on all devices with a browser.",
  "data/ph-top/2021/7/keystroke-pro-2.json": "Keystroke Pro provides highly customizable keycap visualizations that enables your viewers to follow along with ease. It’s the perfect tool for screen sharers, meeting hosts, tutorial creators and presenters—anyone who teaches or demonstrates software on a Mac",
  "data/ph-top/2021/7/job-tracker-2-0-by-teal.json": "Teal’s Job Tracker is the most efficient & fun way to manage a job search. Easily save jobs from sites like LinkedIn and Indeed with our Chrome Extension. Organize your search, track your progress, and land the perfect job.",
  "data/ph-top/2021/7/gather-c7b1732c-9fd3-4f11-b94c-13826a0fd866.json": "The productivity tool for your finances. Gather is for those who want to Get Things Done. We took how we organize other areas of our lives – email, tasks, calendars – and built a tool that powers your financial productivity. For couples, families, or just you.",
  "data/ph-top/2021/7/notionnewsletter.json": "Start sending newsletters using Notion and Mailchimp within 5 mins.",
  "data/ph-top/2021/7/onetool-1st-startup-sold-as-an-nft.json": "\"Business is half art and half science\". We got the second part of the quote wrong, but we nailed the first part. The first startup ever sold as collectible art - Y Combinator-backed & failing as big as we thought big. check us out on onetool.co",
  "data/ph-top/2021/7/templates-by-guru.json": "Free business templates crafted by experts to save your team time and boost productivity. We've got templates for product, project management, onboarding checklists, structuring more efficient meetings, marketing, and more. A lot more.",
  "data/ph-top/2021/7/flashy-2.json": "The Eaisest way to create engaging Gif's for your product launches > No sign-up > No file uploads > Everything runs in your browser > Create Gif's in seconds - realisticly tho in 2 - 3 mins 😊",
  "data/ph-top/2021/7/toolb-dev.json": "Toolb.dev provides a set of 50+ and expanding free CSS, HTML and JS webtools for daily usage",
  "data/ph-top/2021/7/dibbs.json": "Dibbs is a 24-7, real-time marketplace for trading sports cards. It makes collecting more accessible by empowering fans to buy and sell fractional interests in their favorite athletes’ cards with as little as $1. Available on iOS, Android and Web.",
  "data/ph-top/2021/7/hypertrader.json": "HyperTrader makes it easy for crypto traders to track multiple portfolios, discover best prices, execute orders faster and analyze their trades. We do this by providing a simple yet powerful native desktop trading terminal for Mac, Windows, and Linux.",
  "data/ph-top/2021/7/amplemarket-2-0.json": "Amplemarket is the all-in-one sales platform to help you find any contact, hyper-personalize messages, reach out via multi-channel (email, phone, linkedin) and leverage AI to contact the right people, at the right time.",
  "data/ph-top/2021/7/containiq.json": "ContainIQ (YC S21) provides Kubernetes native monitoring instantly. Our pre-built dashboards and monitors are ready to go with a one-line install. Using eBPF, we provide a deep level of insight from the kernel directly.",
  "data/ph-top/2021/7/ethically.json": "We compile hundreds of sustainability sources into one digestible score so you can make more informed purchases. You can find them where you will actually use them - whether that's in your Amazon search, google shopping search or just on the brand's website.",
  "data/ph-top/2021/7/greenlight-5.json": "Greenlight is a 'reverse' job portal that gives you instant access to a global pool of elite engineers looking for their next opportunity. Immediately see the CVs of pre-vetted candidates, interview them and close your hire before Monday.",
  "data/ph-top/2021/7/mythia.json": "Mythia is the world’s first debit card for gamers. Rewards include free video games, PlayStations, and XBoxes. The Mythia app is designed like a game, with weekly challenges, reward boxes, and you can team up with friends for even more rewards.",
  "data/ph-top/2021/7/woolly-illustrations-by-icons8.json": "Add some magic to your designs! Cute hand-drawn style reminds you about fairy tales and granny's cookies. Use ready-made scenes or combine characters and elements to create a picture for your websites, apps, slides and more.",
  "data/ph-top/2021/7/oneschema.json": "OneSchema is a super simple spreadsheet UI for detecting and correcting errors in CSV data. You can use it when you repeatedly need to upload data to a system with a known schema (like setting up new customers in a SaaS product, uploading a catalog monthly)",
  "data/ph-top/2021/7/detail.json": "Detail is a virtual camera that you can use in Zoom, Loom, Twitch, Whereby, or your favorite streaming software. Use your iPhone or iPad as your camera, switch between cameras, pick your favorite filter and record high quality video while streaming live.",
  "data/ph-top/2021/7/kairo.json": "Kairo is a delightful and flexible tracking dashboard to help you become a productive and better person. Track your time with easy to switch blocks; always know how much time is left. Have your goals, habits and achievements in front of you to stay motivated.",
  "data/ph-top/2021/7/sketchkeys-2.json": "SketchKeys produces keyboard stickers with the shortcuts for your favourite apps: - Notion - Figma - Sketch - Adobe XD - Photoshop 👩‍🌾 Made in Europe by a family business. We also produce custom keyboard stickers for businesses ⌨️",
  "data/ph-top/2021/7/siteoly-2-0.json": "Siteoly is a no-code tool to build websites from Google sheets. Turn your Google sheet data into a working website. You can select from 50+ design templates and create your site in less than 10 minutes. Use PH30PERCENT discount code to get 30% off today.",
  "data/ph-top/2021/7/resizer-2.json": "It is a web resizer that allows you to scale your images or photographs quickly and easily. Just by sending your photo, We will process it, resize it and reduce the noise it may have (also known as denoise), achieving amazing results.",
  "data/ph-top/2021/7/cartfuel.json": "Cartfuel gives you the tools you need to accept one-time and recurring payments with Hubspot. All sales data automatically goes into HubSpot. Meaning you can trigger workflows to follow up with customers. No custom code or complex systems needed.",
  "data/ph-top/2021/7/tiktok-trends.json": "🔥 TikTok Trends 🔥 Make viral content that gets you on the FYP with the trends! #️⃣ Top Hashtags 🎶 Top Sounds 👀 Personalized Insights",
  "data/ph-top/2021/7/typingdna-focus.json": "Using typing biometrics, we’ll analyze how your mood changes throughout the day. You’ll know when you’re happy, stressed, focused, tired, energized, calm — and (soon), you’ll even get tips on how to optimize your time to maximize your productivity.",
  "data/ph-top/2021/7/remotely-7.json": "Remotely helps teams build better connections with remote teammates. See where they are, what time it is and when they were last online, every time you open a new tab.",
  "data/ph-top/2021/7/podcast-template.json": "Planning your podcast doesn’t have to be a headache. Use this free podcast template to have everything in one tidy Notion doc.",
  "data/ph-top/2021/7/domain-name-generator-2.json": "Domain name generator can find the best domain name for you. Simply enter a keyword and the tool will generate ideas for you. Easily check availability right from within the tool and buy with a few clicks. Use the widget to save all your domain name ideas",
  "data/ph-top/2021/7/iona-mind.json": "Regular conversations with Iona can make a real difference to your mood. Iona uses evidence-based techniques to help users deal with negative thoughts, stress and anxiety. It’s your 24/7, stigma-free, mental health companion.",
  "data/ph-top/2021/7/edition.json": "🏠 Build your 'Community Home' in minutes with the Notion-like editor 🚀 Publish Documentation, Knowledge Base, Blog, Newsletter, Events, Members Directory & more! 🎉 Perfect for Creators, Founders, Community-builders, Professional Networks & Customer Success",
  "data/ph-top/2021/7/meta-nutrition-42191f15-b02e-4d1f-8265-2461c3d15da8.json": "Meta Nutrition apps are out! Meta is an automated AI based meal plan generator and food tracker made for beginners and experts. Create custom foods, personalize your weekly meals, and calculate your nutrients targets to crush your fitness and wellness goals",
  "data/ph-top/2021/7/aestheticcam.json": "During the shooting AestheticCam AI assesses every single frame and angle and displays the assessment for you. Automatic shooting is included. You can also load photos from your library and AI will sort them by aesthetic attractiveness.",
  "data/ph-top/2021/7/spot-meetings.json": "Sick of sitting on video meetings all day? Break free from your desktop. Get up and try a walking meeting with Spot.",
  "data/ph-top/2021/7/unavatar.json": "unavatar.io is a tiny service that will get the avatar querying against provider supported, being DeviantArt, Dribbble, DuckDuckGo, GitHub, Gravatar, Instagram, Reddit, SoundCloud, Substack, Telegram, Twitter, YouTube, and more!",
  "data/ph-top/2021/7/shimmer-3.json": "Shimmer offers online video support groups for personal growth led by coaches. Members join a small group of others with shared identity & experiences, where they meet weekly via video chat, attend community events, and become the best version of themselves.",
  "data/ph-top/2021/7/nocode-summer-camp.json": "This summer, Bravo Studio and NoCode.Tech have teamed up to help you launch that app idea you've been sitting on all year - without coding. Each week, you'll recieve an invite to expert Workshops, curated Tutorials and exclusive content to help you succeed!",
  "data/ph-top/2021/7/webmity-increase-your-organic-traffic.json": "Comprehensive conduct of SEO activities for Ecommerce. Webmity is a platform for creating and managing multiple websites from one place. Using Webmity you will save time and effectively achieve your goals through Google search marketing.",
  "data/ph-top/2021/7/portfolio-prioritization-by-500talents.json": "Connect our tool to your Jira projects — and we'll provide your Product Rankings helping bring products to the market faster and decrease the cost of a mistake. To do so we use our Product Portfolio Assessment Methodology based on NPV and product risks.",
  "data/ph-top/2021/7/genius-ai-by-taplytics-ai.json": "Without writing a single line of code, instantly generate personalized copy for any audience. Meet Genius AI by Taplytics.",
  "data/ph-top/2021/7/booby-track.json": "Hi all, we just had our baby and we're breastfeeding — one Friday afternoon my partner asked if I could write an app for her watch so that she could keep track of the last boob she fed our baby with. So I did. This is that app.",
  "data/ph-top/2021/7/treepoints.json": "Treepoints is revolutionising the fight against climate change. A simple planet positive subscription to offset your entire carbon footprint, plant trees and prevent plastic pollution. Plus earn points for your climate action to spend on sustainable brands.",
  "data/ph-top/2021/7/phonic-1.json": "Phonic scales voice and video feedback, so you never have to trade off quality for quantity.",
  "data/ph-top/2021/7/inai.json": "Inai is the only payment integration companies need to accept online payments globally. We provide a universal API that connects with multiple payment rails, fraud, tax and BI tools, and can be setup in minutes.",
  "data/ph-top/2021/7/linguix-writing-coach.json": "Linguix Coach helps you to improve your writing skills by offering tailored language trainings based on your own mistakes. Make faster progress by doing what you do every day: writing for work or personal projects.",
  "data/ph-top/2021/7/lightly.json": "Data labeling is time-consuming and can be very expensive. Lightly tells companies which data to label to have the biggest impact on model accuracy while saving time and costs.",
  "data/ph-top/2021/7/daily-hellos.json": "Daily Hellos is your guide to fun, profound, and entertaining conversations with your loved ones. We have created a space for people to connect more deeply and communicate more meaningfully.",
  "data/ph-top/2021/7/gpt-3-surveys-by-blocksurvey.json": "Have you been stumped when it comes to creating surveys? It's usually a long frustrating process. We know it is frustrating. You can now get your survey questions in seconds. Powered by OpenAI's GPT-3.",
  "data/ph-top/2021/7/sadu.json": "Sādu is an ESG solution for companies that want to take their first steps towards sustainability. The mobile app rewards an active lifestyle with trees. Sync your fitness tracker or enter your last workout in the app to earn trees with every fitness activity.",
  "data/ph-top/2021/7/opens-are-dead.json": "THE iOS 15 UPDATE brings fundamental change to email marketing by KILLING THE OPEN RATE METRIC. 20-year-old practices need to be unlearned. To help email marketers adapt, Omnisend introduced Opens Are Dead—a knowledge hub to navigate the transition.",
  "data/ph-top/2021/7/hummingbird-5.json": "We're launching our brand new game: Hummingbird! The humming game where only doo-doo's, nana-nana's, and hm-mm's are allowed! Now playable on CrowdParty! Laughs guaranteed!",
  "data/ph-top/2021/7/toucan-2-0.json": "We tidied our nest, spiffed up our feathers and updated our algorithms! Toucan can now help you learn a new language on Safari, Chrome and Edge. ⠀ Spanish, French, Japanese, German, Korean, Portuguese, Italian, Arabic, Mandarin, Hebrew, Hindi, English",
  "data/ph-top/2021/7/fake-tweet-generator-1.json": "With the Fake Tweet Generator tool you can create convincing fake tweet images. This tool is completely customizable so you can choose any name, any content, any time, any number of likes and many more.",
  "data/ph-top/2021/7/verihubs.json": "Verihubs is an API-based verification that helps digital companies to verify their users using local data sources and access the users’ financial and identity information.",
  "data/ph-top/2021/7/q-ai.json": "q&ai automatically builds trackers from documents you already have (marketing one-pagers, release notes, etc.) and tracks them in sales call transcripts for better call analytics.",
  "data/ph-top/2021/7/open-benchmarks-for-instagram.json": "Open Benchmarks is a free tool to help you keep track of 'what's normal' on Instagram. Whether that's to see if other Instagram users are also experiencing a drop in a particular metric, or because you'd like to uncover areas you could be performing better in",
  "data/ph-top/2021/7/setups.json": "We invite creators to share their setups and the amazing work they’re doing — and neatly catalog the equipment and tools they’re using so you can find the inspiration you need to build or upgrade your workspace.",
  "data/ph-top/2021/7/quickwork-3.json": "The #1 integration and automation platform chosen by enterprises to build workflows, publish APIs, and manage conversations.",
  "data/ph-top/2021/7/instahues.json": "InstaHues is a collection of beautiful color palettes and gradients palettes created by its users to make your awesome projects more awesome!",
  "data/ph-top/2021/7/illustration-plugin-for-figma.json": "Free Popular Illustration libraries for everyone, plugin allows you to insert high-quality free illustrations right into Figma. Just drag and drop to add it on Figma.",
  "data/ph-top/2021/7/desech-studio.json": "Desech Studio is a free modern nocode visual html/css editor which enables you to import your Figma, Sketch, AdobeXD design file to generate a clean html structure positioned with CSS grids. Then you can integrate it with React, Angular, Vue or Material Design",
  "data/ph-top/2021/7/memo-7.json": "Memo is a open source app that uses a memory card-based approach to help you practice the subjects of interest to you in programming. We have a unique set of collections ranging from the most basic to the most advanced programming topics.",
  "data/ph-top/2021/7/dynamo-ios-wallpapers.json": "Dynamo wallpapers utilise automation Shortcuts to change dynamically based on your iPhones battery life, and when your phone is plugged in to charge - turning your phone into a giant battery indicator! Never run out of battery again with Dynamo.",
  "data/ph-top/2021/7/growgetters.json": "Every week, we break down the best hacks to scale your newsletter and report on our biggest wins - and most embarrassing fails. Let us do the work, so you can learn from our experience - in real-time.",
  "data/ph-top/2021/7/global-twitter-trends.json": "Want to get twitter followers fast well you have to use the right hashtag. Global Twitter Trends allows us to watch and track twitter trends of the world as well as of 62 countries and 462 towns.",
  "data/ph-top/2021/7/almighty-2.json": "Almighty is a native Mac app to enhance your Mac daily workflow. Over 50 cool Mac tweaks and extra utilities to supercharge your Mac experience. Becoming superuser is just 1 click away with Almighty.",
  "data/ph-top/2021/7/jetbrains-qodana.json": "Qodana is a code quality monitoring platform that allows you to evaluate the integrity of code you own, contract, or purchase. Enrich your CI/CD pipelines with all the smart features you love from JetBrains IDEs, plus project-level checks.",
  "data/ph-top/2021/7/pattern-collect.json": "Pattern Collect is a curated gallery of inspiring patterns & illustrations curated with love and organised in over 40 categories to make hunting for inspiration easy for creatives.",
  "data/ph-top/2021/7/heights-2.json": "🧠 Heights Smart supplements and clever content for the brain, intelligently delivered. Think of our team as your personal brain coach, with one goal in mind; to feed your brain and help you reach your Heights.",
  "data/ph-top/2021/7/cheerio.json": "Cheerio helps its users find folks who match their vibe. You can discuss common interests, play games, share gifts and have a ball of a time, all from the comfort of your couch. With Cheerio, good company and great conversations are just a tap away.",
  "data/ph-top/2021/7/token-alerts.json": "Scans the Binance Smart Chain and alerts you to pumping tokens that you can flip for profit. Integrates with Reddit and updates in real-time.",
  "data/ph-top/2021/7/woometrics.json": "With WooMetrics you can view your sales data with comparisons for weekly, monthly & annual order numbers and total revenue, as well as see order details in full - allowing you to use it to track new orders directly from the dashboard.",
  "data/ph-top/2021/7/html-planet-for-kids.json": "HTML Planet for Kids is an online space where children learn HTML & CSS and practice their skills on fun creative projects.",
  "data/ph-top/2021/7/budget-buddy.json": "I have come across many available budgeting app, one thing I notice is it is not give you the feeling of ease when you use it frequently. I design this app so it does not present complicated UI yet the information on the surface is comprehensive.",
  "data/ph-top/2021/7/tockler.json": "With Tockler you can go back in time and see what you were working on. You can get information on what apps were used - exactly at what time - and what title the application had at that moment. This is enough to determine how much you did something.",
  "data/ph-top/2021/7/serendipity-3.json": "Serendipity comes with dark and light themes, meticulously created to work on retina screens.",
  "data/ph-top/2021/7/escape-3.json": "The entire Escape (greatescape.co) expereince now avaiable in a native mobile app!",
  "data/ph-top/2021/7/khagwal-3d-illustration-library.json": "Khagwal 3D is free 3D illustration library pack for web and mobile app designers. It has 45 hand-curated 3D models. Each 3D model is available in high quality png in 5 different themes and 5 different angles. It is also available for Figma - Get it now",
  "data/ph-top/2021/7/shuffle-for-bootstrap-5.json": "Introducing Shuffle for Bootstrap 5 - a visual editor that will allow you to create fresh templates in minutes. https://shuffle.dev/editor?editor=bootstrap&utm_source=producthunt&utm_medium=desc ✅ Drag and drop ✅ Hundreds of ready-made UI components",
  "data/ph-top/2021/7/u.json": "U is a creator platform that enables anyone to easily build, sell, and run their own bootcamp. Bootcamps on U are cohort-based courses that can be live, on-demand or a mix of both. Creators can develop their own curricula and set their own prices.",
  "data/ph-top/2021/7/billion-dollar-pitch-decks.json": "We're a curated database of pitch deck inspiration. Discover the pitch decks of billion dollar startups before they were famous!",
  "data/ph-top/2021/7/adsigner.json": "With AdSigner you can run scheduled marketing campaigns among all the email signatures in your organization. It also helps you generate, visually unify and centrally organize all the email signatures with a library of pre-designed templates.",
  "data/ph-top/2021/7/baseline-3.json": "Baseline is an easy to use brand design tool. It helps you set up a solid brand and then leverages it to create branded designs without effort. Now anybody can create a consistent, memorable brand.",
  "data/ph-top/2021/7/developer-utilities-by-retool.json": "Building an app or testing a feature? We’ve built 20+ dev tools to make it easy. Retool Utilities are a hub of dev tools—ranging from a RegEx generator to writing mock data to PostgreSQL—that make app building easier and faster.",
  "data/ph-top/2021/7/eden-photos-2.json": "Organize your photos without organizing them 😅 Tired of manually organizing images? 🥱 Let our AI do it for you 👨‍💻",
  "data/ph-top/2021/7/memo-fm.json": "Memo.fm makes it easy for podcast listeners to send you voice messages. Instead of asking them to call a voicemail number or email you audio files, send them to your unique memo.fm link",
  "data/ph-top/2021/7/cloudanix.json": "Secure your cloud infrastructure with an agentless solution. You get Audit, IAM, Realtime Monitoring, Misconfiguration, Drift, Remediation (management) to prevent security mishaps and keep the bad actors out of your cloud. Onboarding under 5 minutes.",
  "data/ph-top/2021/7/discover-new-podcasts.json": "Podcast recommendations powered by Rephonic. Choose some of your favorite podcasts and we'll show you more that you might like. The suggestions will get better as you curate the results by liking or disliking shows.",
  "data/ph-top/2021/7/kalam-labs.json": "Live Game Streaming Platform for kids to learn their favourite science topics like:- Black Holes, Alien Life, Dinosaurs etc",
  "data/ph-top/2021/7/chipax.json": "Chipax is like Quickbooks for Latam SMBs. We are making finances dramatically simpler, with real-time data collection from IRS and banks. Our online software allows them to automate their day-to-day admin & finance tasks. +1000 customers in Chile and Mexico.",
  "data/ph-top/2021/7/encuadrado.json": "Being a solopreneur running an appointment based business comes with an administrative burden. Encuadrado an all-in-one solution that encompasses booking, getting paid & invoicing, enabling self-employed professionals in LATAM to focus on their craft.",
  "data/ph-top/2021/7/kidx-classbox.json": "KidX Classbox was conceived during the pandemic to improve screentime and learning for children. The system works by allowing children to play and interact with online videos using real world offline toys. The first activities focus on Montessori math",
  "data/ph-top/2021/7/job-hunter-notion-template.json": "Notion is a wonderful tool when it comes to manage productivity systems. One of its use-case that I have found personally helpful is to track my job application and to be always on foot to achieving career goals.",
  "data/ph-top/2021/7/picsart-2-0.json": "Remember that movie where the nerdy character takes off their glasses and everyone realizes they weren't just brilliant, but also gorgeous? That just happened to Picsart! ⠀ Join the Picsart community of over 150 million creators around the world.",
  "data/ph-top/2021/7/ancana.json": "Ancana is a marketplace where you can buy a beautiful vacation home through fractional ownership. We aim to make the vacation home market more accessible by giving people the opportunity to own a vacation home for a fraction of the price.",
  "data/ph-top/2021/7/hypertheme-editor.json": "We created a tool that helps designers, developers, and companies design beautiful Chakra UI themes in minutes. With the HyperTheme you'll be able to customise a theme live on your project and export the result in few clicks 🔥 Try it now, visit https://hyperthe.me?ref=producthunt",
  "data/ph-top/2021/7/walto.json": "Walto is a minimal to-do list app that embeds the list into phone wallpaper. It helps you forget less and get things done on time.",
  "data/ph-top/2021/7/marketing-next-read-advisor.json": "A quick and effective way to know what to read next.",
  "data/ph-top/2021/7/rutter-2-0.json": "Rutter is a universal API for reading and writing products, orders, and customer data and performing checkout across storefronts and marketplaces.",
  "data/ph-top/2021/7/instagram-direct-for-teams.json": "Connect your Instagram page to Callbell in a few clicks and start collaborating with your team on your Instagram Direct chats from a single app",
  "data/ph-top/2021/7/mindist.json": "Meet first meditation creation and practicing app aka Mindist. Benefit right away from: - Meditation recording studio in a pocket for mindfulness teachers - Diverse meditation content to practice for users - Matching users with teachers",
  "data/ph-top/2021/7/superpeer-series.json": "With Series, you can create and sell cohort based courses. It can be on-demand videos you upload, interactive livestreams, or any combination; it’s the easiest way to share your knowledge and make impactful connections with your audience.",
  "data/ph-top/2021/7/identance.json": "Identance is a new AI-based environment which allows companies to be sure of their users and onboard customers in >15 sec. Full range of verification services at affordable prices and worldwide coverage: Identance -will keep your business safe!",
  "data/ph-top/2021/7/crew-5e84852e-4be3-4396-a926-212fc03b056a.json": "Crew is the modern recruiting CRM 💌 Contact, nurture & close talent 🖼 Create stunning career pages 🗂 Streamline your hiring process 🤖 Automate your workflows",
  "data/ph-top/2021/7/brainiac-2-0-ksh.json": "Brainiac is a database of 150 cognitive biases, principles & models. Presented in a concise format, as a sketch, and as online flashcards. KSH is a platform that consists Brainiac and 100+ viral marketing case studies (including 50+ \"First 1000 customers\")",
  "data/ph-top/2021/7/notion-calendar-sync.json": "Sync your Calendar with Notion, and vice-versa. Get started in few minutes and get all your meeting notes connected automatically with your Google Calendar.",
  "data/ph-top/2021/7/jivochat-3.json": "JivoChat is a messenger for all your business communications. Talk to teammates in Jivo Team Chat and support customers on 11 channels: Live Chat, Instagram, Facebook, WhatsApp, Email, Phone, SMS, Telegram, Viber, Chatbots and Apple Business Chat.",
  "data/ph-top/2021/7/godly-website.json": "Godly Website is a creative feed showcasing some of the most godlike websites on the Internet. You can submit websites for review, create a public profile, be credited as a maker of a website, and curate collections.",
  "data/ph-top/2021/7/hyper-founder-program.json": "Hyper is a new kind of venture firm, inspired by the community at Product Hunt. Today, we’re launching our 8-week program which focuses on what modern startups need most: distribution, mentorship, talent, community, & fundraising. https://hyper.com/#apply. https://www.producthunt.com/stories/product-hunt-meet-hyper",
  "data/ph-top/2021/7/beautiful-css-buttons-by-css-scan.json": "Beautiful CSS Buttons by CSS Scan is a curated collection of 83 free beautiful CSS buttons, ready-to-use for your next projects, click to copy it.",
  "data/ph-top/2021/7/product-benchmarks.json": "Product-led growth is the top trend of 2021, but there’s still a whole lot of product imposters out there. Are you one of them? In this guide, OpenView, Pendo, and Product Collective all team up to help you figure this out (and what to do if you are).",
  "data/ph-top/2021/7/notion-journal.json": "A complete journaling experience in Notion",
  "data/ph-top/2021/7/headless-recorder-1-0.json": "Headless Recorder 1.0 is a free and open-source Chrome extension that records your browser interactions and generates Playwright/Puppeteer scripts without coding. Easily record, copy, and run your script for testing, monitoring, or scraping.",
  "data/ph-top/2021/7/backups-for-trello.json": "Backups for Trello is an easy, automated backup and recovery solution to protect your Trello boards, cards, lists and more. We created Backups for Trello to protect the workflows powering your business so you can work safer and focus on growing your business.",
  "data/ph-top/2021/7/square-banking.json": "Payments, business banking accounts, and cash flow, synced together seamlessly. When you take payments and bank through Square, everything is connected. Your sales flow directly into Square Banking, so accessing and moving your money is fast and easy.",
  "data/ph-top/2021/7/content-quality-check.json": "Discover which keywords your content is missing and optimize for both users and search engines.",
  "data/ph-top/2021/7/hallo-app.json": "A social network for real life friends and interactions",
  "data/ph-top/2021/7/clarity-50dd303e-8689-4e8b-9e59-f0951e2ad84e.json": "Clarity is the simplest productivity app ever made. Run your team with a single weekly doc. Keep everyone on the same page without endless configuration & maintenance. Focus your energy on what you do best.",
  "data/ph-top/2021/7/startup-pitch-deck.json": "The Startup Pitch Deck Template is ideal for everyone, from entrepreneurs to product managers to startup founders. It makes the basics of pitch deck design easy and painless. This template features 68+ predesigned slides that will take your pitch to the next level.",
  "data/ph-top/2021/7/mozart-data.json": "Mozart Data automates the work data engineers traditionally do to spin up and run a modern data stack. We manage a (Snowflake) data warehouse, maintain ETL pipelines, and provide an easy-to-use interface for scheduling and monitoring data transformations.",
  "data/ph-top/2021/7/e-a-t-blocks.json": "Now, more than ever, finding truthful, accurate information on the internet is an arduous task. This app allows you to create reviewer profile sections to be added to your shop's articles, showcasing the experts that ensure your content is legitimate.",
  "data/ph-top/2021/7/artickl.json": "artickl is building the Hollywood Agent for job-searchers. artickl is automating the tailoring of resumes, cover letters, and application forms to any job application, reducing the time to apply from hours down to minutes.",
  "data/ph-top/2021/7/100-invoice-templates.json": "Send and Receive Industry Standard Invoices Easily and Elegantly 👉 Business-related topics including sales, marketing, advertising, etc. 👉 Agency-specific templates including medical, legal, website, etc. 👉 Bonus Domains include photography, travel etc.",
  "data/ph-top/2021/7/dudaflex.json": "DudaFlex is the next-generation editing capabilities that enable you to build gorgeous, pixel-perfect websites, quickly and easily. DudaFlex is integrated in the Duda editor, giving you out-of-the-box responsiveness and total accuracy as you design sites.",
  "data/ph-top/2021/7/sessions-5.json": "Sessions is redefining hybrid communication by bringing all your collaboration tools in one single place. With our unique agenda designer, all your sessions will be flawlessly organized and always on time, no matter the format or the complexity.",
  "data/ph-top/2021/7/saas-blocks-for-tailwind.json": "20% OFF today only. Design the perfect SaaS site. Copy and paste Tailwind components with a clean UI kit design. 80 coded blocks, 110 designed, more coming. Highly customizable colors, icons, fonts, gradients, with color palette ideas.",
  "data/ph-top/2021/7/protonautoml.json": "Anybody can be a data scientists now with our simple one click machine learning tool. No coding or data science background required. Ingest the dataset and tell app what to predict. Intensive focus on data cleaning, so you dont have to clean data.",
  "data/ph-top/2021/7/capchase-expense-financing.json": "Introducing https://www.capchase.com/solutions/expense-financing! 🚀 Pay large bills over time. Built for tech companies! 😎: ✅ Finance large bills on your own terms, and smooth out your cash flows. ✅ Capchase pays upfront for your AWS, Ad spend, software, etc. and you pay monthly!",
  "data/ph-top/2021/7/neeva-4.json": "Created by ex-Google execs, Neeva is the world’s first 100% ad-free and private subscription-based search engine that puts the user first. Neeva never shares or sells user data with anyone and is committed to showing high-quality results for every search.",
  "data/ph-top/2021/7/meet-atslack.json": "meet.atSlack creates human connections at the Slack workplace by making introductions and scheduling meetings.",
  "data/ph-top/2021/7/spreadsheet-com-1.json": "Create spreadsheets as powerful as apps. Spreadsheet.com is the spreadsheet you already know with the power of a database and project management system, combined with no-code automations, integrations, and real-time collaboration.",
  "data/ph-top/2021/7/neverinstall.json": "Neverinstall allows users to run their favorite desktop applications in the browser. No need for installation, no repetitive downloading of files, and better yet, no storage space required.",
  "data/ph-top/2021/7/freshstatus-3-0.json": "🚀 Freshstatus 3.0 brings new features! Build branded status pages and keep customers informed about service availability. Manage incidents or maintenances and share alerts and updates. Also, keep internal teams looped in on what’s going on behind the scenes.",
  "data/ph-top/2021/7/interestinsights-v2.json": "interestinsights will find you thousands of Facebook™ interests that you can target in your campaigns and reduce costs to reach a more relevant audience. Saves you 5+ hours per week as a Facebook advertiser.",
  "data/ph-top/2021/7/foreword.json": "Foreword is a marketplace for live, online workshops. Learn actionable skills that'll help you thrive at startups with topics like: becoming a manager, working remotely, communicating effectively, and more.",
  "data/ph-top/2021/7/zoom-apps-1.json": "Zoom Apps seamlessly embeds third-party apps within the Zoom Meetings and desktop client experience, enhancing collaboration, productivity, and entertainment. There are over 50 Zoom Apps available now, with more in development and available soon.",
  "data/ph-top/2021/7/bauhaus-art-generator.json": "Generated them just in one click having unlimited variants. You can choose a color, a palette, and other settings, as well as sign your masterpiece! ",
  "data/ph-top/2021/7/linkedin-hashtag.json": "❓Which LinkedIn Hashtag has the most followers? With LinkedIn Hashtags, you instantly learn how many people are currently following the Hashtag you want to use. Grow your network and presence on LinkedIn with this extension.",
  "data/ph-top/2021/7/nomod-1.json": "Nomod makes it beautifully easy to process card payments on your phone, with no hardware card terminals or mobile card readers required! Download the Nomod app on Android or iOS and start accepting card payments via NFC, camera, or keyboard, in a few minutes",
  "data/ph-top/2021/7/short-form.json": "Get a weekly email on Fridays that summarizes the 5 best newsletter posts of the week. Read it in less than 5 minutes total. Featuring great writers covering tech, culture, and more.",
  "data/ph-top/2021/7/hive-notes-for-zoom.json": "Use Hive Notes to collaborate on notes and track tasks within Zoom meetings. Leave the meeting with clear tasks and deadlines, so nothing falls through the cracks. Always free, no Hive account needed.",
  "data/ph-top/2021/7/allo-for-zoom.json": "Real-time collaboration and asynchronous communication in interactive visual spaces. Now available right where you need them, in Zoom meetings. Leverage our shared canvases to present to colleagues, brainstorm, and give everyone a chance to contribute.",
  "data/ph-top/2021/7/legion-health.json": "Legion Health is smarter staffing via telehealth for mental health. Telehealth companies, hospitals, and other companies white-label our high-quality network to better meet their patient demand as they scale their psychiatric and therapy offerings.",
  "data/ph-top/2021/7/avoma-assistant-for-zoom-apps.json": "Avoma Assistant for Zoom Apps simplifies the preparation of meetings, automates the note-taking, streamlines the knowledge sharing, and helps make data-driven decisions based on insights derived by AI – right within your Zoom experience.",
  "data/ph-top/2021/7/miro-app-for-zoom.json": "Miro is now seamlessly integrated into the Zoom experience, which means less context switching and more collaborating! With the Miro app for Zoom, you get a canvas for co-creation on every meeting, making them more hands-on and productive.",
  "data/ph-top/2021/7/flora-health.json": "Therapy was not designed with your unique East Asian, South Asian, and Pacific Islander cultural experiences in mind. At Flora, we connect you with an Asian or POC therapist that understands you.",
  "data/ph-top/2021/7/fellow-s-app-for-zoom.json": "You can now access your meeting agendas right inside of your Zoom meetings with Fellow's app for Zoom! 🤩 No more juggling tabs to find your notes. 🤹‍♂️ Fellow’s app for Zoom brings your agendas into a convenient panel right within your video meetings. 💻",
  "data/ph-top/2021/7/polly-for-zoom-apps.json": "Polly for Zoom Apps brings instant engagement to the in-meeting experience. Whether you need to capture live audience feedback, guide a discussion, or simply warm up the room, Polly makes it simple to engage, empower, and entertain Zoom attendees, instantly.",
  "data/ph-top/2021/7/funtivity-by-hermis-2.json": "Funtivity by Hermis is an app for Zoom that enables engagement for a distributed workforce by allowing meeting participants to play activities like Trivia, Bingo, Escape Room, Survey Trivia, Scavenger Hunt and more.",
  "data/ph-top/2021/7/nameland.json": "Ever needed a catchy and cool name for your business but coming up with one seems like a stress? Introducing Nameland - a beautiful & fast business name generator with Namecheap API to check its domain availability quickly and easily. Made for busy people.",
  "data/ph-top/2021/7/quickquery.json": "QuickQuery is a no-code application for quick access to a database. You don’t need to know how to code or have any SQL knowledge. Just filter the columns you want to extract, drag and drop tables onto the canvas, and you’re ready to go.",
  "data/ph-top/2021/7/twitter-real-time-banner.json": "Real-time Banner is a Twitter tool to make your banner special! It makes your banner update in real-time interactively with your followers! It can show the emojis when someone replies to your tweet or show the profile pic of your latest followers.",
  "data/ph-top/2021/7/whatsapp-chatbots-by-sendpulse.json": "Looking to use WhatsApp with multiple users? No engineers or budget to try the power of the WhatsApp Business API? SendPulse democratizes chatbot creation, and now any business or entrepreneur can use a WhatsApp chatbot for as little as $10 a month!",
  "data/ph-top/2021/7/arengu-2.json": "Arengu allows product makers to build signup flows with any API in minutes. You can build the same signup experience as Airbnb, Stripe or Slack, for your application, and without dedicating a full engineering team.",
  "data/ph-top/2021/7/oku.json": "Oku is the companion app for your bookshelf. Track your reading, review & recommend books, create custom collections & follow your friends to receive their updates.",
  "data/ph-top/2021/7/zoios.json": "Zoios People Analytics platform helps companies increase well-being to ensure performance and keep employees longer. We do that by collecting and analyzing People Data to provide insights on which groups are highly engaged, too stressed or likely to churn.",
  "data/ph-top/2021/7/dots-8.json": "Dots is the simplest way to send and accept payments online, especially if you’re a marketplace or hiring 1099 workers. Our API accepts payments from your favorite credit card processor, PayPal, and more. It also enables payouts using Venmo, ACH, Zelle, etc.",
  "data/ph-top/2021/7/showcase-by-framer.json": "A new kind of interactive design community. Browse, start sharing your own work and build up a portfolio of interactive designs, connected to your own unique Framer handle. Learn more and find out how to claim your handle — https://bit.ly/3kBl29c",
  "data/ph-top/2021/7/payze.json": "PAYZE makes it easy for internet businesses in former Soviet Union countries to integrate payments with easy API’s on their website or mobile apps and receive card payments from all around the world through single integration, enabling instant scale up.",
  "data/ph-top/2021/7/onescreener-e-commerce.json": "We are now launching a new feature that gives creators advanced revenue opportunities: the E-commerce feature. With it, users can sell any product/service from their Onescreener in just a few clicks without the help of a designer or developer.",
  "data/ph-top/2021/7/judo.json": "Judo is a Mac app for building native mobile interfaces without code. It's also a platform for enabling server-driven UI—an emerging technique used by companies like Airbnb, Spotify and Facebook.",
  "data/ph-top/2021/7/ready-player-me-hub.json": "Ready Player Me Hub lets you create and manage your avatars across all 300+ supported apps & games. Have a work meeting in MeetinVR in the morning, hang out with your friends in VRChat in the afternoon, and stream to Twitch in the evening using Animaze.",
  "data/ph-top/2021/7/pitchpages.json": "PitchPages allows any Founder to instantly build a beautiful and mobile-friendly investor pitch deck without any code or design, custom branded to your own dedicated URL, and with a built in deal-room to manage your entire fundraise from one place.",
  "data/ph-top/2021/7/range-meetings.json": "Facilitate more efficient, effective, and inclusive meetings. Take notes, record actions, and easily share via email or Slack; increasing transparency. Check-in async to flag items for discussion before the meeting or add actions to your daily plan.",
  "data/ph-top/2021/7/knightley-investor-billboard.json": "Founders use the Knightley Investor Billboard to present their company, with their own voice – highlighting the vision, team, traction and product demo to the world. TOTALLY FREE.",
  "data/ph-top/2021/7/sketch-14.json": "sketch.ws is a free tool to create and share beautiful wireframes within minutes. Key features include: - easy sharing, no login - templates to start with - short urls - drag and drop components - layering - icon packs - more features coming soon",
  "data/ph-top/2021/7/envelop-3.json": "Envelop is a lightweight library that allows developers to create plugins that enriches the GraphQL execution layer with new features. It’s the plugin system for your GraphQL layer.",
  "data/ph-top/2021/7/open-source-alternatives.json": "200+ open source alternatives to tools that businesses require in day-to-day operations.",
  "data/ph-top/2021/7/airplane.json": "The fastest way for engineers to spin up new internal tools. In minutes, convert a Python/JS script, SQL query, or REST endpoint into a lightweight app anyone on your team can use. Make sure operations are run safely with permissions, audit logs, and more.",
  "data/ph-top/2021/7/echoes-hq.json": "Echoes HQ is a whole new take on the problem of measuring engineering activity, focusing on the purpose and impact of the engineers' work.",
  "data/ph-top/2021/7/iphone-mockups-by-previewed.json": "A rich mockup collection featuring iPhone devices that you can use to present your apps and responsive web-design. Generated online, in your web browser.",
  "data/ph-top/2021/7/how-to-do-linkedin-outreach-in-2021.json": "Outbound lead generation is changing, and trends that emerged last year allow us to make predictions. We are eager to share our best practices and strategies that work in 2021 so that you can start using LinkedIn for successfull sales prospecting.",
  "data/ph-top/2021/7/digibuild.json": "DigiBuild is revolutionizing the global construction industry. We are the first to build construction software powered by blockchain. Our tools help large companies like VCC Construction, improve the schedule and budget on projects and save millions annually.",
  "data/ph-top/2021/7/notion-work-journal.json": "Track and progress in your work life with this Notion Dashboard! You will get:- 📝Easy-to-use dashboard 🔑Track all your Key Responsibility Areas (KRAs) 🙋‍♀️A quick overview, anytime & anywhere 📅Filter entries by year 📊Yearly progress bar Get it 🔥",
  "data/ph-top/2021/7/secoda.json": "Secoda is the place to organize company data. With Secoda, teams can centralize their data catalog, queries, charts, dictionary, and documentation in one place so employees aren't lost when looking for answers.",
  "data/ph-top/2021/7/linkroll.json": "LinkRoll is a social bookmark manager where you can easily share your bookmarks and organize them in a visual and intuitive way. You can even use it without registration to quickly share your favorite links with someone. Everything links in a single place.",
  "data/ph-top/2021/7/clearcut-fullstack-developer-roadmap.json": "Best Full Stack Dev Roadmap You Could Ever Imagine 🔥 (300+ Resources). After Tremendous Response for My Twitter thread on Frontend Dev Roadmap, I'm Creating a Full Stack Roadmap and combine it in one place to make the most out of it. Grab it now for $1, Don't miss it 🥳",
  "data/ph-top/2021/7/headspin-performance-report.json": "HeadSpin’s AI-powered App Performance Report shares deep insights to help understand an app’s performance. The Report determines how an application fares on crucial performance KPIs and user experience.",
  "data/ph-top/2021/7/abacus-3.json": "Abacus, Puzzl's Gross-to-Net Calculation API, lets developers access compliant payroll calculations for all 50 states and territories in the United States via a simple API.",
  "data/ph-top/2021/7/paraphrasing-tool-3.json": "The paraphrasing tool is the best sentence rewriter tool available online free for writers, the tool help users to avoid plagiarism and write unique articles in a less time. The paraphrase tool is uses a unique AI technology to rephrase articles that contain plagiarism.",
  "data/ph-top/2021/7/unotask.json": "Unotask is designed keeping human behavior in mind.👩🏻‍🦰 Multitasking doesn't work. 🙅🏻‍♀️ We are most productive when we focus on a single task at a time. Unotask helps you do that with a mental model in its design.",
  "data/ph-top/2021/7/tidbyt.json": "A retro display from the future. If it fits in 64 by 32 pixels... Tidbyt can display pretty much anything, as long as it fits on the screen: ⛅️ Weather 📆 Calendar 📈 Stocks 🚀 Cryptocurrency 🚉 Trains ⛴ Ferries 🚲 Bike shares 🖼 Photos & art 🎵 What you're listening to We're always adding more features.",
  "data/ph-top/2021/7/product-os.json": "Product OS is a complete Notion workspace for product and tech teams. Saves you weeks of Notion settings and replaces Jira, Trello, ProductBoard or your current Notion workspace.",
  "data/ph-top/2021/7/ultimate-footer.json": "Footer is one the most important parts of your website It is the place where users frequently look for information. They are often too messy or not comprehensive enough so I created a collection of free templates and useful tips on how to build a better footer",
  "data/ph-top/2021/7/get-startup-name.json": "I will get acquainted with your startup, listen to your wishes and select for you several variants of the name, with a free domain in the zonecom,io or any other zones, as well as with a free twitter username.",
  "data/ph-top/2021/7/historymaps.json": "Learn History Visually",
  "data/ph-top/2021/7/identiji.json": "We created a new password format that's easy for humans to remember, but extra difficult for bots to guess. As emojis are highly universal, Identiji could be useful for speakers of any language 🌎 Version 1.0 is launched in the form of a browser extension.",
  "data/ph-top/2021/7/wall-street-bets-tracker.json": "WSB tracker is a website dedicated to tracking popular stocks mentions and stats on r/WallStreetBets",
  "data/ph-top/2021/7/keychron-k7.json": "Keychron K7 is the world’s first ultra-slim 65% layout compact wireless mechanical keyboard, as well as the first low-profile Gateron mechanical keyboard that comes with a hot-swappable option to let you customize your per key typing experience with ease.",
  "data/ph-top/2021/7/dear-intern.json": "Dear Intern is a website seeking to immortalize a trend where people came together to talk about their most memorable work mess up and show that it's okay to make mistakes. _ When you've made a mistake and feel the world is ending, just know you aren't alone.",
  "data/ph-top/2021/7/convertonmac.json": "Convert your files absolutely for free. Convert SVG, PNG, JPG & PDF and other file formats with a single click.",
  "data/ph-top/2021/7/the-youtube-thumbnail-game.json": "Play to find out how well you know YouTube!",
  "data/ph-top/2021/7/dastyaaaar.json": "A personal dashboard on your new tab page that helps you self-manage and be more productive. This is Dastyar, a Chrome productivity extension that overrides your new tab page with a personal dashboard.",
  "data/ph-top/2021/7/push-express.json": "Powerful Push Notification testing tool for developers. Supports all signing identity formats (p8, p12, pem, keychain). Good looking UI so you want to use it every day.",
  "data/ph-top/2021/7/exegesis.json": "exegesis is a writing app for nonlinear, stream-of-consciousness thinking. https://exegesis.io/learn/journaling You can also publish your notes right on exegesis, on your https://exegesis.io/post/aadd99000-08ed-11eb-ae72-c39eea4ba4be",
  "data/ph-top/2021/7/scape.json": "Scape is a simple and elegant new tab page designed to show you important information quickly. Some of the core features: - Free and Open Source - Customisable (visual editor coming in a later update) - Accurate Weather - Available on Chromium and Firefox",
  "data/ph-top/2021/7/svg-gobbler-2.json": "SVG Gobbler is an open source browser extension that helps make designing and developing easier by finding, processing, exporting, optimizing, and managing vector content.",
  "data/ph-top/2021/7/no-code-hunt.json": "Find the next best thing being built with no code Find inspo, new products and give feedback to creators",
  "data/ph-top/2021/7/cryolayer.json": "CryoLayer is a no-code tool that optimizes and converts your Webflow site into a high-performance Jamstack site. Stays in sync on every Webflow change!",
  "data/ph-top/2021/7/vs-code-extensions-for-productivity.json": "I have evaluated over 250+ VS Code extensions and created a collection of 34 top VS Code extensions to supercharge your productivity 🔥. You'll find it very useful. Grab it now for $1, Don't miss it 🥳",
  "data/ph-top/2021/7/clarity-556aa538-2af8-41d5-9192-9f6c9ef786ef.json": "Hey guys :) I'm a musician and entrepreneur. I've been streamed over a million times and played 408 shows in 1 year. I built Clarity for musicians & creators of all types to easily access mental health resources and inspirational content in one place.",
  "data/ph-top/2021/7/hashtag-analyzer.json": "All Day Trends is a web-app where you can find trending topics of twitter from all over the world. Find locations where the same hashtags is trending and many more.",
  "data/ph-top/2021/7/simply-hr.json": "Simply HR is an all in one systematic workflow template built for HR executives and startups to manage their team efficiently and be productive throughout the process.",
  "data/ph-top/2021/7/logtime.json": "The simple daily practice of creating a summary of the events, actions and tasks in your day dramatically increases your awareness, productivity and focus as you strive to achieve your goals. Logtime helps to do this practice simply and effectively.",
  "data/ph-top/2021/7/web-vitals-leaderboard.json": "⚡️ Web Vitals Leaderboard is the simplest way to understand how your website’s performance compares to other sites in your industry.",
  "data/ph-top/2021/7/finexy.json": "Finexy is your personalized robo analyst that helps you identify winning stocks and develop personalized portfolios without having to get a PhD in Finance. We process thousands of data points daily so you get accurate insights and can put your money to work.",
  "data/ph-top/2021/7/startup-fundraising-resources.json": "Raising capital is hard. But there are so many amazing resources out there to learn from. We curated articles, templates & tools from the best founders and investors for you.",
  "data/ph-top/2021/7/octane-billing.json": "Easily price on consumption. Offer consumption-based billing without headaches of building it in-house! Set it up in as little as 30min. Try it out at https://www.getoctane.io/",
  "data/ph-top/2021/7/dots-7.json": "Dots helps community leaders scale Slack or Discord communities while keeping it personal! Automate manual tasks (e.g. tracking messages w/o replies, onboarding, mass DMs) and gain member insights (e.g. champions) to save hours/week as your community scales.",
  "data/ph-top/2021/7/mojoauth.json": "MojoAuth is the safest passwordless authentication solution that enables your users to login seamlessly with an email OTP or magic link or WebAuthn, which in turn provides stronger security to your business. The app is free to use, get started at https://mojoauth.com/.",
  "data/ph-top/2021/7/cranks.json": "Trendy characters and colorful shapes combined to produce Cranks stories. Use these catchy illustrations and describe your idea to touch customers’ hearts. The pack is full of 20 colorful high-detailed scenes with very fancy heroes. For Sketch and Figma.",
  "data/ph-top/2021/7/qatalog.json": "Qatalog is a shared space for your people, projects, and tools. Enabling teams to gain an understanding of the bigger picture and make quality decisions. Scale fast with radical transparency, automated knowledge flow, and tightly aligned teams and projects.",
  "data/ph-top/2021/7/read-cv.json": "read.cv is a professional network used by people across the world to create beautiful profiles and meaningful connections. Today we are excited to release a new community front page, private replies, pages, and following.",
  "data/ph-top/2021/7/iconmaker.json": "IconMaker makes resizing App Icons a breeze. Resizes any image into the 46 necessary iOS and Android app icons.",
  "data/ph-top/2021/7/iggy-api.json": "Iggy gives you access to >175 geographic and location-based datasets in an easy to understand and ergonomic API. No special software, no geospatial know-how required to use this location data at scale. Just a simple API request.",
  "data/ph-top/2021/7/coursenest.json": "Coursenest allows you to discover the top Cohort Based Courses on the internet, for free! For course creators, your Cohort gets discovered by people planning to learn the skills you teach ✨",
  "data/ph-top/2021/7/optery.json": "See the private info data brokers are posting about you online (free) 🧐 People's jaws usually drop when they realize how exposed they are 😱 Upgrade and we’ll remove the profiles for you 🥷 We do NOT sell data and are NOT affiliated with any data broker ⛔️",
  "data/ph-top/2021/7/docket-for-zoom-apps.json": "Docket’s new app for Zoom helps productive teams run better meetings. Built for teams who need to make the most of every meeting, the Docket app for Zoom unifies the power of Zoom’s video conferencing & Docket’s collaborative framework for meeting management.",
  "data/ph-top/2021/7/heic-image-import-plugin-for-figma.json": "Import one or multipleHEIC images into Figma as PNG, JPEG or GIF to use on your canvas.",
  "data/ph-top/2021/7/warrant.json": "Warrant helps developers add authorization and access control to their apps. Easily define access control rules and check against them in your app at runtime via API. Warrant manages all the complexity so you can focus on building your core product.",
  "data/ph-top/2021/7/creatospace.json": "Professional networking has muddled up with social media features and become vague. Creatospace has revamped professional networking by experience and qualification generated skill levels as a measure of the authenticity of people on the platform.",
  "data/ph-top/2021/7/cero.json": "Cero lets healthcare providers in Latin America automate communication with their patients using WhatsApp. Our automatic agents chat with patients to coordinate care, solving high volume-repetitive tasks allowing hospitals to focus on delivering better care.",
  "data/ph-top/2021/7/sequin.json": "Meet Sequin, a new type of debit card that builds women’s credit. Women are twice as likely to report a negative experience with credit - Sequin is changing that. Use Sequin like a debit card, and we’ll build your credit with every swipe! No credit check.",
  "data/ph-top/2021/7/justfields.json": "Existing CMS solutions are often not worth the hassle for small projects. Justfields is easy & fast. Configure a minimal CMS online in seconds and use up-to-date content in your project.",
  "data/ph-top/2021/7/smooth-remote.json": "Smooth Remote is the smoothest job board around for anyone on the lookout for remote work. Whether you’re looking for smooth sailing in a startup or an established corporation, or you're a company searching for the best talent, your journey starts here.",
  "data/ph-top/2021/7/linkjoy.json": "If your social media followers never actually visit your website, do they even count? Linkjoy is a social media tool that will help you increase traffic to your site and retarget one-time visitors to enhance your social presence by 10x.",
  "data/ph-top/2021/7/flutin-live.json": "Web-based Live streaming tool that lets you customise & monetise your streams and cast them to multiple social media channels, simultaneously. https://flutin.com/creator/pricing/It is also the only tool providing Instagram Live streaming without any external setup. Plans: https://bit.ly/3l7NWhc",
  "data/ph-top/2021/7/moving-2.json": "Stay Updated with Crypto Like Never Before The only app you'll ever need to stay tuned with what's happening in Crypto and always make great moves.",
  "data/ph-top/2021/7/katlinks.json": "KatLinks is a simple-to-use and affordable SEO tool that helps boost your organic rankings, even if you are not an SEO expert 🚀⚡ Get more backlinks, track rankings, research keywords, and improve on-page SEO so you can rank higher and faster.",
  "data/ph-top/2021/7/dorik-2-0.json": "Dorik is an easy-to-use, flexible, and the most affordable website building platform with beautiful templates and hundreds of UI blocks. Also, it comes with integrations like Airtable, Stripe, Paypal, Memberstack, Zapier, MailChimp, MailerLite & more.",
  "data/ph-top/2021/7/mesmer-sidecar.json": "Start building your apps for everyone. Never leave your disabled users behind. Use Mesmer Sidecar Beta to find and fix accessibility issues before you commit your code. Runs locally on your laptop. Crawls your Andriod app in seconds. Give it a spin.",
  "data/ph-top/2021/7/orbital.json": "Orbital is your always-ready, zero-friction, super-interactive, fun-to-customise, never-seen-anything-like-it-before place to gather. Pop in for meetings, quick chats, open-door office hours, or cowork together through the day – all at the same link.",
  "data/ph-top/2021/7/fama.json": "Fama let's you listen to email newsletters while you're commuting, working out, or doing anything, really. Just like audiobooks! Works with usual podcast apps. No need to install anything new!",
  "data/ph-top/2021/7/show-my-nft-on-twitter.json": "Here, we display our Crypto Art on Twitter. Every day, your profile picture is updated randomly based on your NFT collection. Connect with Twitter, sync your openSea wallet and choose your favorites NFTs. We do the rest.",
  "data/ph-top/2021/7/polydex.json": "💥PolyDEX - “PancakeSwap of Ethereum using L2 solution having zero gas fees” PolyDEX is a gas-less AMM on the Polygon L2 Solution. PolyDEX will have feature like Partner pools, elastic farms, IFOs, quick exits to ETH layer 1, as well as community farms.",
  "data/ph-top/2021/7/ludus-1-0.json": "Ludus is a presentation tool for creative teams looking for a limitless level of sophistication in terms of creation and collaboration.",
  "data/ph-top/2021/7/apideck-vault.json": "When you're looking to connect to an API, the first step is authentication. Vault helps you handle OAuth flows, store API keys, and refresh access tokens. Let your users: - 🔐 Connect 50+ APIs - ⚙️ Manage integration settings - 🕵🏻‍♀️ Discover integrations",
  "data/ph-top/2021/7/protex-ai.json": "Protect your industrial workforce with Protex AI. Protex AI is a user-friendly computer vision tool for proactive workplace safety. It empowers industrial Health and Safety teams to identify risk and danger before it becomes a problem.",
  "data/ph-top/2021/7/cohortfolio.json": "Browse a curated list of the best cohort landing pages across the web to get inspiration for your next cohort. - Organized with tags - High quality (with scroll)",
  "data/ph-top/2021/7/forma-5.json": "Forma provides a simple and minimal interface for handling data submitted via static HTML forms. It's perfect for contact forms, document uploads and more. We provide a very generous nearly-unlimited free tier and paid tiers for businesses with more needs.",
  "data/ph-top/2021/7/meticulous.json": "Meticulous is a tool to catch JavaScript bugs in web applications with zero-effort. Insert our 1-line snippet onto your site and we record thousands of user sessions. We then replay those sessions on new code to find bugs for you, automatically.",
  "data/ph-top/2021/7/perfekto.json": "Perfekto offers a subscription box of ugly produce delivered right to your home, to help reduce food waste in Latin America - starting with Mexico City. The farm-to-table approach means products are fresher than in the supermarket and less CO2 is emitted. 💚",
  "data/ph-top/2021/7/melon-3.json": "Create professional live streams with ease directly from your browser. Reliable and lighting-fast. Packed with unique features like donations and real-time alerts to help you grow. Tons of customization & no downloads required for you or your guests.",
  "data/ph-top/2021/7/reveall.json": "Reveall helps businesses better understand their customers by making it easier to gather, organize and share learnings from customer research and feedback.",
  "data/ph-top/2021/7/jupe.json": "http://jupe.com is a flat-packed dwelling unit inspired by the stars, designed for new frontiers beyond the city and off the grid. Made by Tesla and SpaceX folks, Jupes drop in an hour, ready to rent and permits are rarely necessary. Jupe: just add land. https://forms.gle/byo37hyJFDDPsMNB6.",
  "data/ph-top/2021/7/abstra.json": "Abstra is a tool to build full-stack apps faster than coding by hand. This works by allowing real-time collaboration between developers and designers on a free canvas by giving infrastructure, components and other building blocks.",
  "data/ph-top/2021/7/maker-s-mrr-calculator.json": "See how close you are to your revenue goals with our Maker's MRR Calculator. Enter in your costs, current MRR, and growth rate and we'll calculate the rest. A bit of fun, for makers, from the team at GoSquared.",
  "data/ph-top/2021/7/nothing-ear-1.json": "· Ultralight at 4.7g · Powerful 11.6mm speaker driver · Sound by Teenage Engineering · Active Noise Cancellation · Up to 34 hours of listening · IPX4 rating · transparent veneers",
  "data/ph-top/2021/7/whatsapp-for-livechat.json": "With a newest addition to the LiveChat app, you can let your clients contact your business via another communication channel and keep all your customer communication in one place.",
  "data/ph-top/2021/7/taplytics-for-shopify.json": "Taplytics for Shopify provides the only no-code ecommerce optimization solution that unlocks personalization, experimentation, messaging and analytics, all under one roof. Surface insights into what truly drives revenue across the entire ecommerce funnel.",
  "data/ph-top/2021/7/video-cv-maker.json": "It's 2021 and people are still writing CVs and cover letters ✉️ We think that's crazy and i'm guessing you do too? I decided to release a video CV maker as a way to help candidates stand out and get noticed in a way that was fun and authentic.",
  "data/ph-top/2021/7/cloudthread.json": "Cloudthread’s platform allows Engineering Teams to build in the cloud with cost efficiency. We provide deep level unit cost analytics ($/query, $/request) thorough APM platforms and slack to unlock cost efficiency without development disruption.",
  "data/ph-top/2021/7/mudango.json": "Mudango is Latam’s one-stop-shop for the moving experience. We built cool user-friendly tech products to make moving into your new home a chill adventure full of love and happiness. We also help you set up your new home so that it becomes your happy place)",
  "data/ph-top/2021/7/quickr-design-system.json": "Quickr is a versatile Source of Pre-configured Components & Symbols, Which Allows Creating the Interface for any Application Quickly. It is Crafted to Help You Build Any Easy to Complex Product with Simple Drag-n-drop Components.",
  "data/ph-top/2021/7/designs-ai-suite.json": "- All-in-one integrated suite - Huge content library - Cloud storage and hosting - Online-based software - Manage brand assets easily - Share and collaborate",
  "data/ph-top/2021/7/highlight-reels-by-milk-video.json": "Pull the best moments from your video recordings and compile them into highlight reels with Milk Video. Reels are used for virtual event recaps, Zoom meeting summaries, personalized sales outreach and much more.",
  "data/ph-top/2021/7/ai-background-remover.json": "Automatic, accurate, and ⚡️ lighting fast image background remover tool.",
  "data/ph-top/2021/7/firelab.json": "Get stressed when users complain your app is broken? Eliminate bugs with automated testing to increase customer happiness, reduce churn and grow revenue. No code required.",
  "data/ph-top/2021/7/absurd-design-2.json": "absurd.design is a project which comes with various hand-drawn absurd illustrations for apps, landing pages, presentations, articles, and more. The main idea is to give people a chance to think and spark their creative imagination and artistic vision.",
  "data/ph-top/2021/7/datature-portal.json": "Portal is a Visual Inspection Tool for Vision Models ☝️ No more wrangling with cv2 or matplotlib codes to visualize or test your models, especially on videos. Portal is the fastest way to inspect your neural network inferences on your datasets.",
  "data/ph-top/2021/7/3dmade.json": "A pack of super cool 3D shapes to use in your projects. With customizable tones, surface textures, and colors, these high-resolution shapes are perfect for creating beautiful presentations, posters, apps, websites, and more!",
  "data/ph-top/2021/7/lemon-squeezy.json": "The all-in-one platform for selling digital products, subscriptions, software licenses, and courses is finally here, and it goes by the name Lemon Squeezy.",
  "data/ph-top/2021/7/mint-club.json": "Mint Club is crypto building platform that has no need to code and provides instant liquidity (based on Binance Smart Chain). Anyone can launch a smart token with just a few simple clicks.",
  "data/ph-top/2021/7/growth-threads.json": "The largest collection of threads and amazing people to transform Twitter into a daily source of information to grow yourself and your business 🧵 200+ Threads for your Growth 🤳 150+ Amazing Persons to Follow 🗃️ 20+ Categories 😻 100% Free - No Email Required",
  "data/ph-top/2021/7/tavus.json": "Tavus generates personalized videos of you, unique to each recipient, with YOUR voice and face. Using AI, we automagically generate perfect videos of you, at scale, so you don't have to. No more recording yourself, using robot voices or stock faces.",
  "data/ph-top/2021/7/slive.json": "Slive is a new kind of live streaming platform where you can discover and watch educational / professional live events on the topics you like and network in real-time while the event is live. Today we are launching our Beta, check-it out: https://myslive.com/",
  "data/ph-top/2021/7/ai-podcast-name-generator-by-welder.json": "Trained on 600k+ podcasts. Just describe your podcast as if you were explaining it to your parents and generate a ton of podcast name ideas. It’s free (and sometimes quite funny).",
  "data/ph-top/2021/7/tunefork.json": "\"Tunefork’s audio personalization software optimizes audio to your unique “earprint.” Our patented self-hearing test and proprietary algorithms create a Personal Audio Profile allowing us to provide the ultimate hearing experience designed for you.\"",
  "data/ph-top/2021/7/whatsapp-for-intercom-by-octopods-1.json": "Octopods WhatsApp for Intercom brings the most popular social messaging channel to your Intercom Inbox. Octopods offers a deep integration with Intercom using the official WhatsApp Business API, giving you the best of Intercom and WhatsApp.",
  "data/ph-top/2021/7/donut-for-hybrid-work.json": "Donut for Hybrid Work helps teams build relationships, equitably access opportunities for growth and facetime, and have fun together in a hybrid world. Release includes Favorite Things feature, new hybrid-friendly templates, and Watercooler in shared channels.",
  "data/ph-top/2021/7/litnerd.json": "Litnerd is an online classroom reading program that brings books to life by blending the creator economy to traditional education. Programs include episode reenactments of books, ELA lesson plans, curriculum and ebooks.",
  "data/ph-top/2021/7/pencil-77af9051-19fc-4309-b686-1e2deec34ae5.json": "Tired of iterating for months to find a winning ad? Only to start all over again once creative fatigue sets in? Pencil uses AI to generate completely new ads from your existing set and updates them automatically so your design team can focus elsewhere.",
  "data/ph-top/2021/7/ultimate-ecommerce-landing-page-template.json": "We get it, building landing pages can be hard, but they're so critical in eCommerce. Builder.io partnered with Sharma Brands to create an easy-to-use, customizable, and high-converting landing page. Install and get launched in less than 5 minutes.",
  "data/ph-top/2021/7/microletter.json": "microletter makes it easy to create your own newsletter. It is as simple as it gets, focusing on a great writing experience, and an easy-to-use interface. microletter is perfect for your own little editorial newsletter.",
  "data/ph-top/2021/7/sofa-3-0.json": "Most of the apps we use today are designed for work. Sofa is one of the few productivity apps intentionally intended for play. Create lists of apps, books, board games, movies, tv shows, podcasts, music albums, and video games to enjoy later.",
  "data/ph-top/2021/7/beseda.json": "Instead of meetings, use Beseda to send videos and audios — both transcribed — and have more time for focused work without distractions. Standups, design reviews, reporting bugs, collecting and giving feedback — the sky's the limit for the ways to apply.",
  "data/ph-top/2021/7/slip.json": "🔨 Build an engaging interactive programming course 🖥 Embed executable code snippets, codepens, figma designs, and more 💰 Sell your course directly to your audience and earn money from your programming knowledge.",
  "data/ph-top/2021/7/color-glass-icons-by-icons8.json": "Simple geometric icons with overlapping elements. Recolor them or make them monochrome — they will shine! These icons are real magic crystals for cheerful designs like games, children apps, or funky business websites. Free for a link!",
  "data/ph-top/2021/7/liveblocks.json": "Liveblocks is a set of APIs that helps you create performant and reliable collaborative experiences. With Liveblocks, you can make anything collaborative in minutes so that you can give your core product the attention it deserves.",
  "data/ph-top/2021/7/projecthunt.json": "Discover Top No-Code projects Built In Public 🚀 Sign up to receive a free E-book of No-code Resources!!",
  "data/ph-top/2021/7/jovian-2-0.json": "Jovian is a learning platform for data science and machine learning. You can take free beginner-friendly courses on data analysis, machine learning, deep learning or join a 6-month part-time online bootcamp to master industry-relevant skills and get hired.",
  "data/ph-top/2021/7/viewst-workspace.json": "One workspace that allows you to create, collaborate and launch ads at scale. Viewst allows design and marketing teams to multiply creative volume and variety, go to market faster and out-market competition.",
  "data/ph-top/2021/7/quest-ec0a9a1f-c1af-4ec0-8f51-1dbeb27df880.json": "Convert your Figma designs into live websites. ⠀ Set up custom breakpoints for a truly responsive experience. Add interactions & animations easily. Create fully custom slideshows and forms from your own design. ⠀ Launch it live or export CLEAN code.",
  "data/ph-top/2021/7/spline-alpha-ii.json": "🔥 Now you can use Spline from the browser! (try it at app.spline.design). We are introducing Material Assets and a full Modeling Tool alongside Vector Editing features and a ton of fixes and improvements! ⠀ A big step towards a 3D-First design process.",
  "data/ph-top/2021/7/bonjoro-2-0.json": "Bonjoro 2.0 helps you build amazing customer relationships with video. Onboard new customers, book more sales calls, gather customer feedback, all with quick personalized video-emails.",
  "data/ph-top/2021/7/fodzyme-by-kiwi-biosciences.json": "FODZYME is a novel patent-pending enzyme blend that breaks down FODMAPs — a family of fermentable fibers and known gut troublemakers, specially for folks with gut disorders like Irritable Bowel Syndrome. Start enjoying your favorite foods again!",
  "data/ph-top/2021/7/ev-energy.json": "ev.energy automatically allows you to charge your electric vehicle in the most cost-effective and least carbon-intense way possible, all while you earn cash rewards for your smart charging! Available in the https://apps.apple.com/gb/app/ev-energy-smart-ev-charging/id1418569315, https://apps.apple.com/us/app/ev-energy-smart-ev-charging/id1418569315 and https://apps.apple.com/de/app/ev-energy-smart-ev-charging/id1418569315.",
  "data/ph-top/2021/7/betimeful-browser-extension.json": "Betimeful removes your preferred social media’s news feeds, recommendation videos, or anything designed to get you “hooked” during work. Replace the feed with inspiring daily quotes & schedule “focus blocks” on Google Calendar/ your own built-in popup calendar",
  "data/ph-top/2021/7/woodpecker-academy.json": "Learn how to create and optimize successful cold email campaigns in less than one hour with Woodpecker Academy. Join our course for free and receive a personalized certificate right after.",
  "data/ph-top/2021/7/nash-2.json": "Nash is software that makes it easy to activate same-day delivery by building business workflows on top of delivery APIs (Uber, Doordash, etc). For example, a dry-cleaning business can offer pickup/delivery at a customer’s desired time, without hiring drivers.",
  "data/ph-top/2021/7/silex.json": "Whether you are a maker creating your next project's website or you are a designer making websites for customers, you will love Silex. Your alternative to Wix and Webflow. Hackable, forever free, your design, your way! Free is not just about price. #Freedom.",
  "data/ph-top/2021/7/knights-of-the-flexbox-table.json": "Knights of the Flexbox table is a fun, interactive browser game where you learn how Flexbox works in combination with Tailwind CSS.",
  "data/ph-top/2021/7/llc-toolkit.json": "LLC Toolkit is a straightforward company formation with zero overhead + zero service fees! Our team has 15+ years helping other companies succeeded! #buildinpublic Follow our journey for more perks! 🎁",
  "data/ph-top/2021/7/flagpack-v2.json": "🏴 Flagpack is an open source project of 250+ stunning flag icons for your digital product. Easily implementable in your design or code project. Now with Figma Variants and Svelte Components.",
  "data/ph-top/2021/7/pangea-app.json": "Pangea.app connects companies with college (and recent grad) freelancers. Our platform makes it easy to hire, manage, and pay your future teammates.",
  "data/ph-top/2021/7/colorize-it-3.json": "\"Colorize it\" is an app that uses AI to automatically color grayscale images. It's easy, fast and effective, so no one will notice that the color was added artificially. Try it and give a new life to your old memories by turning them colorful and vivid!",
  "data/ph-top/2021/7/doppler-for-mac.json": "Doppler is a music player for people who buy music. - Speed up organising your music - No need to convert files - Sync with iPhone app - Beautiful design - Powerful integrations Doppler makes owning music and supporting artists simple.",
  "data/ph-top/2021/7/relief.json": "Relief is the TurboTax for getting out of debt. Our app makes it easy by negotiating directly with your creditors to cut down your principal balance in half or more- for FREE Get $100 towards your debt by joining our waitlist & $50 every time you refer friends",
  "data/ph-top/2021/7/free-online-mba.json": "Here is a curated list of resources, that'll help you learn what you would in business school. But with a major difference, it's free!",
  "data/ph-top/2021/7/gauss-ai.json": "Gauss enables any person with a smartphone and an internet connection to be a data labeler, our https://www.loom.com/share/ccfe9262bbb1440590fb390df0e0d23c has unlocked a new labeler ecosystem. Our https://www.loom.com/share/d05f440badf04a1cb02f5c53f530b6d8 allows for Collaborative Data Labeling for Internal Projects across multiple data formats.",
  "data/ph-top/2021/7/sidenotes-1-3-2.json": "SideNotes is a Markdown-based note-taking app for quick notes. More elegant than sticky notes, more agile, and more unobtrusive than big text editors. It lives on the screen side and appears when you need it. Save text, colors, tasks, pictures, file shortcuts.",
  "data/ph-top/2021/7/the-agency-directory.json": "Browse our library of 1000+ agencies offering services in marketing, design, creative production, social media, PR, and more! Filter by location, services, and size to find exactly what you’re looking for. Your search for the perfect agency ends here.",
  "data/ph-top/2021/7/career-switch-to-coding.json": "You have the coding skills to do the job, but do you know how to get the attention of your first employer? Career Switch To Coding is a book that takes you from an unknown coder to turning down more job offers than you accept.",
  "data/ph-top/2021/7/valuetools.json": "🧰 ValueTools is a collection of important tools frequently used by developers, all bundled together in a sleek windows application. Forget about finding sites where you paste your sensitive information just to do some basic work.",
  "data/ph-top/2021/7/masterpluto-get-free-mentorship.json": "Masterpluto is a beautiful platform and powerful force to connect mentors and mentees for 1:1 mentorships. We are a strong community of UX Designers, Software Developers, Product Managers, Data Scientist, Founders and Leaders. May the force be with us!",
  "data/ph-top/2021/7/video-reviews-by-reviewshake.json": "Reviewshake is a SaaS product for online review generation and management. Our latest feature is video reviews: enable them with a single click and start receiving them. You don't have to worry about formats, storage or playback. It's all handled by us.",
  "data/ph-top/2021/7/zine-3.json": "It's really hard to come up with ideas to write on and figure out whether your readers will like your piece or not. This is why we built Zine that allows you to gain readers and direct writing feedback before publishing.",
  "data/ph-top/2021/7/aura-b260f046-6bf7-439f-8cd7-8521db48ae46.json": "Introducing Aura, an easy to use mood tracking app that takes your daily life's mood into account. It allows you to understand yourself better and helps you maintain an even mood throughout the day. The app has various features such as statistics, graphs etc.",
  "data/ph-top/2021/7/visited-states-map.json": "Mark the states you've visited and choose colors to your own liking. Embed the map on your website. Share on Facebook, Twitter, etc., and show your friends where you've been.",
  "data/ph-top/2021/7/uniacquire.json": "UniAcquire introduces a new way to buy and sell companies. It’s an efficient and effective marketplace designed to help business owners and investors connect faster, and reduce time from start to finish.",
  "data/ph-top/2021/7/scispot-io-1.json": "Scispot is a no-code workflow automation platform designed for fast-growing life science companies. Bio companies use Scispot to manage & track their projects, samples, and inventory all in one spot.",
  "data/ph-top/2021/7/mastodon-for-ios.json": "The first official Mastodon app for iOS, with a polished look and a focus on ease of use. Getting started on the decentralized social network Mastodon has never been more straightforward!",
  "data/ph-top/2021/7/blobbb-fun.json": "Blobbb is the fun new way for designers and developers to create their blob-like shapes SVG online. With Blobbb, you can easily generate, modify, and download a nice-looking SVG in no time. Have fun with your blobs! 🥳",
  "data/ph-top/2021/7/interial-clarity.json": "Interial Clarity is a cloud-based tool to help you enlarge your image's resolution 4X. Interial utilizes AI to make sure that the enlargement process as accurate as possible. In addition, Interial Clarity is backed by AWS to ensure a fast upscaling process.",
  "data/ph-top/2021/7/story-time.json": "Recognised employees are more motivated, productive, and engaged in the work to be done than those who are not. Story Time helps create visibility, recognition, and alignment in the workplace by surfacing how people contribute to the success of the business.",
  "data/ph-top/2021/7/product-library-resources-by-zeda-io.json": "A repository of 1200+ value-packed resources for product managers from the web - neatly categorized based on source and type.",
  "data/ph-top/2021/7/polotno-sdk.json": "Polotno SDK is a JavaScript library and set of React components to make canvas editors in your web applications. With built-in support for templates, google fonts, text styles, stock photos, visual edits and more.",
  "data/ph-top/2021/7/appswitcher-for-mac.json": "AppSwitcher For Beautiful Presentation of your Apps. On the iOS-like Big Sur. Switch between Apps and Switch to, show only that App. \"Hide Others Always On\". Have a Clean Desktop + App.",
  "data/ph-top/2021/7/ultimateregexresource.json": "📝 The ultimate collection of regex syntax and resources to power up your programming! A regex cheat-sheet, video presentation, powerpoint, practice lab, and learning app all in one place!",
  "data/ph-top/2021/7/online-gantt.json": "A free MS Project alternative for simple gantt charts. Create project plans with tasks and schedules. Save asgantt files and share with anyone to open and edit for free with a web browser. No need to buy any license or install any software.",
  "data/ph-top/2021/7/outbound-3.json": "Outbound generates a personalized cold-outreach email for you with an advanced AI model, saving you time and cognitive effort when doing email outreach."
}