{
  "data/ph-top/2021/11/codesee-maps.json": "Maps are auto-generated, self-updating code diagrams. They sync your codebase as code evolves. With features to help you understand how files and folders are connected, see how code changes fit into the larger architecture, and more.",
  "data/ph-top/2021/11/codeless.json": "One platform to create and deploy commerce enabled native iOS and Android applications, as well as responsive websites. Use our visual editor for the easiest no-code experience for launching your apps in minutes.",
  "data/ph-top/2021/11/startup-5-2.json": "Startup 5 is a new version of popular website builder and it's a perfect tool to create your online presence. With Startup it’s fast and easy way to get your business online with&nbsp;pre-designed&nbsp;blocks.",
  "data/ph-top/2021/11/free-logos-by-tenscope.json": "While you're validating your idea, there is no need to spend a fortune commissioning a decent-looking logo. We have created a library of free logos which you can use as placeholders for your projects.",
  "data/ph-top/2021/11/purity-ui-dashboard-pro.json": "Purity UI Dashboard PRO is an innovative ReactJS Premium Dashboard based on Chakra UI that will help you create stunning websites & web apps in minutes. ✅ 300 fully coded elements ✅ 32 example pages (smart homes, virtual reality, automotive, CRM admins, etc)",
  "data/ph-top/2021/11/entre-2-0.json": "Entre is an All-In-One platform that allows users to create content, network, and make money from anywhere in the world. We are focused on supporting and helping Entrepreneurs, Investors, and Freelancers so they can thrive in the new economy.",
  "data/ph-top/2021/11/branded-templates-by-visme.json": "Visme brings harmony to brands through an intuitive all-in-one platform to create, collaborate and communicate any type of beautiful content in less time.",
  "data/ph-top/2021/11/mindful-tab.json": "MindfulTab is a chrome extension that remind you to breathe while you wait for your page to load...",
  "data/ph-top/2021/11/dynamic-audience-builder-for-facebook.json": "REVEAL’s Dynamic Audience Builder helps eCommerce merchants improve FB ROAS by using first-party data to build dynamic custom audiences for Facebook and Instagram ad campaigns Evergreen campaigns based on: RFM Segments/ Product / Brand / Date / City / NPS",
  "data/ph-top/2021/11/raspberry-pi-zero-2-w.json": "Raspberry Pi Zero 2 W is perfect for a range of smart home applications and other IoT projects.",
  "data/ph-top/2021/11/solo-3eca70f7-f3fe-46ef-b37a-58e8e3f6a5b2.json": "solo is a new generation of solos working from anywhere. Take control of your schedule. Set your own hours. Make the most of every day and offer customers the convenience to book your time. With solo You can accept payments, get bookings & manage your contacts",
  "data/ph-top/2021/11/12-foot-ladder.json": "Prepend 12ft.io/ to the URL of any paywalled page, and we'll try our best to remove the paywall and get you access to the article. Show me a 10ft paywall, I’ll show you a 12ft ladder.",
  "data/ph-top/2021/11/smartpaste.json": "Copy-paste nicely styled text to apps like GMail and Google Docs without learning new shortcuts.",
  "data/ph-top/2021/11/hireweb3.json": "Web3 is the future. Land your next career with hireWeb3. Browse job listings, companies, and apply through hireWeb3.",
  "data/ph-top/2021/11/payments-on-contra.json": "Contra, along with Chris Messina, present Payments on Contra! Independents can now receive project inquiries, message clients, manage projects, and get paid commission-free without leaving the platform. Learn more here: https://c87.to/payments-on-contra",
  "data/ph-top/2021/11/tolstoy-2.json": "Build innovative, personalized video funnels to interact with users on your website & inside your app. Use Tolstoy for video chat support, video talent screening, video prospecting, and more!",
  "data/ph-top/2021/11/nightfall-developer-platform.json": "The Nightfall Developer Platform is a set of APIs to classify & protect sensitive data, like PII and credentials, to prevent data leaks in your app or service. Nightfall handles the data protection infrastructure so you can focus on building great products.",
  "data/ph-top/2021/11/clarity-1f06e84c-8a36-47ef-9ea5-8d716febce8b.json": "Distraction-free note taking without leaving your keyboard. No more juggling between media controls, mouse and what not. A frictionless experience for note taking on Youtube.",
  "data/ph-top/2021/11/microwonder.json": "microwonder is a marketplace that connects micro-entrepreneurs with investors. We aim to increase the success rate by examining the portfolio of our registered investors and recommending the most suitable micro-enterprises.",
  "data/ph-top/2021/11/adhoc-school.json": "A community-based marketplace for K12 after school activities & activities. In Adhoc School parents & teachers can create online activities and parents can have access to hundreds of activities & communities.",
  "data/ph-top/2021/11/great-diwali-mail-exchange.json": "From the makers of Ramayana Capital and Swadesh Capital, we bring you The Great Diwali Mail Exchange! Make Diwali even brighter this year by writing a heartfelt anonymous letter to a fellow desi in the US. For free!",
  "data/ph-top/2021/11/multiplication-kingdom.json": "Learn the times tables by playing and having fun in the Multiplication Kingdom (for kids and adults!)",
  "data/ph-top/2021/11/jiga-projects.json": "Jiga Projects is the point & comment, Figma-like feature, for 3D model parts. You can easily share a 3D model with your team and comment right on a specific spot on it for easy collaboration.",
  "data/ph-top/2021/11/jotbio.json": "With JotBio you can create amazing mini landing pages in 2 minutes with multiple links of your products and services & social media accounts. You can also add deeplinks, high-converting text, images, videos, custom templates, multiple CTAs with an easy wizard.",
  "data/ph-top/2021/11/cinema-3d-icons.json": "Cinema is a pack of custom 3D icons suitable for any digital product. Create stunning, unique projects with these hand crafted icons, easily editable in Figma, and fully customizable in Cinema 4D. 3D icons rock!",
  "data/ph-top/2021/11/state-of-community-tools-report-by-orbit-1.json": "The landscape of software to organize, communicate with and understand community members is changing quickly. So we surveyed community builders about the tools they use daily. The report guides you through the tooling trends and insights you need to know.",
  "data/ph-top/2021/11/pasteline.json": "Pasteline is an app for quickly saving notes, quotes, and links. Add a note is as easy as text a message in your favorite messenger. Tap to Paste button to save your clipboard information as a note. The app is available on iPhone and Mac.",
  "data/ph-top/2021/11/carbon-neutral-club.json": "Save money for fighting climate change. Start by offsetting your personal carbon footprint, then reduce your climate impact with year-round savings at sustainable brands.",
  "data/ph-top/2021/11/fi.json": "Open a Fi Savings Account online in under 5 mins! Use Fi's cool features to get better with your money — track your expenses, organise your funds, maximise your savings & automate payments. You also get rewarded for saving.",
  "data/ph-top/2021/11/venngage-diagram-maker.json": "Venngage Diagram Maker lets you easily create stunning flowcharts and mind maps that help your team to collaborate, solve problems and communicate complex information. Complex diagrams are easy and quick to build and beautiful to look at.",
  "data/ph-top/2021/11/workdo-2.json": "WorkDo is an easy to use drag & drop landing page builder that allows you to create powerful landing pages for your startup and business in minutes.",
  "data/ph-top/2021/11/starryai.json": "Simply enter a text prompt and our AI 🎨 transforms your words into works of art 🖼️ AI Art generation is usually a laborious process, starryai makes that process simple, intuitive and accessible to anyone with a cellphone. Try it out today! ‍",
  "data/ph-top/2021/11/seo-ebook-by-wizishop.json": "Get insights from some of ecommerce's most renowned SEO experts and increase the sales of your online store. You'll better understand your website's technical SEO and why a bulletproof link-generating strategy is crucial for your store's performance.",
  "data/ph-top/2021/11/good-meetings-power-pack.json": "Bad meetings are bad. GMPP has proven Notion templates and guides to having much better meetings.",
  "data/ph-top/2021/11/please-share.json": "Please Share is a content amplification and engagement app for Slack. The service provides an easy way for employees to share and engage with approved company content on social media channels like LinkedIn and Twitter.",
  "data/ph-top/2021/11/xtream-ly.json": "Gen z says:no one reads comments in live stream,but everyone watches a live-clip(up to2min). Co-create fun moments with idols/friends by replying live to their live-clips in communities. Start a live challenge and let others take it by replying to your clips!",
  "data/ph-top/2021/11/sceneforge-storyboard.json": "SceneForge Storyboard is an all-in-one platform that brings cutting-edge virtual production and pre-vis tech to indie creators and studios. Plan your shoot today to film on your very own virtual soundstage - Built for filmmakers, creators, and Visionaries.",
  "data/ph-top/2021/11/microsoft-loop.json": "Microsoft Loop is a new app that combines a powerful and flexible canvas with portable components that move freely and stay in sync across applications.",
  "data/ph-top/2021/11/motor-admin.json": "Motor Admin is an open-source, self-hosted, no-code admin panel to manage your data, perform custom actions, build reports and dashboards.",
  "data/ph-top/2021/11/image-upscaler.json": "https://imgupscaler.com is an online tool for upscaling your images, photos, animes, and cartoons. Powered by the latest AI technology from ImgLarger, it could upscale multiple image files in a batch. Fast process and stunning results. No account required, no payment now.",
  "data/ph-top/2021/11/pixelixe-creative-automation.json": "Auto-generate unlimited design variations of social media graphics and visual assets instantly. From Ad banners, Etsy graphics, Pinterest pins, Facebook images, to ecommerce banner templates, Pixelixe got you covered. Explore the power of creative automation.",
  "data/ph-top/2021/11/bonjour-app-for-zoom.json": "Salespeople spend a lot of time in Zoom and Salesforce. They often take notes in one place and then transpose them, bit by bit, to other places in Salesforce. We made Salesforce available within Zoom, so salespeople don't do double work and save a ton of time.",
  "data/ph-top/2021/11/mynft-fyi.json": "With PfP NFTs becoming the new Twitter blue check-mark for Crypto Twitter, you can now easily certify the ownership of your favorite NFTs for everyone to see.",
  "data/ph-top/2021/11/nocode-stash.json": "NoCode Stash is one of the easiest ways to discover the best of NoCode. Discover NoCode Tools to use on your next project. Get inspired from NoCode Makers who have built something new. Or get started with the best of NoCode resources - all curated for you!",
  "data/ph-top/2021/11/preply-english-group-classes.json": "Want to speak a new language confidently? Reach your goals with effective group classes. Join other students from around the world in groups of up to 6 people and benefit from a structured learning plan, friendly tutors and engaging classes.",
  "data/ph-top/2021/11/signaturely.json": "Signaturely is the eSignature tool for people who want to keep it simple. No complex workflows. No enterprise-level features. We make it easier to get a signature and move on — because that’s all you want. Free for life + 47 templates to get you started.",
  "data/ph-top/2021/11/startup-hub-by-e-cell-vit.json": "Entrepreneurship Cell VIT is a student body that fosters an entrepreneurial spirit amongst students. With StartupHub we want to give everyone a starting point and adequate resources to become a part of the startup ecosystem and become entrepreneurs.",
  "data/ph-top/2021/11/automa-2.json": "An extension for automating your browser by connecting blocks. From auto-fill forms, doing a repetitive task, taking a screenshot, to scraping data of the website, it's up to you what you want to do with this extension.",
  "data/ph-top/2021/11/discover-profiles.json": "Discover Profile helps you connect with prospects on all their social media channels by discovering all their social media profiles in seconds.",
  "data/ph-top/2021/11/maze-question-bank.json": "The Maze Question Bank is a Notion database with 350+ questions for rapid research and testing. You'll find hundreds of questions to help you collect actionable learnings and make better decisions as a team. - Made with 💙 by Maze",
  "data/ph-top/2021/11/pulse-62f1dca8-9663-4eba-8c5d-1d7cf58bdd16.json": "Pulse is a platform to help high-growing teams share, discuss, and collaborate asynchronously — no matter when or where they are .",
  "data/ph-top/2021/11/clipchamp-by-microsoft.json": "Microsoft recently acquired Clipchamp; a video editor that empowers you to turn your visions for video into reality. Clipchamp is focused on making video creation simple and fun without taking away the flexibility that lets you fine tune the details.",
  "data/ph-top/2021/11/butternut.json": "Butternut is an integration platform that wants to automate advanced workflows requiring logic or human touch. Users can create automation workflows connecting different applications between each other and automating repetitive tasks.",
  "data/ph-top/2021/11/harvel.json": "Copyright protection tool scanning the web for illegal copies of your content, sending DMCA Takedowns to Google and hosting sites, in order to prevent revenue leak and increase sales.",
  "data/ph-top/2021/11/workspaces-newsletter.json": "Workspaces gives you a behind-the-scenes tour of the workspaces from inspiring creatives, designers, developers, entrepreneurs, etc. every week. Delivered to your inbox every Saturday and Sunday.",
  "data/ph-top/2021/11/audli-io.json": "audli.io&nbsp;is an audio plus slides platform. Use the editor to make slides, invite a few guests and hop onto an audio call to show them what you have. Use it to run a class, pitch your idea, or discuss a new NFT.",
  "data/ph-top/2021/11/goal-manager-by-timestripe.json": "Plan, Note, Organize, Schedule, and Collaborate on your projects with a strong focus on Time. Map out what has to be done today to achieve desired results tomorrow. Timestripe works great both for business and personal life management.",
  "data/ph-top/2021/11/dark-vader-for-figma.json": "- Easily switch hundreds of layers to any theme - Compatible with any Design System - Not only for dark mode but for any theme - One-time setup - Works for the whole team",
  "data/ph-top/2021/11/learning-audrey-a-360studio-docu-series.json": "Dive into the reality of changing careers in a fast-paced startup. Follow Audrey as she starts her new job. To succeed, she has to relearn everything. Will she manage? Watch the full series now.",
  "data/ph-top/2021/11/whiteboard-owl.json": "Owl Labs’ new whiteboard camera pairs with the Meeting Owl to deliver a whiteboard experience that’s better than being in the room. It enhances and captures content to ensure hybrid whiteboard sessions don’t leave remote participants out of the discussion.",
  "data/ph-top/2021/11/hipaa-compliant-analytics-by-freshpaint.json": "Freshpaint is the only HIPAA-compliant customer data platform: unify customer data, control PHI, & integrate 200+ tools. ID Masking & Enforced Allowlists enable healthcare companies to use tools like Mixpanel or Amplitude without paying extra for a BAA.",
  "data/ph-top/2021/11/personal-ai-2.json": "We forget 80% of the information we experience every day. Speak, write or upload insights, information and experiences into your personal AI so you can recall your memories exactly when you need them.",
  "data/ph-top/2021/11/jam-edit.json": "Edit your website right from the page, and easily send the exact change to engineers to copy/paste. Move faster. Save dev cycles. Ship better products.",
  "data/ph-top/2021/11/mojo-00e718a0-08ce-4997-8abb-ea48df7ce23b.json": "🍄 Mojo helps you adapt. A reverse-engineered blend of functional mushrooms, herbs, and roots that mimic the experience of a psilocybin microdose, without any of the worry. Available in soft chews of 5 pack and 20 pack.",
  "data/ph-top/2021/11/n8n-desktop-app.json": "n8n is the automation platform you never outgrow. With it, you can create complex workflows, insert code snippets where needed, and stay in control by auditing the source code and storing data locally. Our desktop app can be installed with just a few clicks.",
  "data/ph-top/2021/11/pimp-my-readme.json": "Pimp my README is an open source profile builder that you can use to add some cool components to your README profile. Reminiscent of MySpace days and its myspace editor (https://www.pimp-my-profile.com/generators/myspace.php)",
  "data/ph-top/2021/11/mindfulbuy.json": "MindfulBuy is a chrome extension that reminds you to think twice before buying.",
  "data/ph-top/2021/11/icon-3.json": "Create fashion lines; sell them as digital goods using our powerful in-app style creator. Link them to NFTs. Explore the latest fashion trends; post them to your feed using your 3D avatar. Forge a new identity, discover new friends. Become a fashion ICON!",
  "data/ph-top/2021/11/sandhill-io.json": "SandHill.io aggregates the latest content from the blogs, substacks, and medium feeds of 600+ VCs and industry-focused startup analysts. Each week’s top analyses are shared via the weekly newsletter – https://newsletter.sandhill.io/",
  "data/ph-top/2021/11/lex-markets.json": "LEX is a venture-backed commercial real estate securities marketplace. LEX allows all investors - accredited and non-accredited - to buy and sell shares of individual commercial real estate assets without lockups, starting at $250/share.",
  "data/ph-top/2021/11/puffin-maps.json": "The all-in-one trip planner for your next adventure. Effortlessly plan your travel routes and itinerary. Drag and drop locations. Seamless real-time collaboration. Track your trip progress on the go. All of this and more from an easy-to-read map!",
  "data/ph-top/2021/11/umso.json": "Umso (formerly Landen) is a website builder to easily create beautiful websites. Built for entrepreneurs who want to quickly go live without having to code or design. Our goal is to support young businesses on their journey.",
  "data/ph-top/2021/11/mocap4face.json": "Realtime facial motion capture SDK enabling live animation of 3D avatars, NFT PFPs etc. iOS, Android, Web 42 tracked facial expressions rigid head pose in 3D space blendshapes weight values per frame eye, tongue tracking 3MB model 60+ FPS (iPhone SE 1st gen)",
  "data/ph-top/2021/11/embedsocial-forms-builder.json": "EmbedSocial Forms Builder lets you create beautiful online forms that can transform into interactive form widgets on any website, engage more efficiently, and get more results.",
  "data/ph-top/2021/11/alertphant.json": "Losing sleep over campaign results, and missing important signals? Try AlertPhant! It's a chatbot that sends you regular notifications about your digital campaign performance, reports anomalies, and much more!",
  "data/ph-top/2021/11/codecademy-docs.json": "https://www.codecademy.com/resources/docs is a collection of simple-to-use coding documentation. Find hundreds of entries written by experts, educators, and the Codecademy community. Or contribute your own, and join us in building a free resource that anyone can use!",
  "data/ph-top/2021/11/corrily-price-api.json": "Corrily Price API delivers personalized prices to users in real-time, figures out variables affecting users’ willingness to pay, and adapts prices instantaneously. With a few lines of code, run price experiments and charge optimal prices to increase revenue.",
  "data/ph-top/2021/11/thresholds.json": "Earn up to 6.25% on your USD, paid daily in bitcoin, with more cryptocurrencies coming soon. Our high yield DeFi growth account is powered by stablecoins and decentralized finance.",
  "data/ph-top/2021/11/voucherify-4.json": "Voucherify is an API-first, cloud-based promotion and loyalty management platform allowing to distribute and track personalized promotions, gift cards, giveaway campaigns, referral, and loyalty programs like e-commerce giants do, but at a fraction of the cost.",
  "data/ph-top/2021/11/if-invested.json": "Easy to use cryptocurrency investment calculator.",
  "data/ph-top/2021/11/3d-bay-1.json": "Welcome to the largest free 3D stock image resource on earth! At 3D Bay, you can find an assortment of high-quality 3D illustrations sorted into a range of collections and categories. Feel free to download and use any number of images without attribution.",
  "data/ph-top/2021/11/coffeeopia.json": "Coffeeopia is the place to discover, review and discuss specialty coffee, roasters and coffee shops. Rate coffee, explore taste insights and expand your coffee taste ☕️",
  "data/ph-top/2021/11/uru-boards.json": "Hand crafted longboards made out of hand woven bamboo wood by tribes of India. Uru Board crafts world class variety of longboards for High End and High Purpose.",
  "data/ph-top/2021/11/capo-2.json": "Using the songs in your music collection, Capo guesses the beats, chords, and key of songs to help you break them down to their individual parts. Capo’s unique technology helps you to learn your favorites quickly as you improve your ear along the way.",
  "data/ph-top/2021/11/session-management-by-clerk.json": "Speed up your application with sub-millisecond authentication, mitigate hackers with active device management and revocation, and much more.",
  "data/ph-top/2021/11/outline-to-single-stroke.json": "A Figma plugin that does the opposite of the \"outline stroke\" function -- converts filled shapes back to editable single line vectors",
  "data/ph-top/2021/11/free-invoice-2.json": "We have created this free invoicing software for anyone to use, to create invoices on the spot for free. Free forever, no tiers, credit cards. We also have free templates in Word and Excel you can download if you don't want to create an account.",
  "data/ph-top/2021/11/meep-meep.json": "Widgets for tracking activity of any instagram-accounts right on a home screen. Multiple widgets can be added only with a promo-code, and that are promos for ProductHunt: 997547, 768766, 335102, 104870, 243243, 732069, 588277, 905557, 753225, 330997. Enjoy!",
  "data/ph-top/2021/11/sidenotion.json": "Record lecture snippets and screenshots in one command. Saved to your Notion document automatically Native quality audio and video",
  "data/ph-top/2021/11/indmoney.json": "INDmoney is a SuperMoney app to track, save, plan & invest. INDmoney automatically & securely tracks all your investments, loans, expenses, credit cards, savings a/cs, PF’s, EPF’s. You can track across brokers, banks, distributors & advisors.",
  "data/ph-top/2021/11/dockcase.json": "DOCKCASE USB-C Smart Hub is a human-machine interaction hub with an intelligent visual operating system, which allows you to control various functions, switch operation modes and upgrade firmware intelligently to adapt to different working scenarios.",
  "data/ph-top/2021/11/pdf2preview.json": "Generate a preview image for your PDF file. Demo: http://pdf2preview.chuanenlin.com/ Code: https://github.com/chuanenlin/pdf2preview",
  "data/ph-top/2021/11/beacon-10.json": "Beacon is a navigation sharing app for sharing ETA and arrival notifications while keeping location private. ETA is updated as routes and conditions change. Sharing can be between two or more people, making it perfect for groups and meet ups of any size.",
  "data/ph-top/2021/11/notchtastic.json": "Whether you're a designer or a Mac enthusiast, Notchtastic helps you experience a Mac camera notch on your current device today! Notchtastic renders a realistic camera notch at the top of your screen, simulating the notches released in the 2021 MacBook Pros.",
  "data/ph-top/2021/11/flookup-for-google-sheets-v-2-0.json": "Flookup is a Google Sheets add-on that uses fuzzy matching to clean data in any of the following ways:﻿﻿ 1. Remove duplicates. 2. Highlight duplicates. 3. Match or merge data. 4. Calculate the percentage similarity between strings.",
  "data/ph-top/2021/11/sproutypod.json": "The quick and easy system to grow your own food and harvest a healthy and delicious lifestyle all year round.",
  "data/ph-top/2021/11/twitter-tv.json": "There you go turn any twitter account into a screen saver. *For desktops and big screens*",
  "data/ph-top/2021/11/ayro-ui-2-0.json": "Bootstrap UI Components Snippets for Creating Fast & Responsive - Landing Pages, Templates, or Websites by Copy-Pasting Snippets. UI Library of 300+ Free and Premium Beautiful UI Components, Snippets, Blocks, Pages, and Templates.",
  "data/ph-top/2021/11/upupland.json": "it's time to explore web3. With upupland we created a database of interesting products and resources that make it easy to explore web3.",
  "data/ph-top/2021/11/lucidscale.json": "From the makers of Lucidchart and Lucidspark, Lucidscale is the cloud visualization solution that helps organizations see, understand and optimize cloud environments, enabling technical and non-technical users to achieve better understanding and alignment.",
  "data/ph-top/2021/11/wobaka-2-0.json": "Forget about the CRM systems that include webpage builders, blog engines and 97 other features you don't need. Wobaka is the all-in-one CRM and sales automation tool that makes it easy to manage contacts and automate outreach, without losing your mind.",
  "data/ph-top/2021/11/cooldown-1.json": "In macOS Monterey Apple introduced a new Low Power Mode for Mac. Cooldown is a simple menu bar app that allows you to quickly toggle Low Power Mode on and off.",
  "data/ph-top/2021/11/ssshape.json": "An SVG blob/shape generator that gives you extra controls. Design interesting organic-looking shapes in a few clicks and export them as SVG to use in your designs.",
  "data/ph-top/2021/11/codepng.json": "Codepng allows you to create awesome snapshots from your source code that you can share on social media. Choose between beautiful hand-selected background gradients and editor themes before exporting your code to PNG images.",
  "data/ph-top/2021/11/jobs-in-health-tech.json": "Jobs in Health Tech is a jobs board for health technology and life sciences. Our mission is to help as many ambitious people to work on improving healthcare through providing them with relevant industry jobs.",
  "data/ph-top/2021/11/spark-c33b3265-3e29-4684-a465-0bfbd07bfe42.json": "We made a small app in collaboration with a psychologist which will serve as a safe haven for people with severe social anxiety, here they can discuss their issues among themselves without stigma or judgement. Heavily curated and moderated.",
  "data/ph-top/2021/11/excalideck.json": "An app for authoring slide decks that look hand-drawn.",
  "data/ph-top/2021/11/holygym.json": "Holygym is an app created to give people free option to work out at home. Plenty of workouts plus workout generator gives you endless possibilities. Simple and minimalistic design sets focus on exercises. Health integration ensures you will close your rings.",
  "data/ph-top/2021/11/heurio-2-0.json": "https://chrome.google.com/webstore/detail/heurio-ux-check-visual-fe/pjdbofhiijhapnmpgilkeammkanglfdj is here to revolutionize your website reviews! Use the extension to make comments and collaborate directly on any live website. Leave prioritized notes, assign actionable change requests, do UX or copy reviews in a user-friendly and collaborative way.",
  "data/ph-top/2021/11/sembly-personal.json": "Record, transcribe, and search your meetings on all major conference platforms (gMeet, Zoom, Teams, etc) with https://www.sembly.ai/?utm_source=ProductHunt&utm_medium=Profile&utm_campaign=SemblyAI. Stay tuned to find the magic in your meetings with https://www.sembly.ai/professional?utm_source=ProductHunt&utm_medium=Profile&utm_campaign=SemblyAI: highlights, digest, follow-up detection, and more!",
  "data/ph-top/2021/11/shhh-noise.json": "A free sound generator designed to increase focus and relaxation. Mix and match soundscapes, and share your creation with others.",
  "data/ph-top/2021/11/learnd.json": "Educate users without repeating yourself over and over in live-chat. People don't like to navigate in helpcenters for hours, so give them answers immediately. Designed for SAAS who want to to reduce time spent on customer support, increase retention and MRR.",
  "data/ph-top/2021/11/startcasts.json": "Startcasts is a search engine for startup & product podcasts. Learn from leaders across marketing, development, design and more.",
  "data/ph-top/2021/11/schedulr.json": "Schedulr makes it easy to meet with others w/out the headache of back-and-forth emailing. Our goal with Schedulr is to help you quickly find a time to meet with others, w/out doing the calendar dance. PH users get 50% off first year or a free month!",
  "data/ph-top/2021/11/chrome-extension-for-bubble-2.json": "With our integration you can build Google Chrome Extensions without code using your Bubble App! ✅ Embed your Bubble app in a Chrome Extension ✅ Receive Data in your Bubble App from the Extension ✅ Trigger actions in the Chrome Extension from your Bubble app",
  "data/ph-top/2021/11/uiui.json": "Hey, I’m Gobie 👋 I created this UI collection for others to play around with! This collection will grow naturally over time. If you have a cool example you would love to see here, I am happy to add it as well :)",
  "data/ph-top/2021/11/pack-of-carrds.json": "Pack Of Carrds cuts the time and cost it takes to build an effective and beautiful landing page. Stop wrestling with design and start focusing on what you can do best. Our professionally designed, high-converting, affordable templates will do the rest.",
  "data/ph-top/2021/11/daftcloud-4-0-for-macos.json": "Ever wondered what that awesome track was playing in your favorite mix? If yes, then this might be the best day of your life, because DaftCloud has added full Shazam integration recognizing in realtime what is currently playing within the app. 🎵",
  "data/ph-top/2021/11/virtually-events-manager.json": "Virtually is the easiest way to automate your Zoom events. Create calendar invites, send reminders, and track attendance. Also, it plays well with the tools you know and love like Zapier, Airtable, Google Calendar, Slack, and more.",
  "data/ph-top/2021/11/sityea.json": "SitYEA is a Windows application, which helps to remain healthy while working on the computer. 💻 Keep correct posture during the day! 🤩 And avoid back pain!",
  "data/ph-top/2021/11/mojilink.json": "Mojilink makes the impossible possible: Every user of the app can now add links to any Instagram or TikTok post. And open them with just a few taps!",
  "data/ph-top/2021/11/epoch-equity.json": "We take the headaches out  of selling a business. When selling your business, you have to deal with attorneys, accountants, bankers, brokers, appraisers, and the list goes on. Take a breath, relax and let us do the hard work.",
  "data/ph-top/2021/11/mindpass.json": "Mindpass makes passwords simple, easy, and secure - all through the power of the Mindpass 3D environment. No more complex master key memorization. No more passwords, ever! Simply select four objects in the secure Mindpass environment and we’ll do the rest!",
  "data/ph-top/2021/11/reacty.json": "reacty makes collecting user feedback for your website easy and privacy-friendly. It doesn't store cookies, nor the data of your users. All you need to add it to your page is one line of code. You don't even need to know how to code!",
  "data/ph-top/2021/11/game-development-starter-kit.json": "Internet is full of free learning resources. Our team has handpicked the best game development resources for anyone who's passionate about games. We have invested 100+ hours in building this starter kit so that aspiring game developers can save theirs'.",
  "data/ph-top/2021/11/forkist.json": "Forkist is a social network focused solely on sharing your restaurant experiences and recommendations with your connections. Rather than relying on reviews from strangers, you can now tap into your network to find the best places to eat!",
  "data/ph-top/2021/11/hashfinder.json": "Hashfinder is the Search Engine for the social web. It's a place where you can discover popular posts via hashtags, find out what topics are hot on Twitter, Youtube, Reddit, Tumblr, and more.",
  "data/ph-top/2021/11/huey-io.json": "Huey is an Interactive Org Chart tool that can integrate with Slack. Huey doesn't require any design and was built so that your entire team can access it. Employees can search by skill, name, title, department and more from within the app or right in Slack",
  "data/ph-top/2021/11/repobeats.json": "Repobeats is a way to embed contributor analytics into your GitHub project's README.md. With Repobeats, contributors and users of your projects get a clear, beautiful, view of how your project is evolving over time.",
  "data/ph-top/2021/11/kosy.json": "Kosy is a virtual space for remote teams to work and hang out in. Use spatial video-chat to get in and out of conversations naturally, customise your space to make it feel like yours and make spending time with your remote team fun & productive!",
  "data/ph-top/2021/11/airtable-to-postgresql-migration-tool.json": "A totally free migration tool. Move your data from Airtable to a PostgreSQL database in 1 click. No extra steps, no tool lock-in.",
  "data/ph-top/2021/11/overloop-crm.json": "Everything starts with a good conversation. That’s why our CRM is designed to help you start more conversations and close more deals. Main features: - Outbound sales - Deals & Pipelines - Web Forms - Workflows & automation - Email Finder - Forecasting -..",
  "data/ph-top/2021/11/devpage.json": "Dev.page is your all-in-one developer page - a single page with your info, bio (markdown supported), skills, and links to your GitHub, StackOverflow, LinkedIn, Twitter, Blog and more. Claim your dev.page username and build an amazing page in just 2 minutes!",
  "data/ph-top/2021/11/scout-by-conversion-crimes.json": "You know how to use your site and software and where to find information on it because you built it and work on it all the time! But, do you know what it looks like to someone for the first-time? Find out with Scout - FREE.",
  "data/ph-top/2021/11/recurring.json": "Keep track of the SaaS tools your company is using. Find tools you're no longer using, catch spikes in expenses, and identify duplicate functionality. All you have to do is forward your receipts (you can also connect Quickbooks).",
  "data/ph-top/2021/11/emerson-ai.json": "Emerson is an exceptional AI conversation partner that never stops teaching you new things. Use it to practice languages, learn new things or just have a casual chat. Emerson can talk to you via voice & audio and speak in 🇬🇧 🇪🇸 🇯🇵 🇩🇪 🇨🇳 and more!",
  "data/ph-top/2021/11/snapcall-for-livechat.json": "SnapCall for LiveChat allows you to enhance your customer support with voice & video calls directly in the chat widget on your website. Share your screen via the LiveChat App and show solutions that are hard to tell, even using your mobile device!",
  "data/ph-top/2021/11/wpfunnels.json": "WPFunnels is the first-ever canvas-based sales funnel builder in WordPress. Plan, design, and build complete sales funnels visually on a drag and drop canvas without leaving your WordPress dashboard.",
  "data/ph-top/2021/11/kudos-by-wfhomie.json": "Open Slack, type your kudos message, tag your teammate and give your team visibility into celebration-worthy moments - appreciate the GOATs with optional gift cards, and boost company culture! _ /kudos @Michael Scott thanks for being the world's best boss!",
  "data/ph-top/2021/11/cascade-io.json": "Cascade.io allows ops teams and analysts to automate the data workflows that power their business, all without code. Whether for crunching shipping data, dispatching drivers or generating invoices, Cascade's platform enables data-savvy teams to automate work.",
  "data/ph-top/2021/11/middesk-agent.json": "When you hire in a new state, you have to set up & manage many government accounts. It's long, painful, and each state is different. Middesk Agent takes over this process & manages your state compliance.",
  "data/ph-top/2021/11/octofix-gate.json": "OctoFix Gate is a free tool that makes private content on your website available only to your email list members. It works with any website builder or email marketing tool.",
  "data/ph-top/2021/11/you-com-2.json": "You.com, the world's first open search engine platform that summarizes the web for users, with superior privacy choices, actionable results, extensible apps and personalization through preferred sources.",
  "data/ph-top/2021/11/startup-ceo-s-guide-to-customer-success.json": "Startups are now hiring customer success people within their first 10 employees... but what does a great customer success team look like? Read this guide to learn why customer success matters, how to get started, and how to highlight your impact!",
  "data/ph-top/2021/11/airtable-interface-designer.json": "Build visual and interactive interfaces in minutes with Interface Designer. Give each and every teammate the information they need, and a simple way to take action.",
  "data/ph-top/2021/11/notion-avatars.json": "NotionAvatars.com is a cool place, where you can create your own avatar, in Notion style. 100% free, 100% online, 100% fun.",
  "data/ph-top/2021/11/stepzen-graphql-studio.json": "Create your own GraphQL API in just a few clicks! No resolvers to write. No data connections to code. No servers to build - your API runs serverless in the cloud on StepZen.",
  "data/ph-top/2021/11/gamebytes.json": "Play games directly in iMessage and make new friends to play with. Gamebytes brings a fresh collection of games to iMessage along with a dedicated chat app to be the home for all your chat games.",
  "data/ph-top/2021/11/stringmark.json": "https://chrome.google.com/webstore/detail/stringmark-highlight-for/eihjeapbmmihijddoaphdcmgpfejaecd is an extremely easy-to-use Chrome Extension that allows you to save Links and Texts that are relevant to you. It is basically a bookmark feature but way more precise and efficient.",
  "data/ph-top/2021/11/hbd-facebook-export.json": "Still hanging on to Facebook just for birthday reminders? Export them with hbd's Safari Extension so you can finally ditch FB for good!",
  "data/ph-top/2021/11/narrative-bi-for-google-analytics.json": "Narrative BI is automated no-code analytics for your Google Analytics data. 🙊 Personalized reports in natural language 😻 Automated anomaly detection 😇 Slack integration 🏁 Fast and easy to onboard 🥳 No expertise required",
  "data/ph-top/2021/11/refine-2.json": "refine is a React-based framework for building data-intensive applications. It offers lots of out-of-the box functionality for rapid development, without compromising extreme customizability. It ships with Ant Design System, an enterprise-level UI toolkit.",
  "data/ph-top/2021/11/momentum-a463106c-367e-42b9-a851-0b22c31b6473.json": "Momentum is a no code platform to automate sales workflows. By embedding into existing sales-first tooling, from Slack and Salesforce to Asana and Outreach, Momentum gives revenue team the building blocks to operationalize sales motions and improve efficiency.",
  "data/ph-top/2021/11/firstory-podcast-dashboard.json": "Know your podcast in just one glance. Firstory Hosting’s new dashboard includes: - Benchmark your podcast vs others’ - FLink (In-house ‘Linktree’) Stats - Audience Listening Times - Audience Demographics - Top Episodes, & more!",
  "data/ph-top/2021/11/feedback-friday-by-matter-for-slack.json": "Matter is a free forever Slack app that includes unlimited members and feedback. Our free plan includes new premium features like Feedback Friday, Custom Kudos, Continuous Feedback, Feedback Surveys, and much more.",
  "data/ph-top/2021/11/cutcam.json": "CutCam is the first and only hair clipper with an integrated Wi-Fi camera paired with in-app tutorials from Master Barbers so you can see exactly where you're cutting and give yourself a great cut. Pair CutCam with your smartphone and unlock your inner barber.",
  "data/ph-top/2021/11/pipifire.json": "We all watch videos. Every day. Unleash your productivity on your iPhone with PiPiFire 🔥. Watch YouTube videos on your iPhone while reading tweets or even while browsing Product Hunt with a magic tap on youtube.com with iOS 15, Safari. Enjoy it! ❤️",
  "data/ph-top/2021/11/subcap.json": "Subcap is a mobile app that makes videos readable with auto subtitles. Subcap’s auto-captions maker uses artificial intelligence to generate subtitles in 125 languages and variants. Subtitles can be added in different colors, fonts, or positions.",
  "data/ph-top/2021/11/state-of-ios-in-app-subscriptions-2021.json": "iOS in-app subscriptions insights, expert analytics, and benchmarks! Based on 20m subscribers from America, EU, UK, Asia, and Oceania: * Average subscription price * LTV * Free trials analytics * Subscription retention * Billing issues Get it for free!",
  "data/ph-top/2021/11/loti.json": "Part guide, part guidance counselor, we optimize the decision making process of finding an online course by centralizing information about instructors, their courses, and their communities, so that you can focus on what matters most: learning something new.",
  "data/ph-top/2021/11/the-pm-s-newsletter.json": "A weekly newsletter for product managers to catch up on everything related to product management. You will find some good reads, book reviews, podcast recommendations, and a lot more. Join 3000+ PMs who enjoy Product Cafe.",
  "data/ph-top/2021/11/mosaic-by-cruip.json": "Mosaic is a powerful admin dashboard template built with Tailwind CSS. It features hundreds of pre-built pages and sections and is coded in HTML, React, and Vue.",
  "data/ph-top/2021/11/linkz-ai.json": "Install Linkz.ai in 2 minutes and instantly enrich your website with immersive hyperlink previews. Linkz.ai previews help your visitors to get context from linked content without bouncing between browser tabs, and most importantly, without leaving your site.",
  "data/ph-top/2021/11/filestar.json": "Filestar is a new file automation tool. Simply select one or more files, then type what you want to do with them. The application then figures out the best way to perform your command and seamlessly downloads the required resources called “skills”.",
  "data/ph-top/2021/11/the-ios-app-icon-book.json": "The iOS App Icon Book features hundreds of works of art from individuals and teams around the world. It serves as an inspiration and as a historical collection covering more than a decade of design on the iOS platform.",
  "data/ph-top/2021/11/crypto-jobs-list-3-0.json": "The biggest cryptocurrency, blockchain and web3 job board on the web. Over 3.9k jobs from 1.4k leading crypto companies and foundations, 56k applications, 1.2k salaries and 18k+ talent profiles.",
  "data/ph-top/2021/11/stable-reminders.json": "Stable Reminders are email notifications sent directly to your inbox before important federal and state filings are due. These reminders are customized to your entity type and state(s) you've registered to do business in — and it’s all for free.",
  "data/ph-top/2021/11/teamflow-2-0.json": "Teamflow is your all-in-one virtual office where teams can collaborate, meet, brainstorm, and hang out.",
  "data/ph-top/2021/11/spacetable-2.json": "Browse the latest Twitter Spaces happening right now and view Spaces coming up in the next 2 weeks. Normally it's hard to find Twitter Spaces other than those from people you follow. SpaceTable makes it easy to discover Spaces you would never have found.",
  "data/ph-top/2021/11/css-loaders.json": "A general situation that we all might face while going through websites/apps is to wait for something to get loaded. Considering this, created a collection of such loaders. It's developed using pure CSS. Hence it will load fast and is easily customizable too.",
  "data/ph-top/2021/11/now-push-notify.json": "iOS does not support browser notifications today, but Now Push Notify makes this possible. Send push notifications to your iOS visitors through the Now Push app. Compliment your email marketing and reach your users on their terms, and on their phones!",
  "data/ph-top/2021/11/the-sales-email-deliverability-guide.json": "An in-depth guide to understanding email deliverability and how to improve it. Used by hundreds of sales teams to maintain a healthy reputation while doing sales at scale.",
  "data/ph-top/2021/11/modemagic-2-0.json": "At ModeMagic, we power Shopify storefronts with nocode store blocks on auto-pilot. Power up with one-click 📈sale+stock automations, convert better with 🛍️product guides & how-to's, and deliver real-time price & 🛒bestseller updates with badges.",
  "data/ph-top/2021/11/popupsmart.json": "Popupsmart is a no-code popup builder tool to increase e-commerce sales, build email lists, and engage with your visitors in just 5 minutes.",
  "data/ph-top/2021/11/pichon-for-mac.json": "Tons of free high-quality icons, photos, and illustrations in a single desktop app. Get ever-growing curated collections at a click distance and forget about wasting hours searching for graphics. Keep your flow and save your time for creative tasks!",
  "data/ph-top/2021/11/zcal.json": "Say goodbye to cold, impersonal scheduling links. Use zcal to create beautiful, personalized booking pages that make a great first impression on your guests. It's 100% Free Forever 🔥!",
  "data/ph-top/2021/11/geekbot-for-ms-teams.json": "Status updates are key to progress. But you don't have to run them in person. Get Geekbot to automate standups, retros, and surveys in Microsoft Teams — helping you enjoy fewer meetings, save time on reporting, and still see who’s working on what.",
  "data/ph-top/2021/11/vig.json": "vig is a web and mobile app that provides gamified decision intelligence for Stocks, Options, Crypto, and ETFs. Get real-time data and analytics, discover new investments, find trade opportunities, learn about the markets, and even play fantasy stock games.",
  "data/ph-top/2021/11/cosell.json": "Unlock revenue through your exclusive network purpose-built for referrals and relationship-selling. Leverage your investors, advisors, customers, and internal execs to break into your key accounts.",
  "data/ph-top/2021/11/mydata.json": "myDATA³ is designed for marketers & founders who want accurate insights on how well their web, email, social and customer strategies are performing against competitors in order to get an edge over them.",
  "data/ph-top/2021/11/colorhub.json": "ColorHub helps web developers find the perfect color palette for their next project. Simply select a palette, edit and preview it on a range of layouts, and export a CSS, SCSS or Tailwind snippet in seconds!",
  "data/ph-top/2021/11/welder-live.json": "Easily create a live stream, Invite guests and stream to multiple platforms at the same time. All in your browser, for free.",
  "data/ph-top/2021/11/pear-3-0.json": "Pear helps makers, indie hackers and marketers grow faster- through a curated directory of email newsletters, podcasts and Patreon accounts which are actively seeking advertising sponsorship.",
  "data/ph-top/2021/11/blend-multilingual-ad-copy.json": "Win over new markets with localized holiday ads. We’re gifting you our top-performing ads translated into the five most common languages so you can reach more people during the busiest time of the year. Convert and keep your audience with localized content.",
  "data/ph-top/2021/11/oneup-2.json": "OneUp is an simple-yet-powerful social media scheduling tool that supports Facebook, Instagram, Twitter, LinkedIn, Pinterest, and Google My Business. ----- OneUp has a Free plan so you can use it with NO credit card required 🤓",
  "data/ph-top/2021/11/tablerone.json": "Tablerone saves tabs and time. Like browser History meets bookmarks except you don’t forget about them. Its superpowers will make you faster, more organised, and focused from day one. Then watch your personal knowledge system grow just by browsing the web.",
  "data/ph-top/2021/11/product-design-guide-for-startups.json": "Meet Product Design Process E-book for early-stage startups, the most comprehensive guide to creating an intuitive design. There is a smooth overview of the double-diamond model, that helps you create intuitive app design and satisfy inner users’ desires",
  "data/ph-top/2021/11/humanvoice-2.json": "HumanVoice is made for content creators who want the absolute best quality when it comes to text to human like speech. We think that your audience will love it. It also features a Safari Extension so you can listen to articles right from your Safari browser.",
  "data/ph-top/2021/11/student-home-by-burb.json": "You’ve designed an incredible learning journey. How will you make sure your students understand their place in it? Burb’s Notion template gives your students a home –– one place where they can see every step on their learning journey and track their progress.",
  "data/ph-top/2021/11/pageblade.json": "PageBlade provides developers with an easy to use Node.js SDK to quickly build websites, pages. From single websites to multi tenant SaaS applications. PageBlade removes the headache of managing hosting infrastructure, leaving you to focus on the code.",
  "data/ph-top/2021/11/devtunes-fm.json": "An online radio for developers with 18 stations for different tastes in music. Includes 10 custom themes, recently played list and other useful features. Simple and efficient, so you can fully focus on your code, while receiving the boost from the music.",
  "data/ph-top/2021/11/clava-2-0.json": "Clava is focused on helping Creators monetize while Live Streaming, when you stream in Clava you make money per minute from each viewer in your Live. When ONE viewer joins your Stream you start earning. Navigate to your profile to view your earnings/cash out.",
  "data/ph-top/2021/11/tidbits.json": "Tidbits surfaces technology news in the form of tweets. Sources include TechCrunch, The Verge, Engadget, The Guardian, Ars Technica, and more. Data is fetched via Twitter API. Tweet selection and ranking is automated.",
  "data/ph-top/2021/11/social-scroll-for-twitter.json": "😒 Tired of scrolling through twitter profiles to find old tweets? 👀 Or are you looking to find someone's first tweet? Well look no further, Social Scroll for Twitter is a smart tool which allows you to look up anyone's old tweets with a couple of clicks!",
  "data/ph-top/2021/11/grist-2.json": "Grist is a relational spreadsheet that takes data management to the next level. Import your data, link records across tables, and arrange your data in your ideal layout. Congrats! Your spreadsheet is now also your custom data application.",
  "data/ph-top/2021/11/fastscripts-3.json": "Quick and streamlined execution of your scripts from a custom menu bar icon, or via keyboard shortcut. FastScripts improves the process of locating and running your scripts in the context of whichever app you're currently working.",
  "data/ph-top/2021/11/my-mind.json": "All your notes, bookmarks, inspiration, articles, and images in one single, private place, enhanced with artificial intelligence. mymind is for busy people. For those who move too fast to be bothered with folders, labels and systems.",
  "data/ph-top/2021/11/videoform.json": "VideoForm helps Sales People To Get More Conversions with Personalized Interactive Videos. Sales Teams can now send personalized video emails to prospects with tools they already use, like Gmail, Hubspot, LinkedIn, Outlook etc using VideoForm.",
  "data/ph-top/2021/11/adcreative-ai.json": "Give your business an unfair advantage with creatives / banners generated by highly trained Artificial Intelligence.",
  "data/ph-top/2021/11/the-chatty-mammoth.json": "The Chatty Mammoth Newsletter helps you fit in more reading: -We find pieces of writing designed to prompt new thoughts, perspectives, and questions -We then summarise each article into <90 words -You sit back and receive daily condensed knowledge, hassle-free",
  "data/ph-top/2021/11/this-week-in-nfts-e5c0a55f-be42-473f-bed9-b5672e04d392.json": "Each week, I spend 50+ hours on NFTs and I share the top news, stories, and discussions in a digestible email newsletter. No shilling, no price discussions...instead, I track the major developments in the space.",
  "data/ph-top/2021/11/bgremover.json": "With BGremover, you can remove background from images online for free. Powered by AI background removal technology and deep learning, it also allows you to add solid color to your image.",
  "data/ph-top/2021/11/birdfy.json": "Recognize 6,000+ bird species and never miss a moment. Save unique behaviors automatically, giving you time to cherish new experiences.",
  "data/ph-top/2021/11/remote-hunt.json": "Remote Hunt lists remote companies with their locations, benefits, tech stack, and more – to help you find your next remote team to join.",
  "data/ph-top/2021/11/papyrus-3.json": "🪶 Papyrus is a new platform for creating blazing-fast, modern blogs and newsletters. Write using markdown, send posts directly to your subscriber's inboxes, and connect Stripe to start charging readers paid subscriptions for access your best posts.",
  "data/ph-top/2021/11/is-your-startup-trapped-in-a-squid-game.json": "The success of Netflix's Squid Game made us question to what extent the Startup world, including its investors and companies, are trapped in one of the 7 Squid Games from the show. Find out for yourself which squid game your company is trapped in.",
  "data/ph-top/2021/11/email-monster.json": "Sign up with your real email and choose a USERNAME. Any email sent to anything (_____@USERNAME.eml.monster) will be forwarded to your real email address. Turn off any alias or sender or both.",
  "data/ph-top/2021/11/namecheap-auctions.json": "Namecheap has made hundreds of thousands of premium domains available to purchase via no reserve auctions. There is a bidding API, as well as the ability to export all the domains at auction and view them alongside detailed metrics about each asset.",
  "data/ph-top/2021/11/toastpunk.json": "Originating from a true life Sunday breakfast story, ToastPunk is a Roblox toast face inspired NFT series of only 1,000 NFTs with a metaverse food storage utility & crypto casino ICO token roadmap.",
  "data/ph-top/2021/11/travel-mapper.json": "Save time planning your next trip with: ➡️ Live Google Map integrated with your Google Sheets ➡️ Track your budget, to-do's, and packing list ➡️ Email your itinerary summary for sharing and access on the go ➡️ Location automated search and plotting",
  "data/ph-top/2021/11/add-to-calendar-button-generator.json": "This open source projects lets everybody create amazing buttons, where users can add events to their calendars. Free to use. For people with basically no coding experience (simple integration), but also advanced developers (npm integration).",
  "data/ph-top/2021/11/pomoplanner.json": "PomoPlanner.app is a pomodoro-based daily planner webapp that allows you to plan and track your main daily tasks, mini-tasks, physical exercise but also to take notes on things you're grateful about, things you've learned and more!",
  "data/ph-top/2021/11/figkit.json": "Figkit is a wireframe library for Figma to communicate and design great user interfaces for desktop and mobile.",
  "data/ph-top/2021/11/imouse.json": "The iPhone is also a computer mouse?! iMouse - Turn your iPhone into a mouse for iPad, Mac, Windows! PS: Just for pranks (mouse doesn't actually work)",
  "data/ph-top/2021/11/qrya.json": "Create your free account, load your product with images prices and catgories, and get a QR code for your costumers to see your products.",
  "data/ph-top/2021/11/presence-9.json": "Can't gather for the holidays but still want to unwrap a gift together? Upload a screenshot or photo of the gift, send the link, then watch the recipient unwrap it in real time!",
  "data/ph-top/2021/11/honest-coffee-guide.json": "Online guide to know your coffee!",
  "data/ph-top/2021/11/knack-6.json": "Knack is an art marketplace creating business-minded artists that sell more art through data-driven recommendations and integrated tools. We help art lovers find a great investment and allow emerging artists to start and grow their creative careers on Knack.",
  "data/ph-top/2021/11/linkwork.json": "Linkwork is a free tool that enables collaborative web browsing by instant sharing of links between users in a \"room\". Using it you can: - Preview others' pages live - Sync a tab to a participant to automatically follow them - Chat on any web page",
  "data/ph-top/2021/11/audiocipher.json": "AudioCipher is a melody generator app for music producers. It's designed to help musicians come up with new ideas. The interface lets you enter words and convert them, as if by magic, into MIDI notes. Drag your musical cryptogram into any DAW.",
  "data/ph-top/2021/11/nft-ninja-2.json": "Identify rarities in NFT collections before they’re officially published, like a ninja in the night. Sign up, search for the collection you want to analyze, and get all the info you need. Then, earn an unlimited income by referring friends!",
  "data/ph-top/2021/11/sizze-figma-plugin.json": "Sizze released a Figma plugin that interactively exports designs from Figma to React Native code. It makes it easy to create mobile apps without any coding.",
  "data/ph-top/2021/11/lili.json": "Lili is a personal health assistant who sits on top of your health data and helps you improve it through advanced data analytics. 🌱 Receive daily tasks based on your patterns, challenge friends, analyze parameters, and stay on top of your health. 🔥",
  "data/ph-top/2021/11/fonoster.json": "A marketplace where local telecom companies can publish numbers, developers can build voice, video, and chat solutions. Or, you can self-host if you want.",
  "data/ph-top/2021/11/hal9.json": "Compose web-ready data transformations, visualizations, and predictions with the ease of drag-and-drop, powerful extensions, and a vibrant community.",
  "data/ph-top/2021/11/lunar-lite.json": "Dim the brightness of monitors, wireless displays, iPad Sidecar and AirPlay displays using simple sliders in your menu bar. Lunar Lite is the lite version of Lunar, an app for controlling every aspect of your external monitors (https://lunar.fyi)",
  "data/ph-top/2021/11/tantify.json": "Tantify is a one of a kind virtual staging platform that helps people create their dream home. All you need to do is upload either empty or furnished room photos and choose style. Our highly experienced stagers will bring your design to life.",
  "data/ph-top/2021/11/delv-ai.json": "Delve into the web, get exactly what's relevant to you. You plug in your field of expertise, the topic you want to research, and the databases you prefer, Delv builds you a graph with all concepts mapped out, each node referring to an article already TLDR'd.",
  "data/ph-top/2021/11/flowframes.json": "Whether you need to build a linktree type of page, an FAQ, an events minisite or a simple form, FlowFrames can help you do so. And you won't have to write a single line of code. Embed them on your website, community app or share them on your social profiles.",
  "data/ph-top/2021/11/project-plan-notion-template.json": "A project plan is essential for successful strategy development. It is a document that helps everybody in the company to understand your vision. This Notion template provides better and transparent communication.",
  "data/ph-top/2021/11/yomi.json": "Improve your game, with the best collection of game tutorials on the web from some of the most popular names in the industry.",
  "data/ph-top/2021/11/mockups-by-glorify.json": "Crafted by expert 3D modelers, Glorify Mockups present ultra-realistic 3D objects and fully customizable pre-made scenes. Get access to full editing options and exclusive libraries of mockup templates. Give your designs a touch of reality.",
  "data/ph-top/2021/11/pulse-by-engagewith.json": "Launched a survey for your internal team - and then crickets? A dozen follow-ups to get responses? 🚫 Out with traditional surveys. With Pulse, get instant feedback from your team right inside Slack & Teams 😇 Bonus: send/receive incognito pulses 😎",
  "data/ph-top/2021/11/winning-the-game-with-ux-design-and-cro.json": "In this book, author and expert Alexander Rådahl draws on years of experience in website development to offer you time-tested methods to optimize your website's UX, improve conversion rates, click-through percentages, and customer engagement metrics.",
  "data/ph-top/2021/11/chatfully.json": "Chatfully is one place for every chat. Centralize communication — from texts to web chat to social media — and share in team inboxes to follow-up in 1/3 the time. Chat with contacts 1-to-1, all together using campaigns, and assign roles to unlimited users.",
  "data/ph-top/2021/11/selectstar.json": "Select Star ( https://selectstar.com) is an automated data discovery platform that analyzes & documents your data. Select Star provides an easy-to-use data portal that everyone can use to find and understand data, saving data analysts hours of time every week.",
  "data/ph-top/2021/11/checkcv.json": "Drop your CV and get your score via AI. A special algorithm will try to identify your skills, education, and work experience. Based on keywords for different jobs, you will get a rating for your CV. More CVs - more accurate the data! The maximum score is 10.",
  "data/ph-top/2021/11/master-ui-design.json": "🚀 Learn interface design faster and become a UI master! Discover practical tips with real examples, understand design, and what skills are essential to grow as a designer.",
  "data/ph-top/2021/11/albato-embedded.json": "Albato Embedded is an easy low-code way to create integrations within your product. And new integrations to not yet connected apps can be built by anyone using the no-code integration builder tool and go live on your product within minutes.",
  "data/ph-top/2021/11/ladder-mobile-app.json": "Ladder, the next-gen professional community platform, is now on iOS and Android! Find your community, share resources, engage in discussions, land your dream job, and form meaningful relationships with peers and mentors, all in the palm of your hands.",
  "data/ph-top/2021/11/nitro-2.json": "Nitro makes product translation easier - and faster - than ever before. >Translate strings into 70 languages at once >Human translations exclusively >60% of translations are ready within hours >Easy integration with API >Perfect for apps, games and websites",
  "data/ph-top/2021/11/eraser-2.json": "Eraser is an all-in-one ideation tool for distributed teams. Eraser allows users to communicate ideas at the speed of thought using a markdown note editor, a lightweight canvas. Use Eraser for brainstorming, diagramming, wireframing, and interviewing!",
  "data/ph-top/2021/11/notion-website-pack.json": "Start from a template and launch your website today. This can be a blog, personal website, landing page, help center and more.",
  "data/ph-top/2021/11/sales-research-in-gcal.json": "Sales superpowers for your Google Calendar. See in-depth sales lead research directly in your calendar. With Intro Sales Research you’ll ask more insightful questions, uncover bigger problems to solve and close more deals.",
  "data/ph-top/2021/11/insanely-useful-websites.json": "Insanely useful websites is a curated database and newsletter featuring useful websites, products and apps that you should know.",
  "data/ph-top/2021/11/composer-4.json": "Composer is an automated trading platform that allows you to build a portfolio of hedge fund-like strategies. Use our no-code visual editor to create your own strategies or “follow” a vetted repository of strategies and put capital to work against them.",
  "data/ph-top/2021/11/typecast-1-0.json": "Typecast is an online AI powered virtual voice actor service that works like a word processor. Type your script then select from over 150+ virtual voice actors to voice your content from anywhere at anytime.",
  "data/ph-top/2021/11/the-creator-economy.json": "The creator economy is booming and it's just the start. This podcast is filled with conversations from CEOs and VCs in the industry who see the future for creators and discuss what that future will look like.",
  "data/ph-top/2021/11/apple-business-essentials.json": "Apple Business Essentials is an all-new service that brings together device management, 24/7 Apple Support, and iCloud storage into flexible subscription plans for small businesses with up to 500 employees.",
  "data/ph-top/2021/11/hollider.json": "Hollider (Hologram + Collider) is a projection display that delivers an affordable holo experience, including holo calls and holo shows.",
  "data/ph-top/2021/11/react-location.json": "Powerful, enterprise-grade routing for React applications with 1st class support for asynchronous route elements and data loaders, Search Param APIs, nested-routing, code-splitting and so much more.",
  "data/ph-top/2021/11/jotform-apps.json": "Create your own mobile app in minutes with Jotform’s drag-and-drop app builder. No coding required! Add forms, links, widgets, and your branding into one fully customized app that can be downloaded onto any smartphone, tablet, or computer.",
  "data/ph-top/2021/11/vajro-3.json": "Vajro helps brands create native iOS and android apps for their Shopify stores without any coding. With simple drag-and-drop, you can create a unique, stunning mobile app that looks and works exactly the way you want. Find it here: apps.shopify.com/vajro",
  "data/ph-top/2021/11/unboxable.json": "A prediction matching platform for Talent & Companies, cutting through the CV culture and bad predictors of success. Create your code-less Job Simulator to accurately predict professional and relational compatibility with data to make smarter decisions.",
  "data/ph-top/2021/11/budibase.json": "Budibase is the low code platform you’ll enjoy using. From creating business apps, forms, internal tools, to automating slack alerts, Budibase is all you need. Best of all, Budibase is open-source, and you can connect to SQL, Rest APIs, or start from scratch.",
  "data/ph-top/2021/11/doge-temple.json": "Talk with other people, play games, enjoy NFT collection, listen to the Doge DJ, discover easter eggs, shoot emojis 🚀💩🔥 with the emoji gun, and celebrate Doge. You can use the Doge Temple to meet friends and colleagues 24/7 for FREE.",
  "data/ph-top/2021/11/andromo.json": "Andromo is a mobile app builder that makes it easy to build apps without coding skills and monetize them.",
  "data/ph-top/2021/11/freshstack-from-freshworks.json": "Freshstack is an affordable & powerful full-stack CRM solution to handle your sales, marketing, & customer support operations. Get started with $3000 credits & gain access to an easy-to-use unified customer tech stack which will help scale your startup faster.",
  "data/ph-top/2021/11/forage-job-simulations.json": "Want to know what it’s like to work at a top company? Join our free platform for career discovery, up-skilling, and recruitment–straight from employers. Our job simulations help you build your skills and resume for industries like tech, law, finance and more!",
  "data/ph-top/2021/11/glide-pages.json": "Glide Pages is https://www.glideapps.com for the web – it's a no-code web app & website builder, powered by data in your Google Sheets. It beautifully presents your data with responsive layouts, web navigation, data-driven components, and powerful actions that add & update data.",
  "data/ph-top/2021/11/racket-2.json": "Racket is the easiest way to tell audio stories and connect with people who want to hear them. ⠀ In 99 seconds or less, you can record your thoughts in the studio and share them with the world.",
  "data/ph-top/2021/11/inspectcontent.json": "Specify a page URL, get words and letters count, find keywords and keyword count. See the average reading time of the page text.",
  "data/ph-top/2021/11/free-email-signature-template-generator.json": "Create a professional, customized email signature in less than two minutes with Mention’s free tool. Choose from 6 different layouts, pick a color scheme that matches your brand, and add custom links to your social media.",
  "data/ph-top/2021/11/betterviewer.json": "BetterViewer was designed as a replacement for the image viewing mode built into Chrome-based web browsers. With BetterViewer you can use various keyboard shortcuts to quickly pan, zoom images, edit and a lot more!",
  "data/ph-top/2021/11/get-wall-of-love.json": "A simple web application that creates \"Love Of Wall\" for ProductHunt applications.",
  "data/ph-top/2021/11/simpleperks.json": "A simple way to give perks to your remote team: 💳 Everyone on the team gets a SimplePerks card. 📲 Mobile app for everyone to see their perks. 🎁 Create one-time or recurring perks for your team. 💸 Your team gets notified when they get new perks.",
  "data/ph-top/2021/11/planetscale-2-0.json": "PlanetScale’s serverless database platform is now GA. Now you can integrate your database management into your normal deploy workflow. Cut a branch, make schema changes, and merge it back into the main database seamlessly.",
  "data/ph-top/2021/11/contra-x-tiktok-jump.json": "Contra and TikTok partnered to release TikTok Jump — a fast & easy way to link your Contra profile to your TikTok videos! It’s never been easier to share your professional work and get new clients 🚀",
  "data/ph-top/2021/11/rarible-for-ios.json": "Browse any NFTs available on blockchain. - view any NFTs: description, history, details & more - view the list of hot & trending collections - view featured items - find new items via app feed and search - like and share items",
  "data/ph-top/2021/11/mantiq.json": "Mantiq is a workflow automation tool ✨ It allows you to build the logic you need in your WordPress website with visualized LEGO-like building blocks instead of writing code. 💡 Think of Zapier or IFTTT with way more capabilities inside your WordPress.",
  "data/ph-top/2021/11/wander-c84dfefb-0ac4-4ec7-a850-741d74e15bdd.json": "Wander is a social media platform that makes it easy to recommend and discuss intellectual content. Manage your content pipeline, meet interesting curators, and find and share interesting articles, blog posts, newsletters, videos, and podcasts.",
  "data/ph-top/2021/11/glitch-in-bio.json": "With Glitch, you can have a link page for your bio that can do anything the web can do. Your own domain. Embedded audio, video and more. No limits on links. And real customization, backed by a community making new themes & features every day.",
  "data/ph-top/2021/11/uihut-2-0.json": "Download thousands of free & premium web design, illustration, bootstrap template, flutter app, icon, 3d illustration, and graphic assets for your UI, UX design project",
  "data/ph-top/2021/11/mediaopoly.json": "Who owns your mind media ? Our new Twitter tool, https://ground.news/mediaopoly, will let you know will let you know who owns the news people interact with. Enter the handle of any public Twitter user to see who owns the news outlets they interact with on the platform.",
  "data/ph-top/2021/11/markup-extension-by-kdan-mobile.json": "Markup is a productivity tool for reading and annotating web content for personal knowledge growth. From highlighting and auto-summarizing key messages to synchronizing across your devices, Markup streamlines your reading habits.",
  "data/ph-top/2021/11/waldo-photos.json": "Are you ready to #deletefacebook but wonder where and how you’ll share photos with your family, friends, and colleagues? If so, Waldo is your answer! Meet the alternative photo-sharing platform that cares about your mental health AND your privacy.",
  "data/ph-top/2021/11/paper-website.json": "Paper Website lets you start a website from a paper notebook. It's the easiest no-tech way to start a website. 📖 Start a tiny website from your notebook ✍️ Write your website/blog using pen & paper 🤳 Take a photo of your page to turn it into a live website",
  "data/ph-top/2021/11/coefficient-for-google-sheets.json": "Coefficient is the data connector for Google Sheets 🐝 Connect & sync from systems like Salesforce, MySQL and more in 2 clicks 🚀 Automate sheets with always-live data. Goodbye copy-paste 💡 Monitor cells and Trigger Slack/Email alerts on custom criteria",
  "data/ph-top/2021/11/animockup-2-0.json": "Animockup is a web-based tool that helps you create animated mockups for your product teasers. Add gradient backgrounds, browse through 20+ mockups, customize the export settings, and much more.",
  "data/ph-top/2021/11/socialbook-cartoonizer.json": "Want a fun profile picture? Spice up your selfies now!",
  "data/ph-top/2021/11/formaloo-2-0-for-mobile.json": "Collect, organize & understand your data. Free & unlimited!. Formaloo is a powerful no-code collaboration platform that enables you to build databases, forms & even custom business applications fast & code-free!",
  "data/ph-top/2021/11/product-wednesday.json": "Every Wednesday, receive a handpicked selection of tools made for Product Managers, Product Designers, UX Researchers and every member of the Product team.",
  "data/ph-top/2021/11/centered-2.json": "Centered helps you get into a Flow State faster and stay there longer so you can do your best work. Centered offers Flow Music, Productivity Coaching, Mono-Tasking, Do-Not-Disturb on Mac, Distraction Nudges, and a simple way to see all your Tasks.",
  "data/ph-top/2021/11/gleap.json": "Gleap is the visual customer communication and triage platform for web and mobile apps. Gather feedback with video action replays, screenshot bug reports, and in-app feature requests, ratings, and surveys. Review, prioritize, and respond in one gleeful place!",
  "data/ph-top/2021/11/regexlearn.json": "RegexLearn makes it simple to learn, practice, test, and share RegEx.",
  "data/ph-top/2021/11/checkmate-2.json": "Checkmate is the ultimate savings extension. The first to automatically apply those coupons living in your email inbox as well as public coupons when you checkout, to save you more than any other extension. Checkmate is Honey on steroids (& far less annoying)",
  "data/ph-top/2021/11/universal-charger.json": "Introducing Mieum’s first product - universal charger (UC01) The UC01 replaces the bulkiness of traditional travel adapters with a light, stylish and robust unit. Stylish, simple to use and sustainable - 3 elements that run through all our products.⠀",
  "data/ph-top/2021/11/runway-9.json": "Runway coordinates and automates your app releases, connecting with your existing tools to create a single source of truth and surface status and blockers to your team. No more massive spreadsheets, herding cats on Slack, or bouncing between 20 browser tabs!",
  "data/ph-top/2021/11/mindmeister-2-0-1.json": "MindMeister is an intuitive mind mapping solution that provides an infinite canvas for collaboration and project planning. Whether used alone or with your team, it's user-friendly, beautifully designed, and perfect for enhancing creativity and productivity.",
  "data/ph-top/2021/11/brave-wallet.json": "Brave Wallet is the first secure crypto wallet built directly into the browser. No extensions, no extra steps. That means less vulnerability to faked versions of an app, phishing, and theft.",
  "data/ph-top/2021/11/flowio.json": "Unlock your marketing power by displaying Pop-ups at key moments to collect subscribers and sending automated Emails & SMS accordingly. Leverage your way of supporting customers with Live Chat to provide them instant help and be engaged at every touchpoint.",
  "data/ph-top/2021/11/text-volume.json": "How much text is too much? The Text Volume plugin in Figma instantly shows you how much space your text is using in your app. You'll also get research-based insights about how much you *should* use.",
  "data/ph-top/2021/11/become-self-serve-by-userguiding.json": "In this free 5 step guide, you’ll learn: ✅ why every software business needs to go self-serve, ✅ how to turn all of the user journey into self-serve, ✅ and the exact tools and processes you'll need for the transition.",
  "data/ph-top/2021/11/beehiiv.json": "beehiiv empowers people to create, monetize, and grow by providing the most powerful and robust newsletter platform, holistically under one roof. We'll provide best-in-class tools to help you succeed, and you get to keep all of the revenue for yourself.",
  "data/ph-top/2021/11/upland-me.json": "Upland is the earth’s metaverse mapped to the real world, accessible via web, iOS & Android. Moreover, there’s a “real economy” sustained by players via the market forces of supply & demand. Upland is built on the basis of 3 key pillars: Play, Earn, & Connect.",
  "data/ph-top/2021/11/night-eye-1.json": "Night Eye enables dark mode on Safari iOS 15 for any website while browsing the internet, just like you do on your desktop. No more hassles and workarounds. Simply install Night Eye from the App Store and enable it in Safari's options. Go easy on your eyes!",
  "data/ph-top/2021/11/offie.json": "Offie is a free Chrome extension that lets you find Airbnbs with fast Wifi and comfortable workspaces. No more wasting time looking through listing photos and getting excited, only to realize the Wifi is slow!",
  "data/ph-top/2021/11/founder-resources.json": "FounderResources.io is a curated list of 500+ resources, templates & tools that help you on your journey to build a successful business. You can easily filter all resources by category and type to quickly find the thing you are looking for.",
  "data/ph-top/2021/11/toucan-2-0-2.json": "Toucan 2.0 is built to fight Data Friction. Eliminate data complexity, need for add-ons, and reliance on experts. Leverage an easy-to-use, no-code framework with universal device deployment and cloud-native infrastructure made for non-technical business users.",
  "data/ph-top/2021/11/customfit-ai.json": "Showcase the best pitch for each visitor without code changes. Increase conversions on your website with personalized, goal-oriented, and dynamic messages.",
  "data/ph-top/2021/11/dynapictures.json": "Auto-generate hundreds of personalized images in minutes for social media, e-commerce and emails. Connect preferred data source like Google Sheets or via No-Code to generate images and display your client names, products, coupons, or virtually anything else.",
  "data/ph-top/2021/11/free-pr-database-of-4k-journalists.json": "By downloading this list you’ll find everything needed to announce updates about your company. Raised a round? Launched a new product? Something cool happened? Looking for Journalists to announce it? Get access to 4k journalists within just a few clicks",
  "data/ph-top/2021/11/constitutiondao.json": "DAO's have potential but must conform to the law. ConstitutionDAO is an idea and a philosophy, and it is also a framework for DAO's to acquire real world assets. We've built a replicable playbook to marry the legal, financial, and infrastructure needs to bid.",
  "data/ph-top/2021/11/posthog-3.json": "PostHog is a product analytics platform for teams that want to keep their data private. 👨‍💻 Host in the cloud or your own infrastructure 🛠️ Analyze funnels, paths, trends 🧪 Run A/B tests and correlation analysis 🎥 Record user sessions 🗄️ Sync with BigQuery,S3",
  "data/ph-top/2021/11/saas-black-friday.json": "Black Friday is the only massive deal season of year for SaaS. Here is a curated list of Top SaaS deals that you don't want to miss it! This means you https://document360.com/blog/black-friday-saas-deals/that will boost your business performance.",
  "data/ph-top/2021/11/vanga.json": "Vanga is your virtual upsell assistant for Shopify. She works on autopilot by studying your orders and optimizes her upsells with each shopper interaction. When a customer makes an order, Vanga shows them post-purchase upsells and makes you 💰💰💰",
  "data/ph-top/2021/11/air-3-0-2.json": "Air automates how you organize, find, track, and collaborate on images & videos. You deserve better than cloud storage—reclaim hours wasted in Dropbox, Box & Drive.Air 3.0 includes Canva & Adobe integrations, kanban, and much more. Get started for free.",
  "data/ph-top/2021/11/bymeta.json": "ByMeta lets you see everything made by Meta, and be the judge: Has Meta been good or bad for the world? It’s a twist on Facemash—the \"hot or not\" website Zuckerberg created in 2003 to rank female Harvard students—but this time, you’ll be ranking Meta's deeds",
  "data/ph-top/2021/11/7taps-omg-edition.json": "7taps is a dead simple tool to create mobile-first decks, micro-courses, and bite-sized landing pages. 👉 Check this https://app.7taps.com/Mv0wio6rSD6.",
  "data/ph-top/2021/11/epsagon-2-0.json": "Search and troubleshoot events across your microservices. Monitor and analyze microservices performance bottlenecks.",
  "data/ph-top/2021/11/micromrr-by-microacquire.json": "Connect Stripe for a free valuation, and then delve deeper into performance with visual analytics and insights.",
  "data/ph-top/2021/11/sticky-studio.json": "Sticky Studio is a collaborative whiteboard that helps people make sense of messy topics together. See the big picture by emphasizing how stickies are connected and go deeper with discussion threads on each sticky.",
  "data/ph-top/2021/11/this-week-in-metaverse.json": "This Week In Metaverse is a weekly newsletter delivering latest news from Metaverse world. We scan through important Metaverse developments and add all to a simple and fun to read 5mins email.",
  "data/ph-top/2021/11/gravity-the-studio.json": "We create fashion that only exists digitally. The customer can upload a photo of themselves on our platform. We tailor the item to fit their pose so that it really appears they're wearing it in the photo. Or we could wear your avatar in game or metaverse.",
  "data/ph-top/2021/11/skittish.json": "This is no webinar. Host conferences, festivals, meetups, parties, workshops, and more in a colorful game-like 3D world. Camera shy? No problem. Use your mic to talk to others near you with our best-of-class 3D spatial audio. Done chatting? Just walk away.",
  "data/ph-top/2021/11/subspace-network-as-a-service.json": "Accelerate your real-time applications on Subspace’s Network-as-a-Service. Get enterprise-level connectivity anywhere in minutes.",
  "data/ph-top/2021/11/dabble-3.json": "Dabble is an A.I.-assisted creative tool for interior design. Clip products from anywhere (online or offline), visualize them together and track your budget in one place. Dabble helps you organize your furniture shopping and design your home like a pro.",
  "data/ph-top/2021/11/email-reports-by-explo.json": "Explo is the quickest way to create and automate email reports for your users. Customize the look and feel of your emails, create reports, automate sending, and manage email lists.",
  "data/ph-top/2021/11/bestwatch.json": "Don’t know what to watch on Netflix? I created a website that sorts all the Netflix catalog by IMDb rating and lets you filter by year, genre, movie type, number of votes, and you can even save your wishlists!",
  "data/ph-top/2021/11/variables-in-ditto.json": "Variables in Ditto take care of interpolating dynamic values in product text. 🎨 With Variables, you can indicate where dynamic strings, numbers, and links live in your designs. 🤖 Variables get automatically formatted for developers.",
  "data/ph-top/2021/11/square-photo-studio-app.json": "Just snap, style, and sell. That’s how remarkably easy the Square Photo Studio app is. Snap an ecommerce photo. Style your photo and remove the background. Sell your items instantly with Square. Plus, it’s free.",
  "data/ph-top/2021/11/user-onboarding-checklists-by-lou.json": "User onboarding checklists help users adopt your product faster by giving them a clear set of tasks to complete. https://www.louassist.com are fully customizable, can be built in just minutes with no code, & automatically cross off as a user completes the tasks.",
  "data/ph-top/2021/11/plusbase.json": "At PlusBase, we believe it’s time to make dropshipping easier & more sustainable. It means no more selling bad-quality products, payment limits & high chargeback/dispute rates.",
  "data/ph-top/2021/11/google-sheet-to-json.json": "You would like to use a Google sheet like a REST API without having to set up complex stuff? Or just convert it to a JSON ? Google sheet to JSON is the tool you need !",
  "data/ph-top/2021/11/cron.json": "Cron Calendar. Schedule meetings and control your time like never before. Time zone conversions. Multiple accounts. A cleaner, faster interface, and — did we mention it comes with dark mode? Get early access at cron.com",
  "data/ph-top/2021/11/crewscale.json": "Crewscale is a network of top 1% remote talent connecting high-growth companies with pre-vetted tech talent. We are here to assist you in overcoming the needless lengthy recruiting procedure in a more cost-effective manner.",
  "data/ph-top/2021/11/webask.json": "Learn to read the minds of your customers, co-workers and followers with this fully-customizable and light-weight toolkit for collecting and processing user feedback. For free.",
  "data/ph-top/2021/11/stepsize.json": "Stepsize is an editor-first issue tracker for a healthier codebase. Create, prioritise, and fix code issues directly from your editor — perfect for tech debt and refactoring. Integrates with Jira, GitHub, Slack, etc. so you don’t need to change your workflow.",
  "data/ph-top/2021/11/halalin.json": "Halalin was made to help Muslims who travel the world to find Halal food, restaurant, and prayer room around them. You can easily find the right food and place for you to meet your needs in worship insyaallah.",
  "data/ph-top/2021/11/requstory.json": "Requstory helps you write your user story quickly. It has built-in features to help you easily draft and describe features of your project/product.",
  "data/ph-top/2021/11/justcall-iq-for-sales.json": "JustCall IQ is a conversational intelligence that comes built-in with the JustCall cloud phone system for sales teams. You can transcribe your sales calls in real time, generate action items, automatically score phone calls and much more.",
  "data/ph-top/2021/11/giftpicker-by-presently.json": "Buzzfeed quiz meets holiday shopping! Introducing GiftPicker 🎁, the easiest way to find the perfect gift. GiftPicker uses a personalized quiz and our epic gift database to find *actually* good gifts for friends & fam. You’ll never have to pick a gift again.",
  "data/ph-top/2021/11/windster.json": "Get started with a free and open-source dashboard interface built with Tailwind CSS and Flowbite.",
  "data/ph-top/2021/11/tuned-2.json": "Tuned is where crypto trading bots are born. Discover high-performing strategy creators, select a hedge fund-like syndication that matches your risk and growth goals- then sit back and watch signals come in!",
  "data/ph-top/2021/11/grammarly-for-desktop.json": "Introducing Grammarly for Windows and Mac, our new desktop application that works where you write! Get instant suggestions across all of your favorite apps and sites for one seamless writing experience. Install today: https://gram.ly/DesktopApp",
  "data/ph-top/2021/11/waldo-v2.json": "Waldo is a testing solution that takes away one challenge from the equation: automation. Once setup Waldo, anyone on your team can create tests in minutes so teams can spend less time automating tests, and ship cool bug-free updates, faster",
  "data/ph-top/2021/11/air-native-by-zeroqode.json": "Air Native solution from Zeroqode allows wrapping web apps built with bubble.io into native apps for Apple App Store and Google Play. Supports native push notifications, In-app purchases, Touch ID, GPS and many more.",
  "data/ph-top/2021/11/mighty-networks-2-0.json": "Create a community, livestream, build online courses, run events, and charge for access all in your very own Mighty Network.",
  "data/ph-top/2021/11/shortwave-snail-mail.json": "The world is going too fast, and not everything should be an email Why not take the time and write a postcard, like in the old days but using modern tech? Shortwave Snail Mail sends a stylish postcard via regular mail for you.",
  "data/ph-top/2021/11/i-give-cool-gifts-2.json": "I Give Cool Gifts it the premiere destination for gift giving inspiration. We take the hassle out of finding cool gifts for the cool people in your life. Search by interest, lifestyle, occasion and more to find the right present.",
  "data/ph-top/2021/11/upstream-collectives.json": "An Upstream Collective is a virtual community with a shared wallet. Members contribute money to the Collective & vote on how to use the funds. We took all the features needed to run a DAO & brought it into one place. An Upstream Collective is a DAO, evolved.",
  "data/ph-top/2021/11/linksbook-2-0.json": "Save time and clicks by powering your workflow with linksbook. A clean and feature full app to give you the best bookmarking experience.",
  "data/ph-top/2021/11/patchwork-2.json": "Patchwork is the fastest way to share what you're reading online. Highlight text, click on Patchwork, and share without leaving the page.",
  "data/ph-top/2021/11/e-sports-stats.json": "Web app where you can check deep post-match statistics, compare teams pre-match stats and form. Full team stats across tournaments. Teams and players ranking.",
  "data/ph-top/2021/11/ai-article-writer-2-0.json": "Write full-length high-quality blog posts and other long-form content within seconds using GPT-3. Also, introducing our new long-form writing assistant that's like having a personal copywriter by your side, ready to help with any kind of content you need.",
  "data/ph-top/2021/11/kenobi.json": "Kenobi is A watchOS app which elevates your macOS experience. Whether you want to use it as a presentation remote to change slides, or quickly pause a movie you're watching without getting up from your bed. And there are tons of more features.",
  "data/ph-top/2021/11/spectrum-figma-plugin-web-app.json": "With Spectrum, working with colors has never been this easy. Break out of the trial-error loop & instantly see how color palettes come alive on your design. Supercharge your workflow from hours to seconds!",
  "data/ph-top/2021/11/bbburst.json": "A simple SVG generator for colorful explosions of shapes. Use it to create confetti-like graphics to make your web designs more fun.",
  "data/ph-top/2021/11/shufflepop.json": "Designing/building a product? Researching how the top teams do it is a surefire way to make sure your work is world-class. Problem is, that can take a lot of time/money! We're building a library of product walkthroughs that anyone can use for fast research.",
  "data/ph-top/2021/11/tabius.json": "Tabius is an easy to use Tab Grouping assistant for Chrome. If you use tab grouping or couldn't use it due to lack of options, Tabius is a must have for you. It lets you customize Chrome's Tab Grouping feature by creating custom rules, blocklist and many more!",
  "data/ph-top/2021/11/designstripe.json": "🎨 A constantly growing library of customizable illustrations 💻 Beautifully simple online editor 🧠 Intelligent variations for every object ✏️ Smart sliders to adjust visuals and style ✨ New hand-created illustrations every day",
  "data/ph-top/2021/11/notion-pro-clipper.json": "With this free extension, you can 1. Add a webpage to your Notion page💻 2. Save webpage URLs, entire webpages, or a section of a webpage ✅ 3. Save specific part of the screen 🧾 4. Save Images to notion 📷 Download it now🔥",
  "data/ph-top/2021/11/uuki.json": "UUKI is a white labelled creator community platform that brings together discussions, memberships, and content. Alternative to Tribe, Circle.so and Mighty Network",
  "data/ph-top/2021/11/girisimci-kafasi-podcast.json": "Everyone has an entrepreneurial mind, and on this channel, we talk about what everyone can do to reveal their talents and turn it into an individual and then social benefit.",
  "data/ph-top/2021/11/runno.json": "Runno helps you make embeddable code snippets that run in the browser with WASM. It supports snippets in Python, JS, C/C++ and more. Plus with the Runno NPM package you can run and test arbitrary code in your blog, tutorials or resources.",
  "data/ph-top/2021/11/graficto.json": "Graficto is an easy to use infographic and smart visuals maker that allows you to create visuals without any design skills. Your visuals dynamically change as you edit items or change text and icons. Just focus on the content, Graficto will do the design.",
  "data/ph-top/2021/11/write-invisible.json": "Write Invisible helps writers be in the zone and get into a flow state. You write but cannot see what you are writing. That is the quickest way to first drafts.",
  "data/ph-top/2021/11/launch-list.json": "Launch List is a curated list with the best and free places to promote your startup. You can quickly filter all websites by difficulty to post, domain authority, and category.",
  "data/ph-top/2021/11/coinchange-io.json": "Earn yield and trade cryptocurrencies. Deposit your USD or crypto to earn compounding returns. Earn rewards in USDT, USDC, BTC and more. Withdraw any time directly to USD. No deposit, withdrawal, spread or transfer fees. $40 USDC earning bonus for new users.",
  "data/ph-top/2021/11/dev-lake.json": "Dev Lake is a free & open source product analyzing & visualizing the data inside your dev tools, bringing the information you care about to one personalized & practical dashboard. More Dev. Less Ops. Get it on GitHub >> https://github.com/merico-dev/lake",
  "data/ph-top/2021/11/labelf-ai.json": "The Labelf AI Platform aims to let anyone, no matter previous knowledge, create and use AI text classification models. We use an advanced approach to active learning to accelerate training on both labeled and unlabeled data. Can also be used for analysis.",
  "data/ph-top/2021/11/frontend-store.json": "The Frontend Store is where you buy and sell UI element codes. We help to make the interfaces of other sites better.",
  "data/ph-top/2021/11/paperknife.json": "Paperknife provides a no-code tool for everyone to set up an NFT gate at ease. People who own certain NFT collections can get privileged content behind the gate, including exclusive content, private community, offline event pass, etc.",
  "data/ph-top/2021/11/altamira.json": "Altamira is a communal marketplace for art, artists, and their fans... Product Hunt for Art.",
  "data/ph-top/2021/11/minimal-2.json": "Minimal is a full-feature writing + notes app for iOS and Mac. Its distraction-free design enhances focus and open-mindedness. Features include the Note Lifetime, Publish as Website, collaboration, markdown formatting, and more.",
  "data/ph-top/2021/11/wing-social-media.json": "Leverage dedicated virtual assistants with Wing Social and build your brand without spending hours on social platforms 😻 Let your VA boost your presence using our all-in-one space integrating content planning and creation, a media library, and chat features.",
  "data/ph-top/2021/11/graphql-editor-5-0.json": "What is better than a plain old API? An interactive, visual one, that you can work on easily from your browser. With the new GraphQL Editor, this is now possible for every developer!",
  "data/ph-top/2021/11/diffuse-cookie-notice.json": "An easy-to-implement and fully customizable cookie notice for your website. Make your website GDPR-compliant and fine-proof, no coding required!",
  "data/ph-top/2021/11/the-nft-bay.json": "Did you know that an NFT is just a hyperlink to an image that is usually hosted on GoogleDrive or another Web2.0 hosting service? 👀",
  "data/ph-top/2021/11/iphone-13-mockup-pack.json": "The goal of this pack is to provide you with all the iPhone 13 resources you might need for showcasing your design and impressing your clients without wasting your precious time. – 120+ Device mockups (4k) – 5 Scenes (8k) – 260 Components – Smart Filters",
  "data/ph-top/2021/11/roadgoat.json": "🏘 Find the perfect cities and towns for your next trip. Our vibrant community ranks destinations and organizes them by interest (such as LGBT-friendly). 🗺 Map your travel history and sync travels from social media, wearables, Google Maps, and more.",
  "data/ph-top/2021/11/amplifier.json": "A virtual event platform designed for 1:1 speed networking. Attendees can upvote their preferred lineups, filter lineup by #hashtag and by mutual LinkedIn connections. Built by community builders for community builders.",
  "data/ph-top/2021/11/casaos.json": "CasaOS is an open-source home server system based on the Docker ecosystem and designed for home scenarios. It is committed to building the world's most simple, easy-to-use, and elegant home server system. CasaOS is compatible with Raspberry Pi and x86 devices.",
  "data/ph-top/2021/11/planarty-2.json": "PlanArty is a time management solution developed for Freelancers and small business owners. Its features include google calendar-like time blocking, time tracking, offer/quotation, project break-down, invoicing, and a streamlined workflow.",
  "data/ph-top/2021/11/prodigee.json": "Prodigee is a talent referral marketplace with the goal of democratizing recruitment. Companies post jobs on the platform for free and set a referral bonus amount which is only paid on successful hire of a candidate.",
  "data/ph-top/2021/11/relai-2-0.json": "Relai is an Android and iOS Bitcoin-only investment app. You can buy Bitcoin in one minute, or set up a monthly or weekly savings plan to accumulate Bitcoin over time at regular intervals. No deposit, account registration, or KYC verification is required.",
  "data/ph-top/2021/11/100k-open-source-icons-by-iconshock.json": "This tool which compiles absolutely every open source icons pack out there and puts them in one place. It has a built-in search function, properly tagged & SVG optimized icons, and you can recolor before downloading. Every icon for personal & commercial use!",
  "data/ph-top/2021/11/community-os.json": "Building a community is hard. We believe community managers need more unfair advantages. Tools to become a super community manager. We have created a FREE Notion modular dashboard system to help you start, curate, and scale your community.",
  "data/ph-top/2021/11/zoho-cliq-3-0.json": "Zoho Cliq is now hybrid-work friendly. With our latest release, our tools are more focused on catering to the needs of a hybrid office, making communication and collaboration seamless.",
  "data/ph-top/2021/11/marketing-x-ai.json": "Growth hacking, content marketing, SEO, social media presence and more. Noecho is ready to help you. Currently at the testing phase. Open to newcomers for a very small window of time.",
  "data/ph-top/2021/11/ltx-bio.json": "Own your personal brand with LTX.bio, your free Link in Bio page. Tailor your page to match your personal style with custom themes, colors, photos, and layouts. Lead audiences from every platform to one place, and monetize your content TODAY!",
  "data/ph-top/2021/11/jovo-v4.json": "Build voice and chat experiences for Alexa, Google Assistant, Facebook Messenger, Instagram, the Web, and more. Open source: https://github.com/jovotech/jovo-framework",
  "data/ph-top/2021/11/startup-pitch-deck-templates.json": "60 easy-to-edit Figma pitch deck slides. Created based on the real experience of raising $1M and getting accepted to Techstars London Accelerator. Get your free pitch deck templates 💛",
  "data/ph-top/2021/11/admin-panel-ui-kit.json": "A tool that helps to create your own admin dashboard dedicated to application development. The design team Swiftle.io has prepared the best UI KIT product for you.",
  "data/ph-top/2021/11/strike-market.json": "Strike.market is a stock research website full of next-level stock analysis with fundamental & alternative data. We monitor data like website traffic, patents, Google Trends, Share of Search, mobile apps ranking, and much more.",
  "data/ph-top/2021/11/dailyx.json": "Dailyx allows you to convert your photos into life-capturing movies. Share results to Instagram, Facebook, TikTok. With a range of additional camera features, you can take consistent and perfectly aligned photos to generate perfect timelapse for your own story",
  "data/ph-top/2021/11/supa-2-0.json": "SUPA is a professional video maker for social media and ad platforms",
  "data/ph-top/2021/11/few-1.json": "Few is a curation of essential products, handpicked for their exceptional performance and design.",
  "data/ph-top/2021/11/smappy-2.json": "Gifts? No problem. Experience new approach with Smappy - complete solution for gift-giving. Order universal gift sets delivered in 1 hour (with NFT token), get instant AI gift recommendations, and buy cool digital gifts. Launch is very soon☺️",
  "data/ph-top/2021/11/momint-2.json": "Momint allows artists to post their work as NFTs, sell them, and receive tips. This enables smaller artists to break into the NFT space, experiment with blockchain technology for the first time and build a following.",
  "data/ph-top/2021/11/the-ultimate-okr-starter-guide.json": "Meet The Ultimate OKR Starter Guide adapted for early-stage startups. This is the most comprehensive OKRs guide with examples of objectives by departments, common mistakes, scores benchmarks, and advice from 3000+ teams that succeed with OKRs.",
  "data/ph-top/2021/11/ziplyne.json": "Ziplyne is a Digital Adoption Platform to create in-app guidance & product onboarding for your Customers. Early stage companies and large enterprises are selecting Ziplyne as their DAP to get the most out of their existing SaaS enterprise software.",
  "data/ph-top/2021/11/soft-ui-dashboard-builder.json": "Soft UI Dashboard Builder - Create dashboard pages for your Startup or Business in minutes using our Simple Low Code Dashboard Builder based on Bootstrap 🎉 ⓵ Choose blocks ⓶ Edit code and texts ⓷ Download Source Code Perfect for coders and nocoders!",
  "data/ph-top/2021/11/shortery.json": "Shortery adds the missing automation tools to macOS Monterey. With Shortery you can run Shortcuts automatically, that you've created in the Shortcuts app using different triggers: App Launch / Quit, Time, Wake Up & Sleep, Login, Keyboard, Appearance, Power",
  "data/ph-top/2021/11/aphrodite-sex-tracker.json": "Hi guys! I have made a tool to track your sex life:Aphrodite！Now you can get it for free in the AppStore~ You can record your sex life in detail, Aphrodite can also be used to record masturbation for those who do not have a sexual partner.",
  "data/ph-top/2021/11/paul-graham-101.json": "I read every essay Paul Graham has published. Here's a free 49-page summary.",
  "data/ph-top/2021/11/merry-christmas-design-assets.json": "Over 40,000 high-quality Christmas assets from Iconscout to bring the spirit of Christmas to your designs. We've curated Christmas-themed icons, illustrations, 3Ds, and Lotties for you to add to your products, communications, and all things design.",
  "data/ph-top/2021/11/quickcard.json": "Quickcard is a sales platform for producing tailored, interactive content to streamline the internal buy-in. Personalize copy and add logos to build the perfect personalized presentation. Embed sandbox demos, calendar widgets, tooltips, and videos too!",
  "data/ph-top/2021/11/apple-search-ads-performance-grader.json": "Get a comprehensive analysis of your Apple Search Ads campaigns, find out bottlenecks & irregularities preventing your campaigns from reaching their true potential.",
  "data/ph-top/2021/11/angle-audio-for-business.json": "Increase user engagement through online live conversations 👉 The Angle SDK enables you to embed customized audio rooms into your app or website superfast ⚡️ Manage upcoming rooms and features, and gain insights from your audio rooms in a planning dashboard.",
  "data/ph-top/2021/11/tickkl.json": "Tickkl is a time tracking software that focuses on automation, forecasts, powerful reports and extreme simplicity of the user interface. It also plants trees on behalf of you or your organisation if the GREEN plan is active 🌱.",
  "data/ph-top/2021/11/plutoview-api.json": "Plutoview API brings collaborative environments, like sharable search engines, to remote workspaces at scale. Host hundreds and thousands of virtual applications such as virtual Firefox at the same time.",
  "data/ph-top/2021/11/global-predictions-portal.json": "Global Predictions lets you monitor all your investments, across multiple accounts, and get automated recommendations & run simulations for better risk management and returns via the world’s largest macroeconomic models.",
  "data/ph-top/2021/11/perdoo-growth-board.json": "Don't miss another growth goal. The Growth Board is a cross-functional view of the KPIs that make up your organization's funnel and contribute to revenue growth. Track targets vs actuals for these KPIs over time, and understand what's planned to achieve them.",
  "data/ph-top/2021/11/askjarvis-io.json": "AskJarvis is an AI code assistant developed by Assistiv.ai that facilitates you to stay in your editor, code faster, and spend more time building while staying in the \"zone.\" In the process, you'll unlock your potential to write code with more confidence.",
  "data/ph-top/2021/11/pancea.json": "Pancea makes chronic pain relief easily accessible and affordable. The app develops customized exercise and stress management routines. User's experienced a 80% reduction of pain levels by 12 weeks without booking 1 appointment. FREE registration code:easepain",
  "data/ph-top/2021/11/pagecloud-start.json": "Create a free landing page, online portfolio, link page, and more with Pagecloud Start! Capture leads with custom forms, display your images in a gallery, and design your page to showcase your brand!",
  "data/ph-top/2021/11/multiple-calendars-selector-for-google.json": "With this Google Calendar extension for Chrome, you'll define presets of multiple calendars that can be displayed or hidden with one click. You will be able to switch between them easily. Useful for viewing a team's or several conference rooms' availability.",
  "data/ph-top/2021/11/pixel-bazaar.json": "Reviving an old brand. Pixel Bazaar is back.",
  "data/ph-top/2021/11/equinox-2.json": "Equinox is an app for creating macOS dynamic wallpapers. Starting macOS Mojave we have such cool things as «Dynamic Desktop», «Light and Dark Desktop» types of wallpapers. With the help of the Equinox app, you can easily create those with a few clicks.",
  "data/ph-top/2021/11/pexel.json": "Pexel: Social Media Kit is a simple drag-and-drop Canva style Kit for creating quick social media creatives",
  "data/ph-top/2021/11/gamified-pop-ups-by-poptin.json": "Poptin is a conversion rate optimization that helps website and online store owners to convert more visitors into leads, subscribers, and sales. Poptin's new features, Teasers and Gamified pop ups, will help you engage & convert more visitors in a fun way :)",
  "data/ph-top/2021/11/copymonkey.json": "CopyMonkey is the e-commerce AI copy generator compatible with any e-com platform. It writes massive amounts of unique product descriptions at once with a file uploader. Generate in bulk and easily edit the result in a user-friendly interface.",
  "data/ph-top/2021/11/the-2022-design-inspiration-handbook.json": "The 2022 Holidays & Beyond Design Inspiration Handbook by ModeMagic is chock full of&nbsp;100+ design inspirations&nbsp;to help you give your store the Holiday look it deserves.",
  "data/ph-top/2021/11/vitt.json": "Vitt offers fast, non-dilutive, founder-friendly cash for growing SaaS businesses (venture-backed & bootstrapped), giving founders instant access to cash upfront, rather than waiting for monthly billing. Check out how it works in the first comment below 👇",
  "data/ph-top/2021/11/accessowl.json": "Simplify onboarding, offboarding and self-service requests for you and your team while keeping track of all your tools & accesses. AccessOwl makes all processes around access management a breeze. Automate your access management right in Slack!",
  "data/ph-top/2021/11/the-big-indie-maker-black-friday-sale.json": "A growing collection of best indie maker Black Friday deals from the community 🚀",
  "data/ph-top/2021/11/todopal.json": "It's not about getting more done — it's about getting the right things done well. You can accomplish anything as long as you stay focused on your goals. Use a todo app that makes you say \"no\" to the small things, so you can say \"yes\" to the big things!",
  "data/ph-top/2021/11/onlythreads.json": "Make your Slack channels ‘thread-only’, meaning any messages sent to these channels will automatically become standalone threads. After your team has had their say, close threads with a resulting decision visible to everyone.",
  "data/ph-top/2021/11/tool-library-by-uiscore.json": "A curated Tools Library by Design. Speed up your workflow with the library. More than 100 templates, free, trial and paid. Share your resources with us it's free.",
  "data/ph-top/2021/11/matchmade-express-campaigns.json": "We made working with content creators fast and simple. Over 9.2 million channels are analyzed to find matches for your product, whether it’s RPG gaming, lifestyle, or cooking. Launch your campaign from $500 and get sponsored content live on YouTube in days.",
  "data/ph-top/2021/11/weirdspot-fyi-by-humit.json": "Introducing WeirdSpot.fyi: Now turn the weirdest, most outrageous one-liners into a playlist. We know no one asked for this but weird stuff like this is what makes the internet beautiful. Get really weird for the best results :)",
  "data/ph-top/2021/11/marketing-tools.json": "We've curated the list of 250 top marketing tools that marketers should be aware of. This was done by selecting the top 3-8 tools in each category like Email Marketing, Live Chat, Affiliate Marketing, Content Marketing, Website Builders etc.",
  "data/ph-top/2021/11/phaver.json": "Web3 enables shared ownership and rewarding actual contributions. On Phaver you help others by sharing your best recommendations and get rewarded with tokens and DAO ownership. Join communities around your interests and collect the best things together.",
  "data/ph-top/2021/11/tmchecks.json": "TMchecks is a free and easy to use trade mark searching tool. Highlight a word or a group of words on the web page and with one click, and find out instantly if those word(s) have been trade marked by someone else.",
  "data/ph-top/2021/11/gear-slots.json": "Gear Slots is a unique, role playing game themed NFT. 100% on-chain Each token is a bag of 9 slots, where each slot is filled with a piece of randomly generated gear. Each slot can be traded with other tokens - allowing you to build a bag full of great gear.",
  "data/ph-top/2021/11/verdoo.json": "Verdoo is a browser extension that allows online buyers to offset their carbon footprint for free. Every time you make an online purchase, we plant at least one tree. It’s simple & effortless. 1 tree is planted automatically for every new account.",
  "data/ph-top/2021/11/no-code-mvp-assembly-line.json": "Value-packed no-code MVP package. In  45 days we’ll create your MVP using  Bubble or other low-code / no-code  platforms fitting your project best. It includes short Discovery, UI design creation, no-code product development.",
  "data/ph-top/2021/11/image-extractor.json": "Extract.pics is an easy to use tool that allows you to extract, view and download images from any public website. Simply paste the URL of the website into the input field and click \"Extract\" to start the process. completely free to use!",
  "data/ph-top/2021/11/sender-sms.json": "Sender is an omnichannel marketing platform that's accessible to everyone. Email, SMS, marketing automation and more - now in a single platform that's super affordable, easy to use, with top-notch support included.",
  "data/ph-top/2021/11/workybe.json": "WorkyBe is an AI-powered field and asset management platform that predicts malfunctions and enables the management of maintenance processes for companies with manufacturing and/or maintenance departments.",
  "data/ph-top/2021/11/nocode-chrome-extensions-builder.json": "✓ No Code Required Our platform automatically creates a ready-to-publishzip package ✓ Free Explore the possibilities. No credit card required ✓ Instant Download Download the Chrome extension package as soon as you place your order",
  "data/ph-top/2021/11/reel-unlimited.json": "Reel is a subscription-based marketplace that offers unlimited graphic design works for a flat monthly rate. Simply request a design, and get matched with pro designers that will handle it in 24 hours — your first design request is free.",
  "data/ph-top/2021/11/gridsome.json": "Gridsome makes it easy for developers to build static generated websites & apps that are fast by default 🚀 Easy, local development PWA-ready Simple, safe deployment No servers. No databases. Only files. Deploy your entire site to a CDN and forget about it.",
  "data/ph-top/2021/11/formspree-3.json": "Use your own frontend code. Submit to our API. We'll handle the rest. Build forms your way Powerful JavaScript forms Simple HTML forms Formbutton - Easy popup forms Trusted by 500,000+ freelancers, agencies, and Fortune 500 companies",
  "data/ph-top/2021/11/ted-smrzr.json": "TED SMRZR, an AI-powered platform, lets you read your favourite TED talks and compare the similar TED talks which would save your time. The talk/summary would be available in 73+ languages. No signup is required to access this free-of-cost platform.",
  "data/ph-top/2021/11/vissles-lp85.json": "Vissles LP85 is a 75% ultra-slim optical-mechanical keyboard crafted for speed, precision, and comfort. The LP85 strives a perfect balance between a conventional and a mechanical keyboard,",
  "data/ph-top/2021/11/soundrop.json": "Soundrop is an app that allows you to create your own personalized sound track to keep you focused or relax. You can mix and match&nbsp;different sounds and share your unique musical recipe with others. Use Soundrop to create your perfect environment.",
  "data/ph-top/2021/11/cccolor.json": "A simple color picker that makes it easy for web designers to pick cohesive colors for a project. Automagically get color values in formats such as hex, RGB or HSL.",
  "data/ph-top/2021/11/dickto-club.json": "Female co-founded NFT project donating 20% of minting proceeds to support RAINN and Movember Foundation. Inspired by all the weird and cute dicks we've seen, we want our community to share in our humor and see the art in dicks and the dicks in art.",
  "data/ph-top/2021/11/betterrecorder.json": "BetterRecorder is a screen recorder for mac, it can record screen with desktop internal audio, webcam video and microphone audio. It is easy to use.",
  "data/ph-top/2021/11/smartlist.json": "Smartlist is a free home inventory app for both personal and business use. Track your inventory, expenses, and more safely on any device.",
  "data/ph-top/2021/11/learner-s-kit.json": "Learner's Kit is a resource kit to help you pick some interesting resources from the internet and start learning from them 📖",
  "data/ph-top/2021/11/email-timer.json": "Generate custom countdown timer HTML code that you can easily embed in an email. Hassle free, no registration, with custom fonts and colors, multiple language and timezone support. Proven conversion boost up to 400%",
  "data/ph-top/2021/11/nsfw-logos.json": "For any Brand Identity Designers, Bad logos are fun and if they are dirty, it’s a Lottery. Find a collection of these funny logos at one place.",
  "data/ph-top/2021/11/widgetgrid.json": "WidgetGrid is a new way to turn Google Spreadsheets into data-driven widgets on the home screen. You can start from templates to create widgets. You can edit your data in spreadsheets and customize the design of all kinds of widgets in WidgetGrid.",
  "data/ph-top/2021/11/notion-ultimate-subscription-system.json": "This template is designed to help you keep track of your subscriptions, get reminders before the renewal date, see a timeline for your subscriptions, and convert the currency of any subscription to your desired currency.&nbsp;",
  "data/ph-top/2021/11/posturenet-posture-monitoring-on-mac.json": "AI based real-time posture monitoring  Mac App: 1. Reminds you when you slouch (with initial setup); 2. Privacy centric: none of your data leaves your computer, works without internet. 3. Works best if the front camera is in a fixed position like an  iMac",
  "data/ph-top/2021/11/sendletters.json": "Send Documents, Invoices, Letters physically to anywhere in the world Have Documents Printed, Folded and Mailed by us, starting at $1",
  "data/ph-top/2021/11/dockside-open-source.json": "Dockside is an open-source tool for provisioning lightweight access-controlled IDEs, staging environments and sandboxes - aka ‘devtainers’ - on local machines, on-premises (raw metal or VM) or in the cloud.",
  "data/ph-top/2021/11/free-christmas-3d-illustrations.json": "Free Christmas 3d illustrations set with stylish Santa, hand gestures and many more.",
  "data/ph-top/2021/11/whatsappshop.json": "WhatsAppShop is a platform allowing Homepreneurs, Creatives, Facebook Sellers and more to easily and quickly build a shop to sell items through WhatsApp",
  "data/ph-top/2021/11/reactivedoc.json": "Create Dynamic Documentation, Code Snippets, Simple Apps and Automations with Markdown, HTML and JS",
  "data/ph-top/2021/11/dino.json": "Dino is a new website, mobile app and desktop app to jot down your thoughts and all the stuff that you want to access quickly and easily. Dino is going to have a clear note taking space along with folders and a storage spoce for all your documents.",
  "data/ph-top/2021/11/the-new-gumroad.json": "You know all those great ideas you have? We want you to try them, lots of them, and find out what works.",
  "data/ph-top/2021/11/stooa.json": "Stooa allows you to create participatory online events with automatic facilitation based on the fishbowl method. Start creating a fishbowl now! Nothing to install. Free to use.",
  "data/ph-top/2021/11/checc.json": "File sharing, issue tracking, and a shared calendar – all in one place. Checc is your client’s one stop destination for everything about their project.",
  "data/ph-top/2021/11/further-3.json": "Further is an AI-backed mobile training and curation platform. Users can create learning experiences by using our built-in library, and they can add their own contents and lists to create more exclusive learning experiences for their organization.",
  "data/ph-top/2021/11/illustrations-by-premast.json": "Astonishing and a special pack of 100 business illustrations that work for all kinds of design uses. Fully editable vectors that enable you to modify the illustration art to fit your style, needed feel, and color palette. Free download!",
  "data/ph-top/2021/11/throw-me.json": "Throw-me is a fast url shortener which is open source and free from adverts. Runs on next js and uses postgresql database with prisma Has a free API.",
  "data/ph-top/2021/11/hedado.json": "Donate like a boss with Hedado! Simplify all your giving to a single transaction and still choose from over 1.5M charities! Already donate? Hedado tracks your receipts and prepares you for tax time - start by forwarding receipts to donations@hedado.com.",
  "data/ph-top/2021/11/writer-resources.json": "A resource directory that has all the tools and platforms writers and marketers need.",
  "data/ph-top/2021/11/social-scroll-for-instagram.json": "👀 Looking to find someone's first Instagram post? But don't want to manually scroll through thousand's of posts? ✨ We'll do it for you! Just press a button, and wait for the screen to scroll to the bottom!",
  "data/ph-top/2021/11/enbitious-1.json": "An online business learning marketplace that helps all ambitious entrepreneurs to learn & network. It also allows mentors to earn more money and build their personal brand.",
  "data/ph-top/2021/11/security-camera-lens-calculator.json": "Unique security camera lens calculator with 3D graphics(WebGL) and a camera database. Calculate Field of View, lens focal length, pixels on target. Load a floor map to see camera coverage. Check DORI zones by IEC/EN standard 62676. Your blurry footage said TRY",
  "data/ph-top/2021/11/parti-by-the-creator-project.json": "Create a full-branded, NFT-based membership site for your top fans, offering exclusive content and benefits.",
  "data/ph-top/2021/11/heybuddy.json": "Our application is a platform where the user can find a buddy suitable for his sport and level. In addition, he can buy online supports from personal trainers, create events on the sports he is interested in and socialize.",
  "data/ph-top/2021/11/cyber-monday-deals-generator.json": "Promote your offers during one of the busiest day of the year so that your products look their best! Explore professionally designed minimalist and clear landing pages for Cyber Monday or create your own cards with the Card Generator.",
  "data/ph-top/2021/11/hoffen.json": "Hoffen supercharges your customer onboarding and experience through live insights. Watch every individual click and scroll on your platform that feels as real as screen-sharing.",
  "data/ph-top/2021/11/assemblyai-auto-chapters.json": "With Auto Chapters by AssemblyAI, you can generate an automatic \"summary over time\" for your audio and video files as the topic of conversation changes.",
  "data/ph-top/2021/11/breshna.json": "Breshna empowers users to create their own educational, marketing and training video games with no-code & at lightning speed. Think Canva for video games 🎮 With Breshna, everyone can be a game developer! P.S: Breshna means lightning ⚡ in the Pashto language",
  "data/ph-top/2021/11/raycast-api-and-store.json": "Raycast is the command center for all your tools and workflows. With the new Extensions API you can build and share powerful productivity tools in no time. Supercharge your productivity by installing community extensions from the Store in one click.",
  "data/ph-top/2021/11/iris-clarity.json": "IRIS Clarity is a desktop app that uses voice isolation AI to remove those distracting background noises that often creep in. Real-time and multi-directional, Clarity allows all participants to immediately enjoy clearer sound, no matter where they are.",
  "data/ph-top/2021/11/giftpack-ai.json": "We create one-of-a-kind gifts for any occasion in less than 60 seconds. Our AI generates personalized gift recommendations based on the recipient's interests, personality, and social network profile.",
  "data/ph-top/2021/11/alms.json": "We know how stressful the life of a maker can be. It's super important to take care of your well-being. But how? We've built an app that inspires people to better themselves, and the world, daily through Creator-led challenges. Check it out now!",
  "data/ph-top/2021/11/relume-library.json": "Say goodbye to building Webflow websites from scratch. Access over 650 components so you can build and save thousands of hours using the world's largest Webflow component library.",
  "data/ph-top/2021/11/collato-2.json": "If you sell something, you'll need creative content – ads, videos & social posts. Getting there can be painful: briefing is unclear, feedback in long emails, and final files on someone's hard drive. Enter Collato, your new smooth workflow for creative assets.",
  "data/ph-top/2021/11/jupitrr.json": "🚀 Jupitrr is a creator's tool that makes content creation on social media fast and easy. 📈 Make use of bite-sized audio to engage with audience effortlessly. 🤩 A seamless creating experience for everyone.",
  "data/ph-top/2021/11/the-chartmogul-android-app.json": "Take your metrics on the go with our Android app! The ChartMogul Subscription Data Platform makes it easy to import your billing data and then analyze it like a pro with industry-leading subscription analytics.",
  "data/ph-top/2021/11/browserflow.json": "Browserflow is a Chrome extension that lets you automate any task on any website. Scrape websites, automate workflows, fill out spreadsheets, and much more — no coding required.",
  "data/ph-top/2021/11/grapevine-4.json": "Grapevine allows you to chat, collaborate and work in a 3D virtual space. With spatial audio, beautiful customizable 3D worlds, and loads of collaborative tools, Grapevine creates a feeling of togetherness and presence in your team. Join us in the metaverse!",
  "data/ph-top/2021/11/frond-hello.json": "Help new hires feel special on day one with a personalized page filled with welcome videos and useful links.",
  "data/ph-top/2021/11/graboxy-maze-captcha.json": "Replace fire hydrants and traffic lights with your brand. Blend the fun and easy-to-solve maze captcha into your website. Frustrate bots, not your users. 🎁 Free for a full year for all Product Hunters who sign up in 2021.",
  "data/ph-top/2021/11/godog.json": "GoDog is an app with a set of lessons for dogs and their owners, created with the support of experienced dog trainers. A dog training and walking plan, a health diary, and a walking tracker in the app help you keep your pet well-behaved, healthy, and happy.",
  "data/ph-top/2021/11/refi-app.json": "An open-source GUI tool to make interacting with Firestore less painful",
  "data/ph-top/2021/11/found-wireframes.json": "Found is a design asset with ready website blocks. Combine them to get a website in a moment, input any content, customize in a few clicks. Get high-quality Figma prototypes fast."
}