{
  "data/ph-top/2021/3/pablito-planeta.json": "Pablito Planeta is a design astrologist. Let's travel through the pixel galaxy to take a look into your future as a creative every month. Vamos, cariño—the gradient cosmos is yours!",
  "data/ph-top/2021/3/proapp-learn-design.json": "ProApp is a place to learn all things Design. It's your Digital Design College to learn various Design disciplines with bite-sized content on the go. We launched with 30+ courses - UI/UX design, HCI, Mobile & Web Design, Typography, Microcopy, & many more.",
  "data/ph-top/2021/3/smoothly.json": "Smoothly prepared for Food Intolerance and Vegan Diets. Tasty and healthy smoothie recipes. It serves easy, gluten-free, lactose-free and nut-free recipes for users keen on their health.",
  "data/ph-top/2021/3/uptime-4.json": "🔎 Discover new ideas from 1500+ books, courses, and documentaries ⠀ 💡Get smart fast with our 5-min Hacks to keep you informed and save your time ⠀ 🧠 Designed to make learning fun and memorable",
  "data/ph-top/2021/3/fonibo-1-0.json": "Fonibo: 15 minute delivery platform. Restaurants, hypermarkets, drug stores and few more are just close by one touch!",
  "data/ph-top/2021/3/tldr-this-2.json": "TLDR This is a web app (+ chrome extension) that helps you summarize any piece of text into concise, easy to digest content so you can free yourself from information overload.",
  "data/ph-top/2021/3/straw-page.json": "Straw.Page is an extremely simple website builder, focused on creativity. You can use it to design awesome websites straight from your phone",
  "data/ph-top/2021/3/streamtools.json": "Professional Streaming Tools. A full suite of streaming tools for your live content!",
  "data/ph-top/2021/3/clubhouseranking.json": "A ranking of the most popular users, rooms and events on Clubhouse.",
  "data/ph-top/2021/3/minerva-pro.json": "Minerva is the easiest way to capture and share clickable instructions for anything on the internet. No screenshots. No red arrows. No videos. Just step-by-step guidance. The Minerva Chrome extension lets you embed complex documentation into a URL!",
  "data/ph-top/2021/3/rarible.json": "Rarible is the first community-owned NFT marketplace. Create, sell or collect digital items secured with blockchain.",
  "data/ph-top/2021/3/erxes-mobile.json": "Your favorite tool for sales, marketing, and customer support - erxes - is now available on the go. Keep the ball rolling at any time by managing deals, responding to messages, and updating your CRM. For busy days on the go, erxes mobile is the way to go.",
  "data/ph-top/2021/3/enombic.json": "Enombic is a product for designing your own custom stock indexes, investing in them, and sharing them with your friends. Remix the ARK ETFs, market-cap weight the WSB symbols, or \"fork\" SPY and set your own custom weights. Then, it's one click to invest!",
  "data/ph-top/2021/3/tweet-peep.json": "Tweet Peep 👀 gives you instant, one-click access to what other people are saying about the articles and videos you're browsing. It shortens the great-minds-think-alike process. Let's peep other people’s thoughts on media across Twitter!",
  "data/ph-top/2021/3/magic-board-for-notion-1.json": "Track important tasks and projects, create upcoming events, keep notes and control expenses in one notion table. You can quickly find your to-do list or see how much money you spent last week.",
  "data/ph-top/2021/3/presearch-2-0.json": "Now you can be part of the Presearch Decentralized Search experience by operating a Presearch Node and helping to power the Presearch decentralized search engine while earning PRE tokens.",
  "data/ph-top/2021/3/zapp-pad.json": "Upgrade Zoom with a bluetooth connected keypad that lets you run Zoom with the click of a button. Video calls are easier with your twenty-two favorite Zoom shortcuts on one amazing hotkey pad. Available for both Windows and Mac.",
  "data/ph-top/2021/3/tw-rl.json": "tw-rl is an advanced bookmarking and curation tool for twitter. Once connected, easily showcase tweet media or \"loop\" threads together. Use cases: portfolio, blog, mood board, inspiration gallery.",
  "data/ph-top/2021/3/product-manager-s-guide.json": "Product management can seem like a daunting discipline, but once you get a grasp of the fundamentals, and combine that with some intuition, you’ll be on your way to leading successful projects.",
  "data/ph-top/2021/3/weekend-club-2.json": "We're the #1 weekend co-working club for bootstrappers to stay motivated, get helpful feedback and ship your project faster. Live sessions Saturdays 10am-5pm GMT & US Central time with a dedicated host, run over Slack & Zoom. Plus 100+ software discounts. 🤯",
  "data/ph-top/2021/3/presentation-templates-by-pitch.json": "🖼Browse 50+ templates — pitch decks, sales proposals, briefs, & more 💡Get inspired by stunning decks built to enhance collaboration 🎨Instantly apply different design styles to any slide 💬Easily customize templates to match your brand 👉 https://pitch.com/templates",
  "data/ph-top/2021/3/aerotime.json": "Every time we switch context, it takes us way longer to finish a task at hand. Aerotime creates space for deep work by stacking your meetings together & enables you to prioritize your most important tasks, in flow. Done across team, it saves even more hours.",
  "data/ph-top/2021/3/weet.json": "Weet is a video messaging tool that allows you to have asynchronous conversations with your team, partners, and customers. Weet includes instant recording, screen sharing, virtual background, video filters, emoji reactions, and rich comment options.",
  "data/ph-top/2021/3/prop-hero.json": "Prop Hero is an interactive gaming platform that allows fans of live sports to compete in the action by correctly predicting what is going to happen while they watch. Prop Hero can be embedded into broadcast streams or used as a second screen experience.",
  "data/ph-top/2021/3/design-cell.json": "Design Cell is a growing collection of elements and styles for iOS app creation. The first version includes more than 800 elements and 20 ready-to-use sample screens. Experience a convenient workflow in your favorite design area and get things done faster.",
  "data/ph-top/2021/3/thundercontent.json": "Thundercontent uses artificial intelligence to help you write unique articles on any topic at the speed of light. Spend less money and time, for a better result. Use Thundercontent to write: articles for websites, product pages, blog posts, and more...",
  "data/ph-top/2021/3/athens-research.json": "Athens is an open-source and local-first alternative to Roam Research. Athens is the most powerful and transparent knowledge graph.",
  "data/ph-top/2021/3/meetcode.json": "Meetcode tech interview helps companies to accelerate & scale hiring by integrating the need of face-to-face communication and key competencies evaluation, including library of 250+ questions, 20+programming languages and developers’ preferred built-in IDE.",
  "data/ph-top/2021/3/zepel-2-0.json": "Zepel is the project management software that takes you beyond simple issue tracking. This way, you can plan features, track progress of your entire product development process, and ship customer-focussed software painlessly.",
  "data/ph-top/2021/3/sales-glossary-by-reply.json": "An extensive list of 320+ sales terms and curated resources to help you enrich your vocabulary and develop a deeper understanding of the key concepts.",
  "data/ph-top/2021/3/changelog-by-versoly.json": "With Versoly changelog you can add custom fonts, analytics, custom domain, embeddable widget, SEO (pagination, sitemap, metatags) and give your whole team access.",
  "data/ph-top/2021/3/nomad-time.json": "Find the perfect time across multiple time zones. We have our coworkers, family and friends distributed across the globe. Knowing what time overlaps can get tricky. We created Nomad Time to have a simple, fast and delightful experience.",
  "data/ph-top/2021/3/orbitkey-2.json": "A durable and sleek card carry solution to help you move effortlessly through your day. Easily scan your ID, access or public transport card – custom-designed to be more durable and silent compared to standard retractors.",
  "data/ph-top/2021/3/official-bubble-zapier-integration.json": "With this new Zapier plugin, Bubble apps can create both “triggers” or “actions” for a Zap. This lets you do everything from trigger workflows to add, delete, and modify things in your Bubble app database with any web service in Zapier’s extensive library.",
  "data/ph-top/2021/3/voiceflow-2-0.json": "Join 60K+ conversation designers, developers & teams using Voiceflow to design, prototype & launch conversational experiences. ⠀ Launch live apps to Alexa/Google without code or use our new SDK to launch to any conversational channel w/ any custom tech stack.",
  "data/ph-top/2021/3/repl-it-teams-for-education.json": "Repl.it Teams for Education is a real-time collaborative coding environment for teachers and students to write code in 50+ languages. Teachers can create curriculum, facilitate pair-coding groups, provide instant code feedback with annotations and autograding.",
  "data/ph-top/2021/3/fundboard.json": "A free tool to help you find startup investors & manage your fundraising process. We help you to find the right person at the right firm. 🔍 Search 1000s of investors 💾 Save them to your FundBoard 🤝 Share them to get find introductions",
  "data/ph-top/2021/3/sprint-poker-by-parabol.json": "Sprint Poker is an intuitive, lightweight estimation tool that fits into your existing Jira workflow. 🗳️ Estimates that sync back to Jira automagically 🃏 Interactive cards and custom estimation scales ⏰ Async friendly for distributed teams",
  "data/ph-top/2021/3/people-of-clubhouse.json": "Who you follow is one of the most important aspects of the Clubhouse app. The Rooms that are shown to users are based on which people and Clubs you choose to follow. I compiled a list of 200 most influential people to follow on Clubhouse.",
  "data/ph-top/2021/3/teamtime-for-basecamp.json": "TeamTime is the simplest, most streamlined and secure time logging tool (mobile & web) designed specifically for https://basecamp.com users. We created it for https://www.clearbluedesign.com/ourselves after struggling with other tools out there. We share it with you.",
  "data/ph-top/2021/3/pneura-entrepreneurs-network.json": "pNeura is a platform that enables entrepreneurs to share their progress and connect with other entrepreneurs and investors. Investors can follow their portfolios with ease. Developed by Appello Software.",
  "data/ph-top/2021/3/flowchart-fun.json": "A small app for making quick flowcharts from text ⿻.",
  "data/ph-top/2021/3/stayflexi.json": "All-In-One property management and sales automation platform for independent hotels and vacation rentals. We also help our properties upsell unsold rooms and amenities in a completely automated way via guest messaging and direct sales on website.",
  "data/ph-top/2021/3/lumenate.json": "Get yourself comfortable, turn your phone so the flashlight is facing you, close your eyes then fall effortlessly into an immersive journey through a kaleidoscope of colours created by your subconscious...",
  "data/ph-top/2021/3/motion-firefox.json": "9 months after we initially launched on Chrome, Motion Firefox is finally here! Motion is an all-in-one time management tool that helps you get things done: by helping you maximize focus time, group meetings together, easily send availabilities, and focus.",
  "data/ph-top/2021/3/around-2-0.json": "Around is a lightweight video collaboration tool that floats on your desktop, perfect for things like design sessions, brainstorms, and code reviews. Available for download. Now comes with EchoTerminator.",
  "data/ph-top/2021/3/the-better-workplace-toolkit.json": "The priorities of workers are shifting. Unito compiled this toolkit to help kickstart your company’s growth in four important areas: remote work and flexible scheduling, diversity and inclusion, career growth and compensation, transparency and alignment.",
  "data/ph-top/2021/3/vidjet.json": "Vidjet is a smart video player for websites. It uses a popup format to display videos, so you can segment and trigger them to your visitors. ⠀ It's also the easiest and fastest way to publish videos on a website! 🚀",
  "data/ph-top/2021/3/kafkai-2-0.json": "Kafkai is a machine-learning algorithm writes articles from scratch. There is no scraping or spinning happening in the background. It allows you to get unique content for cents instead of dollars. It's perfect for bulk content production that SEOs require.",
  "data/ph-top/2021/3/avo-for-pms.json": "Avo takes the busywork out of analytics with a guided workflow that catches errors and syncs across your existing tools (including Amplitude and Mixpanel). For people who are tired of spending more time managing their data than building great products.",
  "data/ph-top/2021/3/datamool.json": "DataMool is a predictive, residential real estate investment analysis tool, which helps you to find and to analyze the best investment opportunities nearby.",
  "data/ph-top/2021/3/drillroom.json": "DrillRoom introduces AI for interactive pocket billiards training. Practice your fundamentals with the assistance of a virtual coach. Get real time feedback. Know your stats and track your progress over time. Level Up your game!",
  "data/ph-top/2021/3/quadrant-eye.json": "Our online eye exam makes it easy to get eye care from your couch. Visit our online eye clinic to quickly renew your glasses +/- contact lens prescriptions ($30,) or chat with a licensed eye doctor ($55)! Try here: https://www.quadranteye.com/ YC W21 Batch",
  "data/ph-top/2021/3/neuro.json": "Neuro gives you access to a network of GPUs with a single API call. Get instant MLOps. ☁️ Serverless compute ⚖️ Only pay for the compute used = no more 24/7 hosting fees! ⚡️ Go from prototype to production +10x faster. Check it out at https://www.getneuro.ai/",
  "data/ph-top/2021/3/hellofellow-2.json": "On Deck is awesome, but it costs both time and money. Browse Fellows from across cohorts, and book a 1:1 with them for free. They'll help you figure out if the program is a fit for you and your lifestyle.",
  "data/ph-top/2021/3/pastimes.json": "Pastimes&nbsp;is a mobile app and community that makes it easy to connect with like-minded outdoor enthusiasts.",
  "data/ph-top/2021/3/akin-3.json": "Personas used by marketing, UX design and research are often based on assumptions or stereotypes. Akin lets you replace old personas with one survey. Create or upload a survey and segment, find trends and insights without hiring a data scientist or consultant.",
  "data/ph-top/2021/3/soapbox-minis.json": "Introducing Minis, allowing users to add a game, a poll, or other interactive components directly into a room. Minis add to the current conversation, and offer new things to talk about. The first Minis include Polls, Would You Rather and Chosen At Random.",
  "data/ph-top/2021/3/google-fonts-icons.json": "Google Fonts gets new logo as catalog adds iconography, starting with Material Icons.",
  "data/ph-top/2021/3/teamo-2-0.json": "The joyful card platform ✨ Teamo has everything you need to create delightful group cards for any occasion with fun messages, photos, and loopy GIFs. Customizable, schedulable, and perfect for collaboration 💛 🎉",
  "data/ph-top/2021/3/historical-animated-gifs.json": "Amaze your friends with GIFs of historical figures that are ready to use on Giphy.com. At yadada.app, we used a great AI tool from Rosebud AI to map 15 emotions to 30 historical figures like Shakespeare, Tesla, Franklin (full list in the comments).",
  "data/ph-top/2021/3/zest-7.json": "Provide an outstanding Support experience with the power of video 🎥 Bring video to your current Support flow 💁🏼‍♂️ Made for Support and Customers teams ⚡ Your customers don't have to install anything 👉 Give it a try: https://hellozest.io/",
  "data/ph-top/2021/3/djaty.json": "With http://djaty.com/, anyone can professionally report. And no more bugs reproduction! Report includes: Screenshots Steps Clicks Logs Browser aspect Network state Background exceptions Machine aspect The line code caused the bug Integrations: Slack Jira Gitlab",
  "data/ph-top/2021/3/learnobit-2.json": "A web app that uses spaced repetition, a sophisticated learning algorithm, and a tree-structured note-taking tool. Think Workflowy and Anki combined. It also brings together various learning theories and tricks.",
  "data/ph-top/2021/3/prodcamp-feedback-widget.json": "A single place to store your customer feedback, manage it and act upon it! Try out our new feedback widget to catch customer feedback right inside your app!",
  "data/ph-top/2021/3/personality-illustrations.json": "Personality Illustrations is a pack of 40 diverse and fun avatars to supercharge your project. Download for free now!",
  "data/ph-top/2021/3/facecode-2-0.json": "FaceCode is the most intelligent coding interview tool ever built. It's helps interviewers make objective hiring decisions with ease, speed and accuracy.",
  "data/ph-top/2021/3/teenup.json": "TeenUP was created to give kids a platform to learn new skills each day from their peers. The app allows kids to quickly and easily create short, unique, educational videos to share with friends and the world.",
  "data/ph-top/2021/3/dpo-as-a-service.json": "DPO-as-a-Service at Legal Nodes is 5 times more efficient than a DPO in-house. The monthly package includes: ○ designation of a DPO at your company; ○ 2 requests from your users; ○ 2 30-min consultations; ○ a tailored GDPR roadmap; ○ 3 document templates.",
  "data/ph-top/2021/3/skizzle.json": "Skizzle is a chrome extension for Gmail that makes end-to-end encryption dead easy - No passwords to remember, share or manage - Send encrypted attachments to any Gmail address - Verify file access on a public blockchain - Generous Free Forever plan",
  "data/ph-top/2021/3/lola-ai.json": "Meet Lola AI, your new smart writing assistant that transforms bullet-points into clear, complete and compelling emails!",
  "data/ph-top/2021/3/milk-video-2.json": "Milk Video is a web app for marketers to turn webinars into designed video highlights in minutes. Effortlessly clip, caption, and design recordings to share the best moments in engaging videos. YC W21",
  "data/ph-top/2021/3/thiscodeworks.json": "It takes hours to find a code snippet or tutorial that actually works. And double that when you search for it again. We help you save & access your code in less than 5 secs with our web app, Chrome & IDE extensions. Just right-click and save!",
  "data/ph-top/2021/3/bounce-package-acceptance.json": "We built this product to let you receive your packages at a nearby pickup point...no more worrying about package theft, missed deliveries, or planning your day around when the delivery man is coming. We have ~1,000 locations all around the country.",
  "data/ph-top/2021/3/failory-3-0.json": "Huge re-design on Failory + 2 new projects: - Amazon Cemetery: Analyses of why +50 Amazon projects failed - Tools: Collection of +80 tools for startup founders.",
  "data/ph-top/2021/3/sensa-emoji.json": "👋 Emoji is our common language. However, the ones we use are owned by big corporations. 👩‍💻 So we created a growing set that you can use in your brands, products, and presentations → https://sensa.co/emoji 🎁 We are giving away a custom emoji among our Twitter followers, like the Mr. Hoover one!",
  "data/ph-top/2021/3/b-e-p.json": "B.E.P. or Backendless Ecommerce Platform turns any website into a shop with just 1-line of code, no backend or CMS required. Plus, it's free, minus standard processing fees (2.9% + $0.30, per transaction).",
  "data/ph-top/2021/3/navattic-2.json": "Build, share, and track interactive product demos that excite prospects and close more deals. → No engineering required with our no-code solution! → Build engaging feature overviews to share with leads → Share a dynamic leave-behind after the sales call",
  "data/ph-top/2021/3/pressbase.json": "Create a professional online newsroom. In addition to all the features from Ghost, it has some essential features that turn it into a professional online newsroom such as media kits, press clippings, built-in multi-language capabilities and newsletter options.",
  "data/ph-top/2021/3/clubhouse-tools.json": "Have you seen that people are starting to change their profile picture in Clubhouse saying that they are in radio mode or listening? That is exactly what Clubhouse Tools does. It is a web app where you can set up your status through your profile picture.",
  "data/ph-top/2021/3/veganzone.json": "Veganzone is a new mobile application where people who follow vegan & vegetarian lifestyle can share their common values, meet each other, socialize over the events they create and purchase vegan products.",
  "data/ph-top/2021/3/tricktionary.json": "Make Zoom meetings FUN! Kickoff your next one with Tricktionary, a 5-min creative stoke to engage your audience. Optimized for 4-14 players. *Today only* we are hosting a livestream marathon if you want to play with us. Link on landing page.",
  "data/ph-top/2021/3/upviral-2.json": "A new, flexible way to design your viral referral campaigns: we've just released a drag & drop page builder into UpViral, the platform to help grow your email list faster.",
  "data/ph-top/2021/3/gaannotations.json": "Do you remember the date you launch your product? 🤷‍♂‍ How can you begin to measure the impact of any event on website behavior if you can’t remember when it happened? Add Automated Annotations to Google Analytics - Ads Campaigns, Newsletter Releas...",
  "data/ph-top/2021/3/meetbutter-2.json": "MeetButter is a video conferencing tool that empowers facilitators to run interactive, buttery smooth online workshops!",
  "data/ph-top/2021/3/nerdy-image-downloader.json": "Nerdy Image Downloader is a tool for downloading images in bulk/batches. Download images from Pinterest boards. This tool automatically scrolls for you to collect all images and downloads them into a zip folder.",
  "data/ph-top/2021/3/svg-color-matrix-mixer.json": "Creating a nice looking SVG Color Matrix filter is tricky. This free web-app helps you easily create the right color matrix for your picture. Add contrast, brightness, hue, and saturation filters or adjust one or multiple matrix values simultaneously.",
  "data/ph-top/2021/3/onesimpleapi-com.json": "OneSimpleApi was born out of the idea that there should be a simple way of achieving complex features, when working with no-code tools. A toolbox, where you can find all the APIs that will make your creation go the extra mile: Just... One Simple API.",
  "data/ph-top/2021/3/font-interceptor.json": "Enter a URL, intercept the font files as the site loads, and download. Voila! You’ve got some new fonts. Does not work on all websites; not legal. Will you use it?",
  "data/ph-top/2021/3/universal-icon-set-2-0.json": "Universal Icon Set v2.0 is finally ready. 1671 icons in total. High-quality icon set for websites, apps, social networks, prints, billboards and even for a postcard for your mom.",
  "data/ph-top/2021/3/housely-club.json": "This MVP version helps users to discover interesting events based on a smart tags system and user proximity. The Housely app provides event hosts with a solution for scheduling and organizing club events, in an easy-to-use way.",
  "data/ph-top/2021/3/virtual-backgrounds-2.json": "A place where you can find the best free virtual backgrounds for your video calls. You can use them on Zoom, Microsoft Teams, Skype, Google Meet, WebEx or any other apps with custom background features.",
  "data/ph-top/2021/3/mochi-mobile.json": "Mochi = Spaced repetition + Zettelkasten + Markdown",
  "data/ph-top/2021/3/gradient-generator.json": "Easily create linear, radial, and conic gradients that avoid the dreaded \"gray zone\" in the middle of many gradients. Export as CSS or SVG.",
  "data/ph-top/2021/3/simplesounds.json": "A text editor where you can type dialogues, add emotions (crying, shouting, hatred, polite, out of breath, etc.). Select from a set of voices (hero, villain, AI, merchant, kid, etc.), add background effects, and export as a human-like voice in studio quality.",
  "data/ph-top/2021/3/spilldash.json": "Spilldash is a free Google Sheets add-on that lets you automate dashboard building in a new way. Manage dashboard with configurations like a web application but without the complexity. Watch video: https://www.youtube.com/watch?v=z7YxYpqDvRM",
  "data/ph-top/2021/3/nilly-analytics.json": "Simple and fast website analytics that belong to you. Fully GDPR & CCPA & PECR compliant. No more annoying cookie banners! Created and hosted in Switzerland 🇨🇭",
  "data/ph-top/2021/3/3d-plant-illustrations.json": "Pack of 7 high-quality 3D plant illustrations that can be edited in Figma or in Blender.",
  "data/ph-top/2021/3/wow-me.json": "Click a button, pay $1 and get redirected to a random url on the web. Get in touch if you'd like to have your url amongst those random ones",
  "data/ph-top/2021/3/airdocs.json": "Airdocs is a document generation service for Airtable. Create smart, beautiful-looking documents from your data. The drag-and-drop designer gives you ultimate control of your documents. Send your documents to another app or store them back in Airtable.",
  "data/ph-top/2021/3/scre-io.json": "Record videos from the camera or capture from the screen. Free screen and camera recorder. Capture unlimited videos. Available for Mac, Windows, Chrome and Edge browsers. More than 1 million individuals share billions of screen recordings using Scre.io",
  "data/ph-top/2021/3/intercept-3.json": "Surveys are broken, so we used video + audio to reimagine them. 💬 Reach out via SMS 📱Customers record video right in their web browser 📊 Transcriptions, sentiment, and emotion to make sense of videos at scale 🚀Capture authentic customer videos and reviews",
  "data/ph-top/2021/3/blushh.json": "Blushh is an app where women in Asia listen to short sensual audio stories to explore their fantasies. With a simple monthly subscription, we are an alternative to male-oriented pornography.",
  "data/ph-top/2021/3/lunatask.json": "Lunatask is an all-in-one privacy-focused todo list, habit and mood tracker, and pomodoro timer. It remembers stuff for you and helps you prioritize what to work on next. Markdown and end-to-end encryption included 🚀",
  "data/ph-top/2021/3/flyy-world-s-first-3d-social-network.json": "The world’s first 3D social network of actual cities & real places, so you to never miss out on social buzz in town. Flyy models real cities in a beautiful 3D interactive world for people to engage – anywhere - with friends, communities & businesses",
  "data/ph-top/2021/3/out-of-the-blue.json": "I realized we don't have a lot of tools for a conversation-first culture. So, I deleted social media off of my phone and built this app. Whenever I am craving connection, I have it populate a random contact for me to text or call.",
  "data/ph-top/2021/3/fluid-3.json": "Fluid is a simple & fun water tracking app that allows you to easily track how much you drink each day. To help you stay motivated, you can connect with your friends to see each other's daily progress.",
  "data/ph-top/2021/3/exty-solutions.json": "This app is used for writing copy for marketing purposes, such as website content or blog posts. This copy can be customized and unique to each client and can be used immediately on your website. The app uses artificial intelligence (AI) to write amazing copy.",
  "data/ph-top/2021/3/allfactor-analytics.json": "Allfactor is the leading market analytics platform that provides data-driven solutions for ecommerce brands to thrive in the industry. The tools enable sellers to optimize product offering, track performance, and conduct competitive analysis across platforms.",
  "data/ph-top/2021/3/flutter-2-0-1.json": "Our next generation of Flutter, built for web, mobile, and desktop Today, Google's announcing Flutter 2: a major upgrade to Flutter that enables developers to create beautiful, fast, and portable apps for any platform.",
  "data/ph-top/2021/3/welovenocode-community.json": "WeLoveNoCode Community - one single place to discuss, learn and unite with other great nocode developers. It's free, community-driven with NO paid memberships",
  "data/ph-top/2021/3/pollie-2.json": "Over 20% of females struggle with a hormone-related issue such as PCOS, endometriosis, or amenorrhea. Pollie is your friend at every step of your hormonal health journey, from finding your best-fit specialist to symptom tracking.",
  "data/ph-top/2021/3/clubhouse-cards.json": "Planning a Clubhouse meetup soon? Then you need to invite to your room as many people as possible. Let’s do it via social media: Twitter, Telegram, and Instagram. Put your content on the main artboard and get cards for all three platforms at once.",
  "data/ph-top/2021/3/wellbuddy.json": "WellBuddy is a smart wellbeing tool that makes it easy and simple to focus on your health at work. ⠀ It integrates with your calendar and monitors and schedules physical and mental health breaks when you’re free so you can think, feel and perform better.",
  "data/ph-top/2021/3/buymysideproject.json": "Marketplace to sell your side project and make some extra cash.",
  "data/ph-top/2021/3/whatsapp-shop.json": "Simple & Powerful Google Sheet Add-on to Launch an Online Store from Google Sheets and take orders on WhatsApp. It's free forever",
  "data/ph-top/2021/3/browserbird.json": "Make Your Own Automations - Build fully managed browser automations with BrowserBird. It's easy, fast, no programming knowledge needed to build browser automations with BrowserBird.",
  "data/ph-top/2021/3/poser-illustrations.json": "Poser is a vector illustration pack that includes 20 unique illustrated poses that can be used to emphasize key features of your products and/or services. We have a 25% discount for Product Hunt buyers https://gumroad.com/l/YkhLs/poser-25-ph",
  "data/ph-top/2021/3/the-eco-app.json": "Eco puts your money back to work for you. It's a single balance that lets you spend, send, save and make money at the same time. Earn 2.5-5% on your balance, plus get 5% cashback at merchants. And, soon, pay bills and send money to friends for more rewards.",
  "data/ph-top/2021/3/zupermaker.json": "Yep, it's one of those stash services again. But I don't think there's been one focused only on resources to supercharge designers, entrepreneurs, founders, indie-makers, side-hustlers and anyone building digital products or services. Lifetime access🎉",
  "data/ph-top/2021/3/referenceable.json": "B2B buyers are tired of the traditional sales process and want a B2C like buying experience. Deal Rooms transform your sales process to sell B2B buyers how they want to be sold. Open to close, deal rooms help your sales teams sell more and sell fast.",
  "data/ph-top/2021/3/beam-aea0c49c-788f-42f8-86e2-59d3667c1220.json": "Beam makes it easy to get paid to text your biggest fans. Send premium paid content, images, or videos directly to your monthly paying subscribers.",
  "data/ph-top/2021/3/helloscribe-guru.json": "HelloScribe Guru can write a draft on just about any topic - in seconds. Automated writing for long-form content has never been faster, easier, or more convenient. Get off the blank page - say bye-bye writer's block!",
  "data/ph-top/2021/3/keka-3.json": "Keka wants to be an easy to use little app, well integrated in macOS and very powerful. And it is. You can compress files in all common (and not that common) formats and uncompress almost every format file, with and without encryption.",
  "data/ph-top/2021/3/drink-map.json": "Drink Map is a small app that helps you log the places in which you have drunk. By pressing the only real button available, \"Raise the jug\", you'll mark your location. Learn a new fact every time you use the app on the DID YOU KNOW? section!",
  "data/ph-top/2021/3/arkipelago-space.json": "Discover new interesting things by exploring the space around links 🚀.",
  "data/ph-top/2021/3/screen-4.json": "The fastest way to create screenshots of your app for product pages on Apple App Store, Google Play Store, Microsoft Store, etc.",
  "data/ph-top/2021/3/litmaps.json": "Litmaps lets you navigate the scientific literature with interactive visualisations of citation networks. Create a literature map, discover new articles, and export your discoveries, to advance your research project.",
  "data/ph-top/2021/3/astra-serverless-database.json": "Scale database resources in and out on demand to match application requirements and traffic so that you pay only for what you use. Runs on every cloud with developer GraphQL, REST, JSON, CQL APIs. $25 usage credits per month.",
  "data/ph-top/2021/3/coderhouse.json": "Live online tech education for the Spanish-speaking world.",
  "data/ph-top/2021/3/e-read-my-cv.json": "A comprehensive tool for ensuring that Applicant Tracking Systems (ATSs) and other automatic filtering systems can accurately read you CV and extract text from it. Your CV will only progress to a human reviewer if a machine can read it properly.",
  "data/ph-top/2021/3/listed.json": "Focus on what matters, from small tasks to life goals: - Spend your time doing things and reaching your goals - Stop wasting your time classifying things or measuring productivity. Minimalist and delightful design. No sign up. No ads. No data collected.",
  "data/ph-top/2021/3/kbee.json": "Kbee transforms Google Drive folders into a searchable wiki for you, your team, or your customers.",
  "data/ph-top/2021/3/playar.json": "We have created a motivating way for people to mix exercise and fun. It is a library of augmented reality games: Flappy Bird AR, Pong AR, and Brick Breaker AR. Do pushups to play the games. Go play at playar.ai and earn your spot on the leaderboard!",
  "data/ph-top/2021/3/karaoke-nite.json": "Karaoke with friends together on the web or in VR and bring a little laughter back to everyone's homes. The brand new quarantine pastime. Currently in Beta!",
  "data/ph-top/2021/3/hand-music.json": "Hand Music is an easy to use music app which can be controlled by moving your palm to any block. Simply position your hand above a block to hear it play.",
  "data/ph-top/2021/3/cognifirm.json": "Our browser-based plug-in lets you build Excel import automation processes in less than 10 minutes. No code required. And the tool works in any online business system.",
  "data/ph-top/2021/3/tally-6514ee79-0820-4e3e-bbb4-4429549bb16c.json": "Tally is a new type of form builder. Just start typing and build forms for all purposes in seconds. Without knowing how to code, and for free!",
  "data/ph-top/2021/3/remoterated.json": "Share your remote story! We are excited to introduce RemoteRated, a focused place to rate and review the remote competence, benefits, and tools of companies. Like Glassdoor, for our new remote world.",
  "data/ph-top/2021/3/supersourcing.json": "Supersourcing helps both startups & enterprises find the right tech partners faster than ever before. The decade-old process of outsourcing is boring, expensive and often risky. Supersourcing is 100% pure delight. Trusted by founders from YC, Harvard & MIT.",
  "data/ph-top/2021/3/appfleet.json": "appfleet is an edge compute platform that allows people to deploy their web applications globally. Instead of running your code in a single centralized location you can now run it everywhere, at the same time. Get better performance, latency and uptime!",
  "data/ph-top/2021/3/30daysoftailwindcss.json": "Keep yourself accountable while learning Tailwind. Share your process on Twitter with the hashtag.",
  "data/ph-top/2021/3/counter-6.json": "Web Analytics made simple and therefore privacy friendly. No Cookies. No logging. No IP address fingerprinting. We don't collect personal data, which allows serving many users with little hosting costs. The source code is published under the AGPL‑v3 licence.",
  "data/ph-top/2021/3/the-creator-system.json": "Whether you're a maker, content creator, freelancer, indie hacker, influencer, or thought leader, The Creator System will help you stay organised and on track. You no longer need to rely solely on your motivation or inspiration to get things done.",
  "data/ph-top/2021/3/pry.json": "https://pry.co helps founders and makers manage their finances. Instead of using Excel, Founders and business owners can use Pry to manage their budget, expenses, hiring plan, and cash runway.",
  "data/ph-top/2021/3/argon-dashboard-material-ui.json": "https://www.creative-tim.com/product/argon-dashboard-material-ui?ref=producthunt is a free and open-source admin template for React & Material-UI that will help you create amazing websites. ✔️ 100 Handcrafted Elements ✔️ 4 Customized Plugins ✔️ 6 Example Pages Kick-start building your web apps now!",
  "data/ph-top/2021/3/plasma-finance.json": "Plasma.Finance is DeFi dashboard which aggregates the most popular DeFi protocols from different blockchains and allows users to manage their DeFi portfolio in one simple interface. You can trade and buy any ERC20 tokens with your Coinbase or Metamask wallet.",
  "data/ph-top/2021/3/card-curator.json": "Card Curator is an app to help young professionals maximize their earnings from everyday spending and travel for free. Get personalized recommendations to help you automatically earn 5-10% or more on all your spending.",
  "data/ph-top/2021/3/coindock.json": "Live cryptocurrency prices for you macOS Dock",
  "data/ph-top/2021/3/hypto-2.json": "Collect Colossal Content. Hypto.io takes NFT collection beyond the digital art space and allows its users to collect HUGE moments in internet history from an exclusive network of creators and influencers.",
  "data/ph-top/2021/3/chitterchat.json": "Want to expand your social network and meet interesting people online? Join ChitterChat and be matched one time per week with someone to speak to 1 on 1. Having Twitter will speed up the waiting time dramatically as we can verify you're a real person.",
  "data/ph-top/2021/3/kanda.json": "Kanda is building Affirm for general contractors. We let builders offer their customers a pay monthly option when they want a remodel but don't want to pay the full price upfront. Backed by YC (W21).",
  "data/ph-top/2021/3/nexstem-headset-wisdom-sdk.json": "NexStem Headset and Wisdom SDK allows you to capture high quality EEG data and process them in real-time to give predictions about what you are thinking, and then deploy that to a device or application to control them using nothing but your thoughts.",
  "data/ph-top/2021/3/lullaby.json": "Lullaby helps treat Tinnitus, a condition that makes you hear a very annoying sound for the rest of your life. Most of the ENTs I checked with seemed poorly prepared to help their patients with the stress, so the app teaches you a healthy way to do that.",
  "data/ph-top/2021/3/chessnotation.json": "Learn chess notations enabling you to analyse, visualise and review chess games.",
  "data/ph-top/2021/3/uflix.json": "They say don't judge a book by its cover... What about movies? uFlix takes movie nights and turns the decision process into an enjoyable social experience to have with friends, family or partners!",
  "data/ph-top/2021/3/bluelight-f7eaef4f-9848-482e-b5b5-4fb60fea5088.json": "Startup benchmark data is fragmented and disorganized, scattered across hundreds of Medium blogs. We are curating the world’s largest library of startup benchmark data, creating market transparency for founders and institutions.",
  "data/ph-top/2021/3/playlistmap.json": "https://PlaylistMap.com is the most direct and authentic way to reach new listeners, grow your fanbase, and increase streams and saves. PlaylistMap was built to make this easier.",
  "data/ph-top/2021/3/commonality.json": "Use data from your APIs, databases, or integrations to empower every team to grow your business’s bottom-line. Leverage OKRs and KPIs to cultivate a culture of accountability, transparency, and autonomy by focusing on your outcomes, not outputs.",
  "data/ph-top/2021/3/tech-folks.json": "Tech Folks is a collection of stories from underrepresented people in tech.",
  "data/ph-top/2021/3/grandicons-web-mobile-icons-collection.json": "Full Pack includes 1. 50 vector icons in SVG format (Scalable to any size even bill boards) 2. 50 icons in png format 400 x 400 3. Example usage 4. Access to free future updates and revisions.",
  "data/ph-top/2021/3/seedr-3.json": "Seedr simplifies the way you get stuff, stream and access it.",
  "data/ph-top/2021/3/motion-design-illustration-assets.json": "A collection of premium motion design and illustration resources. Currently, - 20+ character designs & animation rigs - 30 avatars - 100+ props for scene creation (inc. devices & accessibility) - Colour swatches - Roadmap to add 100+ assets of varying themes",
  "data/ph-top/2021/3/hidden-tools-2-0.json": "Version 2 is now here: In addition to all the typical creative tools you are familiar with, you'll also find a wide collection of hidden tools that help you bring your ideas to life.",
  "data/ph-top/2021/3/press-to-flow.json": "Join thousands of people who’ve switched from WordPress to Webflow. Make the change today.",
  "data/ph-top/2021/3/wishu.json": "WishU is a free and intuitive mobile app that simplifies group celebratory video creation for any occasion. Create an event and contribute videos and app stitches it masterfully. It is free!",
  "data/ph-top/2021/3/seo-station.json": "The SEO Onpage extension for Google Chrome that makes SEO daily tasks easier, as you can check easily if the url you are browsing has any Onpage SEO issues, even if the web uses Javascript rendering. It integrates with \"Inspect URL\" in Google Search Console.",
  "data/ph-top/2021/3/webicaster.json": "WebiCaster is a new professional network for English and Spanish podcasters, it's the easiest way to discover amazing people who want to be part of your podcast. We make it easy for you to find a guest for your interviews or a co-host to create a new podcast.",
  "data/ph-top/2021/3/dbt-pal.json": "DBT Pal is the easiest, fastest and most intuitive way to track and manage your weekly DBT diary card. Daily tracking of your urges & emotions, journaling, paced breathing exercise & guided meditations, daily reminders & export to therapist.",
  "data/ph-top/2021/3/devcover.json": "Devcover is an open-source application that allows developers to create and deploy their portfolio in less than 5 minutes with just their username. Features - Good designed - Google Analytics support - SEO friendly - Mobile friendly - Fully customizable - High performance - Availability to be hired - And much more...",
  "data/ph-top/2021/3/iou-money.json": "Keep records of all your cash flows in multi-platform application, get notified for actions taken on your transactions, mention the debtor/creditor, analyze your transaction history, view detailed reports and one-one reports and optimize your flow of cash.",
  "data/ph-top/2021/3/library-of-diversity.json": "Library of Diversity is a space for meaningful conversations that connects people across the globe through video-conference to share stories that promote diversity and inclusion.",
  "data/ph-top/2021/3/verso-d1ad32fb-f1d5-4b1b-a4d6-dfb7798f52f1.json": "Verso is a universal mobile cashback application available on iOS and android. Verso rewards user's purchases made from the app in BTU cryptocurrency. BTU can be redeemed into any gift card of the user's choice inside the app.",
  "data/ph-top/2021/3/the-silent-podcast.json": "It's easy to forget to take time out of your day for mindfulness and meditation. The Silent Podcast is an automated podcast feed that provides a daily 10-minute pocket of quiet and stillness in your routine.",
  "data/ph-top/2021/3/utile.json": "Decorators is one of the many concepts which makes Python programming amazing. The key usage of decorators is to modify the functionality or state (behavior) of a function. This package brings out a relatively new concept of Function Foundation.",
  "data/ph-top/2021/3/brevy-beta.json": "Brevy turns your website into a collaborative workspace, allowing anyone on your team to leave feedback or report issues directly inline. Connect your favorite tools like Slack and Jira to automatically create and assign work items without leaving the page.",
  "data/ph-top/2021/3/things-2.json": "THINGS is a browser-based interactive 3D tool to generate custom device mockups. Our 3D devices can fit into your presentation, just upload your design, adjust settings and download your individual images directly in your Browser",
  "data/ph-top/2021/3/socialbu.json": "SocialBu is the complete solution to improve your social media presence and maximize your results. Publish, Respond, Analyze, and Automate - all from within SocialBu",
  "data/ph-top/2021/3/nfthub.json": "The mission of NFThub was (when I started it nearly a year ago) to streamling the day to say lives of people working full time in the #NFT industry. With all of the recent attention on #NFTs the vision has expanded, but remains commnuity centric, and free.",
  "data/ph-top/2021/3/archimedes-2.json": "Archimedes is the investment learning hub for everyone. Make investing a bigger part of your life by learning from a personal curriculum of bite-sized lessons, fun gameplay, and from a trusted community. Sign up and become a better investor today.",
  "data/ph-top/2021/3/turing-college.json": "Upskill in data science by working on projects co-created with tech companies. Remote learning at your pace, supervised by industry experts. Build a portfolio and be work-ready on day one! Pay when employed with an Income Share Agreement (ISA).",
  "data/ph-top/2021/3/terminhack.json": "Terminhack lets you pretend to be a hacker running real penetration testing tools. You can run it directly from the website or from your terminal!",
  "data/ph-top/2021/3/gluten-scan.json": "Hard to know if a product contains gluten ? Scan it ! Share your recipes & discover content",
  "data/ph-top/2021/3/knowledge-base-by-labiknow.json": "The All-in-One: Knowledge Base Software with Customizable Help Center Site, Public Roadmap, Embeddable Help Widget, Boosted Announcements & Feedback Collection.",
  "data/ph-top/2021/3/arrows-3.json": "Send every customer a personalized onboarding checklist, with automated email reminders, assigned tasks, and a lot more. Upgrade that dusty spreadsheet and onboarding process you no longer love. Onboard your next customer with Arrows.",
  "data/ph-top/2021/3/ditto-for-developers.json": "Teams use Ditto to manage and componentize the words across their product from design to production. ⚡ Eliminate error-prone copying and pasting and let developers get back to building. Use our API/CLI to pull up-to-date copy into local directories.",
  "data/ph-top/2021/3/loops-feedback.json": "Loops is a research tool designed by creatives to support the creative process. Get honest opinions from your target audience annotated on to your ideas in minutes, analyze it in a few clicks, then optimize your work so it truly resonates.",
  "data/ph-top/2021/3/ai-emails-by-snazzy.json": "An email drop by Snazzy AI. In a single click, write emails to pitch investors or potential customers.",
  "data/ph-top/2021/3/alertly-io.json": "Alertly is your personalized slack bot for getting JIRA alerts. Set up important reminders, which are actionable and personalized so that the right person gets notified, all from Slack!",
  "data/ph-top/2021/3/100-project.json": "https://100project.co is the world’s first crowdsourced NFT, a truly collective work of art. Once all pieces are filled, the final artwork will be minted as an NFT, with profits going to the owners of each piece if sold—so buying a piece is also an investment.",
  "data/ph-top/2021/3/defragged-a-game-about-calendars.json": "Can you make time where there is none? We're two designers at Clockwise who built a video game to help us design a better algorithm.",
  "data/ph-top/2021/3/techpool.json": "For the best tech & startup jobs and talent around the world, try techpool.io or the techpool apps on the Google and Apple app stores!",
  "data/ph-top/2021/3/colorgram.json": "We are glad to introduce Colorgram - an extension that replaces a white Instagram theme with a new colored one! Just choose a new theme from a list of different themes, apply it, and your Instagram will be painted to new cool colors.",
  "data/ph-top/2021/3/multistream-studio.json": "With Multistream Studio you can simultaneously broadcast to multiple live video services while using your favourite app (like OBS or Zoom), video camera, hardware encoder or mobile phone. It acts like a middleman copying your stream to multiple destinations.",
  "data/ph-top/2021/3/preki.json": "Preki is a B2B wholesale marketplace in Latam, where retailers can source goods through a mobile app and direct vendor links. Their mission is to help both retailers and vendors grow their businesses and offer them the tools necessary to do just that.",
  "data/ph-top/2021/3/rejoy-health.json": "Rejoy Health is a subscription service for the 20M people with Thyroid Disorder in the US. Rejoy Health members pay a monthly fee for treatment, symptom management & lifestyle coaching.",
  "data/ph-top/2021/3/railz.json": "Railz is the only Data as a Service platform that connects, normalizes and analyzes financial data from accounting service providers. We do this to make financing decisions faster, better and easier for Financial Institutions.",
  "data/ph-top/2021/3/voice-recorder-pro.json": "Voice Recorder Pro is designed to meet all your recording needs and help you work efficiently, including Audio Recording, Playback, Management, Sharing, Editing, and more. Let everything be in perfect order.",
  "data/ph-top/2021/3/conre.json": "Easy way to get data from general public and Easy way to join research and earn money! Conre is connecting researchers to participants with mobile apps Free to post and join research in Conre!",
  "data/ph-top/2021/3/differences.json": "Find the five differences in each of the countless varied pictures in a given time. With daily challenges, as well as recurring events on great themes. Train your brain and your attention in the addictive puzzle game and keep yourself fit.",
  "data/ph-top/2021/3/plip-trip-planner.json": "Organize and collaborate on trips with friends and family! Completely FREE, with per-plan privacy, real-time syncing, Google maps integration, apps on web and mobile, offline mode, and more! Say goodbye to your planning headaches and start planning with Plip",
  "data/ph-top/2021/3/pins-peep.json": "Pins Peep 👀 gives you instant, one-click access to the inspiration on Pinterest from anywhere on the web.",
  "data/ph-top/2021/3/makemyfund.json": "MakeMyFund enables investors to build and invest in their own fully personalized efunds - without being experts in capital markets. The idea is to deliver 3%-5% higher returns than conventional mutual funds - most of this based on lower cost and tax savings.",
  "data/ph-top/2021/3/bazar-2.json": "Bazar is a curated platform of your favorite local artists, artisans, and merchants in the form of a mobile marketplace! Bazar Merchant serves a mobile Point of Sale capable of connecting to the Bazar Marketplace, where merchants can create and manage shops.",
  "data/ph-top/2021/3/webbtree.json": "Replace a ton of contact finding tools and spreadsheets with one simple free tool: - Source (X-Ray search) - Contact Enrichment (enrich profiles with free+premium contact details using the Chrome extension) - Nurture (bulk emailing, notes, call logs, etc.)",
  "data/ph-top/2021/3/moon-11.json": "Pay with crypto everywhere Visa® is accepted online in the US with Moon Visa® Prepaid Cards. Purchase single-use virtual cards with Bitcoin, Litecoin, Ether, and more. Moon is private and secure, and we don’t charge users any fees.",
  "data/ph-top/2021/3/socialbee-6cbaefb1-de90-4f34-b53f-7c1cf0ba9147.json": "Seamlessly create an excellent social media schedule that works for you. From advanced editing options for your posts to recycling your best evergreen content, you can now grow your business’ online impact in no-time.",
  "data/ph-top/2021/3/amplication.json": "Amplication is an open source development tool. It helps you develop quality Node.js applications without spending time on repetitive coding tasks.",
  "data/ph-top/2021/3/songlio.json": "An extremely entertaining musical guessing game where you race against friends to name that tune! \"The music round of a pub quiz on steroids\". Great for livening up a group Zoom call. Also includes single player quizzes and custom quiz creator.",
  "data/ph-top/2021/3/letterbox-2.json": "Ready-to-use templates to prepare each email faster. Inform your subscribers about something very cool in a modern way. Don't waste time changing a single email design. Focus on the content.",
  "data/ph-top/2021/3/nacapi.json": "Nacapi creates a well documented API from any kind of JSON: - Paste your JSON file on the console - Create your unique API - GET, POST, PUT, DELETE http methods are supported - Perform operations: random, filtering, limit, sorting (and more coming soon)",
  "data/ph-top/2021/3/friend-filter-pro.json": "This cloud-based tool will help you analyze your Facebook profile by providing detailed info on who is engaging with your posts! Find who is inactive and delete them with a few clicks. Easily automate friend's request process.",
  "data/ph-top/2021/3/formst.json": "Formst is a JavaScript library for structuring and validating forms in React. It is based on MobX-State-Tree which makes it simple and performant and it is built on the principles of \"UI as an afterthought\".",
  "data/ph-top/2021/3/1000-business-ideas.json": "We have developed a simple web app that lets you find apps on Google Play Store that have high download numbers (100,000+) but poor rating. This is a great business opportunity for anyone who can build a better app and monetize it by providing a paid version",
  "data/ph-top/2021/3/rive-2.json": "Use our collaborative editor to create motion graphics that respond to different states and user inputs. Then load your animations into apps, games, and websites with our open-source runtimes.",
  "data/ph-top/2021/3/graze-6e16de73-348c-433b-8e6d-e9560640c5d2.json": "Graze is the first true Video Based Social Networking App. Why waste endless time messaging and going on disappointing dates? Instead, you can spend 5 minutes or less on a Video Chat to find out if you have chemistry and a dynamic worth exploring in person.",
  "data/ph-top/2021/3/webiny-5-0.json": "Webiny is an open-source framework that helps developers architect, build and deploy applications on top of the serverless infrastructure. Webiny also comes with a serverless CMS that runs on top of AWS Lambda, DynamoDB, and S3.",
  "data/ph-top/2021/3/learning-seo.json": "Do you want to start learning or expanding your SEO learning process and don’t know how? I’ve created this SEO learning roadmap for you to make it easier",
  "data/ph-top/2021/3/perfect-recall-2-0.json": "Perfect Recall is a free app that lets you make highlight reels from your Zoom calls simply by selecting the transcript text. Share these reels instead of written notes as engaging summaries to show ‘what happened’.",
  "data/ph-top/2021/3/coinmarketcal-2.json": "CoinMarketCal is the leading economic calendar for reliable cryptocurrency news. It covers all events that help crypto traders make better decisions.",
  "data/ph-top/2021/3/serverless-invoices.json": "Serverless Invoices is a free tool for invoice generating and management - no signup needed. Truly serverless, your data is safe with you in your browser. Export/import your invoices. It's open source, easy to modify, easy to deploy.",
  "data/ph-top/2021/3/oto-lawn.json": "OtO is the first outdoor smart home device that:​ ​ - you can set to water EXACTLY where you want​ - applies environmentally-friendly fertilizers & pest control​ - saves you time, water, and money​ Plus, it’s solar powered! 🌞​",
  "data/ph-top/2021/3/bluu-1.json": "Bluu handles all the repetitive tasks required for proper documentation in your meetings. No more screen sharing, access permission issues, messy documents all over the place or needing to remember to send the minute. Let Bluu take care of that for you 🚀",
  "data/ph-top/2021/3/travel-safe.json": "Travel Safe helps you discover the safest travel destinations during COVID-19. Browse locations by vaccine rates, travel requirements, and local restrictions.",
  "data/ph-top/2021/3/nile-dashboard.json": "Comprehensive design system featuring modular components to help build consistent, high-quality and performant web apps.",
  "data/ph-top/2021/3/bobson.json": "Bobson is a powerful web doc creation tool that gets everything and everyone on the same page. Gather content from any source and tell the whole story. Share it in a link, and get instant intelligence on opens, views, clicks, and more.",
  "data/ph-top/2021/3/crazyones-new-tab-1.json": "Here’s to the Crazyones. Crazyones New Tab is a free Google Chrome extension that brings daily inspiration to your new tab. With inspirational quotes and always-on goal reminder, get things done and boost your productivity!",
  "data/ph-top/2021/3/openvc.json": "Instantly find the \"best fit\" VC funds for your startup. OpenVC lets you browse 2,200+ funds by investment criteria. In return, VCs receive less spam and more qualified deal flow. Let's build an open way into VC!",
  "data/ph-top/2021/3/alt-3.json": "Alt lets you treat your sports card collection as an investment portfolio. You can buy and sell pre-authenticated cards on our exchange and track the current market value for all your assets with our integrated portfolio management view.",
  "data/ph-top/2021/3/tweek-calendar.json": "To enhance your productivity, Tweek is built around a week calendar view without any hourly scheduling. We’d say it’s the best view to organize your life and work without stress. Use it online or https://tweek.so/calendar/printable it on the wall.",
  "data/ph-top/2021/3/pingpong-b3ceffb4-b6da-406c-9394-fa225124e1e4.json": "Better collaboration for product teams in multiple time zones. Exchange video, voice, and screen recordings with your team at the tap of a button.",
  "data/ph-top/2021/3/waterful.json": "Waterful is a fresh take on water reminder apps. With multiple healthy challenges to take, friendly notifications to follow & our cute octopus to keep you company, staying hydrated becomes fun.",
  "data/ph-top/2021/3/amigos.json": "Amigos is a hand-drawn illustration library excellent for creating infinite compositions! Be one of the first to test out these doodles exclusively with Blush Pro.",
  "data/ph-top/2021/3/trackingplan.json": "Get a living snapshot of all your analytics. Just copy and paste a single line of code to your Website or App and, within minutes, all your events will be monitored and automatically added to your tracking plan.",
  "data/ph-top/2021/3/fintoc.json": "Fintoc enables developers to initiate bank transfers and pull transactional data from their users' bank accounts. Whether an app wants to automate bank reconciliation or improve its underwriting process, Fintoc is the way to go in Latin America.",
  "data/ph-top/2021/3/channel-2.json": "Easily removes distracting settings and features from apps ✨ Turn off auto-play videos ✨ Hide news feeds ✨ Unsubscribe from notifications ✨ Hide recommendations ✨ Supports YouTube, Facebook, Instagram, Twitter, and more",
  "data/ph-top/2021/3/page-experience-checker-by-cloudways.json": "This free tool determines if your website follows the 7 key factors and if its complaint with Google's Core Web Vitals. Knowing where your website stands will help you prepare for the upcoming Google Page Experience Update in May!",
  "data/ph-top/2021/3/wombo-3.json": "WOMBO is the world’s best AI-powered lip sync app 👨‍🎤👩‍🎤 All you have to do is add a selfie, pick a song, and let WOMBO work its magic. The result? Videos that are hilarious, bizarre, fun, and ready to go viral. No singing lessons required.",
  "data/ph-top/2021/3/mockuuups-studio-3-0.json": "Powerful mockup generator that lets you seamlessly mix and match different hand models with devices and backgrounds. Works on the macOS, Windows and Linux. Also available as a https://www.figma.com/c/plugin/786250770157843670/Mockuuups-Studio.",
  "data/ph-top/2021/3/red-2.json": "Meet Red: the only full-featured, professional Redis client written from the ground-up for the Mac! Red provides a powerful yet wonderfully simple interface to interact with Redis.",
  "data/ph-top/2021/3/float-7.json": "Animate your layers and present your art in a whole new dimension! ✨ Float transforms static and flat artworks into moving creations. Your masterpieces deserve to be shown in the most fun and engaging way.",
  "data/ph-top/2021/3/warpar.json": "warpAR is a free augmented reality app for iOS that lets you distort the textures of the real world. Tap and drag to reshape buildings or turn murals into swirls of color using a set of liquify tools.",
  "data/ph-top/2021/3/upaste.json": "uPaste for Mac will record and organize your copy/paste history automatically. Then you can use your pasteboard content anytime, any where with elegant beautiful UI.",
  "data/ph-top/2021/3/blogstreak.json": "Blogstreak is the tool library for your blog. If you want nice clap and comments for your static blog then look no further blogstreak has the answer. Blogstreak using latest webcomponent technology so it's highly customisable.",
  "data/ph-top/2021/3/hypernotes.json": "Hypernotes is a knowledge management app with bi-directional linking, outlining, and super-powered collaboration features.",
  "data/ph-top/2021/3/gravity-3a9d5beb-5cdd-4346-8941-dba5a8a68fe9.json": "Gravity is a sales intelligence platform helping individuals leverage triggering events that signal when to reach out to prospects. These events include when a prospect changes a job, when a company receives funding or when a company is growing quickly.",
  "data/ph-top/2021/3/twiso.json": "Twiso is a tool that helps you personalize your clubhouse invite page with a click of a button. You can use 3 custom eye-catching templates to unleash uniqueness and grow your audience.",
  "data/ph-top/2021/3/mutrics-aric.json": "Developers interested in creating applications and experiences for augmented reality, should check out the Mutrics ARiC open source augmented reality glasses, specifically created for the development process.",
  "data/ph-top/2021/3/clockdock.json": "The perfect addition if you hide the menu bar.",
  "data/ph-top/2021/3/dropit-for-clubhouse.json": "Sharing in Clubhouse should be fast, easy, and convenient. That’s where we come in. Pick a hashtag. Share it in your room. Drop a link. Drop a question. Dropit.",
  "data/ph-top/2021/3/candid-resumes.json": "Candid helps companies resume screen applicants to find the best and filter out the rest. Is your resume good enough to pass a resume screening? See if you pass the test by trying our demo on our website by uploading your resume to get automated insights.",
  "data/ph-top/2021/3/homeroom-2.json": "Each week, we find you the single best article to read next for getting better at your job. In our mobile app, you're grouped with people in your role at different companies who are reading the same thing. Features facilitate intimate peer-to-peer learning.",
  "data/ph-top/2021/3/coder-2.json": "Coder moves software development to your cloud, centralizing an organization's development initiatives and unlocking substantial gains in both developer velocity and enterprise security.",
  "data/ph-top/2021/3/ipsm-io.json": "The project aims to provide tools to use during the development process. Generate Lorem Ipsum placeholder texts, custom color dummy images, and videos of different sizes. Use generated content to test the layout until the real content arrives. Give it a try!",
  "data/ph-top/2021/3/laravel-kit-2.json": "A simple and elegant desktop application for managing your Laravel applications. - Execute Artisan commands easily in a nice interface. - Tinker with your project in a magical code editor.",
  "data/ph-top/2021/3/place-dog.json": "A simple service to get cute dogs as placeholders for your websites and designs. Just add a width and height to the end of the url.",
  "data/ph-top/2021/3/flashdrive-io.json": "FlashDrive NoOps app platform handles everything for you while you focus on your product. Made by developers for developers, FlashDrive is compatible with Git deployment (Github, Gitlabs etc...), DockerHub etc... Free backups, SSL certs. and load balancers.",
  "data/ph-top/2021/3/chums-2.json": "Chums is a community to recommend products to friends. 1. Make a profile with your favorite products 2. Ask your friends and interest groups for help 3. Make group chats just for shopping",
  "data/ph-top/2021/3/jooseph-2.json": "Jooseph is a content curation tool for course creators to share learning paths with their audience. - Create interactive learning paths from any link on the web - Accept paid subscriptions, and make money - Make announcements, keep your audience updated",
  "data/ph-top/2021/3/clara-1255f6d3-160b-421e-bc68-cb993bba7360.json": "End-to-end spend management for companies in LatAm. Issue unlimited physical or virtual cards, set limits for each, get real-time visibility of your team’s spend, and save valuable time on tedious tasks like invoice matching.",
  "data/ph-top/2021/3/emoji-cloud.json": "Emoji cloud is a CDN for vector emojies. Search copy and paste vector emojies to your projects in seconds",
  "data/ph-top/2021/3/clyde-2.json": "You don't need to be a 'Nerd' or 'Points Guy' to maximize your finances. 💳 Clyde shows you what each credit card is worth to you based on your transaction data. It's instant, personalized, and transparent.",
  "data/ph-top/2021/3/haikei.json": "A web-based design tool to generate unique SVG design assets for websites, social media, blog posts, pitch decks, and more! Choose a visual from our growing list of generators, customize, randomize, and export it as an SVG or a PNG.",
  "data/ph-top/2021/3/theprodcast.json": "TheProdcast is a technology podcast featuring seasoned product professionals, CEOs, Founders, and VCs. While our Season 1 focused on the stars behind stellar products that people love, Season 2 is all about impactful stories of promising women techologists.",
  "data/ph-top/2021/3/coingecko-4.json": "CoinGecko provides a fundamental analysis of the crypto market. In addition to tracking price, volume and market capitalization, CoinGecko tracks community growth, open-source code development, major events and on-chain metrics.",
  "data/ph-top/2021/3/the-kilobyte-s-gambit.json": "Can you beat a Chess computer written with 1KB of Javascript?",
  "data/ph-top/2021/3/ark7.json": "Ark7 is a real estate investment platform where you can buy property shares at as low as $5 to earn passive monthly income and future appreciation. In the meantime, you don’t have to worry about property management because we take care of it.",
  "data/ph-top/2021/3/planny-5.json": "It’s time for Planny 5. Planny 5 combines an all new design with many new features. Start to plan your day, complete all your daily tasks and review your recent productivity. Three simple steps to become more productive over time.",
  "data/ph-top/2021/3/souvenir.json": "Life is a magical journey; why not getting some souvenirs out of it? 1. Open the app. 2. Write down 3 things you are thankful for that day. 3. That's it! We are working on exciting features. Have fun with the innovative Souvenir gratitude tracker app!",
  "data/ph-top/2021/3/slog.json": "Turn your Slack Channel into a Blog Post with custom emojis. ■ Collaborative writing Write as you chat, and publish to the web ■ Easy to use If you know how to use slack, you are good to go ■ Custom emoji support Use emojis, defined in your slack workspace",
  "data/ph-top/2021/3/aimade-art-2-0.json": "One-of-a-kind portrait, landscape and abstract artworks created by Artificial Intelligence. Each artwork is minted as a non-fungible token (NFT) on Ethereum's own blockchain.",
  "data/ph-top/2021/3/embed-so.json": "With embed.so, you just need to upload a video, and you will get the embed code in minutes. Place the code to your website, and see the video gets displayed 🤩 It's time to upgrade your website, make it more personal and engaging! 💪",
  "data/ph-top/2021/3/userinterface-io.json": "Make your user interface a little bit better by receiving weekly UI/UX insights. If you're a developer, solo-founder, product manager, or you feel the pain of user interface design this newsletter is specially for you.",
  "data/ph-top/2021/3/analyzify.json": "Without any coding expertise, you can set up Google Tag Manager, Google Analytics 4, Facebook Pixels, and Universal Analytics Enhanced Ecommerce and many others into your Shopify store. Analyzify comes up with a Done-For-You setup option at no extra cost.",
  "data/ph-top/2021/3/text-blaze-2.json": "Text Blaze allows you to save text snippets and insert them anywhere on the web using keyboard shortcuts. Snippets can be plain text, but can also include dynamic dates, formulas, real-time input and integrations with other apps. Try it, it's free!",
  "data/ph-top/2021/3/sticker-cards-2-0.json": "Welcome to brand new Sticker cards. Sticker Cards 2.0 has been rewritten from the ground up using new technologies and powerful frameworks and it’s something that you’ve never seen before.",
  "data/ph-top/2021/3/nifty-ink.json": "Draw something and create a NFT in just a few seconds, it will eternize your art on Blockchain. Nifty Ink works on xDAI chain, you can mint a NFT just for a few fraction of a cent, so you need to have at least a few cents on xDAI token.",
  "data/ph-top/2021/3/notion-student-pack.json": "All the tools, templates and dashboards you need to start organising your school life. 1 Student Hub, 3 Boards 10+ Tools 10+ Templates 40+ Curated Apps for Students",
  "data/ph-top/2021/3/flipp-for-clubhouse.json": "Highlight your Clubhouse event in social media. Paste the link of your event, and get a neat preview page you can share online.",
  "data/ph-top/2021/3/horae.json": "A time tracking app focused on life itself rather than projects, tasks, and more specific types. It helps to generalize a day and make it easier to document your life. It just takes 5 seconds to log your day. You don't have to remember each minute.",
  "data/ph-top/2021/3/hydesk.json": "With hydesk, we want to allow people to be more flexible within their workspace. You can use it while sitting to have the perfect viewing height for any screen or just standing up to boost your creativity and well-being.",
  "data/ph-top/2021/3/cleancart.json": "Protect your ecommerce margins & increase average order value by blocking unwanted discount codes from coupon extensions like Honey, CapitalOne Shopping, Piggy, and more. Currently available for Shopify Plus users. Not Shopify Plus? Get on the wait list.",
  "data/ph-top/2021/3/gladys-assistant-v4.json": "Gladys Assistant is an open-source home automation software. It's easy to install on a Raspberry Pi, a NAS, or any machine running Linux.",
  "data/ph-top/2021/3/invoid.json": "Looking to get genuine users on-board with minimum drop offs? Our offer includes identity verifications (KYC) for automating individual on-boarding and enhancing customer experience. We envision creating a trusted ecosystem where identity is the key to access.",
  "data/ph-top/2021/3/kalendar-ai.json": "Kalendar AI sends personalized and exclusive invitations (GPT3) to your ideal customer profiles with time-sensitive bidding on your availability.",
  "data/ph-top/2021/3/product-lessons.json": "https://productlessons.xyz/ covers real examples and stories of career strategy, interview prep, analytics &&nbsp;more. Level up in 5 minutes a week. Join 5000+ happy readers for free!",
  "data/ph-top/2021/3/click2contact.json": "Click2Contact helps visitors connect with sellers with a single tap connecting with customer where they connect. [Giveaway 🎉] Comment how it can help your bussiness & get a 50% off just comment and send screenshot to sanskar@click2contact.app.",
  "data/ph-top/2021/3/premast-plus-2-0.json": "Premast Plus helps 10k users design presentations using PowerPoint and now we are looking forward to enabling them & more people to manage, share and create branded content with our new stunning features. A plugin and web app that gives you the ultimate access",
  "data/ph-top/2021/3/burnrate-fyi.json": "https://burnrate.fyi is a SaaS expense estimator designed with ease-of-use in mind. In three easy steps you can choose the products or services you want, configure them, and see your expected burnrate at the end of each month.",
  "data/ph-top/2021/3/stockdock.json": "Live stock prices right in your macOS Dock. Updates every minute. Start with: AAPL, AMC, AMZN, FB, GC=F, GME, GOOG, NKE, MSFT, NFLIX, TSLA, TWTR, more coming soon",
  "data/ph-top/2021/3/charge-running.json": "Charge Running is a mobile app that provides live running classes with others from all over the world! Trainers will update you on your stats and interact with you and your fellow runners in our real-time chat room.",
  "data/ph-top/2021/3/worth-it.json": "If thinking about money gives you a headache, you're in the right place. Worth it is here to make it as simple as possible, simply list your assets balances (💰, 🚗, 🏠,.) and update it at your own pace. Download it for iOS and Android today!",
  "data/ph-top/2021/3/ponder-6.json": "Ponder guides you through daily journaling right from your new tab. With self-reflective prompts, fast keyboard shortcuts, aesthetic backgrounds, and privately-stored entries, you can just focus on writing — Ponder takes care of the rest.",
  "data/ph-top/2021/3/carta-safe-calculator.json": "Early stage fundraising is hard. Understanding any long-term repercussions make it easier. ⠀ Introducing the Carta SAFE Calculator. ⠀ In just a few clicks you can: -Calculate your future dilution -Compare the impact of pre vs. post money SAFEs",
  "data/ph-top/2021/3/the-funnies.json": "This newsletter is made with serious love. I've selected and partnered with some of the funniest indie comic artists in the world. This daily newsletter will put a smile on your face.",
  "data/ph-top/2021/3/post-3.json": "Post.co is the best way to share big and small news across your team. Designed as a substitute for messy threads and awkward reply-all team emails, Post is a simple, low-stakes way to share team-wide updates. Great for remote teams to stay connected.",
  "data/ph-top/2021/3/clubrooms.json": "Clubhouse Clone code built on React Native with Backend and Custom Microservices Architecture for Audio Conference which is Capable of Creating Truly Huge Rooms for Thousands of Listeners",
  "data/ph-top/2021/3/tweet-ideas.json": "Generate high quality tweets for the lazy weekends when you're out of tweet ideas. Jokes, Quotes, shower thoughts, facts and LPTs, all for free🔥 Comes with inbuilt button to fire up a canva canvas and tweet beautiful graphics fast! Enjoy!",
  "data/ph-top/2021/3/daily-9.json": "Daily makes it easy to build real-time audio apps. We're a developer platform for audio and video APIs. Check out our Starter Kit with sample code for React, Android, ReactNative, and iOS. You can build audio fast, and scale with our secure infrastructure.",
  "data/ph-top/2021/3/version-story.json": "Do you find yourself digging through email threads trying to find the version of a contract in which a specific change was introduced? Who proposed the change? Was it your lawyer, or your customer? If this pain is familiar, Version Story is here to help.",
  "data/ph-top/2021/3/1-800-d2c.json": "A playful, yellow page themed directory of brands that shows you which tools brands are using.",
  "data/ph-top/2021/3/typingdna-verify.json": "Want to replace annoying SMS 2FA codes? We verify your users by the way they type 4 words. This improves UX significantly and reduces costs by an order of magnitude. Btw: you can get the solution free of charge for a limited time. Check the website for more.",
  "data/ph-top/2021/3/printables.json": "Start creating your app with clean mind and clear representing of screen structure. There are 12 device mockups in the pack, for both iPhone and Android. Carefully created A4 format templates that perfectly repeat the real device sizes. PNG, JPG, PDF formats.",
  "data/ph-top/2021/3/opportunities-so.json": "Trend brainstorms, deep dives into different ecosystem (including case studies and gaps in the market analyses), expert interviews, and niche market data to help founders and investors spot opportunities.",
  "data/ph-top/2021/3/dola-beta.json": "Dola is a 1-click checkout and digital wallet. Unlike Apple, Google, or Shop Pay, Dola works on every browser and device, and is platform agnostic.",
  "data/ph-top/2021/3/idenati.json": "Idenati is designed to simplify your experience, to organize everything you do online in one place, allowing you to focus and be more productive.",
  "data/ph-top/2021/3/crown-3.json": "The Crown guides you into a focused state and helps you stay there. It aligns your brainwaves in the right patterns for your optimal flow. Discover the songs that expedite your flow and help you find the zone using the Neurosity app with your Spotify account.",
  "data/ph-top/2021/3/ai-cover-letter.json": "The fastest way to make a tailored cover letter. Create a resume, target a job description, and instantly generate a matching cover letter.",
  "data/ph-top/2021/3/marketplan-image-video-collaboration.json": "MarketPlan's new Video & Image Collaboration feature allows you and your marketing team or clients to upload, collaborate, comment, on your marketing assets with a simple click and drag. We also have a https://marketplan.io/?ref=producthunt&utm_source=Product%20Hunt&utm_campaign=Product%20Hunt%20Image%20Video%20Collaboration%20Launch&utm_medium=Post&utm_content=Post%20Description%20Link on our website this week!",
  "data/ph-top/2021/3/poopail.json": "Being the first 2-in-1 system for managing dog poop, PooPail makes life easier by scooping waste directly into the pail, then conveniently storing it for up to a week within its compostable and biodegradable bags.",
  "data/ph-top/2021/3/stories-now.json": "Read RSS news as instagram stories! Discover the new way of reading news. This app uses many techniques to generate stories from feeds that don't support natively stories. It works with all yours feeds! Don't waste time for boring news apps.",
  "data/ph-top/2021/3/showtime-4.json": "Showtime is a social network for crypto art #NFT: - Discover trending art from Zora, Foundation, Superrare, NiftyGateway, Opensea & more - Explore, like, comment & share crypto art - Sign in with wallet or email to curate your profile and show off your art!",
  "data/ph-top/2021/3/salad-29dfec14-a948-4172-8b62-7fe54838c399.json": "Salad is the easiest, most-trusted way to profit from your PC. Our users (or “Chefs”) turn a wealth of idle compute resources into epic loot—including Steam games, digital subscriptions, in-game loot, gift cards, and more.",
  "data/ph-top/2021/3/z1.json": "💸 Z1 is a digital bank for teenagers in LatAm, where they can spend and receive money through a prepaid Mastercard credit card. Z1 gives teenagers autonomy and teaches them financial literacy from their first contact with money all throughout their adulthood✨",
  "data/ph-top/2021/3/hyper-online.json": "Hyper is an animoji voice chat app for gamers & anime fans. Meet people and voice chat, without the anxiety of revealing your real face. We give you tools to draw, voice chat, and more. The more time you spend, the more coins you earn for new characters.",
  "data/ph-top/2021/3/crove.json": "With Crove app you can create your repetitive business documents as intelligent templates that use variables and logical conditions.",
  "data/ph-top/2021/3/lunarcrush.json": "Without Community, There Is No Crypto. LunarCRUSH is a social listening platform for cryptocurrencies and helps investors make better decisions by tracking the community each cryptocurrency is building through beautiful dashboards and real-time data analysis.",
  "data/ph-top/2021/3/waiver.json": "Your same bank account, but without the annoying fees. Enjoy fee-free banking with your current account, no need to switch banks or open new accounts. Waiver blocks overdraft, maintenance and late credit card fees.",
  "data/ph-top/2021/3/clockk-2-0.json": "Clockk is a FREE AI-powered time tracking tool for digital agencies and freelancers. See what you worked on, when, by project. No more time sheet pain! Perfect for software devs, graphic designers, digital marketers, and anyone else who bills time. 🔥💰🚀",
  "data/ph-top/2021/3/the-netly-domains.json": "Getting the perfect name for your startup is obviously important. In fact, it's the first thing people notice when visiting our brand. But... it's a pain to find a great name/domain that's available. Now, it's time to forget that pain because we're here to help you.",
  "data/ph-top/2021/3/1-million-under-1-million.json": "Forget 40 under 40! Introducing 1,000,000 under 1,000,000 - a social experiment / parody. The hopes and dreams of up to a million non-millionaires, randomly ranked. Will you make the list?",
  "data/ph-top/2021/3/tasterbox.json": "Tasterboxes are packed full of nutritious new treats straight from our favorite startups. Are your tastebuds ready to discover their next favorite foods? Each box is curated for your dietary needs. Vegan? GF, low carb? No problem. Find your perfect https://tastermonial.com/pages/tasterbox-quiz",
  "data/ph-top/2021/3/remote-hill.json": "Have you ever wanted to search for a remote job without getting tracked, being forced to sign in, having your resume crawled, or experiencing \"location bias\"? Ever felt like your job search has been at the expense of your privacy? We have. And we're fixing it.",
  "data/ph-top/2021/3/vtiger-pilot.json": "Vtiger Cloud CRM now has a Forever Free edition for all those who sign up in 2021. Pilot Edition is a part of the Vtiger Re: boot program, and this is built to help companies to accelerate their growth and recovery coming out of the pandemic.",
  "data/ph-top/2021/3/potty-whiz.json": "The potty training app for kids and parents. Turn your child into a potty trained whiz in no time! Encourage your child, keep track of activities and make potty training a fun interactive process.",
  "data/ph-top/2021/3/omniquotient.json": "omniquotient is an assessment tool that helps you learn if you are using the tech community's recommended practices in programming, and if not, it shows you how you can improve the way you code.",
  "data/ph-top/2021/3/tuti.json": "Tuti.study is a webapp that helps teachers and students to improve the way they learn online. You can create beautiful annonated presentations, create, save, share your online flashcards with students, friends and colleagues by sharing a link.",
  "data/ph-top/2021/3/clipboard-pro.json": "Can’t remember where you saved your Bank Account Number? Need quick access to your CV or the digital copy of your Passport? That’s why we created Clipboard PRO: the easiest way to find, copy and paste all your information with a tap!",
  "data/ph-top/2021/3/livecaller.json": "Lack of communication channels on websites results in customer churn, low satisfaction rate and minimal to zero customer success. LiveCaller solves those issues by offering all in one solution, that combines Web Call, Web Chat, Callback, Social Messaging Apps",
  "data/ph-top/2021/3/studyum-3d-icons.json": "Studyum is a pack of custom 3D icons suitable for any fintech product. Create stunning, unique projects with these hand crafted icons, easily editable in Figma, and fully customizable in Cinema 4D. 3D icons rock!",
  "data/ph-top/2021/3/no-bs-marketing-resources.json": "Every book, tool, blog, course ever mentioned by guests in the popular contrarian marketing podcast Everyone Hates Marketers.",
  "data/ph-top/2021/3/iconscout-desktop-app.json": "Over 2.2 million+ curated SVGs, Vector Icons, Illustrations, 3D graphics, and Lottie Animations. Over 3000+ assets added every day. Integrated plugins, tools, editors, and more.",
  "data/ph-top/2021/3/wteam.json": "Virtual workplace for remote & distributed teams — Team Presence, Fast Video Communication, Collaboration, Live Discussion & more.",
  "data/ph-top/2021/3/tellspin.json": "Stop interrupting with @channel! Usually anyone can answer so why do we keep distracting everyone? Tellspin makes it easy to create schedules / escalation policies for Slack. Share the load with your team members with built-in user groups/@mentions.",
  "data/ph-top/2021/3/convertmind.json": "Google Analytics meets intelligent algorithms: find hidden conversion opportunities in your Google Analytics data. A tool that analyzes your data and shows exactly how to improve your conversion rates. Offers audits and 24/7 monitoring of Google Analytics.",
  "data/ph-top/2021/3/anyword-2.json": "Built from the ground up for performance. A powerful AI engine for generating copy to drive conversions. Generate or improve your own ideas for ads, social posts, email subject lines and landing pages.",
  "data/ph-top/2021/3/saleswhale-email-ai-conversation-flow.json": "AI Conversation Flow is a powerful virtual email conversation builder to help marketing teams convert neglected leads into sales-ready hand-raisers.",
  "data/ph-top/2021/3/articled.json": "It's often difficult for most people to share their thoughts and over time it builds up in them, to let people have these thoughts free and release their burden we build this app. Here everyone can write freely without being getting judged by others.",
  "data/ph-top/2021/3/zoho-mail-bookmarks.json": "Zoho Mail Bookmarks is integrated with your Zoho Inbox and can be accessed from anywhere. With this plugin, you can easily save any URL/ link to your Zoho Mail Bookmarks for your personal reference or to share with your team.",
  "data/ph-top/2021/3/prefix-2.json": "Prefix helps your business get started with RPA without expensive implementation partners. Automate repetitive work on web and desktop apps that don't have API’s or clean software integrations, and save your team valuable time.",
  "data/ph-top/2021/3/copycat-a-i.json": "CopyCat is a DeepFake app for content creators. Users can create hilarious prank videos, viral social media content, celebrity lip syncs, and more with just the touch of a button!",
  "data/ph-top/2021/3/zealous.json": "Zealous lets any creator: - Create a home page for all their live activity - Build a mailing list of their true fans - Engage in realtime with fans via live rooms - Monetize through tips, tickets, and subscriptions Join our live Q&A! https://community.zealous.space/r/4ckvmy http://bit.ly/zealous-qa",
  "data/ph-top/2021/3/yesplz.json": "🧠 Smart, personalized product recommendations for Shopify stores--driven by real customer insights. 💥 Our AI algorithm is trained by millions of data points about what customers want, specifically for fashion products.",
  "data/ph-top/2021/3/spline-alpha.json": "🌈 Spline now adds 3D vector editing along with other great features like Post-Processing. This represents a paradigm shift for 2D design, and a step towards a 3D-first design tool.",
  "data/ph-top/2021/3/breakbot.json": "Booked solid every day and barely have time to get a coffee or even run to the restroom? Meet BreakBot. A free Google Calendar add-on that automatically adds breaks to your day when it knows you need one! Because that meeting could have been an email a break.",
  "data/ph-top/2021/3/textgen.json": "TextGen is a new service that allows you to train your own text generation ML models and then use them to generate text through a simple API with no AI knowledge required and at low price. You send us your text dataset, we train the model and serve it for you.",
  "data/ph-top/2021/3/terapify.json": "Terapify is a video chat platform that connects people who need psychological help with vetted psychotherapists who share their culture and language in an easy, secure and affordable way.",
  "data/ph-top/2021/3/hue-sentiment.json": "Hue Sentiment is an easy to use Philips Hue light app which translates text into a mood. Simply type how you're feeling and notice the lights change based on your mood.",
  "data/ph-top/2021/3/isowords.json": "isowords is an all new word search game for your phone. You can play solo, multiplayer, or compete in the daily challenge.",
  "data/ph-top/2021/3/sleegal.json": "Sleegal is an online marketplace that uses machine learning to match users with lawyers. We built this website free for all to use because we believe high-quality professional service should be made accessible to everyone, not just the elite.",
  "data/ph-top/2021/3/charmin-nftp.json": "Each roll comes with a physical display, so you can hang your NFTP in your bathroom alongside your IRL rolls. All proceeds will be donated to Direct Relief, to improve the lives of people impacted by poverty or emergency situations around the world.",
  "data/ph-top/2021/3/budgetwell.json": "Budgetwell is a personal budgeting tool that is designed to take into account all income, present and future, to help you manage your finances.",
  "data/ph-top/2021/3/haptik-smart-skills.json": "Explore 100+ ready-to-use Smart Skills with deep domain intelligence, crafted by Conversation Designers to help you build high-quality Intelligent Virtual Assistants for your business.",
  "data/ph-top/2021/3/q-ai-invest.json": "Q.ai Invest is a hands-free approach to investing. It doesn’t just pick stocks and ETFs. It manages your money with institutional-grade, AI-powered investment strategies – totally commission-free! Get started today with as little as $100 for only $10/month.",
  "data/ph-top/2021/3/all-video-downloader-2.json": "Video Downloader - Social Media is a better video downloader that allows you to save videos and images from Reposo, Snack Video, Sharechat, Likee, WhatsApp, WA Business, Facebook, Twitter and Instagram easily and quickly.",
  "data/ph-top/2021/3/weweb.json": "WeWeb is a no-code website builder that helps you build sites faster thanks to: - A professional editor built around collaboration - Data fetching from any backend/CMS (Airtable, Headless CMSes, REST API) - Importing custom components from GitHub (React / Vue)",
  "data/ph-top/2021/3/finary.json": "Finary is a beautiful portfolio tracker with built-in performance reports 💰 Track all your investments - stocks, crypto, startups.. 🌎 Integrations with 10.000+ banks & investment platforms worldwide 📈 Profit & loss analysis 👉 Give it a try!",
  "data/ph-top/2021/3/magicpattern-toolbox.json": "MagicPattern evolved into a visuals toolbox with 10+ tools. Create unique patterns, gradients, blobs & much more graphics with our 1-click generators. Almost 1 new tool is added every month 🤯",
  "data/ph-top/2021/3/instagram-scheduler.json": "Save time by creating, editing & scheduling your Instagram posts. Plan and schedule a full months worth of posts in under an hour. Free 7 day trial available.",
  "data/ph-top/2021/3/animated-icons-3.json": "Snap viewers out their doom scrolling with lively animated icons. With 3000+ easy-to-use graphics, you can build consistent apps, stores, and brands without the extra time or expense. - 20 popular styles - Tagged and searchable platform - Multiple formats",
  "data/ph-top/2021/3/chatbot-visual-builder.json": "A robust chatbot platform that lets you build, test and launch AI chatbots without coding and across multiple communication channels.",
  "data/ph-top/2021/3/cadoo.json": "Cadoo is the most intense way to reach your fitness goals. ⠀ Browse challenges, commit to a fitness goal, use a fitness tracker to track your progress. Winners get their money back + extra money from the challenge losers.",
  "data/ph-top/2021/3/vectorly-2-0.json": "Managing teams is a mess. Tons of files, emails to manage 1:1s, skills, reviews, personal growth, etc. With Vectorly you start with simple 1:1 meetings integrated with your workflow. And eventually grow as manager with tools and insights to deliver results.",
  "data/ph-top/2021/3/damjanski-app.json": "Take a picture and the app will automatically replace any face with my face.",
  "data/ph-top/2021/3/productflair.json": "Learn from the best of the best. Discover more than 194+ hand-curated Product Hunt launch examples categorized into images, product videos, thumbnails and first comments. Get ideas and inspiration for your next launch 🚀",
  "data/ph-top/2021/3/emojiz.json": "EMOJIZ is a fun animated 3D emojis set which will bring joy to your designs or products. Optimized for White & Dark UI. Just drag & drop to your favorite design tool.",
  "data/ph-top/2021/3/fancy-fonts-text-and-nickname-2.json": "Fancy Font is amazing tool which allows you to give a Fancy Look to your Smart Phone and app also facilitated you to create cool nickname for game too.",
  "data/ph-top/2021/3/vmaker-for-chrome.json": "Vmaker is an all-in-one video messaging tool encompassing a screen/webcam recorder, a player, and an in-built video editor. 📹 Vmaker provides the best-in-class Video Management System that gives a seamless experience with asset management. 📂",
  "data/ph-top/2021/3/10x-planner.json": "A daily battle plan that helps you define the right things that set yourself up for success. Schedules out every second of every day, gets your head right, gets you goal-oriented, and target-focused everyday. Web-app version of 10X Planner by Grant Cardone.",
  "data/ph-top/2021/3/viable-2.json": "Viable is a user experience analysis engine that aggregrates, sorts, and tags helpdesk, survey, and live chat customer feedback so you can ask questions about what your customers think, feel, and do -- and get human-like answers in seconds, powered by GPT-3.",
  "data/ph-top/2021/3/portal-10.json": "With Portal, let your clients login on your own website and give them one place for payments, messaging, file-sharing, eSignatures, intake forms, and more.",
  "data/ph-top/2021/3/bcpro-app-2.json": "BCPRO.APP is a free research-based online tool that uses genetic factors to analyze a person’s risk of developing a severe case of COVID–19. ⠀ We score your 23andMe, Ancestry, or MyHeritage raw data, and turn the insights into a report in less than 1 minute.",
  "data/ph-top/2021/3/sales-resource-collection.json": "Ready to hone your sales skills? For a limited time only, download our entire collection of sales resources—no cost, no email, no catch. Featuring exclusive content from CEOs, entrepreneurs, and sales pros, this is an absolute masterclass in all things sales.",
  "data/ph-top/2021/3/how-much-to-rank.json": "Calculate the estimated cost of a top 10 Google ranking for any search term. Just enter your target keyword and https://howmuchtorank.com/ will calculate the budget you need for a top 10 ranking and generate a list of SEO recommendations for how to get there.",
  "data/ph-top/2021/3/clubmarket.json": "The very first sponsorship marketplace for Clubhouse 👋 We're letting CH hosts monetize their content by partnering with global brands. Check out the earnings calculator on our website. Applications are open for early access ‍🎉",
  "data/ph-top/2021/3/money-minx.json": "Money Minx is net worth and investments tracking - ⚡️ Connect with over 23,000 institutions 📈 Stocks, bonds, ETFs, Alternatives and more 👾 Cryptos too 💹 Multi currency support (USD, EUR, GBP, JPY,..) 😉 Compare to other investors 🎟 Investing community",
  "data/ph-top/2021/3/nozomi-2.json": "The simplest and most modern data-scraper as a service, as if postman was automated! Focus on developing data-dependant apps without worrying about the data gathering infrastructure. Made for aggregators, bots and data-driven applications.",
  "data/ph-top/2021/3/zoom-escaper.json": "Zoom Escaper is a tool to help you escape Zoom meetings and other videoconferencing scenarios. It allows you to self-sabotage your audio stream, making your presence unbearable to others. Made by: https://twitter.com/sam_lavigne",
  "data/ph-top/2021/3/yatta-analytics.json": "yatta! is the best way to get aware your audience's habits on Twitter. Find what time of the day your tweets get more attention.",
  "data/ph-top/2021/3/best10.json": "Best10 offers unrivalled daily support at your fingertips and in the comfort of your own home. Receive daily checkins with your certified coach, a 100% personalised workout and eating plan, complete with shopping lists and recipes.",
  "data/ph-top/2021/3/ubacast.json": "Ubacast helps creators host, securely stream videos and get paid through: - video channel donations, - video support donations, - video pay per view. Not all creators can earn a living from Ads on YouTube. Think of Ubacast as a Patreon for video creators.",
  "data/ph-top/2021/3/augmented-reality-2021.json": "What is possible with AR? We don't even know yet. But innovative and creative people are already developing interesting apps and solutions using augmented reality. Check out our AR collection.",
  "data/ph-top/2021/3/openreel.json": "OpenReel empowers distributed enterprise, media, entertainment, and agency teams to remotely control, direct, script, film, and collaborate on high definition video projects from a mobile device or webcam in over 125 countries",
  "data/ph-top/2021/3/awesome-viewer.json": "The Awesome lists on GitHub are great, but it's hard to know which projects are actively maintained and sift through them all easily. I built this tool to help me visualize and query all of the cool resources people put together.",
  "data/ph-top/2021/3/tailscale.json": "Tailscale is a zero config VPN for building secure networks. Install on any device in minutes. Remote access from any network or physical location. Built on WireGuard®.",
  "data/ph-top/2021/3/papercups-eu.json": "Papercups EU is an open source live customer chat tool that is hosted in the EU for GDPR compliance purposes. We provide React/React Native/Flutter/HTML chat components for a ton of flexibility and customizability.",
  "data/ph-top/2021/3/guardians.json": "Guardians is a personal safety app designed to be used with your close family & trusted friends. It starts with location sharing but it’s lot more than that.",
  "data/ph-top/2021/3/kintell.json": "Kintell is a platform that connects people looking for advice with those qualified to give it, via paid and Pro Bono video consultations. Browse for an Advisor, book in a session, and speak to them via the Kintell video platform.",
  "data/ph-top/2021/3/saas-positioning-worksheet.json": "SaaS Competition is increasing rapidly. The more competition a company faces, the harder it is to get clients. If you don’t have strong positioning on the market, use this worksheet to create unique positioning. The Worksheet is FREE until 25th March.",
  "data/ph-top/2021/3/utc-time.json": "The app shows the UTC time in the menu bar or a Notification Center widget. This can be useful as a quick reference. You can also quickly copy the date & time in ISO8601 format. The app is free and requires macOS 11.1.",
  "data/ph-top/2021/3/ilinkpro.json": "iLinkPro gives you the creative agency to take your links and brand to the next level. We have custom domains and branding, SEO, analytics, music/video embeds, QR codes, and MORE! You only get one first impression, so make it count!",
  "data/ph-top/2021/3/flat-habits.json": "A habit tracker for both minimalists and power users (org mode fans). No social. No analytics. No account. No cloud. No lock-in.",
  "data/ph-top/2021/3/prize.json": "Prize Card™ is a debit card that lets you win money and rewards instantly every time you use it. When you pay using Prize Card™ the merchant (i.e. the store) pays us a small transaction fee which we use to fund giveaways.",
  "data/ph-top/2021/3/tailwind-ui-kit.json": "⭐ Tailwind UI Kit is a one-of-a-kind collection of 600+ ready-to-drop-in components, and 30 templates with react, angular, and vue support.",
  "data/ph-top/2021/3/contora.json": "Make smarter trades by getting real-time alerts from Contora that are triggered by data from unusual sources — such as Reddit mentions, recent company jobs postings and firings, viral posts on social media, and much more.",
  "data/ph-top/2021/3/blobs-2-0.json": "Generate blob shapes: - Set Solid color - Set Gradient colors - Set a pattern background - Custom image clipping - Save and manage blobs locally - Sharable URL - Dark mode - Works offline and PWA support - Faster initial load and better performance - Blob change sound",
  "data/ph-top/2021/3/zealth.json": "Zealth is building a software to help hospitals provide continuous round the clock monitoring to their cancer patients, once they leave the hospital and alerts them if the patient is at high risk.",
  "data/ph-top/2021/3/splitsub.json": "Splitsub is a group buying app for online consumer subscriptions in India. Users share more than 25 different types of subscriptions ranging from streaming services to productivity softwares",
  "data/ph-top/2021/3/vinyls.json": "Vinyls is a beautiful music player built with iOS design guidelines in mind. There are no complicated user accounts or settings to configure. You can start listening to your music right away. You can scrub to seek, watch the tone arm follow the playback time.",
  "data/ph-top/2021/3/mobilo-wood.json": "Mobilo Wood Card resembles the ecological aspirations of our brand. With this brand new, one-of-its-kind, NFC-powered, smart business card, we want to provide an opportunity for companies to truly distance themselves from paper waste.",
  "data/ph-top/2021/3/dough-flow-club.json": "This is an on demand financial services marketplace. You can immediately connect with Finance, Accounting and Investing professionals. If you are a finance/accounting professional, you can connect with clients easily. Product Link: Doughflowclub.com",
  "data/ph-top/2021/3/minipoll-2.json": "Create simple shareable polls in seconds. Share your polls across all of your channels - newsletter, group text, Twitter, etc. No sign up required.",
  "data/ph-top/2021/3/genei-chrome-extension.json": "genei is an AI-powered productivity tool that now enables users to automatically summarise webpages or PDFs as they browse.",
  "data/ph-top/2021/3/avatar-maker-2.json": "Collect your avatar from different parts. The code of this program is very easy, any developer will be able to understand the code. SVG is used to draw an avatar. Demo version of the project: https://avatar-maker-vue.netlify.app/",
  "data/ph-top/2021/3/prisma-live.json": "Most live video products are built for an adult-first corporate world not for kids and learning. Prisma LIVE is a new, fun and engaging way for kids to learn and collaborate together virtually.",
  "data/ph-top/2021/3/shopify-technology-landscape.json": "Here's a well curated list of 168 tech and industry providers for Shopify merchants, from all major categories, including SMS Marketing, Customer Service, Analytics, Financial tools, and much, much more. Steal the JPG here or click link for HQ PDF version.",
  "data/ph-top/2021/3/mindf.json": "Meditation apps are great but they don’t address real world events and situations. I curse. You curse. Why shouldn’t your meditations? We recorded some oddly specific meditations for your peace of mind. Presenting MindF*** from the makers at Bad Unicorn 🦄",
  "data/ph-top/2021/3/moonshot-library.json": "Moonshot Library is a curated collection of resources to grow, execute, and lead in a zero-to-one startup.",
  "data/ph-top/2021/3/shar-ec.json": "Shar.ec is designed to let you share end-to-end encrypted screen recordings easily.",
  "data/ph-top/2021/3/youtube-shorts.json": "YouTube Shorts is a short-form video experience for anyone who wants to create short, catchy videos with nothing but their mobile phone. We’ve worked alongside music partners to make sure artists and creators have a library of songs to use in their Shorts.",
  "data/ph-top/2021/3/eqtble.json": "Eqtble unlocks the value of your HR data by answering why top performers are leaving and why qualified candidates are declining offers. Built by connecting with 150+ systems, we deliver insights on Workforce, Talent Acquisition, Engagement, and Compensation.",
  "data/ph-top/2021/3/clay-5.json": "Pulls structured data from any website as easily as copy paste. Whether lists of people and companies from directories, search engines or any website, Clay already understands the web and automatically fills them in a spreadsheet for you. -Automated CRM-",
  "data/ph-top/2021/3/landing-letter.json": "Get an insightful landing page teardown every week which focuses on copywriting, user flow and placement of elements which helps you build better landing pages.",
  "data/ph-top/2021/3/questbook.json": "Teach without videos and zoom sessions. We enable best minds to share their knowledge in minutes. Average time to launch a course is 2 months. Launch your course under 2 minutes with Questbook. What Twitter has done to blogging, Questbook does to learning.",
  "data/ph-top/2021/3/notion-planners.json": "Plan your day, week and month in Notion.",
  "data/ph-top/2021/3/banners.json": "Collection of 90 banners for websites and landing pages. Change the whole text by simple editing just with the master component to check how it works. Compatible with Figma.",
  "data/ph-top/2021/3/100-colorful-holographic-shapes.json": "This collection is a set of eye-catching vivid holographic gradients that will be a perfect fit to apply onto your web design, logos, any printed designs (business cards, posters, flyers, etc), or social media posts such as Instagram, Twitter, Facebook, etc.",
  "data/ph-top/2021/3/better-year-app.json": "A new iOS and iPadOS with personal advice, goal tracking, meditation scenes, daily motivation and more.",
  "data/ph-top/2021/3/forky.json": "Forky is a mind-mapping tool that is distraction free, with a minimal feature set. • colorful bubble and line diagrams • real-time collaboration • easy and quick to use • no distractions Web app in beta. Mobile coming soon!",
  "data/ph-top/2021/3/10-000-com-domains.json": "Never ever pay for a premium domain ever again. ⠀ Don't buy a mediocre domain extension likenet orio. ⠀ Choose from a list of ever-so valuablecom domains and get them anywhere for just $10 each. ⠀ The entire list of 10000 domains for just $30 only!",
  "data/ph-top/2021/3/sonos-roam.json": "Sonos’s smartest and most versatile speaker sounds incredible for its size, is effortless to set up and control, and packs new innovation into a premium, lightweight, and durable design.",
  "data/ph-top/2021/3/first-1000.json": "📈 How do top startups find their early customers? Find out on First 1000. We share a case study every week about how companies like Zapier, Doordash and Tinder got their very first customers.",
  "data/ph-top/2021/3/happy-things.json": "Happy Things is here to help you live a happier life! With hundreds of small, diverse daily activities, the mobile app guides and motivates you to do one thing each day to boost your happiness.",
  "data/ph-top/2021/3/wehatepasswords-2-0.json": "WeHatePasswords is a Google Chrome extension that replaces all password fields with easy to remember pixel art. Gone are the days of remembering complicated passwords. Simply draw to log in. Compatible with password managers.",
  "data/ph-top/2021/3/spotfindr-2-0.json": "enjoy flying drones with spotfindr 🔎 find amazing spots all over the world 🚦 get drone regulations for every spot ☁️ live weather data for every spot 📍 get drone regulations for your current location",
  "data/ph-top/2021/3/foont.json": "A very simple font game for designers. Inspired by https://cantunsee.space/ 🐛 This is the beta version. Any suggestions are welcome like bugs, feedback, domain name, etc.",
  "data/ph-top/2021/3/vibe-city-fm.json": "Enter Vibe City and cruise through a regularly updated selection of chill music ✌🏼 -- Website: https://www.vibecity.fm",
  "data/ph-top/2021/3/whiteboard-q-a-and-polls-for-clubhouse.json": "Brightful LIVE for Clubhouse is a collection of essential features that help your Clubhouse rooms standout amongst the rest. Visualize your ideas by drawing on the Whiteboard, while engaging listeners with Q&As and Polls.",
  "data/ph-top/2021/3/customize-video-by-type-studio.json": "Get more attention to your videos by adding headlines, captions, and call-to-action and increase your interaction on social media. Also, turn your video meetings into highlights – everything online in your browser.",
  "data/ph-top/2021/3/community-weekly.json": "Community Weekly is a newsletter for creators that are seeking to make their content profitable. We offer our subscribers resources and playbooks to help them go from 0 to HERO.",
  "data/ph-top/2021/3/instatext.json": "InstaText is a user-friendly writing and editing tool that helps you improve your text so that you are understood and perceived as a professional. InstaText improves styling and word choice, corrects grammatical errors and enriches your content.",
  "data/ph-top/2021/3/bedrock-5.json": "Jumpstart your next SaaS product with Bedrock: the modern full-stack Next.js & GraphQL boilerplate with user authentication, subscription payments, teams, invitations, emails and everything else you need",
  "data/ph-top/2021/3/purme-air.json": "purME Air is a powered mask that makes breathing safer and easier. Breathe only filtered air supplied by twin turbines. Block out 99.5% of microorganisms with FFP1, N95 and P100 filters. Sterilize your mask in under 5 minutes with a built-in UV-C unit.",
  "data/ph-top/2021/3/keyword-surfer-3-0.json": "Keyword Surfer Chrome extension is now a comprehensive tool that helps you research the best keywords and write content without leaving Google. 70+ languages covered. On-page SEO data. NLP-powered content guidelines. All that 100% free, forever. 🏄‍♂️",
  "data/ph-top/2021/3/tabextend.json": "tabExtend helps you manage your tabs. The browser extension replaces your new tab with an overview where you can create groups containing your tabs, notes, and text-snippets. Visually organize it all with ease using drag and drop and handy shortcuts.",
  "data/ph-top/2021/3/social-web-suite.json": "Social Web Suite is a powerful, easy to use, efficient, and intelligent social media management tool that helps small business owners, bloggers, social media managers, agencies, and enterprises save time, increase productivity, and get better business results.",
  "data/ph-top/2021/3/one-goal.json": "I am a forgetful person. Many times after I open my MacBook and scan some news, I totally forget what I initially try to accomplish. I want to build a simple tool to display my current goal on the menu bar",
  "data/ph-top/2021/3/good-garms.json": "Buy less, by knowing more. Discover great quality clothes that don’t sacrifice the environment or the people that made them. Putting sustainable brands front and centre. ✅ Find clothes made by brands that care ✅ Read honest reviews from people, not brands ✅ Make more informed purchases",
  "data/ph-top/2021/3/letterflix.json": "Send Letters Online! 💌 1. Write your letter ✍️, enter the receiver's address 📮 & pay $. 2. Letterflix's automated PrintCenter will print 🖨, package 📨, and ship 🚀. 3. Your loved ones will receive it within 7 days 🥳 🤩 or 10-15 days in another country 🌏.",
  "data/ph-top/2021/3/steady-newsletters.json": "Steady Newsletters is for independent writers, who are looking for a home for their work and are not averse to making money from it. Send professionally designed newsletters, including videos, podcasts, and tweets. Free to use, we keep 10% commission.",
  "data/ph-top/2021/3/firework-2-2.json": "Use your web apps as true apps with Firework! 🚀 Turn your everyday websites into desktop apps 🕹 Keep them on hand on the Taskbar or Dock 🏁 The apps launch instantly and are immediately ready to use 🎭 Switch between your web apps using familiar methods",
  "data/ph-top/2021/3/sonar-network.json": "Sonar.Network provides automatic daily website analysis. Analysis of more than 50 SEO errors, checking all website pages for CSS, JS, HTML validation. Payment for each site separately, the limit of 50,000 pages per site, daily checks, notifications.",
  "data/ph-top/2021/3/firecrown.json": "Firecrown allows app developers to build Flutter widgets visually. Our code generator provides clean and maintainable Flutter code, which can easily be customized and integrated in your IDE.",
  "data/ph-top/2021/3/dive-2.json": "Dive is a platform where you can match with people from all over the world to get work done, increase sense of responsibility and motivation.",
  "data/ph-top/2021/3/leadsie-connect.json": "Leadsie helps marketing freelancers & agencies get access to their clients’ Facebook assets & Google Analytics without hassle. ✅ Impress your clients with how fast you can start delivering them value. And stop wasting time getting access. 💪",
  "data/ph-top/2021/3/snaptrude.json": "Snaptrude is a next-gen 3D design tool for the construction industry. It helps Architects design efficient & sustainable buildings 10x faster on the web. It saves weeks’ worth of efforts as compared to legacy tools owing to its automation & data powered core.",
  "data/ph-top/2021/3/grid-9.json": "GRID is a productivity tool that transforms spreadsheets into interactive, visually dynamic web documents. GRID makes sharing and presenting spreadsheet data and models smart, quick, and exceptionally valuable.",
  "data/ph-top/2021/3/neo-sms-keywords.json": "You asked for it, we built it! Neo is back with SMS keywords to help you customize marketing, sales & customer support and become the most authentic brand on the market! Join us if you're exhausted from spammy marketing and just want to spread good vibes :)",
  "data/ph-top/2021/3/web-scraper-api.json": "This API enables you to scrape any data from any website, without worrying about proxies, CAPTCHAs, headless browsers and many other complexities involved in web scraping. We make sure you never get blocked again!",
  "data/ph-top/2021/3/riveo.json": "📹🔥💦 ✨ A new kind of video fx composer. With live previews, motion particles, smoother slo-mos and everything else.",
  "data/ph-top/2021/3/block-zen.json": "Blockchain and Crypto products are submitted and voted upon by the Block Zen community every day (just like Product Hunt). Block Zen helps you can track the daily innovations taking place in this space.",
  "data/ph-top/2021/3/hunter-author-finder.json": "Hunter Author Finder is a new way to find targeted email addresses of bloggers and journalists. Enter an article URL and get the contact information of the author in seconds.",
  "data/ph-top/2021/3/sleepedy-3.json": "Sleepedy provides personalized sleep therapy by connecting you with a sleep coach and automatically tracking your sleep with wearables like the Apple Watch and Oura Ring. If you don't have one, we'll lend you an Apple Watch.",
  "data/ph-top/2021/3/55-animated-adventure-illustrations.json": "A pack of 55 High-quality Illustrations & Animations. Simply drag and drop these illustrations & animations to supercharge your project in seconds! We've created illustrations for e-commerce, marketing, SaaS and Education. I've included an exclusive 50% OFF.",
  "data/ph-top/2021/3/kanbantab.json": "KanbanTab is the ideal default tab to help you efficiently organize tasks and build the momentum to get things done! This tool is completely free with no ads and requires no registration.",
  "data/ph-top/2021/3/pictalio.json": "Pictalio lets you download and share authentic Stories for free 😎",
  "data/ph-top/2021/3/haminet-fm.json": "Listen to music with friends while you work. Soundcloud and Youtube supported.",
  "data/ph-top/2021/3/distributed-2.json": "Distributed is a new live social chat app to help remote teams stay in sync. It started off as a jamstack demo but after spending 2-3 hours on it every day we realised it filled a huge hole in our work life as we all went remote.",
  "data/ph-top/2021/3/bambuser.json": "Bambuser’s Live Video Shopping technology drives customer engagement and sales for some of the world’s largest brands and retailers. Bambuser is now the platform of choice for companies seeking deeper connection with customers across digital platforms.",
  "data/ph-top/2021/3/otpfy.json": "Engineering time is valuable, and securing your application flows can be challenging and time consuming. With OTPfy you can secure any part of your application with ease without wasting any more time and resources.",
  "data/ph-top/2021/3/spaceman-2.json": "Spaceman is an application for macOS that allows you to view your Spaces in the menu bar. Spaceman allows you to see which space you are currently on relative to the other spaces you have. Naming these spaces is also an option.",
  "data/ph-top/2021/3/etch-e-sign-free.json": "Collecting binding e-signatures is a hassle. Etch e-sign free simplifies this process to three easy steps: upload a PDF, choose up to two signers, and send a signature request for free. Signers can review and sign documents from anywhere on any device.",
  "data/ph-top/2021/3/email-growth-playbook.json": "Implementing a great email program is the most effective way to grow your business. Discover 60+ growth tactics to increase your email ROI based on the strategic goals you want to achieve, such as: improving deliverability, increasing open rates, and more.",
  "data/ph-top/2021/3/get-callers.json": "We are a company that helps entrepreneurs and SMEs outsource their work. Visit www.GetCallers.com to find out how businesses can leverage our agents for as low as $5/hour to generate leads for them, set appointments, remote admin tasks, and much more.",
  "data/ph-top/2021/3/bitclout.json": "Bitclout is a social network built on a blockchain where all users have a creator's coin and where everyone can buy and sell those coins using bitclout crypto-currency",
  "data/ph-top/2021/3/speeko.json": "Think of Speeko like a gym membership for your voice. Get instant feedback on your speaking style, and track your progress over time. Personalized activities help you build new skills in just 5 minutes a day. You'll be speaking with confidence in no time!",
  "data/ph-top/2021/3/slideshare.json": "Don't keep your audience waiting for a follow-up email! Sharing slides or resources has never been easier. Upload your content, add your custom QR code to any presentation and streamline sharing. ****Currently free for all early access users****",
  "data/ph-top/2021/3/uranus-v1-2.json": "Uranus - Wireframe Kit is a Premium wireframing pack with more than 140+ dark/light ready-to-use web elements/sections. The basement idea of this kit was started from the wireframing time problem! 🔥 Will be available in Sketch, Adobe Xd & Code format soon.",
  "data/ph-top/2021/3/porter-4.json": "Porter is a platform that makes AWS/GCP as easy to use as Heroku. With instant deploys from Git, built-in autoscaling, and automatic SSL, Porter gives you the convenience of a PaaS while preserving flexibility and control.",
  "data/ph-top/2021/3/rita-personal-data.json": "The data management App that gives users ownership and control of their data - Collect your data from multiple platforms - View your data in an intuitive dashboard - Choose who can access your data and who can't",
  "data/ph-top/2021/3/ad-library-by-mobileaction-3.json": "The mobile intelligence platform trusted by 300K+ apps is launching the latest feature, Ad Library! ⠀ You can discover ad strategies of mobile apps here! Type in any app and start your journey on adlibrary.mobileaction.co 🚀",
  "data/ph-top/2021/3/coupler-io-2.json": "Coupler.io synchronizes data between Airtable, Clockify, Shopify, Trello, etc., and Google Sheets allowing you to bring data into a single place and customize your reporting. Try Coupler.io Free-forever plan now and auto-import up to 50K rows per month!",
  "data/ph-top/2021/3/walling-templates.json": "Discover the power of Walling and kickstart your next project with the new Walling templates. No complex workflows. No wasted hours setting up random templates that don't work. With Walling, it is simple, just put it on a wall! Start a new wall: https://wall.new",
  "data/ph-top/2021/3/nocode-tutorials.json": "WeLoveNoCode tutorials is a free database of NoCode lessons for such tools as Bubble, Webflow, Zapier and hundreds more! Add your own tutorial and get a $300 promo code for Adalo - the most popular NoCode tools for building mobile apps",
  "data/ph-top/2021/3/free-nocode-tutorials.json": "WeLoveNoCode tutorials is a free database of NoCode lessons for such tools as Bubble, Webflow, Zapier and hundreds more! Add your own tutorial and get a $300 promo code for Adalo - the most popular NoCode tools for building mobile apps",
  "data/ph-top/2021/3/serenity-notes.json": "Compose private notes, optionally share them with others and still stay in control of who can access your data. All while having an excellent offline-first experience on all platforms.",
  "data/ph-top/2021/3/moneymade-2.json": "Invest in Alternative assets like crypto, collectibles, real estate, and more? No more silly spreadsheets to track your Alt investments. Connect your Alt accounts to track your portfolio's performance. Also, discover over 150 new investments on MoneyMade!",
  "data/ph-top/2021/3/palette-ee408ab1-d7da-4935-a131-7fcf1ba6b022.json": "With Palette you can add colors to your palette and click to copy the HEX when you need a color.",
  "data/ph-top/2021/3/ui-feedback.json": "The UI Coach anonymous feedback platform allows UI/UX designers to post their work and receive feedback and critiques from other designers from all around the world. UI Coach helps you create better designs and grow your skills by allowing you to get the feedback you need when you need it most.",
  "data/ph-top/2021/3/stormly-2-0.json": "How would you like to solve all the mysteries of your data in just seconds? Simply pick an AI-based Template and voila -- instant discoveries in front of you. Combine different Templates to look at your data from unlimited angles!",
  "data/ph-top/2021/3/techintern-io.json": "Startups: Hire a talented developer in a contractor type role Larger Companies: Start an internship program to increase your recruiting pipeline VCs: Connect your portfolio companies with top student talent",
  "data/ph-top/2021/3/cryptopulsed.json": "Cryptopulsed is a community curated directory of the best crypto resources, tools and services available. Find new effortlessly & upvote the ones you like already.",
  "data/ph-top/2021/3/campah.json": "Campah is the easiest way to tie all your content together. Simply claim a URL, set up your link cards, and share your link! You'll have a live page in a minute.",
  "data/ph-top/2021/3/tinydo.json": "Focus on one important task today. You decide what to focus on. After you set today's task you can't change or delete it. Keep a streak of days you finished your daily task.",
  "data/ph-top/2021/3/slack-connect-direct-messages.json": "Slack Connect allows you to send direct messages to people outside your company, simplifying the way you work with partners. Use this feature to seamlessly schedule meetings, sign documents and quickly collaborate on important tasks without ever leaving Slack.",
  "data/ph-top/2021/3/wordpress-dark-mode-plugin.json": "Night Eye WP dark mode plugin is a powerful software that uses advanced algorithm to enable dark mode on your WordPress website. Night Eye uses smart color conversion, is highly customizable and extremely easy to use.",
  "data/ph-top/2021/3/self-stack.json": "The Self Stack is everything you need to build a transparent, user obsessed digital studio. No Google. No Facebook. No trust violations. This is agency creativity without sacrificing your soul.",
  "data/ph-top/2021/3/beatflyer-2-0.json": "Beatflyer is the most powerful social media posts creator with a wide-range of effects which can also sync to the music. Import your designs, design from scratch, or start from one of the crafted templates.",
  "data/ph-top/2021/3/ennerate.json": "Ennerate (YC W21) does business valuations for small and medium sized traditional businesses (plumbers, manufacturing, etc.) for 5x faster and 10x cheaper than existing services. Users upload financials, take a survey, and our models generate the valuation.",
  "data/ph-top/2021/3/fontshare.json": "Can't spend thousands of dollars on premium fonts and tired of using the same plain Google fonts as everyone else? Fontshare brings a collection of high quality fonts 100% Free for both Commercial & Personal Use.",
  "data/ph-top/2021/3/meho.json": "The world is filled with too much noise around China. Meho (“very good” in Shanghainese) is here to help you contextualize China and equip you with hands-on Chinese skills, so you won’t miss out on the opportunities brought by the development of China.",
  "data/ph-top/2021/3/vantage-2.json": "Vantage is a cloud cost transparency platform currently supporting AWS. Securely link your AWS account in a click of a button and we'll automatically show you where your costs are coming from and how they're trending.",
  "data/ph-top/2021/3/stackby.json": "Stackby is a collaborative workspace that brings ease of use of spreadsheets, functionality of databases and access to popular services via no-code API connectors - to create, organize and automate anything.",
  "data/ph-top/2021/3/alpaca-fractional-trading-api.json": "Alpaca offers the world’s first commission-free fractional trading API to allow us to build more flexible quant trading models and fintech apps.",
  "data/ph-top/2021/3/clubhub-for-clubhouse.json": "We're happy to announce a tool to help you moderate the Clubhouse rooms, track users interest, analyze their behavior and get your profile insights. ClubHub allows to track and find top rooms, users, clubs on Clubhouse and many more!",
  "data/ph-top/2021/3/stackerx.json": "StackerX is our next-generation no-code platform for creating powerful business software. It's like superpowers for your business. We've been working behind the scenes on this for 6 months, and we're super excited to announce it here today.",
  "data/ph-top/2021/3/startup-guide-to-analytics.json": "This interactive guide will be the first step in helping you get started with analytics. It contains 🧠 the basic concepts and 📚 terminology you need to track your startup’s growth user engagement. 👉 Give it a try: http://guide.june.so/",
  "data/ph-top/2021/3/squadpal.json": "SquadPal is the app for the life of your remote/hybrid team. Through games, challenges and fun activities, SquadPal helps you create a safe space to build better connections with your teammates. Get started today, it's free for teams of up to 20 people! 🔥",
  "data/ph-top/2021/3/memo-6.json": "Memo enriches your conversations making it super easy to share links, videos, galleries and loads more. Comment on any word, sentence or paragraph in Memo messages. Send longer-form messages with rich media embedded to anyone using their email address.",
  "data/ph-top/2021/3/daily-four.json": "Do what matters most. Daily Four is all about getting the important things done with minimal stress. Reflect on your past achievements whenever you need a dose of perspective.",
  "data/ph-top/2021/3/claysql.json": "Connect your SQL database to Clay to insert your query results directly in Google Sheets. Goodbye to hopping between SQL editors, CSV downloads, Excel, and Dashboards. Have your financial models, growth charts, and customer lists always up to date!",
  "data/ph-top/2021/3/gocopy.json": "GoCopy is an AI writing assistant. We augment your creative process with AI-powered writing tools. Say goodbye to writer's block and get your creative juices flowing.",
  "data/ph-top/2021/3/readme-recipes.json": "Recipes are a new way to create step-by-step code walkthroughs right in your ReadMe documentation. By helping you showcase the best use cases for your APIs, it's easy for developers to get started faster while saving your team time on developer support.",
  "data/ph-top/2021/3/nodes-2.json": "What if programming was about ideas, not semicolons? Compose, abstract, generalise. Start from top down or bottom up and refine as you go. With Nodes, programming feels like sketching on a canvas.",
  "data/ph-top/2021/3/fishy-products-by-adflow-ai.json": "Fishy Products by Adflow is the only GPT-3 copy generation tool that helps you prepare your April Fools' stunt. Our interface is a tribute to the original Mac OS from 1984 (inspired by poolside.fm). ⠀ The AI tool is completely free, no sign-up required!",
  "data/ph-top/2021/3/vs-code-theme-studio.json": "VS Code Theme Studio enables you to quickly and easily design your own VS Code theme in an intuitive, user-friendly, web-based interface. No more messing around with nasty JSON files, editing raw hex color codes, and tweaking settings.",
  "data/ph-top/2021/3/waving.json": "Waving is a gamified social network, targeted for gen-z, we have the coolest features of other traditional social media but we added some sparks of gamification!!! Every action you make is converted to coins and you can change for new features and more range.",
  "data/ph-top/2021/3/noise-and-gradient.json": "You know how gradients are trendy, but adding a slight noise filter or grain to them is even trendier? Well now you don't have to crack open photoshop to get that effect with your own colors. Just go to noiseandgradient.com!",
  "data/ph-top/2021/3/grouparoo-2-0.json": "Developers have been using the Grouparoo UI to set up automated data movement from their databases to cloud-based tools like Mailchimp. Grouparoo now supports declarative code to set up this pipeline so you manage data sync just like you would any other app.",
  "data/ph-top/2021/3/bankiom.json": "Bankiom is kind of Expedia for your money Track all your money Send money like texting Grow your wealth like a pro in a fun way Your mission if you choose to accept it is to catch our bugs & provide your feedback Let’s change the world one account at a time!",
  "data/ph-top/2021/3/video-sdk-from-zoom.json": "Accelerate your development & build fully customizable video-based applications with the performance, scale, and reliability of Zoom's industry leading video-first communications platform. ⠀ Get started at no charge with 10,000 session minutes per month.",
  "data/ph-top/2021/3/showwcase.json": "Showwcase is a social network built and optimised for developers. Developers can connect,&nbsp;share their knowledge and showcase their projects with like-minded individuals. For developer content creators, you can make money via paid subscribers.",
  "data/ph-top/2021/3/clubdeck.json": "Clubdeck = 👋Clubhouse ❤️ Desktop, for free Unleash the power of Clubhouse from the comfort of your desktop",
  "data/ph-top/2021/3/iconimations.json": "The pack you've been looking for to bring your website or app to the next level. This pack contain 100 animated icons, rendered in svg, ready to be integrated to your website. The pack will be regularily updated with new versions of the icons to fit all your needs.",
  "data/ph-top/2021/3/take-a-walk-3.json": "Take a Walk lets you take virtual walks around the world, filtering by country, time of day and weather. Enjoy the sigths of cities all around the world, and relax with the sounds that they have to offer!",
  "data/ph-top/2021/3/gumroad-sales-dashboard-for-ios.json": "This iOS widget pack allows you to track your Gumroad analytics with beautiful charts on your iPhone or iPad's home screen via iOS shortcuts. The dashboard pulls in metrics from Gumroad such as orders/revenue, plus breaks down your most popular products. 📊",
  "data/ph-top/2021/3/5000-illustrations-for-figma-by-artify.json": "Bring your projects up to a whole new level using Artify's illustrations plugin, now available directly inside Figma. Through this new plugin you can search & import over 5000 illustrations with over 70 different design styles directly in your figma projects.",
  "data/ph-top/2021/3/bits-of-stock-2.json": "Join the Stock Rewards Revolution! Get fractional shares of the brands you love as you shop, automatically. No need to \"tap to activate\". Simply link as many bank accounts as you like and sit back and earn Stock Rewards.",
  "data/ph-top/2021/3/velocityx.json": "A minimalist Flutter framework inspired from TailwindCSS and SwiftUI for rapidly building custom designs.",
  "data/ph-top/2021/3/blocksurvey-2-0.json": "BlockSurvey is an online form and survey platform with a focus on privacy and security. Think of it as an alternative to SurveyMonkey, Typeform, Google Forms but with a focus on privacy and security. It is powered by Stacks Blockchain.",
  "data/ph-top/2021/3/juggler-dev.json": "Find the most converting headline on your landing site with Juggler! It is an intuitive and straightforward A/B testing tool for your site and it's fully online. Just add the lightweight script on your site and you are ready to find the best headline!",
  "data/ph-top/2021/3/zyla.json": "Zyla is the fastest end-to-end headless commerce stack that blends cutting-edge content management and commerce tools that can accept payments and ship worldwide instantly once deployed to Vercel.",
  "data/ph-top/2021/3/macro-3.json": "Macro helps teams supercharge their manual and repetitive processes. Our powerful checklist allows teams to quickly document processes, assign tasks, track progress, and automate common actions.",
  "data/ph-top/2021/3/500-openers-for-tinder-written-by-gpt-3.json": "Can't find the right words to start a conversation? We have used GPT-3 to generate dozens of thousands of Tinder openers and picked the best of them (according to our limited experience).",
  "data/ph-top/2021/3/gpu-land.json": "GPU.LAND offers GPU instances for Deep Learning — at dirt-cheap prices. How cheap? Up to 80% cheaper vs major cloud providers. We believe everyone, and not just \"Big Tech\", should be able to train AI models. So we built the cheapest place on the web to do it.",
  "data/ph-top/2021/3/strike-5.json": "Stike allows you to use your Debit Card, Credit Card or Bank account to instantly send and receive funds with 0 fees using the Bitcoin Lightning network to transmit payments. Users can also send to regular Bitcoin addresses as well.",
  "data/ph-top/2021/3/blindspotter.json": "Filter bubbles impair our ability to communicate with others and threaten our sense of reality. However, many people don't know they are in one! Blindspotter analyzes your news interactions on Twitter and lets you know if you have a blindspot, left or right.",
  "data/ph-top/2021/3/paid-clubhouse-rooms.json": "Paid Rooms lets you host paywalled private clubhouse rooms. Set one up in less than 30 seconds, simply: 1) Sign up with your phone number 2) Enter your room details 3) Share it an get paid 💰",
  "data/ph-top/2021/3/kameleont.json": "They are perfect to be used in email to redirect iOS users to the app store, android users to the play store and for those that uses a computer, you can redirect them to your web app. And those users we can not match, they will be sent do your default url.",
  "data/ph-top/2021/3/aries-2.json": "The first reliable all-in-one investing, trading, and saving application. A platform for analyzing and executing on quality information, and then sharing thoughts, research, and profits to any social media platform with a button tap. BETA: http://www.tradearies.com/?kid=1F6DV1",
  "data/ph-top/2021/3/bulwark.json": "A pretty, minimalistic TOTP 2-factor authentication app.",
  "data/ph-top/2021/3/yuzu-2.json": "Yuzu lets anyone build human-in-the-loop business processes without code. We combine powerful automations & integrations with the people-orchestration of a project management tool to keep your processes running to schedule.",
  "data/ph-top/2021/3/time-zone-pro.json": "We think it's likely you have at least a couple of contacts dotted around the globe and we know how difficult it can be keeping track of lots of different time zones. ⠀ Now you can add your contacts and never schedule a call over dinner or bath time again!",
  "data/ph-top/2021/3/usage-3.json": "Usage is a system monitor for iOS 📲",
  "data/ph-top/2021/3/offermy.json": "🎨 Create and manage personalized subscription plans 🎯 Test and optimize your pricing model to increase your conversion 🧩 Use the direct link to your subscription page or embed it on your website 😱 All that without coding.",
  "data/ph-top/2021/3/hirebeat-3.json": "📈HireBeat for Employers is an automated interview screening platform that saves employers time 🕗 and money💰! HireBeat delivers one-way interview invitations that allow the employer to review & evaluate candidate performance anytime, anywhere.",
  "data/ph-top/2021/3/invoicy-2-0-1.json": "Create and send professional invoices and estimates with an online solution Invoicy. A few clicks and you can accept payment online using Paypal or Stripe. Most suitable for freelancers and small teams, happy invoicing!",
  "data/ph-top/2021/3/web-dashboard.json": "As you browse the Web Dashboard add-on tracks the time spent on each website. This data is then displayed in a visually intuitive and interactive manner. Understand your browsing and fight distractions! Privacy focus: Your data never leaves your computer!",
  "data/ph-top/2021/3/tweetdeets.json": "TweetDeets gives you an insightful look at a Twitter account's activity. Instead of just a feed of tweets, you see their posting calendar, most frequent posting times, top words, posts by platform, and more in a clean, shareable report.",
  "data/ph-top/2021/3/louvre-museum-online.json": "The Collections database consists of entries for more than 480,000 works in the Musée du Louvre and Musée National Eugène-Delacroix. Updated on a daily basis, it is the result of the continuous research and documentation efforts carried out by both museums.",
  "data/ph-top/2021/3/fancy-widget.json": "Fancy Widget is the ultimate widget App that can make your iPhone home screen look stunning. It starts with a wide collection of beautiful designed widgets, which range in function from clock, to weather, to calendar and step counting.",
  "data/ph-top/2021/3/api-connector-2.json": "API Connector is simple solution for data importing from any JSON API to Google Sheet, Airtable, & Webflow.",
  "data/ph-top/2021/3/codeally.json": "Codeally brings candidate management, automatic assessment, and coding together to give technical hiring teams superpowers.",
  "data/ph-top/2021/3/sleep-formula.json": "Sleep Formula is your personal sleep assistant that counts your sleep cycles and tracks your sleep. Wake up bright-eyed and bushy-tailed at ANY time even if you stay up late! Analyze your sleep and build healthy habits! Let's do it together!",
  "data/ph-top/2021/3/firework-web-story-platform.json": "Firework brings the TikTok/IG/Snap Story experience into any Website or any app. Raised $55M in Series A, we aim to unite the open internet (decentralized and open) to fight against the giant social media (centralized and closed)",
  "data/ph-top/2021/3/krypto.json": "Krypto allows you to invest, trade, gift, and pay with cryptocurrency seamlessly to anyone, anywhere, anytime. 🎉 Trade For free 💎 Pay with Crypto to any vendor in India having a UPI address or debit card machine 🚀 Send & Recieve Crypto for free",
  "data/ph-top/2021/3/lyne-2.json": "Lyne uses an advanced AI model to analyze each of your prospects their online profiles and writes a hyper-personalized introduction to them, which you can use in your cold outreach messaging.",
  "data/ph-top/2021/3/5am-coder.json": "It's hard to focus when you're stuck at home. 5am coder brings programmers, developers & makers together at 5am for session of deep, focused work.",
  "data/ph-top/2021/3/actuflow-3-0.json": "Actuflow is a super simple app, that may change the way you use your phone. The app is for defining intentions before using phone or concrete apps. This is literally all that the app does. This tiny trick may make your device usage more mindful.",
  "data/ph-top/2021/3/exashape.json": "Exashape is an app that allows you to challenge your own memory. It has a minimal interface with a single focus: \"challenging your memory\".",
  "data/ph-top/2021/3/suez-canal-blockage.json": "A small weekend project visualizing the estimated cost of the Ever Given cargo ship blocking the Suez canal. Has a silly feature where you can guess when the blockage will be over.",
  "data/ph-top/2021/3/allo-for-desktop.json": "Too many tools? Too many back-and-forths? It's time to build the common ground between remote teams. The only place to truly work together across roles without juggling many tools. Allo is your first remote workspace.",
  "data/ph-top/2021/3/ui-libraries-by-shuffle.json": "Shuffle is an online editor for Tailwind CSS, Bootstrap, Bulma, and Material-UI. Today, we are launching our marketplace and two new UI libraries for Tailwind! https://shuffle.dev/marketplace",
  "data/ph-top/2021/3/gameapart-2.json": "Play board, card, and party games online with family and friends or gather your remote team for a fun team building activity. GameApart works with any video conference platform. New games are released monthly. Let's get this remote party started!",
  "data/ph-top/2021/3/listnr-2.json": "Listnr helps you start a Podcast in 100+ Voices and 22 languages without recording anything, we use Speech Synthesis technology from Google, Amazon, Microsoft and IBM to power Listnr and deliver great results!",
  "data/ph-top/2021/3/rainbow-3.json": "Rainbow is a fun, simple, and secure Ethereum wallet that makes managing your assets a joy. 🥇 Best wallet for NFTs 🦄 Uniswap is built-in 🍎 Buy ETH using Apple Pay",
  "data/ph-top/2021/3/dailyhabits.json": "Finally, a habit tracker that helps you do more, by doing less 🥳 ✅ Visualize your entire month at one glance ✅ Set flexible goals instead of streaks ✅ Make notes to reflect on your journey ✅ Fully responsive on mobile Start your 30 days FREE trial today!",
  "data/ph-top/2021/3/branch-2-0.json": "Branch is your space for work and play! ⠀ Bring back serendipity, spontaneous conversations, hallway bump-ins, watercooler chats and so much more that's missing in remote work with the collaborative and fun virtual HQ.",
  "data/ph-top/2021/3/melody-generator.json": "A simple web app to procedurally generate random MIDI melodies that you can use royalty free in your own work.",
  "data/ph-top/2021/3/yac-meet.json": "Collaborate without burnout. Replace back-to-back meetings with voice messaging groups. No calendars, no video chats, just back and forth voice messaging groups. Meet on your own time and take back your calendar.",
  "data/ph-top/2021/3/shub-one-2.json": "Shub helps businesses & professionals showcase their products & services while cross posting news to other social media channels. Post up/down vote troll limiting newsfeed & topics newsfeed. Add news images video gallery contact resume hashtags",
  "data/ph-top/2021/3/async-offsite-in-a-box-by-voodle.json": "Your friends at Voodle have flipped the script on what strategic offsites, creative brainstorming and team building can look like for distributed teams. Download this FREE toolkit to help kickstart your async offsite today.",
  "data/ph-top/2021/3/styled-chart.json": "Create charts with https://styled-components.com/. A react lib built with TS and almost no dependencies (no d3 and all this stuff). Import some default chart components as Bar, Path, BarGroup, restyle them and add back to the chart 😁-> profit.",
  "data/ph-top/2021/3/doodle-2.json": "Spark friendly competition with your team and boost morale, from&nbsp;Slack! People take turns drawing and guessing prompts. The faster you guess, the more points you get. Great for before a meeting, a Thursday social, or just taking a break. Up to 12 people.",
  "data/ph-top/2021/3/blixi.json": "Blixi is a relaxing puzzle game with beautiful neumorphic design and innovative fresh gameplay. Compete for the top ranks with players from around the world on the constantly updated leaderboards. Blixi is an ideal casual game.",
  "data/ph-top/2021/3/zero-waste-app.json": "Take control of your plastic consumption through our goal-focused zero waste experience.",
  "data/ph-top/2021/3/float-mobile-app-2-0.json": "Faster and more intuitive, the Float mobile app has an all new interface that makes it easy to view and schedule tasks, log hours, and set a status - in just a few taps! “A sleek and intuitive UI, that’s lightning fast.” John K., Software Engineer, Anthroware",
  "data/ph-top/2021/3/match-by-color-io.json": "With Match you can copy colors of any image with one click. Use machine learning to create your own color grading presets and instantly change the color of your images with one powerful, simple-to-use app that runs directly in your browser.",
  "data/ph-top/2021/3/ever-given-ever-ywhere.json": "Join the internet in making the Ever Given stuck in other areas outside of just the Suez Canal. You can even make the boat to scale.",
  "data/ph-top/2021/3/breakthru.json": "breakthru is a curated list of 40+ self-care tools & resources. It's not easy to find mental health solutions on the internet. Spend less time searching and more time working on your mental well being by trying out apps, podcasts, newsletters on breakthru.",
  "data/ph-top/2021/3/priceblocs-2.json": "Accept payments anywhere online, no coding required. PriceBlocs helps you close more sales in any channel through our super low friction payment links. Accept Apple Pay and Google Pay in just a few clicks.",
  "data/ph-top/2021/3/pacaso.json": "We're here to help you experience the joy of second home ownership. With Pacaso, you own a second home for 1/8 of the cost, while avoiding the hassles of traditional ownership. We'll help you find the perfect fit. You decide how many shares you'd like to own.",
  "data/ph-top/2021/3/halbestunde.json": "Halbestunde introduces a new way of learning the piano. The AI app is a co-trainer, ready to give you customized feedback at any time. Therefore, we use a specifically developed algorithm that allows the app to recognize and play every piece of music you want.",
  "data/ph-top/2021/3/insomnia-cli.json": "Spend less time worrying about QA, PR reviews and API pipelines with Inso, the Insomnia CLI that integrates directly with your CI/CD pipeline with ease.",
  "data/ph-top/2021/3/four-note-boards.json": "A stupidly simple and private text tool that I made for personal use to help me think multidimensionally.",
  "data/ph-top/2021/3/1feed.json": "⏱ 1Feed is built to keep you up to date, without being an addictive time sink. 🔎 Add anything to your 1Feed and stay updated across desktop and mobile. 🧘‍♂️ It’s your quiet place on the internet — where you can focus on the people and content you care about!",
  "data/ph-top/2021/3/octofi-1.json": "OctoFi gives you cash back when you transact with trusted DeFi and NFT marketplaces, across multiple blockchains, through our all-in-one dApp or browser-plugin Wallet.",
  "data/ph-top/2021/3/venture-capital-jobs.json": "You want to get into Venture Capital? We are collecting new jobs from all the leading VC firms around the world. Apply to your VC job now!",
  "data/ph-top/2021/3/vectornator-4-0.json": "Vectornator is the best vector graphics software available for the Apple ecosystem. The 4.0 update brings a complete Mac UI Redesign, SF Symbols, Quick Settings, and more! Use Quick Actions to work up to 30% faster!",
  "data/ph-top/2021/3/inspirational-a-b-tests.json": "Inspirational Tests is a free compilation of different A/B Tests conducted on the copy, CTA/Pricing page, and UX/Design of different landing pages.",
  "data/ph-top/2021/3/microsurvey-template-gallery-by-userleap.json": "Collect and understand user insights with UserLeap’s in-product microsurveys! Access 75+ free microsurvey templates, each designed by our User Research team, and grouped into use cases so you can get answers to your most important product questions, fast.",
  "data/ph-top/2021/3/habio.json": "Habio allows you to dive into the very nature of your habits through psychological exercises, CBT-based reflection journal and timely reminders adjusting to lifestyle goals. Habio is a perfect tool to help you improve your daily routines step by step.",
  "data/ph-top/2021/3/froged-2-0.json": "FROGED is the fastest way for SaaS businesses to accelerate customer onboarding, support, and retention while avoiding churn rate. Quick to install, +1k integrations, and 5 mins data migration. Check out our https://app.froged.com/signup?utm_campaign=product-hunt-march-2021&utm_medium=referral&utm_source=producthunt&utm_content=description-ph-cta.",
  "data/ph-top/2021/3/antistalker.json": "Antistalker is a free Android app that notifies you when other apps are using the camera or the microphone of your device. Compared to other similar apps, lets you know which application used your cam or mic and for how long.",
  "data/ph-top/2021/3/manifest-mind-maps-and-flowcharts.json": "Big collection of elements for mind map and flowchart building. Create flowcharts and mind maps to follow the smartest way of dealing with big projects. Special for Figma.",
  "data/ph-top/2021/3/inwise-app.json": "Create remarkable invoices in 3 simple steps. Let’s start with products or goods.",
  "data/ph-top/2021/3/afterword.json": "Afterword is a simple personal library that makes book tracking and sharing reads with friends easier. Afterword features an activity feed, a recommendations page, and the library page to track your own books and see your friend's profiles.",
  "data/ph-top/2021/3/farmtogether.json": "FarmTogether is a technology-powered investment platform that provides direct access to farmland as an asset class.",
  "data/ph-top/2021/3/swapstack.json": "As a newsletter creator, finding paying sponsors is hard! Swapstack is a marketplace connecting brands & writers to run paid sponsorships. ✍️ As a writer: Work with brands your readers love. 💼 As a brand: Work with writers who speak to your audience.",
  "data/ph-top/2021/3/product-management-templates.json": "Get inside the minds of top Product Leaders from Netflix, Amazon and Spotify with these templates covering the nine most common Product Management scenarios — presented by Product School, MURAL and Coda.",
  "data/ph-top/2021/3/greg.json": "Greg is a simple app that will coach you to grow healthy, happier plants. ⠀ Greg uses insights from plant physics to train machine learning algorithms so you know when to water each of your plants, in whichever environment they’re in.",
  "data/ph-top/2021/3/bobby-3-5.json": "We're excited to present a nice update of Bobby, the iPhone app that helps you keep track of your subscriptions. One of the often requested feature has now been added; Categories! You can now group subscriptions to categories in Bobby like Personal and Work.",
  "data/ph-top/2021/3/remotechoice.json": "Remote Choice provides you with relevant information to help you make a decision on where to live and work from remotely. Covering location guides, visas and more.",
  "data/ph-top/2021/3/threadit-by-google.json": "Tired of spending too much time in back-to-back meetings and lengthy chat discussions? Try Threadit -- short video recordings to show your work, connect your team, and get your day back. Get started at threadit.app or learn more at threadit.area120.com",
  "data/ph-top/2021/3/perks.json": "PERKS is for Remote Teams, Startups, Gig Workers, Students and many more! The future of work needs a new system to provide people the tools they need to live a happy and productive work life. We built PERKS to bring the best campus experience to everyone!",
  "data/ph-top/2021/3/sleekbio.json": "Showcase your BEST content with a simple, beautiful SleekBio link for your social media profiles. Link your products, embed videos and podcasts, promote your social channels, and more. Plus, measure results with detailed analytics and a Facebook Pixel.",
  "data/ph-top/2021/3/customer-value-optimization-course.json": "If you want to become a Leader in Customer Loyalty and want to set your ecommerce business for long term success, Customer Value Optimization is key. ✔️ 10 international eCommerce experts ✔️ Over 15 chapters & 80 lessons ✔️ More than 12 tools & resources",
  "data/ph-top/2021/3/alchemy-storefront.json": "🧱 Drag-and-drop anywhere in your store, works with any theme 👩🏼‍🎨 Design and build new components + experiences ✌ Integrate with existing 3rd-party services 😋 Collaborate with your team on design + code + content",
  "data/ph-top/2021/3/planstack.json": "Planstack is a combined marketing calendar for teams to organize upcoming work and automatically sync multiple calendars for a reliable, up-to-date view of everything. No more spreadsheets and task management noise—a lot more visibility and alignment.",
  "data/ph-top/2021/3/process-street-s-slack-app.json": "Our new Slack App: Bring Process Street into Slack to manage and automate all your workflows in one place. Handle tasks, forms and approvals in a few taps, without needing to leave Slack. Process Street makes your team's recurring work fun, fast and faultless.",
  "data/ph-top/2021/3/steady-capital.json": "Steady Capital is a web dashboard for retail investors to buy shares of income-generating commercial real estate. Make investments and see financial reports in our dashboard, and get monthly deposits from your investments directly to your bank account.",
  "data/ph-top/2021/3/steer-through-the-suez-canal.json": "Navigating the Suez Canal is a high-stress, complicated feat that requires master piloting skills. Try your hand at traversing one of the most highly trafficked nautical thoroughfares in the world.",
  "data/ph-top/2021/3/netflip-2.json": "Install Netflip on your partner's device to find movies you BOTH like. Swipe right to LIKE! If your partner likes the same movie you HAVE to watch your match. Select your streaming services to make sure you can watch your matched movie or TV show.",
  "data/ph-top/2021/3/rollups-by-leave-me-alone.json": "Rollups lets you replace the constant stream of emails flooding your inbox by bundling all of your mailing lists into one digest email, sent weekly.",
  "data/ph-top/2021/3/mobile-chat-kit.json": "Stream’s UI + SDKs for in-app chat allow you to build a beautiful and scalable chat experience in hours. 50+ handcrafted screens for Figma & Sketch. UI components for Flutter, React Native, Kotlin & Swift. Free maker accounts available for side projects.",
  "data/ph-top/2021/3/shape-3.json": "Stop wasting time and start creating the kind of content your learners deserve with Docebo Shape. Shape’s an AI-based content creation tool that lets you build beautiful and engaging xAPI content you can share with learners in just minutes.",
  "data/ph-top/2021/3/superbuild.json": "🎁 Super Newsletter → Learn how to rebuild Product Hunt's successful products with No-code. —— 🦸‍♂️ Super Bootcamp → Launch your online business — no code required. Side-by-side with me. —— ⛺ ️Super Community → Join a group of talented and driven people.",
  "data/ph-top/2021/3/datamool-2.json": "DataMool is a predictive, residential real estate property investment analysis tool which helps you find the best investment opportunities nearby.",
  "data/ph-top/2021/3/the-indiecast.json": "The Indiecast is made by Makers rocket. It's a podcast where we talk to and with Indie hackers to share their untold stories, Products, and How they built their Indie Business!",
  "data/ph-top/2021/3/lunadio.json": "A friendly community of early-stage founders helping each other build profitable projects and have fun doing it.",
  "data/ph-top/2021/3/onepager-2-0.json": "Bring together your startup’s key info under a custom URL with privacy settings and analytics built in. New features: 🎉 Invite your Team ⚡ Multiple OnePagers 🤠 Multiple Orgs 💸 Recommended Investors",
  "data/ph-top/2021/3/ultimate-job-tracker.json": "Manage all your job applications inside the Notion only with this template. Here is what you gonna get in this template: 💰 Job Application Manager 📞 Contacts Manager ✨ Action Panel 📝 Resume Builder 🎊HURRY UP, Limited Discount 🎊",
  "data/ph-top/2021/3/paragon-connect.json": "Paragon Connect allows developers to embed user-facing SaaS integrations into their product in minutes. Setup the Paragon SDK once and instantly integrate your product with popular SaaS apps like Salesforce, HubSpot, Slack, JIRA, and more.",
  "data/ph-top/2021/3/loom-for-android.json": "Watch, share, and record video messages on the go with Loom for Android.",
  "data/ph-top/2021/3/thunder-client.json": "Thunder Client is Rest API Client Extension for Visual Studio Code, with simple and clean design. The extension makes api testing very easy with Scriptless GUI based testing.",
  "data/ph-top/2021/3/obsidian-2-0.json": "Obsidian is an OTP Authenticator designed for security, privacy, usability and seamless synchronisation across devices.",
  "data/ph-top/2021/3/bounty.json": "Bounty lets you get paid for referring friends to jobs. If you don't know someone you can refer, share the bounty and get a cut of the prize pool.",
  "data/ph-top/2021/3/stack-by-area-120-at-google.json": "Stack is an experimental product from Google's internal incubator Area 120 which makes it easy to scan and organize your documents. It uses Google Cloud's Document AI to understand the meaning of the documents you scan, or upload from your camera roll.",
  "data/ph-top/2021/3/noizer.json": "Hi Product Hunt! I'm Dmitriy, the maker of Noizer. I would love to introduce you to my small project - Noizer. An app, where you can listen to ambient sounds. It's inspired by Noisli project, but 100% free.",
  "data/ph-top/2021/3/not-less-but-better.json": "not less but better is the digital wellbeing app that helps you become resilient to digital distraction. Learn healthy phone use with 5 minutes of practice a day and feel in control again. Developed by psychologists, backed by science, and proven to work.",
  "data/ph-top/2021/3/queentessence-f80b0c58-d691-456b-94fd-c3e411efaa41.json": "Queentessence empowers physical venues, to understand their customers—just as online businesses do. Our platform enables you to gather & analyze data through wireless hotspots, so you can predict demand, send special offers & conduct email marketing campaigns.",
  "data/ph-top/2021/3/artvatars.json": "Over 60 of the world's top crypto artists provided artwork, this is cut apart at specific points and randomly assembled and generated using AI and stored as an NFT in the blockchain.",
  "data/ph-top/2021/3/prime-design-starter-kit-3-0.json": "Prime 3.0 is the set of 7 Libraries for Sketch. It helps design UI much faster thanks to over 2,000 Components and 140 UI Templates (Web + Mobile) connected with 600+ Styles and Color Variables. Configure Prime within minutes and use Components within seconds.",
  "data/ph-top/2021/3/backdrop-3.json": "Discover the perfect backdrops for your pictures. Save on the go, plan trips visually and explore beautiful locations around the world.",
  "data/ph-top/2021/3/supabase-storage.json": "Supabase is an open source Firebase alternative. Today we are launching one of our most requested features - Storage! You can upload files, programmatically or via the dashboard, and make them available in your Supabase app.",
  "data/ph-top/2021/3/bodyguide.json": "Hey! We're an Australian start up that's just released BodyGuide. It's an app that helps you self solve aches, pains and tension. There's no payment details for the promo so you don't have to cancel. Fix your neck, back, shoulder, knee & hip pain - for free.",
  "data/ph-top/2021/3/wesat-2-0.json": "Wesat makes it easy to create invoices and contracts for your clients. No matter your freelancing needs, Wesat can help. Our subscription-free pricing model is great for beginners and pro freelancers alike.",
  "data/ph-top/2021/3/pdfchef-by-movavi.json": "PDFChef by Movavi is an easy and reliable PDF editor and viewer: create PDF, edit PDF text, rotate, rearrange, and extract PDF pages, import images, convert files, and more. Work with PDFs on Windows or Mac using a desktop app, online service, or mobile app.",
  "data/ph-top/2021/3/datashake.json": "Analyze reviews with enriched company profiles from 85+ review sites in one place.",
  "data/ph-top/2021/3/roll-up-vehicles-by-angellist.json": "A single link for founders that allows investors to commit and send funds online. Once the Roll Up Vehicle (RUV) closes, AngelList sends one single wire to the company.",
  "data/ph-top/2021/3/freelanium.json": "Freelanium is a platform for freelancers to charge their clients quickly, safely and without commissions, in addition to being able to have all their activity organized on the same platform",
  "data/ph-top/2021/3/ig-tools.json": "Find all the curated news and tools for Instagram. Featuring Anonymous Story Viewers, Stock Photos, Stock Videos and Marketing Tools as well as Story Designers & Post Editors.",
  "data/ph-top/2021/3/motion-5.json": "This file includes a bunch of experiments with interactive components in Figma to create some motion in your design. You can download Figma Beta to use interactive components."
}