{
  "data/ph-top/2021/9/mubert-render.json": "Royalty-free music from audio stocks never fit the content you're making, and often require additional editing. Mubert Render makes royalty-free music tracks of exact length, mood and genre with the help of AI. Fits your content like a glove!",
  "data/ph-top/2021/9/hbd-nft.json": "Say Happy Birthday to friends & loved ones with a unique, collectible, hand-rendered NFT piñata. We’ll help with gift delivery & wallet set-up. Each piñata is Ξ0.055. A maximum of 3,660 will ever exist. 366 days. 10 for each. When a day is gone, it’s gone.",
  "data/ph-top/2021/9/leap-club.json": "At leap.club we have a simple mission - more women in leadership positions. Build your social-professional network through 1:1 connections, social, professional micro-communities and join exclusive experiences. Sign up via Product Hunt and skip the waitlist!",
  "data/ph-top/2021/9/plug-play-by-swapstack.json": "Monetizing your newsletter? Never send your newsletter with a sponsor!! 💰 Plug & Play provides you with a curated list of pre-approved affiliate deals you can run. ✍️ As a writer: Always have a sponsor at the ready! 💼 As a brand: Expand your reach!",
  "data/ph-top/2021/9/superbuild-2-0.json": "Hundreds of founders use Superbuild's no-code education and community to build apps and run online businesses — without being technical.",
  "data/ph-top/2021/9/elocance-for-teams.json": "elocance is like Spotify for your team's important content. Create audio playlists of articles, business intelligence, weekly reports or anything else your team consumes. Help your team get ahead, learn and stay connected with audio at work.",
  "data/ph-top/2021/9/greenr.json": "Enable organisations to turn ESG ambitions into action with a mobile app to track, reduce at source and offset their workforce’s carbon emissions.",
  "data/ph-top/2021/9/slantt.json": "https://slantt.co is a tool for creating tiled isometric graphics. ‎ ✓ Drag & drop image tiles ✓ Turn them into 3D boxes ✓ Set elevation for shadows, box thickness and camera angles ✓ Custom background gradient ✓ Export to PNG or SVG",
  "data/ph-top/2021/9/productjobs-india.json": "Hunting for your next product management role in India just became easier! Head over to https://productjobsindia.com to discover the latest product management jobs in India. Hundreds of entry level gigs, mid & senior level product jobs are up for taking.",
  "data/ph-top/2021/9/cryptoradar-cb5e8d1e-9641-4c68-8155-553aefe4d797.json": "Cryptoradar finds the best places to buy crypto among 70+ exchanges across prices, features, customer reviews & more. Our real-time prices include all trading and payment fees, providing you with the transparency you need to make informed investment decisions.",
  "data/ph-top/2021/9/remotechoice2.json": "Remote Choice provides you with relevant information to help you make a decision on where to live and work from remotely. 1.0 focused on discovery. 2.0 gives you info that helps you get started in your new place from SIM cards, places to live, work and more.",
  "data/ph-top/2021/9/whole.json": "Improve your mental health and wellness with simple daily activities in Whole! The app focuses on promoting self-care by encouraging users to check in daily and complete habits and tasks that are scientifically proven to improve your mental health.",
  "data/ph-top/2021/9/art-haus.json": "ART HAUS is an artist residency for the metaverse. We enable artists to explore their NFT ideas while helping collectors discover their tokenised works. Privileged access to members-only exclusives is unlocked by collectors who become keyholders.",
  "data/ph-top/2021/9/sales-jobs-board.json": "Hiring sales talent is one of the toughest challenges for startups that scale. We at Close helped thousands of companies with actionable sales recruiting advice since 2013. Get featured in our sales community and have top candidates apply for open roles.",
  "data/ph-top/2021/9/telegram-8-0.json": "Telegram 8.0 brings live streams with unlimited viewers, options to remove captions from media and hide sender names when forwarding, an easy way to jump to the next unread channel, an improved sticker panel, new animated emoji and more.",
  "data/ph-top/2021/9/shipday.json": "Enable fast, local delivery with your own delivery drivers or using third-party delivery services such as DoorDash and Uber - all from one unified platform.",
  "data/ph-top/2021/9/goodcall.json": "Free phone number with an AI assistant that can answer the common requests coming into local businesses. You can customize when it answers, how it greets callers, when it forwards them to your main business line and more.",
  "data/ph-top/2021/9/e-commerce-checklist-2.json": "E-commerce is a long and arduous journey, and you need proper direction and tools to start and grow your business. We analyzed 200+ hours to find the perfect tools and frameworks for your ecommerce business. $20 OFF for 48 Hours",
  "data/ph-top/2021/9/newsletter-spy-2-0.json": "Gain valuable insights into the performance of over 100,000 newsletters. Study the critical trends, discover sponsorship opportunities, and find acquisition targets.",
  "data/ph-top/2021/9/unicorn-platform-4-0.json": "Unicorn Platform offers the simplest flow to get a landing page. SaaS, mobile apps, IT, and tech companies — are our friends. We know your needs and make your life easier.",
  "data/ph-top/2021/9/earnify.json": "Earnify.io motivates sales teams to exceed outreach targets. Enable your team's success with engaging contests, keep them accountable with clear-cut visible metrics, and deliver real rewards for top-performing team members.",
  "data/ph-top/2021/9/analytics-pack.json": "Analytics Pack is a collection of: 📊 the most relevant Metrics 🖼 illustrated with Graphs 📚 explained through Articles 📍 and ideal tracking to put them together Check it out 👉 https://www.analyticspack.com",
  "data/ph-top/2021/9/tulipshare.json": "Tulipshare is an activist investment platform dedicated to social and environmental progress. Now for the first time, you can invest your money to build wealth and promote ethical change. You invest in company stocks and we leverage your shareholder rights",
  "data/ph-top/2021/9/jaadoo.json": "With Jaadoo you can search and manage your mobile screenshots, magically. We are privacy first, so no data ever leaves your phone.",
  "data/ph-top/2021/9/context-5.json": "Context helps product teams stay close to their real customer experience with an automated production change-log, annotated history of decisions, performance reports, and notifications.",
  "data/ph-top/2021/9/nft-degen-tracker.json": "Track which NFTs top influencers & celebrities are buying in real-time.",
  "data/ph-top/2021/9/documents-x-by-readdle.json": "Documents supercharges your iPhone and iPad. It’s like a dozen stand-alone apps shaped into one. From downloading and editing to playing and sharing files of 90+ formats, it lets you do more with your files.",
  "data/ph-top/2021/9/photure.json": "Photure is an app built for you. Capture photos and mint them into an NFT within a minute. Sell your NFT's on the largest marketplaces and take ownership of your surroundings. Developed and Designed by two friends Evan Morris and Patrick Pistor in a weekend",
  "data/ph-top/2021/9/acho-integration-1.json": "👋 Hey Product Hunters, today we’re thrilled to release Acho integration+, an update that’ll help you connect to more data sources to Acho’s analytics platform. New integrations include batch CSV, API and 15+ applications.",
  "data/ph-top/2021/9/tabji.json": "Tabji is a privacy-first lightweight alternative to The Great Suspender with cloud sync for saved sessions. It reduces the memory usage of your tabs by suspending them and relies on Chrome's new APIs for greater performance.",
  "data/ph-top/2021/9/free-ai-paraphraser.json": "Paraphrase, up to 50k characters with one click. Rewrite your old content or just your normal content and make new version of it to get more leads.",
  "data/ph-top/2021/9/marketing-mentors.json": "Marketing Mentors is a pro-bono mentoring platform for marketers who are starting their careers. Our mentors are experts from different fields of marketing, that offer career advice and motivation boost.",
  "data/ph-top/2021/9/iwifi-speedtest-signal-test.json": "- Test the internet speed of Download, Upload and Ping - Connection consistency shows in a graph - Discover Wi-fi signal strength - Record the results for each tests",
  "data/ph-top/2021/9/nailted-for-slack.json": "Nailted is an employee engagement tool, designed by CTOs for Tech teams. You need to understand what’s going on with your people, but you don't have time to design, set up the processes to do so. We give you the insights, so you can make your team thrive.",
  "data/ph-top/2021/9/capsule-2-0.json": "Capsule helps businesses collect and direct professional-looking short-form videos. Like TikTok, for businesses.",
  "data/ph-top/2021/9/value-network.json": "https://valuenetwork.live/ is the DeFi-service that completely changes the paradigm of prediction markets thanks to the Blockchain technology. The platform is built up on the P2P principle, and is based on QTUM Blockchain, Ethereum, BSC, and Chainlink as a price oracle.",
  "data/ph-top/2021/9/filterss.json": "FlterSS is a tool to quickly grab the CSS code of image filters and place them in your web application/project",
  "data/ph-top/2021/9/compito.json": "Compito is a simple and no BS project management application. Its Open source and built using technologies like Angular, Nest, Prisma, Postgres etc. With support for multiple orgs and role based access, you can easily segregate the projects.",
  "data/ph-top/2021/9/golden-twitter-by-fueler.json": "Today we are launching Golden Twitter, presenting the golden side of Twitter where you can learn from high demanding niches like Creator Economy, Growth, Cold Emailing, Productivity, Distribution and many more from the curated collection of Threads.",
  "data/ph-top/2021/9/albato.json": "Albato - No-code Automation platform. A single platform for all business automations. You can connect any apps without coders. If you didn't find the app, just add it! By the way, we have solutions for Saas. Any Saas can take embedded connectors. Enjoy!",
  "data/ph-top/2021/9/this-punk-does-not-exist.json": "This Punk Does Not Exist is inspired by CryptoPunks and This Person Does Not Exist. The collection is limited to 404 unique vector images generated as SVG code. The max supply is a reference to 404 Not Found errors. They are available for purchase on OpenSea.",
  "data/ph-top/2021/9/slaps-2.json": "Slaps a video-based local discovery platform designed for Gen Z. Rather than relying on biased 1-5 star reviews, Slaps shows the best videos in a city across various categories (hidden gems, cool vibes, etc) to better help you discover the best places to go 🎉 Currently live in Miami, Florida! 🏝",
  "data/ph-top/2021/9/card-ux-ui.json": "Cards are the building blocks of a web-based product, be it an app or site.They are often too overwhelmed with the amount of information or incorrectly designed so I created a collection of free templates and Card generator to build better cards",
  "data/ph-top/2021/9/decentrafile.json": "Free decentralized cloud storage for file upload & image hosting. File uploads cannot be deleted, hacked, edited, never saved to any server + are only accessable by using a key. Files are never actually uploaded as something recognizable without our URL + key.",
  "data/ph-top/2021/9/o-mg-cable.json": "For all you red team hackers out there. This discreet web server can be used for covert field-use, with features that enhance remote execution, stealth, forensics evasion, all while being able to quickly change your tooling on the fly.",
  "data/ph-top/2021/9/messagedesk.json": "Reach more customers, fill your calendar, get paid faster, and collect more reviews from one messaging platform.",
  "data/ph-top/2021/9/rpgen.json": "An app that has quick and virtually unlimited content, solving the tough questions and reducing downtime when playing TTRPGs like Dungeons & Dragons.",
  "data/ph-top/2021/9/taxarly.json": "Your companion app to remind you of all income tax and GST related due dates. Penalties for missing a due date can be extremely high - with Taxarly, you have a reminder system that will ensure you never have to pay these penalties again!",
  "data/ph-top/2021/9/blastar-space-race.json": "A sophisticated rocket simulator that lets you experience day in a life of a billionaire in space. Launch your rocket, and participate in ultimate space race with other billionaires.",
  "data/ph-top/2021/9/no-fap.json": "What if a person is trying to control porn addiction and masturbation addiction? And someone says, \"If you can quit your addiction, you'll become a CHAD!\" NO FAP app does the same. It counts no fap days and gives different badges accordingly.",
  "data/ph-top/2021/9/sort-eat-out.json": "Sort Eat Out is a chrome web browser extension that highlights vegan and vegetarian items on UberEats menus.",
  "data/ph-top/2021/9/naevner.json": "Web-app and javascript plugin that generates a color description based on a hex color code. We made this for to have screenreader support for reading out color names on another app.",
  "data/ph-top/2021/9/speechtext-ai-for-chrome.json": "Record voice and capture audio from any web page. Automatically transcribe audio and video files into text with human accuracy.",
  "data/ph-top/2021/9/catalyst-by-zoho.json": "https://catalyst.zoho.com/ is the simplest serverless platform to build, deploy & run serverless web apps, mobile apps, microservices, REST APIs, product extensions & https://catalyst.zoho.com/use-cases.html. https://catalyst.zoho.com/help/tutorials/microservice/introduction.html Pay nothing till you deploy to production Free sandbox & upto 125M free invocations*",
  "data/ph-top/2021/9/heyr.json": "An AI powered virtual assistant designed to boost commitment to mental wellbeing. 24x7 access to our conversational AI. Build your mental fitness with Cognitive Behavioural Therapy (CBT). Discuss, score and track your mental wellbeing and much more.",
  "data/ph-top/2021/9/chiff.json": "Chiff allows you to log in to any website using your phone, making logging in safer and simpler. We leverage the biometric authentication mechanisms (fingerprint/facial recognition) on your phone, so you don’t have to remember a single password anymore.",
  "data/ph-top/2021/9/web3-resources.json": "A comprehensive list of the best 200+ Blockchain resources handpicked from around the web‎ ‎‎‎",
  "data/ph-top/2021/9/certifysimple.json": "CertifySimple App helps Create certificate with Google Sheets to get students info, Google Slides to create certificate and Gmail to send them.",
  "data/ph-top/2021/9/micro-invest.json": "It's just a platform where the product founder submits their MVPs and investors come to help them by providing guidance, support, & a micro inventment to pay the founder 6 months salary.",
  "data/ph-top/2021/9/cbc-list.json": "An optimised list of landing pages from the top CBCs around the globe that helped them grow at an accelrated pace.",
  "data/ph-top/2021/9/step-hero.json": "Step Hero is the lucrative NFT fantasy-themed role-playing game on Binance Smart Chain (BSC) and Polygon. The comprehensive ecosystem includes $HERO token, world-class design of NFT collectibles, cross-chain NFT marketplace and attractive gameplay.",
  "data/ph-top/2021/9/therappy-2-0.json": "Therappy can help you improve the quality of your life. Learn to cope with anxiety, burnout, panic, low self-esteem issues, and much more. Become your own therapist anytime, anywhere. Listen to the sessions for about 15 minutes a day to make your life happier",
  "data/ph-top/2021/9/sheethacks-by-polymer-search.json": "Built for free with a spreadsheet and https://polymersearch.com. ⠀ ⚡️ 500 carefully-curated spreadsheet resources 📈 Level up your spreadsheet skills fast 🔍 Find exactly what you need with an in-depth interactive discovery experience",
  "data/ph-top/2021/9/loot-3.json": "Loot is randomized adventurer gear generated and stored on chain. Stats, images, and other functionality are intentionally omitted for others to interpret. Feel free to use Loot in any way you want.",
  "data/ph-top/2021/9/zipit.json": "Send a message on the Hubspot Chat and we will give you 70% off your first month! The fastest way to unzip zip files in S3: 1000X faster than before.. Everything is performed in parallel: A fast, affordable, simple-to-use S3 zipfile unzipper.",
  "data/ph-top/2021/9/podopi.json": "Podopi helps you get more value out of your blog by creating a podcast from it without effort on your part. Reach new audiences on platforms like YouTube, Spotify and Apple Podcasts. No coding, producing or recording required.",
  "data/ph-top/2021/9/online-countdown-by-datelist.json": "Do you need a public-facing countdown for your next big event, to make it live, or to share with your friends, let's use Datelist free online countdown maker.",
  "data/ph-top/2021/9/practice-dev-2-0.json": "Learn programming. From beginner to the expert level. Write code directly in the browser using an embedded IDE. We provovide similar experiance to VSCode. Everything is free!",
  "data/ph-top/2021/9/offline-text-to-speech.json": "Offline text to speech is a minimalistic website that can speak any text you input and it can do this offline!",
  "data/ph-top/2021/9/periodical.json": "Periodical is like Goodreads except for online articles (not books), and it looks and reads like The New York Times (by displaying your tracked articles as a newspaper). Explore the information of the modern web with the vibe of former days.",
  "data/ph-top/2021/9/dapi-1-0.json": "Dapi helps streamline API integration for the dev team. OpenAPI, sequence diagram, API document site and mock server. It aims for faster integration and better tracking.",
  "data/ph-top/2021/9/adsets.json": "Browse Active & High-performing Ads from the top companies in each domain to gain insights against your competitors.",
  "data/ph-top/2021/9/revsync.json": "Sync your Twitter Revue badge to Mailchimp/Ghost/Substack. Your followers can easily subscribe on Twitter, and you can keep using the tools you love.",
  "data/ph-top/2021/9/nansen.json": "Nansen analyzes and labels 100M+ Ethereum wallets and their activity. So you can separate the signal from the noise. View charts here: https://pro.nansen.ai/multichain/polygon",
  "data/ph-top/2021/9/squareone-2.json": "Have you ever met a salesperson that love's updating the CRM? Neither have we… Which is why we built SquareOne. Put an end to your suffering and focus on what you do best, selling.",
  "data/ph-top/2021/9/campaignware.json": "Campaignware helps brands engage with their social audience and grow their email list - through a huge range of free digital content campaigns, from quizzes, trivia, polling, surveys, user generated content and more. At a low cost with no code.",
  "data/ph-top/2021/9/adtuo.json": "Adtuo is the first open and collaborative growth platform for manage and optimize Google Ads & Facebook Ads powered by AI.",
  "data/ph-top/2021/9/cibo.json": "Cibo uses AR and realtime text recognition to highlight dishes on the menu. Point your phone at a menu and select the dish you want to see photos of. No more typing into Google Image Search!",
  "data/ph-top/2021/9/playsit.json": "Playsit is the perfect mobile app for gamers to organize their library. Mark what you have played and what you want to play. Get personalized recommendations. Read about the latest gaming news and much more.",
  "data/ph-top/2021/9/holly-health-2-0.json": "Built by psychology experts, the Holly Bird 🐦 supports you to create habits & experiments to enhance your life rhythm. Form a love for daily movement, sleep better, stress less & reduce emotion related eating. Launch sale on until 13th Sept 2021 🙌",
  "data/ph-top/2021/9/vybe-de60e562-3168-41e0-b3f7-dbd65f1b2dac.json": "Vybe is a passwordless crypto wallet platform that rewards you with an NFT every time you make a purchase. No need to remember any private keys.🔑",
  "data/ph-top/2021/9/dungeons-and-data-structures.json": "Code with python, create your own bot in a Bomberman-inspired game, learn artificial intelligence skills and play against provided bots.",
  "data/ph-top/2021/9/phantom-5.json": "Phantom makes it safe & easy for you to store, send, receive, stake, and swap tokens on the Solana blockchain.",
  "data/ph-top/2021/9/adent-health.json": "Adent uses AI computer vision to scan photos of your mouth, taken from home with your smartphone. For free, and on the mission to put quality dental care in the hands of every person on Earth 🦷🌎",
  "data/ph-top/2021/9/factors-ai.json": "Factors helps you get a holistic view of your sales and marketing funnel - covering every touchpoint across ad interactions, website visits, e-book downloads, webinars, and sales activities.",
  "data/ph-top/2021/9/deta-cloud-1-0.json": "Build & deploy your ideas on the universe's most developer friendly cloud platform. Say goodbye to servers and bills.",
  "data/ph-top/2021/9/3d-transformer.json": "3D Transformer is an online tool to 3D rotate your images and turn them into beautiful 3D mockups✨ It includes a Figma plugin to turn any frame into a stunning 3d mockup",
  "data/ph-top/2021/9/accounts-by-cashfree.json": "[Built for Neo banks, Fintechs, Gig economy & Internet businesses] Use Accounts by Cashfree to create & manage digital bank accounts for your users instantly. Expedite user onboarding by opening bank A/Cs & offer embedded banking experience.",
  "data/ph-top/2021/9/zapbg-2-0.json": "ZapBG is the easiest way to clear backgrounds from your images without having to go through the hassle of using software or hiring anyone. Let your creativity and imagination flow with the ability to remove backgrounds in seconds.",
  "data/ph-top/2021/9/better-product-manager.json": "There is a lot of hype around the role of product manager -\"CEO of product and more\" But not all they say is true. And you may never find that out unless you become a PM oneday. These tests are designed to give you a little taste of what the PM role is like.",
  "data/ph-top/2021/9/codedesign.json": "CodeDesign.app is a no-code design tool that'll help you create anything from components to full-fledged pages 91% faster without writing code. Instantly deploy them or export them to React, Angular & Vue.",
  "data/ph-top/2021/9/xsight.json": "XSight is an Augmented Reality app that shows content about people and places through your phone camera. We help people to become recognisable, and interact online based on what they see. Or, simply put, PokemonGO-like social app 🤩 - \"point, click & message\"",
  "data/ph-top/2021/9/galaxy-mac-os-x-remastered-wallpapers.json": "This is a little project born out of nostalgia and love for this era of Mac OS X design — I've always been a big fan of these space themed default wallpapers and wanted to bring them up to speed with modern displays.",
  "data/ph-top/2021/9/explain-code-in-vs-code.json": "Figstack helps you instantly understand code by having it explained to you step-by-step - directly in VS Code.",
  "data/ph-top/2021/9/milliondollartokenpage-com.json": "A modern take on the classic milliondollarhomepage.com. On MDTP each block can be bought as a unique NFT, set to display the content you like, and later re-sold. Show off and share your content, and own a piece of crypto history!",
  "data/ph-top/2021/9/poster-i-love.json": "Posterilove is a free service for creating interactive posters and getting feedback from your audience online Enjoy 400+ ready-to-use design templates, 2000+ images, hundreds of fonts for creating unique posters. Have your own idea? Сontribute it!",
  "data/ph-top/2021/9/fella.json": "Fella helps men with obesity get to a healthier weight by matching them with a board-certified obesity doctor to prescribe an FDA-approved medication, while they undertake personalized health coaching. Fella is optimized for men's experience around weight.",
  "data/ph-top/2021/9/moonpay.json": "Let your users buy and sell crypto in a fast, simple and secure way. Trusted by the world’s leading wallets, applications, and marketplaces, MoonPay provides a seamless experience to help customers in more than 160 countries access the crypto economy.",
  "data/ph-top/2021/9/omnicourse.json": "Omnicourse is a subscription-based capsule-sized audio course platform for mobile where lecturers can get paid by the minutes listened.",
  "data/ph-top/2021/9/flomo-5b7b6b01-32ba-43f8-a5df-59f07f5a6ae8.json": "flomo is a minimal memo-taking tool based on zettelkasten method. Both the textbox and the API in flomo provide a seamless and rapid memo-taking experience. With daily review and cloud syncing, you can check and write memos across all platforms.",
  "data/ph-top/2021/9/introsnap.json": "IntroSnap enables you to offer to donate to a charity of your prospects' and customers' choice. Send a donation offer to anyone. They choose a charity from 1m local options: schools, animal shelters, and more, boosting engagement and rapport.",
  "data/ph-top/2021/9/wylo-2.json": "Wylo is a social network to explore various topics, make like-minded friends & find content based on your interests in the simplest way. On Wylo, anyone with whom you can work on your passion project or your fav discussion could be just a few scrolls away! ✨",
  "data/ph-top/2021/9/meisternote.json": "MeisterNote is a collaborative documentation tool that makes creating and organizing information simple. It's a writing app with your team at its heart: the perfect solution for team knowledge bases, internal communication, project documentation and much more.",
  "data/ph-top/2021/9/leaksid.json": "LeaksID adds dynamic hidden anti-leak marks on all your documents and converts them to PDF. View protected documents, share them, download and print. Find the leaker in case of illegal publication.",
  "data/ph-top/2021/9/post-generator.json": "Post Generator will help you to convert blog post or article into social media posts using senmatic analysis so that you can use them on your favourite social media platforms.",
  "data/ph-top/2021/9/superpowered-2-0.json": "Manage your meetings and messages in one-click with Superpowered. Bring peace back into your workday.",
  "data/ph-top/2021/9/milanote-3-0.json": "Milanote helps you organize your ideas and projects into beautiful visual boards. Collect inspiration, brainstorm ideas and organize tasks in one flexible place.",
  "data/ph-top/2021/9/memelord.json": "Do you dabble in the dark art of memes? This game is for you. Introducing https://www.bored.social/'s dankest game, Memelord! Not only will it ensure your team has fun captioning memes together, it will also let you know if you’re as funny as you think you are.",
  "data/ph-top/2021/9/tailwind-mobile.json": "Tailwind Mobile - is a free and open source mobile UI components library built with Tailwind CSS. With components for React, Svelte & Vue.js.",
  "data/ph-top/2021/9/request-app.json": "A suite of financial tools to make your life easier - crypto freelancers & organizations use Request App for invoices, expenses, payroll, and accounting. Sign up now for free.",
  "data/ph-top/2021/9/rocketly-app.json": "Rocketly is a social network for entrepreneurs and startups 🚀. Discover members nearby, match based on shared goals, ambitions or skill needs. Find a mentor, meet your future co-founder, or just socialize with like-minded people with big ideas! 🙌",
  "data/ph-top/2021/9/idea-validator.json": "Idea Validator gives founders, makers and creators a workspace to brainstorm their idea and collect user feedback. It has a beautiful easy-to-use interface designed to make what is sometimes the most daunting part of ideation much more fun.",
  "data/ph-top/2021/9/ribbon-2-0-2.json": "Ribbon is a user interviewing platform that helps your team recruit, schedule and interview real users directly from your own product, all with a simple code snippet. Get feedback from real users without compromising on research quality or speed!",
  "data/ph-top/2021/9/report-builder-by-explo.json": "Explo's new report builder provides your users with an interactive report builder to pull their own data. Embed our report builder and your users will be able to select the data they need, configure the report, and export the data.",
  "data/ph-top/2021/9/remote-jobs-in-ms-word.json": "Stuck in your office and want to find a remote job and escape but don't want your 👨‍💼 boss to find out? I made a Microsoft Word edition of Remote OK, so you can browse remote jobs without getting caught 😁",
  "data/ph-top/2021/9/tappity-5.json": "Tappity is building the world's biggest library of interactive lessons for kids—starting with science! With content covering 100s of topics, taught by the world's most entertaining instructors, Tappity will inspire your kids to love learning about the world.",
  "data/ph-top/2021/9/listkit.json": "Hyper-personalized B2B contact lists delivered straight to your inbox – within 24 hours. Boost reply rates from Cold Email & LinkedIn outreach campaigns by 20%+",
  "data/ph-top/2021/9/teamy-2.json": "Teamy puts your team on your desktop, so you can start informal audio & video chats in just one click. Collaborate better together and have more fun throughout the day.",
  "data/ph-top/2021/9/cloudtrucks-flex-virtual-carrier-cash.json": "Make more money with fewer headaches running your business on the platform built for owner operators, the people who keep our country moving.",
  "data/ph-top/2021/9/upflowy.json": "Upflowy is a drag and drop no code tool to build and optimize web experiences. Easily A/B test signup flows, sales lead funnels, customer on-boarding and more. Upflowy gives you everything you need to build a story worth engaging with in only a few clicks.",
  "data/ph-top/2021/9/tandem-2-0-b1d772ab-0ab9-4553-b8a9-ea96d8e876fa.json": "Tandem is a virtual office to connect effortlessly with your distributed or hybrid team. See who’s around, talk in one click. Unlock serendipity and real-time collaboration.",
  "data/ph-top/2021/9/imagi-2.json": "The imagi app turns learning how to code into a fun, creative, and social experience! Beginners can level up their coding skills while creating pixel art, and share their creations with a supportive community of fellow imagiCoders.",
  "data/ph-top/2021/9/card-generator.json": "Our Credit Card Generator tool's primary purpose is for software testing and data verification purposes. It allows you to validate all payment testing scenarios such as credit card number length, format, type, issuing network etc.",
  "data/ph-top/2021/9/wish-wall.json": "In the hustle of life, things that make our heart skip a beat or matter truly take a back seat. Write down the one thing you want to do before you die and see things that matter the most to us as a community",
  "data/ph-top/2021/9/grin-gaming.json": "Grin Gaming is an adrenaline-inducing prediction app where you can win cash by answering simple questions during live events. Compete and win in contests for live Sports, Stocks, Sports, Weather, and more!",
  "data/ph-top/2021/9/sprout-1-0.json": "Drag-and-drop your staple media type to share in your video or audio calls. Decorate and set up your space for all kinds of occasions whether a work meeting or your late-night hangout. Sprout is a place to co-create, co-work, or just chill together.",
  "data/ph-top/2021/9/rally-video-2-0.json": "Rally is now easy to embed into any website or web application. With our video platform, hosting an event is simple, and you can hop in and out of conversations with a click.",
  "data/ph-top/2021/9/loggo.json": "Loggo helps parents and care providers track illness and recovery with easy inputting of critical measures like medication, body temperature, fluid intake, and symptoms. You can also export & share the data with your physician.",
  "data/ph-top/2021/9/neuralcam-live-for-mac.json": "NeuralCam Live for Mac uses the M1 Mac's computational power to enhance the the built-in webcam's video feed in good and low light using multiple AI algorithms. It does all this automatically and it is compatible with most video call apps.",
  "data/ph-top/2021/9/tunes.json": "- Imaginative song titles generated by AI - Audio, cover art, and other functionalities are intentionally omitted for others to create/interpret - Free to mint, just gas - 8K song titles Mint here: https://tunesproject.org",
  "data/ph-top/2021/9/koi-watch.json": "Koi Watch is a website for friends and family to watch videos in sync. Bring your own videos from Google Drive, or use a link from popular sites like YouTube, Vimeo, Soundcloud and more. Use audio, video or text chat while you watch together!",
  "data/ph-top/2021/9/audiostrip.json": "Extract and isolate vocals from any Audio file/YouTube video using AI and Deep Learning. A website that allows you to choose music you want to isolate quickly and for free, and allows you to download the vocal and instrumental parts.",
  "data/ph-top/2021/9/sensei-monitor.json": "Sensei Monitor is a the latest addition to Sensei, our suite of Mac performance tools. Featuring a modern design and advanced statistics tracking, Sensei Monitor allows you to create the ultimate Mac menu bar performance monitor.",
  "data/ph-top/2021/9/instachatbot.json": "Instachatbot let you create Instagram chatbots for Shopify stores. It's live chat feature helps your online store available 24/7 with real-time engagement, personalized interaction, solving pre & post-selling queries.",
  "data/ph-top/2021/9/pingtag-2.json": "PingTag is a recovery tag that people can scan to contact you to return a lost item: 🔔 Receive email + SMS alerts 💬 Reply anonymously via SMS 👨‍👩‍👧‍👦 Assign multiple contacts to tags 🌎 Update your phone number anytime 🙈 Your contact info is never shown",
  "data/ph-top/2021/9/landing-page-builder-for-notion.json": "🔥 Test ideas. Make portfolios. Prepare ProductHunt D-Day... 🤙 Responsive without any effort, unlimited websites. 💰 No subscription required.",
  "data/ph-top/2021/9/transcend-consent-manager.json": "Eliminate your site’s dependency on cookie banners through fine-grained data regulation and smart, local quarantine.",
  "data/ph-top/2021/9/mailtumble.json": "MailTumble is a service that tokenises email addresses, allowing you to share your lists with third parties. Like a URL shortener, MailTumble lets you program in contractual obligations for emails and email lists.",
  "data/ph-top/2021/9/rapidsketch.json": "Create and share amazing Sketchnotes in 5 mins. With RapidSketch you have access to templates, hand-drawn icons, and fonts, which make creating a Sketchnote super easy and fast.",
  "data/ph-top/2021/9/colors-fonts-1.json": "Hello everyone!! New colorsandfonts; the UI has been revamped and added more colors on the site: What's new? - Color System What has changed? - Palettes - Gradients - Font Pairings More cool features to come :-)",
  "data/ph-top/2021/9/fast-track-developers-onboarding.json": "You shouldn't waste 3-6 salaries on a new developer onboarding. Our HR managers and C-level executives have conducted research to figure out how to shorten and automate the onboarding process. Find the results we got in the guide above. Enjoy your read! :)",
  "data/ph-top/2021/9/swop-it.json": "Get the items you need based on your location and interests. No money involved — just swop it. Exchange stuff even of different value or if your interests with seller don't match. Place an offer and see what you can get in return immediately.",
  "data/ph-top/2021/9/mintier-2.json": "Mintier is sugar-free, vegan, keto-friendly, and has only 6 natural ingredients which allows us to gain the interest of health-focused consumers who are looking for a fresher and healthier alternative!",
  "data/ph-top/2021/9/product-hq.json": "Product HQ is an actionable dashboard that details the journey from designing your product, to talking with suppliers, to purchasing and receiving a bulk order. Product HQ provides actionable tasks for each sub-page and dozens of databases and templates.",
  "data/ph-top/2021/9/ray-ban-stories.json": "In partnership with Facebook, discover Ray-Ban's first generation of smart sunglasses and eyeglasses that keeps you connected. So you can keep your eyes on the world around you.",
  "data/ph-top/2021/9/happyteam.json": "The simplest way to keep a pulse on your team's mental health and well-being. Built for managers and leaders to ensure their organization is seen and heard.",
  "data/ph-top/2021/9/fake-info-generator.json": "It can Generate Fake email,phone number,address,credit card number,password and Even Fake Image.",
  "data/ph-top/2021/9/explain.json": "Besides from minimizing the effort it takes to teach, any blackboard explanation can be turned into a lightweight, fileless video with 5-200x less memory than traditional videos. Looking for product feedback - it's ready to use anytime.",
  "data/ph-top/2021/9/cookies-by-digger.json": "Cookies by Digger allows you to generate necessary infrastructure templates for your code projects. It's like create-react-app but for terraform.",
  "data/ph-top/2021/9/remotedream.json": "RemoteDream is a platform that helps you find and book hotels and hostels that are ideal for remote working Ideal locations feature - Quality work spots - Coworkings - Community of likeminded people - Excellent WiFi - Surf Spots/ Beachfront / Terrace / +",
  "data/ph-top/2021/9/coolr.json": "Coolr let's you launch the most fun virtual water cooler room directly in Slack in order to build stronger connections with your colleagues.",
  "data/ph-top/2021/9/tillful.json": "Tillful for iOS is a brand-new app with free business credit tools aimed to help make you a better-informed (and funded) small business owner. Like Credit Karma, but for small business owners. 💯 Business Credit Score 💳 Custom Credit Offers 💸 Growth Funding",
  "data/ph-top/2021/9/pensieve-2.json": "Pensieve AI helps you put your users first by automating your entire research workflow. With all the necessary features like audio/video transcription, autogenerated highlighting, and exporting slides, you can do everything, without ever leaving our platform.",
  "data/ph-top/2021/9/imagery.json": "Imagery is a platform that hosts image datasets, and not just any datasets, but ones that you request. I want to democratise AI for the world, by making all types of datasets available for anyone to download.",
  "data/ph-top/2021/9/roboflow-universe.json": "You no longer need to collect and label images or train a ML model to add computer vision to your project. Start from the finish line by using one of the dozens of pre-trained models our community has already trained and shared via a simple API.",
  "data/ph-top/2021/9/superparents.json": "Being a parent is hard. Hence, we need Coaches who have been there, explored the best possible solutions and can guide us. SuperParents is a platform to book a session with certified and experienced parent coaches to have some help in the parenting journey.",
  "data/ph-top/2021/9/bullet-planning.json": "Inspired by The Bullet Journal Method by Ryder Carroll, this application helps you record and organize content in a way similar to bullet journaling. The idea of this app is to help its users focus on intentionality and productivity.",
  "data/ph-top/2021/9/resolly.json": "We know how difficult it is to complete birthday resolutions. Resolutions are very powerful in changing habits in your life, but they are difficult to follow. With Resolly, we will send you a monthly email reminder and help you be on track.",
  "data/ph-top/2021/9/one-account.json": "Authentication always has been security or convenience, but why compromise? One account - a privacy-focused, secure, and convenient authentication system with built-in 2FA (MFA)",
  "data/ph-top/2021/9/qovery.json": "Qovery is the simplest way to deploy your apps on AWS. ⚡️ Fast and easy to set up (< 2 minutes) 🍃 No AWS expertise required 😎 Auto-deploy from Github and Gitlab Qovery is used by 10000 developers in more than 120 countries 🚀 👉 Give it a try: qovery.com",
  "data/ph-top/2021/9/bill-s-bookshelf.json": "📚 75+ Book recommendations by Bill Gates 📺 Video reviews of books 🔍 Hand curated from Gates Notes The best way to find books to read is through recommendations, what better if we could get it from the reading machine himself.",
  "data/ph-top/2021/9/seatable.json": "With SeaTable, teams can easily organize their tasks, assets, projects and ideas. It looks like a spreadsheet but structures any type of information, in the cloud or on your own server.",
  "data/ph-top/2021/9/brain-booster.json": "Brain Booster helps make cognitive training a habit. The application allows you to work in different areas while having fun and pushing your limits: mental arithmetic, memorization, reflexes. More detailed text below.",
  "data/ph-top/2021/9/crypto-to-me.json": "Hello! crypto-to.me is a portfolio-style website that allows you to share direct links to all of your cryptocurrency addresses - all in one custom unique URL.",
  "data/ph-top/2021/9/listr-2.json": "Listr lets you explore some of the best lists on Twitter, curated across your favorite categories. Just hit follow, pin them to your timeline and stay organized with your content consumption.",
  "data/ph-top/2021/9/1stday-nft.json": "Capture the stars of the sky the day & time, you or your loved one was born as a Star Map NFT ⭐️ that lives on forever on the Blockchain! A non-fungible art that is unique to you or your’s only!",
  "data/ph-top/2021/9/pop-illustrations.json": "Build great looking products with these 300 modern illustrations made in outline style with overprint colors. This is the essential pack for startups, we also included 100 mind blowing Avatars! 🔥 Part of our 8000+ illustrations bundle + Free updates",
  "data/ph-top/2021/9/plash-2.json": "Plash lets you to have a highly dynamic desktop wallpaper. You could display your favorite news site, Facebook feed, a random beautiful scenery photo from Unsplash, a custom built website, etc. The possibilities are limitless. Plash requires macOS 11.",
  "data/ph-top/2021/9/psst-1.json": "Fast Spotify client with native GUI, without Electron, built in Rust. Very early in development, lacking in features, stability, and general user experience. It is being tested only on Mac so far, but aims for full Windows and Linux support.",
  "data/ph-top/2021/9/art-by-an-ai.json": "Art by an AI is a daily competition to find the best prompts. At 12:00 UTC Alice the AI creates art from the top 10 voted prompts using VQGAN+CLIP. Prints of the art can be purchased - but only until the next batch is created. After that they disappear!",
  "data/ph-top/2021/9/fleep-2.json": "Fleep is a chatbot builder for Telegram, in which you can create bots without programming knowledge. — create a store and sell your products; — create modern clients support; — send mailings to users; — use deffered multiposting in chats & channels",
  "data/ph-top/2021/9/recapmail.json": "We collect all your mails from mailing lists, promotions, surveys - and send you a daily digest per e-mail. - Get a @recapmail.com mail for free - Use it for all mailing lists, webshops, etc - We'll send you a daily digest per e-mail Recapmail is free!",
  "data/ph-top/2021/9/hypergraphia.json": "Set a word count goal and the Hypergraphia will automatically measure your progress. The goal calendar is designed to keep writers from breaking their habits. Hypergraphia will work on any site. However, you can control your preferences.",
  "data/ph-top/2021/9/stuchef.json": "StuChef helps low income college students who struggle with cooking or eating healthy to improve their cooking abilities by allowing them to have access to easy, healthy, dorm-friendly, and low-costing recipes to add to their personal cookbook.",
  "data/ph-top/2021/9/crycto.json": "Crycto is a simple and easy to use, decentralized fantasy cricket dapp on the blockchain. Crycto is built on the Polygon network and uses MATIC as the single unified currency, which makes it possible for our users to compete with other users across the world.",
  "data/ph-top/2021/9/replica-studios-v0-1-0.json": "Last year we released a very basic desktop app with Unreal Engine and Unity integrations. Today we're pleased to announce Replica Studios v0.1.0 - everything you need to produce a voice for your game or film.",
  "data/ph-top/2021/9/autoly-2.json": "Autoly turns auto trading into a highly entertaining experience using AI technology to make buyer, seller, and owners’ journeys more fun and less stressful.",
  "data/ph-top/2021/9/weje.json": "Weje is a hyper space where you organize and visualize your own ideas and work projects. Colored text cards, mind maps, embedded sites, online collaboration and more. It's free for all types of accounts in September and October. Sign up today ❤️",
  "data/ph-top/2021/9/hashnode-app.json": "Hashnode is a free blogging platform for developers who want to plug into the global dev community while retaining ownership of their content. Our new mobile app offers a unique experience, enabling our community to stay connected beyond the desktop.",
  "data/ph-top/2021/9/snapshots-by-reviewflowz.json": "Snapshot by Reviewflowz gets you an instant grade report on any SaaS company's review strategy & visibility across marketplaces. Get instant visibility over your competitors' edge, and optimise your own profile following simple recommendations",
  "data/ph-top/2021/9/purity-ui-dashboard.json": "https://www.creative-tim.com/product/purity-ui-dashboard?ref=producthunt is a free ReactJS Dashboard based on Chakra UI that was designed for those who like modern UI elements and beautiful websites. ✅ 70 fully coded elements ✅ 6 example pages",
  "data/ph-top/2021/9/illustration-library-by-dotyeti.json": "This multi-purpose illustration library is 100% for free. Every illustration is available in the following styles: outline, base, flat & gradient. Available in PNG &AI format. More styles & illustrations coming soon. Made possible by https://www.dotyeti.com",
  "data/ph-top/2021/9/jlottie-player.json": "Lottie animations lead the way in adding high-quality, scalable animations to your web pages and menus. jLottie, our exciting new Lottie player, brings the possibility of adding dozens of micro-animations without hampering the performance of your web pages.",
  "data/ph-top/2021/9/moodly.json": "Get a better sense of focus and relaxation by listening to ambient nature sounds. Double your productivity and focus with Moodly, completely FREE.",
  "data/ph-top/2021/9/caards-1.json": "Get people to know you. Now. Highly customizable You can change your Caard's template, theme, style and much more to make it yours. Advanced analytics We offer you advanced analytics for your Caard that still care about privacy!",
  "data/ph-top/2021/9/flamelink-2.json": "Trusted by Developers around the world, Flamelink gives teams a bespoke, feature-rich, intuitive interface to manage content on-the-fly. Connect Flamelink to any Firebase project to leverage the speed, security & scalability of the powerful Firebase engine.",
  "data/ph-top/2021/9/parade-3.json": "Build your own Style Guide without hiring a designer. Describe the brand personality you want and pick from AI-recommended fonts and colors. You’ll get a free wordmark logo, font stack, and extended color palette, plus a Style Guide to show it all off.",
  "data/ph-top/2021/9/accomplice-2.json": "Graphic design and illustration software 100% powered by Artificial Intelligence! With just a sentence you can create endlessly amazing AI designs and illustrations for your projects. Uses high-powered AWS GPUs and state of the models art CLIP + VQGAN 🤖 🎨 🖼",
  "data/ph-top/2021/9/mirror-magnet.json": "Mirror Magnet puts a live camera image on your Mac’s desktop and stays on top of everything else. If you’re sharing your screen on a regular basis and want to make your presentations or recordings more personal — this is for you.",
  "data/ph-top/2021/9/remoteful-2.json": "Find talented people in any location. Hire remotely. REMOTEful is the best site to search and post remote work jobs that are not restricted to commute times or specific locations.Browse remote work jobs now.",
  "data/ph-top/2021/9/edison-calendar-1-0.json": "Edison is a calendar app that helps you break big goals into multiple smaller milestones such that you have action items every day. Each and every subgoals are connected so you can see the clear path towards your goal.",
  "data/ph-top/2021/9/amorus.json": "Amorus makes digital intimacy more private (encryption, deletion controls, emoji shortcuts), more engaged (embedded tools for consent/boundaries/etc), and more inspired (mini-games to flirt and uncover shared fantasies).",
  "data/ph-top/2021/9/pablito-planeta-2.json": "Pablito Planeta is your design astrologist alter ego of Pablo Stanley who would take a look into the future of your sign as a designer.",
  "data/ph-top/2021/9/uhive.json": "Uhive wasn't created as a typical social network whose mission is ‘making money’ for its owners – Uhive was built to generate wealth for ALL. We aim to accomplish this by paying all of its active users a daily amount of its cryptocurrency (digital dividend).",
  "data/ph-top/2021/9/checkyourlist.json": "CheckYourList lets you create checklists where you can uncheck every item so it is ready to go next time. It's great for packing lists, daily routines, cleaning lists and things you take with you constantly. Built to help with ADHD.",
  "data/ph-top/2021/9/oddup-2-0.json": "Find data on startups, investors, and sectors all in one place. 300,000+ Startups, 63,000+ Investors, 30+ Locations, 15+ Sectors & counting",
  "data/ph-top/2021/9/everafter.json": "Easily build personalized workspaces with each account using drag-and-drop widgets for task management, KPIs, timelines, shared assets, and support tickets! Share with customers by embedding the hub directly inside your product or through a private link.",
  "data/ph-top/2021/9/makeswift.json": "🎨 No-code website builder with the power & detail of a design tool ⠀ ✌️ Say goodbye to rigid templates to let your creativity come to life ⠀ 👯‍♀️ Collaborate in real time with your team ⠀ ⚡️ Visually build high-performing websites powered by Next.js & Vercel",
  "data/ph-top/2021/9/jurnee.json": "Jurnee is the platform making team events beautifully easy, in person and virtually. Get inspired, book and plan your team events in minutes. Teams that play together, stay together.",
  "data/ph-top/2021/9/tiny-acquisitions.json": "Tiny acquisitions is the only marketplace for internet business that are priced under $5,000. Tiny Acquisitions allows creators to quickly liquidate that side project through its instant buy escrow service.",
  "data/ph-top/2021/9/infinity-automations.json": "Create reminders, recurring tasks, IFTTT automations, and more to build processes, reduce busywork, and save time.",
  "data/ph-top/2021/9/simplify-mindfulness.json": "Simplify Mindfulness is an Open mental health platform for everyone. It is for discussing anxiety, depression and OCD, and many other issues. Anyone can post their queries openly and answer them.",
  "data/ph-top/2021/9/timecap-3.json": "Hi, Product hunters. Been working hard this year to bring even better features to Timecap and this is the a major release I presenting to you all. It already has helped hundreds of thousands of users to improve their lives and we are just getting started.",
  "data/ph-top/2021/9/bondlayer.json": "The only no-code tool you need to build and publish professional mobile apps and websites. Find separate layout editors, but one shared custom CMS. Out-of-the-box features like Multilingual, Real-time Filters or Forms. Publish to your domain for 5€/YEAR!",
  "data/ph-top/2021/9/city-guesser-3-0.json": "City Guesser is a browser based game for exploring the world at home. Players are shown a video, and have to guess where it is based on the clues around you. Utilize the clues around you like street signs, business names, architecture and more.",
  "data/ph-top/2021/9/studio-clock.json": "Turn your room into a professional studio with this clock that provides you the most accurate time, up to 1/1000 second. Design and animations are inspired by the LED clocks from the 70s, still used by radio & television studios, airports, and more.",
  "data/ph-top/2021/9/oiko.json": "Turn any property into a coliving. Find flatmates who share things in common. Split payments and purchases. Try best deals on local businesses, such as gyms, cafes and shops. Connect with every coliving within a radius & form local communities.",
  "data/ph-top/2021/9/maker-fellowship.json": "Maker Fellowship is a 4-week program in which we offer a $500 equity-free grant to indie makers to ship their next project.",
  "data/ph-top/2021/9/onboarding-shuffle.json": "OnboardingShuffle is the best inspiration for new mobile onboarding. Send to your team and get working on your onboarding! (We know you haven't updated it in 3+yrs 😜)",
  "data/ph-top/2021/9/custom-t-shirts-by-sticker-mule.json": "Turn any design into a custom t-shirt. Printed in full color on 100% ring spun cotton for incredible comfort.",
  "data/ph-top/2021/9/monthly-expenses.json": "An app with minimal interface to track monthly expenses. Not a fancy one with too many details.",
  "data/ph-top/2021/9/scimago-graphica.json": "SCImago Graphica is a desktop application (Mac, Win and Linux) designed to analyze and visualize data. Visualizations can be exported to SVG and PNG, but also published as interactive and responsive charts.",
  "data/ph-top/2021/9/twitter-header-studio.json": "The easiest way to make your Twitter header! No registration, free to use. You're just a few clicks away from designing and downloading your next awesome Twitter header!",
  "data/ph-top/2021/9/presentii.json": "Imagine a tool that lets you capture audience interest in your presentation content as you present. You’ll find out if your presentation is resonating with your attendees as they provide positive or negative measures with comments to support their reactions.",
  "data/ph-top/2021/9/interface-index.json": "The «Interface Index» is a 🏷 collection of UI elements from great B2B, SaaS and desktop applications and services – such as GitHub, Mailchimp or Loom. You can use it to 🏎 speed up your interface research or as 👩‍🎨 visual inspiration.",
  "data/ph-top/2021/9/iphone-13.json": "Apple's most advanced dual‑camera system ever. An even brighter OLED display. A lightning‑fast chip that leaves the competition behind. A huge leap in battery life.",
  "data/ph-top/2021/9/myoffice.json": "MyOffice is your own virtual office to chat with anyone. Easily interact with your colleagues without the hassle of scheduling meetings. Choose your own link, customise your space with your favourite app or art and start interacting!",
  "data/ph-top/2021/9/docular.json": "Docular keeps your knowledge base healthy by automatically sending notifications to relevant team members about articles that need to be kept up to date and relevant.",
  "data/ph-top/2021/9/backlight.json": "Backlight is a unique collaborative platform to build Design Systems code-side. 📐 Design tokens 🧩 Component code and stories 📖 Documentation site 📦 Managed release to npm Everything in one place, in a true collaborative workspace. Try 👉 https://backlight.dev",
  "data/ph-top/2021/9/findem.json": "Findem’s Impossible Search lets you find candidates who have the EXACT attributes you’re looking for in a new hire. We’ve exposed 100+ Impossible Searches for free across different roles, so everyone can experience the magic for themselves!",
  "data/ph-top/2021/9/doodle-ipsum.json": "Doodle Ipsum is a free illustration tool for devs powered by Blush! Inspired by the classic Lorem Ipsum, it automagically generates placeholder illustrations in seconds.",
  "data/ph-top/2021/9/motion-task-manager.json": "Motion takes all of your tasks, external meetings, internal meetings, routines, and personal commitments, and builds the perfect schedule for you, like a personal assistant. With Motion, you'll never need to manually re-prioritize things when plans change.",
  "data/ph-top/2021/9/party-round.json": "Party Round is building better tools for founders, starting with an automated fundraising tool. Invite anyone to invest, generate docs, collect signatures & receive funds, automating your raise from open to close and turning your community into your cap table.",
  "data/ph-top/2021/9/replay-4.json": "🔴 Record your website in the Replay Browser ⠀ 🔍 Inspect the replay with familiar devtools ⠀ 👋 Share with friends and submit the best bug reports⠀ ⠀ ▶️ Replay captures all of the context needed to replay and inspect the web.⠀",
  "data/ph-top/2021/9/gravity-8-2.json": "Gravity is a SaaS boilerplate that has everything needed to build a SaaS product in a single install. It's helped over 300 developers to save months of effort and launch their products at warp speed.",
  "data/ph-top/2021/9/cryptoeggs-2.json": "CryptoEggs Marketplace is the latest NFT Platform to exchange digital art within the cryptocurrency network. Browse through a vintage catalog of 10,000 rare collectible 8-bit Egg Characters represented as NFT's!",
  "data/ph-top/2021/9/magik-for-slack.json": "Magik enables founders, marketers & community builders to create the community experience they never knew was possible. ⚡ ​ Interact with members, build a community library, & stay up-to-date with your community, without ever leaving Slack. ✨",
  "data/ph-top/2021/9/storyteller-3.json": "Give your users the Stories experience they deserve with Storyteller. Seamlessly integrate a Stories feature into your apps and websites in days with just a few simple lines of code. Create an amazing Story, then sit back and watch the engagement metrics soar.",
  "data/ph-top/2021/9/trafft.json": "Trafft scheduling software helps businesses and individuals manage their bookings, meetings & staff. You can customize forms to fit your brand, easily embedded in the website page, or generate a booking page in a minute without you even having a website.",
  "data/ph-top/2021/9/terra-3.json": "TERRA makes it easy to connect your app to your user's health and fitness data, through a single API. Sources such as Whoop, Oura, Garmin and Peloton. Use our widget, to avoid dealing with clunky integrations, bad written docs, and different data structures.",
  "data/ph-top/2021/9/glean-3.json": "Glean is the work assistant with intuition. 🔍 Search across all your company’s apps to find exactly what you need— instantly. 💡 Discover the information and people you should know. ⚡ Connect with everything you already use; it’s easy to use and ready to go.",
  "data/ph-top/2021/9/requestly-2-0.json": "Requestly is a set of developer tools to complete all your Network modification requirements: Intercept, Modify, Debug and Test HTTP Requests and Responses. You can modify headers, mock APIs and responses, set up redirects, delay requests and do a lot more.",
  "data/ph-top/2021/9/product-manager-shaadi.json": "India's #1 serious dating app for Product Managers 💋 Find your perfect match from hundreds of product managers working across FAANG, unicorns and fast growing startups. Few product managers who end up marrying, launched their start-up within 1 year. 🙈",
  "data/ph-top/2021/9/show-business-by-wistia.json": "Watch the only show that teaches marketers how to make a show. Whether it's a branded video series or a podcast, this free resource will teach you everything you need to know—from soup to nuts.",
  "data/ph-top/2021/9/preflight-for-bubble.json": "With two of the No-code tools there is nothing you cannot achieve and make sure the Quality of the app is there all the time.",
  "data/ph-top/2021/9/notion-integrations-by-unito.json": "Two-way integrations between Notion and Slack, Airtable, Trello, Asana, Salesforce, and dozens of other industry-leading work tools. Automate customized workflows that sync key information across your apps and teams, while using Notion as your home base.",
  "data/ph-top/2021/9/analyze-button-by-narrator.json": "With Narrator's new Analyze Button, generate a comprehensive data analysis instantly for any hypothesis you have, giving you all the information you need to make the best decision.",
  "data/ph-top/2021/9/freelancer-news.json": "Freelancer News is a new community by Folyo where freelancers can share tips, news, and interesting links with each other. Freelancing with a little help from your friends. Sign up for free.",
  "data/ph-top/2021/9/copilot-eaa75e5b-117e-4d7a-9b25-a2eed468a690.json": "Copilot is here with a major update to change the way you see your investments ⚡️ 🦅 Get a bird's-eye view of your accounts ⏱️ Mixed with near real-time market data 💰 See live balance estimates 📈 Benchmark your investment returns",
  "data/ph-top/2021/9/fusion-4.json": "Fusion is an open-source all-in-one user behaviour analytics and engagement platform. Its built upon a lightweight low-code mixpanel like analytics engine with built-in live-chat, push-notification and email/micro-surveys.",
  "data/ph-top/2021/9/wall-of-love.json": "Wall of love is the easiest way for you to request and display video testimonials from your users! All you need to do is add our code snippet to your landing page and share your Wall of Love URL with your customers.",
  "data/ph-top/2021/9/tango-ea7e889d-3878-4e0d-9c92-e05d566728b4.json": "Take the dreaded chore out of creating documentation. Onboard new hires, resolve customer issues, and share product updates faster. Documentation that whistles while you work. https://tango.us",
  "data/ph-top/2021/9/browse-ai.json": "Browse.AI lets you train a robot to scrape or monitor any website in 2 mins: 💻 No-code ⏱ 1-click automations 🦿 Adapts to website changes 🕸 Works on almost any website 🖱 Simulates user actions 🔗 Integrates w. Google Sheet & Zapier 🔗 API & webhooks",
  "data/ph-top/2021/9/taskable.json": "Using multiple work apps leads to tons of context switching, breaking flow and killing productivity. Taskable is a smart to do list and productivity assistant. Bring tasks, calendars, & context from across apps into one view so you can search less and do more.",
  "data/ph-top/2021/9/e-gree-3.json": "e-gree is a new mobile app that allows you to create customized legal contracts for your business and everyday needs. With over 20 different contract templates for everything from NDAs to Prenups to Freelance work agreements, e-gree makes legal services accessible and affordable.",
  "data/ph-top/2021/9/apiway-2-0.json": "Apiway is a Free API integration platform and social network for Automation experts You can: - Connect 30+ apps between each other for free - Explore b2b software on our marketplace - Compare b2b software using unique “Software Battles”",
  "data/ph-top/2021/9/kosmotime-2.json": "1. Sync all your calendars: no more double bookings! 2. Block time: create, group, and schedule tasks directly in your calendar. 3. And more: mute Slack and tabs distractions, and keep track of your time.",
  "data/ph-top/2021/9/packshot-generator-by-colorful.json": "The Colorful Packshot Generator lets you create photorealistic renders from your 3D models easily. Shoot multiple angles at once, pick a background color or create a cut-out photo.",
  "data/ph-top/2021/9/alpaca-3.json": "Open links from Slack via desktop apps: Notion, Spotify, Zoom, Miro, Telegram, Airtable, Figma and VK. Works for macOS and iOS with URL to URI conversion.",
  "data/ph-top/2021/9/workona-for-ipad.json": "iPads have never been equipped for serious work in the browser — until now. Workona helps you stay in the flow as you work: organize tabs, save them for later, and sync tabs instantly from your desktop browser. Learn more at: https://workona.com/ipad-app/",
  "data/ph-top/2021/9/mailchimp-for-livechat.json": "Newest Mailchimp integration allows you to gain new subscribers via a chat widget on your website and utilize LiveChat data for your marketing campaigns.",
  "data/ph-top/2021/9/portal-b288d364-eb5a-4d9a-bde1-9a4de6dc516c.json": "Portal is a customizable virtual space for you to build and hang out in. Move around like in a game, walk up to people you want to talk to or launch a game. Spend quality time with your peers and feel more connected than ever.",
  "data/ph-top/2021/9/chapter-3.json": "Chapter is a new way to learn directly from busy thought leaders. Join a creator's chapter to get weekly content drops with the best stuff they read, watch, and listen to. Then ask them questions like you're texting with a friend.",
  "data/ph-top/2021/9/financial-low-hanging-fruit-checklist.json": "Get a personalized checklist of financial suggestions based on your life stage, income, savings and more!",
  "data/ph-top/2021/9/ueye.json": "uEye is free, fun, and an interactive way to learn UI design. There are 15 UI design challenges and you have to spot which UI design fundamentals have been applied incorrectly! Get a point for each correct answer, and lose a point for those you get wrong.",
  "data/ph-top/2021/9/the-lager-podcast-2.json": "Interviews with hardware founders, leaders, and industry experts on their personal journeys and career-defining projects. S1: Tyler Mincey Sara Chipps Christina d'Avignon Benson Tsai Michael Corr Jake Levine Who should we talk to in season 2?",
  "data/ph-top/2021/9/air-x-worthlessstudios-free-film-gallery.json": "What better way to show off a project by the people, for the people? Presenting, in collaboration with worthlessstudios: FREE FILM. Explore this incredible project today! Air isn't just for collaboration —&nbsp;it's also perfect for presentations and portfolios.",
  "data/ph-top/2021/9/terra-4.json": "Easy digital video creator.",
  "data/ph-top/2021/9/3d-icons-2-0-by-iconshock.json": "A huge 3D icons pack featuring 4000+ icons in 2 viewpoint versions (front & perspective), 5 premade color palettes, PNG files and a Figma file where you can customize their colors, with a built-in search function where you can find exactly the ones you need!",
  "data/ph-top/2021/9/marketing-for-startups-1.json": "47 practical tactics to get customers and achieve hockey stick growth. Lessons that helped startups grow from zero to over $100,000 MRR.",
  "data/ph-top/2021/9/inovatik-html-templates.json": "Download 24 FREE HTML templates to help you create beautiful websites and landing pages faster. They were built for easy customization, have gorgeous designs and pack features you will not find on any other free templates site.",
  "data/ph-top/2021/9/characterz-2.json": "Characterz 2 is a diverse 3D library thanks to which you can do more than 100,000,000 combinations of 3D characters. Mix & Match style. Use it in your products/projects, personal/marketing purposes, etc.",
  "data/ph-top/2021/9/english-for-tech.json": "The first modern English textbook for people in tech. ✅ be on the same page with your team and customers ✅ fix pronunciation and grammar mistakes ✅ start speaking English like a native speaker ✅ position yourself on LinkedIn and create an outstanding resume",
  "data/ph-top/2021/9/notion-simple-table-by-helpkit.json": "Easily create simple Notion tables: ✅ Add and remove columns/rows ⬆️ Import fromCSV file ✍️ Bold table headers 🖋 Choose between sans, serif or mono font 📏 Change table padding 🤖 Automatically generates the LaTeX for you 🆓 Oh.. and it's totally free 🤩",
  "data/ph-top/2021/9/open-startup-2-0.json": "OpenStartup™ is a collection of open startups along with their MRR (Monthly Recurring Revenue) we regularly update all open startup numbers.",
  "data/ph-top/2021/9/bigtech-fellowship.json": "There are a ton of future founders currently stuck in big tech companies. Party Round & MainStreet are fixing that with BIGTECH Fellowship, offering big tech company employees $50k to quit their job and build a startup.",
  "data/ph-top/2021/9/saturn.json": "😎 The coolest way to send your files around the world 📩 Share large files and photos for free 💯 Fully decentralized on a blockchain (yes, even the website hosting) 🌐 Connect with Metamask to get more features",
  "data/ph-top/2021/9/inksonic.json": "Inksonic is a subscription-based social media copywriting service with a self-service portal. Users can order posts, download them and ask for revisions instantly from anywhere, anytime. Order posts and our expert writers will create them for you in 48 hours!",
  "data/ph-top/2021/9/cameo-calls.json": "Introducing Cameo Calls, the newest way to video call one-on-one with your favorite stars. The ultimate meet & greet is here. Get a ticket now: https://cmeo.co/Cameo-Calls",
  "data/ph-top/2021/9/coinow-space.json": "Real time price trend chart by Coinow.space Check prices and analyse trends of popular cryptocurrency in real time",
  "data/ph-top/2021/9/handy-components.json": "  There are components, that are to laborious to make each time for a new project, yet they are so frequently used. This plugin will solve it by giving you a list of UI pieces to take with you in any file",
  "data/ph-top/2021/9/nft-net.json": "A cross-platform application developed withNET Core to generate NFT's through a graphical interface. Simple as that, in the best Grab & Go style.",
  "data/ph-top/2021/9/dashbit.json": "Dashbit helps you track your habits in a lightweight and beautiful way. It supports both the calendar and health data to update your progress more easily.",
  "data/ph-top/2021/9/flow-sparrow.json": "Flow Sparrow is a Webflow management service that provides unlimited website updates, revisions, and SEO management. All for a flat monthly rate.",
  "data/ph-top/2021/9/verse-2.json": "Verse™ is a visual programming IDE that provides developers with the ability to use the full range of programming concepts and functionalities using a graph-based interface.",
  "data/ph-top/2021/9/sling-2.json": "With Sling, you can play YouTube's video in the background for free and no ads. Your accounts across various streaming media platforms can be linked to the app. - 🆓UNLIMITED FREE MUSIC 👋NO ADS 🔗SUPPORTS EXTERNAL PLATFORMS 💻PLAY DOWNLOADED MUSIC",
  "data/ph-top/2021/9/opensea-3.json": "OpenSea's mobile app is the easiest way to keep track of your NFT collection and discover new assets from the world’s first and largest digital marketplace for crypto collectibles and non-fungible tokens (NFTs).",
  "data/ph-top/2021/9/kbar.json": "⌘ https://kbar.vercel.app is a fully extensible command+k interface for your site. With macOS's Spotlight, Linear & Vercel's command+k experience in mind, kbar aims to be a simple abstraction to add a fast, beautiful, and extensible command center to any of your projects.",
  "data/ph-top/2021/9/domain-tracker.json": "https://domaintracker.heistio.com/ track registrar, renewal date, accounts email, nameservers, Social media accounts and much more at one place.",
  "data/ph-top/2021/9/codedamn-create.json": "We help creators build and sell truly interactive coding courses that work right from the students' browsers. Build high-quality programming courses for free.",
  "data/ph-top/2021/9/display-nft-collection-on-twitter.json": "View anybody's NFT collection & activity directly on Twitter",
  "data/ph-top/2021/9/messer.json": "The easiest, most convenient, and most native way of converting, resizing, and padding images for social media sites and web development",
  "data/ph-top/2021/9/daily-sales-email.json": "Receive an email each day with revenue, downloads, active subsribers, MRR and more. Best of all, your data is never sold or tracked. Reports are downloaded, parsed, then removed from memory (as a bonus, the raw reports are attached in each email).",
  "data/ph-top/2021/9/whim-social.json": "Whim is a 100% curated mobile app designed around a local news, content, and review community that empowers users to become their best selves in the ever expanding creator economy.",
  "data/ph-top/2021/9/shortcut-keeper.json": "Shortcut Keeper is a simple macOS app that lets you store the keyboard shortcuts you use daily in your apps. Save all the shortcuts you want to learn and remember. Keep it on the side while using your apps and quickly check your saved shortcuts!",
  "data/ph-top/2021/9/image-color-finder.json": "You can either upload your own image or let us choose a random image from the internet to generate to next project's color palette. It will automatically provide you with 6 different colors and their respective color value and name.",
  "data/ph-top/2021/9/vision-personal-okr-tool.json": "Now you can use your favorite goal-setting app right on your Mac! Vision is an app that helps you manage your OKRs - Set your objectives - Set your key results of your objectives - Set tasks, and automatically add records to your key results",
  "data/ph-top/2021/9/ocr-scanner.json": "A Chrome extension to extract and translate text from images. All you need to do is to capture the region you want to translate in your current tab, the extension will then extract the text inside it and translate the text to your preferred language.",
  "data/ph-top/2021/9/myalice-for-woocommerce.json": "Start conversations with customers and sell in the online store, messaging, and social media channels. With MyAlice, anyone can grow their business, build strong customer relationships, and spend less time on support, all from one single dashboard.",
  "data/ph-top/2021/9/nocodeapi-3-0.json": "Save time & money to set up your Google Sheet, Airtable, Google Analytics, Twitter, Telegram, Open Graph API, MailChimp, 50 + apps without any backend.",
  "data/ph-top/2021/9/bukable.json": "It's hard for students currently in the university to get a full-time job to cover the cost of their studies, pay their tuition fees and get more opportunities to build up their skills and become employable for full-time roles after their programs.",
  "data/ph-top/2021/9/co-branded-wallets-cards-by-decentro.json": "Prepaid cards & wallets are simple banking instruments to issue to your customers, agents or partners for digitizing their daily spends. As a business, this gives you full visibility, automation of operations, and generates additional revenue along the way.",
  "data/ph-top/2021/9/jot-11.json": "Jot down thoughts, tasks, lists, notes and ideas quickly. Use \"/\" or \"#\" in-line to determine how everything is categorized or just jot and let the app take care of that for you.",
  "data/ph-top/2021/9/wavier.json": "Generate wavy dividers for your next project with ease! Copy HTML/CSS and you are good to go! 🔥",
  "data/ph-top/2021/9/snippetslab-2-2.json": "SnippetsLab 2.0 brings more than 20 new features and numerous other improvements and bug fixes, including support for Apple Silicon Macs, the ability to customize themes and an option to automatically switch between a light and a dark theme of your choice.",
  "data/ph-top/2021/9/meddify.json": "Meddify is an easy-to-use app that helps users remember to take medications at the right time.",
  "data/ph-top/2021/9/tkinter-designer.json": "Tkinter Designer was created to speed up the GUI development process in Python. It uses the well-known design software Figma to make creating beautiful Tkinter GUIs in Python a piece of cake. It also comes with a CLI to make things more easier.",
  "data/ph-top/2021/9/shiftscreen-4x.json": "Connect you iPad to a monitor and turn it into a full desktop computer! 🖥",
  "data/ph-top/2021/9/how-many-bmws.json": "Tech salaries in India are at an all-time high. Companies are using every trick in the book to hire the best engineers. 🧑🏻‍💻 One such incidence was a company offering BMW bikes as a signing bonus. 🏍️ How many BMWs could you have earned?",
  "data/ph-top/2021/9/laxis.json": "Laxis captures conversations intelligently to make your meetings more productive. Beyond simple transcription, you can personalize templates to extract insights, action items, and key quotes across meetings in Google Meet, Zoom or in-person (and soon Teams).",
  "data/ph-top/2021/9/sorosis-mini.json": "Detect sleep and other health problems, and shake off sleep troubles and bad emotions for good in a quick, safe and affordable way.",
  "data/ph-top/2021/9/feedback-lane.json": "Feedback Lane lets you add a feedback widget to your website that's connected to a Notion table in your workspace. Make it easy for customers to send you feedback, then manage that feedback where you manage your business (Notion!)",
  "data/ph-top/2021/9/switch-1-0.json": "Switch adds a Sidebar to your browser and gives you the tools to switch between your apps, accounts, and workflows in one place. Switch instantly helps you to become more productive ⚡️",
  "data/ph-top/2021/9/viphy.json": "Turn your story into a GIF video with ease. Automatically generate funny GIF videos based on your text input.",
  "data/ph-top/2021/9/surf-7.json": "Surf is a free browser extension that allows you to passively earn rewards for your everyday browsing 🤙 Download today for a chance to win a Tesla Model 3!",
  "data/ph-top/2021/9/tunerelease.json": "TuneRelease provides music promoters with shareable song pages, a contacts manager, email composer and in-depth analytics on engagement complete with exportable CSV reports.",
  "data/ph-top/2021/9/subtitles-downloader-by-checksub.json": "Sometimes you may want to export or edit the subtitling of Youtube videos that you have uploaded or that you're fans of. Before we had the community captions but it’s not available anymore.",
  "data/ph-top/2021/9/shiftscreen-4x-2.json": "Connect your iPad to your monitor and turn your monitor into a second screen for your iPad!",
  "data/ph-top/2021/9/allpapers.json": "Keeping up-to-date with the research literature is not easy. Nowadays, papers in your field are being published faster than you'll ever be able to read them. AllPapers will organize your daily personal feed with your favourite journals.",
  "data/ph-top/2021/9/nocodedevs-chrome-extension.json": "Discover the best #nocode tutorials, tips, tricks, and lessons right in your browser.",
  "data/ph-top/2021/9/mate-translate-ios-safari-extension.json": "Our award-winning Safari translation extension is coming https://gikken.co/mate-translate/mac/ to iOS 15. Mate translates websites automatically. No taps or language selections required.",
  "data/ph-top/2021/9/audio-bites.json": "Create bite sized visual clips using your audio. Upload your audio or video file, choose colors and grab your Audio bite 🍪.",
  "data/ph-top/2021/9/terrace.json": "Terrace lets you generate a login protected site using your Notion docs. Spin up your own membership site or online course in minutes. Just set your Notion URL, create a membership plan and you're ready to launch!",
  "data/ph-top/2021/9/hackerpen.json": "What is HackerPen? It is a collaborative, technical interview platform with real-time feedback. The demo video shows you how to use HackerPen for technical interviews, and practice of technical interviews.",
  "data/ph-top/2021/9/rescuetime-849eebd0-3f22-4c16-b242-4bc6cc14255d.json": "RescueTime helps you protect focused work time, set healthy boundaries, and achieve work/life balance by shedding light on how you spend your time, improving your focus, and helping you find more time for the things that matter most. https://www.rescuetime.com?utm_source=producthunt",
  "data/ph-top/2021/9/nativebase-v3.json": "NativeBase is an accessible, utility-first component library that helps you build consistent UI across Android, iOS and Web. It enables to build responsive, performant & dark-mode enabled websites and native mobile apps with the same code base.",
  "data/ph-top/2021/9/ventroduce.json": "SaaStock events have brought together 1000’s of SaaS founders and investors every year for the last 6 years. This product brings that meeting ground online. It’s a free resource to support SaaS founders by increasing their exposure to best-fit investors\"",
  "data/ph-top/2021/9/changelogs-gallery.json": "Best Changelogs on The Internet Discover amazing companies that maintain a changelog to improve their user engagement, new feature adoption, build a shipping cadence, and do much more...",
  "data/ph-top/2021/9/soundwave-3.json": "Soundwave users post 60-second voice memos to get things off their chest, and find their voice and support in moments of depression and anxiety, in pivotal moments of their life, or to ask deep and personal questions about a wide range of topics.",
  "data/ph-top/2021/9/buzzguru.json": "BuzzGuru helps to easily search and discover the best influencers for your marketing campaigns on YouTube, Twitch & TikTok, research market & competitors, and make business-critical decisions based on data.",
  "data/ph-top/2021/9/meetgeek.json": "Meetgeek enables teams to supercharge their online meetings. 💬 Real-time transcription & note taking 🦾 AI meeting notes 🎙️ Record, transcribe & use voice commands 🔎 Search conversations & track topics 🤲 Share meeting highlights 🌐 Multi-language support",
  "data/ph-top/2021/9/exactbuyer-prospector.json": "Use ExactBuyer’s next-gen prospecting solution to create hyper-targeted audiences 🤝. Quickly identify and analyze your exact buyers to reach the right prospects faster on a plan that scales with your outreach.",
  "data/ph-top/2021/9/memo-8.json": "Memo is a beautiful history-based notes app built with iOS design guidelines in mind. Additions and deletions are automatically stored in the history timeline, which can be scrubbed to travel forwards and backwards in time through the note.",
  "data/ph-top/2021/9/growthbar.json": "GrowthBar is an SEO tool built for marketers and bloggers to discover keywords and write SEO-optimized blog content. GrowthBar’s algorithm uses GPT-3 and large data sets to help you rank higher in Google search.",
  "data/ph-top/2021/9/dark-reader-for-ios.json": "Dark mode for every website on your iPhone and iPad running iOS 15. Choose a dark, dimmed or colorful theme. Take care of your eyes!",
  "data/ph-top/2021/9/smoothie-26e07623-f4da-41c7-9448-3433642ae6bf.json": "Smoothie is a free newsletter that sends founders startup opportunities through visual storytelling. Why visual storytelling? Because typical newsletters are boring. Be on top of emerging opportunities like: DAOs, GPT-3, CRISPR, and Carbon Capturing!",
  "data/ph-top/2021/9/hokusai-api.json": "Hokusai API is an embedded NFT service that enables you to ship your NFT products faster and easier than ever before without knowledge of blockchain. We provide gas free and simple API solutions for minting,transfering, burning and setting royalties for NFTs.",
  "data/ph-top/2021/9/deso.json": "DeSo is a new layer-1 blockchain built from the ground up to scale decentralized social applications to one billion users. Deso powers already over 100 apps including Bitclout.com (a decentralized social network)",
  "data/ph-top/2021/9/spurse.json": "Spurse will be the future of social commerce. Our technology allows users and creators to connect with friends and fans to passively earn money every time they buy.",
  "data/ph-top/2021/9/sorare.json": "Put your football passion to the test. Connect and trade with other fans in our open marketplace.",
  "data/ph-top/2021/9/astrel.json": "Astrel is a web app that allows you to manage any aspects of your application, remotely, in real-time. Check out the message below to unlock a lifetime access to our paid plan for free when Astrel comes out of beta!",
  "data/ph-top/2021/9/noto-4.json": "With this illustrations pack, you can create&nbsp;your own Notion-style avatar. No design skills are required. There are 120+ items to mix and match, including hairstyles, eyes, and many facial&nbsp;expressions. You can create more than a million possible combinations.",
  "data/ph-top/2021/9/kick-2.json": "📱Enjoy our https://apps.apple.com/ru/app/kick-crypto-exchange-wallet/id1532751538?l=en on 30+ top and trending trading pairs! 🚀Use advanced charts and orders to get the most of the crypto market. 💳Buy crypto with Visa or Mastercard. 🔐Bank grade security, 24/7 support!",
  "data/ph-top/2021/9/communyco.json": "Communyco is a creators-only app, where you can find a place to connect with other creators, share your struggles, get advice and tips from your peers, and use cross-platform features to build real and exciting partnerships",
  "data/ph-top/2021/9/voltfm.json": "See your Spotify stats, connect with 125k+ music fans, and discover new music. ⠀ https://volt.fm/?ref=producthunt helps you experience Spotify in a totally new way.",
  "data/ph-top/2021/9/trust.json": "Trust lets you easily create web surveys, collect customer feedback and display it with beautiful widgets on your business websites. No-code solution for you, no-extra-click opportunity for customers to spread their love.",
  "data/ph-top/2021/9/piwik-pro-core.json": "A free analytics software with built-in consent management, tag management and EU-based hosting. - 500,000 actions per month - 14-month data retention & raw data via API - Google Ads & Search Console integration - Compliance with GDPR, LGPD, CCPA and more",
  "data/ph-top/2021/9/linguaroom.json": "Linguaroom’s platform unites all language learners from around the world. Improve your speaking skills and learn any language you want, with whoever you want, and whenever you want. ⠀ Join or create your own room and start practicing with other people.",
  "data/ph-top/2021/9/motion-one.json": "Motion One is a new animation library by the creator of Framer Motion and Popmotion. It's built on the Web Animations API for the smallest bundlesize and hardware accelerated animations.",
  "data/ph-top/2021/9/sst-next-js.json": "Deploy Next.js apps to AWS --- 🚀 Next.js on AWS without limits 🙌 Open source and hosted on your AWS account 🔗 Import all your AWS resources and environment variables",
  "data/ph-top/2021/9/uxcel-2-0.json": "Uxcel is an interactive platform to learn new design skills, assess your knowledge, and connect with designers from around the world. We're offering the Product Hunt community 50% off FOR LIFE Uxcel Pro. Note the discount is automatically applied.",
  "data/ph-top/2021/9/lofi-co.json": "Interact with a catalog of original animated illustrations to create your custom soundscape, mix nature sounds and lofi music or use our suite of productivity tools.",
  "data/ph-top/2021/9/ditto-12.json": "Pick up your work right where you left off! Ditto saves your open tabs, documents, and applications to a workspace. Open, close, and transition between your workspaces in one click.",
  "data/ph-top/2021/9/not-boring-weather.json": "What if you could play the daily weather like you play a song? Scrub through a day and experience the shifts in weather over the course of a day like a timelapse shot.",
  "data/ph-top/2021/9/facesfilm.json": "We found the way to recommend you best matching movies for your mood! You takes selfie, our App analyze your emotional state through your facial expression and get you the list of best matching movies according to your mood. So simple and great, isn't it?",
  "data/ph-top/2021/9/safebase.json": "SafeBase is the interactive security portal to share your security posture, automate access to sensitive compliance information, and subscribe to vendor security program updates.",
  "data/ph-top/2021/9/swadesh-capital.json": "https://www.swadesh.capital/ enables you to compare commercial real estate projects in 🇮🇳 Find the ideal asset to put your money in!",
  "data/ph-top/2021/9/lounge.json": "Lounge is the people-first HQ for remote teams to revive the lost camaderie working in silos with: 👀 Glanceable identity (Org chart & Profiles) 🏆 Async social (Photo & wellness games) 💬 Contextual communication (Voice meetings & Messages)",
  "data/ph-top/2021/9/f-you-pay-me-beta.json": "Made by influencers, for influencers. Compare what other creators are getting paid for similar campaigns and gauge what price you should charge for a brand collaboration using crowdsource data.",
  "data/ph-top/2021/9/noteship-for-mac.json": "Noteship combines notes, todos, and reminders and is based on simple files and folders. It takes a local-first approach, no servers or cloud is involved. Build your own personal knowledge base, journal, or Zettelkasten (incl. backlinks).",
  "data/ph-top/2021/9/internxt-2.json": "Internxt Drive is the world's most secure and private cloud storage service. Powered by military-grade encryption & distributed technology, Internxt ensures that your files remain private. Make the switch to a better Internet, one that respects you.",
  "data/ph-top/2021/9/saas-friends.json": "SaaS Friends is a free-to-join private community exclusively for SaaS founders over $20k MRR (monthly recurring revenue)",
  "data/ph-top/2021/9/nft-pumpkin-carving-crypto-pumpkins.json": "Why another NFT? I have an affinity for pumpkins. Last year I built a contest entitled programming pumpkins. It was enjoyable, so I wanted to step it up a notch this year and create an organic community around Jack O' Lantern NFT's.",
  "data/ph-top/2021/9/routelay.json": "https://routelay.com is a global payment gateway to enable users to buy & sell right within your blockchain app. Instead of having your user to leave your dApp to go buy your coin on an exchange, what if your user could buy it right within your app. Fast. Secure. Reliable",
  "data/ph-top/2021/9/scribe-2-0-2.json": "Automatically create step-by-step guides for any process. Simply hit “record” and Scribe will generate a detailed guide complete with screenshots based on your actions, ready to share with colleagues, customers, and friends.",
  "data/ph-top/2021/9/leanbe.json": "Leanbe is an advanced platform covering 3 major steps in the product development loop: it helps collect user feedback & feature requests, analyzes them to generate a smart, data-driven roadmap, and gives space for interacting with users through notifications.",
  "data/ph-top/2021/9/hookdeck.json": "Hookdeck makes it simple to build and deploy reliable, testable, and debuggable applications that rely on webhooks. We abstract the complexity and technical knowledge required to handle webhooks in production.",
  "data/ph-top/2021/9/vadootv-2-0.json": "Ad-free video hosting and marketing platform for creators and businesses to grow their reach using videos. Upload videos with a single click. Record, manage, share & more.",
  "data/ph-top/2021/9/feeds-mage.json": "We used to read personal blogs every day, little corners of the internet to discover and enjoy authentic voices. Feeds Mage brings back that magic by finding great blogs from your Twitter follows.",
  "data/ph-top/2021/9/actionable-color-palettes.json": "Collection of 30+ color palettes with a site preview.",
  "data/ph-top/2021/9/smart-copy.json": "Smart Copy (previously Snazzy AI) is the easiest way to generate copy for your business. It's our latest product release at Unbounce and represents a big part of our new Conversion Intelligence strategy.",
  "data/ph-top/2021/9/logtail.json": "ClickHouse-based SQL-compatible log management. Log more, pay less.",
  "data/ph-top/2021/9/top-developers.json": "Top Developers is a marketplace of senior developers born to prove that quality and low prices can coexist. We started Top Developers because some brilliant ideas haven't come true due to lack of budget or quality of work.",
  "data/ph-top/2021/9/figsplosion.json": "Figsplosion let's you blow off steam by literally blowing up your Figma designs!",
  "data/ph-top/2021/9/brave-talk.json": "Unlimited, private video calls, right in your browser. No extra apps. No tracking. Just free connections, powered by Brave.",
  "data/ph-top/2021/9/purchasely.json": "Anticipate their needs to attract, retain and win subscribers back at every step. Easily manage in-app payments with stylish paywalls and tests from mobile to streaming TV apps. With no coding needed.",
  "data/ph-top/2021/9/meetingnps.json": "MeetingNPS is a simple and noninvasive app that lets you anonymously rate your meetings. Collect highly actionable data to promote valuable meetings and eliminate the ones that destroy morale.",
  "data/ph-top/2021/9/blobs-2.json": "Introducing Blobs! A pack of 100+ hand-designed vector blobs to make your design projects pop. 100% vector, 100% blobs. Free or pay what you want.",
  "data/ph-top/2021/9/lead-tracking-for-calendly-by-salespanel.json": "Have no idea why someone booked a meeting through the Calendly widget on your website? Salespanel will tell you where a lead came from and what made them book a meeting. Sign up for free!",
  "data/ph-top/2021/9/birth-class.json": "Having a great birth experience shouldn't cost you $3000. – For Beginners – Easy at-home exercises – 3h hours of audio classes – Made by professionals",
  "data/ph-top/2021/9/ig-mass-dms.json": "Seamlessly reach any target audience by using our mass dm software. We can send DM’s to ANY potential customers, through hashtags, geo location, comments, likes or followers.",
  "data/ph-top/2021/9/serpivore.json": "Serpivore is a rank tracker that allows you to track your positions and SERP features on Google. The free plan let you track 20 keywords everyday for 2 domains and 20 competitors. If you need more, paid plans start as little as $4/month for 100 keywords/day.",
  "data/ph-top/2021/9/remnote-3.json": "The note-taking tool for students, researchers, and professionals. Built-in flashcards, PDFs, backlinks, and more - to help you learn, stay organized, and think.",
  "data/ph-top/2021/9/welcome-2-0.json": "Discover the best places from your favorite people. Welcome is your new personalized city guide. It's powered by friends and experts — and made smart by a real time AI.",
  "data/ph-top/2021/9/artifact-3.json": "Artifact centralizes qualitative data into a single source of truth, and uses advanced but proven AI methods to synthesize actionable insights so you can instantly understand what’s most important to your customers.",
  "data/ph-top/2021/9/microcopy.json": "Search micro UX copy text: slogans, headlines, notifications, CTA, error messages, email, account preferences, and much more.",
  "data/ph-top/2021/9/uxsniff.json": "Track user behavior on your website and improve conversions with UXsniff: the user experience watchdog that looks out for you.",
  "data/ph-top/2021/9/stork-2.json": "Your team's workspace that records & transcribes meetings automatically. Stork is a Voice and Video Messenger with a powerful Screen Recording for asynchronous presentations. Fewer meetings. No more missed meetings. Play it all back in Stork.",
  "data/ph-top/2021/9/workflows-by-anvil.json": "Anvil Workflows empowers you to streamline and scale paperwork processes without extra resources. No-code interface for creating dynamic Workflows that handle complex data-collection and PDF forms. Powerful APIs and Zapier support for customized integration.",
  "data/ph-top/2021/9/vocal-5.json": "Easy to use Chrome extension to send audio messages in Gmail. Like you would in WhatsApp, iMessage, or Telegram. Send messages up to 1-minute long for free!",
  "data/ph-top/2021/9/not-boring-calculator.json": "As a kid, I loved playing with calculators. Whether a calculator watch or a TI-89, it offered an intoxicating command over impossibly large numbers & could be hacked to share messages with friends. But somehow the calculator became another boring tool.",
  "data/ph-top/2021/9/riya-collective.json": "Riya Collective makes it easy to buy or rent for your next Indian wedding. Shop directly from designers in India and get custom fit pieces for your next event. https://riyacollective.com/",
  "data/ph-top/2021/9/pando-3.json": "Platform to set up & manage income pooling agreements for collectives. The members will agree to give a small portion of their future earnings into a common pool that will be distributed evenly. If somebody succeeds, everyone in the collective is benefiting",
  "data/ph-top/2021/9/lmaoo.json": "Send your favorite videos and request a blind reaction from as many friends as you want. If a reaction video *really* hits, you can share it on TikTok, Instagram or anywhere else right from the app.",
  "data/ph-top/2021/9/all-hands-figma-plugin.json": "The All Hands Collection is now a Figma plugin! Drop your designs into one of several hands in two easy steps. Simply choose your frame, choose a hand, and voilà, you have a beautiful (and inclusive) mockup to show off your work. 👇👇 https://www.figma.com/community/plugin/951652764251042235/All-Hands-Mockup-Generator-%7C-MetaLab-x-Nappy",
  "data/ph-top/2021/9/waterdo.json": "WaterDo is the most fun to-do list made by the team of《Forest》 In the world of \"WaterDo\", your schedule become bouncy Water Balls. Pop them after you've completed your tasks and enjoy the wonderful sensation of seeing them burst!",
  "data/ph-top/2021/9/primary-6.json": "Primary is a free browser extension that finds forum & Reddit info while you shop. It collects zero personal info. Brought to you by Threadloom. Available for Chrome/Edge/Brave, Safari, and Firefox.",
  "data/ph-top/2021/9/product-hunt-digest.json": "A simple open-source product that generates a daily digest of top performing products on Product Hunt directly to your Slack.",
  "data/ph-top/2021/9/promotab.json": "This tiny tool uses a real Gmail account to check if your emails will land in the Primary inbox of a reader or if it's stuck in the promotions tab or SPAM folder.",
  "data/ph-top/2021/9/train-fitness.json": "Automatically track your workout at the gym - hands free! Train Fitness uses the motion of your Apple Watch to track 82+ exercises. Save your history, view stats, and share your workouts with friends!",
  "data/ph-top/2021/9/amplosion-f1c47f66-d2fd-4310-bfd5-176a192fe573.json": "Google's AMP links are super annoying. Inconsistent, often broken pages, mangled, long links to share, more user tracking. Bleh. Amplosion on iOS 15 fixes this by automatically blocking AMP pages and redirecting to the normal version. And it's open source!",
  "data/ph-top/2021/9/majorgig.json": "Download the MajorGig app to discover, follow and tip your favorite performers. Check-in to local shows and share your experience using photos, videos, and venue ratings. We make it easy to support the performers you love wherever they are performing.",
  "data/ph-top/2021/9/moft-smart-desk-mat-3.json": "An adjustable desk mat featuring modular design enables you to organize your workspace that helps you stay focused and comfortable. In the mat, two NFC hotspots are embedded. Each can be customized to personal preference with a wide range of apps.",
  "data/ph-top/2021/9/hey-cafe.json": "Hey.Café is a social network built around communities called cafés. Using the social network requires beans you can earn more based on the time you are on the app.",
  "data/ph-top/2021/9/beatmatch.json": "Have you&nbsp;ever wondered how strong your bond is with someone? Your music taste is the best way to tell if you're on the same wavelength or not. Try quizing your friends, family members, or significant other through music to find out who knows you the best!",
  "data/ph-top/2021/9/nft-schedule.json": "NFT Schedule is the best source for seeing all the best upcoming NFT drops! Have you ever missed an NFT drop because you didn't know it was coming out? Well not anymore! You can get NFT schedule on our site, Chrome extension, newsletter, Twitter and Telegram.",
  "data/ph-top/2021/9/posemy-art.json": "PoseMy.Art is an online free posing tool for artists. The tool let's you pose 3D figures to create reference for your drawings. The tool features a huge animations and poses library to help you find inspiration. I hope this tool helps you in your art journey!",
  "data/ph-top/2021/9/speedy-flowchart.json": "For developers to be able to draw flowcharts, convert them into text files and add them into there code or readme quite quickly.",
  "data/ph-top/2021/9/gamerpower-2-0.json": "GamerPower is all about helping you find, track and collect the best giveaways in gaming! From free games to beta keys to free in-game items and currency for your favorite games and more, you won't miss out on a single freebie with GamerPower by your side!",
  "data/ph-top/2021/9/gotu.json": "GOTU app is a free, anonymous connection and support space for sexual assault survivors, survivor supporters and advocates.",
  "data/ph-top/2021/9/tikbuddy.json": "TikBuddy help creator get full insights on TikTok, so that make sure to create trending content, make videos viral. User can search hot resources, compare and track creators and videos, and more.",
  "data/ph-top/2021/9/remote-team-3.json": "Remote.Team - online platform for managing team workflows and customer requests: private and public tasks/topics/surveys, activity statistics, guest access, livechat for the site, smart notification system, etc. Write to support for a 50% OFF, 6 months",
  "data/ph-top/2021/9/increaze.json": "The all-in-one human-action marketing app for LinkedIn. IncreaZe offers both Pods & automation ! We help LinkedIn users to automate prospecting efforts, grow audience, develop network, and generate business leads.",
  "data/ph-top/2021/9/thread-hunt-2.json": "Twitter is biased. It only shows content from the top creators. Follower count is a poor measure of quality. We find 5 great Twitter threads from undiscovered creators, across topics, & deliver them straight to your inbox every Tuesday.",
  "data/ph-top/2021/9/inflow.json": "Inflow’s self-help app provides support to help you: 📚 Learn how to better manage your ADHD through short daily exercises. 🎯 Implement new skills and integrate habits into your daily routine. ❤️ Connect with others in our safe and stigma-free community.",
  "data/ph-top/2021/9/pareto-security.json": "Pareto Security is a checklist app that helps you with basic security hygiene on your Mac. It gently nudges you to take care of 20% of security tasks that prevent 80% of problems. Get Product Hunt coupon codes in the first comment!",
  "data/ph-top/2021/9/playform.json": "Harness the power of artificial intelligence to expand your imagination and productivity, without learning how to code.",
  "data/ph-top/2021/9/vos.json": "We built VOS to help people get better at being themselves. It’s a wellbeing companion to come back to for feel-good tools and personal analytics putting your mental health in context. Powered by expert research and AI.",
  "data/ph-top/2021/9/animated-backgrounds.json": "This is a collection of some impressive animated backgrounds created by various coders on Codepen. With Animated Backgrounds, you can easily set a simple, beautiful background animation on your websites and blogs.",
  "data/ph-top/2021/9/170-free-illustrations-420-assets.json": "170 Free isometric illustrations available as PNG & SVG files. 420+ AI asset files available to create infinite possibilities. 🔥",
  "data/ph-top/2021/9/switch-11.json": "Switch helps Shopify stores earn more money through price A/B testing. They can determine the right price to earn the highest revenue. Big eCommerce firms, like Amazon, use price A/B testing for their in-house products daily and thus earn more.",
  "data/ph-top/2021/9/goodbrief-3-0.json": "GoodBrief is a random generator for design briefs. Choose the type of creative work and the industry, and goodbrief will generate a unique brief. You can use it for practice, to improve your skills, and to build your portfolio with lots of impressive projects.",
  "data/ph-top/2021/9/influenced.json": "Influenced lets you organize your recommendations to make it easy for followers to shop your favorites. 🛍",
  "data/ph-top/2021/9/context-note.json": "Context Note is a free chrome extension that help you take notes on the web with their context. With the context, we could understand and recall the details of the notes better while reviewing. A handy tag system is also provided to manage the notes neatly.",
  "data/ph-top/2021/9/momo-board.json": "MOMO BOARD is created to help bring people together and collaborate efficiently with one another, by combining message board, chat and cloud storage (10 Gb) into one seamless application for efficient community communication.",
  "data/ph-top/2021/9/unicorner.json": "Unicorner is the startup newsletter that breaks down and sends one up-and-coming early-stage startup to your inbox every Monday morning. We tell you about innovative giants like Netflix, Uber, and Airbnb before they make it big.",
  "data/ph-top/2021/9/on-fire-2.json": "Free illustrations that will wake any project up with its unique mood. Say «YES» to mind-blowing design. There are 20 unique scenes created in 2 color styles. Compatible with Figma, Sketch, and Adobe Illustrator. ",
  "data/ph-top/2021/9/things-2-1.json": "Morflax things is an online 3D device mockup builder. It's perfect tool to present your design or build marketing resources. More than 100 pre-designed templates that you can customize, and it will definitely make your life easier.",
  "data/ph-top/2021/9/compute-manager.json": "Save money using this native macOS app by knowing exactly how much your EC2 instances cost at any given moment and manage them. You can use S3 as your personal dropbox, with drag/drop file uploads and S3 object browser.",
  "data/ph-top/2021/9/ideacrush.json": "Find experts to challenge your startup idea. Use the wisdom of others to skip on bad ideas and find the one to be a unicorn.",
  "data/ph-top/2021/9/mr-carve-m1.json": "Turn any space into high-quality workshop with a compact & versatile laser engraver with 50+ times higher accuracy and 20+ faster speed.",
  "data/ph-top/2021/9/leon-4.json": "LEON gives managers at high-growth SaaS startups the Playbooks and data they need to develop high-performing teams with low turnover.",
  "data/ph-top/2021/9/cold-email-guide.json": "Get FREE tactical advice in 11 pages of no-bs content. See 16 real-life examples across many industries. Learn from 40 case studies on real businesses from idea-phase to scaling-phase.",
  "data/ph-top/2021/9/smarty-2.json": "You’re the hero, Smarty’s the sidekick. Work faster with your AI powered personal assistant right in the browser. Manage your calendar, automate if/then recipes, use natural language commands and so much more. Power up with Smarty!",
  "data/ph-top/2021/9/chamjo.json": "Chamjo is a library that provides you more than 500+ screenshots or patterns of underrated Asia-based apps with search and filter capabilities. It allows you to discover and be inspired by this enormous collection of patterns.",
  "data/ph-top/2021/9/mantis.json": "Mantis is a live-audio chat widget which can be embedded into any website with two lines of code. It's primarily intended for sales and support, and can be used to quickly answer site visitor questions and learn more about user needs.",
  "data/ph-top/2021/9/vidbites.json": "Skip the resume and cover letter by using video applications. Ask a question that applicants answer via video shot directly from your website. Keep track of everything, view submissions, and customize how it all looks on Vidbites.",
  "data/ph-top/2021/9/picalette.json": "Picalette is a simple, useful tool to get a nice color palette from anything that comes to your mind. Just type what you’re thinking or looking for (coffee, ocean, fun, mountain, desert, etc.), hit enter, and let the magic happen!",
  "data/ph-top/2021/9/workadventure-2.json": "Feel empowered with hybrid teams Connect, collaborate & have fun with your team regardless of where you are. WorkAdventure’s mission is to accelerate the transition to hybrid work. We create virtual offices, host digital events, and provide virtual campuses.",
  "data/ph-top/2021/9/linksup-2-0.json": "Create a mobile storefront for your Instagram, TikTok & other social media & monetize your audience through video calls, livestreams, digital products & more without worrying about payments, delivery, scheduling or invoicing.",
  "data/ph-top/2021/9/caricaturer.json": "https://caricaturer.io is an online caricature photo maker. It could produce 64 different caricature photos from your portraits based on AI technology. It may take some time but deserves the waiting. You can sign up an account to receive the notification email.",
  "data/ph-top/2021/9/topia-2-0.json": "Topia combines playful world-building & encrypted video chat. It works on every device & browser. Create your own worlds, customize endlessly, host 10k+ people at once, buy/sell art, earn commissions, and more. Bring people together with Topia.",
  "data/ph-top/2021/9/textlab-2.json": "TextLab is the fastest way to format, prettify, transform, hash, encode, and decode your data instantly! Don't copy/paste your data to random online tools.",
  "data/ph-top/2021/9/tape-it.json": "Tape It is a recording app for musicians, songwriters and producers. With stereo recording and a beautiful user interface full of smart and well thought-out features, Tape It is here to help you focus on what you do best: making music.",
  "data/ph-top/2021/9/noir-2.json": "Noir is a Safari extension for iOS (15) that automatically adds a dark mode to every website you visit. It makes browsing the web at night so much better.",
  "data/ph-top/2021/9/stark-for-mac-beta.json": "Making your products accessible just got a lot easier. The new Stark Mac app streamlines accessibility compliance, saving your team time, money, and effort through end-to-end collaboration",
  "data/ph-top/2021/9/smooth-sharp.json": "Making logos for your startup can be time-consuming, costly, and takes mental energy. These resources can be spent on your product instead. Pick a logo that matches your brand, it's got every version you'll need. Source files included for max customization.",
  "data/ph-top/2021/9/beam-3929b985-bd77-4344-b518-bc5659cc100a.json": "Beam is an internal Youtube for your company.&nbsp; We turn your video calls into asynchronous video you can watch back later, getting your team aligned and in-the-know like never before.",
  "data/ph-top/2021/9/the-gmail-book-by-nethunt.json": "Organise, secure, and surface data efficiently. Automate input-heavy sales processes easily. Grow organically. Use technology right under your nose to take the sales strain from your shoulders. Learn how to use Gmail in a way that you never thought possible.",
  "data/ph-top/2021/9/neo-3-0.json": "Askneo 3.0 now allows for automated scripts by SMS! Personalize sales and marketing with no-code automation, and close deals faster! Reduce your sales cycle and increase repeat sales with SMS automation. Join our movement and spread good vibes by SMS :)",
  "data/ph-top/2021/9/community-gallery-by-pandadoc.json": "The PandaDoc Community Gallery is like no other. It features an array of beautiful templates created by our customers and partners for their business. Users can browse a selection of our favorite templates and easily make them their own - in just a few clicks.",
  "data/ph-top/2021/9/xsplit-presenter.json": "XSplit Presenter adds personality, flair, and interactivity to your existing presentations and works with all your favorite video call platforms.",
  "data/ph-top/2021/9/function-store.json": "Functions Store is a marketplace of reusable, expert-built, and well-tested Cloud Functions. You can easily search, configure, and install Cloud Functions without ever having to write a line of code. Our goal is to build reliable software 100X faster!",
  "data/ph-top/2021/9/dropbox-capture-2.json": "Try Dropbox Capture, now in beta. Get your message across with screenshots, GIFs, or simple videos recorded right on your screen. So you can clearly say what you mean without scheduling anything. Try it free at https://www.dropbox.com/capture.",
  "data/ph-top/2021/9/temp-mail-3.json": "Giving away your real email address when using the Internet is not always the best choice, Get your temporary email for free in just seconds. 🔒 Fully encrypted 😎 Anonymous 🚀 Unlimited and free",
  "data/ph-top/2021/9/postalytics.json": "Postalytics is direct mail marketing software. It allows marketers to send personalized direct mail using self-service software that works with a nationwide network of printers. We'll help you design, print, mail, and track every direct mail that's sent.",
  "data/ph-top/2021/9/qwstrs.json": "QWSTRS is a social platform where you can play non-linear games or create your own. QWSTRS has love stories, mysteries, quizzes, trivias, horror stories, thrillers... And you can create your own games using the QWSTRS editor. No coding necessary.",
  "data/ph-top/2021/9/ecomsolid.json": "EcomSolid is a no-code visual editor for Shopify so businesses can deliver amazing online buying experiences to their customers. 🙌 Theme & page templates for easy setup 🚀 Boost conversion with addons 🤩 Mix & match sections and layouts.. and more!",
  "data/ph-top/2021/9/masked-emails-in-1password.json": "Taking control of your privacy and keeping your email private is now as easy as generating a strong password. Create masked email addresses without ever leaving the sign-up page. Available to everyone with both https://1password-onboarding.fastmail.dev/signup1password/ and https://start.1password.com/sign-up/family?c=FASTMAIL&utm_medium=social&utm_source=producthunt&utm_campaign=maskedemail accounts.",
  "data/ph-top/2021/9/openvscode-server.json": "Run the latest VS Code on a remote machine accessed through a modern web browser - from any device, from anywhere. The open-source project is officially backed by GitLab, VMware, Uber, SAP, RStudio, Sourcegraph and many others.",
  "data/ph-top/2021/9/99avatars.json": "At 99avatars.com you can manually create and download an avatar but there's also an API where you can request them for integrating it into a service. For example, giving new users their first individual face. More variety will be added shortly!",
  "data/ph-top/2021/9/the-transparency-company.json": "We built a free tool to find out if a business has fake positive reviews on Google Maps. You can use our website, or Chrome Extension. We've scanned 100k+ Google listings in the USA and will have 1 million+ listings scanned worldwide by 2022",
  "data/ph-top/2021/9/unison-video.json": "Looking for a video platform where you can host unlimited videos with custom branding and marketing messages? https://unison.video is here to save the day. Get 50% off our paid plans forever with promo code \"ProductHunt\" (offer expires September 30th)",
  "data/ph-top/2021/9/sniffly.json": "Sniffly is a virtual rehab program for people who have lost their sense of smell and taste from COVID-19. The program includes smell training exercises that are compiled by medical professionals and a smell diary for self-assessment.",
  "data/ph-top/2021/9/angellist-stack.json": "AngelList Stack lets you effortlessly create a fundraising-ready startup. Incorporation, Banking, Equity Management, Fundraising, and Hiring in one place.",
  "data/ph-top/2021/9/stoa-2.json": "Stoa combines the ancient philosophy of Stoicism with mindfulness meditation in a practical meditation app. Join thousands by using it to practice the Stoic disciplines and becoming calmer, more resilient, and virtuous.",
  "data/ph-top/2021/9/perform.json": "Perform's AI-powered music workouts respond to real-time inputs like heart rate and pace to improve exercise. Trained on nearly 100k workouts and 1M song listens, Perform knows the right song for every moment of your workout to maximize results.",
  "data/ph-top/2021/9/ideaonce.json": "IdeaOnce is a FREE Graphic Designing platform that helps both professional and non-designers create amazing designs easily and quickly. https://design.ideaonce.com",
  "data/ph-top/2021/9/letterhunt.json": "LetterHunt connects you to 10,000+ niche, active newsletter writers to promote your product. Find and partner with newsletters in your niche and unlock a new avenue for marketing your product/service. Newsletters are categorized along with engagement stats 🙌",
  "data/ph-top/2021/9/usersnap-2.json": "Usersnap is a customer feedback software to increase feedback from your users, as well as centralize issues and requests. Ship better product features with insights from user screen recordings and satisfaction mini-surveys. Get started within 20 minutes 🚀",
  "data/ph-top/2021/9/hyperweb.json": "Hyperweb magically enhances the web as you browse in Safari, automatically blocking ads, dismissing popups and suggesting smart alternatives to the page you're on. Hyperweb runs 100% locally on device and suggested enhancements are ever growing.",
  "data/ph-top/2021/9/railway.json": "Made for any language, for projects big and small. Railway is the cloud that takes the complexity out of shipping software.",
  "data/ph-top/2021/9/punchlist.json": "The feedback layer for all your creative work. ⠀ Share one url, and watch all content and design changes added in real time, directly on your work. ⠀ Works with ⠀ 💻 Live websites 🌄 Images 📁 PDFs ⠀ Unlimited projects, comments, & collaborators ⠀ Free forever",
  "data/ph-top/2021/9/ponicode-cli.json": "Faster software development, more robust code & high code coverage directly from your command line are now possible thanks to AI. Generate unit tests in bulk for your TS, JS & Python projects with the most relevant test scenarios. Keep bugs under control 🎉",
  "data/ph-top/2021/9/airtable-invoice-maker.json": "Isn't it boring to create invoices? Save your time, aim for your goal and focus on what you're good at! Airtable Invoice Maker lets you create professional quote & invoice PDFs super fast. A must have for freelancers and small agencies.",
  "data/ph-top/2021/9/marketmuse-free.json": "MarketMuse is a content intelligence platform that sets the standard for content quality. Our AI-powered platform accelerates your content research, creation, and optimization process so you can publish faster and fearlessly.",
  "data/ph-top/2021/9/dhiwise-2.json": "DhiWise is a ProCode platform that helps you instantly generate clean, scalable & customizable code of Node.js, Android, iOS, Flutter, Laravel & React Admin Panel that is production-ready to build web, native & hybrid apps with a few high-level inputs.",
  "data/ph-top/2021/9/no-code-app-builders-comparison.json": "Extensive comparison chart of the best no-code app development platforms. Bubble, Webflow, Glide, Thunkable, Adalo, Bildr, or Wappler - which one is a perfect fit for your project? Find out!",
  "data/ph-top/2021/9/hyper-2c2cd9da-80f6-4119-bb63-ac09a99a813d.json": "Use Hyper to turn your online community into a business. 💵 Sell access to Discord servers and Telegram groups 🥇 Create multiple products for different roles 🔗 Generate purchase links with flexible pricing Get started in under five minutes at hyper.co.",
  "data/ph-top/2021/9/start-3.json": "With Start, you can launch and run a US business from anywhere in the world. We handle all your back office operations: LLC formation, registered agent, EIN, business bank account, monthly bookkeeping, accounting and taxes (prep, filing, payment).",
  "data/ph-top/2021/9/reel-5.json": "Tease your podcast episodes on your social media accounts with eye-catching videos and attract new listeners. Add subtitles to your podcasts.",
  "data/ph-top/2021/9/streak-mail-merge-for-gmail.json": "The best way to send personalized mass emails with follow-up sequences: ✨ automatically send follow-ups with recipients who don't reply 👋 looks and feels personal ⚠️ smart alerts 🔋 optimize for replies 🏠 lives entirely inside Gmail",
  "data/ph-top/2021/9/clipt.json": "Clipt seamlessly and safely transfers text, photos, videos, and files between your devices by connecting your phone & laptop clipboard. You shouldn't be punished for having more than one device - install Clipt and watch your productivity soar.",
  "data/ph-top/2021/9/ipnote.json": "Use iPNOTE intellectual management platform and marketplace to get trademarks and patents, while saving up to 90% of your legal budget!",
  "data/ph-top/2021/9/height-5378b770-9fd1-4fca-ae73-a4e02d6531a0.json": "Height is a project management tool for your whole team. - Task lists to keep your team synced - Chats to keep conversations about work in one place - Lightning fast with Cmd-K, custom shortcuts, and jump to - Integrations to automatically update tasks",
  "data/ph-top/2021/9/discovery-by-publicfast.json": "Discovery by Publicfast is an automated solution to search through categories, hashtags, keywords, locations to find results 10x faster to find your perfect creators and influencers.",
  "data/ph-top/2021/9/flowrift.json": "Flowrift is a library made of beautifully designed Tailwind CSS UI blocks. All blocks work with Tailwind CSS' default configuration. Go big or go small: Stack blocks on top of each other to build full-page layouts, or selectively copy small code snippets.",
  "data/ph-top/2021/9/onetask.json": "With onetask, you can label AI training data on large-scale yourself. We combine Weak Supervision and Active Learning, so that you can easily find patterns in your data and only label records by hand that need human cognition.",
  "data/ph-top/2021/9/flyyer.json": "Flyyer is a SaaS, CDN and development toolkit that enables people to manage, preview and automate their website's link previews before they are shared on social media. Expect CTR increase by 57% and make better decisions with sharing analytics.",
  "data/ph-top/2021/9/financial-freedom-calculator.json": "Financial independence is the dream. Based on your savings and monthly expenses, how close are you to making it? Or what should your goal be? Find out with this free calculator from Maybe!",
  "data/ph-top/2021/9/yc-interviewer.json": "Are you ready for an interview with investors? Practice your speech anywhere and figure out what your superpower is 💪🏻 Designed for the interview process at YC startup accelerator. Made with ❤️ in Ukraine 🇺🇦",
  "data/ph-top/2021/9/tokyo-degenerates.json": "The Tokyo Degenerates are a premium collection of 10,000 unique anime style digital collectibles living on the Ethereum blockchain. Our ultimate goal is to create an anime series featuring each collectible and distributing the series as NFTs.",
  "data/ph-top/2021/9/mini-course-generator.json": "1. Create a mini-course super-fast with various content types 2. Get its link to share in your social network and embed in your website hassle-free 3. Present your mini-course without any need for a username and password to start impressing your audience",
  "data/ph-top/2021/9/kaspr.json": "Get access to your prospects’ phone numbers and email, instantly. Convert leads with real data and save time. We find 2 times the amount of phone numbers in comparison to our competitors!",
  "data/ph-top/2021/9/lightstep-incident-response.json": "Lightstep Incident Response is the newest incident response platform, built to keep your team two steps ahead of uptime threats. Proactively minimize incidents and build long-term service resiliency so your team can innovate faster and release confidently.",
  "data/ph-top/2021/9/getitout.json": "Build a strong marketing foundation to attract your ideal clients: Easily create buyer personas, turn features into benefits, and generate websites and emails - complete with texts and layout, in your design. Ideal for marketing freelancers and startups.",
  "data/ph-top/2021/9/etherfly-by-the-explorers-beta.json": "📲 Download EtherFly Beta on iOS 🦋 Explore a 3D World where EtherFly NFTs are displayed with a direct link to their OpenSea page 🪐 EtherFly is part of The Explorers, a next-gen online metaverse where you explore, Play-to-Earn and have fun with your friends.",
  "data/ph-top/2021/9/tactiq-2-0.json": "Tactiq 2.0 transcribes Google Meets & Zoom Web calls, then creates notes for you 🙏 v2.0 + auto-highlights & auto-summaries + time-stamped transcripts w/ speakers + Meeting engagement + Notion, Quip, Dropbox, Slack & more + Spanish, French, German, Portuguese",
  "data/ph-top/2021/9/embeddinghub.json": "Embeddinghub is an open-source vector database for machine learning embeddings. Most modern machine learning is built atop embeddings, and Embeddinghub is built from the ground up to get your ML models out of the lab and into production.",
  "data/ph-top/2021/9/appfollow-7-0.json": "AppFollow gives you the tools to turn customer reviews into customer satisfaction for your app. It automatically segments your & your competitors’ feedback into useful categories & metrics that product & marketing can use to build a better app & drive growth.",
  "data/ph-top/2021/9/getacquired-startup-marketplace.json": "GetAcquired is the modern marketplace for buying & selling startups. Powered by OpenAI, our listing editor gets you to market in minutes. Access 2 years worth of listings data. Our Advisor Marketplace helps you build your deal team. Free for Sellers & Buyers.",
  "data/ph-top/2021/9/storiesonboard-feedback-management.json": "StoriesOnBoard Feedback Management gathers product feedback from customers, users & your team into a single repository and organizes them for you based on rules you create.",
  "data/ph-top/2021/9/compete-2.json": "Compete empowers HR & Finance leaders in tech with immediate insights into complete compensation package data. Trusted by hundreds of the leading tech companies, Compete takes the guess out of guesswork with real-time benefit benchmarks compared to the market.",
  "data/ph-top/2021/9/voicl.json": "With Voicl you can easily embed voice notes onto your website. Engage with your users in a much more personal way, provide content summaries, extra information and CTA's - using your OWN voice!",
  "data/ph-top/2021/9/driwwwle.json": "Driwwwle is an open-source social platform for developers to showcase their projects and meet creative developers across the globe. Create a free account to gain more visibility for your projects, meet new developers, and get inspired.",
  "data/ph-top/2021/9/product-superstories.json": "Product Superstories by The Product Folks & Amplitude is a collection of untold stories filled with insights from decades of product experience at Microsoft, Amazon, Booking & more. It uncovers interesting aspects of a product manager's journey. Happy reading!",
  "data/ph-top/2021/9/mutiny-3-0.json": "Mutiny is a no-code AI platform that gives B2B marketers everything they need to personalize their website and convert the 99% of traffic that bounces — from identifying visitors to AI-powered recommendations and content writing.",
  "data/ph-top/2021/9/nft-header-for-twitter.json": "A free tool that automatically updates your Twitter profile header to show new NFTs in your wallet ✨ Choose one of our designs, customize it, or create your own template!",
  "data/ph-top/2021/9/designing-growth.json": "Join other founders and get weekly, curated startup design & growth insight delivered straight to your inbox.",
  "data/ph-top/2021/9/reflect-2-0.json": "Reflect is a no-code, cloud-based platform for creating end-to-end tests. It's the fastest way to create and maintain end-to-end tests for your web app.",
  "data/ph-top/2021/9/optic-hub.json": "Plug and play cable of optic fiber can be ordered in flexible length from 1 to 300 meters. &nbsp;OPTICHUB is the perfect solution to any digital signal situation at home, office, campus, command center, monitoring room, editing studio or others.",
  "data/ph-top/2021/9/product-studio-session-templates.json": "Meet the Product Studio Session Template, the most time-saving way to ensure the product will match the real users’ needs. There are 9 templates for a smooth product idea overview, that help you create a step-by-step plan to bring your product to the market.",
  "data/ph-top/2021/9/metasapiens-nft.json": "MetaSapiens is the world's first Augmented Reality NFT project for Apple iOS.",
  "data/ph-top/2021/9/haekka.json": "Train your employees in Slack. Haekka is a modern training platform for people that love Slack. Bring your own training content or choose from our growing library.",
  "data/ph-top/2021/9/face-on.json": "Face on allows you to put your face on anything to pitch your idea in any video chat.",
  "data/ph-top/2021/9/nextdrop.json": "NextDrop is the best resource to discover all upcoming NFT projects on Ethereum, Solana, and other chains. Visit the website or subscribe to the newsletter to receive every day a list of upcoming drops. Postlaunch? Hourly stats for hundreds of projects!",
  "data/ph-top/2021/9/nfts.json": "No need to know any technical stuff to be able to use NFTs! • Share NFTs that are in your wallet in a beautiful way • Browse the most popular, trending or recently sold NFTs • View your NFTs in AR mode • Learn about NFTs with the Help section"
}