{
  "data/ph-top/2022/5/live-stream-polls.json": "An interactive tool to engage your audience. Easily customize a poll with predefined answers to get fast responses from viewers. Users use comments or FB reactions to vote, while the results are calculated in real-time and presented with cool visualizations.",
  "data/ph-top/2022/5/expplore.json": "Explore is a powerful Facebook™ Ads intelligence tool that allows you to target hidden Facebook™ Ads interests by using the latest AI-enabled technology that your competition is not aware of, and create massive ROI on every ad campaign!",
  "data/ph-top/2022/5/array-builder.json": "A free tool to visualize the output of array operations Provide an array, write code inside map/reduce/filter blocks & see the results live in the adjacent column. It simplifies writing blocks of code & debugging chained operations",
  "data/ph-top/2022/5/leadmonk.json": "First online appointment booking software in the market which lets your customers book time with you using their mobile number or email address without the back-and-forth emails or messages.",
  "data/ph-top/2022/5/snipli.json": "Ever wanted to share a file of your codebase and had to copy and paste the content and create a new GitHub gist? Presenting Snipli, a minimal command-line interface to create GitHub gists of your local files at blazing fast speeds ⚡",
  "data/ph-top/2022/5/weavit.json": "We suffer from information overload in a world filled with noise and yet we need to surface knowledge 'fast'. With so many productivity apps out there - why are none able to capture thoughts messily and organise them intuitively? Well...say hello to Weavit.",
  "data/ph-top/2022/5/outcode-2.json": "Outcode is a data platform for your team. Its databoard enables you to work with data and workflow components directly from any data source in a flexible, integrated, and collaborative manner.",
  "data/ph-top/2022/5/the-digital-dogs.json": "Digital Pets are interoperable, persistent-State, NFT-secured companions, utilizing AI technologies to improve people's mental health and well-being in Virtual environments, inspired by real-life Dogs' social and emotional benefits for human beings.",
  "data/ph-top/2022/5/product-strategy-of-a-great-saas-product.json": "Learn how successful SaaS products of this decade disrupted the market with their product strategies. 💡&nbsp; Learn the 3 elements of a product strategy 🛠 &nbsp; Know about the best practices in defining your strategy 🌱 Product strategy of the company",
  "data/ph-top/2022/5/no-code-builder.json": "No-Code builder is a tool built for solopreneurs, dreamers and builders who have ideas that they want to execute but can’t find the right tools to build on. Use this tool so that you spend less time thinking and more time building.",
  "data/ph-top/2022/5/tableful-2.json": "Tableful is an application designed primarily for frontend developers who want to connect their application to a backend or some database, but do not want to waste time developing a backend.",
  "data/ph-top/2022/5/storekeep-io.json": "Store Keep provides 100% Colorado based mom and pop style support for your customers.",
  "data/ph-top/2022/5/monse.json": "When I decide to control my money, I tried a lot of methods and none of them worked for me. I want to save money and control my expenses (and all my wealth actually) without having to spend hours every week, that's why I created monse.",
  "data/ph-top/2022/5/evergrow-2.json": "Evergrow gives you websites with traffic. Describe your business, generate your site, define your customers, and launch a campaign to connect with them faster than ever before.",
  "data/ph-top/2022/5/fig-food-scanner-discovery.json": "Create your “Fig” from 2,500+ options – whether you’re gluten free, allergic to cashews, and/or intolerant to citric acid. You can then browse food that matches your needs at 100+ grocery stores and analyze ingredient labels in <1 second – for free.",
  "data/ph-top/2022/5/breadcrumbs-reveal.json": "Clarity around your ideal customer profile drives better leads and more conversions. Reveal ingests and analyzes data from Hubspot, Salesforce, Marketo, and more to unearth 1) what data can be trusted and 2) what attributes are the best predictors of revenue.",
  "data/ph-top/2022/5/contentrain.json": "Contentrain is a Git-based Headless CMS that was focused on developer and content editor experience which is provide seamless integration with Jamstack web apps. Save your collection templates, use for another projects later or share them to the community!",
  "data/ph-top/2022/5/contember.json": "Contember puts you in control. Create an administration interface and data structure tailored to your project. Enjoy GraphQL API, role-based access control, authentication and a well-structured PostgreSQL database. Built by developers for developers.",
  "data/ph-top/2022/5/ramen-club-2.json": "The community getting you to ramen profitable, and beyond.",
  "data/ph-top/2022/5/bookmark-pro.json": "Having trouble managing content from different sources (links, articles, blogs, websites..)? Take advantage of Bookmark PRO: the fastest way to save your favorite links, organize them effortlessly and access them in one tap.",
  "data/ph-top/2022/5/brand-guidelines-hub.json": "Content Harmony’s mission is to help content marketers do their job better. With that goal in mind, we’re releasing our internal brand guidelines as a Creative Commons resource. It includes our voice & tone, editorial guidelines, style guide, and more.",
  "data/ph-top/2022/5/projector-foundation.json": "Millions of Ukrainian women lost their jobs when Russia invaded Ukraine. We are launching a Foundation to raise money and help women study to get started on a creative or tech junior position.",
  "data/ph-top/2022/5/centered-groups.json": "Centered Groups connect you with your friends & teammates while keeping you in the zone. Get your ToDo’s done in a featured Group or create your own where you can take breaks together. Whether you are working on the same thing or not, go further...together.",
  "data/ph-top/2022/5/mypath-ai.json": "MyPath.ai assesses users' unique skills & interests to build a custom-fit career path using AI. Design your career, discover your career path.",
  "data/ph-top/2022/5/kazm-explorer.json": "Kazm supercharges communities of the future. We organize web3 data to make it universally accessible and useful, and help projects acquire, engage, and reward members. Our Explorer is step one - bringing context and discoverability to everything on-chain.",
  "data/ph-top/2022/5/1password-8-for-mac.json": "Easily manage logins, sensitive documents, and everything else you need to stay safe online. Featuring an all-new design, Quick Access, and Universal Autofill, 1Password 8 for Mac integrates more deeply with macOS than ever before.",
  "data/ph-top/2022/5/the-ultimate-startup-hiring-guide.json": "We put this e-book together as part of our mission to help companies find their next great hires. It contains data, research and best practices from personal experience and our work helping hundreds of startups close top talent since launching Dover in 2019.",
  "data/ph-top/2022/5/apic-agent.json": "APIC Agent is a fast and free user-agent lookup API that detects Browser, OS, and other device attributes from the user-agent string. Used by 1000+ users with an uptime of 99.99% and avg response time of 15ms, it helps you know more about your users.",
  "data/ph-top/2022/5/coso-by-splice.json": "CoSo is the AI-assisted app that serves up Complementary Sounds from across the vast Splice catalog, so creators can make music using samples that belong together—from every style, key, and bpm.",
  "data/ph-top/2022/5/the-best-social-media-tools.json": "Social media marketing is no longer an option but a necessity for any brand or marketer who wants to succeed. Here is a list of the most useful social media tools that you need to succeed in social media marketing.",
  "data/ph-top/2022/5/scrollex.json": "Scrollex is a react library built on top of framer-motion that makes it super simple to build elaborate scroll experiences. Scrollex lets you add scroll keyframes to elements defining the scale/translation/rotation/etc for each scroll position.",
  "data/ph-top/2022/5/statusflow.json": "Status reporting shouldn't take you hours. - Endlessly chasing your team for updates. :( - Searching chat, email, slides & spreadsheets. :( - Arranging meetings to get what you need. :( Statusflow lets you build collaborative reports fast.",
  "data/ph-top/2022/5/folk-3.json": "folk is the next-generation CRM: a collaborative workspace for all your team's relationships. ⚙️ Centralize all your contacts in one place. 🗂 Organize your contacts into groups and build actionable views. ⚡️ Activate your contacts as a team. 👉 https://www.folk.app/",
  "data/ph-top/2022/5/magik.json": "Magik brings everything your team needs to do their best work and build your Digital HQ, inside Slack.Directory, Library, Supersearch, Workflow Automation & so much more, natively in Slack.",
  "data/ph-top/2022/5/tinystacks.json": "Build, operate and scale your backend on AWS 1. Build prod-ready infrastructure with CI/CD, security, auto-scaling 2. Operate with transparency without the weeds 3. Scale with stages and ephemeral stacks 4. Evolve your architecture with the full cloud catalog",
  "data/ph-top/2022/5/codesandbox-for-ios.json": "CodeSandbox for iOS lets you take your projects and sandboxes with you wherever you go. Using an iPhone or iPad, you can now access our new cloud development platform in the comfort of a native iOS IDE.",
  "data/ph-top/2022/5/map-the-force-within-you.json": "The New York rebel base is attacked! https://nextbillion.ai/NexBillion.ai Star Wars Day map lets you find the fastest Starship & route to the New York base. Share with your friends and find out who can respond to the distress call first. May the 4th be with you!",
  "data/ph-top/2022/5/octopus-2-8.json": "Octopus.do, a lightning-fast visual sitemap builder and website planner with lo-fi wireframes. Build, plan, visualize your website structure and create content in real-time. Improve your site architecture, UX design and SEO.",
  "data/ph-top/2022/5/zink.json": "Zink is an easy way to receive micro-donations (from $0.05) for what you create or share on the internet.",
  "data/ph-top/2022/5/ipreview.json": "This App solves the problem that some files cannot be previewed in macOS Quick Look, and provides many practical functions, such as Code Highlighting, Markdown & Jupyter rendering preview, etc. Help you greatly improve the macOS experience and work efficiency.",
  "data/ph-top/2022/5/expense-club.json": "Set of tools to monitor and manage the cash inflow and cash outflows.",
  "data/ph-top/2022/5/crypto-index-fund-simulator.json": "Simulate investments in a wide range of crypto themes (DeFi, NFTs, Blue Chip) using a selection of premade crypto index funds!",
  "data/ph-top/2022/5/stripe-financial-connections.json": "Stripe Financial Connections lets your users securely share their financial data with you. Integrate once to retrieve financial data and use it to streamline payments, reduce fraud, underwrite risk, and build new products.",
  "data/ph-top/2022/5/charthop.json": "ChartHop Basic helps companies build the foundation for a more informed, empowered, and connected organization through the org chart, manager and employee tools, and more. It’s totally free for your first 150 employees, and setup takes minutes.",
  "data/ph-top/2022/5/supermeme-ai.json": "Supermeme.ai is an AI meme generator for serious meme creators to promote their personal or professional brand. We enable marketing teams and individuals who are serious about their meme marketing game by removing the friction in the meme creation process.",
  "data/ph-top/2022/5/track-4.json": "Schedule meetings effortlessly. Advanced natural language based event creation and sharing availability. Unlimited & Customisable booking links. Multiple accounts & support for timezones.Group voting and schedule while using Whatsapp, LinkedIn, iMessage",
  "data/ph-top/2022/5/open-stickers.json": "Open Stickers – big pack of playful illustrations in lovely and peaceful mood. Get them to bring a shiny feeling to your website or app. 100% free for commercial use. Compatible with Figma, Sketch, Adobe Illustrator.",
  "data/ph-top/2022/5/skill-focus.json": "Choose your focus in Skill Focus. 5 types of users for different tasks: Free, Expert, Product academy, Online School, Corporate University Watch, create and promote your educational content in one place. Use special features for creators and users https://skill-focus.com/product_hunt",
  "data/ph-top/2022/5/storii.json": "Record your family's most precious memories with just a phone call. 📞 Receive 3 life story phone prompts a week (or call-in whenever) 🎤 Recorded answers are transcribed and shared with family ✍️ Download recordings or add custom prompts at any time!",
  "data/ph-top/2022/5/laxis-ai-meeting-assistant.json": "With Laxis you can transcribe and record in person and hybrid meetings, highlight important notes with a single click, and save everything to Laxis Cloud to unlock for advanced features, including insight management, AI-augmented memos and advanced search.",
  "data/ph-top/2022/5/tweetify.json": "This tool allows you to generate beautiful images from any Tweet, just paste a link, edit its style as you wish and download it as a PNG file to share it anywhere.",
  "data/ph-top/2022/5/venture-capital-careers.json": "Discover the best https://venturecapitalcareers.com/ near you. Find the latest VC jobs, internships, fund overviews, and more on https://venturecapitalcareers.com/ then filter by location or job type and subscribe to get new VC jobs in your inbox, for free.",
  "data/ph-top/2022/5/product-adoption-academy.json": "Product Adoption Academy is a growing collection of free certification courses to help boost your user activation and retention. The best part: when you complete a course, you’ll get a LinkedIn badge and a chance to win a $1,000 Airbnb gift card!",
  "data/ph-top/2022/5/craft-cms-4.json": "Craft is a flexible, user-friendly CMS for creating custom digital experiences on the web and beyond, and the next major version is now out.",
  "data/ph-top/2022/5/art-diario.json": "Meet Art Diario (that second part is Spanish, dee-arr-ee-o!) A simple MacOS app that changes your wallpaper to a new piece of hand-curated art each day. Everyone sees the same art, so you can talk about it with your friends!",
  "data/ph-top/2022/5/gyana-2.json": "Gyana makes it easy to bring your data together and build custom reports. It’s all point and click, never breaks and has a generous free tier. No more manual exports, #N/A nightmares or stale data.",
  "data/ph-top/2022/5/ditto-2-0.json": "We’ve rebuilt Ditto from the ground up to handle your team’s copy from idea to design to development.💡 ❤️ With Ditto, you can start writing content, and then sync it with mockups in Figma or directly over to development when you're ready.",
  "data/ph-top/2022/5/kaedim-api.json": "Within your app, enable your end-users to upload their 2D inspiration and easily create their own 3D content for customising and populating the game.",
  "data/ph-top/2022/5/blob-animation.json": "Generate Blob Animation For Your Website/Design.",
  "data/ph-top/2022/5/simpledm.json": "A collection of 200+ tools and resources that will level up your digital marketing game. - Stock Images - Illustrations - Color Tools - Design Inspiration",
  "data/ph-top/2022/5/tocoway.json": "Tocoway helps startups generate more leads with high conversion landing page from marketing, design and sales experts. ✅ Marketing Oriented (like in startup unicorns) ✅ Impressive Design (like in Pixar cartoons) ✅ Flexible to Change (with subscription plan)",
  "data/ph-top/2022/5/layoffs-fyi.json": "Tracking all tech startup layoffs since COVID-19. Data is compiled from public reports.",
  "data/ph-top/2022/5/honter.json": "Connecting creative freelancers with potential new clients in a fun and creative way.",
  "data/ph-top/2022/5/snailbox.json": "Email can be a huge distraction. Schedule your email at specific times and recover the time you're losing to your inbox. When it's time to \"do email\", all your messages show up in one batch. You knock them out all at once instead of interrupting your flow..",
  "data/ph-top/2022/5/tandem-shower.json": "The Tandem Shower adds a second showerhead to the opposite side of the shower so no one is left out in the cold. It's easy to install for renters and homeowners alike and comes in three colors.",
  "data/ph-top/2022/5/reshaped.json": "Reshaped is a professionally crafted design system for everyday product development in React and Figma. Usually, you have to set up a million things before you even start working on UI. We took care of it so you can skip your first year of development.",
  "data/ph-top/2022/5/layer-ai.json": "Layer helps you create production-grade ML pipelines with a seamless local↔cloud transition while enabling collaboration with semantic versioning, extensive artifact logging and dynamic reporting.",
  "data/ph-top/2022/5/cowello.json": "Software that enables you to operate your business with confidence--and with our tailored booking options, your members can schedule the space they need, when they need it most. Say goodbye to wasted space and hello to new revenue opportunities with CoWello",
  "data/ph-top/2022/5/freshenv.json": "A command line application to build and develop your projects in completely isolated environments. Save, switch and restart your environments. Choose from a variety of flavors to get the developer tools you need.",
  "data/ph-top/2022/5/aptlearn.json": "With a mission to improve lives through learning, aptLearn is an online learning platform that helps learners gain on-demand tech skills they need to compete in today’s economy and acquire professional certificates at a fraction of the cost and time.",
  "data/ph-top/2022/5/eleventy.json": "A simpler static site generator. An alternative to Jekyll. Written in JavaScript. Transforms a directory of templates (of varying types) into HTML. Works with HTML, Markdown, JavaScript, Liquid, Nunjucks, Handlebars, Mustache, EJS, Haml, and Pug.",
  "data/ph-top/2022/5/rayli.json": "Ever wanted to create an image of your code and had to visit some sort of website? Presenting Rayli, a minimal command-line interface tool to generate images of your code at lightning speed. So that you can get 'em in your terminal itself!",
  "data/ph-top/2022/5/getcam.json": "The best webcam with Magic Touch that automatically shows you in the best exposure and colors! Easy one-time installation of computer drivers and you are ready do use iPhone cameras on Zoom, Skype, or any other computer video communicator.",
  "data/ph-top/2022/5/opengrph.json": "OpenGrph is lightweight canvas to create cover image & open-graph images for your blogs, videos for free. Features: ❤️ 21 elegant looking font pairs ✨ 88 background patterns 🎖️ 3 themes, 2 modes ⚽ draggable elements 📥 download images in png",
  "data/ph-top/2022/5/thread-reader-3.json": "Thread reader helps to read Twitter threads productively as never before without any distraction. Using thread reader you can convert your long Twitter threads to blogs easily by exporting all text just with a click.",
  "data/ph-top/2022/5/sizzzle.json": "Sizzzle&nbsp;is a free review, social, and ordering platform that connects customers with local food trucks. See updated locations, discover your favorite trucks from personalized recommendations, and order online.",
  "data/ph-top/2022/5/landa.json": "Buy shares of rental properties, earn monthly income, and watch your money grow. ⠀ Landa is designed to make real estate investment accessible for everyone — investing is simple, transparent, quick, and all from your phone.",
  "data/ph-top/2022/5/auditzy.json": "A first-in-class application provides an easy-to-use web page audit platform to technical and non-technical users. Now you can monitor your website Performance, SEO, PWA, Accessibility, Security Vulnerability, and Technology without any hassle and in seconds.",
  "data/ph-top/2022/5/nook-calendar.json": "Our goal isn’t to simply build a better-looking calendar app. We want to free up people’s time, so high-performing teams can focus on what actually matters. Sync calendars, use Calendly-like features, coordinate work locations, and quickly create events.",
  "data/ph-top/2022/5/startup-101.json": "TL/DR: Curated startup lessons for entrepreneurs who are looking to start a company as well as those in the process of building one. This app will automatically update with new lessons every month.",
  "data/ph-top/2022/5/link-whisper-2-0.json": "Link Whisper version 2.0 is a WordPress plugin that speeds up the process of internal linking that can help you rank better in Google. Get smart link suggestions, in-depth reporting, and quickly take control of the link structure across your entire site.",
  "data/ph-top/2022/5/learn-html-css.json": "Semantics and accessibility have been frequently neglected on the web. This interactive platform guides you step by step into learning modern HTML CSS that is semantic and accessible.",
  "data/ph-top/2022/5/it-tools.json": "IT Tools is a free and open-source collection of handy online tools for developers & people working in IT. It includes a token generator, case converter, base converter QR code generator, Git cheatsheet, lorem ipsum generator,.. and many more !",
  "data/ph-top/2022/5/easyjobs.json": "Making job applications faster so that you have more time to focus on what’s important! Free Chrome extension and dashboard for job applications. Find relevant job postings and apply with just one click. Automatically manage and track applications.",
  "data/ph-top/2022/5/gravity-b3653e60-e1de-4725-95c9-6ad4930d7f50.json": "Gravity allows you to call functions defined in your server directly in your client. It is a modern back-end framework that can integrate with your front-end like Svelte, React, Solid and Vue.",
  "data/ph-top/2022/5/marqly.json": "Marqly lets you save, customize and manage all your bookmarks and highlighted texts online like a breeze.",
  "data/ph-top/2022/5/klutch-app.json": "Internal knowledge base for your team. Klutch is for teams that want to collaborate and organize company information, save time on repetitive questions, and onboard new team members.",
  "data/ph-top/2022/5/iter8.json": "We’ve rebuilt feature release monitoring for high-performing Product Managers. Iter8 is lightweight and fast. Its advanced features make you powerful. Drag & drop charts. Proactive insights. Automate stakeholder reports. Request access: https://www.iter8app.com/",
  "data/ph-top/2022/5/b2b-linkedin-strategy-ebook.json": "Many businesses struggle with consistent content creation on LinkedIn. So here is a cheat sheet! This is an eBook that will make your life easier with chapters such as: - 1-month content plan strategy - themes and content ideas - hashtag strategy and more!",
  "data/ph-top/2022/5/kolona.json": "A monthly subscription to support Ukrainian defenders introduced by PMs from Wise, Tumblr, Bolt, Readdle and other product companies.",
  "data/ph-top/2022/5/indx-2.json": "INDX is a focused place for self-directed learning. Easily save podcasts, articles, and videos and leverage powerful curation/community features to discover your next read or listen from a friend. We like to think of INDX like Pinterest but for learning.",
  "data/ph-top/2022/5/paper-xyz.json": "Paper provides commerce infrastructure for selling NFTs. Use their simple APIs or developer SDK to: 💳 accept credit cards for NFT purchases ✨ accept cross-chain crypto (i.e. use ETH to buy SOL NFTs) 👛 create non-custodial wallets authenticated by email",
  "data/ph-top/2022/5/veryfront.json": "Build web apps with your team right in the browser, share live previews, and deploy with one click. Enjoy ready-made UI components and integrations and say goodbye to infrastructure chores. Release unique experiences in no time and have fun coding again.",
  "data/ph-top/2022/5/ronron.json": "RonRon (purr in French) provide a great meditation experience using high quality audio and haptic on the iPhone in order to simulate a cat purring on you. Use it for having a heartwarming moment, or after a stressful day. We wish you a great purr session!",
  "data/ph-top/2022/5/topline-resumes.json": "Are you not getting interviews after applying online? Do you want to identify the right skills for the resume? Topline Resumes will highlight the in-demand missing skills for you.",
  "data/ph-top/2022/5/prepintech.json": "Platform where you can practice Mock Interviews with your peers. Schedule Interviews with your peers and experts in the tech industry. Do check it out and provide your valuable feedback !! https://prepin.tech - 1:1 Interviews You Never Had",
  "data/ph-top/2022/5/2022-q1-global-vc-benchmark-report.json": "TheVentureCity's VC Benchmark report is live today! Check it out for an in-depth review of all the notable #VC activity in Q1 across the US, Europe, and LatAm.",
  "data/ph-top/2022/5/the-juked-esports-app.json": "Juked is a community for esports fans that makes it easy to join the conversation and follow your favorite games, teams, and leagues in a less toxic environment than Twitch chat or Twitter.",
  "data/ph-top/2022/5/acapela.json": "Capture, filter and action all your work communication from one single tool. Imagine Inbox Zero not just for email...but for Slack, Notion, GitHub, Figma, Jira, Linear and more. Fewer interruptions, less FOMO, more time for Deep Work.",
  "data/ph-top/2022/5/pages-by-scribe.json": "Scribe automatically creates step-by-step process guides. Now, with Pages, add your guides to a custom process document alongside text, lists and video. Create beautiful onboarding guides, training materials, SOPs and more — in minutes!",
  "data/ph-top/2022/5/feeda.json": "Feeda is how to find out what users really want from your product - so you can make better decisions and save time on development.",
  "data/ph-top/2022/5/custom-macos-icon-pack.json": "Unify your dock with this macOS icon pack. Get 46 beautiful replacement app icons that are easy to install on macOS 🤟🏼",
  "data/ph-top/2022/5/reskript-2.json": "Say goodbye to switching platforms👋 and cover the entire team workflow with ReSkript. From task management to docs collaboration, we got you🦾 💙Other features you’ll love: •Integrated chat •Team Projects •Easy import/export features",
  "data/ph-top/2022/5/carbonfact.json": "Carbonfact digests the latest environmental science to measure and compare the carbon footprint of apparel and footwear products. Submit an item link at http://www.carbonfact.com/request and we will email you our analysis.",
  "data/ph-top/2022/5/motion-devtools.json": "Motion DevTools is a Chrome extension that speeds up your animation design and development. Use a classic timeline interface to inspect, edit and export animations made with CSS or Motion One.",
  "data/ph-top/2022/5/shopify-merchants-developers-matcher.json": "Need to develop an e-commerce website? At WeLoveNoCode (WLNC) we offer an all-in-one solution to set up your store for success with just no-code! Get matched with vetted Shopify experts on the WLNC platform and get your store built 10x faster and cheaper!",
  "data/ph-top/2022/5/diversity-wiki.json": "The #1 one-stop website for Diversity, Equity and Inclusion (DEI) users and providers. Discover and connect with networks and organizations. - 2000+ Initiatives from all over the world - Use powerful filters to save time - Write comments in our community",
  "data/ph-top/2022/5/arnica.json": "Software supply chain attacks have caught the security community off-guard. Arnica, starting with GitHub & Azure DevOps, addresses the two primary root causes: 1) 🪄 excessive permissions to developer tools 2) 🥸 lack of abnormal behavior detection",
  "data/ph-top/2022/5/calendly-routing-forms.json": "Calendly Routing Forms lets you request information from website visitors upfront and automatically present specific scheduling options based on their answers. Deliver a great customer experience and create higher quality connections with Routing Forms!",
  "data/ph-top/2022/5/vessel-4.json": "Vessel is your passport for the internet. Explore the web without creating dozens of passwords or seed phrases. Manage your digital identity and crypto assets in a single secure browser extension that gives you seamless access to sites and apps.",
  "data/ph-top/2022/5/b2b-local-leads-directory.json": "B2B Leads Directory allows you to search for contacts among millions of local businesses. Find emails, phones, and other information about your ideal customers. Create leads databases for your marketing campaigns for cold outreach.",
  "data/ph-top/2022/5/quicktools-by-picsart.json": "For the first time ever, Picsart is making some of its world-class editing tools available for free. Creating transparent backgrounds for images, trimming videos, and converting file types -- do it all with Quicktools.",
  "data/ph-top/2022/5/commands-dev.json": "Commands.dev is a curated collection of popular terminal commands. -Search for hard to remember terminal commands by tag, description, and title -Share commands with teammates and friends -Contribute to an open source repo of commands that show up on the site",
  "data/ph-top/2022/5/zario-digital-wellbeing.json": "Zario is a digital wellbeing platform that helps you live a more digitally balanced life. Our goal is to reduce and replace your undesired screentime and cultivate healthy habits. ⠀ 🧠 Psychology backed concepts 🎮 Gamified challenges 🎯 More focus and control",
  "data/ph-top/2022/5/offers-by-aeqium.json": "Building your company starts with hiring. With Offers by Aeqium, craft eye-catching, interactive offer letters to help candidates understand their total compensation. Leverage your comp bands, past offers, and market data to make informed comp decisions.",
  "data/ph-top/2022/5/magic-retouch-by-photoroom.json": "Thanks to our Magic Retouch, you can now remove any unwanted detail from a photo effortlessly (POOF!), in only two seconds. Paint over the unwanted objects of your image and let Photoroom work its magic. This tool is available on IOS, Android and on the web.",
  "data/ph-top/2022/5/invoice-maker-by-saldo-apps.json": "Invoice Maker is a comprehensive solution for creating invoices, estimates, reports, receiving payments, and running a business. Thanks to it, you can create forms, fill out templates, send paperwork to clients, and accept payments wherever you are.",
  "data/ph-top/2022/5/nawvel.json": "Nawvel is a library updated by modern day librarians and synthesizers. We spend 1000s of $$$ on resources and 1000s of hours on researching quality resources to save you time.",
  "data/ph-top/2022/5/lyric-video-maker-by-videobolt.json": "With this product update, you can easily create visually stunning lyric videos using templates designed by some of the world’s top video designers. Videobolt's video platform has already attracted over 1,000,000 content creators from 174 countries."
}