{
  "data/ph-top/2022/7/avid-fm.json": "Just want to teach but annoyed by the hassle in making video courses? AVID creators do it all with audio, and validate ideas via crowdfunding before production. Plus, learners achieve up to 16x better results!",
  "data/ph-top/2022/7/cleanmymac-x-menu-app.json": "Meet an all-new CleanMyMac X Menu App that aims to increase the longevity of your Mac with the help of five detailed health monitors. Get instant information about your Mac’s storage, state of protection, CPU performance, RAM, and battery.",
  "data/ph-top/2022/7/superflow.json": "We're building the biggest library of styled Webflow components. No need to clone any template, instantly copy and paste a component into your project and customize it to apply your branding.",
  "data/ph-top/2022/7/thanks-app-for-slack.json": "Built for Slack, Thanks is a recognition app to appreciate your fellow team and community members. Build a culture of appreciation, and incentivize your people to help each other. With Thanks, never forget to thank your co-workers or fellow community members.",
  "data/ph-top/2022/7/kleanmail-free-email-verifier.json": "KleanMail, an AI-driven cloud-based email validation tool, enables maintenance of good IP & domain reputation while significantly reducing costs and boosting email deliverability.",
  "data/ph-top/2022/7/flywheel-2.json": "FlyWheel is a Slack Superbot that makes the life of community managers easy. It provides intelligent analytics about community members and lets them automate everyday tasks. It also allows you to respond to all queries straight from the dashboard.",
  "data/ph-top/2022/7/internxt-send.json": "Internxt Send is an encrypted file-sharing service that allows you to securely share files with online. Anonymously send large files to anyone for free. Internxt Send is a product of privacy company Internxt.",
  "data/ph-top/2022/7/flashlist-for-react-native.json": "Lists are a pain in RN. They can be a perf nightmare and who likes blank cells? Today, FlashList offers: - Up to 5X FPS in UI Thread - Up to 10X FPS in JS Thread - Easy migration We've already shipped it in some of our apps & we're excited for you to try it!",
  "data/ph-top/2022/7/jd-generator.json": "Turn your drab JDs into powerful JeDis! Our AI algorithm generates high-quality job descriptions to help businesses identify the right skills for a job, stand out and attract the best talent. SAVE up to 90% of your time by creating professional JDs for FREE!",
  "data/ph-top/2022/7/google-password-manager.json": "Strong, unique passwords are key to helping keep your personal information secure online. Google Password Manager can help you create, remember and autofill passwords on your computer or phone: on the web in Chrome, and in your favorite Android and iOS apps.",
  "data/ph-top/2022/7/signaturepro.json": "Learn how to sign beautifully with SignaturePro. We will help you create an amazing signature for yourself and teach you how to write it in 30 minutes, even if your handwriting is bad!",
  "data/ph-top/2022/7/podnotes-io.json": "This tool uses artificial intelligence to create engaging show notes, blog posts, episode titles, social captions, and transcriptions! The tool allows you to quickly create content from local files, a descript link, or simply by searching for a podcast!",
  "data/ph-top/2022/7/everyone-draw.json": "An infinite canvas for people all over the world to collaborate on pixel art. Sixteen colors, endless possibilities.",
  "data/ph-top/2022/7/bravo-2.json": "BRAVO is a truly personalized recognition & reward system that helps employees feel appreciated & motivated everyday. With BRAVO’s detailed analytics & reporting feature, you can see who’s winning more & who needs a little boost to shine for the next project.",
  "data/ph-top/2022/7/notific-2.json": "Notific is a multi-chain, multi-platform notification service for your crypto wallets (Ethereum and polygon). Users can get real-time updates of their wallet activity right on WhatsApp and Telegram.",
  "data/ph-top/2022/7/60-pretty-random-illustrations.json": "Find detailed illustrations across animals, plants, food, transport, fiction, and even isometric for you next project. Be it video, decks, branding, letterheads, or motion graphics, we've got you covered!",
  "data/ph-top/2022/7/sales-os.json": "A kick-ass and aesthetic sales management system that centralizes all your clients, orders & products into your digital workspace.",
  "data/ph-top/2022/7/batchable.json": "Batchable lets you run large-scale human tasks with 5 clicks. It's the best way to orchestrate hundreds of global workers around: ✅ Complex data entry ✅ Phone calls (i.e. with phone trees, dialers, IVRs, etc) ✅ Data extraction from PDFs, CSVs, & documents",
  "data/ph-top/2022/7/terminal-gif-maker.json": "Terminal Gif Maker is a tool for creating code samples in the terminal interface. You can create gifs for your projects and you can show that in the README of your project. You can use the GIF in git providers like Github and Gitlab.",
  "data/ph-top/2022/7/journey-6.json": "Journey helps you achieve your personal goals through a simple three-minute morning routine that fits into every schedule and will make your days feel more intentional, more productive, more in-control.",
  "data/ph-top/2022/7/gameflip-2.json": "Gameflip is a marketplace for over 6M gamers to buy and sell digital items. We’re bridging the gap between developers, publishers, and gamers in emerging blockchain technologies, positioning Gameflip to make blockchain-based games accessible for everyone."
}