{
  "data/ph-top/2022/5/live-stream-polls.json": "An interactive tool to engage your audience. Easily customize a poll with predefined answers to get fast responses from viewers. Users use comments or FB reactions to vote, while the results are calculated in real-time and presented with cool visualizations.",
  "data/ph-top/2022/5/expplore.json": "Explore is a powerful Facebook™ Ads intelligence tool that allows you to target hidden Facebook™ Ads interests by using the latest AI-enabled technology that your competition is not aware of, and create massive ROI on every ad campaign!",
  "data/ph-top/2022/5/array-builder.json": "A free tool to visualize the output of array operations Provide an array, write code inside map/reduce/filter blocks & see the results live in the adjacent column. It simplifies writing blocks of code & debugging chained operations",
  "data/ph-top/2022/5/leadmonk.json": "First online appointment booking software in the market which lets your customers book time with you using their mobile number or email address without the back-and-forth emails or messages.",
  "data/ph-top/2022/5/snipli.json": "Ever wanted to share a file of your codebase and had to copy and paste the content and create a new GitHub gist? Presenting Snipli, a minimal command-line interface to create GitHub gists of your local files at blazing fast speeds ⚡",
  "data/ph-top/2022/5/weavit.json": "We suffer from information overload in a world filled with noise and yet we need to surface knowledge 'fast'. With so many productivity apps out there - why are none able to capture thoughts messily and organise them intuitively? Well...say hello to Weavit.",
  "data/ph-top/2022/5/outcode-2.json": "Outcode is a data platform for your team. Its databoard enables you to work with data and workflow components directly from any data source in a flexible, integrated, and collaborative manner.",
  "data/ph-top/2022/5/the-digital-dogs.json": "Digital Pets are interoperable, persistent-State, NFT-secured companions, utilizing AI technologies to improve people's mental health and well-being in Virtual environments, inspired by real-life Dogs' social and emotional benefits for human beings.",
  "data/ph-top/2022/5/product-strategy-of-a-great-saas-product.json": "Learn how successful SaaS products of this decade disrupted the market with their product strategies. 💡&nbsp; Learn the 3 elements of a product strategy 🛠 &nbsp; Know about the best practices in defining your strategy 🌱 Product strategy of the company",
  "data/ph-top/2022/5/no-code-builder.json": "No-Code builder is a tool built for solopreneurs, dreamers and builders who have ideas that they want to execute but can’t find the right tools to build on. Use this tool so that you spend less time thinking and more time building.",
  "data/ph-top/2022/5/tableful-2.json": "Tableful is an application designed primarily for frontend developers who want to connect their application to a backend or some database, but do not want to waste time developing a backend.",
  "data/ph-top/2022/5/storekeep-io.json": "Store Keep provides 100% Colorado based mom and pop style support for your customers.",
  "data/ph-top/2022/5/monse.json": "When I decide to control my money, I tried a lot of methods and none of them worked for me. I want to save money and control my expenses (and all my wealth actually) without having to spend hours every week, that's why I created monse.",
  "data/ph-top/2022/5/evergrow-2.json": "Evergrow gives you websites with traffic. Describe your business, generate your site, define your customers, and launch a campaign to connect with them faster than ever before.",
  "data/ph-top/2022/5/fig-food-scanner-discovery.json": "Create your “Fig” from 2,500+ options – whether you’re gluten free, allergic to cashews, and/or intolerant to citric acid. You can then browse food that matches your needs at 100+ grocery stores and analyze ingredient labels in <1 second – for free.",
  "data/ph-top/2022/5/breadcrumbs-reveal.json": "Clarity around your ideal customer profile drives better leads and more conversions. Reveal ingests and analyzes data from Hubspot, Salesforce, Marketo, and more to unearth 1) what data can be trusted and 2) what attributes are the best predictors of revenue.",
  "data/ph-top/2022/5/contentrain.json": "Contentrain is a Git-based Headless CMS that was focused on developer and content editor experience which is provide seamless integration with Jamstack web apps. Save your collection templates, use for another projects later or share them to the community!",
  "data/ph-top/2022/5/contember.json": "Contember puts you in control. Create an administration interface and data structure tailored to your project. Enjoy GraphQL API, role-based access control, authentication and a well-structured PostgreSQL database. Built by developers for developers.",
  "data/ph-top/2022/5/ramen-club-2.json": "The community getting you to ramen profitable, and beyond.",
  "data/ph-top/2022/5/bookmark-pro.json": "Having trouble managing content from different sources (links, articles, blogs, websites..)? Take advantage of Bookmark PRO: the fastest way to save your favorite links, organize them effortlessly and access them in one tap.",
  "data/ph-top/2022/5/brand-guidelines-hub.json": "Content Harmony’s mission is to help content marketers do their job better. With that goal in mind, we’re releasing our internal brand guidelines as a Creative Commons resource. It includes our voice & tone, editorial guidelines, style guide, and more.",
  "data/ph-top/2022/5/projector-foundation.json": "Millions of Ukrainian women lost their jobs when Russia invaded Ukraine. We are launching a Foundation to raise money and help women study to get started on a creative or tech junior position.",
  "data/ph-top/2022/5/centered-groups.json": "Centered Groups connect you with your friends & teammates while keeping you in the zone. Get your ToDo’s done in a featured Group or create your own where you can take breaks together. Whether you are working on the same thing or not, go further...together.",
  "data/ph-top/2022/5/mypath-ai.json": "MyPath.ai assesses users' unique skills & interests to build a custom-fit career path using AI. Design your career, discover your career path.",
  "data/ph-top/2022/5/kazm-explorer.json": "Kazm supercharges communities of the future. We organize web3 data to make it universally accessible and useful, and help projects acquire, engage, and reward members. Our Explorer is step one - bringing context and discoverability to everything on-chain.",
  "data/ph-top/2022/5/1password-8-for-mac.json": "Easily manage logins, sensitive documents, and everything else you need to stay safe online. Featuring an all-new design, Quick Access, and Universal Autofill, 1Password 8 for Mac integrates more deeply with macOS than ever before.",
  "data/ph-top/2022/5/the-ultimate-startup-hiring-guide.json": "We put this e-book together as part of our mission to help companies find their next great hires. It contains data, research and best practices from personal experience and our work helping hundreds of startups close top talent since launching Dover in 2019.",
  "data/ph-top/2022/5/apic-agent.json": "APIC Agent is a fast and free user-agent lookup API that detects Browser, OS, and other device attributes from the user-agent string. Used by 1000+ users with an uptime of 99.99% and avg response time of 15ms, it helps you know more about your users.",
  "data/ph-top/2022/5/coso-by-splice.json": "CoSo is the AI-assisted app that serves up Complementary Sounds from across the vast Splice catalog, so creators can make music using samples that belong together—from every style, key, and bpm.",
  "data/ph-top/2022/5/the-best-social-media-tools.json": "Social media marketing is no longer an option but a necessity for any brand or marketer who wants to succeed. Here is a list of the most useful social media tools that you need to succeed in social media marketing.",
  "data/ph-top/2022/5/scrollex.json": "Scrollex is a react library built on top of framer-motion that makes it super simple to build elaborate scroll experiences. Scrollex lets you add scroll keyframes to elements defining the scale/translation/rotation/etc for each scroll position.",
  "data/ph-top/2022/5/statusflow.json": "Status reporting shouldn't take you hours. - Endlessly chasing your team for updates. :( - Searching chat, email, slides & spreadsheets. :( - Arranging meetings to get what you need. :( Statusflow lets you build collaborative reports fast.",
  "data/ph-top/2022/5/folk-3.json": "folk is the next-generation CRM: a collaborative workspace for all your team's relationships. ⚙️ Centralize all your contacts in one place. 🗂 Organize your contacts into groups and build actionable views. ⚡️ Activate your contacts as a team. 👉 https://www.folk.app/",
  "data/ph-top/2022/5/magik.json": "Magik brings everything your team needs to do their best work and build your Digital HQ, inside Slack.Directory, Library, Supersearch, Workflow Automation & so much more, natively in Slack.",
  "data/ph-top/2022/5/tinystacks.json": "Build, operate and scale your backend on AWS 1. Build prod-ready infrastructure with CI/CD, security, auto-scaling 2. Operate with transparency without the weeds 3. Scale with stages and ephemeral stacks 4. Evolve your architecture with the full cloud catalog",
  "data/ph-top/2022/5/codesandbox-for-ios.json": "CodeSandbox for iOS lets you take your projects and sandboxes with you wherever you go. Using an iPhone or iPad, you can now access our new cloud development platform in the comfort of a native iOS IDE.",
  "data/ph-top/2022/5/map-the-force-within-you.json": "The New York rebel base is attacked! https://nextbillion.ai/NexBillion.ai Star Wars Day map lets you find the fastest Starship & route to the New York base. Share with your friends and find out who can respond to the distress call first. May the 4th be with you!",
  "data/ph-top/2022/5/octopus-2-8.json": "Octopus.do, a lightning-fast visual sitemap builder and website planner with lo-fi wireframes. Build, plan, visualize your website structure and create content in real-time. Improve your site architecture, UX design and SEO.",
  "data/ph-top/2022/5/zink.json": "Zink is an easy way to receive micro-donations (from $0.05) for what you create or share on the internet.",
  "data/ph-top/2022/5/ipreview.json": "This App solves the problem that some files cannot be previewed in macOS Quick Look, and provides many practical functions, such as Code Highlighting, Markdown & Jupyter rendering preview, etc. Help you greatly improve the macOS experience and work efficiency.",
  "data/ph-top/2022/5/expense-club.json": "Set of tools to monitor and manage the cash inflow and cash outflows.",
  "data/ph-top/2022/5/crypto-index-fund-simulator.json": "Simulate investments in a wide range of crypto themes (DeFi, NFTs, Blue Chip) using a selection of premade crypto index funds!",
  "data/ph-top/2022/5/stripe-financial-connections.json": "Stripe Financial Connections lets your users securely share their financial data with you. Integrate once to retrieve financial data and use it to streamline payments, reduce fraud, underwrite risk, and build new products.",
  "data/ph-top/2022/5/charthop.json": "ChartHop Basic helps companies build the foundation for a more informed, empowered, and connected organization through the org chart, manager and employee tools, and more. It’s totally free for your first 150 employees, and setup takes minutes.",
  "data/ph-top/2022/5/supermeme-ai.json": "Supermeme.ai is an AI meme generator for serious meme creators to promote their personal or professional brand. We enable marketing teams and individuals who are serious about their meme marketing game by removing the friction in the meme creation process.",
  "data/ph-top/2022/5/track-4.json": "Schedule meetings effortlessly. Advanced natural language based event creation and sharing availability. Unlimited & Customisable booking links. Multiple accounts & support for timezones.Group voting and schedule while using Whatsapp, LinkedIn, iMessage",
  "data/ph-top/2022/5/open-stickers.json": "Open Stickers – big pack of playful illustrations in lovely and peaceful mood. Get them to bring a shiny feeling to your website or app. 100% free for commercial use. Compatible with Figma, Sketch, Adobe Illustrator.",
  "data/ph-top/2022/5/skill-focus.json": "Choose your focus in Skill Focus. 5 types of users for different tasks: Free, Expert, Product academy, Online School, Corporate University Watch, create and promote your educational content in one place. Use special features for creators and users https://skill-focus.com/product_hunt",
  "data/ph-top/2022/5/storii.json": "Record your family's most precious memories with just a phone call. 📞 Receive 3 life story phone prompts a week (or call-in whenever) 🎤 Recorded answers are transcribed and shared with family ✍️ Download recordings or add custom prompts at any time!",
  "data/ph-top/2022/5/laxis-ai-meeting-assistant.json": "With Laxis you can transcribe and record in person and hybrid meetings, highlight important notes with a single click, and save everything to Laxis Cloud to unlock for advanced features, including insight management, AI-augmented memos and advanced search.",
  "data/ph-top/2022/5/tweetify.json": "This tool allows you to generate beautiful images from any Tweet, just paste a link, edit its style as you wish and download it as a PNG file to share it anywhere.",
  "data/ph-top/2022/5/venture-capital-careers.json": "Discover the best https://venturecapitalcareers.com/ near you. Find the latest VC jobs, internships, fund overviews, and more on https://venturecapitalcareers.com/ then filter by location or job type and subscribe to get new VC jobs in your inbox, for free.",
  "data/ph-top/2022/5/product-adoption-academy.json": "Product Adoption Academy is a growing collection of free certification courses to help boost your user activation and retention. The best part: when you complete a course, you’ll get a LinkedIn badge and a chance to win a $1,000 Airbnb gift card!",
  "data/ph-top/2022/5/craft-cms-4.json": "Craft is a flexible, user-friendly CMS for creating custom digital experiences on the web and beyond, and the next major version is now out.",
  "data/ph-top/2022/5/art-diario.json": "Meet Art Diario (that second part is Spanish, dee-arr-ee-o!) A simple MacOS app that changes your wallpaper to a new piece of hand-curated art each day. Everyone sees the same art, so you can talk about it with your friends!",
  "data/ph-top/2022/5/gyana-2.json": "Gyana makes it easy to bring your data together and build custom reports. It’s all point and click, never breaks and has a generous free tier. No more manual exports, #N/A nightmares or stale data.",
  "data/ph-top/2022/5/ditto-2-0.json": "We’ve rebuilt Ditto from the ground up to handle your team’s copy from idea to design to development.💡 ❤️ With Ditto, you can start writing content, and then sync it with mockups in Figma or directly over to development when you're ready.",
  "data/ph-top/2022/5/kaedim-api.json": "Within your app, enable your end-users to upload their 2D inspiration and easily create their own 3D content for customising and populating the game.",
  "data/ph-top/2022/5/blob-animation.json": "Generate Blob Animation For Your Website/Design.",
  "data/ph-top/2022/5/simpledm.json": "A collection of 200+ tools and resources that will level up your digital marketing game. - Stock Images - Illustrations - Color Tools - Design Inspiration",
  "data/ph-top/2022/5/tocoway.json": "Tocoway helps startups generate more leads with high conversion landing page from marketing, design and sales experts. ✅ Marketing Oriented (like in startup unicorns) ✅ Impressive Design (like in Pixar cartoons) ✅ Flexible to Change (with subscription plan)",
  "data/ph-top/2022/5/layoffs-fyi.json": "Tracking all tech startup layoffs since COVID-19. Data is compiled from public reports.",
  "data/ph-top/2022/5/honter.json": "Connecting creative freelancers with potential new clients in a fun and creative way.",
  "data/ph-top/2022/5/snailbox.json": "Email can be a huge distraction. Schedule your email at specific times and recover the time you're losing to your inbox. When it's time to \"do email\", all your messages show up in one batch. You knock them out all at once instead of interrupting your flow..",
  "data/ph-top/2022/5/tandem-shower.json": "The Tandem Shower adds a second showerhead to the opposite side of the shower so no one is left out in the cold. It's easy to install for renters and homeowners alike and comes in three colors.",
  "data/ph-top/2022/5/reshaped.json": "Reshaped is a professionally crafted design system for everyday product development in React and Figma. Usually, you have to set up a million things before you even start working on UI. We took care of it so you can skip your first year of development.",
  "data/ph-top/2022/5/layer-ai.json": "Layer helps you create production-grade ML pipelines with a seamless local↔cloud transition while enabling collaboration with semantic versioning, extensive artifact logging and dynamic reporting.",
  "data/ph-top/2022/5/cowello.json": "Software that enables you to operate your business with confidence--and with our tailored booking options, your members can schedule the space they need, when they need it most. Say goodbye to wasted space and hello to new revenue opportunities with CoWello",
  "data/ph-top/2022/5/freshenv.json": "A command line application to build and develop your projects in completely isolated environments. Save, switch and restart your environments. Choose from a variety of flavors to get the developer tools you need.",
  "data/ph-top/2022/5/aptlearn.json": "With a mission to improve lives through learning, aptLearn is an online learning platform that helps learners gain on-demand tech skills they need to compete in today’s economy and acquire professional certificates at a fraction of the cost and time.",
  "data/ph-top/2022/5/eleventy.json": "A simpler static site generator. An alternative to Jekyll. Written in JavaScript. Transforms a directory of templates (of varying types) into HTML. Works with HTML, Markdown, JavaScript, Liquid, Nunjucks, Handlebars, Mustache, EJS, Haml, and Pug.",
  "data/ph-top/2022/5/rayli.json": "Ever wanted to create an image of your code and had to visit some sort of website? Presenting Rayli, a minimal command-line interface tool to generate images of your code at lightning speed. So that you can get 'em in your terminal itself!",
  "data/ph-top/2022/5/getcam.json": "The best webcam with Magic Touch that automatically shows you in the best exposure and colors! Easy one-time installation of computer drivers and you are ready do use iPhone cameras on Zoom, Skype, or any other computer video communicator.",
  "data/ph-top/2022/5/opengrph.json": "OpenGrph is lightweight canvas to create cover image & open-graph images for your blogs, videos for free. Features: ❤️ 21 elegant looking font pairs ✨ 88 background patterns 🎖️ 3 themes, 2 modes ⚽ draggable elements 📥 download images in png",
  "data/ph-top/2022/5/thread-reader-3.json": "Thread reader helps to read Twitter threads productively as never before without any distraction. Using thread reader you can convert your long Twitter threads to blogs easily by exporting all text just with a click.",
  "data/ph-top/2022/5/sizzzle.json": "Sizzzle&nbsp;is a free review, social, and ordering platform that connects customers with local food trucks. See updated locations, discover your favorite trucks from personalized recommendations, and order online.",
  "data/ph-top/2022/5/landa.json": "Buy shares of rental properties, earn monthly income, and watch your money grow. ⠀ Landa is designed to make real estate investment accessible for everyone — investing is simple, transparent, quick, and all from your phone.",
  "data/ph-top/2022/5/auditzy.json": "A first-in-class application provides an easy-to-use web page audit platform to technical and non-technical users. Now you can monitor your website Performance, SEO, PWA, Accessibility, Security Vulnerability, and Technology without any hassle and in seconds.",
  "data/ph-top/2022/5/nook-calendar.json": "Our goal isn’t to simply build a better-looking calendar app. We want to free up people’s time, so high-performing teams can focus on what actually matters. Sync calendars, use Calendly-like features, coordinate work locations, and quickly create events.",
  "data/ph-top/2022/5/startup-101.json": "TL/DR: Curated startup lessons for entrepreneurs who are looking to start a company as well as those in the process of building one. This app will automatically update with new lessons every month.",
  "data/ph-top/2022/5/link-whisper-2-0.json": "Link Whisper version 2.0 is a WordPress plugin that speeds up the process of internal linking that can help you rank better in Google. Get smart link suggestions, in-depth reporting, and quickly take control of the link structure across your entire site.",
  "data/ph-top/2022/5/learn-html-css.json": "Semantics and accessibility have been frequently neglected on the web. This interactive platform guides you step by step into learning modern HTML CSS that is semantic and accessible.",
  "data/ph-top/2022/5/it-tools.json": "IT Tools is a free and open-source collection of handy online tools for developers & people working in IT. It includes a token generator, case converter, base converter QR code generator, Git cheatsheet, lorem ipsum generator,.. and many more !",
  "data/ph-top/2022/5/easyjobs.json": "Making job applications faster so that you have more time to focus on what’s important! Free Chrome extension and dashboard for job applications. Find relevant job postings and apply with just one click. Automatically manage and track applications.",
  "data/ph-top/2022/5/gravity-b3653e60-e1de-4725-95c9-6ad4930d7f50.json": "Gravity allows you to call functions defined in your server directly in your client. It is a modern back-end framework that can integrate with your front-end like Svelte, React, Solid and Vue.",
  "data/ph-top/2022/5/marqly.json": "Marqly lets you save, customize and manage all your bookmarks and highlighted texts online like a breeze.",
  "data/ph-top/2022/5/klutch-app.json": "Internal knowledge base for your team. Klutch is for teams that want to collaborate and organize company information, save time on repetitive questions, and onboard new team members.",
  "data/ph-top/2022/5/iter8.json": "We’ve rebuilt feature release monitoring for high-performing Product Managers. Iter8 is lightweight and fast. Its advanced features make you powerful. Drag & drop charts. Proactive insights. Automate stakeholder reports. Request access: https://www.iter8app.com/",
  "data/ph-top/2022/5/b2b-linkedin-strategy-ebook.json": "Many businesses struggle with consistent content creation on LinkedIn. So here is a cheat sheet! This is an eBook that will make your life easier with chapters such as: - 1-month content plan strategy - themes and content ideas - hashtag strategy and more!",
  "data/ph-top/2022/5/kolona.json": "A monthly subscription to support Ukrainian defenders introduced by PMs from Wise, Tumblr, Bolt, Readdle and other product companies.",
  "data/ph-top/2022/5/indx-2.json": "INDX is a focused place for self-directed learning. Easily save podcasts, articles, and videos and leverage powerful curation/community features to discover your next read or listen from a friend. We like to think of INDX like Pinterest but for learning.",
  "data/ph-top/2022/5/paper-xyz.json": "Paper provides commerce infrastructure for selling NFTs. Use their simple APIs or developer SDK to: 💳 accept credit cards for NFT purchases ✨ accept cross-chain crypto (i.e. use ETH to buy SOL NFTs) 👛 create non-custodial wallets authenticated by email",
  "data/ph-top/2022/5/veryfront.json": "Build web apps with your team right in the browser, share live previews, and deploy with one click. Enjoy ready-made UI components and integrations and say goodbye to infrastructure chores. Release unique experiences in no time and have fun coding again.",
  "data/ph-top/2022/5/ronron.json": "RonRon (purr in French) provide a great meditation experience using high quality audio and haptic on the iPhone in order to simulate a cat purring on you. Use it for having a heartwarming moment, or after a stressful day. We wish you a great purr session!",
  "data/ph-top/2022/5/topline-resumes.json": "Are you not getting interviews after applying online? Do you want to identify the right skills for the resume? Topline Resumes will highlight the in-demand missing skills for you.",
  "data/ph-top/2022/5/prepintech.json": "Platform where you can practice Mock Interviews with your peers. Schedule Interviews with your peers and experts in the tech industry. Do check it out and provide your valuable feedback !! https://prepin.tech - 1:1 Interviews You Never Had",
  "data/ph-top/2022/5/2022-q1-global-vc-benchmark-report.json": "TheVentureCity's VC Benchmark report is live today! Check it out for an in-depth review of all the notable #VC activity in Q1 across the US, Europe, and LatAm.",
  "data/ph-top/2022/5/the-juked-esports-app.json": "Juked is a community for esports fans that makes it easy to join the conversation and follow your favorite games, teams, and leagues in a less toxic environment than Twitch chat or Twitter.",
  "data/ph-top/2022/5/acapela.json": "Capture, filter and action all your work communication from one single tool. Imagine Inbox Zero not just for email...but for Slack, Notion, GitHub, Figma, Jira, Linear and more. Fewer interruptions, less FOMO, more time for Deep Work.",
  "data/ph-top/2022/5/pages-by-scribe.json": "Scribe automatically creates step-by-step process guides. Now, with Pages, add your guides to a custom process document alongside text, lists and video. Create beautiful onboarding guides, training materials, SOPs and more — in minutes!",
  "data/ph-top/2022/5/feeda.json": "Feeda is how to find out what users really want from your product - so you can make better decisions and save time on development.",
  "data/ph-top/2022/5/custom-macos-icon-pack.json": "Unify your dock with this macOS icon pack. Get 46 beautiful replacement app icons that are easy to install on macOS 🤟🏼",
  "data/ph-top/2022/5/reskript-2.json": "Say goodbye to switching platforms👋 and cover the entire team workflow with ReSkript. From task management to docs collaboration, we got you🦾 💙Other features you’ll love: •Integrated chat •Team Projects •Easy import/export features",
  "data/ph-top/2022/5/carbonfact.json": "Carbonfact digests the latest environmental science to measure and compare the carbon footprint of apparel and footwear products. Submit an item link at http://www.carbonfact.com/request and we will email you our analysis.",
  "data/ph-top/2022/5/motion-devtools.json": "Motion DevTools is a Chrome extension that speeds up your animation design and development. Use a classic timeline interface to inspect, edit and export animations made with CSS or Motion One.",
  "data/ph-top/2022/5/shopify-merchants-developers-matcher.json": "Need to develop an e-commerce website? At WeLoveNoCode (WLNC) we offer an all-in-one solution to set up your store for success with just no-code! Get matched with vetted Shopify experts on the WLNC platform and get your store built 10x faster and cheaper!",
  "data/ph-top/2022/5/diversity-wiki.json": "The #1 one-stop website for Diversity, Equity and Inclusion (DEI) users and providers. Discover and connect with networks and organizations. - 2000+ Initiatives from all over the world - Use powerful filters to save time - Write comments in our community",
  "data/ph-top/2022/5/arnica.json": "Software supply chain attacks have caught the security community off-guard. Arnica, starting with GitHub & Azure DevOps, addresses the two primary root causes: 1) 🪄 excessive permissions to developer tools 2) 🥸 lack of abnormal behavior detection",
  "data/ph-top/2022/5/calendly-routing-forms.json": "Calendly Routing Forms lets you request information from website visitors upfront and automatically present specific scheduling options based on their answers. Deliver a great customer experience and create higher quality connections with Routing Forms!",
  "data/ph-top/2022/5/vessel-4.json": "Vessel is your passport for the internet. Explore the web without creating dozens of passwords or seed phrases. Manage your digital identity and crypto assets in a single secure browser extension that gives you seamless access to sites and apps.",
  "data/ph-top/2022/5/b2b-local-leads-directory.json": "B2B Leads Directory allows you to search for contacts among millions of local businesses. Find emails, phones, and other information about your ideal customers. Create leads databases for your marketing campaigns for cold outreach.",
  "data/ph-top/2022/5/quicktools-by-picsart.json": "For the first time ever, Picsart is making some of its world-class editing tools available for free. Creating transparent backgrounds for images, trimming videos, and converting file types -- do it all with Quicktools.",
  "data/ph-top/2022/5/commands-dev.json": "Commands.dev is a curated collection of popular terminal commands. -Search for hard to remember terminal commands by tag, description, and title -Share commands with teammates and friends -Contribute to an open source repo of commands that show up on the site",
  "data/ph-top/2022/5/zario-digital-wellbeing.json": "Zario is a digital wellbeing platform that helps you live a more digitally balanced life. Our goal is to reduce and replace your undesired screentime and cultivate healthy habits. ⠀ 🧠 Psychology backed concepts 🎮 Gamified challenges 🎯 More focus and control",
  "data/ph-top/2022/5/offers-by-aeqium.json": "Building your company starts with hiring. With Offers by Aeqium, craft eye-catching, interactive offer letters to help candidates understand their total compensation. Leverage your comp bands, past offers, and market data to make informed comp decisions.",
  "data/ph-top/2022/5/magic-retouch-by-photoroom.json": "Thanks to our Magic Retouch, you can now remove any unwanted detail from a photo effortlessly (POOF!), in only two seconds. Paint over the unwanted objects of your image and let Photoroom work its magic. This tool is available on IOS, Android and on the web.",
  "data/ph-top/2022/5/invoice-maker-by-saldo-apps.json": "Invoice Maker is a comprehensive solution for creating invoices, estimates, reports, receiving payments, and running a business. Thanks to it, you can create forms, fill out templates, send paperwork to clients, and accept payments wherever you are.",
  "data/ph-top/2022/5/nawvel.json": "Nawvel is a library updated by modern day librarians and synthesizers. We spend 1000s of $$$ on resources and 1000s of hours on researching quality resources to save you time.",
  "data/ph-top/2022/5/lyric-video-maker-by-videobolt.json": "With this product update, you can easily create visually stunning lyric videos using templates designed by some of the world’s top video designers. Videobolt's video platform has already attracted over 1,000,000 content creators from 174 countries.",
  "data/ph-top/2022/5/flowinspaces-by-flowjin.json": "“FlowinSpaces” is a free tool that automatically archives all your Twitter Spaces into an online playlist accessible on the web. Your audience can subscribe to get notified of future uploaded spaces. You can build an email list from your listeners.",
  "data/ph-top/2022/5/fresco-3.json": "Fresco is a straightforward online whiteboard that enables teams to collaborate in real-time on a variety of pre-made and custom templates. Track tasks, export data, and make meetings more productive.",
  "data/ph-top/2022/5/mysc.json": "mysc. is a fun yet powerful tool designed to create, collect, organize and showcase miscellaneous things in daily life that we value but are hard to fit into categories defined by others.",
  "data/ph-top/2022/5/flutter-3-0-2.json": "Today, we’re introducing Flutter 3, which is the culmination of our journey to fill out the platforms supported by Flutter. With Flutter 3, you can build beautiful experiences for six platforms from a single codebase.",
  "data/ph-top/2022/5/tweetic-io.json": "Introducing Tweetic.io! Convert Tweets to Static HTML easily with this tool! Create your testimonial wall statically and style it however you want!",
  "data/ph-top/2022/5/research-templates-from-great-question.json": "Use these pre-built templates to empower curious folks to conduct great research. Pick templates based on your role, use case or method and quickly get the answer to your great question. Launch studies in minutes with our all-in-one research platform.",
  "data/ph-top/2022/5/fellow-s-desktop-tray-app.json": "Fellow’s Desktop tray app&nbsp;makes managing your day that much easier. ✨ You can effortlessly join meetings, view your meeting schedule, access meeting notes and manage action items right from your desktop menubar. 🤩",
  "data/ph-top/2022/5/highlight-xyz.json": "An end-to-end toolkit to bring web3 membership and rewards to your fanbase, with no crypto experience required. In minutes, anyone can mint NFTs & build a custom-branded communal home, with rich integrations that offer ongoing utility and exclusive access.",
  "data/ph-top/2022/5/optimizeimages-free-bulk-image-optimizer.json": "A free online image converter and optimizer that allows you to convert your images into WebP & AVIF formats, optimize JPEG, PNG, SVG and GIF images to reduce file sizes, bulk apply watermarks to images and crawl websites to find and optimize images on them",
  "data/ph-top/2022/5/accelerator-hunt.json": "Accelerator Hunt is a website where you can search through 2000+ accelerators and incubators to find the right program for your startup. We've categorized them by program types, locations, industries and investment stages.",
  "data/ph-top/2022/5/email-comments.json": "With one click add comments to a specific email inside Gmail which are automatically visible to your team members included in the email, but not to people outside your organization.",
  "data/ph-top/2022/5/analysed-co.json": "We help eCom brands, Startups and SMBs grow through data analysis. Make the right, data-driven decisions supported by our expert analysis. Simple subscription to help grow your business.",
  "data/ph-top/2022/5/30-day-club.json": "The 30 Day Club is an online community for anyone who wants a to develop new skills, form new habits or connect with people with similar hobbies and interests.",
  "data/ph-top/2022/5/code-to-image-converter.json": "This is a simple and customizable code to image converter. You can use this tool to convert your code snippets to beautiful images. For those who share codes to social media or on blogs, this will be a great tool for them",
  "data/ph-top/2022/5/to-do-board.json": "The easiest way to track and share your to-do lists. Making lists & notes for collaboration should be simple. No sign-up. No million tools to navigate. Create a new board and find out just how easy it is.",
  "data/ph-top/2022/5/markdown-preview.json": "Markdown Editor with instant preview using GitHub CSS.",
  "data/ph-top/2022/5/beautify-github-profile.json": "This repository helps you to have a more beautiful and attractive github profile, and you can access a set of tools and guides for beautifying your github profile. 🚩",
  "data/ph-top/2022/5/the-cto-field-guide.json": "This is not a training program. It is a book with actionable information to help you if you just got promoted, want to structure an engineering team or just want to add to your tool box. You will find templates to get started on engineering management.",
  "data/ph-top/2022/5/lofi-fm.json": "Online lofi music player with the option to add song locally. Lofi FM is complete client side app which only uses youtube video embedding and youtube data API.",
  "data/ph-top/2022/5/moast.json": "Moast allows shoppers to see products in person through real customers before buying online. With Moast, brands have less pressure to open retail locations, reduce their rate of returns, and eliminate the uncertainty in the online shopping experience.",
  "data/ph-top/2022/5/chooly.json": "Chooly helps you manage your personal finance by leveraging well-established business financial methodologies, including: - Your personal Balance Sheet - Your personal Income Statement - Your personal Forecasting and Planning",
  "data/ph-top/2022/5/nannyml.json": "NannyML estimates real-world model performance (without access to targets) and alerts you when and why it changed. The performance estimation algorithm, confidence-based performance estimation (CBPE), was researched by core contributors.",
  "data/ph-top/2022/5/awesome-indie-2.json": "Awesome Indie is a small niche community made for indie makers and small teams of bootstrapped startups, where you can explore, upvote, or submit projects.",
  "data/ph-top/2022/5/giticons-2.json": "Automatically adds project logos to your locally cloned GitHub repos.",
  "data/ph-top/2022/5/3d-avatar-library.json": "A beautiful collection of diverse 3D illustrated avatars for your designs, offering hundreds of faces in this initial release and even more to come with the avatar builder. Offer your users a new profile photo with these cool 3D avatars 🚀",
  "data/ph-top/2022/5/digital-bookshelf-2.json": "Store, categorise and reflect on all the content you read, watch and listen to. Digital Bookshelf is the ultimate template to store all the content you read online and offline.",
  "data/ph-top/2022/5/trustbucket.json": "Generate, manage and display reviews from multiple platforms, on any website. Automatically. All in one place.",
  "data/ph-top/2022/5/rentcollage.json": "CREATE Beautiful INFOGRAPHICS to make your posts stand out and find your perfect apartment or tenant faster",
  "data/ph-top/2022/5/bloghunch.json": "BlogHunch is the next-generation blogging platform that lets you focus on building solid content rather than spinning your head around all the technicalities.",
  "data/ph-top/2022/5/jika-io.json": "Jika.io has developed a platform designed to make critical financial information easier for retail investors to use, regardless of their level of financial literacy, helping them to become more sophisticated investors.",
  "data/ph-top/2022/5/manna-cooking.json": "Manna is about making food easier, no matter your desire, lifestyle or dietary needs. Swipe on recipes to discover your next meal. ⁠Swap out recipes ingredient to meet your needs.⁠ Shop for groceries with just one click.",
  "data/ph-top/2022/5/shrink-media.json": "Reduce the file size of your images by smartly compressing & reducing dimensions. With Shrink. the media get 💻 Faster Web Pages Loading 💻 Less Bandwidth Utilization 💻 Better User Experience",
  "data/ph-top/2022/5/paved-smart-campaigns-for-newsletters.json": "We help you run newsletter sponsorships at scale. Paved Smart Campaigns expertly matches your target audience with data-driven newsletter recommendations aligned to your ideal customer, budget, and timing. Book multiple campaigns and reach new customers!",
  "data/ph-top/2022/5/htmlrev.json": "Library of 50 beautiful HTML landing page templates that save design and development time when creating online presentations for products, services and ideas. Offered with included images, illustrations and simple license.",
  "data/ph-top/2022/5/video-sales-letter-by-vadoo.json": "A video sales letter is a video that pitches your product or service to a prospect. It replaces a written sales copy with a persuasive video that can explain a written sales copy much better.",
  "data/ph-top/2022/5/what-human-foods-can-dogs-eat.json": "The app is a source of ongoing&nbsp;info on&nbsp;what human foods can dogs eat. Are you uncertain&nbsp;about a particular food? This app will respond to you shortly.",
  "data/ph-top/2022/5/doublesubs.json": "Improve your listening skills and vocabulary by simply watching videos and series with dual captions. 💬 Original and translated subtitles 📘 Phrasebook ⚡️ Quick access to translation in popup 🔊 Pronunciation 🌙 Dark theme",
  "data/ph-top/2022/5/musicsource.json": "MusicSource is an open source and free desktop music player. It is served as a Progressive Web App so it requires no installation and is available offline. No server, no ads, no tracking.",
  "data/ph-top/2022/5/videomark.json": "VideoMark is a Chrome extension, can help you take notes on YouTube. It can save subtitles and screenshots easily and is great for learning the important part of the videos for everyone. We don’t own your notes, your data is stored in Google Drive is private.",
  "data/ph-top/2022/5/homefield-fit.json": "HomeField.fit is the first online platform that offers people with special needs and disabilities fitness through live streaming and on demand videos. From martial arts to dance, there's a class for everyone.",
  "data/ph-top/2022/5/ortto.json": "Ortto allows online businesses to unify their customer data with their CDP, segment and activate audiences across the customer lifecycle with personalized, omnichannel experiences, and analyze their business for growth with a powerful suite of BI tools.",
  "data/ph-top/2022/5/claap.json": "Better than emails, faster than meetings. Claap’s async video collaboration platform helps you: 🎥 share your work with quick screen-recording 💬 get contextual feedback with annotations & time-stamped comments ✅ make decisions with threads & votes",
  "data/ph-top/2022/5/dots-2-0.json": "Excited to launch Dots 2.0: fresh with a new logo! Every part of Dots has been updated: a beautiful with manual payouts, improved international rails, and 1099/W8 compliance. We've refined our payouts API to make money movement simple, quick and easy.",
  "data/ph-top/2022/5/tape-4.json": "Meet Less and Create More 👨‍💻 Share, discuss and collaborate by recording and exchanging short videos of screen and face - 🚫 No extension required.",
  "data/ph-top/2022/5/blend-social.json": "Hi! We are JMIND, an IT company from Ukraine backed up by a team of international volunteers. We want to support people affected by the war in Ukraine. That's why we are launching Blend – a free non-profit mobile app where people can get or provide help.",
  "data/ph-top/2022/5/narrative-bi-for-ga4.json": "Narrative BI is a no-code platform that turns your Google Analytics 4 data into actionable insights to help you make the right decisions. Connect your GA4 account to Narrative Bi and get your first narratives and reports within minutes!",
  "data/ph-top/2022/5/care.json": "Care is a burnout assessment for remote teams. It scores your stress, focus, and recovery level. 🎯 Burnout analytics and benchmarks 🧠 Personalized recommendations 👥&nbsp;Team assessment Free and anonymous ❤️",
  "data/ph-top/2022/5/smartrr-subscriptions.json": "The premier subscription management tool preferred by Shopify merchants looking to build long term brand affinity through a curated subscription experience that encourages customer engagement and increased LTV.",
  "data/ph-top/2022/5/rove-4.json": "With the metaverse infrastructure and technology, Rove helps you build a metaverse for your community in no time. Build a dreamland, tap into the power of the collective and launch your project toward the future.",
  "data/ph-top/2022/5/canny-free.json": "The Canny Free plan lets any business get started with capturing, organizing, analyzing, and prioritizing product feedback. It includes tools for feedback management, roadmaps, changelogs, and release notes. Plus, there are no tracked user limits.",
  "data/ph-top/2022/5/the-paceline-card.json": "Paceline is challenging the traditional credit card industry with The Paceline Card: the first credit card to tie your fitness data to your cash back. You can also earn back the cost of the latest Apple Watch just for hitting 150 minutes of activity each week.",
  "data/ph-top/2022/5/coblossom.json": "coBlossom is an app for couples that empowers couples to build their connections through fun minigames designed for relationships. Strengthen your relationship with on-demand access to minigames that fit into any schedule.",
  "data/ph-top/2022/5/mintparty-xyz.json": "MintParty is the CRM for Web3 communities 🤝 We're launching our 1st feature today to help with automating collection of allowlists for NFT launches. One dashboard for all your needs: setup campaigns, check requirements, scheduling, autopost and pick winners!",
  "data/ph-top/2022/5/stack-bash.json": "Stack Bash is an online course that helps new and seasoned software engineers learn data structures and algorithms to confidently pass coding interviews.",
  "data/ph-top/2022/5/signalzen-2.json": "Live Chat for your website from Slack. 2 types of advanced Slack integration. Easy setup by using WordPress, Drupal, Joomla, Shopify, and HTML/JavaScript plugins. Use mobile apps and the Console for audit and configuration.",
  "data/ph-top/2022/5/ux-teardown.json": "With UX Teardown you can easily grab screenshots of any website, add your notes and prioritize your findings – in one go. Go from screenshots to final report in minutes.",
  "data/ph-top/2022/5/startup-school-live-2022.json": "Startup School is a live, 7-week online course where YC Group Partners and YC founders teach you how to build a billion dollar company. For the first time ever, we will feature in-person meetups and talks at YC alumni offices in 30+ cities all over the world.",
  "data/ph-top/2022/5/flight-penguin.json": "Flight Penguin is a browser extension that takes the pain out of flight search. We search more flights, rank them based on how painful they are, and display them in a simple, visual way to make decision making easy... all without ads or other dark patterns.",
  "data/ph-top/2022/5/comonetize-2.json": "Leading a community of professionals or businesses? Build your own monetizable job board & marketplace of talents, with an automated billing and notification system. Start profiting from jobs and business opportunities while providing value to your community.",
  "data/ph-top/2022/5/stitch-care.json": "Stitch taps into the connection between your gut and your brain by combining a daily dose of probiotics delivered to your home with a science-based mental wellbeing App",
  "data/ph-top/2022/5/dialworks.json": "Dialworks is an on-demand sales training platform that replicates real-life scenarios for sales reps to train and upskill. Connect with customers just like yours, deliver pitches and get actionable feedback to improve.",
  "data/ph-top/2022/5/venn.json": "Venn (\"friend\" in Norwegian) is an easy way to connect with new people and engage in shared activities based on common interests and preferences, where you are, when you are there — facilitating increased social interaction by way of simplicity in design",
  "data/ph-top/2022/5/better-p-kegel-workouts.json": "Made by Men for Men 💪🏼 Meet Better P - men's intimate health trainer made in contribution with Intimate Fitness and Sex Coaches Federation from Ukraine 🇺🇦 Carefully crafted Kegel Exercises arranged in training programs to help men solve intimate issues ✅",
  "data/ph-top/2022/5/pay-with-usdc.json": "A safe, business friendly way send USDC. Address validations help you avoid mistakes. Transaction progress tracking reduces anxiety. Automatic receipt generation keeps your accountant happy. Funds go direct between wallets, no one touches your funds!",
  "data/ph-top/2022/5/reemo-io.json": "Reemo.io instantly connects creatives, gamers or anyone to their workstations wherever they are, from a chrome browser. ✅ Low latency streaming desktop technology 💥 Windows, Linux, MacOS 👌 Free for personal use 🚀 [Businesses] Connect remote teams - 🎁👇",
  "data/ph-top/2022/5/hackerforms.json": "Build and launch an form-like app with just a few lines of python. Code as you would in the terminal and ship it as an online web-app with auth, db, scheduling and more. Hackerforms is great for automations such as finance ops as customer service.",
  "data/ph-top/2022/5/kaya.json": "Think of Kaya as your virtual marketing analytics team– we connect all your marketing data in one place and offer insights you need to grow faster. ⚡&nbsp;Fast and easy to set up 😇 No technical expertise required 📈 Out-of-the-box reports 🔮 AI recommendations",
  "data/ph-top/2022/5/lead-bot.json": "LEAD.bot helps People Ops to manage their employee engagement initiatives such as random coffee, executive lottery, and virtual lunch with just one click. Make intentional connections among employees across teams, departments, or locations serendipitously.",
  "data/ph-top/2022/5/xos.json": "erxes is a free, open, fair-code licensed experience operating system (XOS). erxes provides decentralized and frictionless experience data management. No more missed opportunities, no more obstacles between you and your customers' desires.",
  "data/ph-top/2022/5/onsurity-edge.json": "The first-ever healthcare benefits credit program exclusively for startups – Onsurity Edge Credits Program is designed to empower startups with affordable employee healthcare benefits. Selected startups will get up to ₹25,000 credits to buy membership plans.",
  "data/ph-top/2022/5/virtuelly.json": "Virtuelly curates the best virtual team building events and off-sites to help build connection in remote teams. With over 150+ team experiences to choose from and end-to-end event management, Virtuelly is an all-in-one platform for your culture needs.",
  "data/ph-top/2022/5/usewerk.json": "Werk is the tool that has everything you need to work remotely. Replace your current tech stack with the new generation approach and centralize your workflow. Async records, drop-in voice chat, customizable task manager, hyperdocs, and thread chat.",
  "data/ph-top/2022/5/graphql-yoga.json": "Leverage the GraphQL ecosystem by being compatible with the existing schema-design (Code/Schema first), HTTP server libraries (Express, Fastify, Next.js, SvelteKit, etc..), and deployment environments (Cloudflare Workers, Deno, AWS Lambda and others..).",
  "data/ph-top/2022/5/api-tracker-2.json": "Discover the best APIs and SaaS products to integrate with. Track API specs, developer experiences, API docs, SDKs, developer docs, IDE support, platform strength, authentication, and API styles.",
  "data/ph-top/2022/5/image-background-remover.json": "Automate background removal and gain more time for creativity: 🚀One-click tool, no design skills needed! ⏱️Upload an image—get results in secs ⚡️AI-powered object recognition and matting 🖌️Editing mode with flexible brushes & hotkeys 💻Works on web and mob",
  "data/ph-top/2022/5/social-media-customer-service-guide.json": "Want to learn how to provide world-class customer support on social media? Then this free e-book is just for you! Download now to learn all the best practices of social customer support for FREE!",
  "data/ph-top/2022/5/school-morning-routine.json": "An app to help parents get their kids ready for school without all the chaos. It's a todo list crossed with a game and kids love it. It makes mornings peaceful, easy and even a little bit fun. So you can enjoy your family mornings together.",
  "data/ph-top/2022/5/iconduck-for-figma.json": "Iconduck is a collection of 150+ open source icon and illustration sets. ⠀ We're announcing the launch of our Figma Plugin, which gives you access to 118,894 open source icons, emojis and illustrations right from Figma. ⠀ Just install and go 🥳",
  "data/ph-top/2022/5/unlock-protocol-recurring-subscriptions.json": "Unlock has created the first-ever mechanism for recurring subscriptions using membership NFTs. This upgrade to Unlock Protocol paves the way to replace legacy subscription systems that use centralized payments with a decentralized Web3 model.",
  "data/ph-top/2022/5/unloved-project.json": "Save time and development costs. Pay less for your next acquisition and get an instant route to market. Disclaimer: No Daves were harmed in the making of this video.",
  "data/ph-top/2022/5/set-new.json": "Make moodboards in minutes—for free: ⠀ 💨 1-click remove background ✨ Automatic tidy up ⠀ Just what you need. No signup. No time-wasting. No fuss. ⠀ ⚡ set.new: your shortcut to creation. For the full experience and more features, sign up to Visualist.",
  "data/ph-top/2022/5/leaddelta-2-0.json": "LeadDelta helps you become proactive about your most valuable asset – your relationships. 🗂 Centralize all your LinkedIn contacts in one place. 🗝 Unlock data & signals. 🏷 Filter, sort, tag & organize. ⚡️ Build workflows & grow. 😍 www.leaddelta.com",
  "data/ph-top/2022/5/longshot-ai-1.json": "LongShot is an AI-powered long-form content assistant that turns your ideas into SEO-friendly content in minutes. LongShot strives for fresh, authentic, SEO friendly content (with unique tools like fact-checks and semantic SEO score).",
  "data/ph-top/2022/5/qapop-2-0.json": "QApop helps you run successful marketing campaigns on Quora 🎉 1. Find relevant questions. 2. Answer them quicker using AI. 3. Track new questions in your niche.",
  "data/ph-top/2022/5/maximus-2.json": "Maximus provides prescription oral pharmaceuticals to help men optimize their health safely and naturally. Maximus enables men to achieve an optimal balance or key hormones without injections, and without the side effects of dated alternatives.",
  "data/ph-top/2022/5/google-sheets-ad-booking-system.json": "Suck at back-and-forth emails to sponsors, want to do better. Get this https://lettertribe.com/ — let sponsors pay and book instantly! One ad slot can be booked only once. No monthly fees, 0% transaction fees.",
  "data/ph-top/2022/5/marble-insurance-app.json": "Marble is daring insurance companies to focus on something more important than ads and mascots: You. Centralize all your insurance, get notified about changes, and quickly optimize price & coverage. Earn rewards monthly just for staying protected.",
  "data/ph-top/2022/5/1-year-transformation-board.json": "A dashboard designed to help you break down and achieve your goals in just one year, right within Notion. No need to overcomplicate things anymore.",
  "data/ph-top/2022/5/haircare-app.json": "HairCare is an iOS app that provides a personalized hair care experience. You tell us about your hair and scalp peculiarities and our app generates an individual care plan tailored for your profile.",
  "data/ph-top/2022/5/health-hub-os.json": "A full health operating system with +15 unique templates and +10 different trackers to help you track everything health related in one connected hub.",
  "data/ph-top/2022/5/cauldron-free.json": "Cauldron helps you to convert, screen, and win candidates with role-specific job pages. Pre-screen your funnel or fast-track top applications with quick tasks instead of resumes. You can use Cauldron standalone or on top of your ATS.",
  "data/ph-top/2022/5/os-old-school.json": "This retro icon and wallpaper set features 166 pixel perfect icons, dark and light themes, and 5 dynamic wallpapers. Each bespoke icon has been lovingly hand crafted using old school techniques - Steve Jobs would be proud!",
  "data/ph-top/2022/5/letterfall.json": "Letterfall is a fast paced and challenging word game for iOS that will push your reflexes and vocabulary skills to the limit. The rules are simple, spell words by tapping on the falling tiles. Earn as many points as you can before the tiles reach the top.",
  "data/ph-top/2022/5/freeze-youtube.json": "Wanna pause the YouTube without soiling the keyboard with your greasy burger-finger? Control your YouTube with your fingers!",
  "data/ph-top/2022/5/github-profile-page-creator.json": "Creating a Personal Readme File on Github is a headache. Here is the solution, you just have to fill input fields and your readme file is ready!! Here is the code https://github.com/iamsatyajit05/GitHub-Profile-Page-Creator",
  "data/ph-top/2022/5/web-ui.json": "Web UI is a modern frame for fulfilling your designing needs. Download free UI design assets for the Figma and Adobe XD",
  "data/ph-top/2022/5/sguards.json": "Apply the best Security practices advised by the experienced experts from the world-leading software companies.",
  "data/ph-top/2022/5/stoic-life-calendar.json": "A digital Stoic Calendar built in Notion around the principle of Memento Mori; remembering that you'll die. By using the calendar, you'll start living a little better by being reminded of your mortality every week as you check off another one lived.",
  "data/ph-top/2022/5/notion-printable-planners-ebook.json": "A collection of digital & printable planners that help you plan and track your whole year ahead.",
  "data/ph-top/2022/5/livereacting-24-7.json": "LiveReacting is a powerful tool designed for digital creators, so they can easily launch continuous streams to drive new traffic, monetize old videos, and stay in favor of YouTube, Facebook and Twitch algorithms.",
  "data/ph-top/2022/5/viralmoment.json": "The ViralMoment app shows you top TikTok content in your niche and the hottest viral trends. Learn the best time to jump on trends to gain 6x as many followers. We save you from endless scrolling and help you lift algorithm fog to see trends across all TikTok.",
  "data/ph-top/2022/5/web-design-6.json": "Download the best free web design resources on the globe for your next design project.",
  "data/ph-top/2022/5/nora-2.json": "Notion template to solve painful problems of project management in Notion instead of looking beautiful. - Create & manage sub-issues - Auto-estimate due date - Track progress across projects, sprints & tasks - Suggest what to do - Smart outdated tasks",
  "data/ph-top/2022/5/supapass.json": "The easiest way to create your stunning website & app, to finally have all your content in one place. One ultimate destination to send your audience for your podcast, courses, membership, subscriptions & more. Launch in minutes — for free. https://supapass.com",
  "data/ph-top/2022/5/startups-fyi.json": "Startups.fyi is a curated database of the best free tools and resources for startup founders to help you build, launch and grow your startup.",
  "data/ph-top/2022/5/routemap.json": "Routemap is an advanced roadmapping tool in Jira for discovery, planning and communicating your product, project and portfolio strategy.",
  "data/ph-top/2022/5/ghost-5-0.json": "Ghost 5.0 is the latest major release of Ghost, now with support for member analytics, multiple newsletters, custom tiers, simple design settings, and much more.",
  "data/ph-top/2022/5/flash-7a8c3f6e-bd9c-4ba3-ad26-3fd92134fefa.json": "Read all your tech news (TechCrunch, The Next Web, Hacker News, Product Hunt and many more) in one place.",
  "data/ph-top/2022/5/whitelabel.json": "Introducing WhiteLabel - Branded Games for Businesses. A cookieless future is ahead. But your business must thrive. Get control of your customers' data. Outperform your competition with customized games. Visit 🕹 http://playwhitelabel.com",
  "data/ph-top/2022/5/peerlist.json": "Peerlist is a community-led professional network for people in tech with powerful work profiles at its core. A Peerlist profile can be used as a simple resume or a complete portfolio to showcase your work from Github, Dribbble, Product Hunt, and many more.",
  "data/ph-top/2022/5/tuthub-io.json": "TutHub.io is a community-driven database & search engine for learning resources on all programming topics. Users submit links to resources together with some meta-data and then people can up/downvote them. This way, only the best resources move to the top.",
  "data/ph-top/2022/5/doodooc-music-visualizer.json": "Hey Community! Happy to introduce doodooc.com - Generative Music Visualizer and its team of music lovers! doodooc.com is a code-based music visualizer that allows artists to render their music with unique visuals. It’s better to see it once - doodooc.com",
  "data/ph-top/2022/5/clockwork-3.json": "Clockwork is an AI powered bot that automatically detects actions items amidst your Slack messages and lets you assign them to team members, set due dates, add comments, block time on your calendar and a lot more. Never let an important task slip again!",
  "data/ph-top/2022/5/photoroom-web-app.json": "PhotoRoom is finally available on the web to create professional product images. Remove a picture background, erase any unwanted object or detail, choose a professional background... This web tool is as easy and intuitive as the PhotoRoom app.",
  "data/ph-top/2022/5/reviewflowz.json": "Never miss a review again. Reviewflowz brings customer reviews into Slack: 👀&nbsp;Read customers’ feedback easily and painlessly 💬&nbsp;Exchange ideas and tag other teams ✅&nbsp;Decide if and how to answer with threads & votes 🎯 Find out who wrote each review",
  "data/ph-top/2022/5/systemflow-for-figma.json": "SystemFlow for Figma is a lightweight landing page UI kit with hundreds of components and sections that are easy-to-use and customize.",
  "data/ph-top/2022/5/muse-2-0.json": "Muse lets you work with visuals, text, and ink on freeform spatial boards. Designed for complex ideas and problem-solving, Muse’s nested boards and zooming interface unlocks your clearest thinking and creative flow. Now available on iPad and Mac.",
  "data/ph-top/2022/5/react-bricks.json": "React Bricks is a CMS with the best Visual editing experience for Content editors, but great for Developers too, as content blocks are React components defined in code. Easy as Wix for editors, but with your pixel-perfect design and no way to break it.",
  "data/ph-top/2022/5/convert-twitter-spaces-to-youtube.json": "Spaces Host - did you know that over 2.5 billion users are on YouTube looking for interesting content? Convert your Twitter Spaces into native videos on YouTube & YouTube Shorts and gain new listeners. Configure once and watch automation do it's magic 🦸",
  "data/ph-top/2022/5/roi4presenter.json": "Roi4Presenter reinvents the concept of presentation. ⏺Showing online presentations both recorded, and live online 🔥Integration with Hubspot, Zapier 📹Convert video to slides and add video as a slide 💬Video, audio and text chat 📝FAQs and audio scripts",
  "data/ph-top/2022/5/minke.json": "Minke is the easiest way to save, earn and invest with DeFi on mobile. You can fund your wallet in 3 clicks with Apple Pay and start earning interest in 3 clicks more. Rates up to 5% per annum, zero gas fees, and non-custodial global availability.",
  "data/ph-top/2022/5/animatiss.json": "AnimatiSS is a tool to preview custom CSS animations and grab their code with a simple click, to paste it into your own web projects.",
  "data/ph-top/2022/5/laverie.json": "Members only sharing club for luxury accessories where you can borrow and lend luxury accessories such as designer bags with your peers by borrowing—> you can wear more & spend less by lending—> you can earn infinite $$$ without selling",
  "data/ph-top/2022/5/speakeasy-5.json": "Communicating with your clients and team members is meant to be easy. Speakeasy is an easy to onboard, easy to use communication tool that lets you stay informed and on-task no matter what. Whether you are a freelancer or a small agency, Speakeasy works.",
  "data/ph-top/2022/5/volt-insights-2.json": "Undelivered text messages are lost customers. Gain clarity into why your messages fail and boost text message deliverability rates with actionable insights streamlined on a single dashboard Send and Deliver Results with Volt",
  "data/ph-top/2022/5/yc-prep-by-anima.json": "YC batch is coming, and many companies are preparing for the famous 10-minutes blitz interview. This app got us into YCombinator back in 2018, now we're open-sourcing it.",
  "data/ph-top/2022/5/guardian-network-keyper.json": "Keyper gives you peace of mind to get involved with crypto, NFTs and Web3 safe in the knowledge that your all-important seed phrase can never be lost, hacked or stolen. The ultimate seed phrase recovery solution – Keyper has your back.",
  "data/ph-top/2022/5/video-recording-forms-by-milk-video.json": "Milk Video is a video marketing platform that simplifies short-form video creation for marketers. Anyone can collect, clip, and ship video content such as customer testimonials, employee testimonials, and thought pieces in minutes.",
  "data/ph-top/2022/5/vantage-autopilot.json": "Save 50% on your next AWS bill. Vantage Autopilot applies cost savings on your behalf by automatically buying and selling Reserved Instances. There are no upfront commitments or infrastructure changes. Connect your AWS account to start saving.",
  "data/ph-top/2022/5/stripe-apps.json": "Stripe Apps lets you embed custom user experiences directly in the Stripe Dashboard and orchestrate the Stripe API. Create an app to streamline operations just for your team or for the more than one million businesses using Stripe.",
  "data/ph-top/2022/5/planetscale-portals.json": "Create read-only database regions to support globally distributed applications and better serve your users worldwide.",
  "data/ph-top/2022/5/claritus.json": "Claritus is the platform every investor needs to make decisions with clarity and confidence. Track, analyze, and be in full control of all of your assets and investments - all in one place!",
  "data/ph-top/2022/5/happy-eyes.json": "Want to beat that eye strain? Happy Eyes can help with our smart web app that will give you a gentle reminder to take a break every 20 minutes and uses the 20-20-20 rule. Try it now)",
  "data/ph-top/2022/5/digitalocean-functions.json": "Build, deploy, and scale apps quickly using a simple, fully managed solution. Deploy code by simply pointing to a GitHub repo and let Functions do the heavy lifting of managing the infrastructure, app runtimes and dependencies.",
  "data/ph-top/2022/5/framer-sites.json": "Design and publish websites faster than ever before. Meet the new Framer, featuring breakpoints, effects, CMS, styles, and so much more.",
  "data/ph-top/2022/5/noknok.json": "Stay in sync with your team while working off-site: - Unmatched team visibility - A new hybrid/remote office culture - Online interactions, with a single click - Group chats for spontaneous brainstorming",
  "data/ph-top/2022/5/predis-ai-2-0.json": "Launching Predis.ai 2.0! Now you can: 1. Create ready-to-use Social Media posts from 1-liner text input. Our AI makes Images, captions, and Hashtags and suggests the best time to post. 2. Publish to Instagram, Facebook, and Linkedin in 1 click.",
  "data/ph-top/2022/5/lazy-search-by-sigmaos.json": "Meet the Lazy Search 🔍 Tabs, Searches, Commands, Bookmarks… one tool to search them all, one tool to rule them all 👑 No waitlist BS, https://sigmaos.com 🤩",
  "data/ph-top/2022/5/sayf.json": "Building the habit of savings using human cognitive behavior. Working towards simplifying savings. SayF creates the largest brand loyalty program by providing real value to loyal customers and eliminating the useless vouchers from the industry.",
  "data/ph-top/2022/5/anthro.json": "Anthro is a 2-line-of-code widget that allows SaaS tools to embed freelancers to serve the clients of the tool. We solve 3 problems: ✅ Lost revenue & love ✅ Quality and cost for your customer ✅ Overall UX of hiring a pro",
  "data/ph-top/2022/5/airbank.json": "🏠 All your bank accounts in one place 🔎 KPI dashboard and cash flow planning 🕹 One-click bulk payments to suppliers or employees 🕵️ Automated pre-accounting 💳 Smart company cards with spending limits 🎢 Fast access to revenue-based financing",
  "data/ph-top/2022/5/wannabe-entrepreneur-space.json": "The WBE Space is a community made for Indie Makers with the main mission of helping them turn their ideas into businesses by giving access to a supportive network that will provide feedback and motivation.",
  "data/ph-top/2022/5/cryptocase.json": "Cryptocase is a platform that helps you easily invest in baskets of cryptocurrencies. Each basket is managed by investment professionals, who monitor the performance and changes in each cryptocurrency to ensure the best possible results.",
  "data/ph-top/2022/5/sales-dialer-for-mobile.json": "JustCall's Sales Dialer for mobile allows your sales reps to make more sales calls without wasting time in dialing each & every number and automating voicemail drops. Moreover, every phone call and call recordings get logged in the CRM.",
  "data/ph-top/2022/5/aws-bootstrap.json": "AWS is powerful, but hard to configure. With AWS Bootstrap you can set up a full-stack application on AWS in minutes. Just pick your favourite frameworks, connect your AWS account, and deploy!",
  "data/ph-top/2022/5/engati-for-shopify.json": "For integrated social commerce on Shopify, with the power of Omnichannel One View. Install free https://apps.shopify.com/engati 2X conversions 3X repeat orders Cart abandonment drops by 70% Starting under $3 per day, automate your eCommerce flow of business.",
  "data/ph-top/2022/5/multo.json": "The personal indoor farm with up to 60 plants growing right in your kitchen or living room. Its “Ebb & Flow” watering technology provides up to 200% more yield. Thanks to the modular tray system grow anything from zucchini to micro-greens.",
  "data/ph-top/2022/5/vibetoon.json": "Vibetoon is an animation music video making platform for musicians and content creators who are interested in promoting their content using vivid animations with custom characters. ⠀ No technical skills are needed - it’s really quick, easy and fun!",
  "data/ph-top/2022/5/skiff-mail.json": "Skiff Mail is privacy-first, end-to-end encrypted, Web3-native, open-source email. Keep your inbox private with 10 GB of storage, instant search, and 3 aliases - all for free. Connect your wallet to send or receive private emails with your wallet or ENS name.",
  "data/ph-top/2022/5/bonding-association.json": "Bonding Association is a solution of loneliness problem for people all around the world. It is a DAO organization where apps, researchers, creators cooperate to give many possible ways to find soulmates online. Join us now and be among the first.",
  "data/ph-top/2022/5/super-designer.json": "Super designer is a collections of simple design tools to create unique designs in a a few clicks. Generate unique backgrounds, patterns, shapes, colors & images for social media, websites, apps and more.",
  "data/ph-top/2022/5/gosolo-2.json": "GoSolo helps international entrepreneurs set up a UK limited company and business account without a personal UK address: • Formation of a UK Limited company • GBP business account • Mastercard® debit card • Virtual UK address • Tools to run your UK business",
  "data/ph-top/2022/5/chroma-5.json": "Chroma is a free browser extension that makes it easy to pick colors from web pages and build shareable color palettes. Currently available for Chrome, Edge and Brave browsers.",
  "data/ph-top/2022/5/folder-peek.json": "Quickly access documents, files, folders, and apps from the menu bar. Think of it as an alternative to Dock folders, just more powerful and customizable. Requires macOS 12.3 or later.",
  "data/ph-top/2022/5/free-podcast-website-builder.json": "Create a website for your podcast, regardless of whether you host on Libsyn, Buzzsprout, Spreaker, Anchor, Soundcloud, etc. Just search for your show (or paste in your RSS feed), and we'll generate a website for you automatically.",
  "data/ph-top/2022/5/growegy.json": "Bring transparency to marketing and sales tactics with the https://www.growegy.com/. We visualize your plans by connecting calendars, tabular, and timeline views. Enhance your data with Salesforce (more platforms soon) and reveal performance trends.",
  "data/ph-top/2022/5/uprise-2.json": "Uprise looks at your *whole* financial picture and tells you exactly what to do with your money, for free: tax strategies, the best accounts, investment best practices, which benefits to use, etc. We've unlocked an average $1.5M (!) in net worth per user 🎉",
  "data/ph-top/2022/5/iplan-ai.json": "Making an itinerary should be easy and fun and not consume more than a few seconds. iplan.ai is designed to save your time",
  "data/ph-top/2022/5/microstartups-co.json": "MicroStartups.co is a directory of profitable micro-startups around the globe. Learn how the best micro-startups were built, launched, and monetized.",
  "data/ph-top/2022/5/web3-talent-board.json": "There is a whole new world to build in Web3 and companies are still hiring! Sign up with your wallet or email, complete your profile and let startups and DAOs reach out to you.",
  "data/ph-top/2022/5/paste-keyboard.json": "Paste Keyboard supercharges the default iOS keyboard to give you instant access to everything you've copied on any of your devices. With seamless integration, it brings the smooth, effortless flow of Paste's desktop experience to your mobile devices.",
  "data/ph-top/2022/5/the-shiva-sunglasses.json": "Unique, Cotton & Wood & Resistant Sunglasses - From city life to outdoors, combining protection, style & sustainability: 9 Layers Polarized Lens | Built to Last | Amazing Fit",
  "data/ph-top/2022/5/unwrapped-design.json": "A universal prototyping kit that allows you to wireframe a landing page in minutes, not hours. Reusable, simple and modern.",
  "data/ph-top/2022/5/smartcat-translator-for-figma.json": "Click, click! Your Figma sketch now speaks other languages! We've created something that Figma users have been missing for years: the ability to work on multiple language versions of the same design, with live translations and previews.",
  "data/ph-top/2022/5/apps-for-ukraine.json": "AppsForUkraine.com offers an access to a bundle of premium apps for a weekly donation to humanitarian help in Ukraine. There are already 20+ products with new ones coming in every week.",
  "data/ph-top/2022/5/makers-most-viral-tweets.json": "Looking for inspiration on what goes viral? MMVT lets you view the single best tweet from each of the best makers on Twitter to see what translates. Data refreshes every few hours. Find your inspiration today!",
  "data/ph-top/2022/5/anonymitybot-for-slack.json": "Anonymous thoughts in Slack, moderated by AI and team effort. Trusted by over 1000 teams. Anonymously post, reply, poll and vote, whisper, shout-out, give message karma and more! Admins can control the AI limits, allow specific channels and more!",
  "data/ph-top/2022/5/indent-for-google-groups.json": "With Indent, your team can request and review access from Slack and users can get on-demand, auto-expiring access to resources in seconds. From groups in Okta or Google to teams in GitHub, you can manage access with a frictionless user experience.",
  "data/ph-top/2022/5/thunkable-figma-integration.json": "We are proud to launch Figma import capabilities for Thunkable’s no code app development. Bring designers even closer to your mobile product by creating the perfect UI in Figma and quickly adding functionality with Thunkable.",
  "data/ph-top/2022/5/verto-global-accounts.json": "Clients can receive and hold funds in up to 25 currencies using Verto Global Accounts. Users can then make payments in 50 other currencies wallets and pay in 190+ countries in these countries.",
  "data/ph-top/2022/5/soli-2.json": "- Get cashback for spending in-person in the US and online - Log in with a Gmail or Apple ID, connect a bank account, find local deals - Watch your balance grow when you spend at 5000+ partnered retailers",
  "data/ph-top/2022/5/supa-palette.json": "Supa Palette plugin for Figma is a powerful palette editor/generator for modern designers. Quickly create beautiful, harmonious and accessible-first palettes or export them for the most popular web frameworks & formats.",
  "data/ph-top/2022/5/timeplanner.json": "A comprehensive solution for managers to manage resource: Employee Profile, Time Tracking, Timesheets, Vacation/Leave, Holiday, Billing Rate & Cost etc. Rich features and modern designed visual board make it the only tool you need to work with your team.",
  "data/ph-top/2022/5/illustrator-svg-import-plugin-for-figma.json": "Import your illustrator and SVG files into Figma. This plugin fixes most import issues, including: •&nbsp;Copy paste from Illustrator to Figma •&nbsp;SVGs using •&nbsp;SVGs using HSL/HSLa •&nbsp;SVGs with malformed width/height",
  "data/ph-top/2022/5/linkedin-hashtag-analytics-2-0.json": "Reach a wider audience on LinkedIn by equipping your content with top hashtags. Get the latest insights, from follower, like and comment counts to follower growth trends. Download Hashtag Analytics Chrome extension here: https://bit.ly/HashtagAnalyticsPH",
  "data/ph-top/2022/5/mana-3.json": "What do you want to do with your life? How do you actually get there? On Mana, you get practical advice directly from world-class builders, creators & professionals. Meet 1-to-1 or join livestream discussions. Find communities with others on the same path.",
  "data/ph-top/2022/5/growth-hacking-kit.json": "✅ 100+ Places to Post your Startup ✅ 100 Product Hunt Templates ✅ 40+ Communities for Founders ✅ 25 Cold Email and LinkedIn Templates ✅ 70+ Tools ✅ 70+ Growth Guides, Checklists and Tips ✅ Launch Checklist if You Don't Know Where to Start",
  "data/ph-top/2022/5/gummie.json": "I created a **FREE Gumroad template** to use for your next digital info product. Instead of using the generic Gumroad landing page, design your own CUSTOM product page that updates in real time with your sales, social proof and meta data. Get started for FREE.",
  "data/ph-top/2022/5/ramper.json": "Ramper is a free web3 SDK for DApps to onboard users quickly. For users that don’t already have a wallet set up — DApps can integrate Ramper to onboard them instantly using email, and have them purchase crypto directly in-app.",
  "data/ph-top/2022/5/cabal-app.json": "The Cabal mobile app makes it easy for investors to help their portfolio companies with sales, marketing, recruiting, and more. It’s a founder-friendly, secure workspace for offering contributions and scaling your time. Sign up to join our beta today.",
  "data/ph-top/2022/5/ascii-art-paint.json": "free & open-source web-based application for creating and editing images consisting of text characters & hieroglyphs (ASCII graphics / Shift_JIS art / Kaomoji and many others). The tool does not require an internet connection and can work offline in a browser.",
  "data/ph-top/2022/5/flips-watch-2-0.json": "Flips Watch fetches your NFT trading history from the blockchain and calculates each profit/loss you make. Tradings on OpenSea, LooksRare, X2Y2, Gem.xyz, NFT Trader, etc. are all supported. It also supports the aggregation of multiple wallet data.",
  "data/ph-top/2022/5/startab.json": "Startab creates software for people who like their bookmarks organized and helps them access their links visually.",
  "data/ph-top/2022/5/nft-export.json": "NFT Export lets you generate and export unlimited NFT collections with no charge, no watermarks, etc. We've worked hard to bring a service like this to enable independent artists experiment with generative art and build amazing collections."
}