{
  "data/ph-top/2021/8/slickr.json": "Slickr is the most powerful and the easiest app to create beautiful cover images for your hashnode blog. Slickr lets you be flexible by handling backgrounds, gradients, patterns, images, icons, bookmarks, uploads and a lot more.",
  "data/ph-top/2021/8/boost-c0f1acd1-0a1d-4a8e-8544-e8044e837587.json": "Get interactive training tailored to your fitness level and motivation by having every repetition counted for you. Boost sees your movements, motivates you, and gives you hints on how to improve your form. All you need is your smartphone!",
  "data/ph-top/2021/8/24hourhomepage-2.json": "A playful experiment in Art & Time. ⏰ Visit & see 1 image per sec for each sec of the day. Repeats every day. 🔁 Forever. Tell a joke, promote a webcomic or grow business in this fun, 1OAK creative format. There are 86,400 seconds in a day. Which are yours? ✌️",
  "data/ph-top/2021/8/best-digital-ads-of-2020.json": "The Best Digital Marketing of 2020 features the best brand campaigns from the last year. - Over 100 incredible examples of how to hack social networks, shoot films, and create campaigns that generate tons of PR to grow your company.",
  "data/ph-top/2021/8/okrshub.json": "OKRsHub is the easiest way you can track your personal and professional goals. Google, Facebook and LinkedIn use the proven Objectives and KeyResults(OKRs) to track their organization goals. Using OKRsHub, you can keep yourself motivated and on track!",
  "data/ph-top/2021/8/botion.json": "Using the Botion integration, Notion users can send invoices to their customers directly from their Notion workspace. Quickly configure your settings, add customers, and send invoices in minutes! Read the docs at https://api.botion.so/guide for more!",
  "data/ph-top/2021/8/affirm-5.json": "Daily affirmations help shift your mindset to positive thinking. Get daily motivations by verbally affirming your dreams and ambitions. Choose your goals and get personalized content every day. Set reminders to be delivered throughout the day.",
  "data/ph-top/2021/8/coaster-2.json": "Coaster makes it easier for you to search for photos from the massive library of free stock photos on Unsplash. Download, copy to clipboard and do more with a simpler interface on your desktop.",
  "data/ph-top/2021/8/tryp-com.json": "We search through thousands of airfares, hotel prices and destinations to find the perfect getaway for you!",
  "data/ph-top/2021/8/tactic.json": "Tactic puts collaboration and personal connection at the center of your hybrid organization. ❤️ We bring teams together in the office and provide companies with data to make long-term decisions based on office space usage. 😎",
  "data/ph-top/2021/8/frontwork-component-marketplace.json": "Buy and sell high-quality frontend components. Speed up your development by downloading prebuilt components in React, Vue, HTML, and more. Earn money for selling your own components.",
  "data/ph-top/2021/8/emoji-by-craftwork.json": "Emoji is new cool way of expressing emotions and presenting your ideas. Get 3D emojis to satisfy all your work requests and have fun with these cuties. Implement our emojis into apps, presentations, and landings, use them in Telegram and WhatsApp as stickers.",
  "data/ph-top/2021/8/zen-2.json": "🧘🏽‍♀️ Zen mirrors your posture and gently alerts you when you slouch. 🔐 The desktop app uses your camera to monitor your posture, without recording or storing any visuals.",
  "data/ph-top/2021/8/vin-decode-api.json": "Programmatically decode VINs to identify year, make, model, trim, specifications, colors, options and more. Get your free API key in seconds!",
  "data/ph-top/2021/8/picmaker-2-0.json": "Picmaker 2.0 is the shortest way to design anything. Be it ads, presentations, memes or social posts - if you need design inspiration, come to us. But, why are we special? Our AI-based MAD Button gives you unique design combinations in minutes. Give it a try!",
  "data/ph-top/2021/8/varos.json": "Real-time benchmarks for FB Ads KPIs like ROAS, CPA, CPM and CTR. DTC companies and agencies use us to see how they stack up to peers, find metrics to optimize and answer questions like \"was this spike in CPM due to my ad or the market?\".",
  "data/ph-top/2021/8/wicked-backgrounds.json": "Wicked Backgrounds is a free web app for generating nice wave gradients that you can use for your designs. I hope you can use it in your creative projects! 👨🏻‍🎨",
  "data/ph-top/2021/8/intro-11.json": "With Intro.so, you can log in at 1:59 PM for your 2 PM meeting and be prepared like for a TED talk. See attendees' company details, relevant CRM notes, and linkedin activity. All inside of Zoom or Google Meet.",
  "data/ph-top/2021/8/swiftui-apps.json": "This is the place to find out about new apps, and get inspired to build your own in SwiftUI! These apps are the best examples of what SwiftUI is capable, check them out by visiting the site today!",
  "data/ph-top/2021/8/customily.json": "Customily makes it easy for online stores to sell personalized products, by giving shoppers a simple but powerful design tool that shows live previews of their personalization and automatically transforms them into ready to print, engrave, or embroider files.",
  "data/ph-top/2021/8/odo-2-0.json": "Odo is a Multi-skilled Artificial Intelligence that aims to be an empathetic companion for every stage of life. It's Human-like A.I. for Self-Care, that focuses on learning ✅, relaxing ✅ and healing ✅, in a private secret space, all in conversations.",
  "data/ph-top/2021/8/yac-remote-work-pack-on-setapp.json": "A collection of 15 tools for Mac that optimize remote work and let you focus on what’s important without burning out.",
  "data/ph-top/2021/8/hyperbeam.json": "Hyperbeam is a shared browsing site that lets you surf the web and watch TV shows and movies together with the people you care about while apart. Free to use (with optional Premium). No download necessary.",
  "data/ph-top/2021/8/request-video-by-sendspark.json": "The fastest way to support customers. Instead of scheduling a Zoom meeting, simply send a video request link to your customer in Gmail, Intercom, Zendesk, or anywhere. They can instantly record themselves or their screen - no install needed!",
  "data/ph-top/2021/8/citycoins.json": "CityCoins give communities the power to improve and program their cities, while providing crypto rewards to individuals and city governments alike. Anyone can mine CityCoins, program them via smart contracts, and even earn BTC as the network is used more.",
  "data/ph-top/2021/8/integrately.json": "Integrately 2.0 helps non-techies integrate their apps and automate their processes in 1 click. To make this possible, we have created over 8 Million ready automations! And are constantly adding more. So all you need to do is activate your automation.",
  "data/ph-top/2021/8/the-upside-network.json": "📍 We partner with local creators to produce local startup media. 🎙 We provide the hardware, software, and training to launch & maintain your podcast or newsletter. 🤝 We handle sponsorship and operations and share revenues with our local partners.",
  "data/ph-top/2021/8/adonisjs-2.json": "AdonisJS is a backend framework that helps you create data-driven web applications, like Rails, Laravel or Django but for Node. Using AdonisJS, you can handle the HTTP requests, query the database, authenticate users, upload files, and more.",
  "data/ph-top/2021/8/resource-center-by-userguiding.json": "Our 2000+ customers asked for a way to gather all their resources in one place... so we built it! Showcase blog posts, help materials, product updates and more in your app with our new free widget.",
  "data/ph-top/2021/8/mapus.json": "Mapus is an open source tool to explore and annotate collaboratively on a map. You can draw, add markers, lines, areas, find places to go, observe other users, and much more.",
  "data/ph-top/2021/8/rentera.json": "RentEra is an online rental platform with the goal of transforming the conventional rental industry by making the process digital. 🆓 Free to use, No Sign up Required. 📍 Location specific search tool. 🔍 Browse 100 of products within your locality.",
  "data/ph-top/2021/8/document360-7-0.json": "Instantly create an online Self-Service Knowledge Base for your Customer and Employees (accessed either publicly or privately). Reduce the volume of support tickets by having an awesome knowledge base for your customers.",
  "data/ph-top/2021/8/neuton-ai-1.json": "Explore data insights and make predictions leveraging Automated Artificial Intelligence. • NO coding • NO need for technical skills • NO need for data science knowledge",
  "data/ph-top/2021/8/mailmodo-email-api.json": "Mailmodo API for Transactional Email helps developers set up transactional emails using API without coding emails. ⏳ Reduce set-up time 📧 Forms inside emails for better user experience & conversion 📰 Create & edit emails in minutes 📤 Proven deliverability",
  "data/ph-top/2021/8/evidently-ai.json": "Evidently helps evaluate and monitor machine learning models in production. The tool generates visual reports on model performance to detect and debug issues. Follow the releases on Github: https://github.com/evidentlyai/evidently",
  "data/ph-top/2021/8/zesty-3.json": "Zesty’s autonomous cloud management solution accelerates growth by increasing efficiency and significantly reducing cloud spend. Our platform automatically adjusts compute resources to match real-time application needs, with no human input.",
  "data/ph-top/2021/8/nocode-bible.json": "You will increase the speed of development while reducing the learning curve of Bubble. In the free versions you will find actions and operators as well as tips. In the Pro version, we've brought together all your needs when developing a Bubble app.",
  "data/ph-top/2021/8/corvus-one.json": "Full L4 autonomy automating pallet/carton inventory checks for large facilities. No human pilot, no thousands of location stickers or beacons needed.",
  "data/ph-top/2021/8/startup-blowup.json": "Find out the reasons why a startup could blow up in a random way. Check out the real stories of failure, learn from mistakes and avoid joining the ranks of failed startups. Made with ❤️ in Ukraine 🇺🇦.",
  "data/ph-top/2021/8/ppt-2-site-by-slideflow.json": "PPT 2 Site converts PowerPoint files into clean HTML and CSS. It's totally free and comes with hosting.",
  "data/ph-top/2021/8/angel-match-2-0.json": "Angel Match is a database of 90k+ investors that frees you from the tedious process of searching for the right investors for your business. We've categorized the database by investment focuses, locations, investment stages, investor types.",
  "data/ph-top/2021/8/storylane.json": "Storylane helps marketing and sales teams create and share clickable and interactive product demos. You can embed these demos on your website, campaigns or sales followups to get highly qualified leads and win more deals.",
  "data/ph-top/2021/8/thundra-foresight.json": "Gain full observability for your CI Pipeline with Foresight. Identify slow and flaky tests, get to green builds faster.",
  "data/ph-top/2021/8/influencer-marketing-toolkit.json": "Have you ever been influenced to purchase something after seeing your favorite public figure using it? Finding quality influencers, on the other hand, can be difficult, which is why we at Clientjoy created this Influencer Marketing Toolkit.",
  "data/ph-top/2021/8/ko-fi-memberships.json": "Build a reliable, monthly income with Ko-fi Memberships! Let your most important fans support you at different tiers and unlock unique benefits like Discord roles, exclusive content or physical rewards.",
  "data/ph-top/2021/8/week.json": "Week is a task management tool where calendar is the main part of the app. To get things done you have to schedule them first and Week helps you to do exactly that. Create projects, assign them different colours and see how you spend your day.",
  "data/ph-top/2021/8/doubletick-for-gmail-2.json": "https://www.getdoubletick.com is a Free and Unlimited email tracking tool for Gmail and G-Suite, adds double checkmarks ✔✔ to your mail if it is read by the recipient (Just like WhatsApp) and notifies you with real-time notification.",
  "data/ph-top/2021/8/meh-camera.json": "Welcome to MEH camera ツ Snap a pic and replace any faces with any you have uploaded. It's fun and and not MEH ツ",
  "data/ph-top/2021/8/1300-geometric-shapes.json": "This is an absolutely free collection. Use it for whatever you want. Also available in Figma.",
  "data/ph-top/2021/8/mockfire.json": "Mockfire lets any designer or marketer create interactive mockups and present their content for social media and google ads more professionally. It’s also the first tool to integrate a mock-up editor for Google Banner Ads.",
  "data/ph-top/2021/8/vinco.json": "Vinco is addressing the large skills gap in LatAm by making it easy for companies to pay for their employees’ education and in turn improve employee retention.",
  "data/ph-top/2021/8/sugarokr.json": "A simple and easy-to-use free OKR management software for teams. SugarOKR keeps teams focused on goals that truly matter, and aligned with the larger vision of the company. nlocks the true potential of your OKRs, and keeps your teams motivated.",
  "data/ph-top/2021/8/plai-2.json": "Plai is the ad tool for creators, solopreneurs, & side-hustlers to launch targeted ads in seconds across YouTube, TikTok, Google, & Instagram, no experience required.",
  "data/ph-top/2021/8/teqatlas.json": "With TeQatlas founders and investors can now find each other, match, communicate, share documents & close deals 3x faster ⚡",
  "data/ph-top/2021/8/mysignature-agency-hub.json": "Agency Hub is an email signature management solution for Marketing Agencies, Design Studios, and IT service providers: ✍️Create signatures that fit customers’ branding 🙌Manage customers' signatures in a dashboard 🔥Allow customers to manage their signatures",
  "data/ph-top/2021/8/focus-323cb154-59ed-4497-b7dc-6a92f00a9e19.json": "Manage all company’s OKRs and track their progress with Focus. Use daily check-ins to connect action items with your most important goals. Align your team around objectives to achieve better results. And do it with a simple and intuitive interface.",
  "data/ph-top/2021/8/virtuali.json": "Virtuali is a visual, world-based social platform aiming to recreate in-person experiences online by allowing people to personalize an avatar and room, make new connections, send postcards in a post office, and experience a virtual world.",
  "data/ph-top/2021/8/flowdash-2-0.json": "Flowdash helps you transform any database query into a full-blown internal tool. Simply connect your database and build an app in minutes. Bring efficiency to your processes with built-in collaboration, task tracking, checklists, automations, and more.",
  "data/ph-top/2021/8/modifai.json": "ModifAI.direct will change how images are edited by using AI to fully automate the formerly manual steps it took to make images ready for use on e-commerce sites. We will go beyond simple background removal and accommodate common e-commerce image needs.",
  "data/ph-top/2021/8/walrus-3.json": "Walrus is a youth focussed neobank in India, helping Indians save, spend and invest better. We offer a fully digital, smart checking account that operates 24x7 and opens in 2 minutes. You get a sleek, neon VISA Card with flexible controls and amazing rewards.",
  "data/ph-top/2021/8/js-kid-pix-1-0-2021.json": "I have many fond memories of Kid Pix 1.0, so I remade it as a website.",
  "data/ph-top/2021/8/image-resizer-by-biteable.json": "Resize images for all common social media and ad formats with Biteable's simple free image resizer. Set a focus point and download all 50+ formats in a single click. No signup required.",
  "data/ph-top/2021/8/buddy-15.json": "87% faster CI/CD adoption time by teams Even the most complicated CI/CD workflows take minutes to create. Buddy is DevOps adoption winner. 12 seconds of average deployment time Smart changes detection, state-of-the-art caching, parallelism, and optimisations",
  "data/ph-top/2021/8/koia.json": "Invest in what you know and love with Koia. At Koia, we fractionalise iconic assets so anyone can invest in them. We're starting out with collectibles, like fine wine, watches and Pokémon Cards.",
  "data/ph-top/2021/8/kensho-care-matching.json": "Today, Kensho is announcing Care Matching: a free one-on-one service that offers personalized provider recommendations based on health goals and preferences, more quickly connecting patients to the right holistic care.",
  "data/ph-top/2021/8/gobillion-2.json": "Gobillion is the Pinduoduo for India – we make e-commerce social for the next 400M customers in Tier 2+ cities in India, enabling customers to buy together in groups and get great deals!",
  "data/ph-top/2021/8/palenca.json": "Palenca makes it easy for companies in LatAm to verify employment data and identity, enabling them to run background checks and provide financial services. Unicorns like Kavak and Lalamove use us to provide financial services and run background checks.",
  "data/ph-top/2021/8/pillar-2.json": "Pillar makes credible coaching accessible from providers accredited w/ the National Board of Medical Examiners, trained in an evidence-based approach to support the connection between your mental agility and physical health (sleep, nutrition, and stress).",
  "data/ph-top/2021/8/tether-5.json": "Tether is the easiest way for your team to report bugs & product feedback Enable your team to give context with screen recordings while Tether gets technical data for you. Manage your feedback on the Tether dashboard, or integrate with tools like Jira + more",
  "data/ph-top/2021/8/youdict.json": "Not sure how to say/use \"Saoirse Ronan\", \"Superfluous\", \"Take a rain check\", etc.? You can now search millions of YouTube video captions for words, expressions & even names! Hear native speakers say it. And, use it with 100% confidence!",
  "data/ph-top/2021/8/mello-3.json": "mello is the new standard that companies use to measure, track and action on wellbeing to inspire happier, healthier, more motivated teams. Our check-ins assess, address, and prevent burnout within your team’s current workflow to increase employee retention.",
  "data/ph-top/2021/8/angel-s-club-by-clearangel.json": "A community for early stage e-commerce founders who lack or are seeking funding - to discuss funding methods and non traditional strategies to grow your business. Join to learn about funding strategies, while connecting with like-minded entrepreneurs!",
  "data/ph-top/2021/8/diverse-fyi.json": "A free directory for hiring managers and recruiters to discover communities where they can support, sponsor, and source diverse tech talent. Combined, these communities can reach over one million potential candidates - with more being added every week.",
  "data/ph-top/2021/8/desk360-v2.json": "A new omnichannel customer support platform that enables you to manage customer messages coming from a multitude of platforms on a single page, designed to speed things up and provide the best customer support possible.",
  "data/ph-top/2021/8/zenkit-projects.json": "What defines an ideal project management solution? For us, it’s a place where everyone can come together and focus on the things that really matter. Projects provides the tools, reports, global views, and dashboard you need to keep your projects on track.",
  "data/ph-top/2021/8/cococart.json": "Build an online store 10X faster than Shopify. Local businesses can set up a store in minutes with no code, no design, and no app downloads.",
  "data/ph-top/2021/8/razorpayx-payroll-for-slack.json": "Introducing RazorpayX Payroll for your favourite workspace tool -Slack 🔥🔥 🔥 With this, teams can collaborate over common HR tasks related to leaves, reimbursements, payslips, attendance etc -all within slack. No more wasting time switching tools! 🚀",
  "data/ph-top/2021/8/removaly.json": "It's crazy how much of your sensitive personal information is floating around the internet for anyone to find… So we created a software that finds and removes this information, then scans DAILY to make sure your information stays off of the internet.",
  "data/ph-top/2021/8/imagify-4.json": "Ever wondered why isn't there a service that lets you choose what all should appear in your OG card? Introducing Imagify, a tool that marketers, growth hackers, founders, all love alike. With Imagify, you can control what your links should look like.",
  "data/ph-top/2021/8/cache-4.json": "Cache creates and operates convenience stores on DoorDash and UberEats. We use tiny, automated dark stores to pass items to delivery drivers.",
  "data/ph-top/2021/8/arc-3.json": "Arc is a CDN for the modern web. Instead of expensive servers in distant datacenters, Arc's network is comprised of browsers. Like yours. It's larger, grows faster, scales with demand, and delivers content at a fraction of the cost of every CDN before it.",
  "data/ph-top/2021/8/humans-in-tech.json": "Humans in Tech (HIT) is a networking platform designed to spark spontaneous and inspiring conversations among people in tech. It takes a casual approach to professional networking and makes 1-on-1 chats with inspiring individuals easier than ever.",
  "data/ph-top/2021/8/mentorcam.json": "Mentorcam is a marketplace where people can access well-known public figures for 1:1 advice and mentorship. Find a mentor and ask them for advice on a range of topics from career development to startup fundraising and dating to name a few.",
  "data/ph-top/2021/8/octauthent.json": "Octauthent is the easiest way to add authentication to any website! - Create a login form in less than a minute - Integrate it to your site without a single line of code - Manage your users from your Octauthent dashboard",
  "data/ph-top/2021/8/monto-2.json": "Monto provides employees of our affiliated companies 24/7 access to their earned wages on-demand for a low fixed fee. Users decide when to get paid, obtaining the flexibility they need to achieve financial wellness and avoiding thousands in costs and fees.",
  "data/ph-top/2021/8/partybid.json": "PartyBid is a product that lets groups of people combine their capital and bid on NFT auctions together. Anyone can create or join a PartyBid, contribute ETH, and place bids as part of a collective.",
  "data/ph-top/2021/8/kidhab.json": "KidHab is a collaborative parent-child app which helps develop useful habits in an entertaining way. A unique gamification system will motivate your child to perform useful habits regurarly otherwise the progress is lost if the lessons are missed.",
  "data/ph-top/2021/8/design-junction-2.json": "Design Junction is a one-stop resource library for Designers and Creatives with curated list of best resources handpicked from around the web.",
  "data/ph-top/2021/8/figen.json": "Free post cover & background generator tool for any purpose.",
  "data/ph-top/2021/8/suncheck.json": "Are you getting enough sun? Suncheck allows you to record and archive your sunlight intake. Build healthy habits by learning how much solar energy you are getting!",
  "data/ph-top/2021/8/64-design-tips.json": "🚨 Free for a limited time! A selection of 64 design tips based on our 20+ years of experience and over 500 product designs. ⬇️ All form designs tested on a sample of 5000 users.",
  "data/ph-top/2021/8/user-interface-museum.json": "User Interface Museum is a collection of UIs of popular desktop and mobile apps showcasing how they’ve changed over numerous years — plenty of examples of design successes and mistakes to learn from.",
  "data/ph-top/2021/8/algouniversity.json": "AlgoUniversity bridges the gap between the CS curriculum at universities and what is required by the industry. We offer live classes, industry-relevant projects, and learning products that prepare students for software engineering jobs at top tech companies.",
  "data/ph-top/2021/8/ph100.json": "PH100 updates you on ProductHunt launches that reach 100 upvotes. These are considered 🔥🔥🔥. Available on Telegram and as an auto-updating Airtable base. Each launch is analyzed on the TimeTo100, Maker, CommentUpvoteRatio & more. Get access on https://www.ph100.club",
  "data/ph-top/2021/8/calliope.json": "Calliope represents the simplest way to create audio mixes and memos collections. A project allows recording and importing audio segments that can be trimmed and merged in a few taps.",
  "data/ph-top/2021/8/alfred-4-5-universal-actions.json": "Alfred 4.5 brings a new Powerpack feature: Universal Actions. Take any text, URLs or files and perform actions on them from anywhere within Alfred or on your Mac using your Universal Action hotkey.",
  "data/ph-top/2021/8/sliceq.json": "SliceQ is a restaurant management system that streamlines phone, in-person, and online orders. With SliceQ, owners can manage the staffing shortage and weekend rush while increasing revenue by over 10%.",
  "data/ph-top/2021/8/nifty-drops.json": "Helping NFT Collectors find NFT drops across all blockchains & NFT Creators MARKET your NFT launches for FREE.",
  "data/ph-top/2021/8/blogody-2.json": "Create and publish your blogs easier, faster and more secure. Publish on a global CDN edge in seconds. Say goodby to slow sites or long build times. Regain control over your publication data and copyrights: You own your own words - with Blogody.",
  "data/ph-top/2021/8/promoz.json": "Promotional videos are one of the very first touch-point that a user has with a product Having a creative promo video that storytells the problem and solution that you are solving can take your product a long way 🚀40+ creative & outstanding inspirations",
  "data/ph-top/2021/8/ai-writer-chrome-extension.json": "Use the world's most advanced AI to write for you. Blog content, landing pages, ad copy, and so much more.",
  "data/ph-top/2021/8/customerinsight.json": "Find experts to help you with customer development interviews and customer discovery tasks. They did it a thousand times.",
  "data/ph-top/2021/8/nomadely-space.json": "Skip domestic chores, worries about movement of your team and how to spend leisure time - focus on the main! 👩🏻‍💻✨ We create conditions for living - You move forward.",
  "data/ph-top/2021/8/go-eth-me.json": "Go ETH Me is a Web3 application which helps to raise fundraisers using ethereum without any middleman. It is the first step towards a decentralized future where donors can directly support causes.",
  "data/ph-top/2021/8/livemart-storefront.json": "LiveMart provides storefront. Using storefront you can create your online store in minutes with SSL & CDN backed subdomain onlivemart.store. You can also configure custom domain.",
  "data/ph-top/2021/8/yichi.json": "YiChi is a language learning app that helps you perfect speaking Chinese Mandarin. Listen to the right pronunciation and tones, record your version, get instant accurate feedback with our AI based voice evaluation and keep practicing till you get it right.",
  "data/ph-top/2021/8/lekh.json": "Lekh is a digital notebook that comes with the experience of a physical notebook. It comes with colorful highlighters, different page styles, sticky notes and more. It is a free Progressive Web Application and can be downloaded to be used offline.",
  "data/ph-top/2021/8/lasso-affiliate-wordpress-plugin.json": "Lasso is the new way to grow your affiliate income using CTR-boosting modern product displays, broken link alerts, keyword monetization, and organized link management. We even find new affiliate programs to join from your existing links. 🔥",
  "data/ph-top/2021/8/24-hours-of-nft.json": "24 Hours of NFT An infinite loop of awesome NFT art. Claim your seconds of the day to have your NFT art displayed on every day. Forever. Over 7200 seconds have already been claimed by 140+ artists! See it for yourself on https://www.24hoursofnft.com.",
  "data/ph-top/2021/8/financial-model-template.json": "Building a well-structured, easy-to-use, accurate financial model for your startup takes dozens of hours - so we decided to do most of the work for you and came up with a template.",
  "data/ph-top/2021/8/buildinpublic.json": "#buildinpublic is a movement of makers publicly sharing as they work on their projects. This website lists all the #buildinpublic tweets in an easy-to-read feed. Discover what other makers are up to and add your own updates by using the #buildinpublic hashtag",
  "data/ph-top/2021/8/graha.json": "Graha is the first real-time live website collaboration tool where teams can edit website text, make quick design iterations with our Sliders/AI powered CSS editor, collect feedback directly on the live website, and finalize the live website design 10X faster.",
  "data/ph-top/2021/8/neuroflash.json": "💡 Create and optimize your marketing copy in real-time with our artificial consumer brain and find the right marketing messages. 🕒 No more guesswork. Save time. ✔️ Always write fresh, with neuroflash. 🎁 29€/mo (first 200 users).",
  "data/ph-top/2021/8/ai-link-building-pbn-manager.json": "Our AI generates unique and fast, quality Websites with keyword related authoritative content! Is as simple as writing a single keyword. Our AI learn all about it and generates the content and a hosted Website with up to 98% Page Speed, CDN and distinct IPs.",
  "data/ph-top/2021/8/watercoolr.json": "Watercoolr is an app that helps you connect with other remote workers day and night across the world. Giving you easy access to socialise, collaborate or simply just 'be' around other people. Select which watercoolr room you want to visit and get connecting.",
  "data/ph-top/2021/8/are-you-ready-to-freelance.json": "Are you ready to start freelancing?—Here's a tool that will help answering that! Download the MIRO board, complete the forms, and learn whether you have a marketable service, the resources, and the soft skills necessary for a successful freelance business!",
  "data/ph-top/2021/8/readmark.json": "ReadMark is an RSS reader that is... markable. Besides essential features that every other RSS readers and read-later services offer, ReadMark uniquely provides you a smooth and distraction-free note taking experience, \"Mark\". Try it!",
  "data/ph-top/2021/8/audience-kitchen.json": "Audience Kitchen makes it easy for advertisers to search & browse through 95,000+ audience targeting options that are normally hidden in Facebook’s interface. Build your perfect audience, export to your FB Ads account, and start targeting in seconds.",
  "data/ph-top/2021/8/snapcalorie.json": "SnapCalorie is an app where you can take a photo of any meal and get an accurate calorie count. Created by the co-founder of Google Lens, logging a meal with SnapCalorie takes seconds and on average is more accurate than a trained nutritionist.",
  "data/ph-top/2021/8/statiks-2.json": "See your most listened music on Spotify for both songs and artists. Also, create Spotify playlists from your most listened to songs.",
  "data/ph-top/2021/8/yare-io-2.json": "Real-Time Strategy game, but instead of using mouse, you control your units by writing JavaScript code.",
  "data/ph-top/2021/8/invezo.json": "Invezo is an analysis tool for stocks and cryptocurrency. We’re the only app that integrates social media data with classic market data for the new generation of investors.",
  "data/ph-top/2021/8/keyri.json": "• Mobile SDK that enables passwordless sign up/login with a tap on mobile and QR on desktop • Eliminates account takeover fraud by leveraging device-based biometrics • Can be used as a login method or as a second verification layer in high risk cases",
  "data/ph-top/2021/8/great-email-templates.json": "We think the email design templates you get in automation tools just aren't very good. So, we designed some. These are email templates designed specifically for SaaS growth marketers running nurture campaigns that you can import to HubSpot without code.",
  "data/ph-top/2021/8/devbox.json": "A small useful collection of software (encoders, decoders, generators, viewers, etc.) in a desktop application (supports Windows, macOS and Linux).",
  "data/ph-top/2021/8/remix-4.json": "Remix makes it easy for anyone to host or attend meetup-style events directly from your smartphone. With social features at its core, Remix enables participants to mingle in a fun 2D event space or join audio rooms with stages, presenters and screen-sharing.",
  "data/ph-top/2021/8/qooore-2-0.json": "Social investing app where successful financial influencers and professional traders share their insights about markets. Follow the best analysts and get trading ideas. Qooore helps GenZ learn how to earn money through validated finfluencers.",
  "data/ph-top/2021/8/actiondesk-2.json": "Actiondesk lets everyone in your company easily answer questions with data - without bothering the engineering team - It's a spreadsheet: you can build pivot table and use formulas - Actiondesk connects to your database and updates the data every hour",
  "data/ph-top/2021/8/flow-club.json": "Join fellow makers in remote co-working sprints to eliminate distraction, find your flow and double your output.",
  "data/ph-top/2021/8/grow-295c75e4-28e7-4d80-819c-9d0f05cf4152.json": "Grow is an automatic habit tracker that helps you build long-lasting habits with Apple Health, so you can finally say goodbye to manual recording. It also connects your habits by Perfect Day challenge to help you achieve all your goals and win a medal!",
  "data/ph-top/2021/8/anyfiddle.json": "Anyfiddle is a platform for developers to build, run and share code online in any language. Get started with coding using pre-built templates like NodeJS, React, NextJS, Django, Ruby on Rails etc And sharing your code is as easy as sharing the url.",
  "data/ph-top/2021/8/drinkie.json": "Drinkie is a smart self-cleaning water dispenser that rinses your pet’s dish for you and ensures their 5-day water supply. With its smart app, you can remotely control the rinsing time, monitor your pet’s drinking habits and the water level in the dispenser.",
  "data/ph-top/2021/8/paloma-for-shopify.json": "Shopify stores can now launch DM stores – build automated shopping conversations that convert 2–10x more than websites.",
  "data/ph-top/2021/8/text-to-video-by-creatorkit.json": "Create fast-paced text videos with animated motion graphics, in minutes. ⠀ A new tool built on top of the CreatorKit platform, that you can use with 100+ video and story templates. ⠀ Lifetime and free access to the Basic Plan only for Product Hunt community!",
  "data/ph-top/2021/8/ira-design-2-0.json": "Build your own amazing illustrations using Ira Design! 🎨 Choose, play, and mix five gradient colors to suit each character you want to use in your project. 🌟 NEW: Outline illustrations available.",
  "data/ph-top/2021/8/playhouse-2.json": "Playhouse is a mobile app for browsing video listings of homes for sale - fun and addictive like TikTok, practical and actionable like Zillow.",
  "data/ph-top/2021/8/weekly-visitor-report-by-clearbit.json": "The Weekly Visitor Report is a helpful new tool, powered by Clearbit Reveal, that identifies companies visiting your website and sends an interactive summary every Friday. It’s completely free, easy-to-install, and instantly adds value to any outbound efforts.",
  "data/ph-top/2021/8/anakin.json": "We help eCommerce stores and brands track granular pricing, vendors, availability, competitors and reviews of products in realtime.",
  "data/ph-top/2021/8/veamly-lite.json": "Get your daily digital wellbeing assessment in order to achieve true work/life balance and optimum productivity in a hybrid work model. Unlock actionable insights and recommendations to kick start your digital wellbeing journey.",
  "data/ph-top/2021/8/playbook-5.json": "Make your cloud storage beautiful. Playbook declutters, auto-tags, and intelligently organizes your creative work. Seamlessly browse, collaborate on, and share what you need with friends, colleagues, clients—or the whole world!",
  "data/ph-top/2021/8/credithero.json": "Running out of AWS free credits? With CreditHero you can use up to $2000 / month extra. Only 25% of startups spend all of their credits. CreditHero deploys your stack into the AWS account of another participating startup - simple!",
  "data/ph-top/2021/8/humantic-ai-for-talent.json": "Talent that truly moves the needle is being bombarded with messages every day. As a recruiter, how do you stand out? Humantic AI accurately predicts exactly what a candidate values, & coaches TAs to personalize their outreach in a way that candidates respond.",
  "data/ph-top/2021/8/compare-to-dev.json": "A simple and convenient service for comparing two images. Will be useful in product development, when you need to check the discrepancies between the design and what has been done.",
  "data/ph-top/2021/8/glass.json": "Your photography is the point. Glass is a new photo sharing app and community for photographers. We’re private and subscription-based — which means no ads, data tracking, public counts, or engagement algorithms.",
  "data/ph-top/2021/8/bugbug.json": "BugBug allows you to automate testing without coding, so anyone can check that their website or application looks and works as it should. It allows you to save time, streamline your testing and reduce testing costs.",
  "data/ph-top/2021/8/new-tetrisly-v-1-5.json": "Tetrisly is one of the most organized starter kits to create the design system's UI component library in Figma. Trusted by 2000+ designers and teams. Version 1.5: Refreshed look & improved structure, Redefined Variants & Auto Layout, Free extra Xenon Theme.",
  "data/ph-top/2021/8/viralcopy.json": "💫 Powered by GPT-3, ViralCopy integrates trends and your own personal tone to generate copy that's authentic, catchy and converts. 🚀 Generate captions, hashtags, ad copy, and product descriptions in seconds.",
  "data/ph-top/2021/8/whaly.json": "Whaly 🐳 is a no code business intelligence platform directly connected to your everyday tools: 🧸 Build metrics without writing SQL 👯‍♀️ Top notch access control and collaboration 🤖 Actionable charts that allow you to drill down the data",
  "data/ph-top/2021/8/berowra.json": "Berowra is an open source CMS for hobbyists and small buisnesses that enables them to start building on top of their content in just three minutes. It comes with an API, file hosting, Markdown support and more! At the moment it's in beta on Deta Space!",
  "data/ph-top/2021/8/the-complete-salesforce-bootcamp.json": "A comprehensive Salesforce Bootcamp that trains students remotely with hands-on projects and industry-recognized credentials for a range of high-paying careers that do not require coding within three months.",
  "data/ph-top/2021/8/pandai.json": "Pandai is a learning app for school students in Southeast Asia. Pandai started last year in Malaysia and now >250,000 students get syllabus-based academic quizzes (personalized by grade, subject & performance) to help them improve their academic performance.",
  "data/ph-top/2021/8/argonaut.json": "Argonaut automates devops on your cloud. Companies leverage Argonaut to generate terraform and kubernetes configurations for automated infrastructure and deployments, in minutes instead of weeks.",
  "data/ph-top/2021/8/queue-0c95e5e2-a2f1-45b8-8523-a0b93a2d2fd5.json": "Queue helps web designers avoid confusing feedback by letting their team and clients leave comments directly on the live website so projects are finished 10x faster. Just paste a URL into Queue to enable commenting directly on the website.",
  "data/ph-top/2021/8/codex-by-openai.json": "OpenAI's Codex is a new machine learning tool that translates your text in the English language into code. Codex is designed to speed up the work of professional programmers, as well as help amateurs get started coding.",
  "data/ph-top/2021/8/zorbi-2.json": "🧠 Zorbi makes studying easy through flashcards that only show up when you forget them. Import premade decks, track your progress, and seamlessly make cards from your Notion notes or any website/PDF.",
  "data/ph-top/2021/8/zappi-ad-predictor.json": "Upload your video ad and get a free performance prediction - See your ad’s areas of strength and weakness - Compare your ad to benchmarks from your industry - Or just gut-check your ad before going live Trained on hundreds of millions of dollars of ads 📈📈",
  "data/ph-top/2021/8/video-calling-api-by-videosdk-live.json": "Videosdk.live assembles low code video calling developer tools for your app. Add our super easy one-click video calling APIs and witness an increased engagement on your application. Avail fully secured chat, recording, customer communication, and more.",
  "data/ph-top/2021/8/processica-customer-portal.json": "Built with no-code tools and minimalistic coding our Customer Portal helps you to start and manage your projects, control your subscription's payments and communicate with Processica Agency team.",
  "data/ph-top/2021/8/analyticsverse.json": "Increase visibility, Eliminate blockers & Deliver faster with engineering analytics from your Git repositories and Project management tools -> Identify and resolve bottlenecks and risks -> Objectively analyze sprints and make sprint retrospectives meaningful",
  "data/ph-top/2021/8/fusebot.json": "Fusebot: Ultimate developer bot for Slack and Discord. Write custom commands in Node.js. Automate, integrate, and do anything on Slack or Discord. No server required. If you can code it, Fusebot can run it. ✨",
  "data/ph-top/2021/8/texta-ai.json": "If you hate writing marketing copy, it definitely will blow your mind🚀. We built 50+ Powerful content generating tools to write copy for any product and for any audience in seconds.",
  "data/ph-top/2021/8/notion-web-designer-hub.json": "From lead stage to project completion, the Notion Web Designer Hub allows you to manage all your freelance projects in one cozy space. - Steps & questions for every client call - Project cost estimation for proposals - Checklists for every project component",
  "data/ph-top/2021/8/hiro-wallet-for-stacks.json": "Hiro Wallet is a safe way to manage your STX, sign into decentralized apps, and protect your funds while interacting with the Stacks blockchain.",
  "data/ph-top/2021/8/picklang.json": "The latest AI technologies are built to make learning process with what you see. Solve tasks using your own photos or our feed, complete challenges, get achievements, explore unlimited content and share your progress with friends!",
  "data/ph-top/2021/8/vance-ai-photo-restorer.json": "With https://vanceai.com/old-photo-restoration/, you can restore your old, damaged, and scratched pictures online for free. AI picture restorer, developed by AI enthusiasts in Vance AI, is made to bring your old photos back to life. Click here to https://vanceai.com/old-photo-restoration/ now.",
  "data/ph-top/2021/8/ui-guideline.json": "It's the handbook that every UI Designer/Developer should include in their workflow. Through synthesizing all the wisdom of the most popular Design Systems and UI Libraries in one place, it makes your work easier and shortens your research time.",
  "data/ph-top/2021/8/the-design-quiz.json": "Do you know how many principles of good design Dieter Rams has defined? Or when the first GUI prototype was created? The Design Quiz is the place for you to test your User Experience, User Interface and Graphic Design knowledge — plenty to learn from.",
  "data/ph-top/2021/8/dwindle.json": "Dwindle is on a mission to help those with student debt become financially free. Americans owe over $1.7 trillion in student loan debt. Our job board product aims to be the solution for those looking to become debt free. Any questions? https://dwindlestudentdebt.com/contact/",
  "data/ph-top/2021/8/100ms-video-sdk.json": "Add live video conferencing to your app in 10x less lines of application code than any other fully customisable video SDK. Built by the team that created live video infrastructure powering billions of minutes a day at Facebook and Disney+Hotstar.",
  "data/ph-top/2021/8/stream-club.json": "Stream Club is the easiest way to design, produce, and broadcast beautiful livestreams, straight from your browser.",
  "data/ph-top/2021/8/literalclub.json": "Literal is the place to keep track of what you've read and discover your next favourite book through the people you trust. It's designed around the idea that trust beats algorithms when it comes to book recommendations and that we are all trusted by someone.",
  "data/ph-top/2021/8/whatsform.json": "WhatsForm is built for those who manage their business through WhatsApp conversations. 1️⃣ Create forms to collect data inside WhatsApp 2️⃣ WhatsApp guarantees 98% open rate for each message 3️⃣ With all the gathered data, Business can operate 2x faster",
  "data/ph-top/2021/8/youtube-highlighter-by-liner.json": "Youtube Highlight is a new feature of Search assistant & Web Highlighting service, LINER. You can highlight not only texts that inspired you but also favorite parts of videos.",
  "data/ph-top/2021/8/apptrana-ddos-protection.json": "AppTrana is a Fully Managed WAF solution, and we are happy to announce the release of Behavioural DDOS Protection feature. With this one can understand the behaviour of their application traffic and ensure protection settings adopt to the changing trends.",
  "data/ph-top/2021/8/seo-powersuite-backlink-api.json": "Crawl the Internet. Register all new and lost backlinks. Estimate the relative authority of all domains and pages on the web, based on their link popularity. Power your own dashboards. Build custom reports. Re-sell our data to your users. The sky's the limit.",
  "data/ph-top/2021/8/mediakits.json": "MediaKits is a creator-first data analytics company built to help independent creators monetize their brand through a suite of cutting edge tools including our industry leading media kit builder.",
  "data/ph-top/2021/8/linker-2.json": "Linker is a lightweight and simple app to help you save, organise, and share your links. We provide a web app, iOS and Android apps and nice browser extension that let you quickly save your links. No more flipping through a bookmarks folder in your browser.",
  "data/ph-top/2021/8/qoa-3.json": "QOA is doing for chocolate, what Oatly did for milk by developing the world's first 100% cocoa-free chocolate. Their chocolate tastes & feels like conventional chocolate but at 10x sustainability. By 2035, QOA will replace chocolate in mass-market products.",
  "data/ph-top/2021/8/candor.json": "Candor helps job seekers make better career decisions by providing authentic takes on leadership, hiring managers, and co-workers at hiring technology companies.",
  "data/ph-top/2021/8/nextretreat.json": "NextRetreat is the world's first all-in-one platform where company retreat & team offsite organisers cut down hundreds of hours typically spent on organising, communicating and synchronising, both internally and externally. 👩‍💻 🌴 ☀️",
  "data/ph-top/2021/8/monoshop.json": "Monoshop helps you to launch a beautiful e-commerce website as fast as possible. You can easily set up it from your mobile phone and be sure that it'll look great on all devices. We keep e-commerce building simple, so you can focus on your content and sales.",
  "data/ph-top/2021/8/command-j-2-0.json": "Command + J is a mentorship platform aimed at bringing newcomers and professionals in the Indian Design Community closer. By doing so, we hope to make knowledge about design in India open and accessible to everyone.",
  "data/ph-top/2021/8/jinx.json": "Find discovering new music hard? Jinx makes it easy It suggests songs based on what you are currently listening to, as well as your existing playlists in Apple Music. It also suggests daily curated playlists and includes a widget for quick access to your music",
  "data/ph-top/2021/8/evidence.json": "Evidence is an open source, code-based business intelligence tool. It enables analysts to build automated reports by writing SQL and markdown, instead of using a drag and drop interface, like you’d find in a traditional BI tool.",
  "data/ph-top/2021/8/the-nifty.json": "I've developed a suite of tools for monitoring the NFT market. This first version is accessible for free and includes a daily digest of market movements, includes my latest podcast episode, and surfaces career opportunities in this space.",
  "data/ph-top/2021/8/bant-io.json": "bant.io is an All-in-one lead generation & sales acceleration service that helps automate the acquisition of B2B customers with cold outreach.",
  "data/ph-top/2021/8/color-trends.json": "We collected the most powerful insights to help photographers and stock photo consumers better understand what colors are the most popular: ⬛️ Top 7 Colors of the Year 🟪 Top Cool and Warm Colors 🟩 Top Colors of 7 Stock Photography Themes",
  "data/ph-top/2021/8/syr.json": "Syr lets users: • Enjoy delicious and authentic food made with love and care • Explore different cultures via food around you • Provide mass economic empowerment to women and other underserved communities.",
  "data/ph-top/2021/8/deskimo.json": "With Deskimo you can access a wide range of professionally managed workspaces on demand, paid by the minute. No memberships, no subscriptions. Right now we are available in Singapore and Hong Kong.",
  "data/ph-top/2021/8/yous.json": "A new communication web app for people who speak different languages allowing them to speak their native language with speakers of other languages and understand each other. ⠀ Just 3 easy steps: register, create a meeting and share the link. ⠀ Try for free!",
  "data/ph-top/2021/8/alicorn-cloud.json": "Alicorn is a cloud-agnostic platform for startups. AWS, GCP or Azure – with Alicorn your stack runs anywhere. Switch cloud providers in one click, escape vendor lock-in and never run out of free credits!",
  "data/ph-top/2021/8/notifyxf.json": "Send notifications to yourself in Telegram. Easiest way to be notified of any events in your server / app / business.",
  "data/ph-top/2021/8/orbitrics.json": "Orbitrics is an experience management platform that simplifies data collection, analysis, and review, to make data-driven decisions. We help you build surveys with ease, customize them, analyze their results and even embed them as bots to your website.",
  "data/ph-top/2021/8/value-added.json": "Collection of most Valuable tweet, twitter thread, blogs, articles and other stuffs. Various topics and creators/communities to discover. Form Psychology to Business, from Life to Writings. Single Tweets or Twitter Threads that worth saving. All in one place.",
  "data/ph-top/2021/8/valisa.json": "Valisa helps travelers with trip planning by suggesting optimal mobility options. Traveling doesn’t have to cost a fortune. Tell us where to start, and we’ll surprise you. Got 10 euro budget? No problem. Check it yourself!",
  "data/ph-top/2021/8/ultimate-podcast-guide-v-1-0.json": "Ultimate Podcast Guide V 1.0 is a podcast dashboard organization system built with Notion, so you will never get overwhelmed with your podcast efforts. ⚡ Helps podcasters repurpose, manage, track their podcast episodes, and content efforts",
  "data/ph-top/2021/8/stream-follows.json": "StreamFollows automatically generates customisable welcome pages for your new followers. Every viewer deserves a warm welcome into your community.",
  "data/ph-top/2021/8/result-tree.json": "I created Resulttree to make online search on multiple websites easier. Write the search term once, and open multiple websites or open all web sties at once. No more copy and paste on each websites.",
  "data/ph-top/2021/8/rarible-protocol.json": "Rarible Protocol is a set of tools to simplify the go-to-market process for NFT projects and ideas. No more building from scratch. Focus on what you’re really good at instead – https://link.medium.com/YpblzPOcFib",
  "data/ph-top/2021/8/growthkit.json": "Find the top 1% of tools and resources that can help you build and grow your startup, small business, or solopreneur career! - Over 200+ listings - 70+ categories to view - Startup deals - No code platforms - VC resources - Places to promote - And more!",
  "data/ph-top/2021/8/strollhunt.json": "Strollhunt is the most fun way to explore cities by turning your casual stroll into an exciting adventure; the city is your playground, go find all the hidden gems! Play now in SF, London, Paris and Barcelona, or create a game in your city for everyone to play",
  "data/ph-top/2021/8/no-paint-2.json": "A free game where you can make a painting by saying No or Paint. You can also enter commands and run macros called Playlists, load other people's paintings by the code in the corner, and use your device's camera!",
  "data/ph-top/2021/8/maridesk.json": "Meet Maridesk, One stop solution for your property & resident management. Maridesk is a cloud based platform to help property owners and managers manage their property & Resident in one ecosystem easily and efficiently. https://maridesk.com/",
  "data/ph-top/2021/8/lightwidget.json": "Responsive widget for Instagram. You can embed our widgets on your website, blog, online store etc. You can generate various types of widgets with multiple options like hover effects, captions...",
  "data/ph-top/2021/8/tempo-playlists-for-spotify-2.json": "Do you ever have an awesome idea for a killer playlist, like you definitely know you want it to start with some indie pop, and finish with some bop electro, and have some slow folk somewhere but can't figure out the rest? - Well, Tempo can!",
  "data/ph-top/2021/8/whyther.json": "Whyther is a simple and accurate weather app. It is available as a website and a PWA ( https://en.wikipedia.org/wiki/Progressive_web_application). Whyther display all your weather needs in one elegant layout. We do not store any of your data.",
  "data/ph-top/2021/8/bettre.json": "The idea behind the App is simple and based on my personal 1-year experiment (you can read it here: https://skob.medium.com/ ) and books like: 📘 The Slight Edge 📗 Atomic Habits 📙 The Power of Habit What do your like/dislike about habit-tracking apps?",
  "data/ph-top/2021/8/easyvoice.json": "Easyvoice is a free, online no-code tool to design, prototype and publish voice app to Amazon Alexa and Google Assistant. Make your ideas come to life with a voice app !",
  "data/ph-top/2021/8/minimalist-3.json": "Designed exclusively for Apple. Sync via iCloud. One-Time Purchase. AutoFill without browser extensions. Generate 2FA codes. Industry standard 256-bit end-to-end encryption. Super fast unlock. Shared family purchase. Made in Canada. Try for FREE, forever!",
  "data/ph-top/2021/8/minymon.json": "Minymons are pets that live on your website and can 💬 answer common questions, 👋 interact with your website visitors, and ✨ build your brand.",
  "data/ph-top/2021/8/anywebp.json": "https://anywebp.comis an all-in-one online tool that allows you to convert WebP images to general JPG/PNG and ICO. Reversely, it also enables you to convert any other image formats back to WebP. Fast, free and you do not need to upload any images to the server.",
  "data/ph-top/2021/8/foaas-v2-3-1.json": "FOAAS (Fuck Off As A Service) provides a modern, RESTful, scalable solution to the common problem of telling people to fuck off.",
  "data/ph-top/2021/8/rocket-beta.json": "💡 A completely new social media solely designed to help you spend more time focused and get in deeper states of focus. ⚡ Get work done faster, make sure your time is well spent, and be more tech aware. 🌱 Offset 1.2kg of CO2 for every hour you focus.",
  "data/ph-top/2021/8/onboardbase.json": "Onboardbase enables teams to collaboratively work, store, manage and share secrets like environment variables, passwords, credit cards across your team effectively and securely.",
  "data/ph-top/2021/8/diary-by.json": "Diary.by is a minimalist, clean, ad and tracking free publishing platform for your blog, journal, articles, code or even recipes.",
  "data/ph-top/2021/8/greeked-and-blurred.json": "1. Hides unnecessary information on the web page 2. Keeps the structure of the page as clear as possible using greeking and adaptive blurring 3. Allows you to select elements to display in its original form 4. Continues to work while adding data to the page",
  "data/ph-top/2021/8/unbugqa.json": "UnbugQA is building an ecosystem for Software Technology companies to find, hire, and work with some of the best Software Testers and Quality Assurance Engineers in the tech world.",
  "data/ph-top/2021/8/makerlead.json": "MakerLead is a ranking of the top 100 open startups with their monthly revenue displayed. It enables makers and aspiring entrepreneurs get a clear view on what's happening in the indie startup scene.",
  "data/ph-top/2021/8/security-3d-icons.json": "Collection of 49 security icons. Great for any project which requires visualisation of security and protection. All layers are connected to Color styles. So it's super easy to change colors.",
  "data/ph-top/2021/8/onin.json": "One place to find time & plan events without leaving the chat. Join our Early Access Program to use Onin first.",
  "data/ph-top/2021/8/anachron-s-bubble-school.json": "Anachron's Bubble School is a free online course for people with no Tech knowledge. The Academy is a collection of publicly available content covering everything you need to get started. We're here to help you learn how to build amazing things !",
  "data/ph-top/2021/8/wildpoint.json": "Introducing Wildpoint, a new web platform that allows hosts to list their land as unique and exclusive camping spots, and guests to find those spots, searching through meaningful filters such as terrain and activities nearby.",
  "data/ph-top/2021/8/carta-launch.json": "Carta Launch is a free platform for founders to get a stronger start. Access real-time fundraising benchmarks, scenario modeling, automated SAFEs, and cap table management, so you can spend more time building your business & less time on administrative tasks.",
  "data/ph-top/2021/8/nsfw-rest.json": "Keep your platform safe of NSFW content, all for free. You can easily detect if an image (videos and other content in the near future) is NSFW (not safe for work) by just uploading it to us. One of the platforms using nsfw.rest is file.coffee!",
  "data/ph-top/2021/8/jawa.json": "Jawa is the first marketplace for gamers to buy and sell parts. Jawa launched a few days ago with verified sellers, protections for everyone, a no scalping policy and an extensive database of parts and is led by Amanda Fried and a strong community of gamers.",
  "data/ph-top/2021/8/purple-photo.json": "Purple photo Purple photo aims to help you create rich & beautiful content for your social media accounts (Twitter, Facebook, Instagram, or Linkedin)",
  "data/ph-top/2021/8/oneclip.json": "Share your clipboard with people nearby. Open Source, No Setup, No Signup.",
  "data/ph-top/2021/8/inetpet.json": "iNetPet: the global hub for pet's care. Free app for Android and iOS. Unique realtime interface between pets' tutors and professionals. All procedures from vets, groomers, trainers, daycare centers. Registered in real-time direct to your phone.",
  "data/ph-top/2021/8/yik-yak-3.json": "Yik Yak is back! A radically private network connecting you with people around you. No strings (or labels) attached.",
  "data/ph-top/2021/8/linkedin-scraper-email-finding.json": "LinkedIn scrapers today are difficult to use, and provide terrible email finding. We have solved this by connecting directly to Clearbit and Hunter.io for email finding - now you can scrape Sales Nav + find quality emails in a single click!",
  "data/ph-top/2021/8/dall-e-mini.json": "DALL·E mini can generate new images from any text prompt. Check out different examples above or try it now. It's free",
  "data/ph-top/2021/8/tara-ai-2-0-1.json": "Define, plan & track mission-critical product updates with Tara AI. Get instant insights into code progress. Tara AI is lightning-fast project management that helps teams ship product, with tasks, sprints & docs tied to code. Now with built-in automation.",
  "data/ph-top/2021/8/kona-2-0-2.json": "Teams love talking about their day with Kona for Slack. Kona 2.0 introduces our new web dashboard, helping managers visualize team health like never before.",
  "data/ph-top/2021/8/infinity-maps.json": "The earth isn’t flat. Why are your tools? Dive deep into arbitrarily large amounts of information with infinitely zoomable knowledge maps. Visually represent & spatially organize your projects to - let ideas grow - unfold complexity - keep an overview",
  "data/ph-top/2021/8/lemon-4.json": "AWS is powerful, but the UI is confusing. Lemon is an alternative UI that is as intuitive as Vercel or Heroku It comes with DevOps best practices out of the box, and it's free!",
  "data/ph-top/2021/8/rainforest-qa-2.json": "Rainforest QA is a no-code test automation platform that makes it easy for everyone on the product team to contribute to quality. Run up to five hours of automated tests for free, every month.",
  "data/ph-top/2021/8/pickleball-stencil-by-boundaryally.json": "Pickleball is the fastest growing sport in the US and there aren’t enough courts to go around! BoundaryAlly allows you to set up a court & start playing anywhere in a matter of minutes.",
  "data/ph-top/2021/8/storymaze-2.json": "StoryMaze is a new, interactive app with immersive steamy audio stories. Each story is read by a voice artist. At the end of an episode, you help the protagonist choose what to do next, influencing how the story flows. The choice is in your hands.",
  "data/ph-top/2021/8/blossom-9.json": "Blossom makes coaching more accessible than ever before. Find the perfect coach based on your profile & goals, and track your progress along the way with our science-backed app. Start your growth journey with confidence and Blossom into your best self today!",
  "data/ph-top/2021/8/heycopy.json": "HeyCopy helps copywriters, product builders, indie hackers, hustlers, designers, and others become better writers with a copy buddy. A copy buddy is your accountability partners that HeyCopy vets and matches based on interests and skill levels.",
  "data/ph-top/2021/8/postdrips-by-contentdrips.json": "It's a simple one page LinkedIn drafting & scheduling tool built for personal brands. Use it make your LinkedIn text bold & italic & get an actual preview of your post to see how they will appear on LinkedIn. It's a simple tool that does its job.",
  "data/ph-top/2021/8/how-to-get-started-with-cro-workbook.json": "Are you a CRO expert? If not, this workbook is perfect for your needs! It's full of 60 pages of templates that boost your skills in this area and ensure that you are as professional as you come. Download it now to get on the right foot with CRO!",
  "data/ph-top/2021/8/studystream.json": "StudyStream is a video platform & online community that allows students & young professionals to work with others from around the world 24/7 and in real time. It brings accountability & motivation to users from over 180 countries who work with us daily.",
  "data/ph-top/2021/8/elpha-talent-pool.json": "Connect with companies that are a culture fit for you. Create a profile with your skills & cultural qualities you care about, and get intros to companies that are uniquely suited for you. The Talent Pool is part of Elpha – where 50K+ women build our careers.",
  "data/ph-top/2021/8/billfixers-2-0.json": "Dealing with your bills sucks. We negotiate on your behalf to save you money, time, and stress. Then, we automatically track price increases, discount expirations, and limited-time promotions to keep you at the lowest rate—always.",
  "data/ph-top/2021/8/zoom-slack-sync-by-reclaim-ai.json": "Automatically update your Slack status to \"in a meeting\" and/or Do Not Disturb when you enter or leave a Zoom call — even if it's not on your calendar, or it ends early. Keep your meetings distraction-free when you connect Zoom + Slack + Google Calendar.",
  "data/ph-top/2021/8/grub-2.json": "Grub is an open-source & 100% free UberEats UI clone in Java/Kotlin for Android, iOS, Desktop & Web. It helps to build an elaborate cross-platform food delivery app such as UberEats, Foodpanda, GrubHub etc using a single codebase. ⠀ ⭐ ⠀Star us on https://github.com/sergeyCodenameOne/UberEatsClone",
  "data/ph-top/2021/8/clearpitch42.json": "The ultimate elevator pitch template. 42-seconds of all the listener (investor) needs, to understand; you, your startup, it’s stage, and your ask. Guarantee that next meeting after using the ClearPitch42 format on-stage or at the networking event.",
  "data/ph-top/2021/8/mockup-clips.json": "Showcase your app or website in a real-life scenario by using our web-based video tool. Just drop in your media, preview instantly, and export your new realistic video mockup in 4K or HD.",
  "data/ph-top/2021/8/appx.json": "AppX lets creators 🧑‍🎨🧑‍🍳🧑‍🎤🧑‍💻🧑‍🔬 launch their online academy app📱 and sell courses online.",
  "data/ph-top/2021/8/sigmaos.json": "SigmaOS is the first browser made for work, designed to make YOU faster and better. 🗂️ Workspaces to organize your pages and web-apps 💤 Snooze pages to keep your mind clear ✂️ Split screen to multitask like a pro Give it a try now: https://sigmaos.com",
  "data/ph-top/2021/8/jemi-2-0.json": "Jemi is a website builder for creators and entrepreneurs. Build a website in minutes with the ease of Linktree and customizability of Squarespace. Build your dream website with our hand-crafted templates, or start from scratch!",
  "data/ph-top/2021/8/million-dollar-email-templates-2-0.json": "We're opening the email vault from our $100+ million company. Get 40+ word-for-word email templates we've used at AppSumo to negotiate deals, sell products, generate backlinks, secure influencers, get replies from busy people... and so much more. 🎉",
  "data/ph-top/2021/8/canvas-for-zoho-crm.json": "Canvas is a no-code, drag-and-drop design studio built into Zoho CRM where you can create contextual, immersive, and tailor-fit experiences for all your teams. You can create new designs from scratch, or pick one of our templates and dive right in.",
  "data/ph-top/2021/8/tidycal-2-0.json": "Instead of sending emails back-and-forth, just share a TidyCal link & let the other person choose a time that works for them. Create multiple booking types, connect up to 10 calendars, & integrate with Zoom, Google Meet, Zapier, Google Calendar & Office 365.",
  "data/ph-top/2021/8/visionrare-beta.json": "Fantasy football meets startup investing. ⠀ Collect & trade NFT-backed limited-edition fantasy equity of the startups you believe in, compete in tournaments and get real returns on your investments. 🚀",
  "data/ph-top/2021/8/intersect-2-0.json": "Intersect is the easiest way to build and ship data apps. With simple building blocks you can: Connect any data source Build data workflows for yourself or your team Share and publish interactive dashboards/reports Automate repetitive processing",
  "data/ph-top/2021/8/accord-2.json": "Accord is a customer collaboration platform for companies who need to build a repeatable sales & onboarding process to hit growth targets. Collaborative, Transparent, and Engaging – What customers love.",
  "data/ph-top/2021/8/photo-toon.json": "Photo Toon is a photo to cartoon app that lets you turn your picture into cartoon style drawing in just one tap. Then you can edit the result using the in-app image editor before share it or save on your device.",
  "data/ph-top/2021/8/phishdeck.json": "PhishDeck makes it easy to simulate advanced realtime phishing attacks to improve and measure your security awareness program. It features ready-to-use phishing simulation templates, reports and actionable insights all with simple, transparent pricing.",
  "data/ph-top/2021/8/kinopio-2-0.json": "Get your thoughts out and visually connect them together. Kinopio works the way your mind works. No sign up required.",
  "data/ph-top/2021/8/product-design-assignments.json": "Remember that all-nighter you pulled to complete that design assignment in 48 hours and got rejected ? We're trying to make upcoming designers' life easy by giving them a set of problem statements that they can practice before appearing for an interview.",
  "data/ph-top/2021/8/antistalker-by-malloc.json": "Antistalker notifies you when apps use the camera or microphone of your device. It goes beyond the privacy dots! It tells you for how long are used and how much data your apps send to the internet.",
  "data/ph-top/2021/8/huemint.json": "Huemint generates colors palettes using machine learning. Instantly visualize your color scheme in a logo mockup, website or illustration.",
  "data/ph-top/2021/8/scribd-downloader.json": "This extension for chrome is for downloading scribd documents",
  "data/ph-top/2021/8/truepush-for-shopify.json": "Truepush is one of the fastest growing push notifications tool in the market and on a mission to help as many businesses to give high ROI by giving great quality product at low cost. We are doing 18bn push notifications/month currently. Now on Shopify.",
  "data/ph-top/2021/8/carsifi-wireless-android-auto-adapter.json": "Our adapter helps drivers to avoid using cords, instead connecting to Android Auto wirelessly, even if car doesn't have built-in WiFi. 100%+ funded with Kickstarter in first day🚀",
  "data/ph-top/2021/8/panda-pixel-website-design.json": "Panda Pixel creates beautiful high converting web experiences for small businesses at a low monthly fee. Completely done for you and with unlimited support for site updates.",
  "data/ph-top/2021/8/loginradius-cli.json": "Are you looking for a command-line interface (CLI) to configure and manage authentication and single sign-on for your web and mobile apps? We’re now introducing LoginRadius CLI. Put your hoodies on like a hacker!",
  "data/ph-top/2021/8/statsig.json": "Statsig is a modern feature-management and product experimentation platform that helps you to ship faster by providing meaningful data insights, actionable causal analysis and automatically running 10x more experiments than any other service.",
  "data/ph-top/2021/8/bucket-5.json": "Bucket is a social media platform for finding things to do and people to do them with.",
  "data/ph-top/2021/8/battery-thing.json": "Show/hide your Mac's battery icon when you want. With just one click, it shows the battery's health and the statuses of your Bluetooth  products.",
  "data/ph-top/2021/8/opensales.json": "OpenSales is a completely free peer-to-peer network that allows for people across the world to prospect through the power of community. Simply download the Chrome extension and find work emails for your LinkedIn prospects.",
  "data/ph-top/2021/8/creativeeditor-sdk.json": "CE.SDK is a fully customizable design editor, empowering template-based workflows and automation with just a few lines of code. The editor combines the best of layout, photo editing, and typography and can easily be adapted to any use case.",
  "data/ph-top/2021/8/canonic-2.json": "Canonic is a low-code intuitive platform to build scalable backend and craft APIs for your web and mobile apps. It enables developers to ship production-ready backend instantly. All without writing a single line of code!",
  "data/ph-top/2021/8/gitnft.json": "GitNFT lets developers mint NFTs of their GitHub commits and seamlessly list them in the OpenSea marketplace! Minting costs are on the house 🍺",
  "data/ph-top/2021/8/riverside-fm-2-0.json": "Creators this is for you! ~ Today we launch Riverside 2.0🚀🚀🚀 ~ Make STUNNING podcasts & videos within seconds ~ Say hello to: ~ 🔤Automatic transcriptions 🎬AI Speaker View 🪄Magic Editor 📱iPhone app 💻Full HD screen-share recordings",
  "data/ph-top/2021/8/launch-wiki-by-launch-kitty.json": "Launch Wiki includes several statistics about various metrics to get better at the product launches on Product Hunt! Statistics have been shown up with detailed graphics, tables, and custom metrics for ease of understanding.",
  "data/ph-top/2021/8/elementsready.json": "Elements Ready – Elementor Addons comes up with ultimate Elementor blocks and widgets. Template Library, Ready section and flexible option makes it more efficient for the users. This will save your time and effort for sure.",
  "data/ph-top/2021/8/standuply-for-ms-teams.json": "A well-known and one of the most popular Slack apps, Standuply, is now available for MS Teams with all the same features. Spice up your MS Teams communication.",
  "data/ph-top/2021/8/pioneer-codex.json": "Pioneer Codex is a collection of the best writings & videos on taking a project from Idea to Seed. Codex directly answers 100 of the most common questions we've heard across thousands of conversations with early founders.",
  "data/ph-top/2021/8/wonderly.json": "Wonderly is an AI-powered browser extension that makes finding information online faster and more convenient while surfing the web for work, study, or leisure. Get a short AI-curated answer to a question with one click instead of a list of search results.",
  "data/ph-top/2021/8/dashly-chatbot.json": "Dashly Chatbot is a no-code solution to build bots and engage your website visitors. It collects, qualifies, and hands your leads to the right team. So that they know who they are talking to and create personalized communications that convert into sales.",
  "data/ph-top/2021/8/ai-video-generator.json": "This is a hosted version of a VQGAN+CLIP art generation algorithm. Anyone can now try to make art with artificial intelligence by just typing a query! Just enter whatever text you'd like, and this tool will generate a completely unique video.",
  "data/ph-top/2021/8/slapdash-command-bar.json": "The Command Bar is a Spotlight-like tool that makes modern computer work less tedious and more fun. It's a keyboard-centric interface designed to help you move fast.",
  "data/ph-top/2021/8/vint-2.json": "Vint is making the wine & spirits market investable with a transparent, SEC-qualified trading platform. We curate world-class thematic collections of wine & whisky, allowing you to efficiently invest starting at $10 a share.",
  "data/ph-top/2021/8/creative-habit-generator.json": "Want to be a creator of some sort? Use this simple generator to discover habits you can build in order to get there.",
  "data/ph-top/2021/8/serverful.json": "Serverful brings serverless experience to containers. Hosted or in your AWS account Just connect your Github repository and deploy!",
  "data/ph-top/2021/8/taskbar.json": "To become the first fully autonomous, self-sovereign gig-economy platform that is gamified to cater to the needs of all users. The goal is to support mass financial inclusion through a borderless marketplace of tasks for users via a trustless web3.0 ecosystem.",
  "data/ph-top/2021/8/crumbs-privacy-from-the-makers-of-abp.json": "Crumbs is the best free privacy tool, by eyeo, the makers of Adblock Plus. 😎 An unbelievable collection of privacy-protection tools 🥸 Hide your email with email aliases 🍪 Block cookie pop-ups 💪 Visualize & control your data whilst supporting a fair web",
  "data/ph-top/2021/8/lead-forms-by-gosquared.json": "Lead Capture Forms that trigger targeted onboarding journeys built from genuine user behaviour.",
  "data/ph-top/2021/8/bubble-video-commenting.json": "Bubble is a social video platform that allows users to create, share and react to video comments on top of any content. You can use Bubble to comment on a photo, a screenshot or a video and request video comments from others. Give it a try at getbubble.app!",
  "data/ph-top/2021/8/dewwy.json": "Love continuous learning and personal growth? Dewwy texts you 3x a week with the best productivity/personal growth/continuous learning content. ⠀ Learn with us today! https://my.community.com/dewwy.",
  "data/ph-top/2021/8/the-breakaway.json": "The Breakaway is a motivational coaching platform for fitness enthusiasts, starting with cyclists. Our app uses data from existing platforms like Peloton or Garmin to connect cyclists with coaches and friends who help them improve with personalized challenges.",
  "data/ph-top/2021/8/ai-image-upscaler.json": "Get a sharper and bigger photo with the AI Image Upscaler! 🔍 Make your photos automatically Bigger by 2x, 4x, or 8x. ✨ No pixelation or blurry details. 🔥 Bonus: Get 10 free upscales via the GET IT link.",
  "data/ph-top/2021/8/lexicon-2.json": "Lexicon is a customizable, open-source mobile app that provides an elegant mobile discussions experience. Built on Discourse, an open-source platform for communities. Fork Lexicon, connect it to your existing Discorse instance, and ship it to the App store!",
  "data/ph-top/2021/8/poppins.json": "Poppins makes your Slack actionable by capturing messages as action items and discussion topics right inside Slack without switching context, saving ~an hour! 🌍 100's of teams trust Poppins globally 🏅 #1 Brilliant Bot on Slack Apps 🏆 #1 New & Noteworthy App",
  "data/ph-top/2021/8/lassie-smoke.json": "Lassie Smoke is a bot for Facebook Messenger. It aids in controlling the amount of time between cigarettes and increasing the intervals between them. 🚬 ⠀ Smoking cessation is possible without the use of any additional software! 😈",
  "data/ph-top/2021/8/synth-4.json": "Be on top of the knowledge you consume in audio through AI-summary & capturing information in 1-click from real-time transcript. Synth helps you capture, summarize & retrieve this knowledge from any platform.",
  "data/ph-top/2021/8/instad-io.json": "A revolutionary web-based image restyler that allows you to automatically convert any visuals such as charts, maps, icons, diagrams or illustrations into a sketchy / hand-drawn look in a couple of mouse clicks.",
  "data/ph-top/2021/8/cred-mint.json": "CRED's first community product built on trust. You can now earn up-to 9% interest, while investing in other trustworthy CRED members. Visit https://cred.club/mint for early access!",
  "data/ph-top/2021/8/jumpskip-for-netflix.json": "Jumpskip is a Chrome Extension for Netflix that helps you watch movies without being scared by jumpscares. Skip, mute, get a warning when jumpscares are about to happen, view all the jumpscare timestamps, and much more.",
  "data/ph-top/2021/8/scrollingmockup-io-2.json": "Web design is a blast. Creating mockups for marketing? Not so much. ScrollingMockup.io generates HD, animated scrolling mockups in minutes. Simply paste your website's URL, select from our ever-growing template gallery, add some music, and post!",
  "data/ph-top/2021/8/deploy-empathy.json": "Deploy Empathy will help you learn the skill of talking to your customers so that you can pull out their hidden needs, desires, and processes. By the end of this book, you’ll be able to interview customers and potential customers with confidence.",
  "data/ph-top/2021/8/content-partner-by-justreachout.json": "JustReachOut Content Partner makes it crazy easy to find content marketers or SEOs at any company or blog to start a content collaboration or partnership. Enter a URL and our tool gives you a quick list of people you need to hit up to start a content collab.",
  "data/ph-top/2021/8/wyshbox.json": "Say hello to Wyshbox. We are: Easy, Affordable, 100% online, Completely Customizable, Free from Medical Exams. Want to send your kids to college? Cool. Want your ashes in space? Let's do it. Start building your Wyshes for free on iOS or web.",
  "data/ph-top/2021/8/unmute-2.json": "Unmute uses Text-To-Speech to let your iPhone speak for you during phone calls. You can pre-program sentences, or type what you want your phone to say during a call. This helps people who are mute (can’t / don’t talk) or if you have other speech impediments.",
  "data/ph-top/2021/8/docvita.json": "DocVita is a telehealth provider for India. We provide speciality care on Zoom, Meet, WhatsApp in 11 languages.",
  "data/ph-top/2021/8/sharedinbox.json": "Shared Inbox for your Teams within Slack - Connect your existing team email (like help@, info@, sales@) to Slack, collaborate over external emails effortlessly!",
  "data/ph-top/2021/8/gallery-68556bee-1ea7-41e0-957c-2314270524e4.json": "Replicate your production environment in one click, trigger builds on pull requests by connecting to Github/Gitlab, and share environment previews with QA through Slack/Jira - all with any cloud provider & any environment architecture.",
  "data/ph-top/2021/8/youtube-video-downloader-2.json": "A simple in one youtube video downloader for youtube. Nothing new for the product hunt community but wanted to share my tool with everyone if they want to use it. Install the PWA( Progressive Web App) to make it work even faster. It has ads just so you don't say i didn't told you before.",
  "data/ph-top/2021/8/valkyrie.json": "Valkyrie no-code creative platform for 3D/AR modelers and designers is as powerful as Unity and as easy to use as Photoshop. It's built for non-programmers which makes it easy to learn, easy to use and the fastest way to bring creative projects to life.",
  "data/ph-top/2021/8/live-chat-by-wotnot.json": "We are super excited to showcase our completely revamped Live Chat interface that can make Customer Support 🙂 Easier! 🚀 Faster! 😎 Highly Efficient! So how about easing off the pressure on the support team and providing the ultimate chat experience?! 🤓",
  "data/ph-top/2021/8/questionwave.json": "👋 We built Questionwave to make the Q&A sessions at events faster and more organized. Questionwave helps event hosts to collect questions ahead, or during an event. 100% free, super-fast, and no registration required. Let me know what you think!",
  "data/ph-top/2021/8/poet-so.json": "Capture and share Twitter posts as beautiful images. Poet.so makes sharing Twitter posts on other platforms more visual and attention-grabbing.",
  "data/ph-top/2021/8/neodocs-wellness-card.json": "Neodocs lets you order instant lab tests from your smartphone. Our users are health optimizers who want to track and improve key nutritional markers.",
  "data/ph-top/2021/8/mooze.json": "Mooze allows you to personalize your video calls with custom overlays, immersive presentations, PiP screen-sharing & reactions. Create an impression that people remember. ⚡️",
  "data/ph-top/2021/8/framestack.json": "Framestack is a collection of tools/libraries/frameworks you'll probably need to start building your next idea and turn it to a reality, it is open source and anyone can contribute by adding new features or by simply adding their favorite tools 🛠",
  "data/ph-top/2021/8/candlewaster.json": "Candlewaster is an application that helps you gain the habit of reading books, you can track reading data and display this data with statistically interactive graphics.",
  "data/ph-top/2021/8/tempus-3.json": "Manage and view YouTube comments with timestamps efficiently.",
  "data/ph-top/2021/8/clip-it.json": "Clipping used to be as easy as pressing a button. Now it's even easier.",
  "data/ph-top/2021/8/serp-preview-tool.json": "Visualise how your website will appear in the search results",
  "data/ph-top/2021/8/listlist.json": "ListList enables users to explore, share & collaborate on different types of information organized through Lists. ListList is a social media app that uses the power of lists & collaboration to efficiently share ideas among friends & community.",
  "data/ph-top/2021/8/bloop-3.json": "bloop is an in-IDE code search engine that retrieves relevant JS and TypeScript code examples from library documentation and open-source repos. ⠀ See library function parameters, output, and error-handling - without going to Google.",
  "data/ph-top/2021/8/worthy-domains.json": "Rethink how your domain research works: first, decide on the domains you find worthy, then check their availability. Not the other way round... No more lengthy research on outdated registrars and 100s of shitty results. Supercharge your domain decisions today!",
  "data/ph-top/2021/8/save-chrome-tabs-for-later-2.json": "Lets you easily save your currently open tabs to quickly restore them later. No more reading through your browsing history to figure out what stuff was left to go through. You won't miss any important info you clicked on but could not get to.",
  "data/ph-top/2021/8/fsnotes-5.json": "Hi guys, FSNotes 5 finally released! Here most advanced notes manager for macOS fully rewitten and powered by electron... Joke :D Of course Swift like early, but with tons of improvements. Advanced tags management, folders tree, polished UI/UX and more!",
  "data/ph-top/2021/8/good-launcher.json": "A unique approach to create minimal yet powerful launcher to increase focus, productivity and to reduce distractions Free Supports themes Motivation content, facts and life-hacks Shows Phone usage Gesture support",
  "data/ph-top/2021/8/informant.json": "I was tired of pressing ⌘ + i all the time so I built this! It monitors clicks, and arrow key presses to keep track of the currently selected file. It displays all the metadata found in the menu bar or in the panel inspector.",
  "data/ph-top/2021/8/mynfteam.json": "mynfteam aims to, regardless of your experience, provide a platform that allows you to find, join or gather a unique, non-fungible team of people who are passionate about the space and together, WAGMI!",
  "data/ph-top/2021/8/netumo.json": "Netumo is an uptime monitoring service that performs synthetic monitoring of web hosts and RESTful APIs. When Netumo detects an issues it notifies the end user using SMS, Twitter, Email, Telegram, MS Teams and/or Slack.",
  "data/ph-top/2021/8/genomelink-2-0.json": "If you got DNA tested from companies like 23andMe/AncestryDNA, you can transfer your DNA data to Genomelink and unlock hundreds of apps like: 🧬 Ancestry report that goes deeper than 23andMe 🧬 200+ more body and mind traits than are available on AncestryDNA.",
  "data/ph-top/2021/8/figstack.json": "Reading and writing code is hard! Figstack helps you understand code in any language, translate between languages, and automate documentation so you can focus on building what matters.",
  "data/ph-top/2021/8/wicked-popups.json": "Tailwind CSS Pop-Ups/modals for your Tailwind CSS websites. 18 Coded Tailwind CSS Dialogs, Signups and Social popups available with HTML and Talwind CSS",
  "data/ph-top/2021/8/spatium.json": "Beautiful space images and information of your current sky map location on every new tab.",
  "data/ph-top/2021/8/loona.json": "loóna is the first app that lets you quickly disconnect from a long stressful day and get in the right mood for sleep. From the team behind https://www.producthunt.com/posts/msqrd.",
  "data/ph-top/2021/8/booby-track-for-ios.json": "Now available on iOS — with iCloud Sync and Backup, Widgets, and updated visuals. Booby Track is a convenient and fun way to keep track of your breastfeeds, on your iPhone and watch",
  "data/ph-top/2021/8/hourglass-5.json": "Hourglass reinvents your desktop experience with beautiful rotating conical gradients that moves like a clock and optional texts that provides additional info, including current time, next calendar event, weather forecast, and now playing.",
  "data/ph-top/2021/8/pathica.json": "Pathica is based on the theory of \"Six Degrees Of Separation\", which is the idea that any two people on the planet can be connected through five or fewer individuals. As a result, a chain of \"friend of a friend\" statements can be made to connect any two people in a maximum of six steps.",
  "data/ph-top/2021/8/time-to-estimate.json": "You might have been in video calls where hands are cut off or there's horrible lag. You’re moving your fists, rock-paper-scissors style, to your scrum lead's countdown only for everyone to estimate at the wrong time. TTE is the solution! Simple and fun.",
  "data/ph-top/2021/8/how-i-experience-web-today.json": "We certainly don't like this web experience. How did we end up here?",
  "data/ph-top/2021/8/usersplit.json": "Trace the flow, conversation metrics and important events throughout the user journey in your web app through the funnels and notify yourself at important events in your app.",
  "data/ph-top/2021/8/between.json": "Between uses laptops & phones to map out physical conversations onto a virtual space so remote aren't left unheard on the TV. Remote staff can speak using the devices around the physical room, directing their voice based on where they are in the virtual call.",
  "data/ph-top/2021/8/reportedly-2.json": "Reportedly.co is a platform for sharing updates across your investors, advisors, and team. Reportedly is completely free (and we'll always offer a free plan).",
  "data/ph-top/2021/8/moralis.json": "🏆 Try our managed nodes (155M free req/month) ⭐️ Scalable, fast and robust web3 infrastructure 🤯 Everything you need to build, host, and scale killer dApps 🥂 Go to market in days not months",
  "data/ph-top/2021/8/lumify-care.json": "Lumify Care helps nurses find, share, and buy the gear they need to excel. We do this through Lumify’s line of products and Lumify Hub, a marketplace that features the brands, organizations, and resources that nurses love. The Lumify Hub launches today!",
  "data/ph-top/2021/8/60-leaders-on-innovation.json": "We asked some of the best across the globe - CxOs, academics, technologists, innovation leaders, entrepreneurs, and start-up founders - to answer a fixed set of challenging questions on innovation. ‘60 LEADERS ON INNOVATION’ presents their unique perspectives.",
  "data/ph-top/2021/8/responsivize.json": "Responsivize is an open-source desktop app that you can use to develop responsive websites! In the app, you can test your web apps on popular iPhones, Android phones, iPads, MacBooks, and you can even set custom dimension devices!",
  "data/ph-top/2021/8/commery.json": "Commery makes it easy for commercial tenants to find their perfect space. Tenants can publicly and anonymously list their commercial space requirements and receive inbound from brokers and landlords who have spaces that are good matches.",
  "data/ph-top/2021/8/trends-vc-2-0.json": "Trends.vc is a community and newsletter for 40,000+ curious entrepreneurs. We cover topics such as No-Code, Micro Private Equity, Micro-SaaS and more...",
  "data/ph-top/2021/8/airschool.json": "https://airschool.com makes it easy for experts to launch their cohort-based or async courses from one place. 🚀 😻 Grab your subdomain & create your digital cours https://airschool.come. 💰 Accept payments via Stripe, PayPal, GooglePay & more. ️❤️ Monetize your knowledge.",
  "data/ph-top/2021/8/podopolo.json": "Podopolo makes podcast listening social + podcasting profitable for creators. Imagine your own personalized library of 4 million podcasts, meaningful conversation with hosts + friends – all while reaping rewards + making a social impact as you listen + engage!",
  "data/ph-top/2021/8/lazy-load.json": "Lazy load lets you generate skeleton loading screens in one click. Now you can save enough time while designing loading screens for developer handoff in Figma.",
  "data/ph-top/2021/8/the-gist-2.json": "Build simpler & more elegant automations; less steps & complexity than with other automation tools.",
  "data/ph-top/2021/8/founder-s-handshake-prenup.json": "The Founder's Handshake and Prenup formalize the work relationship between two (potential) Co-Founders. Remove all legal uncertainty when testing it if you vibe together while building a company.",
  "data/ph-top/2021/8/focusli-2-0.json": "Today I launch Focusli 2.0 🚀 ------ Find the best music stream to study/relax ------ Choose from 30 stations ------ 5 Genres LOFI 🎵 Classic 🎹 Jazz 🎷 Techno 🎛️ Meditation 🧘 ------ I would appreciate your feedback 🙏",
  "data/ph-top/2021/8/ratebunni.json": "💯 It’s Complete: Over 500 lenders and growing ☯️ It's unbiased: Revenue does not influence what you see 📊 More than just interest rates. See digital features, customer ratings, community involvement, speed of application, employee diversity and more.",
  "data/ph-top/2021/8/stox-4.json": "Track your stock, ETF and crypto asset portfolios, see detailed metrics, stats, news and more! Set price alerts, build your watchlists, gain actionable insights about your investments and become the better trader!",
  "data/ph-top/2021/8/vite-2.json": "Vite is designed for today’s global workforce. - Employee https://www.vite.biz/en/learning-development - Improve https://www.vite.biz/en/engagement - Help in Retention & Happy Work Culture - Create Productive Environment - Help to Achieve Company Goals Get 6 Months Free Access: https://www.vite.biz/app/requestdemo/requestdemo.aspx",
  "data/ph-top/2021/8/vomit-space.json": "Your space to vomit instant/untold emotions. Not by gender, not by display picture connect with people through their emotions. Together celebrate happiness, show support, share opinions, & much more, all by being anonymous.",
  "data/ph-top/2021/8/smartaddress-io.json": "https://smartaddress.ioSmartAddress.IO is introducing all-new addresses to the world. Built for the 21st century. No more bad addresses. No more unaddressed people. No more getting lost meeting others or finding customers.",
  "data/ph-top/2021/8/airbooks.json": "Airbooks is an easy-to-use global Accounting and Inventory mobile app tailored for Small businesses & freelancers.Send Unlimited Invoices, Estimates etc through Whatsapp/Email. All you need is just a smartphone to manage your business anywhere!",
  "data/ph-top/2021/8/certificationpoint.json": "Our Career Gateway Preparatory Program, a project-based learning freelance interactive experience building course, serves as a way of connecting college students with local, national and global businesses and service buyers as a way for students to gain",
  "data/ph-top/2021/8/no-code-board.json": "Generate beautiful dashboards in less than 60 seconds for Google Analytics, Google Search Console & Google AdWords.",
  "data/ph-top/2021/8/overbrowsered.json": "This app will make your macOS open links in the most recently used web browser, instead of a single \"default\" one. It is useful if you switch between multiple browsers from time to time, especially as a web developer.",
  "data/ph-top/2021/8/article-editor.json": "Article Editor made for complex rich content, which should look the same as on the site page or in the application. It works on iframe, so you can connect any frontend framework to it to display styles, for example, Bootstrap, Bulma, etc.",
  "data/ph-top/2021/8/busta.json": "BUSTA is an enormous and ambitious ecosystem which will soon be populated by multiple games and tokens. Accompanied by it's own DEX, Staking pools, Affiliate and Partner programs, and DAO, it is truly unique in it's intricately weaved architecture.",
  "data/ph-top/2021/8/energyhawk.json": "EnergyHawk uses satellite imagery and predictive AI to estimate the energy profiles of commercial & industrial facilities. Currently covering over 200,000 facilities globally, EnergyHawk enables clean-tech sales team to prospect and qualify deals faster.",
  "data/ph-top/2021/8/supershots.json": "Turn your screenshots into supershots with beautiful gradient backgrounds in a few seconds. Share attractive supershots on your social media!",
  "data/ph-top/2021/8/eddy-travels-ai-assistant.json": "✈️ Install the free AI travel assistant on your website and start earning commissions from sales! https://partner.eddytravels.com/",
  "data/ph-top/2021/8/slingshow.json": "Slingshow allows anyone to create a variety of interactive & engaging events in minutes. You can: 💰 Drive sales with in-event calls to action 💬 Build community with conversations and ice breakers 🤝 Allow attendees to meet panelists 🍱 & much more",
  "data/ph-top/2021/8/pixlr-143bc6c0-e2e2-47fa-b23b-3ab77095cc6a.json": "✨ All-in-one photo editing & graphic design platform ✨ No installation required & FREE to use ✨ Smart AI tools & cool effects ✨ Stunning social media templates & many more ✨ Huge creative library with millions of assets",
  "data/ph-top/2021/8/spirokit.json": "SpiroKit is a design system for mobile applications. It includes a collection of carefully crafted components and design principles to quickly transform an idea into a product. It’s easy to customize, and with a strong focus on development experience.",
  "data/ph-top/2021/8/direcon-for-twitter-spaces.json": "Direcon was the first-ever analytics platform for Clubhouse & Spotify Greenroom. We're proud to announce that Direcon now supports Twitter Spaces as well.",
  "data/ph-top/2021/8/macro-0bcf56a5-02c4-4a1c-9785-d670b5bdcc3e.json": "Join any Zoom meeting with Macro even if everyone else is on Zoom. Meeting software is now a personal choice. Macro customizes the meeting interface to give you a whole new way to express yourself and feel included on calls.",
  "data/ph-top/2021/8/onebot-2.json": "Here's OneBot, an AI chatbot tool based on assumptions of conversational commerce that simplifies the B2B buyer journey. It allows users to interact in various places on the website, not only in a chat window -as well as on search, category pages, or checkout.",
  "data/ph-top/2021/8/onboarding-checklist-by-usetiful.json": "User Onboarding Checklists improve user onboarding and the rate of product adoption. Checklists are a scientifically proven way to have more users adopt your product successfully.   Users can explore at their own pace & style while having next actions clear.",
  "data/ph-top/2021/8/sprig-5.json": "Sprig (formerly UserLeap) is an all-in-one product research platform that lets you ask bite-sized questions within your product or user journeys. Easily conduct video interviews, test design concepts, and run microsurveys with your actual users in minutes.",
  "data/ph-top/2021/8/startup-fundraising-playbook.json": "The Startup Fundraising Playbook bundles fundraising trends, bias, and do’s and don’ts in early-stage fundraising into a guide for founders raising capital from Pre-Seed to Series A. Dig into these insights and research to optimize your process & VC outreach.",
  "data/ph-top/2021/8/webcrate-2.json": "WebCrate helps you organize and share links, articles and more from around the web in a central place. It's open source & can be easily self-hosted thanks to your own personal cloud in Deta Space. It's more than just a bookmarking tool.",
  "data/ph-top/2021/8/orderli.json": "Orderli makes ordering easy and fun. Simply scan the QR-code on your table, tap what you want to order, and send your order straight to the bar or kitchen.",
  "data/ph-top/2021/8/knowledgeos-beta.json": "KnowledgeOS is Marie Kondo for your favorite browser. Supercharge your browser with powerful organization and interaction. Work faster, work smarter. Easily manage all your work and tabs contextually. USE FOR FREE and STORE YOUR DATA ON YOUR DEVICE.",
  "data/ph-top/2021/8/medis-2.json": "After Medis 1 has been around for 5 years, here comes Medis 2! Medis is a beautiful, easy-to-use Redis GUI management application for Redis. It's designed and developed by Redis experts, making it trustworthy even in critical situations.",
  "data/ph-top/2021/8/cabana-5-design-system-for-figma.json": "Cabana is a Design System for Figma that enables you to create UIs quicker, allowing you to present your design ideas much faster.",
  "data/ph-top/2021/8/rally-859e8582-bf5a-469c-8dbd-15d1fdbd319f.json": "Rally is an open network that enables creators to launch vibrant and independent economies with their communities powered by the ethereum blockchain.",
  "data/ph-top/2021/8/kickass-leads.json": "Get a monthly list of 1000 companies that just raised millions in venture capital, with contact details of multiple decision makers. Export the CSV, find your dream customers, reach out, and close 6-figure deals. Price is discounted by 50% until September 5th",
  "data/ph-top/2021/8/ultimate-email-guide-for-indie-creators.json": "The strategies in the guide have been used to sell more than $2 million of products over the past decade. This guide is the compilation of what I've learned about email marketing, as a creator. For indie/content creators only. Not for e-commerce brands.",
  "data/ph-top/2021/8/scrapex-beta.json": "Let Scrapex.ai automate scraping and handle data extraction problems at scale. While you sit back and relax, we’ll get the data you want, the way you want it.",
  "data/ph-top/2021/8/menu-cards.json": "The easiest, safest and most practical way of managing your online QR menus dynamically. Clean, easy and fast for your customers. 🦠",
  "data/ph-top/2021/8/research-ai.json": "Research AI is a private research assistant that helps students write essays faster with more clarity using AI. Currently we are in early beta stage and figuring out how to make students more productive and solve their problems. I appreciate ideas, feedback..",
  "data/ph-top/2021/8/lumo-2.json": "With Lumo, you create REAL drawings with your iPad! ✏️✍️📈 Simply attach paper to your iPad, trace the glowing line, and bring a beautiful audio story to life!",
  "data/ph-top/2021/8/direcon-for-twitter-spaces-2.json": "Direcon was the first-ever analytics platform for Clubhouse & Spotify Greenroom. Today, we're proud to announce that Direcon now supports Twitter Spaces as well.",
  "data/ph-top/2021/8/emphatic-by-connect365.json": "Emphatic by Connect 365 saves you time and keeps you top of mind with your best prospects with completely done-for-you social media content and automated posting. Start a 14-day test drive and get 6 custom posts free.",
  "data/ph-top/2021/8/noteledge-adbe10f0-a32c-4b8b-a572-fe7c45d227ea.json": "NoteLedge is the best note-taking app for creatives and designers. It comes with powerful creative tools for you to quickly capture ideas from Pinterest and web pages, organize everything in one place, and make sketches to start your own design right away!",
  "data/ph-top/2021/8/savvycal-for-icloud.json": "The SavvyCal meeting scheduler you know and love — now with iCloud Calendar.",
  "data/ph-top/2021/8/nftport.json": "Using our simple API, you can turn anything into an NFT for free in 120 seconds. No previous blockchain experience needed. For developers, by developers. Built by a team of ex-NATO, Nvidia & Monese and backed by the Co-Founders of Polygon, Skype & Wise.",
  "data/ph-top/2021/8/pigeon-for-gmail.json": "A powerful CRM and automation suite directly inside Gmail. While other CRMs focus on sales, Pigeon is a perfect CRM for makers & creators. Simplify your outreach. Create auto follow up sequences instead of setting up one time mail merges.",
  "data/ph-top/2021/8/hippobase.json": "Why overpay for managed databases? Hippobase makes it easy to self-host open source tools like Postgres, MySQL, MongoDB, Redis and others.",
  "data/ph-top/2021/8/heep.json": "Hire a designer creating websites with Webflow or a data pro automating workflows with Zapier and Airtable. Heep helps power users of no-code tools monetise their expertise by creating a portfolio and connecting with customers looking for help.",
  "data/ph-top/2021/8/mileways.json": "Mileways shows you all relevant flight information in real time and sends you notifications about important updates. It’s the easiest way to stay updated with your friends & family.",
  "data/ph-top/2021/8/platequery-2.json": "Report bad drivers, illegal parking, dangerous driving, or contact them with a license plate lookup. We have millions of license plate records for all states in the US. Every new post will be automatically published on several social media accounts.",
  "data/ph-top/2021/8/jikoo-io.json": "All in one Live Chat software with ticketing, no-code chatbots, and customizable CRM to grow your customer base and revenue. 100% free forever! Are you ready to join the Live Chat Revolution 2.0?",
  "data/ph-top/2021/8/talk-to-kanye.json": "TalkToKanye is an AI chatbot that speaks and thinks like Kanye West. ͏ ͏ Talk about art, religion, life, gossip, or anything else with the greatest human artist of all time!",
  "data/ph-top/2021/8/teleretro.json": "https://www.teleretro.com/ helps your team run fun and engaging agile retrospectives online. Plays videos, music and gifs right from your retro!",
  "data/ph-top/2021/8/illustrations-by-iconfinder.json": "The go-to resource for high-quality illustrations that will bring life to your landing pages, apps, presentations or documents. Choose from large style packs. Edit colors to match your brand. Download in SVG or PNG formats. The price is $5 per illustration.",
  "data/ph-top/2021/8/botmother.json": "Make communications with customers personalized and fast. Use smart chatbots! Simplify your chatbot development with a no code Botmother editor. Almost any logic can be deployed to personalize a customer journey in real time.",
  "data/ph-top/2021/8/air-for-adobe-premiere-pro.json": "Air's new remote video collaboration system gives your entire team access to the same media, all from within Premiere Pro. No more shipping expensive hard drives — your team's post-production workflow is now centralized and more efficient than ever before.",
  "data/ph-top/2021/8/instagram-for-intercom-by-octopods.json": "Octopods Instagram for Intercom brings one of the most popular social networks to your Intercom Inbox. Octopods offers a deep integration with Intercom using the official Instagram Business API, giving you the best of Intercom and Instagram.",
  "data/ph-top/2021/8/rabbit-habit-tracker.json": "A simple habit tracker with a powerful iOS14 widget set that helps build a better version of yourself. At the core of the algorithm lays the idea that you need 21 days to form a positive habit and 91 days to turn it into a lifestyle.",
  "data/ph-top/2021/8/ramp-2-0.json": "Consolidate corporate cards, expense management, bill payments, accounting, and reporting into one simple and free solution designed to save time and money. Businesses that use Ramp save an average of 3.3% and close their books 86% faster.",
  "data/ph-top/2021/8/frost-4-0.json": "Introducing Frost 4.0: The Netflix of writing apps. Get your first draft going without any hassle. No bells and whistles. Just you and your writing. Available for free on all desktop/laptop browsers. 🦌 Recommended browser: Chrome, Safari.",
  "data/ph-top/2021/8/webtoapp-design.json": "webtoapp.design is a no-code solution to convert any website into an app for Android and iOS. Send push notifications to your users with our dashboard or API. Our app store publishing help guarantees your success - or use our 60 day full refund guarantee.",
  "data/ph-top/2021/8/genei-de8fd111-cf09-498e-8101-6cb3d2e2f27d.json": "High quality content research in minutes not hours. Automatically summarise research content to make it easy to produce a first draft of articles, blog posts or reports.",
  "data/ph-top/2021/8/tesla-for-ios-4-0.json": "• Refreshed vehicle and energy homepage • Streamlined Summon experience • Enhanced phone key support • Send commands to vehicle immediately upon opening app • Shop the Tesla catalog and view and manage your orders",
  "data/ph-top/2021/8/sync-raise-hand.json": "- ✋ Your real raised hand will be synchronized with the action of the raise button in Google Meet. - 🔐 All processing is done within the browser. No image data will be sent to the any server.",
  "data/ph-top/2021/8/10x-managers-community.json": "Sign up for free to the https://10xmanagers.com/. A group of REAL managers seeking high performance for themselves, their employees and their business. We take the experience of REAL managers and distil it into actionable insight for you to learn and develop.",
  "data/ph-top/2021/8/the-modern-guide-to-sex.json": "Inclusive, fun and evidence-based coaching on the foundations of great sex, delivered by sex coach Georgia Grace (@gspot._). 15 video episodes cover sexual health, confidence, pleasure anatomy, different types of sex, libido, consent and boundaries.",
  "data/ph-top/2021/8/buttons-generator.json": "100+ buttons you can use in your project. Copy the CSS by clicking on the button.",
  "data/ph-top/2021/8/shake-crash-reports.json": "Turn your app crashes into relationship-building opportunities with your users, prevent bad reviews & fix issues fast. Personalized crash reporting harvests the power of data: Automatically see affected users, stack traces, screen recordings, network logs etc.",
  "data/ph-top/2021/8/ocoya-2-0-1.json": "A truly all-in-one platform for content marketing. 🖼️ Paint like Picasso with our editor, 10k+ templates, 1m+ images 📊 Generate high converting marketing copy with Travis AI ™ 📅 Schedule directly to your favorite social platforms Try today 👉 ocoya.net",
  "data/ph-top/2021/8/qapop.json": "QApop helps you run a successful marketing campaign on Quora. Discover exclusive insights to win more clients and boost your sales 🚀—even if you've never used Quora before.",
  "data/ph-top/2021/8/markdownx.json": "MarkdownX is the ultimate markdown editor with a dropdown menu of items including headers, lists, images, code blocks, links, animated GIFs, Youtube Emdeds, Codepen Embeds, and much more 🚀 The editor outputs clean Markdown and also has a Preview Mode 🍿",
  "data/ph-top/2021/8/reviewr-ai.json": "https://reviewr.ai collects and summarizes reviews, so you don't have to. Reviewr is powered by the latest in NLP. Add Reviewr to your website with our widget or API and increase buyer trust. ⠀ See Reviewr live in action: 🎒 https://baqpa.com 💰 https://dealwyze.com",
  "data/ph-top/2021/8/lumina-4k-webcam.json": "Lumina uses AI to understand and adapt to your environment, ensuring that you look great at all times. Combined with a top-of-the-line 4K sensor, now you can get that DSLR look without piles of equipment, complex setup, or thousands in cost.",
  "data/ph-top/2021/8/rasterizer-io.json": "An image generator that uses data from your online profiles! Show off the number of subscribers you have in an image that you design.",
  "data/ph-top/2021/8/union54.json": "Union54 is a debit card issuing API for Africa. It allows any software company to provide debit cards to their customers without needing a bank partner or a \"credit card processor\". Marqeta for Africa.",
  "data/ph-top/2021/8/careerist.json": "Launch or grow your tech career fast with Careerist: 👩‍💻 Immersive, practical training for high-paying tech jobs 🔎 Automatically apply for job openings 🏋️‍♀️ Gain experience with a built-in internship 👨‍🏫 Prepare for interviews with your 1:1 mentor",
  "data/ph-top/2021/8/dispatch-346ebcf1-712d-43be-b2d6-bc3a8cffcba6.json": "People have always wanted server-specific P2P or group DMs in Discord. This one feature has been a deal-breaker, which keeps people away from using Discord and settling for Slack. We are here to change that. Add P2P, group DMs like Slack to personal servers.",
  "data/ph-top/2021/8/smooth-talker.json": "Make Your Voiceover Videos Stand Out: 1. Automatic Silence Removal 2. Create An Engaging Video In Seconds 3. Compatible With Any Video Smooth Talker is an app that makes automatic edits for you to create fast-paced videos in a few seconds.",
  "data/ph-top/2021/8/remote-company-finder.json": "Remote Company Finder lets you find remote teams where you can work synchronously with other team members. Enter your location and see remote companies who have the most locations in your time zone.",
  "data/ph-top/2021/8/noizable.json": "Download 100+ audio files with human noise. You can freely use it for private and commercial projects. Get sounds like \"woosh\", \"ding dong\", \"yuck\" and more.",
  "data/ph-top/2021/8/meta-journal.json": "What's your greatest achievement in 2021? Notice everyday small wins and start your accomplishment journal. Create momentum and focus on your progress day after day, it's motivating and keep yourself accountable.",
  "data/ph-top/2021/8/twittr-gems.json": "Twittr Gems helps you Find, Discover and Read the best Twitter Threads from over 50 of your favrioute creators across 25+ categories in the most easiet way.",
  "data/ph-top/2021/8/vehicle-listings-api.json": "Easily create online automotive commerce experiences in apps or websites with this Vehicle Listings API. Search available vehicles by Year, Make, Model, Trim, Options, Features, Location, and much more. Access full vehicle details and photos from https://auto.dev",
  "data/ph-top/2021/8/voicera-c056191a-efde-496e-a562-ace0f5f50bb3.json": "Voicera allows bloggers and content writers to embed life-like voice dictation of their blogs directly into their content. All in one click. They can reach their busy readers via interactive blogs that can speak and increase retention.",
  "data/ph-top/2021/8/bebe.json": "Find the perfect baby name! 💜 use matching to see which names you and your partner like 💜 over 30,000 names from all over the world 💜 no account needed",
  "data/ph-top/2021/8/beyond-mars-art.json": "Marketplace for rare digital art. Sell images/videos from your Instagram profile as NFTs directly on beyond mars art. Easy to use. Zero minting costs.",
  "data/ph-top/2021/8/dune-analytics.json": "Explore, create and share crypto analytics 📈 Thousands of dashboards for hundreds of projects 📊 Follow key metrics for DeFi, NFTs and more 👨‍💻 Query human-readable data with SQL",
  "data/ph-top/2021/8/auxpad-notes.json": "AUXPAD is a must have for students taking lectures, professionals in meetings, journalists collecting interviews, and anywhere when you need to put spoken words into written notes. 👉 Try it now for free! https://auxpad.com",
  "data/ph-top/2021/8/altafin.json": "AltaFin is on a mission to launch the world's first high-APY sustainable cryptocurrency saving platform, powered by AltaFin Token. Earn up to 22% APY on your crypto.",
  "data/ph-top/2021/8/geniemoji.json": "Geniemoji is an app that makes using emojis on desktops simpler than ever. Its purpose is to serve you with the most relevant emojis based on your command! Geniemoji lives in your Menu Bar once the app is launched. You can summon it by using Control + E.",
  "data/ph-top/2021/8/who-s-most-app.json": "FREE to Download!! Play Who’s Most Likely from hundreds of questions to test how well you know each other! Questions range from regular, to romantic, to a little bit raunchy! Play with friends, family or your significant other.",
  "data/ph-top/2021/8/crypto-backers.json": "﻿Browse through the Top-9 (based on public interest) coins and find out celebs who go an extra mile to make the future of crypto arrive at the world’s doorstep sooner.",
  "data/ph-top/2021/8/uideck-2-0.json": "Free and Premium HTML Landing Page Templates and UI Kits - Built with Bootstrap, Tailwind CSS and React. Create and Launch Complete Website and Landing Pages for Your Startup with Beautiful Design Without Coding From Scratch.",
  "data/ph-top/2021/8/cvshine.json": "Craft a great CV based on the professionals' feedback and open the door to new job opportunities.",
  "data/ph-top/2021/8/hey-design-systems.json": "Starting out with design systems, but don't know where to start? Need to update yourself with current practices? Here is your intro to all things design systems - Say hey!",
  "data/ph-top/2021/8/styler.json": "Styler is the next gen custom CSS builder developed to supercharge your hashnode blog. Styler comes with awesome features like Live Preview, Dark Mode Support, Breakpoints support, templates and much more to standout out your blog.",
  "data/ph-top/2021/8/webden.json": "WebDen is an open source mobile and tablet friendly code playground. It is a fully client-side app so you can install it as a progressive web app (PWA) on your device to use offline.",
  "data/ph-top/2021/8/pledre.json": "Physical schools are expensive to manage, grossly inefficient and so out of date. Pledre allows you to start a virtual school in minutes and reach millions of students across states and countries at your convenience",
  "data/ph-top/2021/8/common-surface-2.json": "Common Surface is a powerful hybrid working platform that handles all the complexity of building effective, flexible, hybrid work cultures - but saves you from the frustration, difficulty and conflict that arises from trying to do it using traditional methods.",
  "data/ph-top/2021/8/featurebase.json": "Featurebase helps you understand what ideas or problems your customers have about your product and, therefore, helps you steer your startup in the right direction. You can capture all their feedback, bug reports and feature requests on a public board.",
  "data/ph-top/2021/8/ayo-e924c48f-e8ac-417d-a179-eff0599cd169.json": "Another way to keep track of and share your links (with a twist). Get your desired username while you can :) Coming soon: link shortening and managing multiple pages.",
  "data/ph-top/2021/8/sentiful.json": "Sentiful is an augmented reality app that can be used to add hidden messages onto almost any objects. Use Sentiful to uniquely personalize your gifts by adding texts, images to videos (and more!).",
  "data/ph-top/2021/8/storytale-2.json": "Big illustration market improved and became bigger. Find high-quality scenes for your website, presentation, or app in one place. Today you can join Storytale only for $13/month.",
  "data/ph-top/2021/8/swordfish.json": "Tired of Sales Prospecting for Leads? Recruiting Candidates taking too much time? Accelerate finding your next Prospects or Candidates in record time. Get Direct Contact Info in Seconds. Cell Phone Numbers, Personal + Business Emails, Social Profiles and more.",
  "data/ph-top/2021/8/blurry.json": "Hide All Sensitive Information With Single Click. Save Hours Of Post Video Editing Hassles.",
  "data/ph-top/2021/8/microns.json": "Microns.io is a newsletter to discover the best micro-startups for sale. Join hundreds of other entrepreneurs, investors, and indie hackers looking for their next acquisition opportunity.",
  "data/ph-top/2021/8/yofte-e-commerce-ui-kit.json": "Yofte is a template for creating outstanding and converting e-commerce websites. https://shuffle.dev/marketplace/tailwind-ecommerce?ref=producthunt",
  "data/ph-top/2021/8/crypto-companies.json": "Check out our free public directory. Explore 500+ companies grouped by verticals and domains. It is designed to help you navigate the world of crypto.",
  "data/ph-top/2021/8/mosaic-10.json": "Workspace organization like you have never seen before! Organize your windows and make the most out of your workspace without sacrificing simplicity! 🤩🖥 Try it now, for free! https://mosaic.rcopstein.com/",
  "data/ph-top/2021/8/supportbell.json": "🔔 Get notified about Intercom Conversation Ratings in Slack ⏩ Respond immediately to customers that're unhappy with your support. 💬Enable collaboration for your Support Team right in Slack.",
  "data/ph-top/2021/8/note-garden.json": "Hey Hunters 👋 Here is NOTE GARDEN! How to Contact: E-Mail: learnobit@gmail.com Discord: https://discord.com/invite/WYkPZBQeNu Instagram: https://www.instagram.com/note_garden/ twitter: https://twitter.com/home Reddit: https://www.reddit.com/r/notegarden/",
  "data/ph-top/2021/8/smalldevtools.json": "https://Smalldev.tools provide 20+ tools that helps developers with commonly performed tasks like Encoding/Decoding, Minifying, Test Dummy data set and a lot more.",
  "data/ph-top/2021/8/uservitals.json": "Capture feedback from anywhere in seconds, plan your roadmap with a branded customer portal, and announce product updates. UserVitals allows your team to build outstanding products - all within one user-friendly and affordable product.",
  "data/ph-top/2021/8/1upblitz.json": "1UpBlitz is a SaaS starter built with blitzjs that will save you 60+ hours of work. 🤑 Create multiple plans 💸 Plan upgrading and downgrading 👥 Teams & Members 🔐 Authorization 💪 End-to-end tested 👉 Grab your copy at: https://1upblitz.com",
  "data/ph-top/2021/8/computer-engineering-for-babies.json": "Computer Engineering for Babies is a simple board book designed to keep your baby engaged while they learn about the stuff that computers are made from. If you skipped CE150, or just happened to miss the first couple days, then this book ought to catch you up.",
  "data/ph-top/2021/8/digitalpress.json": "Create and publish blog posts with your own Ghost blog. Launch a blog on your domain and publish content easily within seconds.",
  "data/ph-top/2021/8/dime-2.json": "Dime is the easiest way to turn your content into unique digital collectibles. Buy, trade, and display your collection, and we make the process fast and incredibly easy. It’s all the benefits of an NFT marketplace—with the barriers to entry removed.",
  "data/ph-top/2021/8/badaso.json": "Badaso is an API & platform builder, its also called \"low code development platform\" or \"lcpd\". Badaso help developers build their application 10x faster, even more. Also the important things, Badaso is open source and 100% free !",
  "data/ph-top/2021/8/minikey.json": "MiniKey is the simplest one time password generator for two-factor authentication. MiniKey lives in your menu bar, and lets you copy generated codes with a click, and drag codes from MiniKey into authenticating apps.",
  "data/ph-top/2021/8/zenland-ar-2.json": "Zenland is AR based app that recreates the world of Otto, a Zen which comes from Buddhism, that helps in meditative activates to activate your chakras and energy center in order to live a more balanced and serene life!",
  "data/ph-top/2021/8/guidedoc-2-0-2.json": "GuideDoc is a streaming documentary film platform with more than 1200 award-winning films from the best festivals around the world. 50% of all money generated goes directly to producers and directors so they can continue to make good documentary films.",
  "data/ph-top/2021/8/multiverse.json": "A collection of immersive universes where users appear as 3D avatars in free roam and interact via live voice. Universes are social communities curated by creative artists globally. Artists create, share, perform, and live broadcast to a global audience.",
  "data/ph-top/2021/8/stately-viz.json": "Stately Viz visualizes, simulates, and inspects state machines and statecharts created with XState in real-time.",
  "data/ph-top/2021/8/laconic.json": "Laconic is an app for book lovers to scan a quote from paper books (works in 100+ languages) and organize your own book summary. It's free with unlimited scan and notes, you can pay for extra text formatting and tags.",
  "data/ph-top/2021/8/commont.json": "Commont allows you to effortlessly add a comments section to your website. 🎃 Headless — You write your own UI. No ads included. ⚙️ Admin panel — Manage your projects and comments. 🎉 Free for hobby usage — You can scale up if you want.",
  "data/ph-top/2021/8/smart-ads-by-unbounce.json": "Get more out of your digital advertising with AI. Smart Ads uses Unbounce’s AI-powered data from over 1.5 billion conversions and 70,000+ customers to instantly generate higher-performing digital ads to optimize your marketing spend and increase conversions.",
  "data/ph-top/2021/8/icon-horse.json": "When building products on the web, mobile or desktop, you often needs favicons (logos of websites). Icon Horse was born from that need – one simple URL for any given website you can embed in your app. And if it can't find an icon, it serves a fallback!",
  "data/ph-top/2021/8/hightouch-audiences.json": "Audiences makes the power of SQL accessible to everyone. 1. Connect any data source like a database, data warehouse, or spreadsheet 2. Pull data with our point-and-click UI 3. Send data to 60+ tools, like Google Sheets, Slack, CRMs, email, & ad tools",
  "data/ph-top/2021/8/bits-2-0-by-creative-tim.json": "Bits 2.0 by Creative Tim is an awesome library of code snippets that will help you avoid typing repetitive code. No need to download an entire theme! ✅ Bootstrap snippets ✅ Tailwind CSS snippets Try for free!",
  "data/ph-top/2021/8/pixelied.json": "Pixelied is an easy-to-use online design suite empowering entrepreneurs and small business owners to create stunning designs with just a few clicks!",
  "data/ph-top/2021/8/noteli.json": "Noteli is an Open Source CLI tool made especially for note-taking. Noteli is built using powers of TypeScript and security of Auth0 with MongoDB. Noteli would help developers to take notes quickly from the shell without wasting time through GUI :P",
  "data/ph-top/2021/8/bootstrappers-2.json": "The publication for bootstrapped startups.",
  "data/ph-top/2021/8/warmer-ai.json": "Warmer.ai writes highly personalized emails based on a prospect's Linkedin profile or website. You can create one off emails or in bulk using a CSV file",
  "data/ph-top/2021/8/oka-todo.json": "Do you feel that the 'todo' Apps in the current Store are a little bit complicated for you? Oka Todo is a new todo list App that makes task management so easy and simple. - hide/display on the screen side - fold/unfold the task item - colorful group settings",
  "data/ph-top/2021/8/my-crypto-profile.json": "My Crypto Profile is a browser extension that allows you to show your NFT collections on Twitter. - Shill your NFTs and discover NFT artists on Twitter - Connect Ethereum address with Twitter account in a secure manner",
  "data/ph-top/2021/8/wellpaper.json": "WellPaper is a dynamic wallpaper that displays your screen time & smartphone usage on your lock screen. With rising smart-phone usage, there’s never been a greater need to stay aware of how you’re using yours.",
  "data/ph-top/2021/8/walden-directory.json": "The Walden Directory is a community of high quality coaches, across a wide range of specialties. Find your perfect coach, set up a discovery call or send them a message to learn more.",
  "data/ph-top/2021/8/lasershow-video.json": "Videos drive audience engagement. LaserShow automates video ideation and production. Amplifying your message with video has never been easier. - Your branding, niche, topic, content - Our augmented AI delivers social media style videos right to your inbox",
  "data/ph-top/2021/8/sticker-doodle.json": "Sticker Doodle is an app for creating your own stickers that can then be sent to anyone via iMessage. You're just a tap away from sending your very best finger paintings! Got an iPad? Get serious about your Sticker Doodles with an Apple Pencil!",
  "data/ph-top/2021/8/workpatterns-for-zoom-apps.json": "Take your management up a notch with better 1:1s and team meetings in Zoom. Collaborate on agendas, then let WorkPatterns for Zoom guide your in-meeting experience. Maintain alignment by documenting decisions, next steps, and ownership without leaving Zoom.",
  "data/ph-top/2021/8/legiit-leads.json": "Legiit Leads is the ultimate in lead generation and fulfillment for services based businesses and agencies. Simply put in your location and niche and Legiit Leads finds you leads, and people to fulfill the work for you in a matter of seconds.",
  "data/ph-top/2021/8/grain-by-moment.json": "Make pro-grade video presets in minutes...all on your iPhone and iPad. It’s as simple as editing a photo, using your fingers to dial in the texture, color, grain, light leaks, borders, and overlays you want. Import, create, and export right back into your favorite editing app."
}