{
  "data/ph-top/2022/7/avid-fm.json": "Just want to teach but annoyed by the hassle in making video courses? AVID creators do it all with audio, and validate ideas via crowdfunding before production. Plus, learners achieve up to 16x better results!",
  "data/ph-top/2022/7/cleanmymac-x-menu-app.json": "Meet an all-new CleanMyMac X Menu App that aims to increase the longevity of your Mac with the help of five detailed health monitors. Get instant information about your Mac’s storage, state of protection, CPU performance, RAM, and battery.",
  "data/ph-top/2022/7/superflow.json": "We're building the biggest library of styled Webflow components. No need to clone any template, instantly copy and paste a component into your project and customize it to apply your branding.",
  "data/ph-top/2022/7/thanks-app-for-slack.json": "Built for Slack, Thanks is a recognition app to appreciate your fellow team and community members. Build a culture of appreciation, and incentivize your people to help each other. With Thanks, never forget to thank your co-workers or fellow community members.",
  "data/ph-top/2022/7/kleanmail-free-email-verifier.json": "KleanMail, an AI-driven cloud-based email validation tool, enables maintenance of good IP & domain reputation while significantly reducing costs and boosting email deliverability.",
  "data/ph-top/2022/7/flywheel-2.json": "FlyWheel is a Slack Superbot that makes the life of community managers easy. It provides intelligent analytics about community members and lets them automate everyday tasks. It also allows you to respond to all queries straight from the dashboard.",
  "data/ph-top/2022/7/internxt-send.json": "Internxt Send is an encrypted file-sharing service that allows you to securely share files with online. Anonymously send large files to anyone for free. Internxt Send is a product of privacy company Internxt.",
  "data/ph-top/2022/7/flashlist-for-react-native.json": "Lists are a pain in RN. They can be a perf nightmare and who likes blank cells? Today, FlashList offers: - Up to 5X FPS in UI Thread - Up to 10X FPS in JS Thread - Easy migration We've already shipped it in some of our apps & we're excited for you to try it!",
  "data/ph-top/2022/7/jd-generator.json": "Turn your drab JDs into powerful JeDis! Our AI algorithm generates high-quality job descriptions to help businesses identify the right skills for a job, stand out and attract the best talent. SAVE up to 90% of your time by creating professional JDs for FREE!",
  "data/ph-top/2022/7/google-password-manager.json": "Strong, unique passwords are key to helping keep your personal information secure online. Google Password Manager can help you create, remember and autofill passwords on your computer or phone: on the web in Chrome, and in your favorite Android and iOS apps.",
  "data/ph-top/2022/7/signaturepro.json": "Learn how to sign beautifully with SignaturePro. We will help you create an amazing signature for yourself and teach you how to write it in 30 minutes, even if your handwriting is bad!",
  "data/ph-top/2022/7/podnotes-io.json": "This tool uses artificial intelligence to create engaging show notes, blog posts, episode titles, social captions, and transcriptions! The tool allows you to quickly create content from local files, a descript link, or simply by searching for a podcast!",
  "data/ph-top/2022/7/everyone-draw.json": "An infinite canvas for people all over the world to collaborate on pixel art. Sixteen colors, endless possibilities.",
  "data/ph-top/2022/7/bravo-2.json": "BRAVO is a truly personalized recognition & reward system that helps employees feel appreciated & motivated everyday. With BRAVO’s detailed analytics & reporting feature, you can see who’s winning more & who needs a little boost to shine for the next project.",
  "data/ph-top/2022/7/notific-2.json": "Notific is a multi-chain, multi-platform notification service for your crypto wallets (Ethereum and polygon). Users can get real-time updates of their wallet activity right on WhatsApp and Telegram.",
  "data/ph-top/2022/7/60-pretty-random-illustrations.json": "Find detailed illustrations across animals, plants, food, transport, fiction, and even isometric for you next project. Be it video, decks, branding, letterheads, or motion graphics, we've got you covered!",
  "data/ph-top/2022/7/sales-os.json": "A kick-ass and aesthetic sales management system that centralizes all your clients, orders & products into your digital workspace.",
  "data/ph-top/2022/7/batchable.json": "Batchable lets you run large-scale human tasks with 5 clicks. It's the best way to orchestrate hundreds of global workers around: ✅ Complex data entry ✅ Phone calls (i.e. with phone trees, dialers, IVRs, etc) ✅ Data extraction from PDFs, CSVs, & documents",
  "data/ph-top/2022/7/terminal-gif-maker.json": "Terminal Gif Maker is a tool for creating code samples in the terminal interface. You can create gifs for your projects and you can show that in the README of your project. You can use the GIF in git providers like Github and Gitlab.",
  "data/ph-top/2022/7/journey-6.json": "Journey helps you achieve your personal goals through a simple three-minute morning routine that fits into every schedule and will make your days feel more intentional, more productive, more in-control.",
  "data/ph-top/2022/7/gameflip-2.json": "Gameflip is a marketplace for over 6M gamers to buy and sell digital items. We’re bridging the gap between developers, publishers, and gamers in emerging blockchain technologies, positioning Gameflip to make blockchain-based games accessible for everyone.",
  "data/ph-top/2022/7/explaining-ukraine-podcast.json": "A podcast is made by UkraineWorld.org, a multimedia project about Ukraine run by Internews Ukraine. \"Explaining Ukraine\" literally explains in common language all the crucial events happening in Ukraine, with its politics, society, and culture.",
  "data/ph-top/2022/7/shiftx.json": "A user-friendly, drag-and-drop, process visualization tool with connected data. Enable everyone in your organization to quickly map out and understand your processes, workflows, and customer journeys. No download needed - use it in your preferred browser.",
  "data/ph-top/2022/7/zamgeldi-me.json": "zamgeldi.me collects the price hike news for products in Türkiye.",
  "data/ph-top/2022/7/how-to-professionally-say.json": "A simple static website for common phrases we might want to say to your colleagues but want to make it sound more professional.",
  "data/ph-top/2022/7/auto-subtitle-generator-by-media-io.json": "One-click auto subtitle with an accuracy rate of up to 98% and supports multi-language to greatly improve your efficiency!",
  "data/ph-top/2022/7/keytunity.json": "Keytunity mines your Google Search Console data, together with crawls of your website to produce new, unique keyword recommendations. These suggestions include new article ideas and content add-on topics designed to grow your traffic and site.",
  "data/ph-top/2022/7/ruttl-2.json": "ruttl is a website feedback tool that allows you to leave comments directly on live websites and make real-time CSS edits, so that you can share precise design feedback with your team. Check https://www.youtube.com/watch?v=vkx366sknD4&t=65s&ab_channel=Ruttl here",
  "data/ph-top/2022/7/laserfocus.json": "Laserfocus makes your sales process as simple as possible, but not simpler. We show what you need to focus on and ensure everything is in Salesforce.",
  "data/ph-top/2022/7/schnapps-3.json": "A Decentralized Prediction Game on Solana. Predict whether the price of SOL will rise or fall - guess correctly to win your share of the round’s prize pool! Playing Schnapps lets you test your foresight to earn rewards.",
  "data/ph-top/2022/7/krock-io.json": "Krock.io is a content review and project management platform for creative agencies, video production teams, and freelance professionals. Forget about endless unclear revisions and long email threads. Focus on creativity with features for review and approval.",
  "data/ph-top/2022/7/rektmeter-by-wall.json": "A fun tool to checkout stats on any NFT Wallet on Ethereum. Portfolio value, ATH, Profit, Best & worst performing NFTs, Highlight flips, trading stats & more. See how and your degen frens Wallets have been doing!",
  "data/ph-top/2022/7/hagrid-2-0.json": "You work really hard to get people to your website. And they have so many things they want to ask! hagrid is a social QnA widget, where visitors can ask questions and you respond; an interactive FAQ that adds trust and lets you connect with your audience.",
  "data/ph-top/2022/7/arctaurus-2.json": "Build custom automations for trading crypto. Want to trade immediately when the price breaks through a technical indicators? Easy! Build fully custom market making strategies or a kill switch that sells all your coins? Its all possible with no coding required!",
  "data/ph-top/2022/7/readapt.json": "Designed for those with reading challenges like dyslexia and poor vision. With Readapt, you can customise your reading preferences and adapt text (English or French) on websites and Word documents to suit your reading comfort and preferences.",
  "data/ph-top/2022/7/online-video-editor-by-media-io.json": "The interface of the Media.io editor is super clear and easy to use. There are also a variety of templates and background music to choose from and the automatic subtitle generator is 100% free to use! You can also edit it to fit Instagram stories for free！",
  "data/ph-top/2022/7/noysi-enterprise.json": "Noysi Enterprise is the growth ally for your business or community. Noysi is your communication hub for your business or community, now customized on your own domain using CNAME.",
  "data/ph-top/2022/7/marvelorder.json": "Keeps track of previous and upcoming Marvel Movies and Series ordered by release, chronologically, by Official Disney+ In-Universe Timeline, and more.",
  "data/ph-top/2022/7/outverse.json": "Outverse is reimagining the experience for internet communities – combining forums, Notion-style custom spaces, video and more.",
  "data/ph-top/2022/7/screenleap-for-websites.json": "Once you add a code snippet to your site and configure it, you will be able to interact with your users using Google Meet-like functionality (screen sharing, live video, audio, and chat) directly from your website.",
  "data/ph-top/2022/7/plezi-one.json": "The perfect toolkit for overwhelmed marketers to launch and develop your B2B inbound marketing strategy: 📈 Acquisition and SEO dashboards 🎣 Conversion boost thanks to forms and lead magnets 💌 Engagement automation with email campaigns",
  "data/ph-top/2022/7/uiscore-digital-marketplace-2-0.json": "A curated digital marketplace with a growing library of studio quality design resources for designers, agencies and developers.",
  "data/ph-top/2022/7/plg-goal-templates.json": "PLG Goal templates is pre-made business metric templates used by top product-led organizations such as Slack, Sentry, Airtable Zoom etc. It helps you set the right PLG Goals according to stage of your company across your teams.",
  "data/ph-top/2022/7/neopop.json": "Building for & with the community is what drives us at CRED. When we launched NeoPOP, we planned to open-source it for the developer community. Because art is for everyone. Today we've made the NeoPOP UI framework opensource for Web, Android, iOS and Flutter",
  "data/ph-top/2022/7/notion-sql-learning.json": "Are you looking for a way to save time and fast-track your SQL learning? Notion SQL Learning is designed to be simple and easy to follow so that you can start learning SQL quickly.",
  "data/ph-top/2022/7/tauri-2.json": "Tauri is a framework for building tiny, blazingly fast binaries for all major desktop platforms. Developers can integrate any front-end framework that compiles to HTML, JS and CSS for building their user interface.",
  "data/ph-top/2022/7/swiftreply-2.json": "❌ Customers emails & questions can get repetitive & writing the same replies is time-consuming & hard ✅ SwiftReply is an all-in-one solution for your whole team to boost productivity, improve customer interaction, write & organize consistent canned responses.",
  "data/ph-top/2022/7/loops-cereal.json": "We love swag just as much as the next email startup. But t-shirts, mugs and stickers weren't quite worth getting out of bed for. We needed something energizing. Something with a bit of a crunch. Start your day with a box of limited-edition Loops!",
  "data/ph-top/2022/7/dropbase-2-0.json": "Dropbase helps you import data from complex and messy CSV and Excel files to a fully-featured SQL database, with automatic column mapping, error highlighting, and data validation/cleaning. Database setup and hosting included; no technical help required.",
  "data/ph-top/2022/7/just-launch-it.json": "Be proud of what you're building. Use our easy changelog to show your customers that your product is constantly improving. Announce your latest product changes, new features, bug fixes and more. Just launch it, we'll handle the rest!",
  "data/ph-top/2022/7/mockoops.json": "🚀 Mockoops enables you to create video animations by simply drag-dropping your screen recording and choosing a template. Transform boring screencasts into inspirational animations and upload to your favorite social media platforms!",
  "data/ph-top/2022/7/and-notes.json": "And notes - & - brings the power of a simple note taking app together with a bunch of smartness, so you can focus on taking notes and enjoy the insights.",
  "data/ph-top/2022/7/via-protocol.json": "Via Protocol is a cross-chain liquidity aggregation protocol designed to create a fast, efficient and seamless swap experience across 13 Сhains using 53 DEXs, 15 Bridges, and 5 Providers. Via can be thought of as the Visa and the Mastercard in the crypto world",
  "data/ph-top/2022/7/no-language-left-behind-by-meta.json": "FAIR (Facebook AI Research) built and open-sourced a state-of-the-art AI model that now translates between 200 different languages. The code and models are made available today as part of the Fairseq package.",
  "data/ph-top/2022/7/free-invoice-generator-7b9d1cd6-eac9-4224-81eb-e61c03b41ac3.json": "No one wants to pay transaction fees. Merchant tools like Zelle, CashApp, & Venmo allow for transactions without transaction fees, but they aren't professional when invoicing your clients. Bloom's new invoice generator solves this in an elegant new way.",
  "data/ph-top/2022/7/plural-2.json": "Plural is an open-source DevOps platform for self-hosting applications on Kubernetes without the management overhead. With baked-in SSO, automated upgrades, and secret encryption, you get all the benefits of a managed service with none of the lock-in or cost.",
  "data/ph-top/2022/7/bobby-6.json": "A desktop app that automatically backs up your Google Docs and converts them to useable formats for easy local access.",
  "data/ph-top/2022/7/developer-dao-fm.json": "Developer Dao FM is where you can chill and listen to Lofi music while building cool stuff!",
  "data/ph-top/2022/7/askbelynda.json": "askBelynda is a Chrome Extension with thousands of vetted eco-friendly products to shop on Amazon. We assess the company's values, certifications, and product quality to ensure you're supporting reliably sustainable companies. Make sustainable shopping simple",
  "data/ph-top/2022/7/stackbricks.json": "Start with a pre-built stack, customize later. Simply connect your AWS & GitHub - and your stack is live in minutes. Deploy JAMstack, APIs, microservices, databases and much more",
  "data/ph-top/2022/7/glowbom-2-0.json": "Glowbom is a no-code tool to build apps and games for the most popular platforms out there. Build a game, store, chatbot, survey, or mix & match to create something truly yours. Export code as Flutter, Unity, SwiftUI, Jetpack Compose, or Web3.",
  "data/ph-top/2022/7/tazapay.json": "Tazapay provides cross-border checkout via APIs and plugins on platforms such as Shopify, WooCommerce, Magento, etc. Local collections in over 173 markets (cards and non-cards). Dashboard with seamless onboarding and options to create no-code payment links.",
  "data/ph-top/2022/7/spoke-6d11f1fa-6535-4f41-82db-37b127f75099.json": "Spoke is a child of the new videomeeting culture. It allows you to record, transcribe, highlight, AI summarize and finalize meeting notes from any videocall on Zoom, Teams, Meet - or async!. Spoke also offers workspaces, a search engine and granular sharing.",
  "data/ph-top/2022/7/collectible-avatars-by-reddit.json": "Designed by some of Reddit’s most passionate visual artists, new, limited-edition Collectible Avatars will soon be available for purchase in the Reddit Avatar Builder, with proceeds going to artists who design them",
  "data/ph-top/2022/7/the-social-app-2.json": "Launch a end-to-end encrypted, subscription-based Group Chat with a vanity URL. Monetize your followers or upgrade your groups from \"paid newsletter\" to the new 'Paid Group Chat'. Create a Group Chat, Set a Price, Claim a URL, and Done.",
  "data/ph-top/2022/7/daily-3pm-links.json": "The best way to grow your revenue and traffic from Google is to build high quality backlinks. The ⏰ 3pm Links email, a free daily email that curates link-building opportunities from the internet's top sites, makes this easy.",
  "data/ph-top/2022/7/openillux.json": "Openillux is a curated list of collections on the awesome free illustrations",
  "data/ph-top/2022/7/hypersonic.json": "Hypersonic is a Raycast extension that lets you create, complete and navigate your to-do's in Notion faster than ever. All your quick thoughts and tasks are now one shortcut away.",
  "data/ph-top/2022/7/iconz-2.json": "200+ handcrafted 3D icons ✌ This ultimate pack of 3D icons can be used for multiple purposes like - UI, social media, games, AR/VR.. anything. Buy once, use thousand times.",
  "data/ph-top/2022/7/designers-lobby.json": "Designers Lobby is a curated collection of more than 1200 design resources and tools with over 60 categories handpicked from the web to save you time and needless web wandering and helps you make an effective & well-organized workflow.",
  "data/ph-top/2022/7/notion-for-designers.json": "Notion for Designers™ was developed to help remove the chaotic workflow from creative projects and has more than 30 templates to create a seamless workspace.",
  "data/ph-top/2022/7/homebrew-s-50-hr-resources-for-startups.json": "After working closely with and helping build out HR for hundreds of early stage teams, the Homebrew team open sourced this guide for free with 50+ curated resources to help any startup hire, manage, and compensate world class employees.",
  "data/ph-top/2022/7/pocketbase.json": "PocketBase is an open source Go backend that has embedded realtime database, files and users management, admin UI and REST-ish API, all compiled in 1 portable executable. You could think of it as a lightweight alternative to Firebase or Supabase.",
  "data/ph-top/2022/7/autoregex.json": "Its 2022, we shouldn't have to write RegEx by hand. AutoRegEx uses OpenAI's GPT-3 to produce regular expressions from plain English.",
  "data/ph-top/2022/7/amplify-ui.json": "Amplify UI is a collection of accessible, themeable, performant React components that can connect directly to the cloud. 🎛️ 40+ components 🎨 Customizable with design tokens 🧑‍💻 Build visually with Figma integration ⚡️ And more!",
  "data/ph-top/2022/7/keysho.json": "Keysho is an easy way to integrate a lightweight omnibox search experience into your web application. Inspired by Notion, Linear, Ramp, and other industry leaders, Keysho is out to bring the ⌘+K&nbsp; paradigm to websites across the internet. 🚀⚡️",
  "data/ph-top/2022/7/piano-trainer.json": "Learn the piano at your own pace using your MIDI keyboard Quiz mode will test your knowledge on the circle of fifths and your key recognition. Practice mode will help you practice scales, chords and fifths!",
  "data/ph-top/2022/7/sonic-wallet.json": "Attention freelancers! By sharing your SonicWallet profile link, you can: 💻 Tell your customers about all that you do 💰 Collect payments & donations 💸 Sell & promote services E.g. https://sonicwallet.com/pages/testbot Get started for free today👇",
  "data/ph-top/2022/7/timeline-hero.json": "Create timelines for your projects easily with the Timeline Hero web app. Arrange your task with dependencies for a Gantt-Chart-like feeling. Export your finished timeline to PowerPoint to embed it in your presentations.",
  "data/ph-top/2022/7/borderless-2.json": "Borderless is a community-built platform where anyone can discover fully-funded opportunities to study abroad. It features transparent stories, reviews, requirements, and steps to apply. We bridge the gap between international talent and opportunity.",
  "data/ph-top/2022/7/code-language-converter.json": "Code Language Converter online uses artificial intelligence to quickly convert your code snippets from one programing language to another in a matter of seconds.",
  "data/ph-top/2022/7/apislist.json": "The APIsList is the directory for all the public APIs compiled from different open sources and enhanced its data with the APIsList parsing engine. This product allows you to discover the different APIs, starting from the most fun to the most productive ones.",
  "data/ph-top/2022/7/how-much-world.json": "I always wanted to visualize how much of the world I visited, now I can: the support different color palettes and social sharing to let everyone know how much you love traveling in your own way!",
  "data/ph-top/2022/7/aircrate.json": "Aircrate makes it easy to release your digital tool, software or product to the public - with the help of a directory you can submit your project within 5 minutes. Let users find the right tool based on the filter options pre-made into the platform!",
  "data/ph-top/2022/7/10web-booster-website-speed-optimization.json": "The complete website optimization you'll get with 10Web Booster speeds up your website on any hosting to a 90+ PageSpeed score and improves Core Web Vitals, increasing conversions, Google rankings, and overall performance.",
  "data/ph-top/2022/7/siter-io.json": "Siter.io is a no-code website builder that allows you to design and publish websites without any code. It works by designing directly in the browser, freehand, using tools you already know.",
  "data/ph-top/2022/7/swarmia.json": "The highest-performing software teams have one thing in common: they get a little bit better every day. Swarmia gives everyone in the engineering organization the insights and tools they need to improve productivity without sacrificing culture or quality.",
  "data/ph-top/2022/7/directual-for-web3.json": "Directual is a pro-level no-code platform for going beyond MVP. Meet freshly baked features that allow you to build amazing web3-apps (integrated with a blockchain) in a sleek no-code manner!",
  "data/ph-top/2022/7/disbug-2-0.json": "Disbug gives a delightful bug reporting experience for your QA, Clients & End-users! 🎥 Narrate and explain bugs with video 💬 Captures technical logs 💻 Edit/ Comment on live webpages for pixel-perfect feedback 🗣️ Posts automatically to the preferred PM tool",
  "data/ph-top/2022/7/dynamic-twitter-banner.json": "🐣&nbsp;Makers: Automatically display social proof and give thanks to your latest followers with this free tool. 🕐&nbsp;How? Connect your Twitter account and get started right away. 📈&nbsp;Increase your “follow ratio” and grow your audience in a fun way.",
  "data/ph-top/2022/7/the-history-of-ui.json": "I've put together a screenshot gallery of how the UI has changed in the past ~30 years.",
  "data/ph-top/2022/7/desklamp-2.json": "A PDF reader that makes reading productive and enjoyable. Make margin notes on a powerful, convenient and contextual rich text editor. View and search through highlights at a glance. Scroll easily with dynamic bookmarks. All while collaborating with your team!",
  "data/ph-top/2022/7/business-name-generator-by-namecheap.json": "Business Name Generator uses AI to create an unlimited number of unique business names for any industry. Simply add a few keywords related to your brand and our tech will generate brandable business names with website domains and custom logos to match.",
  "data/ph-top/2022/7/removepaywall-2.json": "RemovePaywall is a website that allows users to remove soft paywalls and ads from any news article or blog. It's free and easy to use. All you have to do is enter in the URL of the article.",
  "data/ph-top/2022/7/lendflow-credit-decisioning-engine.json": "Start approving borrowers in minutes with our Credit Decisioning Engine: an underwriting system for credit products. Pull dozens of data points to score and rank applicants in one API. Build, automate, and optimize workflows to launch credit products faster.",
  "data/ph-top/2022/7/elude-2.json": "Find your next great adventure with the only app that takes the normal out of travel planning. We’re here to show you what’s possible when you ask “where could we go for like, $600?”",
  "data/ph-top/2022/7/caplena.json": "Automate the tedious text analysis process. Gain actionable insights and share your results in dashboards. Powered by Augmented Intelligence. All in one platform.",
  "data/ph-top/2022/7/luvly.json": "Luvly is a face yoga beauty app that provides personalized face fitness programs, skincare courses, face massage tutorials, meal plans, and skincare expert advice. All to boost natural skin glow, heal the skin, tone facial muscles, and delay skin aging.",
  "data/ph-top/2022/7/zoom-to-beautiful-summary-converter.json": "'Zoom to Summary converter' is a preview of Typeform's new conversational product Relayed.ai. Import any Zoom meeting (or any meeting file) and output a beautiful AI-generated summary. This is just a tiny glimpse of what Relayed can do: https://relayed.ai.",
  "data/ph-top/2022/7/airgram-2-0-for-zoom-google-meet-teams.json": "Airgram is an AI meeting assistant for managers, team leaders, and hybrid/remote teams: 🎙Auto join Zoom & Google Meet, 💬support in-person meeting recording, 📝sort notes with tags, ✂️clip & share notes, and 🗂team workspace management.",
  "data/ph-top/2022/7/upnext-2.json": "The internet enabled anyone to publish at practically zero cost, and we now have access to millions of sources of written, audible and video content. This abundance of information allows us to stay up to date or learn about practically any topic.",
  "data/ph-top/2022/7/plug-play-by-swapstack-3.json": "Set up and run high-paying affiliate deals in your newsletter in minutes. 💰 Pre-approved, high-paying affiliate deals you can run anytime. ✍️ Maintain creative control of how the ads look & feel. 📆 &nbsp;Get paid at the end of each month.",
  "data/ph-top/2022/7/daftpage.json": "Daftpage is a new type of website builder that works like a doc. Create beautiful websites/blogs/knowledge bases in minutes ⚡️ without code and for free!",
  "data/ph-top/2022/7/investor-email-templates.json": "You are sending emails to (potential) investors without getting any responses? You are not alone. That’s why we curated best-practice templates for your investor email communication.",
  "data/ph-top/2022/7/smthg.json": "Enrich your product by creating a page with perks from top digital tools for your clients. Just choose suitable benefits and get a white-label page in a form of a link the same day. Then easily embed it inside your product and CJ as one more mini-service.",
  "data/ph-top/2022/7/funnel-easy.json": "Sometimes you just want to see the conversion rates of your website quickly. For that, no need to bring out the heavy artillery or complex tools. With FunnelEasy, no headache. It's simple, fast, and pretty! Create and export your Funnel charts in seconds ⚡️",
  "data/ph-top/2022/7/focus-timer-adjustable-hourglass.json": "We’re more distracted than ever before. Focus Timer is a tool which helps you effortlessly and beautifully integrate pomodoro and other time-blocking practices into your daily routine... It incorporates a 9-axis accelerometer to set the time with a twist.",
  "data/ph-top/2022/7/acure-io-autonomous-itops.json": "Acure.io is a simple yet powerful AIOps incident control and automation platform. You can build and manage CMDB with low-code engine, visualize the state of the entire IT, run automation from one system and easily put any application on performance monitoring.",
  "data/ph-top/2022/7/ai-powered-prospecting.json": "Surface high-quality leads with artificial intelligence. See how AI enables sales teams to accelerate to closed won. Sign up for our beta - email teams@calixa.io.",
  "data/ph-top/2022/7/openpod.json": "We’re a DAO-as-a-service platform for OSS projects to create their own DAO and custom token. Developers earn tokens for their work and early users/believers can invest in them. Tokens can be redeemed for project perks/benefits or sold for immediate returns.",
  "data/ph-top/2022/7/nothing-phone-1.json": "Less distractions. More soul. Just pure instinct, formed as a machine. Told through beautiful symbols. Deeper interactions. And brave simplicity. Phone (1) can bring us back. To us.",
  "data/ph-top/2022/7/sourcelevel-analytics.json": "Leverage your software engineering team with metrics on Pull Requests, Code Review, Collaboration, Throughput and Lead Times. Gather data from GitHub and GitLab and give you observability on the software engineering process.",
  "data/ph-top/2022/7/businesscards-io.json": "Businesscards.io is a digital business card service that give you the ability to keep your business card in your Apple Wallet. When you meet someone, simply pull out your card, have them scan your QR code, and it will load your business card profile.",
  "data/ph-top/2022/7/profilepicmaker.json": "Do you want to look like an animated princess? Or maybe a caricatured villain? What about a classical self-portrait? Powered by our advanced AI and love from the team, ProfilePicMaker has filters that imitate all of your favorite cartoon series.",
  "data/ph-top/2022/7/ember-fund-s-nft-and-metaverse-indexes.json": "Ember Fund is a self-custody crypto investing app that gives retail investors access to thematic crypto portfolios and strategies crafted by experts. Invest in blue-chip NFTs like Bored Apes and CryptoPunks, the top Metaverse assets, Bitcoin and Ethereum.",
  "data/ph-top/2022/7/reflect-2-0-2.json": "Announcing Reflect 2.0, the sequel to our popular notes editor. New features include: - Create templates for common snippets - Browse note revisions and revert - Brain visualization redesign - Date and time pref setting And much much more!",
  "data/ph-top/2022/7/patr.json": "Patr is an incredibly simplified cloud platform that can deploy static sites, web apps, databases, containers and more in seconds. In fact, You can build, deploy and host ANYTHING with a Dockerfile. You also get instant support from our dev team. No Cap!",
  "data/ph-top/2022/7/lost-geometry.json": "Huge set of 91 abstract 3D objects in various styles. Bring a modern touch to your interfaces with these vivid 3D objects, carefully crafted in Blender. There are 4 styles available: matte, clay, glass, and black. PNG version is available for free.",
  "data/ph-top/2022/7/photomash-studio-by-pixlr.json": "✨ Remove backgrounds in just ONE-TAP ✨ Create images to showcase products or people ✨ Create amazing profile pictures or store product images ✨ Batch Edit in one go ✨ And many more...",
  "data/ph-top/2022/7/sellscale.json": "SellScale generates hyper-personalized cold outreach by scraping data on prospects from across the web. We generate emails prospects actually want to read - far from {{First Name}} swaps. With SellScale, we've seen up to a 10x conversion on cold outreach.",
  "data/ph-top/2022/7/notion-creator-course-2.json": "Make money online selling Notion templates. Learn how to create and sell Notion templates to generate monthly $2000+ passive income on side.",
  "data/ph-top/2022/7/baryl.json": "Baryl uses AI/ML to algorithmically curate incredible restaurants & hidden gem recommendations matched to your personality & interests. We help you route-optimize, figure out the best times to visit each place, and make the most of your experience.",
  "data/ph-top/2022/7/shortcut-2-0-2.json": "Shortcut is the best place for software teams to plan, manage, and document their work. Shortcut now enables your team's documentation to stay in sync with their work, all in one place. That way software teams can focus on building and not the tools.",
  "data/ph-top/2022/7/hubspot-free-cms.json": "Launch, manage, and scale your website with HubSpot Free CMS. Take advantage of a suite of free content management tools designed to help you deploy a custom website in minutes, publish engaging content in hours, and grow your business for years to come.",
  "data/ph-top/2022/7/slogan-generator-4.json": "Creates a catchy and unique slogan for business.",
  "data/ph-top/2022/7/superduo.json": "SuperDuo is a digital companion service that matches each elder member with a trained & fun buddy. Your buddy can help you schedule your Uber, order groceries, play games with you & checks-in to provide your family with an update.",
  "data/ph-top/2022/7/eloking.json": "Eloking is a marketplace that connects customers with professional League of Legends, CS:GO & Valorant players! 🔥",
  "data/ph-top/2022/7/hype-day.json": "Get high-quality registrations for your web3 project's mints, giveaways, and raffles. All for free. Allow user registration based on: - Wallet balance - Holding a specific NFT - Twitter follows and retweets - Discord membership and roles - Email verification",
  "data/ph-top/2022/7/dokkio-sidebar.json": "Sidebar adds intelligence to web email, collaboration, and research in Chrome. From any web page or web app, tap the content and knowledge from your files, without juggling tabs. Make every search an automatic multi-search across everywhere your files live.",
  "data/ph-top/2022/7/figma-component-library.json": "I've curated the best Figma components in one place. Discover, copy and paste UI components in Figma with the most efficient way to build designs. Get all the essentials for any design project in one place.",
  "data/ph-top/2022/7/100-users-100-days-challenge-round-2.json": "The rules are simple for the 💯 USERS 💯 DAYS Challenge: get 100 new paying customers in the next 100 days. As you compete in the challenge you'll unlock access to a private community, mastermind groups, 1-1 mentorship and more.",
  "data/ph-top/2022/7/revenue-watcher.json": "Revenue Watcher is a carefully curated database of revenue numbers reported directly by the founders of startups and indie projects. Numbers are sourced from platforms like Twitter, Hacker News, YouTube, Starter Story, and Indie Hackers.",
  "data/ph-top/2022/7/unflow.json": "Add just a few lines of code to your mobile app to let PMs and marketers ship fully native onboarding carousels, video stories, feedback pop ups and more, without engineering help",
  "data/ph-top/2022/7/serve-3.json": "Serve is a tool for developers to generate APIs with their data super quickly. From SQL databases (PostgreSQL + MySQL) to Google Sheets, to even CSVs and JSON – you can turn any of your data into an authenticated API endpoint through a low-code solution.",
  "data/ph-top/2022/7/alfred-5-2.json": "Alfred's Workflow Editor has been rewritten from the ground up to be faster, more efficient, user-friendly and accessible. Discover new keyboard shortcuts, mouse interactions, a search palette, VoiceOver improvements and much more.",
  "data/ph-top/2022/7/plusidentity-browser-extension.json": "PlusIdentity is excited to share their newest feature, the browser extension! Together with the Slack app + web app, it brings you new functionalities such as auto-login and autofill.",
  "data/ph-top/2022/7/bookmarker-for-notion.json": "Unlock a new way of saving content into your Notion workspace, with candid URL previews which adapt to the content. Save anything from images, text extracts, articles, and much more!",
  "data/ph-top/2022/7/vidpowr.json": "VidPowr is an All-in-one futuristic video platform for creating interactive videos, player customization, video personalization, and video automation. Use VidPowr to transform your marketing videos, add interactivity, sell, collect leads, secure & get insights",
  "data/ph-top/2022/7/mapedia.json": "Mapedia is a crowd-sourced learning platform. It's the best place to start learning new topics, find the best learning materials, figure out what to learn next or connect with learners on the same path as you. Spend time learning, not wondering how to learn.",
  "data/ph-top/2022/7/notion-second-brain-2-0.json": "Second Brain is a digital system to capture and organize everything in one place, helping you manage your notes, resources, projects, goals, and more.",
  "data/ph-top/2022/7/tweepsbook-2.json": "What Twitter could not do with Twitter Blue, we did it for free. TweepsBook is a better bookmarking tool that allows you to import, organize, take, & share notes on all your “gyan-worthy” bookmarks.",
  "data/ph-top/2022/7/ava-maker.json": "AvaMaker is a free online tool for making cartoon avatars and social profile pictures. Generate and download special avatars to stand out from the crowd. Trendy avatar styles & numerous elements ready. SVG & PNG supported. You can also use it as an NFT Maker!",
  "data/ph-top/2022/7/supertokens-passwordless.json": "Join Slack, Medium and Instagram in enabling a passwordless login experience. With passwordless, developers can authenticate their users through email IDs or phone numbers!",
  "data/ph-top/2022/7/content-brief-generator.json": "Generate content briefs in minutes instead of hours using the power of AI. Share your briefs with just one click.",
  "data/ph-top/2022/7/fastlane-3.json": "The easiest way to build and release mobile apps. fastlane handles tedious tasks so you don’t have to. fastlane is an open source platform aimed at simplifying Android and iOS deployment, automate every aspect of your development and release workflow.",
  "data/ph-top/2022/7/marple-2.json": "Manage and visualize test- and measurement data in the Cloud. Create a free account, drag & drop your data files (.csv,ulog,.) and visualize many different signals all at once!",
  "data/ph-top/2022/7/gum-2.json": "Startups are hard, and every founder needs a community to succeed! Now, you can build & grow your startups together with Gum’s new video app - it’s kind of like TikTok for startups. Any startup creator can join and compete to win. What are you creating?",
  "data/ph-top/2022/7/oniri-2.json": "Use Oniri to write down, understand and control your dreams. Keep a dream journal and access the most popular lucid dreaming techniques, hundreds of interpretations, statistics, and much more.",
  "data/ph-top/2022/7/spydialer.json": "- Get to know about a phone number - Just type the number you want and see what you can get on it If you want to search using a name - type the first and last name and get all the data for free",
  "data/ph-top/2022/7/endpoint-space.json": "Simply copy a URL, and paste it to your form, that's all. Issue solved - all information sent from these forms will go to your account dashboard and email. You can also set up to receive submissions to multiple emails at the same time.",
  "data/ph-top/2022/7/droplove.json": "Create your own NFT smart contract. No code work needed No need for external contracts anymore, build your own once and keep total control over it.",
  "data/ph-top/2022/7/flowductive.json": "Stay focused with Flows -- a fun and unique way to improve your productivity.",
  "data/ph-top/2022/7/twitter-uni.json": "Twitter Uni helps you Find, Discover and Read the best Twitter threads & Newsletters from top thought leaders in the most easiest way.",
  "data/ph-top/2022/7/daily-journal-3.json": "Daily Journal is an all-in-one page that allows you to track every aspect of your life, from habits to finances. The compilation system is based on buttons, this method has been built to simplify much as possible your experience.",
  "data/ph-top/2022/7/git-story.json": "Tell the story of your Git project by creating video animations (.mp4) of your commit history directly from your Git repo. Visualize your Git project, share it w/ your team, create animated Git videos for blog posts or YouTube, help new developers learn Git.",
  "data/ph-top/2022/7/printable-reflection-journals-ebook.json": "A collection of digital & printable planners that help you reflect and review your whole year.",
  "data/ph-top/2022/7/locofy-ai.json": "Locofy.ai helps builders launch 3-4x faster by converting designs to production ready code. Try Figma to React, React Native, HTML-CSS, Next.js, Gatsby in FREE BETA! Tag responsive designs, make components, get a live-prototype & export code or direct deploy!",
  "data/ph-top/2022/7/clientdb.json": "clientDB is an open source in-memory database for enabling real-time web apps. Build fast, scalable apps that feel silky smooth for users.",
  "data/ph-top/2022/7/streamalive.json": "Bring your livestreams, team meetings and webinars to life with StreamAlive. Turn the chat into real-time visualizations—from word clouds to world maps. We’ll help you track, increase and convert engagement to move your audience from bored-away to blown-away.",
  "data/ph-top/2022/7/teta-cms.json": "Teta CMS is our in-house platform that provides a CouchDB database, User authentication with social OAuth providers, Real-time subscriptions, Custom queries with Ayaya, Auto-generated docs, and an easy-to-use and responsive user interface.",
  "data/ph-top/2022/7/authsignal.json": "Authsignal is a fraud ops automation suite combining drop in passwordless auth and a no-code rules engine. Integrated through a simple API, Authsignal provides a holistic view of fraud, empowering your team to tune friction and analyse threats in real time",
  "data/ph-top/2022/7/paperoad.json": "Paperoad makes it possible to create personalized posters that retrace the itinerary of your road trips, travels, marathons and to look back on good memories.",
  "data/ph-top/2022/7/activelink-by-xr-sports.json": "ActiveLink by XR Sports is a SocialFi tool that helps Creators capture more value from the original content they create through audio + video challenges. Fans can join online challenges that unlock rewards + access to their favorite Creators and Communities.",
  "data/ph-top/2022/7/get-intro.json": "Get Intro is a fundraising platform where investors can swipe, match and schedule a call with founders in less than 60 seconds. ** We don't own any of the pictures used in this presentation.",
  "data/ph-top/2022/7/linkedin-automation-by-overloop.json": "Connect your LinkedIn account to Overloop, and automate profile visits, connection requests, and direct messages. Crush your sales quota with Overloop and ultra-personalized multi-channel campaigns mixing cold emails and LinkedIn touches.",
  "data/ph-top/2022/7/paragraph-rewriter.json": "AISEO's paragraph rewriter simply helps you with rewriting paragraphs by transforming the structure of the content while keeping the relevant details. It does this at a blazing speed, using GPT-3 and other AI engines.",
  "data/ph-top/2022/7/codex-a456c800-169b-4efa-baaa-0f0c49805ce7.json": "Codex is a VS Code extension that allows any engineer to attach comments, questions or any kind of content to specific lines of code. This context follows your code as your team continues to build. Help your team understand your code base at a deeper level.",
  "data/ph-top/2022/7/beauty-hunter.json": "Did you know that up to 90% of beauty products aren't used after purchase? Beauty Hunter AI recommendation engine analyzes millions of ingredients and suggests skincare product that matches you!",
  "data/ph-top/2022/7/look-up-pro.json": "Supercharge your web search with custom queries directly from your clipboard. Like the native macOS Look up - but on steroids.",
  "data/ph-top/2022/7/snapchat-for-web.json": "Snapchat for Web includes top messaging features like Chat Reactions and Chat Reply, along with Lenses which will roll out soon. Snapchat for Web is available to Snapchat+ subscribers now in the United States, United Kingdom, and Canada, and more.",
  "data/ph-top/2022/7/tranch.json": "Tranch is the embedded B2B Buy Now, Pay Later solution. Tranch enables SaaS and Service providers to be paid upfront while offering their customers payment flexibility. Customers can spread invoices from $10k to $250k over 3 - 12 months.",
  "data/ph-top/2022/7/50-hacks.json": "Anyone can write tips that help them get things done—no account needed. The internet upvotes the best ones. You get a crowdsourced list of the top productivity tips!",
  "data/ph-top/2022/7/css-scan-3-0.json": "Goodbye to \"Inspect Element\" — Check the CSS of any element you hover over, instantly, and copy its entire rules with a single click ⚡.",
  "data/ph-top/2022/7/tam-calculator-by-clearbit.json": "The Total Addressable Market (TAM) Calculator is a free tool that helps you instantly generate market size + value. Use advanced filters, dynamic results, and access to Clearbit's database of 44M+ companies to turn long, costly research into a few clicks.",
  "data/ph-top/2022/7/payload-cms-2.json": "Payload is a developer-first headless CMS and application framework built to finally give developers a better choice in the world of CMS. From documentation to design, Payload is changing the CMS status quo.",
  "data/ph-top/2022/7/youcode.json": "YouCode by You.com is the search engine for developers. Copy snippets, write code with AI, validate JSON, and find documentation, tips, tricks, and utilities 10X faster than on traditional search engines.",
  "data/ph-top/2022/7/hugo-67a588e9-d883-477a-94fa-cecc8128674d.json": "Hugo is a complete SaaS solution for professional service freelancers to run and grow their business efficiently 📈 Fall in love with the simplicity and freedom of freelancing 🏖",
  "data/ph-top/2022/7/record.json": "Record lets support teams reduce the support cycle time by allowing users to record their problems. This Record can be easily shared internally to resolve users' issues. All is achieved by using the product and without downloading anything.",
  "data/ph-top/2022/7/supernormal-1-0.json": "Supernormal is your Video HQ for work. Easily capture and share your meetings on any platform. Or take conversations async with screen and cam recordings.",
  "data/ph-top/2022/7/trunk-merge.json": "Trunk Merge is an intelligent service that orchestrates merging pull requests to maintain a repository of code that always passes tests.",
  "data/ph-top/2022/7/limewire.json": "LimeWire is an easy-to-use NFT marketplace with a mission to allow artists to go back to selling records, music-related art and other collectibles directly to fans and followers — as simple as possible.",
  "data/ph-top/2022/7/neuton-1.json": "Neuton is a studying tool that helps students to learn any skill faster using a roadmap of skills along with the best resources from the internet in one place. Neuton also helps educators to advertise their educational content.",
  "data/ph-top/2022/7/image-host-company.json": "ImbBB but with your own Google Drive to get source links for all your media (images, gifs, sounds, videos...). Host your images at any high res.",
  "data/ph-top/2022/7/hopper-hq-2-0.json": "Hopper HQ is a social media management and scheduling tool that lets you easily and visually plan, schedule and automatically publish your posts on Instagram, TikTok, Facebook, Twitter, Linkedin and Pinterest.",
  "data/ph-top/2022/7/notion-time-tracking-by-everhour.json": "Track time with 0 effort right from Notion or Everhour browser extension. Everhour embeds controls into the Notion interface and extends it with many useful features. Track time using the timer or log time manually. Special discount for ProductHunt folks! ☝️",
  "data/ph-top/2022/7/momentum-for-upsells-renewals.json": "Momentum for Upsells & Renewals enables sales teams to increase their net dollar retention by automating their onboarding, upsell, and renewal processes through Account Rooms and Customer Channels in Slack, + integrations with Zendesk, Gainsight, and Catalyst.",
  "data/ph-top/2022/7/liveflow-templates-for-google-sheets.json": "🛠 Create your core set of templates, customized to your goals. 👬👬 Duplicate to serve multiple teams and clients. 💪 Empower your teams and level up your client offering with live dashboards. 😍 Save 2 days a month of financial reporting with 5 clicks.",
  "data/ph-top/2022/7/flycode.json": "FlyCode (YC S22) makes web apps editable without coding so companies can iterate and release products faster - helping teams edit copy, images, and links in the code so their developers don’t have to.",
  "data/ph-top/2022/7/animaker-ios-app.json": "10 seconds! That’s all you need to create a video in the new Animaker App! Sounds impossible? Well, it's possible now with the Trendy & Pro Video Making features that help you create videos in just 3 steps. Tap, Swap & Create! P.S. It’s absolutely free!",
  "data/ph-top/2022/7/raycast-for-teams.json": "Raycast is the one-stop solution to enhancing productivity on a Mac. We’re excited to bring this experience to companies with Raycast for Teams. Share Commands, Quicklinks, and Snippets across your organization to speed up internal workflows.",
  "data/ph-top/2022/7/call-to-action-examples.json": "CTA Examples is a curated list of call-to-action phrases for different goals. You can simply copy the desired CTA text with one click and paste it into the right place.",
  "data/ph-top/2022/7/copysmith-chrome-extension.json": "Copysmith uses cutting-edge AI to generate and enhance your product descriptions, ad copies, and so more right in your Google Chrome browser. Create, edit & optimize your content on any platform, so you can supercharge your productivity & conversion rate like never before.",
  "data/ph-top/2022/7/virtual-cafes-by-workfrom.json": "Mix custom background imagery with low-key video chat and your favorite music to create gorgeous online meetup spaces. Tailor everything to match your community, brand, and purpose. No-code design tools. Nothing to download/install. Create. Decorate. Share.",
  "data/ph-top/2022/7/metafy-classes.json": "With Metafy Classes, you get the chance to pick a gaming expert’s brain in a group setting. Get the benefits of learning from multiple perspectives as you team up with your classmates to get the answers to questions you don't need to invent all by yourself.",
  "data/ph-top/2022/7/stable-delaware.json": "Stable provides a permanent business address & virtual mailbox which can be used with the IRS, government entities, banks, and more. Our new address is for businesses formed in Delaware who’d prefer their HQ to be within the state!",
  "data/ph-top/2022/7/brand-studio-by-crowdspring.json": "Brand Studio is a design tool that will help elevate your brand in seconds. Add your website or upload your logo, and we'll create beautiful brand templates you can edit for free. Templates include invoices, business proposals, flyers, presentations, and more!",
  "data/ph-top/2022/7/tech-pizza.json": "Tech Pizza is a weekly newsletter about the tech news that matter. We make keeping up with tech simple, democratic, and fun. Like pizza 🍕 Available in audio🎙 video 📹 or text 📖, whatever fits you.",
  "data/ph-top/2022/7/bleep-beta.json": "Bleep is the virtual home for all your thoughts and inspirations. Add notes, images & links to capture what's on your mind. Create rooms to organize and curate them. Enjoy a fun, visual space that's truly yours, and let it grow with you.",
  "data/ph-top/2022/7/sleepagotchi.json": "Sleepagotchi is an app that rewards users for keeping a consistent sleep schedule with free NFTs and crypto tokens called SHEEP. Users get 1 Free NFT every morning, and 2 Free NFTs if they slept well.",
  "data/ph-top/2022/7/clipdrop-figma-plugin.json": "Use the most advanced image processing tools from ClipDrop directly in Figma: Remove background, object, text, people or defects in 1 click. And automatically decompose images into multiple layers!",
  "data/ph-top/2022/7/guide-for-podcasters.json": "We have prepared a guide for podcasters that will help make it easier to create, develop, and promote it. No need to scour the internet for individual pieces of information anymore. We have found everything, analyzed it, and left only the most useful🚀",
  "data/ph-top/2022/7/atomic-sheets-by-better-sheets.json": "Library of components you can instantly add to any Google Sheet. Add landing pages to sheets your users use. Create lead magnets with Google Sheets. Add Social Share Buttons to your sheets you share. Create better Google Sheets that people won't cringe at.",
  "data/ph-top/2022/7/miro-for-google-meet.json": "Leverage Miro in Google Meet to work together as a team in the same visual space, no tab-switching or account required. Take advantage of collaboration tools to make every meeting more inclusive and collaborative.",
  "data/ph-top/2022/7/tully.json": "The first emotion management smart bracelet combines biometrical sensors, AI technology, machine learning algorithms, and personalized coaching methodologies specifically designed to help kids recognize, manage and deal with their emotions effectively.",
  "data/ph-top/2022/7/moni-3.json": "Moni is the easiest way to track and analyze your tokens and NFTs. Users can discover new trending assets, view charts, get the latest news, and analyze off-chain and on-chain data. Moni Alpha Community here: https://discord.com/invite/eqdaqqqnx8",
  "data/ph-top/2022/7/banana-3.json": "Banana provides inference hosting for ML models in three easy steps and a single line of code. Stop paying for idle GPU time and deploy models to production instantly with our serverless GPU infrastructure. Use Banana for scale. 🍌",
  "data/ph-top/2022/7/portal-09f294dd-380c-4a73-8d6c-6bf098fd1762.json": "Portal is the first crypto wallet that's actually made for regular people. Portal in a nutshell: ✅ Send money with ease to verified recipients 📝 Pick a recovery phrase you can actually remember 🔐 Your keys, your coins",
  "data/ph-top/2022/7/openflow.json": "Turn manual processes into fully automated flows. ✅&nbsp;No-code builder for non-techies ✅ Customisable API for techies ✅&nbsp;Powerful AI on top of any application 🥳 More flexible, easier to use & cheaper than Zapier 🔥&nbsp;Give it a try at",
  "data/ph-top/2022/7/radix-ui-2.json": "Radix UI is a set of 26 unstyled React components for building high‑quality, accessible UI, design systems, and web apps.",
  "data/ph-top/2022/7/iollo.json": "iollo measures 500+ molecules in your blood to design and match you with dietary, behavioral, and soon, therapeutic interventions to help you live healthier and much longer.",
  "data/ph-top/2022/7/tweepsmap-3.json": "Build a thriving Twitter community with analytics, publishing & monitoring. Group content in your calendar & schedule threads, polls, tags while auto-posting at the best time with AI. Analyze anyone and filter analytics with demographics, content & keywords.",
  "data/ph-top/2022/7/winter-nft-checkout-for-platforms.json": "Businesses love Winter's credit card NFT checkout. Now, Winter helps launchpads & no-code platforms create NFT credit card checkouts at scale.",
  "data/ph-top/2022/7/olivine-marketplace.json": "Brought to you by Olivine, leaders in product marketing since 2016, our certified consultants have experience at top tech companies including AWS, ServiceNow, and Uber, along with dozens of early-stage startups in B2B SaaS. Pricing starts at $3,250 per month.",
  "data/ph-top/2022/7/fing-desktop-3-0.json": "Meet Fing Desktop 3.0 and take your internet security to the next level: see all the devices connected to your Wi-Fi, run internet speed tests, check router vulnerabilities and get professional troubleshooting tools.",
  "data/ph-top/2022/7/gomates-2.json": "Gomates is a convenient platform to manage carpools with people you already know and trust.",
  "data/ph-top/2022/7/propstar-for-figma.json": "Generate all possible instances for your components on Figma, including every combination of variants and component properties, all in a tidy labelled table.",
  "data/ph-top/2022/7/aspect.json": "Aspect is visual editor for react components. Convert designs into code using the Figma plugin, or sample UI from any site using Aspect's chrome extension.",
  "data/ph-top/2022/7/sesh-3.json": "Tell Sesh about your child’s tantrums each day to receive personalized science-backed techniques you can use right away. Receive daily guidance to coach you through applying techniques. Become a master of tantrum regulation!",
  "data/ph-top/2022/7/face-swapper-2.json": "FaceSwapper (https://faceswapper.ai) is a face swapping online tool that enables you to replace face with other faces of your choice. No need to swap face manually, just upload the face pictures, our AI system will process them automatically.",
  "data/ph-top/2022/7/terrabook.json": "An in-browser IDE fully integrated with your AWS account - think Replit for infrastructure. Start with ready-made snippets for anything - frontend, backend, databases. Edit Terraform code or write your own.",
  "data/ph-top/2022/7/nitro-2-0.json": "Nitro makes Product and Marketing translations easy! Translate landing pages, emails, blog posts, presentations and documents, etc. >Easy self-service order placement >Upload Google Docs or plain text >Google Docs formatting preserved >70 languages >API",
  "data/ph-top/2022/7/socialtribes.json": "This extension helps you automatically pull answers from your Facebook Group so you can avoid paying virtual assistants or wasting time copy-pasting answers. 1. Collect Facebook Group Member Data 2. Send New Facebook Group Member Data To Your Google Sheet",
  "data/ph-top/2022/7/one-click-videos-by-creatorkit.json": "CreatorKit is a video creator purpose built for ecommerce. ⠀ With One click videos, marketers can create marketing videos with just One Click. ⠀ Just enter the store URL or Product page and it will automagically generate 100+ branded videos.",
  "data/ph-top/2022/7/stella-2.json": "Stella is an AI solution that ingests company information living in Slack, Notion, Google Suite etc. and prepares daily summaries based on these inputs for leadership teams.",
  "data/ph-top/2022/7/chrome-extension-for-bubble-2-0.json": "Build nocode Chrome Extensions using your Bubble,io app.With our package + plugin you can build fully fledged extensions that can ready/modify a page, trigger actions, take screenshots, get the source code and much more! Supports the latest manifest v3 version",
  "data/ph-top/2022/7/strell.json": "Strell is a complete content optimization tool that assists SEOs and content marketers to write and optimize content to grow their organic search traffic.",
  "data/ph-top/2022/7/neednect.json": "For all travellers, NeedNect is the ultimate platform for personalized travel experiences. We believe that no two travelers are alike, so why should their experiences be? Our plattform will help you to customize your travel experience to match your needs.",
  "data/ph-top/2022/7/glyfs.json": "✶ glyfs makes it easy to copy & paste or drag & drop characters on your iPhone, iPad, and Mac. ✶ glyfs also features several simple text tools, including a letter case converter, word/character counter, text formatter, and more.",
  "data/ph-top/2022/7/refresh-bot.json": "Turn your old, pixelated, blurred or damaged pictures into high-definition photos with just one tap. and that Snapchat pic you toke with muddy filter can come clean again",
  "data/ph-top/2022/7/100-css-buttons.json": "From Signups to Sales, digital actions would be impossible without buttons. They're at the essence of human-computer interaction. With this package, give your website a new breath of fresh-air, like it never has before.",
  "data/ph-top/2022/7/my-abortion-network.json": "We want to take the heroism out of abortion care. We can make abortion more private and accessible than ever, by expanding the pool of clinicians trained in abortion care. It’s about health care, not politics.",
  "data/ph-top/2022/7/the-status-code.json": "The Status Code is your smart, no bs friend who tells you about API-first products and trends weekly. A friend who does the boring work, gives you industry trends, and covers interesting API-first startups. Simple, no jargon, and no bullshit.",
  "data/ph-top/2022/7/280-productivity-resources.json": "Discover the best productivity resources you'll ever need. Your bread and butter for productivity resources!",
  "data/ph-top/2022/7/form-with-sheet.json": "You have all your website Form data directly into your own Google spreadsheet table without any coding. Just connect your Google account and that's all.",
  "data/ph-top/2022/7/recurring-payments-by-decentro.json": "A 10X simpler and intuitive API solution for debiting payments from your customers' bank accounts in a recurring manner. Super useful for all Indian fintechs and companies that need to manage subscriptions, loans, auto-debits, or premium payments of any kind.",
  "data/ph-top/2022/7/heyhey-4.json": "HEYHEY is all about helping you centralize your digital presence while expanding on what a personal homepage can be. Choose from a list of carefully crafted themes, see analytics about your page, sell digital goods, and more!",
  "data/ph-top/2022/7/undaku-2.json": "Undaku is the ‘SaaS’-iest Open-Source no-code platform for modern systems. With Undaku, you can build - B2B SaaS Native applications - Web Applications - Mobile Apps - Internal tools/ Business process Automation - Website",
  "data/ph-top/2022/7/makerbox-frameworks.json": "Level up your marketing. Stress-free. Grow faster with 50 battle-tested marketing frameworks. Sharpen positioning, increase sales and build your audience with 10-minute guides 🔥",
  "data/ph-top/2022/7/abbot.json": "Abbot helps teams keep track of customer conversations in Slack and automate manual work. With built-in reporting and a powerful integration layer, Abbot can save your team hours of work and endless headaches.",
  "data/ph-top/2022/7/avoma-sales-playbook.json": "Most sales playbooks are too generic to be actionable. Not this one. We analyzed hundreds of sales calls to come up with an actionable playbook for sales leaders, managers, AEs and SDRs. The result? A playbook that is not watered down to generalities.",
  "data/ph-top/2022/7/brandwork.json": "Spend less time figuring out how your logo and brand assets should look when building an MVP by using professionals. The brandwork team are experts in prompt-building ensuring you get quality brand assets without the worry or stress of doing it yourself.",
  "data/ph-top/2022/7/views-figma-plugin.json": "Figma Views lets you bookmark the areas of interest in your canvas. Use it to organize stuff you want to revisit like mapping the main parts of your file. And it shines when you're screen sharing! It minimizes frantic cursors and all the panning and zooming.",
  "data/ph-top/2022/7/play-spotify-together-in-remotion.json": "Lightweight audio rooms that synchronize music in your Spotify macOS app. Music fades when you talk. And best of all, it’s free for everyone. No Spotify Premium Required.",
  "data/ph-top/2022/7/web3-faces.json": "Upload a profile picture of your web3 self with your twitter handle, and anyone can find your pfp sticker by searching for your twitter handle."
}