{
  "data/ph-top/2022/4/uizard-hat-1-0.json": "Now you can create design mockups straight from your mind. Put on your Uizard Hat 1.0, visualize your product, and there you have it: from idea, straight into fully interactive prototype. Unleash the power of true design thinking. 🧙",
  "data/ph-top/2022/4/bookable-schedule-by-boomerang.json": "📥 Meeting scheduling inside the Inbox - for you & your guests 🧙‍♂️ The Magic Live Calendar updates in real-time, no double booking, works everywhere 📅 Guests can overlay their calendars ⚡ 23% more meetings booked 🤝 The thoughtful way to schedule meetings",
  "data/ph-top/2022/4/greetpool.json": "Greetings are better, together. Create fun 🥳 and engaging ✨ group cards with your friends, family, or coworkers and make your celebrations 🎉 more memorable💛",
  "data/ph-top/2022/4/shipyy.json": "Shipyy helps developers/engineers build internal tools(in 5 mins) for business, product, operations and other teams using existing SQL queries, python/JS scripts, rest api endpoints. Ensuring production database safely using audit logs, roles and permissions.",
  "data/ph-top/2022/4/unicorn-warrior.json": "The cheatsheet every founder and marketer will love ✅ 100+ Viral marketing strategies and frameworks (easy to digest) ✅ 150+ Viral marketing case studies (the largest library of viral marketing case studies) ✅150+ Cognitive biases to influence your customers",
  "data/ph-top/2022/4/product-discovery-3.json": "Discover your next winning product, service or feature. This Notion space uses a three stages system to help you ideate, screen and research ideas based on customers, users and employees’ feedback.",
  "data/ph-top/2022/4/hide-the-pain-harold-s-april-prank.json": "Create personalized videos with the most famous meme for your friends and colleagues on April Fool's Day. Colossyan's technology will allow Harold to reach thousands of people and deliver a personalized prank on them.",
  "data/ph-top/2022/4/clovercities.json": "Today’s websites all look the same. We’re bringing back the creativity of the early web with the first no-code solution for Web 1.0 homepages featuring: AI-generated content, drag and drop interface, special effects, and smart widgets. Yes, it really works!",
  "data/ph-top/2022/4/vocally-2.json": "Generate realistic high-quality Text to Speech voices from some of the best cloud providers in the world - Amazon, Google, IBM and Microsoft. Instantly convert the text into natural-sounding speech in 550+ voices & download as MP3 audio files.",
  "data/ph-top/2022/4/notion-pack-for-coda.json": "What you can do with the Pack? 📊 Visualize your Notion databases as word clouds and charts. 📧 Send a Slack messages via automations when a value changes in Notion. 🔄 2 way sync using actions and Packs, update Notion icons, covers and page properties!",
  "data/ph-top/2022/4/inside-com-d6efe3a7-cdd2-4436-9311-671f0067186c.json": "We’ve taken our amazing newsletter content, which reaches over 250,000 people a month, and put it into a social networking site similar to Reddit, Twitter, and LinkedIn.",
  "data/ph-top/2022/4/background-remover-by-flexclip.json": "Automatic, accurate, and instant background remover tool by FlexClip! Just upload any image and the smart AI will handle the rest automatically in 5 seconds. - 1-click simplicity - Any type of images - 100% online and automatic - Free and instant downloads",
  "data/ph-top/2022/4/breaking-bad-intro-creator.json": "Breaking Bad Intro Creator lets you customize the customized opening with the texts you wish and then download it as an image or video. It automatically find the chemical elements that should be assigned for your text. Check it with your name!",
  "data/ph-top/2022/4/shamebot-by-wfhomie-1.json": "https://app.wfhomie.com/shame/ is the best way to publicly shame your co-workers over Slack. Whenever a less-liked teammate makes a mistake, asks a dull question or makes a cringy comment, using ShameBot is the easiest way to make them question their self-worth.",
  "data/ph-top/2022/4/seshhub.json": "Seshhub helps to turn your skills into an online store. One-on-one or group meetings, as well as PDF downloads can be sold or given away. Seshhub's minimalist interface includes payment processing, scheduling, video conferencing, and management.",
  "data/ph-top/2022/4/we-spots.json": "We-spots.com helps influencers, artists and creators find and book studios everywhere. Here you can rent music studios, photoshooting studios, meeting rooms, cars, pools and more. Travelling? Easily rent and access nearby studios and create.",
  "data/ph-top/2022/4/refuge-app.json": "Born during the Ukrainian crisis, Refuge is the place where humanity gets together to help those in need. Refuge provides a safer way to find help, with built-in near instant verification. The app is available in 12 languages.",
  "data/ph-top/2022/4/assista.json": "Assista will improve your productivity, track your team’s progress, and give you detailed information about your work. Say goodbye to start/stop buttons and manual time-logging. Тrack your time automatically while you focus on what matters - your work.",
  "data/ph-top/2022/4/cryptomarry.json": "CryptoMarry is a Web3 platform that rediscovers how marriages are done. Register your union on-chain and mint an NFT certificate, create your own family DAO, and manage joint crypto assets.",
  "data/ph-top/2022/4/urtots.json": "An&nbsp;anonymous dashboard&nbsp;to share your thoughts and feelings with questions to help you reflect.",
  "data/ph-top/2022/4/cartoonize-3.json": "Cartoonize could turn your face picture into a cartoon with more than 40 different cartoon effects. Powered by AI technology, it could be your best cartoon avatar maker with incredible background applied.",
  "data/ph-top/2022/4/textomap.json": "Textomap is a web app and Chrome extension that enables users to instantly generate maps from any text containing locations. Users can add maps to their reading experience and Visualize text in the same browser tab with the Chrome extension.",
  "data/ph-top/2022/4/saleshero.json": "Apply the best Sales practices advised by the experienced experts from the world-leading software companies.",
  "data/ph-top/2022/4/secondhand-dev.json": "secondhand.dev is a private platform built for developers to buy and sell electronic devices. Anonymous users are not able to see the contact information. Instead of that, only the one who has an active GitHub account can see the seller's contact information.",
  "data/ph-top/2022/4/cronotion.json": "Cronotion provides a simple way to set up repeated items for your notion databases. Cron expressions can be used if you're familiar with it, or you can easily configure a rule using easy UI elements.",
  "data/ph-top/2022/4/web3-academy.json": "An online free academy to learn about web3 and start building the future",
  "data/ph-top/2022/4/common-room.json": "Common Room is the intelligent community growth platform that helps you deepen relationships, build better products and drive business value. Discover what’s most important, nurture key personas, measure program impact and collaborate across your organization.",
  "data/ph-top/2022/4/pm-school-challenges.json": "Create your Product Management portfolio! Looking to break into Product? Solve PM School Challenges. Compete with fellow aspirants. Win a chance to interview at top startups. Signal right PM skills (wire-framing, product thinking, metrics, etc.) to employers.",
  "data/ph-top/2022/4/heyday-4.json": "Heyday’s browser extension automatically saves web pages you visit and pulls in content from your apps. Then, it uses AI to resurface that content alongside Google results, overlay it on articles, and curate it into a knowledge base that fills itself.",
  "data/ph-top/2022/4/butter-app.json": "Bring 10x the energy & be the best participant you can be, even on the go! ⠀ Named #1 Product of the Day when it http://btr.to/PH20210, Butter turns your sessions from 🙀 to 😻 with fun reactions, agenda, polls, breakouts & more. ⠀ And it's now on mobile! 🧈📲",
  "data/ph-top/2022/4/hq-sales-virtual-interviewer.json": "Spend less time interviewing and more time selling! Our sales virtual interviewers, powered by AI and curated by expert content writers, allow you to test candidates on their ability to perform critical work functions required to succeed in sales and marketing",
  "data/ph-top/2022/4/saas-marketing-stack.json": "A large library of 500+ tools to help SaaS marketers & founders to help with their overall growth efforts across channels.",
  "data/ph-top/2022/4/bright-risk-index.json": "The Bright Risk Index allows for the easiest, safest, and most diversified way to act as an “insurer” in the DeFi insurance industry while earning attractive returns. Earn 15-25% APY on a stable coin investment for covering the crypto community.",
  "data/ph-top/2022/4/bento-5.json": "Are you overwhelmed with your tasks? Introducing Bento - helping you do less, but more meaningful tasks.",
  "data/ph-top/2022/4/fitmint.json": "Fitmint is a web3 fitness and lifestyle mobile app with inbuilt NFT gaming and Social-fi elements where you can earn rewards in cryptocurrency just by working out.",
  "data/ph-top/2022/4/attractive-ai.json": "Attractive's bot Poe uses technology similar to self-driving cars to be able to navigate through a site's key functions. It does that daily to make sure everything is working, and to gain insights about interaction, design and UX. No setup, and for free.",
  "data/ph-top/2022/4/q-finder.json": "Are you an expert in your field? Q-Finder displays questions asked about your industry or company in an easy-to-use platform. With Q-Finder, you can increase your online authority and generate quality traffic by answering questions at scale.",
  "data/ph-top/2022/4/diall.json": "We're making mental health approachable. Build new skills and actually enjoy learning about your mental health like never before. Did we mention it's free to download? Get early access at diallapp.com",
  "data/ph-top/2022/4/no-code-guru.json": "No-Code Guru is a wise chatbot that will help you find the right No-Code tool to build your (web app) idea. It only takes 1 minute: 👳‍♀️ Go to No-Code Guru 🤖 Answer 4 easy questions 🚀 Start building",
  "data/ph-top/2022/4/stritch.json": "Stritch: platform with a new video format where all displayed elements are ‘detached’ from video itself — to let independently interact with materials provided in video. It enables you to search and interact with materials in video and use them when it needed.",
  "data/ph-top/2022/4/redwoodjs.json": "Redwood is an opinionated, full-stack, JavaScript/TypeScript web app framework designed to keep you moving fast as your app grows from side project to startup. With React, GraphQL, Prisma, Storybook, and Jest all integrated, you can focus on building your app!",
  "data/ph-top/2022/4/iconbay-figma-plugin.json": "Iconbay Figma plugin offers fully customized style, color, size, and stroke directly on Figma!. More icons will be added very soon! 🔥",
  "data/ph-top/2022/4/pixelied-convert.json": "Convert images in bulk without losing their quality or installing any software using Pixelied’s photo converter tool. It’s fast, free & easy-to-use!",
  "data/ph-top/2022/4/morsel-2.json": "Never lose a family recipe again. Turn old, impossible-to-read family recipe cards into an online family cookbook that you can use for generations to come."
}