{
  "data/ph-top/2022/1/token-around.json": "Intelligent. Crisp. Quick. Crypto | Metaverse | NFT | DeFi We analyze the internet, crypto trends, and social media activities algorithmically to bring you the quick summary right away every 20 minutes from 100+ publishers from the global crypto communities.",
  "data/ph-top/2022/1/dialo-2.json": "Easily design and share your digital business card via QR Code and short link. Add others' Dialo directly to your Contacts app.",
  "data/ph-top/2022/1/tin.json": "Tin is a product of TeamCode that can generate executable applications instantly without manual environment configuration.",
  "data/ph-top/2022/1/continuum.json": "Meet Continuum – The social platform owned by creatives.",
  "data/ph-top/2022/1/pika-2.json": "https://pika.rishimohan.me free and http://github.com/rishimohan/pika web app to quickly beautify your screenshots. You can add background gradients, tweak shadows, add rounded corners, tweak spacing and more. You can save the image as PNG file or copy it to clipboard.",
  "data/ph-top/2022/1/snappify.json": "snappify is a great tool to create and adjust beautiful code snippets easily. It has predefined styles for your code snapshot but also allows you to customize.",
  "data/ph-top/2022/1/harold-2-0.json": "No more updating a google spreadsheet or Notion template once and then never looking at it again. Harold is a quirky SMS bot, powered by AI that makes tracking your habits: simple 👊 convenient 🙌 & fun 🤓",
  "data/ph-top/2022/1/sherpa-travel-restrictions.json": "Sherpa is your guide to getting the right travel documentation and understanding up-to-date travel requirements. An independent resource, we are not sponsored by, affiliated with or funded by any government agency.",
  "data/ph-top/2022/1/menubarx.json": "https://menubarx.app/ is a powerful Mac menu bar browser that can pin any webpage on your menu bar just like an App. Whether it's a frequently visited website page or a website lacking native App, MenubarX can help users use it more efficiently and conveniently!",
  "data/ph-top/2022/1/open-target.json": "Everyone has some goals and expectations for the new year but it's not easy to keep yourself motivated for achieving that. Losing weight, publishing blog posts, creating passive income, or another thing. Open Target is the way to keep yourself motivated!",
  "data/ph-top/2022/1/not-boring-habits.json": "Combine the behavioral science of learning habits with a fun, beautiful game to not just track habits but to *build* them. Every day you take a step along a wondrous journey to master a positive habit or slay a bad one.",
  "data/ph-top/2022/1/pauseme-button.json": "A Bluetooth® Video and Microphone Controller (VMC) button that allows you to turn on and off your video or audio during Zoom calls with a single click.",
  "data/ph-top/2022/1/accountit-2-0.json": "Welcome to Accountit, a simple, but powerful daily transactions tracker that will definitely help you get a full picture of your finances. With Accountit, tracking and organizing all of your transactions becomes as effortless as possible.",
  "data/ph-top/2022/1/value-app.json": "A simple way to track the value of any NFT portfolio in real time.",
  "data/ph-top/2022/1/qr-code-generator-99406f64-9c12-425a-9d40-c3b8d0f18cac.json": "QR Code Generator is a powerful, simple, all-in-one QR code generator that helps drive app installs, gather feedback, promote your website, collect emails and more!",
  "data/ph-top/2022/1/huski-ai.json": "An AI-based content search engine to find usage of copyrighted content, such as trademarks, designs, or NFTs, used in the eCommerce space. Beta covers trademarks only.",
  "data/ph-top/2022/1/vanillalist.json": "Repository of handpicked best vanilla JavaScript plugins and resources to save time as a developer and create high-performance web apps.",
  "data/ph-top/2022/1/appmaker.json": "Appmaker is a no-code app builder that converts your Shopify store into a mobile app. Using the drag-n-drop app builder, store owners can now easily create and upload native apps to Appstore/Playstore. Add Appmaker to your Shopify store to give it a try.",
  "data/ph-top/2022/1/tweet100-challenge.json": "#Tweet100 is a free 100-day challenge to help you publish more on Twitter. 🛠 Built entirely with no-code 🤝 Helps you craft at least one good Tweet per day 📈 Some have grown their following by 4,000%! 🤯 Participate for free or join our community! 🚀",
  "data/ph-top/2022/1/life-tracker.json": "Life is precious, and so is your time. Get the digital journal of your activities right in your pocket! Strike the life balance to improve your focus and productivity.",
  "data/ph-top/2022/1/interviewkit.json": "InterviewKit is an all-in-one interview tool that lets you save you up to 80% of time. By lowering the time to interview, this app is an effort to make people interview more often. So we create more customer-oriented products, and a slightly better world ❤️",
  "data/ph-top/2022/1/relingo.json": "Relingo can assist you to read English articles and watch English videos quickly, based on what you are interested in. learn and remember words gradually while browsing the web without being disturbed.",
  "data/ph-top/2022/1/web3jobsboard.json": "Your source for jobs in the Web3 space from Blockchain, Crypto and Smart Contract startups to well established companies wanting to be part of the Web3 paradigm.",
  "data/ph-top/2022/1/glitch-editor-2022.json": "The biggest update ever to Glitch's editor is up to 300% faster. It offers an automatic Fastly CDN for assets, previews of 3D models, inline error reporting, better Prettier support, and one-click access to GitHub import/export + domains.",
  "data/ph-top/2022/1/kara-pure.json": "The first-ever machine that makes water from the air. And transforms it into 9.2+ pH alkaline one. Enriches it with 7 rare natural minerals. And continuously filters and purifies it with powerful UV-C light. Delivers 10 liters of clean and safe water daily.",
  "data/ph-top/2022/1/300-web3-predictions-for-2022.json": "1000s of people posted predictions for Web3 in 2022 last week. Here are the top 50 Twitter threads to get ahead on NFTs, DAOs, DeFi, P2E, BTC, ETH, L1s, L2s, etc...",
  "data/ph-top/2022/1/obsidian-flight-school.json": "🚀Obsidian Flight School is an educational product—and starter kit. It is designed to make you faster, more skilled, & more confident using the next gen note app called Obsidian. ⚡️ Fly around your notes faster than ever before...at the speed of thought",
  "data/ph-top/2022/1/unlock-7.json": "Set yourself free from billing and logistics so you can focus on building software instead of packaging, versioning, and distributing products to your customers.",
  "data/ph-top/2022/1/inboxthis.json": "Today, to save a web page or article to read later, we have to create bookmarks or use a new app (eg. Pocket) or manually email ourselves - it's painful 😰! With InboxThis, you can send any article/web page to your email inbox in just 1 click 👆.",
  "data/ph-top/2022/1/nft-inator.json": "NFT-Inator is a free toolkit to accelerate design and development of procedurally generated NFT projects. Create custom and randomised designs, test your layer combinations, and export images and metadata for Solana, Ethereum & Polygon.",
  "data/ph-top/2022/1/jini-design.json": "Beyond a directory of digital assets, it is an attempt towards learning some new technical processes to b found in my upcoming book \"Frontend Schema\". Check roadmap here: https://jini.design/?open=roadmap",
  "data/ph-top/2022/1/promoly.json": "Promoly helps creatives distribute their audio content over email and social media. With just one streamable link (Soundcloud etc.), you can turn your audio content into an attractive landing page for distribution to your email list and social network.",
  "data/ph-top/2022/1/non-nfts.json": "non-NFTs is an Open-source AI-Generated Artwork. The idea behind this project came from some hype around NFT more as a design trend rather than what it is actually. It is all open-source, so you can download all the arts for free.",
  "data/ph-top/2022/1/travel-friends.json": "Travel Friends is a simple website to connect with other travelers when you arrive in a new place. Add your pin to the map and then explore if there are other travelers nearby to connect with.",
  "data/ph-top/2022/1/salescamp-3.json": "Salescamp gives you a stunning customizable sales suite to drive growth at every stage of the sales cycle. Track all your sales activities in one place and identify the better customer for your business.",
  "data/ph-top/2022/1/pollinate.json": "You can now grow your newsletter using Twitter’s embedded signup functionality without sending it from Revue. Compatible with beehiiv, Mailchimp, MailerLite, ConvertKit, and Ghost.",
  "data/ph-top/2022/1/plask-2.json": "With Plask, anyone can digitize their movement and animate it in a matter of seconds with a webcam and browser.",
  "data/ph-top/2022/1/startup-recipes.json": "Learning lean startup is easy, putting it into practice is hard! Startup Recipes is It is a cheat sheet that helps idea-stage entrepreneurs to find product-market fit as quickly as possible by building minimum viable products right!",
  "data/ph-top/2022/1/ignition-gtm-beta.json": "Ignition helps PMM and PM teams launch more effectively, save time on planning, and create more internal alignment. It uses best practice-based workflows to predict product timelines, dynamically recommend plans, and centralize plans/tasks/assets/measurement.",
  "data/ph-top/2022/1/creator-resource-kit.json": "Creator Resource Kit is an ever-growing curated free collection of 1000+ tools and resources for Youtubers, Musicians, Photographers, Videographers, Writers, Podcasters & Gamers. Tools which help them create, distribute, manage, learn, monetize, grow & more.",
  "data/ph-top/2022/1/verifykit.json": "A new way of phone number verification that uses IM platforms as an alternative to SMS. Make use of WhatsApp and Telegram to verify your users and cut your verification costs by 80%, while supporting traditional SMS to reach every single customer out there.",
  "data/ph-top/2022/1/meritverse.json": "Meritverse is the professional network for the Metaverse. We enable you to verifiably showcase your skills and build a professional network that is incentivised to help you succeed. 🌐",
  "data/ph-top/2022/1/figma-academy.json": "Figma Academy is an all-new program that teaches advanced product design tactics with hands-on lessons that are delivered directly within Figma.",
  "data/ph-top/2022/1/shakespeare-ai-email-writer.json": "Goodbye, writer’s block. Tell SHAKEspeare about your business offering and the goal of your cold email, and it handles the writing for you. All you have to do is select the draft you like best and add it to a Mailshake campaign.",
  "data/ph-top/2022/1/showtime-gasless-nft-marketplace.json": "✦ Gasless: free minting + listing, no gas fees. You can even do free NFT drops! ✦ Instant royalties (compatible with platforms like Zora). ✦ Mint up to 10,000 editions. All for free. ✦ Eco-friendly NFTs on the 0xPolygon network. Much faster than usual.",
  "data/ph-top/2022/1/airadvisor.json": "AirAdvisor helps you verify if you are eligible for compensation for flight disruptions and works on your case for you. You may be entitled to as much as 600€ ($700) in compensation if your flight was delayed, canceled or overbooked within the last 3 years!",
  "data/ph-top/2022/1/obviously-ai-time-series.json": "We believe that time is the most incredible source of information, capturing the past, present and the future. That's why we built Obviously AI Time Series - The fastest, most precise no-code AI tool to predict business critical events down to a specific date.",
  "data/ph-top/2022/1/lohost-io.json": "Simply put, lohost is a way to serve a website to the internet from any local computer where you install the lohost website client. You keep all the files on your local computer and pick the subdomain where the website lives (https://{yourApp}.lohost.io)",
  "data/ph-top/2022/1/articlestaff-2-0.json": "ArticleStaff is a workflow system for the management of your freelance writers. It helps you to manage payouts to writers, invoicing from writers, as well as keep track of publishing dates and the progress of each article.",
  "data/ph-top/2022/1/asimov-security.json": "Robot Developers get a customizable and friendly solution they can use to apply quality gates prior to releasing robots into the wild. Operation teams get a centralized location from which they can manage the security aspects of all of their robots.",
  "data/ph-top/2022/1/certificates-by-graphy.json": "Certificates by Graphy lets you share beautiful custom certificates to all your learners at once. Pick a template, upload a CSV file, and send all certificates with a single click. Learners get a PDF and the option to add it to their LinkedIn with one click.",
  "data/ph-top/2022/1/design-gradients.json": "A free website for anyone looking for beautiful gradients for any project, curated by designers.",
  "data/ph-top/2022/1/printable-chore-chart-for-kids.json": "We created a handy set of FREE, Customisable and printable chore chart templates for kids aged 3-12 that help kids track their achievements and work towards a goal. Download our FREE Charts NOW! Find out more at https://www.ursor.com",
  "data/ph-top/2022/1/notion-resolution-board.json": "Plan and keep track of your new year resolutions in Notion.",
  "data/ph-top/2022/1/yamak.json": "Next-Gen AI-powered platform to write Content & Copy for your Blog, Social media, Website, Ads, SEO. We help humans to generate quality data with the help of AI. We save huge amount of time and human affort. Which is a very good thing to do. :)",
  "data/ph-top/2022/1/treeps.json": "Remember your life: it's a set of bright moments of your experience. Good, bad, inspiring, painful – they made us who we are. To become happier, we must create new vibrant moments by doing new things. Treeps selects it for you. Join our 700k+ community!",
  "data/ph-top/2022/1/strackify.json": "With Strackify you can create your profile and search for the book or category you are reading and see if anyone in the app community has added a playlist that matches your book and listens while reading, without leaving the app!",
  "data/ph-top/2022/1/tipsly.json": "Tipsly.io is a french toolbox with more than 100 free tools. It includes the best digital tools for Designers & Product Builder (No-Code). Each week, I add products to help you be more productive and use the best tools for your designs and websites.",
  "data/ph-top/2022/1/studio-54-nft-s.json": "Create your own customized NFTs Store. Start building your brand and your community in your domain. Every Chain, any payment method without coding and with zero cost upfront.",
  "data/ph-top/2022/1/reel-unlimited-for-slack.json": "Request unlimited graphic design tasks for your startup & collaborate faster with designers right on Slack, the app you already use all day. 👋 Request designs and collaborate in Slack 💯 First design request is free ⏰ 24 hours turnaround",
  "data/ph-top/2022/1/pomotimer.json": "Pomotimer is a pomodoro technique timer ⏲️ The purpose of this website is to help you to focus on your study, work, coding, etc. and boost your productivity 🚀",
  "data/ph-top/2022/1/phonecast-2-0.json": "Mirror iPhone/iPad to your Mac wirelessly. No need to connect iPhone/iPad to Mac with a cable. Demo what's on your iPhone/iPad in online-meeting, play games, draw live. PhoneCast 2.0 has a new rendering engine that makes it just as good as casting with cables.",
  "data/ph-top/2022/1/magic-copy-3-0.json": "Magic Copy allows you to copy text and links from your phone and paste it on your computer and vice versa! It’s a universal clipboard manager that works like magic. It's a real-time clipboard & notes app that syncs with all your devices hassle-free!",
  "data/ph-top/2022/1/graaphics.json": "Create easy, effective graphics for your social media. Choose your background, size, fonts, colors and text, and quickly export your designs, ready to post to your social media channels. Perfect for testimonials and quotes.",
  "data/ph-top/2022/1/cronly.json": "Manage your cron jobs in the cloud with built-in monitoring, or use our monitors for your local cron jobs. Implementation is just a few lines of simple code. Use our monitoring tools for your existing cron jobs or execute cron job tasks.",
  "data/ph-top/2022/1/square-qr.json": "Square QR is an online tool to generate beautiful dynamic QR codes that you can track.",
  "data/ph-top/2022/1/twitter-growth-challenge-2022.json": "Join the 2022 Twitter Growth Challenge. Build up an engaged audience, win prizes, meet new like-minded people. All for free.",
  "data/ph-top/2022/1/notrix.json": "A Simple notes app which saves all notes to browser storage locally. Users can create and delete notes for free with 100% privacy. It has awesome support for Markdown !!",
  "data/ph-top/2022/1/memento-mori-notion-calendar.json": "A digital Stoic Calendar built in Notion, around the principle of Memento Mori; remembering that you'll die. By using the calendar, you'll start living a little better by being reminded of your mortality every week as you check off another one lived.",
  "data/ph-top/2022/1/great-landing-page-copy.json": "Great Landing Page Copy is a little corner of the internet to find good landing page copywriting examples.",
  "data/ph-top/2022/1/ownvibe.json": "Ownvibe is the first marketplace where you can buy or sell items using short videos. Experience a new way of shopping with the Ownvibe short videos feed. Just swipe for new items and if you found the one you like, tap its price button to purchase it.",
  "data/ph-top/2022/1/multiclock-screensaver.json": "Free macOS screensaver that displays the time (and nifty animations) using 24 customizable clock faces",
  "data/ph-top/2022/1/glip-2.json": "Glip is a platform for live-streamers to drop NFTs, live on stream & build their NFT community. Twitch & Youtube streamers can unlock a new direct monetization channel & offer exclusive experiences to their superfans, without paying hefty platform commissions.",
  "data/ph-top/2022/1/tulr-io.json": "Tulr lets you combine Videos, Tables, Forms, and Calendars, and apply powerful automation to suit your workflows. With minimum or no help, anyone can create powerful apps such as Applicant Tracking, Email Marketing, Video Pitches, and many more.",
  "data/ph-top/2022/1/databar-ai.json": "Databar.ai is a no-code API marketplace. Connect to any data API in under 3 clicks! 🚀 No technical expertise required 🏁 Fast and easy: from landing to dataset in under 30 seconds ✅ Automated authorization, headers, and pagination",
  "data/ph-top/2022/1/mesh-y.json": "🌄 Meshy is a design tool to generate beautiful & colorful mesh gradients. Generate multiple random mesh gradients along with cool color and size customizations. Free export your gradient as PNG formats.",
  "data/ph-top/2022/1/peach-productivity-clock.json": "Productivity is a tricky beast to tame. Peach is a FREE tool that helps you track your time and what you do with it. It does so by applying some well-researched productivity techniques that pros use. Note: Use both the techniques and the tool for best results.",
  "data/ph-top/2022/1/speechly-reactive-voice-ui-api.json": "Speechly is the fast, accurate, and simple Voice Interface API. Our proprietary technology lets developers with no speech recognition or NLU experience easily add multi-modal voice UI functionalities into any digital application with just a few lines of code.",
  "data/ph-top/2022/1/droit-addons-for-elementor.json": "Droit Addons for Elementor is an easy-to-use plugin that enhances your Elementor page builder user experience with more robust & powerful widgets, elements, modules, & features.",
  "data/ph-top/2022/1/wordle.json": "A simple, free, daily game. If Mastermind and Hangman had a baby, you'd get Wordle.",
  "data/ph-top/2022/1/importify-dropshipping.json": "Importify is the leading platform for eCommerce sellers looking to import and sell Dropshipping products in their stores. It will save you time and let you focus on making more sales and managing your business.",
  "data/ph-top/2022/1/color-picker-chrome-extension.json": "A simple, light and free to use HEX color picker by AdCreative.ai team that does not collect any information from your usage or account. NOTE: We have several planned updates in the upcoming weeks.",
  "data/ph-top/2022/1/dark-habits.json": "Daily habit tracker in a google sheet.",
  "data/ph-top/2022/1/easypop.json": "With no coding, or setup hassles, you can launch on-site promotions for Shopify in under 5 minutes. Use Easypop to engage your customers, grow your audience, and increase sales.",
  "data/ph-top/2022/1/iteration-x.json": "Iteration X allows teams to annotate and edit any live website or web app directly in Chrome. No need to waste time and energy with screenshots, video calls and endless email and chat anymore. Improve any page and share the result with your team in seconds ✌️",
  "data/ph-top/2022/1/lottie-animations-by-iconscout.json": "A library of over 10,000 Lottie Animations for you to enhance your designs. Drive more engagement and improve your user experience with animations that you can use anywhere: web, app, social media, presentations, and more. Say bye to static images.",
  "data/ph-top/2022/1/amy-2.json": "Amy’s AI-powered Chrome Extension saves you days of research by providing you with information from across the web and actionable insights about every person you meet with, helping you personalize and ace all of your meetings!",
  "data/ph-top/2022/1/listener-for-zoom.json": "Bookmark important moments of your Zoom calls in real-time and easily turn long recordings into bite-sized video clips. Free while in Beta. Works with licensed (paid) Zoom accounts only.",
  "data/ph-top/2022/1/upscale-media-free-resolution-enhancing.json": "Automatically upscale image resolution up to 4x the original size without loss in quality with our AI tool 🔥 It’s free and forever will be. 🔍 Make your images automatically bigger by 2x, 4x. ✨ Remove JPEG artifacts 🤖 No pixelation or blurry details.",
  "data/ph-top/2022/1/manganum.json": "The inspirational new tab with fantastic photo and video backgrounds and ruthless motivation widgets turns your Google Chrome into a productivity machine. Clock and weather widgets are also present. Developed with love in Minsk and Tokyo 🤍❤️🤍️",
  "data/ph-top/2022/1/poeticmetric-analytics.json": "Make business decisions without compromising your visitors' privacy. No cookies or personal data collection. So you don't have to worry about cookie banners or GDPR, CCPA, and PECR.",
  "data/ph-top/2022/1/supernova-io.json": "Supernova enables you to build, manage and share design systems coherently across all disciplines, build fully customizable documentation sites with absolute ease and automate tedious delivery of design system assets to your codebases.",
  "data/ph-top/2022/1/zipmessage.json": "ZipMessage replaces live meetings with asynchronous conversations. Send and receive video and screen messages with customers or teammates. Share your personalized link to start an async conversation.",
  "data/ph-top/2022/1/vision-ui-dashboard.json": "Most trendiest, complex and innovative Chakra UI & Material Dashboards Made by Simmmple & Creative Tim. Start your Development with an Innovative Admin Template for Chakra UI or Material UI.",
  "data/ph-top/2022/1/arcade-3.json": "Showcase your products with interactive demos that can be embedded inside websites, blog posts, or tweets. ⠀ Arcades are super easy to create, embed, and maintain and fun to play!",
  "data/ph-top/2022/1/timo-2-0.json": "Put your todo list and time tracking in one place with Timo. Ditch the multi-app dance & focus on whats important. Getting your work done, and billing your clients. Track with Timo & you'll have all you need to invoice your clients or fill in your timesheets.",
  "data/ph-top/2022/1/clover-v1.json": "Clover is the digital notebook that blends notes, tasks, whiteboards, and a daily planner into one streamlined app so you can spend more time thinking and less time fussing with your tools.",
  "data/ph-top/2022/1/collx.json": "CollX (“collects”) answers the age-old question: “What’s it worth?” The app can scan any baseball, football, or basketball card and instantly ID it and get the avg market value. Then build a collection, track values, follow friends, trade, buy and sell.",
  "data/ph-top/2022/1/pointcard-titan.json": "Meet PointCard™ Titan — the card that keeps up with you. Personalized, precise, and transparent from the ground up, this new charge card allows you to choose your rewards and use points your way.",
  "data/ph-top/2022/1/alwane.json": "A web-based tool for extracting colors from a chosen website or an existing CSS code; it also regroups/orders colors and gives you, in the end, a CSS/Sass colors palette.",
  "data/ph-top/2022/1/nonfik.json": "Nonfik is a gated content library, built on discussion-worthy freebies and powered by social reading functionality like: 📚 A shareable bookshelf 💬 Notes & discussions ⭐ Expert & community reviews 🗂️ Custom collections for onboarding or educating peers",
  "data/ph-top/2022/1/sieve-29e50984-ed30-49c2-a191-543178a4f3ae.json": "Sieve is an API that helps you store, process, and automatically search video data–instantly and efficiently. Find the 1% of data that’s interesting within petabytes of raw video, tag important metadata, and build high-quality datasets with Sieve.",
  "data/ph-top/2022/1/workona-iphone-app.json": "Workona for iPhone lets you access work anytime, anywhere Easily access project tabs, docs, and links when you’re on the go. With your iPhone, you can save any webpage for later and access the tabs you have open on your desktop browser.",
  "data/ph-top/2022/1/punksvsapes.json": "The Punks vs Apes is the first on-chain puzzle game on ethereum blockchain. A collection of 9,998 of this unique interactive art and music NFTs. Every move is recorded and stored on-chain forever till the end of time. Have a look, or play it yourself :)",
  "data/ph-top/2022/1/super-design.json": "Save hours on creative research and find the best designs across thousands of screenshots updated every day.",
  "data/ph-top/2022/1/purrfect-utm-builder-by-stack-moxie.json": "The only free UTM builder for easy and error-proof URLs. Accurate UTMs lead to accurate analytics. Integrate your tech stack, use standard values and avoid the analytics hairball caused by poorly managed UTMs. It's \"purrfect\" - Uriel Trace Moxie \"U.T.M.\" Cat",
  "data/ph-top/2022/1/tiny-sketchbook-by-cloudhq.json": "Tiny Sketchbook is a simple to use app that lets you to create quick doodle art drawings. ~5 Benefits~ ✅ Visually show what you need in a sketch ✅ Create doodle sketch art ✅ Collaboration / Team bonding ✅ Classroom assignments ✅ De-stress with art therapy",
  "data/ph-top/2022/1/chaty.json": "Provide your website visitors' a frictionless customer communication by allowing customers easy access to all the platforms you’re available on improving your customers’ experience and increasing your chances of conversion or sales.",
  "data/ph-top/2022/1/dryfta-2.json": "Dryfta helps event organizers collect abstracts & reviews, sell tickets online, create interactive program schedules, host virtual meetings, and boost attendee engagement with a full-featured networking app.",
  "data/ph-top/2022/1/surfable-apps.json": "Install your favourite websites as apps to directly access them from your dock or spotlight search. This service is for free and contains more than a million installable websites!",
  "data/ph-top/2022/1/buzz-by-streambee.json": "Imagine Cameo, but for DMs. Buzz is a DMs monetization tool for Creators with support for Free and Paid DMs. Use our advanced filters to only chat with your most loyal fans. Launching today with integration to Twitch and support for Twitch Subscriptions.",
  "data/ph-top/2022/1/design-landscape-in-202x.json": "50+ insights from senior designers at Adobe, Amazon, Figma, Nasdaq, Microsoft, etc. + 12 ideas to boost your career in design in 2022–2030.",
  "data/ph-top/2022/1/growth-hacking-resources-3.json": "This curated Growth Hacking Resources list will help you grow faster by showing you the best resources to learn about growth hacking. Get Full access to 100+ Resources as an Airtable File This File Includes Resources Name, URL, Description, Image, Type",
  "data/ph-top/2022/1/nft-sales-bot.json": "NFT Sales Bot is a tool I wish existed when I launched my first 3(!) NFTs in 2021. Because when you sell an NFT, you want everyone in your community (Discord, Twitter followers, etc) to know about it. Why? Because this social proof drives even more sales.",
  "data/ph-top/2022/1/get-rich-quick.json": "Instead of devising complex ways to scam people out of money, just go to this website, select how much money you need, enter your wallet address, click a button, and get that money. No hassle, quick, easy, simple, free. Enjoy!",
  "data/ph-top/2022/1/tipybit.json": "Receive support from your audience in Bitcoin. Thanks to the Lightning Network, anyone can send you as little as $1 instantly. They can leave a message or just tip anonymously. Open to the entire world without restrictions.",
  "data/ph-top/2022/1/clay-css.json": "Micro CSS util class for applying inflated fluffy 3D claymorphism styles to HTML elements. Fully customizable and extensible with CSS variables. SASS mixin is also included for even more styling options.",
  "data/ph-top/2022/1/medusa-express.json": "🔥 One-page checkout flow ⭐️ Sell directly through automatically generated product links ⚡️ Open-source allowing you to add your own touch 🎉 Get up and running in minutes 🛠 Built with Next.js",
  "data/ph-top/2022/1/lusha-prospecting-platform.json": "Lusha Prospecting Platform is the simplest and most accurate way to sort and reach your dream prospects. Cut prospecting time with laser-targeted lists and connect with decision-makers faster to create more revenue opportunities.",
  "data/ph-top/2022/1/heybooster-2-0.json": "heybooster analyzes data across all your marketing channels and delivers actionable insights for optimizing your marketing strategy. It reports by highlighting problem areas and prioritizing them.",
  "data/ph-top/2022/1/mailercloud.json": "Mailercloud is a cloud-based email marketing tool, enriched with great features, which help users to build strong relationships with their audience. It is ideal for those who wish to improve engagement rate and conversions.",
  "data/ph-top/2022/1/plum-lite.json": "Plum Lite is a simple way for a small team in India to get started with health benefits. It includes health insurance, unlimited doctor teleconsultations, wellness sessions, discounted medicines and checkups, and exceptional customer support. Paid monthly.",
  "data/ph-top/2022/1/akiflow-3-0.json": "With Akiflow you can: ✔️ Import your tasks from your tools in a single inbox 📅 Block time for your tasks in the calendar ⚡ Use Shortcuts and the Command Bar to create tasks/events 🔔 Get alerts before your meetings and join with one click And much more",
  "data/ph-top/2022/1/free-bio-link-page-by-sendpulse.json": "Create a bio link page for your Instagram, Twitter, or YouTube profile 🔗 ✅ list your social profiles and contact info ✅ get mailing list and chatbot subscribers ✅ showcase and sell your products One bio link page is FREE, a Premium plan is just $13/year",
  "data/ph-top/2022/1/karma-by-goodera.json": "Karma, is a Zoom App powered by Goodera which helps teams to do good, feel good during their Zoom meetings. Attendees can take simple actions together to support a cause they care about supported by nonprofit partners across 100+ countries, in just 10 minutes!",
  "data/ph-top/2022/1/thousand-faces-club.json": "Thousand faces club&nbsp;is a community for creators to find peers, seek mentorship and discover best practices. We empower young creators&nbsp;to make their road to success more delightful and less lonely.",
  "data/ph-top/2022/1/notion-themes.json": "Notion Themes is an open-source web extension to apply custom themes to Notion, Install Notion Themes and change the overall look and feel of Notion. Select from 10+ different dark/light color schemes. Works on Chrome/ Brave/ Firefox/ Opera/ Egde browsers.",
  "data/ph-top/2022/1/hdr-plus-2-0.json": "Capture HDR Photos like a pro or the easy way Auto mode: capture HDR photos using artificial intelligence to choose the best EVs. Manual mode: adjust ISO and exposure time for each area in the scene. Discover more great features in the app",
  "data/ph-top/2022/1/people-also-search-for.json": "A free tool that uses Google's data and search results to help you find keywords your audience is (also) searching for.",
  "data/ph-top/2022/1/productlane.json": "Complement Linear with feedback management, customer segmentation, a public roadmap, and an automatically generated changelog. In the same look and feel, with CMD+K, shortcuts, dark mode, real-time sync, 100ms rule, you name it!",
  "data/ph-top/2022/1/dropshare-5.json": "Upload screen shots, screen recordings, files, literally anything and share it immediately with anyone by link. Dropshare is your go-to file sharing tool on macOS and iOS that works with almost any popular storage provider and self-hosted solutions.",
  "data/ph-top/2022/1/the-kool-aid-factory.json": "Getting company culture right takes work. The Kool-Aid Factory is Silicon Valley's shared playbook for getting there, your way.",
  "data/ph-top/2022/1/retroteam.json": "Throw away the post-it notes and take your Retrospectives online with RetroTeam's beautiful, privacy-first platform - complete with features like time-boxing, presets and custom retro formats",
  "data/ph-top/2022/1/grainients.json": "Over 2000+ high resolution, grainy gradients to elevate your designs. Explore a huge range of grainy gradients combining 3 different grain effects, 18 bi-colour and tri-colour gradient combinations, and 16 gradient layout variations.",
  "data/ph-top/2022/1/popwork.json": "Popwork is the app that helps managers and teams work better together. Take your team management to the next level and: 💬 Drive great 1-to-1 meetings 🌈 Visualize your team’s mood & workload 💁 Share instant feedback ✅ Follow up week on week 🎯 Track OKRs",
  "data/ph-top/2022/1/draw-your-nft.json": "Now draw and mint yourself a funky NFT 🖼",
  "data/ph-top/2022/1/token-master.json": "Token Master is a plugin for Figma that automates your color design tokens. With Token Master, you can edit styles in design tokens and quickly create new color modes. Just pick tokens with the same color and edit them at once!",
  "data/ph-top/2022/1/copywriting-examples.json": "330+ hand picked copywriting examples by Harry Dry, creator of Marketing Examples.",
  "data/ph-top/2022/1/creator-economy-buzz.json": "Each week on Creator Economy Buzz, we handpick the most important articles, videos, blogs and tweets from creators, investors and thought leaders in the space. Our summarised highlights + insights are the easiest way for creators to catch up on what matters.",
  "data/ph-top/2022/1/what-is-an-indie-maker.json": "😒 Are you tired of explaining to your relatives what an indie maker is? 💡 Next time, send them this website!",
  "data/ph-top/2022/1/community-tools-index-by-orbit-2.json": "We surveyed community builders about the tools they use daily and mapped the results into the Community Tools Index. With 300+ tools across 18 categories, you can discover new, useful software that helps you make community happen.",
  "data/ph-top/2022/1/snippet-3.json": "a macOS quick link finder inspired by https://uiw.tf get the https://testflight.apple.com/join/RTRJrZYM building this to remember all sorts of cool links and to hit my routines each day let me know on twitter what you'd like to see next!",
  "data/ph-top/2022/1/crater-invoice.json": "Crater is a more intuitive invoicing solution for the next generation of developers, SMBs and Enterprises who like to use a product that is being made for the Web 3.0.",
  "data/ph-top/2022/1/dopplertask.json": "DopplerTask is a revolutionary open-source software that allows you to easily automate tasks. Whether it’s a bunch of bash scripts or just starting your car remotely, you can automate it. Build, run, reuse and share automations with anyone around the globe.",
  "data/ph-top/2022/1/pigeonfiles.json": "Create simple upload pages that other people can use to send files directly to your Google Drive. No limit on the size of uploaded files. Full security and privacy of your files.",
  "data/ph-top/2022/1/celebrate.json": "Click a button, a bunch of confetti flies and everyone cheers. This is a way to celebrate your wins.",
  "data/ph-top/2022/1/cash-app-taxes.json": "Cash App Taxes (formerly Credit Karma Tax) is a fast, easy, 100% free way to file your federal and state taxes. Millions of people have trusted our service to file their taxes for free, and customers rated it 4.8 out of 5 stars.",
  "data/ph-top/2022/1/notion-investment-dashboard.json": "What's included in the dashboard: ✔️ Instant and automatic analytics after trade entry ✔️ Guide for live stock prices & market widgets ✔️&nbsp; Research terminal with templates for researching new equity and crypto trades",
  "data/ph-top/2022/1/nameible.json": "Nameible is a tool that helps you create names for your businesses, startups, and side projects. Simply add your keywords, choose prefixes or suffixes, then pick your favorite name from the list combinations. Easy!",
  "data/ph-top/2022/1/scenify.json": "Open source image and video editor. Supports dynamic elements which can be provided at build time.",
  "data/ph-top/2022/1/mailet.json": "Mailet is a platform that generates temporary email addresses that expire after one hour. You can sign up to websites, social media, and read the incoming emails from our UI or API. It can also help you to avoid spam and increase your security.",
  "data/ph-top/2022/1/reslant.json": "Delight your customers with discussion boards where they can ask questions, give feedback, get updates, vote on features, and way more. It takes a minute to setup and are great for communities of any size. Sign up, create a board, and start posting!",
  "data/ph-top/2022/1/airpods-fit-test.json": "This is a tool that predicts which Airpods will fit you the best according to your ear shape & size.",
  "data/ph-top/2022/1/devkit-4.json": "Boost your productivity and save yourself from suspicious and ad-riddled websites with DevKit, a toolkit with lots of tools for everyday developer needs. Lots more to come in the upcoming months!",
  "data/ph-top/2022/1/panostory.json": "Easily turn your Pano's into an Instagram or Snap-ready story PanoStory converts any iOS Panorama into a story-ready video Easily create a PanoStory in three easy steps. 1. Select a panorama, 2. Convert into a vertical video 3. Share on your Instagram account!",
  "data/ph-top/2022/1/seshy.json": "Rather than having one Chrome window with lots of tabs its better to have many Chrome windows with only a few tabs each. Each Chrome window can represent one task that you are working on and have only the tabs needed for that task. Seshy helps you with this!",
  "data/ph-top/2022/1/mentorium.json": "Find a great mentor who will help you grow personally and professionally. One meeting can change the world for you, don't waste such a chance.",
  "data/ph-top/2022/1/harmonic-analyzer.json": "Based on groundbreaking research by Bytedance, Harmonic Analyzer uses a machine learning model trained by ingesting over 200 hours of solo piano recordings to accurately transcribe the notes in a piano performance.",
  "data/ph-top/2022/1/bluesky-timer-for-zoom.json": "Having trouble keeping track of time in your Zoom meetings? We'll help keep you on schedule ⏱. BlueSky Timer provides clocks, agenda timers, simple countdowns, attendance, and participation trackers, available directly in your Zoom meetings & webinars!",
  "data/ph-top/2022/1/designsync.json": "DesignSync.js is a Next.js template that instantly imports any Webflow site into your Next.js project. With DesignSync.js, you don't have to be a design expert to build beautiful Next.js sites. Skip weeks of frontend development time on every project.",
  "data/ph-top/2022/1/ccclaymoji.json": "A fun little tool to make emojis that have a fun 3D-like effect.",
  "data/ph-top/2022/1/locket-widget.json": "Locket is a widget that shows you live pictures from your friends, right on your Home Screen. It’s like a portal to the people you care about — a little glimpse at what they’re up to throughout the day.",
  "data/ph-top/2022/1/sealaunch.json": "SeaLaunch 🌊 🚀 is a discovery platform for upcoming NFTs pre-sales and drops Our goal is to help NFT projects get eyes on their launches while getting all the info a collector needs before minting an NFT.",
  "data/ph-top/2022/1/pachino.json": "Yet another Pomodoro Technique timer which under development. - Nice Zen mode. - Rich assortment of background sounds. - Build with SwiftUI, cross macOS and iOS. watchOS and tvOS is on the way.",
  "data/ph-top/2022/1/socialscribe.json": "Socialscribe creates a 'Subscribe w/ Twitter' button for your newsletter's landing page. These buttons effortlessly boost your conversions by up to 50% (!) especially for people on mobile devices. For a demo, check out: https://scribe.deta.dev/bomh",
  "data/ph-top/2022/1/wproject.json": "wProject is a beautiful and informative project management system built on WordPress.",
  "data/ph-top/2022/1/homies-2.json": "Growing 3D scene constructor with characters, backgrounds, and objects for outstanding design projects. Present your brilliant idea with bright colors and smooth textures on a website or enrich your mobile app. Compatible with Blender, Figma.",
  "data/ph-top/2022/1/flat-icons-2-0.json": "Flat Icons Lifetime Bundle 2.0 offers 27,900 unique, customizable icons. ✔ One-time purchase – free lifetime updates ✔ Web App, and Figma & Adobe XD plugins (more to come) ✔ Icons in AI, EPS, SVG, PDF, PNG & IconJar ✔ 67% off for PH to celebrate the launch",
  "data/ph-top/2022/1/seo-checker-io.json": "SEO-Checker.io helps you to monitor and optimize your SEO efforts over time. We can provide unparalleled insight about how to improve your website real estate and increase traffic and conversions with an easy to digest audit report making your life easier.",
  "data/ph-top/2022/1/nooble-1.json": "Nooble is a social audio community app! (Reddit for Audio) Join audio communities of your interests, called “Stations”, - tech, crypto, startups, etc. and consume audio shorts. Create by simply answering a question received from your friends/network.",
  "data/ph-top/2022/1/shottr.json": "Shottr is a small, fast, human-sized screenshot app built for those who care about pixels. It was crafted with Swift, optimized for M1, and is completely free at the moment.",
  "data/ph-top/2022/1/othership.json": "Othership offers 500+ music-driven guided breathwork classes to lift you up and ground you down: kickstart your day, cultivate focus, fight fatigue, sleep deeper, regulate your emotions, and learn the science-backed how + why of breathing mechanics.",
  "data/ph-top/2022/1/loopcv.json": "Loopcv is the #1st platform that fully automates the job search. Upload your resume (CV), define your job search parameters (job title, location and extra filters) and automate the process of applying to new jobs every day (zero effort required) Start today 🔥",
  "data/ph-top/2022/1/videodeck.json": "We’re your dedicated team of highly experienced videographers, marketers, and actors, ready to help you ace the video marketing game, from idea to completion. 200% hassle-free, of course.",
  "data/ph-top/2022/1/joon-for-kids.json": "Joon is a mixed reality mobile game for teaching kids life skills. It's like Pokemon meets Club Penguin, but where kids only level up and unlock new things if they complete their parent-assigned tasks or practice positive habits in real life.",
  "data/ph-top/2022/1/notifo.json": "Notifo is an Open Source notification server for all channels. It handles the reliable delivery of notifications through emails, mobile push, web push, sms, messaging and APIs. A web plugin can be embedded to your website.",
  "data/ph-top/2022/1/paisarocket.json": "PaisaRocket provides instant cross-border payments and invoicing tools for Indians Remote workers like freelancers, creators to help them get paid faster from anywhere in the world. We leverage crypto for faster and less expensive payments.",
  "data/ph-top/2022/1/assetdash.json": "AssetDash is the all-in-one portfolio tracker for investors. Connect your accounts and track all your stocks, cryptos, NFTs, DeFi, and private equity in real-time. AssetDash supports over 100+ platforms, crypto wallets, blockchains, and exchanges.",
  "data/ph-top/2022/1/simplified-design.json": "Get all your marketing done without switching tabs with the first ever AI-powered creative assistant. With Simplified you can design and scale high-volume marketing campaigns with your team at lightning speed— all in the same place.",
  "data/ph-top/2022/1/unicorn-hunt-2.json": "Play this Duck Hunt spoof and RT our launch tweet (shorturl.at/zFLR2) For a $10k prize in Spacecadet, the Marketing VC. Our fund follows a 1st year of $5.9M into 37 startups - alongside top investors from a16z to USV. Join the crew!",
  "data/ph-top/2022/1/wizishop.json": "🚀&nbsp;A no-code online store builder with superior SEO tools 💥 An all-in-one solution with over 400+ integrated features. No additional plugins needed! 👩‍🏫 Continuous online education and a team of expert Business Coaches to help you on your new adventure!",
  "data/ph-top/2022/1/savvycal-for-stripe.json": "Connect your Stripe account to collect payments right from your SavvyCal scheduling links. The Stripe integration is a SavvyCal Premium plan feature. The first 20 can use the code PHSTRIPE to get the Premium plan for the price of Basic for 3 months.",
  "data/ph-top/2022/1/elastic-metal.json": "Bare Metal shouldn't be a 2nd class citizen in the cloud. Introducing Elastic Metal - the reliability of Bare Metal with the elasticity of the cloud: ✔ 0.083€/hr or 29.99€/month ✔ Powerful dedicated machines ✔ Integration into our complete cloud ecosystem",
  "data/ph-top/2022/1/socialbook-video-background-remover.json": "Nothing new, just better :-)",
  "data/ph-top/2022/1/drawkit-3d-builder-figma-plugin.json": "Build beautiful designs: with the DrawKit 3D Builder you can easily mix and match 3D illustrations and icons, and drop them into your Figma file ✏️ - 6 Categories: Social Media, Crypto, sparks & more - 400+ images - Each pack comes with color variations 🌈",
  "data/ph-top/2022/1/wingman-mobile-app.json": "Wingman, an AI-powered revenue accelerator for sales, is now on mobile. Your sales conversations, coaching feedback and upcoming meetings — all at your fingertips. So you can play, learn and coach on the go.",
  "data/ph-top/2022/1/gostartup.json": "GoStartup is an all-in-one workspace that combines chats & channels, team calendar, and task management. Designed to be affordable for startups specifically, it's an all-inclusive tool that you can encrypt, integrate, and afford. The ultimate startup OS.",
  "data/ph-top/2022/1/illegal-analytics-scanner.json": "On Jan 13, 2022 the Austrian Data Protection Authority ruled that Google Analytics is illegal. After the Schrems II ruling, websites can no longer transfer EU visitor data to US or US controlled servers. See if your own analytics are breaking the law!",
  "data/ph-top/2022/1/project-management-templates.json": "Work smarter with free project management templates from pro project leaders and https://www.getguru.com/template/customer-service documenting any type of project. We've got templates for creating https://www.getguru.com/template/team-meetings, managing https://www.getguru.com/template/project-management, aligning https://www.getguru.com/template/product-management, and more. A lot more.",
  "data/ph-top/2022/1/the-2022-guide-to-productivity.json": "Our free 3-week email course will show you exactly how to set up processes to streamline your work using ClickUp and Minerva to: 🥇 Set up a personalized workspace. 🖊️ Create templates for your tasks. 📈 Delegate tasks to your team.",
  "data/ph-top/2022/1/the-happiness-bar-gratitude-journal-22.json": "Use Notion to build your beautiful dream bullet/gratitude journal. Join 342+ journalers crafting intentional journal experiences with editable Daily/Weekly/Monthly/Quarterly planner prompts & holistically reporting on sleep, mood, adventures, tips & more",
  "data/ph-top/2022/1/the-doge-nft.json": "The Doge NFT is the original photograph that inspired the most famous meme in the world. It was purchased from Kabosu's owner in Japan and fractionalized into $DOG token in order to bring the doge back to the people.",
  "data/ph-top/2022/1/dakiya.json": "Using dakiya you can send messages to anyone with a wallet address, without having to create an account or relying on email servers. The messages are encrypted using the public keys of the recipient. It costs gas to send a message - so important messages only!",
  "data/ph-top/2022/1/framer-sites-beta.json": "🔥 Design real websites right on the canvas. Publish in seconds. All with blazing fast performance. We’re shipping a new version of Framer, and we would love your help. Learn more at https://bit.ly/framer-beta",
  "data/ph-top/2022/1/uteach.json": "Uteach is an all-in-one platform for starting a teaching business within minutes. With Uteach users can enjoy the benefits of live and recorded webinars, automated test assessments, e-schedules, group classes at their own website, have a mobile app, and more.",
  "data/ph-top/2022/1/dubverse.json": "Dubverse enables the content creators to dub the video from one language to another, in real-time for half the cost using Deep Learning and AI. We have launched with a mission to take every video multi-lingual on the internet 🚀",
  "data/ph-top/2022/1/mailazy.json": "Mailazy is a powerful transactional email system built for developers to ensure inbox delivery of your emails. Quickly Integrate and deliver your emails to customers’ inboxes with global infrastructure and industry expertise you can rely on.",
  "data/ph-top/2022/1/smartsuite.json": "SmartSuite provides a collaborative Work Management platform that enables teams to plan, track and manage workflows - whether it be a project, an ongoing process or routine everyday tasks. Available in 15 languages and pricing starts at $10 per user.",
  "data/ph-top/2022/1/the-optimal-path-podcast.json": "The Optimal Path is a podcast about product decision-making, brought to you by Maze. Join Ash Oliver as he speaks with subject experts to uncover the experiences that shaped key decisions—in projects, products, and personal journeys.",
  "data/ph-top/2022/1/minimal-theme-for-twitter-4-0.json": "Minimal Theme for Twitter adds an opinionated base layer of styles to clean up the Twitter UI. It also provides extra customization on top to allow you to personalize your Twitter experience. - Control Feed Width - Control Navigation - Zen Mode..and more!",
  "data/ph-top/2022/1/prepaid-ai-content-by-contentbot.json": "Get your Prepaid AI writer and high-quality AI content that you pay for as and when you need it. Use the world's most advanced AI to write for you. Blog content, landing pages, ad copy, and so much more.",
  "data/ph-top/2022/1/creator-economy-pitch-decks.json": "There are very few resources for entrepreneurs that want to be part of the creator economy. So I decided to build the largest database of pitch decks that helped creator startups raise $247M.",
  "data/ph-top/2022/1/webcode-run.json": "Simplify project operations by bundling the documentation, code (frontend + back), monitoring and operations into simple web notebooks that are trivial to pickup an understand at a glance. WEBCode is focussed on the developer experience and ease of operations.",
  "data/ph-top/2022/1/instacap.json": "Share annotations and visual comments on any web page, image or pdf in one click. You can discuss asynchronously directly on top of PDFs & screen captures via a link. No meetings or logins required⚡️",
  "data/ph-top/2022/1/tootshot.json": "Generate screenshots of your Mastodon posts, with customization options: size, padding, gradient and dark mode. Copy or download your toot as image.",
  "data/ph-top/2022/1/pepper-9.json": "Train anywhere and anytime with your Electronic Muscle Stimulation suit by PEPPER. Choose from a constantly evolving library of tailored EMS workout videos and adjust the intensity of all electrodes individually during the workout.",
  "data/ph-top/2022/1/vimeomate.json": "Vimeomate is a free Vimeo video downloader extension for Chrome and Edge, which can easily download Vimeo high-quality videos.",
  "data/ph-top/2022/1/state-of-email-2022.json": "State of Email 2022 contains insights from 250+ experts & data-based analysis to help marketers improve email conversion. 💡Email marketing trends in 2022 ✅Top 5 email mistakes of 2021 with solutions 💌Actionable tips from email & deliverability experts",
  "data/ph-top/2022/1/memedb-2.json": "MemeDB is an attempt to democratise meme creation by cataloging popular meme templates by emotion instead of its actual name to enable everyone to create memes Made with Softr",
  "data/ph-top/2022/1/truesource.json": "TrueSource is a no-code platform to build and launch intelligent data products and monetize them. We allow creators and businesses to build data-centric apps like Crunchbase or IMDb in 5 minutes. Sign up and building for free!",
  "data/ph-top/2022/1/content-ai-by-rank-math-seo.json": "Take the guesswork out of how many words to write, what keywords/phrases to use, FAQs to answer & more. Model content around search intent with insights tailored to your site and content currently ranking with the help of A.I. (Artificial Intelligence).",
  "data/ph-top/2022/1/desklog-io-2.json": "Desklog is a productivity optimization tool that helps to motivate employees to be more productive. It has more features like App/URL tracking, automated screenshots, attendance, shift management and an integrated project management software.",
  "data/ph-top/2022/1/adsius.json": "The marketing platform that helps you create ads on the main internet platforms just in a few minutes and no marketing skills need. Create Ads in Facebook and Instagram EASY. More channels available very soon!",
  "data/ph-top/2022/1/micro-saas-ideas.json": "Newsletter for techies and marketers looking for their next profitable Micro SaaS idea. Weekly newsletter on profitable Micro SaaS niches with data-backed analysis and a guide on how to implement each idea. Save hundreds of hours on researching for best idea",
  "data/ph-top/2022/1/fable-677715a5-cf1d-49ee-bd6d-f71353a075ec.json": "Collaborate on PRDs, then push a button to sync with issue trackers like Jira & Linear. Fable will create tickets and keep the PRD fresh with updates. No more copy + pasting, no more stale PRD! Oh, and Fable brings decisions from Slack & docs into 1 place.",
  "data/ph-top/2022/1/react-file-upload.json": "An open-source, plug-and-play File Picker that connects to many cloud storage APIs like Box, Dropbox, Google Drive, OneDrive, Sharepoint and offers easy file uploads and downloads between your app and any cloud storage service.",
  "data/ph-top/2022/1/game-of-codes-fantasy-maps.json": "Using real data, such as NPM downloads, stars on GitHub, or website traffic, I visualized technologies as countries. The methodology is described in detail for two separate maps for: - Front-end Frameworks - CSS libraries Backend & more are COMING SOON!",
  "data/ph-top/2022/1/found-dev-2-0.json": "Found.dev is a job board aggregator for developers. We search daily dozens of sites to find and link the best jobs for developers out there! Furthermore, every person can manually submit any job entirely for free.",
  "data/ph-top/2022/1/mui-library.json": "Design with MUI library in UXPin – use over 90 interactive React components. Prototype in minutes and have devs just copy the ready code to build the products faster.✨",
  "data/ph-top/2022/1/range-goals.json": "Help your team make daily progress on the goals that matter most. Easily add goal updates to async check-ins and live meetings. Use hashtags to link team goals to work items from tools like Asana and GitHub. Update the status of any goal directly from Slack.",
  "data/ph-top/2022/1/proflow.json": "Proflow is a free, weekly newsletter curating the latest Webflow development jobs and projects.",
  "data/ph-top/2022/1/airbuddy-2-5.json": "With AirBuddy, you can simply open your AirPods case next to your Mac and see the current status right away, just like how it works on your iPhone or iPad. With just a click you’ll be instantly connected and playing your Mac's audio through your AirPods.",
  "data/ph-top/2022/1/peak-culture-dashboard.json": "FREE Chrome Extension That Helps You Reach Your Peak - Mentally and Physically. Turn your Chrome New Tab page into a comprehensive tool. It was created by a group of people on a constant quest to find ways to do things better and be more efficient every day.",
  "data/ph-top/2022/1/samelogic-2.json": "Get the evidence you need to launch successful new products and features using Painted Door Experiments and Microsurveys.",
  "data/ph-top/2022/1/platforms-starter-kit.json": "Today, we are excited to launch the Platforms Starter Kit — a comprehensive template for building the fastest multi-tenant applications with built-in custom domains support. View the demo and deploy your own.",
  "data/ph-top/2022/1/autumn8.json": "Autumn8 improves the productivity of AI Engineering teams by automating and simplifying the deployment process. We offer a platform that optimizes and automates the deployment of trained AI models in the cloud.",
  "data/ph-top/2022/1/no-code-tools-library.json": "The most comprehensive catalog of No-Code tools for: - Building web and mobile apps, - Marketing, - Data, - Automations, - Integrations, - AI, - Ecommerce, and more!",
  "data/ph-top/2022/1/wikitrivia.json": "A straightforward game based on Wikipedia requires you to sort historical events on a timeline.",
  "data/ph-top/2022/1/mysuper-fan-3.json": "As a YouTube creator, understanding your superfans is the first step to creating better content. With the SuperFan app you can create a leaderboard of your superfans; and do a deep dive into your superfan's engagement across your content.",
  "data/ph-top/2022/1/ticksy-2.json": "Finance Twitter 💸 is ever growing and cashtags are frequently used to talk about stocks. 🚀 We created this extension because we want to make the experience of using stock cashtags on Twitter much richer! 💰",
  "data/ph-top/2022/1/embed-notion.json": "Embed Notion is a simple generator to create Notion embed snippets. Easily embed Notion on your website in seconds.",
  "data/ph-top/2022/1/shapefest-2.json": "A massive library of 3D shapes for everything!",
  "data/ph-top/2022/1/pestle-kitchen-companion.json": "Pestle helps you take just the important bits from the recipes you love. Forget the 3 page story and focus on what matters, the ingredients, and the steps. Scale recipes up and down, convert units, start unlimited timers, and a lot more!",
  "data/ph-top/2022/1/free-form-templates-by-blocksurvey.json": "A collection of visually appealing online forms and survey templates that are ready to be used with BlockSurvey.",
  "data/ph-top/2022/1/nft-floor-finder.json": "The easiest way to explore floor pricing and floor depth by traits for your favorite NFT collections. Check out the \"Fan Favorite\" section to explore the most popular traits for a given collection.",
  "data/ph-top/2022/1/better-copy.json": "A simple app that scrapes all text from any given URL and checks it against a list of words that you should avoid using on your landing page.",
  "data/ph-top/2022/1/illustrations.json": "Beautiful Free & Premium Illustrations for Download. You can customise Primary & Secondary colour as per your requirement and download as SVG or PNG quickly. If you don't find any illustration as per your need then contact us and we will create it for you.",
  "data/ph-top/2022/1/twitter-nft-avatar-maker.json": "Create a transparent hex NFT Twitter avatar and use it as your Twitter profile picture! You can upload an image or connect your Twitter account to let our bots fetch your current Twitter profile picture.",
  "data/ph-top/2022/1/ecommerce-os-by-contlo.json": "A Notion collection of all the community curated resources one would need to plan, start & launch or scale an Ecommerce business - be it twitter threads, books, apps, influencers, agencies etc that you need in quest of building an ecommerce or D2C business",
  "data/ph-top/2022/1/zero-code-club.json": "Launch your side project in 4 weeks. Go from concept to launching your revenue generating product through this step by step guided platform where we you will progress from ideation to building and launching products using no-code tools for free.",
  "data/ph-top/2022/1/shortpixel-adaptive-images.json": "An easy to use plugin that's here to help you solve your website’s image-related problems within minutes.",
  "data/ph-top/2022/1/vault3-1.json": "A decentralized vault to store our digital belongings such as Passwords, Images and Files and much more!",
  "data/ph-top/2022/1/groovifi.json": "Groovifi is a playlist generator that allows Spotify users to create playlists according to very specific and fine-tuned criteria such as mood, genre, BPM, years, artist type, and even musical key and tempo!",
  "data/ph-top/2022/1/inkspired-2.json": "A social storytelling platform for creators, authors, and readers. Read and write stories, book series, and novels, while interactive in an engaged community of more than 1m. Available in English, Spanish, Portuguese, French, German, Turkish, and Russian.",
  "data/ph-top/2022/1/wagmipedia.json": "Getting started with web3 can be overwhelming. We’ve got everything mapped out for designers, developers, and business folks.",
  "data/ph-top/2022/1/firefiles.json": "Firefiles is an app which provides you with a drive like interface for your firebase storage buckets. You can download, upload and manage your files and folders easily within the app. Firefiles is 100% secure and your files stay with you.",
  "data/ph-top/2022/1/how-big-is-the-baby.json": "Visualizing the size of the baby during pregnancy can be difficult when all you can see is a growing belly. \"How big is the baby\" is an SMS bot that helps expecting parents visualize the size of the baby with daily fun visual text messages.",
  "data/ph-top/2022/1/soketi.json": "Your simple, fast, and resilient open-source WS server. 📣 > Blazing fast speed ⚡ > Cheaper than most competitors 🤑 > Easy to use 👶 > Pusher Protocol v7 📡 > App-based access 🔐 > Production-ready! 🤖 > Built-in monitoring 📈",
  "data/ph-top/2022/1/mooze-2.json": "Mooze allows you to personalize your video calls with custom overlays, immersive presentations & reactions. Create an impression that people remember. ⚡️",
  "data/ph-top/2022/1/big-news.json": "Big News seamlessly combines different sources from across the web – like newsletters and RSS feeds – into one unified reading experience.",
  "data/ph-top/2022/1/daedalos.json": "daedalOS is a recreation of the desktop environment experience on the web. https://dustinbrett.com/",
  "data/ph-top/2022/1/eminer-2.json": "eMiner is a Google Chrome extension that automates the process of searching and capturing leads through search engines to find people's contacts.",
  "data/ph-top/2022/1/branding-kit.json": "Want to get better about branding? The Notion Branding Kit contains tools, templates, and step-by-step instructions to help you build the brand of your dreams ―on Notion.",
  "data/ph-top/2022/1/pallo.json": "The all in one financial platform. Manage all of your business and personal finances accounting and tax with Pallo. Expenses, Invoices, receipts, clients, mileage tracking, time tracking, financial insights, budgeting, transfers, payments, accounting and tax.",
  "data/ph-top/2022/1/suprememinds.json": "Suprememinds is product hunt for discovering live sessions, AMA and courses in tech. Users can go live within minutes, record sessions, build a following of 100 true fans using access to an existing community, attend expert live sessions, and more.",
  "data/ph-top/2022/1/habitate.json": "Habitate provides you a discussion forum, a community calendar for all your events, and a C Drive to create folders, upload files, and share with your members. All of it, happening on your website.",
  "data/ph-top/2022/1/automator-for-figma.json": "Automator is a plugin or Figma that lets you create custom drag and drop automations that do time-sensitive Figma tasks for you in one click. Choose from over 100 actions that expose the power of the Figma Plugin API at your fingertips.",
  "data/ph-top/2022/1/mockrocket.json": "Show off your app with jaw-dropping 3D device mockups and animated product videos. Right from your browser. No experience required.",
  "data/ph-top/2022/1/humans-3d-characters-v3-0.json": "Humans 3d characters (v3.0) - is a huge library of stylish 3d characters in different poses for design projects.",
  "data/ph-top/2022/1/notion-avatar.json": "Get your personalised Avatar I will be creating a Notion styled profile picture in Black&White for you to use as your own social media profile picture, placed on your website or for your Notion dashboard. File formats: PNG, JPEG Delivery time: 24-48 hours",
  "data/ph-top/2022/1/superdense.json": "No text, just icons. 🤩 The most compact bookmark manager for all your browsers and devices. All your favorite sites just 1 click away. 🚀",
  "data/ph-top/2022/1/fundamentals-of-creating-a-great-ui-ux.json": "\"Fundamentals of Creating a Great UI/UX\" by Creative Tim will show you how to Design & Use all the UI/UX design components for your Web Pages & Mobile Apps. 🌟 It is based on Creative Tim's 8 years of experience.",
  "data/ph-top/2022/1/raport.json": "Gain deeper insight into your data in less time 📊 Integrate your data from multiple sources 📩 Receive daily, weekly and monthly performance reports via email 🔔 Get notified about anomalies in your data 😊 Onboard fast and easy",
  "data/ph-top/2022/1/tip-jar-by-swapstack.json": "The Tip Jar by Swapstack enables newsletter writers to collect tips from their readers, for free. Connect with your readers in a new way & diversify your income! 🛠 A shareable Tip Jar page. 💰 Accept donations via Stripe ❤️ Feel love from your supporters!",
  "data/ph-top/2022/1/youtube-video-download-api.json": "Download and convert youtube videos into MP4, MP3, M4A. Get various video qualities such as 144p, 360p, and 720p. Using this API you can download videos with or without audio.",
  "data/ph-top/2022/1/cloudpouch.json": "CloudPouch is a desktop application to analyze and reduce AWS costs. Use clickable charts & automated insights to instantly find waste! Your billing data is not shared with anyone (even us)! Supports multiple AWS accounts.",
  "data/ph-top/2022/1/blackbox-911a10da-59fa-49b1-96ff-f944f07f4c7b.json": "The fastest way to select and copy text from anything. Ever. It's a pretty crazy idea, we know. But you'll be amazed at what you can do with BLACKBOX. Use the best text recognition app.",
  "data/ph-top/2022/1/doola-daos.json": "DAO LLC. EIN. U.S. address and bank account. Access to U.S. payments. Free tax consultations. Annual state compliance. IRS tax filings. $50,000 in startup perks. And more. File from anywhere, as a US or Non-US resident, in minutes. Crypto payments accepted.",
  "data/ph-top/2022/1/notesally-2-0.json": "Notesally is a sales enablement app to reduce human error in your sales process. It's an AI safety net for your sales team. Notesally helps salespeople to stay on top of their data entry & follow-ups. You could save up to 8 hours per week by using Notesally.",
  "data/ph-top/2022/1/bettoredge.json": "We surveyed a community of bettors & realized they used 40+ different apps to research, bet, compete against friends & brag while making weekly bets. BettorEdge simplifies the process – allowing you to do all of this with no fees. A better bettor experience.",
  "data/ph-top/2022/1/huntr-2-0.json": "Track every detail about your job opportunities regardless of where you found them. Contacts, notes, dates, tasks, job descriptions, salaries, locations, company data and more. It's a CRM for your job search.",
  "data/ph-top/2022/1/flip-clock-notion-widget.json": "A beautiful clock to enhance your notion experience. * Easy to setup * Looks good apption was taking a long time so posted here 😆",
  "data/ph-top/2022/1/neiighbor.json": "neiighbor is a social wellness app used for exchanging well-being data between connected users helping them make better informed choices to improve the safety, well-being and independence of one another.",
  "data/ph-top/2022/1/sourcegraph-d6443094-efa5-4bf2-8b38-366262e4173f.json": "Universal Code Search Move fast, even in big codebases. Any repo, any host. Onboard to a new codebase, make large-scale refactors, promote code reuse, increase efficiency, address security risks, root-cause incidents, and more. Search open source code,",
  "data/ph-top/2022/1/demostack.json": "The default demo won’t cut it for your deal, and neither will spending weeks on a custom version. With Demostack you can spin up a demo environment in minutes and tailor the story for every conversation. No code needed.",
  "data/ph-top/2022/1/fig-8.json": "Fig makes engineers more productive in the terminal. ⠀ Our first product adds visual completions for hundreds of public CLI tools like cd, git, npm/yarn, docker, and aws. ⠀ Want private autocomplete? Create your own completions and share them with your team!",
  "data/ph-top/2022/1/saas-examples.json": "Looking for inspiration for your new SaaS website? Wanna quickly check other SaaS welcome emails without signing up to hundreds of them? That’s exactly why I’ve put together SaaS Examples: To always have an up to date inspiration gallery!",
  "data/ph-top/2022/1/hockeystack-2-0.json": "HockeyStack is an analytics tool for SaaS companies that unifies your marketing, revenue, sales, and product data. HockeyStack uncovers insights, such as the LTV of a blog post, monthly support load by pricing plan, or feature usage of each marketing channel.",
  "data/ph-top/2022/1/clerk-sms-for-slack.json": "Send and receive SMS directly in Slack with your team members. Use an existing phone number or bring your own. Works in threads and in channels, bridge the gap between internal and external communication for real-time & asynch communication.",
  "data/ph-top/2022/1/pepul.json": "Pepul is a new age Interest-based Social Networking platform from India. With our \"Privacy-first\" approach & hyperlocal connectivity, people can connect safely with like-minded real people profiles nearby them & create real-life communities in their interests.",
  "data/ph-top/2022/1/top-50-linkedin-messages-ebook-2022.json": "We want to help you to up your networking game! Because your network is your net worth. These 50 LinkedIn messages are here to inspire you and help you engage your connections in meaningful conversations.",
  "data/ph-top/2022/1/podda-io.json": "Podda is a podcast discovery tool that you can use to discover podcasts by guest.",
  "data/ph-top/2022/1/cart.json": "Uncover data of thousands of e-commerce brands. Perfect for d2c merchants.",
  "data/ph-top/2022/1/nextui.json": "NextUI is the next-gen UI React library that allows you to make beautiful websites regardless of your design experience, comes with awesome features like Auto Dark Mode recognition, Themes support, easy customization, Best-in-class DX and much more.",
  "data/ph-top/2022/1/early-learning-for-preschoolers.json": "Early Learning prepares the littlest ones for a future of lifelong success by pairing them with their very own teacher. They’ll build skills in numeracy, literacy, pre-STEM, and social emotional learning by playing our one-of-a-kind, interactive activities!",
  "data/ph-top/2022/1/dealflow-2-0-by-micro-acquisitions.json": "Dealflow aggregates deals from your favorite startup acquisition marketplaces so you never miss an opportunity. Sort deals by revenue, business model, sales multiples, asking price, and more. Receive custom reports by email or Slack alerts.",
  "data/ph-top/2022/1/waitlyst-beta.json": "Waitlyst helps product-led companies collect product feedback, engage customers, and make data-driven decisions designed to help make their business successful.",
  "data/ph-top/2022/1/candor-2-0.json": "Empowering tech talent to find belonging at work by surfacing fair, balanced, first-person feedback on teams and their leaders, all before contracts are signed. Sign up today and explore what Candor can offer in your journey to finding belonging at work.",
  "data/ph-top/2022/1/signl-2.json": "Signl aggregates and quantifies evidence of a company's traction by scouring news articles, media coverage, social buzz, and more.",
  "data/ph-top/2022/1/columns-ai.json": "Columns Ai helps our users discover the most important stories in their data and share them through beautiful visualizations in data stories or data apps, all on the same platforms/workspaces we use daily, such as browser, email, Slack, etc.",
  "data/ph-top/2022/1/fastlien.json": "With tons of auction lists available, FastLien lets you quickly search 1000s of tax lien and deed certificates.",
  "data/ph-top/2022/1/coronavirus-bot.json": "More than 600k users used the bot to keep up with pandemic information. Get confirmed cases, active cases, recovered cases, and more by country. Get related trends.",
  "data/ph-top/2022/1/propelauth.json": "PropelAuth hosts and manages your authentication. Features like social logins, magic links, or managing profile pictures can be added in a single click. With our B2B support, your users can create organizations and invite their team members out of the box.",
  "data/ph-top/2022/1/whatis-for-chrome.json": "Whatis lets you access and organize your team’s context like jargon, acronyms, projects, metrics, and more. Accessible across Slack and Chrome.",
  "data/ph-top/2022/1/whalepeek-nft-alerts.json": "Get alerted when top NFT influencers mint, buy or sell.",
  "data/ph-top/2022/1/hirebeat-2-0.json": "👉HireBeat is the world’s first on-demand recruiting platform for small businesses to find, engage and hire the best talent faster. 📈 We help you break free from your email, google docs and spreadsheet in the hiring process.🕗",
  "data/ph-top/2022/1/approveit-3-0.json": "⏱ Create expense approval workflows in under 10 minutes ✅ Get approvals directly in Slack or Email with automated reminders 🔗 Integrate Approveit with accounting systems and spreadsheets 🔃 Customize your workflows using conditional rules"
}