{
  "data/ph-top/2021/6/mobile-palette-generator.json": "A mobile palette generator is a simple yet powerful tool that lets you generate color palettes for your mobile or web app with a click of a mouse.",
  "data/ph-top/2021/6/zospace-ui-kit.json": "Creating beautiful Tailwind templates isn't rocket science! ✨ https://shuffle.dev/marketplace/zospace",
  "data/ph-top/2021/6/fastbee-price-tracker.json": "🙄 Considering purchasing something, but aren't sure the price is right? ✅ FastBee tracks the prices of the products you want to buy. Whenever the price changes, you'll get a notification! Better yet, the Bee can even place orders for you.",
  "data/ph-top/2021/6/venus-design-system.json": "Design what you want with less effort at another level! An easy-to-use Design Tool with the most common 2000+ UI/UX components states that allows you to design quickly with world-class standards out-of-the-box. 🔥",
  "data/ph-top/2021/6/designing-ux-for-saas.json": "In this free ebook, you’ll learn: ✅ the basics of UX and SaaS, ✅ what the trends look like in 2021, ✅ the value of UX to SaaS businesses, ✅ UX design processes for SaaS products, ✅ and tips and tools to significantly improve your design processes.",
  "data/ph-top/2021/6/coherence-x4.json": "Coherence X4 allows you to turn any website into a chrome-powered app on your Mac, without any compromises. Use extensions, create tabbed and incognito apps, and much more. Coherence X4 even introduces Microsoft Edge and Opera apps!",
  "data/ph-top/2021/6/findcreators-io-2.json": "Supporting the growth of the creator economy 🙌🏻 findcreators.io lets you find creators based on a keyword in their Instagram biography. 🌎 Find writers, fitness trainers, actors, photographers to work with, promote your brand or join your platform.",
  "data/ph-top/2021/6/developer-ipsum.json": "¯\\_🤓_/¯",
  "data/ph-top/2021/6/spacecasts.json": "A live-audio creator collective. All the best Clubhouse Rooms and Twitter Spaces from the best creators and thought leaders, recorded and collected. ⠀ Want to contribute a SpaceCast? Submit here: https://www.ridehome.info/p/spaces/",
  "data/ph-top/2021/6/hack-the-interview.json": "Hack The Interview is the only interview training system that guarantees a user a job offer within 90 days or their money back! HTI relies on a community of curated mentors to provide invaluable training to job seekers throughout their interview process.",
  "data/ph-top/2021/6/spot-ca077a28-c6c6-4891-b915-a2716fa4734a.json": "Spot is a virtual office loaded with the collaboration and communication functionality a high-performing team needs: voice and video, screen-sharing, and chat all at the team's fingertips.",
  "data/ph-top/2021/6/idea-canvas-univation.json": "Univation is the easiest platform to Build your idea or Run a startup building program.",
  "data/ph-top/2021/6/nft-storage.json": "nft.storage is a brand new service, built specifically for storing off-chain NFT data. Data is stored decentralized on IPFS and Filecoin.",
  "data/ph-top/2021/6/loomsdk-beta.json": "The loomSDK is the easiest & most reliable way for you to add video messaging to your own product – and it’s free. The SDK enables your users to record, embed, & view with Loom videos directly within your web apps – adding clarity and context to any workflow.",
  "data/ph-top/2021/6/smart-stickers.json": "Smart Stickers package includes 90 catchy illustrations for attractive designs. Choose one of the three styles and turn your design into colorful piece of creation. Compatible with Figma & Sketch.",
  "data/ph-top/2021/6/ready-ui.json": "200+ UI blocks for Developers, Agencies, Startups, Marketers, & Designers to create beautiful websites. Production-ready bootstrap code with well-organized figma files to design and develop your next websites faster.",
  "data/ph-top/2021/6/gitlive.json": "Extend your IDE with the real-time features remote development teams need to work together effectively. See what your teammates are working on and get notified of merge conflicts before you commit. Make video calls and code together live, VS Code to JetBrains",
  "data/ph-top/2021/6/drip-by-digitalax-1.json": "DIGITALAX teamed up with Polygon, aka Matic Network, to launch the first real hybrid digital and physical fashion line, with memetic proof of uniqueness!",
  "data/ph-top/2021/6/jitsu-2.json": "Jitsu is an open-source Segment alternative with event collection and API connectors. It can stream and collect the data to any data warehouse of your choice and can be deployed in 2 minutes.",
  "data/ph-top/2021/6/offline-ai.json": "Bye bye dating apps 👋 It's time for something new 😎 Just tell Offline AI the type of person you're looking to meet, and it'll find great matches for you. No app. No public profiles. No swiping. You're in control 😸",
  "data/ph-top/2021/6/google-forms-to-notion.json": "Form to Notion helps you to add entries to Notion Table using Google Form. 📝 Create Forms that matches your Notion Table. 📌 The add-on also helps you embed a better version of Google Form inside Notion pages.",
  "data/ph-top/2021/6/growth-skills-assessment-test.json": "Success in growth requires skills across disciplines ranging from product management and data to customer acquisition and experiment design. This 45-minute growth skills assessment will help you understand your strengths and blindspots across growth skills.",
  "data/ph-top/2021/6/nice-avatar.json": "react-nice-avatar can easily generate an avatar for your users with no efforts",
  "data/ph-top/2021/6/ticktick-6-0.json": "TickTick is an all-in-one productivity app that is simple to use. It helps people get the most out of their life by managing to-dos, scheduling on a calendar, taking notes, and staying focused all in one place.",
  "data/ph-top/2021/6/day-zero-by-day-one.json": "Day Zero is community for aspiring founders and serial builders to explore new ideas, and work alongside a community to bring them to life. We provide tools and a workflow to ideate and validate new ideas so you're next big thing doesn't stay inside your head.",
  "data/ph-top/2021/6/nutrisense-v2-0.json": "NutriSense is a data-driven metabolic health platform that tracks key metabolic markers in real-time. Using continuous glucose monitoring, AI-powered meal tracking, and expert coaching, they help you hit your health goals and create lasting behavior change.",
  "data/ph-top/2021/6/letterlike.json": "Learn what your subscribers enjoy reading, and what they don’t. Letterlike adds a like button to your newsletters, and is a fun and simple way for readers to give feedback on your content.",
  "data/ph-top/2021/6/process-street-automations.json": "Process Street Automations brings your critical work apps together to drive your team’s most important processes. Powering Automations is a new set of native integrations with: Salesforce, Jira, Slack, DocuSign, & Google Sheets.",
  "data/ph-top/2021/6/openphone-for-teams.json": "OpenPhone is an all-in-one business phone for startups. It comes with powerful calling, messaging, and a lightweight CRM. It allows you to share a phone number with your team and collaborate on conversations. Available on mobile, web, and desktop.",
  "data/ph-top/2021/6/batteries.json": "Track batteries of your iPhone, iPad, Apple Watch and Mac at the same time on every device. Battery levels are reliable because it uses tracking tech built into your devices.",
  "data/ph-top/2021/6/firefox-89.json": "Going into the Firefox redesign, our team studied how people interact with the browser, observing their patterns and behaviors. We listened to feedback and gathered ideas from regular people who just want to have an easier experience on the web.",
  "data/ph-top/2021/6/moonsense-recorder.json": "Moonsense Recorder is an easy-to-use application for https://play.google.com/store/apps/details?id=io.moonsense.recorder & https://apps.apple.com/us/app/moonsense-recorder/id1551215403 mobile devices that allows you to record data from multiple sensors, store & label it for analysis, and gives you the ability to build live prototypes faster.",
  "data/ph-top/2021/6/listnr-for-chrome.json": "Listnr for Chrome allows you to Listen to your favourite content on the internet by converting written content into a Podcast.",
  "data/ph-top/2021/6/akiflow-2-0.json": "Akiflow is a Tasks + Calendars productivity app ⚡️ Capture tasks from multiple sources ⚙️ Process fast with shortcuts (plan/snooze) ✅ Increase your focus and personal organization Win+Mac Try it for free on http://www.akiflow.com/",
  "data/ph-top/2021/6/socialmailer.json": "We have been using SocialMailer internally to cold outreach tens of thousands of influencers in the past 4 years. It has been a super time saver for us, and I believe it will be for you too! Love your feedback.",
  "data/ph-top/2021/6/vectoricons-mixer-by-iconshock.json": "VectorIcons Mixer is a simple online tool that allows you to mix & match thousands of vector icons with colorful shapes to generate new icon sets with a few clicks. There are lots of icon styles & hundreds of abstract, geometric & organic shapes to combine!",
  "data/ph-top/2021/6/saas-blocks-ui-kit.json": "SaaS Blocks UI Kit helps founders, designers and developers create beautiful and effective websites and landing pages in minutes. 70+ blocks and conting, components, and free fonts included. Pay what you want (for now).",
  "data/ph-top/2021/6/savely.json": "Savely is the iOS app designed to help you save up for your next vacation by first showing you the real cost behind your travel plans — that way, you’ll know exactly how much money to start stashing. Vacations start with a goal, your goals start with Savely.",
  "data/ph-top/2021/6/wicked-templates-2-0.json": "Stunnig landing pages made with Tailwind CSS, Alpine.js and Next.js.",
  "data/ph-top/2021/6/tidytag.json": "LinkedIn is messy. And it gets worse with more and more connections. There's no convenient way for you to segment your connections. 🏷 Not with TidyTag. Segment your LinkedIn now!",
  "data/ph-top/2021/6/whatsapp-chat-abandoned-cart-recovery.json": "This Shopify Plugin allows you to send automatic abandoned card recovery notifications to your potential customers via WhatsApp and turn them into delighted customers. You can also send other shopping related updates on WhatsApp.. Add WhatsApp Chat Widgets.",
  "data/ph-top/2021/6/the-dad-s-bucket-list.json": "There's no better feeling as a dad than when your kids look at you like they're their hero. Whether you're explaining why the sky is blue, teaching them how to deal with bullies, or laughing so hard they snort a little.",
  "data/ph-top/2021/6/waldo-for-analytics.json": "Test your analytics events in an automated, reliable way!",
  "data/ph-top/2021/6/compairbnb.json": "Have you ever had like 💯 tabs open all of different places you may stay? Compairbnb will save you time.",
  "data/ph-top/2021/6/castyr.json": "Castyr is a new social podcasting and listening platform. Snip and annotate up to 5 minutes of audio, share it in the community feed, and organize it into customizable collections on your followable profile. It’s like TikTok and Goodreads had a podcast baby.",
  "data/ph-top/2021/6/twitter-blue.json": "Starting today, we will be rolling out our first iteration of Twitter Blue in Australia and Canada. https://blog.twitter.com/en_us/topics/company/2021/introducing-twitter-blue.html",
  "data/ph-top/2021/6/google-cemetery.json": "Learn from Google's +100 failures to build profitable businesses and scale acquired companies.",
  "data/ph-top/2021/6/prosoftly.json": "Everything you need for growth is here. Boost your sales, enhance your marketing capabilities and improve your customer services on a single cloud-based platform.",
  "data/ph-top/2021/6/healthy-relationship-with-cats.json": "Cats are unique and incredible creatures beyond a doubt. It is not always easy to understand them. You can find special techniques to communicate with your cat in this e-book. It is completely free!",
  "data/ph-top/2021/6/zoho-salesiq-2-0.json": "A complete customer engagement platform with capabilities like multi-brand management, visitor insights, lead scoring, profile enrichment, live chat, messaging channels, no-code bot builder, a near-human NLP-driven chatbot, profanity management, and more.",
  "data/ph-top/2021/6/poolsuite.json": "Luxurious yet leisurely. Frivolous yet sophisticated. The same sweet sound of summer— turned up to 11. Pack your virtual bags as you've been upgraded from sitting poolside to a private cabana at The Poolsuite.",
  "data/ph-top/2021/6/checkout-page-digital-downloads.json": "Use Checkout Page Digital Downloads to sell digital downloads on the internet. Create a checkout page in a few clicks, upload your files and add the checkout to your site or share a payment link. Works on any platform, no code required.",
  "data/ph-top/2021/6/charmstone.json": "Using spatial memory to launch and switch apps in macOS creates a surprising performance boost. Charmstone is a unique but simple spin on cmd+tab & the dock that easily fits into your workflow. It's especially great if you hide your dock.",
  "data/ph-top/2021/6/really-good-push-notifications.json": "A curated collection of push notification ideas and examples across different verticals. Sign up for Really Good Push Notifications and get push notification inspiration delivered straight to your inbox to stay on top of your push notification game.",
  "data/ph-top/2021/6/zing-data.json": "Zing makes it easy to ask questions on the go from your database (PostgreSQL, with more to come) for free in just a few taps: * Ask questions * Search for data * Create visualizations and tables * Chat with your team..from wherever you are.",
  "data/ph-top/2021/6/clay-mockups.json": "🚨 Beautiful, FREE clay mockup set you can use to showcase your portfolio projects. We use them in our Modern Minimal designs. 👇 Remember the 13° rotation rule - it instantly makes your projects look better ☝️",
  "data/ph-top/2021/6/devzat.json": "Chat over SSH, straight from the Terminal. Free and open source: github.com/quackduck/devzat. Give it a star!",
  "data/ph-top/2021/6/ens.json": "The Ethereum Name Service is an open source blockchain-based naming protocol. Started at the Ethereum Foundation in early 2017, ENS spun off as a separate organization in 2018.",
  "data/ph-top/2021/6/just-farts.json": "Cats farting. ⠀ That's the hunt. ⠀ Cats farting.",
  "data/ph-top/2021/6/hashgrow.json": "With Hashgrow mobile app, you can easily connect your Fb Lead Forms to get instant new lead notifications, send follow-ups via WhatsApp, Email or SMS from pre-set templates. You can also call your leads and track activities.",
  "data/ph-top/2021/6/lighthouse-8-0.json": "Lighthouse 8.0 is here! ⚡ Improved CWV balance for the Performance Score, Lighthouse Treemap and metric filtering now in PSI and Canary DevTools, and a brand new CSP audit!",
  "data/ph-top/2021/6/zenown-2-0.json": "ZenOwn is YOUR personal product assistant app: ✔ Simply add a product with a scan 📱 Get most out of products with video tips ⏰ Turn on the warranty alarm 🛍 Get special brand offers 💰 Sell/giveaway with a few taps More features coming out soon!",
  "data/ph-top/2021/6/marketer-crew.json": "https://marketercrew.com/ is a weekly newsletter for marketers and indie makers. Every Monday and Thursday, you will get an email that makes marketing actually enjoyable. Also stay informed on the latest news, tools, and insights, for free.",
  "data/ph-top/2021/6/million-js.json": "Current Virtual DOM implementations are inadequate—Ranging from overcomplicated to abandoned, most are unusable without sacrificing raw performance and size. Million aims to fix this, providing a library-agnostic Virtual DOM to serve as the core for Javascript libraries.",
  "data/ph-top/2021/6/huma-breath.json": "🌬️ Science-backed breathing exercises to alleviate anxiety, fall asleep faster, increase focus, gain energy and more! 🍃 Huma Breath's exercises are quick and effective — shift your state literally in a minute or two.",
  "data/ph-top/2021/6/where-to-post-your-product.json": "Spark your startup exposure and backlink profile (good for SEO) using a curated list of 280+ website carefully enriched with: -Type -Topic -Time to publish -Free/Paid -Difficulty -Domain Authority -Traffic volume & Top Country -Majestic Trust & Citation Flows",
  "data/ph-top/2021/6/polyo.json": "Polyo by HelloConsent Create custom legal policies based on the nature of your business, written comprehensively that your audience can understand. No registration required! 100% free to use!",
  "data/ph-top/2021/6/siimpl-bookmarking.json": "Save those interesting websites, images, videos, tabs and text you find online, then access from anywhere on any device. Share and collaborate with others OR store those sensitive sites in hidden collections that only show with a pin (away from prying eyes)",
  "data/ph-top/2021/6/console-2.json": "Join thousands of engineers in subscribing to a weekly roundup of the latest in open-source software, curated by an Amazon engineer",
  "data/ph-top/2021/6/koalendar.json": "Welcome to Koalendar! It’s an easy-to-use calendar that guests can signup on for a meeting. It syncs with your Google calendars and integrates with your video conferencing software like Zoom or Google Meet. it's free, easy- Demo- https://koalendar.com/e/demo",
  "data/ph-top/2021/6/gosun-chillest-2.json": "Ice Sucks. This portable electric refrigerator has two zones to cool or freeze, keeping food cold for 10+ hours with built-in battery. Forget soggy sandwiches and melted ice; everything stays dry and organized since Chillest cools with the power of the Sun.",
  "data/ph-top/2021/6/seo-glossary-by-serpstat.json": "The purpose behind this list of 150 SEO terms and articles is to help you deepen your SEO knowledge. SEO is developing rapidly and we tried to make a resource to learn more about key concepts. The glossary is regularly updated so it is always ready to serve :)",
  "data/ph-top/2021/6/tooljet.json": "ToolJet is an open-source alternative for Retool. ToolJet can connect to your existing databases, API endpoints, and external services to build applications on top of the data using our no-code app builder.",
  "data/ph-top/2021/6/snip-3.json": "Snip removes any element from any website with just one click. So it only shows what you want to see. You choices are saved. Next time you visit the same page those removed elements will also be hidden. With Snip you can undo or redo recent changes.",
  "data/ph-top/2021/6/monarch-2.json": "Monarch is a modern personal finance app that actually helps you achieve your financial goals. With Monarch you can manage your entire financial life in one place, create a financial plan, and then easily follow that plan to achieve your financial goals.",
  "data/ph-top/2021/6/koya-3.json": "KOYA makes it easy to schedule personal messages with: - A memory (video or image) - URL (Spotify, YouTube, etc) - Optional gift ($$ for coffee, beer, tacos, etc)",
  "data/ph-top/2021/6/zoho-sheet-extension-web-clipper.json": "The Zoho Sheet web clipper allows you to clip data tables in to spreadsheets in an instant. Using this extension, you can create, access, or spreadsheets in a click. In short, this extension brings Zoho Sheet one step closer to you.",
  "data/ph-top/2021/6/kudos-ad4f1ed8-4840-404c-853c-e69afe290ac0.json": "Kudos is the first and only disposable diaper where baby’s bum touches 100% cotton all day. Combined with patent-pending DoubleDryTM tech, these diapers are a real game changer when it comes to protecting baby’s sensitive skin, the planet, and your couch)",
  "data/ph-top/2021/6/inspiration-database-1.json": "This database aims to help you see where the demand is in the current market, get inspiration for new side projects. The collection is divided into 8 Airtables: - raw databases (147.000+ products) - low rated but popular apps - neglected Chrome extensions",
  "data/ph-top/2021/6/spotify-blend-beta.json": "Blend is a new way for two friends to merge their musical tastes into one curated playlist made just for them. Blend will be updated daily and will grow with each user over time based on how their listening changes.",
  "data/ph-top/2021/6/trendpop-hot-100.json": "Hot 100 is the best way to track the most viral trends on TikTok, powered by https://trendpop.social! Browse the 100 top sounds, creators, and hashtags on TikTok, ranked by virality and updated daily! Weekly, monthly, and yearly rankings available.",
  "data/ph-top/2021/6/storydoc.json": "Turn your static sales and marketing slides into beautiful interactive web presentations. Cut through the noise, increase customer engagement and your conversion rates. Storydocs are easy to modify, no design or coding skills required. Early access now open!",
  "data/ph-top/2021/6/motion-slack-app.json": "With a simple command (/motion @user1 @user2 @user3), we'll take care of checking for everyone's calendar conflicts, timezones, ensuring everyone agrees, and automatically schedule the meeting. 3x faster than checking calendar + chatting back and forth.",
  "data/ph-top/2021/6/mooncamp.json": "https://mooncamp.com/ is the all-in-one operating system to develop healthy, happy, and high-performing company cultures with OKRs, Check-ins, and much more yet to come 🚀",
  "data/ph-top/2021/6/twitter-bot-without-code.json": "Build a Twitter Bot with ZERO lines of code completely using nocode tools. No Twitter API Required 🤯",
  "data/ph-top/2021/6/learn-by-angellist.json": "New Venture Education Center by Angelist covers various topics and aspects of Venture Capital for Founders, Fund Managers and Investors. A great resource to make sense of venture capital.",
  "data/ph-top/2021/6/whatsapp-reminders.json": "Receive meeting reminders and daily agenda from your Google Calendar directly onto your WhatsApp number. Reminders include Google Meets Link and Call Coordinates. Reminds about your meetings 30 minutes (or selected duration) in advance. Receive daily agenda on WhatsApp and stay on top of things.",
  "data/ph-top/2021/6/fix-contrast.json": "Low contrast text is the most common accessibility issue and affects 86.4% of pages. This free extension based on technology developed for Polypane (https://polypane.app) automatically fixes contrast issues on any site you visit.",
  "data/ph-top/2021/6/pabio.json": "With Pabio, you get your apartment fully furnished by a professional interior designer and rent high-quality furniture on a monthly subscription.",
  "data/ph-top/2021/6/api-template.json": "APITemplate.io is the newest API-based platform designed to give you two powerful APIs for your media content generation — Image and PDF",
  "data/ph-top/2021/6/idea-validation-template.json": "Dive deeper by answering insightful questions in the template and expose critical areas of your idea to the surface.",
  "data/ph-top/2021/6/korkuma.json": "Korkuma is a new live commerce SaaS product. We enable businesses of all sizes to stream live on their website and sell [anything]. We want to make live shopping more accessible to the masses with the best price-to-value ratio on the market.",
  "data/ph-top/2021/6/wwdc21-by-raycast.json": "Keep up with WWDC21. Quickly search, filter and favorite this year's sessions in Raycast. Use the WWDC app to download and watch all videos during the week or any time after. Built by Raycast in collaboration with wwdc.io.",
  "data/ph-top/2021/6/700-presentation-templates.json": "These PPTs are appropriate for business and lecture room presentations on education, health, trading, as well as basic-purpose designs together with seasonal Powerpoint Themes and Templates that you can use to make Presentations.",
  "data/ph-top/2021/6/faves.json": "🌟 Skip the 20k+ Waitlist 🌟 Ever wonder what the world's smartest people are reading, watching and scrolling? Find out on Faves. Our curators include the best VCs, Founders and Product Leaders. Sign up today to skip our 20k+ waitlist.",
  "data/ph-top/2021/6/discord-stages.json": "Community servers can now set their Stages public and allow members from across Discord to listen in on all of the amazing activities happening live in their servers. Sing, chat, or learn something new by creating or tuning into a Stage now!",
  "data/ph-top/2021/6/discord-message-embed-builder.json": "A simple, clean interface to help you build embed messages for your Discord bot! Auto-generates message previews and all the code needed to send it. Easily share your embed with others using a simple share link.",
  "data/ph-top/2021/6/playdate-5.json": "Playdate, app and game designer Panic’s first shot at hardware will cost $179, ship next month, and come with a 24-game “season” doled out over 12 weeks. But now it also has a cute speaker dock and low-code game creation platform 😻",
  "data/ph-top/2021/6/poised.json": "Poised is a personalized digital communication coach that provides actionable, real-time feedback during online meetings. Poised works with Zoom, Slack, Microsoft Teams, and Google Meet, among other platforms.",
  "data/ph-top/2021/6/softr-2-0.json": "Softr is the easiest and fastest way to build powerful web apps and portals from Airtable, in minutes. No code required. With Softr, you can build client portals, internal tools, marketplaces, online communities, resource directories and websites.",
  "data/ph-top/2021/6/f-ckoff.json": "So many ads on YouTube! Find yourself counting down the seconds until 'Skip Ad' appears on screen? https://fuckoff.ytmagically changes 'Skip Ads' to 'F*ck Off' It doesn't block ads but it might make you feel better about them (and creators still get ad revenue)",
  "data/ph-top/2021/6/typomotion.json": "We all remember the first time watching Apple's \"Don't Blink\" ad. Typomotion lets you create such kinetic typography videos in minutes. And tweak music, change background image, or adjust colors in just a few clicks. On top of all that... It's free!",
  "data/ph-top/2021/6/be-live.json": "Run engaging live streams on the go from the palm of your hand like a PRO! With Be.Live Mobile app you can: 👋 Invite guests & chat with your audience 🐾 Multi-stream to different destinations ✏️ Brand your broadcast",
  "data/ph-top/2021/6/catapult-translate-faster.json": "Using the latest A.I. and cloud technology, Catapult allows you to translate your texts up to 3-times faster than usual. Additionally, it keeps the same formatting and design as the original document. Works with over 60+ different file types.",
  "data/ph-top/2021/6/cord-3.json": "Cord automates the creation of your training data through our novel micro-model approach. With Cord you can turn your labeling process into an automated assembly line and create training data for your computer vision applications at unparalleled speeds.",
  "data/ph-top/2021/6/virtually-3.json": "Virtually gives you all the tools you need to build and scale impactful cohort-based course with built-in support for payment, live classes, and student management. ⠀ Top programs like https://www.buildingasecondbrain.com/, Ali Abdaal’s https://academy.aliabdaal.com/, and https://flockjay.com/ use Virtually.",
  "data/ph-top/2021/6/ios-15-humane.json": "An ambitious concept for a more humane iOS experience. With new features like Time Well Spent, Persuasive Design Settings, and App Conditions, Apple could lead the industry to technology that is truly respectful of human attention.",
  "data/ph-top/2021/6/bootstarters.json": "BootStarters is a collection of starter templates for the latest Bootstrap 5 including:⠀ - Admin Dashboard - Dark Theme - Fluent Design Theme - Blog Templates - eCommerce templates - Multiple column layouts - Pricing, Login, Magazine⠀ & more!",
  "data/ph-top/2021/6/airy.json": "Airy is an Open Source Conversational Platform to store, structure and utilize conversational data in a secure and privacy-compliant way. Airy can power a variety of use cases, from hosting your own Messaging API to integrating with Conversational AI.",
  "data/ph-top/2021/6/daft-punk-cafe.json": "This is a tribute to the timeless legacy Daft Punk has contributed to this world. Enjoy the 24/7 radio of their tracks or live shows, or test your \"fan level\" by guessing the random track's name or even play tetris with faster & faster tracks as you level up!",
  "data/ph-top/2021/6/the-ultimate-design-tool-picker.json": "There are too many design tools to choose from! Find out which one is the best for you to go from A to B.",
  "data/ph-top/2021/6/promptly.json": "Are your work days filled with support emails? Promptly helps scale your customer support by automating replies directly in Gmail. Trained on your knowledge base and writing style, Promptly is designed to answer customer inquiries and requests on the fly. 📥",
  "data/ph-top/2021/6/100-resources-on-gpt-3.json": "I curated these resources while writing my book on GPT-3 and researching how to build a GPT-3 App. This list can useful for - Developers - No Coders - VC analysts - Tech Writers - Product Managers - Founders It contains... - Articles - Videos - Demos - Apps - Communities - Guides - Code and No-Code Templates - and more",
  "data/ph-top/2021/6/trove-9bfecb5b-573e-4a1c-9b90-f009bc69e885.json": "Trove is a place for knowledge worth sharing. 🗃️ Curate and organize notes and links 🕵️ Public or private 🤝 Collaborate with others 💻 Chrome extension to save directly from the browser 👀 Follow others to see their knowledge in your feed",
  "data/ph-top/2021/6/the-commit-platform.json": "Commit is the first professional network that puts the career needs of Startup Engineers first. We’re a collaborative, remote-first community with life-long peer-to-peer support, personalized career development, and unique access to startup opportunities.",
  "data/ph-top/2021/6/gen-z-casa.json": "Gen Z Casa is a way for Gen Zers to find the perfect community house for them.",
  "data/ph-top/2021/6/very-important-meeting.json": "With some of the most important Euro 2020 matches taking place during the work day, we've built a Chrome extension that disguises the live video streams on BBC iPlayer or ITV player as a video call.",
  "data/ph-top/2021/6/pallyy.json": "The most affordable social media scheduling & auto posting platform. Publish your content on all social platforms at once; Instagram, Facebook, Twitter & LinkedIn.",
  "data/ph-top/2021/6/spyneai-s-car-background-tool.json": "SpyneAI Generates Studio Styled Backgrounds For Your Car. It Works 100% Automatically. Just Upload An Image Of Your Car, Choose A Background You Like And Then See Our Magical A.I Transform Your Car Image In Seconds. Available for Instant Full-HD Download!",
  "data/ph-top/2021/6/maze-templates.json": "Access a library of 50+ pre-built user tests and surveys, ready for you to copy, customize, and share with your own users. From content, concept, and usability tests to feedback surveys and beyond - find inspiration and collect insights faster with Templates.",
  "data/ph-top/2021/6/cartloop-rewards.json": "We built Cartloop Rewards to help Shopify merchants grow their business and drive more sales with the best-in-class tools like Gorgias, Typeform, Clercao, and more. Get access for free and run your Shopify store like a pro! 🚀",
  "data/ph-top/2021/6/icons8-google-docs-add-on.json": "Access thousands of hand-crafted icons right inside your Google Docs! The Icons8 add-on works with Google Docs, Sheets, and Slides. - Enhance your presentations - Spice up your sheets - Engage readers in your documents",
  "data/ph-top/2021/6/price-tags-ios.json": "Price Tags app lets you easily create social media content for business just in minutes. And even in Augmented Reality. Create impactful content that will make your brand stand out!",
  "data/ph-top/2021/6/match-dev.json": "Have you spent hours sifting through developer profiles on Upwork? Paid high fees to TopTal or recruiters? Match.dev is a free and easy way to chat with experts who can pair you with vetted developers who are the exact right fit for you and your team.",
  "data/ph-top/2021/6/material-tailwind-kit-react.json": "Material Tailwind Kit React is a free & open-source UI Kit based on two popular front-end technologies: Tailwind CSS & React. Its design is inspired by Google's Material Design. ✅ 120 Elements ✅ 4 Example Pages",
  "data/ph-top/2021/6/protonmail-2-0.json": "End-to-end encrypted email service ProtonMail has refreshed its design, updating with a cleaner look and a more customizable user interface — including the ability to pick from a bunch of themes (dark and contrasting versions are both in the mix).",
  "data/ph-top/2021/6/the-sf-minute.json": "The SF Minute is San Francisco's premier local newsletter. Every Monday-Friday, we sift through all the city's news to bring you what's most important and interesting. The result is a quick, easy-to-read email that keeps you updated on what's happening here.",
  "data/ph-top/2021/6/nebo-4.json": "Nebo empowers your non-technical teammates to build UI without code. Anyone on your team can now visually assemble your React components into pages for your marketing website or the core product.",
  "data/ph-top/2021/6/nocodedevs-3-0.json": "Discover the latest #nocode tutorials, tips, and tricks from the pros. Browse our vast library to find exactly what you need for your project. New PRO and FREE videos released weekly featuring #nocode makers, tools and products!",
  "data/ph-top/2021/6/investnix.json": "Investnix opens the world of Investment opportunities for the common Internet user. Discover and learn new possibilities of gaining profits from any investment category with ease and security.",
  "data/ph-top/2021/6/hotglue.json": "hotglue is the simplest way to build native SaaS integrations that scale, without sacrificing the extensibility developers need to add real value for their users. Schedule a chat with the hotglue team to talk about getting started today!",
  "data/ph-top/2021/6/unite-com.json": "Need a group selfie to appraise your most valuable followers? Or just a nice portrait with friends you can't meet due to pandemics? Welcome to unite.com, where we unite single-person selfies into group portraits. Join in now and invite whomever you want!",
  "data/ph-top/2021/6/ship-that-shit.json": "🚢 that💩 is an event-based community hosting 3 monthly events to help your 💩 get🚢-ed: 1. Design office hours 2. Technical office hours 3. 1-liner practice/founder speed dating",
  "data/ph-top/2021/6/usage-for-mac.json": "The monitoring app you all deserve! It's soon available in open Beta. And launch will be a few weeks after that. https://usage.pro",
  "data/ph-top/2021/6/wisesheets.json": "No more wasting time copy-pasting stock financials for each company you're analyzing. Get 19 years of financial statements and key-metrics directly in Google Sheets or Excel for 14 different exchanges across the globe.",
  "data/ph-top/2021/6/superlocal.json": "Superlocal is the positive platform where anybody can easily have a deep connection to their local community. We accomplish this by making local social about authentic, meaningful connections instead of crime and safety alerts. ﻿﻿Always feel at home.",
  "data/ph-top/2021/6/ui-chunks-e01-buttons.json": "UI Chunks is a complete source of UI design knowledge, organized in easy-to-learn chunks which refers to the structure of design systems. https://gumroad.com/a/43717747/EiVkk (74 pages guide, Figma/Sketch Library). Get this ultimate buttons guide for a coffee price.",
  "data/ph-top/2021/6/create-my-token.json": "Generate and Deploy Ethereum ERC20 or Binance BEP20 tokens right from your browser, including Mintable, Burnable, Unlimited and Advanced tokens. All in just 5 minutes, no code, login, no setup!",
  "data/ph-top/2021/6/button-for-google-calendar.json": "Chrome™ extension with an overview of your Google Calendar™ in one-click. It also provides notifications and the ability to join meetings quickly. Try it and never miss your meetings again. It’s free and open-source 😇 Made with love by free Belarusians 🤍❤️🤍",
  "data/ph-top/2021/6/adaptive-sdk.json": "Adaptive+ is a free forever mobile SDK with an editor & dashboard for in-app SplashScreen offers with built-in analytics. It turns your app's splash screen into a powerful and engaging experience for your users while your app is still loading up.",
  "data/ph-top/2021/6/eevee.json": "Discover the cost of charging your Tesla. Generate detailed reports, gain insight into your real consumption costs and include charging costs in your company's accounting. All for free.",
  "data/ph-top/2021/6/cerebral-2.json": "Help for anxiety & depression. Online provider visits, care counseling, and prescriptions delivered to your door. https://getcerebral.com/",
  "data/ph-top/2021/6/angellist-recruit.json": "Brand new AngelList Recruit is a suite of products that helps you find, connect, and hire startup-ready talent. Built off of AngelList's network of 8M+ users, Recruit powers hiring for 100k+ companies from pre-seed to post-IPO.",
  "data/ph-top/2021/6/naturalycode.json": "💁‍♂ Add a helpful developer to your team 🤓 Ready to explain instantly 14 programming languages 24/7 👉 Ask for personalized templates 👌 Perfect for no-coders and developers 😃 Now, it's joyful to ask for explanations ✅ Free 14-day trial",
  "data/ph-top/2021/6/juno-3-0.json": "Juno is a social reading platform. Finding good reads is quite hard. We want to make this simpler. Share and discover reads you love on Juno.",
  "data/ph-top/2021/6/health-icons.json": "Health Icons is a free open-source project to create high quality icons and symbols for health projects all over the world. An all-volunteer team of designers and developers has come together to create a large suite of icons for any use.",
  "data/ph-top/2021/6/accord.json": "Accord is a web app that helps startups create, edit and sign legal documents. Start with our free templates, including NDAs, LOIs, MOUs, Privacy Policies, Pilot Agreements and more.",
  "data/ph-top/2021/6/nomad-terminal.json": "There is so much travel content out there, making it hard to find the real gem. So we started Nomad Terminal, a travel resource directory featuring the most useful travel tools and content to help you save the searches 🎉",
  "data/ph-top/2021/6/helpspace-2.json": "A well-rounded customer service tool that you and your customers will love! Benefit from team inbox, intuitive interface, self-service sites, and multiple inbound channels to get a competitive edge in your market.",
  "data/ph-top/2021/6/getfeedy.json": "Reduce gap between you and your customers. Let's make it easy to share feedbacks & stay updated with interesting product updates.",
  "data/ph-top/2021/6/deploy-now.json": "With Deploy Now from IONOS, you can git push your static website or web project from GitHub directly without any build or bandwidth restrictions. Staging, SSL and georedundant, DDoS-protected infrastructure are included in the free plan.",
  "data/ph-top/2021/6/nocode-revolution.json": "No matter what sort of problem you are struggling, no matter the size of your business, NoCode can help you. This page shows how widespread it is to develop software without writing code.",
  "data/ph-top/2021/6/thanaverage.json": "ThanAverage is a small unscientific investigation into how we value and compare ourselves to each other.",
  "data/ph-top/2021/6/colors-9.json": "For designers and web developers, COLORS helps you explore and get the right colors for your next beautiful artwork and user interface.",
  "data/ph-top/2021/6/twitter-profile-screenshot-with-nocode.json": "Create Album of Twitter Profile Screenshot with Nocode and save to dropbox. Learn how to Automatically take a screenshot of your profile after a regular interval",
  "data/ph-top/2021/6/uni-of-threads.json": "Learn Product Management from 250+ Curated Twitter threads",
  "data/ph-top/2021/6/zones-4.json": "Over the past 6 months I've been spending my spare time working on what will likely be my last app for a while. It's called Zones and it's designed to organise all the important parts of your life into separate zones with their tasks, subtasks and ideas.",
  "data/ph-top/2021/6/predesign.json": "I saw some problems in the existing mockup template websites and then decided to solve them by myself and here I am serving you almost all kind of mockup templates to you that you can use for your personal as well as proffesional work",
  "data/ph-top/2021/6/unfreeze.json": "Less typing, more coding. Tired of those screenshots of code you can't paste into your IDE? Unfreeze is a simple macOS application that performs OCR on code snippet images. - Requirements: macOS Big Sur 11.0+",
  "data/ph-top/2021/6/scarlet-illustrations.json": "Create attractive UI designs using these 135 brand new surreal illustrations. Smart concepts and easy to edit and adapt to your branding, instant download in Ai, SVG, PNG, Figma, Sketch and Adobe XD 🔥 Part of our 7000+ illustrations + Free updates",
  "data/ph-top/2021/6/pretty-funnels.json": "Pretty funnels is a free tool to organise and optimise your digital funnels 🚀 👉 Understand different marketing channels 👉 Plan campaigns in advance 👉 Make acquisition efforts worthwhile No signup is required!",
  "data/ph-top/2021/6/bootstrap-builder-2.json": "The highly optimized, configurable and reimagined dashboard Modern, unique and reimagined development stack ever in an HTML product, created from scratch for Nile Dashboard. - Full Style Customization - Layout builder - Components builder",
  "data/ph-top/2021/6/nuftu.json": "Minting your first NFT is a daunting task for beginners: setting up a wallet, aquiring ether, Ethereum gas prices, navigating diffferent platforms... - it's very complex. NUFTU is simple: upload your digital artwork and pay the fee in USD - your NFT is ready!",
  "data/ph-top/2021/6/suprematism.json": "Suprematism is an art generator and a source of inspiration. Create a masterpiece and save it in excellent quality as a picture, print, and hang it on the wall, or save as HD video.",
  "data/ph-top/2021/6/isometrica.json": "Boost your design using 3D illustration constructor to create complex isometric scene easily in Figma. Don't forget to apply shadows to present a natural isometric view.",
  "data/ph-top/2021/6/tella-2-0.json": "Tella is a camera that lives in your web browser. Record yourself, your screen, or slides. Customise your video's appearance. Share anywhere, instantly. https://tella.video/intro-tella-20-3-cksh",
  "data/ph-top/2021/6/makini.json": "Makini is the REST API for industrial systems. Tech companies use it to connect with industrial systems of their customers, regardless of what system it is - all via one simple API. It’s like Plaid, but for industrials.",
  "data/ph-top/2021/6/core-web-vitals-in-website-auditor.json": "Putting hundreds of pages through Google's PageSpeed Insights one by one is a pain. With the new Core Web Vitals module in WebSite Auditor, you can automatically check the crucial page speed data for your website in one place.",
  "data/ph-top/2021/6/the-kunalshah-show.json": "Discover Incredible Insights from India's one of the most curious founder we all know.",
  "data/ph-top/2021/6/engagewith.json": "With EngageWith, build a stronger, healthier & happier team. Recognize your teammates on your channels right inside Slack & Microsoft Teams. Make candid appreciation a part of the way you work, celebrate wins big or small and set up customizable rewards.",
  "data/ph-top/2021/6/read-something-great.json": "Read Something Great dishes out links to timeless articles on the internet. It serves them 5 at a time. Smash the \"Change My Reads\" button, and it'll serve you 5 more. The next time you're bored, instead of scrolling on social media, Read Something Great.",
  "data/ph-top/2021/6/sktch-io.json": "https://sktch.io/ is a No-Code tool allowing you to build data-driven and interactive websites or web-apps. It accelerates the development of websites and web-apps while reducing costs. https://sktch.io/: the fastest way to develop an MVP for your next website/app.",
  "data/ph-top/2021/6/stripe-identity-2.json": "Stripe Identity lets you programmatically confirm the identity of global users so you can prevent attacks from fraudsters while minimizing friction for legitimate customers.",
  "data/ph-top/2021/6/system-color-picker.json": "This is the built-in macOS color picker as a standalone app with lots of additional features. Quickly copy, paste, convert between different color formats, toggle it directly from the menu bar, keyboard shortcuts, launch it at login, and more.",
  "data/ph-top/2021/6/drag-drop.json": "Drag & Drop Illustrations this is 20 simple pixel arts in 80s-90s style. Perfect for commercial web projects and apps! Files include global colors - easily customizable.",
  "data/ph-top/2021/6/tactical-time-blocker.json": "This daily highlight and time blocking template is for people that have difficulty with staying focused on what is most important so you can see a clear view of what to focus on. ✅ Daily highlight 🕰 Adaptive time-blocking ✍️ Dot grid for notes + sketches",
  "data/ph-top/2021/6/headscroll.json": "HeadScroll is a product that helps musicians play instruments. It allows them to navigate their music sheets, chords, or tabs by simply tilting their head. The product is in beta, but we're looking forward to hear your early feedback! 😊",
  "data/ph-top/2021/6/state-of-independence-2021.json": "Contra, along with Li Jin, presents The State of Independence Report. We surveyed over 10,000 independent workers in design, engineering, product, writing, content marketing & social media on the what, how, and why of their work. Read the full report http://www.contra.com/freelance-industry-report-2021!",
  "data/ph-top/2021/6/quest-5.json": "On Quest, you can listen to soundbites with career advice. It's where hands-on experts answer professional questions in short audio clips. We're a community that's changing careers by sharing intimate and honest stories about work.",
  "data/ph-top/2021/6/open-design-sdk.json": "Open Design SDK is an open-source Node.js library that gets data from Figma, Sketch, Adobe XD, Photoshop, and Illustrator designs.",
  "data/ph-top/2021/6/retool-self-hosted.json": "Our low code app builder combines the ease of drag-and-drop visual components with APIs, logic, and escape hatches so developers can custom code whatever they need. Now with self-serve plans that you can deploy on your own private network.",
  "data/ph-top/2021/6/ugly-deck-club.json": "Problem: Everyone hates your deck. Why: It's mostly full of s**t. It's overdesigned, it's way too fancy, and all the bells and whistles are hiding a simple fact: Your content sucks. This is where the ugly deck comes in.",
  "data/ph-top/2021/6/coinrule.json": "Coinrule Catches the Next Market Opportunity on Your Behalf by Automating Your Crypto Investments 🔥 PH Community: Try Coinrule for Free for 7 Days + 10% discount for 3 months (up to $50 value) http://bit.ly/CRoffer",
  "data/ph-top/2021/6/deepnote-for-teams.json": "Deepnote is a notebook that brings teams together to explore, analyze and present data from start to finish. Jupyter-compatible with real-time collaboration, in the cloud.",
  "data/ph-top/2021/6/founderfit-by-koble.json": "Early stage investors evaluate you by deciding if you’re a good fit for the startup you’re building. They call this founder-market fit. Founderfit calculates your fit in seconds so you can see how VCs rate your experience and take the guesswork out of pitching",
  "data/ph-top/2021/6/q-stats-3-0.json": "Open your door to the world of Quora marketing with the Q-Stats Quora Marketing Tool. With the newest version of Q-Stats, get SEO data from Google for every question on Quora, and focus on the relevant questions of your target market.",
  "data/ph-top/2021/6/fintech-by-sifted.json": "A free weekly newsletter Every week, we highlight the top trends and news in European fintech, alongside exclusive interviews and insights 🙌",
  "data/ph-top/2021/6/lazyweb-alpha.json": "LazyWeb is a conversational search engine with a simple chat interface free from ads and tracking. It's like messaging a smart friend that answers questions and sends you useful links. It's the first search engine where you control how results display.",
  "data/ph-top/2021/6/notion-finance-tracker-2.json": "Designed to be beautiful, intuitive and efficient for keeping track of personal incomes, expenses and other financial activities in one place.",
  "data/ph-top/2021/6/the-breakfast-2-0.json": "The Breakfast is neither a dating nor a networking app. It is a human app. Meet in-person and talk to someone new. Over breakfast.",
  "data/ph-top/2021/6/beams-3.json": "Beams is a space for multiple voices to come together around any subject. Start a micro podcast on any topic, and add people to share up to 90 seconds voice recordings from anywhere in the world. Beams evolve and grow with your group as the conversation flows.",
  "data/ph-top/2021/6/carden.json": "Carden is a Chrome Extension that helps you turn the content you consume into long-term knowledge. Create flashcards in context, view in-depth stats, collect points and level up, and much more.",
  "data/ph-top/2021/6/lottiefiles-embed.json": "You can now embed your favorite Lottie animations on Notion, Medium, Ghost, and more - it's as easy as copy and paste. Browse https://lottiefiles.com/featured today to find amazing Lottie animations and embed them right away! Have a question? Ask the Makers",
  "data/ph-top/2021/6/outseta-2-0.json": "Outseta offers all the tablestakes tools that subscription businesses rely on including authentication, payments, sign up forms, CRM, and communication tools. Easily integrate with any website builder or development framework—with or without code.",
  "data/ph-top/2021/6/plastic-tracker.json": "Have you ever wondered where that plastic piece you accidentally dropped ended up? We’ve developed a map that can show you just that – the Plastic Tracker. Input your location and see the likelihood of it ending up in the ocean, and a possible trajectory.",
  "data/ph-top/2021/6/reason-5.json": "Reason is the app for podcast lovers. Listen to podcasts with friends, share great discoveries, and discuss topics with each other and podcast hosts 🎧👋",
  "data/ph-top/2021/6/razor-ui.json": "Designing a consistent component library is difficult, takes a lot of time and is expensive. Our solution? A modern looking UI kit for Tailwind CSS. Save countless of hours and money with interactive components and templates you can drop right in your project.",
  "data/ph-top/2021/6/testbox.json": "Test and compare enterprise software options side-by-side before you buy. No more slides, sales pitches, demos, and unfulfilled promises. Reclaim the purchasing process and feel confident in your decision. It’s FREE, no strings attached.",
  "data/ph-top/2021/6/linkmngr.json": "LinkMngr is a simple and easy-to-use link management and shortening tool with link retargeting, branded links, team collaboration, and analytics.",
  "data/ph-top/2021/6/flarum-1-0.json": "After seven years of development Flarum v1.0 \"Kangaroo\" has been released! A new team, a foundation, development processes; loads has changed to bring to you the first stable version! Thin base software; massively extensible!",
  "data/ph-top/2021/6/1password-8-for-windows.json": "We’re on a journey to reimagine everything 1Password can be on Windows. And you’re invited to join us!",
  "data/ph-top/2021/6/premast.json": "Premast enables you to create professional presentation designs with no experience needed. Introducing two solutions, Premast templates for both PowerPoint and Google Slides. Premast plus web app and PowerPoint add-in. Create, manage and share branded content.",
  "data/ph-top/2021/6/future-4.json": "Future is a new site from a16z that explores how technology is transforming our world—from crypto and biology to gaming and social networks.",
  "data/ph-top/2021/6/peanut-for-chrome.json": "Peanut helps you pick better flights and hotels. See current COVID-19 travel rules and visa requirements while browsing, and even flight delay predictions before you book. Try Peanut on Expedia, Booking or Google Flights today. Add to Chrome, it's free.",
  "data/ph-top/2021/6/social-media-designs-and-templates.json": "Use these social media designs and templates to accelerate planning and creating content. These templates can be used for every social network. No matter where your audience is most active, you’re sure to find something you haven’t shown them before.",
  "data/ph-top/2021/6/mapwize-for-tableau.json": "Connect Mapwize and Tableau to get a powerful and colorful visual representation of your data on indoor maps! Easily gain insights into your business and see your shopping mall visitors traffic and revenue increase or adjust the layout of your office space 🚀",
  "data/ph-top/2021/6/ioon-1-0-rto.json": "Hi there again! Last year IOON became the #3 Product of the Day and was announced as a finalist of the Golden Kitty Awards. Today IOON is Ready To Order. So welcome IOON RTO! IOON — only water and silver ions. Recyclable, pocket-size device. Order now!",
  "data/ph-top/2021/6/tachyon.json": "Tachyon is a developer-first API, that makes big data transfer a breeze. For example we help life sciences companies move around terabytes of sequencing information in a fast, secure painless way.",
  "data/ph-top/2021/6/talscale.json": "Talscale is a one-stop platform to assess tech talent for hiring remotely. Evaluate candidates with project-based assessments, & live pair-programming interviews to building a data-driven hiring process with a suite of collaboration-friendly tools.",
  "data/ph-top/2021/6/anima-4.json": "Anima is a design to code platform for designers and developers. Anima translates Figma, Adobe XD, and Sketch designs into developer-friendly Vue, HTML & React code.",
  "data/ph-top/2021/6/hera.json": "Hera is an Inbox for your meetings. - Instantly join the next meeting in one keystroke - Automatically apply templates to your meetings - Mark highlights and next actions in the meeting - Export to Notion, Todoist...",
  "data/ph-top/2021/6/video-tool-stack.json": "A curated list of +80 video tools & platforms. These tools are the backbone of the video creator economy. Discover all tools that accelerate makers and creators every day.",
  "data/ph-top/2021/6/rank-math-seo-pro.json": "Rank Math PRO is the world’s leading WordPress SEO plugin trusted by industry-leading marketers. It’s about time you ditch the confusion of needing (and having to pay for) dozens of extra add-ons. Keep it simple with Rank Math.",
  "data/ph-top/2021/6/keypoints-for-google-slides.json": "KeyPoints add-on improves productivity by 10X. It helps the user with the important points that are extracted from the PDF/DOCX uploaded by the user. No more copy/paste from the document. Let AI do all the hardwork for you.",
  "data/ph-top/2021/6/pico-max.json": "Grow your perfect garden anywhere! With a 10-day capillary action self-watering feature, multiple mounts, and telescopic grow light LED system, your plants will be nourished everyday, even in the coldest winters! Anyone can do it... Grow Anytime, Anywhere!",
  "data/ph-top/2021/6/letterwell-2-0.json": "Letterwell is a platform to buy and sell advertising space in newsletter emails. Our proprietary marketplace platform facilitates the purchase and sale of adverts in email newsletters for thousands of site visitors every month.",
  "data/ph-top/2021/6/clew-2-0.json": "Whether it’s work you’re keeping track of in your head, files floating around in disparate tools, or context lost in message threads, unload it all with Clew. A digital brain—a place to document, visualize, and archive memory of all things work related",
  "data/ph-top/2021/6/ghost-knowledge.json": "A better way to fund knowledge. 1. You suggest ideas for essays you'd want to read from authors that don't normally publish. 2. You pledge $ to support the suggestions you like. 3. We collect payment and coordinate with authors to make the magic happen ✨",
  "data/ph-top/2021/6/editr.json": "Editr automatically adds near perfect subtitles to your video. Enhance your video and captivate those who watch your content on mute. Upload your video, then watch our machine learning and AI transcribe your video in a matter of minutes.",
  "data/ph-top/2021/6/notion-tools-2-0.json": "I made the https://www.notion.so/Notion-Tools-25d054da911344199cdf403cc04f317c of Notion Tools around 6 months ago, and people from https://www.reddit.com/r/Notion/comments/j2nnhj/a_curated_list_of_notion_third_party_apps_tools/ and https://www.youtube.com/watch?v=K24H6b0msrc helped me add more to the list. You guys also asked me to add more information about the pricing and to tell you which ones I recommend, so I added it to the V2🙌",
  "data/ph-top/2021/6/adventurevue.json": "Missing inspiration for game nights with your friends? AdventureVue is the Netflix for chatbot entertainment, featuring crazy stories and mysteries that will test your logic skills, transforming your night into an adventure. Free to play!",
  "data/ph-top/2021/6/creators-toolkit.json": "The Largest Collection of Tools for amazing Creators. Find the best tool for Podcasters, Writers, Video Makers, Community/Newsletter Owners and other amazing categories.",
  "data/ph-top/2021/6/cartoon-selfie-by-cutout-pro.json": "Turn your portrait into cartoon selfie automatically using the magic of Artificial Intelligence. Upload a portrait of yourself now to cartoon yourself in one tap.",
  "data/ph-top/2021/6/chatterbug-streams.json": "Learn a new language with Chatterbug Streams, the first app for learning Spanish, French and German through interactive live streams. Watch Peloton-like live streams tailored to your level with real-time quizzes and polls.",
  "data/ph-top/2021/6/greenroom-by-spotify.json": "Spotify's latest app letting you host and participate in live discussions through virtual rooms. No Spotify account needed. Discussion can be recorded, there's chat, and speakers can earn gems.",
  "data/ph-top/2021/6/ui-ux-checklist.json": "It'll lovely and helpful if you guys will check out my first template-product. I'll also be launching a condensed notion doc on culture creation and management in a startup inspired by Ben Horowitz soon. Thanks for supporting me guys.",
  "data/ph-top/2021/6/design-code-ios-2-0.json": "Learn by building real apps using Swift, React, Flutter and more. Completely redesigned and 100% made with SwiftUI. New features include downloads, picture-in-picture, favorites, history and widgets.",
  "data/ph-top/2021/6/socialbook-checker.json": "Finding YouTubers to make videos is a super effective way to promote your product and services. However, getting in touch with them is not so easy. With SocialBook checker, you can email hundreds of YouTubers right from the YouTube search result.",
  "data/ph-top/2021/6/trustpage.json": "Customers want to know their data is protected. Trustpage makes it easy to show them how you do it. Take the right steps to safeguard your business and keep your customers happy with an all-in-one Trust Center.",
  "data/ph-top/2021/6/graphcdn.json": "Scale, inspect & protect your GraphQL API with GraphCDN. Reduce your origin traffic by up to 95% with our GraphQL edge cache, get insights about your requests with analytics, track your errors and protect your API from malicious queries.",
  "data/ph-top/2021/6/ricotta-trivia.json": "Have fun with your team on Slack! Play engaging trivia, fun games & Icebreakers. - Trivia games; 15k+ questions with 15+ categories - FREE Ice-breaker games - Custom contests for training, onboarding Offer link - https://www.ricotta.team/trivia?ref=producthunt",
  "data/ph-top/2021/6/mega-creator.json": "Mega Creator is an online graphic app that lets everyone create awesome visuals without special skills and costly design software. Use templates or create your own with our illustrations, photos, icons, and even AI-generated faces.",
  "data/ph-top/2021/6/peppertype-ai.json": "🚀 Write better and faster with Peppertype.ai! With over 25+ amazing content types including Ad copies, blog, copywriting, website content, product descriptions and so much more, Peppertype.ai is the only content tool you'll need.",
  "data/ph-top/2021/6/komodor.json": "Komodor is a Kubernetes-native platform that empowers developers and on-call teams to troubleshoot efficiently and independently. By providing a centralized view of all code,configurations, and 3rd-party app changes across the entire k8s stack,",
  "data/ph-top/2021/6/super-2-0.json": "Super 2.0 includes a suite of new features to build websites with Notion, including super.site subdomains, per-page code & SEO settings, password-protected pages, live site editor, automatic pretty URLs, RTL language support, and more.",
  "data/ph-top/2021/6/travel-guide-by-myluggage.json": "😱 Have you ever been on a trip in a new place where you felt unprepared? 🙉 Imagine you feel like a local during your trip after a 10-min read ⚙ ️Get synthesized and most important insights about destinations 👉 Make the most of your trip with our guide",
  "data/ph-top/2021/6/viasocket-ebl.json": "ViaSocket EBL allows you to automate your custom workflows by connecting multiple apps with your data source seamlessly. It requires just minutes of dev attention to automate workflows that would otherwise require days of developer work.",
  "data/ph-top/2021/6/resume.json": "Download 10+ free high-quality resume templates for Figma",
  "data/ph-top/2021/6/tability-2.json": "Tability is a smarter, simpler way for teams to stay aligned around outcomes without making it feel like a chore. Plan, track & work on your goals in a simple and easy way – all from one place.",
  "data/ph-top/2021/6/no-cs-degree-community.json": "Join a supportive community for self-taught and bootcamp developers. We do voice call AMAs with experienced developers were you can ask them anything you like about learning to code, getting hired or how to be a better developer.",
  "data/ph-top/2021/6/notionery-automation-recipes.json": "A collection of Zapier automation recipes for indie hackers and no-coders made in Notion. Enable automations with a single click in seconds and save 8+ hours every week.",
  "data/ph-top/2021/6/refinery-website-editor.json": "Refinery improves your copy anywhere, whether it’s a static website or a React app. Get AI generated suggestions, make edits in-browser, and publish them. Refinery is used by PMs, founders, & marketers to make copy tweaks without bothering engineers.",
  "data/ph-top/2021/6/realm-2.json": "Realm is building a modern financial advisor for your house. Your free Realm account includes an analysis of current and potential home value, accurate costs & ROI estimates for renovation projects, and tools to prioritize based on budget & goals.",
  "data/ph-top/2021/6/captivate-2-0.json": "Create, manage and scale your podcast in the simplest, slickest way possible. 2.0 includes a completely overhauled dashboard, simplified workflows, badass promotional tools, even more customizable elements and lays the groundwork for more to come.",
  "data/ph-top/2021/6/namify.json": "Namify.tech is an intuitive business name generator that tries to understand the essence of your search and suggests names that are actually usable 1000s of catchy & meaningful brand name ideas ✅ Social handle availability ✅ Domain availability ✅ Free logo ✅",
  "data/ph-top/2021/6/maker-stations.json": "Maker Stations is a publication dedicated to inspirational home offices and mindful living. We curate beautiful & functional home office setups from makers around the world.",
  "data/ph-top/2021/6/jebra.json": "A data management software with 2 modules: (1) A data exchange that connects third-party APIs. This is used in-house now and soon for external developers. (2) An analytics workspace that enables the Jebra team to automate complex workflows.",
  "data/ph-top/2021/6/learney-2.json": "Learney saves you time by planning the optimal path for you through community-built knowledge graphs, given your knowledge and interests.",
  "data/ph-top/2021/6/podpage-2-0.json": "Podpage 2.0 comes with advanced monetization tools, better ways to connect with your listeners, an integration platform, guest management, multi-user and multi-podcast accounts, and a totally redesigned user dashboard.",
  "data/ph-top/2021/6/annie-music.json": "Annie Music enables you share your favorite songs from all streaming platforms, within one link. Now your friends can enjoy your favorite songs without tons of google search to find the link. Just share with annie and voila!",
  "data/ph-top/2021/6/battlecard-2.json": "The best sales tools want to work with startups with the largest long-term value. If you're a disruptor going after a big market, we'll point you toward exactly the tools you need to succeed, plus free credits to maximize your ROI.",
  "data/ph-top/2021/6/notion-portfolio.json": "A Notion template to build your portfolio in just a few minutes. 🖥️ Showcase your work ✍️ Customize all the content 📱 Link to social networks profiles 🎙️ Share your different projects, professional experiences, your best content and podcast episodes",
  "data/ph-top/2021/6/apostrophe-3-0.json": "A powerful website builder built on an open source CMS, offering in-context live editing and dynamic visual design tools with multisite enablement. An extensible and modular system in a full stack JS environment ready for traditional or headless deployment.",
  "data/ph-top/2021/6/feed-5.json": "FEED is the new social video app that makes idea-sharing more fun! Talk to anyone, anywhere, in real-time, & make collective movies. No more typing - FEED’s co-streaming function is the new way to chat & collaborate. Share your ideas; join a new feed today!",
  "data/ph-top/2021/6/dewey-3.json": "With dewey. you can grab all of your existing Twitter Bookmarks, search, sort, tag, create and share collections, and yes even export your Twitter Bookmarks to your favorite note-taking app.",
  "data/ph-top/2021/6/edge-2.json": "Your workstation, anywhere. EDGE is the ultimate laptop and tablet accessory to boost productivity while you work from home. ⠀ Always have the needed information at eye level, reduce distractions, charge your phone and light up your meetings.",
  "data/ph-top/2021/6/vitadao.json": "VitaDAO is a decentralized collective funding early stage longevity research. Our mission is to extend human lifespan by researching, financing, and commercializing longevity therapeutics in an open and democratic manner.",
  "data/ph-top/2021/6/copyhat.json": "Six months ago, we asked GPT-3 to generate Tinder openers that we then bundled into a book. They were funny and surprisingly practical. Now with Copyhat, you can also have this powerful language model as a wingman in your pocket.",
  "data/ph-top/2021/6/interial.json": "Interial enhances the frame rate of the video that you provided depending on your choosing. Interial currently allows you to do 2X or 4X enhancement which will significantly improve the frame rate of your video making it much smoother.",
  "data/ph-top/2021/6/cookie-popup-blocker.json": "https://world.hey.com/nasir/cookie-popups-have-ruined-the-web-fdaee6fe and madee the user experience terrible. Cookie Popup Blocker is a free and open source Chrome extension that removes cookie popups in your browser without agreeing to any of the legal terms.",
  "data/ph-top/2021/6/primer-rooms.json": "Primer Rooms are live, interactive audio experiences where ambitious kids around the world explore their interests, solve problems, and create together.",
  "data/ph-top/2021/6/qr-code-generator-by-logaster.json": "Now you can create QR-Code with Logaster in no time. All you need to do is just: - Type the name of the company or brand - Choose a business field - Insert a link you want to share - Select the QR-code style and click Download.",
  "data/ph-top/2021/6/super-portfolio.json": "Create a super powered portfolio page for yourself ⚡️ All your online presence in one place 🥳 An easy way to make your portfolio website; bio, calendar, story, links, videos, projects, tool stack and many more in one place.",
  "data/ph-top/2021/6/notion-party-planners.json": "A party planning pack of 3 templates that plans out all your events In this template you get - 💸Budget planner 🎈Theme inspirations 🌮Vendor details 📝To-do list with collaborative features 🎮Game party template 👰Wedding planner template 🍨Recipe ideas",
  "data/ph-top/2021/6/digital-design-talks.json": "🚨 Sharing the knowledge of great designers with the aspiring ones 🥰 New interview coming weekly with community suggested questions being added as we go. ✨ Learn from the collective experience of these industry shaping people!",
  "data/ph-top/2021/6/sharedrop-2.json": "ShareDrop is a free web app that allows you to easily and securely share files directly between devices without uploading them to any server first.",
  "data/ph-top/2021/6/autocomplete.json": "Chrome ext to autocomplete your sentences in any text box. AI powered sentence completion that works in any text area on any web page.",
  "data/ph-top/2021/6/college-compendium.json": "The best products are built by those equipped with the best knowledge. Build your information base and explore your intellectual curiousity through a crowdsourced compilation of 650+ CS courses from top universities.",
  "data/ph-top/2021/6/newsly-2.json": "Listen to top-trending web articles, read in a natural voice while you wash the dishes or laundry, cook, commute or just relax. Staying up-to-date on your favourite topics has never been easier. Ideas for your SEO blog, or improve English. We got podcasts too!",
  "data/ph-top/2021/6/execute-3.json": "Using concepts from the 12 Week Year by Brian P. Moran and Michael Lennington, this template guides you through each step of the planning and execution process while the information is transferred seamlessly across synced blocks and databases.",
  "data/ph-top/2021/6/tao-of-react.json": "A book of rules and guidelines that will help you build well-structured and extensible React applications. Learn proven practices about architecture, component design, testing, and performance. Contains 4 chapters. A total of 70 principles.",
  "data/ph-top/2021/6/show-keys.json": "Show Keys is a utility to show key presses on your Browser. And that's it. It just does that one thing.",
  "data/ph-top/2021/6/notion-website-kit.json": "Notion Website Kit makes it easy to setup websites with ready to use templates. ⚡️ 6+ templates 🎨 Easily customise colors, fonts, text. 🔗 Create your own linktree 👨‍💻 Setup easy to use personal website 📝 Resources to help setup website using Notion",
  "data/ph-top/2021/6/inlytics.json": "LinkedIn Analytics For Personal Profiles --- ➡️ Analyze your data 10x faster ➡️ Find insights others won’t ➡️ See why people engage with your content ➡️ Connect Multiple LinkedIn Accounts to work with your Team, Clients, or Agency",
  "data/ph-top/2021/6/billionaire-tax-calculator.json": "Based on the groundbreaking research from Forbes and ProPublica, this calculator lets you Muskify, Bezosify, Bloombergify, and Buffettify your taxes. To show you how badly the American tax system is broken in favour of the super rich.",
  "data/ph-top/2021/6/notion-landing-page-template-13856d86-dcb2-456d-ae6d-0445ea6011c3.json": "You will have everything below in this Notion template! 🎉 Header 💬 Testimonials ✨ CTAs ❓ FAQ 😸 ProductHunt Badge ✒ Descriptions 💪 Team users 💲 Pricing 📧 Contact 🗺 Map",
  "data/ph-top/2021/6/rick-s-reviews.json": "We put an episode of Rick and Morty into a landing page! Join these characters as they review famous failed startups across different dimensions and their (whacky) alternate timelines.",
  "data/ph-top/2021/6/kilo-ssl-pro.json": "Easily add a fully managed SSL Certificate Management system to any SaaS that wished to offer SSL certificates to all domains pointing to their service - now with complete multi instance support. Ideal for SaaS that offer branded pages and tracking domains.",
  "data/ph-top/2021/6/mypath.json": "Choosing a career is one of the essential decisions in life. Make that choice based on feedback from people with work experience.",
  "data/ph-top/2021/6/pricing-page.json": "Have you every been ready to launch a product and needed to create a pricing page at the last minute? And then when you decide to update your prices, you need to update both your Stripe settings and your site. Now with it's automatic generated and in sync!",
  "data/ph-top/2021/6/twm-logo-tester.json": "TWM Logotester is a free and easy way to instantly test the quality of your logo. Built and reviewed by professional designers this product will test your logo against design standards in 4 areas: 1. Uniqueness 2. Scalability 3. Background tolerance 4. Colors",
  "data/ph-top/2021/6/recruitbot-2.json": "RecruitBot uses machine learning to understand your hiring preferences, so you can intelligently source from our exclusive database of 350+ million U.S. candidates, as well as every resume in your ATS.",
  "data/ph-top/2021/6/noor-2.json": "Forget the Zoom clones or \"virtual offices\". This is different. Since late 2019, three of us worked every day & night to shape a stellar experience for collaborating remotely. Slack is no longer enough. Our users are already using Noor for hours every day!",
  "data/ph-top/2021/6/blurweb-app-2.json": "If you do screen share or record tutorials securing sensitive information can be to much time consuming or impossible when doing live, Use blurweb app to hide sensitive info in few clicks",
  "data/ph-top/2021/6/benetalk-3.json": "BeneTalk is a speech coach in your pocket. Designed for people who stutter by people who stutter. Get instant feedback when you speak, track progress and use insights to find your rhythm. Practice helpful habits to feel more confident in communication.",
  "data/ph-top/2021/6/monitor-buddy.json": "Uptime monitoring can be expensive and complex sometimes. ⠀ We make it easy & cheap. ⠀ Get our free forever plan and monitor up to 5 hosts. No credit card needed. ⠀ You'll also get round the clock customer support via Twitter directly from the founders.",
  "data/ph-top/2021/6/senpai-gg.json": "SenpAI.GG is an AI-based personal gaming assistant to improve gaming performance. SenpAI.GG desktop application provides a wide range of recommendations before the game, during the game, and after the game by utilizing patent-pending AI technologies.",
  "data/ph-top/2021/6/recruitbot-3.json": "RecruitBot is the best way to hire top talent. It saves you time by using machine learning to reverse engineer new candidates from your dream hires and maximizes your responses by sending drip campaigns directly from your email to a candidate’s personal inbox.",
  "data/ph-top/2021/6/elementz.json": "It's easy to use with an innovative API, has beautiful modern components, includes a Theme Maker tool which you can customize the components style easily. Anything that you need in a UI library and more.",
  "data/ph-top/2021/6/transloader-3.json": "You want to download something on your Mac, but it's not in reach? No problem. With Transloader, you can assign downloads to your Macs from your iPhone, iPad, and other Macs - no matter where you are.",
  "data/ph-top/2021/6/mars-genesis-1.json": "10,000 UNIQUE collectible parcels of Mars, covering the entire planet, with proof of ownership stored on the blockchain. Trade & collect digital cards and become the Emperor of Mars 👑",
  "data/ph-top/2021/6/pause-4.json": "Say hello to Pause, a time-off management tool that helps teams: ⏳ take time off 💡 know colleagues' availability 🎳 create transparent policies 🤝 plan better together Pause works where you work—Slack, Calendar, mobile, browser—to make team planning a breeze!",
  "data/ph-top/2021/6/indie-worldwide.json": "Indie Worldwide is an online meetup group for indie makers and founders from around the world. We host monthly meetups, webinars, and a super supportive and active Slack group. See you there! 🌎🌍🌏",
  "data/ph-top/2021/6/dialogue-c3640a98-52fa-465a-951f-ff5ab2a48142.json": "Dialogue's No-Code solution enables E-commerce SMBs to increase sales quickly and effortlessly using AI and automations. It analyzes, understands and optimizes users journey real-time to convert them into buyers.",
  "data/ph-top/2021/6/surveys-by-hockeystack.json": "This is a free tool that allows you to create rich surveys, including NPS. Target by device, time spent on site, exit intent, and pages. Connect HockeyStack and get detailed data including question dropoffs, impressions, referrers, and full user sessions.",
  "data/ph-top/2021/6/dunk.json": "DUNK is a mobile app that helps you take your friends to a secret destination! 👋 invite your friends 🗓 pick a date and a budget 🌎 choose your secret destination 🔥 create an amazing teasing (games, clues and dares) before D-Day",
  "data/ph-top/2021/6/kaapi-2.json": "Kaapi helps remote managers become better leaders by ❤️ Figuring out who's unhappy? 🎉 Playing fun Icebreaker games together 📅 Run effective standup meetings. and more! Your modern toolkit for remote leadership 😇",
  "data/ph-top/2021/6/designify.json": "Upload any photo and magically turn it into a design – 100% automatically. Apply your favorite edits to any number of photos, and bulk-create beautiful product photos and more in no time.",
  "data/ph-top/2021/6/audience-feedback-for-creators.json": "Template to create your Audience Feedback/Ask Me Anything completely free using Notion and Tally in 4 easy steps.",
  "data/ph-top/2021/6/icebreakers-for-slack.json": "🧊 Brrrr....it's freezing cold in your Slack. It's time to break the ice. Bored brings Icebreakers right into your Slack. Our collection of fun and downright weird content will spark conversations. - Start a ritual by scheduling it - Works in multiple channels",
  "data/ph-top/2021/6/mental-mirror-2-0.json": "Mental Mirror gives you the ability to train your mind like you’re training your body in the gym 🏋️ By using it periodically you develop the right skills to face the unpredictable world around you 😶‍🌫️",
  "data/ph-top/2021/6/kin-habits.json": "Kin is a social habit tracking app that helps you create long-lasting changes. We make it easy and fun to build healthy habits effectively. Take courses to learn new habits or improve existing ones, share habits with friends and much more.",
  "data/ph-top/2021/6/material-tailwind-dashboard-react.json": "Material Tailwind Dashboard React is a free & open-source Dashboard based on two popular front-end technologies: Tailwind CSS & React. Its design is inspired by Google's Material Design and it features a huge number of fully coded components. ✅ 120 Elements ✅ 2 Customized Plugins ✅ 4 Example Pages",
  "data/ph-top/2021/6/floasis.json": "flOasis.io allows you to book and share unique stays for connection, wellbeing & productivity. 🌿Inspiring Stays ‍💻Remote Work Friendly 🏄Communities & Activities 💡Easy & Safe Booking 🤩Weekly & Monthly Prices Stays are tested & approved by remote workers!",
  "data/ph-top/2021/6/talk-to-your-users.json": "One of the top pieces of advice in the startup/product world is this: talk to your users. This podcast (original name, isn't it?) is a set of practical examples (actual conversations) I have with my possible/current/future/past users.",
  "data/ph-top/2021/6/asking-franklin.json": "Asking Franklin is a complete toolset for content marketers. Discover what people are looking for on Google and get tons of content ideas. Now, you can write an article about their questions thanks to our super-powered AI writing assistant.",
  "data/ph-top/2021/6/voice-channels-by-quill.json": "Voice Channels are just like regular channels — create as many as you like, add them to your sidebar, control access, and link to them. Scheduled video calls can be surprisingly formal. Capture the serendipity of an office, even when you're distributed.",
  "data/ph-top/2021/6/brave-search-beta.json": "Brave Search beta doesn’t track you or your queries. Ever. Private, independent, & transparent, Brave Search is the real alternative to Google. ⠀ On mobile, desktop, & anywhere the web takes you. Search private. Search with confidence. Search without a trace.",
  "data/ph-top/2021/6/brand-kit-by-premast.json": "Brand Kit inside Premast Plus enables you to create multiple brand kits to access inside PowerPoint. You can build a brand kit that includes your brand assets & you can invite others to use it too. Simply create unified presentations that represent your brand⚡",
  "data/ph-top/2021/6/rocketlane.json": "Rocketlane is a purpose-built customer onboarding platform for CS, Onboarding, and Implementation teams. It will help you: 💪 Hit project goals ⏰ Shorten time-to-value 🤩 Deliver a 5-star customer experience",
  "data/ph-top/2021/6/great-question.json": "Great Question puts customer research on autopilot. From recruiting participants, to scheduling interviews, surveys & prototype tests, then share what you learn with your team, all in one place. Talk to your customers & build something people want.",
  "data/ph-top/2021/6/noloco.json": "Build truly custom web apps faster than ever before. Noloco is the complete no-code solution for the next generation of developers. With Noloco, you can build powerful, custom web apps without code - all in one platform.",
  "data/ph-top/2021/6/tweetflick.json": "Tweetflick is the smart way to save, organize, and access the tweets you love. The tweets bookmark manager for the power users of Twitter.",
  "data/ph-top/2021/6/copymonkey-ai.json": "CopyMonkey.ai generates and improves product descriptions for e-commerce. You can evaluate your existing descriptions, generate the missing ones and see what performs better",
  "data/ph-top/2021/6/video-podcasting-software.json": "Up to 4k,wav audio quality, automatic transcription, and powerful text search. All remote.",
  "data/ph-top/2021/6/viral-loops-for-newsletters.json": "Quickly set up a referral program for your publication, and enable your existing readers to grow your audience.",
  "data/ph-top/2021/6/google-form-to-chatbot-2.json": "🔥 In one minute, you can convert your existing Google Form to an interactive chatbot. ✅ It’s built as a Google Form add-on & the chatbots are created inside Collect.chat.",
  "data/ph-top/2021/6/scaler.json": "Here's Scaler, a tool designed to fix holes in your eCommerce customer flow, created on top of Facebook’s Robyn algorithm. It provides you with an easy look at eCommerce's impact on your KPIs and evaluates the effectiveness of media investments.",
  "data/ph-top/2021/6/doodlicons.json": "Carelessly designed Doodle icons for your next Project's Wireframe. Support for SVG and your favourite design tool. Completely free and open source.",
  "data/ph-top/2021/6/frontend-toolbox.json": "There are lots of tools to choose from, and it’s hard to find the right ones. That’s why I created this list – so you save time by easily finding the best stuff out there.",
  "data/ph-top/2021/6/onfolk.json": "Onfolk is software for businesses that makes managing and paying people seamless. Time-off, automated onboarding, UK payroll, and core HR all in one tool. No more spreadsheets! Plus: smart integrations for pensions, accounting software, and bulk payments.",
  "data/ph-top/2021/6/instagram-hashtag-hunter.json": "Find the right hashtag tailored for your Instagram profile. Analyse the competition & get the related hashtags. With GrowMeOrganic Hashtag Hunter, you can find the hashtag that can help to rank you on the top post of a hashtag page on Instagram",
  "data/ph-top/2021/6/vlc-mobile-remote-2.json": "VLC Mobile Remote is a universal remote of sorts that allows you to access and control media playing on VLC, Netflix, Prime, Spotify etc in your PCs/Macs with your smartphone/tablet from wherever you are seated.",
  "data/ph-top/2021/6/cymfo.json": "Cymfo analyzes how your employees communicate, feel, and reflect. Use the insights to provide mental health help. Create an environment where employees feel connected to your company & have a positive work experience that's part of a balanced, fulfilling life!",
  "data/ph-top/2021/6/not-real-twitter-2-0.json": "The original Not Real Twitter was launched by Airdev a few years ago to show what could be built without code, using Bubble. Since then Twitter has changed their UI and Bubble has become more powerful, so it was time for a 2.0, still without code :)",
  "data/ph-top/2021/6/accessible-livechat.json": "Create a multifunctional chat widget, accessible to everyone. Make your online business friendly to people with disabilities, allowing customers to talk to you more freely.",
  "data/ph-top/2021/6/seedscout.json": "In 2021, starting a podcast is one of the best ways to meet other techies and build a brand. Seedscout is a way for people to get these benefits, without the work. Leave booking, editing, and producing to us, and you just focus on having great conversations.",
  "data/ph-top/2021/6/product-ops-podcast-2.json": "Product Ops is set to be the backbone of product-led growth in startups yet there’s still much to be learnt and shared in this space. Each week, POP brings you diverse perspectives and actionable insights from people working in this function across the globe.",
  "data/ph-top/2021/6/chrome-extension-kit-2-0.json": "Spend time building your Chrome Extension, not setting up manifests and environments. Chrome Extension Kit includes 17 different battle-tested starter templates so you can avoid the tedious stuff and focus on shipping faster than ever.",
  "data/ph-top/2021/6/business-hr-tool-kit.json": "Run your Business Easily and Elegantly 👉 Business documents including agreements, pitch decks, forms. 👉 Marketing templates including sales, media kits, notices. 👉 HR Bundle including forms, JDs, policies, hiring modules. 👉 Infographics & Presentations",
  "data/ph-top/2021/6/765-investment-funds-database.json": "Text me on https://www.linkedin.com/in/andrei-shemet-6a301495/. Check out our app https://apps.apple.com/gb/app/baby-sleep-tracker-shema/id1535608673",
  "data/ph-top/2021/6/3veta.json": "3veta is an all-in-one solution that empowers consultants, creators, and service providers to: 📅 Schedule or get booked 🤙 Host video meetings in the browser 💳 Get paid instantly 🌐 Build a website … and much more!",
  "data/ph-top/2021/6/eyeware-beam.json": "Turn your iPhone or iPad into a head and eye tracker device for your Windows PC! Using the TrueDepth selfie camera of your iPhone or iPad, Beam offers you a quick and easy way to activate head tracking and eye tracking for your games and streams.",
  "data/ph-top/2021/6/toucan-6.json": "Deploy the clearest, most compelling & most collaborative data stories in record speed without compromising on quality, adoption or access 📊 Leverage a built-in, no-code framework, a universal device deployment & a flexible, cloud-native infrastructure 💪",
  "data/ph-top/2021/6/june-for-slack.json": "Instant analytics, right in Slack. 📊 Receive metrics without lifting a finger 🎉 Celebrate when milestones are hit 👯‍♂️ Rally your team behind your metrics 👉 Give it a try: https://slack.june.so",
  "data/ph-top/2021/6/typefully-pro.json": "Level up your Twitter game with powerful analytics and advanced scheduling, inside the Typefully app you know and love.",
  "data/ph-top/2021/6/stockhound-by-fabrikator.json": "StockHound is an intelligent stock out watchdog 🐶 for Shopify Stores. StockHound forecasts the stock out date of each product and sends the list of products that are about to run out of stock. It’s a simple and effective solution for a complex problem.",
  "data/ph-top/2021/6/veezoo.json": "Veezoo is an AI-powered Data Analytics solution that enables: -non-technical users to get insights from data by asking questions in plain English -technical users to curate data experiences with a semantic, SQL-based modelling language Get started in seconds!",
  "data/ph-top/2021/6/13chats.json": "13Сhats is a cloud-based all-in-one platform for marketers, salespeople, and support teams. Personalize offers, keep visitors on your website, and turn them into leads using our smart pop-ups, widgets, live chat, and Facebook Messenger chatbots.",
  "data/ph-top/2021/6/ecommerce-personalization-report-2021.json": "Netcore Cloud performed a research study by surveying 200 retailers and 600 shoppers in early 2021. The report offers deep insights into personalization goals and challenges for eCommerce retailers and also unearths the major trends to look forward to in 2021.",
  "data/ph-top/2021/6/sellercenter.json": "SellerCenter gets you ideas on running your online business by offering real-time data and insights of the best-selling stores on Amazon, Shopify, Aliexpress, Wish, Shoppe, and Lazada.",
  "data/ph-top/2021/6/gosolo.json": "We reject the notion that starting a business has to be a complicated affair.&nbsp; With GoSolo, you can easily start a business, open a business bank account and start sending invoices and getting paid within 1 working day!&nbsp;",
  "data/ph-top/2021/6/inai-vox.json": "We are proud to introduce our new AI voice dubbed INAI Vox! ✔ INAI Vox can give you fluent voices in your language, without accent. ✔ Speak fluently in over 47 languages! ✔ One day free! Special for product hunt!",
  "data/ph-top/2021/6/gantt-io-2-0.json": "Gantt.io is a unique Gantt Chart designer allowing you to create amazingly beautiful project plans. It's super quick and super easy to use and allows you to demonstrate your professionalism when pitching or mobilizing stakeholders for your project.",
  "data/ph-top/2021/6/hypercontext.json": "Hypercontext empowers over 100,000 managers and their teams to be high-performing by combining quarterly priorities, weekly meetings, and engagement measures—all in one place.",
  "data/ph-top/2021/6/kobra.json": "Kobra is a visual programming language (like Scratch) for machine learning. ⚡️ Build ML models and apps super fast 🧱 Visual interface = no need to learn complicated syntax 📊 Built in dataset manager and editor 💬 Share your projects with the world",
  "data/ph-top/2021/6/stakewise.json": "StakeWise was the product of an idea (way back in 2018) to make the whole ETH staking experience more user friendly and allow real flexibility managing your Ether either staked individually or as part of a pool.",
  "data/ph-top/2021/6/adeptid.json": "AdeptID’s API makes it easy for anyone building a Future of Work application to include ML in the way they discover talent without college degrees. We connect talent to jobs and training on the basis of transferable skills (rather than job titles).",
  "data/ph-top/2021/6/courier-3.json": "Courier's API and Studio enable developers to deliver the right message to the right user at the right time. Free to use | No CC required SDKs for Node.js, Python, Ruby, PHP, Go, and Java. Automations | White-Labeling | Inbox/In-App | Preferences",
  "data/ph-top/2021/6/spore.json": "Spore is the all-in-one way for you to earn, share your best content and engage with your fans. From paid memberships and podcast hosting to newsletters, SMS and more. Run and manage everything from one place without the extra headaches.",
  "data/ph-top/2021/6/windows-11.json": "Windows 11 provides a calm and creative space where you can pursue your passions through a fresh experience. From a rejuvenated Start menu to new ways to connect to your favourite people, news, games, and content",
  "data/ph-top/2021/6/bit-io.json": "A single, giant, secure Postgres database. Public and private data. Add data in seconds. Query across all the data. Share with one click. The fastest way to create a Postgres-compatible database, period. Drag a CSV/XLS, get a database.",
  "data/ph-top/2021/6/wenew.json": "Beeple is making his next big move in the digital art space: he’s launching an NFT platform that’ll sell “iconic” moments in time.",
  "data/ph-top/2021/6/ipod-classic.json": "Listen to you favorite tunes, on Apple Music or Spotify, with this web app that brings up the iPod nostalgia",
  "data/ph-top/2021/6/fococlipping.json": "Remove background from images with 1 click. HD output quality up to 3000x3000 pixel. Easy and user-friendly editor interface. Change image background with customized templates. Bulk image processing is available soon.",
  "data/ph-top/2021/6/startup-academy-directory.json": "This curated directory features 50+ startup academies and their customer education programs. It includes answers to most asked questions from the makers themselves and brings you many inspiring insights.",
  "data/ph-top/2021/6/cleep-pro.json": "Cleep Pro is a 4K mini Vlog Cam to capture your life moment with ease. Wear it on sunglasses, on your wrist or ﬁx it on your hat and give unprecedented perspectives to your next video recordings",
  "data/ph-top/2021/6/zero-to-marketing.json": "Every two weeks I pick a website and write a short case study explaining exactly how I’d grow it",
  "data/ph-top/2021/6/trivia-2-0.json": "Play fun games together with your team in real-time inside Slack & MS Teams! 1. Trivia Quizzes (50K+ Qs, updated monthly) 2. (Un)Popular Opinion Polls 3. Jumbled Words 4. Crossword 5. Pictionary 6. This or That 7. True or False 8. GIF Charades 9. Water Cooler",
  "data/ph-top/2021/6/laoshi.json": "Laoshi helps to learn Chinese words and characters. Choose your favorite textbook, subject list, HSK. Use spaced repetition system to remember words for long. Practice drawing Chinese characters directly onto your smartphone at your convenience.",
  "data/ph-top/2021/6/landing-page-kit-from-framer.json": "Introducing the Landing Page Kit, a set of drag and drop building blocks that make it easy to design a fully interactive website. Built for both desktop and mobile sites. - 60 components - 100+ of customizable properties and interactions - No code required",
  "data/ph-top/2021/6/maroo-2.json": "Maroo (YC S21) is a new payment method, designed for the weddings industry, that helps couples to avoid high-interest credit cards and personal loans. Instead, we offer 0% APR payment plans for up to 24 months for all wedding expenses.",
  "data/ph-top/2021/6/profilehunt.json": "Profilehunt is a Kanban board built for organizing your job search. It comes with a browser extension so you can add jobs from any website to your board. Profilehunt sends weekly reminders and updates on applications.",
  "data/ph-top/2021/6/sales-engagement-power-pack.json": "Value-packed, practical handbook on the most important aspects of sales outreach, from getting started to pro tips on visual prospecting, along with dozens of battle-tested templates. Created by SDRs for SDRs 💙",
  "data/ph-top/2021/6/markopolo-ai.json": "Markopolo AI is a cross-channel advertising SaaS capable of automating PPC campaigns in Facebook, Google, and Instagram. We've integrated GPT-3 based ad creation within it as an add-on so that users can experience an end-to-end digital advertising solution.",
  "data/ph-top/2021/6/clearmix.json": "Create testimonials and other videos with professionals. We shoot video through webcams and our virtual studio and professionally edit that footage for use on company websites, blogs, YouTube, social and more.",
  "data/ph-top/2021/6/rural-club-1-0.json": "Do you work as a freelance, have a remote job or run your own business? Maybe you love to work remotely in best rural places located in paradise Spain and Portugal. Join Rural Club to get curated resources for rural lovers.",
  "data/ph-top/2021/6/planta-2.json": "Planta is a smart farm management software that helps you plan, monitor and analyze all activities on your farm easily.",
  "data/ph-top/2021/6/hubstaff-tasks-2.json": "Reach new levels of productivity with Hubstaff Tasks. This Agile project management software helps your team do more with less, plan out projects together, visualize almost everything, and get more done.",
  "data/ph-top/2021/6/moonbeam.json": "Discover your next favorite podcast by listening to personalized audio feeds of curated highlights.",
  "data/ph-top/2021/6/notion-minimalist-habit-tracker.json": "Create, track and reflect on your habits in a minimalist notion environment with a help of this notion template. Features: - Habit Tracker - Weekly Goal Stats - Reflection Board - Reflection Questions - Custom Icon Pack and Cover",
  "data/ph-top/2021/6/social-checkout.json": "Social Checkout is an out-of-the-box checkout API that enables customers to refer people they know to redeem group discounts. Merchants can set different discounts on one-time purchases or subscriptions. Customers spend less, merchants make more.",
  "data/ph-top/2021/6/all-vision.json": "Your machine learning stack is not complete without All Vision. Our tool finds and tracks new data patterns for you and is built for your existing ML stack.",
  "data/ph-top/2021/6/no-sugar-today.json": "All you ever wanted is to get rid of sugar and couldn't really tackle it? Well, not anymore. https://no-sugar-today.com helps you to stay away from sugar. Check-in daily and keep yourself accountable in public.",
  "data/ph-top/2021/6/standupmonkey.json": "A self hosted slack bot to conduct standups & generate reports.",
  "data/ph-top/2021/6/page-pad.json": "Page Pad is a Chrome extension for creating notes on any web page while browsing the web. Now create, edit and maintain notes for any web page you visit or easily access all notes on a particular website.",
  "data/ph-top/2021/6/dhiwise-kotlin-builder.json": "DhiWise is a design-to-code platform for Android developers. Turn your Figma files into developer-friendly, production-ready App code at lightning speed.",
  "data/ph-top/2021/6/madgicx-budget-optimizer-for-fb.json": "Manually optimizing your Facebook ad budget is a complicated and time-consuming task that you should leave to the machines. Let Madgicx’s Autonomous Budget Optimizer do the ad buying for you to ensure your budget is allocated in the right way.",
  "data/ph-top/2021/6/hyperform-2.json": "Your websites, apps, APIs - hosted serverlessly. A single command deploys them to your cloud. ✔️ Free ✔️ Open Source ✔️ Works with AWS and Google Cloud",
  "data/ph-top/2021/6/company-culture-building-checklist.json": "I'm back with culture building template guys as I promised Check it out ➡ This template has Employee management Engagement tools🛠 & Surveys build in. Also, content on employee management and retention is also included Thanks for supporting. 🙌",
  "data/ph-top/2021/6/predictive-analytics-tool.json": "Without any need to programming Predictive Analytics Tool let users to apply following prediction methods to their *.csv or *.xlsx data: - Linear Regression - Logistic Regression - Decision Tree Classification Manuals and sample datas are included.",
  "data/ph-top/2021/6/lawzy.json": "An app that lets you ask a lawyer a question for just $40. Only in Florida (for now). New markets coming soon!",
  "data/ph-top/2021/6/dojo-panda.json": "Dojo Panda is a book subscription service for kids where we send a personalised box of books for your child, every month. Books are personalised based on the child’s age, prior exposure to books, reading level, interests and feedback from parents.",
  "data/ph-top/2021/6/mockly.json": "Check out Mockly!! The fastest way to generate, highly customisable yet stunning mockups for your ebooks and other files. Perfect for your PH/gumroad launches. PS: This is my first product launch on PH",
  "data/ph-top/2021/6/this-song-plants-trees.json": "Add this short (31 second) song to streaming playlists. All the $ generated goes to reforesting the world. Every ~100 streams we plant a tree. It's the world's first MP-Tree Offset your streaming",
  "data/ph-top/2021/6/bookmarked.json": "Create, share, and browse curated bookmark collections in your community. 🎉",
  "data/ph-top/2021/6/document-kit-for-pm-ui-ux-designer.json": "Introducing the Document Kit, a full set of Resource Template that make it easy to build, research or design a fully digital product. - 6 main phases - Showcase for each step - 25+ of customizable all documents - Regularly update the newest document templates",
  "data/ph-top/2021/6/hide-my-web.json": "Hide My Web is an chrome extension which will help you to hide, blur and highlight any webpage element with a single click of mouse. You can also hide your webpage title with Hide My Web. Visit our website to know more about Hide My Web.",
  "data/ph-top/2021/6/balanced-8f5dd227-93f1-4e9d-8df6-4b58eaed2fe3.json": "Balanced is a decentralized finance platform designed for ease of use. Swap assets on the ICON blockchain, and get paid Balance Tokens (BALN) to borrow assets or supply liquidity. BALN holders have the power to vote on platform changes and earn network fees.",
  "data/ph-top/2021/6/copy-paste-css.json": "👋 Hello! Here is my latest little project to help you find inspiration for your next button and box-shadow design. You can also find a link to some design systems. Yes, there is the Product Hunt button 🔥.",
  "data/ph-top/2021/6/prudentme.json": "Prudent is a desktop app that helps you automate and make sense of your personal financial ledger. Keep track of all your assets, liabilities, income and expense accounts. Get clarity on your choices, optimize your financials! All data stored on your computer.",
  "data/ph-top/2021/6/type-studio-screen-webcam-recorder.json": "The easiest way to record your screen & webcam online. Works on your Windows or Mac computer, no software download or plugin required. Polish the recording afterwards in our editor and share them directly online. All in a seamless workflow.",
  "data/ph-top/2021/6/due-work-1.json": "With due.work you can integrate a support widget with just 1 line code, from which your customer can raise tickets, create feedback and guide themselves using self serve guides.",
  "data/ph-top/2021/6/method-5.json": "Method 5 consists of 580+blocks in 11 popular categories to cover the most frequent designer requests. Just substitute your data in the code, choose the style you like, and get a ready-to-work website or landing page. Compatible with Figma, Sketch, ReactJS.",
  "data/ph-top/2021/6/reflective.json": "Reflective lets you build automated business workflows that keep humans in the loop so you can scale even the most complex, manual processes. No code required.",
  "data/ph-top/2021/6/hashtrends.json": "HashTrends app lets you find the trending topics in your digital space. Many things can happen around you. Be smart not to miss the things you want. With new startups coming up, managing an app for every platform & finding the right content is challenging.",
  "data/ph-top/2021/6/ppc-gear.json": "PPC Gear shows Where eCommerce professionals lose money in Google Ads. Find your Low performing campaigns and Quick ways to fix them—in just 30 seconds.",
  "data/ph-top/2021/6/100-days-of-seo.json": "Get a highly actionable SEO tip to your inbox each day and become an SEO guru in 100 days. All from 8+ years as an SEO expert.",
  "data/ph-top/2021/6/dimely.json": "Dimely is an app that enables you to willingly and transparently monetise your data. With Dimely, you can start earning a small passive income by willingly sharing your data in a way you're absolutely comfortable with. Invite your friends and earn much more.",
  "data/ph-top/2021/6/bulletlog.json": "Bullet log is a log aggregation and unification platform. Collect your application logs, Debug issues, Set alerts for business events and receive notifications on slack and email. We have a free developer version, please do try it and let us know.",
  "data/ph-top/2021/6/ig-live-to-youtube.json": "The IG Live to YouTube software automatically records & uploads Instagram creators livestreams directly to YouTube.",
  "data/ph-top/2021/6/notion-sites.json": "The all-in-one library for Notion Website Templates With these Templates you will be able to create your own Website/Portfolio quickly and easily with Notion.",
  "data/ph-top/2021/6/claritee.json": "Reduce time, money & RFC’s (Requests for change) by clarifying ideas at the beginning stage of any project with Claritee’s visual collaborative hub and smart wireframing options.",
  "data/ph-top/2021/6/mondrian-art-generator.json": "Hi Makers!🎨 I made open-source generator There's an endless number of options. - Thousands of beautiful color schemes. - Custom background color of the picture. - Any size of the picture. - Static or dynamic mode. - Jitter effect.",
  "data/ph-top/2021/6/portao-3.json": "Portão 3 helps companies in LATAM with their corporate travel, expenses and payments. From a timeline that recaps the entire trip to a BI for 100% control at the end. It's easy to understand expenses, manage them and save 30% on your company's travel costs.",
  "data/ph-top/2021/6/tinter.json": "Tinter is tiny web tool to generate color variation of images. tool also generate monochrome colors of images with multiple variants, without hampering the quality of image.",
  "data/ph-top/2021/6/portal-11.json": "Presenting Portal, a zero-config, p2p, encrypted, live folder syncing tool that respects yourgitignore! Perfect for syncing photos/videos/code between many devices without using a 3P tool like GitHub, Email, or Google Photos.",
  "data/ph-top/2021/6/flowly-2.json": "Flowly is a NIH-backed platform that teaches you to move from Pain State to Flow State: -Virtual Reality worlds designed to relax you -Biofeedback training for taking control of your nervous system -Data analytics to track progress Free Kit w/ membership.",
  "data/ph-top/2021/6/prosepen.json": "Prosepen is an all in one site for creative writers and readers. It featues a beautiful text editor and several social media features. Grow your writing and grow your following.",
  "data/ph-top/2021/6/calmframe.json": "Calmframe is a tiny web app that creates a text frame for your messenger profile picture – and maybe it will save your vacation",
  "data/ph-top/2021/6/60-startup-job-boards.json": "This Startup Job Board kit contains over 60 job board websites where founders can post their open roles. This list is useful for startup founders looking to post roles for: - Full-Time - Part-Time - Interns - Freelancers",
  "data/ph-top/2021/6/easy-diagram.json": "Basically I was struggling for build architecture diagram for a project, but honestly I dint fine any suitable solution, either it is not good or you have to pay a lot, bla bla So introducing https://zdiagram.surge.sh/ A simple free tool to create high quality project architecture, https://zdiagram.surge.sh/",
  "data/ph-top/2021/6/investor-database-for-startup-founders.json": "This investor database consists the data of 50 VCs and Angel investors along with their email address, firm details, linkedin, and locations. You can get this database for a one time fee, and start reaching out to these investors. Just work on the product 🚀",
  "data/ph-top/2021/6/screenflow-10.json": "ScreenFlow 10 has a completely new UI — refreshed for macOS Big Sur with a new customizable toolbar, reworked preferences windows, improved timeline track functionality and main menu organization.",
  "data/ph-top/2021/6/adsense-for-platforms.json": "Seamlessly integrate ads monetization with the web's leading scalable ads product. Platforms using AFP can integrate reporting into their native dashboard and create flexible revenue shares where Google pays both the platform and the end user directly.",
  "data/ph-top/2021/6/filmfinder.json": "Decide what to watch by starting a movie finding session. Set your preferences and find movies together, faster.",
  "data/ph-top/2021/6/call-me-if-you-get-lost-id-generator.json": "Celebrate Tyler, The Creator's latest album by creating your own matching Call Me If You Get Lost ID.",
  "data/ph-top/2021/6/sales-crm-by-cooby.json": "Cooby is a mobile-first sales CRM that helps you build a sales engine without a spreadsheet in minutes 👊. Segment clients, set keep-in-touch reminders, send personalized WhatsApp messages, get suggestions on contacts to reconnect with. Available on iOS.",
  "data/ph-top/2021/6/identid-me.json": "identid.me wants to help you get the job of your dreams, how? By helping you create a portfolio that makes you stand out from the crowd in less than 5 minutes. 🚀 PS: the platform it's free to use!",
  "data/ph-top/2021/6/applaunchpad-3-0.json": "AppLaunchpad is a Design tool to create stunning screenshots for App Store and Google Play. Feature highlight 1) Unlimited Layout & Device Frame color 2) Millions of Background Images powered by Unsplash 3) Localization 4) 100+ pre-built designer templates",
  "data/ph-top/2021/6/beach-nearby.json": "Know every beach in the world like a local. Navigate through thousands of crowdsourced data and find out the best beaches near you to enjoy the summer. https://beachnearby.com",
  "data/ph-top/2021/6/streamline-4-0.json": "Streamline 4.0 is the simplest way to find and adapt icons, illustrations, and emojis. It contains the most complete, consistent, and distinctive UI sets in a feature-rich app all under one roof. Get it for free.",
  "data/ph-top/2021/6/meetric.json": "Meetric is a Saas product connected to your calendar 📆, to easily write down meeting notes ✍️ and to-dos ✅ with anyone in the meeting 🧑‍🤝‍🧑.",
  "data/ph-top/2021/6/waydev-freemium.json": "Waydev helps engineering managers move from a feeling-driven to a data-driven approach. Waydev includes concrete metrics for your day to day activity and high level reports for executives. 👨‍💻 Waydev is providing more visibility into your teams' activity.",
  "data/ph-top/2021/6/glide-2-0.json": "Today we're announcing Glide 2.0. Nearly every aspect of Glide has been updated and refined, with delightful new capabilities for apps, powerful new features for our app builder, collaboration features for teams, and new templates designed for work.",
  "data/ph-top/2021/6/pitchlane.json": "The most effective way to increase conversion rates in outreach is by using personalization. Pitchlane makes it easy to create hundreds of personal videos in no time for your sales outreach.",
  "data/ph-top/2021/6/code-house.json": "Code House is the all-in-one storehouse for developer cheatsheets. Made up of 300+ curated cheatsheets from 230+ sources. Filter by categories or source, sort by time or popularity, dark mode, bookmarking, add new cheatsheets, request feature, and much more.",
  "data/ph-top/2021/6/today-12.json": "A simple, customizable, todo list that resets every 24 hours, allowing you to focus on the daily tasks that matter.",
  "data/ph-top/2021/6/lyfe-2.json": "Life is a chaotic mix of different events, habits and people. Lyfe is an AI-powered app that helps you understand what impacts your physical and mental wellbeing. It utilizes users’ digital footprint and makes sense of it using data science and AI.",
  "data/ph-top/2021/6/orbit-connect.json": "Turn your event, community or workspace into a true networking opportunity by providing attendees a quick and easy way to discover and connect each other, online and in-person.",
  "data/ph-top/2021/6/courseos.json": "📹 Manage all the Lessons, Courses, Students, Revenues and all the other elements for your next Course 🔥 Save hundreds of hours and dollars using only Notion 🎁 Take it completely for Free during the Launch",
  "data/ph-top/2021/6/postdates.json": "Get your stuff back from your ex (or whoever). Available now in NY + LA.",
  "data/ph-top/2021/6/dico.json": "Discharge developers from editing the wording: with Dico, everyone in your team can update the hardcoded strings of web apps.",
  "data/ph-top/2021/6/agencymax.json": "AgencyMAX was built by an agency, for agencies. It has all the tools needed to manage a creative agency in one place: project management, asset management, client portal, billing, analytics & time tracking.",
  "data/ph-top/2021/6/massless-media-api.json": "The Massless Media API speeds up development by offering a simple REST API for media creation, processing, and sharing. Rapidly prototype media applications with this API.",
  "data/ph-top/2021/6/telie.json": "Keep track of your show-watching journeys, connect with your friends through your latest binges, vote on what to watch in groups, collaborate on private and public lists, and send movie recommendations to friends in-app or through Instagram stories!",
  "data/ph-top/2021/6/surge-8.json": "Simple, single-command web publishing. Publish HTML, CSS, and JS for free, without leaving the command line. Deploy in seconds. Add a custom domain for free. Deploy something—anything—right now, for free:",
  "data/ph-top/2021/6/find-food-support-by-google.json": "Find Food Support connects people to food support resources, including hotlines, SNAP information, and a Google Maps locator tool that points people to their local food banks, food pantries and school meal program pickup locations, among other things.",
  "data/ph-top/2021/6/copilot-by-github-x-openai.json": "GitHub Copilot works alongside you directly in your editor, suggesting whole lines or entire functions for you. Powered by OpenAI its trained on billions of lines of public code, saving you time and helping you stay focused.",
  "data/ph-top/2021/6/google-street-discovery.json": "Discover 9,000+ beautiful Google street view locations across 195 countries.",
  "data/ph-top/2021/6/notion-freelancer-pack.json": "The Notion Freelancer Pack is a template pack, a system that has everything you need to successfully start, run and manage your entire freelance business from one place.",
  "data/ph-top/2021/6/imagenai.json": "Say goodbye to Lightroom presets, the future of photo editing is here. Meet ImagenAI, the only AI-powered personalized Lightroom editing assistant that edits just like you and cuts your editing time by 75%.",
  "data/ph-top/2021/6/munch-by-moving.json": "Munch's newsletter is not just a crypto newsletter. 🎉 Its your daily dose of munchable content from the crypto industry! 😎 We cut down on the noise by providing bit size crypto insights, trends, technical analysis down into a 5 minute read!",
  "data/ph-top/2021/6/huddle-say-it-with-video.json": "Video messaging for sharing personal moments with family & friends in a more meaningful way.",
  "data/ph-top/2021/6/payflow-2.json": "🤑 What's the best day of the month? When you get PAID!! 💸 We take this day and make it any day, that's Payflow 👷‍♀️ Employees: for free, instantly, privately, anytime 👔 Employers: boost productivity and wellbeing of staff with a benefit people truly want",
  "data/ph-top/2021/6/github-notion-sync.json": "Automatically synchronize all of your GitHub issues, labels and assignees with Notion. Synchronize multiple repositories. One click to set up.",
  "data/ph-top/2021/6/showell.json": "Award-winning sales enablement platform to manage, present, share, and track your sales content. Premiering now on all devices near you.",
  "data/ph-top/2021/6/online-video-templates-by-pixiko-com.json": "👉A video templates collection that are ready to be used for your next online video project. 💪Create a stunning video in few clicks: ads, promos, social media, personal use video and so on. 🤩Edit videos online faster than ever. No skills required!",
  "data/ph-top/2021/6/notion-resource-pack.json": "A hand curated collection of resources for anyone who use Notion.",
  "data/ph-top/2021/6/appcircle.json": "Automated mobile DevOps platform for continuous integration, continuous delivery and continuous testing of mobile apps for iOS, Android, React Native and Flutter. Appcircle provides enterprise-grade DevOps to everyone! No DevOps knowledge and no Mac needed!",
  "data/ph-top/2021/6/radix-colors.json": "Radix Colors is an accessible, open-source color system for designing gorgeous websites and apps. 28 colors scales with 12 steps in each scale. Dark mode support. Accessibility baked-in. Matching transparent variant for each scale.",
  "data/ph-top/2021/6/aligning-cs-sales-and-marketing.json": "In this step-by-step guide, you’ll learn: ✅ why a company-wide alignment is crucial, ✅ how you can completely align customer success, sales, and marketing teams, ✅ and how you can generate high quality leads and create successful customers.",
  "data/ph-top/2021/6/captain-stack.json": "Captain Stack is a VSCode extension, helps you to find snippets of code from StackOverflow right from your editor. You need to use VSCode Insider (the latest/non-stable VSCode). VSCode Insider is available at https://code.visualstudio.com/insiders/",
  "data/ph-top/2021/6/magic-links-by-sparkloop.json": "Add a Magic Link in any newsletter and let their readers opt-in to your email-list with just one click — for free! We completely remove friction from your opt-in process. So your newsletter sponsorships and cross-promotions get 20-50% more signups!",
  "data/ph-top/2021/6/verified-tweets-only.json": "All you got to do is check/uncheck to filter tweets from verified tweeple only! Works in the home feed, search results, tweet replies, and anywhere else tweets show up!",
  "data/ph-top/2021/6/xd-to-sketch-converter.json": "XD to Sketch Design Converter lets you convert, open, and import Xd designs in Sketch in seconds. 🚀 Today, all conversions are $0.99 only. https://avocode.com/convert-xd-to-sketch ❤️‍🔥",
  "data/ph-top/2021/6/kwayet.json": "Although that are several apps for team to communicate but they all lack the intuitiveness & convenience of WhatsApp and iMessage. ⠀ Kwayet brings the intuitiveness and convenience of WhatsApp & iMessage to your team and does not even require a phone number.",
  "data/ph-top/2021/6/de-journaliste-a-no-codeur-le-livre.json": "En 2019, j’ai eu la chance, de découvrir le No-Code et d’en devenir un porte-parole. Avec ce livre, je vous invite à plonger dans mon monde et je vous souhaite d’en ressortir avec les clefs pour bien commencer votre aventure No-Codienne.",
  "data/ph-top/2021/6/lernit-1.json": "Lernit offers a corporate platform that enables large and medium-sized companies to define and track key objectives, evaluate and train employees and determine their strengths and weaknesses to develop skills through personalized learning programs.",
  "data/ph-top/2021/6/bunch-6.json": "Bunch is a macOS app that turns plain text files into powerful automations, all available from a menu bar with full love for keyboard access. Launch/quit apps, change system settings, and automate the various contexts you work in.",
  "data/ph-top/2021/6/skiff.json": "Introducing Skiff 0.1. Skiff helps you collaborate on documents and notes with complete privacy. Share anonymous links, work with end-to-end encryption, and automatically expire access. ⠀ ⚡ Signup for free beta access today ––> skiff.org 🔥",
  "data/ph-top/2021/6/mini-video-me.json": "Mini Video Me helps you controlling your webcam during screen recordings so you can avoid covering important parts of the screen with your camera. You can also easily control the zoom, offset, camera shape, border color and hotkeys to reposition or resize.",
  "data/ph-top/2021/6/wrangle-for-slack.json": "👍 Wrangle is the easiest way to manage approval and ticketing workflows in Slack. Tame the chaos of busy channels and see why Slack chose Wrangle as a \"Featured App.\" Combine intake forms, approvals, and tasks into the workflow you need.",
  "data/ph-top/2021/6/sleepos-by-eight-sleep.json": "Meet SleepOS, the platform  for personalized sleep optimization. Explore new features like Smart Temp Autopilot, Health Insights, and Weekly Reports from the new Home Screen. https://www.eightsleep.com/sleepos/",
  "data/ph-top/2021/6/saas-pricing-calculator-2.json": "Your MVP is finished. All technical issues resolved. Everything is lined up for a launch except your pricing models. Indiebrands new freebie will help: 1) Compare different pricing models 2) Understand fees, taxes & yearly billing 3) Set goals & share"
}