{
  "data/ph-top/2022/8/relume-library-2-0.json": "Today we’re launching Libraries (aka. Relume Library 2.0)! What does this include? • You can now create, save and share your own Webflow component libraries. • Access to 275 Untiled UI Webflow components - our first community-made library.",
  "data/ph-top/2022/8/otherweb.json": "Read the news, discover podcasts and search the web -- without clickbait, eye catchers, autoplaying videos, paywalls, partisan echo-chambers, or whatever else digital marketers can come up with next.",
  "data/ph-top/2022/8/yolorekt.json": "Yolorekt is a decentralized short-term prediction market platform built on blockchain, promoting hyper-gamified social price prediction, and the most dynamic and intuitive user experiences available.",
  "data/ph-top/2022/8/docusaurus-2-0.json": "https://docusaurus.io/ helps you ship a top-notch documentation site in no time! &nbsp; Focus on your content: just write Markdown files! Put your site online in 5 minutes, then customize it. &nbsp; Full-featured: plugins, themes, search, blog, versioning, i18n, React...",
  "data/ph-top/2022/8/uchat.json": "UChat is a no-code chatbot builder that automates your business across 16+ social channels without coding! 👉 Omni channel + Unified inbox & ticketing system 👉 A.I Powered conversation 🔌 Built-in Ecommerce 👉 Mobile app for live chat 👉 Start free trial Now!",
  "data/ph-top/2022/8/polymath-robotics.json": "Design autonomous behaviors for industrial vehicles in simulation, using Python (not ROS). Whatever you design in simulation can be executed by a physical vehicle using the same code.",
  "data/ph-top/2022/8/keyviz.json": "Keyviz is a free and open-source software to visualize your ⌨️ keystrokes in real time! Let your audience know what handy shortcuts/keys you're pressing during your screencasts, presentations, collaborations, or whenever you need it.",
  "data/ph-top/2022/8/storebuddy.json": "Convert your instagram account/shop into a fully functional e-commerce website ready to receive orders. 👉 Signup 👉 Connect instagram account 👉 Done, lunched your e-commerce store Stores are customisable and able to connect with your custom domains.",
  "data/ph-top/2022/8/vibesition.json": "Vibesition allows you to create playlist that transitions from the vibe of one song to the vibe of another song using Spotify.",
  "data/ph-top/2022/8/maybuy-by-up.json": "Introducing Maybuy. A feature in the Up app designed to help young Aussies buy things they actually love, with money they actually have. Say goodbye to impulse purchases.",
  "data/ph-top/2022/8/remotebase-2.json": "A marketplace that matches startups with the top 1% of software engineers talent. Remotebase software engineers are thoroughly vetted and are available to hire immediately, at a fixed monthly cost. Engineers are matched with companies within 24 hours.",
  "data/ph-top/2022/8/threado.json": "Meet Theado - a powerful and actionable dashboard that goes beyond measuring engagement metrics. Get insights, automate workflows, and activate members across Slack, Discord, and other platforms. Unlock the 10x community builder in you. Try it for free!",
  "data/ph-top/2022/8/100ms-live-stream-sdk.json": "Effortlessly add two-way interactive live streams to your product. Let your users go live from any browser or app & invite fellow streamers or viewers as co-hosts. Get started in mins with Pre-built apps & create custom live experiences in your apps.",
  "data/ph-top/2022/8/backspace.json": "Backspace is simplifying online communities for creators. ⠀ Backspace replaces the overwhelming amount of platforms & tools traditionally used in the process of building, monetizing, & running your community by allowing you to natively do it all in one place.",
  "data/ph-top/2022/8/upon.json": "You need to catch your users’ attention in a snap. 💛 Using UpOn, you can quickly design and integrate an onboarding for any website! Improve user retention and effective engagement due to the ready-made templates.",
  "data/ph-top/2022/8/light-users-by-help-scout.json": "Introducing light users: a new user role in Help Scout with limited permissions at a lower per-user cost. Light users provide a unique opportunity for different teams across the business to drive impact with your customers—all in an affordable, scalable way.",
  "data/ph-top/2022/8/daybridge-public-beta.json": "There’s more to life than meetings. So we’re building something different. We’ll help you switch off from work, organise great trips, and keep track of your commitments. We want to make finding time with friends as easy as starting a group chat.",
  "data/ph-top/2022/8/guide-for-project-managers.json": "There are many ways to manage a project. We've collected all the useful resources for you in Notion. Hundreds of hand-picked resources are all in one place! Plus it's FREE.",
  "data/ph-top/2022/8/ballpark-research-template-library.json": "One-click access to 30+ templates for UX research, surveys, Figma prototypes and much more. Test everything from designs to copy and even design system components. Edit, remix and add your own branding and video instructions to make them your own.",
  "data/ph-top/2022/8/imgs.json": "Algorithms, ranking, ads, crazy videos of people dancing... We'll never have any of those. imgs is an online platform to share, discover and collect your favourite photography.",
  "data/ph-top/2022/8/queue-2d79f3b4-ec26-406b-9d5c-21a5c8a4e6ad.json": "🔥 New from Queue! 🔥 A marketplace to hire vetted freelance designers for your startup. Hire experts in UI/UX, Product, and even motion designers. Every designer is vetted throughly for expertise in User Experience, Design, and experience with startups.",
  "data/ph-top/2022/8/browserku.json": "Web scraping, screenshots, PDF generation should be as easy as a simple HTTP request, with no maintenance cost. Browserku makes this possible for everyone.",
  "data/ph-top/2022/8/article-rewriter.json": "AISEO's Article rewriter simply helps you with rewriting content while preserving the meaning of the content. It does this at a blazing speed, using GPT-3 and other AI engines.",
  "data/ph-top/2022/8/sms-marketing-templates-text-editor.json": "SMS marketing is the fastest-rising trend in ecommerce. This tool will show you just how simple SMS marketing can be. Click any template to copy it in your clipboard. Customize your template in our Text Editor. Preview exactly what your SMS contacts will see.",
  "data/ph-top/2022/8/link-6.json": "LINK is a mobile social app for the next generation. Invite friends to make group profiles, meet people based on your interests, and discover exclusive events nearby. Download now to join our 10,000+ users!",
  "data/ph-top/2022/8/500-pro-pitch-decks-by-slidddo.json": "Creating presentations from scratch? Take a look at the library with more than 500 ready-designed Pitch Deck slides. Explore, find the perfect slides and build stand-out presentations fast and easy.",
  "data/ph-top/2022/8/shuffles-by-pinterest.json": "Shuffles is a new app for creative play and collective collage. Cut out objects from images, create collages, and bring them to life with animation and effects.",
  "data/ph-top/2022/8/casama.json": "Casama lets you create crypto trade positions that can be funded and executed as a group in minutes – no browser extensions, no complex settings. So you can share trading ideas with your friends and get a management fee if it performs well."
}