{
  "data/ph-top/2021/4/wormhole-2.json": "Wormhole lets you share files with end-to-end encryption and a link that automatically expires.",
  "data/ph-top/2021/4/nuke-your-inbox-by-mailman.json": "Nuke button replies to all the pending emails telling them you'd get back to them in a few days. And then over the next few days, it shows you those emails (1-2 per day) so you can respond to them without getting overwhelmed. ⠀ Fastest way to inbox zero.",
  "data/ph-top/2021/4/the-table.json": "At JotForm, we’re all about ways to boost your productivity. Which is why we’ve taken a step back from online forms to focus on our newest product, The Table by JotForm: a state-of-the-art table with plenty of powerful features to meet your every need.",
  "data/ph-top/2021/4/rejoy-health-2.json": "Our physical therapists - augmented by Computer Vision powered App and proprietary wearable sensors - provide the best care for Muscle and Joint Pain. After proven outcomes in reducing pain, we have opened access to our pain management program for everyone.",
  "data/ph-top/2021/4/therappy.json": "Learn to better cope with stress and anxiety by mastering the basics of the CBT theory and by implementing that theory into your everyday life. Devote 20 minutes a day to yourself.",
  "data/ph-top/2021/4/nft-of-the-day.json": "Keep up to date with which NFTs are being sold the most and for the highest values 💰💰. It's also nice to see a random NFT every now and then just to know whats out there 👀",
  "data/ph-top/2021/4/pumpmygas-by-optimist.json": "The first gas tool for artists & collectors to better understand gas fees by platform. Gas fees change, and are different depending on what you’re doing, where, and at what speed. You can use the 🐢 and 🐇 at the top to toggle the speed of gas you want to use.",
  "data/ph-top/2021/4/gpt-3-custom-ai-voices.json": "Resemble AI’s new built-in integration with GPT-3 can generate realistic ad copy and conversations instantly. You can use the existing library of professional voices, or create your own custom AI voice, to generate high-quality voiceovers and dialogues.",
  "data/ph-top/2021/4/q-money-not-another-bank.json": "Q.Money is not another Bank - we connect all your accounts to become your money's ally. Please note: currently we support Banks in the following Countries: Spain, Portugal, Germany, UK, France.",
  "data/ph-top/2021/4/adept-school.json": "An online community where your degree doesn’t stand between you and your next position. We help self-taught developers and Bootcamp graduates build a network and find opportunities.",
  "data/ph-top/2021/4/1brand.json": "Brand growth software by 1Brand creates brand guideline websites with embedded brand asset management tools. Easy and accessible for in-house brands, with powerful features for agencies of all sizes.",
  "data/ph-top/2021/4/blogging-by-1mb.json": "Create your blog. Make it beautiful. Make it yours. Your personal space to tell your story, share your photos, or record what you love about life. Other 1MB members can follow your blog and like your blog posts. Your blog hosted on 1MB's fast & secure network.",
  "data/ph-top/2021/4/lou-3.json": "Lou makes it easy to proactively engage and retain users with interactive product announcements that take just minutes to launch & look built in-house. You can create beautiful no-code tooltips and announcements with Lou.",
  "data/ph-top/2021/4/dog-language-translator-by-toucan-bark.json": "Scientists at Toucan have been working diligently with leading researchers at BARK and are ready to unveil their groundbreaking achievement. Our furry friends have been our closest companions and now you can let them know - in their language.",
  "data/ph-top/2021/4/vera-co-browsing.json": "Cobrowse any website with your teammates! Vera co-browsing makes it possible for you to co-browse any website with your friend--to work on a Google Doc, to watch a video together-- free to chat as long as you want! More collaborative feature will be added!",
  "data/ph-top/2021/4/duolingo-roll.json": "Language learning is hard... so we made it soft. It's time to turn your bathroom into a classroom with our latest innovation: toilet paper that teaches you phrases in new languages! Never miss a lesson again, because nature is the best push notification.",
  "data/ph-top/2021/4/web-app-design-system-kit.json": "Deliver projects faster with a consistent framework of flexible Figma components. 💡 Core Components 🖊 Form Components 🔮 Library Styles 🍱 Table & Chart Components 🎬 Templates",
  "data/ph-top/2021/4/freehand-royale.json": "Freehand Royale is built directly into Freehand, our online whiteboard for everyone—bring joy to your day while challenging teammates to a good ‘ole fashioned game of space domination.",
  "data/ph-top/2021/4/writing-prompts.json": "Why struggle to come up with fresh writing prompts when you can get them in an instant? It makes a wide variety of topics and themes available at the touch of a button.",
  "data/ph-top/2021/4/pokedex-2.json": "Pokédex is a marketplace that lists 1 rare Pokémon card for sale each day. Cards span Base Set all the way through Battle Styles. Plus, every Saturday and Sunday we give one lucky winner a freebie that spans boxes, cards, and packs dating back to 1996.",
  "data/ph-top/2021/4/startweb-africa.json": "You can build your own professional website, landing pages or funnels in minutes with our easy to use templates. StartWeb also helps people with: - Domain Registration/Web Hosting - Custom Made Websites With Our Developers - CRM, Payment Integrations etc",
  "data/ph-top/2021/4/focuslite.json": "FocusLite blocks websites either by schedule, or by budget per day. (# visits + duration). For extra motivation, you can \"start a streak\" for a fee. If you lose the streak, you lose your money!",
  "data/ph-top/2021/4/verte.json": "https://useverte.com brings analytics to your Segment events in 3 easy steps: 📚 Connect your Segment account 📦 Choose a template 🔍 Select events Get started now at 👉 https://useverte.com 👈",
  "data/ph-top/2021/4/faang-shadi.json": "Finding your soulmate among the top tech companies, because you deserve no less.",
  "data/ph-top/2021/4/billable.json": "Billable helps you keep track of time spent on your projects. Simply select a project and start tracking your time. Beautifully organized per day, project and client.",
  "data/ph-top/2021/4/uniu.json": "What if you were paid to learn a skill? UniU is a newsletter that incentivises ambitious people to learn a new skill & apply what they're learning by offering crypto bounties for completing learning tasks. Information is nice, action changes everything.",
  "data/ph-top/2021/4/socialq.json": "SocialQ+ is a virtual social media superhero that lets you collaborate, schedule & analyze your posts for Facebook, Instagram, Twitter, telegram, reddit, tumblr, rss feed team member LinkedIn & Youtube from the same spot.",
  "data/ph-top/2021/4/preflight-c2431d6d-e301-4be6-8352-9899c4bd4a67.json": "Test the most important parts before developers release to reduce CS tickets. Reduce tickets with the tests and let us explain what went wrong to your developers",
  "data/ph-top/2021/4/growth-tweets.json": "A weekly updated collection of hand picked tweets specially tailored to save time and give great reading experience. Consider it as a new way to consume Twitter.",
  "data/ph-top/2021/4/bloo-lo-fi-wireframe-kit.json": "A large collection of ready to used library to design and prototype your ideas, faster. More than 250+ building blocks with 150+ screen template. Available for Figma, Sketch, XD",
  "data/ph-top/2021/4/resoume-v2.json": "Resoume is a platform where you can create a beautiful website, portfolio and resume for your next job interview. It is also the biggest project I worked on as a solo frontend developer with joy, love, sweat and tears 🙃 ❤ ️💦 🥺",
  "data/ph-top/2021/4/juststream-2-0.json": "JustStream can stream media and screencast to a TV, all the while maintaining a compact form with low CPU use. Broadcast your media in any format, any resolution (including Ultra HD), and most importantly, without the need for any cables.",
  "data/ph-top/2021/4/30k-under-30.json": "Today we are excited to announce a new project from Zeitgeist (zeitgeist.fm): 30K under 30! It's a self-nominated list of the 30,000 most influential people on the internet, as described by an AI. Nominate yourself for the list: 30Kunder30.com",
  "data/ph-top/2021/4/backprop.json": "Backprop is an API/platform that makes enhancing software with machine learning simple. With powerful out-of-the-box models, easy custom uploads, scalable infrastructure, and an affordable pricing scheme, Backprop has everything you need.",
  "data/ph-top/2021/4/lip-gloss.json": "Lip Gloss a Go library for designing terminal user interfaces. It takes an expressive, declarative approach to terminal rendering. Users familiar with CSS will feel right at home with Lip Gloss.",
  "data/ph-top/2021/4/rewardme.json": "RewardMe is a new way of reward program that helps you earn rewards automatically at your favourite merchants. By simply binding your email accounts or credit cards, you will automatically get rewarded on eligible purchases in cryptocurrency or reward dollars.",
  "data/ph-top/2021/4/cuely.json": "Do you work 10+ hours without taking breaks? You're not alone. Work breaks are simple and powerful yet we skip them because they're boring ⠀ Cuely uses behavior design, positive psychology and social support to make it fun so you can stay well and feel happier",
  "data/ph-top/2021/4/chrome-theme-studio.json": "Ever thought your browser theme was boring, bland, and just getting old? Add some color your daily browsing experience with a new custom theme for Google Chrome or Microsoft Edge! You can customize and control every single feature of your theme. Make it yours!",
  "data/ph-top/2021/4/webping.json": "webping.cloud is the easiest way to find the latency between you and all popular cloud data centers. All in a single page with simultaneous checks.",
  "data/ph-top/2021/4/breathly.json": "Breathly is a 100% free mobile app that helps you focus on your breathing. Use Breathly for daily relaxation and breath training: just choose a breathing technique and focus on the guided exercise. Breathly is free, with no trackers and no in-app purchases.",
  "data/ph-top/2021/4/reeview-for-shopify-sellers.json": "For Sellers: Automate the process of finding & collecting authentic product review videos from YouTube & new customers leading to more time on site and higher conversions. ⠀ For Shoppers: See instant social proof & experience a better product presentation.",
  "data/ph-top/2021/4/datature.json": "Datature is the fastest way to build your own computer vision models. Manage datasets, annotate, train, and deploy - we get ALL teams and companies on the right pipeline from day one!",
  "data/ph-top/2021/4/supabase-ui.json": "Supabase UI is a collection of UI components built in React and TailwindCSS that is used by Supabase to build our internal applications",
  "data/ph-top/2021/4/movie-of-the-night.json": "Insert any preferences you have such as streaming services, genres, keywords, actors, release years, age filters, runtime; and Movie of the Night will instantly find the best shows for you to start watching right away instead of browsing catalogs for hours.",
  "data/ph-top/2021/4/t-minus.json": "T-Minus is one of the best and most feature packed space launch tracking apps that gives you access to space related information, launches, events, news, rockets, agencies and more. Follow your favorite space agencies such as SpaceX, Rocket Lab, ULA and more.",
  "data/ph-top/2021/4/visible-hands-2.json": "Visible Hands is holding a virtual-first fellowship program supporting underrepresented talent in building venture-backed technology startups. Over the course of 14 weeks, we will provide fellows with company-building services and investments of up to $200k.",
  "data/ph-top/2021/4/daku.json": "View every product, get attracted to the product, if you like it we will take you to the Product Hunt page and you can see complete detailed info. about the product. With Daku, you can discover all new apps, games books, and podcasts on a daily basis",
  "data/ph-top/2021/4/remindee-2-0.json": "Capture leads with beautiful popups & turn them into attendees with automatic emails, when your event starts or when registration ends soon.",
  "data/ph-top/2021/4/nativeway.json": "Nativeway has an only one specific purpose. It's encouraging the language learner to make a speaking from the first learning day.",
  "data/ph-top/2021/4/operator-a894d115-cca8-4bb9-801f-6e0c30be54db.json": "Operator is an easy-to-use tool which allows you to create and maintain redirects in a simple and intuitive way. You can forward entire domains or manage redirects for your existing website/application by using one of our integrations.",
  "data/ph-top/2021/4/x100.json": "x100 — the app that counts. x100 helps you keep track of your reps during workouts. No need to count reps in your head anymore, let us do it for you. Relax, enjoy your workout music, watch the news or listen to an audiobook while x100 does the counting.",
  "data/ph-top/2021/4/gapt-ai.json": "Gapt.ai provide a similar GPT-3 API, with good performance, and we use a completely open source code and is low cost.",
  "data/ph-top/2021/4/insumo.json": "Insumo emails is your personalized productivity assistant that shows your calendar and cherry-picked habits to achieve your productivity goal in one simple email.",
  "data/ph-top/2021/4/tidio-3.json": "Tidio is an intuitive, no-coding chatbot tool that improves your live chat with automation that you can control.",
  "data/ph-top/2021/4/liquity-protocol.json": "Liquity is a decentralized borrowing protocol that offers interest-free liquidity against ETH as collateral. Loans are issued in LUSD — a USD pegged stablecoin, and need to maintain a minimum collateral ratio of only 110% due to a novel liquidation mechanism.",
  "data/ph-top/2021/4/missinglettr-3.json": "Create dozens of posts with a single click, curate the hottest content in your niche, and schedule your entire social output months in advance with Missinglettr.",
  "data/ph-top/2021/4/mailivery.json": "Mailivery makes sure your sales emails land in your prospects inboxes more often. We send AI-generated emails to our inboxes, then take them out of spam, mark them as trusted, and respond back to you. LAUNCH DEAL: https://mailivery.io/deals/product-hunt",
  "data/ph-top/2021/4/mock-api-generator-2.json": "Generate a REST API with read + write endpoints on top of a sample dataset in less than 30 secs. Customize your dataset with dozens of datatypes. Built for testing, BI demo data, prototypes and more.",
  "data/ph-top/2021/4/making-twitter-friends.json": "This 7-day email course will cover things from discovering your positioning, to creating a circle of people around you, to building relationships with human psychology. It is 1 email/day, featuring real-life examples and actionable actions each day.",
  "data/ph-top/2021/4/ux-challenges.json": "Stop reading about UX and actually try it out! 💪 Practice with real-world exercises. 🛠 Train yourself in crucial skills and tools. 💼 Take away portfolio-worthy deliverables. 👩🏻‍💻 Useful for beginners and experts alike.",
  "data/ph-top/2021/4/lottiefiles-mobile-app.json": "Test Lottie animations for mobile from the LottieFiles website, After Effects, or Adobe Animate plugins. Easily send animations as Lottie, GIF, or MP4 to your stakeholders. Access 1000s of Lottie animations anytime, anywhere, while on the go. And much more!",
  "data/ph-top/2021/4/blog-platform-by-labiblog.json": "Produce Engaging Content & Attract Sales-Ready Prospects. Blog Website Builder! Easy Setup! Custom Domain! Beautiful & User Friendly Design! SEO Tools to Optimize Content & Blog Posts. The best platform for your content marketing campaign.",
  "data/ph-top/2021/4/empathy-loss-companion-app.json": "The Empathy app empowers families and enables them to navigate the practicalities of loss at their own pace, with all the information and support they need - whether financial, legal, emotional, or logistical.",
  "data/ph-top/2021/4/nopass-me.json": "Verifying user identities requires writing tedious, repetitive code, risking catastrophic security breaches 😱. With NoPass.me, an open-source MFA verification solution, securely send and verify One-Time Passwords and ensure users are who they say they are!",
  "data/ph-top/2021/4/lenzgig.json": "LenzGig is an online marketplace for augmented reality work. We connect clients with world-class AR creators and developer. Want to launch your own AR filter on Facebook, Instagram or Snapchat? We got you covered! Simply post a gig and we'll handle the rest.",
  "data/ph-top/2021/4/luma-2.json": "Social media (and PH) are great places to share content, but it's hard to foster new relationships. We built Luma to help your community deepen relationships with events, newsletters, member profiles.",
  "data/ph-top/2021/4/kaboom-2.json": "Kaboom is a fun JavaScript game programming library / environment. https://replit.com/kaboom https://replit.com/kaboom https://kaboomjs.com/ https://github.com/replit/kaboom",
  "data/ph-top/2021/4/endtrial.json": "We automatically keep track of all your trials so you don't have to. We remind you to cancel your trial before it expires so you don't end up paying for a subscription you don't want!",
  "data/ph-top/2021/4/yesim.json": "YESIM is the most functional eSIM application in the world. Having only eSIM compatible device and YESIM App, you get an opportunity to connect mobile internet in 126+ countries in the world, without paying roaming fees or changing sim-cards.",
  "data/ph-top/2021/4/airtable-commerce.json": "Airtable Commerce is a starter kit that turns your Airtable database into an e-commerce platform. It comes with customer, order, and product management support, plus the ability to add buy now links to your website in seconds.",
  "data/ph-top/2021/4/mail-studio.json": "Mail Studio is a desktop application for creating responsive emails that look great everywhere. It combines visual and code editing elegantly, and is suitable for both designers and developers. It runs on Windows, macOS and Linux.",
  "data/ph-top/2021/4/resumemaker-online-2-0.json": "ResumeMaker.Online allows users to create a modern an effective resume in just minutes. No sign-up required, start now!",
  "data/ph-top/2021/4/iheart-adbuilder.json": "iHeart AdBuilder is a self-service audio advertising solution for small businesses. iHeart AdBuilder is powered by Jelli, the only programmatic solution for radio and an iHeartMedia company.",
  "data/ph-top/2021/4/presentations-by-canva.json": "Reimagine the presentation creation process. Start inspired with beautiful presentation templates, co-create in the same document in real time with your colleagues, and create a truly engaging presentation that can wow any audience.",
  "data/ph-top/2021/4/snippyly-2-0.json": "Snippyly is a privacy focused screen capture & collaboration tool. Instantly share your thoughts via a link. No more endless back & forth with your team or clients! No sign-up required. Now w/ full-page screenshot, library management & advanced share access.",
  "data/ph-top/2021/4/angle-audio.json": "Angle Audio is a free cross-platform social audio app for authentic group conversations. Join existing topics or start one yourself and enjoy features such as screen-sharing, text-chat and live-celebrations to connect with other users in audio conversations.",
  "data/ph-top/2021/4/evaboot.json": "On average 31% of your results on Sales Navigator do not match your filters. Turn your searches into clean lists of prospects in one click. Stop wasting hours cleaning spreadsheets.",
  "data/ph-top/2021/4/seoforlunch.json": "Never miss another Google update again. The #SEOForLunch is a free weekly newsletter that includes all the best SEO updates, articles and tools available to marketers.",
  "data/ph-top/2021/4/manufactory-illustration-constructor.json": "Illustration constructor is the simplest way to get unique stories about your dream team with amusing characters. Compatible with Figma and Sketch. PNG scenes are free.",
  "data/ph-top/2021/4/vossle-webar.json": "Vossle is a No-Code WebAR development SaaS platform with which businesses can create augmented reality in under 1 minute. It requires No-app downloads to experience world target, image target based campaigns, games or face detection based tryons.",
  "data/ph-top/2021/4/backgroundcut.json": "BackgroundCut is the fastest & easiest way to remove or replace any image's background. It uses Artificial Intelligence to analyze and cut out any image's background with a single click. Just upload your image and remove the background in under 5 seconds!",
  "data/ph-top/2021/4/setapp-stories.json": "A digest of cool tech stories going on around the globe – sent straight to your inbox. Fun, at-a-glance explainers of what’s up and why it matters. No more getting sucked into the Internet vortex of story after story, just open Setapp Stories & enjoy the gist!",
  "data/ph-top/2021/4/mintly.json": "Mintly is a hiring platform for the Jewellery community, globally. They help the Jewellery professionals to find jobs quickly and help the hiring manager to find and recruit the skilled professionals in the shortest time possible.",
  "data/ph-top/2021/4/upvote-bell-2-0.json": "Upvote Bell is the project management platform for Makers which launched their projects on Product Hunt. Project statistics, real-time notifications, tasks and notes board, hunters leaderboard - all for your perfect launch in one place.",
  "data/ph-top/2021/4/image-to-sketch.json": "ImagetoSketch: Convert images to sketches based on advanced AI technology. Never been so easy to add the pencil sketch effects to your photo, pictures or image in just one click. You can upload one image but get 10 different sketch effects on your image.",
  "data/ph-top/2021/4/company-accounts-by-userlist.json": "Does your SaaS product have multiple users per account, or multiple accounts per user? Unlike other email automation tools, Userlist now supports companies, and allows you to onboard and engage teams in a smart way.",
  "data/ph-top/2021/4/dash-10.json": "Dash is the culmination of a passion for sports & tech. For a long time I wanted to build something using Strava's API, so throughout the years Dash took many forms. Ultimately with the release of iOS 14, I knew this was the right opportunity to release it.",
  "data/ph-top/2021/4/mobile-app-website-no-code-builder.json": "Create a mobile app website in ⏳ 60 seconds using a no-code website generator! The template is open source on 📝 MIT license. You can use your Google Play/App Store marketing materials to fill the template.",
  "data/ph-top/2021/4/you-belong-in-tech-v1.json": "Bootcamp grads, self-taught techies, a pianist, comic book artist, and everything in between. Celebrating the wins, revealing the struggles, and sharing the learnings on how they landed their first roles in software engineering, design, & product management.",
  "data/ph-top/2021/4/selectorshub.json": "SelectorsHub is the Next Gen XPath tool to generate, write and verify the XPath and cssSelectors. It supports shadow dom, iframe, svg, dynamic elements, multi selectors generation and error handling. It is the only XPath tool available for all browsers.",
  "data/ph-top/2021/4/visto-qualify.json": "Want to immigrate to Canada? Visto Qualify is a free tool that will check your eligibility for more than 65 Canadian immigration programs in minutes. Built by Canadian immigration lawyers, it’s the quickest way to get started on your immigration journey!",
  "data/ph-top/2021/4/tapereal.json": "With TapeReal, you get a vibrant social community and a hot new marketplace for selling your EXCLUSIVE audio/video content. Start making money as early as today.",
  "data/ph-top/2021/4/office-pass-by-robin.json": "Robin is the first workplace platform that puts people before places. Today we're doubling down on that vision with updates that make flexible workplaces and hybrid work a key part of the Robin experience.",
  "data/ph-top/2021/4/brandmo.json": "Brandmo is a domain name marketplace & brand name discovery platform used by entrepreneurs and startups to find and acquire premium brand names.",
  "data/ph-top/2021/4/copykatai.json": "CopykatAI is a software, that helps you create better copywriting using Artificial Intelligence. Google Ad Headlines, product names, slogans or blog ideas - we got you covered. (we generated this text using CopykatAI) Available in over 15 languages!",
  "data/ph-top/2021/4/forget-spam-comment.json": "To prevent spam comments plugin blocks the default action path (wp-comments-post.php) for bots and make it accessible over unique hash query string when a visitor scroll to leave a comment. This way it prevents automated spam comment done by bots.",
  "data/ph-top/2021/4/savetweetvid.json": "Install it and click on the green download button to download any gif and video from twitter. - Free to use - Without any limits or ads",
  "data/ph-top/2021/4/visible-investor-database.json": "The investor database is a free community offering by Visible.vc, the makers of the Visible investor communication tool for startups. Use it to find investors to pitch your idea to. And filter by stage, region, industry focus, check size, and lead investors.",
  "data/ph-top/2021/4/welltory-3-0.json": "Welltory is like a health coach at your fingertips. Every day, it uses your data to create reports, charts & insights that show how your body works & how to feel better. 🔗 Just sync your fitness trackers & apps 💥 Let us unleash the power of your data",
  "data/ph-top/2021/4/hotline-3.json": "Facebook's Clubhouse competitor letting creators speak to an audience. Participants can ask questions through text or audio.",
  "data/ph-top/2021/4/routine-2.json": "Routine (YC W21) combines tasks, notes and calendar into one fast productivity app. ⚡️ Capture tasks and notes in one central place ⏳ Secure time to work on what is most important 🔗 Link information to time e.g meeting notes Give it a try: http://routine.co",
  "data/ph-top/2021/4/vagon-2-0.json": "Turn any device into a performance workstation with Vagon. Run all challenging software from any device with your own supercomputer on the cloud. Boost your creative performance with Vagon.",
  "data/ph-top/2021/4/predis-ai.json": "Predis.ai is an AI/ML product that helps Instagram Marketers craft better posts in half the time. Predis.ai gives: 1. Improvement suggestions for better engagement. 2. Curated hashtags and caption ideas to save a lot of crafting time.",
  "data/ph-top/2021/4/sentien-audio.json": "Sentien Audio is the audio headset you can wear all day and it does not block your ears. You can control your device through tap, gesture, and voice controls—all on Sentien Audio. Put it on in the morning and forget about wearing it. Just like your wristwatch.",
  "data/ph-top/2021/4/timecamp-2.json": "Track working hours and save more time for what's crucial for your business' success. Unlimited users, projects, and tasks, 100% free forever.",
  "data/ph-top/2021/4/stage-f7224c3c-c81a-4cf0-ae75-05c7ad48000e.json": "Stage is a browser-based editor for creating app wireframes. Visualize your ideas in minutes with ready-made blocks. Use a library of mobile patterns to kickstart ideation process. Share your project and export it to a design tool with a single click.",
  "data/ph-top/2021/4/have-i-been-zuckered.json": "Have I Been Zuckered: check if your telephone number is present within the Facebook data breach.",
  "data/ph-top/2021/4/flinkit-friends.json": "Flinkit Friends! is a new real world adventure game packed with codes to be cracked, clues to be uncovered, and puzzles to be solved. Battle Royale in the city. Fast, fun and easy to get going.",
  "data/ph-top/2021/4/balloon-7.json": "Balloon unlocks ideas, feedback, and insights from groups in record time by eliminating groupthink from collaboration and amplifying voices. Balloon reduces meeting time by 70%, and over 80% of the ideas and feedback shared on Balloon are brand new.",
  "data/ph-top/2021/4/productshot.json": "Make better performing product screenshots by keeping the focus where you want it to be. Use this free tool to quickly transform a screenshot of your product into a focused feature preview image. We found out that these screenshots performed much better. 🚀",
  "data/ph-top/2021/4/buildbites.json": "Get a dedicated Webflow dev to supercharge your side project, agency, or startup for one monthly fee with BuildBites.",
  "data/ph-top/2021/4/how-many-plants.json": "🌱 Comprehensive guides for all your favorite houseplants. 🪴 Deep dives for all your burning plant care questions. 🏺 Cool plant people & places, planter finds, design tips, and more.",
  "data/ph-top/2021/4/baseql.json": "BaseQL brings the power of GraphQL to Airtable, allowing you to query, filter and mutate records using a simple-yet-powerful Explorer. Integrate it easily with low-code and no-code applications! Join us on Slack: https://shorturl.at/nHR07",
  "data/ph-top/2021/4/g-profiler-by-granulate.json": "G-Profiler is an open-source continuous production code profiler that helps teams identify performance bottlenecks that hurt performance and raise costs. Using it development teams can optimize performance and reduce the cloud bill at the end of the month.",
  "data/ph-top/2021/4/flowrite-2.json": "Supercharge your daily communication by turning words into ready-to-send emails, messages & more. Flowrite works where you work, adapts to your daily tasks and personal style. Designed for the most productive, powered by the latest in AI.",
  "data/ph-top/2021/4/clever-ads-for-google-sheets.json": "Effortlessly get detailed information about your marketing data. All you have to do is choose your data source and we will put all of it into Google Sheets and create summaries of the data for you!",
  "data/ph-top/2021/4/tweepsbook.json": "Introducing TweepsBook, an enhanced bookmarking tool for power Twitter users that helps you streamline the clutter by adding different tags and organize tweets based on your liking. With TweepsBook, your time is well spent learning.",
  "data/ph-top/2021/4/doing-content-right.json": "Doing Content Right is a resource that covers everything you need to know about publishing online. In a sea of competition, this guide teaches you how to create, write, and scale successful blogs and newsletters, with a new bonus section on podcasting.",
  "data/ph-top/2021/4/purifier.json": "AI Assistant will change the background and filter extraneous noise in your online meetings in almost any video conferencing program. ⠀ You will be able to hold online meetings from a place that you do not want to show and remove the interfering noises.",
  "data/ph-top/2021/4/getkeywords.json": "The Internet is changing constantly, but somehow we feel that our SEO tools are still living in 2007 - Boring, Complicated & Outdated. GetKeywords provide Intent-Focused Keyword Research with 100k+ Locations around the world with Unlimited Free plan 🚀",
  "data/ph-top/2021/4/half-lemons-2.json": "Half Lemons is a clever iOS app that does the thing you’ve always wanted a recipe app to do -- serve up recipe ideas using the ingredients you have at home. Supercharge your cooking by unlocking the full potential of your ingredients.",
  "data/ph-top/2021/4/disbug.json": "Disbug is a chrome extension that lets you record screen with voice narration and post to jira along with technical logs with a click of a button. From QA to fixing, save huge time involved in bug fixing. Easier for testers, efficient for developers!",
  "data/ph-top/2021/4/found-dev.json": "Found.dev is much more than simply a job board. It is a platform for developers and the companies looking for them. Companies can post jobs and manage applications via the found.dev dashboard. Developers can create their own profile, search, and apply for jobs with a few clicks.",
  "data/ph-top/2021/4/deprocrastination-2-0-2.json": "Surfing instead of working? Getting distracted in the browser?   Our extension helps you set it up so that don't get side-tracked and stay on task.   You can set up healthy limits with Site Limits, Fun Zones (or Focus Zones), or Batch Rules and focus better!",
  "data/ph-top/2021/4/domain-picks.json": "Get 3 awesome domains that you can register for retail (non-premium) prices, everyday. Simple. All the domains shared are vetted for availability and their prices. Meaning, at the time of publishing the domain name is available at their retail price.",
  "data/ph-top/2021/4/automated-stand-ups-by-devfair.json": "devfair is where your remote development team interacts. We are building automated, dedicated meeting modes for stand-ups, planning, reviews, retrospectives and more.",
  "data/ph-top/2021/4/cro-tools-for-ecommerce-by-taplytics.json": "Protect ROAS, optimize checkout conversion, and drive customer LTV with a complete suite of A/B testing, analytics, and messaging tools built for Ecommerce. High performance tools for your development team. No-code tools for everyone else.",
  "data/ph-top/2021/4/ultimate-icon-pack.json": "This set includes replacement icons inicns andjpg format covering 250+ applications in 2 different styles. It's optimized for MacOS Big Sur and iOS 14.",
  "data/ph-top/2021/4/citonhub.json": "Citonhub is an all-in-one platform for developers to mentor, grow a community, and earn.",
  "data/ph-top/2021/4/sawo-labs.json": "A swift & secure authentication solution, to make your users login passwordless and OTPless. SAWO API gets in the backend of your website / Application, to make the on-boarding process quick, safe, and also saves 75% of your authentication cost.",
  "data/ph-top/2021/4/frontend-toolkit.json": "Frontend Toolkit is a collection of utilities for your repetitive frontend-related tasks. It is customizable and lets you set up everything according to your needs.",
  "data/ph-top/2021/4/fire-hunt.json": "Fire Hunt Finds you product launches from all over the web and serves it in a beautiful digestible form Now you don't need to switch websites to discover awesome product launches, From Product Hunt to Hacker news we cover product launches from the best sources",
  "data/ph-top/2021/4/duuce-v2.json": "Duuce is a dedicated marketplace to buy and sell newsletters. Start or sell your newsletter with Duuce - 100% free.",
  "data/ph-top/2021/4/path-3.json": "Path is a simple and free app that will help you put your decisions into context and make them more manageable. Use it to visualise the impact of each option on the parts of your life that are most important.",
  "data/ph-top/2021/4/vemari.json": "Vemari helps book creators unlock the value of their book notes. With Vemari, creators can write book notes, group those book notes into relevant themes, and share their book notes, via subscription or free, to their book circle.",
  "data/ph-top/2021/4/aicam.json": "AiCam turns old phone into an advanced tool to protect your home, your beloved ones and your pet. AiCam has smart alerts based on AI event detection, which runs offline to ensure complete data privacy. The app has recently gone live in Apple App Store.",
  "data/ph-top/2021/4/liso-1.json": "Your daily audio news digest 📬 🎧 Liso uses A.I. to scour the internet, finding and narrating the top trending stories and topics you love into a daily audio digest. Beta is out now on iOS, Android currently being baked, and an exciting roadmap under way.",
  "data/ph-top/2021/4/epicurious-interactive-cocktail-cabinet.json": "Find your new signature cocktail by clicking on up to three ingredients that you’d like to use in your next drink. Have a bottle of gin and a lemon? Some whiskey and sweet vermouth? Explore cocktail recipes for that and every other combination!",
  "data/ph-top/2021/4/xago.json": "XAgo is a simple iPhone application that helps you remember when was the last time you had a haircut, ate a veggie, called home, saw a movie, or posted on Product Hunt.",
  "data/ph-top/2021/4/crab-fit.json": "Crab Fit helps you fit your event around everyone's schedules. Simply create an event above and send the link to everyone that is participating. Results update live and you will be able to see a heat-map of when everyone is free.",
  "data/ph-top/2021/4/want-to-go-by-whstl.json": "Hello guys!👋🏼 These past 3 years I've been curating a list of 1160+ of the best spots in 30+ cities around the world. Filter through to find restaurants, bars, cafes, and other things to do. ⚡🚀Feel free to share with the world! ⚡🚀",
  "data/ph-top/2021/4/khuro.json": "Every piece of content is handpicked for you by your friends. You only see posts that your friends choose for you to see. With Khuro, you can - Easily choose which friends and friend groups see your posts. - Share photos with your friends. - Post your availability, plans, and thoughts.",
  "data/ph-top/2021/4/bereev.json": "https://bereev.com/?utm_source=product_hunt&utm_medium=website&utm_campaign=general is a Death Preparation App that helps you create a plan which will guide your loved ones when you're gone. 📝 Leave clear instructions 🗄 Upload important documents 💌 Leave messages for loved ones 👥 Invite sidekicks to view your plan",
  "data/ph-top/2021/4/omenu.json": "A unique cloud platform will help you create and manage e-menus, get feedback and increase sales! Sales in the restaurant will increase by 15% Visitors recommend you to their friends - it is a Wow effect!! You get customer feedback And any more!",
  "data/ph-top/2021/4/remotecamp.json": "People from different fields of activity, united by the desire to know themselves better, found their work & life balance here.",
  "data/ph-top/2021/4/brig-note.json": "Brig Note is your personal note-taking tool, combines recording and typing in an effective way. It gives you the possibility to record your voice during your lecture or any other kind of speech or event and taking notes over recording.",
  "data/ph-top/2021/4/hashtag-nfts-by-proof-of-culture.json": "We are the world’s first hashtag NFT. Instead of selling pre-designed art, we commission designers to craft something unique to represent every hashtag minted. Proof of Culture is the first major NFT project to enable customized art on the blockchain at scale.",
  "data/ph-top/2021/4/wozi.json": "Wozi helps you satisfy your sweet tooth with healthy foods you otherwise may not have enjoyed. It is a natural flavor enhancer that makes sour foods taste sweet, reduces their bitterness, and amplifies their flavor. Start healthier habits in just 30 seconds.",
  "data/ph-top/2021/4/emolog.json": "Emolog is easy to use! Select your emoji to sum up your day and record it, simple as that! You can fill in your diary as much as you want! If you don’t feel like it, just leave a title. You can also record your precious emotions within just a few seconds!",
  "data/ph-top/2021/4/launchsong.json": "Meritocratic music platform where the best music gets exposure not the best marketed music. As you rank songs you impact the elo ratings of songs which impacts how many other users see them. We also learn what you like and generate you custom playlists!",
  "data/ph-top/2021/4/watchpubs.json": "Bring a company to watch memes or learn new things on YouTube, listen to music on SoundCloud, or just play your favorite videos from anywhere. Built-in YouTube features (search, related videos, trends, video info)",
  "data/ph-top/2021/4/stacky.json": "Create a micro website for free. Instantly get a QR code or link to share. Have customers can a QR code at your restaurant table, share a link to your professional info or product catalog, have window shopping with QR codes, or anything you can think of.",
  "data/ph-top/2021/4/motive-realscore.json": "We are building the world's largest data service about the real impacts brands have on the issues that matter. We make it easy to find good products from good companies.",
  "data/ph-top/2021/4/ui-hut.json": "Download thousands of web templates, mobile app templates, illustrations, SVG icons, and graphic assets for Figma, Sketch, and Adobe XD.",
  "data/ph-top/2021/4/bazo.json": "When you know which company and where your website visitors come from, you can greet them in a more personal, authentic way. This helps you stand out from your competitors, make more sales, and add a human touch to online commerce.",
  "data/ph-top/2021/4/quolum-saas-card.json": "SaaS sprawl is out of control. Introducing Quolum SaaS Card. A corporate card exclusively for SaaS purchases. Track SaaS consumption and manage renewals. Whitelist vendors and cancel proactively. SaaS payments + consumption monitoring bundled.",
  "data/ph-top/2021/4/soft-ui-dashboard.json": "⭐ https://www.creative-tim.com/product/soft-ui-dashboard?ref=producthunt is a stunning admin template for Bootstrap 5. Made of hundred of elements, designed blocks, and fully coded pages, it is ready to help you create stunning websites and web apps. ✅ 70 frontend elements ✅ 7 example pages Get for free!",
  "data/ph-top/2021/4/fluent-1-0.json": "Fluent helps you learn French, Spanish, and Italian (soon) while you browse the web. Pick up new words while you read techcrunch, shitpost on twitter, or chat with buddies on messenger. Fluent makes learning every day addicting. Add Fluent to Chrome for free",
  "data/ph-top/2021/4/nocodez.json": "NoCodeZ AI converts your business story into an app. You write a business story. You can detail what you see in the app and how the app should work. Our AI converts your story into web, IOS and Android apps with complete infrastructure. It’s quick and easy.",
  "data/ph-top/2021/4/wave-2-0.json": "Wave is the ultimate Software as a Service starter kit built with Laravel. Version 2 has been rewritten and open-sourced. This project will allow you to create your own Software as a Service in record time 🚀",
  "data/ph-top/2021/4/lastbit-lite.json": "Lastbit Lite is the fastest way for Europeans to pay or get paid in Bitcoin or Euros. Send/Receive instant Bitcoin payments over the Lightning Network and manage your Bitcoin through Dollar Cost Averaging.",
  "data/ph-top/2021/4/rich-like-bill.json": "💸 Get rich like Bill Gates 💸 This is the tried and true way of guaranteeing yourself a chance at being a part of the 1% It requires immense dedication and commitment and if stuck to religiously then one will be able to make 0-133 Billion Dollars 💰 🤑",
  "data/ph-top/2021/4/startup-name.json": "Find a domain for your project A tool to ease the search because the existing tools recommendations always felt bad to me. I manually curated 100+ trending name modifiers for SAAS names and classified the TLDs and that's it no AI, no bullshit.",
  "data/ph-top/2021/4/daily-prompt-writing-app.json": "https://dailyprompt.co.uk/ provides creative writing prompts to help you beat writer’s block and kickstart your daily writing habit.",
  "data/ph-top/2021/4/readme-so.json": "Never forget a section for your readme again! Select sections to add to your readme, edit the contents, and drag to rearrange. See a live-updating rendered preview of your markdown, then download your README.md file!",
  "data/ph-top/2021/4/uniclix-social-media-scheduler.json": "Uniclix helps you centralize, manage and schedule your social media posts with a couple of clix. Uniclix supports Instagram Business accounts, Facebook Pages and Groups, Twitter, LinkedIn Profiles and Pages.",
  "data/ph-top/2021/4/acho-2-0-1.json": "Acho helps you create real-time data tables, and visual dashboards from flat files, applications and databases in a point-and-click GUI.",
  "data/ph-top/2021/4/cloudprint.json": "Owning a printer in your home is a thing of the past. They’re clunky and expensive! ⠀ With CloudPrint, you get your documents delivered to your doorstep with just a couple of clicks. ⠀ Stop asking your parents to print things for you. Start using CloudPrint.",
  "data/ph-top/2021/4/social-studio.json": "Artificial Intelligence will turn a FEW WORDS from you into hundreds of high-performing Instagram posts! Automate Your Entire Instagram Journey. Everything From Content & Designs To Images & Captions - All in A Matter of Minutes!",
  "data/ph-top/2021/4/chess-opener.json": "By connecting an openings database to the Lichess API, and using that to fetch instructive opening information, such as statistics and top games, I was able to create a web application where users can easily explore, analyse and practice chess openings.",
  "data/ph-top/2021/4/save-the-secret.json": "The tool estimates the number of trees that you have to plant in your country to delay global warming (following the Paris Agreement) and reduce earth's temperature rise to 1.5 ℃ by 2030. Reducing number of CO2 emissions-related deaths by 700,000 till 2030",
  "data/ph-top/2021/4/headers-me-2.json": "https://headers.me allows you to create matching cover images for the social media platforms you love without the need of any complex design tools or templates. Try the demo out for free, or step-up your game by upgrading to the Pro plan.",
  "data/ph-top/2021/4/sourcery-4.json": "Sourcery instantly reviews your Python code and refactors it, making it cleaner and more readable. It’s like having a pair programmer always working next to you. Install into PyCharm, VS Code, or your GitHub repos in 1 minute. It's free!",
  "data/ph-top/2021/4/whatis-2.json": "Whatis is the easiest way to manage your team's internal terminology, jargon, project names, and acronyms. Increase your team’s efficiency, decentralize knowledge management, and make onboarding easier for new employees - without leaving Slack!",
  "data/ph-top/2021/4/journeys-by-indicative.json": "Indicative's latest feature, Customer Journeys helps you discover the most common paths customers take through your product and towards conversion. Build Multipath Funnels and Cohorts based on how customers move through your product for further analysis.",
  "data/ph-top/2021/4/rattle.json": "Rattle is a sales collaboration platform that lets you manage Salesforce, collaborate on deals, and get actionable insights - all in Slack. Works great for B2B sales and customer success teams.",
  "data/ph-top/2021/4/the-2021-conversion-benchmark-report.json": "Find out what a good conversion rate is for 16 industries, and get easy-to-understand recommendations to build your highest-converting campaigns ever. With insights from 44k+ landing pages, and 33m+ conversions, start working with conversion intelligence.",
  "data/ph-top/2021/4/nucleus-ui.json": "Nucleus is a free UI component library that provides you the building blocks you need to design your next mobile app. More than 300 components and 30+ screens to help you protototype or create mockup in Figma at speed.",
  "data/ph-top/2021/4/zujonow-live-sdk.json": "ZujoNow Live SDK is a scalable live streaming API for the web, android, and iOS with the support of WebRTC, RTSP and RTMP and is compatible with OBS Studio, StreamYard OBS Studio, etc. ZujoNow Live helps you make your app more engaging and life much easier.",
  "data/ph-top/2021/4/visme-for-desktop.json": "Visme is the creative engine powering visual content for individuals & teams around the world. No matter their design background, anyone can create interactive branded content with Visme including presentations, infographics, social posts, or even videos.",
  "data/ph-top/2021/4/paywall-screens.json": "Everything you need to design the perfect iOS paywall screen. Get inspired by browsing a categorized collection of the best paywall screens in other apps. Design your own screen using the Figma template that includes dozens of examples and components.",
  "data/ph-top/2021/4/sourcery-pro.json": "A Mac App that extends Xcode with the ability to create your own live templates that understand your code structure. You can create any template you want but the app also comes bundled with many popular templates to get you started.",
  "data/ph-top/2021/4/state-of-saas-onboarding-2021.json": "Get inspiration, learn about best practices and latest trends in user onboarding. Use the data to get internal management buy-in for your optimization initiatives by showing your boss what the majority of successful SaaS businesses are already doing!",
  "data/ph-top/2021/4/cloudflare-pages.json": "Cloudflare Pages is a JAMstack platform for frontend developers to collaborate and deploy websites.",
  "data/ph-top/2021/4/willo-3.json": "The future of oral care is here. Willo, the first tooth-brushing robot for kids is now available. Our automated brushing system reinvents the way children clean their teeth, creating healthy habits for a healthy future 🌟",
  "data/ph-top/2021/4/11-fs-pulse.json": "11:FS Pulse is home to thousands of user journeys from the leading financial brands around the world. See where you stand and learn from the best. ⭐️ 4000+ Fintech journeys ⭐️ 500+ Brands ⭐️ 50+ countries covered",
  "data/ph-top/2021/4/vspace-2-0.json": "With VSpace you can create desktop-like spaces with useful links so you, teammates or your community don't waste time searching and sharing them. 👩‍💻👨‍💻 It's easy and boosts any workflow.",
  "data/ph-top/2021/4/documint-for-stacker.json": "Add powerful document generation to your Stacker applications with the Documint integration for Stacker.",
  "data/ph-top/2021/4/clever-ads-for-google-chat.json": "- Ask your Google Chat bot for metrics & graphs to evaluate the progress of your PPC campaigns - Filter Facebook Ads, Google Ads, Microsoft Ads based on your interests & get a glimpse at their performance - Coming soon: Alerts, Scheduled Reports & Tips",
  "data/ph-top/2021/4/hireterra.json": "Hireterra is a discreet, private and diverse job search platform for IT professionals looking for a career change in the USA",
  "data/ph-top/2021/4/1password-secrets-automation.json": "Built on the trusted security architecture of 1Password, Secrets Automation secures SSH keys, API tokens, and other infrastructure secrets and supplies them when and where they're needed.",
  "data/ph-top/2021/4/vitaely-me.json": "Vitaely.me allows you to create your own personal landing page in just two minutes by syncing data from your LinkedIn account.",
  "data/ph-top/2021/4/supreme-2-0.json": "Just scroll through your agenda to see the great things you've done in the past or plan far into the future. Oh, and if you didn't check something off today, Supreme will automatically bump it forward for you. Super simple.",
  "data/ph-top/2021/4/car-thing.json": "The smart player from Spotify that fills your car with music, news, entertainment, talk, and more.",
  "data/ph-top/2021/4/napkin-beta.json": "Napkin is the next-generation production-ready backend development tool in your browser. Fast, powerful code editor, zero configuration instant deployment, instant API endpoints, unlimited λ functions. No infra. No boilerplate. Just code.",
  "data/ph-top/2021/4/lofi-cafe.json": "Tune in to lofi.cafe to focus, work, study, or relax ✨ You'll find a curated selection of live lofi stations from YouTube, in a beautiful online player.",
  "data/ph-top/2021/4/thundra-sidekick.json": "Exploring your code is getting tougher every day. Thundra Sidekick provides a pro toolset for Application Debugging. Sidekick helps developers debug any application such as microservices with distributed architectures hosted on the cloud or on-premises.",
  "data/ph-top/2021/4/meeting-calculator-2.json": "Connect your Google calendar & see how much time you’re spending in meetings over the past year + 11 real-time stats from your calendar.",
  "data/ph-top/2021/4/landing-page-checklist.json": "Hi I’ Yucel from my very first product Landing Page Checklist. Landing Page Checklist is a curation website that provides over 100+ tools in 16 categories to help you to build your best landing pages. Please let me know if you have any questions :)",
  "data/ph-top/2021/4/propoze.json": "A new, improved way to do proposals. Designed and built for creatives and tech professionals. Slick and fast interface makes it a delight to build new proposals.",
  "data/ph-top/2021/4/backlink-checker.json": "The Free Backlink Checker is powered by its own backlink index, with billions of pages crawled on a daily basis. The tool allows you to track and analyze any site’s backlinks, see the historical stats, filter by nofollow/dofollow, and view anchor text data.",
  "data/ph-top/2021/4/leet-resumes.json": "We write everyone's resume for free! (Tips appreciated.) Since our beta launch, we've written resumes for engineers from thousands of companies. Users love us, and our average tip is $40. Now we're expanding to all professionals! Get your free resume today.",
  "data/ph-top/2021/4/nocode-job-board.json": "Hire best NoCoders and find your dream job in NoCode. For Free",
  "data/ph-top/2021/4/albacross-free.json": "We tell B2B start-ups (that’s you) which companies are visiting your website, what they are interested in, and when they are ready to buy. 500 company visitors per month. Native integration to Slack and Pipedrive. And yes, it’s always FREE and GDPR compliant.",
  "data/ph-top/2021/4/pico-2-0.json": "Pico offers essential tools to help creators make money. ⠀ Collect emails, sell subscriptions, and manage customer relationships at scale on your own domain. Understand your audience and unlock revenue growth.",
  "data/ph-top/2021/4/plasmic.json": "The visual frontend builder and web design tool that works seamlessly with your codebase. Unblock your team, and empower anyone to ship.",
  "data/ph-top/2021/4/squido.json": "squido aims to include everything needed to build and deploy a static website. No time wasted learning frameworks, writing code and play around with deployment. You simply write content, customize style/layout, build and deploy.",
  "data/ph-top/2021/4/inprivy.json": "Easily share confidential details with co-workers, clients or practically anyone.",
  "data/ph-top/2021/4/smart-invoice.json": "Smart Invoice turns invoicing on its head: - Sent at the beginning of the project instead of the end - Client pays up front - Funds remain in escrow and aren’t released until work is delivered - Built on Ethereum so payments are fast, secure, and cheap",
  "data/ph-top/2021/4/search-bar-shortcuts.json": "Sometimes typing a URL is faster than opening a bookmark. ⚡️Search Bar Shortcuts (Omnibox shortcuts) are built for people who often access some websites this way. The extension makes it even quicker, more reliable & predictable.",
  "data/ph-top/2021/4/all-in-one-freelancer-crm.json": "Everything you need to manage your business as a freelancer! With this amazing Notion Template, you could have a structured prospection process, manage projects with your clients, send personalized sales proposals and more! https://www.notion.so/All-in-One-Freelancer-CRM-f917232f62444398b2c4d0b5d24b92f5!!",
  "data/ph-top/2021/4/jxl-for-jira.json": "JXL combines the power of Jira with the familiarity of spreadsheets, allowing users to effortlessly manage all their work in one place. Ease of use, speed, and security are at the centre of the experience. You'll never want to go back. https://tcrn.ch/2RzhkjV",
  "data/ph-top/2021/4/muse-b0d3445e-a0b9-466f-a8ac-0cfeedd9fcaf.json": "Muse is a better way of collecting your niche news topics all in one place. We send a weekly newsletter packed with the best articles for your topics. Get the news you care about into your inbox, not from algorithms or news platforms.",
  "data/ph-top/2021/4/new-telegram-web.json": "Telegram messenger has released two new web versions of the application. They perform all basic functions and are available on mobile and desktop devices.",
  "data/ph-top/2021/4/calendso.json": "Calendso is the open source Calendly alternative. Self host it, or have it hosted by us. Integrate it seamlessly into your business with advanced customization and the open API. White-label by default, and designed to be a joy to use for you and your visitors.",
  "data/ph-top/2021/4/trove-40cf084a-d26a-4849-916b-1195e3145925.json": "Trove is a chrome extension that allows you to create highlights and comments across the internet and send them to Notion — without ever leaving your browser. Try Trove now for free!",
  "data/ph-top/2021/4/piktostory.json": "Want to boost engagement for your videos? Experience the power of document-like video editing with Piktostory. Turn your webinars, Zoom recordings, or virtual events into customized, bite-size clips ready to drive social media results.",
  "data/ph-top/2021/4/3d-business-characters-by-icons8.json": "Get fun, expressive 3D illustrations for your site without breaking the bank. Our searchable library of people in business environments makes it easy to find the perfect mascot for your brand. - Incredibly detailed - Various gestures and poses",
  "data/ph-top/2021/4/privacy-policy-template-by-juro.json": "With these design patterns by Juro and Stefania Passera, you can turn boring legal text into a transparent, engaging document that people can actually read.",
  "data/ph-top/2021/4/i-love-adaptive.json": "Without the presence of devices, it allows you to check the display of the site layout at the same time on several screens, as well as compare the layout with design layouts. We will tell you more about the capabilities of the service in the comments.",
  "data/ph-top/2021/4/approveit-2-0.json": "Speed up the approvals on quotes, access requests, docs, and time-offs. Initiate and respond to the approval requests right in Slack, view your team's approval history, customize your approval workflows, and integrate your favorite tools.",
  "data/ph-top/2021/4/bugout.json": "Bugout lets creators of APIs, libraries, and CLIs understand: ⠀ - Who their users are - How they use their software - What issues they face ⠀ All while respecting users' privacy. ⠀ If a user is having an issue, Bugout directs them to fixes in real time.",
  "data/ph-top/2021/4/afterglow.json": "Daily 15 minutes of Happiness, Warmth, Motivation, Curiosity, Fun, Inspiration with 2-minute podcasts from like-minded people and then you could help make 15 minutes better for others.",
  "data/ph-top/2021/4/bridgezero.json": "BridgeZero allows you to learn about over 100 long-term visa and residency programs you can leverage. Where will you remote work next?",
  "data/ph-top/2021/4/powertrade.json": "PowerTrade makes it easy to trade crypto options on your phone so you can buy Calls or Puts on the go 24/7. Not available in the US.",
  "data/ph-top/2021/4/beta-console.json": "Beta Console is a live list of every developer tool and beta early access release. We include the 2-3 most interesting in our weekly developer tools newsletter, but with 100+ active programs at any given time, this is the list of everything, updated daily.",
  "data/ph-top/2021/4/bshare.json": "BShare is a stand alone digital business card sharing application, perfect for business owners, contractors, freelancers, and other professionals who want to switch to digital business cards.",
  "data/ph-top/2021/4/betterwriter.json": "Simply install a Chrome Extension to write better and faster with GPT-3. Select any text and Generate better content ideas!",
  "data/ph-top/2021/4/super-simple-stories.json": "Super Simple Stories (SSS) by Setapp is a series of short videos on the latest tech news, narrated in a fun and entertaining way. We give you answers to all the questions you never had so you can have fun and be a fascinating human being.",
  "data/ph-top/2021/4/vidbix.json": "Vidbix enables your customers to explain their issues by recording their screen+voice without the need to install anything on their side. It’s faster to explain for your customers and gives all the context to your agents to solve issues faster and personally.",
  "data/ph-top/2021/4/dji-air-2s.json": "Featuring a 1-inch CMOS sensor, powerful autonomous functions, and a compact body weighing less than 600 g, DJI Air 2S is the ultimate drone for creators on the move.",
  "data/ph-top/2021/4/upnote-for-android.json": "UpNote is an elegant and powerful note-taking app that works across Android, Mac, Windows and iOS. Designed to make it easy to take notes and stay focused, UpNote combines a beautiful interface with a fluid workflow for a refined note-taking experience.",
  "data/ph-top/2021/4/input-kit-from-framer.json": "Say yes to real interactive inputs right on your canvas! Introducing the realer-than-real Input Kit: 32 customizable text and number inputs, triggers, and more. Check out the playground, open in Framer for free to bring native fidelity to all your prototypes.",
  "data/ph-top/2021/4/reddit-bests.json": "Reddit is one of the last remaining places on the Internet where you can find real product reviews. I created Reddit Bests to aggregate all these reviews in one place.",
  "data/ph-top/2021/4/ji-hn.json": "Ji.hn allows you to easily shorten links, and provide analytics, based on the audience’s location and platform data.",
  "data/ph-top/2021/4/beat-lock.json": "Got your beat stolen? Beat Lock is a free tool for beatmakers and producers that allows you to discover who is using your beat in music streaming services. You can upload a file from your desktop or even import it from a BeatStars URL.",
  "data/ph-top/2021/4/the-freelance-rate-calculator.json": "The Freelance Rate Calculator gives you a comprehensive understanding of your finances so you can make realistic goals for the future. ⠀ It does this by answering the most important question: “How much do you need to charge in order to sustain your lifestyle?”",
  "data/ph-top/2021/4/vacation-by-poolside-fm-2.json": "It’s with great pleasure we announce our largest undertaking yet… we've started a sunscreen company! Ever wanted to know what Poolside FM smells like? Want to smell like Summer of ‘86 in Summer of ’21? We've got you! Your early support would mean the world.",
  "data/ph-top/2021/4/timelapse-in-google-earth.json": "In the biggest update to Google Earth since 2017, you can now see our planet in an entirely new dimension — time. With Timelapse in Google Earth, 24 million satellite photos from the past 37 years have been compiled into an interactive 4D experience.",
  "data/ph-top/2021/4/spott-3.json": "With Spott, you can add interactive tags to images, videos and PDFs to make it easy for your visitors to take action. Spott's shoppable content helps thousands of e-commerce, brands, agencies and real estate companies get more out of their online content.",
  "data/ph-top/2021/4/vaxyes.json": "Congrats, you got the Covid-19 vaccine. Now save the record for free with VaxYes. In 3 easy steps you can get a secure, digital vaccine record that you can use for Travel, Live Shows, and Employers. Get your free, secure, verified digital vaccine card.",
  "data/ph-top/2021/4/cast-pranker.json": "Use this app to prank your household using chromecast! It's a basic page you can add text and paste images into and then cast them onto the TV while your family members are watching.",
  "data/ph-top/2021/4/keypup-2-0.json": "Monitor your development flow in one place from all your usual tools. Sorted & prioritized clean data aggregated in actionable automated boards. Easily track issues, PRs & actions required across your team and collaborate effectively on hot development tasks.",
  "data/ph-top/2021/4/travi.json": "Simplify your travel with Travi. Explore your travel destinations and bookmark your favorite things to do from activities to food options. Let us know your travel preferences and we will create a personalized itinerary to follow along day-by-day.",
  "data/ph-top/2021/4/replit-ventures.json": "Replit Ventures will give a grant of $2000 each to 4 startups and 1 non-profit (in Bitcoin) with a chance for more funding later on. They will have additional help with tools, mentorship, networking, and further fundraising.",
  "data/ph-top/2021/4/json-manipulator.json": "Discoverable Json essentially flattens your JSON data (however nested) into valid javascript expressions. With absolute javascript paths, you can easily search for the sliver of data you care about. Or, remove the data that are not relevant to you.",
  "data/ph-top/2021/4/needle-x3.json": "Monitor key phrases added or removed to specific sites: - Look for regulatory mentions on government sites. - Detect mentions of your brand, jobs, or specific tech terms on competitors. We’ll scan entire sites and send you simple change reports each day.",
  "data/ph-top/2021/4/growmeorganic-2.json": "Extract emails, phone no, address, website and a lot more from Instagram by hashtags, followers-following, media likers-commenters with GrowMeOrganic Instagram Scraper. Unlimited FREE trial & super easy to download and get started with.",
  "data/ph-top/2021/4/audiotorium.json": "Audiotorium is a free live audio app for location-based performances. Rediscover your neighborhood with this location-aware app and bring those block parties to life. Record stage performances in a new way and replay them as live with a new set of audiences.",
  "data/ph-top/2021/4/cutout-pro-1.json": "With AI Retouch tool provided by Cutout.Pro, you can instantaneously remove unwanted things including people, objects, animals, scratches, defects, skin blemishes, freckles, wrinkles, and pimples from pictures. Say goodbye to the Clone Stamp Tool in Photoshop!",
  "data/ph-top/2021/4/slash-e369429c-204b-4b1a-85d2-b88eec93c6f2.json": "With Slash, issue joint cards that you and your friends “co-own.” Spend a fraction of what you otherwise would on subscriptions by seamlessly splitting costs with friends.",
  "data/ph-top/2021/4/nama-chat.json": "NAMA is a messaging app that turns everyday texting into a language practicing tool. Invite a friend and start chatting in any of our 100 languages or enter the practice mode to study the words and phrases from your conversations.",
  "data/ph-top/2021/4/ovice-tour.json": "oVice provides 2D virtual spaces for remote teams, event hosts, academic institutions, and community managers. Fostering both social and business communication, oVice helps you create genuine conversations and customize your virtual communication experience.",
  "data/ph-top/2021/4/notion-meeting-notes.json": "A Notion system to keep track of tasks, ideas, info and events from your meetings.",
  "data/ph-top/2021/4/thinking-like-a-cto.json": "Topics covered within the book: - The Role of a CTO - Seven Phenomenons of Courage - If You Can’t Measure, You Can’t Manage - A Self-Taught Software Developer vs. a Scholar - Should CTOs Write Code? - Treating Everyone Equally - Attracting the Best Talent...",
  "data/ph-top/2021/4/liprospect.json": "LiProspect is a cloud-based Linkedin prospecting & humanized automation tool that helps you grow your network, build smart message flows and generate more leads from Linkedin fully automatically.",
  "data/ph-top/2021/4/which-frame.json": "🧠 Search a video *semantically* with OpenAI's CLIP neural network. ❓ Example: Which frame has a person with sunglasses and earphones? 🔍 Try searching with text, image, or text + image. 👇 Thread https://twitter.com/chuanenlin/status/1244260281632481280 https://twitter.com/chuanenlin/status/1383411082853683208",
  "data/ph-top/2021/4/js-image-carver.json": "Content-aware image resizer based on Seam Carving algorithm",
  "data/ph-top/2021/4/amalytics.json": "There are thousands of opportunities for entrepreneurs to make money on Amazon - as sellers, affiliates and producers. amalytics provides the data in an easy to use search engine format so you can find them in minutes.",
  "data/ph-top/2021/4/cryptorchids.json": "CryptOrchids is an NFT-based game where players must water their live CryptOrchid flowers exactly every 7 days. If a player misses their 3 hour weekly watering window, their digital flower dies, which prevents it from being sold.",
  "data/ph-top/2021/4/keychron-k12.json": "The Keychron K12 is a versatile 60% compact wireless Mechanical keyboard that thrives in tight space & comes with a hot-swappable option. One of the few 60% keyboards that is eminently optimized for Mac users, while still being compatible with Windows.",
  "data/ph-top/2021/4/startup-falcon.json": "Startup Falcon is a valuation calculator tool for early stage startups. Are you an entrepreneur? - Get quick, easy, reliable valuations. - Be prepared for negotiations with investors. - Reveal your strengths, tackle your weaknesses.",
  "data/ph-top/2021/4/their-news.json": "Their News is a news website that challenges your existing beliefs to break you out of your news bubble. You can better understand people with a different opinion if you are informed about their.news (badum tsss 🥁)",
  "data/ph-top/2021/4/100-in-100-challenge.json": "Get 100 new paying customers in 100 days. That's it. That's the challenge.",
  "data/ph-top/2021/4/personal-libraries-by-read-this-twice.json": "A neat new way to organize your book collection, create reading lists with your favorite books and share them with friends, family and the rest of the world.",
  "data/ph-top/2021/4/adgate-media-self-serve.json": "The AdGate Media Self-Serve ad platform allows app teams of all sizes & budgets to run rewarded user acquisition campaigns. Drive motivated app users to complete meaningful & measurable KPIs such as install, register, subscribe, purchase, or complete level X.",
  "data/ph-top/2021/4/building-mobile-apps-at-scale.json": "This book collects challenges engineers face when building iOS and Android apps at scale, and common ways to tackle these. By scale, we mean having numbers of users in the millions and being built by large engineering teams.",
  "data/ph-top/2021/4/blank-12.json": "Blank is a library of 200+ ready-to-use blocks in 8 popular categories, that covers the most commonly used subjects. Clean design and organized symbols. Compatible with Sketch and Figma.",
  "data/ph-top/2021/4/jupiter-28d29256-f27a-4e61-917f-3fe1f4470918.json": "Jupiter makes meal planning and grocery shopping easy with personalized recipe and product recommendations all delivered to your door. Our autopilot technology learns from your preferences so you eat better, waste less and save time on planning & shopping.",
  "data/ph-top/2021/4/syde-2.json": "Copy the same stocks C-Level Executives, Politicians, and 10% Equity-Owners are buying. PRODUCT HUNT OFFER: Get grand-fathered in to a \"forever free\" account by being one of our first 100 subscribers !",
  "data/ph-top/2021/4/zoom-with-me.json": "You will be the most professional Zoomer around your virtual block. Register your customonzoom.me oronzoom.video links and show it off.",
  "data/ph-top/2021/4/video-call-checklist.json": "Video Call Checklist is a light-hearted, easy-to-read guide containing tips that help reduce Zoom fatigue. Each tip in this guide is backed by research and hundreds of hours of our own experiences.",
  "data/ph-top/2021/4/flexmonster-desktop.json": "Compose professional reports with a self-service analytics tool. Just install, open, and start using it immediately. No extra knowledge in coding, SQL, or MS Excel is needed. Plus, it's free.",
  "data/ph-top/2021/4/flow-genius.json": "Convert Your Existing Website To Webflow. We know you're busy, so we build the website for you. Fixed pricing and no setup fees. Cancel anytime.",
  "data/ph-top/2021/4/spark-n.json": "Hey! We're excited to be on Product Hunt! Is your team suffering Zoom/Meet/Teams fatigue? Spark'n up with our unique 15min online experiences dropped into your next virtual team meeting — ignite creative thinking, foster team cohesion & stimulate productivity.",
  "data/ph-top/2021/4/curryish-2.json": "Deliver authentic home cooked meals from top rated home chefs around you in India",
  "data/ph-top/2021/4/ai-sales-email-assistant-by-reply.json": "Low on creativity? Tired of coming up with new templates day in and day out? Create effective and unique sales emails and follow-ups in seconds with Reply’s AI Sales Email Assistant powered by GPT-3, the world’s most advanced language generator 🚀",
  "data/ph-top/2021/4/report-cards-by-sharma-brands-x-tydo.json": "Nik Sharma wanted a free and simple performance report on his portfolio brands sent to his inbox daily, so we made it for him. Report Cards provides DTC operators a snapshot of their brand's performance daily, weekly and monthly.",
  "data/ph-top/2021/4/relate-1-0.json": "Relate is the open platform to create together on the web. Simple, intuitive, and visual environment for rapid web creation. Speaks native web, HTML/CSS/JS. Publish or export anywhere. Imports anything from anywhere. Complete openness—no vendor lock-in.",
  "data/ph-top/2021/4/troopl.json": "Troopl helps companies reach and hire remarkable people. Companies post jobs and a community of working professionals (called Scouts) endorse people they believe would be a perfect fit. Upon a sucessful hire, the Scout earns a reward.",
  "data/ph-top/2021/4/tinyvid.json": "Set your desired file size and TinyVid will make it happen. TinyVid is built to solve a very modern headache: getting a video to fit a file size limitation.",
  "data/ph-top/2021/4/inscribe.json": "Inscribe is an open protocol allowing anyone to “inscribe” rich metadata on ERC721 NFTs. We’re starting with verified signatures, so you can create memorabilia signed by your favourite influencer, or a digital collection of cool folks you've met!",
  "data/ph-top/2021/4/liro.json": "Liro is the iOS app that helps you to make videos more accessible and engaging by automatically recognizing voice-over and turning it into captions. Want your videos visually catchy and outstanding? Сhoose among captions' animation styles, colors, and fonts.",
  "data/ph-top/2021/4/cryptopoops.json": "CryptoPoops are adorable mischievous NFTs generated live at the time of minting on the Ethereum blockchain! They come in all shapes and sizes, but they’re the kind of Poops you want to have around 😘",
  "data/ph-top/2021/4/sunshine-social.json": "The average person has 7.6 social media profiles, but only allowed one link in their bio, use Sunshine Social to share all your social profiles and websites from one custom link grid.",
  "data/ph-top/2021/4/peachy-pay.json": "Peachy is ready to help you collect these payments at no upfront cost to you. We only get paid if you do. While we are limiting access to Peachy at this time, we are prioritizing providers who have past due bills they want to collect now for early onboarding.",
  "data/ph-top/2021/4/live-home-3d-4-0.json": "The biggest update to Live Home 3D since 2016 brings tons of new revolutionary changes. Making a house on a slope or a garden on mountain hills now becomes a reality.",
  "data/ph-top/2021/4/storyteller-2.json": "Storyteller is a no-code interactive tutorial builder. It can be used for product demonstrations or interactive product instructions to help promote products, as well as for teaching and remote instruction. Submit your email address to get early access!",
  "data/ph-top/2021/4/portico-1-0-for-ios.json": "Travel smarter with your ideas & plans all in one place…now on web & iOS! - Save places, webpages, emails...anything you need for your trip - Use the iOS share menu for ideas from Instagram and other apps - View your ideas on maps to optimize your plans",
  "data/ph-top/2021/4/payrequest-3-0.json": "It's time again for a new launch! In version 3 we launched a few nifty features like: real-time edit payment pages, create dynamic payment links, manage your customers and Zapier integration to make managing your business a lot easier!",
  "data/ph-top/2021/4/airtag-2.json": "Apple today introduced AirTag, a small and elegantly designed accessory that helps keep track of and find the items that matter most with Apple’s Find My app.",
  "data/ph-top/2021/4/new-imac.json": "iMac offers the best camera, mics, and speakers ever in a Mac, and Touch ID for the first time.",
  "data/ph-top/2021/4/visiotale.json": "Visiotale is a new online school for managers and entrepreneurs. We're happy to start our visual communication journey with the course PowerPoint 101. We're aimed to teach you to create eye-catching presentations. Hometasks feedback and freebies are included!",
  "data/ph-top/2021/4/balance-checkout.json": "Balance Checkout is the first self-serve checkout that accepts all B2B payment needs. From net term financing to invoicing to checks, your B2B customers can finally pay how they want - with just a few clicks.",
  "data/ph-top/2021/4/framer-app-for-windows-and-mac.json": "The all new Framer desktop app for Windows and Mac is here. And it’s completely free, with image exporting, real-time collaboration, and Smart Components. Get the prototyping power of the browser right on your desktop. Download now — https://bit.ly/3as5n67",
  "data/ph-top/2021/4/contentbot-ai.json": "Generate full blog posts or expand your content at the click of a button. Tweak it, edit it, add to it and you're good to go!",
  "data/ph-top/2021/4/anywhere-2.json": "Organize your work across teams. Save costs and exceed your goals. • Customize workflows to fit multiple teams • Automate repetitive jobs • Store your data structurally and query as needed • Integrate with other apps • Visualize your dashboards",
  "data/ph-top/2021/4/the-new-ipad-pro-2.json": "Apple today announced the most powerful and advanced iPad Pro ever, pushing the limits of what’s possible on iPad. The addition of the Apple-designed M1 chip delivers a massive leap in performance.",
  "data/ph-top/2021/4/pond5-free-collection-1.json": "Download thousands of free videos, images, and music tracks. We've handpicked some of the best work created by our global artist community so you can bring your vision to life. Create world-class content for your website, social media, and marketing campaigns.",
  "data/ph-top/2021/4/reworked.json": "Researching companies when you're job hunting is an absolute PAIN - both in time & energy. Well, NO MORE. With Reworked, you get: • Detailed ranking & analysis of companies across 38 parameters • All in a simple, intuitive & fresh interface",
  "data/ph-top/2021/4/prisma-orm.json": "Prisma is a next-generation ORM for Node.js and TypeScript! Prisma helps app developers build faster and make fewer errors with an open source ORM for PostgreSQL, MySQL, SQLite, and Microsoft SQL Server (Preview).",
  "data/ph-top/2021/4/fantasy-invest-daily.json": "Fantasy Invest Daily is a 1-minute newsletter. We cover the latest happenings in the world of trading & investing, but in a fun and easy way. Every new edition of the newsletter goes directly to your inbox.",
  "data/ph-top/2021/4/imgen-by-jitbit.json": "A simple free tool + API to auto generate \"cover images\" on the fly - Twitter cards, Facebook \"open graph\" images etc.",
  "data/ph-top/2021/4/sugarfree.json": "Wether you are no added sugar, or no sugars or trying to reduce your daily intake with one small step at a time, we can help you on your journey to be sugar free.",
  "data/ph-top/2021/4/pm-exercises.json": "PM Exercises provides everything you need to help you prepare for your product manager interview at tech companies. The site was initially launched as a blog is now a platform with many different features that helps PMs in their journey of preparing for their interviews.",
  "data/ph-top/2021/4/magnato.json": "Helping aspiring entrepreneurs learn everything they need to build their business - with the help of resources and a community for FREE!🤘",
  "data/ph-top/2021/4/bolt-one-click.json": "Bolt One Click is a simple, streamlined checkout for shoppers that enables a one-click checkout anywhere—no passwords, no usernames, no entering credit card numbers. The result? Shoppers convert at a 60% higher rate—good for retailers and great for shoppers.",
  "data/ph-top/2021/4/material-tailwind.json": "Material Tailwind is an easy to use components library for Tailwind CSS and Material Design. It features multiple React components, all written with Tailwind CSS classes and Material Design guidelines. Coming soon components for VueJS, Angular and many more.",
  "data/ph-top/2021/4/design-base.json": "Library of top rated curated design resources for developers. UI Inspirations, UI Resources, Icons, Fonts, Illustrations and much more...",
  "data/ph-top/2021/4/cookiehub.json": "CookieHub is a fully featured cookie consent solution with automatic cookie scanning, providing everything you need to get consent from your web visitors.",
  "data/ph-top/2021/4/space-era.json": "Simply point your iPhone or iPad to the Sky and get to know more about every object you can see. Check 120 000 stars, 1200 satellites tracked in real-time, constellations, Messier and Caldwell deep space objects, all Solar system and several meteor showers.",
  "data/ph-top/2021/4/figjam.json": "FigJam is an online whiteboard for teams to collaborate, brainstorm, map out flows, and more. FigJam is easy to learn and fun to use, so anyone can participate and share their ideas.",
  "data/ph-top/2021/4/alpaca-broker-api.json": "Alpaca Broker API allows us to offer each component of the brokerage service including opening accounts, booking money movements, giving out rewards, commission-free trading of U.S. stocks, fractional shares trading, and more.",
  "data/ph-top/2021/4/clerk-2.json": "https://www.clerk.dev/?ref=producthunt&utm_source=producthunt&utm_campaign=launch&utm_medium=desc adds secure authentication and user management to your React or Next.js app 🔒 Essential security features like 2 factor auth and device management 📈 Conversion-optimized Sign Up and Sign In forms 🎨 Built-in theming and open APIs for easy customization",
  "data/ph-top/2021/4/cold-email-templates-by-clientjoy.json": "A well written cold email can make a BIG difference. We have curated some amazing templates for you! They are Industry Standard, Battle-Tested and Simple yet Impactful. Use any of these Cold Email Templates that will surely get you a yes!",
  "data/ph-top/2021/4/formtestr.json": "FormTestr automates lead form testing to eliminate submission errors, boost leads, and increase revenue.",
  "data/ph-top/2021/4/human-cosmos.json": "Human Cosmos is an AI-driven assistant that combines mindfulness, psychology, human design and astrology to create special development plan for you to live better.",
  "data/ph-top/2021/4/lomi-home-composter.json": "Lomi is the world's first home composter that's able to break down bioplastics. Using heat, abrasion, and oxygen it is able to complete the composting process in as little as 4 hours - odor free and mess free.",
  "data/ph-top/2021/4/meco.json": "Enjoy your newsletters in an app built for mindful reading while giving your Gmail inbox space to breathe.",
  "data/ph-top/2021/4/beyta.json": "There are too many no-code tools out there, and all of them have wonderful templates. But, if you want to find the right template to launch quickly, you have to scan the entire internet! - Beyta helps - and we'll be actively updating our template list. :)",
  "data/ph-top/2021/4/storyset.json": "Awesome free customizable illustrations for your next project. Customize, animate and download illustrations to make incredible landing pages, app or presentations.",
  "data/ph-top/2021/4/autopsy-4.json": "Over 2000 failed company submissions covering founder stories and company failure analysis. To continue helping the startup ecosystem, submit your autopsy today: https://startup-research.typeform.com/to/fOrakq",
  "data/ph-top/2021/4/job-description-generator-3.json": "Our AI algorithm generates high-quality job descriptions to help businesses identify the right skills for a job, stand out and attract the best talent. Save up to 80% of your time: just type in a job title and get a compelling text in under 5 minutes! FREE!",
  "data/ph-top/2021/4/lemon-lab.json": "Lemon Lab brings together journalism and community reviews to surface quality health and wellness products. More tests, fewer lemons.",
  "data/ph-top/2021/4/superplate.json": "Superplate is a revolutionary CLI tool for frontend developers. It creates boilerplate projects in seconds, with no need for build configurations.",
  "data/ph-top/2021/4/ramenhacks.json": "Ramen Hacks is a curated collection of instant ramen hacks from across the Internet to help you make your ramen better. Transform your meals in 5 minutes!",
  "data/ph-top/2021/4/bendis-ui-library-by-shuffle.json": "Bendis UI Library for Shuffle Editor is modern and bold. It brings your site to life and adds a little fire to your projects. https://shuffle.dev/marketplace/bendis",
  "data/ph-top/2021/4/vilua.json": "Protect and optimize your health – long before warning signs appear! Find out your Health Index score and get true-to-you recommendations to improve your health for good. Then, watch your Health Index improve over time!",
  "data/ph-top/2021/4/httpdump-2.json": "HTTPDump gives you unique endpoints to dump data and inspect in real time. It also enables you to compare or mock response.",
  "data/ph-top/2021/4/wonderment.json": "Wonderment brings transparency back to shipping. Our order tracking platform gives eCommerce merchants a 360 degree view into their shipments, spots any shipping delays or issues automatically, and then enables brands to proactively communicate with customers about their order. 👉 Try it free: wonderment.com",
  "data/ph-top/2021/4/do-one-better.json": "A free one stop shop to inform you about the true cost of common goods, and provide sustainable, ethical, and more affordable alternatives. We take care of the heavy lifting by researching the good lifecycle, its ingredients, and finding brands you can trust.",
  "data/ph-top/2021/4/pictory.json": "Pictory AI converts your existing high value but low visibility long-form content such as blogs, webinars, customer interviews into dozens of short social video posts.",
  "data/ph-top/2021/4/meet-for-slack.json": "Start Google Meet instantly with one command right inside Slack. Use ‘/meet’ to set up a meeting, start it and send invitations. All at once. Works in personal DMs, group DMs and channels. Yes, this does one thing and does it really well 🚀",
  "data/ph-top/2021/4/wortharead.json": "Mainstream news sucks. And if we’re being honest, most non-mainstream news sucks too. Try Wortharead to discover newsletters and blogs that are *actually good*.",
  "data/ph-top/2021/4/slack-mood-check-in-by-troopr.json": "Know how your team is feeling every day, spot trends and take action. Troopr Check-ins for team mood is easy to set up, works completely in Slack, asynchronously and anonymously. Great way to care for your remote team.",
  "data/ph-top/2021/4/loop-b53e47dd-47db-4f34-957d-16f338dd4cca.json": "Loop creates chatroom from live Clubhouse rooms for speakers and listeners to interact in new ways. Share links, memes, roasts, and Twitter handles all in one place 😌",
  "data/ph-top/2021/4/travlee.json": "Plan more environmentally friendly journeys around the UK and help offset emissions by planting trees!",
  "data/ph-top/2021/4/notion-finance-tracker.json": "Give your expenses a break with this ‘Finance Template’. This Notion Template will give you the freedom to improve your financial decisions by ✅&nbsp;Essential expenses 🤔&nbsp;Discretionary expenses 🤑&nbsp;Savings 🎯&nbsp;Income distribution 💌&nbsp;Coupons 💶&nbsp;Receipts Get it now🔥",
  "data/ph-top/2021/4/cohere-voice.json": "Cohere Voice lets you talk to your customers, directly on your site. You can engage visitors with instant live video calls, and walk them through your site. All without your user leaving your site.",
  "data/ph-top/2021/4/stratum-wireframe-kit-for-figjam.json": "The Stratum Wireframe Kit is a library of components for wireframing in FigJam. Supports Auto Layouts and Variants. Free for everyone and forever.",
  "data/ph-top/2021/4/sounds-of-earth.json": "The Sounds of Earth project aims to raise awareness for the protection and restoration of our ecosystems by reminding people of the uniqueness and natural beauties of this planet.",
  "data/ph-top/2021/4/knugget.json": "Wikipedia, Blinkist and Anki go into a bar. They get drunk, they get down and whups - there it is. On knugget you can discover knowledge nuggets and keep them in mind with the help of spaced repetition.",
  "data/ph-top/2021/4/stanza-dev-1-0.json": "Stanza helps you to to improve your coding skills thanks to insightful code snippets, tech articles and technical tests repositories curated by the community 👩‍💻 🧑‍💻",
  "data/ph-top/2021/4/lockcard-a-new-dictionary.json": "Traditional dictionaries help you search words, but fail to make you retain them. ⠀ Lockcard is designed so that for every word you search, you are tested on how well you remember them over time, via quiz notifications. Download Lockcard now, it's free!",
  "data/ph-top/2021/4/wepik.json": "Create beautiful designs with Wepik's templates. Customize and download free templates to make stunning designs with online editing tool. Increase your reach by designing our customizable Instagram story templates.",
  "data/ph-top/2021/4/cusdis.json": "Cusdis is an open-source, lightweight (~5kb gzipped), privacy-friendly comment system.",
  "data/ph-top/2021/4/uxreviewer-io.json": "User Experience is the most crucial part of digital products. And it’s also the most often neglected. UXreviewer.io is here to change that. Get your UX report with concrete improvement ideas for your websites, iOS & Android apps, chatbots, and voice skills.",
  "data/ph-top/2021/4/snakker.json": "Snakker™ is a platform made to help you grow your business, audience, revenue, sales, clicks, likes, and loves. Whatever you want to get out, create a Snak™ in minutes, share it within seconds, and crucially: start receiving useful feedback instantly.",
  "data/ph-top/2021/4/emojise-0e552cde-2403-48e7-8461-b3991e29a81a.json": "Collect customer feedback and leads on your website, blog, or email, using the power and simplicity of emojis.",
  "data/ph-top/2021/4/chaos.json": "Chaos is a bookmarking app that lets you save any link, image or document. Use powerful features like infinite nesting and previews to seamlessly interact with your things. Your data is safely stored in the cloud, and accessible on desktop and the web.",
  "data/ph-top/2021/4/diagrams-net.json": "diagrams.net is an open source technology stack for building diagramming applications, and the world’s most widely used browser-based end-user diagramming software.",
  "data/ph-top/2021/4/getlocus.json": "Virtual rooms are like real ones where you can walk, talk and move objects. We offer many collaboration tools for teambuilding, brainstorming, lessons and other activities. GetLocus isn't a video chat, but a meeting space. Get your location in a digital world!",
  "data/ph-top/2021/4/memegine.json": "Memegine is the only full-text search engine for internet memes allowing you to search through millions of meme images from all places of the internet.",
  "data/ph-top/2021/4/add-to-calendar-link-generator.json": "Generate Add to Calendar links and event reminder buttons for Google Calendar, Outlook, Microsoft Office 365, Android, Apple and Yahoo Calendars.",
  "data/ph-top/2021/4/stumbled.json": "Stumble through the internet and discover random websites. Stumbled is a curated collection of anything interesting, weird or astonishing; websites of exceptional quality, sites to kill time or learn something new.",
  "data/ph-top/2021/4/qoooreman-vs-robinwho.json": "QoooreMan is an intriguing game from the investment world which can help you to understand the basics of the stock market and kick RobinWho’s butt. Download Qooore App to play QoooreMan.",
  "data/ph-top/2021/4/notion-scheduler.json": "Schedule your events, tasks and projects in Notion.",
  "data/ph-top/2021/4/ensemble-chat.json": "Ensemble makes it simple to start a chat-focused community that makes money from subscriptions. Packed with automated subscription management, integrated billing, custom branding, business analytics dashboard and unlimited users/chatrooms/history.",
  "data/ph-top/2021/4/scribe-ai.json": "Automate note-taking and share highlights of moments that matter. Record & transcribe any meeting Eliminate tedious note-taking Highlight & share moments that matter Skip meetings you don't need to attend",
  "data/ph-top/2021/4/fan-of-sleep.json": "Simple, customizable, white noise fan to help you get a better night’s sleep. Change your color scheme, set the speed, mix in nature sounds & zzz!",
  "data/ph-top/2021/4/alpe-audio.json": "Alpe Audio is a new kind of audio platform. Learning is a lifelong endeavor of discovery, curiosity, self, and career improvement. But in today's on-the-go lifestyle, there's no educational content for \"on-the-go\": the only time we have to absorb new content.",
  "data/ph-top/2021/4/iconduck.json": "Iconduck is a collection of 146 (and counting) open source icon and illustration sets. ⠀ They can be searched through and downloaded, and are available for personal and commercial purposes (depending on the license, some may request a backlink).",
  "data/ph-top/2021/4/restly-2.json": "We believe that sleep quality is closely connected with your mental wellbeing. Positive thinking is a new approach to improving sleep. Self-love, Personal growth, Love & Friendship, Stress & Anxiety, Financial stability - choose any category! Get some Rest! 💜",
  "data/ph-top/2021/4/box-piper-hacker-news.json": "An innovative and re-imagined version of HN for this decade. With an improved UI/UX, story mode like Snapchat, and a focus to design it in a \"202X\" way for instant HN content consumption. Also, a new https://twitter.com/boxpiperapp in town will keep you HN updated, once a day.",
  "data/ph-top/2021/4/pretrained-ai.json": "Configure and deploy your own private, hosted API endpoints to process text, images, and other data using state-of-the-art machine learning in a few clicks. Chain together one or more models to efficiently process and extract insights from your data.",
  "data/ph-top/2021/4/seotweets.json": "It's easy to fall behind in the world of SEO and it's important to stay informed. Twitter is a perfect place to stay connected BUT. There's a lot of noise. Enter: seotweets.io - Regularly curated SEO tweets from the brightest in the industry to keep you sharp.",
  "data/ph-top/2021/4/cinemate.json": "Get movie recommendations using AI. Choose the movies you love and the AI will immediately find recommendations based on over 100 million ratings in our database.",
  "data/ph-top/2021/4/avatar-u.json": "An open source library, with endless (well...kinda) combinations. Create your own avatar, have fun with it... be the one with funny glasses, a wild hair style or a sexy outfit. Custom components: 👄 Mouth, 👀 eyes, 👃 nose, 💇 hairstyle, 👗 outfit",
  "data/ph-top/2021/4/jarvis-by-conversion-ai.json": "Write better copy with artificial intelligence. Now with the long-form assistant, let Jarvis write your blog posts, social media posts, and even books. Breakthrough writer's block to create high-quality content at lightning speed with Conversion.ai.",
  "data/ph-top/2021/4/phigma.json": "https://www.phigma.app is a collection of 100+ Product Hunt templates for Figma. ✌️ Easy-to-use 🧩 Customize all colors, screenshots, & logo in a few clicks 🚀 Inspired by the best Product Hunt launches ⏰ Saves you 100s of hours on research & design Not affiliated with PH",
  "data/ph-top/2021/4/method-financial.json": "Method (YC S19) allows you to easily pay any of your users' debts – including credits card, student loans, car loans, and mortgages – all through a single API.",
  "data/ph-top/2021/4/startup-video-directory.json": "This curated directory of the best product videos features 40+ tech startups. It includes answers from the creators themselves and will bring you some inspiring insights.",
  "data/ph-top/2021/4/oyster-2-0-2.json": "Oyster is a distributed talent management platform that is rapidly revolutionising the way companies access the global talent market. With Oyster companies can hire employees compliantly around the world both as full-time employees and contractors.",
  "data/ph-top/2021/4/sshush.json": "Private chatrooms for founders are AWESOME! Start your own room or join existing ones and have the right conversations at the right time. Once a room has 10 founders in, it cannot be accessed by anyone else. Boost your startup and have fun!",
  "data/ph-top/2021/4/zluri.json": "Zluri is an enterprise SaaS Management Platform (SMP). It helps you discover, manage, optimize, and secure your SaaS applications from a single dashboard. In short, Zluri puts the IT teams back in control of their new SaaS-ified landscape",
  "data/ph-top/2021/4/bartender-4-3.json": "Bartender is an award-winning app for macOS that superpowers your menu bar, giving you total control over your menu bar items, what's displayed, and when, with menu bar items only showing when you need them.",
  "data/ph-top/2021/4/talk-3.json": "Talk is a free & open-source video conference app for the web. Works in all major browsers. No signups. No downloads. 100% peer-to-peer.",
  "data/ph-top/2021/4/this-is-tech.json": "30 illustrations in 3 categories about business, science, and cryptocurrency. Illustrate some technological processes in your project beautifully. Compatible with Sketch and Figma. All PNG files are free.",
  "data/ph-top/2021/4/adorable-link.json": "Emojis are everywhere, except in links. In fact, we solved that. Get you emoji-enabled link safe and fast. Options are infinite, your imagination is the limit. Use you adorable.link in shirts, profiles, ads and more.",
  "data/ph-top/2021/4/the-design-encyclopedia-for-figma.json": "The Design Encyclopedia is a Figma Design System containing thousands of meticulously documented UI tokens, UI components, page layouts, interaction patterns, and visualizations.",
  "data/ph-top/2021/4/controld.json": "ControlD allows you to block 15 categories of domains like malware, ads, social networks, adult content, IoT telemetry, as well as over 70 services so you can prevent them from harvesting your data or wasting your time.",
  "data/ph-top/2021/4/web-editor.json": "The web editor helps you to inspect any website elements, alter their properties, insert contents, design, and visualize the way you want to see them. You don’t need to hold a bunch of technical knowledge. Instead, this tool will do the job for you",
  "data/ph-top/2021/4/cooooookies.json": "GET OUR CHROME PLUGIN THAT TRACKS HOW MANY BROWSER COOKIES YOU’VE ACCEPTED. RACE TO ACCEPT AS MANY BROWSER COOKIES AS YOU POSSIBLY CAN. WIN 100LBS OF (REALLY REAL, WE SWEAR) COOKIES!",
  "data/ph-top/2021/4/uptimerobot-app-2-0.json": "Get notified for downtime! Set up, manage, & stay notified everywhere you go! Never miss a downtime or SSL problem again thanks to push and SMS notifications. Try the fully revamped mobile app for UptimeRobot: The world's leading uptime monitoring service.",
  "data/ph-top/2021/4/breakout-groups-by-whereby.json": "Breakout Groups lets hosts on all price plans start breakout sessions where participants can split into smaller groups. Perfect for working with your team or classmates, or hanging out with friends on Whereby.",
  "data/ph-top/2021/4/img-downloader.json": "Imdownloader is an all-in-one online tool that enables to you download images in bulk. First, you can bulk download images from any webpage by using a single Url. Then, you can bulk download images from Google Search engine. And, you can download images and videos from Instagram by copying the URL.",
  "data/ph-top/2021/4/paletter.json": "In today's world of simple designs, choosing the right colors matters more than ever. Paletter offers flexible controls that will help you find all the colors and variants you could ever need.",
  "data/ph-top/2021/4/vidiwise.json": "Boost your sales via instant video calls based on your customer behavior. Vidiwise is a no-code videocall platform that lets you connect with your visitors in just 1-click.",
  "data/ph-top/2021/4/cognitive-apps-api.json": "Cognitive Apps API solution is designed to help you merge mental health analytics into your existing workflow. Mood analysis, emotions detection, mental health state tracking. API solution works great for any service: whether you have web and mobile products.",
  "data/ph-top/2021/4/jotform-approvals.json": "Streamline your approval process. Collect requests, applications, and more with forms — and turn them into tasks in an automated approval flow. Respond to submissions fast, send automated emails, and track your approval process from any device.",
  "data/ph-top/2021/4/write-on-video-for-android.json": "Create beautiful and inspiring videos for your business. Write-on Video's rich features allow you to simplify your video production from start to finish. Once your video content is ready, share it on social media or export the project as a PDF storyboard.",
  "data/ph-top/2021/4/figma-design-system.json": "Figma Design System contains all the necessary elements to create interfaces of any complexity. Now you don't have to create every element from scratch. When creating this set we included all the latest Figma features.",
  "data/ph-top/2021/4/codingescape.json": "The very first escape game for coders and non-coders. An all-new coding experience. Play with your family, friends, or colleagues. Have fun as a team, 100% online, remotely or on-site. A fun mix of riddles and coding puzzles, in 12+ programming languages.",
  "data/ph-top/2021/4/avokaado.json": "Avokaado is a contract lifecycle management platform that helps businesses streamline their document workflow: templatize, draft, negotiate, approve and sign any document - all in one platform. Works great for B2B businesses and scale-ups.",
  "data/ph-top/2021/4/mighty-5.json": "Mighty is a faster browser that is entirely streamed from a powerful computer in the cloud. You can have 50+ tabs without your computer coming to a crawl, work without fan noise, Figma is 2x faster, and get more battery life.",
  "data/ph-top/2021/4/bionicwp.json": "BionicWP offers blazing fast managed hosting for WordPress sites ⚡ ⠀ - Site speed is monitored 24/7 (no one offers this!) - Unlimited edits - Unlimited free migrations - Managed updates (theme, core, plugins) - Custom dashboard - Try before you buy",
  "data/ph-top/2021/4/space-9e0d7ef1-dc3e-4f6f-9c38-43b26e24997f.json": "Host customer-facing audio townhalls, voice AMAs with your users, and then publish post-event podcast recaps with one click to drive engagement and get real-time conversational feedback — all in the comfort and familiarity of your own website.",
  "data/ph-top/2021/4/nextux-visual-editor.json": "NextUX makes it easy to capture full-page screenshots and add contextual comments on your website or web app. Cut up, rearrange, and add to existing designs or create designs from scratch. Share ideas and rapidly iterate in real-time on an infinite canvas.",
  "data/ph-top/2021/4/datamilk.json": "DataMilk is an AI driven tool which optimises user experience for E-Commerce stores, improving conversion rates and reducing abandonment rates. No coding/engineering skills required. Just a simple integration procedure and results.",
  "data/ph-top/2021/4/ad-report-by-pudding-ai.json": "Learn what helps and hurts your KPIs with automated ad performance reports, emailed directly to your inbox. Leverage Pudding’s AI and machine learning to understand what ads work for your products and for your audiences.",
  "data/ph-top/2021/4/every-org-donate-crypto.json": "Now anyone can easily and securely donate cryptocurrency to support any US charity and get a tax receipt. Every.org is a 501(c)(3) nonprofit that helps people donate. Nonprofits can also get a free \"Donate Crypto\" button for their website.",
  "data/ph-top/2021/4/wordable.json": "Wordable makes CMS uploads, optimization, and publication quick and easy. Save yourself time and rank better by instantly exporting your content, SEO elements, images, and more — directly from Google Docs (or HTML) to your CMS of choice.",
  "data/ph-top/2021/4/spotify-paid-subscriptions.json": "Simplest subscription setup ✔️ Increased revenue with ease ✔️ Your listeners, your community ✔️ Starting today, creators can sign up for access to paid subscriptions Anchor and enjoy no platform fees: http://anch.co/paidsubssignup",
  "data/ph-top/2021/4/client-onboarding-kit-for-notion.json": "An easy-to-use, time-saving, no-nonsense kit for small agencies and freelancers looking to have better documentation, security and process for big fish clients. • Client Dashboard Template • Document Generator • Project Board & Timeline • and much more!",
  "data/ph-top/2021/4/butter-4.json": "Put your energy back into having delightful and collaborative sessions all from one place with Butter. ⠀ Comes with built-in agenda, polls, breakouts, Miro, fun reactions, sounds, and many more!",
  "data/ph-top/2021/4/juphy.json": "📥 Unified inbox to manage multiple clients ⠀ ⭐️ Ranked among the top 5 in terms of \"Ease of Use\" & \"Quality of Support\". ⠀ 🏃🏻‍♀️ Ideal for agencies, freelancers, and small businesses who would like to simplify customer support and improve their responsiveness.",
  "data/ph-top/2021/4/instant-3a9422b7-438c-4027-bdf5-57720c12c9cf.json": "Instant is a frictionless 1-click checkout for WooCommerce stores, built to increase sales for online sellers. 1st time users fill out a short form at checkout; returning users get 1-click checkout on any Instant enabled store. ‍ Get started— https://getinstant.co/ ⚡️",
  "data/ph-top/2021/4/stacks-accelerator.json": "We invest $50k in outstanding startup teams building on the Bitcoin network with Stacks (formerly Blockstack). Speakers & Mentors include Eric Ries, Meltem Demirors, Thomas France, Sergey Nazarov, +more. We accept startups at any stage and help you level up.",
  "data/ph-top/2021/4/devbook.json": "Devbook is a search engine for developers that helps them to find the resources they need and answer their questions faster. Fast, accessible right from a code editor, and fully controllable with just a keyboard.",
  "data/ph-top/2021/4/csml-playground.json": "Design, build, and test rich conversational experiences using CSML (Conversational Standard Meta Language) straight from your browser with the brand new open playground. Share your chatbot code on the fly, no login required.",
  "data/ph-top/2021/4/zestack.json": "Zestack is the \"Stack Overflow\" for marketing & growth strategies. Our 500+ strong community is focussed on helping each other learn and implement practical growth campaigns. Why wait? Join now for free.",
  "data/ph-top/2021/4/codemap-2-0.json": "Codemap is the world's first freelance marketplace for no-code/low-code and automation. Describe your project using our smart brief and we'll match you with top, pre-vetted no-code experts & teams. Launch your product, tool, or workflow in days or weeks!",
  "data/ph-top/2021/4/mockup-generator-by-pixeltrue.json": "With Mockup Generator you can create beautiful product mockups in just a few clicks! Completely free. With over 30 different mockups on 5 device types you'll have enough material to create beautiful product mockups for your projects and marketing campaigns.",
  "data/ph-top/2021/4/arc-2-0.json": "The one-stop-shop for developers looking for remote jobs. Arc aggregates the world's remote opportunities and generates a list of best-fit jobs for you. Get support & level up your career by joining Arc's remote developer community.",
  "data/ph-top/2021/4/immersive-scenes-by-virtualoffice-2.json": "Create branded scenes for Zoom's Immersive View. Simply select a scene, upload your logo and voilà - your Virtual Office is ready to work with Zoom's new Immersive View!",
  "data/ph-top/2021/4/product-virality.json": "In this free ebook, you’ll learn: ✅ why exactly you should go “viral”, ✅ different types of product virality, ✅ the making of a viral product, ✅ tons of real world examples, ✅ and actionable strategies and tips you can implement today.",
  "data/ph-top/2021/4/powerben-powerbank.json": "Truly ready-to-go backup power by your hand. Combined with a super large battery capacity of 24000mAh, you can get your iPhone 12 capacity in ONLY 3 minutes! Charging your PowerBen using a car, solar power, AC Adapter, or PD Adapter.",
  "data/ph-top/2021/4/mars26.json": "Mars26 is an open source Mars map in high-resolution, natural color. Built on top of previous CTX & Viking satellite photography, merged into an interactive map with full coverage. Zoom in, explore and place tweets at your favorite Mars locations.",
  "data/ph-top/2021/4/instagram-engagement-report-2021.json": "We analyzed over 100 million Instagram posts shared across 1 million users to give you the most complete, up-to-date resource on Instagram marketing - for free. Instead of guessing what works, rely on our data and expertise to make sure your Instagram strategy is fully optimized and up-to-date.",
  "data/ph-top/2021/4/sellou.json": "Sellou redesigns the way we buy and sell online! 📦💰 Discover people all over the world 🌎 🌍 selling products, and display your products for sale on Sellou. This is our open beta, so we would greatly appreciate your feedback! 🙌 Sign up https://sellou.com",
  "data/ph-top/2021/4/frido.json": "Frido is a to-do app designed to free you from the burden of creating endless to-do lists you eventually give up on.",
  "data/ph-top/2021/4/glitch-instant-sites.json": "Create & launch a real, full-stack or static site at a live URL using frameworks like React or Eleventy, all in under a minute in your browser — for free. Glitch lets you make a site faster & easier than a no-code tool or site builder, but with no lock-in.",
  "data/ph-top/2021/4/bookshlf-2.json": "Unlimited access to digital content has provided us with an enormous opportunity to discover, learn and grow. Bookshlf focuses on quality and taste, empowering creators (Curators) to monetize their knowledge and expertise by sharing the content they love.",
  "data/ph-top/2021/4/email-verify-api.json": "Accurate API to validate email addresses in a simple GET request. Easily detect disposable emails, verify mailbox is active.",
  "data/ph-top/2021/4/face-generator.json": "Craft the perfect face to represent your next project. Face Generator lets you dial-in the features and emotions you want from your virtual identity, then generate them in real-time!",
  "data/ph-top/2021/4/the-saas-cpo-checklist.json": "We’ve packaged 8+ years of R&D & 100s of data viz projects in this comprehensive checklist to help you create differentiated, scalable dashboards for your users 📊 Use it to reduce the complexity, cost & time to value of your analytics projects 💪 Enjoy 🤩",
  "data/ph-top/2021/4/notea.json": "Notea is a Self hosted Note taking app stored on S3, that you can deploy with one click to Vercel, AWS, or deploy with Docker 🐳. It supports storage in Amazon S3, MinIO, Aliyun OSS and others. It's powered by TypeScript 🚀 and loves Mark Down.",
  "data/ph-top/2021/4/moni-talks-2.json": "Moni Talks 🌶 is a daily crypto newsletter with tons of content handpicked from 400+ resources and delivered to your inbox as a 5-min report. Every freaking day. Don’t miss next 100x projects and F🤐CK FOMO. btw, our Twitter: https://twitter.com/getmoni_talks",
  "data/ph-top/2021/4/bigvu-wordtrim.json": "With BIGVU, cut your talking videos in a snap, record with our teleprompter app or import a file. Your video is automatically transcribed. You just need to select the words where you want your video to start and end. It’s fast and easy. All from your Phone.",
  "data/ph-top/2021/4/emaily.json": "Sick and tired of writing long emails? Emaily is an easy-to-use service for creating professional emails in two clicks. Get suggestions for any purpose like cold email, job offer, newsletter, etc. Learn more — https://emaily.app/",
  "data/ph-top/2021/4/rare-things-beta.json": "Rare Things brings you short-form video shopping from world-class artisans. Shop limited collections and step into the studio workshops of expert ceramicists, metalsmiths, woodworkers, textile artists, leather crafters, and seamstresses from around the globe.",
  "data/ph-top/2021/4/product-market-fit-toolkit.json": "This toolkit is made by salesfit.io. It lets you measure and improve product-market fit using data automatically collected during a purchase process (you can use different data though - their manual helps you to choose the right metric).",
  "data/ph-top/2021/4/revops-cashflow-api.json": "Deliver value faster without the headache of account provisioning, billing setup, and onboarding communications.",
  "data/ph-top/2021/4/lean-incubator.json": "A work system template to incubate & manage your idea development.",
  "data/ph-top/2021/4/skio.json": "Skio helps Shopify merchants sell subscriptions and give group discounts.",
  "data/ph-top/2021/4/ubiq-security.json": "We simplify encryption for developers. Encryption is hard to get right and very easy to get wrong, that’s why we built Ubiq, an entirely API-based SaaS platform that enables developers to build encryption directly into their applications with a few lines of code and 2 API calls.",
  "data/ph-top/2021/4/prox.json": "Prox is a curated network of top experts from best selling authors, TEDx speakers, business advisors, influencers, and content creators. Get personalized advice, real insight, and timely answers from people who have proven related success.",
  "data/ph-top/2021/4/jira-work-management.json": "Jira Work Management is a new friendly and intuitive way for business teams to access the power of Jira with new functionality built for modern styles of collaboration.",
  "data/ph-top/2021/4/make-rs.json": "This is a place where makers show the world what they've made. It's a different kind of profile page where it's not about the companies you worked for but what you've done.",
  "data/ph-top/2021/4/ping-15.json": "Ping allows for spontaneous, drop-in audio chats with your team. Ad hoc meetings don't need scheduling and copy pasted Zoom links. See a teammate is live on ping? Simply click on their icon to talk to them instantly! Now available for free!",
  "data/ph-top/2021/4/skotty.json": "Skotty enhances your communication with clients using smart modular blocks. A block can be anything from a file or message, to a file-request, signature or a video-call. You can combine and reorder blocks to match your workflows, then send them to anyone.",
  "data/ph-top/2021/4/iconic-6.json": "Iconic is a free, ever-growing collection of pixel-perfect icons. New icons added every week. 150 icons and counting (.svg,png,fig). Enjoy 😘",
  "data/ph-top/2021/4/cohort-based-courses-by-pathwright.json": "Invite your online learners to learn together with Cohorts. Because the best learning happens when we're exchanging ideas, asking questions, and interacting with people on our same path. https://www.youtube.com/watch?v=4tDcdhoo0Ug",
  "data/ph-top/2021/4/royalties-calculator.json": "This tool enables you to search for ANY musician and it approximates how much money generates on royalties on all the major streaming platforms such as Spotify, Apple Music, Amazon, and many others! Completely free!",
  "data/ph-top/2021/4/bmoves.json": "bMoves is the geo-localized solution to manage your field activities. Available on the field and in the office, bMoves enables you to document, visualize and export everything you do.",
  "data/ph-top/2021/4/donate-to-india-s-covid-relief.json": "Donate to help India through the second wave and get time with India's best product builders in return!",
  "data/ph-top/2021/4/codejudge.json": "Codejudge helps companies build tech teams faster, smarter and better through automated real world assessments. Our real world tasks capture over 127+ skill data points within seconds to ensure you’re building tech teams based on data and not guesswork.",
  "data/ph-top/2021/4/yespromo.json": "Learn how to leverage Reddit for your business. A free collection of 100+ successful self promotion posts across 30+ subreddits.",
  "data/ph-top/2021/4/venture-capital-interview-trainer.json": "You want to get into venture capital but don't know how the interview process will be like? We collected 60+ real questions VC firms ask their candidates during the application process.",
  "data/ph-top/2021/4/channel-tools-for-slack.json": "With https://www.channeltools.io, you can bulk invite all members of a Slack team, or a channel, to another channel. It also helps you quickly export all members from a channel. It comes with handy utility commands for clearing the screen and picking a random user",
  "data/ph-top/2021/4/the-remote-meetings-handbook.json": "Remote meetings have unique advantages compared to in-person meetings, but to maximize these unique advantages, you’ll need to adapt yourself to the new way of doing things.",
  "data/ph-top/2021/4/reach-live-2-0.json": "Reach.Live (YC W20) allows engineers, product managers, community managers to host live & on-demand Tech Talks & Product Demos 💻 Integrated tools ⚙️ Analytics dashboards for lead generation 🎉 Drive product growth by creating a public content library",
  "data/ph-top/2021/4/papapal.json": "🌍 Learn a foreign language writing emails with interesting people. 🎁 Fill the form -and get a gift. 💌 Meet your pal. ✍️ Write and learn. 🗝 Simplicity is key here. No app. No fees. 👉 Let's go back to basics: meet and discuss with new people.",
  "data/ph-top/2021/4/newsy.json": "Do you have domains that you are not using at the moment or unused domains? Why not turn it into a complete, functional social news aggregator like Reddit in 3 clicks? Newsy lets you do this powerfully with all the features that you need.",
  "data/ph-top/2021/4/freekin.json": "Something better than \"like a local\". No tours, no guides, no crowds, no spam, no COVID-19. A special travel app for sharing off the beaten, hardcore and mostly free places to visit with like-minded people.",
  "data/ph-top/2021/4/awkward-silences-podcast.json": "Welcome to Awkward Silences, the podcast where we interview people who interview people. Listen as we geek out on all things UX research, qualitative data, and the craft of understanding people to build better products and businesses.",
  "data/ph-top/2021/4/podroom.json": "PodRoom provides podcasters with the platform needed to connect with like-minded individuals, raise awareness for their self-owned media outlet, and ultimately, command a greater share of ad revenue in the digital realm.",
  "data/ph-top/2021/4/instamint.json": "instamint is the first platform to allow creators and instagram users to create NFTs of their posts. You can now create and share NFTs of your favorite instagrams!"
}