{
  "data/ph-top/2022/6/aviyel.json": "Aviyel Rewards is a rewards and recognition platform for open source communities. Contributors can earn badges and mint them as soulbound NFTs for both their code and non-code contributions across platforms.",
  "data/ph-top/2022/6/typedream-cms.json": "🗂 Display your Notion data beautifully on your website (Airtable, Google Sheets coming soon) 🤖 Create an NFT minting site, display your NFT collection with CMS Click here to get 10% off any plans: https://build.typedream.com/promo?promoCode=PHCMSYEARLY&utm_source=phcms or https://build.typedream.com/promo?promoCode=PHCMSMONTHLY&utm_source=phcms",
  "data/ph-top/2022/6/the-crowdsec-console.json": "Connected to the CrowdSec open-source security tool, the Console provides actionable data to visually explore threats, alerts, remediation decisions and get an instant overview of any IP suspicious activity on your services.",
  "data/ph-top/2022/6/ui-store.json": "Get design files including Figma, Adobe Xd, with many more.",
  "data/ph-top/2022/6/akaunting-3-0.json": "Akaunting ensures you don’t need an accounting degree to manage your business’s everyday bookkeeping. Send invoices, receive payments, and track your income & expenses with ease.",
  "data/ph-top/2022/6/rolljak-2-0.json": "Rolljak is a platform where gamified learning meets synchronous collaboration — boost participation, creative thinking, teamwork, and innovative discussions in minutes with bite-sized and time-boxed activities, perfect for any occasion or audience size.",
  "data/ph-top/2022/6/equals.json": "Equals is a next generation spreadsheet with built in connections to any data warehouse, modern versioning, and collaboration. For founders and startup operators, Equals is the simplest and fastest way to do any analysis.",
  "data/ph-top/2022/6/seo-content-assistant-by-searchatlas.json": "We combined content optimization with AI to build the most powerful SEO content writing assistant. Expedite content production with automated keyword clusters, AI text generation, on-page SEO, and 1-click publish to WordPress, all in a single tool.",
  "data/ph-top/2022/6/website-usability-testing-by-useberry.json": "🚀 Pinpoint website usability issues. 🏆 Explore users’ perspectives and make the right adjustments. 🔥 Analyze user behavior and identify engagement patterns. ✨ Get the full visualization of dynamic clicks on every element of your website.",
  "data/ph-top/2022/6/100-custom-podcast-covers-for-free.json": "Our designer's team is ready to create a custom cover for your podcast for free. Subscribe and get a new professional podcast cover. Make your podcast look amazing🎉 If you have any doubts - ask questions to the makers",
  "data/ph-top/2022/6/slashy.json": "https://slashy.app is an open source extension by that lets you create custom commands for Notion. Make camera and audio recordings, draw, create reusable components and much more - all for free.",
  "data/ph-top/2022/6/metricks-io.json": "Metricks is an affiliate marketing tracking software developed to help SaaS, eCommerce, and Small Businesses across the world scale through cutting-edge affiliate programs and a seamless tracking experience.",
  "data/ph-top/2022/6/scaleway-2.json": "Scaleway helps developers and businesses to build, deploy and scale applications to any infrastructure. Located in Paris, Amsterdam and Warsaw, Scaleway is used by 25,000+ businesses including some of Europe's fastest growing startups.",
  "data/ph-top/2022/6/monthly-makers-club.json": "Do you have an idea you have spent way too long incubating or a long list of ideas you'll likely never ship? If you answered yes to either question then join us and launch your project within the month.",
  "data/ph-top/2022/6/remote-api.json": "Offer global payroll, benefits, employer of record services in the entire world, directly from your own platform. Surface people and payroll data anywhere, process payments in almost any currency and allow anyone to work from anywhere without leaving your app",
  "data/ph-top/2022/6/state-of-saas-onboarding-2022.json": "Get inspiration, learn about best practices and latest trends in user onboarding in the MarTech SaaS sector. Learn what successful SaaS businesses are already doing, and optimize your onboarding flows accordingly!",
  "data/ph-top/2022/6/day-one-school.json": "Backed by Gary Vee, Antler, Human Ventures, and others, Day One is a new school for founders. One that's virtual, community-driven, and actually supports, guides and teaches aspiring entrepreneurs. Today, we're officially launching our newest program - Tracks.",
  "data/ph-top/2022/6/editeddy-by-headliner.json": "EditEddy makes audio editing simple - upload your spoken word audio, get a fast, reliable transcript then edit your audio by editing the text. Remove filler words with the click of a button & correct any errors in the transcript.",
  "data/ph-top/2022/6/magniv.json": "Today’s data stack was built for yesterday’s software engineers. Data scientists deserve their own tools. Magniv is an open-source Python library that lets data scientists deploy apps independently, without relying on support from software engineers.",
  "data/ph-top/2022/6/yepic-ai.json": "Create AI-Generated personalised video for sales, training and marketing in 40+ languages without actors, cameras or post production. Our new Instant Avatars feature allows you to upload and animate photos like her #RoyalAIness.",
  "data/ph-top/2022/6/hivoe.json": "Hivoe solves the problem of kickstarting conversations with your Twitter followers via DMs. Why? To make friends, find out what content your audience enjoys, ask for feedback on your products, and a lot more!",
  "data/ph-top/2022/6/untitled-ui-icons.json": "Untitled UI Icons are the ultimate free icon library for Figma. A clean, consistent, and neutral icon library crafted specifically for modern UI design. Made for Figma, in Figma.",
  "data/ph-top/2022/6/api-maker.json": "It is a tool where creators can make their own APIs for developers without requiring technical knowledge and they can monetize APIs. Totally NoCode!",
  "data/ph-top/2022/6/mobileaction.json": "Looking to grow your mobile app? 🚀 You can now analyze competitors, discover the latest ad trends and automate campaign management with MobileAction’s Free Forever plan. Sign up today and take your mobile app growth to the next level.",
  "data/ph-top/2022/6/slabpixel.json": "Unlock your benefit to executing all your creative works with SlabPixel’s best designer, by simple SUBSCRIBE! Get your business stand out with unlimited design and unlimited revision - starting from $1,750/month. Ready to give us a try? Visit slabpixel.com",
  "data/ph-top/2022/6/dispatch-inbox.json": "Drowning in Slack messages? Dispatch is a&nbsp;Priority Inbox&nbsp;for Slack that lets you focus on what's most important.",
  "data/ph-top/2022/6/jelly-card.json": "Jelly Card offers a revolutionised way to save big using your Instagram posts. You can literally buy stuff using your social media posts. The process is really simple - Shop using Jelly card → Post on Instagram → Earn upto 100% cashback!",
  "data/ph-top/2022/6/trust-center-by-drata.json": "Trust Center is a new way to publicly showcase the daily security and compliance measures your business is taking. Share continuous, real-time control monitoring powered by Drata, plus certifications and attestations like SOC 2, ISO 27001 and GDPR.",
  "data/ph-top/2022/6/diablo-immortal.json": "Diablo Immortal™ is a brand-new mobile game from Blizzard Entertainment set between the events of Diablo® II: Lord of Destruction® and Diablo III®. ⠀ Clash with armies of demons, collect epic loot, and gain unimaginable power. 🪓",
  "data/ph-top/2022/6/woice-2.json": "Start talking with your voice at your own pace without ever missing out on what your colleagues have to say. Woice supports 23 languages, enabling co-workers across the globe to bring warmth to conversations with voice messages and automatic transcriptions.",
  "data/ph-top/2022/6/notion-os-dashboard.json": "Feed your focus with this highly effective, adaptable, and productivity-optimized life management dashboard. This dashboard will help you manage your projects, tasks, time, goals, clients, finances, notes, books & bookmarks as effectively as possible.",
  "data/ph-top/2022/6/state-of-databases-2022.json": "The inaugural 2022 State of Database Survey by Basedash asked developers at hundreds of companies, ranging from startups to enterprises, to give their opinion on database tech. Use it to find trends, uncover tools, and see where the industry is headed.",
  "data/ph-top/2022/6/crayon-2.json": "✨ Add life, movement, & animation to any vector illustration, no design skill needed! 🕹️ Simple controls let you customise everything about your animation, from speed, angle, & distortion, to the fill. 👀 Perfect for landing pages, emails, apps and more",
  "data/ph-top/2022/6/desky.json": "Desky is a 100% free app that allows teams to book their workspaces in the office with ease, while managers gain visibility, productivity and peace of mind.",
  "data/ph-top/2022/6/design-maestro.json": "Design Maestro is a free extension for the Keyboard Maestro app. Save time on your boring daily tasks and focus on more important aspects of your design career.",
  "data/ph-top/2022/6/stenos.json": "Stenos is an app that takes notes for you. It's the personal assistant that writes down what you discuss. You'll remember every meeting in detail. Stenos speak 59 languages and is designed with your privacy first.",
  "data/ph-top/2022/6/commit-club-2.json": "Commit Club incentivizes daily challenges and habits. Staked or free. Web3 or email signup. Publicly shared or private to you. Staked gives you the added bonus of receiving stakes from failed challenges. If somebody fails, you get a portion of their stake.",
  "data/ph-top/2022/6/detail-3.json": "Making great video is really f*cking hard. Detail makes it easy. Unlock your creativity with seamless video production – record, stream, and edit in one simple but powerful app.",
  "data/ph-top/2022/6/weekly-visitor-report-2-0-by-clearbit.json": "With the Weekly Visitor Report, you get a free weekly interactive dashboard of the companies visiting your site. With 2.0, find out which ones are ready to buy (hello intent data! 🚀). Also new: Visitor tagging, sharing, filtering, channel analysis + more!",
  "data/ph-top/2022/6/isometric-3d-icons-animated-scenes.json": "A set of 3D style icons, elements & animated concepts, with 240 use-ready icons, 120 premade scenes & 25 animated scenes. The assets are delivered in 4K resolution, Figma, PNG, webM, MP4 as well as editable source designs in GLTF format",
  "data/ph-top/2022/6/wolfy-3.json": "🐺 Free social deduction game, easy rules to understand, it opposes a village to undercover werewolves 💻 Web, iOS & Android 🏆 Leaderboard 🐺🔮 20 roles 🔓 Public, private games 👨‍👨‍👧‍👧 2 millions players A tool that I recommend to all remote teams.",
  "data/ph-top/2022/6/tacotranslate.json": "TacoTranslate frees you from the pain of developing multi‑language React applications. 😎 No import/export! 👌 No duplications, no hardcoding! 👍 We manage your strings and translations and handle your new localization.",
  "data/ph-top/2022/6/yin-finance.json": "YIN Finance is a multi-strategy NFT asset management platform that allows users to subscribe to various strategies to achieve an effective high yield. the newly launched Fixed Rate products: Smart Seller & Dip Chaser offers fixed returns up to 15% APR.",
  "data/ph-top/2022/6/sequin-2.json": "Sequin syncs data from APIs like Stripe, Airtable, or Salesforce to tables and columns in your Postgres database in real-time. No more polling, webhooks, query parameters, or HTTP errors. Ship that feature in the next hour.",
  "data/ph-top/2022/6/400-okr-examples-directory.json": "OKR Examples Directory is a free collection of OKR Examples from Google, Netflix, Spotify and others.",
  "data/ph-top/2022/6/figma-templates.json": "The FIGMA TEMPLATES is a website to get free design assets for designers. Get high-quality design files and file formats as a starting point in creating your new designs.",
  "data/ph-top/2022/6/mvp-2.json": "How do I do cold outreach? Where do I find a co-founder? How do I make my product go viral? MVP is a curated database of 100+ playbooks, blogs and resources created by people like Michael Seibel, Julian Shapiro and Lenny Rachitsky.",
  "data/ph-top/2022/6/frens-money.json": "Frens.Money- A social expenses platform built on top of Ethereum that allows users to- 1. Split and track expenses between friends 2. Request money and make payments",
  "data/ph-top/2022/6/the-permissionless-apprentice-by-vv.json": "Want to figure out how to engineer opportunity on the internet? Want to build a body of work that makes working with you an easy decision? Includes: -Guest modules & case studies -Exercises/Practice -Mental frameworks to spot new opportunity",
  "data/ph-top/2022/6/beatopia.json": "Beatopia is the first beats subscription for rappers and singers. Producer credits include: Kehlani, Gunna, NBA Youngboy, Lil Pump, Katy Perry, Jonas Brothers, Wizkid, Skepta. All beats come with stems and unlimited rights.",
  "data/ph-top/2022/6/notion-quote-widget.json": "Create custom embeddable Notion quotes in just a few clicks! Either get a newly generated inspirational quote each day, or type your own custom static quote. You can style both, and this widget is completely free to use. Hope it helps!",
  "data/ph-top/2022/6/10-login-screens.json": "🔍 10 Login Screens - UI Kit The package of 10 unique login processes that may be re-used in every app.",
  "data/ph-top/2022/6/flow-club-lounge.json": "Flow Club Lounge brings you an instant boost in focus and motivation without caffeine or drugs. The secret? Social accountability. Join the co-working movement as seen in Fast Company, Protocol, Computer World, and Slate.",
  "data/ph-top/2022/6/illustrations-2.json": "A large set of colorful illustrations that fit any design. Pack includes fully vector shapes that are compatible with Figma, Sketch, and Adobe Illustrator. All of them are available for free in SVG & PNG format.",
  "data/ph-top/2022/6/notebook-os.json": "A powerful and aesthetic notetaking system that centralizes all your notes into your digital workspace.",
  "data/ph-top/2022/6/universitydao.json": "UniversityDAO is a decentralized autonomous university aiming to end student debt and empower Universities to own their university through the tokenization of the University system.",
  "data/ph-top/2022/6/reform-free.json": "Reform Free is a 100% free version of our form builder, Reform. Use it to create beautiful, clean-looking, on-brand forms. No code required.",
  "data/ph-top/2022/6/magical.json": "With no integrations and a simple keystroke, Magical lets anyone automate soul-crushing tasks by moving data between tabs. Populate messages, sheets & forms without the time-consuming copy-paste. 💪 Works on any site 🧭 Set up in seconds 💥 Automation for all",
  "data/ph-top/2022/6/purpur.json": "Purpur App is a mental health app to build deep & transparent relationships. People answer questions about sex and relationships chosen by experts, open up about their desires and learn to communicate.",
  "data/ph-top/2022/6/call-of-fame.json": "Welcome to the Call of Fame - where you can listen to real-life cold calls made by the best SDRs from the SaaS world - Chilipiper, LeadIQ, etc. You can learn closing techniques, redefine your approach, and discover how to hit that 160% quota month-on-month.",
  "data/ph-top/2022/6/web-page-design.json": "A Growing Collection of high-quality customizable Landing Pages by Web Page Design. High-quality, useful, responsive collections of landing pages can save you a ton of time. Anyone can download it with one click. Free for personal use.",
  "data/ph-top/2022/6/yep-3.json": "Ahrefs team has built Yep by infusing close to $60 million, a search engine that is creator friendly whose profit model is to share 90% of ad revenue with content creators",
  "data/ph-top/2022/6/amofit-s-3.json": "The world's smallest bioelectronic wearable device uses mild electric currents to stimulate the vagus nerve. From regulating sleep patterns to reducing anxiety and stress levels, and more. Clinically approved. 30 minutes a day. First results under 72 hours.",
  "data/ph-top/2022/6/0-1-000-twitter-followers-dashboard.json": "A Notion Dashboard designed to help you through the hardest part of your Twitter journey: going from 0-to 1,000 followers.",
  "data/ph-top/2022/6/story-alley.json": "Story Alley is where creative storytellers come together to stay up to date on industry news, trends, and resources that help them take their content to the next level. News, tips and tricks, and fun facts are delivered directly to you once a week.",
  "data/ph-top/2022/6/what-should-i-tweet.json": "\"What Should I Tweet\" is a simple generator that gives you Twitter ideas. • On load it shows a randomized tip on what to post. • Click \"Generate\" and it comes up with 3 more ideas. • It has a text field for each prompt where you can practice writing. Enjoy!",
  "data/ph-top/2022/6/loopple-landings.json": "Loopple Landings is a collection of beautiful HTML Responsive Landing Pages & Dashboards templates built on top of Bootstrap and made for any use case. You can simply download a template or duplicate & edit them using Loopple Builder.",
  "data/ph-top/2022/6/smart-tips-by-usetiful.json": "Smart Tips by Usetiful are a simple way to improve the user adoption of your products in a non-intrusive way. 🎯 Hotspot beacons draw the attention of users ℹ️ Tooltips provide guidance at the moment of need 💖 No coding required with visual editor",
  "data/ph-top/2022/6/orion-2.json": "Orion gives you a fast, smooth and lightweight browsing experience, without holding your device’s battery hostage. It has (experimental) support for Chrome and Firefox extensions out of the box. Orion is completely zero-telemetry.",
  "data/ph-top/2022/6/lingvanex-on-premise-translation-server.json": "On-premise Translation Server is built for unlimited machine translation of a Text, HTML, Documents and Audio. Ultra-fast and totally secure translation in 110 languages for a fixed price.",
  "data/ph-top/2022/6/unreal-speech.json": "The first ultra-affordable, ultra-realistic AI narrator. Trained to sound audiobook-esque, perfect for narrating articles, blogs, newsletters, books, PDFs, and more! Compare against AWS side-by-side.",
  "data/ph-top/2022/6/setops.json": "The cloud experience developers have waited for. Run containers, databases, and more in your own AWS account within minutes. No Ops or Cloud knowledge is needed. As easy as Heroku. ✨",
  "data/ph-top/2022/6/tydo.json": "Combine Shopify store data with the tools and channels you love to create a single source of insight. Loved by Birthdate Co., Dose, and Disco.",
  "data/ph-top/2022/6/reclaim-google-calendar.json": "Automatically find the best time for your tasks, recurring events, 1:1 meetings and breaks in Google Calendar and save 7.6 hours/team member every week. Get started with the most advanced Google Calendar add-on out there - free forever at Reclaim.ai.",
  "data/ph-top/2022/6/cft-illustrations.json": "Take the full advantage of the NFT package. We put 75 illustrations and avatars here. Adjust and modify them up to your wishes and get the high acclaim!",
  "data/ph-top/2022/6/dorik-cms.json": "Introducing Dorik CMS. Simple, affordable, and flexible white-label CMS platform. Build any type of website including the blog, job board, directories, etc for you or your clients without writing any code!",
  "data/ph-top/2022/6/copyfoundry.json": "CopyFoundry is a brand positioning and copywriting library for marketers and builders. Use CF to see how the best companies wrote copy at your stage, track competitor messaging, and make landing page writing easier without the time-consuming research.",
  "data/ph-top/2022/6/simple-estimate.json": "Increase team collaboration and make your project estimates more accurate than error-prone spreadsheets. Pre-defined roles and rate cards allow you to quickly create estimates and share them with your internal stakeholders or clients.",
  "data/ph-top/2022/6/tech-job-referrals-by-exponent.json": "Land more interviews with job referrals from employees at Google, Meta, Amazon, and other top tech companies.",
  "data/ph-top/2022/6/opal-web3-jobs.json": "Discover web3 jobs and start building alongside friends.",
  "data/ph-top/2022/6/quoram.json": "Quoram is a free, no-code Web3 platform where creators build token-enabled communities with non-fungible memberships. Fans mint NFTs to get access to your community and the exclusive content and experiences that you choose.",
  "data/ph-top/2022/6/umbrel-2.json": "Umbrel is a beautiful personal server OS that makes self-hosting apps like Nextcloud, Matrix, Bitcoin/Lightning node, Pi-hole, HomeAssistant etc. accessible to everyone. Install on a Raspberry Pi, or any hardware (or cloud) that's running Linux/Debian.",
  "data/ph-top/2022/6/airpods-wtf.json": "We built \"AirPods.WTF\" so people realize they sound terrible in meetings just because of using AirPods as both their input and output device in calls. Best practice is to use your MacBook's built-in mic and then use AirPods as just your output device.",
  "data/ph-top/2022/6/aroma-api-2.json": "Aroma API is one universal API to scale fast with integrating every calendar, project management, CRM, documentation communication, etc. tools. It standardise the data for you to perform any action or get insights quickly.",
  "data/ph-top/2022/6/skipp.json": "The first ever way for you to access a remote tech talent platform to combine vetting, testing, interviewing, curation and ongoing managed service to guarantee quality so you can launch your product quickly and effectively.",
  "data/ph-top/2022/6/trading-across-brokerages-by-front.json": "No more switching between apps! Now, you can not only see all your assets in one place with Front - you can trade with them as well. Front’s new Trade feature lets you place and monitor your trades, right in the Front app.",
  "data/ph-top/2022/6/feeting-app.json": "Break free and take your meetings wherever you like. Go for a walk, breath fresh air and catch some sun. The Feeting Gems™ technology takes care of automatic note-taking, so that everybody has their actions, follow-ups and topics directly after the Feeting.",
  "data/ph-top/2022/6/email-signature-generator-by-reply.json": "Looking to reinforce your personal brand and make a lasting impression on your prospects? Create a professional-looking email signature with our free Email Signature Generator✨",
  "data/ph-top/2022/6/growth-hacks-weekly.json": "Growth Hacks Weekly is the fastest growing marketing newsletter, delivering one high-impact growth marketing hack, every Sunday evening, for free! It was just named a Forbes \"Top Marketing Newsletters You Need To Subscribe To\" and is written by Marketing Max.",
  "data/ph-top/2022/6/bueno.json": "Bueno is a set of no-code tools for NFT creators to generate NFT collections and deploy Smart Contracts quickly. Just upload your assets, play with rarity, set rules, preview a set, and develop your collection in seconds with multi-chain metadata included.",
  "data/ph-top/2022/6/lottiefiles-for-wordpress.json": "Access 50,000+ free Lottie animations that you can add to any WordPress site. Customize playback options and explore many more features - all without code!",
  "data/ph-top/2022/6/cryptohunt.json": "What is a blockchain? Does web3 make sense? Why is Bitcoin a planet killer? Welcome to Cryptohunt, your place to get started with crypto. Enjoy dozens of free, fun quizzes that teach you the fundamentals, and discover exciting crypto projects.",
  "data/ph-top/2022/6/ai-paraphrasing-tool-by-contentbot-ai.json": "Paraphrase up to 2000 word articles quickly and easily with our built in paraphrasing tool. We've compared our paraphrasing tool to the other tools on the market and we beat them hands down.",
  "data/ph-top/2022/6/influencer-analytics-by-buzzguru.json": "BuzzGuru plugin for Chrome helps you check the influencer profile on YouTube, Instagram, TikTok and Twitch. Get analytics on influencer performance and content while surfing the social media platforms.",
  "data/ph-top/2022/6/tresl-segments.json": "Segments combines data from Shopify and marketing channels to uncover profitable segments & insights. Manage your segments in one place and scale to email, SMS, and ad campaigns. The go-to Shopify Analytics tool for ILIA Beauty, Meshki, Sol De Janeiro & more",
  "data/ph-top/2022/6/preline-ui.json": "Preline UI is an open-source set of prebuilt UI components based on the utility-first Tailwind CSS framework.",
  "data/ph-top/2022/6/invezo-2.json": "Invezo is a comprehensive crypto analytics tool and API. We integrate real-time data from all aspects of the cryptoeconomy, from market and on-chain data to developer and social media activity.",
  "data/ph-top/2022/6/nf-tim-by-creative-tim.json": "🚀 NF-Tim by Creative Tim is the 1st NFT utility project based on Elrond for Developers & Designers! What is special about our projects is that our NFTs have real & instant applicable utilities: they will give you access to PRO products built by Creative Tim.",
  "data/ph-top/2022/6/awsify-by-digger.json": "AWSify makes it easy to migrate from Heroku to AWS. It configures your AWS account so that your app can be moved in minutes. Leave the expensive black box behind with AWSify - it works like magic!",
  "data/ph-top/2022/6/the-bitcoin-note.json": "Beautiful, printed cash notes backed by Bitcoin in secure NFC chips. Each note is printed with currency-grade elements that use secure printing techniques.",
  "data/ph-top/2022/6/scale8.json": "A fast, simple, open-source and privacy-friendly alternative to Google Tag Manager and Google Analytics. Focusing on delivering the features and tools that matter most to publishers. The project is completely free to run on your cloud platform.",
  "data/ph-top/2022/6/remotehq-2-0.json": "Turn any web app instantly collaborative, with no download. Use it with teams and customers. For sales demos (let prospects test drive, ⬆️ close rates), support (show instead of tell, ⬇️ handle time & churn), and team collaboration (⬆️ productivity).",
  "data/ph-top/2022/6/mixo.json": "Mixo is a new way to interact with food content through short-form videos. We make it easy to create, distribute and monetize compelling food content for creators. We also make it easy to find, consume, and organize content for the viewers.",
  "data/ph-top/2022/6/the-inbox-zero-challenge.json": "Inbox zero keeps your work/personal life healthy and happy. The Inbox Zero Challenge automatically syncs your Gmail and updates daily to see if you reached your inbox goals for the day via wordle chart visualization. Make inbox zero fun and accountable!",
  "data/ph-top/2022/6/the-adalo-app-academy.json": "The Adalo App Academy is a library of 100+ resources unlike any other in the no-code universe – we go beyond just how to build an app, we help you build a business. Learn at your own pace from founders and experts and bring your idea to life!",
  "data/ph-top/2022/6/json-hero-chrome-extension.json": "The new JSON Hero Chrome extension lets you easily use JSON Hero from Chrome for plain JSON blobs. Or extract and open Firestore documents, Github files, and Open Graph metadata. And since JSON Hero is open source, you can even point to your own instance.",
  "data/ph-top/2022/6/linktree-marketplace.json": "The Linktree Marketplace features Link Apps and integrations from 30+ partners and services including Typeform, Reddit, Gleam, Cameo, Spring, Spotify, SoundCloud, GoFundMe, PayPal, Square, OpenSea, Shopify, TikTok, Twitch, Twitter, YouTube, and more.",
  "data/ph-top/2022/6/curio-3.json": "Curio is an NFT intelligence tool that will help you find the signal through the noise. Pairing powerful insights alongside a world class UX, Curio is blazing fast, a joy to use, and makes understanding the market dead simple.",
  "data/ph-top/2022/6/sublus-1-0.json": "Sublus is an illustration product that can be easily customized with more than 120+ components. You can create characters, avatars, or adapt to the existing scene! *psps it's totally free😽",
  "data/ph-top/2022/6/emelia.json": "What could I do with https://emelia.io and 19€/month (3 accounts included)? 💪 Send cold email sequences timed by day, hour or minute ⏱ Set limits and conditions ⚒ Build strong reportings and A/B Test 🤖 Automate workflows with Zapier, n8n or Make https://app.emelia.io/signup?lng=en",
  "data/ph-top/2022/6/absurd-design-chapter-4.json": "The absurd.design project gives you a series&nbsp;of hand-drawn absurd illustrations to add a human touch to a wide range of digital projects, including landing and status pages, apps, newsletters and presentations, and much more.",
  "data/ph-top/2022/6/slite-discussions.json": "Slite is where remote teams get their best work done. Our latest update merges the two most important elements of remote collaboration: documentation and decision-making. Start discussions and finish with clear, well-documented decisions.",
  "data/ph-top/2022/6/drunk-startups-by-thursday.json": "Drunk startups = crazy ideas + whiteboarding + pitching + funding All of this over a fun social that you can host for your remote team. Try this brand new mixer from Thursday for free. No credit card required.",
  "data/ph-top/2022/6/tabulio.json": "Tabulio is a professional social networking platform that allows digital creatives (developers, writers, designers, and others ) across the world to connect with each other, showcase their creative works, and enjoy access to a pool of global job opportunities.",
  "data/ph-top/2022/6/indigo-tech-recruiters-rod.json": "Getting behind on your talent acquisition KPIs but don't want to hire another full-time recruiter yet? Get an extra pair of experienced tech recruiters' hands working alongside your team in less than 12 hours, starting at $45/hour.",
  "data/ph-top/2022/6/seo-tactics-2022.json": "Tactics you can use to leverage SEO for your business.",
  "data/ph-top/2022/6/venex.json": "Returns from Stock Options are too far out and unpredictable. VenEx enables you to offer “real” wealth to your employees as a merit-based share of your future cashflows. Our platform automates it end-to-end, helping you “Hire. Retain. Reward. 10X better!”",
  "data/ph-top/2022/6/milanote-for-ipad.json": "Milanote helps you organize your ideas and projects into beautiful visual boards. Sketch ideas, collect inspiration and organize tasks on the go with the new iPad app.",
  "data/ph-top/2022/6/markettailor.json": "Markettailor helps B2B marketers personalize their website and boost lead generation by 50-200%. Catch the attention of companies visiting your site before they bounce by showing content that immediately clicks and resonates with their needs.",
  "data/ph-top/2022/6/a-to-z-of-pricing-and-monetisation.json": "Ask any product, marketing, or growth folks; they would say that pricing and monetisation are the most exciting problem statement to work on. Learn interesting pricing models, strategies and pricing psychology hacks alongside case studies from 13+ companies.",
  "data/ph-top/2022/6/linksome.json": "With Linksome you can collect all your content in one personalized page with one convenient link. Use Linksome for your personal #linkinbio page, or work together with your team on company profiles; Linksome is the creative #linkinbio solution for everyone.",
  "data/ph-top/2022/6/hovrly.json": "Hi there, we are Hovrly. A tiny and mostly invisible partner for distributed teams. Designed by those who know the value of time. Add as much time zones as you need. Time travel slider for scheduling meetings.",
  "data/ph-top/2022/6/pulse-automatic-status-for-slack.json": "Pulse automatically updates your Slack status in real-time based on your preferences, level of⚡️ focus, calendar, work hours, and the apps you use — you'll have fewer interruptions, more focus time, can signal when you're open to collaboration, and much more.",
  "data/ph-top/2022/6/brevy-1.json": "Skip unnecessary meetings & threads by recording videos with Brevy 🔨&nbsp;Push to your existing PM tools 🚧&nbsp;Automatically capture console logs & network events 💬&nbsp;Leave time-stamped comments directly on your video 📍&nbsp;Pin annotations on your website",
  "data/ph-top/2022/6/prettysmart-co.json": "Get a ready post, including the content and design, customized for your brand, within seconds. Paste a URL of an article and get a post of the main take-away. Use a keyword to get our AI to write a cool headline or download a ready template.",
  "data/ph-top/2022/6/save-emails-to-pdf-by-cloudhq.json": "This app is a ⚡fast⚡ email to PDF converter. You can save all your emails, or a selection of emails to PDF, TXT, and HTML file formats for safe-keeping on your hard drive. For added security, you can encrypt your file, or save it as a compact PDF format too!",
  "data/ph-top/2022/6/fusiongrid-by-fusioncharts.json": "FusionGrid is the highly intuitive and customizable JavaScript data grid component for web and mobile applications. Designed to work with the same data store you are already using with FusionCharts, making it the perfect addition for your dashboard needs.",
  "data/ph-top/2022/6/inboxpro.json": "InboxPro is a suite of tools for improving your gmail and increasing your productivity: AI-powered email assistant, Calendar scheduling, Tracking, Templates, Followups, Email analytics...",
  "data/ph-top/2022/6/simplified-content-calendar-analytics.json": "Bring all your marketing into one app with Simplified's Content Calendar. Seamlessly create, draft, approve, and publish directly to all social media accounts without switching tabs. Even analyze campaign results in the same place. Hello, free time!",
  "data/ph-top/2022/6/copywritingprompts-com.json": "Level up your copywriting skills with prompts that will challenge you to employ persuasive techniques, humor, and creative constraints across a variety of real and imaginary products.",
  "data/ph-top/2022/6/pippl.json": "Everyone deserves feedback! pippl is a review platform where you can request a review from your ex-employer, create a profile and represent your feedback-verified profile online or via our beautiful CVs.",
  "data/ph-top/2022/6/twitter-streak.json": "🐣Makers: Get serious about Twitter and drive results for your business and personal brand. 🕐How?: Use Twitter Streak to get accountable and consistent. 📈Stay motivated and stop forgetting. Use Twitter Streak to keep you on track to reach steady growth!",
  "data/ph-top/2022/6/podia-get-your-free-website.json": "Podia is a platform that lets you build a free, no-code website, host a community (free or paid), and sell your digital products. With Podia, you get all the tools you need to start and grow an online business — for free.",
  "data/ph-top/2022/6/outranking.json": "AI-powered SEO content strategy and execution platform for higher content ROI. Streamline content workflow between SEO manager, writers, editors. Give your content team super powers to grow your company’s bottom line.",
  "data/ph-top/2022/6/codeball.json": "Codeball approves Pull Requests that a human would have approved. This means less waiting for review. Less rubber stamping also means the team gets to spend more time on the trickier PRs.",
  "data/ph-top/2022/6/pleo-invoices.json": "Pleo Invoices simplifies the entire invoice management process by giving you one handy place to process, approve, pay and bookkeep every bill your business receives. Only available for UK companies for now.",
  "data/ph-top/2022/6/lenny-s-podcast.json": "If you’re a founder, PM, or growth lead—this podcast is for you. Lenny Rachitsky (author of https://www.lennysnewsletter.com/) interviews world-class product leaders and growth experts to uncover actionable & tactical advice to help you build, launch, and scale your product.",
  "data/ph-top/2022/6/type-studio-2-0.json": "Type Studio is a text-based video editor that runs online in your browser.",
  "data/ph-top/2022/6/twitter-thread-analytics-by-ilo-so.json": "Your Twitter threads, like you've never seen them. Enjoy detailed metrics, funnels and breakdown charts. Understand how impressions and engagements change throughout your threads. Quickly compare where threads do best, so you can get better at Twitter.",
  "data/ph-top/2022/6/bitsfordigits-2-0.json": "BitsForDigits is an acquisition marketplace for $100K+ revenue internet startups. We make it anonymous & free for owners to attract full & partial acquisition offers from verified acquirers. List your business & get in front of 1,000+ buyers on the platform",
  "data/ph-top/2022/6/salescheats-by-snov-io.json": "For people first entering the world of sales and marketing, there are so many lessons and challenges on the way. SalesCheats is about to change everything! 🔥 It’s free and handy - dig in!",
  "data/ph-top/2022/6/chestr.json": "A simple, free Chrome extension that lets you save products from any online store in a single click. Plus, it notifies you anytime there's a price decrease on your saved items! Think of Chestr as a mix between Pinterest + Honey. 😊 🛍",
  "data/ph-top/2022/6/ia-writer-6.json": "“My favorite iOS app for writing in Markdown, without question, is iA Writer iA Writer is just beautiful. To me, it’s the gold standard for Markdown syntax styling... an elegant champagne flute. That’s iA Writer for me.” –John Gruber",
  "data/ph-top/2022/6/apideck-2.json": "Apideck provides the infrastructure building blocks for B2B SaaS companies to enable them to build and market integrations through one platform. Our Unified APIs standardize APIs across different software categories for a better Developer Experience.",
  "data/ph-top/2022/6/dukaan.json": "Dukaan is a DIY platform which enables merchants with zero programming skills to set up their e-commerce store. 1. Better conversion rates 2. Faster site load times 3. Mobile first",
  "data/ph-top/2022/6/rupt.json": "Rupt puts stock analysis on autopilot. It analyzes stock fundamentals, technicals, analyst ratings and hedge funds data. It then converts this information into a single score and updates it every 15 minutes to show investors where the smart money is moving.",
  "data/ph-top/2022/6/fleet-cockpit.json": "Your computer fleet management made easy in an hybrid work environment. 👩‍💻 Track and organize your team devices easily ⌛️ Save time in IT fleet management 🚀 Get new computers in a minute with all-inclusive support (EU only for now)",
  "data/ph-top/2022/6/softr-mobile.json": "Create mobile apps powered by your Airtable data, without code. At the click of a button turn your Softr-built web app into a fully functional mobile app. Immediately made available on both Apple and Android devices without the extra effort.",
  "data/ph-top/2022/6/autocloud-2-0.json": "AutoCloud allows DevOps teams to automatically generate secure, production-ready IAC customized to their business needs. Once deployed, get multi-cloud visibility with detailed diagrams and a GraphQL API, plus compliance, security, and networking analysis.",
  "data/ph-top/2022/6/humit-3.json": "humit helps you discover fresh tunes & new people with the same music taste as you. Share songs you love as 30-second hums, find music for every mood, create your own stations, plug into a community, and find the ones you can share earphones with.",
  "data/ph-top/2022/6/bazait-2.json": "On BazaIT platform product mindset companies can manage whole hiring process by detailed filters, matching, dashboard. And specialists can find a product mindset teams that meets their requirements and values.",
  "data/ph-top/2022/6/tango-2-0.json": "Automatically create beautiful step-by-step guides with screenshots, in seconds. With Tango 2.0, you can now capture processes outside the browser and invite your entire team to access, edit, and share your hard-earned knowledge. https://tango.us",
  "data/ph-top/2022/6/magicflow-2.json": "Context switches kill your productivity. Ever feel frustrated that you got nothing done today, but don't know why? ⠀ We help you track and eliminate the three main blockers of flow: 😖 Context switches ⏱ Short work sessions 🛌 Bad sleep/exercise habits",
  "data/ph-top/2022/6/leaksid-2-0-for-trade-secrets.json": "If you want to share sensitive documents that no one would dare to re-share, use LeaksID 2.0. It personalizes them so that if even a screenshot appears anywhere, you’ll be able to stop the leak.",
  "data/ph-top/2022/6/coqui.json": "Create super high-quality Voice Clones for your content, instantly. Quality voices just became possible for all your content needs: Video games, ads, cartoons, e-learning, audiobooks... the list is endless. Add voice to your next project, with Coqui 💚",
  "data/ph-top/2022/6/wix-logo-maker-2.json": "Create your logo for free, in minutes with Wix Logo Maker, an AI-powered design platform. Your logo comes in a range of formats so you can make sure your brand looks its best on your website, social channels and more.",
  "data/ph-top/2022/6/mvp-development-guide-checklist.json": "Meet the most comprehensive guide and checklist on MVP Development. There are all the possible inputs for conducting market research, prototyping, gathering feedback, and passing all the stages of an MVP development. With love from Ukraine",
  "data/ph-top/2022/6/finta.json": "Finta is a fundraising platform to fast-track you through your entire journey. Making raising capital easier than ever by eliminating the most tedious fundraising tasks. Spend less time with the boring logistics and more time building real relationships.",
  "data/ph-top/2022/6/deep-talk.json": "AI Platform 🧠 to find sales opportunities, complaints, feature requests, emergencies, etc. on your text data with No-Code. Sentiment analysis, topic detection, clustering, text data analysis in an-easy-to use AI platform 🔥",
  "data/ph-top/2022/6/complete-guide-to-css-flex-and-grid.json": "👉 190 pages eBook 👉 Curated list of 70+ real world use cases & examples 👉 Access to Private CodePen links with working demos. The book follows a \"Problem Based Learning\" approach where you are first presented with an example and then taught the concept.",
  "data/ph-top/2022/6/customer-chat-by-translatewise.json": "Live chat with user-friendly and multilingual UI can help convert up to 21% more website visitors into customers. Unlike other chat solutions, TW chat opens to every visitor in their preferred language, and contains fast replies, call links and email form.",
  "data/ph-top/2022/6/hopps-2.json": "Start instant screenshare sessions with vetted experts to get help with the tools you use at work all day, every day. No browsing. No vetting. No contracts. No minimums. Just the help you need when you need it!",
  "data/ph-top/2022/6/tl-dv-for-zoom.json": "Link your meeting minutes to the exact moment in your video recording & transcript. Instantly share the important takeaways, fully contextualized. Works with your favorite async collaboration app & CRM. ⠀ Catch up on meetings in minutes.",
  "data/ph-top/2022/6/lambdatest-tas.json": "TAS is a test intelligence and observation platform that shortens the testing durations & provides faster feedback to devs. It enables devs to get early insights into flaky tests and enhances their productivity to ship code frequently with confidence.",
  "data/ph-top/2022/6/petvation.json": "The world's first AI-powered pet door with face recognition technology identifies your kitty or pup, gives them access to enter your home, and closes off to other animals. 3 sensors for safety. Completely noiseless. App-Controlled.",
  "data/ph-top/2022/6/connect-earth-api.json": "Connect Earth is the gateway to environmental data. Our API tracks carbon footprint of each transaction. Banks and FinTechs integrate our product to show their customers the environmental impact of every purchase. Sign up to get 1000 free API calls per month!",
  "data/ph-top/2022/6/routine-calendar.json": "Routine (YC W21) is a productivity desktop & mobile app that helps you take back control of your time. 💾 Centralize all your tasks (email, chat, project management) 📅 Plan your work (schedule, postpone, block time) 🎯 Focus on what matters today",
  "data/ph-top/2022/6/solar-dvpn.json": "Meet the new era of privacy with SOLAR dVPN. It is fully transparent, provides end-to-end encryption, blockchain-based and, therefore, decentralised. Checkout first comment for more information 💬",
  "data/ph-top/2022/6/the-full-compensation-calculator.json": "🤝 Do you have a job offer on the table that includes stocks? 🧐 Are you unsure what might happen to your compensation as your company’s valuation changes? Understand how to value your equity stake, play around with different scenarios 🚀",
  "data/ph-top/2022/6/gios.json": "Lectures with \"talking heads\" are boring. Tracking your kid's progress takes too much time. We have created the platform with animated video lessons, practical tasks, and personalized dashboards — GIOS 🧡 More than 110k of our users can prove their progress!",
  "data/ph-top/2022/6/tweek-2-0.json": "Tweek is a free personal and shared to do list app to organize your tasks and collaborate on them online with your team or family. It provides a weekly calendar view mode and a reminder app.",
  "data/ph-top/2022/6/boost-chinese.json": "Learn Chinese from any language using your mobile phone. All levels up to HSK 9 available.You don't need to learn English to improve your Chinese. Now, you can learn it directly from Spanish, Portuguese, English, Russian or French.",
  "data/ph-top/2022/6/encore-ea52031e-6fe8-42d1-9cdc-baec0a53f338.json": "Encore is a Backend Development Engine, purpose-built for a flow state developer experience when creating cloud-based backend applications and APIs. Stop spending countless soul-crushing hours writing repetitive glue code. Start having fun again.",
  "data/ph-top/2022/6/saas-startup-content-marketing-playbook.json": "This eBook walks you through proven content marketing tactics to: ✅ Attract the right audience ✅ Drive qualified traffic ✅ Increase user signups ✅ Get more paying customers. After reading it, you’ll learn how to grow your SaaS startup successfully.",
  "data/ph-top/2022/6/kairos-nfts.json": "Kairos empowers everyone to build a business or grow an audience with NFTs without touching a line of code. NFTs are not just images, they're a way to gather loyal fans for artists, musicians, restaurants or events.",
  "data/ph-top/2022/6/caption-generator.json": "No idea what to share? No time to write? Get instant random caption and build your personal brand with this FREE tool!",
  "data/ph-top/2022/6/letsmint-2.json": "✅Create whitelists, manage collaborations - draw attention and attract potential Minters 🤯Letsmint empowers collab managers - automates fulfilment of conditions and allows draws to be held automatically 🚀Boost your NFT collection by making the best collabs!",
  "data/ph-top/2022/6/no-code-pages-2.json": "No Code Pages offers you a library of landing pages created with no code tools.",
  "data/ph-top/2022/6/social-media-calendar-special-days.json": "😄 Total 1821 Days 🤩 Total 118 Weeks 😉 Total 145 Months You will need it. Buy now, use later. :) Where it can be used?: It can be used in your personal brand's social media account, your brand's social media account, or your customers social media account."
}