{
  "data/ph-top/2022/4/uizard-hat-1-0.json": "Now you can create design mockups straight from your mind. Put on your Uizard Hat 1.0, visualize your product, and there you have it: from idea, straight into fully interactive prototype. Unleash the power of true design thinking. 🧙",
  "data/ph-top/2022/4/bookable-schedule-by-boomerang.json": "📥 Meeting scheduling inside the Inbox - for you & your guests 🧙‍♂️ The Magic Live Calendar updates in real-time, no double booking, works everywhere 📅 Guests can overlay their calendars ⚡ 23% more meetings booked 🤝 The thoughtful way to schedule meetings",
  "data/ph-top/2022/4/greetpool.json": "Greetings are better, together. Create fun 🥳 and engaging ✨ group cards with your friends, family, or coworkers and make your celebrations 🎉 more memorable💛",
  "data/ph-top/2022/4/shipyy.json": "Shipyy helps developers/engineers build internal tools(in 5 mins) for business, product, operations and other teams using existing SQL queries, python/JS scripts, rest api endpoints. Ensuring production database safely using audit logs, roles and permissions.",
  "data/ph-top/2022/4/unicorn-warrior.json": "The cheatsheet every founder and marketer will love ✅ 100+ Viral marketing strategies and frameworks (easy to digest) ✅ 150+ Viral marketing case studies (the largest library of viral marketing case studies) ✅150+ Cognitive biases to influence your customers",
  "data/ph-top/2022/4/product-discovery-3.json": "Discover your next winning product, service or feature. This Notion space uses a three stages system to help you ideate, screen and research ideas based on customers, users and employees’ feedback.",
  "data/ph-top/2022/4/hide-the-pain-harold-s-april-prank.json": "Create personalized videos with the most famous meme for your friends and colleagues on April Fool's Day. Colossyan's technology will allow Harold to reach thousands of people and deliver a personalized prank on them.",
  "data/ph-top/2022/4/clovercities.json": "Today’s websites all look the same. We’re bringing back the creativity of the early web with the first no-code solution for Web 1.0 homepages featuring: AI-generated content, drag and drop interface, special effects, and smart widgets. Yes, it really works!",
  "data/ph-top/2022/4/vocally-2.json": "Generate realistic high-quality Text to Speech voices from some of the best cloud providers in the world - Amazon, Google, IBM and Microsoft. Instantly convert the text into natural-sounding speech in 550+ voices & download as MP3 audio files.",
  "data/ph-top/2022/4/notion-pack-for-coda.json": "What you can do with the Pack? 📊 Visualize your Notion databases as word clouds and charts. 📧 Send a Slack messages via automations when a value changes in Notion. 🔄 2 way sync using actions and Packs, update Notion icons, covers and page properties!",
  "data/ph-top/2022/4/inside-com-d6efe3a7-cdd2-4436-9311-671f0067186c.json": "We’ve taken our amazing newsletter content, which reaches over 250,000 people a month, and put it into a social networking site similar to Reddit, Twitter, and LinkedIn.",
  "data/ph-top/2022/4/background-remover-by-flexclip.json": "Automatic, accurate, and instant background remover tool by FlexClip! Just upload any image and the smart AI will handle the rest automatically in 5 seconds. - 1-click simplicity - Any type of images - 100% online and automatic - Free and instant downloads",
  "data/ph-top/2022/4/breaking-bad-intro-creator.json": "Breaking Bad Intro Creator lets you customize the customized opening with the texts you wish and then download it as an image or video. It automatically find the chemical elements that should be assigned for your text. Check it with your name!",
  "data/ph-top/2022/4/shamebot-by-wfhomie-1.json": "https://app.wfhomie.com/shame/ is the best way to publicly shame your co-workers over Slack. Whenever a less-liked teammate makes a mistake, asks a dull question or makes a cringy comment, using ShameBot is the easiest way to make them question their self-worth.",
  "data/ph-top/2022/4/seshhub.json": "Seshhub helps to turn your skills into an online store. One-on-one or group meetings, as well as PDF downloads can be sold or given away. Seshhub's minimalist interface includes payment processing, scheduling, video conferencing, and management.",
  "data/ph-top/2022/4/we-spots.json": "We-spots.com helps influencers, artists and creators find and book studios everywhere. Here you can rent music studios, photoshooting studios, meeting rooms, cars, pools and more. Travelling? Easily rent and access nearby studios and create.",
  "data/ph-top/2022/4/refuge-app.json": "Born during the Ukrainian crisis, Refuge is the place where humanity gets together to help those in need. Refuge provides a safer way to find help, with built-in near instant verification. The app is available in 12 languages.",
  "data/ph-top/2022/4/assista.json": "Assista will improve your productivity, track your team’s progress, and give you detailed information about your work. Say goodbye to start/stop buttons and manual time-logging. Тrack your time automatically while you focus on what matters - your work.",
  "data/ph-top/2022/4/cryptomarry.json": "CryptoMarry is a Web3 platform that rediscovers how marriages are done. Register your union on-chain and mint an NFT certificate, create your own family DAO, and manage joint crypto assets.",
  "data/ph-top/2022/4/urtots.json": "An&nbsp;anonymous dashboard&nbsp;to share your thoughts and feelings with questions to help you reflect.",
  "data/ph-top/2022/4/cartoonize-3.json": "Cartoonize could turn your face picture into a cartoon with more than 40 different cartoon effects. Powered by AI technology, it could be your best cartoon avatar maker with incredible background applied.",
  "data/ph-top/2022/4/textomap.json": "Textomap is a web app and Chrome extension that enables users to instantly generate maps from any text containing locations. Users can add maps to their reading experience and Visualize text in the same browser tab with the Chrome extension.",
  "data/ph-top/2022/4/saleshero.json": "Apply the best Sales practices advised by the experienced experts from the world-leading software companies.",
  "data/ph-top/2022/4/secondhand-dev.json": "secondhand.dev is a private platform built for developers to buy and sell electronic devices. Anonymous users are not able to see the contact information. Instead of that, only the one who has an active GitHub account can see the seller's contact information.",
  "data/ph-top/2022/4/cronotion.json": "Cronotion provides a simple way to set up repeated items for your notion databases. Cron expressions can be used if you're familiar with it, or you can easily configure a rule using easy UI elements.",
  "data/ph-top/2022/4/web3-academy.json": "An online free academy to learn about web3 and start building the future",
  "data/ph-top/2022/4/common-room.json": "Common Room is the intelligent community growth platform that helps you deepen relationships, build better products and drive business value. Discover what’s most important, nurture key personas, measure program impact and collaborate across your organization.",
  "data/ph-top/2022/4/pm-school-challenges.json": "Create your Product Management portfolio! Looking to break into Product? Solve PM School Challenges. Compete with fellow aspirants. Win a chance to interview at top startups. Signal right PM skills (wire-framing, product thinking, metrics, etc.) to employers.",
  "data/ph-top/2022/4/heyday-4.json": "Heyday’s browser extension automatically saves web pages you visit and pulls in content from your apps. Then, it uses AI to resurface that content alongside Google results, overlay it on articles, and curate it into a knowledge base that fills itself.",
  "data/ph-top/2022/4/butter-app.json": "Bring 10x the energy & be the best participant you can be, even on the go! ⠀ Named #1 Product of the Day when it http://btr.to/PH20210, Butter turns your sessions from 🙀 to 😻 with fun reactions, agenda, polls, breakouts & more. ⠀ And it's now on mobile! 🧈📲",
  "data/ph-top/2022/4/hq-sales-virtual-interviewer.json": "Spend less time interviewing and more time selling! Our sales virtual interviewers, powered by AI and curated by expert content writers, allow you to test candidates on their ability to perform critical work functions required to succeed in sales and marketing",
  "data/ph-top/2022/4/saas-marketing-stack.json": "A large library of 500+ tools to help SaaS marketers & founders to help with their overall growth efforts across channels.",
  "data/ph-top/2022/4/bright-risk-index.json": "The Bright Risk Index allows for the easiest, safest, and most diversified way to act as an “insurer” in the DeFi insurance industry while earning attractive returns. Earn 15-25% APY on a stable coin investment for covering the crypto community.",
  "data/ph-top/2022/4/bento-5.json": "Are you overwhelmed with your tasks? Introducing Bento - helping you do less, but more meaningful tasks.",
  "data/ph-top/2022/4/fitmint.json": "Fitmint is a web3 fitness and lifestyle mobile app with inbuilt NFT gaming and Social-fi elements where you can earn rewards in cryptocurrency just by working out.",
  "data/ph-top/2022/4/attractive-ai.json": "Attractive's bot Poe uses technology similar to self-driving cars to be able to navigate through a site's key functions. It does that daily to make sure everything is working, and to gain insights about interaction, design and UX. No setup, and for free.",
  "data/ph-top/2022/4/q-finder.json": "Are you an expert in your field? Q-Finder displays questions asked about your industry or company in an easy-to-use platform. With Q-Finder, you can increase your online authority and generate quality traffic by answering questions at scale.",
  "data/ph-top/2022/4/diall.json": "We're making mental health approachable. Build new skills and actually enjoy learning about your mental health like never before. Did we mention it's free to download? Get early access at diallapp.com",
  "data/ph-top/2022/4/no-code-guru.json": "No-Code Guru is a wise chatbot that will help you find the right No-Code tool to build your (web app) idea. It only takes 1 minute: 👳‍♀️ Go to No-Code Guru 🤖 Answer 4 easy questions 🚀 Start building",
  "data/ph-top/2022/4/stritch.json": "Stritch: platform with a new video format where all displayed elements are ‘detached’ from video itself — to let independently interact with materials provided in video. It enables you to search and interact with materials in video and use them when it needed.",
  "data/ph-top/2022/4/redwoodjs.json": "Redwood is an opinionated, full-stack, JavaScript/TypeScript web app framework designed to keep you moving fast as your app grows from side project to startup. With React, GraphQL, Prisma, Storybook, and Jest all integrated, you can focus on building your app!",
  "data/ph-top/2022/4/iconbay-figma-plugin.json": "Iconbay Figma plugin offers fully customized style, color, size, and stroke directly on Figma!. More icons will be added very soon! 🔥",
  "data/ph-top/2022/4/pixelied-convert.json": "Convert images in bulk without losing their quality or installing any software using Pixelied’s photo converter tool. It’s fast, free & easy-to-use!",
  "data/ph-top/2022/4/morsel-2.json": "Never lose a family recipe again. Turn old, impossible-to-read family recipe cards into an online family cookbook that you can use for generations to come.",
  "data/ph-top/2022/4/mine-for-teams.json": "Every SaaS app you use may hold user data — exposing your team to privacy & security risks. Discover data sources like a boss with Mine: ✌️ Simply log in with your work email (no coding required) 🌎 Find out where your users’ data is stored 🪂 Reduce risks!",
  "data/ph-top/2022/4/storythreader.json": "Use StoryThreader to create and format twitter threads in one click. Type a paragraph of text in the left box, then watch as it is auto formatted for Twitter. Make any changes, and then once you approve of the thread, you can link your Twitter account and post",
  "data/ph-top/2022/4/maze-x-adplist-scaling-research-playbook.json": "Looking to scale and democratize research in your org? In this Maze x ADPList playbook, over 30 UX leaders share real-life examples and key principles to empower product teams to run their own research and make informed product decisions at scale.",
  "data/ph-top/2022/4/presentation-analytics-by-pitch.json": "Go from idea to insight to impact with presentation analytics. 📈 Measure visits across private, public, and embedded presentations 🔗 Create passcode-protected custom links to manage access 👨‍👩‍👧‍👦 Make analytics accessible to your entire team",
  "data/ph-top/2022/4/whaller-2-0.json": "Whaller gives users everything they need to create their own secure social/collaboration networks, complete with integrated tools like messaging, chat, file storage, co-editing, video conferencing, audio conferencing, shared calendars, tasks and more.",
  "data/ph-top/2022/4/the-science-based-playbook-of-pricing.json": "🎓 The latest science from top business schools 📈 In practical recommendations and examples 💡 Lifetime updates with new research $18 for the first 48h. Then $35 (94% more).",
  "data/ph-top/2022/4/encome.json": "Encome helps you discover trending stocks by monitoring news and social media in real-time and also allows you to analyse them in detail. Our integration with India’s top 14 brokers allows you to trade and manage your portfolio directly from Encome.",
  "data/ph-top/2022/4/sembly-professional.json": "Record, transcribe, and get AI-generated meeting meetings and summaries with https://www.sembly.ai/professional/?utm_source=ProductHunt&utm_medium=Profile&utm_campaign=SemblyAI. Works with Zoom, gMeet, Teams and Webex. Try https://www.sembly.ai/team/?utm_source=ProductHunt&utm_medium=Profile&utm_campaign=SemblyAI to unleash the power of AI in business meetings to transform them into actionable insights.",
  "data/ph-top/2022/4/help-scout-for-startups.json": "Help Scout is a simple help desk that's designed to give growing businesses the tools they need to provide a better customer experience. Learn the platform in an hour, become a power user in a day, and get your first six months free!",
  "data/ph-top/2022/4/intelligent-paraphraser.json": "AISEO’s paraphrasing tool rewrites entire articles and blogs at a blazing speed, using GPT-3 and other AI engines to change the structure of the content while retaining the details. Why it’s awesome? 1- Paraphrasing modes 2- Unique content 3- Mutltilingual",
  "data/ph-top/2022/4/spotrisk.json": "Spotrisk detects and flags risky orders in your Shopify store leveraging millions of data points so that you can ship orders with confidence. Sign up to a free 12 month plan now as part of our limited time Product Hunt go live offer!",
  "data/ph-top/2022/4/free-ukraine-icons.json": "180+ vector icons for articles, posts, donation campaigns, and other efforts that support the Ukrainian people and help spread awareness. Includes Ukraine flags, country contours and other relevant symbols. You can download all icons in onezip file.",
  "data/ph-top/2022/4/etha.json": "Etha is an interactive news and social media platform mitigating the polarized political climate and misinformation through AI and crowdsourced networks. We bring extreme transparency and accountability to news media and politicians.",
  "data/ph-top/2022/4/checklisty.json": "Increase trial conversion. Get faster onboarding. Cut down time-to-value. Gamified User Onboarding Software for PLG SaaS to engage your users with incentives, see where they dropped off and get them back. 🔥 Free- It will be free for Beta testers.",
  "data/ph-top/2022/4/vivid-3.json": "The new MacBook Pros and the Pro Display XDR have displays that can go up to 1.600 nits of brightness. By default these levels of brightness can only be reached when watching HDR videos or by using Metal applications. Until now.",
  "data/ph-top/2022/4/airbyte-cloud.json": "Airbyte has been used by 15k+ companies in the past year to sync data from APIs and databases to data warehouses, lakes and DBs. Airbyte Cloud makes it even easier. 🚀 110+ out-of-the-box connectors (goal is 300 by EOY) 👌 Scalable compute-based pricing",
  "data/ph-top/2022/4/amberflo.json": "Developer-first, Cloud Metering and Usage-Based Pricing and Billing Platform built from the ground up to enable modern Usage-Based Pricing with real-time metering, and on-demand invoicing and billing.",
  "data/ph-top/2022/4/cookieyes.json": "CookieYes is a cookie consent solution that makes it easier for your website to be compliant with laws like GDPR, CCPA, CNIL, and LGPD. We take care of everything, from creating a cookie consent banner to managing visitor preferences when they visit your site.",
  "data/ph-top/2022/4/wizen-guides.json": "We interview founders and distill their advice into actionable how-to guides for founders to learn about marketing, product, and more. Wizen Guides is the missing manual for building your bootstrapped startup.",
  "data/ph-top/2022/4/eurekaa.json": "A data-mining platform for content creators to discover, score, and create multiple winning course / content topics. Multiple Tools - One Platform Course Metasearch, Topic Search Trends, Opportunity Score, Book Search, Keyword Planner, and Content Editor",
  "data/ph-top/2022/4/fabpic.json": "FabPic is an easy to use, free and powerful graphics editor to beautify screenshots just in a few seconds",
  "data/ph-top/2022/4/github-pewpew.json": "Have you ever had too much fun with the GitHub API and ended up creating too many dummy repos? This little CLI tool cleans up repositories quickly. You can choose multiple repositories and delete them blazing fast. It uses GitHub OAuth, and it's open-source.",
  "data/ph-top/2022/4/lookback-3.json": "Lookback lets you attach video messages (stories) to photo albums and share them privately. Anyone you invite can reply by adding their own photos and stories, turning memories of your favorite people and experiences into stories that you can relive forever.",
  "data/ph-top/2022/4/design-skill-tests-by-uxcel.json": "Prove your UX design skills to colleagues and employers with Uxcel’s Skill Tests. Test your knowledge of everything from Color Theory and Accessibility to Figma and Sketch. Share your scores on your Uxcel profile to increase your chances of getting hired!",
  "data/ph-top/2022/4/hybrid-spaces-by-tandem.json": "Be at the office, when you can't actually be at the office. Using off-the-shelf conferencing hardware, Hybrid Spaces give remote teammates an always-on window to teleport around the office. By Tandem, the most powerful virtual office for distributed teams.",
  "data/ph-top/2022/4/quidli-for-discord.json": "- Build your community by sharing value (in crypto) w/ those who create value - Send BTC, ETH, DOGE, and more as rewards directly from your most-used apps - Collectively HODL & share to access the new web3 economy together ❤️‍🔥 wagmi",
  "data/ph-top/2022/4/warp.json": "Warp is a modern Rust-based terminal that’s fast, easy to use, and built for teams. 1) Commands and outputs are grouped like a data notebook 2) Input is a modern code-editor with tab completions 3) Share outputs via links 4) Save and run team commands",
  "data/ph-top/2022/4/shiny-2.json": "Shiny matches startups and SMBs with vetted fractional executives. Our marketplace has 380+ CFOs, CMOs, CTOs, and COOs that can be hired for 2 to 20 hours per week. Top startups including Jeeves, Kyte, Fairmint, and Fiveable have hired on Shiny.",
  "data/ph-top/2022/4/atompay.json": "AtomPay is a platform that enables freelancers, side-hustlers, solopreneurs, and content creators to easily accept & process payments from their audience, community and social media. 📱No Downloads 👀 No Passwords 🔗 One Link ⏰ 2 Minute Setup 💰 Get Paid",
  "data/ph-top/2022/4/kontenbase-alpha.json": "Create backend API, auth, and storage in less than 1 minute with Kontenbase no-code platform / Backend as a Service (BaaS). ✅ Hosted Service ✅ Database ✅ REST API ✅ SDK ✅ Object Storage ✅ Auth ✅ Realtime",
  "data/ph-top/2022/4/kittl.json": "Kittl is a graphic design platform and tool, built to make complex design easier. Browse thousands of ready-to-use templates, fonts and graphic elements. Apply single-click effects and use them for any project. No graphic design experience required.",
  "data/ph-top/2022/4/crew-7b66cead-153d-4054-8e9a-4490dba20470.json": "🚀 Get started instantly with 30+ battle-tested templates 🏆 Engage your community at scale with Quests, XP, and leaderboards 🔥 Centralize all information in one place and delegate responsibilities ✨ Connect your favorites applications",
  "data/ph-top/2022/4/taplio-stats-for-linkedin.json": "Taplio Stats is a free Chrome extension that helps you get LinkedIn post ideas and monitor your analytics. Straight on LinkedIn.com, and free.",
  "data/ph-top/2022/4/traq-ai.json": "Traq.ai takes notes during your sales meetings, so you don’t have to. Record and transcribe your online/onsite meetings, capture what your buyer wants, and get objective AI-insights to win more deals. Free and paid options available.",
  "data/ph-top/2022/4/cafe-2-0.json": "Café offers you new ways to schedule real-life interactions across your organization. You can now connect, collaborate and socialize from everywhere 😻",
  "data/ph-top/2022/4/stage-68f97f54-452c-4867-9127-8f590553c181.json": "Stage is the easiest tool for designing interactive mobile apps — whether you're a designer or not. Stage will help to visualize and share your ideas with every team member, in real-time. No design skills required.",
  "data/ph-top/2022/4/investor-pipeline-speedrunner.json": "Best investors are those who already invested in companies like yours in the past — get 100+ of them in <60 sec for free😎",
  "data/ph-top/2022/4/ouch-illustrations-3-0.json": "Level up your projects with illustrations that will hook your audience: 90+ massive and consistent sets, including 3d and animated pictures. Grab ready-to-use scenes and edit them or use pre-made elements to compose a unique image to tell your story.",
  "data/ph-top/2022/4/dashly-1.json": "Bring together all the dialogs with users from all channels to stay in context. Provide top-quality support and do more sales with chatbots, in-app messages and Emails without scaling your team. Get +1month free with the PROMOCODE 💥PHDashly💥 till April 15th",
  "data/ph-top/2022/4/himalayas.json": "http://himalayas.app/ helps you find a remote job you'll love. Search http://himalayas.app/jobs at http://himalayas.app/companies. Filter by time zone, visa, skills, company, salary, tech stack, and more, or read our company profiles to research and discover new remote companies.",
  "data/ph-top/2022/4/spend-with-ukraine.json": "Ukraine is a home to many great products. But also great people. During the war teams behind these companies support the resistance. Help us fight the darkness, spend with Ukraine to stand with Ukrainians.",
  "data/ph-top/2022/4/realtime-multiplayer-by-supabase.json": "Supabase is introducing the ability for developers to use WebSockets to build multiplayer games, collaborative apps, and support a wide array of modern real-time use cases.",
  "data/ph-top/2022/4/laravel-nova-4-0.json": "Nova is a beautifully-designed administration panel for Laravel. Carefully crafted by the creators of Laravel, Nova is designed to make you the most productive developer in the galaxy.",
  "data/ph-top/2022/4/pipedream-2-0.json": "Pipedream is an integration platform built for developers building workflows and connecting cloud services. Author workflows without code, with over 700 integrated applications, or write any Node.js, Python, Go, or Bash code for custom logic.",
  "data/ph-top/2022/4/clickons.json": "Open source icons by Craftwork Design. 17 categories of use, universal minimalistic style, and vector shapes. Explore the full free collection in Figma and feel free to use in your personal and commercial projects.",
  "data/ph-top/2022/4/pixel-art-together-by-liveblocks-1.json": "Pixel Art Together is a multiplayer pixel art editor, allowing up to 20 people to create art on the same canvas, at the same time. You can use different tools, multiple layers, blend modes, export your art—and it's entirely open-source.",
  "data/ph-top/2022/4/startup-founder-set.json": "Everything Startup Founder Need. ✅ 100+ Places to Post your Startup ✅ 25 Product Hunt Post Templates ✅ 25 Cold Email and LinkedIn Templates ✅ 40+ Communities for Founders ✅ 70+ Tools ✅ 70+ How-To Articles in 6 Categories ✅ Marketing Guides",
  "data/ph-top/2022/4/letter-of-intent-builder-by-microacquire.json": "Introducing the MicroAcquire Letter of Intent (LOI) Builder: Create and send an acquisition offer in just 5 minutes.",
  "data/ph-top/2022/4/newprofilepic.json": "Surprise your friends with your ever-changing profile pic. Change your image as often as you want and draw even more attention with this amazing app that is never out of new portrait ideas and technologies. Impress, stand out, and inspire everyone online!",
  "data/ph-top/2022/4/noticons.json": "Find aesthetic icons for Notion, customize them and add them to notion with one click. Change the color and background. Add them to Notion in one click. 100% free. No design tool needed. Choose from 3000+ Icons",
  "data/ph-top/2022/4/iconer.json": "https://iconer.appwhere you can customize icons to suit your needs. You can choose from a number of customization options in the editor. Copy and download in multiple formats directly from the editor.",
  "data/ph-top/2022/4/relicx.json": "Relicx enables developers to debug front-end issues fast with session replay, auto-generate end-to-end tests based on real user flows, and release faster by measuring CX risk in your CI/CD pipeline.",
  "data/ph-top/2022/4/archbee-3-0.json": "Help your users get started with your product today. Archbee is the fastest way to build product documentation, developer guides, and API references in one place.",
  "data/ph-top/2022/4/candidatechecker-io.json": "Make better hiring or just about any relationship decision with a 5-second background check designed for the social media age ⚡ Instantly uncover which social networks and communities a person is active in, using just their nickname or email address.",
  "data/ph-top/2022/4/coinflix.json": "Coinflix is a people-owned platform & DAO for streaming & funding film & videos from top creators. Community decides what gets funded, then has the potential to share in the upside; with a token powering the ecosystem and acting as equity in the company.",
  "data/ph-top/2022/4/quixy-toolbox.json": "Quixy Toolbox intelligently recognizes text from Images, Videos and webpages. Don’t hesitate to go beyond English with our support for 75+ languages.",
  "data/ph-top/2022/4/whoooa-1.json": "156 Lottie animated vector illustrations ideal for your products such as websites, web apps, social media, or marketing. We have a 30% discount for the first 100 buyers (promo code applied) https://gregdlubacz.gumroad.com/l/OrQCP/ProductHunt30",
  "data/ph-top/2022/4/atomicly.json": "A simple but significant way to organize your workflow. Create perfectly organised to-do lists, Kanban boards, and search through them all with a swift command bar and tags.",
  "data/ph-top/2022/4/freeze-2.json": "Wanna pause the Netflix without soiling the keyboard with your greasy pizza-finger? Control your Netflix with your fingers!",
  "data/ph-top/2022/4/crypto-fear-and-greed-index.json": "CFGI is a multifactorial sentiment indicator for cryptocurrency analysis, which considers the most critical parameters that determine the psychology of the market to give a result that defines the level of fear or greed in the market.",
  "data/ph-top/2022/4/screendot.json": "screendot is a high performance, high feature, low cost API for taking screenshots of webpages that's built with developers in mind. Goals: Easy developer experience, free screenshot access for side projects and testing, and very low cost per screenshot.",
  "data/ph-top/2022/4/r3dphoto.json": "r3DPhoto uses Object Capture technology to turn your photos into stunning 3D models. Simply take photos of an object from all angles and upload them to our service, and we will create and send you a 3D model ready for 3D printing, Augmented Reality.",
  "data/ph-top/2022/4/quick-high-protein.json": "A Quick high protein meals food directory, Where you can save all kind of high protein diet food. For example: Veg, Non-veg, vegan and Snacks!",
  "data/ph-top/2022/4/signfree.json": "E-Sign unlimited documents for free Sign in less than 30 seconds. No account required",
  "data/ph-top/2022/4/pulse-app.json": "NFT and Portfolio Analytics in your pocket. https://testflight.apple.com/join/Cl3OR8Bs and https://play.google.com/apps/testing/app.nftpulse For iOS only 100 invites. Comment us if it ends, and we will add more.",
  "data/ph-top/2022/4/censeranker.json": "CenseRanker is a simple SEO tool that tracks all of your keywords with ease. Get daily updates rank, title and description. Track google search results from different locations all around the world.",
  "data/ph-top/2022/4/metrimo.json": "Metrimo Analytics is the simple, privacy-focused alternative to Google Analytics. Metrimo only collects the data you need to make informed decisions about your website design and content, without compromising the privacy of your users.",
  "data/ph-top/2022/4/redditle.json": "Some of us do it to search Reddit. Some of us do it to get better Google results. Either way, if you often append \"reddit\" to your Google searches, here's Redditle!",
  "data/ph-top/2022/4/design-from-anywhere.json": "Search remote design jobs by role name, location or company name.",
  "data/ph-top/2022/4/managemypasswords.json": "ManageMyPasswords is a Free, Secure, Simple and Offline Password Manager which can help you to store all of your passwords securely and generate secure passwords for your accounts. The whole app is FREE, you can add unlimited number of passwords.",
  "data/ph-top/2022/4/boardana.json": "Boardana scores contact database quality on errors in names, emails, and phones, and identifies duplicates, emojis, abbreviations, etc. Boardana has automatic contacts cleaning, email&phone validation, and enrichment available in beta, and all-in-one API.",
  "data/ph-top/2022/4/lingoo.json": "Lingoo is an AI powered translation service for small businesses, developers, and websites. We allow you to import your GitHub repo then just select which json files you want to translate. Our built-in CI/CD system triggers for every code change.",
  "data/ph-top/2022/4/prospecting-lead-management-academy.json": "This 100% free academy will propel you into the sales prospecting universe armed with the best tips, tools and techniques to get hundreds of new, quality leads. Become one of the first Close certified sales prospecting & lead management experts now!",
  "data/ph-top/2022/4/reflect-notes.json": "Reflect is a note-taking tool designed to mirror the way your brain works. We're simple, speedy, secure, and... dare we say it... quite pleasing upon the eye.",
  "data/ph-top/2022/4/bunch-of-design-for-figma.json": "A growing library of high-quality cutomizable 3D illustrations by me. Customize colors, create your own scenes, and use them anywhere you want. Simple one-time pricing for individuals, teams, and companies.",
  "data/ph-top/2022/4/email-health-report.json": "Get a 360° email health report to improve email performance 🔎 Email health snapshot with a detailed breakdown 🛠️ Suggested fixes & expert advice 📆 Free email strategy consultation with experts 📥 Email templates & best practices recommendations",
  "data/ph-top/2022/4/job-title-list.json": "Job Title List is a database of 4000+ job titles with data points that help to understand what jobs are trending right now. Filter by search volume, growth, cost-per-click (for related Google ads), and country.",
  "data/ph-top/2022/4/phasma-design.json": "Phasma is an Unlimited Design Requests studio that works with companies and startups that build tech for good ❤️ 10% of your subscription goes to Starenki.com.ua - a non-profit that helps elderly people in Ukraine 🇺🇦",
  "data/ph-top/2022/4/oaziz-dao.json": "🌎 Oaziz DAO is a platform that will introduce Web3 tools to the event sphere. With no division between all members and even possibilities for everyone, we clear the gap existing in centralized models.",
  "data/ph-top/2022/4/endel-wind-down.json": "Wind Down is a personalized soundscape designed to support a healthy routine before bed—easing you from evening to sleep with science-backed sounds. Simply set your bedtime, and let Endel × James Blake put your body and mind in a state of rest.",
  "data/ph-top/2022/4/damnnnn.json": "Damnnnn is a social learning platform that provides you a distraction free environment to expose yourself to new concepts in a more intuitive and bite-sized way.",
  "data/ph-top/2022/4/mesha.json": "Invest with your team using Mesha. Split the cost of an NFT (including gas) by creating a team. Invite your friends, add funds and invest - together. With support for credit/debit cards and integrated with OpenSea, start your collection in less than 5 minutes.",
  "data/ph-top/2022/4/paved-ad-network.json": "Newsletters are hotter than ever, but negotiating ads & sponsorships is stuck in the past. We’ve reimagined the sponsorship process— set up an ad unit in your newsletter once, & we’ll populate it with relevant, high-quality advertisements with every send.",
  "data/ph-top/2022/4/pulsetic-com.json": "Get notified by phone calls, SMS, email, Telegram, or Slack when a website goes down. Enhance your company's transparency in the eyes of your customers by creating appealing status pages, badges, and issue management reports.",
  "data/ph-top/2022/4/dao-legal-wrapper.json": "For your DAO to do business with the real world, it will need a legal structure. The DAO Legal Wrapper from Legal Nodes helps founders figure out the legal requirements for their project, including which countries are most suitable for their legal structure.",
  "data/ph-top/2022/4/feedback-fin.json": "Collect feedback on any website (from Webflow to React webapp) by simply plugging in a just few lines of code. Feedback Fin is open-source, fully customizable, and free.",
  "data/ph-top/2022/4/zen-okr.json": "Manage personal & team goals easily with Zen OKR. Completely FREE for personal use!",
  "data/ph-top/2022/4/the-future-of-product-management-report-2.json": "The third annual Future of Product Management report reveals the insights all Product Pros need to know. Read it and connect with the Makers to discover why now is the best time in history to build digital products, no matter your background!",
  "data/ph-top/2022/4/field-2.json": "Field helps product leaders provide clarity, direction and coherence to increase speed, impact and growth.",
  "data/ph-top/2022/4/glass-3.json": "Glass is a member-supported photo sharing app and community. Launched less than a year ago, we’re now on iOS, iPad, and the Web. No ads, no data-tracking, no engagement algorithms, no VC money, no incoming pivot-to-video.",
  "data/ph-top/2022/4/boxch.json": "Boxch is the first mobile crypto wallet and launchpad without commission fees, built on the Solana blockchain. Store, buy, sell, earn crypto fast and secure. Our product gives you the financial freedom you deserve.",
  "data/ph-top/2022/4/product-led-growth-book.json": "Read the #1 bestseller Product-Led Growth: How to Build a Product That Sells Itself for FREE! You’ll learn: ✅ Why PLG is of rising importance. ✅ How to showcase value – fast. ✅ Which free model is right for your business.",
  "data/ph-top/2022/4/see-ya-future-me-2-0.json": "Send a video message to yourself, your family, or your friend, we will deliver your video in the future! Yeah, it will be super slow 🐌🐌🐌🐌🐌",
  "data/ph-top/2022/4/snapied-design-tool.json": "Snapied is a platform for everyone - professional designers as well as novice users who are enthusiastic about designing and creating powerful designs with minimum effort. You need the design to stand out in the crowd.",
  "data/ph-top/2022/4/soteri-skin.json": "Inspired by and created for eczema and chronic skin conditions - Soteri Skin is dermatologist-approved skincare that corrects, then \"locks in\" the ideal skin-surface pH. Backed by science, our technology is suitable for even the most sensitive of skin.",
  "data/ph-top/2022/4/lensto-photo-background-effects.json": "Let Lensto be your photo editing companion. Our advanced AI will make your best look even better by adding effects such as cartoon style, background replacement, filter effects and more. All run on-device for complete privacy.",
  "data/ph-top/2022/4/robinize.json": "SEO-friendly content optimization tool that does the RESEARCH for you, so you can WRITE & OPTIMIZE your content faster. As a result, your article or blog post will drive more ORGANIC TRAFFIC from search engines.",
  "data/ph-top/2022/4/dokkio.json": "Dokkio brings together all of your content - across cloud storage, shared docs, email and messaging, desktop folders and the web. It uses AI to automatically tag and organize content to match how you work, search, stay current, collaborate, and more.",
  "data/ph-top/2022/4/unreal-engine-5.json": "Unreal Engine 5.0 enables game developers and creators across industries to realize next-generation real-time 3D content and experiences with greater freedom, fidelity, and flexibility than ever before.",
  "data/ph-top/2022/4/notionway.json": "Discover your Notion template and optimize your workflow.",
  "data/ph-top/2022/4/mojoauth-2-0.json": "MojoAuth is a passwordless authentication tool, built to make complex authentication mechanisms easier. Integrate MojoAuth to your app or website in just 5 minutes and allow your users to login into your platform without any password effortlessly.",
  "data/ph-top/2022/4/linksup-3-0-by-stack3-dao.json": "LinksUp 3.0 by Stack3 DAO - The most capable and 100% FREE storefront builder for NFTs, Token Gates, Services & Products🚀",
  "data/ph-top/2022/4/global-benefits-tools-by-oyster.json": "When you’re caring for a global team, you need to understand statutory and competitive benefits across a multitude of countries. Oyster’s self-serve tools get you the information you need to not only meet compliance, but also attract and retain top talent.",
  "data/ph-top/2022/4/no-code-quiz-trivia-maker.json": "The all-in-one quiz builder to grow your email list, reduce your CAC/CPL, and increase conversions.",
  "data/ph-top/2022/4/base-styles.json": "Brands need consistency. From your website to social media, the brand's look and feel should be the same. Base Styles stores all of your assets in one place and creates guidelines for easy access.",
  "data/ph-top/2022/4/moodstream.json": "Music streaming to change your mood. Music to study, work, increase productivity, sleep, meditate, improve mental health... And to sell more. Brands can create their \"mood\" and give the music away to their users or play it in their stores.",
  "data/ph-top/2022/4/user-experience-research-kit.json": "25 user research tools, methods, books & courses, and communities to ask for advice. The kit contains everything for UX research: from what is UX research and how to learn to practical tools and methods. The must-have UXR kit for every Maker.",
  "data/ph-top/2022/4/dropbox-shop-2.json": "Try Dropbox Shop, now in beta. Dropbox Shop makes selling your digital content—like art, workbooks, and music—as easy as copying and pasting a link. Available today to users on Dropbox Basic, Plus, and Pro plans in the U.S. Try it free at dropbox.com/shop.",
  "data/ph-top/2022/4/stacktape.json": "Stacktape is a DevOps-free cloud framework made for developers. It allows you to develop, deploy and run applications on AWS. With 98% less configuration and without the need for DevOps or Cloud experts.",
  "data/ph-top/2022/4/dao-wow.json": "DAO Wow is a search engine that allows you to search for DAOs and proposals, follow your favorite DAOs, and receive notifications about proposals via email and Discord. Never miss out when a new proposal is up for vote or about to close 🎉",
  "data/ph-top/2022/4/ngrok-2.json": "Spend more time programming. Add your localhost app to the internet with security, observability, and production scale in one command.",
  "data/ph-top/2022/4/the-engagement-guide-for-shopify-stores-2.json": "The one-stop solution for every Shopify store owner plagued with the problem of customer churn. This eBook illustrates the core customer engagement challenges faced by most Shopify stores and provides innovative solutions using game-like experiences.",
  "data/ph-top/2022/4/pinhole-pro-max.json": "6 different apertures and an 18-36mm variable zoom, redefine ‘sharp’ pinhole photography. For the first time ever, you can finetune the pinhole settings to achieve the sharpest image and bring a vintage look to modern photography and videography.",
  "data/ph-top/2022/4/the-best-remote-companies.json": "A lot of companies switched recently to remote work. But is remote work in their DNA? We are crowdsourcing the most complete list of the best remote companies. You can vote to select your favorite remote company and improve their position in the ranking.",
  "data/ph-top/2022/4/moni-talks-2-0.json": "Every freaking day we deliver important crypto content about DeFi, NFTs, Play-To-Earn, in-depth reviews and Learning guides, top interviews with market leaders. All this in simple and funky language. Don’t miss the next 100x projects and F🤐CK FOMO.",
  "data/ph-top/2022/4/threads-by-storychief.json": "Create beautiful social media carousels in under one minute out of Twitter thread from your favorite influencers. You don’t even need to come up with your own content! https://storychief.io/utilities/twitter-threads?utm_campaign=Utility%20Twitter%20Thread%20Designer&utm_source=Producthunt https://www.bipdash.com/ More about https://storychief.io https://www.bipdash.com/",
  "data/ph-top/2022/4/ua-founders.json": "Helping Ukrainian entrepreneurs to leverage a network of people willing to help out, so they can keep their business afloat in these troubled times. They can publish a request to get visibility from global entrepreneurs, who can also add an offer to help.",
  "data/ph-top/2022/4/bee-pro-free.json": "BEE Pro is the quickest way to design elegant, mobile responsive emails and landing pages. It gives you the design freedom & collaboration tools to get things done right, while cutting down on production time. 1-click push to Mailchimp, SendInBlue, Gmail, etc.",
  "data/ph-top/2022/4/encord-dicom-tool.json": "Annotate DICOM imagery at scale including CT, X-ray, MRI and ultrasound. Encord’s DICOM tool is a truly optimized medical imaging tool built specifically for radiologists, with full 3D views, native windowing functionality and AI-powered automation features.",
  "data/ph-top/2022/4/draftss-4-0.json": "Draftss is a productized design & code subscription service that helps to create high-quality designs & pixel-perfect code without spending $$$ on hiring designers & saving tons of time.",
  "data/ph-top/2022/4/quicklines.json": "Quicklines automatically creates personalized ice breakers to inject inside cold emails. Upload a CSV, wait 3 minutes, and receive the sheet with lines written. Put those lines into the first sentence of cold emails, and watch your responses increase 3x-7x.",
  "data/ph-top/2022/4/stationdb.json": "StationDB is a no-code tool, that allows users to have an instant admin panel to view and modify their databases online. All editing actions are available with no necessary queries to implement them, and it can all be done in a collaborative way within a team.",
  "data/ph-top/2022/4/twitrbnb.json": "Helping you solve your housing and related needs with the power of Twitter. Your go-to companion in a new city. A platform that helps you find flats, flatmates, service providers, co-working spaces, and a lot more by leveraging the power of community.",
  "data/ph-top/2022/4/bright-vpn.json": "Bright VPN is a free VPN with a wide range of country support and speed connection. No email or credit card is required to install or use the VPN. The desktop app is supported with browsers extension that can control the app directly from the browser.",
  "data/ph-top/2022/4/devtooly.json": "This is a directory of tools for frontend developers, organized by category for ease of use",
  "data/ph-top/2022/4/giide.json": "Giide is the antidote to TLDR content, endless videos, long podcasts and tedious reports. Add images, videos and clickable links to high-quality audio and keep your audience as engaged with your professional communications as they are with their social feeds.",
  "data/ph-top/2022/4/webhooks-for-sheets.json": "This is a Google Workspace add-on that will allow you to instantly create a webhook & start logging incoming data onto a Google Sheet, without writing any code or signing-up on a new platform 🔥",
  "data/ph-top/2022/4/quiet-reader-mac.json": "Quiet Reader is a free Mac app that lets you read articles (from your browser) or text highlights (from any app) distraction free. We take away all the ads, notifications, tabs and messy desktop so you can focus on what you're reading.",
  "data/ph-top/2022/4/the-notion-automation-hub.json": "Save time with pre-built Notion automations. This Notion hub is made out of 100+ pre-built automations for the common workflows and use cases. Explore automations, learning resources, creators, and databases that leverage Notion API. Built by the community. 🚀",
  "data/ph-top/2022/4/smile-coin-web3-sdk.json": "The Smile Coin SDK converts any business into a Web3 platform in 10 lines of code. With a simple integration, any business can start processing crypto payments and users gain instant access to the Smile Coin Network dApp, unlocking rewards the more they play.",
  "data/ph-top/2022/4/finity.json": "Finity is a Web3 Design System by Polygon Technology, built with Cope.Studio. What does Finity do? - Makes Web3 designing as easy as drag and drop - Scales your design along with your product - Ever-evolving elements- Free to use, for all",
  "data/ph-top/2022/4/masscode-2-0.json": "A code snippet manager for developers that helps you conveniently organize pieces of code and have quick access to them.",
  "data/ph-top/2022/4/moonlighter.json": "Moonlighter provides a space for all those competing ideas, notes, snippets, tasks, & more - all filling your head as an aspiring indie worker. Moonlighter focuses on evaluating ideas, implement them, and then keeping track of everything through to launch.",
  "data/ph-top/2022/4/makemynft-membership-nfts.json": "Launch your membership focused utility NFT collection with no-code Setup smart contracts, minting pages, and holder administrator portals, with zero technical effort. Bring your vision and your membership or utility NFT collection to life with MakeMyNFT",
  "data/ph-top/2022/4/safe-new.json": "SAFE.new is a tool from AngelList Stack to help founders & VCs generate SAFE documents. After you fill out the fields, you will be able to download a PDF to send for signatures.",
  "data/ph-top/2022/4/bitsneaks.json": "Depressed by the lack of creative use of technology in the world, we decided to install the Internet into our sneakers.",
  "data/ph-top/2022/4/micro1.json": "Hiring remote developers is hard. There are legal issues, finding great talent, benefits, global payroll, and much more. You pick the developer you like, we take care of all those problems, and they join your team directly.",
  "data/ph-top/2022/4/eco-index-by-changing-room.json": "Changing Room's Eco-Index provides consumers with a sustainability rating (1-5) of clothing products and brands based on both environmental and social factors and suggests lower-impact similar alternatives.",
  "data/ph-top/2022/4/aremykeyssafe.json": "If you have been in the Web space for a number of years, there's a good chance that you are still using some SSH keys you generated 13 years ago. 👵 They might be considered unsafe by today's standards. This app helps you check for that. 🏰",
  "data/ph-top/2022/4/laravel-shopper.json": "Shopper is a modern PHP application, built as a Laravel package, for e-commerce store administration with custom Livewire components.",
  "data/ph-top/2022/4/solclaim.json": "Solclaim makes the process of finding airdrops hassle-free. Just type in your wallet address and find airdrops you’re eligible for. It is that simple.",
  "data/ph-top/2022/4/side-project-os.json": "The ultimate operating system to help you bring your side projects to life. ✔️ 30 unique modules ✔️ Task management ✔️ User feedback ✔️ MVP ✔️ Deal pipeline and content hub A space to finally act on those ideas that are filling your notebooks!",
  "data/ph-top/2022/4/supacomments.json": "SupaComments is an open-source comment system for JamStack websites and blogs. The bundle size is less than 25kb on the first load and 45Bytes when cached. It doesn't have a lot of features right now. But I'm looking for your feedback to improve it.",
  "data/ph-top/2022/4/writerly-2.json": "Writerly is for everyone interested in creative writing. From first steps to advanced topics, Writerly is loaded with advice, exercises, ideas and prompts to help you develop as a writer, whether you’re a beginner or a seasoned pro.",
  "data/ph-top/2022/4/faucetli.json": "🦄 Faucetli is a minimal command-line tool to receive testnet tokens right away from your terminal. How does it work? - Configure your wallet address by using the faucetli request command and that's it 🎉",
  "data/ph-top/2022/4/eccco.json": "Add comments to any podcast platform, Netflix content, any website... literally anywhere you want! Expand the information of any url using \"share with\" available in any mobile device or the web version. Only text for now, but much more is coming! Join us!",
  "data/ph-top/2022/4/3d-bay-for-canva.json": "3D Bay is an extensive online collection offering high-quality, royalty-free 3D images. Get access to hundreds of 3D illustrations directly from the Canva interface to add to your design projects.",
  "data/ph-top/2022/4/sleep-cinema-3.json": "Sleep Cinema is an app which takes a revolutionary approach to sleep. Now you are able to choose any kind of dream you will see at night. Two main things you need - your headphones or speakers and an installed application on your smartphone. Fantasy!",
  "data/ph-top/2022/4/picsee-2.json": "Your best choice for organizing images and ideas. Help you collect, search, organize, share design files in one place. Super Fast Photo Viewer with Excellent Experience.",
  "data/ph-top/2022/4/form-chimp.json": "Form Chimp takes care of your form's backend while you focus on the front-end experience. 1 - 🛠 Create your form using your preferred tech (HTML,CSS,JS,ReactJS) 2 - 📡 Connect Form Chimp to your form, it takes less than 10 lines of code. 3 - 😉 Done!",
  "data/ph-top/2022/4/notion-sales-dashboard.json": "A digital dashboard to increase your sales pipeline with clarity and efficiency.",
  "data/ph-top/2022/4/taskmagic-by-v-one.json": "Save time, money, and stress by getting rid of manual processes and repetitive tasks with this FREE (for now) tool to help you automate your life for over 40 popular apps. Start automating for free. (BETA)",
  "data/ph-top/2022/4/elai-io.json": "We help companies generate educational and marketing video content with real humans from just text.",
  "data/ph-top/2022/4/flipkit-2-0.json": "Bring your drawings to life and create your own flipbook animation with FlipKit. Our big 2.0 update refreshes the entire user interface and brings FlipKit to the iPhone for the first time - allowing you to create your flipbooks from anywhere, anytime.",
  "data/ph-top/2022/4/simply-local.json": "Simply Local is a full fledged location based community portal. Each neighborhood area in the world is geofenced to create a decentralized private network. Within each network there are multiple public channels on different topics in which one can broadcast.",
  "data/ph-top/2022/4/audio-hijack-4.json": "Audio Hijack is a powerful utility for recording and processing any audio on MacOS. Audio from apps like Safari or Skype, hardware like mics and mixers, and even the entire system audio output, can all be saved. If you can hear it, Audio Hijack can record it.",
  "data/ph-top/2022/4/elon-mars.json": "Videogame \"Elon-Mars\" ==> Elon Musk is on Mars and the goal is to collect as many Dogecoins as possible; Jeff Bezos appears as an enemy. Developed as my first Javascript project during web dev. Bootcamp at Ironhack.",
  "data/ph-top/2022/4/featurebase-2-0.json": "Manage all customer feedback, bug reports, and feature requests in a single place. Announce updates through changelogs & visualize everything that you are working on through the product roadmap.",
  "data/ph-top/2022/4/schedulist.json": "Reduce Cognitive Load and Become Limitless with Schedulist. Effortlessly put anything on your mind into Schedulist; tasks, links, ideas. Follow up on it when you have time. Available for iOS, Android and web today!",
  "data/ph-top/2022/4/mindmesh.json": "Mindmesh is the workspace that puts you in control. Centralize work, notes, todos, and meetings. Bring in work from all your tools - Gmail, Slack, Jira... Jump back in in an instant. Focus on what you should be doing, right now.",
  "data/ph-top/2022/4/recordings-with-pitch.json": "Present together with short videos recorded directly on your slides. 👨‍👩‍👦 Record multiple presenters without any extra software 🎨 Continue editing your slides after adding recordings ▶️ Share links that can be played back at multiple speeds on any device",
  "data/ph-top/2022/4/horizon-ui.json": "Start building your dashboard with Horizon UI, the most trendiest Open Source Admin Template for Chakra UI & React!",
  "data/ph-top/2022/4/dabble-4.json": "Writing a book is challenging. Your writing tool shouldn't be. Act on your inspiration anywhere with online/offline access. Organize your book with drag and drop scenes, parts, and chapters. Breathe easy with always, all the time, every change autosaving.",
  "data/ph-top/2022/4/tribally-community-guide.json": "Boost user engagement, enhance retention, and grow super fast with our guide to in-app community building.",
  "data/ph-top/2022/4/spiti-connect.json": "Spiti is a private and powerful video library your team — for easy access, sharing, and collaboration. Spiti Connect allows you to securely share and collaborate on your videos with external people.",
  "data/ph-top/2022/4/loaders.json": "Free loaders & spinners. Built with HTML, CSS and a splash of SVG. Available for React and copypasta.",
  "data/ph-top/2022/4/notion-pack-for-product-managers.json": "Get the pack full of product management assets you need 🤩 Download your free templates that make your life easier as a product manager 🎁",
  "data/ph-top/2022/4/meta-api.json": "Meta API is where integration becomes an extension of your team, enabling you to consistently deliver innovation with speed and agility. * Import and use your own APIs * APIs Authentication management * Auto deployment and monitoring",
  "data/ph-top/2022/4/slidebean-all-access.json": "Slidebean wants to help you get ready to pitch to investors. The All-Access subscription gets you access to a suite of 10+ tools that help you build your pitch deck, setup your company, and start gaining traction so that you can build the next big thing.",
  "data/ph-top/2022/4/panoramata-co.json": "Emails, Ads, Automations, Landing pages, Stack : panoramata is the best ecom benchmark tool. +4000 DTC and brands tracked, from all sizes & industries. Featuring the best marketing search ever made on brands, emails and ads.",
  "data/ph-top/2022/4/tailwindpdf.json": "With tailwindpdf you can create PDFs and Images just from HTML styled with tailwindcss.",
  "data/ph-top/2022/4/designer-tips.json": "DesignerTips offers micro-tips and tips for creatives and innovators. Tools that save your time, Intros where you will learn new information, and Practices that will reinforce your new skills.",
  "data/ph-top/2022/4/keyword-insights.json": "Keyword Insights utilises live search engine data to cluster keywords into groups based on their similarity to one another. We combine this with machine learning to determine the intent of each cluster allowing you to identify content gaps quickly.",
  "data/ph-top/2022/4/text-to-app-generator.json": "No Code Text to App Generator leverages AI to convert text into native android and iOS mobile apps. All you have to do is to provide voice or text input and this revolutionary technology will understand the context and create a fully functional app in minutes.",
  "data/ph-top/2022/4/good-work-hacks.json": "Meet Good Work Hacks – a simple collection of strategies and mental models helping us to become the most productive versions of ourselves.",
  "data/ph-top/2022/4/crawlq-audience-research.json": "CrawlQ is a Predictive Audience Modeling Tool that Combines Humanized AI with the Proven Marketing Frameworks to Dramatically Improve Your Engagement and Content ROI",
  "data/ph-top/2022/4/the-collaborative-selling-handbook.json": "Collaborative selling is a process of working with collaborators on both sides of the fence (internal as well as external to the organization) to win deals. This book shows you how modern B2B organizations foster collaboration to grow faster."
}