{
  "data/ph-top/2022/1/token-around.json": "Intelligent. Crisp. Quick. Crypto | Metaverse | NFT | DeFi We analyze the internet, crypto trends, and social media activities algorithmically to bring you the quick summary right away every 20 minutes from 100+ publishers from the global crypto communities.",
  "data/ph-top/2022/1/dialo-2.json": "Easily design and share your digital business card via QR Code and short link. Add others' Dialo directly to your Contacts app.",
  "data/ph-top/2022/1/tin.json": "Tin is a product of TeamCode that can generate executable applications instantly without manual environment configuration.",
  "data/ph-top/2022/1/continuum.json": "Meet Continuum – The social platform owned by creatives.",
  "data/ph-top/2022/1/pika-2.json": "https://pika.rishimohan.me free and http://github.com/rishimohan/pika web app to quickly beautify your screenshots. You can add background gradients, tweak shadows, add rounded corners, tweak spacing and more. You can save the image as PNG file or copy it to clipboard.",
  "data/ph-top/2022/1/snappify.json": "snappify is a great tool to create and adjust beautiful code snippets easily. It has predefined styles for your code snapshot but also allows you to customize.",
  "data/ph-top/2022/1/harold-2-0.json": "No more updating a google spreadsheet or Notion template once and then never looking at it again. Harold is a quirky SMS bot, powered by AI that makes tracking your habits: simple 👊 convenient 🙌 & fun 🤓",
  "data/ph-top/2022/1/sherpa-travel-restrictions.json": "Sherpa is your guide to getting the right travel documentation and understanding up-to-date travel requirements. An independent resource, we are not sponsored by, affiliated with or funded by any government agency.",
  "data/ph-top/2022/1/menubarx.json": "https://menubarx.app/ is a powerful Mac menu bar browser that can pin any webpage on your menu bar just like an App. Whether it's a frequently visited website page or a website lacking native App, MenubarX can help users use it more efficiently and conveniently!",
  "data/ph-top/2022/1/open-target.json": "Everyone has some goals and expectations for the new year but it's not easy to keep yourself motivated for achieving that. Losing weight, publishing blog posts, creating passive income, or another thing. Open Target is the way to keep yourself motivated!",
  "data/ph-top/2022/1/not-boring-habits.json": "Combine the behavioral science of learning habits with a fun, beautiful game to not just track habits but to *build* them. Every day you take a step along a wondrous journey to master a positive habit or slay a bad one.",
  "data/ph-top/2022/1/pauseme-button.json": "A Bluetooth® Video and Microphone Controller (VMC) button that allows you to turn on and off your video or audio during Zoom calls with a single click.",
  "data/ph-top/2022/1/accountit-2-0.json": "Welcome to Accountit, a simple, but powerful daily transactions tracker that will definitely help you get a full picture of your finances. With Accountit, tracking and organizing all of your transactions becomes as effortless as possible.",
  "data/ph-top/2022/1/value-app.json": "A simple way to track the value of any NFT portfolio in real time.",
  "data/ph-top/2022/1/qr-code-generator-99406f64-9c12-425a-9d40-c3b8d0f18cac.json": "QR Code Generator is a powerful, simple, all-in-one QR code generator that helps drive app installs, gather feedback, promote your website, collect emails and more!",
  "data/ph-top/2022/1/huski-ai.json": "An AI-based content search engine to find usage of copyrighted content, such as trademarks, designs, or NFTs, used in the eCommerce space. Beta covers trademarks only.",
  "data/ph-top/2022/1/vanillalist.json": "Repository of handpicked best vanilla JavaScript plugins and resources to save time as a developer and create high-performance web apps.",
  "data/ph-top/2022/1/appmaker.json": "Appmaker is a no-code app builder that converts your Shopify store into a mobile app. Using the drag-n-drop app builder, store owners can now easily create and upload native apps to Appstore/Playstore. Add Appmaker to your Shopify store to give it a try.",
  "data/ph-top/2022/1/tweet100-challenge.json": "#Tweet100 is a free 100-day challenge to help you publish more on Twitter. 🛠 Built entirely with no-code 🤝 Helps you craft at least one good Tweet per day 📈 Some have grown their following by 4,000%! 🤯 Participate for free or join our community! 🚀",
  "data/ph-top/2022/1/life-tracker.json": "Life is precious, and so is your time. Get the digital journal of your activities right in your pocket! Strike the life balance to improve your focus and productivity.",
  "data/ph-top/2022/1/interviewkit.json": "InterviewKit is an all-in-one interview tool that lets you save you up to 80% of time. By lowering the time to interview, this app is an effort to make people interview more often. So we create more customer-oriented products, and a slightly better world ❤️",
  "data/ph-top/2022/1/relingo.json": "Relingo can assist you to read English articles and watch English videos quickly, based on what you are interested in. learn and remember words gradually while browsing the web without being disturbed.",
  "data/ph-top/2022/1/web3jobsboard.json": "Your source for jobs in the Web3 space from Blockchain, Crypto and Smart Contract startups to well established companies wanting to be part of the Web3 paradigm.",
  "data/ph-top/2022/1/glitch-editor-2022.json": "The biggest update ever to Glitch's editor is up to 300% faster. It offers an automatic Fastly CDN for assets, previews of 3D models, inline error reporting, better Prettier support, and one-click access to GitHub import/export + domains.",
  "data/ph-top/2022/1/kara-pure.json": "The first-ever machine that makes water from the air. And transforms it into 9.2+ pH alkaline one. Enriches it with 7 rare natural minerals. And continuously filters and purifies it with powerful UV-C light. Delivers 10 liters of clean and safe water daily.",
  "data/ph-top/2022/1/300-web3-predictions-for-2022.json": "1000s of people posted predictions for Web3 in 2022 last week. Here are the top 50 Twitter threads to get ahead on NFTs, DAOs, DeFi, P2E, BTC, ETH, L1s, L2s, etc...",
  "data/ph-top/2022/1/obsidian-flight-school.json": "🚀Obsidian Flight School is an educational product—and starter kit. It is designed to make you faster, more skilled, & more confident using the next gen note app called Obsidian. ⚡️ Fly around your notes faster than ever before...at the speed of thought",
  "data/ph-top/2022/1/unlock-7.json": "Set yourself free from billing and logistics so you can focus on building software instead of packaging, versioning, and distributing products to your customers.",
  "data/ph-top/2022/1/inboxthis.json": "Today, to save a web page or article to read later, we have to create bookmarks or use a new app (eg. Pocket) or manually email ourselves - it's painful 😰! With InboxThis, you can send any article/web page to your email inbox in just 1 click 👆.",
  "data/ph-top/2022/1/nft-inator.json": "NFT-Inator is a free toolkit to accelerate design and development of procedurally generated NFT projects. Create custom and randomised designs, test your layer combinations, and export images and metadata for Solana, Ethereum & Polygon.",
  "data/ph-top/2022/1/jini-design.json": "Beyond a directory of digital assets, it is an attempt towards learning some new technical processes to b found in my upcoming book \"Frontend Schema\". Check roadmap here: https://jini.design/?open=roadmap",
  "data/ph-top/2022/1/promoly.json": "Promoly helps creatives distribute their audio content over email and social media. With just one streamable link (Soundcloud etc.), you can turn your audio content into an attractive landing page for distribution to your email list and social network.",
  "data/ph-top/2022/1/non-nfts.json": "non-NFTs is an Open-source AI-Generated Artwork. The idea behind this project came from some hype around NFT more as a design trend rather than what it is actually. It is all open-source, so you can download all the arts for free.",
  "data/ph-top/2022/1/travel-friends.json": "Travel Friends is a simple website to connect with other travelers when you arrive in a new place. Add your pin to the map and then explore if there are other travelers nearby to connect with.",
  "data/ph-top/2022/1/salescamp-3.json": "Salescamp gives you a stunning customizable sales suite to drive growth at every stage of the sales cycle. Track all your sales activities in one place and identify the better customer for your business.",
  "data/ph-top/2022/1/pollinate.json": "You can now grow your newsletter using Twitter’s embedded signup functionality without sending it from Revue. Compatible with beehiiv, Mailchimp, MailerLite, ConvertKit, and Ghost.",
  "data/ph-top/2022/1/plask-2.json": "With Plask, anyone can digitize their movement and animate it in a matter of seconds with a webcam and browser.",
  "data/ph-top/2022/1/startup-recipes.json": "Learning lean startup is easy, putting it into practice is hard! Startup Recipes is It is a cheat sheet that helps idea-stage entrepreneurs to find product-market fit as quickly as possible by building minimum viable products right!",
  "data/ph-top/2022/1/ignition-gtm-beta.json": "Ignition helps PMM and PM teams launch more effectively, save time on planning, and create more internal alignment. It uses best practice-based workflows to predict product timelines, dynamically recommend plans, and centralize plans/tasks/assets/measurement.",
  "data/ph-top/2022/1/creator-resource-kit.json": "Creator Resource Kit is an ever-growing curated free collection of 1000+ tools and resources for Youtubers, Musicians, Photographers, Videographers, Writers, Podcasters & Gamers. Tools which help them create, distribute, manage, learn, monetize, grow & more.",
  "data/ph-top/2022/1/verifykit.json": "A new way of phone number verification that uses IM platforms as an alternative to SMS. Make use of WhatsApp and Telegram to verify your users and cut your verification costs by 80%, while supporting traditional SMS to reach every single customer out there.",
  "data/ph-top/2022/1/meritverse.json": "Meritverse is the professional network for the Metaverse. We enable you to verifiably showcase your skills and build a professional network that is incentivised to help you succeed. 🌐",
  "data/ph-top/2022/1/figma-academy.json": "Figma Academy is an all-new program that teaches advanced product design tactics with hands-on lessons that are delivered directly within Figma.",
  "data/ph-top/2022/1/shakespeare-ai-email-writer.json": "Goodbye, writer’s block. Tell SHAKEspeare about your business offering and the goal of your cold email, and it handles the writing for you. All you have to do is select the draft you like best and add it to a Mailshake campaign.",
  "data/ph-top/2022/1/showtime-gasless-nft-marketplace.json": "✦ Gasless: free minting + listing, no gas fees. You can even do free NFT drops! ✦ Instant royalties (compatible with platforms like Zora). ✦ Mint up to 10,000 editions. All for free. ✦ Eco-friendly NFTs on the 0xPolygon network. Much faster than usual.",
  "data/ph-top/2022/1/airadvisor.json": "AirAdvisor helps you verify if you are eligible for compensation for flight disruptions and works on your case for you. You may be entitled to as much as 600€ ($700) in compensation if your flight was delayed, canceled or overbooked within the last 3 years!",
  "data/ph-top/2022/1/obviously-ai-time-series.json": "We believe that time is the most incredible source of information, capturing the past, present and the future. That's why we built Obviously AI Time Series - The fastest, most precise no-code AI tool to predict business critical events down to a specific date.",
  "data/ph-top/2022/1/lohost-io.json": "Simply put, lohost is a way to serve a website to the internet from any local computer where you install the lohost website client. You keep all the files on your local computer and pick the subdomain where the website lives (https://{yourApp}.lohost.io)",
  "data/ph-top/2022/1/articlestaff-2-0.json": "ArticleStaff is a workflow system for the management of your freelance writers. It helps you to manage payouts to writers, invoicing from writers, as well as keep track of publishing dates and the progress of each article.",
  "data/ph-top/2022/1/asimov-security.json": "Robot Developers get a customizable and friendly solution they can use to apply quality gates prior to releasing robots into the wild. Operation teams get a centralized location from which they can manage the security aspects of all of their robots.",
  "data/ph-top/2022/1/certificates-by-graphy.json": "Certificates by Graphy lets you share beautiful custom certificates to all your learners at once. Pick a template, upload a CSV file, and send all certificates with a single click. Learners get a PDF and the option to add it to their LinkedIn with one click.",
  "data/ph-top/2022/1/design-gradients.json": "A free website for anyone looking for beautiful gradients for any project, curated by designers.",
  "data/ph-top/2022/1/printable-chore-chart-for-kids.json": "We created a handy set of FREE, Customisable and printable chore chart templates for kids aged 3-12 that help kids track their achievements and work towards a goal. Download our FREE Charts NOW! Find out more at https://www.ursor.com",
  "data/ph-top/2022/1/notion-resolution-board.json": "Plan and keep track of your new year resolutions in Notion.",
  "data/ph-top/2022/1/yamak.json": "Next-Gen AI-powered platform to write Content & Copy for your Blog, Social media, Website, Ads, SEO. We help humans to generate quality data with the help of AI. We save huge amount of time and human affort. Which is a very good thing to do. :)",
  "data/ph-top/2022/1/treeps.json": "Remember your life: it's a set of bright moments of your experience. Good, bad, inspiring, painful – they made us who we are. To become happier, we must create new vibrant moments by doing new things. Treeps selects it for you. Join our 700k+ community!",
  "data/ph-top/2022/1/strackify.json": "With Strackify you can create your profile and search for the book or category you are reading and see if anyone in the app community has added a playlist that matches your book and listens while reading, without leaving the app!",
  "data/ph-top/2022/1/tipsly.json": "Tipsly.io is a french toolbox with more than 100 free tools. It includes the best digital tools for Designers & Product Builder (No-Code). Each week, I add products to help you be more productive and use the best tools for your designs and websites.",
  "data/ph-top/2022/1/studio-54-nft-s.json": "Create your own customized NFTs Store. Start building your brand and your community in your domain. Every Chain, any payment method without coding and with zero cost upfront.",
  "data/ph-top/2022/1/reel-unlimited-for-slack.json": "Request unlimited graphic design tasks for your startup & collaborate faster with designers right on Slack, the app you already use all day. 👋 Request designs and collaborate in Slack 💯 First design request is free ⏰ 24 hours turnaround",
  "data/ph-top/2022/1/pomotimer.json": "Pomotimer is a pomodoro technique timer ⏲️ The purpose of this website is to help you to focus on your study, work, coding, etc. and boost your productivity 🚀",
  "data/ph-top/2022/1/phonecast-2-0.json": "Mirror iPhone/iPad to your Mac wirelessly. No need to connect iPhone/iPad to Mac with a cable. Demo what's on your iPhone/iPad in online-meeting, play games, draw live. PhoneCast 2.0 has a new rendering engine that makes it just as good as casting with cables.",
  "data/ph-top/2022/1/magic-copy-3-0.json": "Magic Copy allows you to copy text and links from your phone and paste it on your computer and vice versa! It’s a universal clipboard manager that works like magic. It's a real-time clipboard & notes app that syncs with all your devices hassle-free!",
  "data/ph-top/2022/1/graaphics.json": "Create easy, effective graphics for your social media. Choose your background, size, fonts, colors and text, and quickly export your designs, ready to post to your social media channels. Perfect for testimonials and quotes.",
  "data/ph-top/2022/1/cronly.json": "Manage your cron jobs in the cloud with built-in monitoring, or use our monitors for your local cron jobs. Implementation is just a few lines of simple code. Use our monitoring tools for your existing cron jobs or execute cron job tasks.",
  "data/ph-top/2022/1/square-qr.json": "Square QR is an online tool to generate beautiful dynamic QR codes that you can track.",
  "data/ph-top/2022/1/twitter-growth-challenge-2022.json": "Join the 2022 Twitter Growth Challenge. Build up an engaged audience, win prizes, meet new like-minded people. All for free.",
  "data/ph-top/2022/1/notrix.json": "A Simple notes app which saves all notes to browser storage locally. Users can create and delete notes for free with 100% privacy. It has awesome support for Markdown !!",
  "data/ph-top/2022/1/memento-mori-notion-calendar.json": "A digital Stoic Calendar built in Notion, around the principle of Memento Mori; remembering that you'll die. By using the calendar, you'll start living a little better by being reminded of your mortality every week as you check off another one lived.",
  "data/ph-top/2022/1/great-landing-page-copy.json": "Great Landing Page Copy is a little corner of the internet to find good landing page copywriting examples.",
  "data/ph-top/2022/1/ownvibe.json": "Ownvibe is the first marketplace where you can buy or sell items using short videos. Experience a new way of shopping with the Ownvibe short videos feed. Just swipe for new items and if you found the one you like, tap its price button to purchase it.",
  "data/ph-top/2022/1/multiclock-screensaver.json": "Free macOS screensaver that displays the time (and nifty animations) using 24 customizable clock faces",
  "data/ph-top/2022/1/glip-2.json": "Glip is a platform for live-streamers to drop NFTs, live on stream & build their NFT community. Twitch & Youtube streamers can unlock a new direct monetization channel & offer exclusive experiences to their superfans, without paying hefty platform commissions.",
  "data/ph-top/2022/1/tulr-io.json": "Tulr lets you combine Videos, Tables, Forms, and Calendars, and apply powerful automation to suit your workflows. With minimum or no help, anyone can create powerful apps such as Applicant Tracking, Email Marketing, Video Pitches, and many more.",
  "data/ph-top/2022/1/databar-ai.json": "Databar.ai is a no-code API marketplace. Connect to any data API in under 3 clicks! 🚀 No technical expertise required 🏁 Fast and easy: from landing to dataset in under 30 seconds ✅ Automated authorization, headers, and pagination",
  "data/ph-top/2022/1/mesh-y.json": "🌄 Meshy is a design tool to generate beautiful & colorful mesh gradients. Generate multiple random mesh gradients along with cool color and size customizations. Free export your gradient as PNG formats.",
  "data/ph-top/2022/1/peach-productivity-clock.json": "Productivity is a tricky beast to tame. Peach is a FREE tool that helps you track your time and what you do with it. It does so by applying some well-researched productivity techniques that pros use. Note: Use both the techniques and the tool for best results.",
  "data/ph-top/2022/1/speechly-reactive-voice-ui-api.json": "Speechly is the fast, accurate, and simple Voice Interface API. Our proprietary technology lets developers with no speech recognition or NLU experience easily add multi-modal voice UI functionalities into any digital application with just a few lines of code.",
  "data/ph-top/2022/1/droit-addons-for-elementor.json": "Droit Addons for Elementor is an easy-to-use plugin that enhances your Elementor page builder user experience with more robust & powerful widgets, elements, modules, & features.",
  "data/ph-top/2022/1/wordle.json": "A simple, free, daily game. If Mastermind and Hangman had a baby, you'd get Wordle.",
  "data/ph-top/2022/1/importify-dropshipping.json": "Importify is the leading platform for eCommerce sellers looking to import and sell Dropshipping products in their stores. It will save you time and let you focus on making more sales and managing your business.",
  "data/ph-top/2022/1/color-picker-chrome-extension.json": "A simple, light and free to use HEX color picker by AdCreative.ai team that does not collect any information from your usage or account. NOTE: We have several planned updates in the upcoming weeks.",
  "data/ph-top/2022/1/dark-habits.json": "Daily habit tracker in a google sheet.",
  "data/ph-top/2022/1/easypop.json": "With no coding, or setup hassles, you can launch on-site promotions for Shopify in under 5 minutes. Use Easypop to engage your customers, grow your audience, and increase sales.",
  "data/ph-top/2022/1/iteration-x.json": "Iteration X allows teams to annotate and edit any live website or web app directly in Chrome. No need to waste time and energy with screenshots, video calls and endless email and chat anymore. Improve any page and share the result with your team in seconds ✌️",
  "data/ph-top/2022/1/lottie-animations-by-iconscout.json": "A library of over 10,000 Lottie Animations for you to enhance your designs. Drive more engagement and improve your user experience with animations that you can use anywhere: web, app, social media, presentations, and more. Say bye to static images.",
  "data/ph-top/2022/1/amy-2.json": "Amy’s AI-powered Chrome Extension saves you days of research by providing you with information from across the web and actionable insights about every person you meet with, helping you personalize and ace all of your meetings!",
  "data/ph-top/2022/1/listener-for-zoom.json": "Bookmark important moments of your Zoom calls in real-time and easily turn long recordings into bite-sized video clips. Free while in Beta. Works with licensed (paid) Zoom accounts only.",
  "data/ph-top/2022/1/upscale-media-free-resolution-enhancing.json": "Automatically upscale image resolution up to 4x the original size without loss in quality with our AI tool 🔥 It’s free and forever will be. 🔍 Make your images automatically bigger by 2x, 4x. ✨ Remove JPEG artifacts 🤖 No pixelation or blurry details.",
  "data/ph-top/2022/1/manganum.json": "The inspirational new tab with fantastic photo and video backgrounds and ruthless motivation widgets turns your Google Chrome into a productivity machine. Clock and weather widgets are also present. Developed with love in Minsk and Tokyo 🤍❤️🤍️",
  "data/ph-top/2022/1/poeticmetric-analytics.json": "Make business decisions without compromising your visitors' privacy. No cookies or personal data collection. So you don't have to worry about cookie banners or GDPR, CCPA, and PECR.",
  "data/ph-top/2022/1/supernova-io.json": "Supernova enables you to build, manage and share design systems coherently across all disciplines, build fully customizable documentation sites with absolute ease and automate tedious delivery of design system assets to your codebases.",
  "data/ph-top/2022/1/zipmessage.json": "ZipMessage replaces live meetings with asynchronous conversations. Send and receive video and screen messages with customers or teammates. Share your personalized link to start an async conversation.",
  "data/ph-top/2022/1/vision-ui-dashboard.json": "Most trendiest, complex and innovative Chakra UI & Material Dashboards Made by Simmmple & Creative Tim. Start your Development with an Innovative Admin Template for Chakra UI or Material UI.",
  "data/ph-top/2022/1/arcade-3.json": "Showcase your products with interactive demos that can be embedded inside websites, blog posts, or tweets. ⠀ Arcades are super easy to create, embed, and maintain and fun to play!",
  "data/ph-top/2022/1/timo-2-0.json": "Put your todo list and time tracking in one place with Timo. Ditch the multi-app dance & focus on whats important. Getting your work done, and billing your clients. Track with Timo & you'll have all you need to invoice your clients or fill in your timesheets.",
  "data/ph-top/2022/1/clover-v1.json": "Clover is the digital notebook that blends notes, tasks, whiteboards, and a daily planner into one streamlined app so you can spend more time thinking and less time fussing with your tools.",
  "data/ph-top/2022/1/collx.json": "CollX (“collects”) answers the age-old question: “What’s it worth?” The app can scan any baseball, football, or basketball card and instantly ID it and get the avg market value. Then build a collection, track values, follow friends, trade, buy and sell.",
  "data/ph-top/2022/1/pointcard-titan.json": "Meet PointCard™ Titan — the card that keeps up with you. Personalized, precise, and transparent from the ground up, this new charge card allows you to choose your rewards and use points your way.",
  "data/ph-top/2022/1/alwane.json": "A web-based tool for extracting colors from a chosen website or an existing CSS code; it also regroups/orders colors and gives you, in the end, a CSS/Sass colors palette.",
  "data/ph-top/2022/1/nonfik.json": "Nonfik is a gated content library, built on discussion-worthy freebies and powered by social reading functionality like: 📚 A shareable bookshelf 💬 Notes & discussions ⭐ Expert & community reviews 🗂️ Custom collections for onboarding or educating peers",
  "data/ph-top/2022/1/sieve-29e50984-ed30-49c2-a191-543178a4f3ae.json": "Sieve is an API that helps you store, process, and automatically search video data–instantly and efficiently. Find the 1% of data that’s interesting within petabytes of raw video, tag important metadata, and build high-quality datasets with Sieve.",
  "data/ph-top/2022/1/workona-iphone-app.json": "Workona for iPhone lets you access work anytime, anywhere Easily access project tabs, docs, and links when you’re on the go. With your iPhone, you can save any webpage for later and access the tabs you have open on your desktop browser.",
  "data/ph-top/2022/1/punksvsapes.json": "The Punks vs Apes is the first on-chain puzzle game on ethereum blockchain. A collection of 9,998 of this unique interactive art and music NFTs. Every move is recorded and stored on-chain forever till the end of time. Have a look, or play it yourself :)",
  "data/ph-top/2022/1/super-design.json": "Save hours on creative research and find the best designs across thousands of screenshots updated every day.",
  "data/ph-top/2022/1/purrfect-utm-builder-by-stack-moxie.json": "The only free UTM builder for easy and error-proof URLs. Accurate UTMs lead to accurate analytics. Integrate your tech stack, use standard values and avoid the analytics hairball caused by poorly managed UTMs. It's \"purrfect\" - Uriel Trace Moxie \"U.T.M.\" Cat",
  "data/ph-top/2022/1/tiny-sketchbook-by-cloudhq.json": "Tiny Sketchbook is a simple to use app that lets you to create quick doodle art drawings. ~5 Benefits~ ✅ Visually show what you need in a sketch ✅ Create doodle sketch art ✅ Collaboration / Team bonding ✅ Classroom assignments ✅ De-stress with art therapy",
  "data/ph-top/2022/1/chaty.json": "Provide your website visitors' a frictionless customer communication by allowing customers easy access to all the platforms you’re available on improving your customers’ experience and increasing your chances of conversion or sales.",
  "data/ph-top/2022/1/dryfta-2.json": "Dryfta helps event organizers collect abstracts & reviews, sell tickets online, create interactive program schedules, host virtual meetings, and boost attendee engagement with a full-featured networking app.",
  "data/ph-top/2022/1/surfable-apps.json": "Install your favourite websites as apps to directly access them from your dock or spotlight search. This service is for free and contains more than a million installable websites!",
  "data/ph-top/2022/1/buzz-by-streambee.json": "Imagine Cameo, but for DMs. Buzz is a DMs monetization tool for Creators with support for Free and Paid DMs. Use our advanced filters to only chat with your most loyal fans. Launching today with integration to Twitch and support for Twitch Subscriptions.",
  "data/ph-top/2022/1/design-landscape-in-202x.json": "50+ insights from senior designers at Adobe, Amazon, Figma, Nasdaq, Microsoft, etc. + 12 ideas to boost your career in design in 2022–2030.",
  "data/ph-top/2022/1/growth-hacking-resources-3.json": "This curated Growth Hacking Resources list will help you grow faster by showing you the best resources to learn about growth hacking. Get Full access to 100+ Resources as an Airtable File This File Includes Resources Name, URL, Description, Image, Type",
  "data/ph-top/2022/1/nft-sales-bot.json": "NFT Sales Bot is a tool I wish existed when I launched my first 3(!) NFTs in 2021. Because when you sell an NFT, you want everyone in your community (Discord, Twitter followers, etc) to know about it. Why? Because this social proof drives even more sales.",
  "data/ph-top/2022/1/get-rich-quick.json": "Instead of devising complex ways to scam people out of money, just go to this website, select how much money you need, enter your wallet address, click a button, and get that money. No hassle, quick, easy, simple, free. Enjoy!",
  "data/ph-top/2022/1/tipybit.json": "Receive support from your audience in Bitcoin. Thanks to the Lightning Network, anyone can send you as little as $1 instantly. They can leave a message or just tip anonymously. Open to the entire world without restrictions.",
  "data/ph-top/2022/1/clay-css.json": "Micro CSS util class for applying inflated fluffy 3D claymorphism styles to HTML elements. Fully customizable and extensible with CSS variables. SASS mixin is also included for even more styling options.",
  "data/ph-top/2022/1/medusa-express.json": "🔥 One-page checkout flow ⭐️ Sell directly through automatically generated product links ⚡️ Open-source allowing you to add your own touch 🎉 Get up and running in minutes 🛠 Built with Next.js",
  "data/ph-top/2022/1/lusha-prospecting-platform.json": "Lusha Prospecting Platform is the simplest and most accurate way to sort and reach your dream prospects. Cut prospecting time with laser-targeted lists and connect with decision-makers faster to create more revenue opportunities.",
  "data/ph-top/2022/1/heybooster-2-0.json": "heybooster analyzes data across all your marketing channels and delivers actionable insights for optimizing your marketing strategy. It reports by highlighting problem areas and prioritizing them.",
  "data/ph-top/2022/1/mailercloud.json": "Mailercloud is a cloud-based email marketing tool, enriched with great features, which help users to build strong relationships with their audience. It is ideal for those who wish to improve engagement rate and conversions.",
  "data/ph-top/2022/1/plum-lite.json": "Plum Lite is a simple way for a small team in India to get started with health benefits. It includes health insurance, unlimited doctor teleconsultations, wellness sessions, discounted medicines and checkups, and exceptional customer support. Paid monthly.",
  "data/ph-top/2022/1/akiflow-3-0.json": "With Akiflow you can: ✔️ Import your tasks from your tools in a single inbox 📅 Block time for your tasks in the calendar ⚡ Use Shortcuts and the Command Bar to create tasks/events 🔔 Get alerts before your meetings and join with one click And much more",
  "data/ph-top/2022/1/free-bio-link-page-by-sendpulse.json": "Create a bio link page for your Instagram, Twitter, or YouTube profile 🔗 ✅ list your social profiles and contact info ✅ get mailing list and chatbot subscribers ✅ showcase and sell your products One bio link page is FREE, a Premium plan is just $13/year",
  "data/ph-top/2022/1/karma-by-goodera.json": "Karma, is a Zoom App powered by Goodera which helps teams to do good, feel good during their Zoom meetings. Attendees can take simple actions together to support a cause they care about supported by nonprofit partners across 100+ countries, in just 10 minutes!",
  "data/ph-top/2022/1/thousand-faces-club.json": "Thousand faces club&nbsp;is a community for creators to find peers, seek mentorship and discover best practices. We empower young creators&nbsp;to make their road to success more delightful and less lonely.",
  "data/ph-top/2022/1/notion-themes.json": "Notion Themes is an open-source web extension to apply custom themes to Notion, Install Notion Themes and change the overall look and feel of Notion. Select from 10+ different dark/light color schemes. Works on Chrome/ Brave/ Firefox/ Opera/ Egde browsers.",
  "data/ph-top/2022/1/hdr-plus-2-0.json": "Capture HDR Photos like a pro or the easy way Auto mode: capture HDR photos using artificial intelligence to choose the best EVs. Manual mode: adjust ISO and exposure time for each area in the scene. Discover more great features in the app",
  "data/ph-top/2022/1/people-also-search-for.json": "A free tool that uses Google's data and search results to help you find keywords your audience is (also) searching for.",
  "data/ph-top/2022/1/productlane.json": "Complement Linear with feedback management, customer segmentation, a public roadmap, and an automatically generated changelog. In the same look and feel, with CMD+K, shortcuts, dark mode, real-time sync, 100ms rule, you name it!",
  "data/ph-top/2022/1/dropshare-5.json": "Upload screen shots, screen recordings, files, literally anything and share it immediately with anyone by link. Dropshare is your go-to file sharing tool on macOS and iOS that works with almost any popular storage provider and self-hosted solutions.",
  "data/ph-top/2022/1/the-kool-aid-factory.json": "Getting company culture right takes work. The Kool-Aid Factory is Silicon Valley's shared playbook for getting there, your way.",
  "data/ph-top/2022/1/retroteam.json": "Throw away the post-it notes and take your Retrospectives online with RetroTeam's beautiful, privacy-first platform - complete with features like time-boxing, presets and custom retro formats",
  "data/ph-top/2022/1/grainients.json": "Over 2000+ high resolution, grainy gradients to elevate your designs. Explore a huge range of grainy gradients combining 3 different grain effects, 18 bi-colour and tri-colour gradient combinations, and 16 gradient layout variations.",
  "data/ph-top/2022/1/popwork.json": "Popwork is the app that helps managers and teams work better together. Take your team management to the next level and: 💬 Drive great 1-to-1 meetings 🌈 Visualize your team’s mood & workload 💁 Share instant feedback ✅ Follow up week on week 🎯 Track OKRs",
  "data/ph-top/2022/1/draw-your-nft.json": "Now draw and mint yourself a funky NFT 🖼",
  "data/ph-top/2022/1/token-master.json": "Token Master is a plugin for Figma that automates your color design tokens. With Token Master, you can edit styles in design tokens and quickly create new color modes. Just pick tokens with the same color and edit them at once!",
  "data/ph-top/2022/1/copywriting-examples.json": "330+ hand picked copywriting examples by Harry Dry, creator of Marketing Examples.",
  "data/ph-top/2022/1/creator-economy-buzz.json": "Each week on Creator Economy Buzz, we handpick the most important articles, videos, blogs and tweets from creators, investors and thought leaders in the space. Our summarised highlights + insights are the easiest way for creators to catch up on what matters.",
  "data/ph-top/2022/1/what-is-an-indie-maker.json": "😒 Are you tired of explaining to your relatives what an indie maker is? 💡 Next time, send them this website!",
  "data/ph-top/2022/1/community-tools-index-by-orbit-2.json": "We surveyed community builders about the tools they use daily and mapped the results into the Community Tools Index. With 300+ tools across 18 categories, you can discover new, useful software that helps you make community happen.",
  "data/ph-top/2022/1/snippet-3.json": "a macOS quick link finder inspired by https://uiw.tf get the https://testflight.apple.com/join/RTRJrZYM building this to remember all sorts of cool links and to hit my routines each day let me know on twitter what you'd like to see next!"
}