{
  "data/ph-top/2022/1/token-around.json": "Intelligent. Crisp. Quick. Crypto | Metaverse | NFT | DeFi We analyze the internet, crypto trends, and social media activities algorithmically to bring you the quick summary right away every 20 minutes from 100+ publishers from the global crypto communities.",
  "data/ph-top/2022/1/dialo-2.json": "Easily design and share your digital business card via QR Code and short link. Add others' Dialo directly to your Contacts app.",
  "data/ph-top/2022/1/tin.json": "Tin is a product of TeamCode that can generate executable applications instantly without manual environment configuration.",
  "data/ph-top/2022/1/continuum.json": "Meet Continuum – The social platform owned by creatives.",
  "data/ph-top/2022/1/pika-2.json": "https://pika.rishimohan.me free and http://github.com/rishimohan/pika web app to quickly beautify your screenshots. You can add background gradients, tweak shadows, add rounded corners, tweak spacing and more. You can save the image as PNG file or copy it to clipboard.",
  "data/ph-top/2022/1/snappify.json": "snappify is a great tool to create and adjust beautiful code snippets easily. It has predefined styles for your code snapshot but also allows you to customize.",
  "data/ph-top/2022/1/harold-2-0.json": "No more updating a google spreadsheet or Notion template once and then never looking at it again. Harold is a quirky SMS bot, powered by AI that makes tracking your habits: simple 👊 convenient 🙌 & fun 🤓",
  "data/ph-top/2022/1/sherpa-travel-restrictions.json": "Sherpa is your guide to getting the right travel documentation and understanding up-to-date travel requirements. An independent resource, we are not sponsored by, affiliated with or funded by any government agency.",
  "data/ph-top/2022/1/menubarx.json": "https://menubarx.app/ is a powerful Mac menu bar browser that can pin any webpage on your menu bar just like an App. Whether it's a frequently visited website page or a website lacking native App, MenubarX can help users use it more efficiently and conveniently!",
  "data/ph-top/2022/1/open-target.json": "Everyone has some goals and expectations for the new year but it's not easy to keep yourself motivated for achieving that. Losing weight, publishing blog posts, creating passive income, or another thing. Open Target is the way to keep yourself motivated!",
  "data/ph-top/2022/1/not-boring-habits.json": "Combine the behavioral science of learning habits with a fun, beautiful game to not just track habits but to *build* them. Every day you take a step along a wondrous journey to master a positive habit or slay a bad one.",
  "data/ph-top/2022/1/pauseme-button.json": "A Bluetooth® Video and Microphone Controller (VMC) button that allows you to turn on and off your video or audio during Zoom calls with a single click.",
  "data/ph-top/2022/1/accountit-2-0.json": "Welcome to Accountit, a simple, but powerful daily transactions tracker that will definitely help you get a full picture of your finances. With Accountit, tracking and organizing all of your transactions becomes as effortless as possible.",
  "data/ph-top/2022/1/value-app.json": "A simple way to track the value of any NFT portfolio in real time."
}