{
  "data/reddit-books/r/books/comments/klnepp/im_a_newbie_to_epic_scifi_literature_and_reading.json": "Ok. I know that this post is going to be downvoted to hell, although I never\nunderstood why people downvote a post that has a different opinion to theirs,\nbut I will say it anyways.. Reading DUNE did not turn out the way I thought it\nwould.\n\nI liked science fiction ideas in general ever since I was…",
  "data/reddit-books/r/books/comments/knr9n6/tomorrow_is_public_domain_day_in_the_us_what.json": "The big ones coming out of copyright tomorrow include The Great Gatsby\n(Fitzgerald), Mrs. Dalloway (Woolf), In Our Time (Hemingway) and An American\nTragedy (Dreiser). Other authors with books coming out of copyright include\nKafka, Christie, Huxley, Lewis, Dos Passos, Wharton and Maugham.\n\nLonger…",
  "data/reddit-books/r/books/comments/ko1vsu/oh_my_god_and_then_there_were_none_by_agatha.json": "Just finished ‘and then there were none’. That has to be the most ingenious and\nbest mystery book I’ve ever read. I have been sitting here for half an hour\ntrying to compute what I just read. I cannot express in words how bloody amazing\nit was. You all must read it! Christie really is the queen of…",
  "data/reddit-books/r/books/comments/kocewk/shrek_was_a_book.json": "I was doing some reading about the history of Shrek\n[https://upload.wikimedia.org/wikipedia/en/a/a7/Shrekcover.jpg] (long story),\nand learned that it was a children’s book written ten years before the movie\ncame out.\n\nNot only that, but it was written by William Steig--who you might recognize as\n1.…",
  "data/reddit-books/r/books/comments/krhet2/found_my_love_for_reading_again_by_treating_books.json": "Part of my New Years resolution is to read more. I continually set this goal for\nmyself but never follow through as I find I get bored pretty easily and need to\nswitch my focus. Because of this, it’s been hard for me to get through a book\nentirely.\n\nOn January 1st, I picked up one of the books I got…",
  "data/reddit-books/r/books/comments/ksd5d1/stephen_kings_writing_should_be_broken_into_three.json": "I qualify as a Constant Reader. I've read (almost) every Stephen King novel,\nnovella, short story, and non-fiction under his name - I'm missing the Gwendy\nworks, the book about the 2004 Red Sox season, and when he puts out a short\nstory as a part of a multi-author anthology.\n\nWhat I have come across…",
  "data/reddit-books/r/books/comments/kuendn/do_you_ever_start_reading_a_book_but_dont_get.json": "I started the year on a fantasy-romance high with 'The Shadows Between Us' and\nafter looking for suggestions from r/suggestmeabook [/r/suggestmeabook] I\nfollowed it up with Uprooted. Turns out the romance is basically a side plot and\nI've been dragging myself to read through it so I can get to the…",
  "data/reddit-books/r/books/comments/kvm0na/which_contemporary_book_written_in_the_last_20.json": "Can you imagine people reading something you've enjoyed now, say 200 years\nlater. The thought is so fascinating to me. Which recent book do you think will\nstand the test of time :)\n\nNote: just added 20 years as reference point, let me know if there's something\nwritten slightly earlier that you think…",
  "data/reddit-books/r/books/comments/kw7t6m/does_a_bad_ending_ruin_a_book_for_you.json": "I think that in my case it depends on the quality of the rest of the story. If\nI'm reading a book and hating every minute of it when I get to the bad ending it\nwould just become one more thing to complain about later on, like a cherry on\ntop of a pile of garbage.\n\nIt's a lot worse when the book is…",
  "data/reddit-books/r/books/comments/kwc9ij/books_set_in_the_covidreality_are_going_to_start.json": "I've just realised that I won't be able to read most of the new books - because\nI'm not ready to read about people wearing maska, people isolating etc. Not yet,\nat least. Maybe one day in the future. But I hate this reality and I don't cope\nwith it well. I just hate the thought of reading about it,…",
  "data/reddit-books/r/books/comments/kx1jih/unpopular_opinion_jumping_between_different.json": "Probably going to get downvoted for this, but I seriously dislike when authors\njump between different characters storylines in each chapter. I don’t have a\ngreat memory so I spend a lot of the time trying to remember where they left\noff. Also, sometimes I don’t like the character or their storyline,…",
  "data/reddit-books/r/books/comments/l0lope/i_didnt_think_lolita_would_mess_me_up_so_bad.json": "Sorry if gushy posts about how a book made me cry aren't allowed, but Jesus\nChrist man.\n\nI knew what Lolita was before I read it. I knew it was about a sick, evil man\n\"falling in love\" with a little girl and taking advantage of her after her\nmother dies. But I think going into the book with this…",
  "data/reddit-books/r/books/comments/l2cwhg/i_dont_care_what_anyone_else_says_treasure_island.json": "It's frightening! Not only that, but on a literary level, it's also written like\na horror novel. Think about it.\n\n * Overarching sin? Yes, greed.\n\n * The supremely innocent entangled with the supremely guilty? Yes Jim Hawkins\n   and John Silver.\n\n * Violence as a central focus? I'd say that's a big…",
  "data/reddit-books/r/books/comments/l4h5pd/i_just_finished_the_book_thief_by_markus_zusak.json": "I recently finished The Book Thief by Markus Zusak (I may be a little late to\nthe party), and it really left quite the impression on me. I spent the last\nfifty or so pages bawling my eyes out even though there are giveaways to the\nending from the outset.\n\nHowever, the thing I found most enveloping…",
  "data/reddit-books/r/books/comments/l4mmlw/ive_finally_gotten_my_mom_to_pick_up_112263_and.json": "I was always an action/adventure/scifi fan, and had never explored King until\nthe second half of 2020 I’ve been ripping through his books, and came across\n11/22/63, which sucked me in. I had it on audiobook and went out of my way to\ndrive, just to listen to it. I listened to it before I slept. I…",
  "data/reddit-books/r/books/comments/l4nsxo/ever_read_a_book_that_just_made_you_feel_dumb.json": "I'll preface this by saying that I think I'm pretty well-read. I think that\ncompared to the general population, I have an above-average vocabulary. But\nGnomon by Nick Harkaway is making me feel illiterate. The guy's word choices are\nso foreign to me, and used with such frequency that if I were to…",
  "data/reddit-books/r/books/comments/l4p0kx/has_anyone_ever_completely_misunderstood_or.json": "I ask because I read And Then There Were None by Agatha Christie when I was in\nhigh school, but I skipped the epilogue because I guess I thought it was boring?\nAnyway, for years I always assumed that the last character alive had been the\nmurderer - until two weeks ago when someone mentioned here…",
  "data/reddit-books/r/books/comments/l4qqx2/im_hafsah_faizal_bestselling_author_of_we_hunt.json": "Hey Reddit! I'm Hafsah Faizal, award-winning and bestselling author of WE HUNT\nTHE FLAME and WE FREE THE STARS, which released last week, and the upcoming A\nTEMPEST OF TEA. I write fantasy for upper young adult, though I do like to\nconsider my work to be good crossover material for those in search…",
  "data/reddit-books/r/books/comments/l51uzx/absence_of_menstruation_in_teenya_fiction.json": "This has bothered me for years, but I never thought to actually discuss it until\nnow.\n\nAs a kid, I definitely noticed that the female main characters in my favourite\nbooks never seemed to menstruate (or even mention/think about it) despite being\nof an age where it would almost definitely be on your…",
  "data/reddit-books/r/books/comments/l53wr6/unpopular_question_what_word_will_describe_the.json": "Why does everyone say that they \"read\" a certain book when they \"listened\" to\nit. I know it's just semantics, but language is here to provide clarity to our\nexperiences, why do we make this so confusing. What's wrong with the word\n\"listening\"?\n\nOne is not better than the other. Nobody cares. But…",
  "data/reddit-books/r/books/comments/l5m79z/ive_probably_read_stephen_king_more_than_almost.json": "My wife, on the other hand, LOVES Stephen King and has read all his books. I’ve\nnever been a fan, although I’ve liked movies that I didn’t know were based on\nKing novels at the time (Shawshank, Green Mile). I’ve never really liked his\nwriting. I’m not saying there’s anything wrong with it but I’m…",
  "data/reddit-books/r/books/comments/l5qckn/psa_maybe_you_havent_fallen_out_of_love_with.json": "Organizing the library in my room at my parent's place, I think I now understand\nbetter why I stopped reading from ages 18 to 26 after being a voracious reader\nbefore that. I felt like sharing this story because I believe it might not be\nthat uncommon, and I'm interested in getting other people's…",
  "data/reddit-books/r/books/comments/l5tn1p/the_experience_of_reading_a_book_as_an_adult.json": "I recently picked up Ender's Game again. Ender's Game was that book for me. It\nwas assigned in my sixth grade reading class, and although the first chapter was\nassigned, I read the whole thing the first weekend. It introduced me to science\nfiction, but beyond that it completely engrossed me. Looking…",
  "data/reddit-books/r/books/comments/l62h00/just_finished_war_and_peace_in_27_days_it_is_not.json": "(Anthony Briggs Penguin Translation) Before starting reading, I was expecting\nthat I'd need to take a break in between each of the four volumes. I had heard\nTolstoy's opus described as a slog,  with one friend stating that \"It's a fine\nbook, so long as you don't mind endless pages describing a…",
  "data/reddit-books/r/books/comments/l6xtkj/please_help_me_make_my_mom_happy_reddit.json": "Hey Reddit and /r/books. I'm using a throwaway account so I don't fully dox\nmyself, but I was really hoping that a giant community of book enthusiasts might\nbe able to help me. Since you're fans of stories, I'll let you hear mine.\n\nMy mother is a wonderful person. She's the most giving, caring,…",
  "data/reddit-books/r/books/comments/l6xw2t/i_just_finished_where_the_crawdads_sing_wow.json": "So it took me a while to finally pick this book up, I'm normally into thriller,\nmystery, horror type stories, but I think this book just changed me!\n\nThe author made me feel as though I was in the marsh with Kya, I can picture her\ncabin, her beach, her collection, her wood stove! I just absolutely…",
  "data/reddit-books/r/books/comments/l6zkar/im_reading_every_hugo_nebula_locus_and_world.json": "Well, it’s been a moment or three, but it’s good to be back.\n\nThe Book of the New Sun by Gene Wolfe\n\n * Plot: An epic four book fantasy series chronicling the adventures of Severian\n   of the Torturer's Guild.\n * Page Count:\n   * The Shadow of the Torturer: 304\n   * The Claw of the Concilliator:…",
  "data/reddit-books/r/books/comments/l740so/get_library_books_on_your_phone.json": "I just discovered Libby. It's amazing! Download the Libby app. Get a Library\ncard. Most places do them online now so you don't have to go in person. Enter\nyour library card info. Boom!!! Free books and audio books. And if your Library\ndoesn't have a certain book, some libraries will give you a card…",
  "data/reddit-books/r/books/comments/l7apth/following_gme_and_wsb_fed_up_with_the_rich_tired.json": "I didn't pick up on hardly any of this when I read this one back in school, but\nreading it now, in the middle of (gestures at everything) this— it hits\ndifferent. It actually means something.\n\nThe Joads have just been trampled on by the rich. Literally forced off their own\nland because someone with…",
  "data/reddit-books/r/books/comments/l7eioy/reading_has_saved_my_life.json": "A little background about me: I’m a 21F that just graduated college a semester\nearly in December 2020 and am stuck living at home with my emotionally abusive\nparents. I hate it here and am currently looking for a job to support myself and\nmove the heck out. I came home around the time of…",
  "data/reddit-books/r/books/comments/l8kk8k/working_on_my_love_for_reading_thanks_reddit.json": "I am not a native English speaker, so sorry for any mistakes.\n\nI have always loved books, especially when I was a teenager. I could read almost\nany type of book in any type of genre. I could not walk past a bookstore without\ngoing in, and if there was a sale, you bet I was buying.\n\nAs I grow older,…",
  "data/reddit-books/r/books/comments/l8oa9b/just_finished_the_jungle_by_upton_sinclair.json": "In English class in middle or high school was the first time I had heard of the\nbook \"The Jungle\". Like most Americans who learned about the book at school, I\nwas taught that it was about the meatpacking industry and that it was so\ndisgusting that laws were passed to clean up the real-life…",
  "data/reddit-books/r/books/comments/l8x5a4/i_just_finished_sapiens_and_i_realize_the_world.json": "I mean the part about the Imagined Myths being only as strong as the number of\npeople around you co-believing in the same thing. It helped me understand people\nand culture on another level. Not just mingling with foreigners but also people\nwithin our same family but a foreign mindset.\n\nIncredible…",
  "data/reddit-books/r/books/comments/l93c7c/finally_reading_the_earthsea_cycle_by_ursula_k_le.json": "I've finished the first book 'A Wizard of Earthsea' and I'm about to start the\nsecond.\n\nSeriously loving the writing style so far. It moves quickly and has a wonderful\nstorytelling (word of mouth style) feel to it that makes you feel involved in\nthe tale even as a spectator.\n\nI'm also noticing how…",
  "data/reddit-books/r/books/comments/l97b88/why_do_people_critique_books_for_not_having.json": "As I delve deeper and deeper into the literary world, I've been fining an\noverwhelmingly popular consensus that if novels do not have likeable characters\npeople can \"connect\" with, the reading experience is thus unenjoyable.\n\nI would like to challenge this notion. Reading about unlikable characters…",
  "data/reddit-books/r/books/comments/l9bg0i/an_underrated_trilogy_written_by_an_underrated.json": "My all-time favourite author is Derek Landy, he's Irish and he's hilarious. he\nstarted off with a children's fantasy series called Skulduggery Pleasant which I\nread when I was 9. The 14th book in the series is just about to be released and\nI highly recommend the series, it gets a lot darker and…",
  "data/reddit-books/r/books/comments/l9irt7/i_think_i_hate_stephen_king.json": "Unpopular opinion, but I don't understand why he's considered the king of\nhorror. I've read a dozen or so of his books trying to get to the root of why\nhe's so popular but his campy characters and goofy story arcs don't exactly\nelicit a sense of dread within me. His stories feel like YA novels with…",
  "data/reddit-books/r/books/comments/l9l118/i_read_a_book_a_whole_book.json": "No big deal, right?\n\nA little about me. I have a degree in literature. I can explicate the hell out\nof a sonnet, read Chaucer without translation, and was an avid reader for much\nof my life.\n\nUntil...I decided to major in it.\n\nBeing forced to gorge on hundreds of pages a night completely killed one…",
  "data/reddit-books/r/books/comments/l9m4ue/just_finished_1984.json": "Fricking loved the book! Took me just three sessions to finish it.Orwell does a\ngreat job of depicting a dark, depressing environment.The part after Winstons\narrest was very exciting.I found it fascinating how he always saw O’Brien as a\nfriend, even while being tortured by him. I was expecting it to…",
  "data/reddit-books/r/booksuggestions/comments/kl2xxv/what_was_the_best_book_you_read_in_2020.json": "Hi! Creating a 2021 reading list and curious to hear your favourite read in 2020\nand why! (Ideally something I can also find in a local UK bookstore so I don't\ngive Amazon more money!)\n\nEdit 1: Welp! Did not expect this response at all! Thank you so much for all\nyour recommendations, I am thrilled…",
  "data/reddit-books/r/booksuggestions/comments/klkbrj/im_moving_to_africa_in_18_days_i_need_books_to.json": "I'm so excited that my long-planned adventure is finally happening, but as I\npack and prepare to leave, I'm starting to panic a little bit. I would love any\nbook suggestions y'all have, fiction or non-fiction, to deal with a major\nadventure and life change. Thanks :)",
  "data/reddit-books/r/booksuggestions/comments/klv187/i_really_enjoyed_neil_gaimons_norse_mythology_can.json": "**vein",
  "data/reddit-books/r/booksuggestions/comments/kmq6yr/looking_for_the_classics_not_written_in_english_i.json": "Context: I'm well-versed in the classic authors writing in English, but frankly\npretty ignorant when it comes to classics from Asia, or Africa, or any of the\nEuropean countries in which English isn't the first language, even.\n\nI'm hoping to change that and would appreciate any help on where to…",
  "data/reddit-books/r/booksuggestions/comments/knn7de/im_a_bibliophile_who_read_only_9_books_this_year.json": "Sorry for the long-ish post :(\n\nRemember we all had a kid in our high school who used to gobble up books after\nbooks. Yeah. I was that kid. And then came college. I read 38 books last year.\nNot great, not terrible.\n\nThen came lockdown of 2020. I thought \"hmm I have all the time in the world and\nI'll…",
  "data/reddit-books/r/booksuggestions/comments/kp3pvm/what_to_read_when_youre_feeling_absolutely_lost.json": "Hi everyone,\n\nthe last 10 years or so I've done nothing but studying and working to get to\nwhere I am today, I get paid well and work for my dream company but I'm still\nnot happy with my life and don't really know where to go or what to do next.\n\nAny book recommendations for people that feel really…",
  "data/reddit-books/r/booksuggestions/comments/kpsdj5/looking_for_books_similar_to_the_films_se7en.json": "Basically as the title says. Looking for books that involve serial killers and\ndetectives or police solving the crime. I really love the darkness of the\natmosphere in Se7en and the disturbing vibes of it (I don’t want anything too\ndisturbing though). I also love the mystery and feelings of unease in…",
  "data/reddit-books/r/booksuggestions/comments/krlw7h/suggest_me_an_audiobook_app_that_isnt_owned_by.json": "Hi all,\n\nI know it's not a book suggestion per se, though I've been getting into\naudiobooks again to listen to at the gym/while I commute to my new job (its a\nbit of a drive). Thing is, I'm really not wanting to support Jeff Bezos. He's\nfilthy rich, and I'd rather not make him richer, especially…",
  "data/reddit-books/r/booksuggestions/comments/ksdmtm/nonfiction_must_reads.json": "Looking for suggestions for non-fictional books that have made a significant\nimpact in your daily lives as well as leaving an impression that you learned\nsomething new. Thanks!",
  "data/reddit-books/r/booksuggestions/comments/kssjl6/books_that_make_you_happywarm_and_fuzzy_a.json": "The news has been pretty depressing here in the US, so who has a good book to\nmake me feel better about humanity again? I need to stop doom scrolling and I'd\nlike to enjoy a good book that preferably avoid politics.\n\nThanks everyone!",
  "data/reddit-books/r/booksuggestions/comments/kuodys/books_w_adult_dystopian_romance_like_hunger.json": "I need to unload life stress right now and want to throw myself into some\npage-turners.\n\nI really liked Hunger Games, Catching Fire, Divergent, Insurgent...but wanted\nsomething a little more grown up in the romance department.\n\nNot asking for 50 Shades graphic at all...but more \"climactic\" than YA…",
  "data/reddit-books/r/booksuggestions/comments/kv32ce/which_books_are_the_best_to_learn_about_ancient.json": "I would love to learn more about the first civilizations (Sumerian, Minoan,\nEgyptian...), but I do not know where to start to get a general idea about them\nbefore diving deep into a specific one. I have read some books about Universal\nHistory, and I think it is time to take one more step and go just…",
  "data/reddit-books/r/booksuggestions/comments/kvskgx/i_am_new_to_reading_in_my_beginning_stages_of.json": "A series with thousands of pages seems a little overwhelming, currently. Is\nthere a book to introduce one to Fantasy? One that would suggest if Fantasy\ngenre is ones cup of tea?\n\nLike I said, I’m brand new to reading and have only finished 3 books, popular\nones (where the crawdads sing, A Million…",
  "data/reddit-books/r/booksuggestions/comments/kwsipe/in_need_of_uplifting_fluff_to_recover_from_song.json": "First of all big “i hate you/I love you” to everyone on here who has suggested\nSong of Achilles. I’m crying right now so as punishment please recommend a fluff\nfilled laugh fest so that I may recover. Thank you",
  "data/reddit-books/r/booksuggestions/comments/kyju5w/books_about_women_in_their_30s.json": "I’m searching for books about the lives of women in their 30s that isn’t a\nromance story or a ‘I was a white picket fence soccer mum and then went wild’\ntale.\n\nBeing in my 30s, I can’t really relate to the “enjoy your 20s!” Or “young\nsingles!” anymore and I’m not quite at the ‘older women being…",
  "data/reddit-books/r/booksuggestions/comments/kzt7h5/suggestions_of_must_read_books_surrounding_black.json": "Hello everyone,\n\nI was wondering if anyone had some good go-to recommendations for books which\nfocus on Black history and some of the most important events and figures within\nthat time.\n\nI realised that I have no real in-depth knowledge of black people's history and\ntheir struggle during and since…",
  "data/reddit-books/r/booksuggestions/comments/l0gita/used_to_be_a_book_lover_but_then_social_media.json": "Hi everyone,\n\nI am fairly new to Reddit, still trying to figure out how it really works. But,\nI came across this sub Reddit and I thought to myself, give it a try, it might\nbe helpful.\n\nSo here goes nothing.\n\nWhen I was little, I grew up reading books. My parents read to me before bedtime\nand…",
  "data/reddit-books/r/booksuggestions/comments/l1w01k/books_with_an_unreliable_narratornarrator_that.json": "I’ve read We Have Always Lived in the Castle and really enjoyed the elements of\nnot knowing what’s real due to the main character. The way you can’t tell if\nshe’s mad or magical and her descriptions of what’s happened slowly evolve is\nreally interesting to me.\n\nI also just read Piranesi and…",
  "data/reddit-books/r/booksuggestions/comments/l4ro5s/books_about_why_people_fall_for_conspiracy.json": "Given the current state of events with QAnon, Flat Earthers, Sovereign Citizens,\n9-11 Truthers, Holocaust Deniers, Moon Landing Deniers, and people who believe\nBill Gates is trying to Microchip them...I'm looking for books about the\npsychology of conspiracy theorists.\n\nI've only found one book just…",
  "data/reddit-books/r/booksuggestions/comments/l5ci9o/mad_scientist_birdfish_people.json": "Back in 2009 I had an English teacher read us a book everyday before lunch.\n\nIt was about a mad scientist, who kidnapped two kids... and was doing some sort\nof Frankenstein type science experiment on them... he made one kid into a bird,\nand one kid into a fish.\n\nI've had an ongoing bet for years…",
  "data/reddit-books/r/booksuggestions/comments/l5crn1/interesting_books_of_any_genre_but_are_hardbrain.json": "I'll be taking a law exam in four months from now and it has sections like\nReading Comprehension and Critical Reasoning. Besides solving actual problems\nfor my test, what are some good books I can read that'll help me sharpen my\nCritical thinking area of brain and help me with proficiency…",
  "data/reddit-books/r/booksuggestions/comments/l5fjh9/spotify_adds_9_public_domain_audiobooks_with.json": "Spotify has released\n[https://www.mobilemarketingreads.com/spotify-adds-9-public-domain-audiobooks-with-exclusive-recordings/]\n9 public domain classics including Frankenstein, Narrative of the Life of\nFrederick Douglass, The Awakening, Jane Eyre and more to boost its new\naudiobooks section. ",
  "data/reddit-books/r/booksuggestions/comments/l5pagj/shout_out_to_the_redditor_who_turned_me_on_to.json": "I'm tough person to suggest books for. I don't like reading the same types of\nbooks over and over. Just because I read And Then There Was None, doesn't mean I\nwant to read every other Agatha Christie.\n\nSomeone on r/books [https://www.reddit.com/r/books/] suggested…",
  "data/reddit-books/r/booksuggestions/comments/l735v5/school_librarian_here_what_were_your_favourite.json": "I work at a secondary school (ages 11-18) and I need some suggestions for books\nI should be checking out! Both to read myself to get me through my lunch break\nand what I can be recommending to the kids. I'll put some of my favourites below\ntoo:\n\nThe Edge Chronicles by Paul Stewart and Chris…",
  "data/reddit-books/r/booksuggestions/comments/l74qs1/im_26_years_old_and_still_loves_anne_of_green.json": "Anyone can recommend a novel like this? Slice of life with the nature as its\nsetting. As if you're breathing the air the protagonist's breathe, walking on\nthe same muddy road, full of imagination, beautiful sceneries and abounding in\npositivity. 🍀",
  "data/reddit-books/r/booksuggestions/comments/l7gpil/the_book_thief_by_markus_zusak.json": "I just recently got into reading again and went into a Bookstore not sure what I\nwas really looking for, but one of the employees saw me holding this book and\nsaid it was “Excellent” & with that I took his word and got the book.\n\nI finished it in two days, & it definitely deserves that title…",
  "data/reddit-books/r/booksuggestions/comments/l7y2s5/is_kane_chronicles_a_good_series.json": "I'm 18 and I've started to read and leave some bad habits of mine, and I'm an\nartist so I wanted to read fantasy, I've started Harry Potter and I'm planning\non reading the Percy Jackson series later, but i wanted to know if Kane\nChronicles is worth a shot? Have any of you read it? What are your…",
  "data/reddit-books/r/booksuggestions/comments/l810rt/novels_where_the_protagonist_turns_into_the.json": "Always interesting when the hero we are rooting for breaks their moral code.\nEven better when the antagonist all along was the mirror protagonist.",
  "data/reddit-books/r/booksuggestions/comments/l83nym/lost_all_my_books_in_a_flood.json": "I lost all my books (small shelf) in a flood last November and I am having a\nhard deciding which one to buy first. I am almost done reading the only book\nthat survived and ready to start a new small collection.\n\nHere are some titles I am considering, I guess I would like a vote on which is\nyour…",
  "data/reddit-books/r/booksuggestions/comments/l8n09k/paranormalhorrorfantasy_romance_books_that_arent.json": "I don't necessarily mind YA books or a little sex, but I'm in my 20s and it\nfeels like the only things I can find in these genres are either 75% sex or\nabout high school kids. Is there anything in-between, with a good interesting\nplot?",
  "data/reddit-books/r/booksuggestions/comments/l95xgb/books_that_emotionally_destroyed_you.json": "Hey, so, I need a book that will make me cry. Any genre is fine. Some books that\nhave made me cry are Aristotle And Dante Discover The Secrets Of The Universe by\nBenjamin Alire Saenz, and Where The Red Fern Grows by Wilson Rawls. Thank you.",
  "data/reddit-books/r/booksuggestions/comments/l9jphg/book_suggestions_based_on_your_mood.json": "Hi guys,\n\nFor the last few months I have been working on a side project with a friend. It\nis a AI powered search engine for books called librimood\n(https://librimood.com/).\n\nBasically it's a search engine where you can search freely about what you like\nto read, just like asking a friend or asking…"
}