{
  "data/reddit-books/r/books/comments/luvger/why_are_spoilerfilled_essays_so_often_added_to.json": "This has long been a pet peeve of mine that's grating on me more and more\nlately.\n\nI understand the reasoning behind including analytical essays with new editions\nof classic novels, and I often enjoy reading them....but not until after I've\nfinished the actual book, because I don't want spoilers. So…",
  "data/reddit-books/r/books/comments/luxwjx/tall_mass_market_paperbacks_are_lame.json": "US publishing industry gripe here: I noticed that the current mass market\npaperback edition of Frank Herbert's Dune is one of those \"tall\" versions, where\nthey increase the height by an inch. In the case of Dune, they've also increased\nthe spacing between lines of text and thus increased the page…",
  "data/reddit-books/r/books/comments/luz5go/my_boyfriend_is_reading_aloud_to_me_and_its_so.json": "I've always been someone who reads aloud to people. It's something I love doing.\nWhen my sister (who is 14 years younger than me) was little I'd take her to the\nlibrary and read with her for hours just pile after pile of books and right up\nuntil she was 12 we would read together. We've worked…",
  "data/reddit-books/r/books/comments/lvdsy6/til_that_marilyn_monroe_was_quite_the_bookworm.json": "I tried sharing this on r/todayilearned [/r/todayilearned], but they wouldn't\nlet me, so I thought I'd share it here. r/books [/r/books] seems to be a\npossibly more interested crowd anyway...\n\nAs a bookworm, I like to see what some of my favorite public figures like to\nread (musicians, actors,…",
  "data/reddit-books/r/books/comments/lvo1t4/john_flanagans_the_rangers_apprentice_was_my.json": "I too grew up with Harry Potter books, but once I read the first entry to the\nRanger's Aprrentice series, I was hooked.\n\nAlthough I was hoping for a letter from Hogwarts to arrive some day (still do!),\nbecoming a Ranger seemed so much more feasible. Their relationships with horses\nwere very…",
  "data/reddit-books/r/books/comments/lvsjat/reading_is_reading_is_reading.json": "In just the last few days there’s been posts of people saying they feel like\nlook down on or just over all feel better than people who don’t read, or posts\nthat disparage entire genres, and so on...\n\nAnd I just... don’t understand?\n\nFirst, in what glass houses do people live in that you feel…",
  "data/reddit-books/r/books/comments/lvtt9l/not_sure_who_needs_to_hear_this_but_you_can_leave.json": "I have seen a lot of people feeling guilty about not being able to complete\nreading a book. There was a time when I picked up a book, didn't like after\ngoing through 30% of it but still continued to finish it. Or when wasn't able to\nfinish it, I felt bad for some reasons. I don't think it is the…",
  "data/reddit-books/r/books/comments/lw5q2n/i_realized_ive_been_going_about_finding_books_the.json": "This is a realization I had somewhat recently. It may or may not speak to other\nfolks, but I figured I would at least post my experience and see if there was\nany discussion folks were interested in having.\n\nFor so many years, my main book process has been\n\n 1. Search online for genres I like.\n\n 2.…",
  "data/reddit-books/r/books/comments/lw86o7/i_am_brandy_schillace_author_of_mr_humble_and_dr.json": "In the early days of the Cold War, while surgeons on either side of the Iron\nCurtain competed for transplantation firsts, an American neurosurgeon\n[https://twitter.com/hashtag/neurosurgeon?src=hashtag_click] asked: Why not\ntransplant the brain [https://twitter.com/hashtag/brain?src=hashtag_click]?…",
  "data/reddit-books/r/books/comments/lw878w/the_unbearable_lightness_of_being.json": "I’ve seen people call it pretentious. Yes, it is pretentious, but it is also a\nmasterpiece. This book is the definition of lyrical. I would love to know\neveryone’s thoughts on this. While this is the first work of read of Kundera’s,\nI am convinced he is brilliant. I loved the way each character…",
  "data/reddit-books/r/books/comments/lwemme/has_anyone_ever_felt_a_littlehollow_after.json": "I just finished reading a series which I enjoyed pretty well, and now that I’m\ndone, I just feel a little emptiness me. I’m happy that I finished the series,\nand sort of grew up along side the characters, but I’m also sad that I have to\nleave them behind, if that makes sense. I just want to sit in a…",
  "data/reddit-books/r/books/comments/lwfmp4/i_have_a_very_specific_favorite_genre_what_about.json": "I'm not sure if you could really call this a genre, maybe just a type of book.\nBut anyway -- I love fishing horror.\n\nI know that sounds weird. But I find nothing more genuinely creepy than a horror\nbook/movie/game that is involves fishing.\n\nMy favorite book that fits in this category is, of course,…",
  "data/reddit-books/r/books/comments/lwlpp0/reading_is_the_perfect_antidote_to_loneliness.json": "As someone who doesn't have many friends, reading has been somewhat of a\nlifeline for me.\n\nInstead of wallowing in self-pity I pick up pretty much anything I can get my\nhands on (non-fiction, fiction, anything) and just escape into the world of\nliterature for several hours. When I'm out at college…",
  "data/reddit-books/r/books/comments/lwzxjm/reading_out_loud_helps_when_i_cant_focus.json": "I’m reading an awesome book right now (Moonchild by Aleister Crowley), but I’ve\nbeen working long hours, and it’s been hard to focus.\n\nYou know that feeling when you’re reading and the words make it in your head but\nyou don’t interpret them?\n\nI was doing that the past couple days and getting…",
  "data/reddit-books/r/books/comments/lx3voj/when_youre_reading_does_it_ever_feel_like_a_movie.json": "The other day I was thinking about a book I read and recalling a specific scene.\nOnly, for some reason I thought it was a movie I saw. Took me a minute to\nremember that I was thinking of a book, not movie. I think the lines between the\ntwo sometimes blur for me because I see things so vividly in my…",
  "data/reddit-books/r/books/comments/lxa1it/world_war_z_is_one_the_best_books_ive_ever_read.json": "Just finished the ensemble audiobook. What a ride. I had seen the movie before I\nread the book. And now I'm super disappointed in the movie. I didn't care much\nfor it before but after the book it's now just a massive missed opportunity. But\nenough of the movie. This was one of the most efficient…",
  "data/reddit-books/r/books/comments/lxqx7o/whats_with_the_gatekeeping_surrounding_audiobooks.json": "As I am writing this, the top post on the sub is someone sharing about their\nexperience listening to World War Z on audiobook. They mention that they \"read\"\nthe book, and there are a lot of upvoted comments telling OP that OP didn't\n\"read\" the book, they listened to it. Some of these commenters are…",
  "data/reddit-books/r/books/comments/ly069f/holy_crap_i_just_finished_the_grapes_of_wrath.json": "I've read a lot of great books, and this was one of the best I've ever read. I'd\nread Of Mice and Men before and liked it, but wasn't blown away, but I wanted to\ngive Grapes of Wrath a try.\n\nSteinbeck's descriptions are some of the most vivid, clear prose I've read. The\nnarrative structure,…",
  "data/reddit-books/r/books/comments/ly6epy/enders_game_blew_me_away.json": "A few days ago, my father gave me his copy of Ender's Game that he read in 85 at\nmy age (15) and told me to read it.\n\nAt the beginning, I was reluctant. Card's pose was difficult to follow at first,\nand while Ender is a fascinating character, he isn't exactly charming in the\nfirst few pages. Plus, I…",
  "data/reddit-books/r/books/comments/ly80ev/unpopular_opinion_the_genre_doesnt_matter_the.json": "I can't remember how many times I have been asked what my preferred genre is.\nAnd sure, there are certain plots I enjoy more than others. Usually that's the\ncase because writers of certain genres tend to write in certain ways. I love\nreading about different stories and people.\n\nI love reading about…",
  "data/reddit-books/r/books/comments/ly9075/missing_airports_because_of_paperbacks.json": "This is likely a me problem rather than something widely experienced.\n\nOne of my greatest joys in catching a flight somewhere was purchasing a book for\nthe journey in the airport WHSmiths. There was usually some offer and I ended up\nwith more than one. A lot of the time at least one of the books was…",
  "data/reddit-books/r/books/comments/lygbgf/the_book_s1_of_bridgerton_is_based_on_the_duke.json": "The disturbing scene in the show was somehow ten times worse in the book. And\nlet me be clear, not in intentional way to highlight the wrongness of the act.\nThe scene was treated with even less of the gravity it deserved. I was honestly\nsurprised, because the book and the show were about on par with…",
  "data/reddit-books/r/books/comments/lyoi3e/do_you_slide_in_palate_cleanser_books.json": "Consuming a string of demanding novels in a row can be draining. That's when you\nthrow in a palate cleanser, like a classic whodunnit or a breezy best seller.\nSomething like Joe Ides after Blood Meridian. Or Hiaasen after Ishiguro. Louise\nPenny after Wolfe Hall.\n\nAny great one-two punches you can…",
  "data/reddit-books/r/books/comments/lyploh/finished_reading_the_godfather_and_it_has_made_me.json": "Now I’m not saying that the Mafia is a good thing, obviously I know they are bad\neggs, but this book made me understand: I get why the characters or real life\npeople would rather go to the Don for financial, business, family, political or\nother issues. In their eyes “justice and the right arm of the…",
  "data/reddit-books/r/books/comments/lyq392/i_finally_started_a_book_that_i_dont_think_i_can.json": "A little background. I'm a 75 year old fella and have always enjoyed reading. I\nread science fiction as a pre teen and as a teenager, mysteries in my 20's and\n30's, not much in my 40's or 50's (work was pretty consuming), and now I have\nbeen reading fantasy for the last several years. I have read…",
  "data/reddit-books/r/books/comments/lytyph/a_book_youll_always_come_back_to.json": "What's a book that you'll never grow out of and will always be ready to reread,\nregardless of its genre or target audience? For me it's Shug by Jenny Han. I\nread it once in middle school and have been attached ever since, I could read it\na million times in a row even though it's not typically the…",
  "data/reddit-books/r/books/comments/lyvj6r/faulkners_go_down_moses_is_absolutely_stunning.json": "I have read a lot of Faulkner, and I have liked most of it. I've repeatedly\nheard that Go Down, Moses is a sleeper in his canon - one of the best things he\never wrote, but overlooked due to it not quite being a novel and not quite being\na short story collection. Finally I decided to check it…",
  "data/reddit-books/r/books/comments/lyvxjy/the_hate_u_give.json": "I'm fairly certain it falls in the YA category, but then again a lot of powerful\nbooks do. This one hits close to home in a way pretty much any other book I've\nread have never done so before. I was living in St. Louis, my birthplace &\nforever home, when Michael Brown was murdered/shot & killed by…",
  "data/reddit-books/r/books/comments/lyx0vc/the_how_to_train_your_dragon_audiobooks_are.json": "This is essentially just a recommendation, but the How to train your dragon\naudiobooks are amazing! They're read by David Tennant and he does amazing voices\nfor all of the characters and you get really immersed in the story.\n\nThe stories work well both for children and adults, me and my girlfriend…",
  "data/reddit-books/r/books/comments/lyyc6a/i_read_the_secret_garden_last_night_its_amazing.json": "I tought first this garden is a magical but it wasnt.Book about a child and\ngarden this garden closed 10 years ago and nobady dont go in there and one day\nMary found a key and a secret door. Later she is go insade she girls was so bad\nugly girl and this girl with this garden be so beatiful girl and…",
  "data/reddit-books/r/books/comments/lyzqqm/just_finished_a_scanner_darkly_and_it_left_me_in.json": "It's funny I finished a scanner darkly just a few moments ago, around 2:45am my\ntime. Did the same thing with Flowers for Algernon a weekish ago(except I read\nall of FfA in a day and did not do the same with ASD). Anyways the results of\nboth stories left me with the same feeling and felt remarkably…",
  "data/reddit-books/r/books/comments/lz024h/kite_runner_breaks_my_heart.json": "Just read one of Khalid Hosseneni's famous work \"Kite runner\", so much heart\nbreaks to handle till the last 10 pages. The way he had beautifully described\nAfghanistan is amazing. Feels so unreal that people in this same world live in\nsuch a condition. Hassan is my favourite character of all ,…",
  "data/reddit-books/r/books/comments/lz4bhh/i_have_trouble_with_reading_action_scenes_am_i.json": "Since I started reading as a child I always had trouble reading action scenes. I\ncan visualise in my head character, location, most of the action really but as\nsoon as some one throw a punch I have no clue what's happening. Ok he his\nstanding...no in the mud...wait \"they jumped on the roof\" what…",
  "data/reddit-books/r/books/comments/lz59i4/i_just_finished_the_mycroft_holmes_series_written.json": "Yes, you read that correctly, the NBA star wrote these books and I was genuinely\nreluctant to read them because I was already making assumptions about the\nquality of the books. I wasn’t judging the book by its covers, but by its\nauthor.\n\nSome famous basketball player wrote these books? Ugh, I bet…",
  "data/reddit-books/r/books/comments/lz9d19/i_deprived_myself_of_beauty_and_entertainment_for.json": "I always thought of myself as an omnivore when it came to literature - I dipped\nmy toe into most mainstream genres fiction and non-fiction and liked most of\nthem. There has been however one that I automatically skipped and always thought\nof it as somewhat silly and that is romance. In our family it…",
  "data/reddit-books/r/books/comments/lzo5ys/audiobooks_with_background_music_why.json": "This is what I imagine the discussion between the producers regarding the\naddition of background music to be:\n\nA: We should have background music\n\nB: But they won't be able to hear tho\n\nA: It creates suspense\n\nB: They won't be able to hear tho\n\nA: Have you seen those videos where they compare a…",
  "data/reddit-books/r/books/comments/lzpep5/what_quote_from_a_book_actually_made_you_think.json": "What quotes hit you guys the hardest? Whether it be a quote on inspiration,\ncorruption, hardship, or happiness, what was something a character or narrator\nsaid that you just couldn’t stop thinking about?\n\nFor me the hardest hitting quote out of the countless books I’ve read is from\nThe Things They…",
  "data/reddit-books/r/books/comments/lzrx63/opinion_on_reading_underaged_books.json": "I’ve always been into reading after I read Harry Potter back in second grade.\nThe thing is, I only wanted to read more ‘grown-up’ books because I thought it\nmade me mature.\n\nTurns out I ended up missing out on a bunch of really good books. Recently I\nstarted wanting to read Percy Jackson and Artemis…",
  "data/reddit-books/r/books/comments/lzw7b8/i_am_legend_was_not_what_i_expected.json": "No spoilers.\n\nI loved the movie. I always have - apart from one particular scene with Sam.\n\nSo after many years, I figured it time to read the novel.\n\nHoly hell!\n\nFirstly, it was incredible.\n\nSecondly, I have zero idea how the movie ever came to be. I'm used to movies\ndiverging slightly from the…",
  "data/reddit-books/r/books/comments/lzx492/ego_is_the_enemy_changed_my_life.json": "Since my teenage years I had this problem : I was self conscious. I wanted to\nimpress others. Even if what I was doing didn't resonated with my personality i\ndid it just for the validation of other people. This caused a lot of stress and\nI even started losing my original identity. But after reading…",
  "data/reddit-books/r/books/comments/m07jpr/what_book_made_you_self_evaluate_and_introspect.json": "Crime and Punishment was the one for me, it hit me like brick when I realized\nthat I was like Raskolnikov (not that I commuted a crime), but that I was very\nprideful and believed I was better than others. The book really humbled me and\nmade me realize that I am not better than anyone and not one of…",
  "data/reddit-books/r/books/comments/m0bxrf/the_alchemist_is_overrated_paulo_coelho_is.json": "Many of my friends were bragging about how great \"The Alchemist \" was and how it\nchanged their life. I don't understand what the protagonist tried to do or what\nthe author tried to convey. To be honest I dozed off half way through the book\nand forced myself to read it cuz I thought something…",
  "data/reddit-books/r/books/comments/m0ddp9/sent_a_personalthank_you_message_to_an_author.json": "Dear Jake:\n\nThank you very much for your kind thoughts and for taking the trouble to\ncommunicate them. Reading a novel is such an elective enterprise—after all no\none HAS to read a novel—that a writer is always gratified to know that his work\nhas repaid a reader’s time. I’m very happy to learn that…",
  "data/reddit-books/r/books/comments/m0hfls/rereading_eragon.json": "Eragon was a favorite series of mine in high school. Grew up with that series.\n(Movie was horrifying). For fun I decided to go back and reread them...... I\ncouldn’t get through the first book. WOW. Those books were so badly written. My\nteenage brain apparently could not comprehend. I now have no…",
  "data/reddit-books/r/books/comments/m0mnnx/selfhelp_books_are_boring_and_not_helpful_at_all.json": "I've been trying to find a self-help book in the last few years that would\nchange the way I think and act in life. But all I've ever found has been boring,\nrepetitive, and pretty useless books.\n\nI've tried dozens of the top rated self-help books and I haven't found a single\nbook which doesn't seem…",
  "data/reddit-books/r/books/comments/m1cpwy/to_the_fiveyearold_girl_learning_how_to_read_at.json": "I sat down by the window while waiting for my coffee and crêpe, pulled out my\nbook, and only got a few sentences in before having to set it aside, finding\nmyself too distracted and drawn in to what I was overhearing at your table. You\nwere there with your mom, working your way through a picture book…",
  "data/reddit-books/r/books/comments/m1jrul/im_finished_donating_books_to_the_local_little.json": "I’ve been growing suspicious of my Little Free Library being used by others in\nthe neighborhood as a way to take books and sell to the local Half Price Books,\nand today I found a book that I donated to the LFL on the shelf at HPB. It was\nan old hardcover copy of a book on training puppies that I’ve…",
  "data/reddit-books/r/books/comments/m1pa9f/i_finished_all_quiet_on_the_western_front_a_few.json": "Disclaimer: I posted this a few weeks ago but it got removed because I added a\nword that rhymes with SCHMOILER\n\nI’m not trying to karma whore. I just cannot stop thinking about this book.\nEvery day.\n\nI’m a huge history buff. I don’t know how I went through high school and college\nwithout having to…",
  "data/reddit-books/r/books/comments/m1rf14/just_finished_the_wheel_of_time_after_trying_to.json": "So about 2 years ago I started The Eye of the World for the first time and put\nit down after getting about halfway threw it, I then tried to finish it 2 more\ntimes. I really can't come up with a reason (or just don't remember) why I\nstopped but I picked it back up about 6 months ago and just today…",
  "data/reddit-books/r/books/comments/m1usvk/just_finished_carmen_maria_machados_in_the_dream.json": "In the Dream House dissects the experience of an abusive relationship. A rough\nread due to the subject matter, but also something I would recommend to anyone\ninterested in dynamics of abuse.\n\nShe uses so many intertextual references to compare this autobiographical\nexperience to, explains behaviours…",
  "data/reddit-books/r/books/comments/m1vyin/thoughts_on_dune_by_frank_herbert.json": "I am currently reading Dune (yes, bc the film is coming out this year) and as a\nfilm student I usually watch the film before reading the book it is based on.\nSince Dune was postponed due to the world collapsing and all that I decided to\nchange my tendency.\n\nStill a bit confused as to how many Dune…",
  "data/reddit-books/r/books/comments/m1yglc/the_westing_game.json": "Was reminiscing about a book I read around age 12. The Westing Game, by Ellen\nRaskin. I loved that book, and I had no idea it was such a big book for schools!\nApparently it won first place in 2012 for school books. Anyone here remember\nthat book? My school didn’t have it for required reading I just…",
  "data/reddit-books/r/books/comments/m1yqqh/what_book_has_made_you_cry_and_why.json": "I dont get very emotional over movies but when I read books there is a different\nfeeling of intimacy between characters that film does not quite capture. I cant\nrecall every crying during reading a book but have heard of people who have. I\nwould love to know what books those were and what was it…",
  "data/reddit-books/r/books/comments/m20z39/the_expanse_novels_are_so_good.json": "I just started the 5th book, and I'm loving that I can spend more time with each\nmain character. I'm actually reading the books through my local library via\ninterlibrary loan (I live in New Hampshire, USA). My local librarian said these\nare some of the only copies in the state and They have only…",
  "data/reddit-books/r/books/comments/m239n3/the_screwtape_letters_is_one_of_the_best_books.json": "Just finished reading The Screwtape Letters by CS Lewis and it is one of the\nbest books I've ever read. While it is usually regarded as \"Christian\napologetic\", I can certainly see how it would be very useful for non-Christians\nand nonbelievers.\n\nIt is full of good advice not only to avoid the…",
  "data/reddit-books/r/books/comments/m252eb/i_wrote_dean_koontz_a_letter_years_ago_and_he.json": "Background: I wrote Dean Koontz a letter asking why some of his characters are\nfully evil with no redeeming qualities. I explained that some of my acting\ncoaches discouraged us from playing villains that had no redeeming qualities,\nand he decided to respond with this. I will add that I now disagree…",
  "data/reddit-books/r/books/comments/m29ris/sent_an_email_to_my_most_beloved_childhood_writer.json": "\"Dear [ardently grateful],\n\nThank you very much for your lovely email—this is one of the best kind of\nletters any writer could receive! I am so glad to know that my books were\nmeaningful to you, and especially that they provided consolation at moments when\nyou needed it. I think I might need to…",
  "data/reddit-books/r/books/comments/m2eqil/ready_player_one_is_a_terrible_horrible_no_good.json": "I just got done with Ready Player One by Ernest Cline, and I can say with some\ncertainty that it is one of the worst books I have ever read.\n\nCline’s overall prose is just... it’s just awful. I don’t know how else to put\nit. The story itself is perfectly fine, but the way he tells it (and boy does…",
  "data/reddit-books/r/books/comments/m2mhyy/john_steinbeck_is_amazing.json": "It was today, I traveled inside the pages of East of Eden. Steinbeck pulled me\nin, like a ship around a giant whirlpool.\n\nThe first few pages describing the Salinas valley, it's beauty and lively tale.\nI felt at peace reading his prose, each word like a beautiful melody to my soul.\nI fell in love.…",
  "data/reddit-books/r/books/comments/m2mqat/i_just_finished_reading_catch22_my_biggest.json": "I don’t know if any scene, aside from Snowden’s death (and even that had a dark\npunchline about Milo stealing morphine) was played entirely seriously, but there\nwere a surprising number of poignant moments throughout the novel. Snowden’s\ndeath is the obvious go-to, but I’d also include Yossarian’s…",
  "data/reddit-books/r/books/comments/m2o6sm/whats_the_deal_with_eragon.json": "I bought this book, because I've seen plenty of people praising it. I tried to\nread it, but gave up after 100 pages.\n\nI just can't understand what is good about it. It's certainly not writing,\nbecause it's really obvious that the author was a teen when writing it and\ndidn't have much experience back…",
  "data/reddit-books/r/books/comments/m2pnag/the_ones_who_walk_away_from_omelas_ursula_le_guin.json": "An amazing philosophical short story. Someone I care about showed me this\nrecently. Really hit me on an emotional level. I don't know if most of you have\nheard of this or not, but give it a read. Will take 10 minutes, and really make\nyou think.\n\nhttps://learning.hccs.edu/faculty/emily.klotz/engl1302…",
  "data/reddit-books/r/books/comments/m2qjaa/what_book_did_you_know_was_going_to_wreck_you.json": "I’ve just started Never Let Me Go. I’m only a quarter of the way in or so and\nnothing much has really happened, certainly nothing tragic. But there’s this\nincredibly real sense of deep sadness, foreboding even, of something deeply\nwrong. I’m being drawn into caring a lot for these kids and I’m…",
  "data/reddit-books/r/books/comments/m2yyrr/what_book_did_you_almost_abandon_but_ended_up.json": "I read Catch-22 twice, both times getting almost halfway and hating it, not\ngetting it. For some reason I tried a third time a year or so later, and now\nregard it as one my favourite books ever.\n\nI'm glad I stuck with it. I had similar, but less intense, experiences with\nquite a few non-fiction…",
  "data/reddit-books/r/books/comments/m3hw5w/the_day_i_found_myself_standing_in_the_rain.json": "Warning: a Stormlight Archive spoiler below.\n\nLast October I was obese. I had been like that for 25 years.\n\nI decided to start running.\n\nAt first it was so hard. And boring too. I needed something to distract me.\n\nI decided to finally try an audiobook. I chose one called ‘Stormlight Archive’\nby…",
  "data/reddit-books/r/books/comments/m3qvoz/today_6_years_ago_terry_pratchett_died.json": "I don´t know if this gains any traction, but I thought to start a little\nmemorial post here. Let me hear your best memories, quotes and ideas you have\nabout him and his work.\n\nTerry Pratchett had a big influence on how I think and view the world. The\nconcept of second thoughts was something that…",
  "data/reddit-books/r/books/comments/m3rhvf/i_love_novels_with_short_chapters_because_i_can.json": "I just started reading \"Later\" by Stephen King and realized how great short\nchapters are.\n\nThere are some amazing books in this style, such as: \"the fight club\" by Chuck\nPalahniuk, \"the book of disquiet\" by Fernando Pessoa, and Machado de Assis's\nnovels.\n\nI do love novels with long chapters as well,…",
  "data/reddit-books/r/books/comments/m47gu9/a_read_along_of_the_three_musketeers_by_alexander.json": "Hello r/Books [/r/Books]! We are a small reading community called\nr/ClassicBookClub [/r/ClassicBookClub], and we read and discuss a chapter of a\nclassic book each day in a dedicated spoiler free discussion thread.\n\nOur readers nominate and vote on the books we read, and the winning book for our\nnext…",
  "data/reddit-books/r/books/comments/m48xax/about_dostoievskis_crime_and_punishment.json": "Rodion Raskolnikov is one of the most profound, complex and unique characters of\nuniversal literature. Rivalizes with Hamlet and Anna Karenina in that regard.\n\nWe initially encounter a troubled young man, rotting in poverty, self-perceiving\nhimself as a pseudo-Messiah figure with deeply rooted…",
  "data/reddit-books/r/books/comments/m4clrr/is_anyone_else_unable_to_clearly_imagine.json": "I've noticed that I cant clearly visualize the characters faces when I read a\nbook. Not only this, but I never \"construct\" a new face when a character is\ndescribed; I usually visualize them as a real life face I already know (often an\nactor). My mind for some reason is very stubborn with faces and…",
  "data/reddit-books/r/books/comments/m4clva/i_just_finished_reading_the_fellowship_of_the.json": "So not only is this my first post on Reddit, but it is also my first post on\nr/books [/r/books]. I am so excited to be part of this community of like-minded\nindividuals!\n\n\n\nAs the title says, I just finished up The Fellowship of the Ring last night and\nit was such an amazing read! The detail that…",
  "data/reddit-books/r/books/comments/m4d0dv/id_like_to_be_able_to_speak_to_people_about_the.json": "I've always loved to read but I've never had anyone to speak about books. I'm\nthe only person I know who reads, it's quite disheartening not to be able to\nshare my joy with people who have the same interest and understands. I recently\nstarted a new book series and I was excited to share it with…",
  "data/reddit-books/r/books/comments/m4qzz8/reading_books_for_joy_took_a_backseat_as_a.json": "I found that jumping straight into \"adult\" books again left me unable to follow\nthe story. Goodnight Mister Tom is a simple children's book that I read in\nschool at around ten years old and, the way I see it, a story is a story -\nchildren's book or not!\n\nGoodnight Mister Tom is a damned good story.…",
  "data/reddit-books/r/books/comments/m4rvae/thinking_fast_and_slow_is_an_absolute_gem.json": "In every eight of ten intellectual stuff that I consume, this book is referenced\neither directly or indirectly and it is rightly so that this book has become\nsuch an important piece of work if you consider the fact that it has managed to\nconvince us to accept something that might be hitherto…",
  "data/reddit-books/r/books/comments/m4w3b6/notes_from_underground.json": "I just got about halfway through the book. It's crazy, those Russians could\nreally write back then. However, did Dostoyevsky create the first incel? The\nnarrator is like 90% of Reddit users lol. Full of vitriolic bile, over\nestimating their own intelligence and uniqueness, but never actually…",
  "data/reddit-books/r/books/comments/m4xpd4/books_are_too_expensive.json": "I’ve recently really got into reading and I’ve found these books that I feel are\nreally going to have me not wanting to put them down. However I looked for the\nseries and it’s like £50. I know it’s the series and that’s how much to expect\nbut is there anyway to get them cheaper. I know libraries…",
  "data/reddit-books/r/books/comments/m4ywsu/the_lovecraft_story_that_broke_me_no_spoilers.json": "I don't have a lot to say, and I don't want to spoil anything, but I wanted to\nrecommend Lovecraft's story The Lurking Fear because it's the one that made me\nstop reading midway and take a break from Lovecraft for months.\n\nI have a small collection of mental health disorders, so sometimes I need to…",
  "data/reddit-books/r/books/comments/m58cws/the_prophet_by_kahlil_gibran_is_phenomenal.json": "The Prophet is a poetry collection where a different people in a town asks a\nprophet his opinion on... anything, really. Marriage, death, love, generosity -\neven things like food and clothes are covered.\n\nIt’s beautiful and because of its brilliant structure very easy to follow, so if\npoetry is new…",
  "data/reddit-books/r/books/comments/m5bws8/anybody_ever_feel_like_books_are_your_long_last.json": "I have been getting into reading lately and I find reading like getting to know\na friend. When I read a fantasy book in particular I find it like building a\nrelationship. Sometimes I feel lonely or maybe think I am but when I read I feel\nan immersive about of joy or a sense of belonging with the…",
  "data/reddit-books/r/books/comments/m5g88g/is_there_a_genre_of_books_that_is_just_like_a.json": "I don't read a lot of romance so maybe this is a dumb question, but I've always\ngot the impression that romance books are typically pretty drama filled with the\ncouple and a lot have will they or won't they dynamics. But is there like a\ngenre of books that doesn't have a lot of drama and there isn't…",
  "data/reddit-books/r/books/comments/m5kkpd/are_you_ever_so_invested_in_a_book_that_you_dream.json": "Last night I woke up by my dog and was super confused by the dream I had. I'm\ncurrently reading a college sports romance and had a dream about the sports team\nneeding to win. I woke up thinking \"We have to win this game!\"\n\nTo be fair I did read the book right before I fell asleep and was thinking…",
  "data/reddit-books/r/books/comments/m5m4lh/dont_let_other_peoples_opinions_influence_your.json": "I worded this quite vaguely since I think it's quite applicable across many\nfacets in our lives. But recently, I've noticed more and more how people let\nother's opinions influence and even dictate what they choose to do and not to\ndo. I've noticed in some friends of mine that they will turn away…",
  "data/reddit-books/r/books/comments/m5yi5j/do_you_guys_like_finding_annotated_books.json": "I personally love getting annotated books (as long as I can still read the\nwords, nothing scratched out) it’s like looking into someone else’s experience\nreading a book. I’m a sucker for finding old writings in books, I’ll try to find\ndrawings in textbook margins because I find the thoughts of…",
  "data/reddit-books/r/books/comments/m61c8s/drunk_reading.json": "I don't do this any more but when I was young, dumb and in the military I would\nenjoy a few drinks, or two, or...well a lot while reading. I drank so much that\nI would pass out reading and think I had finished the book I was reading. I\nwould wake up the next day and reread the ending to make sure I…",
  "data/reddit-books/r/books/comments/m627ee/do_you_have_any_oddly_specific_pet_peeves_when_it.json": "I can not STAND (in books or movies/TV shows) when characters call their family\nmembers stuff like “sis” or “big bro” to their face. It seems like the most\nabsolutely ridiculous way of speaking to a sibling. I call my sister by her\nfirst name! Her name is too short to have a nickname but…",
  "data/reddit-books/r/books/comments/m6327m/has_anyone_came_across_an_author_that_just.json": "The particular author that I am talking about is an amazon author. She has\nactually went after people who would point out her mistakes in her books, going\nso far as to put the corrected mistake in her books, three to four times over\n(kind of as a f u to the person, and saying \"look at me I am using…",
  "data/reddit-books/r/books/comments/m66t0a/my_fiance_kept_saying_her_latest_read_was_oddly.json": "So my partner has a copy of House of Salt and Sorrows that has 30 pages of The\nLeaving swapped into it. She was mentioning earlier today that \"I wonder when\nthey are going back to the FBI agent they've spent quite a while on the rest of\nthe characters.\"\n\nYou'd think someone with a PHD in English…",
  "data/reddit-books/r/books/comments/m6dys7/what_book_did_you_think_had_the_perfect_ending_no.json": "I just finished A Confederacy of Dunces, by John Kennedy Toole which I thought\nwas brilliant and hysterical. (despite being a bit dated in its stereotypes) I\nthought it rode the wave of satire perfectly, not making it too ridiculous nor\ntoo common. The ending was just about perfect for my money.",
  "data/reddit-books/r/books/comments/m6lzvr/just_finished_the_hobbit_for_the_first_time.json": "I want to start this off by saying I am 20 and have never really been into Lord\nof the Rings. I saw the LotR movies for the first time last year. I have to say\nThe Hobbit was amazing. I love the way in which Tolkien wrote this book and how\nevery chapter feels unique. Whenever the narrator made note…",
  "data/reddit-books/r/books/comments/m6vr5s/i_love_books_i_always_have_but_i_find_it_so_hard.json": "I have ADHD so my mind races at a million miles an hour on the regular, I would\nsay I idle at 75. I want to sit still and read, I’ve bought so many books that\nI’m so excited to read, a literal miniature library and it’s infuriating that\nit’s difficult for me to just sit in peace and read, if any of…",
  "data/reddit-books/r/books/comments/m6zc7w/have_you_ever_been_so_immersed_in_a_book_series.json": "I’m am currently reading The Wise Man’s Fear by Patrick Rothfuss. I can’t put it\ndown. I blew through The Name Of The Wind. It’s almost like I have a compulsive\nneed to finish the story. I haven’t been this caught up in a book series since\nPierce Brown’s Red Rising Trilogy. Even though in this…",
  "data/reddit-books/r/books/comments/m71cyq/my_experience_with_karl_marxs_das_kapital.json": "Every time I think of this book, I immediately get transported to the mandatory\neconomics class (Econ 101: Macroeconomics) I took in college. The professor\nopened the lecture with: “Most importantly, with this class you will understand\nhow the world works.” At the time, I dismissed this statement by…",
  "data/reddit-books/r/books/comments/m79w99/i_have_read_my_last_ever_book.json": "I recently, unexpectedly, lost my eyesight. A recent realisation is that I have\nread my last ever book in the usual sense. It's quite sad when I think about it\ngiven how much I love reading and even have a library in my house. What makes it\nworse was the last book I read was rubbish, I didn't really…",
  "data/reddit-books/r/books/comments/m7bp85/i_think_books_are_the_love_of_my_life.json": "Basically, I kept going in life because of the books I want to read. It makes me\nexcited.. Idk where I'll be without it and it beats every person I'm friends\nwith IDK it's just it's the perfect companion, and I just want to daydream about\nreading good books because I'm busy now doing mid term test.…",
  "data/reddit-books/r/books/comments/m7cic4/reading_classics_during_lunch.json": "Through Covid, I've been eating my lunches on a bench outside work or in my car\nwhen the weather is bad. I decided to start going back through some of the\nclassics that I was able to find on Project Gutenberg and other places. In the\npast year I've read: To Kill a Mockingbird, The Picture of Dorian…",
  "data/reddit-books/r/books/comments/m7f3c7/my_issue_with_goodreads.json": "I like browsing Goodreads and reading reviews to determine if a book is\nsomething I want to spend money on. The suggestions given by the algorithm are\nsometimes head scratching, but my reading interests are sort of all over the\nplace so it makes sense. What really bothers me is that Goodreads allows…",
  "data/reddit-books/r/books/comments/m7t18b/sex_scenes_especially_the_dialogue_during_them.json": "I’m reading Sharp Objects by Gillian Flynn right now and was thoroughly enjoying\nmyself until halfway through when it suddenly became some weird high school fan\nfiction. “I think you’re the most beautiful woman I’ve ever seen, I had to go\nhome early from work for not concentrating.” Maybe I’m…",
  "data/reddit-books/r/books/comments/m7vhye/no_spoilersbut_theres_a_huge_twist_at_the_end.json": "Has this ever happened to you? Many times, I have had well-meaning people\nsuggest a book and comment that there is a big plot surprise at the end....but\nthen hasten to add that they aren't going to spoil it. But they DID just spoil\nit........\n\nA plot twist is obviously most effective when you aren't…",
  "data/reddit-books/r/books/comments/m7yf1v/the_internet_has_ruined_book_shopping_for_me.json": "Allow me to set the scene. I'm ready for a new book. I consult the internet and\nfind a list of the top ten or whatever of the last year. Most of them don't\napply to my interests, but maybe a few of them do. I go to a bookstore. I find\none off the list and, out of curiosity, I check out the reviews.…",
  "data/reddit-books/r/books/comments/m835lh/exhalation_by_ted_chiang_blew_my_mind.json": "I like sci fi but I was a little worried bc short stories don’t tend to have the\nsame impact on me that a novel has. That’s having been said, I absolutely loved\n8/9 of these stories. Simply put, this is sci fi at its best: thought provoking\nand original. He tackled so many huge, important subjects…",
  "data/reddit-books/r/books/comments/m8ebjj/i_finally_read_a_book_after_a_long_time_and_i.json": "This probably isn't even that big an accomplishment but after a long time, I\nsuccessfully managed to sit down and finish a book. I used to read a lot and I'm\ntalking upwards of 100 books a year but as high school became increasingly hard,\nI had to cut down. Or maybe that was just an excuse because I…",
  "data/reddit-books/r/books/comments/m8gz7g/expand_your_horizon.json": "I'm studying to be a librarian. Recently, my professor said something about\nexpanding your own library - read a genre you usually wouldn't, read books that\ndoesn't initially interest you. It got me thinking about my own reading habits.\nI mainly read books from the same handful of authors, and when I…",
  "data/reddit-books/r/books/comments/m8hr3x/why_was_i_so_late_to_the_kindle_club.json": "I was the type of person who swore off e-readers and told myself that I would\nonly buy physical books.\n\nThen i was gifted a Kindle paperwhite. Holy cow. I have been reading so much\nmore just due to convenience. I went from maybe 6 books a year to already\ngetting through 6 books in the last month.\n\nI…",
  "data/reddit-books/r/books/comments/m8l4x3/im_currently_reading_through_jurassic_park_and_my.json": "I started Jurassic Park yesterday afternoon. I just hit page 100, and my god.\nWhat a treat. The slow build up in the beginning of books sometimes bore me, but\nthis was special. I’ve watched the movie countless times since I was 2 years old\n(28 years old now), and I was obsessed with it. For some…",
  "data/reddit-books/r/books/comments/m9236y/there_are_so_many_books.json": "now, my book taste is very broad, so i guess i should have expected to find so\nmany damn books to read, but WOW, it's insane when you start to think about it.\ni was proud of how many books ive read but in reality i haven't even touched the\nsurface of the genres i enjoy.\n\ni went through…",
  "data/reddit-books/r/books/comments/m93su3/i_read_through_the_godfather_and_wow_this_book_is.json": "I read through The Godfather and boy was this book fantastic. The characters\nstorylines really unique with it dealing with corruption and angst, romance,\nrevenge and all that. And the ending is both unique and bittersweet and in some\nways quite appropriate.\n\nBut I think the weakest parts of the book…",
  "data/reddit-books/r/books/comments/m983ku/guys_i_made_friends_with_an_author_today_and_im.json": "I’m so excited. This guy came to my work and when I was on break, he left me a\nsigned copy of a book he wrote that’s one of my favorite genres\n(post-apocalyptic fiction), and sent an email with a FULL COPY OF HIS\nUNPUBLISHED BOOK !\n\nI had a patient about 6 months ago who told me he was a writer, and…",
  "data/reddit-books/r/books/comments/m98xyh/romeo_and_juliet_is_not_a_romance_it_is_an.json": "It's not a tragic romance about true love- it's a warning not to let yourself be\nruled by your emotions alone.\n\nThe parents are ruled by a grudge preventing the happiness of their children and\ncausing violence and death in the town they live in because neither wants to\nforgive the other. Like, their…",
  "data/reddit-books/r/books/comments/m9burz/attention_authors_not_every_decent_idea_needs_to.json": "When did this become de rigueur? What happened to taking a stand alone story and\nthen subsequently building a universe around it through disparate, but still\nconnected follow up stories? More story to tell can certainly necessitate a\nsequel, but when and why did three books become the magic number?…",
  "data/reddit-books/r/books/comments/m9qzou/just_finished_slaughterhouse_five_and_im.json": "So growing up I didn’t really do that much reading (besides forum/Reddit posts\nand school textbooks, etc) but during quarantine I decided to try my hand at\nreading a book for the first time in a long long time. Now, it took me a while\nto settle on a particular book, and even though there are many…",
  "data/reddit-books/r/books/comments/m9ypu1/an_argument_for_sometimes_reading_stuff_you_dont.json": "In general, I'm from the follow-your-excitement school of reading. Too many\nbooks, too little time to be wasted on something that doesn't grab you, etc.\nBut, having just finished a book that I didn't like—I'm not going to name names,\nbut the author and the book are both well-loved by a lot of other…",
  "data/reddit-books/r/books/comments/ma1flv/asking_as_a_soon_to_be_college_graduate_when_do.json": "Apologies if this comes off as a naive question.\n\nI love reading. Always have an always will. I was one of those shy kids in\nschool who had books as a form of solace. Even when I got older in high school,\nthough the number decreased, I still managed to read a lot. Covid has been quite\nthe ordeal for…",
  "data/reddit-books/r/books/comments/ma29ms/what_little_things_do_publishers_do_that_you_hate.json": "One of my pet peeves with books is when the covers have single word review\nquotes from big names. Things like “Incredible!” - NY Times or “Extraordinary!”\n- George R. R. Martin.\n\nNot only does it not tell you anything about the book these blurbs are often\npulled from larger reviews so I have to…",
  "data/reddit-books/r/books/comments/ma8fxw/after_years_of_school_im_finally_back_into.json": "I'm 34 and my career path required a stupidly long training route. My partner\nand I throughout our training picked up so many books on the whim, only to leave\nthem on our bookshelf. They became deadweight as we moved from city to city. A\nfew months into my first real job, I finally found free time.…",
  "data/reddit-books/r/books/comments/mag9fp/red_rising_i_am_shook.json": "Everyone had always been talking about these series and it was on my tbr but I\nnever got to it until this week and it was worth it. The beginning was slow but\nonce things got going, they really went there!\n\nAt first I made the mistake of saying this was a hunger games on steroids and\nmore brutal but…",
  "data/reddit-books/r/books/comments/majgty/my_husband_is_finally_reading_and_i_am_over_the.json": "We've been together for almost a decade now and I have never once seen him\nfinish a book. He's really smart and has no qualms with reading other than not\nhaving enough down time in which to do so. Each time I finish a really good\nbook, all I want to do is talk to him about it, but can never bring…",
  "data/reddit-books/r/books/comments/maonh8/just_finished_reading_my_first_discworld_novel.json": "As the title says, just finished Going Postal and it's amazing. Quite different\nto what I expected too. It's funny and a light read at a certain level but also\ntouches on big topics! But without making the whole story grim or boring.\n\nI've had Pratchett's books in my to read list for years but…",
  "data/reddit-books/r/books/comments/maovbr/someone_here_does_not_know_how_amazing_libby_is.json": "Libby is obviously a very popular app already and I am late to the party, so\nposting just in case you were unaware like me. If you like books (if not, why’re\nyou here???) and especially Audiobooks, and you have a library card (if not, go\nget one today!) download Libby! The amount of money I could…",
  "data/reddit-books/r/books/comments/maplfn/im_elly_griffiths_i_write_crime_novels_ama.json": "I write the Dr Ruth Galloway mysteries and other crime novels, most recently The\nPostscript Murders. I also teach creative writing. I’m here to answer questions\nabout books, writing, publishing and how to become a murder…",
  "data/reddit-books/r/books/comments/mbdwyb/blissful_reading.json": "You know those moments when you come home from school or work and you realise\nthat you have no work to do so you can read for hours on end? Or better yet when\nyou have just accomplished something like passing an exam or getting alot of\nwork done at your job and you read to celebrate? I just want to…",
  "data/reddit-books/r/books/comments/mbgzhh/were_the_editors_of_readers_digest_select.json": "As editors of Reader’s Digest Select Editions, our goal is to cover hundreds of\nmainstream fiction books each year and select the best ones for our condensed\nseries. We love it all—mysteries, thrillers, romance, dramas, psychological\nsuspense, and especially those odd little gems that defy easy…",
  "data/reddit-books/r/books/comments/mbrwio/joining_the_library.json": "When I was a nipper, I used to buy a book with my pocket money each week. By the\nend of the weekend, I had finished it and had to sit twiddling my fingers /\nrabits ears until next pay day. I kept pestering my Dad to take me along to the\nlibrary to sign up, but I think he was a bit intimidated (he…",
  "data/reddit-books/r/books/comments/mbznw7/what_book_felt_like_it_was_written_for_you_and_why.json": "I think we all resonate with most books to a certain extent and compare them to\nour lives but which book felt undoubtedly meant to be in your life and perhaps\nchanged the course of your life?\n\nMine was Forty Rules of Love by Elif Shafak. So many coincidental things emerged\nfrom this book I had…",
  "data/reddit-books/r/books/comments/mc735f/please_dont_hurt_me_here_are_a_few_very.json": "A few months back, there was a very popular post that was eventually locked in\nwhich the OP recommended Michael Parenti's Blackshirts & Reds as the \"one\npolitical book you should read in your life\".\n\nAlthough I'm actually a huge fan of Parenti, I think there are some other\ncontenders for the title,…",
  "data/reddit-books/r/books/comments/mccgt9/unpopular_opinion.json": "I think one should write as much as they want in their books. I think one should\nfold their pages and underline anything that catches their eye. Recently I’ve\nstarted to reread The Brothers Karamazov, and my past annotations are from 5\nyears ago. It’s been absolutely amazing to try and understand…",
  "data/reddit-books/r/books/comments/mcma93/i_want_to_strongly_encourage_you_to_pick_up.json": "I deeply regret having read the first 11 books of the Sword of Truth series\n(after which I put the series down forever), but whenever someone asks me about\nthe series, I freeze and my brain begins stumbling over multiple responses to\nexpress why I dislike it so much.\n\nSo far, I can narrow it down to…",
  "data/reddit-books/r/books/comments/mcn48h/the_handmaids_tale_is_actually_horror.json": "I just finished reading The Handmaid's Tale for the first time and from\nbeginning to end I was deeply disturbed. I literally had nightmares about this\nbook. The fact that everything that went down in the book started with congress\nbeing assassinated and then reading this after the riot at the…",
  "data/reddit-books/r/books/comments/mcxolg/books_with_greatly_misunderstood_meanings.json": "Ray Bradbury said his famous Fahrenheit 451 story is NOT about government\ncensorship but about \"television destroys interest in literature.\" Yet even in\nschool we were told this book is about government control and censorship. I even\nremember Tolkien hating his LOTR being compared to ww2 as an…",
  "data/reddit-books/r/books/comments/md3hpu/whats_left_of_my_stephen_king_collection_well.json": "https://imgur.com/gallery/uXgJd54\n\nTldr: I'm getting old, and my books are aging with me. Showing off a collection\nim regaining appreciation for due to the interest of a young coworker in\nstarting her own collection.\n\nMy mother gave me my first Stephen king novel to read when I was in my…",
  "data/reddit-books/r/books/comments/md7hgm/unpopular_bookish_pet_peeve_the_use_of_mental.json": "I’m not sure how to feel about this one, but I really do not like when mental\nillness is used as a plot twist or explanation that is underdeveloped.\n\nSpecifically, when mental illness is used as a way to explain the behaviour of\nthe antagonist or antihero of the story. To me, it’s been overdone and…",
  "data/reddit-books/r/books/comments/mdbqlf/little_women_by_louisa_may_alcott_might_be_the.json": "I read this book about two months ago at the recommendation of a friend and it\nblew me away. I’m a 24-year-old man and I was not expecting to be this strongly\nimpacted by a children’s novel. But every chapter provided a deep, rich example\nof how very different people might live together in…",
  "data/reddit-books/r/books/comments/mdgz2z/i_recently_started_great_expectations_charles.json": "Granted, I haven't been reading a ton recently. I moved pretty far from home a\ncouple months ago and brought a box of books with me - mostly favorites but also\na few I've owned for a while but never read, thinking I'd make the effort to\nfinally read them. One of those was Great Expectations. I was…",
  "data/reddit-books/r/books/comments/mdidfc/make_most_readers_mad_in_just_4_words.json": "Let’s play a fun game. My examples are: “Only read the CliffNotes” “movie is\nalways better” “I only read Bestsellers” “No-one has time anymore” “I bent your\ncover.” “Blandness allows for imagination!!” “Spoiler on the back” “Deckled\nEdges are best!”\n\nThat’s all I got. What are some you can come up…",
  "data/reddit-books/r/books/comments/mdnto8/controversial_opinion_i_wish_i_was_forced_to_read.json": "Tl;dr: I hate not being able to understand deeper meanings of books and if I was\nforced to find them at school, maybe I could do it now.\n\nI often see posts like \"I finally started reading again after fifteen years. I\nused to read a lot but then at high school I was forced to read and…",
  "data/reddit-books/r/books/comments/mdvjhc/the_long_walk_by_stephen_king_is_soo_underrated.json": "I am an avid Stephen King reader and I just can't beleive how long it took me to\nget into this book, I am almost halfway into it after one day. I am not so much\ninto dystopian writing but this has completely taken my socks off.\n\nThe best thing about the book is that it doesn't involve any…",
  "data/reddit-books/r/books/comments/me717b/a_theory_george_rr_martin_doesnt_intend_to.json": "There have been questions for years about whether or not he will finish the\nseries, but no one seems to ponder the possibility that he doesn't even intend\nto finish it. There seems to be little forward movement with the next book.\nMeanwhile, he's been busy writing other, related works (e.g. World of…",
  "data/reddit-books/r/books/comments/me72dm/im_gonna_become_an_aunt_in_april_and_i_just.json": "I’m (30) just super excited but I’m worried about tone when I’m reading. Despite\nbeing an avid reader, I’m a bit worried I’ll sound boring and when I read out\nloud my sentences aren’t very fluent because I sometimes read words out of\norder. I really love kids. So I’m gonna practice reading out loud.…",
  "data/reddit-books/r/books/comments/mel07s/has_anyone_here_switched_back_from_kindle_to.json": "I sit in front of two computers 40 hours a week and my other main hobby is\ngaming which is another screen multiple hours a week.\n\nI’ve been using only a kindle paperwhite during pandemic and I just don’t like\nit. It feels like I’m reading a Reddit article instead of immersing myself in a\nstory…",
  "data/reddit-books/r/books/comments/memwmo/how_do_you_feel_about_lending_books_out.json": "I love encouraging reading, and if i think that somebody would enjoy a book i’ll\noften buy it for them from a second hand book store. But I feel like my\nreputation as an avid reader has caused some of my friends who are curious about\ngetting into reading to see me as some sort of library, and like a…",
  "data/reddit-books/r/books/comments/menojj/i_cant_believe_i_waited_so_long_to_read_jane_eyre.json": "I'm 45 years old and have been reading avidly as long as I can remember. I put\noff reading this book because I thought it was a romance, which is my least\npreferred genre. Honestly, this book had me hooked by the first page! It is so\nbeautiful and well written. I devoured it in less than 48 hours. I…",
  "data/reddit-books/r/books/comments/mewza3/am_i_the_only_one_who_opens_a_book_just_a_little.json": "When I don't read the book and it's not in my bookcase I put it in a protecting\nbook sleeve so it doesn't bend the corners. When I am done reading a book it\ndoesn't look like it's been read. When someone asks to lend a book I give them\nclear instructions on how I want that person to take care of my…",
  "data/reddit-books/r/books/comments/mex78g/discovering_stephen_king_late_in_life_30s_and_he.json": "I know that in the US and many other western countries King is an extremely\npopular author and people read his books when they are teenagers (at least\nthat's my impression). I grew up in India, and English was not my first\nlanguage, and I didn't even hear about him until my late 20's. I have…",
  "data/reddit-books/r/books/comments/mf3b9n/how_do_you_deal_with_not_remembering_books_you.json": "It saddens me to think that there are books I read years ago, some maybe more\nrecently, where I just cannot remember anything substantial. I often try to note\ndown passages I like, turns in the plot, characters, but these get forgotten\nwithin a short space of time.\n\nRecently I looked over a few…",
  "data/reddit-books/r/books/comments/mf8k41/what_books_have_you_read_or_are_reading_that_are.json": "I noticed this sub only really revolves around fiction, probably because it's\nwidely accessible and relevant for everyone.\n\nI myself mostly read non-fiction though and I think you can kind of see inside\nsomeone's deeper interests by seeing what type of non-fiction they read.\n\nFor instance, I'm…",
  "data/reddit-books/r/books/comments/mfazrp/i_read_catcher_in_the_rye_and_i_dont_get_why_its.json": "By the time I had finished Catcher in the Rye, I still didn't really understand\nwhy it's held as a masterpiece to a lot of people today, since I would describe\nit as nothing more than some twat faffing around Newyork. If anyone could give\nme an explanation, that would be nice.\n\nAlso, my thoughts on…",
  "data/reddit-books/r/books/comments/mfoo2g/anyone_else_feel_mathew_mcconaugheys_greenlight.json": "I like him as an actor in films, so I downloaded the audiobook version of his\nmemoir/proclaimed self help book, Greenlights. It has a 4.26 rating out of\nnearly 62,000 ratings. I was excited.\n\nHis narration was charming and fun to listen to, however when he started\ncasually mentioning the domestic…",
  "data/reddit-books/r/books/comments/mfssi5/in_victorian_literature_was_the_dialogue.json": "I've been having a lot of trouble with this because no matter how hard I try, I\ncan't picture the characters talking like...that. Take this quote from Helen\nBurns in Jane Eyre:\n\n> Life appears to me too short to be spent in nursing animosity or registering\n> wrongs. We are, and must be, one and all,…",
  "data/reddit-books/r/books/comments/mfssje/kids_are_still_reading_books_about_my_childhood.json": "My literary hero throughout my teen years LOVED coffee and lasagna, HATED\nMondays (as every good cat should, right...), and spurted out an everlasting\nstream of sarcasm perfectly aligned with my sense of humor. Now I'm weeding and\nevaluating Garfield books for my YA collection, and am thrilled to…",
  "data/reddit-books/r/books/comments/mfzg0h/the_house_in_the_cerulean_sea_is_a_wonderful_and.json": "Prior to my reading of the book, I had heard many folks raving about this book\nand how fantastic it was, so naturally I decided to give it a try. My fellow\nRedditors, I was not prepared for the feelings this novel engendered in me. It\njust radiated warmth, charm and whimsy.\n\nStory-wise this is…",
  "data/reddit-books/r/books/comments/mg1raw/reread_the_great_gatsby_the_other_day_and_the.json": "So like everyone else on the planet I studied the Great Gatsby at school. I\nloved it, and have read it a few times since. I’ve always had a great\nappreciation for Fitzgerald’s skill at conveying a national mood in a story, but\nmy recent re-reading was a totally new experience.\n\nThe parallels between…",
  "data/reddit-books/r/books/comments/mgbufe/everyone_should_read_the_stand_by_steven_king.json": "Context - When I was a child, we had an unfinished basement that always had a\nbunch of old smelling boxes tucked away in the corner. We used to play down\nthere all the time so naturally I ended up looking through most of them. In one\nwas this huge thousand page book with the old cover for the…",
  "data/reddit-books/r/books/comments/mglzw6/just_finished_hyperion_by_dan_simmons_and_i_dont.json": "The priest’s story was captivating, the fathers story was intriguing, and even\nthe Consul’s story was good. The private investigator’s story was okay and the\npoets story I thought was kinda lame. So essentially, half of the book was\namazing and the other half I rolled my eyes at the 15 sex scenes…",
  "data/reddit-books/r/books/comments/mgqwms/today_its_your_turn_tomorrow_it_will_be_mine.json": "There is a famous story on Reddit about a guy who's car breaks down on the side\nof the road, and a family pulls over to help. It was a hot day, and the\ngentleman spoke very little English (if I remember correctly, he was Mexican).\n\nThe man helps this destitute individual, fed him by sharing their…",
  "data/reddit-books/r/books/comments/mgsmsf/just_read_do_androids_dream_of_electric_sheep_by.json": "This book is success on three levels. First, it's an exciting cops-and-fugitives\nthriller. Second, it's an interesting dystopia of earth in decline and people in\ndespair after nuclear war. Third, it has the philosophical or psychological\nmindfuck elements that I was told Philip K Dick had. I read…",
  "data/reddit-books/r/books/comments/mgubwu/mistborn_i_dont_get_it.json": "Every booktuber on earth and Mars gives this book high praise but i started to\ntake a shot everytime Vin reminded herself that letting people get close to you\nwill only lead to betrayal. Literally chapter 4 back to back paragraphs repeat\nwith that statement and the writing doesn't get much better. I…",
  "data/reddit-books/r/books/comments/mgv72h/do_we_put_too_much_emphasis_on_endings.json": "Can a book be good even if it has a bad ending? Can it be great with a bad\nending? Is it unfair to judge a 500 page book on the last 20 pages, or is that\npart of the game? Does a meh ending mean that the first 480 pages weren't set up\ncorrectly? Most importantly (to me), does the need for a \"holy…",
  "data/reddit-books/r/books/comments/mgza4r/naomi_novik_ill_follow_you_anywhere.json": "I read Uprooted sometime last year and really enjoyed the way Novik could twist\na familiar fairy tale. In a way, it reminded me of Sleeping Beauty, Beauty and\nthe Beast, and Howl's Moving Castle, but there was plenty of originality and\ngreat writing to make it seem more than just the sum of these…",
  "data/reddit-books/r/books/comments/mh30ug/rereading_the_discworld_series.json": "The glorious 25th of May is approaching, and I'm re-reading Terry Pratchette's\nmasterful Discworld series. In fact, I'm listening to the series as audiobooks,\nprimarily narrated by Nigel Planar. If you've never read or listened through\nthis series, what in heaven's name are you waiting for?…",
  "data/reddit-books/r/books/comments/mh9mby/i_made_a_spotify_playlist_of_20th_century_poets.json": "Around the 1950s, the label Soundmark Records put out quite a few records of\nauthors and poets reading their work, including James Baldwin, Robert Frost,\nEzra Pound, Sylvia Plath, William Carlos Williams, E.E. Cummings, T.S. Eliot,\nWilliam Butler Yeats, Langston Hughes and more. The recordings…",
  "data/reddit-books/r/booksuggestions/comments/lv042c/whatre_some_mustread_classics.json": "So I’ve been reading a lot and am looking for some suggestions. So far I’ve\nread:\n\nJane Eyre\n\nCatcher in the Rye\n\nFrankenstein\n\nThings Fall Apart\n\nNight\n\n1984\n\nAnimal Farm\n\nSo Long, See You Tomorrow\n\nCount of Monte Cristo (currently reading)\n\nWhat’re some other classics I should read?",
  "data/reddit-books/r/booksuggestions/comments/lva822/i_want_to_start_reading_philosophy.json": "Hello I just recently decided to get into philosophy ,Any tips on where to start",
  "data/reddit-books/r/booksuggestions/comments/lvp7cb/the_hate_u_give.json": "I finished The Hate U Give by Angie Thomas a few weeks ago and HIGHLY recommend\nit. The characters and, I’m sorry to say, storyline are very plausible and\nrelevant to the world where we live today, so getting through it is really easy.\n400+ pages, but if you appreciate quality fiction, that fact’ll…",
  "data/reddit-books/r/booksuggestions/comments/lw4bkp/novels_that_taught_you_something.json": "Novel lovers please help! I have almost exclusively read nonfiction until this\nyear and I’m trying to jump into novels that you can really lose yourself in.\nBut I really like to learn something when I read a book. What are some novels\nyou read recently that left you with some new knowledge on a…",
  "data/reddit-books/r/booksuggestions/comments/lwbjlj/a_dark_academia_book_with_good_female_rep.json": "I love the aesthetic because honestly, I need to romanticize studying or I fail.\nUnfortunately, a lot of books/movies deemed \"dark academia\" like Secret History,\nThe Dead Poet Society, The Portrait of Dorian Grey, The Riot Club, ect. are kind\nof male oriented.\n\n\n\nI want to read something that has…",
  "data/reddit-books/r/booksuggestions/comments/lwzvew/books_about_witches_covens_dark_magic.json": "I’m craving a book about witches, but most of my searches yield Wiccan young\nadult drama type stuff.\n\nI want witches such as the movie The Witch. I want serious metal-as-fuck\nDarkness, foreboding, gruesome. Even a book about a coven such as the movie\nSuspiria would be cool.",
  "data/reddit-books/r/booksuggestions/comments/lxzx47/books_you_love_in_a_genre_you_hate.json": "Has there ever been a book that proved you wrong, and made you rethink your\nstance on an entire genre?",
  "data/reddit-books/r/booksuggestions/comments/lynzeq/does_anyone_know_any_retellingsbooks_about_eros.json": "i'm currently reading Mythos by stephen fry and stories about them came up, i\nwas just wondering if anyone has recommendations or maybe knows books about some\nof these people/gods/people.\n\nit would be highly appreciated 😁",
  "data/reddit-books/r/booksuggestions/comments/lyqjmc/interesting_psych_related_reads.json": "https://thebeguiledchild.com/?p=340\n\nI read the silent patient and am going to start reading a few of the others!!\nDoes anyone have any other books related to these that they would recommend?",
  "data/reddit-books/r/booksuggestions/comments/lysm0j/books_like_peaky_blinders_tv_series.json": "Looking for a book or series like the Peaky Blinders TV show on Netflix, the\nshow is set around 1919 Birmingham and revolves around a gang with a prominent\nleader in Thomas Shelby would be appreciated if any suggestions are dropped",
  "data/reddit-books/r/booksuggestions/comments/lz0z57/a_lesbian_novel_with_supernatural_creatures.json": "I’m not particularly picky about genre, and I don’t really care which\nsupernatural creatures are involved. Werewolves, vampires, dragons, yada, yada,\nyada. I just want a good plot and likable characters with lesbians. Thank you.",
  "data/reddit-books/r/booksuggestions/comments/lz98jl/romance_like_howl_sophie.json": "I’ve always loved this pairing from Howl’s Moving Castle (I haven’t actually\nread the book), and I just saw a tiktok that described it like “a bisexual woman\nwho prefers women falls in love with a bisexual man who prefers men and they’re\nboth surprised about it.” I wanna see more of this trope.…",
  "data/reddit-books/r/booksuggestions/comments/lzbhgq/niche_ask_books_heavily_involving_morgan_le_fay.json": "I want something with a good focus on Morgan, not necessarily from her POV but\ni’ve always found her part in Arthurian legends some of the most interesting.",
  "data/reddit-books/r/booksuggestions/comments/lzjq5r/fated_protagonist_i_hate_them_all.json": "I don't even know how to say literally because english is not my native language\nso i'll try it .\n\ndon't you find incridble boring every single heroe that has a destiny ? a\nprophecy ? is born a genius , it's born from incridble parents , born from a god\nor smth .i just can't read about another…",
  "data/reddit-books/r/booksuggestions/comments/m0eot9/a_dystopian_novel_told_from_the_perspective_of.json": "Something like 1984 if from the POV of Big Brother",
  "data/reddit-books/r/booksuggestions/comments/m0vl5g/a_book_to_help_me_be_less_emotional_in.json": "I love to talk about politics and current affairs with my Dad when we chat on\nFaceTime every week, but we have quite different views. Most recent discussion\nis the Harry & Meghan interview, and I find it very difficult to argue my point\nwithout getting heated because I can’t believe my Dad’s side of…",
  "data/reddit-books/r/booksuggestions/comments/m1x7q9/really_depressing_books.json": "i just want a book where it doesn’t work out in the end. not like the fault in\nour stars or all the bright things or 5 feet apart. just like something real\nsomething that really hurts.",
  "data/reddit-books/r/booksuggestions/comments/m2dhoj/i_miss_how_ya_novels_made_me_feel.json": "I used to read a ton as a teen. Any YA novel you want to cringe at I probably\nread it in a day. I'm a huge fan of science fiction fantasy. Magic. Secret\nworlds. Other beings. I haven't really read since leaving what I was reading to\navoid in my life and honestly I'm starving for that kind of…",
  "data/reddit-books/r/booksuggestions/comments/m2wrjb/can_you_recommend_any_therapy_books_about.json": "My sister can't get therapy but I want to help her somehow. If you can recommend\nany books about emotionally abusive parents, narcissistic moms, and recovering\nfrom a traumatic childhood as well as coping skills, I'd greatly appreciate it.",
  "data/reddit-books/r/booksuggestions/comments/m39bad/dark_matter_all_i_can_say_is_wow.json": "I picked up Dark Matter by Blake Crouch from the library this morning, based on\na suggestion in a previous thread. It’s been a long time since I’ve read a book\nin a single sitting, but I just could not stop. What a fantastic novel! Big\nthanks to the user that made the suggestion, and I’ll be looking…",
  "data/reddit-books/r/booksuggestions/comments/m3omhb/books_that_have_a_giant_world_like_game_of_thrones.json": "Want to read a book that has a wide variety of characters and locations",
  "data/reddit-books/r/booksuggestions/comments/m45s90/books_like_cheryl_strayeds_wild_and_bill_brysons.json": "Read these two books back to back and loved them. I’m looking for more\nnon-fiction long distance hiking books - I don’t even mind if they’re on the PCT\nand AT routes like the above books just as long as they’re similar!\n\nThanks :)",
  "data/reddit-books/r/booksuggestions/comments/m48ls1/transport_me_to_another_world.json": "Of the books I’ve read this year, two have been so utterly absorbing that I’m\ndesperate for more! Circe by Madeline Miller and The Invisible Life of Addie\nLaRue by V.E. Schwab. What I liked about them: strong, female leads, a touch of\notherworldly magic, an outside perspective on life, beautiful…",
  "data/reddit-books/r/booksuggestions/comments/m4gzpj/comfort_books_for_lonely_people.json": "what the title says. books about introverts, wallflowers, late bloomers, mitfits\n(if it’s coming of age teenage girl that’s even better). i like beautiful\ncontemporary stories/something that will warm my heart.",
  "data/reddit-books/r/booksuggestions/comments/m4trko/world_war_z.json": "Picked this up after seeing comments here. Really a good read. It could become a\nclassic due to the fact, it is more a commentary on humankind in general than\njust zombies. I’m down to the last 50 pages and don’t want it to end. Thanks to\nwhoever suggested it because I probably would never have…",
  "data/reddit-books/r/booksuggestions/comments/m50ji8/looking_for_books_similar_to_the_film_midsommar.json": "I really enjoyed (maybe not the right adjective with it being so gruesome but\nyou get what I mean) the film 'Midsommar' and wondered if there's any books with\nsimilar themes/tone. Anything featuring cults, ancient rituals/witchcraft,\npsychological horror of joining a cult or escape a cult. Would…",
  "data/reddit-books/r/booksuggestions/comments/m5mxg0/ive_been_looking_for_some_fantasy_books_that_are.json": "I've read A Court of Thorns and Roses by Sarah J. Mass and her other series\nThrone of Glass. But I'm out of ideas.",
  "data/reddit-books/r/booksuggestions/comments/m6xmg7/books_of_romance_sue_me_i_like_them.json": "I'm looking for a book series like twilight and beautiful creatures. Dont care\nso about the mythology part but more of the I will go to the ends of the earth\nfor you love story. Ya ya ya I know cliche but it's my vice.",
  "data/reddit-books/r/booksuggestions/comments/m7b940/i_need_a_book_to_help_me_understand_my.json": "When she was younger, I mean like 8 years old, she was sexually assaulted by her\nbrother. I want to understand the long term effects of sexual PTSD, how to help\nher and heal her. She's going to therapy soon, but, I need to comprehend stuff\ntoo. I need to.",
  "data/reddit-books/r/booksuggestions/comments/m7usqv/book_about_alternate_lives_or_parallel_universes.json": "Something in the vein of The Midnight Library or Dark Matter.",
  "data/reddit-books/r/booksuggestions/comments/m87tu0/im_trying_to_find_a_light_hearted_book_for_my.json": "My wife and I just watched our friends lose a 5-week long battle with their\ndaughter in the NICU, and it’s shaken us both up a fair bit.\n\nMy wife wants to read a book that is light hearted. She is a mom to the greatest\nson, she’s 21 years old, and loves romance, art, and the outdoors.\n\nThank you in…",
  "data/reddit-books/r/booksuggestions/comments/m8hlrn/books_like_the_nancy_drew_series_but_for_adults.json": "I was wondering if anyone has any recommendations for books that are similar to\nNancy Drew but for adults. I used to read a lot of Nancy Drew when I was young\nand enjoyed reading mysteries. I mostly read fantasy, urban fantasy and science\nfiction novels but would really like to get into some mystery…",
  "data/reddit-books/r/booksuggestions/comments/m95pkd/books_loaded_with_highly_usable_and_learnable.json": "With good overall content of course, no preference for genre. Intention is to\nwiden my spectrum for a creative perspective on things, with the help of figures\nof speech that could be used in one's day to day life. Any suggestions are\nappreciated. TIA",
  "data/reddit-books/r/booksuggestions/comments/m98wmt/scifi_or_fantasy_on_or_under_da_sea.json": "I work in a marine field and have loved the sea, lakes, and rivers since I can\nremember. In fact, my parents used to read me a glow-in-the-dark picture book\nabout an undersea lab (if anybody knows the title of that book I would be\necstatic)\n\nI'm a big believer in giving books away to friends,selling…",
  "data/reddit-books/r/booksuggestions/comments/ma070o/books_like_jurassic_park.json": "Hello there!! How have you been??\n\n I have just completed The Martian yesterday... And I feel like I want to read a book based on surviving from monsters like Jurassic Park !! Suggest some books...\n\nThanks...\n",
  "data/reddit-books/r/booksuggestions/comments/maddto/books_that_take_place_over_many_years.json": "Not sure how exactly to word this, but I love both Valley of the Dolls and\nLittle Women because they follow the characters through a long time and it kind\nof doesn't really feel like the book has a plot per se. Any recommendations of\nbooks that are similar in that sense? :) thank you!!",
  "data/reddit-books/r/booksuggestions/comments/maoso8/books_that_are_from_the_villains_pov_and_it.json": "Sometimes i find a book where the main character does some... questionable\nthings. Or where they are evil, but the author makes them \"change\" their ways.\nBut i think it would be cool to read a book from say, the Jokers pov, where he\nis just evil. ty :)",
  "data/reddit-books/r/booksuggestions/comments/mb3o1t/just_watched_interstellar_after_a_few_years.json": "Love the movie, but the first half if honestly my favorite. The whole everyone\nis growing corn cause thats all that's left, slowly but surely generations of\npeople dying out. Looking for a book/s that really delve into humanities last\ngasp for life on a dead earth.",
  "data/reddit-books/r/booksuggestions/comments/mbe583/book_for_27_year_old_with_constant_feeling_of.json": "Hello! I’m looking for a book which could give me some insight or an experience\nwhich can seed some insight in what to do in life and how to figure it out. I\nconstantly feel im not living my ”best” or ”right” life. When i lived in the\ncity i wanted to live out in the countryside, now when i live in…",
  "data/reddit-books/r/booksuggestions/comments/mc6ofh/looking_for_postapocalyptic_books.json": "Hello!\n\nI'm hoping to find a book that takes place post-apocalypse (preferably due to\nnuclear meltdown but doesn't have to be!) where the main focus is on exploration\nand/or survival. Basically, ones where conflict isn't the main focus and focuses\nmore on the post-apocalyptic world and navigating…",
  "data/reddit-books/r/booksuggestions/comments/mckwwp/a_book_where_the_main_character_isnt_in_it.json": "I get how this may sound absurd.. but I'm looking for a book written from the\nperspective of other characters, the antagonist for instance or perhaps various\ndifferent side characters, and how they view or perceive the \"protagonist\" and\ntheir crusade or quest.\n\nFor example, if the chapter is…",
  "data/reddit-books/r/booksuggestions/comments/md4078/books_like_pachinko_by_min_jin_lee.json": "I absolutely loved this book, and I felt that it was a breath of fresh air. I\nlove historical fiction, but I’ve only read western historical fiction. I am\nAsian, but I have not read a lot of works by Asian authors and I want to change\nthat. Do y’all have any suggestions for books similar to…",
  "data/reddit-books/r/booksuggestions/comments/mdi3tt/adventure_books_that_are_appropriate_for_a_6_year.json": "I read The Hobbit to my son and he loved it (and of course I’ve loved it all the\ntimes I’ve read it). It was the perfect balance of interest and magic for my\nson, while still being “mature” enough for me.\n\nWe’ve also read Fortunately the Milk by Neil Gaiman which is a very different\nstyle but it’s…",
  "data/reddit-books/r/booksuggestions/comments/mdleex/books_like_narnia.json": "I just recently started the chronicles of Narnia and went through it one rush. I\ncan't understand why I haven't read them earlier jn my life. Now, I am looking\nfor something similar-is. I do love fantasy books in general, but I am looking\nnow for something similar light. I love how there is no holes…",
  "data/reddit-books/r/booksuggestions/comments/mdus8r/books_from_the_perspective_of_a_psychopath.json": "So I enjoyed \"The curious incident of the dog in the night\" which is a book from\nthe perspective of an autistic boy. I was wondering if anyone knows of a book\nfrom the perspective of a psychopath or with a psychopath as a major\nprotagonist.",
  "data/reddit-books/r/booksuggestions/comments/meeuas/just_finished_ready_player_one_and_i_liked_it.json": "Now I have this void I need to fill with a futuristic space adventure book. Any\nsuggestions?",
  "data/reddit-books/r/booksuggestions/comments/mepo5a/books_that_will_make_you_cry_at_3_am.json": "Exactly as the title suggests, I'm looking for books that will make me bawl my\neyes out at 3 AM because I couldn't put it down. Books that had this effect on\nme:\n\nFlowers for Algernon\n\nA little life\n\nThe kite runner\n\nAll the bright places\n\nThey both die at the end\n\nThe song of Achilles\n\nAristotle…",
  "data/reddit-books/r/booksuggestions/comments/mf0rlt/ive_created_rbooksidisliked.json": "Hello all, I’m not sure if I’m allowed to promote myself on here but I have\ncreated a community where we can all freely speak about books that we dislike\nand why we wouldn’t suggest them to people. You are allowed to be yourself and I\nwill not allow any hate comments or anything like that. Everyone…",
  "data/reddit-books/r/booksuggestions/comments/mf6tzm/similar_to_the_library_at_mount_char.json": "There are a few posts in the past that have named recommendations that are\nsimilar to this book but I want even more! It's such a weird strange book and I\nlove it and I want more in this vein.",
  "data/reddit-books/r/booksuggestions/comments/mfig7m/help_for_a_lovely_old_ladyoutlander_fan.json": "I have a dear friend in her 70s who is pretty holed up in her apartment due to\ncovid related concerns. She's been working hard on zoom for the past year\n(unable to retire due to finances) and I really wish she could catch a break!\n\nOne thing that's been getting her through all this is Diana…",
  "data/reddit-books/r/booksuggestions/comments/mfx3sa/i_just_really_loved_howls_moving_castle_and_would.json": "Almost exactly like it.",
  "data/reddit-books/r/booksuggestions/comments/mggbmj/i_dont_know_what_to_read.json": "Hello! So I’ve just read “The boy in the striped pyjamas” and I really liked it.\nI want to read something that’s similar to how the story is told and the twisted\nend. I would love if there was any series of books with a similar story, because\nI always get sad when there isn’t another book to…",
  "data/reddit-books/r/booksuggestions/comments/mghmqo/what_are_some_books_that_will_stick_with_you.json": "I do not mean them to have a controversial topic (Rape, Incest, body torture\netc) but just good ass reads with great story that makes you wonder about things\nor keep you on your toes.\nOne book I read that was like this (as in different and quirky) was house of\nLeaves by Mark Z. Danielewski. Can you…",
  "data/reddit-books/r/booksuggestions/comments/mh2x3q/in_search_of_lighteasy_going_books_to_read_as_an.json": "Hi guys! I'm a 30 year old woman from India. I was a voracious reader as a child\nbut eventually I kinda lost the motivation to read despite wanting to. I\nrecently sought mental health treatment and talked with my psychiatrist about\nthe above mentioned problem. They advised me to restart the reading…",
  "data/reddit-books/r/booksuggestions/comments/mh99we/romance_novel_from_the_perspective_of_a_male.json": "I'm a girl but idk why I prefer reading from the perspective of a guy more than\nI do a girl, especially when it comes to romance, it's more interesting to me.\nSo does anyone know of a good romance novel where we get to see the story\nthrough the eyes of a male protagonist?\n\nI just want it to be a…"
}