{
  "data/reddit-crypto/r/Bitcoin/comments/knui6f/does_anyone_else_get_nervous_whenever_you_have_to.json": "Whenever I am providing an address to my wallet or having to transfer, I get\ncautious that I might send it to the wrong address. I always test the water by\nsending a small amount first, and then a big one.\n\nI would move it right now to park it in a safer wallet, but I am too high on\ndrugs (legal)…",
  "data/reddit-crypto/r/Bitcoin/comments/knygj8/im_going_to_save_john_mcafees_dick.json": "I'm going to buy 0.00000001 bitcoin for $1 which would make the market price for\nbitcoin $1 million / bitcoin.\n\nEnjoy the spike!",
  "data/reddit-crypto/r/Bitcoin/comments/knyw85/after_holding_since_2017_4000_i_sold.json": "A couple of months ago, for $14000. My brother talked me into abandoning my long\nterm strategy at the start of the bull run.\n\nVery disappointing, can't stop thinking about this mistake.",
  "data/reddit-crypto/r/Bitcoin/comments/knzwj3/bitcoin_hits_30k_exactly_when_the_nye_ball_drops.json": "Don’t quote me on this but this is no 🧢",
  "data/reddit-crypto/r/Bitcoin/comments/ko1wk3/i_bought_the_ath_in_2011_a_decade_of_hodling.json": "There have been a few other long-term HODLers sharing their stories recently and\nI've greatly enjoyed reading them and reminiscing about Bitcoin's past. Here's\nmy story - I hope it's as entertaining as the others.\n\n---\n\nEvery number between 0 cents and the current ATH has been, by definition,…",
  "data/reddit-crypto/r/Bitcoin/comments/ko46s5/better_late_than_never_just_bought_my_first_100.json": "Long-time lurker here, but I wanted to officially join the community with a\nposting. I know $100 is really small, however, it's all I can afford right now.\nI remember back when BTC was $350 a coin years ago, I almost bought in, and then\nagain a couple years back when it was ~7k, but decided against…",
  "data/reddit-crypto/r/Bitcoin/comments/ko4ae8/im_going_to_bed_call_me_when_we_get_to_30.json": "202-456-1414\n\nThanks.",
  "data/reddit-crypto/r/Bitcoin/comments/kob3q6/received_my_stimulus_direct_deposit_today_2400.json": "Edit : Thank you for all the upvotes and to the anonymous redditor for my first\ngold reward 😍😊 Happy New Year to all the hard core Crypto fans 🙌",
  "data/reddit-crypto/r/Bitcoin/comments/kob79c/my_bitcoin_story_beginning_in_late_2012.json": "Posting on a throwaway for obvious reasons.\n\nIn dollar terms, I’m almost a bitcoin millionaire. It feels good, but not\nbecause I can brag about the accumulated wealth, it’s more that the people who I\ntold to invest whatever money they could afford to lose, back in early 2013, all\ntold me I was an…",
  "data/reddit-crypto/r/Bitcoin/comments/kobrs1/my_friends_mocked_me_for_not_selling_at_1200.json": "I bought bitcoin. (A substantial amount) back in 2013 for $400. It ran up to\n$1200 before crashing down. I was mocked for not selling it. Today those bitcoin\nare worth $8 million. Note that I have sold a handful along the way and also\ncovered calls but I still own 70% of my holdings.",
  "data/reddit-crypto/r/Bitcoin/comments/kocdqb/is_your_guys_goal_also_to_just_hold_forever_and.json": "Some people say “when will you sell” or “at what price are you gonna get out.”\nFor me personally, I’m never gonna sell because the whole reason of getting into\nBitcoin is seeing it’s future long term adoption. There’s no reason to ever\nconvert it back to fiat. People seem to forget that you can…",
  "data/reddit-crypto/r/Bitcoin/comments/koi8lx/my_bitcoin_journey_from_2013_to_2021.json": "My bitcoin journey...so far…\n\nIn December 2012 a friend of mine gave me a single bitcoin as a gift. Bitcoin\nwas worth $13 at the time. My friend had done a little bit of bitcoin mining so\nhe had some from that.\n\nI briefly looked into bitcoin, very briefly, and I dismissed it as just another\nkind of…",
  "data/reddit-crypto/r/Bitcoin/comments/kojqbo/bitcoin_maximalism_has_won.json": "Let's not be delusional. I know that Bitcoin maxis are commonly ostracized as\ntoo toxic, but they have been right about everything.\n\n1) Bitcoin's dominance is at its early 2017 levels, and it keeps surging.\n\n2) Bitcoin Cash and Bitcoin SV are dead. Craig Wright and Jihan Wu are over.\n\n3) DeFi was a…",
  "data/reddit-crypto/r/Bitcoin/comments/komnoq/just_invested_my_first_200_in_btc.json": "I've bought bitcoin in the past but immediately used it to purchase things. This\ntime I'm holding on. Excited to see where it takes me.\n\nEdit: I understand I've bought at a high. But the 200 to me is inconsequential\nright now and I just wanted to get started and 30k could be its low now if it\nclimbs…",
  "data/reddit-crypto/r/Bitcoin/comments/kosxbh/daily_discussion_january_02_2021.json": "Please utilize this sticky thread for all general Bitcoin discussions! If you\nsee posts on the front page or /r/Bitcoin/new which are better suited for this\ndaily discussion thread, please help out by directing the OP to this thread\ninstead. Thank you!\n\nIf you don't get an answer to your question,…",
  "data/reddit-crypto/r/Bitcoin/comments/kowvek/the_i_just_became_a_millionaire_problem_should.json": "No!\n\nSome of us are becoming extremely wealthy because of Bitcoin. And many of us\ncame from poor or lower-middle-class backgrounds. The joy, the exuberant feeling\nwinning millions may lead you to make a severe mistake: You want to tell the\nworld. You want to post it to Facebook and Instagram. You…",
  "data/reddit-crypto/r/Bitcoin/comments/koyhw3/i_am_happy_for_you_guys.json": "With everyone sharing their story, I just wanted to say that I am happy for all\nthe hodlers, traders, and everyone involved. I’ve believed in btc for years\n(still do) but due to this years economic downturn , I found myself living off\nof my btc and buying everything from food to car tires to get by.…",
  "data/reddit-crypto/r/Bitcoin/comments/kozj25/id_like_to_take_full_responsibility_for_the.json": "After buying back in 2018, I decided to sell in October 2020 once I made my\nmoney back after struggling for 2 years. Naturally, my sell has resulted in\nBitcoin going to ridiculous new highs.",
  "data/reddit-crypto/r/Bitcoin/comments/kozxhw/anyone_else_using_bitcoin_as_a_store_of_wealth_as.json": "Disclaimer: Not an economist. But, I've done some research on the current\nfinancial environment of the US dollar and the economy, and we are definitely in\nuncharted territory. Over 20% of all USD was printed last year, and a lot of it\nwent to buying stocks through quantitative easement.\n\nIn this…",
  "data/reddit-crypto/r/Bitcoin/comments/kp07cn/does_anybody_else_say_what_the_fuck_when_they.json": "To the fucking moon we go! Next stop after moon: Mars ?",
  "data/reddit-crypto/r/Bitcoin/comments/kp0qx2/1_btc_now_equals_6600_chickens_i_dont_want_people.json": "(Assumes price of $5/chicken).\n\nAt 8 square feet per chicken, 6600 chickens would need 52,800 sq feet to be\nraised.\n\nThat's about half a Walmart.\n\nI've included American measurements for ease of understanding.",
  "data/reddit-crypto/r/Bitcoin/comments/kp2rop/anyone_else_feel_bitcoin_is_their_only_shot.json": "Disabled vet here, who used to work in tech but my PTSD and TBI have all but\nmade it impossible to keep up with the field and eventually became fully\nunemployable at VA standards. I do part time jobs here and there as I can but\nit's not sustainable between MH and seizures.\n\nI have a teenager who I…",
  "data/reddit-crypto/r/Bitcoin/comments/kp3i09/i_sold_btc_for_my_mental_health.json": "I’m a freelancer with no health insurance so all my medical needs are paid out\nof pocket. I’ve been struggling mentally this year, along with most people, and\ntherapy just wasn’t in the budget. I’m happy to say that thanks to Bitcoin, I\ncan now afford therapy for the rest of the year.\n\nWe all joke…",
  "data/reddit-crypto/r/Bitcoin/comments/kp5ca0/i_sold_my_bitcoin_and_now_im_debt_free.json": "Will hope to buy later on after I get back on my feet!!",
  "data/reddit-crypto/r/Bitcoin/comments/kp691a/psa_do_not_give_your_bitcoins_to_the.json": "Even if we get a 50% correction, the millionaires and billionaires will be\nbuying up your Bitcoins during that time if you sell. Hodl and never sell!",
  "data/reddit-crypto/r/Bitcoin/comments/kp6ox5/im_old_enough_to_remember_when_you_could_buy_an.json": "Those were the days.",
  "data/reddit-crypto/r/Bitcoin/comments/kp75t9/lets_hear_it_for_pineapplefund_the_user_that_gave.json": "I feel honoured to have witnessed his/her great acts of kindness back in 2017.\n\nThe word legend was reserved for selfless and benevolent people like Pine. You\ncan read more about this amazing story here:\nhttps://en.m.wikipedia.org/wiki/Pineapple_Fund\n\nI like to think he/her is still reading these…",
  "data/reddit-crypto/r/Bitcoin/comments/kp7t4h/dont_wait_for_the_dip.json": "There was a dip. 6%. About two hours ago.\n\nI don't want to hear anybody whining about \"waiting for the dip\" who didn't jump\non that one, or the 5% dip last week, or the 5% dip the week before that, or the\n5% dip the week before that. What, is 5% not enough of a discount for you? It's\nnot like the…",
  "data/reddit-crypto/r/Bitcoin/comments/kpbxyu/so_uh_what_should_the_subreddit_do_with_its_400k.json": "As the side bar notes, we have over 12 unspent Bitcoin gathered for advertising\nBitcoin.\n\nAssuming none of the mods have run off with it yet, any ideas what we should do\nwith the money?\n\nhttps://www.reddit.com/r/Bitcoin/wiki/ad_fund",
  "data/reddit-crypto/r/Bitcoin/comments/kpc3vx/satoshi_nakamoto_is_now_the_44th_richest_person.json": "He hasn't touched any of it. Bless him for his creation. (ranking subject to\nprice)",
  "data/reddit-crypto/r/Bitcoin/comments/kpee2u/34k_btc_new_all_time_high.json": "Welcome $34k. Next up $35k. HAPPY BIRTHDAY BITCOIN!",
  "data/reddit-crypto/r/Bitcoin/comments/kperld/were_not_going_to_the_moon_and_were_not_going_to.json": "Strap in lads, cause we’re going to Alpha Fucking Centauri",
  "data/reddit-crypto/r/Bitcoin/comments/kph77k/happy_birthday_bitcoin.json": "3 January 2009, the BTC network came into existence.\n\nThe genesis block of bitcoin (block number 0) had a reward of 50 bitcoins.\nEmbedded in the coinbase of this block was the text: The Times 03/Jan/2009\nChancellor on brink of second bailout for banks. 🚀🚀🚀🚀🚀🚀🚀",
  "data/reddit-crypto/r/Bitcoin/comments/kpi6pa/i_just_sold.json": "I'm up more than 110x so I just sold a chunk and used it to pay off my mortgage.\nI now own 100% of my own apartment and am completely debt free, thanks to a\nrather small bitcoin investment 7 years ago. Even if Bitcoin were to crash down\nto zero, my life is going to be so much easier now that I…",
  "data/reddit-crypto/r/Bitcoin/comments/kpikx0/in_2016_i_made_about_24_in_a_bitcoin_casino_and.json": "It is now worth almost $2,000 and I plan to buy a new laptop with it.\n\nTook a screenshot below.\n\nhttps://ibb.co/Vwb7GNV",
  "data/reddit-crypto/r/Bitcoin/comments/kpipyd/lost_my_job_in_september_last_night_i_earned_8000.json": "Thanks, Bitcoin!\n\nAt this rate, I don't know if I'll ever need to work again. I hope not lol",
  "data/reddit-crypto/r/Bitcoin/comments/kply9c/remember_golds_market_cap_is_10_trillion_bitcoin.json": "There's still room to grow",
  "data/reddit-crypto/r/Bitcoin/comments/kpmw5y/40_months_of_stacking_sats_this_is_my_get_rich.json": "Been stacking sats since October 2017. I buy every month with the salary I get.\nSome frugality involved and I manage to stack with 500€ every month. Granted its\na small one time purchase but when done constantly for 3+ years it adds up\nbeautifully. Right now its the first time ever i can say having…",
  "data/reddit-crypto/r/Bitcoin/comments/kpn52b/ive_done_my_research_and_its_just_simply_too_risky.json": "It's too risky holding fiat currency that the government can print to infinity.\nAll in.",
  "data/reddit-crypto/r/Bitcoin/comments/kppkff/this_very_minute_on_this_day_in_2009_the_genesis.json": "Happy birthday bitcoin thanks for the insane gains :)",
  "data/reddit-crypto/r/Bitcoin/comments/kpsbel/why_im_not_selling.json": "15-20% cap gains tax is absolutely absurd.\n\nI mined my holdings in 2014/15, and because i technically never purchased them,\ni never reported them on my taxes. According to a couple opinions from tax\naccountants, because I never reported it, if I were to sell it would always be\nat max cap gains tax…",
  "data/reddit-crypto/r/Bitcoin/comments/kpveev/unpopular_opinion_the_im_selling_joke_posts_are.json": "All these low effort “had me in the first half” posts are becoming more frequent\nand is really starting to flood the sub with unnecessary posts.\n\nI understand the memes, sure, but I seems like everyday there is a top post\nsaying “I just sold... my fiat” “Now is the time of to get out... and buy…",
  "data/reddit-crypto/r/Bitcoin/comments/kpvrfz/i_now_own_1_of_a_bitcoin.json": "Not much I know, but it’s exciting nonetheless",
  "data/reddit-crypto/r/Bitcoin/comments/kq2awa/selling_bitcoin_is_now_riskier_than_buying_bitcoin.json": "Remember its not necessarily the bitcoin price going up but the value of the\ndollar imploding behind the scenes. Selling bitcoin for dollars is the riskiest\nthing any hodler could do in the current economic environment.\n\nAnyone selling their coins now is selling to institutions that understand this.",
  "data/reddit-crypto/r/Bitcoin/comments/kq6a40/well_you_said_you_wanted_a_buying_opportunity.json": "So here it is. Will you actually follow through and buy or are you going to\njustify this as another excuse to wait?\n\nThere won’t be many more chances. If you see this post, really think about it\nthis time.",
  "data/reddit-crypto/r/Bitcoin/comments/kq6ahv/and_so_the_dip_has_ended_congratulations_to_all.json": "From someone who got in in 2016",
  "data/reddit-crypto/r/Bitcoin/comments/kq8p3j/stop_giving_awards_here_and_buy_bitcoin_instead.json": "If you are young & can hold out a few decades of safely storing & holding your\nbtc, please do so. Bitcoin is going to be a very valuable asset in the next\ndecades to come. To those who sold, nothing against you .\n\nEdit : Okay, thank you to everyone who has sent an award , so savage of you !",
  "data/reddit-crypto/r/Bitcoin/comments/kqbgi3/whos_fault_will_it_be_when_soon_the_masses.json": "We know that institutional investors are buying and buying large into bitcoin\nlately. It has been well documented.\n\nThe 'little man' was the first in the space over the past decade. In fact, this\nis one of Peter Schiff's arguments against bitcoin. To paraphrase, no major\nasset was ever jump-started…",
  "data/reddit-crypto/r/Bitcoin/comments/kqfreu/bitcoin_is_not_an_investment_things_to_know_and.json": "There is a lot of new people entering Bitcoin. If you are new here you don't\nunderstand what Bitcoin is. The most important part is to understand what\nbitcoin is what gives it value. Here is a bullet list of things to grasp.\n\nI'm not writing this for an argumentation or your opinion, i'm doing this…",
  "data/reddit-crypto/r/Bitcoin/comments/kqhs31/uk_going_into_full_lockdown_again_will_mean_more.json": "Protect yourselves fellow brits... you know what to do",
  "data/reddit-crypto/r/Bitcoin/comments/kqifao/a_professor_told_me_to_buy_bitcoin_in_dec_2015.json": "I didn't listen. When bitcoin exploded in 2017 I questioned my decision, but the\nprice eventually dropped down. I still haven't bought bitcoin. I am a fool.",
  "data/reddit-crypto/r/Bitcoin/comments/kqiiy7/realize_this_if_you_sell_your_btc_right_now_an.json": "Institutions have been buying bitcoin for a while now, but 2020 accelerated that\nnarrative dramatically. Every time a retail seller like myself or yourself\nsells, an institution buys. That means institutions will own the majority of\nbitcoins eventually (as long as the inflation hedge narrative…",
  "data/reddit-crypto/r/Bitcoin/comments/kqnjic/142020_1000000_usd_can_buy_only_308_btc.json": "BTC scarcity is ruthless. The stage for a frenzy is set. This is going to be a\nwild ride.",
  "data/reddit-crypto/r/Bitcoin/comments/kqx69r/the_tldr_security_guide_sim_jacking_and_2fa.json": "2FA is must. But it's not enough to just have it enabled. This is meant to be\nsimple and quick, obviously you should learn more about each point.\n\nDown and dirty security:\n\n1- Get a google voice number. VOIP numbers can't be SIM jacked. Free for U.S.\nuse.\n\n2- Get LastPass Authenticator or Authy.…",
  "data/reddit-crypto/r/Bitcoin/comments/kqxryz/learn_from_my_mistakes_alwys_hodl.json": "Back in the summer I had about three bitcoins. Price was about 13 000 or 14 000.\nI only made a little profit so far because I entered late. The price seemed\nstall and didn't move anymore so I became impatient.\n\nI thought there must be a faster way to make money so I started to sell the\nbitcoins an…",
  "data/reddit-crypto/r/Bitcoin/comments/kqyg0l/a_2nd_american_miner_marathon_patent_group_is.json": "https://www.marathonpg.com/news/press-releases/detail/1220/marathon-patent-group-and-dmg-blockchain-solutions-to-form",
  "data/reddit-crypto/r/Bitcoin/comments/kr5xea/i_sold_all_21_of_my_bitcoin_no_regrets.json": "I made my first BTC purchase around the end of 2014. The price was a little over\n$300 and it was trending slowly down. (I vaguely remember a very short-term dip\ninto the $100s during 2015. Feel free to verify.)\n\nI was attracted to BTC for a few reasons:\n\n1) Demand: It aligned with my libertarian…",
  "data/reddit-crypto/r/Bitcoin/comments/kreb1o/max_keiser_says_220k_by_year_end.json": "So 5 BTC could make you a dollar millionaire....... (Max has been the most\naccurate with his predictions recently).\n\nThoughts ?",
  "data/reddit-crypto/r/Bitcoin/comments/krg7dv/35k_breached_new_btc_all_time_high.json": "We just breached $35k. Next stop $40k. #HODL",
  "data/reddit-crypto/r/Bitcoin/comments/krgdsm/thank_you_bitcoin_you_have_now_officially_wiped.json": "When I was getting my MBA, I had to sell all of my assets to pay for school and\ntook out over $100K in student loans. The only thing I didn't sell was my\nBitcoin. Today Bitcoin surpassed $35,386 triggering my sell order of 1 BTC that\nis equal to my current student loan balance. Now I am debt free…",
  "data/reddit-crypto/r/Bitcoin/comments/krieb1/the_rise_of_btc_has_been_bringing_me_almost_to.json": "I never had more than 6000 in my bank account at one time before this year. I\njust started investing about 5 months ago and after reading about btc for a long\ntime i decided about a month and a half ago to throw 3500 into btc when it was\nat around 15000. Now it's valued at over 7000 dollars worth of…",
  "data/reddit-crypto/r/Bitcoin/comments/krimfn/daily_discussion_january_06_2021.json": "Please utilize this sticky thread for all general Bitcoin discussions! If you\nsee posts on the front page or /r/Bitcoin/new which are better suited for this\ndaily discussion thread, please help out by directing the OP to this thread\ninstead. Thank you!\n\nIf you don't get an answer to your question,…",
  "data/reddit-crypto/r/Bitcoin/comments/krimma/do_not_listen_to_the_experts_prediction_on.json": "If you've been around just before the 2017 bull market, you'll understand what I\nmean. There were many renowned industry \"experts\" that spawned out, predicting\non how Bitcoin will go up to 20k, 30k, or even 50k, just like how it is now\nagain at 2021 bull run. People were also FOMO too, buying…",
  "data/reddit-crypto/r/Bitcoin/comments/kroek3/bought_in_at_5500_during_the_covid_price_fall_in.json": "Hopped on the BTC train early 2018 after the new years boom of 2017. Of course i\nregret not jumping on much earlier but i apaprently needed some convincing.\n\nWhen the price fell in march during covid i realized this was the lowest price\niv'e seen in a long time and decided to go for it. Looks i was…",
  "data/reddit-crypto/r/Bitcoin/comments/krqywq/i_just_bought_my_first_ever_bitcoin_worth_137.json": "Hello gentlemen (and women), my first ever post here. Been lurking here for\nabout a month now, reading and learning everything about bitcoin and\ncryptocurrency technology.\n\nI'm a 23 year old man who lives in India and just invested first time ever in\nBitcoin around four hours ago. I bought Bitcoin…",
  "data/reddit-crypto/r/Bitcoin/comments/krr0vj/psa_stop_telling_strangers_on_the_internet_how.json": "I love to hear all these success stories just like the next guy, but please be\nsmart about it. Telling a bunch of strangers on the internet how much BTC you\nown makes you a target for nefarious hackers. We all remember the story of that\nguy on Twitter who kept bragging his about his Bitcoin bags and…",
  "data/reddit-crypto/r/Bitcoin/comments/krrq5i/i_fell_for_a_ledger_scam_a_month_ago_still_cant.json": "I'm an idiot, I knew better, I was in a whirlwind frame of mind and actually\npushed my secrets through my cell phone. They took it in a second and I knew\nimmediately how fucking dumb I was.\n\nTook my wife every bit of pressure to let me buy 1.4BTC a few years ago. She has\nfinally come around,…",
  "data/reddit-crypto/r/Bitcoin/comments/krt757/today_im_going_to_quit_my_drug_addiction_and.json": "I don’t know what the future entails, but there’s a light at the end of the\ntunnel and thank you to this thread for helping me.\n\nI really appreciate y’all <3",
  "data/reddit-crypto/r/Bitcoin/comments/krxejr/bitcoin_is_hitting_all_time_highs_while_the.json": "Strange isn't it, it's almost like people think Bitcoin is an insurance policy\nfor the future society :)",
  "data/reddit-crypto/r/Bitcoin/comments/krzo9s/using_applied_economics_to_bitcoin_and_why_it.json": "Let me first start out by thanking this subreddit, as it truly has changed my\nlife. The information sharing and passion found in this community is something\nthat is awe inspiring.\n\nJust a little background - I graduated with an applied economics degree and have\nbeen working in finance for over 10…",
  "data/reddit-crypto/r/Bitcoin/comments/ks0fss/1_btc_1_tesla_model_3.json": "So in January 2022, 1 BTC = ?",
  "data/reddit-crypto/r/Bitcoin/comments/ks60x8/i_have_more_money_in_bitcoin_then_ive_ever_had_in.json": "Which isn’t a lot, I’m 15 and always spend money as soon as I get it.\n\nFeels good, as of today I’ve essentially doubled what I first put into Bitcoin.\n\nI essentially put in all my birthday money, then have been DCAing (not sure if\nthat’s the right term but oh well) part of my allowance since…",
  "data/reddit-crypto/r/Bitcoin/comments/ks74r3/whenever_i_see_someone_post_i_sold_i_start.json": "HODL HODL HODL HODL HODL HODL HODL HODL HODL HODL HODL HODL HODL HODL HODL HODL\nHODL HODL HODL HODL HODL HODL HODL HODL HODL HODL HODL HODL HODL HODL HODL HODL\nHODL HODL HODL HODL HODL HODL HODL HODL HODL HODL HODL HODL HODL HODL HODL HODL\nHODL HODL HODL HODL HODL HODL HODL HODL HODL HODL HODL HODL…",
  "data/reddit-crypto/r/Bitcoin/comments/ks9bfy/bitcoin_flag_on_top_of_the_world.json": "I'm from Kathmandu Nepal, i live 100 miles south west of Mount Everest and i\nbelieve bitcoin/crypto currencies will change the world in next 1 or 2 decade\nand i wanted to contribute to the bitcoin community from my part.\n\nI have an idea and that is to put Bitcoin flag on top of Mount Everest (…",
  "data/reddit-crypto/r/Bitcoin/comments/ks9kck/i_just_found_out_i_sold_74_bitcoin_back_in_2012.json": "Been DCA'ing for the past plenty of years whenever i can so im doing fine...\nthink she can sell that bracelet for 2.8 Mil now?...",
  "data/reddit-crypto/r/Bitcoin/comments/ks9o82/stop_looking_at_the_bitcoin_price_understand.json": "I can't call myself a crypto fan or enthusiast. I am an entrepreneur and became\ninterested in bitcoin only because I am scared of what is happening with the US\ndollar. \n\nAmong my friends, opinions about the future of the coin are divided. Some\nbelieve that we are facing another bubble. In contrast,…",
  "data/reddit-crypto/r/Bitcoin/comments/ksgn0g/just_a_reminder_that_if_you_put_the_1200_stimulus.json": "Have a nice day :)",
  "data/reddit-crypto/r/Bitcoin/comments/ksiwnr/40k_has_been_breached.json": "Bitcoin has just reached $40,000 or 1 Bitcoin per Bitcoin.",
  "data/reddit-crypto/r/Bitcoin/comments/ksjb03/fuck_coinbase.json": "Fuck them.\n\n\n\nThat is all.",
  "data/reddit-crypto/r/Bitcoin/comments/ksjjfi/just_sold_to_pay_off_my_parents_mortgage.json": "My parents are everything to me. They've worked their asses off to raise me and\nmy two little siblings, starting with nothing as immigrants. They're in the\nrestaurant business and the pandemic forced them to burn through a large chunk\nof their savings, and they stress out over finances every single…",
  "data/reddit-crypto/r/Bitcoin/comments/ksjpzo/at_every_psychological_price_mark_the_noobs_start.json": "See you again at 50K you losers ;-).",
  "data/reddit-crypto/r/Bitcoin/comments/ksjys3/my_family_have_turned_into_haters.json": "So many feels right now, y'all. My family knows I own bitcoin. They get louder\nthe more the price goes up about how scammy/fad this is and how dumb I am if I\ndon't sell. I'll admit I don't have the thickest skin and life would be easier\nif they at least partially agreed with me, but this is the…",
  "data/reddit-crypto/r/Bitcoin/comments/kskdsl/hey_if_youre_one_of_the_idiots_who_bought_at_the.json": "If you havent bought, wtf are you waiting for?",
  "data/reddit-crypto/r/Bitcoin/comments/kslkaz/just_made_the_best_trade_of_my_life.json": "Put in 300 when we dipped to 37k and just sold at 39k. Made 8 bucks. Omw to\nMcDonald’s for a 20 piece nugget and some fries",
  "data/reddit-crypto/r/Bitcoin/comments/kslrrr/my_favorite_thing_about_coinbase.json": "When btc pumps and you think you might sell.... NOPE Coinbase goes down and\nforces you to HODL. Thank you Coinbase for keeping me disciplined.",
  "data/reddit-crypto/r/Bitcoin/comments/ksn1av/today_i_reached_my_moon.json": "I am a hodler. This is my story of how $15 USD got me a house. The common\nmortgage in my country is 30 years at 12%. Thats a lot. I bought 2 years ago at\nthat rate.\n\nYears ago there were \"revenue share\" scam sites popping up everywhere. I knew\nthey were a scam, but heard of a couple that were…",
  "data/reddit-crypto/r/Bitcoin/comments/ksnkwa/i_found_the_private_keys_to_my_127_bitcoins_i.json": "Back in 2011-2012 (I can’t remember exactly which year it was,) I was playing a\ngame with my friends called Dark Orbit. Within the game was this valuable\nin-game currency called Uridium that allowed you to by premium space ships and\nhigh-tier ammo and whatnot.\n\nTo get Uridium you had to actually buy…",
  "data/reddit-crypto/r/Bitcoin/comments/kspppy/a_friend_asked_me_if_he_should_buy_175k_worth_of.json": "So my friend asked me this question. I am sure others of you have had similar\nquestions asked\n\nThis was my response:\n\n\"Imagine buying in December 2017\n\nYou would now have over $350k\n\nBut not before you watched it slowfall to $40k over a 3 year period.\n\nThis is what you need to be prepared for,…",
  "data/reddit-crypto/r/Bitcoin/comments/kssh4l/realized_i_had_18293532_bitcoin_at_my_grandpas.json": "Literally shaking right now\n\nI was in my grandpa’s office checking all the major exchanges.\n\nI noticed in the corner of my eye a single note on the desk. Clearly it was\nancient, stained yellow and smelled like the paper from the days before\nFacebook. I reached for the scrap, careful to reload the…",
  "data/reddit-crypto/r/Bitcoin/comments/ksxc0z/daily_discussion_january_08_2021.json": "Please utilize this sticky thread for all general Bitcoin discussions! If you\nsee posts on the front page or /r/Bitcoin/new which are better suited for this\ndaily discussion thread, please help out by directing the OP to this thread\ninstead. Thank you!\n\nIf you don't get an answer to your question,…",
  "data/reddit-crypto/r/Bitcoin/comments/kt1ulp/the_oldest_bitcoin_story_ever_told.json": "I just wanted to share my amazing Bitcoin story and how it changed my life.\nEarly in the year 2020, I purchased a sum of sats as a means to buy drugs\nonline. I can now proudly say that the $0.98 left in my wallet is worth $1.57.\nThank you all for your support along the way.",
  "data/reddit-crypto/r/Bitcoin/comments/kt21hg/microstrategys_250_million_dollar_purchase_is_now.json": "On August 8, 2020, the intelligence firm MicroStrategy purchased 21,454\nBitcoins, paying a whopping $250 million dollars. Today, at the price of $40,000\nper coin, MicroStrategys investment is now worth over $858 million dollars.\nThank you MicroStrategy for believing in Bitcoin and seeing its…",
  "data/reddit-crypto/r/Bitcoin/comments/kt2h7e/you_deserve_this_3.json": "You've taken the time to learn and made a smart decision with your money. Alot\nof people here may not think they deserve the new gains because theyre stuck at\na financial ceiling mentally. I want to say to all the HODLrs that you DESERVE\nthese gains and much much more. Others are going to want to…",
  "data/reddit-crypto/r/Bitcoin/comments/ktcgkk/just_hit_1_coin_super_excited.json": "Been DCA’ing since this summer. I know it’s not much but I plan to keep on\nbuying and HODLing!",
  "data/reddit-crypto/r/Bitcoin/comments/ktdivl/think_bitcoin_is_too_expensive_to_get_in_now.json": "First off I 100% believe Bitcoin will go to 100k+.\n\nThat being said when bitcoin was at $40 and had potential to go to $100 would\nyou have bought? Of course you would have! If(when imo) Bitcoin makes it to 100k\nyou’re still early even at today’s price.\n\nJust because something is 40k doesn’t make it…",
  "data/reddit-crypto/r/Bitcoin/comments/ktlcoc/i_just_want_peter_shifts_son_to_make_more_on_btc.json": "Is that so much to ask?",
  "data/reddit-crypto/r/Bitcoin/comments/ktlqpr/on_122920_carolina_panther_offensive_tackle.json": "Bitcoin price is volatile so this assumes bitcoin was worth $27K on 12/29/20 and\nis worth $40K now.",
  "data/reddit-crypto/r/Bitcoin/comments/ktqqah/lets_play_a_little_game.json": "Here is the game: You are not allowed to know the price of BTC for exactly 1\nweek. You can't check it at all for 1 week.\n\nThen, in exactly 1 week come back to this thread with a guess on what the\ncurrent price of Bitcoin is.\n\nOnce you have guessed, you may then know the price of BTC.\n\nYour prize for…",
  "data/reddit-crypto/r/Bitcoin/comments/ktydef/help_me_shut_down_the_bitcoinpaperwalletcom_scam.json": "As some of you know, bitcoinpaperwallet.com was a legitimate service that was\ntaken over by a malicious individual who is stealing the private keys generated\nby that site. There are many Reddit discussions about this.\n\nI have not been affected, but I run a Bitcoin wallet recovery…",
  "data/reddit-crypto/r/Bitcoin/comments/ku15b5/wife_just_asked_me_how_she_can_buy_bitcoin_its.json": "I've been talking to her about Bitcoin since 2013, and she's never been\ninterested. Tonight she asked me how she could buy Bitcoin.\n\nI suspect the true sell signal will be in about a week when I overhear her\ntalking to her friends about it.\n\nYou have been warned.",
  "data/reddit-crypto/r/Bitcoin/comments/ku3r8l/you_know_what_i_dont_care.json": "I don’t care if Bitcoin goes up or down. I don’t care if the market is\nmanipulated. I don’t care about anything to be honest.\n\n2019 was horrible and 2020 was the worst year of my life. I have been suffering\ndepression without being able to do anything, even simpler tasks, and left alone\njust because…",
  "data/reddit-crypto/r/Bitcoin/comments/ku4fzh/with_the_rise_in_price_and_owning_one_whole_coin.json": "The nomenclature must shift at some point. It will become awkward to say you\nhave a certain decimal point of a whole coin, regardless of how valuable that is\nin fiat. Psychologically it just feels weird to me that people will reach a\npoint where they'll invest $1000 USD, a lot of money, for 0.01…",
  "data/reddit-crypto/r/Bitcoin/comments/ku7msr/anyone_looking_to_sell_bitcoin_read_this_first.json": "There are only 21 Million Bitcoin that will ever exist. Currently there are only\n18.5 Mil in circulation. Of this, 4 million bitcoin are considered unrecoverable\nbringing the supply down to 14.5 Mil. Of the bitcoin that is mined everyday,\nthat entire supply is bought by Greyscale alone. With other…",
  "data/reddit-crypto/r/Bitcoin/comments/ku9muh/daily_discussion_january_10_2021.json": "Please utilize this sticky thread for all general Bitcoin discussions! If you\nsee posts on the front page or /r/Bitcoin/new which are better suited for this\ndaily discussion thread, please help out by directing the OP to this thread\ninstead. Thank you!\n\nIf you don't get an answer to your question,…",
  "data/reddit-crypto/r/Bitcoin/comments/ku9yjr/in_2017_i_sold_100_btc_and_bch_for_15m_dollars.json": "Since we are in a bull run (the big one?) I thought I might share some\nreflections. I’m seeing a lot of newcomers (welcome!) as well as some sophomore\ntypes with questions, ideas, admonitions, and the like. Pull up a chair, I've\nbeen around these parts for a while. And if anyone starts in with the…",
  "data/reddit-crypto/r/Bitcoin/comments/kugc9d/cant_believe_we_would_be_bored_at_40k.json": "Still hovering around $40k, just look at the charts, even if it drops 20%, it\nwould be around the the price a week ago. One of my biggest lessons is to let\nyour winners run and don't try and sell to buy lower during a dip that might not\ncome.",
  "data/reddit-crypto/r/Bitcoin/comments/kuhwqb/stop_posting_about_your_wallets_balance.json": "You don't go telling everyone your bank account balance, don't do that with\nBitcoin (or any crypto). It's dangerous. The moment you appear to have a wealthy\nwallet you can turn to a target to someone with malicious intentions.\n\nIt's easier than you think to trace down someone from their reddit…",
  "data/reddit-crypto/r/Bitcoin/comments/kujh4b/a_lot_of_people_come_to_the_sub_looking_for.json": "I'm waiting for the price to drop to buy in, will it?\nThere's a dip, is this a good time to buy? Or will it dip further?\nWill btc be worth x amount?\nI'm thinking of investing half my life savings, what do you think?\n\nTruth is, no one knows and it's all speculation. Do your research, weigh out…",
  "data/reddit-crypto/r/Bitcoin/comments/kulydn/bitcoin_is_alien_resistant_money_buy_btc_because.json": "Trust, adoption, and scarcity are the true defining characteristics of a\nsuccessful deflationary currency. The aliens already have access to more Gold\nthan humanity can fathom and fiat is archaic, so BTC for the salvation of\nhumanity.\n\nRunning a sale today to help onboard new folks",
  "data/reddit-crypto/r/Bitcoin/comments/kuqjbh/if_you_got_emotional_about_the_dip_today_you_need.json": "Dips and rallies is part of investing, it happens in every asset class except\nt-bills. If you got stressed out, you probably need to diversify your portfolio\nto appropriate allocations for your risk tolerance. A 100% cryptocurrency\nposition is bad strategy, or no strategy at all.",
  "data/reddit-crypto/r/Bitcoin/comments/kuqz1t/stop_living_in_the_past.json": "I dont know who needs to hear this but, stop living in the past!\n\nEver heard the saying coulda' shoulda' woulda'? Well it will eat you alive if\nyou let it.\n\nIt doesnt matter that you missed out on buying bitcoin at $100, $1000, or\n$10,000. All that matters is that you know about it now and from this…",
  "data/reddit-crypto/r/Bitcoin/comments/kuregz/many_so_called_bitcoin_or_crypto_trading_experts.json": "Don't get fooled! Most of them know exactly as much as everyone else: nothing!",
  "data/reddit-crypto/r/Bitcoin/comments/kusy0d/yall_been_waiting_for_the_dip_this_is_it_buy_the.json": "This is just consolidation for a move higher.\n\nEdit: FFS of course I have no idea what I’m talking about, anyone that pretends\nto actually know what’s gonna happen is either somesortofidiot or trying to scam\nyou. Stop DMing me.",
  "data/reddit-crypto/r/Bitcoin/comments/kut3tr/bitcoin_bull_run_over_no_its_just_starting.json": "First and foremost, I am not a financial advisor. Do what you want with your\nmoney, I couldn't care less. I look at facts and base predictions around those\nfacts. If you see flaws in my logic, feel free to comment, I always am looking\nfor different perspectives that I may have not thought of. At the…",
  "data/reddit-crypto/r/Bitcoin/comments/kutdny/consider_todays_correction_as_growing_pains.json": "For all the newcomers out there... bitcoin goes up, goes down, if u zoom out,\nyou see the clear picture. If you bought 0.1 btc yesterday, today you still have\n0.1 btc, haven’t lost anything yet unless you sell. If you can’t stomach these\n10% drops, crypto isn’t for you. There were days with 30-40%…",
  "data/reddit-crypto/r/Bitcoin/comments/kuue4k/now_is_the_time_to_buy.json": "Don’t miss this opportunity",
  "data/reddit-crypto/r/Bitcoin/comments/kuug2v/and_another_timebitcoin_was_at_41kthen_it_crashed.json": "That dude jinxed us this weekend",
  "data/reddit-crypto/r/Bitcoin/comments/kuujtz/you_guys_are_weak.json": "You forget the reason we invested in this thing: The incredible technology and\ninnovation this is bringing to the world. This isn’t a day trading venture, this\na long term investment. HODL.",
  "data/reddit-crypto/r/Bitcoin/comments/kuulso/really_scared_of_dip_should_i_sell_now_and_rebuy.json": "Please help should I sell all my btc now so I can just rebuy when its 50k? :D",
  "data/reddit-crypto/r/Bitcoin/comments/kuurwf/if_you_havent_sold_you_havent_lost_anything.json": "You still have as many Sats as you had yesterday.\n\nThat is all.",
  "data/reddit-crypto/r/Bitcoin/comments/kuvws3/i_am_hodling.json": "I type d that tyitle twice because I knew it was wrong the first time.  Still\nwrong.  w/e.  GF's out at a lesbian bar, BTC crashing WHY AM I HOLDING? I'LL\nTELL YOU WHY.  It's because I'm a bad trader and I KNOW I'M A BAD TRADER.  Yeah\nyou good traders can spot the highs and the lows pit pat piffy…",
  "data/reddit-crypto/r/Bitcoin/comments/kuxhe4/daily_discussion_january_11_2021.json": "Please utilize this sticky thread for all general Bitcoin discussions! If you\nsee posts on the front page or /r/Bitcoin/new which are better suited for this\ndaily discussion thread, please help out by directing the OP to this thread\ninstead. Thank you!\n\nIf you don't get an answer to your question,…",
  "data/reddit-crypto/r/Bitcoin/comments/kuzwr7/i_told_my_wife_this_morning_that_btc_dropped_a_bit.json": "Wife: Did you buy some more?\n\nMe: Of course\n\nWife: I'm baking some croissants today, would you like one with your coffee?\n\nMe: Mmm...nah save me one for later though.\n\nWife: How much are you buying?\n\nMe: Dunno I'll see what we have\n\nWife: Is your coffee OK?\n\n...and life goes on in this HODL family.",
  "data/reddit-crypto/r/Bitcoin/comments/kv1ezc/market_dips_are_healthy_purging_deadweight.json": "Bitcoin is a healthy asset.\n\nIt has corrections and dips.\n\nYou know what doesn't correct or dip?\n\nA bubble.\n\nLike the current stock and real estate markets.\n\nStocks and Real Estate prices have been in a 12 year bubble that only survives\nwhile the FED blows hot-air (prints new money in the…",
  "data/reddit-crypto/r/Bitcoin/comments/kv1qmh/if_youre_extremely_nervous_about_this_drop_then.json": "Seriously if you can’t sleep at night because Bitcoin fell 20% then you have too\nmuch of your assets allocated to it. Bitcoin is volatile. It will swing a lot in\nboth directions. You need to be able to handle the volatility. If you can’t\nhandle the volatility then don’t put so much of your money…",
  "data/reddit-crypto/r/Bitcoin/comments/kv2hde/if_youre_new_and_freaking_out_about_this_dip.json": " 1. Welcome to bitcoin\n 2. It does this literally every bull run.\n\nDuring the 2016/2017 run, there were multiple 20-30% corrections before it went\ntruly parabolic.\n\nAfter going from 20k to 40k so quickly, it would be weird if it didn’t correct\nsome.\n\nThis is also why DCA is the way. Yes you may wind…",
  "data/reddit-crypto/r/Bitcoin/comments/kv6nj8/very_unpopular_opinion_do_not_listen_to_people.json": "Disclaimer: this post claims an alternative point of view on the current events,\nafter several removals from r/bitcoin [https://www.reddit.com/r/bitcoin/] I want\nto say that we do have different opinions but this censorship needs to end if we\nwant cryptocurrencies to be taken seriously.\n\n\n\nAll right…",
  "data/reddit-crypto/r/Bitcoin/comments/kv8pdn/could_use_a_little_help_with_karma_to_post_on.json": "I would greatly appriciate if you guys could help me gain some karma so that i\ncan post over at r/CoinBase [/r/CoinBase] . If been trying to get in contact\nwith them via phone, email and facebook, but it just seems impossible to get a\nhold of them. Looks like the only way to get support is from…",
  "data/reddit-crypto/r/Bitcoin/comments/kvi24e/this_cycle_is_its_own_beast.json": "This cycle is its own beast, with shorter, less deep corrections. It is not a\nlengthening cycle nor a run with diminishing ROI. It's not as immature as 2013\nwhich was a pure retail explosion of a few months nor an altcoin driven rally\nwith no clear bearings of what's exactly is happening like…",
  "data/reddit-crypto/r/Bitcoin/comments/kvq8ek/ama_im_nopara73_cofounder_of_wasabi_wallet_and.json": "Since this is already the third time, AMA sessions in January are now a\ntradition for me.\n\nTwo years ago I did an AMA here and found it highly beneficial for clarifying my\nthinking. Last year I aimed to train my mind on the hardest questions there are\nfor someone who's working on a Bitcoin privacy…",
  "data/reddit-crypto/r/Bitcoin/comments/kvr8n3/some_honesty_from_a_longtime_hodler_and_bitcoin.json": "There are a lot of newbies entering the space. There are many reasons this is\ngreat news, but I've also noticed that the quality of posts and discussion about\nbitcoin has plummeted. We really aren't having the important discussions with\nnearly the frequency that we should.\n\nNow I know some of you…",
  "data/reddit-crypto/r/Bitcoin/comments/kvrua1/all_my_friends_started_to_freak_out_about_bitcoin.json": "BTW, I lost 60% of my initial investment in Bitcoin and some other altcoins 1\nweek after I made my first time purchase. I felt like throwing up, but after\nthat dump, I started to do research more about Bitcoin. It's the future. And\nthen I started to HODL and DCA my purchase. I felt nothing about…",
  "data/reddit-crypto/r/Bitcoin/comments/kw33x2/there_needs_to_be_an_easier_way_to_store_bitcoin.json": "If Bitcoin is ever going to be adopted into the mainstream, there needs to be an\neasier way to store it safely and with peace of mind. We on this subreddit love\nto hate the exchanges, and the not-your-keys-not-your-bitcoin sentiment is\nexactly right, but it's also discouraging to newcomers. And if…",
  "data/reddit-crypto/r/Bitcoin/comments/kw7xxm/we_need_the_added_to_the_standard_keyboard_right.json": "How do we make it happen?",
  "data/reddit-crypto/r/Bitcoin/comments/kwpx8e/this_post_is_meant_as_a_big_thank_you_to_all_the.json": "who sold us cheap bitcoin for 30k\n\nwe will never forget your kindness and stupidity",
  "data/reddit-crypto/r/Bitcoin/comments/kwuuh8/as_a_former_shitcoiner_i_hope_im_welcome_to_this.json": "I have learned the hard way, I've said goodbye to all my shitcoins. I've cut my\nlosses and put it all in btc.\n\nI've said goodbye to trading. I've put on my hodl hat, with my DCA sweater. Is\nthere room for one more cryptonaut on the spaceshuttle?",
  "data/reddit-crypto/r/Bitcoin/comments/kwydqb/the_year_is_2050_a_glimpse_into_the_future.json": " * Ebay has been replaced by Openbazaar and everything is 10% cheaper becuase no\n   fee\n * Twitter and Facebook have been replaced by a decrentralized opensource\n   version of social media. there are no ads and your not being tracked\n * Google has been replaced by duckduckgo\n * Price of bitcoin…",
  "data/reddit-crypto/r/Bitcoin/comments/kx0m7l/how_to_properly_buy_the_dip.json": "When Bitcoin has a dip in the price, many wonder where the bottom will be and\nwhen they should buy. Here’s very simple way to time the bottom.\n\n 1. Go to Peter Schiff’s Twitter account.\n 2. Wait for him to tweet something negative about the price drop.\n 3. Buy in right then and there.\n 4.…",
  "data/reddit-crypto/r/Bitcoin/comments/kx3qgc/man_offers_city_72m_to_dig_up_accidentally.json": "James Howells, the owner of a discarded hard drive with 7,500 Bitcoin (BTC), has\nmade a fresh plea to excavate a landfill site and possibly recover the device.\n\nBack in 2013, Howells accidentally threw away a hard drive containing 7,500 BTC\nwhile cleaning his house. The Bitcoin stash came from…",
  "data/reddit-crypto/r/Bitcoin/comments/kx419c/trust_your_gut.json": "My whole family told me to sell bitcoin when it dipped from 41k to 30k (i bought\nat 10k). I just laughed and HODL’d. If you believe in something don’t allow\nyourself to get influenced by family or people online. HODLing for the next 5\nyears😈\n\n100k EOY🚀",
  "data/reddit-crypto/r/Bitcoin/comments/kx4iyb/ecb_head_christine_lagarde_needs_to_be_regulated.json": "https://www.independent.co.uk/news/world/europe/christine-lagarde-trial-imf-head-faces-court-bernard-tapie-affair-a7150546.html\n\n\n\nhttps://www.theguardian.com/world/2016/dec/19/christine-lagarde-avoids-sentence-despite-guilty-verdict-in-negligence-trial\n\n\n\njust a few...",
  "data/reddit-crypto/r/Bitcoin/comments/kx4x67/my_dad_doesnt_believe_in_bitcoin_but_he_plays_the.json": "I was not sure to tell my family I had bitcoin. Then my dad tells me how Bitcoin\nhas no value and is going to collapse sooner or later. I mean, sure there will\nbe dips, but long term looks promising imo. Then aside he tries to win the\nlottery and buys a ticket every week. I mean, nothing wrong, to…",
  "data/reddit-crypto/r/Bitcoin/comments/kx72ug/18600000_btc_mined.json": "This is more than 88.5% of the total amount of btc that will ever be in\ncirculation.",
  "data/reddit-crypto/r/Bitcoin/comments/kx7wqk/yeah_40k_again_boring.json": "just kidding, great, here we go :)",
  "data/reddit-crypto/r/Bitcoin/comments/kx8ci5/dont_trade_bitcoin.json": "What we saw this week was a trick that has been pulled countless times. It was a\nshakedown. You all thought you were smarter than the market. And guess what? You\nweren't.\n\nThe people that need bitcoin the most sold off their coins because the market\ntook a slight (and brief) tumble. When they panic…",
  "data/reddit-crypto/r/Bitcoin/comments/kxfnpf/advice_from_my_17yo_daughter_just_buy_it_mum.json": "she has no financial expertise, no experience, no money and no job (ty 2020) but\nshe's adamant that I should stop faffing around waiting for a significant dip\nand just buy in. She says the price is only going to go up in the long term,\nhoping she's right because I bought in yesterday!\n\nwish me…",
  "data/reddit-crypto/r/Bitcoin/comments/kxhxv7/warning_bitpay_is_now_forcing_every_user_to_both.json": "https://imgur.com/a/ruIvZu6\n\nAs you can see in the screenshot BitPay is now forcing us customers to register,\nidentify ourselves and set up a wallet on BitPays website to increase their user\nbase --- in order to pay with bitcoins for a pizza. This is some NSA bullshit.\nUs customers whom they are…",
  "data/reddit-crypto/r/Bitcoin/comments/ky81ti/this_bull_market_doesnt_stop_at_40k.json": "From the growth of the previous cycles we still have a 7x upside potential. I\nlove the Plan B chart, but this puts Bitcoin potential in another light.\n\n\n\nBitcoin After the 3rd…",
  "data/reddit-crypto/r/Bitcoin/comments/kyehba/every_time_i_beat_the_urge_to_eat_out_i_drop_25.json": "Every time i want to eat out and end up cooking at home instead I invest 25 into\nBitcoin, that’s my way of investing without being hurt about potential losses.\nNot much initial but it’s adding up!",
  "data/reddit-crypto/r/Bitcoin/comments/kyl4r9/people_ask_whos_gonna_buy_your_btc_at_100k_well.json": "I have always responded to people who tell me these things by saying I will be\nthe first to admit I am wrong when the time comes. So let's wait, 3, 5, 7 years,\nand then call me out. Just like I have done in the last 8 years. Guess what?\nThey never show up.\n\nThe problem is, not only have we been…",
  "data/reddit-crypto/r/Bitcoin/comments/kynu0s/heres_to_a_fairy_tale_ending.json": "So today I bought 0.06 Bitcoin and it's a rather exciting experience. My life\nhas been quite the shit-storm these last two years.\n\nDue to a combination of making my own mistakes and finding out my parents'\nactual financial position I had to take out a few loans and put my plans on\npurchasing my…",
  "data/reddit-crypto/r/Bitcoin/comments/kys0ta/sent_mistakenly_1_btc_to_huobis_cold_please_help.json": "Hi everyone, 30 months ago I sent mistakenly 1 BTC to the Huobi's cold wallet.\nYes, I'm retard, I feel terrible.\n\nTransaction:\n\nhttps://www.blockchain.com/es/btc/tx/4769c93d8c9e0d5eaf8311ac8af513e23096ae461da0256a77cf70ca73fd4e4b\n\n\n\nHow I send mistakenly 1 BTC to the Huobi Cold Wallet?\n\nA day I was…",
  "data/reddit-crypto/r/Bitcoin/comments/kz07bd/the_50_btc_i_spent_on_dmt_wasnt_worth_it.json": "Burning a bunch of DMT in a weed pipe was not worth 1.7 million dollars :(",
  "data/reddit-crypto/r/Bitcoin/comments/kz8xdn/every_boomer_had_a_chance_to_buy_a_house_for.json": "the year is 1970s. I'm not going to be a idiot and pay $40,000 for a house and\nbuy at the top said the boomer who continued to rent.\n\n\n\nthe year is 2020s. I'm not going to be a idiot and pay $40,000 for a bitcoin and\nbuy at the top said the millennial who continued to live on the fiat standard…",
  "data/reddit-crypto/r/Bitcoin/comments/kzu43b/the_first_mention_of_bitcoin_on_a_mainstream_tv.json": "It came just three years after bitcoin's creation and aired when the price of\none Bitcoin would set you back around $6.90 (the price was already double what\nthey recorded it as).\n\nThe TV show that mentioned bitcoin was The Good Wife, and the episode was called\n'Bitcoin for Dummies' (yes, the entire…",
  "data/reddit-crypto/r/Bitcoin/comments/kzv7cm/lamborghini_us_dealer_says_they_now_accept.json": "What’s that saying, “there’s no such thing as a coincidence?” Well, here’s\nLamborghini of Newport Beach stating that they now accept cryptocurrencies as\npayment, during the most massive bull run in Bitcoin history no less.\n\nAlthough, you will have to call them and see which coins are accepted and…",
  "data/reddit-crypto/r/Bitcoin/comments/kzy36t/i_just_set_my_best_friend_up_with_a_software.json": "I get the feeling when I try explaining Bitcoin, cryptocurrency and blockchain\ntechnology to people, they nod and smile and say \"thats cool!\" but people dont\nreally get it. I feel that its one of those things that you have to experience\nfor yourself to really understand it.\n\nSo rather than…",
  "data/reddit-crypto/r/Bitcoin/comments/l055av/greyscale_just_added_another_16000_btc_to_their.json": "Greyscale just added another 16,000 BTC worth over half a billion dollars to\ntheir holdings. This is the smart money coming in.\nhttps://www.bybt.com/Grayscale",
  "data/reddit-crypto/r/Bitcoin/comments/l0kmht/my_greatest_mistake_is_to_sell_bitcoin_at_15k.json": "I am a Bitcoin trader in the last 5 years. I have more than 1 Bitcoin but i sold\nit with $15k to wait for correction but market becomes bull after my sold. Now\nit's a regretting time for me. Now my realize it to hold Bitcoin longer time is\nthe better idea to trade short term.",
  "data/reddit-crypto/r/Bitcoin/comments/l0r7gt/with_yellen_parroting_the_same_nonsense_thats.json": "She's saying the same rubbish about bitcoin being used for terrorism and money\nlaundering, despite chainalysis' report saying that in 2019, just 1.1% of\ntransactions were being used for illegal activity:\nhttps://blog.chainalysis.com/reports/cryptocurrency-crime-2020-report\n\nIf countries like the US…",
  "data/reddit-crypto/r/Bitcoin/comments/l110kt/to_all_of_those_thinking_they_missed_out_on.json": "Look at all the posts from 2-3 years ago from people thinking the same thing and\nbuy.",
  "data/reddit-crypto/r/Bitcoin/comments/l1gdz1/many_missed_this_but_its_very_bullish_for_bitcoin.json": "> 'Blockchain and Money' course taught by DCI Advisor Gary Gensler is now\n> available on MIT Open Courseware\n> \n> Level Graduate\n> \n> This course is for students wishing to explore blockchain technology's\n> potential use—by entrepreneurs and incumbents—to change the world of money and\n> finance.\n>…",
  "data/reddit-crypto/r/Bitcoin/comments/l1hhzb/bitcoin_is_not_threatening_banks_bitcoin.json": "I know that banks have a bad reputation, but they are in charge of a crucial\neconomic task in a healthy capitalist system: they connect lenders and\nborrowers; they canalize resources (savings) from people that don't have ideas,\nto people that have ideas but need resources to implement them. They…",
  "data/reddit-crypto/r/Bitcoin/comments/l1jtqu/fuck_ledger_just_received_a_phone_call_from_a.json": "Some scammer contacted me asking if I want to open a bitcoin/ethereum wallet\nwith them. I wonder how they got my phone number and name since I don't use my\nphone number on sketchy websites. Then I check my email and saw ledger emailing\nme saying my personal info has been exposed.\n\nUpdate: Just…",
  "data/reddit-crypto/r/Bitcoin/comments/l1zb6v/if_you_regretted_buying_at_the_top_or_were_afraid.json": "Now we're not at the top anymore. You can DCA your average buy price down and\nheed the advice of successful traders for as long as time to buy the dips. Enjoy\nthe blessing bestowed upon you",
  "data/reddit-crypto/r/Bitcoin/comments/l1zdaz/21_million_club_finally.json": "Guys, I know you might not care and that's fine. For those who may be interested\nand want to know how I did it, I want to share my journey to 1 Bitcoin.\n\nLike most of you, I started in 2017 during the bull run (around May).\n\nI started by buying $100 a Bitcoin which was around 0.05 Bitcoin. I wanted…",
  "data/reddit-crypto/r/Bitcoin/comments/l224co/even_though_bitcoin_has_dropped_24_in_the_last.json": "Hodl and hoardl. Buy the dip. We're not only fine, we're doing GREAT.",
  "data/reddit-crypto/r/Bitcoin/comments/l22yxq/a_doublespend_broke_bitcoin_fud_that_was.json": "\"There was a chain re-organization in the Bitcoin blockchain. This is a common\noccurrence that is part of Bitcoin's normal operation. It is a result of\ndecentralized consensus under Proof-of-Work. All PoW chains do this. \" -\nAantonop on Twitter\n\nhttps://www.bloomberg.com/news/articles/2021-01-21/why…",
  "data/reddit-crypto/r/Bitcoin/comments/l2385x/boycott_cointelegraph.json": "They have been publishing lot of FUD’s and bearish articles lately. Latest FUD\nregarding double spend is very irresponsible. It seems like they have got paid\nto do so.",
  "data/reddit-crypto/r/Bitcoin/comments/l2613y/good_bye_guys.json": "Today I have bought my last few satoshis, and now I will put them to rest in my\ncold wallet for a few months.\n\nI have flirted with cryptos since 2017, but these last few weeks I have consumed\na crazy lot of information about bitcoin, and an enormous brain processing time,\nI have learnt and…",
  "data/reddit-crypto/r/Bitcoin/comments/l270e1/price_keeps_dropping_every_time_i_buy.json": "Eventually I’ll own all the Bitcoin",
  "data/reddit-crypto/r/Bitcoin/comments/l285pd/janet_yellen_i_think_it_important_we_consider_the.json": "The written responses from Janet Yellen's senate confirmation hearing yesterday\non cryptocurrencies is much more balanced and measured than her verbal response\nmaking the headlines.\n\nHere's a link to the full transcript on the…",
  "data/reddit-crypto/r/Bitcoin/comments/l2bush/bitcoin_below_30k.json": "Bitcoin just touched below $30K, those who were looking to buy cheap, here you\ngo, also Ether closer to $1K.\n\n\n\nEdit: Now it is below $29K (5:19 PST).",
  "data/reddit-crypto/r/Bitcoin/comments/l2c6vx/i_fucked_up.json": "So, as the title suggests. I Fucked up big time.\n\nI've been in crypto since 2017, been putting all my extra cash into the markets\nsince then. Been active in communites and definitely confident about the future\nof crypto.\n\nIll skip to my fuckup.\n\nI had recently decided to trade using leverage,…",
  "data/reddit-crypto/r/Bitcoin/comments/l2cygt/anyone_else_remember_the_50_drop_last_march.json": "I remember going to bed and we were sitting around $8k. Woke up the next morning\nand we were at $4k. Honestly wasn’t even phased (been in crypto since 2016; I\nwas somewhat desensitized by that point)\n\nRemember everyone freaking out? I don’t, because we were back up just over a\nmonth later. With…",
  "data/reddit-crypto/r/Bitcoin/comments/l2dd51/my_experience_says_near_28kusd_is_bottom_you_can.json": "Edit: Price was 30k at the time of posting this. I'm not just guessing. I\nanalyzed a couple of news and information which i have access to. Also this Bet\nis Legit til end of the January. You can edit your comment later\n\n\nEDIT 2: I CAN'T GIVE AWAY MORE THAN $1100 WITH FEES INCLUDED, SO IT ONLY GOES…",
  "data/reddit-crypto/r/Bitcoin/comments/l2dsb5/people_who_bought_bitcoin_at_40k.json": "https://preview.redd.it/k7w29m8nmsc61.jpg?width=828&format=pjpg&auto=webp&s=900713db91768223578f7ec4cd7e7ffa5bec2a07",
  "data/reddit-crypto/r/Bitcoin/comments/l2dwvd/hello_noobs_freaking_out_yet.json": "It looks like we’ve experienced our first 30% correction for this cycle. Did you\nknow in 2017, whenever bitcoin had a 30+% correction, it was followed by a rally\ndoubled or more in just a few weeks? And there were FIVE 30+% corrections in\n2017. Did you sell? Hodling strong? Did you buy the dip? If…",
  "data/reddit-crypto/r/Bitcoin/comments/l2hys8/placed_order_to_buy_at_29350_and_it_resolved_at.json": "FOMO = real\n\nDips = FOMO+\n\nBitcoin = peace of mind",
  "data/reddit-crypto/r/Bitcoin/comments/l2ks4c/the_market_reacting_to_the_double_spend_news_is_a.json": "The stale block / valid block scenario is even anticipated in the Bitcoin white\npaper.",
  "data/reddit-crypto/r/Bitcoin/comments/l3c50u/i_think_this_belongs_here_never_forget.json": "https://preview.redd.it/ro060gxy33d61.png?width=460&format=png&auto=webp&s=02a27fc171d2d39e7b636b03e898a86e3c704206",
  "data/reddit-crypto/r/Bitcoin/comments/l3f4ul/the_first_bitcoinlightning_card_payment_ever.json": "https://reddit.com/link/l3f4ul/video/ykfiygfny3d61/player",
  "data/reddit-crypto/r/Bitcoin/comments/l3l5v1/crypto_helped_me_to_stop_gambling.json": "I know getting into crypto market is also gambling, but much better. I occupy\nmyself with technical analysis, research, lots of reading. I just think about\nhow its much better to put my money into crypto rather than slots. Crypto is\nlong-term and slots are neither short-term or long-term.",
  "data/reddit-crypto/r/Bitcoin/comments/l3uxy3/sent_btc_remittance_to_family_in_argentina_the.json": "Family member's landlord wanted hiked rent to double what she was paying. He did\nthat in the middle of a pandemic; her savings were depleted, and was facing\nexorbitant prices to move into a new place. PANIC.\n\nBTC was made for this, I thought, so I offered to help with the cost of moving.\nWhen she…",
  "data/reddit-crypto/r/Bitcoin/comments/l3x40b/today_starts_the_day_on_which_i_exchange_my_bad.json": "I spend ~200/300€ monthly on weed. Smoking for 10+years, for 7years daily.\n\nI don't wanna know how much I could have earned if I invested that money into\nsomething useful rather damaging my health. From this day, I will invest that\nmoney monthly into Bitcoin (DCA'ing), also I try to buy more on dips…",
  "data/reddit-crypto/r/Bitcoin/comments/l40r4f/139_btc_were_traded_last_week_in_venezuela_using.json": "Hi guys, as I always post. I live here, last week cost of living has increased a\nlot, I think months ago you could \"survive\" with 50-60 USD monthly, now that is\nnothing. You need much more, it has been hitting hard.\n\nThis last week was the same, the volume traded is amost constant in USD that is\nwhy…",
  "data/reddit-crypto/r/Bitcoin/comments/l45ph3/thanks_fidelity.json": "Fidelity hosting [https://gyazo.com/fb7a90a6190652df2b6a95258c04bf3f] Bitcoin's\nWhite Paper.\n\nhttps://twitter.com/DigitalAssets/status/1352364235242811392",
  "data/reddit-crypto/r/Bitcoin/comments/l529b0/stop_fcking_around_and_buy_bitcoin.json": "WSB just pulled off the greatest FU to institutional investors. 2 Million\nsubscribers literally threw their life savings and caused NYSE exchange to put\ncircuit breakers cause of how much institutional bears were losing money.\n\nSee how united they were in taking down the bears? We have 2…",
  "data/reddit-crypto/r/Bitcoin/comments/l5pqg7/couldnt_hodl.json": "I just sent everything I had in Bitcoin from my ledger to Coinbase.. I need the\nmoney, always thought I’d be able to hodl longer but I haven’t gone to work in a\nmonth and I’m out of boring people money so here I am, saying goodbye to you\nguys. It was nice, got a good amount, enough to pay rent for…",
  "data/reddit-crypto/r/Bitcoin/comments/l5sftn/i_heard_this_is_the_place_to_get_karma_for_access.json": "I'm trying to contact their support people.",
  "data/reddit-crypto/r/Bitcoin/comments/l5xesy/im_not_jealous_of_the_gains_people_made_on_gme_im.json": "This was what we Bitcoiners were supposed to be about. I’m cheering them from\nafar, but deep down inside that should’ve been us. We should’ve been the ones to\nfuck the system over and shoot to $1m...",
  "data/reddit-crypto/r/Bitcoin/comments/l5xv45/dont_be_the_person_who_doesnt_see_the_iceberg.json": "You are probably checking the bitcoin price, sweating. Maybe you bought this\nmonth and are down, maybe you bought a few months ago and until recently, you\nwere up big. I hope you aren't selling.\n\nI'm not rich, but I had a condo and sold it. You know what I bought? Bitcoin.\nAnd guess what-I'm not…",
  "data/reddit-crypto/r/Bitcoin/comments/l62bgk/how_i_spent_13_million_dollars_on_a_pizza_for_a.json": "So I was told I needed to post this story on Reddit. So here you go when Bitcoin\nwas just over a dollar, ($1.13) I played an Online game With a friend who lived\nin Norway, the game was EVE online. We had been playing that game since 2004,\nand one day me and my roommate who also played EVE ordered…",
  "data/reddit-crypto/r/Bitcoin/comments/l64w42/the_truth_about_earning_interest_on_your_bitcoin.json": "I just realized this, Yeah many of you must already know and think this is\nobvious, but I've never seen anyone talk about this so I'll post It anyway.\n\nThe truth is the bitcoin you put in a savings account is being loaned and being\nused by short sellers, there is no other use for borrowing Bitcoin…",
  "data/reddit-crypto/r/Bitcoin/comments/l6625b/you_wanted_the_perfect_time_to_buy_bitcoin.json": "People see 1000% gains off r/wallstreetbets [/r/wallstreetbets] so they are\nselling everything to go all in on gamestop and all stocks listed by wsb.",
  "data/reddit-crypto/r/Bitcoin/comments/l6e57r/2m_subs.json": "We just hit that milestone!\nCongrats y'all",
  "data/reddit-crypto/r/Bitcoin/comments/l6qgfr/dont_sell_your_bitcoin_because_media_told_you_so.json": "your bitcoin=your property ,\n\nselling your bitcoin cause media says negative things about bitcoin is like\nselling your car because a stranger told you so.\n\njust hodl and sell whenever you feel like it,media knows no shit.",
  "data/reddit-crypto/r/Bitcoin/comments/l6zamb/this_is_good_for_bitcoin.json": "Restriction of a free market trading will be good for Bitcoin short term. It's\ncentralized control of a trading market based on a fiat currency supported by\ndebt.\n\nWhat we are seeing today is not a free market. The game is clearly rigged. And\nit's being advertised more then ever.\n\nThis will be good…",
  "data/reddit-crypto/r/Bitcoin/comments/l71e0j/we_need_to_prepare_ourselves_for_the_day_big.json": "The day we are all waiting for when mass adoption of BTC and altcoins is coming.\nThese past weeks have shown the faults of our financial system to the masses.\n\nHowever, it has also shown the lengths the banks will go to in an effort to lock\nout unsophisticated investors. I urge you all to move the…",
  "data/reddit-crypto/r/Bitcoin/comments/l78p09/what_is_stopping_us_from_doing_what_wsb_did.json": "There’s a movement to buy bitcoin on the 30th of January at 3PM Eastern. We need\nto show big companies and banks that if they want in they need to buy at OUR\nprice.",
  "data/reddit-crypto/r/Bitcoin/comments/l7aca8/howto_move_your_money_off_robinhood_to_coinbase.json": " 1. enable cash management (checking account) on robinhood:\n    https://robinhood.com/us/en/about/cash-management/\n 2. sign up for coinbase pro and make sure to go through all the steps to get\n    verified (also check your instant deposit limit, for most it's 25k)\n 3. add your newly created…",
  "data/reddit-crypto/r/Bitcoin/comments/l7fozp/dont_buy_btc_on_robinhood.json": "Not only because of what happened with GME and others but YOU DO NOT OWN YOUR\nBITCOIN IN ROBINHOOD, no e-wallet or anything.......use cashapp",
  "data/reddit-crypto/r/Bitcoin/comments/l7g0c5/my_wsb_stocks_got_fucked_so_i_bought_more_btc.json": "All, I bought GME, AMC, BB, and NOK with the rest of the WSB family to fuck the\nsystem and the system fucked us. It’s obvious for all to see. Frozen trading\nwhere the only option is to SELL? FUCK YOU. I hope that the class action lawsuit\nis so nasty that multiple hedge funds declare bankruptcy and…",
  "data/reddit-crypto/r/Bitcoin/comments/l7hd3a/upvote_every_post_on_rbitcoin_to_spread_the_word.json": "to the moon bois. its works for dogecoin it will work for bitcoin",
  "data/reddit-crypto/r/Bitcoin/comments/l7hh63/decentralized_finance_is_the_only_way.json": "As a GME shareholder, i felt financially abused or even r*ped today. I really\nfelt powerless, as my hard earned money went down the drain, because of a\ncurrupt system, while the media (especially CNBC) is pointing at us as the bad\nguys.\n\nOur democracy is fine as long as the people at the top get the…",
  "data/reddit-crypto/r/Bitcoin/comments/l7mfd5/after_gme_i_finally_understand_bitcoin.json": "The /r/wallstreetbets [https://www.reddit.com/r/wallstreetbets/] GME retail\ninvestors vs the 0.1% situation has lead me to a place of clarity. The game is\nrigged, and the owners of the system will react with haste and break any laws\nthey must to protect their cartel. For those not following the…",
  "data/reddit-crypto/r/Bitcoin/comments/l7niiq/elons_in.json": "https://preview.redd.it/d7lsd398g8e61.jpg?width=1237&format=pjpg&auto=webp&s=8d47e51f1b868dc9cf13d5718a9ed6054ac83185",
  "data/reddit-crypto/r/Bitcoin/comments/l7s5oa/elon_did_it_today_on_purpose_this_is_no.json": "Is there such a thing as a 'Gamma-squeeze' for Bitcoin?\n\n> Bitcoin Options Worth $3.7 Billion Expires On Jan. 29: What Will Happen Next?\n\nhttps://www.ibtimes.com/bitcoin-options-worth-37-billion-expires-jan-29-what-will-happen-next-3125309\n\nEdit: Hedge Funds are short…",
  "data/reddit-crypto/r/Bitcoin/comments/l7ty3m/if_you_join_bitcoin_today_due_to_musks_tweet.json": "To all newcomers arriving in BTC-world today: don't go all in.\n\nBuy a little bit now, a little bit tomorrow, etc.\n\nYou don't want to get burned on your frist day entering the crypto-world (yes,\nyou may not get burned, but a retest of something like 35k is likely, so stay\nrational and dollar-cost…",
  "data/reddit-crypto/r/Bitcoin/comments/l7w5if/delete_robinhood.json": "It’s scam broker! They will do same to BTC as they are doing now to the people\nholding stock shares... Citadel hedge funds CEO is a shadow owner/member of the\nRobinhood broker. Lead trader at Citadel is Jeffrey Psaki, portfolio manager\nCitadel LLC is Jen Psaki White House Press Secretary brother.…",
  "data/reddit-crypto/r/Bitcoin/comments/l84w0x/hedge_funds_have_shorted_about_5bn_of_bitcoin.json": "To cover it up, they would need to buy back about 150 000 bitcoins.\n\nI will let you connect the dots with what happened this last week",
  "data/reddit-crypto/r/Bitcoin/comments/l8ciu0/psa_robinhood_insolvency_dangers.json": "I posted this over at r/wallstreebets [/r/wallstreebets] as well.\n\nRobinhood appears to be on the verge of insolvency based on a few data points:\n\n 1. To continue operating, it drew on a line of credit from six banks amounting\n    to between $500 million and $600 million\n   …",
  "data/reddit-crypto/r/Bitcoin/comments/l8glgq/100000_new_members_on_rbitcoin_in_one_day.json": "Welcome! :) This is so exciting!",
  "data/reddit-crypto/r/Bitcoin/comments/l8lmgq/warning_get_your_bitcoin_out_of_robinhood_while.json": "Remember when we said, “What if Robinhood started trading paper Bitcoin without\nholding actual Bitcoin?”. This is what happens when a dishonest company needs\nmore capital fast and the chances of your RH BTC positions being\nnon-collateralized have literally never been higher. Further, the chances of…",
  "data/reddit-crypto/r/Bitcoin/comments/l8mvru/bitcoins_short_squeeze.json": "To all the new comers, and the legends, get your coins OFF of exchanges! The\nname of the game is HODL!\n\nUntil every exchange is publicly verifiable to be audited to 100% reserve\nrequirements, not only is the risk too high, but the market manipulation\nopportunity in their hand is too high.\n\nBitcoin’s…",
  "data/reddit-crypto/r/Bitcoin/comments/l8pb0g/there_is_no_bitcoin_short_squeeze_please_stop.json": "Bitcoin isn’t GameStop; it will never be GameStop. We aren’t here for short term\nprofits, we are here to revolutionize the world. Please stop posting\nwallstreetbets style posts about Bitcoin. If you are looking to get rich quick,\nthis isn’t the best subreddit for you.",
  "data/reddit-crypto/r/Bitcoin/comments/l9cp4o/please_dont_buy_bitcoin_from_wirex_wirex_is_a.json": "I’ve had Wirex since last October and was pretty pleased with the service as I\ncould exchange foreign currencies with bitcoin and could use my Wirex VISA debit\ncard literally anywhere in the world. As I slowly gained trust over the system,\nI have put a ton of money into my Wirex debit card (over…",
  "data/reddit-crypto/r/Bitcoin/comments/l9emv4/25_year_old_doctor_just_dumped_half_of_my_entire.json": "Genuinely think Blockchain is going to change the world. I'm a doctor and\nconsidering going back to University for a year to do a masters/thesis in\ncryptocurrency and the role it has to play in our future, or studying the online\nliterature that's available now\n\nDumped half of my net worth into it…",
  "data/reddit-crypto/r/CryptoCurrency/comments/knvhwb/only_a_few_more_days_to_submit_comments_on.json": "There are currently only 1000 public comments on the regulation proposal\nrequiring identification for transactions between privately held wallets and\nexchanges.\n\nPlease submit additional comments to:\nhttps://beta.regulations.gov/document/FINCEN-2020-0020-0001\n\nI personally felt that I wasn't smart…",
  "data/reddit-crypto/r/CryptoCurrency/comments/ko7kpa/how_to_make_2021_your_best_year.json": "Here are 5 resolutions to make 2021 your best year.\n\n 1. Waste less time. Got Netflix? Cancel it. Facebook? Delete it. Twitter? Get\n    rid of it. Instagram? Stop it. Reddit? Skip it. Apart from the negative\n    influence a lot of these media have, it's often a horrible waste of time.\n    Americans…",
  "data/reddit-crypto/r/CryptoCurrency/comments/koghwh/how_i_went_from_hodling_almost_13_btc_to_15_btc.json": "https://preview.redd.it/f1ava51onr861.jpg?width=551&format=pjpg&auto=webp&s=10764d943c51d7d9a53aa76d363877e79bc4289d\n\nThe image above shows how much BTC I had in March, 2017. I had been buying BTC\nslowly starting in the fall of 2016, and I eventually accumulated almost 13 of\nthem. If I had just…",
  "data/reddit-crypto/r/CryptoCurrency/comments/kojziw/i_just_think_its_funny.json": "that when XRP got delisted from some exchanges everyone in here loved it. And\nnow when their precious privacy coins start getting delisted all of a sudden\nthey are angry?\n\nI wouldn’t be suprised if Tether is up next. The SEC case with Ripple is\nimportant for every coin in the crypto space. We should…",
  "data/reddit-crypto/r/CryptoCurrency/comments/komapb/daily_discussion_january_2_2021_gmt0.json": "Welcome to the Daily Discussion. Please read the disclaimer, guidelines, and\nrules before participating.\n\n--------------------------------------------------------------------------------\n\n\n\n\n\nDISCLAIMER:\n\nThough karma rules still apply, moderation is less stringent on this thread than\non the rest of…",
  "data/reddit-crypto/r/CryptoCurrency/comments/kowopj/happy_30k.json": "She surpassed 30K on high volume. What a legend.\n\nOne-third of the way towards 100K.\n\n2021 is the year of the bull EDIT: Ox in China, and also the year of the hodl in\ncrypto.\n\nWhen do you see the next retracement happening?\n\nIn the last halving it happened 2 and 4 months after the beginning of…",
  "data/reddit-crypto/r/CryptoCurrency/comments/kp6s43/inside_a_pumpanddump_group_the_deception_the_con.json": "After FunFair (A coin that I legitimately held since 2017) received a massive\npump from $0.0042 to $0.0210, sending the moonshot bag I bought into the\nstratosphere, I looked on this Crypto sub and saw people saying it was a Pump\nand Dump. Curious, I followed the Discord link someone had provided to…",
  "data/reddit-crypto/r/CryptoCurrency/comments/kp90bz/daily_discussion_january_3_2021_gmt0.json": "Welcome to the Daily Discussion. Please read the disclaimer, guidelines, and\nrules before participating.\n\n--------------------------------------------------------------------------------\n\n\n\n\n\nDISCLAIMER:\n\nThough karma rules still apply, moderation is less stringent on this thread than\non the rest of…",
  "data/reddit-crypto/r/CryptoCurrency/comments/kp9lih/bitcoins_growth_looks_remarkably_similar_to_the.json": "This week’s Bitcoin performance reminded me of an article I published months\nago, which I think could invite to great discussions\n\nThe Nasdaq (proxy of the development of internet-based companies) in 1990s-2010s\nand the price of Bitcoin in 2016–2020 look almost…",
  "data/reddit-crypto/r/CryptoCurrency/comments/kpkw9h/the_man_who_received_the_first_btc_transaction.json": "I would love to see the satifisfying smile on Hal Finney’s face as „his“ Bitcoin\nis paving its way to become an accredited and established financial network as\nwell as storage of wealth.\n\nDear Hal, your Bitcoin just cracked the $34k barrier! You and your friends have\nkicked off a fukcing revolution…",
  "data/reddit-crypto/r/CryptoCurrency/comments/kprfw8/why_is_nano_so_polarizing.json": "I only dabble in any cryptocurrency. I have a small amount of BTC and a small\namount of NANO. I invest for fun not ever expecting to make any life-changing\nmoney. I’m not trying to shill anything just curious. NANO seems to be wildly\npolarizing; people either love it or hate it. This leads me to…",
  "data/reddit-crypto/r/CryptoCurrency/comments/kpuwyg/thank_you_eth.json": "My story is probably not much unlike other new investors here.\n\nBut thank you, thank you so much crypto community.\n\nMy father gifted me some ETH for Christmas this year. The hodl profits have\nafforded me first class tickets (safest in regards to social distancing) to and\nfrom where my grandmother,…",
  "data/reddit-crypto/r/CryptoCurrency/comments/kpv4r6/my_dad_believed_in_bitcoin_more_than_i_did.json": "He passed in March of last year. We had talked about Bitcoin and some other\ncryptos quite a bit in the few years prior to that.\n\nKnowing his time was near, one of the last things that he said to me was that he\nfelt strongly that he believed Bitcoin would be the key to financial freedom for\nme.\n\nIt…",
  "data/reddit-crypto/r/CryptoCurrency/comments/kpwdee/daily_discussion_january_4_2021_gmt0.json": "Welcome to the Daily Discussion. Please read the disclaimer, guidelines, and\nrules before participating.\n\n--------------------------------------------------------------------------------\n\n\n\n\n\nDISCLAIMER:\n\nThough karma rules still apply, moderation is less stringent on this thread than\non the rest of…",
  "data/reddit-crypto/r/CryptoCurrency/comments/kq69a3/so_that_was_fun_guys_see_you_all_in_2024.json": "Wish I didn't sell my family into slavery to buy Bitcoin at $34,200. Definitely\nnot going to buy more at $8,500, I'll probably wait until it hits $75,000 and\nhop back in.\n\nI just don't understand how an asset that can swing 20% in an hour could ever be\nworth anything. Really wishing I didn't sell my…",
  "data/reddit-crypto/r/CryptoCurrency/comments/kq8lks/deep_analysis_bitcoin_going_to_384k_may_happen.json": "So I have spent the holidays analysing Bitcoin and come to the conclusion\nBitcoin will likely go to $384K.\n\nReasoning. The distance to the moon from Earth is about 384k kilometres. So for\nBitcoin to go to the moon it will likely have to reach $384K. For those of you\nwho use miles, instead of…",
  "data/reddit-crypto/r/CryptoCurrency/comments/kqagf7/why_hex_is_a_ponzi_and_not_a_solid_investment.json": "In this post I will try to argue why HEX is not a solid investment, and might\neven be a Ponzi scheme\n\nSo before we start analyzing the ERC-20 token HEX, lets get the definition of a\nPonzi out of the way:\n\n> 'A Ponzi scheme (/ ˈ p ɒ n z i /, Italian: ; also a Ponzi game) is a form of\n> fraud that…",
  "data/reddit-crypto/r/CryptoCurrency/comments/kqic5g/us_traders_cryptocrypto_trades_are_taxable_events.json": "tl;dr: The IRS is a bitch and will be looking for ways to squeeze us mooks.\nGet/keep your trades in order. Report your gains. Report \"offshore\" holdings in\nnon-US exchanges. Save some gains for Uncle Sam (gotta fuel those air\ncarriers!). If you don't know what to do, seek professional help…",
  "data/reddit-crypto/r/CryptoCurrency/comments/kqjwpo/today_is_the_last_day_to_make_comments_on_the.json": "Don't feel embarrassed or dejected or hopeless about sharing your\nopinion/voice/ideas, people. Your voice matters. Being cynical about this is\nself-fulfilling and defeatist - there's no harm commenting. (Edit: was thinking\nabout \"no harm commenting\" and that may not be compeltely accurate if you're…",
  "data/reddit-crypto/r/CryptoCurrency/comments/kqkgsb/4_things_i_wish_someone_told_me_about_trading.json": "I bought my first lot of BTC at about $16k and ETH at $1200, about three years\nago. My first few months (years?) in crypto SUCKED. Luckily, I stuck with things\nand am doing pretty well. Here are some things I wish I knew back then in case\nthere are some new people here looking to get into it:\n\n 1.…",
  "data/reddit-crypto/r/CryptoCurrency/comments/kql034/the_occ_will_allow_us_banks_to_use_public.json": "Breaking major news from US Treasury OCC, the largest US banking regulator, with\nnew guidance allowing US banks to use public blockchains and dollar stablecoins\nas a settlement infrastructure in the US financial system.\n\nhttps://www.occ.gov/news-issuances/news-releases/2021/nr-occ-2021-2.html",
  "data/reddit-crypto/r/CryptoCurrency/comments/kqlkcr/daily_discussion_january_5_2021_gmt0.json": "Welcome to the Daily Discussion. Please read the disclaimer, guidelines, and\nrules before participating.\n\n--------------------------------------------------------------------------------\n\n\n\n\n\nDISCLAIMER:\n\nThough karma rules still apply, moderation is less stringent on this thread than\non the rest of…",
  "data/reddit-crypto/r/CryptoCurrency/comments/kqq4b8/dont_be_greedy_advice_from_an_experienced_crypto.json": "When you focus about making money, you lose money.\n\nWhen you focus about losing money, you lose money even faster.\n\nAt the moment where you least expected, when you don't care about money, you\nwake up and login to an exchange and find yourself a millionaire. Then you get\ngreedy and decide to wait a…",
  "data/reddit-crypto/r/CryptoCurrency/comments/kqrikd/sold_my_moons_to_pay_rent_thank_you_reddit.json": "Haven't had a Job since Lockdown started in March. Kept digging through my\nsavings of Cash and Gold for 10 months now. Never had the heart to touch my\nBitcoin and Ethereum portfolio even though it is in 5 Digits.\n\nI was wondering what to do for the rent, for a week now. And just remembered I\nhad…",
  "data/reddit-crypto/r/CryptoCurrency/comments/kqxwgo/the_great_moon_experiment_10000_in_moons_500_usd.json": "Well well well, we meet again. December has brought us even more fun in terms of\nBitcoin's mad run, where it's been banging on the doors of all time highs nearly\nthe entire month! Did the coins everyone here picked hold up? Did they explode\nwith Bitcoin's huge rise? Let's find…",
  "data/reddit-crypto/r/CryptoCurrency/comments/kqzk0n/i_want_to_buy_bitconnect.json": "Ever since I got into crypto I've been fascinated about crypto history. I lived\nthrough the Mt.Gox times, seen Bitconnect arise and fall down, and of course the\nend of OneCoin. So far I managed to collect some of the coins that are part of\ncrypto history like Ethereum Classic, XRP, and some other…",
  "data/reddit-crypto/r/CryptoCurrency/comments/kqzsm8/if_ethbtc_ratio_returns_to_ath_1_eth_would_be.json": "ETH/BTC ratio was just under 0.15 at ATH. We are currently sitting at 0.033. If\nthe ratio would be back at 0.15 one ETH would be worth around $4800 at current\nBTC price. So there's definitely some room above us.\n\nI think we will see ETH at at least $3000 this year. I'm not sure if the ratio\nwill go…",
  "data/reddit-crypto/r/CryptoCurrency/comments/krbcrg/daily_discussion_january_6_2021_gmt0.json": "Welcome to the Daily Discussion. Please read the disclaimer, guidelines, and\nrules before participating.\n\n--------------------------------------------------------------------------------\n\n\n\n\n\nDISCLAIMER:\n\nThough karma rules still apply, moderation is less stringent on this thread than\non the rest of…",
  "data/reddit-crypto/r/CryptoCurrency/comments/krgax5/bitcoin_just_hit_35k.json": "We did it boys. To think 9-10 months ago btc crashed to 4K. For everyone that\nbought and held through all these crazy times y’all have balls of steel. Idk if\nthis shit gonna keep going up or come crashing down but it is exciting to see\ncrypto coming this far. To think we are almost at a 1 trillion…",
  "data/reddit-crypto/r/CryptoCurrency/comments/krmgf8/i_most_likely_lost_26_btc_because_im_an_idiot.json": "Let this be a warning to tech-savvy and over-confident coin hodlers. I got\nmyself a new computer for xmas and I wanted to use the old one for work stuff.\nFirst order of business is to make sure I have a backup of the private keys.\nWell, no problem, I already have encrypted backups of my private keys…",
  "data/reddit-crypto/r/CryptoCurrency/comments/krp68i/the_trillion_is_near_lets_prepare_to_celebrate.json": "At the moment in which I'm writing the global crypto market cap is $\n957,181,215,280. Another 4,473% increase will make us reach the TRILLION. We\nshould all celebrate, no matter what are our bags and flags. We are witnessing\nthe rise of something that will go beyond the economical aspect, which…",
  "data/reddit-crypto/r/CryptoCurrency/comments/krsz0h/shoutout_to_kraken_and_its_awesome_services.json": "Seriously. They are long gone their 2017 issues where it took months to get\nverified and where their servers would lag/shut down each time the traffic was a\nbit heavy.\nDeposit crypto on the account ? Takes seconds\nDeposit fiat on the account ? 24h later and the cash is there\nWithdraw money ? Just…",
  "data/reddit-crypto/r/CryptoCurrency/comments/krtad7/fincen_wants_to_force_cryptocurrency_exchanges_to.json": "Edit: We'll be hopping on to answer all your questions at 3pm ET, but in the\nmeantime please upvote the thread and post your questions!\n\nFinCEN, an arm of the US Treasury, has proposed a new rule allowing them to\ntrack your cryptocurrency transactions without the need for a warrant. They want\nto…",
  "data/reddit-crypto/r/CryptoCurrency/comments/krtjn5/am_i_the_only_one_scared_to_see_btc_at_35k.json": "It looks surreal and deep down I can feel the PTSD kicking in. \"They will scam\nit\", my gut is telling me, and I am ready for a -50% dip at any moment. It's\ninsane under how much scrutiny was BTC, they called it \"dead\" in March. People\nwere saying it's going under 1000 dollars. Look where our boy is…",
  "data/reddit-crypto/r/CryptoCurrency/comments/ks096g/total_crypto_market_cap_exceeds_1_trillion.json": "Today marks a historic day in Crypto's young history, as it's total Market Cap\nexceeds 1 Trillion Dollars for the first time ever. ($1.000.000.000.000)\n\nhttps://preview.redd.it/rreyvk5iss961.png?width=1240&format=png&auto=webp&s=0e05be8cab664a0dca0e1026339e94d835a182d1\n\nI wish to use this…",
  "data/reddit-crypto/r/CryptoCurrency/comments/ks0m06/bitcoin_sets_new_alltime_high_above_37000.json": "🥳 Bitcoin Sets New All-Time High Above $35K\n\n🥳 Bitcoin Sets New All-Time High Above $36K\n\n🥳 Bitcoin Sets New All-Time High Above $37K\n\n📈 New World: 🚀🌒\n\n📉 Old World (brrrrrrrrrrrr): 🖨 💵 💵💵💵\n\n🥳 Bitcoin Sets New All-Time High Above $35K\n\n🥳 Bitcoin Sets New All-Time High Above $36K\n\n🥳…",
  "data/reddit-crypto/r/CryptoCurrency/comments/ks0orl/daily_discussion_january_7_2021_gmt0.json": "Welcome to the Daily Discussion. Please read the disclaimer, guidelines, and\nrules before participating.\n\n--------------------------------------------------------------------------------\n\n\n\n\n\nDISCLAIMER:\n\nThough karma rules still apply, moderation is less stringent on this thread than\non the rest of…",
  "data/reddit-crypto/r/CryptoCurrency/comments/ks5s3u/its_finally_happening_nano_is_booming.json": "I don't hold any NANO but after seeing the NANObros get dunked on in this sub\nfor holding it was kind of nice to see it exploding on the charts.\n\nNot sure how long it'll last but I noticed the last couple of days it's been\ngoing parabolic after literal years of moving sideways and not doing much…",
  "data/reddit-crypto/r/CryptoCurrency/comments/ks9sv5/i_used_to_give_nano_loads_of_shit_but.json": "Title + I still personally don't like it and won't personally be investing. But\nas someone who HODL'd the bear market I am happy to see the price rise so much\nfor the holders.\n\nWhy? Because nano shills, as relentless as they are, still advocate crypto\ncurrency fundamentals, such as…",
  "data/reddit-crypto/r/CryptoCurrency/comments/ksba4i/so_you_think_we_are_getting_close_to_an_alt_coin.json": "Well, we are not.\n\n\n\nBelow is a simple illustration of the grand potential of a REAL alt coin bubble.\nThe last time we were in alt coin bubble territory;\n\n * Ethereum reached an ETHBTC ratio of 0.15 in June 2017, corresponding to a\n   value of 350 USD at the time.\n * Ethereum reached an ETHBTC ratio…",
  "data/reddit-crypto/r/CryptoCurrency/comments/ksdfne/why_tether_might_tank_the_crypto_market_on_jan.json": "> On the 9th of July 2020 The New York Court approved an investigation by the\n> state's attorney general to look into numerous businesses behind Tether\n> (stablecoin). At the time of writing Tether is almost hitting a $23b Market\n> Cap, an increase of around $18b USD since the beginning of…",
  "data/reddit-crypto/r/CryptoCurrency/comments/ksetg6/jan_7_vote_for_the_coin_of_the_day_whos_gonna_win.json": "Let's try to make a new tradition for this Sub! 🎉\n\nVote for the coin of the day in the Poll below, ill gather the most \"hyped\"\ncoins from the Daily Discussion of the day and will list them in the Poll.\n\nthe Winner coin will be pronounced Coin Of The Day of Jan 7 🥇.\n\nif there's a coin that you like…",
  "data/reddit-crypto/r/CryptoCurrency/comments/ksfm9z/a_cryptocurrency_hasnt_failed_just_because_its.json": "There's a quote from Oscar Wilde that I believe applies to how many of us\n(myself included) view cryptocurrencies:\n\n\"Nowadays people know the price of everything and the value of nothing.\"\n\nWhen Bitcoin crashed in March it wasn't \"dead\". And if it goes up to $100k that\nalone doesn't make it a…",
  "data/reddit-crypto/r/CryptoCurrency/comments/ksiwjy/bitcoin_sets_new_alltime_high_above_40k.json": "🥳 Bitcoin Sets New All-Time High Above $35K\n\n🥳 Bitcoin Sets New All-Time High Above $36K\n\n🥳 Bitcoin Sets New All-Time High Above $37K\n\n🥳 Bitcoin Sets New All-Time High Above $38K\n\n🥳 Bitcoin Sets New All-Time High Above $39K\n\n\n🥳 BITCOIN SETS NEW ALL-TIME HIGH ABOVE $40K\n\n—\n\n📈 New World:…",
  "data/reddit-crypto/r/CryptoCurrency/comments/ksk6ao/we_are_100_in_a_bull_run.json": "There's one method I always use to determine whether we are in a bull run, and\nit's my mom. She knows nothing about investing or crypto, but when she brings me\nan article where it says \"look at how this person is getting rich with crypto\netc\" that's when I know.\n\nIt happened just know, with some bs…",
  "data/reddit-crypto/r/CryptoCurrency/comments/kslghs/when_the_crypto_bull_run_will_reach_its_peak_the.json": "In 2013 and 2017, my grandma called me to ask me \"what bitcoin is\" at the peak\nof bitcoin's bull run. Both times after she called, crypto crashed. It's my best\ntechnical indicator.\n\nDon't worry, she didn't call me yet. The crypto bull run will continue.",
  "data/reddit-crypto/r/CryptoCurrency/comments/ksltlx/i_trader_my_moons_for_doge_and_then_bought_a_dog.json": "Firstly I would like to say a massive thank you to everyone that upvoted my\nrubbish jokes and random posts.\n\nSince the lockdown my little one has felt lonely, not being able to play with\nfriends. So we decided to cheer her up and get a dog. A friend to grow up with.\n\nAfter the latest moon drop, I…",
  "data/reddit-crypto/r/CryptoCurrency/comments/ksqczb/daily_discussion_january_8_2021_gmt0.json": "Welcome to the Daily Discussion. Please read the disclaimer, guidelines, and\nrules before participating.\n\n--------------------------------------------------------------------------------\n\n\n\n\n\nDISCLAIMER:\n\nThough karma rules still apply, moderation is less stringent on this thread than\non the rest of…",
  "data/reddit-crypto/r/CryptoCurrency/comments/kssze7/unpopular_opinion_remember_to_take_profits.json": "I don't know if prices will continue going up (probably they will) but having\npassed the 2017/2018 crash I strongly recommend to take some profits even if\njust a little. You will regret if you don't and prices tumble. Now downvote me\nif you want to. I thought I owned this to the community.",
  "data/reddit-crypto/r/CryptoCurrency/comments/kst1wh/bitcoin_has_given_me_some_breathing_room.json": "I’ve always been poor, like below poverty levels of poor. I’ve always worked\nfull time but I dropped out of college so I have only ever worked entry level\njobs. I’m not blaming anyone or asking for sympathy it’s totally been my own\nfault between poor choices and being stumble-drunk for about 5 years…",
  "data/reddit-crypto/r/CryptoCurrency/comments/kt09tg/best_decentralized_exchange_dex_right_now.json": "I'm looking for better places to trade ETH on some DEXs and help out with\nliquidity. Right now I'm only using Uniswap [https://uniswap.org/] (because it's\nthe only one I know), but I was wondering what other decentralized exchanges\nthere are that work TODAY (i.e. not tomorrow).\n\nI know there's…",
  "data/reddit-crypto/r/CryptoCurrency/comments/kt2bbr/reminder_the_users_of_this_sub_are_seen_as.json": "The sheer number of low quality click-bait journalism coming out of the crypto\nspace is absolutely mind blowing. There are people making way more money off of\nyour eyeballs and your clicks than they are on crypto. Just be aware of this\nevery time you share, upvote, and click on some dumb low quality…",
  "data/reddit-crypto/r/CryptoCurrency/comments/kt6a4h/fomo_traps_to_avoid_beginner_guide_with.json": "As an oldie, I'm seeing too many people fall for easy traps when buying crypto\nand I feel like creating a very easy to understand guide to protect people from\ngetting burned when buying crypto. If there's enough interest for this guide I\ncould create additional parts for technical indicators as well…",
  "data/reddit-crypto/r/CryptoCurrency/comments/kt7lhp/i_bought_1k_of_the_top_10_cryptos_on_january_1st.json": "EXPERIMENT - Tracking 2019 Top Ten Cryptocurrencies – Two Year Report - UP +169%\n[https://preview.redd.it/zoa5t7cl75a61.png?width=666&format=png&auto=webp&s=f3d8acaa38a5d7bcfd2f12bca80f8319e7d9d191]\n\nFirst things first, Happy New Year!\n\nTo mix things up a bit for year end, I'm going to release the…",
  "data/reddit-crypto/r/CryptoCurrency/comments/ktytsq/how_i_quintupled_my_net_worth_with_cryptoand_why.json": "I’m actually fairly new to this sub but I’ve been interested in crypto since the\n2017 Bitcoin bubble, which is when I first started to hear about cryptocurrency.\nI was also a broke high school kid back then—so I really couldn’t have invested\neven if I wanted to.\n\n3 years go by.\n\nI’ve been studying…",
  "data/reddit-crypto/r/CryptoCurrency/comments/ku2q5e/daily_discussion_january_10_2021_gmt0.json": "Welcome to the Daily Discussion. Please read the disclaimer, guidelines, and\nrules before participating.\n\n--------------------------------------------------------------------------------\n\n\n\n\n\nDISCLAIMER:\n\nThough karma rules still apply, moderation is less stringent on this thread than\non the rest of…",
  "data/reddit-crypto/r/CryptoCurrency/comments/kul295/what_are_your_top_3_coins_for_the_next_35_years.json": "Which ones do you think will keep increasing both in value and worldwide\nusage/acceptance and why? I have BTC, ETH and ADA that I’m investing heavily in\n. Let’s hear yours\n\nMy top 3 (From most invested to least):\n\n 1. ETH\n\n 2. BTC\n\n 3. ADA",
  "data/reddit-crypto/r/CryptoCurrency/comments/kulxyd/just_a_reminder_nobody_knows_anything.json": "I been in this game since 2017 and the red wedding that followed. Trust me when\nI say nobody knows anything in this space. Its easy to see a bunch of\nconfirmation bias and an echo chamber of feel good sentiment about the future\nbut nobody knows what the hell they are talking about. Everyone is just…",
  "data/reddit-crypto/r/CryptoCurrency/comments/kuqhgu/daily_discussion_january_11_2021_gmt0.json": "Welcome to the Daily Discussion. Please read the disclaimer, guidelines, and\nrules before participating.\n\n--------------------------------------------------------------------------------\n\n\n\n\n\nDISCLAIMER:\n\nThough karma rules still apply, moderation is less stringent on this thread than\non the rest of…",
  "data/reddit-crypto/r/CryptoCurrency/comments/kus56c/here_is_your_dip_when_you_look_back_after_btc.json": "For everyone who sat on the sides saying bitcoin was hovering at 9-10k or was\nwaiting for a pullback when it hit 20k, here is your dip. It went 20% down and\nis already recovering.\n\nIt can dip further or it can rocket to 50k but don't say you didn't have a\nchance to buy when it hits 100k.",
  "data/reddit-crypto/r/CryptoCurrency/comments/kuumjy/psa_you_can_use_me_as_your_top_indicator.json": "I have bought the top so many times it's a skill. I have tested this with dozens\nand dozens of buys. The result is always the same. Immediate collapse, generally\nfollowed by 12-18h (just long enough for me to self-loath) of downward trends.\nFriends contact me asking if its over, I tell them I…",
  "data/reddit-crypto/r/CryptoCurrency/comments/kuvpyk/this_isnt_a_dip_its_a_giant_liquidity_suck.json": "tl;dr version: The dips are market manipulations by institutional players. Don't\npanic sell, and think carefully about where you set your stop-losses at least\nuntil the $100K mark.\n\nSo I keep seeing people compare this bullrun to 2013 or 2017. But they're wrong.\nUnlike the inherently speculative…",
  "data/reddit-crypto/r/CryptoCurrency/comments/kuw5r8/people_want_dips_then_have_a_panic_attack_when_it.json": "It's funny how people say they can't wait til the next dip so that they can\naccumulate more, and then once there's a dip they start having an aneurysm.\nRelax. Crypto basically comes with a disclaimer of volatility. Panic won't get\nyou anywhere. Especially for hodlers, this is a discount, not…",
  "data/reddit-crypto/r/CryptoCurrency/comments/kv00bu/this_dip_is_not_real_and_this_isnt_really.json": "I didn't sell at 40,000+ and I wasn't wrong for making that decision, this is\nsomeone's manipulation and they are causing this to happen.\n\nPossible condidates for my theory.\n\n * JP Morgan\n * Instichooshans\n * Elon Musk\n * China\n * all of them together\n\nI have concluded through my fibonachi technics…",
  "data/reddit-crypto/r/CryptoCurrency/comments/kv1zjb/last_time_bitcoin_had_its_first_retrace_after.json": "Febuary 17th 2017, Bitcoin had its first dump after breaking its previous ATH.\n\nhttps://preview.redd.it/8290ar468pa61.png?width=1848&format=png&auto=webp&s=e9a740a6a15d8135f4d7b860b71c164d953152cf\n\nWhat followed was perhaps the biggest alt season of all time in terms of\npercentage of total market…",
  "data/reddit-crypto/r/CryptoCurrency/comments/kv3buj/i_bought_1k_of_the_top_10_cryptos_on_january_1st.json": "EXPERIMENT - Tracking 2019 Top Ten Cryptocurrencies – THREE YEAR REPORT - Down\n-49%\n[https://preview.redd.it/vndx66w0ipa61.png?width=666&format=png&auto=webp&s=212832bbf8764c6de0c5c63c89f5f0d359bce57e]\n\nThe full blog post with all the tables is here\n[https://toptencryptoindexfund.com/tracking-2018…",
  "data/reddit-crypto/r/CryptoCurrency/comments/kv54gn/the_number_of_addresses_holding_1000_bitcoin_just.json": "Dips are temporary, but gains will be huge\n\nThe number of whales is increasing with every dip indicates the market have many\nloose hands who get panic with small…",
  "data/reddit-crypto/r/CryptoCurrency/comments/kv6kda/very_unpopular_opinion_do_not_listen_to_people.json": "All right folks for those of us who bought very cheap for a few thousands, \"last\nchance to buy at 30k\" can also very well be \"last chance to sell at 30k\".\n\nSo reality is -25% is nothing for a bitcoin correction so if you believe you\nwant to sell part of your portfolio to rebuy cheaper, just do it,…",
  "data/reddit-crypto/r/CryptoCurrency/comments/kv9gte/is_it_just_me_or_are_there_like_50_posts_telling.json": "There seems to be an assumption that every dip is people panick selling and\ngiving up on crypto, when in reality it's mostly just traders taking advantage\nof the opportunity to sell and buy more at a lower price point.",
  "data/reddit-crypto/r/CryptoCurrency/comments/kvkh9a/my_family_members_who_know_nothing_about_crypto.json": "How many of you have people who have no knowledge on crypto, trying to tell you\nhow to invest in it?\n\nI understand some people may think they are protecting you, but them telling me\nhow to invest because they saw one spooky yahoo finance article, makes them\nsound dumb😂\n\n📈HODL on yall! Hope this…",
  "data/reddit-crypto/r/CryptoCurrency/comments/kvp7lv/the_upcoming_bull_season_will_make_the_previous.json": "Comparing Current volume from 2017-18 Bullrun, crypto volumes gained massive\nspikes while the marketcap isn't much bigger.\n\n7 Jan 2018 was the peak moment of the previous Bull season when\n\nMC: $852 billion, Volume: $30 billion only\n\nCurrent Scenario: MC: MC: $978 billion, Volume: $238 billion\n\nThere…",
  "data/reddit-crypto/r/CryptoCurrency/comments/kvre5l/what_is_ethereum_why_is_ethereum_how_is_ethereum.json": "For those that want a crash course on ETH and want to know why so many of us\npurchase it and use it, here is the most beginner-friendly explanation I could\ncome up with.\n\n\nWHAT IS ETHEREUM?\n\nIn short, Ethereum is a global, open-source platform for decentralized\napplications. On Ethereum, you can…",
  "data/reddit-crypto/r/CryptoCurrency/comments/kvs4rc/last_month_ive_paid_an_83k_debt_thanks_to_crypto.json": "I started investing in crypto in 2017 with only a few thousand bucks and a debt\nthat would take about 10 years to be settled. At the time, I couldn't imagine\nhow to get out of this situation and decided to go all in into crypto.\n\nThanks to A LOT OF WORK obviously, a few successful trades, airdrops…",
  "data/reddit-crypto/r/CryptoCurrency/comments/kvw21p/unpopular_opinion_you_can_store_your_coins_on_an.json": "Edit (since I wasn’t expecting many to actually read this): you can store your\ncoins on an exchange when investing / with the intent to sooner or later flip\nfor fiat gain. If you’re buying crypto to get away from centralized control over\nand custody of your finances, movements, and life you…",
  "data/reddit-crypto/r/CryptoCurrency/comments/kw22uk/why_you_shouldnt_be_sleeping_on_litecoin.json": "So it's quite obvious the majority of the market is sleeping on Litecoin, here's\nwhy you shouldn't. I've also noticed several people trashing Litecoin and asking\nwhy people hold it, so here's my answer.\n\nInflation & store of value - I think we can all agree this bull run is fueled by\ninflation in…",
  "data/reddit-crypto/r/CryptoCurrency/comments/kw47e1/daily_discussion_january_13_2021_gmt0.json": "Welcome to the Daily Discussion. Please read the disclaimer, guidelines, and\nrules before participating.\n\n--------------------------------------------------------------------------------\n\n\n\n\n\nDISCLAIMER:\n\nThough karma rules still apply, moderation is less stringent on this thread than\non the rest of…",
  "data/reddit-crypto/r/CryptoCurrency/comments/kwa4ln/protip_99_of_your_questions_about_a_specific.json": "I see it everyday, all day, across many forums. Newbies and vets alike show up\nwith a question that has an easy answer, most of the time it’s on the website\nfor that project.\n\nIf you find yourself struggling to understand something, do yourself a favor and\ngoto the website of the currency you’re…",
  "data/reddit-crypto/r/CryptoCurrency/comments/kwcsqt/tell_us_your_story_on_how_you_got_rekt_in_crypto.json": "The opposite of a flex and a shill.\n\nA lesson for the less wise and the new.\n\nTalk bout mistakes you made, so others don't have to walk the path of crypto\ndestruction.\n\nI feel everyone talks about their wins, but let's create a thread where people\nhave talked about there losses and what they have…",
  "data/reddit-crypto/r/CryptoCurrency/comments/kweggy/what_are_reddit_moons_why_are_reddit_moons_how.json": "If you think our Moons are just incentivizing spam and turning our front page\ninto a dumpster fire you are probably right... For now...\n\n\nWHAT ARE REDDIT MOONS?\n\nEven though our Moons don't look and feel like a real currency there is a lot\nmore to them than meets the eye. By definition, Reddit Moons…",
  "data/reddit-crypto/r/CryptoCurrency/comments/kwhjxa/why_hex_is_a_ponzi_and_not_a_solid_investment.json": "> In the first episode\n> [https://www.reddit.com/r/CryptoCurrency/comments/kqagf7/why_hex_is_a_ponzi_and_not_a_solid_investment/?utm_source=share&utm_medium=web2x&context=3]\n> about HEX I focussed on the tokenomics and the advertisement campaigns behind\n> HEX. After Richard Heart himself decided to…",
  "data/reddit-crypto/r/CryptoCurrency/comments/kwite8/try_to_avoid_hodlers_bias_its_helpful_to_look_at.json": "For exanple: Your Moons are currently worth $100. If someone gave you $100 to\ninvest in any cryptocurrency you want, would you buy $100 of Moons? If not, why\nare you still holding them?\n\nIt's easy to hold onto a coin simply because we already have it, but it's not a\nrational investment…",
  "data/reddit-crypto/r/CryptoCurrency/comments/kwk2ot/how_i_turned_1k_into_300k_in_2017s_bull_market.json": "First, English is my second language so please forgive my poorly organized,\nhorribly formatted and super long story. Also I never shared this story before\nand wasn't really planning to, but I told it to one of my now close friend who\nis a crypto nerd like me and he said it was inspiring and that I…",
  "data/reddit-crypto/r/CryptoCurrency/comments/kwtjhw/daily_discussion_january_14_2021_gmt0.json": "Welcome to the Daily Discussion. Please read the disclaimer, guidelines, and\nrules before participating.\n\n--------------------------------------------------------------------------------\n\n\n\n\n\nDISCLAIMER:\n\nThough karma rules still apply, moderation is less stringent on this thread than\non the rest of…",
  "data/reddit-crypto/r/CryptoCurrency/comments/kwvmfs/whats_up_with_stellar_xlm.json": "Every now and then, I see some people asking, ”What’s up with XLM?”\n\nSo I have written this for educational purposes.\n\nDid you know the MOST RECENT NEWS just published a few hours ago about Stellar?\n\n\nAN EU COMPANY JUST LAUNCHED A €20 MILLION…",
  "data/reddit-crypto/r/CryptoCurrency/comments/kx45hq/what_is_dogecoin_why_is_dogecoin_how_is_dogecoin.json": "Even though you probably won't admit it, you are secretly holding thousands of\nDoge hoping that one day it will hit $1 and make your dreams come true.\n\n\nWHAT IS DOGECOIN?\n\nDogecoin was co-founded by IBM software engineer Billy Markus and Adobe software\nengineer Jackson Palmer, who set out to create…",
  "data/reddit-crypto/r/CryptoCurrency/comments/kxf4ej/psa_on_coinbase_etc_is_still_trading_more_than_20.json": "WHAT IS ARBITRAGE?\n\nArbitrage is profiting from the price imperfections between several pairs on a\ngiven exchange, or between different exchanges. It is the only reason prices\neven stay close to each other from one exchange to the other to begin with: a\nmultitude of bots are developed to profit from…",
  "data/reddit-crypto/r/CryptoCurrency/comments/kxi1pl/the_1200_us_stimulus_payment_invested_in_bitcoin.json": "If the recipient of a U.S. stimulus payment in April invested the check into\nBitcoin, the check would now be worth $6,495.\n\nSince April, in merely nine months, the price of Bitcoin has rallied 441%,\nposting one of its strongest rallies in recent history.\n\nhttps://cryptoslate.com/the-1200-u-s…",
  "data/reddit-crypto/r/CryptoCurrency/comments/kxi9m6/daily_discussion_january_15_2021_gmt0.json": "Welcome to the Daily Discussion. Please read the disclaimer, guidelines, and\nrules before participating.\n\n--------------------------------------------------------------------------------\n\n\n\n\n\nDISCLAIMER:\n\nThough karma rules still apply, moderation is less stringent on this thread than\non the rest of…",
  "data/reddit-crypto/r/CryptoCurrency/comments/kxs9er/itinerary_of_a_crypto_idiot.json": "There are lots of success stories around here, and sometimes an \"how did you get\nrekt?\" thread. But have you consistently been so bad at crypto that it made you\nlaugh out loud and call yourself a dummy? So I thought it'd be cathartic to go\ndown memory lane and write down my painful crypto story,…",
  "data/reddit-crypto/r/CryptoCurrency/comments/kyljqv/polkadot_is_worth_16_billion_in_market_cap_when.json": "Call me a maxi but Ethereum has been consistently running at a volume of 850 +\ntransactions every minute for the last 6 months.\n\nhttps://etherscan.io/chart/tx\n\n\n\nMeanwhie Polkadot has 6 transactions on it's network every minute and thats only\nin the last few days when transaction volume has…",
  "data/reddit-crypto/r/CryptoCurrency/comments/kymgd6/i_was_able_to_trace_and_identify_the_french.json": "Did anyone see the recent Chainalysis report about this? They did a great job of\ntracking funds from one wallet to over a dozen far-right groups including French\nneo-nazis, Daily Stormer, VDARE, and more. $250,000 went to Nick Fuentes who\nthen appeared at Capitol Hill weeks later.\n\nI took the…",
  "data/reddit-crypto/r/CryptoCurrency/comments/kzf8m3/usgovt_declares_all_privacy_coins_legal_for.json": "https://www.occ.gov/news-issuances/news-releases/2021/nr-occ-2021-2a.pdf\n\nTLDR:\n\n> National banks and Federal savings associations (collectively referred to as\n> \"banks\") may use new technologies, including INVNs and related stablecoins, to\n> perform bank-permissible functions\n> \n> ...…",
  "data/reddit-crypto/r/CryptoCurrency/comments/kzicgl/daily_discussion_january_18_2021_gmt0.json": "Welcome to the Daily Discussion. Please read the disclaimer, guidelines, and\nrules before participating.\n\n--------------------------------------------------------------------------------\n\n\n\n\n\nDISCLAIMER:\n\nThough karma rules still apply, moderation is less stringent on this thread than\non the rest of…",
  "data/reddit-crypto/r/CryptoCurrency/comments/kzkdw4/a_break_down_of_the_bull_case_for_ethereum_and.json": "There is a general understanding among ETH investors that the enhancements from\nETH 2.0, EIP-1559 and L2 solutions will result in a sustainable monetary policy\nwith near 0% issuance and the potential to for Ether to become a deflationary\nasset. What is even more interesting is that the net return of…",
  "data/reddit-crypto/r/CryptoCurrency/comments/kzmguv/bitcoin_will_hit_50k_by_end_of_jan_i_can.json": "Etoro and a bunch of exchanges are running out of coins.\n\nGreyscale and other institutions are gobbling it up by the day.\n\nPayPal will go crazy in Europe.\n\nBut the absolute biggest bull flag is...I have to sell part of my stash this\nweek. BTC is guaranteed to moon right after I sell.\n\nYou're all…",
  "data/reddit-crypto/r/CryptoCurrency/comments/l041do/reminder_to_go_to_the_new_and_rising_and.json": "Title says much of it. By going to the other sections, rather than merely \"Hot\"\nor \"Top,\" you'll be able to gather and glean more information for your decision\nmaking.\n\nYou may be surprised what you come across; many of interesting posts and topics\nare unduly \"buried\" for a variety of different…",
  "data/reddit-crypto/r/CryptoCurrency/comments/l04yee/grayscale_crypto_accumulation_1801_16244_btc_5566.json": "Grayscale has made a big entry to the week (they don't buy on weekends).\n\n\n\n18/01 accumulation\n[https://preview.redd.it/z0nip4hvx5c61.png?width=1400&format=png&auto=webp&s=3bd52f7e499b2a53ba2434125fce5fc011f5a555]\n\n\n\n-Big BTC buy, highest we have seen in a while.\n\n-ETH exposure consistently being…",
  "data/reddit-crypto/r/CryptoCurrency/comments/l0aqt0/message_encoded_in_block_666666.json": "As in the case of the genesis block\n[https://medium.com/splytcore/simple-decryption-of-satoshi-nakamotos-hidden-message-in-the-blockchain-42b5fe9b3c72]\nand the halving block mined last year\n[https://www.forbes.com/sites/colinharper/2020/05/11/bitcoins-halving-block-includes-a-message-to-remind-us…",
  "data/reddit-crypto/r/CryptoCurrency/comments/l0fi0h/fees_make_crypto_look_delusional.json": "This might be a bit of a rant but seriously wtf are we doing here? These fees\nare no different to repeatedly punching yourself in the balls and wondering why\nno one else wants to do the same! Anyone who thinks crypto is going to be used\nas a form of payment and mass adopted are living in their own…",
  "data/reddit-crypto/r/CryptoCurrency/comments/l0h6es/i_finally_got_an_apartment_thanks_to_bitcoin.json": "All these while, I've stayed with a relative, and always dreamed of saving up\nenough to rent an apartment of my own.\n\nI learned about Bitcoin in early 2018 and started buy small pennies all on the\nway down to that $3200 bottom that year.\n\nI sold almost all when the market rebounded in 2019 to around…",
  "data/reddit-crypto/r/CryptoCurrency/comments/l0i7rc/youre_welcome_guys.json": "I sold all my eths ( a good chunk) at 1002 because the price was stalling too\nmuch and wanted to convert it to BTC.\n\nWell fuck me because ETH fucking decided to moon the millisecond I pressed sold\nso you guys can thank me and fuck you Bogdanoff.\n\nEdit: I bought back in",
  "data/reddit-crypto/r/CryptoCurrency/comments/l0poi3/bought_my_first_eth_at_2_finally_fully_out_of_the.json": "I sold out my remaining crypto last night. Still feels surreal to me. Started\nbuying Ethereum at just above $2 in early 2016 after missing the boat on\nBitcoin. I put my whole tax return in in 2016 and threw a couple hundred at it\nwhenever I could. I didn't buy a car and biked to work to save money.…",
  "data/reddit-crypto/r/CryptoCurrency/comments/l180yr/too_many_people_are_looking_to_trade_i_want_to.json": "I have a crappy (but I'm trying) youtube channel focusing on introducing people\nto passive earning in cryptocurrency.\n\nCurrently I am doing a series of videos on using the products in Binance Earn.\nBut I have videos on Bitfinex, Bitmex and Defi as well.\n\nThe videos are fairly short and basic stuff,…",
  "data/reddit-crypto/r/CryptoCurrency/comments/l1du35/my_64_year_old_dads_analysis_of_why_i_shouldnt.json": "\"You know, the Russians are eventually going to hack the four-chain through a\nback door that nobody knows about.\"\n\nI immediately went home to put another $500 in in various cryptocurrencies. The\nonly thing he proved to me is that when his generation dies off, this shit is\ngoing to skyrocket.",
  "data/reddit-crypto/r/CryptoCurrency/comments/l1f95d/i_also_sold_after_8x_profit_not_a_success_story.json": "Unfortunately I sold not because I wanted to but because I needed. My wife had a\nmiscarriage on the 4th month of pregnancy. The baby had down syndrome and died\nof a heart attack.\n\nIt's not a success story like the others I have seen lately but that's what I\ngot. The procedure itself had a lot of…",
  "data/reddit-crypto/r/CryptoCurrency/comments/l1w4vz/rwallstreetbets_taught_me_about_personal_risk.json": "I'm gonna min/max this shit with 100x leverage and stick my balls in the hard\ndrive as collateral\n\nAny and all corrections only make me more committed to the masochistic shit\nstorm that is crypto. I genuinely can't get enough of this volatility, there's\nso much volatility that people are having…",
  "data/reddit-crypto/r/CryptoCurrency/comments/l1yjzw/proposal_to_significantly_decrease_moon_earned.json": "''I wish I had kept my 1,700 BTC at $0.06 instead of selling them at $0.30, now\nthat they're $8,00!''\n\nWe probably all know what meme/comedy post I'm talking about, because it gets\nreposted every memeweekend. People are waiting till memes are allowed again, and\nreach the top getting thousands of…",
  "data/reddit-crypto/r/CryptoCurrency/comments/l1zp60/exclude_bots_in_moon_distribution.json": "In the latest distribution, one bot earned 14612 karma u/coinfeeds-bot\n[/u/coinfeeds-bot] that rank 4th on the list.\n\nImo Moon is community rewards that should only be given to real users who are\nengaging here not any kind of bot, that bot simply summarizes the linked article\nby copy-pasting some…",
  "data/reddit-crypto/r/CryptoCurrency/comments/l1zrv0/moons_are_a_complete_scam_change_my_mind.json": "If Reddit Incorporated™ wanted to create a new way of allowing empowering users\nto govern the rules of subreddits, they would have created this system within\nthe parameters of reddit.com [https://reddit.com/] like they have with every\nother aspect of this website. An erc20 shitcoin wasn't…",
  "data/reddit-crypto/r/CryptoCurrency/comments/l228iv/double_spending_fud_is_already_debunked_by.json": "https://twitter.com/aantonop/status/1352258125932371968\n\nI'm sick and tired of FUD news having such a big effect on our markets, everyone\nsays cryptocurrency is more volatile then traditional stocks,\n\nTHATS NOT BECAUSE OF SOMETHING INHERENT TO THE MECHANISM OF CRYPTOCURRENCIES,\nITS BECAUSE BULLSHIT…",
  "data/reddit-crypto/r/CryptoCurrency/comments/l25b1n/limit_all_post_karma_to_1000_to_help_distribute.json": "Currently, if somebody makes a post that hits the very top of the sub, it is\nlikely to receive somewhere between 2000 to 8000 upvotes. This could be for\nanything from a link to a news article, or a reposted meme. Now, there's nothing\nwrong with that. People can upvote what they want, it's how reddit…",
  "data/reddit-crypto/r/CryptoCurrency/comments/l25lbx/psa_its_ok_the_bitcoin_whitepaper_can_be_taken.json": "The multi-sig transaction it's stored in:\n54e48e5f5c656b26c3bca14a8c95aa583d07ebe84dde3b7dd4a78f4e4186e713\n[https://blockchair.com/bitcoin/transaction/54e48e5f5c656b26c3bca14a8c95aa583d07ebe84dde3b7dd4a78f4e4186e713?_type=transaction]\n\nThe way you can decode…",
  "data/reddit-crypto/r/CryptoCurrency/comments/l2b0hc/dont_check_your_portfolio_and_prices_every_5.json": "The title says it all.\n\nMany of us have been in the same situation in 2017 as the one we are in now.\nFour years ago I was checking prices every 5 minutes, imagining and calculating\nhow big my future imaginary gains would be. Some nights when prices skyrocketed\nI literally couldn't sleep properly.…",
  "data/reddit-crypto/r/CryptoCurrency/comments/l2bki7/you_got_99_shitcoins_son_but_xlm_aint_one.json": "Just in from the latest Stellar Quarter Report\n[https://resources.stellar.org/hubfs/Q4%202020_%20Quarterly%20Report.pdf]\n\n> SDF’s Business Development team saw significant traction in bringing more\n> anchors onto the Stellar network in Q4. Perahub , a majority owned subsidiary\n> of the Union Bank of…",
  "data/reddit-crypto/r/CryptoCurrency/comments/l48r2w/mrbeast_just_announced_in_his_livestream_that_he.json": "In MrBeasts livestream he announced that people can send images to the moon for\n10 dollars. He then stated that he will take that money and buy bitcoin with it\n(total 1 million usd) and he will put it on a flash drive and send it to the\nmoon. Check out shopmrbeast.com/moon for more info and he is…",
  "data/reddit-crypto/r/CryptoCurrency/comments/l4bo67/eth_breaks_ath_of_1440.json": "Congratulations to all that have held since the beginning, congratulations to\nall that have accumulated since 2017, congratulations to all the ones that just\nbought last night. You all have helped ETH reach a new all time high. This is a\ngreat moment in crypto. Congratulations 🍾",
  "data/reddit-crypto/r/CryptoCurrency/comments/l4q1qu/in_a_filing_this_morning_with_the_sec_rothschild.json": "https://www.sec.gov/edgar/search/#/q=bitcoin&dateRange=custom&entityName=Rothschild&startdt=2021-01-25&enddt=2021-01-25",
  "data/reddit-crypto/r/CryptoCurrency/comments/l4u8mx/what_do_you_guys_think_about_cardano.json": "Hello,\n\nI am wondering what you guys think about Cardano (ADA)? Currently trading at\n~$0.35 with a market cap of $10,991,593,084, Cardano is created by one of the\nETH co-founders and aims to do everything ETH does but more.\n\n$10,000 investment in Cardano right now; what do you think, good or bad? I…",
  "data/reddit-crypto/r/CryptoCurrency/comments/l51b8p/young_no_dependants_now_is_your_time.json": "I am about to turn 40 years old. I have a wife and 4 kids. I can't take huge\nchances with my finances anymore. If you don't have people that rely on your\nincome now is your chance. Invest in what you believe in. Don't be afraid to\ntake chances, but also take some profits along the way. Bitcoin and…",
  "data/reddit-crypto/r/CryptoCurrency/comments/l55lgm/world_meet_bitcoin_a_cool_video_of_the_first_ever.json": "This card is just the first step. It proves that Bitcoin can in fact be used in\nour day-to-day lives. This is just the tip of the iceberg. Bitcoin can disrupt\nthe whole financial stack.\n\nLet this be the moment that kicks off the start of a new era. An era in which we\nsee the full rollout of real…",
  "data/reddit-crypto/r/CryptoCurrency/comments/l5lx8f/proposal_to_create_and_pin_a_beginners_guide_to.json": "I continue to see the same posts over and over asking how to get started with\ncryptos.\n\nQuestions like: “I’m new to the crypto space”..\n\nWhere do I buy coins?\n\nWhat’s the process to get started?\n\nWhat are the best exchanges to buy, sell, trade?\n\nAre my coins safe?\n\nWhat’s the best security…",
  "data/reddit-crypto/r/CryptoCurrency/comments/l631oq/im_a_crypto_tax_attorney_ama_today_jan_27.json": "Hi Reddit, I'm Andrew Gordon, a tax attorney & CPA who's been practicing\ncryptocurrency tax law since 2014. I help investors with their tax returns,\naudit representation, and tax debt resolution, as well as helping businesses\nadopt and report crypto. \n\nYou may have seen or heard that the 2020 tax…",
  "data/reddit-crypto/r/CryptoCurrency/comments/l63ny9/im_no_millionaire_but_anyone_else_ever_get_a.json": "I’ll be reading discussions and considering my investments then you’ll see lots\nof comments like “I’ve got a spare $100 to throw at something, shill me” and so\nI suddenly realise that a lot of what gets posted is from people with very\nlittle skin in the game. I know it’s all relative and I am not…",
  "data/reddit-crypto/r/CryptoCurrency/comments/l64mpu/honest_question_why_cant_the_crypto_community.json": "Watching the guys/gals over at WSB take down Melvin capital this week was like\nwatching the prisoners take over the jail and feed the corrupt warden a big F\nyou sandwitch.\n\nTheir community seems so much tighter than ours, and I couldn’t help but wonder\nwhy?\n\nWhy does it seem so fractured here? They…",
  "data/reddit-crypto/r/CryptoCurrency/comments/l6fuhz/ethereum_foundation_and_reddit_partnership_is_the.json": "AS WE ALL KNOW BY NOW ETHEREUM FOUNDATION AND REDDIT ANNOUNCED PARTNERSHIP!\n\nIn my Opinion this announcement is the Biggest adoption news I have ever seen,\nill explain why:\n\n\n\nBy brining \"Community points\" to more reddit subs people can learn more about\ncrypto from an inner drive, Finally crypto…",
  "data/reddit-crypto/r/CryptoCurrency/comments/l6fy08/everybody_says_buy_the_dip_but_cant_find_the_dip.json": "I’m pretty new at this space looking for a coin or token that can make me rich\nwith only U$ 100. I’ve answered a lot of quizzes at Coinbase and now I’m ready\nto build my future and buy my lambo.\n\nBut I am facing a huge problem. Almost everyday People is saying “Buy the dip”.\nI think that The Dip is…",
  "data/reddit-crypto/r/CryptoCurrency/comments/l6jl6f/wallstreetbets_set_to_private_but_we_still.json": "It's important to acknowledge the common fight we have with crypto/short squeeze\nand stand up for the censorship. Reddit censorship should never be allowed\nunless it's illegal which the subreddit didn't violate anything. Cheers to\neveryone fighting the good fight and going to the moon!",
  "data/reddit-crypto/r/CryptoCurrency/comments/l6mv1e/we_need_to_band_together_like_wsb_its_us_vs_all.json": "We might not have a chance to take down a giant hedge fund but now is our chance\nto take back some control over finance.\n\nDont leverage up 1000X\n\nDont invest your lifesavings into some scam coin\n\nBuy BTC and ETH and let's make these the best investment of this new decade.\n\nAs long as they're still…",
  "data/reddit-crypto/r/CryptoCurrency/comments/l6p74d/dogecoin_is_the_next_gmebitcoin.json": "WSB did it and so can we! Even if we can get Dogecoin to $1 a coin it would be\nan incredible achievement. All we have to do is work together like the retards\nat WSB and buy into dogecoin. It’ll completely change the crypto market and draw\na lot more attention to it! Let’s do it, Dogecoin to…",
  "data/reddit-crypto/r/CryptoCurrency/comments/l6smsk/stop_posting_gme_go_to_wsb_or_other_channels.json": "It start to get difficult here to find crypto related posts or discussion. My\nfrontpage is full of GME shit and propably yours too. Would we be so nice to\nkeep this subreddit clean and only crypto-related posts as it should be?\n\nBTC plz 🌝🚀",
  "data/reddit-crypto/r/CryptoCurrency/comments/l6uvkv/is_it_just_me_or_does_it_feel_like_2017_all_over.json": "Front page filled with Doge coin pumps, Elon musk tweets, Chinese New Year\nposts, huge crypto adoption news, people betting their body parts of Bitcoin/ETH\nreach certain amounts, growing hatred of the 1%, grandparents asking for\ninvesting advice. We even have our own shitcoin now that’s pumping like…",
  "data/reddit-crypto/r/CryptoCurrency/comments/l6wv0u/wall_street_has_decided_youre_not_responsible.json": "For years, the crypto community has pointed to government control over fiat\nmoney as the reason Bitcoin needs to exist. People need an asset that they know\ncan't be arbitrarily printed or controlled by corrupt governments.\n\nAnd after 12 years, this narrative is taking hold. The financial industry…",
  "data/reddit-crypto/r/CryptoCurrency/comments/l6y3n8/gme_is_making_a_strong_case_for_cryptocurrency.json": "Forget about centralized institutions that we have right now. The GME case just\nproves how the regulation will intrinsically acts on behalf of the privileged in\nthe name of market order, which is allowing big players to milk the market but\nturning against anyone else who tries to play the same…",
  "data/reddit-crypto/r/CryptoCurrency/comments/l6zeh7/coinbase_might_be_an_idiot_but_atleast_its_our.json": "After seeing what is happening with Robinhood and revolut after people started\nbuying GME stocks, I cant believe Im saying it but think i have a new found\nrespect for Coinbase and Binance.\n\nYes coinbase has its problems, yes it does go down in times of high activity.\nBut atleast they havent ever put…",
  "data/reddit-crypto/r/CryptoCurrency/comments/l70sv9/days_like_today_are_absolute_proof_that.json": "I'm sure the majority of you are following the chaotic wall street market as our\ndear friends over at /wallstreetbets are making history.\n\nSo you are also probably following the headlines as Robinhood and other trading\nplatforms are now restricting the purchases of certain stocks and…",
  "data/reddit-crypto/r/CryptoCurrency/comments/l70zsp/tweet_of_the_decade_wsb_chairman_they_can_only.json": "A few hours ago Chairman from the r/wallstreetbets [/r/wallstreetbets] tweeted\n'They can only control us because we use their currency'. This happens only\nhours after Robinhood, TD Ameritrade, and other schmucks blatantly restrict and\ntank GME, AMC and NOK trading (selling restricted only after the…",
  "data/reddit-crypto/r/CryptoCurrency/comments/l77l7k/for_the_love_of_fk_can_we_get_a_pinned_post.json": "With everything thats going on with wsb and GME, we are getting an influx of\nnewbies and day traders on the sub trying to pump coins (DOGE etc) in the vain\nhopes that it will emulate what happened there.\n\nTHAT CANNOT HAPPEN!!!!\n\nPump and Dumps have been riff in the crypto world for a long time due…",
  "data/reddit-crypto/r/CryptoCurrency/comments/l7e4qx/with_all_of_this_gme_stuff_going_on_i_think_our.json": "This is absolutely the best example of why the world needs cryptocurrency. Rich\nassholes squeezing every penny out of everyone they can and when the shoe is on\nthe other foot and a small chunk of their huge fortunes are taken, they complain\nand get taken care of.\n\nWhere is all these rules when the…",
  "data/reddit-crypto/r/CryptoCurrency/comments/l7ej42/robinhood_will_ruin_you_if_you_own_cryptos_or.json": "There may never be a truer example of not your keys, not your coin.\n\nRobinhood, which is literally named after a character fighting for the people,\nhalted customers from buying GME shares but would let them sell it.\n\nThey also forced people who are leveraged into liquidating their accounts.\n\nThey…",
  "data/reddit-crypto/r/CryptoCurrency/comments/l7fhu9/right_now_there_are_3x_the_usual_people_browsing.json": "TO THE REGULARS THAT BROWSE THIS SUBREDDIT BE NICE\n[https://np.reddit.com/r/CryptoCurrency/comments/juyp9w/unpopular_opinion_gatekeeping_is/]\nTO THE NEWCOMERS.\n\nIf you live in America, This is how to keep your crypto…",
  "data/reddit-crypto/r/CryptoCurrency/comments/l7g20e/do_not_buy_crypto_from_robinhood_ever.json": "I placed a buy order for $100 for DOGE. I waited and waited and waited. It did\nnot fulfill the order, and DOGE went up. I canceled the order, and it gave a\npopup at the bottom saying order canceled [https://i.imgur.com/gM1OvFt.png].\nYet, it still showed as pending in the app. So I tried again. And…",
  "data/reddit-crypto/r/CryptoCurrency/comments/l7g9ib/the_bull_case_for_nano_the_future_of.json": "The Basics of NANO\n\nNANO's entire purpose is to be the most efficient currency possible. It is\ninstant, feeless, and decentralized. NANO uses a unique type of blockchain\ncalled a block lattice, where each account is its own blockchain. This is what\nallows it to be so efficient.\n\nNANO vs. Fiat…",
  "data/reddit-crypto/r/CryptoCurrency/comments/l7ke1f/psa_for_new_dogecoin_crypto_buyers.json": "Some points to newcomers after reading some frightening comments over in\nr/dogecoin [/r/dogecoin]:\n\n·If you don't hold the keys to the crypto, you don't own the crypto. If you\ncan't even withdraw the crypto, you definitely don't own the crypto. RH doesn't\nsell crypto, period. They sell supposed…",
  "data/reddit-crypto/r/CryptoCurrency/comments/l7lllf/yes_decentralization_and_freedom_are_amazing_but.json": "It's been a tough day, and we're grateful to you for being a r/CryptoCurrency\n[/r/CryptoCurrency] subscriber.\n\nCryptocurrencies are open and permissionless. That's kinda the whole point. You\ncan send money to anyone, anytime. You can trade on centralized platforms or\ndirectly peer-to-peer. It's…",
  "data/reddit-crypto/r/CryptoCurrency/comments/l7qmbi/if_a_single_trading_entity_like_robinhood_can.json": "Many cryptocurrencies are decentralized, meaning they are not controlled by one\nentity, unlike a company such as Visa. The tokens are often limited, and since\nthere's no big CEO at the top controlling our ability to transfer our wealth,\nthe only person that can decide how it's used is you.\n\nAnother…",
  "data/reddit-crypto/r/CryptoCurrency/comments/l7qwrv/we_shouldnt_celebrate_the_fact_that_musk_can.json": "I'm baffled how Musk is praised here because he changed his twitter bio.\n\nHe literally manipulates the market knowingly that his followers will pump the\nprices.\n\nBut he hides it behind memes so it's ok?\n\nHow is it good thing he can manipulate the price with a tweet? Imagine if he\ntweets \"bitcoin…",
  "data/reddit-crypto/r/CryptoCurrency/comments/l7rdwn/dont_pump_and_dump.json": "People, Crypto is all about a decentralized finance, fighting corruption and\ndeny power to third parties, non the less, now you're picking coins like\nr/wallstreetbets [/r/wallstreetbets] did with GME and other stocks. They're\nfighting hedge funds and other big institutions while you, by pumping…",
  "data/reddit-crypto/r/CryptoCurrency/comments/l7ww5l/theres_a_revolution_going_on_but_most_people_are.json": "I'm not talking about the Capitol riots or anything like that...\n\nI'm talking about:\n\nBitcoin, Ethereum, Dogecoin, Cardano, Polkadot, Nano, Zilliqa, Stellar,\nLitecoin, Chainlink, Yearn...\n\nGameStop, AMC, Blackberry, Bed Bath and Beyond...\n\nElon Musk, the Winklevoss twins, Ray Dalio, Russell…",
  "data/reddit-crypto/r/CryptoCurrency/comments/l7x3bi/to_all_the_new_folks_getting_into_crypto_do_not_i.json": "If you are buying on Robin Hood you do not control your coins and you cannot\ntransfer them to a wallet or to any other exchange.\n\nIn addition to this, trading is frequently halted due to volatility as we saw\nwith Dogecoin yesterday which in some cases means you won’t be able to sell on a\nmassive…",
  "data/reddit-crypto/r/CryptoCurrency/comments/l7y5ye/newcomers_listen_up.json": "I'm not going to make a big paragraph, just point to point facts.\n\nThe Basics :-\n\nFact 1 : This subreddit is a discussion forum for various CryptoCurrencies.\n\nFact 2 : This is NOT a PUMP and DUMP subreddit where we encourage users to buy a\ncoin showing various articles and ask them to FOMO in.\n\nFact…",
  "data/reddit-crypto/r/CryptoCurrency/comments/l85gqa/to_all_the_people_spreading_blatantly_false_info.json": "NO Doge is not like BTC\n\nThere is no limited supply. It was specifically intended to remain cheap to\nfacilitate FAST txns. Raising the price directly conflicts with this and will\nlikely result in an influx of new coins into circulation. THE SUPPLY IS NOT\nLIMITED, UNLIKE BTC.\n\n\n\nNO the situation with…",
  "data/reddit-crypto/r/CryptoCurrency/comments/l8dyq0/incredibly_sad_watching_new_users_throw_money_at.json": "Man, the missing the GME boat really got into some people's heads.\n\nCheck out the new posts on the Dogecoin subreddit. It's a mess of day old\naccounts who signed up for Voyager/Robinhood within the last 6 hours talking\nabout DiAmOnD hAnDs and retiring because Dogecoin will \"be bigger than…",
  "data/reddit-crypto/r/CryptoCurrency/comments/l8iyuz/firstever_zksnark_sapling_on_a_proof_of_stake.json": "As the title says, SHIELD protocol has been successfully activated on mainnet.\nPIVX is the first Proof of Stake cryptocurrency in the world that successfully\nimplemented and activated zero knowledge cryptography on mainnet. It took 11\nmonths from the first announcement (29th Feb 2020) till the final…",
  "data/reddit-crypto/r/CryptoCurrency/comments/l8qz04/a_sincere_message_to_all_new_people_whose_first.json": "The bad news is that many of you will have lost a solid amount of money by now\nbecause you fell right into a huge meme coin pump and dump.\n\nThe good news is that by doing so, many of you were introduced to\ncryptocurrencies long before most people will. You still belong to the early\nadopters. Learn…",
  "data/reddit-crypto/r/CryptoCurrency/comments/l8svbo/the_meltdown_i_to_denial_over_in_rdogecoin_is.json": "Look, I've held my share of Doge, LTC, ETH, and BTC.. but you've gotta be nuts\nto try and convince people to triple their investment because \"we all just got\npaid\" and \"we can make each other rich\". This is some normal WSB bullshit where\n99% of the group loses 90% of their value and the other 1%…",
  "data/reddit-crypto/r/CryptoCurrency/comments/l8ze8f/daily_discussion_january_31_2021_gmt0.json": "Welcome to the Daily Discussion. Please read the disclaimer, guidelines, and\nrules before participating.\n\n--------------------------------------------------------------------------------\n\n\n\n\n\nDISCLAIMER:\n\nThough karma rules still apply, moderation is less stringent on this thread than\non the rest of…",
  "data/reddit-crypto/r/CryptoCurrency/comments/l9368k/minimize_your_pump_and_dump_losses_in_one_simple.json": "What people need to realise is that when you become aware of a pump and dump IT\nIS TOO LATE TO BUY.\n\nThe way a successful pump and dump works is this:\n\n 1. A very small group of people decide to PnD a coin.\n\n 2. This group of people buy significant amounts of said coin, usually without\n    moving…",
  "data/reddit-crypto/r/CryptoCurrency/comments/l9dye7/i_sold_my_78k_moons_to_pay_off_my_debt_i_am_now.json": "My moons reached the exact amount of my debt and i couldn't resist to take this\nopportunity to become debt free. I can't believe it.. i am finally going to be\ndebt free... And it's all thanks to you guys here and r/CryptoCurrency\n[/r/CryptoCurrency]! Thank you so much everyone and good luck,…"
}