{
  "data/reddit-ask/r/TooAfraidToAsk/comments/shh2p2/does_anybodys_parents_charge_them_rent.json": "I'm in hs and I soon as I hit a job my mom started charging me rent, I only earn\nabout 600 a motnh during the school year.\n\nShe charges me $400, then I pay my own phone bill which is around $35 then I pay\nmy own gas for my car which is about $80 a month.\n\nMeaning I only save 85 a month, if…",
  "data/reddit-ask/r/NoStupidQuestions/comments/shh11p/did_anybody_parents_charge_them_rent.json": "I'm in hs and I soon as I hit a job my mom started charging me rent, I only earn\nabout 600 a motnh during the school year.\n\nShe charges me $400, then I pay my own phone bill which is around $35 then I pay\nmy own gas for my car which is about $80 a month.\n\nMeaning I only save 85 a month, if…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/shj5zj/completely_not_joking_am_i_the_only_person_who.json": "I’ve seen the news recently about Spotify and stuff... but I actually have no\nidea who he is at all!",
  "data/reddit-ask/r/TooAfraidToAsk/comments/shmt2m/how_much_do_you_feel_inside_your_vagina.json": "Are there any women out there besides me whose vaginas have numb walls? I can\nfeel my cervix when it's touched and my g-spot but not the rest. I can feel a\nsense of fullness when a thick dick is in me but that's it. No tingling\nsensations or however you want to describe the feeling. I cum just fine…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/shlkv2/how_is_wwii_taught_in_german_schools.json": "Title says it all. As an American, I’m genuinely curious.",
  "data/reddit-ask/r/AskWomen/comments/shmrnh/whats_something_that_people_think_is_a.json": "Title says it all.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/shpifr/what_do_girls_fantasize_about_while_masturbating.json": "recently a friend of mine told me she doesn't really imagine anything just does\nit like that.. i have hard time believing it but she doesn't really like men and\ni can kinda believe her.. is it like this only for her or mostly girls actually\ndo this with imagining scenarios or so?",
  "data/reddit-ask/r/askscience/comments/shnncq/to_what_extent_do_most_cultures_recognize_the.json": "Some cultures only have words for red, white, and black, while other cultures\nhave words for red, orange, yellow, etc.—does the same hold for emotions?\n\nPut another way: in primary schools, there are posters with cartoon faces\ncaricaturing important emotions, but would an analogous poster on the…",
  "data/reddit-ask/r/askscience/comments/shs145/covidflu_transmission_is_dont_touch_your_face.json": "Much of the public health messaging I see around COVID, Flu, and other common\nsicknesses emphasizes not touching your face with dirty hands. When I hear that,\nI hear \"don't touch your eyes, the inside of your nose, or your mouth\"/your\nmucous membranes. Is this right or is your cheek genuinely a…",
  "data/reddit-ask/r/NoStupidQuestions/comments/shws0a/is_the_us_just_stupidly_expensive_because_when.json": "I'm a student in Italy and I deliver pizza to make some bucks. My pay after tax\nis 7 € (7,9 $).\n\nI hear people complaining about 15$ an hour, maybe it's pre-tax or the US is\njust expensive af.\n\nBy living in italy my university expenses are really low, for an higher\neducation in a top 1% University…",
  "data/reddit-ask/r/AskHistorians/comments/shtqgl/the_1916_irish_proclamation_in_every_generation.json": "As above, the 1916 Proclamation invokes the 'rising in every generation' belief\nand claims 6 in the past 300 years. The 5 obvious ones seem the Confederate Wars\nof 1641, the United Irishmen of 1798, Robert Emmet in 1803, the Young Irelanders\nof 1848, the Fenians of 1867 (several of them are pushing…",
  "data/reddit-ask/r/NoStupidQuestions/comments/shxqhu/did_cavemen_know_to_pull_out.json": "A wet dark cave lit only by a fire. What else are you going to do in there than\nfuck? But would they know to pull out, when fucking for fun?",
  "data/reddit-ask/r/AskHistorians/comments/shyfjq/a_tweet_has_been_circulating_claiming_the_ussr.json": "In a few subreddits a screenshot has been posted saying that rents were capped\nat 4% of salary. This is generally used to contrast with rent costs in\npresent-day United States and other nations of the so-called \"Western Block\".\nWhile I can't find the original tweet, several others have made this…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/shsj0o/how_do_you_feel_like_you_are_a_certain_gender.json": "This has been a question that has been on my mind for quite some time so I'll\nguess I'll ask it here.\n\nHow does one \"feel\" as though they are male or female?\n\nMost humans have a sexual preference - e.g., straight, gay, bi etc. I get that.\nBut that doesn't necessarily change one's gender identity…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/si6k1t/should_i_feel_bad_because_i_genuinely_want_to.json": "I am a 16 years old male and I have always thought about having kids ever since\nI was young. I see so many people my generation talk about not wanting to have\nkids and it made me feel bad because I fell like the only one in my generation\nwho actually wants to have kids.\n\nOf course, I perfectly…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/shw3xx/why_is_it_that_muslims_calling_out_lgbt_people_is.json": "asking from personal experience. was nearly harassed by muslims for being part\nof LGBT and how it is bad. it was perfectly fine by them. and the other way\nround, by questioning their religion's values and ethics its Islamphobic.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/si5duy/is_it_bad_that_my_bf_says_this_during_sex.json": "I’m in my mid 20s and my bf is in his mid 30s. Sometimes during sex he’ll say “I\nlove fucking that tight young pussy” or something similar to it, and I could\ntell he gets off to that, and something about it makes me feel off. Should this\nbe something I should be concerned about? Or is it just…",
  "data/reddit-ask/r/AskWomen/comments/si5naw/women_who_thought_youd_lost_the_one_but_then.json": "Feeling a little heartbroken at the moment and need some hopeful stories.",
  "data/reddit-ask/r/NoStupidQuestions/comments/si85lj/i_got_fired_and_now_my_boss_is_withholding_my.json": "I got fired from my job two weeks ago. Long story. Now my boss who is also the\nowner of the business is telling me she won’t give me my last paycheck unless I\nsign some papers saying I quit. Obviously I don’t want to sign the papers\nbecause I want to collect unemployment and I didn’t quit. What can…",
  "data/reddit-ask/r/NoStupidQuestions/comments/sia77z/is_it_just_me_or_is_everyones_mental_health_at_an.json": "I have literally no motivation to get anything done rn. Not having a routine,\nnot meeting friends because of covid etc is really making me feel like I have\nnothing to live for. I seriously underestimated all the stuff I had going in my\nlife until now. Anyone else feeling the same?",
  "data/reddit-ask/r/AskHistorians/comments/shya88/do_we_have_evidence_of_how_humans_raised_babies.json": "All I hear nowadays is your baby should be eating solid foods by 6 months.. your\nbaby should be sitting up on their own by 8 months.. your newborn baby should be\nfed every 2-3 hours and sleep on their backs only.. etc But babies have somehow\nevolved from being strictly breastfed to, at some point,…",
  "data/reddit-ask/r/AskHistorians/comments/sibq2r/was_it_possible_to_prank_call_high_ranking_nazis.json": "I was just thinking, if you were in Nazi Germany in WWII, would it have been\npossible to make prank calls to members of the Reich government without being\ncaught? I mean, how would they ever realistically trace the call? Could I have\nphoned the Reich Chancellery in 1941, said something stupid like…",
  "data/reddit-ask/r/NoStupidQuestions/comments/si3knz/is_it_normal_to_not_be_able_to_eat_in_the_morning.json": "I have no appetite when I first wake up. Idk how people just wake up and eat a\nbig breakfast dude I have to be awake for a solid 2-3 hours before I can bring\nmyself to eat anything significant.\n\nI can wake up and drink water, juices, milk, etc. but not solid food for some\nreason. Don’t know why.",
  "data/reddit-ask/r/AskHistorians/comments/shu9yb/why_do_so_many_mid20th_century_american_recipes.json": "Spaghetti jello ring, jellied meatloaf, jello salad…Where did all these savory\njello recipes come from, and where did they go? Were there economic incentives\nto use gelatin as an ingredient? Was putting things in gelatin a novelty, or a\n“serious”/“normal” thing to do?",
  "data/reddit-ask/r/AskHistorians/comments/shyblu/what_is_the_historical_basis_for_why_most.json": "The Jewish high holidays (Yom Kippur, Rosh Hashanah) are expressly referenced in\nthe Tanakh, and my understanding is that there is some written evidence that\nJesus and the apostles celebrated the high holidays. I also understand that, on\nthis basis, certain Christian sects today do indeed promote…",
  "data/reddit-ask/r/AskHistorians/comments/si45g3/sławomir_rawicz_a_polish_officer_claimed_in_his.json": "I loved the book growing up, and recently found out there are questions about\nthe account. Wikipedia mentions another person, Witold Gliński, who claimed\nRawicz stole his story, but whose account also had holes. Apparently the son of\na British officer who was stationed in Calcutta also remembered…",
  "data/reddit-ask/r/NoStupidQuestions/comments/sigvad/as_a_girldo_you_ever_get_sad_that_you_have_never.json": "For context I’m a 20 year old female. Today as I was checking out my groceries I\nsaw a guy around my age buy roses and candies. The first things that went to my\nmind was how lucky the girl who will received them be. It’s not really jealousy\nbut more sadness. I’m not really crazy into the romantic…",
  "data/reddit-ask/r/askphilosophy/comments/shycmm/why_not_build_up_philosophy_like_math.json": "I'm a Math/Physics Student and in discussions I've always tried to pick a\n\"mathematical\" approach. Figure out what the differing axioms are between the\ntwo parties. And If I were to make an argument for i.e. the existence of god or,\nwell, any philosophical argument,\n\nI'd start with a number of…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/si2i4k/how_can_dads_abandon_their_kids_when_they_find.json": "I have seen many posts about husbands finding out their wives cheated on them\nand a child they have raised is not their blood. So the husband packs up and\nleaves. Now I understand, kind of, if the child is young. But how can you do\nthat if the child is a little older? You’ve spent your life and all…",
  "data/reddit-ask/r/NoStupidQuestions/comments/siihu3/doctors_swear_an_oath_to_do_no_harm_why_does.json": "This is mostly a USA question I suppose. The financial fallout from\nhospitalization has the ability to financially decimate nearly any lower to\nmiddle class person or family in this country. Such a financial hit can ruin\npeople, making them unable to live reasonably, forget financial…",
  "data/reddit-ask/r/AskHistorians/comments/sih39a/the_wikipedia_page_for_antónio_salazar_the.json": "This is a twofer! I want to know what are some better sources for learning about\nSalazar and the Estado Novo, and find out if it's feasible for the article\n[https://en.wikipedia.org/wiki/Ant%C3%B3nio_de_Oliveira_Salazar] to be improved.\n\nI don't know much about Salazar. I heard that he is revered…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/sim8me/how_tf_do_you_guys_manage_to_live_with_your_past.json": "Thank you guys for your advices. Seriously, from the bottom of my heart. I'll\nwork on myself from here and try to see things from another angle. Please, if\nyou still want to add something, do so, I'll be reading it",
  "data/reddit-ask/r/TooAfraidToAsk/comments/sijr7x/im_serious_if_you_can_biologically_engineer_your.json": "I'm sure we can all agree this is not science fiction anymore it's bound to\nhappen eventually",
  "data/reddit-ask/r/askscience/comments/sikrc2/how_do_spiders_produce_silk.json": "Obviously they don’t have a spool in their large rump, but is it like… just goop\ninside of them until they start pulling on it like a clown with an endless\nseries of handkerchiefs?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/sin47h/why_whoopie_goldberg_was_criticised_and_suspended.json": "I don't understand what was so controversial about her post. Jewish people are\ngenerally white. In fact you cannot tell them apart from an ordinary white folk\n- the way to tell if someone is Jewish is when they declare themselves as such.\nYou can also become a Jewish person by joining the…",
  "data/reddit-ask/r/NoStupidQuestions/comments/sil90b/why_is_being_jewish_a_religion_as_well_as_race.json": "I don't mean this question in any sort of mean spirited way, I'm just confused.\nI see talk of Judaism as a race of people. But isn't race more genetic oriented?\nYou can't \"convert' to being white, black, asian, etc. But you can convert to\nJudaism due to change in personal philosophy. Why is Judaism…",
  "data/reddit-ask/r/AskHistorians/comments/sir6uh/were_many_native_american_tribes_really_as.json": "Hello!\n\nRecently, I’ve been hearing a lot of reference to “two spirit” people as a\ngeneral term for genderfluid individuals in the native community historically.\nHowever, as a historian, I’ve found myself questioning a lot of the discourse on\nthe topic for multiple reasons\n\n1.) Many activists speak…",
  "data/reddit-ask/r/NoStupidQuestions/comments/siujvo/theres_a_polar_bear_outside_of_my_house_for_the.json": "I live in Alaska in the North, a bit isolated doing some experiments with native\nplants. Anyway, there's a damn polar bear outside and it just stares at my\nwindow and waits. TF am i supposed to do? I have guns, but i dont want to kill\nit (unless necessary).\n\nEdit:it's Knocking(banging) my door...…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/siof7q/its_bullying_in_the_usa_really_as_terrible_as_it.json": "Ok so... Well that. I mean in my country bullying is more \"no contact\" stuff\n(scream stuff, nicknames, making fun of someone, excluding people, mocking,\netc.) almost never physical (AKA punching, kicks etc.) but in the movies and\ninternet bullying in the USA it looks like prision stuff. Like for…",
  "data/reddit-ask/r/askscience/comments/sis3j2/what_exactly_are_tensors.json": "I recently started working with TensorFlow and I read that it turn's data into\ntensors.I looked it up a bit but I'm not really getting it, Would love an\nexplanation.",
  "data/reddit-ask/r/AskHistorians/comments/siqtn5/how_and_when_did_the_stereotypical_french_maid.json": "I realize these are essentially two questions (though I'm guessing it reached\nJapan after it was fetishized), but I'm not finding much believable information\non either, just unprofessional blogs with no citations. Any leads?",
  "data/reddit-ask/r/askscience/comments/sjaue2/do_comatose_people_sleep.json": "Sounds weird I know. I hear about all these people waking up and saying they\nwere aware the whole time. But is it the WHOLE time? like for example if I\nplayed a 24 hour podcast for a comatose person would they be aware the whole\ntime? Or would they miss 8 or so hours of it because they were…",
  "data/reddit-ask/r/AskWomen/comments/sj946v/women_how_did_you_spot_a_predatory_man_early.json": "Women how did you spot a predatory man early?",
  "data/reddit-ask/r/NoStupidQuestions/comments/sipkkf/best_fish_to_slap_someone_with.json": "What is the best type of fish to slap someone with? Taking into account\naffordability, damage, weight (for an average person to handle easily), etc",
  "data/reddit-ask/r/AskWomen/comments/sj6vcw/women_of_reddit_what_does_a_forehead_kiss_really.json": "Thank you for all the amazing responses. It seems the general theme is safety\nand comfort.",
  "data/reddit-ask/r/NoStupidQuestions/comments/sjdejw/is_it_easy_to_fool_child_protective_services.json": "My neighbors are drug addicts and they have 3 young little girls. They moved in\nunexpectedly because the mom lied and told the landlord that she fleeing a\ndomestic violence situation with her boyfriend and that he stole all of her\nstuff. I knew it was a lie because he helped her move into this…",
  "data/reddit-ask/r/NoStupidQuestions/comments/sjdiso/what_happened_to_sugar_cubes.json": "I feel like I always saw sugar cubes when I was a kid. At cafes, school,\ngrandparents house. But I feel like I haven't seen any in ages! What happened to\nthem? Did horses eat them all?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/sj8n6g/why_do_people_want_children.json": "As snarky as this might sound, it’s a genuine question; I seriously don’t\nunderstand. I was recently asked by an acquaintance if I had/wanted kids, to\nwhich I said no, but it got me thinking. I honestly just can’t think of a single\nway in which raising one or more kids sounds even remotely pleasant…",
  "data/reddit-ask/r/NoStupidQuestions/comments/sjg2dv/why_do_men_think_women_want_big_dicks.json": "i’ve always found it kind of dumb how guys think like this. the female vagina\nstretches out 5 inches and the average male penis is 5 inches. imagine trying to\nfit a 16 inch stick into a 5 inch hole in the ground. it wouldn’t work at all\nand would be very painful. and women who want big dicks has…",
  "data/reddit-ask/r/AskHistorians/comments/sjgal7/do_you_think_the_lost_dutchmans_gold_mine_ever.json": "I’ve Just read here [https://itshistoria.com/social-history/gold-mine/] that\nSince 1891, more than a hundred persons have claimed to have found the Lost\nDutchman Mine, which has been sought for more than a century. It's possible,\nhowever, did the mine ever exist, or was it the product of someone’s…",
  "data/reddit-ask/r/AskHistorians/comments/sjidzv/how_much_chinese_history_was_actually_lost_during.json": "I keep reading that an unfathomable amount of culture, history, knowledge was\nlost during the Chinese cultural revolution. Are there any numbers or\ncomparisons that would help me wrap my head around how big this loss really is?\nMaybe someone can reccomend some good reading?",
  "data/reddit-ask/r/NoStupidQuestions/comments/sjhiiw/should_a_woman_shoot_their_shot.json": "My mom told me (F22) growing up that if a man wants a woman, he'll let them\nknow. And asking a guy out just makes you look desparate. I guess I took it to\nheart. Both times I made moves towards crushes, it ended badly. The first time,\nI was 15 and the second time was yesterday.\n\nI feel so confused.…",
  "data/reddit-ask/r/NoStupidQuestions/comments/sjiy7z/what_is_fascism.json": "I see people throw around this word a lot and I’m honestly confused. I thought\nit meant corporations run the government or something like that. Which seems\nmore like our current system in the US. But I often see people comparing some\npublic figure as a fascist. And then the next step is calling…",
  "data/reddit-ask/r/NoStupidQuestions/comments/sj1xdv/why_more_girls_believe_in_astrology_as_compared.json": "Can't back it up with data. But have experienced it a lot in real life. I don't\nknow a single guy who knows which sign represents what but every fourth or fifth\ngirl I meet keeps mentioning it.",
  "data/reddit-ask/r/NoStupidQuestions/comments/sjmbq8/anyone_notice_that_comments_are_starting_to_show.json": "Not 'comment score below threshhold' or when there are a bunch of replies to one\npost, but top comments without any votes in either direction or even\nhighly-upvoted top comments show up as collapsed often now. I started to notice\nthis around when the new blocking rules were introduced so I wonder…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/sjvtwu/do_you_ever_wish_something_horrible_would_happen.json": "I’m not talking full on suicide, although those intrusive thoughts have weaseled\ntheir way into my head. I mean a car accident, terminal illness, or a freak\naccident. My life is going down the shitter and I just don’t know how I’m\nsupposed to keep up. I’m too bitch to actually take my own life. But…",
  "data/reddit-ask/r/askscience/comments/sjsq28/could_one_make_a_vaccine_to_train_ones_immune.json": "As opposed to markers of some virus or whatever. Have there been incidents of\npeople getting an autoimmune disease from vaccination trials?\n\n(obligatory: this is unrelated to covid, though perhaps the soreness from the\nbooster is encouraging this on my mind. Very pro-vaccine, I am just curious…",
  "data/reddit-ask/r/NoStupidQuestions/comments/sjyp9j/why_did_reddit_change_the_video_format.json": "It's conclusively a worse change, you have to now click on the video which\nenlarges it and then turn on the sound, then turn it off and then hit the back\nbutton ... WTF?? Why can't they just leave it alone?? You used to be able to\nscroll down to go back to the last screen but you can't even do that…",
  "data/reddit-ask/r/NoStupidQuestions/comments/sk00tc/does_anyone_else_take_their_phone_out_to_check.json": "Or am I just stupid?",
  "data/reddit-ask/r/askscience/comments/sjvxge/when_a_neuron_makes_a_new_connection_is_it.json": "I have been reading about neuron function, and really artificial neuron logic.\nFrom what I have read the cell takes inputs, does something and turns the output\noff or on. But what I am really struggling to find is when we say there is a new\nconnection or pathway in the brain, do the cells…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/sjbv93/why_do_horses_need_shoes_and_other_animals_dont.json": "I saw a video of someone refinishing a hoof and they sliced it like it was the\ninside of a goddamn coconut. What is the hoof made out of? Why does it slice so\neasily? Does it grate like parmesan?? If hooves need so much maintenance, do\nwild horses just walk around with deformed painful feet all the…",
  "data/reddit-ask/r/askscience/comments/sjxrj4/during_astronomical_night_how_much_solar.json": "On a moonless clear night (Sun is below 18° below the horizon and Moon is too\ndim / too deep below the horizon to cause any effect on the dark night sky), how\nmuch solar radiation (including IR, visible and UV) still reaches the ground?",
  "data/reddit-ask/r/NoStupidQuestions/comments/sk2g2k/is_this_offensive.json": "I am male, my friend is a woman. We were talking about pomegranate.\n\nFemale Friend: \"I have never had pomegranate but only ever heard about it being\nused by women to try to be skinnier\"\n\nMe: \"Lol I have never heard of that, although I have eaten pomegranate before so\nmaybe that is where my girlish…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/skda4h/how_did_fck_the_police_too_much_government.json": "Just a decade ago I remember people praising the Waco cult for making a last\nstand, ruby ridge for defending his property and glorifying killdozer for\nstanding up to the man. Now these types of people are the ones singing back the\nblue and all lives matter.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/skde3y/are_there_actually_people_out_there_how_live_that.json": "I am not even talking about being able to afford it (we all know SATC was\nunrealistic).\n\nI am talking about having the energy, the friends and the contacts to do that.\n\nAs a 20-something living in a big city I never get invited to fancy parties,\nclub openings or charity events. I wouldn't even know…",
  "data/reddit-ask/r/NoStupidQuestions/comments/skc1tv/does_reddit_think_every_single_person_who_is_nice.json": "Almost every single time I’ve just been a little bit nicer than everyone else to\na woman in here, I almost immediately get called a “white night” or a “simp…\n\nWhat gives?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/sjv2sn/how_would_a_zombie_apocalypse_be_a_threat_to.json": "I'm watching the walking dead and I'm just asking myself why there's so many\nzombies able to walk when clearly they're in a summer climate and the zombies\ndefinitely aren't embalmed.\n\nTbh the dead coming back to life would be the easiest crisis to manage of\nanything I can imagine",
  "data/reddit-ask/r/askscience/comments/skfjt8/if_cheetahs_were_extinct_would_palaeontologists.json": "And how well are we able determine the speed and mobility of other extinct\ncreatures?",
  "data/reddit-ask/r/AskHistorians/comments/sk4no4/why_did_roman_emperors_have_so_few_children.json": "Listening to the history of Rome, and really struck by the fact that patrilineal\nsuccession was so rare. Julius Caesar, one of the most famous men in history,\nhad no male heir. Compare this with someone like Genghis Khan.\n\n 1. Is it likely that Caesar had many illegitimate children, and nobody can\n…",
  "data/reddit-ask/r/NoStupidQuestions/comments/skhubg/why_does_the_kkk_have_ranks_that_sounds_like.json": "Is there a particular reason why they have ranks of Grand Wizard, Imperial\nWizard, Knight Hawk, Knights?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/skgbsd/how_do_you_shave_your_ass.json": "This question is quite embarrassing for me to ask, but how do you shave your\nass?\n\nLike, what tools do you use? How do you reach the ass-area? How do you know that\nyou're shaving in the \"right\" places when you can't see anything? Do you put\nsome kind of mirror or?\n\nThere are so many questions I'm…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/skinvj/whats_the_point_of_wearing_a_mask_into_a.json": "I’ve been having a hard time understanding this one, especially when it comes to\ndining out at restaurants. Restaurants will say they require the masks upon\nentry but then parties will stay at their tables “dining” close to 1-1.5 hours\nwithout a mask on (I put dining in quotes because more than 99%…",
  "data/reddit-ask/r/NoStupidQuestions/comments/skiksi/banning_books_in_the_us_is_against_the_first.json": "Was gonna post on TooAfraidToAsk but it wouldn’t let me.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/skjv7u/why_does_everyone_act_like_they_wouldnt_be_a.json": "Someone had commented that Oskar Schindler was still a bastard because he was\npart of the Nazi party and therefore Nazi=bad. There’s no disputing that anyone\nwho chooses to identify as a Nazi or segregationist or whatever when society\ncollectively condemns those ideologies in modern times is…",
  "data/reddit-ask/r/NoStupidQuestions/comments/skeyd9/do_other_languages_have_an_equivalent_of_pirate.json": "In English we have \"arrrrrr the seas be too rough for ye, matey\" to let\nlandlubbers know they aren't welcome aboard a pirate ship.\n\nDoes something like that exist in other languages?",
  "data/reddit-ask/r/NoStupidQuestions/comments/skeo6g/how_did_dinosaurs_fuck.json": "how",
  "data/reddit-ask/r/askscience/comments/skkltd/what_is_happening_physiologically_when_you_have_a.json": "What is happening physiologically when you have a “knot” in a muscle? By knot I\nam referring to a tight or particularly sore area in a muscle belly. When\npalpated it can feel like a small lump or tense area. They tend to go away with\nstretching, and or some pressure to the area.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/sk6xhr/do_you_ever_click_on_random_users_in_comment.json": "I think it's kind of fun. You see what sort of things random people get excited\nabout, kind of like a random portfolio of someone's thoughts. See different\napproaches in life and different groupings of interests. Sometimes you see\nsubreddits you didn't even know existed and might find something…",
  "data/reddit-ask/r/AskHistorians/comments/skh96s/who_manufactured_all_the_standardized_arms_and.json": "Were there large state owned smithies producing helmets, gladii and loricas in\nbatches of hundreds?\n\nDid the state contract private manufacturers across the empire and provide\nstandardized blueprints?\n\nWas it a bit of both in ad hoc?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/sktvvo/girls_keep_stop_talking_to_me_because_i_collect.json": "I live in Michigan where there is a 10 cent bot return on beer and carbonated\ndrinks in a bottle or can. I collect bottles at work, everyone gives them to me,\nand if I see them sitting on top of the trash I take them, to clarify I do not\ndig thru the garbage. Then whenever I walk outside which is…",
  "data/reddit-ask/r/NoStupidQuestions/comments/skom1z/is_saying_you_act_white_offensive_to_a_black.json": "I’m 20 and It’s starting to annoy me tbh, all my white friends say it or they\ncall me a coconut “black on outside white on the inside”.\n\nJust because I study computer science, get very good grades, well mannered and\njust being myself.I think I’m eventually just going to explode if someone’s…",
  "data/reddit-ask/r/NoStupidQuestions/comments/skyvvt/i_accidentally_banned_myself_from_my_own.json": "I was just messing around with the mod tools function and I decided to add\nmyself as one of the banned users. As soon as I did that I got the something\nwent wrong screen and when I try to go back to my subreddit I was not able to\npost or anything. I am also no longer listed as moderator and there…",
  "data/reddit-ask/r/AskWomen/comments/skas2n/women_of_reddit_if_you_had_to_dance_to_find_a.json": "I have asked this in the mens subreddit and i cant wait to see the answers from\nboth sides :D",
  "data/reddit-ask/r/NoStupidQuestions/comments/skx1kg/is_it_normal_to_have_a_day_where_you_are.json": "I tend to have these days where I play video games all day, jerk off, eat junk\nfood, and do nothing productive, useful, or importan after which I feel very\ndepressed and disappointed with myself. Does this happen to other people as well\nor is it a problem with my discipline/willpower??",
  "data/reddit-ask/r/AskHistorians/comments/skfox0/after_his_death_from_pneumonia_in_1943_jazz.json": "Information originally found on the Wikipedia entry for Fats Waller\n[https://en.wikipedia.org/wiki/Fats_Waller#Death_and_descendants], which cites a\n1984 'Book of Lists' for this\n[https://en.wikipedia.org/wiki/Fats_Waller#cite_note-bolists-31]. The same claim\nis also repeated in the 2017…",
  "data/reddit-ask/r/NoStupidQuestions/comments/sksasq/does_anyone_else_upvote_every_comment_in_small.json": "I do this every time because I know it makes the commentor happy",
  "data/reddit-ask/r/TooAfraidToAsk/comments/sl5vgc/did_people_not_care_about_adults_dating_minors.json": "My grandfather started dating my grandmother when he was like 24 and she was 14\nand nobody cared. Even now my family don't like, see how weird that is and my\ngrandmother even jokes about it. My dad even started dating my mom when he was\n24 and she was 17 and nobody cared either.\n\nNow, if I (21) was…",
  "data/reddit-ask/r/NoStupidQuestions/comments/sl70sm/why_does_reddit_mobile_continuously_become_worse.json": "Reddit is best used on mobile devices and yet they’ve managed to make it worst.\nWhy do I need to click a hamburger in order to bring up my subbed communities?\nWhy do I need to use a small left side of my screen to scroll through? Its\npathetic. Reddit wants to IPO and yet they continuously create a…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/slal5e/how_do_fart_bubbles_get_stuck_in_my_cheeks.json": "Title. Most of the time the butt air goes out all Willy-nilly & free and\noccasionally it gets stuck in the crevice and has to rock-wall climb up my Mount\nCrack-ass",
  "data/reddit-ask/r/TooAfraidToAsk/comments/sl8ryv/does_anybody_replay_conservations_in_their_head.json": "I am not sure if I’m the only person who replays conversations with my\nfriends/family members and feel like I could have added this opinion to the\ndiscussion. I am not sure if this happens to me because of lack of self\nconfidence or lack of solid train of thoughts at that moment.",
  "data/reddit-ask/r/askscience/comments/sla297/why_is_the_omicron_wave_falling_so_quickly_in_so.json": "For example: In NY (and several other US states), daily new cases has dropped by\n~75% in the past 2 weeks. That seems much faster drops in new cases than\nprevious waves.\n\nWhy are case rates, after the peak of the wave happens, dropping so very\nquickly?",
  "data/reddit-ask/r/askscience/comments/sl9cw7/would_plants_still_be_green_for_photosynthesis_if.json": "Let's say we had a blue dwarf, neutrino, or red giant instead of Old Sol.\nAssuming we were still in a comparable habitable zone and life developed along\nsimilar lines, would our plants still be mainly green?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/sllg51/why_arent_government_whistleblowers_looked.json": "It takes a LOT of courage to call out wrongdoings at work, especially if you\nwork in a political/public field where reputation is everything. Moreover, if we\nwant efficiency then malfeasance or incompetence must be loudly identified.\nLastly, the first amendment seems to protect free criticism of…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/slr0rk/why_are_children_aware_of_what_suicide_is.json": "So I always wondered this since hearing kids were committing suicide because\nthey were getting bullied.\n\nWhen I was in elementary school (I’m a 30yo woman for reference) and even high\nschool, I would get bullied everyday, I’d get beat up, stuff thrown at me etc.\nI’d cry myself to sleep most…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/sllouw/why_do_americans_accuse_each_other_of_being.json": "If people understood well what communism, socialism and liberalism actually are\nas ideologies, they would realize how silly and inaccurate this is.\n\nThank you.\n\nEdit: I should have titled this *some* Americans.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/slowfl/do_dads_find_the_first_few_years_of_parenting.json": "Dad of two. Feels like all of my friends are busy working & being dads\nseparately while my wife & all of the mothers are hanging out & staying\nconnected. I could go a week+ without hearing from the other dads while my wife\ntalks to all of the other moms daily.",
  "data/reddit-ask/r/NoStupidQuestions/comments/slsx7j/what_is_the_point_of_a_little_flag_on_the_mailbox.json": "So I see a lot on TV in America, they all have these little red flags on their\nmailboxes.\n\nSometimes they are up. Sometimes they are down.\n\nWhat are they for?",
  "data/reddit-ask/r/AskHistorians/comments/slsof3/what_did_the_foreigners_think_of_cromwells.json": "When I was still in school, we were taught that the european powers were very\nmuch disturbed by the french revolution - the ideas of the republic were viewed\nas dangerous for the current order, and it was one of the reasons for the\nintervention that eventually occurred.\n\nHowever, that wasn't the…",
  "data/reddit-ask/r/askscience/comments/slra4i/question_from_my_45_yo_son_what_color_eyes_did.json": "My 4.5 yo son loves drawing and learning. He's really into dinosaurs right now,\nso I got him a how to draw dinosaurs book and some children's level books on\ndinosaurs.\n\nAfter going through everything, he really wants to know what color eyes\ndinosaurs actually had, because he really likes to make…",
  "data/reddit-ask/r/NoStupidQuestions/comments/slpaje/is_reddit_lagging_right_now.json": "I had posted a question on r/AskReddit [/r/AskReddit] but I deleted it kind of\nout of paranoia. Basically, I posted it, then 2 mins later I received a\nnotification, alright, then another. And another..\n\nI was like, 'Huh people are really answering that much?' then I looked at my\nphone and saw that…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/slutpc/are_some_the_things_were_doing_to_fix_racism.json": "I really hope I don't sound insensitive, and please educate me if Im way off\nbase. But i feel like when I go on doordash and they have specific catagory for\nblack-owned restaurants, or on Netflix they have a category of black-directed\nmovies, isn't pointing out the race, racist? Like i totally…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/slz5po/my_gf_kissed_a_guy_while_on_drugs_and_idk_how_to.json": "We have been together for just over one year now and we share a very good bond.\nOur relationship is built on communication and sharing, and we don't hide\nanything from each other. Two days ago she was in a rave party and took ecstasy\nand that night she kissed a guy 3 other girls apparently. She…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/slxmmn/do_people_really_think_black_people_cant_be_racist.json": "I saw a black man (age 30) post on Facebook that black people can’t be racist,\nonly prejudice. I was so confused and had to say something. I told him ANY race\ncan be racist. There was some back and forth and he ended it by calling me\ndelusional because I gave the definition of racism.\n\nLogically,…",
  "data/reddit-ask/r/AskHistorians/comments/slsx9u/what_do_heavy_cavalry_do_after_a_successful_charge.json": "I dont understand what do cavalry do after successfully breaking the ranks of\ntheir opposition? Arnt they surrounded knee deep by angry men with sharp pointy\nsticks ready to poke them where it hurts especially when a horse is such a big\ntarget.\n\nI have another question. How effective were archers…",
  "data/reddit-ask/r/NoStupidQuestions/comments/sly5r4/for_those_whove_used_lsd_andor_shrooms_do_you.json": "And if you’ve used both before, which did you think did more?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/sm9gol/why_are_there_so_many_more_lgbtq_people.json": "I’m all for change, but I’ve noticed that there are suddenly a lot more openly\nLGBT people. Now, there are three possibilities:\n\n1) I’m just now noticing\n\n2) There literally are just more LGBTQ people\n\n3) They’re coming out because society is more accepting, and it’s “safer” for\nthem.\n\nIs it one of…",
  "data/reddit-ask/r/askphilosophy/comments/slukix/what_are_some_philosophical_fiction_books_that.json": "I've read more popular works like The Metamorphosis, The Stranger, 1984, and\nWalden. I feel like most of the time the philosophy is so buried underneath the\nfiction that you don't get a full picture of it. That may be part of the appeal\nbut I quite liked the style of Zen and the Art of Motorcycle…",
  "data/reddit-ask/r/AskHistorians/comments/slwzk8/what_happened_during_ww2_with_us_treasury_bonds.json": "I doubt the US Treasury would be sending bond payments to the Nazi treasury\nwhile we're storming the beaches of Normandy, so did we cancel the bonds somehow\n(wouldn't that be considered a default?), or hold the payments in escrow and pay\nup after the war? I'm also interested in any other examples…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/smbfxc/how_can_we_trust_therapists_to_help_us_if_their.json": "It's too risky to just assume all therapists have pure intentions\n\nIt only makes sense therapists don't give you solutions right away, but tip toe\naround it to prolong sessions as long as possible, and keep you coming back. And\nit doesn't help that all the therapists I've spoken appear to confirm…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/smcyo2/do_people_legitimately_enjoy_going_to_weddings.json": "I can't comprehend why. They're not fun, you have to sit through a bunch of\nbullshit, you have to worry about what you're going to wear, etc.",
  "data/reddit-ask/r/NoStupidQuestions/comments/sm4d7o/why_does_the_phrase_all_lives_matter_carry_a.json": "Forgive me for being ignorant but isn't all lives being equal the whole point of\nracial justice movements?",
  "data/reddit-ask/r/NoStupidQuestions/comments/smg3e0/what_happens_when_orgies_are_done.json": "Does everyone like shake hands or something or???",
  "data/reddit-ask/r/askscience/comments/smckx0/is_there_a_physical_limit_to_how_small_a_flame.json": "I was watching my candle slowly burn out, and it got me thinking about this.",
  "data/reddit-ask/r/NoStupidQuestions/comments/smiezj/why_are_the_winter_olympics_happening_in_china.json": "There is a genocide happening to the Uyghur people in China. So I’m just\nsurprised that there hasn’t been like some sort of giant public outcry? I mean\nin this day and age you’d think it be like in the news every day but I’m just\ncurious as to why it seems to me at least that it’s sort of being…",
  "data/reddit-ask/r/AskWomen/comments/sm6m4e/how_often_do_you_change_your_sheets.json": "Also do you do on a schedule or like roughly?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/smhoc2/why_isnt_religion_considered_misinformation.json": "There’s a trend going around popular social media sites to flag misinformation\nand either remove it or add resources. Without getting into how we feel about\nthis, shouldn’t religion fall into this net? I obviously don’t believe in a flat\nearth but is that more dangerous than believing that women…",
  "data/reddit-ask/r/AskHistorians/comments/smdrub/has_the_us_had_any_other_waves_of_declinism.json": "Hey guys! I'm a teen and it seems that declinism is the new trend. People\npreaching about how the US is doomed to decline/collapse because of\nBiden/Trump/Climate Change/Inequality/China/whatever else are practically a dime\na dozen on social media right now. However has is this a wholly new,…",
  "data/reddit-ask/r/AskHistorians/comments/sml3ru/ive_heard_the_poet_sappho_was_supposedly_married.json": "This is something I've seen on a couple of social media posts, saying that\n\"historians think his name is a joke\", given its translation and Sappho\nessentially bring the origin of the term 'lesbian'.\n\nHow accurate is this translation, and is there any evidence (beyond an absurd\nname) that this was a…",
  "data/reddit-ask/r/AskHistorians/comments/sml0nr/were_there_really_no_chivalric_knights.json": "For years now, any knight character in movies or in hobbies with a set of morals\nhave been slammed with the \"knights were just cavalary with a title! The\nchivalric code is a sham!\", but is that really so?\n\nI recall many a moon ago I was looking into the issue and found some online\nresources talking…",
  "data/reddit-ask/r/askscience/comments/sm1by6/can_you_make_fluorescent_yellow_by_mixing_primary.json": "or is there some other process that makes fluorescent yellow so bright",
  "data/reddit-ask/r/AskHistorians/comments/smogms/did_hitler_want_to_eventually_get_rid_of.json": "Hello people of r/AskHistorians [/r/AskHistorians]. Yesterday I was having an\nargument with a friend about whether or not the Third Reich was a Christian\nstate. I was arguing that it wasn’t. Hitler just wanted to keep Christianity\naround for the time being to keep Germany stable during World War II…",
  "data/reddit-ask/r/NoStupidQuestions/comments/smli1y/16_year_old_guy_will_people_make_fun_of_me_for.json": "Basically, I like My Little Pony and my mother says that people will make fun of\nme for it. Will they though?",
  "data/reddit-ask/r/AskWomen/comments/smo4hd/whats_outdated_girl_code.json": "Curious on your thoughts of what girl code is outdated or “evolved” these days?\n\nFor example: is it still a hard NO on dating close friends exes?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/smqm19/why_do_people_like_to_watch_sports_like_really_i.json": "I legit do not get the appeal of watching sports AT ALL. There is a massive\ndisconnect, most games go a long time, and there is just extreme levels of\nfandom and nationalism that freaks me out, I know how baseball is played, but\nonly know the basics of most other sports. I love video games, and…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/smqym8/does_not_wanting_to_have_anything_to_do_with_lgbt.json": "I was talking yesterday with a friend of mine, she recently discovered that\nshe's bisexual and is an active member of the lgbt community. We started talking\nabout our common friends that currently live in our home town because of covid\nwhen she told me that she stopped talking to one of our friends…",
  "data/reddit-ask/r/NoStupidQuestions/comments/smq89z/how_do_morbidly_obese_people_wipe_their_butts.json": "No fat-shaming here, just very curious. I’m slightly overweight and I have\nissues sometimes. I can’t imagine it being very comfortable or easy, especially\nif one can’t reach behind themselves or in between their legs very easily.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/smt1c8/got_served_very_rare_practically_raw_chicken_i.json": "Ngl , freaking out a little bit.",
  "data/reddit-ask/r/NoStupidQuestions/comments/smogfb/can_cats_have_a_favorite_person.json": "I (18M) live with my father full time (divorced parents, I got to choose). We\ngot a cat about 9 months ago. 3-year-old orange dude with huge cheeks. Split\ncustody so my younger siblings are here every other week, and when they are gone\nso is my father, on business meetings and such. Therefore, I…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/smr0be/why_make_historical_movies_about_white_ppl_with.json": "Im referring specifically to the Anne Boleyn program staring black actors. It\ndoesn’t necessarily offend me but it seems kinda stupid and unnecessary if the\ngoal is empowering black content.\n\nFrom the empires of Ghana, Axum, Mali, Songhai, etc, there were so many Black\nmedieval cultures and stories…",
  "data/reddit-ask/r/NoStupidQuestions/comments/smu36d/why_does_astrology_seem_to_attract_women_more.json": "At least where I'm from, the only people who take astrology semi-seriously are\nwomen for the most part. I can point out once I've seen a man share a horoscope\non social media yet I see plenty of women doing it frequently and most men here\nthink it's all bullshit. What is it about astrology that…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/smoqq5/grocery_store_cashiers_if_a_parent_left_a_kid_at.json": "Because it does feel that way.\n\nFun story, one time this happened to me, my mom went back to get some bread or\nsomething and the cashier was just finished scanning our groceries. After doing\nso, she took one look at me, then her screen, and back to me before taking her\nwalkie talkie and leaving the…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/smw7o9/do_people_who_shower_in_the_morning_go_to_bed_all.json": "Growing up I was always told to go to take a bath before going to bed, so when I\nfound out most people usually bathe in the morning I was always puzzled by this.\nNever heard of someone bathing at night and in the morning, but since it isn't\nagsint the law, I really wanna know what's up with that.",
  "data/reddit-ask/r/askscience/comments/sms4l9/does_eye_colour_affect_colour_perception.json": "Do e.g. green-eyed people perceive colours differently than e.g. brown-eyed\npeople? I‘m aware of the individual colour perception, but is it related to eye\ncolour?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/smx0zp/can_you_be_religious_and_still_believe_in.json": "I understand that the Bible contradicts evolution, but how can you seriously\nbelieve that evolution isn’t how everything came to be.",
  "data/reddit-ask/r/AskHistorians/comments/smme4f/were_there_us_pows_still_alive_in_vietnam_in_the.json": "As a teenager in the '80s, I remember the POW/MIA flags and the chest-thumping\njingoism of Rambo, swooping in to rescue languishing and forgotten American\nprisoners from their barbaric captors. It all left me with a sense that maybe\nthere actually were US servicemen still in captivity more than 20…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/smzkj2/how_many_people_out_there_pee_in_the_shower.json": "Peeing in the shower seems to be a bit taboo. There is a variety of reactions\nfrom people when it’s discussed. When I’m showering and I have to pee, I do so.\nI also clean and disinfect my shower pretty regularly. I am just wanting to get\nothers perspective on this subject and see how many shower…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/smkc53/is_it_weirdunhealthy_to_be_this_devastated_over.json": "I recently lost my hamster Iceman due to unknown causes. I lost him on Thursday\nand I have been an absolute train wreck since. Sobbing for hours, little sleep,\nrandom breakdowns, loss of appetite, etc. Is it normal to be THIS upset when\nlosing a small pet?\n\nEdit: Thanks for the responses and…",
  "data/reddit-ask/r/AskWomen/comments/smtdb6/women_who_live_an_unconventional_lifestyle_what.json": "What does \"unconventional\" mean for you?",
  "data/reddit-ask/r/AskHistorians/comments/smlo9f/in_ancient_times_there_was_reportedly_a_sylphium.json": "https://en.wikipedia.org/wiki/Silphium_(antiquity)",
  "data/reddit-ask/r/NoStupidQuestions/comments/smsl9q/why_does_edible_gold_exist_how_does_it_taste_are.json": "I have just learned that edible gold is an option in some restaurants! I'm\nassuming there are risks associated with it, mostly digestive I suppose, and I\njust have so many questions.",
  "data/reddit-ask/r/NoStupidQuestions/comments/smpui3/why_does_reddit_keep_screwing_up_their_app.json": "I seriously have no idea what is happening with this rotting pile of hot\nexcrement that is the Reddit mobile app. I honestly believe there’s an ongoing\nbet at Reddit HQ on who can make the worst possible design change.\n\nThey ruined the video player, they moved likes and other content to…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/smotya/is_it_possible_that_being_too_good_at_reading.json": "If someone is aware of every time that someone else finds them slightly annoying\nor doesn't really want to be having a conversation, is it possible that they'll\nbecome anxious about being around people?",
  "data/reddit-ask/r/AskHistorians/comments/smxgfp/why_didnt_other_iberian_languages_like_catalan.json": "Out of all the other Iberian languages, how did Spanish and Portuguese come to\nbe the dominant languages of Latin America?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/sn3gnl/why_do_poor_people_have_so_many_children.json": "If they can't afford to take care of them why do they have so many kids? And\nthis is not the case only in developing countries, but also in developed ones\ntoo...",
  "data/reddit-ask/r/TooAfraidToAsk/comments/sncxol/are_pronoun_affirmations_at_the_beginning_of_work.json": "I work for a small company in CA and recently a new policy was put into place\nwhere at the beginning of meetings that involve new clients or partners, we go\naround and do introductions and share pronouns and then do \"pronoun\naffirmations.\" Which means that each person in the group says the name of…",
  "data/reddit-ask/r/askscience/comments/snf3nj/is_the_stomach_basically_a_constant_vat_of_acid.json": "Is it the vat of acid from Batman or the trash compactor from the original Star\nWars movies? Or an Indiana jones temple with “traps” being set off by the food?",
  "data/reddit-ask/r/AskHistorians/comments/sn86lh/armenia_in_the_east_was_a_major_source_of_wealth.json": "Full quotation is from the World History Encyclopedia (emphasis added)\n[https://www.worldhistory.org/Byzantine_Empire/]:\n\n> The geographical extent of the Byzantine Empire changed over the centuries as\n> the military successes and failures of individual emperors fluctuated.\n> Territories which were…",
  "data/reddit-ask/r/AskHistorians/comments/sni7b7/there_are_numerous_accounts_of_young_men_simply.json": "Becoming a sailor was the stereotypical escape from the pressure and monotony of\neveryday life for young men in age of sail, but how actually common was it for a\ncaptain to look at a well-dressed eighteen year old city boy who didn't know\nfore from aft and was talking about \"adventure\" and think,…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/snj180/i_asked_a_coworker_to_dinner_and_i_like_this_girl.json": "I asked her on Christmas eve and she said no, i realized the next day that she\nhad to work or had another appointment. I also think that i wasn't so serious\nwhen i asked her out. I didn't made a move since then and stayed professional\ntill now.\n\nBut recently she's so nice to me and even notice her…",
  "data/reddit-ask/r/NoStupidQuestions/comments/snppah/what_are_florida_ounces.json": "I didn't think much of this when I lived in Florida. Many products were labeled\nin Florida ounces. But now that I live in another state I'm surprised to see\nproducts still labeled with Florida ounces.\n\nI looked up 'Florida ounces' but couldn't find much information about them.\nGoogle doesn't know…",
  "data/reddit-ask/r/AskHistorians/comments/snnwed/meta_in_september_2020_askhistorians_hosted_its.json": "As most of us remember all too well, the spring of 2020 was a difficult time, as\nwe dealt simultaneously with the impact of a new and deadly disease upon\nourselves and loved ones, as well as the sudden shock of having to live most of\nour lives in virtual environments.\n\nHistorians, like most other…",
  "data/reddit-ask/r/AskHistorians/comments/snurvx/in_1974_the_cia_recovered_the_bodies_of_six.json": "In Project Azorian, part of the wreckage of the nuclear submarine K-129 was\nraised in secret by the CIA, in the hope of gaining information about Soviet\nnuclear technology or secret codes. The operation was only partially successful,\nwith the submarine breaking in two while it was being raised,…",
  "data/reddit-ask/r/NoStupidQuestions/comments/snre3k/if_i_chloroform_myself_will_i_wake_up_feeling.json": "I have issues falling asleep and this dumb question crossed my mind. Obviously I\ndon’t want to knock myself out via blunt force, but what about chemically?? Will\nI sleep for 9 hours and wake up feeling refreshed?\n\nEdit: do not chloroform yourself, apparently",
  "data/reddit-ask/r/NoStupidQuestions/comments/snoxbs/how_did_people_wake_themselves_up_for_a_specific.json": "Like 500 years ago if you had to be somewhere at a certain time in the morning\nhow would one make sure they wake up in time?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/snw4k9/women_of_reddit_how_many_times_a_day_do_you_get.json": "I have been thinking about this a lot recently, I’m a 6:2ft stocky man so it\ndoesn’t ever occur to me that other people can cause a threat. But for a woman\nalmost everyone can be an attacker, so how often does this come to mind when\nyou’re walking/Uber’ing?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/so0698/why_do_men_assume_a_woman_is_interested_when_she.json": "I have seen this sooo many times it makes me uncomfortable. Sometimes i feel\nlike they can't fathom any other reason to be nice and instantly try to flirt.",
  "data/reddit-ask/r/NoStupidQuestions/comments/snlx1k/why_did_we_default_to_motherfucker_and_not.json": "Why did we default to \"mother-fucker\" and not \"father-fucker\" or something else?",
  "data/reddit-ask/r/AskHistorians/comments/sny4xx/was_sun_wukong_a_character_created_for_journey_to.json": "I ask this because everywhere I look him up people are pretty careful to say\nstuff like \"a legendary character best known for appearing in Journey to the\nWest\" instead of \"a character from Journey to the West\". Yet, every info on him\nseems to be taken specifically from Journey to the West, I…",
  "data/reddit-ask/r/NoStupidQuestions/comments/so2iw4/my_bf_started_a_huge_argument_made_me_cry_and.json": "He will not admit or apologize",
  "data/reddit-ask/r/askscience/comments/so5lbq/is_the_dust_transfer_from_the_sahara_vital_to_the.json": "The Sahara was green only a few thousand years ago so that dust being blown over\nthe Atlantic and bringing rain down in the Amazon is a relatively new\nphenomenon. The Amazon rainforest is millions of years old.\n\nSo how necessary is the Sahara desert to the Amazon?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/so8ro2/do_men_really_imagine_other_women_when_theyre.json": "I dated a man who told me on a regular basis after about a month of dating, that\nmen would imagine other women when they would be intimate.\n\nIt's been bothering me since. Is it true?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/soa2w8/why_do_chicks_wear_leggings_that_go_all_the_way.json": "I don't get this new trend and find it very uncomfortable to look at (don't come\nup with that bullshit 'then just don't look' argument, thanks).\n\nThose leggings go so far up their buttcrack, it can't possibly be comfortable.\nNow I get it, you have a nice booty, you want to show it to the whole…",
  "data/reddit-ask/r/NoStupidQuestions/comments/sobiny/if_someone_makes_an_awful_joke_on_you_is_it_ok_to.json": "Basically, I'm shy and introverted and I am disabled due to a chronic condition.\nSometimes people I barely know, friend of friends, think it is ok to make jokes\non me. Maybe they try to be funny and friendly, but damn. I don't see how \"I'm\nworried for the one who will have to clean the toilet after…",
  "data/reddit-ask/r/AskHistorians/comments/sodkmb/obscene_curse_words_were_extraordinarily_rare_in.json": "I have a hard time believing soldiers were yelling \"golly gee!\" in the trenches\nof WWI. But the writings of the era suggests that words like \"fuck\" and \"shit\"\ndidn't exist in any American or Brit's vocabulary, no matter how unrefined their\ntrade.",
  "data/reddit-ask/r/NoStupidQuestions/comments/sohnuj/is_30_hr_a_lot.json": "I just saw a reel where someone claimed they made that much at subway or\nsomething similar and wanted to confirm the accuracy. If I convert it to my\ncurrency, multiply by 8 hours a day and 5/6 days a week then that puts me in the\ntop 1% in my country, least 5%. I'm guessing the situation in US or…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/sogtok/are_we_ever_going_to_go_back_to_it_being_okay_to.json": "Or allow each other mistakes? Or be graceful about letting people change opinion\nor change yours in the light of new information?\n\nI understand with pandemic and so many lives lost topics around maskwearing,\nmandates and vaccination are extra sore for a lot of people - myself included.\n\nBut I'm…",
  "data/reddit-ask/r/askphilosophy/comments/snvi8s/what_is_the_appeal_of_continental_philosophy.json": "Hi everyone,\n\nI'm a third year student planning to honour in philosophy. I go to school in\nCanada, if that is relevant.\n\nI like to think I am a capable student. I'm a tutor in ancient phil, logic,\nepistemology, and I'm a designated note taker for almost all my classes. I was\ninvited by profs to do…",
  "data/reddit-ask/r/AskWomen/comments/so7wi6/what_is_the_appeal_of_high_waisted_pants_aside.json": "Just been wondering because it seems like it would just be uncomfortable and\nunnecessary but some people seem to hate “low waisted” clothes which sit at hip\nlevel",
  "data/reddit-ask/r/AskWomen/comments/sobd8r/how_would_you_talk_to_your_spouse_about_an.json": "This obviously is a tough conversation to have with someone you really care\nabout. The point would be not to hurt their feelings or cause regret unnecessary\nstress on the relationship.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/somy91/why_is_the_entire_internet_not_boycotting_the.json": "China is horrible -\n\n * Muslim genocide\n * Rediculous totalitarian government\n * stealing basically everyone's data that they can\n\nThe winter olympics seems horrible -\n\n * massive cheating by China\n * horrible conditions for olympians\n * it looks like it's taking place in an industrial factory\n\nwhy…",
  "data/reddit-ask/r/askscience/comments/so7pkw/how_do_tears_work_in_zero_gravity.json": "Was wondering what happens when you cry in zero gravity? What happens to the\ntears? Do they just flow out in bubbles? Can they perform their function? What\nabout that little pipe that runs them down to your nose does it get any tears to\nclean the nose or whatever it does?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/sopk9w/is_anybody_actually_offended_by_ableist_language.json": "I work for a tech company--one of the very biggest ones. In my writing, I'm not\nallowed to say things like \"let's take a closer look,\" because this is somehow\n\"offensive to people with visual impairments.\" I can't say \"don't jump to\nconclusions,\" because this... I guess is offensive to those can't…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/solzni/how_come_some_dog_owners_ignore_the_fact_some.json": "Due to traumatic events in my childhood, I am absolutely terrified of dogs, now\nyes it's my problem so if I see a dog,I avoid him, but some dog owners let their\ndogs of leash and allows them to sprint towards other people, happened a few\ntimes and all the times it resulted in me running away, yes…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/sozdjz/do_men_get_aroused_when_they_see_a_womans_nipples.json": "Is it true that it causes that reaction in most heterosexual men even in\nnon-sexual contexts? And if so, are you guys able to control it?",
  "data/reddit-ask/r/NoStupidQuestions/comments/soz3xa/why_do_many_americans_both_left_and_right_believe.json": "We are not socialist. We are a social democracy which hasn't been connected to\nsocialism for 100 years, and is a capitalist ideology nowdays with strong focus\non social politics as well. A mixed economy that very much believes in the free\nmarket for 99% of businesses (liquor is the only thing that…",
  "data/reddit-ask/r/NoStupidQuestions/comments/sozngv/anybody_else_get_a_weird_sense_of_pride_when_they.json": "Like I never knew what IIRC meant and when I figured out it’s “if I remember\ncorrectly” I just felt a small sense of pride. Like solving a puzzle",
  "data/reddit-ask/r/TooAfraidToAsk/comments/sp2p7j/first_time_hiring_an_escort_what_do_and_do_not_i.json": "Looking to hire an escort in Australia. Got a couple of questions.\n\nWhat are the 'do' and 'do not' I should know. What red flags should I be looking\nout for?\n\nHow or what do I prepare for the first meeting (in-calls)?\n\nLastly a personal question, what if I was to nut it within like 5 minutes.…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/sp4ijs/how_come_grown_christians_cant_see_that_they_were.json": "Probably most religions I suppose but christians in particular seem to be\nuniquely unwilling to consider any alternative to their reality. I have\nextensive experience with this as my best friend through Jr high and high school\nwas always trying to recruit me. Tricking me into going to christian…",
  "data/reddit-ask/r/NoStupidQuestions/comments/sp2hfh/am_i_the_only_one_who_feels_like_this_emoji_is.json": "When I get this as a reply it feels like the person is saying “Yeah, I don’t\ncare enough to use actual words to reply to you so, whatever!”\n\nMaybe I need to change my perspective!?",
  "data/reddit-ask/r/AskHistorians/comments/soy19o/were_there_ever_streakers_or_other_pitch.json": "just wondering if streakers are a modern phenomenon or if people have always\ndone this type of thing.",
  "data/reddit-ask/r/NoStupidQuestions/comments/sp7vs0/would_you_rent_the_electric_car_battery_instead.json": "I have just watched a video from CES 2022 talking about a new car brand,\nVinfast, allowing their customers to rent the car battery to reduce the total\nprice like a half. That is quite impressive.",
  "data/reddit-ask/r/AskHistorians/comments/sp7dhz/the_baby_boom_generation_is_known_for_their.json": "Not sure if this breaks the rules because this question references today's\nculture somewhat. However, there seems to be a common thread of the progressive\nanti-government and anti-war movement of the 1960s and the limited government\nmovements of the Reagan/Thatcher administrations in the 1980s. I'm…",
  "data/reddit-ask/r/askscience/comments/sp7amd/askscience_ama_series_were_experts_here_to.json": "African Sleeping Sickness (aka Human African Trypanosomiasis)\n\nRiver Blindness (aka Onchocerciasis)\n\nChagas Disease\n\nSoil-transmitted helminths\n\nSchistosomiasis (aka Bilharzia)\n\nLeishmaniasis\n\nThese are all are part of a family of illnesses known as Neglected Tropical\nDiseases [NTDs]. While malaria…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/sp413f/do_people_visually_check_toilet_paper_to_know.json": "I (UK M 31) read something the other day that went like this; \"How do blind\npeople know when to stop wiping?\"\n\nIt really threw me, and I didn't get it until I looked at the comments and\nfigured out what people were talking about.\n\nIs this something that everybody does? Visually check that the paper…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/sotnib/is_it_ok_to_ask_for_a_pic_without_makeup_from_a.json": "I’d say it’s reasonable. Most girls look dramatically different with makeup, and\nwould not get a fraction of the attention they do without it. Considering they\nrule guys out almost instantly if they don’t meet their strict criteria, I’d say\nit’s only fair we are afforded the same opportunity.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/spbf4m/if_min_wage_isnt_enough_to_survive_on_are_we.json": "I've been terrified of asking this question because I don't want it to be taken\nthe wrong way. Just know this is coming from genuine curiosity.\n\nFrom what I learned from public schools and the internet about slavery, slaves\nwould be given somewhere to eat and sleep.\n\nI understand in some/most…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/spelqh/why_do_stores_not_include_the_tax_on_the_label_or.json": "I live in Canada, where the price displayed on the shelf is always without tax.\nExample- tag says 3.00$ but it would be 3.45$ with tax. I feel like it would be\nsimpler for everyone to display exactly what the item costs when you go pay.\n\n*Edit- To clarify, I mean the label or tag displayed on the…",
  "data/reddit-ask/r/AskHistorians/comments/sp2svd/to_what_extent_were_ethnic_differences_between.json": "Whenever I see discussion about the Highland Clearances online, the focus is\nusually on countering claims of English colonisation by reference to economic\nfactors of the Clearances, and the Scot on the Scot nature of the evictions.\n\nHowever there never seems to be reference to split between the…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/spguco/if_gender_isnt_real_why_have_we_created_even_more.json": "Such as \"demiboy/girl\", \"neutrois\", \"genderfluid\", \"[noun]gender\". I thought\ngender was a concept we used back when our gender coincided with some sort of\nsocietal role (as well as the aesthetics that come with that role).\n\nI'm going to be honest, I've never felt my gender before. I don't even know…",
  "data/reddit-ask/r/NoStupidQuestions/comments/spgg5m/whats_the_point_of_spending_65_million_on_a_super.json": "I don’t get it",
  "data/reddit-ask/r/TooAfraidToAsk/comments/spj4q0/why_doesnt_any_country_do_something_about.json": "I would like to say that i personally don't know what could be done except for\nsanctioning, today in class we were talking about north korea and i was just\nwondering if other people might know and their opinions.",
  "data/reddit-ask/r/NoStupidQuestions/comments/sp9z6e/why_dont_billionaires_just_retire.json": "I get that people like Musk and Bezos and Zuckerberg and Branson are “trying to\nchange the world.” But I’m always confused when I see people in their 80s who\nare decidedly not on some lofty mission still hunting after more money. Take a\nguy like Rudy Giuliani, who at 77 is still trying to make…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/spisma/why_is_the_usual_argument_against_incest_about.json": "Just a shower thought I had just now.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/spjm2s/bought_a_sexy_cheerleader_costume_to_wear_as_a.json": "Background: I’ve dressed up for partners in the past and been laughed at when I\ngot into “character”, maybe it was too awkward for him. Now I don’t know if I\nshould just walk out in the costume or what. Any suggestions or tips would be\nhelpful:",
  "data/reddit-ask/r/NoStupidQuestions/comments/spjogp/what_is_this_thing.json": "I've seen these in ramen and things like that at Asian restaurants and I've seen\nit represented tons of times in anime as well. What is it? Obviously it's edible\nbut what is it made of and why does it look like those little erasers from\nschool?",
  "data/reddit-ask/r/AskHistorians/comments/spg3u8/what_did_being_a_good_husband_mean_to_the_romans.json": "I've previously asked about Roman concepts of masculinity/virtus\n[https://www.reddit.com/r/AskHistorians/comments/cx4kmv/how_did_the_idea_of_being_a_proper_man_virtus/]\nand received a wonderful rundown of its origins and many…",
  "data/reddit-ask/r/NoStupidQuestions/comments/spn6l3/does_anyone_feel_sad_and_hopelessness_when_they.json": "And I don't mean like attractive people in general, but like someone who is\nexactly your type that has like the perfect facial features and/or body that you\njust find irresistible.\n\nThen you come back to reality and realize that they'd never go for someone like\nyou. Man, that shit hurts. I can't…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/spj11o/is_it_me_or_is_it_difficult_to_not_look_at_women.json": "Edit: some of y'all are just mean. I asked this on this subreddit for s reason.\nI get that this is a very controversial, but you don't gotta straight up light\nme up for asking a question. The world is just getting more lewd, I'm not trying\nto be a creep. I do not support any creeps. I don't care…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/sprh2v/is_it_homophobic_of_me_to_not_care_about_genders.json": "Please be blunt I feel like a horrible human being and I’m willing to take\ncriticism. I will assume you are either a he or a she, but I WILL correct my\nvocabulary if you tell me “I prefer they/them” I respect that, but I don’t care\nto learn about the new pronouns and sexualities.\n\nI know there’s…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/sp4dlg/nurses_and_teachers_of_reddit_why_havent_you.json": "Everything i read about the way nurses and teachers are treated seems horrible.\nFrom staffing problems, lack of necessary equipment, being scolded by their\nsuperiors when trying to do the right thing, as well as the paltry wages, i feel\nlike the entire system are working against them, despite their…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/spxqc3/why_is_reddit_getting_angry_at_the_truck.json": "A very popular quote by AOC, which many have posted across reddit,\n\n\"The whole point of protesting is to make ppl uncomfortable. Activists take that\ndiscomfort w/ the status quo & advocate for concrete policy changes. Popular\nsupport often starts small & grows. To folks who complain protest demands…",
  "data/reddit-ask/r/askscience/comments/sprn1z/did_the_hungatonga_explosion_produce_a.json": "I'm wondering if locations on the exact opposite side of the Earth from major\nvolcanic eruptions are at some kind of risk for e.g. having their windows blown\nout.\n\nThe thought was triggered by this animation\n[https://nevill-manning.com/hunga-tonga/index.html].",
  "data/reddit-ask/r/AskHistorians/comments/spwx55/roman_soldiers_are_often_depicted_wearing.json": "If you wore sandals on a construction site you'd be sent home. Surely a\nbattlefield has more hazards",
  "data/reddit-ask/r/NoStupidQuestions/comments/spmp8g/was_my_boss_justified_in_firing_me_should_i_fight.json": "I (24M) was fired today.\n\nI am a student, but also work part time for the government and a shoe store.\nToday I called in sick from my government job because I was nauseous and\nthrowing up all morning. By the afternoon, I felt well enough to leave the house\nand I went to the shoe store to pick up my…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/spw0kw/my_boyfriend_wants_to_tie_ribbon_round_my_dick.json": "Last night when we were… getting frisky he said he wanted to do bondage and I\nwas down for it. Then he pulled my boxers down and got some ribbon out of the\ndrawer and tried to tie it round my dick. I didn’t know what the fuck was going\non and pretended like I had explosive diarrhoea to get out of…",
  "data/reddit-ask/r/NoStupidQuestions/comments/sq0vph/what_would_happen_if_you_put_a_million_gorillas.json": "Would they all start fighting each other or would they start mating. Could they\nall live as a very big tribe?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/sq3473/what_do_conservatives_antivaxxers_have_to_gain.json": "Edit: \"telling people not to get vaxxed\" by way of saying it is a filled with\ntracking microchips, or it is a deadly plot by Bill Gates, or 5G, or whatever",
  "data/reddit-ask/r/NoStupidQuestions/comments/sq3j4f/what_is_a_good_word_instead_of_love_for_a.json": "I date this girl and we were joking around that I should pick her up with a big\nvalentine's sign. So I found a few good suggestions which I can write onto the\nsign, but I think the word \"love\" is a bit over the top for a second date and\n\"like\" maybe a bit underrated",
  "data/reddit-ask/r/AskWomen/comments/sq1a2a/whats_the_most_common_unattractive_feature_youve.json": "When I say 'good person' let's set the bar. Someone who isn't racist, sexist,\nhomophobic, rude, etc. Someone you'd actually be friends with. Someone\nresponsible enough you'd let them watch your dog, cat, goldfish, etc.\n\nDespite all of this there are some qualities which people find unattractive…",
  "data/reddit-ask/r/askscience/comments/sq0jav/could_a_sensitive_gyroscope_be_used_to_measure.json": "I've read that modern fiber-laser gyroscopes are sensitive enough to be used to\nmeasure the Earth's rotation. Could they be used to measure other rotating\nsystems that the Earth is a part of? e.g. rotation around the sun, rotation of\nthe solar system, rotation of the galaxy?",
  "data/reddit-ask/r/NoStupidQuestions/comments/sq2kfa/why_do_we_say_120_proof_instead_of_alcohol_60.json": "Why double it? Does it serves a purpose? Is it cool?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/sq7s22/is_russia_bluffing_about_the_potential_invasion.json": "Obviously nobody here knows and I personally know very little about the subject\nbut would there be any reasons for them to bluff on this?\n\nIt just seems weird that the whole world has been watching their every move for\nmonths and they know everyone has been watching. In the age of satellites…",
  "data/reddit-ask/r/NoStupidQuestions/comments/sqbozo/is_it_rude_to_ask_a_girl_when_her_time_of_the.json": "I'm 25m and have been flirting back and forth with someone for a few weeks now.\nShe's super shy in general, and I want to make sure I respect her boundaries and\ndon't bug her when it's that time, but I can't think of any way to ask that\ndoesn't sound weird or invasive.\n\nEdit: okay seems pretty…",
  "data/reddit-ask/r/AskHistorians/comments/sq7ui5/agatha_christe_arthur_conan_doyle_charles_dickens.json": "edit: Christie, not Christe, in the title\n\nThese portrayals, especially in Conan Doyle's \"The Man with the Twisted Lip,\"\ndepict an otherwise respectable British gentleman who is addicted to opium\nvisiting an opium den to get his fix. How common was this? I know anti-Asian\nsentiment was common,…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/sqarq1/those_who_release_balloons_for_friends_and_family.json": "I worked in a shop that sold helium balloons, amongst other things, and the\namount of people who would come in and say they wanted foil balloons to release\ninto the sky for their loved one drove me a bit mad.\n\nI get that doing something is a positive thing, but would it really be less\nappealing to…",
  "data/reddit-ask/r/askscience/comments/spv8tz/how_is_the_heat_contained_of_these_socalled_mini.json": "I saw on the news that some laboratory created a mini-sun that was sustained for\n5 seconds and could provide an enormous amount of energy during the time it's\n'alive'. This was in the context of nuclear power testing.\n\nMy question is 2 folded: 1. It was said on the news that the heat this mini…",
  "data/reddit-ask/r/AskHistorians/comments/sq58z2/why_do_so_many_traditionally_jewish_names.json": "Was there something about surnames in Central and Eastern Europe or Jewish\nculture that caused these to be particularly common among the Ashkenazi\npopulation? Relatedly, is there any reason for the extra prevelance of precious\ngems and materials, for example professions they were historically…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/sqh2gq/why_do_people_get_so_upset_about_covid_vaccines.json": "Serious respectful answers only please. Just wondering how people reason about\nthese things. Specifically, there have been vaccine requirements to attend\nschool, etc., for a long time, so why is the COVID vaccine requirement different\n(more upsetting)? And why are people upset about being required…",
  "data/reddit-ask/r/NoStupidQuestions/comments/sqek51/do_any_other_ios_users_get_frustrated_when_you.json": "This often happens to me in the Notes app. Like just now I wanted to type the\nword “sears,” like the verb, uncapitalized. Then as soon as I hit space it\nchanged it to “Sears.” So I backspaced and changed it back to “sears,” hit space\nagain to keep on writing, and sure enough it changed right back…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/sqk1ww/is_it_possible_that_those_who_wrote_the_bible.json": "I just saw a post with “Biblically accurate angels” and they were weird\ncreatures with tons of eyes… I know a lot of mental illnesses were not diagnosed\nback then and from these descriptions it seems a lot like\ndelusions/hallucinations.",
  "data/reddit-ask/r/AskHistorians/comments/sqhh0b/how_did_crying_uncle_come_to_mean_surrendering.json": "Does this term have a specific origin, or just kind of pop into existence?",
  "data/reddit-ask/r/AskHistorians/comments/sq7pku/were_pigs_on_ships_in_the_1800s_to_early_1900s.json": "The fictional book The Windflower by Laura London, set around 1813, has the\nfollowing claim:\n\n> \"If there's a pig on a ship, everybody calls it Dennis,\" Cat said. \"Don't ask\n> me why.\"\n\nThere's a forum thread on a Civil War website\n[https://civilwartalk.com/threads/dennis-the-pig.95604/] that makes…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/sqqpup/why_are_people_acting_like_new_generations_not.json": "Seen lots of articles lately talking about how millenials and gen z aren't\nhaving lots of kids and all the articles are talking about how bad it is. I was\ntaught in school that the earth is massively over populated and the population\nis completely unmanageable. So surely younger generations not…",
  "data/reddit-ask/r/NoStupidQuestions/comments/sqrsa1/name_some_mouthdental_diseases_to_use_as_a.json": "My previous hamster, Tonsillitis, passed away just before new years and I want\nto give the special needs hamster I'm adopting today a similar name. It has\nreally gnarly tooth issues so mouth or dental diseases it is! Looking for\nsomething that has a good nickname potential (like appendicitis could…",
  "data/reddit-ask/r/askscience/comments/sqrpdz/what_is_the_difference_between_visceral_and_acute.json": "I know that acute phase proteins are upregulated when the body is experiencing\ninflammation, but don't know much about visceral phase proteins or what defines\nthem. Could someone please help? Thanks.",
  "data/reddit-ask/r/NoStupidQuestions/comments/sqrrf8/why_isnt_morbid_obesity_treated_the_same_way_as.json": "Just to clarify, I don't mean people who are slightly overweight, I am talking\nabout people who are literally eating themselves to death.\n\nAt that point, I very much see it as a disease and I don't understand why\nsomeone who is starving to death can be sectioned, but the other end of the\nspectrum…",
  "data/reddit-ask/r/AskWomen/comments/sqtgen/women_of_reddit_whats_your_favourite_ice_cream.json": "I’m currently pregnant, craving ice cream and wondering if there’s any flavour\nI’m missing out on. So what’s your all time favourite flavour?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/sqykzy/my_ex_boyfriend_began_having_sex_with_my_whilst_i.json": "Last night my ex boyfriend came over to talk, it ended up in an argument and I\nasked him to leave multiple times but he refused and said he wanted to continue\ntalking. Around 2am I fell asleep and I woke up at some point during the night\nto him having sex with me. He had taken my clothes off me…",
  "data/reddit-ask/r/AskHistorians/comments/sqyo1t/there_is_a_fairly_specific_modern_idea_of_what.json": "If you go to a Renaissance Faire, watch a show featuring Vikings, or even just\ngoogle \"Viking Hair\"\n[https://www.google.com/search?q=viking+hair&rlz=1C5CHFA_enUS881US881&sxsrf=APq-WBvCxQDaW7ldkCyMbCYKfk…",
  "data/reddit-ask/r/NoStupidQuestions/comments/sqzh22/on_my_bottle_of_mouthwash_directions_say_to_rinse.json": "My cheeks get tired.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/sr3f7y/should_there_just_be_a_legal_cap_on_rent_prices.json": "Costs are out of hand in some states in the U.S. How the hell is it justified to\ncharge me $1200 for a studio apt, while also paying me a minimum of only $14/hr?\n\nLet’s put that to perspective. In some states that have a $7.25 minimum, the\nrent for a 2 bed can be as low as $250. That’s almost 1/5…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/sr6ycg/isnt_it_inherently_selfish_of_god_to_create.json": "Hi, just another person struggling with their faith and questioning God here. I\nthought about this in middle school and just moved on as something we just\nwouldn’t understand because we’re humans but I’m back at this point so here we\nare. If God is perfect and good why did he make humans, knowing…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/sr5h45/do_normal_people_justnot_think_about_suicide_as_a.json": "Disclaimer: I am currently not suicidal and am working on getting help for my\nissues.\n\nA few weeks ago, I was talking to a friend about my problems and he said\nsomething like \"the only thing you can do is keep going,\" which is objectively\nfalse because dead people do not suffer. Is suicide so taboo…",
  "data/reddit-ask/r/NoStupidQuestions/comments/sr6hmm/if_foxes_are_cat_software_on_dog_hardware_is.json": "I know this is ridiculous, but I’m kind of curious. I’d like to know if there’s\nsome kind of foil to the fox in nature. I know it doesn’t work like that, but\nit’s worth a shot",
  "data/reddit-ask/r/TooAfraidToAsk/comments/srb0em/when_did_body_positivity_become_about_forcing.json": "What gives? It’s entirely one thing for positivity behind things like vitiligo,\nbut another when people use the intent behind it to say we should be accepting\nof obesity.\n\nIt’s not okay to force acceptance of a circumstance that is unhealthy, in my\nmind.",
  "data/reddit-ask/r/NoStupidQuestions/comments/sr9ok3/if_dolor_is_spanish_for_pain_why_is_dolores_a.json": "I have no idea the history of this name; there must be something, because nobody\nwould willingly name someone \"pains\".\n\nI'm not meaning to be insensitive of course, I'm genuinely curious.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/sr91ex/why_do_people_bleach_their_buttholes.json": "I hear people talk about bleaching their anus, but what is the true purpose of\nit?",
  "data/reddit-ask/r/AskHistorians/comments/sqxgh7/why_is_thailand_so_lgbtq_friendly_culturally.json": "While other nearby countries may have same-sex marriage (Taiwan) or limited\nlegal recognition (e.g. China, Japan, and Vietnam), they tend to not be as open\nto LGBTQ people as Thailand, especially in their culture. What is the historical\nbasis behind relative Thai openness to LGBTQ people?",
  "data/reddit-ask/r/NoStupidQuestions/comments/sqxz9g/i_apologise_feel_like_at_my_age_i_really_should.json": "But what on earth are Russia and Ukraine fighting (or are about to fight) about?\nThe news keeps telling me where troops are waiting etc but I don’t seem to be\nseeing why they’re arguing??\n\nEdit- bloody love Reddit. Thank you for not making me feel silly and explaining\nthings in a basic enough way…",
  "data/reddit-ask/r/NoStupidQuestions/comments/srecbp/why_would_billie_eilish_care_if_kanye_drops_out.json": "Kanye is threatening to drop out of Coachella if Billie Eilish doesn't apologise\nto Travis Scott, but why would Billie even be affected by Kanye's attendance at\nCoachella?",
  "data/reddit-ask/r/AskHistorians/comments/sqwatd/how_italy_lost_about_500_km²_of_territory_in_1954.json": "just find a curious little thing while searching for other informations in some\nencyclopedias.\n\nbetween 1953 and 1954, Italy lost about 500 km² of territory but there is any\nwar treaty for italy during this period? how tat happened?",
  "data/reddit-ask/r/NoStupidQuestions/comments/srf3a3/how_to_tell_my_parents_to_stop_having_sex_in_the.json": "I wouldn’t mind them having sex but they moan REALLY loudly and it’s distracting\nand just weird. How do I tell them to stop without coming off as direct?",
  "data/reddit-ask/r/AskHistorians/comments/srg9m7/the_armed_conflict_in_northern_ireland_is.json": "And is the moniker an attempt by one side or the other to down play the\nseriousness of the conflict? 'The Troubles' just seems a very quaint way to\ndescribe armed conflict where there was bombs and assassinations going on\nthroughout the conflict.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/srjkr3/why_are_we_trying_to_shut_down_misinformation.json": "Wouldn't it make much more sense to have Fauci or someone from the CDC discuss\nthings openly with Joe Rogan and his guests? Silencing just makes things worse.",
  "data/reddit-ask/r/NoStupidQuestions/comments/srk46d/does_anybody_else_sit_in_their_vehicle_after_a.json": "I do this a lot where I'll just sit in my truck for 15 min or even up too an\nhour in my driveway. If i get food i dont even take it inside i just eat it in\nmy truck. Is there a mental reason or is it just one of those things.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/srmm1a/why_the_heck_do_so_many_asian_women_not_wanna.json": "I'm a white dude and I've talked online with quite a few asian girls from all\naround Asia and almost all of them have told me they don't date asisn guys. One\ngirl I chatted with from the Philippines kept telling me about how she want\nwhite kids with the \"white genes\" Also just posting tiktoks none…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/sr94b1/why_are_the_unvaccinated_causing_problems_for.json": "Why are people bothered if someone has not been vaccinated if they themselves\nare triple vaccinated.\n\nHow does it affect them.\n\nGenuinely. I'm not anti vax or right wing. Just don't understand the hate.\n\nHow are the unvaccinated to blame and why are their concerns not at all\nrespected.\n\nHelp me…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/srll44/is_race_a_real_issue_in_your_daily_life.json": "Heads up, 40 white male perspective.\n\nMedia makes it seem like there’s a race war, but living in the south I just\ndon’t see it. I hold doors open for black guys, they hold doors for me. When we\ncross on the street or going in a store, we say what’s up or nod and keep it\nmoving.\n\nAt work every gets…",
  "data/reddit-ask/r/NoStupidQuestions/comments/srmioe/do_you_think_its_rude_to_go_to_a_date_eating_out.json": "So, basically I had this date set up to eat a nice dinner out. The other person\ncame already \"full\" and was basically not hungry anymore. They didn't eat\nanything, so I was the only one eating at the table. It was also me inviting\nthem so I would've paid for everything, money can't be an issue. I…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/srodf5/did_life_in_the_90s_feel_better.json": "I was only a baby so I can't say but sometimes early morning dew makes me\nnostalgic about a time I barely remember. The 2020's doesn't seem like it'll be\nnostalgia-worthy.",
  "data/reddit-ask/r/NoStupidQuestions/comments/srn5tz/is_adult_life_as_depressing_as_it_seems.json": "I'm graduating highschool this yr and I'm kinda scared. I don't have anything\nfigured out and I'm scared that I'll end with some boring job that sucks all the\nlife out of me. I'm petrified actually. I feel like I've missed out on so many\nthings bc of shyness and lockdowns. I didn't really get the…",
  "data/reddit-ask/r/NoStupidQuestions/comments/srd2eq/does_anyone_else_feel_like_the_housing_market_is.json": "From family and friends, to complete strangers I’ve never met before, some days\nit feels like everyone is telling me to buy a place and get locked into 30 year\nmortgage right now.\n\nRemembering how so many of my peers got locked into student loans they’re still\npaying off, the language sounds…",
  "data/reddit-ask/r/AskHistorians/comments/srq3on/why_did_the_vikings_and_generally_norwegians.json": "So, I am not sure this is the right place to ask this but I am a baffled italian\nthat has travelled North to discover that absolutely nothing in Norway is\nactually old because their cities kept burning too the ground. In my homeland\nroman-era structures have withstood earthquakes and volcano…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/sroklh/are_there_women_who_have_never_experienced_orgasm.json": "Besides women who, physically, for one reason or another, are unable to orgasm,\nare there women who have never experienced an orgasm? What was the reason?\nEmotional? Something else? Just wondering. TIA.",
  "data/reddit-ask/r/AskHistorians/comments/srj0cp/the_emancipation_proclamation_freed_the_slaves_in.json": "How many black Americans, if any, took advantage of the Homestead Act? If they\ndidn't or couldn't, was it lack of knowledge or enough resources to travel west\nand claim it? Or did they try to sign up but were prevented?\n\nWe frequently hear that freed slaves had no land to farm and were forced…",
  "data/reddit-ask/r/AskWomen/comments/srp44e/how_would_you_feel_if_your_partner_was_using_sex.json": "chat websites, interactive cam girl websites, etc. how would you feel? would you\nconsider it cheating?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/sruoql/is_it_a_dick_move_to_plant_a_clover_lawn_knowing.json": "I want to turn our front lawn into a no mow, low water, pollinator sanctuary. I\nwant to do this mainly with a clover lawn, with some other flowers and bulbs\nscattered throughout. I live in a very hot, drought prone area, and the\nirrigation water is being turned off earlier and earlier every year,…",
  "data/reddit-ask/r/askscience/comments/srx3qv/is_there_another_pair_of_animals_that_reverse.json": "Question from my 4th grader. The dragonfly nymphs prey on tree frog tadpoles,\nbut grown tree frogs can hunt dragonflies. Is there another pair of animals that\nreverses these roles? Thanks in advance.\n\nWe were watching a video on National Geographic kids if you want to share this\nwith your kids.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/srzvws/is_occasionally_wanting_to_not_be_alive_normal.json": "Everyone says I'm one of the most positive people they know. I work as an EMT\nand I'm used to death. Is wanting to just be dead sometimes normal? I don't\nthink I'm suicidal, but also, life is so difficult sometimes - no one actually\nunderstands anyone else - is it normal to just want no more pain?…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/srzv32/women_of_reddit_to_you_fold_your_arms_under_or.json": "I just genuinely want to know. These two guys were arguing about it and i want\nto know the answer",
  "data/reddit-ask/r/TooAfraidToAsk/comments/srj5us/why_the_hell_are_the_medical_expenseseven_the.json": "I've been told by a friend that if I one lives in USA and if your medical\ninsurance doesn't cover any specific areas he/she is basically f*cked, is it\nreally that bad?",
  "data/reddit-ask/r/NoStupidQuestions/comments/ss498b/this_is_a_very_serious_question_its_about_a.json": "A member of my family has gone missing.\n\nThey left behind their car, their money, and all of their forms of ID. The only\nthing they took with them is a duffle bag and 2 changes of clothing.\n\nWe called the cops and when they ran their social through their computers the\ncops said his digital…",
  "data/reddit-ask/r/NoStupidQuestions/comments/ss50c9/why_cant_you_schedule_texts_to_go_out_at_a_later.json": "It baffles me that this is not a standard feature already. I have insomnia and I\ncan’t even count how many times I want to share a post with a friend but I know\nit’s inappropriate to send it to them at 2 am. I save them but always forget to\nsend them out when the appropriate hour comes…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ss6228/is_it_okay_to_block_a_close_friend_if_they.json": "Edit: I should have added that; 1.) Me and my Ex broke up just a few months ago.\nWe were in a relationship for 4 years. 2) He was toxic and abusive, which I\ntried to deny and I thought \"I could change him\". He would disregard my\nachievements and would make me feel bad about my appearance. He also…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ss5u9j/are_there_really_men_who_cant_find_the_clitoris.json": "Idk if this is just like on of those jokes, but are there really men who can't\nfind the clitoris? I mean I'm male, it's not hard to find. Like you could just\nlook and see it, even in the case where size is an issue you can pull back stuff\nand see it.\n\nI mean even if you are really inexperienced,…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ss7kpp/is_initiating_sex_with_your_girlfriend_while_shes.json": "A recent post here got me thinking. So when I was still together with my\ngirlfriend, her favourite way to wake up was with me kissing her, playing with\nher boobs, or down under, all of which usually led to sex. She specifically told\nme that that's okay. Sometimes she was not in the mood (rarely)…",
  "data/reddit-ask/r/AskHistorians/comments/ss9u4z/i_just_read_marc_aurelius_meditations_what_other.json": "Sorry if this is not allowed. I realize it's not the usual format of \"I am x\naround year y ... \" I'm sorry if I broke any rules.\n\nSo as the title says I just finished the meditations and I'm in absolute awe ..\nit was like a window into the past and it just made the person and age so real\nfor me ...…",
  "data/reddit-ask/r/askscience/comments/ssdqus/how_do_eyelash_microorganisms_get_to_a_newborn.json": "All people have eyelash microorganisms, but I don’t think they are born with\nthem. How do they populate a newborn?",
  "data/reddit-ask/r/NoStupidQuestions/comments/ssi2m8/why_isnt_anyone_in_the_us_talking_about_our.json": "I’m just kind of infuriated by the fact that I haven’t seen a single thing in\nyears talking about how bad the monopolies in the US are getting. I haven’t been\nalive for more than 2 decades but I do know that in the 80s and 90s it wasn’t\nthis bad and regular people actually somewhat stood a chance…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ssaciv/why_do_people_call_the_person_theyre_with_their.json": "It makes sense if someone's gender neutral or none binary, and you're referring\nto them and don't want to direct to them based on their name, but I'm curious as\nto why terms such as \"boyfriend\" and \"girlfriend\" or \"husband\" and \"Wife\" are\nbeing fazed out. When someone saids their partner, I…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ssk97n/why_arent_cops_held_to_a_higher_standard_police.json": "I guess I just don't understand why cops have extra leeway instead of stricter\nstandards.\n\nThe only similar institution (the military) literally has its own legal code,\nwhich makes military members subject to twice the amount of laws.\n\nIf the powers that be thought that we don't want military…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/sso8jy/why_do_so_many_people_feel_like_they_have_to_be.json": "Not just at a party or bar setting. But even even a small group gathering or\nhanging out with friends.",
  "data/reddit-ask/r/NoStupidQuestions/comments/ssoq17/why_do_progressives_often_use_sexuality_and_penis.json": "Saw it all the time with Trump, for example. Gay art of him and Putin, talking\nabout how small his dick must be. The point isn't whether Trump deserves to get\nmade fun of (he does), the point is the weird double standard of using gential\nsize and sexual orientation as attack points. Always seemed…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/sskny7/if_you_try_to_fart_while_scuba_diving_real_deep.json": "I can understand that if you're in a normal residential pool, there isn't much\nwater pressure. So your farts can overcome the water pressure and release. But\nif you are scuba diving 40-50 ft under water, and you tried to fart, that's\naround 20 PSI. No way you can generate that kind of pressure…",
  "data/reddit-ask/r/NoStupidQuestions/comments/ssnap4/why_isnt_there_a_mark_as_unread_option_for_text.json": "I can’t be the only person that consistently reads texts throughout the day,\ndoesn’t have time to reply, and inevitably forgets to respond. I do this often\nwith emails as well, but I mark them as “unread” and normally respond later when\nI see it again. Is there a setting you can turn on to do this…",
  "data/reddit-ask/r/AskWomen/comments/ssre5j/women_of_reddit_do_you_ever_wish_you_were_taller.json": "Title",
  "data/reddit-ask/r/AskWomen/comments/ssv7vx/26_of_men_are_celibate_and_the_number_is_getting.json": "Edit: women are also on the rise of not having sex/relationships",
  "data/reddit-ask/r/AskHistorians/comments/ssvi1y/why_did_japanese_nobility_abandon_the_spoon.json": "I know, pretty dull thing to wonder about. But I was thinking about how Koreans\nstill use the Tang Dynasty combination of the chopstick and spoon, and Korean\ncuisine and table manners evolved alongside spoon usage (ex. So many soups, the\nbowl mustn’t be lifted from the table) and I thought about…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/st1mm1/my_wife_wants_to_know_why_do_i_like_my_friends.json": "Let me explain. My wife recently confided in me that she feels sad that she\n\"doesn't make me happy like my friends do\". And I don't have a good explanation\nfor her. I tell her there's no comparison and try to build her confidence. But\nit doesn't seem to help.\n\nTruth is, I am much more outgoing…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/st2h2j/why_is_no_one_in_america_fighting_for_a_good.json": "I live in Germany and we have a good healthcare. But I don't understand how\nAmerica tried it and removed it.(okay trump...) In this Situation with covid I\ncant imagine how much it costs to be supplied with oxigen in the worst case.\n\n+",
  "data/reddit-ask/r/askscience/comments/ssznl6/when_the_heart_beats_faster_the_contractions_are.json": "One of my students asked this the other week, and it triggered an intense debate\nin the classroom. Either answer feels fairly credible! I promised I'd try to\nlook it up, but Google hasn't been very helpful, and a family member who's a\nmedical doctor also wasn't completely sure.\n\nIt seems to me that…",
  "data/reddit-ask/r/AskHistorians/comments/st1yeb/why_is_word_synagogue_in_greek_and_not_in_hebrew.json": "I just realized that the word “Synagogue” is from Greek, and not Hebrew. I find\nthis choice weird, since the term refers to Jewish place of worship. Was this\nterm used because Greek was the lingua franca of the ancient period?\n\nAlso, was there any attempt at changing the term in modern times?",
  "data/reddit-ask/r/AskHistorians/comments/ssw2z9/why_was_the_kkk_so_successful_in_indiana_of_all.json": "Reading about the KKK in the 1920s, I notice that Indiana is consistently\nappearing everywhere. Some material even states that 10% of Indiana's population\nwas in the Klan. So what's the deal with that? How did a northern state that\nremained solidly loyal to the Union end up becoming a KKK hotbed? I…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/st01bb/why_are_fleshlights_so_ostracized.json": "Why is there such a difference between how accepted it is for a woman to own a\ndildo to how it is for a man to own a fleshlight?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/st702r/is_anyone_in_their_late_20s_and_still_nervous_as.json": "I applied for a job a week ago and just got a call that they want to hire me and\nI was nervous as hell on the phone. Almost embarassingly nervous. Is there\nanyone else who is like this? I feel like I should be fine with phone calls by\nnow especially because it's a shitty job with shitty pay and…",
  "data/reddit-ask/r/NoStupidQuestions/comments/st83sv/why_dont_prolife_people_only_have_sex_with_those.json": "So it's basically that, if certain men don't think women should have the choice\nto abort for moral reasons or whatever other reason.... Why are they not\nexclusively dating women that believe the same thing? Idk it seems like a simple\nsolution that would make sense...\n\nEdit: I'm referring more to…",
  "data/reddit-ask/r/NoStupidQuestions/comments/st081d/if_jesus_died_for_our_sins_why_are_we_still.json": "Edit: just to clarify, I’m not actually particularly religious I’ve just always\nwondered that if Jesus ‘died for our sins’ then why do sinners get punished?",
  "data/reddit-ask/r/askscience/comments/st5sbn/why_does_the_immune_system_specifically_attack.json": "Why doesn’t it attack (for example) the stomach or the thigh?\n\nEdit: thanks for your answers!",
  "data/reddit-ask/r/NoStupidQuestions/comments/st2i1h/what_does_outer_space_sound_like.json": "How can sound travel in space? Are there echoes? If two asteroids collide into\neach other, how can it be heard? And how far does that sound travel?",
  "data/reddit-ask/r/NoStupidQuestions/comments/ssqh55/whats_the_appeal_of_alcohol.json": "I don't get it. It tastes terrible, and being drunk doesn't sound so fun. Why do\npeople like alcohol?",
  "data/reddit-ask/r/NoStupidQuestions/comments/st7x6a/i_am_a_heterosexual_woman_but_watching_porn_made.json": "When I was a teenager I used to enjoy watching boys. I used to love fantasizing\nabout men. When I first started watching porn years ago I remember enjoying\nwatching men. But this oversexualing woman habit of porn industry fucked my\nbrains sexual orientation. Now I masturbate to women and I can only…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/stbvts/should_it_be_socially_acceptable_for_a_woman_to.json": "I seen a few videos pop up on different social media sites and the comments are\nalways split down the middle, people praising her for having her breast out in\npublic feeding her baby and those chastising her for having her breast out in\npublic. What are your thoughts?",
  "data/reddit-ask/r/NoStupidQuestions/comments/stbuwv/why_can_teenagers_buy_condoms_but_not_sex_toys.json": "Why can I buy condoms to have sex but can’t buy a dildo to enjoy in the privacy\nof my own home? All I hear is adults preach abstinence yet we can’t buy toys to\nmastrubate with instead fucking. Guess I’m stuck with a hairbrush.",
  "data/reddit-ask/r/AskHistorians/comments/st8iab/lethal_weapon_2_explicitly_has_apartheid_south.json": "I was struck while watching Lethal Weapon 2 for the first time the other day by\nhow much I enjoyed that aspect of the film’s antagonists, feeling like a very\nunique element to the film. Yet, Apartheid wasn’t quite over by that point in\ntime (from what I understand).\n\nThus, this prominent…",
  "data/reddit-ask/r/AskWomen/comments/st20vn/women_who_grew_up_with_an_angry_father_how_did.json": "Did your mum and dad divorce or did they stay together?\n\nDid your mental health suffer as a result of the anger growing up?\n\nHow are you doing now?\n\nDo you speak to your father?",
  "data/reddit-ask/r/AskHistorians/comments/sthaok/why_does_the_song_of_roland_have_such_a_weird.json": "Apologies if this belongs to another subreddit, I couldn't find 'AskHumanities'\nor anything similar.\n\nI just read the Song of Roland, and while it was very enjoyable (especially the\nbattle scenes with all their bravado), it ended abruptly for no clear reason.\nAfter punishing Ganelon, Charles the…",
  "data/reddit-ask/r/AskWomen/comments/st7sjg/women_in_therapy_what_sort_of_questions_should.json": "Pretty much like the title says. Feel free to include green flags/red flags from\nyour own experiences in finding the right fit of a therapist as well.",
  "data/reddit-ask/r/AskHistorians/comments/sszn0d/how_much_of_julius_caesar_and_octavians_life_is.json": "Julius Caesar is often portrayed as a polymath genius. I mean, obviously,\neveryone knows that the primary source of the Gallic wars, \"Commentarii de Bello\nGallico\" is propaganda; it was written by him as an explicit endorsement of\nhimself as a politician. But in all the popular history I've read,…",
  "data/reddit-ask/r/askphilosophy/comments/st2y9a/what_jobs_can_a_philosophy_college_student_can_get.json": "I'm looking for options of jobs that make some kind of money, it doesn't need to\nbe much\n\nbut the only thing I can think of is YouTube, any help?",
  "data/reddit-ask/r/AskHistorians/comments/sterwl/im_reading_about_the_aztecs_and_the_maya_and_it.json": "What makes me come up with this question is the realization that, in most\nsocieties, dead is something that people try to avoid at all costs, especially\nfor their loved ones.\n\nIt seems to me (I may be wrong) that in Mesoamerican societies, people didn't\nconsider ending one another's life was wrong,…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/sts3cr/when_will_india_be_held_responsible_for_their.json": "Individual people on YouTube have done more for people against India scam call\ncenters than our own governments.\n\nScam call centers are stealing money from our most vulnerable citizens and\ndestroying generational wealth.\n\nAt this point, scam call centers are “legitimate careers” for some people…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/stkzjg/how_do_i_know_if_a_girl_is_hitting_on_me_or_just.json": "This is honestly a question I’d never say aloud because I know how ridiculous it\nsounds but I’m so unfamiliar with flirting with another woman. Women often\ncompliment each other on appearance while men reserve those types compliments\nfor making a move. I am attracted to women but because sexuality…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/stpjvs/whats_wrong_with_this_picture.json": "So like 30 years ago, my white ass cousin dressed like his idol, Michael Jordan,\nfor Halloween. Black face, black arms, and black legs. It was a project. He\nspent hours getting ready. And he did it to honor the great Jordan. We all\nthought it was cool as hell. After all, we played basketball at my…",
  "data/reddit-ask/r/NoStupidQuestions/comments/stoiez/my_wife_always_farts_when_she_orgasms_how_can_it.json": "Just before her climax there’s usually 2 or 3 farts in rapid succession. I’ve\nhad some pretty nasty experiences with this:\n\nOne time I was eating her out and she farted directly into my nose, totally\nruined the vibe for me.\n\nAnother time I knew it was coming and tried to plug it with my finger and…",
  "data/reddit-ask/r/askscience/comments/st9nvw/what_is_in_the_bladder_when_the_urine_is_out.json": "I mean, when the urine is out, there has to be some atmosphere in it, otherwise\nthere would some form of vacuum. Is this regular air? Or some gas our bodies\nmake? And how does it get in?",
  "data/reddit-ask/r/NoStupidQuestions/comments/stuclm/does_it_make_you_uneasy_when_people_use_your_name.json": "Whenever people use my name in a conversation too much, I get an uncomfortable\nfeeling. It's the worst when I'm having a one-on-one conversation with somebody.\nI don't see the reason why they have to use my name if i'm the only other person\nin the room. It feels somewhat insincere.\n\nDoes anybody…",
  "data/reddit-ask/r/askscience/comments/stvawi/how_can_recombination_happens_between_2_covid.json": "I can understand how recombination can happen very easily in influenza since\ntheir genome is segmented, but how is recombination possible for covid, which is\nsingle stranded",
  "data/reddit-ask/r/AskHistorians/comments/stvgah/in_1927_chiang_kaishek_boiled_hundreds_of.json": "Taken from his insightful essay Notes on Nationalism\n[https://www.orwellfoundation.com/the-orwell-foundation/orwell/essays-and-other-works/notes-on-nationalism/].\nA quick Google search brought up the Shanghai massacre, but no reference to\n\"boiling people alive\"—which would be extremely unworthy…",
  "data/reddit-ask/r/NoStupidQuestions/comments/stxfo8/is_referring_to_japanese_people_as_japs_racist.json": "I work as an engineer and we use a lot of Japanese parts. One of the older\nengineers will always say go to the Japs whenever we need parts. It got me\nthinking if this is something that would be offensive. I asked him and he\ndoesn't think so as people refer to him (collectively) as Brits or Scots,…",
  "data/reddit-ask/r/NoStupidQuestions/comments/stwy74/a_friend_of_mine_is_asking_me_to_refund_his.json": "Alright, so let me give you all some context. I'm a young person who loves &\nmakes music. About a month ago, I got invited to sing at a friend's party. He\noffered me a very reasonable price as I had to rent some professional gear\n(including lighting, audio, a sound card...) from a guy who's known…",
  "data/reddit-ask/r/AskHistorians/comments/stz4d1/why_was_evolution_considered_so_radical_when_dogs.json": "Surely the idea wasn't that much of a shock considering dog breeding",
  "data/reddit-ask/r/NoStupidQuestions/comments/su044l/can_i_bring_a_dildo_into_egypt.json": "Hello,\n\nI'm flying into the Cairo airport. I want to bring a dildo with me. I will also\nhave birth control and spermicide. Is this going to be an issue? I'm okay with\nit being tossed, but I don't want to face legal trouble or be denied entry.\n\nAnyone have experience with this?",
  "data/reddit-ask/r/askscience/comments/stv0js/how_does_stretching_actually_make_the_body_more.json": "I recently started kickboxing and I'm extremely stiff. However, my legs are\ngradually becoming more flexible and i find the process fascinating!",
  "data/reddit-ask/r/NoStupidQuestions/comments/su1n5j/wheres_the_askreddit_for_grownups_i_cant_be_the.json": "I'm tired of all the joke questions, like:\n\"People who don't use your blinkers, why are you evil?\"\n\nI'm tired of all the absolutely stupid ones, like:\n\"You've been transported six feet to your left, how fucked are you?\"\n\nI'm tired of all the sex-related questions that you just know came from…",
  "data/reddit-ask/r/askphilosophy/comments/sttjr2/which_philosophers_were_bad_people_in_real_life.json": "Recently I have started to think about the personal shortcomings of Heidegger\nand his concerning affiliations with Hitler and it got me thinking about which\nother philosophers share a dark past!\n\nSo what you got askphilosophy?",
  "data/reddit-ask/r/AskHistorians/comments/stwdos/were_there_any_byzantine_folklore.json": "In ancient Greece, there were tons of creatures like harpies, sirens, erinyes,\ncyclopes, etc. Did this tradition continue in Byzantium? Were there myths and\nstories involving monsters? If yes, were these monsters new or did the people\nreuse ancient mythological creatures?\n\nThe only instance of a…",
  "data/reddit-ask/r/AskHistorians/comments/su5uwg/why_do_so_many_traditional_childrens_toys_and.json": "The traditional look of many toys and characters from the past are now often\nviewed as creepy and some have even entered in to our modern popular culture as\nfigures of horror. Clowns, jack in boxes, porcelain dolls, puppets,\nventriloquist dummies and even animals such as tambourine monkeys, teddy…",
  "data/reddit-ask/r/NoStupidQuestions/comments/su9cqg/why_do_so_many_people_think_its_wholesome_to_see.json": "I’m mentally disabled and I feel like a lot of people often see us as incapable\nof many things, then when you see someone with Down’s syndrome, for example,\nhaving a job or in a relationship, people see it as wholesome, when it shouldn’t\nbe. It should just be seen as normal people in normal people…",
  "data/reddit-ask/r/AskHistorians/comments/sug6u8/why_did_we_stop_putting_gargoyles_on_buildings.json": "And why did we put them up in the first place?\n\nThey're cool.",
  "data/reddit-ask/r/askscience/comments/suefit/what_does_cooking_dynamite_into_grease_mean.json": "Big fan of Prohibition-era non-fiction and in a memoir I read of a safecracker,\nhe talks of the explosives -- aka \"grease\" -- he would use to open safes:\n\n\"Shooting a box is real touchy because the grease that you're using is cooked\nout of dynamite and it's not the same consistency as nitroglycerin…",
  "data/reddit-ask/r/NoStupidQuestions/comments/sumj3i/i_completely_lost_my_cool_last_night_at_a.json": "I got a burger on my way home from work last night, and when I got home I\nnoticed, it didn't have any patty on it. I was livid, since I had a long day at\nwork and I drove back to the restaurant. I banged on the counter and the\nmanager, who couldn't have been older then 19 or 20, came out. I slammed…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/sunbda/why_are_night_owlspeople_who_sleepin_considered.json": "Like I work 34-40 hours a week just like everyone else, and I pay my bills and I\ngo to the gym after work. But sleeping in until 10 or 11 (my shifts start around\nnoon) makes my family see me as lazy or unmotivated.",
  "data/reddit-ask/r/NoStupidQuestions/comments/suoj51/is_kids_and_teens_saying_i_love_you_to_their.json": "I live in Northern Europe. Here \"I love you\" is something that lovers say to\neach other. Or very small children to their parents and vice versa.\n\nTeens saying \"I love you\" to their parents? Not a chance.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/suq770/do_you_pee_in_the_shower.json": "I mean, the water is running, the drain goes to the same place, is it really\nthat big a deal? Do people really get out of the shower and then piss?",
  "data/reddit-ask/r/askscience/comments/sunx0p/does_leaving_water_in_the_kettle_accelerate_the.json": "Our kettle is building up limescales very fast due to the hard water.\nThe question is if leaving remaining water in it is considerably accelerating\nthe process. Residual water will slowly evaporate and leave it behind.\n\nOn the other hand, temperature decreases the soluibility…",
  "data/reddit-ask/r/AskHistorians/comments/sut84h/in_an_episode_of_the_simpsons_bart_drinks_a_lot.json": "In The Simpsons episode Miracle on Evergreen Terrace, Marge has confiscated\neveryone's alarm clocks so that no one can be up early and get a head start on\nopening presents. Bart drinks 12 glasses of water so that his bladder will wake\nhim up early. Lisa accuses him of stealing this idea, saying…",
  "data/reddit-ask/r/NoStupidQuestions/comments/suv3jt/are_we_technically_beef_like_is_my_meat_similar.json": "Edit: men are pigs, confirmed",
  "data/reddit-ask/r/NoStupidQuestions/comments/suxemy/how_do_95_workers_have_time_to_go_to_businesses.json": "I'm about to graduate and work 50 hours a week on average, and I'm confused\nabout how I'm supposed to schedule other errands. The doctor's/mechanic\nshops/banks are mostly open from 9-5. How the hell am I supposed to visit these\nbusinesses if I'm working when they are operating?\n\nEven if they do…",
  "data/reddit-ask/r/AskWomen/comments/suyenk/older_women_what_are_some_underrated_ways_to_take.json": "Aside from the usual “eat right and exercise” (although that’s important!).\nThanks",
  "data/reddit-ask/r/AskHistorians/comments/sutmih/is_there_evidence_that_parts_of_the_christian.json": "First and foremost, this question is from a purely historical standpoint and not\nmeant to theologically criticize, challenge, or downplay Christianity, Judaism,\nor religion as a whole.\n\nIt's my understanding that:\n\n * the Bible has contradictions\n * parts of the Bible were written many years after…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/sv6jp5/do_female_dental_hygienists_know_that_when_youre.json": "Every single time I’ve been to the dentist for a teeth cleaning, every hygienist\nI’ve ever had (all women) have their boobs resting or pushing into the top of my\nhead. I’m not complaining, but I’m just wondering if y’all are aware you do this\nand if it’s unavoidable in order to get close enough to…",
  "data/reddit-ask/r/AskHistorians/comments/sux9jd/lets_say_im_a_wealthy_but_otherwise_average.json": "While not really pertinent to the historical question, for additional context,\nlet's also say that I need to transmit this burst of electricity to a vehicle\nmoving at a relatively high rate of speed, say -- for the sake of argument -- 88\nmiles per hour.\n\nAnd let's leave out a bolt of lightning as…",
  "data/reddit-ask/r/askscience/comments/suq4no/why_do_levels_of_procalcitonin_increase_during_a.json": "I know it rises because of the inflammatory response, but it doesn't lead to\nmore calcitonin or decrease blood calcium levels. So what is it doing?",
  "data/reddit-ask/r/askscience/comments/sv4td2/are_there_any_invasive_species_that_originate.json": "We hear all about the invasive species in the land down under; from its toxic\ncane toads to its out of control rabbit populations, but is there any plants or\nanimals from Australia that are invasive anywhere else in the world?",
  "data/reddit-ask/r/askphilosophy/comments/suohsi/does_philosophy_need_to_be_difficult_to_read_what.json": "Philosophers and philosophy students, as well as fans beyond the academy have\nplenty of hot takes about 'good' and 'bad' writing in philosophy. I am familiar\nwith informal debates over whether Derrida needed to be so convoluted in his\nwriting, or allegations about Foucault 'intentionally' putting…",
  "data/reddit-ask/r/askscience/comments/sv4i7e/geology_the_polar_wander_hypothesis_was_debunked.json": "My textbook says\n\n> As paleomagnetists sampled and measured older and older rocks, their results\n> seemed to show that the north magnetic pole was far from the modern pole and\n> appeared to wander through time. This was called the “polar wander hypothesis”\n> at first. But then they ran into a…",
  "data/reddit-ask/r/NoStupidQuestions/comments/sve95k/is_it_not_super_disrespectful_to_open_egyptian.json": "These people were laid to rest, but here we come along to dig them up and also\ndisplay their dead body to the world....why are we still doing this, and why\nhasn't cancel culture latched on to this?",
  "data/reddit-ask/r/AskWomen/comments/sv8nx0/what_is_something_that_youve_come_to_realize_is.json": "What is something that you previously hadn't questioned, but then came to\nrealize was loaded with misogyny?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/svggcb/why_is_nudity_classified_as_18.json": "Why is nudity seen as very problematic to younger audiences, when things such as\nviolence and gore are sometimes 12+. Violence can go as low as 7+. Violence is\nway more harmful to society and children than tits. How is seeing a pair of\ntitties more harmful to society when violence is a source of…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/sv5c3e/how_do_you_cope_with_watching_your_parents_get.json": "Going through alot but my mother's health is going downhill and there's nothing\nI can do. She's getting older as she's almost 60.\n\nI tried to just accept but I'm having a hard time knowing it'll probably get\nworse as she gets older.\n\nShe's the only parent I've ever had....",
  "data/reddit-ask/r/NoStupidQuestions/comments/svgyet/are_essential_oils_a_scam.json": "My girlfriend has this peppermint oil and whenever she gets a headache she uses\nit, she always feels better after",
  "data/reddit-ask/r/TooAfraidToAsk/comments/svbddi/do_you_also_get_paranoid_that_people_can_read.json": "Thing*\n\nETA: It’s not all the time. For example, you start randomly thinking about\nsomething really embarrassing or inappropriate and right after you’re kinda like\n“Gee that would be really embarrassing if somebody could tell what I was\nthinking…” and then you just kinda ponder on if somebody could…",
  "data/reddit-ask/r/NoStupidQuestions/comments/svm9wx/is_it_possible_to_be_projesus_but_antichristianity.json": "Have had conflicting views on this lately as I truly think Jesus is a beacon of\nall the good tenants one should strive for when caring about your fellow man and\nbeing a worthwhile person to society… but I don’t see those exemplified by any\nChristians I know.\n\nThey tend to demonstrate judgment,…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/svifyq/could_a_true_hermaphrodite_orgasm_from_both.json": "If their genitals were somewhat perfectly developed, in the sense that they were\nboth fully functional, would it then be possible for a hermaphrodite to orgasm\nboth vaginally and from their penis at the same time?",
  "data/reddit-ask/r/askscience/comments/svg9he/does_the_auditory_nerves_activate_when_we_hear.json": "I was wondering whether the nerves that are firing when we process sound\nactivated, when we \"hear\" sound in our mind. Same could be asked for\nvisualizations.",
  "data/reddit-ask/r/AskHistorians/comments/svmnh6/my_partner_is_curious_about_her_african_ancestry.json": "Former history major here, but I only had one course covering pre-colonial\nAfrica. With the lack of written sources, and the diversity of the continent, I\nknow how hard it is to make any kind of broad claims about West African\nmythologies. Any recommendations are welcome!",
  "data/reddit-ask/r/TooAfraidToAsk/comments/svkkba/men_do_you_ever_get_tiredbored_of_seeing_sexual.json": "Sure, we all appreciate seeing a person we find very attractive and we may all\nhave indulged in some sort of self pleasure as a result, however, outside of\nthese fleeting moments, do you ever find yourself getting bored/tired of seeing\nsexual content all the time in your every day browsing?\n\nOf…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/svnlc6/you_ejaculated_in_swimming_pool_and_it_travels.json": "Edit: It’s a pure water free of chemicals and the temperature quite suitable for\nthe sperm to survive for few minutes.",
  "data/reddit-ask/r/askscience/comments/svgb55/how_does_the_immune_system_work_outside_the.json": "I know we have white blood cells and other immune cells floating around in our\nbloodstream that attack pathogens, but how do our bodies fight infections that\noccur outside the blood vessels?",
  "data/reddit-ask/r/AskHistorians/comments/svodlo/in_1956_the_soviet_union_crushed_the_hungarian.json": "The Hungarian Revolution was a \"harder\" revolution, in the sense of overthrowing\nthe government and desiring to leave the Soviet sphere of influence completely.\nYet about 30,000 Soviet troops and KGB agents were able to suppress the revolt,\ninflicting massive casualties (over 3,000).\n\nBy…",
  "data/reddit-ask/r/AskWomen/comments/svplh4/what_are_some_little_luxuries_that_you_have.json": "I try and get some flowers for my house every other week and I have started\nsplurging out on a very nice smelling fabric softener.",
  "data/reddit-ask/r/NoStupidQuestions/comments/svqejw/why_do_they_try_to_make_vegetarian_options_taste.json": "All the time I see things like, \"tastes like real beef!\", or \"tastes like\nbacon!\" I get that some people go vegetarian for health reasons, are they\ntargeting them? It would just seem odd to me that moral vegetarians would go for\nsomething like, \"tastes like a dead animal!\", or am I the only one who…",
  "data/reddit-ask/r/askscience/comments/svo7y5/how_does_drinking_water_immediately_invoke_a.json": "Since the renin-angiotensin system that triggers the thirst response occurs in\nthe kidneys and would probably take a while to react to increased water, is\nthere some kind of sensor in the stomach or something that lets your body know\nthat water is on the way?",
  "data/reddit-ask/r/NoStupidQuestions/comments/svtq6e/why_do_people_think_democrats_control_gas_prices.json": "I read through the rules but, nevertheless, sorry if I miss understood and this\nisnt allowed here.\n\nAnyways, I see a lot of people always hating on democrats or Biden or whatever\nwhen gas prices start rising?\n\nThe only thing i can ever really think of is that they believe that the\ndemocrats are…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/svtod0/do_penises_have_tastes.json": "Like does every penis have a unique taste or do all of them taste the same?",
  "data/reddit-ask/r/AskHistorians/comments/svr8aa/how_did_india_as_a_highly_literate_and.json": "I've been struggling to read about the colonization of india from outside of the\neuropean POV. unlike in America and Africa, India should have a ton of\nindigenous writers and intellectuals relating their perspective during\ncolonization. I'm interested in how they saw the conflict, especially on…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/svvttu/is_it_weird_that_i_feel_tired_after_work_even_if.json": "the other 1% is when I have to run around if there's something need done.\n\nI don't do physically demanding job at all, just sitting and typing away on work\ncomputer, but I almost always went home quite exhausted and drained of all\nmotivations to do anything else besides sleep.\n\nI feel like having…",
  "data/reddit-ask/r/NoStupidQuestions/comments/svqghr/i_just_found_out_i_have_a_child.json": "I am in a serious committed relationship with somebody I am in love with for\nabout a year. My ex from about 5 years ago just contacted me and told me I have\na child that is mine, who is autistic. I took a paternity test and found out the\nchild is mine last night. I am devastated because this is all…",
  "data/reddit-ask/r/NoStupidQuestions/comments/svv4z8/why_do_redditors_reccomend_therapy_for_every.json": "I don't know if this is an American thing or specific to people who use this\nwebsite but every single issue a person faces, redditors always jump to \"get\ntherapy\" why is this? Not everything has to be fixed by paying a therapist to\nlisten to your problems and a lot of people can't afford it, this…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/sw14l2/how_to_prep_for_anal_for_the_first_time.json": "I'm female and want to have anal sex for the first time. Any hygiene tips?\nReading online I've heard about enemas, but also that they're bad for you.",
  "data/reddit-ask/r/NoStupidQuestions/comments/svxeyl/how_do_people_get_fetishes_is_it_from_exposure_ie.json": "Like when you're 12 or whatever do you just suddenly want to bust one out to\nfeet?",
  "data/reddit-ask/r/NoStupidQuestions/comments/sw4g7b/does_it_bother_anyone_when_someone_says_i_hate.json": "I’m a gay Asian male and it just gets on my nerves when people say things like\nthis. People’s justifications are usually of if you’re not a sexist or racist it\nshouldn’t bother you, but people wouldn’t like it if someone said something\nabout a minority group. I don’t think just because they’re a…",
  "data/reddit-ask/r/NoStupidQuestions/comments/svz5cv/why_is_there_an_age_minimum_for_president_but_no.json": "Edit: was wondering what you all would recommend what the age limit would be If\none was put into place or conversely why we shouldn't have one if that's what\nyou side with?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/sw38e1/is_it_unusual_to_not_enjoy_being_sexualized.json": "The vast majority of the time I just don't like being looked at in a sexual way\nor getting any kind of attention like that. I always get accused of being\nasexual because I'm not as sexually driven as most people. I definitely like\nfeeling attractive to someone I'm dating but I don't find joy in…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/sw2lg5/too_wet.json": "I’ve recently begun a new sexual relationship with a guy that well I’m just\ndifferent with. Which is neither here nor there. The main issue is that I get\nwetter than I’ve ever been to the point where it might be an issue. He’s never\nsaid as much or said anything even slightly derogatory to me about…",
  "data/reddit-ask/r/NoStupidQuestions/comments/sw0gia/why_dont_cuts_on_out_butts_get_infected.json": "Like when you scratch too hard or something and you get little tiny cuts/splits\nin the skin why doesn’t it get infected when we go to the bathroom? It doesnt\ntake a rocket scientist to know that if i have a cut on my arm and rub poop on\nit it’s gonna get infected so why doesn’t it happen down…",
  "data/reddit-ask/r/NoStupidQuestions/comments/sw960e/how_is_it_possible_that_some_men_struggle_to_find.json": "This is a very common phenomenon to the point where it’s a well known joke, but\nI just just don’t understand. It is in the same place each time? It doesn’t\nmove? It seems like the kind of thing you could google once and understand. I\nunderstand that every person is different and therefore there are…",
  "data/reddit-ask/r/AskHistorians/comments/sw65g6/the_year_is_1942_and_i_am_a_japaneseamerican.json": "I've read anecdotes about white people who took care of the farms/properties of\ntheir Japanese-American friends and neighbors while they were in the internment\ncamps but I wonder about those who weren't so lucky.\n\n * Is there anything stopping me from rushing to the bank, withdrawing all my\n  …",
  "data/reddit-ask/r/TooAfraidToAsk/comments/sw9r1l/why_cant_we_shut_down_the_world_for_2_weeks_to.json": "Why can't the world just blank out for 2 weeks and solve the covid pandemic? No\nbills, no production, no movement (except those in hospitals and have emergency\nservices still available).\n\nWould a world-wide pause destroy the entire world for that long? Is money a\ndriving force that is keeping the…",
  "data/reddit-ask/r/askscience/comments/sw9478/since_the_placebo_effect_is_a_thing_is_the.json": "Basically, everyone and their brother knows about the placebo effect. I was\nwondering, is there such a thing as a \"reverse placebo effect\"; where you suffer\nmore from a disease due to being more afraid of it?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/sw55ry/why_people_so_obsessed_with_preventing_suicide.json": "For someone to go over the edge and actually try to suicide, they must have\nsuffered a lot in life. Maybe they're in some mess with no way out but no one\ntry to reach out for them to get them out of that suffering. Now that they can\ngo longer go on with it, they decided to end it all.\n\nThis is the…",
  "data/reddit-ask/r/AskWomen/comments/sw5dfr/ladies_what_is_the_sexiest_thing_about_your.json": "Something you find sexy about your partner outside the bedroom that makes you\nwant to take them inside the bedroom. For people in relationships",
  "data/reddit-ask/r/AskHistorians/comments/svupqd/if_the_dutch_bought_the_island_of_manhattan_from.json": "I’ve heard many times about how the Dutch bought Manhattan for an extremely good\nprice. But I also know Wall Street is named for a wall that used to be at that\nlocation that was for protection from Native Americans. But why did they have to\nbuild the wall if the Native Americans had traded away the…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/sw9ff3/why_are_fingernails_attached_to_your_fingers.json": "I never understood this, as I've never really been grossed out by fingernail\nclippings. I found it kinda odd when people were grossed out by them but didn't\nseem to have a similar reaction to people who had long fingernails.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/sw6bhq/why_do_people_harm_themselves_when_depressed.json": "I really don’t mean this in an offensive way but I genuinely don’t understand.\nPeople with depression harm themselves on purpose, like why? I’m genuinely\ncurious on why you would cut yourself just to hurt yourself. I’ve obviously\nnever been depressed so that’s why I don’t understand but I really…",
  "data/reddit-ask/r/askscience/comments/swct8k/could_a_nut_and_a_bolt_made_of_perfectly_rigid.json": "Lets say we have mathematically perfect, rigid material and you make a nut and a\nbolt out of it - could the two be tightened together?\n\nIm asking because I noticed that good quality nuts and bolts screw into each\nother with little to no resistance and only become tight once maxed out - what\nexactly…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/swns70/why_has_no_one_assassinated_putin_yet.json": "He goes out and about and is a serious threat to world peace and safety. The USA\nhas the techology to do it, we know that. How come they have not taken Putin\nout?",
  "data/reddit-ask/r/AskHistorians/comments/swdwko/what_is_the_origin_of_fishnet_stockings.json": "A quick search in this subreddit yields an 8 year old post without answer.\n\nWiki dates the earliest references of fishnet clothing to a 1900 publication of\nAesop fable story. What is the origin of fishnet stockings? How do fishnet\nstockings become the sexy garment they are today?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/swrh9o/dont_you_hate_the_perm_on_top_style_that_teenage.json": "Holy fuck it looks bad",
  "data/reddit-ask/r/AskHistorians/comments/sws9fw/did_the_us_drop_a_film_unit_ahead_of_the_dday.json": "I found this 1998 LA times article\n[https://www.latimes.com/archives/la-xpm-1998-oct-23-me-35295-story.html] that\nclaims this occurred and the film is lost in government archives.\n\nHere are some excerpts:\n\n> George Hjorth’s orders that June morning 54 years ago were mysterious: After\n> parachuting…",
  "data/reddit-ask/r/AskHistorians/comments/swu5x1/how_did_gendered_languages_come_to_be_who.json": "By gendered languages, I mean languages that have genders for nouns like\nmasculine, feminine, and neutral.\n\nAs someone whose native language is a non gendered language, learning gendered\nlanguages always confuse me. It's very hard to memorize what genders that these\nobjects have, especially since a…",
  "data/reddit-ask/r/AskHistorians/comments/sx02v2/do_historians_who_study_horrific_historical.json": "I am not sure if this is the right category to ask this subject, the reason I'm\nonly asking is because I have finished reading Iris Chang's book on the Nanjing\nMassacre and I read that she suffered from depression as a result of her\nresearch.\n\nI much appreciate everyone's comments and I don't mean…",
  "data/reddit-ask/r/AskHistorians/comments/swzds0/my_school_history_teacher_said_that_the_war.json": "He said that the way the Irish during the Irish War of Independace used small\ngroups of soldiers called flying columns and also didn’t have any uniforms\ninspired Che Guevara in Cuba and the Viet Cong in Vietnam.\n\nI was wondering how true this is seen as he can sometimes make mistakes. During\nWorld…",
  "data/reddit-ask/r/askscience/comments/sx0iva/since_the_suns_upper_atmosphere_is_hotter_than.json": "I assume there are more limiting factors than temperature here - signal\ninterference, high radiation levels, etc.\n\nThe parker solar probe has travelled into the upper atmosphere of the sun which\nis, (to my knowledge) even hotter than the surface.\n\nCould we theoretically create a probe that would…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/sx0y9b/is_it_racistsexist_to_say_you_cant_be_racist.json": "One of my friends said kill all men and I said isn’t that sexist? She said you\ncan’t be sexist towards men. How is saying we need to commit mass genocide not\nsexist.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/sx3mu1/i_was_17_and_he_was_23_was_that_relationship_wrong.json": "So I’m currently 23 the same age as an ex when I was 17. It’s been weighing on\nmy mind how weird and gross it is that someone my age would be interested in\nsomeone in high school…Whenever I look at high school teens, I think of them as\nchildren and have absolutely no interest in them…",
  "data/reddit-ask/r/NoStupidQuestions/comments/sx3d0j/why_do_so_many_guys_think_its_gay_to_masturbate.json": "Holding your dick in your hands doesn't seem any less gay imo.",
  "data/reddit-ask/r/askscience/comments/swsxh4/how_do_testnegative_casecontrol_studies_ensure.json": "In particular, how does one make sure that the vaccine does not simply make\ndetection of the virus more difficult without actually providing increased\nprotection, i.e. you're symptomatic but test negative?",
  "data/reddit-ask/r/AskWomen/comments/sx4eqr/have_you_ever_has_sex_with_someone_you_didnt_like.json": "I'm curious. What were the circumstances? What didn't you like about said\nperson? Was it physical or a personality trait? How'd you get through it? How'd\nyou feel after it was over?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/sx8kat/people_who_ridiculelaugh_at_strangers_for_wearing.json": "We've been at Disney World for the last week and since we have some immune\ncompromised family members, including me, we have been wearing masks even though\nthey're not required. So far I've noticed about 4-5 different people being very\nanimated and exaggerated about acting like they're laughing at…",
  "data/reddit-ask/r/NoStupidQuestions/comments/sx2mti/what_could_cause_my_light_bulbs_to_burn_out_so.json": "I recently (last year) bought a house, and I've noticed my light bulbs burn out\nsuper fast.\n\nWhen I moved in, maybe 70% of the bulbs were out. We got them all sorted\neventually but I feel like I've been changing them about once every 3 months.\nI'm referring to every light in my house- ceiling fans,…",
  "data/reddit-ask/r/NoStupidQuestions/comments/sxa3qt/i_now_have_my_girlfriends_apartment_for_the_next.json": "Edit: I want to do a light hearted prank. Nothing that will cause her to be\nmad/end the relationship.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/sx9327/is_adult_life_just_gradually_hating_the_world.json": "I turned 19 and 20, during the whole covid fiasco, so essentially entered\nadulthood during this. Everyday it just seems like new crap to make me hate the\nworld more, everyone is fighting everyone, and stepping on top of each other to\ntry to reach \"the top\".\n\nThere almost always seems to be this…",
  "data/reddit-ask/r/NoStupidQuestions/comments/sx3z2z/how_could_a_normal_person_become_president_of_the.json": "We grew up being told that it is technically possible, so let's play off of\nthat.\nWhat if it were more viable than it is now. If the country accepted any normal\nperson to try out, what sort of challenges would that person face?\n\nAnd most importantly, how would that person actually run? What happens…",
  "data/reddit-ask/r/NoStupidQuestions/comments/sxb3or/why_do_people_say_weed_isnt_addictive_even_when.json": "Not asking to instigate if it comes off that way. I've witnessed weed\ndependency, and I have a pretty bad reaction to weed myself but I know it's\npretty helpful to others. I don't think it's a cure all though. I've just seen a\nlot of people say something like \"x months sober\" and it's weed, and it…",
  "data/reddit-ask/r/NoStupidQuestions/comments/swzx7x/do_americans_really_eat_ice_cream_by_the_pint.json": "I see all the memes and movies where a character will open a freezer and take a\nmassive carton of ice cream out and just start spooning it down. Is this\nactually common or do most people put it in a bowl?",
  "data/reddit-ask/r/AskWomen/comments/sxcenc/ladies_whats_something_that_wasnt_worth_the_hype.json": "We were all super excited at one point to do xyz thing, so what thing were you\nsuper excited to do that wasnt worth the hype?",
  "data/reddit-ask/r/askphilosophy/comments/swz4jv/why_should_we_study_hard_philosophers_like_hegel.json": "I met up with a friend of mine the other day. I told him I was studying Hegel\nand he scoffed. He has no time for people like Hegel, Heidegger, Deleuze and\nKant, he calls them deadwood. He said they are too up themselves and they are\nnot good writers. He believes that the role of a good writer and…",
  "data/reddit-ask/r/AskHistorians/comments/sxkphg/is_daphne_bridgertons_total_ignorance_regarding.json": "In Bridgerton Daphne, the eldest girl has absolutely no knowledge of what sex\nis, what the penis is, what it does, or how women get pregnant and have\nchildren, even once she is married.\n\nShe isnt shown to be naive- she knows women get a 'reputation' for going into a\nmaze known for hooking up, and…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/sxk61w/how_is_everyone_not_utterly_exhausted_by_life.json": "the world is always falling apart. i’m so tired of everything being bad news.\ni’m so exhausted of life as we know it i just want to sit outside with some\nfruit and a book and not worry about a virus killing my grandparents or WW3\nhappening.",
  "data/reddit-ask/r/AskHistorians/comments/sxfg27/how_do_i_properly_archive_and_store_harry_s.json": "Hi y'all! My pop pop, Milton F Perry, left behind a boat load of unfinished work\nafter his unexpected death 30 years ago. He was the curator for the Truman\nlibrary in independence as well as the Jesse James home.\n\nWe have box after box of his diaries, pictures of the war room during the\ndropping of…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/sxpawi/why_is_it_frowned_upon_for_a_white_person_to_wear.json": "I assume I’m missing something, or am I not drawing the right conclusions.",
  "data/reddit-ask/r/NoStupidQuestions/comments/sxmu9r/is_it_weird_to_go_grocery_shopping_with_a_parent.json": "At the moment I don’t live with my mother, but I do go grocery shopping with her\nwhen she goes. We live close by, and she never knows what to buy since she’s not\ntoo big of a cook and I help her think of ideas or just help her out with the\nhow too-s.\n\nI was told by some friends that that’s a little…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/sxs334/is_a_14_year_old_and_a_18_year_old_dating.json": "Had a girl in class the other day say she wanted to date a senior (she’s 14,\nhe’s 18) and I pretty much told her it’s not okay because their maturity levels\nare WAYY different. She, along with EVERYONE else at the table told me “I’m\nmature for my age, it’s only 4 years, no big deal! My parents have…",
  "data/reddit-ask/r/AskWomen/comments/sxtmml/what_are_some_really_good_things_to_teach.json": "Example: instead of \"don't go with strangers\" give a strict list of trusted\nadults.\n\nAny age, any kind of danger, say whatever useful you've got to say",
  "data/reddit-ask/r/NoStupidQuestions/comments/sxhoz5/i_masturbate_myself_to_sleep_almost_every_night.json": "(throwaway acc)\n\nnot every night, but a lot. i find it hard to go to sleep so i almost always end\nup masturbating and then i just end up falling asleep right after. i feel like\nthere's something wrong with that lol",
  "data/reddit-ask/r/NoStupidQuestions/comments/sxstu1/do_guys_wipe_their_dick_after_peeing.json": "That’s it that’s the question",
  "data/reddit-ask/r/TooAfraidToAsk/comments/sxolza/is_it_just_me_or_the_super_bowl_are_really_too.json": "Being some one from Asia .I knew about American football from American movies\nfor me it never existed before I saw American movies . And do American realize\nit is not the most watched event of the world ?",
  "data/reddit-ask/r/NoStupidQuestions/comments/sxqi5p/do_people_normally_wipe_the_water_off_with_their.json": "My wife thinks this is weird and that no one does this. I honestly never thought\nthat people wouldn't do this, since it stops so much water getting on the\nbathroom mat / floor. Am I the weird one?",
  "data/reddit-ask/r/askscience/comments/sxv6c6/are_dreams_powered_by_the_same_parts_of_the_brain.json": "And are those parts of the brain essentially “writing” your dreams?",
  "data/reddit-ask/r/AskHistorians/comments/sxidcn/have_there_ever_been_any_large_matriarchal.json": "Not just a female ruler, but a society that was more female lead.",
  "data/reddit-ask/r/NoStupidQuestions/comments/sxwas2/why_do_people_drink_alcohol.json": "It tastes bad. You smell awful afterwards. Not to mention the dumb stuff people\ndo after drinking too much. I just don't understand the appeal?",
  "data/reddit-ask/r/NoStupidQuestions/comments/sxtyod/why_do_black_people_in_america_have_a_unique.json": "I am not from the USA and I don't know if this is racist. When Africans were\nbrought from Africa to America, the only accent they heard English being spoken\nwas in the White accent. So eventually, they would start speaking in White\naccent right? Like when Asian kids grow up in America, they pretty…",
  "data/reddit-ask/r/NoStupidQuestions/comments/sxweet/is_it_honest_to_say_that_you_have_read_a_book.json": "I love listening to audiobooks in my free time, it's one of my favorite hobbies!\nThe reason I prefer them to conventional books is because I suffer from\ndyslexia, and reading plain text can get cumbersome on my eyes after extended\nperiods of time.\n\nA friend one time told me that it is not true to…",
  "data/reddit-ask/r/NoStupidQuestions/comments/sxw81l/does_anyone_else_find_the_majority_of_children.json": "EDIT: insufferable is a bit of a strong word, tbh. Difficult or frustrating is a\nmore suitable one.\n\n2ND EDIT: i should probably clarify that i mean the more spoiled and poorly\nbehaved children—which is most, but definitely not all.",
  "data/reddit-ask/r/AskHistorians/comments/sxrpg7/howwhywhen_did_distaste_for_cousinmarriage_arise.json": "In England today, most people find the idea of marrying one's cousin abhorrent,\nwhether they be 1st or 2nd cousins. In fact, many people I've spoken to believe\nthat marrying one's cousin is illegal, though there are currently no laws in\nEngland and Wales forbidding this. Royal families…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/sxxteh/im_15m_and_still_sleep_with_mom_is_it_weird.json": "Is it weird ? I sleep with my mom . I havent slept alone in my life i just turn\nover to the edge of the bed and sleep the thing is we have only one comfortable\nbed in the house and im scared of dark that makes me so angry its my only\nweakness that i dont tell anyone . I am praised by others like im…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/sxhs5d/how_is_angry_sex_a_thing.json": "Only asking because it makes no sense to me. If I'm angry at the person I'm\nsleeping with, why would I want to sleep with them if I'm angry? My mind frame\nis \"You made me angry. Don't touch me. You don't get anything from me right\nnow.\" So how is angry sex even remotely intriguing?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/sy5xsu/im_sure_most_of_you_have_heard_of_toxic.json": "The most recent thing I have heard from women is that some women tell other\nwomen that they aren't \"real women\" if they adopt or otherwise don't experience\npregnancy or vaginal birth.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/sy5bv8/why_does_the_term_for_lgbt_keep_expanding.json": "This might just be might slight speech issues talking, but the term ‘LGBTQIA+’\nis quite a mouthful. Why can’t it just be LGBT+? Also there’s a 2 now\napparently? Why is that? As a bicurious person, I get that everyone wants to be\nrepresented. Buy like, why all the letters?",
  "data/reddit-ask/r/NoStupidQuestions/comments/sxv6rv/was_incest_always_morally_wrong.json": "In no way or form do I support incest, I just want to know if it was always just\nan instinct for people to think \"ew\" if, say, a parent was dating their child,\nor did that crop up somewhere along the way? I know that inbreeding causes shit\nto happen to somebody's genetics but I want to know when…",
  "data/reddit-ask/r/NoStupidQuestions/comments/sy0roi/is_anyone_else_annoyed_by_this_or_am_i_just_a_gen.json": "Everywhere I go now there is always someone around me playing audio on their\nphone's speaker. This is even more consistent in teens like me and pre-teens and\nit is all because of tik tok. Before tik tok there were already things like\nYouTube, Facebook, insta, etc. But even with these it was rare to…",
  "data/reddit-ask/r/NoStupidQuestions/comments/sy8y4m/should_i_consider_girls_who_ask_for_my_zodiac.json": "I do not really believe in astrology but I am not annoyed by it as much as other\npeople are, although it does bother me when some people try to use my sign\nagainst me, like fuck I did not choose it.\n\nHalf my friends say yes.\n\nHalf my friends say no.\n\nSo now I am on this sub.",
  "data/reddit-ask/r/NoStupidQuestions/comments/sy5eu7/is_it_weird_that_i_reuse_my_shower_towels.json": "I was just on Tiktok and saw a video on my fyp about a guy that showed the\nproper way to hang up a towel to dry after taking a shower. Seemed pretty normal\nto me, since I reuse my towels about 2-3 times before washing them. But the\ncomments were full of people being like \"Wait people don't wash…",
  "data/reddit-ask/r/AskWomen/comments/syetcf/what_do_you_think_about_how_strict_this_subs.json": "I feel like whenever I come across a thread it is already locked. The rules are\nso strict I feel they don’t allow conversation or true exploration of the\ntopics. Does anyone else feel this way? I am curious to see how long this post\neven stays up.",
  "data/reddit-ask/r/NoStupidQuestions/comments/syf7ku/why_do_people_lose_there_virginity_at_such_a.json": "I’m 16 and everyone around me has lost there virginity before 16. At this age we\ncan’t even understand what love is yet alone making love. Im 16 and haven’t\ndated anyone and I’m perfectly content like that I don’t want to rush into\nsomething that isn’t for me. I feel at this age your a lot less…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/sy1jji/why_do_some_consider_it_not_racist_for_a_black.json": "Mid-30s, white, liberal, gay male living in a US east coast city here. I ask\nthis knowing full well how controversial and fraught conversations like this can\nbe but I ask earnestly wishing to understand and hear what you all have to say.\n\nI have seen a surprising number of gay dating app profiles…",
  "data/reddit-ask/r/AskHistorians/comments/sxr626/the_condescension_of_lady_catherine_de_burgh_why.json": "In Pride and Prejudice, Mr Darcy spends about 3 weeks visiting Lady Catherine De\nBurgh with Col. Fitzwilliam, who was a great friend of his mother's.\n\nMr Darcy is a man of vast independent means, and it is made clear that while\nLady De Burgh wants him to marry her daughter, he has absolutely no…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/sy8tqb/why_do_we_always_see_drop_dead_gorgeous_girls.json": "I once heard this question asked IRL, but I still can’t wrap my head around why\nthis is.",
  "data/reddit-ask/r/NoStupidQuestions/comments/sygwsw/why_is_reddits_video_player_so_slow_and_bad.json": "Sometimes it'll literally take like 10 seconds just to load a 144p 24 fps video.\nAnd why do videos have to pause when scrolling on browser?",
  "data/reddit-ask/r/askscience/comments/sylwhg/askscience_ama_series_we_are_human_genetics.json": "Hi r/askscience [/r/askscience] and Reddit,\n\nThank you so much for your time and attention! We are scientists from the\nDepartment of Human Genetics at the University Of Miami Miller School Of\nMedicine. Our department is the 2nd largest recipient of NIH funding for\nGenetics Research, and we…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/sydhn5/why_does_anyone_even_like_dj_khaled_all_he_does.json": "Maybe seeing him for the first time at the all star weekend NBA performance was\na bad first impression? But he looks like a spherical chump, he can't sing and\nhe just awkwardly shouts while other people are trying to perform.\n\nIt's like someone's drunk uncle hopped on stage and tried to join in…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/syns5x/tmi_im_just_ugly_upsetchild_fatherlong_time_bf.json": "So, first off,I just joined and first post. Also, I'm sorry if this isn't the\nright place,but I have nobody. Last night went as follows: I shower, we tuck in\nour daughter, then we wait til she's asleep, then we go at it. It's been a few\ndays and I got mine multiple times and when I realized how…",
  "data/reddit-ask/r/NoStupidQuestions/comments/syoed6/how_do_you_politely_tell_a_coworker_that_they.json": "I have a coworker who has a less than pleasant smell. It's really a smell like\none of those habanero jelly beans tastes. We work in a blue collar job, so\nhygiene is a must when it comes to this, especially as it begins to warm up.\n\nHow exactly would I go about telling him that he needs to wash up…",
  "data/reddit-ask/r/AskWomen/comments/syj4qs/what_do_you_think_of_the_argument_that_if_women.json": "It's something I have heard so many times during my lifetime; do you think it is\ntrue?",
  "data/reddit-ask/r/askphilosophy/comments/syigsh/why_do_many_anglo_american_analytic_philosophers.json": "Are they in goid faith like they genuinely don't understand it? It's weird that\nphilosophers of all people almost take pride in their inability to comprehend\nideas Why not studying it harder then until they get it? Or do they just refuse\nto engage seriously with it because they believe its premises…",
  "data/reddit-ask/r/AskHistorians/comments/syn97p/how_did_french_cuisine_become_the_pinnacle_of_all.json": "So you know how if you want to be taken seriously as a chef, or you want to\nbecome a top, top chef, you have to have spent time in France learning from\nFrench chefs, the art of fine dining. Even job titles (sous chef and chef de\npartie as examples) and cooking techniques (confit, sous vide, sauté,…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/syhhao/what_do_girls_think_if_their_boyfriend_say_he.json": "So I was single and horny.\n\nAlthough I didn't wanted to have sex with prostitute but my friends kinda took\nme to the place and now opportunity of having sex was just based on my decision,\neverything was available.\n\nSo moving forward and thinking with my dick I did it.\n\nBut now I'm quite ok with it.…",
  "data/reddit-ask/r/AskHistorians/comments/syt5k3/what_happened_to_the_soviet_pows_who_were.json": "By the end of WW2, the Americans held several Soviet POWs captured by the\nGermans and made to work in the Wehrmacht, mostly in background jobs like cooks\nand drivers. According to wiki:\n\n> Unlike the German prisoners, who were looking forward to release at war's end,\n> the Soviet prisoners urgently…",
  "data/reddit-ask/r/AskWomen/comments/syjy76/do_you_cry_when_youre_angrymidway_through_an.json": "I was discussing this with a friend a few months ago that both of our defaults\nare to cry when we're mad/frustrated. It's annoying, the words stop coming out\nproperly but where does it come from?",
  "data/reddit-ask/r/AskHistorians/comments/sylc1h/why_has_the_us_historically_backed_democratic.json": "Instead of backing anti-authoritarian democratic movements in South America",
  "data/reddit-ask/r/askscience/comments/sypw78/why_are_so_many_materials_opaque_whats_special.json": "Also, why do other EM frequencies outside of visible light go through so many\nmaterials so much more easily?",
  "data/reddit-ask/r/AskHistorians/comments/sywh6l/in_the_arctic_there_are_no_trees_the_inuit_made.json": "Many Inuit societies made use of driftwood because there were no trees in their\nnatural surroundings. Did they think the wood came from the ocean, or did they\nrealize that wood comes from large plants? If so, do we know what they imagined\nabout the lands where those plants grow?",
  "data/reddit-ask/r/NoStupidQuestions/comments/symdj9/how_is_the_average_american_calorie_intake_3600.json": "I'm calling bs on that stat, unless it's going off of imperial calories or\nsomething",
  "data/reddit-ask/r/AskWomen/comments/syerop/how_do_you_feel_about_divacups.json": "Those silicone cups for periods if you haven't heard of them. They're reusable\nup to a few years (or bacterial contamination), cost about $40, and are a\ntampon/pad alternative.\n\nEdit: I intended to use a more generic term for the title, menstrual cup was\nsuggested, please share your fave brand…",
  "data/reddit-ask/r/NoStupidQuestions/comments/sz0und/what_is_the_appeal_in_being_choked_during_sex.json": "I've choked on several pieces of candy as a child and turned blue and all that.\nIt wasn't fun back then and I'm 25 and don't imagine it'd be fun now. I know\nthose are very different scenarios but I simply cannot compute why anyone would\nwant to feel like that, like I get it's a kink but…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/syx0s8/are_there_any_other_black_people_annoyed_by.json": "As a woman of color, I am SO SICK OF \"wokeism.\" I have been black ALL MY LIFE\nand I know what discrimination. I have been called a monkey and the n-word\nduring my formative years. There is something about \"wokeism\" that irritates me\nhonestly. Nothing annoys me more than my white liberal friends…",
  "data/reddit-ask/r/NoStupidQuestions/comments/sypaeq/has_anyone_ever_received_really_important_or.json": "When I was young, my grandmother died, and my mom found out while we were on\nvacation. It was two days remaining before we went home, and rather than end the\nvacation early or tell us, she just kept it to herself, not wanting us to\nassociate this trip with the death of our grandma. I realized I…",
  "data/reddit-ask/r/AskHistorians/comments/syyusu/is_it_true_that_mary_ii_of_england_was_able_to.json": "According to this VICE article on the History of Toplessness\nhttps://www.vice.com/en/article/43gy7n/the-history-of-toplessness, it reports\nthat Mary II allegedly walked out in public with both of her breasts exposed, as\nan example of toplessness being socially acceptable in pre-Enlightenment…",
  "data/reddit-ask/r/NoStupidQuestions/comments/syzvbf/why_has_putin_not_been_assassinated.json": "If almost everyone agrees he's evil, what has stopped some \"Freedom Fighter\"\nfrom attempting to kill him? Is it just purely about self preservation? Is his\nsecurity detail THAT good? Why don't any of these \"evil\" leaders get\nassassinated?\n\nHow about the billionaires that have been branded as…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/sz1se5/should_i_report_my_teacher_for_touching_me.json": "My teacher (Female 67) has been making me very uncomfortable ever since I got to\nmy new high school. She winks at me and me only, she tells me how handsome I am,\ntells me how much she missed me on the days I’m absent. Today was different, she\nwalked up to me and said that we can “talk” privately…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/sz7xve/have_you_ever_had_a_bad_gut_feeling_about_someone.json": "So, I'm in a bit of a pickle right now: I (19F) met a new member of my church\nrecently (late 20'sM, we will call him Adam). I met him 3 weeks ago, and decided\nto welcome him because he seemed lost. He's converting from Catholic to\nOrthodox, and we talked briefly about that. I joked about converting…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/sz8gte/should_hentai_of_underage_women_be_illegal.json": "I was looking for a normal anime show on reddit and stumbled across it's hentai\npage rather, what I saw on there made me think why people are into it and why\nit's not illegal.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/szbu7b/i_like_having_sex_when_im_tipsy_but_im_confused.json": "any help appreciated",
  "data/reddit-ask/r/TooAfraidToAsk/comments/szcwjl/why_do_gay_men_often_have_these_gay_voices.json": "I was wondering why you can very often hear from the sound of a man's voice that\nhe is gay.\n\nThey tend to have that high, soft voice.\n\nIs it because they changed their voices after coming out so people notice they\nare gay? Is it some hormone stuff? Do they actively \"work\" on getting a higher\nsofter…",
  "data/reddit-ask/r/NoStupidQuestions/comments/szd3tq/in_2019_gillette_released_an_ad_about_toxic.json": "Watch the ad first here: https://m.youtube.com/watch?v=UYaY2Kb_PKI\n\nupon rewatching the ad, I can’t figure out why people were so upset with it. It\nseemed like the message was about inspiring change in the ways of how some men\nact, towards women and other men , ie: sexual harassment, bullying…",
  "data/reddit-ask/r/askscience/comments/szfsv6/askscience_ama_series_i_am_kerstin_de_wit_md_and.json": "I am Kerstin de Wit, M.D.\n[https://emergencymed.queensu.ca/faculty-staff/kerstin-de-wit], and my research\ntakes a close look at the psychological distress that can come with a medical\ndiagnosis, specifically after a blood clot diagnosis. In a recent study, half of\nthe patients with a blood clot had…",
  "data/reddit-ask/r/askscience/comments/sz4acf/why_are_you_at_greater_risk_to_suffer_a.json": "I just learned this fact. Why is this?",
  "data/reddit-ask/r/AskHistorians/comments/szfd9q/were_medieval_wild_men_the_equivalent_of_todays.json": "I've been reading \"Dagobert, roi des Francs\" by Maurice Bouvier-Ajam, and I've\nbeen pretty intrigued about his mentions of the medieval \"Wild Men\" communities,\nwho lived in the Old Forests of Merovingian Francia, were barely evangelized and\nhad \"prehistoric\" (author's words) customs and…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/szjrje/why_do_we_condemn_russians_taking_land_but_were.json": "So… based on recent events of Russia and Ukraine, why do we condemn Russians\ntaking land but we’re okay with Israelis doing the same thing to the\nPalestinians?\n\nLike.. is it because they don’t have resources to be of any use? If that’s the\ncase, then Ukraine is a poor and corrupted country.\n\nOr is…",
  "data/reddit-ask/r/AskHistorians/comments/szjgl9/im_chris_kempshall_a_historian_of_first_world_war.json": "Hello r/AskHistorians [https://www.reddit.com/r/AskHistorians/]!\n\nI'm Dr Chris Kempshall and am extremely excited to be doing this! I've got a bit\nof an eclectic background in historical research.\n\nI'm predominantly a historian of the First World War with a particular focus on\nallied relations, a…",
  "data/reddit-ask/r/AskHistorians/comments/szhlo1/why_do_ancient_greeks_always_wear_summer_clothes.json": "I live in Greece but I have never seen any ancient Greek statues or depictions\nwere the portrayed person wears warm clothes for winter.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/szm9ap/dont_transgenders_reinforce_the_idea_of_males.json": "For example, the vast majority of MtF transgenders try their best to look more\n\"feminine\", wear feminine clothes, makeup, use heels, put a makeup, shave the\nwhole beard, act more submissive (this one not everyone), use wig, try to adjust\ntheir voice, and the opposite for FtM transgenders.\n\nIf they…",
  "data/reddit-ask/r/NoStupidQuestions/comments/szmgx0/why_arent_there_any_rightleaning_late_night_shows.json": "(I’m also left leaning, but curious as to why there isn’t anyone on another\nnetwork who does comedy with a right slant. Seems like it would be well seen by\nthat community)",
  "data/reddit-ask/r/NoStupidQuestions/comments/szrg9p/why_do_peoples_unique_scents_always_come_together.json": "All people have their own scent, I get that. You go to someone's house and it\nhas its own distinct scent. But why, when a big group of different people's\nscents intermingle, do they all combine into the same thrift store scent, no\nmatter where you are and what combination of people have donated?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/szrl0b/why_do_so_many_men_complain_about_their_marriage.json": "In so many places I've worked, so many people (Mostly men) complain that their\nmarriage is horrible or say my wife does my head in all the time, She spends all\nmy money, We don't have sex, I barely have time to do anything on my own.\n\nI'm honest about it, I have a happy marriage. My wife is a great…",
  "data/reddit-ask/r/NoStupidQuestions/comments/szvk6i/does_anyone_else_feel_like_they_could_fuck_chucky.json": "That little bastard would be dead in minutes if he tried it. I can’t watch the\nchild’s play films anymore without deeply cringing at the lack of ass whoopin.\nHe’s literally the size of a fucking toddler.",
  "data/reddit-ask/r/AskHistorians/comments/szw52h/did_middleupper_class_english_people_in_the_first.json": "I've been reading a lot of novels, especially Agatha Christie, written between\nthe 1920s and 1960s and set contemporarily with when they were written.\nSomething I have noticed is that characters will often call on each other at\nhome, go out for dinner, etc at 9 or 10pm. To me this seems later in…",
  "data/reddit-ask/r/AskHistorians/comments/szoqm1/why_are_virtually_no_country_flags_purple.json": "I know this is a history subreddit but flags are an important part of history\nimo. Qatar has a burgundyish color and Sri Lanka has a maroon bit but I’d argue\nthat is more red than purple. Was it an unattractive color to people? It’s one\nof the three secondary (subtractive) colors and you see plenty…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/szw545/why_dont_girls_put_the_toilet_seat_down_themselves.json": "This may be only applicable to me. But after I pee I sometimes forget to put the\ntoilet seat down for my girlfriend and she asks me to do it for her. Why is it\nthat women can’t put the toilet seat down themselves. I feel like I’m doing her\na favor but not pissing all over the toilet seat.",
  "data/reddit-ask/r/NoStupidQuestions/comments/szpc3a/is_it_normal_to_have_less_friends_as_you_get_older.json": "In high school i found it much easier to have a friend group and have many\nfriends that i could ask to hang out at any time. Now i (F,21) find it so much\nharder to sustain a group of friends and i have been having really bad anxiety\naround having only a few close friends in my town with more long…",
  "data/reddit-ask/r/NoStupidQuestions/comments/t01eb3/what_are_the_legit_chances_of_ww3nuclear_war.json": "I'm a selfish piece of shit, but ya know I don't want me and my family to end up\ngetting blasted off the face of the earth just bc some old ass dudes wanna\ninvade each other.\n\nCould this Russia/Ukraine thing realistically lead to full on WW3? And will\nthere be nukes? Basically is the world as we…",
  "data/reddit-ask/r/askscience/comments/szcrrh/how_we_will_take_energy_from_future_fusion.json": "So far the pilot experiments are focused on just creating plasma inside the\nchambers. So I think that the energy eventually created by successful tests is\njust lost.\n\nBut are scientists and engineers already thinking on how to extract/convert this\nenergy in future systems?\n\nWill it be through a…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/szyuft/is_there_a_way_to_tastefully_display_tampons_in.json": "Because I have friends stay over sometimes, I keep a box of tampons and pads\naround just in case. But most women I think would probably not expect it, and\nwouldn't think to ask if I have them if they're in need. And it's not like I can\njust announce to everyone who visits that they're there in the…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/szzcj6/why_is_treating_poor_people_with_respect.json": "I can't get over the fact that \"If you cannot afford insulin you probably don't\ndeserve to live\" is a valid opinion in our country. How did it even come to\nthis?",
  "data/reddit-ask/r/askscience/comments/szzdcr/is_it_possible_to_take_the_genetic_material_from.json": "I was thinking, if sperm are essentially vehicles for genetic material to\nfertilize eggs, would it be possible to simply extract the nucleus of an egg and\ninsert it into another egg to make a viable zygote?",
  "data/reddit-ask/r/AskHistorians/comments/t027lg/nations_no_longer_seem_to_formally_declare_war.json": "Obviously, this question is motivated by the current Russian-Ukrainian conflict\n(which I suppose we can't discuss because of the 20 year rule).\n\n--------------------------------------------------------------------------------\n\nIn high school history, we always learn about nations \"formally\"…",
  "data/reddit-ask/r/AskWomen/comments/szutke/how_do_you_work_and_keep_your_house_in_order.json": "In order for instance cleaning rooms, vacuuming, laundry, etc.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/t04t0h/as_a_russian_in_an_emergency_situation_is_there.json": "Really scared right now, I live in the middle of Russia, republic of Udmurtia.\nIs there any way if something happens I can escape? I hate this shithole and\nwish Ukrainian people good lives",
  "data/reddit-ask/r/NoStupidQuestions/comments/t039sg/what_is_the_majority_sentiment_of_the_people_in.json": "Ukrainian President Zelensky's speech before the attack:\n\n\"I have initiated a call today with the president of the Russian Federation. The\nresult - silence. Although silence should be in Donbass.\n\nThat is why today, I want to come with an appeal to all citizens of Russia. Not\nas President. I am…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/t05g5o/im_ukrainian_im_so_afraid_why_is_this_happening.json": "I woke up because my mom called me crying “honey, the war has been started, the\ncities is being bombarding! are u ok?”\n\nEdit: thank you all for supporting, we appreciate that❤️🇺🇦",
  "data/reddit-ask/r/NoStupidQuestions/comments/t03zm2/is_it_normal_to_feel_grief_after_an_abortion_as_a.json": "I know that it’s normal to experience grief and mourning after an abortion or a\nmiscarriage for the mother, but i’m (M18) the father and i’m being made to feel\nlike i’m insensitive and selfish for grieving a baby i never held and never saw,\neven though the fact i never saw it is part of why i’m so…",
  "data/reddit-ask/r/NoStupidQuestions/comments/t070kk/how_would_we_know_if_world_war_iii_has_officially.json": "With the current situation in Ukraine, World War III seems to be creeping right\naround the corner, but what actually marks the start? As a member of the younger\ngeneration, I don't really know what war is like, does it just get announced in\nthe news? Does it come unannounced? Is it happening right…",
  "data/reddit-ask/r/NoStupidQuestions/comments/t0647o/do_dog_actors_know_they_are_acting.json": "Just saw a clip from a movie where an actor was yelling at their dog. Do dogs\nknow its fake and that everyone is acting or do they think the actor is like\nactually yelling at them. I just want to know if the dogs feelings got hurt :(",
  "data/reddit-ask/r/askscience/comments/t09b6b/askscience_ama_series_im_sliman_bensmaia_phd_a.json": "Hi reddit, I'm Sliman Bensmaia! As a neuroscientist, my overall scientific goal\nis to understand how nervous systems give rise to flexible, intelligent\nbehavior. I study this question through the lens of sensory processing: how does\nthe brain process information about our environment to support our…",
  "data/reddit-ask/r/AskHistorians/comments/t06ckf/in_the_early_90s_ukraine_had_the_thirdlargest.json": "Paging u/kochevnik81 [/u/kochevnik81] who provided a really helpful modern\nhistory of Ukraine in response to Putin’s recent speech: see\nhttps://www.reddit.com/r/AskHistorians/comments/sy1kua/vladimir_putin_has_just_claimed_that_modern/",
  "data/reddit-ask/r/NoStupidQuestions/comments/t05s5k/is_there_any_way_to_protect_ones_ears_from_the.json": "My girlfriend is in Ukraine right now. If shit hits the fan, I want her to be\nprepared and have the best chances to make it out with her family.\n\nMy question is one of my concerns right now as she was woken up by the sound of\nplanes and keep seeing how other cities are bombed.",
  "data/reddit-ask/r/askphilosophy/comments/szx6p7/can_you_criticize_abusive_capitalist_companies.json": "Is it hypocritical or logically fallacious to criticize the bad treatment of the\nlabor force by let’s say Amazon and still work for Amazon or purchase items from\nAmazon? Or criticize Facebook while using Facebook? I often hear on social media\nthe argument that if you hate it then why are you using…",
  "data/reddit-ask/r/AskHistorians/comments/t0gj2p/megathread_on_recent_events_in_ukraine.json": "As will no doubt be known to most people reading this, this morning Russia\nlaunched a full-scale invasion of Ukraine. The course of events – and the\nconsequences – remains unclear.\n\nAskHistorians is not a forum for the discussion of current events, and there are\nother places on Reddit where you can…",
  "data/reddit-ask/r/AskReddit/comments/t0em4o/megathread_ukraine_current_events.json": "The purpose of this megathread is to allow the AskReddit community to discuss\nrecent events in Ukraine.\n\nThis megathread is designed to contain all of the discussion about the Ukraine\nconflict into one post. While this thread is up, all other posts that refer to\nthe situation will be removed.",
  "data/reddit-ask/r/NoStupidQuestions/comments/t057q0/my_roommate_coercing_me_to_smoke_weed_because_my.json": "Thank you all - I think this post is more fit for another subreddit, but thanks\nfor the responses either way. I've gotten a diverse range of responses but they\nbasically say similar things, I'll consider all of these. Thanks again.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/t0m3vc/should_a_young_adult_feel_any_shame_to_be_living.json": "I(M22) do my part. I have a job, I conform to the laws of society, I don’t cause\nany trouble or mischief, I get along with my coworkers well. But at the end of\nthe day I’m met with the same empty life at home. No messages, no plans, no\npings, rings, or notifs. I have my pets waiting for me, but…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/t0muaf/are_men_really_that_into_sundresses.json": "For context, I’m a woman, but I always see those ask Reddit posts where people\nask men what their favorite thing to see women wear is or one of their turn ons\nand sundresses is a really popular answer. This is probably a silly question,\nbut is that actually true or is it an in-joke that I’ve…",
  "data/reddit-ask/r/NoStupidQuestions/comments/t0btzm/did_i_ruin_myself_by_looking_up_nude_on_my_works.json": "Yesterday while using the bathroom at work I was scrolling reddit. I came across\na pic if an actress from the early 70’s that was quite attractive. I then\ninstinctively put her name followed by nude in my safari search bar. As soon as\nI pressed enter I realized I was on the work wifi still and…",
  "data/reddit-ask/r/AskWomen/comments/t0diy7/of_the_7_deadly_sins_which_ones_do_you_struggle.json": "Please make sure to expand upon how you struggle with the ones you do! They are:\n\n * pride\n * greed\n * lust\n * envy\n * gluttony\n * wrath\n * sloth",
  "data/reddit-ask/r/NoStupidQuestions/comments/t0pu5f/how_do_leaders_sleep_in_times_of_crisis.json": "I can’t imagine what it must be like to be dealing with something that requires\nyour full attention and decision making capabilities during all hours of the day\nfor days or even weeks.\n\nHow often do leaders get to sleep during crises? Who takes over while they are\naway?",
  "data/reddit-ask/r/NoStupidQuestions/comments/t0rm7a/do_men_just_make_brownies_sometimes.json": "Serious question from my girlfriends and I. At 2am when you’re bored and find\nbrownie mix, do y’all just bake brownies for the hell of it? Put your lil oven\nmitts on and have at it? Cause we do.\n\nI need to know.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/t0pdl8/how_can_i_tell_my_girlfriend_that_i_want_to.json": "Yes, I know this is weird. But at the pandemic I discovered how good is to\norgasm and to listen to upbeat bluegrass right after, I sincerely don't know why\nI like this, as I don't EVER listen to bluegrass in my day-to-day.\nThis worked like a charm before I met my GF. She lives 1600 km away and I…",
  "data/reddit-ask/r/AskWomen/comments/t0sszg/if_you_keep_your_toilet_lid_open_why_if_you_keep.json": "Seems like people have strong opinions as to whether to keep the toilet lid open\nor closed.\n\nNot seeking to do a poll but rather hear people's rationale for their preferred\nconfiguration.\n\nEDIT: so this seems to be a brief summary so far...\n\nClosed toilet rationale:\n\n * hygeine (containing fecal…",
  "data/reddit-ask/r/AskWomen/comments/t10bw1/women_who_post_recipes_and_include_their_entire.json": "I feel like one of you has to be here!! Or at least someone who’s seen this,\nyou’re looking for a recipe to make something tasty, and have to scroll through\na 10 page essay to see the actual ingredients and steps, sooo if you’re someone\nwho does this, why?",
  "data/reddit-ask/r/askphilosophy/comments/t0hmuj/why_is_it_wrong_to_kill_someone_in_this_scenario.json": "Let's assume a hypothetical, ideal situation.\n\nThere is a person (I'll call him a \"he\" but he can be of either gender), who\nlives alone in a secret island far away from all people and animals.\n\nHe has no family or friends (or no one to cry if he dies), and no one dependent\non him. Not even animal…",
  "data/reddit-ask/r/NoStupidQuestions/comments/t0yksj/is_it_stupid_for_a_kid_learning_how_to_read_to.json": "So a friend of mine is a teacher and she is teacher her kids on how to read.\nWhile her kids do have older kids that buddy up with them to help them read. She\nurgred the parents of kids to practice and if any family has pets to have their\nkids practice reading aloud to the pet dog or cat or any…",
  "data/reddit-ask/r/askscience/comments/t0d6rf/does_refraction_happens_between_different_metals.json": "Might be a stupid question but does the wave in which electricity propagates in\nmetals “bend” between two different metals with different conductivity like\nlight does in materials with different refractive indices?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/t0q4n5/is_adult_life_basically_working_and_finding_ways.json": "By killing time I mean whatever the fuck people do to occupy themselves whenever\nthey're not working eg. shitting out kids, partying, drugs, hobbies, going out,\ntravelling, hanging out with friends & family etc. yada yada",
  "data/reddit-ask/r/askscience/comments/t0ux4d/do_aspm_and_microcephalin_genes_really_predict_iq.json": "Hi I was debating an Anglo Saxon racialist on race and IQ and he cited\n\"Linguistic tone is related to the population frequency of the adaptive\nhaplogroups of two brain size genes, ASPM and Microcephalin\" and \"What about the\nASPM gene of chromosome one a new ASPM allele arose in Eurasia and has…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/t1564j/should_i_tell_my_wife_she_is_putting_on_weight.json": "I want to preface by saying I am in love with her mind first and foremost.\n\nHowever, in our X years of marriage, she has regularly vocalized about not\nwanting to become like her mom and letting herself go. I do not give a single\nfuck of a shit if she became noticeably overweight, but I know she…",
  "data/reddit-ask/r/AskHistorians/comments/t10qcw/did_it_help_for_jews_to_convert_to_christianity.json": "I've read that there was a relatively big conversion of Jews to Catholicism\nduring the holocaust. However, I couldn't find many sources that say if that\nhelped the Jews to not be followed/persecuted and to what extent did it help, if\nit even did something. That's why I'm asking here.\n\n\n\nWould…",
  "data/reddit-ask/r/NoStupidQuestions/comments/t14u4p/how_can_anyone_think_of_ben_shapiro_as_anything.json": "Seriously,this guy made a deepfake photoshopped video of himself where he\nphotoshopped fake muscles into a video to look like flexing (look it up not even\njoking this guy actually thought people are gonna get tricked),among other\nthings that seem to be a weak attempt to boost his ego. Why do people…",
  "data/reddit-ask/r/askscience/comments/t16pbo/what_does_the_ba_stand_for_when_talking_about.json": "As in BA.1 and BA.2",
  "data/reddit-ask/r/askscience/comments/t17m72/botany_question_do_flaxseeds_come_from_the_same.json": "I am writing some content (for my job) about flaxseed oil supplements and I'm\ncurious: According to Webster's flaxseeds are \"... the small seed of flax\n(especially Linum usitatissimum) ...\" Is this the same flax plant used to create\nlinen? Or is there more than one type of flax plant? Thanks.",
  "data/reddit-ask/r/NoStupidQuestions/comments/t188d1/why_is_it_socially_acceptable_to_have_a_caffeine.json": "You know what I’m talking about, all you see is the “I love coffee, don’t talk\nto me till I’ve had my coffee, I’m so angry before my morning cup of coffee “\nmemes, but people with other addictions are noticed and usually shamed",
  "data/reddit-ask/r/NoStupidQuestions/comments/t12qhs/women_is_precum_a_turnoff.json": "I produce a ton of pre-cum. I had a one-night-stand last night and my boxers had\nspots with precum and my dick was wet after kissing & touching. I usually need\nto wipe it off when going to the toilet.\n\nIs it a big turn-off?",
  "data/reddit-ask/r/AskHistorians/comments/t16axl/why_do_modern_states_claim_defensive_reasons_for.json": "I don’t imagine that the Vikings or the Kahns of history were “liberating”\nterritory, or “defending” themselves from being attacked first, or claimed that\nbecause they are “victims” they therefore have the right to correct history. Is\nthis kind of language and rational a feature of diplomatic…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/t1eysc/why_do_people_talk_on_speaker_phone_while_walking.json": "Why do we all need to hear both sides of your conversation in the store at top\nvolume?",
  "data/reddit-ask/r/NoStupidQuestions/comments/t18byx/how_does_one_reward_themselves_after_an.json": "Looking to change my incentives",
  "data/reddit-ask/r/NoStupidQuestions/comments/t1bbtv/how_did_women_avoid_utis_after_having_sex_in_the.json": "Seriously. I do the deed, I go pee, I wipe, I make sure it's not overly moist,\nand I still get a damn UTI at best, thrush at worst. How did women in the past\ndealt with this shit ? Did they walk around with fire-crotch all the time ? Get\nkidney failure ? Did they take special herbs ? I NEED TO…",
  "data/reddit-ask/r/NoStupidQuestions/comments/t1kmq2/why_do_some_men_consider_a_womans_vagina_loose_if.json": "The title pretty much says it all. I’ve noticed online lately that some men who\nwill say that a woman’s vagina will get loose (implying she’s a wh*re) and she’s\nnow undesirable because she slept with multiple men. We all know that’s not how\nVaginas work but why do they think this way?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/t1itgu/if_most_reddit_users_are_pro_sex_work_why_do_we.json": "Starting to notice that trend. Especially with lots of young men being\nfrustrated with dating.",
  "data/reddit-ask/r/AskHistorians/comments/t1mco4/why_did_russia_inherit_the_soviet_unions.json": "Was there any discussion about whether the Soviet Union's seat would\nautomatically go to Russia after it dissolved? Is there a mechanism by which a\npermanent seat goes to a successor state for any of the permanent members? If\nthe United Kingdom were to dissolve into Scotland, England, and Wales,…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/t1ic9p/why_do_black_women_paste_curls_to_their_faces.json": "I'm genuinely super curious, please don't take offense to me asking! I feel like\ndiscrimination of all kinds could be entirely avoided if we were free to ask our\nquestions and learn about others💚",
  "data/reddit-ask/r/AskHistorians/comments/t15wcz/former_president_john_tyler_infamously_joined_the.json": "Also, do we specifically know what Lincoln’s reaction was to this?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/t1l70r/did_boomers_really_have_it_better_or_do_people.json": "There’s a general consensus that boomers grew up in the ideal post war economy\nwhere jobs were plentiful and housing was cheap. And they got to reap all the\nrewards while the younger generation got screwed. I was talking to my uncle\nabout this time and he tells me about the Vietnam draft, nuclear…",
  "data/reddit-ask/r/AskWomen/comments/t1msns/if_you_were_to_line_up_all_your_exes_what_would.json": "Edit: this doesn’t necessarily mean physical! Can be anything. If you have no\nexes, it can also simply be the people you have dated",
  "data/reddit-ask/r/TooAfraidToAsk/comments/t1pb3j/can_people_stop_trump_this_and_biden_that_comments.json": "This is Russian-Invasion war. It's not about Trump nor Biden. The world doesn't\nrevolve around you. Get your head out of your rear end. Have some respect.",
  "data/reddit-ask/r/NoStupidQuestions/comments/t1ovk5/does_my_dog_care_when_his_ear_is_inside_out.json": "like, when a dog is itching his ears and one flips inside out so the pink part\nis on the outside and you have to fix it for them. do they actually care? do\nthey appreciate it when you fix it for them? do they even notice?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/t1qojo/why_do_christians_try_to_convert_people_all_the.json": "So for context I work at a gas station and I am a member of The Satanic Temple.\nI wear a ring and necklace with satanic imagery, I even have a \"membership card\"\nin my wallet with the 7 tenets listed on the back\n\nAt work tonight an old man (75 at the youngest) comes in, walks to the counter\nand says…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/t1oppf/why_does_the_us_ignore_george_washington_and_the.json": "In his farewell address, George Washington and a few founding fathers warned the\nUS to- 1. Not to put their regional and sectional interests above the interests\nof the nation as a whole. Regions such as North, South, East and West should see\ntheir common interests rather than their differences.\n\n…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/t1wkig/why_do_men_who_are_afraid_of_getting_someone.json": "So this is on the surface a very obvious question I know, but I keep seeing\nmention of scenarios (on r/relationships [/r/relationships] for example) which\nreference guys talking about being worried about getting sexual partners\npregnant, but still proceeding with sex without female birth control.…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/t1yxnp/how_come_america_is_so_willing_to_give_millions.json": "This isn’t a question of me not wanting to help others, I agree with that help.\nThis is me wondering why can’t that same rationale apply to its own citizens\n\nWhy not both??",
  "data/reddit-ask/r/TooAfraidToAsk/comments/t1v1en/if_a_womanman_chooses_to_sell_their_body_for_sex.json": "People should have a free choice to do what they choose when it comes to their\nown body. I understand that there are many people who are forced into this act,\nwhich is terrible and an abhorrent act by those forcing their hand. But for\nthose who freely choose to sell their body, why face potential…",
  "data/reddit-ask/r/NoStupidQuestions/comments/t1wrch/is_the_only_reason_prostitution_is_illegal.json": "I’ve been told that the only reason it’s illegal is because there’s no way for\nthe government to get themselves a cut of the money, same with drug dealers.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/t1yc33/why_is_the_un_so_useless.json": "Like I genuinely don't get it what do they even do that they get a 3 billion\ndollar budget for peacekeeping? This is in context to the Ukrainian Crisis of\ncourse.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/t1ydsq/how_do_girls_develop_so_fast.json": "Ok I know this sounds weird but hear me out. When I was in 3rd grade, I had a\nfriend who had boobs. I don't mean like perky I mean big, round, developed. One\nday during lunch I decided to ask her why they were so big. Since I'm asking\nthis question here you can probably guess how that went down.",
  "data/reddit-ask/r/NoStupidQuestions/comments/t21xnm/can_i_walk_into_a_movie_theater_just_to_buy.json": "Me and my wife were talking about going to a movie tonight, but there is no\nmovie we want to watch. We do however love movie theater popcorn so would it be\nstupid for us to walk in buy popcorn and then just leave?",
  "data/reddit-ask/r/NoStupidQuestions/comments/t1yz5a/why_is_porn_addiction_much_more_common_in_males.json": "I’m just wondering",
  "data/reddit-ask/r/AskWomen/comments/t1o6fz/ladies_who_have_anxiety_has_it_stopped_or.json": "Additionally how do you manage your anxiety once you got a job and working?",
  "data/reddit-ask/r/askscience/comments/t23v03/how_can_smartwatches_measure_the_blood_pressure.json": "And how accurate is it?",
  "data/reddit-ask/r/AskHistorians/comments/t1vgml/why_did_so_many_prominent_british_soldiers_and.json": "General Charles Gordon, Lord Kitchener, Sir Colin Campbell, Cecil Rhodes and\nT.E. Lawrence were all men who were seemingly celibate. Many on this list were\nrumoured to be homosexuals but while this speculation exists is there any\nparticular reason why there was a noticeable amount of men who…",
  "data/reddit-ask/r/NoStupidQuestions/comments/t1x3wf/why_do_people_say_liberal_arts_degrees_are.json": "According to Bureau of Labor Statistics, the average wage for a person with a\nliberal arts degree is 50k\nhttps://www.bls.gov/ooh/field-of-degree/liberal-arts/mobile/liberal-arts-field-of-degree.htm",
  "data/reddit-ask/r/TooAfraidToAsk/comments/t1x82p/how_do_you_feel_when_you_didnt_get_enough_sleep.json": "I don't understand. People out there who run off less than 8 hours of sleep:\nhow?\n\nWhen I have less than 8 hours, I feel almost incapable of getting through the\nday. I can usually wake up alright, get myself ready and out the door. But I\ngenerally have a crippling headache, and my body usually…",
  "data/reddit-ask/r/AskHistorians/comments/t26avd/what_are_some_good_books_or_articles_on_the.json": "Either\n\n * historically situated works like Edwin Chadwick's Report on the sanitary\n   conditions of the labouring population of Great Britain from 1842\n\n * or, works that covers the history of waste, garbage, and waste management. I\n   would love a world history of this, but I'm happy to read more…",
  "data/reddit-ask/r/AskWomen/comments/t23kvm/how_do_you_feel_and_respond_to_a_significant.json": "I.e. They did normal chores around the house that they would never typically do\nso they deserve to be appreciated with sex.",
  "data/reddit-ask/r/askphilosophy/comments/t1z20a/why_did_existentialism_go_out_of_fashion_in.json": "This is something I've heard ever since I started trying to learn about\nphilosophy. My understanding is that it was hard for Sartre to be taken\nseriously in the Analytic Tradition but it did happen. Only this acceptance was\nfleeting and now it's not just dead it's sort of \"triumphantly dead.\"",
  "data/reddit-ask/r/TooAfraidToAsk/comments/t2ceub/why_cant_we_show_the_same_amount_of_concern_for.json": "Don't get me wrong I'm very concerned about what is happening in the Ukrain and\nwhat it's effect will be for the world order. But there has been war and human\nsuffering in Yemen for years and the world doesn't really seem to care. There is\na genocide going on in China on the Uyghur people and we're…",
  "data/reddit-ask/r/NoStupidQuestions/comments/t23eka/why_hasnt_anyone_invented_a_resealable_chip_bag.json": "I hate hunting down a paperclip or chip clip after I open a bag of chips. A lot\nof times I will move chips to a gallon freezer bag so they'll stay fresh.",
  "data/reddit-ask/r/AskHistorians/comments/t2a1ju/why_are_soldiers_and_spies_treated_differently_in.json": "Hi All,\n\nI've been seeing posts about a group of Russian soldiers who were found dressed\nas Ukrainian soldiers. These posts have noted how these soldiers can be executed\nbecause dressing in an enemy's uniform means that they have given up the\nprotections afforded to soldiers by the Geneva…",
  "data/reddit-ask/r/AskWomen/comments/t29vql/women_who_met_their_partners_through_the_ill_just.json": "Usually the “going with the flow” kinda thing. How did you meet your current\nlong term SO?",
  "data/reddit-ask/r/askscience/comments/t220ez/why_does_quartz_come_in_so_many_different_shapes.json": "I was recently in a museum of natural history, and as I was walking through the\nrocks and minerals section, I noticed that a bunch of seemingly completely\ndifferent crystals were actually one and the same thing: quartz. I was puzzled\nby this, since it seems like there’s only a finite number of ways…",
  "data/reddit-ask/r/AskWomen/comments/t26a4c/which_song_makes_you_feel_like_falling_in_love.json": "It can be a whole song or a couple of lines",
  "data/reddit-ask/r/askscience/comments/t20vz7/does_and_how_does_loss_of_taste_or_smell_due_to.json": "Synesthesia is the condition whereby people experience sensations through other\nsenses. For example, somebody might hear colours or see music.\n\nI’m wondering specifically about people whose senses of taste or smell are\nactivated through other stimuli; if they lose the ability to taste or…",
  "data/reddit-ask/r/NoStupidQuestions/comments/t2akwf/is_there_a_name_for_this_type_of.json": "I live in a very rural and conservative area and I noticed a billboard along the\nhighway that says something along the lines of \"Gun owners belong in jail\" with\na little Democrat donkey symbol in the corner. It looked like a very\nprofessionally done sign..\n\nI thought the sign was kind of odd…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/t2h9eb/can_i_legally_blow_up_a_planet_from_the_solar.json": "Let's say I build a device, or have a supernatural power that allows me to\ncompletely destroy a planet with a giant explosion, would I be charged by the\nlaw if I did that?\n\n\n\nPs: all planets except earth",
  "data/reddit-ask/r/AskHistorians/comments/t2k0k4/was_hunting_accident_code_for_politically.json": "Did Kings of England actually die in hunting accidents? Or was it a case of\nthose fabled woeds: \"okay, here's what we say happened...\"",
  "data/reddit-ask/r/NoStupidQuestions/comments/t2neig/why_is_autism_seen_as_a_childrens_disability_why.json": "As an autistic adult, I find it hard for people to take me seriously. I still\nneed help with some things and I'm working towards becoming more independent\nover time. But before I found the support I need it was quite hard because\nthere's way more resources available for autistic children than…",
  "data/reddit-ask/r/NoStupidQuestions/comments/t2pcos/i_think_i_came_upon_a_case_of_pedophilia.json": "I believe I came upon a case where a family in the US is sexualizing their\ndaughter and probably involving her in sexual acts, she is underage and what I\nhave as proof are the chat logs from reddit, normal selfies.\n\nWhat can I do? is it a good idea to report it to The fbi tips page? Im gonna…"
}