{
  "data/reddit-know/r/YouShouldKnow/comments/qkcxd4/ysk_about_some_online_legit_graduate_programs.json": "Why YSK: Graduate education is fucking expensive, and a big commitment in more\nways than one, so this is a great alternative. It helps that masters degrees\nobtained online have gained a lot more respect since last year.\n\nHere's a few that have caught my eye:\n\nGATech MS CS…",
  "data/reddit-know/r/YouShouldKnow/comments/qksaiy/ysk_that_paying_off_a_bill_thats_already_in.json": "Why YSK: many people believe paying off a collection that’s harming your credit\nclears the debt, so therefore it should logically clear off the bad mark against\nyour credit score too. This is not the case. Whether or not you pay it, once\nsomething is in collections it will stay on your credit for 7…",
  "data/reddit-know/r/YouShouldKnow/comments/ql1h06/ysk_women_dont_view_being_stared_down_as_a.json": "This is not the typical woman vs men post. It's come to my attention many think\nit's a compliment or one should be flattered. Listen I get it, you're super\nhungry you see some amazing food, you stare at it. On a hike, you see a dope\nview, you stare at it. As humans we can't stop being visually…",
  "data/reddit-know/r/YouShouldKnow/comments/ql5kv5/ysk_caffeine_might_be_making_your_life_harder.json": "Why YSK: We tend to forget that caffeine is a psychoactive drug.\n\nJust like anything in life, there’s always a good side and a bad side. However,\nthe problem is that using drugs such as caffeine that have the ability to affect\nthe brain, we mess up our natural brain functions. This becomes a serious…",
  "data/reddit-know/r/YouShouldKnow/comments/ql6dgr/ysk_candy_wrappers_are_not_recyclable.json": "Why YSK:\n\nSingle stream recycling won’t take them. They get confused for paper in sorting\nequipment, and contaminate paper recycling efforts.\n\nWrappers are not the correct type of plastic for plastic film recycling (store\ndrop offs) and the plastic is generally contaminated with food…",
  "data/reddit-know/r/YouShouldKnow/comments/ql8of1/ysk_when_shopping_online_try_using_basic_promo.json": "Why YSK: Many shopping websites have promo codes like these activated for\ncertain shoppers like those in an email subscription or customer loyalty\nprogram. This also works well with those \"spin the wheel for discounts\" after\nentering your email websites. Just find the best promo code on the wheel…",
  "data/reddit-know/r/YouShouldKnow/comments/qlmox1/ysk_thieves_are_using_bluetooth_scanners_to_find.json": "Why YSK? Your car will be less likely to be broken into if there are no\nelectronics like laptops or cell phones transmitting Bluetooth signals.",
  "data/reddit-know/r/YouShouldKnow/comments/qlvogt/ysk_that_some_packingshipping_stores_accept_clean.json": "Why YSK: Giving clean packing material to a store that can reuse it keeps it out\nof the landfill at least once and maybe many times, which benefits us all.",
  "data/reddit-know/r/YouShouldKnow/comments/qlyy34/ysk_that_when_you_upload_images_to_imgur_with_a.json": "Why YSK that this might come in handy when you upload all kind of images. From\nsharing random images of data, screenshots, maps or whatever, but also use it\nfor personal images that you uploaded there, instead of other online storage\nservices, to ensure access in case your device dies on you.\n\nUntil…",
  "data/reddit-know/r/YouShouldKnow/comments/qm1oyy/ysk_visualization_is_great_for_planning.json": "When planning something, it's good to visualize in your mind what you plan to\ndo. Visualize step by step actions that you will take. From this visualization,\nmake contingency plans should something not go according to your visualized\nplan. This way you can create back ups or change plans accordingly…",
  "data/reddit-know/r/YouShouldKnow/comments/qmcco9/ysk_listening_to_music_at_max_volume_will_cause.json": "If you listen to music frequently on maximum volume you will likely go deaf or\npartially deaf.\n\nWhy YSK: the permissible exposure time for 100 decibels is 15 minutes a day.\n\nFor example, Apple AirPods at full volume will go over 100 decibels. They\nrecently added a feature called \"headphone safety\"…",
  "data/reddit-know/r/YouShouldKnow/comments/qmnhu8/ysk_that_when_people_say_theres_a_labor.json": "Why YSK: just for clarification",
  "data/reddit-know/r/YouShouldKnow/comments/qmojd4/ysk_the_word_sentient_does_not_mean_selfawareness.json": "The term sentience is used incorrectly almost ubiquitously in popular media. In\nTV, film, books and video games it is usually used to describe a being as being\nself-aware.\n\ni.e. A self-aware A.I is often described as being \"sentient.\"\n\nHowever the correct usage of the word describes a being that is…",
  "data/reddit-know/r/YouShouldKnow/comments/qmu368/ysk_how_to_use_a_password_manager.json": "These days password managers are the best option for you, in terms of\npracticality and also safety of course.\n\nYou signup for a new website? Credentials can automatically be saved and you can\ngenerate individual, strong, passwords for your accounts. And managers like\nBitwarden even offer stuff like…",
  "data/reddit-know/r/YouShouldKnow/comments/qmucxv/ysk_very_often_technical_schools_that_offer_a.json": "Why YSK: Welders are in demand all over the country. Starting wages can vary by\nquite a bit but if you find yourself in a financial and/or career pinch this\npath could help.\n\nMany people are scared away from a path like this because they didnt grow up\nwith it and they have zero experience but I want…",
  "data/reddit-know/r/YouShouldKnow/comments/qmywp9/ysk_how_to_clean_your_genitals_properly_male_or.json": "Why YSK: Both male and female genitals have areas that need to be cleaned and\nareas that need to be left largely alone. Not cleaning can cause issues,\ninfections, and smelly buildups. Cleaning too much, or in areas best left alone,\ncan also cause issues and infections, and a bunch of other problems…",
  "data/reddit-know/r/YouShouldKnow/comments/qmzhcl/ysk_all_the_right_girlswomen_want_a_nice_guy.json": "Why YSK:\n\nYour male insecurities are based on an artificial concept that doesn’t hold up\nin real life. Probably it is the middle aged experienced me talking, but nobody\nreally cares about your overall appearance if you shower and brush your teeth\nregularly. For life we want a guy who is genuinely…",
  "data/reddit-know/r/YouShouldKnow/comments/qn03us/ysk_sitting_with_your_phone_or_wallet_in_your.json": "Why YSK: Asymmetrical sitting surfaces induced by an objects affects acute\nchanges in spine/pelvis posture, interface pressure.\n\nLink to paper [https://www.tandfonline.com/doi/abs/10.1080/21577323.2014.962712]",
  "data/reddit-know/r/YouShouldKnow/comments/qn491d/ysk_amazon_and_other_online_retailers_reviews_are.json": "Why YSK: If you are not careful while reading the reviews on a product you are\ninterested in, you may be buying an item with bloated reviews to make the item\nlook better.\n\nNot all the reviews are fake in the sense that someone made an account to post\nthe positive review, but in the sense that the…",
  "data/reddit-know/r/YouShouldKnow/comments/qnu4oj/ysk_morning_after_pill_has_a_weight_limit_and.json": "Why YSK:\n\nWHY? WHY SHOULDNT PEOPLE KNOW THIS. I was never told about this and had to do my\nown research to figure out that the pill has a weight limit, I talked to my\ndoctor about it and she even told me that this was true. I told all my\nfriends/family this and none of them knew either !\n\nI believe…",
  "data/reddit-know/r/YouShouldKnow/comments/qo50ab/ysk_human_crushes_often_inaccurately_referred_to.json": "Why YSK: in the aftermath of fatal human crush incidents, organizers will often\nattempt to avoid responsibility by suggesting that the incident was caused by\nthe victims behaving badly. In some cases, such as the Hillsborough disaster,\nthese misconceptions can persist for years after despite…",
  "data/reddit-know/r/YouShouldKnow/comments/qoiw4n/ysk_that_crowd_crush_is_insanely_dangerous.json": "EDIT: just realized basically this exact post is on the front page already.\nApologies. That post also has the link I shared, but I’ll leave this up in case\nanyone misses that other one somehow.\n\nWhy YSK: When a crowd reaches a certain density of people, it begins to act like\na fluid and you lose all…",
  "data/reddit-know/r/YouShouldKnow/comments/qot7u7/ysk_unvented_gas_cooktops_release_unsafe_levels.json": "Why YSK: Studies have shown that unvented gas cooktops expose people indoors to\nexcessive levels of nitrogen dioxide, carbon monoxide and formaldehyde which can\ncause a myriad of respiratory problems and cardiovascular disease.\n\nBelow is a link to a recent study that deserves more attention. Stay…",
  "data/reddit-know/r/YouShouldKnow/comments/qoyafx/ysk_youtube_videos_with_ads_can_be_skipped_by.json": "Why YSK: more and more ads are placed to promote YouTube premium these days.\nThis can save you many seconds and you will get quicker at it as you do it more\noften.\n\nEdit:on mobile",
  "data/reddit-know/r/YouShouldKnow/comments/qpa2g8/ysk_that_you_can_use_googles_exclusive_pixel.json": "Why YSK: The feature can be used to remove unnecessary elements like\nobjects/people/lines etc. from your existing pictures. The Google Pixel 6 comes\nwith the magic eraser functionality which removes these unnecessary things. You\ncan do that too without using any cracked or fishy apps. In fact, it's…",
  "data/reddit-know/r/YouShouldKnow/comments/qpbhrz/ysk_that_in_crush_crowd_asphyxiation_deaths.json": "Why YSK: this could save the life of smaller people in a mass crush/crowding\nevent.\n\nIn overcrowded, pressing situations, petite women and children may be at risk\nbefore anyone notices anything is wrong, even in relatively tame crowds. Watch\nfor signs and fainting, and if things start moving very…",
  "data/reddit-know/r/YouShouldKnow/comments/qpg7vk/ysk_your_phones_sound_quality_can_be_greatly.json": "Why YSK: it WILL improve your listening experience\n\nThere may be differences between certain models etc, but simply put: if you look\nin your settings for wherever your phone's sound controls are there should be a\nplethora of options to change the sound coming out from its speakers aswell as\nthe…",
  "data/reddit-know/r/YouShouldKnow/comments/qphhl6/ysk_you_can_almost_always_ask_someone_what_they.json": "Why YSK, I’ve always been a curious person and as a kid always wondered “what\nare hey building, what does that do, why is that there” and now as an adult I’ve\nrealized that most people enjoy explaining things you don’t know. It’s also just\nkind of nice to RESPECTFULLY know what’s going on.",
  "data/reddit-know/r/YouShouldKnow/comments/qplj94/ysk_womens_most_common_heart_attack_symptom_is.json": "Why YSK: Although women comprise half of the world’s population, the medical\ncommunity leaves much to be desired when it comes to treating and diagnosing\nwomen because they’re focused solely on the stereotypical symptoms men\nexperience.\n\nSource\n[https://www.heart.org/en/health-topics/heart…",
  "data/reddit-know/r/YouShouldKnow/comments/qpnoo3/ysk_that_quickly_comparing_health_insurance_plan.json": "Why YSK: Many people stick with the health insurance plan they've had for years,\nbut annual changes in premiums and out-of-pocket costs can have big impacts on\nyour actual and potential expenses. By using a spreadsheet to compare overall\ncosts, you can choose the most cost-effective plan that your…",
  "data/reddit-know/r/YouShouldKnow/comments/qpsg1s/ysk_how_to_increase_your_chances_of_survival_in_a.json": "Why YSK: The recent tragedy at the Travis Scott music festival event isn't a\none-off and you could find yourself in a similar situation.\n\nAs someone who has been in a crowd crush, I can assure you it's horrifying, and\nit shouldn't happen if the crowd has been organized correctly.\n\nEven in cases when…",
  "data/reddit-know/r/YouShouldKnow/comments/qpw48m/ysk_never_buy_a_house_from_flippers.json": "Why YSK: If you reach the phase in your life of buying a house, who were the\nprevious owners matters a lot. Your top priority are houses that the owner lived\nin them. Owners usually take care of their houses, and invest a lot of money in\nquality repair (although there is also the risk that the…",
  "data/reddit-know/r/YouShouldKnow/comments/qq4jxv/ysk_haveibeenpwned_is_a_website_that_can_tell_you.json": "Why YSK: Having your information being included in a data leak can be a huge\nsecurity concern. If you reuse the same email / password combinations across\nmultiple websites, a data leak from just one of those websites can jeopardize\nall your other accounts. You can use HaveIBeenPwned to see if your…",
  "data/reddit-know/r/YouShouldKnow/comments/qq63ly/ysk_in_the_united_states_if_you_are_forced_to.json": "Why YSK: because, contrary to popular belief, you do not have to be fired or\nlaid off to apply for unemployment benefits. You have to be able to prove the\nworkload demands were unreasonable, but you are allowed to quit and receive\nunemployment. With droves of people quitting and employers shifting…",
  "data/reddit-know/r/YouShouldKnow/comments/qqaska/ysk_911_for_emergencies_is_not_the_only_11_number.json": "Why YSK: There are 8 numbers established in the US by the FCC to access special\nservices. These numbers can provide you with essential services, are easy to\nremember, and all (but one) are free! These numbers, known as N11 codes, are:\n\n211—Community services and information\n\n211 services provide…",
  "data/reddit-know/r/YouShouldKnow/comments/qqbbrb/ysk_a_forprofit_company_will_always_try_to.json": "Why YSK: There is a mindset, especially with younger adults, that it is taboo to\nask for more money. For example during a job interview a company will state your\nwage structure. Now, if you respectfully treat this as a business negotiation,\nthere is nothing wrong with simply discussing it. Don't be…",
  "data/reddit-know/r/YouShouldKnow/comments/qqdti1/ysk_that_in_the_us_almost_all_vehicle.json": "Why YSK this is because not only do seat belts save lives, but in most states\n(if not all) it is required by law for all occupants to use them.\n\nThis is even more important if you're using child-seats. If you have a faulty\nseat belt, contact the closest dealership for your make of vehicle and…",
  "data/reddit-know/r/YouShouldKnow/comments/qqf0lh/ysk_daylight_saving_time_just_ended_if_you_hate.json": "Why YSK: DST runs from March to November (we've extended it several times). If\nwe end DST, it'll be dark 1hr earlier in those months. If we just change to DST\npermanently, then our time will be different than all the other countries we\nshare a timezone with.",
  "data/reddit-know/r/YouShouldKnow/comments/qqj2be/ysk_most_wheelchair_users_can_walk_theres_many.json": "Why YSK: There are many reasons and disabilities which may not be visible that\nmay cause someone to need or prefer to use a wheelchair.\n\nTitle correction: Many, not most\n\nReasons can include but are not limited to:\n\n1-Heart Conditions- These can cause someone to faint or pass out from standing\nor…",
  "data/reddit-know/r/YouShouldKnow/comments/qqkfu7/ysk_that_medical_students_are_routinely_invited.json": "Why YSK: It’s a very common practice in teaching hospitals in almost every state\nin the US. The claim is that allowing medical students to perform pelvic exams\non unconscious women in the operating room enables them to be well trained by\nthe time they go into practice. This…",
  "data/reddit-know/r/YouShouldKnow/comments/qr0ke9/ysk_ohio_bmv_is_making_you_pay_for_expired_years.json": "WHY YSK: Be prepared to pay for an extra year of registration even if you did\nnot drive the car for that year. I am not sure how this is legal but I called a\ndifferent Ohio BMV and they are telling me this actually what they are required\nto do.\n\nI am not sure how this is any different than going to…",
  "data/reddit-know/r/YouShouldKnow/comments/qr37x3/ysk_medical_test_results_cannot_be_directly.json": "YSK: Medical test results cannot be directly compared between labs\n\nWhy YSK: Patient access to their own test results is becoming mainstream. With\nthis comes the risk of misinterpretation. I work in a hospital lab, here are\nsome tips:\n\n 1. Reference ranges are normal ranges for a test. However, they…",
  "data/reddit-know/r/YouShouldKnow/comments/qr8pxk/ysk_the_signs_of_stroke_and_what_to_do.json": "Why YSK: Stroke treatments that work best are available only if the stroke is\nrecognized and diagnosed within 3 hours of the first symptoms.\n\nSigns of Stroke in Men and Women\n\nSudden numbness or weakness in the face, arm, or leg, especially on one side of\nthe body. Sudden confusion, trouble…",
  "data/reddit-know/r/YouShouldKnow/comments/qrog5u/ysk_asocial_and_antisocial_mean_two_very.json": "Why YSK: It can be very hurtful and disrespectful to call someone who is\nintroverted or doesn't like spending time with large groups of people\n\"Antisocial\"\n\nAsocial: Not social; Rejecting, or lacking the capacity for, social interaction.\nIntroverted.\n\nAntisocial: Pertaining to Antisocial Personality…",
  "data/reddit-know/r/YouShouldKnow/comments/qrttxp/ysk_nonplussed_isnt_similar_to_unamused_its.json": "Why YSK: I'm not a stickler for definitions, but some people are. Know that the\ndefinition of \"nonplussed\" is \"unsure about what to say, think, or do\" and not\nan intuitive interpretation of \"non\" and \"plussed\" as many people seem to think\nit is. This could save you from looking silly at work or in…",
  "data/reddit-know/r/YouShouldKnow/comments/qru0yt/ysk_what_to_do_when_being_pulled_over_by_the.json": "Why YSK: When being pulled over by the police, if you put them at ease and make\ntheir job a little easier, you're much less likely to receive a ticket unless\nyou were doing something stupidly egregious. Being respectful and proper will go\na long way towards getting you out of the ticket that you…",
  "data/reddit-know/r/YouShouldKnow/comments/qrvtru/ysk_there_is_a_current_trial_that_will_have_a.json": "Why YSK: The Kleiman v Wright trial addresses 1.1 million early mined bitcoins\nthat are in the possession of Satoshi Nakamoto. Ira Kleiman is suing Craig S\nWright, claiming that half of those coins are rightfully the posthumous property\nof his brother Dave Kleiman. Craig S Wright is defending his…",
  "data/reddit-know/r/YouShouldKnow/comments/qs4yvy/ysk_always_make_a_copy_of_a_document_while_making.json": "Why YSK: Nowadays the auto save doesn't let you say 'dont save' easily and also\nthe number of undo steps are limited in various softwares.",
  "data/reddit-know/r/YouShouldKnow/comments/qshlgl/ysk_humans_read_your_amazon_customer_return.json": "Why YSK: It helps us to determine what to do with the item. Although not as\nstrict as other departments, we still have a rate. It isn't feasible to open\nevery item, so the more descriptive your return reasons are the better. Example:\nSome return items will be a shelf, a desk, a light fixture, etc.…",
  "data/reddit-know/r/YouShouldKnow/comments/qso4oz/ysk_might_be_common_knowledge_but_you_should_keep.json": "Why YSK, because theives can use a scanner and a simple laptop or device to get\nthe signal from your keyless car key to unlock your car and the device will\nmimic the signal so they can drive off. The Faraday pouch will stop all signal\ngetting out so even if you're next to your car you'll notice you…",
  "data/reddit-know/r/YouShouldKnow/comments/qstmu9/ysk_upon_request_many_companies_will_either_show.json": "Why YSK: Your data is constantly being collected and sold without your\nknowledge. While there is no federal law guaranteeing the erasure of your data,\nmany companies will comply regardless, either because of company policy or\nthrough compliance of non-federal law.\n\nIf any of these companies have…",
  "data/reddit-know/r/YouShouldKnow/comments/qszpe0/ysk_in_germany_you_can_legally_and_for_free.json": "Why YSK: Regardless if you are own alimony, you forgot to pay by credit card, or\nthe German government did not receive a 10 EUR parking ticket payment because\nthey lost the transaction in a jammed fax machine paper. For that, they can\nblock your bank account with all your money through court, and…",
  "data/reddit-know/r/YouShouldKnow/comments/qt535s/ysk_of_togethersmilecom_a_free_anonymous.json": "Why YSK: Humans are social creatures, and sometimes a simple smile can go a long\nway in turning someone's day better. Use this website to bring an tablespoon of\nwholesomeness to your, or maybe a struggling friends day.",
  "data/reddit-know/r/YouShouldKnow/comments/qtc2vn/ysk_in_most_states_and_possibly_other_countries.json": "Why YSK: you have no idea who is behind you or trying to pass you, and\nespecially in the US where ambulances are often not called during an emergency,\nthe person trying to get around you may be in a very dire situation. Ive been in\nthe car w a 1 year old baby with an impacted bowel and we got stuck…",
  "data/reddit-know/r/YouShouldKnow/comments/qtv3b7/ysk_that_most_creditbank_card_companies_will_not.json": "Why YSK: Credit/bank card companies only care about protecting against the\nmisuse of their card. Calling the \"If lost call +1 800..\" number will not assist\nyou in returning it to the owner.\nBetter to hand it to the police directly.",
  "data/reddit-know/r/YouShouldKnow/comments/qupu13/ysk_although_in_america_one_of_your_miranda.json": "Why YSK: I learned this early in my legal career. My county did not have a\npublic defender, but instead would assign criminal defense cases to all of the\nfirms in the county on an as-needed basis. The attorneys, as a service to the\ncommunity (and to stay on the good side of the judges), would take…",
  "data/reddit-know/r/YouShouldKnow/comments/qusfbu/ysk_people_in_mlms_are_instructed_to_make_their.json": "Why YSK: It is a common tactic to get more people into the pyramid scheme.\n\nMLMs are a way to roleplay or LARP as a successful \"business owner\"- not a path\nto actual success. They are predatory and a vast majority of people in them\neither lose money or make far less money than they would have with a…",
  "data/reddit-know/r/YouShouldKnow/comments/quup4q/ysk_food_products_that_say_organic_on_the_box_are.json": "WHY YSK: I work in the advertising industry, and we parse literally every word\non packaging and in commercials in order get as close to lying as possible. For\nexample, if you see the word \"chocolatey\" in big letters on a box of candy, but\nnot chocolate - there is no chocolate in the candy.\n\nRight…",
  "data/reddit-know/r/YouShouldKnow/comments/quyz19/ysk_on_job_boards_like_indeed_even_the_hidden.json": "Why YSK:\n\nIndeed is especially guilty of this, not sure about all platforms, but you\nshouldn’t trust filters like that when you’re job hunting.\n\nThe platforms will offer something like “indeed email” which is supposed to make\nyour email private. What it actually does, is cut off a few digits/letters…",
  "data/reddit-know/r/YouShouldKnow/comments/qv0ks1/ysk_the_usb_port_on_a_lot_of_modern_routers_let.json": "Why YSK: With this setup, you don't have to dig out your external hard drive\nevery time you want to use it.\n\nThis is common practice for businesses, although they would use a NAS as it\nworks better for multiple users.\n\ninstructions\n[https://au.pcmag.com/storage/86053/running-out-of-room-on-your-pc…",
  "data/reddit-know/r/YouShouldKnow/comments/qv7j1u/ysk_that_its_safe_and_possible_to_stop_having.json": "Why YSK: If you never considered skipping your period forever because you didn't\nknow it was possible, and you would like to do so, talking to your doctor about\nit and potentially starting on treatment if they say it is safe for you, could\nhave you avoid decades of dealing with menstruation which is…",
  "data/reddit-know/r/YouShouldKnow/comments/qv9q55/ysk_having_a_child_is_not_a_solution_to.json": "Why YSK: I’ve talked to hundreds of people with relationship struggles (abusive,\nloveless, etc). They often think that having a kid will fix it, it won’t!\nPregnancy is a huge responsibility, and it can put a strain on bad\nrelationships. It’ll just end poorly for your relationship and the child.…",
  "data/reddit-know/r/YouShouldKnow/comments/qvcudn/ysk_the_blood_clotting_disorder_factor_v_leiden.json": "Why YSK: Combined with hormonal (estrogen-based) birth control, your risk of\ndeveloping a blood clot when you have Factor V can be upwards of 30%. Why they\ndo not screen for these disorders before prescribing BC is a mystery to me. I\nfound out the hard way when, at 40, I developed a massive DVT clot…",
  "data/reddit-know/r/YouShouldKnow/comments/qvg67z/ysk_some_cheeses_have_no_lactose.json": "Why YSK: you might still be able to make dishes with cheese if you are lactose\nintolerant. A thorough or complete cheese has little or no lactose in it, so you\ndon’t have to limit yourself necessarily. Milk is made up of two proteins;\ncasein and whey. The whey is where the lactose is. When you make…",
  "data/reddit-know/r/YouShouldKnow/comments/qw5wf5/ysk_scammers_hate_web_conferences.json": "Why YSK: If you are ever contacted on your phone by someone that you have never\ndone business with before, and that you don't know in real life, one good way to\ntest their validity is to ask them to do business over some web conferencing\nsoftware like Google Meet or Webex instead of the phone or…",
  "data/reddit-know/r/YouShouldKnow/comments/qwdbmz/ysk_when_a_succesful_businessperson_claims_to.json": "Why YSK: it's in the title but i had to write something here or the uppity bot\nknown as autom*d will delete this.",
  "data/reddit-know/r/YouShouldKnow/comments/qwjtog/ysk_antiwork_does_not_mean_antilabor.json": "Why YSK: the largest group of harassment towards the anti-work movement is a lot\nof contrarian rhetoric trying to “poke holes” into the logic of the movement by\nlatching onto the word “work” and using the most disingenuous definition of it.\n\nWhen you hear the phrase “If you love what you do, then…",
  "data/reddit-know/r/YouShouldKnow/comments/qwkfbg/ysk_airplane_seatbelts_are_very_important_to_use.json": "Why YSK: A wide misconception is that most significant passenger airplane\ncrashes are completely fatal for all of the passengers. This is entirely untrue.\nOf all airplane crashes with fatalities, only a small percentage result in the\ntotal loss of life.\n\nDuring cruising altitude, wearing your…",
  "data/reddit-know/r/YouShouldKnow/comments/qwvb53/ysk_how_to_dose_cannabis_edibles_for_your_first.json": "Why YSK: Many people benefit from cannabis for pain relief, help with anxiety\nand depression, or recreational use. It can be beneficial and have very few side\neffects, but if you have too much by accident it can be very unpleasant, and\neven traumatizing. If you are of age and in a legal location,…",
  "data/reddit-know/r/YouShouldKnow/comments/qwvtbn/ysk_food_sensitivity_tests_are_not_reliable.json": "Why YSK: Don't restrict your diet of a potentially beneficial food because the\ntest said you are \"extremely sensitive\" or any other form or sensitive to it.\n\nMy doctor said the way they test for it by exposing your blood to a certain food\nand looking for increased levels of IgG is not reliable…",
  "data/reddit-know/r/YouShouldKnow/comments/qwvwpu/ysk_weakstrong_password_checks_are_meaningless.json": "Why YSK: Password security is extremely important and most people don't are\ncompletely unware because they are being lied to about their password strength.\n\nObviously a password with 8 characters is harder to crack than a password with 4\ncharacters, that much is true.\n\nAnd common passwords like…",
  "data/reddit-know/r/YouShouldKnow/comments/qwvy5k/ysk_you_can_transfer_a_phone_number_into_google.json": "Why YSK: Google voice still provides all the services that a cell carrier\nprovides, but you need to have a data connection(wifi or cell data plan).\n\nIt's nice to not have to message all your contacts about a new number if you\nchange it for some reason... or maybe you're going to be traveling and…",
  "data/reddit-know/r/YouShouldKnow/comments/qx1jnu/ysk_banks_are_required_by_law_to_confiscate.json": "Why YSK: if you think you have fake cash, don’t ask the bank to check it for\nyou. If it’s fake, they are legally not allowed to return it. They are also not\ngoing to give you $ to replace it.",
  "data/reddit-know/r/YouShouldKnow/comments/qx5ne1/ysk_aluminum_beverage_cans_with_a_shrinkwrapped.json": "Why YSK? Removing the label before recycling them allows them to be accepted at\nall aluminum recycling centers and keeps aluminum from being wasted.\n\nI was reading this article\n[https://www.westword.com/restaurants/ball-beer-can-shortage-12815172] today and\nit mentioned that shrink-wrapped aluminum…",
  "data/reddit-know/r/YouShouldKnow/comments/qx9g41/ysk_on_iphone_even_if_you_have_your_phone_on.json": "Why YSK: If you want to know when you are being called by a loved one (e.g., for\nan emergency), but you don't want to be notified by all possible notifications,\nthis option is helpful. Note that it won't work for texts, only calls. It does\nignore the silent-mode switch, too, meaning if they call you…",
  "data/reddit-know/r/YouShouldKnow/comments/qxbznh/ysk_having_a_pedicure_isnt_feminine.json": "Why YSK: If you have a job where you walk/stand a lot having a pedicure semi\nregularly to have a check up/maintenance is really important. It will prevent\nserious problems that would take medical attention.\n\nEdit: I'm not talking about washing your feet, I'm talking about corns and such",
  "data/reddit-know/r/YouShouldKnow/comments/qxnazm/ysk_cats_seek_shelter_under_the_hood_of_cars.json": "Why YSK:\n\nYears ago I saw a post somewhere about someone finding a cat under their hood\nafter hearing meowing while driving. This morning we moved our car into our\ndriveway after it was parked on the street for a couple days, and heard loud\nmeowing while in our house. I remembered the post and…",
  "data/reddit-know/r/YouShouldKnow/comments/qxooob/ysk_that_you_can_type_into_google_call_my_phone.json": "Why YSK: If you do that and you have a smart phone with the apps hooked up\ngoogle will call your phone so you can locate it and even if you don't it will\npull up websites that will call your phone to locate it.\n\nEdit, like when you are signed into google on your phone and have your phone\nnumber on…",
  "data/reddit-know/r/YouShouldKnow/comments/qxriow/ysk_those_money_markers_only_check_the_kind_of.json": "That other YSK about counterfeit currency made me think of this.\n\nYSK that those money marker pens you can get anywhere are ONLY checking the kind\nof paper the bill is printed on.\n\nWhy YSK: One common method of counterfeiting money is called 'washing'. They\nremove the ink from a low denomination…",
  "data/reddit-know/r/YouShouldKnow/comments/qxsjfi/ysk_being_nice_some_of_the_time_is_part_of_the.json": "Why YSK: this is super common in many different types of relationships. I learnt\nit with my ex. We know that during the good times, it’s really good, and so we\nhope and tell ourselves that if it could only always be like that, if we could\nonly get it right, then things would be perfect. No. If they…",
  "data/reddit-know/r/YouShouldKnow/comments/qy44x0/ysk_banks_will_cash_deposited_checks_before.json": "Why YSK: The funds your bank offers you before they retrieve money from the\nsource of the check is referred to as a courtesy. Meaning, they are assuming\nbased on the fact that you endorsed the check that the source of the check is\nreliable, even if the check you're cashing isn't legitimate. I was…",
  "data/reddit-know/r/YouShouldKnow/comments/qyegbv/ysk_job_recruiters_always_know_the.json": "Why YSK: I worked several years in IT for a recruiting firm. All of the pay\nranges for positions are established with a client before any jobs are filled.\nSome contracts provide commissions if the recruiters can fill the positions\nunder the pay ranges established for each position, which…",
  "data/reddit-know/r/YouShouldKnow/comments/qyhu70/ysk_that_little_gift_is_often_what_sustains_a.json": "I teach preschool in an elementary school. My school does not pay a lot (31k\nwith a masters degree) but this is just the area we live in, this is how it is-\nand the cost of living is high. I can’t move to a better area due to family\nconstraints with caring for aging parents. I love my job so much…",
  "data/reddit-know/r/YouShouldKnow/comments/qyk0uq/ysk_restaurant_servers_do_not_want_you_to_help.json": "Why YSK: It's actually the opposite of helpful to try and help a server load\ntheir tray. They are making the correct adjustments with their hand beneath the\ntray to accommodate the weight each time they set something on it. If you place\na random stack of bowls or plates anywhere, the weight balance…",
  "data/reddit-know/r/YouShouldKnow/comments/qyne43/ysk_when_baking_you_should_spoon_flour_into_a.json": "Why YSK: if you scoop flour with your measuring cup directly, the flour will be\ntoo compacted and thus result in dense baked goods. You can prevent this by\nspooning the flour from the bag into your measuring cup, then leveling off with\na knife.\n\nI didn’t know this until recently and now I understand…",
  "data/reddit-know/r/YouShouldKnow/comments/qyysp1/ysk_theres_a_website_available_for_free_that_will.json": "I hate paywalls, so I searched high and low until I found a website that\ninstantly gets around almost all of them: 12 foot ladder [https://12ft.io].\n\nSo far, it’s worked on every website I’ve tried it with. All you have to do is\ngo to the website, then put in the URL, and it opens it for you. It’s a…",
  "data/reddit-know/r/YouShouldKnow/comments/qyzy8f/ysk_dont_buy_visa_gift_cards_from_retail_stores.json": "I recently made the mistake of buying a VISA gift card and giving it as a\nbirthday gift. Not 1 week after the card was purchased and it was already\ncompletely used up, even though it hadn’t even been removed from the packaging.\n\nThieves will swipe the info from the card while it’s in the store, wait…",
  "data/reddit-know/r/YouShouldKnow/comments/qz2y8v/ysk_to_reduce_the_risk_of_food_poisoning_from.json": "Why YSK: Our stomach produces acid that helps kill food pathogens like bacteria,\nparasites, etc,¹ but drinking lots of liquids with a meal dilutes that acid ²,\nwhich makes the acid less effective.³ Plus liquids can flush the pathogens out\nof the stomach before the acid has had enough time to kill…",
  "data/reddit-know/r/YouShouldKnow/comments/qz4wlr/ysk_you_can_clean_the_walls_of_your_home_with_a.json": "Why YSK: You should know because most people neglect cleaning their walls. It\nwon’t hurt your paint and it will make your home interior look newer and smell\nmuch nicer.",
  "data/reddit-know/r/YouShouldKnow/comments/qzfvzx/ysk_you_can_still_view_dislike_on_youtube_videos.json": "Why YSK? Because like everyone else I too hate to click on a video without\nknowing the like to dislike ratio and watse my time on clickbait videos. But\nthere is hope open open source projects like Freetube [https://freetubeapp.io]\nand Newpipe [https://newpipe.net] still shows dislike on videos.…",
  "data/reddit-know/r/YouShouldKnow/comments/qzjpit/ysk_that_a_lot_of_corporations_believe_each_and.json": "Why YSK: Because the very high paying non-executive corporate position you may\nbe applying for may in fact be shortening your tenure. In such companies HR\nassembles a list of highest earners and they get near the door.",
  "data/reddit-know/r/YouShouldKnow/comments/qzq4n7/ysk_how_to_remove_the_smell_of_alcohol_from.json": "Not sure how well this one fits the sub but i hope it's useful;\n\nYSK: Citrus fruits, especially orange, hide(not completely but pretty well) the\nsmell of alcohol from your breath. WATER makes it much, much worse.\n\nWhy YSK: Ever woken up from a night of partying/quiet self reflection stinking\nas if…",
  "data/reddit-know/r/YouShouldKnow/comments/qzszth/ysk_that_giving_two_weeks_notice_to_your_employer.json": "Why YSK. Employers and employees in almost all states are governed by a set of\nlaws known as \"work at will.\" This means that not only can employers fire you\nfor (almost) any reason or no reason, workers can quit for any reason or no\nreason. There is no time requirement imposed in either situation,…",
  "data/reddit-know/r/YouShouldKnow/comments/r0f5zq/ysk_a_large_number_of_your_emails_are_tracked.json": "Why YSK: From what time you opened them, to how many times you opened them, a\nlot of emails are sent with trackers that notify the sender when you open them.\nThe sender can also have access to a dashboard that shows them the specifics of\nyour email viewing habits.\n\nWhat you can do about it: there's…",
  "data/reddit-know/r/YouShouldKnow/comments/r0faoh/ysk_you_can_buy_thousands_of_dandelion_seeds.json": "Why YSK is because dandelions are great! And bees love em!\n\nDon't let asshole herbicide companies tell you otherwise! Dandelions are cool\naf.\n\nAnd you can buy them by the THOUSANDS online for cheap.\n\nAnd your neighbours will love them too!!",
  "data/reddit-know/r/YouShouldKnow/comments/r0i8lk/ysk_theres_a_browser_extension_that_brings_back.json": "Why YSK: YouTube recently removed public dislikes. Not knowing how useful,\ncontroversial, good, or helpful a video is, feels like trying to buy an item\nwithout any negative reviews. This browser extension allows you to get back the\nconvenience of not wasting time on unhelpful, unentertaining, or…",
  "data/reddit-know/r/YouShouldKnow/comments/r0jez6/ysk_as_a_pediatrician_passing_out_antibiotics_is.json": "As a Pediatrician, it's the easiest thing in the world for me to give your child\nantibiotics (ABX) for what is likely a viral illness. I have dozens of patients\neach week who come in with symptoms and complaints that are likely a viral\nillness. I explain in detail viral illnesses to family but in…",
  "data/reddit-know/r/YouShouldKnow/comments/r0ly47/ysk_that_if_the_service_provided_to_you_doesnt.json": "Why YSK: The medical staff that helps you through your appointment or the sales\nperson who helped you find an item and helped you decide which one to buy, these\npeople who go out of their way to meet the company’s customer satisfaction\nrequirements, are more likely to be compensated by the employer…",
  "data/reddit-know/r/YouShouldKnow/comments/r0wkok/ysk_if_youre_trying_to_downgrade_your.json": "Why YSK: Many people will probably look at their \"downgrade\" options on their\ncable providers website and think that there's just no point in downgrading\nbecause of the lack of deals cheaper than what they're already getting. In\nreality, it's just another shady tactic by cable providers to keep you…",
  "data/reddit-know/r/YouShouldKnow/comments/r16b4f/ysk_hanukkah_ends_on_december_6th.json": "Hanukkah begins in 4 days (Nov 28th) and ends on December 6th.\n\nWhy YSK: You can come off as ignorant and maybe even rude (to some people)\nsaying ”Happy Hanukkah” 2-3 weeks after the holiday is over. So try to avoid\nsaying it to your Jewish friends on Christmas! Save yourself the…",
  "data/reddit-know/r/YouShouldKnow/comments/r180xt/ysk_if_an_airline_gives_you_a_flight_credit_and.json": "Why YSK: With many airlines strapped for cash, they'll more than likely give you\na flight credit and not a refund for a flight that they cancelled. If you wish\nfor a refund, you'll first have to file a complaint with the airline's customer\ncomplaint department. If they deny your request, then you'll…",
  "data/reddit-know/r/YouShouldKnow/comments/r1e4ey/ysk_once_tooth_enamel_is_damaged_it_cannot_be.json": "Why YSK: Although toothpastes and mouthwashes can never “rebuild” teeth, they\ncan contribute to this remineralization process.\n\nSo take care of your teeth before you're condemned to a life of sensitive teeth,\nand pain. It's especially important to brush before going to bed.\n\nCitation:…",
  "data/reddit-know/r/YouShouldKnow/comments/r1fhc0/ysk_the_american_imperial_system_is_different_to.json": "The US imperial system, actually called the US Customary System, has key\ndifferences to the imperial system when it comes to measuring volume. A fluid\nounce is 28.41ml in British Imperial but 29.57ml in US Customary units. An\nimperial pint is 20 fl. oz. compared to 16 fl. oz. in the US and an…",
  "data/reddit-know/r/YouShouldKnow/comments/r1hvsq/ysk_you_can_use_code_savethenightct_in_the_uber.json": "Why YSK: Title is self explanatory. The code was made for residents of\nConnecticut but worked for me in Texas. Use this to save some money on Uber\nduring the holidays, don’t drink and drive!",
  "data/reddit-know/r/YouShouldKnow/comments/r1rvoa/ysk_thanksgiving_weekend_is_the_most_drunken.json": "Thanksgiving weekend is one of the most dangerous periods of the year for\ndriving, About 800 people die on roads across the country on Thanksgiving\nholiday.\n\nWhy YSK: Many people start celebrating the Thanksgiving holiday Wednesday night\nand unfortunately that can lead to a number of people drinking…",
  "data/reddit-know/r/YouShouldKnow/comments/r20634/ysk_that_the_average_reading_age_in_the_us_is.json": "So firstly I need to say a couple of things.\n\nI'm not picking on the US, it's just the majority of people on Reddit are from\nthere. I'm from the UK and our reading age is lower at 9 years, so it's not a\ndunk.\n\nHere's a good link which is talking about my…",
  "data/reddit-know/r/YouShouldKnow/comments/r2bxnm/ysk_that_insurance_companies_often_offer_free.json": "I posted this same subject a couple years ago, but I recently saw a post on\nReddit discussing the outrageous costs of gyms people were paying so i figured I\nwould share again.\n\nNew Years is around the corner and that means that many people start going to\nthe gym again or start at the gym for the…",
  "data/reddit-know/r/YouShouldKnow/comments/r2fxgr/ysk_that_unless_you_were_going_to_buy_it_anyway_a.json": "Why YSK:\n\nBlack Friday is here with retailers offering \"discounts\" but this applies no\nmatter what the time of the year.\n\nIf you want to buy something, put it on a list and keep track of the price\n(tools like CamelCamelCamel (Amazon only), and TopPreise (Switzerland) can help\nhere). If there's a…",
  "data/reddit-know/r/YouShouldKnow/comments/r2g1h5/ysk_that_you_can_buy_a_fire_extinguisher_for.json": "Why YSK: because you can stop a fire from becoming an inferno with a fire\nextinguisher. And if it's an oil fire, there's nothing you can do unless you\nhave a fire extinguisher.",
  "data/reddit-know/r/YouShouldKnow/comments/r2uq62/ysk_that_your_uber_drivers_rate_you_as_a.json": "Why YSK: This rating will determine the likelihood of you getting picked up\nduring busy times and when getting long rides. Be nice to your drivers and don't\nbe the drunk asshole!",
  "data/reddit-know/r/YouShouldKnow/comments/r32v27/ysk_about_the_mothers_kiss_a_technique_for.json": "Why YSK: This technique is a useful and safe first-line option for the removal\nof foreign bodies from the nasal cavities of children, and it can save you a\ntrip to the ER/urgent care.\n\nSource [https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3503923/]",
  "data/reddit-know/r/YouShouldKnow/comments/r33ie8/ysk_you_can_bring_back_the_youtube_dislike_count.json": "Why YSK: The dislike count of a video is vital in knowing whether or not a video\nis worth your time. It can help you easily identify scams, clickbait, lies and\ndownright terrible videos from a glance. YouTube removing the dislike count is\nby far the worst thing to happen to the platform in years.…",
  "data/reddit-know/r/YouShouldKnow/comments/r33zp2/ysk_depressed_people_often_present_as_happy_or.json": "Why YSK: Too often, depressed people pass away or don’t get help because people\ndon’t think they’re depressed. You should check in with all your friends/family\nmembers, even if they seem happy.\n\nI can speak from personal experience, but can anyone else corroborate this?",
  "data/reddit-know/r/YouShouldKnow/comments/r3bvmh/ysk_that_tipped_wages_still_have_to_be.json": "Why YSK: If you work in a career where you earn tips as a wage and are getting\nshort of your full minimum wage pay then your federally entitled to it. Many\npeople get absued in the system, and if you are fired for asking for that pay\nyou can report it.",
  "data/reddit-know/r/YouShouldKnow/comments/r3czx2/ysk_when_looking_for_a_college_if_you_are.json": "Why YSK: You could save thousands upon thousands of dollars by negotiating with\npotential colleges. Of course, this is all predicated on how valuable you are to\nthem but kids with very good marks should be aware that they have negotiating\npower.\n\nIf your preferred school does not offer what you want…",
  "data/reddit-know/r/YouShouldKnow/comments/r3epke/ysk_that_your_rider_rating_is_delayed.json": "I've seen several people on here talk about changing their rating of drivers\nbecause they were given one star, so they \"one star back\".\n\nYSK: Uber delays rider (and driver) ratings updates to \"protect anonymity\" and\nwon't say how long the delay is.\n\nBut they do a shit job of communicating that to…",
  "data/reddit-know/r/YouShouldKnow/comments/r3kyx5/ysk_that_on_android_if_you_put_a_file_called.json": "Why YSK: For years you have been annoyed at all the album art in your phone\ngallery. But no more! Just paste a blank file called .nomedia in all the folders\nin your phone you don't want to show pics of in gallery, and your gallery will\nfinally make sense! Works for getting rid of other app pollution…",
  "data/reddit-know/r/YouShouldKnow/comments/r3p10x/ysk_that_automated_telephonic_solicitors.json": "Why YSK: Phone solicitors -- automated and otherwise -- aren't interested in\nwasting time keeping someone on the line who isn't likely to actually spend\nmoney. So if you receive a call from an unknown phone number which sounds like\nit might be a recorded advertisement, then turn the tables on them…",
  "data/reddit-know/r/YouShouldKnow/comments/r3w9st/ysk_bluelab_is_closing_down_and_all_their_vsts.json": "Why YSK: Finding high quality VSTs can be a pain for producers, especially ones\nthat don’t break the bank.\n\nBlueLab is shutting down and all their VSTs are free until the site closes down.\nThis is a great opportunity for producers to jump in and get some high quality\nVSTs for no charge at all.",
  "data/reddit-know/r/YouShouldKnow/comments/r489d2/ysk_products_with_down_insulation_coats_jackets.json": "Why YSK:\n\n * You may be considering purchasing down-insulated products during the holiday\n   season\n * You may not know that the geese and duck feathers may be plucked while they\n   are still alive, often several times over the course of their life.\n * Even if you aren't vegan, you may not want to…",
  "data/reddit-know/r/YouShouldKnow/comments/r4h1q9/ysk_most_fire_extinguishers_are_single_use_only.json": "Why YSK: It can be tempting to use a fire extinguisher for fun, and just put it\nback when you're done, but most fire extinguishers don't seal completely once\nthe handle has been pressed, and will continue to leak until they eventually run\nout of pressure. You should always get a new fire…",
  "data/reddit-know/r/YouShouldKnow/comments/r4hzyw/ysk_that_alcohol_is_extremely_addictive_and_kills.json": "Why YSK - to all the teens and young people out there reading this, you don't\nneed to consume alcohol to socialize and have a good time. Advertisements will\ntry to convince you otherwise, so that you become addicted to their product.",
  "data/reddit-know/r/YouShouldKnow/comments/r4qgsn/ysk_that_police_stations_are_probably_the_safest.json": "Why YSK: If you're looking for deals from private parties, or selling something\nas a private party, the meeting place for the transaction should be somewhere\nsafe. Police stations are just about the safest place you can meet publicly, and\nalso act as a filter against people with bad intentions.\n\nI'm…",
  "data/reddit-know/r/YouShouldKnow/comments/r4zsyl/ysk_that_apostrophes_are_never_used_to_make_a.json": "Why YSK: Many people use 's to pluralize words. This is incorrect. The only time\nyou should ever use an apostrophe is for contractions (don't, haven't, she's) to\nmake something possessive (Dave's), or for pluralizing lowercase letters (dot\nyour i's).",
  "data/reddit-know/r/YouShouldKnow/comments/r51r1p/ysk_ceiling_fans_have_a_summer_and_winter_setting.json": "Why YSK: There is usually a switch on the fan that changes the direction the fan\nspins. Due to the pitch of the blades this changes the direction air flows. In\nsummer, blades are supposed to spin counter-clockwise and this creates a\ndowndraft to help cool. In winter, blades are supposed to spin…",
  "data/reddit-know/r/YouShouldKnow/comments/r55xiq/ysk_the_lyrics_to_a_much_better_birthday_song_for.json": "Futurama ep. 2:14 features an original song recited for Lord Nibbler's birthday.\nIt uses roughly the same melody as \"Happy Birthday\" for the same eight bars, but\nwith much better lyrics. The original lyrics are as follows:\n\nWhat day is today?\n\nIt's Nibbler's birthday!\n\nWhat a day for a…",
  "data/reddit-know/r/YouShouldKnow/comments/r58u24/ysk_that_the_color_of_the_warning_lights_on_your.json": "Some cars have weird, confusingly shaped lights on the dash, or maybe you just\ndidn't read the manual. Either way, you don't necessarily need to know what\nevery light means as long as you pay attention to the color.\n\nGreen: Non issue, just a notification. Things like fog lights, or ready to move\non…"
}