{
  "data/reddit-projects/r/SideProject/comments/ttpr4x/help_creating_your_startups_website_converting_a.json": "I have been actively trying to build startups and apps over the past few years,\nand one thing I hated the most was building landing pages.\n\nHaving tried Wordpress and Wix, I couldn't get it to look as attractive as other\nstart-ups, so I created my own Doc to Website converter called Doc2www.\n\nIt…",
  "data/reddit-projects/r/SideProject/comments/tttqor/i_made_a_simple_prelaunch_waitlist_tool_with_a.json": "Hi,\n\nI test lots of project ideas by creating a simple landing page to collect email\naddresses before building a fully feature MVP. Creating a landing page is\nsimple, but it takes a lot of time to integrate a signup form because of\nhandling the database and server. So, I made…",
  "data/reddit-projects/r/SideProject/comments/tueo21/quitting_my_job_and_starting_competing_company.json": "Currently, I'm working as a programmer at a software company. Soon, I will quit\nand start a competing company building the same software.\n\nI am worried about being sued for source code infringement.\n\nEven though I will be writing the software from scratch, my employer's code base\nis embedded in my…",
  "data/reddit-projects/r/SideProject/comments/tu2ufp/made_greetpool_a_collaborative_group_greeting.json": "Hi guys,\n\nVery happy and excited to announce the launch of GreetPool on ProductHunt today.\n\nGreetPool - a collaborative group greeting card platform, enables distributed\nteams, friends, family, or virtual communities to create and share collective\necards for all special occasions. Its the digital…",
  "data/reddit-projects/r/SideProject/comments/tv9d3b/playerzero_simulate_real_user_sessions_debug.json": "PlayerZero [https://www.playerzero.ai/] packages user sessions into shareable,\ninteractive simulations so engineering teams can efficiently communicate and\ndebug issues.\n\nhttps://twitter.com/playerzeroai| https://www.linkedin.com/company/20359939\n#Debugging #Support #Testing #SoftwareDevOps",
  "data/reddit-projects/r/SideProject/comments/tvcbnb/shashin_wip_selfhosted_media_gallery.json": "Screenshots and video: https://imgur.com/a/1JWKyWD\n\nI bought a NAS and wanted a gallery to view all my photos and videos. Inspired\nby a few things, but primarily Google Photos, Plex and PhotoPrism.\n\nSome features include reading and editing metadata (and batch editing), geo\ntagging and viewing in…",
  "data/reddit-projects/r/SideProject/comments/tvo92d/urgentjobsca_a_job_board_of_desperate_employers.json": "Hey Side Project makers, last week I built and released a job aggregator for\nurgent jobs [https://urgentjobs.ca?ref=slashrsp] that pulls in all the jobs\nmarked \"urgently hiring\" or \"immediate start\" in all the provinces and cities in\nCanada.\n\nFor urgent job seekers in Canada, especially ones who…",
  "data/reddit-projects/r/SideProject/comments/tw4deo/i_built_a_free_checklist_product_interact_list.json": "Interact List [https://interactlist.com/] is currently in private alpha and will\nbe launching to public beta shortly, please have a look and let me know what you\nthink:\n\nHere are some of the checklists created recently (note: you can keep track of\nyour progress without an account)\n\n\nSEO\n\nHow To…",
  "data/reddit-projects/r/SideProject/comments/twdqb9/growth_hacking_side_projects.json": "TL;DR: I'd like to help r/SideProject [/r/SideProject] makers growth hack their\nbootstrapped side projects to profitable customer-funded businesses in exchange\nfor testimonials and case studies.\n\nI'm an avid fan of this subreddit primarily because it showcases what passion\nand ingenuity can…",
  "data/reddit-projects/r/SideProject/comments/two6y3/an_idea_for_a_virtual_pet_in_my_linux_terminal.json": "Hello, I'm looking for new project ideas to learn coding. I've been learning for\na little more than 6 months and I wanted a fun idea to motivate me to keep\ngoing, so I thought about making a simple program that creates a virtual pet\n(called \"termie\") that can be run on a terminal.\n\nWhat do you…",
  "data/reddit-projects/r/SideProject/comments/twu1sn/im_building_service_that_allows_smbs_and_startups.json": "Hello fellow redditors, i'm currently working on a side project called Denario.\nBusinesses use Denario to pay and get paid, to significantly improve their\nfinancial processes and to facilitate the collaboration between managers, CFOs\nand their accountants.\n\nWould be amazing if you could give it a…",
  "data/reddit-projects/r/SideProject/comments/twam98/i_made_a_twitter_growth_tool_it_happens_to_be.json": "You might remember I wrote in r/SideProject [/r/SideProject] about 5 months ago\nabout the strategy I used to grow Twitter followers of the company I work for (I\nhad coded it as a very simple web app). And due to lots of requests, I started\nto re-code it to be published as a public product.\n\nNow,…"
}