{
  "data/reddit-stocks/r/Bogleheads/comments/pfd7hg/small_cap_etf_us_only_or_world.json": "Hello everyone,\n\nI‘m currently well diversified (MSCI World Developed 70% + Emerging Markets\n30%). But the corresponding ETFs include only Large and occasionally Mid Cap\ncompanies. I‘d also like to extend to small cap.\n\nI‘m wondering what would you recommend: US only small cap ETF or a…",
  "data/reddit-stocks/r/Bogleheads/comments/pfn35p/my_approach_to_timing_the_market.json": "I’m probably going to get a lot of heat for this post, but here goes…\n\nA friend recently expressed anxiety about index investing right now due to ultra\nhigh PE ratios. I shared my approach that he found helpful so I’m sharing with\nothers as well.\n\nI have an automated investment schedule 2x per month…",
  "data/reddit-stocks/r/Bogleheads/comments/pfybtm/question_about_tax_loss_harvesting.json": "In my taxable account I made a few questionable stock pics that have netted me\nabout -$600 and I don’t see them turning around and outperforming the market any\ntime soon. Would it be beneficial to cut my losses then reinvest in VTI/FSKAX?\nIs that how harvesting works? I can write off that $600 as…",
  "data/reddit-stocks/r/Bogleheads/comments/pfzhnd/why_do_so_many_people_hold_both_vti_and_vug_if.json": "Before I get into it I just wanna say I personally hold VTI and QQQ. What I\nreally would like to know from people around this sub is if you all really feel\nit’s worth it to have other ETFs besides VTI. Other than QQQ I have SCHD and XLF\n(XLF getting sold soon) as well. I started in February and I…",
  "data/reddit-stocks/r/Bogleheads/comments/pg4rt0/warning_friends_about_bad_financial_advice.json": "I know this is a bit of an odd question, but I wasn't sure whom else to ask.\n\nThe other day, I met a man at a party who claimed to be a financial advisor. I\nwas going to tell him how I'd set up my portfolio and ask for his thoughts. My\nportfolio is: US/ex-US index funds, I bonds, and cash. When he…",
  "data/reddit-stocks/r/Bogleheads/comments/pgjtt7/how_much_time_do_you_spend_on_managing_your.json": "I don't know if this is just me but I find my self going between 2 extremes when\nit comes to spending time managing my investments:\n\nOnce in a while I'd spend couple days digging into all kinds of details and\nchange things up a bit but then I forget about that for a long time (so not\ndoing any…",
  "data/reddit-stocks/r/Bogleheads/comments/pgqdsm/this_article_makes_some_pretty_good_points_about.json": "> Today, high-quality bonds, a mainstay of most portfolios for their consistent\n> yields and downside protection, offer neither yield nor an inflation hedge.\n> \n> Adjusted for inflation, yields on high-quality bonds are negative.\n> \n> In other words, investing in Treasurys is guaranteed to earn a…",
  "data/reddit-stocks/r/Bogleheads/comments/ph4xd5/i_think_crypto_is_inherently_a_bad_longterm.json": "I think people investing in crypto are ignoring the fundamentals and just\nchasing recent returns. I have seen people here say they put 20% of their\nportfolio in crypto.\n\nI know I may be under Dunning Kruger effect so tell me if I am wrong.\n\nI will only consider Bitcoin. I know there are many other…",
  "data/reddit-stocks/r/Bogleheads/comments/ph9nfy/once_you_learned_the_boglehead_way_how_did_you.json": "I've had a lot of help on this sub-reddit lately (so thank you), and this week\nwith thanks to you guys I've got my tax sheltered accounts in order, opting for\n100% VT.\n\nNow I'm trying to take care of my tax eligible accounts. Fortunately, I've been\ninvesting in a great market that was relatively…",
  "data/reddit-stocks/r/Bogleheads/comments/phbfux/are_there_any_issues_with_the_fidelity_zero_funds.json": "Please correct me if I'm wrong, but it seems that with a total market and total\nworld market fund, the best thing to looks for is the lowest expense ratio. ZERO\nsounds pretty low! Am I missing something with these?\n\n\n\nI'll be investing here through my Roth IRA, so it's all long term stuff.",
  "data/reddit-stocks/r/Bogleheads/comments/phnifc/whats_the_best_retirement_account_for_my_dad.json": "I didn't know where else to post this so mods feel free to remove this if I'm\nbreaking any rules.\n\nHe’s 55 and married, and plans to work for 15 more years and retire just like\nhis dad did at 70 years old. In his 401k through his employer (that canceled\ntheir match a couple years ago) with Fidelity,…",
  "data/reddit-stocks/r/Bogleheads/comments/phrexa/how_much_money_can_a_brokerage_take_at_one_time.json": "My bank won’t let me transfer more than 10k per day to Vanguard. Can Vanguard\naccess more, say 30k, if I request it through my settlement account?",
  "data/reddit-stocks/r/Bogleheads/comments/phz43m/is_anyone_tempted_by_value_investing_right_now.json": "I personally am; index funds are at high P/Es right now. It goes against the\nBogle ethos but my god, at some point you have to look at the price of the thing\nyou're buying and hesitate.",
  "data/reddit-stocks/r/Bogleheads/comments/phz8n5/finally_in_a_spot_to_start_investingdoes_this.json": "I am finally financially in a spot where I have income that does not need to go\ntowards paying off debt and want to make sure I have understood everything I\nhave been reading on these boards correctly...\n\n-I am currently putting as much possible to max out 401k and have that 100%\nVanguard 2055 TD…",
  "data/reddit-stocks/r/Bogleheads/comments/pi0o28/vtsaxvtiax_vs_vtivxus.json": "Besides the former being a mutual fund and the latter being ETFs, what is the\ndifference between these two pairs? Don't they track the same index and more or\nless hold the same stocks? Does one pair historically have a higher average\nreturn than the other? Which one would be a better buy for a…",
  "data/reddit-stocks/r/Bogleheads/comments/pi30yq/i_decided_to_allocate_5_of_my_portfolio_to.json": "I’m a Boglehead who only buys index funds. I’m averaging a generous 10% return\nsince I started investing in April or so, and I have huge faith in index funds.\nI’m the person in my group of friends that usually advises everyone against\nspeculation and buying individual stocks.\n\nNonetheless, after…",
  "data/reddit-stocks/r/Bogleheads/comments/picq3c/510_in_stocks.json": "Do you have 5-10% of your liquid portfolio in individual stocks or crypto? Just\nwondering if there are any Bogleheads that subscribe to more than just indexing.\nI have less than 10% in stocks - underperforming the index though.",
  "data/reddit-stocks/r/Bogleheads/comments/pidfo3/are_we_overallocating_to_us_stocks.json": "The US represents less than half of the world's GDP or market cap. US and\ninternational markets move in alternating cycles; although the US has been doing\nbetter recently, overall, international markets have done better. Shouldn't this\nshift allocation towards more international exposure rather than…",
  "data/reddit-stocks/r/Bogleheads/comments/piffp4/please_critique_my_portfolio.json": "Hello,\n\nI am a 37-year old American who recently started saving for retirement. I\nrealize I'm a little late to the game, but I am now taking full responsibility\nfor my finances and hoping for a bright future.\n\n * I have a Roth IRA and a Roth 401K, both with Fidelity.\n * I intend to max out ($6,000)…",
  "data/reddit-stocks/r/Bogleheads/comments/pijxfk/vtsaxvti_fund_managers_interview.json": "Managers of Vanguard's Total Stock Market Index fund & ETF are interviewed by\nRick Ferri on the Bogleheads On Investing Podcast. Fascinating and candid\ninsights into running the fund many of us use as a core holding.\n\nhttps://bogleheads.podbean.com/e/episode-037-gerry-o-reilly-and-rich-powers-host…",
  "data/reddit-stocks/r/Bogleheads/comments/piz2s0/switching_from_vt_to_vtivxus_im_having_trouble.json": "I'm trying to determine if it's worth it for me to switch. An accountant does my\ntaxes because I have a little trouble understanding tax law. How much do I stand\nto save a year by switching?\n\nFor simplicity let's say:\n\n 1. I have $100K in my brokerage account that I have spilt between VTI and VXUS.\n…",
  "data/reddit-stocks/r/Bogleheads/comments/pj1885/with_how_hot_the_market_is_and_the_potential.json": "Thank you!",
  "data/reddit-stocks/r/Bogleheads/comments/pj9h1z/would_you_still_invest_like_a_boglehead_if_you.json": "Very curious if your investing mindset would change at all if you became\ninstantly absurdly wealthy.",
  "data/reddit-stocks/r/Bogleheads/comments/pjsyiy/what_to_do_if_you_are_a_us_citizen_living_outside.json": "My mother is a U.S. citizen who lives abroad. She has a Vanguard brokerage\naccount, but Vanguard told her she is not allowed to contribute to it anymore\nbecause she lives abroad. Has anyone else experienced this before? Does anyone\nhave any suggestions for what she can do to be able to invest in…",
  "data/reddit-stocks/r/Bogleheads/comments/pjw62j/jack_must_be_rolling_over_in_his_grave.json": "https://riabiz.com/a/2021/9/7/after-freemium-like-beginnings-vanguard-group-is-priming-its-243-billion-ria-as-profit-engine-by-fueling-it-with-high-octane-higher-margin-proprietary-funds-and-an-opt-in-disclaimer\n\nAfter freemium-like beginnings, Vanguard Group is priming its $243-billion RIA\nas…",
  "data/reddit-stocks/r/Bogleheads/comments/pjxu6t/pay_attention_to_fees.json": "I know this is a major tenet of Bogleheadianism but it bears repeating.\n\nRecently I started paying more attention to fees in discussions and am\nhorrified.\n\nTwo examples:\n\n * A friend is being offered active management of investments at 0.9% which is\n   30x more than e.g. Vanguard VTI costs\n * I'm…",
  "data/reddit-stocks/r/Bogleheads/comments/pk8mpp/just_turned_26_want_to_start_being_serious_about.json": "I bought a book, Common Sense on Mutual Funds by Jack Bogle on a whim, and it\nhas me interested in taking charge of my finances, which have been pretty\nabysmal up to this point. Blew all my money I've earned on frivolous sh*t pretty\nmuch. What are some good resources (books, websites, etc) and…",
  "data/reddit-stocks/r/Bogleheads/comments/pkaty9/switch_to_high_yield_checking_account.json": "What do you think of high yield CHECKING accounts? If I move my money there then\nI could earn 1.75% APY. I’m referring to Midwestone Bank’s Power Checking\nAccount. They of course have some stipulations:\n\nyou must:\n\n 1. Receive electronic statements.\n 2. Make at least 15 debit card purchases that…",
  "data/reddit-stocks/r/Bogleheads/comments/pke5do/would_this_be_equivalent_to_vti.json": "My 401k doesn’t have VTI but it has State Street S&P 500, State Street small cap\nfund and State Street mid cap fund.\n\nWould this be a good VTI substitute?\n\nThanks!",
  "data/reddit-stocks/r/Bogleheads/comments/pkl96r/vtivxus_to_vt.json": "Have any fellow Bogleheads made the switch from VTI/VXUS split to just VT?\n\n\n\nCurrently holding 65% VTI and 35% VXUS w/DCA'ing every 2 weeks. After thinking\nabout it and running a back-test portfolio its amazing of how tight the numbers\nare after ~20 years.\n\n\n\nIf I were to switch I wouldn't sell…",
  "data/reddit-stocks/r/Bogleheads/comments/pkn67d/please_dont_laugh_at_this_question.json": "Maybe it's unintelligent to ask and there is an obvious answer. I understand\nthat with Bogleheads passive investing you buy and hold long term until\nretirement but How and when do you cash out? How do you accumulate your\nearnings? When the index fund goes up and down over the years that's…",
  "data/reddit-stocks/r/Bogleheads/comments/pl0wkd/is_vti_nice_because_it_automatically_rebalances.json": "One thing I keep hearing is that VTI is nice because it automatically rebalances\nsince, by not selling it's holdings, it will always represent the market weight\nof it's holdings. This makes it simple to own.\n\nBut isn't that effectively the same thing as holding multiple asset class ETFs\nthat…",
  "data/reddit-stocks/r/Bogleheads/comments/pl2g6y/help_trying_to_call_vanguard_support.json": "So we have been trying to open a new account for a spousal IRA but can't get\npassed through the E-sign section. After we e-sign and click submit, it always\ndirects us to a page that says 'system unavailable'.\n\nWe have been trying to reach Vanguard by phone but to no success. Even opt for a\ncall back…",
  "data/reddit-stocks/r/Bogleheads/comments/pl7grt/parent_got_really_upset_with_me_for_investing_at.json": "basically, around my 21st birthday earlier this year I set up a robinhood\naccount (I know, robinhood bad, whatever) and had decided to instead of using a\n401k/roth I would use a brokerage firm like robinhood, fidelity, or webull. I\nfigured I'd try to get some investing experience (just the whole…",
  "data/reddit-stocks/r/Bogleheads/comments/pl7zll/why_does_everyone_think_having_people_manage_your.json": "I really feel like I am in the minority and feel like I’m on crazy pills some\ndays. Sadly my dad passed away this year and each of the kids received a\nbeneficiary IRA.\n\nHe was with edward jones and they had him in some really high exp ratio funds.\nMy first order of business was to move to Schwab and…",
  "data/reddit-stocks/r/Bogleheads/comments/pl826i/where_can_i_actually_buy_a_jack_bogle_bobblehead.json": "Looking for a desk ornament that will let me appreciate the man that has\nprovided me sound financial advice and guidance. And to help me remember the\n\"Stay the Course!\"\n\nAnyone got any leads on where I might find one to buy? Thanks!",
  "data/reddit-stocks/r/Bogleheads/comments/plmauf/what_are_the_chances_of_my_money_growing_if_i.json": "To give you guys some context. I'm a 24 y/o Thai living in Thailand. I own a\nsmall cardboard box factory that I inherited from my parents 2 years ago. Before\nI took over, the business was on a decline since my parents were getting too\ntired to manage the business. I only found out a few months later…",
  "data/reddit-stocks/r/Bogleheads/comments/plmm6j/mathematically_calculating_whether_your_time_is.json": "(TL:DR at the bottom)\n\nThere has been a little debate here lately on whether the time spent using\nVTI/VXUS to buy the whole world market is worth it when you could save yourself\na lot of time and trouble by just using VTWAX and be done with it. I did a\nlittle math here to help people decide for…",
  "data/reddit-stocks/r/Bogleheads/comments/pm79p5/notsogreat_etfs_in_portfolio_should_i_sell_and.json": "A few years ago (before I got to know bogleheads) I was working with an advisor\nthat built for me an ETF portfolio of ~12 ETFs. Since then I decided that all my\nnew money goes to VTI/VXUS/BND, but I never sold the old ETFs because I didn't\nwant to be hit with a substantial tax event - those are ETFs…",
  "data/reddit-stocks/r/Bogleheads/comments/pm7g6n/fibbing_to_the_vanguard_robo_phone_menu_may.json": "TLDR: When the VG phone robo menu asked me if I had 300,000 to invest I said no.\nI mentioned this to the customer service representative (CSR) and she said I did\nthe right thing. If I had said yes I would have been directed to a department\nthat wasn't trained to help with the questions I had.\n\nI…",
  "data/reddit-stocks/r/Bogleheads/comments/pm8lew/my_dad_who_also_uses_my_reddit_profile_he_asked_a.json": "He (56y/o M) sold all of his stocks first, then most of his funds, though he is\nkeeping my mom's 12 shares of Amazon and his own FCNTX fund, because he says\nit's been making him a lot of money, (even though it has a relatively high\nexpense ratio). He's never really been that good with finances,…",
  "data/reddit-stocks/r/Bogleheads/comments/pml6yw/is_vxus_necessary.json": "I came across this article from JL Collins, suggesting that International\nexposure is already built into VTI, so there's no need to invest in a separate\nInternational index fund.\n\nhttps://jlcollinsnh.com/2012/09/26/stocks-part-xi-international-funds-2/\n\nI realize this goes against the 3 fund…",
  "data/reddit-stocks/r/Bogleheads/comments/pmolgp/may_i_make_the_case_against_being_so_aggressive.json": "Running thru some scenarios on portfolio visualizer. While no one can predict\nfuture returns, there are a lot of warnings and indicators of a correction at\nbest and a crash at worst coming. Just out of curiosity I decided to pit some\naggressive portfolios against some more conservative portfolios.…",
  "data/reddit-stocks/r/Bogleheads/comments/pmq0iz/how_do_bogleheads_feel_about_gold.json": "Is an allocation of 5-10% justified in a portfolio? Perhaps in place of where\nbonds may previously have been - so instead of 70:30, perhaps 70:25:5 or\n70:20:10?\n\nWith the rationale that due to the low yields on bonds enforced by central bank\nactions, they are essentially a different beast to what…",
  "data/reddit-stocks/r/Bogleheads/comments/pn9jf7/i_cannot_invest_in_mutual_funds_or_etfs_what.json": "Hi all. I am a US citizen living in Europe. Because of regulations on both sides\nof the Atlantic, I am unable to purchase mutual funds or ETFs anywhere in the\nworld (don't ask why, just google FATCA, PFICs, and PRIIPs). Individual stocks\nare okay though, so I plan on direct indexing instead.\n\nI…",
  "data/reddit-stocks/r/Bogleheads/comments/po1yzl/weighting_the_global_market_with_sp_500_what_are.json": "I’m currently 80% VT and 20% VOO. How does your portfolio stack up? What have\nyou used to reach this decision?",
  "data/reddit-stocks/r/Bogleheads/comments/po6287/boomers_and_bogleheads_an_observation.json": "This past month, I have been visiting a lot of relatives on my fiance's and my\nown side. Many come from different walks of life, but more often than not, thing\nlike careers and the economy came up.\n\nPeople would shoot the shit on markets and how their investments were doing.\nMind you, most of these…",
  "data/reddit-stocks/r/Bogleheads/comments/poail0/smashed_vtwax_button_and_not_looking_back.json": "Been a \"boglehead\" for the past year or so, but couldn't stop playing with tilts\nto REITS, SCV, &EM.\n\nToday I realized that the \"premium\" I earn from not f-ing with my portfolio\nwould be greater than any factor tilt, etc. My portfolio is now three fund in\nglobal cap weight.\n\nI believe I will have…",
  "data/reddit-stocks/r/Bogleheads/comments/poe0nc/using_a_small_amount_of_leverage_to_accelerate.json": "I have been learning more about personal finance over the last year, and am very\ndrawn to the \"boglehead\" style of investing due to the low risk and nearly\nguaranteed high return in the long run (20+ years). I understand why it is\nexcessively risky when a person overleverages themselves and loses…",
  "data/reddit-stocks/r/Bogleheads/comments/pou8ta/when_do_you_take_profits_on_stock.json": "I have been investing for some time now and used to just take 100% of the\nprofits to lock it in. Is there a better way to do it. I read it somewhere\nonline that taking maybe 20-30% of gains, just to secure it was a good move.\nWhat are your strategies?\n\nThank you.",
  "data/reddit-stocks/r/Bogleheads/comments/pp05we/portfolio_for_5m.json": "What advice would you have for a boglehead strategy for $5M. The investor is 75\nwith incredibly low spending (basically lives off social security). I looked\nwith her at her portfolio and it currently is managed by a “planner” in active\nstock picks with high fees. She doesn’t worry about markets…",
  "data/reddit-stocks/r/Bogleheads/comments/ppg7sb/why_arent_bank_savings_interest_rates_rising.json": "I was under the impression that as inflation ticks up, savings interest rates\nwould tick up, too, but that hasn't happened. Is it because this current uptick\nin inflation is seen as transitory? I'm just surprised that savings rates are\nstill so dismal. I see the 30-year mortgage rate is also still…",
  "data/reddit-stocks/r/Bogleheads/comments/ppmzqi/advice_for_29_year_old_with_200k_in_checking.json": "So I’ve been saving money and not investing it since I wasn’t confident to put\nit anywhere. I’ve done a fair amount of research and it seems VT would be the\nbest bet to put a bunch and just let it sit for 20+ years, but I’m not 100% on\nthat.\n\n2 things to note, all tax advantaged accounts are maxed…",
  "data/reddit-stocks/r/Bogleheads/comments/ppyiwe/understanding_how_bond_funds_work.json": "For context, I'm trying to decide if my 10-20 percent allocation to fixed income\nshould go to series I savings bonds (current rate: 3.54%) or into an index fund\nETF like BND.\n\n*EDIT*: I know that if interest rates go up, prices on current bonds will go\ndown. What are the main factors that drive a…",
  "data/reddit-stocks/r/Bogleheads/comments/pq07ih/vtvti_and_the_affects_of_climate_change_long_term.json": "So I'm really interested in what y'all would think about how climate change\nwould affect the US or world stock market in the long term from now. Having just\ngotten hit with hurricane Ida and having Laplace be completely devastated, it's\nestimated that parts of Louisiana will be entirely underwater…",
  "data/reddit-stocks/r/Bogleheads/comments/pq3tro/returns_if_you_miss_the_10_worst_days_of_trading.json": "https://preview.redd.it/qyxi50sme3o71.png?width=1648&format=png&auto=webp&s=060566cd43b7aa2fed9d6df18a41b18dabf35f97\n\n\" An update to the classic \"what happens if you miss the 10 best days in the\nmarket\" where advisors tell you that \"it is not timing the market but time IN\nthe market that matters\"…",
  "data/reddit-stocks/r/Bogleheads/comments/pq41c0/wealthfront_management_vs_vti_vxus_qqqm.json": "Hello all, i am 35 years old and i have been maxing out my 401k with my job for\nthe past 4 years (Have an emergency fund in a savings account as well). With my\nextra money i have recently started investing into Wealthfront management\n(little over a year ago) with 9.5 risk score. This year i also…",
  "data/reddit-stocks/r/Bogleheads/comments/pqdhv9/i_had_a_once_in_a_life_time_sale_and_just.json": "Goal is maximum returns for $80K while being tax efficient and safe! Come back\n20 years later and see how much I amassed. That's the plan.\n\nMy own research and thinking tells me 100% VT. The whole haystack approach?\nPlease critique? I struggled with U.S markets vs Global. U.S does really well\nbut I…",
  "data/reddit-stocks/r/Bogleheads/comments/pqgpw1/750k_in_company_stock_want_to_diversify_not_sure.json": "Hello,\n\nI’ll try to keep this short. I have about $750k in my company’s stock. I would\nlike to diversify, but it doesn’t make sense to me to sell if I’m going to have\nto pay a bunch of capital gains on it. My company’s stock has appreciated a lot\nover the last few years, and the bulk of it I got…",
  "data/reddit-stocks/r/Bogleheads/comments/pql21r/best_bogleheads_alternative_investments_not.json": "Is there any advice on this ?",
  "data/reddit-stocks/r/Bogleheads/comments/pqp94x/retired_in_june_2021_moving_from_federal.json": "I am moving $400K from my TSP. They asked what I need per month and I would like\n$1600.\n\n1)At what point, if I move the money at 59 1/2, will I be taxed? At the point I\nreceive $1600/month? 2) Does anyone have an opinion on the Vanguard active\nmanagement at 0.3%/year? 3) Is there a better strategy…",
  "data/reddit-stocks/r/Bogleheads/comments/pqs848/bogleheads_as_cure_for_common_conspiracy_theories.json": "Hello gang,\n\nI would like to express my gratitude to this subreddit, Bogle, Larimore, & Co.\nfor spreading the indexing gospel. I have a relative who subscribes to a gaggle\nof investor newsletters, including the types that rile up goldbugs, doomsday\npreppers, and xenophobes. Knowledge of indexing has…",
  "data/reddit-stocks/r/Bogleheads/comments/pqw18n/why_has_insert_vanguard_fund_here_dropped_by_more.json": "One very common post that we see around this time of the year is a question. Why\nhas a certain Vanguard fund done so poorly today compared to the sector of the\nstock market it’s tracking?\n\nThe answer: it’s that time of the quarter when Vanguard’s mutual funds and ETFs\nare going to start paying…",
  "data/reddit-stocks/r/Bogleheads/comments/pr82iz/100k_passive_investment_at_28_yo.json": "Hi everyone!\n\nI got about 100k to invest and after some research i got a plan i'd like to\nshare with you and get your opinion about. First, i'm 28 years old at the end of\nthis week (so technically still 27 :D) and i was looking for a long term\ninvestment that wouldn't require too much managment.…",
  "data/reddit-stocks/r/Bogleheads/comments/pra17k/worth_it_to_get_a_vanguard_advisor_for_03_per_year.json": "Brand new Boglehead here!\n\nI'm 33, my wife and I have $150k in ROTH and 401k accounts. After a lot of\nresearch, we are moving from LPL Financial (Dave Ramsey advisor who put our\nmoney in 5.75% front load mutual funds) to Vanguard index funds. Is it worth it\nto get an advisor for 0.3%?\n\nReasons we…",
  "data/reddit-stocks/r/Bogleheads/comments/prmuij/how_do_you_not_freak_out_as_a_boglehead.json": "Freaking out and a little pissed that I bought lump sumed VOO at the top ($415+)\n\nHow do you guys stay sane and not check every few minutes to find out net worth\nhas dropped? I know it will go up eventually but man sometimes the psychology is\ndifficult to see that you are losing money, only to think…",
  "data/reddit-stocks/r/Bogleheads/comments/ps1ali/i_played_with_an_ai_text_generator_and_all_i_got.json": "As the title says, I learned about InferKit from this /r/slatestarcodex post on\nhilarious AI-generated Puritan names\n[https://www.reddit.com/r/slatestarcodex/comments/prgvwa/aigenerated_puritan_names/]\nand gave their free demo [https://app.inferkit.com/demo] a whirl.\n\nI started with the following…",
  "data/reddit-stocks/r/Bogleheads/comments/psjv7m/psychology_of_buying_the_dip.json": "I am still relatively new(ish) to the entire online investing space.\n\nDo any Bogleheads have any good insights on why people seem to unload copious\namounts of money at the slightest market downturn?\n\nTo me, it makes no sense psychologically. If I own a security at $100 and say it\ntumbles a bit and…",
  "data/reddit-stocks/r/Bogleheads/comments/psoe1w/is_there_any_reason_to_hold_bndx_bndw_etc_rather.json": "Title is pretty self-explanatory I suppose. There are obvious benefits to\nholding international in addition to U.S. stocks, but can the same be said for\nbonds? How do you handle this issue in your own portfolio?",
  "data/reddit-stocks/r/Bogleheads/comments/pswqo2/im_buying_the_dip.json": "Because it's about time for my regular purchase with a pay check. My market\ntiming happens every 2 weeks.",
  "data/reddit-stocks/r/Bogleheads/comments/pt82ba/mustlisten_podcast_for_vtsax_vti_investors_gerry.json": "https://bogleheads.podbean.com/e/episode-037-gerry-o-reilly-and-rich-powers-host-rick-ferri/",
  "data/reddit-stocks/r/Bogleheads/comments/pt9l1a/im_almost_ready_to_start_investing_in_etf_should.json": "Hi r/Bogleheads [/r/Bogleheads]\n\nI recently learned about the existence of ETF, lazy-investing, and compound\ninterests. I have opened an account in an online bank in my country, and I am\nalmost ready to go. But with the crash of Evergrande, I wonder if it's wise to\nstart now or in few weeks. What…",
  "data/reddit-stocks/r/Bogleheads/comments/ptu2p3/any_reason_to_keep_hsa_open.json": "A few years ago the small company I work for went to a high deductible health\ncoverage plan and most employees (including me) opened an HSA with a local bank.\nAfter a couple of years most of us went back to a lower deductible option that\nno longer qualifies for HSA deductions.\n\nI had built up about…",
  "data/reddit-stocks/r/Bogleheads/comments/pu3hgy/i_did_it_i_lump_sum_invested.json": "After having large amount of savings for years I finally put 90% of it into\nSCHB. I know you all are Vanguardphiles but I'm just here for the chit chat.\nFeels good to finally have unloaded and stop thinking about when I should do it.\nWho cares if the market goes up or down? I'll revisit this…",
  "data/reddit-stocks/r/Bogleheads/comments/pulhc0/bought_my_first_vwce_today.json": "My journey starts! Just got my first 100 VWCE, I wish I had done it before, but\nbetter late than never.\n\n(EU user, so I can't get VT or VTI)\n\nI was a bit nervous dropping this lump sum, to be honest. I'll keep adding\nanything I can every month. It's hard not to try to time the market! But I…",
  "data/reddit-stocks/r/Bogleheads/comments/pulthl/boglehead_vs_dividend_strategy.json": "Can anyone please explain if/ why investing in an index fund like VTWAX would be\nbetter than picking 25 dividend stocks for a 25 year period? Is a combination of\nthe two strategies a bad idea?",
  "data/reddit-stocks/r/Bogleheads/comments/punmi2/where_do_you_vt_and_chill.json": "On mobile, apologies if formatting is screwy.\n\nGot a $3k bonus and want to take up the opportunity to open a Roth IRA for some\nVT and chill. I was just going to open a Vanguard account and use VTWAX, but\nthere are about a million and 1 different brokerages I can use to buy VT. Wanted\nto poll the…",
  "data/reddit-stocks/r/Bogleheads/comments/putv3i/just_opened_my_first_roth_ira_account_not_sure.json": "Sup all! I'm 26 and just opened my first ROTH IRA account with Charles Schwab.\nBeen reading about the Three Fund Portfolio method and Target Date Funds. All\nthe information is a little overwhelming so I'm coming to you guys for advice!!\nI'm not a very active investor so I'm really just looking to…",
  "data/reddit-stocks/r/Bogleheads/comments/puy3i2/used_a_compound_interest_calculator_and_its.json": "Hi guys, recent boglehead. I've chucked $35,000 into VTSAX and VTIAX. Saving\n$3,500/month which is more than half my salary. My hopeful number is $2.5\nmillion. At 7% interest, it'll be 23ish years.\n\nI'm 28 so I'll be in my mid fifties, which isn't even that much earlier than\nanyone else. It's not…",
  "data/reddit-stocks/r/Bogleheads/comments/pvin0a/the_bogleheads_guide_to_investing_says_that_50k.json": "Page 141 of the BogleHeads' Guide to Investing (see screenshot\n[https://i.imgur.com/8oivX6X.jpeg]) has a thought experiment: what would happen\nif you take $50,000 of stocks and $50,000 of bonds and put one in a taxable\naccount and the other in a tax-advantaged account such as a 401(k)?\n\nIt took me…",
  "data/reddit-stocks/r/Bogleheads/comments/pvkyly/where_do_you_keep_your_cash.json": "Hello all. I've been lurking here for a bit trying to get knowledge on the Bogle\nway. I'm very curious on where you all keep your cash for the best return on it?\nI have an Ally account with .50% which is much better than my brick and mortar\nbank savings. I appreciate the help and insight from you…",
  "data/reddit-stocks/r/Bogleheads/comments/pvtw1a/no_bogle_for_old_men.json": "Hello dear bogleheads, i ve been lurking this sub for a while and noticed that\npeople usually ask if is it better to just invest right now or wait for\ncorrection.\n\nNaturally, the easy answer is just invest since the long term outlook of the\ninvest makes any correction just a little bump in the chart…",
  "data/reddit-stocks/r/Bogleheads/comments/pvu5ho/should_i_continue_to_put_in_16_of_my_income_into.json": "I have been working at a non-profit hospital for around 5 years now and about\n2-3 years ago started looking at the future. I first started thinking investing\nis easy, but of course after months of learning I realize it is more complicated\nthen I originally realized.\n\nI stumbled across Vanguard ETFs…",
  "data/reddit-stocks/r/Bogleheads/comments/pvvc25/question_on_i_bonds_for_emergency_fund.json": "I've been seeing a lot of people recommending keeping emergency fund in I bonds\nto protect against inflation. I reviewed some information on treasury direct and\njust wanted to confirm it here.\n\nMy 6 month emergency fund is $25,000 currently just sitting in a HYSA with Ally\ngetting 0.5%. I was…",
  "data/reddit-stocks/r/Bogleheads/comments/pw0of2/how_much_of_your_money_do_you_invest.json": "This is not really an advice request post, just curious about what others are\ndoing. So far I've set a lump sum buy order for an index fund and waiting for it\nto be fulfilled. I currently cannot really afford to invest much of my monthly\nwages so I've only set a small recurring deposit into Vanguard…",
  "data/reddit-stocks/r/Bogleheads/comments/pw4xn5/rate_my_roth_401k_for_my_first_ever_job.json": "Would appreciate any feedback, positive or negative\n\nSet at 15% of post-tax income\n\n\n\n * 50% S&P 500 Index Fund\n * 21% S&P MidCap 400 Index Fund\n * 15% International Large Cap Index Fund\n * 14% Small Cap Core Fund\n\nAll of these have expense ratios of less than 0.03%\n\n\n\nTIA",
  "data/reddit-stocks/r/Bogleheads/comments/pwehq1/of_total_portfolio_in_a_taxable.json": "What percentage of your total investment portfolio is in your taxable account? I\nknow the consensus is to max out all retirement accounts first so i was just\ncurious!",
  "data/reddit-stocks/r/Bogleheads/comments/pwgsw1/today_is_the_day.json": "I leave my financial advisor , going to go through the painful process of moving\nall my stuff over to Vangaurd. Here's my plan\n\nRoth ira 1. Vtsax/fxiax $200k Roth ira 2 . Vtwax $ 5000( wife just started hers\nand is 8 years younger than myself) Account that has $135k ( taxable) Vti/vxus\n\nHow does…",
  "data/reddit-stocks/r/Bogleheads/comments/px89i5/hobbies.json": "Curious what other Bogleheads hobbies are? Myself, I just work and hang out with\nmy family. I read a book from time to time. Quite boring actually. I play with\nmy dog a lot and also give long talks to my teenage kids about the importance of\nschool and finances.",
  "data/reddit-stocks/r/Bogleheads/comments/pxdraw/is_this_what_old_money_does_buy_hold.json": "Hello,\n\nI've been spending a lot of time on the east coast - this past summer I spent a\nlot of time in CT, The Hamptons, Upper East Side of NYC, etc. I met sooo many\npeople my age (early 20s) who came from incredibly wealthy families. They are\nthat \"old money\" - extremely kind and well mannered, ivy…",
  "data/reddit-stocks/r/Bogleheads/comments/pxlzsa/how_much_advice_should_you_give.json": "The buzz about a possible market crash in the near future is something I seem to\nhear more and more each day. Recently I was in the barber shop and overheard one\nof the barbers and a client discussing the “inevitable” market crash to come and\nhow they were moving all of their money to cash.\n\nIn…",
  "data/reddit-stocks/r/Bogleheads/comments/pxtt2l/my_company_offers_very_limited_options_in_funds.json": "The funds my company offers in my 401k aren't great, but obviously worth still\ninvesting in. I've typically been all in on the S&P fund because it has the best\nexpense ratio, but having read about the importance of having small cap US\nstocks and international exposure in my portfolio, should I…",
  "data/reddit-stocks/r/Bogleheads/comments/pxwr4u/what_should_i_start_my_roth_ira_with.json": "I'm 18 and I just started my ROTH IRA but Idk if I should be instantly\ndiversifying with international and bonds or if I should just initially focus on\nmaximum growth. As well as Idk if I should go with VTSAX or VTI. I'm on vanguard\nand can't use fractional shares unless I go with VTSAX.",
  "data/reddit-stocks/r/Bogleheads/comments/py185t/windfall250k_where_to_put_it.json": "250k inheritance, 58 years old. I have Roth and tradition 401K through work(high\n6 figures), great job, house is 80% paid off ...don't \"need\" the money for\nanything now but want a good solid investment(s) at Vanguard to put this for\nsafety and growth.\nInsight? Thank you",
  "data/reddit-stocks/r/Bogleheads/comments/py5x29/how_did_you_become_interested_in_index_funds.json": "I'm actually very risk averse and to be honest, a while ago the idea of\ninvesting in anything at all was very scary to me. My game plan was to just keep\nworking and keep saving, I didn't want any risk of losing money, I was fine with\ninflation slowly eating away at my money though.\n\nEarly this year…",
  "data/reddit-stocks/r/Bogleheads/comments/py7upv/i_noticed_the_arkrelated_posts_have_really_dried.json": "... which wound up 'out of sight, out of mind' for me until an old thread came\nup on Bogleheads.org\n[https://www.bogleheads.org/forum/viewtopic.php?f=10&t=339971] because someone\nposted to it (which resurfaces threads). Anyway, I went to look up the ticker\nand sure enough, ARKK has done pretty…",
  "data/reddit-stocks/r/investing/comments/pffisi/keep_rental_property_or_invest_in_stocks.json": "What’s up everybody, looking for some advice and feedback on my situation. I’m\n34, have 3 kids, wife doesn’t work, and I am fortunate enough to own a rental\nproperty with no mortgage. I net about $1250/month after HOA, taxes, insurance\netc. that doesn’t include unexpected expenses like fixing the AC…",
  "data/reddit-stocks/r/investing/comments/pfg7vg/why_has_panasonic_pcrfypcrff_traded_poorly_for_5.json": "Market cap: ~$27-29b\n\nRevenue (2020): $68b\n\nYTD performance: 2.5% (SPY = 20.6%)\n\n5y performance: 16% (SPY = 107%)\n\nIf all of this \"electric car boom\" is backed by batteries, and Panasonic is one\nof the world's leading automative battery producers, why have they not grown?\n\nMarket Cap:…",
  "data/reddit-stocks/r/investing/comments/pfokw3/aoc_calls_on_biden_to_replace_powell_what_would_a.json": "Source\n[https://finance.yahoo.com/news/aoc-calls-joe-biden-replace-161225656.html]:\n\n> As news of the possible reappointment of Federal Reserve Chair Jerome Powell\n> circulates, we urge President Biden to re-imagine a Federal Reserve focused on\n> eliminating climate risk and advancing racial and…",
  "data/reddit-stocks/r/investing/comments/pft42l/cathie_woods_ark_files_for_new_transparency_etf.json": "ARK Investment Management is looking to debut a new ETF that will focus on\ntransparency in companies and shun vice and sectors that run afoul of ESG\ninvesting like fossil fuels.\n\nIn an SEC filing, Cathie Wood's shop outlines the fund, which looks to be at\nleast 80% invested in stocks in its…",
  "data/reddit-stocks/r/investing/comments/pfy773/i_just_realized_that_one_of_the_stocks_i_own_is.json": "I'm a pretty casual investor. I check in a few times a month, sometimes less. I\nbought some TLND many years ago. I was checking the price recently, and noticed\na very strange jump and plateau. I found out it was because it was in the\nprocess of getting acquired for a set price, and thus it plateaued…",
  "data/reddit-stocks/r/investing/comments/pg26gz/okta_announces_strong_second_quarter_results.json": "[text](https://ca.finance.yahoo.com/news/okta-announces-strong-second-quarter-200100388.html\n\nSAN FRANCISCO, September 01, 2021--Okta, Inc. (Nasdaq: OKTA), the leading\nindependent identity provider, today announced financial results for its second\nquart...) Q2 revenue grew 57% year-over-year;…",
  "data/reddit-stocks/r/investing/comments/pgh92i/chewy_announces_second_quarter_2021_financial.json": "Chewy, Inc. (NYSE: CHWY) (\"Chewy\"), a trusted destination for pet parents and\npartners everywhere, has released its financial results for the second quarter\nof fiscal year 2021 ended August 1, 2021, and posted a letter to its\nshareholders on its investor relations website at…",
  "data/reddit-stocks/r/investing/comments/pghek6/chargepoint_stock_charges_higher_after_sales_beat.json": "Chargepoint Holdings Inc. disclosed Wednesday that its car-charging stations had\nproduced better sales than expected in the second quarter, and executives\nincreased their sales target for the year, sending shares more than 13% higher\nin after-hours trading.\n\nChargepoint reported a second-quarter…",
  "data/reddit-stocks/r/investing/comments/pgictj/heavily_indebted_chinese_developer_evergrande.json": "Read the full article here\n[https://www.ft.com/content/e870dd10-223c-411e-9e72-53c3b8e609b6]\n\n> Evergrande has warned it risks defaulting on its debt if it fails to raise\n> cash, as China’s most heavily indebted property developer battles to stave off\n> an unfolding liquidity crisis. The unusually…",
  "data/reddit-stocks/r/investing/comments/pgn3h8/investing_in_the_current_ath_market.json": "I'vw been doing monthly investment in sp500 for a few years. That had worked\nwell on the past years when there are up and downs.\n\nhowever, right now the market is at an all time high. There's research that\nshows that regular investment will likely be better in the long run as I put the\nmoney to work…",
  "data/reddit-stocks/r/investing/comments/pgnbnu/why_do_so_many_people_dislike_the_federal_reserve.json": "I know hating the federal reserve is a really big talking point used by the\ncryptocurrency enthusiasts to get people to buy and not sell cryptocurrencies.\nIf people didn't buy cryptocurrency that whole ecosystem would not work.\n\nBut given the state of the financial economy and the world (it is based…",
  "data/reddit-stocks/r/investing/comments/pgo4l0/anybody_hedging_heavily_against_a_downtown.json": "Pretty self explanatory. You may not believe things will go down, and if so it’s\nnot my intention to argue — I’m familiar enough with investing to know value\nstocks will win if held in the long run and I understand we’re in the greatest\nbill run in history BUT I can’t help but see breaks in the dam.…",
  "data/reddit-stocks/r/investing/comments/pgr364/any_recommendations_for_cybersecurity_stocks_that.json": "I've been trying to get into the cybersecurity and data privacy industry because\nof it's monster growth projected over the next decade (CAGR of 9% and 41.5%,\nrespectively). Sadly, it seems I'm a little late to the party because every\ncompany I've seen is ridiculously overvalued imo. I'm not usually…",
  "data/reddit-stocks/r/investing/comments/pgy04s/why_does_common_stock_appreciate_more_than.json": "I understand that preferred stock pays out more in dividends, and is preferred\nin the case of bankruptcy. But why should it not appreciate as much as common\nstock?\n\nIf the company is worth $1m, with 100k shares, then a thousand shares of either\npreferred or common stock would amount to 1% ownership.…",
  "data/reddit-stocks/r/investing/comments/phbmmh/senate_democrats_float_taxes_on_stock_buybacks.json": "Senate Finance Committee Democrats are looking at several tax options for paying\nfor their social-spending bill that have not been previously proposed by the\nWhite House, including taxes on stock buybacks and materials used to make\nsingle-use plastics, according to a document obtained by The…",
  "data/reddit-stocks/r/investing/comments/phd21p/a_canadian_trust_is_likely_accelerating_the.json": "Edit: I just want to note upfront, I'm not advocating you go out and buy Uranium\nminers or trust/futures etc. My purpose is to share what I think is an\ninteresting study in reflexivity / market behavior.\n\nThere's something funky going on in the Uranium market. On the 17th of August,\nUranium prices…",
  "data/reddit-stocks/r/investing/comments/phf53z/possible_to_redeem_old_paperbased_shares.json": "I have sort of a strange situation.\n\nI recently found some shares in a company that belonged to my late grandfather-\nliterally a piece of paper, like how they used to do it in the old days (aka\nphysical stock certificate). I'd hate to throw away something valuable on the\nassumption that they're…",
  "data/reddit-stocks/r/investing/comments/phmwpr/when_will_the_economy_return_to_normal.json": "Everywhere I go I see price increases, places state their disributor increased\nthe prices. For example, theres a special toothpaste I use from my local\ndentist, it used to cost $12, now its $20. The prices of used cars have\nskyrocketed. The local motorcycle dealers cannot get any stock and I am…",
  "data/reddit-stocks/r/investing/comments/phpwtr/watch_out_for_variable_annuities.json": "The worst financial decision I ever made was getting 200k worth of variable\nannuities with Met Life\n\nAs Anthony Robbins says in his book Money master the game, variable annuities\nare invariably bad.\n\nI held on to my annuities for 13 years so that they would get back to their ore\nsubprime mortgage…",
  "data/reddit-stocks/r/investing/comments/pi3ep7/company_acquiring_another_one_offers_notes.json": "Hi all,\n\nThe company I work for was acquired by a private equity firm (PEF) - they went\nfrom a public company (shares was on the stock market) but they were all bought\nby the PEF.\n\nNow a larger software based company (LSBC) has acquired them from the PEF - the\nLSBC isn't offering the staff shares as…",
  "data/reddit-stocks/r/investing/comments/pi8u2l/help_for_a_us_citizen_living_abroad.json": "Hey guys, I’m a 21 year old student living in Switzerland, and i’ve been wanting\nto get into investing, but it’s so difficult!! I was born kn the US, so i have a\nUS passport, but i moved to Switzerland when i was one, so i have a Swiss\npassport as well. I’ve tried DEGIRO, Flowbank, Trading 212, but…",
  "data/reddit-stocks/r/investing/comments/pifa8n/my_top_tech_stocks_to_watch_that_pays_dividends.json": "My top tech stocks watchlist that pays dividends:\n\nTicker AAPL MSFT AVGO CSCO INTC NVDA TXN Yield 0.57% 0.74% 2.89% 2.49% 2.6%\n0.07% 2.15% PE 30.20 37.78 19.92 18.79 11.89 76.98 25.73 Payout 17.22% 28.11%\n57.65% 46.54% 30.89% 5.39% 55.28% Div Growth YR 9 17 10 10 7 0 15 CAGR 5yr 9.3%\n9.52% 50% 9.21%…",
  "data/reddit-stocks/r/investing/comments/piilzz/am_i_wrong_for_chasing_dividends_in_my_scenario.json": "I am 34 and married. Combined we make $140k. We have a 1 year old entering\ndaycare and another kid on the way. Daycare is $1000+ per kid, if you are\nunaware.\n\nWe currently take $100/week out of our paycheck to invest in stocks.\nRealistically, we won’t increase this for at least 5 years, with daycare…",
  "data/reddit-stocks/r/investing/comments/pimc93/how_do_angel_investors_in_nontech_companies_like.json": "Investors in tech startups tend to prefer in companies with a hope of an exit or\nan IPO. And when that happens, the investor can hope to sell of his stock.\n\nBut what about non-tech angel investors, like those in the Shark Tank? A\nbusiness for selling salsa online or a franchise for sushi restaurants…",
  "data/reddit-stocks/r/investing/comments/piq8gj/morningstar_etf_rating_system_analysis.json": "I have recently been interested in Morningstar’s ETF rating system which has\nbeen a popular tool used for ranking ETFs and i wanted to do an experiment or\njudging of sorts on this system because picking the correct ETF for long term\ninvesting and sustainability is extremely important especially with…",
  "data/reddit-stocks/r/investing/comments/piw2sk/dividend_stocks_vs_growth_stocks_for_long_time.json": "I've recently seen a post in this sub that details someone chasing dividends, he\nwas then criticized for not investing in growth stocks given his time horizon.\nWhat's, in your opinion, the correct thing to do? I saw some comments suggest\nkeeping some dividends but concentrating the majority of their…",
  "data/reddit-stocks/r/investing/comments/pj814g/china_to_push_on_with_opening_capital_markets_to.json": "This might be good news after the rout in China tech since Feb 2021. There was a\nlot of uncertainty whether China is shutting itself off from foreign capital and\nhow it could lead to delisting of ADRs like BABA, BIDU, JD, PDD, NIO, etc. But I\nguess they won't be turning their heads away from foreign…",
  "data/reddit-stocks/r/investing/comments/pjfu6y/in_two_hours_bitcoin_becomes_the_legal_currency.json": "Read the full law…",
  "data/reddit-stocks/r/investing/comments/pjlzcs/the_new_mining_policy_in_ecuador_and_how_will_it.json": "Just last month, Guillermo Lasso, the president of Ecuador, issued Decree 151\nwhich focuses on a new mining policy, strengthening the government’s support\ntowards mining as a key driver of the economy.\n\nAccording to this article\n[https://www.miningweekly.com/article/canadian-miners-welcome-decree-in…",
  "data/reddit-stocks/r/investing/comments/pjq4mc/investors_are_ignoring_the_parallels_between.json": "https://www.marketwatch.com/story/investors-are-ignoring-the-parallels-between-stocks-today-and-heady-years-of-1929-1999-and-2007-do-this-next-says-strategist-11631013007?siteid=yhoof2\n\n\n\n 1. The S&P 500 is trading at a lofty 22.5 times forward earnings and its\n    price-to-sales ratio of 3.1 times…",
  "data/reddit-stocks/r/investing/comments/pk79ke/china_evergrande_bonds_suspended_as_prices_plunge.json": "https://www.reuters.com/business/china-evergrande-bonds-suspended-prices-slump-2021-09-06/\n\n> SHANGHAI, Sept 6 (Reuters) - Bonds issued by indebted developer China\n> Evergrande Group (3333.HK) [https://www.reuters.com/companies/3333.HK] slumped\n> on Monday after a ratings downgrade led to…",
  "data/reddit-stocks/r/investing/comments/pkbedr/how_does_investing_in_a_company_actually_impact.json": "This is basic I know but I can't really put my finger on why we invest other\nthan hoping people pay more for it later. My understanding is that a company\ncashes out when they IPO, they sell some shares on the public market and that's\ntheir profit to use as they choose. And then potentially they keep…",
  "data/reddit-stocks/r/investing/comments/pkkz2c/why_are_spy_puts_popular.json": "I know this is a question better suited in r/wallstreetbets [/r/wallstreetbets]\nbut Im kind of afraid of the answers I'll get since it's soooo.... Well you guys\nknow. But I have seen many people throwing MASSIVE amounts of put options in SPY\nso why SPY over something like VOO? Why is SPY so popular…",
  "data/reddit-stocks/r/investing/comments/pktgfk/china_said_to_suspend_approval_for_new_online.json": "Seems like every other day there is some regulatory news. China stocks are\ncurrently value traps with no end in sight. There are reports peppered in\nbetween of Chinese authorities assuring investors to not worry, but the\nregulatory pressure on China equities is alive and scary\n\nTencent Holdings Down…",
  "data/reddit-stocks/r/investing/comments/pkx5lf/tether_has_over_68bn_under_their_management_and.json": "Tether only has 13 listed employees on LinkedIn. Source\n[https://www.linkedin.com/company/tether/]\n\nThere is just over $68bn Tether in existence, meaning Tether theoretically has\n$62bn under their control.…",
  "data/reddit-stocks/r/investing/comments/plin6t/the_demand_for_copper_against_the_copper_supply.json": "Seeing the current situation, I strongly believe that the demand for copper will\njust keep on rising, so the prices will also rise unless we find more copper or\nsome other economic alternative.\n\nThis brings me to the question about the possibility of the supply to meet the\ndemand. Copper is…",
  "data/reddit-stocks/r/investing/comments/plo6gd/apple_can_no_longer_force_developers_to_use_inapp.json": "https://www.cnbc.com/2021/09/10/epic-games-v-apple-judge-reaches-decision-.html\n\nKEY POINTS\n\nJudge Yvonne Gonzalez Rogers handed down a decision in a closely-watched trial\nbetween Apple and Epic Games on Friday.\n\nRogers issued an injunction that said that Apple will no longer be allowed to\nprohibit…",
  "data/reddit-stocks/r/investing/comments/pm9mo3/what_would_happen_if_i_bought_a_call_and_a_put_of.json": "What would happen if I bought a call and a put of the same stock? Let’s say I\nbuy SPY, and I buy a call and a put of it for the same expiration date,\nobviously, one of them will make money, but as for the other one, will I just\nbreak even and have made no profit? Or is this a less risky way to buy…",
  "data/reddit-stocks/r/investing/comments/pmi8cv/is_my_fil_getting_scammed.json": "My FIL got some TD AmeriTrade guy investing some of his money who was\nrecommended by a a golf buddy (always a great sign) He told me he’s getting 8-9%\nreturns on Bank of Montreal Bonds. He showed me the statements and I just can’t\nwrap my head around how he’s getting these. The broker told him…",
  "data/reddit-stocks/r/investing/comments/pmpc67/daily_general_discussion_and_spitballin_thread.json": "Have a general question? Want to offer some commentary on markets? Maybe you\nwould just like to throw out a neat fact that doesn't warrant a self post? Feel\nfree to post here!\n\nThis thread is for:\n\n * General questions\n * Your personal commentary on markets\n * Opinion gathering on a given stock\n *…",
  "data/reddit-stocks/r/investing/comments/pmzora/website_or_downloadable_file_that_shows_asset.json": "Hey There Redditors,\n\nI am currently rebalancing two of my investment accounts. I have a taxable\naccount and another tax advantage account. I recently have read that\ninternational funds should be held in a taxable account more so than tax\nadvantage account. I am wondering if there is any website or…",
  "data/reddit-stocks/r/investing/comments/pn2936/can_you_ask_your_broker_to_get_shares_for_you_at.json": "There’s a guy I know who has a very large account. Like probably $50-100 million\naccount just guessing. He talks about having his broker reserve shares for him\nat specified prices. Is this something only for large accounts? I tried asking\nTD Ameritrade to do this last year, and they told me that’s…",
  "data/reddit-stocks/r/investing/comments/pn5dbl/beijing_to_break_up_ants_alipay_and_force.json": "Seems like BABA can't catch a break. The Ant valuation has dropped a lot ever\nsince its IPO was scuttled last November. BABA has been in a downtrend since\nthen\n\nBeijing wants to break up Alipay, the 1bn plus-user superapp owned by Jack Ma’s\nAnt Group, and create a separate app for the company’s…",
  "data/reddit-stocks/r/investing/comments/pnjnkb/how_to_hedge_against_inflation_michael_burry.json": "This is the second installment to a post I made back in May that documented some\nof my inflation DD from researching Michael Burry/Scion's 13F plays. People on\nother subs found the information in part 1 useful so I thought I'd make a part 2\nspecifically for the broader audience on r/Investing…",
  "data/reddit-stocks/r/investing/comments/po1u02/cpi_rises_3_in_august_53_over_last_12_months.json": "https://www.bls.gov/cpi/\n\nPress release: https://www.bls.gov/news.release/cpi.nr0.htm\n\n> The Consumer Price Index for All Urban Consumers (CPI-U) increased 0.3 percent\n> in August on a seasonally adjusted basis after rising 0.5 percent in July, the\n> U.S. Bureau of Labor Statistics reported today.…",
  "data/reddit-stocks/r/investing/comments/poa55p/why_arent_reits_up_more.json": "So for instance, looking at SCHH (Schwab's REIT ETF), it's just barely reaching\npre-pandemic levels. But I understand the price of housing is up massively over\nthe same period [https://fred.stlouisfed.org/series/MSPUS], and that rent is\nalso at an all-time-high.\n\nSince I understand that REITs own…",
  "data/reddit-stocks/r/investing/comments/pok52d/china_has_just_told_investors_that_chinese.json": "https://twitter.com/Fxhedgers/status/1438008812569464836\n\n> CHINA TELLS BANKS EVERGRANDE WON'T PAY INTEREST DUE SEPT. 20\n\nhttps://twitter.com/Fxhedgers/status/1438016209765605377\n\n> FITCH WIRE: FITCH DOWNGRADED CHINA EVERGRANDE GROUP TO 'CC' FROM 'CCC+' ON 7\n> SEPT, INDICATING THAT WE VIEW A DEFAULT…",
  "data/reddit-stocks/r/investing/comments/powjq3/the_lose_money_with_friends_motto.json": "Some of you may remember that today is the anniversary of the Lehman Brothers\nbankruptcy which occurred on September 15, 2008. The bankruptcy is the largest\nin US history and triggered a 4% one day drop of the DJIA.\n\nMany of you may be aware that this subreddit started in March 2008 with the\nmotto…",
  "data/reddit-stocks/r/investing/comments/powp8z/new_congressional_draft_legislation_seeks_to_end.json": "https://www.bloomberg.com/news/articles/2021-09-14/etf-industry-risks-losing-key-tax-edge-as-democrat-whets-knife\n\nAmid the deluge of headlines in the past few days about congressional proposals\nto boost taxes on companies and the wealthy is one that would affect regular\ninvestors -- and potentially…",
  "data/reddit-stocks/r/investing/comments/pp0jnw/what_are_some_of_your_favorite_duopolies.json": "Companies which operate in duopolies often have wide moats which deliver good\nfinancial performance because they're less susceptible to new entrants, often\ndue to high barriers to entry. Many industries also mature to the point where\nit's only profitable for a handful of companies to operate, which…",
  "data/reddit-stocks/r/investing/comments/pp6gfl/lesserknown_stocks_that_supply_popular_industries.json": "We see a lot of hype around popular industries like genomics, semiconductors, or\ncars, and often these hyped-up stocks end up becoming scarily overvalued.\n\nAnother way to invest in growing and hyped-up industries is to invest into\ncompanies that produce the supplies for these industries, rather than…",
  "data/reddit-stocks/r/investing/comments/pp97tw/is_there_any_point_in_investing_in_anything_else.json": "Goal: put money into some position, forget about it for decades.\n\nThere's this statistic around that ~90% of investors underperform the market. A\nsafe (-ish) and easy way of investing is therefore to just dump money into an\nindex, especially for long term growth.\n\nThe world economy is heavily linked…",
  "data/reddit-stocks/r/investing/comments/ppb0hd/sec_gives_whistleblower_110_million_in_payout.json": "Article\n[https://www.bnnbloomberg.ca/sec-gives-whistle-blower-110-million-in-second-biggest-payout-1.1652749]\n\n(Bloomberg) -- The U.S. Securities and Exchange Commission awarded $110 million\nto a tipster whose information resulted in enforcement actions, bringing total\npayments under the agency’s…",
  "data/reddit-stocks/r/investing/comments/ppw548/abbie_rinvoq_and_alternatives.json": "All,\n\nSince the past few days, Abbvie stock has fallen a bit and I'm trying to\nunderstand if it is worth buying. I already have a long position and was like to\nbuy more.\n\nThe fall is mainly attributed to the FDA decision regarding it's drug Rinvoq\nwhere the company has to put a label regarding…",
  "data/reddit-stocks/r/investing/comments/ppysia/bnpl_firm_sezzle_to_list_on_the_us.json": "Right now, buy-now pay-later (BNPL) is currently the hottest trend in fintech at\nthe moment, due to it's incredible growth rate. ASX: SZL is about to list on the\nUS markets.\n\nAffirm has been hitting new highs daily, trading at 30x revenue multiples.\nGoldman Sachs acquired the BNPL GreenSky…",
  "data/reddit-stocks/r/investing/comments/pq03ob/is_waiting_for_a_dip_the_best_investment_strategy.json": "We have all heard it! -- “Time in the market beats timing the market”\n\nAt the same time, we are all to some extent guilty of trying to time the market.\nThe market always seems to break some new all-time high records, so we wait for\nthe inevitable crash/pullback to invest. It’s high time we put both…",
  "data/reddit-stocks/r/investing/comments/pqaq6w/would_someone_please_explain_what_the_increase_in.json": "Sorry if this has been covered - I used reddit's stellar search functionality\ndidn't find what I was looking for.\n\nHaving read about the RRP on things like investopedia, I just don't understand\nwhy there is so much fanfare around it breaking over $1T, and what RRP's impact\nis on the stock market and…",
  "data/reddit-stocks/r/investing/comments/pqhlu3/what_is_the_smartest_place_to_put_my_savings_to.json": "Every time I see a post asking \"What do I do with my $xx,xxx?\", someone mentions\nVanguard Index S&P500 or something, but nobody ever explains how to do this. Can\nI just do it quickly and easily on the Robinhood app? Where should I invest my\nmoney? I just want to not have it sitting in my virtual…",
  "data/reddit-stocks/r/investing/comments/pqmtwf/sorry_about_spy_going_down.json": "I would like to apologize for the correction in the market; it’s my fault.\nEverything I touch goes down and I was just tired of all the uncertainty and\nlosing a bunch of money, so on September 7 I decided I should just put my money\ninto SPY and forget about it so that my mind could be at ease. Slow…",
  "data/reddit-stocks/r/investing/comments/pqrcc3/historically_its_way_better_to_invest_at_market.json": "Found this 2018 article, interesting/fun fact: The Stock Market Works by Day,\nbut It Loves the Night\n[https://www.nytimes.com/2018/02/02/your-money/stock-market-after-hours-trading.html]\n\n * If you had bought SPY at the last second of trading on each business day\n   since 1993, and sold at the…",
  "data/reddit-stocks/r/investing/comments/pr875c/a_better_metric_than_earnings_per_share_how_to.json": "Why earnings per share doesn't tell the full story\n[https://www.youtube.com/watch?v=jcbFh7Fdr_w]\n\nHow to calculate ROIC [https://www.youtube.com/watch?v=Uyczgn0YUr4]\n\nThis metric is interesting in that it tells you how much money is being\ngenerated from invested capital in the business. A company…",
  "data/reddit-stocks/r/investing/comments/prc1de/no_free_lunch_a_brief_primer_on_the_cost_vs_value.json": "NOTE: This is neither an advertisement nor solicitation, nor is it to be\nconstrued as financial advice. These are just observations from an experienced\ninvestor and FP&A analyst.\n\ntl;dr: The more readily available the so-called \"stock analysis/deep dive\", the\ngreater the skepticism it…",
  "data/reddit-stocks/r/investing/comments/prf40b/warren_buffetts_grandnephew_is_beating_berkshire.json": "> Warren Buffett is being edged out performance-wise by someone within his own\n> family.\n> \n> Shares of Boston Omaha (ticker: BOMN), a publicly traded holding company\n> co-led by Buffett’s grandnephew Alex Buffett Rozek, are beating Berkshire\n> Hathaway (BRK.B) stock so far this year. Boston Omaha…",
  "data/reddit-stocks/r/investing/comments/prh3k9/what_questions_to_ask_your_potential_investment.json": "I know many of you reading this are DIY investors, and that is absolutely great!\nFor some of you, it might make sense now or later down the road to consider\npursuing an Investment Advisor/Financial Advisor. I myself, work for a Boutique\nRIA firm as a portfolio manager, and am in no way soliciting my…",
  "data/reddit-stocks/r/investing/comments/prqz2k/daily_general_discussion_and_spitballin_thread.json": "Have a general question? Want to offer some commentary on markets? Maybe you\nwould just like to throw out a neat fact that doesn't warrant a self post? Feel\nfree to post here!\n\nThis thread is for:\n\n * General questions\n * Your personal commentary on markets\n * Opinion gathering on a given stock\n *…",
  "data/reddit-stocks/r/investing/comments/prv5hi/dd_taiwan_semiconductor_manufacturing_tsm.json": "Introduction\n\nThe recent chip shortage has shown that the U.S can't keep up with semiconductor\ndemand. Joe Biden has laid out a $50B subsidy plan for research and development\nin the semiconductor industry. In the CEO Summit on Semiconductor Supply Chain\nResilience, Biden stated that this was a “once…",
  "data/reddit-stocks/r/investing/comments/prw7it/chinas_growing_property_crisis_a_look_onto_a_few.json": "Assumptions…\n\n * 70% of wealth in China is held in property (elsewhere average is btw. 20 to\n   35%)\n\n * Evergrande’s international payment obligations are due on Thursday\n\n * 1/3 of current China GDP is created by construction and property related\n   activity (builders, materials/commodities,…",
  "data/reddit-stocks/r/investing/comments/prwot5/dd_cepton_investment_opportunity.json": "DD Format borrowed from this post\n[https://www.reddit.com/user/hooman_or_whatever/comments/m0vwbu/proterra_actc_dd_the_most_undervalued_stock_on/].\nEven though that stock did not age well, I thought the DD post format was great.\n\nHere's my take on\n\n\nCEPTON (GCAC)\n\nwith the conclusion that they are…",
  "data/reddit-stocks/r/investing/comments/ps3b7k/had_an_interesting_test_today_for_my_allweather.json": "I have over $1 million in my IRA, 100% invested in VTSAX. I won’t touch this\nnest egg for at least another 10-15 years and maybe longer. This is truly my\nbuy-and-hold account.\n\nSo obviously, today’s market drop doesn’t concern me in the least.\n\nI have another $10,000 in a taxable account that I use…",
  "data/reddit-stocks/r/investing/comments/ps7an3/is_this_the_sp_big_buy_time_or_still_waiting_for.json": "I invested most of my money at S&P highs of late.\n\nStill sitting on some more cash waiting to go in. Had a bigger \"emergency\" fund\nbefore, so missed out on all of the ride up sitting in a hysa.\n\nBut once I decided to go for it with the S&P, I started DCA in and pretty much\nwent in at all the…",
  "data/reddit-stocks/r/investing/comments/psieb7/what_does_evergrande_meltdown_mean_for_china_read.json": "No surprise, this comes from Michael Pettis, who is probably one of the best and\nmost reliably unbiased sources of information and analysis on China's economy.\n\nThe impact of Evergrande has caused financial distress to spread faster and more\nforcefully than Beijing’s financial regulators expected,…",
  "data/reddit-stocks/r/investing/comments/psr4fx/why_is_no_one_talking_about_the_credit_default.json": "A credit default swap is \" a financial contract whereby a buyer of corporate or\nsovereign debt in the form of bonds attempts to eliminate possible loss arising\nfrom default by the issuer of the bonds. This is achieved by the issuer of the\nbonds insuring the buyer’s potential losses as part of the…",
  "data/reddit-stocks/r/investing/comments/psv5jb/why_have_energy_companies_still_not_recovered_to.json": "https://www.macrotrends.net/1369/crude-oil-price-history-chart\nhttps://www.macrotrends.net/2478/natural-gas-prices-historical-chart\nhttps://finance.yahoo.com/chart/XLE/\n\nI recall in 2019 that valuations were depressed from a natural gas supply glut.\nNow it's looking like the inverse.\n\nI suspect the…",
  "data/reddit-stocks/r/investing/comments/pswy4x/china_evergrande_unit_says_to_make_onshore_bond.json": "No default tomorrow. US Futures shot up after this news. Chinese markets were\nclosed on Monday and Tuesday and everybody was expecting Evergrande to default\ntomorrow. No info on the fate of foreign bondholders in certain, but it is to be\nbelieved that they will most likely get stiffed. This is for…",
  "data/reddit-stocks/r/investing/comments/pt2oli/why_does_nobody_have_more_than_10_reits_in_their.json": "I have three questions:\n\n 1. For years I've been thinking about REITs vs Rental Properties.\n\nFact is: I hate managing tenants and taking out a loan in my country is not that\noptimal (I have cash anyway). For this reason I am leaning towards REITs but I\nknow so little about them, I don't know where…",
  "data/reddit-stocks/r/investing/comments/ptbd5a/imminent_china_evergrande_deal_will_see_ccp_take.json": "From the article:\n\n> Sources close to the Chinese Government have told Asia Markets a deal that\n> will see China Evergrande restructured into three seperate entities is\n> currently being finalised by the Chinese Communist Party and could be\n> announced within days.\n> \n> State-owned enterprises will…",
  "data/reddit-stocks/r/investing/comments/ptcjbo/what_is_the_indicator_that_shows_how_much_money.json": "I keep hearing this phrase - \"money on the sidelines\". What is the indicator I\ncan look at to see the historical trend of this?\n\nFrom Investopedia:\nhttps://www.investopedia.com/terms/m/money-on-the-sidelines.asp\n\nMoney on the sidelines is cash that is held either in savings or in low-risk,\nlow-yield…",
  "data/reddit-stocks/r/investing/comments/ptjv00/ford_partners_with_battery_recycling_and.json": "Ford Motor has tapped Redwood Materials to create a closed loop system for its\nupcoming deluge of electric vehicles — a partnership that will cover recycling\nproduction scrap and EVs at the end of their life as well as supplying the\nautomaker with raw battery materials.\n\nThe deal comes as Ford adds…",
  "data/reddit-stocks/r/investing/comments/ptn7fi/us_bond_lobbies_warn_sec_of_severe_disruption.json": "Lobby groups are warning that activity in the world’s biggest bond market could\ngrind to a halt at the end of this month without last-minute exemptions to an\nobscure 50-year-old rule in the US that has previously taken aim only at stocks.\n\nBond trade associations have written to regulators to say…",
  "data/reddit-stocks/r/investing/comments/ptqgax/ear_drops_nearly_52_ah_on_news_of_doj_probe.json": "Dropped from $21.67 to $10.47 after close.\n\nSounds like the insurance audit alluded to in their Q2 call has not gone well,\nwith the DOJ not only getting involved, but becoming the \"primary point of\ncontact\" re: the audit.\n\nIf I'm understanding this correctly, it sounds like the audit…",
  "data/reddit-stocks/r/investing/comments/pttwpg/is_the_market_underestimating_the_odds_of_a_us.json": "https://www.reuters.com/world/us/debt-limit-hike-bill-could-get-us-senate-vote-next-week-sen-durbin-2021-09-22/\n\nI've seen users say the GOP resistance in senate will be resolved by a\nreconciliation bill, but this article has the following quote:\n\n\"House Budget Committee Chairman John Yarmuth said…",
  "data/reddit-stocks/r/investing/comments/puao0f/predicting_financial_crashes_using_discrete_scale.json": "Read in full here - arXiv:cond-mat/9903321v3 8 Jun 1999\n[https://arxiv.org/pdf/cond-mat/9903321.pdf]\n\nIntroduction\n\nTwo recent papers [Johansen and Sornette, 1999a, Johansen et al., 2000] have\npresented increasing evidence on the Oct. 1929, Oct. 1987, Hong-Kong Oct. 1987\ncrashes, on the Aug. 1998…",
  "data/reddit-stocks/r/investing/comments/puhzwr/should_you_follow_insider_transactions_i_analyzed.json": "There is an old saying on Wall Street.\n\n> There are many possible reasons to sell a stock, but only one reason to buy.\n\nIf you think about it, you can sell stocks for any number of reasons -\ndownpayment for a house, a medical emergency, or just plain profit booking. But\nwhen you are using your hard…",
  "data/reddit-stocks/r/investing/comments/pumk8b/whos_betting_heavily_on_electric_vehicles.json": "I'm approaching this as a car nerd, not an investment genius but i really think\nthat sector will have insane growth in the next decade. Faster than current\nprojections.\n\nRight now today a BRAND NEW Tesla Model 3 is about the cheapest car on the road\nto own. Sounds crazy, most people still see Tesla…",
  "data/reddit-stocks/r/investing/comments/puy8m4/taking_out_a_loan_against_my_stocks_to_buy_a.json": "I have enough money tied up in my portfolio (not 401k or ira) that i can sell\nenough to buy a house fully in cash ….. but then I’d actually have to sell my\nshares which ehhhh.\n\nWould it be better to take out a loan against my shares to simply buy house?\nInteractive brokers offers lower rates than…",
  "data/reddit-stocks/r/investing/comments/pv34k3/daily_advice_thread_all_basic_help_or_advice.json": "If your question is \"I have $10,000, what do I do?\" or other \"advice for my\npersonal situation\" questions, you should include relevant information, such as\nthe following:\n\n * How old are you? What country do you live in?\n   \n * Are you employed/making income? How much?\n   \n * What are your…",
  "data/reddit-stocks/r/investing/comments/pva6cf/need_help_calculating_position_performance.json": "Not sure if this is the right sub to ask this question but I figured it's a good\nstart. I've been gathering data provided by my brokers api. I've used it to\ncalculate things like weekly performance. Everything was working fine using the\nmarket value of a position between two dates to calculate the…",
  "data/reddit-stocks/r/investing/comments/pvjtld/investment_in_risc_v_processor_ecosystem.json": "Investing in RISC V processor ecosystem\n\nHi,\n\nI would like to know if anyone has advice on investing in the RISC V computer\nprocessor ecosystem? Companies like andes technology and SiFive etc?\n\nThe thing is many companies working on risc v processors are either startups or\nhavent IPOd. How is a…",
  "data/reddit-stocks/r/investing/comments/pvscmt/lets_talk_about_reasonably_good_returns_along.json": "While I don't plan on it in the near term I can't totally ignore the low margin\ncost some brokers are offering. For awhile I have been kicking some things\naround to find a good all around portfolio. While I know backtesting is so\nlimited to what the future holds it's still interesting.\n\nIf I were to…",
  "data/reddit-stocks/r/investing/comments/pvv6bh/switching_to_a_smallmid_cap_fund_in_my_annuity.json": "A couple years ago I switched from my plans T Rowe 2050 target date retirement\nfund (TRRMX) to Franklins Small-Mid Cap growth fund (FMGGX) to try to see if I\ncould get some outsized returns. It’s working so far but wanted to know if this\nwas a good idea? Any risks I should know about or should I…",
  "data/reddit-stocks/r/investing/comments/pwd60w/daily_advice_thread_all_basic_help_or_advice.json": "If your question is \"I have $10,000, what do I do?\" or other \"advice for my\npersonal situation\" questions, you should include relevant information, such as\nthe following:\n\n * How old are you? What country do you live in?\n   \n * Are you employed/making income? How much?\n   \n * What are your…",
  "data/reddit-stocks/r/investing/comments/pwd6i8/daily_general_discussion_and_spitballin_thread.json": "Have a general question? Want to offer some commentary on markets? Maybe you\nwould just like to throw out a neat fact that doesn't warrant a self post? Feel\nfree to post here!\n\nThis thread is for:\n\n * General questions\n * Your personal commentary on markets\n * Opinion gathering on a given stock\n *…",
  "data/reddit-stocks/r/investing/comments/pwnujk/venture_capital_in_portfolios.json": "I’m a partner in a small venture capital firm, with a focus in the aviation and\naerospace industries. I wanted to speak to this community to better understand\nretail investors perception of venture capital, and it’s relevance to\nindividuals’ portfolio construction. It’s in the alternative investment…",
  "data/reddit-stocks/r/investing/comments/pwv6om/married_men_with_dependents_are_more_likely_to.json": "> Despite standard investment advice to the contrary, individuals often engage\n> in panic selling, liquidating significant portions of their risky assets in\n> response to large losses.Using a novel dataset of 653,455 individual brokerage\n> accounts belonging to 298,556 households, we document the…",
  "data/reddit-stocks/r/investing/comments/pwvway/the_great_market_wheeze_is_almost_upon_us.json": "I don't expect this to be super popular but I want to make it as a record to say\nI called it.\n\nThe good times are almost up.\n\nHere's a long wall of text, don't apologise for it, no TLDR. Don't expect anyone\nto read this anyway.\n\n--- Everything depends on treasury bonds and inflation ---\n\nDon't look…",
  "data/reddit-stocks/r/investing/comments/pwxqw0/the_russell_2000_has_been_rangebound_75_for_the.json": "The Russell 2000 has been effectively consolidating for the last 230 days, or 7½\nmonths, 31% up from its former 2018 all time high. When a security consolidates\nat a high, the odds are that it will break out and reach higher highs.\n\nRussell chart [https://ibb.co/pvzvQM4]\n\nWho actually sees any…",
  "data/reddit-stocks/r/investing/comments/pxe449/is_gold_still_a_store_of_value.json": "I am starting to think that gold is no longer a suitable inflation hedge or even\nan appropriate store of value. We are experiencing the most inflation in over 30\nyears right now and gold is not budging. In fact, gold is approaching\npre-pandemic prices. Furthermore, real interest rates, which are…",
  "data/reddit-stocks/r/investing/comments/pxsq91/should_you_invest_in_the_most_reputable_brands_in.json": "Coke is just soda.\n\nLevi’s are just jeans.\n\nThe iPhone is just a phone.\n\nYet, we go out of our ways to select certain brands over others - most of the\ntime at a higher price [1]. Everyone knows the importance of reputation for a\ncompany. Highly reputable brands have multiple things going for them:\n\n…",
  "data/reddit-stocks/r/investing/comments/pxvq80/new_us_sec_rules_to_call_on_hedge_funds.json": "WASHINGTON/BOSTON, Sept 29 (Reuters) - The top U.S. securities regulator on\nWednesday will propose requiring large hedge funds and endowments to disclose\nhow they vote on executive pay, bringing this clutch of influential investors in\nline with other top funds that have made their pay votes public…",
  "data/reddit-stocks/r/investing/comments/pxx426/popular_post_regarding_timing_the_market_a_while.json": "Hi all,\n\nI remember seeing a post here sometime within the past year where someone ran a\nhypothetical analysis of three investors; one that only invested at the peak,\none the invested every week, and one that only invested at the trough of the\nmarket. The conclusion was just another piece of…",
  "data/reddit-stocks/r/investing/comments/py83bo/ford_to_lead_americas_shift_to_electric_vehicles.json": " * Ford to bring electric zero-emission vehicles at scale to American customers\n   with the largest, most advanced, most efficient auto production complex in\n   its 118-year history\n * Called Blue Oval City, the complex will be constructed on a nearly\n   6-square-mile site in west Tennessee and…",
  "data/reddit-stocks/r/stocks/comments/pf7ns2/thoughts_on_viac.json": "I cant think of a better value play right now, but the market seems to beg to\ndiffer. Not only is VIAC a great value considering how cheap it is (8 pe) but\nthere is also great growth potential as well as a relatively likely scenario\nwhere they get bought out.\n\nThey have a streaming platform that…",
  "data/reddit-stocks/r/stocks/comments/pf9939/is_tlry_going_anywhere.json": "I've had some stock in TLRY for a while and am a bit over $200 in the red out of\nabout a $1100 investment. Is there anything out there saying anything good about\nthis that would make a recovery or should I just opt out with where I'm at?",
  "data/reddit-stocks/r/stocks/comments/pfbreo/nio_and_european_premium_car_brand_lotus_form_ev.json": "\"Units of Lotus and electric-vehicle upstart Nio Inc. signed an investment pact\nas the Chinese owner of the iconic maker of British sports and racing cars seeks\nto transform it into an all-electric brand.\n\nLotus Technology and Nio will explore collaboration in areas including high-end\nintelligent…",
  "data/reddit-stocks/r/stocks/comments/pfhdek/quick_and_dirty_analysis_of_monthly_sp_500.json": "Edit: Tried to fix a formatting issue and Reddit broke the tables. One moment\n\nEdit 2: God, I hate Reddit posts. I think formatting is fixed now.\n\nI keep seeing people saying you should sell going into September because it is\nhistorically a bad month to hold stocks. So I spent 10 minutes using this…",
  "data/reddit-stocks/r/stocks/comments/pfjm06/why_modernas_2x_antibody_titer_news_is_better_for.json": "Why Moderna's 2x Antibody Titer News Is Better For Pfizer\n\n> Breaking news: Moderna vaccine creates twice as many antibodies as Pfizer:\n> research - Source\n> [https://news.yahoo.com/moderna-covid-19-vaccine-doubles-131601816.html]\n\nModerna vs pfizer dose size is…",
  "data/reddit-stocks/r/stocks/comments/pfrkoo/cathie_woods_ark_files_for_new_transparency_etf.json": "ARK Investment Management is looking to debut a new ETF that will focus on\ntransparency in companies and shun vice and sectors that run afoul of ESG\ninvesting like fossil fuels.\n\nIn an SEC filing, Cathie Wood's shop outlines the fund, which looks to be at\nleast 80% invested in stocks in its…",
  "data/reddit-stocks/r/stocks/comments/pfu717/gamestop_stocks_possible_return_to_sp_500_in.json": "The individual-investor darling GameStop Corp. is now three times as valuable as\nthe smallest S&P 500 stocks, thanks to a sharp run-up in its shares in August.\nSome traders are betting GameStop could take another leap higher if S&P Dow\nJones Indices adds the stock to the S&P 500 when it is…",
  "data/reddit-stocks/r/stocks/comments/pfu772/cloudflare_stopped_the_largest_ddos_attack_ever.json": "\"Cloudflare said its system managed to stop the largest reported DDoS attack in\nJuly, explaining in a blog post that the attack was 17.2 million\nrequests-per-second, three times larger than any previous one they recorded.\n\n\"In a blog post, Cloudflare's Omer Yoachimik explained that the company…",
  "data/reddit-stocks/r/stocks/comments/pfuzkx/what_do_you_think_about_target_stock.json": "Hey guys, I just started investing and still kinda don’t understand how the\nsector rotate. For example, Target beats the earning report, and now it down for\n7%. What may cause this and how do you guys mitigate the risks during the\nbearish time? Thank you so much.\n\nP/s: I own Target because I believe…",
  "data/reddit-stocks/r/stocks/comments/pg0qtn/corsair_crsr_great_potential_or_overhyped_meme.json": "I've been researching Corsair for some time now and the background looks rather\npromising:\n\n * $457.1M net revenue/60% increase in respect to the last year\n * Gross profit of ~$130M (112.4% increase) in comparison to the past year\n * Mass demand of gaming materials/PCs/Laptops with one of the…",
  "data/reddit-stocks/r/stocks/comments/pg18ib/thoughts_apple_for_first_stock.json": "Hey all,\n\nI have about 50k I want to invest as it’s doing me no good in the bank and have\nbeen doing a lot of reading the last 2 months but still lack knowledge about\nstocks. At this point I want to jump in with something so im thinking 10k to get\nmy feet wet until I gain more knowledge. I def want…",
  "data/reddit-stocks/r/stocks/comments/pg1llf/lets_talk_about_corsair_crsr.json": "CORSAIR GAMING\n\nThe COVID-19 has accelerated gaming activity and companies in this segment saw a\ndramatic surge in sales.\n\nI've been looking for a gaming company to invest in for a while now, and after\nan extensive research I realized that the best pick in this sector is Corsair.\n\nWith a market cap…",
  "data/reddit-stocks/r/stocks/comments/pg2n48/here_is_a_market_recap_for_today_wednesday.json": "PsychoMarket Recap - Wednesday, September 1, 2021\n\nStocks traded mixed in the first session of September, which is historically the\nworse month for equities. The S&P 500 (SPY) and Nasdaq (QQQ) both eeked out a\nnew intraday record high, closing 0.07% and 0.17% higher respectively. The Dow\nJones (DIA)…",
  "data/reddit-stocks/r/stocks/comments/pg44eh/asts_worth_the_risk.json": "Hey all, I read a very intriguing DD article the other day by Kevin Liao and\nwanted to share here to see community sentiment. I feel like with the major\npartnerships/investors, they too believe this is the future and wouldn’t get\ninvolved if it wasn’t feasible. I understand the risk but the upside…",
  "data/reddit-stocks/r/stocks/comments/pg78n3/what_would_it_take_for_apple_to_lose_their_top_10.json": "As you know, apple has been the biggest company for quite a while now. It is\nvery difficult for me to envision them losing this spot for like the next 20\nyears at the very least.\n\nWhat do you guys think it would take for Apple to drop out of the top 10 in the\ns&p500?",
  "data/reddit-stocks/r/stocks/comments/pgh4le/alibaba_makes_up_with_the_ccp_chinas_alibaba_to.json": "https://www.reuters.com/world/china/chinas-alibaba-invest-155-bln-towards-common-prosperity-2021-09-02/\n\nSHANGHAI, Sept 2 (Reuters) - China's Alibaba Group (9988.HK), will invest 100\nbillion yuan ($15.5 billion) by 2025 in support of \"common prosperity\", it said,\nbecoming the latest corporate giant…",
  "data/reddit-stocks/r/stocks/comments/pgicfx/robinhood_investors_are_propping_up_this_stock.json": "We are almost two days into what has historically been a bummer of a month for\nstock investors. Given the list of worries piling up, and those include Friday’s\njobs data and the shadow of last September’s nasty 10% slide, “the market is\nlikely to be bound for choppiness,” any way you slice it, notes…",
  "data/reddit-stocks/r/stocks/comments/pgk8sz/is_tsm_a_strong_buy.json": "TSMC is the world's largest contract chip manufacturer, making 13 million units\na year for the likes of Apple and NVIDIA. It's not only Taiwan's biggest\ncompany, it's now the largest stock in the MSCI Emerging Markets Index, bigger\neven than China's Alibaba and Tencent. South Korea's Samsung is the…",
  "data/reddit-stocks/r/stocks/comments/pgkcnb/any_stocks_under_10_a_share_that_you_like.json": "I have lots of blue-chip stocks in my portfolio, but I’m looking to buy some\ncheap stocks - preferably $10 or less - that could (hopefully!) grow\nexponentially over the next few years.\n\nI recently bought some shares of Crexendo ($CXDO) at $6.00, and some shares of\nIteris ($ITS) at $5.76. However,…",
  "data/reddit-stocks/r/stocks/comments/pgluy2/i_put_50k_into_the_market_today_and_im_happy.json": "I’ve been scared to jump in, and I finally did it today. I put $25K into VTI and\n$25K into QQQ. If any of these ETF’s dip 5%, I plan to put $5K more. I know\neverything is at all-time high, but these ETF’s keep going higher and I feel\nI’ve missed enough gains. Don’t try to time the market. When QQQ…",
  "data/reddit-stocks/r/stocks/comments/pgneun/ma_and_v_why_these_stocks_keep_declining_they.json": "MA and V these two stocks have been declining constantly for the past few weeks,\nthey have great fundamental and solid balance sheets. Is there any concern and\nreasons to make them going down? I am buying at these level because their\nrevenue and eps grow are still ongoing, and they can still expand…",
  "data/reddit-stocks/r/stocks/comments/pgpmyn/psychomarket_recap_thursday_september_2_2021.json": "Stocks once again traded, mixed, this time with the tech-heavy Nasdaq (QQQ)\nmodestly underperforming relative to the S&P 500 (SPY) and Dow Jones (DIA) both\nof switch had a last minute rally to close barely on the green. The Russell 2000\n(IWM), which tracks the performance of small-caps, outperformed…",
  "data/reddit-stocks/r/stocks/comments/pgvqyr/when_reddit_goes_public_is_it_worth_a_buy.json": "Reddit was valued at $10 billion in a private fundraising round last month. By\nthe time the IPO takes place early next year, Reddit hopes it will be valued at\nmore than $15 billion, one of the sources said.\n\nThe sources cautioned that the timing and size of the IPO were subject to market\nconditions…",
  "data/reddit-stocks/r/stocks/comments/ph2dtc/is_it_always_a_good_idea_to_average_up.json": "I started investing earlier on in the year and I’ve always been reluctant to\naverage up.\n\nMy plan has always been to buy when the price is low and to only buy when the\nprice goes below my average (thus, averaging down). It has worked ok for me so\nfar, but I feel like I may be missing out on future…",
  "data/reddit-stocks/r/stocks/comments/ph3qx2/what_are_some_blue_chiplarge_cap_stocks_to_buy.json": "Recently added AMZN during the dip, and will plan to add V and MA too. All these\nwill be in my long term portfolio.\n\nI’m curious What are some large cap stocks you guys are looking out on buying\nthe dip?",
  "data/reddit-stocks/r/stocks/comments/ph4bd5/august_nonfarm_payrolls_increase_235000_vs_720000.json": "Job creation for August was a huge disappointment, with the economy adding just\n235,000 positions, the Labor Department reported Friday.\n\nEconomists surveyed by Dow Jones had been looking for 720,000 new hires.\n\nThe unemployment rate dropped to 5.2% from 5.4%, in line with estimates.\n\nOwn thoughts:…",
  "data/reddit-stocks/r/stocks/comments/ph7z0o/your_favourite_etf_and_reason_behind_it.json": "Hello everyone,\n\nWanted to invest some money in a few ETFs, just wanted to ask what are your\nfavourite ETFs and why.\n\nI really like the ARK ETF I’m a big believer in Cathie Wood, even though I know\nthe risk/reward ratio is high. Tell me your thoughts on ARKs ETFs.",
  "data/reddit-stocks/r/stocks/comments/ph8qdt/whats_up_with_blockbuster_and_sears.json": "Anyone notice that Blockbuster, now under a holding ticker BLIAQ is going crazy,\nboth today and yesterday? Sears too, under SHLDQ.\n\nBlockbuster is up 1,700% as I write this, and Sears is up 175%.\n\nBlockbuster Liquidating Inc: https://www.google.com/finance/quote/BLIAQ:OTCMKTS\n\nSears Holding Corp:…",
  "data/reddit-stocks/r/stocks/comments/ph8vuy/i_may_have_made_a_bonehead_move_please_help.json": "I am shorting 125 shares of a particular stock. I am down big in this position\nright now. It was a stupid move and I will never short sell again. However, the\nstock has pulled back, so I decided to hedge my short position by buying 50\nshares of the same stock long. However, when I tried to sell…",
  "data/reddit-stocks/r/stocks/comments/phas8v/do_you_think_the_last_250_years_of_economic.json": "Over the last 250 years the world has seen massive growth in both population and\nproductivity, this has fueled immense global economic growth. Most people take\nthis to be a new normal, that economic growth will extend indefinitely, but\nothers see diminishing population gains and returns on…",
  "data/reddit-stocks/r/stocks/comments/phbkld/mongodb_surge_wraps_up_a_massive_week_for.json": "https://www.cnbc.com/2021/09/03/mongodb-tops-30-billion-market-cap-in-banner-week-for-open-source.html\n\nWith MongoDB’s surge on Friday, it’s now worth almost as much as IBM paid for\nRed Hat in a deal that closed in 2019.\n\nEarlier this week, Databricks raised a private financing round at a $38…",
  "data/reddit-stocks/r/stocks/comments/phdjfm/do_you_believe_in_fedjerome_powell.json": "I want to see what are the popular opinions here about the chairman of the Fed.\nFor me it kind of seems that a lot of people here have a neutral-negative\nsentiment about his actions. So it is very interesting to me what do you think\nabout his printing and QE - do you really worry about the potential…",
  "data/reddit-stocks/r/stocks/comments/phdt3m/here_is_a_market_recap_for_today_friday_september.json": "PsychoMarket Recap - Friday, September 3, 2021\n\nStocks finished the day mixed, with the S&P 500 (SPY) and Dow Jones (DIA)\nfalling while the tech-heavy Nasdaq (QQQ) pushed higher, closing 0.31% higher.\nThe Russell 2000 (IWM), which tracks the performance of small-caps, fell 0.46%.\nMarket participants…",
  "data/reddit-stocks/r/stocks/comments/phiruh/tesla_further_delays_cybertruck_timeline_to_late.json": "The Tesla Cybertruck delay was already a known fact, but CEO Elon Musk's latest\nreported comments add a few more details to the picture. Citing sources familiar\nwith the meeting, Electrek reported Thursday that Musk held a company-wide call\nand said the Cybertruck should be ready for production in…",
  "data/reddit-stocks/r/stocks/comments/phq0mw/is_v_visa_a_good_long_term_hold_for_5_years_or.json": "Recently V and MA had a dip and of course I bought some. However I’ve seen many\nmixed feelings about VISA as many people thinks that other financial platforms\nlike Square, PayPal, Affirm and possibly crypto payments will affect V/MA\nnegatively in the long term.\n\nHere in Asia where I live, VISA is…",
  "data/reddit-stocks/r/stocks/comments/phs50h/the_ultrarich_the_aging_population_and_the.json": "Finally an article about interest rate with substance! Link to article\n\nhttps://theovershoot.co/p/inequality-interest-rates-aging-and?fbclid=IwAR3P8TJ20ANxr-fLnSPpRZjybQhNFRVTtwYg_7zuL1aZQq6-2l1mLrOsr44\n\nMy take A) government spending that result in reduced debt load to the average\nJoe are in…",
  "data/reddit-stocks/r/stocks/comments/phtzdk/which_etfs_for_growth_over_5_years.json": "Investing from the UK. Currently 80% of my portfolio is in Vanguard S&P 500 ETF\n(VUSA - I believe it is VOO in the USA?). 11% APPL and 9% GOOGL.\n\nI want to start putting money in different ETFs to rely less on VUSA and to\nprovide some diversification. Even though I’m in the UK I just have little…",
  "data/reddit-stocks/r/stocks/comments/phu8lq/delisted_companies_popping_going_up.json": "EDIT: Removed all mention of stock tickers to comply with Rule 7! This is just\nfor learning! No ticker mentions please! DOn't get me banned!\n\n----------------\n\nI made a post yesterday trying to buy shares of delisted stock (basically\nBlockbuster and Sears ) but it was removed. Maybe because it was…",
  "data/reddit-stocks/r/stocks/comments/phvyg9/imminent_market_crash_dd_why_i_believe_the_us.json": "This journey began for me with a random conversation. I was at a grocery store\non my break from work and while I was looking at different Greek yogurts, I\noverheard a man say something I couldn’t believe. I turned around and said “Sir…\nI’m sorry, what did you just say?” He introduced himself as the…",
  "data/reddit-stocks/r/stocks/comments/phzp60/playing_a_stock_game_in_school_need_advice_on.json": "I have 500k local currency to put into 5-20 stocks\n\nI can choose between selected Danish, Swedish, Norweigan and American stocks.\n\nI have a short time horizon of 3 months starting in 11 days.\n\nGod help me beat these suckers!",
  "data/reddit-stocks/r/stocks/comments/pi34nx/what_are_some_high_risk_high_reward_stocks_that.json": "I'm pretty young and don't have to pay rent. I feel like I should take some\nrisks and invest in safer stocks like VOO only when I'm older. As nice as 10%\ngains are every year it wouldn't really be worth much if I'm only putting in a\nfew thousand.",
  "data/reddit-stocks/r/stocks/comments/picygx/what_do_you_feel_have_been_your_5_most_profitable.json": "Good morning everyone and thank you for taking the time to read my post. Happy\nSunday and I hope you all are enjoying this longer weekend. I think this is a\nvery important topic because it will put the minds of every trader together to\ncome out with 5 tickers or at least 3 that have been winners for…",
  "data/reddit-stocks/r/stocks/comments/pid32e/question_concerning_sq_pypl_ma_and_v.json": "I'm building a long term portfolio and I decided to include some of these\npayment companies. I've been reading about them and doing DD but I'd like to\nknow which of them you think will have more room to grow in the long term. My\nreasoning was to invest 60% in SQ and 40% in V of the total amount of…",
  "data/reddit-stocks/r/stocks/comments/pidyd7/hey_im_not_that_old.json": "I’m 53 and only recently became interested in investing. I currently put 20% of\nsalary into my RSP, so I think I’m being fairly sensible in my retirement\nplanning. I recently paid off my truck and now have $400 a month to invest. I’ve\nstarted buying shares a bit, and learning what I can. 40 shares…",
  "data/reddit-stocks/r/stocks/comments/pifkoc/why_is_aapls_revenue_growth_declining.json": "Is AAPLs revenue growth declining mostly because of the chip shortage?\n\nI realize AAPL has a ton of free cash so maybe it won't be that big of a deal?\n\nWhat is AAPL doing to increase their revenue growth?\n\nI heard they're getting into healthcare and possibly evs?\n\nI have faith that the intelligent…",
  "data/reddit-stocks/r/stocks/comments/pihemf/teacher_said_if_anyone_is_able_to_explain_why_b.json": "Help me please.\n\nAs far as I know the B stock actually doesn't give ownership of the company and\nworks more as a bond where you are entitled to some profits, whereas the A stock\nactually is a genuine part in the company.\n\nHow does this make the B stock more expensive in some cases when you…",
  "data/reddit-stocks/r/stocks/comments/pihj57/if_you_like_to_swingtrade_heres_a_list_of_stocks.json": "I maintain a long watchlist of popular stocks that I am always keeping an eye\non. I look at their charts almost daily looking for opportunities in swing\nplays.\n\nSinkers are usually a possible entry for a buy-the-dip play and the\nout-performers might be at a good spot to take some profit and lower…",
  "data/reddit-stocks/r/stocks/comments/pij07k/what_is_the_value_of_1_dollar.json": "How do you put a value on a dollar? I mean we all kind of know what we can buy\nwith 1 dollar, which today isn't much. But whats the official value of 1 USD?\n\nFor example in the 80s I could play 4 arcade games with 1 dollar and entertain\nmyself for maybe an hour.\n\nMy nana used to go to the movies,…",
  "data/reddit-stocks/r/stocks/comments/pip3o3/why_do_people_want_to_day_trade.json": "For a long time I have been seeing videos and posts all over the internet\ntalking about wanting to start learning how to trade stocks and options as well\nas \"courses\" that will supposedly teach you how to become a profitable trader.\n\nMy question is why? There are multiple studies and books that show…",
  "data/reddit-stocks/r/stocks/comments/pips17/what_are_some_of_the_blue_chip_stocks_that_failed.json": "I see MSFT, AAPL, GOOG, and etc get recommended as buy-and-hold stocks all the\ntime. While I do own a good amount of these stocks, I wonder what blue chips\nwere the MSFT, AAPL, and GOOG 20-30 years ago and failed. And why did they fail.",
  "data/reddit-stocks/r/stocks/comments/pipu1w/pltr_paying_themselves_first.json": "So old PLTR. Everyone loves them. The hype is grand. Actually they are not a bad\nearly stage company. Growing revenues at a great rate with gross profits along\nside it. Most of their expenses after gross is selling/marketing expenses so\nlike many software companies they will be able to reduce that…",
  "data/reddit-stocks/r/stocks/comments/pitajz/convince_me_why_nvidia_is_overvalued_because_i.json": "People talk about a lot of tech/cybersecurity stocks being over-valued, but in\nmany ways I think Nvidia is undervalued to be perfectly honest if we're looking\nat a long period of time.\n\nAs Analyst Arthur Lai said, tech sales to the auto industry are likely to exceed\nsales to producers of…",
  "data/reddit-stocks/r/stocks/comments/piu6nw/types_of_stocks_you_avoid_investing_in_and_the.json": "Note that I’m not asking about the standard reasons we all try to avoid certain\nstocks (lack of growth, bearish, etc.). I’m asking if there are certain\nindustries or categories of stock you don’t invest in (you can still trade\nthem).\n\nLike some investors, I don’t buy tobacco stocks. Even with the…",
  "data/reddit-stocks/r/stocks/comments/piysfx/palantir_stock_based_compensation_rebuttal_and.json": "This is because the post that recently was made about PLTR sbc was low quality.\nSo here's a better more honest analysis of SBC and a look into the companies\ncurrent prospects.\n\nFirstly regarding Palantir. Their leadership is incredible. 90% commercial\ngrowth YoY. 50% overall YoY growth and a…",
  "data/reddit-stocks/r/stocks/comments/pj1ymv/does_anyone_else_use_their_stock_portfolio_as.json": "Earlier this year I had my 6 months of expenses in a savings account. But then\naround February-April inflation fears started being spread all across the media.\nAnd instead of being afraid of stock market crash. My thoughts were why am I\nkeeping so much cash in a savings account if inflation is…",
  "data/reddit-stocks/r/stocks/comments/pj5rdz/walgreens_dd_wba_safe_stock_selling_at_a_discount.json": "***Disclaimers & Disclosures: This article is meant for discussion and\nentertainment purposes only. The following is not investment advice, nor a\nrecommendation to buy or sell any security/investment. Investments always carry\nrisk, so DYOR.\n\nWe are traders & private investors who see the value of…",
  "data/reddit-stocks/r/stocks/comments/pjfe45/dotcom_bubble.json": "https://en.wikipedia.org/wiki/Dot-com_bubble\n\n> As a result of these factors, many investors were eager to invest, at any\n> valuation, in any dot-com company, especially if it had one of the\n> Internet-related prefixes or a \".com\" suffix in its name. Venture capital was\n> easy to raise. Investment…",
  "data/reddit-stocks/r/stocks/comments/pjfiv7/nvda_what_happens_when_mining_slows.json": "Have been doing some research regarding $NVDA. Came across a stat that said\nabout 1/2 of their revenue comes from GPU sales. Does anyone have any thoughts /\nconcerns in this regard that Etherium is moving away from proof of work to proof\nof stake? Wondering if this shift in Eth would have a material…",
  "data/reddit-stocks/r/stocks/comments/pjjssq/is_rocket_lab_rklb_still_a_good_buy.json": "Rocket Lab has risen steeply in price lately, and although it's a fantastic\ncompany, with great potential, is it still a value play at the current price\n($13.50)?\n\nIt's risen over 30% in just 5 days!\n\nIs it likely to come back down to a more modest price, it would be great to buy\nmore at $10 which…",
  "data/reddit-stocks/r/stocks/comments/pjlah0/disney_is_to_netflix_as_x_is_to_tesla.json": "Netflix enjoyed first mover advantage in the streaming wars. But here comes\nDisney with its century-long catalog of content competing with Netflix.\n\nTesla is the first mover in electric cars. Which car company is the Disney to\nNetflix? Probably a company that has a really good brand, history of…",
  "data/reddit-stocks/r/stocks/comments/pjmdsd/taper_your_pessimism_feds_actions_wont_derail_us.json": "Anyone have any thoughts on this? Obviously the go-to to refer to is Jim\nCramer's statement in 2008 that Bear Sterns \"was great, and you'd be silly to\npull your money out.\"\n\nWe've all discussed the possibility of a massive crash in global or just U.S.\nmarkets for almost a year now. What are your…",
  "data/reddit-stocks/r/stocks/comments/pjng0j/elon_musk_says_tesla_tsla_is_worth_3000_a_share.json": "Elon Musk told employees that he agrees with Ark Invest that Tesla (TSLA) is\nworth $3,000 a share “if they execute really well.” The CEO has often commented\non Tesla’s stock price, but surprisingly, it was often to say that the price was\ntoo high.\n\nIn 2020, when Tesla’s stock was reaching new high,…",
  "data/reddit-stocks/r/stocks/comments/pjo8m9/the_new_mining_policy_in_ecuador_and_how_will_it.json": "Just last month, Guillermo Lasso, the president of Ecuador, issued Decree 151\nwhich focuses on a new mining policy, strengthening the government’s support\ntowards mining as a key driver of the economy.\n\nAccording to this article\n[https://www.miningweekly.com/article/canadian-miners-welcome-decree-in…",
  "data/reddit-stocks/r/stocks/comments/pjrg7c/why_doesnt_the_media_ever_bring_attention_to.json": "https://whalewisdom.com/filer/scion-asset-management-llc#tabholdings_tab_link\n\nI finally looked at his portfolio and noticed FB, GOOG, WMT, KHC, and MCK call\noptions as well as shares of CVS among other stocks.\n\nWhy was the headlines news just his puts on Cathie Wood ETF and Tesla? And he\nbecame…",
  "data/reddit-stocks/r/stocks/comments/pjvmpl/netflix_talk.json": "Ok, so Netflix (NFLX) is now up 20% since August.\n\nThis after the following headlines on /r/Stocks, to pick from many:\n\n * Netflix bleeds subscribers in US and Canada, with no sign of recovery\n   [https://www.reddit.com/r/stocks/comments/opbdt0/netflix_bleeds_subscribers_in_us_and_canada_with/]\n *…",
  "data/reddit-stocks/r/stocks/comments/pjx6k1/best_advice_from_those_whove_been_around_the_block.json": "Most millennial and gen-z investors don’t know what it’s like trading in a\nmarket that isn’t rising 10-20%/year. So, for those of you who’ve been around\nthe block: the 2000 bubble, Black Monday in 1987, or even the Recession, what is\nthe most important thing learned or took away?",
  "data/reddit-stocks/r/stocks/comments/pjz0cf/need_advice_on_a_stable_growth_investment_that_i.json": "I'm not new to investing but I want to get some clarity on reaching my goals.\n\nI plan to buy a house in 3-5 years and will likely have around $50,000- $70,000k\nextra sitting in my bank account from just holding paychecks over that time\nperiod. This money will be a down payment for the home but I…",
  "data/reddit-stocks/r/stocks/comments/pk3ct5/paypal_heats_up_buy_now_pay_later_race_with_27.json": "https://www.cnbc.com/2021/09/08/paypal-heats-up-buy-now-pay-later-race-japan-deal.html\n\nPayPal Holdings said it would acquire Japanese buy now, pay later (BNPL) firm\nPaidy in a $2.7 billion largely cash deal.\n\nPayPal also entered Australia last year, raising the stakes for smaller\ncompanies such as…",
  "data/reddit-stocks/r/stocks/comments/pk5vm2/are_premium_discordslack_groups_worth_the_money.json": "Randomly came across @ F.HFUNDS on instagram. Guy claims to be a Former Goldman\nTrader. Been following him for about 4 weeks now and the guy has hit everything\nhe's called out. I want to sign up for his premium calls but wanted to know if\nanyone has heard of this guy before I sign up\n[https://www.f…",
  "data/reddit-stocks/r/stocks/comments/pk8r5n/tesla_is_an_ai_company.json": "A lot of people said Tesla is an \"AI\" company, not an electric car company from\nthis thread:\nhttps://www.reddit.com/r/stocks/comments/pjlah0/disney_is_to_netflix_as_x_is_to_tesla/\n\nThe thesis is that Tesla is far ahead in its self-driving capabilities that\nother car makers just can't catch up. And…",
  "data/reddit-stocks/r/stocks/comments/pkayti/stocks_may_fall_15_by_yearend_warns_morgan_stanley.json": "Morgan Stanley’s optimistic view of the economy isn’t keeping it from warning\nabout a looming correction in the U.S. stock market. “The issue is that the\nmarkets are priced for perfection and vulnerable, especially since there hasn’t\nbeen a correction greater than 10% since the March 2020 low,” said…",
  "data/reddit-stocks/r/stocks/comments/pkazwe/what_happens_to_to_aapl_during_apple_events.json": "Hello, new to stocks here. I was kinda curious.\n\nI got an email from Apple saying they will jave a streaming event on the 14th. I\nown wome of their stock so I'm wondering: how does an event like this usually\naffect their stock for the day? I assume it increases due to hype right? When a\nproduct is…",
  "data/reddit-stocks/r/stocks/comments/pki9yp/gamestop_reports_financial_results_for_q2_2021.json": " * Generated net sales of $1.183 billion, compared to $942 million in the prior\n   year’s second quarter.\n\n * Ended the period with cash and restricted cash of $1.78 billion.\n\n * Ended the period with no long-term debt, other than a $47.5 million\n   low-interest loan associated with the French…",
  "data/reddit-stocks/r/stocks/comments/pkiuxn/if_you_had_to_buy_1000_worth_of_3_separate_stocks.json": "As the title asks: \"If you had to buy $1000 worth of 3 separate stocks that you\nhad to hold on to for the next 2+ years, what stocks would you choose? Why?\"\n\n 3 Stocks, $1000 for each, can't touch the stocks for the next 2 years.\n\nI am just interested to see what stocks different people would pick…",
  "data/reddit-stocks/r/stocks/comments/pkivui/here_is_a_market_recap_for_today_wednesday.json": "PsychoMarket Recap - Wednesday, September 8, 2021\n\nHey Psychos! So there was no recap yesterday, got mixed up and didn't have the\ntime\n\nStocks fell today, extending the previous day’s decline in the S&P 500 (SPY) and\nDow Jones (DIA) as market participants continue to digest the recent August…",
  "data/reddit-stocks/r/stocks/comments/pkoabd/amazon_reportedly_working_on_pos_system_to_take.json": "Amazon is reportedly developing a point-of-sale system for third-party sellers,\nentering a competitive landscape currently dominated by PayPal, Square and\nShopify\n\nBusiness Insider sources say the POS will work for offline and online sales,\noffer Amazon checkout options and provide business…",
  "data/reddit-stocks/r/stocks/comments/pkqi2e/first_ever_stock_analysis_nvdanvidia_dd_please.json": "tock: Nvidia\n\nTicker: $NVDA\n\n#1: Valuation Multiples (Fundamental Analysis)\n\nTo begin the analysis, Valuation. As a starting point to find the valuation of a\ncompany, let’s use the valuation multiple: EV/EBITDA. EV/EBITDA allows us to\nunderstand what the company is earning relative to what the…",
  "data/reddit-stocks/r/stocks/comments/pkuqqk/copy_trading_too_good_to_be_true.json": "I've seen copy traders (popular traders that allow you to copy their portfolio)\nwith 4-5 scores for risk assessments but upwards of 50% on annual return. This\nfeature is common in online brokers like Etoro. I have even seen 95% annual\nreturn and the trader had like.. a risk assessment of 5 only..…",
  "data/reddit-stocks/r/stocks/comments/pkvonq/what_is_your_biggest_holding_for_the_long_term.json": "Hi guys,\n\nI'm interested in knowing your biggest holding, what percentage of your total\nportfolio it is and why you've decided to make it overweight. ETF excluded and\nit doesn't have to be a blue chip of course.\n\nThanks",
  "data/reddit-stocks/r/stocks/comments/pkxk09/nfl_names_verizon_5g_partner_in_10year_deal.json": "https://www.cnbc.com/2021/09/09/nfl-and-verizon-5g-partner-in-10-year-deal-for-enhanced-fan-experiences.html\n\n\"The National Football League and Verizon on Thursday announced a 5G partnership\nthat they say will allow fans to see seven different live camera angles of the\nseason-opening game between…",
  "data/reddit-stocks/r/stocks/comments/pkxmkx/weekly_jobless_claims_post_sharp_drop_to_310000.json": "First-time filings for unemployment claims in the U.S. dropped to 310,000 last\nweek, easily the lowest of the Covid era and a significant step toward the\npre-pandemic normal, the Labor Department reported Thursday.\n\nClaims had been expected to total 335,000 for the week ended Sept. 4, according\nto…",
  "data/reddit-stocks/r/stocks/comments/pkz75c/so_i_started_trading_in_march_2020_tripled_my.json": "I'm sure some of you have been in my situation. I tripled my account, but nuked\nit back down to 20k. I'm still up 5k since the start and for that I'm grateful,\nbut after hundreds of trades and blood, sweat and tears, the stupid S&P has\nofficially beat me. My problem has been degenerate style option…",
  "data/reddit-stocks/r/stocks/comments/pkzepv/mastercard_makes_a_big_bet_on_crypto_buying.json": "https://www.cnbc.com/2021/09/09/mastercard-to-buy-blockchain-analytics-start-up-ciphertrace.html\n\nMastercard said Thursday it entered into an agreement to buy CipherTrace for an\nundisclosed amount.\n\nCipherTrace develops tools that help businesses and law enforcement root out\nillicit digital currency…",
  "data/reddit-stocks/r/stocks/comments/pl3mv5/rklb_is_filling_up_its_dance_card_but_it_can_make.json": "Rocket Labs debuted on the market a few weeks ago as the result of a [redacted]\nmerger (which is why the price history goes back to last October) and after a\nshort post-partum dip has put paid to its name, rocketing 96% in the past 6\ndays.\n\nThey reported in June that order backlog had increased over…",
  "data/reddit-stocks/r/stocks/comments/pl5mt1/psycho_market_recap_thur_sept_9.json": "Summary\n\nStocks opened higher in the morning before turning lower as market participants\ncontinue to balance a hot jobs market against a dent in economic momentum caused\nby surging coronavirus Delta variant cases in the US. The three major indexes\nare having one of the worst-performing streaks this…",
  "data/reddit-stocks/r/stocks/comments/pl7nt4/what_is_going_on_with_coinbases_pe_ratio.json": "Every site seems to show a different number...\n\n * On Google it shows 32.15 [https://www.google.com/search?q=coin+stock]\n * On Yahoo finance it shows 18.88 [https://finance.yahoo.com/quote/COIN/]\n * On Marketwatch it shows 24.95\n   [https://www.marketwatch.com/investing/stock/coin]\n\nWhich is the…",
  "data/reddit-stocks/r/stocks/comments/pl7ttc/10_safest_companies_to_invest_in_if_im_not.json": "Hey folks, I'm fairly new to investing and I have a unique situation for you.\n\nI'm leaving for a mission trip in a couple weeks and I'm going to invest a good\nportion of my savings in order to generate a little income while I'm gone. Just\ntake my word for it, I won't have access to my investing apps…",
  "data/reddit-stocks/r/stocks/comments/pl7wqh/fed_presidents_kaplan_rosengren_to_sell.json": "Reported today, I think it's a strange coincidence that they all of a sudden\ncare about ethics, especially with the talk of tapering.\n\nPersonally extremely cautious about this. Is the market finally at the top?\n\nSource:\nhttps://www.cnbc.com/2021/09/09/feds-rosengren-to-sell-individual-stock…",
  "data/reddit-stocks/r/stocks/comments/plczl2/is_it_okay_to_buy_msft_microsoft_now_when_its.json": "Microsoft is definitely a company that will most likely continue to do well and\ngenerate good profits especially from Office, XBox, Azure, Windows & etc.\n\nI am looking to buy some shares of good companies and hold for the long term (>5\nyears) and have been looking closely at MSFT.\n\nNow that it had a…",
  "data/reddit-stocks/r/stocks/comments/pljiyp/the_1_trillion_that_has_flowed_to_global_stocks.json": "Money has gushed toward stocks this year, as global central banks have kept\nmonetary policy accommodative to fight the coronavirus pandemic.\n\nBank of America has put those flows into perspective with the following chart\nthat shows annualized inflows to global stocks in 2021, topping $1…",
  "data/reddit-stocks/r/stocks/comments/pljzyd/what_should_a_bearish_longterm_investor_do.json": "I’m a beginner investor that’s a bit bearish on the current market. Also, the\nprospect of losing 100%+ scares me, so I’d rather not try to short anything, but\nI would like to make money, or at least not lose a ton of money, during the\nimpending downturn. What should I do?",
  "data/reddit-stocks/r/stocks/comments/plkkct/will_the_bull_market_continue_if_bidens_build.json": "Every week I see headlines of how the stock market is overvalued and we're\nheading for a crash. But if Biden's plan passes, we're talking about trillions\nof dollars of federal spending here and supposedly millions of jobs created.\nWouldn't that continue the market rally? Or would it only affect…",
  "data/reddit-stocks/r/stocks/comments/pllu8m/was_redditt_a_place_to_talk_stocks_and_economics.json": "So Reddit started in 2005, were there any chatter back then of the now known\nfinancial crisis. Were some talking about over valued stocks. Or was redditt\nstill too new to attract much stock or economic discussions?",
  "data/reddit-stocks/r/stocks/comments/plmq5p/in_5_months_upwards_of_42m_americans_will_restart.json": "Avg loan debt in 2021 is 37k+ and growing. In 2017 the Fed estimated the avg\npayment was $393/month, likely higher now. The amount of discretionary spending\nthat will be removed from the economy in Feb is going to be massive. If Morgan\nStanley claimed the market is being propped up by social media…",
  "data/reddit-stocks/r/stocks/comments/plngev/doordash_grubhub_and_uber_sue_nyc_over_bill_that.json": "https://www.cnbc.com/2021/09/10/doordash-grubhub-and-uber-sue-nyc-over-delivery-fee-limits.html\n\nDoorDash, Grubhub and Uber Eats are suing the city of New York over a bill that\nwould make emergency delivery fee caps permanent.\n\nThe lawsuit follows a similar legal action from DoorDash and Grubhub…",
  "data/reddit-stocks/r/stocks/comments/plnpc6/apples_app_store_dealt_blow_by_judge_in_epic.json": "https://www.bloomberg.com/news/articles/2021-09-10/apple-epic-games-antitrust-ruling-epic-granted-app-store-injunction-aapl?sref=HQB7G2wY&cmpid%3D=socialflow-twitter-tech&utm_source=twitter&utm_campaign=socialflow-organic&utm_content=business&utm_medium=social&cmpid=socialflow-twitter…",
  "data/reddit-stocks/r/stocks/comments/plrvw1/democrats_propose_2_tax_on_stock_buybacks_to.json": "The proposal, called the Stock Buyback Accountability Act, would levy a 2%\nexcise tax on the amount corporations spend to buy back their own stock—a common\npractice that returns funds to shareholders without generally requiring taxes.\n\nIn recent decades, cash-rich companies have used buybacks to…",
  "data/reddit-stocks/r/stocks/comments/pltxcf/here_is_a_market_recap_for_today_friday_sept_10.json": "PsychoMarket Recap - Friday, September 10, 2021\n\nStocks extended their streak of underperformance, with the three major indexes\nfalling once again for the fifth consecutive day of losses, one of the worst\nweeks for equities all year. The S&P 500 (SPY) closed the day 0.78% down,\nclosing out the week…",
  "data/reddit-stocks/r/stocks/comments/plz62f/kroger_ceo_organized_crime_supply_chain_issues.json": "Kroger (NYSE:KR) CEO Rodney McMullen said Friday that the gross margin\ncompression that contributed to poor reception for the grocery chain's latest\nearnings report stemmed from supply-chain pressures and shoplifting that\ninvolved organized crime.\n\nSpeaking to CNBC, McMullen also predicted 2%-3%…",
  "data/reddit-stocks/r/stocks/comments/pm1mz0/is_now_a_good_time_to_buy_aapl_apple_inc.json": "Apple perhaps is one of the most popular stock being the highest market cap and\nfound it many investor’s portfolio. After dipping due to the in-app purchase\nlawsuit with Epic Games, I couldn’t resist and bought a few shares of my first\n$AAPL stock ~$150 planning to hold them for many years.\n\nIs…",
  "data/reddit-stocks/r/stocks/comments/pm6i33/warren_buffett_and_the_psychology_behind_buying.json": "Warren Buffett once said one of his biggest mistakes is looking for the cheapest\nstocks he can get. Instead, he suggests looking for great companies and then go\nall in if the price is fair. Great companies you can hold for many many years. I\nthink this is an amazing advice that I certainly…",
  "data/reddit-stocks/r/stocks/comments/pm7nw8/is_there_any_reason_why_float_exceed_the_number.json": "I have checked GameStop on yahoo finance and the numbers of outstanding shares\nis 76 million, while the float equals to 248 million shares.\n\nhttps://finance.yahoo.com/quote/GME/key-statistics?p=GME\n\nNormally the float is supposed to be smaller considering insiders holding the\nstock as well which is…",
  "data/reddit-stocks/r/stocks/comments/pmd84n/why_isnt_etrade_listed_in_the_info_page_here_are.json": "I'm kicking myself for not having started investing straight out of college (13\nyears ago), but better late than never, right? I've literally had E-Trade,\nSchwab and such websites bookmarked on chrome since then, just never pulled the\ntrigger. I just downloaded the E-Trade app since it was $0…",
  "data/reddit-stocks/r/stocks/comments/pmfbfc/at_what_point_do_you_stop_dollar_cost_averaging.json": "I’ve been bagholding $RNG for over a year now and it recently hit its 52 week\nlow. I’ve been dollar cost averaging for a long time and I want to know what a\n“smart investor” would do in a situation like this. Keep dollar cost averaging\nor give up and focus on other stocks?\n\nMy portfolio was pretty…",
  "data/reddit-stocks/r/stocks/comments/pmfiif/whats_the_difference_between_a_crash_and_a.json": "A lot of people are saying that a 15%-30% correction might happen, but how is\nthat not considered a crash?\n\nHow do people draw the line?\n\nIs it how big it is or how long it stays down?\n\nIs it the amount of stocks involved or the collective cap of them?\n\nIs it just random?\n\nBecause if a correction is…",
  "data/reddit-stocks/r/stocks/comments/pmg03j/before_you_buy_any_stock_consider_how_much_youre.json": "[Not for long-term holders]\n\nNumber 1 thing I ask myself before every trade. Am I willing to baghold this? If\nnot, then I must think of my stop loss BEFORE I ever even buy any shares to\nbegin with. Make peace with a potential loss before the trade even begins. If\nyou can't make peace with the…",
  "data/reddit-stocks/r/stocks/comments/pmkan3/is_there_one_mistake_you_made_this_year_that_you.json": "Good evening everyone and thank you so much for reading my post. Last week I\ntouched on a topic that was very helpful to everyone and gained much traction.\nThis week I want to discuss just 1 major huge blunder.. No matter how great we\nare we all have made at least 1 mistake this past year.\n\nSo…",
  "data/reddit-stocks/r/stocks/comments/pmlktv/low_pe_ratio_tech_stocks_but_still_not_worth.json": " 1. INTC - slept while NVDA and AMD were busy creating the next biggest thing.\n 2. DELL - has no competitive advantage, mediocre product offerings - just a\n    historic brand name.\n 3. CHKP - once the king of network security, FTNT and PANW are crushing this\n    company down\n 4. BABA - The fate of…",
  "data/reddit-stocks/r/stocks/comments/pmp7n1/why_is_alibaba_so_much_more_popular_than_tencent.json": "The 'Superinvestors' love Baba but not much more love for Tencent or Baidu.\n\nWhat gives?",
  "data/reddit-stocks/r/stocks/comments/pmqb69/why_is_every_other_post_here_hinting_at_some_huge.json": "Is there something someone knows that I don’t. every other post on here hinting\nat some impending crash and it’s all doom and gloom. There’s no crash unless\nanother 2008 like crash or 9/11 or something worse than COVID happens you guys\nneed to relax seriously. You guys see a small dip and start to…",
  "data/reddit-stocks/r/stocks/comments/pmqf6z/which_semiconductors_company_has_best_long_term.json": "I looking to put some money into SemiC sector, but I am having trouble deciding\nwhich companies I should go for. I did some analysis for long term investments,\nand from what I see NVDA, AMD, ASML and AMAT is the way to go. The only thing I\nam having trouble understanding if high P/E is indicating…",
  "data/reddit-stocks/r/stocks/comments/pmvvu1/my_parents_just_inquired_about_trading_in_the.json": "Today my mother, who doesn't even clearly understand mutual funds asked me how\nto trade in the equities market. Apparently some relative is doing it and making\na living of it for a year or so and now my dad thinks this is a good idea.\n\nNow I am not much of a bear but this has all my alarm bells…",
  "data/reddit-stocks/r/stocks/comments/pmxik9/banks_and_institutions_know_how_retail_traders.json": "Smart money. is what they call banks and tutes.\n\nbut have you seen the traders they hire? Are they any better than most traders?\n\nor is it because they have a shitload of money to swing a stock up/down whenever\nthey feel like it, and don't necessarily have to have amazing trading skills?\nWith enough…",
  "data/reddit-stocks/r/stocks/comments/pmz9xi/nasdaq_100_vs_sp_500_qqq_vs_voo.json": "Who do you think would be better for long-term?\n\nThe thing is NASDAQ 100 (year 1985) Index is relatively new compared to S&P 500\n(year 1957) or even Dow Jones (1896).\n\nS&P 500 outperforms Dow Jones with the data we are given today during 60+ years,\nbut does NASDAQ 100 beat S&P 500? As far as I see…",
  "data/reddit-stocks/r/stocks/comments/pn0zfi/what_is_going_on_with_roku.json": "Just made a relatively small investment into Roku recently and notice the stock\nis down significantly from the $415 price tag I paid for the first little batch\nof shares I picked up. I am not stressing it. I am more interested in whether or\nnot this would be a good time to buy more. I am doing some…",
  "data/reddit-stocks/r/stocks/comments/pn8f6b/judge_epic_vs_apple_says_apple_deserves.json": "https://www.google.com/amp/s/www.theverge.com/platform/amp/2021/9/12/22667694/epic-v-apple-trial-fortnite-judge-yvonne-gonzalez-rogers-final-ruling-injunction-breakdown\n\nRogers admittedly finds “no basis” for the specific 30 percent rate, despite\nApple hiring a consultant to testify about the value…",
  "data/reddit-stocks/r/stocks/comments/pnafo5/lets_plan_for_a_crash_so_if_it_happens_we_make.json": "Imagine this. All the doomsday prophets are right, inflation spikes, rates rise,\nthe market tanks, Michael Burry gets filthy rich, and trillions of dollars\ndisappear overnight. We lose a lot of value, but are presented with one of the\nall-time great buying opportunities. You’re bleeding, but have…",
  "data/reddit-stocks/r/stocks/comments/pneszy/what_happens_the_moment_fed_has_no_more_cash_on.json": "For who didn't follow what's happening with public spending, in this\n[https://www.youtube.com/watch?v=bI7LG67UYRI] short video by CNBC the problem is\nbriefly explained.\n\nOn Friday, the balance showed $207 billions, just about 150 less than the\nmonth's opening. Keeping this pace, the total balance…",
  "data/reddit-stocks/r/stocks/comments/pnh3s4/us_gov_misreporting_about_rent_inflation.json": "Anyone who has renewed a lease recently has probably been shocked to see the\nrate increase dramatically over the last year. Most private source show between\na 10-15% increase in average rent in the last year.\n\nhttps://www.apartmentlist.com/research/national-rent-data\n\nThe US CPI however has only…",
  "data/reddit-stocks/r/stocks/comments/pnhmqa/what_are_the_most_out_of_favor_stocks_on_your.json": "Seeing as reddit is generally WRONG about everything, I figured we should start\ncompiling unpopular tickets for the deep value contrarian plays. No meme stocks\npreferably. I’m talking stocks that the hivemind here absolutely hates and\neveryone thinks it’s an obvious short or terrible…",
  "data/reddit-stocks/r/stocks/comments/pnhvod/dumb_strategies_that_make_money.json": "What are some dumb strategies or strategies that seem counter intuitive that\nactually generates a return.\n\nMy dumb strategy is when I see a stock tank hard I put money into it as soon as\nI can. About 80% of the time it regains about 5% - 10% of its value within the\nnext week or two then I sell when…",
  "data/reddit-stocks/r/stocks/comments/pnk5jg/michael_the_big_short_burry_has_activated_his.json": "Burry keeps making predictions and then nukes his account (deletes all his\ntweets) when he is wrong.\n\nYesterday he has started tweeting again, posting a few screenshots of old mails\nfrom 2005 implying it can take a while (3 years) for his predictions to come\ntrue.\n\nTweet from yesterday:…",
  "data/reddit-stocks/r/stocks/comments/pnpvq5/is_anyone_aware_about_the_energy_supply_crunch.json": "I don't know if people have followed that but there is a huge energy supply\ncrunch currently happening in Europe & UK.\n\nDue to several factors (CO2 quotas, high dependency to new renewables + no wind\ncurrently, high competition with Asia, inventories historically low especially\nin Germany and…",
  "data/reddit-stocks/r/stocks/comments/pns4p6/what_exactly_happens_when_a_hedge_fund_blows_up.json": "I can’t seem to find any concise info on historical data regarding performance\nof different hedge funds.\n\nAnd also, more relevant to the question at hand, what happens to funds, and\ninvestors in said funds, if they perform very poorly/blow up?\n\nAre there any significant consequences to the hedge…",
  "data/reddit-stocks/r/stocks/comments/pnu3w8/here_is_a_market_recap_for_today_monday_september.json": "PsychoMarket Recap - Monday, September 13, 2021\n\nMy bad for the late post, I had the recap written and sent it out, just forgot\nto post it here. Apologies\n\nAfter being negative through most of the day, the three major indexes reversed\nin the last hour of the market in order to snap a five-day…",
  "data/reddit-stocks/r/stocks/comments/po0sd6/if_there_is_a_stock_bubble_how_does_it_burst.json": "Hey,\n\nI am reading multiple posts calling the top of the bull rally and speaking of an\ninminent crash.\n\nIf that is your point of view, how do you see the market from today going into a\ncrash? What is in your opinion the deciding factor that might cause the start of\na bear market?\n\nIn my opinion it…",
  "data/reddit-stocks/r/stocks/comments/po1uc9/update_1amazon_boosts_hourly_pay_to_over_18_to.json": "https://finance.yahoo.com/news/1-amazon-boosts-hourly-pay-103153407.html\n\nSept 14 (Reuters) - Amazon.com Inc hiked its average starting wage to $18 per\nhour on Tuesday and said it plans to hire more than 125,000 warehouse and\ntransportation workers in the United States.\n\nThe world's largest online…",
  "data/reddit-stocks/r/stocks/comments/po2km5/is_ta_just_financial_astrology.json": "How right or wrong am I?\n\nIt sounds like bullshit, most of the big guys seem to make more money teaching\nyou how to do it, instead of doing it.\n\nIf the stock market can only go up or down, that means anyone can make a\nprediction and have a 50 percent chance of being correct.\n\n50 percent chance is…",
  "data/reddit-stocks/r/stocks/comments/po6tqp/why_cepton_lidars_are_getting_deals_over.json": "My position in $GCAC: 1000 shares @ $9.93\n\nLast week, Forbes reported\n[https://www.forbes.com/sites/samabuelsamid/2021/09/09/general-motors-selects-cepton-to-supply-lidar-for-2023-production/]\nthat GM has selected Cepton to be its lidar supplier for upcoming cars produced\nin 2023 - 2027. The lidar…",
  "data/reddit-stocks/r/stocks/comments/poaum1/psycho_market_recap_tue_sept_14.json": "Despite breaking a five-day losing streak yesterday, stocks once again fell\ntoday, with the three major indexes and the Russell 2000 (IWM) finishing firmly\nin the red as market participants digested new economic data and continue\nmonitoring the coronavirus Delta variant situation in the US, which…",
  "data/reddit-stocks/r/stocks/comments/poch1m/is_plug_dead_is_this_company_worth_sticking.json": "Hi everyone,\n\nI just need some advice/insight as to $PLUG and if they have any upside or\npotential in the future. I was an early believer in them and did not sell when\nthey mooned. The stock price been consistently going down and rather than give\nup I doubled down. I am currently down about more…",
  "data/reddit-stocks/r/stocks/comments/poe1mi/dutch_bros_going_public_tomorrow.json": "Just found this out yesterday, and as an Oregon native I am kind of pumped (no\npun intended). Their expansion has been insane the last couple years, obviously\nneeding the funds and probably why they are going public. If you take in\nconsideration such expansion and the liberal sick time and benefits…",
  "data/reddit-stocks/r/stocks/comments/pof4he/microsoft_announces_share_buyback_and_increase_of.json": "https://money.usnews.com/investing/news/articles/2021-09-14/microsoft-announces-share-buyback-program-of-up-to-60-billion\n\n(Reuters) -Microsoft Corp said on Tuesday its board had authorized a new share\nbuyback program of up to $60 billion, while also raising the quarterly dividend\nby 11%.\n\nThe new…",
  "data/reddit-stocks/r/stocks/comments/pog0n4/i_have_800_that_i_can_afford_to_play_around_with.json": "This is by no means a lot of money compared to a lot of fuck-off money that\npeople have but I am young and I have saved up enough and am in a good financial\nposition to where I have some money that I can put into the stock market. What\nshould I put it into?",
  "data/reddit-stocks/r/stocks/comments/pop7uv/investing_in_mining_stocks_versus_investing_in.json": "I just started investing last year on some mining stocks, and I once came across\na comment talking about how better it is to invest in the company over investing\nin mining stocks. Someone told me that it is better to invest in the mining\ncompanies themselves over the stocks especially if I don’t…",
  "data/reddit-stocks/r/stocks/comments/popvx4/evergrande_effect_on_chinese_banking_system_bank.json": "I'm thinking of selling a stake in Bank of China, but I'm hesitating for the\nfollowing reasons:\n\nLoan distribution:\n\nhttps://pic.bankofchina.com/bocappd/report/202108/P020210830597314582558.pdf\n\ncorporate loans real estate 7.89% exposure\n\nconstruction 2.05%\n\npersonal mortgages 29.94%\n\nAs Bank of…",
  "data/reddit-stocks/r/stocks/comments/poy1t0/here_is_a_market_recap_for_today_wednesday_sept.json": "PsychoMarket Recap - Wednesday, September 15, 2021\n\nStocks steadily rose today, shaking off earlier losses and recent, driven mainly\nby the energy and industrial sectors, as market participants digested new\neconomic numbers and the coronavirus situation in the US. The S&P 500 (SPY)\nclosed 0.83%…",
  "data/reddit-stocks/r/stocks/comments/poye62/lockheed_martin_secures_2_billion_in_pentagon.json": "https://www.msn.com/en-us/travel/news/lockheed-martin-secures-242-billion-in-pentagon-contracts-for-f-35-fighter-jet-program/ar-AAOrII7?ocid=uxbndlbing\n\nThe Department of Defense this week awarded contracts valued at over $2.01\nbillion to Lockheed Martin Corp. to continue making and maintaining the…",
  "data/reddit-stocks/r/stocks/comments/pozfmg/what_are_some_good_set_it_and_forget_it_long_term.json": "Like the title says, I’m looking for some good long term growth stocks that I\ncan set and forget and just let grow. I have a portion of my portfolio that I\nhave been messing around with random tickers I research and find. But I’m\ninterested in creating a decent sized portion that I can just leave…",
  "data/reddit-stocks/r/stocks/comments/pp032v/am_i_crazy_tdoc.json": "Am I crazy for thinking Teladoc is a screaming buy here? I think that the\ncurrent valuation (about $21B) is shockingly low for a company doing $2B in\nrevenue, and expecting to grow revenue by ~30-40% for at least the next couple\nof years. Gross margin around 68% and improving as Livongo becomes a…",
  "data/reddit-stocks/r/stocks/comments/pp0byb/hey_everyone_so_i_lost_34_of_my_portfolio_43000.json": "If there's any bright spot, it's the I only started with 15k at the start of\nCovid. Got it up to 43k and then nuked it down to 11.5k. So really I'm only down\nabout $3500. I realize how stupid and irresponsible I was being by chasing my\nlosses and making irrational YOLO's on 0 day options...like how…",
  "data/reddit-stocks/r/stocks/comments/pp1v8s/where_is_the_cannabis_industry_heading.json": "The past couple of days I've been looking into cannabis stocks and they all seem\nto be reaching a Y.T.D. low, forming a downward wedge.\n\nI came across information stating the summer's end brings in a good amount of\nrevenue for the cannabis sector and am wondering if we should be seeing a break\nout…",
  "data/reddit-stocks/r/stocks/comments/pp4k3h/why_did_the_market_rally_today.json": "What was the news or catalyst that caused that green ending? Ive been looking\nand still havent found a reason why .\n\nIm not against a green ending its rather , I just want to know what caused that\nflip. Also im a little sad that the flip happened , fb and a lot of other stocks\nwere close to testing…",
  "data/reddit-stocks/r/stocks/comments/ppbqip/to_the_more_experienced_folks_here_how_much_were.json": "I see here recently a lot of people talking about Evergrande and their possible\nbankruptcy.\n\nSome are saying, a financial crisis resulting out of this is very unlikely\nbecause the CCP will bail them out and the Chinese real-estate market is\nrelatively isolated from the rest of the world, some are…",
  "data/reddit-stocks/r/stocks/comments/ppcbyw/the_new_moonshot_technologies.json": "BofA Global Research released a 152-page research report identifying 14 “radical\ntechnologies that could change our lives and accelerate the impact of global\nmegatrends.” The technologies have a $330B market size today that could grow to\n$6.4T by the 2030s, strategists led by Haim Israel say. “These…",
  "data/reddit-stocks/r/stocks/comments/ppg53w/i_am_selling_all_of_my_positions_and_withdrawing.json": "After going from 15k to 43k and back down to now 9k (mostly due to 0 day\noptions), I've realized that I have a severe addiction to gambling that I've\nnever had before in my life. I have decided it's no longer worth it. I'm getting\nout after 18 months and a 6k total loss. It's OK, I'm going to be…",
  "data/reddit-stocks/r/stocks/comments/ppglje/sec_chair_gensler_defends_reddit_gamestop.json": "Washington’s top stock market cop is showing no appetite to crack down on the\nbehavior of millions of retail investors who use forums on Reddit and other\nsocial media platforms to coordinate investment strategies, sometimes at the\nexpense of established Wall Street short sellers. During a Wednesday…",
  "data/reddit-stocks/r/stocks/comments/ppgrc8/palantir_and_connected_vehicle_platform_wejo.json": "\"Wejo, a global leader in connected vehicle data, and Palantir Technologies\n(NYSE: PLTR) (“Palantir”) today detailed the early success of a new partnership\naiming to solve the most ambitious problems of the mobility revolution. As the\nworld moves at furious pace to reduce emissions, improve vehicle…",
  "data/reddit-stocks/r/stocks/comments/ppikzl/reasons_i_remain_bullish.json": "Reasons Why I Remain Bullish\n\nHey Psychos!\n\nYou may know me as the guy that writes a the Daily Market Recap. Recently, I've\nbeen getting tons of questions asking me why I remain bullish even now. While I\nnever discount market risks or volatility, I believe in the long-run the market\n(S&P 500) still…",
  "data/reddit-stocks/r/stocks/comments/ppj07q/powell_orders_ethics_review_after_fed_presidents.json": "https://www.cnbc.com/2021/09/16/fed-chief-powell-orders-ethics-review-after-multimillion-dollar-trades.html\n\nI'm sure Powell will make it so Fed presidents can't profit from their\npositions. /s",
  "data/reddit-stocks/r/stocks/comments/ppj8vl/the_carbon_capture_industry_will_be_huge.json": "The Case for Carbon Capture\n\nThe world produces about 40 Gigatonnes of CO2 per year (that’s 1 billion\ntonnes). In order to reach the global warming goal of 1.5°C proposed by the\nParis Climate Agreement, the world needs to be essentially carbon net zero or\nnegative by 2050. The Intergovernmental…",
  "data/reddit-stocks/r/stocks/comments/ppl8cw/worst_companies_to_invest_in_right_now.json": "I see posts daily by people asking for the best stocks that they should invest\nin right now and I am curious of the flip side to this question. What are some\nof the worst stocks to buy right now? Maybe its a company heavily reliant on\nrevenue from a dwindling customer base, a company with good…",
  "data/reddit-stocks/r/stocks/comments/pplxhb/here_is_a_market_recap_for_today_thursday.json": "PsychoMarket Recap - Thursday, September 16, 2021\n\nStocks finished mixed in a volatile session after getting a boost following the\nrelease of new economic data that showed retail sales for the month of August\ncoming in stronger-than-expected, suggesting that consumer spending, which\naccounts for…",
  "data/reddit-stocks/r/stocks/comments/pprm1q/how_to_find_inrt_opad_sprt_before_they_explode.json": "Obviously now every other wsb post is about INRT or OPAD, just waiting to draw\nlosers in to lose their mortgages. But is there a way to find stock DDs like\nINRT or OPAD before they actually exploded? there were probably like 2 or 3\nposts on each, but they were buried under thousands of shitposts. Is…",
  "data/reddit-stocks/r/stocks/comments/ppuc6i/bnpl_firm_sezzle_to_list_on_the_us.json": "Right now, buy-now pay-later (BNPL) is currently the hottest trend in fintech at\nthe moment, due to it's incredible growth rate. ASX: SZL is about to list on the\nUS markets.\n\nAffirm has been hitting new highs daily, trading at 30x revenue multiples.\nGoldman Sachs acquired the BNPL GreenSky…",
  "data/reddit-stocks/r/stocks/comments/ppxcbh/is_it_smart_to_invest_on_physical_copper.json": "I have been investing in copper since last year to add to my profile and made\nsure to diversify. I have the bigger ones like FCX and BHP, investing on them to\nmake sure I got some stocks that are sure and secure in my perspective.\n\nWhen it comes to juniors, I only have two which includes Fortitude…",
  "data/reddit-stocks/r/stocks/comments/ppxkq8/genuine_question_about_meme_valuations_vs_real.json": "How come the videogame Stock is sitting at a circa 8 billion valuation with some\n4 billion in revenue a year,and its called a crazy valuation whereas things like\nZoom or Snap have an 80 billion Market Cap with a measly revenue of 1 billion\n(Zoom) and its a normal or not so crazy valuation.",
  "data/reddit-stocks/r/stocks/comments/pq03l6/is_waiting_for_a_dip_the_best_strategy_i_analyzed.json": "We have all heard it! -- “Time in the market beats timing the market”\n\nAt the same time, we are all to some extent guilty of trying to time the market.\nThe market always seems to break some new all-time high records, so we wait for\nthe inevitable crash/pullback to invest. It’s high time we put both…",
  "data/reddit-stocks/r/stocks/comments/pq0fxp/i_want_to_put_about_400_a_week_into_one_stocketf.json": "Looking for something very safe, with a minimal risk of losing money, but a\nsomewhat reasonable chance of some sort of growth (okay if this isn’t going to\nbe a massive %)\n\nI’m currently thinking i’ll invest into SPY, but curious to hear what others\nthink.\n\nI have another portfolio filled primarily…",
  "data/reddit-stocks/r/stocks/comments/pq252o/whats_going_on_with_nintendo_ntdoy.json": "Disclosure: I am NOT long on Nintendo, but would very much like to be.\n\nToday, I noticed that NTDOY was nearing its 52-week low ($56.72, currently at\n$60), and I decided it may be a good time to buy some shares, as I'm generally\nbullish on Nintendo. I try to aim for companies that dominate a sub…",
  "data/reddit-stocks/r/stocks/comments/pq7yae/quick_reminder_many_stock_youtubers_have.json": "If they told you invest in an index fund or buy and hold the best of\nFAANG+MSFT/NVDA. There would be no reason to watch their videos daily. Or their\nmarket open and close live streams. The views are how they make their money.\nMeet Kevin for example makes millions each month off the views.\n\nSo these…",
  "data/reddit-stocks/r/stocks/comments/pq8gmx/here_is_a_market_recap_for_today_friday_sept_17.json": "PsychoMarket Recap - Friday, September 17, 2021\n\nStocks declined today, reversing from yesterday’s gain given today was a\nquadruple witching event and market participants continue to digest a slew of\nnew economic data and the potential implications for monetary policy. The S&P\n500 (SPY) closed 0.97%…",
  "data/reddit-stocks/r/stocks/comments/pqc84v/instagram_traders_who_sell_courses_are_the_scum.json": "Seriously. These people don’t even make money from trading options, they make\nmoney by selling courses and the occasional photoshop screenshot. I’m taking\nabout people like Aristotle Investments. If these guys could consistently net\nmoney from day trading options, they would have their own hedge…",
  "data/reddit-stocks/r/stocks/comments/pqcjyr/wall_street_week_ahead_for_the_trading_week.json": "Good Friday evening to all of you here on r/stocks [/r/stocks]. I hope everyone\non this sub made out pretty nicely in the market this past week, and is ready\nfor the new trading week ahead.\n\nHere is everything you need to know to get you ready for the trading week\nbeginning September 20th,…",
  "data/reddit-stocks/r/stocks/comments/pqm6fn/teslas_q3_massive_earnings.json": "I know we have mostly Teslas Bulls in this forum that will appreciate this ;)\n\nTesla is entering into a phase of exponential growth and it's going straight to\ntheir earnings.\n\nQ3 is going to be massive.\n\n-Record deliveries with operating expenses not increasing at the same rate\n\n-Higher priced…",
  "data/reddit-stocks/r/stocks/comments/pqnsfd/baba_what_happens_if_its_delisted.json": "I’m an Alibaba bull. China can be incredibly surprising, and who knows what\nthey’ll do next to this company…. But the core business has almost a billion\nusers and it serves a need. I think the real risk for those of us that own\nshares traded on the nyse is it being delisted. As a share holder what…",
  "data/reddit-stocks/r/stocks/comments/pqpodk/what_is_happening_with_the_sp500.json": "So seen that the S&P500 is now down over the past month, and has been going down\nfor straight for the past week. Considering what is going on in China, as well\nas supply chain issues, is this drop normal and nothing to worry about?\n\nConsidering the level of expertise many on this subreddit will…",
  "data/reddit-stocks/r/stocks/comments/pqrcvb/historically_its_way_better_to_invest_at_market.json": "Found this 2018 article, interesting/fun fact: The Stock Market Works by Day,\nbut It Loves the Night\n[https://www.nytimes.com/2018/02/02/your-money/stock-market-after-hours-trading.html]\n\n * If you had bought SPY at the last second of trading on each business day\n   since 1993, and sold at the…",
  "data/reddit-stocks/r/stocks/comments/pqyjww/my_coinbase_analysis.json": "SHOULD I BUY COINBASE HIGHLIGHTS\n\nCoinbase was one of the most highly anticipated IPO’s on the NASDAQ in 2021. The\ncompany has over $180billion of assets on the platform and over 68 million users\nworldwide.\n\nAbout\n\nCoinbase is one of the go-to platforms for people wanting to invest in crypto\nthe…",
  "data/reddit-stocks/r/stocks/comments/pqztun/overlooked_stocks_that_supply_growing_industries.json": "Reposting an updated version of this thread.\n\nWe see a lot of hype around popular industries like genomics, semiconductors, or\ncars, and often these hyped-up stocks end up becoming scarily overvalued.\n\nAnother way to invest in growing and hyped-up industries is to invest into\ncompanies that produce…",
  "data/reddit-stocks/r/stocks/comments/pr1v1p/i_think_the_discord_group_i_belong_to_is.json": "Using a disposable account. I have been a member of this group for about 4\nmonths and have made a modest income. I was recently given more access to some\nof the private chat channels and it seems like the moderators are in the early\nstages of coordinating a pump and dump of stocks.\n\nThey are…",
  "data/reddit-stocks/r/stocks/comments/pr7a8d/how_would_you_manage_500k_usd.json": "Imagine you get 500k USD. Assume it's all your net worth and you don't have\nother assets like property, just a job with a monthly income of $ 3,500 after\ntaxes. How would you use that capital with a 10-year horizon with the idea of\npreserving and increasing it? I was thinking using the Warren buffet…",
  "data/reddit-stocks/r/stocks/comments/pr8u0i/is_evergrande_in_the_process_of_liquidation.json": "I read this article by Reuters (link below) and it very much sounds like\nEvergrande is going through a liquidation/default without having liquidation\nexplicitly in the title?\n\nCan anyone explain to me the difference, if this isn't a cut and…",
  "data/reddit-stocks/r/stocks/comments/pr9773/amazon_is_piling_ads_into_search_results_and_top.json": "https://www.cnbc.com/2021/09/19/amazon-piles-ads-into-search-results-as-big-brands-pay-for-placement.html\n\nAmazon is adding more sponsored product ads to the top of search results.\n\nSponsored product ads accounted for roughly 73% of retailers’ Amazon ad spend in\nthe second quarter of 2021, according…",
  "data/reddit-stocks/r/stocks/comments/prbp3n/old_stock_certificate.json": "Grandfather left me 6000 shares in the form of two stock certificates for a\ncompany called Tri-state Uranium Company issued in 1954. I can't seem to find\nanything on them. Any thoughts on where to look would be much appreciated.",
  "data/reddit-stocks/r/stocks/comments/prcrj9/why_did_the_cocacola_company_choose_ko_as_their.json": "I know that COKE is the symbol for the bottling company while KO is the symbol\nfor the parent company. My question is why they chose KO as their symbol all\nthose years ago? Why not CC or CCO or CO or something more similar to their\ncompany name?",
  "data/reddit-stocks/r/stocks/comments/prcxn8/if_the_market_crash_michael_burry_and_others.json": "When the dot com bubble and 2008 crash happened. I remember seeing news clips of\npeople leaving their offices with boxes of their stuff. The 2020 COVID crash had\nentire jobs shut down. If you worked at home you got lucky but now when I walk\nthe streets of my city I see a lot of for rent signs of…",
  "data/reddit-stocks/r/stocks/comments/prddhf/wall_street_projections_are_mostly_phony.json": "Charlie Munger says if you want to get rid of a problematic stock, hire an\ninvestment banker to pump the shit out of that stock.\n\nIsn't that how you feel about most stock price targets?\n\nAnalysts pull prices out of their ass, and enough traders in the world react to\nthem.",
  "data/reddit-stocks/r/stocks/comments/prlvio/thoughts_on_sofi_and_their_stock.json": "I have very high hopes for SoFi as a company. Bank charter is coming very soon.\nPossibly in November. They have the SoFi Stadium that’s hosting multiple big\nsports events such as the the opening and closing ceremonies of the Olympic\nGames in 2028. Concerts coming from some big artists in the next…",
  "data/reddit-stocks/r/stocks/comments/prm2st/what_is_your_plan_to_profit_from_evergrande.json": "Quick summary: Evergrande is a real-estate developer from China that has $305\nbillion of liabilities and cannot pay of their debt. They are not the only\ncompany though, other real-estate companies are also facing liquidity problems\nand it looks like the property bubble in China is collapsing. Right…",
  "data/reddit-stocks/r/stocks/comments/prmb2y/evergrande_impact_on_us_economy.json": "Evergrande is probably defaulting and impacting the banking sector and then\nother sectors. Combine that with the capital flight due to the regulations this\nyear impacting Alibaba and others. Chinese consumers will have lower purchasing\npower or sentiment.\n\n8% of US exports are to China and 20% of…",
  "data/reddit-stocks/r/stocks/comments/prnd3o/is_the_evergrande_situation_really_a_lehman.json": "Lehman brothers was a critical part of the financial system that, when it went\ndown, caused credit freezes that domino'd into more financial crisis. Due to the\nnature of their business, it makes sense them blowing up could really domino,\nbut..\n\nEvergrande is just a real estate developer. Investors…",
  "data/reddit-stocks/r/stocks/comments/prrb1b/rstocks_daily_discussion_monday_sep_20_2021.json": "These daily discussions run from Monday to Friday including during our themed\nposts.\n\nSome helpful links:\n\n * Finviz [https://finviz.com/quote.ashx?t=spy] for charts, fundamentals, and\n   aggregated news on individual stocks\n * Bloomberg market news [https://www.bloomberg.com/markets]\n *…",
  "data/reddit-stocks/r/stocks/comments/prrw9j/positions_you_are_looking_for_increase_amidst_al.json": "The future of the China drama is yet to unfold and with people on both sides of\nthe coin preaching world collapse and others saying it will have little effect\non the US market. What are you thoughts on companies that are down today and may\ncontinue to drop due to the news?\n\nAre you doubling down on…",
  "data/reddit-stocks/r/stocks/comments/prtr9g/copper_prices_will_be_affected_as_coronavirus.json": "The outbreak of the pandemic disrupted a lot of industries and impacted\ncompanies and individuals greatly. It affected a lot of industries, and\nespecially a great number of economic activities, which includes mining.\n\nBut for Chile, which is the top copper-producing nation, it seemed like…",
  "data/reddit-stocks/r/stocks/comments/pru6m5/dow_futures_skid_nearly_2_monday_as_fear_of.json": "U.S. stock futures fell sharply on Monday, with those for the Dow Jones\nIndustrial Average tumbling 500 points, as Hong Kong-listed property companies\ncame under fresh pressure. Investors also were positioning ahead of this week’s\nFederal Open Market Committee meeting.\n\nHow are stock futures…",
  "data/reddit-stocks/r/stocks/comments/prw8cl/is_it_better_to_keep_money_in_the_market_through.json": "So let me preface this, I’m super new to investing have studied markets and\neconomics for years and am a math guy but never got into investing until a few\nmonths ago. Right now I have some money in a personal roboadvisor just to get my\nfeet wet with investing since I wasn’t sure how actively I would…",
  "data/reddit-stocks/r/stocks/comments/prwuus/here_are_the_worstperforming_us_stocks_as_the.json": "An expected bond default by real estate company China Evergrande Group led to an\nearly tumble for U.S. stocks Monday. Evergrande is China’s most indebted real\nestate developer. S&P Global Ratings said Monday that missed bond payments by\nthe developer “could broadly rattle investors’ confidence in…",
  "data/reddit-stocks/r/stocks/comments/ps0u1j/unpopular_opinion_i_want_my_stocks_to_go_down.json": "If you follow the great value investors, they all seem to allude to a similar\nidea: You don't own a stock, you own part of a business.\n\nStocks go up and down and it makes sense that you want to sell if for more than\nyou paid for it. However, if you truly believe you are investing in a business\nand…",
  "data/reddit-stocks/r/stocks/comments/ps0u2e/why_are_95_of_stocks_down_rightnow_and_down_big_i.json": "Every single one I’m invested in is currently down, (and most are down between\nlike 5%-10%) And out of the over 50 stocks I’m following, only like 3 are in the\ngreen. What is going on with the market? I’ve never seen anything like this\n(I’ve only been investing since December)\n\nEdit: thanks for…",
  "data/reddit-stocks/r/stocks/comments/ps126a/has_anyone_else_noticed_how_many_fraudulent_stock.json": "They claim they’ve made millions through day trading and will lead their\ninvestors into terrible trades, but when the stock crashes they claim they sold\nat the perfect time. It’s all fake…. Do people take these accounts seriously?",
  "data/reddit-stocks/r/stocks/comments/ps3xii/here_is_a_market_recap_for_today_monday_september.json": "PsychoMarket Recap - Monday, September 20, 2021\n\nStocks plunged on Monday, with the three major indexes having one of the\nworst-performing days all year as market participants nervously eyed potential\nripple effects from the default of the second-largest Chinese real estate\ncompany and commentary…",
  "data/reddit-stocks/r/stocks/comments/ps5sz3/im_holding_200k_in_2024_aapl_leaps_should_i.json": "The largest position in my portfolio is $200c for AAPL that expire Jan 2024.\nBefore today I felt confident in AAPL's ability to easily surpass $200 by 2024\nand had planned to hold for a couple years. Now I'm not so sure.\n\nSo I'm looking for some extra input. Is this a short setback for the…",
  "data/reddit-stocks/r/stocks/comments/ps7jpj/yang_x3_inverse_leverage_etf_china_bear_shares_if.json": "Just wanted to share this ticker with people who may not know of it already. It\nhas been performing very well lately, of course with all the China FUD. If you\nthink things are only going to get worse and want to short China, then maybe try\nthis out. I know I have seen some people asking, jokingly or…",
  "data/reddit-stocks/r/stocks/comments/psbxri/cnbc_china_likely_wont_bail_out_evergrande.json": "Beijing is not expected to provide direct support for debt-ridden developer\nChina Evergrande Group, according to a Monday report by S&P Global Ratings.\n\n“We do not expect the government to provide any direct support to Evergrande,”\nsaid the S&P credit analysts in a Monday report. “We believe Beijing…",
  "data/reddit-stocks/r/stocks/comments/psevc3/evergrande_isnt_the_only_reason_the_stock_market.json": "I've summarised the news and added a link just in case you guys want to read the\ncomplete article-\n\nU.S. stock benchmarks were on track to post their worst daily drops in more than\ntwo months, with the skid being blamed on the potential collapse of Evergrande.\nThe Chinese property giant is…",
  "data/reddit-stocks/r/stocks/comments/psixxp/lng_great_industry_terrible_strategy.json": "As a huge $TELL bull (see my other DD posts), I am often asked: “Why not just go\nwith Cheniere (ticker $LNG)?”\n\nTill recently, the answer has been pretty simple- “I want to get in on the\nground floor with Tellurian.”\n\nWell that WAS my answer till I read this article about why Cheniere missed…",
  "data/reddit-stocks/r/stocks/comments/psjcu2/why_did_evergrande_affect_the_market_so_much.json": "I'm still new to stock trading. What i don't understand is why did the\nEvergrande news affect companies who aren't even related to it. Why did most of\nthe stocks drop yesterday even though Evergrande doesn't affect them and/or\nisn't indebted to them.",
  "data/reddit-stocks/r/stocks/comments/psk32b/why_dkng_is_now_on_sale.json": "News of an 20billion dollar offer for UK betting company Entain had sent shares\ndown in price. The offer is a large number and a good amount of it is in stock,\nso this makes sense. Longer term this is a huge win for DKNG if they get this.\nCurrently Entain has an agreement with MGM for helping manage…",
  "data/reddit-stocks/r/stocks/comments/pslhae/eli5_whats_causing_upst_to_keep_rising_nonstop_is.json": "No matter what this stock just does not want to stop flying to new ATHs. Every\nday I check it's up at least 10% usually more. Haven't seen a single red day on\nthis stock even during uncertainty. P/E is almost 500 according to google, what\nis the reason? Is it just THAT undervalued? I don't…",
  "data/reddit-stocks/r/stocks/comments/psp04q/i_think_im_addicted_please_help.json": "I started investing months ago. During the summer, I have a full-time job,\nstarts before the market opens, and ends after the market ends. But right now,\nschool starts, and I spent most of my time at home.\n\nI can't help myself constantly open trackers, my portfolios, and news relevant\nto my…",
  "data/reddit-stocks/r/stocks/comments/psq8ye/stocks_on_a_discount.json": "Looking to invest some money during this dip. I will DCA into stocks that have\nsuffered greately. What are some companies that have suffered but will retain\ntheir market share after all this has ended? Suggestions are welcomed, I will\nstill do my own research after.\n\nEdit: I will wait a couple more…",
  "data/reddit-stocks/r/stocks/comments/pstlwd/amazon_will_lobby_government_to_legalize_marijuana.json": "https://www.cnbc.com/2021/09/21/amazon-will-lobby-government-to-legalize-marijuana.html\n\nAmazon lobbying for legalization. This is Amazon, so who knows, this could go\nsomewhere. Or not. Thoughts though? What are you expecting long-term? And lets\nsay legalization does happen, what tickers would you…",
  "data/reddit-stocks/r/stocks/comments/psu0a8/celltrion_and_180_life_sciences.json": "Celltrion is a 32 billion market cap biotech leader developing monoclonal\nanti-bodies for a variety of indications, including COVID-19 (regdanvimab) and a\nwhole mess of other inflammatory diseases such as RA and Crohn's disease.\nThey're going up against Abbvie with a biosimilar for Humira called…",
  "data/reddit-stocks/r/stocks/comments/pswd0l/here_is_a_market_recap_for_today_tuesday.json": "PsychoMarket Recap - Tuesday, September 21, 2021\n\nSorry for the delay in posting the recap, was having technical difficulties on\nmy end\n\nStocks closed lower once again in another volatile session as market\nparticipants continue to digest the fallout from Evergrande in China and\nanxiously wait for…",
  "data/reddit-stocks/r/stocks/comments/psx4nn/china_evergrande_unit_says_to_make_onshore_bond.json": "No default tomorrow. US Futures shot up after this news. Chinese markets were\nclosed on Monday and Tuesday and everybody was expecting Evergrande to default\ntomorrow. No info on the fate of foreign bondholders in certain, but it is to be\nbelieved that they will most likely get stiffed. This is for…",
  "data/reddit-stocks/r/stocks/comments/pt164m/is_evergrande_rescued.json": "Hi guys, is this already rescued or can we expect a deeper problem going? For\nexample i read that china is bailing out only domestic market so what happens\nwith the us investors? Im not sure that we are fine yet i feel something big is\ncoming and it all gonna crash. What are your thouthgs on this?",
  "data/reddit-stocks/r/stocks/comments/pt2gre/just_put_your_money_in_and_do_something_else.json": "It's easy to overreact to every economic story. Long term very few if any make a\ndifference.\n\nSo a few words of advice from people who's views I respect:\n\nNoble winning economist Richard Thaler on Bloomberg was asked what investors\nshould do when there is a market crash. He replied: Stop watching…",
  "data/reddit-stocks/r/stocks/comments/pt3usy/rstocks_daily_discussion_wednesday_sep_22_2021.json": "These daily discussions run from Monday to Friday including during our themed\nposts.\n\nSome helpful links:\n\n * Finviz [https://finviz.com/quote.ashx?t=spy] for charts, fundamentals, and\n   aggregated news on individual stocks\n * Bloomberg market news [https://www.bloomberg.com/markets]\n *…",
  "data/reddit-stocks/r/stocks/comments/pt872a/ford_is_investing_in_a_battery_recycling_startup.json": "U.S. auto giant Ford Motor is diving deeper into electric vehicles in an\nunexpected way. The company is investing in battery recycling start-up Redwood\nMaterials, which is run by Tesla (ticker: TSLA) co-founder J.B. Straubel. The\ntwo companies are working to create a closed-loop recycling chain for…",
  "data/reddit-stocks/r/stocks/comments/pt89es/does_anyone_else_feel_like_fundamental_based.json": "For some reason, it seems like we've ushered in a new era of hype trading. Ever\nsince the March crash of 2020, using fundamentals has been a fools game.\n\n\n\nTo add, the constant pumping of stocks, no matter the news is just going to end\nup in a cataclysmic crash. There is no way that these sort of…",
  "data/reddit-stocks/r/stocks/comments/pt959x/which_semiconductor_stock_would_you_recommend.json": "Hey! I got into investing a month ago where I transferred all the money I had\nsaved into my account. Since I'm only 13 that was only $1,500 but it's better\nthan nothing I guess. I invested $1000 into NVDA right before earnings so I'm\ndoing pretty great so far.\n\nBut what should my next investment be?…",
  "data/reddit-stocks/r/stocks/comments/pt98q9/10_rules_for_picking_gambling_stocks.json": "With all the talk of DKNG, PENN, RSI and others, here are some general pointers\non Gambling Stocks from my experience. Add away!\n\n\n\n 1.  Know your handle from your gross and net gaming revenue. Sportsbooks may\n     dazzle you with handle, but the bottom line figure of gross or net gaming\n    …",
  "data/reddit-stocks/r/stocks/comments/ptc0qj/imminent_china_evergrande_deal_will_see_ccp_take.json": "> Sources close to the Chinese Government have told Asia Markets a deal that\n> will see China Evergrande restructured into three seperate entities is\n> currently being finalised by the Chinese Communist Party and could be\n> announced within days.\n> \n> State-owned enterprises will underpin the…",
  "data/reddit-stocks/r/stocks/comments/ptd3fx/how_does_the_irs_know_how_much_to_tax_me.json": "I am fairly new to trading. Let's say I made $1000 capital gains and I cash out\nafter 3 months. Let's assume that I also have a low income. How will the IRS\nknow how much I get taxed if I am using a brokerage like Public, Webull or\nRobinhood?\n\nDoes it have to do with my SSN?",
  "data/reddit-stocks/r/stocks/comments/ptezk7/facebook_oversold.json": "Facebook is one of the stocks most held by hedge funds in Q3 2021 but has seen a\nhuge 7% sell-off in the past five days because of mostly apple related privacy\nnews. Any thought on a strong bounce back in the coming weeks?",
  "data/reddit-stocks/r/stocks/comments/ptgbu4/why_do_people_care_about_the_dowjones.json": "If the Dow is weighted by stock price and not market cap why the fuck does\nanyone care about it?\n\nI’m honestly asking not trying to be a dick I just DO NOT GET how a stock price\nweighted index of 30 companies is something I have to hear NPR mention every\nfucking hour and why people care so much.\n\nI…",
  "data/reddit-stocks/r/stocks/comments/pth3cd/here_is_a_market_recap_for_today_wednesday.json": "PsychoMarket Recap - Wednesday, September 22, 2021\n\nThe market bounced today, breaking on the year’s longest streak of\nunderperformance as Evergrande fears in the US ease and market participants\ndigest commentary from the Federal Reserve’s September monetary policy meeting,\nwhich indicated the…",
  "data/reddit-stocks/r/stocks/comments/pthwf5/blackberry_beats_quarterly_revenue_expectations.json": "https://www.msn.com/en-us/money/companies/blackberry-beats-quarterly-revenue-expectations-on-cybersecurity-boost/ar-AAOIohe?ocid=uxbndlbing\n\n(Reuters) -Canada's BlackBerry Ltd beat Wall Street estimates for second-quarter\nrevenue on Wednesday as hybrid working trends drove demand for its…",
  "data/reddit-stocks/r/stocks/comments/ptib5p/misconceptions_you_had_about_the_stock_market.json": "Let’s look back at our own histories and laugh for a moment. What are some\nmisconceptions you once had about the stock market? They can range from any time\nin your life when you were exposed to the market, be it as a child who knew\nnothing to an adult who was researching it hoping to invest or…",
  "data/reddit-stocks/r/stocks/comments/ptjbx7/amazon_is_lobbying_the_federal_government_to.json": "„Amazon said it has “reinstated the employment eligibility” for former workers\nor applicants who were fired or deferred during marijuana screenings. Amazon\nended pre-employment marijuana screenings for most job applicants in June. The\ncompany is also lobbying the federal government to legalize…",
  "data/reddit-stocks/r/stocks/comments/ptskp4/recently_invested_in_some_mining_stocks.json": "Diversifying my portfolio is currently my goal ever since I started investing on\nmining stocks last year. When I started though, I was focused on the bigger ones\nlike FCX and NEM, since these are stocks that you can feel sure and secure in my\nperspective.\n\nThough recently I came across some juniors…",
  "data/reddit-stocks/r/stocks/comments/ptsvwr/wsj_china_prepares_for_downfall_of_debtladen.json": "[subtitle:\n\nBeijing, reluctant to bail out the country’s most heavily indebted property\ndeveloper, is asking local officials across the country to prepare for a\n‘possible storm]\n\nhttps://www.wsj.com/articles/china-makes-preparations-for-evergrandes-demise-11632391852\n\n(archived:…",
  "data/reddit-stocks/r/stocks/comments/pttdsr/china_asks_local_goverments_to_get_ready_for.json": "Published: Sept. 23, 2021 at 7:08 a.m. ET\n\nChinese authorities are asking local governments to prepare for the potential\ndownfall of China Evergrande Group, according to officials familiar with the\ndiscussions, signaling a reluctance to bail out the debt-saddled property\ndeveloper while bracing for…",
  "data/reddit-stocks/r/stocks/comments/ptu2gg/why_am_i_seeing_nobody_talking_about_the_us.json": "Is this not a concern for anyone? I feel like it shouldn’t be but with how\ndivided the government is I am a little concerned. It doesn’t seem impossible to\nme that Republicans block the Democrats’ spending package. I’m seeing articles\nabout insane crashes if we default. I’m sure that’s extremely…",
  "data/reddit-stocks/r/stocks/comments/ptud65/im_reading_the_ft_and_wsj_from_100_years_ago_each.json": "http://roaring20s.substack.com\n\n\nSEPTEMBER 19-25, 1921\n\nThis week, the Fed lowers rates to 5%, and the WSJ editors bravely declare the\nDow has bottomed.\n\n> Quick Stats:\n> DJIA: 69.43 (Today: 34,584)\n> Shiller PE Ratio: 5.4 (Today: 38.3)\n> Federal Reserve Bank of NY Discount Rate: 5.0% (Today:…",
  "data/reddit-stocks/r/stocks/comments/pu5jt6/here_is_a_market_recap_for_today_thursday_sept_24.json": "PsychoMarket Recap - Thursday, September 23, 2021\n\nStocks extended yesterday’s remarkable bounce with another great day as\ninvestors cheered the Federal Reserve’s monthly monetary policy decision, which\nindicated the central bank will likely start tapering the pace of quantitative\neasing in the…",
  "data/reddit-stocks/r/stocks/comments/pu5pam/inflationary_depression_part_1_the_everything.json": "The US is showing signs of Inflationary Depressions from the past. I have\ncreated a 3 part series that will break it down. Part 1 will break down the\ncurrent market and how we got here. Part 2 will explain what we should expect\nand why we are beginning to see the things we are seeing. Part 3 is how…",
  "data/reddit-stocks/r/stocks/comments/pu701f/the_bear_case_for_labgrown_meat_the_industry_may.json": "I've always considered investing in lab-grown meat, thinking it's an inevitable\npart of the future. So I found this article really fascinating:\nhttps://thecounter.org/lab-grown-cultivated-meat-cost-at-scale/\n\n\"Splashy headlines have long overshadowed inconvenient truths about biology and\neconomics.…",
  "data/reddit-stocks/r/stocks/comments/pu7rdm/nfl_prefers_apple_as_new_sunday_ticket_provider.json": "I think this would be a huge win for Apple TV+. Especially if Apple was able to\ndo sub packages along with the main package. I also think this would be a huge\nbenefit to Apples ad business.. love the move if it goes through..\n\nLong Apple\n\nhttps://theathletic.com/news/nfl-prefers-apple-as-new-sunday…",
  "data/reddit-stocks/r/stocks/comments/pu88ta/unpopular_opinion_apples_growth_over_the_next_10.json": "Disclaimer: This is my own speculation and opinion to kick off a discussion\nabout Apple's future.\n\nNo one here is a stranger to Apple's monstrous cash generation and\nprofitability. It's been a behemoth of a stock and has basically guaranteed\nimpressive returns for those long on it. With around a 2.1…",
  "data/reddit-stocks/r/stocks/comments/pubabb/will_the_irs_know_how_much_money_i_have_even_if_i.json": "Let's say that through my investments I made over $75,000. However I do not want\nto withdraw any of it right not due to personal reasons. Will the IRS know that\nI have this money, therefore tax me somehow?\n\nI'm very new to this, thank you.",
  "data/reddit-stocks/r/stocks/comments/pugkvb/which_etf_do_you_consider_a_must_have_for_every.json": "Even though I like doing DD on single stocks, I have the urge to get 1 or 2\nworld ETFs or S&P 500 ETFs (or other ETFs?) to keep my portfolio at balance. Not\nlooking for a tech heavy ETF as my portfolio already is. I’m struggling in\ncomparing for example S&P 500 ETFs. Are those technically not the…",
  "data/reddit-stocks/r/stocks/comments/puhzzv/should_you_follow_insider_transactions_i_analyzed.json": "There is an old saying on Wall Street.\n\n> There are many possible reasons to sell a stock, but only one reason to buy.\n\nIf you think about it, you can sell stocks for any number of reasons -\ndownpayment for a house, a medical emergency, or just plain profit booking. But\nwhen you are using your hard…",
  "data/reddit-stocks/r/stocks/comments/puowx8/at_what_price_were_faang_stocks_considered.json": "At what price were FAANG stocks such as Apple, Facebook, Amazon considered\novervalued? I wonder since many stocks are considered \"overvalued\" today but I'd\nbet even going back 5 years ago a stock like Amazon was considered massively\novervalued.\n\nIf people have dates and prices that'd be great to…",
  "data/reddit-stocks/r/stocks/comments/pupmem/what_is_a_stock_that_you_believe_will_crash_and.json": "Since we have many threads about what stocks we think will rise, lets have one\nabout what stocks we think will fall.\n\nWhat do you think is overvalued? What do you see dropping in the future? What\ncompany would you not touch with a twenty foot pole right now?",
  "data/reddit-stocks/r/stocks/comments/pus8e3/in_a_competition_and_need_risky_shortterm_stock.json": "I'm in a competition at school where we have $500,000 to invest into the stock\nmarket with the option to invest $500,000 if we borrow money. It's all pretend\nof course, ha. And the rules don't say anything about asking the internet for\nadvice!\n\nThe competition starts now and ends in December. Not a…",
  "data/reddit-stocks/r/stocks/comments/putqb4/baba_never_ending_dip.json": "Losing faith ... can this ever come back? What needs to happen for it to turn\naround?\n\nNewish investor. Been holding for 9 months. Bought on a dip to $260 and as you\nknow for various reasons, it has kept on dipping. Charlie Munger bought it not\ntoo long ago which gave me hope. But day after day of…",
  "data/reddit-stocks/r/stocks/comments/puuufi/here_is_a_market_recap_for_today_friday_september.json": "PsychoMarket Recap - Friday, September 24, 2021\n\nDespite opening the day in the red, the three major modestly extended gains\nafter the best day since July. The S&P 500 (SPY) rose 0.16%, the Nasdaq (QQQ)\nrose 0.09%, and the Dow Jones (DIA) rose 0.09%. Despite all the volatility this\nweek and the…",
  "data/reddit-stocks/r/stocks/comments/puvj5y/i_want_to_invest_20000_by_just_setting_it_and.json": "Vanguard total market? S and P 1500? I’m 32 so there’s time!\n\nI have no idea! All 100% stocks. ETF’s or index funds, are those the same?\n\nI don’t mind it being a taxable account or paying a small management fee. I\nwon’t be cashing anything out anytime soon, all long term\n\nPlease help!",
  "data/reddit-stocks/r/stocks/comments/puw61f/wall_street_week_ahead_for_the_trading_week.json": "Good Friday evening to all of you here on r/stocks [/r/stocks]. I hope everyone\non this sub made out pretty nicely in the market this past week, and is ready\nfor the new trading week ahead.\n\nHere is everything you need to know to get you ready for the trading week\nbeginning September 27th,…",
  "data/reddit-stocks/r/stocks/comments/puxzew/sofi_the_next_multimillionaire_stock.json": "Disclosure: This is not financial advice and this is my personal opinion on the\nstock. You take full responsibility for your own action.\n\nFull disclosure on position:\n\n600 shares @ $18.14\n\n3 reasons to invest in SOFI?\n\n1. Anthony Noto\n\nFormer Twitter executive and managing director at Goldman Sachs.…",
  "data/reddit-stocks/r/stocks/comments/pv2t8r/will_amazon_and_google_ever_split_their_stock_why.json": "I am building positioning in both of these companies as I want one full share of\neach to just let them ride for the next 5-10 years.\n\nWith AMZN currently sitting at $3,425 a share and GOOGL sitting at $2844 a share\ndo you think a split is approaching?\n\nWhat are the benefits of keeping a stock price…",
  "data/reddit-stocks/r/stocks/comments/pvblkn/what_stocks_currently_at_their_52_week_lows_or.json": "There is often talk the entire market is overvalued due to it hitting new highs.\nBut there are a bunch of stocks going lower and lower and may have even fell\nbelow prices from peak COVID fears in March/April of last year. Which do you\nfeel has the best chance to recover?",
  "data/reddit-stocks/r/stocks/comments/pvg5rg/costco_nike_and_fedex_are_warning_theres_more.json": "> A slew of factors including rising shipping cost and supply chain bottlenecks\n> are persisting and should last through the upcoming holiday season.\n> \n> One issue is that the cost to ship containers overseas has soared in recent\n> months.\n> \n> Many companies have indicated that consumers at least…",
  "data/reddit-stocks/r/stocks/comments/pvgdke/what_do_you_think_of_root_insurance.json": "There is talk that everyone is sitting on a lot of cash reserves waiting for a\nbig drop or a big market correction. What I’m seeing is that individual stocks\nhave already been dropping significantly from their all time highs during their\nhighs earlier this year around February.\n\nWill stocks like…",
  "data/reddit-stocks/r/stocks/comments/pvvzsl/whats_your_top_5_stocks_to_buy_and_hold_for_the.json": "Hello everybody,\n\nWhen it comes to investing, it’s always best to build a balanced portfolio. Are\nyou looking for growth stocks, dividend stocks or innovation disruptive stocks.\n\nWhat’s your top 5 long term stocks to buy and hold for the next decade?\n\nEDIT: Also tell me your reasoning for your 5…",
  "data/reddit-stocks/r/stocks/comments/pw1ho2/the_chinese_economy_vs_the_chinese_stock_market.json": "I was watching a recent interview with a famous hedge fund manager recently\nwhere he essentially said you have to be invested in the Chinese stock market\nbecause that is where the economic growth is taking place at a rapid pace. We\ncertainly all have the feeling that rapid growth = higher stock…",
  "data/reddit-stocks/r/stocks/comments/pw6vgf/what_type_of_research_do_you_do_on_a_company.json": "Just curious to see what your guys research methods are when looking into a\ncompany. I tend to check the companies sector, financial statements, historic\nannouncements and trends and the amount of controversy the company has\nexperienced.\n\nWhat do you guys check?",
  "data/reddit-stocks/r/stocks/comments/pw8wgi/disneys_shangchi_becomes_years_top_grossing_film.json": "Shang-Chi and the Legend of the Ten Rings” maintained its hold as the top film\nin the U.S. for the fourth consecutive week, bringing in $13.3 million from\n3,952 theaters and setting a new record as the year’s top grossing film with\n$196.5 million in domestic ticket sales.\n\nShang-Chi” toppled another…",
  "data/reddit-stocks/r/stocks/comments/pwgbo6/heres_your_daily_market_brief_for_september_27th.json": "Top News\n\n * S&P 500 Futures are -.33%; Dow Futures are -.01%; NASDAQ Futures are -.86%\n * US stock futures move lower as issues around the globe continue to develop.\n   Investors are looking at several Fed officials speaking this week, concerns\n   over a US government shutdown, the lack of a clear…",
  "data/reddit-stocks/r/stocks/comments/pwgi1d/what_are_your_stocks_on_your_watchlist_that_just.json": "I had posted about Toei Animation (ip holder of dragonball etc.) that\nskyrocketed over 400% since last year on no fundamental changes on the company\nnor the industy.\n\nIm also keep looking at Duolingo (DUOL) getting higher valuations on a weekly\nbasis without any news since IPO this summer. Its close…",
  "data/reddit-stocks/r/stocks/comments/pwjiye/i_bought_some_large_cap_growth_stocks_and_for.json": "I have terrible luck timing the market short-term. Every position I start ends\nup behind the 8-ball. So I recently bought some large cap growth companies to\nhopefully smooth things out. Of course, the gods of Wall Street were keenly\ninterested in my orders of 1-2 shares which prompted an immediate…",
  "data/reddit-stocks/r/stocks/comments/pwl2pp/blackrock_may_buy_china_equities_after_price_drop.json": "https://finance.yahoo.com/news/boivin-says-blackrock-may-buy-144005496.html\n\n“We are starting to think now it is time to dip our toe back in the Chinese\nequities,” Boivin, head of the BlackRock Investment Institute, said in an\ninterview on Bloomberg TV’s Surveillance on Monday. “You’ve seen a…",
  "data/reddit-stocks/r/stocks/comments/pwmqdz/does_copying_ceo_performance_grants_beat_the.json": "I scraped every new performance grant CEOs received in 2017 to see if copying\nthose trades would beat the market. The initial results are very promising\n(12-25% ɑlpha on average depending on the timeframe), but more research needs to\nbe done!\n\n\nHOW IT WORKS:\n\nI wrote a python script that scraped…",
  "data/reddit-stocks/r/stocks/comments/pwq49n/here_is_a_market_recap_for_today_monday_sept_27.json": "PsychoMarket Recap - Monday, September 27, 2021\n\nStocks finished mixed, with the S&P 500 (SPY) and Nasdaq (QQQ) falling as\ntechnology stocks came under pressure by the rising treasury yield while the Dow\nJones (DIA) rose, driven higher by strength in financials and energy stocks. The\nRussell 2000…",
  "data/reddit-stocks/r/stocks/comments/pwqgq9/dallas_fed_president_kaplan_to_retire_early_on.json": "https://www.cnbc.com/2021/09/27/dallas-fed-president-kaplan-to-retire-early-on-oct-8-citing-trading-disclosure-distraction.html\n\nDallas Federal Reserve President Robert Kaplan became the second regional\ncentral bank leader to resign Monday, saying he was stepping down early\nfollowing a recent…",
  "data/reddit-stocks/r/stocks/comments/pwrt85/good_growth_stocks_for_a_college_student_with.json": "Senior in College looking to put $500 a month into stocks. I am not going to\nsell the stocks but am moving to a different country and don’t plan on taking\nthe stocks out for at least a year. Thoughts? I understand most of this will be\nopinion based.",
  "data/reddit-stocks/r/stocks/comments/pwtp0q/cathie_wood_72020oil_demand_probably_hit_a.json": "Her full tweet was:\n\n> Oil demand probably hit a secular peak last year and, thanks to #EVs, now is\n> in secular “decline”. Though ARK has no formal forecast, I believe that\n> #Oilprices are on their way back to $12, the level reached after the 1973 oil\n> cartel crisis, or lower, now that EVs are…",
  "data/reddit-stocks/r/stocks/comments/pwvx1e/are_there_any_downsides_to_holding_tqqq_if_i_plan.json": "So I've also heard that you shouldn't hold leveraged funds for longer than a day\nor that they should only be used for swing trades.\n\nBut I'm wondering why can't you hold them long term? Your return will be 3X, and\nif the underlying fund is gonna go up in the long-term anyways (ie, SPY or…",
  "data/reddit-stocks/r/stocks/comments/px2n98/rstocks_daily_discussion_technicals_tuesday_sep.json": "This is the daily discussion, so anything stocks related is fine, but the theme\nfor today is on technical analysis (TA), but if TA is not your thing then just\nignore the theme and/or post your arguments against TA…",
  "data/reddit-stocks/r/stocks/comments/px5pjh/zillow_is_paying_above_market_price_for_houses.json": "A few weeks ago, Zillow offered me $30,000 above market value (in writing) for\nmy house. My house was listed on the MLS and they could’ve offered the sales\nprice if they wanted, but they offered $30,000 over that. A neighbor without a\nrealtor was offered and accepted $75,000 (20%) over market value.…",
  "data/reddit-stocks/r/stocks/comments/px6cgl/congress_must_raise_the_debt_limit_by_oct_18.json": "Treasury Secretary Janet Yellen on Tuesday told House Speaker Nancy Pelosi that\nCongress has just under three weeks to address the looming debt ceiling and\navoid near-certain economic calamity.\n\n“We now estimate that Treasury is likely to exhaust its extraordinary measures\nif Congress has not acted…",
  "data/reddit-stocks/r/stocks/comments/px7c6q/what_to_do_when_the_market_is_bleeding.json": "What do i do when the market is bleeding? I know that i definetely won't panic\nsell, and people always tell me to buy the dip. But how do i ensure that it\nwon't dip after the dip? What kind of stocks are generally safest during a dip?",
  "data/reddit-stocks/r/stocks/comments/px7k8f/fed_chair_powell_to_warn_congress_that_inflation.json": "Fed Chair Powell to warn Congress that inflation pressures could last longer\nthan expected\n\n\n\n**Shocked Pikachu Face**\n\n\n\nhttps://www.cnbc.com/2021/09/27/fed-chair-powell-to-warn-congress-that-inflation-pressures-could-last-longer-than-expected.html",
  "data/reddit-stocks/r/stocks/comments/px8s0x/buy_nvda_today_in_the_dip.json": "What are your thoughts on Nvidia it is near an all time high but pretty big dip\ntoday? I made a little off them earlier in the year but sold around the split.\nThoughts on upcoming earnings/do you expect to go lower? Appreciated.",
  "data/reddit-stocks/r/stocks/comments/pxfjih/here_is_a_market_recap_for_today_tuesday_sept_28.json": "PsychoMarket Recap - Tuesday, September 28, 2021\n\nStocks sank today, as technology stocks plummeted, with the Nasdaq (QQQ) having\nits worst day since March as investors nervously eye a swift rise in the\nbenchmark 10-year Treasury yield, a disappointing consumer confidence report,\nand power shortages…",
  "data/reddit-stocks/r/stocks/comments/pxgusn/volume_this_year_in_the_market_at_large_is_up_700.json": "This article\n[https://upsidechronicles.com/2021/09/27/something-big-is-lurking-in-wall-streets-dark-pools/]\nis rather long and the first half is just basic definitions/history, but the\nsecond half has some interesting graphs about dark pool activity worth looking\nat.\n\nKey points:\n\n * the total…",
  "data/reddit-stocks/r/stocks/comments/pxhpcv/what_will_tomorrow_bring.json": "I think the rest of the week will be a declining-volatility environment, which\nlooks like a \"descending consolidation\" in price.\n\nThe VIX shot up today, but on weakness, so it likely will decrease, not\nincrease.\n\nThe SPY therefore will likely settle into its now low, but unlikely to rise.\n\nI think…",
  "data/reddit-stocks/r/stocks/comments/pxlo3s/secret_projects_apple_is_working_on_over_the_next.json": "This is somewhat of a response to another post I saw on this subreddit saying\nApple needs radical innovation to grow, and while I think that’s not true and\nthat Apple is a great company regardless of any future projects, I went ahead\nand did some digging and found a couple new projects Apple has in…",
  "data/reddit-stocks/r/stocks/comments/pxsq57/should_you_invest_in_the_most_reputable_brands_in.json": "Coke is just soda.\n\nLevi’s are just jeans.\n\nThe iPhone is just a phone.\n\nYet, we go out of our ways to select certain brands over others - most of the\ntime at a higher price [1]. Everyone knows the importance of reputation for a\ncompany. Highly reputable brands have multiple things going for them:\n\n…",
  "data/reddit-stocks/r/stocks/comments/pxu98g/heres_your_daily_market_brief_for_september_29th.json": "Top News\n\n * S&P 500 Futures are +.59%; Dow Futures are +.45%; NASDAQ Futures are +.78%\n * US stock futures move slightly higher after the worst drop for the S&P 500 in\n   around 4 months. Bond yields taper marginally lower although the 10-year\n   treasury yield is still at the highest levels since…",
  "data/reddit-stocks/r/stocks/comments/pxvq42/how_do_i_begin_searching_for_companies_to_invest.json": "What is the first thing i should do if i want to find new companies to invest\nin? I was lucky in finding a small cap company a few months back and made a\nprofit from selling its shares recently because it turned out great but now i\ncan't seem to do it again. How should i go about finding these…",
  "data/reddit-stocks/r/stocks/comments/pxvwyy/ggpi_ev_company_backed_by_leonardo_dicaprio_with.json": "GGPI is bringing Polestar public, which is a Swedish electric vehicle company\nthat has ACTUAL REVENUE from vehicle sales worldwide! They have delivered well\nover 20,000 vehicles so far, and they are projected to have a revenue of $1.6B\nthis year.\n\nHere you can see some sales data from Europe, not…",
  "data/reddit-stocks/r/stocks/comments/pxyrnh/wtf_is_going_on_with_the_market.json": "Everything I own is nosediving. I've never been a panic seller but Holy crap am\nI starting to panic. I'm already at a huge loss and I've run into some bad\nfinancial luck so I'm just struggling all around. Any advice?",
  "data/reddit-stocks/r/stocks/comments/py3szk/here_is_a_market_recap_for_today_wednesday_sept.json": "PsychoMarket Recap - Wednesday, September 29, 2021\n\nAfter suffering one of the worst days all year yesterday, stocks stabilized\ntoday, with the three major indexes trading modestly green as Treasury yields\npulled back from multi-month highs. Lots of dynamics affecting the market right,\nwith market…",
  "data/reddit-stocks/r/stocks/comments/py4c2f/pltr_has_won_a_2_year_contract_worth_58_mil.json": "Here is the link:\nhttps://www.fpds.gov/ezsearch/search.do?q=Palantir&s=FPDS.GOV&templateName=1.5.2&indexName=awardfull&sortBy=SIGNED_DATE&desc=Y\nClick \"view\" on the first contract to learn more about the deal. Total value is\n58 million.\n\nAfter winning contracts with a total deal value over 900…",
  "data/reddit-stocks/r/stocks/comments/py5pig/it_looks_like_a_gov_shutdown_is_a_real_possibility.json": "McConnell stopping democrats latest attempts to raise the debt ceiling again\nmeans the democrats would have to go through reconciliation which is a long and\ndifficult process. I do not believe their is any other way they can move\nforward. If anyone knows a alternative route u believe the democrats…",
  "data/reddit-stocks/r/stocks/comments/py6tlt/this_will_be_the_roaring_20s_of_the_21st_century.json": "Much like the 1920s, this current decade was preceded by a global short term\nrecession (WWI 1914-1918) and will follow with the one of the greatest periods\nof prosperity and economic growth this century.\n\nThe convergence of various forms of technological innovation (AI, Big Data, Edge\nComputing,…",
  "data/reddit-stocks/r/stocks/comments/py8asi/ford_to_lead_americas_shift_to_electric_vehicles.json": " * Ford to bring electric zero-emission vehicles at scale to American customers\n   with the largest, most advanced, most efficient auto production complex in\n   its 118-year history\n * Called Blue Oval City, the complex will be constructed on a nearly\n   6-square-mile site in west Tennessee and…",
  "data/reddit-stocks/r/stocks/comments/pyfu9h/remember_what_investing_is_all_about.json": "Good day fellow investors (many will probably recognize this phrase!),\n\nBecause I've stumbled across several posts in this subreddit worrying about all\nthe macroeconomic noise and distractions going on right now, I just wanted to\nquickly remind you all what true investing - not trading - is all…",
  "data/reddit-stocks/r/stocks/comments/pyitxc/now_is_a_great_time_to_buy_dividend_stocks.json": "Title basically sums it up. Honestly feel like now is a great time to buy\ndividend stocks. They tend to be more stable, many have raised their dividend\namount every year, and right now some are on discount (Target, looking at\nyou!!). So basically good for both diversification/portfolio stability…",
  "data/reddit-stocks/r/stocks/comments/pyj4s0/heres_your_daily_market_brief_for_september_30th.json": "Top News\n\n * S&P 500 Futures are +.41%; Dow Futures are +.38%; NASDAQ Futures are +.53%\n * US stock futures move slightly higher after the Senate agreed on a deal to\n   avoid a government shutdown. Initial jobless claims rose higher than expected\n   indicating that, despite a recovering economy, US…",
  "data/reddit-stocks/r/stocks/comments/pyjqvl/us_economy_grew_revised_67_in_second_quarter_gdp.json": "The U.S. economy grew at a 6.7% annual pace in the second quarter, revised\ngovernment figures show, as the U.S. got a big jolt in the spring from\ngovernment stimulus payments and coronavirus vaccines allowed businesses to\nreopen. The government’s third estimate of gross domestic product for…",
  "data/reddit-stocks/r/stocks/comments/pykt1r/what_are_the_implications_of_evergrand_missing.json": "which canbe the implications of evergrande missing second off shore payment?\nWon't this cause a domino effect since they have a 20 billions debt with foreign\ninvestors?With liabilities of $305 billion, Evergrande has sparked concerns its\nwoes could spread through China's financial system and…",
  "data/reddit-stocks/r/stocks/comments/pyp0fa/reverse_repo_hits_staggering_16t_breaking_records.json": "The daily reverse repo hit 1T about two months ago or so, and since then it has\ncontinued to go up and up and up. It's surpassed 1.5T and looks like it's on the\nway to 2T. For some context, starting this week, the repo amounts are:\n\n09/27 - 1.29T\n\n09/28 - 1.37T\n\n09/29 - 1.41T\n\n09/30 - 1.6T\n\nWhat is…",
  "data/reddit-stocks/r/stocks/comments/pyrq54/psycho_market_recap_thursday_sept_30.json": "Stocks finished lower in a whipsaw session that saw equities plummet near the\nmiddle of the session before somewhat recovering and then selling off to close\nthe end of the day. Market participants continue to anxiously wait for any\ndevelopments out of Washington DC and monitor the Treasury yield.…",
  "data/reddit-stocks/r/wallstreetbets/comments/pfgew5/am_i_the_asshole_for_dropping_my_6_year_old_off.json": "This started about 4 years ago when my son was 2 years old. I started to\nsupplement his picture books and cartoons with beginner options books and Martin\nShkerli's live videos on how to pick pharmaceutical stocks. Over the course of\nthese years I feel like he has retained absolutely nothing even…",
  "data/reddit-stocks/r/wallstreetbets/comments/pg6ooh/gme_volume_does_this_seem_extremely_bullish_to.json": "Hello retards,\n\nI've been watching $GME like a hawk all week and the correlation between volume\nand price for the past week is incredible and to me seems very, very bullish.\nCheck it out:\n\nAugust 26th at open: Spikes on high volume (889k shares in first hour, goes up\n$10). It waffles for a bit as…",
  "data/reddit-stocks/r/wallstreetbets/comments/pg78fg/am_i_the_asshole_for_not_being_able_to_trade.json": "This started about 4 years ago when I was 2 years old. My dad started to\nsupplement me picture books and cartoons with beginner options books and Martin\nShkerli's live videos on how to pick pharmaceutical stocks. Over the course of\nthese years I have retained absolutely nothing even though my dad…",
  "data/reddit-stocks/r/wallstreetbets/comments/pg9jpn/why_doesnt_everyone_only_trade_options_0_dte_spy.json": "I have been avidly learning the great minds of WallStreetBets and have gained\nextensive knowledge on investing, risk management, and portfolio growth. WSB has\nintroduced me to the great world of options, and it has completely changed my\nlife.\n\nPre-WSB I am ashamed to admit… but I used to be a……",
  "data/reddit-stocks/r/wallstreetbets/comments/pgp0gh/rklb_literally_going_to_to_moon.json": "Here’s my attempt at a DD into Rocketlab and why I’m incredibly bullish on it.\nI’m not a financial advisor. I’m just a smooth brained ape that likes seeing\nflamey sticks go up high in the sky.\n\n• Rocketlab is literally the only main competitor to Elon’s Space X, currently\nvalued well over 15x RKLB’s…",
  "data/reddit-stocks/r/wallstreetbets/comments/pgv4bi/a_lab_of_rockets_supplement_to_prior_dd_on_rklb.json": "This is an unplanned supplement to my prior DD on the eve of Rocket Lab’s\nde-spac.\n\nI had dozens of comments listing key points/catalysts that I had initially\nmissed, because I was keen on being the first to post a legal DD about rocket\nlab (SPACs aren’t allowed so when I first posted it months ago,…",
  "data/reddit-stocks/r/wallstreetbets/comments/pihw7g/why_do_you_autists_like_clov.json": "So I’ve noticed a ton of you crayon eating degenerates posting CLOV yolo’s and\npositions. I understand a majority of this sub has learning disabilities but I\nstill can’t wrap my head around why you guys like this stock. Their financials\nare pretty terrible, their product is pretty bad and other than…",
  "data/reddit-stocks/r/wallstreetbets/comments/pja7lf/this_clov_shit_on_wsb_is_garbage.json": "Alright, just in case it wasn’t made clear there’s obviously something mad\nsketchy regarding the CLOV interest on WSB.\n\nI was one of the guys who called out the CLOV squeeze a while back. I think CLOV\ndefinitely has potential in the future. But what the hell is up with these\nposts.\n\nThere’s…",
  "data/reddit-stocks/r/wallstreetbets/comments/pjltuu/so_i_talked_to_my_wife.json": "So after asking you guys for advice on my virginity problem (My wife does not\nhave sex with me), the suggestion that stood out most was the question \"Have you\nasked your wife's boyfriend?\". I was very confused about this. Why would she\nhave a boyfriend? We are married after all?\n\nBut because I have…",
  "data/reddit-stocks/r/wallstreetbets/comments/pki7fp/gme_gamestop_reports_financial_results_for_q2_2021.json": "SECOND QUARTER OVERVIEW\n\n * Generated net sales of $1.183 billion, compared to $942 million in the prior\n   year’s second quarter.\n\n * Ended the period with cash and restricted cash of $1.78 billion.\n\n * Ended the period with no long-term debt, other than a $47.5 million\n   low-interest loan…",
  "data/reddit-stocks/r/wallstreetbets/comments/pkpb3t/there_is_no_wallstreetbets_nft_beware_ongoing_scam.json": "An NFT project is currently stealing our logo and selling it to people. If you\nknow anyone who might buy it or are confused yourself, no, it's not official.\nIt's a cash grab by some random losers. If we were to ever do something similar\nthey'd be rendered worthless.\n\nThis is what happens when social…",
  "data/reddit-stocks/r/wallstreetbets/comments/pl4i1v/i_developed_an_options_strategy_that_will_make_me.json": "While I haven’t figured out how JPow keeps blessing us with his magic printed\nmoney, I have discovered the NEXT BEST THING.\n\nQYLD is an options based covered call ETF. QYLD is an ETF that follows QQQ and\nsells covered calls on it. Every month you get about a 1% monthly payout, and\nfor those of you…",
  "data/reddit-stocks/r/wallstreetbets/comments/pl5jl4/gamestop_the_rocky_balboa_of_the_stock_market.json": "Once again GameStop ($GME) has proven time and time again that no matter how\nmuch it gets knocked down it just keeps getting back up for more gains.\n\nGameStop released its earnings this quarter and failed to provide outlook for\ninvestors and as a result the stock dipped more then 10.5% at the…",
  "data/reddit-stocks/r/wallstreetbets/comments/plb2ye/microvision_booth_tour_at_iaa_2021_munich_meeting.json": "I travelled specifically from Vancouver, BC, Canada to Munich, Germany to meet\nthe MVIS CEO and to see their new Lidar in person...\n\nThe IAA has been open for the last 4 days, but I hadn’t been able to properly\nexperience the MicroVision booth until now. I didn’t want to distract Sumit\nSharma, Dr.…",
  "data/reddit-stocks/r/wallstreetbets/comments/pml2zl/wife_is_shaming_me_for_not_making_enough_gains.json": "This just happened yesterday, I’m not sure how to feel about it. I’ve been\npretty involved in retarded trading schemes for a few years now and she sees me\nconstantly reading Reddit posts and following Twitter traders.\n\nYesterday she says to me: “What is your Total percent gain from what you’ve…",
  "data/reddit-stocks/r/wallstreetbets/comments/pnelsm/its_a_lot_worse_than_you_think.json": "Most people are just hiding from the truth\n\nThe market has literally been fucking shooting upwards like we’ve never seen\nbefore without any healthy correction. We’ve created so much money out of thin\nfucking air it’s ridiculous. The amount of Money we’ve created in the past year\nrelative to total…",
  "data/reddit-stocks/r/wallstreetbets/comments/pnff3b/irnt_gamma_squeeze_with_213_of_float_claimed_by.json": "I've been following $IRNT since the post market jump when it went from $16 to\n$40 in AH. It had seemingly been written off despite the fact that it's been\nprimed for a gamma squeeze at almost every moment since it came down from that\nrun to $40. To be clear, this is a real gamma squeeze, not a meme…",
  "data/reddit-stocks/r/wallstreetbets/comments/pnthou/literally_stfu_about_the_socalled_alleged.json": "WTF is wrong with you? Do you not know what the efficient markets hypothesis is?\nDelete your portfolio, nephew.\n\nMarket crashes are supposed to be catastrophic. Shocking. UNEXPECTED.\n\nIf it is expected, it is already priced in.\n\nThe meth-ed out cashier at my local McDonalds has known that tapering…",
  "data/reddit-stocks/r/wallstreetbets/comments/pnyso1/the_sprott_uranium_fund_is_a_self_reinforcing.json": "There have been several great posts talking about the uranium situation\nrecently, like this one\n[https://www.reddit.com/r/wallstreetbets/comments/ocxe91/the_uranium_thesis_have_your_cake_but_dont_eat_it/?utm_source=share&amp;amp;utm_medium=ios_app&amp;amp;utm_name=iossmf].\n\nBut while several posts…",
  "data/reddit-stocks/r/wallstreetbets/comments/pobzn6/update_irnt_gamma_squeeze_with_273_of_float.json": "Hello there,\n\nPrevious DD post is here\n[https://www.reddit.com/r/wallstreetbets/comments/pnff3b/irnt_gamma_squeeze_with_213_of_float_claimed_by/]\n\nI wanted to provide an update on the gamma squeeze in $IRNT that I've been\nfollowing heading into Wednesday and some final thoughts before it…",
  "data/reddit-stocks/r/wallstreetbets/comments/poqtzg/opad_dark_horse_gamma_squeezeshort_squeeze.json": "TL;DR - stock with gamma squeeze potential and 157% short interest of float gets\nmy dick hard. If OPAD reaches $16 market makers will need to hedge nearly 100%\nof float--and stock already reached $16 last Thursday. Market makers & short\nsellers fucked.\n\nEdit: I explained more about the low float in…",
  "data/reddit-stocks/r/wallstreetbets/comments/pou37i/tmc_stock_is_gonna_explode.json": "TMC (The Metals Company) is a recent \"de-SPA C\" that started trading on Friday.\nIt's a deep seas mining company with a market cap of $2.35 billion with 245\nmillion shares outstanding (current price in the $9 - $10 range).\n\nThe key here though is that 231 million shares are locked up at least 6…",
  "data/reddit-stocks/r/wallstreetbets/comments/pov2c8/asts_final_part_universal_4k_porn_streamed_from.json": "I'm not a financial advisor, nor am I giving any financial advise. This is an\nentertainment/comedy-nonfactual post. I'm a retard posting on WSB with a bias\ndue to having a position of my portfolio in $ASTS. So, Don't act on anything\nposted in here and proceed on your own risk...\n\nThis DD contains 10…",
  "data/reddit-stocks/r/wallstreetbets/comments/pp0nhe/update_2_irnt_gamma_squeeze_with_479_of_float.json": "Hello there,\n\nLast post here\n[https://www.reddit.com/r/wallstreetbets/comments/pobzn6/update_irnt_gamma_squeeze_with_273_of_float/hczwo2g/?context=3]\n\nI wanted to give an update on the gamma squeeze I've been following on $IRNT.\n\nQuick comment on the 13D filing. This was expected (for a change, lol)…",
  "data/reddit-stocks/r/wallstreetbets/comments/pp1obi/beke_yang_noah_big_profits_off_the_collapse_of.json": "TLDR; China’s biggest real estate developer and firm Evergrande has $350B of\nliabilities and debt and is about to cross default and possibly blow up. This\nwould slash China’s GDP, housing market, and various sectors across the country,\nmaking for a big economic depression. Even if it doesn’t, there…",
  "data/reddit-stocks/r/wallstreetbets/comments/ppj6pt/asts_porn_play_with_gamma_squeeze_potentialshort.json": "I'm not a financial advisor, nor am I giving any financial advise. This is an\nentertainment/comedy-nonfactual post. I'm a retard posting on WSB with a bias\ndue to having a position of my portfolio in $ASTS. So, Don't act on anything\nposted in here and proceed on your own risk...\n\nGood…",
  "data/reddit-stocks/r/wallstreetbets/comments/ppmd1n/tmc_the_nuclear_thesis_that_will_give_you_an.json": "TMC could be a nuclear bomb. There are a total of 224 million shares outstanding\nbut only 2.7 million of them are publicly traded right now.\n\nSource: https://ibb.co/376Sv7J\n\nFull Document:\n\nhttps://sec.report/Document/0001213900-21-048261/\n\nThat’s straight from the SEC website and dated 9/15. That…",
  "data/reddit-stocks/r/wallstreetbets/comments/ppo5hq/chill_the_fuck_out_and_read_this_irnt_opad.json": "Fellow Degens,\n\nChill the fuck out and read.\n\nThe unique situation of $IRNT and $OPAD, is exactly that, extremely unique.\n\nLet me summarize:\n\nStock Redemption: Redemptions are when a company requires shareholders to sell a\nportion of their shares back to the company. For a company to redeem shares,…",
  "data/reddit-stocks/r/wallstreetbets/comments/pppjzl/sdc_mm_hedging_constrained_breakout.json": "Hello,\n\nThis is round two with some helpful suggestions from the mods to avoid any\ntinfoil hats. So we've all heard of SDC and all have various opinions of why\nit's a great/mediocre/awful company. I think it's a good company and I am\nbullish, but for this post's purpose, this is unnecessary.\n\nThere…",
  "data/reddit-stocks/r/wallstreetbets/comments/ppzmeo/asts_gamma_squeeze_fact_or_fiction_plus_6mm_yolo.json": "There has been a lot of talk about a so-called gamma squeeze in $ASTS. Let’s\nunpack these crazy claims by people who write about 4K porn, Interstellar\ntravel, Lord of the Rings, and other things. We’ll find out soon enough what\nhappens. At least we can have a teachable moment?\n\nWHAT’S A GAMMA…",
  "data/reddit-stocks/r/wallstreetbets/comments/pq0aiy/gme_is_about_to_fuk_u_with_its_negative_beta.json": "Greetings to the most intelligent people on the planet!\n\nI've been playing with GME and the other charts recently, and it all accumulated\ninto a massive piece of delicious TA, which I didn't really plan to post to WSB\noriginally - because I felt like some of the honorable WSB residents might be…",
  "data/reddit-stocks/r/wallstreetbets/comments/pq11lv/update_today_asts_porn_play_has_an_extremely_high.json": "I'm not a financial advisor, nor am I giving any financial advise. This is an\nentertainment/comedy-nonfactual post. I'm a retard posting on WSB with a bias\ndue to having a position of my portfolio in $ASTS. So, Don't act on anything\nposted in here and proceed on your own risk...\n\nyesterday's part 1:…",
  "data/reddit-stocks/r/wallstreetbets/comments/pqafty/sdc_dehedging_the_tiny_float.json": "Are we done?\n\nNo, of course not.\n\nDidn't have time earlier, but wanted to explain how shorts are actively\nattacking your options positions and in doing so leave themselves open to future\nregulations.\n\nPost summary (tldr)\n\n- Dehedge backfire: Shorts attempting to knock price below strikes are…",
  "data/reddit-stocks/r/wallstreetbets/comments/pqg7o7/michael_burry_confirms_china_collapse_incoming_12t.json": "It’s all a scam folks. Tether will be left holding the bag along with BlackRock\nUBS Pimco and God knows who else. The largest Ponzi scheme in human history is\nabout to fold. A $12 Trillion credit market based on empty dilapidated apartment\nbuildings. We all knew this was coming, and if you don’t…",
  "data/reddit-stocks/r/wallstreetbets/comments/pqmhbk/when_did_wsb_go_from_due_diligence_on_good.json": "I remember the good old days of WSB when we memeified good companies with solid\ngrowth potential like TSLA, PLTR… That way even if you get burnt on the run up,\nbag holders would still be able to recover over time.\n\nNow the community feels like a giant P&D. Where every other day there’s a new\nticker…",
  "data/reddit-stocks/r/wallstreetbets/comments/prcdnr/why_you_suck_ass_at_gamma_squeezing_and_what_you.json": "I. Intro\n\nHello degenerates! Not financial advice, I am a retarded degenerate too.\n\nTMC, OPAD, and IRNT were supposed to go to the fucking moon, right? Why the hell\ndidn’t they? Because you have an obsession with OTM call options.\n\nFirst off, answer this question for me: Which call option strikes…",
  "data/reddit-stocks/r/wallstreetbets/comments/prqtr6/china_is_fucked_so_lets_make_money_ashr_ewh_mchi.json": "THE BLACK SWAN COMETH\n\nEarlier this month, a black swan flew into the plaza of Tiananmen Square,\nstirring speculation on what this would symbolically mean. China has already had\na rough last couple of months; dealing with floods, typhoons, hailstorms,\nsandstorms, landslides, and a pandemic to boot.…",
  "data/reddit-stocks/r/wallstreetbets/comments/prx4qw/asts_how_douchebag_hedge_fund_bros_will_value_ast.json": "Douchebag Hedge Fund Analysts = Your Path to Tendies!\n\n * I'm going to provide a brief overview of how a douchebag hedge fund analyst\n   and his peers will quickly analyze $ASTS after missing out on $10-$20 of\n   upside as the stock likely ramps heading into March 2022 launch of\n   BlueWalker-3\n   *…",
  "data/reddit-stocks/r/wallstreetbets/comments/ps3uht/markets_will_continue_to_drop_until_october_2nd.json": "The NPS is blatantly manipulating the market and giving cryptic clues as to why\nthey are doing this and when they will stop. Just look at this tweet\n[https://twitter.com/KatmaiNPS/status/1439635649771065352] from Katmai National\nPark yesterday. This is clearly a warning, possibly from agents gone…",
  "data/reddit-stocks/r/wallstreetbets/comments/ps8h0u/we_have_already_bottomed_out_today_was_not_the.json": "Good evening fellow retards. Sit down, listen up and calm your tits about what\nhappened today. Believe me, I woke up today and was not fucking happy. Thoughts\ncrossed my mind “why did I buy calls Friday?” “Why the fuck didn’t I buy spy\nputs?” But the past is the past and here we are.\n\nWhat happened…",
  "data/reddit-stocks/r/wallstreetbets/comments/pt7jzp/the_rise_of_canoo_goev_why_jpows_printer_bidens.json": "Gather around folks, hope y’all made some gains the last time around. This DD is\nsplit into 8 parts, so feel free to jump to whichever section you’re most\ninterested in.\n\nPart 1 – Introduction\n\nPart 2 – Market Trends and Upcoming Catalysts\n\nPart 3 – Company Overview and Unique Value…",
  "data/reddit-stocks/r/wallstreetbets/comments/ptidr0/bb_blackberry_unleash_the_beast_post_earning.json": "My fellow APES, here is my post earnings analysis for $BB BlackBerry. It's time\nto wake up the Sleeping Giant and UNLEASH THE BEAST!!! ✊\n\nThis opportunity is like buying $AMD sub $2 before SU BAE took the stock to\n$100! 😍\n\n--------------\n\nEarning Results: (Beat on top line + Beat on the bottom line…",
  "data/reddit-stocks/r/wallstreetbets/comments/pttqnc/goev_crayon_marking_breakout.json": "Alright yeh lovely apes, got a chart here of $GOEV - Canoo, and it looks like\nits been battered and shorted like crazy since December. For reference:\n\nhttps://preview.redd.it/p9e3xj4hs8p71.png?width=3186&format=png&auto=webp&s=1143d6206ff0735785087df9b84dd35cfab21ece\n\nSee that blue line over there?…",
  "data/reddit-stocks/r/wallstreetbets/comments/ptvbbb/goev_an_ev_bangbus_on_a_highway_to_tendie_town.json": "Yesterday, I've stumbled upon the longest DD\n[https://www.reddit.com/r/wallstreetbets/comments/pt7jzp/the_rise_of_canoo_goev_why_jpows_printer_bidens/]\nI've ever seen on WSB. He's a $GOEV bag holder who really believes in it. NGL,\nHe sold me, I'm in short term.\n\nTL;DR - DeSpac, HEAVY SHORT INTEREST,…",
  "data/reddit-stocks/r/wallstreetbets/comments/pumnrg/i_got_a_job_in_a_hedge_fund_to_see_wall_street.json": "So after all the drama with hedge funds over the last eight months or so, I\nthought to myself it would be really interesting to see what working for a hedge\nfund was actually like.\n\nSo I applied for a job at one of the big ones. I got the job right away, which\nwas kinda suprising given my…",
  "data/reddit-stocks/r/wallstreetbets/comments/pvry6d/an_easy_way_for_everyone_to_make_money.json": "Guys, I have come up with a plan we can all follow and we will all be rich.\n\nFirst, we all make new Spotify accounts and do not upgrade to premium, so we\nwill get ads. Then, we change the settings on our computers to never fall asleep\nwhile we leave Spotify running random music 24/7 (probably with…",
  "data/reddit-stocks/r/wallstreetbets/comments/pwh2c1/laur_get_rich_from_this_43_special_dividend.json": "What’s up Retards, here's another special dividend play for a special boy!\n\nDon’t you HATE how your wife’s boyfriend locks you in the closet during sexy\ntime? Don’t you wish that you could FIRE him and have your wife ALL to yourself?\n\nWell… After $LAUR you will be SO RICH that you can fire him and…",
  "data/reddit-stocks/r/wallstreetbets/comments/pwm5vb/why_im_expecting_a_big_week_for_gme.json": "TLDR:\n\nSimplex Trading LLC is the last remaining financial entity listed in the\nBloomberg Terminal’s list of PUTs for GME maintaining a file date for their\npositions of 3/31/2021. They also hold the largest number of PUTs (80,702\ncontracts), twice as many as second in line Susquehanna, and are the…",
  "data/reddit-stocks/r/wallstreetbets/comments/py5y01/upcoming_market_crash_for_october_1st.json": "Evergrande did not receive it's foreign bond interest payments yesterday, the\ndebt ceiling being raised got shut down in senate, and banks have to have 1\ntrillion dollars in liquidity on the 1st\n\nWhy is this not being talked about? DRS is a really good thing, but an upcoming\ncatalyst for gme to moon…"
}