{
  "data/reddit-stocks/r/stocks/comments/shhjkj/blackberry_agrees_to_sell_legacy_patents_for_600m.json": "\"BlackBerry Limited (NYSE:BB, TSX:BB), announced today that it has entered into\na patent sale agreement with Catapult IP Innovations Inc., a Delaware company,\npursuant to which BlackBerry has agreed to sell substantially all of its\nnon-core patent assets to Catapult for total consideration of $600…",
  "data/reddit-stocks/r/investing/comments/shh0f3/contract_accepted_on_113_acres_of_land_in_texas.json": "I'd been looking for more than a year for 50+ acres I'd primarily use for\nrecreation/weekend getaway as well as a long term investment (land prices here\nhave been going nuts), including seasonal leases to other hunters (this land\noffers year-round hunting). I found it last weekend and I'm under…",
  "data/reddit-stocks/r/stocks/comments/shgqd4/block_formerly_square_starts_afterpay.json": "https://www.businesswire.com/news/home/20220131005811/en/Block-Inc.-Completes-Acquisition-of-Afterpay\n\nBlock, Inc. (NYSE: SQ) and Afterpay Limited today announced the successful\ncompletion of the Scheme of Arrangement under which Block has acquired all of\nthe issued shares in Afterpay. This…",
  "data/reddit-stocks/r/stocks/comments/shjxtn/is_it_a_good_time_to_get_into_stocks.json": "I’m 21 yo and I’m looking to get into stocks. I’ve been reading a bit about how\nthe market is currently in a terrible state, does this make it a good time to\nbuy? I’m looking at long term investment so I’m not too concerned about how\nvolatile the market currently is",
  "data/reddit-stocks/r/investing/comments/shk5wg/peter_lynch_the_ultimate_guide_to_stock_market.json": "I found this gem on YouTube and wanted to share with you. A refresher for new\nbeginners to seasoned investors alike, this more than 20 year old video from\nPeter Lynch is still 100% accurate today.\n\nIf you don’t know who Peter Lynch is, he was a fund manager at Fidelity. He\nmanaged the Magellan fund…",
  "data/reddit-stocks/r/Bogleheads/comments/shnc0i/timing_the_market_can_result_in_missing_the_best.json": "Yesterday was undoubtedly the best day for stocks YTD. How much an effect\nmissing best days like this can have on your portfolio?\n\n\"Quantitative Analysis of Investor Behavior,\" shows that an investor who\nremained fully invested in the Standard & Poor’s (S&P) 500…",
  "data/reddit-stocks/r/stocks/comments/shpngj/us_lawmakers_traded_an_estimated_355_million_of.json": "Congress resembled a Wall Street trading desk last year, with lawmakers making\nan estimated total of $355 million worth of stock trades, buying and selling\nshares of companies based in the U.S. and around the world. At least 113\nlawmakers have disclosed stock transactions that were made in 2021 by…",
  "data/reddit-stocks/r/wallstreetbets/comments/shlsh6/401k_infinite_money_glitch.json": "So I have $5000 in my 401k through my employer. I’m allowed to borrow up to 50%\nof my own 401k. I also have a credit card with a limit of $2k and a rewards of\n1.5%. I think I can keep taking loans against my 401k and paying it back with my\ncredit card. And then I can use my loan to pay off the debt…",
  "data/reddit-stocks/r/wallstreetbets/comments/shrexz/anyone_basing_trades_on_technical_analysis_right.json": "So many arrogant fucks here love talking technical analysis when they can't even\ndo basic fraction arithmetic much less understand Ito Calculus. Fucking clowns,\nall of them.\n\nShut the fuck up and do your trades. If you really need a number you can't even\nderive to tell you whether you should buy a…",
  "data/reddit-stocks/r/stocks/comments/shqdwc/im_very_worried_about_the_technological.json": "I have a hard time investing in certain companies because I don't feel right\nsupporting the dystopian world that's upon us in the coming decades. I fear we\nare beginning the era where Ray Bradbury's novels start coming true. Algorithmic\nsocial credit scores, designer babies, government mandated…",
  "data/reddit-stocks/r/Bogleheads/comments/shxhg2/keep_contributing_to_my_retirement_why_bother.json": "A have a little over $1,000,000 in my IRA, I am 49.5 and plan to retire at\n57.5-59.5.\n\nMy goal is to retire in 8-10 years with $2 million.\n\nIf I contribute the $7,000 max per year to my IRA, I will have an ending balance\nthat is about $80,000 higher than if I contribute nothing.\n\nBut $56,000 of…",
  "data/reddit-stocks/r/stocks/comments/shvaz6/att_to_slash_dividend_from_208_to_111_after.json": "AT&T Inc. T 1.15% said it would roughly halve its dividend payout and divest its\nWarnerMedia division through a spinoff that will give shareholders 0.24 shares\nfor each AT&T share they own.\n\nThe company is picking a simpler method to complete its planned deal with\nDiscovery Inc. DISCB -3.47% that…",
  "data/reddit-stocks/r/stocks/comments/shv4xk/upping_my_stake_in_intcis_this_a_bad_move_my.json": "Below is some of the \"research\" and thoughts I've put together regarding INTC.\nWould love to get a sanity check.\n\nI've been long INTC for a few months now. The recent drop has given me pause,\nbut ultimately, I'm thinking about upping my stake from a little less than 1% of\nmy actively managed…",
  "data/reddit-stocks/r/stocks/comments/shlth3/how_to_track_congressmen_stock_activities.json": "Today in news they were discussing how congressmen made money in stocks just\nbecause they knew what deals or projects are gonna be approved and who is gonna\nget that. They simply go and invest in those companies and made huge bucks. They\nalso mentioned some normal people made money just following…",
  "data/reddit-stocks/r/stocks/comments/si2536/tesla_recall_full_selfdriving_software_runs_stop.json": "https://apnews.com/article/tesla-recall-full-self-driving-software-e23d252ac5164cb0e7af776625b15180\n\nDETROIT (AP) — Tesla is recalling nearly 54,000 cars and SUVs because their\n“Full Self-Driving” software lets them roll through stop signs without coming to\na complete halt.\n\nRecall documents posted…",
  "data/reddit-stocks/r/wallstreetbets/comments/si24e9/which_one_of_you_lost_400k_this_year_shrugged_it.json": "Because you are challenged in the best possible way and you warmed my heart\ntoday.\n\n✅\"When you got some extra money where it's almost like burning a hole in your\npocket, you get fifty grand worth of [options],\" says Adams. \"You're like, 'f***\nit,' I'll buy a thousand shares of this.\"\n\n✅ He's lost…",
  "data/reddit-stocks/r/stocks/comments/si2ui6/fiverr_fvrr_greedy_and_overvalued_platform_value.json": "Fiverr was one of the companies with a lot of volatility in the last 2 years.\nThe share price went from $20 in March 2020, to $336 in February 2021 and now is\n75% down from its all-time high to $85.\n\nSo, I decided to analyze and value the company and figure out how it makes\nmoney, how it performed…",
  "data/reddit-stocks/r/investing/comments/si5a51/fidelity_has_just_released_a_paper_about_bitcoin.json": "Why Investors Need to Consider Bitcoin Separately From Other Digital Assets\n\nhttps://www.fidelitydigitalassets.com/articles/bitcoin-first\n\nOnce investors have decided to invest in digital assets, the next question\nbecomes, \"Which one?\" Of course, bitcoin is the most recognized, first-ever\ndigital…",
  "data/reddit-stocks/r/stocks/comments/si5wnn/amd_crushes_earnings.json": "AMD, one of Reddit's favorite company absolutely crushed it's earnings.\n\nQ4 revenue of $4.83B beats  $4.52B consensus.\n\nGAAP EPS of $0.80 beats a $0.70 consensus.\n\nNon-GAAP EPS of $0.92 beats a $0.76 consensus.\n\nAMD guides for Q1 revenue of $5B, +/- $100M. That's above a $4.35B consensus.\n\nThe…",
  "data/reddit-stocks/r/stocks/comments/si5t88/alphabet_reports_big_beat_on_earnings_and_revenue.json": "https://www.cnbc.com/2022/02/01/alphabet-googl-q4-2021-earnings.html\n\nEarnings per share (EPS): $30.69 vs $27.34 expected, according to Refinitiv\n\nRevenue: $75.33 billion vs $72.17 billion expected, according to Refinitiv\n\nWall Street is also watching other key numbers in the Alphabet…",
  "data/reddit-stocks/r/stocks/comments/si2agp/your_most_confident_positions_under_100b_valuation.json": "Because of the recent bloodbaths of small-medium growth companies, I think it is\nrelevant to talk about some of them and which ones you think stick out as\ncompanies with more long term potential than others\n\nI can start out with my biggest positions being Cloudflare $NET and Unity $U. In\nshort, I…",
  "data/reddit-stocks/r/stocks/comments/si67eo/google_announces_201_stock_split_2750_13750.json": "Google parent Alphabet announced plans for a 20-for-1 stock split on Tuesday as\npart of the technology company's quarterly earnings statement.\n\nThe move comes a year and a half after Apple said it would split its stock.\n\nAlphabet intends to split the Class A, Class B and Class shares of the…",
  "data/reddit-stocks/r/Bogleheads/comments/si29my/thank_you_all_for_the_valuable_conversations_and.json": "I'm not sure about you all, but I really enjoy perusing this sub and reading\neverybody's thoughts and opinions on different scenarios. I have learned this\ncan be a very valuable tool in learning at my age (29) and will give me some\ngood insights in the future when my own precarious situations…",
  "data/reddit-stocks/r/stocks/comments/si68z2/paypal_shares_fall_more_than_11_on_weak_earnings.json": "PayPal shares fell more than 11% after hours on Tuesday after reporting mixed\nresults and Q1 guidance that fell below analyst estimates.\n\nHere are the key numbers:\n\nEarnings per share: $1.11 per share, ex-items vs. $1.12 per share expected,\naccording to a Refinitiv survey of analysts\n\nRevenue:…",
  "data/reddit-stocks/r/wallstreetbets/comments/shjud2/throwback_to_an_og_autist_who_under_the_radar.json": "It’s not a normal – or low risk – trading practice to amass a securities\nposition that’s nearly five times the total economic output of Cambodia… or 1.5\ntimes the market capitalization of the major global bank you’re working for.\nIt’s even less normal if the bank you’re working for has no clue…",
  "data/reddit-stocks/r/investing/comments/si6q2b/alphabet_caps_blockbuster_year_with_sales_gains.json": "Alphabet (GOOGL) reported Q4 earnings of $30.69 per share late Tuesday, up from\n$22.30 per share a year earlier.\n\nAnalysts surveyed by Capital IQ estimated $27.28 per share.\n\nRevenue for the quarter was $75.3 billion, up 32% from the year-earlier period.\n\nAnalysts surveyed by Capital IQ estimated…",
  "data/reddit-stocks/r/Bogleheads/comments/shyabb/but_why_is_diversification_a_free_lunch.json": "But why is diversification a free lunch?\n[https://www.engraved.blog/but-why-is-diversification-a-free-lunch/]\n\nThe above blog post is a nice introduction to the concept behind the phrase\n\"diversification is the only free lunch in investing\". This phrase is attributed\nto Nobel laureate economist…",
  "data/reddit-stocks/r/stocks/comments/shrv1h/rstocks_daily_discussion_technicals_tuesday_feb.json": "This is the daily discussion, so anything stocks related is fine, but the theme\nfor today is on technical analysis (TA), but if TA is not your thing then just\nignore the theme and/or post your arguments against TA…",
  "data/reddit-stocks/r/stocks/comments/si836s/thanks_for_the_lesson_paypal_stocks_go_down_for_a.json": "Here I am, a couple of weeks back and I see PayPal down 50%.\n\nGreat company I say.\n\nGuidance to double revenue by 2025 they say.\n\nHow foolish is the market for punishing this stock so much, I say.\n\nSo, I buy.\n\n\n\nComes out today with a 50% decline in EPS year-over-year, and a 20% drop in…",
  "data/reddit-stocks/r/wallstreetbets/comments/si90fb/congratulations_to_nancy_pelosi_who_bought_a_ton.json": "Congratulations to Nancy Pelosi who bought a ton of call options on Google at\nthe end of last year 🚀🚀🚀😎\n\n\n\nshe has continued her reign as the best stock picker of our generation! Some\nretards were arguing here earlier about Technical Analysis or Fundamental\nAnalysis, we can clearly see that…",
  "data/reddit-stocks/r/wallstreetbets/comments/si6c28/googl_to_4k_google_parent_alphabet_announces.json": "Google parent Alphabet announces 20-for-1 stock split\nhttps://www.cnbc.com/2022/02/01/google-parent-alphabet-announces-20-for-1-stock-split.html?__source=iosappshare%7Ccom.apple.UIKit.activity.CopyToPasteboard",
  "data/reddit-stocks/r/stocks/comments/shux7z/ftc_to_review_microsofts_687_bln_deal_for.json": "The U.S. antitrust review of Microsoft Corp’s proposed acquisition of Activision\nBlizzard Inc. will be handled by the Federal Trade Commission, according to a\nperson familiar with the matter, putting the deal in the hands of an agency that\nhas vowed more aggressive policing of deals.\n\nMicrosoft…",
  "data/reddit-stocks/r/wallstreetbets/comments/siec9q/you_bears_are_the_biggest_bitches_i_ever_met.json": "Only a couple of days ago you single digit IQ fucks were talking all kinds of\nhot shit in the daily thread. Saying how bulls are fucked and that SPY is going\nto keep drilling down even though SPY historically grinds higher during periods\nof higher rates.\n\nYou half wits honestly believed that growth…",
  "data/reddit-stocks/r/wallstreetbets/comments/sia44a/last_hurrah_before_turning_to_professional_help.json": "I need help figuring out what I should do about this tax liability predicament\nthat I find myself in. Let me take you on a journey of my bad personal decisions\nof the past 2 years. My first fuckup was discovering options in April of 2020,\nwhen stonks only went up. I put in hours to become…",
  "data/reddit-stocks/r/Bogleheads/comments/sifppu/asset_allocation_by_roger_gibson_book_summary.json": "ASSET ALLOCATION BY ROGER C GIBSON\n\n * Asset Allocation is not a new idea. The Talmud developed the first asset\n   allocation over 2,000 years ago.\n   * Let every man divide his money into three parts, and invest a third in\n     land, a third in business, and a third let him keep in reserve\n *…",
  "data/reddit-stocks/r/investing/comments/sibegj/russia_introduces_export_ban_on_ammonium_nitrate.json": "> MOSCOW, February 1. /TASS/. Russia imposed a ban on ammonium nitrate export\n> for two months, until April 2, the government’s press service said on Tuesday.\n> \n> \"The two-month ban on ammonium nitrate export comes into force from February\n> 2. The relevant decree of the government was signed,\"…",
  "data/reddit-stocks/r/investing/comments/si73vz/block_inc_formerly_square_completes_acquisition.json": "https://investors.block.xyz/news/news-details/2022/Block-Inc.-Completes-Acquisition-of-Afterpay/default.aspx\n\nBlock, Inc. (NYSE: SQ) and Afterpay Limited today announced the successful\ncompletion of the Scheme of Arrangement under which Block has acquired all of\nthe issued shares in Afterpay. This…",
  "data/reddit-stocks/r/Bogleheads/comments/siec6w/do_panickygreedy_investors_hurt_market_efficiency.json": "One of the fundamental assumptions of the bogleheads philosophy is that the\nmarket is efficient and market knows best. But the recent correction and\nwidespread panic selling has shown me that a lot of market participants\n(especially new investors like me) have no idea what they are doing. How can…",
  "data/reddit-stocks/r/stocks/comments/sif26q/i_truly_believe_googl_may_be_the_safest_long_term.json": "I only own 1.112 shares of GOOGL at cost basis $2350 currently and may add some\nmore soon.\n\nI can't believe that YouTube ad revenue for 1 quarter was over $8 billion! Holy\nshamoly!!\n\nAnd search generated $43 billion?!! Are you kidding me?! I assume that's one\nyear?\n\nAnyways is YouTube gonna go away…",
  "data/reddit-stocks/r/Bogleheads/comments/simblb/what_are_your_arguments_for_stock_market.json": "I'm very new to investing, as in less than a year spent in the stock market. I'm\n26, self employed as a general contractor (builder) and 10 years time served as\na plasterer. I have no private pensions or anything like that and the older I\nget the more I'm realising I have to put some sort of plan…",
  "data/reddit-stocks/r/Bogleheads/comments/si9976/treasurydirect_javascript_readonly_password_input.json": "Not sure if it's just me, but the TreasuryDirect page attempts to import\nhttps://www.treasurydirect.gov/js/rs/jquery-3.6.0.min.js which is returning 404\nand breaking the bypass script.\n\njavascript:(function(){$(\".pwordinput\").attr(\"readonly\",\"\")})()\n\n\nManually editing the page using developer tools…",
  "data/reddit-stocks/r/wallstreetbets/comments/si61xy/amd_crushes_earnings.json": "AMD, one of Reddit's favorite company absolutely crushed it's earnings.\n\nQ4 revenue of $4.83B beats  $4.52B consensus.\n\nGAAP EPS of $0.80 beats a $0.70 consensus.\n\nNon-GAAP EPS of $0.92 beats a $0.76 consensus.\n\nAMD guides for Q1 revenue of $5B, +/- $100M. That's above a $4.35B consensus.\n\nThe…",
  "data/reddit-stocks/r/wallstreetbets/comments/siaqee/infinite_money_glitch_really_works.json": "The other day I looked at my SPY January calls I bought on margin expire\nworthless. I realized I may need to get a little creative to make this money\nback. I did some research and discovered something called an hourly wage.\nApparently at Wendy’s (have to get approved for this) they will just pay…",
  "data/reddit-stocks/r/investing/comments/si7h3t/big_business_vs_small_business_googl_and_pypl.json": "It's absolutely astonishing looking at Google's earnings the last few quarters.\nTheir stock is up 8% after hours. Google has nearly doubled revenues since 2018;\n$258B in 2021 vs. $137B in 2018. They've somehow fended off antitrust regulation\nin the process.\n\nPayPal's stock is down 15% after…",
  "data/reddit-stocks/r/stocks/comments/siow8j/i_dont_understand_the_inflation_rate_the_prices.json": "Hello Everyone,\n\nI work with small/med business development and the production lines, materials,\noil are higher than what it’s been reported.\n\nMost businesses bought at a higher rate and try to keep their doors open, now a\nlot are struggling to keep their doors open.\n\nI don’t know how much…",
  "data/reddit-stocks/r/stocks/comments/sicpfj/do_you_think_google_will_react_like_apple_and.json": "Just a simple generic question. Apple was trading at $124 after the split then\nwent down to $100 before obviously taking off. Tesla traded around $442 right\nafter the split then dropped to $370. Both of these split in August of 2020. It\nseems like most companies see some kind of wild price movement…",
  "data/reddit-stocks/r/investing/comments/sih206/starbucks_earnings_call_raising_prices.json": "I listened to the sbux earnings call and they said they’re raising prices again\nfor a third time in several months. They raised it in October of 2021, January\nof 2022 and now they’re planning additional price increases across the board for\n2022. I get that they’re considered a premium coffee brand…",
  "data/reddit-stocks/r/wallstreetbets/comments/siom8e/exactly_two_months_to_the_day_that_jimmy_chill.json": "https://i.imgur.com/GtFdcel.jpeg\n\nPoor Cramer. Bet he's having a coke inducted meltdown right now.\n\nAlso, why the fuck are we limited to text posts only. using imgur is for fucking\nboomers. Are these fucking mods now boomers? Bet they'll be buying long ITM\nleaps on Exxon next, turds.",
  "data/reddit-stocks/r/Bogleheads/comments/si5yyt/vtsax_vtiax_balance.json": "Hey there Bogleheads. There's a lot of info about stock / bond balance and I got\nthat figured out (I'm young-ish still and a little more risk tolerant), but one\nthing I'm not clear on is balancing domestic (VTSAX) with international (VTIAX).\nAny preferred balance between the two and does that…",
  "data/reddit-stocks/r/stocks/comments/sik7pj/anyone_else_now_completely_fine_with_your.json": "Personally I was extremely tempted to buy some beaten down companies last week.\nSo close to pulling the trigger on GOOG at $2500 but that wouldn’t left be with\n0 cash so I held off, and saw my portfolio drop down more than 20%. Now this\nlittle rebound comes and I’m begging the market to go back…",
  "data/reddit-stocks/r/stocks/comments/siqvop/paypal_shares_plunge_as_bleak_forecast_stokes.json": "Shares of PayPal Holdings Inc slumped nearly 17%--make that 25%-- on Wednesday\nas investors questioned the company's growth prospects after it disclosed a big\nhit to revenue from the impending loss of marquee client eBay Inc.\n\nThe share slide set the stock up for its lowest opening since May 2020,…",
  "data/reddit-stocks/r/Bogleheads/comments/si8azm/retirement_account_fund_markups.json": "Can someone explain to me why retirement account vendors (401k/457/403b/etc)\nhave such outrageous markup on funds?\n\nVWELX’s expense ratio is 0.24%\n\nMy retirement vendor markups this same fund to 1.09%.\n\n**Why is this even allowed? **\n\nWhy can’t I buy my own Funds/ETFs directly from vanguard and get…",
  "data/reddit-stocks/r/investing/comments/siuz68/interest_rates_and_102_year_spread.json": "PGIM came out with this analysis\n[https://pgimfixedincome.blog/the-fed-throws-the-gauntlet/] last week which is\nvery interesting.\n\nThey are basically saying they dont expect the long end of the yield curve to go\nmuch higher than where it is.\n\nLooking at the spread…",
  "data/reddit-stocks/r/Bogleheads/comments/siscbv/maxing_retirement_what_now.json": "Im in my 20s. I maxed my retirement accounts and am not eligible for an HSA. I\nwant to invest more of my take home but im having a hard time finding info on\nthe best place/method. Do i just buy more vanguard stocks or ETFs on their site?\nTo start a “dividends portfolio”? What are investments where…",
  "data/reddit-stocks/r/stocks/comments/siv5fw/meetkevin_has_become_a_fud_channel.json": "It seems he intentionally tries to find and interview billionaires; hedge\nmanagers; etc who warn for upcoming doom. He has been doing so for the last half\nyear. Doesn't help that every of his thumbnail has that scared selfie face meme.\nI know he is popular but I am not watching him anymore and I…",
  "data/reddit-stocks/r/investing/comments/sizj1k/inverse_jim_cramer_etf_may_be_coming_soon.json": "From Eric Balchunas of Bloomberg:\n\n> Time May Be Ripe For An Inverse Cramer ETF:\n> One ETF that doesn't exist but maybe in the works is an inverse Cramer ETF,\n> which would hold positions opposite to those promoted by the CNBC host. Recent\n> calls on Netflix, AMC, and ARKK show the strategy could…",
  "data/reddit-stocks/r/stocks/comments/sizyir/metafacebook_stock_crashes_15_ah_after_earnings.json": "Facebook reported earnings after the bell. Here are the results.\n\nEarnings per share: $3.67 vs $3.84 expected, according to a Refinitiv survey of\nanalysts\n\nRevenue: $33.67 billion vs $33.4 billion expected, according to Refinitiv\n\nDaily Active Users (DAUs): 1.93B vs. 1.95 billion expected by…",
  "data/reddit-stocks/r/stocks/comments/siwpll/paypal_walks_back_its_2021_goal_of_750_million.json": "https://www.cnbc.com/2022/02/01/paypal-pypl-q4-2021-earnings.html\n\nhttps://www.marketwatch.com/story/paypal-targets-750-million-active-accounts-by-2025-double-what-it-has-now-11613063608\n\nPayPal said it expects to add 15 million to 20 million new accounts this year\nand walked back its goal of 750…",
  "data/reddit-stocks/r/stocks/comments/siz6i7/my_biggest_bags.json": "So I started investing a little over a year ago and unfortunately put most of my\nmoney into stuff reddit was talking about. Here’s what I’m down on 15+% on:\n\nUPST -59%\n\nMSOS -56%\n\nBYND -54%\n\nARKG -52%\n\nPLTR -51%\n\nPYPL -50%\n\nSQ -49%\n\nARKK -45%\n\nCRSR -44%\n\nARKF -43%\n\nICLN -31%\n\nDIS -22%\n\nSOFI …",
  "data/reddit-stocks/r/stocks/comments/sis8ba/paypal_stock_dives_toward_worst_day_on_record.json": "PayPal Holdings Inc.’s rough stretch continued Wednesday after the\npayment-technology company delivered an outlook that highlighted spending\npressures and brought a strategic change in the way the company will approach\nuser growth.\n\nShares PYPL, were off 24.6% in morning trading Wednesday and on…",
  "data/reddit-stocks/r/Bogleheads/comments/siykkf/i_told_my_friend_about_vtsax_and_vtiax_and_he.json": "My friend makes good money and said the returns that these funds make are not\nimpressive. Lmao\n\nBut says that his returns in crypto are what’s impressive and that is what I\nshould invest in. And individual stocks should be bought too. Hahaha\n\nThis guy thinks he’s smart because he’s in tech and…",
  "data/reddit-stocks/r/stocks/comments/sj0cbz/spotify_shares_plummet_15_after_releasing.json": "After a month of controversy involving podcast host Joe Rogan, Spotify\nTechnology SA disclosed a more immediate business problem: its growth in the\nfirst quarter of the year.\n\nThe company said it would end the first quarter with 418 million total users and\n183 million paid subscribers, shy of Wall…",
  "data/reddit-stocks/r/investing/comments/sj1pz8/meta_shares_plunge_20_as_facebook_owner_sees.json": "Article link:\nhttps://www.reuters.com/technology/facebook-owner-meta-forecasts-q1-revenue-below-estimates-2022-02-02/\n\nFeb 2 (Reuters) - Facebook owner Meta Platforms Inc (FB.O) shares plunged 20%\nlate on Wednesday as the social media company missed on Wall Street earnings\nestimates and posted a…",
  "data/reddit-stocks/r/wallstreetbets/comments/sj1pby/paging_mark_zuckerberg_we_know_youre_out_there.json": "Listen here Zuck, I’m pretty sure you just lost like $28,000,000,000. The\nInterwebs says you own roughly 400,000,000 shares (probably a bit less less,\ncause for some reason you’ve sold a lot over the last couple years). At a loss\nof $70/share post ER, I think we all deserve to see that epic loss…",
  "data/reddit-stocks/r/stocks/comments/siyk3j/starbucks_sbux_union_push_spreads_to_54_stores_in.json": "Bearish signal?\n\nhttps://www.npr.org/2022/01/31/1076978207/starbucks-union-push-spreads-to-54-stores-in-19-states\n\nStarbucks is facing a fast-growing union campaign just weeks after the first\nU.S. corporate store unionized in Buffalo, N.Y.\n\nEmployees at 54 stores in 19 states are pursuing union…",
  "data/reddit-stocks/r/investing/comments/siwsb5/ford_is_partnering_with_sunrun_to_allow_the_f150.json": "Here’s a link to the media release:\n\nhttps://media.ford.com/content/fordmedia/fna/us/en/news/2022/02/02/f-150-lightning-power-play.html\n\nHopeful to see this kind of innovation going forward. Interesting that they\nreleased this today, before earnings come out tomorrow. Take that for what it’s\nworth,…",
  "data/reddit-stocks/r/wallstreetbets/comments/sj0eho/zuckerberg_down_21_billion_in_after_hours.json": "Mark Zuckerberg has cashed in over $1 billion worth of Facebook stock so far\nthis year, according to data from 83 separate SEC filings. That's nearly double\nhis total sales of just over $540 million for all of 2020. The Facebook\nco-founder and CEO retains a roughly 13% stake in his company after…",
  "data/reddit-stocks/r/wallstreetbets/comments/sj0rle/aged_like_milk_on_a_hot_day_kevin_oleary_say_hes.json": "Keeeemon Kev, let’s see those loses.\n\nKevin O’Leary say he’s buying Meta shares ahead of earnings\n[https://www.cnbc.com/video/2022/02/02/kevin-oleary-say-hes-buying-meta-shares-ahead-of-earnings.html]",
  "data/reddit-stocks/r/stocks/comments/silffi/rstocks_daily_discussion_wednesday_feb_02_2022.json": "These daily discussions run from Monday to Friday including during our themed\nposts.\n\nSome helpful links:\n\n * Finviz [https://finviz.com/quote.ashx?t=spy] for charts, fundamentals, and\n   aggregated news on individual stocks\n * Bloomberg market news [https://www.bloomberg.com/markets]\n *…",
  "data/reddit-stocks/r/investing/comments/sj380x/paypal_walks_back_its_2021_goal_of_750_million.json": "https://www.cnbc.com/2022/02/01/paypal-pypl-q4-2021-earnings.html\n\nhttps://www.marketwatch.com/story/paypal-targets-750-million-active-accounts-by-2025-double-what-it-has-now-11613063608\n\nPayPal said it expects to add 15 million to 20 million new accounts this year\nand walked back its goal of 750…",
  "data/reddit-stocks/r/investing/comments/sj36h6/starbucks_sbux_union_push_spreads_to_54_stores_in.json": "Bearish sign?\n\nhttps://www.npr.org/2022/01/31/1076978207/starbucks-union-push-spreads-to-54-stores-in-19-states\n\nStarbucks is facing a fast-growing union campaign just weeks after the first\nU.S. corporate store unionized in Buffalo, N.Y.\n\nEmployees at 54 stores in 19 states are pursuing union…",
  "data/reddit-stocks/r/wallstreetbets/comments/sit6vq/googl_201_split.json": "I was down bad yesterday and impulsively bought 29 3000c at 6.80, instantly\nregretted it and was trying to sell and the market closed on me. OFFICIALLY A\nDEGENERATE. I want a YouTube video about this.\n\nhttps://imgur.com/a/QNx79tx",
  "data/reddit-stocks/r/wallstreetbets/comments/siqp83/pypl_put_gains.json": "Bought about $64000 2/4 165P yesterday right before close. For some reason I\ncant post with the image so heres the link. Netted a little over 500k on both my\nRH and Schwab options account.\n\n\n\nhttps://imgur.com/a/1KnxRYM\n\n\n\n(Btw, does anyone know how to retrieve deleted posts? Somehow all my…",
  "data/reddit-stocks/r/wallstreetbets/comments/sj3r6w/what_the_fuck_is_the_metaverse.json": "Seriously. Does anyone actually know or is it just another meaningless hype word\n?\n\nI figure its like 'cloud-based' - 'which means My shit on someone else's\nserver', a concept thats been around for 30 years.",
  "data/reddit-stocks/r/stocks/comments/sj1sqh/wtf_is_with_the_multiple_huge_fb_320_buys_after.json": "Screenshot here [https://i.ibb.co/f4TTpfh/image.png] It shows on both the graphs\nand in the Time & Sales in Active Trader Pro...\n\nAnyone know what this is? I've seen it before in smaller stocks with lower\nliquidity and higher bid/ask spreads, which can make sense.\n\nBut this is straight up…",
  "data/reddit-stocks/r/stocks/comments/sj93o8/facebooks_disastrous_results_are_bad_news_for.json": "Facebook's disastrous results on Wednesday show how a privacy crackdown by Apple\nlast year is having a longer and larger impact on the digital advertising\nindustry , with billions of dollars due to be lost this year alone. Snap,\nTwitter and Pinterest may be next in line for a hammering.\n\nApple's…",
  "data/reddit-stocks/r/stocks/comments/sj3d96/meta_platforms_changing_its_stock_ticker_to_meta.json": "reuters.com/technology/facebook-owner-meta-forecasts-q1-revenue-below-estimates-2022-02-02/\n[https://reuters.com/technology/facebook-owner-meta-forecasts-q1-revenue-below-estimates-2022-02-02/]\n\nThe company said on Wednesday it would this year change its stock ticker to\n\"META,\" the latest step in…",
  "data/reddit-stocks/r/Bogleheads/comments/sipwq4/reassurance_needed.json": "Hey guys, I’m decreasingly interested in owning individual stocks. I tried it\nfor a little and I want to convert to simple and diverse portfolio.\n\nI’m struggling with the idea that I’ll be missing out on some gains on the\npositions I sell. I also realize I could be saving myself some money too.…",
  "data/reddit-stocks/r/investing/comments/sj5zmj/if_a_stock_is_plummeting_and_you_want_to_sell_who.json": "If a Stock is plummeting and you want to sell? Who is buying it, hypothetically\nif a stock is doing very poor and the future of the company looks poor who would\nbuy your stock? Are you just unable to sell",
  "data/reddit-stocks/r/Bogleheads/comments/sjf9qg/if_my_money_isnt_from_a_job_theres_no_reason_to.json": "Hello fellow boglers. I’d love a sense check here.\n\nI use a regular brokerage account to invest instead of an IRA. Since the money\nhas already been taxed (The money I am investing is not from a current\njob/paycheck; it’s gifts, my own savings, inheritance) that’s ok right? I’m not\nlosing out on any…",
  "data/reddit-stocks/r/wallstreetbets/comments/sjdk9t/fb_is_over_metaverse_wont_save_it.json": "I've seen a lot of speculation on whether it's worth buying the dip on FB. Maybe\nit will bounce this week or next, but nobody, under any circumstances, should be\nlong on FB.\n\nI work in tech, and my best estimation is that the Metaverse announcement was\nliterally because FB could see the writing on…",
  "data/reddit-stocks/r/wallstreetbets/comments/sjiw0p/immutable_and_gamestop_form_partnership.json": "https://www.marketwatch.com/story/gamestop-enters-nft-marketplace-with-immutable-x-partnership-2022-02-03\n\n\n\nGameStop Corp. GME said Thursday it has entered a partnership with Immutable X\nPty Ltd., under which it will create a fund of up to $100 million in Immutable\nX's IMX tokens, which will be…",
  "data/reddit-stocks/r/investing/comments/siv6xg/find_newest_direct_listings_dpos.json": "Hello everyone\n\nI am interested at investing into new, direct listed, companies. Unfortunately,\nI find it quite hard to find a service where I can see the newest or maybe also\nupcoming DPOs.\n\nThe only way I became aware of new direct listings was through the media and I\nhave the fear that I could…",
  "data/reddit-stocks/r/wallstreetbets/comments/sj7qit/melvin_capital_down_15_percent_in_january.json": "https://www.google.com/amp/s/www.wsj.com/amp/articles/growth-hedge-funds-suffer-worst-rout-in-years-11643824096\n\nMarge will be knock knock knocking on Gabe Plotkin’s door. This is before techs\nshitting the bed today. His losses will be much more now. He is long big tech.\n\nI’m excited to see the…",
  "data/reddit-stocks/r/stocks/comments/sjkieh/why_fb_is_investing_so_heavily_into_vr_if_it_isnt.json": "They have no control over the OS right now. iOS (Apple) and Android (Google) can\ndo whatever they want at the OS level.\n\nWithout control at the OS level. FB can't do the following:\n\n * Create an app store and charge 30% for transactions like Apple and Google\n   does\n * Control its own destiny.…",
  "data/reddit-stocks/r/stocks/comments/sjav43/anyone_buying_reddit_stock.json": "Reddit is skated to IPO at a $15b valuation, as reported by thestreet dot com.\nThis is comparable to Pinterest at $17b, but half of Twitter at $30b. Twitter\nseems overvalued, given how it is so littered with spam bots and no moderators\nto keep them in check. I find Reddit much more user friendly…",
  "data/reddit-stocks/r/stocks/comments/sjcs2g/does_anyone_still_remember_near_the_end_of_last.json": "This game is so rigged, they must have known something...\n\nAll the Youtuber and the analyst were like, it's for tax purposes\n\nIt was not.\n\nThey definitely knew something is up\n\nThey have made a record amount of money in the pandemic\n\nand they all sold at all-time high\n\nhow convenient is that\n\nI was…",
  "data/reddit-stocks/r/stocks/comments/sjhd3c/pypl_and_fb_earnings_misses.json": "What if Apple is the culprit behind these massive misses? You have Apple which\nstopped data sharing by and large all social media marketing stocks are expected\nto miss with the sole exception of Google. If social is missing that means\neither fewer ads or lower conversion. Lower conversion means…",
  "data/reddit-stocks/r/stocks/comments/sjmcpq/crash_one_company_at_a_time.json": "It feels that lately there is an interesting trend: almost every day (at least\nin earnings season) when we experience a high double digits decrease in one day\nwhich is sometimes getting deeper second day (PayPal, Facebook…)\n\nWhat’s your take and who’s next?",
  "data/reddit-stocks/r/wallstreetbets/comments/sj210e/anyone_else_digging_the_new_textonly_wsb.json": "WSB hasn't looked like this since pre-GME. For the entirety of last year the\nfront page was flooded with shitty, low-effort, easily consumed, circle-jerky, I\ncan relate (haha) GARBAGE memes. I think text-only filters out the actual\nretards and forces people to fooking THINK for once and actually…",
  "data/reddit-stocks/r/wallstreetbets/comments/sji28k/50k_120k_3k_back_to_being_a_full_time_wage_slave.json": "Lost all my life savings once I started day trading with options.\n\nDecided to yolo on nflx & fb calls before earnings and got utterly rekted.\n\nhttps://imgur.com/a/HCUMQzA",
  "data/reddit-stocks/r/investing/comments/sjol6n/thread_ultimate_stock_investor_stack_what_tools.json": "As a retail investor my days are filled with countless hours of news reading,\nchart analyzing, mouse wheel scrolls, and many, MANY open tabs. Also, like many\nof you I’ve been through the mill with brokerages, trading bots, news data\naggregators, and every other trading tool under the sun.\n\nThat…",
  "data/reddit-stocks/r/Bogleheads/comments/sjkyux/how_would_i_run_math_to_determine_whether_a.json": "I’m looking to understand whether I should invest 100% in my traditional or Roth\n401k. I max the account every year and split my contributions 50/50 currently.\nI’m trying to decide whether going 100% traditional is worth it.\n\nLet’s assume that whatever tax break I get from traditional, I would take…",
  "data/reddit-stocks/r/stocks/comments/sjpz6q/isnt_it_funny_how_everyone_in_the_comment_section.json": "Full disclosure, I do not own FB and I chose that back in the past based on\ntheir work ethics and actually allowed my emotions not to buy the stock, even\nthough it felt discounted compared to other FAANG stocks, only did several\nswings with options.\n\nNow every second comment you see is bashing them…",
  "data/reddit-stocks/r/Bogleheads/comments/sjrobl/worth_noting_metafacebook_which_is_currently_down.json": "In case you've ever wondered what the underlying holdings for VT are, Vanguard\nhas this information available.\n[https://investor.vanguard.com/etf/profile/overview/VT/portfolio-holdings] And\nyou can sort the holdings by % of total holdings by clicking on the \"% of funds\"\nheader to see that Facebook…",
  "data/reddit-stocks/r/wallstreetbets/comments/sji97k/fb_suddenly_everyone_is_a_genius.json": "I'm just amazed how every moron suddenly \"always knew\" how bad FB is doing, how\nSnowflakes only use TicToc, and how the metaverse is complete horseshit\n(altought that hasn't stopped a single idiot to throw the word into every Nvidia\n\"DD\")\n\nTherefor two well intentioned suggestions (for…",
  "data/reddit-stocks/r/stocks/comments/sjo11k/blackberry_what_to_do.json": "So last year, based on the ever great advice of many r/stocks [/r/stocks]\nredditors, I decided to buy Blackberry at, what I thought at the time, was a\nvery appealing price of around $15. It was a hot topic for months here, every\npost was going wild for it. Quite literally, as soon as I bought, the…",
  "data/reddit-stocks/r/stocks/comments/sjfx95/rstocks_daily_discussion_options_trading_thursday.json": "This is the daily discussion, so anything stocks related is fine, but the theme\nfor today is on stock options, but if options aren't your thing then just ignore\nthe theme and/or post your arguments against options…",
  "data/reddit-stocks/r/stocks/comments/sjudiz/amazon_earnings_per_share_at_2775_rev_at_1374_was.json": "https://www.cnbc.com/2022/02/03/amazon-amzn-q4-2021-earnings.html\n\nAmazon reported earnings after the bell. Here are the results.\n\nEarnings per share: $27.75 Revenue: $137.4 billion vs $137.6 billion expected,\naccording to a Refinitiv survey of analysts AWS revenue: $17.37 billion\nexpected,…",
  "data/reddit-stocks/r/investing/comments/sjvmmh/amazon_stock_soars_15_after_earnings_will_hike.json": "Article link: https://finance.yahoo.com/news/amazon-earnings-162246834.html\n\n$AMZN is currently up 18% in AH.\n\nAmazon (AMZN) reported fourth quarter results on Thursday and announced it will\nraise its Prime membership fee to $139 per year from $119 in the U.S. The stock\nis soaring in after…",
  "data/reddit-stocks/r/wallstreetbets/comments/sjrjce/what_the_actual_fuck_mods_who_pissed_in_your.json": "Half the posts on this sub were fucking loss or gain porn pictures you absolute\nmorons. I’ve never judged y’all for your sexuality but man this has to be one of\nthe most shit for brained decisions I’ve ever seen on Reddit. Do you think this\nsub grew 10x in the last two years because of the quality…",
  "data/reddit-stocks/r/stocks/comments/sjum8p/snap_surges_30_after_earnings_beat.json": "Snap shows first-ever quarterly net profit\n\n• Daily Active Users increased 20% year-over-year to 319 million\n\n• Fourth quarter revenue increased 42% and full year revenue increased 64%\nyear-over-year\n\n• First quarter of positive net income as a public company\n\n• First full year of positive…",
  "data/reddit-stocks/r/investing/comments/sjrd0j/liquify_or_just_paranoia.json": "Hi all. I’m 34f. I have probably $40k in stock & retirement accounts. My husband\nthinks there’s an inevitable stock crash coming and also thinks digital currency\nwill devalue my stock. He saying I should just liquify all of it because it will\nnot grow and I’d be better off having it In silver and…",
  "data/reddit-stocks/r/stocks/comments/sjucf4/amzn_surges_15_after_hours_after_blowout_earnings.json": "Amazon reported earnings after the bell. Here are the results.\n\nEarnings per share: $27.75\n\nRevenue: $137.4 billion vs $137.6 billion expected, according to a Refinitiv\nsurvey of analysts\n\nAWS revenue: $17.37 billion expected, according to StreetAccount\n\nAlso, Prime membership cost will be going up…",
  "data/reddit-stocks/r/stocks/comments/sjreb1/amzn_could_fly_on_earnings.json": "This is why I'm betting AMZN does well on earnings today AH!\n\nFor starters, AMZN is down 6.85% at the time of writing this today, meaning, the\nmarket is already scared with what happened to (FB, NFLX, PYPL, etc...) and many\ninvestors are getting out in an effort to protect themselves if AMZN…",
  "data/reddit-stocks/r/stocks/comments/sjvhda/amzn_lives_but_the_faang_is_dead_fb_and_nflx_dont.json": "Obviously MSFT should be one of the replacements, so who gets the other spot?\nNVDA seems like a solid candidate, giving us an aesthetically pleasing MANGA\nindex. Who would you consider in the elite ring of big tech and why?",
  "data/reddit-stocks/r/investing/comments/sjwp4x/has_a_company_as_large_as_facebook_meta_ever.json": "I have been following the stock market for 30 years and I have never seen a\ncompany the size of Facebook (Meta) drop over 25% in price in one day. (It\ndropped 26.3% today)\n\nFacebook (Meta) was the seventh-largest company in the United States by market\ncap. With a $661.39 Billion dollar market…",
  "data/reddit-stocks/r/wallstreetbets/comments/sjw4xt/zuckerberg_cries_after_earnings.json": "Quoting Bloomberg.\n\n> Zuckerberg appeared red-eyed and wore glasses, the person said. Employees were\n> told he might tear up because he'd scratched his eye.\n\nSounds like losing 21 Billion in net worth over night will cause “eye\nscratching”\n\nPersonally, I am actually long FB with 10 shares but I'd…",
  "data/reddit-stocks/r/stocks/comments/sjuhae/amazon_results_out.json": "Amazon skyrocketed more than 15% in extended trading Thursday after the company\nreported a big earnings beat in its fourth quarter results.\n\n * Earnings per share: $27.75\n * Revenue: $137.4 billion vs $137.6 billion expected, according to a Refinitiv\n   survey of analysts\n * AWS revenue: $17.8…",
  "data/reddit-stocks/r/wallstreetbets/comments/sjyn3q/big_thank_you_to_the_mods.json": "I disagree completely with the assertion that we need memes back.\n\nI have learned ABSOLUTELY NOTHING from WSB ever since 10,000,000 apes piled in\nhere with their bullshit pictures and jokes. It's funny sure, but I want to make\nsome fucking money. I am not here to get a little chuckle at how much…",
  "data/reddit-stocks/r/investing/comments/sjxe8u/snap_shares_rocket_as_much_as_62_on_firstever.json": "https://www.cnbc.com/2022/02/03/snap-q4-2021-earnings.html\n\nSnap reported its first quarterly net profit on Thursday, and beat analyst\nestimates for the fourth quarter on earnings, revenue and user growth.\n\nThe report comes a day after Facebook parent Meta delivered disappointing\nguidance for the…",
  "data/reddit-stocks/r/stocks/comments/sjx1wq/why_is_the_market_making_these_over_exaggerated.json": "I've never seen market act like this. If your earnings slightly beat\nexpectations your stock soars 30%, if it slightly disappoints it's an elevator\ndown 30%.\n\nWe've seen this with FB, SNAP, GOOGL, AMZN, Netflix and others. Giant marketcap\ncompanies moving like pennystocks.\n\nIs this just due to…",
  "data/reddit-stocks/r/wallstreetbets/comments/sjowri/amzn_earnings_call_is_free_money.json": "Alright you fucking ****** here’s a play thats so obvious and easy you’re gonna\nbe wondering how you couldn’t see what I see.\n\nSo Zuck just got cucked on his shitty platform and even shittier Metaverse\ntransition. That combined with paypal, spotify, and some other tech heavy less\nthan stellar…",
  "data/reddit-stocks/r/wallstreetbets/comments/sjlimj/fb_puts_3k_to_596k.json": "Figured with getting burned on PayPal and the massive overcorrection that\nfollowed. FB was the best bet for a short play due to their strong headwinds and\nnot the best outlook the previous earnings. Not to mention the expected revenue\nwas actually a decrease from the previous 4Q revenue due to the…",
  "data/reddit-stocks/r/stocks/comments/sjunzx/f_reports_mixed_fourth_quarter_results_as_chip.json": "Ford Motor reported earnings after the bell. Here are the results.\n\nAdjusted EPS: 26 cents vs 45 cents a share expected, per Refinitiv Automotive\nrevenue: $35.3 billion vs $35.5 billion expected, per Refinitiv\n\nThe automaker reported an operating profit of $1.7 billion, or adjusted earnings\nof 34…",
  "data/reddit-stocks/r/stocks/comments/sjy8e7/we_all_know_facebook_is_going_back_up.json": "It's facebook. They'll recover. Honestly, can somebody give me a legit reason\nnot to dump a lot of money into this dip? Just because of some privacy changes\ndoesn't mean they're going bankrupt, it's only a matter of time, right? Anybody\nagree or what",
  "data/reddit-stocks/r/wallstreetbets/comments/sjxclk/fb_please_realize_that_one_of_the_major_reasons.json": "Source below. so... the more privacy we have online, the less they make. What\nare they out for? NOT you... actually they ARE out for YOU.\n\n\n\nhttps://news.yahoo.com/apple-privacy-measures-cost-facebook-143520201.html",
  "data/reddit-stocks/r/wallstreetbets/comments/sk0o1n/the_coming_crash_isnt_what_you_think_its_already.json": "Going full ADHD on this so bare with me.\n\nThe market is going to separate the wheat from the chaff when it comes to\ntech/growth plays. The tech bubble didn't kill tech, it purged the weak and\nrewarded the strong.\n\nAny debt laden companies will be on the chopping block as the only option for\nthem…",
  "data/reddit-stocks/r/stocks/comments/sk9sok/microsoft_holo_lens_reportedly_cancelled_15.json": "Holo Lens was incredibly impressive and I thought Microsoft was furthest ahead\nout of everyone but reports show that is not the case anymore. There is also a\ndivide over whether Microsoft should create hardware or stick to creating an OS\nfor vr/ar hesdsets.\n\nMeanwhile 15 Microsoft employees have…",
  "data/reddit-stocks/r/stocks/comments/skdq20/us_job_growth_beats_expectations_in_january.json": "> The U.S. economy created far more jobs than expected in January even as raging\n> COVID-19 infections disrupted activity at consumer-facing businesses, pointing\n> to underlying strength in the labor market.\n> \n> The survey of establishments in the Labor Department's closely watched\n> employment…",
  "data/reddit-stocks/r/Bogleheads/comments/skd78e/why_shouldnt_i_invest_in_the_huge_stocks_that.json": "In the very recent short term:\n\nFacebook is -20%, Microsoft -10, Sony -13%, Spotify -35%, Amazon -15%\n\nAll I can see is discounts on mega companies that will surely increase in value\nlong term. Please can some sensible bogleheads tell me why I'm wrong here to\ntalk me around? I currently only invest…",
  "data/reddit-stocks/r/wallstreetbets/comments/sk8shg/sell_amzn_immediately.json": "DUMP AMZN IMMEDIATELY!\n\nThere Q4 net incomes are total BS!!!\n\n\"Fourth quarter 2021 net income includes a pre-tax valuation gain of\n$11.8 billion included in non-operating income from our common stock investment\nin Rivian Automotive, Inc., which\ncompleted an initial public offering in…",
  "data/reddit-stocks/r/investing/comments/sk9r3a/unity_beats_expectations_with_q4_revenue_up_16_in.json": "Venturebeat.com reports\n[https://venturebeat.com/2022/02/03/unity-beats-expectations-with-q4-revenue-of-315-9m-up-43/]:\n\nGame engine maker Unity reported earnings and revenues that beat Wall Street’s\nexpectations for the fourth quarter ended December 31.\n\nThe company’s stock rose 16% in after-hours…",
  "data/reddit-stocks/r/wallstreetbets/comments/sk3fwz/unpopular_opinion_but_i_like_the_new_no_meme_mode.json": "I was lurker in this sub pre-Gamestop and I’ve seen it gone to shit ever since.\nI think this move by the mods will help “restore” this sub. This new mode will\nbring back a lot post that would otherwise get lost in all the low quality memes\nthat get posted here regularly. I was able to ride the $RKT…",
  "data/reddit-stocks/r/stocks/comments/sk6etw/u_unity_software_beats_q421_expectations_and.json": "Unity's earnings call was fascinating to listen to. First, revenue was up 43%\nover Q420 and 44% YoY. Gaming growth is strong, and non-gaming growth is\nstronger. Some use cases mentioned in the call include partnerships with Hyundai\nbuilding the digital twin for one of their facilities and eBay…",
  "data/reddit-stocks/r/stocks/comments/skf7ns/facebook_sinking_ship_or_not.json": "To start off, I'm long-term bullish on Facebook. I think they're a\nwell-positioned company with lean operations, good cash reserves, low debt.\nThere's obviously a lot of controversy around the company recently and there are\ngood reasons for that. However, I think they're finally being forced to…",
  "data/reddit-stocks/r/Bogleheads/comments/skbsqr/vtsax_all_in.json": "I'm 25 and currently investing $1000 into VTSAX every month. This is my only\ninvestment plan and I have been doing this for years. Is this approach too lazy\nand are there recommendations for how to make more money in the long run than\nVTSAX?",
  "data/reddit-stocks/r/Bogleheads/comments/ski981/the_insidious_power_of_persuasion.json": "The recent volatility of Meta has taught me a lot about financial market\nchannels like CNBC. And I've learnt quite a bit about how susceptible I can be\nto articulate and confident people on TV.\n\nFirst I listened to Josh…",
  "data/reddit-stocks/r/Bogleheads/comments/sjs9yb/just_hit_100k_invested_how_does_my_long_term.json": "Hello Everyone,\n\nBeen following the Boglehead investing strategy since Fall 2019. Since then,\nbetween my 401k, Roth IRA, and individual brokerage account - I have a little\nover 100k + currently invested in the stock market. I think this is a great\ncheckpoint for someone who just turned 30.\n\nI feel…",
  "data/reddit-stocks/r/stocks/comments/skahjt/is_this_market_volatility_driving_you_further.json": "For the average Reddit stock picker and trader, I'm curious if this\nunprecedented volatility in the stock market to start the year has made you less\ninclined to want to continue being in the stock market?\n\nLast year the stock market frenzy and relatively easy market brought so many new\ntraders into…",
  "data/reddit-stocks/r/stocks/comments/skgx05/just_made_a_profit_on_my_first_ever_options_trade.json": "Nothing major. Just straddled $SPOT. Bought a 2/4 $175 call and a 2/4 $141 put\nfor a total of $55. Figured either people will buy up the huge earnings dip and\nsee it as an overreaction or people would see the lower than expected earnings\nand the whole Joe Rogan thing and sell off more. Only made a…",
  "data/reddit-stocks/r/stocks/comments/ska5ju/rstocks_daily_discussion_fundamentals_friday_feb.json": "This is the daily discussion, so anything stocks related is fine, but the theme\nfor today is on fundamentals, but if fundamentals aren't your thing then just\nignore the theme and/or post your arguments against fundamentals…",
  "data/reddit-stocks/r/wallstreetbets/comments/ski55s/top_5_best_recent_stock_trades_by_us_politicians.json": "I've been collecting and publishing data on stock trading by US politicians, and\nwanted to share a list of some of most well-timed moves by our elected officials\nthis past month. Here's a link [https://twitter.com/QuiverCongress] to the\nTwitter account where I post trades as they are disclosed.\n\nIf…",
  "data/reddit-stocks/r/investing/comments/skk3ko/vast_doj_probe_looks_at_almost_30_shortselling.json": "https://news.bloomberglaw.com/securities-law/vast-doj-probe-looks-at-almost-30-short-selling-firms-and-allies\n\nThe Federal Bureau of Investigation seized computers from the home of prominent\nshort seller Andrew Left, the founder of Citron Research, in early 2021, some of\nthe people said. In more…",
  "data/reddit-stocks/r/stocks/comments/skkea6/which_one_of_your_investments_do_you_have_the.json": "I'm not an investor, nor do I plan on investing this year, but I'm genuinely\ncurious to know how people value their most prized investments. What companies\ndo you believe in SO STRONGLY that you'd allocate more of your portfolio to them\nthan anyone else? And why do you believe this?\n\nI'm interested…",
  "data/reddit-stocks/r/Bogleheads/comments/skh7i0/ive_finally_reached_the_point_where_investing_is.json": "I'm not investing I'm VOO per say, but I am buy/holding for the long term and\nholy fucking shit, I'm bored as fuck and wish I never got into investing as much\nas I did. I find learning about finance and the stock market and how it works so\ninteresting and fascinating but holy fuck I'm fucking bored…",
  "data/reddit-stocks/r/investing/comments/skhgd9/if_you_invest_some_of_your_money_in_bond_funds.json": "This question is not for people who have most of their money in stocks or stock\nfunds.\n\nHistorically when stocks went down bond funds went up. So it was a good hedge\nagainst a bear market in stocks.\n\nBut for the last few years bond funds have done poorly and I have noticed that\ndaily losses and…",
  "data/reddit-stocks/r/Bogleheads/comments/skileh/simple_boglehead_question_if_we_generally_expect.json": "I know it's a cardinal sin to try to time the market, however, it does seem\nreasonable to choose an entry point based on long-term trendlines.\n\nCollins seems to advise to pump your capital into indexes whenever it's\navailable. Can someone explain to me how that doesn't contradict his…",
  "data/reddit-stocks/r/stocks/comments/skly3j/ford_shares_fall_10_on_earnings_miss.json": "17.9Billion in profits from total year 2021. 8.2B was from it's rivian\ninvestment.\n\nEps of 26cents vs 45cents expected.\n\nhttps://s23.q4cdn.com/799033206/files/doc_financials/2021/q4/Q4-2021-Corporate-Earnings-Slides.pdf",
  "data/reddit-stocks/r/stocks/comments/skoth7/amzn_sets_single_day_record_gaining_191b.json": "One day removed from Meta setting a new record for single day losses, Amazon\ndoes the opposite, adding $191B to its market cap. The stock rose 13% following\nan enormous earnings beat, posting an actual EPS of $27.75 on consensus\nestimates of $3.36.\n\nNo additional commentary or insight from me,…",
  "data/reddit-stocks/r/stocks/comments/ski3ze/the_house_congress_passes_bill_to_counter_chinas.json": "https://edition.cnn.com/2022/02/04/politics/house-china-competition-bill-vote/index.html\n\n> The House of Representatives voted Friday to make sweeping investments in\n> American manufacturing and scientific research as well as changes to trade\n> policy in an effort to make the US more competitive on…",
  "data/reddit-stocks/r/stocks/comments/skqljb/peloton_stock_jumps_34_on_report_amazon_is_among.json": "Shares of Peloton jumped Friday after the Wall Street Journal reported Amazon\nhas approached the stationary-bike maker about a potential deal.\n\nhttps://www.cnbc.com/2022/02/04/peloton-stock-jumps-20percent-on-report-amazon-is-among-potential-buyers.html",
  "data/reddit-stocks/r/stocks/comments/sksmkf/amazon_primes_price_increase_will_result_in_an.json": "Amazon Prime rates are going up for US Customers on Feb 18th. What that means\nfor Amazon's revenue generated from Prime memberships?\n\nAmazon had ~151.9M US Customers in 2021. And its projected to have ~157.4M by\nend of 2022. The annual price increase: $119 > $139, will generate an additional\n$3.8B…",
  "data/reddit-stocks/r/Bogleheads/comments/sknjoq/the_place_of_international_equities.json": "Was fighting the good fight on another sub where lots of people were very\nhostile to international equities. The last decade has really made everyone\nthink they are a genius holding Large US.\n\nCame to read a few posts on here and see the pallette cleansing phrase \"20%\nVXUS\".",
  "data/reddit-stocks/r/stocks/comments/sktjlh/i_nuked_my_42k_account_on_f_calls_no_one_to_blame.json": "Guys, I nuked my entire 42k account down to $390 on $F calls. Yes, I feel like\ncomplete shit, but this is my fault alone, I take full responsibility, don't\nwant your pity, and I understand I was gambling. I was wondering, I know the\nstandard advice is to buy an ETF and hold it for 30 years, but I…",
  "data/reddit-stocks/r/Bogleheads/comments/sktd93/is_it_time_for_me_to_leave_edward_jones.json": "I am 45 and have been been investing through Edward Jones for the last 10 years.\nI didn't know much about investing and didn't have much strategy when I started\nso I leaned on their advice a lot. In doing so, I now have 5 different accounts\nwith them from taxable accounts to a few different IRAs…",
  "data/reddit-stocks/r/stocks/comments/skvnqm/am_i_the_only_one_who_thinks_the_market_got_fb.json": "If we delve into the earnings reports for both companies, almost 80% of Amazon's\nEPS came from it's stake in Rivian as of Dec 31 (which at this point is now much\nlower). They would have missed earnings without Rivian, and they missed revenue\nestimates (during a time of 7% inflation, that's actually…",
  "data/reddit-stocks/r/stocks/comments/skl0sk/google_stock_split_is_it_pretty_much_guaranteed.json": "\"Following approval by shareholders, owners of Alphabet stock will receive their\nadditional shares on Friday, July 15. Alphabet will begin trading under its new\nprice when markets reopen on July 18.\"\n\nI am considering buying enough shares so I can have a 100 shares after split.\nBut how unlikely…",
  "data/reddit-stocks/r/wallstreetbets/comments/skliy2/you_bears_are_the_biggest_bitches_i_ever_met_part.json": "Yo, granny's back bitches.\n\nSo yesterday when the market went red cause the Zuck got cucked, my original\npost was bombarded with bear comments saying how wrong I was and how you f*gs\nare shoving dicks into my mouth cause I'm holding SPY and QQQ call positions\nthat are ITM and doesn't even expire…",
  "data/reddit-stocks/r/investing/comments/sky896/how_much_cash_if_any_in_terms_of_of_your.json": "I usually invest all the money I contribute to my investment accounts. The\ndrawback to this is whenever there is a correction I don’t really have a lot of\ncash sitting around to buy stocks at a discount. I always wish I have a lot of\ncash to buy stocks that get unnecessarily beat up in dips and…",
  "data/reddit-stocks/r/stocks/comments/sl2iw1/facebook_says_apple_ios_privacy_change_will.json": "I honestly love the fact that I can deny access to some of my data thanks to\nApple iOS. But: isn‘t it scary that Apple can protect my data just like that\nwith a button when all the world‘s regulation (e.g. GDPR in Europe) could not?\n\nSource:\nhttps://www.cnbc.com/amp/2022/02/02/facebook-says-apple…",
  "data/reddit-stocks/r/stocks/comments/skwhn9/what_was_your_aha_moment_when_it_came_to.json": "What was your \"aha\" moment when it came to understanding the stock market? Any\ngood nuggets of wisdom to share? One of mine is that investor psychology is\nlargely responsible for short term stock prices. When people were panic selling\nduring March 2020 in the early pandemic I bought a lot of stocks…",
  "data/reddit-stocks/r/investing/comments/sl7f39/ideas_on_how_to_make_my_companies_401k_not.json": "I'm trying to figure out a solution to my 401k where it isn't being charged\nenormous fees and I have some degree of control over where stuff is going\nwithout being charged additional fees.\n\nRight now we're with Edward Jones and it seems like they have no idea what\nthey're doing. My entire portfolio…",
  "data/reddit-stocks/r/investing/comments/sl5fyj/many_of_the_largest_most_successful_technology.json": "Now that the FANG stocks have dropped everyone is looking to buy on the dip.\nThese FANG stocks are very large and have a history of success. But if history\nis a guide many of them may underperform for decades going forward.\n\nRemember INTEL, IBM, and CSCO? They were not the high-flying no-earnings…",
  "data/reddit-stocks/r/stocks/comments/slb5p6/question_preparing_for_a_bear_market_what_are_you.json": "I know some of you will disagree with the proposition that we are about to\nexperience a bear market or even a steep-ish correction in 2022 and I’m not here\nto debate that.\n\nIn fact, I’m more curious to know what most of you would do if a bear market was\nto really happen.\n\nWhat Investment strategies…",
  "data/reddit-stocks/r/stocks/comments/slbz4p/gamestop_if_you_dont_follow_the_gme_saga_what_are.json": "Genuinely curious: As somebody that does not follow/ isn’t invested in the\nGameStop ($GME) saga, what are your thoughts and opinions on it?\n\nGenuinely curious here. I know that r/stocks [/r/stocks] and other investment\nsubs aren’t too fond of $GME. Why?\n\nI’m looking for intellectual and healthy…",
  "data/reddit-stocks/r/stocks/comments/slf8cr/should_i_pay_off_my_student_debt_or_keep_investing.json": "I'm 25 - have about $25k in student loan debt. My interest rate is about 4-5%. I\nmake about $70k a year and have a pretty stable job. I also have about $17k\ninvested in the market - mostly VTI and other ETF's.\n\nI find myself torn between wanting to just get rid of my student loan debt -…",
  "data/reddit-stocks/r/stocks/comments/sli85p/im_thinking_buy_the_meta_dip_any_objections.json": "I hear speculation that meta is burning down and that FB no longer has a product\ngiven its hit to its ad revenue, compounded with Facebook being on a timer\nbefore it becomes irrelevant due to lack of adoption from a younger crowd.\nAdditional speculation is that meta is going to flop on their…",
  "data/reddit-stocks/r/Bogleheads/comments/slkhik/just_finished_reading_the_little_book_of_common.json": "After just finishing the Little Book I feel like I need to talk to people about\nwhat I read. I think my GF is bored of listening to me talk about it.\n\nIt’s refreshing to read the words of a man who isn’t worried about short term\nvolatility.\n\nI think it’s easy as a reader of subreddits focused on…",
  "data/reddit-stocks/r/stocks/comments/sld7lf/does_anyone_else_have_trouble_holding_individual.json": "No matter how much research I do, I feel like I still don’t fully understand a\nbusiness so I have trouble holding it for the long term. I’ll always find a\nreason to sell it, whether the price went up and I can lock in a profit, or the\nprice is lower than where I bought six months later. Or maybe I…",
  "data/reddit-stocks/r/Bogleheads/comments/slcgj4/meant_to_be_a_boglehead.json": "John Bogle signed my HS Diploma (Chairman of the Board) and I learned\nmath/science in Bogle Hall. After years of letting others manage my 401k, I took\ncontrol and put 25% in VOO. It seems there are other Bogle recommended ETFs to\nconsider…any advice as to which ones so that I’m diversified? Thanks…",
  "data/reddit-stocks/r/stocks/comments/slm5ia/do_you_have_a_stock_that_you_invest_based_more_on.json": "Asking because I do this. I hold 27 stocks in my portfolio, and I do my own\nvalue calculations and price targets for each of them. 26 of my 27 align with my\ntime horizon and expected return goals. 1 does not.\n\nTWNK does not meet the values I’m looking for, but I can’t bring myself to sell.\nI will…",
  "data/reddit-stocks/r/stocks/comments/slewk4/what_im_seeing_with_supply_chain_disruptions_jan.json": " * See my prior post for a primer on how I monitor supply-chain disruptions: How\n   to monitor the supply chain disruptions : stocks (reddit.com)\n   [https://www.reddit.com/r/stocks/comments/prfsi4/how_to_monitor_the_supply_chain_disruptions/]\n * Sep '21 Edition: What I'm seeing with supply chain…",
  "data/reddit-stocks/r/stocks/comments/slkqti/what_happens_if_google_apple_or_microsoft_have_an.json": "Just wondering given how markets reacted to Meta’s earnings miss, what would\nhappen if Google, Apple, Microsoft or all three have an earnings miss?\n\nI understand that the guidance was not positive for Meta which contributed to\nthe crash of the stock but wow it was a huge overreaction in my…",
  "data/reddit-stocks/r/stocks/comments/sliril/what_are_your_favorite_free_research_sites.json": "I'm looking to determine which are the best beginner stock investor research\nsites. I am doing research on which are best for new and/or beginner investors.\nAny help is greatly appreciated. Thank you.",
  "data/reddit-stocks/r/investing/comments/slmmxh/why_i_dont_invest_small_positions_in_companies.json": "I don’t even bother buying a stock if its going to be only a small percentage of\nmy holdings. Why? Because even if something is just 1% of your holdings you have\nto do just as much research and news watching as something that is 10% of your\nholdings.\n\nIt simply isn’t worth all the time and effort…",
  "data/reddit-stocks/r/stocks/comments/sls7ig/does_fundamental_analysis_matter.json": "Saw an interesting argument unfold in this sub recently on the topic of\nfundamental analysis. Some people seemed pretty convinced that it is near\nuseless due to the fact that everyone has the same data, but not everyone is a\nmillionaire. How valid are these claims? Is doing analysis really not…",
  "data/reddit-stocks/r/stocks/comments/slwhh0/how_do_you_think_the_recently_passed_america.json": "I recently bought several Intel leaps while they were on the cheaper side. I saw\nthe company get beaten down, particularly while being compared to AMD which is a\nrising star. After seeing the America Competes bill which offers incentives for\ndomestic chip production - as well as intels $20B plant-…",
  "data/reddit-stocks/r/investing/comments/slt9yw/daily_general_discussion_and_advice_thread.json": "Have a general question? Want to offer some commentary on markets? Maybe you\nwould just like to throw out a neat fact that doesn't warrant a self post? Feel\nfree to post here!\n\nIf your question is \"I have $10,000, what do I do?\" or other \"advice for my\npersonal situation\" questions, you should…",
  "data/reddit-stocks/r/stocks/comments/sm0vql/gopro_could_be_a_turnaround_company_gpro_value.json": "GoPro is down 75% since mid-2014 when it had its IPO. There has been a lot of\nnegative sentiment around it and based on the negative returns to the initial\ninvestors, rightfully so.\n\nHowever, it might be a turnaround company and I'll make my case below.\n\nUp until 2019, the company was mainly…",
  "data/reddit-stocks/r/investing/comments/slztfh/whats_the_current_bull_case.json": "As interest rates rise in the future, earnings of the companies that make up the\nindex will most likely fall (since access to cheap capital going forward will\nslowly erode)\n\nIf companies earn less and grow less, they are typically worth less.\n\nWith all of this “known” and “priced in” data, what’s…",
  "data/reddit-stocks/r/stocks/comments/slz52x/do_you_ever_buy_a_stock_just_out_of_pure_sentiment.json": "So like many on this sub, I got into investing during the 2020 corona crash.\nAfter many initial failures I figured out a mixed ETF/stock strategy, which I\nnow follow. A part of it is investing into companies with great outlooks and\nhold them for many years, thus actually investing.\n\nWith some cash…",
  "data/reddit-stocks/r/stocks/comments/sm1wnc/psa_the_new_app_titan_invest_that_is_being.json": "Recently, there's been a lot of advertisements for Titan on YouTube. They've\nquite clearly been spending a lot on their marketing budget. Titan is an app\nwhere they take your money and invest it in their actively managed fund. Their\nmarketing material will claim to earn a high return annually. They…",
  "data/reddit-stocks/r/wallstreetbets/comments/slw7t8/facebook_threatens_leaving_europe.json": "I know this is part of the SEC filing that caused the crash with institutional\nfirms, but my thought here is additional wide spread ELI5 reporting like this\nwill cause more to exit. If this type of sensational coverage gets more\nwidespread, seems to me people with puts are paying for dump…",
  "data/reddit-stocks/r/wallstreetbets/comments/slwqko/why_dont_you_take_the_profits.json": "I see a lot of people that made huge gains, life changing amounts of money that\ninstead of closing the position decide to risk it in the hopes of making even\nmore money. Any statistical analysis will tell you that your chances of\nrepeating a 1000% gain in a trade are very low,actually you are way…",
  "data/reddit-stocks/r/investing/comments/sm389y/facebook_a_value_mega_tech_or_the_next_ibm.json": "Opinion:\n\nThe thing that talking heads on CNBC do not remember is that Zuck is not a\ncreative visionary. He stole The Facebook idea from the twins. He bought IG and\nWhatsApp after they were hugely successful and FB's offerings couldn't compete.\nHe got Sandberg from Google. The guy steals IPs and…",
  "data/reddit-stocks/r/stocks/comments/slpwh2/am_i_missing_something_on_sony.json": "Hey,\n\nI am invested in SONY so my opinion is kind of biased. Nevertheless I want to\nask you if I did something wrong or if I am missing something.\n\nWhen I run my DCF-Analysis SONY must be growing with 3% when discounted with 8%\nto be valued at current levels.\n\n\n\nIs SONY grossly undervalued or am I…",
  "data/reddit-stocks/r/investing/comments/smbk9y/whats_the_catch_with_selling_covered_calls_and.json": "Numerous redditors as well as as countless scores of youtube videos tout the\n\"safe\" successes of these two options strategies. Apparently all these folks are\nreaping steady, albeit small, cash flow with little risk, as long as they are\nselecting strike prices at which \"they'd be happy to sell/buy…",
  "data/reddit-stocks/r/Bogleheads/comments/sltvfz/how_liquid_are_etfs.json": "Hi all,\n\nI've been doing some reading on here and want to buy VTI ETFs with most of my\nremaining money so it doesn't sit in a checking account. My question is, how\nquickly can I sell some shares for cash should I need it? As long as I could get\nit within a week or so, I think I'd be fine with that.",
  "data/reddit-stocks/r/Bogleheads/comments/slzs6n/need_help_with_my_parents_retirement_please_help.json": "> Parents in their 60s. Still employed atm. Their jobs don't offer any\nretirement benefits. My parentsdon't have any retirement saving at all. They\nwill be on Social security benefits.\n\n> My parents and I came to America in 2008. I believe they were in their mid 40\nor 50s at that time.\n\n> My…",
  "data/reddit-stocks/r/Bogleheads/comments/smbrrk/is_holding_international_equities_in_a_taxable.json": "I have heard that it is optimal to hold international stocks in a taxable\naccount to get the foreign tax credit. I am new to investing and currently only\ninvesting into my 401k and Roth IRA. So far, I have been going 70% US and 30%\ninternational. Would it be better to just hold domestic in these…",
  "data/reddit-stocks/r/stocks/comments/smezoy/sleep_stocks_specifically_sleep_apnea_stocks_will.json": "I'm bullish on sleep apnea stocks. Over a billion people have sleep apnea\nworldwide, it goes undiagnosed in 80% of cases, and increases the risk of the\nleading causes of death such as heart attack, stroke, cancer, accidents, and\ndiabetes. I personally believe this sector will do well as millennials…",
  "data/reddit-stocks/r/wallstreetbets/comments/smg3so/do_not_bet_against_mark_zuckerberg.json": "One bad quarter for Meta and half the reddit investing community suddenly thinks\nthey are smarter than Mark Zuckerberg.\n\nI am not going to waste time wading into the litany of bear case scenarios that\neveryone has brilliantly laid out now that the stock has already lost like 40%\nfrom ATH. (Congrats…",
  "data/reddit-stocks/r/Bogleheads/comments/smcqqq/60k_into_index_funds_any_downsides_of_fzrox.json": "Hi everyone.\n\nI am pretty new to investing and also to this sub. Already maxed out my Roth IRA\nfor '21 and '22 and have around $60K left after my emergency fund. So I opened a\ntaxable account today.\n\nWhat index fund should I invest in? I want to 'vtsax and chill' but have a\nfidelity account only. I…",
  "data/reddit-stocks/r/Bogleheads/comments/smhj1p/how_important_is_it_to_change_cost_basis_to.json": "Hi all, curious to hear your take on this as I see it doesn’t get talked about\nmuch here. I’m fairly early in the accumulation stage but wonder if those that\nhave been around for a while use specific identification as their cost basis\nmethod? Also, can this be done retroactively for all the shares…",
  "data/reddit-stocks/r/stocks/comments/sm2ult/crm_tsla_aapl_nvda_but_not_googl.json": "For the past decade, big name split announcements have meant big returns. GOOG n\nGOOGL seem to have bucked that trend—at least in the short, short term.\n\nTSLA & NVDA were the lords of post-split-parabolic and both pushed me into\nthinking I’m a market guru. Pair delusion with a 20 for 1 GOOGL split…",
  "data/reddit-stocks/r/Bogleheads/comments/smpd91/lost_most_of_my_money_in_stocks_and_crypto_ready.json": "Lost a lot of money in individual stocks. Following that, I made it back in\ncrypto only to end up losing far more than I put in initially plus the profits I\nmade because I did not take them out. I knew about the beauty of ETFs/index\nfunds from the beginning of starting to invest (16 months ago). I…",
  "data/reddit-stocks/r/stocks/comments/smia16/how_much_do_you_put_in_etfs_how_much_do_you_put.json": "Let's say, for example, that you have a total liquidity (in cash) of $60,000\nafter putting a full years worth of salary in a savings account and want to be a\nbit more risky.\n\nHow much of this do you:\n\nA. Keep in cash.\n\nB. Put into index ETFs (VOO, SPY)\n\nC. Put into more risky ETFs\n\nD. Put into safe…",
  "data/reddit-stocks/r/investing/comments/smovc2/disney_netflix_apple_is_anyone_winning_the.json": "\"Most people used to cancel their cable-TV subscription only when they moved\nhouse, says Doug Shapiro, a former chief strategy officer at Turner Broadcasting\nSystem, a television company. Now, he says, they are “becoming accustomed to\nchurning on or off over the quality of content”, signing up to…",
  "data/reddit-stocks/r/stocks/comments/smqkq9/frontier_and_spirit_to_merge_creating.json": "https://www.cnbc.com/2022/02/07/frontier-and-spirit-to-merge-creating-5th-largest-airline-in-us.html\n\nFrontier Airlines and Spirit Airlines, the two largest low-cost carriers in the\nU.S. have agreed to merge in a deal valued at $6.6 billion, creating what would\nbecome the fifth-largest airline in…",
  "data/reddit-stocks/r/stocks/comments/smqrzl/spotify_investor_demands_report_on_platforms.json": "https://www.businessinsider.com/spotify-joe-rogan-investor-ny-pension-fund-content-policing-report-2022-2\n\n * Spotify is in the spotlight over its handling of the Joe Rogan COVID-19\n   misinformation and racism fallout.\n * A top investment fund has demanded a report from Spotify on its new\n  …",
  "data/reddit-stocks/r/stocks/comments/smq9n7/own_ford_shares_x_6_months_get_the_x_plan_discount.json": "There is probably a post elsewhere on Reddit but I just discovered if you own\n100 shares of Ford stock for 6 months you can obtain their X-plan pricing for\nFord/Lincoln cars. Some dealers are not honoring the plan in this environment\nand I have heard sales people do not receive much of a commission…",
  "data/reddit-stocks/r/stocks/comments/smujjz/google_down_7_from_its_postearning_jump.json": "I'm scratching my head here. Scanned the usual news sites and didn't see any big\nnews involving Google today.\n\nI know many people were waiting for a drop from the post-earnings jump before\npicking up shares. Some topics for discussion:\n\n * Is this the right entry point or should we wait longer? (I…",
  "data/reddit-stocks/r/Bogleheads/comments/smqx91/is_it_safe_to_keep_all_your_money_in_one_brokerage.json": "Ive heard horror stories about when lehman brothers died people lost their bank\nmoney.\n\nIf Fidelity or Vanguard go bankrupt, are my shares still safe?",
  "data/reddit-stocks/r/Bogleheads/comments/smw7kn/29_years_old_going_all_in_on_vt.json": "Just wanted to thank everyone on here and all the resources. After doing quite a\nbit of research on here and weighing the pros/cons, specifically with regards to\n100% VT vs a ratio of VTI/VSUX, I’ve decided going 100% VT is the move for me as\nI don’t even want to rebalance once a year.\n\nI have…",
  "data/reddit-stocks/r/stocks/comments/smxtg8/facebookmeta_price_move_shows_that_no_individual.json": "It's a lesson that everyone who invests in individual stocks should keep at the\nback of his mind. Microsoft, Google, Amazon and Facebook have been praised on\nhere for many years as stocks that will outperform the overall market with\nrelative safety. It's very possible that Meta will grow for years…",
  "data/reddit-stocks/r/stocks/comments/smqvnc/alibaba_files_another_1_billion_ads.json": "Recently, Alibaba Group Holding Ltd. (NYSE: BABA) filed one billion more\nAmerican depositary shares. According to analysts, this implies that SoftBank\nGroup Corp. might have been planning to sell a portion of its holding in the\nChinese e-commerce behemoth. The BABA stock suffered miserably…",
  "data/reddit-stocks/r/stocks/comments/smn2w0/rstocks_daily_discussion_monday_feb_07_2022.json": "These daily discussions run from Monday to Friday including during our themed\nposts.\n\nSome helpful links:\n\n * Finviz [https://finviz.com/quote.ashx?t=spy] for charts, fundamentals, and\n   aggregated news on individual stocks\n * Bloomberg market news [https://www.bloomberg.com/markets]\n *…",
  "data/reddit-stocks/r/investing/comments/sn2z73/how_do_you_plan_for_retirement_when_your.json": "Basically the title …ultimately 5 out of 7 male members of the family have died\nin their mid 50s to early 60s prior to the retirement age of 67. Each died of a\ndifferent health ailment…heart attack, cancer, diabetes, liver disease…etc.\n\nAlso, since the median age of death for males is 74 in the…",
  "data/reddit-stocks/r/wallstreetbets/comments/sn2a5c/youve_heard_of_faang_but_have_you_heard_of_ligma.json": "We all know FAANG (Facebook, Amazon, Apple, Netflix, Google). Absolute\npowerhouse of an acronym in the market. What you probably aren’t aware of is the\npossibility, dare I say probability, of LIGMA (Loopring, ImmutableX, GameStop,\nMicrosoft, Apple). So far the first four are in the bag, with Apple…",
  "data/reddit-stocks/r/stocks/comments/smod3b/i_have_trouble_getting_a_clear_picture_of_a.json": "In 2015 I was somewhat aware that AMD was making a comeback but I figured I\ndidn't really know anything about how processors were made. Since the time I was\nlooking at it it's gone from a few dollars to over one hundred dollars.\n\nIn 2016 I was aware Nvidia's cards were used for crypto mining and…",
  "data/reddit-stocks/r/investing/comments/sn1kv1/whats_the_current_bear_case.json": "There was a lively discussion yesterday asking \"what's the current bull case?\"\nThis is an attempt at exploring the other side of the coin.\n\nhttps://www.reddit.com/r/investing/comments/slztfh/whats_the_current_bull_case/\n\nTop hits yesterday:\n\n\"Corporate profits are still quite healthy. There is pent…",
  "data/reddit-stocks/r/Bogleheads/comments/sn3y73/am_i_doing_this_right.json": "I just opened up a ROTH IRA with vanguard and dumped 12k into 2021 and 2022. I\npurchased 12k of VTWAX. Now I just sit and wait until 2023 and do it again?\n\nI have an HSA with Optum that I'm investing into all into VITSX. There's really\nnothing else that caught my eye but still new and reading and…",
  "data/reddit-stocks/r/stocks/comments/sn63gm/softbanks_66bn_sale_of_chip_group_arm_to_nvidia.json": "SoftBank’s $66bn sale of UK-based chip business Arm to Nvidia collapsed on\nMonday after regulators in the US, UK and EU raised serious concerns about its\neffects on competition in the global semiconductor industry, according to three\npeople with direct knowledge of the transaction.\n\nThe deal, the…",
  "data/reddit-stocks/r/stocks/comments/sn6zf7/if_i_were_too_invest_250k_into_sp_500_and.json": "Given the avg ror is 10%. I feel like even if I withdraw 7% a year the 250k\nwould grow over 20-40 years. Sure would be some negative years. Balance may read\n125k one year. But would it not end up in the green long term? So long as our\nentire world doesnt crumble. I can live off 15k a year. So…",
  "data/reddit-stocks/r/wallstreetbets/comments/sn3i8s/house_approves_safe_act_to_allow_cannabis.json": "Today, U.S. Congressional Rep. Nancy Mace discussed on Yahoo Finance\n[https://finance.yahoo.com/video/gop-congresswoman-nancy-mace-talks-195804142.html]\nabout the new congressional approval of the SAFE banking act, and the process\nfor it to continue moving forward in the Senate. Also, Mace pointed…",
  "data/reddit-stocks/r/wallstreetbets/comments/sn714h/my_girlfriend_is_one_of_us.json": "I was talking to my girlfriend, who knows absolutely nothing about the stock\nmarket, about the massive FB crash and how people lost their life savings, etc.\netc., and she replied “well, they haven’t lost anything if they haven’t sold,\nright?”. Then it hit me. She’s as retarded as I am. Time to wife…",
  "data/reddit-stocks/r/stocks/comments/sn9kap/i_think_peloton_is_going_to_tank_hard_after.json": "Everything going on with Peloton recently is suspicious. They released\npreliminary quarterly results on January 20th on their investor relation page\nwhich only gave us a peek into their coming up short on expectations. The stock\ntanked 25% subsequently.\n\nThen we conviently get rumors about a…",
  "data/reddit-stocks/r/wallstreetbets/comments/sn3vmo/with_the_influx_of_new_members_were_going_to_see.json": "Positions:\n\n500 Spy C 02/11. This is a call. A call means you call bullshit on a stock and\nthink it will crash. Use this if you think A stock is overvalued or will crash\nsoon. 02/11 is the expiration date meaning this is how long you have to hold and\nmake money. The closer it gets to the date the…",
  "data/reddit-stocks/r/stocks/comments/smyzat/can_someone_explain_to_me_why_dis_is_a_streaming.json": "So checking every analyst article on the incoming ER, everyone is talking about\nDisney Plus and comparing it to $NFLX and other streaming services. I got it, it\nis a big part of Disney effort during the pandemic, but are we just gonna ignore\neverything else $DIS owning: theme parks, resorts,…",
  "data/reddit-stocks/r/stocks/comments/sn9ymy/ceo_of_paypal_bought_share_after_drop_first_time.json": "Paypal CEO Dan Schulman bought share of paypal on feb 3rd. He bought in first\ntime in almost 2 years. He been seen selling his shares in the past. Does that\nsounds like a good move? It's always good to see insider buying. Maybe he know\nsomething or maybe he is predicting worst is over. What you…",
  "data/reddit-stocks/r/investing/comments/snbfq1/meta_says_it_may_shut_down_facebook_and_instagram.json": "https://www.cnbc.com/2022/02/07/meta-threatens-to-shut-down-facebook-and-instagram-in-europe.html\n\nRegulator headwind is damn strong. 27% of ads (20 Billion) revenue from Europe\nregion is in risk.\n\nThis might affect google as well in the future, Meta and Alphabet will have\nharder time to lobby EU…",
  "data/reddit-stocks/r/stocks/comments/snabdh/ive_heard_from_multiple_sources_that_new_home.json": "Hey everyone!\n\nDue to previous jobs I've held, I have a few friends who own residential\nconstruction companies here in the SE US. They've all been facing price\nincreases and shortages, but from conversations I've had with them recently,\nit's starting to hit a drastic turning point.\n\nLast year it…",
  "data/reddit-stocks/r/stocks/comments/smy4eh/with_the_stock_split_goog_or_googl.json": "I'm looking to get into Alphabet after the stock slit announcement but am not\nsure if I should buy GOOG (Class C) or GOOGL (Class A) shares. I know Class A\nhas voting rights.\n\nIf Alphabet does enter the Dow, would GOOGL or GOOG shares be the ones to trade\non the Dow?",
  "data/reddit-stocks/r/Bogleheads/comments/sn3f08/vanguards_core_principles_are_still_intact.json": "Just finished watching the \"Vanguard Look Ahead to 2022\" Webcast.\n\nhttps://corporate.vanguard.com/content/corporatesite/us/en/corp/articles/replay-of-live-webcast.html\n\nFor all the flak Vanguard gets for their bad customer service, lack of\ntechnology, Active Funds and venturing into Private Equity,…",
  "data/reddit-stocks/r/Bogleheads/comments/smtrh8/run_from_edward_jones_vanguard.json": "Hey everyone,\n\nSo here’s my situation. A good friend of my wife and I ( both 28) recently left\nBaird to move to Edward Jones in our town. My wife has a finance degree and\nhandles most of the day to day banking stuff, budgeting etc. and had some\nconversations with our friend about setting up some…",
  "data/reddit-stocks/r/stocks/comments/smxxs2/in_light_of_meta_crash_how_does_the_new_price_get.json": "First, just wanted to clarify that this post isn't about why Meta crashed.\nRather the question is that how does a large crash in terms of dollars ($200B)\nget decided in a matter of minutes.\n\nI don't think retail can play such a big role. So that leaves it to\ninstitutions. How do they converge upon…",
  "data/reddit-stocks/r/Bogleheads/comments/sn7gbx/quick_reminder_to_rebalance_your_play_money.json": "I know many of us keep a few % of funds on the side for riskier non-bogle\ninvestments. I adopted the BH philosophy in early 2020 and as my side funds\ncontinued to grow I would sell small amounts and buy VT, essentially to\nrebalance. With the big tech drop recently my main side stock went from $350…",
  "data/reddit-stocks/r/stocks/comments/sn94d1/facebookmeta_bulls_what_am_i_missing.json": "I am bearish on Facebook/Meta and to me, it seems like the beginning of the end\nof FB. Bulls what am I missing?\n\nHere's why I'm bearish:\n\n * FB misses earnings yet again blaming lack of ad revenue from Apple's privacy\n   update. FB needs Apple, Google, and other websites to allow tracking of\n  …",
  "data/reddit-stocks/r/stocks/comments/snhagh/peloton_ceo_john_foley_to_step_down_transition_to.json": "> Peloton plans to replace CEO John Foley and cut 2,800 jobs as it hopes to\n> restructure its business amid waning demand, according to a report in the Wall\n> Street Journal.\n> \n> Barry McCarthy, the former chief financial officer of Spotify and Netflix,\n> will become CEO and president and join…",
  "data/reddit-stocks/r/stocks/comments/snj2lt/cathie_wood_dumps_142_million_of_twitter_stock.json": "https://www.bloomberg.com/news/articles/2022-02-08/cathie-wood-dumps-142-million-of-twitter-stock-before-earnings\n\nCathie Wood stepped up selling of social media platform Twitter Inc. shares days\nbefore its earnings.\n\nWood’s firm ARK Investment Management LLC sold nearly 4 million Twitter shares\non…",
  "data/reddit-stocks/r/wallstreetbets/comments/snl3te/wish_me_luck_retards.json": "YOLO'd all the money I've saved over the past few years into $GME calls, using\n20:1 leverage. I can't see how this could possibly go wrong. If I lose this\nmoney I'm basically fucked. So yeah wish me luck guys... If I go down I will go\ndown with pride!\n\nhttps://imgur.com/a/EYQ8F4i\n\nUPDATE!!!: SOLD,…",
  "data/reddit-stocks/r/stocks/comments/sndmzr/softbanks_arm_to_ipo_buyers_beware.json": "Edit: People are very confused about how ARM licensing works. Read this\nexplanation first:\n\n> ARM licenses its ISA\n> [https://developer.arm.com/architectures/instruction-sets] and/or stock CPU\n> designs to companies. Some companies license both. They pay more. Some\n> companies only license the ISA.…",
  "data/reddit-stocks/r/investing/comments/snnxul/warren_buffett_risk_comes_from_not_knowing_what.json": "Finance people always come up with the most obscure measures of risk. Starting\nfrom using the beta of a stock to using the VIX index to measure overall risk\nand sentiment of the market, risk is defined to be something that is somehow\nquantitative and measurable.\n\nBut as one of the greatest, if not…",
  "data/reddit-stocks/r/stocks/comments/snofii/warren_buffett_risk_comes_from_not_understanding.json": "Finance people always come up with the most obscure measures of risk. Starting\nfrom using the beta of a stock to using the VIX index to measure overall risk\nand sentiment of the market, risk is defined to be something that is somehow\nquantitative and measurable.\n\nBut as one of the greatest, if not…",
  "data/reddit-stocks/r/wallstreetbets/comments/snhkyb/cathie_just_sold_half_of_her_twtr_shares_for_141m.json": "Looks like she wants to sold out TWTR holdings before earnings release. Instead\nof TWTR she bought more SE +$84.2M, RBLX +$46.2M and added more TSLA +$26.5M.\n\nTWTR earnings will be disclosed on Thursday, February 10, before the market\nopens at approximately 4:00 a.m. Pacific Time (7:00 a.m. Eastern…",
  "data/reddit-stocks/r/stocks/comments/snp3rt/consumer_debt_totals_156_trillion_after_a.json": "Consumers ended 2021 with record levels of debt, leading into a year in which\ninterest rates are expected to rise substantially. Total debt at the end of the\nyear came to $15.6 trillion, an increase of $333 billion in the fourth quarter\nand just over $1 trillion for the year, according to data…",
  "data/reddit-stocks/r/stocks/comments/sned3h/oil_giant_bp_swings_to_huge_profit_as_soaring.json": "The British energy major posted full-year underlying replacement cost profit,\nused as a proxy for net profit, of $12.8 billion. That compared with a net loss\nof $5.7 billion the previous year.\n\nAnalysts polled by Refinitiv had expected full-year net profit of $12.5 billion.\n\nBP also posted fourth…",
  "data/reddit-stocks/r/wallstreetbets/comments/snpr21/please_help_me_understand_this_insanity.json": "Hello, I’m trying to understand this retarded ass market.\n\nOkay so there’s this company called Pfizer. They have the number one drug to\ntreat a pandemic. Well it’s not just a pandemic, it’s a global pandemic. Oh yeah\nand by the way, it might be a permanent global pandemic.\n\nYeah so, a company…",
  "data/reddit-stocks/r/stocks/comments/snvyu4/corsair_crsr_reports_record_annual_revenues_of_19.json": "https://finance.yahoo.com/news/corsair-gaming-reports-fourth-quarter-211500268.html\n\nFREMONT, Calif., Feb. 08, 2022 (GLOBE NEWSWIRE) -- Corsair Gaming, Inc.\n(NASDAQ:CRSR) (“Corsair”), a leading global provider and innovator of\nhigh-performance gear for gamers and content creators, today announced…",
  "data/reddit-stocks/r/wallstreetbets/comments/sntnj4/facebook_aka_meta_i_dont_like_this_stock.json": "In fact, I hate this stock. I'm surprised people don't take this as an\nopportunity to do something good with money. This company is pure evil. And\naholes are buying into it because it has what, a discount from the last year?\nLame. Compared to 2yrs it's still up.\n\n\n\nShitty FB…",
  "data/reddit-stocks/r/wallstreetbets/comments/snx876/charlie_munger_is_doubling_down_on_baba_saying.json": "I’m not trying to be disrespectful, but if I’m ever 98 and I’m still buying\nstocks talking about them being long term plays, then please just kill me.\nSeriously, almost all of us here want to make enough money and become\nfinancially free, we want to reach a point where we don’t have to worry…",
  "data/reddit-stocks/r/stocks/comments/snh3ej/rstocks_daily_discussion_technicals_tuesday_feb.json": "This is the daily discussion, so anything stocks related is fine, but the theme\nfor today is on technical analysis (TA), but if TA is not your thing then just\nignore the theme and/or post your arguments against TA…",
  "data/reddit-stocks/r/stocks/comments/snvs29/pepsico_raises_dividend_marches_toward_dividend.json": "PepsiCo is raising its dividend once again PepsiCo will be increasing its\nquarterly dividend per share to $1.075, payable on March 31, 2022, for\nshareholders as of March 4, 2022. That will be a 5% increase from the dividend\nin the same period a year ago and consistent with PepsiCo's announcement…",
  "data/reddit-stocks/r/stocks/comments/snlhzh/thoughts_on_draftkings_with_earnings_coming_up.json": "I know they spend a ton on marketing/customer acquisition but the CEO recently\nsaid that they are starting to be profitable in some states (I don't know how).\nWith many states opening sports gambling in the near future there is potential\nupside with the company but their business plan seems to rely…",
  "data/reddit-stocks/r/wallstreetbets/comments/sny145/facebooks_been_fired_from_the_faang_group.json": "Apple did a Mortal Kombat fatality to Facebook. Facebook is dead. Apple removed\npersonalized ads from Apple phones and that is the main source of income for\nFacebook.\n\nFAANG is now MANGA (Microsoft, Apple, Netflix/Nvidia, Google, and Amazon)\n\nFacebook is dead, Apple killed facebook, less people use…",
  "data/reddit-stocks/r/wallstreetbets/comments/snvclq/sec_if_you_place_a_retail_market_order_9095_do.json": "https://www.bloomberg.com/news/videos/2022-02-03/sec-s-meme-stock-response-coming-next-week-gensler-says-video\n\nSEC Chairman, Gary Gensler, spoke on the 'plumbing' of the markets, explaining a\nmajority of retail orders are not met with buy-sale matches. Instead, they are\ncompleted in 'dark pools'…",
  "data/reddit-stocks/r/Bogleheads/comments/snx77l/what_happens_if_you_accidentally_pass_the_roths.json": "Whoops, My business did a lot better than expected this year. In January and\nFebruary I maxed out my Roth IRA for 2021. I ended the year, to my surprise,\npassing the income limits, but I already made the contributions. What do I do?\n😂",
  "data/reddit-stocks/r/Bogleheads/comments/snmwdi/what_do_wealthy_do_with_cash_not_invested.json": "Just curious what do VC's, hedge funds, and ultra wealthy do with cash (not\ngoing to invest in the market)?\n\nSaw an article that there is $5.9T of cash waiting on the sidelines for market\ncorrection/recessions... how do these people hold on to 'cash'? Or is it still\nstored somewhere like bonds and…",
  "data/reddit-stocks/r/investing/comments/so0xph/peter_lynch_far_more_money_has_been_lost_by.json": "Wanted to bring back a fantastic quote from Peter Lynch during these turbulent\ntimes in the market. I recently have seen a lot of finance \"influencers\", as you\nwould call it, and YouTubers attempting to time the market. It seems reasonable\nto do so, especially when the market has been wiggly and…",
  "data/reddit-stocks/r/Bogleheads/comments/snl4cf/am_i_over_diversified.json": "Hi all, I am a young investor and have been drafting the portfolio below for the\npast week or two. As I was already with fidelity I opted to use fidelity funds\nas they will work a bit better for me. Through my research and reading of the\nbogle bible, I may have gotten carried away with trying to…",
  "data/reddit-stocks/r/stocks/comments/so0mia/why_arent_tech_stocks_crashing_while_the_10year.json": "10 year spiked to over 1.96% today, highest since the Pandemic but all big tech\nis green, multiple zero earnings stocks are also green, while value stocks are\ndown or flat.\n\nShouldn't the huge spike have caused another tech selloff? Or is it just a\ndelayed reaction?",
  "data/reddit-stocks/r/stocks/comments/so26m6/fb_officially_worth_less_than_nvda.json": "I know this sub is primarily focused on fundamentals and typically conservative,\nbut there are some big bulls out there.\n\nCan someone explain to me how $NVDA is not overvalued out the ass as every\narticle I read see screams to buy $NVDA as it is a discount right now.\n\n\n\nCompany Market Cap TTM Rev…",
  "data/reddit-stocks/r/Bogleheads/comments/so24xy/arkk_is_now_down_over_50_in_the_last_12_months.json": "A year ago, many folks on BH were asking about tilting toward ARKK and QQQ\n[https://www.reddit.com/r/Bogleheads/comments/lj4ggq/my_portfolio_my_fomo_about_arkk/].\nMeanwhile, other folks were warning investors…",
  "data/reddit-stocks/r/stocks/comments/so0y8b/peter_lynch_far_more_money_has_been_lost_by.json": "Wanted to bring back a fantastic quote from Peter Lynch during these turbulent\ntimes in the market. I recently have seen a lot of finance \"influencers\", as you\nwould call it, and YouTubers attempting to time the market. It seems reasonable\nto do so, especially when the market has been wiggly and…",
  "data/reddit-stocks/r/stocks/comments/snwpa2/what_do_you_guys_make_of_the_earnings_report_of.json": "Financial highlights for the fourth quarter of 2021 are listed below.\n\nRecord revenue of $412.7 million\n\nGAAP gross margin of 39.6%; non-GAAP gross margin of 40.2%\n\nGAAP operating income of $57.7 million; non-GAAP operating income of $97.7\nmillion\n\nGAAP net income of $52.6 million; non-GAAP net…",
  "data/reddit-stocks/r/stocks/comments/so5ug5/history_always_repeats_itself_facebook.json": "So this sub is shitting itself as usual after a company they love drops after a\nslightly sub-par earnings report and everyone claims they were some genius who\npredicted this.\n\nFirst, I would like to say that I was one of the only people who actually called\nout how unsafe FAANG was by making a post…",
  "data/reddit-stocks/r/stocks/comments/so1rbe/i_compile_some_of_what_i_think_are_warren_buffets.json": "I guess we all know who W. Buffet is but if you don't know I advice you to go to\nhis wiki page.\n\nApologies if I mess something up. Below are interesting nuggets of investment\nadvice from the Buffet. I change a few words and commented a bit here and there.\n\n0. Actually he recommends just buying an…",
  "data/reddit-stocks/r/stocks/comments/so6zoz/how_apples_hit_on_facebook_has_been_a_decade_in.json": "I have been seeing a lot of news about privacy in general and that got me\nthinking why now, what triggered it. Reading back I found an interesting pattern\nand when I tried connecting the dots it went back to 2010 (maybe even earlier).\nSo here it goes.\n\nPrologue: If I were to simplify, there are 2…",
  "data/reddit-stocks/r/stocks/comments/snq7ud/some_free_resources_for_doing_investment_research.json": "I have been investing for the past 5 years, and have developed a set few tools\nthat I use every time I want to look into a new investment. This list is not\nexhaustive by any means but thought I would share in case it helps anyone out\n\nFree Resources:\n\n- Yahoo Finance: This is the bread and butter…",
  "data/reddit-stocks/r/stocks/comments/so8wl8/twtr_is_such_a_fail.json": "I'm glad I got out of it years ago. It's now at $35.98.\n\nIt opened at $41.65 on 11/8/2013!!!!\n\nIt's literally down 13%+ from it's open almost 9 years ago. Crazy!\n\nIt had so much potential. What a fail",
  "data/reddit-stocks/r/wallstreetbets/comments/sofgob/sick_of_the_market_makers_and_their_bullshit_i.json": "You guys want to fuck with the hedge funds and Market Makers?\nAre you sick of these 'Dark Pools'?\nAre you done with the bullshit fake shares?\nSick of Fails-to-Deliver [https://www.sec.gov/data/foiadocsfailsdatahtm] on your\nGME and AMC shares?\nSick of Payment For Order Flow?\nAre you tired of short…",
  "data/reddit-stocks/r/Bogleheads/comments/sohv1u/went_ahead_and_committed_to_fzroxfzilx_see_yall.json": "Thanks to finding this sub, I’ve gone ahead and moved my Roth which was 75/25\nVOO/QQQ to FZROX/FZILX. I’m 26, so have lots of time before retirement.\nHopefully this works like it has in history!\n\nCatch y’all in retirement.",
  "data/reddit-stocks/r/stocks/comments/sofkdu/why_is_nasdaq_climbing.json": "Why has the NASDAQ been climbing recently? Is it that fears of a Fed rate hike\nhave already been priced in, and therefore the coast is clear to go hunting for\ntech bargains?\n\nOtherwise what's the reason?",
  "data/reddit-stocks/r/stocks/comments/sojm5a/report_microsoft_in_talks_to_buy_cybersecurity.json": "Report: Microsoft in talks to buy cybersecurity giant\n[https://www.axios.com/microsoft-mandiant-tech-deals-9f431208-4529-4d13-a1b5-f407c279929d.html]\n\nMicrosoft (Nasdaq: MSFT) is in talks to buy Mandiant (Nasdaq: MNDT), a Reston,\nVa.-based cybersecurity firm with a $4.4 billion market cap, per…",
  "data/reddit-stocks/r/stocks/comments/sokwt8/she_said_itfeds_mester_doesnt_see_compelling_case.json": "The Federal Reserve doesn’t have to start hiking its policy interest rate with a\nbig 50 basis point move, said Cleveland Fed President Loretta Mester on\nWednesday. In a virtual address to the European Economics and Financial Center\nin London, Mester made clear that she supports rate hikes this…",
  "data/reddit-stocks/r/stocks/comments/so5yao/eu_launches_43bn_push_for_chip_factories_as.json": "https://www.ft.com/content/afbee42b-ba06-49c7-a053-7263e1a4c228\n\nhttps://www.independent.ie/business/technology/news/eus-11bn-aid-package-could-be-a-catalyst-for-investment-says-intel-41327414.html\n\nEurope has followed the US in setting out plans for a massive increase in\nsemiconductor…",
  "data/reddit-stocks/r/stocks/comments/soo1kn/disney_earnings_are_out_here_are_the_numbers_they.json": "Earnings per share: $1.06 adj. vs 63 cents expected, according to a Refinitiv\nsurvey of analysts\n\nRevenue: $21.82 billion vs $20.91 billion expected\n\nDisney+ total subscriptions: 129.8 million vs 125.75 million expected, according\nto StreetAccount\n\nIt’s unclear what percent the House of Mouse will…",
  "data/reddit-stocks/r/investing/comments/soiw21/with_bank_interest_rates_so_low_whats_a_better.json": "$1,000,000 investment needs to generate interest income for retirement.\n\nWhat long-term (2 year, 5 year, 10 year) options are optimal?\n\nRequirements are they must be government insured (FDIC) and risk-free.\n\nTreasury bills? Government bonds? Certificate of Deposits?\n\nOr just keep it liquid in a…",
  "data/reddit-stocks/r/investing/comments/soopt4/the_walt_disney_company_reports_first_quarter.json": "High-level from the r/stocks post\n[https://www.reddit.com/r/stocks/comments/soo1kn/disney_earnings_are_out_here_are_the_numbers_they/]:\n\nEarnings per share: $1.06 adj. vs 63 cents expected, according to a Refinitiv\nsurvey of analysts\n\nRevenue: $21.82 billion vs $20.91 billion expected\n\nDisney+…",
  "data/reddit-stocks/r/wallstreetbets/comments/sok8fy/be_careful_wall_street_could_plummet_tomorrow_on.json": "NASDAQ is hitting a resistance level after completing a fibonacci retracement,\nsignifying the continuation of an overall downtrend\n[https://preview.redd.it/qu9z7tbvmug81.png?width=896&format=png&auto=webp&s=964b39cb73957496e6e491f0f309cf3ae64278bb]\n\n\n\nCPI data coming in similarly to last month…",
  "data/reddit-stocks/r/Bogleheads/comments/soomwv/longterm_us_government_bonds_beat_the_sp_500_for.json": "I’m sure, after 25 years (ending 1999) of S&P 500 annual returns of 17.2%,\ninvestors assumed stocks would continue to beat bonds. In fact, long-term U.S.\ngovernment and corporate bonds beat the S&P 500 for the period 2000-2018.\n\nPaul Merriman",
  "data/reddit-stocks/r/stocks/comments/soi8dj/facebook_meta_average_american_generates_60_usd.json": "You know they ask if you could tell to kid about what's company doing. How in\nthe world some American chatting with friends can generate so much revenue to\nFB? What dark magic are FB doing to monetize these people so well? How it's\nsustainable as it has penetrated US already? How much other…",
  "data/reddit-stocks/r/stocks/comments/somw1o/meta_backpedalling_on_threat_to_leave_europe.json": "Meta mentioned in its last quarterly report the risks of policies in Europe and\nthe potential case of shutting down its services in Europe. This in turn lead to\na lot of negative press and discussions, while some already thought of this as\nan empty threat.\n\nAs a reaction to all the public…",
  "data/reddit-stocks/r/stocks/comments/soag4v/rstocks_daily_discussion_wednesday_feb_09_2022.json": "These daily discussions run from Monday to Friday including during our themed\nposts.\n\nSome helpful links:\n\n * Finviz [https://finviz.com/quote.ashx?t=spy] for charts, fundamentals, and\n   aggregated news on individual stocks\n * Bloomberg market news [https://www.bloomberg.com/markets]\n *…",
  "data/reddit-stocks/r/investing/comments/sol5ni/high_ps_stocks_historically_underperform.json": "Following up on this\n[https://www.reddit.com/r/investing/comments/sbc2io/number_of_midlarge_caps_with_ps_over_30/]\npost, here are a list of stocks that had a Price/Sales ratio over 20, with\nmarket cap over $10b, along with how they performed over a 1 year, 10 year and\n22 year time…",
  "data/reddit-stocks/r/wallstreetbets/comments/soqns3/roblox_earnings_is_next_week_and_nancy_pelosi_has.json": "As some of you know, the greatest investor of all time, no not Warren Buffet or\nPeter Lynch or Bill Gates, I am talking about Nancy Pelosi you bums. She has\ncalls on Roblox, which reports its earnings next Wednesday.\n\nRemember, the genius Pelosi bought calls on Google before it split, bought\nDisney…",
  "data/reddit-stocks/r/Bogleheads/comments/sokfrv/which_funds_should_i_choose.json": "I (39F) have the option to contribute to the 457 plan at work. We do not have\n401k or 403b. The only other investment I have is the Vanguard Target Retirement\nDate 2045 in my Roth IRA. If I plan to stay with the employer long time, which\nfunds should I…",
  "data/reddit-stocks/r/stocks/comments/sorh4q/after_memestock_turmoil_sec_proposes_1day.json": "Barron’s\n[https://www.barrons.com/amp/articles/meme-stock-halts-settlement-sec-51644443043]\n\nHad to blockout the symbol for the ones we cant speak\n\nIn January 2021’s frenzy of individuals trading in stocks like ____ and ____,\nbrokers and exchanges imposed halts as they struggled to keep up with…",
  "data/reddit-stocks/r/wallstreetbets/comments/sose8q/if_you_guys_think_inflation_is_bad_now_just_you.json": "I posted several months ago about how inflation will cause a downturn in the\nstock market. Too many of you autists thought that the market was a good hedge\nagainst inflation and I was wrong. Wrong! It's a good hedge against forecasted\nfuture inflation...until inflation actually affects earnings,…",
  "data/reddit-stocks/r/Bogleheads/comments/sow0vw/im_getting_clean_thank_you.json": "I'm full Bogle ... no, I'm full of Bogle. He came (in)to me in a dream last\nnight.\n\nI'm done being a WSB RETARTD. All my money is now in FSKAX/FTIHX.\n\nThat's it... forever... I'm drawing the line. I'm 25 years old and I already\nhave too many goddamn grey hairs.\n\nThis reddit has saved my present and…",
  "data/reddit-stocks/r/wallstreetbets/comments/soqt4d/calling_it_now_inflation_tomorrow_will_be_69.json": "Do they know the market is fucked, yes. They know we know the market is fucked.\nThey know that we know that they know the market is fucked. And so on. They want\ndamage control. So they will never claim its over 7.0% or the media will go ape\nshit. Even though its probably more like 15/20%, it won't…",
  "data/reddit-stocks/r/Bogleheads/comments/sov25k/treasury_bills_as_a_cd_alternative_as_interest.json": "Here's a trick you can do with your extra cash reserves beyond your emergency\nfund. This is for cash that doesn't need to stay liquid and immediately\navailable. Of course, look into Series I Savings Bonds and high-yield savings\naccounts first.\n\nThe US Treasury auctions a 52-week bill once per…",
  "data/reddit-stocks/r/Bogleheads/comments/soxb5o/should_i_sell_the_20k_i_have_in_acorns_and_put_it.json": "I just do $1000 monthly deposits into acorns as a set and forget method but I\nfeel like I should just figure out how to auto invest that in fidelity-VTI.\n\nIs it worth selling 20k and throwing it into VTI?",
  "data/reddit-stocks/r/wallstreetbets/comments/sp2fur/an_old_friend_is_back_for_more_fun.json": "I know people are sick of GME but ya'll can go fuck yourselves. Regardless of\nwhat you think of the company's future, MOASS, the cult-like hopium echo\nchamber, etc when looking at the chart over the past year, it's really hard to\ndeny that there has been some cyclical price movement. And guess…",
  "data/reddit-stocks/r/stocks/comments/sp5k0w/twitter_misses_earnings_expectations_across_the.json": "https://www.cnbc.com/2022/02/10/twitter-twtr-q4-2021-earnings.html\n\nTwitter reported earnings for the fourth quarter of 2021 Thursday that missed\nanalyst estimates on earnings, revenue and user growth.\n\nShares popped more than 8% during premarket trading.\n\nHere are the key numbers:\n\nEarnings per…",
  "data/reddit-stocks/r/investing/comments/soypae/dont_be_so_quick_to_trade_any_asset_just_because.json": "Always do your own due diligence on all the stocks, bonds, crypto, futures, etc.\n\nIt won’t take too long and is worth the time because it’s your money at stake.\n\nYou’ll also be able to differentiate which posts/comments are credible.\n\nIt’s okay to pass a tip along but be as cautious as you can…",
  "data/reddit-stocks/r/Bogleheads/comments/sp5moz/buying_new_cars_every_few_years_can_destroy_your.json": "What is your plan for this necessary depreciating asset?\n\nI buy new or near new and keep for 10 - 15 years. I also buy a reliable\naffordable car make with good resale value.\n\nDo you guys do anything to minimize the impact that vehicles have on your net\nworth?",
  "data/reddit-stocks/r/stocks/comments/sp6qce/january_consumer_inflation_expected_to_rise_by_72.json": "https://www.cnbc.com/2022/02/10/january-2022-cpi-inflation-rises-7point5percent-over-the-past-year-even-more-than-expected.html\n\nEconomists are expecting another hot inflation report, with the headline\nconsumer price index running at a 7.2% pace in January.\n\nCPI is reported Thursday at 8:30 a.m. ET…",
  "data/reddit-stocks/r/stocks/comments/sp6syn/inflation_rises_75_over_the_past_year_even_more.json": "https://www.cnbc.com/2022/02/10/january-2022-cpi-inflation-rises-7point5percent-over-the-past-year-even-more-than-expected.html\n\n\n\n\n\nConsumer prices in January surged more than expected over the past 12 months,\nindicating a worsening outlook for inflation and cementing the likelihood of\nsubstantial…",
  "data/reddit-stocks/r/investing/comments/sp70z4/us_consumer_prices_rise_75_in_january.json": "Per CNBC, the CPI rose 7.5% YoY in January, more than the expected 7.2% which\nmarks the highest level since 1982.\n\nhttps://www.cnbc.com/2022/02/10/january-2022-cpi-inflation-rises-7point5percent-over-the-past-year-even-more-than-expected.html\n\nThe biggest driver was fuel oil which rose by 9.5% in…",
  "data/reddit-stocks/r/wallstreetbets/comments/sp6qre/cpi_report_75.json": "> CONSUMER PRICE INDEX – JANUARY 2022 The Consumer Price Index for All Urban\n> Consumers (CPI-U) increased 0.6 percent in January on a seasonally adjusted\n> basis, the U.S. Bureau of Labor Statistics reported today. Over the last 12\n> months, the all items index increased 7.5 percent before…",
  "data/reddit-stocks/r/wallstreetbets/comments/spak5z/im_fucking_done.json": "Apparently I don't understand shit when it comes to stocks lol the fucking call\ncalculator told me I should b up 1k but instead I'm down nearly 80% because of\nsome bullshit thing called IV crush I do not get how puts and calls can lose\nmoney when it went up so fucking high from earnings. Whatever…",
  "data/reddit-stocks/r/stocks/comments/soydnx/serious_question_for_retail_tech_investors.json": "So I've been thinking, Is the reason that the majority of retail traders are so\noverleveraged tech stocks is because that's all that they know? Obviously new\nthings are exciting. But the majority of the USA work force today are likely\noffice workers. And they know how Microsoft, Apple, AMD, etc…",
  "data/reddit-stocks/r/stocks/comments/sp3ku8/rstocks_daily_discussion_options_trading_thursday.json": "This is the daily discussion, so anything stocks related is fine, but the theme\nfor today is on stock options, but if options aren't your thing then just ignore\nthe theme and/or post your arguments against options…",
  "data/reddit-stocks/r/wallstreetbets/comments/spfed0/largest_bet_in_wsb_history_sava_3012196439.json": "All opinions expressed in this post are our own. The statements do not\nconstitute financial or medical advice, and please do your own DD. This post\nwill be updated every three months with position performance information and\nupdated due diligence. Please follow!\n\nThis post shall remain exclusive to…",
  "data/reddit-stocks/r/stocks/comments/spiijg/cloudflare_crushes_earnings.json": "Cloudflare, one of reddit most mentioned companies last couple of years has\ngreat earnings.\n\nFor the full year, the company saw a revenue of $656.4 million, a 52%\nyear-over-year increase, and a non-GAAP net loss of $15.1 million. In Q1,\nCloudflare expects a revenue between $205 million and $206…",
  "data/reddit-stocks/r/stocks/comments/spg8gh/anyone_else_bullish_on_nvda_earnings_report.json": "Nvda got beat down pretty hard with the rest of the tech stocks, but I feel like\nin the long run it will be a winner because it’s technological advantage over\nother GPU makers and their innovation is so strong.\n\nBefore every earnings report with NVDA I always am bullish and this stock is my\nbiggest…",
  "data/reddit-stocks/r/stocks/comments/spfvpl/affirm_drops_on_tweetsomeone_explain.json": "Media is reporting that AFRM dropped 26% because of an early tweet...that said\nthat the earnings report BEAT expectations.\n\n\n\nDoesn't it stand to reason that the stock price would shoot up? This actually\nhelped my options, but I'm still curious as to why this would make the stock\ndrop?",
  "data/reddit-stocks/r/investing/comments/sphws7/affirm_earnings_blunder_afrm_accidentally.json": "AFRM was planning to release earnings at 4:00 PM On Feb 10, 2022 – after market\nclose. They accidentally sent out a tweet summarizing their earnings, 2 hours\nearly.\n\nThis was picked up on Twitter and the markets started to freak out. I’ve\noutlined what happened in the following timeline – note all…",
  "data/reddit-stocks/r/stocks/comments/sowg19/block_inctick_sq_will_apples_tap_to_pay.json": "I have been observing Block's stock for a while, and I think it is at an\nattractive pricepoint, last seen in Q3 2020; as it has dropped over 50% since\nits peak.\n\nBut, now I'm having doubts over its longer-term growth and viability because of\nApple.\n\nApple recently introduced a Tap-To-Pay function…",
  "data/reddit-stocks/r/stocks/comments/spk7xj/the_fed_raising_interest_rates_is_nothing_more.json": "The core issue is that inflation this time around does not have much to do with\npressures that have historically led to inflation. If Fed quantitative easing\npolicy had anything substantial to do with current inflation we would not be\nseeing local inflation around the world in almost every single…",
  "data/reddit-stocks/r/Bogleheads/comments/splmm8/if_my_24yo_goal_is_to_retire_early_should_i_put.json": "I have extra money each month now that my student loans are paid off and believe\nI want to invest most of it going forward, but I'd like to hear opinions on\nwhere I should put it.\n\nIf I want to retire before age 60, would it make more sense to open a brokerage\naccount and put money there since a…",
  "data/reddit-stocks/r/Bogleheads/comments/spj10m/vanguard_3fund_portfolio_bond_fund_recommendations.json": "I know most people recommend BND as the bond fund to use in a Vnagyard 3-fund\nportfolio, but wanted to see if other people had different recommendations?\nLooking for solid long term options as I’m currently in my 20s. Thanks !",
  "data/reddit-stocks/r/stocks/comments/spom4u/should_i_invest_now_or_wait_until_mid_march_once.json": "I'm wanting to invest a reasonable sum of money into the stock market, and i'm\nwanting to know what people's thoughts are on the best time to invest it.\n\nPrices are already very low on particular stocks, including some growth stocks,\nbut with the FED due to increase interest rates next month in…",
  "data/reddit-stocks/r/Bogleheads/comments/spllmx/should_i_draw_social_security_at_62_or_70.json": "I'm turning 62 this year, and thinking about when to draw SS. Right now, I'm\nleaning towards drawing it this year. Here's my reasoning: Most of my\nbrothers-in-laws died in their 50's & 60's. Dad only made it to 62, and never\ngot a dime from SS. I just get a nagging feeling that I may not live a…",
  "data/reddit-stocks/r/wallstreetbets/comments/spfhxn/afrm_affirm_just_did_the_biggest_rug_pull_of_the.json": "Affirm stock got halted instantly upon releasing its ACTUAL earnings!!\n\nAs y’all know they tweeted a “Q2 report” sent accidentally and removed quickly.\n\nInvestors piled up to buy affirm stocks only for them to finally release their\nearnings at a -0.57 eps vs -0.40+ estimate.\n\n$AFRM earnings:\n\nRev:…",
  "data/reddit-stocks/r/stocks/comments/spyey7/the_fed_needs_to_fix_inflation_at_all_costs.json": "It doesn't matter that the market will crash. This isn't a choice anymore, they\ncan only kick the can down the road for so long. This is hurting the average\nperson severely, there is already a lot of uproar. This isn't getting better,\nthey have to act.",
  "data/reddit-stocks/r/Bogleheads/comments/sptjkl/anybody_else_get_screwed_with_the_huge_tax_bill.json": "https://www.wsj.com/articles/vanguard-target-retirement-tax-bill-surprise-11642781228\n\nApparently if you have TR funds in taxable accounts, you got screwed.\n\nMy tax bill is like $30K bigger cuz of this.",
  "data/reddit-stocks/r/Bogleheads/comments/spzogp/where_to_put_money_after_savings.json": "So I currently put away 20% towards retirement (Roth Ira -> HSA -> 401k). The\nrest is budgeted for monthly expenses/use. I live pretty frugally and am often\nunder budget each month anywhere between an extra $1k-2k. Where is the best\nplace to keep that money? Is it best to just keep it in a HYSA?…",
  "data/reddit-stocks/r/wallstreetbets/comments/sptm41/how_to_turn_25k_into_750k.json": "Hi apes and retards, I wanted to share a method I have used to take a $25k\naccount and turn it into $750k. This is not financial advice, but was hoping it\nmight be useful to some of you out there posting massive loss porn and blown up\naccounts.\n\nStep 1: Deposit $25k into trading account. Find your…",
  "data/reddit-stocks/r/investing/comments/spyt9g/alibaba_bad_sentiment_you_see_it_a_lot_so_lets.json": "If you have critics or don't agree would love to hear it in the comments. This\nis from a long-term investing view, if you have a different approach that is\nfine.\n\nEdit: This is a short version of the write-ups I myself write.\n\nAlibaba - Write Up\n\n 1. Business Model:\n\nAlibaba is a diversified…",
  "data/reddit-stocks/r/investing/comments/sq1htr/would_it_be_illegal_for_google_to_trade_stocks.json": "Some examples:\n\n * Google News detects a huge surge in search for stories about a specific\n   product.\n\n * Google's satellite imaging subsidiary captures surface images around the\n   earth. Uses AI to predict weather patterns and then trade oil futures based\n   on it.\n\n * Google search engine sees…",
  "data/reddit-stocks/r/wallstreetbets/comments/spogl2/is_it_too_much_to_ask_for_just_a_5000_yolo_return.json": "It seems like every time I yolo I break even or lose 99%. Other Redditers always\npost million dollar gains on stupid bets. Why can’t a nice guy like me ever get\njust a 5000% return on a yolo? Nice guys always finish last while the chads like\nDFV make bank and tons of pussycat. He’s not even a cat!…",
  "data/reddit-stocks/r/wallstreetbets/comments/sq4ai8/fuck_wsb_and_reddit_im_fucking_outtro.json": "For a long time I loved the forum, loved the loss porn, loved the gain porn and\nunrealistic, survivor bias trade ideas it gave me, but I'm fucking out.\n\nMy mind is being polluted by you retards and it's fucking up my trading style.\n\nMy breaking point: today. I planned out a short trade all night,…",
  "data/reddit-stocks/r/stocks/comments/sq62oa/russia_could_hit_us_chip_industry_white_house.json": "For those like me wondering why semis are getting hit particularly hard today.\n\nWASHINGTON, Feb 11 (Reuters) - The White House is warning the chip industry to\ndiversify its supply chain in case Russia retaliates against threatened U.S.\nexport curbs by blocking access to key materials, people…",
  "data/reddit-stocks/r/wallstreetbets/comments/sq6u73/putin_planning_on_invading_russia_next_week.json": "TITLE TYPO: MEANT TO SAY UKRAINE\n\nCheck the following Twitter accounts: nickschifrin and bnonews\n\nU.S. Intelligence believes Putin may be planning to invade Ukraine as soon as\nnext week. SPY dropped about a half a percent just after this news came out.\nThis and the fact that minutes from the…",
  "data/reddit-stocks/r/wallstreetbets/comments/sq3m6k/does_any_broker_allow_trading_pasts.json": "I've been looking into getting into futures trading but the problem is it seems\nlike all the prices are dependent on things that haven't happened yet. I have no\nidea how to predict the future so I dunno how anyone makes money on that. But I\nwas wondering since there are futures, are there pasts…",
  "data/reddit-stocks/r/stocks/comments/sq7an3/insider_sell_advanced_micro_devices_amd.json": "Advanced Micro Devices (AMD) shares slipped nearly 9% in Friday afternoon\ntrading after CFO Devinder Kumar sold 28,964 shares in the company for $3.5\nmillion.\n\nVolume at 2.15 pm ET was up over 106 million, versus an average of 70 million.\n\nPrice: 115.13, Change: -10.64, Percent Change: -8.46",
  "data/reddit-stocks/r/stocks/comments/sqb1e8/why_is_there_so_much_inflation_what_happened.json": "I have a very basic understanding of economics (supply & demand, printing more\nmoney devalues currency, opportunity cost & gdp) but I haven't been able to wrap\nmy head around what's currently going on in the economy. What does it even mean\nto \"raise rates\" or whatever the Federal Reserve is doing?",
  "data/reddit-stocks/r/investing/comments/sqb4el/why_has_it_taken_lawmakers_this_long_to_start_a.json": "There was a law passed a decade ago that required them to make a report on the\nindividual stocks they buy within 45 days of purchasing, but there’s been\nnumerous reports of these filings taking 6+ months or never being reported at\nall. Basically legislators are inside trading and nobody has done…",
  "data/reddit-stocks/r/wallstreetbets/comments/sqav35/ryan_cohen_on_twitter.json": "\"The reverberations of fiscal and monetary policy are likely to be more severe\nto humans than any climate or societal disaster 💀\"\n\nhttps://twitter.com/ryancohen/status/1492254050661847044?t=A6qjHnJt1SSSiT86qdNqjw&s=19\n\nHoly F we are getting close. Inflation, bond markets, Russia Ukraine,…",
  "data/reddit-stocks/r/Bogleheads/comments/sqd7x7/so_grateful_a_random_thread_in_rstocks_three.json": "Just want to say thank you, been a lurker for roughly 3 years since I started\ncollege and while pursuing my engineering degree, I have been putting my extra\nmoney into VTI and never really worrying about the stock market.\n\nThe past two weeks my roommate asked me if I wanted to do a 1k to 10k…",
  "data/reddit-stocks/r/stocks/comments/spwd0u/rstocks_daily_discussion_fundamentals_friday_feb.json": "This is the daily discussion, so anything stocks related is fine, but the theme\nfor today is on fundamentals, but if fundamentals aren't your thing then just\nignore the theme and/or post your arguments against fundamentals…",
  "data/reddit-stocks/r/investing/comments/sq8c7c/the_yield_curve_inverting_and_what_useful_info_it.json": "TL;DR: The yield curve may invert by summer of this year, pointing to a\nrecession in 2023. And history suggests that in \"bubbly\" markets like we have\ntoday, market peaks happen when the yield curve inverts. This may offer useful\nsigns to watch for to know when to run for the hills.\n\nGraph 1…",
  "data/reddit-stocks/r/wallstreetbets/comments/sqclkl/papa_putin_is_not_going_to_invade_ukraine_you.json": "That's right, Uncle Putin is nothing short of a giant bear trap. A big Russian\nbear trap.\n\nStop putting your money into puts as though Putin is gonna somehow launch an\ninvasion and tank the entire market.\n\nI'm gonna tell you why, so listen up you mouth breathing clowns.\n\n1 - I bet the majority of…",
  "data/reddit-stocks/r/stocks/comments/sq0nno/whats_the_most_misleading_fact_about_a_stock.json": "It could be its moat, past performance, revenue growth, dividend, technology\nadvantage , you get it. In my opinion, the PE, price to earnings ratio, it's the\nmain one. However the orthodox ones and fans of Graham and Buffet will probably\ndisagree. You are welcome to agree and you are also free to…",
  "data/reddit-stocks/r/stocks/comments/sqhbbh/acting_on_the_dip.json": "Since almost everything went on sale today, what stocks would you tell new\ninvestors to buy Monday and hold for a while? I’ve actually been investing for a\nlittle over a year and about 65% of my portfolio is in index funds, but I’m\nwondering what stocks would be good to open positions in right…",
  "data/reddit-stocks/r/stocks/comments/spwjxn/buying_paypal_now_dip_or_mistake.json": "Hy!\n\nI entered trading in late December last year, mainly buying tech stocks and\nafter reading many many articles i chose to invest into . I bought a few dozens\nof PYPL stocks at 198$, of course buying a few more when i thought \"its a dip\"\nand ultimately im around -28% so far on the stock. Of…",
  "data/reddit-stocks/r/stocks/comments/sq74vn/about_to_unleash_a_huge_portion_of_my_money_on.json": "Hello!! I am a young COVID investor that is now on the 3rd year of investing\n(still a noob). Just wanted to come and ask the smarter people here to see if\nthis was a smart or stupid move. I know the market has been pretty crazy with\nthe fed rates and now Putin threatening war against the world, but…",
  "data/reddit-stocks/r/stocks/comments/sq90l4/fundamental_analysis_and_valuation_of_airbnb.json": "Airbnb went public on December 10th, 2020, which is not that long time ago. The\nIPO price was $68/share and on the first day, it opened at $146. This already\npoints to the fear of missing out to invest in a company that disrupts an\nindustry as the demand was incredibly high.\n\nIn this relatively…",
  "data/reddit-stocks/r/investing/comments/sqcvfj/is_there_any_good_reason_sp600_small_caps_with.json": "SP500 is near all time highs from a P/E ratio standpoint.\n\nSP600 is near all time lows from a P/E ratio standpoint.\n\nAnybody have a good reason why, or is there just a massive market mispricing?\n\nSource: https://www.yardeni.com/pub/stockmktperatio.pdf",
  "data/reddit-stocks/r/wallstreetbets/comments/sq8b2i/could_the_russian_government_bet_against_the.json": "For real though, what are the actual limitations for if Putin and the gov bought\nlike $5B in puts before invading Ukraine? Are the limitations liquidity, legal\nissues, or something else?\n\nI’m sure the gov could create a program where it funnels money through\n“ordinary” citizens to buy puts or short…",
  "data/reddit-stocks/r/Bogleheads/comments/sqna5x/statistics_show_that_over_15_years_only_10_of.json": "Hello everyone I always only glance the comparisons of active to funds to the\ns&p500 or world index. I understand that active funds perform worse generally\nbecause of the timing and high TER‏‏‎‏‏‎‏‏‎‏‏‎­that comes with active\nmanagement. Ive been wondering if someone saw studies that compares long…",
  "data/reddit-stocks/r/investing/comments/sqou5g/strategy_on_investing_200k_in_this_market.json": "TLDR: So, you’ve got $200,000 in cash and you must invest all of it (or want to)\nin 12 months. How do you invest it? Especially considering this year coming up?\nRising rates, covid backlash, Ukrainian invasion fears, etc. DCA or all at once?\n\nSo I recently inherited some money, it’s about $200,000…",
  "data/reddit-stocks/r/stocks/comments/sqsosz/fed_emergency_meeting_this_monday.json": "Not sure how this seems to be completely overlooked going into the weekend.\nEmergency meeting Valentine's Day to discuss rates.\n\nhttps://www.federalreserve.gov/aboutthefed/boardmeetings/20220214closed.htm\n\nGiven the current sentiment that the Fed is way behind the curve on inflation, I\nsee a…",
  "data/reddit-stocks/r/Bogleheads/comments/sqt0ti/just_lumpsum_100k_or_keep_some_in_cash_for.json": "Hi everyone,\n\nI came across this forum and the investing forum around 2 months ago. Since then\ni read various recommended books and decided to lump-sum 35k of my savings into\nthe Vanguard All-world ETF around 2 weeks ago. I have created an emergency fund\nand plan to invest around 60% of my monthly…",
  "data/reddit-stocks/r/stocks/comments/sqvm4k/anyone_else_think_the_dip_on_semiconductors_will.json": "Two major catalysts playing out for semis right now:\n\n * Fed raising rates.\n * Russia sanctions and possible invasion cutting off key semiconductor\n   materials\n   [https://www.reuters.com/technology/white-house-tells-chip-industry-brace-russian-supply-disruptions-2022-02-11/].\n\nIn the next few…",
  "data/reddit-stocks/r/Bogleheads/comments/squw6k/passive_index_investor_returns_versus_the_passive.json": "I was wondering if anyone had access to an article or white paper comparing the\naverage index investor’s returns to the returns of the ETFs themselves.\n\nIf index investors are adding to their holdings fairly regularly, they would\nnecessarily have lower returns as the ETF returns because not all the…",
  "data/reddit-stocks/r/Bogleheads/comments/sqrn14/should_i_open_an_hsa.json": "I'm 29 years old with no health issues. I make about 50k/yr, I already max out\nmy Traditional IRA every year, and I don't have a 401k through my employer. Is\nan HSA right for me? And I currently have all my investments with Vanguard--can\nI open an HSA with them too? Any additional info is welcome…",
  "data/reddit-stocks/r/stocks/comments/sqwik9/the_6_month_return_on_the_indexes_have_been_flat.json": "I had been looking at the 1 year and 5 year chart on SPY/VOO indexes. I today\njust decided to see 6 months and saw they are actually in the red/flat since\nAugust 12th. I didnt even notice we were in a sideways market for index fund\ninvesting if you bought and hold since August 2021.",
  "data/reddit-stocks/r/investing/comments/sqzcje/the_russiaukraine_situation_is_going_to_be_a.json": "Jim Cramer: \"Russia-Ukraine situation is dire, and could have serious\nconsequences.\"\n\nKnowing his track record we all know how this is going to turn out. Inverse\nCramer is always right.\n\nSo thank you Jim Cramer for helping us avoid World War III, and now we investors\ncan get back to focusing on…",
  "data/reddit-stocks/r/stocks/comments/sqqcbn/a_look_on_the_bright_side.json": "Between inflation concerns, rate increases and Russia/Ukraine there is plenty of\ncatalysts to be cautious of for the market. But there’s always two sides so I\nwanted to take a look at some of the positives we have seen in the market\nrecently:\n\nWhile some companies have been hit by earnings overall…",
  "data/reddit-stocks/r/stocks/comments/sqm5xp/pltr_anyone_here_an_enduser_for_palantirs_tech.json": "At the current prices, I would consider opening up a position however I am a bit\nunsure about how sticky and replaceable their services are especially within the\nEnterprise side of the business. I know they do well with Govt contracts.",
  "data/reddit-stocks/r/Bogleheads/comments/sr0xj5/you_cant_time_the_market_no_not_even_in_your.json": "Nope. Not even then.\n\nOne of the foundational principles of Boglehead investing is to never try and\ntime the market. There is plenty of evidence to back this up. People with\nbillions of dollars seem to try and do it and they seem to do no better than\nyour average Joe sticking their money into a…",
  "data/reddit-stocks/r/investing/comments/sqwmh1/anyone_here_invest_in_equipment_that_generates.json": "Some ideas I've heard of include:\n\n * Vending machines.\n * Power washers.\n * Drone photography.\n * 3D camera (like real estate photography)\n * Car for Uber counts I guess.\n\nI have some capital saved. And was wondering if there's equipment you can buy\nwhich then you can use to start a small business…",
  "data/reddit-stocks/r/investing/comments/sr0m7v/traders_pricing_seven_fed_hikes_this_year.json": "https://www.bloomberg.com/news/articles/2022-02-10/traders-now-betting-at-least-one-fed-hike-will-be-supersized\n\nIn the last few days the bond markets have gone from expecting one 25 basis rate\nhike by the next scheduled FOMC meeting, to almost certainty that there will be\na 50 basis rate hike by…",
  "data/reddit-stocks/r/Bogleheads/comments/sr69u6/vanguard_tdfs_fees_reduced.json": "We've all seen the articles (e.g., link\n[https://www.morningstar.com/articles/1060440/vanguard-cuts-target-date-fund-fees-as-fidelity-continues-to-gain-momentum])...\n\nWell, today's the day, ladies and gentleman. The new, lower fees are in effect:\n\nhttps://investor.vanguard.com/mutual…",
  "data/reddit-stocks/r/Bogleheads/comments/sqxn7g/i_have_140k_just_sitting_in_regular_savings_how.json": "I plan on keeping about $20k in the savings account for an emergency fund. $10k\nwill be buying iBonds. ~$2k will be in checking just for pleasure.\n\nI don't plan on buying a house, but I want to have the money just in case I\ndecide to buy within 5 years. Thing is, how much should I be saving for? I…",
  "data/reddit-stocks/r/stocks/comments/sr65at/long_time_investors_with_still_more_time_on_your.json": "I’ve been investing for a while and always curious what others are thinking in\ntimes like these. I started right before the 99/2000 dot.com bust and been\nthrough the fall of ‘08. Those were crazy moments investment wise, but I stuck\nwith it. Before the last election, when no one knew what was going…",
  "data/reddit-stocks/r/wallstreetbets/comments/sr3rp2/fuck_wsb_i_quit.json": "My wife is sleeping with my dad, both of my kids are my brothers.\n\nI am addicted to porn, and keep thinking the next trade will be the one that\nchanges things…\n\nI thought I could look up to you lot. I really did. You are all Chads banging\ncoke off a strippers 8 ball.\n\nI never seem to get it right,…",
  "data/reddit-stocks/r/stocks/comments/sr7n3j/intel_launches_blockchain_chip_to_tap_crypto_boom.json": "INTC launches new ASIC mining chips that will add billions in revenue over many\nyears.\n\nhttps://finance.yahoo.com/news/intel-launches-blockchain-chip-tap-181406115.html\n\nIntel Corp on Friday launched a new chip for blockchain applications such as\nBitcoin mining and minting NFTs to cash in on the…",
  "data/reddit-stocks/r/stocks/comments/sr7t6h/5_stocks_to_hold_for_life.json": "As the titles reads, I want to have a discussion on the 5 stocks or so to hold\nfor life. If you have less than 5 I want to hear them and if you have more than\n5 I would like to hear that too. I understand everyone has their usual Apple,\nMicrosoft, and Google stocks they plan to hold onto for the…",
  "data/reddit-stocks/r/investing/comments/sqrcr4/how_much_will_i_bond_rates_rise_as_benchmark.json": "In addition to their inflation-based rates, I bonds also carry a fixed interest\nrate that is currently close to negligible. How will the fixed portion of I bond\nrates change as the Fed raises benchmark rates? Does a .50 hike by the Fed\ntranslate to a .50 hike to the fixed rate in an I bond?\n\nAnd if…",
  "data/reddit-stocks/r/stocks/comments/srb7ha/going_to_allocate_large_percentage_of_roth_ira_to.json": "For right now, I’m waiting for a true correction in the upwards direction before\nentry, it’s kinda uncertain right now IMO. As for actual allocation, probably at\nleast half of Roth IRA portfolio.\n\nTQQQ is diversified, top 100 NASDAQ listings. Its leveraged, 3x the legendary\nQQQ. It’s up 13,000% in…",
  "data/reddit-stocks/r/stocks/comments/sr0zim/what_highgrowth_highmultiple_tech_stocks_are_you.json": "I know these companies are unattractive for a lot of people given higher\ninterest rates, high valuations, et al and if they don't fit your investment\ncriteria today that's fine. Instead this post are for those who are interested\nin these kinds of companies. If you're interested, what are you…",
  "data/reddit-stocks/r/stocks/comments/srgg6b/investing_in_green_energy_has_been_a_big_mistake.json": "Many of these stocks (wind; solar; biofuel;...) are down 90% from their ATH and\nfeel as good as dead now. Like many I believed Biden would have given those a\nbump with his BBB-plans but they are just continuing to go down.\n\nI fell for the \"market is forwarding looking\" meme but the market as it…",
  "data/reddit-stocks/r/investing/comments/srlt1v/amazon_147b_free_cash_flow.json": "https://i.imgur.com/2v4190H.png\n\nSource: Fidelity Research Compare Tool\n\nAmazon has been spending a lot of their income in operating expenses and CapEx.\nWhen do you think will the company start having positive free cash flow and pay\noff its debt, like the rest of the top megacaps?",
  "data/reddit-stocks/r/stocks/comments/srk4ex/folks_we_are_on_our_own.json": "I have always contended that analysts' ratings are crap. I've written and talked\nabout this for years. Yet, somehow, I am supposed to care what some backroom\nnumber cruncher thinks. So here is a thought experiment. I decided what the\naverage rating was for each constituent of the NASDAQ 100 on…",
  "data/reddit-stocks/r/stocks/comments/srn05e/why_should_a_war_in_ukraine_cause_significant.json": "The top market cap companies in the S&P500 are companies like FAAMNG. None of\ntheir business has anything to do with what's going on in Ukraine. Of course\nit's possible, that a war would cause energy prices to rise even higher, which\ncould indirectly cause people to buy less iPhones or stuff on…",
  "data/reddit-stocks/r/stocks/comments/srmnsc/look_beyond_the_now_of_the_ukraine_and_fed_news.json": "I'll make this short and you may do with this what you may. Every year or so we\nhave a Russia/China/Iran geopolitically flare up. And the market reactions are\nnearly identical.\n\nFrom my review, it appears the market may enter another phase of \"irrational\"\nbuying for the next month or two. VIX just…",
  "data/reddit-stocks/r/stocks/comments/srrn7f/how_long_have_you_been_trading_in_the_market_are.json": "I can't help but see so much discourse about what's going to/ what's happening\nto the market as of late. My question to you all is, how long have you been in\nthe market and what your take is on everything that's happening?",
  "data/reddit-stocks/r/Bogleheads/comments/srxqr4/added_international_exposure_to_my_portfolio.json": "I learned about sound investing early 2021. I saw the news headlines about\ndogecoin, memestocks, etc. I had no clue what investing was, just thought you\nhad to be a good stock picker. I reached out to a good friend and he introduced\nme to The Simple Path to Wealth by JL Collins.\n\nIf you’ve read the…",
  "data/reddit-stocks/r/wallstreetbets/comments/sru1mw/moderna_ceo_dumps_stock_and_deletes_twitter.json": "$MRNA CEO, Stephen Bancel, recently deleted his Twitter account. Over the past 2\nyears he has sold over $400 million on stock. We will look at MRNAs price over\nthe last 5 years, insider selling over this time period, and what a deleted\nTwitter account might indicate.\n\n\nMRNA…",
  "data/reddit-stocks/r/wallstreetbets/comments/srwm6o/the_super_bowl_just_had_commercial_making_fun_of.json": "This subreddit has enough relevance for an Etrade commercial to mention how\npeople are getting stock advice from “memes.”\n\nIncase you didn’t understand and my text isn’t long enough for the post here it\nis again.\n\nThis subreddit has enough relevance for an Etrade commercial to mention how\npeople…",
  "data/reddit-stocks/r/stocks/comments/srsp53/how_to_make_money_off_of_our_impending_doom.json": "Hello all, I am wondering if anyone can list the ways we can all make money off\nof the impending downturn in the market. Things I have read about are shorts,\nputs, the volatility index, futures, and inverse ETFs. I am however a noob with\nall of this stuff. I have questions that if answered by…",
  "data/reddit-stocks/r/investing/comments/ss2ta8/amateur_question_why_is_everyone_so_worried_about.json": "Further, what completely boggles my mind is that if inflation is high, why are\npeople pulling money out of the market? That's a good way to absolutely ensure\nyour dollar is worth less a day, week, month and year down the road.\n\nI'm obviously missing some logic or something deeper, but market…",
  "data/reddit-stocks/r/stocks/comments/srxoh6/what_are_some_stocks_you_sold_too_early.json": "The more I invest, the more I feel that you will lose more by selling than\nholding.\n\nI think if you just let a position run for years (decades) you are better off\nthan selling early. This works as long as you have a reasonable number of\npositions (15-20) that are almost equally weighted or not too…",
  "data/reddit-stocks/r/stocks/comments/srnhd6/investing_in_green_energy_was_the_best_decision.json": "I got into investing about a decade ago and the first thing I did was research\nfor weeks. I thought that I should invest in things that I cared about so I\nresearched all the apps, products and services I used. When I was about to make\na decision on the regular F500 there was something missing.…",
  "data/reddit-stocks/r/stocks/comments/ss69go/do_you_think_the_stockmarket_aka_the_big_indexes.json": "Basically the title. I want some thoughts on whenever you personally deem it\npossible/likely that a proper crash/bear market may take us down to the levels\nwe were at during January/first half of February of 2020.",
  "data/reddit-stocks/r/stocks/comments/ss5w5r/big_cloud_winner_will_be_based_on_who_can_make.json": "In the past, AMD and Intel made all the server chips. There's very little to\ndifferentiate between AWS, Google Cloud, Azure except for scale and execution.\nThey all ran the exact same Intel Xeon and AMD Epyc chips.\n\nThat all changed when Amazon started prioritizing their Graviton2 ARM chip.…",
  "data/reddit-stocks/r/stocks/comments/ssb4hj/fed_says_it_has_to_front_load_rate_hikes_to_stave.json": "St Louis Fed president says\n[https://www.cnbc.com/2022/02/14/bullard-say-the-fed-needs-to-front-load-tightening-because-inflation-is-possibly-accelerating.html]\nFed has to front load hikes as inflation is accelerating. Why don't they simply\nshut up and announce a half point , or 3/4 point hike? Is…",
  "data/reddit-stocks/r/wallstreetbets/comments/ss21fi/etrade_just_told_us_all_how_much_they_think_of.json": "That advertisement that they paid millions for, just mocked a few million\nAmerican investors for believing in their decision to buy shares with their own\nmoney.\n\nEveryday humans who decided to rally against something significant and broken,\nput their money, not someone else’s - into a cause and the…",
  "data/reddit-stocks/r/stocks/comments/srudyw/who_will_have_the_best_earnings_calls_this_week.json": "It seems due to the market bear nature and uncertainty any good earnings results\nin a large after hour/pre market pop and any week earnings results in a big\nloss. This week I have my eye on Roblox and NVDIDA. I know Nvidia is making\nmoney but is Roblox?",
  "data/reddit-stocks/r/stocks/comments/ss2ap8/advice_needed_as_a_confused_20yo.json": "Hi everyone, its been about half a year since i started investing, and i have to\nadmit there were a lot of times where i bought hype stocks because they seemed\npopular on this thread and bogleheads. However, now, certain stocks like PLTR\nare down 50% and reddit comments seem to suggest it wasnt a…",
  "data/reddit-stocks/r/stocks/comments/ssbmd7/inflation_already_happened_stopping_it_from_going.json": "Do you guys think they are going to reduce minimum wage again after they \"fix\"\ninflation? Nope. Are the prices of hamburgers going to go back down to levels\nthey were before the inflation? no. The only thing that can happen now is\nreducing how much farther we go. Once things start going up, they…",
  "data/reddit-stocks/r/Bogleheads/comments/srool7/roth_ira_portfolio_advice.json": "My wife and I recently opened Roth IRA accounts via Vanguard. We each\ncontributed the $6000 for 2021 and will do the same for 2022 soon. My wife is 31\nand is 100% hands off, I'm 34 and learning the ropes regarding retirement\naccounts.\n\nFor my wife's account, I put 100% into VT since I believe it…",
  "data/reddit-stocks/r/Bogleheads/comments/ssbvwj/anything_im_missing.json": " * Paid off all debt\n\n * Max contribution to Roth IRA (current company doesn’t offer a 401K)\n\n * HYSA for emergency funds/savings\n\n * $10K in I Bonds as another form of savings with money I don’t need this year\n\n * 100% stock portfolio in VT\n\n * Monthly contributions to VT",
  "data/reddit-stocks/r/wallstreetbets/comments/ssd6sa/positions_or_ban_lets_take_a_poll_you_pussy_mods.json": "Bring back positions or ban! It's a simple check to prevent these bullshit posts\nof pumping and dumping followed by the same bullshit comment of \"why do you like\nthis stock\" or \"are you just a shill\"?\n\nPut some fucking skin in the game, otherwise, this is just 15-year-olds\ncircle-jerking like the…",
  "data/reddit-stocks/r/stocks/comments/ssep5f/amds_49_billion_xilinx_deal_closes_company_names.json": "Advanced Micro Devices Inc. shares AMD, 4.31% are up nearly 3% in Monday trading\nafter the chipmaker announced that its $49 billion deal for Xilinx has\nofficially closed. AMD also said that Chief Executive Lisa Su has been appointed\nthe chair of the company's board, while John Caldwell, the prior…",
  "data/reddit-stocks/r/stocks/comments/sshe2s/why_do_stocks_go_down_around_1pm.json": "In my two years now of following the stock market literally every single day\nI've noticed a pattern of around 1pm stocks seem to go down a little.\n\nWhat causes this?\n\nI'm not sure it happens every day, but I notice it quite a bit at around 1pm or\nso.\n\nFor example on a rally day, stocks will rally…",
  "data/reddit-stocks/r/Bogleheads/comments/sshr5i/is_the_boglehead_strategy_for_retirement.json": "I’ve been following this sub for a few weeks and see most of the investing\ndiscussion leaning towards investing for retirement. What about if you’re\nyounger and investing to eventually buy a home etc?",
  "data/reddit-stocks/r/investing/comments/ssjlul/is_spy_the_gold_standard_for_longterm_investing.json": "I just inherited approximately $50,000 and I was planning to put it into SPY.\nBut I looked at QQQ and noticed that it has better returns over longer time\nperiods. SPY beats it over the last year, but QQQ does better over the last 2\nyears and does better and better the further back you go.\n\nSince…",
  "data/reddit-stocks/r/investing/comments/ss1ooz/forgotten_account_ing_investing_20112012.json": "Around 2011-2012 I had started one of those halfway decent savings accounts with\nING, and decided to also goof around with some dumping $10-20 here and there\ninto penny stocks. Some went belly-up (as expected) but I have no idea what\nhappened with the other stocks in that account. I know ING got…",
  "data/reddit-stocks/r/wallstreetbets/comments/ssdtet/the_fed_will_boost_stocks_russia_wont_invade_and.json": "The fed will likely announce an emergency rate hike of basically nothing. Maybe\n0.5%. This will signal to the world that Jpow still isn't going to do what it\ntakes to deal with inflation and we're going to continue to not address the\nproblems and that means the bull run continues.\n\nAdditionally,…",
  "data/reddit-stocks/r/stocks/comments/ss7kd1/rstocks_daily_discussion_monday_feb_14_2022.json": "These daily discussions run from Monday to Friday including during our themed\nposts.\n\nSome helpful links:\n\n * Finviz [https://finviz.com/quote.ashx?t=spy] for charts, fundamentals, and\n   aggregated news on individual stocks\n * Bloomberg market news [https://www.bloomberg.com/markets]\n *…",
  "data/reddit-stocks/r/stocks/comments/ssgehi/the_hilarious_super_bowl_indicator.json": "There is something called the Super Bowl Indicator, that is used to predict\nwhether there will be a bull or bear market.\n\nFrom Investopedia's article about the Super Bowl Indicator: \"... a Super Bowl\nwin for a team from the National Football League’s American Football Conference\n(AFC) foretells a…",
  "data/reddit-stocks/r/investing/comments/ssn7qi/regulators_probe_block_trading_at_morgan_stanley.json": "https://www.wsj.com/articles/regulators-probe-block-trading-at-morgan-stanley-goldman-other-wall-street-firms-11644875448\n\nThe Securities and Exchange Commission has sent subpoenas to firms including\nMorgan Stanley and Goldman Sachs Group Inc. as well as several hedge funds,\nasking for trading…",
  "data/reddit-stocks/r/stocks/comments/ssnado/just_sold_off_about_3000_in_stocks_at_a_loss.json": "Just wanted to vent. I am a inexperienced investor that has been personally\ndabbling with stocks in the last few years. I decided recently to cut my losses\non horrible stock picks like ACB, HLYN, WKHS, MMAT CGC, etc.. because I was\nliterally sick at looking at them and knew they had nothing to do…",
  "data/reddit-stocks/r/stocks/comments/ssriy2/in_2014_when_russia_attacked_ukraine_there_was.json": "I think the media is partly to blame for this. Maybe in 2014 they weren't\ntalking about Russian invasion every 5 seconds. But why would now be any\ndifferent? There shouldn't be any crash at all.\n\nWhat do you guys think?",
  "data/reddit-stocks/r/stocks/comments/sssjdg/buffetts_berkshire_bought_about_1_billion_worth.json": "https://www.cnbc.com/2022/02/14/buffetts-berkshire-bought-activision-stock-before-microsoft-deal.html\n\nWarren Buffett’s Berkshire Hathaway purchased about $1 billion worth of shares\nin Activision Blizzard in the fourth quarter, according to a regulatory filing,\njumping in before Microsoft agreed to…",
  "data/reddit-stocks/r/Bogleheads/comments/sss8iz/how_do_you_stop_yourself_from_panic_selling.json": "During bull runs it's easy to stick to your strategy and DCA. But during times\nof great uncertainty and market crashes, how do you personally stop yourself\nfrom hitting the sell button and trying to time the bottom? Psychologically it\nseems counterintuitive to be able to stare at your portfolio…",
  "data/reddit-stocks/r/Bogleheads/comments/ssrqi5/huge_roth_conversion_700k_huge_taxable_account.json": "I'm sucking it up and doing a huge Roth conversion here in 2022. Long story\nshort: my accountant told me previously I couldn't do backdoor Roth conversions\nafter 2015. Thanks to you people here, she realized she was wrong. So I'm\nconverting all $700k of my Simple IRA and non-deductible IRA…",
  "data/reddit-stocks/r/Bogleheads/comments/sspz3x/vtsax_or_vfiaxvimaxvsmax.json": "I am sorry I am so new to this. I just wanted this group’s expertise on a\nquestion I can’t figure out the answer to…\n\nWould it make a difference if I invested 100% into VTSAX vs equal portions into\nLarge cap/mid cap/small cap funds? I am not sure if it is weighted differently\n(like there are more…",
  "data/reddit-stocks/r/wallstreetbets/comments/ssvi19/infinite_money_glitch_not_patched.json": "after losing most of my money on options, ive come to realize that the best way\nto make consistent gains is to have more money to put in the market.\n\nenter the plan i came up with after failing my geology exam.\n\n 1. apply for fafsa and use my scholarship to pay my tuition.\n\n 2. apply for my…",
  "data/reddit-stocks/r/stocks/comments/ssyn76/russia_returns_some_troops_to_base_in_areas_near.json": "Source\n[https://www.reuters.com/world/europe/russia-returns-some-troops-bases-areas-near-ukraine-report-2022-02-15/]:\n-\nhttps://www.reuters.com/world/europe/russia-returns-some-troops-bases-areas-near-ukraine-report-2022-02-15/\n\nMOSCOW, Feb 15 (Reuters) - Some troops in Russia's military districts…",
  "data/reddit-stocks/r/wallstreetbets/comments/ssyhyn/elon_musk_donates_57_billion_tesla_stock_worlds.json": "Elon Musk, world’s richest person and the chief executive of Tesla Inc, donated\nTesla shares worth $5.7 billion to a charity in November, securities filing with\nthe US Securities and Exchange Commission showed. Musk donated a total of 5.04\nmillion shares to an unnamed charity last year between…",
  "data/reddit-stocks/r/stocks/comments/st09kt/tsla_bullish_price_is_287usd_dd.json": "No emotions, minimum speculations, just raw impartial numbers. We will answer\nonce and for all what is the fair value of TSLA.\n\n\n\nChapter 1. Bull thesis (and other lies I tell myself?)\n\n\n\nLet's start with the typical bull thesis. The one you have probably encountered\nmany times in the wilderness of…",
  "data/reddit-stocks/r/wallstreetbets/comments/ssygtf/russian_troops_head_back_to_their_permanent_bases.json": "⚡⚡Russian troops HEAD BACK to their permanent bases after successful finish of\nthe military drills - Russian MOD\n\nRuble is jumping together with stocks. Oil & Gold fall.\n\nOIL…",
  "data/reddit-stocks/r/investing/comments/ssnd9v/warren_buffett_buys_atvi_and_nu_bank_in_q4_of_2021.json": "Based on Berkshire's recent 13F filings, Warren Buffett bought shares in ATVI\nand Brazilian Fintech Company Nu Bank during Q4 of 2021.\n\nThe filings also show that Buffett significantly increased his position in\nChevron, by nearly 33%. He cut down his positions in Visa and Mastercard,\nalthough they…",
  "data/reddit-stocks/r/stocks/comments/st08u3/12_rules_for_avoiding_misery.json": "A young teenager contacted me on Reddit, asking me to tell him how he can\npredict stocks. He asked a person who, after 2 years, still cannot understand\nhow the stock market works, not to mention predicting, but what I realized is,\nif I ignore his question, he will ask someone else, and I think I am…",
  "data/reddit-stocks/r/stocks/comments/st3e0o/wholesale_prices_rise_1_in_january_up_97_over_the.json": "Prices at the wholesale level twice as high than expected\n[https://www.cnbc.com/2022/02/15/producer-price-index-january-2022-.html]. What\nasset classes survive, thrive, or get waxed? It seems stunning that the smartest\nguys in the room couldn't see this coming. It's almost as if the FED is…",
  "data/reddit-stocks/r/wallstreetbets/comments/sshj5b/inflation_is_already_worse_then_the_1980s.json": "Hi retards, i'm sure most of you are familiar with this, but the CPI has\nundergone massive changes over the decades, to the point people question the\nvalidity of the model for inflation specifically. Originally, like 1980s, the\nCPI was determined by comparing the price of a fixed basket of goods…",
  "data/reddit-stocks/r/investing/comments/st567k/trying_to_make_sense_out_of_shiller_pe_ratio.json": "Looking at the Shiller P/E, we see that it is around 36, which pretty much\ndenotes a massive bubble in equities and signals doomsday. Or does it?\n\nMaybe others can offer some insight on this, but I think we need to look at a\ncouple other things in addition to earnings. Let's look at the all-time…",
  "data/reddit-stocks/r/investing/comments/st5tyr/want_to_hedge_against_inflation_holy_savings.json": "Tired of seeing your gains wiped away by the insane levels of Inflation in the\nUS economy? Well, there’s a nifty little government security that can help that\neven billionaire Bruce Wayne (A/K/A Batman) invests in. So what’s this little\nknown investment that the Batman himself…",
  "data/reddit-stocks/r/Bogleheads/comments/st7thp/any_high_yield_savings_account_recs_for_bogle.json": "So far I'm looking at Yotta and Marcus by Goldman Sach.",
  "data/reddit-stocks/r/stocks/comments/st5aiz/facebookmeta_fair_value_estimate_at_morningstar.json": "> Meta Platforms, the parent of Facebook, reported mixed fourth-quarter 2021\n> results. Revenue was slightly ahead of expectations but the firm missed on the\n> bottom line. We have slightly lowered our revenue growth assumptions for Meta,\n> resulting in a $400 fair value estimate.\n> \n> Total fourth…",
  "data/reddit-stocks/r/stocks/comments/st80qq/why_would_someone_purchase_35_billion_in.json": "I was looking through option flows last night and found that 3.5 billion in\npremiums was paid for SPX calls for 12/16/22. With a strike between 1000 and\n1300. I get that normally deep ITM calls are a hedge for the downside, but this\nseems extreme since SPX is trading around 4400.\n\nLink to a…",
  "data/reddit-stocks/r/wallstreetbets/comments/st0lic/robinhood_released_the_1099b_for_2021_today.json": "I hope all you shit talking ape retards that made adderall fueled trades on\nretarded meme stocks over and over again paid attention and closed out positions\nin December. Because if you didnt I highly recommend you open up those 1099Bs\nand start figuring out what you owe hahaha. Ya'll gon' learn…",
  "data/reddit-stocks/r/Bogleheads/comments/st7ypi/is_vt_and_chill_just_a_meme.json": "Or are there people who actually follow this strategy? I’m new to Bogleheads and\nthe thought of having all my investing capital in one ticker makes me feel weird\nlol",
  "data/reddit-stocks/r/stocks/comments/stdnf8/rblx_tumbles_15_after_earnings_miss.json": "Q4 GAAP EPS of -$0.25 misses by $0.13.\n\nRevenue of $568.8M (+83.5% Y/Y) misses by $212.9M.\n\nJanuary 2022 Key Metric Estimates:\n\nRevenue was between $203 million - $206 million, up 64% - 66% year over year;\n\nDAUs were 54.7 million, up 32% from January 2021;\n\nHours engaged were 4.2 billion, up 26%…",
  "data/reddit-stocks/r/Bogleheads/comments/stafzh/william_bernstein_the_delusions_of_crowds_why.json": "BEHAVIORAL AND HISTORICAL FINANCE\n\n\nWILLIAM BERNSTEIN THE DELUSIONS OF CROWDS: WHY PEOPLE GO MAD IN GROUPS\n\n4 Signs of a bubble\n\n 1. Everyone around you is talking about it. And you should start worrying when\n    people talking about getting rich in certain areas of the market don't have\n    a…",
  "data/reddit-stocks/r/investing/comments/stdmp7/airbnb_beats_on_earnings_and_gives_strong_guidance.json": "https://www.cnbc.com/2022/02/15/airbnb-abnb-earnings-q4-2021.html\n\n> Airbnb beat Wall Street estimates on earnings and revenue in its fourth\n> quarter, as the travel company continued to rebound from the Covid-19\n> pandemic.\n> \n> The company’s stock jumped more than 7% in after hours trading.\n> \n>…",
  "data/reddit-stocks/r/wallstreetbets/comments/stb7gb/the_over_short_thesis_hasnt_gone_anywhere.json": "Let me begin with a disclaimer.\n\n\nI AM A RETARDED APE.\n\nNow that we have that out of the way I just want to bring up an all too familiar\ndiscussion.\n\n\nI'M HERE TO TALK ABOUT \"THOSE STOCKS\" AND THEIR BROTHER/SISTER STOCKS.\n\nIf you haven't stopped reading yet or WSB hasn't deleted this post.…",
  "data/reddit-stocks/r/Bogleheads/comments/ssutnj/what_to_do_after_maxing_out_retirement_accounts.json": "Hey guys! I just finished the Little Book of Common Sense Investing and am\nreally glad to have found this forum. I also have a question.\n\nWhat do you do with excess cash after you have maxed out your emergency fund,\nHSA, 529 accounts, 401K or Roth etc? Let's also say that you are debt free.\nWould…",
  "data/reddit-stocks/r/Bogleheads/comments/stdq8j/series_i_savings_bonds_with_tax_refundform_8888.json": "I filed taxes in January and just got my first batch of paper savings bonds in\nthe mail. I used Form 8888 to use part of the tax refund for purchasing savings\nbonds. Anyone getting a refund can do this. If you aren't getting one, or want a\nlarger one so as to purchase the maximum amount of paper…",
  "data/reddit-stocks/r/wallstreetbets/comments/stdsqj/i_was_up_100_on_upst_puts.json": "100 fucking percent. i called my dad and you know what i told him? “hey dad i\njust made 4 grand in 30 minutes!” you wanna know what he told me? “you should\nsell son, 4 grand is alot of money and in such a short amount of time” i said\n“but dad i could have so much more if it goes down!” and hung up…",
  "data/reddit-stocks/r/wallstreetbets/comments/st27q3/steps_to_become_a_billionaire_or_find_out_that.json": "Step 1, find a ticker or whatever that shit is called. ($SPY is my choice)\n\nStep 2: Buy 0 DTE Puts or Calls, put GENUINE thought into this. Think, is it\ngonna go up? Down?\n\nStep 3: INVERSE whatever the genuine thing you come up with this.\n\nNow, if you profit? You’re fucking brain dead but rich. If…",
  "data/reddit-stocks/r/stocks/comments/stegbj/airbnb_q4_2021_earnings_report.json": "https://money.yahoo.com/airbnb-q4-earnings-2021-211553102.html\n\n * Revenue: $1.53 billion versus $1.46 billion expected\n * Adj. earnings per share: $0.08 versus $0.03 expected\n * Gross bookings: $11.3 billion versus $11.09 billion expected",
  "data/reddit-stocks/r/stocks/comments/sszzzq/rstocks_daily_discussion_technicals_tuesday_feb.json": "This is the daily discussion, so anything stocks related is fine, but the theme\nfor today is on technical analysis (TA), but if TA is not your thing then just\nignore the theme and/or post your arguments against TA…",
  "data/reddit-stocks/r/Bogleheads/comments/stjyxb/ibonds_interest_payout.json": "I bought 10k worth in June 2021, but the website indicates the current value is\n$10,148. Why does it not reflect around $10,700? Would someone mind explaining\nhow interest payouts are reflected on the TreasuryDirect website? Thank you!!",
  "data/reddit-stocks/r/wallstreetbets/comments/stggd7/i_dont_get_why_this_inflation_thing_is_freaking.json": "7.5% inflation? So your USD lost 7.5% of its value? And your solution to this is\nto...convert your stocks/options into USD? Absolutely brilliant!\n\n\n\nListen here you fucking genius, just today, NVDA jumped 9%, which means if you\njust invested into that stock you would have beat inflation AND made…",
  "data/reddit-stocks/r/Bogleheads/comments/stgn0d/living_in_the_moment_versus_planning_for_the.json": "Hi all! Quick question that probably doesn't have a quick explanation: how do\nyou strike a balance between planning for the future and living in the moment?\n\nBackground information for me: I'm a bit \"late\" to the investing game at age 31,\nbut I have a state pension plan (~8% contribution + match)…",
  "data/reddit-stocks/r/stocks/comments/stougj/can_somebody_help_me_understand_losing_money_in.json": "I'm looking to start investing but I would need one of my parents since im a\nteen, so I got a question. Is it possible to go way into debt by accident? I\ndon't want my parents going into debt because of a mistake I made",
  "data/reddit-stocks/r/stocks/comments/stsgxs/how_i_made_250_virtual_profit_and_lost_70_of_my.json": " 1.  So initially, I had all the money in mutual funds and made about 12% from\n     July 2019 to March 2020. The investment was about £50000\n 2.  Then with the initial Covid shock, I panicked and took out all the money\n     and maintained cash position till April 2020\n 3.  About August 2020, I…",
  "data/reddit-stocks/r/Bogleheads/comments/stq382/selling_off_100_voo_porfolio_for_vt.json": "I've been buying 100% VOO since I started investing a few years ago and only\nrecently started to look back into reading more on investing and feel like I'd\nlike to be more diversified particularly in capturing small cap and\ninternational stock.\n\nAny downside to selling off all of my VOO distributed…",
  "data/reddit-stocks/r/stocks/comments/stusw7/intel_to_acquire_tower_semiconductor_for_54.json": "It looks like Intel is looking to increase their custom foundry capacity through\nacquisition to compliment their current organic fab build-out efforts.\nInterestingly, the numerous mentions of Tower's deep customer relationships\nmakes me wonder if they were also working to beef up the customer…",
  "data/reddit-stocks/r/investing/comments/stuc0f/wynn_resorts_wynn_sells_land_and_buildings_for.json": "This seems pertinent for anybody interested in the leisure & entertainment,\ngaming, or real estate industries. To be clear, this is a triple net (NNN) lease\nwhich seems to benefit both companies and, subjectively, may be moot as far as\nlocals are concerned.\n\nPros for Realty Income: new exposure to…",
  "data/reddit-stocks/r/investing/comments/stwrnr/ive_documented_every_major_reason_lumber_has.json": "This is not limited in scope to people who invest in lumber ETF's like WOOD.\n\nThere is a lot of uncertainty around inflation, supply shortages, and corporate\nprofits. To try to figure out what the hell is going on, I looked into the\n\"first\" real commodities shortage that made the news - lumber, a…",
  "data/reddit-stocks/r/Bogleheads/comments/stvaxx/if_i_understood_this_right_i_can_divide_my_money.json": "So, I was under the impression that the more money I put in a certain\ninvestment, the faster compound interest will grow.\n\nAnd yet, I did a simulation using this calculator\nhttps://www.nerdwallet.com/banking/calculator/compound-interest-calculator and\nhere's the results:\n\n- if I put $5000 as…",
  "data/reddit-stocks/r/stocks/comments/stwgoo/switching_to_index_funds_market_1_me_0.json": "I have a Roth IRA that I set aside a few hundred dollars a month for. I told\nmyself that if I didn’t at least do as good as SPY within 6 months I’d stop\npretending to be Jessie Livermore and buy low fee indices like every other\nfailed trader who came to their senses.\n\nI began my account 6 months…",
  "data/reddit-stocks/r/stocks/comments/stzcql/google_announces_privacy_changes_to_android_that.json": "https://blog.google/products/android/introducing-privacy-sandbox-android/\n\nSummary:\n\n * It's a response to Apple's IDFA change that screwed FB\n * Google had to do something because it doesn't want to look bad and Apple has\n   been touting its change as a user privacy benefit\n * Google's change is…",
  "data/reddit-stocks/r/stocks/comments/stz2i9/why_did_so_many_people_start_investing_in_2020.json": "It seems like the majority of new retail investors/traders started getting into\nit around early-2020, after the covid crash, but I still don't really understand\nwhy it happened. Personally it was a very difficult time because the market was\ncrashing and the news was getting worse and worse, it was…",
  "data/reddit-stocks/r/stocks/comments/stuqyi/shopify_announces_fourthquarter_and_fullyear_2021.json": "Fourth-quarter 2021 Merchant Solutions Revenue exceeds $1 billion for the first\ntime\n\nFourth-Quarter Financial Highlights\n\n * Total revenue in the fourth quarter was $1,380.0 million, a 41% increase from\n   the comparable quarter in 2020.\n\n * Subscription Solutions revenue was $351.2 million, up…",
  "data/reddit-stocks/r/stocks/comments/su2e8m/paypal_down_64_percent_compared_to_1_year_ago.json": "What are we thinking about this ongoing massacre. Paypal shares dropped quite a\nbit again today and I just happened to look at the 1 year chart and saw it\npeaked nearly a year ago in february and is now down around 64 percent from that\npeak. With the P/E narrowing quite a bit to around 32 today I…",
  "data/reddit-stocks/r/stocks/comments/su73rh/nvidia_beats_q4_estimates_on_power_of_data_center.json": "Nvidia (NVDA) reported its Q4 earnings after the bell on Wednesday, beating\nanalysts' estimates on the top and bottom lines.\n\nHere are the most important numbers from the report compared to Wall Street's\nexpectations, as compiled by Bloomberg.\n\nRevenue: $7.6 billion versus $7.42 billion…",
  "data/reddit-stocks/r/wallstreetbets/comments/stwht2/justice_department_is_pursuing_wideranging.json": "Federal prosecutors are investigating whether short-sellers conspired to drive\ndown stock prices by sharing damaging research reports ahead of time and\nengaging in illegal trading tactics\n[https://www.wsj.com/amp/articles/justice-department-is-pursuing-wide-ranging-investigation-of-short-sellers…",
  "data/reddit-stocks/r/Bogleheads/comments/stzqze/can_i_buy_ibonds_for_kids.json": "Can a family of 4 get $40k (2 adults , 2 kids) in ibonds per year ?",
  "data/reddit-stocks/r/stocks/comments/su35b1/this_bear_market_is_a_sick_joke.json": "What does RBLX, WIX, FB and SHOP all have in common?\n\nThe market is absolutely ravaging them for having actually decent earnings. 3\nmonths ago these stocks would have all mooned, with these earnings. Arbitrary\nestimation numbers from random financial analysts are apparently the most\ndeciding factor…",
  "data/reddit-stocks/r/wallstreetbets/comments/su2mng/who_the_fuck_is_meta_marketing_to.json": "Based on zero data or facts, I’m going to assume that Meta’s average user is\nlike 60 years old.\n\nIs Karen really dying to strap on that VR headset and go fly around space and\ngrope a cartoon panda or whatever happens in the metaverse?\n\nWhen is she going to get herself all set up for her metaverse…",
  "data/reddit-stocks/r/stocks/comments/su5hoo/robinhood_increases_margin_interest_rate_from_25.json": "Hi Friends,\n\nI just got THIS [https://i.imgur.com/A0BTt67.png] eMail from RobinHood, saying\nthey will increase their annual margin interest rate from 2.5% to 3% as of March\n23rd.\n\nWith some all-time highs for margin debt\n[https://www.finra.org/investors/learn-to-invest/advanced-investing/margin…",
  "data/reddit-stocks/r/stocks/comments/su5y10/why_do_news_outlets_such_as_bloomberg_only_state.json": "I often listen to the news and even Bloomberg radio and when they announce the\nstock market index they almost always state \"The dow is down x points, the\nnasdaq x points, S&P x points\". Like, how does that mean anything without\npercentages??! It drives me crazy.",
  "data/reddit-stocks/r/stocks/comments/subrjh/sec_temporarily_banned_naked_shortselling_in_2008.json": "In 2008, the SEC:\n\n * Plainly acknowledged naked short-selling exists\n * That it is by-nature “abusive”\n * Said they have “zero-tolerance” for it\n * And then...tEmPoRaRiLy banned it\n\n\n= = = = = = = = = = = = = =\n\nHere's a list of money quotes I compiled from the articles below:\n\n * Peter Cardillo:\n…",
  "data/reddit-stocks/r/wallstreetbets/comments/sua8zv/meta_is_dead_stop_trying_to_revive_it.json": "Alright, WSB, there’s far too much “sHoUld I bUy tHe dIp” about Meta (FB) in the\ndaily discussion thread, so I’m here to completely disavow any thought that FB\nis worth buying.\n\ntl;cr: FB is a cold, dead thing.\n\nAnalysis: Do you go on Facebook? Really? If you do, you’re likely about to\ncollect…",
  "data/reddit-stocks/r/Bogleheads/comments/sud8dr/how_did_you_find_out_about_bogleheads.json": "I feel like in this day and age, most people interested in investing their money\nare drawn to highly volatile, buzzword assets (the obvious example being\ncrypto). The idea of putting your money in a diverse index fund and forgetting\nabout it for a few decades, while proven to work, isn't something…",
  "data/reddit-stocks/r/Bogleheads/comments/su9mz9/why_are_tips_index_funds_down_in_2022.json": "I am trying to set up a portion of my portfolio to simply track an inflation\nindex. I have a need for the money in < 18 months, and so do not want to commit\nto ibonds or actual TIPS. There are a number of exchange traded funds that are\nsupposed to be tracking inflation indices, but all of these are…",
  "data/reddit-stocks/r/wallstreetbets/comments/su5efg/this_market_is_a_joke.json": "I remember when i was a little retard boy fascinated by the markets. A system\nthat rewarded intelligence, patience and a deep understanding of economics.\n\nNow it's just a race of reading comprehension between bots, to figure out the\nsentiment of a 20 page pdf in a few miliseconds.\n\nThe future of…",
  "data/reddit-stocks/r/Bogleheads/comments/suboae/empoyer_401k_lottery_help.json": "Hello Bogleheads,\n\nBrief Background, 26 year old living in California, got my first \"adult\" job and\nnow have benefits.\n\nMy question is asking for your help on determining where to put my 401k\ninvestments (see photos).\n\nI'm new to investing and have many goals but I'm looking for a starting…",
  "data/reddit-stocks/r/stocks/comments/su7mwg/amat_beats_expectations_q1_2022_earnings_report.json": "Nice results from Applied Materials (AMAT), taking into account that we could\nsee certain pullback due to the chip shortage. So far up to +2.2% in\nafter-hours.\n\nRevenue: $6.27 billion versus $6.19 billion expected.\nAdjusted Earnings per share: $1.89 versus $1.86…",
  "data/reddit-stocks/r/stocks/comments/suak7a/have_i_fucked_up.json": "Saved up a load of money during the pandemic. Invested in companies like TSLA,\nSQ, PLTR, ETSY, SE, TTD based on Reddit and Twitter discussions. Almost all of\nthese are now down 30-50% (except TSLA which many people think is still in a\nbubble). Since then I have learnt more about historical…",
  "data/reddit-stocks/r/stocks/comments/sumnq5/palantir_technologies_nongaap_eps_of_002_misses.json": "Palantir Technologies\n\n * Q4 Non-GAAP EPS of $0.02 misses by $0.02.\n * Revenue of $432.8M (+34.4% Y/Y) beats by $14.73M.\n * Added 34 net new customers in Q4 2021\n * Closed 64 deals of $1 million or more, of which:\n   * 27 deals are $5 million or more\n   * 19 deals are $10 million or more\n * For Q1…",
  "data/reddit-stocks/r/stocks/comments/suh036/why_own_gold.json": "From Global Investing\n\n * No other financial or physical asset has been as reliable a store of value\n   over long periods of time as gold\n * Gold and Silver were money for centuries\n * Over long periods of time, gold and silver have had real returns near zero\n   * But the effectiveness as a long…",
  "data/reddit-stocks/r/investing/comments/suqeta/confusion_about_capital_flow_due_to_ir.json": "So as per theory, when there is interest rate differential, say right now when\nwe expect US Interest rates to go up and emerging market rates to remain where\nthey are in countries like Indonesia, India, China etc., we expect capital to\nflow from these EM countries to the US.\n\nWhat I dont understand…",
  "data/reddit-stocks/r/Bogleheads/comments/suspyg/i_did_it_officially_went_vtwax_and_relax.json": "Thanks to those who responded to my post a few days ago. I had been deliberating\nthe move for several weeks and finally pulled the trigger. 100% VTWAX and Relax!\n🌎🌍🌏",
  "data/reddit-stocks/r/stocks/comments/suud7d/cathie_woods_if_you_short_ark_fund_you_are.json": "Miss Cathie Woods is being hilarious on CNBC interview. She wont admit her bad\nbets and is defending herself by focusing on AI future and if you happen to\nshort her fund then you are against innovation she said.\n\nMost of the companies shes invested have tanked between **-50% to -80%(**hood\nthat is)…",
  "data/reddit-stocks/r/investing/comments/sush5s/if_you_have_a_net_capitalloss_for_the_year_but.json": "Just curious as it turns out the standard deduction (12k) is still larger than\nwhat I'd get with itemized deductions that included capital losses. The only\nreason this matters is that turbotax charges you an extra $69 to file if you\nhave a 1099, so if I don't need to report given that I won't be…",
  "data/reddit-stocks/r/stocks/comments/sut5zy/dow_drops_over_400_points_as_biden_warns_russia.json": "U.S. stocks fell Thursday, as investors dealt with renewed fears of a Russian\ninvasion of Ukraine as the U.S. and its allies accused Moscow of continuing to\nbuild up troop levels.\n\nMarkets were whipsawed by Ukraine-Russia headlines, with NATO accusing Moscow of\nmisleading the world over troop…",
  "data/reddit-stocks/r/stocks/comments/sulpkh/rstocks_daily_discussion_options_trading_thursday.json": "This is the daily discussion, so anything stocks related is fine, but the theme\nfor today is on stock options, but if options aren't your thing then just ignore\nthe theme and/or post your arguments against options…",
  "data/reddit-stocks/r/investing/comments/sujy0f/yahoo_finance_net_debt_figures_are_wrong.json": "Hi, take a look at the balance sheet of PENN\nhttps://finance.yahoo.com/quote/PENN/balance-sheet?p=PENN How the heck is net\ndebt 458,800 (thousands) if the formula for Net Debt is (short and long term\nliabilities minus current assets)... what am I missing. I'm trusting Yahoo less\nand less...",
  "data/reddit-stocks/r/investing/comments/sux39q/ark_invest_takes_shot_at_cnbc_after_cathie_woods.json": "From ARK Invest's Twitter:\n\n> CNBC may have a 40 minute time horizon, but ARK's is 5 years. Thanks for\n> having us on CNBC, we're happy to pay for your upgraded Zoom account. You\n> can't be a knowledge worker without it! 😉\n\nThis is after Cathie Wood's 40-minute interview on CNBC earlier this…",
  "data/reddit-stocks/r/investing/comments/suxmp2/palantir_shares_drop_more_than_13_after_earnings.json": "https://www.cnbc.com/2022/02/17/palantir-pltr-earnings-q4-2021.html\n\nFull Text:\n\n> Shares of Palantir fell more than 13% on Thursday afternoon after the company\n> reported mixed earnings results for the fourth quarter.\n> \n> Here are the key numbers:\n> \n> Earnings per share (EPS): 2 cents, adjusted…",
  "data/reddit-stocks/r/stocks/comments/sur96v/trimming_amzn_to_buy_more_goog_crazy.json": "I am balls dip in AMZN. Love the company, and management. Its one of a kind,\nalmost 30% of my portfolio is AMZN. less than 10% is GOOG. for past 6 months,\ngoogle stock is taking beating even with 2 stellar ER and stock split\nannouncement. Trading around 24 p/e. This is pretty attractive for the…",
  "data/reddit-stocks/r/wallstreetbets/comments/sul4u4/google_plans_privacy_change_similar_to_apples.json": "https://www.cnbc.com/2022/02/16/google-plans-android-privacy-change-similar-to-apples.html\n\nHow long will something like this reflect on earnings? Gotta get in on FB puts\n\nAlso, what's with Google shitting on Apple, then hinting they will do the same\nthing?\n\n> Google criticized Apple’s approach in…",
  "data/reddit-stocks/r/stocks/comments/suyig6/finance_movie_recommendations.json": "Can someone please recommend me a good finance related movie available on\nNetflix. Anything to do with white collar crime, stock exchanges,\nhacks...Anything that brings out the wolf of wall street vibe will be\nappreciated.",
  "data/reddit-stocks/r/wallstreetbets/comments/suxx5s/facebook_meta_is_nearly_down_50.json": "The company formerly known as Facebook, now likes to call itself Meta, has\nnearly lost half its value in 6 months.\n\nPeople like to tout investing in stocks because it’s supposedly safer than\nyou-know-what, but losses like this show that even stocks aren’t a safe bet. One\nof the biggest companies in…",
  "data/reddit-stocks/r/stocks/comments/sv1nkm/at_what_point_do_we_start_calling_dozens_of.json": "It came for the meme stocks, weed stocks, SPACs, penny stocks, small caps,\nmidcaps, high multiple stocks. I didnt speak since I owned none in that\ncategory.\n\nNow REITs, utilities, large cap stocks are tanking 20% from earnings or just the\noverall fear of Fed raising rates. People keep saying wait…",
  "data/reddit-stocks/r/stocks/comments/sv33qc/roku_plunges_22_on_disappointing_revenue_and.json": "Roku shares fell as much as 20% in extended trading on Thursday after the\nvideo-streaming company issued fourth-quarter revenue and first-quarter revenue\nguidance that came in below consensus.\n\nHere’s how the company did:\n\nEarnings: 17 cents per share, adjusted, vs. 9 cents per share as expected…",
  "data/reddit-stocks/r/stocks/comments/sv4irj/meta_platforms_drops_out_of_top_10_companies_by.json": "Meta Platforms' (NASDAQ:FB) worst month ever continues: The stock tacked on\nanother 4.1% loss Thursday, another $24 billion in market capitalization out the\nwindow as the stock dropped out of the top 10 most valuable companies.\n\nAt a value of $565 billion, Facebook fell to the No. 11 spot, a ways…",
  "data/reddit-stocks/r/wallstreetbets/comments/sutu5v/so_much_hate_on_meta_in_this_sub_heres_why_you.json": "Been seeing a lot of hate on Zuck and META. The reason why you should buy FB is\nbecause these bags are getting heavy @ 330avg and I would like to offload them\nto some other sucker.\n\nThat is all, thank you.",
  "data/reddit-stocks/r/Bogleheads/comments/sv1neq/how_would_this_portfolio_be_for_a_33_year_old.json": "60% VTI\n\n40% VXUS\n\nSmart or idiotic?",
  "data/reddit-stocks/r/Bogleheads/comments/sv6ym1/strayed_from_my_3fund_went_stock_picking_and_lost.json": "Stay the course everyone. Even if you've been doing well and you feel you have\nsome extra money to play around with. I've been investing for about 10 years in\na simple 3-fund portfolio. I randomly decided to take a risk and invest in\nShopify in early January. SHOP has since cratered and I've lost…",
  "data/reddit-stocks/r/stocks/comments/sv3hcb/good_companies_you_bought_too_high.json": "We all know that, by choosing our own stocks, we’re bound to make some of these\nmistakes. We research the company, we know they’re profitable and stable, but we\nend up paying too much for their stock. Which companies in your portfolio are\nyou holding that you entered at too high of a price? I’ll…",
  "data/reddit-stocks/r/wallstreetbets/comments/suyhby/it_took_me_losing_everything_5_times_to_realize_i.json": "Blew up my 5th account. Made and lost a quarter mill. Speculated to the stars\nand back. When you gamble, you can never win. You either keep going for more or\nkeep playing till you're broke.\n\nTried fundamentals, tried technicals, tried momentum, tried trading on\nheadlines. Finally realized I have no…",
  "data/reddit-stocks/r/wallstreetbets/comments/sv6clr/there_wont_be_a_war_in_ukraine_because_russia.json": "These are the opinions of a person that comes from a culture very similar to\nthat of Russia and you Westerners need to start understanding just how different\nwe view things.\n\nRussia’s objectives was never to start an open conflict with Ukraine, it was to\nincrease its influence in the region,…",
  "data/reddit-stocks/r/Bogleheads/comments/suygkj/book_to_read_after_boglehead_guide_to_investment.json": "Hello my friends! Just finished listening to Boglehead guide to investment in\nauditable and have another credit. Any recommendations? I have already listened\nto common sense investing. Please feel free to recommend what to listen next and\nplease tell me why you recommend it.\n\nThank you!",
  "data/reddit-stocks/r/wallstreetbets/comments/svaasl/breaking_citadel_under_investigation_by.json": "Well that was fast!\n\nBREAKING: Citadel Under Investigation by Department of Justice - Franknez.com\n[https://franknez.com/breaking-citadel-under-investigation-by-department-of-justice/]\n\nBloomberg officially confirms Citadel on the list of hedge funds under\ninvestigation!…",
  "data/reddit-stocks/r/stocks/comments/sv73qv/shopify_down_another_12_after_stockprice_target.json": "Canadian e-commerce company Shopify Inc. had the average price target on its\nshares slashed to the lowest level since January 2021 after it signaled slower\nsales growth.\n\nMore than 20 analysts cut their targets after the stock plunged 17 per cent in\nToronto on Wednesday, its biggest drop ever,…",
  "data/reddit-stocks/r/Bogleheads/comments/sv9nce/reading_list_recommendations.json": "Reading List Recommendations\n\nI decided to put together this list so people have an idea what order to read\nthe books in and what it discusses. I have summaries of these books and others\nif you are interested. The summaries can help you decide if you want to read\nmore or not.\n\nAnd a note on my…",
  "data/reddit-stocks/r/stocks/comments/svhe3l/stocks_that_are_now_cheaper_than_before_covid.json": "It's really fascinating to see so many companies that have fallen sharply below\ntheir pre pandemic levels, despite having two years of growth behind them.\n\nWhere the markets already overvalued in 2019? Or had the recent panic a big\nirrational overreaction? I would be interested to hear some…",
  "data/reddit-stocks/r/Bogleheads/comments/svh18l/an_adventure_of_a_boglehead_from_a_frontier.json": "It seems like outside of US and Europe the concept of index investing becomes\nvirtually non-existent. As an investor from Vietnam, a frontier market, I became\ntired of hearing about \"riding the wave\" and my friends lamenting numerous rug\npulls in the stock market. By chance, I discovered this…",
  "data/reddit-stocks/r/stocks/comments/svhbkg/dkng_management_is_way_too_greedy.json": "Is Draftking just a big cash grab in a new and hot industry? The stock is down\n57% in last 6 months and another 16% in todays pre market.\n\nDraftkings management have printed new stocks to compensate themselves equalling\naround 50% of the yearly revenue.\n\nhttps://pbs.twimg.com/media/FL4PjT-XoAESv6…",
  "data/reddit-stocks/r/stocks/comments/suze4j/there_is_no_such_thing_as_priced_in.json": "\"Priced in\" is to investors as \"God's plan\" is to religious people. It's the\nperfect explanation for every market movement.\n\nAnd in a world where stock markets are made up of people with strong emotional\ncontrol and whom investments are the result of a careful and thorough due\ndiligence, that…",
  "data/reddit-stocks/r/stocks/comments/sv4juq/why_is_pdt_still_a_rule_the_secs_reason_of.json": "Oh but hello Mr. $1,800 in his account. We see you have no prior trading\nexperience, but don't worry, we've approved you to trade all sorts of\nderivatives! Wanna buy SPY options expiring next week? No problem buddy!\n\nOh hold on a second. You wanted to sell those options 60 seconds later for a…",
  "data/reddit-stocks/r/stocks/comments/svnmfg/fed_approves_rules_banning_its_officials_from.json": "CNBC - Source\n[https://www.cnbc.com/2022/02/18/fed-approves-rules-banning-its-officials-from-trading-stocks-bonds-and-also-cryptocurrencies.html]\n\nFederal Reserve officials won’t be able to trade a slew of assets including\nstocks and bonds — as well as cryptocurrencies — under new rules that…",
  "data/reddit-stocks/r/wallstreetbets/comments/svluhl/the_housing_market_will_never_crash_you_will_just.json": "First lets get some info out there:\n\n 1. The federal government doesn't give a fuck about you\n 2. there is no housing shortage\n 3. business is taking over single family homes\n 4. you are going to rent forever... thats your future, and you better like it.\n\n\n\nThe federal government has been posting…",
  "data/reddit-stocks/r/stocks/comments/svetax/rstocks_daily_discussion_fundamentals_friday_feb.json": "This is the daily discussion, so anything stocks related is fine, but the theme\nfor today is on fundamentals, but if fundamentals aren't your thing then just\nignore the theme and/or post your arguments against fundamentals…",
  "data/reddit-stocks/r/investing/comments/svlexz/draftkings_dkng_and_upstart_upst_release_updated.json": "Here's a link [https://www.quiverquant.com/riskfactors/DKNG] to the new\nDraftKings risk factors section, w/ new additions highlighted.\n\nSome notable additions:\n\n * \"We conduct business in numerous countries that carry high levels of\n   currency, political, compliance and economic risk, including in…",
  "data/reddit-stocks/r/stocks/comments/svngsk/explain_it_to_me_like_im_five.json": "So why does the market care about the tensions between Russia and Ukraine?\nWill people stop tanking gas, will people stop going to the super market or gym,\nwill people stop using tech or cancel their subscriptions like Disney or\nSpotify?",
  "data/reddit-stocks/r/wallstreetbets/comments/sv9c1q/i_feel_like_people_are_really_downplaying_the.json": "I was once a gmreee ape for a hot second, then realized for what it is, a bet on\na certain play of events. Nothing more.\n\nGME memestock shit aside, the whole writing reports, opening a position, giving\nreports to publishing houses to report as their own is some Bernie Madoff type\nshit.\n\nAt the SEC,…",
  "data/reddit-stocks/r/investing/comments/svr7qy/wotc_to_split_from_hasbro_has.json": "Been seeing articles speculating about Wizards of the Coast being split off to\nbe it's own company and this would somehow lead the stock to increae.\n\nIs anyone able to help explain why that would happen? Would HAS still include\nWotC earnings and such?\n\nThanks!",
  "data/reddit-stocks/r/Bogleheads/comments/svdtgm/invest_windfall_in_two_funds.json": "I’m in my 20s and thinking about investing the 300K I’m getting like this, lump\nsum:\n\n80% VTI 20% VXUS\n\nDoes that look good? I don’t want bonds. I have some in my 401k target date fund\nalready. Besides the 300K, I max my Roth 401k & ira every year.",
  "data/reddit-stocks/r/wallstreetbets/comments/svnlcq/fed_approves_rules_banning_its_officials_from.json": "Federal Reserve officials will be restricted from owning individual stocks,\nbonds and other assets under rules announced Friday that first were set forth in\nOctober. The new regulations extended and ban to cryptocurrencies, which were\nnot included in the previous announcement.\n\nThey follow a…",
  "data/reddit-stocks/r/investing/comments/svvmau/the_paradox_that_the_stock_market_on_average_will.json": "So I haven't been on this subreddit long, but but a common theme I have seen is\npeople doing stuff like saving to buy a house in 3-5 years and wondering if they\nshould put their down payment into the S&P during those 3-5 years so they can\nget 8% to 10% interest. Another (and the one that inspired…",
  "data/reddit-stocks/r/stocks/comments/svlnkh/how_much_of_the_stock_market_value_is_leveraged.json": "Historically, highly leveraged markets tend to crash on corrections. Isn't this\nwhat ultimately caused the crashes of 1929 and 2008? Are things different now?\n\nNot trying to predict or bash anything; merely trying to understand how much of\nthe current market is based on leverage and debt, and if…",
  "data/reddit-stocks/r/stocks/comments/svvsns/stock_market_has_bottomed_5_out_of_5_times_just.json": "Look at the last 5 major armed conflicts and how the stock market performed.\n\nVietnam War \"Gulf of Tonkin\", Gulf War US Intervention, Afghan War, Iraq War,\nCrimean Crisis...\n\nALL TIMES STOCKS BOTTOMED at the start of the \"invasion\".\n\nDon't freak out. Don't panic.\n\nEdit: Obviously I mean from a…",
  "data/reddit-stocks/r/Bogleheads/comments/svq031/can_anyone_recommend_a_good_book_about_the_dotcom.json": "I lived through it as a 20-something but I want to read a book, or multiple\nbooks, that give a good overview of the factors at play.\n\nThank you.",
  "data/reddit-stocks/r/Bogleheads/comments/svv4mj/how_much_should_world_wars_record_inflation_or.json": "Should Bogle investors ever be concerned about large, world events or are they\nstrictly irrelevant? What would be an example of such an event or are there\nnone?",
  "data/reddit-stocks/r/investing/comments/svtzee/how_do_we_feel_about_intel.json": "Ive been digging into them the past few days and I think this could be a real\npotential gem.\n\nIts near a historic 5 yr low, pays 3% at the current price, great consistent\ncash from operations, steady revenues. Cash cow. Value.\n\nBut, they are undergoing MASSIVE capex, building their own fabs and…",
  "data/reddit-stocks/r/Bogleheads/comments/svjkst/recovering_stock_picker_and_options_trader_want.json": "I figured this was the best subreddit to share. Part of this is to internalize\nthe shift I've been doing, part of this is in case this can be helpful for some.\nThis will be long.\n\nI should preface by saying that I have not lost money since I started (in 2015),\nand some of my accounts have even beat…",
  "data/reddit-stocks/r/stocks/comments/svotbd/here_are_my_investment_rules_please_feel_free_to.json": "1) invest long term (3 - 5 years) 2) invest in something you are fully confident\nwith 3) Do not check your portfolio, remember you are long term\ninvestor.Checking your portfolio especially in bad times like this will lead you\npanick selling. 4) invest in 15 - 20 stocks preferably in different…",
  "data/reddit-stocks/r/stocks/comments/svw5ju/are_you_guys_buying_now_whywhy_not.json": "Looking to start a discussion about this. I started buying today, I feel like\nthere’s a lot of opportunity in the market right now due to the uncertainty. I\ndefinitely think things could go lower, but I’m comfortable with the current\nprices.\n\nWhat are you all doing? Holding cash? Buying the dip?…",
  "data/reddit-stocks/r/stocks/comments/svvlmo/dkng_arkk_cathie_woods_has_lost_it.json": "I personally find it absolutely frightening the way the interview yesterday\nunfolded on CNBC with Cathie Woods. Valid counterpoints were made to her\ninvestment strategy that were basically undeniable, and she blew smoke and\nquoted statistics and tried to make it sounded like she was…",
  "data/reddit-stocks/r/stocks/comments/swa2r4/reading_through_the_comments_on_this_sub_confirms.json": "If a bunch of second graders challenge me to a game of basketball and I destroy\nthem, I have not manipulated the game. Reading through Reddit comments reminds\nme that so many of the people in the market are playing at the second grade\nlevel. They have fundamental misunderstandings of the market,…",
  "data/reddit-stocks/r/Bogleheads/comments/swart7/us_bear_markets_19002019.json": "For a new investor like me, it might be important to know how long it took bear\nmarkets to recover in the past. Understanding history helps better meet the\nuncertainties of the future.\n\nBear markets (from 1900-2019):\n\n * a decline of >20% (30% on average)\n * occur every 4.5 years on average\n * 27…",
  "data/reddit-stocks/r/stocks/comments/swal0p/this_russia_invasion_scare_has_been_happening.json": "https://www.vox.com/platform/amp/2016/9/1/12729426/russia-troops-ukraine-border\n\nhttps://euromaidanpress.com/2020/07/09/russia-flexes-its-muscles-on-ukrainian-borders-but-a-full-scale-attack-will-cost-too-many-lives-experts-say/\n\nhttps://www.ukrinform.net/amp/rubric-defense/3056432-1100-russian…",
  "data/reddit-stocks/r/Bogleheads/comments/sw896u/so_much_worry_so_much_questions_when_a_tdf.json": "Asset allocation, ER's, tax credits blah blah blah all noise, why arent TDF's\npromoted more than say the age old vt/vti/vxus/voo/bonds blah blah question?\nBottom line bogleness is simplicity/set and forget, a TDF embodies this wholly.\nNothing wrong with min maxing but with any tinkering with…",
  "data/reddit-stocks/r/stocks/comments/sw8kax/is_the_stock_market_being_used_as_a_modern.json": "I’m not as well-read on the situation as I’m sure many others here are. But that\nsaid, war is fought for money and power. So if Russia’s intent is to gain either\nfrom Ukraine, then I can’t see how they wouldn’t have shorted the general\nmarket, Bitcoin, etc. before beating the war drums. If they…",
  "data/reddit-stocks/r/stocks/comments/swdw4e/is_this_investing_thought_stupid.json": "I believe in Intel as a company for the long run. Based solely on my experience\nas someone who works in IT. My thought is that rather than investing in Intel,\nwouldn't it be wiser to invest in a semiconductor ETF instead? Less risk, more\ndiversification. But then another thought comes and tells me…",
  "data/reddit-stocks/r/stocks/comments/swhuo7/what_are_the_chances_that_a_new_search_engine_or.json": "I opened a position in Alphabet yesterday for 2,599 a share. At a PE of around\n25, it's definitely not a bargain, but I don't think it's overvalued either for\na company that is still growing steady, has great free cash flow and margins,\nand is overall a high quality business.\n\nWhile they are…",
  "data/reddit-stocks/r/investing/comments/swej2l/how_will_tesla_fare_in_a_more_competitive.json": "The Ford F150 lightning is already back-ordered. Chevy and GMC have electric\npickups coming out this year. Anecdotally, I would never buy a Tesla but I'm\nvery interested in the Ford F-150 Lightning. Seems like Tesla has had easy\npickings for the last several years. Are those days coming to an end?",
  "data/reddit-stocks/r/investing/comments/swi6hm/would_it_be_a_mistake_to_put_100k_into_the_market.json": "I know I’ve heard time in the market beats timing the market, but would it be\nrisky/foolish to just open an account (let’s say with vanguard) and put 100k\ninto VTSAX right now? Or would I be better off contributing in 10k increments\nover a few months?\n\nWhat would you advise? I have foolishly let…",
  "data/reddit-stocks/r/stocks/comments/swh79m/recommendation_for_tech_stocks.json": "Hey folks,\n\nPersonally i am a firm believer in tech and i have some stocks which i like. I\nhave some cash and would like opinions/insights on which is possibly a better\npick. All views are welcomed! Pls no flamerino i am just a nooberino\n\n 1. Google\n 2. Datadog/unity\n 3. Cloudfare/crowdstrike\n 4.…",
  "data/reddit-stocks/r/stocks/comments/swmx1b/5_year_bet_goog_or_fb.json": "Pretty straightforward question: based on todays prices, which stock performs\nbetter over the next 5 years?\n\nGOOG is firing on all cylinders but is priced higher at ~24 P/E. FB has hit some\nturbulence recently and is taking a big bet on the Metaverse, but still very\nprofitable and arguably in value…",
  "data/reddit-stocks/r/wallstreetbets/comments/swa5b9/did_us_just_create_40_of_its_currency_in_the_last.json": "I heard that US printed 40% of its currency after march 2020. I have a few\nquestions regarding this\n\n 1. is it there any actual proof that this happened or is it just a conspiracy\n    theory.\n 2. How come the inflation is only 7% when 40 % of USD was just created out of\n    thin air .US dollar…",
  "data/reddit-stocks/r/investing/comments/swcvht/how_would_you_subjective_invest_50k_right_now.json": "I hope this type of question is allowed here.. I'm genuinely curious to know how\ndifferent people would approach this single scenario. Knowing that there is no\none \"right\" way to invest this type of money, I'm wondering how you -\nspecifically - would invest $50k cash right now?",
  "data/reddit-stocks/r/Bogleheads/comments/swd1mu/stressing_out_about_my_moms_retirement_need_advice.json": "My mom is 62 and looking to retire in 5 years. She has become a high income\nearner in the last 5ish years (200k+), but is naturally very frugal (lives on\nprobably 35k and has a paid off home). She has about 1mil between her 401k and\ncash (I think she's cash heavy at like $200k). She likes to be…",
  "data/reddit-stocks/r/stocks/comments/swsoko/shareholder_discounts.json": "List shareholder discounts/perks that you’re aware of. I’ll start.\n\n 1. Berkshire shareholders (1 B share or more) get 8% off of Geico insurance.\n 2. Ford shareholders (100 share minimum for 6+ months) get X plan pricing on\n    most vehicles (below MSRP).",
  "data/reddit-stocks/r/Bogleheads/comments/swlt4x/have_bonds_ever_come_through_for_you.json": "If so, please share.\n\nI and others have asked this many times over, so I apologize in advance.\n\nBut I'm really looking for somebody to change my mind.\n\nI am considering adding 1% to holding bonds from age 30-65 from 1% to 35%.\n\nAny recommendations for bond holdings?",
  "data/reddit-stocks/r/stocks/comments/swuinw/uber_what_a_fucking_piece_of_shit_company.json": "Link:\nhttps://www.nbcnews.com/news/us-news/pennsylvania-man-charged-killing-uber-driver-begged-life-rcna16935\n\n\n\n\nQuote:\n\nIn a statement to WXPI, Spicuzza's fiance, Brandon Marto, said other female Uber\ndrivers had reached out to him to say they believe the company provides\ninsufficient safety…",
  "data/reddit-stocks/r/wallstreetbets/comments/swo7dn/here_is_why_netflix_is_a_dumb_fuck_company_with.json": "That is right. It is a dumb fuck company. They did manage to run blockbusters\nout of business but at least blockbusters had the fucking movies I wanted to\nwatch. This is a story of why I cancelled my Netflix subscription and why I will\nbe shorting the stock before their next earnings (obv they lost…",
  "data/reddit-stocks/r/wallstreetbets/comments/swlvz9/nobody_cucks_the_zuck.json": "Mark Zuckerberg sits alone in his office, trying to grasp what has happened.\n\nHe's used to the mockery, the roasting; it's been his entire life. He can deal\nwith that. He knows what jokes smell like.\n\nBut Facebook? Meta? Up until now they were his shining city on the hill; his\nmagnum opus; his…",
  "data/reddit-stocks/r/Bogleheads/comments/swhk5s/charlie_munger_expects_index_funds_to_change_the.json": "https://www.wsj.com/articles/charlie-munger-expects-index-funds-to-change-the-worldand-not-in-a-good-way-11645055334?mod=hp_trending_now_article_pos4&mc_cid=e132b27fc5&mc_eid=db3db418dd\n\nWhat happens in a world where 5-10 people running trillion dollar index funds\nhave voting power in the largest…",
  "data/reddit-stocks/r/investing/comments/swtt8d/what_technologies_are_you_keeping_your_eye_on_for.json": "There are so many different technologies in development right now. By 2025 all\nnew chevy vehicles will be electric. There are startup trucking companies\nbuilding fully electric fleets.\n\nVR is growing more and more every week.\n\nMetamaterials are a promising technology with a wide range of…",
  "data/reddit-stocks/r/investing/comments/sx2iby/can_anyone_explain_to_me_why_charlie_munger_is_so.json": "As an investor, Charlie Munger seems to think there’s enormous opportunity in\nChina. He also seems to absolutely LOVE the CCP’s record of human rights abuses,\nand mentions them (admirably) every chance he gets. It’s bizarre.\n\n“We like our government because we’re used to it and it has advantages…",
  "data/reddit-stocks/r/stocks/comments/sx4kt9/is_the_equity_bubble_bursting.json": "Sp500 Is currently down 10% from ATH, Nasdaq -15%\n\nI wanted to make a poll but i can't, anyway the opinions i keep reading are:\n\n1-Yes, Bubble burst and this Is Just the start of a big drop.\n\n2-No, we are in a bubble but people still have a buy the dip mentality and so we\nwill make another leg up…",
  "data/reddit-stocks/r/Bogleheads/comments/sx3vtd/inflation.json": "Seeing lots of posts about inflation recently. Thought it might be a good idea\nto review it and some options you have to defend against it. And I will put my\npersonal positions at the bottom.\n\nFrom Deep Risk by Bernstein\n\nDeep Risk – Young investors series\n\n * 2 types of Risk\n   * Shallow Risk –…",
  "data/reddit-stocks/r/Bogleheads/comments/sx2g6z/do_i_need_bonds.json": "I have $1 million in my IRA 100% in VTSAX.\n\nI will be 50 this year.\n\nI will contribute $7,000/year to the IRA.\n\nI plan to retire in 10-15 years.\n\nI hold no bonds.\n\nAt retirement I will own my home free and clear. Conservatively it will be worth\n$800,000.\n\nI estimate social security over my lifetime…",
  "data/reddit-stocks/r/stocks/comments/sx5pc2/any_tips_on_how_to_recover_when_you_are_down_35.json": "I started investing in January 2021 after hearing from my friends how easy it\nwas and seeing that reddit stock sub make the news. I invested in Cathie Wood\nstocks, weed stocks, SPACs, and other unprofitable companies that kept being\nrecommended on reddit and YouTube. It didnt end well.\n\nI made a…",
  "data/reddit-stocks/r/stocks/comments/sx6klf/the_stock_is_not_the_company_and_the_company_is.json": "Just saw a video in which Jeff Bezos says the above quote. Explaining how Amazon\ndropped from $113/share to $6/share while all of the internal metrics were going\nup and showing a different story.\n\nIt got me thinking, which company/stock do you think falls into this?\n\nFor me some companies that come…",
  "data/reddit-stocks/r/stocks/comments/sx59lc/i_got_margin_called_best_way_to_recover.json": "I was holding a risky short position and ended up getting margin called. If it\ndidn’t happen I would’ve at least broke even. I ended up losing about 80k.\nWondering if anyone went through a similar experience. This is my first time\ngoing through something like this and I’m trying to build back my…",
  "data/reddit-stocks/r/stocks/comments/swuy3i/opening_a_new_account_and_buying_stocks_for_my.json": "I currently hold a bunch of retail favourite stocks, which have been absolutely\ndevastated recently. Ive been adding to my positions and averaging down every\nfew weeks. The volatility is insane but my focus is longterm.\n\nMy question is: Would you buy your kid the same stocks YOU chose based on…",
  "data/reddit-stocks/r/stocks/comments/sx6vvx/list_of_cognitive_biases_to_be_aware_off_when.json": "I came across this and thought it would be useful to list some of the biases\nthat can hinder our investment strategies.\n\n> “The first principle is that you must not fool yourself, and you are the\n> easiest person to fool.”Richard Feynman\n\nHere is a list of biases I summarized from this infographic…",
  "data/reddit-stocks/r/investing/comments/sx8dv7/thoughts_on_qyld_and_ryld.json": "They pay a fat dividend, so much so it seems almost too good to be true. (We all\nknow how that goes)\n\nSo what's the downside with these? The monthly dividends have seemed solid for\n~3 years now and the price is relatively stable on both. It seems they push\nnearly every cent earned back into the…",
  "data/reddit-stocks/r/stocks/comments/sx6gbp/3m_high_debt.json": "I know 3M (MMM) is a popular dividend stock and they make a lot of products\neveryone uses but they have about $16 billion in debt with around $4 billion in\ncash. Is anyone concerned about this? I know they’ve been going strong for\nlonger than I’ve been alive but this seems it could come back around…",
  "data/reddit-stocks/r/stocks/comments/sx8mfv/will_pypl_recover.json": "I’ve lost a lot of $$ from this stock. The fun part is that a financial advisor\ntold me to invest more in it, and that’s now screwing me over. In the past month\nit’s -70.81 (-40.59%). Not sure what to do. What does it look like, any chance\nof recovery back to $200+?????",
  "data/reddit-stocks/r/stocks/comments/sx7frt/whats_your_ytd.json": "So we're going through a \"market correction\" right now. Most people lost money.\n\nLooking at YTD since beginning of the year: Cathie's ARKK is down 33%, , TSLA\n29%, big hitter Microsoft 14%, SPY 9%. My portfolio is down 5.4%. Majority is\nETF, but with quite a bit of leverage/margin investment.\n\nIn a…",
  "data/reddit-stocks/r/Bogleheads/comments/sx56kg/do_i_follow_in_my_boomer_parents_footsteps.json": "I’ll spare all my financial specifics. 33, married, house, been saving.\n\nLast year, started relationship with same Ameriprise advisor that my parents\nuse.\n\nMy mom splits her investments between Ameriprise and Vanguard. To me, seems like\ndepression era and a huge missed opportunity.\n\nBetter to have…",
  "data/reddit-stocks/r/Bogleheads/comments/sx6vdn/classic_bernstein_series_of_forum_posts.json": "Classic Bernstein [https://www.bogleheads.org/wiki/Classic_Bernstein] -\nBogleheads wiki\n\nClassic Bernstein is a series of 12 forum posts which highlight the classic\ninvesting insights of William Bernstein\n[https://www.bogleheads.org/wiki/William_Bernstein], by forum member Simplegift.\n\n 1.  Classic…",
  "data/reddit-stocks/r/stocks/comments/sxfvcy/i_bought_tsla_in_2021_should_i_sell_and_take_the_l.json": "Bought TSLA at it‘s last spike (1100) - my plan was just to ride the wave a bit\nand then sell it again. That never happened\n\nNow I’m in the situation that I have to sit and wait for everything to get\nbetter. I would loose a lot of money, especially since I bought some extra\nshares on a credit base…",
  "data/reddit-stocks/r/stocks/comments/sxif44/this_board_is_8090_amateurs_who_just_started_even.json": "Check the sub stats, it's true. Most joined last year. All stock based content\non reddit is complete garbage and giving even the slightest credence to anything\nanyone says on here is beyond stupid. The same trash is upvoted daily and all\nthe popular comments are comically amateur.",
  "data/reddit-stocks/r/stocks/comments/sxfyqa/the_bubble_has_already_burst.json": "A lot of people here are wondering if the equity bubble is going to burst but\nyou're failing to realize it already has in many aspects of the market. High\nflier mid-small caps are all down over 50% + from their highs in an extremely\nshort period of time and the only equities left are large caps…",
  "data/reddit-stocks/r/investing/comments/sxe3b4/dead_cat_bounce_candidates.json": "I like to keep track of well known companies that suffer a sudden depreciation\nto their stock price, to consider taking a position if the knife appears to have\nstopped falling. Of the following recently hard hit stocks, which would you feel\ncomfortable buying shares in for a medium term time frame…",
  "data/reddit-stocks/r/stocks/comments/sxa0qe/how_do_day_traders_actuallydo_things.json": "Newbie here, trying to learn about stock trading and practice with non-existent\nmoney before I actually try things out. Out of all the YouTube guides and pages\nI've read, they cover a lot of concepts — candlestick patterns, moving averages,\npaying attention to the news, etc — but so few of them…",
  "data/reddit-stocks/r/stocks/comments/sxinf1/do_you_think_cathie_wood_is_right_to_say_the_idea.json": "A few days ago, Cathie Wood did an interview with CNBC where she talked about\nthe bear market that technology stocks are currently facing.\n\n\n\n> Specifically, Wood responded to the launch of the Short Innovation ETF, an ETF\n> created by Tuttle Capital Management that seeks to produce the inverse…",
  "data/reddit-stocks/r/wallstreetbets/comments/sxc8vv/massive_credit_suisse_leak_reportedly_reveals.json": "Credit Suisse was scrambling Sunday to contain the fallout from its latest\nscandal after several newspapers reported that more than 18,000 leaked accounts\nshowed that criminals, alleged human rights abusers and sanctioned individuals\nincluding dictators had been clients of the Swiss bank.\n\nThe…",
  "data/reddit-stocks/r/investing/comments/sxl9g8/russian_banking_system_to_be_closed_off_from_usd.json": "Per Reuters\n[https://www.reuters.com/world/exclusive-us-plans-cut-ties-with-targeted-russian-banks-if-ukraine-is-invaded-2022-02-21/]\n(2258 EST):\n\n> The United States will also wield its most powerful sanctioning tool against\n> certain Russian individuals and companies by placing them on the…",
  "data/reddit-stocks/r/stocks/comments/sxg4q9/are_old_stock_share_certificates_still_able_to_be.json": "Sorry if this isn't allowed, looked at the rules but couldn't find a definitive\nanswer.\n\nI have a stock certificate of 20 shares for $100 each from the Kentucky trust\ncompany of Louisville in 1882. Is it possible to \"collect\" from it now?",
  "data/reddit-stocks/r/stocks/comments/sxlw9w/the_google_split.json": "So here is the quick rundown for Google. It’s currently 3 classes of shares.\nClass A ($GOOG), Class B (preferred) and class C (GOOGL). Both class A and class\nC should have the same value on the markets however the only difference is the\nClass C ($GOOGL) has 1x value of voting rights. This however…",
  "data/reddit-stocks/r/Bogleheads/comments/sxsohk/most_costeffective_way_to_invest_in_vti_or.json": "I'm glad to say that my 12 year old son has been asking questions about\ninvesting recently, including how compound interest works, the best way to\ninvest, etc. He now wants to invest his monthly allowance ($50), or at least a\nportion of it, in long-term investments. I promised him I'd figure out…",
  "data/reddit-stocks/r/stocks/comments/sxts24/what_would_you_do_if_you_inherited_a_million.json": "The bubble is bursting so we are on the edge of ATH's and dropping, there are\nseveral rate hikes around the corner, and the state of world affairs is an\nunknown with a good chance for war. Bear markets are where millionaires are made\nand interest rates today are still negligible and not worth…",
  "data/reddit-stocks/r/Bogleheads/comments/sxuq4s/downsides_of_ibonds.json": "Are there any drawbacks to buying $10k in I-Bonds per year? It seems they're a\ngreat choice to park cash in. But I am wondering what the downsides are? I know\nabout the $10k annual limit. I know about the loss of 3 months interest if\nredeemed within 5 years. But what else am I missing?\n\nIt seems…",
  "data/reddit-stocks/r/stocks/comments/sxuaan/how_to_filter_out_all_the_bullshit_noise_as_a.json": "There is a flood of “I told you so” posts from the doomsayers right now. The\nproblem is that they have been saying this shit since about 2016. Now they are\ntaking a 10% dip as validation and everyone is upvoting them. Fact is: if you\nlistened to these idiots for the last 8 years, you’d have missed…",
  "data/reddit-stocks/r/stocks/comments/sxy1f5/us_companys_stocks_are_declining_in_foreign_stock.json": "Berlin - BER\n\nApple, -2,01% Microsoft, -0,70% Tesla, -1,12% Netflix -2,43%\n\nLondon - LSIN\n\nApple, -0,09% Microsoft, -2,65% Nvidia, -5,57% Tesla, -5,50% Starbucks, -1,06%\n\nMilan - MIL\n\nApple, -2,24% Microsoft, -1,62% Tesla, -0,44% Nvidia, -1,86% Netflix, -1,31%",
  "data/reddit-stocks/r/Bogleheads/comments/sxvoxz/my_company_offers_a_11_company_stock_match_with_a.json": "My company offers a 1:1 match for employees who purchase company stock, up to\n$5600 per year. The cash is taken out (post-tax) and invested quarterly. My\nshares are instantly available, but the catch is that the matched shares can\nonly be sold if they have been held for 36 months. If you sell a…",
  "data/reddit-stocks/r/investing/comments/sy2357/us_stock_market_futures_down_nearly_15_after.json": "> Russian President Vladimir Putin is set to recognize the independence of two\n> breakaway regions of eastern Ukraine, the Kremlin said Monday, a move that\n> could be a significant step toward possible invasion.\n> \n> The Kremlin said that Putin discussed his decision with French President\n>…",
  "data/reddit-stocks/r/stocks/comments/sy2xhh/to_the_veterans_who_went_through_the_2008_housing.json": "How much did you lose? What percentage of your net worth did you lose? How long\ndid it take you to recover?\n\nAs someone who lost 40% of his net worth this year, it would be great to hear\nyour long term journeys.",
  "data/reddit-stocks/r/Bogleheads/comments/sy0sne/analysis_can_market_sentiment_predict_future.json": "If investors are more bearish than normal, does that mean future returns are\nlikely to be low? After all, it seems like it could be bit of a self-fulfilling\nprophecy. If people are afraid of a crash, they're more likely to sell their\nassets, contributing to the very crash they fear. The reverse is…",
  "data/reddit-stocks/r/stocks/comments/sy3gj1/52_with_1k_to_invest_a_month_where_should_i_put.json": "Long time lurker. Appreciate the advice in this sub and the funny comments.\nPlease help me out and give me your opinions for the best investments at my age.\nI’m not rich but okay financially, would like to feel a bit more comfortable\nthough. Thanks a lot! Appreciate y’all!",
  "data/reddit-stocks/r/stocks/comments/sy7mvx/dow_futures_drop_more_than_400_points_as_tensions.json": "Stock futures fell sharply on Monday night, as traders continue to monitor\nbrewing tensions between Russia and Ukraine.\n\nFutures tied to the Dow Jones Industrial Average were down by 454 points, or\n1.3%. S&P 500 futures slid 1.7%, and Nasdaq 100 futures were off by 2.4%.\n\nRussian President Vladimir…",
  "data/reddit-stocks/r/stocks/comments/sy7n4e/bloody_day_tomorrow_hopefully_just_in_the_markets.json": "I've been preaching that Russia may not fully attack Ukraine, but will\nabsolutely not back off our pull back troops. Most of Reddit and CNBC have been\npreaching to buy the dip. Well, buying the dip is going to create some serious\nbag holders tomorrow. Folks, please stoo taking stock advice from…",
  "data/reddit-stocks/r/stocks/comments/sy5vcp/what_stock_do_you_think_could_be_a_possible.json": "I would love to hear everyone's favorite pick just for fun. Post the current pps\nso that we can come back in 6 months to a year and see who was accurate for\nbragging rights. Looking for a risk to put $2,000 down on.",
  "data/reddit-stocks/r/Bogleheads/comments/sy0lpz/wealth_management_for_my_retired_parents.json": "Hi, Bogleheads, I come seeking advice.\n\nSo, after four decades in their current home, my parents (both >75 and long\nretired) are selling their house and moving to be closer to my family. They’ll\nbe renting in a retirement community thereafter.\n\nMy folks have never been savers/investors—they…",
  "data/reddit-stocks/r/stocks/comments/sy6lex/brent_at_97_will_a_war_in_russia_trigger_larger.json": "I’m worried about these sanction packages being rolled out in the next couple of\ndays! My thoughts is that there could be a large stock sell off without the FED\ncoming in to stop the bleeding. What are your thoughts on how the markets will\nreact tomorrow or this week?",
  "data/reddit-stocks/r/wallstreetbets/comments/sy0era/russia_accepts_donetsk_and_lugansk_of_eastern.json": "Putin informed Germany's Scholz and France's Macron he will sign decree\nrecognizing independence of separatist republics in eastern Ukraine\n\nUkraine requested an urgent meeting of the UN Security Council to discuss ways\nto guarantee its security and de-escalate the crisis with Russia. The…",
  "data/reddit-stocks/r/Bogleheads/comments/sydidw/bogleheads_update_users_can_now_assign_custom.json": "Being able to customize flairs could prove useful, particularly for Bogleheads\nwho have country/region-specific questions (e.g. investors in the EU, AU, UK,\nCA, or wherever you may be!). Anyway, let's give it a shot: feel free to flair\nyour links/questions with whatever seems like the most helpful…",
  "data/reddit-stocks/r/wallstreetbets/comments/sxufe1/russian_stock_exchange_dropped_10.json": "MOEX dropped 10% today, looks like economic sanctions are in play. Putin play\nisn't working as he hoped for. USA and European aren't blinking, this reminds me\nof Cuban missile crisis, at the last moment Soviet union backed down. Soviet\nUnion was was mostly crippled with 79 Afghan war and they still…",
  "data/reddit-stocks/r/Bogleheads/comments/sye9ud/lifecycle_of_a_boglehead.json": "PART 1: THE VIRGIN\n\nI started out like like many of you. I had some extra cash from my college job.\nI stumbled upon some random Youtube video talking about savings accounts and\nmortgages and such. They mentioned S&P 500 index funds and 8% returns and I\nthought, \"Hey that's great!\" And so I put my…",
  "data/reddit-stocks/r/stocks/comments/sxxryc/do_you_think_paypal_and_facebook_will_recover.json": "I have made huge mistake investing too much in these 2 companies. Just wanted to\naverage down, but I went too far. My losses are about 40% on each. I have no\nfaith in individual stocks anymore, just what to break-even somehow and invest\n100% in VTI/VOO. I would like to cut my losses, but I don’t…",
  "data/reddit-stocks/r/stocks/comments/sycnum/a_history_of_bill_ackmans_best_defensive_hedge.json": "Hedging is a risk management strategy employed to offset losses by taking an\nopposite position in a related asset. Typically, hedging strategies will employ\nsome form of derivative financial instruments, such as options or futures\ncontracts. During turbulent times in the market such as the one we…",
  "data/reddit-stocks/r/Bogleheads/comments/syfcmq/lakshmi_bogleheads_inspired_commandline_tool_for.json": "I wanted to share Lakshmi [https://github.com/sarvjeets/lakshmi], a tool that I\nhave developed for managing a Boglehead style portfolio. It's a command-line\nprogram that allows tracking of overall portfolio, asset-allocation,\nasset-location, performance (IRR), need for rebalancing or TLHing etc.\n\nI…",
  "data/reddit-stocks/r/investing/comments/sycjd5/how_much_pain_will_russia_face_if_its_hydrocarbon.json": "So yeah, obviously the potential for a Russia-Ukraine conflict looms large in\nmarkets, especially oil and natural gas.\n\nEurope has already felt quite a squeeze\n[https://www.cnbc.com/2022/01/05/european-energy-prices-are-surging-creating-frightening-uncertainty.html]\nbefore this development, and…",
  "data/reddit-stocks/r/stocks/comments/syf4u1/statistically_speaking_you_cant_beat_the_market.json": "Mutual fund managers who trade stocks for a living (Ivy Degrees, backgrounds in\nmath, economics, computer science, etc) underperform the market 98% of the time.\n\nWhy do you try to beat the market if people who do it for a living cannot? Do\nyou think that you are smarter than they are, or that the…",
  "data/reddit-stocks/r/Bogleheads/comments/syg7mr/why_tilt_value.json": "All about Asset Allocation\n\n * 25% max dedicated toward factor tilts\n * If you want to tilt, above all, be patient and stick to your guns. Don't\n   chase returns. Once you decide to tilt, you need to stick with that strategy\n   and not bailout of it\n * Study in 1992 By Fama and French – Performance…",
  "data/reddit-stocks/r/stocks/comments/sybtuk/6_reasons_why_aapl_isnt_a_pandemic_stock.json": "tldr: Pandemic stocks had no fundamental changes to their services and products\nin the last 2 years. AAPL had some substantial changes that came during the\npandemic.\n\nIt makes a lot of sense that a lot of companies are normalizing back to\npre-pandemic values because people are slowly easing back to…",
  "data/reddit-stocks/r/investing/comments/sykr5d/facebook_has_lost_500_billion_in_value_since_the.json": "As the title says, Facebook has lost hugely since the meta rebranding and since\nthey announced their metaverse ambitions. Some part of the loss is also due to\nother factors such as new Iphone and EU privacy changes, but a large part wall\nstreet simply doesn't believe in the metaverse plan.\n\nThe…",
  "data/reddit-stocks/r/wallstreetbets/comments/syidhs/russian_stock_exchange_is_open.json": "So I woke up to this (all changes are today):\n\nhttps://preview.redd.it/kaxedu2efcj81.jpg?width=576&format=pjpg&auto=webp&s=77fba5e1f0b50b30ab3b018e8d8963c08b809583\n\nPlanning to buy some more today. Also, I'm an idiot who bought $SPGI when I\nstarted investing, thinking this is $SPY. But it was…",
  "data/reddit-stocks/r/wallstreetbets/comments/syidcu/adopt_a_ukranian.json": "A few months ago you were all so big on adopting big, ugly and rather useless\napes.\n\nNow that thermo-nuclear war is breaking out, why not show a little support and\nadopt a hottie.. err.. Ukrainian woman?\n\n\n\nI got…",
  "data/reddit-stocks/r/stocks/comments/syqueg/today_shows_how_unpredictable_the_market_is.json": "Today shows how unpredictable the market is. DOW futures were down more than 400\npoints and tech was down more than 3% last night. And EVERYONE was expecting a\nbloodbath tuesday, expecting msft to go below 260, amd below 100, etc. Well that\ndidn't happen, so the only take away is that market is…",
  "data/reddit-stocks/r/wallstreetbets/comments/syobd1/ntdoy_dd_nintendo_is_an_actual_money_printer_the.json": "Nintendo is ready to take you to tendie town.\n[https://super-nintendo-world.usj.co.jp/en/us/home]\n\nhttps://preview.redd.it/wwn3mq7lxdj81.jpg?width=730&format=pjpg&auto=webp&s=974a3144c31115409e5f2cd9d558e5560b766ecf\n\nDisclaimer: I am not a hedgie, and this post does not include 30 pages of\nscience…",
  "data/reddit-stocks/r/stocks/comments/sypwlq/us_economy_perks_up_as_omicron_fades_ihs_finds.json": "The U.S. economy accelerated in February as omicron waned and government\nrestrictions were lifted, a pair of IHS surveys showed, but businesses increases\nprices at the fastest pace on record as inflation got worse, according to pair\nof IHS Markit surveys of business executives.\n\nA “flash” index of…",
  "data/reddit-stocks/r/Bogleheads/comments/syu4vc/any_youngsters_ages_20_30_ish_actually_investing.json": "Usually, I see the advice for a 3 fund portfolio is somewhere along the lines of\nsubtracting 20 from your age, and that's your percentage of bonds. Or 120 - age,\nor flat out just taking your age.\n\nI've seen a lot of people in this sub just straight up not invest in any bonds\nwhen they're young, and…",
  "data/reddit-stocks/r/stocks/comments/syvlns/palantir_isnt_a_palatable_stock_even_after_its.json": "Does everyone feel the same about PLTR? I've been waiting for it to get to this\nsort of price but every info I come across on it seems to indicate to stay away.\nThe article below gives some insight into things I wasn't aware of; e.g. the\nPIPE…",
  "data/reddit-stocks/r/stocks/comments/syu9fi/who_ultimately_sets_the_price_of_a_stock.json": "I have a very basic understanding of the stock market in that, good news price\ngoes up bad news price goes down and there's a magical algorithm that determines\nthe price. But who sets the algorithm and price and how's it determined how much\nit goes up or down?",
  "data/reddit-stocks/r/Bogleheads/comments/syzar6/im_40_years_old_with_500mo_that_i_can_put_towards.json": "The title pretty much sums it up. I started investing during the GME craze and\nit hasn't gone well for me so far. So im pretty much starting from scratch. I do\nnot have a 401k nor a roth IRA. Im 40 years old and am scared i won't have money\nfor retirement. I would love to get some advice from some…",
  "data/reddit-stocks/r/stocks/comments/sz34c2/why_im_bullish.json": "With all of the bearish sentiment around here, I’d like to give a reason as to\nwhy I’m bullish through the rest of 2022.\n\n 1. Interest rate hikes have been priced in at this point. Unless the Fed does\n    something totally unhinged, the market should respond positively when the\n    hikes start…",
  "data/reddit-stocks/r/wallstreetbets/comments/synpkf/backtesting_the_most_popular_investment.json": "I have a confession to make. Even after all the analyses and strategies I have\ncreated [https://www.reddit.com/user/nobjos/?sort=top], I allocate most of my\ninvestments to the S&P500 while keeping some part of it for the moonshots. I\nhave told the exact same thing to everyone who has asked me…",
  "data/reddit-stocks/r/stocks/comments/syta8a/did_anyone_else_think_tan_was_a_good_idea_because.json": "Really thought clean energy stocks where going to be a thing last year so far\nit’s looking bleak. Is there any hope for the future of tan? Or should I cut my\nloss and move the money somewhere else? Just looking for opinions.",
  "data/reddit-stocks/r/stocks/comments/syyutn/what_triggered_the_dot_com_crash.json": "For those people that were around for it (I was in high school), how did the Dot\nCom crash play out? Was it one major event that happened and it triggered it? or\ndid the market just start breaking down because of valuations? I'm sure I could\nlook up some youtube videos on it, but I figured I would…",
  "data/reddit-stocks/r/investing/comments/syss2v/gs_strategists_seeing_further_6_decline_in_sp.json": "From Bloomberg\n[https://www.bloomberg.com/news/articles/2022-02-22/goldman-team-says-s-p-may-drop-6-if-ukraine-conflict-worsens]\n(Last update: February 21, 2022, 8:36 PM CST).\n\n> “Although Russia/Ukraine tensions appeared to affect primarily local assets in\n> January, spillovers to global assets…",
  "data/reddit-stocks/r/wallstreetbets/comments/sz6ngb/i_convinced_my_wife_to_sell_the_house_and_buy_the.json": "i Told her if we sell our house now, we can buy a bigger one in the future. So\nwe sold the house and now we are living in my parents house. Do you guys think\nwe should sell the stock now and accept the fact that we lost 100k in three\nmonths?\nhttps://imgur.com/a/NAkBleK",
  "data/reddit-stocks/r/investing/comments/sz8qrf/the_sp_500_has_registered_its_first_10_correction.json": "To add some perspective:\n\nThe entire COVID Crash only lasted 23 trading days while this correction is\nalready at 34 trading days\n\nWhile the S&P 500 is down 10% so far from its ATH, the FANGAM names which are\noften attributed to be the biggest contributors to the market for the past\ndecade are down…",
  "data/reddit-stocks/r/Bogleheads/comments/sz1km0/19_years_old_with_a_roth_ira_and_no_knowledge.json": "So I started a Roth IRA with Fidelity about a year ago and have been throwing in\nextra cash from all my paychecks on\n\n80% FZROX and 20% FTIHX.\n\nIs this fine? Anything I should be doing differently?",
  "data/reddit-stocks/r/wallstreetbets/comments/sz45i2/this_retard_just_got_a_bloomberg_terminal.json": "Hello fellow tards, I have just gotten myself a Bloomberg Terminal subscription.\nHow the fuck does a retarded ass ape like me use it and what is so good about\nit? Its interface sucks, it looks like some shit that hedgies use to make\nthemselves look so sophisticated; something my wife's boyfriend…",
  "data/reddit-stocks/r/Bogleheads/comments/sz79i5/did_you_find_bogleheads_guide_to_investing_or_a.json": "I’d also be interested in why one over the other. Thanks!",
  "data/reddit-stocks/r/Bogleheads/comments/szexno/nicely_summarized_from_jason_zweig.json": "Q:\n\nI am a Boglehead-type investor. I am sure you are familiar with the group, those\nwho follow the simple indexed style approach to investing. I am curious if you\nwould categorize them as following the herd? \n\n— Jordan Bergman, Ames, Iowa\n\nA:\n\nI see what you did there, Jordan. You sent me this…",
  "data/reddit-stocks/r/stocks/comments/szdi85/are_we_back_to_prepandemic_like_stock_market.json": "Funds continued to rotate away from growth stocks and are now more tilted to\nvalue than they have been since 2011, according to a Goldman Sachs analysis of\n788 hedge funds with$2.6 trillion of gross positions.\n\nExposure data calculated by Goldman Sachs show hedge fund net leverage is now at\nits…",
  "data/reddit-stocks/r/wallstreetbets/comments/sz8fsq/what_the_fuck_is_a_bloomberg_terminal.json": "I just read some post on here that a WSB user just got a Bloomberg terminal and\nhas no idea how to use it.\n\nIs this the biggest scam in finance? $25k a year for what? A computer from the\n90s? Does the Bloomberg terminal just print money for you? Do they know where\nthe market will go or something?…",
  "data/reddit-stocks/r/wallstreetbets/comments/syxi54/why_isnt_shit_goin_down.json": "Last week the possibility of war nearly fucked the market. Every report about a\nprobability to escalation immediately started a dip.\n\nBiden waited for his speech to the nation on friday till the market was closed.\n\nThen we had that frightening weekend, ending with the war speech of an…",
  "data/reddit-stocks/r/stocks/comments/szjozt/arkk_continues_to_unload_pltr_so_go_long.json": "Cathie Wood's Ark Invest unloads 11.7 million shares of Palantir in a\npost-earnings selling spree\n\nArk funds sold more than 11.7 million shares of Palantir Technologies on\nTuesday, the third time in a week. The $123.2 million sale came as the data\nanalytics company's stock fell after an earnings…",
  "data/reddit-stocks/r/wallstreetbets/comments/sz2lut/you_must_realize_that_all_wall_street_analysts.json": "Yes yes, this sub loves to roast Jim Cramer, then immediately utilize a Wall St.\nanalyst to back up their reasoning for Tesla going to 2000 by 2023. Hell, let us\nremember that Cathie Wood was heralded as a god only 2 years ago and she was the\nperson thinking we would be going through deflation…",
  "data/reddit-stocks/r/stocks/comments/szkhn7/wait_for_the_dip_after_the_dip_of_the_dip_before.json": "Have purchasing power left to buy myself in or average down on existing stocks,\nbut -even though I find current prices to be quite good already- I have this\nfeeling deep down it will continue dipping more for a good while.. 🤔 Wouldn’t\nwant to be left stuck holding too many bags, you know?",
  "data/reddit-stocks/r/wallstreetbets/comments/szivwl/twitter_is_selling_1000000000_of_junk_bonds_to.json": "https://www.bloomberg.com/news/articles/2022-02-23/twitter-selling-1-billion-of-junk-bonds-to-fund-share-buyback?utm_source=google&utm_medium=bd&cmpId=google\n\nTwitter Inc. is tapping the high-yield bond market to raise $1 billion in part\nto help repurchase stock, pay down existing debt and pursue…",
  "data/reddit-stocks/r/wallstreetbets/comments/szlm6l/we_already_had_a_metaverse_and_it_was_called.json": "Made in 2003, you could buy digital land, sell resources, clothing for avatars,\netc. It made a few millionaires from selling avatar customizations. It even\nopened up a world to crazy virtual sex stuff and gambling...\n\nBut that place had it's limits and it's easy to lose interest unless you're\nsuper…",
  "data/reddit-stocks/r/stocks/comments/szeb49/rstocks_daily_discussion_wednesday_feb_23_2022.json": "These daily discussions run from Monday to Friday including during our themed\nposts.\n\nSome helpful links:\n\n * Finviz [https://finviz.com/quote.ashx?t=spy] for charts, fundamentals, and\n   aggregated news on individual stocks\n * Bloomberg market news [https://www.bloomberg.com/markets]\n *…",
  "data/reddit-stocks/r/stocks/comments/sznhwu/heres_why_im_bearish.json": "As a response to the other post I saw...\n\n\n\n 1. Rates / currency / repo markets have priced in 6.5 rate hikes, not EQUITY or\n    other risk asset markets. If you survey CIOs/PMs that manage risk assets,\n    they still think 4 or less... NONE think 6 or 7.\n    1. In rate hiking cycles, the Fed has…",
  "data/reddit-stocks/r/Bogleheads/comments/szrq20/its_shopping_time.json": "VTI touching 212. We are truly in bear territory now. Time to start taking\nbigger bites into the total market.",
  "data/reddit-stocks/r/stocks/comments/szuf0w/whos_buying_tomorrow.json": "Stocks are getting destroyed in after hours, almost everything is in deep\ndiscount, MSFT is in $270's, Apple at $159, Google is close to below it's\npre-earnings 2 weeks ago, AMD and Nvidia are close to their 6 month low. What is\neveryone's play tomorrow? Will you wait out another week? A…",
  "data/reddit-stocks/r/stocks/comments/szuwrh/eli5_if_55_of_the_market_is_owned_by_passive.json": "Sure, some of those passive investors who haven't learned from history (the\nmarket always returns to highs eventually) might panic sell their assets, but my\ninstinct is that any panic selling on the passive side would surely be offset by\ninvestors and institutions who know to buy into fear.\n\nThis…",
  "data/reddit-stocks/r/investing/comments/sztshd/pypl_is_down_97_since_march_6th_2020.json": "I think that is absolutely staggering to think that Paypal a gigantic payment\nprocessing company across the world, has gone down almost 10% PAST the pandemic\nlows of March 2020! The chart is absolutely horrific and shareholders are\nfeeling it. Is FB on the way down as well? Definitely buying…",
  "data/reddit-stocks/r/stocks/comments/szs0ns/tech_stocks_discounts.json": "Looking at the tech stocks being down after great year end earnings and thinking\nthis might be an opportunity to get in at a cheap price. Would like to hear\nothers thoughts on this?\n\nI know the whole market is taking a beating this week so there’s opportunity\nelsewhere but I have a strong feeling…",
  "data/reddit-stocks/r/Bogleheads/comments/szveu4/i_analyzed_30000_stock_recommendations_by.json": "If an analyst makes 50 stock recommendations that outperform the market, does\nthat mean his subsequent recommendations are likely to beat the market as well?\nLikewise, if some analyst makes 50 bad recommendations, does that indicate that\nhis future stock picks will be bad?\n\nThat is the question I…",
  "data/reddit-stocks/r/wallstreetbets/comments/szul49/we_already_had_a_metaverse_since_2001_its_called.json": "It’s an open world sandbox where you could build your own character and interact\nwith other people from all over the world. There’s a sophisticated in game\neconomy with a digital currency called Runescape Gold that’s so meta that\nVenezuelans were able to survive off it after their economy…",
  "data/reddit-stocks/r/stocks/comments/szn4h3/crox_finally_hit_bottom_here_are_20_reasons_im.json": "I Love Crocs and I love the stock. But the stock has taken a beating unfairly\ndue to their recent acquisition, profit taking, and general market jitters for\nanything that has a supply chain. But the fact of the matter is, Crocs is an\nincredible company on a tear and it looks like the stock may have…",
  "data/reddit-stocks/r/investing/comments/szxukb/home_prices_increase_at_fastest_rate_in_34_years.json": "The numbers: The S&P CoreLogic Case-Shiller 20-city price index posted a 18.6%\nyear-over-year gain in December, up slightly from 18.3% the previous month. On a\nmonthly basis, the index increased 1.5% between November and December.\n\nMeanwhile, the Case-Shiller national home price index demonstrated…",
  "data/reddit-stocks/r/stocks/comments/t009dd/putin_says_russia_will_launch_a_military_action.json": "The United Nations Security Council convened an emergency meeting Wednesday\nnight as Russian President Vladimir Putin, in an early morning address local\ntime, said he would launch a military operation in eastern Ukraine.\n\nEarlier, European and U.S. officials scrambled to penalize Russia on…",
  "data/reddit-stocks/r/stocks/comments/szuitp/fb_intc_and_baba_will_be_top_performers_in_the.json": "I am placing a huge bet on these three stocks, FB, INTC, and BABA as I believe\nthey will yield significant returns over the next 5 years and destroy whatever\nthe market does.\n\nI'm going to give a very brief overview:\n\nFB: HUGE overreaction from earnings, they will continue to grow at a steady…",
  "data/reddit-stocks/r/Bogleheads/comments/szyehn/you_dont_take_anything_with_you_when_you_die_is_a.json": "Specifically, people in my family when I ask them why they don’t invest if they\ncan afford to.",
  "data/reddit-stocks/r/wallstreetbets/comments/szwhos/elon_musk_is_building_a_case_against_the_sec_and.json": "Link to article here\n[https://www.cnbc.com/2022/02/23/elon-musk-cheers-on-justice-department-probe-of-short-sellers.html]\n\nAbsolute chad move from the Emperor of EV’s. Going to buy more $TSLA in the\nmorning.",
  "data/reddit-stocks/r/wallstreetbets/comments/t00bz3/explosions_reported_in_kyiv_as_putin_says_russia.json": "Another Red day tommorow.\n\n\n\nhttps://www.cnbc.com/2022/02/23/putin-says-russia-open-to-diplomacy-as-moscow-hit-with-fresh-sanctions.html",
  "data/reddit-stocks/r/investing/comments/t039f6/moscow_exchange_suspended.json": "Article [https://tass.com/economy/1409307]\n\nMOSCOW, February 24. /TASS/. Trading on the Moscow Exchange has been suspended\nbecause the ruble and the Russian stock market fell to limits set by the\nExchange.\n\n\"Trading has been suspended on all markets. Notification about resumption will\nbe given…",
  "data/reddit-stocks/r/Bogleheads/comments/t0351c/need_some_encouragement_to_stay_the_course_now.json": "I know all the guidelines: stay the course, do nothing, don’t check your\naccounts frequently, etc. But I am not perfect emotionally and tend to be sad on\ndays like tomorrow morning in the US when on market open stocks will take an\nexpected 3-5% further slide and yo yo through the war. This kind of…",
  "data/reddit-stocks/r/Bogleheads/comments/szx3u3/this_bear_market_is_great_for_me.json": "I can sell my mediocre investments with less negative tax implications. This\nmoves my transition to full bogle up significantly.\n\nThis will mean I can set and forget way more easily.",
  "data/reddit-stocks/r/stocks/comments/t00uq6/i_feel_horrible_im_massively_profiting_off.json": "Loaded up shorts and went long oil a month ago.\n\nI'll donate to the Red Cross or something. I dunno.\n\nPresident Vladimir Putin authorised a military operation in eastern Ukraine on\nThursday in what could be the start of war in Europe over Russia's demands for\nan end to NATO's eastward…",
  "data/reddit-stocks/r/Bogleheads/comments/t0437e/expect_downturns_embrace_them_if_possible_and_if.json": "Short-term market downturns of this magnitude (and much higher!) are to be\nexpected. If you're going through your first small equity downturn right now,\nyou're not alone. If you find it stressful, try to avoid watching the news and\ncontinue investing as usual. Better yet: if you're young, cultivate…",
  "data/reddit-stocks/r/Bogleheads/comments/t05jhz/just_a_friendly_reminder_that_russia_is_only_03.json": "Diversification is key. International markets as a whole will survive. Stay the\ncourse.",
  "data/reddit-stocks/r/wallstreetbets/comments/t03mb8/war_belarus_incursion_into_ukraine_ukraine.json": "https://edition.cnn.com/europe/live-news/ukraine-russia-news-02-23-22/index.html\n\nhttps://www.theguardian.com/world/live/2022/feb/24/russia-invades-ukraine-declares-war-latest-news-live-updates-russian-invasion-vladimir-putin-explosions-bombing-kyiv-kharkiv\n\nLivestream of Ukrainian residents sadly…",
  "data/reddit-stocks/r/wallstreetbets/comments/t06827/cramer_says_russias_actions_in_ukraine_wont_be.json": "https://www.cnbc.com/2022/02/22/jim-cramers-playbook-for-investing-during-geopolitical-uncertainty.html\n\nHe also said to buy the dip, so who fucking knows?! The world's a crazy place,\nand even a broken Cramer can be right twice a day.",
  "data/reddit-stocks/r/stocks/comments/t09t8i/wtf_is_putin_actually_trying_to_achieve.json": "I just dont get it. Russian stock market falls 50% in one day, sanctions will\nfuck the russian economy even more than in 2014 and they just look stupid for\neveryone who doesn't listen to Russian propaganda + Nato is now more unified\nthan it was for years and supporting 200000 active troops isn't…",
  "data/reddit-stocks/r/wallstreetbets/comments/szxdp5/holy_shit_rick_dont_pretend_like_you_aint.json": "Like Jesus Christ man.\n\nThe series of bad news and instability has been insane.\n\nUkraine is actually beginning to somewhat have an invasion occur.\n\nSupply chain issues, inflation, insanely over leveraged economy and markets,\nfucking Evergrande etc.\n\nSpy has officially hit…",
  "data/reddit-stocks/r/stocks/comments/sztkxo/lmnd_drops_20_after_disappointing_outlook_q4.json": "Lemonade (NYSE:LMND) stock tumbled 20% in afterhours trading Wednesday after\npoor Q1 and full-year guidance, as well as missing Q4 earnings consensus\nestimate.\n\nSees Q1 revenue of $41M-$43M vs. consensus of $44.0M; in-force premium at March\n31 of $405M-$410M vs. $380.1M at Dec. 31, 2021.\n\nSees Q4…",
  "data/reddit-stocks/r/stocks/comments/t042xm/you_guys_learned_nothing_from_covid.json": "Crisis/Bad news = excuse to lower interest rates in this case keep them low.\n\nExpect the next Fed to not raise rates because \"tensions in Ukraine are\ndestabilizing financial markets.\"\n\nOn top of that expect hundreds of billions in further QE to fund the war effort\nand corporate welfare. They might…",
  "data/reddit-stocks/r/stocks/comments/t098jn/anyone_else_feeling_a_big_buying_day_today.json": "You either have or will soon see the news about Russia invading Ukraine and the\nabsolutely dismal looking futures. I have been buying the pay fees weeks and\nspent some time reorganizing my portfolio yesterday to free up as much cash as I\ncould for today. Obviously no one can ever know when the…",
  "data/reddit-stocks/r/Bogleheads/comments/t0324a/please_help_me_to_not_panic_sell_all_my_shares.json": "Title. I'm a new, young-ish (24) investor who just dumped most of his life\nsavings on VWRA back in November (at the absolute peak, it seems). I'm not sure\nif I'm able to keep investing every month as my income fluctuates and I'm going\nback to school. I understand this is the time to keep buying,…",
  "data/reddit-stocks/r/stocks/comments/t00q5b/how_did_stock_market_do_during_the_war_in.json": "Bad comparisons, but as the wars I am most familiar with, how did the market\nperform INITIALLY? Was inflation as bad as it is right now?\n\nIt seems like it didn't factor in much, but obviously a lot more factors now.\nAnd if not this war, which was the best for comparison?",
  "data/reddit-stocks/r/investing/comments/t09j6f/is_the_sp_500_still_overpriced_cape_pe_says_it_is.json": "Let's assume we see another drop off in the coming days of ~2% - 5%, would this\nmean the S&P 500 is still over priced? If not, what price would the S&P 500 need\nto be to be considered a \"good\" price?\n\nThe most current historic CAPE PE that I could find is 34.9, which is 74% over\nthe normal average…",
  "data/reddit-stocks/r/stocks/comments/t0c1xz/a_few_details_about_stock_market.json": " 1. They happen more than you think - pullbacks of 10% or more occurred 11our of\n    the last 20 years\n\n 2. Of those, 4 out of 20 years (20%) had pull backs of at least 30% during\n    their yearly lows\n\n 3. While over half of the last 20 years have had double digit pullbacks, only 4\n    of those…",
  "data/reddit-stocks/r/stocks/comments/t03o0u/with_russia_invading_ukraine_what_are_the_odds.json": "With Russia officially embarking on their campaign into Ukraine, futures are\nsupposedly tumbling. I was wondering what you guys think will happen: will the\nmarket buy the news, having already sold on the rumor of invasion? Or will it\ntank the stock market even more? Do you think it will be a crash…",
  "data/reddit-stocks/r/investing/comments/t0da9y/bitcoin_is_not_the_new_gold.json": "While today is only one day, I think that it pretty dramatically shows that\nbitcoin is not the new gold, as a lot of its proponents claim. As of 10am EST\nthis morning, bitcoin is down about 7% while gold is up about 2%. Something like\na Russian attack on Ukraine is what people have in mind when…",
  "data/reddit-stocks/r/stocks/comments/t07ttb/rstocks_daily_discussion_options_trading_thursday.json": "This is the daily discussion, so anything stocks related is fine, but the theme\nfor today is on stock options, but if options aren't your thing then just ignore\nthe theme and/or post your arguments against options…",
  "data/reddit-stocks/r/wallstreetbets/comments/t068vw/russia_leads_way_on_new_market_strategy.json": "The fed and the ECB should look at what the genius people at Russia are doing,\nthey just didn’t open their stock market so it can’t fall!! 🤯 How didn’t we\nthink of that?? If it ain’t open, our tendies can’t go away 🎓",
  "data/reddit-stocks/r/stocks/comments/t0by72/nasdaq_will_be_in_bear_market_upon_opening.json": "Be mindful of \"buying the dip\". Inflation is higher than it's been since the\n70s, FED is ratcheting up rates for possibly years to come (supposedly well into\n2023), $9 Trillion Balance sheet will be allowed to run-off, KYIV WILL FALL and\nit won't be the end of this, Housing is at all time highs,…",
  "data/reddit-stocks/r/Bogleheads/comments/t0b6dx/bitcoin_down_5_today_lmao_wasnt_it_supposed_to_be.json": "This shows we shouldn't get FOMO... Being invested in VTWAX or VT means taking\npart in most of the innovation in the whole world since the most innovative\nthings are most likely to be a part of stock exchanges when they get big... Even\ncrypto companies are listed in stock exchanges, if crypto is…",
  "data/reddit-stocks/r/investing/comments/t089vz/is_it_a_smart_move_to_invest_in_anything_right.json": "I have my emergency savings to afford all bills to support my self and SO for a\nyear in case either of us lose our job. Part of me wants to start investing in\nmy traditional ROTH and maybe a couple of other things and hopefully max out the\nRoth for the year. Or is there a possibility that I’ll lose…",
  "data/reddit-stocks/r/wallstreetbets/comments/t0e3di/why_you_might_not_want_to_be_so_optimistic.json": "With Russias attack on Ukraine, Its expected the US will trigger a full list of\nsanctions against Russia. Russia is expected to retaliate against America and\nEurope with cyber attacks against key infrastructure, including the financial\nsystem and government agencies.\n\nWith Russias attack on…",
  "data/reddit-stocks/r/Bogleheads/comments/t0drau/just_made_my_first_investment.json": "Wow I did it folks 100% in VT (i can only contribute 50$/month since my income\nbarely support me lol) Anyway, i just did it. Any thoughts?",
  "data/reddit-stocks/r/stocks/comments/t0jkb5/whats_stopping_china_from_trying_to_take_taiwan.json": "With the Russian invasion of Ukraine underway and the support shown by the\nChinese media towards Russia, what's stopping china from pulling the same stunt\nwith Taiwan a few months down the line.\n\nNow I know Taiwan is a major importance in supply chain and china might not want\nto risk crippling…",
  "data/reddit-stocks/r/stocks/comments/t0jkne/russia_has_a_smaller_gdp_than_the_benelux_1228th.json": "For those that are afraid to markets will go down the drain over todays invasion\nof Ukraine and the sanctions on Russia that were just announced and any future\nones. I would just like to point you to the fact that Russias impact is fairly\ninsignificant on the world economy except for very specific…",
  "data/reddit-stocks/r/wallstreetbets/comments/t0d4on/i_though_this_was_wallstreetbets_not.json": "yall are so late. your supposed to bet on the next events not react to them.\n\nyou should have been buying and holding puts weeks ago.\n\nnow that he finally invaded it's time to sell those puts and buy calls.\n\nso many people thought itd be smart to buy puts now that hes invaded but thats\nnow how it…",
  "data/reddit-stocks/r/stocks/comments/t0l0g8/wow_what_a_massive_swing_today.json": "I never saw this coming. Oil is down 7% last I looked and the geopolitical\nfriction is heating up. Is this a good place to jump in or just short covering.\nI could see the big moves in either direction.",
  "data/reddit-stocks/r/stocks/comments/t0lm69/can_someone_explain_why_the_market_is_actually.json": "With the invasion of Ukraine, I thought it would scare a lot of investors. The\nsanctions on Russia affecting many European countries hasn’t effected how well\nthe S&P 500 is doing as well as DOW and NASDAQ. Also the energy sector was the\nonly thing in the green at yesterdays close, someone explain…",
  "data/reddit-stocks/r/investing/comments/t0jd24/why_is_tech_going_up_today.json": "In pre-market trading, the big names in tech had all dropped by 3-5% after the\nnews of the Ukraine invasion broke. Now they're all 2-3% up from yesterday's\nclose (except Apple, which is at about 0% change). Why would market sentiment\nflip this drastically over the course of just today?",
  "data/reddit-stocks/r/stocks/comments/t0c3m0/nikola_recorded_no_revenue_in_q4_factset.json": "For $3b company, The title is almost satire. Stock on down for 6% (pretty good\non this historic day). And even this:\n\nSEC Investigation Update\n\nOn December 21, 2021, we confirmed our settlement with the SEC\n[https://c212.net/c/link/?t=0&l=en&o=3454294…",
  "data/reddit-stocks/r/stocks/comments/t0kxlf/the_other_2_times_the_qqq_gapped_down_3_and.json": "The other 2 times the $QQQ gapped down 3% and finished the day up over 3% were\nin 2000 and 2008\n\nAgain, volatility especially with these massive swings ups and downs are common\nthemes in a BEAR MARKET.\n\nedit: stand correct, this dates are 4/27/00 and 5/4/01 not 08.",
  "data/reddit-stocks/r/investing/comments/t0csuu/did_the_fed_wait_too_long.json": "It looks like the fed were waiting to engineer a 'perfect landing' from low\ninterest rates. As inflation continued to rise starting March 2021 @ 2.6% and\nending the year Dec @ 7% (https://stocksera.pythonanywhere.com/inflation/)\n\nThey continued to push back from moving rates up by even .25% when…",
  "data/reddit-stocks/r/stocks/comments/t0lnx1/why_stocks_recovered_performed_so_well_today.json": "I had orders set for tsla 700 and goog 2500 but greed took over and cancelled\nthem before opening thinking it will keep tanking.\n\nBut obviously it didn’t and did quite the opposite…\n\nI’m baffled, someone please enlighten me",
  "data/reddit-stocks/r/wallstreetbets/comments/t0hsnn/markets_will_recover_people_will_stay_dead.json": "Markets do not matter right now. We know that eventually, the market will bounce\nback like it always does. People are losing their lives, and that is the bigger\nissue at hand. My thoughts and prayers go out to all the people affected by this\nconflict.\n\nAll of these discussions happening in the…",
  "data/reddit-stocks/r/wallstreetbets/comments/t0f2hc/citadel_trims_2_billion_stake_in_melvin_capital.json": "https://risingcandle.com/marketnews/citadel-trims-2-billion-stake-in-melvin-capital/\n\nCitadel LLC is reducing its $2 billion stake in Melvin Capital Management, Wall\nStreet Journal reported today. The move came just after the hedge fund struggled\nto rebound out of a relatively close collapse…",
  "data/reddit-stocks/r/wallstreetbets/comments/t0nxx8/shut_the_fuck_up_with_your_stupid_conspiracy.json": "Every fucking time I check this subreddit, I have to read some highly upvoted\nthread from some absolute moron, even by wsb standards, \"WHY THE LIZARD PEOPLE\nPREVENTED SPY FROM GOING -40% TODAY\" or some absolutely tarted again shit like\nthat. The stock market acted unpredictably today? What a…",
  "data/reddit-stocks/r/Bogleheads/comments/t0m3gk/what_do_boggleheads_think_of_life_insurance.json": "Almost every “investor” I speak to talks about life insurance and that i should\nlook into it.\n\nDoes anyone have info then can share?\n\nEDIT:\n\nAnswer is clear, once again thank you all for always pointing me in the right\ndirection.",
  "data/reddit-stocks/r/stocks/comments/t0omba/i_believe_stocks_will_rally_because_sanctions.json": "After many months of waiting, I believe markets finally heard what they were\nlooking for from the President today. Biden's speech made it very clear that the\nWest will not impose sanctions that will hurt their own economy.\n\nSo no ban on gas imports. No banning Russia from SWIFT.\n\nThat's it! That's…",
  "data/reddit-stocks/r/stocks/comments/t0qem3/block_square_stock_jumps_18_ah_after_earnings_top.json": "Square-parent Block (SQ) reported December-quarter earnings, net revenue and\ngross payment volume that topped analyst estimates, despite growth slowing for\nconsumer Cash App services. SQ stock jumped in extended trading amid updated\nguidance amid the acquisition of Afterpay.\n\nSan Francisco-based…",
  "data/reddit-stocks/r/Bogleheads/comments/t0p0wi/everyone_just_chill_out.json": "Just relax, stop speculating and overthinking. the market is going down, and it\nwill be fine.\n\nYou'll all be fine",
  "data/reddit-stocks/r/stocks/comments/t0uoev/sold_all_stocks_today.json": "I booked 20% loss YTD and just moved on. 2020, 2021 and 2022 combined, I am\nbarely above break even (bought a couple of laptops and Dolce & Gabbana handbag\nwith profits).\n\nWas hoping to buy a Tesla but did not want to sell my Sedan before I go broke.\nROFL.\n\nMy lessons:\n\n 1. I was a bull market…",
  "data/reddit-stocks/r/investing/comments/t0mvvd/coinbase_posts_big_revenue_beat_but_expects.json": "Article: https://www.cnbc.com/2022/02/24/coinbase-coin-earnings-q4-2021-.html\n\n> Coinbase reported fourth-quarter earnings that beat analyst estimates after\n> the bell on Thursday. Shares bounced around after the report. They were down\n> about 5% after hours before the call with analysts.\n> \n> Here…",
  "data/reddit-stocks/r/wallstreetbets/comments/t0kx8o/stock_market_currently_possible_being_manipulated.json": "So I heard this interesting take today where someone basically said that the USA\nwont allow the stock market to panic sell as it wants to show Russia that\ninvestors & citizens have trust and confidence in the might of the USA. Also it\ncan't be a coincidence that Biden literally used the Russia…",
  "data/reddit-stocks/r/Bogleheads/comments/t0swe1/so_me_and_my_wife_are_young_and_want_to_passively.json": "After some research and discussion on r/stocks [/r/stocks], We opened a Roth IRA\nwith fidelity and plan to invest in ETFs!\n\nDo you guys typically invest into multiple ETFs? And which ones are y’all\ndropping $ into?",
  "data/reddit-stocks/r/stocks/comments/t0kgcr/are_people_actually_buying_or_are_shorts_just.json": "There’s a lot of movement in stocks today, starting down around -5 % to -10% and\nthen stocks rebounding to positive 3-4%. But I don’t see a lot of volume. Do you\nthink buyers are stepping in or do you think it’s shorts covering there\nposition?",
  "data/reddit-stocks/r/wallstreetbets/comments/t0xbf1/the_department_of_justice_is_reportedly_exploring.json": "Rise of the Planet of the Apes about to look like a documentary.\n\n\"Stock Market Short-Sellers Could Be Hit With Racketeering Law: Report\"\nhttps://markets.businessinsider.com/news/stocks/stock-market-short-sellers-doj-investigation-mafia-law-rico-racketeering-2022-2?amp\n\nThe Department of Justice is…",
  "data/reddit-stocks/r/investing/comments/t0yv0y/is_it_just_me_or_did_the_markets_turn_around.json": "I noticed that yesterday, early, the markets crashed. Which seemed reasonable.\nLater that day losses reduced and some assets turned even positive (crypto,\nNASDAQ shares, …)\n\nApparently there is a correlation with sanctions that were brought upon Russia.\nHowever that is not gonna change much. Is it…",
  "data/reddit-stocks/r/wallstreetbets/comments/t0i8il/meme_stocks_are_rallying_amid_ukraine_invasion.json": "Apparently invasions are bullish for meme stocks. What a market we live in, and\nfancy bit gift card tokens are plummeting, so much for “crisis storage”\napparently buying GameStop would have been better for crisis management than\nshit token.\n\nOil, Gold and GME is that the new economy?",
  "data/reddit-stocks/r/Bogleheads/comments/t12p5b/is_it_really_this_easy.json": "Just invested into VWRP (Vanguard FTSE All-World UCITS ETF USD Acc) as I'm UK\nbased, 26 years old. Will be making large investments monthly.\n\nNow I just need to find a Bond fund to invest into, any recommendations for a UK\ninvestor?. Using H&L as I'm in the Channel Islands. I'm planning to go…",
  "data/reddit-stocks/r/stocks/comments/t0rgw5/me_and_my_wife_are_young_we_want_to_invest.json": "I was talking to my wife about it. Truthfully, I watched all of the GME / AMC\nstuff for awhile and it honestly just seemed too much like gambling to me.\nThat’s NOT… what we want to do (even though I know stocks themself are a\ngamble).\n\nWe want to invest maybe $50 a week on something and just…",
  "data/reddit-stocks/r/wallstreetbets/comments/t15zeg/ukraine_exports_70_of_global_neon_supply_needed.json": "I don't see Ukraine exporting much anytime soon and it would take a long time to\nadd new production. So what should we avoid? Chipmakers, auto makers,\nelectronics manufacturers....\n\nAMC might do alright. People will be bored without electronics.\n\nCNBC…",
  "data/reddit-stocks/r/stocks/comments/t1cd2o/great_news_sec_proposes_new_rule_requiring.json": "Gary Gensler has been circling short-sellers for months, and now the Securities\nand Exchange Commission chief is looking to make a big move. Under a new rule\nproposed by the SEC Friday morning, some investors would be required to report\ntheir short sale-related activity to the SEC on a monthly…",
  "data/reddit-stocks/r/stocks/comments/t18t6u/how_long_does_a_crash_really_last.json": "Read an article which said the S&P 500 has never had a negative return in a 5\nyear period. Another said a 10 year period.\n\nA quick look at a Google chart however shows a 50% dip from March 2000 to March\n2009.\n\nOr if you bought in June 2000, you'd have to wait until January 2013 before your\nmoney…",
  "data/reddit-stocks/r/investing/comments/t19sqp/whats_a_good_place_to_store_your_emergency_fund.json": "I have gotten a decent amount saved up for an emergency fund and I'm thinking\nabout just moving that to a separate account, such as a high yield savings\naccount or treasuries, since even high yield savings accounts are very \"high\nyielding\".\n\nWhere do you store your emergency funds?",
  "data/reddit-stocks/r/stocks/comments/t1dp79/forget_us_markets_bouncing_back_why_did_russian.json": "You can make plenty of arguments why US markets have bounced back yesterday and\ntoday.\n\nWhy the hell did Russian markets bounce back? Does everyone think once Russia\nhas taken over Ukraine all the sanctions will just be lifted? If that happens,\nwhat does that say about the viability of any nation's…",
  "data/reddit-stocks/r/investing/comments/t1db1p/why_is_it_unlikely_now_that_the_fed_raises_rates.json": "So inflation is high already. Increasing energy prices will fuel further\ninflation and my monkey brain tells me that higher rates counter that.\n\nIf the FED is not going to do what they said they would do few weeks ago,\nmeaning raising rates many times in 2022, wouldn’t inflation go off the roof?\n\nI…",
  "data/reddit-stocks/r/wallstreetbets/comments/t1epa0/im_fucking_done_with_this_shit_im_out.json": "Every fucking instinct I have is always 100% wrong.\n\nA war breaks out?\nThat's probably not good for the economy right? Let's buy puts! GET FUCKED,\nBIGGEST RALLY IN THE HISTORY OF THE S&P 500.\n\nNow I know what you're thinking, If every instinct I have is wrong then the\nopposite has to be…",
  "data/reddit-stocks/r/Bogleheads/comments/t1dmmc/am_i_the_only_one_who_finds_watching_my.json": "The advice here always seems to be just invest and don’t look at it otherwise\nyou might panic. But I feel the opposite is true for me. The more you watch it\nthe more you start to understand overall market trends, and so whenever it takes\na big dip I never panic. I know it will bounce back and so I…",
  "data/reddit-stocks/r/investing/comments/t15qkh/how_much_do_you_put_in_unconventional_investments.json": "I was wondering about what alternative/non-traditional investments do people\nhere invest in. Most people invest in stocks and bonds. I’m wondering how much\nif anything any of you have invested in other things? Have you hopped on the\ncrypto bandwagon? P2P lending? Collectables?\n\nI have invested 30%…",
  "data/reddit-stocks/r/stocks/comments/t1ipfe/nancy_pelosi_has_made_large_trades_into_lockheed.json": "In recent times, more and more officials have been exposed to be making large\ntrades ahead of World events.\n\nI’m shocked by this recent trade from Nancy Pelosi. There seems to be no moral\ndilemma for her in this situation.\n\nDo you draw the line, when it comes to trades and investment?\n\nAlso, does…",
  "data/reddit-stocks/r/Bogleheads/comments/t1eclt/had_a_realization_today_i_dont_care_how_the.json": "This isn't true if you hold individual stocks. In that case, you've got to pay\nattention and rebalance.\n\nP.S. Since I'm not touching it for a long time, it is in my interest for prices\nto be lower right now while I'm putting money into the market.",
  "data/reddit-stocks/r/investing/comments/t1ivo8/china_lifts_restrictions_on_russian_wheat_imports.json": "China lifts restrictions on Russian wheat imports\n[https://www.cnn.com/2022/02/25/business/wheat-russia-china-intl-hnk/index.html]\n\nChina has relaxed restrictions on imports of Russian wheat, a move that could\naddress food security concerns in the world's second largest economy and ease\nthe impact…",
  "data/reddit-stocks/r/Bogleheads/comments/t1lmft/vanguard_just_lowered_expense_ratios.json": "https://www.prnewswire.com/news-releases/vanguard-reports-expense-ratio-changes-across-equity-and-bond-funds-301490539.html\n\nThe boglehead favorite VT is now .07, along with 17 others. Not sure when this\ntakes effect as the official fund sites still state the current expense.\n\nIt ain't much, but…",
  "data/reddit-stocks/r/stocks/comments/t10vig/rstocks_daily_discussion_fundamentals_friday_feb.json": "This is the daily discussion, so anything stocks related is fine, but the theme\nfor today is on fundamentals, but if fundamentals aren't your thing then just\nignore the theme and/or post your arguments against fundamentals…",
  "data/reddit-stocks/r/investing/comments/t1vl7i/the_complete_list_of_russian_companies_listed_on.json": "Thought I’d just share this information.\n\n1 FEDERAL GRID COMPANY OF UNIFIED ENERGY SYSTEM, PUBLIC JOINT-STOCK COMPANY\nUtilities\nMain Market\n\n2 JSC VTB BANK\nBanks\nMain Market\n\n3 LENTA INTERNATIONAL PUBLIC JOINT-STOCK COMPANY\nPersonal Care, Drug and Grocery Stores\nMain Market\n\n4 NOVOLIPETSK STEEL…",
  "data/reddit-stocks/r/stocks/comments/t1hm76/you_can_only_own_four_stocks_in_your_retirement.json": "You can only hold four stocks in your tax-sheltered retirement account. The only\nrules are:\n\n 1. You need to DIVERSIFY (I.e., they can’t all be in FAANG);\n\n 2. At least one must be a foreign equity (outside N. America);\n\n 3. ONLY ONE may be an ETF or a conglomerate like Berkshire;\n\n 4. Each holding…",
  "data/reddit-stocks/r/stocks/comments/t1um96/should_i_even_be_buying_individual_stocks.json": "Should someone like myself even be purchasing individual stocks? I only started\nbuying stocks recently (2020/2021) along with many others who don’t know what\ntheir doing. I’m going to keep it real….I HATE researching stocks! I couldn’t\ncare less about PE ratios, forward or backwards, market share…",
  "data/reddit-stocks/r/stocks/comments/t225g2/attention_robinhood_users.json": "You can NOT add a beneficiary\n\nYou can NOT add an additional account holder. You only have the ability to add a\ncontact person, which is not a beneficiary. If you die without a will/trust,\nyour money in your account goes into probate. Then your loved ones, who know you\nhave money in Robinhood have…",
  "data/reddit-stocks/r/Bogleheads/comments/t223ci/warren_buffetts_annual_letter_to_shareholders_of.json": "Letter released this morning\n[https://www.berkshirehathaway.com/letters/2021ltr.pdf] [PDF]\n\nOlder letters [https://www.berkshirehathaway.com/letters/letters.html]\n\nI generally enjoy reading Warren Buffett's annual letters to Berkshire Hathaway\nshareholders. Figured I'd share here in case others may…",
  "data/reddit-stocks/r/stocks/comments/t22kr4/swift_eu_leaders_line_up_to_back_banning_russia.json": "https://www.theguardian.com/world/2022/feb/26/swift-eu-leaders-line-up-to-back-banning-russia-from-banking-network\n\nMore EU countries – including France, Italy and Greece – have said they would\nback a ban on Russia using the Swift global payments network in a bid to pile\nfurther pressure on the…",
  "data/reddit-stocks/r/investing/comments/t23v24/sp_cuts_russias_rating_to_junk_moodys_issues_junk.json": "https://www.reuters.com/markets/rates-bonds/moodys-puts-russia-ukraine-ratings-review-downgrade-2022-02-25/\n\nRussia's invasion of Ukraine triggered a flurry of credit rating moves on\nFriday, with S&P lowering Russia's rating to 'junk' status, Moody's putting it\non review for a downgrade to junk,…",
  "data/reddit-stocks/r/stocks/comments/t1x92t/warren_buffetts_annual_letter_and_berkshire.json": "https://www.berkshirehathaway.com/2021ar/2021ar.pdf\n\nHighlights:\n\nTaxes have grown from $100 per day to $9 million per day under their leadership\n\nBuffett brands company as American Infrastrucure play\n\nFlexes Insurance business and BNSF permanence. Predicts BNSF will be the\nbackbone of America 100…",
  "data/reddit-stocks/r/stocks/comments/t23vm5/sp_cuts_russias_rating_to_junk_moodys_issues_junk.json": "https://www.reuters.com/markets/rates-bonds/moodys-puts-russia-ukraine-ratings-review-downgrade-2022-02-25/\n\nRussia's invasion of Ukraine triggered a flurry of credit rating moves on\nFriday, with S&P lowering Russia's rating to 'junk' status, Moody's putting it\non review for a downgrade to junk,…",
  "data/reddit-stocks/r/Bogleheads/comments/t23yhb/pros_and_cons_100_vt.json": "Anyone do this instead of allocating the 20% to BND?",
  "data/reddit-stocks/r/stocks/comments/t27jri/nvidia_completely_compromised_for_two_days_by.json": "Nvidia, the United States’ biggest specialized microchip-making company is\nlooking into an “incident” from over the weekend which left its internal systems\n“completely compromised” for the past two days.\n\n“We are investigating an incident. Our business and commercial activities\ncontinue…",
  "data/reddit-stocks/r/investing/comments/t290wc/west_to_cut_some_russian_banks_off_from_swift.json": "https://www.bbc.com/news/world-60542433\n\nThe EU, US and their allies have agreed to cut off a number of Russian banks\nfrom the main international payment system, Swift.\n\n\"This is intended to cut off these institutions from international financial\nflows, which will massively restrict their global…",
  "data/reddit-stocks/r/wallstreetbets/comments/t28vb6/cnbc_russia_to_be_removed_from_global_swift_system.json": "So here we go: The U.S., The U.K., The E.U. have all pledged to remove Russia\nfrom the swift system\n\nhttps://www.cnbc.com/2022/02/26/eu-uk-canada-us-pledge-to-remove-selected-russian-banks-from-swift.html",
  "data/reddit-stocks/r/stocks/comments/t2dodc/starlink_went_live_in_ukraine_in_response_to.json": "Basically the title.\n\nUkraine requested Starlink access to defeat Russian attempts to disconnect them\nfrom the net.\n\nMusk responded that service is now online, and \"more terminals are on the way\",\nsuggesting terminals had already been delivered.\n\nNow as we know, Ukraine is being attacked by Russia,…",
  "data/reddit-stocks/r/stocks/comments/t2fm5y/amd_and_intel_suspending_processor_shipments_to.json": "> Under new export control regulations and sanctions imposed by OFAC, Intel,\n> AMD, and even TSMC may be suspending chip supplies to Russia.\n> \n> A new report claims Intel and AMD are suspending sales of industrial\n> processors to Russia.\n> \n> The companies would be following new rules set by OFAC…",
  "data/reddit-stocks/r/stocks/comments/t1xhw8/wall_street_week_ahead_for_the_trading_week.json": "Good Saturday morning to all of you here on r/stocks [/r/stocks]! I hope\neveryone on this sub made out pretty nicely in the market this past week, and\nare ready for the new trading week ahead. :)\n\nHere is everything you need to know to get you ready for the trading week\nbeginning February 28th,…",
  "data/reddit-stocks/r/Bogleheads/comments/t28h2n/once_ive_secured_my_emergency_funds_what_amount.json": "I'm new to this and reading a lot. Any and all information is incredibly\nappreciated!",
  "data/reddit-stocks/r/stocks/comments/t1yuni/russian_stocks_before_and_after.json": "In the year leading up to this week, Russian stocks traded in the US markets\naveraged a total weight-adjusted return of 11.0%. Since the beginning of this\nweek, they have lost -17.0%.\n\nGoes to show how fast one can go from sugar to crack.",
  "data/reddit-stocks/r/stocks/comments/t2ev5u/tanker_rates_on_russian_crude_routes_triple.json": "[Per this News outlet:](http://\"Tanker Rates On Russian Crude Routes Triple   |\nOilPrice.com\"\nhttps://oilprice.com/Latest-Energy-News/World-News/Tanker-Rates-On-Russian-Crude-Routes-Triple.amp.html)\n\n> Amid a general unwillingness of tanker owners to send their vessels to Russian\n> ports, the…",
  "data/reddit-stocks/r/stocks/comments/t27ova/changes_need_to_be_made_invest_in_democracies.json": "I have rebuilt some of my screens for international investing. Essentially, it\nis too easy to get whacked if one invests in emerging markets. While they are\npotentially profitable, the volatility in these markets can be too much for a\ntypical investor to endure. Here is some data, based on 12-month…",
  "data/reddit-stocks/r/Bogleheads/comments/t2n3lx/25k_lump_sum.json": "Good morning Bogleheads.\n\nSpouse and I max out retirement accounts, back door roth, 529 contributions, etc\nyearly and realized we have a little too much sitting in bank accounts not doing\nanything for us.\n\nOpened up a taxable account through vanguard and would like to park $25k with\nmedium to long…",
  "data/reddit-stocks/r/Bogleheads/comments/t2he21/are_bogleheads_socially_responsible.json": "And, if so, what are some Socially Responsible Investments for me to look into?",
  "data/reddit-stocks/r/wallstreetbets/comments/t2qwfi/im_the_guy_that_said_russia_is_not_going_to.json": "Judging by the recent events, my predictions are now aging like week old milk in\nthe summer sun. Not only are they wrong, they are so spectacularly wrong I\nhonestly believe I qualify for disability benefits.\n\nBut, before I exile myself back to talking about Fed policies and option\nfundamentals, in…",
  "data/reddit-stocks/r/investing/comments/t2rtf1/now_that_google_has_split_their_stock_will_other.json": "Google is at $2689 and recently announced a 20:1 split. I'm wondering if other\ncompanies will follow suit. Amazon is the most obvious one to wonder about, at\n$3076 a share and competes for the same investors as Google. Others are Chipotle\nat $1497, Autozone at $1864, and Tesla at $810.\n\nI know this…",
  "data/reddit-stocks/r/stocks/comments/t2pu9e/where_to_put_my_wifes_money.json": "My wife is 26, a nurse, and has about $8k to put somewhere. Where should she\nstash this? I’m always seeing people request some Vanguard funds or QQQ, so just\ncurious for the long run!\n\nThanks in advance",
  "data/reddit-stocks/r/Bogleheads/comments/t2awlj/why_bnd_over_govt.json": "Obviously we're talking bonds....assuming you include these in your\nportfolio.....\n\nI'm not here to debate, I just want to hear why from some spirited and\nknowledgeable people.",
  "data/reddit-stocks/r/Bogleheads/comments/t2sqz8/what_is_the_general_consensus_on_100_vt.json": "I see people say it’s a meme, I see people putting their life’s savings into it.\nI believe the Bogle strategy is an 80/20 split (with bonds later in life) but I\nknow 100% VT is quite a bit more in international stocks so how is that taken\nhere?\n\nI’m 21 and plan on holding 100% VT until I decide…",
  "data/reddit-stocks/r/stocks/comments/t2uiat/bp_said_on_sunday_it_plans_to_abandon_its_1975.json": "BP said on Sunday it plans to abandon its 19.75% stake in oil giant Rosneft\n(ROSN.MM) in the wake of Russia's invasion of Ukraine, marking an abrupt and\ncostly end to 30 at times fraught years operating in the oil-rich country.\n\nThe British oil and gas giant did not say how it planned to exit its…",
  "data/reddit-stocks/r/investing/comments/t2v6cx/bp_to_exit_1975_rosneft_shareholding.json": "https://www.bp.com/en/global/corporate/news-and-insights/press-releases/bp-to-exit-rosneft-shareholding.html\n\n> bp will exit its 19.75% shareholding in Rosneft.\n> \n> Both bp-nominated directors to resign from Rosneft board with immediate effect\n> \n> bp will no longer report reserves, production or…",
  "data/reddit-stocks/r/Bogleheads/comments/t2vbts/do_any_younger_investors_ever_get_nervous_that.json": "I think about this a lot, especially with global warming coming into play. would\nlove some thoughts on this",
  "data/reddit-stocks/r/wallstreetbets/comments/t2r0dz/moex_is_offline.json": "The entire Moscow exchange is offline.\n\nThey halted all trades within. Even their main portal is completely offline.\nProbably also targeted by Anonymous in their effort to DDOS all state websites.\nhttps://www.moex.com/en/\n\nWe are witnessing the greatest downfall in the history of the Russian…",
  "data/reddit-stocks/r/stocks/comments/t2xwcj/norway_says_its_sovereign_fund_will_divest_from.json": "Norway's $1.3 trillion sovereign wealth fund, the world's largest, will divest\nits Russian assets following Russia's invasion of Ukraine, the Norwegian prime\nminister said on Sunday.\n\nThe fund's Russian assets, consisting of shares in some 47 companies as well as\ngovernment bonds, were worth 25…",
  "data/reddit-stocks/r/wallstreetbets/comments/t2u0uc/norwegian_state_pension_fund_will_liquidate_all.json": "Just announced on a press conference by the Norwegian government. Sources:\n\n * https://www.vgtv.no/video/233573/direkte-siste-fra-krigen-i-ukraina\n * https://borsen.dagbladet.no/studio/borsenstudio/608?post=86622",
  "data/reddit-stocks/r/stocks/comments/t2td66/nvda_and_amd_worth_it_now_which_one.json": "Considering buying one or both and holding for the long term. Would you buy NVDA\ntoday at $240? What about AMD today at $120? Waiting around for them to drop\nseems like trying to time the market. I will likely buy both, but if you had to\nchoose one of them, which would you choose? Thanks!",
  "data/reddit-stocks/r/stocks/comments/t2zm1m/russian_central_bank_tries_to_halt_foreigners.json": "They are planning to freeze all the assets owned in Russia by western countries.\nWhich means Norway, Germany etc etc cant sell.\n\nRussian central bank orders market players to reject foreign clients' bids to\nsell Russian securities for 0400 GMT on February…"
}