{
  "data/reddit-know/r/YouShouldKnow/comments/ltpl7d/ysk_typing_i_dont_own_the_rights_to_this_music_in.json": "YSK: Typing \"I don't own the rights to this music\" in the caption of a video doesn't mean anything at all.",
  "data/reddit-know/r/YouShouldKnow/comments/ltt1xg/ysk_when_doordash_messages_restaurant_is.json": "YSK when DoorDash messages “<restaurant> is preparing your order” it may mean that they just haven’t someone to deliver your food.",
  "data/reddit-know/r/YouShouldKnow/comments/ltzzro/ysk_the_difference_between_chromes_incognito_mode.json": "YSK the difference between Chrome's incognito mode and guest mode",
  "data/reddit-know/r/YouShouldKnow/comments/lum5hv/ysk_that_shaming_people_for_being_fat_actually.json": "YSK that shaming people for being fat actually worsens health outcomes. If you care about a heavier person's health, the last thing you should do is make negative comments about their weight or health behaviors.",
  "data/reddit-know/r/YouShouldKnow/comments/lup7y5/ysk_people_often_do_things_that_they_wouldnt.json": "YSK: People often do things that they wouldn't usually when they are bored. To turn it into a positive, get a globe, encyclopedias, or random books to learn.",
  "data/reddit-know/r/YouShouldKnow/comments/lutbcr/ysk_if_you_have_an_adjusted_gross_income_under.json": "YSK If you have an adjusted gross income under 39K and have sold stocks on RobinHood, you can file on TurboTax for from via the IRS website without paying $70 for TurboTax Premier",
  "data/reddit-know/r/YouShouldKnow/comments/lvlgwy/ysk_just_because_someone_is_related_to_you_does.json": "YSK: Just because someone is related to you, does not give them a right to be an asshole. Family is important, but so is your emotional health.",
  "data/reddit-know/r/YouShouldKnow/comments/lvnhqj/ysk_when_you_submit_a_negative_survey_for.json": "YSK when you submit a negative survey for companies like Amazon, Netflix, Comcast, etc., the results are generally used to punish the specific worker, not improve the company.",
  "data/reddit-know/r/YouShouldKnow/comments/lvrpgx/ysk_if_your_headlights_are_illuminating_any.json": "YSK: If your headlights are illuminating any mirrors of the car in front of you, you are blinding the driver.",
  "data/reddit-know/r/YouShouldKnow/comments/lw060c/ysk_when_someone_is_talking_about_their_problems.json": "YSK when someone is talking about their problems, you don't start talking about your own, you listen.",
  "data/reddit-know/r/YouShouldKnow/comments/lw3ajl/ysk_if_you_know_that_someone_doesnt_celebrate_a.json": "YSK: If you know that someone doesn't celebrate a holiday(s) and has asked not to be given gifts or partake, it's disrespectful to keep pushing and continue getting them gifts.",
  "data/reddit-know/r/YouShouldKnow/comments/lw90hg/ysk_the_microwave_isnt_ruining_your_food_you.json": "YSK: The microwave isn’t ruining your food, you probably just don’t know how to use it properly.",
  "data/reddit-know/r/YouShouldKnow/comments/lwhuq3/ysk_puppies_and_young_children_make_terrible.json": "YSK: Puppies and young children make terrible playmates (95% of the time)",
  "data/reddit-know/r/YouShouldKnow/comments/lwp117/ysk_to_have_your_dog_chase_you_when_it_slips_its.json": "YSK to have your dog chase you when it slips it’s leash or harness instead of chasing it",
  "data/reddit-know/r/YouShouldKnow/comments/lwp6js/ysk_you_can_take_full_page_screenshots_on_iphone.json": "YSK: You can take full page screenshots on iPhone, not just what’s currently displayed on the screen, but the full webpage or article.",
  "data/reddit-know/r/YouShouldKnow/comments/lwv8ip/ysk_the_fcc_just_approved_a_50_a_month_subsidy.json": "YSK: The FCC just approved a $50 a month subsidy for low-income households to get high-speed internet, plus a $100 discount on a computer.",
  "data/reddit-know/r/YouShouldKnow/comments/lxeb99/ysk_that_if_youre_in_public_and_in_a_rush_to_find.json": "YSK: That if you're in public and in a rush to find a restroom, before you risk a gas station bathroom you should look for home depots or a target, both usually have clean restrooms that are open to customers and don't have security codes to get in.",
  "data/reddit-know/r/YouShouldKnow/comments/lxkait/ysk_if_you_are_ever_at_work_and_need_to_take_your.json": "YSK: If you are ever at work and need to take your mask off, keep it in your front pockets.",
  "data/reddit-know/r/YouShouldKnow/comments/lxo6gv/ysk_wettingsoaking_your_nails_before_clipping.json": "YSK wetting/soaking your nails before clipping them will keep the clippings from flying around.",
  "data/reddit-know/r/YouShouldKnow/comments/ly14r0/ysk_that_if_you_made_less_than_72000_in_2020.json": "YSK that if you made less than $72000 in 2020, you’re entitled to file taxes online for free",
  "data/reddit-know/r/YouShouldKnow/comments/lydb30/ysk_if_you_are_struggling_and_below_200_of_the.json": "YSK: If you are struggling and below 200% of the poverty level for your family size, pcsforpeople.org sells computer solutions for a reasonable price.",
  "data/reddit-know/r/YouShouldKnow/comments/lyexts/ysk_when_you_get_a_call_saying_your_credit_card.json": "YSK When you get a call saying your Credit Card has been used and they want to verify it was you, the best thing to do is hang up and call your bank.",
  "data/reddit-know/r/YouShouldKnow/comments/lyjps9/ysk_if_you_ever_decide_to_play_monopoly_play_the.json": "YSK: If you ever decide to play Monopoly, play The Lord Of The Rings version of the board game",
  "data/reddit-know/r/YouShouldKnow/comments/lyps6n/ysk_therapists_will_often_offer_a_sliding_scale.json": "YSK: Therapists will often offer a sliding scale when charging their clients, and will adjust how much it costs depending on your income",
  "data/reddit-know/r/YouShouldKnow/comments/lz5dws/ysk_there_are_people_out_there_looking_to_give_a.json": "YSK: There are people out there looking to give a chance, even if you don't have the experience. Talk about what you did that could be relevant, in your opinion, and ask for a chance",
  "data/reddit-know/r/YouShouldKnow/comments/lzgp93/ysk_make_sure_to_properly_clean_out_your_vacuum.json": "YSK: Make sure to properly clean out your vacuum cleaner every now and then.",
  "data/reddit-know/r/YouShouldKnow/comments/lzitlj/ysk_there_are_websites_that_can_assess_true_and.json": "YSK: There are websites that can assess true and fake reviews when purchasing a product on Amazon. Use a site such as ReviewMeta.com to assess whether the product reviews are fake or real.",
  "data/reddit-know/r/YouShouldKnow/comments/lzizu9/ysk_not_to_inflate_a_life_jacket_in_a_plane_until.json": "YSK not to inflate a life jacket in a plane until after you have exited the aircraft.",
  "data/reddit-know/r/YouShouldKnow/comments/lzof8r/ysk_that_you_should_label_your_house_or_mailbox.json": "YSK that you should label your house or mailbox with a large version of your street address, and make sure it can be seen from the road, so delivery drivers can find you.",
  "data/reddit-know/r/YouShouldKnow/comments/m04kpr/ysk_you_should_base_your_product_review_on_the.json": "YSK: You should base your product review on the product, not anything else",
  "data/reddit-know/r/YouShouldKnow/comments/m07p59/ysk_just_because_you_did_something_wrong_or_said.json": "YSK: Just because you did something wrong or said something bad in the past, doesn't mean you can't fight against it now.",
  "data/reddit-know/r/YouShouldKnow/comments/m0c6m3/ysk_adults_shouldnt_hate_or_be_rude_to_kids.json": "YSK - Adults shouldn’t hate or be rude to kids",
  "data/reddit-know/r/YouShouldKnow/comments/m0jzt2/ysk_the_aspca_has_printable_cards_you_can_keep_in.json": "YSK: The ASPCA has printable cards you can keep in your wallet, so that in the event of an emergency that leaves you unable to return home, whoever is helping you will know to alert someone to check on your pets.",
  "data/reddit-know/r/YouShouldKnow/comments/m0nfzd/ysk_cheaper_items_in_supermarkets_are_always.json": "YSK: Cheaper Items in Supermarkets are Always Located on the Bottom Shelf",
  "data/reddit-know/r/YouShouldKnow/comments/m169lr/ysk_that_if_youre_using_a_budget_or_midrange.json": "YSK that if you're using a budget or mid-range Samsung phone, the One UI 3.0 + Android 11 update is available for you.",
  "data/reddit-know/r/YouShouldKnow/comments/m19jrg/ysk_that_pocket_in_the_door_of_your_ford_transit.json": "YSK: That pocket in the door of your Ford Transit Van, Uhaul/Penske/Budget van Rental is NOT for cell phones",
  "data/reddit-know/r/YouShouldKnow/comments/m1gwb6/ysk_that_you_should_replace_your_deadbolt_strike.json": "YSK that you should replace your deadbolt strike plate screws",
  "data/reddit-know/r/YouShouldKnow/comments/m1xr88/ysk_when_buying_a_suit_its_generally_expected.json": "YSK: When buying a suit, it’s generally expected that you will get the suit tailored to you so that it fits better. Plan to buy the suit at least a week ahead of when you need it to allow for the tailoring time.",
  "data/reddit-know/r/YouShouldKnow/comments/m2apya/ysk_that_scam_callers_are_posing_as_texas_police.json": "YSK that scam callers are posing as Texas Police Officers.",
  "data/reddit-know/r/YouShouldKnow/comments/m2h6q2/ysk_if_youre_having_issues_with_stripping_ikea.json": "YSK, if you're having issues with stripping Ikea screws, its possibly because you're using the wrong screwdriver.",
  "data/reddit-know/r/YouShouldKnow/comments/m2i8f3/ysk_honey_doesnt_expire.json": "YSK: Honey doesn't expire.",
  "data/reddit-know/r/YouShouldKnow/comments/m2mw66/ysk_when_you_get_something_that_has_a_hole_that.json": "YSK: When you get something that has a hole that an animal could end up trapped in, make sure to cut it before throwing it away.",
  "data/reddit-know/r/YouShouldKnow/comments/m2xzxh/ysk_that_screaming_at_people_in_your_family_is.json": "YSK that screaming at people in your family is not normal in a lot of households, and a starting point for abuse",
  "data/reddit-know/r/YouShouldKnow/comments/m32xqw/ysk_toothpaste_and_sugarfree_candy_can_kill_your.json": "YSK Toothpaste and sugar-free candy can kill your dog.",
  "data/reddit-know/r/YouShouldKnow/comments/m33ckj/ysk_the_international_sign_for_help_me.json": "YSK: The international sign for \"Help me!\"",
  "data/reddit-know/r/YouShouldKnow/comments/m36wc0/ysk_not_everyone_is_fit_for_college_and_thats.json": "YSK: Not everyone is fit for college and that's okay! If you do end up going to college make sure to research what ones would be the best jobs with good pay.",
  "data/reddit-know/r/YouShouldKnow/comments/m39zlf/ysk_those_spiderwebs_exposed_as_the_snow_melts.json": "YSK Those 'spiderwebs' exposed as the snow melts are actually snow mold and can cause seasonal allergy symptoms",
  "data/reddit-know/r/YouShouldKnow/comments/m3a768/ysk_the_business_of_body_donation_for_science_can.json": "YSK the business of body donation for \"science\" can include things like the military blowing up your body for ballistics tests. It's also a for-profit business where bodies or body parts are sold by brokers who make money on the donation.",
  "data/reddit-know/r/YouShouldKnow/comments/m3r7yh/ysk_that_veterinarians_have_one_of_the_highest.json": "YSK: That veterinarians have one of the highest suicide rates of any profession",
  "data/reddit-know/r/YouShouldKnow/comments/m3td74/ysk_the_wording_is_just_as_important_as_the.json": "YSK: The wording is just as important as the question itself.",
  "data/reddit-know/r/YouShouldKnow/comments/m40zd4/ysk_that_you_need_to_define_an_acronym_before_you.json": "YSK that you need to define an acronym before you use it.",
  "data/reddit-know/r/YouShouldKnow/comments/m47995/ysk_that_you_can_take_people_and_friends_and.json": "YSK, that you can take people, and friends, and family (especially elderly) in your lives, on a Virtual Road Trip! Visit those places they haven't been to in years! Share a past experience with them and open doors by using Google Maps Street View!",
  "data/reddit-know/r/YouShouldKnow/comments/m4akth/yskwhen_buying_cheap_faked_electronic_accessories.json": "YSK:when buying cheap faked electronic accessories be aware worst thing is not that it will not work well but it can damage your phone you attach it too.i leaned hard way by buying 5$ USB c headphones to use with 800$phone and they caused mechanical damage to port",
  "data/reddit-know/r/YouShouldKnow/comments/m4hd07/ysk_that_touching_your_dog_messing_with_their.json": "YSK that touching your dog (Messing with their paws, looking in their ears etc.) can save their life",
  "data/reddit-know/r/YouShouldKnow/comments/m4o80i/ysk_children_of_abusive_households_literally_do.json": "YSK children of abusive households literally do not know they are being abused. If you interact with a child who expresses intense distaste (hatred even) for a care figure in their life, do not presume and dismiss it as \"normal angst\" because it very well may not be. Child abuse is everywhere.",
  "data/reddit-know/r/YouShouldKnow/comments/m4t1rm/ysk_that_being_able_not_to_get_aggressive_when.json": "YSK that being able not to get aggressive when angry is a valuable skill.",
  "data/reddit-know/r/YouShouldKnow/comments/m4y4x6/ysk_our_brain_is_also_made_to_forget_and_memories.json": "YSK: Our brain is also made to forget, and memories are not reliable. Don't take decisions, and don't beat yourself, based on your memories. It's ok to forget and forgive",
  "data/reddit-know/r/YouShouldKnow/comments/m5bqm0/ysk_it_is_common_advice_to_make_your_password.json": "YSK: It is common advice to make your password full of random characters, numbers, and symbols. However, a sentence with at least 10 words can be much more secure and will be significantly easier to remember.",
  "data/reddit-know/r/YouShouldKnow/comments/m5dxyc/ysk_food_pranks_arent_pranks_they_are_felony_food.json": "YSK 'Food pranks' aren't pranks. They are felony food tampering offences, grievous bodily harm and assault, and often carry minimum sentences.",
  "data/reddit-know/r/YouShouldKnow/comments/m5jqdg/ysk_quite_a_few_generic_products_are_the_same_as.json": "YSK quite a few Generic products are the same as branded",
  "data/reddit-know/r/YouShouldKnow/comments/m5nvik/ysk_if_youre_going_to_get_a_heartbeat_tattoo_not.json": "YSK If you're going to get a heartbeat tattoo, not all rhythms are healthy ones",
  "data/reddit-know/r/YouShouldKnow/comments/m5u4c0/ysk_not_all_mattresses_or_anything_similar_with_a.json": "YSK not all mattresses (or anything similar) with a zipper are meant to have the outer layer removed and washed.",
  "data/reddit-know/r/YouShouldKnow/comments/m6e81u/ysk_that_not_all_water_filters_that_advertise_the.json": "YSK that not all water filters that advertise the ability to remove lead are actually certified to do so",
  "data/reddit-know/r/YouShouldKnow/comments/m6ffkb/ysk_the_worlds_largest_data_breach_happened_a.json": "YSK: The world's largest data breach happened a month ago, and your data was likely stolen",
  "data/reddit-know/r/YouShouldKnow/comments/m6fr62/ysk_to_use_this_google_search_trick_to_find_open.json": "YSK to use this Google search trick to find open spreadsheets with data on anything you want",
  "data/reddit-know/r/YouShouldKnow/comments/m6gb78/ysk_if_you_lose_your_iphone_in_a_room_or_house.json": "YSK if you lose your iPhone in a room or house you can say “Hey Siri: set a timer for 3 seconds”",
  "data/reddit-know/r/YouShouldKnow/comments/m6gb8c/ysk_water_heaters_have_an_anode_rod_that_prevents.json": "YSK: water heaters have an anode rod that prevents the tank from corroding. If you replace it every few years, it will extend the life of your water heater from ~10 years to potentially 25+ years.",
  "data/reddit-know/r/YouShouldKnow/comments/m7026q/ysk_that_your_aboverange_microwave_likely.json": "YSK that your above-range microwave likely contains a charcoal air filter at the top where the fan blows out recirculating air when the fan is on. Replacing this inexpensive filter can remove cooking odors from your kitchen.",
  "data/reddit-know/r/YouShouldKnow/comments/m7878z/ysk_small_talk_is_a_very_important_preface_to_a.json": "YSK: Small talk is a very important preface to a conversation, as you can use it to guage a person's personality, mood, and level of extraversion, making choosing a topic to talk about significantly easier.",
  "data/reddit-know/r/YouShouldKnow/comments/m7b1zc/ysk_that_there_is_an_excellent_interactive.json": "YSK that there is an excellent interactive website by Ableton teaching you how to make music for free",
  "data/reddit-know/r/YouShouldKnow/comments/m7ca8d/ysk_that_when_calling_emergency_services_in_most.json": "YSK that when calling emergency services in most countries, once you tell them the location help will already be on the way while you are talking to the operator.",
  "data/reddit-know/r/YouShouldKnow/comments/m7d85c/ysk_that_if_you_know_a_kid_struggling_to_learn_to.json": "YSK that if you know a kid struggling to learn to read they may have a Convergence Insufficiency. CI is treatable with vision therapy. The condition is often missed because testing for it is not included as part of a regular eye exam.",
  "data/reddit-know/r/YouShouldKnow/comments/m7ezdd/ysk_when_making_your_bed_9_times_out_10_the.json": "YSK: When making your bed, 9 times out 10, the manufacturers tag will be on the bottom right corner of your quilt/sheet (when standing at the foot of the bed looking towards it)",
  "data/reddit-know/r/YouShouldKnow/comments/m7gxys/ysk_if_you_get_mad_when_someone_respectfully.json": "YSK if you get mad when someone respectfully disagrees with you or respectfully proves you wrong, that is good cause for self-reflection.",
  "data/reddit-know/r/YouShouldKnow/comments/m7m6q1/ysk_that_most_videos_featuring_animals_being.json": "YSK that most videos featuring animals being saved from snake and other animal attacks are staged and deliberately put the same animals in grave danger for clicks.",
  "data/reddit-know/r/YouShouldKnow/comments/m7t09u/ysk_that_if_you_make_under_72k_the_irs_provides.json": "YSK that if you make under 72k, the IRS provides links to commercial tax filing software, like TurboTax, so you can file taxes for free.",
  "data/reddit-know/r/YouShouldKnow/comments/m7urt6/ysk_that_if_you_have_a_hornet_wasp_or_yellow.json": "YSK that if you have a hornet, wasp, or yellow jacket nest on your property, there are people who will take it away for free. They sell it to pharmaceutical companies that make wasp allergy medicine",
  "data/reddit-know/r/YouShouldKnow/comments/m84onz/ysk_if_you_have_muscle_pain_that_wont_go_away_get.json": "YSK: If you have muscle pain that wont go away, get a massage!",
  "data/reddit-know/r/YouShouldKnow/comments/m85hbk/ysk_that_for_over_50_of_the_united_states.json": "YSK that for over 50% of the United States population, the combination of someone's 5-digit zip code, gender, and date of birth is unique to only one person. Be careful with the information you share online-- it's more identifiable than you think.",
  "data/reddit-know/r/YouShouldKnow/comments/m861lj/ysk_in_the_usa_the_recent_relief_bill_included_a.json": "YSK, in the USA, the recent relief bill included a $10,200 tax credit for unemployment benefits but many tax sites and software have not been updated to account for this yet.",
  "data/reddit-know/r/YouShouldKnow/comments/m8813b/ysk_anything_worth_it_in_life_takes_effort.json": "YSK: Anything worth it in life takes effort. Learning a new skill, doing your job, exercising, eating healthier, etc",
  "data/reddit-know/r/YouShouldKnow/comments/m8uz3x/ysk_you_dont_save_as_much_time_as_you_think_if.json": "YSK you don't save as much time as you think if you speed. See text for formula and example.",
  "data/reddit-know/r/YouShouldKnow/comments/m8xi09/ysk_when_your_sex_toys_expire.json": "YSK when your sex toys expire.",
  "data/reddit-know/r/YouShouldKnow/comments/m8yavt/ysk_customer_service_might_be_able_to_give_you_a.json": "YSK Customer Service might be able to give you a refund but you have to ask",
  "data/reddit-know/r/YouShouldKnow/comments/m9dx6u/ysk_on_subscription_based_services_you_can.json": "YSK: On subscription based services, you can usually get a cheaper rate, if you call and ask.",
  "data/reddit-know/r/YouShouldKnow/comments/m9fdnu/ysk_check_your_local_salvation_army_or_goodwill.json": "YSK: Check your local Salvation Army or Goodwill regularly for electronics and appliances. I just got a 19\" monitor for $1",
  "data/reddit-know/r/YouShouldKnow/comments/m9ibis/ysk_you_may_have_unclaimed_property_waiting_for.json": "YSK you may have unclaimed property waiting for you.",
  "data/reddit-know/r/YouShouldKnow/comments/m9qkye/ysk_that_when_asked_for_your_address_name_phone.json": "YSK that when asked for your address, name, phone number or other personal information by a cashier, \"No thank you\" is a perfectly acceptable answer. Protect your privacy.",
  "data/reddit-know/r/YouShouldKnow/comments/m9wbgz/ysk_if_you_buy_a_house_in_a_state_with_eviction.json": "YSK If you buy a house in a state with eviction moratorium, the seller is legally allowed to remain in the house even after closing",
  "data/reddit-know/r/YouShouldKnow/comments/m9yqva/ysk_that_when_you_write_a_personal_check_youre.json": "YSK that when you write a personal check, you’re giving the payee your bank account and routing number. Instead, use your bank’s online bill pay feature - they’ll mail out a check to the payee with a different account, protecting your info",
  "data/reddit-know/r/YouShouldKnow/comments/ma3i8x/ysk_if_you_know_someone_who_has_a_hard_time.json": "YSK: If you know someone who has a hard time bending over, like the elderly, make sure they have a table by their front door for packages.",
  "data/reddit-know/r/YouShouldKnow/comments/macbux/ysk_almost_all_fishbowls_are_cruel_and_inhumane.json": "YSK (almost all) fishbowls are cruel and inhumane",
  "data/reddit-know/r/YouShouldKnow/comments/mafb13/ysk_if_you_make_less_than_72000_a_year_adjusted.json": "YSK: If you make less than $72,000 a year adjusted gross income (AGI) you can file taxes completely free with the IRS Free File program",
  "data/reddit-know/r/YouShouldKnow/comments/maikv8/ysk_rubbing_your_eyes_a_lot_can_actually_make.json": "YSK rubbing your eyes a lot can actually make your vision worse",
  "data/reddit-know/r/YouShouldKnow/comments/malse0/ysk_you_could_easily_estimate_the_charge_of_aaaaa.json": "YSK: You could easily estimate the charge of AA/AAA battery cells by dropping them vertically on a table from a height of around an inch. Fresh batteries will drop still, while discharged ones will bounce like a ball.",
  "data/reddit-know/r/YouShouldKnow/comments/mauown/ysk_the_average_life_span_is_7854_us.json": "YSK the Average Life Span is 78.54 (US)",
  "data/reddit-know/r/YouShouldKnow/comments/mb05az/ysk_prepare_your_teenagers_to_be_an_adult_better.json": "YSK: Prepare your teenagers to be an adult better than your own parents prepared you",
  "data/reddit-know/r/YouShouldKnow/comments/mb3jgr/ysk_always_get_three_estimates_for_any_large.json": "YSK: Always get three estimates for any large construction project",
  "data/reddit-know/r/YouShouldKnow/comments/mb7y1w/ysk_that_if_your_android_is_crashing_today.json": "YSK that if your Android is crashing today, uninstalling Webview or Chrome will fix it",
  "data/reddit-know/r/YouShouldKnow/comments/mbin3p/ysk_there_are_many_reasons_a_persons_hands_might.json": "YSK there are many reasons a person's hands might shake and telling them to \"just relax\" is not helpful",
  "data/reddit-know/r/YouShouldKnow/comments/mbpcl5/ysk_forever_chemicals_or_chemicals_that_dont.json": "YSK: 'Forever Chemicals' or chemicals that don't breakdown in your body or the environment, have been used since 1940, may be the biggest environmental disaster our generation (and the world) has to face, and are almost certainly poisoning you right now.",
  "data/reddit-know/r/YouShouldKnow/comments/mc0xo5/ysk_if_your_job_doesnt_offer_overtime_payment.json": "YSK: If your job doesn't offer overtime payment, don't work over-time",
  "data/reddit-know/r/YouShouldKnow/comments/mc71jy/ysk_if_you_all_of_a_sudden_start_receiving.json": "YSK: If you all of a sudden start receiving non-stop subscription signups to your email, you may be a victim of credit card fraud. Computers",
  "data/reddit-know/r/YouShouldKnow/comments/mc9lfl/ysk_a_foam_roller_costs_about_the_same_or_less_as.json": "YSK: a foam roller costs about the same (or less) as going out for lunch, lasts for ages, and can instantly make a huge difference in all kinds of muscle soreness, back pain, etc.",
  "data/reddit-know/r/YouShouldKnow/comments/mcanaw/ysk_wolfram_alpha_exists_wolfram_alpha_is_an.json": "YSK: Wolfram Alpha exists. Wolfram Alpha is an advanced mathematics that shows step by step solutions.",
  "data/reddit-know/r/YouShouldKnow/comments/mcn3e4/ysk_most_key_fobs_for_vehicles_that_have_keyless.json": "YSK: most key fobs for vehicles that have \"keyless\" start have a physical key inside of them",
  "data/reddit-know/r/YouShouldKnow/comments/mcrnc0/ysk_its_okay_not_to_like_any_kind_of_music_35_of.json": "YSK it's okay not to like any kind of music. 3-5% of the population can't experience emotion from it.",
  "data/reddit-know/r/YouShouldKnow/comments/md1sz7/ysk_that_if_youre_watching_a_youtube_video_with.json": "YSK that if you're watching a YouTube video with headphones and the audio is only coming through one ear, you should enable mono sound.",
  "data/reddit-know/r/YouShouldKnow/comments/md21p2/ysk_your_cars_side_mirrors_are_probably_not_set.json": "YSK your cars side mirrors are probably not set correctly!",
  "data/reddit-know/r/YouShouldKnow/comments/md2q9i/ysk_starting_424_988_is_the_us_national_suicide.json": "YSK: Starting 4/24, 988 is the US national Suicide Prevention hotline number",
  "data/reddit-know/r/YouShouldKnow/comments/md6g9a/ysk_that_youre_worthy_of_love_and_who_you_are.json": "YSK that you’re worthy of love, and who you are right now is more than enough",
  "data/reddit-know/r/YouShouldKnow/comments/mdj0ml/ysk_just_saying_there_is_a_big_surprize_shocking.json": "YSK just saying \"there is a big surprize / shocking ending\" regardless of telling the details or not is already a SPOILER. If you suggest someone a film/tv show/game/book etc. please DON'T DO THAT!",
  "data/reddit-know/r/YouShouldKnow/comments/mdx4az/ysk_about_doesthedogdiecom_you_can_look_up_books.json": "YSK about doesthedogdie.com - You can look up books, movies, etc and it will tell you if there are any unpleasant scenes without spoiling the plot.",
  "data/reddit-know/r/YouShouldKnow/comments/mdxlzh/ysk_eliminating_the_words_so_and_very_as.json": "YSK: Eliminating the words \"so\" and \"very\" as adjective modifiers will expand and improve your vocabulary and writing.",
  "data/reddit-know/r/YouShouldKnow/comments/mednvq/ysk_that_your_music_taste_may_change.json": "YSK that your music taste may change fundamentally with changes in your life situation",
  "data/reddit-know/r/YouShouldKnow/comments/meg435/ysk_that_the_ftc_has_a_webpage_to_report_fraud.json": "YSK that the FTC has a webpage to report fraud and scamming solicitations received via email, phone, and text.",
  "data/reddit-know/r/YouShouldKnow/comments/mejddq/ysk_storing_your_potatoes_next_to_your_onions.json": "YSK Storing your potatoes next to your onions will make them go bad faster",
  "data/reddit-know/r/YouShouldKnow/comments/meoks1/ysk_friendship_is_a_5050_relationship_we.json": "YSK: Friendship is a 50/50 relationship. We understand that depression and real-life problems are a thing, but if one person does all of the connecting and gets ghosted, please contact them.",
  "data/reddit-know/r/YouShouldKnow/comments/meyjbn/ysk_your_mom_was_right_staring_at_a_screen_all.json": "YSK: Your mom was right. Staring at a screen all day is really unhealthy",
  "data/reddit-know/r/YouShouldKnow/comments/mf001z/ysk_joking_about_suicide_is_a_sign_of_a_crisis.json": "YSK: joking about suicide is a sign of a crisis point in a medical condition",
  "data/reddit-know/r/YouShouldKnow/comments/mf3vjt/ysk_a_symptom_of_depression_is_pushing_people_away.json": "YSK: A symptom of depression is pushing people away.",
  "data/reddit-know/r/YouShouldKnow/comments/mfguip/ysk_when_a_person_cuts_out_someone_from_their.json": "YSK: When a person cuts out someone from their life, it is usually the LAST effort that they have made. Normally they do everything else before cutting them out",
  "data/reddit-know/r/YouShouldKnow/comments/mfk5da/ysk_there_is_a_website_called_haveibeenpwned.json": "YSK There is a website called haveibeenpwned which monitors all databreaches and give you a chance to find out if your data has been lost or stolen.",
  "data/reddit-know/r/YouShouldKnow/comments/mg2jgk/ysk_some_people_are_covertly_abusive_manipulative.json": "YSK: Some people are covertly abusive, manipulative and controlling",
  "data/reddit-know/r/YouShouldKnow/comments/mgikth/ysk_if_youre_a_college_student_make_sure_you_set.json": "YSK if you’re a college student, make sure you set up your student email address to forward to your personal email before you graduate/leave.",
  "data/reddit-know/r/YouShouldKnow/comments/mgtuci/ysk_burger_den_and_melt_down_on_food_delivery.json": "YSK \"Burger Den\" and \"Melt Down\" on food delivery apps are \"Dennys\" in disguise.",
  "data/reddit-know/r/YouShouldKnow/comments/mgwzwi/ysk_that_in_parenting_how_you_talk_to_your_child.json": "YSK that in parenting, HOW you talk to your child matters - it changes their brain. Talking TO or AT your child, even if you are exposing them to many words, is less important than having engaging conversations WITH your child, ideally where your child takes the lead.",
  "data/reddit-know/r/YouShouldKnow/comments/mh093h/ysk_how_to_get_scientific_research_papers_for_free.json": "YSK: How to get scientific research papers for free.",
  "data/reddit-know/r/YouShouldKnow/comments/mh65fn/ysk_richard_jewell_was_arguably_a_hero_who_was.json": "YSK Richard Jewell was arguably a hero who was vilified by a media and government who needed a villain",
  "data/reddit-know/r/YouShouldKnow/comments/mhgxvi/ysk_if_youre_a_smoker_nonsmokers_dont_want_to_be.json": "YSK if you're a smoker, non-smokers don't want to be trapped in your house or car with you while you are smoking, but we're too polite to tell you that to your face"
}