{
  "data/reddit-books/r/books/comments/ob1xk0/your_3_oldest_tbr_books.json": "Inspired by the goal thread -- every year one of my goals is to read all the\nbooks purchased or placed on my Goodreads TBR before the current year. So I\nthought it would be fun to list our oldest TBR books and maybe others will\nconvince you to pick it up or move on to greener pastures.\n\nMy oldest…",
  "data/reddit-books/r/books/comments/ob5pmy/i_love_books_so_much_that_i_ruin_it_for_myself.json": "So I wondered if anyone else has this problem, because it’s becoming\nfrustrating. I LOVE books, as I’m sure most of you all do too.\n\nHowever, I get SO excited and I get so much pleasure from choosing and buying a\nnew book, that I’m always trying to rush through the book I’m currently reading.\nI’m…",
  "data/reddit-books/r/books/comments/ob6moh/blown_away_by_the_dark_forest_by_cixin_liu.json": "three body problem was excellent, but it feels a little like a prequel in\nhindsight? anyways, i just wanted to share that having just finished The Dark\nForest last night I am reeling right now because I think it's the best thing\nI've read recently, and I just wanted to share this somewhere! Sure…",
  "data/reddit-books/r/books/comments/ob979i/this_book_was_just_shockingeventually_was_burned.json": "My mom got several books as a birthday gift from her friend. I should mention\nthat he hadn’t read any of those books himself and just relied on reviews. One\nof them was “The Little Girl Who Was Too Fond of Matches” by a Canadian writer\nGaétan Soucy. I had a habit of randomly picking a book in our…",
  "data/reddit-books/r/books/comments/oba4rd/can_we_please_stop_using_abbreviations_in_book.json": "I really appreciate the book reviews in my Kindle app! I always read them to get\na feel for whether a book is worth my time or money since I consume books at an\nalarming rate. I get frustrated though, when several reviews use the same\nacronym, but no one actually spells out the word.\n\n\"If you loved…",
  "data/reddit-books/r/books/comments/obbavu/yo_what_the_fuck_is_the_point_of_an_abridged_book.json": "I just listened to The Tipping Point audiobook, and it turns out I was listening\nto the abridged version!! I was like “wow that 300 page book went by really fast\nwhen I listened to it at 1.25x speed!” But I thought I had to be missing\nsomething so I looked at the details Then I looked more closely…",
  "data/reddit-books/r/books/comments/obeypd/what_are_important_messages_that_are_commonly.json": "I nominate Ray Bradbury's Fahrenheit 451. Everyone talks about the\ncensorship/people not wanting to get offended/etc. But near the end of the book:\n\n\"The difference between the man who just cuts lawns and a real gardener is in\nthe touching, he said. The lawn-cutter might just as well not have been…",
  "data/reddit-books/r/books/comments/obf2hx/what_are_your_favourite_book_openings.json": "I love it when a book has an amazing first sentence that draws you in instantly\nand gives you a feel of what to expect while devouring the whole book. That\nbeing said, there are books I love so much that don't have bedazzling first\nsentences. What are your favourite openings? Here are some of…",
  "data/reddit-books/r/books/comments/obm1og/id_read_books_like_slaughter_house_and_the_jungle.json": "I always had a hard time and little interest combating the views of vegans and\nvegetarians because they made valid points that I agree with. I disagree with\nthe unethical conditions animals are kept in and the barbaric dystopia that's so\nfar removed from traditional farming that they portray on…",
  "data/reddit-books/r/books/comments/obn3tl/why_do_you_think_books_are_better_than_their.json": "You always hear \"the books were better\", and rarely the other way round. Is it\nthe fact CGI has only recently caught up, the power of one sole imagination or?\n\nE.g. Divergent series, The Godfather, Harry Potter, LOTR, DaVinci Code, Hunger\ngames just to name a few. I frequently hear the same…",
  "data/reddit-books/r/books/comments/obo4jq/one_of_the_best_feelings_about_reading_more_has.json": "I never really got into reading until some time a couple of years ago. Since\nyhen I've been reading more and more getting through more books in a year than i\nthought would ever be possible.\n\nIt feels really good to see a 500 page book and not see it as a really long slog\nanymore. 100 pages seems so…",
  "data/reddit-books/r/books/comments/obvre4/reading_oryx_and_crake_in_the_aftermath_of_2020.json": "SPOILERS BELOW!\n\nI just finished reading Oryx and Crake by Margaret Atwood for the first time,\nand it really blew me away. I had heard polarizing things about it (it seems to\nbe a love-it-or-hate-it kind of novel), but reading it in the aftermath of the\nCOVID-19 pandemic and the various…",
  "data/reddit-books/r/books/comments/obxjjh/a_thousand_splendid_suns.json": "I finished A Thousand Splendid Suns by Khaled Hosseini today. And it's\nincredible. It's a culture shock, a ticket to a whole other world. He puts you\nin the shoes of women with lives and hardships I couldn't begin to fathom. The\nthings they went through, the incredible loss and uncertain future,…",
  "data/reddit-books/r/books/comments/oc5owc/the_sex_scene_of_haruki_murakamis_killing.json": "I was going through an article just now and guess what I found out? The sex\nscene of Haruki Murakami’s Killing Commendatore was nominated for 26th Bad Sex\nin Fiction Award! Since the year 1993, this award is given to a \"year's most\noutstandingly awful scene of sexual description in an otherwise good…",
  "data/reddit-books/r/books/comments/oc6p69/healthy_coping_mechanisms_overused_for_the_good.json": "I recently came across in the book I’m reading one of the main characters using\nswimming as their ‘coping’ mechanism. The section in the book involved the\ncharacter pushing herself super hard as her way of dealing with all the shitty\nstuff going on (this book was set during WWII). I see this all the…",
  "data/reddit-books/r/books/comments/occut6/importance_of_timing_with_books.json": "Recently I was thinking about how you can read a really good book but not enjoy\nit or understand it based on your age/ timing of life. For example one of my\nfavorite books is The Catcher In The Rye, which I read at 19. I wouldn’t\nrecommend the book to anyone much older than that, a lot of people…",
  "data/reddit-books/r/books/comments/ocf4m4/loaning_books_from_library_has_let_me_read_and.json": "I used to just hoard books and liked the feeling of the New hardcovers books but\nfinished only a few . Wanted to get into reading habit devoid of other\ndistractions . Upon my friends suggestion I have loaned a couple of books (Good\nomens,Dark Matter and 1984) . Deadline to return them was 21 days…",
  "data/reddit-books/r/books/comments/ochr4w/what_is_up_with_these_goodreads_reviews.json": "I don't go on Goodreads a lot. Sometimes for quotes, or just to copy and paste a\nline or two for a school assignment. Recently I went back to read reviews for a\nbook I'm thinking of purchasing... and something seems very off.\n\nFor one, all the top book reviews seem to follow the same concept.…",
  "data/reddit-books/r/books/comments/ociwn6/i_finally_understood_what_anton_ego_meant_when_he.json": "I consider myself to be an extremely harsh critic, usually to the detriment of\nmy own enjoyment. So, I understand what it feels like. I know how easy it is to\ndismiss someone’s life’s work based on literary criterion.\n\nThere’s this little series out there, I’m sure everyone has heard of, called\n“The…",
  "data/reddit-books/r/books/comments/ocs19e/this_is_why_i_miss_sir_terry.json": "\"The Library didn’t only contain magical books, the ones which are chained to\ntheir shelves and are very dangerous. It also contained perfectly ordinary\nbooks, printed on commonplace paper in mundane ink. It would be a mistake to\nthink that they weren’t also dangerous, just because reading them…",
  "data/reddit-books/r/books/comments/ocz6y2/something_wicked_this_way_comes.json": "I picked up this book yesterday and I'm more than halfway done right now. But by\ngod, if this isn't one of the most gorgeously written books I've read so far.\nEvery sentence is like a poem in miniature and I keep wondering whether the\nmeaning of a sentence is literal or metaphorical.\n\nAnd the…",
  "data/reddit-books/r/books/comments/od22lp/a_man_called_ove_a_heartwarming_story.json": "I got out of my way and decided that I won't get a book from the library instead\nI went and bought one with some of the money I got for my graduation from high\nschool. I heard that many people praised this book and thought I'd give it a try\ntoo. Ove is a lonely, grumpy perfectionist who is still…",
  "data/reddit-books/r/books/comments/od4ahl/what_are_some_common_tropes_in_books_that_you_hate.json": "For my part, it is the « I am the chosen one but I hate it and juste want to be\nnormal » trope. It’s super common in books and I feels that it prevent the plot\nfrom moving forward and leads to many chapters (sometimes it is the whole book)\nwhere the protagonist complains about it every two pages for…",
  "data/reddit-books/r/books/comments/odjqbn/currently_reading_don_quixote_for_the_first_time.json": "Im not super far in yet, but this novel has truly surpassed my wildest\nexpectations thus far. I knew it would be funny, I didnt expect to belly\nlaughing nearly every chapter! When Sancho needed to have a bm but he didnt want\nto go to the woods so he tries to do it without Don Quixote noticing I…",
  "data/reddit-books/r/books/comments/odkiem/what_are_some_common_tropes_in_books_that_you.json": "Personally, one of my favourite moments in adventure books in general is when\nour main character, who before their journey had faced some kind of adversity or\nadversary at home that they had a lot of trouble handling, returns home after\nthe journey is over and is faced with the same problems or…",
  "data/reddit-books/r/books/comments/odkuli/the_colour_out_of_space_is_lovecraft_at_his_very.json": "So for a bit of context, I have been steadily working my way through the\nNecronomicon collection of Lovecraft's 'best weird stories', and generally\nenjoying them only as much as I expect to - up to a point, most of the stories\nrun to a straightforward formula of: anonymous but wholesome WASP man…",
  "data/reddit-books/r/books/comments/odmeei/whats_the_deal_with_the_new_york_times_best.json": "what’s the deal with the “new york times best seller” award, and why does every\nbook have it, i swear to god it’s everywhere i look, everywhere i go i see those\ngod forsaken words. “new york times best seller”. i go into a book store and\nthose 5 words surround me. i cant escape it, they haunt me and…",
  "data/reddit-books/r/books/comments/odo8o3/should_we_read_books_that_make_us_uncomfortable.json": "I’ve been thinking about reading Lolita, lately, but I’m extremely uncomfortable\nwith the pedophiliac aspects. At the same time, it’s considered a seminal work\nin world literature, so I feel like I might gain some useful insights. Don’t\nknow if I can stomach the themes being explored, though...\n\nIt…",
  "data/reddit-books/r/books/comments/oe1jcp/a_realization_about_reading_while_participating.json": "Last week I participated in a study for a uni psychology student and I got asked\na lot of questions. A couple of those questions were about my reading process.\n\nThose included:\n\n“Do you experience the story for yourself of do you only see it from the\ncharacters point of view?”\n\nI thought about this…",
  "data/reddit-books/r/books/comments/oe4n71/notice_gizmos_free_book_lists_shutting_down_july.json": "Sorry that this isn't a discussion of what I've been reading but as the title\nsaid, this site, showing hundreds of sites of free book and audiobook sources,\nis shutting down in 10 days.\n\n\nI HAVE HAD ARCHIVED THEIR FREE BOOKS LISTS WITH HUNDREDS OF SITES, AND PRESENT\nTHEM HERE, ALONG WITH THE LINKS…",
  "data/reddit-books/r/books/comments/oe6ul4/i_love_reading_but_i_have_so_much_on_my_mind_that.json": "Tl;dr. My life has been very stressful since this time last year and I couldn’t\nread anything because of mental blockage. I’m slowly getting better now and am\nexcited about the stuff I want to read, but I can only concentrate in the\nmorning just after I’ve woken up because my mind hasn’t been…",
  "data/reddit-books/r/books/comments/oe9eak/the_road_an_ecocritical_interpretation_of_the.json": "The specific event that caused the devastation in The Road is never spoken of,\nbut the diminished daylight, freezing temperatures, incinerated cities and\nlandscapes blanketed in ash seem to point toward the interpretation that the\nworld is in a nuclear winter, and ecocritical interpretations tend to…",
  "data/reddit-books/r/books/comments/oedjj2/project_hail_mary_by_andy_weir.json": "I just recently finished this book. And I can't stop thinking about it. It is\nabsolutely amazing. I literally had the best time reading this book. Amazing\nbook! It's well written, funny, interesting, exciting, cool, smart. It just has\nit all. I can not press this enough: read it! If you enjoy…",
  "data/reddit-books/r/books/comments/oeglsj/what_are_your_favorite_fantasy_and_scifi.json": "What are your favorite Fantasy and Sci-fi Characters? Please include the author\nor book to which the character belongs!\n\nSand dan Glokta, from the First Law Trilogy by author Joe Abercrombie, is one of\nmine. His complicated backstory evokes both compassion and horror, his dark\nhumor, and the way his…",
  "data/reddit-books/r/books/comments/oejwbd/anyone_else_hate_when_a_charactors_physical.json": "They always of course look completely different to how you imagine them. One\nexample is the Prince of Nothing series (which I love), there was a character\nthat featured heavily but was not a pov char and they get no description until\ntheir death, but get a huge detailed description as they die in…",
  "data/reddit-books/r/books/comments/oemvgw/people_who_read_extraordinarily_often_a_book.json": "I'm trying to read more often as I used to read a ton in the sixth grade and I\nwas actually very interested in reading/learning, but now I find myself bored by\nbooks and taking a while to read them, when I know I'm capable of better than\nthat. What are some useful things I can do to start to read…",
  "data/reddit-books/r/books/comments/oet3ym/the_false_promise_of_speed_reading_why_you_should.json": "Lately I've been seeing posts and comments here about how one can speed up one's\nreading speed by eliminating the \"inner voice\". The advice is to simply scan the\nwords in a text with the result of increasing reading speed dramatically while\nmaintaining comprehension. This is false and terrible…",
  "data/reddit-books/r/books/comments/oeuppi/the_long_walk_by_stephen_king_is_his_best_and.json": "Just putting it out there. My advice is to not read it as a \"Stephen King\"\nnovel, and instead as a brilliant work of fiction. There's so much to unpack in\nthis book. The glorification of violence, blind obedience to authority figures,\nthe loss of childhood, finding meaning in life - it can all be…",
  "data/reddit-books/r/books/comments/of8ktx/do_you_have_a_palate_cleansing_author.json": "I was curious if any other readers have authors they go back to after reading\nbooks from other authors. Sort of like a safe read, you know? For example, I\nread a lot of Stephen King and he's one of my favorite authors so I take breaks\nonce in a while to branch out and read from other authors.…",
  "data/reddit-books/r/books/comments/ofc4eo/my_wife_said_the_words_i_never_thought_id_hear.json": "\"I think we need to get rid of some books.\"\n\nNow folks, you have to understand something. We went to a library book sale on\nour first date. I proposed to her at the same library book sale 13 months later\nusing a copy of her favorite book made into a book safe. This is a woman who\nidolized Belle not…",
  "data/reddit-books/r/books/comments/ofiuoq/what_are_the_books_that_you_must_read_via_its.json": "I just came across a hard copy of Born a Crime by Trevor Noah which made me\nthink about my experience reading it. I listened to the audiobook a few years\nago and could not imagine reading it (traditionally) because Noah will speak the\nphrases mentioned in the book as a native speaker….not just…",
  "data/reddit-books/r/books/comments/ofmesk/im_mary_gauthier_awardwinning_grammynominated.json": "The Associated Press named me as one of the best songwriters of my generation.\nMy most recent release, Rifles ＆ Rosary Beads (a collection of songs co-written\nwith wounded veterans) was nominated for a Grammy for Best Folk Album, and\nRecord of the Year by the Americana Music Association. My songs…",
  "data/reddit-books/r/books/comments/ofocct/i_just_finished_the_kite_runner_by_khaled.json": "I heard alot of people say good things about this piece, so i just bought it\nwithout knowing what it was about. It‘s about two boys growing up in 1975\nAfghanistan and the shit they go through. Well I had a long train ride ahead of\nme and i just finished a fantasy book, so i was in the mood for…",
  "data/reddit-books/r/books/comments/ofsqn0/neuromancers_first_page_hooked_me_better_than_any.json": "I've been reading quite a lot of science fiction recently, but no book has\nhooked me so quickly as the first page/paragraph/section of Neuromancer.\n\nThere's a lot to take in, but the details are all presented in such a clear yet\nsuggestive way. It's been such a long time since a book as really…",
  "data/reddit-books/r/books/comments/ofu01f/i_just_read_22_books_over_8_weeks_while_being.json": "For context, my job was working a sonar count on the Copper river for the\nsockeye salmon, and I had plenty of free time when I wasn't actively counting.\nAfter all, I was 40mi away from the nearest town, had very little cell\nconnection, and the field site was boat/air access only.\n\nI had friends give…",
  "data/reddit-books/r/books/comments/og45uz/how_do_you_discover_books.json": "I have a kindle and end up doing most of my “book discovery” through the kindle\ninterface, searching through the categories Amazon puts books in.\n\nBut to be honest I think this system is pretty terrible (this might be just me!)\n- it ends up being an “echo chamber” where the top rated books get read…",
  "data/reddit-books/r/books/comments/og49nw/ive_finished_4_books_in_the_past_week_and_a_half.json": "So, my wife and I are nearing the end of our vacation. We're heading back home\ntomorrow after about a week and a half spend in a little cottage with our 2\ndogs. I took along some books and I've almost managed to finish all of them.\n\nFirst was Dreamcatcher by Stephen King. I started reading this long…",
  "data/reddit-books/r/books/comments/og7kuy/the_spy_who_came_in_from_the_cold_by_john_le.json": "I haven't read much in spy novels, but this book was incredible and is\nunderstandably a classic. In the world of Cold War espionage the West could play\ndirty just as badly as our counterparts. Sometimes it is necessary to bend to\nthe level of a snake in the fight against the threat of Communist…",
  "data/reddit-books/r/books/comments/ogjiah/please_dont_say_that_book_has_an_amazing_plot.json": "Does this bother anyone else? I consider it to be a significant spoiler. The\npoint of a plot twist is that you do not see it coming. This really upsets me\nbecause now I know that when I read the book it's all going to flip on its head\nat some point. Part of enjoying that book would have been the…",
  "data/reddit-books/r/books/comments/ogk8oh/i_just_finished_reading_siddhartha_by_hesse_i.json": "Sorry if the title is on the dramatic side, but I can't overstate how profoundly\nthat book affected me. It didn't introduce many new concepts to me, but Hesse\nexplained these concepts so beautifully and simply, that it was as if I were\nhearing them for the first time. I'm not an avid reader anymore-…",
  "data/reddit-books/r/books/comments/ogl0da/just_finished_the_road.json": "I am unwell to say the very least. Not going to lie I cried a little more than I\nwould have liked to. I wasn’t a huge fan of McCarthy’s style in the beginning\nbut by the end I felt like I was right there with them.\n\nMy only questions is the man who comes for the little boy at the very end. Who\nis…",
  "data/reddit-books/r/books/comments/ogtwfu/surely_youre_joking_mr_feynman.json": "I have never enjoyed a book this much. The way Richard describes his life...\njust wow. I guess his life was full of adventures and is worth telling.\n\nThis book is written in a casual and fun way that makes it easy to read. The\nidea that he is a noble prize winning physicist and down-to-earth…",
  "data/reddit-books/r/books/comments/oh1org/have_you_even_read_a_book_that_was_so_good_that.json": "Reading Dostoevsky's The Brothers Karamazov was a life changing experience. It\nmade me understand more about myself and human nature more than anything I have\never read. I regret not reading it sooner. No wonder some call it one of the\ngreatest to have ever been written. I feel as if my life is more…",
  "data/reddit-books/r/books/comments/oh4fkc/cs_lewis_said_that_no_book_is_really_worth.json": "I think it is a credible quote only because it was said by a brilliant man who\nwrote a series like Narnia and was friends with Tolkien. Many many great\nclassics would qualify both age groups, but I don’t feel like most new series\nwould.\n\nAt the same time, I think it is very optimistic about a ten…",
  "data/reddit-books/r/books/comments/oh77nm/phases_with_reading.json": "Do other people go through phases with reading? For me it feels like for one\nmonth I’ll not stop reading and get through 4-6 books (which for me is a lot)\nand then I’ll just lose interest and not read anything for the next 3 months (am\nI burnt out from reading so much the month before? I don’t know)…",
  "data/reddit-books/r/books/comments/ohb93j/saint_young_men_is_the_positive_read_i_needed.json": "I hope I’m not breaking any rules by talking about a manga. My girlfriend got me\nthe first book as an anniversary gift after I saw it in a book store and liked\nthe premise and we have loved it!\n\nFor those that don’t know the premise is that Jesus and Buddha have come back to\nearth and are now…",
  "data/reddit-books/r/books/comments/ohilhk/is_it_enjoyable_to_read_a_book_where_the.json": "Lately, I've been thinking and noticed that most books follow a similar arc with\na protagonist who tries to resolve a main conflict. Most of the time, they are\nsuccessful. This makes sense to me because it's nice to see how a problem\neventually unravels, and also there will be character development…",
  "data/reddit-books/r/books/comments/ohj29v/do_men_specifically_avoid_reading_books_written.json": "The Guardian had an article about how of the top 10 female literary authors,\ntheir readership is 81% women. I had never considered this before, truthfully. I\n(female) read books of all types, I don't even notice whether a man or woman\nwrites them. Sometimes I wouldn't even know based on the name.…",
  "data/reddit-books/r/books/comments/ohlnxc/what_is_that_book_that_no_matter_how_popular_and.json": "I've read 1984 by George Orwell and I enjoyed it. I decided to read another book\nof the same genre and I stumbled across Brave New World by Aldous Huxley.\n\nHowever, no matter how much I try to read it, I just can't. I've tried for five\nor six times and I just can't complete the first chapter.\n\nDo…",
  "data/reddit-books/r/books/comments/ohsryt/third_time_reading_fahrenheit_451_first_time.json": "To start, I'm sure this book has been discussed into oblivion, so I apologize if\nyou're tired of seeing these posts. I'm new to the sub and don't really have any\nfriends who are \"readers\". I wanted to say this to someone who might grock it.\n\nThe first time I read the book was in highschool when the…",
  "data/reddit-books/r/books/comments/ohyiqd/read_455_pages_aloud_in_5_days.json": "Our first summer of dating, my now husband and I took a road trip. I read a book\naloud to him when he would get tired while driving or to pass the time in\nnon-scenic areas. It then became a thing of ours to always have a book in the\ncar even if we’re just going to the store. I have read 36 books…",
  "data/reddit-books/r/books/comments/oi2ulo/if_you_were_escaping_earth_in_a_spaceship_during.json": "This is an icebreaker question I ask on dates. It's a good conversation piece to\novercome any awkwardness.\n\nI only sometimes judge. I had one guy tell me that he wasn't that into reading\nand couldn't think of any books. Big time judgment.\n\nBut if someone gives an answer referring to a book I DON'T…",
  "data/reddit-books/r/books/comments/oi391w/how_to_read_victorian_era_books_and_understand.json": "Hi everyone,\n\nDoes anyone have any tips for reading/understanding books from the Victorian\nera?\n\nI've just picked up The Picture of Dorian Gray by Oscar Wilde, and while early\non I'm really liking it, I'm finding the language very very difficult. The style\nof speaking and writing is very new to me…",
  "data/reddit-books/r/books/comments/oi6sdn/glorifying_toxic_relation_in_many_ya_novels.json": "I am not a teen but I have a cousin who is and loves reading novels especially\nY/A fantasy novels and tbh I am disturbed at the portrayal of relationships in\nthem and how everyone is okay with it. Like what message are we passing on to\nteenage girls? I looked at the books that are popular on book…",
  "data/reddit-books/r/books/comments/oi8fg3/what_obscure_or_otherwise_not_well_known_book_do.json": "You might even mention books that weren't originally written in English, if,\nlike me, you're not a native speaker and would like to bring up something from\nyour own culture.\n\nStill, I'd like to mention here a book titled The Firebringer by David\nClement-Davis, which was published in English and had…",
  "data/reddit-books/r/books/comments/oi9qmi/libby_tip_export_your_highlights_as_csv_or_text.json": "First, if you haven't heard about Libby yet, it's an amazing app where many\nlocal libraries offer ebooks and audiobooks! Many small libraries still have\nunexpectedly huge online selections, so make sure to check if yours uses it. If\nyou're familiar with Overdrive, Libby is the successor to…",
  "data/reddit-books/r/books/comments/oiex5o/unpopular_opinion_we_dont_need_likeable.json": "So, i'am really intrigued by this, in most book reviews that i see, including\nmovies, people complain if a character is likeable or not.I don't understand, so\nif a character isn't likeable, this ruins the whole book?For example, i read a\nbook about a werewolf terrorizing a small city, but i never…",
  "data/reddit-books/r/books/comments/oijqga/i_started_using_a_kindle_about_2_months_ago_and.json": "2 months ago, I asked you guys if I should buy a Kindle because I couldn't\nreally afford the time and money needed to have books shipped to my home. And\nconsidering that I move around a lot because of university, it's the most\ncost-effective solution. Can I just say, thank you Amazon for inventing…",
  "data/reddit-books/r/books/comments/oimi4l/how_do_i_buy_ebooks_without_supporting_amazon.json": "I’m sure most people are no stranger to the controversy surrounding Amazon.\nPersonally, I am an ebook reader and I have always used the Kindle store to get\nmy books but I feel wrong consuming from a harmful corporation. Are there any\nother ways I can support authors, and get books on my Kindle…",
  "data/reddit-books/r/books/comments/ois1cg/today_marks_10_years_since_george_rr_martins_book.json": "On July 12 2011 A Dance With Dragons released. I remember picking the book up\nand reading it in between seasons 1 and 2 of the show, and wondering what was\ngoing to happen in the next book. Now 10 years later, I never thought I would\nstill be asking that question. Do you still have hope that the…",
  "data/reddit-books/r/books/comments/oivy3t/why_do_people_like_to_jump_to_claim_things_like.json": "I genuinely want to know why. Because in my eye when it comes to fiction I\nseperate reality from the book I am reading. And when a book is tackling themes\nand portrays something negatively for instance, I tend to look at this as a\ncritique rather than a condonation/advocation of the negative aspect…",
  "data/reddit-books/r/books/comments/oj2e0q/one_of_my_favorite_things.json": "Not sure this belongs here, but needed other book lovers to hear it and let me\nknow if what I’m about to describe only gives me pure joy.\n\nWhen i am reading a book and it mentions a book that I have already read and\ntruly loved…. I get the most happy feeling. Like the author and I are in on…",
  "data/reddit-books/r/books/comments/oj9kkm/self_development_books_are_unnecessarily_too_long.json": "I like some ideas behind self development books but i don't really enjoy most of\nthem because they are full of repeating sentences and could have been way more\nshorter. I usually get bored because of reading tons of examples of the same\nconcepts.\n\nI feel like I would enjoy them more if they wouldn't…",
  "data/reddit-books/r/books/comments/ojaeg9/a_stranger_on_reddit_said_my_book_saved_her_life.json": "Hello. My name is Paul and I'm a professional loser. More than a year ago I\nwrote a book with self-explanatory title \"Stories I Wrote While Being\nSuicidal\"... Everyone who read it liked the book very much, but since I am\nnobody, I don't have a bunch of friends, I don't have thousands of followers…",
  "data/reddit-books/r/books/comments/ojbrz8/what_is_your_book_related_pet_peeve.json": "My pet peeve is when a first edition or print is later discontinued and replaced\nwith a whole new print with a new cover art and different spine. It's not so bad\nif you own all books in the series (this issue doesn't affect you) but if you've\njust started reading a particular series and you haven't…",
  "data/reddit-books/r/books/comments/oje6t4/whats_your_favorite_scene_from_a_bookturnedfilm.json": "Mine is a really cool event from Fellowship of the Ring.\n\nWhile the group was sleeping in a pitch black forest, Legolas sensed a group of\norcs closing in so he woke everyone up. They had to hurry to their boats without\nknowing if they were even going to the right direction. When they finally\nreached…",
  "data/reddit-books/r/books/comments/ojeb98/have_you_ever_finished_a_book_but_a_few.json": "Admittedly I have not finished many books but there are 2 in particular, which\nare my most recent reads, that I can remember the books but I can't remember why\nI enjoyed them. The books are 1q84 by Murakami (all 3 of them) and uprooted by\nNaomi Novik.\n\nI do remember enjoying them at the time and…",
  "data/reddit-books/r/books/comments/ojfcl6/apocalypse_pregnancy_does_every_female.json": "I'm a big fan of apocalyptic and post apocalyptic fiction and after reading too\nmany of these books during the pandemic, it's abundantly clear this trope is\ncompletely played out. I get it, it's human drama on a primal level. It's one of\nthe ultimate fears in a world without modern medicine. It's…",
  "data/reddit-books/r/books/comments/ojombd/les_miserables_made_me_believe_in_abridged.json": "First of all, Les Miss is a great book. Great plot and characters, it makes you\nthink about social injustice and I really think that Victor Hugo achieved his\npurpose to make a critic on french society at all. I liked the book. But it\ncould be 500 pages less AT LEAST. Dear god, i don't care about the…",
  "data/reddit-books/r/books/comments/ojurxw/i_hate_it_when_characters_die_and_come_back_to.json": "A Song of Ice and Fire with Catelyn Stark. Best Served Cold with Nicomo Cosca.\nWax from Mistborn era 2.\n\nThese are just a few offenders. Thing is, I love the books otherwise, but I\nthink taking time to kill a character and make it emotional just to bring them\nback anyway is a waste of space and…",
  "data/reddit-books/r/books/comments/ojv5zj/animal_farm_is_amazing_and_haunting.json": "Never thought a fable could keep me up at night but it did. Mostly everyone\nalready, at least, has heard of what George Orwell's Animal Farm is about and\nrepresents; The allegory for the communist revolution. Animals at the farm\noverthrow their oppressor humans and now own their labor! It was fun to…",
  "data/reddit-books/r/books/comments/ojvi3l/if_you_liked_all_quiet_on_the_western_front.json": "There seems to be an innumerable number of posts about \"All Quiet on the Western\nFront\" by Erich Maria Remarque, for good reason as it is definitely a modern\nmasterpiece. Yet it seems no one has really dove into the rest of Remarque's\nworks which is a real shame as I consider some of them to be…",
  "data/reddit-books/r/books/comments/ok1x4u/just_finished_the_princess_bride.json": "Charming and enjoyable, of course, particularly the famous extended sequence\nwhere the masked man in black fights Inigo Montoya, Fezzik and Vizzini one after\nthe other. Those scenes are truly a highlight of swashbuckling adventure, even\nif it's a parody. But it's a very fond parody, which is…",
  "data/reddit-books/r/books/comments/ok3s8u/those_with_adhd_do_any_of_you_struggle_to.json": "As per the title. Something I've struggled with nearly my entire life. I used to\nbe a complete bookworm up to about 3rd grade, and my worsening attention span\nled to me completely falling off of the reading train.\n\nDo any of you take medication before reading? Or is it just a matter of getting\ninto…",
  "data/reddit-books/r/books/comments/okags5/is_it_normal_to_need_at_least_one_day_to_process.json": "I usually read summaries of that book, criticism, opinions, essays and analysis\nor I simply think about that book as much as possible.\n\nI’m doing this because I know that it’s the only way to retain something from\nthat book. It doesn’t help tremendously because I will still forget much of it,\nbut…",
  "data/reddit-books/r/books/comments/okc3l1/andy_weir_books_make_me_a_little_smarter_project.json": "I absolutely loved The Martian and was really excited when I saw a new novel,\nProject Hail Mary, by Andy Weir. I love the way he takes time to explain complex\nsolutions to problems, aspects of orbital mechanics, and even just basic\nconversions for everyday units of measure; and make it fun! I feel…",
  "data/reddit-books/r/books/comments/okeks4/reading_advice_i_would_give_my_younger_self.json": "I started homeschooling when I was 12 and being able to choose my own reading\nmaterial (plus having more free time) meant that this is when I really started\nspending a lot of time reading for fun. My approach to reading has changed a lot\nover the years (I'm now 19) so I figured I'd make a post of…",
  "data/reddit-books/r/books/comments/okhvqy/just_finished_the_years_of_rice_and_salt_from_kim.json": "I personally found this book to be a thrilling read. For a basic idea of the\nplot, instead of the actual death toll the black death caused in our timeline,\nin this timeline the black death kills pretty much all of Europe which in turn\nleads to the world developing around the muslim world and China…",
  "data/reddit-books/r/books/comments/okkjea/so_i_read_the_devil_wears_prada.json": "I finished reading The Devil Wears Prada today. It was entertaining, but wow.\nI've never disliked a narrarator so much. The way Andy speaks about other people\n- and her disdain for just about everything - really put me off.\n\nA lot of the books events played out like a slow moving train wreck. Andy…",
  "data/reddit-books/r/books/comments/okms3f/just_finished_frankenstein_by_mary_shelley.json": "I recently finished Frankenstein and loved the book, the themes and the story\nwas really good but I still don't get one thing. I have read from many places\nthat in the book real monster was Victor Frankenstein himself but I still don't\nget how?\n\nYes, he was responsible for the monster, he created…",
  "data/reddit-books/r/books/comments/okq0wx/ariadne_was_great_fun_even_if_not_accurate.json": "I enjoy Greek mythology but am far from being an expert.\n\nAfter reading Circe and Song of Achilles, I received this one as a gift. It's as\nenjoyable, and arguably lighter than the latter (Achilles felt a bit cumbersome\nto me).\n\nJennifer Saint, the author, is weaving deftly a few different stories…",
  "data/reddit-books/r/books/comments/okqknx/is_it_common_to_have_no_imagination_while_reading.json": "I recently started getting back into reading; just finished the running man by\nStephen king a few days back and started IT today and realised that when I read\nsomething I don't form a picture of the scene in my head. Like if a character is\ndescribed or the setting is being explained no images form…",
  "data/reddit-books/r/books/comments/oktmsn/ernest_hemingways_a_farewell_to_arms_is_very.json": "The common man is but a pawn in the game of foreign policy for the powers at be.\nEver notice that those who never served in combat have no problem starting wars\nand sending young people to their deaths in a war where we don't even know what\nvictory looks like?\n\nJust when you think you've found…",
  "data/reddit-books/r/books/comments/okuz3y/i_just_finished_the_book_thief_and_it_broke_me.json": "I know I'm very late to the party but I just absolutely loved this book. I'm\nobsessed with the World Wars and that era so I was hooked throughout but the\nstory and the ending just broke me. I want to cry my eyes out but I'm the kind\nof person who couldn't cry infront of people and there's a ton of…",
  "data/reddit-books/r/books/comments/ol0i03/just_got_a_library_card_for_the_first_time_in_my.json": "I feel so free! WOW. Why was I shoplifting from Barnes and Noble this whole\ntime?? Joking! But seriously having a library card as an adult is such a great\nfeeling.\n\nI only just started to get into reading at age 25. I read as a kid but from\nmiddle school onward I just stopped. Convinced myself I…",
  "data/reddit-books/r/books/comments/ol6pj5/the_best_book_of_all_time.json": "What is the best book of all time? This question has been asked and will be\nasked throughout time.\n\nIn truth, it is impossible to answer. Instead, each and every person must answer\nit for themselves.\n\nAfter many, many books and rereads, I have reached my answer.\n\nFirst my honorable…",
  "data/reddit-books/r/books/comments/ol8g0d/call_of_the_wild_and_white_fang_by_jack_london.json": "I just read Call of the Wild, and White Fang, two adventure stories by Jack\nLondon. I did not know what I was even getting into\n\nTo sum it up:\n\n\"If you want a picture of Jack London, imagine a boot stamping on a dogs face—\nforever.\"\n\nThese books were brutal. Poor Buck and White Fang! Reading both of…",
  "data/reddit-books/r/books/comments/olglzn/just_finished_reading_a_river_in_darkness_wow.json": "Haven't read a book in a very long time, but I suddenly became hooked on the\nbook 'A River In Darkness', about a boy who moves from Japan to North Korea with\nhis family, it covers his life in North Korea and his eventual escape. I'll try\nand not spoil it, but it's a heartbreaking read (for me…",
  "data/reddit-books/r/books/comments/olk23c/i_love_reading_authors_notesafterwordpreface.json": "I just finished reading To Sleep in a Sea of Stars by Christopher Paolini and I\nwas thinking, \"that book was pretty 'eh', pretty 'okay', nothing to write home\nabout\" and then I read the afterword and it was an adventure I tell you. Poor\nguy spent over nine years on this book, but he has good humor…",
  "data/reddit-books/r/books/comments/oll92u/odysseus_fought_twice_in_the_trojan_war_once_on.json": "okay so as a non-native speaker i had a really hard time formulating that title,\nlol, i’ll try to explain my thoughts a bit better.\n\ni’m currently taking a Lit class where we dissect Odyssey and i’ve been blown\naway from how much i’ve missed when i first read it before taking this class\n(despite…",
  "data/reddit-books/r/books/comments/ollglz/i_am_a_slow_reader_and_im_okay_with_that.json": "I adore books. Reading is amazing and I love to write novels and poetry. I read\nslowly, as I don’t get much time in my day. I also listen to audiobooks. I love\nopening a book, sitting in the sun, and reading.\n\nBut I’m a slow reader. I don’t gobble one book after another and don’t feel that\nI need…",
  "data/reddit-books/r/books/comments/oluit2/never_let_me_go_by_kazuo_ishiguro_i_simply_dont.json": "So I just finished this book, an hour ago I think. I liked it, it's well\nwritten, easy to read too, and I was quite captivated by the story.\n\nThis is narrated by Kathy H., a woman who is going over her life and memories in\nan attempt to \"come to to terms with them\". It's really hard for me to…",
  "data/reddit-books/r/books/comments/olzs48/i_love_murakami.json": "I'll just jump straight into it. I love Murakami.\n\nI love the melancholy feel of all his books.\n\nI love the blend between everyday menial tasks that his characters do, along\nwith the weird as dream like states whose meanings are impossible to decipher.\n\nI also weirdly love that all his…",
  "data/reddit-books/r/books/comments/om0vfu/i_zone_out_while_reading_sometimes.json": "Sometimes when reading I feel like im just reading the words but not processing\nthem, thia usually happens when theres a lot of characters or i zoned out or\nmisread something, sometimes i think I'm dyslexic because i have to reread a\nsentence because I completely misread it\n\nTakeaway is; any tips on…",
  "data/reddit-books/r/books/comments/om0zit/book_club_etiquette_for_not_liking_something.json": "So last year I was in a book club with some really close friends and a book came\nup that I read all the way through and absolutely hated. It ended up causing a\nhuge fight and unfortunately led to the end of the friendship (although there\nwere other factors, the book discussion was sort of the…",
  "data/reddit-books/r/books/comments/om34k5/i_used_to_think_goodreads_motivated_me_to_read.json": "I don’t know how many people feel this way, but I’ve realized not too long ago\nhow stressful consciously tracking my music listening or reading habits has\nbecome for me. I should just be able to read whatever I want whenever I want and\nnot worry about how much progress I make or how many books I’ve…",
  "data/reddit-books/r/books/comments/om4gjn/whats_the_best_opening_sentence_of_a_book_you.json": "My favorite is this:\n\n“I, who write this, am a dead man. Dead legally—dead by absolute proofs—dead and\nburied! Ask for me in my native city and they will tell you I was one of the\nvictims of the cholera that ravaged Naples in 1884, and that my mortal remains\nlie moldering in the funeral vault of my…",
  "data/reddit-books/r/books/comments/om70w5/question_about_the_names_and_titles_in_anna.json": "I just finished Anna Karenina and I had some questions. This might just be me\nbeing unaware of the Russian system, please forgive me if this is inappropriate\nfor the sub.\n\n 1. Who are the Princes and Princesses in the book, exactly? Are they related to\n    the royal family? But there seems to be so…",
  "data/reddit-books/r/books/comments/om9u5m/advice_for_reading_cormac_mccarthy_for_the_first.json": "Blood Meridian has been on my list for a really long time and I have a camping\ntrip coming up sans kids and think this is finally the right time to tackle it.\nI've heard a lot of folks don't finish this book and I will quit a book but I\nnever like to.\n\nI've heard McCarthy uses very a advanced…",
  "data/reddit-books/r/books/comments/om9zw6/depictions_of_abuse_in_kids_books.json": "I just finished reading the first book in a Series of Unfortunate Events. I am\nrereading as an adult after a long time kand it holds up!)\n\nAs the title suggests, horrible things happen to the main characters, which as\nan adult I recognise as child abuse. And it made me think what is the impact…",
  "data/reddit-books/r/books/comments/omm07t/have_you_ever_watched_a_film_adaptation_that.json": "For as long as we know, film adaptations have been a norm in the film industry.\nEvery year there are various headlines of news articles of different films being\nbased on novels, with a lot eventually becoming critically acclaimed films that\nfilm lovers love and admire up until today.\n\nI know this is…",
  "data/reddit-books/r/books/comments/omsdy8/how_do_you_handle_continuing_a_book_series_when.json": "I'm currently going through this now. I read The Stormlight Archives books one\nthrough three pretty much one after another, so didn't have any issues. At the\ntime, Oathbringer was the most recent book, so I tried my hand at reading the\nExpense. I read books one through five and enjoyed them with no…",
  "data/reddit-books/r/books/comments/omunhz/representation_matters_the_importance_of_diverse.json": "It is extremely important the children and teenagers have access to a wide range\nof diverse literature. This includes authentic authors and books that depict\ncharacters from all walks of life (bipoc, lgbt+, multi-cultural, religions,\npeople living with disabilities, etc.)\n\nThis is important for a…",
  "data/reddit-books/r/books/comments/omzuue/what_is_the_scariest_book_youve_ever_read_what.json": "The scarier the better! For me, it has to be We Need to talk about Kevin. The\nculmination of the plot (you'll know what I'm talking about if you've read it)\nbasically refused to register in my brain the first time I read it, I had to go\nback and read it again immediately after reading it the first…",
  "data/reddit-books/r/books/comments/on0s5n/is_literary_fiction_just_the_fiction_of_the.json": "It's said all genres are basically created for the purpose of marketing. That\nmade me think, who is literary fiction marketed to? The people who read it might\nthink of it as capturing the human experience, but does it only capture a small\nsegment of the human experience?\n\nJust something to think…",
  "data/reddit-books/r/books/comments/on2zql/the_neverending_story_is_a_far_better_fantasy.json": "I can see this easily becoming a \"There are much better fantasy books than Harry\nPotter.\"\n\nBut I just finished reading The Neverending Story and I loved the book so much.\nHow it's printed in green and red ink to differentiate the two worlds, and I\nloved the second half of the novel when Bastian goes…",
  "data/reddit-books/r/books/comments/onen3l/the_starless_sea_piranesi_and_orfeia_three.json": "Highly recommend. All of them have that same element of contemporary fantasy,\nbut they all are so different yet still vibrantly written in a similar way. The\nwords just dance on the pages creating a wonderful painting in your mind. These\naren't the types of books that create a movie in your mind.…",
  "data/reddit-books/r/books/comments/ong0dg/what_is_your_favorite_scifi_book_and_why.json": "I'm lately started reading sci-fi books and I sometimes regret that I didn't\nread some books earlier.\n\nI didn't read much yet except the sci-fi classics, but 2001 A Space Odyssey by\nArthur C. Clarke is one of my favorites so far. I also liked I-Robot by Isaac\nAsimov. It was somehow like a children's…",
  "data/reddit-books/r/books/comments/ong7y5/three_body_problem_by_liu_cixin_changed_my.json": "I finished the trilogy (Earth's Remembrance Past) last two weeks. And boy, I'm\nstill thinking about it from time to time. To be honest none of the protagonists\nare likeable especially Luo Ji and Cheng. But I believe we don't need perfect\ncharacters with predictable outcomes in terms of morals. These…",
  "data/reddit-books/r/books/comments/onivxh/does_a_tvfilm_adaptation_drive_you_to_read_the.json": "I see Legendary Studios is starting to ramp up their marketing and publicity for\nDUNE. The movie has a great director, one helluva cast, and I love the look of\nit. I've read the novel several times as an adult and it is always a fantastic\ntime.\n\nI'm gearing up for my next re-read sometime later this…",
  "data/reddit-books/r/books/comments/onli3s/just_finished_they_both_die_at_the_end_this_book.json": "They Both Die At The End tells the story of two teenage boys that are set to die\nat the end of the day, but they’ve got one last day to spend with each other,\nAdam Silvera tells their story in such a tauntingly beautiful way that easily\nhooks any type of audience.\n\nthis book was everything I expect…",
  "data/reddit-books/r/books/comments/onujx3/i_get_why_everyone_talks_about_stephen_king_now.json": "I only started seriously reading around last December and had only read On\nWriting for an English class. I’m in the middle of The Shining and finished The\nGunslinger in 3 days, and now I understand why everyone praises him. The imagery\nand vivid word choice make the stories feel so real. The way he…",
  "data/reddit-books/r/books/comments/onyame/a_picture_of_dorian_gray.json": "Hello all! I just finished reading “A Picture of Dorian Gray” by Oscar Wilde and\nI have a minor rant.\n\nI blame Harry for everything. Dorian was a pure, innocent boy before meeting\nhim. Even Basil knew how Harry could corrupt Dorian, and begged him not to.\nWithout Harry’s influence, Dorian never…",
  "data/reddit-books/r/books/comments/oo8ffv/to_whoever_on_here_recommended_the_princess_bride.json": "Thank you so much. I haven’t been able to read much more than a chapter of a\nbook for years because of depression and anxiety. I bought it when I saw your\npost and finished it the same night.\n\nThank you so much for helping me find something I could read and remember how\nmuch I used to love reading.…",
  "data/reddit-books/r/books/comments/oofhq8/the_overstory_by_richard_powers.json": "This book was given to me mid-pandemic by friends that identify me as a tree\nhugging, plant whisper. I finished yesterday and it was fantastic. I am a\nbiologist by profession and have worked as a botanist for the last 4-5 years.\nThis book is incredibly scientifically accurate and the description of…",
  "data/reddit-books/r/books/comments/oohrax/if_youve_started_reading_to_kill_a_mockingbird.json": "I won’t spoil anything here.\n\nI wanted to make this post because when I read the first few chapters of this\nbook, I simply didn’t understand why it was perceived as a modern classic. I\nactually found it difficult to read due to the 1930s southern slang. I wasn’t\nenjoying it much at all at first and…",
  "data/reddit-books/r/books/comments/oolbfk/the_sluts_by_dennis_cooper_is_a_disturbing_darkly.json": "It is shocking to see a book that captures an experience that comes in so many\ndifferent forms so perfectly in its fictional and often extreme account, but The\nSluts manages that feat.\n\nNow, I've been an active member in various online forums and communities since I\nwas seven. Is that a terrible…",
  "data/reddit-books/r/books/comments/ooms3q/literature_of_belgium_july_2021.json": "Welkom readers,\n\nThis is our monthly discussion of the literature of the world! Every Wednesday,\nwe'll post a new country or culture for you to recommend literature from, with\nthe caveat that it must have been written by someone from that there (i.e.\nShogun by James Clavell is a great book but…",
  "data/reddit-books/r/books/comments/oor5o5/reading_books_with_my_dad_who_is_a_dentist.json": "Authors don't really pay attention to the dental care, and my dad brings up lots\nof good questions:\n\n> me: Hey dad, how do you like the book so far?\n> \n> dad: The main character said he broke his molar a couple chapters back does\n> that ever get fixed?\n> \n> me: uh, I don't know, probably?\n> \n> dad:…",
  "data/reddit-books/r/books/comments/oord6e/i_dislike_it_when_books_are_described_as_diverse.json": "As a South Asian, I am glad books with POC main characters and settings outside\nthe West are gaining popularity, but I find it irritating when people\nautomatically label those books 'diverse' and 'inclusive'. It makes it sound\nlike those books exist to teach a white, mostly American audience…",
  "data/reddit-books/r/books/comments/oovhx9/what_is_your_comfort_genre.json": "I think everyone has a comfort genre, a genre of books you read when things\naren’t great. If there is something bad going on or if my schedule is too busy I\nfind myself reading murder mysteries because they’re easy to read and are\ncomforting (to me). What is a genre of book that you find yourself…",
  "data/reddit-books/r/books/comments/op78vs/i_read_my_first_book_in_over_5_years.json": "I know this post isn’t unique or any big achievement but I set myself a task or\ntrying to read books as part of my detox from using my technology and I’m proud\nto say that I have finished my first book. The book is titled Klara and the Sun\nby Kazuo Ishiguro and I really enjoyed it!\n\nPrior to this…",
  "data/reddit-books/r/books/comments/opamk1/how_do_you_manage_to_reread_your_favorite_books.json": "My tbr is growing constantly and whenever I feel that I might see the end of it,\nmore and books are coming to my attention. I feel quite overwhelmed by it and\nwhat makes me sad is that I never get to reread my favorite books, I never\nmanage to do it. Do you ever get this feeling that there are so…",
  "data/reddit-books/r/books/comments/opc1fp/i_set_a_reading_goal_for_myself_and_im_proud.json": "I'm a middle-aged mom working remote full-time while simultaneously taking care\nof a 2 year old. At the beginning of 2021, I made a goal to read at least one\nbook a month, after my best friend sent me a book in a care package. It has\nbecome a fun challenge just for me, and now my family has taken an…",
  "data/reddit-books/r/books/comments/oph9dk/books_with_battle_scars.json": "I spent a long time selling second hand books for a charity. They came in with\nall kinds of wear and tear and it was often a guide to how good the book was.\n\nThe easy one was cookbooks. Any good cookbook gets used, and every blob of pasta\nsauce or gravy on the pages is an extra star in the…",
  "data/reddit-books/r/books/comments/ophg8i/how_do_you_get_over_the_lack_of_discussion_over_a.json": "I recently finished reading Replay by Ken Grimwood and it's such a stunning\nbook. I have so much to discuss, so many questions and so many thoughts. By I\nwas surprised to see that there is barely any discussion about it now or in the\npast and none in my circle read it either.\n\nOn the other hand,…",
  "data/reddit-books/r/books/comments/opl4xs/what_are_your_favorite_popcorn_books.json": "I was reading Jurassic Park (banger of a book) and then I dove into the Robert\nLangdon series and whoah boy it was WAY goofier than I was anticipating. It was\nlike pump meets a bizarre sci-fi meets those American Treasure movies with Nick\nCage.\n\nOnce I got over myself I sort of just let the chips…",
  "data/reddit-books/r/books/comments/oplp3a/an_unintended_consequence_of_scout_her_older.json": "In Chapter 3, it is revealed that their cook Calpurnia or \"Cal\" has assumed the\nrole of \"mom\" especially to Scout who is younger and does not remember her mom\nwho passed away. When disciplined by Calpurnia, Scout childishly threatens to\ndrown herself to make Calpurnia feel sorry, thus laying bare…",
  "data/reddit-books/r/books/comments/opqf19/after_about_17_years_i_finally_made_myself_start.json": "The first time I have ever heard of the LoTR, was when the movies came out, and\nit was about the same time as Harry Potter movies were coming out as well. Not\nknowing any better (at all), I compared the two series (I was obsessed w HP) and\nas a result, was bullied in class. Badly.\n\nAs a result, its…",
  "data/reddit-books/r/books/comments/oq55ur/making_accusations_against_authors_based_on_their.json": "While I'm probably just shouting into the void I wanted to have this discussion\nin the hopes at least one person may be swayed to consider their words.\n\nI was finally pushed to make this post after someone made a highly upvoted\ncomment on a sub alleging that a writer for a Law and Order TV show was…",
  "data/reddit-books/r/books/comments/oq5zqd/ive_never_quit_a_book_but_ready_player_one_made.json": "For the first time in my life I'm going to quit a book. Ready Player One is\nlazy, derivative, nostalgic garbage. I'm only 6 chapters in and already it's got\nscenes that feel like:\n\n> \"OOOOOHHHH\" and then everyone clapped\n\nAnd the main character is just soooo poor and soooo gross and soooo acne…",
  "data/reddit-books/r/books/comments/oq6q9l/is_it_just_me_or_are_the_characters_in_anna.json": "I never thought my main reaction to reading conversations between 19th century\nrussian aristocrats would be \"jup I totally feel that\". That scene where Levin\nis ice skating and being awkward around his crush is permanently etched into my\nmind as the most relatable thing I have ever read. I guess…",
  "data/reddit-books/r/books/comments/oq9og0/50_pages_a_day_challenge_for_those_struggling.json": "i want to preface this by saying, yes i know reading isnt a competition and yes\nread as much as you want, its no race but...\n\nif you want to read somewhere inside and get away from the screens but get lost\nin the internet, spending your time mindlessly scrolling then setting a daily\nchapter or page…",
  "data/reddit-books/r/books/comments/oqn1zh/circe.json": "Sailing on the sea can go both ways.\n\nFirst, it could go as calm as those nights when you're relaxing after work and\nwants to sleep using the soft lull of the songs. The sea would send you tiny\nbumps of waves that nudges you and your ship/boat almost nonexistent. It would\nbe the most comforting…",
  "data/reddit-books/r/books/comments/oqqmp7/about_to_read_dune_for_the_first_time_at_age_50.json": "Since I was a kid, I always heard of Dune.\n\nA massive Sci-Fi novel of epic proportions. I never read it - as I was put off\nby this large world-building behemoth that would bog me down with weird\nterminology and characters and worlds too complex to grasp and care about.\n\nWas I wrong? Does it still…",
  "data/reddit-books/r/books/comments/oqswwr/authors_with_really_beautiful_prose.json": "I recently asked for recommendations for books with really beautiful prose, and\nthe range of answers I received was pretty surprising. The few that I'd read,\nwhile good books, did not stand out for their prose. What it made clear to me is\nhow divergent our interpretations of \"really beautiful prose\"…",
  "data/reddit-books/r/books/comments/oqtgv5/trying_to_find_an_explanation_for_a_strange_word.json": "Hi, I am currently reading “Ship of Magic” by Robin Hobbs which is the first\nbook of “The Liveship Traders” trilogy.\n\nI came across a weird word that struck me as I was not able to fully comprehend\nit (and as English is not my first language). This word is written as follows:\n“slaves-cum…",
  "data/reddit-books/r/books/comments/oqtjhz/if_there_is_one_good_thing_covid_brought_it_is.json": "Pre covid I hardly read. Maybe the odd magazine now and again that I would rush\nthe writing and just look at the pictures. However, like one month before\ninitial covid lockdown I bought some books dirt cheap and had them laying around\nwith minimal intentions of really reading them. Once lockdown…",
  "data/reddit-books/r/books/comments/oqtnb5/do_you_get_cooking_inspiration_from_books.json": "Do you ever read a fiction book with a character who really loves food and\ndescribes the cooking and eating experience in great detail, and find yourself\nwanting to make the dishes at home? This happens to me a lot. Last night I read\nBig Summer, where banana bread was a plot point, and I immediately…",
  "data/reddit-books/r/books/comments/or4500/imo_the_sirens_of_titan_by_kurt_vonnegut_is_one.json": "I started high school last September, and have read an insane amount of books\nsince then. Reading has become one of my favorite hobbies now. My dad showed me\n“Cat’s Cradle” and said he had read it in college, and so I gave it a shot, and\nI loved it.\n\nThen I read quite a few more books by Vonnegut,…",
  "data/reddit-books/r/books/comments/or4gxg/i_think_ive_outgrown_ya.json": "Just to be clear, this post isn’t in anyway to bash YA novels. There are so many\nthat are excellent and complex and I don’t think that the genre deserves to be\nbashed as much as it is. This is just my personal experience so please be kind\n\nI was always a lifelong YA reader (to be fair I do fall into…",
  "data/reddit-books/r/books/comments/or9vx7/persuasion_by_jane_austen.json": "I just finished reading Persuasion, and I would be happy to hear opinions and\ndiscuss the book. Personally I was deeply impressed by this book for a number of\nreasons. For one thing, I feel that it was a very meaningful satire on class and\nsocial inequality, written at a time when many people were…",
  "data/reddit-books/r/books/comments/orazux/whats_your_comfort_book.json": "Do you have a book or book series you go back to and reread while going through\na difficult time in your life?\n\nI just realized that, whenever I'm going through a rough patch, I tend to go\nback to my favorite series \"The Wheel of Time\". I've grown very fond of the\ncharacters, and rereading those…",
  "data/reddit-books/r/books/comments/orcq2f/has_anyone_read_the_wheel_of_time.json": "I started reading the series a few months ago, and I’m absolutely hooked. It has\na very Tolkien-like atmosphere, but at the same time continues to change my idea\nof what an epic fantasy can contain. Suffice to say, I’m in love with it.\n\nHowever, I can’t seem to find anyone who has read it, and I’m…",
  "data/reddit-books/r/books/comments/ore30v/in_the_early_1900s_sir_arthur_conan_doyle.json": "Did you know that Sir Arthur Conan Doyle -- the famed author of Sherlock Holmes\n-- was once tasked to solve a real life crime? The case involved a savage\nmurder, stolen jewelry, an international manhunt, and a wily maidservant who\nwent to her grave knowing far more about the killing than she had…",
  "data/reddit-books/r/books/comments/orejk8/first_time_ive_gotten_lost_in_a_book_in_a_long.json": "I‘ve always loved reading, but the past year or so I‘ve completely fallen out.\nI‘d pick up a book, get maybe 20 or 50 pages in and put it down. Pick up a new\none, do the same thing. Finally, this week, I picked up 11/22/63. It‘s my first\nStephen King, and I didn‘t really know what I was walking…",
  "data/reddit-books/r/books/comments/orf3t6/im_currently_reading_rachel_louise_snyders_no.json": "One of my friends is an attorney who handles a lot of domestic abuse cases and\nshe recommended Rachel Louise Snyder's book \"No Visible Bruises: What We Don't\nKnow About Domestic Abuse Can Kill Us\" for a book club we are both in. I'm not\nan attorney and don't really want to go into what my work…",
  "data/reddit-books/r/books/comments/orgbxo/devil_in_the_white_city_is_such_a_great_period.json": "I just read Devil in the white city and I absolutely loved it. Well paced for\nthe most part and interesting. Half the book i thought i wasn't gonna care\nabout, cause it's about architects and them building the world fair. But the\nauthor is so good at making things interesting. I was just invested in…",
  "data/reddit-books/r/books/comments/orohy7/what_is_your_toxic_reading_trait.json": "Mine is that I almost always refuse to read a book unless it has raving reviews.\nLike 4 star minimum on good reads.\n\nAnother one is that I have tried to read so many classics but can’t get more\nthan 20% through most of the time because I become so bored.\n\nI also feel like I can’t only buy one book…",
  "data/reddit-books/r/books/comments/oru4ht/i_just_finished_watership_down_for_the_first_time.json": "Just wanted to show my appreciation for this absolute masterpiece. Every single\ndetail of this book is perfect.\n\nI am new to reading and I have never been so emotional during a book before. The\nending made me cry like a baby.\n\nThe world building, rabbit society, stories and characters (shout out to…",
  "data/reddit-books/r/books/comments/orxnij/which_classic_book_disappointed_you_the_most.json": "I feel like classics always have a good reason as to why they stay popular over\ndecades/centuries which is why I’m currently trying to read many “must-read”\nclassics. I’m actually enjoying most of them, however one book that took me like\nhalf a year to finish is “To Kill A Mockingbird”. I just don’t…",
  "data/reddit-books/r/books/comments/os1mkb/fantasy_what_is_your_gateway_book.json": "Someone asked me an excellent question during a conversation about fantasy\nnovels. I felt the need to share it along with a little personal narrative.\nThe question was \"What was your gateway book into the fantasy genre?\"\n\nMy answer of Redwall / Mossflower by Brian Jacques did not take much thought…",
  "data/reddit-books/r/books/comments/os6c9f/what_book_made_you_go_fuck_this_is_good.json": "I'm not a big reader. I just read a few books every year. 4 years ago I was\nbrowsing my local bookstore and no book caught my eye. The bookstore owner asked\nwhat my favorite childhood book was and I said that I always loved Harry Potter.\nHe then recommended The Name Of The Wind by Patrick Rothfuss…",
  "data/reddit-books/r/books/comments/os7c81/what_are_your_thoughts_on_neil_gaiman.json": "Personally, I love his stories. I think he writes really quirky and creatively.\nI especially love his graphic novels.\n\nI just picked back up Neverwhere, where I bought years ago and never finished.\nAs I'm re-reading it I'm noticing a lot of \"He had long hair\" \"she wore this\"\n\"He did that\" \"She said…",
  "data/reddit-books/r/books/comments/os9grj/i_just_finished_anna_karenina.json": "My life has peaked. I have witnessed some of the most real characters, in both\ntheir complexity and human predictability, to ever stem from a mind. I almost\nfeel as though I have truly lived a life during my reading; I have experienced\nso much that has made me ponder, smile with glee, cry with…",
  "data/reddit-books/r/books/comments/osb17a/george_rr_martins_achilles_heel_in_writing.json": "So there's this little known series called a song of ice and fire that needs,\nwe've been told, only 2 books to accomplish. I'm not as interested in learning\nif it ever will be published but rather I am guessing as to why it can't be\nfinished.\n\nGeorge rr martin is a great writer. He also claims he is…",
  "data/reddit-books/r/books/comments/ose52n/the_rape_of_nanking_is_one_of_the_most_brutal.json": "The book is about the invasion of China's capital city at the time (1937),\nNanking, by the Japanese Imperial army. At the time, the Japanese grew\nfrustrated with the limited amount of space they had in their country for\nfarming and sustaining their growing population. For these and many…",
  "data/reddit-books/r/books/comments/osh2hw/reading_song_of_achilles_when_a_book_can_tell_you.json": "Like you know the whole time Achilles is going to die, even if you didn’t know\nit from general knowledge you learn the prophecy in the book and I remember\nreading another series that did that. They were like this is what’s gonna happen\nhe dies at the end but you still love the story and cry when he…",
  "data/reddit-books/r/books/comments/osnn19/limiting_my_screen_time_drastically_improved_my.json": "Up until six months ago I hadn’t read a full book in ages. It’s not that I\ndidn’t want to. I’ve been an avid reader since I was a child but since I was 16\nor 17 my reading just dramatically dropped off.\n\nOver the years I tried reading books that were recommended to me. I would often\ntry to read at…",
  "data/reddit-books/r/books/comments/osomvz/6_months_of_no_facebook_and_i_have_never_read_so.json": "Every night at 8 pm I put my phone in another room and read until I am falling\nasleep. So far, I have read:\n\nBraiding Sweetgrass\n\nAriadne\n\nSong of Achilles\n\nCirce\n\nBeartown\n\nThe Artic Fury\n\nSoulkeeper\n\nWhite Rose, Black Forest\n\nThe Nightingale\n\nSoulbound Series\n\nShieldmaiden: Under the Howling…",
  "data/reddit-books/r/books/comments/ossgss/kim_stanley_robinsons_the_ministry_for_the_future.json": "Last night, I finished \"The Ministry for the Future\", and I personally found it\nto be the best antidote to feelings of climate doom I've ever read.\n\nIt's by no means an optimistic or utopian imagining of the near future (in fact,\nthe book opens with a deadly heatwave in India that kills 20+ million…",
  "data/reddit-books/r/books/comments/osuoaf/i_just_read_the_first_two_books_of_earthsea_by.json": "Yeah, what it says in the title. I'm currently in the middle of the third book\nand I have all the rest of them too. First, no spoiler talk if you're reading\nthis post but haven't read the books. The first, A Wizard of Earthsea, didn't\ngrab my attention as soon as I started reading it, as I felt like…",
  "data/reddit-books/r/books/comments/ot022m/i_think_animal_farm_is_a_better_book_than_1984.json": "Okay, so I know many don’t like opinions along the lines of “this book is better\nthan that book” because everyone can have different interests, but I think\nAnimal Farm is WAY underrated.\n\nIt is a short, simple allegory that can be read at any level (I read it first in\nmiddle school), but that still…",
  "data/reddit-books/r/books/comments/otfdxt/east_of_eden.json": "I don’t know what could be said about this book that hasn’t already been.\nSomeone had stated that ‘Steinbeck writes in a way where the words just flow off\nthe page like butter’ and ‘I don’t know what it is about Steinbeck but his\nwriting instantly makes me forget about everything around me.’. These…",
  "data/reddit-books/r/books/comments/otjtzp/id_like_to_like_cormac_mccarthy.json": "I read quite widely, and enjoy the majority of what I read. Theoretically\nMcCarthy’s approach and subject matter are something I would generally be drawn\ntowards- but I’ve attempted The Road, No Country for Old Men, and All The Pretty\nHorses and haven’t been able to get past 50 pages or so without…",
  "data/reddit-books/r/books/comments/otkow7/the_silence_of_girls_changed_my_perspective_on.json": "TW:// mentions of Sexual Assault\n\nThe Silence of Girls by Pat Barker and The Song of Achilles by Madeline Miller\nboth have the same setting. They both examine Achilles' role in the Trojan war,\ntold by the people whose stories have been often overlooked (albeit SOA starts\nbefore Achilles makes it to…",
  "data/reddit-books/r/books/comments/otm7ks/was_there_ever_a_random_quote_that_stuck_out_to.json": "I mean like, not an inspirational quote, but just a specific line that you still\nremember to this day, years later?\n\nMy example would be from 20,000 Leagues Under The Sea, where, though I still\nremember the book fairly well, I haven’t read it in over a decade, but I still\nhave crystal clear…",
  "data/reddit-books/r/books/comments/otqjju/1q84_i_dont_know_if_i_can_keep_going_help.json": "I’ve been told for ages that i would love haruki murakami, but somehow never\nquite got around to it. I’m on my first, 1Q84. At first i was extremely\nintrigued but man it’s just slogging for me now. Not sure if i have a bad\nEnglish translation but it’s repetitive, simple and dry. Sometimes i can…",
  "data/reddit-books/r/books/comments/otv2st/at_what_point_do_i_quit_reading_a_book.json": "I'm reading American Psycho and while I knew it was going to be a tough read, I\nwas not prepared for this. The writing style does not appeal to me whatsoever. I\nunderstand why it is written like this, but the tedious descriptions of\nBateman's apartment, his clothes, conversations are a slog to get…",
  "data/reddit-books/r/books/comments/otvy67/feel_black_hearted_trying_to_read_romances.json": "I used to read romances as well as other genres. Since a lot of life stuff has\nhappened, and feeling not interested in dating in real life, I just can't get\nback into reading (or watching) romances. It feels so disingenuous and cheesy.\nThere are authors I used to love that I just can't read their…",
  "data/reddit-books/r/books/comments/ou1bm0/i_cant_enjoy_shakespeare_and_it_makes_me_sad.json": "English is not my first language, and although I'm fluent enough to read the\nvast majority of books without a problem, Shakespeare's language is too high a\nbarrier for me. I read it, but after most sentences I have to stop and try to\nfigure out what it means, and it kills the flow of the play. I…",
  "data/reddit-books/r/books/comments/ou6sbm/vandermeers_ambergris_is_a_misunderstood.json": "Vandermeer is an author best known for Annihilation, which was made into movie\nstarring Natalie Portman. His earlier trilogy, Ambergris, is obscure enough that\nit was mostly out of print until a year ago when it was released in as an\nomnibus. After reading through the trilogy in a couple weeks, I am…",
  "data/reddit-books/r/books/comments/ou8hr5/after_years_of_slow_reading_ive_read_9_books_in.json": "Title says it all!\n\nLike most of us, I used to devour books when I was a child. There was no way of\nstopping me from reading anything I could find on my mom's bookshelf. But adult\nlife has gotten the better of me; I have to study a lot to keep up with office\nwork, and I just didn't have the energy…",
  "data/reddit-books/r/books/comments/oua7tv/whats_the_worst_book_to_bring_up_in_a_job.json": "Sometimes employers will ask you if you've read anything recently. Maybe they do\nthis to gage your attention span? On an interpersonal level, I think this is a\ngreat question to get to know someone. Its the first thing I ask when I meet\nsomeone, but I doubt employers actually care.\n\nAnyways, I think…",
  "data/reddit-books/r/books/comments/oufx73/finished_also_sprach_zarathustra_by_friedrich.json": "God is dead and he was killed by pity for us humans.\n\nI totally appreciate the Nietzsches dislike for everything religious and I think\nit was his topic to get rid of the religious nonsense that existed back then\n(and still exists). I only read Antichrist so far, which is a full rant about\nreligions…",
  "data/reddit-books/r/books/comments/oulbva/what_book_is_criminally_misunderstood.json": "The first ones that come to mind to me are F*ght Club and 1984. It’s so\nfrustrating to see good literature taken the complete wrong way.\n\nThe perception of F*ght Club is especially frustrating because people think the\nbook is celebrating exactly the kind of extremism and toxic behavior…",
  "data/reddit-books/r/books/comments/oulv9y/the_lord_of_the_rings.json": "I am currently re-reading LOTR; I read it several times before the movies came\nout but have not since. Currently in the middle of book 4 when Frodo, Sam and\nGollum first enter Ithilien.\n\nMan, what great writing and wonderful storytelling. Every half hour or so I\nthink to myself, \"This is such a…",
  "data/reddit-books/r/books/comments/ouo4lm/jonathan_strange_and_mr_norrell_by_susanna_clarke.json": "I read it a bit ago and I loved it. The first book of the authors I read was\nPiranesi, though I liked it, I wasn't all impressed the way I was hoping, so I\nwas hesitant to buy this one. Though I bought it on a whim and I enjoyed it\nimmediately. Though it stretched here and there, I still loved the…",
  "data/reddit-books/r/books/comments/ouq40a/any_popular_author_you_just_dont_really_have_a.json": "Please don’t come after me, but I just don’t have an interest to get into\nStephen King books. Don’t get me wrong, I am not opposed to it and I even own\nThe Green Mile and intend to read it eventually but as of now, the hype is\nalmost off-putting to me. Anybody else feel similarly or with another…",
  "data/reddit-books/r/books/comments/ouyso9/the_little_prince_moved_me_more_in_its_83_pages.json": "This book is absolutely beautiful, it’s written for children but I think it\ncarries lessons adults should hear as well. The adventures the little prince go\non talk about love, bonds, life, and shows “adult” behavior in the eyes of a\nchild. The prince meets adults who do things that are absurd to…",
  "data/reddit-books/r/books/comments/ov49qz/work_keeps_me_from_reading.json": "I get up at 7 AM I return home at 6 PM - I have a job where I cannot read at\nwork. Once I return home I relax from work for half an hour but then have to do\nsome cooking/cleaning some sports/training - showering - preparing stuff for the\nnext day - laundry - dinner ect. This leaves me around one…",
  "data/reddit-books/r/booksuggestions/comments/obak8r/my_girlfriend_just_got_me_a_kindle.json": "My girlfriend just got me a kindle because it's something I was thinking of\ngetting and she just went ahead and got it for me. What are some books that\nawakened your love for reading and are must reads. I'm a m25 if this helps and\nhave always loved reading comics although I'd prefer the suggestions…",
  "data/reddit-books/r/booksuggestions/comments/obn7tv/should_i_read_rebecca.json": "I’ve had this book on my ‘to read’ list for a while. I see a lot of people talk\nabout how good it is, and I am quite interested. However, I do not enjoy romance\nnovels, and wonder if Rebecca is a romance novel with some elements of mystery.\nIs this a good read?",
  "data/reddit-books/r/booksuggestions/comments/obs8pw/why_do_you_like_stephen_king.json": "I’m not trying to start a fight genuinely asking. I have read the gunslinger and\nI’m trying out Salem’s lot.\n\nMy goal is to get 100 pages in to see if I like it. About halfway to that goal\nand Im feeling very meh about it.\n\nI know that some books are just a matter of preference but King is…",
  "data/reddit-books/r/booksuggestions/comments/oc2igy/suggest_me_a_book_with_female_pirate_as_the_mc.json": "Anything as long as the MC is a female pirate.\n\nI just finished reading daughter of the pirate king duology and all I can say is\nI'm in a she-pirate hangover.\n\nThank in advance if you interact.🌺",
  "data/reddit-books/r/booksuggestions/comments/oc3jz9/westerns.json": "Howdy y'all.\n\nI'm lookin for the rootinest tootinest western around, a real whale of a tale\nwith horses, gunslingers and mysterious strangers.\n\nI've already read blood meridian, warlock and butchers crossing.\n\nVarmints need not apply.",
  "data/reddit-books/r/booksuggestions/comments/oca9w6/horror_anthology_with_interconnected_stories.json": "Hi, I've recently listened to The Magnus Archives and read Uzumaki which made me\nrealise that I enjoy horror the most when stories that are separate at first (or\nwith a linking element) later get connected/continued by a longer, more complex\nstoryline. Any ideas whether there are any horrors with a…",
  "data/reddit-books/r/booksuggestions/comments/ocdgk0/help_me_find_a_book_as_good_as_the_show_breaking.json": "I need a book that will blow my mind as much as the show breaking bad did. I\ncant stop obsessing over how clever the writers were and I can never stop\ntalking about the show. I want a book that is this good, like a book that can be\nlooked at in a million different ways in the same way that breaking…",
  "data/reddit-books/r/booksuggestions/comments/ocn769/nonfiction_books_about_disease_and_pandemics_of.json": "I'm currently reading Randy Shilts' book about the AIDS epidemic, which I'm\ngreatly enjoying and would like to read more about disease in the 20th century.\nThe big one would be any non-fiction book around the Spanish Flu, but any\ndisease or pandemic event will do (even another book about AIDS if…",
  "data/reddit-books/r/booksuggestions/comments/ocsu9r/books_about_dinosaursfor_adults.json": "Dinosaurs are cool. Any detailed, non-fiction books about dinosaurs that will\nmake me feel like a little boy again?",
  "data/reddit-books/r/booksuggestions/comments/ocw8yi/syrian_civil_war_book.json": "Hi,\n\nI'm thinking of buying a book that tells about this conflict as neutrally as\npossible or at least isn't biased towards the west too much. The book is going\nto be a gift and I would appreciate if it's price tag would be around 20-30€. I\ndon't want to make this political debate so, please keep…",
  "data/reddit-books/r/booksuggestions/comments/od2bxe/just_finished_orwells_1984_looking_for_something.json": "I also loved The Book Thief, Oliver Twist or Jules Verne‘s stories and Edgar\nAllen Poe‘s short stories.",
  "data/reddit-books/r/booksuggestions/comments/odgqru/japanese_literature.json": "I recently read two of Hiromi Kawakami's books and want to explore more\ncontemporary Japanese fiction. Please recommend any good ones you know of\n(except for Murakami, I've read most of his work already). Thank you!",
  "data/reddit-books/r/booksuggestions/comments/odje8l/books_similar_to_the_book_thief_by_markus_zusak.json": "I just loved the book and I cried my eyes out at the end… not looking to\nnecessarily replicate that last part, but still… so basically I’m looking for a\nshorter historical fiction novel with feels. Thanks…",
  "data/reddit-books/r/booksuggestions/comments/odku8s/what_to_read_when_you_feel_lost.json": "I feel lost in my life. I would like to have book suggestions to help me\nthrough. I'm 18F and wondering what to do with the rest of my life. I'm supposed\nto apply to schools in less than a year and I don't know what to do. I don't\nknow who I am, not sure if I ever have. I hope I could get…",
  "data/reddit-books/r/booksuggestions/comments/odyaia/a_smart_male_lead_and_a_strong_female_lead_with.json": "I've been trying to find a good read for this trope and have yet to come up with\nanything that suits my taste. I'd like for the male to be the 'brains' (hacker,\nstrategist... and the like) and the female to be the 'brawns', but not in a\nstrict sense (the male doesn't have to be completely useless in…",
  "data/reddit-books/r/booksuggestions/comments/oe73fn/books_to_read_when_youre_unemployed.json": "Suggest some books which depicts unemployment and it's drastic desperateness on\none's life, thinking, morality and the overall surroundings where one belongs. I\nhave gathered some titles to read:\n\n 1. Down and Out in Paris and London by Orwell\n 2. Hunger by Knut Hamsun\n 3. Of Human Bondage by…",
  "data/reddit-books/r/booksuggestions/comments/oe7c15/books_that_talk_about_being_lonely_and_doing.json": "I'm looking for a book that realistically talks about being comfortable staying\nlonely and doing stuff for yourself and not for others. A book that would talk\nas to how it's always you along the journey of life and it has to be led alone.\nI've enjoyed the subtle art of not giving a f**k by Mark…",
  "data/reddit-books/r/booksuggestions/comments/oekig3/books_that_feel_like_hugs.json": "I’m looking for “hug books”. For example Aristotle and Dante Discover the\nSecrets of the Universe of The House of the Cerulean Sea are some of mine. I’m\nlooking for more of these types of “homey hug books” that make you feel safe.\nThey don’t need to be the same as my previously mentioned books, just…",
  "data/reddit-books/r/booksuggestions/comments/oetv3d/best_stephen_king_book.json": "There's so many Stephen King books( he's one of those rare authors that are\nprolific but at same time seems to give each book energy and effort and books\ndon't come across as if they were just made overnight like some authors ). But I\nhaven't read so many of them and was wondering what is the best…",
  "data/reddit-books/r/booksuggestions/comments/oezdr3/i_want_a_book_where_you_actually_follow_the.json": "I’m tired of when people say things like “In Lies of Locke Lamora, you follow\nthe villain!” When in reality you follow an antihero at best. I want a book\nwhere you follow an ACTUAL villain, someone who only cares about themselves,\nsomeone who wants to take over the world just so they can say they…",
  "data/reddit-books/r/booksuggestions/comments/ofj250/an_enemiestolovers_trope_with_unique_or_uncommon.json": "I'm a sucker for romance books, especially enemies-to-lovers trope! I'm in dire\nneed of new books to read with this kind of trope, but with a different and\nrefreshing storyline. Thank you in advance for the recos!",
  "data/reddit-books/r/booksuggestions/comments/ofnx20/im_a_15_yr_old_and_im_trying_to_learn_nonfiction.json": "Any suggestions please? Currently I'm reading the bible and on my reading list\nis meditations by Marcus Aurelius, thus spoke Zarathustra by Nietzsche and\nsapiens: a history of humankind. I don't have a preference. As long as I can\nlearn from it and it's not too complicated it works for me. Thanks in…",
  "data/reddit-books/r/booksuggestions/comments/ofpnly/hey_everyone_im_about_to_publish_my_first_ever.json": "It's a hard sci-fi book about the first chaplain on mars. The book's coming out\nthis Wednesday, if you're at all interested you can find it on amazon. Thanks!",
  "data/reddit-books/r/booksuggestions/comments/ofx9gy/want_to_get_into_reading.json": "I haven't read many books but I'd like to get into more. The ones I have read\nand enjoyed are 1984, animal farm, Ishmael. Are there any similar to these that\naren't terribly long?",
  "data/reddit-books/r/booksuggestions/comments/og5a44/any_good_historical_fiction_i_should_check_out.json": "Currently finishing Dan Simmons \"The Terror\" (it's fantastic, can't put it down\nat all!). This book has really gotten me into the genre of historical fiction\nand I'd love to check out more, any books you'd recommend?",
  "data/reddit-books/r/booksuggestions/comments/ogac9b/erotica_thats_not_like_typical_erotica.json": "I hope this sub is okay with me asking about erotica.\n\nI was in a huge bookstore recently and checked out the erotica section out of\ncuriosity. But I noticed that most of the books there were, frankly, really bad.\nJust from skimming through them it was clear the writing wasn’t very mature and\nthe…",
  "data/reddit-books/r/booksuggestions/comments/ogif83/young_adult_fiction_books_about_a_character.json": "Looking for a book where the protagonist finds out that there's a secret magical\nworld, but instead of being awed or excited about it, they are horrified, want\nnothing to do with it, and keep getting drawn back into it anyway.\n\nYoung Adult Fiction preferred, but will take suggestions from outside…",
  "data/reddit-books/r/booksuggestions/comments/oglivb/books_similar_to_the_bell_jar_by_sylvia_plath.json": "A friend of mine has recently become enthusiastic about reading, and told me she\nliked “the bell jar” - can y’all recommend anything similar in tone?\n\nThanks!",
  "data/reddit-books/r/booksuggestions/comments/ogrzrg/books_like_sapiens_guns_germs_steel_but_for.json": "I just finished Sapiens and GGS. Loved the Depth and Historical macrotrends\nanalyzed in both the books.\n\nAre there any books which do the same but for Economics? Probably covering\nthings like history of money, economic systems, how rich countries became\nrich(covered in GGS)etc, ...",
  "data/reddit-books/r/booksuggestions/comments/ogzzun/which_john_green_book_should_i_get.json": "I'm just really getting into reading and I came across John Greens book. I'm 15\nyears old. I read the FIRST CHAPTER of 4 of the books, and I've already decided\non getting \"A Fault In Our Stars\" but I'm not very sure about the other three:-\n\nTurtles All The Way Down\n\nLooking For Alaska\n\nPaper…",
  "data/reddit-books/r/booksuggestions/comments/oh8mfe/books_to_help_feel_happy_with_being_single.json": "I haven’t gone through a recent breakup, but I’m just sick and tired of being\nsingle and alone. I want something to help me feel better about my situation,\nforce me to look at it in a more positive light. I want to be single and happy\nabout it.",
  "data/reddit-books/r/booksuggestions/comments/oh968w/asian_authors.json": "Any book suggestion written by an Asian writer. Contempo and Mystery thriller",
  "data/reddit-books/r/booksuggestions/comments/ohik28/what_book_recommendation_makes_you_tingle.json": "When I am recommending some books to people, some titles make me tingle/shiver\nas I relive the joy of reading them and anticipate someone else getting the same\nenjoyment.\n\nWhat are books that make you tingle as you recommend them to others?",
  "data/reddit-books/r/booksuggestions/comments/ohkazq/books_for_high_school_graduates_from_their_teacher.json": "Hi!\n\nI am looking for books that I can give to my class who will be graduating high\nschool (17-18yo). These students are wonderful people, so it doesn't need to be\nanything about changing their attitude - more about preparing them, helping with\ngrowing up, and providing them with hope.\n\nThe easier…",
  "data/reddit-books/r/booksuggestions/comments/ohsv29/books_for_people_who_want_to_be_writers_but_dont.json": "That would be me",
  "data/reddit-books/r/booksuggestions/comments/oi4dq6/tired_of_enemies_to_lovers_any_good_lovers_to.json": "Romance doesn’t need to be the foreground. Just a well-written book that has\ncharacters with that lovers to enemies trope that’ll make me sad, the sadder the\nbetter",
  "data/reddit-books/r/booksuggestions/comments/oiez6f/any_good_modern_military_fiction_that_isnt_about.json": "Don't really have anything to add here but I think i need to avoid being\ndeleted. Tried looking at this genre but it seems all I could find were books\nghost written by Ben Shapiro.",
  "data/reddit-books/r/booksuggestions/comments/oiqaim/self_help_books_that_actually_changed_your_life.json": "Looking for a book that will actually help change my way of thinking - I’m open\nto any topics. I struggle with anxiety/depression/poor self esteem, intrusive\nthoughts, I’m not great with money, whatever. Anything you read that had a\nlasting positive impact on your mental health or habits!\n\nEdit: non…",
  "data/reddit-books/r/booksuggestions/comments/oj04m9/suggest_a_book_that_you_read_that_was_so_bizarre.json": "a few months ago i read mona awad's bunny: a novel, and i still don't know wtf i\nread and when i was done i couldn't even rate it on goodreads because i had no\nidea what i just experienced. did i like it? maybe. did i hate it? totally\npossible. i honestly have no idea because my brain was a bowl of…",
  "data/reddit-books/r/booksuggestions/comments/oj76lv/just_finished_every_harry_potter_book_and_i_never.json": "I do not care if it’s fantasy or not (I’d almost prefer it not be fantasy). I\njust want another good book with characters that are just as good as in Harry\nPotter. I’m so sorry if this isn’t specific enough. My favorite part about Harry\nPotter was the characters and what they went through, the magic…",
  "data/reddit-books/r/booksuggestions/comments/ojf3ui/whats_the_most_disturbing_book_youve_ever_read.json": "I am in a very weird reading mood, as the question suggests. I would love to\nknow some books that have disturbed you so much, you still think about them some\ndays.",
  "data/reddit-books/r/booksuggestions/comments/ojj2um/scifi_that_doesnt_care_that_it_is_scifi_but_just.json": "Looking for sci-fi books that aren't too pretentious about world-building or the\nauthor flexing their physics knowledge. Hope this doesn't come off wrong, but\nthe last few books that I've read have included e.g. lists of physical constants\nor math theorems in them, and I just wanna relax, yaknow, in…",
  "data/reddit-books/r/booksuggestions/comments/ojyrf4/a_book_where_the_main_character_repeatedly.json": "Something like Ground Hog Day, Source Code, Edge of Tomorrow",
  "data/reddit-books/r/booksuggestions/comments/ok02pt/i_have_a_very_bad_habit_of_not_sticking_to_habits.json": "I have trouble sticking to things, for example, I will maybe go to the gym for\nlike a month then stop, a month passes and I’ll have motivation to go again, and\nI’ll stop, and the cycle continues. Same thing for other hobbies, the only real\nthing I do beside work is browse on my phone. Are there any…",
  "data/reddit-books/r/booksuggestions/comments/okazxr/should_i_read_sapiens.json": "I've had this book on my shelf for over a year and never got around to reading\nit because of all the glaring criticism is received from various aibreddits.\n\nI'm aware that a book which indents to condense human evolution into 500 pages\nwill contain errors but is it really that bad?",
  "data/reddit-books/r/booksuggestions/comments/okqi3e/scifi_xenoarcheology_books_with_dangerous_alien.json": "I m looking for books where humans found some long lost artifacts or technology\nor weapons(maybe millions or billions of years old) and uses it carelessly to\ntheir own advantage but wakes up a dangerous threat in the process. It could be\nanything like waking up an older dangerous civilization,…",
  "data/reddit-books/r/booksuggestions/comments/okvojl/a_nongot_fantasy_book_that_has_complex_characters.json": "Notes: - Doesn’t have to be grimdark. - I expect the characters to be impressive\nand skilled, but I want them to have tangible flaws. - Preferably not YA, but if\nit is, not excessively cheesy or cringey.",
  "data/reddit-books/r/booksuggestions/comments/olczwg/self_help_books_on_communications_and_social.json": "As pathetic as the title sounds, I have the worst communication and social\nskills. I have trouble asking questions, asking for help, bring up and\naddressing things that bother me, and just over all trouble translating thought\ninto words in a way that other people can understand.\n\nAre there any books…",
  "data/reddit-books/r/booksuggestions/comments/oldych/anyone_know_a_really_really_really_deep_book_with.json": "Anyone know a really, really, really deep book with some great quotes (could be\nabout life, the universe, reality etc) maybe some poetry, not exactly a novel\nbut like someone's outtake on life/their life? I just really want to know how\nothers perceive reality, and see life from someone else's…",
  "data/reddit-books/r/booksuggestions/comments/ololtq/might_have_cancer_and_need_a_good_distraction.json": "I found out I might have cancer. I have a tumor the size of banana slice in my\nthyroid. It has been driving me nuts because cancer killed my mother. I need a\ndistraction and can't decide on a book.\n\nI'm trying to find a new book or series to read and most suggestions on google\nare probably paid…",
  "data/reddit-books/r/booksuggestions/comments/om3dlf/im_19_just_rolled_into_university_and_im_feeling.json": "As the title says, I'm a young guy, that after rolling into university, doesn't\nknow what to do with his life. I'm looking for a book that would help me get a\ngood start in finding my purpose in life and maybe help me out with some mental\nhealth issues.\n\nJust to help you all out in what kind of…",
  "data/reddit-books/r/booksuggestions/comments/om8754/books_with_a_weird_night_on_the_town_vibe.json": "It's somewhat specific but a bit hard to describe.\n\nI'm looking for stories that evoke the feeling of wandering about a city at\nnight, not quite not knowing what you are looking for, and possibly having\nweird/interesting experiences. Doesn't need to be strictly in a city or at\nnight, but this is the…",
  "data/reddit-books/r/booksuggestions/comments/omjcyj/what_are_some_good_books_that_teach_you_about_art.json": "Recently I notice that \"asking questions\" itself is a very important skill. If\nyou ask the right question, you can extract any knowledge from any person. Is\nthere any book that talk about this topic?",
  "data/reddit-books/r/booksuggestions/comments/omu836/fiction_set_in_the_period_of_the_east_india.json": "I am looking for a fictional book about the colonial period of the East India\nCompany. Classics or historical fiction. Just craving for this setting / time\nperiod. Thank you in advance!",
  "data/reddit-books/r/booksuggestions/comments/omyh6b/avid_reader_as_a_child_havent_picked_up_a_book_in.json": "I used to read every day as a child and i really want to get back into the\nhobby. My genre seemed to be fantasy/sci-fi. Chronicles of Narnia, Harry Potter\nand hitchhikers guide to the galaxy are some notable favourites. I've tried\nreading game of thrones and can't stand the writing style I'm not…",
  "data/reddit-books/r/booksuggestions/comments/on4543/john_steinbeck.json": "Unfortunately, I didn’t appreciate classic literature in high school. Of Mice\nand Men is all I can remember. East of Eden fell on my lap. Any Steinbeck fans?",
  "data/reddit-books/r/booksuggestions/comments/onauxx/appreciation_post_for_taylor_jenkins_reid.json": "I am currently devouring my 3rd book from this wonderful author. I started at\nMalibu Rising, and then Evelyn Hugo, and now One True Loves.\n\nAs a reader who just picked up a regular reading habit just a few months ago, I\nappreciate finding something that captivates me chapter after chapter. She's…",
  "data/reddit-books/r/booksuggestions/comments/onjc8h/books_to_decolonize_my_moms_mind.json": "you read it right man\n\ni knew it was bad but yesterday she told my thirteen year old sister that ‘white\npeople are naturally just prettier than us desis and eritreans’\n\ni’m getting so tired of it\n\nshe’s desi and my dad is eritrean and honestly both of them need a book or two\nto help them understand…",
  "data/reddit-books/r/booksuggestions/comments/oo1yqy/fantasy_with_romance_pls.json": "I just finished reading Crescent City by Sarah J Maas. I've also previously read\nthe Shadowhunters books. For me this is kind of escapist leave my brain alone\nkind of reading vs the political hard scifi I normally read. So please recommend\nme your fantasy book where the girl gets the boy in a world…",
  "data/reddit-books/r/booksuggestions/comments/oog55s/fiction_books_with_main_character_having_ocd_and.json": "I would really like to read a fictional book with great representation of people\ndealing with mental illnesses such as OCD, Bipolar, Social Anxiety etc. Any\nsuggestions are welcome!",
  "data/reddit-books/r/booksuggestions/comments/oonn8f/books_that_will_destroy_me_ideologically.json": "I mean cynical books that will shatter the way I look at the world. In the same\nvein as 1984. Can be both fiction and non-fiction.\n\nI thought Decline of the West would be like this but the author brings in all\nkinds of other topics like maths and arts that muddles the effect. It's also a\nvery, very…",
  "data/reddit-books/r/booksuggestions/comments/oozttp/just_graduated_so_i_can_read_for_fun_now_where_do.json": "I’ve just finished a history degree so I though it might be worth trying to\nrekindle my childhood enjoyment of reading. I’ve enjoyed Pratchett, the Witcher\nshort stories and dabbled in Lovecraft. I imagine I’d like most things sci-fi &\nfantasy. I enjoy politics and history, I liked 1984 but I’m not…",
  "data/reddit-books/r/booksuggestions/comments/opf1k7/looking_for_a_book_that_feels_like_a_wes_anderson.json": "aggressively charming, visual, quirky, intentional.\n\nmy favorite of his films are the Grand Budapest Hotel and Moonrise Kingdom, if\nthat helps narrow things down at all :)",
  "data/reddit-books/r/booksuggestions/comments/opqrl4/real_life_of_pirates_during_the_golden_age_of.json": "Recommend me a historical book that recounts the life of pirates during the\ngolden age of piracy (1650-1750). This book could either follow the life of a\nsingle pirate or a number of famous pirates. What I’m ultimately after is a\ndetailed look at what life for these men was really like. I want to be…",
  "data/reddit-books/r/booksuggestions/comments/opu3r7/i_recently_finished_castlevania_and_now_this_is.json": "Rather than sexy vampires and great beast war, the thing that I loved the most\nabout Castlevania was Issac the forgemaster / Necromancer and his journey for\nself realisation, meeting strangers and finding what religion and revenge stands\nfor. Anything similar Vagabond like or necromancer revenge…",
  "data/reddit-books/r/booksuggestions/comments/oq0jhv/adult_fantasy_novels_without_any_romancesex.json": "I just want some cool worldbuilding and complex characters and storyline but\ndon’t want to have to read about the protagonists crush or any forced romantic\nsubplot. SO tired of having to skip over pages and pages of sex.\n\nBonus points if the main character(s) are female!",
  "data/reddit-books/r/booksuggestions/comments/oq516i/i_want_to_read_the_book_you_most_enjoyed.json": "The title sums it up decently, but I am looking for books that you enjoyed a\nlot, preferably your favorites.\n\nI don’t care what genre it is, I’ll read it all. Thanks in advance\n\nEdit: Thank you all for the recommendations :D",
  "data/reddit-books/r/booksuggestions/comments/oqjptx/looking_for_a_characters_transported_to_the_past.json": "I love books in which a character is transported into the past, future, or\nanother world or magical realm. I thought 1632 was Brilliant (A modern day\nAmerican small town is transported to the year 1632 in Europe). The\nUnincorporated Man was also a good read (21st century man is transported to…",
  "data/reddit-books/r/booksuggestions/comments/oqo1ar/looking_for_books_that_involve_gene_editing_that.json": "Or anything related to CRISPR* and gene editing, really. I don't have any\npreference yet.\n\nEDIT: A bit more like Klara and the sun!",
  "data/reddit-books/r/booksuggestions/comments/oqotg7/novels_where_the_protagonist_isnt_interested_in.json": "I'm looking for book suggestions where the main character is not interested in\nromantic relationships or doesn't want to marry and actually ends up not having\na romantic partner. It's okay if she tried to be in a relationship but then it\nfails and she realizes she's better on her own at the end of…",
  "data/reddit-books/r/booksuggestions/comments/oqoy8p/looking_for_adult_epic_fantasy_series.json": "I haven't read any fantasy series till now. I m looking for some\nrecommendations. I don't like young adult stuff. I want a few things in book 1.\nRelatable characters 2. Mysterious dangers 3. Sympathetic villains 4. More human\n5. Intelligence/schemes/plots 6. Adventure 7. Dark\n\nI liked the…",
  "data/reddit-books/r/booksuggestions/comments/or0yfi/looking_for_books_that_make_me_want_to_get_into.json": "I have never been a big reader but that is something I want to change. As a kid\nI would ask my librarian every day if a new magic treehouse book came in if I\nknew one had been released. When I was a little older I got into the 39 Clues\nseries and read all 10 of the first set. Book 1 was the first…",
  "data/reddit-books/r/booksuggestions/comments/orb4ie/a_book_that_feels_like_a_studio_ghibli_film.json": "By that, I mean a book that uses a whimsical world as the backdrop of a\nprotagonist’s journey. That sounds like it could describe a lot of books, but\nI’m specifically looking for books that convey a sense of childhood wonder, if\nthat makes sense lmao.",
  "data/reddit-books/r/booksuggestions/comments/orufva/japanese_mystery_novels.json": "Any recommendations? I know Keigo Higashino is famous for his mystery novels and\nwhich one u think is his best one or first book should read? Or any other\nauthors works for recommending? Thanks!!",
  "data/reddit-books/r/booksuggestions/comments/osa3rh/books_about_heists.json": "Books about heists with a likable or protagonist or crew, suggestions for non\nfiction are also tolerated. (Also thank you for answering after my many other\nrequests lol)",
  "data/reddit-books/r/booksuggestions/comments/osjlub/non_fiction_essentials_history_philosophy_science.json": "Edit: I would love some suggestions of female, POC and WOC authors, aswell as\nbooks (in English) from perspectives of other countries and cultures. Im after a\ndiverse reading list, not predominately european/American males.\n\nHi, I have never read non-fiction and I am coming to the realisation that I…",
  "data/reddit-books/r/booksuggestions/comments/osqira/are_the_percy_jackson_books_suitable_for_an_adult.json": "I’ve read that they’re for children but they do seem interesting. As an adult\nwould I enjoy them or would they be too childish? They look to be fantasy books\nand I like fantasy.\n\nHow many books are there and which ones do you recommend? Google says there are\n30 but that Percy is not the main…",
  "data/reddit-books/r/booksuggestions/comments/ot5y5l/have_a_habit_of_talking_too_much_and_cant_keep.json": "Have a habit of talking too much. Any books recommendations on stop talking more",
  "data/reddit-books/r/booksuggestions/comments/otdiy4/looking_for_books_that_can_help_with_anxiety.json": "Looking for books that can help with anxiety! Mostly for social anxiety",
  "data/reddit-books/r/booksuggestions/comments/otrxcc/looking_for_books_about_small_cozy_towns_flipped.json": "I am huge into slow burn crime dramas that focus on a small town and how a\nmurder or crime can change everything.\n\nTV shows with this exact vibe that I'm a huge fan of: Mare of Easttown, The\nKilling, Broadchurch, True Detective S1.\n\nI'm not so much interested in a gruesome murder mystery, but want…",
  "data/reddit-books/r/booksuggestions/comments/ou3kil/can_someone_recommend_a_non_fiction_book_that_is.json": "i have read Midnight in Chernobyl by Adam Higginbotham lately and i absolutely\ndevoured it. Can someone recommend a non fiction book that creates as much\ntension as a novel?\n\ni am interested in physics, cosmology, philosophy, artificial intelligence,\nhistory and this kind of stuff. But i am open for…",
  "data/reddit-books/r/booksuggestions/comments/ouaf54/book_club_for_witchy_btches.json": "Hi sweetlings!! I just wanted to let the community know that I’m hosting a\nwitchy book club that will begin on August 1st. I hope it’s ok that I’m sharing\nhere—I just feel like it would be great to have some members from the community\njoin in! It’s going to be largely self-paced, and very low…",
  "data/reddit-books/r/booksuggestions/comments/ouhe7v/just_finished_song_of_achilles_and_circe_both_by.json": "Is there any hope for me to find something quite like it. Edit 1: so y'all\nbelieve that I have no hope...",
  "data/reddit-books/r/booksuggestions/comments/ourjr4/looking_for_a_book_that_will_destroy_me_mentally.json": "I'm looking for a book, preferably horror or something similar, that will make\nme rethink my entire life. I want something that completely captivates me but\nalso makes me want to just lay down, stare at the ceiling and cry. Something\ndisturbing, heart breaking, and will stick with me forever. I'm…",
  "data/reddit-books/r/booksuggestions/comments/ourscc/looking_for_new_books_to_read.json": "Hi I'm Ciana I have autism and I love to read I'm looking for book suggestions I\nprefer fantasy, horror, thrillers, mystery, true crime, creepy folk lore I could\ngo on I also loved the book looking for Alaska it's a good read as well as paper\ntowns",
  "data/reddit-books/r/booksuggestions/comments/ov69yr/looking_for_a_book_that_feels_like_a_lonely_rainy.json": "I'm looking for a book that's beautiful, atmospheric, immersive, personal, and\nthat really makes you think. Beautiful prose, beautiful imagery, beautiful\nmonologues, beautiful narrator and characters. Something that just has those\nchapters and those passages that make you want to close the book,…"
}