{
  "data/reddit-stocks/r/Bogleheads/comments/r62o1s/got_lucky_now_what.json": "Hello bogleheads,\n\nI found this community randomly and been reading up everything for the last\ndays. Loving the tone and the attitude here.\n\nI was very lucky to work for two big companies and get large RSUs grants before\nthe stock went completely crazy.\n\nI now have ~500k in those two companies…",
  "data/reddit-stocks/r/Bogleheads/comments/r63vj3/new_boglehead_needs_advice.json": "I just started really paying attention to my finances and came across JL Collins\nbook. I’m 28, a disabled veteran, and work in tech. My only debt is a $25,000\ncar note. I gross around $100,000 through work and $17,000 via my Army/VA\npension (untaxed).\n\nI have been investing 15% of my income into my…",
  "data/reddit-stocks/r/Bogleheads/comments/r64i6s/ray_dalios_new_book_has_me_shook.json": "Have you read it? Thoughts?\n\nIt is well written, compelling and alarming.\n\nPer Dalio, the American Empire is beginning its decline phase in the world order\ncycle. Rising China, inflation, pandemic, debt and other declining markets - the\nnext five to ten years look scary.\n\nThe Boglehead philosophy…",
  "data/reddit-stocks/r/Bogleheads/comments/r661xx/what_is_your_preferred_allocation_of_usa_vti_to.json": "View Poll [https://www.reddit.com/poll/r661xx]",
  "data/reddit-stocks/r/Bogleheads/comments/r6lx95/set_up_a_brokerage_account_as_a_germanamerican.json": "Hi everyone,\n\nI hope this fits the rules of this sub. I'm 20M, have lived my whole life in\nGermany, and don't plan on moving to the States long-term. Nevertheless I would\nlike to keep my American citizenship.\n\nI've spent the past few months reading up a lot about investing and discovered\nthis…",
  "data/reddit-stocks/r/Bogleheads/comments/r6tk0m/near_retirement_600k_cash_sitting_around_whats.json": "One of my beloved aunts is close to retirement age (60), lives in a VLCOL\nlocation with a paid off house, a comfortable pension that covers her monthly\nspend and a 600k cash stash on the side (sits in international bonds with a joke\nfor a return of 2%)\n\n\n\nShe has access to excellent medical…",
  "data/reddit-stocks/r/Bogleheads/comments/r7aaka/i_just_invested_for_the_first_time.json": "Hi everyone, Thanks to this sub, I just maxed out my Roth IRA for the year (I’m\n21). This is the first time I’ve ever invested.\n\nBut I’ll be honest, I kick myself that I didn’t invest any money during my\ncollege & high school years. I missed out on a lot of time",
  "data/reddit-stocks/r/Bogleheads/comments/r7e8nf/commonly_mentioned_vanguard_funds.json": "I've been absorbing as much of the information on this thread as possible (and a\nhuge thank you to all of you). I'm not sure if something like this already\nexists (apologies if this is duplicative), but thought I'd contribute in my own\nlittle way if possible. Below is a list of the \"commonly…",
  "data/reddit-stocks/r/Bogleheads/comments/r7grmn/roth_why_would_one_fall_in_higher_tax_slab_on.json": "I am trying to understand the advantages of paying tax now (Roth) vs in\nretirement. Isn’t the whole point of 401k and Ira to be the main income in\nretirement? In that case, it should be pretty small amount than the salary one\nearns in their prime. And fall in lower slabs of tax .. am I missing…",
  "data/reddit-stocks/r/Bogleheads/comments/r7hiaf/in_the_simple_path_to_wealth_by_jl_collins_he.json": "This is generally my go-to book for financial guidance, but this is the only\npart of his philosophy that I'm unsure of, especially since I see plenty of\npeople here invested in funds like VT or VTWAX (total world stocks).\n\nFor those who have not read his book, quick summary:\n\n * For wealth…",
  "data/reddit-stocks/r/Bogleheads/comments/r7i21q/does_china_deserve_to_be_included_in_etf_with_how.json": "Hello\n\nHoping to start a discussion on wether or not countries like China should be\nincluded in VT when the market and companies are not subject to normal market\nforces but the communist party.\n\nYes, one could argue that EM is only 10% od VT and China is only 35% of EM but\nwhat if it was not? Would…",
  "data/reddit-stocks/r/Bogleheads/comments/r82hu7/can_compounded_returns_go_on_indefinitely.json": "There is a general belief among many investors that over the long term markets\nwill have some constant real return. Its actual return will fluctuate daily,\nmonthly, and yearly, but over the next 25, 50 or 75 years it will average around\nX%. Over the past century X has been somewhere between 7-8%…",
  "data/reddit-stocks/r/Bogleheads/comments/r82v92/convincing_a_friend_whos_risk_averse.json": "Hey so my friend told me most of their money is all in a checking account and i\ngasped.\n\nThey said they were really risk averse. How do i convince them they’re being\nsilly?\n\nI’ve personally internalized the boglehead ways and read the books but would\nlove some easy simple talking points/arguments…",
  "data/reddit-stocks/r/Bogleheads/comments/r847ut/days_like_today_make_me_wish_my_account_portfolio.json": "Like the title says, I wish ny account only had VT. Don’t get me wrong, my 401k\nhas VTI only (or a fund that mimics VTI idk which one it is) and I have a Schwab\naccount that I recently open and made the commitment to ONLY buy VT there with\nall my future deposits (about $2k/month) but my TD…",
  "data/reddit-stocks/r/Bogleheads/comments/r88hio/anyone_else_get_excited_when_indexes_dip.json": "I've been excited my retirement contributions will buy a little more these last\nfew weeks. All while the cash value of my portfolio has lost about 3-5%.\n\nThis sort of thing used to scare me.",
  "data/reddit-stocks/r/Bogleheads/comments/r8997o/today_is_a_great_day_to_be_a_boglehead.json": "Today is one of those great days where the market is down a few percentage\npoints (but up 20% YTD) and people in the r/stocks [/r/stocks] and r/investing\n[/r/investing] subreddits are losing their minds. They don't know what to do\nwith their PayPal or Gamestop or AMC stocks that are tanking, they…",
  "data/reddit-stocks/r/Bogleheads/comments/r8ga7m/when_im_asked_about_investing_my_boglehead_speak.json": "I'm in my late twenties and my friends are starting to talk more about\ninvestment. Recently, I've been asked if I'm investing. As a proud Boglehead I\ncan't help starting out with saying I follow the Boglehead investing strategy.\nI've already lost my friends right off the bat, so I add that by…",
  "data/reddit-stocks/r/Bogleheads/comments/r8pqcq/bonds_i_dont_get_them.json": "TLDR: Considering increasing bond holdings but wondering about 1. How bonds are\nexpected to perform right now, 2. Rebalancing and selling of bonds and, 3. Does\nthis all just come down to your emotional tolerance?\n\nBackground information: Upper 30’s y/o M, married, total in tax-advantaged\naccounts…",
  "data/reddit-stocks/r/Bogleheads/comments/r8tsrq/what_to_do_with_gifted_stocks_in_taxable_account.json": "41, married, 4 kids ages 8-14. Lifelong boglehead. 25% tax bracket. I ‘found’\nthe bogleheads years ago in my early 20’s and honestly haven’t really kept up\nwith the group because we’ve just been in ‘set it and forget it mode’ with our\nfinances in tax-advantaged accounts with zero regrets. We are on…",
  "data/reddit-stocks/r/Bogleheads/comments/r8zj16/would_i_be_making_a_mistake_by_holding_bonds_in.json": "TLDR/Intro; The last few days have made me re-evaluate my risk level. I'm 40 and\nwould like to keep the option of retiring or semi-retiring in about 5-10 years\nat most. So, I'm thinking about putting bonds in Taxable so I can draw them down\nafter my retirement at 45-50 till 60 when I'd be eligible…",
  "data/reddit-stocks/r/Bogleheads/comments/r93zuh/portfolio_allocation_tax_advantaged_vs_taxed.json": "Does this sub recommend similar portfolio allocations for both tax advantaged\nand taxed brokerage accounts? I have a target date 401k that I don't touch, a\nRoth IRA, and a taxable brokerage account.\n\nFor the Roth IRA, I do a lazy 3 fund (60/20/20 US Stock, Int'l Stock, US Bond).\nDo you recommend…",
  "data/reddit-stocks/r/Bogleheads/comments/r97mey/warren_buffett_book_summaries.json": "BUFFETTOLOGY/NEW BUFFETTOLOGY/THE ESSENTIAL BUFFETT/HOW TO PICK STOCKS LIKE\nWARREN BUFFETT\n\n * Buffett Indicator - single best indicator of where valuation are at any given\n   moment\n   * Total Market Cap/GDP as a %. Example – Wilshire 5000 20T/US GDP 20T = 100%\n * Warren practices a selective…",
  "data/reddit-stocks/r/Bogleheads/comments/r9kl6x/boglehead_smugness.json": "I'm not hating on the sub as a whole, but man some of you need to tone it down\nwith the smug comments. I believe in the general philosophy of this sub, but I\ncan easily see how a person who is very new to all this would be put off by some\nof the behaviour here.\n\nFor example, people talking about…",
  "data/reddit-stocks/r/Bogleheads/comments/r9mjxe/how_many_bogleheads_actually_stay_the_course.json": "Hey, thanks for having me.\n\nI'm a new, mid-20s investor who comes from a risk-averse upbringing. I've put\n$10k in to Series I-bonds and around $7k into 70/30 US/international index funds\n(VOO/VXUS, and the Fidelity ZERO funds). I have another $7k in an HYSA while the\nI-bonds are locked away until…",
  "data/reddit-stocks/r/Bogleheads/comments/r9plwq/the_bogleheads_advisory_boards_position_on.json": "\"It is my and the Advisory Board's feeling that the cryptocurrency market as\ncurrently constituted is extraordinarily risky and should not play a significant\nrole in a prudent investor's portfolio. The risks go far beyond what we are used\nto dealing with in regulated market securities. like…",
  "data/reddit-stocks/r/Bogleheads/comments/r9tb2t/new_research_we_evaluate_the_performance_of.json": "\"We further show that the outperformance of AI funds is attributable to their\nlower transaction cost, superior stock-picking capability, and reduced\nbehavioral biases.\"\n\nSo even with reduced bias, better stock picking, and lower transaction costs, AI\nmutual funds still don't beat the market index.…",
  "data/reddit-stocks/r/Bogleheads/comments/ra1z18/vti_vs_vt_in_your_20s.json": "Hey Bogleheads,\n\nI am currently 100% VT and am in my early 20’s.\n\nI am wondering if this should be my strategy given my ability to ride out any\nlong downturns.\n\nIs it reasonable to assume that all US will outperform international over the\nlong term? If so should I reallocate to 100% VTI?\n\nI am also…",
  "data/reddit-stocks/r/Bogleheads/comments/ra9lm2/please_convince_me_why_i_should_not_care_about.json": "Hi guys,\n\nI'm a big fan of the Boglehead strategy which I've been following for some years\nalready.\n\nI'm finding it difficult to find arguments why investing in an All World\nVanguard ETF is a good idea, given:\n\n 1. High (future) inflation.\n 2. Low (expected) returns in the future due to the massive…",
  "data/reddit-stocks/r/Bogleheads/comments/rab6ps/how_can_i_fix_my_sht_porfolio.json": "I am new to the whole Bogleheads lifestyle but the more I read, the more I\nrealize I am a complete idiot. I've been investing way too much in ARK and\nindividual stocks. I would love some advice on fixing my portfolio and investing\nin VT, VTI, etc. etc.\n\nI'm a 26-year-old male, married, save about…",
  "data/reddit-stocks/r/Bogleheads/comments/raf2ld/long_time_bogleheads_has_there_always_been_talks.json": "I have started indexing couple months ago but I have been following financial\nnews for some time. It feels like everyone is always talking about imminent\ncrash, has it always been like that?\n\nEDIT: my english is poor",
  "data/reddit-stocks/r/Bogleheads/comments/rai4rs/does_this_seem_like_a_decent_portfolio_split_for.json": "60% global stock index fund\n\n30% real estate (personal home)\n\n10% bonds/cash",
  "data/reddit-stocks/r/Bogleheads/comments/raimpo/i_feel_very_odd_not_caring_about_market.json": "It’s always “buy low sell high”, watching the past month and how it’s “the big\ncrash” with everyone panic selling and other subreddits posting major loss porn.\nI feel so strangely at ease, I feel like I should be worried about my portfolio,\nthen I have to remind myself that my timeline is the next…",
  "data/reddit-stocks/r/Bogleheads/comments/ran4by/best_financial_news_source_beside_wsjnyt.json": "What's up guys. Love the content that you post here. I've been a long time\nreader for a while now.\n\nJust wanted to know - where do you guys get your news from? I like the WSJ but\nit doesn't update enough throughout the day. What would be your second news\nsource? FT? or your local newspaper?",
  "data/reddit-stocks/r/Bogleheads/comments/raogkh/adding_roth_money_to_my_401k_vs_putting_money_in.json": "So I'm looking at how much I was able to invest this year:\n\n 1. Maxed my 401k, all traditional - 30% from me + 4% match\n 2. Maxed Roth IRA\n 3. Contributed $10k to taxable\n\nMy expenses should be around the same next year so I'm hoping to save just as\nmuch. My 401k allows Roth and after-tax…",
  "data/reddit-stocks/r/Bogleheads/comments/rar349/should_i_diversify_into_bonds.json": "I'm 41 years old and 100% invested in VTSAX.\n\nI'm wondering if I should consider moving 25% to VBTLX as a diversification /\nhedge.\n\nI know there will be suggestions to invest in a Vanguard global fund, but I\nbelieve VTSAX provides me enough international coverage. My question is more\nabout bonds to…",
  "data/reddit-stocks/r/Bogleheads/comments/rasfdm/nassim_taleb_fooled_by_randomness_the_black_swan.json": "Nassim Taleb\n\n\nFOOLED BY RANDOMNESS\n\n * Survivorship Bias means you don't hear from the losers on a topic, you only\n   hear from the winners.\n   * Watch out judging a person by their results because history will only show\n     you the winners. You won't hear the stories of the losers\n * Over short…",
  "data/reddit-stocks/r/Bogleheads/comments/ray9wk/european_investor_is_vwce_enough.json": "As a European, I've been investing in vwce every single month for almost a year\nnow. I'm planning on continuing doing so for the next couple of decades. Is this\na sensible investing strategy or would it be wise to add more ETFs to my\nportfolio?",
  "data/reddit-stocks/r/Bogleheads/comments/raz0ls/peter_lynch_says_allin_on_passive_investing_is.json": "My gut says Peter Lynch's statement about the 3 funds is wrong but I haven't\nresearched it yet.\n\n“Our active guys have beat the market for 10, 20, 30 years, and I think they’ll\nkeep on doing it.\n\nAs proof, he cited three current Fidelity managers: Steve Wymer of the Growth\nCompany fund, Will Danoff…",
  "data/reddit-stocks/r/Bogleheads/comments/rb2men/vtsax_has_a_75_transaction_fee_does_this_make_it.json": "I have read that VTSAX is the King of total US market index funds. With the\nquarterly dividends and large amount of assets and stocks in the portfolio,\nwhat's not to love? But there appears to be a minimum of $2,500 to invest and a\n$75 transaction fee. Does this mean I have to invest at least…",
  "data/reddit-stocks/r/Bogleheads/comments/rb9pi1/currently_have_everything_in_vtivx_retirement.json": "I didn't have a bad year, but on paper it looks like I'm getting about 7% in my\nRoth IRA returns. On the website it has YTD at 17%, 3yr at 15 and 5yr 13, and 10\nat 11 with an overall 8.3% return.\n\nI know this should be good. But I feel like it might not be the best spot for my\nmoney anymore. Anyone…",
  "data/reddit-stocks/r/Bogleheads/comments/rbcv1y/poll_age_of_investor_bogleheads_on_this_forum.json": "How old are the investors on this forum?\n\nView Poll [https://www.reddit.com/poll/rbcv1y]",
  "data/reddit-stocks/r/Bogleheads/comments/rbgrhf/why_the_love_for_small_value.json": "I see a lot of people recommending small value index, and I cant seem to figure\nout why.\n\nOver the past 20 years, even when factoring in small amounts annual\ncontributions, a backtest portfolio shows small growth outperforms.\n\nIm personally in the general small index itself so I lean neither way...…",
  "data/reddit-stocks/r/Bogleheads/comments/rbsf48/at_the_end_of_the_year_what_do_you_do_with_your.json": "I am defining excess in this situation as post-tax dollars that are not your\nworking liquid moneys, emergency fund, or already contributed retirement moneys.\nAssuming roth IRA/traditional IRA limit has already been met.\n\nUse (or keep) them in a non-tax-advantaged brokerage? Move them into a…",
  "data/reddit-stocks/r/Bogleheads/comments/rbwev0/how_do_i_allocate_my_2021_roth_ira_contribution.json": "Cross posting from r/personalfinance [/r/personalfinance], someone recommend I\npost here. Never heard of this sub before, will continue to take a look at it.\n\nLooking for advice on how to allocate my Roth IRA contribution for 2021 (and\n2022).\n\nI originally invested 60% into VTI, 40% in VXUS.\n\nThe…",
  "data/reddit-stocks/r/Bogleheads/comments/rc0beb/is_there_a_single_etf_that_combines_all_three.json": "I'm really lazy.\n\nI guess ideally there would be three or more of them with different portfolio\nmixes for stages of life.",
  "data/reddit-stocks/r/Bogleheads/comments/rc5ldr/any_reason_to_buy_ibonds_other_than_emergency_fund.json": "I-bonds are very popular on Bogleheads and for good reason. So I bought them for\nmy emergency fund.\n\nI have enough for my emergency fund now. Should I be buying more I-bonds for any\nother reason?",
  "data/reddit-stocks/r/Bogleheads/comments/rc7qme/19_years_old_just_maxed_out_my_roth_ira_for_the.json": "I'd like to thank everyone that took time to answer my questions about\nbrokerages, funds and retirement accounts. You all help simplified this process\nand I truly appreciate it. Dumped 6,000 dollars into my Roth IRA- I can't wait\nto do it again in the New Year!",
  "data/reddit-stocks/r/Bogleheads/comments/rc9yyq/are_there_any_bad_index_funds.json": "Back again with another silly little question from a beginner. I love how\ndiverse index funds are and the stability that brings. With that being said, are\nthere any to avoid?",
  "data/reddit-stocks/r/Bogleheads/comments/rcm5w7/do_inflationprotected_bond_funds_actually_keep_up.json": "If yes, then I don’t understand how this fund gained only 2% this year and the\nyield is -1.91%?\n\nVanguard Inflation-Protected Securities Fund Investor Shares (VIPSX)\nhttps://investor.vanguard.com/mutual-funds/profile/VIPSX\n\nThe short term one is even worse. Gaining 2.21% but yield is -2.99%…",
  "data/reddit-stocks/r/Bogleheads/comments/rcnh1e/over_indexing_and_break_points.json": "I am a follower of the Bogleheads strategy if a rather unsophisticated one. I\nbelieve the evidence is solid but it also matches my biases. It made me want to\nexamine the strategy more critically.\n\nAs members of the community, have you encountered arguments that changed your\nmind or made you update…",
  "data/reddit-stocks/r/Bogleheads/comments/rcw28q/trading_within_a_roth_401k.json": "New Boglehead here. What are the rules and tax implications around trading\nwithin a Roth 401k? Was originally invested in a targeted date fun but the\nexpense ratio is higher than I’d like. Can I sell within this fund and buy index\nfunds in a more Boglehead approved portfolio? What are things I…",
  "data/reddit-stocks/r/Bogleheads/comments/rcy584/i_bonds.json": "I’m currently building a bond allocation through I bonds. If I buy 10k worth of\nI bonds today, can I buy 10k in January 2022? Or would I have to wait 1 year\nuntil December 2022 to buy the next 10k?",
  "data/reddit-stocks/r/Bogleheads/comments/rcypd4/where_should_i_put_money_im_saving_for_a_house.json": "Right now I’m doing mostly a HYSA and then trying to max out I-Bonds.\n\nIs that the best way to go? Ideally I wish I didn’t have to pump it all into an\nHYSA since yields are so terrible, but what can you do.\n\nThanks!",
  "data/reddit-stocks/r/Bogleheads/comments/rcznfi/current_sp_500_pe_is_very_high.json": "I know the theme of Bogleheads is to not try to time the market. But, in John\nBogle’s most recent edition of “The Little Book of Common Sense Investing”,\npublished in 2017, the P/E was roughly 24, which he considered high at the time\nand predicted that it would go down over the next 7 years.…",
  "data/reddit-stocks/r/Bogleheads/comments/rd13eu/im_38_and_legally_depositing_150000_into.json": "Hi. I'm 38. My wife and I make respectable incomes but less than $100k each. We\nused to make a lot more (more on that later), but we've scaled back to part-time\nconsulting in order to spend more time with children.\n\nThis year alone, we are contributing $150,000 to 401k, IRA, HSA, and 529\n(college…",
  "data/reddit-stocks/r/Bogleheads/comments/rd7o4q/start_accruing_ibonds_now_still_have_mortgage_etc.json": "Late 30s and doing the right tax advantaged investing (403b, 457, rIRA, 529s, no\nHSA but great health ins) - should I start buying I-bonds now (yes the shiny\n7.12% APY prompted this thought) and hold long-term to start accruing the TIPS\nportion of bond allocation in the future? E.g. if I start now…",
  "data/reddit-stocks/r/Bogleheads/comments/rddnr4/100_stocks_vs_human_nature.json": "> “Short-term risk, occurring over periods of less than several years, is what\n> we feel in our guts as we follow the market from day to day, and month to\n> month. It is what gives investors sleepless nights. More importantly, it is\n> what causes investors to bail out of stocks after a bad run,…",
  "data/reddit-stocks/r/Bogleheads/comments/rdmwpm/250k_58_yo.json": "Simple, just inherited 250k that we don't \"need\", no debt, 58 year old working\nfull time with great job/benefits and cash. where would you put it and why?",
  "data/reddit-stocks/r/Bogleheads/comments/rdmy6v/i_think_ive_been_using_bonds_wrong.json": "I’m not a noob, but feels like it as I’ve been reading and revaluating prior\nthought/approaches.\n\nI’m not against bonds, but I think I’ve been using them wrong, or not at all the\nmore I’ve read the last 6 months.\n\n 1. A reason to have bonds during accumulation is to be able to sell your bonds\n   …",
  "data/reddit-stocks/r/Bogleheads/comments/rdmycm/planning_for_possible_backdoor_roth_elimination.json": "So as many of you know, the current \"Build Back Better\" bill has provisions to\neliminate the Backdoor Roth. Obviously one never knows what is actually going to\nget passed, or when. But let's assume for a second that it both gets passed and\nthat it does eliminate this provision.\n\nI also am skeptical…",
  "data/reddit-stocks/r/Bogleheads/comments/rdypzn/50_vt_50_vti.json": "34 y/o married with a 1 y/o. Household income is ~200,000 per year. 300K in\nequities currently. Is a 50% VT / 50% VTI my best strategy? Only have debt in a\nmortgage. Im OK with a decent amount of risk at this point. Thanks for your\ninput!",
  "data/reddit-stocks/r/Bogleheads/comments/re1sl2/bought_my_first_iseries_bond.json": "Yesterday was a big day for me. I purchased my first bond. At over 7%, it seemed\nlike a no-brainer. So far, all of my investments have been purely S&P 500 or\nVTSAX/VTI since 2016. I'll be purchasing another one in January. I'm not sure\nhow long interest rates will remain high, but it is better than…",
  "data/reddit-stocks/r/Bogleheads/comments/re5ixe/roth_401k.json": "Given all the discussion around the potential elimination of the backdoor Roth,\nI’m surprised that I haven’t seen much conversation around Roth 401ks.\n\nMany employer 401k plans offer a Roth 401 which allows after-tax contributions\nup to the 401k max ($20,500 for 2022).\n\nIf the back door Roth is…",
  "data/reddit-stocks/r/Bogleheads/comments/re7nam/vanguard_piloting_fractional_etf_purchases.json": "I have to admit I did not think they had it in them. It’s only for their own\nETFs, but it’s a start.\n\nhttps://www.bogleheads.org/forum/viewtopic.php?f=10&t=363700&p=6370581#p6370581",
  "data/reddit-stocks/r/Bogleheads/comments/recrdx/how_to_valuate_employer_401k_match.json": "I'm currently considering switching from my current employer to another one who\nwill pay more.\n\nOne nice perk of my current employer is that they contribute 10k to my 401k each\nyear. The new employer, on the other hand, has a 401k plan but doesn't make any\ncontributions to it.\n\nHow would you…",
  "data/reddit-stocks/r/Bogleheads/comments/reeqja/how_are_dividends_in_index_funds_figured_out.json": "I’m in the VT and chill camp and I’ve been wondering how the quarterly dividend\nis figured out. Having most of the worlds main companies in it, is it just an\naverage of the dividend paid out by the companies in the index or am I way off\non that?\n\nThanks for the help!",
  "data/reddit-stocks/r/Bogleheads/comments/refiqw/am_i_wrong.json": "Roth 100% VTSAX.\n\nBut My employer 401k has two indexes : BSPIX and VTIAX. I decided to go 100% in\nVTIAX. Between full employer match and my contributions I am at ~15k on the\nyear.\n\nIs it stupid to go 100 on VTIAX?",
  "data/reddit-stocks/r/Bogleheads/comments/renmvx/invest_now_or_later.json": "I currently have around $6k that I want to invest. I maxed my Roth IRA, so I\nwould be opening a new non-retirement investment account (don’t have access to\n401(k)/TSP right now because I am at a service academy). Should I keep it in my\nsavings until I can max my Roth IRA next year, or should I open…",
  "data/reddit-stocks/r/Bogleheads/comments/rer51l/realistic_rate_of_future_returns.json": "New to investing and trying to map out a plan. We met with a fee-based advisor\nwho entered all our goals and info into eMoney and the resulting retirement\nanalysis wasn’t very good. And then I asked him what rate of return his analysis\nwas using and he said he was running the sim assuming 9%. That…",
  "data/reddit-stocks/r/Bogleheads/comments/reu0kb/the_new_vanguard_app_is_not_as_good_as_the.json": "To make this Bogle related. I met him once while I worked at VG during the Y2K\nfrenzy. I was walking out of Audacious one evening about 6-7 pm and I was making\nmy way to the parking structure. I changed my direction to take a look at a\nbrand new mustang gt parked near by the few parking spots near…",
  "data/reddit-stocks/r/Bogleheads/comments/rexj3g/how_do_i_not_get_too_aggressive_attempting_to.json": "I’m 38, married, and $192k household income. I’m just getting started but I feel\nlike I need to be extra aggressive in my investing to catch up to where I need\nto be.\n\nMy plan for 2022 is to max out my spouse and my Roth IRAs and max out my 401k.\nOur only debt is student loans and auto ($30k…",
  "data/reddit-stocks/r/Bogleheads/comments/rf8chg/bond_allocation_muni_bonds_in_taxable_vs_ee_bonds.json": "Hey everyone. I'm 30 years from retirement with a moderate risk tolerance. I'm\ncurrently holding 100% stocks (70% VTI / 30% VXUS) in a Roth IRA (contributing\n$500 per month) and 401k (contributing $1,000 per month). I have $20,000 in I\nbonds as an emergency fund replacement and will likely be…",
  "data/reddit-stocks/r/Bogleheads/comments/rfc7ik/sorry_if_this_is_a_really_stupid_question_does.json": "I always thought that when we talk about an ETF gaining 6% in a year, that 6% is\nadded to it's value from a year ago. If it makes another 7% this year it'll be\nmaking 7% on the 106% (oversimplified but I hope that makes sense) Is this\nfunctionally different from a compounding interest? I keep…",
  "data/reddit-stocks/r/Bogleheads/comments/rfggo0/performance_of_etfs_that_reinvest_dividends.json": "I was wondering if there would be a major performance difference between ETFs\nthat automatically reinvest dividends versus ETFs that pay out dividends during\na market crash. What I want to understand is whether one would lose more value\nover the other one? If so why?",
  "data/reddit-stocks/r/Bogleheads/comments/rfhb1z/all_eggs_in_one_basket.json": "I see folks using Vanguard as a broker to purchase a couple of Vanguard ETFs,\nand that’s it. All their life savings through a single company for many decades.\n\nWouldn’t it be wiser to have multiple ETFs from multiple companies purchased\nthrough multiple brokers in multiple countries?",
  "data/reddit-stocks/r/Bogleheads/comments/rflx1d/is_lost_decade_actually_good_for_people_in.json": "I think many people would agree that we’ll see lower returns in the next decade\nor so. Some even speculate a 0% growth for the overall equity market. At first I\nwas discouraged since it seemed as though I started investing at the wrong time\nand that I may have to work even harder to achieve my…",
  "data/reddit-stocks/r/Bogleheads/comments/rfp9j4/had_it_with_internationals.json": "Title says it all. I am always 65% us and 35% international. My internationals\nare the definition of underperform.\n\nIs my frustration a sign that the reversal is coming? Or is it just a reminder\nto not look at my portfolio and know that markets can remain in a certain way\nfor a long time ?",
  "data/reddit-stocks/r/Bogleheads/comments/rfrzdb/no_income_for_a_year_and_stock_is_in_a_taxable.json": "I bought some VTI in Robinhood about 10 months ago. Since it's not in a tax\noptimized place I was thinking about moving it elsewhere, preferably to a Roth\nIRA when I have one.\n\nDue to a temporary circumstance, I haven't had an income for over a year. I have\nread that selling stocks in low-income…",
  "data/reddit-stocks/r/Bogleheads/comments/rfufu5/my_401k_is_100_in_a_t_rowe_price_target.json": "Currently my 401k is 100% in the T. Rowe Price Target 2050 Fund (TRFOX). Expense\nratio is 0.62%. I’m trying to figure out what to do between the following\noptions:\n\nOption 1 - Leave 100% in TRFOX so I don’t have to touch or think about it until\nI retire\n\nOption 2 - Leave current investment in…",
  "data/reddit-stocks/r/Bogleheads/comments/rfwx58/a_modest_proposal_to_resolve_the_us_vs_exus.json": "A frequent question that comes up often in this subreddit is, \"The US has\ntrounced Ex-US for the past decade. Why do I need to even bother investing\ninternationally?\" With this post, I'd like to propose an answer to this question\n-- and to avoid having to repeat myself in comments.\n\nMy main issue…",
  "data/reddit-stocks/r/Bogleheads/comments/rg67ra/planning_for_a_large_expense_in_6_months_sell.json": "I need to take money out of my taxable investment account (Bogle style\npositions) to pay for a planned expense in 6 months. What would you guys\nrecommend as the wise thing to do?\n\nI could sell now and just keep the money in a savings account for 6 months. But\nI don’t feel good about keeping cash…",
  "data/reddit-stocks/r/Bogleheads/comments/rg74fm/us_political_instability_and_long_term_investing.json": "Often our advice is to buy the haystack but the number of haystacks you own just\nmakes it worse when lightning strikes and the barn burns down. Mangled metaphor\naside the main question I wanted to pose to my fellow Bogleheads is how do you\nview existential risks to your portfolio?\n\nFor example, if…",
  "data/reddit-stocks/r/Bogleheads/comments/rg9h0r/i_bonds_in_taxable_account.json": "Here is a simple question that likely belies my ignorance:\n\nOn the Bogleheads Wiki about I Bonds, they talk about why you should hold them\nin a \"taxable\" account. I guess I'm confused because....isn't that the only\noption?\n\nI thought that you have to purchase them through Treasury Direct by…",
  "data/reddit-stocks/r/Bogleheads/comments/rgdzol/rolling_over_401k_that_has_traditional_roth.json": "Title basically says it all. I am trying to rollover a 401k from a former\nemployer into an IRA. I made traditional and Roth contributions to that 401k.\nCurrently, I only have a Roth IRA. Will I need to create a traditional IRA as\nwell for those traditional 401k contributions?\n\nAnd since I made the…",
  "data/reddit-stocks/r/Bogleheads/comments/rgmmwb/bogleheads_adjacent_has_vanguard_lost_its_way.json": "https://www.morningstar.com/articles/1071801/has-vanguard-lost-its-way",
  "data/reddit-stocks/r/Bogleheads/comments/rgzgih/met_with_subrecommended_feeonly_advisor_yesterday.json": "Y’all have helped me so much in the past. One of you lovely folks recommended\nRichard Ferri as an advisor. He’s booked way out but I met with his protege Jon\nLuskin. I got lots of good info on everything from insurance to estate planning\nto investments.\n\nI’m 47 and plan to retire at 55. $1M net…",
  "data/reddit-stocks/r/Bogleheads/comments/rh73hg/is_my_vtsaxvtiaxvbtlx_3fund_portfolio_too_safe.json": "About a year and a half ago I started a self-managed 3-fund portfolio on\nVanguard, I automated weekly investments of 54% VTSAX, 36% VTIAX, and 10% VBTLX.\nI set it and left it alone, and I thought that this was a smart investment\nstrategy.\n\nHowever, checking into my account today, I'm seeing that…",
  "data/reddit-stocks/r/Bogleheads/comments/rhdnr6/aside_from_vti_and_vxus_does_anyone_uses.json": "Wondering if anyone here uses any different ETFs aside from VTI and VXUS?\n\nTotal US Stock Market ETFs options:\n\nITOT (by Blackrock) SCHB (by Schwab)\n\nInternational Equity ETFs options:\n\nIXUS (by Blackrock) SCHF (by Schwab)\n\nEdit: and if you do, why?",
  "data/reddit-stocks/r/Bogleheads/comments/rhej7i/have_you_ever_felt_trying_to_market_timing.json": "It looks like it's very easy \"Buy and hold\"\nIt is just second year of my investing journey.\n\nI started investing after corona. So I don't know how I will feel when I face\nthat situation.\n\nHow do you guys just keep holding your portfolio?\n\nI know passive investing is easiest way but we might feel…",
  "data/reddit-stocks/r/Bogleheads/comments/rhg8lx/the_underappreciated_argument_for_choosing_roth.json": "This applies primarily to married couples. Quite simply, the reason is death,\nand the extremely high likelihood that one of you will die many tax years before\nthe other, probably amidst RMD distributions.\n\nThe typical rationale for choosing traditional is the assumption that most\npeople are…",
  "data/reddit-stocks/r/Bogleheads/comments/rhouec/are_us_and_international_markets_really_decoupled.json": "Anyone notice that both US and international indices ran down this week in\nanticipation of the fed meeting, then both bounce back up as a result?\n\nIf the fed meeting was seen as representing an issue with the US economy,\nshouldn’t that result in a divergence and not a parallel of the two?",
  "data/reddit-stocks/r/Bogleheads/comments/rhuzk1/the_journey_commences_i_started_a_roth_ira.json": "I’m so happy I found this sub. I’m 27 and deposited the max Roth contribution\namount with Fidelity. Looking at a 85/15 FZROX and FZILX to start the ball\nrolling. I’d appreciate any suggestions. Thank you.",
  "data/reddit-stocks/r/Bogleheads/comments/rhxbgu/psa_we_are_average_on_average.json": "I see a growing number of Bogleheads on this sub and bogleheads forum taking too\nmuch risk with their portfolios. While there might be genuine reasons to do so,\nlet's not fool ourselves into believing that we are fundamentally different from\nfolks who were investing 10, 20 or 30 years ago.\n\nWhen we…",
  "data/reddit-stocks/r/Bogleheads/comments/rhxlv6/i_want_to_thank_you_all.json": "My wife and I (27 and 29 years old) were able to implement the final step of our\nbaseline savings (for the next few years at least) in our set and forget\nadventure towards retirement! The conversations and questions here have been\nextremely informative for me and have very likely lead to us being…",
  "data/reddit-stocks/r/Bogleheads/comments/ri0scj/ee_bonds_double_after_20_years_can_someone.json": "If the rate (.10% annually) is so low and you have to wait 20 years to get the\nmore attractive doubling (roughly 3.5% annually) then what would be a benefit to\naccepting this loss of real value until 20 years pass and then most likely\nbreaking even with inflation (if we’re lucky)?\n\nWouldn’t it make…",
  "data/reddit-stocks/r/Bogleheads/comments/ri4sbm/took_the_leap_of_faith_and_went_all_in_on_index.json": "Last week saw my individual stocks portfolio gains slashed by half because of\nsome heavy losses on stocks I'd done some fundamental analysis on for the long\nterms.\n\nI don't make a lot of money as a 25 year old, but I liquidated all of my 5k from\nmy stocks and have arrived at a\n\n51% VTI, 13% VXUS,…",
  "data/reddit-stocks/r/Bogleheads/comments/rik8ex/with_federal_student_loan_repayment_starting_in.json": "TL;DR: Wife and I have been hoarding cash during pandemic waiting for\nBiden/Congress to do something on student loans. Well, D-Day (01/31/2022) is\nfast approaching and nothing is happening, so it's about go-time to make a\ndecision. Do I just pay these off and move on with life or refinance,…",
  "data/reddit-stocks/r/Bogleheads/comments/riqaho/ready_to_go_100_boglehead_and_seeking_advice.json": "I am 31 and I have been working in the US since 2018 with a work visa. I have\nbeen saving my money in an investment account since I have no idea where to\ninvest. While my immigration process is moving forward, there is still\nuncertainty in my future (anything beyond ~3 years is pretty much…",
  "data/reddit-stocks/r/Bogleheads/comments/riulem/the_forum_is_watching.json": "The bogleheads.org forum is aware of our existence due to the upcoming Reddit\nIPO. Everyone be on your best behavior. Everyone with global market weights up\nfront, preferably those with significant bond holdings as that community skews\nolder and more risk averse. Those holding crypto and individual…",
  "data/reddit-stocks/r/Bogleheads/comments/riytwj/for_a_30_year_old_what_do_you_think_about_just.json": "Or would this be too risky because the market could tank?",
  "data/reddit-stocks/r/Bogleheads/comments/rj9leu/trustworthiness_of_vanguard_fidelity_and_schwab.json": "Looking at mostly only index target retirement date funds I see that Vanguard is\nminimally more expensive than the other two big brokers. I have stuff like my\nmoney and Vanguard with the reasoning that if I die Vanguard will not try to\nupsell my wife. Does anyone have similar reasoning or have…",
  "data/reddit-stocks/r/Bogleheads/comments/rjbzeo/questions_or_concerns_about_international.json": "Someone asked me for some book recommendations on the subject, so I took it a\nlittle further and listed out a number of ther resources as well. The order is\nmore or less shortest to longest (or: briefest to most in-depth).\n\n * Article: Summarizing the Case for International Stocks\n  …",
  "data/reddit-stocks/r/Bogleheads/comments/rjdq1r/vtsaxvtiax_versus_vtwax_in_taxable_accounts.json": "Trying to decide what to do going forward. Was ready to set up the traditional\nVTSAX plus VTIAX accounts but then started thinking if it’s equivalent to just\ngetting VTWAX. It is for taxable accounts. Thanks.",
  "data/reddit-stocks/r/Bogleheads/comments/rjeoo4/is_there_anything_more_to_rbogleheads.json": "I am totally sold on the Boglehead philosophy. I'd been investing in index fund\nfor few years; but since joining Bogleheads sub this year, I've become a\nconsistent investor dropping my savings on VTI and VXUS every month (I've a\nlittle play money on stocks, but that's beside the point). I no more…",
  "data/reddit-stocks/r/Bogleheads/comments/rjgoml/how_should_i_handle_bonds.json": "I’m 27, and have a Rollover IRA with Fidelity. When I first signed up with\nFidelity I really wanted something that was set it and forget it, and so I opted\nfor a Freedom Index Target Date Fund.\n\nI’m contemplating switching my portfolio to be a Boglehead 3 Fund, (Total US\nMarket, Total…",
  "data/reddit-stocks/r/Bogleheads/comments/rjikys/at_what_age_will_you_die.json": "Morbid, but I work in a field where I question it more than most . Generally, if\nyou take the average age of whatever gender you are , well you're close. So\nhaving said that, does that ever cross your mind as far as how long you \" think\"\nyou're going to live with investments ?\n\nMe, I'm probably…",
  "data/reddit-stocks/r/Bogleheads/comments/rjof86/only_4_of_us_stocks_from_19262016_outperformed.json": "There is an academic paper written by Hendrik Bessembinder that analyzes the\nreturns of individual U.S stocks from 1926-2016. It can be accessed here:\nhttps://papers.ssrn.com/sol3/papers.cfm?abstract_id=2900447\n\nIn the paper he concludes that from 1926-2016:\n\n 1. just 42.6% of common stocks have a…",
  "data/reddit-stocks/r/Bogleheads/comments/rjtumi/will_longterm_investing_die_by_the_end_of_the.json": "First off, this is a theoretical question and a temperature check of what this\ncommunity thinks about the future: not the future of the stock market, but our\nspecies’ future socio-economic progress/collapse.\n\nA fundamental reason why Bogle’s investment principles works, is that in our\ncurrent,…",
  "data/reddit-stocks/r/Bogleheads/comments/rjtyj5/any_stories_on_when_you_went_against_bogleheads.json": "Anybody have any stories on when they had a sure fire investment plan, or stock,\nthat SHOULD have done well and absolutely did not work out?\n\nI believe for most people this would have had to have happened before they fully\nbelieved in Bogleheads...",
  "data/reddit-stocks/r/Bogleheads/comments/rk1dlv/small_cap_etfs_ijr_vs_slyv_vs_avuv.json": "Looking to have some small cap / small cap value exposure in my portfolio.\nThrough some research, it seems the best bets are one of these three ETFs. A\nquick summary of pros and cons below:\n\n 1. IJR (iShares Core SP Small Cap)\n\nExpense Ratio: 0.06%\n\nYTD Returns: 20.58%\n\nThis fund is passively…",
  "data/reddit-stocks/r/Bogleheads/comments/rk1wy0/which_fund_should_i_buy_for_an_xmas_gift_for_my.json": "I'd like to get my niece and nephew a gift of stock market funds for Christmas\n(they have enough toys).\n\nI expect them to hold onto the investment until they're ready for college or\nhave another large financial purchase in about 15-20 years.\n\nShould I stick with 100% VSTAX or a different fund?",
  "data/reddit-stocks/r/Bogleheads/comments/rk472q/starting_to_invest_1000_monthly_starting_from.json": "I've been saving hard to purchase a property and have just moved in. This will\nfree up £1000 per month to invest (I have an emergency fund), and I will\ncontinue to save some cash each month to pay for emergency car repairs or home\nimprovements.\n\nI'm interested in those who may have done this before…",
  "data/reddit-stocks/r/Bogleheads/comments/rk5hav/unbelievable_theres_a_crypto_ira_advertising_on.json": "While watching TV this morning, I saw an advertisement for the Alto CryptoIRA.\nIt’s one of those gimmicky tech start-up companies that all have the exact same\nbranding, and I’m certain they’re going to find a niche with people who bet on\ncrypto and lose their retirement savings because they’re not…",
  "data/reddit-stocks/r/Bogleheads/comments/rk7smj/how_do_you_make_your_withdrawls_in_retirement.json": "So I know the topic of withdrawls could be a complex one, but I was just\nwondering about one specific aspect: where do you actually make your regular\nwithdrawals from in retirement?\n\nSo say at retirement everything is in tax advantaged account with a 60/40\nequity/bonds allocation that will slowly…",
  "data/reddit-stocks/r/Bogleheads/comments/rkabjl/a_significant_amount_of_my_money_is_stuck_in.json": "For context, I'm 24 years old. My employer is 100% employee owned (via an ESOP).\nAbout one 20% of my savings is in the form of company \"stock.\" It isn't actual\nstock. An economist sets a \"stock price\" by comparing our company to publicly\ntraded firms. When I retire, the company will be required to…",
  "data/reddit-stocks/r/Bogleheads/comments/rkcn0s/suggestions_on_roth_ira_for_a_26_year_old.json": "Hello everyone, I'm new to the Bogleheads philosophy and working on improving my\nfinancial knowledge so that I can be better prepared for retirement. I'm\ncurrently matching my company's 401(k), paying off my student loans aggressively\n(had a lot of undergraduate debt), and started putting my money…",
  "data/reddit-stocks/r/Bogleheads/comments/rkcsjn/12_pillars_of_wisdom_what_we_should_have_learned.json": "I stumbled across an old speech given by John Bogle called the 12 pillars of\nWisdom “what we should have learned before the next bear market arrives”.\n\nBogle presented it in a lecture back in 2001 shortly before the Dotcom crash\nthat smashed the NASDAQ shortly after the speech.\n\nThis speech was a…",
  "data/reddit-stocks/r/Bogleheads/comments/rkflr4/becoming_a_millionaire_after_30_years_by.json": "Hi fellow Bogleheads, We all know that it is possible for the average Joe to\nbecome a millionaire by dollar cost averageing in low cost globally diversified\netfs over a 30 to 40 years period. My only question is after 30 to 40 years,\nwill 1 million mean anything or be enough to sustain…",
  "data/reddit-stocks/r/Bogleheads/comments/rktnib/fidelitys_personalized_planning_and_advice.json": "Fidelity has been spamming me through both my corporate email and personal email\nand phone calls to sign up for their personalized planning and advisory service.\nNo obligation of course. Its basically a robo-advisory. It comes complete with a\n\"annualized net fee of 0.33% applied to your current…",
  "data/reddit-stocks/r/Bogleheads/comments/rkud15/vti_to_166.json": "So I told my boss about VTI and boglehead strategy. Her partner overhead and\nasked what the ticket symbol was. Proceeds to look up VTI, and sees it near its\nall time high.\n\nSays he will get it when it drops to 166.\n\nI told him it will NEVER go that low again … I feel great being able to remain\nso…",
  "data/reddit-stocks/r/Bogleheads/comments/rkuzr0/30_married_with_kids_i_can_only_afford_to_put.json": "I've been with my company for 6 years. I'll probably end up working there until\nI'm about 55 - 60. I have a ROTH IRA with Fidelity as my company's 401K is with\nFidelity. I wanted to invest in more because I don't want my eggs in one basket\nwith my only investment being with my 401K. Is it worth to…",
  "data/reddit-stocks/r/Bogleheads/comments/rl1jv2/hsa_strategy.json": "I see posts all the time saying to max my HSA and then not use it for medical\nexpenses. Meanwhile, my medical expenses which could be tax-free are now paid\nfor with taxed dollars. Can someone explain how this is better because it is\npainful given I used to use an FSA paying for all my medical…",
  "data/reddit-stocks/r/Bogleheads/comments/rl2lnb/vt_versus_vtivtxus.json": "I believe the recommendation is something like a 60/40 split of VTI/VXUS....And\nIm seeing VT is 63% American and the rest global....\n\nIs VT simply covering the same allocation of a 60/40 VTI/VXUS allocation?\n\nWasn't sure if the holdings are different... Can I make things easier for me by\njust…",
  "data/reddit-stocks/r/Bogleheads/comments/rl3o7q/boglehead_advice_on_reit_dividends.json": "44 years old, no college degree, Boglehead by heart and practice. I hold total\nstock/us/international across multiple accounts. Every year, first thing, is to\nmax out my Roth and HSA. I'm close, in most years, on maxing my 401k. It's an\naverage job, I've spent 21 years there, with little prospects…",
  "data/reddit-stocks/r/Bogleheads/comments/rl5y6w/why_is_the_vanguard_total_international_funds.json": "When I logged into my account I noticed that there was a dividend payment much\nhigher than usual which turned out to be from the Vanguard Total International\nfund (VTIAX). Based on historical data it's about 2-3x as much as usual. Is\nthere a reason for this that I'm not aware of or these companies…",
  "data/reddit-stocks/r/Bogleheads/comments/rlf3nr/what_happens_to_the_interest_gained_between.json": "My question consists of two parts.\n\n1) If I put the max contribution ($6,000 for myself for 2021 year) in the\nTraditional IRA brokerage account prior to Roth conversion and say it\naccumulates $5 in interest in a few days, and now the settlement fund is $6,005\n-- when making the conversion, am I…",
  "data/reddit-stocks/r/Bogleheads/comments/rlisnq/motley_fool_stock_advisor_experiment.json": "Hi,\n\nI've been following Motley Fool on and off since 2000.\n\nI've been doing relatively well in the market over the years, but I made a major\nmistake at the March 2020 Covid crash. I sold nearly everything early in the\ncrash because I also thought everything was overvalued, and I thought this…",
  "data/reddit-stocks/r/Bogleheads/comments/rllbjj/if_you_got_10_million_dollars_would_your.json": "Still vti + international + bonds and chill?\n\nOr at what point would you get financial advisors? I don't know why those people\npay those high fee funds that are for rich people. Am I missing anything?",
  "data/reddit-stocks/r/Bogleheads/comments/rln2n0/thoughts_on_avus_as_a_vti_alternative.json": "AVUS has about 2000 holdings and purports to bring some of their value screens\ninto play; hard to parse the comparisons directly but seems to slightly\nunderweight FAANGs vs. VTI and more dramatically underweight companies with\nworse accounting profitability metrics (e.g. TSLA).\n\nThe fee difference…",
  "data/reddit-stocks/r/Bogleheads/comments/rlv228/anyone_here_tilt_to_em.json": "I am familiar with the tilt to small cap and to value, but I’m curious if anyone\nhere has maintained a tilt towards emerging markets? Why? Is it a cheaper way to\ntilt international to small cap value? Maybe higher risk implies higher reward?\nThat’s not always true though…",
  "data/reddit-stocks/r/Bogleheads/comments/rlyqfl/misnamed_deserves_an_award.json": "this person responds to so many people with good advice and no snark",
  "data/reddit-stocks/r/Bogleheads/comments/rm3ece/ok_bonds_you_convinced_me_now_whats_the_vt.json": "So, 28yo, currently invested 100% in VWCE (the closest European equivalent of\nVT) and want to gradually move to a 85/15 allocation.\n\nI want to keep it globally diversified, asset diversified (government bonds,\ncorporate bonds, etc.) and simple, aka one ETF for stocks, one ETF for bonds.\n\nIs VAGF,…",
  "data/reddit-stocks/r/Bogleheads/comments/rm7wyw/ibonds_2022_when_to_purchase.json": "With the current I-Bond composite rate of 7.12% with base rate of 0% over life\nof bond, thoughts on whether to max out immediately in 2022 at current composite\nrate vs waiting until May ( or Nov) 2022 to see what the new fixed rate would be\nin consideration of the Fed announcing rate hikes in 2022?",
  "data/reddit-stocks/r/Bogleheads/comments/rm956a/preparing_to_purchase_first_house.json": "I’m getting ready to seriously starting looking for my first home (Philadelphia,\nPA). My budget is in the 350-425k range and current income is around 150k a\nyear, I have 130k invested in broad market index funds through fidelity (80\nus/20 international) and a separate 401k with 127k in it so the…",
  "data/reddit-stocks/r/Bogleheads/comments/rmajt0/psa_student_loan_repayment_moratorium_extended.json": "Just announced by the White House",
  "data/reddit-stocks/r/Bogleheads/comments/rmejfs/maxing_roth_ira_before_401k.json": "I was curious why this is always recommended. In my employee sponsored 401k, I\nhave access to VTSAX and VTIAX, which is what I would buy in a Roth IRA anyway.\nIs there some other benefit that IRA’s offer over 401k’s that I’m overlooking?\n\nI plan to contribute to both regardless, but I’m not sure if…",
  "data/reddit-stocks/r/Bogleheads/comments/rmm8yp/my_401k_100_fxaix_my_roth_ira_40_vti_40_vxus_20.json": "I am 36, so 28-30 years away from retirement and not expecting to take anything\nout until I'm 59 1/2 or really towards 65+ years old.\n\nI'm still planning out my retirement investing right now, and still a new to\ninvesting and after doing my research, I decided on what I mentioned. Any\nthoughts and…",
  "data/reddit-stocks/r/Bogleheads/comments/rmtskk/three_fund_portfolio_vs_target_date_fund.json": "Would buying into a target date fund that is basically vti+int+bonds all bundled\ninto one work as well? Or do those not exist without crazy fees?",
  "data/reddit-stocks/r/Bogleheads/comments/rmw3s1/seen_a_lot_of_talk_about_series_i_bonds_as_a.json": "Was the turnaround time fairly quick for redeeming your bond? I was thinking\nabout slowly converting my current emergency fund over from HYSA to i bonds.",
  "data/reddit-stocks/r/Bogleheads/comments/rmxpbh/question_how_do_i_transfer_from_spy_to_voo_in_a.json": "I had purchased a significant amount of SPY over the past 5 years. This ETF has\nan expense ratio of 0.095%. I would like to sell my SPY and purchase VOO which\nis effectively the same product. VOO has an expense ratio of just 0.03% though.\n\nThe issue is that I have a large amount of taxable gains on…",
  "data/reddit-stocks/r/Bogleheads/comments/rn0oo5/i_bond_emergency_fund.json": "What are your thoughts/general consensus of tieing up your current emergency\nfund (or a moderate portion) in I bonds if you have a similar amount in\nbrokerage and Roth IRA contributions?\n\nFor the sake of numbers:\n\n1 Month in Checking\n\n2 Months In Savings\n\n2 Months in Brokerage\n\n10 Months in Roth…",
  "data/reddit-stocks/r/Bogleheads/comments/rn1wkd/wealthfront_vs_vti_and_chill.json": "I'm trying to understand the merits and advantages of using Wealthfront's\nallocation for me versus just VTI and chill.\n\nWith a 9/10 Risk Allocation, Wealthfront is suggesting:\n\n * VTI - 45%\n * VEA - 18%\n * VWO - 17%\n * VIG - 11%\n * VTEB - 9%\n\nCurrently, I've got 80% VTI and 20% SPY.\n\nIs there any…",
  "data/reddit-stocks/r/Bogleheads/comments/rn3wls/my_roth_ira_is_100_vtsax_the_only_index_fund_in.json": "So just opened and maxed out Roth IRA with VTSAX. For '22, plan on also\ninvesting in vtiax and having around a 80/20 split in my Roth. Just opened a\ntaxable brokerage account. I want to contribute all of my extra money into index\nfunds. Would it make sense to have the only index fund/bulk of my…",
  "data/reddit-stocks/r/Bogleheads/comments/rn4lr5/about_to_fund_my_2021_roth_ira.json": "For the 2nd time in my life, I’m doing it! My MAGI unfortunately doesn’t let me\ndo it in installments so I have to do the conversion (backdoor ROTH IRA) method.\nWho can figure out MAGI anyways with all its deductions 😩😩\n\nAnywho, this is a proud moment for me as I have learned a lot about…",
  "data/reddit-stocks/r/Bogleheads/comments/rn4x1u/managed_fund_surprise.json": "I have held VSCTX & VWUAX in equal dollar amounts for a few years. Their average\nhas beat VTI by a few bases points, not this year yet though.\n\nI knew about the tax disadvantage of managed funds but it was tolerable; until\nthis year. They both distribute gains all at once in December. This…",
  "data/reddit-stocks/r/Bogleheads/comments/rn86y9/i_bonds_vs_bond_fund_like_vbmfx.json": "Amid all the hype for I Bonds I was wondering how they compare to something like\na total bond market fund like VBMFX. I know when you buy the I bonds will make a\ndifference (since part of the calculation on your return is based on a fixed\nrate), but is there any data comparing the two? Assuming I'm…",
  "data/reddit-stocks/r/Bogleheads/comments/rnbrfi/invested_in_an_index_fund_fskax.json": "Today I (F53) made my first investment into an index fund (FSKAX). I have been\nresearching so much, learning from this subreddit, read books and articles for\nmonths, and decided it was time to do this. I want to invest $1000 per month\nwith the sole purpose of one day paying off my home which in my…",
  "data/reddit-stocks/r/Bogleheads/comments/rncwd5/real_estate_generates_10_compounded_interest.json": "Ive put an offer on a 6 unit mixed use property in the metro NYC area.\n\n$1m purchase with 25% down. 4% @ 30 year commercial note. Total cash outlay\napprox $250,000\n\nAssuming $6000/yr in maintenance and 4% vacancy.\n\nAfter all expenses, I will cash flow about $2400/month.\n\nI can take the full $2400…",
  "data/reddit-stocks/r/Bogleheads/comments/rnhak2/whats_wrong_with_the_vt_and_chill_approach.json": "In my late 30s, nothing else but VT in the portfolio, investing after each\npaycheck.",
  "data/reddit-stocks/r/Bogleheads/comments/rnmiw7/i_fought_the_market_and_the_market_won.json": "Just a confession and some repentance here, Bogleheads. I read Little Book of\nCommon Sense investing years ago. I did dollar cost averaging on SPY and it\nworked very well, but I eventually got bored.\n\nOver the past 2 years I tried beating the market with my basic understanding of\nvaluation and…",
  "data/reddit-stocks/r/Bogleheads/comments/rns6m7/remember_no_timing.json": "I have heard it time and time again: it has to go down, it's due for a\ncorrection, the stock can only go up, get your money out x y and z will force a\nmove. On December 1st, we found the first omicron case in America. It would be\nreasonable to look at that news and think that the American markets…",
  "data/reddit-stocks/r/Bogleheads/comments/rnz4dl/hsa_roth.json": "new to all this and was reading the boglehead wiki and was surprised hsa is\nlisted above Roth in funding priority. so who in here is doing that? tell me\nyour hsa strategies so i may learn.",
  "data/reddit-stocks/r/Bogleheads/comments/ro029c/portfolio_for_someone_with_next_to_no_knowledge.json": "Hello folks!\n\nI'm 21 and with a freshly opened Roth IRA account through Merrill Edge, and was\nlooking for some advice after reading through a couple posts here. As the title\nsays, I know almost nothing about stocks or the market, but would like to not be\nbroke when I retire!\n\nThat being said, I've…",
  "data/reddit-stocks/r/Bogleheads/comments/ro1otb/merry_christmas_here_i_will_share_how_i_got_my.json": "I've always been drawn towards the boglehead style of investing, but not\neveryone agrees. People such as... my family members! Oh, they are doing \"great\"\nwith crypto and they think I should be too. I always tell them I simply prefer\nthe reliable path, but that doesn't convince them. So what…",
  "data/reddit-stocks/r/Bogleheads/comments/ro8wob/bought_i_bonds_twice_at_td_going_past_10k_limit.json": "The web UI didn’t restrict me. I bought it twice because the 2nd time I wanted\nto get it for a gift for a family member but myself was specified as the\nregistration. Is this problem? How do I cancel and rebuy for a family member?",
  "data/reddit-stocks/r/Bogleheads/comments/roc50v/am_i_being_a_fool_for_holding_some_of_my_money.json": "With multiple rate hikes expected in 2022 wouldn't that be a drag on bonds? And\nif so am I then being a fool by having some of my portfolio in an intermediate\nterm treasury bond fund instead of just keeping it in cash?",
  "data/reddit-stocks/r/Bogleheads/comments/rocpno/invest_around_180k_with_schwab.json": "What’s up, long time lurker here and I’ve been investing small amounts on my own\nwith schwab ETFs and some stocks, dabbling with covered calls and trying to max\nout my 457. I posted this in r/schwab [/r/schwab] but someone recommended I come\nhere from now on.\n\nIt’s a bitter sweet time as my wife’s…",
  "data/reddit-stocks/r/Bogleheads/comments/roeomu/which_brokerage_do_you_use.json": "View Poll [https://www.reddit.com/poll/roeomu]",
  "data/reddit-stocks/r/Bogleheads/comments/rog4p9/merry_christmas.json": "Merry Christmas Bogleheads! Hope you are relaxing, spending time with loved\nones, and ignoring the stock market. To those who don't celebrate Christmas,\nhappy holidays.",
  "data/reddit-stocks/r/Bogleheads/comments/roihtc/why_is_the_vanguard_2045_fund_already_a_mix_of_88.json": "I feel like it's really early to be that heavy into bonds with 25 years left to\nmaturity.\n\nIs it due to be dramatic ups and down? Am I missing something? Last year at this\ntime it was around 5%",
  "data/reddit-stocks/r/Bogleheads/comments/rol2y0/unsure_of_what_to_do.json": "I just turned 17 and have been putting all of my income into a Roth IRA. I’m\ncurrently doing:\n\n80% FZROX 20% FZILX\n\nWill I be set up for financial success if I just keep doing this for the rest of\nmy life? It almost seems too simple and I was curious what you all think about\nthis portfolio for…",
  "data/reddit-stocks/r/Bogleheads/comments/roug9b/basic_three_fund_portfolio_requesting_review.json": "33 years old, planning on buying the following funds in my Vanguard account:\n\n * 70% US Stocks via Index Fund (VTSAX)\n * 20% International via Index Fund (VTIAX)\n * 10% Bonds via Index Fund (VBTLX)\n\nI considered VTWAX instead of VTSAX+VTIAX but ultimately decided I probably want\nto additional…",
  "data/reddit-stocks/r/Bogleheads/comments/rovup8/a_genuine_request_for_help_or_guidance.json": "Hi friends I'm here to ask for sincere help and to draw from the fountain of\nknowledge in this forum.\n\n\n\nI'm here to ask for help with my 401k allocations. I have been a lurker for\nquite some time and read the wikis and have dabbled with choosing my own\ninvestments before having a family to provide…",
  "data/reddit-stocks/r/Bogleheads/comments/roy208/22m_graduate_student_that_just_inherited_100k_and.json": "I just inherited 100K and I am considering the best way to invest this for\nretirement while avoiding taxes.\n\n- I have no debt from school or elsewhere to pay off\n\n- I have a part time income that allows me to max out my Roth IRA.\n\n- Beyond the Roth, I have no 401K, HSA, or any tax sheltered way…",
  "data/reddit-stocks/r/Bogleheads/comments/rp8k02/how_much_is_too_much_have_too_much_cash_on_hand.json": "Have too much cash in a stupid HSA. No debt, ready to place it and leave it for\nquite a while. Is smashing 100k + into let’s say VTI ridiculous?",
  "data/reddit-stocks/r/Bogleheads/comments/rpcqle/what_is_a_total_portfolio_approach_how_to.json": "A lot of folks start by 'mirroring' allocations across accounts (e.g. holding\n70/30 stocks bonds in taxable, and in their IRA and in their 401(k)), which can\nbe OK ... but it can be simpler, cheaper, and more tax-efficient to treat\neverything as one big portfolio. There are a few good links in the…",
  "data/reddit-stocks/r/Bogleheads/comments/rpffao/just_received_a_200000_inheritance_and_was_told.json": "Just received my inheritance, what’s a good long-term plan for growth?\n\nHi I’m 20 years old and just received my inheritance it’s somewhere shy of\n$200,000, i’m wondering what the best asset location would be for me to not only\nbe able to receive a quarterly or monthly check to help out with my…",
  "data/reddit-stocks/r/Bogleheads/comments/rpiqei/feelings_on_new_vanguard_mobile_app.json": "I’ve been a Vanguard client for almost two decades. Used the mobile app since\nits inception. A few months ago it was auto-upgraded on iOS to what I later\nlearned is a prototype application of theirs called Beacon:\nhttps://www.bogleheads.org/forum/viewtopic.php?t=355682. Needless to say, I…",
  "data/reddit-stocks/r/Bogleheads/comments/rpp0hj/my_17_year_old_brother_in_law_just_got_a_job_need.json": "He's the baby of my wife's family, about 18 years younger than my wife. He just\nstarted working a few months ago. I told my wife and their mom that I'd like to\nget him on a good path for saving / investing for his future. All, including\nhim, were on board.\n\nSo at Christmas he was asking me…",
  "data/reddit-stocks/r/Bogleheads/comments/rpqnsl/any_difference_between_buying_vt_or_vtwax.json": "Was having some trouble buying an ETF on the Vanguard app, and saw VTWAX is the\nequivalent mutual fund of VT, the ETF I was going to buy. Is there any\ndifference if I buy VTWAX instead of VT? I’m sorry if this is a dumb question,\nI’m new to this!",
  "data/reddit-stocks/r/Bogleheads/comments/rpqrpn/should_i_stop_investing_my_taxable_account_in.json": "My (25M) current portfolio is the following:\n\nTaxable Brokerage:\n\n * 70% FZROX\n * 30% FZILX\n\nRoth IRA:\n\n * 100% FDKLX\n\n401K:\n\n * 100% RDKTX\n\nAfter doing some reading around this subreddit, I realize that having my entire\ntaxable brokerage in Fidelity's zero fund may not be such a great idea. I…",
  "data/reddit-stocks/r/Bogleheads/comments/rpsvup/dad_is_in_bad_health.json": "Unfortunately, he will most likely pass soon. What steps should we take to\nensure his finances and properties / investments are all set? Thank you.",
  "data/reddit-stocks/r/Bogleheads/comments/rpycd0/vt_and_chill.json": "When you guys say “VT and chill”…are you guys sitting 100% stocks? Or are you\n“chilling” with some bonds too?",
  "data/reddit-stocks/r/Bogleheads/comments/rq363n/value_etfs.json": "Ex. VTV, SCHV\n\nWhat role do these have in the Boglehead portfolio, if any?\n\nIs anyone holding any value ETFs? If so, what is your reason to own them? Which\nones? What percent of your portfolio?\n\nThanks",
  "data/reddit-stocks/r/Bogleheads/comments/rq5ps8/just_went_all_in_on_tdfs.json": "See y'all in 30 years to see if I made the wrong choice 😄\n\n(I mostly joke. But it's entirely possible over the next 30 years, everyone's\nVTWAX/VTSAX portfolios do much much better)",
  "data/reddit-stocks/r/Bogleheads/comments/rqf05j/comparing_us_vs_exus_is_not_a_fair_comparison.json": "This is yet another post demonstrating why having international exposure is\nimportant, however I will try to prove a point that hasn't really been talked\nabout much.\n\nComparing any country's historic stock returns to US's historic stock returns is\nnot an apples to apples comparison. To understand…",
  "data/reddit-stocks/r/Bogleheads/comments/rqhitw/my_74_yr_old_grandma_just_received_138000_from_my.json": "She has a really old Ford Focus so she wants to get a newer more reliable car\nand the rest is going to be for living expenses. She draws social security and\nlives in a very low cost of living area so monthly expenses are minimal (rent is\nbiggest expense at $600 a month but she is planning on…",
  "data/reddit-stocks/r/Bogleheads/comments/rqnkw3/ignoring_bonds_what_percent_usintl_is_your_stock.json": "Upvote for visibility if you took the poll\n\nView Poll [https://www.reddit.com/poll/rqnkw3]",
  "data/reddit-stocks/r/Bogleheads/comments/rqr4yu/if_the_sp500_is_commonly_used_as_an_example_of.json": "I understand why a total-market stick approach is the safest. However, I\ncommonly see the S&P500 being used as the prime index example in posts and in\nbooks. Everyone always says to not try to beat the S&P500.\n\nMaybe there’s something that I am misunderstanding, but why is VOO and chill…",
  "data/reddit-stocks/r/Bogleheads/comments/rr75p6/for_those_funding_all_of_their_ira_roth_ira_etc.json": "Most arguments for lump sum center around coming upon a windfall but what are\nthoughts when it's a $6,000 contribution in an IRA or Roth IRA? Thanks for your\nsuggestions and thoughts!",
  "data/reddit-stocks/r/Bogleheads/comments/rr94d9/im_18_years_old_and_have_around_2000_to_invest.json": "I want to get my money growing in an index like VTI and maybe a little QQQ, but\nthe prices are so high right now I’m leaning towards just sitting on the cash\nuntil another covid like pullback, thoughts?",
  "data/reddit-stocks/r/Bogleheads/comments/rrb0rv/i_did_something_dumb_not_a_bogle_move_and_i.json": "I had a large sum in VOO, just invested in the end of November / beginning of\nDecember of this year. When the stock market jumped down a couple of times due\nto Covid, I thought it would be \"smart\" to sell at a slight gain, then wait\nuntil it dropped back down again from some Covid variant, and so I…",
  "data/reddit-stocks/r/Bogleheads/comments/rrc5wi/ive_started_my_first_portfolio_thanks_for_your.json": "UK-based almost 40-something. Less than three months ago, I knew absolutely\nnothing about investments. Now, two and a bit months and tons of research later\n(including on this sub), I've settled on this portfolio for my stocks and shares\nISA:\n\n70% - Fidelity Index World P Acc (MSCI)\n\n10% - Fidelity…",
  "data/reddit-stocks/r/Bogleheads/comments/rrk3ls/talking_with_parents_about_a_bogleheads_approach.json": "I was wondering if anyone else has had the experience of talking with parents\nabout a Bogleheads-based retirement approach versus whatever approach they think\nis best.\n\nI’m 27 and just starting to save for retirement, and my dad is in his 70s. As a\nbirthday present this year he opened a Roth IRA in…",
  "data/reddit-stocks/r/Bogleheads/comments/rrm7fd/mom_is_55_opening_a_roth_all_into_vtsax.json": "Any better advice on where to max out the roth?\n\nTarget retirement? VTSAX?\n\nThanks!",
  "data/reddit-stocks/r/Bogleheads/comments/rrmwbi/vanguard_tdf_large_losses_today.json": "I happened to check my IRA balance today (I know). But, I saw my VFFVX (2055) on\nvanguard says it has dropped 9% today? I also just checked that VFIFX (2050)\nwhich is similar.\n\nWhat happened today to make these drop so much differently compared to the rest\nof the market???",
  "data/reddit-stocks/r/Bogleheads/comments/rrp4gs/boglehead_return_from_2000_to_2015_and_else.json": "Was talking about the boglehead approach with a 40yo who is zero bonds and full\nequity. They asked me a question, how did the boglehead portfolio do from 2000\nto 2015 and 2000 to 2022.\n\nI told them bogleheads think on longer timeframes, but it was a fair question.\n\nNot sure where to find that…",
  "data/reddit-stocks/r/Bogleheads/comments/rrt6t9/should_i_a_quick_rundown_of_some_recent_faq.json": "> ... ditch my Target Date fund because it isn't performing as well as some\n> other funds?\n\nNo. Some part of your portfolio will always lag other parts. To paraphrase: \"if\nyou're not unhappy with some part of your allocation, you're not sufficiently\ndiversified.\" Buy low, sell high, repeat via…",
  "data/reddit-stocks/r/Bogleheads/comments/rrv9hd/emergency_fund_success.json": "We managed to build an emergency fund over the year only to spend it on a\nplumbing emergency leading to an opportunity. Rather than quick fix a leaky pipe\nthat will fail again in a few years we can afford to properly repipe our home.\n\nAs frustrating as it is to spend this money so soon, it…",
  "data/reddit-stocks/r/Bogleheads/comments/rsc493/thoughts_on_a_30_year_old_just_putting_100_of_his.json": "Would it be crazy for a 30 year old to do this as his investment strategy?\nInvesting all of his money into VTWAX, and just holding it for decades? Would\nthat be a ridiculous and awful strategy or a reasonable one?",
  "data/reddit-stocks/r/Bogleheads/comments/rse79e/just_read_it.json": "Just want to say that if you havent read The Bogleheads Guide to Investing book\"\nyou are wasting your time.\n\nIt is easy to get conffused with so many advices about wich EFF is the best.\nWhen you dont know wich one is the best for you it makes you an insecure\ninvestor.\n\nThank god this book came to…",
  "data/reddit-stocks/r/investing/comments/r6aigx/china_plans_to_ban_loophole_used_by_tech_firms.json": "https://www.bloomberg.com/news/articles/2021-12-01/china-plans-to-ban-loophole-used-by-tech-firms-for-foreign-ipos?sref=K5kiE5Jr\n\nSo it looks like China is closing the loophole on going public outside using\nVIEs.\n\nGoing public in Hong Kong would still be allowed.\n\nAny current companies using VIE…",
  "data/reddit-stocks/r/investing/comments/r6e0ep/are_we_in_a_bubble_comparing_the_current_stock.json": "Lately, there has been growing chatter around whether the current rally that we\nare experiencing over the past one and half years is mainly driven by\nspeculation and if we are in one of the largest investment bubbles ever.\n\n> Why the Stock Market is in a bubble? - Business Insider\n>…",
  "data/reddit-stocks/r/investing/comments/r6gtla/intel_as_a_longterm_investment.json": "I'm pretty new to stock trading, so don't hesitate to point out anything I\nomitted that you think would be worth mentioning regarding Intel.\n\nSo Intel seems to be one of those tech underdogs who no one thinks will perform\nwell in the future because they haven't been innovative at all in the past…",
  "data/reddit-stocks/r/investing/comments/r6p502/how_will_this_wash_sale_affect_me.json": "Early in the year, I made $15k realized gains in my portfolio. In June, I\ninvested heavily in Stock A. As of today, I have $10k in unrealized losses on\nStock A.\n\nI’d like to sell Stock A to realize those losses and offset my gains for the\nyear (to pay taxes on net 5k profit).\n\nBut I also want to…",
  "data/reddit-stocks/r/investing/comments/r6u6gn/with_tax_season_coming_up_how_do_investment_taxes.json": "This year was my first year investing my money so I have no idea how taxes work\nwhen it comes to this.\n\nWill it work just like your job - where your investment provider(?) sends you a\nform (W-2 in the case of a job) and I just have to enter that info into whatever\ntax software I choose before they…",
  "data/reddit-stocks/r/investing/comments/r78e5h/how_is_total_weighted_expense_ratio_calculated.json": "Here is an example where you invest 10K into 4 different ETFs with various\nexpense ratios, but how much you put into each ETF varies.\n\nSo let's say the 4 expense ratios of the ETFs are .04, 0.12, 0.2, 0.5\n\nAnd 50% of that is in 0.04, 20% is in 0.12, another 20% in 0.2, and 10% in 0.5\n\nIf you add…",
  "data/reddit-stocks/r/investing/comments/r7a0ox/rocket_lab_rklb_gives_an_update_on_their_neutron.json": "Notable takeaways/specs:\n\n- Made of composite carbon fiber (Different than SpaceX's stainless steel on\nStarship)\n\n- First stage is reusable with a rather unique design where the fairings are\npermanently attached and therefore reusable\n\n- Expendable upper stage\n\n- New engine Archimedes (Meth/Lox,…",
  "data/reddit-stocks/r/investing/comments/r7rh2j/berkshires_munger_says_now_even_crazier_than.json": "https://finance.yahoo.com/news/berkshire-munger-says-now-even-011210126.html\n\nSo Charlie Munger was speaking at a conference in Australia.\n\nHere are some things he said:\n\n-markets are wildly overvalued and is “even crazier” than dot com boom.\n\n-he wished crypcurrencies didn’t exist and praised…",
  "data/reddit-stocks/r/investing/comments/r7zc24/chinas_didi_to_delist_from_new_york_and_switch_to.json": "https://www.ft.com/content/c30cf911-51da-4b40-a969-161351de6f04\n\nChinese ride-hailing group Didi Chuxing said it would delist from the New York\nStock Exchange, accelerating China’s decoupling from US capital markets as\nBeijing cracks down on the country’s leading technology groups.\n\nThe company,…",
  "data/reddit-stocks/r/investing/comments/r82xoo/evergrande_officially_declared_indebtness_on.json": "https://preview.redd.it/vytbubj7ec381.jpg?width=538&format=pjpg&auto=webp&s=366b2bd56e650d694cef85174e7a30b3d0a5129e\n\nhttps://preview.redd.it/vu1k1oi8ec381.jpg?width=532&format=pjpg&auto=webp&s=48072626a62c406c0dac66f77ff90e00629afdd6\n\nLink to below official…",
  "data/reddit-stocks/r/investing/comments/r84rt6/alternative_to_waiting_for_the_dip_and_holding.json": "I hear about people holding 10%-30% or more of their portfolio in cash. They say\nthey are waiting for the dip to buy a S&P500 index fund at a discount when the\nmarket crashes.\n\nWe all know of the saying 'time in the market is better than timing the market'.\nEven though this is historically correct…",
  "data/reddit-stocks/r/investing/comments/r85kfc/cathie_wood_has_everyone_fooled_with_her_5_year.json": "One of the most interesting rebuttals to bears pointing out the obvious flaws\nand bad price action in ARK is “buy the dip because Cathie Wood said this is a 5\nyear plan”. This sounds great in theory and probably calms the bag holders at\nnight, but realistically it’s horrible advice.\n\nIn 2000 dot…",
  "data/reddit-stocks/r/investing/comments/r889h5/what_is_a_compelling_reason_to_see.json": "Apparently 70% of crypto movements have been \"wash trading\".source:\nhttps://www.cber-forum.org/cryptowashtrading\n\nWhat is Wash trading?\n\nA crypto currency/coin is just an crypto secured code. Does nothing. Just\ncryptographed code.So you see the listed market price for a coin?\n\nBasically you can…",
  "data/reddit-stocks/r/investing/comments/r89lga/can_someone_eli5_why_docu_tanked_so_much_today.json": "I read the outline of the earnings report and $DOCU beat Q3 estimates by a\npretty good margin, and the Q4 earnings estimates were only 2% off of analysts'\nexpectations.\n\nGranted their next quarter growth is expected to be only 30% compared to 40% of\nthe previous 6 quarters. Still that does not at…",
  "data/reddit-stocks/r/investing/comments/r8r1vq/why_is_valuation_for_semiconductors_so_poor.json": "Even after the surge this year, most of them are still trading at valuations far\nbelow other tech companies. Historically, it's a cyclical business right.\nHowever that is based on decades' worth of trends which have less relevance in\ntoday's economy. Semiconductors these days can turn profits rain…",
  "data/reddit-stocks/r/investing/comments/r8vgye/the_fallacy_of_higher_risk_higher_reward.json": "Often in investing circles, you see the phrase spouted “higher risk = higher\nreward” as a way to justify more speculative and risky stocks or other asset\npurchases. This phrase is usually misinterpreted to mean that if you buy a risky\nstock, you’ll have a higher chance of getting a higher reward in…",
  "data/reddit-stocks/r/investing/comments/r8wmhm/bitcoin_loses_10000_or_17_in_24_hours_after.json": " * Bitcoin prices dropped sharply Saturday early morning hours ET, plunging to a\n   low near $43,000 before rebounding some.\n * The crypto lost about $10,000, or more than 17%, in a 24-hour period from\n   Friday to Saturday.\n * The price of ether dived as well, falling as low as $3,500 on…",
  "data/reddit-stocks/r/investing/comments/r8y1jr/bitcoin_is_not_a_safe_haven_or_digital_gold_its_a.json": "No matter whether you like like crypto's or not, recent days have made it clear\nBitcoin is not a \"safe haven\" or \"digital gold\" which some claim it to be. It's\na risk-on asset.\n\nIn the past week when equity markets sold off because of Fed tapering fears and\non friday lower than expected nonfarm…",
  "data/reddit-stocks/r/investing/comments/r9aj0b/depression_in_the_air_everything_seems_so_subdued.json": "Its Christmas time. Last year we had covid in full force, yet there was optimism\nand light. Decorated houses, decorated markets etc., But this time, in the San\nFrancisco bay area everything feels like Februrary, when the holiday is over and\neverybody is still in the post holiday blues…",
  "data/reddit-stocks/r/investing/comments/r9f51r/chinese_sec_says_it_had_constructive.json": "https://cnevpost.com/2021/12/05/chinese-securities-regulator-says-it-recently-had-constructive-communication-with-us-sec-pcaob/\n\nSome excerpts\n\n\"Recently, individual media reports that Chinese regulators will prohibit\ncompanies with variable interest entity (VIE) structures from listing abroad…",
  "data/reddit-stocks/r/investing/comments/r9qsc0/cathie_woods_ark_innovation_fund_is_in_a_bear.json": "> It’s been a dismal week for Cathie Wood’s flagship fund, Ark Innovation,\n> that’s left nearly all of her holdings in bear market.\n> \n> Wood’s main exchange-traded fund, which trades under ticker ARKK, fell 12.6%\n> this week, for its worst week since February. Ark Innovation dropped 5.5% on\n>…",
  "data/reddit-stocks/r/investing/comments/r9wcii/chinese_developer_and_holding_company_sunshine.json": "China appears to be going through some major issues, especially in the financial\nservices/banking and real estate sectors. A major portion of China's GDP is tied\nup in Real Estate, making the situation similar to what the U.S experienced\nduring the GFC, albeit with less global implications.\n\n\n\n>…",
  "data/reddit-stocks/r/investing/comments/ra3h0m/why_do_we_care_about_patterns_in_technical.json": "Hey, I come from a mathematical background (STEM) and I'm reading up on\ntechnical analysis. My question is why do we even look at those patterns?\n\nThe mathematical models behind those patterns (moving average, Bollinger bands,\netc.) have no connection to the stock market. Why do we use them, and…",
  "data/reddit-stocks/r/investing/comments/ra8fiy/company_analysis_att_vs_verizon_vs_tmobile_are.json": "The next step for telecommunications around the world is 5G. In the US, the\nthree largest providers in the field are Verizon, T-Mobile and AT&T. The\nquestion here is can they offer us a good return on our investment? The obvious\nchoice for industries like telecommunications are the biggest players…",
  "data/reddit-stocks/r/investing/comments/raaw9k/what_happens_to_your_shares_after_a_buyout.json": "It seems like the shares shoot up to the buyout price and drift around at that\nlevel until the sale is completed. But I can't imagine there's a big demand for\nthe shares. Is there somebody that steps in to buy them? Or maybe since the\nprice is almost guaranteed there are people willing to buy them…",
  "data/reddit-stocks/r/investing/comments/rabf0x/buy_the_dip_or_sell_the_rip.json": "What are your thoughts? Are we still in a Bull Market with upward momentum so\nlast week was an opportunity to buy the dip? Or are we entering the beginning of\na Bear Market due to? China Property. New Covid Strain. Russia about to invade\nUkraine. China drop in GDP. Higher interest rates coming.…",
  "data/reddit-stocks/r/investing/comments/rap6pz/china_evergrande_establish_a_risk_mitigation.json": "On 7 December, the Evergrande series rebounded, with EVERGRANDE rising nearly 8%\nand EVERG VEHICLE and EVERG SERVICES both rising about 2% in the Hong Kong stock\nmarket.\n\nYesterday, EVERGRANDE announced that in view of the operational and financial\nchallenges currently faced by the Company, the…",
  "data/reddit-stocks/r/investing/comments/raszxs/government_wants_a_refund_of_covid_relief_check.json": "The government asked my parents to pay it back the covid relief check it got for\n\"reasons\". It's Israel.\n\nThere are two options to pay back the 14k USD. One is to pay it at once (they\nhave the cash on hand) or stretch it to 17 monthly payments at 2% interest.\n\nGiven that 17 months is almost a year…",
  "data/reddit-stocks/r/investing/comments/razg5t/bitcoin_trial_defendant_wins_dispute_over_50b_in.json": "Associated Press\n[https://apnews.com/article/technology-business-new-york-bitcoin-craig-wright-c822c8fca349b7b779b23aa2b6e9db32]\n\nNEW YORK (AP) — Craig Wright, a computer scientist who claims to be the inventor\nof Bitcoin, prevailed in a civil trial verdict Monday against the family of a\ndeceased…",
  "data/reddit-stocks/r/investing/comments/rb2q1c/why_did_the_stock_market_take_so_long_to_crash_in.json": "I love watching how the broad stock market reacts to global news. It's\nincredible speed built upon the best brains working out the most likely outcomes\nin the fastest possible time is sometimes breathtaking to behold.\n\nFor instance, that the market boomed out of the COVID crash as early as…",
  "data/reddit-stocks/r/investing/comments/rb5xir/reviewing_wikipedias_list_of_com_bubble_companies.json": "https://en.wikipedia.org/wiki/Dot-com_bubble#Aftermath\n\nIf you review these companies, you'll see a lot in common with today's \"growth\"\ncompanies like Docusign, Roblox, Teladoc, Crowdstrike, Nvidia, Tesla, Lucid\nMotors, Rivian, etc.\n\nPretty much all of the companies on this list were seeing rapid…",
  "data/reddit-stocks/r/investing/comments/rbkhri/vanguard_target_funds_a_question_on_risk_profile.json": "So… have any of you done either of the following?\n\nTo;dr - I’m currently in the 2055 retirement fund in my 401k. For no other\nreason than my age (30). Have any of you changed your targeted funds, or have\nyou found a better allocation strategy altogether and thrown targeted funds to\nthe wind?\n\nA)…",
  "data/reddit-stocks/r/investing/comments/rbmo7z/china_pumps_188_billion_into_the_economy_to.json": "Hong Kong (CNN Business) China has decided it's time to loosen its purse strings\nand pump money into the economy in a bid to stave off threats to the recovery.\n\nThe People's Bank of China on Monday said it would cut the reserve requirement\nratio for most banks by half a percentage point, starting…",
  "data/reddit-stocks/r/investing/comments/rbztsc/freddie_mac_research_creditworthiness_of_the.json": "This\n[http://www.freddiemac.com/research/insight/20211021_future_borrowers.page?] is\na link to a research paper I stumbled across from Freddie Mac regarding the\n\"Mortgage Ready\"-ness of the population. It lists everyone in the US population\n(Jan 2021) and builds data points from it, categorizing by…",
  "data/reddit-stocks/r/investing/comments/rc2v79/status_of_aftertax_401k_mega_backdoor_roth_in_2022.json": "I keep reading articles that say a bill passed the House that would kill the\n\"Mega Backdoor Roth\" but still needs to pass the Senate. I'm still very unclear\nabout the issue and haven't really seen mention of it here or really anywhere\nbeyond news articles in WSJ and NYT.\n\nSo, first off, is this…",
  "data/reddit-stocks/r/investing/comments/rc74lx/how_do_you_overcome_investing_mistakes.json": "I won't go into details because I'm sick of hearing myself talk, but 5 years\nago, I had a choice, yes, or no.\n\nI chose no -\n\nAnd if I had chosen yes, I would currently have over $4million -\n\nInstead I've had depression and extreme poverty for the past 5 years ( and still\npresently ).\n\nThis decision…",
  "data/reddit-stocks/r/investing/comments/rc7ezk/how_to_generate_40x_returns_on_a_market_crash.json": "Back in early 2020, after the big crash, there was some buzz about Mark\nSpitznagel's hedge fund generating a 4144% return in Q1. I recently began\nwondering / trying to figure out what types of trades could even get close to\nsuch returns. I'm not looking to decipher Spitznagel's special sauce-- if…",
  "data/reddit-stocks/r/investing/comments/rcgd43/dropbox_dbx_an_undervalued_cloud_company_bullish.json": "One of the most overlooked stocks on the American stock market is Dropbox. I\npersonally love it. It's got a lot of potential and the recent drop in price\nopens up an excellent opportunity for new investors.\n\n\nDROPBOX AT A GLANCE\n\nSo, why should we care about Dropbox? Simple. It's a well-performing…",
  "data/reddit-stocks/r/investing/comments/rckz0l/what_happens_when_a_public_company_spins_of_a.json": "From what I understand, if a public company spins off another public company,\nthe share holders of A usually get some stake with B. How will this work from\npublic to private.\n\nI'm asking in relation to\nhttps://www.marketwatch.com/articles/honeywell-just-launched-the-worlds-largest-quantum-computing…",
  "data/reddit-stocks/r/investing/comments/rcnugh/profit_margins_of_bitcoin_miner_stocks.json": "Hello. I have been doing research quite heavily into bitcoin mining companies.\nThere are many names including....\n\n$MARA $RIOT $CLSK $HUT\n\nAnd so on...\n\nVirtually all of these companies are in their early stages of revenue. Most have\nlittle revenue and profits to speak of today. But, expansion is…",
  "data/reddit-stocks/r/investing/comments/rcxn4x/experience_a_large_unexpected_drop_in_your_mutual.json": "A mutual fund is essentially just a basket of individual stocks/bonds/whatever.\nWithin that basket the fund managers are constantly selling/buying and receiving\ndividends. The IRS has special rules for mutual funds which allow them to not\npay taxes on the capital gains/dividends generated provided…",
  "data/reddit-stocks/r/investing/comments/rd2w69/am_i_right_that_we_turkey_might_be_on_the_verge.json": "So as you might have heard our currency lost about 15% of its value on one day.\nRight now everyone is scrambling to get rid of ₺ cash and the most popular\ninstrument to do so here seems to be real estate, maybe along with gold and\nUSD/euros.\n\nWith the CBRT reducing interest rates, the public banks…",
  "data/reddit-stocks/r/investing/comments/rd9nos/inflation_surged_68_even_more_than_expected_in.json": "From the article\n[https://www.cnbc.com/2021/12/10/consumer-price-index-november-2021.html]:\n\n> The consumer price index, which measures the cost of a wide-ranging basket of\n> goods and services, rose 0.8% for the month, good for a 6.8% pace on a year\n> over year basis and the fastest rate since…",
  "data/reddit-stocks/r/investing/comments/rdir11/electric_vehicles_a_bubble_to_burst.json": "https://www.theancienteconomist.com/post/electric-vehicles-a-bubble-to-be-burst\n\nElectric vehicles represent more than just a break from gasoline-powered modes\nof transportations; they illustrate the extremely high demand from consumers for\nfurther innovation. The electric vehicle industry, which…",
  "data/reddit-stocks/r/investing/comments/rdp2vu/chinas_growing_problems_not_being_looked_at.json": "As most know about the Evergrande situation and the possible implications on the\nglobal markets. But Chinas issues run deeper, their railways are between 900-1.8\ntrillion in debt losing around 24 million a day. It's hard to get accurate\nfigures however take these as low estimates. In China these…",
  "data/reddit-stocks/r/investing/comments/rdqvzt/currently_all_assets_are_inflated_inflation_is.json": "Cryptos are inflated. Bitcoin was meant to be digital gold but every time the\nmarket goes down, bitcoin follows. Also, unlike gold bitcoin is too volatile.\nProperty prices across the world are inflated. Stocks are running hot, indexes\nare pretty much the same. Then there are geopolitical issues…",
  "data/reddit-stocks/r/investing/comments/rdtjyk/is_now_a_good_time_to_invest_in_bank_stocks.json": "Is now a good time to invest in bank stocks? Specifically talking about stocks\nlike JPM, BAC, GS, MS etc...\n\nTo me as we get out of COVID in truly significant ways in 2022 (knock on wood),\nthis seems like a good play to me. Am I missing something?\n\nIn the last month banks have fallen about 7-9% and…",
  "data/reddit-stocks/r/investing/comments/rdwqaz/where_do_you_see_the_trajectory_of_home_builder.json": "Where do you see the trajectory of home builder stocks going into 2022?\n\nSpecifically talking about the main ones like Lennar, DHI, Toll.. but also\nsmaller stocks like BZH and CCS.\n\nI see many \"experts\" bullish on homebuilders moving forward under the assumption\nthat pricing will continue to stay…",
  "data/reddit-stocks/r/investing/comments/re9plh/how_much_loss_do_you_hold_on_to.json": "I've invested $50k in a variety of stocks this year and have realized $7k of\ngains but have held on to loses, some too long.\n\n\n\nOverall, with the $7k in realized gains, I'm still down $12,000 from my initial\ninvestments, so I'm holding on to $19,000 of loses. Sometimes it goes up\n$300-$1000 a day,…",
  "data/reddit-stocks/r/investing/comments/reabdd/the_current_state_of_semiconductors.json": "https://www.theancienteconomist.com/post/the-current-state-of-semiconductors\n\nThe semiconductor industry has grown into a $4.67 trillion aggregate containing\nan extensive group of companies at the crux of modern technology. Semiconductors\nare at the foundation of modern life, as they are materials…",
  "data/reddit-stocks/r/investing/comments/rece8o/after_a_year_of_investing_i_came_to_a_conclusion.json": "That I’m thankful for all the financial books I’ve read during these 1,5 years.\nNot only they motivated me to manage my finances, but also helped with my\nanxiety towards money. After being clear how much money is circulated in a\nlarger scales, I realized that overthinking about less than 0.1% is…",
  "data/reddit-stocks/r/investing/comments/refv4l/investing_only_in_mega_cap_stocks_in_2022.json": "I have been investing in a wide array of stocks since beginning investing in\n2017. This last year the only stocks of mine that are above 10% gains are all\nmega caps (Apple, Microsoft). Everyone has an opinion on inflation, rate hikes,\netc. Tbh I think the best thing for this coming year is to keep…",
  "data/reddit-stocks/r/investing/comments/resr38/why_did_gold_and_cryptos_go_downflat_on_the_last.json": "Honest question here. I saw them rally when the CPI was released, but then they\ncrashed back down. Does that mean that market participant get into bonds and\nexcpect a brutal rate hike next year? Or was the CPI somewhat ok? Freaking Apple\nhit ATH again, I can't believe it TBH. 65-70% of stocks are…",
  "data/reddit-stocks/r/investing/comments/rexeen/remember_what_this_sub_used_to_be.json": "Remember when this sub actually involved company analysis? Remember when this\nsub involved market discussions? Remember when this sub was useful?\n\nRemember when you didn’t get downvoted and harassed in dm’s when pointing out\nterrible investments? (Looking at you GME and AMC)\n\nRemember when you…",
  "data/reddit-stocks/r/investing/comments/rfhh51/where_would_you_park_your_cash_reserves.json": "So right now I’m 100% equities, I’m fairly young and have a moderate risk\ntolerance.\n\nWithout literally everything being overvalued right now, and bonds giving\nnegative yields, where’s a good place to park some cash in case of a market\ncorrection?\n\nI want to have some money ready to buy discounted…",
  "data/reddit-stocks/r/investing/comments/rfjod6/debt_credit_cycles_and_the_role_they_play_in.json": "Hey team,\n\nI manage most of my assets personally and, as a result, I feel an ongoing\nresponsibility to understand the world around me, as this enables me to make the\nbest investment decisions I can.\n\nRecently, I’ve been thinking about how to best allocate my portfolio given the\ncurrent state of…",
  "data/reddit-stocks/r/investing/comments/rfkxfm/why_are_bond_yields_dropping_today.json": "Today all the bond yields are dropping:\n\n * 2Y bond yield dropping -3.8%\n   [https://www.investing.com/rates-bonds/u.s.-2-year-bond-yield]\n * 10Y bond yield dropping -4.7%\n   [https://www.investing.com/rates-bonds/u.s.-10-year-bond-yield]\n * 20Y bond yield dropping -3.5%\n  …",
  "data/reddit-stocks/r/investing/comments/rfx1th/discussion_are_ingame_virtual_items_that_can_be.json": "I came across this thread on Reddit about Roblox and various practices they\nemploy, whilst there was a lot of concerning things, I have some questions about\nthe in game items and marketplace offered by Roblox.\n\nOne of the comments I saw was about Roblox's valuation on the stock market and\nthat got…",
  "data/reddit-stocks/r/investing/comments/rfxgk2/best_stocks_to_fight_inflation.json": "We all know inflation is real and it’s here to stay for the foreseeable future.\nAs inflation picks up, we already know the FED will have to increase interest\nrates. The question is - how do we invest with this in mind? I’ve been\nquestioning this for months now.\n\nI’ve heard two theories. The first…",
  "data/reddit-stocks/r/investing/comments/rgb0k2/cash_glut_in_eurozone_drives_dollar_demand.json": "https://www.wsj.com/articles/cash-glut-in-eurozone-drives-dollar-demand-11639477801?mod=hp_lead_pos7\n\nSummary:\n\nA wave of programs intended to boost loans from European banks has has left Euro\nbanks flush with cash and little opportunity for investment. The situation has\ndriven the same banking…",
  "data/reddit-stocks/r/investing/comments/rge0a2/will_bond_prices_drop_due_to_increased_yield.json": "From what I understand, bond prices usually are inversely related to yields\nwhich are rising due to various factors. In addition, since the feds are\npurchasing bonds anymore, won't the decreased demand for them drop the price\ndown? I haven't much about the bond market's response to the current and…",
  "data/reddit-stocks/r/investing/comments/rgkmix/the_market_outlook_in_2022.json": "I'm interested in everyone's expectations in the market next year as we enter\ninto an interesting situation with inflation, supply constraints, constant\npent-up demand, interest rate hikes (later), and faster tapering.\n\nI'll give my expectations here first\n\nI think that inflation will remain fairly…",
  "data/reddit-stocks/r/investing/comments/rgmars/best_books_about_energy_markets_and_investing.json": "For Christmas I want to mainly treat myself to some books after all I've been\nreading was the CFA curriculum the last years\n\nI really enjoy commodity markets and investing in renewables and new tech, and\nwould like to get some good recommendations in this space\n\nSome I'm considering * The prize *…",
  "data/reddit-stocks/r/investing/comments/rgrhwp/with_a_lot_of_stocks_taking_a_beating_in_the.json": "We're seeing a lot of growth stocks taking a heavy beating in recent weeks after\nhaving a nice run-up these past few years. Shares in companies such as Zoom,\nPeloton, and Teladoc are down massively YTD.\n\nMeanwhile, Berkshire Hathaway is up almost 30% YTD, beating the S&P500 within\nthat timeframe…",
  "data/reddit-stocks/r/investing/comments/rh1lsk/arkk_an_object_lesson_on_how_not_to_invest.json": "https://www.morningstar.com/articles/1071658/arkk-an-object-lesson-in-how-not-to-invest\n\nI constantly see Reddit communities bag on ARK and Cathie, but it commonly comes\nwith inaccurate assumptions of technique, performance, skill, and history. I’m\nalso pretty quick to defend ARK against many of…",
  "data/reddit-stocks/r/investing/comments/rh7i4o/in_2022_the_fed_will_buy_60b_in_bonds_per_month.json": "Ok, the FED has spoken:\n\nhttps://www.cnbc.com/2021/12/15/fed-will-aggressively-dial-back-its-monthly-bond-buying-sees-three-rate-hikes-next-year.html\n\nIf I understand it correctly, the FED currently has 6.3 Trillion dollars out in\nthe market.\n\nAdding another 12x60 Billion next year would increase…",
  "data/reddit-stocks/r/investing/comments/rhjgq9/reddit_announces_confidential_submission_of_draft.json": "Reddit has confidentially submitted a draft registration statement with the\nSecurities and Exchange Commission to go public. Reddit has not yet determined\nhow many shares to offer or the price range for its initial public offering.\nThere were signs that the company was readying for an IPO after it…",
  "data/reddit-stocks/r/investing/comments/rhlfsx/turkish_lira_blows_through_15_per_dollar_ahead_of.json": "https://www.reuters.com/markets/currencies/turkish-lira-flat-ahead-cenbank-meeting-2021-12-16/\n\n> ISTANBUL, Dec 16 (Reuters) - The Turkish lira dropped to an all-time lowbeyond\n> 15 against the dollar on Thursday ahead of another expected interest rate\n> cutby the central bank, which has fallen in…",
  "data/reddit-stocks/r/investing/comments/rhprt5/bank_of_england_raises_key_interest_rates_by_15bp.json": "The Bank of England unexpectedly raised interest rates for the first time since\nthe pandemic struck, setting aside the threat to the U.K. economy posed by\nrecord coronavirus cases to become the most high-profile central bank to take on\nsurging inflation.\n\nOfficials led by Governor Andrew Bailey…",
  "data/reddit-stocks/r/investing/comments/rhra5g/reddit_to_go_public_valuation_of_10b_in_august.json": "\"As of August, Reddit said it had a valuation of about $10 billion\n[https://www.wsj.com/articles/reddit-taps-investor-appetite-for-startups-further-raising-valuation-11628766000]\nafter raising more than $400 million from Fidelity Investments Inc. In February,\nthe social-media company said it had…",
  "data/reddit-stocks/r/investing/comments/rhtnlc/shatterpoint_from_newegg_to_torchlight_energy_how.json": "None of this is financial advice:\n\nOpening: The media has been rife with short squeezes in the news in recent\nmonths and there seems to be strong retail sentiment against hedgefunds and\nmarket makers.\n\nThis post does not seek to exacerbate that divide but rather highlight a curious\nphenomenon that…",
  "data/reddit-stocks/r/investing/comments/ri06a3/on_the_buffet_indicator_and_the_current_strongly.json": "The US stock market is widely stated to be overvalued right now\nhttps://www.currentmarketvaluation.com/models/buffett-indicator.php, at 2.2 std.\ndev. above the historical average.\n\nWhy, then, do investor not pour into the stock markets of other countries with\nbetter stock market cap/gdp…",
  "data/reddit-stocks/r/investing/comments/ribay9/turkey_is_burning_through_fx_reserves_at_an.json": "Like the rest of you I’m watching the inflation drama unfold but I assumed they\nhad plenty of powder considering they haven’t enacted capital controls yet .\n\nDid a quick Google search and it appears that it’s an absolute mess in that\ndepartment. Depending on how you read the books they could be 35…",
  "data/reddit-stocks/r/investing/comments/rifn9g/i_was_recently_offered_shares_by_my_employer.json": "Hi all,\n\nFirstly, I apologise if this is not the place to be posting this question. Feel\nfree to point me to a better fitting sub if you can think of any\n\nSo, I've been working at a mature start up for about a year now. I joined as\npart of a growth cycle in which about 100 people were hired. My…",
  "data/reddit-stocks/r/investing/comments/riow0y/investment_accounts_for_my_children.json": "I’ve posted in another community and was referred here, hope you guys can help…\n\nI’m having trouble wording this, because I have very little knowledge on\ninvestment accounts and things of that nature. I’d like to open accounts for my\ntwo young children (under 2 years old) that they can access as…",
  "data/reddit-stocks/r/investing/comments/riyyhd/automate_index_fund_investing.json": "Anyone know how I could automate some of my paycheck be deposited right into my\nfidelity account and automatically purchase VTSAX/VTI? The automation thing\nreally helps me- I always loaded up my 401k because it had this mechanism. Now\nhere I am in my late 20’s with a decent net worth, but much more…",
  "data/reddit-stocks/r/investing/comments/rj9pq4/cathie_wood_says_stocks_have_corrected_into_deep.json": "ARK Invest founder Cathie Wood offered the latest defense of the\nonce-highflying, disruptive innovation strategies that had made her suite of\nexchange-traded funds among the most popular, and best-performing, on Wall\nStreet in 2020.\n\nIn a Friday evening blog post, Wood said that despite a brutal…",
  "data/reddit-stocks/r/investing/comments/rjd2d3/youre_over_exposed_to_real_estate.json": "Most people consider their home to not be part of their investment portfolio\neven though it could be 90% of their net worth.\n\nBut I’m curious whether home ownership impacts what portion of someones\ninvestment portfolio they allocate to real estate, if any is allocated at all?\n\nPersonally I don’t…",
  "data/reddit-stocks/r/investing/comments/rjjtkj/is_tax_loss_harvesting_needed_if_i_am_not_selling.json": "Unfortunately, due to my visa issues, I am not able to get an account on any of\nthe automated investing platforms / robo advisors, many of which claim tax loss\nharvesting is a big advantage. So I just have a regular brokerage account that I\nmake trades on.\n\nAssuming that I never sell at all. Do i…",
  "data/reddit-stocks/r/investing/comments/rjsgql/can_tiktok_impact_the_bottom_lines_for_meta.json": "Maybe I do not know Tiktok well enough, but it doesn't have a hook like facebook\ndoes to get people to come back. Even though people do not use facebook.com\n[https://facebook.com] as much, people are still using messenger for messaging\ntheir friends or whatsapp or Instagram. Tiktok is more similar…",
  "data/reddit-stocks/r/investing/comments/rjzt62/are_option_trading_and_future_trading.json": "Obviously options are derivatives of stocks and futures are derivatives of\nnatural resources, but in terms of how they’re traded, the risks involved, and\nhow they’re prices its more or less the same right?\n\nAs in, the leverage is similar, you’re betting on what the price will be at a\ndate, you can…",
  "data/reddit-stocks/r/investing/comments/rk0i6w/dollarcost_selling_during_the_dip_is_this_my_best.json": "I've over-invested to a point where I'm going to need the funds I've invested\nfor living expenses (please ignore this mistake of mine for the sake of this\npost).\n\nI've still made about 20% profits. I'm looking to sell about 30% of my\ninvestments to give me more runway. I'm thinking dollar-cost…",
  "data/reddit-stocks/r/investing/comments/rk4udc/only_4_of_us_stocks_from_19262016_outperformed.json": "There is an academic paper written by Hendrik Bessembinder that analyzes the\nreturns of individual U.S stocks from 1926-2016. It can be accessed here:\nhttps://papers.ssrn.com/sol3/papers.cfm?abstract_id=2900447\n\nIn the paper he concludes that from 1926-2016:\n\n 1. just 42.6% of common stocks have a…",
  "data/reddit-stocks/r/investing/comments/rkael6/investing_in_a_restaurant_shares_will_decrease.json": "Hi, as stated in the title, I'm investing in the opening of a restaurant (5%).\nthe contract says that I will own 5% until my principal is earned back, then\ndown to 2.7% for the next 2 years, then 1.6% afterwards. The reason I was told\nis that those shares will be distributed to employees and…",
  "data/reddit-stocks/r/investing/comments/rkgqcl/does_anyone_else_find_themselves_addicted_to.json": "I mean, it's just such a satisfying feeling buying more and more things. I'm a\nlong term holder so any time I have spare money I just stick it into one of my\ninvestments. I honestly at times feel like it's an urge almost, like that\nfeeling of longing you get when you want to eat junk food or…",
  "data/reddit-stocks/r/investing/comments/rksu67/wash_sale_question_on_different_quantities_of.json": "I think I am familiar with the wash sale related to buying a security within 30\ndays before or after realizing a loss on it and there are plenty of websites out\nthere that explain it and give examples.\n\nOf the dozen websites I have combed through I have not been able to find the\nanswer to my…",
  "data/reddit-stocks/r/investing/comments/rkvswe/boring_subsectorsniche_industries_that_interest.json": "I recently bought some shares of Vontier, which owns Gilbarco Veeder-Root, a\ncompany that makes gas pumps and gas nozzles.\n\nWhen I was at the gas station last night, I looked to see if the pump and nozzle\nwere made by Gilbarco. The pump said it was made by a company called Wayne (“a\nGE Energy…",
  "data/reddit-stocks/r/investing/comments/rky6mr/usdtry_plummets_25_from_ath_after_government.json": "So basically Turkish president announced a new savings accounts where you will\nget the regular interest + difference in USDTRY gain at maturity if you save\nyour money in Turkish lira. They will aim to achieve this by printing more TRY.\n\nExample. You sold 10 USD for 100 TRY. Kept it in TRY savings…",
  "data/reddit-stocks/r/investing/comments/rld9k1/is_the_market_finally_in_a_covidvariant_driven.json": "I have been a bit conservative in my investments - most of it in Dividend paying\nstocks and Mutual Funds. The portfolio rebound nicely after pandemic-lockdowns.\nWatching the market now leaves me a bit of jittery - Transport and healthcare\nsectors have been hit hard, dipping over 10-15% in the past…",
  "data/reddit-stocks/r/investing/comments/rlh6ow/question_best_tools_and_resources_for_stock.json": "Curious to find out what are some of the best tools for stock research and\noverall DD that most people are using.\n\nThis is what I'm currently using:\n\nFintel: https://fintel.io/\n\n * Fintel is my go-to to find short interest and institutional ownership data.\n\nOpen Insider: http://openinsider.com/\n\n *…",
  "data/reddit-stocks/r/investing/comments/rlhkvq/time_to_consider_the_russell_2000_again.json": "Back around 2007-2012 I had an IRA index fund following the Russell 2000. I\ndon't remember the name of it, but it did very well compared to the overall\nmarket but when it started slipping I re-allocated to VFIAX and have done well\nsince.\n\nJust looking at chart, the R2K has well underperformed the…",
  "data/reddit-stocks/r/investing/comments/rlx3sf/alternative_to_vanguard_for_index_fund_matching.json": "Okay, I went to sign up for Vanguard with the plan to put money into one of\ntheir index fees, was fine with one that either mirrored the whole market or\nmirrored the S&P 500\n\nThere were some technical issues getting it set up. I called in, apparently they\nare having technical issues with anyone who…",
  "data/reddit-stocks/r/investing/comments/rm1rsf/new_american_laws_will_force_companies_to_delist.json": "https://www.reuters.com/markets/asia/brace-600-bln-chinese-escape-new-york-2021-12-22/\n\n\n\n> HONG KONG, Dec 22 (Reuters Breakingviews) - The party’s over for Chinese\n> companies in New York. They’re being squeezed by lawmakers in both Beijing and\n> Washington over data protection, accounting…",
  "data/reddit-stocks/r/investing/comments/rm21tk/daily_general_discussion_and_advice_thread.json": "Have a general question? Want to offer some commentary on markets? Maybe you\nwould just like to throw out a neat fact that doesn't warrant a self post? Feel\nfree to post here!\n\nIf your question is \"I have $10,000, what do I do?\" or other \"advice for my\npersonal situation\" questions, you should…",
  "data/reddit-stocks/r/investing/comments/rm348q/us_imposes_sanctions_on_large_potash_supplier.json": "Potash crucial nutrient for crops\n\nBPC (Belarus Potash Company) is the worlds second largest potash producer.\n\nPrices for Potash already at 13 year high\n\nWorlds largest supplier of Potash is Nutrien Ltd in Canada, they are expected to\noffset some of the supply needed.\n\nNutriens (NTR) stock price…",
  "data/reddit-stocks/r/investing/comments/rm3s3f/etfs_still_good_investment_option_in_202122.json": "I get my building loan contract payed out and I wanted to invest it, since I\ndon’t need the money right now (I already saved up my emergency fund of ~4x my\nmonthly income). The last time I informed myself about investment options I\nfound ETFs to be the right investment option for me. - I‘m planning…",
  "data/reddit-stocks/r/investing/comments/rmirc9/is_inflation_good_for_equities_because_there_are.json": "What's the overall verdict? I'm sure the answer lies in the middle.\n\nHaving to pay employees more (at corporations/companies who do attempt to give\ncost of living raises) and having your entire supply chain cost more is a\nproblem. Can you pass 100% of the inflation-related expenses on to…",
  "data/reddit-stocks/r/investing/comments/rmllyx/why_are_ecommercepayments_stocks_down_over_the.json": "As the title reads, does anyone have any thoughts as to why are\ne-commerce/payments stocks (such as Square, Shopify, Paypal, Mercadolibre, Sea\nLtd., Lightspeed etc.) are down ~30% since mid-November? The Nasdaq has pretty\nmuch been flat over the same period.\n\n\n\nDo you think this is a buying…",
  "data/reddit-stocks/r/investing/comments/rmwfub/why_does_lower_future_pe_ratio_mean_earnings_will.json": "I read this on investopedia:\n\"If the forward P/E ratio is lower than the trailing P/E ratio, it means\nanalysts are expecting earnings to increase; if the forward P/E is higher than\nthe current P/E ratio, analysts expect them to decrease\"\n\nWhy?\nIf the company is estimating that their own earnings…",
  "data/reddit-stocks/r/investing/comments/rnd5l4/would_you_take_this_deal.json": "WE’VE OWNED PRIME COMMERCIAL REAL ESTATE (~40 ACRES APPRAISED FOR 3.3 MILLION)\nFOR OVER 30 YEARS. WE SOLD HALF AN ACRE WAY IN VERY BACK, IN 1998, TO SOME\nRANDOM COMPANY THAT IS STILL AROUND TODAY FOR $120K. THAT’S IT. HALF IS\nCURRENTLY LEASED FOR 18 MONTHS FOR $8,000/MONTH TO A RANDOM FREIGHTER…",
  "data/reddit-stocks/r/investing/comments/rni8hz/taking_smaller_short_term_capital_gains_over.json": "Say you work for a company that gives you shares every quarter. These shares are\ntaxed at income before given to you, so if the company gives you 10 shares,\nyou’ll actually get around 6 shares in your account after shares are sold to pay\ntaxes.\n\nMy question: Would you sell newly acquired shares if…",
  "data/reddit-stocks/r/investing/comments/rnk3li/where_can_i_put_my_money_to_just_sit_and_slowly.json": "I’m 19 and yesterday I decided to be more responsible and serious about life\n\nI currently don’t pay any bills or have any expenses so everything I make is\nmine besides taxes\n\nI can literally take 100$ out of my paycheck and stash the rest away , I get\npaid every 2 weeks\n\nI was thinking Berkshire…",
  "data/reddit-stocks/r/investing/comments/rnpnpu/can_i_have_multiple_solo_401k_accounts_at.json": "Can I have multiple Solo 401k accounts at different brokerages? I'm not saying\ngoing over the contribution limits or doubling the contribution limits. If I\nhave a solo 401k with an advisor that I funded in previous years but not this\nyear, can I open a solo 401k for the same LLC and fund that one…",
  "data/reddit-stocks/r/investing/comments/rnq4s1/psa_charitable_donations.json": "As is typical at the end of each year - we have seen a lot of tax harvesting\nquestions as well as questions about reducing capital gains taxes.\n\nIf you are in the US and you have done well with your investing. Perhaps you\nlearned something new in r/investing [/r/investing] or improved your gains…",
  "data/reddit-stocks/r/investing/comments/rnttzl/folks_who_are_always_bearish_where_do_you_invest.json": "Folks who are always bearish, where on earth do you keep your money?\n\nI've doing this for a long time (since 90s) and certainly have seen rough\nstretches. In fact, I was a derivatives trader at RBC during the dot.com\nimplosion. But on a whole, I've never left the market and have been very…",
  "data/reddit-stocks/r/investing/comments/rodur5/converting_taxable_account_to_roth_ira_does_this.json": "My parent has money in a taxable account as well as an IRA they are forced to\ntake minimum distributions on. They know they will be leaving me some of this\nmoney, and we have been discussing how to make the most of it.\n\nOur planning has mainly been centered around getting this after-tax money…",
  "data/reddit-stocks/r/investing/comments/rol1ez/ive_got_10000_i_want_to_invest_in_the_sp_500_for.json": "Hello! I'm overwhelmed with the number of apps and options for something this\nsimple.\n\nI've got no interest in interesting in individual stocks. I just want to put my\nsavings into the S&P 500. I can't find an easy comparison of how much apps will\ncharge me to invest this (and more each year).\n\nAnd…",
  "data/reddit-stocks/r/investing/comments/rpb8cq/just_received_my_inheritance_whats_a_good.json": "Hi I’m 20 years old and just received my inheritance it’s somewhere shy of\n$200,000, i’m wondering what the best asset location would be for me to not only\nbe able to receive a quarterly or monthly check to help out with my monthly\nexpenses but also be able to reasonably grow the account while…",
  "data/reddit-stocks/r/investing/comments/rpbt32/chinas_new_vie_rule_eases_concerns_about_overseas.json": "https://www.scmp.com/business/china-business/article/3161045/chinas-new-vie-rule-eases-concerns-about-overseas-ipos?module=perpetual_scroll_0&pgtype=article&campaign=3161045\n\n\n\n> China’s securities watchdog published a new draft regulation stating companies\n> can list overseas as variable interest…",
  "data/reddit-stocks/r/investing/comments/rphlq7/bubblicious_used_car_prices_are_rising_faster.json": "https://www.cnbc.com/amp/2021/12/26/bubblicious-used-car-prices-rising-faster-than-bitcoin-jim-bianco-warns-.html\n\n\"In the last four months, they've gone up in price more than 20%. Not only is\nthat more than the S&P, but over the last four months that's more than bitcoin\nitself,\" he said. \"As of…",
  "data/reddit-stocks/r/investing/comments/rpqn8i/what_do_you_think_about_inflation_linked_us.json": "You can buy up to $10,000 Inflation linked US Treasury bonds per person per\ncalendar year and I am considering doing so before the year ends.\n\nThe interest on these bonds is a combination of the base interest (which is 0%\nnow) and inflation. The current interest rate is 7.12%, compounded\nsemi…",
  "data/reddit-stocks/r/investing/comments/rpqqfk/us_vs_the_rest_of_the_world.json": "In the past year US market outperformed (by far) pretty much everything else,\nincluding the Japanese Nikkei, the Korean KOSPI, and the EU (DAX, etc).\n\nComparing, for example, NASDAQ vs. KOSPI performance year-to-day the former is\nup 25% while the latter is actually down 0.5%.\n\nS&P500 vs. DAX - the…",
  "data/reddit-stocks/r/investing/comments/rpz3vb/a_business_i_started_seven_years_ago_with_some.json": "I already swallowed the hard pill of learning I’m not a good trader, luckily it\nonly took about 10k for that to sink in. I have a vanguard I buy SPY with each\nmonth but I want to hand the money over to a professional or continue in index\nfund trading. I am worried of getting myself into something…",
  "data/reddit-stocks/r/investing/comments/rqimmg/quantum_computing_is_it_a_good_time_to_invest.json": "Hello everyone, I’m new to this sub and I’m quite interested in investing in\nquantum computing. This article\n[https://frontierresearch.com/quantum-computing/?r=1] piqued my interest and I\nwas wondering if this is a good time or if it’s still too early. So some\nbackstory, 6 months ago I saw…",
  "data/reddit-stocks/r/investing/comments/rqncyx/dont_do_a_back_door_roth_girlfriends_financial.json": "Why would a financial advisor suggest not doing a Back Door Roth (BDR)?\n\nGirlfriend is W2 and exceeds Roth income limits. We got on a conference call and\nhe (tried) to explain his logic that her account balance is such than the 6k\nRoth limit is just over 1% of her IRA balance and therefore she…",
  "data/reddit-stocks/r/investing/comments/rqr9r3/what_physical_assets_should_i_purchase_with_my.json": "I buy and sell stuff on eBay. It's fun and I've been doing it for years. Its\nliterally a hobby for me and I make about 3-5k a month in profit. It is an LLC\nand I file it as an S Corp (I'm a tax accountant).\n\n2020 was insane, I made about 100k in Q4 alone. I did everything possible to\nincrease my…",
  "data/reddit-stocks/r/investing/comments/rqu28y/how_is_the_solar_sector_looking_in_the_long_term.json": "Is the general consensus that things like the TAN etf are generally a safe long\nterm bet over the next 5-10 years? How do you all feel about the different\ncontinental markets? Europe looks like it is mostly full steam ahead with North\nAmerica lagging behind because of lobbiest and resistant to…",
  "data/reddit-stocks/r/investing/comments/rqxwr8/telecommunications_is_it_a_good_time_to_invest.json": "Like many, it seems like now is a good time to move some investments from growth\nto value (at least large-cap, value).\n\nThe telecommunications sector has really suffered over the last 5-10 years.\nLooking at AT&T (and Verizon) both have remarkably low PEs, even projecting out\n5-10 years. They also…",
  "data/reddit-stocks/r/investing/comments/rr64hw/just_a_general_gripe_about_the_uiux_of_the_way.json": "When I log into my portfolio, etrade (and other platforms) prominently show\n“today’s gain” and “today’s change.”\n\nKnow what I want to see? “ Week change” or “Month gain” or “YTD change.”\n\nI know if I got into the “account performance” tab, I can find some basic stats\nabout yearly or monthly…",
  "data/reddit-stocks/r/investing/comments/rramzc/thoughts_on_giving_advice_to_my_father.json": "Hey all, my 80 year old dad is asking me what to do with his nest egg and I'd\nlike thoughts from you.\n\nHe's got about $200k, with about 25% in an S&P fund and the rest in cash. He\ndoesn't touch it, he lives off social security exclusively, so he's willing to\ntake on some risk. I'm not sure what to…",
  "data/reddit-stocks/r/investing/comments/rrekxm/what_are_some_ways_to_invest_in_home_insulation.json": "I suspect that more extreme weather will motivate people to upgrade their\ninsulation to lower energy bills.",
  "data/reddit-stocks/r/investing/comments/rrfo14/fundamental_valuation_models_of_ethereum.json": "Too Long; Didn't Read\n\nEther, the token of the Ethereum network is a yielding asset. We can calculate\nan intrinsic value for the ETH token using traditional finance valuation models.\n\nYou can find these in the following spreadsheet\n[https://docs.google.com/spreadsheets/d/1_r4DVzqWgoP7k0y…",
  "data/reddit-stocks/r/investing/comments/rrrvqo/getting_data_for_defining_an_equities_portfolio.json": "I want to do more work to try and get better yields by picking my own portfolio\nof 15-20 stocks for the equities portion of my investments. I am underemployed,\ndoing ok financially, and having alot of success using risk models in\nexcel/matlab for semiconductor design (nothing financial- just deep…",
  "data/reddit-stocks/r/investing/comments/rry8o3/daily_general_discussion_and_advice_thread.json": "Have a general question? Want to offer some commentary on markets? Maybe you\nwould just like to throw out a neat fact that doesn't warrant a self post? Feel\nfree to post here!\n\nIf your question is \"I have $10,000, what do I do?\" or other \"advice for my\npersonal situation\" questions, you should…",
  "data/reddit-stocks/r/investing/comments/rsc9mj/why_does_the_stock_market_make_significant_moves.json": "Yes, I know many of us on this board are looking at the long run and don't care\nabout day-to-day movements in the stock market. But watching the total stock\nmarket funds and individual stocks move up and down during the day is so\ninteresting.\n\nOne thing that has caught my eye today and other days…",
  "data/reddit-stocks/r/stocks/comments/r5xmuy/about_the_fed_increasing_rates.json": "So this seems to be the topic for today and I'm rather uneducated about it I\ndecided to do some basic research.\n\nOne of the things I found was this:\nhttps://www.macrotrends.net/2015/fed-funds-rate-historical-chart\n\nI was looking for a co-relation between the stock market and rates, but\nbasically…",
  "data/reddit-stocks/r/stocks/comments/r5ychh/here_is_a_market_recap_for_today_tuesday_nov_30.json": "PsychoMarket Recap - Tuesday, November 30, 2021\n\nUnfortunately, after a brief bounce in the market yesterday, volatility resumed\nas market participants continue to contemplate the potential impact of the new\ncoronavirus ‘Omicron’ variant and new comments by newly re-elected Federal\nReserve Chair…",
  "data/reddit-stocks/r/stocks/comments/r5yk9n/do_you_have_a_roth_ira_in_addition_to_a_regular.json": "I'm thinking that a good number of you have a Roth IRA, and you're taking\nadvantage of what a Roth IRA provides an investor/trader.\n\nBasically, it works like this. Do you think you'll be alive when you're 60 years\nold? (Yes?/No?). If you think you'll be alive, do you think you'd like to be\nable to…",
  "data/reddit-stocks/r/stocks/comments/r5zseg/att_sees_slower_wireless_growth_sending_stock_to.json": "(Bloomberg) -- AT&T Inc. shares fell to a 12-year low Tuesday after Jeff\nMcElfresh, the company’s chief executive officer of communications, told\ninvestors at a conference that he expects customer growth to slow.\n\nThe surge in new customers this year, fueled in part by free phone offers…",
  "data/reddit-stocks/r/stocks/comments/r6071n/intel_as_a_longterm_investment.json": "I'm pretty new to stock trading, so don't hesitate to point out anything I\nomitted that you think would be worth mentioning regarding Intel.\n\nSo Intel seems to be one of those tech underdogs who no one thinks will perform\nwell in the future because they haven't been innovative at all in the past…",
  "data/reddit-stocks/r/stocks/comments/r61fvx/2021_mantra_buy_the_dip.json": "A lot of people have been talking about buying the dip in the morning and making\ndecent returns from it. I decided to backtest how good \"Buy the Dip\" could be\nintra-day\n\nHere is my setup:\n\nEnter (3min bars)\n\n * I took 11 stocks from yahoo article named \"11 Best Covid Vaccine Stocks\"\n * Each day I…",
  "data/reddit-stocks/r/stocks/comments/r64i8s/the_best_brokerage_is_not_the_one_with_the_best.json": "Up to January this year, I used to have a Fidelity account to mostly trade\nstocks and about two years ago started trading Options. After filling out some\nforms , Fidelity gave me Level 1 privileges which as you know you cannot do much\nother than selling covered calls, buy-writes. After a few months…",
  "data/reddit-stocks/r/stocks/comments/r65tzh/dis_bear_case_disney_has_upside_potential_but_i.json": "I know I will probably get downvoted heavily for this, but I want to provide a\ncontrarian view here and would love to discuss further in the comments with\nanyone who agrees or disagrees (I’m very open to changing my mind).\n\nI believe that the best industries to invest in for the long run are media…",
  "data/reddit-stocks/r/stocks/comments/r694ul/stocks_you_cant_wait_to_see_dip_because_youre.json": "Title says it all. With some FUD in the market right now due to a combination of\nOmicron, inflation concerns, overvaluation, tapering, etc., are there any stocks\nyou’re just waiting to fall so you can swoop in and buy them at a cheaper (and\npossibly fairer) price? I know I have a few…\n\n1) ADBE: My…",
  "data/reddit-stocks/r/stocks/comments/r69z5l/is_nvda_a_good_buy_right_now.json": "Hey there guys, I just started analyzing stocks more and I thought I´ll try to\ndo that and post it here. That´s my first analysis for NVDA. If you have any\nfeedback for me that would be great and highly appreciated. If you have\nquestions feel free to ask, I´ll try to answer everything.\n\nToday we…",
  "data/reddit-stocks/r/stocks/comments/r6btk6/rstocks_daily_discussion_wednesday_dec_01_2021.json": "These daily discussions run from Monday to Friday including during our themed\nposts.\n\nSome helpful links:\n\n * Finviz [https://finviz.com/quote.ashx?t=spy] for charts, fundamentals, and\n   aggregated news on individual stocks\n * Bloomberg market news [https://www.bloomberg.com/markets]\n *…",
  "data/reddit-stocks/r/stocks/comments/r6ek42/private_payrolls_post_betterthanexpected_growth.json": "https://www.cnbc.com/2021/12/01/adp-november-2021.html\n\n-Private payrolls increased by 534,000 for November, better than the Dow Jones\nestimate of 506,000, according to ADP.\n\n-Leisure and hospitality saw a gain of 136,000, part of the 424,000 positions\nadded in the services sector.\n\n-Companies…",
  "data/reddit-stocks/r/stocks/comments/r6jlxk/what_is_happening_with_se_sea_ltd.json": "I've been invested in this company since March this year and have seen steady\ngrowth with some dips that never worried me.\n\nHowever now, after its earnings in early November, the company has been dropping\nlike a stone and is 23% down since then (and 6% just today!)\n\nThe earnings were mostly good,…",
  "data/reddit-stocks/r/stocks/comments/r6kw6w/anyone_else_getting_destroyed_by_airlines.json": "AAL, DAL, UAL were all on their usual dip/run-up prior to the new variant news.\nPerfect buy opportunities start of last week.\n\nAnyone else here getting their portfolios wrecked?\n\nI currently run covered calls on AAL, and it hurts. I'm not impulsive enough to\nsell, because I know airlines are doing…",
  "data/reddit-stocks/r/stocks/comments/r6my4u/jim_cramer_says_hes_not_ready_to_take_profits_in.json": "CNBC’s Jim Cramer said Wednesday he’s not ready to sell any shares Nvidia yet,\neven though he recently booked some profits in two other big charitable trust\nwinners Advanced Micro Devices and Ford.\n\nhttps://www.cnbc.com/2021/12/01/cramer-says-hes-not-ready-to-sell-nvidia-sees-stock-at-10-trillion…",
  "data/reddit-stocks/r/stocks/comments/r6o44k/shouldnt_longterm_holders_be_happy_with_the.json": "I browse the daily stocks thread and there seems to be a lot of reaction to any\nsort of movement. Correct me if I'm wrong but my guess is that these comments\nare made by either inexperienced investors (like myself) or those looking to\ntrade rather than invest.\n\nIf it's a long-term investment surely…",
  "data/reddit-stocks/r/stocks/comments/r6o8i1/american_satellites_are_subject_to_daily_attacks.json": "What Happened: In an interview with Washington Post columnist Josh Rogin, Gen.\nDavid Thompson, vice chief of space operations for the new military branch,\naccused the Chinese and Russians of using lasers, radiofrequency jammers and\ncyberattacks against U.S. satellites.\n\n> “The threats are really…",
  "data/reddit-stocks/r/stocks/comments/r6odur/markets_like_this_are_the_exact_reason_why_you.json": "I saw a post earlier on this sub justifying 100% portfolio in TQQQ. TQQQ has\nbeen back tested for Dot com bubble. It would have taken 2 decades to get your\noriginal investment back if you bought at the peak of Dot com bubble.\n\nLeveraged ETS work when there is Euphoria, but it can literally wipe you…",
  "data/reddit-stocks/r/stocks/comments/r6pwhr/payments_giant_square_will_change_its_corporate.json": "Square is renaming itself Block as it focuses on technologies like blockchain\nand expands beyond its original credit card reader business.\n\nJack Dorsey’s payments giant said in an announcement the new name, effective\nDec. 10, “acknowledges the company’s growth” and “creates room for…",
  "data/reddit-stocks/r/stocks/comments/r6qvpw/omicron_is_hurting_markets_but_not_for_the_reason.json": "Ever since the announcement of Omicron last week, markets have been experiencing\nmore volatility. At first, it seemed scary on Thanksgiving when news break of\nthe high number of mutations. but now it's turning out to be a milder version of\nDelta. Us retail investors are thinking, \"why panic over a…",
  "data/reddit-stocks/r/stocks/comments/r6ruru/here_is_a_market_recap_for_today_wednesday_dec_1.json": "PsychoMarket Recap - Wednesday, December 1, 2021\n\nWhipsaw session today in the market. After opening higher in the morning stocks\nslid steeply downwards as market participants digested new remarks from Fed\nChair Jerome Powell and new concerns surrounding the coronavirus ‘Omicron’\nvariant, with the…",
  "data/reddit-stocks/r/stocks/comments/r6sc1c/citi_6_pe_ratio_and_32_dividend_whats_wrong_with.json": "Some bull case points:\n\n * On Tipranks the average upside is 36% (although most of the ratings were\n   given 2 months ago).\n * Morningstar gave it a fair value of $83. It currently trades at $62.\n * It's down 13% in the last 3 months.\n * Compare to Bank of America which has 13 pe ratio and 1.69…",
  "data/reddit-stocks/r/stocks/comments/r6wbpi/do_any_of_you_have_100_of_your_money_in_the_market.json": "Being all in means higher highs, but also greater unrealized losses from time to\ntime. I’m curious as to what percent of you don’t have cash positions. In other\nwords, all of your money is in play. Particularly you income traders who sell\nCCs and puts.",
  "data/reddit-stocks/r/stocks/comments/r6ygbi/visa_and_mastercard.json": "Tickers: VISA, MA\n\nThey are both down 20%+ from their highs this year, improving the margin of\nsafety. They still have a huge moat (each of these companies maintain operations\nin 200+ countries).\n\nBoth have a small dividend. Visa authorized an increase in theirs last week,\nwith Mastercard doing the…",
  "data/reddit-stocks/r/stocks/comments/r701rh/mega_caps_completely_control_this_market_and.json": "So we now know that anything that's not a behemoth of a company or one that's in\nsemiconductors/EV isn't worth their weight in dog shit anymore, but small cap\ninvestors should prepare for a lot more potential pain.\n\nThe market has been hollowing out for months, transferring money from small &\nmid…",
  "data/reddit-stocks/r/stocks/comments/r71ovx/how_do_i_get_started.json": "So I am young, I just got my first well paying job out of college, and I have\nabout $15,000 sitting in my checking account doing nothing.\n\nI’d like to start investing but have no idea how, I don’t understand any of the\nlingo or acronyms commonly used on this sub. I’d like to learn how to do…",
  "data/reddit-stocks/r/stocks/comments/r730d0/is_pypl_a_good_buy_right_now.json": "Hey there guys, I just started analyzing stocks more and I thought I´ll try to\ndo that and post it here. That´s my first analysis for PYPL. If you have any\nfeedback for me that would be great and highly appreciated. If you have\nquestions feel free to ask, I´ll try to answer everything.\n\nToday we…",
  "data/reddit-stocks/r/stocks/comments/r74xzy/dow_futures_swing_higher_as_markets_grapple_with.json": "U.S. stock futures pointed to a stronger start Thursday, in what’s becoming an\nincreasingly volatile market due to uncertainty over the spread of coronavirus\nand the direction of interest rates.\n\nWhat’s happening\n\n * Futures on the Dow Jones Industrial Average YM00, +0.93% rose 327 points, or\n  …",
  "data/reddit-stocks/r/stocks/comments/r76kqs/british_fda_approves_vir_covid_drug_that_cuts.json": "New drug Sotrovimab is approved by MHRA (British version of FDA) for 12 and over\nwith mild-to-moderate Covid who is at risk of developing serious illness.\n\n * It is a drug developed in partnership by VIR biotechnology ($VIR) and\n   GlaxoSmithKline ($GSK).\n\n * VIR CEO\n  …",
  "data/reddit-stocks/r/stocks/comments/r77kwm/rocket_lab_reveals_neutron_launch_vehicles.json": "https://www.businesswire.com/news/home/20211202005534/en/Neutron\n\nLive streamed web event reveals detailed Neutron rocket architecture for the\nfirst time:\n\nNew Archimedes rocket engine designed for reliability and reuse Unique captive\n‘Hungry Hippo’ fairing design to enable streamlined first stage…",
  "data/reddit-stocks/r/stocks/comments/r78jjn/the_omicron_panic_is_overdone_buy_the_dips_in.json": "“Over the last several days markets have been in turmoil over the new COVID\nvariant omicron. However, data on omicron is sparse, information contradictory,\nand some media has been exaggerating risks and highlighting worst case\nscenarios,” chief global strategist Marko Kolanovic and quant strategist…",
  "data/reddit-stocks/r/stocks/comments/r79ylj/where_my_ladies_at.json": "Survey by S&P Global found that only 26% of American women have invested in the\nstock market and 65% have large assets in cash... probably preaching to the\nchoir here, but I think everyone in this sub knows how the value of our cash\ndrains away every day with inflation. Other studies (like one…",
  "data/reddit-stocks/r/stocks/comments/r7claj/to_the_current_bears_where_else_are_you_putting.json": "Cash accounts? inflation is going to eat that up.\n\nBonds/Savings? Not with the current interest rates.\n\nReal Estate? LOL yeah good luck buying a house $300,000+ more than what it's\nprobably worth.\n\nSo you sold all your stocks for the \"incoming crash\", where do you put it if not\nstocks? Even if you…",
  "data/reddit-stocks/r/stocks/comments/r7fdzg/alibaba_stock_hits_record_low_in_hong_kong_amid.json": "I thought I'll share this news here as I constantly see traders asking if they\ncan double down on BABA. I hope this was not posted earlier-\n\nAlibaba stock hit a record low in Hong Kong Thursday amid fears that the Chinese\ne-commerce giant may be forced to lose its primary listing in New York.…",
  "data/reddit-stocks/r/stocks/comments/r7i0ym/what_are_you_investing_in_and_why.json": "I'm a relatively young investor (21 years old) and I'm looking to diversify and\nexpand my portfolio. I have a decent range of investments, but I would like to\nget some advice on what y'all think is good and why. I would appreciate any\nhelp, thank you.",
  "data/reddit-stocks/r/stocks/comments/r7jomt/ftc_sues_to_block_nvidia_acquisition_of_arm.json": "Source\n[https://www.cnbc.com/2021/12/02/ftc-sues-to-block-nvidias-40-billion-acquisition-of-arm.html]:\n\n * “The proposed vertical deal would give one of the largest chip companies\n   control over the computing technology and designs that rival firms rely on to\n   develop their own competing chips,”…",
  "data/reddit-stocks/r/stocks/comments/r7kicf/what_are_some_growth_stocks_youll_be_avoiding_on.json": "Just as the title states, the past few weeks a lot of big growth names have been\nsold off like crazy. Everyone likes to talk about their favorite “buy the dip”\nplays, but what are the stocks you’re avoiding even after heavy selling?",
  "data/reddit-stocks/r/stocks/comments/r7kyzw/docu_sell_off.json": "Who’s buying? Huge sell off post earning. The guidance was lower than expected\nbut the growth looks promising and their revenue beat.\n\nMy gains turned into bags on this one but my conviction hasn’t changed, This is\nnot a fad COVID stock. Electronic signatures are the future so I see this as…",
  "data/reddit-stocks/r/stocks/comments/r7mmua/ride_hailing_giant_didi_said_it_will_start_the.json": "DiDi Global Inc. (the “Company”) (NYSE: DIDI), the world’s leading mobility\ntechnology platform, today announced that its board of directors (the “Board”)\nhas authorized and supports the Company to undertake the necessary procedures\nand file the relevant application(s) for the delisting of the…",
  "data/reddit-stocks/r/stocks/comments/r7npt0/didi_says_it_will_delist_from_the_new_york_stock.json": "https://www.cnbc.com/2021/12/03/didi-on-delisting-from-us-and-list-in-hong-kong.html\n\nChinese ride-hailing giant Didi said Friday that it will start delisting from\nthe New York Stock Exchange, and make plans to list in Hong Kong instead.\n\nIt comes less than six months after the tech giant listed in…",
  "data/reddit-stocks/r/stocks/comments/r7txiw/is_baba_a_good_buy_right_now.json": "Hey there guys, I just started analyzing stocks more and I thought I´ll try to\ndo that and post it here. That´s my first analysis for BABA. If you have any\nfeedback for me that would be great and highly appreciated. If you have\nquestions feel free to ask, I´ll try to answer everything.\n\nToday we…",
  "data/reddit-stocks/r/stocks/comments/r7w895/rstocks_daily_discussion_fundamentals_friday_dec.json": "This is the daily discussion, so anything stocks related is fine, but the theme\nfor today is on fundamentals, but if fundamentals aren't your thing then just\nignore the theme and/or post your arguments against fundamentals…",
  "data/reddit-stocks/r/stocks/comments/r7yl4f/biden_official_we_are_imploring_congress_to_pass.json": "https://edition.cnn.com/2021/12/02/business/inflation-chip-shortage-raimondo/index.html\n\nthe Biden administration is championing the CHIPS for America Act, a $52 billion\nbill that would encourage domestic semiconductor production and research.\n\n\"The shortage has exposed vulnerabilities in the…",
  "data/reddit-stocks/r/stocks/comments/r800y3/baba_cautionary_tale.json": "Just for fun look through this post from Aug 30 from OP who is questioning\nwhether shorting BABA is smart... BABA for the record is down like 26% since\nthat post (i.e. OP Was 1000% correct)\n\nhttps://old.reddit.com/r/stocks/comments/peqlpz/wouldnt_shorting_baba_be_a_no_brainer/\n\nSome top…",
  "data/reddit-stocks/r/stocks/comments/r80acr/us_adds_disappointing_210000_jobs_in_november_in.json": "The U.S. gained a lackluster 210,000 new jobs in November even though businesses\ntook more aggressive steps to hire people, a disappointing increase that shows\nthe worst labor shortage in decades is still a drag on the economic recovery.\nThe increase in hiring — the smallest in a year — was way…",
  "data/reddit-stocks/r/stocks/comments/r81g1m/just_wait_out_the_dips.json": "The majority of my stocks are down. They are all companies that are not going\nanywhere.(tencent, 3d systems, Rolls Royce,apple, ford etc) It's probably best\njust to hang tight and wait 2 plus years for them to go back up correct?\n\nThe only thing I do question is my ark - I feel that will only go up…",
  "data/reddit-stocks/r/stocks/comments/r823f2/how_can_we_simultaneously_be_in_a_bubble_and_a.json": "Is this something that happens periodically throughout history? The S&P 500 is\nnear a 52-week high but many growth stocks are at 52-week lows. How can there be\nso much divergence in the market? And, in your opinion, is it time to sell mega\ncap stocks and buy some beaten-down growth stocks and small…",
  "data/reddit-stocks/r/stocks/comments/r82o8d/when_we_see_red_we_should_buy_buy_buy.json": "What’s everyone buying today???\n\nJust snagged some PayPal, Square, MA, CRM, Disney, TWTR, FVRR, PENN, and a\nlittle more NET.\n\nI already have positions in these and plan to hold for 5+ years. Going long!\n\nI think Omicron will be just another layer of this Covid journey and we will\nmake it through.…",
  "data/reddit-stocks/r/stocks/comments/r831vv/long_awaited_mini_correction_is_here_whats_your.json": "I have been complaining about red days but when it's here, I am loading more of\ntech stocks. What about you?\n\nWith all the uncertainties like Omicron, hastened tapering of bonds etc, are you\nstill averaging on those slightly corrected stocks?\n\nIf so, what's the reason you are doing it?\n\nFor myself,…",
  "data/reddit-stocks/r/stocks/comments/r84116/ok_can_someone_explain_to_me_why_i_should_give_a.json": "I’m still a novice at stocks, and I’m not saying this to make a case for bulls\nor bears or whatever, but I genuinely don’t understand the overreaction to this\ndowntrend.\n\nIf I look at the 5 year chart, I see the same thing happened in March 2020,\nwhich was even WORSE at the time, but the markets…",
  "data/reddit-stocks/r/stocks/comments/r8560y/is_it_for_anyone_else_not_a_mini_correction_d.json": "I lost basically half of my portfolio in the past weeks, from being up 60% YTD\nto down 10%...\n\nI hold stocks like PLTR, Opendoor, Uranium etc.\n\nMy largest position PLTR is down from 28 a couple weeks ago to 18.\n\n\n\nI hope this will recover or if more tanking happens other sectors are hit since\nI…",
  "data/reddit-stocks/r/stocks/comments/r85rmo/cathie_wood_and_ark_invest.json": "I see a lot of hate here for Cathie Wood/Ark Invest and on most other social\nmedia platforms. With comments like “worst fund ever” or “look how bad X stock\npick has done, how do people even invest in them” etc.\n\nYet since inception (2014), ARKK has outperformed both the S&P500 and NASDAQ by\n100%+.…",
  "data/reddit-stocks/r/stocks/comments/r87cin/all_of_the_stocks_in_cathie_woods_ark_innovation.json": "https://www.cnbc.com/2021/12/03/all-of-the-stocks-in-cathie-woods-ark-innovation-fund-are-in-a-bear-market-except-2.html\n\nIt’s been a dismal week for Cathie Wood’s flagship fund, Ark Innovation, that’s\nleft nearly all of her holdings in bear market. Wood’s main exchange-traded\nfund, which trades…",
  "data/reddit-stocks/r/stocks/comments/r88nf8/where_exactly_do_you_buy_the_dip.json": "A lot of times, when I tried to buy the dip, the stock just keeps falling\nthrough the floor. When I think a stock can’t go any lower, an ugly surprise\nawaits for me. Where, exactly should I buy the dip? Under what circumstances?\nAny indicators, volume-wise, momentum wise?",
  "data/reddit-stocks/r/stocks/comments/r8as26/here_is_a_market_recap_for_today_friday_december.json": "PsychoMarket Recap - Friday, December 3, 2021\n\nStocks sank today to end the week lower, with technology and growth stocks\ncratering as market participants digested further updates regarding the Omicron\nvariant and recent marks made by Fed Chair Jerome Powell, alongside the Labor\nDepartment’s…",
  "data/reddit-stocks/r/stocks/comments/r8bsev/didi_plunge_20_on_delisting_note_going_short.json": "> Just five months after its debut, ride-hailing giant Didi Global said it plans\n> to withdraw from the New York Stock Exchange and pursue a Hong Kong listing, a\n> stunning reversal as it bends to Chinese regulators angered by its U.S. IPO.\n\nReaction was very clear: stock was down 22.17%, -$8.4…",
  "data/reddit-stocks/r/stocks/comments/r8e5yf/thoughts_on_nvda_during_this_pullback.json": "I’ve had a decent size holding of Nvidia for about six months. Roughly 50k. I\njust recently enlarged that position significantly and now we’re seeing\nturbulence. I know, poor timing. These recent events have me wondering what my\nfellow investors honestly feel about where Nvidia’s share price will…",
  "data/reddit-stocks/r/stocks/comments/r8l2e9/is_v_a_good_buy_right_now.json": "Hey there guys, I just started analyzing stocks more and I thought I´ll try to\ndo that and post it here. That´s my first analysis for V. If you have any\nfeedback for me that would be great and highly appreciated. If you have\nquestions feel free to ask, I´ll try to answer everything.\n\nToday we will…",
  "data/reddit-stocks/r/stocks/comments/r8ozpi/has_anyone_tried_a_strategy_where_they_do_the.json": "So, I was just reading the Intelligent Investor (updated 2004 version) and\nthere's a paragraph about how \"In February 2000, hedge-fund manager James J.\nCramer\" was basically pumping and hyping internet stocks and that putting $10000\ninto his picks would have left you with $597 by the end of 2002.…",
  "data/reddit-stocks/r/stocks/comments/r8rvd5/why_do_people_watch_cnbc_or_other_financial_news.json": "A couple days ago CNBC had Jim Chanos on who was short DKNG and he said they\ntraded at 30 times revenue. I have no issues with people shorting stocks or\nlisting bear cases in those talking head arguments. But that guy told a lie. Any\nsearch would show DKNG trades at 10-11 revenue at the…",
  "data/reddit-stocks/r/stocks/comments/r8s5na/why_is_everyone_suddenly_talking_about_tax_loss.json": "I've been on this sub for years, and of course it's something that's been\nbrought up occasionally from time to time. But this year, I'm seeing it ALL THE\nTIME. Everyone is constantly talking about tax loss harvesting and how they're\ntrying to use that to time the market and how stocks like BABA are…",
  "data/reddit-stocks/r/stocks/comments/r8stgc/is_it_risky_to_invest_in_some_tech_stocks_like.json": "I own Microsoft. I’m not selling it, but I looked at the past 20 years for\nMicrosoft and up until 5 years ago, the price never cracked into the 60s. 2016\nyou could buy the stock for 50 bucks a share. And the price had stated between\n20-50 dollars for the better part of 20 years. Now it’s 323?? If…",
  "data/reddit-stocks/r/stocks/comments/r8v3yc/shares_of_docusign_docu_traded_down_42_on_friday.json": "Quite a discount if you believe the transition from paper to digital agreements\nis enduring and expect growth to re-accelerate in the long-term as management\nrefocuses go-to-market efforts.\n\nThey beat on revenue but missed on billings. Management noted a shift in demand\nas pandemic tailwinds…",
  "data/reddit-stocks/r/stocks/comments/r8va3c/a_lot_of_you_are_new_1yr_investors_and_it_shows.json": "So many of y'all are seeing 5 - 10% dips and thinking this is the correction\nmany people are talking about or talking about buying these 'undervalued' dips.\nWhat you guys fail to realize is made clear when you zoom out on DocuSign. The\nlast year has inflated stocks 50-200% over the last two years.…",
  "data/reddit-stocks/r/stocks/comments/r8wero/are_smallcaps_undervalued_right_now.json": "All of them are down 60%-80% from their ATH and are trading near cash value.\n\nThey might be the play of 2022 again after a very weak year.\n\nhttps://www.forbes.com/sites/jasonbisnoff/2021/12/03/small-caps-and-global-banks-are-best-bets-for-2022-according-to-multi-trillion-dollar…",
  "data/reddit-stocks/r/stocks/comments/r8y5yz/pandemic_stocks_valuation_after_the_recent_selloff.json": "Source: https://twitter.com/charliebilello/status/1466873029716328448\n\nPrice to Sales ratio high -> today\n\n$ZM: 117 -> 14\n\n$LMND: 107 -> 24\n\n$PLTR: 46 -> 25\n\n$STNE: 44 -> 7\n\n$TWLO: 37 -> 16\n\n$PINS: 30 -> 10\n\n$DOCU: 41 -> 14\n\n$TWLO: 36 -> 16\n\n$ROKU: 34 -> 11\n\n$BYND: 30 -> 9\n\n$HOOD: 26 -> 9\n\n$CHGG:…",
  "data/reddit-stocks/r/stocks/comments/r8zv26/meta_etf_play_for_a_poor_waiter.json": "5 top holdings are 1. NVDA 2. RBLX 3. MSFT 4. FB 5. U (Unity)\n\npoor waiter here looking to diversify my portfolio and I've been looking at META\nETF, I think the companies holdings are the future of the internet and social\nmedia. I also think it's 50 million shares outstanding is pretty healthy but…",
  "data/reddit-stocks/r/stocks/comments/r94fvg/stocks_that_went_down_significantly.json": "Not sure which website would provide this information.. thought of asking the\nexperts and watchers here. What are those stocks (large, mid, small-cap) that\nwent down by over 20-30% in the recent bloodbath - that could be opportunities\nto enter/accumulate? Let us just share Top 5 or 10.",
  "data/reddit-stocks/r/stocks/comments/r95i48/chinese_media_talking_about_how_evergrande_has.json": "See: http://www.china.org.cn/business/2021-12/04/content_77910172.htm\n\nI can't find any source on this other than this, no articles anywhere, last time\nsomething like this happened... about a month ago when Evergrande apparently\nseemed unable to pay to some specific bond owner (a press release by…",
  "data/reddit-stocks/r/stocks/comments/r96rkw/buy_and_not_look_for_a_period_of_time.json": "looking back at some of my past trades/investments i'm realizing that most of\nthem did go in the direction i expected it to but it took some time to play out\n(avg 4-7 months). Of course i didn't have the patience to hold that long and\noften closed the position too early. I know it's risky but i'm…",
  "data/reddit-stocks/r/stocks/comments/r9f3t0/chinese_sec_says_it_had_constructive.json": "https://cnevpost.com/2021/12/05/chinese-securities-regulator-says-it-recently-had-constructive-communication-with-us-sec-pcaob/\n\nSome excerpts\n\n\"Recently, individual media reports that Chinese regulators will prohibit\ncompanies with variable interest entity (VIE) structures from listing abroad…",
  "data/reddit-stocks/r/stocks/comments/r9gllw/cathie_woods_ark_innovation_fund_is_in_a_bear.json": "> Wood’s main exchange-traded fund, which trades under ticker ARKK, fell 12.6%\n> this week, for its worst week since February. Ark Innovation dropped 5.5% on\n> Friday.\n\nShe also said \"her strategies are set to quadruple over the next five years,\nafter their underperformance this year.\"\n\nDo you buy…",
  "data/reddit-stocks/r/stocks/comments/r9idq4/with_many_growth_stocks_now_hitting_1year_lows.json": "We see many stocks, especially smaller mid-cap growth stocks, but even some\nlarger ones too like Paypal, Alibaba, soon to be MA and V, then of course\nsmaller caps, like Roku, PTON, DKNG, Chewy, PLTR, CRSR, that have already\nreached all time 1-year lows, with uneasy sentiment still to come, fear…",
  "data/reddit-stocks/r/stocks/comments/r9if6z/am_i_the_only_one_that_feels_the_spamming_of.json": "Yes I understand we’ve had several days of major market indices decline, some\nspeculative stocks in particular take heavy hits, but it just feels overwhelming\nthe consensus on Reddit and The Web is that this is, “the bubble popping”, or\n“massive correction”. Thoughts, please.",
  "data/reddit-stocks/r/stocks/comments/r9iiua/jefferies_china_is_a_better_shortterm_bet_than.json": "For investors looking at Asia ex-Japan, China is a better short-term bet than\nIndia, according to Christopher Wood, global head of equity strategy at\nJefferies.\n\n> In the short-term, I would favor China over India because India’s going to be\n> vulnerable to any Fed tightening, tapering scares\n\nThey…",
  "data/reddit-stocks/r/stocks/comments/r9kilu/is_50_tech_too_much_now.json": "I'm heavy in tech. Most of it is made up of:\n\n14% MSFT\n\n6.4% NVDA\n\n5% GOOGL\n\n6% AAPL\n\n4% ASML\n\nDo you think I'm too heavy tech for fed tapering and rising rates next year?\n\nI have the other 50% in\n\nCASH 10%\n\nTotal Market 6%\n\nUNH. 7%\n\nTMO SHW JPM TSLA (4%) INMD LIN HD (5.3%) NEE ODFL CRWD(2%) PANW…",
  "data/reddit-stocks/r/stocks/comments/r9kpze/what_are_your_thoughts_about_us_series_i_savings.json": "The series I US bonds are currently offering an interest rate of 7.12% through\nApril 2022. This seems very decent with all the inflation and market in the\nbubble conversation. I was researching a bit about them, and I only found pros\nthat I can relate to like- fixed interest, good for tax savings…",
  "data/reddit-stocks/r/stocks/comments/r9rgpl/youtubers_and_investing_be_careful.json": "\"This is not financial advice\" - Every youtuber ever.\n\nBut sign up with my Webull or Gemini or \"fill in the blank exchange\"\n\nI understand that all the youtubers need to have a disclaimer however they all\nknow that the picks they give, the opinions they make, and bias they have\ninfluence their…",
  "data/reddit-stocks/r/stocks/comments/r9s0wv/be_greedy_when_others_are_fearful.json": "Who is feeling greedy going into this week? Lots of buying opportunities and\narguably an oversold market. Omicron and inflation and supply chain issues- I\ndon’t think these will actually dent the overall market trajectory. I am feeling\noptimistic for 2022 and think a holiday rally might be right…",
  "data/reddit-stocks/r/stocks/comments/r9u46e/tail_wagging_the_dog_a_case_for_how_options.json": "I'm a short-term degenerate options trader(mostly intra-day, max few weeks),\nusually just an occasional lurker on this sub. This is a long post, so if you\nwant skip to the meat of it jump to, Feedback Loops.\n\nGiven the recent market volatility and all the theorizing around…",
  "data/reddit-stocks/r/stocks/comments/r9v4tf/if_tesla_were_to_make_an_announcement_on_december.json": "If you haven’t heard, there’s speculation going around that Elon will make an\nannouncement on December 9th with what people believe have been clues he’s been\nleaving in Tweets, like he has before with other announcements. The vast\nmajority believe that if so, it will be a stock split announcement.…",
  "data/reddit-stocks/r/stocks/comments/r9xqr1/advice_on_how_to_invest_14k_for_someone_young.json": "A close friend who's 22 and financially illiterate and averse to the notion of\ninvesting, is sitting on 14k.\n\nIt toke a lot of patience, but I finally convinced him that having that kind\nmoney sitting in a bank and diminishing in value was a bad idea.\n\nHe opened a Wealthsimple account and is ready…",
  "data/reddit-stocks/r/stocks/comments/ra2id8/evergrande_is_back_in_the_news_asian_markets.json": "Shares were mixed in Asia on Monday after troubled Chinese property developer\nEvergrande warned late Friday it may run out of money. Hong Kong dropped 1.2%\nbut the Shanghai Composite index rose. South Korea’s benchmark advanced but\nTokyo and Sydney declined. More broadly, investors are struggling…",
  "data/reddit-stocks/r/stocks/comments/ra4a8w/rstocks_daily_discussion_monday_dec_06_2021.json": "These daily discussions run from Monday to Friday including during our themed\nposts.\n\nSome helpful links:\n\n * Finviz [https://finviz.com/quote.ashx?t=spy] for charts, fundamentals, and\n   aggregated news on individual stocks\n * Bloomberg market news [https://www.bloomberg.com/markets]\n *…",
  "data/reddit-stocks/r/stocks/comments/ra5xex/any_reason_semiconductor_stocks_are_not_a_good.json": "I’m assuming it’s just because of the general market, but soxx didn’t seem to\ndrop until Cramer and his followers dumped AMD stock. But I noticed even nvidia\nis down. With the shortage, shouldn’t these stocks be good bargains right now?\nAm I missing something?",
  "data/reddit-stocks/r/stocks/comments/ra6i01/theres_been_a_complete_reversal_of_sentiments.json": "It’s just a peculiar thing, how people can do a complete 180 about something\nthey were so convinced of before hand. anyway, what’s changed from last year to\nnow? how has she gone from a revolutionary, daring, intelligent figure to a\ncrazy lady shouting about Jesus with billions of dollars?",
  "data/reddit-stocks/r/stocks/comments/ra90jz/sec_probes_tesla_over_whistleblower_claims_on.json": "Reuters link\n[https://www.reuters.com/markets/commodities/exclusive-sec-probes-tesla-over-whistleblower-claims-solar-panel-defects-2021-12-06/]\n\nThe U.S. securities regulator has opened an investigation into Tesla Inc\n(TSLA.O) over a whistleblower complaint that the company failed to…",
  "data/reddit-stocks/r/stocks/comments/raalvd/the_greatest_generational_wealth_transfer_in_the.json": "Boomers are no longer in the wealth accumulation phase, they are in the wealth\npreservation stage as they begin to spend down investments built up over a\nlifetime.\n\nMillennials are in the wealth accumulation phase, but there is a big difference\nbetween how Boomers saved and how Millennials are…",
  "data/reddit-stocks/r/stocks/comments/rad9u6/esg_is_total_bs_and_nestlé_is_proof.json": "I think a skeptical mindset is of great benefit when it comes to investing in\nstocks, and I’ve been skeptical of ESG ratings since the first time they were\never mentioned.\n\nI tried to think of a way to prove that they were hogwash, by checking the ESG\nscore of an “evil” company. Nestle has misled…",
  "data/reddit-stocks/r/stocks/comments/radug2/amazon_or_vtivoo.json": "Hi All. I purchased 2 shares of Amazon in October 2020 with some money that I\nreceived as a gift. I am wondering if I should sell one share, and buy something\nlike a split of VTI/VOO, or if I am better off holding both shares of AMZN. I am\nfine with either scenario holding for long.\n\nAny thoughts?…",
  "data/reddit-stocks/r/stocks/comments/rag1su/who_here_has_consistently_beat_the_sp500_for_more.json": "After getting my ass kicked by individual stocks a few years ago I went all-in\non the S&P. This decision suited my portfolio well but admit the urge to take my\nchances hopping on the next tesla is always there.\n\nWho here has consistently beat the market? not just for one year but let's say\n3-6 ish…",
  "data/reddit-stocks/r/stocks/comments/rag88b/the_greatest_wealth_transfer_in_history.json": "This is in response to a comment earlier about millennial buying the assets\nboomers are selling. If we are talking about current stocks I would argue the\nopposite is happening. Stocks are so expensive (both in P/E and nominal\npricing). Because housing and stocks weren't truly allowed to collapse…",
  "data/reddit-stocks/r/stocks/comments/raj2ox/baba_rebound_on_restructure_of_ecommerce_business.json": "> It will form two new units - international digital commerce and China digital\n> commerce which it said was part of efforts to become more agile and accelerate\n> growth.\n> \n> The international digital commerce unit will include AliExpress which sells to\n> retail buyers particularly in Europe and…",
  "data/reddit-stocks/r/stocks/comments/rallm4/here_is_a_market_recap_for_today_monday_december.json": "PsychoMarket Recap - Monday, December 6, 2021\n\nAfter last week’s extremely volatile trading, stocks bounced on Monday, as\ninvestors continued weighing the potential impact of the new coronavirus\n‘Omicron’ variant and looked ahead towards the monthly Consumer Price Index, set\nto be released later…",
  "data/reddit-stocks/r/stocks/comments/ramdq9/why_is_intc_intel_up_11_in_after_hours_trading.json": "What the heck is going on? Is this a glitch or something???\n\nI’ve had a little of the stock for awhile, so I’m happy to see it go up, but I’m\nunsure how to digest this movement. I’ve been unable to find any analysis of\nthis on the usual sites.\n\nEdit: Found a press…",
  "data/reddit-stocks/r/stocks/comments/ran7m8/pandemic_hype_stocks_are_returning_to_may_2020.json": "$PTON, $DOCU, $ZM, $Z just a few to name.\n\nMany stocks are suffering as their businesses tied to technology and innovation,\nmany have no profit. These shares that soared last year as the pandemic hit the\nworld. They are set to suffer now as economies reopen. Omicron was just an\nexample of that -…",
  "data/reddit-stocks/r/stocks/comments/rancjb/if_youre_speculating_about_a_market_crash_stop.json": "It's surprising to see so many people speaking about the market considering they\nopened their accounts very recently. I'm not saying you can't express your\nopinion, that's what we're here for, it just gets a little annoying when people\nfreak about the market. Settle down, you're an investor, not a…",
  "data/reddit-stocks/r/stocks/comments/ranjsp/valuation_doesnt_matter_until_it_does.json": "I have seen a lot of post in the last year (including one two weeks ago), saying\nthat valuation doesn't matter anymore. Well, all of those high multiples, and\nirrational stocks, have been tanking hard in the past two weeks. It all started\nwhen Disney and Paypal started to tank, a lot of stocks…",
  "data/reddit-stocks/r/stocks/comments/raqzqo/article_teslas_center_display_is_showing_massive.json": "Dec 1st 2021\n\nhttps://electrek.co/2021/12/01/tesla-center-display-massive-performance-improvement-new-amd-chip/\n\nWe reported on one that was quickly spotted by new buyers taking delivery: Tesla\nintroduced an AMD chip for the media computer (MCU). It replaces an Intel Atom\nchip that currently powers…",
  "data/reddit-stocks/r/stocks/comments/rasfya/nassim_taleb_fooled_by_randomness_the_black_swan.json": "Nassim Taleb**\n\n\nFOOLED BY RANDOMNESS\n\n * Survivorship Bias means you don't hear from the losers on a topic, you only\n   hear from the winners.\n   * Watch out judging a person by their results because history will only show\n     you the winners. You won't hear the stories of the losers\n * Over…",
  "data/reddit-stocks/r/stocks/comments/raujkn/when_the_shoeshine_boys_talked_stocks.json": "it was a great signal to sell stocks in 1929.\n[https://archive.fortune.com/magazines/fortune/fortune_archive/1996/04/15/211503/index.htm]\n\nWhat's today?\n\nTalking more to close relatives and friends in the last months I discovered they\nall play around with investments apps. The amount of money the…",
  "data/reddit-stocks/r/stocks/comments/raw8go/we_are_2_away_from_ath_and_going_up.json": "S&P is about 2% away from ATH and futures are up 1.25%\n\nPast 2 week have been rough, especially for growth stocks. However it seems like\nDec may be another bull run. Even Chinese stocks are trying to rebound.\n\nAre you bullish?",
  "data/reddit-stocks/r/stocks/comments/rb0j1k/tsmc_and_intel_get_into_a_rare_public_spat_over.json": "Intel Corp. Chief Executive Officer Pat Gelsinger has been saying that it’s\nrisky for the U.S. to rely too heavily on Asian chipmakers. He’s argued that the\nAmerican government should only subsidize domestic players with the new $52\nbillion CHIPS Act. Gelsinger hammered away at the same point again…",
  "data/reddit-stocks/r/stocks/comments/rb2kr3/and_welcome_to_new_ath.json": "Back October when we had that slight downturn, everyone thought that was the\ncrash. At that time, I predicted VOO to be at $420 by Christmas. We blew past\nthat. Now we had the recent downturn where \"this is it\". Again, we are hitting\nall time highs.\n\nStop coming here and stating the doom with the…",
  "data/reddit-stocks/r/stocks/comments/rb2kzo/recovering_from_a_40_loss_over_one_year.json": "Hello,\n\nThis is just my experience investing for the first time during the last year and\na half. Probably all very basic, but it's been such a ride for me and wanted to\nshare today's milestone of finally not being in the red anymore.\n\nThe start\n\nI started investing in July last year. Tried to learn…",
  "data/reddit-stocks/r/stocks/comments/rb5cmz/cathie_wood_to_launch_a_new_etf_it_tracks_a.json": "Cathie Wood's ARK Investment Management is revving up to launch its second new\nU.S. exchange-traded fund in almost three years this week.\n\nThe ARK Transparency ETF follows the Transparency Index (TRANSPCY), which tracks\nthe stock price movements of the 100 most transparent companies globally. It…",
  "data/reddit-stocks/r/stocks/comments/rb8sfh/on_apple_maps_land_masses_are_whatever_size_the.json": "\"Sometime in 2014 or early 2015, China's State Bureau of Surveying and Mapping\ntold members of the Apple Maps team to make the Diaoyu Islands, the objects of a\nlong running territorial dispute between China and Japan, appear large even when\nusers zoomed out from them.\n\nChinese regulators also…",
  "data/reddit-stocks/r/stocks/comments/rbaiz6/here_is_a_market_recap_for_today_tuesday_december.json": "PsychoMarket Recap - Tuesday, December 7, 2021\n\nWrote this on Friday’s Recap: \"On a personal note, I am taking this opportunity\nto do some very small dip buying. As usual I believe the market is overreacting\n(as it tends to do). While it is important to acknowledge the risks present in\nthe market,…",
  "data/reddit-stocks/r/stocks/comments/rbbkh9/rocket_lab_to_launch_three_dedicated_electron.json": "https://finance.yahoo.com/news/rocket-lab-launch-three-dedicated-211500392.html\n\nThe first two missions are scheduled for lift-off from Rocket Lab Launch Complex\n1 in 2022, with a third to follow in 2023. Each mission will deploy a single\nStriX satellite, growing Synspective’s synthetic aperture…",
  "data/reddit-stocks/r/stocks/comments/rbhzkp/kellogg_to_permanently_replace_striking_employees.json": "Kellogg said on Tuesday a majority of its U.S. cereal plant workers have voted\nagainst a new five-year contract, forcing it to hire permanent replacements as\nemployees extend a strike that started more than two months ago.\n\nTemporary replacements have already been working at the company’s cereal…",
  "data/reddit-stocks/r/stocks/comments/rbm0od/great_growth_stocks_that_isnt_tech.json": "I’m 22 years old and I started investing during the pandemic. The journey has\nbeen great so far (save me the \"everyone is a genius in a bull market\", I know),\nbut I think my portfolio is a bit too exposed to tech stocks. Now, some people\nmight say that tech is the future and I should keep putting…",
  "data/reddit-stocks/r/stocks/comments/rbofi3/rstocks_daily_discussion_wednesday_dec_08_2021.json": "These daily discussions run from Monday to Friday including during our themed\nposts.\n\nSome helpful links:\n\n * Finviz [https://finviz.com/quote.ashx?t=spy] for charts, fundamentals, and\n   aggregated news on individual stocks\n * Bloomberg market news [https://www.bloomberg.com/markets]\n *…",
  "data/reddit-stocks/r/stocks/comments/rbric4/why_is_nvda_so_richly_valued.json": "Hi everyone, I'd like to preface this by saying that I'm a new investor around\n3-months and that I'm not dogging anyone's investment decisions. I primarily\ninvest by DCA into ETFs like SPY, QQQ and DIA. I've also decided to branch out\nby nibbling on individual stocks within the QQQ. I find NVDA…",
  "data/reddit-stocks/r/stocks/comments/rbtxjc/tesla_price_target_raised_to_158000share.json": "TESLA IS MAINTAINED AT BUY BY NEW STREET RESEARCH\n\n9:18 am ET December 8, 2021 (Dow Jones) Print\n\nRatings actions from Benzinga: https://www.benzinga.com/stock/TSLA/ratings\n\n2021-12-08 14:18:00 GMT DJ Tesla Price Target Raised to $1580.00/Share From\n$1298.00 by New Street Research",
  "data/reddit-stocks/r/stocks/comments/rc08q1/roku_rallies_20_on_multiyear_agreement_with.json": "The deal will allow the 56.4 million active Roku accounts to continue to watch\nYouTube and YouTube TV, Google's livestreaming service, without disruption.\n\nGoogle had previously threatened to pull both YouTube and YouTube TV off Roku on\nDec. 9. The carriage fight caught the attention of Congress,…",
  "data/reddit-stocks/r/stocks/comments/rc14lt/gamestop_releases_earnings_report_for_q3.json": "Revenue for the quarter: $1.297B vs $1.19B expected\n\nEPS: $(1.39) vs. $(0.22) expected\n\nTHIRD QUARTER OVERVIEW\n\nNet sales were $1.297 billion for the quarter, compared to $1.005 billion in the\nprior year’s third quarter.\n\nSales attributable to new and expanded brand relationships, such as Samsung,…",
  "data/reddit-stocks/r/stocks/comments/rc2skv/winc_inc_releases_earnings_report_for_q3.json": "Third Quarter 2021 Highlights Compared to the Third Quarter of 2020\n\n * Total net revenues increased 3.4% to $18.5 million\n * Wholesale revenues increased 106.9% to $5.5 million\n * DTC revenues declined 12.8% to $12.7 million\n * Net loss increased from $1.3 million to $5.7 million\n * Adjusted…",
  "data/reddit-stocks/r/stocks/comments/rc2u8l/canada_joins_us_in_potential_to_boycott_winter.json": "For example, China introduces limit/higher tax on exporting. Which could hurt\nthe supply chain for many things related to tech, parts etc.\n\nCould this cause a \"mini\" market crash?\n\nThe reality is... this will also hurt China economy (perhaps it will sting a\nlittle more). But I just can't see China…",
  "data/reddit-stocks/r/stocks/comments/rc36dz/lucid_group_lcid_announces_proposed_convertible.json": "NEWARK, Calif., Dec. 8, 2021 /PRNewswire/ -- Lucid Group, Inc. (\"Lucid\")(Nasdaq:\nLCID) today announced its intention to offer, subject to market and other\nconditions, $1,750,000,000 aggregate principal amount of convertible senior\nnotes due 2026 (the \"notes\") in a private offering to persons…",
  "data/reddit-stocks/r/stocks/comments/rc6zoc/credit_suisse_sees_sp_500_reaching_5200_in_2022.json": "Source\n[https://www.cnbc.com/2021/12/08/credit-suisse-sees-sp-500-reaching-5200-in-2022-citing-economic-growth.html]:\n\n * The firm sees the benchmark index reaching 5200 by the end of 2022, higher\n   than its previous target of 5000.\n\n * The new projection implies about 11% upside from the S&P…",
  "data/reddit-stocks/r/stocks/comments/rceul5/fitch_lowers_china_evergrande_rating_to.json": "Fitch Ratings on Thursday lowered the credit rating on embattled home builder\nChina Evergrande to restricted default from C. The downgrades reflect the\nnon-payment of coupons due Nov. 6 for its Tianji subsidiary of $645 million and\n$590 million after the grace period lapsed on Dec. 6. Fitch said…",
  "data/reddit-stocks/r/stocks/comments/rchmjr/apples_selfdriving_car_project_loses_three_more.json": "Apple's chief engineer for radar systems, Eric Rogers, left for Joby Aviation, a\ncompany working on electric aerial ridesharing. Alex Clarabut, an engineering\nmanager for the battery team, and Stephen Spiteri, a hardware engineering\nmanager, both joined Archer Aviation, a company that is developing…",
  "data/reddit-stocks/r/stocks/comments/rchsvk/the_stock_market_will_always_rebound_and_stay.json": "From many news media outlets and youtuber finance experts and stock gurus, I\nkeep seeing the notion that the stock market is heavily overvalued currently\nrelative to its former valuation metrics that have held for decades.\n\nTo be honest, this is true, and they're not wrong, but what they fail to…",
  "data/reddit-stocks/r/stocks/comments/rcjn5j/what_stock_are_you_bearish_on_that_most_people.json": "In today’s market, everyone seems bullish on everything. There are certain\nstocks that people are being told to buy basically regardless of price. What is\na stock that you see everyone pushing that you think is a bad investment that\nwill either lose money or greatly underperform the market. Let’s…",
  "data/reddit-stocks/r/stocks/comments/rclu91/what_stock_are_you_bullish_on_that_most_people.json": "In today’s market, no one seems bearish on anything. There are no stocks that\npeople are being told not to buy basically regardless of price. What is a stock\nthat you see no one pushing that you think is a good investment that will either\nmake money or greatly overperform the market. Let’s have…",
  "data/reddit-stocks/r/stocks/comments/rcmhm7/cvs_increases_earnings_and_sales_forecast.json": "(Bloomberg)\n[https://finance.yahoo.com/news/cvs-health-plans-buy-back-131523196.html?.tsrc=rss]\n-- CVS Health Corp. said earnings and sales this year will be at the high end of\nits forecast and announced plans to buy back $10 billion worth of shares as it\nprepares for further expansion into primary…",
  "data/reddit-stocks/r/stocks/comments/rcpzl6/without_its_top_5_stocks_nasdaq_is_down_25_ytd.json": "I found this picture today:\nhttps://pbs.twimg.com/media/FGK9m_xWUAEdtvL?format=jpg&name=small\n\n$NDX is up 25% YTD but if you remove its top 5 holdings (Apple, Microsoft,\nAmazon, Tesla and NVidia), the rest of the composite is down 25%.\n\nNow, I haven't checked what the $NDX's performance year-to…",
  "data/reddit-stocks/r/stocks/comments/rcqgn5/should_we_concern_that_sp500_is_mainly_controlled.json": "I want to invest in the S&P500 index but worry that it's just too concentrated\nin a few over valued companies.\n\n> For example, AAPL and MSFT alone makes up 13% Add AMZN, TSLA, GOOGLE and NVDA\n> now it's 25+%.\n\nI feel like buying SPY is the same as buying all the over hyped companies at the\ntop.",
  "data/reddit-stocks/r/stocks/comments/rcqqvs/buzzfeed_fallout_worsens_sheds_32_since_this.json": "(Bloomberg) -- BuzzFeed Inc.’s plunge after leaping into the public market\nearlier this week is accelerating.\n\nShares of the digital media company were down more than 14% to $6.58 at 12:43\np.m. in New York, putting them on pace to close at a fourth consecutive record\nlow. BuzzFeed debuted on Dec. 6…",
  "data/reddit-stocks/r/stocks/comments/rcre1z/psycho_market_recap_for_thur_dec_9_2021.json": "Summary\n\nThe three day rally in the stock market took a pause, with stocks finishing\nmostly lower. Market participants continue to digest new data about the Omicron\nvariant, the Weekly Unemployment Report, and look forward to new inflation data\nbeing released tomorrow. Weekly unemployment claims…",
  "data/reddit-stocks/r/stocks/comments/rcsbop/apples_stock_rises_toward_another_record_as.json": "https://www.marketwatch.com/amp/story/apples-stock-rises-toward-another-record-as-wedbush-says-no-need-to-worry-about-supply-issues-11639080228\n\nIves also said he believes Apple will introduce its “highly anticipated”\naugmented reality (AR) headset, Apple Glasses, next summer, which could add\nabout…",
  "data/reddit-stocks/r/stocks/comments/rcv78x/company_founders_and_leaders_are_unloading_their.json": "“Com­pany founders and lead­ers are un­load­ing their stock at his­toric\nlev­els, with some sell­ing shares in their busi­nesses for the first time in\nyears, amid soar­ing mar­ket val­u­a­tions and ahead of pos­si­ble changes in\nU.S. and some state tax laws.\n\nSo far this year, 48 top ex­ec­u­tives…",
  "data/reddit-stocks/r/stocks/comments/rcw5vi/cathie_wood_says_ark_soulsearching_as_oncestellar.json": "(Bloomberg) -- Ark Investment Management is “going through soul-searching” as\nits growth-focused funds fall out of favor amid expectations of tighter Federal\nReserve policy, said founder Cathie Wood.\n\nThe $17.8 billion ARK Innovation ETF has tumbled more than 20% this year, with\nseveral of its top…",
  "data/reddit-stocks/r/stocks/comments/rcznsx/23_of_americans_rely_on_astrology_for_buying_or.json": "According to a new study released by LendingTree\n\n> Americans mostly tap into their horoscope for making decisions on how to save\n> money (42.1%) and whether it makes sense to splurge rather than save (33.5%).\n> But 23.1% rely on astrology for buying or selling stocks, and then same\n> percentage…",
  "data/reddit-stocks/r/stocks/comments/rd8qks/inflation_surged_68_even_more_than_expected_in.json": "The consumer price index was expected to rise 6.7% from a year ago in November,\naccording to economists surveyed by Dow Jones.\n\nThe consumer price index, which measures the cost of a wide-ranging basket of\ngoods, rose 0.8% for the month, good for a 6.8% pace on a year over year basis\nand the…",
  "data/reddit-stocks/r/stocks/comments/rd966c/why_are_south_korean_semiconductor_stocks_trading.json": "Trailing P:E\n\nSK Hynix: 10.27\n\nSamsung Electronics: 13.1\n\nNot that there's any such thing as a perfect comparison, but I don't know of any\nother semiconductor foundry that trades under 15 P:E, some quite a bit higher.\nIs South Korea thought to be behind the times with their tech or…",
  "data/reddit-stocks/r/stocks/comments/rdep6h/short_sellers_being_investigated_by_doj.json": "https://www.thestreet.com/markets/tecnoglass-stock-dives-as-hindenburg-research-issues-short-report\n\nSo the Hindenburg Short selling company started claim that tecnoglass is faking\ntheir numbers, and the stock plummeted like 40% in few days. Now DOj is\ninvestigating them. Do you think they will get…",
  "data/reddit-stocks/r/stocks/comments/rdf3sq/if_you_consistently_underperform_it_might_be_you.json": "I don't want to be a jerk. But I see so many posts on Reddit of people losing\nmoney--significant fractions of their net worth--and blaming everyone but\nthemselves; I feel there are some young folks here who need to hear this.\n\nThe S&P500 is up about 25% YTD--that's extremely rare. It's up 115%…",
  "data/reddit-stocks/r/stocks/comments/rdgkbs/us_doj_launches_expansive_probe_into_short_selling.json": "https://www.reuters.com/markets/europe/us-doj-launches-expansive-probe-into-short-selling-bloomberg-news-2021-12-10/\n\nThe U.S. Department of Justice (DoJ) has launched an expansive criminal\ninvestigation into short selling by hedge funds and research firms, Bloomberg\nNews reported on Friday, citing…",
  "data/reddit-stocks/r/stocks/comments/rdh4ue/nasdaq_would_not_be_down_25_ytd_without_the_top_5.json": "I could not believe the post that said the Nasdaq would be down 25% without the\ntop 5 (AAPL, AMZN, MSFT, GOOG, TSLA).\n\nSo, I made a portfolio of the 95 stocks of the nasdaq, held by their weighting\nat the beginning of the year and see what return I would get.\n\nhttps://imgur.com/hAm47KA\n\nReturn is…",
  "data/reddit-stocks/r/stocks/comments/rdixlb/now_that_news_of_the_doj_probe_has_dropped_is_it.json": "Only ~77 million shares of GameStop are authorized by the company's board of\ndirectors and should exist. For a publicly-traded company, this is a very small\namount of shares.\n\nAbout 14 million of these are owned by company insiders.\n\nAbout 6.5 million are in ETFs.\n\nAbout 22 million are owned by…",
  "data/reddit-stocks/r/stocks/comments/rdj64n/which_stocks_do_you_think_are_extremely.json": "A contractionary monetary policy in 2022 is bound to make investors seek less\nspeculative companies and also favor those with current cash flows as opposed to\nthose who might be profitable in 2023/24.\n\nHere is my list of stocks I am quite confident that would plunge further, but\ninterested in other…",
  "data/reddit-stocks/r/stocks/comments/rdj8k0/am_i_the_last_to_know_i_bonds_have_hit_712.json": "I know inflation is growing but a 7% + bond yield is unheard of.\n\nApparently the yield is variable but won’t change until next May when inflation\nrates at that time will dictate the new yield. You can read more about them\nhere: http://apyguy.com/i-bonds-current-rates-and-where-to-buy-them/\n\nAnd I…",
  "data/reddit-stocks/r/stocks/comments/rdknyk/here_is_a_market_recap_for_today_friday_december.json": "PsychoMarket Recap - Friday, December 10, 2021\n\nStocks ended broadly higher today as market participants shrugged off the new\nConsumer Price Index (CPI), which is roughly in line with economist expectations\nahead of the Federal Reserve final meeting of the year, a sign that market\nparticipants. The…",
  "data/reddit-stocks/r/stocks/comments/rdnslz/nasdaq_has_announced_the_results_of_the_annual.json": "https://www.globenewswire.com/news-release/2021/12/11/2350269/0/en/Annual-Changes-to-the-Nasdaq-100-Index.html\n\nNasdaq (Nasdaq: NDAQ) today announced the results of the annual reconstitution\nof the Nasdaq-100 Index® (Nasdaq: NDX), which will become effective prior to\nmarket open on Monday, December…",
  "data/reddit-stocks/r/stocks/comments/rdojvw/peter_lynch_warns_against_passive_investing_after.json": "https://markets.businessinsider.com/news/stocks/peter-lynch-big-short-michael-burry-passive-investing-stocks-bubble-2021-12\n\nFabled stock-picker Peter Lynch recently criticized the shift toward passive\ninvesting, warning buyers of index funds and exchange-traded funds that they're\nlosing out on…",
  "data/reddit-stocks/r/stocks/comments/rdz7tf/nasdaq_100_changes_in_2022.json": "Just seen the changes to the NASDAQ 100 coming up in 2022. Frankly, surprised\nsome of the names that were in NASDAQ100 and some that were already not in the\nlist! Having said that the total market cap of new additions is more than double\nthe ones thrown out.\n\nShould be interesting for index funds…",
  "data/reddit-stocks/r/stocks/comments/rdzxsx/my_portfolio_is_trash_should_i_sell_all_of_it.json": "I’ll start by saying that I’d rather not focus too much on how I got here. Not\nbecause I shouldn’t learn from my mistakes, but because I don’t think there’s\nmuch to even learn. In short I didn’t (and still don’t) know anything about the\nstock market, but I had about $5k that I wanted to invest.…",
  "data/reddit-stocks/r/stocks/comments/re2arc/mercedes_beats_tesla_to_handsfree_driving_on_the.json": "Daimler AG’s Mercedes-Benz won regulatory approval to deploy a hands-free\ndriving system in Germany ahead of Tesla Inc., gaining an edge in the race to\noffer higher levels of automation in one of the world’s most competitive car\nmarkets.\n\nThe automaker got the green light to sell its Drive Pilot…",
  "data/reddit-stocks/r/stocks/comments/re3z0l/bill_ackman_says_reported_inflation_is_understated.json": "Thoughts?\n\n“Reported inflation is understated. Owners’ Equivalent Rent (OER) relies on\nowner surveys to estimate inflation in housing costs. This is an extremely\nimprecise metric. The single family rental market provides more accurate data.\nOER in today’s reported core CPI was 3.5% YoY.\n\nThe…",
  "data/reddit-stocks/r/stocks/comments/re5irb/net_cloudflare_drops_from_220_to_140.json": "Cloudflare has dropped recently in the last two weeks from $220 to $140. I was\nwonder if some people might have some input. I haven't sold any because I don't\ntrade with my emotions. And I actually believe this company is 100x better than\nfastly. They just reached earnings per share of 0 cents. And…",
  "data/reddit-stocks/r/stocks/comments/re941m/how_many_stocks_do_you_own.json": "For a while as the market was doing good I had a LOT of stocks, but since the\nOmnicron scare realizing I need to get in WAY less stocks and focus more on\ncertain ones.\n\nI currently have 66 stocks in my portfolio, very diversified and spread out. Got\nrid of maybe 10-15 lately. What about you?",
  "data/reddit-stocks/r/stocks/comments/reb8gf/intel_breakthroughs_propel_moores_law_beyond_2025.json": "https://www.businesswire.com/news/home/20211211005006/en/\n\n> In its relentless pursuit of Moore’s Law, Intel is unveiling key packaging,\n> transistor and quantum physics breakthroughs fundamental to advancing and\n> accelerating computing well into the next decade. At IEEE International\n> Electron…",
  "data/reddit-stocks/r/stocks/comments/rebfe8/is_sofis_bank_charter_priced_in.json": "SOFI has been en route to receive their bank charter for quite a few months now,\nseemingly with high confidence that they’ll be approved by the end of this\nyear/early next year. In this same time frame, they’re stock has been range\nbound stuck between $14 and $23. Leadership seems to be extremely…",
  "data/reddit-stocks/r/stocks/comments/redgg9/fidelity_brokerage.json": "Currently have Robinhood but want to get into a better brokerage.\n\nI’m really attracted to fidelity for the partial shares. Any one else that uses\nFidelity that could give me some feedback if this would be a good move from\nRobinhood ?\n\nEdit: Thanks every one for your feedback, I’m starting to…",
  "data/reddit-stocks/r/stocks/comments/redjml/power_of_compounding.json": "Few weeks back, I wrote a post on some word of advice for young investors. There\nwas one more thing that I forgot to emphasize in that post - The power of\ncompounding.\n\nYoung investors, you have an opportunity of a lifetime, literally a retirement\nlottery ticket if you are in your early twenties…",
  "data/reddit-stocks/r/stocks/comments/reiiqj/if_all_companies_were_suddenly_reset_to_fair.json": "Without getting too caught up in what \"fair value\" would be, the point of the\nquestion is to ask what company you'd invest in if the price wasn't wildly above\nwhat you think would be fair.\n\nPlease list reasons why you chose that company :) (try not to list more than 3)",
  "data/reddit-stocks/r/stocks/comments/rem8nb/lithium_industry_global_overview_and_perspectives.json": "Following Chamath Palihapitiya’s publication of his investment thesis on Mitra\nChem, I wanted to share some of my writings on the lithium industry in a similar\nformat (1-pager). I also believe that, amid growing concerns over the Omicron\nvariant and faster-than-expected tapering, here is now the…",
  "data/reddit-stocks/r/stocks/comments/reo6b2/mindfulness_and_emotional_trading.json": "For the most part, everyone knows that emotions are a disaster for consistent\ntrading, but in my experience the vast majority of new traders have no idea how\nmuch emotion is actually behind their actions. So try something- pull up a\nmindfulness meditation video on YouTube and for 5 or 10 minutes,…",
  "data/reddit-stocks/r/stocks/comments/repy9e/apple_aapl_short_term_outlook.json": "Unless you have been living under a rock you have watched Apples insane run up\nthe past few weeks. In the past month Apple has increased 20.7% with Fridays\nclose.\n\nI have been investing in Apple since 2019 and have accumulated a good amount of\nshares and option contracts. I understand “you don’t…",
  "data/reddit-stocks/r/stocks/comments/rf07kk/there_was_a_site_showing_what_people_bought_but_i.json": "EDIT: It's been found! OpenInsider.com\n\nThere's a site that showed what a lot of rich people, not just congressmen, were\nbuying/selling and I can't remember what it was. I saw it on tiktok sometime in\nthe first ~6 months of this year I think.\n\nIT IS NOT ANY OF THE FOLLOWING: -\nhttps://disclosures…",
  "data/reddit-stocks/r/stocks/comments/rf143q/why_does_berkshire_hathaway_own_both_voo_and_spy.json": "I was just looking into Berkshire Hathaway's portfolio and I saw they own both\nVOO and SPY. Why is that? Why not just increase their position in one of them,\nis there really a purpose in owning both VOO and SPY? Just curious. Thanks!\n\n\n\nhttps://www.cnbc.com/berkshire-hathaway-portfolio/",
  "data/reddit-stocks/r/stocks/comments/rf1vvl/investment_account_for_child.json": "My wife and I are having a son next June and are already thinking about ways to\njump start some savings for him. Eventually, the goal would be to use these\nfunds for the future for him whether it’s college (or a trade school), medical,\nor some other purpose. I manage our investment accounts…",
  "data/reddit-stocks/r/stocks/comments/rf2l4t/corsair_gaming_crsr_intrinsic_valuation_analysis.json": "Growth has underperformed value stocks over the last year due to inflation\nconcerns. This has presented buying opportunities for those who want to add to\ntheir boomer portfolios for the long-term. I've decided to analyze companies\nthat are down 50%+ from their 52-week highs.\n\nCompany…",
  "data/reddit-stocks/r/stocks/comments/rf5ye7/six_amazon_workers_dead_no_hope_of_more_survivors.json": "https://www.reuters.com/world/us/injuries-reported-after-roof-collapse-amazon-warehouse-illinois-ap-2021-12-11/\n\nSix Amazon.com Inc (AMZN.O) workers were confirmed dead on Saturday after a\nseries of tornadoes roared through a warehouse near St. Louis, ripping off its\nroof and causing 11-inch thick…",
  "data/reddit-stocks/r/stocks/comments/rf6rbb/how_do_you_determine_your_entry_and_exit_points.json": "I am relatively new to the world of stocks and it seems like using entry and\nexit points for each of your picks is crucial for long-term success. When you do\nDD, how do you figure out what you want your entry and exit points to be? Do you\nuse some sort of formula or perform valuation analysis…",
  "data/reddit-stocks/r/stocks/comments/rfd29o/pfizer_lifted_to_buy_at_ubs_which_says_covid.json": "Pfizer PFE, +1.34% was upgraded to buy from neutral at UBS, which also lifted\nits price target to $60 from $52. UBS said the oral antiviral paxlovid will\ngenerate at least $14 billion in sales next year, which it said was 40% above\nconsensus expectations. Combined with the Comirnaty vaccine,…",
  "data/reddit-stocks/r/stocks/comments/rfeu5a/sp_500_growth_etfs_hit_record_highs_and_have.json": "S&P 500 growth ETFs hit record highs on Wednesday and are outperforming the\nbenchmark SPDR S&P 500 Trust ETF (NYSEARCA:SPY) year to date.\n\nThe Vanguard S&P 500 Growth ETF (NYSEARCA:VOOG), SPDR Portfolio S&P 500 Growth\nETF (NYSEARCA:SPYG) and iShares S&P 500 Growth ETF (NYSEARCA:IVW) all…",
  "data/reddit-stocks/r/stocks/comments/rffupe/bristol_myers_squibb_raises_dividend_and.json": "Bristol Myers Squibb (BMY) declares $0.54/share quarterly dividend, 10.2%\nincrease from prior dividend of $0.49. Payable Feb. 1; for shareholders of\nrecord Jan. 7; ex-div Jan. 6. The board also authorized the repurchase of an\nadditional $15B of the company’s common stock, bringing the total amount…",
  "data/reddit-stocks/r/stocks/comments/rfgfxp/a_company_ive_been_holding_for_years_just.json": "I've been holding $ARNA for years and today Pfizer announced they would be\nbuying us out for 100$/share cash deal. I'm totally new to buyouts so I am\nconfused as to what's the best move here. If I buy at market open at $95 is that\njust a guaranteed 5% increase for when the sale goes…",
  "data/reddit-stocks/r/stocks/comments/rfgy5o/a_nearterm_pullback_then_the_third_bubble_in_100.json": "Of the dozens of central bank meetings crammed into this week, the Federal\nReserve is seen stealing the show with a tapering start and possible early\nrate-hike hints. After the “worst inflation call in history” and its credibility\nshattered, Chair Jerome Powell will need to take the reins hard,…",
  "data/reddit-stocks/r/stocks/comments/rfhglf/why_did_2021_turn_out_to_be_a_bad_year_for_new.json": "I know GME$ AMC$ meme stocks kicked off 2021 in high gear and then came to a\nhalt around March.\n\nBut overall individual stocks did horrible in 2021.\n\nWas this becuase of delta? Was it evergrande? Was it tech stocks going down? Was\nit inflation? Was it Americans not wanting to return to work? Was it…",
  "data/reddit-stocks/r/stocks/comments/rfkizc/with_2021_coming_to_a_close_what_did_you_learn.json": "With alot of newer investors on here, what did ya'll learn about this year?\n\nI've learned about the correlation about the relationship bond yield rates and\nhow it affects growth stocks.\n\nI've learned that this sub reddit loves tech stocks.\n\nI've learned that most of the hyped up stocks on here…",
  "data/reddit-stocks/r/stocks/comments/rfm3q5/this_sub_helped_me_pay_for_my_wedding.json": "I came here a little over a year ago, after I got engaged, wanting to make money\nto help me pay for my wedding. I knew nothing about investing. This sub has a\nlot of great information, and I learned about SPY and SPLG. I put my money in\nthere, and let it sit for over a year, even through the covid…",
  "data/reddit-stocks/r/stocks/comments/rfmm5k/why_are_bank_stocks_down_when_we_expect_rate_hikes.json": "All the major bank stocks are down today, including Wells Fargo, Bank of\nAmerica, and Chase. For the last month they've been down roughly 6-8%.\n\nUBS Analyst raised targets for all three banks\n[https://www.marketwatch.com/story/ubs-singles-out-bank-of-america-as-top-pick-in-glowing-view-of-bank…",
  "data/reddit-stocks/r/stocks/comments/rfoza5/sq_vs_pypl_which_one_do_you_like_more_and_why.json": "Fellas! Lately, fintech got hammered big time. I am not so sure what caused it\nbut who cares tbh. I like these two stocks but not sure which one has more\npotential to bring a great ROI. I am looking for a year or so investment. What\ny’all like out of these two and why? I definitely feel like these…",
  "data/reddit-stocks/r/stocks/comments/rfrpyq/kronos_hit_with_ransomware_warns_of_data_breach.json": "https://www.zdnet.com/article/hr-platform-kronos-brought-down-by-ransomware-attack-ukg-warns-of-data-breach/\n\nHR management platform Kronos has been hit with a ransomware attack, revealing\nthat information from many of its high-profile customers may have been\naccessed. \n\nUKG, Kronos' parent…",
  "data/reddit-stocks/r/stocks/comments/rfrycz/goldman_warns_against_too_much_concentrated.json": "> Here are 10 high-growth, high-margin stock picks from Goldman that have\n> performed well in recent months and should continue to do so “provided\n> narrowing breadth persists.” They trade at “only a small premium to similarly\n> high growth companies” with low or negative margins, the firm found.\n\n…",
  "data/reddit-stocks/r/stocks/comments/rftczp/rocket_lab_to_acquire_solaero_holdings_inc_a.json": "https://www.businesswire.com/news/home/20211213005915/en/\n\nThe acquisition aligns with Rocket Lab’s growth strategy of vertical integration\nto deliver a comprehensive space solution that spans spacecraft manufacture,\nsatellite subsystems, flight software, ground operations, and launch. As one…",
  "data/reddit-stocks/r/stocks/comments/rfxkv9/overpriced_less_popular_stocks_propping_up_sp_500.json": "2021 has been a bad year for a lot of popular names deemed as overpriced.\nHowever there are a ton of not as frequently discussed stocks I've been checking\nout that seem relatively more overpriced than the 'overpriced' stocks that have\nalready taken 20-30% haircuts. Makes me wonder if there is…",
  "data/reddit-stocks/r/stocks/comments/rfy0ch/bought_ford_f_at_15_thinking_to_hold_until.json": "I got into Ford at $15, thought I'd hold it a year and see how the release of\nthe F150 Lightning went, how the Maverick went and the other potential EVs\nthey're coming out with.\n\nNow Ford is trading at $20 give or take 50¢ and I'm up 30% and a gain of like\n$180 or so\n\nI'm relatively new to…",
  "data/reddit-stocks/r/stocks/comments/rfymtp/is_there_a_good_argument_against_diversification.json": "I've been absolutely slaying it by choosing a single stock with some kind of\ncatalyst coming up. I know it's fraud upon by most people but I'm wondering if\nthere's actually a good argument against diversification.\n\nI know this isn't necessarily considered \"investing\" because you typically sell\nonce…",
  "data/reddit-stocks/r/stocks/comments/rg2lwe/why_do_futures_go_green_all_night_and_then.json": "I'm wondering why futures can be up big for the night and then around 3am\neastern time they'll suddenly make a 180 and go the opposite way or vise versa.\n\nWhat is it about 3 am that would cause such an abrupt change?\n\nAlso I've noticed futures that are green until 930am and all of a sudden…",
  "data/reddit-stocks/r/stocks/comments/rg6szk/pfizer_says_covid19_pill_near_90_effective_in.json": "Pfizer on Tuesday said final analysis of its antiviral Covid-19 pill still\nshowed near 90% efficacy in preventing hospitalizations and deaths in high-risk\npatients. (Source CNBC\n[https://www.cnbc.com/2021/12/14/pfizer-says-covid-19-pill-near-90percent-effective-in-final-analysis-.html])\n\n * recent…",
  "data/reddit-stocks/r/stocks/comments/rg6w4b/dont_believe_anything_you_read_on_motley_fool.json": "I counted at least a half dozen articles pumping SE while SE was dropping like a\nbrick…\n\n“Stocks that will make you rich in December”\n\nI learned a hard lesson in this one…the “independent” research like Motley Fool,\nZacks and Seeking Alpha may not always be so independent.",
  "data/reddit-stocks/r/stocks/comments/rg8zw4/why_are_cannabis_stocks_and_etfs_so_hated.json": "Before everyone brigades \"no moat,\" \"anyone can grow weed,\" and \"it's not very\nprofittable,\" obviously there's more to it than that.\n\nLast month, there was a faint murmur that a Republican led cannabis legalization\nbill might be introduced, and ETFs like MSOS shot up over 10% in one day.\n\nAlso,…",
  "data/reddit-stocks/r/stocks/comments/rgflu9/buying_the_dip_on_safe_stocks_am_i_really_just.json": "Obligatory intro: I've started investing this year and made a happy sum on GME,\nwhile also (almost) losing an equal amount on BB. I was lucky enough for BB to\nbriefly pump in June and made it out without becoming a bagholder. I promised\nmyself never to blindly buy into doubtful stocks or at least…",
  "data/reddit-stocks/r/stocks/comments/rggh0h/block_inc_touched_a_new_52_week_low_today_at.json": "Block, Inc. has been expanding rapidly and recently announced to acquire\nafterpay. The acquisition aims to enable the companies to better deliver\ncompelling financial products and services that expand access to more consumers\nand drive incremental revenue for merchants of all sizes. The stock went…",
  "data/reddit-stocks/r/stocks/comments/rghxvr/here_is_a_market_recap_for_today_tuesday_december.json": "PsychoMarket Recap - Tuesday, December 14, 2021\n\nThe stock market edged lower again on Tuesday, though showed some signs of life\nin the last two hours of the session as market participants digest new\ninflationary data and look ahead to the Fed’s final monetary policy meeting\ndecision of the year…",
  "data/reddit-stocks/r/stocks/comments/rgigdl/investing_is_fun.json": "Does anyone else out there just purely enjoy researching a company, investing\nand seeing your money work on it’s own? Yes, those times where your investments\ndon’t do well, but the majority of the time the whole process is fun to me. Not\nin a gambling sense, just fun to learn about different…",
  "data/reddit-stocks/r/stocks/comments/rgk283/longterm_nvda_investor_speaking_here.json": "I've owned NVDA for years. I've always believed in the potential even if it was\nvolatile (trust me, there's been some major swings). I had written calls at $250\nmonths ago before the hard run up. I sold a majority of my shares that the\nprice. I had followed this wonderful company's stock price…",
  "data/reddit-stocks/r/stocks/comments/rgkvkk/will_inflation_kill_growth_stocks.json": "We all know the Fed meeting is tomorrow where JPow is expected to take a more\nhawkish stance given the 6.8% inflation rate. When the Fed hiked rates in 2018\nthe market really didn't react well.\n\nSo, is the party pretty much over and if so, how are you guys planning on\nplaying the new macroeconomic…",
  "data/reddit-stocks/r/stocks/comments/rglv1c/best_caseworst_case_for_tomorrows_fed_meeting.json": "My thoughts are that a ton of this is priced in (to an extent) particularly\naround growth stocks which have been getting absolutely slaughtered since early\nNovember. If more than two interest rates hikes are in the works for 2022 we\nwill see a slow bleed for the rest of the month. I think faster…",
  "data/reddit-stocks/r/stocks/comments/rgn7pa/draftkings_down_50_in_3_months_whos_holding.json": "Better yet, who is loading up more as it falls under $30?\n\nThe valuation has been pretty crazy for awhile now, but my thoughts are they\nstill have the best product with the best name recognition in their industry.\nThere are still huge markets left to legalize online sports betting. Florida,\nTexas,…",
  "data/reddit-stocks/r/stocks/comments/rgnkz6/is_it_just_me_or_has_this_sub_been_quiet_recently.json": "Myself included, some of my holdings are deep deep red. Some could even say\nslaughtered.\n\nAs scary as it seems, we all got to get through this. I don't know if you're\nportfolio feels like its on fire and yes, if you are in the green congrats, but\neveryone, we need to stay strong.\n\nSome of the…",
  "data/reddit-stocks/r/stocks/comments/rgnrm7/why_is_inflation_bad_for_the_stock_market.json": "Context, I’m a 17 year old who has been investing almost all of my money from\nwork into index tracking ETFs and a few larger cap individual companies.\n\nI’m struggling to understand why high inflation leads to decrease in stock\nprice. To me, it seems like if currency is less valuable, and stock…",
  "data/reddit-stocks/r/stocks/comments/rgv86e/value_vs_growth_warren_buffetts_berkshire_beats.json": "Warren Buffett’s Berkshire Hathway is winning Cathie’s Ark Innovation on the YTD\nchart. With a “value approach” to investing, Berkshire is on a 29.72% profit,\nwhile Ark Innovation, on the “growth approach” edge, is reporting a -25%. The\nlast month has been critical as ARKK has registered a loss of …",
  "data/reddit-stocks/r/stocks/comments/rgw4hp/rstocks_daily_discussion_wednesday_dec_15_2021.json": "These daily discussions run from Monday to Friday including during our themed\nposts.\n\nSome helpful links:\n\n * Finviz [https://finviz.com/quote.ashx?t=spy] for charts, fundamentals, and\n   aggregated news on individual stocks\n * Bloomberg market news [https://www.bloomberg.com/markets]\n *…",
  "data/reddit-stocks/r/stocks/comments/rgzopr/indicators_and_prediction_tools_explained_for.json": "I along with probably many others here are fresh to the trading business. GME\nattracted our curiosity but we realize this isn't how the market generally\nworks. With that being said, I've been doing some research on the different\nfeatures and functionalities given in different online applications so…",
  "data/reddit-stocks/r/stocks/comments/rh1ft6/does_anyone_else_feel_like_were_just_waiting_out.json": "High growth stocks finally take a beating after ridiculous growth the last year,\nvariant news shakes the markets, inflation concerns loom and we wait for holiday\nretail data. My personal bet remains unchanged. 2022 will have healthy, maybe\nmore normal, growth. Maybe companies won’t fly on hopes as…",
  "data/reddit-stocks/r/stocks/comments/rh65q3/pelosi_rejects_stocktrading_ban_for_members_of.json": "House Speaker Nancy Pelosi on Wednesday rejected the idea of banning members of\nCongress and their spouses from holding and trading individual stocks while in\noffice.\n\n\"This is a free market, and people — we are a free market economy. They should\nbe able to participate in that,\" Pelosi said when…",
  "data/reddit-stocks/r/stocks/comments/rh6mv2/fed_will_aggressively_dial_back_its_monthly_bond.json": "The Federal Reserve provided multiple indications Wednesday that its run of\nultra-easy policy since the beginning of the Covid pandemic is coming to a\nclose, making moves that were even more aggressive than markets had anticipated.\n\nThe Fed will be buying $60 billion of bonds each month starting…",
  "data/reddit-stocks/r/stocks/comments/rhb7vi/here_is_a_market_recap_for_today_wednesday_dec_15.json": "PsychoMarket Recap - Wednesday, December 15, 2021\n\nThe stock market opened the day but reversed course and bounced today as\ninvestors digested the Federal Reserve’s final monetary policy decision of 2021\nand Fed Chair Jerome Powell’s speech against a backdrop of persistent\ninflationary pressures.…",
  "data/reddit-stocks/r/stocks/comments/rhcrnr/cathie_wood_sells_arks_highconviction_names_even.json": " * Ark Invest's Cathie Wood said in a recent interview that when her firm's\n   funds are losing ground, Ark looks to gear its positions towards the\n   company's highest-conviction stocks. However, Wood's voluntary trade\n   disclosures shows that she's actually been dumping some of her\n   high…",
  "data/reddit-stocks/r/stocks/comments/rhdj70/powells_speach.json": "Alright, can someone please explain to me, why indexes went straight to the moon\nduring Powell's speach? How are faster tapering and rates spikes in 2022 a good\nnews?\n\nYes I had short position and yes I had to close all of them and lost almost 20%\nof my portfolio on that bet. So now I'm just trying…",
  "data/reddit-stocks/r/stocks/comments/rhggrc/reddit_files_to_go_public.json": "https://www.cnbc.com/2021/12/15/reddit-files-to-go-public-.html\n\nReddit on Wednesday announced that it has confidentially submitted a draft\nregistration statement with the Securities and Exchange Commission to go public.\n\nThe social media company did not make the filing publicly available. The…",
  "data/reddit-stocks/r/stocks/comments/rhlwtb/visas_board_oks_12_billion_share_buyback.json": "Visa Inc. V, +1.11% said in a filing late Wednesday its board has authorized a\nnew $12 billion share repurchase program. Combined with funds left over from a\nprevious authorization, funds available for future share repurchases total $13.2\nbillion, Visa said, with no expiration date. Shares of Visa…",
  "data/reddit-stocks/r/stocks/comments/rhn0ah/why_did_equities_go_up_after_the_fed_announcement.json": "Yesterday the Fed announced 3 interest rate hikes to tackle inflation in 2022.\nThis hawkish move pushed the stock market up after nearly a week of constant\ndecline.\n\nWhy didn't this push the stock market down further? My understanding is that if\nthere are planned interest rate hikes, this tends to…",
  "data/reddit-stocks/r/stocks/comments/rhsfuf/stem_inc_to_acquire_also_energy_holdings_inc_for.json": "> Acquisition to combine two software-focused renewable energy companies leading\n> the energy transition.\n> \n> Accretive transaction expected to accelerate Stem’s growing, recurring\n> software revenue and increase margins.\n> \n> Underscores Stem’s focus on expanding global reach and delivering high…",
  "data/reddit-stocks/r/stocks/comments/rhw05h/investors_flocking_to_defensive_sectors.json": "So, the last couple of days, I've noticed the market is changing hands. Looks\nlike investors are starting to move from Tech to defensive stocks. You can\nliterally see it happening on heat maps of the market. Who's holding their picks\nvs rebalancing? Thoughts?",
  "data/reddit-stocks/r/stocks/comments/rhw3ju/what_is_your_play_for_the_interest_rate_hikes.json": "It is now known that we will face interest raise hikes during the first half of\nnext year and beyond. My question for you fine folks is: do you have a play to\ntry to benefit from the interest hikes, I've recently purchased 2 leaps on XLF\nfor March 2022 and have been holding $C as it declines hoping…",
  "data/reddit-stocks/r/stocks/comments/rhy8qj/potential_big_tech_stocks_shopping_list_today.json": "The nasdaq is dropping about 2.5% as of right now and there are many good\nquality big tech stocks that could be adding to investors long term portfolio.\nStocks such as amzn, aapl, adbe, msft, googl, nvda, fb and crm are some good\nexample. Investors should be keep holding and avoid panic selling,…",
  "data/reddit-stocks/r/stocks/comments/rhy9cp/at_what_price_will_you_buy_sq.json": "Lately fintech is getting murdered including PYPL, SQ, SoFI and etc. The\nquestion is at what price will you buy SQ? SQ is near 52 weeks low around 163ish\nnow. Is now a good time to get in or do you foresee it will drop further coming\nweeks? Interested in hear y’all opinions!",
  "data/reddit-stocks/r/stocks/comments/ri0cfg/massive_volume_candle_last_second_of_the_day.json": "I’ve noticed some companies have massive volume candles in the last second of\nthe day. Typically 5x the volume of any other candle throughout the day. For\nexample Apple today had a 9 million volume candle at close. What is the reason\nfor the HUGE spike and no price movement.\n\nEdit: I'd like to post…",
  "data/reddit-stocks/r/stocks/comments/ri1qsw/the_consumer_financial_protection_bureau.json": "Surprised to not see anything about this on here yet, but the whole sector took\nbeating today because the Consumer Financial Protection Bureau announced it is\ninvesting the buy now pay later sector, more specially, Affirm, Afterpay,\nKlarna, PayPal and Zip.\n\n> The Consumer Financial Protection…",
  "data/reddit-stocks/r/stocks/comments/ri2ch4/rivian_stock_falls_after_posting_solid_q3_revenue.json": "> Rivian (RIVN) reported solid third-quarter revenue Thursday after the market\n> close, but losses were wider than expected. Rivian stock fell in overnight\n> trade.\n> \n> It's the first earnings report for Rivian since its November IPO and since the\n> EV startup began limited deliveries. Rivian also…",
  "data/reddit-stocks/r/stocks/comments/ri2dg3/i_need_advice_from_the_successful_people_of_the.json": "I know this is something that I must understand if I want to make a lot of\nmoney. What’s the best way to truly understand the market and be able to\nanticipate things ahead of time to make tue best possibly amount of money?\nShould I watch YT videos? Buy books? Something else? How long should I…",
  "data/reddit-stocks/r/stocks/comments/ri30lq/here_is_a_market_recap_for_today_thursday.json": "PsychoMarket Recap - Thursday, December 16, 2021\n\nAfter a bounce in the market yesterday, Volatility resumed, with the Nasdaq\n(QQQ) selling off hard amid a big sell-off in technology stocks poised to suffer\nunder a more hawkish Federal Reserve. Market participants continue to digest the\nFed’s…",
  "data/reddit-stocks/r/stocks/comments/ri3kro/how_many_strategies_did_u_try_before_finding_what.json": "i tried pennies and got destroyed. i tried doing my own learning and buying\nbased on fundamentals and got destroyed. Today i said fuck it and decided to go\nwith the flow...inflation is good for banks and staples? ok, so i bought a few\nshares of wfc, jpm, and tgt....\n\ncurious how many different…",
  "data/reddit-stocks/r/stocks/comments/ri449d/december_16th_recap_and_tomorow_dec_17th_quad.json": "RECAP -What a day! -Pre-Market saw us gap up nearly a full 1% to make us reach a\nnew ATH of 473.54! Woot woot! Wait not so fast! -Pre market was about the only\nexcitement that bulls saw today. Immediately after opening she started to bleed.\n-About 1pm i could tell the day was gonna be solidified in…",
  "data/reddit-stocks/r/stocks/comments/ri6pq9/crocs_crox.json": "They have been killing it. Up 130% this year and 1,900% in last 5 years. PE\nratio is at 12 right now and they are growing revenue and earnings like mad, and\ntheir CFO believes they will double revenue (roughly) by 2026. I’ve been too\nobsessed with tech stocks to look down at my damn feet and…",
  "data/reddit-stocks/r/stocks/comments/ri77y9/stock_tip_take_notice_of_trends_that_you_have.json": "Looking back at my stock history this year I noticed I had the most luck when my\npurchase was driven by something I noticed in my normal life, and not so good\nwhen I bought based on an article or analysis.\n\nI consider myself a pretty typical guy. I’m frugal and don’t rush to jump on\ntrends, but…",
  "data/reddit-stocks/r/stocks/comments/ri9ppd/name_your_biggest_stock_mistakes_of_the_year.json": " * Going all in on the reopening stocks (ABNB, Expedia, BKNG etc) too early and\n   getting hammered\n\n * Going into a ton of small caps after the Barron's/WSJ cover stories on small\n   caps only to be caught bag holding after the Russell fell into correction\n   territory\n\n * Going too all in on tech…",
  "data/reddit-stocks/r/stocks/comments/rihm2k/jpmorgan_agrees_to_125_million_fine_for_letting.json": "https://www.cnbc.com/2021/12/17/jpmorgan-agrees-to-125-million-fine-for-letting-employees-use-whatsapp-to-evade-regulators.html\n\nJPMorgan Chase is paying a $125 million fine to settle Securities and Exchange\nCommission charges that its Wall Street division allowed employees to use\nWhatsApp and…",
  "data/reddit-stocks/r/stocks/comments/rijvmu/how_much_of_your_own_money_should_it_take_you_to.json": "Assuming there are a million variables; (how much cash you have on hand at the\nstart, how much you can pump in the market every year, etc) but my personal\nthoughts are I expect to put about 70k+ in over the next few years and am hoping\nwith good management I hit 100k. I'm a construction worker not…",
  "data/reddit-stocks/r/stocks/comments/rincr4/whats_your_worst_performing_stock_that_you_still.json": "I am in but more and have crossed a number of items off my buy list and waded\ninto higher risk higher return waters. I am looking for stocks with solid\nfundamentals that have been beaten up. Looking to buys calls for 2024.\n\nSo what stock have you bought that’s done poorly but you still believe in?",
  "data/reddit-stocks/r/stocks/comments/ris5lh/here_is_a_market_recap_for_today_friday_december.json": "PsychoMarket Recap - Friday, December 17, 2021\n\nStocks extended Thursday’s losses, with the market ending a volatile week in the\nred as market participants continued to digest ongoing risk surrounding the\nOmicron variant and the Fed’s new monetary policy, which signaled a faster rate\nof taper and…",
  "data/reddit-stocks/r/stocks/comments/riteia/what_are_your_10_stocks_for_the_year_2022.json": "Pick your 10 stocks which you are going to buy and hold and believe will perform\nwell in the long term.\nMaybe we can check back in next December to see who had a good spread.! and\ndiscuss about other's spread and suggest.!\n\nI am going to go safe and say:\n\n * NVDA, AMD.\n * VTI, QQQ.\n * SQ, TSLA.\n *…",
  "data/reddit-stocks/r/stocks/comments/ritzxz/what_were_your_biggest_investing_mistakes_this.json": "I opened up a side portfolio to see if I could beat my managed retirement fund.\nI got into things that were more volatile or into sectors they wouldn’t or\ncouldn’t engage in. So my choices were intentionally riskier. I hit a couple of\nwins, but overall, I underperformed and trailed the S&P. And…",
  "data/reddit-stocks/r/stocks/comments/rizf18/realized_my_portfolio_is_nearly_100_tech_any.json": "So with the recent pullbacks affecting the growth sector and Tech, I realized\nthat my portfolio is pretty vulnerable as it's nearly 100% tech (Only reason it\nisn't is because of VOO). I get there's nothing inherently wrong with being Tech\nheavy, as most people and funds are, but I would like to be…",
  "data/reddit-stocks/r/stocks/comments/rj2po4/the_structure_of_reddit_is_a_horrible_fit_for.json": "As an example, I had a thread many months ago discussing the performance of\ninfrastructure stocks such as MLM, Vulcan, Nucor etc... and why they were\nunderperforming despite the assurance or expectation that a infrastructure bill\nwould eventually be passed.\n\nI was told over and over again that I…",
  "data/reddit-stocks/r/stocks/comments/rj7emu/how_long_would_it_take_to_break_even_if_averaging.json": "Title says it all.\n\nIs there a tool that we could input the variables, say, if I put $50,000 in an\naccount that holds S&P 500 at the top of the market in 2007 and henceforth\ncontributed $833 a month to that account ($10,000/yr), how long would it take to\nbreak even?\n\nI have not been able to find an…",
  "data/reddit-stocks/r/stocks/comments/rj9hu7/youtube_tv_loses_disney_espn_abcdrops_price_by_15.json": "https://www.newsweek.com/youtube-tv-loses-disney-espn-live-abc-price-subscription-1660856\n\nYouTube TV has lowered its subscription prices for customers after failing to\nstrike a deal to carry channels owned by Disney. From Saturday, 18 channels\nincluding offerings from ESPN, ABC, and Disney Channel…",
  "data/reddit-stocks/r/stocks/comments/rj9pgu/cathie_wood_says_stocks_have_corrected_into_deep.json": "ARK Invest founder Cathie Wood offered the latest defense of the\nonce-highflying, disruptive innovation strategies that had made her suite of\nexchange-traded funds among the most popular, and best-performing, on Wall\nStreet in 2020.\n\nIn a Friday evening blog post, Wood said that despite a brutal…",
  "data/reddit-stocks/r/stocks/comments/rjjrsu/has_the_fed_always_printed_money_to_support_the.json": "Did QE start after the 2007 crash?\n\nHas the FED from then on always supported the markets via \"printing money\"?\n\nSo now we have the FED stopping supposedly in March 2022.\n\nWhat does that mean exactly?\n\nWill the FED still buy securities and or print money after March 2022?\n\nWhat are they really…",
  "data/reddit-stocks/r/stocks/comments/rjr4gd/steve_cohen_backed_firm_that_wants_to_bring_in_24.json": "Steve Cohen-backed start-up bets on 24-hour trading so investors can react\ninstantly to tweets (cnbc.com)\n[https://www.cnbc.com/2021/12/05/steve-cohen-backed-start-up-bets-on-24-hour-trading-so-investors-can-react-instantly-to-tweets.html]\n\nThe way I see it this drastically harms individual…",
  "data/reddit-stocks/r/stocks/comments/rjud4b/i_think_f_is_a_better_longterm_hold_than_tsla_am.json": "This is just me looking at the basics. So, I am relatively new at trading and\ninvesting (little more than 1 year), and I see tesla at like ~1trillion mkcp,\nand Ford at 80billion. Ford has way more time and experience in the automobile\nindustry and it's always been good at adapting to modern…",
  "data/reddit-stocks/r/stocks/comments/rjvujd/what_do_you_consider_to_be_the_best_longterm.json": "I’ve noticed a lot of my non-tech stocks have performed relatively badly, while\nmy tech stocks are consistently in the green, so I’m just interested in hearing\nyour options on what stocks you have that aren’t in tech and are confident will\nperform well long-term?",
  "data/reddit-stocks/r/stocks/comments/rjvyi6/any_other_growth_stocks_that_would_be_good_to_add.json": "it´s in a fidelity youth account. In total, i have 4,000 to invest, about half\nof that is still cash. My time horizon is over next 10 years. at a point i will\nprobably just put most of the money into VTI or VOO (for those of you who would\nsuggest that, your wisdom will be followed)\n\n\n\nall of these…",
  "data/reddit-stocks/r/stocks/comments/rjzlr9/manchin_says_no_on_bidens_build_back_better_plan.json": "https://www.barrons.com/articles/manchin-says-no-on-bidens-build-back-better-plan-51639927129\n\nSen. Joe Manchin (D., WVa.), said the $1.7 trillion Build Back Better social\nspending and climate change bill is a “no” as far as he is concerned.\n\nThe centrist Democrat told Fox News Sunday he “cannot…",
  "data/reddit-stocks/r/stocks/comments/rk0tl2/tom_lee_calling_for_sp500_19000.json": "Not sure when but I was just watching The Compound with Josh Brown and Tom Lee\nand at about 18:30 he says \"if everything plays out the sp500 is eventually\ngoing to 19k\". I think he's saying 20 years from now.\n\nHe sees sp500 up by double digits also in 2022.\n\nHe also sees the bull market continuing…",
  "data/reddit-stocks/r/stocks/comments/rk442d/you_may_only_choose_one_stock_per_sector.json": "Let’s do a little hypothetical challenge here. Rules: - Your portfolio is\nlimited to 11 total stocks. - You may only choose one stock per sector (list is\nbelow). - No ETFs or other types of funds. - Assume that you can buy the stock\nat fair or below fair value. - Confirm that your stock is…",
  "data/reddit-stocks/r/stocks/comments/rk4q54/youtube_tv_reaches_deal_to_bring_back_disneyowned.json": "YouTube Statement\n\n> We’re happy to share that we’ve reached an agreement with Disney to return\n> their content to YouTube TV while preserving a $64.99/mo. price for our\n> members. We have already started to restore access to Disney networks like\n> ESPN and FX, including their live and on-demand…",
  "data/reddit-stocks/r/stocks/comments/rkd8e0/i_dont_normally_put_much_stock_in_subtle.json": "Currently (10 Eastern Standard Time):\n\nDOW Futures: -830\n\nNASDAQ Futures: -255\n\nS&P Futures: -45\n\n'Dow Jones futures fell solidly Sunday night, along with S&P 500 futures and\nNasdaq futures. Omicron fears and restrictions are mounting with cases of the\nCovid variant spreading rapidly...'",
  "data/reddit-stocks/r/stocks/comments/rkfjmx/reddit_monetization_after_ipo.json": "Hi all,\n\nSomething I've been thinking about lately is Reddit going Public.\n\nA big reason companies IPO is to cash out or sellout to become billionaires*.\nUsually the company grows and becomes worth a lot more, however the platform\nchanges dramatically. The once private company, then focuses on the…",
  "data/reddit-stocks/r/stocks/comments/rkgwlf/if_2022_is_as_bad_as_everyone_is_saying_what_will.json": "If 2022 is as bad for the stock market as many people make it seem, what will\nyour moves be going forward? I began investing during COVID and I know many\nothers did as well, we have not truly experienced a downturn or sideways moving\nmarket since then and many of us are likely unsure of what to…",
  "data/reddit-stocks/r/stocks/comments/rkib3w/the_case_for_srad_to_hit_100_in_4_years.json": "Tired of DKNG and PENN deep dives? Here's a stock pick and analysis we like.\n\nSummary:\n\n * Demonstrates ability to create profits for investors in a market not known\n   for its get-rich-quick profitability.\n * Out-performing sector companions in heavily hit market\n * Growing at 30% YoY while…",
  "data/reddit-stocks/r/stocks/comments/rkmrcp/moderna_shares_jump_says_covid_booster_appears_to.json": "Moderna announced Monday that a third dose of its mRNA vaccine against Covid-19\nappears to provide significant protection against the omicron variant.\n\na double doze of the booster shot — 100 micrograms, rather than the approved 50\nmicrograms — was significantly more effective. A 100 microgram…",
  "data/reddit-stocks/r/stocks/comments/rkng2h/these_last_two_weeks_were_bad.json": "The last two weeks I’ve lost about 25% of my portfolio through ill placed trades\nthat went against me, being on the opposite side of the winning trade and prices\nmoving faster than I could predict and keep up. I primarily will only buy or\nsell one legged options (buy calls/puts or implement the…",
  "data/reddit-stocks/r/stocks/comments/rkp6b9/chile_stock_market_plummets_on_leftist_borics.json": "SANTIAGO - The Chilean stock market and peso took a beating Monday after leftist\nmillennial Gabriel Boric became the country's youngest-ever president-elect with\nan unexpectedly substantial victory over his far-right rival.\n\nFollowing a night of street celebrations at the end of a polarizing runoff…",
  "data/reddit-stocks/r/stocks/comments/rkq4qq/why_do_you_believe_the_markets_tanked_this_morning.json": "First, new news asserts Biden failed to execute the 'Build Back Better\nFramework' Bill. Second, cargo ships are stuck in California ports which\naggrevates supply chain issues. Third, and finally, this could be the result of\nsomething much more complex or simple as the omnicron varient…",
  "data/reddit-stocks/r/stocks/comments/rkuoq8/i_have_covid_jim_cramer_says_he_says_hes_been.json": "Source\n[https://www.cnbc.com/2021/12/20/i-have-covid-jim-cramer-says-he-says-hes-been-triple-vaccinated-and-has-a-mild-case.html]:\n\n> “I have Covid. I came down with Covid on Thursday night,” Cramer said on\n> “Squawk on the Street.” He added he’s been triple vaccinated: two shots of\n> Moderna and a…",
  "data/reddit-stocks/r/stocks/comments/rkvpch/would_you_buy_goog_or_amzn_today.json": "If you had the ability to buy some shares today in Amazon and Google. Which one\nwould you buy.\nWith the pullback in the market I have some cash sitting I want to make buy\ntoday. Not looking to sell it for 3 to 5 years. AMZN $3,337. 50 GOOG $2,838.01",
  "data/reddit-stocks/r/stocks/comments/rkyf4u/cathie_wood_my_stocks_are_now_deep_value_headed.json": "> Cathie Wood of Ark Investment Management says her stocks are in “deep value\n> territory,” not in a bubble, and should generate hefty returns over the next\n> five years.\n> \n> “After correcting for nearly 11 months, innovation stocks seem to have entered\n> deep value territory, their valuations a…",
  "data/reddit-stocks/r/stocks/comments/rkz1el/the_market_did_not_drop_because_of_omicron.json": "This is a general post about event being fit onto market action after the fact.\nIt is so silly. Why didn't anyone say \"Market up the last 5 days due to Omicron\nvariant\" ? I could find 20 events, both positive and negative, that could be\nused to explain why the market went up or down. If the market…",
  "data/reddit-stocks/r/stocks/comments/rkz427/semiconductors_are_set_to_outperform_the_market.json": "Despite a massive shortage, the earnings for virtually all of them including MU\nwhich reported tonight, constantly beat and are exceeding expectations. MU had\n20 downward revisions according to SA beforehand and yet still beat. TWENTY\ndown, 0 upward revisions! Crazy! These analysts are…",
  "data/reddit-stocks/r/stocks/comments/rl20sd/its_difficult_to_make_a_case_for_buying_growth.json": "But PYPL, SQ, SHOP, AMZN and a few others are too good not to buy now...\nEveryone is fearful of catching a falling knife but there's something that many\nare forgetting about this market...\n\nLast year we had a new generation enter the market in one of the biggest\nintroductions in market history. The…",
  "data/reddit-stocks/r/stocks/comments/rl5750/why_does_robinhood_say_im_up_for_the_day_even.json": "all my positions are in the red for the day but robinhood says I've gained money\ntoday. is it because RH calculates pre market differently or something?\n\nI've also had similar issues where RH will have pre market just show up as\ncompletely blank 30 minutes before market opens, and the graphs are…",
  "data/reddit-stocks/r/stocks/comments/rlcb6s/clean_energy_outlook_for_2022.json": "Just posting to hear everyone’s thoughts on clean energy for the next year.\n\nI’ve got some long term positions in INRG (UK equivalent of ICLN) and $PLUG\nwhich has pretty much been flatlining after that bubble for the last year.\n\nI fully understand clean energy is a long term investment but do you…",
  "data/reddit-stocks/r/stocks/comments/rlfws3/starbucks_sees_consumers_ringing_up_3b_worth_of.json": "According to Starbucks estimates released Tuesday, Dec. 23 will be the busiest\nday for gift card purchases, as holiday shoppers scramble to find the final\nitems on their lists for friends, family and co-workers.\n\nThe Seattle-based coffee giant said that nearly $3 billion dollars will be\nloaded onto…",
  "data/reddit-stocks/r/stocks/comments/rlg4t8/looking_to_move_from_robinhood_to_better_trading.json": "I understand Robinhood is complete trash. Looking for a brokerage platform that\noffers fractional shares and user friendly.\n\nWhat would you all recommend? Also, how do I transfer investments from RH to new\nbrokerage\n\nEdit: thanks for all the replies! Not looking for options/margin. Mainly ETF…",
  "data/reddit-stocks/r/stocks/comments/rlgzb0/if_predicting_the_market_is_impossible_then_what.json": "History has shown that predicting the market with 100% accuracy is not feasible.\n\nSo what do you guys base your buying/selling decisions off?\n\nIt seems as if everyone has their own strategy but I'd be interested in seeing\nwhat reddit thinks of this?\n\nDoes prediction contest like this…",
  "data/reddit-stocks/r/stocks/comments/rllq40/whats_the_dumbest_logicemotion_you_ever_used_when.json": "For me, I bought 20 shares of BABA at $280 and averaged to about 70 shares at\n$265. Saw it fall to $210 and decided I will sell it when I break even. Sold 50\nshares for a $22 loss when it made a comeback and wanted to sell the rest for a\n$22 profit so that I get away with a perfect break-even…",
  "data/reddit-stocks/r/stocks/comments/rlo5dv/update_if_news_media_had_any_logical_consistency.json": "Yesterday's thread deserves the logical follow up. Well, media said Omicron\ncaused the market to drop yesterday. Ok, well, the markets are up nicely today.\nHow come no financial media outlet is saying Omicron is now cured, since the\nmarket is just as green today as it was red yesterday? Because…",
  "data/reddit-stocks/r/stocks/comments/rloe30/here_is_a_market_recap_for_today_tuesday_dec_21.json": "PsychoMarket Recap - Tuesday, December 21, 2021\n\nApologies for no recap yesterday, I was traveling all day back home to spend\nChristmas with my parents\n\nThe market staged a comeback on Tuesday, with all three major indexes rising\nmore than 1% as market participants digested news of federal…",
  "data/reddit-stocks/r/stocks/comments/rlqqgq/target_showed_a_big_pop_in_november_sales_outside.json": "I've been watching this closely lately. The stock didn't rally today and is flat\nafter hours but it seems like it has bottomed. Thoughts?\n\nhttps://www.startribune.com/target-showed-a-big-pop-in-november-sales-outside-data-suggests/600129235/\n\nTarget is an early winner of the U.S. holiday shopping…",
  "data/reddit-stocks/r/stocks/comments/rlqre4/in_addition_to_the_santa_rally_what_other.json": "It would be great if we can compile of list of these seasonality trends,\nincluding their NAME and DURATION:\n\n * Santa Rally: Mid December to late January?\n\n * Sell in May and Go Away: May to October\n\nNote: I'm not saying these adages are correct. I just want to know what they\nare.",
  "data/reddit-stocks/r/stocks/comments/rlvyia/what_happens_to_google_if_the_doj_blocks_google.json": "Apple is probably content with Google paying increasing annual fees to be the\ndefault search engine on iOS devices but I would be surprised if they don't have\ntheir own search engine ready to go if/when the DoJ blocks Google from paying\nApple billions a year to be the default search engine so…",
  "data/reddit-stocks/r/stocks/comments/rlwdsi/top_picks_for_2022.json": "As 2021 comes to an end through a bumpy last few weeks but an overall good EOY\ngrowth on the SPY and Nasdaq, I am wondering what your speculative, through\nresearch and DD of course, growth stocks are for the coming year. Any ticker\nsymbols in particular that you have loaded up from these recent…",
  "data/reddit-stocks/r/stocks/comments/rlzmjr/elon_musk_says_hes_sold_enough_tesla_stock_to.json": "Elon Musk said Tuesday he’s met his goal of selling 10% of his stake in Tesla\nInc., and criticized California for “overtaxation.” In a nearly hourlong podcast\ninterview with the satirical website the Babylon Bee, the Tesla TSLA, +4.29% CEO\nsaid: “I sold enough stock to get to around 10% plus the…",
  "data/reddit-stocks/r/stocks/comments/rm2nwh/if_we_assume_republicans_will_win_both_the_house.json": "Lots of talk about, \"Election years are notoriously sketchy for markets.\"\nbecause of the uncertainty... but for my money, it seems fairly obvious that\nRepublicans are going to have a very strong likelihood of taking back power for\nthe midterms.\n\nIF you believe this to be true, what is the best way…",
  "data/reddit-stocks/r/stocks/comments/rm33vu/palantir_and_stock_compensation.json": "So I'm holding Palantir (actually still in + as my avg is 15,5). And no i made\nno analysis what i bought it was simply herd mentality and it look great for a\nlong time untill now when it is at around 19.\n\nI'm having a hard time understanding if growth can be sustained and maybe more\nimportantly,…",
  "data/reddit-stocks/r/stocks/comments/rm62fx/baba_news_china_gov_pulled_support_for_baba_cloud.json": "As the title said, BABA discovered a security flaw in Apeche Log4J and reported\nto the software developer (vendor). The CCP is pissed off because it wants to\nknow about the flaw first.\n\nAs the result, CCP pulled support for BABA cloud services for 6 months.\n\nThe real reason: CCP wants to know about…",
  "data/reddit-stocks/r/stocks/comments/rm6vj3/higher_risk_growth_stock_ideas.json": "I am still in buy mode and expecting an optimistic 2022. I have been buying\nleaps in companies I see doing well over the next couple years. I am ideally\nlooking for somewhat beaten companies with low premiums but strong fundamentals.\nAs an example I just bought some Verizon $55 2024 leaps at a…",
  "data/reddit-stocks/r/stocks/comments/rm9rce/webull_is_not_my_jam.json": "I switched from fidelity to webull and I hate it. Their customer service is poor\nand their desktop app is pathetic. I do like their mobile app but over i would\nnot suggest this platform at all.\n\nAnyone else use webull?",
  "data/reddit-stocks/r/stocks/comments/rmfnxh/here_is_a_market_recap_for_today_wednesday_dec_22.json": "PsychoMarket Recap - Wednesday, December 22, 2021\n\nStocks traded mostly higher on Wednesday, with all three major indexes extending\nyesterday’s gains, as market participants digested FDA approval of a Pfizer’s\n(PFE) oral coronavirus treatment and new reports about US gross-domestic product\n(GDP)…",
  "data/reddit-stocks/r/stocks/comments/rmhd7u/markets_at_close_12222021.json": "Today in brief\n\nS&P: 4,696.56 (+47.33) (+1.02%)\n\nDow: 35,753.89 (+261.19) (+0.74%)\n\nNasdaq: 15,521.89 (+180.81) (+1.18%)\n\nThe US markets extended their rally inching up higher today and the S&P regained\nmost of the losses it made during the current disastrous December. With the VIX\nfalling down to…",
  "data/reddit-stocks/r/stocks/comments/rmi7mj/novavax_says_early_data_shows_covid19_vaccine.json": "Novavax [https://www.wsj.com/market-data/quotes/NVAX] Inc. NVAX -4.07%\n[https://www.wsj.com/market-data/quotes/NVAX?mod=chiclets]said its two-dose\nCovid-19 vaccine\n[https://www.wsj.com/articles/novavax-covid-19-vaccine-gets-first-authorization-in-indonesia…",
  "data/reddit-stocks/r/stocks/comments/rmijyz/1_stocks_1_stock_only.json": "Alright people of the internet. I have a yolo question. If you had $15K to buy\none stock and one stock only to buy and hold for the foreseeable future what\nwould it be? Here are the details. I have a bit of money and am thinking of\nthrowing it into one stock, and a fun investment. I know lots of…",
  "data/reddit-stocks/r/stocks/comments/rmk0w9/whats_happening_to_squarepaypal.json": "Square financials seem to be slipping a bit, so I can see their stock reflecting\nthat. But then PayPals financials are relatively solid, yet their stock has slid\nalmost identically to Squares. What's happening?",
  "data/reddit-stocks/r/stocks/comments/rmmd1z/what_are_reasons_why_companies_with_lower_growth.json": "For example, Domino's Pizza and Costco have PE ratios of about 41 and 47,\nwhereas Facebook and Alphabet have PE ratios of about 24 and 28.\n\nFacebook and Alphabet have historically had higher growth and have higher growth\nexpectations so what could be the reason behind the large difference in…",
  "data/reddit-stocks/r/stocks/comments/rmrq4y/novavax_stock_jumps_nearly_5_following_positive.json": "Novavax Inc. shares gained in the extended session Wednesday after the biotech\ndrug maker said initial data showed its COVID-19 vaccine booster showed immune\nresponses against the omicron variant. Novavax NVAX, -4.07% shares ended\nafter-hours trading up 4.8%, after rising as much as 6% and dropping…",
  "data/reddit-stocks/r/stocks/comments/rmy8fl/tis_the_season_to_keep_on_buying.json": "My expectation for a strong 2022 remains in tact. There are still opportunities\nfor big legislative bills and when the weather warms up the omicrons jitters\nshould melt away as well. So what’s everyone buying this holiday season? I\npicked up some Verizon and Disney today to start",
  "data/reddit-stocks/r/stocks/comments/rn1ql4/which_stocks_would_return_100_in_next_5_years.json": "I know there is no crystal ball and no one knows what tomorrow brings. I have\nbeen investing for almost twenty years and have gone through a couple cycles. At\nthe same time I built a decent portfolio. However, if I could double it twice,\nonce every 5 years I could retire early and very comfortably.…",
  "data/reddit-stocks/r/stocks/comments/rn2a7q/what_stocks_are_currently_sitting_significantly.json": "Other post got removed for low effort because I deleted some of the text from my\npost. So I'll put it back.\n\nAnyways, COIN being a glaring example and BA being another example to a lesser\nextent.\n\nI'm looking mainly for mid and large caps, but if you do have a really really\ngreat small cap that…",
  "data/reddit-stocks/r/stocks/comments/rn2f2y/crox_buy_the_dip.json": "Crocs footwear made what looks like a solid acquisition today and bought HEYDUDE\nto expand their profitable footwear line. As a result, they are down 14% to $120\na share, which is well below what they were previously trending at.\n\nAnyone else buying the dip?",
  "data/reddit-stocks/r/stocks/comments/rn5frb/here_is_a_market_recap_for_today_thursday_dec_23.json": "PsychoMarket Recap - Thursday, December 23, 2021\n\nThe stock market continued its positive momentum, with all three major indexes\npushing higher for the third straight day to close out the holiday-shortened\nweek as investors continue to digest a trove of new economic data, including a\nreport on…",
  "data/reddit-stocks/r/stocks/comments/rn5hbo/has_this_been_the_most_bipolar_month_ever_for.json": "Not a huge deal since the majority of my holdings are blue chips and index\nfunds, but I have used some of these drastic swings to pick up some TQQQ while\nthe market was down.\n\nThese swings have been crazy though, wondering if it's just my holdings or the\nentire market.",
  "data/reddit-stocks/r/stocks/comments/rn87bq/globalfoundries_announces_extension_of_amd_wafer.json": "https://www.prnewswire.com/news-releases/globalfoundries-announces-extension-of-amd-wafer-supply-agreement-to-guarantee-supply-301450593.html\n\nGlobalFoundries Inc. (Nasdaq: GFS) (GF), a global leader in feature-rich\nsemiconductor manufacturing, today announced that it has agreed to amend its\nWafer…",
  "data/reddit-stocks/r/stocks/comments/rn8x3j/first_year_investing_just_a_10k_well_7k15k.json": "Basically I decided to finally learn about investing by having \"some skin in the\ngame.\" I've made some, I've lost some, I've dabbled in options, nothing too\ncrazy. Started of course by buying calls, then dabbled in selling calls and\nputs, and basically I feel really comfortable selling calls. My…",
  "data/reddit-stocks/r/stocks/comments/rnd72l/tencent_to_hand_16_billion_stake_in_jdcom_to_its.json": "Internet giant Tencent Holdings Ltd. is planning to distribute more than $16\nbillion worth of shares in JD.com Inc. to its shareholders, which will result in\nit no longer being the Chinese e-commerce firm’s biggest shareholder.\n\nFrom March on, Tencent will give out around 457 million Class A shares…",
  "data/reddit-stocks/r/stocks/comments/rnfpd3/who_is_the_best_ceo_right_now_and_which_ceo.json": "And I don't mean the charismatic and messianic type when I say the best. I mean\nthe one who have a substantial record of accomplishments and his vision is being\nproved right. For me that one now is Jensen Huang from Nvidia. When I say the\none who should go away, he can have the best record, but he…",
  "data/reddit-stocks/r/stocks/comments/rnjjjz/2021_lookback_low_profile_stocks_that_made_big.json": "What are your favorite lesser known stocks that got a big boost this year?\n\nMine were Inmode (awesome fundamentals, up 200%) and Arista Networks (data\ncenter and cloud network player, up 100%).\n\nBig disappointment was BDSI - despite making $150M in rev, was valued around\n$320M for most the year.…",
  "data/reddit-stocks/r/stocks/comments/rnoee7/spy_vs_voo_why_spy.json": "SPY seems to be one of the most common ETFs I hear about when talking about\nfunds that rack the S&P 500. I have also seen VOO mentioned so I got looking\ninto it.\n\nI may just be missing something but... Why would someone go SPY over VOO? The\nperformance over the last 10 years is near identical,…",
  "data/reddit-stocks/r/stocks/comments/rnpqjv/morgan_stanley_strategists_say_the_easy_returns.json": "Some highlights of the 2022 global investment outlook from MS.\n\n- Inflation peaking as supply chains ease up\n\n- S&P500 to decline 5% in 2022\n\n- Europe and Japan reasonably priced and should see growth\n\n- Stock selection to matter more than the style and sector\n\n- Oil (90$/barrel) and Aluminum top…",
  "data/reddit-stocks/r/stocks/comments/rnqij1/how_do_you_deal_with_being_down_30_or_more_on.json": "Bought some stocks in varying industries and their peaks were either in February\n(certain small, mid caps, and a few large caps), July (certain telecoms and\ninternational stocks, or around November (high multiple stocks).\n\nI didnt sell and tried to be a long term investor and holding those stocks…",
  "data/reddit-stocks/r/stocks/comments/rnrxle/tgt_cost_or_both.json": "So for my \"consumer staples inflation protection\" type of stocks I'm trying to\ndecide between COST TGT or just 50/50 both of them.\n\nGoing back to 1985 TGT has outperformed COST, but recently 2011 to 2021 COST has\noutperformed TGT.\n\nTGT looks like a much better value now compared to COST.\n\nSo I'm…",
  "data/reddit-stocks/r/stocks/comments/rnuw44/this_is_beyond_depressing_how_is_anyone_going_to.json": "According to the Transamerica Center for Retirement Studies’ report, the median\nretirement savings in the United States by age is: Americans in their twenties:\n$16,000 Americans in their thirties: $45,000 Americans in their forties: $63,000\nAmericans in their fifties: $73,000 Americans in their…",
  "data/reddit-stocks/r/stocks/comments/ro1kgs/175k_in_cash_how_to_hedge_for_inflation.json": "I currently have $25k in the stock market, mostly in ETF's. I have another $175K\nsitting in a savings account. I don't need this money for the next 20 years. I\nhave low risk tolerance but I can take high risk on $10K or $20K. I'd love some\nassistance on how to invest this money. Any YouTube…",
  "data/reddit-stocks/r/stocks/comments/roexvc/is_swan_better_than_cash.json": "So I know holding cash is a popular strategy to buy dips and currently I've been\nsuing $MINT as a substitute as at least it provides a dividend. Today, I learned\nabout SWAN which is more or less a 65/35 bond/equities etf that hedges against\ncrashes.\n\nWhy shouldn't I just hold this as cash instead…",
  "data/reddit-stocks/r/stocks/comments/roglya/what_to_do_with_300k_usd_cash_in_this_market.json": "30yr old married no kids 100k USD invested in stocks and bonds 6 months\nemergency fund available.\n\nInherited 300k form father. Markets at ATH worried about stocks, don't want to\ninvest in house as job keeps me moving. What should I do with this much of cash.\nHow/where should I invest it?\n\nTarget is…",
  "data/reddit-stocks/r/stocks/comments/rojtyn/share_your_favorite_funny_story_or_joke_related.json": "I know this is a serious sub but I hope this is ok in the spirit of the\nholidays.\n\nOne of my favorite is a joke told by Warren Buffett about his friend Charlie\nMunger -- a notorious huge fan of Costco.\n\nStory goes ...\n\nA terrorist hijacked a private jet carrying Buffett and Munger.\n\n\"Before I…",
  "data/reddit-stocks/r/stocks/comments/rok7d9/there_is_no_alternative_to_stocks_is_one_reason.json": "One reason why stocks are at historic highs right now is that \"There is no\nalternative to stocks\" (or Tina).\n\nConventional wisdom says this advantage will be gone once the fed raises rates.\nWhile this might be true, is it possible that the reversal is not going to be as\nstrong as analysts believe…",
  "data/reddit-stocks/r/stocks/comments/roycsa/what_are_fundamemtals_of_a_company_i_should_look.json": "What are fundamemtals of a company I should look before buying their stock?I\nalso heard PE ratio and other metrics.What should I be looking at a company\nbefore buying it (in your opinion and experience)?",
  "data/reddit-stocks/r/stocks/comments/rp0ih1/what_individuals_stocks_had_a_good_2021_and_flew.json": "I have noticed whenever there is a thread about what to do with x amount of\ncash. The top replies are always just buy SPY/VOO/VTI.\n\nThose that invest in individual stocks were there any that had a great year but\nflew under the radar on stock subs?",
  "data/reddit-stocks/r/stocks/comments/rp11nq/reasons_for_adding_tlry_to_all_of_my_portfolios.json": " 1. 2021 net revenue increased 25% to $142.2 million from 2020\n\n 2. EBITDA (earnings before interest, taxes, and depreciation) up 285% from\n    2020, to $12.3 million during the fourth quarter from $3.2 million\n\n 3. Although gross profit decreased 19% from 2020, free cash flow increased 112%\n   …",
  "data/reddit-stocks/r/stocks/comments/rp1pzo/wall_street_week_ahead_for_the_trading_week.json": "Good Sunday afternoon to all of you here on r/stocks [/r/stocks]! I hope\neveryone on this sub made out pretty nicely in the market this past week, and\nare ready for the new trading week ahead.\n\nHere is everything you need to know to get you ready for the trading week\nbeginning December 27th,…",
  "data/reddit-stocks/r/stocks/comments/rp2krd/so_im_20_and_just_inherited_20000_bucks_and_want.json": "Hey guys, I‘ve already invested a bit, mainly 4k into VT, 500 each into AAPL,\nNVDA, AMD and PLTR and another 200 into AMD.\n\nNow I just stumbled upon this subreddit and was wondering what your top 5\nstocks/ETFs are that pay out a lot of dividends. Cause I don‘t know too much\nabout the dividends side…",
  "data/reddit-stocks/r/stocks/comments/rp783k/what_value_stocks_are_you_adding_to_in_2022.json": "By now, we're all well aware that stocks with lofty valuations have been under\nscrutiny with higher interest rates imminent. What lower valued stocks are you\nlooking at going into the new year?\n\nMine is Renewable Energy Group $REGI. P/E is 11. Currently near 52 wk lows. Low\ndebt. Recent insider…",
  "data/reddit-stocks/r/stocks/comments/rp97bu/despite_supply_issues_and_omicron_holiday_sales.json": "https://www.cnbc.com/2021/12/26/despite-supply-issues-and-omicron-holiday-sales-rise-8point5percent.html\n\nHoliday sales rose at the fastest pace in 17 years, even as shoppers grappled\nwith higher prices, product shortages and a raging new Covid-19 variant in the\nlast few weeks of the season,…",
  "data/reddit-stocks/r/stocks/comments/rpcfni/palantir_technologies_pltr_whats_it_worth_warren.json": "Happy Holidays Friends! Here's my analysis on one of the most discussed and\nmisunderstood companies over the last year. As one of the Paypal Mafia\n[https://en.wikipedia.org/wiki/PayPal_Mafia]'s creations, Palantir Technologies\n(\"Palantir\", \"PLTR\" or the \"Company\") originated from fighting fraud at…",
  "data/reddit-stocks/r/stocks/comments/rpdbuz/debating_between_googl_and_tsla_minimum_5year_hold.json": "Sold the house and downsized into a nicely located apartment. Wife and I have\nspent the last two weeks doing our best to understand stocks in\ngeneral...realized it's not our strongest forte so after maxing our 403b's we\nhave about 30k left for a long term hold. As much as we enjoy being…",
  "data/reddit-stocks/r/stocks/comments/rpocb6/why_is_it_that_this_sub_is_for_stocks_but.json": "Title.\n\nJust wondering why that's the case. Yes, I understand individuals picking stocks\naren't successful over a long-term horizon, but anytime someone asks what\ncompany looks better, 90% of the answers go directly to VTI or SPY or other\nindex funds!?!\n\nIsn't the purpose of this sub to discuss…",
  "data/reddit-stocks/r/stocks/comments/rpt2ao/disruptive_stocks_that_will_shape_the_next_10.json": "25 years ago, Bill Gates wrote an article title \"Content is King\" where he\nmentioned that years from now, the next big companies will be the ones that\ndon't currently exist.\n\n25 years ago, we didn't know that Cloud Computing, Electric Cars, or\nSemiconductor Chips will grow to dominate the market as…",
  "data/reddit-stocks/r/stocks/comments/rpygbg/here_is_a_market_recap_for_today_monday_december.json": "The following was written on the recap I wrote December 3\n[https://www.reddit.com/r/stocks/comments/r8as26/here_is_a_market_recap_for_today_friday_december/]:\n“On a personal note, I am taking this opportunity to do some very small\ndip-buying. As usual, I believe the market is overreacting (as it…",
  "data/reddit-stocks/r/stocks/comments/rq00mk/stock_certificate_from_1931.json": "Hi there,\n\nNo idea what I’m doing. But I’m trying to buy a house and my mother just gifted\nme a certificate of five shares of “class a common” stock of a company that\nstill exists, from 1931.\n\nWhere on earth do I even begin to think about what this might be worth?",
  "data/reddit-stocks/r/stocks/comments/rq0gzq/is_it_too_late_for_the_stock_market.json": "Hi everybody, I'm kind of old 56 but I never thought I would be on a site asking\nfor people's opinions on reputable mutual funds or good dividend-paying funds, I\nwas an investor and certificates of deposit my whole life, I recently bought\ninto some BP stock about three years ago when it was super…",
  "data/reddit-stocks/r/stocks/comments/rq0iqx/is_canoo_goev_undervalued_or_fairly_valued_why.json": "I noticed that Canoo $GOEV, a company that specializes in building compact EV\nvans and pickups, is worth only around 2B today. Compare that to Tesla (1100B),\nLucid (63B), NIO (47), etc. Even Nikola (NKLA), the EV company that has\nliterally been proven to be fraud, is worth almost 5B.\n\nSo why is…",
  "data/reddit-stocks/r/stocks/comments/rq3uq8/stocks_to_buy_in_2022.json": "Hey y’all what stocks are you buying the last week of the year and going into\n2022? I’ve sold off my stocks and made profit now all I have left is ETFs and\nCryptos. What companies are you getting into? I wish I could buy SpaceX. I\nreally like tech companies but will buy into whatever. So let me…",
  "data/reddit-stocks/r/stocks/comments/rq65e3/what_are_your_top_5_tech_stocks_under_50b_market.json": "To start the new year I’m going to be allocating a small portion of my portfolio\nto create a small tech “fund” with 25 stocks. The goal will be to beat QQQ\n(which I also own) over the course of 2022 with stocks that I have minimum\nexposure to (thus the market cap rule). Individual Stocks will be…",
  "data/reddit-stocks/r/stocks/comments/rq8xxd/how_does_shopify_have_earnings_larger_than_its.json": "for Shopify's last quarter, Google finance shows $1.12B in revenue and $1.15B in\nearnings. Normally, I would assume google finance is making an error, but on\nYahoo finance, I see similar numbers. So what gives? Does SHOP actually have a\nprofit margin of around 100% due to some weird accounting…",
  "data/reddit-stocks/r/stocks/comments/rqa7dj/jpmorgan_says_investors_are_too_bearish_no.json": "There’s little reason to fear that the rally that catapulted U.S. stocks to\nsuccessive records this year will end soon, according to JPMorgan Chase & Co.\nstrategists. In fact, it may get broader. “Conditions for a large selloff are\nnot in place right now given already low investor positioning,…",
  "data/reddit-stocks/r/stocks/comments/rqbjd2/why_visa_stock_is_underperforming_the_market_but.json": "FULL Articles with Photos Here\n[https://www.investingupgraded.com/post/a-dividend-investor-s-viewpoint-on-visa]\n\nVisa Inc. is a global payments technology company that connects consumers,\nbusinesses, financial institutions and governments in more than 200 countries\nand territories to fast, secure…",
  "data/reddit-stocks/r/stocks/comments/rqf6mk/the_sec_is_going_too_easy_on_insider_trading.json": "https://www.bloomberg.com/opinion/articles/2021-12-28/the-sec-is-going-too-easy-on-insider-trading\n\nAt long last, the Securities and Exchange Commission has sketched out a plan to\naddress a difficult issue in the U.S. stock market: how and when corporate\ninsiders, who inevitably have better…",
  "data/reddit-stocks/r/stocks/comments/rqiaoz/i_am_looking_for_a_high_risk_and_high_reward_stock.json": "I am almost done with my end of year stock shopping. I am looking for a couple\nmore high risk and high reward plays. I have a well funded 401k and core\nportfolio compromised of ETFs and blue chips. I am specifically looking for a\ncompany carrying a good amount of risk that could blow up over the…",
  "data/reddit-stocks/r/stocks/comments/rqinxo/portfolio_of_companies_you_actually_use.json": "If you were to build a portfolio of 10 individual stocks that reflected products\nor services you use the most in daily life, what would it look like? Here is\nmine, in no particular order:\n\nAAPL (multiple devices)\n\nMSFT (PC at work)\n\nGOOGL (tons of online stuff)\n\nAMZN (shopping, streaming, Kindle…",
  "data/reddit-stocks/r/stocks/comments/rqpluo/disney_just_awarded_a_patent_for_virtual_world.json": "I don't know about any of you, however I am a little bit upside down on Disney\nstock. As I'm watching CNBC, and seeing Pete and Jon talking about Disney 155\noptions exploding with buys, then Mr. Wonderful talking about doubling his\nposition, I started wondering what is going on.... After doing some…",
  "data/reddit-stocks/r/stocks/comments/rqqzs6/here_is_a_market_recap_for_today_tuesday_december.json": "PsychoMarket Recap - Tuesday, December 28, 2021\n\nAfter four positive sessions and a new record high yesterday, the S&P 500 (SPY)\ntook a breather with tech stocks cooling down in a very choppy trading session.\nMarket participants continue to weigh surging coronavirus cases throughout the\nworld…",
  "data/reddit-stocks/r/stocks/comments/rqtq9c/time_to_short_vail_resorts_mtn.json": "I follow stock markets loosely but I follow skiing intensely. I realize those\ntwo communities rarely overlap, but for those of you with more expertise in the\nformer community, I invite you to deep dive Vail Resorts and look at the slow\nburn which has been festering over the past few years in the…",
  "data/reddit-stocks/r/stocks/comments/rqx242/what_happens_to_tesla_ifwhen_elon_musk_steps_down.json": "Most of my portfolio is right now riding in Tesla. I have 0 concerns with\ncompetition and other random issues that pop up (ignorant or not).\n\nBut hypothetically, what predictions of teslas stock would you have if Elon Musk\ndecided to completely walk away and give someone else complete…",
  "data/reddit-stocks/r/stocks/comments/rqxfj8/the_biggest_difference_between_19982000_and.json": "From 1998 to April 2000, no one lost money. All stocks were up, pretty much.\nToday, the SPY is breaking new highs while there are many stock pickers who have\nlost money recently. The big 5 are only about 5% off their peak, but some\nspeculative stocks are down 50% or more, in the middle of a raging…",
  "data/reddit-stocks/r/stocks/comments/rqzp49/the_january_effect.json": "What are your thoughts on such? Do you believe it is reasonable, most likely to\nhappen or not at all? Is this market prediction scary to you? I would like to\nhear what y'all think.\n\nFor those who do not know the January effect is the belief that in January\nsecurities increase in price more than any…",
  "data/reddit-stocks/r/stocks/comments/rr06cj/what_are_your_nontech_stocks_for_2022.json": "Tech is great. Apple, Microsoft, Facebook, Google, Microsoft, AMD, etc. are all\ngreat. But I’m curious, what non tech stocks do you have in your portfolio for\nthe up coming year. I got WM and BAC before 2021. But I’m looking for others for\n2022.",
  "data/reddit-stocks/r/stocks/comments/rr5xz1/realizing_these_7_trading_mistakes_saved_me_over.json": "If you’ve recently started trading, you’re likely very disturbed by the recent\npullbacks and volatility, especially among high-flying household tech stocks\nlike Docusign, Roku, and Teladoc, which are down 45% from recent highs. Even\nmore jarring was the complete crash of Chinese darlings Alibaba,…",
  "data/reddit-stocks/r/stocks/comments/rraqcs/my_first_year_in_the_market.json": "What a year of learning for me. So many ups and downs. Everyone says buy low\nsell high and right now everything is on sale. Stocks that I bought for twice\nthe price in Jan. are at an all time low.\n\nDoes this happen every December? I’m so new to this but is there a pattern\naround this time where…",
  "data/reddit-stocks/r/stocks/comments/rrhoka/to_all_of_you_who_are_red_this_year_while_the.json": "Lately I keep hearing the same old narrative from beat-down investors on\nr/stocks [/r/stocks] who are down YTD even when SPY is up 30%: \"everything is\ndown this year, the indexes are just being propped up by mega-cap tech companies\nlike AAPL, TSLA, MSFT, GOOGL, and NVDA\". They go on to say that…",
  "data/reddit-stocks/r/stocks/comments/rritf4/pe_ratio_isnt_everything_but_it_would_do_a_lot_of.json": "I see so many people on this sub and other finance-related subs recommend\ncertain stocks simply because they're great companies. A lot of people seem to\nfail to realize the fact that the expected growth and development of some\ncompanies is already priced into their stock price and that their…",
  "data/reddit-stocks/r/stocks/comments/rrjdvl/here_is_a_market_recap_for_today_wednesday_dec_29.json": "PsychoMarket Recap - Wednesday, December 29, 2021\n\nStocks ended the day mostly flat in a pretty uneventful day as the stock market\ntook a breather from the four-day Santa Claus rally that saw the S&P 500 (SPY)\ngain roughly 4% in just over a week. With no new economic data being released\nthis week…",
  "data/reddit-stocks/r/stocks/comments/rrqjgh/how_would_you_generate_1kmonth_with_150k_in.json": "How would you generate $1k (or hopefully even more at times) in monthly income\nusing about $150k in capital? I’m looking at alternatives to what I did this\nyear. Dividend etf? S&P etf (maybe swing trade it with a monthly withdrawal\ntaken out, or sell covered calls on it)? I bought single stocks and…",
  "data/reddit-stocks/r/stocks/comments/rrrjwd/what_are_your_underrated_stock_picks_for_the_new.json": "It will be 2022 in a few days. Any predictions as to stocks that will perform\nreally well in the next year and either short or long term?\n\nI’m looking forward to reading the responses, especially the underrated/not\ntalked about stocks and not the ones constantly discussed about in this\nsubreddit.",
  "data/reddit-stocks/r/stocks/comments/rs1dvs/what_have_been_your_biggest_losses_from_2021.json": "Now that the year is basically behind us, I thought we could post our worst\ndecisions from the past year. We could even learn something from each other!\n\nI can go first: $PINS, down around ~35%. Not selling though, I like the\nfundamentals and I believe they can do well long-term.",
  "data/reddit-stocks/r/stocks/comments/rs1fup/if_you_could_only_own_one_stock_for_the_rest_of.json": "I’m interested to hear some recommendations on your highest conviction stocks.\nWould you go for speculative innovation or for an old blue-chip dinosaur? What\ndo you see as the big themes of the future?\n\nPersonally I see unimaginable upside in both the space and additive\nmanufacturing industries,…",
  "data/reddit-stocks/r/stocks/comments/rs43tx/tesla_recalls_nearly_half_a_million_cars_over.json": "https://www.reuters.com/business/autos-transportation/tesla-recalls-over-475000-electric-vehicles-2021-12-30/\n\nDec 30 (Reuters) - Tesla Inc (TSLA.O) is recalling more than 475,000 of its\nModel 3 and Model S electric cars to address rearview camera and trunk issues\nthat increase the risk of…",
  "data/reddit-stocks/r/stocks/comments/rs8otv/what_is_the_downside_to_copying_nancy_pelosis.json": "On 12/17/2021 Pelosi bought 10 GOOG calls with a strike of $2000 and exp\n9/16/2022. On 12/17 it closed at 2856. Right now it's trading at 2,929.\nApparently Nancy is the greatest investor of all time. Assuming she maintains\nher accuracy, what is the downside here of just going all in on GOOG…",
  "data/reddit-stocks/r/stocks/comments/rsbsiq/follow_the_pelosi_money_trail.json": "Seems Mr Nancy Pelosi made some trades in options the last week. After purchases\nin things like MSFT just before they got a $11 bil contract. I'd say its a safe\nbet to follow the 'there's no insider trading' Pelosis\n\nAccording to a public disclosure report dated Dec. 29, Pelosi’s husband,…",
  "data/reddit-stocks/r/stocks/comments/rscuf4/here_is_a_market_recap_for_today_thursday_dec_30.json": "PsychoMarket Recap - Thursday, December 30, 2021\n\nAfter starting the day green, stocks closed modestly lower, slipping in the last\nfew hours of the session as market participants digested newly released labor\nmarket data and surging coronavirus cases across the world due to the…",
  "data/reddit-stocks/r/stocks/comments/rsfgrk/will_the_metaverse_grow_or_will_it_flop.json": "What are your thoughts and opinions on the Metaverse FB, AAPL and some other\ncompanies intend on forming?\n\nDo you see any potential for this to be the next disruptor of the way we\ncommunicate with one another? Or is it just some wonky idea that will flop and\nwill be forgotten in a few years?\n\nWhat…",
  "data/reddit-stocks/r/wallstreetbets/comments/r6ob5g/this_is_a_great_buying_opportunity_if_you_survive.json": "In case you glorified half evolved monkeys missed it, Powell dropped the magical\n\"transitory\" word in his testimony to Congress yesterday and essentially opened\nthe door to earlier rate hikes and lower QE than initially anticipated. Because\nof that, traders are pricing in a rate hike as early as…",
  "data/reddit-stocks/r/wallstreetbets/comments/r8s8gd/thoughts_on_a_possible_mid2022_global_economic.json": "A bunch of analysts are starting to predict a 1929-style market crash by the end\nof next year.\n\nConsumer Price Index is at the highest it's been in decades in many categories.\nThe real estate market seems to be in a bubble in many sectors. Market\nspeculation is at unseen levels. Political tensions…",
  "data/reddit-stocks/r/wallstreetbets/comments/rafgfj/bb_blackberry_is_ready_to_launch_list_of_upcoming.json": "Hi Everyone 🐵 - Here is why I'm bullish on BlackBerry's future both short term\nand longer term.\n\nBlackBerry has so many upcoming catalysts that will make your TENDIES PRINT 🐔\n💦 - QNX, Amazon Ivy, Billion Dollar Patent Sale/Partnership, Cyber Security,\nInternet of Things (IoT) ect... but there…",
  "data/reddit-stocks/r/wallstreetbets/comments/ran5pw/some_words_of_advice_for_those_who_are_entering.json": "If you are a first time investor, especially a young investor, it is very easy\nto fall in the trap of buying the stock that your friend, relative, or a\nstranger on internet recommended. Just because someone made 1000% gains on\nsomething doesn't mean you are going to make that.\n\nRemember, that the…",
  "data/reddit-stocks/r/wallstreetbets/comments/rbj4x2/can_we_please_stop_making_tesla_the_new_apple.json": "Tesla really are innovators, being an electrical engineer I understand the\nbenefit their Carbon motors, battery technology and long lasting commitment to\nelectric cars has on solving global warming and that's great\n\nThat being said they really are slipping incredibly shady practises under the\nrug…",
  "data/reddit-stocks/r/wallstreetbets/comments/rc106q/gme_gamestop_reports_financial_results_for_q3_2021.json": "THIRD QUARTER OVERVIEW\n\n * Net sales were $1.297 billion for the quarter, compared to $1.005 billion in\n   the prior year’s third quarter.\n * Sales attributable to new and expanded brand relationships, such as Samsung,\n   LG, Razer, Vizio and others, contributed to the Company's growth in the\n  …",
  "data/reddit-stocks/r/wallstreetbets/comments/rcb3m2/interesting_the_last_time_inflation_was_at_these.json": "Just looking at shadowstats, they use the original computation from 1980 to\ndetermine inflation. It's over 14% by the same method used then, and\ncoincidentally, US inflation peaked around 15% back in 1980.\n\nMore interesting, the Fed raised rates to fight inflation, hitting 20% interest\nbefore…",
  "data/reddit-stocks/r/wallstreetbets/comments/rcy65r/do_you_all_realize_how_deep_this_goes.json": "Ever since GME happened I have learned so much about the world of finance from\nall of the incredibly well-researched, intelligent, and informed DD posted by\napes on reddit. Of course at this point everybody knows about DRSing your shares\nbecause it's the only way to actually own your shares and…",
  "data/reddit-stocks/r/wallstreetbets/comments/rd7570/new_twitter_ceos_first_action_was_to_increase.json": "Just days after Jack Dorsey's resignation as CEO of Twitter, Parag Agrawal is\npushing for increased censorship on negative topics regarding certain US elites.\nWith Dorsey - known to be an avid opponent of censorship on the platform - gone,\nTwitter seems to have gone into an entirely new…",
  "data/reddit-stocks/r/wallstreetbets/comments/rddj7l/in_regards_to_the_pelosi_portfolio_tracker_being.json": "Here's [https://twitter.com/QuiverCongress] the Twitter account. It is used to\npost pure data without any added commentary that could detract from its\nobjectivity.\n\nHere's a graph of US Senate trading sentiment alongside the S&P 500:\n\nUS Senate…",
  "data/reddit-stocks/r/wallstreetbets/comments/rhr40s/are_you_buying_the_reddit_ipo.json": "Are you buying the Reddit ipo?\n\nOr do you think they’re relying on us pumping it. I personally don’t think I\nwill because fuck them if they think they can use us as a tool. Monkey only\nfight for monkey\n\nPlus with so many other good stocks basically for sale right now I’d rather be\nbuying dips.\n\nOn…",
  "data/reddit-stocks/r/wallstreetbets/comments/rirm5z/is_gme_still_a_go.json": "is everyone still extremely bullish on it? Talked to their recruiter about the\nproduct openings and it seems like they are definitely ready to build an\nNoFreakingThing market place and expand their e-commerce presence with a focus\non loyalty. I like the sound of it even though others I’ve talked to…",
  "data/reddit-stocks/r/wallstreetbets/comments/rj5cgx/short_reddit_after_they_ipo.json": "There a lot of talk about Reddit severely restricting or eliminating NSFW\ncontent after they IPO to satisfy skittish investors and the religious right. We\nall know what happened after once mighty Tumblr banned adult content - their\nuser base evaporated by almost 50% practically overnight and they…",
  "data/reddit-stocks/r/wallstreetbets/comments/rjjecq/we_should_buy_reddit.json": "Not the stock. The actual company.\n\nIf we all get together and own 51% then we will own this entire website.\n\nWe could make the rules, profit from the advertising, and finally get paid for\nthe memes we make.\n\nI've even come up with a list of things we could do as new owners:\n\n 1. Reddit mods can…",
  "data/reddit-stocks/r/wallstreetbets/comments/rkqvjr/i_have_covid_jim_cramer_says_he_says_hes_been.json": "CNBC's Jim Cramer said Monday he's tested positive for Covid and isolating at\nhome with a mild case.\n\n\"If you'd like to lessen the chance of getting very sick, I think you should get\nvaccinated,\" Cramer said.\n\nDespite getting Covid himself, Cramer said the recent market sell-off looks like\na chance…",
  "data/reddit-stocks/r/wallstreetbets/comments/rlbm5g/turkey_just_made_the_ultimate_wsbretard_move.json": "So turkey is now guaranteeing lira deposits by making up for losses in lira\ndeposits if the lira declines exceed interest rates promised by banks. While\nthis statement is so unbelievably obfuscated it can mean pretty much anything,\nthe results can really only fall into 2 categories:\n\n1: The lira…",
  "data/reddit-stocks/r/wallstreetbets/comments/rmc8rx/do_mods_get_paid.json": "I have a legitimate question. Do mods currently get paid for maintaining\nsubreddits? With Reddit filing to go public, aren't they just taking advantage\nof free labor if they don't treat mods as employees? Are they offered stock\noptions or pre-IPO prices? This situation has the potential of being…",
  "data/reddit-stocks/r/wallstreetbets/comments/rmjk46/just_want_to_thank_the_sub.json": "Because of this sub I now have the ability to pay my student loans off by the\nend of January.\n\nHowever, without the help of this sub, I would have been able to pay them off\nlast week.\n\nI love all of you. You guys make me laugh more than anyone else (except for Tim\nDillon).\n\nIn all seriousness, I…",
  "data/reddit-stocks/r/wallstreetbets/comments/rog1nv/the_reasons_why_stock_market_only_goes_up.json": "Here are the axioms:\n\n 1. Inflation exists. Money saved in the bank is being inflated away for any\n    individual/institution. Inflationary pressure forces spending/investment.\n\n 2. Money must go somewhere. People/institutions that sold stocks for cash,\n    which loses value over time, must…",
  "data/reddit-stocks/r/wallstreetbets/comments/rpqtib/the_end_of_covid.json": "I believe that omicron will be the end of covid as we know it in 6-12 months. It\nis what will finally get world popultion to the elusive herd immunity. Many\nvaccinated and unvaccinated will catch this over the ensuing 6 months, with only\na mild bump in hospitalizatio rates. this variant is on its…",
  "data/reddit-stocks/r/wallstreetbets/comments/rqj6u1/covid_is_over_rate_hikes_coming.json": "No one is reporting on the fact that NY has a 83% vaccination rate (70% if you\nfollow the \"fully vaccinated\" goalposts), but their covid cases are up 3x above\npre-vaccination (yes thats right, before vaccines existed) amounts. By itself\nthis data is indeterminate, but the deaths have not budged AT…"
}