{
  "data/reddit-stocks/r/stocks/comments/shhjkj/blackberry_agrees_to_sell_legacy_patents_for_600m.json": "\"BlackBerry Limited (NYSE:BB, TSX:BB), announced today that it has entered into\na patent sale agreement with Catapult IP Innovations Inc., a Delaware company,\npursuant to which BlackBerry has agreed to sell substantially all of its\nnon-core patent assets to Catapult for total consideration of $600…",
  "data/reddit-stocks/r/investing/comments/shh0f3/contract_accepted_on_113_acres_of_land_in_texas.json": "I'd been looking for more than a year for 50+ acres I'd primarily use for\nrecreation/weekend getaway as well as a long term investment (land prices here\nhave been going nuts), including seasonal leases to other hunters (this land\noffers year-round hunting). I found it last weekend and I'm under…",
  "data/reddit-stocks/r/stocks/comments/shgqd4/block_formerly_square_starts_afterpay.json": "https://www.businesswire.com/news/home/20220131005811/en/Block-Inc.-Completes-Acquisition-of-Afterpay\n\nBlock, Inc. (NYSE: SQ) and Afterpay Limited today announced the successful\ncompletion of the Scheme of Arrangement under which Block has acquired all of\nthe issued shares in Afterpay. This…",
  "data/reddit-stocks/r/stocks/comments/shjxtn/is_it_a_good_time_to_get_into_stocks.json": "I’m 21 yo and I’m looking to get into stocks. I’ve been reading a bit about how\nthe market is currently in a terrible state, does this make it a good time to\nbuy? I’m looking at long term investment so I’m not too concerned about how\nvolatile the market currently is",
  "data/reddit-stocks/r/investing/comments/shk5wg/peter_lynch_the_ultimate_guide_to_stock_market.json": "I found this gem on YouTube and wanted to share with you. A refresher for new\nbeginners to seasoned investors alike, this more than 20 year old video from\nPeter Lynch is still 100% accurate today.\n\nIf you don’t know who Peter Lynch is, he was a fund manager at Fidelity. He\nmanaged the Magellan fund…",
  "data/reddit-stocks/r/Bogleheads/comments/shnc0i/timing_the_market_can_result_in_missing_the_best.json": "Yesterday was undoubtedly the best day for stocks YTD. How much an effect\nmissing best days like this can have on your portfolio?\n\n\"Quantitative Analysis of Investor Behavior,\" shows that an investor who\nremained fully invested in the Standard & Poor’s (S&P) 500…",
  "data/reddit-stocks/r/stocks/comments/shpngj/us_lawmakers_traded_an_estimated_355_million_of.json": "Congress resembled a Wall Street trading desk last year, with lawmakers making\nan estimated total of $355 million worth of stock trades, buying and selling\nshares of companies based in the U.S. and around the world. At least 113\nlawmakers have disclosed stock transactions that were made in 2021 by…",
  "data/reddit-stocks/r/wallstreetbets/comments/shlsh6/401k_infinite_money_glitch.json": "So I have $5000 in my 401k through my employer. I’m allowed to borrow up to 50%\nof my own 401k. I also have a credit card with a limit of $2k and a rewards of\n1.5%. I think I can keep taking loans against my 401k and paying it back with my\ncredit card. And then I can use my loan to pay off the debt…",
  "data/reddit-stocks/r/wallstreetbets/comments/shrexz/anyone_basing_trades_on_technical_analysis_right.json": "So many arrogant fucks here love talking technical analysis when they can't even\ndo basic fraction arithmetic much less understand Ito Calculus. Fucking clowns,\nall of them.\n\nShut the fuck up and do your trades. If you really need a number you can't even\nderive to tell you whether you should buy a…",
  "data/reddit-stocks/r/stocks/comments/shqdwc/im_very_worried_about_the_technological.json": "I have a hard time investing in certain companies because I don't feel right\nsupporting the dystopian world that's upon us in the coming decades. I fear we\nare beginning the era where Ray Bradbury's novels start coming true. Algorithmic\nsocial credit scores, designer babies, government mandated…",
  "data/reddit-stocks/r/Bogleheads/comments/shxhg2/keep_contributing_to_my_retirement_why_bother.json": "A have a little over $1,000,000 in my IRA, I am 49.5 and plan to retire at\n57.5-59.5.\n\nMy goal is to retire in 8-10 years with $2 million.\n\nIf I contribute the $7,000 max per year to my IRA, I will have an ending balance\nthat is about $80,000 higher than if I contribute nothing.\n\nBut $56,000 of…",
  "data/reddit-stocks/r/stocks/comments/shvaz6/att_to_slash_dividend_from_208_to_111_after.json": "AT&T Inc. T 1.15% said it would roughly halve its dividend payout and divest its\nWarnerMedia division through a spinoff that will give shareholders 0.24 shares\nfor each AT&T share they own.\n\nThe company is picking a simpler method to complete its planned deal with\nDiscovery Inc. DISCB -3.47% that…",
  "data/reddit-stocks/r/stocks/comments/shv4xk/upping_my_stake_in_intcis_this_a_bad_move_my.json": "Below is some of the \"research\" and thoughts I've put together regarding INTC.\nWould love to get a sanity check.\n\nI've been long INTC for a few months now. The recent drop has given me pause,\nbut ultimately, I'm thinking about upping my stake from a little less than 1% of\nmy actively managed…"
}