{
  "data/reddit-crypto/r/Bitcoin/comments/npjuxp/at_peace_with_whatever_happens.json": "Me and my son started mining in 2013... The butterfly labs systems would heat\nthe entire home up north for every month except January... Still have memories\nof the constant humming noise... I sold almost everything in 2018 at the bottom\ndue to cancer treatment... Looking forward there is still so…",
  "data/reddit-crypto/r/Bitcoin/comments/npl8nb/wow_we_just_broke_3000000_members.json": "That's really incredible. It's my sincere hope that we can take this moment and\nhighlight the true use case of bitcoin as providing the world's first truly\nfinite digital asset that allows true autonomy and sovereignty for anyone\nrunning taking their own private keys and running their own node with…",
  "data/reddit-crypto/r/Bitcoin/comments/nq430f/reminder_if_youve_hodld_for_at_least_5_months.json": "By comparison, the stock market (as measured by the S&P 500) is only up about\n13% over the last 5 months.",
  "data/reddit-crypto/r/Bitcoin/comments/nr6ttq/the_federal_reserve_has_discontinued_the_weekly.json": "In 2006, the Fed decided to abort publishing the M3 stock, dismissing it as\n\"irrelevant and not being part of monetary policies for a long time\"\n\nBut the truth was, M3 was increasing at a much more alarming rate (nearly 2x)\nthan M2 following the dot-com bailouts in the early 2000s. Just as the Fed…",
  "data/reddit-crypto/r/Bitcoin/comments/nrqkwm/the_crash_from_65k_to_30k_was_the_best_thing_that.json": "Think about it:\n\n * Endless institutions on the sidelines waiting to pour in money.\n * Crash happens.\n * More people hear about it in the news.\n * Bitcoin loses over half of it's value and continues to function as if nothing\n   happened. Upgrades continue to be worked on (Taproot).\n * Analysts see…",
  "data/reddit-crypto/r/Bitcoin/comments/nrw7zw/reminder_bitcoin_is_wayyy_bigger_than_tesla.json": "We are bigger and stronger than tesla. Bitcoin is the new world reserve\ncurrency. It replaces the US dollar. Now that QE-infinite has beguan, everyone\nand every company in the world needs Bitcoin. This is why companies started\nbuying bitcoin in the first place. Don't let the noise distract you.…",
  "data/reddit-crypto/r/Bitcoin/comments/ns1l7c/can_we_start_banhammering_posts_about_elon_already.json": "Opinions about Elon's opinions about Bitcoin do not need to occupy more than one\nor five at most threads.",
  "data/reddit-crypto/r/Bitcoin/comments/ns7tzr/im_embarrassed_for_this_sub_right_now.json": "I'm happy /r/bitcoin has reached over 3 million users. However the majority of\nthese users are either here for the wrong reasons or haven't done their research\nor both.\n\nThe most exciting developments in Bitcoin can barely crack 100 upvotes. The list\nof amazing things that barely see the light of…",
  "data/reddit-crypto/r/Bitcoin/comments/nsfl4d/jack_dorsey_on_bitcoin_i_dont_think_there_is.json": "This man is the CEO of Twitter and Square, and he says this. Bullish af…",
  "data/reddit-crypto/r/Bitcoin/comments/nsx36n/a_warning_to_all_cryptonoobs.json": "If you post anything on the crypto related forums indicating that you are new,\nyou will get dm's from people wanting to \"help\" you out. These are off course\nscams. And if you have ANY doubt if it maybe a scam but you are not sure.... its\na scam!\n\nSome returning stories;\n\nI have a site that gives…",
  "data/reddit-crypto/r/Bitcoin/comments/nt54e7/el_salvador_will_be_the_first_country_in_the.json": "Just heard this on the Bitcoin conference livestream.\n\nI'll admit, I'm pretty new to this space. But I'm crying right now. This is\nincredible, right?",
  "data/reddit-crypto/r/Bitcoin/comments/nt57fg/the_president_of_el_salvador_has_announced_that.json": "The President of El Salvador has announced that he will make #Bitcoin legal\ntender in his country. El Salvador will be the first country to hold bitcoin in\nits reserves.",
  "data/reddit-crypto/r/Bitcoin/comments/nt8hi6/im_from_el_salvador_and_im_here_to_clarify_some.json": "Hello, I'm from El Salvador so I'd like to give you all some information that\nmight help you clarify things. I posted this in another thread and made some\nslight edits.\n\nFirst some info of the current zeitgeist in El Salvador:\n\nThe president's party, Nuevas Ideas (New Ideas), was formed in 2018-2019…",
  "data/reddit-crypto/r/Bitcoin/comments/ntcl1x/wtf_this_massive_news_barely_get_a_reaction_on_a.json": "FIRST NATION EVER TO ADOPT BITCOIN AS LEGAL TENDER!\n\nA few years back these news would have broken the front page.\n\nThese are great news for the WHOLE WORLD. It shows that we can achieve unity,\nhonesty, integrity, that we can change things for good and get rid of the old\ncorruption.\n\nAlso in the…",
  "data/reddit-crypto/r/Bitcoin/comments/nti8qk/bbc_just_ran_main_news_piece_on_elsalvadors.json": "And who do you think they brought on to talk about it? Roger f*cking Ver!!\nunbef*ckingleavable!\n\nOf course he spouted off about how Bitcoin was a joke and could only publish 3\ntransactions a second and only his shitcoin which shall not be named was up to\nthe job. Mocked the el-salvadore president…",
  "data/reddit-crypto/r/Bitcoin/comments/ntlc7k/huge_amount_of_antibitcoin_troll_accounts.json": "I don't know who is behind this massive surge of anti-bitcoin posts, spreading\nblatant lies and misinformation, also trying to suppress any good news. We've\nseen also massive downvoting on most positive posts.\n\nThis is bullish and means we are winning.\n\nPlease help the mods to clean up the sub by…",
  "data/reddit-crypto/r/Bitcoin/comments/ntmzwu/there_are_potentially_huge_us_tax_and_reporting.json": "On its face, it’s obviously great for Bitcoin if El Salvador adopts it as its\nlegal tender. There are, however, nuances in the internal revenue code that make\nthis news much bigger than most realize.\n\nMost know that when trading foreign currencies gains must be reported and are\ntaxed. But Section…",
  "data/reddit-crypto/r/Bitcoin/comments/nto136/be_careful_out_there_we_just_poked_the_bear.json": "El Salvador (a country that uses USD as currency) declaring Bitcoin legal tender\nflies directly in the face of the federal reserve, modern monetary theory, and\nis another crack in the USD facade as the world reserve currency. The FUD,\nmisinformation, and downright hostility towards Bitcoin is about…",
  "data/reddit-crypto/r/Bitcoin/comments/nu630w/ray_dalio_owns_bitcoin_tom_brady_has_laser_eyes.json": "And most of this even happened after a pretty big price crash.\n\nThis will only continue. Bitcoin is inevitable.",
  "data/reddit-crypto/r/Bitcoin/comments/nu94xg/with_now_countries_proposing_to_make_bitcoin.json": "There are at this moment only 2,271,000 Bitcoins left to mine.\n\nEach day 900 Bitcoins are mined as the block reward is 6.25 Bitcoin and one\nblock is mined ~ 10 minutes.\n\nIn some 3 years time this reward will halve to just 3.125 Bitcoins. This halving\nwill continue every 4 years untill roughly 2140…",
  "data/reddit-crypto/r/Bitcoin/comments/num68x/bitcoin_is_a_savings_account_not_a_lottery_ticket.json": "If you are wondering if you should buy now and put a big part of your money in\nto get rich JUST DON'T.\n\nInstead put little every month regardless of the price. Like you would for your\nchildren / grandchildren.\n\nThat's DCA that's how you will be able to not get reck when China ban bitcoin\nagain.\n\nIt…",
  "data/reddit-crypto/r/Bitcoin/comments/nuwhjc/im_not_selling_any_btc.json": "Remember, the fundamentals are the same and there’s no reason to sell any right\nnow. Currently there is a lot of fear and fud in the market which is the best\ntime to accumulate. If you’ve done your research and know what you’re entering\ninto, it’s crypto in the end, prices will come down but it will…",
  "data/reddit-crypto/r/Bitcoin/comments/nv57gt/who_tf_would_sell_bitcoin_at_these_levels.json": "I mean even if it were people trying to tank the market, they do realize that\nit’s simply giving cheaper Bitcoin to people that will buy it and never sell it,\nright?\n\nThere’s been an avalanche of good news in recent weeks that the price simply\ndoes not seem to be affected by. Would not surprise me…",
  "data/reddit-crypto/r/Bitcoin/comments/nv8efg/weve_mined_this_local_el_salvador_newspaper.json": "In Slush Pool we have mined a message celebrating El Salvador's plan to make BTC\na legal tender into the #Bitcoin blockchain for all of eternity.\n\nBlock 686604 \"Diario El Salvador 6/Jun/2021 Bitcoin tendra validez legal\". Link\nto block…",
  "data/reddit-crypto/r/Bitcoin/comments/nva0x0/if_you_people_think_bitcoins_cultish_behavior_is.json": "You wouldn't believe the things I've seen some people do for this paper that is\nmelting in value faster and faster every day.\n\nI don't know if you've heard of it, but the cultish behavior around it is crazy.\nI've literally seen people die over this thing; rob people of their lives over\nit, and in…",
  "data/reddit-crypto/r/Bitcoin/comments/nvjtob/im_from_brazil_and_i_dont_want_the_dollar_to_be.json": "Tha'ts it. I rather have science-backed trustless digital currency.",
  "data/reddit-crypto/r/Bitcoin/comments/nvkz7b/95_of_the_negative_posts_on_this_sub_are_from.json": "This sub is be raiding by a ton of accounts all made around 3 to 4 months ago\nall spreading FUD. Almost all of the negative posts are from new accounts. I\ndon’t know if this is some organized effort or something but it’s definitely a\npattern I noticed. Maybe just people new to Bitcoin who are salty…",
  "data/reddit-crypto/r/Bitcoin/comments/nvnj35/the_president_of_el_salvador_just_confirmed_that.json": "He’s in the Nic Carter Twitter chat room right now!!! And they’re about to pass\nthe bill any minute!!\n\nWill update, developing story….\n\nEdit 1: 100% chance it will pass they have 64 out of 84 votes\n\nEdit 2: Bill will go into full effect in 90 days\n\nEdit 3: “Every business must accept Bitcoin” -…",
  "data/reddit-crypto/r/Bitcoin/comments/nvnt6p/daily_discussion_june_09_2021.json": "Please utilize this sticky thread for all general Bitcoin discussions! If you\nsee posts on the front page or /r/Bitcoin/new which are better suited for this\ndaily discussion thread, please help out by directing the OP to this thread\ninstead. Thank you!\n\nIf you don't get an answer to your question,…",
  "data/reddit-crypto/r/Bitcoin/comments/nvr0wg/hate_mainstream_media_coverage_of_bitcoin_im_a.json": "Hi - I'm a freelance aviation journalist who's written for the The Guardian, The\nNew York Times, the Economist, Forbes and a bunch of geeky plane titles you\nhaven't heard of.\n\nAviation is a dead horse nowadays so my career is totally unviable unless I\ndiversify. Its not difficult to work out how:…",
  "data/reddit-crypto/r/Bitcoin/comments/nvwsus/im_calling_it_right_now.json": "In the near future I'm expecting:\n\n * FUD media reports of \"unrest\" in El Salvador.\n\n * \"bitcoin drops 10%, chaos in the streets of San Salvador. Millions lost.\"\n\n * Smear campaigns against Bukele.\n\n * \"Scandals\" in El Salvador government.\n\n * \"South American drug cartels love El Salvador.\"\n\nWelcome…",
  "data/reddit-crypto/r/Bitcoin/comments/nvz3k3/wow_strike_ceo_just_crushed_it_on_cnbc_and_thats.json": "EDIT: video posted by /BrainDamageLDN thanks!\n\nhttps://twitter.com/DocumentingBTC/status/1402657988914167822\n\nDon't think have EVER seen a better interview about Bitcoin yet. Video not out,\nbut if it does appear, seek it.\n\nCNBC Tech Check June 9, 11-12.\n\nAMAZING! There is no debate, he had an GREAT…",
  "data/reddit-crypto/r/Bitcoin/comments/nw09sz/lets_all_sign_the_petition_to_make_bitcoin_legal.json": "https://www.change.org/p/president-of-the-united-states-bitcoin-legal-tender-for-united-states-of-america?redirect=false",
  "data/reddit-crypto/r/Bitcoin/comments/nw1g15/now_that_el_salvador_named_bitcoin_as_a_legal.json": "In 2001 the USD became the currency of El Salvador. Last night, the adoption of\nBitcoin as another legal tender passed. As per the document below, I believe\nthis means any company operating in these countries will have to accept Bitcoin,\nby law.\n\nThe companies named all operate in El Salvador:…",
  "data/reddit-crypto/r/Bitcoin/comments/nwdc9s/whatever_you_think_of_el_salvador_isnt_it_great.json": "I know the option has existed long before now, but the media now will have gone\na long way in helping people normalise Bitcoin. And pushing adoption making it\neasier.\n\nI read $6 billion is sent across border into El Salvador from people sending\nmoney back to their families. Fuck you money, where the…",
  "data/reddit-crypto/r/Bitcoin/comments/nwhc4g/el_salvadors_acceptance_of_bitcoin_as_legal.json": "Bitcoin and it's new found status as legal tender is the start of a new era. Who\nwould have thought just a few years ago, that you would be able to buy a TESLA\nwith a few lines of code! Getting your hands on those lines of code, and popping\nthem into your fancy new digital wallet - that's another…",
  "data/reddit-crypto/r/Bitcoin/comments/nwomvc/iran_to_legalize_crypto_as_soon_as_possible_says.json": "https://www.trustnodes.com/2021/06/10/iran-to-legalize-crypto-as-soon-as-possible-says-president\n\nIt looks like El Salvador is leading a trend!",
  "data/reddit-crypto/r/Bitcoin/comments/nwpwp2/and_here_we_go_imf_sees_legal_economic_issues.json": "Pound sand.\n\nhttps://mobile.reuters.com/article/amp/idUSKCN2DM1TP\n\n> Rice said the Fund will later on Thursday meet with Bukele to discuss the\n> bitcoin law. El Salvador is in discussions with the IMF seeking a near $1\n> billion program.\n\nCould you imagine if the Jacks, Max, Sylor, twins and a few…",
  "data/reddit-crypto/r/Bitcoin/comments/nwqcnt/el_salvador_is_gonna_use_hot_mountains_to_boil.json": "Hodl",
  "data/reddit-crypto/r/Bitcoin/comments/nwsg06/dear_imf_el_salvador_is_a_sovereign_nation.json": "https://www.reuters.com/article/us-el-salvador-bitcoin-imf-idUSKCN2DM1TP\n\nIMF can suck it",
  "data/reddit-crypto/r/Bitcoin/comments/nxcb79/exciting_news_my_country_pakistan_is_legalizing.json": "It's not a big country. But according to worldometers\n[https://www.worldometers.info/world-population/population-by-country/], it's\nthe 5th largest country based on the population.\n\nPakistanis have been holding and trading bitcoin and other cryptocurrencies for\nmany years now. But due to some…",
  "data/reddit-crypto/r/Bitcoin/comments/nxhwdg/we_have_kicked_the_hornets_nest.json": "The acceptance of Bitcoin as legal tender in El Salvador has meant the failure\nof the \"old economy\" to try to ignore Bitcoin. From now on expect a never seen\nattack against Bitcoin.",
  "data/reddit-crypto/r/Bitcoin/comments/nxkfhl/the_first_bitcoin_etf_in_latin_america_to_launch.json": "Soon to be trading on the Brazilian stock exchange under the ticker “QBTC11”,\nthe new 100% bitcoin  ETF uses the CME CF BTC Reference Rate and will be\ndistributed by the biggest Latin America Bank. BTG Pactual and Nubank\n\nBullish 🚀",
  "data/reddit-crypto/r/Bitcoin/comments/nxmjn6/the_international_banking_regulator_has_formally.json": "https://www.bitcoininsider.org/article/116587/banking-regulator-formally-recognises-bitcoin-asset-class\n\nThe banks want in!",
  "data/reddit-crypto/r/Bitcoin/comments/nxy40l/taproot_party.json": "7 odd hours until Taproot locked in for activation in October. For anyone who\nlived through the 2017 fork wars, this feel quite cathartic. I think many of us\nwere worried we would see the same kind of FUD, bullshit, lies and just general\nmadness which happened, and it feel FUCKING GOOD that this got…",
  "data/reddit-crypto/r/Bitcoin/comments/ny37y3/why_i_bought_btc.json": "I have bought 0.001BTC and a small portfolio of crypto. I hodl. What's on my\nmind? Am I want a Lambo? Am I want to go to the Moon? No. I am simply a person\nhoping for the crypto platform to stay alive. Why? I want to send my hard earn\nmoney back to my parents to make their lives better, securely…",
  "data/reddit-crypto/r/Bitcoin/comments/ny59po/the_bitcoin_taproot_software_upgrade_has_just.json": "...let the bull market resume.",
  "data/reddit-crypto/r/Bitcoin/comments/nyd6g7/one_of_hal_finneys_last_posts_on_bitcointalkorg.json": "Bitcoin and me ( Hal Finney )\n\nMarch 19, 2013\n\nI thought I'd write about the last four years, an eventful time for Bitcoin and\nme.\n\nFor those who don't know me, I'm Hal Finney. I got my start in crypto working on\nan early version of PGP, working closely with Phil Zimmermann. When Phil decided\nto…",
  "data/reddit-crypto/r/Bitcoin/comments/nyto5d/i_will_never_agree_nor_support_a_bitcoin_mining.json": "I am sure yall are forgetting the fact that Bitcoin is the world’s only\nDECENTRALISED method of payment. This means that NOBODY has a say in how it is\noperated or mined.\n\nWe DON’T need a mining or whatever council. This is just yet another attempt by\nyet another rich person trying to hold influence…",
  "data/reddit-crypto/r/Bitcoin/comments/nz12yr/wow_10_years_ago_bitcoin_crashed_from_16_to_01.json": "https://blog.bitmex.com/the-june-2011-flash-crash-to-0-01/",
  "data/reddit-crypto/r/Bitcoin/comments/nz5eco/this_movement_in_price_is_not_because_of_elon.json": "It's because there are a massive amount of shorts on BTC right now and it's\ngetting liquidated as we move higher. Expect big moves if we continue up.",
  "data/reddit-crypto/r/Bitcoin/comments/nzel0y/president_of_tanzania_calls_on_the_central_bank.json": "> President Samia Suluhu Hassan has called on the Central Bank of Tanzania to\n> prepare for the use of cryptocurrencies / blockchain, as it may come at a time\n> when changes taking place elsewhere have entered Tanzania. The President\n> issued the directive earlier today while inaugurating the…",
  "data/reddit-crypto/r/Bitcoin/comments/nzeukp/bitcoin_has_changed_my_life.json": "The best decision I ever made was to start buying Bitcoin back in 2017. Since it\nhit $7k, I’ve been putting 1% of every paycheck I get into bitcoin. That, along\nwith the relationships I’ve made through different forums, has been one of the\nbest decisions of my life. There aren’t many places with…",
  "data/reddit-crypto/r/Bitcoin/comments/o02uhs/my_relationship_with_bitcoin_has_been_crazy.json": "First I thought it was nothing, then thought it was a scam for idiots, then\nthought I was too late to get involved, then got in, then thought there could be\nbetter options, then realized BTC is the one and only. Now we’re here",
  "data/reddit-crypto/r/Bitcoin/comments/o0bhmt/bitcoin_is_a_monopoly_that_is_taking_over.json": "El Salvador, Brazil, Iran, etc. knows this. It's inevitable.",
  "data/reddit-crypto/r/Bitcoin/comments/o0fyp0/less_than_25_of_nodes_enforce_taproot_update_your.json": "5 months to go fellow bitcoiners.\n\nSource:\n\nhttps://luke.dashjr.org/programs/bitcoin/files/charts/taproot.html",
  "data/reddit-crypto/r/Bitcoin/comments/o0i2qj/microstrategy_selling_up_to_1_billion_of_mstr.json": "Microstrategy Inc. is selling up to $1 billion of its common stock, MSTR,\nintending to use some of the net proceeds to buy bitcoin. The Nasdaq-listed\ncompany also recently completed a $500 million secured notes offering and will\nuse the proceeds to acquire bitcoins.\n\nMicrostrategy Inc. has…",
  "data/reddit-crypto/r/Bitcoin/comments/o16cv8/gm_may_now_consider_bitcoin.json": "General Motors May Start Accepting Bitcoin If There's Customer Demand, Says CEO\nMary Barra\nhttps://cryptonews.net/816561/?utm_source=CryptoNews&utm_medium=app&utm_campaign=shared",
  "data/reddit-crypto/r/Bitcoin/comments/o18dvc/my_bank_called_me_today_to_tell_me_they_dont.json": "It still feels so surreal to me. What do they care what I do with my money?\n\nObviously the clerk couldn't tell me what would happen, if I kept using my bank\naccount to shop on Binance. I also assume someone higher up the chain saw the\ndanger DeFi poses for the banking system.\n\nHonestly, fuck 'em.…",
  "data/reddit-crypto/r/Bitcoin/comments/o1fhtx/the_sec_is_asking_us_for_comments_on_the_bitcoin.json": "I hope all of you submit a comment. They’re asking for opinions.\n\nLet’s all use good grammar, put some thought into it and be nice. Let’s\nrepresent the Bitcoin community well.\n\nHere is the link:\nhttps://www.sec.gov/comments/sr-cboebzx-2021-019/srcboebzx2021019.htm",
  "data/reddit-crypto/r/Bitcoin/comments/o1o61e/i_put_my_entire_savings_20000_into_bitcoin_with.json": "I've pulled the trigger, after thinking over it for a few weeks.\n\nI'm a software engineer who has spent the last 6 months developing payment\nprocessing services for Bitcoin and other crypto assets. I've had the pleasure\nof exploring and learning about how blockchain works, how transactions work,…",
  "data/reddit-crypto/r/Bitcoin/comments/o21d0p/25000_into_bitcoin.json": "My time has come gentlemen, all my savings from working as a waiter my entire\nlife (31 years old) invested into this holy financial grail. Let's hope by the\ntime i hit 40 i will be able to buy a decent house and a car. see ya in 9 years",
  "data/reddit-crypto/r/Bitcoin/comments/o2olf9/i_got_simswap_attacked_again_despite_having_a_pin.json": "It's been almost a year since my SIM card was hijacked for the first time.\n\nThankfully, We noticed it early (my wife and I), we acted quickly And dodged a\nbullet.\n\nThat day, And after resetting all my passwords and adding 2FA's on every account\nthat allows it and removing my phone # from any service…",
  "data/reddit-crypto/r/Bitcoin/comments/o2qidy/buying_bitcoin_every_month_for_55_months_straight.json": "Stacking every month with fixed amount. Being doing this since October 2017.\nDecided to start a blog a year ago in order to motivate fellow stackers. This is\na long game, no shortcuts, no get rich quick schemes. Instead, a get rich slowly\nscheme. Yes I know, don't dox your bitcoin amount. Stupid of…",
  "data/reddit-crypto/r/Bitcoin/comments/o38fd5/there_will_never_again_be_a_savings_account_that.json": "Hyperbitcoinization is already upon us.",
  "data/reddit-crypto/r/Bitcoin/comments/o3hfui/basketball_players_in_canada_to_be_paid_in_bitcoin.json": "CEBL, the Canadian men’s basketball league, will offer its professional\nbasketball players the option to receive a portion of their salary in\ncryptocurrency. The new payment option has been enabled through a partnership\nwith the Canadian cryptocurrency exchange Bitbuy.\n\n\nBITBUY TO CONVERT CANADIAN…",
  "data/reddit-crypto/r/Bitcoin/comments/o3kd8c/buying_bitcoin_today_is_like_buying_land_in_the.json": "It may have seemed like a crazy bet then, but it would have paid off for your\ngrandkids.\n\nAnd while it would have cost more and wouldn’t have nearly as much upside,\nbuying the same land in 1890 or 1990 was still a really smart investment.\n\nIf you disagree with the “digital land grab” thesis, you’re…",
  "data/reddit-crypto/r/Bitcoin/comments/o3uej7/fell_victim_to_phishing_scam_entire_coinbase.json": "A few hours ago, I received this text message:\n\n\"Coinbase: We have received withdrawal request on your account from unrecognized\ndevice. If this was not you, click here: [removed link from Reddit for safety]\"\n\nI was in the middle of a conversation and was completely not thinking. I clicked\nthe link,…",
  "data/reddit-crypto/r/Bitcoin/comments/o4a4ws/the_us_should_print_money_and_buy_23_million.json": "At that point, the US dollar would be backed by the only asset to appreciate\n100% every year for 12 years, and the asset would be completely derisked because\nof US adoption. The US then becomes the richest country in human history with\nthe most stable currency of all time.",
  "data/reddit-crypto/r/Bitcoin/comments/o4bv3c/take_your_bitcoin_off_the_exchanges.json": "This is very important.\n\nThere are hundreds of million of people who own Bitcoin, but there are only 53\nmillion wallets.\n\nLink to site showing number of wallets:\nhttps://bitinfocharts.com/top-100-richest-bitcoin-addresses.html\n\nGiven that exchanges and whales each have dozens/hundreds of wallets,…",
  "data/reddit-crypto/r/Bitcoin/comments/o4p1ki/what_happened_to_this_sub_reddit.json": "I used to come here for mental support each time btc would drop. Reading most of\nthe posts I would feel really happy and glad that I never sold any btc I ever\nbought.\n\nHowever, recently it seems like it's full with FUD paper hands now. I'm not\nsaying they are convincing me of selling whatsoever. It…",
  "data/reddit-crypto/r/Bitcoin/comments/o4si7e/i_am_buying.json": "Fuck your nonsense technical analysis",
  "data/reddit-crypto/r/Bitcoin/comments/o5aq9u/i_just_put_8k_in_bitcoin_at_31k.json": "Already made over $600. IT'S LOOKING GOOD BOYS!!!!",
  "data/reddit-crypto/r/Bitcoin/comments/o5ati0/why_did_china_only_have_to_ban_facebook_and.json": "Short answer- because they can’t.",
  "data/reddit-crypto/r/Bitcoin/comments/o5ez7v/daily_discussion_june_22_2021.json": "Please utilize this sticky thread for all general Bitcoin discussions! If you\nsee posts on the front page or /r/Bitcoin/new which are better suited for this\ndaily discussion thread, please help out by directing the OP to this thread\ninstead. Thank you!\n\nIf you don't get an answer to your question,…",
  "data/reddit-crypto/r/Bitcoin/comments/o5gres/ive_experienced_3_market_cycles_now_and_it_always.json": "Storytime. I think I can almost be considered an OG by now. Recently, I've\nstarted to observe my emotions more seriously during the market moves and I've\nhad valuable insights while doing so: what I am feeling right now is probably\nvery close to what many other investors are feeling. This is great…",
  "data/reddit-crypto/r/Bitcoin/comments/o5lhmu/governments_planning_a_global_coordinated_attack.json": "THE WORLDS’ WEALTHIEST NATIONS ARE AIMING FOR CRYPTOS, RESTRICTING, AMONGST\nOTHERS, THE FOLLOWING:\n\n * Peer-to-Peer Transactions;\n * Stablecoins;\n * Private wallets (cold storage, phone and desktop apps);\n * Privacy (privacy coins, mixers, Decentralized exchanges, use of TOR and I2P);\n * Former ICOs…",
  "data/reddit-crypto/r/Bitcoin/comments/o5n9x3/bitcoin_under_30k_means_im_a_wholecoiner_now.json": "I’d been holding some stablecoin waiting on a good re-entry point and BTC being\nunder $30k this morning was it.\n\nIf you look at corporate buys, they’re not looking to book a capital loss. That\nalone is strength enough to invest on, IMO.\n\nIf you have funds sidelined, trying to figure out what to do,…",
  "data/reddit-crypto/r/Bitcoin/comments/o5uydw/miners_welcome_to_colombia.json": "I represent a small mining company in Colombia with over 5 years of experience\nin GPU and ASIC systems. We have good connections with the hydroelectric and\nsolar power companies that can provide cheap and reliable power to mining\noperations. We are looking to expand our business and look forward to…",
  "data/reddit-crypto/r/Bitcoin/comments/o609p8/just_got_hired_for_my_first_bitcoin_freelance.json": "I am so happy right now :)\n\nI am a college student and live in El Salvador and have been freelancing for\nquite some time now. What used to be a side hustle is now my full time living\nand I am able to support my family. Thanks to you guys I found Bitcoin!\n\nAlthough I have not bought any yet for…",
  "data/reddit-crypto/r/Bitcoin/comments/o64krg/i_feel_uncomfortable_if_i_dont_buy_the_dip.json": "I started putting 1k into Bitcoin every time it drops by 5k since 60k. And I ran\nout of funds a little while ago.\n\nThe fact that I can’t buy this dip just makes me extremely uncomfortable.\n\nIt makes me feel shifty and nervous of the fluctuations. Whereas before I looked\nforward to it falling so I…",
  "data/reddit-crypto/r/Bitcoin/comments/o68dds/this_is_so_sad.json": "Broke up with my 6 year girlfriend, because she was abusing me mentally. The sad\nthing is that i had to sell some btc to cover up moving out, rent, bills etc. I\njust wanted to buy more, not sell. Time to start independent chapter in my life.\nFuck selfish women and fuck banks 😂\n\nwhich actually gives…",
  "data/reddit-crypto/r/Bitcoin/comments/o6dz4c/just_paid_for_my_tab_where_i_was_staying_with.json": "I'm currently traveling in Colombia from the U.S. and my bank blocked my cards\nfor the entire trip. I could not pay my week-long tab for food and drinks when I\nwas checking out.\n\nThen.....the owner walks up and said I could pay in Bitcoin! The transaction\ntook seconds to hit his wallet.\n\nBitcoin is…",
  "data/reddit-crypto/r/Bitcoin/comments/o6jubr/el_salvador_president_has_a_better_grasp_of.json": "Excerpts from Nayib Bukele's Interview with McCormack\n\n(When he first came across Bitcoin) I thought it was very smart. But a lot of\ngood ideas just vanish. Bitcoin just keeps growing and growing, not only in\nprice.\n\nMeasuring Bitcoin against dollars kind of defeats the point of Bitcoin. (1 BTC =\n1…",
  "data/reddit-crypto/r/Bitcoin/comments/o6v6gy/any_one_want_to_start_a_group_to_spread_fud_about.json": "Sounds fun. We get a Discord going and decide on the daily or weekly fud\nregarding government fiat money and then we spread that shit like crazy. Maybe\nall week we vote on the best ridiciouls story to spread around. The old switcher\nroo.",
  "data/reddit-crypto/r/Bitcoin/comments/o6zux0/bitcoin_is_not_a_crime_denying_citizens_the_civil.json": "China has told banks and payments platforms to stop supporting digital currency\ntransactions.\n\nTheir central bank said it had recently summoned several major banks and\npayments companies to call on them to take tougher action over the trading of\ncryptocurrencies.\n\nBanks were told to not provide…",
  "data/reddit-crypto/r/Bitcoin/comments/o73hcl/chinas_exit_from_bitcoin_opens_the_door_for_the.json": "I think this move by China can only be a positive for the Western Nations that\nwant to negate or challenge China's Rising economic power.",
  "data/reddit-crypto/r/Bitcoin/comments/o7gy32/el_salvador_update_on_btc.json": "President Bukele just announced that he is implementing a national wallet in\nSeptember called “chivo” (means cool in Salvadoran slang)\n\nThe government is giving 30 usd to anyone that creates an account, by law you\nwill have to accept BTC as a company... but the wallet let’s you convert the BTC\nto…",
  "data/reddit-crypto/r/Bitcoin/comments/o7jw9y/the_real_satoshi_nakamoto_identity.json": "Sa(msung)\n\nToshi(ba)\n\nNaka(michi)\n\nMoto(rola)\n\nsatoshi nakamoto... only the four biggest tech corporations. That's it ladies\nand gentlemen. I'm out.\n\nput tinfoil hat and walk away",
  "data/reddit-crypto/r/Bitcoin/comments/o7lmvd/i_bought_my_first_bitcoin_today.json": "Actually half a coin. I'm a bit nervous buying in a bear market etc. Did I make\nthe right choice?\n\nI have no plans to sell in the next few years\n\nI'm just looking for validation and saying Hi.\n\nEdit: *Please don't DM me about \"quick money crypto investments\" I didn't come\ndown in the last…",
  "data/reddit-crypto/r/Bitcoin/comments/o7plnh/i_put_my_savings_into_bitcoin.json": "After a lot thinking, reading, and researching, last week I completed putting my\nsavings into Bitcoin. I did it over a span multiple weeks (following the\ndollar-cost averaging strategy). I haven't told people that they know me about\nthis, and not planning to (for security reasons). Here is my…",
  "data/reddit-crypto/r/Bitcoin/comments/o7po22/btc_shorts_are_up_900_today_lets_discuss.json": "BTC Shorts on bitfinex streted to rise today at 9:00 steadily till now, and are\nup 900% today (https://www.tradingview.com/symbols/BTCUSDSHORTS/). BTC is\nsteadily decreasing in price - not saying that only because of that, but it sure\nhelps driving the price down by creating a huge sell pressure. I…",
  "data/reddit-crypto/r/Bitcoin/comments/o7uyjd/im_so_proud_of_my_country_el_salvador.json": "I moved from El Salvador to the U.S when I was 14 years old (I'm 23 now),\nlooking for better future. I look back and I wanna cry so bad for all the good\nthat is coming to El Salvador. My country, my people have suffered enough with\nall the corrupt government, gangs, and violence. Now that we have an…",
  "data/reddit-crypto/r/Bitcoin/comments/o84g26/if_youre_wondering_wether_people_were_trying_to.json": "and they also all turned out to be absolutely right.",
  "data/reddit-crypto/r/Bitcoin/comments/o8a1ek/so_if_the_bitcoin_bull_run_is_not_yet_over.json": "The Bulls will still need to price-in...\n\nCountry/ies making BTC legal tender. (This was not expected in this run)\n\nNew billionaires .purchasing BTC.\n\nTaproot.\n\nChina losing control on mining supremacy.\n\nInflation and Dollar printing.\n\n\n\nI do not think that we have those mouth-watering fundamental…",
  "data/reddit-crypto/r/Bitcoin/comments/o8dml6/is_it_time_to_panic.json": "Was Bitcoin an awesome idea from the start? Yes.\n\nDoes Bitcoin work? Yes.\n\nIs Bitcoin secure? Yes.\n\nIs Bitcoin scarce? Yes.\n\nDoes Bitcoin continue to improve? Yes.\n\nCan a person tell much by looking at price changes over a relatively short\nperiod of time? No.\n\nIs Bitcoin's price volatile? Yes.\n\nDoes…",
  "data/reddit-crypto/r/Bitcoin/comments/o8dwau/im_honestly_so_tired_of_michael_saylor.json": "Coming on all these interviews and making so much sense that people struggle to\nunderstand what true financial freedom and sound money can bring to the masses\n\nI call him cobra now, spitting facts everywhere",
  "data/reddit-crypto/r/Bitcoin/comments/o8lw7j/stop_hoping_and_waiting_for_btc_to_dip_more.json": "It becomes a self fulfilling prophecy. The more people on here saying I’ll buy\nwhen it hits $15k, $20k, $25k, etc. are shooting themselves in the foot. We want\npeople to buy. We want new people interested in BTC and crypto and if they all\nbelieve this is going to dip, they won’t enter the market…",
  "data/reddit-crypto/r/Bitcoin/comments/o8maxi/if_you_dont_believe_me_or_dont_get_it_i_dont_have.json": "I think time to time we need to remember this.\n\nSatoshi didn't try to convince people how awesome Bitcoin is or would be. We\ndon't neither. BTC will prevail no matter what. This is what makes it great.\n\nIf you wanna remember:\nhttps://bitcointalk.org/index.php?topic=532.msg6269#msg6269",
  "data/reddit-crypto/r/Bitcoin/comments/o8xqdy/any_drawbacks_if_i_liquidate_my_entire_stock.json": "Hi Everyone,\n\nHoping to get your thoughts on something I've been contemplating for some time\nnow.\n\nI've been DCAing into stocks and Bitcoin for a few years now but recently have\nbeen considering liquidating all my stocks and completely transitioning into\nBitcoin. I would no longer invest in stocks…",
  "data/reddit-crypto/r/Bitcoin/comments/o8zpg4/help.json": "Ever since I saw the adoption of bitcoin in El Zonte (a small town in El\nSalvador) I've thought about how great it would be if Bitcoin would get adopted\nin small towns all over the world. Small towns tend to have less money but with\nthe adoption of bitcoin into their small towns, the small town's…",
  "data/reddit-crypto/r/Bitcoin/comments/o90f6x/irs_increasing_prevalence_of_bitcoin_in_their.json": "Hey everyone.\n\nI'm a tax professional and just recently took the second part of the Special\nEnrollment Examination which is an IRS test to become an Enrolled Agent. During\nmy exam I had two questions specifically about Bitcoin out of the 100 questions\non the business tax test. From what I…",
  "data/reddit-crypto/r/Bitcoin/comments/o9fd2m/there_is_no_incentive_to_not_use_the_lightning.json": "No, really, think about it. This is sort of like how some developing countries\nskipped going from setting up landline phone systems and went straight to\ndeveloping smart phone infrastructure, 3g, 4g networks instead.\n\nAlso, the more people who use simple lightning wallets with simple interfaces,\nthe…",
  "data/reddit-crypto/r/Bitcoin/comments/o9goxd/american_university_of_paraguay_to_accept_tuition.json": "The American University of Paraguay shared on Twitter that it will accept\ntuition payments in bitcoin, as well as other cryptocurrencies, beginning on\nAugust 1, 2021.\n\n\"From August 1, you will be able to pay all your tuition and fees with\ncryptocurrency,\" a translated version of the tweet read. \"We…",
  "data/reddit-crypto/r/Bitcoin/comments/o9ilcc/the_first_bank_in_mexico_is_about_to_start.json": "Ricardo Salinas Pliego, the third richest man in Mexico, said that he wants his\nbank to be the first one in Mexico to accept Bitcoin. We heard about lots of\nbanks that already have started to work with crypto, and BTC in particular. The\nmain difference with this case is that Ricardo Salinas Pliego…",
  "data/reddit-crypto/r/Bitcoin/comments/o9rk04/bitcoiners_need_to_be_more_tolerant_of_opposing.json": "I consider myself an open-minded person who believes in innovation that will\nimprove the world and make it a better place. I think the poor and\nunderprivileged deserve a chance to improve their lives and I am not opposed to\nhelping them out. However, I am against Bitcoin because it's obviously a…",
  "data/reddit-crypto/r/Bitcoin/comments/o9s12g/just_got_hacked_on_coinbase.json": "Hey everyone,\n\nI have been with Coinbase since 2016/17 and today my account was hacked and\nemptied of its entirety. My son mentioned I should come on this forum to see if\nanyone has a way to get Coinbase to respond to me. It's my life savings for my\nwife and I and for our kids...I am just getting…",
  "data/reddit-crypto/r/Bitcoin/comments/o9tarn/im_a_ceo_of_a_small_agency_in_norway_and_this_is.json": "Hello fellow hodlers. I am guessing this will be a somewhat different post, and\nquite the long one as well. Hope you find it interesting and a nice addition to\nyour own confirmation bias as to why Bitcoin is and will be lifechanging. Also,\nthank you for reading.\n\n\nFIRST, A COUPLE OF CAVIATS;\n\n- I am…",
  "data/reddit-crypto/r/Bitcoin/comments/o9wy7v/5_documentaries_show_how_bankers_are_shameless.json": "Inside Job https://youtu.be/T2IaJwkqgPk\n\n97% Owned https://www.youtube.com/watch?v=j7-FmAfxMmQ\n\nSpiders Web https://www.youtube.com/watch?v=np_ylvc8Zj8\n\nPrinces of Yen https://www.youtube.com/watch?v=p5Ac7ap_MAY\n\nFreedom to Fascism https://www.youtube.com/watch?v=uNNeVu8wUak\n\n'Goldman Sachs- The…",
  "data/reddit-crypto/r/Bitcoin/comments/oa3yhj/nayib_bukele_makes_some_clarifications_about.json": "You can read the thread here (in spanish):\nhttps://twitter.com/nayibbukele/status/1409584377915269120\n\nI'll try to summarise it below:\n\n- The government bitcoin wallet (Chivo wallet) is a thing but any wallet will\nobviously work.\n\n- When using Chivo, they'll require some KYC data to protect the…",
  "data/reddit-crypto/r/Bitcoin/comments/oa52dx/psa_warning_dear_noobs_please_remember_the_sub.json": "Although this has been repeated a million times before, I think it's still\nappropriate to warn new users in this space. I've seen a couple of noobs stumble\nupon the abovementioned sub / websites, thinking that these resources represent\nBTC. Indeed, they are trying very hard to conceil the fact that…",
  "data/reddit-crypto/r/Bitcoin/comments/oa94zl/why_i_refuse_to_sell_the_tomato_plant_parable.json": "Bitcoin is my only tomato plant. In fact this tomato plant is the only thing I\nhave to eat right now. It is still young, and I am extremely hungry.\n\nI don't know what I'm going to eat next month. I don't know if I'll even have\nthe energy to make the trip home to see my family.\n\nMy plant has a few…",
  "data/reddit-crypto/r/Bitcoin/comments/oaefo9/i_am_pissed.json": "I am pissed because I have a strong opinion on favor of Bitcoin. And... I'm\nreally not a person of strong opinions. I dislike having strong opinions. I had\nlearned earlier in life that if you have a strong opinion on something, you are\nalready losing. There must be something you did not understand…",
  "data/reddit-crypto/r/Bitcoin/comments/oahfo2/bitcoin_is_up_867_since_jan_1_2019_surviving_13.json": "Since January 1st, 2019, Bitcoin has lost 20% of its value 13 times whereas the\nS&P 500 index has only lost 20% of its value once. Yet many continue to apply\nthe stock definition of a \"Bear Market\" to Bitcoin when they both trade very\ndifferently. Many continue to use analytics designed for the…",
  "data/reddit-crypto/r/Bitcoin/comments/oaircu/show_reddit_a_fun_way_to_check_bitcoins_price.json": "BitcoinTemp [https://bitcointemp.com/] is a fun way to check the price of\nbitcoin, with the price dictating storms, sunny days, and more!\n\n- Josh Ternyak, 16 year old web developer",
  "data/reddit-crypto/r/Bitcoin/comments/oal9ye/never_sell_your_bitcoin.json": "Hello everyone,\n\nI just wanted to see what the overall consensus was on selling Bitcoin. The\nwell-known Bitcoin advocate Mr. Michael Saylor has already stated that you\nshould never sell your Bitcoin and that you should hold onto it for life. He\nargues that when you sell you're Bitcoin you're taxed,…",
  "data/reddit-crypto/r/Bitcoin/comments/oauil4/google_has_lifted_its_ban_on_crypto_advertisements.json": "Google recently updated their policies regarding Google Ads and will now allow\nads related to cryptocurrency exchanges and wallets provided they have\nregistered with FinCEN. This change is set to take effect in August 2021. As you\nmay recall, the ban was imposed in March 2018 and lasted almost three…",
  "data/reddit-crypto/r/Bitcoin/comments/oav6iy/28_million_us_customers_will_now_be_able_to_buy.json": "https://www.forbes.com/sites/michaeldelcastillo/2021/06/30/6-billion-ncr-opens-bitcoin-purchases-to-650-banks-and-credit-unions/?sh=6dd177913f82&utm_source=TWITTER&utm_medium=social&utm_content=5072876997&utm_campaign=sprinklrForbesCrypto",
  "data/reddit-crypto/r/Bitcoin/comments/oawc0n/so_i_had_an_argument_with_my_dad_about_crypto.json": "Once in a while I think by myself \"lets give my mom and dad a visit\", since I am\nobviously the most favorite son of 3. So I went there to watch some football and\nit was all nice and fun. All of a sudden, during the commercial brake, my dad\nasked: \"Son, do you have money invested in Bitcoin?\". I…",
  "data/reddit-crypto/r/CryptoCurrency/comments/npf99a/lets_all_stop_and_take_a_minute_to_realize_whats.json": "With the market tanking these last couple of weeks, I just want everyone to take\na step back and see what’s really going on.\n\nWhat’s going on is that every single one of you is in the greatest market of all\ntime. Yes we just experienced a major down trend, but seriously\npeople...consider yourself…",
  "data/reddit-crypto/r/CryptoCurrency/comments/npgi3g/if_youre_mega_rich_feel_free_to_waste_10x_the.json": "But if you're a regular person...\n\n\nHOW DARE YOU!\n\nHow dare you use a little more energy running a miner to make a little more\nmoney.\n\nBecause that's all it is. Just a little more extra money running one miner\ncompared to the expenses the average American has. You're not gonna make even\nclose to…",
  "data/reddit-crypto/r/CryptoCurrency/comments/npgudt/daily_discussion_june_1_2021_gmt0.json": "Welcome to the Daily Discussion. Please read the disclaimer, guidelines, and\nrules before participating.\n\n--------------------------------------------------------------------------------\n\n\n\n\n\nDISCLAIMER:\n\nThough karma rules still apply, moderation is less stringent on this thread than\non the rest of…",
  "data/reddit-crypto/r/CryptoCurrency/comments/nplbbn/this_is_why_its_important_to_hold_for_the_long.json": "A dormant address containing 900 #BTC (33,780,931 USD) has just been activated\nafter 8.8 years (valued at 4,625 USD in 2012)!\n\nsource\n[https://whale-alert.io/transaction/bitcoin/3629dcc7cdf65cf71c8eab67628ac933516fbffb8e30cab31df7534257f9043c]\n\nThat guy must be the happiest MF alive right now.\n\nI…",
  "data/reddit-crypto/r/CryptoCurrency/comments/npn5pa/zksync_20_an_advanced_nextgen_smart_contract.json": "Apologies for the slightly clickbaity headline, but it's actually true.\n\nThe alpha version of zkSync 2.0 is now live on testnet\n[https://medium.com/matter-labs]. Most of the crypto world seems to be sleeping\non zkSync 2.0 - this is without any doubt the most advanced smart contract\nplatform ever…",
  "data/reddit-crypto/r/CryptoCurrency/comments/npob3a/i_just_spent_4_hrs_in_15_alt_coin_subreddits_and.json": "After spending a considerable amount of time in many alt coin subreddits, here\nare the common themes preached across the board:\n\n 1.  Bitcoin is speculative garbage while the subreddit's coin has \"real\n     utility\".\n 2.  POW > POS & POS > POW - Depends on the subreddit's coin.\n 3.  Atleast one post…",
  "data/reddit-crypto/r/CryptoCurrency/comments/npqz0g/your_favorite_crypto_influencer_is_lying_to_you.json": "You know that feeling when your favorite crypto \"influencer\" posts a 90 day\nchart and their coin is up 18,000%? You start doing mental math like, \"Damn if\nI'd invested $1000, I'd have six figures right now. This guy probably made a\nmillion plus!\"\n\nWell, forget that feeling, cause it's total…",
  "data/reddit-crypto/r/CryptoCurrency/comments/npqzxk/when_we_buy_they_say_your_risk_when_we_sell_they.json": "When WE BUY crypto, our countries say it's our risk, and they usually spread\nnegative news about crypto. But when WE SELL our crypto, they gladly take their\nprofits, and taxes from it.\n\nThey basically say \"Your risk\" when we buy and they say \"Our profit\" when we\nsell. Honestly, it makes me crazy.",
  "data/reddit-crypto/r/CryptoCurrency/comments/nprrm7/holding_fiat_is_way_harder_than_holding_crypto_i.json": "Looking back at a crash or a bear market and I beat myself up for not buying way\nmore, but then I realised every time I actually did have some fiat set aside -\nit's just that I had thrown it all back into crypto way before we got anywhere\nnear the bottoms.\n\nI keep taking some profits and having it…",
  "data/reddit-crypto/r/CryptoCurrency/comments/nptt2f/bought_ada_ask_me_anything.json": "As the title says I just invested $51 worth of ADA at around $1.50~\n\nI am now up $7 so I instantly got a phd in crypto investments and the crypto\nmarket.\n\nIf you have a hard time believing my profits, I can give you my account for a\nday to see that green.",
  "data/reddit-crypto/r/CryptoCurrency/comments/nput35/30_years_ago_most_people_were_skeptical_of_the.json": "I wasn't around for the creation of the internet or the \"dot com bubble\", but\nI've spoken to enough people that were to know that when the world wide web was\nfirst introduced, it wasn't adopted overnight. People were skeptical,\nindifferent, they laughed at the idea of it... A lot of the same…",
  "data/reddit-crypto/r/CryptoCurrency/comments/nputlr/im_now_getting_paid_in_btc_by_a_big_pizza_firm.json": "So as you may have read Domino's Pizzas is now paying employees in btc if they\nwant.\n\nArticle:\nhttps://www.google.com/amp/s/www.coindesk.com/staff-at-biggest-dominos-pizza-franchise-in-holland-can-now-be-paid-in-bitcoin%3famp=1\n\nIm getting paid in BTC from now on. This is ofcourse not my only…",
  "data/reddit-crypto/r/CryptoCurrency/comments/npwbp4/ada_is_a_speculative_risky_asset_even_for_crypto.json": "It is really hard to come up with a fair market price for cryptocurrency. They\ndon't have cashflows, don't pay dividends (although thats not so true anymore\nwith staking rewards taking off), and don't have balance sheets to peruse. That\ndoesn't mean we shouldn't try though! We can use transaction…",
  "data/reddit-crypto/r/CryptoCurrency/comments/npze31/when_bitcoin_hits_a_million_dollars_its_not_gonna.json": "The reality is that your investment at 20k results in three times as much\nbitcoin. This could be the difference between a $100k return vs a $300k return\n(or 1 million vs 3 million).\n\nThe point, given that short term price is unpredictable, is to always have some\ncash available to take advantage of…",
  "data/reddit-crypto/r/CryptoCurrency/comments/nq15us/turn_off_sms_2fa.json": "A friendly reminder since I haven’t seen it posted here in a while.\n\nTurn off SMS 2FA and set up something like Authy.\n\nYou’re probably thinking “I’m small time, won’t happen to me.” And I thought the\nsame as well until last night my phone provider blocked an attempt at a Simswap.\n\nTake the 10-15…",
  "data/reddit-crypto/r/CryptoCurrency/comments/nq23uv/i_moved_all_my_savings_to_a_stablecoin.json": "I've been thinking about this for a long time and I finally decided to move all\nmy savings to Celsius. Why should I keep my money in a bank? Not only I don't\nget any interests but I also have to pay 15 bucks a month just for the privilege\nof having an account. Now I get almost 9% interest rate,…",
  "data/reddit-crypto/r/CryptoCurrency/comments/nq3v26/dick_the_lgbtqia_coin_has_been_promoted_by_cnn.json": "https://www.cnn.com/2021/06/01/investing/pride-month-lgbtq-stocks/index.html\n\nhttps://coinmarketcap.com/currencies/dick/\n\ndick.foundation [https://dick.foundation]\n\n\n\n$DICK PUMP",
  "data/reddit-crypto/r/CryptoCurrency/comments/nq5172/vitalik_buterin_deserves_the_respect_but_little.json": "Ilya Zhitomirskiy\n\nand he deserves a Tribute for what he accomplished.\n\nWe should've all knew his name by now, but unfortunately he passed away from\nSuicide at the age of 22.\n\nIlya Created the first Decentralized Social Network Diaspora.\n\nIt's still used today. Mostly underground groups, Privacy…",
  "data/reddit-crypto/r/CryptoCurrency/comments/nq6ukc/ill_never_forget_that_one_guy_that_sent_me_10.json": "Like the title says, I could never, ever, ever forget that one guy that has sent\nme 10 moons. Because of him, I have started being more active, I feel more\nconfident when I speak, I wake up some nights and think about that one guy that\ndin't have many himself, but decided to share. I feel so happy…",
  "data/reddit-crypto/r/CryptoCurrency/comments/nq7eyw/may_update_free_crypto_the_importance_and_how_to.json": "In March I started keeping track of my free Crypto. This is any crypto that I\nhaven't personally bought.\n\nMy methods:\n\nCoinbase Earn:\n\nYou earn free crypto by watching a video explaining how a project works, and\nanswer some questions about it, in return you receive between $1-$3 dollars for\neach…",
  "data/reddit-crypto/r/CryptoCurrency/comments/nq7pba/a_report_from_the_field_involving_the_real.json": "OK people, strap in. First of all, let me assure you that everything below\nhappened exactly as I’ve written it. I’m a former journalist; I love chatting\nwith interesting people and kinda letting them talk. Today has left me shook,\nbut thoroughly entertained.\n\nSo, I’m in Las Vegas today on a post…",
  "data/reddit-crypto/r/CryptoCurrency/comments/nqcdb9/my_boss_told_me_to_buy_ethereum_back_in_early.json": "I was doing a summer internship in San Francisco and my boss took me to lunch\nand started asking me about Bitcoin and what I thought of it. We both agreed on\nhow high the price is currently and that what it’s trying to accomplish is\nnothing short of amazing. However, after that conversation he said,…",
  "data/reddit-crypto/r/CryptoCurrency/comments/nqcqw2/unpopular_opinion_treat_your_crypto_investment_as.json": "When you buy crypto with fiat, put that crypto away someplace safe and act as if\nit is gone forever.\n\nPretend you flushed it down the toilet.\n\nOr you lost it in a tragic boating accident.\n\nIt is long gone.\n\nThat way, you can HODL without worrying about what the price is. You won't be\nchecking the…",
  "data/reddit-crypto/r/CryptoCurrency/comments/nqfjxs/wtf_someone_sent_me_95_billion_worth_of_a_scam.json": "Okay WTF you guys, I just logged onto Koinly and my heart jumped out of my chest\nwhen I saw my portfolio value was $9.58 billion.\n\nPic of my Koinly dashboard [https://i.imgur.com/49ZvxBh.jpg]\n\nFor some reason, on May 26 someone sent me 11 billion Fear NFT tokens on BSC.\nThrough a little research, I…",
  "data/reddit-crypto/r/CryptoCurrency/comments/nqkg80/attacking_newbs_with_not_your_keys_not_your.json": "I know people who once reading this, decided not to bother with crypto. Why??\nBecause it made them think that exchanges are being hacked on the daily, for\neveryone to be so hardcore about never leaving anything on an exchange. I’ve had\na hard time converting my friends to crypto due to the following…",
  "data/reddit-crypto/r/CryptoCurrency/comments/nqkqxm/crypto_addiction.json": "Crypto Addiction as given me so much more then a receding hairline and sleepless\nnights. I can contribute the following to my \"interest\" in Crypto investing:\n\n-I gave up smoking cigarettes. I was spending close to $400 AUD a week on\nsmoking. When I caught the Crypto bug I wanted to invest more money…",
  "data/reddit-crypto/r/CryptoCurrency/comments/nqp6f9/i_dont_know_what_crypto_is_and_at_this_point_im.json": "I started investing in Crypto a few months ago, without having any clue what it\nis and what it does. I indeed have no friggin idea.\n\nI have invested around 5k so far and still have no clue. None.\n\nI even told my friends about it and advised them to start investing. When they\nasked what Bitcoin or…",
  "data/reddit-crypto/r/CryptoCurrency/comments/nqsqob/hold_on_to_your_bat_great_news_from_brave.json": "Brave is implementing a free video call function into their popular Brave\nbrowser: https://together.brave.com/ Together with news about the incoming brave\nsearch those are very good news! I believe strongly in that project and i think\nthey are on a good way to be able to offer a complete package of…",
  "data/reddit-crypto/r/CryptoCurrency/comments/nqsugx/psa_limit_orders_can_savemake_you_a_lot_of_money.json": "Just a heads up, if you’re already using limit orders, I’m not writing this with\nyou in mind, so I’m just letting you know that now so that I don’t waste your\ntime.\n\nI considered putting this in one of the more beginner subs since a lot of people\nwho’ve been into crypto for a little while already…",
  "data/reddit-crypto/r/CryptoCurrency/comments/nqv21s/where_do_you_send_people_to_learn_about_bitcoin.json": "Really wondering what resources everyone uses to send people to learn about\nBitcoin, Ethereum, Dogecoin - and even other altcoins. Please post links and\ninfo in the comments!\n\nIf you have a recommended resource - what do you like / not like about it? Is\nthere anything you would change about it?…",
  "data/reddit-crypto/r/CryptoCurrency/comments/nr5rm4/i_believe_in_the_future_of_crypto_more_then_just.json": "Well im not gonna tell my whole life story, but hopefully it can help some of\nyall out, as reading alot of yalls stuff has helped me out over the years.\n\nshort story, i saw in sept of 2017 bitcoin was making new highs. Having herd of\nbitcoin in 2012, and seeing it still be relevant, and at 2500$,i…",
  "data/reddit-crypto/r/CryptoCurrency/comments/nrbphw/what_i_learned_from_this_sub_in_a_few_months.json": "I am a user of this sub since a few months I learned some things I wanna share\nwith you.\n\n * Use a secure password and 2FA Verification.\n * Invest only what you can afford to lose.\n * We hate these prediction polls.\n * Robinhood sucks\n * Ethereum > Bitcoin\n * We are still early\n * Dogecoin is not a…",
  "data/reddit-crypto/r/CryptoCurrency/comments/nrcvog/borrowing_using_crypto_as_collateral_my.json": "As tax day in the U.S (5/17) quickly crept up on me, I found myself in a\npredicament: I was crypto rich but cash poor and did not have enough dollars to\npay my taxes. This led me to doing research on how to borrow using crypto as\ncollateral for I was trying to avoid selling crypto to pay taxes,…",
  "data/reddit-crypto/r/CryptoCurrency/comments/nrdcmj/investing_instead_of_buying_cigarettes.json": "Inspired by this\n[https://www.reddit.com/r/CryptoCurrency/comments/nr2v11/your_20_crypto_investment_is_great_dont_get/h0ex4wl?utm_source=share&utm_medium=web2x&context=3]\ncomment in another thread, I created this table just to visualize how much\ncrypto you would have if instead of spending on your…",
  "data/reddit-crypto/r/CryptoCurrency/comments/nreh3v/psa_best_way_to_hodl_is_by_being_busy.json": "A lot of people check the charts every 15 minutes. I used to be that guy too.\nEven though I knew that a small 20 minute pump or dip doesn't mean shit\nlong-term, I kept on checking charts like a maniac. If anything, checking charts\ntoo often makes you nervous, and you risk of letting your emotions…",
  "data/reddit-crypto/r/CryptoCurrency/comments/nrku3o/gta_6_to_include_ingame_cryptocurrency_rewards.json": "According to a prominent leaker, Grand Theft Auto 6 will pay players in-game\ncryptocurrency rewards for completing some missions, as per report by U.Today.\n\nAs claimed in a June 3 tweet by famous leaker Tom Henderson, the next instalment\nof the iconic franchise will pay players rewards in crypto…",
  "data/reddit-crypto/r/CryptoCurrency/comments/nrl838/cardano_x_ergo_explained.json": "There were various questions on how Cardano and Ergo were related so I created\nthe following infographic to shed some light into the subject! There is a lot of\ncollaboration going on between both groups. With Alonzo coming to fruition, it\nis important to understand the ecosystem that will exist. One…",
  "data/reddit-crypto/r/CryptoCurrency/comments/nrotis/anybody_else_crypto_poor.json": "So I’ve got all this money in crypto but I can’t use it. On paper I’m not poor\nat all, but in reality I just have enough money for food. I don’t want to take\nout of my positions because I want to maximize gains and my paychecks keep going\ntowards buying the dips. Just waiting for a brighter day when…",
  "data/reddit-crypto/r/CryptoCurrency/comments/nrq3e4/new_to_crypto_overwhelmed_i_made_a_crypto.json": "I've just gotten into crypto in the past couple of months. It's incredibly\noverwhelming when you're starting. What the hell are all of these cryptos for?\nWhy do we need them all? Which one should I pick?\n\nI think a lot of people struggle with similar questions when they're starting\nout. Eventually…",
  "data/reddit-crypto/r/CryptoCurrency/comments/nrrp8g/daily_discussion_june_4_2021_gmt0.json": "Welcome to the Daily Discussion. Please read the disclaimer, guidelines, and\nrules before participating.\n\n--------------------------------------------------------------------------------\n\n\n\n\n\nDISCLAIMER:\n\nThough karma rules still apply, moderation is less stringent on this thread than\non the rest of…",
  "data/reddit-crypto/r/CryptoCurrency/comments/nrw29z/this_is_single_handedly_the_most_fud_aiming.json": "\"US looks into cryptocurrency role in Ransomware hacks\"\n\nCould you imagine turning on the news one day and reading, \"US looking into\ndollar bills role in bank robberies\"\n\nThe fact ridiculous articles and headlines can even be takem serious is\nastounding. But sure let's blame the asset, let's blame…",
  "data/reddit-crypto/r/CryptoCurrency/comments/nrxuuu/elon_musk_manipulates_markets_and_none_of_the.json": "It is evident that none of the regulators care about manipulation going on.\nHeck, they even allowed him to manipulate stock prices and get away by paying a\nsmall fine. They arent going to do anything about crypto manipulation.\n\nOnly a fool will believe insiders arent trading these manipulations and…",
  "data/reddit-crypto/r/CryptoCurrency/comments/ns4s0p/cryptomarkets_are_just_as_immature_as_the_last.json": "Institutional adoption.\n\nAll sorts of banks and institutions rolled out crypto products to sell to their\ncustomers, to be shelved until the next run arrives. This isn't new, exactly the\nsame thing happened last run. There's no real buying pressure from institutional\ninvestors either, Grayscales'…",
  "data/reddit-crypto/r/CryptoCurrency/comments/ns53mn/25_good_people_for_crypto.json": "I don't care who is bad for crypto and manipulating it. So here are 25 people\nwho are good for people. (I missed way to many big ones.) Let's talk about these\npeople instead of the bad ones.\n\n * Satoshi Nakamoto, Legend\n * Changpeng Zhao, CEO of Binance\n * Vtalik Buterin, Founder of ETH\n * Joseph…",
  "data/reddit-crypto/r/CryptoCurrency/comments/ns9ik9/the_interview_with_vb_is_fascinating_and_gives_me.json": "It's amazing to me just how wholesome Vitalik is and how much you can tell he\ncares about making sure Ethereum ends up being built correctly instead of just\nfocusing on short term price action. He has put so much thought into ideas for\nscaling, both with L1 and L2 solutions, that I am completely…",
  "data/reddit-crypto/r/CryptoCurrency/comments/nsbig7/there_should_be_a_crypto_which_you_earn_by.json": "There can be designated drop off sites where depending on the weight of the\ntrash, you get a corresponding amount of crypto. Or maybe the trash collection\nis what allows more crypto to be mined in the first place. Idk just a crazy\nidea!",
  "data/reddit-crypto/r/CryptoCurrency/comments/nsd432/robinhood_coinbase_microsoft_never_forget_what.json": "ROBINHOOD\n\nDon't buy Crypto on Robinhood . The company almost went under on a 3B margin\ncall over illegal GME paper trades. They restricted buying on doge, then\nBullshitted their way out of it when officials questioned them.\n\n\nCOINBASE\n\nHad to dish out $6.5 million in fines for using bots to…",
  "data/reddit-crypto/r/CryptoCurrency/comments/nshhjv/regulation_is_not_your_friend.json": "To those calling for regulation, ask yourself: what would Satoshi say?\n\nThis may get downvoted to obscurity, but I have to get it off my chest.\n\nAll this clamoring for regulation of crypto markets is really sticking in my\ncraw. Both in this sub and other online crypto spaces over the past few…",
  "data/reddit-crypto/r/CryptoCurrency/comments/nshon3/i_stopped.json": "For almost a month I have not checked crypto prices and I have barely been on\nReddit. You know what happened?\n\nNothing really. I mean I spent more time playing with my kids, went on dates\nwith my wife and even went golfing with my parents. I have always planned on\njust hodling but always felt…",
  "data/reddit-crypto/r/CryptoCurrency/comments/nsizvk/daily_discussion_june_5_2021_gmt0.json": "Welcome to the Daily Discussion. Please read the disclaimer, guidelines, and\nrules before participating.\n\n--------------------------------------------------------------------------------\n\n\n\n\n\nDISCLAIMER:\n\nThough karma rules still apply, moderation is less stringent on this thread than\non the rest of…",
  "data/reddit-crypto/r/CryptoCurrency/comments/nsldgq/pay_attention_to_apr_vs_apy.json": "Many exchanges offer interest rates on your bitcoin and other cryptocurrencies\nwhen you deposit with them. When shopping for the best interest rates, pay\nattention to whether the rate is APR or APY. The difference is subtle, but\nimportant, especially for large amounts.\n\nAPR, or Annual Percentage…",
  "data/reddit-crypto/r/CryptoCurrency/comments/nsmcpw/the_sec_has_been_ordered_by_the_court_twice_to.json": "Basically the sec is now stalling. It’s becoming very apparent Jay Clayton went\nahead with this lawsuit prematurely and without concluding an investigation. The\nguy literally did it on his last day.\n\nThe court has ordered the SEC to hand over documents regarding Eth and BTC twice\nand they still…",
  "data/reddit-crypto/r/CryptoCurrency/comments/nssu8u/uk_how_i_got_my_coinbase_account_returned.json": "In the UK I used a service called Ombudsman who contacted Coinbase on by behalf.\nWithin 24 hours of Oms notifying Coinbase after six months of support tickets my\naccount verified and restored with full funds.\n\nI provided them with all of my ticket IDs and screenshots showing the automated\nclosure…",
  "data/reddit-crypto/r/CryptoCurrency/comments/nstpcg/cardano_can_be_dosed_for_165k_per_day_5m_a_month.json": "For just $5million you can completely disable Cardano for a whole month. Imagine\nshorting the coin then doing this; you'd make a fortune.\n\nHere's how I did my calculations:\n\n 1. Cardano runs a 6.55tps\n 2. Cardano transactions cost 0.17 ADA currently $0.29\n\n6.55tps x $0.29 = $1.90 per second\n\nx60 =…",
  "data/reddit-crypto/r/CryptoCurrency/comments/nsuobu/am_i_the_only_one_who_doesnt_get_the_nft_art_craze.json": "Ok ok... I understand the buying and selling of items in games because well...\nthey have a purpose. You can use them to enhance your gaming experience...\n\nI understand music.. I buy an album and then forever own it. If you wipe your\nhard drive you can recover it without having to buy it again..\n\nI…",
  "data/reddit-crypto/r/CryptoCurrency/comments/nt0smv/jack_dorsey_at_a_bitcoin_conference_is_like.json": "What a FK'in Travesty. Decentralization is here because of people like him. Just\nhow why MeToo Rallies exist in the first place. Because of people like Harvey\nWeinstein.\n\nBig Corporate centralized information hoarding, censoring conglomerates like\nTwitter, Facebook, YouTube that hold monopolies on…",
  "data/reddit-crypto/r/CryptoCurrency/comments/nt38z0/20210605_rcryptocurrency_surpassed_rbitcoin_in.json": "For the first time in crypto reddit history, r/CryptoCurrency\n[/r/CryptoCurrency] has surpassed r/bitcoin [/r/bitcoin] to become the largest\ncrypto subreddit. Crypto subscriptions and engagement during 2021 has exploded\nand we were the fastest growing subreddit for many days, weeks, and months…",
  "data/reddit-crypto/r/CryptoCurrency/comments/nt46yf/why_ive_become_an_altcoin_maximalist.json": "After two days of watching Bitcoin sycophants line up to feed their own\necho-chamber, followed by a panel of bitcoin maximalists bros defending bitcoin\ntoxicity, and the crowds cheering them on, I have sold all my Bitcoin and move\nit all to Alts.\n\nI was already wavering due to Bitcoins energy usage…",
  "data/reddit-crypto/r/CryptoCurrency/comments/nt531l/the_president_of_el_salvador_just_announced_that.json": "The President of El Salvador just announced that he is making Bitcoin legal\ntender in his country.\n\nThis is the first country to take such a courageous step, but it won’t be the\nlast\n\nToday, the country of El Salvador has taken one small step for bitcoin, but a\ngiant step forward for…",
  "data/reddit-crypto/r/CryptoCurrency/comments/nt65vi/if_i_was_interested_in_crypto_and_i_saw_clips_of.json": "Is anyone taking this conference seriously? I’m in an industry that likes to\nparty but I’m getting some serious secondhand embarrassment from the behavior at\nthis conference.\n\nTo be honest, I don’t think too much about any coin community. But this\nconference is showing the world a narrowed profile…",
  "data/reddit-crypto/r/CryptoCurrency/comments/nt8va9/daily_discussion_june_6_2021_gmt0.json": "Welcome to the Daily Discussion. Please read the disclaimer, guidelines, and\nrules before participating.\n\n--------------------------------------------------------------------------------\n\n\n\n\n\nDISCLAIMER:\n\nThough karma rules still apply, moderation is less stringent on this thread than\non the rest of…",
  "data/reddit-crypto/r/CryptoCurrency/comments/nt9i15/noob_tip_complete_coinbase_earn_rewards_during.json": "This isn’t some grand money making advice, but might help out a few people (like\nme) who want to be invested in crypto but don’t have a ton of capital.\n\nSo most people know about the Coinbase earn program, where you can complete\nactivities that give you free crypto (usually $3-$5). However, they…",
  "data/reddit-crypto/r/CryptoCurrency/comments/ntf2iw/psst_everyone_is_sleeping_gas_fees_are_down_to_10.json": "Psst, everyone is sleeping, gas fees are down to 10 gwei on ETH. Again pretty\nlow and again a reminder. Move your stuff if you need to. Uniswap fees are\ntherefore low too.\n\n10 gwei seems to be a good deal :)\n\nhttps://etherscan.io/gastracker\n\nRegular transfer: $0.50\n\nERC20: $1.76\n\nUniswap: $5.42\n\nI…",
  "data/reddit-crypto/r/CryptoCurrency/comments/nth3ma/is_this_a_conspiracy_theory_or_a_real_concern.json": "Just this morning I came across a post that's kind of shocked me. I have read a\nfew bad things about manipulation and dirty games by exchanges, but this is\ntotally next level and might tell us the worst is not behind us. Here's the\nlink:\n\nhttps://crypto-anonymous-2021.medium.com/the-bit-short-inside…",
  "data/reddit-crypto/r/CryptoCurrency/comments/ntibo4/a_great_idea_if_youre_scared_of_not_holding_long.json": "So I’ve been thinking about regrets people have had in the past, you know the\nstories where people say “oh I invested in Bitcoin at $1,000 but sold when it\nhit $7,000” we’ve seen the same regrets over and over again.\n\nHere’s a solution. Say you wanna hold for at least 5 years, but you’re afraid\nyour…",
  "data/reddit-crypto/r/CryptoCurrency/comments/ntjhna/apple_announcing_crypto_emojis_would_move_the.json": "Always surprises me what moves crypto, stupid tweets by Elon and Chinese\nregulation rumors cause massive price swings but strong evidence of mass\nadoption and its like nothing happened? maybe we just need america to wake up?",
  "data/reddit-crypto/r/CryptoCurrency/comments/ntn7ii/i_dont_think_people_realize_what_amazing_stuff_is.json": "First of all, I want to give a short summary about IOTAs recent accomplishments.\n\n 1. Chrysalis [https://blog.iota.org/iota-chrysalis-a-new-dawn/]: In April, the\n    IOTA Foundation released “the most extensive upgrade in IOTA’s history,\n    touching all aspects of the protocol, libraries, wallets…",
  "data/reddit-crypto/r/CryptoCurrency/comments/ntv4y9/ok_market_manipulators_btc_volume_looks_to_be_the.json": "Hey manipulators! The whales seem to have finished accumulating what little they\nwaned to accumulate, you can let the price go up now. Volume looks to be the\nlowest it’s been at least since the peak.\n\n(Apparently whales bought back 50 000 btc after selling 130 000. If my maths\nworks out, that means…",
  "data/reddit-crypto/r/CryptoCurrency/comments/ntz6l7/daily_discussion_june_7_2021_gmt0.json": "Welcome to the Daily Discussion. Please read the disclaimer, guidelines, and\nrules before participating.\n\n--------------------------------------------------------------------------------\n\n\n\n\n\nDISCLAIMER:\n\nThough karma rules still apply, moderation is less stringent on this thread than\non the rest of…",
  "data/reddit-crypto/r/CryptoCurrency/comments/nu0506/bitcoins_biggest_threat_is_its_culture.json": "I've been a believer in and a holder of bitcoin for a few years now. I enjoyed\ntaking the time to read and learn about the technology behind it. Setting up\nwallets and discovering new ways to use it. I invested some money in it and\nwatched with glee as the price went up and up and up. However, this…",
  "data/reddit-crypto/r/CryptoCurrency/comments/nu0ynj/meta_its_a_little_sad_to_see_this_community.json": "I'm sure many of you have seen the clips that have gone viral from BTC's Miami\nConference.\n\n * Max Keiser tearing up $10 bills, baptizing people and screaming on stage like\n   a lunatic\n\n * The disgusting \"BTC Toxic Maximalism is freedom\" garbage\n\n * The kid that jumped on stage to scream \"DOGE to…",
  "data/reddit-crypto/r/CryptoCurrency/comments/nu42im/now_a_congressman_from_paraguay_changed_to_laser.json": "Carlos Rejala, a Congressman from Paraguay has now said an announcement is\ncoming about Bitcoin this week.\n\n\n\nPost by Carlos Rejala\n[https://preview.redd.it/ddm47xn3wr371.jpg?width=1166&format=pjpg&auto=webp&s=88553bde7338242191d1b914ef81bf21abdb7b88]\n\n\n\n> As I was saying a long time ago, our…",
  "data/reddit-crypto/r/CryptoCurrency/comments/nu6va8/max_keiser_caught_lying_claims_he_bought_a_home.json": "This guy is single handedly bringing BTC a bad name. After the absolute clown\nshow in BTC conference, he seems to be doubling down on his shenanigans.\n\nHe now claims he bought a home in El Salvador to show support for the country's\npro- Bitcoin policies. Max claims to have bought a $729k home in El…",
  "data/reddit-crypto/r/CryptoCurrency/comments/nu8y1z/upvotes_are_not_only_about_moons_it_helps.json": "My request: If you really want to downvote a post, please provide some\ninformation why. Content creators are getting heavily discouraged about\nno-reason downvote waves and it hurts everyone. If you provide feedback or\ncritics, then you help the content provider to improve.\n\nI am really starting to…",
  "data/reddit-crypto/r/CryptoCurrency/comments/nub5u1/the_4th_largest_bitcoin_whale_just_bought_an.json": "The fourth largest Bitcoin holder bought another 1883 Bitcoins at $36,189.52.\n\nhttps://bitinfocharts.com/bitcoin/address/1P5ZEDWTKTFGxQjZphgWPQUpe554WKDfHQ\n\nThe certified Bitcoin billionaire has been buying more and more Bitcoins.\n\nReminder: There will only be 21 million Bitcoins (a lot of these are…",
  "data/reddit-crypto/r/CryptoCurrency/comments/nudwy1/the_quote_of_satoshi_nakamoto.json": "Since there is more and more cryptocurrencies and more and more big figures that\ntry to influence the market, I wanted to share what I think is the real\nimportance behind the cryptocurrencies :\n\n\"The root problem with conventional currency is all the trust that's required to\nmake it work. The…",
  "data/reddit-crypto/r/CryptoCurrency/comments/nugq7s/how_many_of_the_newbies_stuck_around.json": "With on-chain data showing that a lot of the selling was from short term holders\nI'm curious to know how many newbies had a white-knuckle grip but didn't let go\non the ride down.\n\nI felt the burn in 2018-2019 so I can sympathise.\n\nIf you're still around well done. It is stomach churning in the…",
  "data/reddit-crypto/r/CryptoCurrency/comments/nunaih/native_from_el_salvador.json": "I was born and raised in El Salvador for a part of my childhood until I moved to\nthe US. My parents have lived through a civil war, jumping over dead bodies to\ngo visit family or friends. The country has been through so much since its\ninception. Losing the native currency was also disheartening to…",
  "data/reddit-crypto/r/CryptoCurrency/comments/nurc0v/daily_discussion_june_8_2021_gmt0.json": "Welcome to the Daily Discussion. Please read the disclaimer, guidelines, and\nrules before participating.\n\n--------------------------------------------------------------------------------\n\n\n\n\n\nDISCLAIMER:\n\nThough karma rules still apply, moderation is less stringent on this thread than\non the rest of…",
  "data/reddit-crypto/r/CryptoCurrency/comments/nusj9f/can_we_stop_with_the_wsb_bullshit.json": "What the fuck is going on? The front page is full of posts about short squeezes,\nmarket manipulation, holding the line, coordinated FUD attacks and other\nconspiracy-theory nonsense. I get that a lot of folks had a lot of fun and made\nsome good money with the AMC/GME trades - but you have to realize…",
  "data/reddit-crypto/r/CryptoCurrency/comments/nuslsb/always_remember_banks_that_refuse_to_service.json": "Some Banks Refused to service Bitcoin customers because of \"Compliance Risks\"\nwhile they were laundering money.\n\nDutch Rabobank as a great example\n\nhttps://www.justice.gov/opa/pr/rabobank-na-pleads-guilty-agrees-pay-over-360-million\n\nhttps://money.cnn.com/2018/02/08/news/rabobank-mexico-drug-money…",
  "data/reddit-crypto/r/CryptoCurrency/comments/nuunpq/if_i_buy_the_price_immediately_dips_ill_start.json": "Was waiting through this nice dip and decided to buy before bed as things\nusually recover in the morning. Sure enough, it dipped another 5% or so within\n20 min of my purchase. This has been a good trend for about a month or so, so\nI'll begin providing my purchase details so everyone can wait 30min…",
  "data/reddit-crypto/r/CryptoCurrency/comments/nuvang/proof_of_stupidity_the_new_way_to_passively_stake.json": "You are in charge of your own money when you use crypto. This means that there\nis the possibility for some stupid shit to go down, and the potential for many\ncoins to be lost.\n\nAround 20% of the current bitcoin supply is lost, and the number of lost coins\nwill continue to increase as more clueless…",
  "data/reddit-crypto/r/CryptoCurrency/comments/nuvbwh/dont_listen_to_youtubers_and_reddit_posts_about.json": "A significant portion of /r/CryptoCurrency lurkers are young guns with a bit of\nmoney to their names. If that is you, then you may have been tempted to yolo in\nyour savings during this crash to \"stack crypto\" because popular youtubers and\ntop reddit posts keep touting that markets will…",
  "data/reddit-crypto/r/CryptoCurrency/comments/nuyw5m/if_you_guys_think_cryptocurrency_cultish_behavior.json": "You wouldn't believe the things I've seen some people do for this paper that is\nmelting in value faster and faster every day.\n\nI don't know if you've heard of it, but the cultish behavior around it is crazy.\nI've literally seen people die over this thing; rob people of their lives over\nit, and in…",
  "data/reddit-crypto/r/CryptoCurrency/comments/nuzqor/a_50_experiment.json": "Based on watching the comments over the last few months I’ve gathered that the\ncryptocurrency daily discussion is an excellent meter for measuring market\npsychology.\n\nI’m going to start with $50 to test this and invest it into Bitcoin when the\nDaily is filled with FUD. Today is a great day to start.…",
  "data/reddit-crypto/r/CryptoCurrency/comments/nv1m0z/are_idiots_really_selling_because_the_fbi.json": "This has to be some of the stupidest FUD I’ve ever heard of. I thought it would\nbe hard to top Tesla’s energy FUD when they are using child labor to mine\nlithium and ignoring so many aspects about the BTC energy debate, but here we\nare. So let’s recap this latest FUD. Some Russian hackers hacked…",
  "data/reddit-crypto/r/CryptoCurrency/comments/nv1url/hey_if_you_accidentally_got_too_many_lumens_last.json": "I'm sure whoever it is, is already aware and it is our fault (an incredibly rare\nbug caused it) but if you could return the Lumens we'd really appreciate it. We\nhaven't taken any profit from the site at all yet and it's only going to reduce\nthe pool balances for the next time you want to trade so…",
  "data/reddit-crypto/r/CryptoCurrency/comments/nv25pc/warning_to_users_of_gasnow_chrome_extension_eth.json": "The browser extension \"GasNow\" available for Chrome/Brave allows you to easily\nkeep track of ETH gas price and set up alerts. It has been downloaded by 10 000+\nusers, ranking it the second most dowloaded gas tracker extension.\n\nWhile usefull, a few days ago the extension was updated :\n\nThis…",
  "data/reddit-crypto/r/CryptoCurrency/comments/nv2r8f/cardano_vs_iota_an_analysis.json": "This account exists because I want to provide this space with meaningful\ninsights. My latest contributions were solely focussed around IOTA. I received\naccommodating and friendly responses from in and outside of the IOTA community\nwhich is the reason I keep going as there is obviously demand for…",
  "data/reddit-crypto/r/CryptoCurrency/comments/nv38cv/media_says_it_doesnt_matter_where_the_bitcoin.json": "According to media reporters, FBI claims that it can get access to bitcoin\nstored anywhere. That is just impossible, unless somehow they have developed\nways to crack SHA256 and brute force wallet private keys. In which case, BTC is\nthe least of everyone's worries and state/nuclear secrets could be…",
  "data/reddit-crypto/r/CryptoCurrency/comments/nv3hss/i_bought_1k_of_the_top_10_cryptos_on_january_1st.json": "EXPERIMENT – Tracking 2018 Top Ten Cryptocurrencies – Month Forty-One – UP +26%\n[https://preview.redd.it/3k3c4sgye1471.png?width=666&format=png&auto=webp&s=41a45a2e497be511c2d9b8363db1832f6c17eca9]\n\nFind the full blog post with all the tables is here\n[https://toptencryptoindexfund.com/tracking-2018…",
  "data/reddit-crypto/r/CryptoCurrency/comments/nv3t60/the_fbi_cant_crack_your_wallet_address.json": "Every crypto wallet has a private key. Most of us are told, rightfully, to guard\nthis private key with our lives, because anyone who gets access to it will be\nable to take your hard earned cash away. But what if someone like the FBI\nguessed your private key? This is how private keys look like for…",
  "data/reddit-crypto/r/CryptoCurrency/comments/nv4xfu/stats_el_salvador_dumps_usd_reserves_for_btc.json": "El Salvador has been steadily dumping USD from its reserves since October 2020\n[https://tradingeconomics.com/el-salvador/foreign-exchange-reserves]\n\nNow it announces buying BTC for its reserves amongst news of impending US\ninflation\n\nSource: https://tradingeconomics.com/el-salvador/foreign-exchange…",
  "data/reddit-crypto/r/CryptoCurrency/comments/nv514x/its_not_hodling_that_is_hard_it_is_taking_profits.json": "The feeling of greed gets so big that i set absurd sell orders and keep putting\nmy sell orders higher because of the greed. HODLing can be hard but imo taking\nprofits is way higher. When i was up 7 times on my vechain i didn't sell\nanything so now im \"only\" up 3 times. Whenever i get close to taking…",
  "data/reddit-crypto/r/CryptoCurrency/comments/nv5758/btc_time_the_bottom_contest.json": "Figured I'd throw some moons around to try and lighten the mood here a bit by\nhaving a little contest.\n\nWhoever guesses what the lowest price bitcoin will hit will win 400 moons second\nplace will get 150 moons and third place will get 50 moons.\n\nRules:\n\n-only one entry per person\n\n-placing is…",
  "data/reddit-crypto/r/CryptoCurrency/comments/nv5kfl/crypto_is_so_volatile_and_unstable.json": "Probably I'll get 100k downvotes but who gives a fuck.\n\nI just simply can't understand how is possible that a single rumor published by\nsome shitty website can trigger so much price drop.\nSomeone just wrote \"Bitcoin is hacked.\" and boom, -5000$ in value in one day.\nIf that's how things work, if…",
  "data/reddit-crypto/r/CryptoCurrency/comments/nv63pn/stop_checking_prices_every_10_seconds_go_outside.json": "I know its not easy to divert your attention from the market, especially with\nthe shitstorm thats going on right now, but a lot of you guys are way too\nstressed and worried about the market rn. I've seen some rather worrying\ncomments on the daily today and i think some of you need to delete your…",
  "data/reddit-crypto/r/CryptoCurrency/comments/nvamhc/is_eth_now_a_better_choice_than_btc.json": "It used to be that BTC was the safe bet, and ETH the moonshot (smart portfolio:\nBTC 90%/ETH 10%)....more recently it's been invest 50/50 (BTC 50%/ETH 50%). Now\nI'm wondering if it's smarter to weigh your portfolio more heavily in ETH. ETH's\nexpansion is looking pretty impressive. Look at the USD and…",
  "data/reddit-crypto/r/CryptoCurrency/comments/nvcem8/i_tried_all_the_free_methods_of_gaining_crypto.json": "The title says it all. I downloaded and used all the ‘free’ ways to earn crypto\nI read about on the internet and on reddit, so that you don’t have to. I tried\nto use them all for at least a month to see what kinds of earnings there were.\nThey are listed in order according to how much I recommend…",
  "data/reddit-crypto/r/CryptoCurrency/comments/nvgd4r/after_losing_several_discovery_disputes_against.json": "This is it for any doubters out there. For all the anti ripple people. The sec\nis using ripple to come after crypto. They literally told the court that the\nripple case will cause so much damage to them they will not be able to enforce\ncases. Just remember the sec never gave Eth and btc clearance.…",
  "data/reddit-crypto/r/CryptoCurrency/comments/nviceo/daily_discussion_june_9_2021_gmt0.json": "Welcome to the Daily Discussion. Please read the disclaimer, guidelines, and\nrules before participating.\n\n--------------------------------------------------------------------------------\n\n\n\n\n\nDISCLAIMER:\n\nThough karma rules still apply, moderation is less stringent on this thread than\non the rest of…",
  "data/reddit-crypto/r/CryptoCurrency/comments/nvigcl/algorand.json": "I was curious what people's opinion of Algorand is. I have read up on it. It\nseems really legit. It has great support and seems well thought out. Just the\npeople behind it give it so much credit.\n\nThe only negative I've heard is it has inflationary tokenomics.\n\nAm I missing something as to why it…",
  "data/reddit-crypto/r/CryptoCurrency/comments/nvmwsk/el_salvador_has_officially_passed_a_law_that.json": "And that’s a wrap ladies and gentlemen. On June 9, 2021, at approximately\n12:08am EST, El Salvador has become the First Nation to pass a bill that makes\nBitcoin a legal currency. Who would have thought this would happen so quickly!\nIt will take ~90 days for this law to be enacted; presumably to…",
  "data/reddit-crypto/r/CryptoCurrency/comments/nvot7v/misleading_titles_why_fbi_acquired_darkside.json": "The most important thing to understand with this “hack” is the difference\nbetween dark side and the person who demanded the ransom. “Dark side” is a\nransomware-as-a-service group. They charge 15% of the total ransom to design the\ncode that their client (aka affiliate) will then use to install on…",
  "data/reddit-crypto/r/CryptoCurrency/comments/nvrvqe/now_that_el_salvador_has_accepted_bitcoin_as.json": "Now that Bitcoin is officially recognized as a form of currency in El Salvador\nTesla is required to accept that form of payment under Art 7\n\n\"every economic agent must accept bitcoin as payment when offered to him by\nwhoever acquires a good and service\"\n\nHow the turntables have turned...\n\nEmphasis…",
  "data/reddit-crypto/r/CryptoCurrency/comments/nvsvgh/everyone_expected_1st_world_countries_to_start.json": "Instead other less developed countries started true adoption.\n\nJust this week three countries started moving towards a massive adoption\n\n> -Panama is working on a proposal to embrace Bitcoin and other cryptos in the\n> country.\n> \n> -The announcement came after El Salvador’s move to make Bitcoin a…",
  "data/reddit-crypto/r/CryptoCurrency/comments/nvv1ky/and_this_is_why_we_need_younger_leaders_not.json": "El Salvador Legislature Indicates Favor Toward President’s Bitcoin Bill\n\nThe government would also create a trust that would enable the “instantaneous\nconvertibility of bitcoin to dollars,” the bill said.\n\nAccording to report, bill includes following:\n\n> Goods may be priced in bitcoin Tax may be…",
  "data/reddit-crypto/r/CryptoCurrency/comments/nvvq2u/its_hard_to_invest_being_broke_but_taking_5_a.json": "I talk to my friends and they tell me they throw X amount into crypto to hold\nand I wish I could do the same. I've started having $5 taken out of each check\nand thrown into my crypto wallet. It's not much but it's better than not\ninvesting!\n\nTrust me it adds up, I get paid 2x a month and if you've…",
  "data/reddit-crypto/r/CryptoCurrency/comments/nvxfha/nayib_el_salvador_the_government_will_guarantee.json": "\"The Bitcoin law will have 0 risk for those who don't want to take risks. The\nGovernment will guarantee the BTC conversion to the exact value in USD at the\ntime of the transaction. This will also bring financial acceptance, investment,\ntourism, innovation and economic development for our country.…",
  "data/reddit-crypto/r/CryptoCurrency/comments/nvxi40/bit_of_crypto_positivity_this_week_in_5_seconds.json": " * El Salvador officially accepts bitcoin, Panama to follow\n * Tesla forced to accept bitcoin payments once again (haha)\n * Institutional holdings increased by 170% for long term investments (Coinbase)\n * SEC commissioner expresses the importance of not being too harsh with crypto\n   laws so…",
  "data/reddit-crypto/r/CryptoCurrency/comments/nvy61f/hodling_is_cool_but_using_crypto_is_cooler.json": "On May 5th, I made the absolute luckiest choice i've ever made in my life: I\nused most of my crypto investments to purchase myself a brand new gaming\ncomputer that I had wanted for a while. I know HODLing is exciting and future\ngains almost feel like guaranteed money, but I don't know how I would've…",
  "data/reddit-crypto/r/CryptoCurrency/comments/nvyz7j/shorts_on_btc_just_jumped_60.json": "BTC shorts just jumped up by another 60% after already going up 330% on the\n6th:https://datamish.com/btcusd/24h\n\nEdit: Better data: https://www.viewbase.com/bitfinex_long_short_position/btcusd\n\nSuggesting they are doubling down to cover potential losses from the recent pump\nto $36,500.00\n\nThe price…",
  "data/reddit-crypto/r/CryptoCurrency/comments/nw028m/ergodex_cardanos_and_ergos_decentralized_exchange.json": "Hello everyone, here's an infographic someone from the /ergonauts sub created\nabout ErgoDEX. A decentralized exchange that lives in the Ergo ecosystem. It's\nunique, since it's both an AMM and an orderbook. No other DEX has these two\nfunctions at the same time. AMM is great for low liquidity assets,…",
  "data/reddit-crypto/r/CryptoCurrency/comments/nw088t/ive_just_gotten_round_to_watching_the_lex.json": "I mean I've always had a healthy level of respect for Vitalik for everything\nhe's achieved in this space, but after watching him in the interview, his\nhumility, vast knowledge of everything crypto, positive energy and just\nall-around quirky awesomeness was damn impressive.\n\nHe's a positive voice in…",
  "data/reddit-crypto/r/CryptoCurrency/comments/nw8a06/new_moons_distribution_round_14_proposal.json": "Moons are r/CryptoCurrency [/r/CryptoCurrency]'s version of Community Points.\nCommunity Points [https://reddit.com/community-points] are a way for users to be\nrewarded for their contributions to the subreddit, and they can be used on\npremium features in the community.\n\nMoons are distributed every 4…",
  "data/reddit-crypto/r/CryptoCurrency/comments/nw8fz5/im_a_long_time_crypto_user_who_just_started_using.json": "Like the title says I've been in crypto for a while but I've never really\ndabbled in DEFI because ETH does a pretty good job of pricing out retail\ninvestors.\n\nRecently I learn how to bridge between the BSC chain and MATIC network for\npennies and started using AAVE to generate some passive income as…",
  "data/reddit-crypto/r/CryptoCurrency/comments/nw9zm8/daily_discussion_june_10_2021_gmt0.json": "Welcome to the Daily Discussion. Please read the disclaimer, guidelines, and\nrules before participating.\n\n--------------------------------------------------------------------------------\n\n\n\n\n\nDISCLAIMER:\n\nThough karma rules still apply, moderation is less stringent on this thread than\non the rest of…",
  "data/reddit-crypto/r/CryptoCurrency/comments/nwac6l/the_european_union_just_gave_10_percent_of_its.json": "https://cordis.europa.eu/project/id/101019645\n\nThis works out to a total of € 535,000 granted to the IOTA Stiftung by the EU\nCommunity Research and Development Information Service for their SECANT platform\nwhich has the goal of \"improving the readiness and resilience of the\norganizations against the…",
  "data/reddit-crypto/r/CryptoCurrency/comments/nwcz7e/if_youre_investing_in_crypto_to_enrich_yourself.json": "I think it's a big problem in today's (US) public education system that we don't\nteach personal financial basics in school anymore.\n\nWhen I got married a few years ago, my wife and I, in our mid-30's realized that\nwe had no financial education except the lessons we had learned from our own\npast…",
  "data/reddit-crypto/r/CryptoCurrency/comments/nwd21b/donald_trump_and_elizabeth_warren_coming_out.json": "They fear us, and they should\n\nThey're both watching the world move on and evolve past them.\n\nThey're both trying to seize power against us, and Bitcoin and crypto in general\nputs some of that power back in our hands.\n\nThey should be afraid. All politicians should.\n\nThere's now something out there…",
  "data/reddit-crypto/r/CryptoCurrency/comments/nwgzp6/id_rather_be_down_99_than_to_die_regretting_i.json": "This is what made me get into crypto 5 years ago to begin with. I've experienced\n3 big slaps in the face in my life not taking the chance when I easily could.\n\n\n1999\n\n21 years ago I was in a business school for programming. I was On my way to\nbarnes and noble to pick up a C++ book when I heard on…",
  "data/reddit-crypto/r/CryptoCurrency/comments/nwidqh/i_bought_1k_of_the_top_10_cryptos_on_january_1st.json": "EXPERIMENT - Tracking 2019 Top Ten Cryptocurrencies – Month Twenty-Nine- UP\n+653%\n[https://preview.redd.it/o7l48odf7e471.png?width=666&format=png&auto=webp&s=7677ccf3a7c41a67de083b9b1e9e5be6b8553f19]\n\nThe full blog post with all the tables is here\n[https://toptencryptoindexfund.com/tracking-2019-top…",
  "data/reddit-crypto/r/CryptoCurrency/comments/nwj2ae/this_sub_dont_ever_tell_anyone_how_much_crypto.json": "Seems a little incongruous, don't you think?\n\nSome people think you should make the display optional, but I don't think we\nshould be encouraging this behaviour at all. Just hide it, as it's completely\nagainst the ethos of the sub. Remember, this is an unregulated environment and\nwe're exposing…",
  "data/reddit-crypto/r/CryptoCurrency/comments/nwnwfo/community_governance_proposal_increase_karma.json": "This proposal is on behalf of u/that_one_indian_dude [/u/that_one_indian_dude],\nyou can see their original proposal and reasoning in r/CryptoCurrencyMeta\n[/r/CryptoCurrencyMeta] here.\n[https://new.reddit.com/r/CryptoCurrencyMeta/comments/np7mmz/proposal_increase_the_karma_requirements/]\n\n\n\nCurrently…",
  "data/reddit-crypto/r/CryptoCurrency/comments/nwpwfc/stop_just_celebrating_bukele_just_for_legalizing.json": "He sent the army in to force the legislature to pass bills he wants passed.\n\nHe's getting rid of term limits for presidents\n\nHe is getting rid of the supreme court.\n\nHe has one of the harshest lockdown laws during covid in the world, and still\nhas some harsh laws.\n\nHe's been named one of the most…",
  "data/reddit-crypto/r/CryptoCurrency/comments/nwts08/if_youre_using_coinbase_use_coinbase_pro_instead.json": "TL;DR: Coinbase fees > Coinbase Pro fees\n\nIt’s not some special premium app that you have to pay for, it’s just a better\nversion of Coinbase in my opinion.\n\nYou’re paying less fees for every transaction compared to Coinbase, you don’t\nneed to upgrade anything, just login to it with the same…",
  "data/reddit-crypto/r/CryptoCurrency/comments/nwvl0x/internet_computer_icp_is_already_down_85_from_the.json": "The coin with the worst tokenomics in the history of crypto. 1% airdropped, 50%\nto the team, rest sold to VC’s who recently were able to dump their coins.\n\nThese early investors bought anywhere from as little as 3 cents to around 5$ per\ncoin, currently trading at $67. Every month new supply gets…",
  "data/reddit-crypto/r/CryptoCurrency/comments/nx23m4/i_work_to_get_crypto_i_get_crypto_so_i_dont_have.json": "So, cynical people about crypto often say to me that if I believe in crypto so\nmuch, why am I still doing a normal job and earning 'useless fiat'. Well,\nactually it's simple, I work so my savings all go into crypto. And with crypto,\nI am seeking my financial freedom (No lambo!) so that one day I…",
  "data/reddit-crypto/r/CryptoCurrency/comments/nx2b4u/daily_discussion_june_11_2021_gmt0.json": "Welcome to the Daily Discussion. Please read the disclaimer, guidelines, and\nrules before participating.\n\n--------------------------------------------------------------------------------\n\n\n\n\n\nDISCLAIMER:\n\nThough karma rules still apply, moderation is less stringent on this thread than\non the rest of…",
  "data/reddit-crypto/r/CryptoCurrency/comments/nx2edm/if_this_is_your_first_50_dip_and_you_still.json": "This is especially for all the newcomers to crypto during this cycle. The FUDs\ndidn't get to you and you stood strong! It has been really hard on me too as I\nam one of the newcomers too! I have been in this crypto space for not too long\nand after I initially invested the price started to dip.…",
  "data/reddit-crypto/r/CryptoCurrency/comments/nx3s6n/you_can_now_earn_3_in_amp_free_from_coinbase.json": "Check the Coinbase Rewards section, there's a survey you can earn $3 in AMP\nrewards from if you complete it! I won't be sharing the answers here since it's\na very short quiz and you get unlimited attempts to complete it. Honestly, it's\na good way to learn more about new coins and earn rewards while…",
  "data/reddit-crypto/r/CryptoCurrency/comments/nxb9xw/cardanos_future_mic_drop_moment_being_able_to_pay.json": "Concept explained, video: https://www.youtube.com/watch?v=TkiltupoocM , 9 minute\nvideo about \"Babel Fees on Cardano\" by Prof. Aggelos Kiayias / Whiteboard\nPresentation\n\nSource: https://iohk.io/en/blog/posts/2021/02/25/babel-fees/\n\n\"First, let us recall how native assets work in Cardano: Tokens can…",
  "data/reddit-crypto/r/CryptoCurrency/comments/nxe19h/technical_discussions_are_becoming_impossible_in.json": "Simple topics made in 1 minute like this one\n[https://www.reddit.com/r/CryptoCurrency/comments/ng4moj/the_entire_market_dipped_heres_why/]\nare fun from time to time and they can get 10k+ upvotes but anything that has\nany kind of technical discussions on new features/updates that could…",
  "data/reddit-crypto/r/CryptoCurrency/comments/nxf1f1/if_you_miss_the_early_years_of_the_internet_you.json": "If you have a bit of nostalgia for early internet before it got whored out to\ngovs and corporations, where there were no boomers/facebook Karens and\ninfluencers, just nerds on websites with absolute atrocious design if any and\ndegen forums you better realize this is the short lived state that defi…",
  "data/reddit-crypto/r/CryptoCurrency/comments/nxtftt/my_credit_union_accepted_my_crypto_as_assets_on_a.json": "I listed the current value of my Coinbase account and self custody crypto along\nwith things like stocks and retirement accounts as assets on a bunch of recent\nmortgage refi applications. Was shocked that out of all the places I applied\nthat my credit union accepted it and treated them just like my…",
  "data/reddit-crypto/r/CryptoCurrency/comments/nxtvbg/the_complete_guide_to_coinbase_fees_and_how_to.json": "The Complete Guide to Coinbase Fees (and How to Avoid Them)\n\nThere are so many new subs to this forum and a lot of them are Coinbase users.\nYeah Coinbase has a cool graph that shows you your portfolio. It’s also very\neasy to use for a beginner.\n\nNow there is nothing wrong with Coinbase (except, of…",
  "data/reddit-crypto/r/CryptoCurrency/comments/nxxhj2/everything_will_rally_in_the_next_48_hours_calm.json": "Two days ago bears got alittle ahead of themselves and opened up a record number\nof short positions around 36,200. The following day, instead of going down\nprices went up to 37200+ putting this record setting group into the red.\n\nThey were unable to drive BTC down directly. What you're seeing now is…",
  "data/reddit-crypto/r/CryptoCurrency/comments/nxykfs/retail_is_selling_smart_money_is_accumulating.json": "Bitcoin is following a textbook wyckoff accumulation period and i am of the\nbelief that we are near the end of this accumulation phase.\n\nLook at the first diagram in this article and it looks exactly like the bitcoin\ndaily chart. Selling climax, tight trading range, failed sell off with a bounce\nand…",
  "data/reddit-crypto/r/CryptoCurrency/comments/nxzezg/conclusion_dont_talk_to_my_granny_about_bitcoin.json": "Told my 82 year old granny on the phone last night that I had invested money\ninto crypto. Oh that's nice, she said. No biggie.\n\nHalf an hour later, my dad rings.\n\nDad: why the hell did you tell my mother that you bought a crypt?",
  "data/reddit-crypto/r/CryptoCurrency/comments/nxzmnk/so_whats_actually_going_on_serious_discussion.json": "This whole thing makes no sense to me. It seems that news of bitcoin adoption;\nEl Salvador, banks storing assets, states accepting bitcoin plus the fact there\nare tons of news about it, more companies experimenting etc... isn't doing\nanything.\n\nThe price isn't going up.\n\nWhat is causing this…",
  "data/reddit-crypto/r/CryptoCurrency/comments/ny4qj9/using_crypto_to_send_money_to_inmates.json": "So this is not a personal problem, I don’t know anyone that is in jail currently\nbut I thought about this for the past couple of days and did some research on\nit.\n\nHow do we send money to inmates?\n\nCurrently, in the US, there are 2 ways,\n\n1- Western Union and we all know that this have insane…",
  "data/reddit-crypto/r/CryptoCurrency/comments/ny71xi/algorand_receives_a_100_million_investment_from.json": "The Venture Capital Firm Arrington Capital Management has launched an Ecosystem\nFund to support companies based on Algorand, a Layer 1 blockchain. The Arrington\nAlgo Growth Fund puts aside funds to purchase stock and tokens from enterprises\nin Algorand's rapidly expanding…",
  "data/reddit-crypto/r/CryptoCurrency/comments/nyax96/were_not_against_the_usa_and_the_dollar_were.json": "We are not against the dollar or against the USA, I can speak for everyone that\nwe are Patriots and would defend our homeland, but we are against the puppets in\nWashington taking care of the 1%. I've seen alot of post of the dollar being a\nshit coin and I agree, however, this is due to the rats in…",
  "data/reddit-crypto/r/CryptoCurrency/comments/nybenc/forget_the_price_look_at_adoption.json": "Just a few weeks ago, everyone was ecstatic. Ethereum was going to 10k, Bitcoin\nto 100k, Doge was gunna hit $1\n\nAnd then one tweet collapsed the entire market. Still down ~50% from ATH.\n\nAnd it’s funny too. We’ve had massive adoption since then. Real governments are\nadopting Bitcoin.\n\nIt’s legal…",
  "data/reddit-crypto/r/CryptoCurrency/comments/nyctu9/95_of_2017_and_earlier_crypto_hodler_were_deep_in.json": "Most investors that have recently joined crypto are sitting on some pretty big\nlosses atm but be patient my friends Rome wasn’t built in a day and lambos might\nnot be in store for 2021 but with time and hodling, a trip to the moon is in the\ncards. Don’t sell mis amigos never sell. You have to die to…",
  "data/reddit-crypto/r/CryptoCurrency/comments/nyht6s/inflation_is_getting_serious.json": "I work at a dominos as a part time job while I go to trade school and today we\nhave officially raised the prices on every item in the store. They said we’ll\nget a raise but it hasn’t happened yet and it just kind of slipped under\neveryone’s nose. No one has asked about the prices being raised or…",
  "data/reddit-crypto/r/CryptoCurrency/comments/nyhw3i/icp_internet_computer_team_members_paying_to_doxx.json": "https://np.reddit.com/r/ICPScam/comments/nx9oio/fake_team_members_fiasco/h1ezn8q/?context=3\n\nThere was some drama going on regarding ICP on another sub in Reddit where a\nteam member named Dominic Williams was offering people ICP to doxx someone. I\ndon't hold any ICP, but also I don't think this is a…",
  "data/reddit-crypto/r/CryptoCurrency/comments/nyk618/daily_discussion_june_13_2021_gmt0.json": "Welcome to the Daily Discussion. Please read the disclaimer, guidelines, and\nrules before participating.\n\n--------------------------------------------------------------------------------\n\n\n\n\n\nDISCLAIMER:\n\nThough karma rules still apply, moderation is less stringent on this thread than\non the rest of…",
  "data/reddit-crypto/r/CryptoCurrency/comments/nyk784/crypto_currency_might_have_saved_my_life.json": "So August 2020 I went blank, in a middle of a Zoom meeting!\n\nTurned out it was the beginning of a Burn-out and subsequent Depression. I\nactually had a cool life: House, Wife, and two kids. (third was born in\nNovember, birth, I did not get to enjoy) I had no reason to be unhappy.\nNevertheless I…",
  "data/reddit-crypto/r/CryptoCurrency/comments/nylcgn/staking_has_taken_90_of_the_stress_from_my.json": "Knowing my Ethereum is staked and earning interest is amazing, even if I'm doing\nit on an exchange (Coinbase). The fact that I literally can't sell, for the\nnonce at least, means I have no choice but to hodl and not sweat the charts.\nSuch a great feeling.",
  "data/reddit-crypto/r/CryptoCurrency/comments/nynqq7/proposal_allow_users_to_tip_up_to_10_of_moons.json": "This proposal didn't pass the threshold of votes last round, but a few people\nsuggested reintroducing the poll for this round too. Hopefully we meet the\nthreshold this round!\n\nAs of now, there is no purpose for Moons on r/Cryptocurrency\n[https://www.reddit.com/r/Cryptocurrency/] other than paying…",
  "data/reddit-crypto/r/CryptoCurrency/comments/nypc2e/introduced_my_friend_to_crypto_now_he_wont_speak.json": "I knew a guy called John. me and him had been friends for a long time, nearly 10\nyears i think. i got into crypto a while back and i'd obviously talk about it\nwith him, encourage him to start as it is a great hobby to have. John claimed he\nwas too 'busy' to invest, i.e. playing video games all day…",
  "data/reddit-crypto/r/CryptoCurrency/comments/nyrhcl/brave_browsers_privacy_issues_debunked_bat_is.json": "Every time the word Brave or BAT came up, the post form a couple days gets\nmentioned.\n\nAlthough the whole thing has been addressed and debunked, the issues still\nlinger around.\n\nThis is the original…",
  "data/reddit-crypto/r/CryptoCurrency/comments/nyt13u/cuba_has_asked_tourists_not_to_bring_dollars_with.json": "“People who will be coming into the country during this time will have to arrive\nwith a currency other than the dollar,” the senior official said, as quoted by\nGranma, the official newspaper of Cuba’s ruling Communist Party.\n\nTourists will be allowed to use cards for payments, as well as make…",
  "data/reddit-crypto/r/CryptoCurrency/comments/nytqsl/texas_governor_signs_groundbreaking.json": "Texas Governor Greg Abbott has signed into law a game-changing cryptocurrency\nbill, according to his recent tweet:\n\n\"I just signed a law that puts virtual currency under the Texas Uniform\nCommercial Code to be a secured transaction. It defines virtual currency,\nestablishes when a person acquires a…",
  "data/reddit-crypto/r/CryptoCurrency/comments/nyvezo/i_got_another_one_for_you_guys_i_coded_a_tool_to.json": "So you guys may have seen some of my previous posts, where I shared several open\nsourced crypto trading algorithms that I coded. Many of you asked if they have\nbeen backtested and how that would work.\n\nSo I created this quick tool to help you assess the profitablity of your trading\nstrategy of…",
  "data/reddit-crypto/r/CryptoCurrency/comments/nyvl34/whats_the_best_way_to_leave_my_uniswap_and_bsc.json": "I am terminally ill and will probably not be here anymore before the market\nrecovers. This is very sudden and my family do not know about this. Unless a\nmiracle happens, I could be gone this week. My portfolio is mostly coins bought\non Uniswap and PCS so my family won't have a clue on how and when…",
  "data/reddit-crypto/r/CryptoCurrency/comments/nz1hkr/are_random_people_messaging_you_they_want_to_scam.json": "I’ve noticed a massive uptick in the number of unsolicited message with “hi” or\n“hello”. I presently receive about 4 daily. As I am a curious person by nature I\nhave entertained many of the messages. They have one thing in common - they are\nall there to present some sort of too good to be true way…",
  "data/reddit-crypto/r/CryptoCurrency/comments/nz25pe/you_dont_hodl_any_coins_in_your_wallet_you_only.json": " * Your cryptocurrency is not in your wallet, it's on the blockchain\n * a blockchain is the network of nodes (=computers/servers) that\n   * run open-source software to be able to participate in distributed\n     decentralized blockchain/network\n   * must reach agreement=consensus reading the current…",
  "data/reddit-crypto/r/CryptoCurrency/comments/nz62ef/crypto_adoption_in_third_world_countries_shows.json": "Not to belittle countries that aren’t developed, but most people would consider\ncountries like El Salvador not very technologically advanced.\n\nThe fact that countries like El Salvador are adopting crypto is amazing, and it\nshows the benefits when younger people are in power, as opposed to the…",
  "data/reddit-crypto/r/CryptoCurrency/comments/nz9lsh/daily_discussion_june_14_2021_gmt0.json": "Welcome to the Daily Discussion. Please read the disclaimer, guidelines, and\nrules before participating.\n\n--------------------------------------------------------------------------------\n\n\n\n\n\nDISCLAIMER:\n\nThough karma rules still apply, moderation is less stringent on this thread than\non the rest of…",
  "data/reddit-crypto/r/CryptoCurrency/comments/nzac1o/if_youre_going_to_hodl_hodl_through_a_99_loss.json": "Softbank (SFTBF) CEO Masayoshi Son is the 2nd richest man in Japan. He is known\nfor being one of the early investors in Yahoo (bought in 1995) and Alibaba\n(1999) as well as the man behind the Vision Fund. The Vision Fund is the biggest\ntech VC fund in the world and has been an early investor in Uber…",
  "data/reddit-crypto/r/CryptoCurrency/comments/nzcv1a/so_yeah_this_inflation_thing_is_real.json": "Today I sold a 2018 used car to vroom for more than I fucking bought it for\nbrand new off the lot. Granted it had very low mileage for a car 3 years old,\nbut still.\n\nThis feels a lot like the 2008 financial crisis, so get yourself prepared.\nPeople who survive hyperinflation own assets. Buy some shit…",
  "data/reddit-crypto/r/CryptoCurrency/comments/nzd66t/please_ignore_celebrities.json": "For example, when Musk revealed that his company, Tesla, had bought $1.5 billion\nof bitcoin, the crypto’s price surged 17%.\n\nWhen Musk pumped Dogecoin, it popped 50%.\n\nOn the flip side, last week, when Musk announced that Tesla would no longer\naccept bitcoin as payment for its electric vehicles, the…",
  "data/reddit-crypto/r/CryptoCurrency/comments/nzey4o/kim_kardashian_promotting_shitcoin_called_ethmax.json": "I wanted to provide a picture of her story, but unfortunately you cannot post\npictures in this sub. Bassically, Kim Kardashian just promotted a shitcoin\ncalled ETHMAX on her instagram story with the premise of being a good coin\nbecause half of the supply was burned recently. Frankly, I'm surprised…",
  "data/reddit-crypto/r/CryptoCurrency/comments/nzfzml/onecoin_the_4_billion_scam.json": "I’m fascinated by cults/scams/deceitful schemes, and finding out this is insane!\nFor those that don’t know, here’s a video on it [https://youtu.be/HpDtxGS7T1g].\nIn short, a woman got people to pay for investment education and some future\npromise for her coin that would overtake bitcoin... and then…",
  "data/reddit-crypto/r/CryptoCurrency/comments/nzgk3n/jp_morgan_in_a_nutshell.json": "Bitcoin hits $1\n\nJP Morgan warns investors of a bearish market\n\nBitcoin hits $5000\n\nJP Morgan warns investors of a bearish market\n\nBitcoin hits $10000\n\nJP Morgan warns investors of a bearish market\n\nBitcoin hits $30000\n\nJP Morgan warns investors of a bearish market\n\nBitcoin hits $50000\n\nJP Morgan in…",
  "data/reddit-crypto/r/CryptoCurrency/comments/nznlrf/after_5_years_in_crypto_my_best_advice_is_to.json": "Anytime we have 20-50% gains I sell a small portion of profit and reinvest. I’ve\ntried buying and selling weekly/monthly on lows and highs. Overall it’s better\nto find projects you like long term and accumulate. I wait for price targets and\nbuy. I wait for sell targets and sell. It’s easy. Don’t…",
  "data/reddit-crypto/r/CryptoCurrency/comments/nzo47c/unsolicited_tokens_deposited_into_your_wallet.json": "Hey all,\n\nIf you've ever had your wallet dusted before, it can be pretty confusing.\n\"Someone gave me free money!\" you may think. Like everything in life, there's no\nsuch thing as a free lunch.\n\nWhat is a dusting attack?\n\nFrom Gemini...\n[https://www.gemini.com/cryptopedia/crypto-dusting-attack…",
  "data/reddit-crypto/r/CryptoCurrency/comments/nzozpu/daily_breakdown_june_14_2021.json": "Bullish Breakdown:\n\n * Bitcoin price broke above $40,000 again for first time in over two weeks.\n\n * Tanzanian President Samiah Suluhu Hassan has told the country's financial\n   chiefs to prepare for crypto, declaring that the age of crypto and blockchain\n   is dawning - “We have witnessed the…",
  "data/reddit-crypto/r/CryptoCurrency/comments/nzrsfd/back_in_march_and_april_the_media_told_us_all.json": "But I’ll tell you one thing: there are more of the second type of person than\nthe first. You’re probably not going to be the memecoin millionaire. Please\ndon’t be the FOMO buy high, sell low person either.\n\nMaybe the bull market is back and we will see Bitcoin and Eth and Ada at new\nATHs this…",
  "data/reddit-crypto/r/CryptoCurrency/comments/nzsawo/shoutout_to_the_newbies_who_held_since_the_top.json": "Just because Bitcoin broke 40k doesn't mean we still won't dip again or see more\ncrabbing for awhile. But if you look at the fundamentals of the ongoing\nworldwide adoption there is nothing question the Bitcoin and crypto is just\ngetting started. Years from now when crypto is more stable and…",
  "data/reddit-crypto/r/CryptoCurrency/comments/nzwr30/just_wanted_to_say_thanks_to_everyone_here_who.json": "It’s been a rough few years. I got cancer, then COVID, then found a job but now\nI’m being forced to return to South America after 10 years of schooling and\nworking in the US as a health professional because of my visa.\n\nHowever, today I was finally able to acquire a total of 1 ETH through…",
  "data/reddit-crypto/r/CryptoCurrency/comments/nzz1cn/charting_for_newbies.json": "I've been been charting the markets for 10+ years, and I'm thinking of starting\na crypto sub to help newbies with charting. If there's enough interest I will\ncreate the sub.\n\nFor a preview, check my profile comments on crypto.\n\nUp vote if interested.",
  "data/reddit-crypto/r/CryptoCurrency/comments/nzzuhk/shortterm_technical_analysis_on_bitcoin.json": "ABSTRACT\n\nBitcoin will consolidate and sit relatively even at its newfound support lines\n(37.5k USD - 40.5k USD) from a few days to 1.5 weeks at most, before blasting\noff to reclaim the bull-market support band at around 43k USD - 48k USD.\n\nFUNDAMENTAL REASONS\n\nBitcoin is post-Wyckoff distribution,…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o00ojs/daily_discussion_june_15_2021_gmt0.json": "Welcome to the Daily Discussion. Please read the disclaimer, guidelines, and\nrules before participating.\n\n--------------------------------------------------------------------------------\n\n\n\n\n\nDISCLAIMER:\n\nThough karma rules still apply, moderation is less stringent on this thread than\non the rest of…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o02c4j/someone_tried_to_tell_me_to_stop_crypto_because.json": "I was bullshitting with this old guy I know from around the way outside a 7-11\ntoday.\n\nWe were bullshitting about the economy, and I started talking about crypto how\nI've been in it for a few years now, and while I was talking he was shaking his\nhead no. As he was facing the cigarette. He smoked two…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o02w0j/this_is_the_reason_why_crypto_is_very_volatile.json": "IT IS NOT A HATE POST, SINCE NEW TOKENS AND PROJECTS ARE ALWAYS WELCOMED, BUT\nRECENTLY I STARTED HATING THE HYPE TOKENS THAT GRAB ALL THE ATTENTION AND MAKE\nPEOPLE HYPE THEM WITHOUT ANY VALUE.\n\n \n\nThis is a good example:    \n\n \n\nSO I HAVE TWO ISSUES HERE:HTTPS://IMGUR.COM/A/G87CZDT\n\nCoinMarketCap…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o0av5a/if_you_are_in_it_for_long_term_dont_forget_to.json": "There are many ways to stake coins. If you plan to HODL and/or DCA for long term\ndont forget to stake it. If you plan to HODL it for like 5 years at a 5% rate\nyou Will get 1.05x1.05x1.05x1.05x1.05 = 1.27 1.27x100-100 = 27% in those 5\nyears. This is Just with 5% there are coins with 10% which Will…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o0camo/so_one_of_the_biggest_btc_holders_sold_today_now.json": "He sold around 1500 BTC, so basically a fraction of his holdings.\n\nThis address\n[https://bitinfocharts.com/bitcoin/address/1P5ZEDWTKTFGxQjZphgWPQUpe554WKDfHQ?__cf_chl_jschl_tk__=3b24f1d0d662b1aa0c43063429f8b5dfda0bcf6e-1623172300-0…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o0cp3h/for_the_first_time_in_my_life_i_could_purchase.json": "For the time first time ever I used a crypto ATM here in Geneva - although\nhidden in the manor store, four coins were available for purchase with a 1000\nchf limit per person per day. Cash only, you are given a qr code with a public\nkey to send and receive the amount your purchased. The machine was…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o0dcvx/every_year_we_lay_flowers_at_alan_turings_statue.json": "Alan Turing's Birthday is on the 23rd of June. We're going to make it special,\nand I think r/cryptoCurrency [https://www.reddit.com/r/cryptoCurrency/] might\nhave a special place in its heart for the most famous name in (breaking)\nencryption...\n\nEvery year, people from Reddit pledge bunches of…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o0ig0d/we_are_developing_a_play2earn_blockchain_strategy.json": "CityStates: Medieval is the name of the game.\n\nThank you for supporting an actual project in this sea of memecoins :)\n\nOur First Hero Character 'Magnus'\n[https://preview.redd.it/dp4w0fsxbg571.png?width=1200&format=png&auto=webp&s=00222f6e1c36d240a23d41173db5ce967115867c]\n\nWe're happy to announce…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o0jii3/one_big_flaw_in_the_binance_app.json": "Do they seriously not have any indicators as to how much the average cost for\neach coin we’ve spent? I know we can look through our trade history and write it\nall down on a spreadsheet or something, but this looks like something that\ncould’ve been easily implemented by Binance. I’m trying to see my…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o0kuah/sec_announced_it_will_not_tackle_cryptocurrency.json": "•Late Monday afternoon, the U.S. Securities and Exchange Commission (SEC) made\npublic its regulatory agenda for 2021.\n\n•This is an unexpected development for many market watchers because the chairman\nmade repeated public comments, including a broadcast interview last month, where\nhe stated that the…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o0mezb/coinbase_forced_me_to_hold_when_i_was_16.json": "I bought Bitcoin when I was 16 on Coinbase, and almost immediately after they\nchanged their policy so you had to be 18 to use the exchange. They locked my\naccount, so I was forced to hold. I'm sure they would have let me withdraw my\nfunds if I contacted them but I figured I would just come back when…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o0owzx/chainlink_is_one_of_the_safest_crypto_investments.json": "I love Bitcoin and Ethereum as much as the next guy, and consider them\nincredible investments. However, I feel that Chainlink is at least as safe of an\ninvestment as these two, with just as much potential for growth\n\nFor one, Chainlink has incredible real-world applications that aren't going…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o0s125/daily_discussion_june_16_2021_gmt0.json": "Welcome to the Daily Discussion. Please read the disclaimer, guidelines, and\nrules before participating.\n\n--------------------------------------------------------------------------------\n\n\n\n\n\nDISCLAIMER:\n\nThough karma rules still apply, moderation is less stringent on this thread than\non the rest of…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o0vtj9/the_media_warns_you_to_stay_away_from_bitcoin.json": "Like this article from March of 2019.\n\nhttps://www.cnbc.com/2019/04/02/dont-buy-bitcoin-says-wealth-manager-peter-mallouk.html\n\n$5000BTC? Oh no.\nSome expert outlining the fact that there are 1000s of shitcoins as the reason\nit will collapse.\n\nFunny because he's not mentioning that there have been,…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o106mu/roubini_krugman_yellen_oppose_crypto_not_because.json": "Every time there is a discussion about Nouriel Roubini, Paul Krugman, Janet\nYellen, Elizabeth Warren and others, I see terrible ageist/generational\narguments like \"this old man can't understand new technology\", \"this old woman\nstuck in the past\", \"these boomers\" etc.\n\nThese are not only…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o12e4p/remember_buying_the_dip_is_smart_but_there_could.json": "Hi all,\n\nTitle says most of it.\n\nWhenever things start to dip, I see a lot of people around here post the phrase\n\"buy the dip\". They're right, it's a great buying opportunity.\n\nAlways keep in mind though, it's possible for the dip to dip, and you'll want to\nhave some fiat leftover incase that…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o152kv/which_crypto_subreddits_talk_about_which_coins.json": "I was wondering which crypto subreddits talk about which other coins and how\nmuch, so I downloaded the top 1000 posts and all their comments and replies from\nvarious crypto subreddits. In the image I've plotted the number of comments in\nwhich a coin was mentioned as a percentage of all coin mentions…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o15ulv/algorand_is_launching_a_2_million_dollar_bounty.json": "The Algorand Foundation is announcing a bold initiative to enroll blockchain\ndevelopers and the wider crypto community into the Algorand protocol ecosystem.\nThe $2 Million Dollar Algorand Trailblazer Bounty Program will seed two million\ndollars worth of Algo bounties and grants, distributed over the…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o19ai4/daily_breakdown_june_16_2021.json": "*Although I make minor adjustments where I see fit (to make for an easier read),\nthe bullet points featured below are taken from article bodies and headings.\nAdding too many links gets recorded as spam, so I will simply include the\nwebsite and author name per bullet point. If you want any of the…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o1bdkq/general_motors_may_start_accepting_bitcoin_if.json": "General Motors CEO Mary Barra told CNBC on Wednesday that \"nothing is stopping\"\nher company from accepting Bitcoin payments: \"There's nothing that precludes us\nfrom doing that. We'll be driven by our customers.\" Barra claims that GM is\ntrying to \"simplify\" its customers' shopping experience and…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o1c75n/complete_beginners_guide_to_crypto_wallets.json": "A Beginner's Guide to Cryptocurrency Wallets\n\n\n\nA cryptocurrency wallet is basically a software that enables you to track, send\nand receive coins through the blockchain like a bank account. Every wallet has a\npublic key and a private key, but we'll get back to this later. But first...\n\n\n\n\nWHY DO YOU…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o1fuw4/just_a_reminder_usdt_is_incredibly_shady_and.json": "Exposing Tether - Bitcoin's Biggest Secret - YouTube\n[https://www.youtube.com/watch?v=-whuXHSL1Pg]\n\nJust a reminder that Tether most likely doesn't have full backing. Tether's\n\"proof\" of reserves is shakey, and most likely not there. They aren't legally\nrequired to redeem it and among other things.…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o1goxw/blockchain_iot_the_next_big_thing.json": "It’s no easy task to predict what the next big development in crypto will be.\nWe’ve seen a rise of companies trying to get into the crypto space only for\ntheir mission to be far-fetched, off-base, or lacking in necessity. The next big\nmove in crypto is something that is digestible, feasible, and…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o1h95p/mark_cuban_experiences_his_first_rug_pull_titan.json": "This project just launched few days ago and built up a huge TVL of over$2bn in a\nmatter of just days and was being celebrated across defi universe, and got\nlisted by a lot of DEX exchanges in a matter of days.\n\nDeFi social media was abuzz with discussion of this, and the incredible APYs…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o1hqpm/moons_are_available_to_claim.json": "Moons are available to claim in your vault on mobile. It is very very common to\nhit a “technical snag” when claiming them today. There is a limit of the number\nof people that claim them at anyone time. Just be patient and wait if you hit\nthe snag.\n\nRemember, the moon price tends to dip around the…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o1jayd/daily_discussion_june_17_2021_gmt0.json": "Welcome to the Daily Discussion. Please read the disclaimer, guidelines, and\nrules before participating.\n\n--------------------------------------------------------------------------------\n\n\n\n\n\nDISCLAIMER:\n\nThough karma rules still apply, moderation is less stringent on this thread than\non the rest of…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o1mwu8/new_moons_are_ready_round_14.json": "The next distribution of Moons is ready. You can claim your Moons through the\nVault in the Reddit mobile app (iOS/Android).\n\nMoons are r/CryptoCurrency [https://www.reddit.com/r/CryptoCurrency/]'s form of\nCommunity Points [https://reddit.com/community-points], a way for users to be\nrewarded for…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o1o8di/clever_new_ledger_scam_repost_from_rledgerwallet.json": "I'm reposting this from r/ledgerwallet [/r/ledgerwallet] because the OP's\naccount doesn't meet the requirements to post in r/cryptocurrencies\n[/r/cryptocurrencies] and I thought it should get more attention.\n\nVery clever scam for sure considering the amount of new blood in crypto that\ndoesn't do due…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o1pfcf/this_community_is_full_of_kind_people_im.json": "Today I was too happy how I got little extra money from moons shared my life\nstory about working in 3rd world country in daily comments section but you\nbeautiful humans just gave me more moons than I could imagine. I got into crypto\nthinking I would get some profit because life/Job wasn’t doing good…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o1pki6/all_major_banks_in_australia_are_down_right_now.json": "All major banks in Australia got hit with a nation-wide outtage at the exact\nsame time today leaving online banking services unusable.\n\nThis is a major concern for many reasons but before people jump to conclusions\nit’s important to consider how crypto isnt immune from this either.\n\nConsider when…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o1texp/the_basics_of_nano_why_its_such_an_exciting_crypto.json": "https://preview.redd.it/zkblvgdurs571.png?width=602&format=png&auto=webp&s=6d6af898034a2283f61e8a674b631c3bdec39bb5\n\nHey all. I originally wrote this intended as an article for those new to crypto\nand Nano, but figured you might enjoy it here as well. Comments welcome\n\nFirst off, to understand the…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o1tgss/got_too_greedy_just_paid_the_price_for_it.json": "As a lot of us know, TITAN recently crashed from a whopping 60$ to 0.\n\nNow, I got into iron finance pretty recently, entranced by the crazy APR's. I\nlooked into it as it seemed too good to be true but the project seemed\nsustainable, at least for a few more months. I mean iron finance was not a…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o1u8lb/earning_100_in_100_days_with_crypto_day_50.json": "I am half way there! I'm exited to show you the result of the $100 in 100 days\nfrom scratch challenge. Suggestions for other ways of earning money are\nappreciated.\n\nNano:\n\n * Wenano: 0.026 nano ~ $0.15\n * PlayNano: 0.005 nano ~ $0.03\n * Nano Faucet (working again) 0.0012 ~ $0.01\n\nBan's:\n\n * Faucets:…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o1x2ee/shower_thought_some_hodlers_might_already_have.json": "We don't know who these lucky people are. But they might already be out there,\nwalking among us.\n\nPeople who've already stumbled upon just the right crypto and bought just enough\nat just the right time to make life-changing gains somewhere down the line.\n\nPeople who may have thought long and hard…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o1y9ii/1k_invested_into_the_top_ten_cryptos_in_january.json": "EXPERIMENT - Tracking Top 10 Cryptos Of 2021 - Month Five – UP 281%\n[https://preview.redd.it/notvejbrvt571.png?width=666&format=png&auto=webp&s=66a4c098cd2dac13f01c55a0d1d15350db6bc6e9]\n\nYou can see the full blog post with all the tables here\n[https://toptencryptoindexfund.com/tracking-2021-top-10…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o20dyn/algorand_connects_ethereum_polkadot_and_binance.json": "Yieldly, a DeFi platform built atop the Algorand blockchain, today unveiled\nYieldly Bridges a mechanism tying the Algorand ecosystem and major chains,\nincluding Ethereum, Polkadot, and Binance. The move brings Yieldly Bridges to an\nestimated 600,000 Ethereum users\n\nAs denoted by their name,…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o21xot/crypto_isnt_a_get_rich_quick_scheme_if_you_want.json": "Too many people treat this like a casino or like the latest r/wallstreetbets\n[/r/wallstreetbets] stock play. Crypto is a long game. People that bought the\npeak in 2017 had to wait three years to break even, it's not always a quick\nprocess.\n\nDon't get me wrong, if you buy crypto you will make a…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o23clb/bitcoin_has_now_died_a_total_of_420_times.json": "Over the years, there has been a lot of FUD. Many people like to proclaim\nbitcoin and other cryptos dead, when they are very much alive and growing by the\nday.\n\nBitcoin has now been declared dead for the 420th time!\n[https://99bitcoins.com/bitcoin-obituaries/]\n\nWhen will they learn that crypto is…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o25fw4/how_i_accidentally_created_a_100k_market_cap_coin.json": "Sorry if this is not allowed, I will attempt to keep the name out of this as\nmuch as possible to attempt to show this is not a shill but my crazy experience\nover the last few days and how it changed my viewpoint on crypto. If you are\ninterested in making your token, or just how the under belly of…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o26cot/50_crypto_trading_investing_lessons_learned_over.json": "By Chris Dunn, the founder of Skill Incubator\n\n\n\n1 - Everyone’s a genius in a bull market. Real traders can survive and even\nthrive in bear markets or highly volatile markets.\n\n2 - Don’t be a blind bull. ALL markets are cyclical. Don’t be afraid of\npullbacks or market crashes – that’s where you can…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o2blpk/daily_discussion_june_18_2021_gmt0.json": "Welcome to the Daily Discussion. Please read the disclaimer, guidelines, and\nrules before participating.\n\n--------------------------------------------------------------------------------\n\n\n\n\n\nDISCLAIMER:\n\nThough karma rules still apply, moderation is less stringent on this thread than\non the rest of…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o2dgbp/updated_cryptocurrency_explanations_for_beginners.json": "Hi all! For those who didn't see the post yesterday (not a lot did!) I have been\ncompiling a list of terms that are used in crypto with some basic explanations\nof what they are. The purpose of this is to have a way to explain the\nterminology without scaring people off. I've watched many people try…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o2ej0o/we_are_finally_the_number_1_crypto_subreddit_and.json": "Ok, I'd like to start out by stressing that this is not meant to be a shitpost.\n\nr/Bitcoin [/r/Bitcoin] had us beat. We surpassed them by 50-100K I think.\n\nObviously that means moons are the poor mans bitcoin. A place to talk about\ncrypto generates tons of traffic. Being the number 1 in that…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o2ih4i/hands_up_if_you_hate_the_tribalism_culture_in.json": "I want to promote a healthy discussion where everything isn’t 100% the best or\n0% the worst.\n\nSo I’ll kick off with Bitcoin - the common knock on it is that there is “no\nutility” and “environment impact is poor” etc etc.\n\n(I am not a Bitcoin investor FYI) but my rebuttal to that would be:\n\n 1. a…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o2jk1v/i_made_a_list_of_things_you_can_buy_with_bitcoin.json": "I searched the Internet for goods and services you can Buy Bitcoin and Ethereum\nand compiled a non-exhaustive list for you guys.\n\n\nBITCOIN\n\n * Anything in El Salvador\n * Mavericks tickets\n * Lap dances in Vegas at Legends Room\n * A Brazilian butt lift at bodySCULPT\n * Whoppers from BurgerKing NL\n *…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o2jwc1/titan_was_at_60_two_days_ago_now_its_at_000000003.json": "TITAN's crash was really absurd, I personally haven't seen anything this extreme\nyet. It crashed almost 100% in a few hours and now sits at 0.00000005% of its\nATH. That's something. I've seen many people in the past two days ask stuff\nlike: \"sure, it won't recover from that. But what if I just…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o2l7fh/im_tired_of_getting_all_my_crypto_news_from_you.json": "We've all seen the repost bot articles all day. If the president of El Salvador\nsaid something, he apparently said it 69 times.\n\nYet somehow huge developments sometimes go unmentioned (or I don't see them).\n\nI've resolved only to upvote text posts because I don't come here for news. I\ncome here for…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o2mznn/why_you_get_downvoted.json": "OK, obviously I can’t tell you why YOU are getting downvoted, but possibly my\npersonal data will provide general insight.\n\nThere seems to be renewed concern about downvoting, based on recent posts. We\nall know (or think, anyway) that Moon Greed has caused an escalation in\ndownvotes. I feel like…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o2n8ft/tip_practice_losing_your_phone.json": "You have wallets or currency on exchanges. You wrote out some strings of words\nand have your passwords saved somewhere safe, two factor set up everywhere\npossible. Life is good. You're sure that if you lost you phone or if someone\nbroke into your house and stole your computers, no one else could…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o2nvx8/ethereum_max_is_a_scam_using_celebrity_shills.json": "Just over a month ago a random token was created on Ethereum, Ethereum Max. It's\njust an ERC-20 token with HODLing rewards and other forms of perks I couldn't\nfind, because they lack a whitepaper. Nothing about this coin is interesting or\nspecial, maybe even more useless than the average memecoin.…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o2ockd/who_else_held_through_the_crash.json": "I held onto everything. Portfolio was up about about 90% at the peak of the bull\nmarket and only for it to come crashing down and be at a loss.\n\nCurious to see what others are doing or did. I’m trying to buy up more every few\nweeks after pay day.",
  "data/reddit-crypto/r/CryptoCurrency/comments/o2p6ry/friendly_reminder_to_backup_your_2fa.json": "First of all, if you're still using 2FA through SMS, you really should consider\nswitching to an authenticator app such as Google Authenticator or Authy. This is\na significantly safer option than receiving 2FA codes via SMS.\n\nOnce you've done that, save yourself a potentially MASSIVE headache in…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o2qkf2/after_reviewing_almost_every_playtoearn_game_here.json": "CRYPTOBLADES.IO: ROI - 7 DAYS\n\nPros:\n\n * Active development team with daily updates\n * Proprietary NFT Marketplace just released\n * Currently in First place in Binance Most Valuable Builder, the winner of\n   which get a Binance listing or direct Binance Support.\n * Very early, low market cap that…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o2t6lz/i_read_a_post_here_maybe_a_month_ago_that_someone.json": "I won’t put too much info out there, just because I want to be cautious, but I\nwas speaking with a mortgage lender today about what assets I have for a\npre-approval. I told them I hold cryptocurrency and they basically stated that\nthey’ll list it as an asset! They asked for wallet balances and the…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o2y18g/warren_buffett_if_you_dont_find_a_way_to_make.json": "Not really a big fan of Warren Buffett, but I think this quote describes\nperfectly how wealth is accumulated....and it's why everyone is here. No offense\nto the traders here, but the goal isn't to be sitting in front of screens making\nthe right timing decisions...it's to be letting assets you own…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o2zhtt/a_wallet_doesnt_hold_any_coins.json": "YOUR WALLET DOES NOT HOLD ANY COINS\n\nIf you are active in crypto-related subreddits you'll soon notice a\n(understandable) misconception:\n\nNew users tend to think that their coins are stored in their wallet. Therefore,\nthey ask questions like: \"what happens to my coins if I delete my wallet? How\ncan…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o31xzh/banks_are_digging_their_own_graves.json": "Honestly, if there is anything that will speed up adoption of crypto, it’s the\ncrooked banks. We live in Germany, we’re we are now being charged 11 bucks\nmonthly to even own a checking account. Not to mention the constant micro fees\nfor every freaking single action taken. Every year I get a bank…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o32sg6/stating_the_obvious_here_but_this_sub_is_now.json": "I posted a thread about a 2nd SIM Swap attack last night for awareness and to\nwarn people and it got downvoted to oblivion and it now has only 8 karma.\n\nI posted the same exact thread on r/Bitcoin [/r/Bitcoin] like 8 hours ago and\nit’s already on the Top page. It got a lot of comments and they are…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o32sof/psa_stop_using_robinhood_to_buy_cryptocurrency.json": "Please for the love of all that is good stop \"buying\" cryptocurrency with\nRobinhood. Not only are the prices inaccurate you aren't actually buying crypto.\nThey are so known to restrict trading when it benefits them. There are so many\nother options out there that are just as easy to use.\n\nCoinbase…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o33p9z/daily_discussion_june_19_2021_gmt0.json": "Welcome to the Daily Discussion. Please read the disclaimer, guidelines, and\nrules before participating.\n\n--------------------------------------------------------------------------------\n\n\n\n\n\nDISCLAIMER:\n\nThough karma rules still apply, moderation is less stringent on this thread than\non the rest of…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o34emf/my_wild_ride_with_a_shit_coin.json": "This took place over Memorial Day weekend, which feels like months ago, but was\nreally only weeks.\n\nIt all started as a half drunk bet between my boyfriend and I. I could double\nour money in less than 24 hours. I like games and I sure as hell like a good\ngamble. And that’s what shitcoins pretty much…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o357is/the_coin_jar_fallacy_and_why_you_should_get_rid.json": "So everyone probably has a coin jar or box or storage bin or whatever. Who\ndoesn’t like having that little bit of surprise money sitting around? (It’s\nestimated that there is BILLIONS of dollars in change in couches, cars, jars etc\naround the US.)\n\nI work in retail, and having not been able to get a…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o36w14/guys_be_safe_out_there_and_dont_lose_your_money.json": "It's been a really weird journey. I made money and then lost all of it. Please\nbe careful, don't make mistakes like me and put in all your life savings. I was\ndesperate and thought this was my silver lining for a better tomorrow. I did\neverything, study up on projects, charts, online tutorials etc…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o38fxw/90_of_all_hacks_are_due_to_social_engineering_and.json": "Cyber criminals have increasingly turned to social engineering because it is a\nhighly-effective and subtle way to gain credentials and access to troves of\nvaluable assets.\n[https://www.social-engineer.org/social-engineering/social-engineering-infographic/]\n\nHere are some statistics you need to know…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o39kwl/am_i_the_only_one_from_20172018_that_isnt_rich.json": "I was soo certain that I was going to be a millionaire at the very least. I\nnever had soo much money in my portfolio. I knew I would eventually write a post\non reddit about my crypto journey into early retirement. But it seems as I am\ncursed. . .\n\nIt all started in late 2017 for me. About November…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o39n3q/buying_crypto_is_exciting_but_please_keep_the.json": "Decided to make a post because I keep seeing this kind of thing in the sub at\nthe moment.\n\n\"I just bought my first whole ETH\"\n\n\"I just spent $10k on ADA\"\n\n\"Thanks to the dip I nearly have a whole BTC\"\n\netc. etc.\n\nFor your own safety please do not publicly share the value of your portfolio or\nany…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o3d5l9/this_dip_has_been_healthy_for_my_mental_state.json": "This might seem a bit counter intuitive, and I am sure I'm not the only one, but\nI have used this dip as an opportunity to loosen the grip crypto has on my\nattention span.\n\nI've been in crypto for under a year and got swept up in the bull mania. My life\nconsisted of checking my exchanges, wallets,…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o3djpj/the_constant_flipflopping_between_sentiments_of.json": "on thursday it was all \"the bull run is resuming! i have already ordered the\nspecial paint for my lambo which isn't a lambo but a köningsegg\"\n\ntoday it's all \"the prices go down by 99,99999% now. 1/6 of your life will now\nbe spent on getting back 1% of the value. then you get rich in 20…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o3foxr/do_you_want_to_learn_to_code_and_become_a_crypto.json": "Hi all,\n\nAs per the title, I'm planning to learn to write code, with the intention of\nbecoming more involved in the growing world of crypto, and more specifically\nDeFi. I'm taking a guess that there might be other people wanting to do the same\nand so thought I'd propose a kind of mutual motivation…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o3gb1e/if_you_have_trouble_imagining_a_50_loss_in_the.json": "As harsh as it may sound, it’s true. You have to accept the fact that fiat value\nof your portfolio is constantly changing. It can go XY% up or down on a daily\nbasis. Sounds pretty obvious right? Well guess what. Some people are still not\nable to deal with this. That’s why they’re panicking and…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o3gq9d/while_sideways_in_a_bear_market_its_important_to.json": "At times like these - it's important to revisit why this all started, and why\nit's still so vital. Bitcoin was born as a reaction to the 2008 financial crisis\n- looking back in brief, remember that:\n\n * Banks and brokers were giving out cheap, subprime mortgage loans to people\n   they knew would be…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o3h1xm/i_have_a_friend_whos_the_most_financially.json": "Quick story. He's the most responsible person I've ever known.\n\nThe type of person that stays at a job for a very long time. He's every\nemployers dream, he will be there until the company goes out of business. You\ncan always count on him.\n\nHes never taken out loans for a car. He saves until he can…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o3hda8/my_son_messaged_me_yesterday_and_asked_me_if_he.json": "Here is how our conversation went (via text, as I was at work). C is my son, M\nis me:\n\nC: Hey I might buy into SHIBA INU\n\nC: buy like 100m shares and once it hits a penny or whatever. BOOM.\n\nM: lmfao\n\nC: Don't laugh at me\n\nM: If Shiba hit a penny it would be worth all the money currently in…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o3ldey/did_you_know_that_you_can_take_a_free_class_on.json": "There is a free semester of college level, Blockchain/Bitcoin knowledge\navailable in a 15 part, 1 hour YouTube classroom. I won’t post the link, but\nenter “MIT OpenCourseWare Bitcoin” and you’ll find it. I’m on lesson 3 and it’s\n(surprisingly) not too advanced to understand and I’d recommend it for…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o3npqp/how_i_make_money_that_makes_money_while_im_making.json": "Yeah, I know that sounds confusing, but hear me out:\n\nThis is how I make extra money while I am at my job and invest that money into\ncoins that make money.\n\nI work a job that pretty much requires me to just be there. Every once in a\nwhile I have to deal with a customer, but for the most part I’m…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o3o7g3/today_china_pulled_the_plug_and_shut_down_all.json": "Few hours ago, China pulled the plug on all mining in Sichuan province, which as\nper the Cambridge study contributes around 10% to BTC's Global Hashrate. We are\nalready seeing hashrate drop in large pools such as AntPool which has dropped\n39% in the last 24 Hours, Binance Pool (23%), HuobiPool…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o3omld/funny_how_people_writing_how_moons_changed_my.json": "How does that work? I would legit applaud and it would make me emotional to read\nsomeone who genuinely told the story of how moon changed their life and it\nwouldn’t even be hard to tell if what he/she is saying is true, I mean we would\nbe able to see on his acc how many moons he is earned... and…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o3pjyl/for_the_past_few_months_ive_been_earning_100x.json": "It's completely mind blowing. I haven't been very active here for the past\nmonths but I have still managed to do it. I have calculated my earnings from\nmoons from last few months and it's 100x the money I earn from my actual job.\n\nhere is the list of earnings:\n\nMonth. | Earnings from moons |…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o3sl9e/if_you_panic_sell_during_a_dip_youre_only_giving.json": "Recent reporting has shown that despite Bitcoin's dip, those with hundreds of\nthousands of dollars - or even millions of dollars - worth of Bitcoin continue\nto buy and accumulate. However, small-time buyers, those with a few hundred or a\nfew thousand dollars worth, are selling in at a much higher…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o3t367/daily_discussion_june_20_2021_gmt0.json": "Welcome to the Daily Discussion. Please read the disclaimer, guidelines, and\nrules before participating.\n\n--------------------------------------------------------------------------------\n\n\n\n\n\nDISCLAIMER:\n\nThough karma rules still apply, moderation is less stringent on this thread than\non the rest of…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o3u2p1/it_doesnt_matter_if_youve_invested_10_or_10000.json": "No matter how much money you have invested, you’re doing a great job. I know it\ncan make you feel insignificant when you hear how much other people have, don’t\nworry about that. Just because someone has invested more than you that doesn’t\nmake them more important.\n\nYou’re thinking about your future,…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o3wy5t/am_i_the_only_one_buying_the_shit_out_of.json": "I mean let’s be real, someone is selling. And they’re doing it in a way that has\ntaken over 50% of the ATH of most of the crypto market and that is totally cool.\nMy question is this: who is selling and why? Everyone has their endgame. I don’t\ncare if you are HODL, anti-HODL, or anything in between!…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o3wzkl/other_numbers_besides_portfolio_value_that_matter.json": " * Cholesterol level\n * Days since you treated someone unkindly\n * Max pushups\n * Air pressure in your tires\n * Miles since last oil change\n * Months of mortgage / rent in reserve\n * Max situps\n * Heart BPM after running a mile\n * BMI\n * Credit Score\n * Number of Skills Mastered\n * How many tools…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o3xp9j/china_bitcoin_mining_ending_are_awesome_news.json": "Moneybadger don't give a fuck.\n\nThese are fantastic news for Bitcoin:\n\n * Bitcoin mining gets more descentralized.\n\n * Bitcoin mining gets more clean (renewable energy sources).\n\n * Bitcoin miners in other countries become more profitable.\n\n * Bitcoin miners all around the world get cheap mining…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o40ryi/bitcoin_stood_the_test_yesterday_again.json": "Yesterday Bitcoin went 1 hour and 11 minutes without producing a new block. Did\nyou guys notice it/read about it? Some of the veterans in crypto space will\nprobably remember this happen before in the past.\n\nAs we are all aware, China is cracking down on mining farms. The farm in Sichuan\nwas expected…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o40uqs/sentiment_im_hodling_on_to_my_crypto_because_i.json": "Saving accounts? 0.1% interest isn’t going to help at all in building wealth. ❌\n\nReal estate? Housing prices are so expensive millennials can barely afford to\nown their own house, let alone invest in rental property.❌\n\nHigher education? A degree is so common nowadays it doesn’t confer any…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o41hlk/word_of_advice_everyone_in_this_sub_is_looking.json": "This is for newbies.\n\nWhen users here call you \"paper hands\" for selling, what they actually mean is\n\"dont sell until I recover my investment, so I can sell!\"\n\nI'm sure you've seen these comments in a bear market:\n\nFall by 10% - \"This is just a correction! Don't sell!\"\n\nFall by 20% - \"This is the…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o425as/the_biggest_banks_in_the_netherlands_about_to.json": "https://www.abnamro.com/br/en/news/threshold-for-negative-interest-rate-down-to-150-000-euros\n\n> From 1 July 2021, ABN AMRO clients in the Netherlands with a total balance of\n> more than 150,000 euros in their bank accounts will pay 0.5% interest on the\n> amount above this threshold. This will apply…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o428d5/everything_is_good_for_bitcoin_give_me_any.json": "Fees are too high - just shows how much demand there is\n\nFees are super low - it's so cheap and frictionless!\n\nBitcoin is banned? - they're afraid of how powerful it is\n\nMining is bad for environment - bitcoin actually encourages movement to\nrenewable sources\n\nCompany buys bitcoin - institutional…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o42gag/markets_are_moved_by_psychology_not_fundamentals.json": "Coming from the stock to the crypto world, it's not that much of a change: in\nmany aspects it seems that there are psychological and social factors that\nmatter much more than fundamentals.\n\nThe plethora of chart/fibonacci-based predictions is based on market sentiment\nisn't it?\n\nI'd like to hear…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o4373o/unpopular_opinion_people_who_think_consumers_will.json": "Looking at the world people really don't care what goes on in the background.\nOur phones and trainers are made by exploited child workers. We buy en mass from\nunethical companies like Nestle, Shell etc. I know exactly how Amazon treats it\nworkers yet I buy things from there every week.\n\nI hear it…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o442ux/i_hung_in_as_long_as_i_could_but_its_over_im.json": "Don’t get me wrong, the highs are amazing, but the lows have become too much to\nhandle. I can no longer cling to something that is always volatile, makes me\nfeel nervous and insecure, and may ultimately cost me 50% of my savings.\n\nSo I’m leaving.\n\nLeaving my wife to spend more time studying the…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o44sdl/i_do_not_care_about_the_dips.json": "Im $45k into crypto and down about 33% rn, pretty much all my money except my\nretirement obv. I dont give 2 shits. Crypto is the future. We will be laughing\nabout this soon. Im also 24, so I have many years to make the money back, thats\nwhy I just put a ton into crypto haha. HODLing for sure, no way…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o45r4x/explain_to_me_how_this_is_still_a_bull_market.json": "So, I posted about how important it was now that we are going sideways in a bear\nmarket to remember the reasons bitcoin was founded after 2008, and one of the\ninteresting things from the replies to the post was a few People commenting how\nthis wasn't a bear market, was still a bull market.\n\nThe…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o460uy/some_general_thoughts_from_someone_whos_been.json": "Personally, I am to a point where I am treating the dip as an opportunity.\nBillionaires and banks own crypto. They have the financial means to not only\nwait out dips, but to continue to accumulate during them. I am in a position\nwhere I can afford to do the same, so I am.\n\nAlso, everyone's…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o46ruy/fair_warning_ifwhen_things_do_collapse_this_sub.json": "This sub is an echo chamber, be very careful basing your financial decisions\naround it.\n\nIf/when crypto crashes hard this sub will be the choir on the nose of the\ntitanic, still singing its praises until their toes get wet. By then of course\nit will be too late.\n\nThis post isn’t meant to be FUD,…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o47wo4/give_a_man_a_steak_and_hell_eat_for_a_day_teach_a.json": "I cannot believe so many people I know are not staking their coins and if you\nare in for the longrun. Why wouldn't you be staking?!\n\nStaking is a form of passive income. You stake your coin and you shall receive\nsome interest for staking it. Think of it as interest you get for putting your\nmoney in…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o4a0am/you_need_at_least_3_bull_markets_to_get_rich.json": "First one you enter too late. You probably heard about people making crazy\nreturns on the news or from some of your friends.\n\nSecond one you’re still greedy and inexperienced. Probably take profits too\nearly or wait till it’s too late, don’t know how to recognise a top.\n\nThird one you already enter…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o4etsy/im_not_leaving_just_tell_me_youre_still_here_with.json": "I‘m new here and don’t know too much about the inner works of most of the coins\nand projects, that’s why I joined this sub first and foremost: to learn more\nabout why to jump on board and in which projects to invest in.\n\nI bought my first crypto in January after the GME craze and was encouraged to…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o4ey38/over_the_past_48_hours_shorts_have_reduced_their.json": "this is based on the 'BTCUSDSHORTS' ticker. shorts have not sold their position\nthis much since June 30, 2019. they are taking profits. from about $900M to\n$300M.\n\nthis could mean a few things:\n\n 1. the $33000 level is the lowest level whales deem think Bitcoin 'should be'\n    worth, for the next…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o4heb9/moons_empower_the_upvote.json": "But make the downvote exploitable.\n\nAs I write this I can for see downvotes coming, I’m assuming more from bots or\npeople who thing everything is a moon scheme.\n\nIt just kinda sucks, and I know I’m not alone on this, to leave a well thought\nout comment only to be immediately downvoted. Maybe my…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o4iehd/daily_discussion_june_21_2021_gmt0.json": "Welcome to the Daily Discussion. Please read the disclaimer, guidelines, and\nrules before participating.\n\n--------------------------------------------------------------------------------\n\n\n\n\n\nDISCLAIMER:\n\nThough karma rules still apply, moderation is less stringent on this thread than\non the rest of…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o4ih79/a_reminder_dont_use_robinhood.json": "Robinhood fucking sucks. They are doing shady businesses. Doesn’t care about\ntheir customers. Remember GME ? You don’t even buy coins when you buy crypto.\nYou just “ bet “ their prices. Since you didn’t buy coin, you can’t transfer or\nuse them. You don’t help the projects you like, you don’t…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o4isg7/my_journey_to_the_moon_with_alt_coins.json": "I am broke and my friends hate me.\n\nI heard about these 100x alt coins on Telegram.\n\nLet's invest everything I said.\n\nI wanted to make sure my friends came along with me to earn more of their\nrespect.\n\nI told my friends what coins to invest in.\n\nWe made out like bandits and made more money than ever…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o4iv7i/500_btcs_or_wife.json": "After dinner my wife and I were hanging out on our deck just enjoy the weather\nand some wine. At some point while relaxing I picked up my phone and checked my\ncrypto. I am degen. This act ultimately led to...\"i'm curious\"....then she hit\nme with this....\n\nIf someone offered you 500 BTCs and the only…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o4j4v8/if_you_have_your_vault_set_up_you_are_in_the_top.json": "We have about a 1% adoption rate of vaults within r/cryptocurrency\n[/r/cryptocurrency] (~60k vaults). Congratulations if you are reading this and\nyou have your vault set up, you’re ahead of 99% of people. If you are new and\nwant to set up a vault, you need to download the official reddit app on…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o4laa1/what_is_defi.json": "I talk to several friends who have been investing in crypto some of them have\nbeen doing it for years. Imagine my surprise when they asked me \"What's DeFi?\"\nwhen I started to talk about DeFi. So here I am trying to do my best to explain\nDeFi.\n\nTRDL: At the bottom\n\nDeFi: what it is and how it…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o4lss7/bitcoin_predicted_to_reach_135k_200k_12k_420k_69k.json": "All these stories, predictions, hypotheses, technical analyses, gut feelings,\nintuitions, relative concerns, panic posts, click baits, feel good factors,\nfortunately, are all just stories.\n[https://farm2.static.flickr.com/1166/1278823430_4cf163bdd6.jpg?v=0]\n\nBecause someone bought some coin 6 years…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o4p1zy/crypto_is_going_on_sale_for_prime_day_its.json": "If you invested recently, this will probably be the hardest thing to do. To hold\nwhen indicators are slicing your portfolio. If you've done your research and the\ntechnology and logic seem if at all fair to you, you've made the right choice.\nCome along for the ride.",
  "data/reddit-crypto/r/CryptoCurrency/comments/o4pikr/this_sideways_trend_has_proven_that_sometimes.json": "Ever since we hit 30k about a month ago TA people on twitter, reddit etc have\nbeen constantly talking about an imminent breakout either up or down, usually\nup, yet the market does its own thing and crabs sideways, something only a few\npeople expected, most of whom used no TA to figure it…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o4q575/i_found_the_whales_and_you_arent_going_to_like_it.json": "I noticed on Friday night that the massive amounts of BTC shorts where being\nclosed. Initially I thought this was profit taking. Then the % change fell to\n-11%. But BTC wasn't that low. This continued and is continuing with a total of\nnearly 20,000BTC shorts closed ($700 Million)/…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o4qr4l/how_ive_navigated_the_201718_run_up_down_as_a.json": "Hey all, so I thought I'd summarize my experiences from the previous bull run,\nas much for myself as for anyone else, compare it to the state of the space\ntoday and draw some conclusions. Just a few points but maybe it'll be useful for\nsome.\n\n * First \"mistake\", if you could call it that, was…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o4r3xm/crypto_chico_the_youtuber_evidence_why_you_should.json": "Everyone thinks that the popular youtuber Chico Crypto is genuine. He is not\nyour friend guys.\n\nAs it can be clearly seen on the evidence provided: he bought 1282 NFY worth of\n41 ETH and instantly dumped after his first shill video on the next day (he sold\nonly 500 for 53.9 ETH).\n\nThe following link…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o4scvm/many_great_things_are_banned_censored_or.json": "Just to name a few:\n\nGoogle\n\nYoutube\n\nFacebook\n\nWikipedia\n\nReddit\n\nNetflix\n\nInstagram\n\nWhatsapp\n\nSkype\n\nQuora\n\nWinnie the Pooh\n\nAlice in Wonderland\n\nEven though these things are banned in China, they are thriving in the rest of\nthe world.\n\nIf China wants to crackdown Bitcoin mining activities,…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o4sg8a/the_china_fud_to_end_all_fuds_why_todays_chinese.json": "During my almost 4 years in crypto, China and ban have been single two most\nfrequently seen words in a sentence - no competition. With each ban there was\nnaturally less and less effect on the actual market. But it looks like recently\nthe Chinese went all out with their crypto ban hammer on all…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o4spbw/real_money_is_made_in_bear_markets_not_bull.json": "Seems all the FUD (UK Kraken, China mining, etc.) is being released now\ncoinciding with BTC's death cross no doubt to drive the price as low as\npossible. Hope ya'll are ready to scoop up the bottom. That's how you make real\nmoney. The smart people accumulate during a bear market because as we have…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o4uuse/if_you_bought_btc_at_60k_but_arent_buying_at_30k.json": "It doesn't take a genius to figure that out.\n\nIf you're a knowledgeable trader and can time the tops and bottoms with some\ndegree of accuracy then this obviously doesn't apply to you.\n\nIf you're in this for the long haul, the fundamentals haven't changed.\n\n * There will still only ever be 21M BTC…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o4wl85/all_powpos_coins_are_screwed_in_the_long_term.json": "Yes, a rather callous title, in the hopes that people will come in here to tell\nme why I'm wrong. See the bottom of this post for a TL;DR. My thesis is that\ncryptocurrencies relying either on PoW or PoS, cryptocurrencies with inflation,\nfees & staking, cryptocurrencies with block subsidies and…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o4z0n8/dont_underestimate_the_power_of_averaging_down.json": "Let's say you bought $100 worth of MATIC at $2. Then MATIC dropped to $1 and you\nbought $100 worth again.\n\nWhat's your average now?\n\nIf you think it's $1.5, don't worry, you are not alone. I know 2 friends who\nsaid the same thing.\n\nYou have a total of 50 + 100 = 150 MATIC.\n\nWith a total investment…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o4zugh/believe_me_we_dont_want_china_in_crypto.json": "The communist party dictates who can do business and strictly outlines every\nyear the strategy with a 99% majority.\n\nIf you are a foreigner and want to do business you have to have a Chinese\n\"partner\". I worked with a couple of those, I would give a 1/10 rating.\n\nJack Ma went 'missing' when he…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o500cp/a_bear_market_would_be_a_good_thing_for_this_sub.json": "If we go into a big bear market, there is no doubt this sub will be improved\nfrom it. Less hype, more meaningful technical discussion.\n\nAnd I’m sorry to say it, but our precious moons. If they go down in price, the\nmoon farmers will run away. Maybe a bear market wouldn’t be a bad thing for this\nsub…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o508s0/just_a_friendly_reminder_about_coinbase.json": "In the past few days I have noticed several people complain about the fees on\nCoinbase. I just think it needs to be known, there is Coinbase Pro. It's a\nseparate app, but the two apps connect. The fees are a lot lower on Pro, and the\nbest part about it is that Coinbase Pro is free to use!\n\nCB Pro is…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o50itb/tether_has_over_60bn_under_their_management_and.json": "Tether has just 13 listed employees on LinkedIn. Source\n[https://www.linkedin.com/company/tether/]\n\nThere is just over $62bn Tether in existence, meaning Tether theoretically has\n$62bn under their control.…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o5361i/ive_been_shorting_btc_since_60k_and_doge_since.json": "Ooof okay lets get started.\n\nMy current positions and why the market fell\n\nCall it magic, call it astrology, call it fugazi or call it dumb.\n\nBut IMO Technical Analysis has and will always work 100% IF you know exactly\nwhere to look.\n\nSince, February i have been calling the downfall of Bitcoin while…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o539zt/internet_may_be_just_a_passing_fad_as_millions.json": "The internet may be only a passing fad for many users, according to a report.\n\nResearchers found that millions were turning their back on the World Wide Web,\nfrustrated by its limitations and unwilling to pay high access charges.\n\nThey say that email, far from replacing other forms of communication,…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o563qo/heres_an_infographic_i_made_about_algorand_some.json": "I know today is not the best day to share information about a coin, but I see a\nlot of people asking about Algorand and thought it'd be good to introduce them\nto Algo with an infographic.\n\nAlgorand is a PoS crypto, so you can also earn passive income just by…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o568g4/ignore_the_reassurance_posts_no_one_knows_what.json": "Crypto could bounce back next week, go into a 2-3 year bear market until the\nnext Bitcoin halving, or, while somewhat unlikely, yes, it could totally die\noff.\n\nYes, really.\n\nAnything can happen, black swan events can happen.\n\nAnything else is just people reassuring themselves.\n\nYes, you could…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o56iry/enough_with_the_posts_about_how_awesome_it_is.json": "Ya, I get it. Dips are buying opportunities. And bear markets present\npotentially great opportunities. And I know some of you mean it when you say you\nhope it keeps going down. But I don't think a huge continuous slide down is good\nfor crypto long term. I'd rather not have prices drop 50% or 85%…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o598p5/daily_discussion_june_22_2021_gmt0.json": "Welcome to the Daily Discussion. Please read the disclaimer, guidelines, and\nrules before participating.\n\n--------------------------------------------------------------------------------\n\n\n\n\n\nDISCLAIMER:\n\nThough karma rules still apply, moderation is less stringent on this thread than\non the rest of…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o59aq1/a_message_for_the_crypto_could_all_go_to_zero.json": "It is a logical impossibility. You know how to be sure? Ask yourself the\nfollowing question:\n\nWould you buy BTC if it went down to $1 per coin?\n\nThat’s obviously an extreme example but I think I can speak for 99% of us here\nand say that we would undoubtedly load up if BTC was $1.\n\nSo...extrapolate…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o59jid/this_sub_is_adorable.json": "You digest every piece of news to fit exactly what you want to believe.\n\nThe narrative right now is: lol, China bans for the 47th time, buy the dip. A\ncouple weeks ago it was ‘China bans don’t matter’, and before that it was ‘eLoN\niS mAnIpUlAtInG, iGnOrE hIm.’\n\nIf Bitcoin was going up amid the China…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o5a2cy/everyone_needs_to_be_careful.json": "I have seen so many posts about buying the dip, that this dip will be over\ntomorrow, about how this is a fire sale, etc.\n\nJust be careful buying crypto. Nobody knows if this is the bottom or not. Bear\nmarkets usually last longer than a month. And it seems like it goes down, goes\nup, goes down more,…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o5d78y/you_can_be_at_a_loss_holding_crypto_but_if_you.json": "and it's gets worse and worse the longer you hold USD. Thanks to inflation.\n\nIf you held USD in a bank in 1981. Say $1,000,000. You held for 40 years. That's\n$1M is now worth $333,333.\n\nThat's because of buying power.\n\nYour $1 now was worth $3 in 1981. Especially if you HODL it in a bank.\n\nMany…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o5dh3q/yes_crypto_is_down_but_it_bought_me_a_mother.json": "Yes it's a bad time to cash out, but I'm still lightyears ahead. I just bought a\nRockwell Commander 112B and I've still got over 4 times what i initially\ninvested still in crypto. If I'd made the move a month ago, i would've been left\nwith more, but I'm never going to complain about only quadrupling…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o5dnuq/jim_cramer_9_days_ago_be_patient_with_bitcoin_jim.json": "The moral of the story is don’t overreact to FUD and stick to your plan be it\nbullish or bearish. The price of Bitcoin is in the same range it was when he\nmade his first statement. The other moral is don't watch Mad Money for crypto\nadvice.",
  "data/reddit-crypto/r/CryptoCurrency/comments/o5hwqt/calling_dips_and_crashes_sales_and_discounts_is.json": "Every day posts like these seem to get more desperate. When ETH was 2500 it was\na great sale, now 1900 is a discount and great buying opportunity.\n\nStop deluding yourselves. Crypto is falling in value and nobody really knows\nwhen its going to go up again, it could take months, it could take…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o5inle/please_do_your_part_and_dont_engage_with_usdt.json": "It's that simple, the actual market cap of USDT isn't as large of a problem as\nthe sheer volume of trade facilitated through it, the competitors are well over\n50% of it's market cap now (and expanding rapidly as people cotton on to the\nfact it's a Ponzi).\n\nIf given an option to buy in with an alt…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o5j0z0/if_youre_finding_it_difficult_to_hodl_now_you.json": "There's generally a lot of regret around here, especially during bull markets,\nabout not getting in earlier. New investors all want the big gains and they look\nat the vets enviously because the vets bought in when things were \"cheap.\" But\nthe fact is that most people who have done very well in this…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o5j2c3/i_bought_at_the_tippy_top_and_i_have_no_more.json": "Im writing this in case anyone else is in my shoes and needs a little\nmotivation.\nAll my savings trickled into crypto over the past 1-2 months, right before the\nhuge drops, so now im invested with a huge minus, waiting for the bear market to\nend.\nIm full of uncertainty, i bought Tezos, Stellar, and…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o5k237/i_give_credit_to_the_new_investors_who_got_into.json": "It's one thing to say that you believe crypto is the future, it's another to say\nit while looking at a consistently bleeding market. Many new investors have\nbought the ATH and are still holding on through these crazy times.\n\nWhen you're new to a market and you see your new investment down massively,…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o5laac/i_sold_after_holding_for_4_years_my_thoughts_on.json": "I just want to preface this post with the statement that I know absolutely\nnothing about the technical side when it comes to trading, cycles, indicators\nand so forth.\n\nI make trades solely on how I think the market sentiment is going, as well as\nwith a few lessons that I've learnt since the 2018…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o5lacr/hodling_isnt_the_hard_part_its_taking_profits.json": "Does anyone else feel this way are is it me? Granted I don’t have a crazy 7\nfigure amount in. I got in this knowing it was possible I could lose most of my\nmoney. I don’t get scared about everything going red. I get scared of everything\nsky rocketing green and not being able to do the smart thing…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o5lb6v/how_to_do_this_from_a_former_top_buyer.json": "Tons of posts right now from people about to cave to their emotions and make bad\nshort-term decisions. I thought I'd try to share my experience as a former bag\nholder and how I wound up successful. I bought near the top in 2017. BTC was\nboring and \"expensive\" so I had a mix of shitcoins in my…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o5m2l4/my_crypto_rules_for_2021_my_rules_might_not_fit.json": "Your investment strategy guides your portfolio. Similar to purchasing something\nnew like a car, you first look and study the different models and makes to\nidentify which one suits your requirements best. Just like a car, the options\nbefore you are endless when assembling a Cryptocurrency portfolio.…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o5m3ws/the_year_is_2050.json": "You come downstairs for dinner after a hard day of moon farming, karma has been\nhard to come by recently but you managed to get a post to hot with 300k upvotes,\njust enough to earn you 7 moons with new distribution rates.\n\nYou trade the 7 moons for 3 dogecoin, worth about 2000 usd ( inflation…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o5maeu/well_btc_below_30k.json": "So far I've heard it won't drop below 38k, then it won't drop i 35k, most\nrecently it won't drop below 30k.\n\nWagers on 28k? Lol\n\nNot too good with this crystal ball stuff. However, I am still DCA in a few\ncoins so with my luck we will see 10k...\n\nJokes aside though rough few weeks, but guess it's…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o5mfn4/18002738255_us_national_suicide_hotline.json": "If you feel you might be suicidal, and live in the United States, I urge you to\ncall the Suicide Hotline at 800-273-8255 or navigate to\nhttp://www.suicidepreventionlifeline.org/ for a live chat and additional\nresources.\n\nIf it's not an emergency, but you want to know more about mental health,…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o5ngue/people_are_finally_realizing_what_only_invest.json": "“Only invest what you can afford to lose” is said so much that it often gets\nlost in the noise.\n\nBut this is it. This point in time is where people are seeing that their initial\ninvestment is as good as gone, at least for a while.\n\nIf you put money in crypto and you now can’t afford something you…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o5omll/can_we_stop_pretending_the_crash_only_hurts_if.json": "I only invested what I can afford to lose, have a maxed-out 401k in index funds,\nsteady income, and so on. Know what? It still hurts like fuck to be down 50%\nsince April. And I haven’t even lost anything. I’m holding for years to come.\n\nI see this post after post with some version of: “If you’re…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o5rxaa/if_you_werent_checking_the_prices_constantly_you.json": "The title pretty much sums it up. We are currently at 0.0% change in the price\nof BTC over the last 24 hours. If you weren't currently obsessing over your\nportfolio, you wouldn't even know anything happened at all.\n\nAvoid the stress and headaches that come with the ups and downs of crypto.…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o5u4gd/with_all_the_negative_news_lately_i_just_wanted.json": "Hello everyone! I know recently with the dip in prices and FUD it sentiment\naround here can become quite negative pretty fast. But I wanted to take a moment\nto personally thank /u/jonas_h for helping me get copies of his cryptocurrency\neducation books so that I could work to donate them to all of…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o5vker/i_hate_to_be_that_guy_but_dont_get_overly_excited.json": "It literally takes just a few hours of green candles for everyone to go ape shit\nabout how the bull run is resuming and start saying \"I told you so.\"\n\nWe don't have any idea whether the green will continue, or if this is just\nanother false flag.\n\nJune 12 to June 15 we went from 1.4T to 1.7T and…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o5zxmo/what_it_felt_like_buying_the_bottom_in_2018_and.json": "Seeing a bunch of posts brag about buying the dip as a sale or how we're getting\nclose to the bottom, I wanted to share my \"veteran\" experience about how this is\ndefinitely not the bottom of a long bear market. It was pretty similar then -\npeople were making up stories about how the dip after early…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o609v2/hardware_wallet_scam.json": "If you've purchased a hardware wallet and it came with a recovery seed sheet\nbeneath silver scratch off foil, TRANSFER YOUR FUNDS IMMEDIATELY. Someone else\nhas access to your wallet. Not a single hardware wallet has a recovery phrase\npre-installed. Only use the wallet after you have reset it. And…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o60shb/daily_discussion_june_23_2021_gmt0.json": "Welcome to the Daily Discussion. Please read the disclaimer, guidelines, and\nrules before participating.\n\n--------------------------------------------------------------------------------\n\n\n\n\n\nDISCLAIMER:\n\nThough karma rules still apply, moderation is less stringent on this thread than\non the rest of…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o628yv/did_you_know_these_crypto_terms_level_1_level_3.json": "I assume all people are not ace in cryptocurrencies. So, I compiled some of the\nterms related to crypto and their meanings from Level 1 to Level 3. Hopefully,\nthis helps people understand more crypto terminologies :)\n\nAlso, if you have any suggestions do let me know. I am compiling slangs and\nother…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o62yg9/the_full_picture_why_i_believe_the_crypto_bull.json": "I've seen a lot of posts today about whether we have entered a bear market or\nnot, so I wanted to share with you why I'm convinced at least for now that we\nare still in a bull market and this is just a corrective phase before at least\nanother push to a new ATH. I'll break down my argument into 2…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o63io9/technical_analysis_on_our_current_price.json": "ABSTRACT\n\nBitcoin's bull-run is long from over, current fluctuations in the market is just\na result of market manipulation. We had a failure to rally, causing an ever\nharder bear trap, but things should clear up in the following weeks. Bullish!\n\n\n\nA WYCKOFF METHOD\n\nThere is no doubt that Bitcoin had…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o6414n/if_this_is_your_first_major_dip_and_you_still.json": "This is especially for all the newcomers to crypto during this cycle. The FUDs\ndidn't get to you and you stood strong! Many people I know already sold their\ncryptos at lows fearing that it will go much lower, they have adopted the buy\nhigh sell low strategy but that ain't for me!\n\nIt has been really…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o660dg/if_youre_in_crypto_right_now_know_that_youre_a.json": "China bans Bitcoin mining —> Chinese miners need to move —> Miners sell their\nBitcoin reserves to fund the migration in which tens of thousands of machines\nwill need to be transported thru national borders as well as housing\nconsiderations and etc. —> Bitcoin price falls during sell-off and alts…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o6888y/yesterday_most_people_on_here_seemed_sure_we_were.json": "Since the crash in May, the bipolarity of this sub has become even worse than\nbefore. Yesterday, when most coins dipped quite a bit, the sentiment was that\nclearly we were already in a bear market and there was no chance of things going\nup again in the short term.\n\nToday, after most coins recovered…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o6c0wg/aunty_cathie_bought_1_million_shares_of_grayscale.json": "ARK Invests scooped up over 1M shares of Grayscale Bitcoin Trust (OTC:GBTC) in\nTuesday's trading session, equating to a rough valuation of $29.3M. The buy came\nas bitcoin (BTC-USD) plunged below $29K. Bitcoin has since bounced, now trading\na hair over $34K.\n\nThe GBTC purchase was made via the…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o6co6m/one_of_the_largest_bitcoin_whales_4_just_bough.json": "Couple of days ago (15/06/2021), one of the largest Bitcoin whales sold 1500\nBitcoins just before the dip of the past days. (Source:\nhttps://bitinfocharts.com/bitcoin/block/687612/1P5ZEDWTKTFGxQjZphgWPQUpe554WKDfHQ)\n\nNow, they bought back 1062 of these Bitcoins, just probably before the market\ngoes…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o6ew35/bitboy_crypto_ben_armstrong_took_offense_that.json": "SAFU Shark ran a poll to see which crypto channel is the best\n\nThe candidates are: @CryptosR_Us VS. @coinbureau VS. @Bitboy_Crypto VS.\n@AltcoinDailyio\n\nCoinbureau won by 33.5%.\n\nBitBoy finished last.\n\nIt's weird that he would openly be outraged about a public poll.",
  "data/reddit-crypto/r/CryptoCurrency/comments/o6fpe3/maybe_we_just_got_rid_of_china_fud_forever.json": "Okay so China banned mining. It kind of fucked us up, but look at the bright\nside. They can't ban it again, causing another crashes. The miners are moving to\nanother countries (Thank you for decentralizing mining, now a power shortage in\nChina or other bad news won't hurt as bad). That's one source…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o6fshx/break_my_contract_steal_my_money_a_solidity_riddle.json": "I’ve been dabbling around with Solidity and smart contracts over the past couple\nof weeks. And the more I learn, the more fascinating the topic becomes to me. To\nshare my fascination, and to create awareness for smart contract\nvulnerabilities, I decided to create a Solidity riddle. Play along and…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o6gpl7/ethereum_chosen_by_bank_of_israel_to_trial_their.json": "The Bank of Israel is trying out Ethereum’s technology in a recently launched\ninternal digital shekel trial, a spokesman said.\n\nIn May, the central bank issued a report concluding that the digital payment\nsystem could have a positive impact on the economy by simplifying payment\nprocesses while…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o6ms0b/introducing_cryptosnoosa_very_reddit_take_on_nfts.json": "So we heard r/cryptocurrency [/r/cryptocurrency] likes crypto and NFTs… well, we\ngot some good news for y’all.\n\nReddit’s releasing a very limited number of handcrafted, 1-of-1 CryptoSnoo NFT\nassets that are built on Ethereum. CryptoSnoo NFTs present a special and\nsomewhat ridiculous opportunity to…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o6p1xa/the_media_shows_financially_irresponsible_people.json": "The Media Shows financially irresponsible people who borrowed $250,000 for\nCrypto to give an the worst example possible of \"Hodl Culture\" but won't show\nyou someone who didn't put in more than they could afford to lose starting with\n$250, and now has $25k or higher.\n\nBecause it's all a game to…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o6p7fz/daily_discussion_june_24_2021_gmt0.json": "Welcome to the Daily Discussion. Please read the disclaimer, guidelines, and\nrules before participating.\n\n--------------------------------------------------------------------------------\n\n\n\n\n\nDISCLAIMER:\n\nThough karma rules still apply, moderation is less stringent on this thread than\non the rest of…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o6qbvt/one_of_the_biggest_crypto_whales_just_made_a_3044.json": "3044 BTC @ $ 33560, for a cool $100 million!\n\nhttps://bitinfocharts.com/bitcoin/address/1P5ZEDWTKTFGxQjZphgWPQUpe554WKDfHQ-full",
  "data/reddit-crypto/r/CryptoCurrency/comments/o6w1dj/what_are_you_doing_to_buy_this_dip_and_the_crash.json": "I bought in at 60k, and I've been desperately trying to get my cost average down\never since. You name it, I've tried it.\n\nSelling goodwill stuff on eBay, selling textbooks on Amazon, plasma donation,\nthe survey sites on r/beermoney [/r/beermoney], fighting crackheads for the $5\nbill in the…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o6wacj/you_know_whats_a_really_bad_way_to_figure_out_if.json": "tl;dr: after I made a very popular post saying this sub is an awful source for\nadvice yesterday, multiple people asked me for crypto advice via chat because my\npost was popular. That's stupid.\n\nHi, I'm martins by name hkreli. I am a regular poster on here and for some\nreason, sometimes my posts get…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o6wvjx/the_fourth_largest_bitcoin_whale_bought_an.json": "Yesterday, I highlighted a bitcoin whales transaction in this post\n[https://www.reddit.com/r/CryptoCurrency/comments/o6co6m/one_of_the_largest_bitcoin_whales_4_just_bough/],\nwhere the whale bought back 65% of the bitcoin they sold approx before the dip.\n\nToday, I just seen that the whale bought an…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o6yasj/beware_of_ukevin14523_messaging_you_he_is_a.json": "This post is important because I don't want any poor soul to get robbed by this\nguy. This guy u/Kevin14523 [/u/Kevin14523] is an active member of this sub too.\nHe messaged me saying that he has created a bot that doubles your crypto. But\nfor it to happen, you have to first send the crypto to his…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o6yghf/what_is_algorand_a_quick_guide.json": "As Algorand publicly opened its Testnet on April 16th 2019, we decided to write\na short article to introduce you to this foundational blockchain platform from\nTuring Award winner, MIT teacher and zero-knowledge proof creator, Silvio\nMicali.\n\nAlgorand is a Boston-based open-source software company…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o6zfpy/the_first_10_years_of_crypto_feel_like_the_first.json": "For years after the TCP/IP protocalls were finalized in the early 80s, the\ninternet was a wild place full of unrealized potential. You basically had to be\nsome kind of nerd to fire up your home computer and connect to an IP address. It\nwas very user unfriendly and confusing, but the potential for…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o6zwlv/crypto_is_not_a_crime_denying_citizens_the_civil.json": "China has told banks and payments platforms to stop supporting digital currency\ntransactions.\n\nTheir central bank said it had recently summoned several major banks and\npayments companies to call on them to take tougher action over the trading of\ncryptocurrencies.\n\nBanks were told to not provide…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o70g5m/omg_bitcoin_34k_new_bull_market.json": "Bitcoin hitting 34k doesn't mean anything right now. The media will try to say\nthings like, \"Bitcoin SURGES back!\" Or \"Bitcoin tests 29k and PASSES the test!\"\nAnd my personal favorite \"Bitcoin comes ROARING back!\"\n\nWell, guess what? It all means nothing. Bitcoin needs to at least get back to\n50k…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o70yzv/i_work_in_a_bank_they_forbid_us_from_buying.json": "Obviously I won't say the name of the bank but it's one of the biggest in\nEurope.\n\nFew months ago we got a communication saying we were forbidden to buy and trade\ncryptos because they're not regulated and we could easily get involved in\ncriminal activities (lol). By the way, we must have no legal…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o7153e/found_a_reddit_thread_from_2013_where_people.json": "Just thought this was a funny way of looking at how far bitcoin has come. I came\nacross a reddit thread where people where offering ฿4.75 (roughly $161,108 as I\ntype this), for someone to pay in FIAT for a year of Reddit gold for their\naccount.\n\nI tracked the main guys wallet who was buying the…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o721m3/seatoken_just_got_featured_in_the_south_african.json": "https://www.timeslive.co.za/sunday-times-daily/news/2021-06-16-ocean-of-possibilities-sa-shark-study-is-first-to-have-all-crypto-funding/\n\nThey are getting recognition from the real world and plan to further fund 19\nsuch research projects plus documentaries. It is obvious that they want to\nchange…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o72jra/am_i_alone_or_are_there_hodlers_who_just_not_give.json": "I've noticed how disinterested I've been in my crypto holdings for the last\ncouple of weeks because of how the market has been behaving. I feel confident in\nthe coins I own and intend to just hold them, and will check my overall account\nbalance 1x / day...see it's -$200 and close it and move on. But…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o73oz6/spent_the_morning_with_a_suicidal_friend_who.json": "Buddy took out an equity on his home to buy BTC on the run up and was ecstatic\nfor a bit when it hit the ATH. Sold some to later buy DOGE at .71 and ETH at\n$3900. Sold a few days ago.\n\nCalled me up last night distressed as he saw BTC both go up.\n\nI’m kinda not sure how to handle this. Never had a…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o742qf/just_a_quick_reminder_of_why_bitcoin_was_invented.json": " * People used to pay each other in gold and silver. Difficult to transport.\n   Difficult to divide.\n * Paper money was invented. A claim to gold in a bank vault. Easier to\n   transport and divide.\n * Banks gave out more paper money than they had gold in the vault. They ran\n   “fractional reserves”.…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o78w92/after_careful_skimming_of_hundreds_of_comments_i.json": "I have done the unthinkable, and am now employing a new strategy that looks past\nall technical and fundamental analysis, DYOR, use cases and market analysis to\nexclusively tunnel vision on my feels and normal price fluctuations.\n\nI have carefully skimmed hundreds or possibly tens of reddit comments…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o7c5hw/daily_discussion_june_25_2021_gmt0.json": "Welcome to the Daily Discussion. Please read the disclaimer, guidelines, and\nrules before participating.\n\n--------------------------------------------------------------------------------\n\n\n\n\n\nDISCLAIMER:\n\nThough karma rules still apply, moderation is less stringent on this thread than\non the rest of…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o7d56i/the_eth_chart_is_a_better_indicator_of_where_we.json": "Like many of you from the 2017/2018 era of bag holders, I've been watching BTC\nfor a \"blow off top,\" in other words, a clear indicator when the bubble has\nburst and the cycle is done.\n\nWe have all the other signs of a bubble; crazy highs on alt-coins, BTC dominance\ndown, huge drops on BTC and ETH,…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o7e3i2/bitcoin_has_finally_closed_three_consecutive.json": "I think this was brought up by a YouTube video that I was watching yesterday.\nOnly a few hours later, the observation was broken.\n\nHow is everyone? What’s the current sentiment around Bitcoin and the broader\nmarket?",
  "data/reddit-crypto/r/CryptoCurrency/comments/o7e9qg/now_is_the_time_to_formulate_a_profit_taking.json": "Anyone who has been in crypto during the past two bull markets wil tell you that\none of the biggest mistakes you can make is not formulating a profit taking\nstrategy ahead of time.\n\nWhen markets go parabolic you can't make rational decisions, the hype will\ndistort your views of what's possible. You…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o7ep7c/best_day_for_cryptowe_beat_musk.json": "Elon tweeted a stupid tweet\n\nHow many Bitcoin maxis does it take to screw in a lightbulb?\n\nAnd guess what ....Bitcoin didnot care....guess we are over what Musk says... he\nis becoming non essential and non existent when it comes to crypto\n\nHe had the opportunity to change the world and now he is one…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o7f68z/if_you_are_desperate_for_money_or_need_a_quick.json": "Crypto is volatile, in fact basically like all stocks are. Of corse that isn't\nentirely true, but if you are desperate its all volatile.\n\nCrypto is not your quick fix or your get rich quick scheme. If you feel\ndesperate to pay your bills, put food on the table, or looking for a savior\nplease look…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o7fd3t/a_salvadoran_update_on_btc.json": "Salvadoran here!!\n\nPresident Bukele just announced that he is implementing a national wallet in\nSeptember called “chivo” (means cool in Salvadoran slang)\n\nThe government is giving 30 usd to anyone that creates an account, by law you\nwill have to accept BTC as a company... but the wallet let’s you…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o7gra0/breaking_el_salvador_at_6_million_crypto_uses.json": "President is pledging to give $30 in Bitcoin to every El Salvadoran.\n\nWith a population of 6.4 million, that’s over $150 million in\n\nThis is huge for Bitcoin.\n\nThis is the biggest crypto mass adoption ever in the history\n\nPresident of el Salvador has already pledged to mine BitCoin through…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o7jlqv/blockchain_titan.json": "Like many others, I witnessed the birth of the internet and watched it grow like\nwildfire because it was a free space for the exchange of ideas & commerce. Now\nit’s become a space where titans jockey tries to control speech and commerce.\n\nIs Blockchain becoming the next theater for the clash of…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o7k0b4/i_made_a_post_about_the_scam_opishub_yesterday.json": "Yesterday I made a post\n[https://old.reddit.com/r/CryptoCurrency/comments/o6zy0e/scam_warning_if_you_see_posts_praising_opishub_on/]\nabout OpisHub. It's still up, but the main point was that they approached me to\nshill their shitcoin for money and that they are really shady, it has many red\nflags…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o7m9fr/my_opinion_on_why_the_whole_el_salvador_thing_is.json": "So, after the new El Salvador announcement to drop 30$ do every adult on their\n(governement sanctioned) wallet, I started to wonder what the ulterior motive\nis. Yeah some may say \"freedom from inflation, from USD, from the US\nmanipulating the price\" yadda yadda. That might all be true. But…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o7riov/shorts_on_bitcoin_just_increased_1000_to_24178.json": "According to datamish.com, you can visually see the price impact as shorts are\npiled on, making up nearly 35% of total positions, and you can see how the price\nstabilizes when these positions stop increasing.\n\nI don't know if there's some sort of huge expiry happening near the end of the\nmonth…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o7s39n/creating_a_token_is_too_easy.json": "I knew absolutely nothing about how to create a token yesterday at 5 PM. By 6 PM\nI had created my own token and added liquidity on pancakeswap. I spent $4 to do\nthis.\n\nI work in manufacturing. I am not an exceptionally tech savvy person. It's just\nthat easy.\n\nThis is a huge problem. The market is…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o7spnx/proposal_moon_week.json": "TL;DR: All governance polls will be posted and promoted in the week between the\nsnapshot and distribution.\n\nI'd like to address a few main points with this idea:\n\n * Voter participation is rarely enough to meet the decision threshold\n * There is confusion about how and when to propose or vote on…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o7tf72/hold_on_to_your_butts.json": "We're nearly half way or a bit more through the test phase of the Wyckoff\nevents. It's looking like it can go either way still but we keep hitting good\nresistance at 31-32k. Keep your heads up and hold on to them butts. We might\njust get out of this storm alive and well. To all the people who have…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o7tii8/icp_is_the_worst_investment_of_my_life_where_does.json": "I invested in ICP when it got listed on Coinbase as it sounded like it had\npromise. I’m now over 90% down on my investment with zero signs of that getting\nany better. Does anyone think this will change anytime soon or far into the\nfuture?",
  "data/reddit-crypto/r/CryptoCurrency/comments/o7uq2i/new_coinbase_earn_availabe_3_in_bond_token.json": "Hey guys, this is my 4th post on \"how to earn free crypto\"\n\nAs most of you already know Coinbase has an Earn activity for various crypto on\ntheir platform\n\nThey just have released a new Earn activity for BOND, a DeFi Token from\nBarnBridge [https://coinmarketcap.com/currencies/barnbridge/].\n\nSee…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o7zm61/things_about_crypto_i_learned_the_hard_way.json": "Are you new to Crypto? I hope you're doing research in other places than\nReddit,  although this sub can be very helpful. Here are some suggestions that\nmight help you as you invest in projects.  \n\n 1.  Spend only what you can afford to lose, i.e., \"fun\" money. I know,  it's\n     real tempting to use…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o7znep/i_finally_listened_to_my_gut_and_cashed_out.json": "Last night I cashed out almost 80% of my portfolio to buy a Mitsubishi evo 4 to\nflip and start my car import business and it feels amazing. I was gonna hold out\nuntil today to cash out to try to make a couple extra hundred but decided there\nwas no need to be greedy and by doing so I saved myself…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o7zo3z/daily_discussion_june_26_2021_gmt0.json": "Welcome to the Daily Discussion. Please read the disclaimer, guidelines, and\nrules before participating.\n\n--------------------------------------------------------------------------------\n\n\n\n\n\nDISCLAIMER:\n\nThough karma rules still apply, moderation is less stringent on this thread than\non the rest of…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o7zwr0/day_1_of_buying_crypto_instead_of_cigarettes_who.json": "So I got to thinking about how much I really spend on cigarettes and how much\nbetter that money would be spent on crypto. I'm tired of feeling shitty all the\ntime. If I'm going to be rich someday, I want to be healthy enough to enjoy it.\nHell, even if I lose some money in the process, that's still…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o80fjt/bitcoin_cannot_function_as_a_global_currency_el.json": "This is my understanding of the situation. Please correct me if I'm wrong, but\nthe math seems pretty clear. I know I'm not the first to state this, but I feel\nlike this issue has largely been hand waved away with the store of value\nnarrative, and with El Salvador attempting to use it as a currency…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o80yxs/binance_banned_in_ontario.json": "https://www.binance.com/en/support/announcement/ba03469c86f34546bd25faf414730733#\n\n> Fellow Binancians,\n> \n> As part of our continuing compliance efforts, Binance has updated its Terms of\n> Use to provide that Ontario (Canada) has become a restricted jurisdiction,\n> effective 2021-06-26 at 3:59:59…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o81pcp/would_you_invest_in_bitcoin_if_it_crashed_to_100.json": "Let's say tomorrow you wake up and decide to check the crypto charts. You have\nsleep still in your eyes and your vision is blurred, but you notice something\nodd. You rub your eyes and OH FUCK Bitcoin is down to $1! The news coming out is\nobviously terrible. Everyone is saying to not touch Bitcoin…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o82tio/please_stop_saying_dyor_if_youre_not_going_to.json": "Trying to research crypto is hard, I've been involved in crypto on and off since\n2017 and I still don't know where to find trustworthy information. Googling\ncrypto brings a heaping pile of FUD, rando price predictions, and mommy-blog\nstyle opinion pieces that don't do anything to educate you.…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o86e2h/internet_computer_icp_just_set_another_new_atl_of.json": "I honestly cannot think of a coin that was anywhere near this high of market cap\nand plummeted so much. Yes, one can argue ICP launched just as a bear market\nstarted, but hardly any coins in the top 100 by market cap fell anywhere near\nthis amount. ICP is a true outlier.",
  "data/reddit-crypto/r/CryptoCurrency/comments/o86q8s/day_1_of_buying_a_bottle_of_whiskey_instead_of.json": "Just want to say I love you all, it's a great community here 👍, one of the\nbest. And if don't agree then I'll knock you out! I'll take the shirt off any\nmans back!! Bastards!\n\nBuy the dip? I am the dip! Dip inside the eye of your mind Don't you know you\nmight find a better place to…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o88toz/6_months_ago_i_came_out_to_my_family.json": "In a spur of the moment thing, I told my family that I own a bit of Crypto\nduring a family Christmas get together. They looked at me like I had just told\nthem I shoot up heroin under a bridge. My far relative took my dad to the side\nand told him to find a way to get me out of it before it's too…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o8a1sk/mass_influx_of_bitcoin_miners_are_coming_to_texas.json": "The Chinese government's call to crack down on bitcoin mining and trading has\ntriggered a phenomenon known as \"mining migration\" in the encryption circle.\n\nTexas in the United States is an ideal destination for miners, thanks to its\nabundant solar and wind resources, an unregulated market, and a…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o8ar9s/crypto_positivity_this_week_in_one_minute.json": " * Tech is improving – Eth London hard fork burns coins and later, faster speeds\n   and cheaper transaction fees are in the pipeline\n * China shutdown - Chinese miners get shut down and sell off coins, reducing\n   control of the Chinese and giving bargain discounts\n * Tesla manipulation - Elon said…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o8bky8/im_all_in_on_crypto_cant_wait_to_accumulate_in.json": "I get paid less than two dollars the hour where I work, and I work 13 hours a\nday, inhuman conditions. I live in Costa Rica and In here we still have pandemic\nrestrictions, I make a weekly 77 dollars, and since I live with my parents\n(20yo) and I’m still in virtual uni I have no expenses so every…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o8cy99/day_1_of_buying_mdma_instead_of_ada.json": "Spent the last 6 hours listening to Moby and Florian Picasso and stroking the\nwalls. Just wanna say I love you guys- no I mean really LOVE you guys! Let me\njust look into your eyes for a bit.\n\nBuy the DIP? Roll with the dip. The dip is us. We are the dip. We are together!\n\nPeace & Love!",
  "data/reddit-crypto/r/CryptoCurrency/comments/o8gmty/so_whats_the_coins_you_have_youre_eyes_on_during.json": "Honestly there are so many I’m looking at and I’m not quite sure which to do.\nMainly I’m looking at ETH, VET, MATIC, and a couple others. I’m just waiting for\nsome bigger dips then I want to buy some more. What coins are you really looking\nat and why?",
  "data/reddit-crypto/r/CryptoCurrency/comments/o8izdu/historic_amount_of_stablecoins_have_been_moved.json": "In the last 24 hours, a massive amount of USDT and USDC have been moved from\nwallets onto centralised exchanges.\n\nRecord amount of USDT moved onto exchanges\n[https://preview.redd.it/yj1s2zhlbo771.jpg?width=1800&format=pjpg&auto=webp&s=5c6f3ce2e7a6d90445b30f275f560d5969e5a2e9]\n\nCurrently over $2bn…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o8jjh8/its_amazing_how_all_the_fanboys_disappear_when.json": "We’ve been here before. This stuff WILL CRASH. Then it will rise. Then it will\ndie… only to be reborn. We will see this cycle repeat until we find a stable\nprice… which may take YEARS.\n\nYou can try to time the market but you’ll likely lose 9/10 times. If it works\nout for you, fantastic. But have…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o8jv6q/how_many_different_cryptos_do_you_guys_own_i.json": "Was kinda curious to see how you guys have your portfolio structured. I'm pretty\nold school and like to stick to mainly blue chips.\n\nThough I own 13, over 90% of my portfolio is in BTC and ETH. I'm not saying this\nis optimal, just how comfortable I am after doing my own DD. I'm mainly in…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o8kl2f/why_are_we_allowing_governments_an_opinion_in.json": "You read about it everyday. This region banned this exchange. This region made\nthis illegal. And so on.\n\nWhere the fuck is the cypherpunk leadership to stop this? Here's wht I am\nwaiting for:\n\n 1. A DAO starts registering citizenship on a random piece of space debris.\n    Anyone holding crypto gets…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o8lwlh/to_the_newbies_who_dont_understand_all_the.json": "FOMO - fear of missing out: when a coin goes up and you are afraid you will miss\nthe bull run so you buy at a high price\n\nDCA - dollar cost averaging: investing a certain amount of money in certain\ncoins every month, for example every month $200 ETH, $100 BTC, $50 ADA\n\nHODL - started as a typo of a…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o8m27j/daily_discussion_june_27_2021_gmt0.json": "Welcome to the Daily Discussion. Please read the disclaimer, guidelines, and\nrules before participating.\n\n--------------------------------------------------------------------------------\n\n\n\n\n\nDISCLAIMER:\n\nThough karma rules still apply, moderation is less stringent on this thread than\non the rest of…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o8nsqt/so_its_about_that_time_of_week_where_we_get_a_fud.json": "So it's about that time of week where we get a FUD bomb dropped on us! What's it\ngonna be this week?\n\nChina, SEC, aliens, China 2.0, Bitcoin volcanoes have ran out of lava, The\npresident of el Salvador got aids from his bitcoin wallet.\n\nI'm all ears to what this week's media induced FUD bomb might…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o8ol8v/most_people_wished_to_buy_btc_for_30k_when_it_was.json": "Remember when the bull was strong and unstoppable, most people around me wanted\nto buy BTC. Most of them said and hoped that if BTC was still 30K I would have\nbought a shit ton of it.\n\nThose mates of mine now still do not buy and are hoping for it to dip to 10k or\nless. I told them that it is very…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o8pmwi/i_treat_my_cryptos_like_i_treat_my_wife.json": "I hold onto that shit.\n\nIt's always there for me when I need it. I just open my wallet and bam! Always\nthere. No shady business either. I don't see anyone sneaking in trying to get a\npiece of that.\n\nThe exact amount is there. My cryptos are loyal as FK. So I treat them like I\ntreat my wife.\n\n * I…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o8s0al/unpopular_opinion_if_youre_fiat_broke_and.json": "Here's the thing: the world operates on fiat right now. You cannot put food on\nthe table using crypto as currency (yet, in 99% of places). I'm willing to bet\nmost people on here saying they are invested and \"fiat broke\" aren't actually in\nthat situation and just use that terminology to say they…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o8uq1n/i_will_never_recommend_any_family_member_or.json": " * I clearly highlighted to them the risks and rewards of investing and the best\n   investment is to invest in the tech of the coin by doing the right research\n   first, that doesn't matter though since all they are seeing is the price NOW\n   and all coins are down now.\n * I explicitly told them to…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o8wy23/ethereum_transaction_fees_are_currently_3_gweis.json": "Ethereum transaction fees are currently 3 gweis ~($0.12)! Which is already\ncheaper than some blockchains without smart contracts. Ethereum is scaling while\nmaintaining decentralized security!\n\nSource: https://www.gasnow.org/",
  "data/reddit-crypto/r/CryptoCurrency/comments/o8y8xu/its_amazing_that_my_wife_isnt_more_suspicious.json": "To be fair, she is probably just relieved from not having to hear me talk about\nit. Basically breaking even at the moment, so it's not the end of the world.\nPlus I never invested any of her money or more than I could afford. All that\ngood stuff. But for a good 5 months or so I was giving her pretty…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o8y9nt/the_fee_terror_is_real.json": "Withdrawal fees, trade fees, network fees, air fees. If it's a token, it's even\nworse, requiring two withdrawals (ERC20 token + Ether, or the equivalent of the\nused network).\n\nThe amount of steps required to use layer 2 solutions or things like TLM and WAX\nare just so damn high and everyone along…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o8ywgl/moons_are_supposed_to_incentivise_contribution.json": "TLDR: be more positive and encouraging. More importantly listen or allow others\nto have an opinion without shooting them down\n\nPlease return things to how it used to be. Currently people downvote, knowing\nthis affects another persons karma value, often to try and force an opinion\nchange.\n\nPeople…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o90a3f/its_so_funny_how_unpopular_crypto_is.json": "I love strolling through reddit and reading all the crazy shit people make up\nabout crypto as a whole they have zero clue on, all the same bullshit FUD you\nhear day in day out, we're so far from main stream it's crazy.\n\nIf you ever think you're late, you really aren't, it's amazing how many…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o90zio/binance_uk_fud_lets_end_this_here.json": "There are lots of posts, threads and comments about Binance.com getting banned\nin the UK and many are worried that all your crypto assets will get lost/stolen,\nafter seeing mainstream media post hundreds of articles about the ban.\n\nLet’s clear this up.\n\nBinance.com is not going anywhere for UK…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o9159h/a_call_to_action_for_teachers_and_parents_for.json": "I think it's criminal that students don't get financial literacy in\nschool---economics, sure--but actual financial literacy---not really much at\nall. I could have done so much with my life if I was given the basic run down\nbefore going into the adult world.\n\nSo, I created a down-to earth, brass tax…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o92627/if_you_have_more_than_68k_moons_you_are_in_the.json": "The holders tab on the Etherscan\n[https://rinkeby.etherscan.io/token/0xdf82c9014f127243ce1305dfe54151647d74b27a#balances]\npage for Moons is working again. I fucking love spreadsheets and Moons so what\ndid I do?\n\n\nI FUCKING MADE A SPREADSHEET DIDN'T I.\n\n\n\n * If you have more than 6.8k Moons you're in…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o94bmo/whackd_getting_burned.json": "Hello, apparently every whackd transaction has a certain risk of getting burned.\nI can't really understand the concept of it. Can someone pls ELI5 how/when this\ngot triggered and what does it mean for this crypto currency?",
  "data/reddit-crypto/r/CryptoCurrency/comments/o96qs1/got_in_on_crypto_at_all_time_high.json": "So I got in on crypto about 5 days before the May crash and I’m so glad I did.\nLet me tell you why.\n\nMy long time friend finally convinced me to get into it. So I threw a couple\nhundred bucks into a few coins. Then the crash hit, at first I was terrified,\nbut my friend thankfully was install there…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o97odf/what_the_hell_just_happened.json": "What the hell happened in the last hour or so? Those are some of the biggest\ngreen dildos I've ever seen since I went to that Shrek-themed swingers party\nback in '03. Y'all seeing those BTC and ETH charts? Did some major news just\ndrop somewhere that I'm not seeing? mArKET maNIpuLatiOn??",
  "data/reddit-crypto/r/CryptoCurrency/comments/o98nlb/day_3_of_choosing_to_buy_crypto_instead_of.json": "So today wasn't completely miserable. But that was probably because I spent a\ngood portion of it unconscious. I took about 3 naps just to try to get the day\nover quicker. I guess it's kinda cheating, but I did manage to put off the first\ncigarette for a long time using the patented naps technique,…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o98q33/daily_discussion_june_28_2021_gmt0.json": "Welcome to the Daily Discussion. Please read the disclaimer, guidelines, and\nrules before participating.\n\n--------------------------------------------------------------------------------\n\n\n\n\n\nDISCLAIMER:\n\nThough karma rules still apply, moderation is less stringent on this thread than\non the rest of…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o99ki2/my_dad_hates_crypto_and_pretends_to_know_what_it.json": "Very sorry for the repost. This post got removed on my new account because it’s\nnot 60 days old.\n\nLast year I got into crypto and I decided to not tell anyone except my mom about\nit because I know she’s open and interested.\n\nToday was the first day I told my dad about Crypto, I did not tell him to…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o9alwx/always_remember_robinhood_prevented_stocks_and.json": "Everyone should remember what RobinHood has done. They have restricted trading\nmany times before, and it will happen again. Do not put your money into a scam\necosystem which doesn't allow you to sell when it benefits them financially.\n\nBe in control of your own crypto. Coinbase, Kraken and Binance…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o9fd7l/governments_planning_global_coordinated.json": "THE WORLDS’ WEALTHIEST NATIONS ARE AIMING FOR CRYPTOS, RESTRICTING, AMONGST\nOTHERS, THE FOLLOWING:\n\n * Peer-to-Peer Transactions;\n * Stablecoins;\n * Private wallets (cold storage, phone and desktop apps);\n * Privacy (privacy coins, mixers, Decentralized exchanges, use of TOR and I2P);\n * Former ICOs…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o9fjzx/how_does_the_blockchain_work_blockchain.json": "TL;DR : EVERYTHING YOU NEED TO KNOW ABOUT BLOCKCHAIN,HOW THE BLOCKCHAIN SYSTEM\nWORKS,THE SECURITY OF THE NETWORK,BLOCKCHAIN LEDGER,BITCOIN MINING IN SIMPLE\nWORDS\n\nBlockchain technology is probably the best invention since the internet itself.\nIt allows value exchange without the need for trust or a…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o9g60w/if_youre_young_and_thinking_of_investing_in.json": "I'm sure this will sound pedantic but with all the excitement lately, I'm seeing\na lot of posts from people in their 20's and even teens talking about investing\nlarge sums in crypto. Please keep in mind that this is a high risk.\n\nThat's not to say you shouldn't take some of your hard-earned money,…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o9g6be/the_bbc_and_crypto_fud.json": "Although it's not perfect, the BBC is generally more reliable than most big\nmedia outlets, but over the past few years I've been sorely disappointed in its\ncoverage of crypto (focused 99% on BTC). Today was a pretty good example.\n\nThey ran this story [https://www.bbc.com/news/business-57632831] with…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o9lj9j/my_friends_sold_at_a_loss_and_are_now_blaming_me.json": "I told my friends and relatives about crypto back in March. And they bought shit\ntonnes of it without any research. They would, again and again, ask for my\nassurance for their money, as if I was the one responsible for their profits.\nFast forward to June and almost all their coins are in deep red.…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o9ouel/bitcoins_whitepaper_is_now_being_censored_across.json": "Bitcoins whitepaper is now being censored across the internet by Craig Wright,\nwho claims to be Satoshi Nakamoto. Now the owner of Bitcoin.org is forced to pay\nat least $48,600 and remove the whitepaper from the website. Wright is nowhere\nin the community accepted as being the person behind Satoshi,…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o9pqog/i_am_leaving.json": "The reason why I am leaving is that I am currently a student that is studying\nand have been too distracted about crypto and it looks like I would need to stop\ncaring about my investments. Therefore, I think It would be wise for me to put\nin as much money as possible before I leave for real. I have…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o9q0jo/the_first_rule_of_crypto_should_be_you_do_not.json": "At least not with relatives, acquaintances, co-workers, significant others etc.\nI think it's better to keep all of the Crypto talk on the internet communities\ndesigned to discuss it. I say this because of the way people are, if it's\nrelatives you know they'll try interventions every time the price…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o9qasc/i_configured_a_crypto_trading_bot_to_buy_crypto.json": "I mainly built this for fun, and as a coding challenge, as I'm not sure how\nviable it would be to base my investing decisions based on the Reddit hive-mind.\nBut having said that, I will test the tool out and see what it can do - who\nknows, maybe among all the shills and moon-farmers is where insight…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o9t41f/i_officially_only_look_at_my_wallets_on_mondays.json": "It’s been a rough start to the summer, family. I, as most Americans now, have a\nphone in my hand at all times. That means constantly staring at my wallet,\nwaiting for that first million.\n\nMy family was frustrated by my frustration. I knew I needed something to change\nso I started with something…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o9v4xj/eth_staking_rewards_incoming.json": "Whale Alert!!! 🚨🐋🚨🐳🚨🐋🚨\n\nI just got my first .01 ETH from staking on coinbase and I'm friggin pumped!\nLFG!!!! All I need is for ETH to hit 10k and that reward will be worth over $100\n😂\n\nIn all seriousness, though, I am super thankful for all staking and defi returns\nthat are made possible…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o9wkuj/will_you_get_detected_at_the_airport_smuggling_a.json": "Let's say I don't trust customs, I want to make sure my cold storage travels\nwith me. I don't want it to be accessible under any circumstance of me being\ncompromised.\n\nA Ledger X is relatively small and would fit quiet nicely.\n\nWill the metal detector be able to recognize that piece of hardware in…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o9wmw4/daily_discussion_june_29_2021_gmt0.json": "Welcome to the Daily Discussion. Please read the disclaimer, guidelines, and\nrules before participating.\n\n--------------------------------------------------------------------------------\n\n\n\n\n\nDISCLAIMER:\n\nThough karma rules still apply, moderation is less stringent on this thread than\non the rest of…",
  "data/reddit-crypto/r/CryptoCurrency/comments/o9xt1w/the_entire_movement_around_crypto_is_to_move_away.json": "So I refuse to buy GOVERNMENT backed “digital yuan” or “digital dollar” or ANY\nlarge corporation sponsored crypto like HBAR and anything else that decides to\npass in front of me. I suggest you do the same or we’re spinning our wheels here\nguys",
  "data/reddit-crypto/r/CryptoCurrency/comments/o9ydsi/please_dont_take_a_loan_to_buy_crypto.json": "I believe we will continue with the bull run soon enough (I may be wrong).\nDuring bull runs a lot of newcomers tend to join in the crypto space because of\nall the hype and FOMO like there is no tomorrow.\n\nInstances like this will show people at their greediest and often we let this\nemotion take the…",
  "data/reddit-crypto/r/CryptoCurrency/comments/oa0gte/every_new_piece_of_tech_is_heavily_attacked_at.json": "Just like cryptocurrency, every new tech in history was attacked at first by\npeople that made money from the old tech.\n\nElectricity was attacked and labelled dangerous no difference if it was DC or\nAC.\n\n\n\nOld anti electricity…",
  "data/reddit-crypto/r/CryptoCurrency/comments/oa1y35/secure_your_accounts_secure_your_investments.json": "Hey guys,\n\nI'm going to leave this post up for a couple of days and afterwards I am going\nto delete it. Take notes. (EDIT: The reason why I want to delete this after a\nfew days is to protect my own security habits. At some commenters' request I\nwill leave it up for longer than a couple of days.…",
  "data/reddit-crypto/r/CryptoCurrency/comments/oa2dat/if_you_had_1k_to_invest_today_in_crypto_what.json": "I know this is a rather paltry amount for some, but am curious to hear what the\ncommunity has to say. I am rather new to crypto, and have been investing small\namounts on a weekly basis. My plan is to reach 1k of extra savings over the next\n2 months and then invest that larger sum. I have currently…",
  "data/reddit-crypto/r/CryptoCurrency/comments/oa4iqp/how_did_you_get_into_crypto_id_been_hearing_about.json": "I didn't have any money to invest, I was living paycheck to paycheck and cold\nnot dream of being able to save any money. I was working my literal a$$ off on a\nmission to lose a total of 90kg, and in December 2017 hit that goal. I also\nended up fired that month, and had a brand new dog, and had just…",
  "data/reddit-crypto/r/CryptoCurrency/comments/oa5lb0/this_is_the_most_bipolar_sub_ive_experienced_on.json": "A couple months back when things were hitting their ATHs, everyone was overly\nbullish. Rocket emojis and memes being thrown everything. Stuff such as \"ETH to\n$10K 🚀🚀\" and \"$250K BTC\" were being uttered every where. The only thing to\nhate on was dogecoin.\n\nThen let's rewind uptil a few days ago,…",
  "data/reddit-crypto/r/CryptoCurrency/comments/oa6elv/im_sick_of_being_spammed_by_the_same_story_15.json": "I know the mods can only pin 2 posts at a time but I think it would be worth\npinning a \"Daily News\" thread that is pinned below the Daily discussion.\n\nThis way we can see all 30 different sources talking about cdc sponsoring an F1\ncar or some billionaire Mexican banker wanting to accept BTC at his…",
  "data/reddit-crypto/r/CryptoCurrency/comments/oa7ff2/warning_defi_protocol_are_now_using_a_100_deposit.json": "This approach has been adopted by a few projects lately (including polyyield\ntoday) so I thought I'd warn people about it. Its similar to a rug pull/exit\nscam/ what ever else you want to. call it.\n\nThe protocol (lets say ShitSwap) launches with regular farms where everything\nseems to be fine, and…",
  "data/reddit-crypto/r/CryptoCurrency/comments/oa9qvt/i_24f_feel_like_a_bad_btch_compared_to_my.json": "My boyfriend got into crypto around December of 2020, and he decided to put a\nlarge sum of his money in during the huuuuge run we had earlier in the year. His\nstrategy was to put a few thousand in and watch the charts meticulously every\nfew seconds. I even saw him swing trading and swapping coins,…",
  "data/reddit-crypto/r/CryptoCurrency/comments/oabex3/why_prices_are_rising_today_and_where_they_could.json": "We all know that for the last 47 days we’ve been jerked around by the inverted\nWinihoff decumulation phase. But today Bitcoin moved into a descending pentagon\npattern, currently testing 35k to the upper falsetto Trend Line of 37k. This\nindicates Bitcoin could possibly range back downwards to 30k if…",
  "data/reddit-crypto/r/CryptoCurrency/comments/oac7x8/another_french_town_to_use_the_tezos_blockchain.json": "\"French city Neuilly-sur-Seine will launch its municipal e-voting solution on\nTezos blockchain\"\n\nIn 2020, a different French town used the Tezos blockchain to vote on a road\nplanning project. This was posted on this subreddit recently.\nhttps://decrypt.co/43934/a-city-in-france-uses-tezos-blockchain…",
  "data/reddit-crypto/r/CryptoCurrency/comments/oaesgc/how_i_wagered_10000_moons_on_a_single_bet_and_won.json": "Thought this might be cool for the r/cc [/r/cc] archives! 6 months ago\nu/poopymcpoppy12 [/u/poopymcpoppy12] and I made a bet here\n[https://np.reddit.com/r/CryptoCurrency/comments/klemkh/daily_discussion_december_28_2020_gmt0/gh9x5ma/?context=10000]\n(archived…",
  "data/reddit-crypto/r/CryptoCurrency/comments/oagu8n/i_want_to_get_into_crypto_but_i_have_no_idea.json": "So my first post was deleted because it was under 210 characters. I just turned\n18 and thinking of putting a few dollars into crypto, I mean there aren’t many\ndownsides. Want to keep it on my phone because it’s most convenient, any good\napps out there?\n\nTo make sure it’s 210 characters I’ll tell you…",
  "data/reddit-crypto/r/CryptoCurrency/comments/oai97c/to_the_man_who_wanted_to_get_through_tsa_with.json": "I've done some research and I've got you 👉😎👉\n\n 1. Use Trezor. The ledger is made of metal and can be detected by metal\n    detectors. The trezor also has larger volume 😳\n\n 2. Put 2 Trezors in your prison pocket. The one with dogecoin in it on the\n    outside. So if they ever do catch you, They…",
  "data/reddit-crypto/r/CryptoCurrency/comments/oakuzj/daily_discussion_june_30_2021_gmt0.json": "Welcome to the Daily Discussion. Please read the disclaimer, guidelines, and\nrules before participating.\n\n--------------------------------------------------------------------------------\n\n\n\n\n\nDISCLAIMER:\n\nThough karma rules still apply, moderation is less stringent on this thread than\non the rest of…",
  "data/reddit-crypto/r/CryptoCurrency/comments/oalsuj/is_icp_a_scam_arkham_intelligence_looked_into_it.json": "A Summary of Arkham Intelligence’s Takedown of ICP\n\nLink to the article [https://arkhamintelligence.com/icp/report.pdf]\n\n\n\n * ICP dropped from it’s ATH of $730 to $30\n * It ascended to the 3rd most valuable crypto asset\n * DFinity is the company behind ICP\n\nOn-Chain Analysis\n\n * The addresses in…",
  "data/reddit-crypto/r/CryptoCurrency/comments/oanic9/young_people_may_not_have_as_much_capital_to.json": "If you're young and just starting out, it can suck to see whales making millions\nover night during a measly 5% pump or whatever, because they already have\nmillions in capital, while your small initial investment will still not net you\nvery much, comparatively, even if your coin goes 10x.\n\nBut I…",
  "data/reddit-crypto/r/CryptoCurrency/comments/oap9rh/buy_when_others_arent_interested_sell_when.json": "I’m telling you; this is it. This is all you have to do. Do this and you will\nmake it.\n\nBut you won’t. You dirty whore-of-a-human. You won’t do it. You’ll buy high.\nSell low. You’ll get bored of sideways markets and delete reddit off your phone.\nAnd in a years time you will see Bitcoin $300k on the…",
  "data/reddit-crypto/r/CryptoCurrency/comments/oasnrd/cryptocurrency_is_in_the_very_early_stages_of.json": "YOU’RE NOT INVESTING IN COINS, YOU’RE INVESTING IN SOFTWARE.\n\nThere is no such thing as a Bitcoin, an Ethereum or any other “coin”.\n\nMany people are under the erroneous impression that there are such things as\natomic units of ‘coins’ that are moved from address to address and can therefore\nbe…",
  "data/reddit-crypto/r/CryptoCurrency/comments/oasp6i/dont_accept_chat_invitation_on_reddit.json": "Seriously, just don’t.\n\nIf like me you joined a couple crypto-related subreddits, I bet you get some\nrandom chat invitations, more often than not by less than 1-week old accounts.\n\nThey are all scammers. DO NOT ACCEPT THEIR INVITATION. Ignore them happily and\ngo about your day. Stay safe",
  "data/reddit-crypto/r/CryptoCurrency/comments/oatq5m/okay_everyone_get_ready_for_a_bullrun_im_going_to.json": "Had the thought of trying swing trades, as the market trades sideways. But from\nmy past experiences, I’ll most likely cause a massive bullrun, as I sell at a\n-1% day, just to miss a massive upward spike the next day of +1000%.\n\nYou can all thank me later. Happy to be of service…\n\nEdit - commas are…",
  "data/reddit-crypto/r/CryptoCurrency/comments/oavbuv/it_is_interesting_how_media_portrays_everything.json": "Crypto is in bubble. Stocks are in a bubble. Housing is in a bubble. It seems\neverything worth investing in is in a bubble, except fiat.\n\nIs this an elaborate plan to encourage the masses to hold fiat and sell their\nassets, so that the rich elite can buy the quality assets at a better price? 😹",
  "data/reddit-crypto/r/CryptoCurrency/comments/oavzsp/when_i_copy_and_paste_my_wallet_address_from.json": "I think this might be a virus, I don't think I've downloaded anything suspicious\nbut maybe I did.\n\nI copy and pasted and address from Kraken into the Monero GUI wallet. The\naddresses do not match.I copied it again and posted it in a word document, it's\nthe same address from before, but does not…",
  "data/reddit-crypto/r/CryptoCurrency/comments/oax9d2/i_21f_would_love_to_have_another_fake.json": "Since there was one hot post yesterday and a bunch of people copying them today,\nhow about we just put all these fake stories in here and avoid spamming the sub\nwith this circle-jerk moon-farming nonsense... :D",
  "data/reddit-crypto/r/CryptoCurrency/comments/oaxizm/help_understanding_liquidity_pools_first_listing.json": "Hello,\n\nI am attempting to understand Liquidity Pools (LP) a little better and am\nstruggling to find answers to some of my questions. Any information or direction\nwould be helpful. Please keep any negativity out of the comments, not looking\nfor scrutiny.\n\nLet's say you started a cryptocurrency. You…",
  "data/reddit-crypto/r/CryptoCurrency/comments/ob15sz/introducing_the_rcryptocurrency_user_verification.json": "Hello r/CC [/r/CC],\n\nToday I'd like to announce a new program we are piloting for user verification.\nThe wiki page with full details can be found here\n[https://www.reddit.com/r/CryptoCurrency/wiki/user_verification_program], but\nthe TL;DR is that representatives of established entities in the crypto…"
}