{
  "data/reddit-changemyview/r/changemyview/comments/knwmzr/cmv_edinson_cavanis_case_just_shows_how_political.json": "https://www.instagram.com/p/CJd3vWmASKO/?igshid=bknugbfikymf\n\nContext: Cavani reposted a picture from one of his friends on instagram with the\ncaption \"gracias negrito👍\", which means \"thanks mate👍\". Since some people were\noffended by it, Cavani deleted the tweet and apologize. But now, the FA…",
  "data/reddit-changemyview/r/changemyview/comments/koev3f/cmv_homelessness_is_not_a_crime.json": "This CMV is not about the reasons why people become homeless. Even if people\nwould become homeless solely due to their personal failure, they are still\nhumans and they should not be treated like pigeons or another city pest.\n\nInstead I want to talk about laws that criminalize homelessness.…",
  "data/reddit-changemyview/r/changemyview/comments/koko1m/cmv_user_reviews_are_vastly_more_relevant_to_the.json": "It's fairly common for modern films with even a dash of controversy surrounding\nthem to have significantly divergent scores from professional reviewers and\nusers on sites such as Rotten Tomatoes or Metacritic. In my opinion, the most\nimportant aspect that should contribute to a film's rating should…",
  "data/reddit-changemyview/r/changemyview/comments/kovpc3/cmvorgan_donor_should_be_mandatory_with_optout.json": "I'll preface this by stating i live in Aus, not the USA, but i believe all\n'western' countries should be this way.\n\nIt should be the default setting for once you die. And if you opt out, be it\nreligious reasons or otherwise, you should then go further back on the donor\nlist should you need a…",
  "data/reddit-changemyview/r/changemyview/comments/kox7l0/cmv_rsapphoandherfriend_is_bad_history.json": "I feel like I should preface this with the fact that I’m a bisexual man. My\nintention is not to play the gay card or anything but I feel like I should make\nit clear that this is coming from a genuine passion for history and not from a\nplace of homophobia.\n\nr/SapphoandherFriend…",
  "data/reddit-changemyview/r/changemyview/comments/koyhsd/cmv_if_your_income_is_higher_than_the_people_you.json": "So I recently stumbled on a post where the OP googled the homes of the\nindividuals who have some sort of influence into deciding the things you/we are\nallowed to do. This irked me, how is it that we let these people decide that\nthey deserve to make ridiculous amounts of money sitting in a chair,…",
  "data/reddit-changemyview/r/changemyview/comments/kp34yq/cmv_subreddits_that_are_based_on_judging_other.json": "It's usually subreddits about idiotic people, rude and mean people, Karen's,\nJohn's, stupid conservatives, stupid liberals, etc. Any kind of people that\nprovoke hate in you and a strong sense of \"I'm better than them\" or just gossipy\ninterest.\n\nConstantly focusing on humanity's negative side may…",
  "data/reddit-changemyview/r/changemyview/comments/kp48xo/cmvthere_is_no_legitimate_reason_for_marijuana_to.json": "Marijuana isn't some magical plant with no downsides I understand the risk of\npsychosis and obviously driving while inebriated under any circumstance is a bad\nidea. I believe weed should be regulated like any drug such as alcohol or\ntobacco. The reasoning behind this is that by keeping marijuana…",
  "data/reddit-changemyview/r/changemyview/comments/kpeqsk/cmv_the_trumpukraine_scandal_was_as_bad_if_not.json": "In Watergate, Nixon broke into the DNC and wiretapped his political opponents\nfor his own political gain. In the Trump–Ukraine scandal, Trump withheld foreign\naid to an American ally against American interests for his own political gain.\nBoth Nixon and Trump initially tried to deny any wrongdoing.…",
  "data/reddit-changemyview/r/changemyview/comments/kpf4o0/cmv_republicans_are_attempting_a_coup_détat_in.json": "Hi everyone,\n\nTrump and his supporters have constantly talked about how over the past 4 years,\nAmerica went from being (not great?) to “great again”.\n\nThe backdrop for this conversation is, how can America both be great, but also\nsimultaneously, not able to host honest, free, and fair…",
  "data/reddit-changemyview/r/changemyview/comments/kpijom/cmv_extreme_sex_segregation_done_in_iran_since.json": "I'm a 24 year old adult male living in Iran, I've lived through 12 years of\nmandatory sex-segregated school only to be introduced to a sex-segregated\nsociety where interacting with the other gender is deemed illegal by the\nhorrible islamic law imposed and enforced on the poor people of the country…",
  "data/reddit-changemyview/r/changemyview/comments/kpk0j6/cmv_glitter_should_be_a_regulated_substance_and.json": "Let me preface this by saying that we look at glitter all wrong. Most of us look\nat it as just another piece of the artist's toolkit, but the fact is that\nglitter was weaponized long ago by people willing to send envelopes full of\nglitter to your enemies, or even by the infamous porch-pirate revenge…",
  "data/reddit-changemyview/r/changemyview/comments/kpp2ug/cmv_if_politicians_have_a_minimum_age_requirement.json": "If Nancy Pelosi is re-elected Speaker of the House, she will be the oldest\nperson to hold the position at 80 years old.\n\nWhen Joe Biden swears in to become President of the United States, he will be 78\nyears old, the oldest person to become president.\n\nThe 116th Congress had 7 Senators that were 80…",
  "data/reddit-changemyview/r/changemyview/comments/kpqeuf/cmv_we_need_to_force_space_exploration.json": "Here's what i mean, a lot of people try to convince me that we should abandon\nour dreams of living in the stars becouse its too expensive, and we should focus\non starving children rather than fancy space missions. I'd like to disagree with\nthat. Human race, and everything it created, might disappear…",
  "data/reddit-changemyview/r/changemyview/comments/kpswy4/cmv_atwill_employment_laws_make_it_near.json": "There are certain things and attributes it is illegal to fire someone for.\nMostly protected characteristics, like sex, race and disability, as well as\nprotections from being punished for refusing unsafe work and the like.\n\nI think most people can agree that it should be illegal to fire someone…",
  "data/reddit-changemyview/r/changemyview/comments/kpvivl/cmv_the_gatekeeping_of_trans_healthcare_is.json": "I saw a post on a different subreddit about how much gatekeeping there is in the\ntrans community and it’s difficult to transition, while I do understand where\nthey are coming from (it’s taking me 3+ years to even begin to transition) but\nit’s for safety reasons, because if you have made a mistake…",
  "data/reddit-changemyview/r/changemyview/comments/kq0z5q/cmv_parents_should_be_required_to_undergo.json": "There's budget for healthcare, criminal justice, education and most aspects of\nsociety but so little attention paid to how individual parenting possibly plays\nthe biggest role in how a child turns out as an adult, physically, mentally,\nfinancially etc. And all these individual outcomes cascade into…",
  "data/reddit-changemyview/r/changemyview/comments/kq1yom/cmv_religion_is_man_made_and_most_likely_entirely.json": "The entire concept of a written book that god sent down to a human being to\nspread the word does not make sense to me. A being that has the ability to\ncreate the universe, has a son that’s major power is water to wine and walking\non water, and was crucified by humans. How do we even know this man…",
  "data/reddit-changemyview/r/changemyview/comments/kqdxhi/cmv_donald_trump_will_not_be_the_republican.json": "(Edit: I mean that his chances of being the nominee is around 20%, so an\nunlikely but not impossible situation.)\n\nArgument saying he will:\n\n * He currently is very popular among Republicans. It has generally been about\n   90%\n   https://news.gallup.com/poll/203198/presidential-approval-ratings…",
  "data/reddit-changemyview/r/changemyview/comments/kqezko/cmv_religion_played_an_important_role_in_forming.json": "Everybody likes to complain about the unpopular beliefs like anti homosexuality\nor for a while their anti mixed racial couples that stemmed from the church.\nHowever, outside of certain periods of time and sometimes being behind on what\nprogressive attitudes are being held by the masses, religion was…",
  "data/reddit-changemyview/r/changemyview/comments/kqj49a/cmv_you_have_an_inherent_right_to_know_exactly.json": "They track you, and everything you do, live, and exploit that data for their\ngains. You should be able to track what they track, live, with impunity from\ngovernments, and know when this data is used for profit. In cyberspace, you are\nyour data, so you should know where you are, and what you are…",
  "data/reddit-changemyview/r/changemyview/comments/kqlebn/cmv_since_handtohand_combat_is_no_longer_the_norm.json": "Women soldiers in the past were at a great disadvantage due to physical\ndifferences between men and women, no question there. This was a big reason why\ndrafting was for men only all throughout history. Nowadays, however, wars are\nfought using guns, boats, planes, cars, bombs, tanks, hacking, and the…",
  "data/reddit-changemyview/r/changemyview/comments/kqnxeb/cmv_no_one_under_the_age_of_18_should_be_allowed.json": "PHOTO ID verification, to be clear.\n\nI think that every looks-centric social media app like Facebook, Snapchat,\nInstagram, and TikTok should require users to be at least 18 years old and\nshould require ID verification to create an account the same way that some\nonline investment apps do because:\n\n…",
  "data/reddit-changemyview/r/changemyview/comments/kqo6eg/cmv_conservatives_are_doing_what_they_accuse_of.json": "I'm a centrist for the most part but a lot of the things that I typically see\nconservatives accuse of Liberals such as not accepting different views, taking\nthe extremists of the other side and saying that they represent the whole, being\noverly sensitive, name calling, constantly bringing up race…",
  "data/reddit-changemyview/r/changemyview/comments/kqqmpq/cmv_the_us_should_implement_an_optout_system_for.json": "Just to be clear, I am talking about organ donation after you die, not while you\nare living.\n\nIf the U.S. had an opt-out system for organ donation similar to what the UK has,\nit would save thousands of lives. By letting people opt-out, those whose\nreligion is against it or simply don't want to don't…",
  "data/reddit-changemyview/r/changemyview/comments/kqup7p/cmv_they_say_a_relationship_wont_solve_any_of.json": "I think I’ve said it all in the title, but yeah. If people shouldn’t “focus on\ngetting a significant other, it won’t fix your life” then how come there are so\nmany so-called ‘losers’ whose lives miraculously seem to get so much better once\nthey have a significant other? I’ve seen people go from…",
  "data/reddit-changemyview/r/changemyview/comments/kqzxqe/cmv_all_laws_should_have_a_sunset_provision.json": "Too often are good-sounding laws passed that end up being bad in practice. But\nthen they become hard to repeal, because the existence of these laws benefit\nthose in power.\n\nSome laws are written with a sunset provision, which says \"This law will cease\nto have effect unless the congress approves it…",
  "data/reddit-changemyview/r/changemyview/comments/kr3ch4/cmv_spam_and_unsolicited_call_text_and_mail_laws.json": "Living in Georgia, I have been inundated with mail from both parties, their\ncandidates, and various third parties on both sides (I kept count, we received\n89 mailings last week). Daily we have things placed on our door handle from\nthese same people. We receive at least one visitor every 2-3 days who…",
  "data/reddit-changemyview/r/changemyview/comments/krc0t0/cmv_punishment_by_a_fine_should_be_paid_via_a.json": "Any fines, judgments, what have you should be paid via a community service. No\nmore of this \"legal for the rich\" mentality. What ever the \"value\" of the fine\nis, should then be divided by what the minimum wage is of the state crime was\ncommitted in, or fed min if Federal crime, to determine the…",
  "data/reddit-changemyview/r/changemyview/comments/krhja1/cmv_the_white_teen_who_said_the_n_word_on_a.json": "https://www.nytimes.com/2020/12/26/us/mimi-groves-jimmy-galligan-racial-slurs.amp.html\n\nHere is an article explaining the situation ^\n\nReasoning:\n\n1) The girl said it when she was 15 (4 years ago)\n\n-Mrs. Groves said this word as a child. Was it right? Absolutely not. But 4\nyears is enough to change…",
  "data/reddit-changemyview/r/changemyview/comments/krszlj/cmv_conflating_personal_and_systemic_racism_makes.json": "what is \"A Racist\"? when people say \"Tom is a racist don't hire him\" what do\nthey mean? i use to assume they mean that Tom dismisses and judged people based\non the color of their skin, or that he looked down at a specific race, because\nof their race. in which case i would not even interview Tom. I…",
  "data/reddit-changemyview/r/changemyview/comments/krvf6w/cmvi_have_absolutely_no_reason_to_respect.json": "With all attempts to do so, I have come to the conclusion that I have gained\nvery little (if not no) respect to those who refuse to vaccinate them or their\nchildren, particularly against diseases that have been known to be very\ndevestating to quality of life (if not the whole life in general).\n\nYes,…",
  "data/reddit-changemyview/r/changemyview/comments/krw5q0/cmv_trump_is_staging_a_coup_at_this_moment.json": "Currently the certification proceedings for the 2020 election have been stalled\nbecause far right \"protestors\" have stormed the capitol building bearing Trump\nflags, shouting that Trump has won, and occupying the floors of both houses\n\nAlthough Trump has tweeted that this is lawless and to support…",
  "data/reddit-changemyview/r/changemyview/comments/kryegf/cmv_if_you_believe_life_begins_at_conception_and.json": "I want you to poke holes in this simple if A and B then C must be true argument.\n\nCMV: If you believe life begins at conception AND in birthright citizenship,\nthen you must also believe that a person who was conceived in a country must be\ngiven citizenship to that country solely on that basis,…",
  "data/reddit-changemyview/r/changemyview/comments/ks2vjf/cmv_the_us_is_not_the_greatest_country_in_the.json": "I've been watching the news cycle since the storm on Capital Hill started, and\none recurring line that nobody seems to bat an eye at is \"America is the\ngreatest country in the world.\"\n\nMaybe this was true at the start of the industrial revolution, but it almost\ncertainly isn't the case anymore. But…",
  "data/reddit-changemyview/r/changemyview/comments/ks2y14/cmv_the_insurrectionists_who_stormed_the_capitol.json": "Attacking the Capitol and assaulting police officers is a felony. A woman was\nshot and died when the insurrectionists stormed the Capitol today. Many\njurisdictions apply the proximate cause theory to felony murder, which says that\nall persons involved in committing a felony can be charged with…",
  "data/reddit-changemyview/r/changemyview/comments/ks2zik/cmv_in_order_to_bring_back_civil_discourse_we.json": "When I was a kid,we took Civics in all three schools,6th grade,9th grade and\n12th grade,(it was in puerto rico) and that taught me the basics of democracy,\nit wasn't just about the importance of the vote, but what it means to live in a\nparticipant democracy, but now year after year with all of the…",
  "data/reddit-changemyview/r/changemyview/comments/ks6jef/cmv_both_sides_of_this_political_turmoil_are.json": "Basically, after today, I’ve seen both sides of the political spectrum in\nAmerica talk about the other like dogs. The left can do one thing and they’re\nvillianized for it but then the right will do the same shit and get villianized\nby the left. It’s all hypocritical af. I realize we’re fairly…",
  "data/reddit-changemyview/r/changemyview/comments/ksd569/cmv_theres_a_huge_divide_in_the_us_thats_only.json": "Edit: thank you guys for your answers, I got really busy and now I'm going\nthrough them.\n\nI won't go as far as saying there will be civil war, but we're at a point where\nbasically republicans have turned into Trumpers, and democrats with their media\nand celebrities are making sure everyone hates…",
  "data/reddit-changemyview/r/changemyview/comments/ksdt8n/cmv_white_silence_isnt_a_thing.json": "I never heard of white silence untill a few months ago but for those a who don’t\nknow what white silence is,white silence when a white person doesn’t talk about\nor or spread information on the hardships POC or other minorities face. I think\nthis is the stupidest thing I’ve ever heard of.Not everyone…",
  "data/reddit-changemyview/r/changemyview/comments/ksefg0/cmv_if_you_still_believe_the_usa_elections_were.json": "I just don't understand how there are still people out there that believe the\nelection was faked. It is simply un-American to be going against democracy like\nthis. Even Trump's own vice president, being Pence of course, has stated that\nthe elections were not fraudulent. I simply can't wrap my mind…",
  "data/reddit-changemyview/r/changemyview/comments/ksg7pi/cmv_the_division_we_see_in_modern_america_is.json": "Joe Biden has just been elected as the 46th president of the United States. He\nhas promised unity to a broken America; an America that is polarized between two\ncamps that are becoming more and more divisive and filled with vitriol. I firmly\nbelieve that we are on the brink of an important inflection…",
  "data/reddit-changemyview/r/changemyview/comments/ksiaoc/cmv_deadly_force_should_have_been_used_to_defend.json": "This is a view I weakly hold and have some doubts about, but which was pretty\nfront of mind for me yesterday.\n\nMy reasons for holding this view are:\n\n 1. The defense of the seat of government is a military exigency. Even though\n    the Capitol Police aren't the Army, when you're at the last line of…",
  "data/reddit-changemyview/r/changemyview/comments/ksl2fy/cmv_cabinet_members_resigning_at_this_point_are.json": "With the breaking news that Elaine Chao is resigning her post as Secretary of\nTransportation, I can't help but think that it is an empty gesture at best, and\na cowardly avoidance of participating in invoking the 25th Amendment at worst.\n\nIt is my understanding that in order to invoke the 25th, Vice…",
  "data/reddit-changemyview/r/changemyview/comments/ksq5ay/cmv_menstrual_products_should_be_free_and.json": "Most women menstrate. It is a biological part of womanhood. Though I do think\nbirth control (including condoms) should also be free, menstruation happens\nwhenever it wants to happen. You cannot choose when it happens. Even birth\ncontrol pills can only help but cannot guarantee you won't have…",
  "data/reddit-changemyview/r/changemyview/comments/ksqkqe/cmv_pointing_out_racism_in_the_lgbt_community_is.json": "I’d started off by saying that i’m poc gay man, I’ve experienced both extreme\nracism and homophobia. I’m here for outing racists. But I do NOT see people\ntalking about how insane homophobia is in the black community. Some black people\nare pretty religious, and there’s extreme homophobia there that…",
  "data/reddit-changemyview/r/changemyview/comments/kt4tuy/12_its_fresh_topic_friday_01082021_that_means_no.json": "Folks, we get it - the recent events surrounding the US Capitol protests are a\nhot topic now and everyone has views they want to post, but it is Fresh Topic\nFriday. The point of FTF is to give us all a break from the most common topics\nhere, and this Friday is no exception.\n\nTo be very clear - we…",
  "data/reddit-changemyview/r/changemyview/comments/kt8c8e/cmv_hotdogs_are_a_sandwich.json": "I would like a solid argument against what I believe is a fact, hot dogs are\nsandwiches. Merriam Webster defines \"sandwich\" as \" two or more slices of bread\nor a split roll having a filling in between\". By definition, a hot dog is a\nsandwich, yet there is a debate among us all that hot dogs do not…",
  "data/reddit-changemyview/r/changemyview/comments/kt90fy/cmv_ken_jennings_hoe_answer_should_have_been.json": "Was reading some stuff about the Jeopardy GOAT tournament they're doing, and\npeople brought up a Jeopardy-famous moment\n[https://www.youtube.com/watch?v=OpKOm-LLRhA] from Ken Jennings' original run.\n\n> [Tool Time for 200]\n> \n> This term for a long-handled gardening tool can also mean an immoral…",
  "data/reddit-changemyview/r/changemyview/comments/ktj0hm/cmv_there_are_way_too_many_americans_and.json": "Let's be real, I doubt people who are daily driving F-150's are going to be\ndoing stuff on a regular basis that requires the grunt of a vehicle that big.\nUsually, they might be doing stuff that a decent sized sedan, wagon or hatchback\ncan do just fine. When you aren't fully utilizing a big vehicle,…",
  "data/reddit-changemyview/r/changemyview/comments/ktmh8c/cmv_human_beings_crave_ritual_purpose_and_sense.json": "Science and practical experience both show us that humans want ritual, purpose\nand a sense of greater connectedness. Religions give human beings a framework\nthat addresses these psychological and emotional desires. This is not to say\nthat any given religion is correct or not, but it fulfils…",
  "data/reddit-changemyview/r/changemyview/comments/ktson7/cmv_my_fellow_progressives_should_be_appalled_and.json": "Assume any precedent could just as easily be used against you if a different\nideology was in charge. That should be your litmus test for outrage vs. support.\n\nThis is turning into a censorship witch-hunt against people who, agree with them\nor not, justified or not, already feel like they’re under…",
  "data/reddit-changemyview/r/changemyview/comments/ku3ugw/cmv_the_second_protesters_breached_the_us_capitol.json": "As soon as there was a real possibility of breaching the Capitol Building\nwhatever police force was there should've immediately have used a\n\"shoot-to-kill\" policy. Besides the symbolic value of the seat of power of the\nUnited States Legislator, any time that the US Congress is in session there is…",
  "data/reddit-changemyview/r/changemyview/comments/ku8z32/cmv_if_we_cant_understand_what_happened_with.json": "I can’t stand him and I find it difficult to understand those who follow him\nmost of the time.\n\nI listened to his “save the vote” speech and I thought “am I wrong? Is there\nsomething I am missing? Is there a grand conspiracy? My anchors in fact based\nreality helped me, but his speech was inspiring.…",
  "data/reddit-changemyview/r/changemyview/comments/kubpza/cmv_i_do_not_support_blm.json": "Hello, I hope you are doing well. I trust your opinions and wish to have a\nthoughtful discussion if you feel comfortable answering some questions I have. I\ntry to believe that I am a centrist (At least that is what the political tests\ntell me). As such I wish to look at all sides and make a well…",
  "data/reddit-changemyview/r/changemyview/comments/kuf0au/cmv_i_am_not_a_racist_just_for_reading_or_hearing.json": "I’m kind of tired of people telling me I’m racist for \"automatically assuming\nothers have the same skin colour\" as I do.\n\nI think that’s not racist, that’s natural.\nIf I grew up in a country with a mostly white population, I’m likely to imagine\nsomeone being white if I have no additional information…",
  "data/reddit-changemyview/r/changemyview/comments/kul5tk/cmv_the_reason_a_lot_of_subreddits_are_moderated.json": "All these \"power mods\" that moderate multiple big communities do so because they\ndon't have a life. Removing posts and comments they don't agree with is all they\nhave going for them. I just feel bad that nobody loves them so they have to come\nhere and gain some fake sense of authority by silencing…",
  "data/reddit-changemyview/r/changemyview/comments/kuo0j1/cmv_parler_and_farright_politicians_being_shut.json": "I am no fan of Parler or Trump. I’m pretty far left and am terrified by the\nstate of politics right now. No more Nazis sounds pretty nice.\n\nHowever, it worries me that a small handful of companies were able to\nessentially ban a political group from online discussion. Sure, they showed\nrestraint in…",
  "data/reddit-changemyview/r/changemyview/comments/kur10x/cmv_americans_in_general_dont_know_what_socialism.json": "I was reading a right-wing piece about how corporations are taking over America\nin a cabal-conspiracy \"great reset\" which will usher in a corporate communism\nwhere a small billionaire elite will govern unaccountably.\n\nThis fear and view point seems to resonate with many Americans who have…",
  "data/reddit-changemyview/r/changemyview/comments/kutirh/cmv_party_loyalists_are_not_rational_people_in.json": "I've followed politics most of my life and I've never supported a specific party\nbut rather individual issues and then saw which candidate best aligned with\nthose issues. I've always acknowledged the motives and beliefs on each side, and\nI'm able to see the good and bad with both Democrats,…",
  "data/reddit-changemyview/r/changemyview/comments/kv1m0k/cmv_the_power_held_by_amazon_twitter_etc_is_a.json": "Reading through the main arguments and talking points going through the internet\nat the moment, it seems like people have pitted the following arguments against\neach other when discussing the banning of Parler, Trump, and others.\n\n * On the one hand: “Trump, Parler and the other banned voices were…",
  "data/reddit-changemyview/r/changemyview/comments/kv4pyb/cmv_trumps_twitter_ban_is_the_perfect_spark_to_a.json": "If 10 years ago, you were to tell the average American that the president of the\nUnited States were to be banned from using social media platforms that has\nbillions of users in 10 years, you would be called crazy, and rightfully so. It\nshould be horrificly frightening that our public discourse has…",
  "data/reddit-changemyview/r/changemyview/comments/kv5rha/cmv_longterm_immigrants_not_integrating_is_not_a.json": "It's not just the language, it's also about\n\nTaxes , insurance , government benefits, and other government programs , and\ngovernment laws\n\nThese things differ vastly by country, like for example they might not know that\nyou have to pay State, Local AND Federal taxes on your income - many are…",
  "data/reddit-changemyview/r/changemyview/comments/kv90up/cmv_religion_is_treated_as_and_protected_like.json": "Very often when discussing things that should not be criticizable things like\nrace, sexuality and religion are brought up. However religion is nothing like\nsexuality or race. These are immutable characteristics of which you have no\ncontrol, and would be ridiculous for me to judge you for or…",
  "data/reddit-changemyview/r/changemyview/comments/kv9gnr/cmv_too_many_people_use_being_gay_as_a_substitute.json": "I’d like to kick off this post by saying I have the utmost respect for the\nLGBTQ+ community, and deeply respect the struggle that they go through. With\nthat said, I am of the view that too many people in the LGBTQ+ community exhibit\ntheir sexuality as the central theme of their personality. I think…",
  "data/reddit-changemyview/r/changemyview/comments/kvwbxj/cmv_being_a_conservative_is_the_least_christlike.json": "From what I know, Christ was essentially a radical leftist. He was all about\nhelping and loving the poor, hungry, disabled, outcast. He would feed 10 people\njust in case one was going hungry. He flipped a table when banks were trying to\ntake advantage of people. He was anti-capitalist and pro social…",
  "data/reddit-changemyview/r/changemyview/comments/kvyrf1/cmv_the_trumpgeorgia_election_call_was_clearly_a.json": "TL;DL:\n\nIt is a crime in Georgia to solicit election fraud. “Fraud” means it’s illegal\nto solicit someone to change an electoral tally to a number you know to be\nfalse. Whether or not trump actually believed he won the election, he calls the\nGeorgia Secretary of State in order to change the tally to…",
  "data/reddit-changemyview/r/changemyview/comments/kwc8vx/cmv_any_american_libertarianism_that_concerns.json": "In modern economically liberal democracies, for-profit corporations often have\nfar more direct and unchallenged authoritarian power over all aspects of human\nlife than government agencies. Their success in capturing government regulatory\npower through lobbying and corruption in the past several…",
  "data/reddit-changemyview/r/changemyview/comments/kwg8m8/cmv_labeling_the_terrorists_who_attacked_the.json": "There were white nationalists at the insurrection of course, but they appeared\nto be a minority of the participants. It seems to have been a mix of QANON,\nProud Boys, evangelicals, military, backwoods hicks, and it was mostly white.\n(but not all white)\n\nBy calling this group “white supremacists” or…",
  "data/reddit-changemyview/r/changemyview/comments/kwsx5v/cmv_if_catholics_believe_nuns_are_married_to.json": "This assumes the bread is consecrated, as in the eucharist. As I see it, if\nCatholics believe that:\n\nSex within marriage is allowed, but outside of marriage is sinful; Nuns are\nmarried to Christ; The eucharist transubstantiates into the literal body of\nChrist;\n\nthen it follows that they should be…",
  "data/reddit-changemyview/r/changemyview/comments/kwwd7d/cmv_nancy_pelosi_should_retire_along_with_most.json": "I would like to clarify that I support the impeachment and don't think there is\nanything wrong with it. I just think that it is time that the young people were\ngiven more chance to express their voice and have a more balanced understanding\nof what the youth wants. It's because of speaker Pelosi and…",
  "data/reddit-changemyview/r/changemyview/comments/kx53dq/cmv_if_youre_watching_a_tv_series_or_film_that.json": "Pretty much self explanatory.\n\nA reason i say this is an unpopular opinion, is because literally everyone does\nit. I'll be watching something then someone will do the exact thing, i hate it.\na big part of watching TV or Films is watching character development, the beauty\nof watching TV is watching…",
  "data/reddit-changemyview/r/changemyview/comments/kx8hnf/cmv_tv_series_are_a_better_medium_for_most.json": "When making an adaption of a book a limited series or recurring series for\nmultiple books.\n\nMost people agree that movie adaptations of books are usually sub par. There are\nsome exceptions. When adapting a book you either need to leave out interesting B\nplots, or move the story faster and give up…",
  "data/reddit-changemyview/r/changemyview/comments/kx9uer/cmv_saying_all_lives_matter_in_response_to_black.json": "Look, I know people need to be treated equally, etc. but blacks have suffered\nmore than anyone else in the U.S. when it comes to racism.\n\nLatinos may be discriminated against by racist Americans, but blacks were the\nones who were taken from their land and enslaved. Latinos did not suffer…",
  "data/reddit-changemyview/r/changemyview/comments/kxlygb/cmv_as_a_leftist_not_only_do_i_firmly_believe.json": "I'm an anarchist, and I do not sympathize with Trump or his supporters in any\nway shape or form. I noticed, however, that a lot of my fellow comrades seem to\nbe oddly complacent in being quick to call the 45th POTUS a fascist. This is\nsimply not true, and I am against this way of describing Trump's…",
  "data/reddit-changemyview/r/changemyview/comments/kxwhvp/cmv_the_shape_of_water_is_a_mediocre_film.json": "Background: The Shape of Water is a 2017 film that won the 90th Oscars for Best\nPicture. However, I argue that it is a mediocre film at best and underserving of\nthe award. I will present a few reasons for my assertion, before comparing it\nwith winners for Best Picture in other years.\n\n[PLOT SPOILER…",
  "data/reddit-changemyview/r/changemyview/comments/kxww0z/cmv_there_should_be_no_such_thing_as_being.json": "I have heard from some friends and family lately that they have applied to\nvarious job postings they find and the feedback is commonly along the lines of,\n“I’m sorry, but we have chosen to move forward with other candidates due to your\nover-qualification for this position.”\n\nIf a person looks at a…",
  "data/reddit-changemyview/r/changemyview/comments/kyb3n8/cmv_carpet_should_be_discontinued.json": "Pretty simple view. Basically, I spend a lot of time watching HGTV shows and\nalmost every episode of House Hunters has a moment where someone abruptly\ndecides that they need to remodel an entire home simply because it has carpet. I\ntotally get it, carpet requires a certain degree more maintinance…",
  "data/reddit-changemyview/r/changemyview/comments/kycxvs/cmv_if_one_can_identify_as_any_gender_then_one.json": "They are both social constructs with no biological definition. We use them as\nlabels amongst ourselves in one human race.\n\nTherefore I can identify as any label(s) I want to be labeled as that society\nhas constructed as a means of human categorization.\n\nRace is a grouping of humans based on shared…",
  "data/reddit-changemyview/r/changemyview/comments/kyif1e/cmv_its_selfish_to_keep_elders_alive.json": "I work in healthcare. It’s depressing this season with everything going on. I\nmainly deal with nursing homes. I despise nursing homes.\n\nSee, to me, nursing homes are elder jails. I haven’t been in a nursing home that\never treated their patients/residents right...\n\nBut besides that, I feel that the…",
  "data/reddit-changemyview/r/changemyview/comments/kyjzxi/cmv_democrats_and_republicans_live_in_completely.json": "I would guess that a typical Democrat gets their news from CNN, MSNBC,\nWashington Post, NYT, etc. And the average conservative gets his news from Fox\nNews, Talk Radio, OAN, Breitbart, The Daily Caller, YouTubers like Stephen\nCrowder and Ben Shapiro, etc. If you go more into the fringes of the right…",
  "data/reddit-changemyview/r/changemyview/comments/kytupk/cmv_15_minimum_wage_is_actually_not_a_good.json": "I'd consider myself a moderate Democrat, and there's been a lot of talk for some\ntime about raising the minimum wage to $15. And yes, the thought behind it I can\nagree with in that a lot of people are struggling to makes ends meet and this\nwould be a way to help those people. The problem with this…",
  "data/reddit-changemyview/r/changemyview/comments/kz7f5j/cmv_the_lgbt_alphabet_soup_is_delegitimizing_and.json": "I am fully supportive of gay and trans right, but I'm growing tired of invented\ngenders or minor sexual preferences hijacking and taking over the LGBT community\nas a vocal minority. By those I mainly refer to people who identify as\ngenderfluid, agender, bigender, non-binary, as well as the ace…",
  "data/reddit-changemyview/r/changemyview/comments/kzcin5/cmv_as_a_liberals_not_tolerating_conservatives.json": "I saw this as a non-American left-leaning centrist.\n\nIn more than one thread recently about Bumble allowing people to filter by\npolitical belief, non-Americans were shocked that people filter by political\nbelief only to be downvoted and for people to defend why they wouldn’t even want\nto be friends…",
  "data/reddit-changemyview/r/changemyview/comments/kzgih0/cmv_wealthy_people_who_earned_their_wealth.json": "More often than not it seems to be a common notion for people to judge and or\nostracize others for spending their money in certain ways, when said spending\nthreshold exceeds an arbitrary amount where one could be considered 'wealthly'\nto make such a purchase. Some common examples: houses, super…",
  "data/reddit-changemyview/r/changemyview/comments/kzhp2y/cmv_acab_is_ultimately_going_to_hurt_america_more.json": "My view on the phrase “all cops are bastards” is that while it is a convenient\nway to express distaste with policing in the US it doesn’t allow any room for\nwhat is good and working.\n\nFor example: I recently saw a video where a person was getting arrested on the\nstreet. One cop cuffing him, another…",
  "data/reddit-changemyview/r/changemyview/comments/kzljd8/cmv_if_it_is_racist_to_require_an_id_to_vote_it.json": "CMV: If it is racist to require voter ID, it is racist to require ID to buy a\ngun.\n\nI just don’t see a way out of this one. How can it be racist to require an ID to\nvote (18 yrs old citizen, not a felon), but it isn’t racist to require an ID to\nbuy a gun? It’s almost the same requirements (18, not a…",
  "data/reddit-changemyview/r/changemyview/comments/kzqygn/cmv_blocking_conspiracy_theorists_and_altright.json": "I don't think peddling radical, violent conspiracy theories should be protected\nby free speech. I think we need to find better ways at combatting all of the\nfalse information being spread as fact. It's now been proven to be dangerous if\nleft unchecked. There needs to be some way to restore faith in…",
  "data/reddit-changemyview/r/changemyview/comments/kzvsea/cmv_cutting_ties_with_your_family_is_nothing_to.json": "If a relationship is unhealthy, it's unhealthy. Period. Just because we're\nrelated doesn't mean I should sacrifice my health and wellbeing.\n\nI saw another poster say: \"You only have one mother/brother/sister/etc\", \"They\nare still your family!!!\", \"You will regret it if something happens to…",
  "data/reddit-changemyview/r/changemyview/comments/kzwkd0/cmv_if_the_age_limit_for_smoking_is_21_so_should.json": "EDIT: based on responses, I just want to make clear that I'm not advocating the\nage limit be one or another - just that it should be consistent as it relates to\naccountability. Thanks.\n\nThe fact that (in the US) we've deemed that we're not able to make rational\ndecisions at 18 that have long term…",
  "data/reddit-changemyview/r/changemyview/comments/l04cdf/cmv_capes_should_come_back_in_fashion.json": "Capes are objectively the best price of clothing none of us have. They can work\nfor men and women. Long capes cut wind chill down to zero. They are often thick\nand warm. They have tons of room for pockets without disrupting the look of the\ngarment.\n\nThey have an incredible amount of design real…",
  "data/reddit-changemyview/r/changemyview/comments/l0873h/cmv_people_who_are_in_the_middle_of_the_political.json": "Both Democrats and Republicans (I will be referring to these as \"left\" and\n\"right,\" as it is just easier to type) have claimed to be the \"silent majority.\"\nNeither side is truly the silent majority, nor are they a silent group at all.\nThe true \"silent majority/silent group\" is people who are more…",
  "data/reddit-changemyview/r/changemyview/comments/l0ibdw/cmv_too_many_privileged_people_call_themselves_an.json": "Here's the case study: I noticed that After George Floyd was killed last year, a\nlot of white and otherwise very privileged people started using the\nBlackouttuesday tag to post black squares, putting BLM slogans in social media\nbios and using Breonna Taylor's murder as a buzzword, calling…",
  "data/reddit-changemyview/r/changemyview/comments/l0jd57/cmv_society_should_have_more_empathy_towards.json": "Okay I've probably made a lot of people squirm and shower me in downvotes from\nthe title alone but hear me out.\n\nThere's a big distinction between pedophiles and child molesters.\n\n * Pedophiles are sexually attracted to prepubescent children. A quick Google\n   search tells me that pedophiles could…",
  "data/reddit-changemyview/r/changemyview/comments/l0mg6m/cmv_no_new_antiterrorism_legislation_is_needed_to.json": "This was a failure of leadership and personnel, not the result of systemic\nlimitations that prevented those agencies from guarding the Capitol. The\nagencies had all the tools and resources they needed to stop it, no new\nlegislation is needed.\n\nPast anti terror legislation in the united states and…",
  "data/reddit-changemyview/r/changemyview/comments/l0y9mo/cmv_donald_trump_has_not_actually_done_anything.json": "I don’t believe anything that Donald Trump says, nor his supporters, for obvious\nreasons, and quite frankly it seems that all media outlets have an agenda to\npush that leans heavily in one direction or another. Regardless, I’m not\npersonally aware of a single positive thing that Donald Trump,…",
  "data/reddit-changemyview/r/changemyview/comments/l10fe2/cmv_illegal_immigrants_should_not_be_able_to.json": "President-elect Joe Biden announced his plan to provide an 8-year path to\ncitizenship for people living in the US without legal status.\nhttps://apnews.com/article/biden-8-year-citizenship-path-immigrants-4f2dffdb7a688e1e126a62a8acd59730\n\nI am a frontline healthcare worker who has been in the US…",
  "data/reddit-changemyview/r/changemyview/comments/l17845/cmv_the_pardoning_power_of_the_us_president.json": "Some of the most controversial pardons issued by Presidents in recent history\n(including the pardoning of Richard Nixon and a number of pardons issued by\nDonald Trump) were to people who were not yet tried and convicted of a crime.\n\nThe unilateral and unchecked pardoning power of a U.S. President is…",
  "data/reddit-changemyview/r/changemyview/comments/l188e7/cmv_there_is_nothing_transphobic_about_not_being.json": "Since it's clear that gender and biological sex are two different things, the\nfirst being a set of social constructs and expectations that are assigned to\neveryone at birth based on the second, being trans would imply that these two\naspects don't match in a person. For example, someone who is…",
  "data/reddit-changemyview/r/changemyview/comments/l1ayxi/cmv_touchscreens_are_a_driving_hazard.json": "Look I'll be the first to admit that they're cool. They are.\n\nBut they make no sense.\n\nIf you can remember life before you had a touchscreen in your car, you can\nprobably remember doing things like:\n\n * Changing the volume on your radio\n * Changing the station\n * Adjusting the heat/defog/aircon\n\nAll…",
  "data/reddit-changemyview/r/changemyview/comments/l1egov/cmv_depression_anxiety_and_other_mental_health.json": "Purely from my observations especially on social media, so many people within\nthe Millennial-Gen Z age range have been treating topics of mental illnesses\nlike depression & anxiety too lightly.\n\nI have no intention to say them saying they have depression/anxiety/other mental\nillnesses is not valid,…",
  "data/reddit-changemyview/r/changemyview/comments/l1i3pl/cmv_kamala_harris_is_not_a_good_role_model_for.json": "Kamala Harris is now being touted as a role model for being the first black\nfemale Vice President and yes she was chosen to be Vice President, but is that\nall there is to it? Is that why she's a role model? What about everything she's\ndone to get to this point? Knowingly hiding evidence from…",
  "data/reddit-changemyview/r/changemyview/comments/l1jis7/cmv_euthanasia_for_people_suffering_from.json": "I have a grandfather who is very old. He didn't have a particularly easy life so\nfar but as far as I'm aware he's done pretty much everything he ever wanted to\nat this point. But his age is creating serious health issues for him. I won't go\ninto details but it's come to the point where he's almost…",
  "data/reddit-changemyview/r/changemyview/comments/l1nhmf/cmv_transgenderism_contradicts_itself.json": "I'm going to try to ask this in the most respectful way possible, as my\nintention is absolutely not to insult or invalidate anyone.\n\nOver the past few years, as gender has become more and more of a fluid concept,\nmany people (including myself) question the role or necessity of gender\naltogether. We…",
  "data/reddit-changemyview/r/changemyview/comments/l1zplt/cmv_brand_loyalty_is_only_good_for_the_brand.json": "Some clarifications first.\n\nObviously some brands are better than others. Choosing a better brand (let's\nsay, Pepsi) over a lesser brand (Sprite,. Coke, etc., subjective I know )\ndoesn't make you 'loyal' to said brand. It was just a thoughtful decision, or\nchoosing the better product.\n\nI do think…",
  "data/reddit-changemyview/r/changemyview/comments/l20m2t/cmv_boomers_are_the_worst_generation_and_until_we.json": "Almost everything wrong with our current society can be blamed on boomers, the\nhousing prices, low wages, horrible job market, offshoring to China, global\nwarming, allowing companies to violate privacy rights and roll back our other\nrights everything was done on the boomers watch and most of it was…",
  "data/reddit-changemyview/r/changemyview/comments/l231kp/cmv_news_networks_should_not_be_allowed_to_have.json": "Most (or all) 24/7 news networks like Fox News, CNN, MSNBC, and such have very\nbiased opinion shows but their true news portion are fairly decent. To use Fox\nNews as an example, the newscast portion of it is reasonably factual but the\nopinion shows like Hannity are completely independent of facts…",
  "data/reddit-changemyview/r/changemyview/comments/l2baz3/cmv_when_done_competently_hunting_is_in_no_way.json": "Basically the title, but I’ll explain my viewpoint and reasoning some more. Let\nme start by describing my background. I’m in my 50’s now, and I’ve been hunting\npretty much my whole life. I started going with my grandpa and my uncles when I\nwas young. I live in New Hampshire, and I’ve had a lot of…",
  "data/reddit-changemyview/r/changemyview/comments/l2m93x/cmv_silencing_opposing_viewpoints_is_ultimately.json": "WOW I CAN’T BELIEVE I HAVE TO SAY THIS, BUT SERIOUSLY, KEEP THE DISCUSSIONS\nABOUT THIS HERE. DON’T STALK ME TO OTHER SUBREDDITS. I’M SORRY IF THIS EDIT IS\nAGAINST THE SUBREDDIT RULES.\n\nEdit 2: Guys this kinda exploded within the last hour and I now have over 100\ncomments and quickly climbing to…",
  "data/reddit-changemyview/r/changemyview/comments/l2r7kb/cmv_canadian_geese_are_a_weaponized_wildlife.json": "Most everyone hates Canadian geese. They gang up and chase pets and people, they\nhave no fear of blocking roads, and they shit EVERYWHERE. No other animal of\nsimilar size is so fearless or so agressive, so they must have been bred that\nway or trained.\n\nI believe the reason the Canadian people are…",
  "data/reddit-changemyview/r/changemyview/comments/l2u1wn/cmv_americans_who_live_abroad_should_not_be.json": "For those of you who don’t know, the US is one of two countries in the world,\n(other being Eritrea), which tax based on citizenship instead of residency. Most\ncountries have a policy where if you live here, you’re a taxpayer. The US on the\nother hand says “If you’re an American, you’re a taxpayer.”…",
  "data/reddit-changemyview/r/changemyview/comments/l2w3ui/cmv_follow_your_passion_is_pretty_awful_career.json": "Passion is temporary. Careers have to last a lifetime.\n\nEven if you find success following your passion, in the due course of time,\npassion and excitement wane. But if you're still dedicated to the ethos of\n\"follow your passion\" from a career perspective, that means you'll need to\nabandon whatever…",
  "data/reddit-changemyview/r/changemyview/comments/l34jjg/cmv_affirmative_action_should_be_replaced_with_a.json": "I don’t think affirmative action is the best or fairest way to decide who gets\ninto college. Instead of using race as a factor in admissions colleges should\nuse income, zip code, wealth or some other metric to help poorer Americans.\n\nI just think it is fundamentally unfair that an upper middle class…",
  "data/reddit-changemyview/r/changemyview/comments/l34zy6/cmv_the_live_action_dinsey_mulan_movie_is.json": "Possible spoilers if you've not seen the movie(though I don't recommend...it's\ntruly awful)\n\nI'm 11 minutes in and so far:\n\nMulan has a sister.\n\nApparently her dad is poor, instead of an honored rich man/family.\n\nIt starts with her as a kid\n\nShe somehow has magic kung fu abilities that defy gravity,…",
  "data/reddit-changemyview/r/changemyview/comments/l3ctyx/cmv_claiming_that_working_hard_or_making_changes.json": "Far too often, I see people immediately reject the idea of self-improvement by\nclaiming it is suggesting \"bootstrapping.\" I am well aware of the bogus origins\nof the word. As Martin Luther King once put it(to paraphrase), telling a man\nwith no boots to lift himself up by his bootstraps is a cruel…",
  "data/reddit-changemyview/r/changemyview/comments/l3f3hq/cmv_arguing_against_rightwinged_posts_describing.json": "I recently saw an /r/insanepeoplefacebook post where a conservative compared\nKelly Mcenany to Biden’s appointed press secretary (can’t remember the name) in\nterms of looks equating that conservative women are better. In the comments I\nsaw many people bringing up Sarah Huckabee-Sanders and Kelly Anne…",
  "data/reddit-changemyview/r/changemyview/comments/l3ibi9/cmv_sex_is_binary_like_humans_are_bipedal.json": "I strongly support transgender and nonbinary rights. I've debated with TERFs\n[https://en.wikipedia.org/wiki/TERF] and transphobes too many times in defense\nof trans/nonbinary rights. However, I have a stuck point: I believe sex is\nbinary. Please note: I'm well aware of the existence of various…",
  "data/reddit-changemyview/r/changemyview/comments/l3j4sy/cmv_tucker_carlson_is_the_gateway_drug_to_alex.json": "Tucker Carlson's ability to lie with conviction on national TV is the reason\nthat ~50% of the US is living in a different and very dangerous reality. His\nentire show is pseudo-intellectual bullshit that preys on the elderly and\nuneducated.\n\nThe spoken word has power over people. This has been proven…",
  "data/reddit-changemyview/r/changemyview/comments/l3k2ze/cmv_transgender_women_should_not_be_allowed_to.json": "I want to start by saying I do not intend to be transphobic. I think it’s\nwonderful laws are finally acknowledging transgender persons as a protected\nclass. Sports seems to be the exception—partially because it brings up issues of\nsex rather than gender.\n\nMy granddaughter is a swimmer and was 14th…",
  "data/reddit-changemyview/r/changemyview/comments/l3o5m1/cmv_classes_focused_on_critical_thinking_the_laws.json": "Many school teachers claim that their goal, beyond teaching a particular subject\nmatter, is to teach their students to think critically and be able to process\ninformation, but I think they have forgotten the basic building blocks of being\nable to do that.\n\nAs humans we have a bunch of natural biases…",
  "data/reddit-changemyview/r/changemyview/comments/l3qvns/cmv_if_stealthing_is_considered_rape_lying_about.json": "So let’s say a woman and a man both consent to have protected sex. The woman\nputs on an internal condom and they go at it. If the woman takes out her\ncondom... stealthily, without letting her partner know and continues to have\nsex, there are those who say that is rape or a form of sexual assault.…",
  "data/reddit-changemyview/r/changemyview/comments/l3zwco/cmv_nobody_can_truly_call_the_ira_terrorists.json": "First off, I am Irish and do not condone the murder of innocent lives in any\ncircumstance. What I am saying is that you cannot call the IRA terrorists while\ncalling the British army an \"army\". They both murdered hundreds of innocent\npeople throughout the troubles. The British funded Loyalist…",
  "data/reddit-changemyview/r/changemyview/comments/l42vee/cmv_the_power_that_corporations_have_to_silence.json": "Admittedly, this is near to Trump and Parler being almost completely removed\nfrom the internet in a meaningful way. But let me start off by saying I don't\nsupport Trump, and I don't support hate speech at all. I'm not entirely clear of\nthe full situation, but as I understand it most users on Parler…",
  "data/reddit-changemyview/r/changemyview/comments/l43a16/cmv_shaming_is_an_ineffective_tool_in.json": "To start, we are deeply social animals and group-belonging is an essential part\nof human psychology.\n\nShaming is effectively \"You don't belong to my group if you act or believe as\nyou do.\" which might be effective if you the person being shamed had no where to\ngo.\n\nHowever, particularly in this day…",
  "data/reddit-changemyview/r/changemyview/comments/l46v5j/cmv_right_wing_policy_paved_the_way_for_big_tech.json": "Citizens United is one clear example of this. It was passed by majority\nconservative justices, celebrated by Republicans, and derided by Democrats. It\nbasically gives corporations unlimited political influence. We are seeing this\nplay out on social media very clearly. Big companies that can afford…",
  "data/reddit-changemyview/r/changemyview/comments/l48yrw/cmv_it_makes_more_sense_to_eat_toast_upside_down.json": "Ok, buckle up beefcakes cause this has been argument numero uno in my house\ntoday. Every weekend I spend maybe 30 min to 1hr whipping up a sweet breakfast –\neggs, bacon, hashbrowns… toast. Yes, buttered toast. This morning, I’m boutta\ndig into my meal when I pick up that sweet golden crispy piece of…",
  "data/reddit-changemyview/r/changemyview/comments/l4bjqd/cmv_all_drugs_should_be_legal.json": "No body should have the right to tell adults what substances they can and cannot\nuse.\n\nThe drugs that are deemed acceptable by society aren't necessarily safer than\nthose that aren't. For example, Alchool is much worse than Khat.\n\nEven if a drug is extremely dangerous and can kill you, as long as…",
  "data/reddit-changemyview/r/changemyview/comments/l4bt8m/cmv_ronald_reagan_was_just_a_selfish_pig_and_does.json": "I’ll admit that I wasn’t around in the 80’s to, I guess, truly experience what\ngave him the respect he’s gotten to this day (though not by everyone, of\ncourse).\n\nWhat I have seen, however, involved a massive shift in government activities and\nsociopolitical standpoints that continue to falter our…",
  "data/reddit-changemyview/r/changemyview/comments/l4d6cj/cmv_polygamy_should_be_legal.json": "I'm a serial monogamist and I really don't see the interest in polygamy. That\nbeing said I really don't understand why it's illegal to marry more than one\nperson. From what I've read (maybe I'm missing something) people keep talking\nabout \"harm to society\" and \"harm to the institution of monogamous…",
  "data/reddit-changemyview/r/changemyview/comments/l4ilxy/cmv_cancel_culture_regarding_historical_figures.json": "This CMV post is inspired by this opinion piece\n[https://www.washingtonpost.com/opinions/2021/01/05/jj-mccullough-canada-history-conservatives-residential-schools-erin-otoole/]\nby pundit (and political science graduate\n[https://www.linkedin.com/in/jjmccullough/?originalSubdomain=ca])…",
  "data/reddit-changemyview/r/changemyview/comments/l4qcp2/cmv_the_constant_demonizing_of_political_parties.json": "I think we’ve all noticed how polarized politics, especially in the US but\naround the world as well, have become in the last 10-20 years. This coincides\nwith the meteoric rise of technology and social media. That is no accident and\nis a direct result of social media taking over the world of…",
  "data/reddit-changemyview/r/changemyview/comments/l4rfc1/cmv_statues_of_bad_people_should_not_be_destroyed.json": "I am of the opinion that statues of bad people, or people, who by today's moral\nstandards, did bad things should not be destroyed and that people who do so\nshould be charged with vandalism. Too often do I see the reasoning that it is\nbecause the bad things happened to my ancestors I have the right…",
  "data/reddit-changemyview/r/changemyview/comments/l4t5hz/cmv_purity_culture_is_damaging_and_manipulative.json": "My wife and I both grew up in Christian homes. Her family was much more\nconservative than mine, but we were still raised in the Christian belief of\nwaiting till marriage. (We didn’t. Thank God). Our church also had some Sunday\nschool classes for high schoolers on being ‘pure’.\n\nWe now have a…",
  "data/reddit-changemyview/r/changemyview/comments/l4um8o/cmv_the_president_has_far_too_much_power.json": "The purpose of the President, or the executive branch in general, is to execute\nthe laws and bills passed by congress. What that says to me, is that he’s just\nhere to make sure what’s been decided gets done. The power of the President to\npardon people is absolutely appalling to me. We have a justice…",
  "data/reddit-changemyview/r/changemyview/comments/l4vbid/cmv_the_western_lefts_current_obsession_with.json": "EDIT: I wanted to add an example of what I’m talking about, from a comment down\nbelow.\n\nConsider Steven Pinker; not on the political right at all, by any stretch of the\nimagination; a scientist, a humanitarian, has spent his career advocating for\nwomen and PoC to get into the sciences... but he…",
  "data/reddit-changemyview/r/changemyview/comments/l55lbl/cmv_all_characters_should_eventually_enter_the.json": "Copyrighted works rarely enter the public domain anymore. I understand that it's\nimportant to protect intellectual property but I see no reason why characters\nlike Mickey Mouse and Snoopy and still copyrighted/trademarked. You can't sell a\nsingle thing related to them without committing copyright…",
  "data/reddit-changemyview/r/changemyview/comments/l56mge/cmv_a_relationship_should_feel_like_marriage.json": "Correct me if I'm wrong, debate me if you believe elsewise, or just give me your\nopinion if you'd like.\n\nI believe that a relationship should be similar to a marriage before marriage is\nconsidered. I dont believe there should be a bunch of changes planned for how\nyou treat your partner once you are…",
  "data/reddit-changemyview/r/changemyview/comments/l5bp9e/cmv_the_time_has_come_for_social_networks_to_be.json": "As we see rampant growth and persistence of bizarre conspiracy theories\n(anti-vax, flat earhers, QAnon etc) which have harmful effects on society, and\nthe negative psychological effects of even normal use of social networks (eg,\nanxiety and depression for teenagers, addiction to likes etc) the time…",
  "data/reddit-changemyview/r/changemyview/comments/l5derx/cmv_the_stock_market_is_hardly_a_step_above.json": "I’m a layman when it comes to the world of Wall Street, but my current\ndisposition from the outside looking in includes several criticisms. I know\nthere are plenty more knowledgeable people on the subject around so here are my\npoints of contention:\n\n 1. Reliability of success - How is the stock…",
  "data/reddit-changemyview/r/changemyview/comments/l5lmro/cmv_that_opposing_and_criticising_israel_isnt.json": "If you were to criticise any other country you wouldn’t be accused of being a\nbigot, however when it comes to Israel there is this really odd notion that any\ncriticism or opposition to Israel as a whole let alone how they’ve handled the\nGaza situation, is based in antisemitism.\n\nUnless you’re saying…",
  "data/reddit-changemyview/r/changemyview/comments/l5qar5/cmv_saying_the_trump_impeachment_trial_is.json": "Basically what the title says.\n\nIf Republicans want to start impeaching Jimmy Carter or whatever, they need to\nstop their childish antics and actually govern using logic\n\nSince impeachment proceedings began in a timely manner following the impeachable\noffense AND apply during the time the president…",
  "data/reddit-changemyview/r/changemyview/comments/l5rzwx/cmv_educate_yourself_means_the_exact_opposite.json": "In nearly all cases, when someone says \"educate yourself\" they actually mean\n\"read a bunch of extremely biased sources until you you've become indoctrinated\ninto believing in my ideology.\" This is the case for a wide variety of\ngroup-thinks be it flat earthers, QAnon, anti-vax, BLM, critical…",
  "data/reddit-changemyview/r/changemyview/comments/l5ub37/cmv_if_the_people_at_rwallstreetbets_can.json": "The good people of r/wallstreetbets [/r/wallstreetbets] are, at the best of\ntimes, a group of people colluding to invest their money in ways that maximize\nprofits to everyone in the group. In other words, they’re a hedge fund. Between\nthem, they realized that they have control of enough assets to…",
  "data/reddit-changemyview/r/changemyview/comments/l64pw7/cmv_reducing_student_loan_debt_isnt_the_solution.json": "It may work in the short term, but in the long run, reducing costs of attending\ncollege is the best solution. Why? Because the higher the costs of attending,\nthe more students will have to borrow. In the coming years, college costs are\nexpected to continue to rise to a point where the average amount…",
  "data/reddit-changemyview/r/changemyview/comments/l6i31x/cmv_tax_the_rich_up_to_their_eyeballs_in_the_us.json": "Top marginal rates were 94.6% under Republican Eisenhower and even then no one\nactually paid anything close to that. Reagan and the Republicans knocked down\nthe top rate from around 70% to around 50% and Clinton/Bush/Trump knocked it\neven lower to around 37.5% to as low as 25% for the top…",
  "data/reddit-changemyview/r/changemyview/comments/l6yisl/cmv_america_is_an_oligarchy_and_things_only.json": "Average Americans have a negligible impact on legislation passed regardless of\nthe amount of popular support while gigantic corporations and those controlling\nthem have interests that government action aligns stupid closely with, the ultra\nrich can do whatever they want without consequences, and if…",
  "data/reddit-changemyview/r/changemyview/comments/l73jqj/cmv_webgirls_selling_nudes_and_offering_web.json": "I am not using the word sex worker in a pejorative sense. I mean it literally,\nany girl who chooses to be onlyfans or other web based platform for the purposes\nof satisfying someone’s sexual fantasy for monetary exchange is a sex worker.\n\nIt’s not easy to make a living these days and I don’t hold…",
  "data/reddit-changemyview/r/changemyview/comments/l74puh/cmv_as_far_as_i_can_tell_fahrenheit_451_is_less.json": "As the saying goes, all forms of government are bad, democracy is just the best\none we've got.\n\nWhenever I see people talking about warnings against government power, I see two\nnovels come up: 1984, and Fahrenheit 451. I take issue with the latter, and as I\nread more and more of F. 451, I become…",
  "data/reddit-changemyview/r/changemyview/comments/l7l326/cmv_religion_has_not_had_a_net_positive_impact_on.json": "I believe that at best, religion has had a neutral impact on human history, but\nmore likely, it has had a negative impact. Quick note, I know ‘good’ and ‘bad’\ncan be subjective, but will use them here for the sake of readability and\ngeneral clarity. Also, while I fully understand that removing…",
  "data/reddit-changemyview/r/changemyview/comments/l7pk2z/cmv_the_gamestonks_uprising_is_a_perfect_example.json": "Some hedge funds massively overplayed their hand and exposed themselves to tens\nof billions of dollars of risk.\n\nSure, the company might not be worth $1000 per share, but the market (with the\nhelp of some internet idiots) has decided that these shares are worth owning\nbased on the chance to make big…",
  "data/reddit-changemyview/r/changemyview/comments/l7vkd3/cmv_in_certain_forms_of_motorsport_the.json": "These motorsports aren't very technical. Drag racing and land speed racing is go\nin a straight line as fast as you can. It's when motorsports start to have\ncorners in them that the required skill to compete becomes higher. At least in\ndrifting, autocross, rally and endurance racing, there's a big…",
  "data/reddit-changemyview/r/changemyview/comments/l8otbe/cmv_if_police_officers_are_to_be_armed_then_cases.json": "My rationale is simple: innocent until proven guilty. My proposal may sound like\na blatant contradiction of this principle but I hope to illustrate why I don't\nbelieve it is.\n\nIn a criminal trial, the burden of proof lies on the prosecution to demonstrate\nbeyond all reasonable doubt that the…",
  "data/reddit-changemyview/r/changemyview/comments/l9e4p2/cmv_we_should_be_embracing_automation_to_replace.json": "For starters, automation still provides jobs to install, fix and maintain\nsoftware and robotic systems, it’s not like they’re completely removing\navailable jobs.\n\nIt’s pretty basic cyclical economics, having a combination of a greater supply\nof products from enhanced robotics and having higher…"
}