{
  "data/reddit-books/r/books/comments/l9np2v/just_finished_the_starless_sea.json": "And I can’t stop thinking about it. The last third of the book turned so surreal\nand beautiful I couldn’t put it down. I understand some people’s criticism, that\nthere was a lot left unanswered. However I enjoyed the fact that Erin\nMorgenstern left a lot of the meaning of everything up to…",
  "data/reddit-books/r/books/comments/l9t5ez/a_personal_take_on_a_wizard_of_earthsea_by_ursula.json": "What a read. This is such a beautifully written book. I am familiar with the\nmore science fiction works by Le Guin (Hainish Cycle) and this was my first\nventure into her take on fantasy, so I wasn't sure what to expect.\n\nFirst of all, this is a very simple story. This isn't a book about magic…",
  "data/reddit-books/r/books/comments/la79r9/mother_night_is_one_of_the_best_books_ive_read.json": "There may be spoilers. And sorry if any formatting issues, on mobile and not too\nsavvy with paragraph breaks on Reddit.\n\nI cannot believe how much I enjoyed Mother Night by Vonnegut, and how I haven’t\nread it until recently. I’m wondering what some of your thoughts are concerning\nCampbell Jr., as a…",
  "data/reddit-books/r/books/comments/laa0s5/booktubers_hope_this_channel_is_the_right_place.json": "(Sorry for my bad english in advance)\n\nI love to use Youtube as a source for discovering books. I have a few channels I\nfollow that mostly talk about books within the genres I like. But I really find\nit hard to find booktubers that doesn’t only talk about YA books. There’s\nNOTHING wrong with YA and…",
  "data/reddit-books/r/books/comments/lal0sl/i_just_finished_s_e_hiltons_the_outsiders.json": "PLEASE IGNORE THE MISSPELLING OF THE AUTHORS NAME!\n\nNow that, that is a goddamn novel! I genuinely struggled to put it down, I\nrefused to do anything until I finished my chapter and then when I did, I’d move\nonto the next and blitz through that one too, and then...well, you get the\npicture.\n\nThis is…",
  "data/reddit-books/r/books/comments/laqc6l/do_you_also_have_to_recover_from_a_book_before.json": "When I finish a really good book, I will 'quit' reading for a while. My brain is\nlike:\"Hey buddy, let's not start the next one now. Let's wait a little.\"\n\nI feel like I have to recover. So many things go trough my mind about that book\nthat if I would start another one, I just wouldn't be interested…",
  "data/reddit-books/r/books/comments/layhpt/am_i_a_bad_reader.json": "After every book I read, I always go to goodreads or here to see opinions. Then\nI see interpretations of the book that are far broader than mine, that the book\nis far richer than I realised. Somehow many of the underlying motives completely\nmiss me, and I feel gulty for not fully comprehending the…",
  "data/reddit-books/r/books/comments/lb4sn7/grrm_i_wrote_hundreds_and_hundreds_of_pages_for.json": "He still says there are a couple hundred more to go before the book is finished\nand brought to a satisfying conclusion:\n\n> I wrote hundreds and hundreds of pages of THE WINDS OF WINTER in 2020. The\n> best year I’ve had on WOW since I began it. Why? I don’t know. Maybe the\n> isolation. Or maybe I…",
  "data/reddit-books/r/books/comments/lbbwp7/just_finished_the_martian_by_andy_weir.json": "I absolutely adored this book. I am a huge fan of Michael Crichton, and this\ngave me very similar vibes. The attention to scientific detail and humor is\neverything. I loved how much detail was provided when Mark Watney solved\nproblems, and how he used a realistic tone to explain how he was feeling.…",
  "data/reddit-books/r/books/comments/lbeq51/i_recently_finished_the_count_of_monte_cristo_i.json": "My Kindle has a \"vocabulary builder\" function that saves words I've looked up\nthe definition for. Many of them are words I'd had a somewhat hazy understanding\nof already, but a surprising number are ones I don't recall encountering before.\nMaybe I need to read more classics :)\n\n \n\nRandom interesting…",
  "data/reddit-books/r/books/comments/lbpxp6/a_battered_book_from_someone_you_love_is.json": "My fiancé just brought home the Sandman omnibus volumes 1 and 2. I haven’t had a\nfull set of the sandman comics since before my ex, and this is one of the best\ngifts fiancé could have given me.\n\nHe was worried I would be upset that the volumes are pretty beat up. He works at\na library and both…",
  "data/reddit-books/r/books/comments/lcc3m6/to_read_more_was_my_new_years_resolution_so_far.json": "Like a lot of people on here, I enjoyed reading as a kid but didn’t stick with\nit when high school got busy. I decided to start it up again as a freshman in\ncollege. It’s only a start but compared to my complete absence of reading last\nyear, I’m happy. This subreddit continues to motivate and offer…",
  "data/reddit-books/r/books/comments/lcco0z/reading_is_getting_me_through_the_pandemic.json": "This has probably been said a hundred times before, but it’s 2 in the morning,\nI’m feeling sad, and I needed to say something.\n\nI’ve always been a reader, but during the pandemic I’ve been reading a lot more.\nIt’s helped me so much, and without this love of mine this pandemic would have\nbeen a lot…",
  "data/reddit-books/r/books/comments/lcd9ba/second_hand_book_stores_are_the_best.json": "You can’t beat it. It’s so easy to purchase books online and get them at your\ndoor within a few days. Sometimes that’s our only option (especially in these\ntimes), but I’d still happily spend my time roaming around a second hand book\nstore.\n\nThe atmosphere just hits differently too. You might not…",
  "data/reddit-books/r/books/comments/lcn0b6/wow_the_midnight_library_is_a_treasure.json": "I finished this book as I sat at the car dealership and I found myself tearing\nup. I probably would have had wet stuff on my cheeks had I been home reading,\nbut between my glasses and my mask I held back. It's simply a beautiful tale of\na woman who is certain her life means nothing to anyone she…",
  "data/reddit-books/r/books/comments/lcq24s/have_just_finished_finnegans_wake_by_james_joyce.json": "Holy hell, it took me 7 months and so many hours. With reading 628 pages of core\ntexts I've read 1700-2000 pages of side materials. And all I can give you here\nis small tips of all kinds:\n- Joyce by Ellmann is THE only obligatory side book here. Helped me so much.\n- I prefer Campbell as \"key\" book…",
  "data/reddit-books/r/books/comments/ld27x4/well_folks_agatha_christie_did_it_again_i_am.json": "I just finished And Then There Were None.\n\nAgatha Christie really did that. She really had me there at the end, I will not\nlie. I have never audibly gasped while reading a book until tonight. It is now 2\nhours past my bedtime because I couldn’t put this book down. Now I’m here\nbecause I feel a…",
  "data/reddit-books/r/books/comments/ld2t33/i_just_wanted_to_get_this_off_my_chest_i_hate_how.json": "I have biked around my neighborhood so many times and never found a single\nbookstore. There's not even a library here except in schools, and when there's a\nlibrary it's treated like a place to babble with your friends. If you see\nsomeone say, \"I like reading books\" it's mostly girls who are obsessed…",
  "data/reddit-books/r/books/comments/ldbzg6/started_in_on_don_quixote.json": "And holy crap. This is hilarious.\n\nI've known about this novel for several years now. Just never had much of a\ndesire to read it. But I found it (and several other classics) free on Google\nPlay - so I downloaded it.\n\nI'm only a literal handful of pages in - and looking forward to the next…",
  "data/reddit-books/r/books/comments/ldhid5/has_anyone_else_lost_the_stamina_to_read_during.json": "Ever since the beginning of COVID, I feel like I've lost all energy and interest\nin the things I used to love, including books and reading. My entire life has\nbeen rooted in a love for books. Get this: I'm a librarian and an English\nliterature professor. Not being able to read anymore is giving me…",
  "data/reddit-books/r/books/comments/ldrcnt/high_schoolers_just_do_the_assigned_reading.json": "We know it feels like work. We know you think the story is boring. It doesn’t\nmatter which story the teacher would have picked, you’d still think that. We\njust want to teach you how to be a better person, with the skills to be critical\nand discerning in a world that demands it more and more. Just do…",
  "data/reddit-books/r/books/comments/ldsw3h/i_wish_there_was_more_nonmedieval_high_fantasy.json": "There seems to be so many fantasy stories these days and that's not a bad thing\nbut I have notice that a lot of them seem to take place in medieval times or in\nan medieval like setting, or at least the stories that get the most attention.\nNot that I'm complaining, I understand familiarity is an…",
  "data/reddit-books/r/books/comments/lefgpi/frankenstein_by_mary_shelley.json": "I finally finished Frankenstein. I’ve been wanting to read this for years. I’m\nnot going to lie, this was a hard read. Not because I couldn’t understand it,\nit’s because it’s in what I like to call “old English”... words that are long\nforgotten or sentence structures that we don’t use…",
  "data/reddit-books/r/books/comments/lefmd3/tolkien_versus_martin.json": "Having read both Lord of the Rings and A Song of Ice and Fire, I believe\nTolkien's mastery of rhetoric and linguistic construction far outshines that of\nMartin's. Tolkein's utilization of foreshadowing, symbolism, character\njuxtaposition, etc. are more subtle, nuanced and effective. Toe to toe…",
  "data/reddit-books/r/books/comments/legk7x/im_never_going_to_emotionally_recover_from_the.json": "Everything about the book, from the way the entire story of Achilles and\nPatroclus has been retold to the way Miller has weaved each word together to\npunch you right in the gut, twist it around and then leave you to weep for days\nhas been chief's kiss perfect. It was everything I had hoped for and…",
  "data/reddit-books/r/books/comments/leht66/i_cant_break_the_inner_monologue_in_my_head_and.json": "I can read perfectly out loud, better than others I feel. But, when it comes to\nreading in my head, I read every single word in either the characters voice, or\nmy voice. If I try to speed up it literally sounds like they or I am speaking\nquite frantically. If I skim over the words without reading…",
  "data/reddit-books/r/books/comments/lenks4/the_midnight_library_left_me_sobbing_like_a.json": "I'm not really the type of guy to read a lot of books or get too attached with\nthe characters, mainly because I forget parts of the books after a while of not\nreading.\n\nHowever, let me tell you that I will never forget the effect that this book has\nhad to me. I'm quite sensitive in my nature and I…",
  "data/reddit-books/r/books/comments/leo63l/my_child_became_alive_again_after_holding.json": "My children miss going to the library. They miss going in and having the freedom\nto browse and choose their own books. I suspect many other children are the same\nway...extremely tactile and visual. At this time, our library is only providing\npick up service. It has been at least 5 months since I've…",
  "data/reddit-books/r/books/comments/letnig/i_just_read_lotr_for_the_first_time_and_i_enjoyed.json": "I know the descriptions can be a bit long in parts but the world building and\nstory telling more than make up for it. I would have liked to see a bit more of\nTom Bombadil and maybe a bit less of the singing. Aside from that I have nothing\nnegative to say. I feel like it is a very well written book…",
  "data/reddit-books/r/books/comments/lev0d7/is_there_an_alternative_to_goodreads_from_well.json": "I know, I know, I'm an awful snob. It's just it feels like a system\npredominantly geared towards the lowest common denominator (which makes sense\ngiven that it's owned by Amazon).\n\nAnything that dares attempt to be the remotest bit literary gets shunned as\npretentious, while every genre and YA novel…",
  "data/reddit-books/r/books/comments/lev9jm/my_wife_and_i_independently_own_the_same_1965.json": "My wife and I are working on consolidating our book collection and we came\nacross the 1965 Book club edition of Dune. We can't find any major differences\nbetween the 2 novels, except for the hardcover. Mine is a bright red and hers is\na maroon/grey cover.\n\nIs it common for the same edition of a…",
  "data/reddit-books/r/books/comments/lfctle/what_are_your_most_unpopular_book_opinions.json": "I’ll go first. I prefer my Kindle to the point that I’ll download a book on my\nKindle even if we already own the hard copy. A Little Life was ok but not great\nand did not make me cry. I did not finish Circe by Madeline Miller because it\nwas boring.\n\nHow about you? What are your unpopular book…",
  "data/reddit-books/r/books/comments/lfiisi/other_people_reads_300_000_words_in_one_night_me.json": "I cannot understand how fast/focused people can be at reading, I wish I was like\nthat! I'm a slow reader I always have been, a 100,000 word books takes me a\nmonth to finish, and I always see people reading 3x that in only a day. How? I'm\nso jealous, I have piles of books waiting to be read, but…",
  "data/reddit-books/r/books/comments/lfpkbn/the_book_thief.json": "I just finished The Book Thief and it might rank in my top 10 books. It was so\nwell written. I loved that it was narrarated by death in nazi Germany. The\ncharacters were so well rounded and all had wonderful arcs. The end was terribly\nsad but was redeemed by Max and Liezels ending. Which is how I…",
  "data/reddit-books/r/books/comments/lg0vd1/a_great_introduction_to_greek_mythology.json": "Yesterday I finished reading Mythos by Stephen Fry. I (18/f) have always been\ninterested in the idea of learning about the Greek myths, but never really knew\nwhere to start. Most books on the topic seemed a bit daunting, but I believe\nthat Fry has provided a perfect first read. No prior knowledge or…",
  "data/reddit-books/r/books/comments/lg77aa/we_are_the_writer_and_illustrator_of_a_new.json": "Hi there! We're Kendra Wells and Sam Maggs, and we co-created a new graphic\nnovel called TELL NO TALES: PIRATES OF THE SOUTHERN SEAS, out today with Amulet!\nThe book itself:\n\n * is based on the real-life eighteenth-century pirates Anne Bonny and Mary Read\n * is a swashbuckling adventure with swords…",
  "data/reddit-books/r/books/comments/lg7ojo/is_it_silly_to_keep_reading_the_same_book_over.json": "I finished reading the Lord of the Rings on December 30th. I have just begun\nreading it again because i love Tolkien so much that my brain is addicted to his\nwriting.\n\n\n\nWhenever i read LotR, i feel at peace with myself. Even though i ami an atheist\nand Tolkien was Catholic, reading his books gives…",
  "data/reddit-books/r/books/comments/lgcqs7/what_was_the_book_that_rekindled_your_love_for.json": "For me, oddly enough, it was Dante's Inferno.\n\nI had this goofy call-center job that had a lot of downtime in evenings. I\neventually installed the kindle desktop reader and bought Dante's Inferno. Would\noften have 10-20 minutes in between calls and realized the time flew by when I\nwas absorbed in…",
  "data/reddit-books/r/books/comments/lgdg6u/finished_1984_for_first_time_my_head_is_spinning.json": "After seeing and hearing so many people reference 1984 in regards to “the world\nwe are living in”, I figured I should give it a read and compare the world to\nthe source material.\n\nHaving finished less than 24 hours ago, I am still struggling to wrap my head\naround some of the topics, but overall…",
  "data/reddit-books/r/books/comments/lgjzrr/flowers_for_algernon_proved_im_not_heartless.json": "This is a book I have planned to read since I was young, I am now twenty three\nand damn was this an emotional rollercoaster... I seriously think this may be\nthe most heartbroken I have ever felt since reading a book. It's currently\n2.30am in England right now and I am struggling to sleep because all…",
  "data/reddit-books/r/books/comments/lgk96p/how_was_alexander_solzhenitsyns_one_day_in_the.json": "This semester I’m taking a class which is called “the history of Russia from\n1900 forward,” and in that class we have to read a couple of pieces of Soviet\nliterature, one of them being Ivan Denisovich. I’m about half way through with\nit right now, and I guess I just don’t understand why the Soviet…",
  "data/reddit-books/r/books/comments/lh1rhj/im_paul_tremblay_horror_writer_who_once_upon_a.json": "Hey, there.\n\nTo celebrate my first novel THE LITTLE SLEEP making its way back to bookstores,\nlet’s talk about the book, my long-ish road to publication and re-publication,\ncrime and horror fiction (Is there overlap? How are they related? How are they\ndifferent? Why do you like parentheticals?)\n\nI am…",
  "data/reddit-books/r/books/comments/lh8k1g/to_ereader_enthusiasts_im_sorry_i_doubted_you.json": "For years, I was adamant that I would only read physical books. I like the feel,\nthe look, the smell of books. I've always hated reading on my laptop, because\nthe display is so harsh, and I've only ever done it to avoid paying for\nexpensive phsyical textbooks. For all my protests against the digital…",
  "data/reddit-books/r/books/comments/lhfgp7/discworld.json": "I only started reading Discworld after Sir Terry and his will said all\nunfinished books on his hard drive must be run over with a steam roller. I\nthought. That's my kinda writer. I am hooked. My first book was the Truth, then\nequal rites then a couple of the watch books then circled back to read 1,…",
  "data/reddit-books/r/books/comments/lhgszq/pillars_of_the_earth_is_an_amazinggg_book.json": "I feel like no one really talks about the pillars of the earth when talking\nabout great books but it is the best book I ever read. From start to finish it\nis captivating and an easy flow. The characters are so well done with so much\ndepth. The storytelling is next level and amazing. Highly recommend",
  "data/reddit-books/r/books/comments/lhhtyh/atlas_shrugged_is_a_terrible_book.json": "I've noted this many times before: I've played Bioshock\n[https://en.wikipedia.org/wiki/BioShock] which I've found amazing and heard it\nwas based on Atlas Shrugged [https://en.wikipedia.org/wiki/Atlas_Shrugged].\n\"Wow\", I though, \"this AMAZING game is based on a book, must be doubly amazing,\nI must…",
  "data/reddit-books/r/books/comments/lhrily/i_dont_know_if_anyone_else_can_relate.json": "but I have discovered one of the greatest disappointments in life is your book\nclub panning the book you chose for them to read. My selection for February was\nnot well received and I don’t know how I will ever come back from this haha.\nTell me your book club disappointment stories so I feel less…",
  "data/reddit-books/r/books/comments/li1cg9/i_regret_giving_books_away.json": "I try to give my books away to people I think would appreciate and read them,\nbut man, now I wish I had kept some of them because I want to read them again.\n\nSpecifically my copy of No Country For Old Men I gave to a friend who had lost\nhis copy. So now I find myself scouring the shelves of used…",
  "data/reddit-books/r/books/comments/li4t5l/do_you_guys_read_in_another_language.json": "So i'm not a native english speaker and recently i decided to start reading sth\nin english as to learn a bit more and improve my vocabulary (I chose the GoT\nseries) and I wanted to know if u guys do the same with any other language in\norder to improve or with another purpose and if u find it very…",
  "data/reddit-books/r/books/comments/li8yco/pride_and_prejudice_is_a_marvel.json": "I started reading Pride and Prejudice last December, but discontinued. I started\nit again January with a goal to finish it before buying other books. When I am\nhalfway through the book, I can't keep it down. The book is that engaging.\n\nThe characterization of Darcy and Elizabeth, showing the faults…",
  "data/reddit-books/r/books/comments/lidbgt/a_letter_to_the_message_man_by_charles_allen.json": "For years now, I've told myself that I would branch out and find new things to\nread rather than just sticking with the Best Books list on GoodReads or Amazon's\nBest Sellers list. I'll admit that I rarely ever venture out of this scope.\nHowever, for 2021, I made it my goal to read things that are new…",
  "data/reddit-books/r/books/comments/lifo2x/i_had_forgotten_how_good_anna_karenina_is.json": "So when I was 15 I went through a phase and read a bunch of Dostoyevsky and\nTolstoy, and while I enjoyed myself and I'm definitely glad I did it, I think I\ncan safely say I didn't \"get\" much of what I was reading at the time.\n\nFast forward more than a decade later, rereading Anna Karenina as an…",
  "data/reddit-books/r/books/comments/lil68x/im_so_sick_and_tired_of_slogans_like_read_52.json": "These self-help gurus everywhere just keep screaming in your heads \"Start\nreading more books to become rich.\" or \"Every single billionaire out there reads\n52 books per year, one book per week, start reading, and you'll become like\nthem\". Who doesn't remember the infamous advertisement made by Tai…",
  "data/reddit-books/r/books/comments/linupz/all_quiet_on_the_western_front_wow.json": "I’m a huge history buff. I don’t know how I went through high school and college\nwithout having to read it.\n\nThe accounts of the war were absolutely horrifying and brutally honest.\n\nI think the most interesting thing about it being a historical fiction written\nby an actual WW1 vet is that there are…",
  "data/reddit-books/r/books/comments/lipzyc/have_you_ever_felt_like_your_reading_level_isnt.json": "So I'm about 160 pages into Blood Meridian by Cormac McCarthy and I'm genuinely\nloving it. It's beautifully written, has great characters, and is just a great\nbook so far, but dear lord it makes me feel dumb sometimes. I've lost count of\nhow many paragraphs I've had to reread just to try and…",
  "data/reddit-books/r/books/comments/lj5r7j/just_finished_all_the_light_we_cannot_see_by.json": "And I gotta say, this book was amazing. I’m a fairly slow reader, and together\nwith being in college it takes me a fair amount of time for me to finish books.\nI began reading this some time after Christmas, and had only gone through\n350/530 pages until yesterday. I finally got a break from school,…",
  "data/reddit-books/r/books/comments/lj60i7/things_fall_apart_by_chinua_achebe.json": "For me I not only rooted for the characters, hoped they can find love and hope,\nI also rooted for their land Umuofia as well. I wanted them to keep on living as\nthey are and I wanted them to make peace. But I know that could only happen in a\nperfect world. I felt nothing but anger, and then,…",
  "data/reddit-books/r/books/comments/ljfuep/sent_a_thank_you_to_an_author.json": "So I'm pretty sure it was on reddit I saw encouragement of readers to write\n(living) authors they enjoy to let them know.\n\nI've been doing that now for about a couple weeks. I don't read as much as I\nused to, kids yada yada covid no break, but I do subscribe to a short story\ncollection that is…",
  "data/reddit-books/r/books/comments/ljna6h/tips_for_bookworms_trying_to_avoid_amazon.json": "Hi all,\n\nI'm a very keen reader and I've been doing it a lot in lockdown, but I'm also\npretty lazy and with the shops shut I have been relying heavily on Amazon to get\nmy books from. I reckon they've got enough money to be going on with, so am\nlooking for good alternative places to buy and learn…",
  "data/reddit-books/r/books/comments/ljqync/readers_of_ulysses_do_you_remember_a_notable.json": "My partner has begun reading the book after putting it off for years, and I plan\nto when he's finished. He was just telling me about a university acquaintance\nthat he used to drink with occasionally, who was writing his master's thesis on\nJoyce. He was taking a course that focused solely on Ulysses,…",
  "data/reddit-books/r/books/comments/lju96h/the_stormlight_archive_series_is_incredible_no.json": "I've always been intimidated by the length of Brandon Sanderson's Stormlight\nArchive books, but I finally decided to dive in. Wow...I'm blown away. Some\nthings in particular that I've enjoyed so far:\n\n * It's so refreshing to read high fantasy that doesn't rely on gendered\n   violence. The main…",
  "data/reddit-books/r/books/comments/ljvdkw/why_is_asian_literature_so_underappreciated.json": "I've noticed in that whenever i start talking about asian literature people look\nat me weirdly and make comments like \"oh yeah those weird books aren't for me\"\nwhen asia (in my opinion) have one of the amazing authors of all time. When i\nwas doing research one literature degrees i couldn't find one…",
  "data/reddit-books/r/books/comments/ljwl6z/my_favorite_book_unbearable_lightness_of_being.json": "Hello! I decided to share an opinion on my favorite book cause I rarely see any\ndiscussion of it.\n\nI like the structure of it: as if someone tries to prove a point using anecdote\nexamples) That makes me connect with the author on a personal level - I also\nlike to start philosophical discussions out…",
  "data/reddit-books/r/books/comments/lk168u/new_valentines_day_tradition.json": "Needless to say, this years Valentine’s Day is very different from years past.\nWith Covid restrictions and overall lack of enthusiasm for the holiday, my wife\nand I immediately ruled out trying to go out to dinner somewhere and spend a\nbunch of money. We’re trying to build up our library and read…",
  "data/reddit-books/r/books/comments/lk5ncx/just_finished_my_first_book_outside_of_school.json": "I am a sophomore in high school and I have never really liked reading before. I\nalways felt that the books forced down my throat in school were always\nuninteresting, which made me not like books in general.\n\nFast forward to sometime last month, I set out to find a book that I found\ninteresting. I…",
  "data/reddit-books/r/books/comments/lk8pxo/read_30_books_in_the_year_2020_and_i_think_became.json": "My new years resolution for 2020 was to read as many books as possible and I\ngave myself 25 books as a target and when I finished 15 books by June I thought\nI will increase it to 30. I think this is the only new years resolution I\nmanaged to do properly. Anyway this subreddit played a major role in…",
  "data/reddit-books/r/books/comments/lk8td4/the_things_they_carried.json": "Can I just take a quick moment to gush about how good this book is? It’s so well\ndone, it makes me doubt any skill I may have as a writer. Like every now and\nthen when I’m trying to be deep, I remember the chapter where he says “But true\nwar is never really about war. It’s about sunlight. It’s about…",
  "data/reddit-books/r/books/comments/lkauvt/the_underland_chronicles_by_suzanne_collins_blew.json": "The books were just the right mix of things. They are so thrilling I couldn’t\nstop reading them. You feel yourself attached to certain characters, and the\nstories are not lacking twists and turns that make you wonder what will happen\nnext. These books are the best I’ve ever read and I recommend them…",
  "data/reddit-books/r/books/comments/lkb8o9/i_just_finished_the_giver_for_the_first_time_im.json": "I was an avid reader up until highschool. I fell out of love with it. I over\nthink things and after having to re read so many pages because my mind is\nsomewhere else I got discouraged and I think I became afraid of reading. Tonight\nI finished The Giver for the first time after my best friend…",
  "data/reddit-books/r/books/comments/lkbxm7/judging_a_book_by_its_cover_is_not_so_bad.json": "Yesterday I re-read one of my favourite books from my childhood and ended up\nfinding out that a lot of books I read as a kid had the same cover\nartist/illustrator (I was about to cry at this point).\n\nThis brought me to realise that buying a book only for its cover is not bad. As\nthe saying goes…",
  "data/reddit-books/r/books/comments/lkg1vn/what_do_you_consider_to_be_the_most_valuable_book.json": "Something I’ve been thinking about a lot recently has to do with the sheer\nmagnitude of published books out there. There’s so much to filter through and\nlet’s be honest, not everyone’s ideas are worth dedicating 400 pages to. There’s\ngot to be a way to collect a list of high value books to maximize…",
  "data/reddit-books/r/books/comments/lkzmii/books_taught_me_how_to_cry.json": "For about 10 years I just couldn't cry. Someone told me that it is normal for\nteenage boys to stop crying due to some hormone thing. I recently found out that\nthat was a myth, and wanted to learn how to do it again, to recover from the\ntrauma that stopped my tears. It was hard. I told myself it was…",
  "data/reddit-books/r/books/comments/ll31ze/goodbye_sub_ive_just_finished_flowers_for.json": "Not only did I finish it, but I finished it in a winter storm.. at 3 o’clock in\nthe morning. With no power.\n\nSo there was no screaming at my fellow bookish fiends, or this sub — couldn’t\neven scream into a pillow because I didn’t want to wake my family. My only\nchoice was to die internally.\n\nI know…",
  "data/reddit-books/r/books/comments/ll38xf/les_miserables_is_a_masterpiece_some_spoilers.json": "I am currently reading the book and I am amazed by it. I love all of it's\ntwists. I love how you find the same characters in different situations and\nplaces and you find out how they are connected in some way or another! Victor\nHugo is a genius!!! I really love the character Jean Valjean and…",
  "data/reddit-books/r/books/comments/ll480o/can_anyone_identify_the_books_in_this_list_of.json": "I've seen this list going around the internet a few times now, and it got me\nwondering, is it entirely satirical or is it based on real books? If so, can\nanyone work out what the books are?\n\nEDIT: I will add them as people come up with suggestions.\n\nhttps://the-toast.net/2015/06/11/things-women-in…",
  "data/reddit-books/r/books/comments/llgtsl/if_you_begin_a_book_review_with_i_dont_care_if.json": "... Especially if you follow it up with something along the lines of “I didn’t\nknow it was LGBT but I can see why some people who also didn’t know may not like\nthat.”\n\nFor those of you who sincerely don’t care, I’m just letting you know that those\nlines are often the talking points and starters of…",
  "data/reddit-books/r/books/comments/llrvhc/dont_read_crime_and_punishment_in_your_early_20s.json": "This sub has several posts about one of the best books of all time, but I'd like\nto add my observation with a personal anecdote.\n\nWhen I turned 21, the concept of Crime and Punishment excited me to the core! I\nordered the book and started reading with high anticipation. However, after just\nabout 50…",
  "data/reddit-books/r/books/comments/llsmze/i_tried_to_make_the_definitive_top_100_books_to.json": "\"So many books, so little time.\"\n\nThose are the first words people see when they enter into this subreddit. Those\nwords are also capable of overwhelming most readers with a sense of dread.\n\nGoogle estimates that nearly 130 million books have been published in modern\nhistory. 130 million! If the…",
  "data/reddit-books/r/books/comments/llu6e5/last_year_i_decided_to_give_audio_books_a_try_and.json": "I have dislexiya so as a child I found reading confusing and frustrating. This\nin turn made me avoid it as much as I could so my literacy sufferd too.\n\nWhen I was in my early teens I managed to read a couple of Terry Pratchet books\nthat my Grandad recommended but I was never hooked by them.\n\nI found…",
  "data/reddit-books/r/books/comments/lm0a6h/a_not_so_hot_take_on_top_100_books_to_read_lists.json": "I know I'm going to sound like a grump, so apologies for that, but it always\nannoys me that whenever someone comes out with a top 100 books to read, the\nbooks included are always narrow in their scope of origin.\n\nAccording to these lists 100 Years of Solitude is the only book you need to read\nfrom…",
  "data/reddit-books/r/books/comments/lm8vrt/dnfd_call_me_by_your_name_by_andre_aciman_i_dont.json": "I have not DNF'd a book in a long time, but I just did it. I DNF'd Call Me By\nYour Name by Andre Aciman. This book is so hyped everywhere I look and has a\n4.22 star rating on Goodreads. Honestly I don't know what I'm missing.\n\nI'm a setting reader. I love immersive and beautiful settings, so I was…",
  "data/reddit-books/r/books/comments/lmar9t/ulysses_and_the_gift_of_james_joyces_omnivocal.json": "I had remembered some of the episodes of ”Ulysses” by James Joyce because they\nare in “The Portrait of the Artist as a Young Man.” Perhaps it is age or my\ngrowing senility, but I had not remembered it being so amazing. Joyce has a kind\nof weird talent of being able to be all voices of all characters…",
  "data/reddit-books/r/books/comments/lmcnwc/catcher_in_the_rye_by_jd_salinger_really.json": "I'll start by saying that I have never liked the \"classic\" books. Pride and\nPrejudice, The Great Gatsby, A Tale of Two Cities, whenever I have tried reading\nthese books I could hardly even understand them let alone enjoy it. However, I\nwas recommended The Catcher in the Rye by a really good friend.…",
  "data/reddit-books/r/books/comments/lmjg8t/beijing_coma_by_ma_jian_left_me_speechless.json": "My first time posting here so please be kind.\n\nI don't know how well known this book is, I literally picked it off my local\nlibrary so here's what the book's about: The protagonist Dai Wei falls into a\ndeep coma after being shot at the Tiananmen Massacre 10 years earlier and you\nfollow his memories…",
  "data/reddit-books/r/books/comments/lmjt5j/after_taking_a_huge_break_from_reading_fiction_i.json": "I have lost my attention span to read bulky books and I feel I dont relate with\nthe plots of lots of books I normally used to.\n\nAfter going through a plethora of titles, I decided to buy a collection of\nclassical short stories without expecting much of of it. After about reading two\nor three…",
  "data/reddit-books/r/books/comments/lmohem/just_finished_reading_the_martian_wow.json": "I'd seen the movie before so was hesitant to read the book. Saw many\nposts/comments recommending it. Wow! Thank you fellow redditors for recommending\nthis.\n\nI loved the overall plot. Loved all the intricate ways in which he solves the\nproblems one after the other. But what I was unprepared for was…",
  "data/reddit-books/r/books/comments/lmvj4y/the_goodreads_rating_system_and_youtube_is_kinda.json": "When I was a lass I would just buy whatever books I found in bookstores that\nlooked interesting, read them, and give them a rating depending on how I felt\nwhen I was done.\n\nA few years ago I started watching Book Tube (YouTube for book content) and I\nloved it. I loved hearing other people talk about…",
  "data/reddit-books/r/books/comments/lmy57v/want_to_stop_being_happy_give_nordic_literature_a.json": "I'm a simple guy, I like my classics. Not that I never read modern books, but I\ntend not to choose them. The wife however, a student of nordic literature,\ninsisted I read a book series of Norwegian author Carl Frode Tiller. I have to\ntell you, this stuff is dark. I'm half way into the second book of…",
  "data/reddit-books/r/books/comments/ln2vk1/where_are_my_nonfiction_lovers_at.json": "Just like everyone else here, I love fiction, and the artistry of a good fiction\nread can be mind-blowing. But some nonfiction books have been really formative,\ntoo.\n\nIf you have a nonfiction book on any topic that you really want to geek out\nabout or was so interesting you just couldn't put it down…",
  "data/reddit-books/r/books/comments/ln5mj1/i_just_discovered_ted_chiang_and_blew_through.json": "When someone mentioned to me that the film Arrival (Amy Adams, Jeremy Renner)\nwas based on a short story, I was stoked to read it. And I was not disappointed.\nI loved \"Story of Your Life\" even more than the movie; I felt I learned so much\nabout language and communication, but it also explored heavy…",
  "data/reddit-books/r/books/comments/lniu7a/we_listen_to_audiobooks_we_read_books_both_are.json": "Honestly, if I listen to an audiobook I tell people I listened to the book. I\ndidn’t have the time to actually read the book so I listened to it. And\nlistening and reading isn’t the same. But why do so many feel the need to say\nthey “read” their audiobook?\n\nGuys, listening is not worse than reading …",
  "data/reddit-books/r/books/comments/lo3rug/as_an_avid_reader_but_with_a_distinct_lack_of.json": "So I tried my hand at audioable, and it was good.. Yet one book a month just\nisn't enough so here's my trick.\n\nWhat I did was download an app called Evie, it is a text to voice app and have\nquite a few voices to choose from.\n\nThen I can download ebooks and read it through the Evie app.\n\nMy job…",
  "data/reddit-books/r/books/comments/lo6t9r/if_you_could_pick_one_book_to_experience_for_the.json": "My best friend is 25 years old, and has been in prison since January 2020. She\nwent into prison having never read an entire novella, let alone a novel.\n\nShe phoned me about 8 months into her sentence telling me that she had just\nfinished reading her first ever novel (The Green Mile, which I think is…",
  "data/reddit-books/r/books/comments/loa6rm/if_you_havent_tried_an_audiobook_give_it_a_go.json": "I just wanted to give a quick story about how I got hooked on audiobooks which\nbrought back my love of 'reading' for anyone who this might help.\n\nI had heard about these audiobook things for a while but wasn't sure if I'd like\nthem or not. I rarely have time to just sit down and read an actual book,…",
  "data/reddit-books/r/books/comments/lobumy/i_just_finished_reading_my_first_book_in_10_years.json": "I've always struggled with reading my entire life. When it comes to\nentertainment, I much prefer video games, tv shows, or movies. I struggle to\never just sit down and read a book for longer than 10 minutes before stopping. I\nthink the last book I read from start to finish was in High School and for…",
  "data/reddit-books/r/books/comments/lofpjw/i_hope_at_least_1_person_who_sees_this_post_will.json": "It's around 2 am here and I just finished reading The Song of Achilles (I'm\ngonna use TSOA for convenience). I thought I should write this down before it's\ndiluted by a night's sleep. First off, I'm not a fan of love stories, and I try\nto stay away from them as much as possible. So I went into TSOA…",
  "data/reddit-books/r/books/comments/lorfhn/clichés_tropes_you_hate_the_most.json": "Basically what the title says. Especially if it’s overdone and often executed\npoorly - I’m planning to write some satire on this haha.\n\nMy least favorite tropes (most are from YA, but applies to other genres too)\nare:\n\n * Love triangles / squares / other polygons, usually with just one protagonist.\n…",
  "data/reddit-books/r/books/comments/lp4t1g/does_it_bother_you_when_you_finish_a_book_then.json": "It happens to me all the time. I finish a book, enjoy it thoroughly, think I\nlearned so much from it, but when I think back six months later, I realize I\nhardly remember anything from that book. Sometimes it feels like I didn't really\nfinish that book if I didn't truly digest it but I also know that…",
  "data/reddit-books/r/books/comments/lpak7k/just_because_you_dont_like_a_book_does_not_mean.json": "Even if I don’t particularly enjoy a certain book, I can overlook my own\njudgement and recognize that it’s well written. It’s just not my cup of tea. And\nthat’s okay.\n\nYou don’t have to feel bad about disliking a book because it’s a classic or\nbecause everyone else likes it. Don’t let people…",
  "data/reddit-books/r/books/comments/lq4b1l/getting_a_kindle_paperwhite_is_the_best_thing_ive.json": "At first, I only read books every now and then but with this Kindle Paperwhite,\nI am in love and use it every day. I love how compact it is and that I can carry\nmy entire library on one device with the sole purpose being for reading. It\ndoesn't strain my eyes and being able to change the font and…",
  "data/reddit-books/r/books/comments/lq55ln/do_you_prefer_keeping_your_books_in_pristine_as.json": "Well loved meaning, highlighting passages, underlining passages/words. Writing\nnotes in the margin, circling words, writing your name on the cover or page\nedges, drawing on the interior cover, dog earring your pages, cracking the\nspine, possibly even some water damage/stains etc.\n\nI’ve always been a…",
  "data/reddit-books/r/books/comments/lqdxa8/finished_hp_goblet_of_fire_at_3am.json": "Sooo I’ve been documenting my journey of reading Harry Potter for the first time\nin this subreddit. Again, love the art. Hate the artist.\n\nAND FUCK ME, the book is so different from the films. I LOVE IT. AND SHITS\nGETTING INTENSE MAN. I’m trying to read them as though I haven’t already seen\nthe…",
  "data/reddit-books/r/books/comments/lqolio/unpopular_opinions_time_i_hate_the_way_a_lot_of.json": "Whether it’s YA, adult, thriller, horror, or whatever else they all seem to\nsound the same. Not with plot but with writing style, they could have completely\ndifferent plots and authors and yet they sound all the same. It’s all really\nbasic detailed writing, like “as she sat there watching the clock…",
  "data/reddit-books/r/books/comments/lqshuv/just_finished_american_gods_by_neil_gaiman.json": "This book is awesome although, I got a little discouraged or frustrated with the\nway it was written. Sentences never seemed to end and Gaiman kept on adding\ndetails over details but in a weird twist, I think this is also one of the books\nstrongest aspects because the world felt that more real and…",
  "data/reddit-books/r/books/comments/lrfjvd/just_finished_the_book_thief_oh_boy.json": "What an absolute journey that book is, I found myself questioning why the book\nwas rated so highly half way through. I kept saying it was good, but was it that\ngood? But by the end I understood.\n\nThe characters, the love you feel for each and everyone of them, the tragic\nevents that happen to…",
  "data/reddit-books/r/books/comments/lrsy8i/rant_here_but_i_hate_when_books_use_movie_posters.json": "It's one of my biggest pet peeves. I love beautiful cover art on books and I\nhate to say I do judge a book by its cover. There's this book I want its a\nSwedish horror novel and every single copy I can find the cover is a still from\nthe movie adaption. I hate being this picky but when I know the…",
  "data/reddit-books/r/books/comments/lrzpar/ive_been_reading_the_wrong_way_all_this_time.json": "I'm sure this would be very obvious to most people but reading is much more\nenjoyable when you slow down and paint a picture in your mind. School\nconditioned me to strip away all the detail and home in on the main ideas and\nI'm just now unlearning that 10 years later!\n\nGot so excited about it I felt…",
  "data/reddit-books/r/books/comments/lsbirv/any_atheistsagnosticsnondevout_theists_here_who.json": "When I think of the Bible, the Quran or the like, I always imagine them being\nread in churches, mosques, or any place for spiritual congregation. Given that\nreligion has been historically used to oppress people, a growing number of\nanti-religious views is not surprising. So in effect, these books…",
  "data/reddit-books/r/books/comments/lscqsu/the_long_dark_teatime_of_the_soul.json": "I just completed Douglas Adams, \"The Long Dark Tea-Time of the Soul.\" I selected\nthe book from my local library purely because of the name attached to it. Adams\nwrote one of my all-time favorite book series, \"The Hitchhiker's Guide to the\nGalaxy,\" and I was /invigorated/. I was halfway through the…",
  "data/reddit-books/r/books/comments/lsmi9l/i_enjoy_pocket_sized_books_more_than_regular.json": "I’m a woman with pretty small hands and it’s always a pain to sit for hours and\nhours holding a giant book. It cramps my hands and wrists. I know I sound like a\nsissy but it does get hard after awhile. They’re also easier to travel with,\ncheaper to purchase, and more comfortable.\n\nI just have a…",
  "data/reddit-books/r/books/comments/lsuuib/do_you_ever_get_postbook_depressed.json": "I have this thing sometimes, after I finish a long book, or a book that I\nparticularly got caught in. Basically I just feel like I don't have much more to\ndo, as if my life doesn't have a meaning anymore. Generally, it feels just sad\nand empty without the book I've just read.\n\nI am having this…",
  "data/reddit-books/r/books/comments/lt01i9/influence_of_negative_reviews.json": "Does it ever happen to anyone, like you started reading a book and you are\nhalfway there. You're so impressed with it, you want to see how others love it.\nSo you check out Goodreads and find some negative reviews and read it, they\npoint out some of the things you didn't consider before, now you are…",
  "data/reddit-books/r/books/comments/lt12ex/really_enjoying_pillars_of_the_earth.json": "So I purchased this book on a whim in a thrift store. I only recall hearing\nabout it when I was a kid, and purposely didn't read the back summary. So stoked\nI did.\n\nI'm normally a hard scifi, fantasy, etc type of guy, but this book opened a\nwhole other amazing world. I think it's technically…",
  "data/reddit-books/r/books/comments/lt20l1/you_cannot_imagine_the_relief_i_feel_with_my.json": "As an avid walker and reader who lives near Powell's in Portland, I used to\nregularly browse through that book store multiple times a week. There are plenty\nof other decent bookstores in the city, but Powell's simply has the best\ncollection due to its tremendous size.\n\nWell they shut down on March…",
  "data/reddit-books/r/books/comments/lt430z/do_you_know_how_to_open_a_new_hardcover_book.json": "Here [https://imgur.com/a/3pWVRY1] is the guide.\n\nPlace the book with its back on the table.\n\nLet the front cover down.\n\nThen the back cover.\n\nThen a few at the back, alternating front to back, gently pressing them down\nuntil the center is reached.\n\nDo this to her three times in order to limber up…",
  "data/reddit-books/r/books/comments/ltagy3/i_just_finished_catch22_and_wow_what_a_ride.json": "So I had always heard Catch-22 was one of the great WW2 novels and finally\ndecided to actually experience it. I don’t know what I expected going in, but it\ncertainly wasn’t what I actually ended up reading.\n\nThe book feels like seeing someone else’s dream at times, jumping across time\nand distance…",
  "data/reddit-books/r/books/comments/ltdp13/a_man_called_ove_by_fredrik_backman.json": "I just finished this book and in fear of forgetting what this book meant to me,\nI am currently reading while I still have tears streaming down my face. This\nbook made me feel the grief with him, made me fall in love with all of the\ncharacters and I'm not quite sure how to move on. I'm grieving from…",
  "data/reddit-books/r/books/comments/ltj9w0/i_stopped_reading_back_covers_and_it_has_improved.json": "It's been months since I last read a back cover. Why won't I read them ? They\nwant to intrigue you and make the plot look appealing and therefore they\nsystematically reveal little twists (or unforeseen development) that I would\nhave rather experienced reading the book. It's very comparable to movie…",
  "data/reddit-books/r/books/comments/ltnl75/whats_a_thing_author_tend_to_write_that_always.json": "I know it's a vague question but here's an example:\n\ntwo or more character are having a conversation, one says something questionable\nand the author goes \"Bob looked at Ted for a few minutes\".\nHOW?!? Do they know how long a single minute of staring at someone is? Now i\nhave to picture this guy…",
  "data/reddit-books/r/books/comments/ltvwql/people_who_finish_a_book_in_24_hours_whats_your.json": "I just talked to someone who read three novels in a single day, and I was amazed\nas a dreadfully slow reader (it takes me a month to finish a standard length\nnovel sometimes). I've only read graphic novels in one day. I guess reading a\nbook in one day is probably a more immersive experience. I'd…",
  "data/reddit-books/r/books/comments/lu2gum/what_books_were_you_tricked_into_reading.json": "Tricked might not be an exact word, but I have recently read The Discovery of\nWitches and let me tell you... it was one of the biggest disappointments on this\nyear so far. YouTube, goodreads reviews, friends from a bookclub I am part of -\nall recommended it to me on the premises of urban fantasy,…",
  "data/reddit-books/r/books/comments/lu4nfl/i_can_officially_join_the_wheel_of_time_team.json": "I just finished the last audiobook, including “New Spring”. I feel... like I’ve\nlost a loved one. People have been telling me for years that I needed to read\nit. My obstinate self didn’t listen. As a woman, at the time I was obsessed with\nfemale authors like Anne McCaffrey and hated the way male…",
  "data/reddit-books/r/books/comments/lu5v3p/why_you_shouldnt_be_afraid_to_read_swanns_way.json": "My fucking god what a delicious fucking book that went above and beyond anything\nI could've dreamt of. This book is the fattest, juciest heartthrob I've ever\nread.\n\nDon't be afraid of reading Marcel Proust! He's only talking about shit we've all\nexperienced before! I was intimidated with the purple…",
  "data/reddit-books/r/books/comments/lu6yws/so_i_finished_order_of_the_phoenix.json": "Those of you who have been following my little journey... I have been reading\nthe Harry Potter books for the first time. I’ve been reading the remainder\n(about a 1/5) since 1am... it’s 5am now... And let me say....\n\nI am wrecked. I was loving the beginning so much... the order coming for…",
  "data/reddit-books/r/books/comments/lu84gk/malazan_book_of_the_fallen_by_steven_erikson.json": "Madness was a demon and it lived in a world of helpless need, a thousand desires\nunanswered, a world without resolution. Madness, yes, she had known that demon.\nThey had bargained with coins of pain, and those coins came from  vault that\nnever emptied. She’d once known such wealth. Crippled god…",
  "data/reddit-books/r/booksuggestions/comments/la2qg6/books_and_authors_of_the_21st_century.json": "Hi everyone! I'm new in this habit of reading, and I already know the classics\nbooks an authors that everyone always says that \"you must read\" but I'm\ninterested in something newer too, so I'm here asking you for your\nrecommendation. I have no predilections for any genre so go ahead.",
  "data/reddit-books/r/booksuggestions/comments/ladhii/im_flying_through_the_lotr_series.json": "Any suggestions for books similar to the LOTR?",
  "data/reddit-books/r/booksuggestions/comments/lagpi5/books_where_the_protagonist_and_the_antagonist.json": "I love books where the hero and villain fall in love, but they so rarely end up\ntogether. The hero usually settles for the bland, boring milquetoast love\ninterest instead. So if anyone could recommend a book or series with a\nhero/villain relationship that has a happy ending I would really appreciate…",
  "data/reddit-books/r/booksuggestions/comments/lawbrc/terrifying.json": "Currently I'm reading Handmaid's Tale by Margaret Atwood and this book is\nterrifying. I always have to prepare myself before diving in that world. I'm not\nsure if I'm gonna read the next part or not. Let me know what you guys think\nabout this series.\n\nAnd hey I'm new to the group.",
  "data/reddit-books/r/booksuggestions/comments/lb2zmr/madeline_miller_author_of_circe_interview.json": "My local radio station rebroadcast an interview with Madeline Miller from 2018\nabout her novel Circe. I know the book gets a lot of love on this sub, so I\nthough I would share the link [https://www.wnyc.org/story/circe/].\n\nHappy listening!",
  "data/reddit-books/r/booksuggestions/comments/lbhp2b/books_where_being_a_lone_wolf_or_introvert_or.json": "In today’s era they say success is not based on what you do but who you know.\nAre there any stories or books out there that show success can be achieved by\nintroverts and lone wolves like me? I have big dreams and ambitions but I am\njust not the type to be chummy with people. In fact, I’d rather be…",
  "data/reddit-books/r/booksuggestions/comments/ld71oh/books_like_the_name_of_the_wind.json": "Hello! Please suggest fantasy books in terms of quality like the Kingkiller\nchronicle. I've googled this request and found suggestions like the Farseer\ntrilogy and Gentlemen bastards series. I like them. But overall quality of the\nlanguage is lacking compared to the Kingkiller chronicle. Series like…",
  "data/reddit-books/r/booksuggestions/comments/ldhqu3/positive_books_for_negative_people.json": "Not that I'm a total pessimist or anything, but I do tend to read almost\nexclusively dark, messed up, nihilistic stuff. I made a goal for 2021 to try and\nread more positive stuff--one \"optimistic\" book per month.\n\nI started last month with The Gucci Mane Guide to Greatness and it was a silly\nbut fun…",
  "data/reddit-books/r/booksuggestions/comments/ldogmc/historical_fiction_not_titled_the_soandso_of.json": "I don't mean to paint current historical/period fiction with a broad brush but I\nthink we are at peak WW2 romance novel.\n\nI'm looking for something in the vein of Joseph Conrad, Jack London or lesser\nknown BWS who wrote Terribilita. I'd like to get into something gritty and\nauthentic, something with…",
  "data/reddit-books/r/booksuggestions/comments/ldqy27/books_where_the_main_character_falls_in_love_with.json": "I know this is a weird request, but I would love find a book with this\nstoryline. I just need a book that is going to make me feel lonely LOL",
  "data/reddit-books/r/booksuggestions/comments/lej6ds/gone_girlesque_books.json": "I’ve been trying to find domestic thriller books that gives off the same vibes\nas Gone Girl but every one of them have sucked. I think something with a lot of\nwit like Amy but not a lot of focus on violence?",
  "data/reddit-books/r/booksuggestions/comments/leoqbz/just_read_my_first_page_turner.json": "I’m 33 and have fallen in love with reading. The book that has done so is\nNorwegian Wood by Haruki Murakami. I’m almost done and I need something next.\nRecommendations must have a little romance and deep characters.",
  "data/reddit-books/r/booksuggestions/comments/lfaipx/looking_for_a_new_series.json": "I really enjoy getting invested in a series over time, developing with the\ncharacters, and coming to a big, climactic ending. I've only read a few series\nso far -- Harry Potter, Game of Thrones, and Dresden Files -- but I like feeling\ningrained in an expansive world.",
  "data/reddit-books/r/booksuggestions/comments/lfjrvb/classic_novels_that_are_easy_to_read.json": "Recently read 1984 and I’ve got gatsby next. Any suggestions?",
  "data/reddit-books/r/booksuggestions/comments/lfkajm/a_book_that_is_confusing_and_full_of_misdirects.json": "of psych thriller genre. I’ve read I’m Thinking of Ending Things which I guess\nfits this, I enjoyed that book. Thank you for any recommendations.",
  "data/reddit-books/r/booksuggestions/comments/lfnjpm/hit_me_with_your_best_shot.json": "Give me a recommendation for your favorite book, the \"best\" book you’ve ever\nread (whatever that means to you), or the most essential read you’ve ever come\nacross.\n\nAny genre, fiction or nonfiction, anything goes.",
  "data/reddit-books/r/booksuggestions/comments/lfrnvx/the_book_that_makes_you_think_feel_and_become.json": "My favorite book of all time is My Friend Leonard. It makes me... well, what my\ntitle says. Feel, think and become introspective. I’m looking for books like the\nmovies 500 Days of Summer, HER, Lost in Translation and Eternal Sunshine of the\nSpotless Mind. Please help :)",
  "data/reddit-books/r/booksuggestions/comments/lg0zq5/im_looking_for_a_good_gothic_horror.json": "Hello you fabulous strangers! I’m in search of a good gothic horror book.\nSomething that manages to make the reader really scared and so on. I have read a\nfew books along the line of Dracula and Frankenstein but I’m open to any\nsuggestions.",
  "data/reddit-books/r/booksuggestions/comments/lg8tdo/books_with_studio_ghibli_vibes.json": "I’m looking for books that reminds you of any of the Studio Ghibli movies (for\nexample The Wind Rises, Spirited away etc.) or just the general heartwarming\nfeel that the movies have. Thanks!",
  "data/reddit-books/r/booksuggestions/comments/lglkge/hello_to_anyone_reading_i_genuinely_hope_you_have.json": "This isn’t necessarily a book suggestion or request but I just wanted to come on\nhere and wish all of you a great day/week/month/year. You all deserve the very\nbest regardless of who you are. Nothing is easy for anybody right now, but\nremember how important it is to keep your head up. You serve an…",
  "data/reddit-books/r/booksuggestions/comments/lgta9f/where_to_start_with_agatha_christie.json": "I've never read Agatha Christie. I'm not even sure I like mystery. But people\nrave about her on all of the book subs I frequent so I thought I should give it\na go.\n\nWhere should I start?",
  "data/reddit-books/r/booksuggestions/comments/lhipd7/im_15_and_i_havent_really_read_that_much_my.json": "For example, if I want to read about physics I'd like a book that is broad\nenough to encapsulate almost all physics, but also explicit enough to get a\ndeeper understanding on the subject.\n\nEdit: Thank you everyone for the suggestions. Here are some more subjects to\nmake it easier for you: Economy,…",
  "data/reddit-books/r/booksuggestions/comments/lhw7cn/which_author_from_your_country_should_i_read.json": "And what book should I read from his/her catalogue?",
  "data/reddit-books/r/booksuggestions/comments/lhxtuc/books_about_a_princess_being_the_bad_guy_aka.json": "I guess Wicked could be considered one. Any others?",
  "data/reddit-books/r/booksuggestions/comments/li2x2c/fastaddictive_books_for_reading_slump.json": "Hello! I’m in a bit of a reading slump and I haven’t been able to complete a\nbook for 3 months now. I keep starting books and giving up after a few chapters.\nI’m looking for something fast and addictive, preferably some fluffy romance,\nbecause that usually gets me out of a slump.\n\nThanks!",
  "data/reddit-books/r/booksuggestions/comments/li4b1f/tw_recently_lost_my_father_to_suicide_looking_for.json": "My father went missing, and after a month an a half of aggressively searching\nfor him, my partner and I supplied information to PD that allowed them to find\nand identify his body. My father chose to go to a park, and spend his last\nmoments watching the sunset before going off a trail to take his…",
  "data/reddit-books/r/booksuggestions/comments/liclia/just_been_told_dad_will_be_moved_out_of_the_icu.json": "I’m almost crying of happiness he’s been through so much and he’s such a good\nman. He said he’s seen so many people die and I want him to have some\ndistractions when he’s resting up back at home, after everything.\n\nHe likes authors such as Lee Child and Jefferey Archer. One of his favorite\nbooks is…",
  "data/reddit-books/r/booksuggestions/comments/lizl0r/looking_for_books_to_broadenchallenge_my_worldview.json": "I'm a introverted 22 y/o guy and I want to break out of my overly\ncynical/skeptical shell! Maybe these are different goals but I want to challenge\nmyself with different perspectives and to be confident in something beyond my\ncynicism.",
  "data/reddit-books/r/booksuggestions/comments/ljfc7l/books_for_mental_health_patients.json": "I am looking to donate some fictional books to an adult Behavioral Health unit.\nThey specifically cannot have books that have a lot of violence, or really any\nmurder, drugs, sex, and no hyper-focused religious content.\n\nIf you have any suggestions I would appreciate them! They are severely…",
  "data/reddit-books/r/booksuggestions/comments/ljgnj1/books_with_lowkey_supernatural_elements_that_are.json": "I'm looking for a book which has supernatural elements, but it takes a while for\nthem to actually be revealed,",
  "data/reddit-books/r/booksuggestions/comments/ljy3ti/the_body_keeps_the_score_similar_book.json": "I just finished The Body Keeps The Score by Bessel Van Der Kolk, MD. I loved\nevery minute of it. I work in a trauma treatment center for adolescents in an\nentry level position. I’m passionate about this subject and I’m wanting to read\nmore.",
  "data/reddit-books/r/booksuggestions/comments/lk0aqo/horror_books_anything_but_stephen_king.json": "I’m pretty new to the horror fandom and have been trying to jump into some good\nhorror novels. Which is pretty hard considering I avoid Stephen King at all cost\nlol. I don’t have any particular topics that I’m avoidant to, however I’m not to\nfond of books that descriptively depict or that are solely…",
  "data/reddit-books/r/booksuggestions/comments/lkakgs/i_just_finished_the_count_of_monte_christo_oh.json": "Hey everyone,\n\nas the title says, I just finished reading the count of monte christo from\ndumas. It was an amazing experience to say the least. Damn exciting... It sucked\nme into the story and I couldnt stop reading once I started. I can not recommend\nit enough!\n\nNow I am looking for my next title…",
  "data/reddit-books/r/booksuggestions/comments/lkdodn/what_to_read_after_finishing_the_house_in_the.json": "I just finished The House in the Cerulean Sea by TJ Klune, and it’s my favorite\nbook I’ve read so far in 2021. I loved the atmosphere and how kindly written and\ncomforting it was. The kids were so adorable, and I loved the “found family”\nthemes, as well as the moral message about people not being…",
  "data/reddit-books/r/booksuggestions/comments/lkqbsp/some_great_mental_health_reads.json": "On mood disorders:\n\nDarkness Visible by William Styron\n\nThe Noonday Demon by Andrew Solomon\n\nAn Unquiet Mind by Kay Redfield Jamison\n\nOn trauma:\n\nIn an Unspoken Voice by Peter Levine\n\nHealing Developmental Trauma by Heller and LaPierre\n\nThe Tao of Fully Feeling by Pete Walker\n\nThe Body Keeps the…",
  "data/reddit-books/r/booksuggestions/comments/ll4fgm/books_about_the_process_of_becoming_a_man_and.json": "I am in this process myself and I am somewhat confused about what it means to be\na man right now. My dad hasn't been the best for me and isn't really a role\nmodel I look for so I am looking for other options. I've read biographies of men\nI respect throughout history though like Abraham Lincoln and…",
  "data/reddit-books/r/booksuggestions/comments/llpp95/ya_books_that_held_up_when_you_read_them_as_an.json": "I got inspired by the question about books we loved as teens and realized were\nterrible, I’d like to know the opposite. I’ll go first: the merlin conspiracy by\nDiana Wynne Jones (or anything by her that I’ve read) also if anyone has a book\nby her to recommend I would appreciate it :)",
  "data/reddit-books/r/booksuggestions/comments/lm4d0l/the_count_of_monte_cristo_is_it_worth_it.json": "I don’t usually read anything pre ~1920, and recently read Wuthering Heights and\nreally did not enjoy it. With the Count of Monte Cristo being over 1200 pages I\nthought I should ask! Haha",
  "data/reddit-books/r/booksuggestions/comments/lmmr0k/books_for_nature_lovers_and_hikers.json": "Just finished wild by Cheryl Strayed and loved it. Also enjoyed A walk in the\nwoods by Bull Bryson . Any books about underdogs using nature to find\nthemselves?",
  "data/reddit-books/r/booksuggestions/comments/lmo2me/looking_for_a_book_where_the_protagonist_hates.json": "I know this is long winded but I’m feeling the dregs of ‘salary man’ culture and\nI thought it would be nice to escape to a world where someone has turned the\ndull into something exciting. Please let me know if this ring any bells with you\nout there. Thank you.",
  "data/reddit-books/r/booksuggestions/comments/ln24u8/thankyou_to_the_people_who_recommended_educated.json": "Educated By Tara Westover, wow that book was amazing when I finished it, it felt\nso odd I wanted to reread it all over again I was so invested, that I read it\nwithin 6 hours. In the words of Franz Kafka it both ‘wounded and stabbed’ me and\nit’s been a while since I picked up a book like that.…",
  "data/reddit-books/r/booksuggestions/comments/lnzqmn/books_with_a_knives_out_feel.json": "I know Agatha Christie books are probably a given, but I’m looking more for a\nquirky mystery thriller with a genius storyline and a light hearted atmosphere\nabove a dark situation..",
  "data/reddit-books/r/booksuggestions/comments/loex45/books_everyone_should_read_in_their_20s.json": "I'm looking for books that you feel people should read in their 20s. I'm mostly\ninto literary fiction or non-fiction, but I'm open to anything!",
  "data/reddit-books/r/booksuggestions/comments/lowkpa/super_interesting_fiction_that_makes_it_hard_to.json": "I used to read a lot when I was younger, nowadays I hardly read anything else\nexcept for self-help books. Now I'm looking forward to read more for fun, just\nvery interesting fiction stories which makes you want to read the whole book at\nonce. Any suggestions?",
  "data/reddit-books/r/booksuggestions/comments/lp6ykk/horror_novels_that_dont_make_you_feel_like_people.json": "I love horror, but I hate the way so many horror books seem to slide into this\nedgy, nihilistic world view where everyone inevitably ends up miserable, even if\nthey don't deserve it (they usually seem to deserve it). I'm reading Salem's Lot\nright now and it kind of makes me want to blow my brains…",
  "data/reddit-books/r/booksuggestions/comments/lpa85u/where_to_buy_new_books_online_besides_amazon.json": "Besides Amazon, where to get new books. I am asking because the quality of books\nfrom Amazon are really bad, they claim to be \"new\", but the books don't look\nlike so. Everytime I bought books, I'd always complain til they send me actually\nnew copies. I hate Amazon",
  "data/reddit-books/r/booksuggestions/comments/lpvu5v/any_books_covering_dissociative_disorders.json": "I’m almost 18 and I heavily rely on imaginary friends. I’d like to read more\ninto this to see if there is anything wrong with me. I’m also down to read any\nfictional story based on the idea of a dissociative disorder.",
  "data/reddit-books/r/booksuggestions/comments/lqda9l/what_book_is_a_total_mindfck.json": "I've read a few so far that could be described this way and I've loved the hell\nout of them.\n\nLemme know!",
  "data/reddit-books/r/booksuggestions/comments/lqjdwy/books_about_hidden_treasures_around_the_world.json": "Interested to read about hidden / lost treasures that are lost or found.\nNon-fiction if possible. Thanks!",
  "data/reddit-books/r/booksuggestions/comments/lqnyrm/please_recommend_me_some_great_short_story.json": "I have been devouring short stories lately and I would love recommendations for\nmore, especially collections that are subversive, contain magical realism, or\nhave a wide variety of piece lengths. Here are a few I’ve read recently that I\nloved:\n\n 1. Cat Person by Kristen Roupenian - 5/5 (I think this…",
  "data/reddit-books/r/booksuggestions/comments/lrnpjn/adult_series_similar_to_percy_jacksonsuper_heroes.json": "So, I used to read YA books all the time and now all of a sudden it’s incredibly\nhard for me to focus on them and relate to the characters. Don’t get me wrong,\nYA/teen books are great it’s just that I’d like to relate to a character more of\nmy age and that’s going through more of what I’m going…",
  "data/reddit-books/r/booksuggestions/comments/lrx5st/dark_matter_by_blake_crouch_thank_you_whoever_you.json": "I can’t find the thread where someone suggested this book but I freaking love\nit! Just wanted to say a big thank you to the awesome person that suggested it,\nI wish I could find the original thread and tell you thank you on there but\nhopefully you see this post!",
  "data/reddit-books/r/booksuggestions/comments/lsgn8v/i_want_some_books_about_real_healhy_relationships.json": "The world is damn sexualised, there are p**n everywhere, the women are super\nobjectified. My first contact with sex and intimacy was p**n. I remember when I\nwas like 13-14 I couldn't even imagine that people actually do that in the real\nworld, like it was something else, something exciting that I…",
  "data/reddit-books/r/booksuggestions/comments/lsyr0d/i_want_to_read_something_with_an_excruciatingly.json": "Could be romance, preferably with a slow burn, or any other genre. It's been a\nwhile since I read something with an ending that hurt me so much I wasn't able\nto cope lol. Open-ended ones are good too. Or something that ends with an epic\none liner. Thanks in advance!",
  "data/reddit-books/r/booksuggestions/comments/ltgg4g/an_emotionally_drained_person_looking_for.json": "To give a bit more detail I picked up reading after literal years and started\nwith Kafka on the Shore based on how many people loved it and my general\ncuriosity for the supposed metaphysics elements and the author. Without\nspoiling, I'm at chapter 40 and cannot find the will to finish the last…",
  "data/reddit-books/r/booksuggestions/comments/lttgmo/but_what_is_grief_if_not_love_persevering.json": "Recently an episode of WandaVision had this dialogue that had a very profound\neffect on me. It made me feel comfort and strange at the same time.\n\nIt also made me realise that some words when strung together have a huge impact\non people. As someone who constantly writes about her life experiences,…",
  "data/reddit-books/r/booksuggestions/comments/lujt4c/percy_jackson_for_adults.json": "I’m seriously beginning to think I’ll never grow out of the Greek mythology\n“phase”. Would love any suggestions for books written like fiction stories, or a\nrecounting of the tales written cohesively. Thank you!!"
}