{
  "data/reddit-ask/r/AskHistorians/comments/pfbd6s/would_we_recognize_the_roman_senate_from_a.json": "Apologies for the awkward phrasing but what I’m really asking is how similar was\nthe Roman Senate to modern legislative bodies such as the US Congress or the\nBritish Parliament. Like did the Senate have committees in the way modern\nlegislative bodies do? Did they have officers (ie a leader, a whip,…",
  "data/reddit-ask/r/AskHistorians/comments/pfiws6/how_socially_accepted_was_reading_a_softcore.json": "The question was inspired by a rewatch of Beverly Hill's Cop II, where Paul\nReiser's character, Detective Jeffrey Friedman, is reading a Playboy magazine at\nwork without any attempt of concealment.\n\nWatching this then recalled a memory of me seeing Playboy magazines on coffee\ntables of houses for…",
  "data/reddit-ask/r/AskHistorians/comments/pfqn4i/what_happened_to_the_spouses_of_those_sentenced.json": "Was the convict's spouse also transported? If not, did the marriage remain\nintact or was each party free to marry someone else?",
  "data/reddit-ask/r/AskHistorians/comments/pfv7dj/postww2_how_did_east_germans_rationalize_now_we.json": "Or am I way off? My question is how did a population that was drilled for\ndecades in Nationalism-Fascism-Nazism ideology suddenly champion the Soviet\nCommunist ideals?",
  "data/reddit-ask/r/AskHistorians/comments/pg057s/the_powmia_flag_is_based_on_a_thoroughly.json": "This comment\n[https://www.reddit.com/r/AskHistorians/comments/l88o0f/were_there_any_verified_american_pows_who_were/]\ndoes a good job of breaking down the origins of the conspiracy theory and the\n(many) times its claims have been investigated and refuted, but I have not been\nable to find out why the…",
  "data/reddit-ask/r/AskHistorians/comments/pgiu9v/did_construction_technology_only_improve_rapidly.json": "In chapter 4 of his commentary on Caesar's commentary Napoleon criticised\nPlutarch for calling Caesar's Rhine bridge in 55 BC a miracle and states that it\nis unremarkable compared to his 1809 one. I find it hilarious that he brushes\naway the time difference. But maybe I am taking our rapid…",
  "data/reddit-ask/r/AskHistorians/comments/pgkqs6/did_any_historical_armies_employ_shamans.json": "I am well aware that asking such people to divine the future, bless soldiers\nbefore a battle, or pray for victory while safely away from the fighting were\ncommon practices in many cultures of the world. (And no, I'm not asking if magic\nis real. :P )\n\nHowever, I am specifically curious if there are…",
  "data/reddit-ask/r/AskHistorians/comments/ph0et5/japan_is_considered_a_full_democracy_yet_since.json": "Title, besides the two exceptions (one in the 90's and one in the 2000's) that I\ncan recall, the LDP has basically ruled Japan unterrupted. This for me is some\nwhat surprising given the variance of parties that exist, and the fact that the\nJapanese economy hasn't been prosperous since decades now.…",
  "data/reddit-ask/r/AskHistorians/comments/ph0yzm/how_did_the_ottoman_army_go_from_being_the_terror.json": "We often hear how the Ottoman army (and the empire as a whole) failed to keep\npace with military and scientific developments in Europe. As such, they went\nfrom being at one time 'the terror of Europe' where their armies were nearly\nalways victorious, to almost a laughing stock by the start of the…",
  "data/reddit-ask/r/AskHistorians/comments/phdk46/american_comic_book_author_rob_liefeld_is_not.json": "For starters, I am not big into comics, and so only know Liefeld by reputation\nand the art\n[https://3.bp.blogspot.com/-LpUNDt1iQBw/TheIbJ_ArAI/AAAAAAAAI4M/k2Cdc9IHHnk/s1600/liefeld-cap.jpg].\nI was looking into him today and discovered that he has defenders, including,\napparently, Grant Morrison,…",
  "data/reddit-ask/r/AskHistorians/comments/phf31m/an_american_idiom_is_to_add_the_phrase_and_the.json": "Edit: I should have had the last sentence read : What can AskHistorians shed\nlight on in regards to this particular topic?",
  "data/reddit-ask/r/AskHistorians/comments/photfj/i_recently_saw_the_classic_film_casablanca_for.json": "Since I wasn't around in 1942, I don't know how the character of Sam would have\ncome off relative to what was typical of African American portrayals at the\ntime.\n\nOn the one hand, he was second fiddle to Bogey and highly loyal, but he wasn't\nsubservient, and often spoke up if the situation was dire…",
  "data/reddit-ask/r/AskHistorians/comments/php9is/reasons_for_locating_many_concentration_camps_in.json": "Yair Lapid, the current Minister of Foreign Affairs of Israel, is quoted as\nsaying:\n\n> It is no coincidence that the Nazis created their center of extermination in\n> Poland. They knew that the Polish population would help them.\n\nIs that claim accurate? Was the \"willingness of the Polish population…",
  "data/reddit-ask/r/AskHistorians/comments/phrjj6/in_the_manga_kurosagi_corpse_delivery_service_an.json": "I don't have a scan, but in one chapter of the manga, while investigating a\ndeath, the elderly character Sasayama realizes the case at hand has relations\nwith Unit 731, and asks the younger protagonists if they know about it. When\neven Sasaki, the \"smart one\" doesn't know, Sasayama complains about…",
  "data/reddit-ask/r/AskHistorians/comments/phutzg/how_were_teenagers_going_into_battle_and_not_only.json": "This seems absolutely crazy to me, how would a 16 year old have the physical\nstrength and even the experience to fight against some of the older and more\nexperienced people. What's crazier is that he was the heir to the throne, why in\nhis right mind would his father even allow such a thing?",
  "data/reddit-ask/r/AskHistorians/comments/phzr81/what_do_we_know_about_the_ecological_effects_of.json": "A possibility that comes to mind for me is a disruption of migration routes for\nanimals; do we know if anyone noticed that? What about diverting water or\nanything else for maintenance or construction? Thanks!",
  "data/reddit-ask/r/AskHistorians/comments/pi4x8r/ive_heard_about_it_but_what_exactly_is_fascism.json": "Now, before you kill me for not knowing I want to say I know that fascism is\nbad, but not why. Obviously, Hitler, but I don’t recall any particularly bad\nthings from Mussolini or Franco’s regime, not like the Holocaust at least, so\nwhat exactly is it? What does it entail, like policies, freedoms…",
  "data/reddit-ask/r/AskHistorians/comments/pibo2j/were_european_royal_meals_as_lavish_as_they_are.json": "In popular TV series such as Vikings, Rome, Game of Thrones, Tudors, Spartacus,\nThe Crown and more, the elites/kings/earls/etc. are often shown to be sitting\nnear a table completely covered in food when they are having dinner. This is\nalso in plenty of movies.\n\nMost people then could get by on a…",
  "data/reddit-ask/r/AskHistorians/comments/pihm6d/apparently_german_and_englishspeaking_historians.json": "The Question of Cleopatra's ancestry is a question that is quite often\n\"discussed\" on the internet, may it be here on Reddit or on other websites.\nGenerally people tend to point out, that Cleopatra was Greek, and not Egyptian.\n\nNow, the thing is, I study history at a University in Germany, and I…",
  "data/reddit-ask/r/AskHistorians/comments/piryyd/in_1971_over_96_of_voters_in_egypt_libya_and.json": "According to Wikipedia, Libya, Egypt, and Syria all held referendums in 1971\nsimultaneously to join the Federation of Arab Republics. Egypt approved it with\n99.96% of voters, and a turnout of 98.1%, Libya with 98.6% with a 94.6%, and\nSyria with 96.4% and a 89.7% turnout. If accurate, this is…",
  "data/reddit-ask/r/AskHistorians/comments/piv4rg/in_british_schools_philip_ii_of_spain_felipe_ii.json": "Is it something to do with the educational curriculum, or do historians not\nregard him as a \"true\" King of England?",
  "data/reddit-ask/r/AskHistorians/comments/pj00os/a_common_critique_of_the_interstate_highway.json": "Here’s [http://iqc.ou.edu/2014/12/12/60yrsmidwest/] a visual example of what I’m\ntalking about, from the University of Oklahoma.\n\nBelow are examples, in text, of specific critiques:\n\nFrom CNN\n[https://www.cnn.com/2021/02/27/cars/buttigieg-highway-removals/index.html],\n\n> Njeri Camara, 61, can't…",
  "data/reddit-ask/r/AskHistorians/comments/pj3zty/can_anyone_shed_some_light_on_the_transition_from.json": "I have a friend (who wants to be a midwife) who makes the claim the reason the\ntransition happened was so the white male doctors could keep women out of the\nprocess. This seems... Unlikely to me. Is there any veracity to this claim? How\ndid the mortality rate during delivery change as a result of…",
  "data/reddit-ask/r/AskHistorians/comments/pjcd6o/at_what_point_in_history_did_the_idea_of_a_chain.json": "For example, could a roman drop in on a standardized tavern setting that was\npresent in multiple places across Rome? Could a medieval worker find the same\nset of tools in multiple places across the city nearest them? Could a victorian\naristocrat find the same quality equipment for sports or…",
  "data/reddit-ask/r/AskHistorians/comments/pje30i/zoroastrianism_was_probably_the_most_followed.json": "There were many Zoroastrian communities living under Roman rule during the time\nof Paul. Why didn’t early Christians focus on converting them? Was their\npolitical ramifications for Christians challenging Zoroastrianism?\n\nDid early Jews view Zoroastrians as believers in the same god? They must…",
  "data/reddit-ask/r/AskHistorians/comments/pjlxv3/did_alexander_the_great_actually_face_defeat_or.json": "These days, many people are saying and writing, \"It's impossible to take\nAfghanistan. Look at the Soviets, the British, and even Alexander the Great.\" It\nwas my understanding that Alexander defeated the Achaemenids in three battles:\nthe Granicus, Issus and Gaugamala. These battles took place in…",
  "data/reddit-ask/r/AskHistorians/comments/pjo3r5/turkey_lost_15_of_its_population_in_wwi_and.json": "Not sure if this image\n[https://1.bp.blogspot.com/-PzeAoM_nh8A/VgDQQkOgd7I/AAAAAAAAoHA/Uo_LOdwMJ2E/s1600/WW1.jpg]\nis correct, but it's the one I'm sourcing my casualty figures from.",
  "data/reddit-ask/r/AskHistorians/comments/pjr8fe/where_black_americans_ever_employed_as_spies_in.json": "TYPO: Were not Where*",
  "data/reddit-ask/r/AskHistorians/comments/pjup0w/single_lifewanting_to_be_alone_in_the_middle_ages.json": "Been wondering for some time now: how was single life in the middle ages?\nDid singlemen/singlewomen live alone?\nI also ask this question in the light of how much people could be alone in the\nmiddle ages.\nA teacher of mine said that poor people couldn't be alone,had to live in crowded\nhouseholds and…",
  "data/reddit-ask/r/AskHistorians/comments/pk33oh/was_the_spanish_flu_ever_as_politicized_and.json": "Did people wear masks back then and social distance? Did they argue and bicker\nand refuse to wear a mask? Was it as tense in public and did they open carry\nlike in the beginning of covid? Did the president endorse mask wearing?",
  "data/reddit-ask/r/AskHistorians/comments/pk6390/what_are_the_cultural_and_theological.json": "Jesus was a Jew, but he started a movement that became something else entirely.\nMuhammad similarly started a \"new\" religion, but what was his \"original\"\nreligion? Was he a Jew? Was he a Christian? To my understanding, these religious\ntraditions existed in his milieu, but the relationship is unclear…",
  "data/reddit-ask/r/AskHistorians/comments/pk686p/which_side_did_the_romans_walk_on.json": "An image\n[https://old.reddit.com/r/ArtefactPorn/comments/pjx20g/a_mosaic_that_says_bene_lava_wash_well_discovered/]\nwas recently posted in r/ArtefactPorn [/r/ArtefactPorn] of a mosaic at the\nentrance to a Roman-era (1st-2nd century AD) bathhouse in Timgad, Algeria. The\nmosaic depicts two messages,…",
  "data/reddit-ask/r/AskHistorians/comments/pk8brf/the_issue_of_collective_memory_of_the_spanish_flu.json": "For context, I am the son of a Peruvian father and a French-German mother. In\nthe early 20th century, my Peruvian family were upper-middle class landowners of\nthe Amazonian side of the Cusco region, my German family were businessmen in\nFrankfurt, while my French family were farmers and woodcutters…",
  "data/reddit-ask/r/AskHistorians/comments/pkp5ox/men_going_down_on_women_in_ancient_rome.json": "Did men in Ancient Rome eat pussy? Heated debate in my house. SOS",
  "data/reddit-ask/r/AskHistorians/comments/pkwho9/ama_im_garrett_ryan_author_of_naked_statues_fat.json": "Hi everyone! I'm Dr. Garrett Ryan, AKA u/toldinstone [/u/toldinstone]. I'm a\nRoman historian, and I recently released my first popular book: Naked Statues,\nFat Gladiators, and War Elephants: Frequently Asked Questions about the Ancient\nGreeks and Romans [https://amzn.to/2WSMAgF]. In a series of…",
  "data/reddit-ask/r/AskHistorians/comments/pl2oil/grandpas_mystery_wwii_destination_per_secret.json": "My grandfather passed away at 101+ yrs old, and never found out the answer to\nwhat is, on the face, a simple question: what was secret destination 1609-A?\n\nHe left behind an autobiography which contains a lit of great first-hand\naccounts of his time in the military as a fighter pilot and gunnery…",
  "data/reddit-ask/r/AskHistorians/comments/pl4mm0/did_store_clerks_really_have_the_authority_to_cut.json": "A random question for those who might be old enough to remember this. A common\nthing to see in movies and TV made before the mid 2000s, was that when your\ncredit card was declined, it would be destroyed. The clerk at the grocery store\nwould pull out a big pair of scissors and cut your card in half.…",
  "data/reddit-ask/r/AskHistorians/comments/pl6drg/is_moving_out_at_18_an_artifact_of_world_war_ii.json": "Someone shared some social media posts from some Thai and Pakistani kids who\nwere flummoxed by the independence expected of them while in America for grad\nschool because it was 'normal in their cultures to live and help out at home in\nearly adulthood, often until marriage.'\n\nI'm curious about the…",
  "data/reddit-ask/r/AskHistorians/comments/pldkd4/what_happened_to_the_23trillion_rumsfeld.json": "https://www.c-span.org/video/?165947-1/defense-business-practices\nhttps://www.c-span.org/video/?c4683428/user-clip-23-trillion",
  "data/reddit-ask/r/AskHistorians/comments/plk9yc/as_a_formerly_clueless_united_states_citizen_how.json": "A close friend grew up in a traveling group but was sent to the United States as\na child in the 90s. I recently asked what the deciding factor was when it came\nto her clan splitting up and was heartbroken by what came next. I only asked her\nbecause I am having such a hard time finding information on…",
  "data/reddit-ask/r/AskHistorians/comments/plkzhs/by_the_time_of_cleopatra_most_egyptian_pyramids.json": "Was knowledge about their construction and purpose mostly preserved, or was much\nof it lost to time? Were they considered important cultural heritage, odd\ncuriosities, not remarked upon much at all, etc.?\n\nBy the way, the invocation of Cleopatra isn't meant to restrict the question\nsimply to her…",
  "data/reddit-ask/r/AskHistorians/comments/plnix1/is_there_a_reason_the_nazi_and_soviet_ministries.json": "Technically, it's the Ministry of Enlightenment and Propaganda and the\nDepartment for Agitation and Propaganda, respectively, but it occurred to me\nthat in most dystopia fiction, and many real world authoritarian states, the\nname of the departments devoted to propaganda are a bit more veiled, with…",
  "data/reddit-ask/r/AskHistorians/comments/plsibx/surely_the_earl_of_sandwich_wasnt_the_first_guy.json": "The story goes that the Earl of Sandwich came up with putting meals in between\nslices of bread because he wanted to be able to eat while playing cards. But the\ndude lived in the 1700s and humans have been eating bread for thousands of\nyears; I feel like there have to have been others who did/were…",
  "data/reddit-ask/r/AskHistorians/comments/plzb25/megathread_a_brief_history_of_september_11th_2001.json": "Our 20 Year Rule rollover happens at the start of the year, so we posted about\nit then\n[https://www.reddit.com/r/AskHistorians/comments/kocf1z/meta_an_historical_overview_of_911_as_the_20_year/],\nbut due to the significance of the event -- as well as the accompanying bad\nhistory -- we have reposted…",
  "data/reddit-ask/r/AskHistorians/comments/pm3pg8/is_it_common_for_historians_to_refer_to.json": "Did the Ottoman Empire's inhabitants refer to it as such? Did medieval Germans\nthink of themselves as part of the \"Holy Roman Empire\"? What about the various\nChinese dynasties?",
  "data/reddit-ask/r/AskHistorians/comments/pmd58i/why_did_people_from_nepal_not_climb_mount_everest.json": "I was reading a book by a Nepalese climber the other day about promoting\nclimbing my Nepalese climbers over that of Europeans and Americans. Of course I\nknow about the Sherpas who guided Europeans up Everst in the 20th century but\ndid any Nepalese people try to climb Everest before the presence of…",
  "data/reddit-ask/r/AskHistorians/comments/pmdhn4/why_is_the_roman_empire_after_212_ad_not_regarded.json": "It is often said that nationalism is a very modern concept which first\noriginated in France just before the French Revolution. But the Roman concept of\ncitizenship, Romanitas ('Romanness'), and especially their idea that anyone\ncould be a Roman if they accepted Roman civilisation sound awfully…",
  "data/reddit-ask/r/AskHistorians/comments/pmdx4g/when_did_it_become_common_for_american_women_to.json": "My mother (b. 1948) said something the other day that struck me as strange. She\nsaid that growing up, ear peircing wasn't very common.\n\nShe grew up in Minneapolis, and according to her, the only women who had their\nears pierced were Latina.\n\nShe didn't get her ears pierced until she was in college…",
  "data/reddit-ask/r/AskHistorians/comments/pmet3z/why_did_opium_cause_so_many_problems_in_china_but.json": "As far as I know opium was also sold and consumed in countries like Britain",
  "data/reddit-ask/r/AskHistorians/comments/pmjrdg/is_there_evidence_for_the_cobra_effect_story.json": "Over in r/history [/r/history], u/jehoshua42 [/u/jehoshua42] asked about\ninstances where attempts to solve a problem end up making it worse.\n\nThe example that sprang to my mind was the story often told (for example on QI)\nof the time the British Raj issued a bounty on cobras, only to find the…",
  "data/reddit-ask/r/AskHistorians/comments/pmkshi/a_common_question_on_this_sub_asks_who_was.json": "Obviously those three are way more complex than the best parts of their legacy,\nbut what they stood for was selflessness, freedom, equality, and nonviolence.\nWho embodied those ideals up to say, the early 20th century? Jesus? St. Francis\nof Assisi?",
  "data/reddit-ask/r/AskHistorians/comments/pml1zl/did_any_prominent_exnazis_become_involved_in.json": "I'm aware of plenty of cases of former Wehrmacht generals endorsing the \"clean\nWehrmacht\" myth, or Nazi officers denying personal knowledge of or involvement\nin the Holocaust. But were there any prominent Nazis (e.g., officers who sat\nwell above the rank-and-file, or people who had political sway…",
  "data/reddit-ask/r/AskHistorians/comments/pmluaw/how_serious_was_the_talibans_offer_to_hand_over.json": "In October 2001, the Taliban gave an offer to hand-over OBL if the US gave him\nevidence. Obviously that didn't happen but curious as to the reason why.\n\nhttps://www.theguardian.com/world/2001/oct/14/afghanistan.terrorism5",
  "data/reddit-ask/r/AskHistorians/comments/pmrgwv/in_both_sweden_and_denmark_standarized_language.json": "Dialects are primary mode of communication in Norway and Bokmal is seldom used.\nIIRC even when two Norwegians do not understand each other, they are more likely\nto use English than Bokmal.",
  "data/reddit-ask/r/AskHistorians/comments/pmt11j/at_he_time_of_its_publication_1924_was_the_twist.json": "Spoilers I guess although I'll momentarily state why it does not matter.\n\n\"The Most dangerous Game\" is a short story by Richard Connell where a big white\nhunter, Sanger Rainsford, washes up on the shore of a private island after a\nboating accident and meets its owner, General Zaroff. The general is…",
  "data/reddit-ask/r/AskHistorians/comments/pmu2ft/recommendation_whats_the_contemporary_equivalent.json": "Hi Historians!\n\nMy niece is becoming very interested in studying history, and I remember fondly\nreading GG&S back in the day and obtaining a new way of thinking about systemic\nfactors throughout historical events.\n\nI would purchase GG&S for her to read but... I feel like contemporary historians\nmay…",
  "data/reddit-ask/r/AskHistorians/comments/pmuyso/we_hear_that_mohawk_ironworkers_built_new_york.json": "I’ve seen many times that Mohawk ironworkers did much of the work on NYC’s\nskyscrapers because they have no natural fear of heights. I’m wondering if\nthat’s at all true, and where that idea came from.",
  "data/reddit-ask/r/AskHistorians/comments/pn5xcy/its_1875_king_ludwig_ii_and_by_extension_all_of.json": "For context, I'm Hard of Hearing and recently went to a Broadway show. The\ntheater gave me a set of headphones so I could listen to the singers at a much\nhigher volume and actually understand the lyrics and generally enjoy the show.\nIt made me wonder about life for those with hearing difficulties…",
  "data/reddit-ask/r/AskHistorians/comments/pn712a/wikipedias_article_on_us_civil_war_prison_camps.json": "The picture is at the top of this page:\nhttps://en.wikipedia.org/wiki/American_Civil_War_prison_camps\n\nMy curiosity was raised because he really doesn't seem to be in a condition one\nwould recover from - I doubt he could even move in his state - but the caption\nclaims he was still \"barely alive\" at…",
  "data/reddit-ask/r/AskHistorians/comments/pn86l4/the_meaning_of_one_of_the_words_in_the_lords.json": "Wikipedia [https://en.wikipedia.org/wiki/Epiousios] reports that St Jerome\nstruggled with identifying the meaning of this word in the Lord's Prayer in 382\nAD -- it's astonishing to me that that the meaning of a word in one of the most\nwell-known parts of the Gospels could be such a mystery a few…",
  "data/reddit-ask/r/AskHistorians/comments/pn8d58/what_happened_after_they_took_the_cocaine_out_of.json": "By which I mean, was there any kind of public health issue? Was there any\npercentage of the population going through withdrawals? And if so how was that\nhandled? I did a small bit of poking around and I could easily find sources\nabout there having been cocaine in the soda and why they stopped doing…",
  "data/reddit-ask/r/AskHistorians/comments/pndkk5/monday_methods_revisiting_female_composers_and.json": "For the vast majority of human history, women have been relegated to a\nsupporting, secondary role. I’d love to be able to say that patriarchal\nheteronormativity is over and done with, but it ain’t. Femininity and womanhood\ncontinue to be minimized and associated with weakness and emotionality.…",
  "data/reddit-ask/r/AskHistorians/comments/pneyle/how_were_the_european_powers_and_especially.json": "The Nine Years' War had exhausted the European economies and especially that of\nthe French. How were they still able to fight a major 11 year long war 5 years\nlater?",
  "data/reddit-ask/r/AskHistorians/comments/pnhjvk/what_were_the_effects_of_having_all_the_police.json": "In documentaries about 9/11, they always have a part where fire and police\ndispatchers put out a call for all personnel to get to the World Trade Center.\nDid this literally mean all personnel, leaving firehouses and police precincts\nwith just skeleton crews, or even unstaffed? If so, how were fires…",
  "data/reddit-ask/r/AskHistorians/comments/pnho7s/how_famous_was_edwin_booth_when_he_was_alive_how.json": "Were actors as famous as their modern counterparts or less famous (I’m guessing\nless famous, but I might be wrong)",
  "data/reddit-ask/r/AskHistorians/comments/pni4b3/did_karl_marx_arm_himself_if_so_with_what.json": "Marx is quoted as saying \"Under no pretext should arms and ammunition be\nsurrendered; any attempt to disarm the workers must be frustrated, by force if\nnecessary\" -- do we know if he armed himself and what with?",
  "data/reddit-ask/r/AskHistorians/comments/pnnneu/when_big_cities_like_london_or_paris_first_built.json": "So I know this became a more pressing issue in these cities as population\ndensity increased, and that there have been events like the 'Great Stink' in\nLondon that acted as a trigger, but what I'm curious is how the political\ndiscussion was at that time. Who was against it? What were their arguments?…",
  "data/reddit-ask/r/AskHistorians/comments/pnpwow/how_come_there_were_so_many_cave_paintings_found.json": "I was looking on the Wikipedia page for cave paintings\n[https://en.m.wikipedia.org/wiki/Cave_painting] and noticed that the majority of\nthe famous cave paintings that have been found are located in France. Is there a\nreason why that is?\n\nWas there a large prehistoric human population in France at…",
  "data/reddit-ask/r/AskHistorians/comments/pns1tk/why_werent_native_americans_the_primary_slave.json": "I understand that Native Americans were enslaved in certain cases, most notably\nby Christopher Columbus in Puerto Rico. However why is it that the primary\nenslaved population in the Americas were African? From both an economic and\nconvenience perspective it seems odd that people from Europe would…",
  "data/reddit-ask/r/AskHistorians/comments/po046x/why_were_such_strange_feudal_privileges_given_to.json": "> One of his privileges was to claim the forfeit of a horseshoe from anyone of\n> rank visiting his lordship in Oakham. A unique collection of horseshoes\n> presented by royalty and peers of the realm\n> [https://en.wikipedia.org/wiki/Peers_of_the_realm] passing through the manor,\n> hangs on the walls…",
  "data/reddit-ask/r/AskHistorians/comments/po1nu8/why_have_india_and_burma_had_so_little_historical.json": "Bengal and Assam (the Indian regions which border Burma) have been part of India\nsince the age of the mahajanapadas. But there is an abrupt cultural change when\none crosses the border from India to Burma; from Indic and Hindu/Muslim to\nSinitic and Buddhist. Why is that?",
  "data/reddit-ask/r/AskHistorians/comments/po2vvb/what_did_marble_sculptors_do_with_all_of_the.json": "Did they just throw it in the trash, or was there some method of recycling?",
  "data/reddit-ask/r/AskHistorians/comments/pok8fj/in_a_deleted_scene_for_the_movie_jarhead_the.json": "Reposting this, as it was incorrectly removed for violating the 20 year rule\n(Jarhead is about the first Gulf War).\n\nThis is the scene in question: https://www.youtube.com/watch?v=x9BUxnVhq7Y\n\nI had read before that there were Western communities in Saudi Arabia composed\nmainly of oil workers and…",
  "data/reddit-ask/r/AskHistorians/comments/pomvdr/as_the_captain_of_a_royal_navy_frigate_during_the.json": "I know that frigate captains could usually paint their ship whatever colours\nthey liked and that they could even add a few more guns abroad, if Patrick\nO'Brian is to be believed.\n\nHow else did Royal Navy captains modify their ships to make it more like their\nown? Could they also say, add extra men…",
  "data/reddit-ask/r/AskHistorians/comments/pov9p9/a_common_view_of_the_napoleonic_wars_can_be.json": "I’m very skeptical that this is not the view held by most people in say, France,\nGermany, Austria, or Russia, but due to me not speaking those languages, I can’t\nlook up their perspectives.\n\nSimilarly, in looking up primary sources on the subject, I’m immediately struck\nby the quick realization that…",
  "data/reddit-ask/r/AskHistorians/comments/powcdf/why_did_robert_e_lee_continue_to_fight_at.json": "On day one of the battle, the Confederates pushed back the Union into the hills\naround Gettysburg. Lee knew the hills could be used for a solid defensive\nposition, evident by the fact he ordered his generals to take the hills if they\ncould. So why did Lee even bother to attack the Union, rather than…",
  "data/reddit-ask/r/AskHistorians/comments/poyh17/did_ancient_greeks_and_romans_wear_underpants.json": "That's all.",
  "data/reddit-ask/r/AskHistorians/comments/pp2wmx/ww2_what_was_my_grandfather_doing_in_norway.json": "Hello!\n\n*Not a historian here*, I'm sure my question isn't too complex, I'm just seeking\ncontext and understanding. Sorry for the vagueness, I really don't know much\nabout history or my grandfather.\n\nMy grandpa served for the U.S. during WW2, something that was sorta known in my\nfamily but never…",
  "data/reddit-ask/r/AskHistorians/comments/pp4pxf/if_robin_hood_were_real_and_were_to_host_a_feast.json": "I used to read in a Robin Hood book I had in middle school where he would\npretend to kidnap someone and then treat them to a nice meal and then give them\na gift of money and then send them on their merry way. Always wanted the food\nthey had especially the cheese which seemed to be soft.",
  "data/reddit-ask/r/AskHistorians/comments/pp6pcc/where_was_homers_the_iliad_found_was_it_found.json": "Was Homer’s Iliad found in an excavation site? Or is it one of those things\npassed down and written about to the present day? Do we have transcriptions from\nmultiple places pieces together? Thanks for the help!",
  "data/reddit-ask/r/AskHistorians/comments/ppdxwr/it_wasnt_about_slavery_exposing_the_great_lie_of.json": "I came across this well reviewed book on Amazon, but it seems filled with rather\ndubious arguments and claims that massage facts to fit the \"not about slavery\"\nnarrative.\n\nI was wondering if there were any Civil War historians familiar with the book\nthat could point out what might be valid (if…",
  "data/reddit-ask/r/AskHistorians/comments/pph3d1/what_do_historians_know_about_the_y_chromosome.json": "I tried to post this question yesterday, but it was removed. The mods asked me\nto submit a revised question more in line with the subreddit's guidelines. The\nmods were nice about it. Let's have a round of applause for the mods.\n\nHere's [https://www.nature.com/articles/s41467-018-04375-6] an article…",
  "data/reddit-ask/r/AskHistorians/comments/ppnvc2/in_aladdin_1992_aladdin_in_his_guise_of_prince.json": "This is a repost from a couple of months ago to try to get an answer. Since it\ndidn't get an answer the first time.",
  "data/reddit-ask/r/AskHistorians/comments/ppsnxe/why_did_china_become_a_permanent_un_security.json": "They weren't as strong as they are today. They didn't have the military might\nand the wealth to impose the global \"security\". I can understand if the allied\nchose them based on China's power now, but not at that time. I don't think they\nalso had the political leverage to lobby their way into the…",
  "data/reddit-ask/r/AskHistorians/comments/ppuly9/why_is_athens_still_around_but_not_sparta.json": "Why is Athens still around today but not Sparta even though sparta won the\nPeloponnesian War?",
  "data/reddit-ask/r/AskHistorians/comments/ppvkl4/in_the_song_good_ol_rebel_the_speaker_says_he.json": "I know that for the most the Confederates revered the founding fathers and the\nrevolutionary generation, and accused the north of trampling on the founding\nprinciples, and even put George Washington on their national seal.\n\nHowever, there are a few scattered anecdotes and bits of trivia that seem…",
  "data/reddit-ask/r/AskHistorians/comments/ppx472/why_did_industrialization_under_the_song_dynasty.json": "The economy of the Song Dynasty smelted a LOT of steel and harnessed the power\nof coal. They had money, the ultimate commodity that exchanges different\nuse-values with each other, suggesting they had commodity production. Yet\ndespite features of industrialization and commodity production, China was…",
  "data/reddit-ask/r/AskHistorians/comments/pq2kj5/in_medieval_europe_there_existed_a_superstition.json": "First off, I'm working on the assumption that some people really believed these\nstories. They seem very silly to us today but at least some people really\nbelieved in these stories, right?\n\nSecond, these stories are often full of advice on how to avoid your baby or even\nyourself from being kidnaped…",
  "data/reddit-ask/r/AskHistorians/comments/pq4g46/what_exactly_was_nazi_germany_holding_out_for.json": "A lot has been discussed on what German plans for the first half of the war of\nthe war was, and stuff like Generalplan OST, but what about for the later half\nof the war, when they started loosing? Stuff like the volkstrumm and the battle\nof the bulge seem like they were trying to buy time, but buy…",
  "data/reddit-ask/r/AskHistorians/comments/pq50yn/how_did_albania_actually_fall_into_the_whole.json": "I recently saw a Rare Earth video on how Albania got into a civil war and\nexperienced economic collapse due to Ponzi and Pyramid schemes. Unfortunately,\nthe video is quite short in detail in how that event actually happened and\nWikipedia seems to be of little help too.\n\nAny historians out there, can…",
  "data/reddit-ask/r/AskHistorians/comments/pq8k5a/homosexuality_was_legal_in_revolutionary_and.json": "I know that homosexuality was made legal during the revolution, and that this\nwas reaffirmed in Napoleon's later penal code. I've also heard notable\npoliticians and other public figures from this era being described as homosexual\nbut that being said, I can't find any information relating to whether…",
  "data/reddit-ask/r/AskHistorians/comments/pq9i8i/how_much_were_the_economies_of_european_nations.json": "How many people you have seems directly correlated to the absolute quantity of\nstuff that you can make, produce, achieve, etc. Did countries view it as a\ndisaster? Did they try to stop it?",
  "data/reddit-ask/r/AskHistorians/comments/pqboov/when_patrick_obrian_was_revealed_to_have.json": "I, like a lot of people here I imagine, am a big fan of Patrick O'Brian's\nAubrey-Maturin series. All I knew of the author was the autobiographical note\nthat was included at the back of one of the printed editions of his books. It\nbasically sets out that (from memory, excuse me if I get this…",
  "data/reddit-ask/r/AskHistorians/comments/pqjz96/the_irish_potato_famine_18451852_while_often.json": "From cursory overview, the events share a large amount of similarities. Both\ncountries were victim to failed economic policies instituted by their occupiers,\nwhether it be Britain's strict adherence to laissez faire capitalism or Stalin's\nrush to modernisation.\n\nThe Irish potato famine, though an…",
  "data/reddit-ask/r/AskHistorians/comments/pqssgg/whats_the_history_behind_the_stereotypical_young.json": "You see it in many types of media, even today, maybe accompanied by an oversized\nlollypop and a pair of overalls.\nYou might use it to dress up an adult man for the comedic effect of making him\nlook like a kid.\n\nMy questions are: when and why has this hat been created? Why is it still…",
  "data/reddit-ask/r/AskHistorians/comments/pqu0uu/how_long_has_69_been_the_funny_sex_number.json": "Presumably humans have been enjoying that particular activity for millennia, but\nwhen was it first connected with the number 69, and become a well-known\ninnuendo?\n\nI remember Alanis Morrissette using it somewhere on 1995's Jagged Little Pill,\nso I'm pretty sure this doesn't fall foul of the 20 year…",
  "data/reddit-ask/r/AskHistorians/comments/pqxqib/in_the_parent_trap_1961_the_plot_hinges_on_the.json": "I have recently rewatched the original Parent Trap, which was made in 1961 by\nWalt Disney. The premise of the film is that two twins are separated by their\nparents shortly after their birth, due to divorce, with one daughter raised by\neach parent in isolation; they discover one another 14 years…",
  "data/reddit-ask/r/AskHistorians/comments/pr4f42/are_there_muslim_communities_in_spain_to_this_day.json": "I was curious to know if there are still any significant Muslim communities\nliving in Spain who have been around since Al-Andalus times, and managed to\nescape all those persecutions and are still out there today.\n\nAnd if so, where are they located, for the most part? I'd be curious to see how\ntheir…",
  "data/reddit-ask/r/AskHistorians/comments/prckf0/in_peanuts_an_unseen_adult_character_is_shown_to.json": "In Peanuts, the short lived character 555 95472, along with his sisters 3 and 4,\nwas a victim of their dad's frustration at how everyone was being numbered, and\ntheir dad decided that if everything was going to be numbered anyway then they\nmay as well take on their zip code as their last name and…",
  "data/reddit-ask/r/AskHistorians/comments/prn9km/tomas_aquinas_wrote_that_animals_do_not_have.json": "The idea that animals do not really suffer seems stupid, I don't know what other\nword to use to describe it\n\nAnd yet here we have these two very famous and influential thinkers who both\nagreed with this idea\n\nThis makes me think that perhaps the idea that animals do not have real emotions\nhas…",
  "data/reddit-ask/r/AskHistorians/comments/prqx54/what_is_the_longest_surviving_country.json": "To be more precise, which country has existed for the longest period of time\nwithout being dissolved or suffering a major change in government (due to\npuppeting, revolution, imperialism, or otherwise)?",
  "data/reddit-ask/r/AskHistorians/comments/prutwd/were_man_eating_animals_a_common_problem_during.json": "If you haven't seen the Ghost in the Darkness, do check it out, its rather\nfascinating!\n\nSo here we are building a railway through some jungle in africa or india or\naustralia, besides mosquitos, were there other dangerous animals that claimed a\nsignificant number of lives?\n\nIf someone wants to…",
  "data/reddit-ask/r/AskHistorians/comments/pryw1n/im_a_traveler_in_ad1200_going_from_lübeck_across.json": "I'm curious on how a secular traveler; not a pilgrim which had some protections;\nwould take on a journey of several hundred miles.\n\nI'm as close to middle class as existed, not a serf but not a noble. Just a well\nof peasant-merchant.\n\nDo I go \"Gandalf-style\"? A pony, a small cart of supplies but…",
  "data/reddit-ask/r/AskHistorians/comments/psdxrm/is_calling_the_first_world_war_that_and_not_the.json": "I am currently listening and reading a lot about the 1900 time range and the\nprelude to the Great War. Thinking about it without having the second on in the\nback of my mind opened me to a more broad acknowledgement of its effects for the\nBalkans, Russia, Austria, Germany, even the US.\n\nFrom my…",
  "data/reddit-ask/r/AskHistorians/comments/psewmw/at_the_turn_of_the_century_why_was_the_ottoman.json": "The Ottomans seemed to have much more of a say in terms of European politics and\nwere a fairly formidable force militarily if not on the same level as France,\nBritain, Germany and Russia. Spain and Portugal on the other hand were nowhere\nnear this level and had lost their empire by this point. So…",
  "data/reddit-ask/r/AskHistorians/comments/psflc3/was_there_a_dollar_equivalence_in_the_marshall.json": "There's a 9gag post (https://9gag.com/gag/aDdE1wB) which smells a bit like\nb*llocks, I was curious if this is actually an area of study.  Basically it's a\ntwitter post that reads:   \"the world has spent ~$900 billion (in today's\ndollars) in aid to Africa since 1960, according to the OECD.   \"After…",
  "data/reddit-ask/r/AskHistorians/comments/psoxq7/if_a_roman_soldier_from_the_2nd_century_were_to.json": "Beyond differences in equipment, would he still recognize the basic practices,\ntactics, and structure of the army? Or would it mostly all seem new to him?\n\nFrom his perspective, would the overall training and discipline of the army\nappeared to have changed much, and if so, to what extent?",
  "data/reddit-ask/r/AskHistorians/comments/pszdae/why_wasnt_nixtamalization_popular.json": "I've read that nixtamalization (soaking corn in a limestone solution; Aztecs and\nsome American Natives did it for centuries) greatly improves the nutritional\nvalue of corn. Why haven't people adopted the method in other countries? I've\nread of numerous malnutritions and famines in Europe could've…",
  "data/reddit-ask/r/AskHistorians/comments/pt0gc4/to_what_extent_is_modern_european_and_western.json": "Obviously the nations of the past that participated in colonialism and\nimperialism benefitted immensely, but what are the long-term effects that it has\non their wealth and economic robustness? Not just direct participation but also\nindirect if at all, as in for example Nordic countries which didn’t…",
  "data/reddit-ask/r/AskHistorians/comments/pt32er/why_werent_there_more_suicides_during_historic.json": "For example, I'm German and I learned that there were many suicides when the\nRussians invaded Germany at the end of WW2. There's also the story of how many\nfolks killed themselves as soon as they got gas again after the war. But you\nrarely read about suicides e.g. in the concentration camps.\n\nOfc…",
  "data/reddit-ask/r/AskHistorians/comments/pt3hoq/marco_polo_claimed_human_flesh_was_sold_for_food.json": "The description Marco Polo gave (or rather, the description that Rustichello\ngave) suggests human flesh was sold as a food commodity alongside other types of\nmeat in Fujian. This city was not under siege when this description was made, so\nthis instance(s) of cannibalism was not caused by extreme…",
  "data/reddit-ask/r/AskHistorians/comments/ptahc5/13rd_of_all_norwegians_moved_from_norway_to.json": "Britain losing Irish folks seems like a lot of MPs chalked it up as an\nacceptable loss, the proportion of Germans and Italians that came here as a\nportion of the population were much lower. Germany lost a few million people to\nemigration but had tens of millions to absorb the hit, similar with…",
  "data/reddit-ask/r/AskHistorians/comments/ptd6rx/its_thought_that_ernest_hemingway_killed_himself.json": "Did this ever reach KGB proportions? Everyone turning their neighbor in? This\nseems like it would take a huge amount of manpower, were people deputized just\nto surveil?\n\nLink to article i got the idea from\n\nhttps://www.theguardian.com/books/2011/jul/03/fbi-and-ernest-hemingway",
  "data/reddit-ask/r/AskHistorians/comments/pttu83/why_was_the_german_military_not_nazified_like_the.json": "As I understand it, when the Nazis took power they essentially turned every\naspect of civil society into Nazi organs - most infamously with the Hitler Youth\nreplacing all youth groups.\n\nHowever the German military remained under control of essentially Prussian\nmilitary professionals/aristocrats?…",
  "data/reddit-ask/r/AskHistorians/comments/ptwg9n/medieval_japanese_people_had_their_height.json": "Fish can be acquired in massive quantities. I don't get it.\n\nI've read up and apparently Spartans were taller than the average Greek, which\nwas attributed to rich pastures as opposed to a fish heavy diet.",
  "data/reddit-ask/r/AskHistorians/comments/pu1ucr/tiananmen_1989_is_it_true_that_the_chinese_army.json": "This is frequently mentioned here on reddit and elsewhere, but is it true, and\ndo photos that claim to document it come from reliable sources?",
  "data/reddit-ask/r/AskHistorians/comments/puajsq/were_any_american_religious_organizations.json": "https://en.wikipedia.org/wiki/The_Apotheosis_of_Washington\n\nTIL there's a huge mural depicting Washington amongst a bunch of Gods in the\nAmerican capitol building. It's definitely...interesting. Certainly there's a\nlot it says about how Americans tend to treat the founding fathers and…",
  "data/reddit-ask/r/AskHistorians/comments/pueq0k/i_saw_on_rhistoryporn_a_antikkk_group_called_the.json": "there was a photo where they shows the outfits on newspapers, and to be honest\nit did look like a mockery of the KKK, but in case I am wrong, can anyone shed\nlight about this?",
  "data/reddit-ask/r/AskHistorians/comments/punqi1/scooby_doo_has_an_episode_where_scooby_wins_1.json": "1) Would 1 million in confederate cash be worth anything today whether as a\ncollectors item or anything?\n\n2) Was confederate cash really used much? Was it used in banks at the time?\n\n3) and would anyone have been even close to hoarding a million confederate\ndollars?\n\nJust curious all around about…",
  "data/reddit-ask/r/AskHistorians/comments/puv7db/what_prejudices_would_a_german_jewish_veteran_of.json": "An interesting post came up on r/interestingasfuck [/r/interestingasfuck] (so\nfar so good) with a picture of a Jewish war veteran having Nazi’s posted outside\nhis shop. Delving deeper into the comments it appears this may be Richard Stern\n- a German Jew who later went on to enroll in the US army and…",
  "data/reddit-ask/r/AskHistorians/comments/pv6z4y/how_did_the_ancients_interpret_the_delay_between.json": "Our understanding of the speed of light and the speed of sound is very very new\nyet it was observable always. When did people start catching on? Do we know how\na person would understand this 2,000 years ago?",
  "data/reddit-ask/r/AskHistorians/comments/pv8tyd/i_read_burgundians_were_often_called_false_french.json": "I find it odd that at a time when nation states weren't a thing people had this\nnotion of burgundians being \"french but not french\"\n\nI have never heard of the Spanish people calling Portuguese people \"false\nspaniards\" or german people calling austrians \"false germans\", specially not\nback then\n\nThis…",
  "data/reddit-ask/r/AskHistorians/comments/pvctut/how_have_muslim_scholars_traditionally_reconciled.json": "Non-Muslims, obviously, have the option of rejecting the claim that the Qur'an\nis perfectly preserved, and some Muslims, especially in more modern times, have\nrejected the Ahadith that claim that portions of the Qur'an were lost. But\ntraditional Muslim scholars of Ahadith categorized multiple…",
  "data/reddit-ask/r/AskHistorians/comments/pvgfq6/why_did_the_british_not_just_give_the_american.json": "In the lead-up to the Revolutionary War, a big sticking point for the Americans\nwas “no taxation without representation.” So why did the British not simply give\nthe Americans representation? It seems to me that if they did that, they could\nstill outvote the colonial representatives in Parliament and…",
  "data/reddit-ask/r/AskHistorians/comments/pvmx2v/how_did_middle_age_empires_keep_control_of.json": "An example of what I'm talking about would be something like Prussia in the\nearly 17th century\n[https://www.zum.de/whkmla/histatlas/germany/prussia17011740.gif], where you\nhave multiple, somewhat large enclave states entirely disconnected from the main\nstate with not even naval access to connect…",
  "data/reddit-ask/r/AskHistorians/comments/pw5ptf/how_were_mercenaries_hired_during_medieval_times.json": "I understand that during large wars and campaigns many kingdoms hired out\nmercenaries to bolster their forces alongside trained knights and conscripted\npeasants, but how were those mercenaries hired or selected to fight in those\nwars? Were they already know to kingdoms through some sort of…",
  "data/reddit-ask/r/AskHistorians/comments/pw5vds/the_munsters_and_its_rival_series_the_addams.json": "At the end of that year's TV season, this show ranked #18 in the Nielsens, with\na rating of 24.7, while The Addams Family came in at #23, with a 23.9 rating. At\nthe time, Nielsens indicated what percentage of American TV households tuned in\nto any given program. By the end of the following year,…",
  "data/reddit-ask/r/AskHistorians/comments/pweoqk/in_the_movie_first_man_buzz_aldrin_is_made_out_to.json": "I realize the reality of our heroes is often different from the official\nnarrative but this seems to be a very big difference from common perceptions.\nI've tried Googling this down and I can't seem to find an origin for this\nparticular depiction of Buzz Aldrin. The only things that come up whem…",
  "data/reddit-ask/r/AskHistorians/comments/pwmygv/meditations_by_marcus_aurelius_and_translation_in.json": "I was listening to Meditations and I came across a passage that stuck out.\n\n#1\n\n> sculptors; he will see a kind of bloom and fresh beauty in an old woman or an\n> old man; and he will be able to look with sober eyes on the seductive charm of\n> his own slave boys. Book 3.2 (Penguin Classics edition;…",
  "data/reddit-ask/r/AskHistorians/comments/pwpvd9/why_was_winston_churchill_voted_out_of_office_in.json": "I read somewhere that after World War 2 had ended in Europe, Churchill had a\nhumiliating defeat in the British elections. Why was that? No place I've looked\nhas given me a clear answer, so I've come here to ask. Thanks!",
  "data/reddit-ask/r/AskHistorians/comments/pwsx8o/is_the_american_attitude_to_drinking_in_modern.json": "As a British person, I have only known life through a British perspective, and\nan attitude to drinking came with that. I remember I was first allowed one\nbottle of beer on special occasions when I was 14, and by 16 I could pretty much\nshare really whatever my Dad was having in an evening, with how…",
  "data/reddit-ask/r/AskHistorians/comments/pwu5oc/how_likely_was_it_that_a_roman_legionary_would.json": "Obviously yes, a broad question and it depends on when and during which wars.\nBut on average, was it something soldiers expected to achieve? Or was it a long\nshot?",
  "data/reddit-ask/r/AskHistorians/comments/px022x/on_the_front_page_there_is_a_story_about_betty.json": "Snopes says incident is true because both of them have corroborated it. A simple\ngoogle search leads to many links that were published recently. What I would\nlike to see is original articles or comments that criticized her to understand\n1) If it was prevalent in all of America or only certain parts…",
  "data/reddit-ask/r/AskHistorians/comments/px2vmi/did_cowboys_and_native_americans_ever_actually.json": "So I've recently been reading into the history of the American West (mainly due\nto playing Red Dead Redemption 2 😅), and I began to wonder about this. The\nclassic Hollywood trope was always that the Cowboys and Native Americans were\nconstantly at each others throats, but even my basic level of…",
  "data/reddit-ask/r/AskHistorians/comments/px43fj/why_is_labrador.json": "It's this big random chunk of worthless taiga that for some reason is carved off\nthe mainland and assigned to the island of Newfoundland. Hardly anybody lives\nthere, there isn't much in the way of natural resources, the climate is not\nconducive to settlement, so why would it be a separate…",
  "data/reddit-ask/r/AskHistorians/comments/px7moo/after_the_massacre_in_rwanda_the_un_admitted_its.json": "I ask this because although we have never seen another ethnic cleansing to match\nafter the massacre in Rwanda, there have been some relevant attacks on ethical\ngroups, even a big one happening right now in China.\n\nHas the UN managed to prevent any ethnic (or something like that) extermination?",
  "data/reddit-ask/r/AskHistorians/comments/px85pc/why_are_new_hampshire_and_vermont_so_different.json": "I have a lot of family in New Hampshire, and travel to Vermont a couple times a\nyear as well. It seems like there's a bit of a rivalry between the two states.\nThe culture of each is pretty different in a lot of ways, and their politics are\nvastly different, at least for New England politics. How did…",
  "data/reddit-ask/r/AskHistorians/comments/pxb9at/at_a_first_glance_occupational_burnout_sounds.json": "Edit: If so, how was it percieved? How did communities respond if one of its\nmembers came down with a case of it?",
  "data/reddit-ask/r/AskHistorians/comments/pxbgds/why_did_the_ban_on_pork_skip_christianity_but.json": "Hello!\n\nI teach Global History to High Schoolers and during our World Religions unit we\ngroup the three Abrahamic Religions together so that students can see the\nprogression of the original ideas through three different religions.\n\nHowever, for some reason this year I randomly had this thought that…",
  "data/reddit-ask/r/AskHistorians/comments/pxlpdw/what_caused_the_assyrians_to_and_i_believe_this.json": "Hi all,\n\nFirst time World History I teacher here (I'm usually teaching Western II) and am\nreally researching the Assyrians in depth for the first time.\n\nWhat I've been able to glean is that the Assyrians experience some kind of\nreligious conflict in the 1300s BCE, and that afterwards they begin to…",
  "data/reddit-ask/r/AskHistorians/comments/pxnco3/did_nazi_germany_have_comic_books_and_if_so_what.json": "I was inspired to ask this question, because I have seen a lot of comics from\nWorld War II America where the covers have super heroes beat up Nazis. Did\nlittle German kids read about Captain Deutschland smacking Churchill around?",
  "data/reddit-ask/r/AskHistorians/comments/pxss8k/why_are_japanese_noble_families_translated_as.json": "Why clan? Why did translators chose the word \"clan\", why not other words with\nsimilar meaning. Any reason as to why \"clan\" is the preferred word of choice\nover, say house?",
  "data/reddit-ask/r/AskHistorians/comments/pxzh2l/how_far_back_in_human_history_were_people.json": "The more I think about it the more I wonder. While eating is a necessary and\ninstinctual thing to do, smoking is absolutely not. Ingesting plants/meat orally\ncan sometimes give you different highs or have a strong effect on the body/mind,\nbut smoking them would take a whole new level of creativity.…",
  "data/reddit-ask/r/AskHistorians/comments/pyfiu5/why_was_alan_turing_condemned_for_his.json": "Why was Alan Turing vilified, convicted, and chemically castrated despite his\nvital contributions, while his near contemporary intellectual John Maynard\nKeynes, open about his homosexuality, was tolerated?",
  "data/reddit-ask/r/AskHistorians/comments/pyile4/how_italian_cuisine_became_something_so.json": "Massimo Bottura became famous for making modifications to traditional dishes and\ngenerating the wrath of locals. It is common to find videos on the internet of\nirate Italians with modifications and changes in the ingredients of Italian\ndishes. there is this reputation that Italians only like the…",
  "data/reddit-ask/r/AskHistorians/comments/pymhas/cosmo_kramer_never_slipped_one_past_the_goalie.json": "On October 13, 1994, the Seinfeld episode \"The Chinese Woman\" first aired. In\nthat episode, one of the plot points is Kramer's supposed low sperm count. The\ncharacters Jerry and Kramer have a discussion:\n\n\n\n> KRAMER: You ever get a woman pregnant?\n> \n> JERRY: I'm sorry, Kramer. Those records are…",
  "data/reddit-ask/r/AskHistorians/comments/pyp9hu/i_am_a_british_or_french_soldier_in_wwi_my_army.json": "I know MOST wouldn't be executed, but I always wondered what they would do or\nsay. Would I be reprimanded? Discharged? Or more of a pat on the back and a \"ah\nyou did your best“?",
  "data/reddit-ask/r/AskWomen/comments/pfc4rk/in_what_ways_have_you_seen_your_jobprofession.json": "Were there any that got it right?",
  "data/reddit-ask/r/AskWomen/comments/pfto17/what_expectations_make_yall_feel_the_most_pressure.json": "I was reading about women’s rights and Have noticed a lot of the pressures that\nhave been placed on y’all over the years from so many different aspects. Weather\nculturally,martially, societal standards, significant other expectations, amidst\nvarious others. What do y’all feel the most pressure from.…",
  "data/reddit-ask/r/AskWomen/comments/pfuedq/what_are_you_looking_forward_to_for_the_month_of.json": "Thought I’d start some positive conversation 🥰",
  "data/reddit-ask/r/AskWomen/comments/pho1sc/what_i_want_to_say_is_thank_you_x.json": "Long time reader first time commenter.\n\nHad a really rough last few months but this subreaddit has really helped me\nthrough\n\nI'm sorry for not joining earlier to upvote comments but please keep posting,\nyou don't know how many people you are positively reaching out to\n\nThank you all 🙂❤🙂",
  "data/reddit-ask/r/AskWomen/comments/phs7lp/has_your_relationship_with_your_father_gotten.json": "There's some beautifully vulnerable, open and honest comments in this thread so\nI just wanted to remind people that our relationships with our parental figures\ndo not reflect our own self-worth and intrinsic value. ❤️",
  "data/reddit-ask/r/AskWomen/comments/pi7zgb/if_youve_ever_confronted_a_partner_about_cheating.json": "Did they try to lie or be upfront, for how long? curious to hear people’s\nexperiences",
  "data/reddit-ask/r/AskWomen/comments/pihp1x/what_is_a_habit_you_wish_you_adopted_sooner.json": "I mean one that you feel would've made your current life easier had you started\ndoing it when you were younger.",
  "data/reddit-ask/r/AskWomen/comments/pjammi/what_is_a_small_cheap_thing_you_like_to_buy_when.json": "It doesn't need to be a cosmetic; anything that \"sparks materialistic joy\" so to\nspeak.",
  "data/reddit-ask/r/AskWomen/comments/pk50bl/how_important_is_emotional_maturity_when_it_comes.json": "How does it rank compared to things like money, similar interests, physical\nattractiveness and why?",
  "data/reddit-ask/r/AskWomen/comments/pl1kc2/what_is_something_you_have_contradicting_or_mixed.json": "What is something you have contradicting or mixed thoughts/feelings about ?",
  "data/reddit-ask/r/AskWomen/comments/pleuej/what_are_your_random_items_that_make_you_feel.json": "I'll start: wearing white socks with dark pants because it reminds me of cats\nwith white paws, who are adorable.",
  "data/reddit-ask/r/AskWomen/comments/pllhtp/whats_your_relationship_with_porn.json": "How often do you indulge in it and have you ever had problems with your sex life\nbecause of it? Similarly, have you ever thought about whether that habit is\nhealthy/normal? I'm interested to see your takes, since the industry is targeted\nmainly towards men.",
  "data/reddit-ask/r/AskWomen/comments/pltff3/childfree_women_how_do_you_handle_it_when_a_close.json": "More specifically, as their lifestyles and values change along with having\nchildren, how do you adjust?",
  "data/reddit-ask/r/AskWomen/comments/pm39as/what_are_the_advantages_to_having_small_boobs.json": "And don't say easy to lie on the stomach cuz as it turns out big boobs are not\nan impediment to that.",
  "data/reddit-ask/r/AskWomen/comments/pmvhym/how_do_you_respond_to_someone_who_says_youre_too.json": "I know I can’t be the only one who gets this a lot, just wondering how women out\nthere respond to this.",
  "data/reddit-ask/r/AskWomen/comments/pnxfbz/raskwomen_whats_your_most_shallow_dealbreaker_and.json": "Just curious, of course.",
  "data/reddit-ask/r/AskWomen/comments/pohpji/ladies_whats_a_flirting_strategy_that_has_never.json": "eye contact, playing with their hair, being playful, acting innocent etc. what\nhas actually helped you?",
  "data/reddit-ask/r/AskWomen/comments/pol56e/what_are_some_of_the_financial_decisions_that_you.json": "Or glad you did it",
  "data/reddit-ask/r/AskWomen/comments/poy7iz/tips_on_how_to_look_good_in_photos_others_take_of.json": "Thanks💞",
  "data/reddit-ask/r/AskWomen/comments/ppvb1t/what_are_some_compliments_that_someone_gave_you.json": "I have been told that I “lead with love” and that one makes my heart happy :)",
  "data/reddit-ask/r/AskWomen/comments/pq0tzk/what_are_some_examples_of_your_boundaries.json": "I keep seeing that word \"boundaries\" everywhere lately and honestly I feel like\nI don't have them or know what mine are.",
  "data/reddit-ask/r/AskWomen/comments/pqhhs9/former_tomboys_who_did_a_180_became_totally.json": "First let me clarify that I am not referring to women who were tomboy and then\nchanged up a bit and are now somewhere in the middle of the feminine and\nmasculine spectrum. I think that is pretty common in real life and many of my\nfemale friends are like that.\n\nI am asking about women who went from…",
  "data/reddit-ask/r/AskWomen/comments/pqzfhq/if_you_could_have_the_singing_voice_of_any_female.json": "singer of any time period, any genre, any level of fame",
  "data/reddit-ask/r/AskWomen/comments/pqzkqk/when_did_you_know_a_date_was_over.json": "Something they did, said? When did you decide you were not going out again?",
  "data/reddit-ask/r/AskWomen/comments/prbucj/canadian_women_of_reddit_what_are_your_thoughts.json": "Just curious how my fellow Canadians are feeling about election (not looking to\nstir the pot, btw!)",
  "data/reddit-ask/r/AskWomen/comments/prhujg/what_is_the_national_goto_drunk_food_in_your.json": "Very curious about this one ngl because I want to see if it varies.",
  "data/reddit-ask/r/AskWomen/comments/psgdmw/what_are_your_thoughts_on_gender_neutral_restrooms.json": "I’m a government worker in the U.K. and our new building will only have gender\nneutral bathrooms, and it will feature several urinals as well.\n\nSince more and more gender neutral bathrooms are being introduced here in the\nU.K. I want to know what are your thoughts on this? Would you for it or…",
  "data/reddit-ask/r/AskWomen/comments/pso6x5/why_do_you_feel_safe_or_unsafe_on_reddit.json": "Just had to report my first rando threat. Wondering how many others deal with\nthis crap.\n\nUPDATE: thanks so much to everyone giving their responses. I’m glad that the\nmajority of us are able to find ways to stay safe",
  "data/reddit-ask/r/AskWomen/comments/pt20uc/how_did_you_introduce_an_adult_toy_into_your.json": "Was it an issue with your partner? If so, how did you go about assuaging their\nfeelings towards an adult toy? I know communication, honestly etc etc. are\nimportant. What did you specifically do and did it work? Thanks!",
  "data/reddit-ask/r/AskWomen/comments/ptwu3u/how_did_you_tell_the_stylist_you_hate_what_they.json": "and how did your stylist respond? was it awkward?",
  "data/reddit-ask/r/AskWomen/comments/pu6nnc/women_of_reddit_what_symptoms_of_mental_illness.json": "Whether or not you knew you had a mental illness, what things happen to you that\nyou didn't connect to mental illness for a very long time? Why didn't you\nrealize it was mental illness, and what caused you to make the connection?\nEmotional, mental, physical, professional, interpersonal... Anything.",
  "data/reddit-ask/r/AskWomen/comments/pulttn/how_old_are_you_and_whats_the_most_important.json": "Edit: Wow! It’s so amazing to see the variety of responses! Thank you! Trying to\nread and reply to them all. Keep them coming ❣️",
  "data/reddit-ask/r/AskWomen/comments/pv3okv/when_did_you_realise_how_much_women_do_to_protect.json": "The story of my realisation, and context, is in comments.",
  "data/reddit-ask/r/AskWomen/comments/pwdgal/what_are_actions_or_movements_that_you_feel.json": "I for example feel uncomfortable jumping up and down in place because it makes\nme self aware of my chest.",
  "data/reddit-ask/r/AskWomen/comments/pwq7u3/what_are_some_great_albums_by_women_that_feature.json": "I feel like most \"great\" albums are usually about being young and jaded and\nangsty and trying to make things work with your sexy on-again-off-again\npartners. Nothing wrong with that but I'm getting older and also want to hear\ncatchy songs about the world beyond youth!",
  "data/reddit-ask/r/AskWomen/comments/pxgvex/how_important_is_it_to_you_that_your_partner.json": "And if it is important to you, how do you try to figure that out in the early\nstages of dating?\n\nETA: what type of political incompatibilities would prompt you break things off\nwith someone?",
  "data/reddit-ask/r/AskWomen/comments/pxvf8n/women_who_left_tech_when_did_you_leave_and_why.json": "Statistics show the following:\n\n 1. Only 20% of computer science professionals are women.\n 2. 50% of women abandon technology careers by the age of 35\n 3. Women are leaving tech roles at a 45% higher rate than men\n\n(according to data by Accenture and Girls Who Code)\n\nWhat made you leave tech and…",
  "data/reddit-ask/r/AskWomen/comments/pygrpz/so_many_clothes_made_for_women_pants_trousers.json": "If my boxers ride up even slightly I will stop and pull them out and I don't\ncare who is watching. How do you cope!? If that's not the worst clothing\nnightmare you have to put up with, what is!?\n\nEdit* TIL a lot aren't designed that way and people just wear stuff that's too\nsmall and pull them right…",
  "data/reddit-ask/r/Ask_Politics/comments/pg4cyr/how_does_this_supposedly_clever_new_texas.json": "From what I gather, the general idea is that this new law has created a cause of\naction wherein any private citizen can sue an abortion provider or anyone who\naids or abets an abortion.\n\nSo the theory goes that it is difficult to challenge in court, because judicial\nofficers rendering verdicts in…",
  "data/reddit-ask/r/Ask_Politics/comments/pofy9w/why_did_mitch_mcconnell_block_the_911_victims.json": "Recently there's been a bit of chatter about Jon Stewart's role in the 9/11\nVictim's Fund and Mitch McConnell blocking this. As a non-American it seems like\na no-brainer to support the fund, at face value it's about the most patriotic\nthing anyone could do.\n\nI'm having trouble getting what I believe…",
  "data/reddit-ask/r/NoStupidQuestions/comments/pf9ds1/why_is_there_no_good_porn_with_a_couples_love.json": "Maybe its my desire for genuine affection, but as good as it is, I got tired of\nalways having to see cheating videos cause that’s basically the plot of every\nporno.",
  "data/reddit-ask/r/NoStupidQuestions/comments/pfnyiy/everyone_knows_its_never_okay_to_read_someone.json": "Anne Frank's diary has been on my reading list since forever but I just don't\nfeel like purchasing it. Mainly because she was a teenager and did not write in\nher diary with the intent of people reading it. Yes, she was dead by the time it\nwas published but is it really okay to read it? Is it not…",
  "data/reddit-ask/r/NoStupidQuestions/comments/pfol8p/how_the_fuck_am_i_supposed_to_get_an_entry_level.json": "I haven’t been job searching for long but holy fuck is this getting on my\nnerves. I’m willing to work my ass off to become an asset to a company and make\nsomething of myself but with everyone asking for 2-3 yEaRs Of ExPeRiEnCe I’m\ngetting so discouraged. I’m very close to saying fuck it and just…",
  "data/reddit-ask/r/NoStupidQuestions/comments/pfpuqv/what_if_we_just_replaced_precious_jewels_with.json": "So the other day there was this controversy about Beyoncé, and a few other\ncelebrities before her, wearing a famous yellow diamond which (like every\ndiamond, apparently) has a very dark, unethical origin in slave mines.\n\nSo I wondered, couldn't we just wear colored (or clear) jewel shaped glass…",
  "data/reddit-ask/r/NoStupidQuestions/comments/pft2v7/what_if_instead_of_getting_married_to_someone_to.json": "This is a hypothetical situation, where the situation described is a cultural\nnorm. I'm looking forward to answers about the positive and negative impacts of\nthis setting.\n\nPlease don't reply\n\n\"it's possible.\"\n\n\"It's not possible.\"\n\nEdit 1\n\nThis thing opens up more opportunities like gay men…",
  "data/reddit-ask/r/NoStupidQuestions/comments/pg6nqf/is_it_better_to_drive_a_shot_person_to_the.json": "Not sure if this is allowed here but\n\nWon’t go into detail but Couple of months ago someone was killed in my car I did\nnot take them to the hospital instead I pulled over and called 911\n\nHe was already gone in the car People still to this day blame me and tell me I\nshould have drove Even some of his…",
  "data/reddit-ask/r/NoStupidQuestions/comments/pg8bzv/to_all_people_with_a_partner_how_much_sex_do_you.json": "How many times a week/day/month? This is coming from someone who has never had a\ngirlfriend/ not married and I honestly have no idea what the answer could be.",
  "data/reddit-ask/r/NoStupidQuestions/comments/pg8thb/where_the_fuck_are_the_plus_sized_mens_models.json": "as the title says, I see much more woman's plus sized models compared to men's.",
  "data/reddit-ask/r/NoStupidQuestions/comments/pg96pi/what_happened_to_hard_ice_cream.json": "Remember when we were kids (90's kids and older I suppose) and the ice cream in\nour freezer was so hard we had to warm up our ice cream scoop in hot water in\norder to scoop it?\n\nNow any old spoon will work with any ice cream brand. And it seems like ice\ncream melts so much faster nowadays, too!\n\nI…",
  "data/reddit-ask/r/NoStupidQuestions/comments/pg9o6e/how_does_drunk_texting_work_in_chinese.json": "In English your word spelling is all mixed up and mistyped, but in Chinese\nwouldn't changing the pinyin create a totally different character and\ndramatically change the meaning of the sentence? Or can Chinese speakers infer\nmeaning based on different looking but similar sounding characters?",
  "data/reddit-ask/r/NoStupidQuestions/comments/pgdyw5/i_really_dont_understand_the_new_law_in_texas.json": "I know it a bit extreme but what if things like this happens? What a doctor will\ndo if the pregnant woman will say to them that she will try to kill the baby??\nWill she be considered mentality ill? Will they still let her have him? Can\nsomeone stop her from trying ways to harm the fetus when he…",
  "data/reddit-ask/r/NoStupidQuestions/comments/pghhpu/im_a_canadian_transplant_living_in_texas_my.json": "Of course it’s one of the worst case scenarios that any prospective mother could\nconsider, but now I find myself with a very real fear. Do I lose the option to\nterminate if my life is at risk? What about in cases with severe genetic defect,\nare you now forced to ride out a pregnancy fully if the…",
  "data/reddit-ask/r/NoStupidQuestions/comments/pgr94t/why_are_americans_so_obsessed_with_abortion.json": "I understand it's a complicated issue but they seem to ignore so many other\nimportant issues and keep hammering on and on and on about this.",
  "data/reddit-ask/r/NoStupidQuestions/comments/pgrl94/can_it_be_possible_that_the_microphone_in_your.json": "I swear that sometimes I see ads in which a product is promoted that I just had\ntalked about a few hours or a day before.\n\nI talked about buying batteries to my gf this morning and in the evening I see\nads for delivering batteries. We both did not typ anything about batteries or\nanything like that.…",
  "data/reddit-ask/r/NoStupidQuestions/comments/pgv88e/how_the_hell_is_krispy_kreme_making_a_profit.json": "Okay, so first Krispy Kreme gives out free donuts to vaccinated people, which I\npersonally think is pretty cool. But instead of making this a one-time deal for\na week like some shitty virtue-signalling to get the medias attention, they have\nthis last for over FIVE MONTHS and counting. Okay, really…",
  "data/reddit-ask/r/NoStupidQuestions/comments/pgvlze/can_the_church_of_satan_make_abortions_a.json": "Im tired of catholics getting to force their religion on others. Texas is just\nthe most recent episode of church not separating from state.",
  "data/reddit-ask/r/NoStupidQuestions/comments/pgxfpe/after_what_distance_is_an_orgy_still_considered.json": "If four couples are having sex 1 foot away from one another, its probably an\norgy.\n\nBut what if we extend the distance?\n\nWhat if the couples were 50 feet away from one another? 100? 1000??\n\nIs it still an orgy if these people, a football field away from each other,\nstill switch partners and exchange…",
  "data/reddit-ask/r/NoStupidQuestions/comments/pgyl1t/is_anyone_else_not_doing_the_best.json": "Kind of straightforward, but given the general state of- gestures to everything\n-I know I’m not doing the best right this second (especially as an American\nwoman in a state just itching to take my autonomy away).\n\nI’ve talked to friends, and they’ve mentioned feeling off as well, but is anyone\nelse…",
  "data/reddit-ask/r/NoStupidQuestions/comments/ph8i3a/is_it_bad_to_wear_a_gamer_headset_to_a.json": "For context, I'm meeting with a bunch of professors regarding their research\nprojects.",
  "data/reddit-ask/r/NoStupidQuestions/comments/phcq1e/if_you_woke_up_tomorrow_and_realised_youre_the.json": "You can't say you'd masturbate, It'd be too easy.",
  "data/reddit-ask/r/NoStupidQuestions/comments/phhohm/why_does_the_united_state_get_flack_about.json": "I guess I'm wondering if the us is particularly worse about this? I looked into\nmoving to European countries and they have lots of rules and fees for immigrants\nfrom Mexico as well",
  "data/reddit-ask/r/NoStupidQuestions/comments/phoy3t/why_is_masturbation_so_heavily_frowned_upon_in.json": "While I am a Christian (female), I never fully understood what was wrong with\nmasturbation if i wasn’t actively engaging in sexual intercourse with someone\nelse before marriage. I remember asking my mom when I was 12 when I could\nmasturbate (not fully knowing what it was at the time) and she said…",
  "data/reddit-ask/r/NoStupidQuestions/comments/pi19uo/is_it_just_me_or_does_2019_seem_like_a_lifetime.json": "The reason why I'm asking this question is 2019 was the last year where\neverything felt normal and this world has changed drastically since then, I find\nit hard to believe that it's only been 2 years since 2019 but the changes we've\nexperienced since then makes 2019 feel like it was a hundred years…",
  "data/reddit-ask/r/NoStupidQuestions/comments/pi9vza/not_to_get_political_or_anything_but_what_the.json": "Is he a bear??? What the fuck???? Why is he red ????",
  "data/reddit-ask/r/NoStupidQuestions/comments/picng3/should_i_leave_a_negative_review_exposing_the.json": "To keep it short and simple I used to work for a tech company started around\nNovember of 2020 and left around late January of this year because of the way I\nwas treated. Some of the things they said and did to me.\n\n- I do not drink they would constantly tell me that I should drink and they\nwould try…",
  "data/reddit-ask/r/NoStupidQuestions/comments/pie4g6/is_it_weird_that_i_can_only_handle_23_hours_of.json": "I used to think this was only a thing with my SO’s family, but I realized\nrecently that I’m the same with with my own friends and family. After a few\nhours I just don’t want to interact anymore and want to be alone / just with my\nwife again.",
  "data/reddit-ask/r/NoStupidQuestions/comments/pit6hr/what_do_mummies_actually_want.json": " * Vampires want to suck your blood or make you their thrall.\n\n * Zombies want to eat your brains.\n\n * Ghosts have unfinished business.\n\nWhat are all of these mummies actually trying to achieve?\n\nIn the Brendan Fraiser movie, he wanted to resurrect his dead wife, but that\nseems kind of specific to…",
  "data/reddit-ask/r/NoStupidQuestions/comments/piv8pd/do_americans_really_go_to_church_as_often_as.json": "I'm from Australia and I've literally never heard anyone under the age of 60\ntalk about their \"church\".\n\nHowever, pretty much every episode of Forged in Fire I've watched, the\ncontestants always refer to their church in one form or another. Same with\npretty much every other tv show from the US. They…",
  "data/reddit-ask/r/NoStupidQuestions/comments/pixlxa/why_are_so_many_tech_questions_solvable_by_have.json": "IT people please explain.\n\nThere's a whole trope about tech problems being solvable by just turning the\ndevice off and on again, and I've found this trope to actually be fairly true.\nWhy is this? How does just unplugging or restarting the thing fix the problem so\noften?",
  "data/reddit-ask/r/NoStupidQuestions/comments/pj9uo4/does_anyone_else_grope_their_own_ass_just_to_see.json": "Too bad it's dude shaped though",
  "data/reddit-ask/r/NoStupidQuestions/comments/pjdzkt/what_do_flys_even_want_from_me.json": "A fly will buzz around my head, bump into my face, then fuck off. What does he\neven get out of this?",
  "data/reddit-ask/r/NoStupidQuestions/comments/pjhb76/why_are_boobs_attractive.json": "They really aren’t inherently sexy, they’re just lumps of fat, so why do I like\nthem so much",
  "data/reddit-ask/r/NoStupidQuestions/comments/pjksbn/i_am_pregnant_and_my_boyfriend_and_his_mother_are.json": "I know he only dated me for sex. I was very experienced and he was raised in a\nconservative family. His mother is a scientist and the father an engineer. This\nguy is also working in nuclear field and is highly respected. He is 26 and\nalready has a well paying job. Anyway, he was career focused and…",
  "data/reddit-ask/r/NoStupidQuestions/comments/pjra9e/how_can_i_ascertain_my_birth_place_to_get_a_birth.json": "I know it's in California at the very least. I could narrow it down to probably\n100 hospitals but I'm hoping there's a better way than spending this much time\non the phone.",
  "data/reddit-ask/r/NoStupidQuestions/comments/pk1z89/nsfw_do_guys_prefer_sloppy_blowjobs.json": "I feel stupid asking this. I've always given clean not oversaturated/loud moist\nnoisey blow jobs. Ive never had a complaint but it came up in a group\nconversation that guys like it satuated, the weird moist noises and gagging. Is\nthat really true? Sorry for TMI I'm just curious and a little insecure…",
  "data/reddit-ask/r/NoStupidQuestions/comments/pk6esa/how_many_water_molecules_does_it_take_for_water.json": "I’m aware that a single molecule can’t be a solid, liquid, or gas so I wonder\nhow many molecules are needed to make a phase meaningful, in this case a liquid.",
  "data/reddit-ask/r/NoStupidQuestions/comments/pk7r91/isnt_calling_all_races_and_ethnicities_that_arent.json": "I'm from an area that doesn't use the term BIPOC (or any of the other\nAmerican(?) terms like \"yt\" \"folx\" etc). This sort of language seems very racist\nto me. You're bunging together every race that isn't white, even through each of\nthose groups are very different. For me, a mixed kid, it feels…",
  "data/reddit-ask/r/NoStupidQuestions/comments/pkjlza/why_are_some_women_so_angry_about_men_leaving_the.json": "I'm a woman and I couldn't care less if men leave the toilet seat up. I'm\nperfectly capable of putting it down before I pee. I also always wash my hands\nafter going to the toilet so the fact that its \"gross\" is, to me, a dumb reason.\nMaybe it's because I grew as one of two women in a five person…",
  "data/reddit-ask/r/NoStupidQuestions/comments/pkmrki/am_i_an_outoftoucholdguy_boss.json": "Looking for some feedback.\n\nI (35m) am in a senior management position within my organization. I have\nseveral teams that work for me, and each team has a team lead who reports\ndirectly to me. My best team (8 individuals ages 23-27) is managed by a lesbian\nwho is engaged to another woman within our…",
  "data/reddit-ask/r/NoStupidQuestions/comments/pkttt5/why_do_americans_think_free_speech_also_goes.json": "I see alot of post complaining about being banned from subs for saying something\nrude or controversial. Too then go on and start ranting about a lack of freedom.\nWhy is ths?",
  "data/reddit-ask/r/NoStupidQuestions/comments/pkuurw/does_the_feeling_of_still_being_a_teenager_ever.json": "I'm 20 but I still feel like I'm 16, especially mentally and I have this despair\nof getting older, like I'll close my eyes and be 40 next time I open them. I\ndon't feel mature for my age and I'm shocked at seeing people in my age group\nwho actually look and act like adults. Sometimes I even forget…",
  "data/reddit-ask/r/NoStupidQuestions/comments/pl6s0x/why_do_so_many_movies_and_tv_shows_have_volume.json": "Edit: The answer I was looking for was probably Volume Leveling. I turned it on\nin the tvs audio options, and now the audio comes at a fairly even level and i\ndont find myself adjusting it much\n\nmaybe dynamic range compression is the same thing?",
  "data/reddit-ask/r/NoStupidQuestions/comments/pl9xn6/why_are_people_mean_online.json": "I always think - You never know who you're talking to. Is it a child, someone\nwith a language or comprehension barrier, someone in a fragile place, or with a\ncompletely different background that could lead to misunderstandings? And even\nif they're none of those things, I don't understand why someone…",
  "data/reddit-ask/r/NoStupidQuestions/comments/pla0gr/do_boys_not_get_touched_often.json": "I 16f have a bf 16m and he’s very cuddly, not that I mind, one day I just point\nit out to him like wow you really like it. And he says yh because he loves me\nand also I’m the only person he really touches.\n\nI’m like what, and he says yh he can’t really think off anyone else he would,\nlike ever not…",
  "data/reddit-ask/r/NoStupidQuestions/comments/plsc2e/what_is_the_point_in_hiding_nipples_when_the_most.json": "This happens alot and I don't get it , the breast is Approximately visible ,\nonly small part of it isn't shown , is that part really matter ?",
  "data/reddit-ask/r/NoStupidQuestions/comments/pmegbj/to_people_who_got_circumsized_late_whats_the_the.json": "I've been circumsized early so i don't know what it feels like to have a\nforeskin, and all i've heard so far are hypothetical differences from people\nwho've never been circumsized or who, like me, have no memory of having a\nforeskin. I would like to hear it from people with actual experience with…",
  "data/reddit-ask/r/NoStupidQuestions/comments/pmnt35/how_do_i_become_less_stupid.json": "My parents homeschooled me, and by homeschool I mean teach me English and let me\nfuck around on the internet for a decade, and as a result, I am dumb and I would\nlike to fix that.",
  "data/reddit-ask/r/NoStupidQuestions/comments/pmtwzp/does_anyone_else_also_feel_like_the_online_world.json": "It kinda makes me a bit sad to see how it's all starting to be standardised and\nall blend together. Why do you think this is happening?",
  "data/reddit-ask/r/NoStupidQuestions/comments/pmx7ob/why_on_earth_did_chris_browns_career_not_die.json": "It’s actually disgusting to me that he’s still making music. Did anything of\nsubstance actually happen to him?",
  "data/reddit-ask/r/NoStupidQuestions/comments/pmx9c7/when_wiping_after_taking_a_shit_do_you_just_wipe.json": "I wipe as many times as it takes to clean it, and then push my finger in a few\nmillimeters. Just a tiny little bit into my hole. Do you also do that or do you\ndo a deep clean?\n\nOne time I was at school and we had 2ply toilet paper and I had diarrhea and the\ntoilet paper soaked through and I pushed…",
  "data/reddit-ask/r/NoStupidQuestions/comments/pn1guk/is_there_any_way_i_can_hide_the_reddit_live_thing.json": "I don’t give two fucks about your instrument skills. It’s always some cunt with\nan instrument.",
  "data/reddit-ask/r/NoStupidQuestions/comments/pn3j5q/help_how_do_i_begin_to_address_a_very_sudden_and.json": "Woke up this morning, feeling on top of the world.\n\nGot up, did yard work, helped my neighbor tackle a couple home improvement\nprojects.\n\nCame back 3 hours later. Greeted the dog, as is tradition, she was very excited\nto see me. She sleeps on the bed all the time, she's getting older.\n\nAs I…",
  "data/reddit-ask/r/NoStupidQuestions/comments/pn8nji/is_it_a_dumb_idea_to_wear_a_ring_to_deter_older.json": "Whether I’m at work or just minding my own business out in public, I’m\nconstantly getting the attention of men who are at least twice my age or older\nand they’re always trying to hit on me or ask me out on a date. It’s disgusting\nand really unnerving. A lot of them are fetishizing me (many of them…",
  "data/reddit-ask/r/NoStupidQuestions/comments/pndr6n/why_doesnt_modern_society_run_on_a_24_hour.json": "Ive been night shift (mids and swings) my entire adult life. Every once in a\nwhile I'll go to day shift for a few days to attend a meeting or for some other\nrandom reason. During those times my day is hectic outside of work. The commute\nto work takes at least 30 minutes longer due to traffic, lunch…",
  "data/reddit-ask/r/NoStupidQuestions/comments/png2yq/why_do_slavic_people_never_use_the.json": "I thought it was just a movie stereotype, but then suddenly my company was\nbought by a Polish company with subsidiaries in Bulgaria, Russia and the Czech\nRepublic.\n\nWhenever they write something they almost never use \"the\". Like now, when we are\nexperiencing technical issue, one of the IT guys said…",
  "data/reddit-ask/r/NoStupidQuestions/comments/pngugn/why_does_it_cost_tens_of_thousands_of_dollars_up.json": "I don't make enough money to pay a monthly mortgage/tax/etc of about $1500. But\nI'm rich enough to pay rent on a $1795 home. How does that make any sense at\nall? Why would a banker think that's reasonable?\n\nWhat is the point of a giant up front cost? It seems purely malicious to me,\nnothing but a…",
  "data/reddit-ask/r/NoStupidQuestions/comments/pnhk39/i_just_came_out_of_a_1hr_work_meeting_and_didnt.json": "I just joined a new project and the project manager asked me to join a meeting\nsomewhat related to the subject.\n\nI was only observing as I am a new employee still figuring things out.\n\nI understood the subject they wanted to discuss and the general theme but for\nsome reason legit nothing substantial…",
  "data/reddit-ask/r/NoStupidQuestions/comments/pnjpvy/i_fell_for_that_dumb_instagram_sugar_daddy_scam.json": "I (19F) fell for that stupid sugar daddy scam. I should have known better but I\nfor some odd reason just ignored the red flags and went straight in. I guess the\nmoney blinded my view or something. I will totally accept you all calling me\ndumb. I accepted a $3,000 check from this man and deposited…",
  "data/reddit-ask/r/NoStupidQuestions/comments/pnle9x/is_life_really_just_working_a_40_hour_work_week.json": "I just turned 18, and from my understanding, being an adult means: working a\nmeaningless and grueling job 5 days a week to have enough money to pay for\nlivable accommodations, while having little to no time for relationships,\nhobbies, or really anything that makes life worth living. And the weekend…",
  "data/reddit-ask/r/NoStupidQuestions/comments/pnme75/not_to_be_dark_but_whats_currently_the_thing.json": "Keeps you going these days, keeping you alive, making you happy? It’s literally\njust a question, there’s no judgement here!",
  "data/reddit-ask/r/NoStupidQuestions/comments/pogs64/why_does_my_username_have_a_cake_picture.json": "Edit: thank you everyone! I will remember this for next year so I don’t look\ndumb again :D\n\nIt’s not my birthday today and I checked my profile and my birthday is listed\nright. How come there is a cake? Can everyone see it or only me?",
  "data/reddit-ask/r/NoStupidQuestions/comments/poibr3/would_it_be_illegal_to_rise_up_against_a.json": "Say for an second I live in a town that has major election fraud and the police\nare used as armed wing of the government that intimidates you to be quiet about\nthe situation and if you try anything legally you’ll be stomped on. Would it be\nillegal federally to rise up with arms to put down a local…",
  "data/reddit-ask/r/NoStupidQuestions/comments/poj6e1/is_there_a_term_for_when_in_order_to_explain.json": "Is there an official term for when in order to explain something to someone you\nhave to explain multiple other things/subjects for them to understand?",
  "data/reddit-ask/r/NoStupidQuestions/comments/pok1ei/its_normal_to_cry_when_you_dont_understand_the.json": "My teacher gave to us a exercise to do and i was stuck on the second problem for\n50 mins and couldn't solve it. Only solved the first question because a friend\nhelped me.\n\nAfter i realized 50 mins has passed and i didnt made any progress. i just got\nreally angry and started crying because the exams…",
  "data/reddit-ask/r/NoStupidQuestions/comments/popgvs/is_ot_normal_for_me_to_be_worried_that_im_boring.json": "I'm a 16 year old boy, and I've been worried that I might be boring. I like\ncomics and DnD and stuff, but I feel like people never have fun around me.\n\nEdit: I want to thank all of you for the kind words and advice",
  "data/reddit-ask/r/NoStupidQuestions/comments/pp421d/why_are_so_many_bathroom_sink_faucets_1_inch_away.json": "Makes it hard to wash your hands but i feel like it is done for some reason.",
  "data/reddit-ask/r/NoStupidQuestions/comments/pppcen/are_you_supposed_to_wear_a_shirt_under_a_pullover.json": "And can you wear multiple times before washing it?",
  "data/reddit-ask/r/NoStupidQuestions/comments/ppsl0s/when_youre_laying_in_bed_w_your_eyes_closed_but.json": "I always try to comfort myself by thinking “well at least I’m resting my eye\nballs!”. I’m curious if there’s anything to that.\n\nI’m referring to mental test specifically, not physical.",
  "data/reddit-ask/r/NoStupidQuestions/comments/pq88wk/because_of_a_tik_toc_trend_my_sons_school_closed.json": "My son just texted me saying he had to poop, really bad and that all the\nbathrooms were locked. I didn’t believe him, but when I called the school he was\ntelling the truth. After arguing for a while, they were willing to let him use a\nrestroom in the office, with administrators around him. My son is…",
  "data/reddit-ask/r/NoStupidQuestions/comments/pqjyjp/why_is_having_to_show_and_id_to_vote_considered.json": "It doesn't seem like the worst idea to me, considering that you need an I.D. for\nlots of much smaller things, but I've been wrong before. So what's the deal?\n\nEdit: supposed to be \"an I.D.\" in the title. My bad I clearly woke up too early\ntoday.",
  "data/reddit-ask/r/NoStupidQuestions/comments/pqo060/are_all_the_sponsors_that_youtubers_promote_over.json": "I'm thinking about getting raycons, partially bc my earbuds are dying and maybe\nbecause I'm succumbing to the youtube overlords, are they worth buying? I always\nassume things that are heavily sponsored are not very good quality, but I\nhaven't actually tried any of them.",
  "data/reddit-ask/r/NoStupidQuestions/comments/pqojmz/why_does_the_american_health_care_debate_fixate.json": "Health care in the US is ridiculously expensive, but we seem to focus on who we\ncan tax instead of how we can get the costs down. Why aren't we looking at how\nto reduce costs?\n\nEdit to clarify: The public discourse seems to be centered on developing a tax\nbased, single payer health insurance. I…",
  "data/reddit-ask/r/NoStupidQuestions/comments/pra8w9/my_wife_29f_and_i_28m_have_sex_about_once_a_month.json": "We are together for 5 years, married for about a year now. When we first met, we\nwere having sex once almost every day, which gradually decreased. I bring up the\nsubject a couple of times, saying I want this more often. She insists that it is\nnot her fault and always something comes up. Moreover,…",
  "data/reddit-ask/r/NoStupidQuestions/comments/prcez7/im_a_foreigner_who_has_never_been_to_ihop_how.json": "Edit: I appreciate all the responses telling me not to go, but even if you\nwouldn't recommend it, I am looking to learn something about the culture of my\nadoptive country. I've been to MoMA, Carnegie Hall, Statue of Liberty, Waffle\nHouse, the Vegas Strip... all the greats... I'd ask you instead to…",
  "data/reddit-ask/r/NoStupidQuestions/comments/prhrdt/how_do_i_tell_a_family_member_that_their_dreams.json": "My brother (26M) who stills lives at home believes that he will become a huge\ngaming streamer and won’t ever have to work. I (17M) would love to support his\ngoals but this just seems absolutely absurd to me. He has an extremely small\nfollowing and is terrible at the games he streams. He does not…",
  "data/reddit-ask/r/NoStupidQuestions/comments/primtt/what_the_hell_does_based_mean.json": "In relation to gen z slang. I've urban dictionaried it but still don't\nunderstand. Is it good? Is it bad?\n\nI just about understand \"simp\" and \"stan\" but I'm lost on this one. I'm only 24\nand yet I feel so old.",
  "data/reddit-ask/r/NoStupidQuestions/comments/prm8cn/do_you_ever_get_post_social_anxiety.json": "It happens where I will be out at a social gathering and it will be fun, and a\njoy to partake in but once I get home I reflect on what was said and I feel like\nI had said dumb things or joked too much or made an embarrassment of myself",
  "data/reddit-ask/r/NoStupidQuestions/comments/prsthz/do_dicks_and_balls_flop_around_when_you_run.json": "Like people with breasts often wear bras or especially sports bras that offer\nsome stability. And I know crotch cups exist. But if you do a quick run down the\nstreet do they just kinda go nuts? (pun intended)",
  "data/reddit-ask/r/NoStupidQuestions/comments/ps009b/why_are_men_conditioned_to_believe_that_small.json": "I’ve been with my fair share of men, and the ones with small dicks were honestly\namazing in bed and I had a lot of fun with them. Yet I was gonna hook up with\nthis one guy who kept making comments about how I shouldn’t expect him to have a\nbig dick and I was turned off, but not because of the dick,…",
  "data/reddit-ask/r/NoStupidQuestions/comments/ps2ay3/is_it_weird_for_a_20_year_old_male_to_be_friends.json": "Ok so it seems that the general consensus is that its pretty weird, as I\nsuspected. Thanks guys",
  "data/reddit-ask/r/NoStupidQuestions/comments/ps6cwd/isnt_it_nice_how_dogs_dont_care_about_if_you_have.json": "They usually just want to be by you and it doesn't matter how ugly you are or\nhow quiet you are.",
  "data/reddit-ask/r/NoStupidQuestions/comments/ps7wc0/accidentally_broke_into_someones_car.json": "I was doing doordash tonight in an apartment complex. Mind you it’s already dark\nwhere I live, and there weren’t a lot of streetlights around. I drive a silver\nNissan Altima. I get out to hand the customer their food, and I walk back to\nwhat I think is my car, and it wouldn’t unlock. I have Triple A…",
  "data/reddit-ask/r/NoStupidQuestions/comments/psbap8/what_is_the_best_way_to_find_a_girlfriend.json": "Bit of background on myself. I'm a 29 year old male, I have never been in a\nrelationship (still a virgin). I have social anxiety, and a touch of general\nanxiety. My main hobby is video games, I also enjoy reading and politics.\n\nI am incredibly lonely and, I honestly don't know where to start…",
  "data/reddit-ask/r/NoStupidQuestions/comments/psyaif/if_no_id_is_required_to_vote_in_the_us_how_do.json": "I’m not from the US and it bugs me",
  "data/reddit-ask/r/NoStupidQuestions/comments/pt1afi/why_do_some_murder_or_disappearing_person_cases.json": "This question was brought upon by the Gabby Petito investigation and I’m sorry\nif this seems out of line or insensitive but why does her death govern a bigger\nresponse than all the other murder cases that go on every day? It’s awful and\nterrible that it happened but I just don’t know why.\n\nThis…",
  "data/reddit-ask/r/NoStupidQuestions/comments/pt4qx4/why_do_so_many_people_in_america_not_know_how.json": "OK so freedom of speech in terms of the US Article 10 protects your right to\nhold your own opinions and to express them freely without government\ninterference. Basically the government can't pass laws or punish you for what\nyou say - its a great thing to have!\n\nBut I see it all the time someone says…",
  "data/reddit-ask/r/NoStupidQuestions/comments/pt5v6x/how_to_check_into_a_hotel.json": "Don't judge please, I'm a young adult with social anxiety and ASD and there are\nso many interactions I don't know the \"script\" for. I want to know, what do you\ndo/say when checking into a hotel/motel etc. if you've booked and paid online\nalready. You go to the reception and... say what?",
  "data/reddit-ask/r/NoStupidQuestions/comments/ptas0u/what_are_insects_doing_when_they_just_sit.json": "For example, Ive got a spider in my bathroom that keeps the bugs away and he\njust kind of sits there for hours on hours until his next meal comes along then\nonce hes eaten, he just carries right on sitting there doing aboslutely nothing.\n\ndo they have thoughts, do they get bored? what are they doing…",
  "data/reddit-ask/r/NoStupidQuestions/comments/ptcats/meth_isnt_a_cool_drug_so_why_do_people_try_it.json": "Something I don’t understand about meth addiction is how people end up trying it\nin the first place. Other drugs I do sort of understand. They have a certain\nmystique or romanticism. Marijuana has the laid-back Cheech and Chong vibe,\necstasy and cocaine are associated with partying and having a good…",
  "data/reddit-ask/r/NoStupidQuestions/comments/ptlbex/anyone_else_feel_that_the_taste_of_a_drink.json": "I only drink ice coffee out of glass cups. It tastes weird when I use anything\nelse, such as a mug. Ice coffee in paper cups is the worst of them all. But this\none makes sense to me, because you can actually taste the paper.\n\nSimilarly, bottled beer is inferior to beer poured into glass.\n\nAnyone…",
  "data/reddit-ask/r/NoStupidQuestions/comments/ptmtvq/if_the_word_for_something_that_looks_like_a_dick.json": "I was looking at some Georgia O’Keeffe paintings in art class and didn’t have\nthe word",
  "data/reddit-ask/r/NoStupidQuestions/comments/ptw6nr/what_are_some_ways_to_make_50100_dollars_in_under.json": "I need that amount of money and I'm struggling to figure out a way to get it. I\nsuppose I could borrow it, but that just pushes the problem. Any ideas?\n\nAlso, I don't have a license, in case you propose uber/delivery.",
  "data/reddit-ask/r/NoStupidQuestions/comments/pu1jia/when_did_the_95_job_become_the_85.json": "Im serious, the 9-5 thing was a thing?\n\nSeems like the normality everywhere is you start at 8 and leave at 5 and have an\nunpaid lunch in between all that\n\nno idea where the term 9-5 came from",
  "data/reddit-ask/r/NoStupidQuestions/comments/pu47if/when_western_people_say_we_should_grab_something.json": "I'm asking this because in my country (South Korea), this sort of phrase is\nusually just a friendly way of saying goodbye and rarely signifies any actual\nintention to grab something to eat. If you try to make plans with someone after\nhearing this, you'll probably come off as awkward. I wasn't sure…",
  "data/reddit-ask/r/NoStupidQuestions/comments/pudb2k/how_does_rain_not_kill_you_when_it_falls.json": "Like you know how if you drop something off a bridge or throw a pebble off a\nmountain, it could kill someone? Additional bonus question: Am I a fucking\nmoron?",
  "data/reddit-ask/r/NoStupidQuestions/comments/pufmdv/how_come_people_almost_universally_say_vagina.json": "If I understand my anatomy correctly, the vulva is the part on the outside, the\npart that anyone will deal with and most likely ever see, and the vagina is the\ntube that goes from that further back...",
  "data/reddit-ask/r/NoStupidQuestions/comments/pum9az/is_fuck_the_most_versatile_word_in_the_english.json": "As in fuck this, we're fucked, go fuck yourself, fuck!, I don't give a fuck,\nfuck-all, fuck off, for fuck's sake, fucked over, you do this all the fucking\ntime, fuck me dead, what the fuck (all negative connotations)\n\nOR!\n\nThis is fucking cool / fucking amazing, fuck yeah, let's fuck, I want to…",
  "data/reddit-ask/r/NoStupidQuestions/comments/pupdse/do_schools_in_america_not_use_physical_punishment.json": "Was talking with a friend from America and they seemed very concerned when I\ntold them that my school whips anyone that breaks the rules",
  "data/reddit-ask/r/NoStupidQuestions/comments/puuaau/what_is_the_reload_time_on_toilets.json": "I don't know the proper term, but I swear my toilet takes like 10 minutes before\nI can flush again, meanwhile, my schools toilets can get flushed a dozen times\nin a row and not have a problem. Why? How?",
  "data/reddit-ask/r/NoStupidQuestions/comments/puz78v/why_did_many_us_soldiers_date_or_come_back_with.json": "I understand this is a dumb question, but primarily, did the military become\nmore strict about relationships with the locals?\n\nWere there more single women in Vietnam? Were women in the middle east facing\nvery harsh consequences if they were alone with an American male? Or is the\nAsian fetish just…",
  "data/reddit-ask/r/NoStupidQuestions/comments/pv0i5r/how_does_anything_exist_at_all_and_why_does.json": "So like im just trying to comprehend life. So regardless if you believe in\nstrictly science or are religious, how can anything exist? Like there should be\nnothing but what would nothing look like or be? It wouldn't just be blackness\nbecause that's something. So moving past how anything at all…",
  "data/reddit-ask/r/NoStupidQuestions/comments/pv2geu/who_would_win_an_olympic_length_triathlon_out_of.json": "I think the swimmer due to pro swimmers being SO much faster than non pro\nswimmers. But I don't know if they would build in insurmountable lead to beat\nthe other two when it came to their respective events...",
  "data/reddit-ask/r/NoStupidQuestions/comments/pvati5/if_there_is_a_gender_pay_gap_for_the_same_job_why.json": "There have been posts similar to this, explaining that many studies are\ncomparing the pay of men and women across different jobs. However, I am\ninterested in comparing pay in the same job. I am an engineering student and as\npart of my final term, I am taking a class which includes discussion of…",
  "data/reddit-ask/r/NoStupidQuestions/comments/pvb9kb/do_women_like_shaving_their_legs.json": "I personally am a young woman and I’m not too keen on shaving my legs. It’s just\ntime consuming and having hairy legs doesn’t bother me.",
  "data/reddit-ask/r/NoStupidQuestions/comments/pvee5j/do_most_guys_actually_not_know_anything_about_the.json": "I grew up always hearing the stereotype that \"guys can't find the clitoris\" and\nI assumed it was always just a joke at the expense of bad male lovers; I thought\npretty much every guy knew about it. But I recently had a sexual encounter in\nwhich I was commended for...\"using my knowledge\" and it…",
  "data/reddit-ask/r/NoStupidQuestions/comments/pvf1wn/why_do_american_movies_make_it_look_like_only.json": "Feels like it has become a theme where only hobos, drunks, mentally ill, shady\npeople and weird personalities ride the bus in American movies.\n\nDon't ordinary people ride the bus in the U.S? Surely they must?",
  "data/reddit-ask/r/NoStupidQuestions/comments/pvr09i/why_are_engineers_so_arrogant.json": "Obviously, not all engineers are arrogant, but in my experience there is a\nhigher concentration of arrogant folks in that field than others.\n\nI have heard many arguments in the past, but the most common is that they have\nhad to work so much harder than others to get where they are, and therefore…",
  "data/reddit-ask/r/NoStupidQuestions/comments/pw4ban/does_anyone_else_leave_their_fan_on_nonstop.json": "For as long as I've had this fan going on a year I haven't turned it off once\n(unless the power went out for a few seconds but that doesn't count) I honestly\nthink it's just the noise it makes that I like having it on like having a tv\njust for the white noise so it isn't silent",
  "data/reddit-ask/r/NoStupidQuestions/comments/px2mfk/why_is_physical_junk_mail_allowed_to_continue.json": "I can understand direct mail, but there are so many envelopes and miniaturized\nbillboards shoved into people's mailboxes which are immediately cast aside.\n\nWhy do we allow this when the paper industry is directly connected to\ndeforestation?",
  "data/reddit-ask/r/NoStupidQuestions/comments/px5suk/why_do_restaurants_have_dishwashing_machines_that.json": "A friend shared a meme kind of about this, but it’s true. I had my first\nrestaurant job in ‘06 and we had a really fast dishwasher - normal for a\nrestaurant. But at home it takes however long, much longer. It’s 2021 now and it\nseems like it should be the norm for a quicker way to do dishes.\n\nI have…",
  "data/reddit-ask/r/NoStupidQuestions/comments/px849x/where_the_fuck_do_fruit_flies_come_from.json": "I just bought these bananas and peaches!",
  "data/reddit-ask/r/NoStupidQuestions/comments/pxg413/is_it_just_me_or_did_youtube_increase_the_length.json": "It used to be where 2 commercials, one of them was skippable if it was longer\nthan 15 seconds, when did it become 2 15 second commercials, non-skippable?",
  "data/reddit-ask/r/NoStupidQuestions/comments/pxgufw/reddit_is_a_private_company_but_who_are_its.json": "I want to find the top owners ranked by percentage of ownership. I don't know if\nthis is public information or not.",
  "data/reddit-ask/r/NoStupidQuestions/comments/pxt2jb/do_you_serve_cake_at_adult_birthday_parties.json": "My wife recently celebrated her birthday by having a few friends over. I ordered\na cake for the occasion and set it out after dinner. The guests seemed genuinely\nsurprised to see the cake.\n\nAfter singing happy birthday, I cut a few slices and put them on dessert plates.\nNo one touched them. I…",
  "data/reddit-ask/r/NoStupidQuestions/comments/pxumns/can_i_legally_stalk_a_stalker.json": "My friend (22F) has what I (36F)consider to be a stalker. Nobody will do\nanything about it because he HaSn'T DoNe aNyTHing yEt. My friend is afraid, he\nhas destroyed her sense of safety. He sits in her section at work for hours,\nfollows her into the parking lot,messages her on every app he can find,…",
  "data/reddit-ask/r/NoStupidQuestions/comments/py6dv3/would_it_violate_hipaa_if_my_primary_care_doctor.json": "I'm 22 years old but I'm unsure if on the paperwork I put down that she can have\naccess to my medical records/info. However, the same day I saw my doctor I told\nher I didn't feel comfortable with my mom knowing about the fact I have sex\nwhich was why I avoided the pap smear and gyno referral due to…",
  "data/reddit-ask/r/NoStupidQuestions/comments/pycbg0/i_got_a_strippers_number_but_what_does_it_mean.json": "Hello! I'll try to keep this brief. I went to a strip club for the first time.\nIt was a slow time and I was the only one there so I spent a long time talking\nto the only girl working that night. I got a few private dances and basically\nspent hours talking to this girl. I'm early 20s and she is late…",
  "data/reddit-ask/r/NoStupidQuestions/comments/pycy6w/do_some_people_work_from_like_7am3pm_instead_of_95.json": "I know people do night shifts but like do day shifts vary sometimes too. Like\n6am-2",
  "data/reddit-ask/r/NoStupidQuestions/comments/pyka52/nsfw_is_it_bad_for_me_as_an_adult_man_to_be.json": "I'm 31/M, before this week I was a virgin. Lots of history of anxiety and\ndepression. I've been dating this girl [29/F] for about a month, I've been open\nwith her from the beginning about where I'm coming from and she's been super\ngreat and patient with me getting more comfortable going further. I…",
  "data/reddit-ask/r/NoStupidQuestions/comments/pylefe/people_who_walk_around_in_public_talking_with.json": "Why not hold it up to your ear and talk, or wear earphones?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pfmbj5/im_a_24_year_old_virgin_who_has_never_had_a.json": "I’m 24 years old, a college student, and have lived in Philly my whole life.\nI’ve always had a good amount of friends, both male and female. I’m well liked\nby almost anyone, I’m personable, funny, and sociable. I can have a conversation\nwith just about anyone I meet. As for appearance, I’m about…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pfs9eq/after_finding_information_that_my_teen_daughter.json": "While cleaning my 13y.o. daughters room I found mention of her loving and having\na girlfriend. I want her to feel comfortable, accepted and not like she needs to\nhide anything but I don't want to just bring it up and have her mad at me for\nsome reason. The information was in her journal and I swear…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pfydy5/why_isnt_the_us_building_temporary_hospitals_to.json": "I know severe cases can be largely mitigated by vaccines but since so many\npeople are too stubborn to take it, why haven’t I seen any stories of states\nbuilding temporary medical facilities to battle it?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pg4qoj/how_much_concern_should_there_actually_be_that.json": "Texas’ abortion bill is clearly a heinous infringement on established rights…and\nyet the whole thing just seems to carry on. The Supreme Court always talks about\nbeing against politicization, but it’s very clear that the justices at this\npoint rule along ideological lines and no longer care about…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pg5pyl/someone_left_a_plastic_bag_with_what_appears_to.json": "It really freaked us out and it we don’t understand. Does anyone have any\ninsight as to why this particular item was left at our door?\n\nEdit: it was placed between our front door and screen door - like wedged between\nthe two doors. It was not accidental\n\nSecond edit: we live sort of downtown at the…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pga5oi/where_can_i_hide_condoms_and_where_can_i_dispose.json": "So my sexual life is just starting and I can't really think of any ideas to hide\nand dispose them in places where it's pretty much imposible for my parents to\nfind.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pge8sr/does_breast_size_actually_matter.json": "To give you some context here, I’m on the smaller side and the guy I’m dating\nrandomly mentioned that his ex was on the heavier side, he said he wasn’t\ncomparing but now i feel very conscious. Are there men who like small breasts ?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pgh02v/should_we_create_a_rtooafraidtoasknsfw.json": "Honestly 100% of the questions I see lately are sexual related stuff or nsfw\nstuff, maybe we should separate it to give space to other type of questions and\ngive this their own subreddit?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pghiyj/is_it_rude_to_masturbate_in_bed_when_your_partner.json": "For various reasons my partner doesn't want to have sex at the moment. We've had\nsex about 5 times since the beginning of 2020.\n\nI obviously respect them and let them initiate it, but I still want to get off.\nIs it rude if I masturbate (quietly, no porn) while they're sleeping next to me?\n\nI don't…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pgjy8t/where_could_you_hide_a_sex_toy_where_your_lil.json": "My mom and I just fight yesterday, and along the process admitted that the only\nreason why she knows that I have a sex toy (which had nothing to do with the\nconversation) in the first place was that my little brother found it. He likes\nto look at my things and there is nothing that I can do…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pgmq3i/how_do_women_wearing_tampons_have_spontaneous_sex.json": "Genuinely curious how women can still be ‘in the moment’ when things get\nsexually heated but they need to dispose of their tampon (which is usually a\npretty grim affair). When I had a partner I would have to pre-empt if we may\nhave sex that day and not wear a tampon for that reason because I didn’t…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pgox9d/is_it_ok_to_want_to_be_alone_95_of_the_time.json": "I’ll just be blunt, I really don’t like other people. I don’t really care to\nmeet people or make friends. My family and a few select friends are the only\nones I make an effort to talk to.\n\nI don’t think I have anxiety issues. I’m polite to others but I just don’t want\nto be in a group. I’m a little…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pgq77g/why_do_prolife_proponents_not_support_all_the.json": "I'm talking about programs like: sex education/ birth control education;\ncontraceptive availability, improved WIC, Healthcare for children at reduced\ncosts for preventative care, reduced cost child care, paid parental leave,\nmaking adoption more accessible, fixing the foster care system, etc?\n\nWhy…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pgqlwc/how_can_texas_push_policies_that_protect_the.json": "I am sincerely confused by the political battlefield that is Texas currently.\nPeople are both ferociously pushing for the \"individual right\" to wear a mask or\nget the vax or not, but very few of these same people are pushing back against\nthe systematic demolishment of women's reproductive rights.…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pgqp01/why_arent_more_americans_visibly_outraged_that.json": "I'm too afraid to ask this question out of fear of being called a traitor or\nungrateful to our troops. Throughout these last two decades, so many people have\nbeen thrown out on the streets, many families struggled to keep their heads\nabove water while on the brink of homelessness. Studies have found…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pgwrjx/aside_from_condoms_why_are_there_no_birth_control.json": "Birth control may not be the correct terminology for men. Why is there no other\noption for men to lower or stop sperm production?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ph1j9i/why_can_women_abort_out_of_pregnancies_but_men.json": "First off I’m pro choice, you do whatever you want to with your body. But\nsomething I don’t quite understand is why a woman can opt out from having a\nbaby, whereas a man is stuck giving financial support to a baby he didn’t want\nif the woman so chooses.\n\nTo me, if the woman wants to keep the baby,…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ph84sk/do_you_feel_like_youve_lost_2_years_of_your_life.json": "When the pandemic started I was 15, I’m now 17 but looking around I don’t feel\nit. So many experiences I’ve missed out on and it just feels so strange.\n\nI’ve been doing online school ever since the pandemic started (my high school\nhad a horrible online program when it all started and going to an…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/phav6u/why_is_the_personhood_of_a_fetus_determined_by.json": "It just seems so arbitrary to pin that status on a heartbeat when functionally a\nsix week old fetus is less autonomous or developed than an earthworm.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/phdprt/do_americans_actually_think_they_are_in_the_land.json": "Maybe I'm just an ignorant European but honestly, the states, compared to most\nother first world countries, seem to be on the bottom of the list when it comes\nto the freedom of it's citizens.\n\nBtw. this isn't about trashing America, every country is flawed. But I feel like\nthe obssesive nature of…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/phf5r3/are_american_people_really_living_on_paycheck_to.json": "Does it mean that unless you're guaranteed another paycheck by the end of month,\nyou would lose your place, health insurance, and all of the essential things ?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/phh2he/why_has_this_sub_recently_become_people_pushing.json": "Every 'hot' question recently has basically been: \"Why is it that [highly\npopular opinion] isn't the status quo?\" And everyone eats it up.\n\nAnd yes, I am pushing my agenda here.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/phsoqe/people_who_buy_reddit_coins_why.json": "I take every free award reddit gives me, but I'd never spend money on this.\nPeople who spend money here, why do you do it? Are you rich? I'm really just\ncurious",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pi03f9/what_is_so_hot_about_virgins.json": "I don’t get it at all, why do I see incels say they want virgins so bad? I guess\nit has something to do with the “I don’t want a used up woman” thing but it just\nseems gross and a lot more than I’m seeing. I keep trying to put it together in\nmy mind but can’t figure it out.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pi1whm/isnt_it_more_logical_to_assume_that_death_is.json": "Many religions depict the afterlife as a type of heaven/hell, but I think it's\nstrange that it's not as popular to assume that the afterlife is exactly the\nsame experience as before you were born. If time reverses, and you degrade back\nto being unborn, wouldn't death be the exact same thing?\n\nI mean…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pi4wpl/how_do_i_stop_choking_up_when_im_trying_to_stand.json": "Like just today I was just like on the verge of tears just cuz of this dip shit.\nHow do I stop feeling like that when dealing with shitheads?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pi6a0h/a_math_problem_my_mom_showed_me_help.json": "A guy buys $80 of clothes. He sells it for $100. He then buys it back for $90\nand sells it for $110. The question is, how much money has he earned? I think\nit's $40 but my mother insists that it's $20\n\nEdit: I guess no one is safe from confusing math\n\nI have created a monster",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pi6p7o/does_personality_really_matter_more_than_looks.json": "I've been looking through reddit's archives at the plethora of questions like\n\"are there women that prefer fat/chubby men?\", but I see many comments in these\nthreads that are kind of dodging the questions with answers like \"It's\npersonality that matters\". I say they dodge the question because they…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pifpit/why_do_jocks_do_super_gay_hazing_rituals_on.json": "Recently my old high school had a bit of a crisis. A bunch of older kids in\ntrack and field were molesting the younger kids. They'd say \"cup check\" and pull\ndown the younger guys' shorts and cup their balls and dick in their hands. They\nalso groped their cocks in other circumstances.\n\nBuy when I…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/piperh/do_other_people_find_themselves_wanting_to_just.json": "Cos more often than not I just want to sit in a dark with my headphones at full\nvolume away from anyone else",
  "data/reddit-ask/r/TooAfraidToAsk/comments/piqe53/how_do_i_tell_a_friend_she_needs_to_shower_often.json": "I have a best friend who down right stinks. Her hygiene is horrible. She won’t\nbrush her teeth or hair or put on clean clothes. She’s the most fun person to be\naround and I love talking to her but she STINKS. I’ve been slightly telling her\nsome of my hygiene tips and what I do along with breaking…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pizwmp/wait_do_americans_actually_pay_for_the_hospital.json": "I always thought it was an ongoing joke....",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pja284/is_it_a_normal_or_okay_reaction_to_get_mad_at.json": "My boyfriend just asked if I would ever have a threesome with him and another\ngirl. I tried not to get mad at first but am now upset. Is this reaction okay??",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pjcpqp/is_27_too_old_to_be_putting_glowinthedark_stars.json": "I don’t know if I would get self conscious or not. :/",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pjgf3r/why_am_i_never_stressed_out_by_actual_stressful.json": "I am so fucking backwards. I don't get stressed over anything most people do.\nMost of the severe situations in life just don't faze me, but the little stuff\ndoes.\n\nThings like fights near me, cops showing up, disasters occurring, emotional\noutbursts, death, arguments etc. just don't do it for me. I…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pjnrrw/is_it_wrong_that_ive_really_enjoyed_covid_lockdown.json": "I've just got so much done. I've read through loads of books, caught up with a\nbacklog of games and movies, even started writing myself.\n\nI'm well aware of the economic implications. Some of my friends have struggled\nas well, and I'd never say this to them out of respect. But it really has…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pjrg5j/my_boyfriend_wants_to_break_up_because_i_am_not.json": "Because I haven’t completed college ( I have an associates degree) , a real\npassion, I only have traveled and worked as a waitress and some other jobs at 24\nyears old…. He says I don’t know much about things just have hobbies. Like I\nrode horses as a kid and grew up with them but now it’s just…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pjth6e/is_my_boyfriend_gay_or_is_something_else_wrong.json": "F27 and boyfriend M30. We've been together almost 8 years, but we stopped having\nsex around 3 years ago. We only indulge in mutual masterbation. Usually its me\ngiving him head and then him fingering me till I cum. He says he doesn't enjoy\nsex anymore because its painful. When he tries to put it in,…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pkpsag/whats_the_appeal_of_sniffing_womens_panties.json": "I’ve seen this shit on movies and then a video on Reddit of a creep government\nagent that was sniffing a little girls panties, ironically while investigating a\npedophile. That’s disgusting on its own.\n\nHowever, I can’t even imagine having the want to do that.. what am I gonna\nsmell? Gooch and swamp…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pkqo2e/every_time_i_encounter_some_disappointment_i_get.json": "It’s like my mind is telling myself “go kill yourself and start fresh, you won’t\nbe able to do anything in this life”. It kills me from inside.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pkuxjq/just_like_homophobes_are_uncomfortable_with_same.json": "An example I thought of was if my children brought home a robot. Yeah I said it,\nI’m a robophobe",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pl0nvj/how_should_a_man_dress_for_a_first_date.json": "How does a man go about not over dressing but not underdressing at the same\ntime? Where is that line in the sand when it comes to making a decent first\nimpression? Tell me about what kinda fashion and style you look for in a guy\nyou're just meeting for the first time.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pl26zp/am_i_asexual_if_i_could_take_it_or_leave_it.json": "Basically, haven’t had sex in a few years and just haven’t been pursuing it. I\nmasturbate regularly, don’t really feel like putting effort into a relationship,\nand one night-stands/flings aren’t really an appealing concept. Sometimes I get\nlonely, but it’s fleeting and I enjoy my independence at the…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pl4lrt/asking_women_how_do_you_feel_about_men_with.json": "Maybe trimming better. Let me hear your thoughts.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/plin0j/how_much_is_to_much_masturbating.json": "I usually masturbate once every two-three days but it still feels like a lot.\nWhen am I crossing the line for too much masturbating?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/plmdc4/do_you_support_the_latest_vaccine_mandates.json": "I support it",
  "data/reddit-ask/r/TooAfraidToAsk/comments/plme7k/why_is_there_no_whisper_mark.json": "We have exclamation mark and question marks. Whisper marks would be cool because\nim not a loud person and when I message people, it would more accurately\nrepresent my tone when I talk or say certain words.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/plol51/why_is_it_so_difficult_to_find_condoms_in_smaller.json": "My wedding vegetables are smaller than average. That doesn’t bother me one bit,\nand so far I have never received any complaints, but standard condoms I buy in a\nsupermarket or in a pharmacy make intercourse a bit awkward, because I seriously\nneed to make sure that Batman doesn’t lose his cape…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pm6st3/is_not_feeling_emotions_something_that_normally.json": "I remember that when I was a kid, everything I did and experienced, even\nordinary things that I did on a daily basis, invoked some emotion in me. It's\nreally hard to describe, but for example, when I went for a walk outside, the\nbirds chirping, the wind blowing against my face, the smell of flowers…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pm8lfi/how_do_you_handle_constantly_being_disappointed.json": "I just feel like everything in the entire world lets me down. People. Things.\nThe world could end tomorrow and I'd be fine with it. I feel like the world is\ngoing to trash and I just don't know how to get my mind out of this head space.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pma1ut/why_are_events_like_911_or_pearl_harbor.json": "I understand why America labels these events as terror attacks, but never in all\nmy years of American public education and plain old society have I ever heard\nsomeone refer to Americas actions as terrorism. There have been so many innocent\nlives taken from these actions. Like dropping an atomic bomb…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pmamas/why_do_the_2977_people_who_died_in_911_matter.json": "I think any civilian death is a real tragedy. But I don't understand why\nAmericans and the media place so much attention and importance on those deaths\nand almost none on the the others.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pmjgfx/is_there_any_way_to_stop_my_abusive_mother.json": "My mom, horrible abusive, still claims me on her taxes as a dependent despite\nthrowing me out 6ish years ago. I'm a petty person, I don't want to help her in\nany way possible. Is there any way I can either\n\nA) Stop her from claiming me as a dependent.\n\nB) Even better, get her in trouble for fraud. I…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pmmkm5/do_fat_people_starve_slower.json": "I know it’s very offense question to some people I mean it in no harm. It’s more\nof a human body question. Usually it’s 7 days with out food but does amount of\nfat change that time . For example. 700 pound person vs 210 muscle 10% body fat\nvs 210 normal body . Is there huge difference or death comes…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pncyir/do_people_actually_100_trust_their_so.json": "EDIT3: Well, I'm pretty flabbergasted. It seems like people DO 100% trust their\npartners. You can stop downvoting me. I wasn't trying to attack your holy\nprinciples. I was merely asking a question about something that I cannot wrap my\nmind around in the slightest. No need to feel offended or…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pnfvhz/why_isnt_child_support_a_universal_flat_rate.json": "How much does 1 child cost and why isnt charged that much? A kid doesnt need\n200k a month, and if thats the case why do we care about kids with rich parents\nover poor parents? why wouldnt it be capped at like 5k a month for 1 kid, thats\nrent, groceries, clothes ect. I might be wrong about how much…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pnj9xg/men_with_high_libidos_who_are_in_long_term.json": "I've been married for years and up until fairly recently this hasn't been much\nof an issue. I've always known my wife wasn't as into it as me but she always\nassured me it's not a problem. Now things have become so one sided I just can't\nget motivated to have sex and when it does happen I'm always…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pnyyll/is_it_a_valid_reason_to_quit_my_job_in_the_first.json": "Hey so I just got a new job a few days ago. I was advertising in the listing and\nby the HR person that I would be working Monday-Friday 8-10 hours a day. Well my\nschedule is actually Sunday to Thursday and yesterday (3rd day for me) I was\nhere for 14 and a half hours and today It’s already 11 hours…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/po6117/were_not_removing_sexual_questions_hide_the_posts.json": "Title.\n\nFeel free to go farm some karma in /r/JustUnsubbed or whatever \"OOOH HOW DARE\nREDDITORS USE A Q&A REDDIT FOR Q&A, DAE SEXERS OF SEXXIT, WHATS THE SEXIEST SEX\nYOU'VE EVER SEXED\".\n\nI'vE JuSt UnSuBbEd FrOm ToOaFraIdToAsK BeCaUsE PeOpLE AsK QuEsTiOnS I DoNt\nPeRsOnAlLy ThInK NeEd tO bE…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/po8x8k/where_did_i_go_wrong_whats_changed.json": "So I had to have that talk with my son about what was appropriate sexually. My\nwife saw his browsing history and it was nothing but anal fisting lesbians.\n\nSo I ruin his dreams and fantasy’s telling him most lesbians don’t look like the\nones in porn and woman don’t like to be fisted anally. It…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/poh6b4/why_is_a_lack_of_jealousy_a_turn_off_for_some.json": "I'm not insecure, so I'm not a jealous person. If somebody is gonna cheat on me,\nthey'll cheat on me. If they cheat on me, they didn't care about me and did me a\nfavour ending the relationship early. I don't see the point in getting stressed\nover unknowns. You're in a relationship with somebody…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pondob/isnt_the_bible_heresy_technically.json": "As far as I know Christians “follow the word of god” and the Bible was the word\nof Jesus written down 2000 years ago. But now we have the New Testament, which I\ndon’t recall hearing about Jesus coming back down to spell check his work.\nDidn’t people look at the word of god, say “no I don’t think I…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ponpzo/what_is_the_proper_social_etiquette_when.json": "Say I'm Ray Stevens, and I run into Bridget the Midget. That means I'm 5'8\" and\nthe other person is fully grown and under 4'0\".\n\n * Do I stand normally and bend my neck down?\n * Do I attempt to get closer to eye level with them? Take a knee or bend the\n   knee like Khalisi was watching?\n * Do I…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ponqrd/why_do_vegans_try_to_create_vegan_meat_do_they.json": "I mean no harm for vegans, i think that they have really good intentions, im\nstarting to worry about meatfree animal product substitution. Were they trying\nto publish it for meat eaters to try or is it to taste meat without hurting an\nanimal. Do they think they are eating flavor of a reenactment…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/poqdtc/was_jesus_a_psychopath.json": "I just read this book called Evil Religions Unmasked where the author made an\nanalysis on the Sermon of the Mount. My question arose when I understood the\nevilness of Jesus’ preach “love your enemy.” In that phrase, we have two strong\nwords, love and enemy. Be sure that if you have an enemy, he will…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pp5gbn/sorry_that_this_question_will_put_you_on_blast.json": "Hi, so I’m really overthinking things a lot. I’m small compared to the average\nsize, and while I don’t have a girlfriend now, it’s definitely a thought that I\ncontemplate a lot especially for the future. At my age, 19-22, sex is a big\nthing for most people and especially in relationships, they crave…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pp8hob/is_it_bad_to_take_money_from_a_guy_online.json": "So a few months ago I did a dumb Insta story asking for money, almost as a joke,\nbut a guy replied and he actually gave me money for what I needed. Since then\nI’ll tell him what I want to do and he’ll just give me money for it.\n\nHe’s into something called ‘financial domination’ and apparently it’s…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pp9vx8/why_is_it_even_necessary_or_important_to_identify.json": "Like...can't people just enjoy whatever they like or prefer without the\nneccessarity to give it a name or the need to identify as something specific?\nWhy is it for some so important to do this and also to let other people know\nabout their identification?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ppjp8n/what_are_you_supposed_to_do_if_nothing_is_fun.json": "I'm gonna be 40 pretty soon. I've done a lot of shit in my life. But it's gotten\nto the point where really nothing makes me happy anymore. It's essentially\nimpossible for me to have fun doing anything by myself.\n\nI do take antidepressants. I do see a therapist. She doesn't seem to think this\nis a…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pplfov/how_do_blind_people_with_service_dogs_pick_up_the.json": "When and where do their dogs shit excactly?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ppmx4q/my_wife_wants_me_to_start_wearing_a_condom_again.json": "My wife of 10 years wants me to start wearing a condom again when we have sex,\n\"to make cleanup easier.\" I haven't used condoms with her since before we were\nmarried. It's hard not to be surprised at such a request, but she maintains\nthat's her reasoning. She's never mentioned anything about sex…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ppuf5f/is_the_term_latinx_cringy_and_culturally_ignorant.json": "Like... The term just sounds so.. ignorant. The only people I ever see using it\nare super american college people. Like, they keep trying to make it a thing and\nit is not a thing. It literally does not work in Spanish. It is only really\npronouncible in English.\n\nAnd isn't this just a case of…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ppz55u/what_are_your_thoughts_about_this.json": "\"If you only support abortion in instances of rape or incest, you're reinforcing\nthe idea that in order for a woman to have a right to her body, someone else has\nto violate it first.\"",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pq1jeb/what_causes_the_wet_spot_after_sex_do_most_people.json": "So this question is inspired by another post’s comments I saw recently, as well\nas hearing about ‘sleeping in the wet spot’ after sex.\n\nDo most people just not clean up after sex? Me and my partner always wipe\neverything and shower post-sex, before getting to the shower we use tissues to\nstop any…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pq58ur/why_do_so_many_people_think_biden_is_incapable.json": "EDIT: I should preface this by adding that I'm not a \"Biden supporter\"; I didn't\nvote. However, I did feel like he would be a much better president simply\nbecause he's been in politics his whole life. He just seems more qualified for\nthe role than Trump.\n\nWhen I watched Biden speak, he just seems…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pqgnhh/is_this_a_good_enough_reason_to_break_up_wsomeone.json": "Me (21) and my bf (23) have been together for a bit over 3 years. Lately I've\nbeen feeling like I just don't want to be in this relationship anymore.\n\nIt's not him or the relationship, I just feel like I want to be alone for a\nwhile and figure out what I want in life. Really, I just don't visualize…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pqlqnh/why_do_gay_people_exist.json": "Okay this is going to be controversial. Let me premise beforehand that I support\nand respect the LGBTQ community. So, from an evolutionary stand point wouldn’t\nit be a detriment to our species if select individuals were to eliminate\nthemselves from the mating pool. Or on the other hand could there…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pqnnzk/am_i_intolerant_for_hating_religion.json": "I despise each and every religion, practicing people almost always seem like\nthey're unhappy and uneducated to a degree. I know that there are millions and\nmillions of smart and good religious people, but I really think they could\nachieve even more if it were not for their religion.\n\nI think it can…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pqu74c/do_white_people_walk_on_eggshells_when_theyre.json": "I'm a 17 year old black kid and I ask this question because I've got this new\nHistory teacher who seems to want to be \"accepted\" by black people by saying the\nmost obvious things in the world like, \"Racism still exists\". I could be wrong,\nbut it feels like she has this underdog mentality when it…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pr114r/does_this_call_for_being_fired.json": "my coworker just screamed at me for 5 minutes and loudly called me a “stupid\nbitch” while she stood over me (i was sitting) and pointed her fingers in my\nface. it’s all on camera but there’s no sound so they won’t be able to hear what\nshe said. i work at a mental health facility. do you think she’ll…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pr40ap/is_sex_really_all_that_good.json": "My username checks out. But like, all the hype and stuff. Is it really all that?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pr6tnd/isnt_treating_all_men_as_rapists_because_men_are.json": "I am not trying to compare these as two equal plights. I just kind of thought\nabout it after I was explaining to my girlfriend about how men get side-eyed\nwhen looking after children. As a former camp counselor/teacher/baby-sitter,\nthis just is a disturbing trend. Especially since I want to have a…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pr90gz/why_is_it_ok_for_a_woman_to_have_full_control_of.json": "The scenario: two people have a one night stand. The condom rips. Both\neventually realize a pregnancy has happened. They live in a state that is the\nopposite of Texas (shots) but the woman wants to keep the pregnancy. The man\nsays he doesn't want to be a father nor is he financially well off.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/prgm5p/is_sex_really_that_important_in_a_relationship.json": "I found a partner that we both don't seem that interested in sex, intercourse i\nmean. When i told my best friend about that he said how is it going to work\nthen. And now i'm confused",
  "data/reddit-ask/r/TooAfraidToAsk/comments/prhnsq/how_are_people_able_to_eat_ass_without_getting.json": "I feel like I hear people all the time talking about eating ass. Wouldn’t you\nget incredibly sick from that? How are more people not deathly ill from this?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pri12r/is_wanting_to_kill_yourself_actually_bad.json": "I am just curious, I know the dilemma of “what about the people you’ll leave\nbehind?” I don’t have people to leave behind. I do not have an enjoyable life. I\nlive alone. I do not have people that care. Even if I did, so what? If I do not\nwant to continue dealing with the permanence of life, or the…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/prrmtn/why_is_walking_at_night_considered_so_abnormal.json": "I'm someone who does it on a regular basis and I've had more than a few people\nact like I have three heads if it comes up. But the ultimate icing on the cake\ncame a little while ago. A family member who works in the Er asked if I'd been\nwalking that night. Turns out I'd walked by a sorority near the…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/prwxiv/how_do_i_tell_my_girlfriend_i_think_she_should.json": "My girlfriend is... sensitive to say the least. Ever since we started dating 5\nyears ago she's slowly gotten bigger and bigger over time. I never minded but\nnow it's to the point where she gets winded when walking up a flight of stairs.\nAlso, it's honestly starting to effect my attraction to her.…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ps7e2v/why_is_the_gabby_petito_case_getting_so_much_more.json": "I'm not saying this doesn't deserve the attention, and think it should be well\nknown but with the sheer number of cases like this seemingly happening every\nday, why did this one catch the main stream?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/psf61p/if_the_vagina_doesnt_stretch_or_change_as_a.json": "So I am a virgin, and when it has come to arranging a smear test I have been\nasked if I am a virgin, so that they can adapt their approach and use a smaller\nspeculum. This confused me, as it was my understanding that the vagina merely\nstretches and then goes back to its original size, so there…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/psk19x/why_do_people_keep_insist_on_having_kids_if_we.json": "It just seems like a terrible idea. Nobody should have to be born into a world\nof doubt and uncertainty. Plus, not to mention the fact that not having kids and\nbeing able to do what you want on your own time is so many times easier than\nhaving to raise them. Choosing to reproduce seems like a lose…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/psqigq/why_do_we_mock_those_untrusting_of_government.json": "I understand that Cleetus and friends probably ARE somewhat uneducated and\nstupid, but why mock them for not trusting the government when we have a long,\nLONG verifiable track record of government abuse, a lack of transparency as long\nas time, and CONSISTENT dishonesty coming from up…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pstzv8/my_girlfriend_never_wants_to_do_the_work_when_we.json": "Long story short, my relationship has been going on for 4+ years and I enjoy sex\nonce or twice a week, my girlfriend would prefer daily if I was interested but I\nguess my libido just isn't as high as hers. I tell her to initiate something and\nhop on top or do the work and she is extremly adamant…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pswxhi/17_year_old_unvaxxed_wanting_to_get_vaccinated.json": "I’m 17 years old and in my province (from canada) I am legally allowed to get\nthe vaccine without parental confirmation. I’ve been thinking of getting it\nbehind their backs for a while even without the newly introduced vaccine\npassport, which has been another motivating factor me.\n\nThis passport…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/psxbjo/why_is_gabby_petito_such_a_big_deal_when_there.json": "I don't mean to be rude, but I honestly don't know why her case is getting\nnational attention when thousands of other similar cases never get brought up.\nIs there something particularly special about this case?\n\nIt's no doubt a very tragic series of events, but I'm trying to understand what\nwarrants…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/psyrr3/will_i_stop_ever_getting_boners_by_just_looking.json": "My girlfriend always gets me excited even when it’s the littlest things.\nHugging, cuddling,kissing/making out and small physical touch. Sometimes even\nwhen I just look at her at a long period of time I get a hard on. Obviously I\nwant to get a boner when the time is right but it’s kinda getting…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pt88fe/is_cheating_really_an_accident.json": "In tv shows and movies when a character cheats on their partner it's usually\ndisplayed in a 'oops it just happened' kind of way. Do people really cheat on\naccident?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ptdsd4/why_does_the_popular_narrative_focus_so_much_on.json": "I'll preface this by saying I firmly believe the ultra-rich aren't paying their\nfair share of taxes, and I think Biden's tax reforms don't go far enough.\n\nBut let's say we get to a point where we have an equitable tax system, and Bezos\nand Musk pay their fair share. What happens then? What stops…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ptlia9/is_it_wrong_to_be_disturbed_by_the_celebration_of.json": "Is anyone else disturbed by the celebration of death on Reddit?\n\nNow listen, I want to start off like this:\n\n 1. I am not an antivaxxer\n 2. I am fully vaccinated against COVID\n 3. I am fully aware that the vaccine is safe and effective and everyone should\n    take it ASAP\n 4. I believe that those…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ptmiej/how_many_of_you_never_did_any_drugs_or_alcohol.json": "i asked my younger 17 year old brother if he has ever done drugs alcohol or if\nhe has ever been offered. and he said no. which is surprising to me because i\nknow i was doing drugs and alcohol by the time i was 15.\n\ndid any of you actually manage to make it through all of your high school…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ptnoe7/are_modern_headlights_way_too_bright_or_am_i_too.json": "Burt eyeballs…I wonder why they use LEDs at all? Only headlights out my window,\nand I can’t see at all! I can’t even drive ‘less it’s in the day. I had to\nchange my schedule.\n\nExcept the older cars, they are not so bad. They’re not so bad.\n\nI drive door dash cuz I’ve got bills to pay, but I’m…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pttr1v/has_there_ever_been_a_vaccine_causing_problems_to.json": "Yes I am hesitant to take it; crucify me for it. I am not spreading\nmisinformation. I am questioning what is being called misinformation, but if I\nget banned for this I don't care anyway.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ptxd0n/women_of_reddit_does_it_weird_you_out_when_guys.json": "I'll be honest, if they are there I'll have a glance. It's almost like my eyes\nautomatically do it. The last thing I wanna do is of course make someone feel\nuncomfortable. What's the experience like from a female's point of view when\nsomeone checks out your boobs?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pu0vpp/why_do_we_normalize_getting_fat.json": "Im a 25M and live in the deep south. Im 6'2 @~180lbs. I live an active lifestyle\nand eat clean. Almost all of my coworkers ridicule me for bringing a salad to\nlunch, walking on my break, etc. Im always being told to stop trying so hard,\nyour metabolism will catch up to you, you're eating what food…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pu9z4y/why_do_we_tend_to_censor_sexnudity_more_strictly.json": "I was watching the TV show \"Supernatural\" the other day and saw an episode with\na beheading. I noticed that the age rating for this particular show is TV-14.\n\nSo this made me wonder, why is something like this, with decapitation and\nsomewhat clear acts of violence only rated TV-14, but something…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/puc9m0/do_you_ever_get_secretly_enraged_when_hearing.json": "Edit: Child is a more encompassing term than baby I suppose for what I mean. I\nget especially mad if the parent does absolutely nothing about it and ignores\nthe child.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/puco1r/is_it_bad_to_cry_as_a_male_when_your_dog_dies.json": "We are gonna have to put my dog down within the next couple weeks and I know\nit’s gonna hurt just don’t know if it’s weird to cry and be depressed about it",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pujnmp/why_is_it_okay_for_us_to_point_out_imperfections.json": "I think it’s pretty ridiculous how sensitive people are about weight, yet they\nrefuse to acknowledge it’s directly in their control... I’m not “fatphobic” or\nanything of the sort, I just realized this is a common trend.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pur9pt/why_do_gay_people_talk_like_that.json": "I don't mean this in any way to be homophobic or hateful. I'm just curious.\nAlmost every person that talks like that, I immediately think are gay, and most\ntimes I've been right.\n\nThis also isn't a race thing, as I've heard white and black people talk the same\nway.\n\nSo back to the question. Do you…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pus5fl/the_vagina_is_super_close_to_the_butthole_does.json": "Me and my gf were making love last night in doggy style position. And I noticed\nthe butthole is a lot closer to the vagina than I thought. Does that cause any\nproblems?? Like, why is it like that? I still get turned on when I see my gf’s\nholes, but my curiosity is making think of the logistics of it…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/puu7vx/do_bald_people_hear_water_tapping_on_their_head.json": "It was raining today and I saw a bald man go on about his day without an\numbrella. I have serious questions now.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/puv8ik/i_genuinely_feel_nothing_towards_my_own_newborn.json": "Edit 2; This post has been blown up and I'm just going to TLDR the comments for\nanyone going through something similar because my questions have been answered\nand I feel so much better.\n\n1) postpartum does exist in men. If you feel this way please educated yourself.\nDon't be afraid to seek help, and…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/puw7h2/why_do_some_people_refuse_to_wash_their_hands.json": "I've noticed that the most during the pandemic. People that have a bathroom\nstall and refuse to wash their hands. I watched a woman come out of stall, stand\nin front of a running faucet fixing her hair, then walk out without washing. I\nhave a family member who notoriously won't wash his hands after…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/puxzfh/are_sex_clubs_real.json": "I have heard of people referring to places as \"sex clubs\" and I've seen them\nportrayed a few times on TV. Are these real and only for rich people, a thing of\nthe past, or an urban legend?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pv2v0e/is_it_bad_feeling_guilty_after_wanking.json": "Everytime I wank I start thinking about this girl I have a crush on, but I swear\nI don't want to think about her while doing such thing, I feel it's kinda creepy\nand it doesn't lets me enjoy myself.\n\nI think I did not explain myself well, what I meant to say is that I I feel like\nI need her…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pv54sv/todays_release_by_the_lancet_refers_to_people.json": "*bodies with vaginas not people with vaginas",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pv6ct3/do_other_men_feel_jealousuncomfortable_when_their.json": "I am a man and feel that way. I wanted to know if other men were like me because\nif I can find plenty of women complaining about their man looking at other\nwomen, I don't find much of the opposite.\n\nEdit : Do you think the time, place and who it is make a difference (in media,\nstranger in the…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pvgpds/what_has_donald_trump_done_to_get_the_massive.json": "I was in my early 20’s when he announced he would be running for president. All\nI ever saw was him just saying the stupidest things or making real poor\ndecisions. But yet, almost half the country swore him a god. I just never\nunderstood it. And still don’t. People are STILL waving there Trump flags…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pvh7ie/why_do_companies_think_that_interrupting_videos.json": "For me it just makes me hate their product. Isn't it just annoying everybody?\nDoes anyone actually think \"mmmm this 30 sec ad interrupting my meal time video\nis great, let's check out their product\".\n\nWhy are these ads so popular? I'm talking in general but I'm sure we can all\nthink of a certain…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pvogxr/23_m_a_woman_ive_never_met_is_offering_me_5000.json": "EDIT: It was a scam. She pretended to send me $5000 on PayPal and said I'd have\nto pay $50 to \"her agent\" before I could receive it. I knew she was lying since\nI didn't receive a notification from PayPal about needing to do anything of the\nsort, and because her only proof was a fake screenshot with…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pvtzl3/is_it_wrongweird_to_not_follow_the_news_for_the.json": "I've gradually stopped following the news over the past few years. I scan\nheadlines occasionally, but that's about it.\n\nI have my own problems to deal with. Following the news just increases my\nanxiety and isn't enjoyable to me. For the sake of my own mental health, I've\nstopped.\n\nIt's not that I…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pvuxo7/why_do_we_hate_communism.json": "29F, American here. Why again do we hate communism, again? Is it warranted?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pvx57m/what_part_of_ass_do_people_eat.json": "I mean for licking the vagina, it's clear that people lick, play with tongue\naround minor/major labia, clitoris, penetrate tongue inside the vagina, and lick\naround. But what's with the ass? I always imagined people biting and chewing the\nmeat from ass checks lol",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pvxfcy/why_should_asexuality_be_recognized_by_the_lgbtq.json": "Obviously this post is being made with the intention to learn and understand.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pvxwx7/is_giving_blowjobs_considered_dirty.json": "I (40f divorced) am new to dating and hooking up. I thought I was figuring\nthings out and have gone on a few dates that led to hooking up- either a one\nnight stand or we continue to see each other. Both men have been very generous\nin bed, focusing on me for a long time. I feel like the favor should…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pvzh0g/what_can_a_person_do_when_theyre_out_of_options.json": "Hello everyone,\n\nI’ve been around Reddit for many years, but you’d never know it from my post\nhistory. I tend to keep to myself; however, I’m in a bind and have no one that I\ncan ask this question to.\n\nI live in Canada (Saskatchewan) and am unable to work. I rely on disability\nbenefits (which do not…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pw7ip9/what_fluid_are_women_who_squirt_during_sex.json": "I assumed they were just peeing during sex, but I see some information online\nsuggesting it's fluid from some other glands. There doesn't seem to be a\ndefinitive answer to this anywhere.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pwb8z0/i_whats_the_point_of_french_kissing.json": "Idk if this will get removed because of my karma and idk if this is the right\nflare, but if someone sees this I would really appreciate an answer because I\ngenuinely don't get it\n\nEdit: How does it even work, actually?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pwcga8/why_is_life_so_boring_and_only_gets_more_boring.json": "30 years old, go to work, come home, go for a run or lift for a bit, eat, game,\nsleep, rinse repeat.\n\nNo girlfriend, no romantic prospect (dating isn't a thing in my life), friends\nare basically in the same position\n\nIt's all just so boring honestly, the times I feel the happiest and most alive\nare…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pwfrcg/hey_so_who_are_they_and_why_would_they_make_chem.json": "Bonus points explaining to me wtf a Chem trail even is?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pwgp06/for_those_who_were_able_to_how_do_you_accept.json": "as the title says. i’m done pretending like i have any sort of chance - not only\nhave i never had a singular friend in my life, obviously no one has ever been\ninterested in me either and that’s fine. no one would want to be with me after\nlearning about all my physical disabilities, borderline…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pwik4b/do_women_have_postnut_clarity.json": "idek why, but this popped into my head.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pwrtga/do_you_think_mods_on_reddit_abuse_their_power.json": "It's concerning how many mods are bullying people on their subreddits.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pwy34u/am_i_the_only_person_that_occasionally_reacts_to.json": "For example, if I were to come home from a long days work and make a plate of\nfood and drop it on the way to the couch, I might look down at the mess then\nlook towards an imaginary camera. If I were in a tv show they would call it\nbreaking the fourth wall.\n\nDo any of you do something similar?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/px23av/why_are_most_of_the_rap_songs_about_fucking.json": "i ask this because i find really good pre-2000 rap songs that are meaningful and\nlyrics are pleasant to hear, wherears current rap is all bout 'this hoe, slut,\nme fuckin so many bitches, money money money, haters gonna hate'",
  "data/reddit-ask/r/TooAfraidToAsk/comments/px34n1/is_there_more_truth_than_joke_behind_military.json": "I have family in the military as well as a few friends in the reserves but I've\nnever wanted to ask this for fear it might bring some bad memories up. I know we\nmake jokes about military wives cheating all the time but is it really as bad as\nall that? Or is it just that it gets a lot of attention…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pxx8uc/do_muslims_jews_and_christians_worship_the_same.json": "We Muslims believe that we worship the same god worshiped by Jews and Christians\ni was always afraid to ask this to my jews/Christians friends but since its\nTooAfraidToAsk what do you guys believe ?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/py1m59/is_it_common_to_not_be_able_to_cum_during_your.json": "So when losing my virginity my top concern was that I’d only last like 5 minutes\nand was really worried about that. We made out for like 15 minutes, then fucked\nfor around 40 minutes before we concluded I wouldn’t finish and it was already\npast 3 am. She was hot af and didn’t at all feel like I was…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/py251m/are_there_straight_guys_which_enjoys_shoving.json": "Well, this is very embarrassing question but that’s why I’m posting it here.\n\nWhenever I hear about a guy shoving (in lack of a better word) something up his\nbutt, the joke is always that he’s gay. But if there’s a g-spot in the butt\nwouldn’t there also be straight guys enjoying shoving up things…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pyf9p9/do_movie_theatre_workers_really_care_if_you_sneak.json": "If you're a movie theatre worker, do you really care if people sneak in theor\nown snacks? Can you get in trouble if someone does?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pyhaaf/whats_the_weirdest_thing_you_stuck_your_dick_in.json": "We've all been there before, way too horny to think correctly. Maybe it was as a\nhormonal teen who didn't know better or something that seemed like a good idea\nwith a horny brain.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pyhxng/if_a_woman_slept_with_identical_twin_brothers_and.json": "Asking for a friend",
  "data/reddit-ask/r/TrueAskReddit/comments/peyozr/people_who_where_old_enough_to_grow_up_without.json": "I was born in 1999, so some form of digital tech has always been around me in\nsome shape or form. However when I was younger I remember catching the tail end\nof what I will call a more normal relationship with technology. I did not use\ncomputers daily in my childhood, did not have a cell phone and…",
  "data/reddit-ask/r/TrueAskReddit/comments/pl0woa/rather_than_having_one_federally_mandated_minimum.json": " * Living Wage Calculator [https://livingwage.mit.edu/]\n * A lot of people say that a single, federally mandated minimum wage wouldn't\n   work because of the different costs of living around the U.S.\n * Taking that into consideration, do you think a law that said that each\n   state's minimum wage…",
  "data/reddit-ask/r/TrueAskReddit/comments/porm67/would_the_citizens_living_in_the_us_be_better_off.json": "People in California dislike the politics of Texas. In reverse, the people of\nTexas hate the politics of California.\n\nFurthermore, the landscape and local issues affecting Wisconsin are totally\nalien to those of Florida which are totally different from then local issues of\nNew Mexico or Rhode…",
  "data/reddit-ask/r/TrueAskReddit/comments/pqaaz3/what_is_that_one_seemingly_meaningless_decision.json": "for me its all dates back to what music class i decided to take my 6th grade\nyear. I decided by essentially a coin flip. Little did I know that I would meet\nmultiple friends in that class that I still know today, talk to every day, and\nhave influenced my life in certain ways. They have even opend up…",
  "data/reddit-ask/r/askphilosophy/comments/pfy8j7/how_is_beastiality_generally_considered_bad_but.json": "Saw this question in a Big Joel YouTube video the other day.\n(https://youtu.be/DGwiyyZhNpM) The uploader says that beastiality is bad because\nthe person draws pleasure out of the pain of the animal, while for the meat\neater it's just a byproduct of their desire to eat.\n\nI think this answer is very…",
  "data/reddit-ask/r/askphilosophy/comments/phuztd/is_jordan_peterson_really_a_profound.json": "I keep encountering people who swear up and down that Jordan Peterson is a\ngenius, nay, a messiah sent to save us from the evil reach of Postmodern\nNeomarxism (Cultural Bolshevism, anyone?)\n\nI tell these people that he is neither a philosopher, nor a religious scholar.\nYet they tell me that I just…",
  "data/reddit-ask/r/askphilosophy/comments/pigaiz/i_am_teaching_introduction_to_philosophy_and_im.json": "Any suggestions? Thanks so much for any help.\n\nI need one movie for ethics, one movie for epistemology, and one movie for\nphilosophy of mind.\n\nThese would be informal \"movie nights\" where the students would congregate to\nwatch (without me, their instructor, present). The class is set up such that…",
  "data/reddit-ask/r/askphilosophy/comments/pkc0c3/in_1790_immanuel_kant_makes_the_famous_statement.json": "Is something wrong with this interpretation? Did Kant mean something different?",
  "data/reddit-ask/r/askphilosophy/comments/plamrk/what_if_persons_seen_as_mentally_ill_are_in_fact.json": "Because mental health is determined by how the majority of people \"is\". But what\nif the mentally ill minority, are those experiencing reality?",
  "data/reddit-ask/r/askphilosophy/comments/pm5ys3/peter_singer_and_capitalism.json": "I have a question about Singer's approach to various issues. For example,\ndonating to charity and Veganism. As a Utilitarian, Singer aims to promote the\noutcome which satisfies the most preferences/produces more pleasure/less pain.\nHowever, I am unsure why he places so much emphasis on individual…",
  "data/reddit-ask/r/askphilosophy/comments/pnrii5/is_having_children_inherently_selfish.json": "Hope you'll hear me out. To be clear, I've never studied philosophy in any\nserious sense, but I deal with personal struggles that often lead me to\nphilosophical problems. And I'm curious to hear some opinions on this.\n\nLately I've been thinking about reproduction and how we're different from…",
  "data/reddit-ask/r/askphilosophy/comments/po4k5u/philosophy_as_a_hobby_is_it_even_possible.json": "Hello there, I would like to ask you, if philosophy (including writing essays\nand reading secondary/primary sources) makes a good hobby. Is there any chance\nessays of a hobbyist will be recognised in academia?\n\nI had an inclination to philosophy since my late childhood, but I never chose to\nfollow…",
  "data/reddit-ask/r/askphilosophy/comments/ppxwu0/how_can_science_be_objective_when_humans_are.json": "Since humans are limited by their subjectivity and subjective senses, how can\nscience be objective?\n\nOther species see a color, or wavelength differently. Why would the senses of\nhumans perceive objective reality as it is, when other species perceive this\nreality differently?\n\nWhat evidence is there…",
  "data/reddit-ask/r/askphilosophy/comments/ps99i0/how_can_philosophers_hold_certain_extreme_beliefs.json": "As the title says, how can philosophers believe in certain things and yet live\ntheir lives as if those things are not true or do not apply to them personally.\nI guess my question is whether there is a hypocrisy involved or perhaps a kind\nof separation between, say, John-the-individual and John-the…",
  "data/reddit-ask/r/askphilosophy/comments/pts5w2/why_is_there_such_strong_disdain_towards.json": "I say disdain, cause I've read a few papers and articles recently and it seems\nlike alongside regular criticisms of stuff like dualism, panpsychism, a lot of\npeople really seem to have these really like....emotional reactions to it.\nWhether it be throwing insults and buzzwords or being just…",
  "data/reddit-ask/r/askphilosophy/comments/puo7ay/is_it_conceptually_impossible_for_there_to_have.json": "Whenever I describe to someone what \"nothing\" is, I seem to be committing myself\nto the \"existence\" of nothing. But if something exists, then there isn't\nnothing. Am I describing this wrong or is this just a limitation of language?",
  "data/reddit-ask/r/askscience/comments/pfrjtl/askscience_ama_series_im_a_particle_physicist_at.json": "I'm Harry Cliff - I'm a particle physicist at Cambridge University and work on\nthe LHCb Experiment at CERN's Large Hadron Collider, where I search for signs of\nnew particles and forces that could help answer some of the biggest questions in\nphysics. My first book HOW TO MAKE AN APPLE PIE FROM…",
  "data/reddit-ask/r/askscience/comments/pgfkcn/askscience_ama_series_im_jon_schwantes_from.json": "Hi Reddit, this is Jon Schwantes from PNNL. My team and I are working to uncover\none of history's great mysteries. During WWII, the United States and Nazi\nGermany were competing to develop nuclear technology. The Allies thwarted\nGermany's program and confiscated 2 inch-by-2 inch uranium cubes that…",
  "data/reddit-ask/r/askscience/comments/pglvry/how_do_lungs_heal_after_quitting_smoking.json": "Hi all, just trying to get a sense of something here. If I'm a smoker and I\nquit, the Internet tells me it takes 1 month for my lungs to start healing if I\ntotally quit. I assume the lungs are healing bit by bit every day after quitting\nand it takes a month to rebuild lung health enough to…",
  "data/reddit-ask/r/askscience/comments/ph2crv/in_space_is_it_as_easy_to_accelerate_an_object.json": "Is it more difficult to accelerate an object to faster speeds in space like it\nis on earth?\n\nOn earth, to go from 20-30mph is much easier than to go from 220-230mph.\n\nIn the absence of air resistance and engineering limitations, what are the\nlimiting factors, if any, to reaching higher speeds?",
  "data/reddit-ask/r/askscience/comments/ph5yvv/can_and_how_protons_fuse.json": "The question is simple, what happens when two protons overcome Coulumbs barrier?\nDo they fuse and make some sort of a hadron? Or do the 2 protons stick to\neachother making a sort of nuclei? Or does something else happen?",
  "data/reddit-ask/r/askscience/comments/phvr8h/where_does_the_co2_absorbed_by_trees_end_up.json": "What is the final destination of the CO2 captured by trees? Their bodies? If\nthat, is it released back into the atmosphere if the woods happen to burn down?",
  "data/reddit-ask/r/askscience/comments/pioh4a/can_the_coronavirus_mutate_to_be_less.json": "It seems like with every variant it gets more transmissible, is it possible to\ngo the other way around ?",
  "data/reddit-ask/r/askscience/comments/pj0zwo/is_it_possible_for_fossils_to_be_found_in.json": "Been reading magic school bus with my son, this question came to mind. If\nfossils form in sedimentary rock, and then that rock becomes metamorphic rock,\ncan the fossil survive that process?",
  "data/reddit-ask/r/askscience/comments/pj4rr9/dolphins_use_echolocation_to_visualize_objects.json": "For example, to say the word \"fish\", could they reproduce the sound image (or a\nsimplified version) of a fish?",
  "data/reddit-ask/r/askscience/comments/pj9dit/why_is_there_discrete_states_of_matter_as_opposed.json": "Why does matter go through discrete phases of solid → liquid → gas, rather than\na continuous change going through a “buttery” or “syrup”-esque phase?",
  "data/reddit-ask/r/askscience/comments/pjb87r/why_is_bacteria_phagotherapy_not_widely_used_to.json": "Have a family member struggling for months with a super-resistent bacteria and\nthe only would be solution (phago therapy) is not available anywhere it seems.",
  "data/reddit-ask/r/askscience/comments/pji1bh/why_is_laser_light_monochromatic.json": "The common explanation for this is that the electron moves from one orbital to\nanother and the light emitted is given by the E=hf. However, since an electrons\nposition are 'vague', ie. defined by a probability, how come the emitted light\ndoesn't demonstrate a small variation in the wavelength? (Or…",
  "data/reddit-ask/r/askscience/comments/pkb3vd/are_there_shortterm_longterm_and_working.json": "e.g. Is someone with ADHD likely to have more challenges with long-term goals\ndue to distraction, or does it only affect day-to-day tasks?",
  "data/reddit-ask/r/askscience/comments/pkk91l/are_there_long_term_effects_from_covid_in_fully.json": "Long time lurker, first time poster, long time loser in this pandemic.\n\nSo I remember multiple papers being published showing evidence of long-term, if\nnot potentially permanent, brain/heart/lung damage from COVID, even if the\nperson showed no symptoms.\n\n1) how accurate is that? 2) If it is, is…",
  "data/reddit-ask/r/askscience/comments/pkvrdg/are_spiral_galaxies_on_their_last_leg_of_life.json": "Hi folks,\n\nIs this the final stage of a galaxies life as the black hole has grown large\nenough that it is pulling every star i to the centre of the the galxay creating\na vortex of light?\n\nIf so, would galaxies that have an even disc/belt shape be mid aged as the black\nhole has enough force to keep…",
  "data/reddit-ask/r/askscience/comments/pkxwbd/is_the_flu_we_get_vaccinated_for_today_just_a.json": "I know the there is basically a different strain of the flu virus every year,\nwhich is why there is a new flu shot every year. Is this the result of the 1918\nSpanish Influenza pandemic?\n\nI've been reading that Covid is more or less here to stay, and it will likely\nhave annual variants that may…",
  "data/reddit-ask/r/askscience/comments/pl03tq/is_the_lifearc_of_a_star_determined_100_by_its.json": "I understand that there are varying types and sizes of stars (red giants, blue\ndwarfs, etc.) and that a star can take on multiple \"forms\" as it ages and the\ncomposition of its fuel changes.\n\nI understand that the mass of a star defines many of its key attributes, but is\na star's lifespan and other…",
  "data/reddit-ask/r/askscience/comments/pl39tu/hospital_staff_have_always_been_very_careful_but.json": "Part of weighing the cost benefit analysis of treatment at a hospital is risk of\ninfection, and risk of infection of particularly resistant bacteria on top of\nthat. Are we seeing the numbers of these other types of infections go down as\nvigilance for Covid goes up, even though the types of infection…",
  "data/reddit-ask/r/askscience/comments/plhmur/why_shouldnt_you_get_the_covid19_vaccine_if_you.json": "I’ve had a bit of a google and the closest answer I can get is that given some\npeople experience mild to severe cold/flu like symptoms after receiving their\nshot - especially the 2nd shot - is that if you get the vaccine and are already\nunwell, that you are more likely to feel even worse than if you…",
  "data/reddit-ask/r/askscience/comments/plpkdh/wikipedia_states_the_human_nose_is_extremely.json": "It rained in Northern California last night for the first time in what feels\nlike the entire year, so everyone is talking about loving the smell of rain\nright now.",
  "data/reddit-ask/r/askscience/comments/plq6ib/are_there_any_biological_differences_between_male.json": "I was curious if mens hair has a different make-up over womens hair? If you were\nto view the hair at a DNA level, would you be able to identify the sex of the\nperson it came from?\n\nThe reason I ask is because in general, women have longer hair styles and men\nusually shorter. Is this 100% cultural?…",
  "data/reddit-ask/r/askscience/comments/pm9jpe/how_effective_is_the_vaccine_against_each_of_the.json": "i'm specifically talking about comparing the OG virus against the South African\nvariant, the British variant and the Delta variant. is there any (noticeable)\ndifference in how effective the vaccine is?",
  "data/reddit-ask/r/askscience/comments/pmehd2/why_did_it_take_16_hours_for_the_first_message_to.json": "According to everything I have read it took 16 hours for the signal to cross,\nbut none state why. how is it possible for electricity to slowdown to under 200\nmiles per hour? Why did it only take 1 hour for the return journey?",
  "data/reddit-ask/r/askscience/comments/pnf6z8/why_is_sugar_sticky.json": "Suppose you dropped a puddle of sugary liquid to the kitchen table and suppose\nit sticks to your hand. Why's it sticky? Why is hydrated sugar sticky?",
  "data/reddit-ask/r/askscience/comments/pnfj82/are_there_any_elements_in_the_earths_crust_which.json": "Speaking of the types of planets which are similar to earth, is there more or\nless gold, for example than there should be according to our current models of\nhow a planet forms?\n\n****Could there be a planet out there with abnormally high deposits of a certain\nmineral or element? I know there’s…",
  "data/reddit-ask/r/askscience/comments/pnhce5/could_a_solar_sail_spacecraft_carry_its_own_laser.json": "There’s a classic physics problem that asks why we don’t put fans on our\nsailboats to power our boats when there’s no wind? The obvious answer is that\nthe fan will always provide equal or more impulse in the opposite direction than\nit provides to the sail. Does this same principle apply to solar…",
  "data/reddit-ask/r/askscience/comments/pni9wg/is_the_age_of_the_universe_a_matter_of_perspective.json": "When it’s said that the universe is 13.8 billion years, isn’t that from the\ngravitational perspective of earth? Like if life could survive in a planet\naround a black hole would the perspective of the age of the universe be much\nolder? I get the Big Bang happened at one time and that that point in…",
  "data/reddit-ask/r/askscience/comments/pnxt2q/why_are_the_decks_angled_on_aircraft_carriers.json": "In addition to a few YouTube short-umentaries on the subject, I have read a\ncouple shorter articles on the reasons for angled decks , but I am apparently\nlacking the big brain here. Every source seems to assume you \"get it\" and\ndoesn't break it down far.\n\nI understand how rotating the deck from 90…",
  "data/reddit-ask/r/askscience/comments/pol934/did_the_black_plague_end_because_natural.json": "Do European immune systems today have a strong ability to fight off black\nplague?\n\nor if not, then how did the plague ever end?",
  "data/reddit-ask/r/askscience/comments/ppcukl/askscience_ama_series_we_are_microbiologists.json": "Tomorrow is International Microorganism Day, so to celebrate we're discussing\nour favorite microorganism: fungi! If you've seen \"Fantastic Fungi\" on Netflix,\nyou've gotten a good introduction to the world of fungi. But there's always more\nto love about fungi than psychedelic drugs.\n\nJoin us today…",
  "data/reddit-ask/r/askscience/comments/ppw1on/how_will_todays_media_be_preserved_in_the_future.json": "Will every video on YouTube be saved in a historical archive somewhere many\n(hundreds to thousands) of years in the future or will we lose majority of\nvideos, movies, music etc?",
  "data/reddit-ask/r/askscience/comments/pq8929/why_is_high_blood_pressure_considered_a_bad_thing.json": "High blood pressure is usually associated with heart attacks but I don't\nunderstand why. Wouldn't a pipe with high pressure be cleaner?\n\nIs high blood pressure a cause or a symptom of heart failure? i.e. is it not the\nblood pressure that is the problem, but the implication that higher blood\npressure…",
  "data/reddit-ask/r/askscience/comments/pq8c6s/is_petrified_and_fossilized_the_same_thing.json": "If not how do they differ?",
  "data/reddit-ask/r/askscience/comments/pqhqky/can_we_use_viruses_to_genetically_modify_organisms.json": "From what I understand, viruses add to the dna of a cell to make it into a virus\nfactory. But if we replaced the bit of dna a virus carries, could that allow for\ngenetic modification?",
  "data/reddit-ask/r/askscience/comments/pqoqxd/does_the_abundance_of_plants_that_have_embryonic.json": "Thanks in advance for your time :)",
  "data/reddit-ask/r/askscience/comments/pr618y/is_the_uncertainty_principle_basically_because_at.json": "Basically my question boils down to the fact that to me at least it seems to\nintuitively make sense that the quantum scale makes measurement hard but I don't\nsee many people talk about it like this and I'm wondering if I've managed to get\nthe wrong end of the stick.\n\nLike if I want to measure a…",
  "data/reddit-ask/r/askscience/comments/prb8lk/if_you_use_hormone_blockers_to_stop_puberty_would.json": "Just a thought I had about the discussion on transgender care. If a kid was\nprescribed them to block puberty, do they need to take them forever to attempt\nto block what their body \"wants\" to do? Is there some point where they can stop\ntaking them because their body won't attempt whatever process…",
  "data/reddit-ask/r/askscience/comments/prfm7t/can_lightning_really_crack_rocks_and_damage.json": "In fiction we usually see lightning as an incredible force capable of\nsplintering stones, like a TNT charge would. Does this actually happen in\nnature?",
  "data/reddit-ask/r/askscience/comments/prjxa0/re_the_current_volcanic_eruption_of_la_palma_and.json": "Should we be worried?",
  "data/reddit-ask/r/askscience/comments/prvhou/has_anyone_ever_proposed_a_more_systematic.json": "In chemistry we somtimes have convenient, arbitrary names where useful (\"water\"\ninstead of \"dihydrogen monoxide\") but always a predictable scientific name that\ndescribes what the compound actually is (e.g.: \"dihydrogen monoxide\" = two\nhydrogens and one oxygen).\n\nI can't claim to be smart enough to…",
  "data/reddit-ask/r/askscience/comments/psn46o/why_does_the_immune_system_take_so_long_years_to.json": "I have a limited understanding of medicine. It seems to me however that the\nimmune system is typically able to deal with viral infections within a few weeks\nto months depending on type and severity. However HPV virus sometime takes years\nto defeat.",
  "data/reddit-ask/r/askscience/comments/pt9gpj/why_do_soybeans_curd_why_dont_other_legumes_curd.json": "I was looking for alternatives to make tofu. My grocery store doesn't have\nsoybeans. All of the alternative legumes, that can be made into \"tofu\", are made\ninto a milk, reduced to a paste, and then chilled. Tofu with soybeans is made\nlike mozzarella (when using unpasteurized milk). The soybeans are…",
  "data/reddit-ask/r/askscience/comments/ptdjbx/do_viruses_eventually_reach_some_stable_optimal.json": "As a forewarning, I have a very limited understanding of biology and even less\nof virology, so this may be a very uniformed question. Viruses have their\ngenetic information encoded into RNA, as I understand it. RNA is composed of\nseveral combinations of bases (ACUG), and these combinations…",
  "data/reddit-ask/r/askscience/comments/ptgjsl/why_dont_we_feel_air_pressure.json": "The standard explanation I've seen is that this is due to the air on all sides\nof us pushing equally, but that's not always the case. If I place my hand flat\non a table, for example, there's no air under my hand to balance the pressure\npressing down from the atmosphere.\n\nEven apart from that aspect,…",
  "data/reddit-ask/r/askscience/comments/ptsno7/why_is_the_dark_matter_halo_spherical.json": "Dilettante scientist here, so be gentle. As I understand it, galaxies are disc\nshaped due to the conservation of angular momentum, but the all the data I’ve\nseen about dark matter says that it is a roughly spherical distribution around\nthe galaxy. Are there any theories as to why this is? Or is this…",
  "data/reddit-ask/r/askscience/comments/pu7o0e/why_havent_we_selected_for_avocados_with_smaller.json": "For many other fruits and vegetables, farmers have selectively bred varieties\nwith increasingly smaller seeds. But commercially available avocados still have\nhuge stones that take up a large proportion of the mass of the fruit. Why?",
  "data/reddit-ask/r/askscience/comments/pukavf/you_can_get_yellow_either_by_having_monochromatic.json": "Mixing different frequencies of light doesn't create a new monochromatic light,\nit's a superposition of all of the individual frequencies. So how is it that\ncombining RGB colors produces the same colors that you can get by varying the\nfrequency of light?",
  "data/reddit-ask/r/askscience/comments/puudpz/can_anything_in_the_universe_travel_faster_than.json": "It might be a dumb question but is it possible?",
  "data/reddit-ask/r/askscience/comments/pv5kfv/why_the_exhaust_gas_of_a_rocket_engine_or_a_jet.json": "So I was doing some personal study on thrust, and while reading about the\nconvergent-divergent nozzle of a rocket engine, I read that when exhaust gas\nexiting the combustion chamber reaches Mach 1, the exhaust gas becomes\ncompressible, and the velocity of compressible fluid (in this case the >Mach…",
  "data/reddit-ask/r/askscience/comments/pvjx8z/what_is_the_scientific_consensus_about_the.json": "I got a new employment where they sent me to a polygraph test in order to\ncontinue with the process, I was fine and got the job but keep wondering if that\nis scientifically accurate, or even if it is legal, I'm not in the US btw.",
  "data/reddit-ask/r/askscience/comments/pvpnao/what_makes_a_gene_dominant_or_recessive.json": "What is the difference between a dominant or recessive gene? I know that\ndominant genes prevail over recessive ones and this is also the stuff I find on\nthe internet. But I can't find an explanation of what makes a specific gene\nprevail over other ones in the fist place.",
  "data/reddit-ask/r/askscience/comments/pvrdqw/are_neutrinos_not_faster_than_light.json": "Scientists keep proving that neutrinos do not travel faster than the speed of\nlight. Well if that is the case, in case of a cosmic event like a supernova, why\ndo neutrinos reach us before light does? What is obstructing light from getting\nto us the same time?",
  "data/reddit-ask/r/askscience/comments/pvt329/do_we_need_inflation.json": "In my understanding, inflation has only negative sideffects, mostly in terms of\nunderstandability of the economy. Sure in the old times with gold standard it\nmight have been unavoidable, but nowadays, is there any good in keeping it?",
  "data/reddit-ask/r/askscience/comments/pvxu1o/how_can_stardust_create_stars_if_a_stars_need.json": "How can stardust create stars if (a) stars need hydrogen and (b) star dust is\nformed after stars have run out of hydrogen?",
  "data/reddit-ask/r/askscience/comments/pw8f5i/why_isnt_knowing_the_structure_of_a_molecule.json": "We always do experiments on new compounds and drugs to ascertain certain\nproperties and determine behavior, safety, and efficacy. But if we know the\nstructure, can’t we determine how it’ll react in every situation?",
  "data/reddit-ask/r/askscience/comments/pwm36s/why_do_antigen_rapid_tests_not_work_after_15.json": "I've used two different types of antigen rapid tests. Both say that the results\naren't valid if more than fifteen minutes have past since testing (dropping the\nsolution onto the test kit.). Why is this so? Do the coloring/colored molecules\nthat do the binding no longer work, or weaken, after 15…",
  "data/reddit-ask/r/askscience/comments/pwsc3a/is_the_flu_shot_the_same_in_different_parts_of.json": "If I got a flu shot in Oregon and then moved to Maine, would I still be\nprotected? I am moving 3,000 miles across the country, and I was planning to get\nthe flu shot before I move - should I wait until after I move?",
  "data/reddit-ask/r/askscience/comments/pwvj48/does_the_wood_from_different_trees_burn_at.json": "Specifically I was wondering about a particular tree, Osage Orange, that has an\nextremely high burning temperature. If charcoal was made from its wood would it\nburn hotter than charcoal from another tree thats wood doesn't burn as hot?\nSorry if I got the tag wrong, i wasn't sure whether to use…",
  "data/reddit-ask/r/askscience/comments/px6s00/can_nuclear_waste_still_be_used_for_energy.json": "As far as I'm aware, waste fuel from nuclear power plants is still\nradioactive/fissile. Seeing as waste management seems to be the biggest\ncounterpoint to nuclear energy, what can be done with the waste?\n\nCan you use a different configuration of reactor which generates energy from the\nwaste?\n\nOr is…",
  "data/reddit-ask/r/askscience/comments/pxlvi0/why_are_men_in_western_countries_half_as_fertile.json": "I just saw this short Vice documentary called Spermageddon\n[https://www.youtube.com/watch?v=yVyzjEF_sKw] that talked about the Male\nFertility Crisis.\n\nThe video referenced a meta analysis\n[https://academic.oup.com/humupd/article/23/6/646/4035689] quoted below in…",
  "data/reddit-ask/r/askscience/comments/pxszfk/askscience_ama_series_i_am_geoff_barnes_md_a.json": "I'm Geoff Barnes, M.D., and I work as a cardiologist and vascular medicine\nspecialist at the University of Michigan Health System in the United States. You\ncan follow me on Twitter at @GBarnesMD [https://twitter.com/GBarnesMD]. My\nprofessional areas of interest include anticoagulation, venous…",
  "data/reddit-ask/r/askscience/comments/pxtsmc/is_two_50mph_cars_crashing_same_as_100mph_car.json": "If two cars crash into each other going 50 miles per hour, is that the same\nforce generated as just one car going 100 miles per hour crashing into a tree\n(any still object)?\n\nSay you had some pressure reader at middle of both crashes, would it read the\nsame?\n\n\n\nThank you! Sorry if dumb question,…",
  "data/reddit-ask/r/askscience/comments/py9bvs/a_standard_internal_combustion_engine_burns_fuel.json": "At a simple glance C8H18+13.5O2=8CO2+9H2O, or 14.5 gas molecules into 17 gas\nmolecules. Is this the greater cause of pressure in the cylinder, or the heat\ngiven off and the resulting expansion (roughly online with the ideal gas law)?",
  "data/reddit-ask/r/askscience/comments/pyfyh9/similar_to_a_recently_asked_question_if_2_cars.json": "If so, how will the time and the space work for the two cars? Will they see each\nother tighter?",
  "data/reddit-ask/r/askscience/comments/pypq57/if_a_person_inhales_some_amount_of_a_virus_ex.json": "My college has mandatory vaccine & masks, but as expected, there are some\nstudents still getting sick. Constantly moving through hallways, I'm potentially\n(or even likely) being exposed to at least some of the virus. Is there any\nchance that I'm going to develop super immunity to covid from long…"
}