{
  "data/reddit-top/r/CapitolConsequences/comments/l1d7kn/it_is_now_12pm_and_every_capitol_terrorist_in.json": "Feels Good Man",
  "data/reddit-top/r/politics/comments/kprd7i/megathread_president_trump_pressures_georgia.json": "President Trump urged fellow Republican Brad Raffensperger, the Georgia\nsecretary of state, to \"find\" enough votes to overturn his defeat in an one-hour\nphone call Saturday.\n\n--------------------------------------------------------------------------------\n\n\nSUBMISSIONS THAT MAY INTEREST…",
  "data/reddit-top/r/politics/comments/krvh1f/megathread_us_capitol_locked_down_as_trump.json": "The U.S. Capitol locked down Wednesday with lawmakers inside as violent clashes\nbroke out between supporters of President Donald Trump and police.\n\nAn announcement was played inside the Capitol as lawmakers were meeting and\nexpected to vote to affirm Joe Biden’s victory. Due to an \"external…",
  "data/reddit-top/r/politics/comments/kteyie/megathread_twitter_permanently_suspends.json": "Twitter has announced a permanent suspension of President Donald Trump’s\naccount, citing \"the risk of further incitement of violence\" after conducting a\nreview of recent activity.\n\nTwitter issued a temporary suspension earlier this week following the events\ntaking place at the US Capitol and…",
  "data/reddit-top/r/politics/comments/kwqdsf/megathread_house_votes_to_impeach_president.json": "The U.S. House of Representatives voted today to impeach President Donald J.\nTrump for Incitement of Insurrection. The vote saw 10 Republican members of\nCongress vote in favor of impeachment, along with all 222 Democrats.\n\nThis is the first time that a US President has been impeached twice during…",
  "data/reddit-top/r/politics/comments/l1dj7s/megathread_joseph_r_biden_sworn_in_as_the_46th.json": "Joe Biden became the 46th President of the United States on Wednesday, declaring\nthat \"democracy has prevailed.\" He swore the oath of office to take the helm of\na deeply divided nation and inheriting a confluence of crises arguably greater\nthan any faced by his predecessors.\n\n-----------------------…",
  "data/reddit-top/r/wallstreetbets/comments/l6c5tg/just_read_a_new_york_times_article_saying_the_sec.json": "To the SEC retards in this sub: go fuck yourself. Why don’t you start\ninvestigating why companies can shut down trading so their hedge fund buddies\ndon’t lose money. But when people lose money it’s completely ok. Eat a dick.",
  "data/reddit-top/r/wallstreetbets/comments/l6j4r9/where_do_we_go_from_here_and_who_is_going_to_step.json": "We have grown to the kind of size we only dreamed of in the time it takes to get\na bad nights sleep. We've got so many comments and submissions that we can't\npossibly even read them all, let alone act on them as moderators. We wrote\nsoftware to do most of the moderation for us but that software…",
  "data/reddit-top/r/wallstreetbets/comments/l6omry/an_open_letter_to_melvin_capital_cnbc_boomers_and.json": "Mods do not delete, this is important to me, please read\n\n\n\nI was in my early teens during the '08 crisis. I vividly remember the enormous\nrepercussions that the reckless actions by those on Wall Street had in my\npersonal life, and the lives of those close to me. I was fortunate - my parents\nwere…",
  "data/reddit-top/r/wallstreetbets/comments/l6x130/class_action_against_robinhood_allowing_people_to.json": "Everyone open an account other that Robinhood. It might take a couple of days to\nbe able to use but I think its pretty clear that as most of us aren't\nbillionaires in hedge funds, Robinhood doesn't have our back, and has no problem\nseeing the working class loose millions because of their doing. Put…",
  "data/reddit-top/r/wallstreetbets/comments/l71fl1/like_this_post_if_you_are_holding_the_real.json": "Buy more during dips if you can, but at least hold.\n\nWe just have to hold until they fold. Today's actions by several brokers just\nshow how desperate the hedge funds are getting.\n\nHold with your immovable diamond hands for all that you hold dear and we will be\nbreaking Wall Street TOGETHER while…",
  "data/reddit-top/r/wallstreetbets/comments/l8pegt/i_get_it_now_i_completely_understand_why_nobody.json": "I got into $GME very late. I had a couple shares back at $20, had paper hands,\nand sold. I went all in a couple of days ago. Despite it only being a couple of\ndays, I've been lurking here for a bit. The amount of 6 figure, 7 figure, and 8\nfigure gains I was seeing was blowing my mind. More than…"
}