{
  "data/reddit-know/r/YouShouldKnow/comments/l5qgss/ysk_that_being_lonely_isnt_the_same_thing_as.json": "YSK that being lonely isn't the same thing as being alone.",
  "data/reddit-know/r/YouShouldKnow/comments/l5sx1r/ysk_if_you_have_to_stop_and_think_when_the_last.json": "YSK: If you have to stop and think when the last meal was that you ate a vegetable, you aren’t eating enough vegetables",
  "data/reddit-know/r/YouShouldKnow/comments/l5teob/ysk_that_your_medical_records_can_be_accessed_by.json": "YSK That your Medical Records can be accessed by others electronically and reveal a lot more about you than you think",
  "data/reddit-know/r/YouShouldKnow/comments/l6l9b1/ysk_jehovahs_witnesses_are_collecting_your_data.json": "YSK: Jehovah’s witnesses are collecting your data and you can stop them",
  "data/reddit-know/r/YouShouldKnow/comments/l6phxp/ysk_to_contact_google_and_speak_to_a_real_human.json": "YSK To contact Google and speak to a real human being over the phone, call the Google HQ",
  "data/reddit-know/r/YouShouldKnow/comments/l78xr2/ysk_many_terms_of_services_have_a_forced.json": "YSK: Many Terms of Services have a \"forced arbitration\" clause, meaning you agree not to sue them in a legal court. You can sometimes opt-out within 30 days of enforcement. Always check to see if and how you can.",
  "data/reddit-know/r/YouShouldKnow/comments/l7d1eo/ysk_that_you_can_easily_transfer_your_music_from.json": "YSK that you can easily transfer your music from one streaming service to another and even to text files",
  "data/reddit-know/r/YouShouldKnow/comments/l7ftds/ysk_to_take_high_quality_photos_of_yourself_and.json": "YSK to take high quality photos of yourself and your family",
  "data/reddit-know/r/YouShouldKnow/comments/l99qbx/ysk_if_you_decide_to_visit_familyfriends_that_are.json": "YSK if you decide to visit family/friends that are going through a rough time, consider bringing your own food and arrange your trasportation, even small inconveniences can add stress in difficult times",
  "data/reddit-know/r/YouShouldKnow/comments/l9h3pm/ysk_that_operating_rooms_handle_their_own_code.json": "YSK that Operating Rooms handle their own “Code Blue” situations, which means they don’t announce “Code Blue” on the overhead speaker. If your loved one is in surgery and you hear “Code Blue” announced, don’t worry, it’s not for them.",
  "data/reddit-know/r/YouShouldKnow/comments/l9jm66/ysk_to_keep_you_distance_from_any_car_with_snow.json": "YSK to keep you distance from any car with snow on its roof",
  "data/reddit-know/r/YouShouldKnow/comments/l9tsri/ysk_advertisers_on_reddit_are_charged_per_click.json": "YSK: Advertisers on Reddit are charged per click.",
  "data/reddit-know/r/YouShouldKnow/comments/la6l28/ysk_how_to_coexist_with_wildlife.json": "YSK how to coexist with wildlife",
  "data/reddit-know/r/YouShouldKnow/comments/la8adw/ysk_you_dont_have_to_shake_or_wave_around_instant.json": "YSK, you don't have to shake or wave around instant film, i.e. Polaroid, Fuji Instax. It's a chemical reaction that only requires time.",
  "data/reddit-know/r/YouShouldKnow/comments/la8mni/ysk_no_matter_what_headspace_youre_in_you_are_not.json": "YSK No matter what headspace you’re in. You are not alone. Don’t give up",
  "data/reddit-know/r/YouShouldKnow/comments/laenb3/ysk_if_you_did_not_receive_the_us_stimulus_checks.json": "YSK If you did not receive the US stimulus checks, you may be able to get the money you are owed as part of your 2020 tax returns",
  "data/reddit-know/r/YouShouldKnow/comments/lai4hb/ysk_that_when_it_snows_you_should_shovel_a_3x3.json": "YSK that when it snows you should shovel a 3x3 area around your fire hydrant.",
  "data/reddit-know/r/YouShouldKnow/comments/layr4p/ysk_that_when_driving_on_wet_winter_roads_that.json": "YSK that when driving on wet winter roads, that when a car in front of you stops producing (or greatly reduces) its spray behind the rear tires that this means they are driving on ice.",
  "data/reddit-know/r/YouShouldKnow/comments/lbdjrg/ysk_if_you_think_you_are_being_followed_turn.json": "YSK if you think you are being followed, turn right 4 times.",
  "data/reddit-know/r/YouShouldKnow/comments/lbuxrs/ysk_when_applying_to_companies_abroad_adapt_the.json": "YSK: when applying to companies abroad, adapt the information in your application to an international context (including adding country phone codes)",
  "data/reddit-know/r/YouShouldKnow/comments/lbw6uu/ysk_that_41_of_the_population_have_a_vitamin_d.json": "YSK that 41% of the population have a vitamin D deficiency, which could be linked to chronic diseases, fatigue, weak immune system",
  "data/reddit-know/r/YouShouldKnow/comments/lc74ab/ysk_ordinary_white_mushrooms_are_amazing_sources.json": "YSK: Ordinary white mushrooms are amazing sources of vitamin D and protein in your diet and cost next to nothing. If you're cooking with ground meat, you can mix in chopped/processed mushrooms to cheaply increase the size of your meal without changing the taste.",
  "data/reddit-know/r/YouShouldKnow/comments/lcfaga/ysk_if_you_threaten_violence_against_guys_who.json": "YSK: If you threaten violence against guys who might hurt your daughter/sister/female relative, there's a good chance that if a guy does hurt her, she won't tell you about it",
  "data/reddit-know/r/YouShouldKnow/comments/lcqfb7/ysk_old_people_do_not_often_feel_old_treating.json": "YSK old people do not often feel old. Treating them as an old person, only reminds them that they look old on the outside.",
  "data/reddit-know/r/YouShouldKnow/comments/lcyem5/ysk_craving_ice_is_a_symptom_of_iron_deficiency.json": "YSK Craving ice is a symptom of iron deficiency.",
  "data/reddit-know/r/YouShouldKnow/comments/ld6e1g/ysk_that_you_can_use_vlc_player_to_play_youtube.json": "YSK that you can use VLC Player to play YouTube videos in the background, with a sleep timer and without ads.",
  "data/reddit-know/r/YouShouldKnow/comments/ldfbn9/ysk_most_customer_service_livechat_agents_can_see.json": "YSK: Most customer service live-chat agents can see what you're typing as you're typing it. If you type something out and then erase it before hitting send, they probably still saw it.",
  "data/reddit-know/r/YouShouldKnow/comments/ldjynx/ysk_that_the_irs_is_offering_tax_relief_and.json": "YSK That the IRS is offering Tax Relief and Forgiveness for anyone struggling with tax debt.",
  "data/reddit-know/r/YouShouldKnow/comments/ldk0yj/ysk_in_your_phone_settings_you_can_change_over.json": "YSK in your phone settings, you can change over from 5g to 4g or even 3g if your noticing painfully slow speeds.",
  "data/reddit-know/r/YouShouldKnow/comments/ldn0v0/ysk_topping_off_your_vehicle_at_the_fuel_pump_is.json": "Ysk; \"Topping off\" your vehicle at the fuel pump is bad for it.",
  "data/reddit-know/r/YouShouldKnow/comments/ldn5wj/ysk_if_you_are_experiencing_a_lot_of_static.json": "YSK if you are experiencing a lot of static shocks, or unusually staticky laundry, humidifying your house may fix it. This is especially true if you have a wood stove, if you can you should always keep a teapot full of water on it.",
  "data/reddit-know/r/YouShouldKnow/comments/le5v6d/ysk_that_the_symptoms_of_a_heart_attack_may_be.json": "YSK that the symptoms of a heart attack may be quite different than what you’d expect.",
  "data/reddit-know/r/YouShouldKnow/comments/le78aw/ysk_teleflora_is_a_scam.json": "YSK: Teleflora is a scam",
  "data/reddit-know/r/YouShouldKnow/comments/lecpti/ysk_that_at_will_employment_does_not_mean_your.json": "YSK that \"At Will Employment\" does not mean your employer gets to fire you for an illegal reason",
  "data/reddit-know/r/YouShouldKnow/comments/ledo0m/ysk_most_people_who_use_wheelchairs_arent.json": "YSK most people who use wheelchairs aren’t paralyzed. That doesn’t mean they’re faking",
  "data/reddit-know/r/YouShouldKnow/comments/leill8/ysk_if_you_use_canvas_for_your_online_classes.json": "YSK if you use Canvas for your online classes, that your exact home address could be viewable by default by all your classmates. You can change that, though, and just show your city (or nothing at all).",
  "data/reddit-know/r/YouShouldKnow/comments/leofmb/ysk_if_you_use_the_free_ad_supported_version_of.json": "YSK: If you use the free, ad supported version of hulu, watching on Mozilla allows you to bypass ads.",
  "data/reddit-know/r/YouShouldKnow/comments/lepym2/ysk_its_means_it_is_and_its_shows_belonging_or.json": "YSK: \"it's\" means \"it is\" and \"its\" shows belonging or possession.",
  "data/reddit-know/r/YouShouldKnow/comments/leuo32/ysk_if_you_hear_koreans_say_neegah_in_converation.json": "YSK if you hear Koreans say \"Nee-gah\" in converation it means \"you\" and is NOT a racial slur",
  "data/reddit-know/r/YouShouldKnow/comments/leux99/ysk_in_regards_to_disabled_toilets_just_because.json": "YSK In regards to disabled toilets just because someone is able to walk or seemingly looks like an ‘average’ person does not mean that they should not be using it and it’s not your place to determine that",
  "data/reddit-know/r/YouShouldKnow/comments/ley7ic/ysk_that_you_should_prepare_for_your_death_even.json": "YSK that you should prepare for your death even if you are young. It can make the difficult situation easier on your family.",
  "data/reddit-know/r/YouShouldKnow/comments/lf1mfj/ysk_all_animals_deserve_to_be_treated_with.json": "YSK All animals deserve to be treated with respect regardless of whether they are deemed as ‘cute’ by society",
  "data/reddit-know/r/YouShouldKnow/comments/lfe3sy/ysk_zipper_merging_waiting_to_merge_until_the.json": "YSK zipper merging (waiting to merge until the lane ends, rather than merging early) can reduce traffic by up to 40%",
  "data/reddit-know/r/YouShouldKnow/comments/lfkezy/ysk_if_you_are_driving_long_distances_in.json": "YSK if you are driving long distances in snow/slush, stop every hour to check your headlights",
  "data/reddit-know/r/YouShouldKnow/comments/lfmmbw/ysk_if_you_find_yourself_in_dire_financial.json": "YSK- If you find yourself in dire financial straits and are likely to miss a house payment, call your mortgage holder. There’s many options available to you and they’re likely going to want to help you find a solution.",
  "data/reddit-know/r/YouShouldKnow/comments/lg4wpi/ysk_automotive_basics_at_least_a_rough_idea_of.json": "YSK automotive basics (at least a rough idea of how a car works, maintenance basics, and diagnostic basics) if you own or drive a car.",
  "data/reddit-know/r/YouShouldKnow/comments/lg5n0o/ysk_that_rub_your_chest_your_arms_will_take_care.json": "YSK that \"Rub your chest, your arms will take care of themselves\" was made up and does not work. During this cold winter periods, don't get life-saving advice from Batman. Christopher Nolan made this up and it does not actually work.",
  "data/reddit-know/r/YouShouldKnow/comments/lgetui/ysk_when_youre_feeling_ashamed_for_complaining.json": "YSK when you’re feeling ashamed for complaining about your own hardships when others are so much worse off that “the size of human suffering is absolutely relative.” Your feelings of disappointment, sadness, loss, etc., big and small, are valid.",
  "data/reddit-know/r/YouShouldKnow/comments/lh09z9/ysk_local_libraries_usually_have_movies_tv_series.json": "YSK: Local libraries usually have Movies, TV series, CDs and Audio books you can borrow for free. They usually also take donations. Take Movies or series you don't watch often and donate them to the library where they will get some use.",
  "data/reddit-know/r/YouShouldKnow/comments/lh44cw/ysk_plan_b_at_costco_does_require_a_membership.json": "YSK Plan B at Costco DOES require a membership",
  "data/reddit-know/r/YouShouldKnow/comments/lhch9e/ysk_that_not_all_abuse_is_physical_or_visible.json": "YSK that not all abuse is physical or visible.",
  "data/reddit-know/r/YouShouldKnow/comments/lhjx3w/ysk_how_to_perform_cpr_on_household_pets.json": "YSK How to perform CPR on household pets",
  "data/reddit-know/r/YouShouldKnow/comments/lhoapl/ysk_organic_foods_are_not_inherently.json": "YSK: Organic foods are not inherently nutritionally better for you in comparison to non-organic foods.",
  "data/reddit-know/r/YouShouldKnow/comments/lhqg72/ysk_pharmacies_can_charge_wildly_different_prices.json": "YSK: Pharmacies can charge wildly different prices for the same medication. Shop around!",
  "data/reddit-know/r/YouShouldKnow/comments/lhztdo/ysk_it_is_totally_fine_to_want_a_quiet_simple.json": "YSK It is totally fine to want a quiet, simple life of stability. You do not have to strive to change to world; you are not selfish for that. In fact, putting yourself first is noble in itself.",
  "data/reddit-know/r/YouShouldKnow/comments/li5p6i/ysk_you_dont_have_to_call_to_cancel_a.json": "YSK: You don’t have to call to cancel a subscription if you pretend to live in California",
  "data/reddit-know/r/YouShouldKnow/comments/lig3fd/ysk_if_your_power_goes_out_in_the_winter_and_your.json": "YSK if your power goes out in the winter and your home starts getting cold, go to the bathroom, close the door, plug the bathtub drain, and turn the shower on hot. Once the tub is full (or you run out of hot water) turn the water off. This will heat the room for around an hour.",
  "data/reddit-know/r/YouShouldKnow/comments/lihvzp/ysk_maintaining_food_storage_is_a_major_help_in.json": "YSK: Maintaining food storage is a major help in keeping yourself above water in hard times.",
  "data/reddit-know/r/YouShouldKnow/comments/liq5wv/ysk_that_if_a_cashier_has_their_light_off_you.json": "YSK that if a cashier has their light off, you should not join their line, or ask if they are still open.",
  "data/reddit-know/r/YouShouldKnow/comments/lis00l/ysk_when_it_comes_time_to_put_your_pet_to_sleep.json": "YSK When it comes time to put your pet to sleep, it doesn’t have to be at the vets office. Many vets will do the procedure at your home, where they are most comfortable.",
  "data/reddit-know/r/YouShouldKnow/comments/liyiwu/ysk_that_if_you_see_a_large_bright_meteor_or.json": "YSK that if you see a large, bright meteor or \"fireball\" and want to report it/see if others saw the same thing you can go to the american meteor society's website.",
  "data/reddit-know/r/YouShouldKnow/comments/lj0zqe/ysk_just_because_the_money_shows_in_your_account.json": "YSK Just because the money shows in your account, doesn't mean the check has totally cleared",
  "data/reddit-know/r/YouShouldKnow/comments/ljbriu/ysk_despite_all_the_flack_you_get_from_your.json": "YSK: despite all the flack you get from your friends, it's okay to be a virgin Redditors.",
  "data/reddit-know/r/YouShouldKnow/comments/ljd533/ysk_that_candle_wax_is_extremely_flammable_and.json": "YSK that candle wax is extremely flammable and, when ignited, should be treated like a grease fire.",
  "data/reddit-know/r/YouShouldKnow/comments/ljekzj/ysk_if_you_have_dry_scaly_hands_you_should_use.json": "YSK: If you have dry, scaly hands, you should use OIL as a moisturizer immediately after washing or showering (leaving a little water on your skin to seal in moisture)",
  "data/reddit-know/r/YouShouldKnow/comments/ljghlj/ysk_you_can_use_laser_pointers_with_cats_but_you.json": "YSK you can use laser pointers with cats, but you should NOT use them with dogs",
  "data/reddit-know/r/YouShouldKnow/comments/ljpb4m/ysk_it_is_highly_unethical_for_someone_to.json": "YSK It is highly unethical for someone to appraise an item for you and then make an offer to buy it. They are likely attempting to swindle you out of a lot of money. If that happens, be sure to go get an appraisal from someone else",
  "data/reddit-know/r/YouShouldKnow/comments/ljrja0/ysk_that_if_you_are_suffering_from_an_unusual.json": "YSK that if you are suffering from an unusual condition and your doctors don't seem to be getting anywhere, you can find true experts by searching [The name of the condition] + \"pubmed\"",
  "data/reddit-know/r/YouShouldKnow/comments/lk15tl/ysk_if_a_small_business_hooks_you_up_with_free.json": "YSK if a small business hooks you up with free stuff, or discounted services don't word it that way in your review.",
  "data/reddit-know/r/YouShouldKnow/comments/lkctvj/ysk_win10_users_can_press_the_windows_key_and_tab.json": "YSK: Win10 users can press the Windows key and tab to open a new desktop instance. This is especially useful if you're a gamer and a game is crashing/stuck, but task manager won't open. Swap over to Desktop 2 and open it there, close your game and then switch back to instantly solve the problem.",
  "data/reddit-know/r/YouShouldKnow/comments/lke7yo/ysk_dating_is_not_about_impressing_its_about.json": "YSK dating is not about impressing, it’s about selecting.",
  "data/reddit-know/r/YouShouldKnow/comments/lkennz/ysk_you_should_close_all_the_doors_in_your_house.json": "YSK you should close all the doors in your house when you're out or sleeping.",
  "data/reddit-know/r/YouShouldKnow/comments/lkfppm/ysk_that_snow_shoveling_is_a_real_trigger_for.json": "YSK that snow shoveling is a real trigger for heart attacks. If you're able bodied or have a snowblower / plow, consider asking your neighbors if they need help. And if you're at-risk, don't be afraid to ask for help yourself.",
  "data/reddit-know/r/YouShouldKnow/comments/ll96n1/ysk_you_can_search_a_movie_on_google_drive_by.json": "YSK You can search a movie on Google Drive by googling \"site:drive.google.com MOVIE NAME\"",
  "data/reddit-know/r/YouShouldKnow/comments/llgc0j/ysk_when_talking_to_anyone_dont_only_bring_up_the.json": "YSK When talking to anyone don't only bring up the negatives in your life. Make sure to bring the good up as well. Being the person who listens is nice, but can be emotionally exhausting. Especially if all the other person does is complain.",
  "data/reddit-know/r/YouShouldKnow/comments/llhelq/ysk_the_irs_will_never_call_you_they_will_never.json": "YSK: The IRS will never call you. They will never email you or text you. The only instance they will call is if you owe large amounts of back taxes or if you're subject to a field audit. In these cases, they will send a letter to you letting you know about the call before it happens.",
  "data/reddit-know/r/YouShouldKnow/comments/llm4tv/ysk_that_when_you_have_no_heat_in_your_house_and.json": "YSK that when you have no heat in your house and its freezing outside, letting cold water run in your taps can prevent pipes from freezing up/bursting.",
  "data/reddit-know/r/YouShouldKnow/comments/llndj9/ysk_your_job_is_important_but_not_as_much_as_your.json": "YSK: Your job is important, but not as much as your mental and physical health.",
  "data/reddit-know/r/YouShouldKnow/comments/lltbpa/ysk_if_youre_sitting_in_your_car_and_running_it.json": "YSK: if you’re sitting in your car and running it to warm up, make sure your tail pipe is clear of snow",
  "data/reddit-know/r/YouShouldKnow/comments/llyfn2/ysk_how_to_shelter_in_place_from_the_cold.json": "YSK how to shelter in place from the cold.",
  "data/reddit-know/r/YouShouldKnow/comments/lm5816/ysk_just_because_you_forgive_someone_doesnt_mean.json": "YSK: Just Because You Forgive Someone Doesn't Mean You Have To Let Them Back Into Your Life",
  "data/reddit-know/r/YouShouldKnow/comments/lm7c9r/ysk_if_you_ever_have_to_collect_water_from_an.json": "YSK If you ever have to collect water from an outside source (river, stream, lake, etc.), then you should distill the water before drinking it. Boiling is not enough to make it safe!",
  "data/reddit-know/r/YouShouldKnow/comments/lm8c62/ysk_whitening_toothpaste_is_usually_more_abrasive.json": "YSK: \"Whitening\" toothpaste is usually more abrasive than regular toothpaste and will wear down your enamel faster. You should avoid it if you have tooth decay problems.",
  "data/reddit-know/r/YouShouldKnow/comments/lmjq8x/ysk_add_outlinecom_before_a_url_to_bypass_the.json": "YSK: Add ‘outline.com/‘ before a url to bypass the paywall (this doesn’t work on every website, but it’s worth knowing). It can also be used to remove ads and only show the main text/images of a webpage",
  "data/reddit-know/r/YouShouldKnow/comments/lmlhhr/ysk_today_nasas_perseverance_rover_lands_on_mars.json": "YSK: Today NASA's Perseverance Rover lands on Mars.",
  "data/reddit-know/r/YouShouldKnow/comments/lmnz4b/ysk_if_you_suspect_someone_is_following_you_go_to.json": "YSK: If you suspect someone is following you go to the closest police station NOT your home!",
  "data/reddit-know/r/YouShouldKnow/comments/lmrv48/ysk_not_shoveling_your_sidewalks_will_impede.json": "YSK not shoveling your sidewalks will impede blind and wheelchair bound people.",
  "data/reddit-know/r/YouShouldKnow/comments/lmsusb/ysk_whence_means_from_where_and_similarly_hence.json": "YSK: \"whence\" means \"from where\" and, similarly, \"hence\" and \"thence\" mean \"from here\" and \"from there\"",
  "data/reddit-know/r/YouShouldKnow/comments/ln2fyy/ysk_if_you_cant_afford_to_pay_for_mindfulness.json": "YSK: If you can't afford to pay for mindfulness apps like Headspace or Calm, you can find *free*, evidence-based mental health and mindfulness apps that were developed by researchers at the US Department of Veterans Affairs for use by civilians and veterans alike.",
  "data/reddit-know/r/YouShouldKnow/comments/ln6pds/ysk_that_leaving_water_running_will_help_prevent.json": "YSK that leaving water running will help prevent pipes from freezing.",
  "data/reddit-know/r/YouShouldKnow/comments/lnfndu/ysk_to_keep_water_in_your_toilets_and_pour_some.json": "YSK To keep water in your toilets and pour some sort of liquid in the sinks, preferably water.",
  "data/reddit-know/r/YouShouldKnow/comments/lnoh5d/ysk_poison_dart_frogs_arent_actually_poisonous.json": "YSK ‘poison’ dart frogs aren’t actually poisonous when kept as pets, they are poisonous because of the insects they eat in the wild but in captivity are fed fruit flys",
  "data/reddit-know/r/YouShouldKnow/comments/lnrsbn/ysk_if_you_watch_south_park_with_subtitles_you.json": "YSK: If you watch South Park with subtitles, you can know everything that Kenny is saying.",
  "data/reddit-know/r/YouShouldKnow/comments/lns3x2/ysk_dont_hangup_on_robocalls_fight_back_put_the.json": "YSK: Don't hang-up on Robocalls - fight back - put the call on hold instead",
  "data/reddit-know/r/YouShouldKnow/comments/lnutgt/ysk_if_your_vehicle_is_ever_totaled_make_the.json": "YSK: If your vehicle is ever totaled, make the insurance company send you the valuation report. It is likely that they undervalued your vehicle, costing you thousands.",
  "data/reddit-know/r/YouShouldKnow/comments/lny54u/ysk_that_when_you_speak_to_someone_who_is_hard_of.json": "YSK that when you speak to someone who is hard of hearing, slowing down your speech is more important than raising your volume.",
  "data/reddit-know/r/YouShouldKnow/comments/loggqz/ysk_positive_reinforcement_goes_a_long_way.json": "YSK: Positive reinforcement goes a long way.",
  "data/reddit-know/r/YouShouldKnow/comments/loje55/ysk_that_up_to_1_in_5_people_experience_random.json": "YSK that up to 1 in 5 people experience random episodes of excruciating rectal cramps. Hot showers, ibuprofen and cow/cat yoga poses might help.",
  "data/reddit-know/r/YouShouldKnow/comments/lopiih/ysk_that_if_your_vehicle_gas_pedal_gets_stuck.json": "YSK: That if your vehicle gas pedal gets stuck, press the brakes firmly, and without lifting your foot off the brake pedal, place car in neutral. This will bring the car to a full stop safely.",
  "data/reddit-know/r/YouShouldKnow/comments/lopq32/ysk_that_negative_reinforcement_doesnt_mean.json": "YSK that negative reinforcement doesn’t mean taking away preferred items but rather removing a negative stimulus as a reward for demonstrating an expected behavior.",
  "data/reddit-know/r/YouShouldKnow/comments/lozk0a/ysk_if_you_are_an_employer_or_employee_in.json": "YSK If you are an Employer or Employee in Colorado, a Job Posting MUST disclose pay and benefits.",
  "data/reddit-know/r/YouShouldKnow/comments/lp504p/ysk_if_you_have_asthma_symptoms_after_exercise_it.json": "YSK: if you have asthma symptoms after exercise, it may be EIB, not necessarily because you’re out of shape. There are inhalers for this.",
  "data/reddit-know/r/YouShouldKnow/comments/lpen0m/ysk_the_150_plus_feet_45_meters_of_space_and_more.json": "YSK- The 150 plus feet (45 meters) of space (and more) that truckers leave between themselves and another car on the highway is not for you to squeeze in between or use",
  "data/reddit-know/r/YouShouldKnow/comments/lpp5nn/ysk_when_you_worry_about_what_the_others_think.json": "YSK: When you worry about what the others think about you, they don't think about you. They worry about what you think about them.",
  "data/reddit-know/r/YouShouldKnow/comments/lpsx29/ysk_if_you_see_a_plastic_bag_in_the_ocean_do_not.json": "YSK: If you see a plastic bag in the ocean, DO NOT go near it",
  "data/reddit-know/r/YouShouldKnow/comments/lq64g1/ysk_that_you_probably_have_cheaper_options_on.json": "YSK That you probably have cheaper options on protecting your cell phones and other products through your mobile service provider",
  "data/reddit-know/r/YouShouldKnow/comments/lqaw5w/ysk_that_walmart_sells_regular_and_7030_insulin.json": "YSK that Walmart sells regular and 70/30 insulin vials for $24.88 and $42.88 apiece over the counter. It's not the current best regimen available, but if you are uninsured or break your vial, it can prevent diabetic ketoacidosis in a pinch.",
  "data/reddit-know/r/YouShouldKnow/comments/lqqkze/ysk_that_if_you_arent_getting_a_2_raise_every.json": "YSK that if you aren’t getting a 2% raise every year, you’re losing money(in the USA).",
  "data/reddit-know/r/YouShouldKnow/comments/lqsti5/ysk_you_can_dislocate_your_jaw_by_yawning_too.json": "YSK : You can dislocate your jaw by yawning too wide , if this happens don't freak out , you just have to push it back up a little .",
  "data/reddit-know/r/YouShouldKnow/comments/lrek8g/ysk_if_someone_you_know_is_going_through_some.json": "YSK: If someone you know is going through some tough times is very thoughtful to text them often to have news and to check on them, but don't be pushy if you don't get an answer! that person probably has dozens of text to answer and it may be mentally draining to relive it with each text.",
  "data/reddit-know/r/YouShouldKnow/comments/lrh65x/ysk_yelp_filters_nonrecommended_reviews_has_been.json": "YSK Yelp filters non-recommended reviews & has been accused of hiding good reviews for companies that refuse to pay them for advertising.",
  "data/reddit-know/r/YouShouldKnow/comments/lrkggb/ysk_if_you_struggle_with_when_to_use_whowhom_if.json": "YSK: If you struggle with when to use who/whom; If you can replace the word with “he”' or “'she,” use who. If you can replace it with “him” or “her,” use whom.",
  "data/reddit-know/r/YouShouldKnow/comments/lrrsaq/ysk_dont_share_those_missing_persons_posts.json": "YSK don't share those \"missing persons\" posts",
  "data/reddit-know/r/YouShouldKnow/comments/lrya1z/ysk_if_youre_calling_someones_cell_phone_during_a.json": "YSK: if you’re calling someone’s cell phone during a late night emergency, call twice in quick succession. Usually this will override any “do not disturb” settings the recipient might have set up.",
  "data/reddit-know/r/YouShouldKnow/comments/lslo8y/ysk_you_are_allowed_to_do_things_and_have_fun.json": "YSK: You are allowed to do things and have fun when you're not with your partner. You do not need to be with your partner 100% of the time.",
  "data/reddit-know/r/YouShouldKnow/comments/lsmxa3/ysk_if_you_live_in_america_and_cant_afford_a_down.json": "YSK: If you live in America and can't afford a down payment on a home a USDA rural development loan will often cover 100% of the home's cost, If the home is located in an eligible area. You may be able to find a home for less than you pay for rent.",
  "data/reddit-know/r/YouShouldKnow/comments/lsqvwu/ysk_if_your_partner_says_you_dont_have_to_wear_a.json": "YSK: If your partner says you don't have to wear a condom, do so anyway. Especially if you currently don't want a child.",
  "data/reddit-know/r/YouShouldKnow/comments/lsui9g/ysk_if_you_like_music_from_a_particular.json": "YSK: if you like music from a particular artist/band and want to search other artists similar to them, you can go to music-map.com and it will create a map of related artists/bands you can listen to.",
  "data/reddit-know/r/YouShouldKnow/comments/lswfxj/ysk_a_very_common_cause_of_bad_breath_andor_bad.json": "YSK: A very common cause of bad breath and/or bad taste in the mouth are tonsil stones: bits of plaque and food particles stuck in the tonsils. You can see them with your bare eye or with a black light pen and dislodge them by prodding the tonsil.",
  "data/reddit-know/r/YouShouldKnow/comments/lszqse/ysk_that_living_with_toxic_people_affects_not.json": "YSK that living with toxic people affects not just your mental health but your physical health too.",
  "data/reddit-know/r/YouShouldKnow/comments/lszy6n/ysk_if_someone_comes_out_to_you_saying_they_have.json": "YSK if someone comes out to you saying they have a mental illness of some sort they are the same person.",
  "data/reddit-know/r/YouShouldKnow/comments/lt6btc/ysk_you_might_not_actually_hate_vegetables_you.json": "YSK: You might not actually hate vegetables. You might hate (over)cooked vegetables.",
  "data/reddit-know/r/YouShouldKnow/comments/ltf28u/ysk_if_you_received_boosted_unemployment_checks.json": "YSK: If you received boosted unemployment checks in the US(the $300/$600 per week) taxes were NOT withheld from that so you will owe them when you file. Do your taxes early this year so you have time to save up if you wind up in the red.",
  "data/reddit-know/r/YouShouldKnow/comments/ltnyy5/ysk_what_people_make_an_effort_to_apologize_about.json": "YSK what people make an effort to apologize about sincerely to you, is often actually a reflection of the things that they find most hurtful/frustrating",
  "data/reddit-know/r/YouShouldKnow/comments/ltxls0/ysk_that_after_easter_animal_shelters_are_often.json": "YSK that after Easter, animal shelters are often flooded with bunnies that people got as gifts but weren't prepared to care for",
  "data/reddit-know/r/YouShouldKnow/comments/ltysr0/ysk_make_sure_to_take_pictures_when_you_move_into.json": "YSK: Make sure to take pictures when you move into an apartment, a house, trailer, etc.",
  "data/reddit-know/r/YouShouldKnow/comments/lu2jcq/ysk_there_is_a_text_based_phishing_campaign_to.json": "YSK there is a text based phishing campaign to hack people's venmos. If you get a text that looks like Venmo and claims there is suspicious activity, report it."
}