{
  "data/reddit-ask/r/AskHistorians/comments/ttdo9f/i_am_famed_naturalist_historian_politician_and.json": "Salvete! I am here sitting on the shores of the bay of Naples enjoying a calm\nevening at rest, between my busy life as an imperial administrator, writer,\nacademic, natural philosopher, natural historian, military commander,\nrhetorician, etc... As I can gaze across the bay at the rolling slopes of…",
  "data/reddit-ask/r/NoStupidQuestions/comments/tthehn/should_puerto_rico_be_granted_statehood_to_become.json": "What do you think? Statehood for Puerto Rico?",
  "data/reddit-ask/r/NoStupidQuestions/comments/ttiojj/why_is_it_bad_to_be_a_socialist.json": "I’m so confused on why it’s a bad thing in America and other parts of the world\nto be a socialist.\n\nI live in Sweden and I get free Heath care that works very well. Just the other\nday I got a free x-ray. Wait times are no problem. I also got to visit a\ntherapist for free after my grandfather died.…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ttfij5/why_does_it_take_45_minutes_for_me_to_climax.json": "Does having a condom on prevent some men from climaxing? This is a recurring\nenough issue to where I’ve realized I’ll never fuck someone and be done in under\nhalf an hour. It’s better than lasting 5 minutes, but by the end it’s kinda\npainful for both of us. I just don’t understand",
  "data/reddit-ask/r/AskHistorians/comments/ttdhdm/april_fools_alert_askhistoricalfiguresanything.json": "Hi everyone!\n\nAs is tradition, for April Fools we let our hair down a bit and allow some\nfrivolity to infest the subreddit. This year we are doing r/HistoricalAMA\n[/r/HistoricalAMA], inviting historical figures from throughout the centuries to\nanswer questions from their legions of fans.\n\nUntil…",
  "data/reddit-ask/r/askscience/comments/ttk7ay/is_there_enough_density_change_in_a_trees_growth.json": "Hearing that in order to work out the age of a tree you need to either take a\ncore sample or cut down the whole tree, opening it up to infection or even\ndeath, couldn't Ultrasound be adapted to peek at the rings without needing to\ndamage the tree?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ttjkc1/why_is_person_of_color_considered_okay_but.json": "I'm black and even I don't understand this.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ttm3qe/is_it_bad_that_i_dont_like_to_think_of_myself_as.json": "It leaves such a bad taste in my mouth. It just feels like such a strong word.\nAnd whenever I think of it in those terms, it’s like it becomes… real. This\nprobably doesn’t make any sense but I don’t know how to describe it. It doesn’t\nalways feel like I was raped. Even though technically it was non…",
  "data/reddit-ask/r/AskHistorians/comments/ttgh1p/i_am_the_true_sacred_sovereign_on_earth_the.json": "Proof\n[https://media.discordapp.net/attachments/761189757761749003/958214626091348039/Hong_AMA.png?width=1702&height=1404]\n\nGreetings to my brothers and sisters over the Internet. I, the true sacred\nsovereign, have deigned to speak candidly beyond the walls of my mighty palace\nto those who would…",
  "data/reddit-ask/r/NoStupidQuestions/comments/ttfe7a/why_is_it_so_hard_to_buy_a_new_car_with_manual.json": "I keep trying. Nissan said it was possible but would take a year and would cost\nme more. I remember when you paid extra for automatic. What gives?",
  "data/reddit-ask/r/AskHistorians/comments/ttmep9/i_am_leonidas_king_of_sparta_ask_me_anything.json": "GREETINGS, REDDIT! I AM LEONIDAS, THIRD SON OF KING ANAXANDRIDAS AND FIRST IN\nFAME OF THE AGIAD HOUSE! THE EPHORS HAVE DECREED A RARE DAY OF OPENNESS TO THE\nCURIOSITY OF FOREIGNERS!\n\nPROOF! [https://imgur.com/az1mAT5]",
  "data/reddit-ask/r/AskHistorians/comments/ttfaqw/explorer_governor_of_new_york_vice_president.json": "Proof: https://imgur.com/S5nmQBV",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ttkglm/housing_bubble_burstgood_thing.json": "If the housing bubble bursts, that's means people who are investing in\nproperties will loose their profits and potentially the money they invested in\nthe first place, but in the end it will mean housing is more affordable,\nbenefiting people struggling to own a modest single family home...right or…",
  "data/reddit-ask/r/NoStupidQuestions/comments/ttkcdr/im_genuinely_curious_but_why_does_the_republican.json": "I’m neutral, but see way too many articles that mention Republicans voting\nagainst anything that can help American citizens live a better life that’s\nnormal anywhere outside the US.",
  "data/reddit-ask/r/AskHistorians/comments/ttnktq/i_am_the_honorable_andrew_oliver_esq_the_assigned.json": "Honorable gentlemen,\n\nSome of you might know my name and person, but for those who are unaware, my\nname is Andrew Oliver Esq., Secretary of the Province of Massachusetts Bay. In\nthe early months of the year of our lord seventeen-sixty-five, I was\ncommissioned as stamp distributor for the Province…",
  "data/reddit-ask/r/AskHistorians/comments/ttpm8n/we_are_the_wives_of_henry_viii_king_of_england.json": "Greetings! Here be our proof. [https://imgur.com/a/MHCMep3]\n\nWe, the six wives of King Henry VIII, shall jointly share this account to answer\nyour questions about our lives and our tumultuous times. We shall individually\nintroduce ourselves:\n\n> I am Katherine, daughter of Isabel of Castile and…",
  "data/reddit-ask/r/AskHistorians/comments/ttplom/i_am_sokrates_son_of_sophroniskos_of_the_deme.json": "But do not wonder if I ask you questions in return.",
  "data/reddit-ask/r/NoStupidQuestions/comments/ttqck9/republicans_of_reddit_can_someone_please_explain.json": "I just read a Fox News article and it seems this issue has resurfaced in\nright-wing media. The article is titled “Gaetz sends Nadler hard drive\ncontaining contents of Hunter Biden’s laptop.” Since this controversy’s\ninception, I’ve been unable to find any evidence of wrongdoing or illegality…",
  "data/reddit-ask/r/NoStupidQuestions/comments/ttpjyp/im_a_21_year_old_male_and_i_feel_my_memory_is.json": "I feel like as a 21 year old, my memory seriously should not be this bad, and\nI’m not sure if it’s always been this bad or if it’s been declining recently\n(see. Shit memory) I often forget things I’ve just read and have just been\noverall slow it feels; am I going crazy? Also, not sure if there is…",
  "data/reddit-ask/r/AskHistorians/comments/ttmq1h/i_am_jeane_dixon_famed_medium_psychic_and.json": "Proof. [https://imgur.com/a/4yK4Px5]\n\nIt is I - the one, the only, the incomparable Jeane Dixon, renowned psychic,\nauthor and close confidante of the 40th President of the United States, Nancy\nReagan. I've written multiple best-selling books, including an autobiography, a\ncookbook and of course my…",
  "data/reddit-ask/r/AskHistorians/comments/tteaqz/hello_i_am_rebecca_gratz_a_charitable_organizer.json": "Proof [https://imgur.com/hjwTrGS]\n\nI was born in Philadelphia in 1781, soon after the founding of our great nation.\nMy parents raised us to be devout Jews, but also gave us excellent educations,\nand my father's income allowed us to mingle with society. As such, while only an\namateur poet myself, in…",
  "data/reddit-ask/r/AskHistorians/comments/ttl2vn/i_am_an_soe_wireless_operator_broadcasting_from.json": "... --- ...\n\nGreetings! This message is coming to you over the airwaves from a secret\nlocation in Nazi-occupied Paris. I can't stay broadcasting for too long before\nthe Gestapo track me down, so get your questions in before I have to go off air\nand hide.\n\nedit: I will decode these at the end of…",
  "data/reddit-ask/r/NoStupidQuestions/comments/ttstre/why_does_every_website_now_have_massive_annoying.json": "I hate companies tracking my activities as much as the next guy but why do\nwebsites have to be so obnoxious about notifying us that they're tracking us?\nSeems excessive and pointless.",
  "data/reddit-ask/r/NoStupidQuestions/comments/tthk65/crotch_staring.json": "I just have this automatic habit of looking crotch area on men . In a split\nsecond , I just look down there and sometimes I get caught doing it and I don’t\nknow why I do it ?! It’s automatic, I don’t even realize I’m doing it most of\nthe time. Anyone else ? Why ?",
  "data/reddit-ask/r/NoStupidQuestions/comments/ttxi72/how_can_i_see_who_voted_no_on_the_insulin_bill.json": "I live in Arkansas and completely believe that our representatives voted no for\nthis bill, but I want to make sure before I go writing letters to every level of\nmy government up to my governor.",
  "data/reddit-ask/r/NoStupidQuestions/comments/ttvdqa/when_i_say_im_deaf_whats_the_first_thing_that.json": "First question, not first thing, sorry, can’t edit title. Doing this for a\nschool assignment. Feel free to ask questions (I am deaf)",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ttyxzs/how_can_smallboobed_girls_gain_confidence.json": "I’m insecure about my small boobs and always have been. I’m a B-cup and I’ve\nlooked into implants and fat transfers for awhile. That being said, this\ninsecurity makes me hesitant to take off my shirt when my bf and I have sex. I\nreally try to avoid it as much as possible honestly. I told my bf…",
  "data/reddit-ask/r/AskHistorians/comments/ttw68k/i_am_henry_curtmantle_king_of_england_duke_of.json": "I am Henry, by the grace of God, King of England, Duke of Normandy and\nAquitaine, Count of Anjou and Maine. Son of Empress Matilda, and Geoffrey\nPlantagenet, Count of Anjou.\n\nIn light of my connection with the murder of Archbishop Thomas Becket, my former\nchancellor and friend, and the recent…",
  "data/reddit-ask/r/askscience/comments/tu24t5/would_the_insulin_of_the_1920s_be_acceptable_for.json": "In the 1920s, insulin co-inventors James Collip and Charles Best sold the rights\nto the University of Toronto. Since that time I believe the formulations of\ninsulin and its manufacturing method have changed quite a bit. My question: If\nyou were able to transport the insulin from the 1920s to…",
  "data/reddit-ask/r/askscience/comments/tty6fr/not_sure_if_this_is_exactly_a_science_question.json": "I’m talking about records detailing what we now know could’ve been significant\nradioactive sources or radioactivity-related injuries, any time between the\nfirst written record up until the first industrial revolution.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/tu5vz5/for_guys_if_i_a_female_were_to_walk_up_to_you_on.json": "For context, I live in a not-so-great city but have to walk home at night all\nthe time, and sometimes I don’t feel safe. I want to go up to an unassuming guy\nand do the whole “oh my god Matt there you are, I’ve been looking all over for\nyou!” but I feel that a guy would either not get it or I’d be…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/tu3f2c/is_cereal_for_dinner_an_acceptable_meal_for_an.json": "My roommate thinks that adults should not eat cereal with the slim exception of\neating it for breakfast. I’m definitely going to eat cereal whenever/wherever I\nwant regardless of what anyone thinks, just wanted to know y’all’s thoughts on\nit.\n\nEdit - Clarification: not sure how much it matters but…",
  "data/reddit-ask/r/NoStupidQuestions/comments/tu50kb/do_other_guys_actually_enjoy_watching_a_girl_blow.json": "I consider myself an average male with average taste in porn, but for the life\nof me I can’t figure out who thought it was hot when a girl sucks on a toy as if\nit’s a real dick. Are there guys out there that enjoy watching these scenes?\nIt’s sort of a mood killer for me because all I can think…",
  "data/reddit-ask/r/NoStupidQuestions/comments/tu9b41/what_would_you_call_a_chocolate_chip_cookie.json": "They are technically not sugar cookies, as those have different amount of flour\nand use only white sugar, while chocolate chip cookie recipes call for both\nwhite and brown. Dough cookie maybe?",
  "data/reddit-ask/r/AskHistorians/comments/tu10hl/i_am_harry_truman_failed_haberdasher_piano_player.json": "It does my heart good to be here. Best get all your questions in before I strike\na blow for liberty this afternoon, though, although I may come back and answer\nwhat I can later.\n\nI'm joined by my press secretary, /u/therealcharlieross, who often advises me to\nsay 'no comment' among other…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ttqs5r/why_do_people_smoke_cigarettes.json": "I mean it is not like weeds or drugs , it doesn't drug you or make you feel good\n? Am i missing something ?",
  "data/reddit-ask/r/AskHistorians/comments/tug62y/what_is_the_basis_for_the_stereotypical_cartoon.json": "Just about every animated depiction of a bomb that I’ve ever seen is the same -\na black sphere with a fuse sticking out of it, like this.\n[https://cdn4.vectorstock.com/i/1000x1000/12/73/a-classic-cartoon-style-black-round-bomb-lit-vector-20631273.jpg]\nIs that based on any actual explosives that…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/tui3nr/is_not_having_enough_sex_a_good_enough_reason_to.json": "This recently happened to a buddy of mine.\n\nThey were together for about 2 years, and after countless of efforts from his\nside to talk about the lack of sex in their relationship (and things not\nchanging) he decided to break up with her.\n\nNow everyone thinks he's the bad guy, because everything…",
  "data/reddit-ask/r/NoStupidQuestions/comments/tuaof9/what_does_it_mean_that_will_smith_resigned_from.json": "Like are his movies no longer able to be nominated? Can he no longer attend the\nOscar's? Did he previously have a vote on something that he doesn't now?",
  "data/reddit-ask/r/NoStupidQuestions/comments/tuh5x3/why_arent_you_required_to_retake_your_driving.json": "Cant think of any other licence where you're operating machinery that doesnt\nrequire regular renewal.",
  "data/reddit-ask/r/NoStupidQuestions/comments/tuiclq/why_is_platonic_marriage_not_a_thing.json": "hear me out. let’s take marriage for what it essentially is- a legal and\nfinancial binding. By no means does marriage heighten or deepen a romantic\nconnection.. therefore it makes me think- someone you have a bond with and\nestablished deep trust for that can support a life you both want is someone…",
  "data/reddit-ask/r/NoStupidQuestions/comments/tuj2op/my_girl_is_dogsitting_at_someones_house_for_a.json": "The clients are an older couple, I'm guessing the guy signed into his google\n(edit seems to be amazon) account from 2007 and it's connected. My first thought\nwas to report it but that's either really ruining someone's life (if he's not\nactually a pedo) or If they determine there's nothing they can…",
  "data/reddit-ask/r/AskWomen/comments/tugpqc/whats_a_big_mood_killer_something_that_really.json": "EDIT: thanks for the replies!",
  "data/reddit-ask/r/NoStupidQuestions/comments/tuvdeu/your_telling_me_that_there_are_billions_of_stars.json": "I can’t even comprehend how big the universe is. And that’s just the observable\nuniverse….",
  "data/reddit-ask/r/NoStupidQuestions/comments/tuxk46/who_actually_feels_that_money_would_solve_all_of.json": "I feel like I would pay for the top notch medical care",
  "data/reddit-ask/r/TooAfraidToAsk/comments/tuyrn9/why_do_so_many_men_simply_dont_give_women_oral.json": "Do they not know what the heck they are all doing or Seriously, this is one of\nthe most frequently talked about things in sex threads on female related\nsubreddits. It also seems to be an experience that my IRL female friends very\nmuch share: dudes just stick it in your mouth, then your vagina, then…",
  "data/reddit-ask/r/AskHistorians/comments/tusp1l/did_welldigging_technology_improve_or_change_in.json": "I know the question is very general. I am interested in any technological\nimprovements to water wells. Regardless of place or general time.",
  "data/reddit-ask/r/NoStupidQuestions/comments/tuzh35/did_anyone_else_used_to_think_ftw_meant_fuck_the.json": "I thought it was the inverse of WTF, and I thought it was just a phrase you said\nwhen something good happened. Like, \"hell yeah man, fuck the what.\" Did anyone\nelse think this? I think some other kids used it like that growing up, so I feel\nlike I might not be the only one.",
  "data/reddit-ask/r/NoStupidQuestions/comments/tuya8r/any_dudes_out_there_get_easily_teary_eyed_during.json": "I remember I once got teary eyed during Nacho Libre of all films when he got\nkicked out the orphanage but he walked away with his head high because he knew\nhis path was righteous. Fuck getting teary just thinking about it now lol.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/tv1hgb/anyone_get_sad_when_no_one_asks_about_a_bandaid.json": "I got a lil cut on my finger and put a bandaid on it. My lady and mom didn’t\nnotice. I waited for them to notice. Maybe they did. I’m a grown man but it\nstill bothers me on a superficial level 🤷",
  "data/reddit-ask/r/AskWomen/comments/tv08u9/women_what_is_something_you_have_stopped_buying.json": "What is something you have decided to stop buying for whatever reason?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/tv4tw0/how_do_i_tell_my_bf_this_news.json": "My bf told me from the very beginning that we will always be living with his mom\nor she will always be living with us. (I was only 18 and She’s an entitled\nnarcissist who thinks she can’t live without her son) I don’t want to live with\nthis woman. I can’t think of anything unhappier than that,…",
  "data/reddit-ask/r/AskHistorians/comments/tutd5b/how_do_contemporary_academics_who_say_that_race.json": "In the ancient world, there seem to be numerous examples of writers and artists\nacknowledging that groups of humans have shared physical and cultural\ncharacteristics and labeling them with specific group names, in some cases\nstereotyping them negatively. How does this differ from what we now call…",
  "data/reddit-ask/r/AskHistorians/comments/tv5p6z/the_catholic_church_held_all_its_rites_in_latin.json": "The Catholic Church held all its rites (including the Mass) in Latin until\nSecond Vatican Council (1962-65), and prohibited translations of the Bible until\nquite late. Was it an intentional obscurantism to not let the believers\nunderstand the Bible and liturgy (so that the Church could manipuate…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/tv3i6d/why_is_our_society_built_in_a_way_that_we_have_to.json": "If life is so precious and we should take advantage of everyday we have, why is\nit that our “normal” is to have to work so hard for things we should already\nhave. I think the way our society is built makes it too stressful to be able to\ntake advantage of how lucky we are to be alive, and instead…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/tv7dhn/if_you_spank_someones_ass_really_hard_and_they.json": "The skin can’t heal itself if you’re dead, right?\n\nEdit: I don’t mean they die from the spanking, if they die from something\nunrelated.",
  "data/reddit-ask/r/AskHistorians/comments/tv8rh8/the_popular_sea_shanty_what_shall_we_do_with_a.json": "I'm thinking about women in particular here, since I imagine it must have been a\nvery male-dominated environment. Did they face a lot of harassment? Also, was\nsocializing with the crew permitted? And if not, what did they do for fun?"
}