{
  "data/reddit-projects/r/SideProject/comments/vonapd/ukrainian_developers_reaching_out.json": "Hey, redditors of the world!\n\nDue to the war in Ukraine thousands of developers have lost their jobs. I with\nmy fellow coworkers from Ukraine have created a community of more than 1200 mid\nto senior level developers (DeFi, web-dev, ML, etc.). We are actively engaged in\nsupporting our citizens and…",
  "data/reddit-projects/r/SideProject/comments/vosz6b/i_interviewed_30_microstartup_founders_ama.json": "Hi SideProject\n\nI just recently interviewed 30 founders who are building their startups (or as I\ncall them: microstartups) as solo developers. I covered these four questions:\n\n- How did you come up with the microstartup idea?\n- How did you find your first customers?\n- How are you finding your…",
  "data/reddit-projects/r/SideProject/comments/vp0ptf/just_launched_my_first_product_on_product_hunt.json": "Hey everyone! It’s been a long journey building AVID to date. Luckily I have an\namazing team to have overcome all the challenges together! Our mission is to\nenable effective knowledge transfer.\n\nLooking at my own experience, I wouldn’t be who I am today if it wasn’t for\naudio learning - back then…",
  "data/reddit-projects/r/SideProject/comments/vpk9vr/how_react_events_are_different_from_javascript.json": "Recently I was asked about this question in an interview and didn't have enough\nknowledge to explain it in depth. After some research I finally understood the\ndifference between react events and JavaScript addeventlisteners and when to use\neach of them based on the use case scenario in react. Its…",
  "data/reddit-projects/r/SideProject/comments/vpo0ey/i_build_an_app_for_asking_and_answering_questions.json": "Hello guys, first time here 😄\n\nSo i build this web app called Qwestions (is hosted here\n[https://qwestions.vercel.app/]), which i describe it as \"an headless\napplication for asking and answering questions of all kinds\". Quite similar to\nReddit.\n\nBasically you can explore Trendings, Popular or…",
  "data/reddit-projects/r/SideProject/comments/vpu2p5/i_got_tired_of_spending_80_on_gas_so_i_built_my.json": "No idea why Google Maps doesn't already have this feature.\n\nI made a chrome extension that takes my multi-stop route on Google Maps and\nrearranges it to give the fastest, most optimal route. It basically tells me\nwhat stops I should go to in what order to ensure that I’m spending the least\namount…",
  "data/reddit-projects/r/SideProject/comments/vqai5p/i_built_a_job_offer_comparison_toolvisualizer.json": "I'm a new grad and recently was recently comparing job offers out of college. I\nhad offers from different companies in different locations and wanted an easy,\nvisual way of comparing offers adjusted by taxes and cost of living. So, I made\nhttps://budget-estimator.vercel.app/ to do just that.\n\nJust…",
  "data/reddit-projects/r/SideProject/comments/vqerd1/i_built_a_chrome_extension_that_summarizes.json": "Hey guys! 👋🏽\n\nSo I've always been pretty lazy. Some months ago, I was working on a pretty\nboring report that consisted mainly of summarizing articles. As a good hacker, I\nrealized that I could automate it. So I made a very simple script using GPT-3 to\nsummarize texts. It worked well. Actually,…",
  "data/reddit-projects/r/SideProject/comments/vq2tgf/the_worlds_first_placebased_social_media_app.json": "The world's first place-based social media app\n\n 1. Create polygon geofences\n 2. Post content within them\n\nConnect with the world like never before.\n\nhttps://play.google.com/store/apps/details?id=com.places.android\n\nUpdate:\n\nMy end goal is to provide users with statistics about every city in the…",
  "data/reddit-projects/r/SideProject/comments/vqd4pe/my_side_project_devobserver_app_for_each_developer.json": "I’ve been working on DevObserver [https://devobserver.com] for a while. Its an\napp where anyone can stay tuned with the latest programming news. Currently it\nis available for iOS [https://apps.apple.com/hu/app/devobserver/id1575198748]\nand as Chrome…",
  "data/reddit-projects/r/SideProject/comments/vr35a4/my_little_side_project_a_browser_extension_that.json": "Hello everyone!\n\nI am posting this post to demonstrate this tool that can export various Discord\nchats. The link to it on the google store is here:\n\nDiscordmate - Discord Chat Exporter\n[https://chrome.google.com/webstore/detail/discordmate-discord-chat/ofjlibelpafmdhigfgggickpejfomamk]\n\nI actually…",
  "data/reddit-projects/r/SideProject/comments/vr59lp/how_our_b2b_startup_got_240_paying_customers_in_3.json": "The times when it was possible to create a useful service, wait for people to\nfind it themselves and start using it, are long gone. Now companies spend a lot\nof effort, time, and money on finding new customers, engaging them, and\ncollecting feedback.\n\nI want to share the story of how we came up…",
  "data/reddit-projects/r/SideProject/comments/vrsltq/how_we_built_an_effective_project_management.json": "I’m Alex, the founder of Krock.io.\n\nYears ago, I founded an animation studio that creates various types of content\nfor many clients worldwide. And I definitely know that every creative project\nmust accomplish the specific goal set by the client. ☝️ It's not just about\ncommercial video making. We…",
  "data/reddit-projects/r/SideProject/comments/vsmfnw/bookmark_an_web_article_and_listen_to_them_later.json": "Hey guys,\n\nI drive to work a lot, spending on average of 2 hours each day. So I have plenty\nof time to listen to Podcast and audiobook on my ride. And I think it would be\nnice to be able to do the same with my reading list, but I couldn't find any\ndecent app on the market that doing this. So I set…",
  "data/reddit-projects/r/SideProject/comments/vsflg5/internshipnew_grad_search_guide.json": "Hello,\n\nI have found many resources that have improved my search for internships and new\ngrad opportunities and decided to combine them into a single guide for any and\nall to use.\n\nI have published this guide here:\nhttps://github.com/TStansel/Internship_and_NewGrad_SearchGuide\n\nPlease feel more…",
  "data/reddit-projects/r/SideProject/comments/vsuob5/we_built_a_tiktoktinder_for_finding_gifts_or.json": "Hey makers, founders and people who thinks that shopping gifts for our loved\nones REALLY sucks. Yes, we love them, but we hate the process - the time, the\nhassle and the stress.\n\nMy co-founder, Cole, and I found buying a gift today hard because:\n\n * It’s hard to find unique gifts that’s…",
  "data/reddit-projects/r/SideProject/comments/vte3rz/i_made_little_etf_funds_screener.json": "Hi r/SideProject [/r/SideProject]! I made a site that lets Europeans find and\ncompare ETF funds easily:\nPH 🚀: https://www.producthunt.com/posts/greatetf\nSite 🌐: https://greatetf.com/funds/"
}