{
  "data/reddit-know/r/YouShouldKnow/comments/r513bd/ysk_that_revolut_shares_your_private_data_by.json": "In case you‘re using Revolut, I recommend you to take a look at the app‘s\nprivacy settings. The third point under the „marketing“ section allows them to\nshare data such as „name, email address and app events with social m*dia and\nadvertising platforms“, and the toggle is turned on by default.\n\nWhy…",
  "data/reddit-know/r/YouShouldKnow/comments/r5ooh7/ysk_houseplants_go_dormant_in_winter_so_reduce.json": "Why YSK: As the cold weather slows down their metabolic rate, plants will\nrequire water less frequently than in the summer. It is important to not\noverwater your houseplants as they can grow mold, mildew, or be susceptible to\nfungus and other diseases with excessive water.\n\nA good rule of thumb is…",
  "data/reddit-know/r/YouShouldKnow/comments/r5rb87/ysk_wary_weary_leery_are_all_different_words.json": "Why YSK, wary and leery both mean \"cautious about a potential problem\". Weary\nmeans \"tired\".\n\nOver and over you see people say they are \"weary\" of a problem, that's because\nthey are conflating wary and leery, two words that means roughly the same thing,\nbut combining those words leaves you with…",
  "data/reddit-know/r/YouShouldKnow/comments/r5spih/ysk_as_weather_gets_colder_it_is_absolutely_vital.json": "Why YSK:\n\nThe smallest amount of antifreeze can kill cats, and kill them horribly. Signs\ncan show within 30 minutes of ingestion; they begin to stumble like they are\ndrunk, start to find breathing difficult. They vomit, they can have seizures.\nFinally, their kidneys give out. It is absolutely…",
  "data/reddit-know/r/YouShouldKnow/comments/r63i5k/ysk_there_is_an_extension_that_lets_you_see_the.json": "Not sure about the policy of linking directly to things, but if you just google:\n\"Return Youtube Dislike\" you can find the right extension. It works for Chrome\nand Firefox.\n\nWhy YSK: apparently I have to explain why youtube dislike counts are important.\nWell it's helpful when you're trying to sniff…",
  "data/reddit-know/r/YouShouldKnow/comments/r69hrq/ysk_scihub_is_a_free_recourse_to_get_access_to.json": "Why YSK: So many journal articles in science specifically are locked behind\nextreme paywalls, especially recently published papers with exciting\ninformation. I've seen paywalls that range from $50-$200 just to get access to\none article. SciHub was founded by a Kazakhstan woman, Alexandra Elbakyan,…",
  "data/reddit-know/r/YouShouldKnow/comments/r6bw6t/ysk_that_taking_a_deep_breath_to_calm_down_works.json": "Why YSK: If you’re trying to calm down, especially during a panic attack,\ndiaphragmatic or belly breathing is what will help you relax. Thoracic or chest\nbreathing is better for physical exertion and may actually make you more tense.\n(Source: Mayo Clinic)\n[https://www.mayoclinic.org/healthy…",
  "data/reddit-know/r/YouShouldKnow/comments/r6h98n/ysk_that_browsers_have_limitations_when_it_comes.json": "Why YSK: Especially if you're subscribed to a high-quality streaming plan, you\nshould consider your go-to browser (at least for your streams). Otherwise you\nbasically have zero benefits from the extra money you're paying if you're not\njust out for the multiple profiles in order to split the…",
  "data/reddit-know/r/YouShouldKnow/comments/r6q20e/ysk_that_6_inflation_in_2021_to_2_inflation_in.json": "Why YSK: make sure that your yearly salary increase is at least that of\ninflation. Otherwise, it’s a pay cut.\n\nInflation is often shown as year over year percentage change. Do not be fooled\nby the government when the inflation is “transitioned” into 2% the following\nyear.\n\nFor example, an item that…",
  "data/reddit-know/r/YouShouldKnow/comments/r6su7n/ysk_the_buildup_of_black_soot_on_the_bottom_of.json": "Why YSK: Carbon monoxide (CO) is known as the \"silent killer\" for a reason. It's\nodourless and colourless, so it's very hard to detect. For this reason, it's\nalways a good idea to ensure your fire detector/smoke alarm also has CO\ndetection (most of the newer fire detectors come standard with this…",
  "data/reddit-know/r/YouShouldKnow/comments/r76qnq/ysk_a_team_of_researchers_are_using_a.json": "Why YSK: We’re beginning to realise the importance of self-care and investing in\nour mental wellness early enough, instead of reaching for treatment when things\nhave already gone awry. While professional help is probably always the best\noption (if you can afford it), technology can surely play a…",
  "data/reddit-know/r/YouShouldKnow/comments/r7f7wm/ysk_that_you_should_always_ask_before_introducing.json": "Why ysk: even dogs with good owners can be aggressive or in bad moods. Many dogs\nare rescued from bad situations or had unfortunate experience that cause them to\neither not like new people or other dogs.\n\nThese dogs still have every right to be walked around as long as the owner is\nconscious and…",
  "data/reddit-know/r/YouShouldKnow/comments/r7p2js/ysk_that_button_batteries_the_batteries_that_look.json": "Why YSK: children find these batteries and swallow them. We especially see these\nbatteries around the holidays as they are in decorations, cards, toys and all\nsorts of other things. I work as a nurse and have seen several children need to\nbe tube fed for the rest of their lives and/or have…",
  "data/reddit-know/r/YouShouldKnow/comments/r7tija/ysk_when_you_buy_digital_media_online_you_dont.json": "Why YSK: just because you \"buy\" something digitally, doesn't mean the same when\nyou physically buy something. you are buying ACCESS to the content. don't be\nsurprised if the company revokes access.\n\nA user lost access to his movies in apple's…",
  "data/reddit-know/r/YouShouldKnow/comments/r7xqkx/ysk_starting_a_workout_regimen_requires_more.json": "Why YSK: This popular New Years resolution is just around the corner. Too much\nfocus is put on the workout itself without addressing the real problem of why so\nmany start and then quit. Everyone struggles, but some have sourced the key, the\nright mental gymnastics to continue the regimen despite…",
  "data/reddit-know/r/YouShouldKnow/comments/r81h2u/ysk_if_you_have_a_careerbuilder_account_even_if.json": "I started getting emails thanking me for my application to jobs I don’t want and\nam not qualified for recently. One of the recruiters was kind enough to respond\nto my follow up and informed me:\n\n> Thank you for Emailing me about this. I received an application through Career\n> Builder for a Truck…",
  "data/reddit-know/r/YouShouldKnow/comments/r83u0x/ysk_when_frustrated_with_a_company_instead_of.json": "Why YSK: Customer Service Representatives (CSRs) have an unbelievably difficult\njob. Framing your frustration as being the fault of the company, and not the CSR\npersonally is not only the kind thing to do, it also increases the odds that the\nrep will go above and beyond to help you since you are…",
  "data/reddit-know/r/YouShouldKnow/comments/r85o02/ysk_driving_slow_isnt_always_the_same_as_driving.json": "Why YSK: there are a lot of situations where driving fast is safer than driving\nslow.\n\nFor example if you're passing something, especially something like a truck with\nhigh winds, it's safest to pass it as quickly as possible. I always use the rule\nof thumb that passing should take 10 seconds…",
  "data/reddit-know/r/YouShouldKnow/comments/r85t6g/ysk_theres_a_free_and_easy_way_to_automate.json": "Why YSK: Nearly every office I've ever been in has done so many boring,\nrepetitive things by hand. Spending just a couple of days learning the basics of\na scripting language like Python can cut hours of tedious work out of your\nroutine. Computers are really good at monotonous things, so if there's…",
  "data/reddit-know/r/YouShouldKnow/comments/r85ye9/ysk_tortillas_are_not_fully_cooked_yet.json": "TL;DR: Tortillas fresh out of a bag/package are not fully cooked. Heating them\non a hot non-stick, flattop, plancha, or well seasoned cast iron pan for 30\nseconds to a minute on each side until light browning and warm/hot is essential\nfor enjoying the tortillas. Store in a clean folded towel or…",
  "data/reddit-know/r/YouShouldKnow/comments/r8bg42/ysk_the_artificial_sweetener_xylitol_found_in.json": "Why YSK: with the obesity epidemic and Keto craze happening in the US, Xylitol\nuse has been on the rise, significantly. It is safe for humans (but will cause\ndiarrhea in large amounts) but CAN kill your dog very quickly unless taken to\nthe vet IMMEDIATELY. When 5mg per 1lb of body weight is…",
  "data/reddit-know/r/YouShouldKnow/comments/r8dg01/ysk_dating_files_using_yyyymmdd_format_will_keep.json": "Why YSK: This is especially useful when you need to save multiple versions of a\nfile over time and can quickly reference the date from the file name instead of\n“date modified” or “date created”. For example, if I save a file today, I would\nname it “Example Text 20211203”. If I needed to save a new…",
  "data/reddit-know/r/YouShouldKnow/comments/r8f5fq/ysk_most_dish_soaps_like_dawn_are_designed_to_be.json": "Why YSK: Some soap companies are changing their formula because so many people\nwash dishes now one by one, by putting dish soap on the sponge and then\nscrubbing with running water, rather than filling the sink. If you don’t have a\n2 part sink, it makes it harder to wash by hand (maybe consider…",
  "data/reddit-know/r/YouShouldKnow/comments/r8qwut/ysk_some_hospitals_in_the_usa_will_offer.json": "Why YSK: Healthcare in the USA can be very unaffordable and has the potential to\nfinancially ruin people. Not many people are aware that some hospitals will\noffer discounts to your bill. You MUST ASK for these discounts, they aren't\nhanded out like candy. Some discounts may be applied simply…",
  "data/reddit-know/r/YouShouldKnow/comments/r8wdhg/ysk_most_corporations_and_isps_track_you_through.json": "Why YSK: DNS servers are required for anyone to connect to the internet.\nCorporations and ISPs like to track you as much as humanly possible within the\nlaw. They do this mostly through the DNS servers they automatically configure\nyour devices to use. By switching to an encrypted dns server with…",
  "data/reddit-know/r/YouShouldKnow/comments/r911j3/ysk_teach_children_how_to_be_around_dogs_safely.json": "Why YSK: as a caregiver it is incredibly important to keep children safe. If you\nwant to have a dog in your family it is important to teach kids how to interact\nwith dogs safely.\n\nEDIT: Yes! People should train their dogs! But also it’s really important kids\nare taught certain elements of how to…",
  "data/reddit-know/r/YouShouldKnow/comments/r91xer/ysk_ceiling_fans_have_a_winter_setting.json": "Why YSK: Most ceiling fans are capable of warming a room which is\ncounterintuitive. On a lot a fans there's a switch somewhere on the side that\ncan be either up or down, flipping this switch will switch the blades rotation\nso instead of blowing air down, it sucks air up (so having some space…",
  "data/reddit-know/r/YouShouldKnow/comments/r92nwx/ysk_afrin_can_cause_a_serious_medical_condition.json": "Why YSK: \"While it’s not considered an 'addiction' in the usual sense, your body\ncan become dependent on the drug. Doctors call this phenomenon 'rebound\ncongestion,' or rhinitis medicamentosa\n[https://www.jacionline.org/article/S0091-6749(06]01370-4/fulltext), and it is a\nvery real problem. In…",
  "data/reddit-know/r/YouShouldKnow/comments/r9ef6v/ysk_bleach_expires_and_becomes_almost_useless.json": "Why YSK: Bleach degrades over time into its constituent parts. It doesn't become\nmore dangerous but it will absolutely lose its potency, thus limiting it's\ncleaning capabilities. If you're having a hard time getting bleach to work as\nyou'd expect, think back to how long ago you bought it, as it…",
  "data/reddit-know/r/YouShouldKnow/comments/r9lzqz/ysk_there_is_an_app_called_be_my_eyes_that_allows.json": "Why YSK: The app is free to download and you can sign up as a volunteer or a\nvisually impaired / blind person. If you need visual help (examples given are\npicking the right colour of an item of clothing, or the right brand of product\nwhen shopping) and you are visually impaired, you press a button…",
  "data/reddit-know/r/YouShouldKnow/comments/r9tj6r/ysk_you_should_regularly_pour_white_vinegar_into.json": "Why YSK: Tap water, which is used to fill a toilet's water tank, can contain a\nlot of calcium hardness in it. If left unchecked, over time, calcareous buildups\nwill form pretty much everywhere in the toilet's flushing system, which will\ndamage the gaskets and other components in it.\n\nThis also goes…",
  "data/reddit-know/r/YouShouldKnow/comments/rabskj/ysk_cut_nails_straight_across_to_prevent_ingrown.json": "Why YSK: Improper nail trimming is 1 cause of ingrown nails.\n\nHere's an example of how to cut them\n[https://puretherapyclinic.files.wordpress.com/2017/01/infection-after-ingrown-toenail-1.png]\n\nCauses:\n\nThe etiology of ingrown toenails includes direct trauma to the toe that forces\nthe nail corners…",
  "data/reddit-know/r/YouShouldKnow/comments/rad2oo/ysk_when_planning_a_trip_to_see_a_national.json": "Why YSK: Planning a trip to another state can be daunting. All national forests\nand parks are operated by one of the forest/park services. All of these services\nhave sites with contact forms. The rangers are like librarians but for the land.\n\nThey have all been in the area for a long time and are…",
  "data/reddit-know/r/YouShouldKnow/comments/raizy7/ysk_the_govrun_unclaimed_property_program_holds.json": "Why YSK: it's free, it's legit, and it's your money\n\nThis program exists in the US, Canada, and UK AT LEAST, so while I'm talking\nabout the US, your country probably has one too\n\nLet's say 8 years ago you quit a job. Later, that business discovered you were\nowed $50 in overtime. Legally, they have…",
  "data/reddit-know/r/YouShouldKnow/comments/rajzla/ysk_how_to_tell_the_difference_between_tension.json": "Why YSK: There is a HUGE difference between migraines and tension headaches.\nTension headaches are the most common type of headache though most people\nunknowingly refer to them and treat them as migraines.\n\nMigraines are a neurological problem and tension headaches are more of a\nmuscular problem.…",
  "data/reddit-know/r/YouShouldKnow/comments/rak6pw/ysk_there_is_a_browser_extension_that_integrates.json": "Why YSK: Because it makes for happier browsing knowing full well you can show\nyour potential disdain for certain content.",
  "data/reddit-know/r/YouShouldKnow/comments/rap5y5/ysk_wash_your_new_clothes_before_wearing_them.json": "Why YSK: Many textiles are treated with chemicals including formaldehyde resins\nto prevent mildew and mold growth on clothes during transport as well as dye\nfixatives, fire retardant and antibacterial treatments, and treatments to\nprevent wrinkling and shrinkage.\n\nYou may be able to smell it on…",
  "data/reddit-know/r/YouShouldKnow/comments/raro9d/ysk_if_your_car_is_totaled_tell_your_insurance.json": "Why YSK:\n\n1.) Insurance will ALWAYS try to offer low first, sometimes leaving you with a\nbalance owed on your old vehicle loan or leaving you unable to replace your\nvehicle with a vehicle of similar value.\n\n2.) They may also try to force you to repair a vehicle which is so damaged that\nit will be…",
  "data/reddit-know/r/YouShouldKnow/comments/rb1s93/ysk_that_in_the_us_you_can_check_if_an.json": "Why YSK: especially this time of year, there are plenty of companies that try to\npretend that they are charities when they are actually for profit companies. The\nIRS keeps a full database open to the public online here\n[https://apps.irs.gov/app/eos/] where you can simply search for an…",
  "data/reddit-know/r/YouShouldKnow/comments/rb853o/ysk_you_can_compost_all_food_soiled_paper_and.json": "Why YSK: organic materials that end up in the landfill can be recycled back into\nthe natural systems from whence that came, making the production and use more\nsustainable. This includes tissue, toilet paper, paper towels, pizza boxes, and\nother to go containers; as long as there is no metal or…",
  "data/reddit-know/r/YouShouldKnow/comments/rbhh2k/ysk_you_want_to_get_your_life_disability_and.json": "YSK: Life, disability, and long-term care insurance providers can discriminate\nbased on genetic testing results. Health insurance providers can't.\n\nWhy YSK: Health insurers are forbidden to discriminate on the basis of genetics.\nOther insurers--like life, disability, and long-term care--aren't. So…",
  "data/reddit-know/r/YouShouldKnow/comments/rbirw6/ysk_you_can_easily_remove_all_the_clutter_ads.json": "Why YSK: It can get frustrating skimming through text walls just to find the\nrecipe on blogs/sites. Authors do it to get high ranking on Google.\n\nYou can use OnlyRecipe.app [https://OnlyRecipe.app] to extract the recipe\ninformation. It works on almost all sites/blogs which follow a recipe…",
  "data/reddit-know/r/YouShouldKnow/comments/rbks00/ysk_japan_does_not_have_fair_use_laws.json": "Why YSK: Recenty I've seen a few statements about youtubers/influencers who are\nconstantly being claimed on their videos or facing legal threats by Japanese\ncompanies for reviewing Japanese content (mostly anime). This is because even\nthough in Youtubes guide lines of fair use, what they post is…",
  "data/reddit-know/r/YouShouldKnow/comments/rbpvot/ysk_you_can_see_and_use_youtube_with_dislikes.json": "Why YSK: It's been around for a long time and they just updated it to show the\ndislikes again... https://i.imgur.com/oKBujCE.png\n\nUse this with SponsorBlock and you can watch without ads or self-promotion ads,\netc.\n\nI am not affiliated with anyone whatsoever, but after seeing how people are\nstill…",
  "data/reddit-know/r/YouShouldKnow/comments/rbry7i/ysk_dont_leave_your_hard_drive_or_ssd_in_your.json": "Why YSK: These companies may make backups and maybe not store them properly.\nData is valuable and you don't want it to be everywhere. Don't keep your data\nsomewhere unprotected!\n\nRemoving your hard drive or SSD is not hard for most laptops, it will only take\na few minutes once you know how to do it…",
  "data/reddit-know/r/YouShouldKnow/comments/rbvhey/ysk_apply_antiperspirant_at_night.json": "Why YSK: As a formerly super sweaty teenager with hyperhidrosis learning this\nwas a game changer. Anti-perspirant has to absorb into your skin to work and if\nyou apply it directly after a shower while still wet; or in the morning and\nsweat it out it will not work (and just stain your…",
  "data/reddit-know/r/YouShouldKnow/comments/rc7j7b/ysk_that_workers_all_over_the_us_are_showing_an.json": "Why YSK: Class consciousness is growing rapidly among the American workforce for\nthe past few years. The best way to contribute to this momentum is to be a\nconscientious consumer and be selective in one's purchases. Many consumers\nforget that they have this very effective tool in their arsenal…",
  "data/reddit-know/r/YouShouldKnow/comments/rcc2xf/ysk_the_black_highlighter_feature_on_phones_is.json": "Why YSK: if you share something that has personal information, and think that\nyou blacked out the personal information, you could accidentally be revealing\nthat information to strangers. I know from experience that something 'blacked\nout' can look jet black on the phone screen without that being…",
  "data/reddit-know/r/YouShouldKnow/comments/rciits/ysk_if_youre_job_hunting_despite_the_widespread.json": "Why YSK: I worked for several years helping companies with their recruitment\nefforts and 1, companies do use systems (ATS) to automatically filter out\nnon-relevant posts and, 2, when they do get to the human, one of the biggest\nthings they look for, beyond your personal work and educational…",
  "data/reddit-know/r/YouShouldKnow/comments/rcjbsp/ysk_half_of_speaking_a_foreign_language_is.json": "Why YSK: Because traveling and speaking a foreign language, beyond rudimentary\nfluency without a thick accent, is difficult. Native speakers can understand\nforeigners much easier if a phrase uses the familiar lilt/melody/rhythm, which\nrequires muscle memory of tongue placement and mouth…",
  "data/reddit-know/r/YouShouldKnow/comments/rcmrzm/ysk_you_are_getting_a_paycut.json": "Probably only unpopular among employers, but you should know that the inflation\nrate is around 6% and probably much higher for most of us, so if you are not\nreceiving a raise this year for at least 6% you are getting a pay-cut. You\nshould ask your employer to explain to you why they think you are…",
  "data/reddit-know/r/YouShouldKnow/comments/rcp9gv/ysk_offbrand_cereals_are_identical_to_name_brand.json": "Why YSK\n\nWhen considering paying $0.27 per serving vs $0.14 per serving, you should know\nthat there is very little difference (if any) between most brands and their\noff-brand, and often times the difference is that the \"off-brand\" retains the\nbetter tasting original recipe vs the name brand Cereals…",
  "data/reddit-know/r/YouShouldKnow/comments/rcw7ap/ysk_that_your_teeth_and_gums_are_linked_directly.json": "Why YSK: While dental health is very important in general, one reason that often\ngets overlooked is that your teeth and gums are directly linked to your heart,\nand poor dental hygiene can potentially lead to heart problems if left\nunattended.\n\nSome of those can include:\n\n * Gum disease, which can…",
  "data/reddit-know/r/YouShouldKnow/comments/rd9rfs/ysk_that_brands_you_may_consider_as_alternatives.json": "Why YSK: Kellogg's owns several subsidiaries and brands. For instance, you may\nthink buying Kashi cereals instead of Kellogg's would hurt Kellogg's; however,\nKashi is a subsidiary of Kellogg's. The same is true of RXBar, Morningstar, Bear\nNaked, Natural Touch, Cheez-It, Gardenburger, Eggo, Special…",
  "data/reddit-know/r/YouShouldKnow/comments/rdaz50/ysk_ublock_and_other_adblocks_in_chrome_will_lose.json": "Why YSK: Your privacy, data usage, and browsing experience will be affected. If\nyou haven't already, invest in a pihole or switch to a non-chromium browser",
  "data/reddit-know/r/YouShouldKnow/comments/rddev0/ysk_if_your_turn_signals_blink_quickly_either_the.json": "Why YSK: Manufacturers set their flasher relays to blink quickly when there is\nless resistance, such as when a bulb burns out. Many people think there is a\nshort or an electrical issue, when in reality it is simply a burned out bulb.",
  "data/reddit-know/r/YouShouldKnow/comments/rdeqgu/ysk_your_local_library_likely_offers_heavily.json": "Why YSK: I'll give an example. Living within an hour from Boston my local\nlibrary gives discounts to all the city's museums. I wanted to take my\ngirlfriend on a date to the Museum of Fine Arts which is normally $25 per\nticket. But through the library you can get them for $10 per ticket. Turning…",
  "data/reddit-know/r/YouShouldKnow/comments/rdky5m/ysk_depression_is_different_from_sadness.json": "Why YSK: people will often say \"what do they have to be depressed about? They\nhave a good job/family/home/etc.\n\nDepression can be brought on by major events that cause sadness, like grief or\ntrauma. But it can also exist without any obvious external cause.\n\nSadness is like a stubbed toe: it sucks…",
  "data/reddit-know/r/YouShouldKnow/comments/rdt0d3/ysk_there_is_an_website_that_offers_paid_courses.json": "Why YSK: Most people are unaware that educational sites provide 100% off coupons\nfor promotion which literally make those courses FREE to enroll with lifetime\nvalidity.\n\nHere is the Website [https://coursetime.net/] that keep a track of those coupons\nand is updated regularly , which means we can…",
  "data/reddit-know/r/YouShouldKnow/comments/rdwhij/ysk_leaving_water_bottlessnacks_for_any_delivery.json": "Why YSK, this time of year and even more so this year (at least in the United\nStates as far as I know), the mail and package services are completely\noverwhelmed. This means your mail carrier and package delivery people including\ncompanies like Amazon even are working long hours and are on a strict…",
  "data/reddit-know/r/YouShouldKnow/comments/re5ubk/ysk_this_is_your_yearly_reminder_with_the.json": "Why YSK: the holidays are a really tough time for recovering alcoholics or\npeople who quit for different reasons. If someone declines alcohol, don't make a\nscene or try to convince them to drink anyways.\n\nHave fun, don't kill your family and stay safe",
  "data/reddit-know/r/YouShouldKnow/comments/re9m7u/ysk_that_texting_741741_will_immediately_connect.json": "Why YSK: With the holidays approaching, you should know that if you are feeling\ndepressed, or suicidal or you need someone to talk to, this is one of many tools\n[https://www.crisistextline.org/] that are available to you.\n\nYou are wanted, you belong, and the world is a better place with you in it.",
  "data/reddit-know/r/YouShouldKnow/comments/rebbc6/ysk_its_really_easy_to_unknowingly_trap_a.json": "Why YSK: Someone who works in customer service will almost inevitably have\ncasual conversations with some of the customers, especially if they see the same\ncustomers regularly.\n\nWhen that happens, the worker has almost no way of politely declining the\nconversation if they don't feel like talking.…",
  "data/reddit-know/r/YouShouldKnow/comments/rebk9r/ysk_if_someone_doesnt_want_to_celebrate_their.json": "Why YSK: You may say that you just want them to know you care about them. But\nthe message you’re sending the person is that you don’t care about their\nfeelings, because you’re doing exactly what they asked you not to do. They will\nend up resenting you, and hate celebrating it even more",
  "data/reddit-know/r/YouShouldKnow/comments/reja4r/ysk_when_a_retail_worker_asks_if_you_need_a_size.json": "Why YSK: Especially in the holiday season now with retail stores getting\nextremely busy, retail workers just don’t have the time to spend cleaning up all\nday. They do in fact have a lot of other tasks to do besides clean up after you,\nand although they are getting paid to keep the store tidy, their…",
  "data/reddit-know/r/YouShouldKnow/comments/rekljb/ysk_the_ie_and_eg_are_two_separate_things.json": "i.e. mean it is one of these and e.g. means these are examples. For example, if\nsomeone said \"Choose your favorite color (i.e. blue or red)\" they are saying\nchoose between blue and red. If someone said \"Choose your favorite color (e.g.\nblue or red)\" they are saying choose any color, but blue and…",
  "data/reddit-know/r/YouShouldKnow/comments/reuuum/ysk_paying_in_cashdebit_effectively_subsidizes.json": "Why YSK: Credit card networks charge a 1-3% processing fee for their services,\nso retailers and restaurants often mark up their prices for everyone to\ncompensate. Credit card holders will get 1-3% back in cashback or points, so\neven if a retailer raises prices, they effectively get the fair-market…",
  "data/reddit-know/r/YouShouldKnow/comments/rf1cph/ysk_bay_leaves_can_keep_weevils_away_along_with.json": "Why YSK is if you ever deal with an infestation, bay leaves are great at\ndeterring all kinds of pests. All you have to do is put a bay leaf or two in\nyour flour and rice and it will keep them away. You can also scatter the bay\nleaves around the cupboard to keep them out. This is an old trick my…",
  "data/reddit-know/r/YouShouldKnow/comments/rf47q6/ysk_truffle_oil_does_not_contain_any_truffles_but.json": "Why YSK: Once upon a time, truffle oil was just oil infused with truffles. These\ndays, it is oil infused with 2,4-dithiapentane,\n[https://en.m.wikipedia.org/wiki/Truffle_oil] a hydrocarbon with a flavor that\ncan best be described as a parody of truffle.\n\nI actually kind of liked truffle oil, until…",
  "data/reddit-know/r/YouShouldKnow/comments/rf59fx/ysk_even_slowmoving_water_presents_incredible.json": "Why YSK:\n\nMany people vastly underestimate the forces even small bodies of water can\nimpart.\n\nThere's a silly little rule of thumb that's actually pretty helpful. If you\ndropped a flower in the water, would you have time to bend down and pick it up,\nor is flowing away out of reach by the time you…",
  "data/reddit-know/r/YouShouldKnow/comments/rf953q/ysk_winter_is_here_top_up_your_tires.json": "Why YSK: Cold temperatures condense the air in your tires, so even those\nperfectly OK looking winter or all weather tires on your car or truck can\nactually be dangerously low.\n\nThis increases wear, affects ride, and changes how the tire contacts slippery\nsurfaces, making it potentially much more…",
  "data/reddit-know/r/YouShouldKnow/comments/rfcs7a/ysk_that_being_hypersexual_is_common_for_rape.json": "Why YSK: Often times the media surrounds the narrative of a rape victim as\nsomeone who outright repels sex/sexuality as a result of their traumatic\nexperience, and while that happens, the opposite end of the spectrum is\nsometimes looked down upon and outright ignored even though it’s highly…",
  "data/reddit-know/r/YouShouldKnow/comments/rfkori/ysk_remove_all_the_clutter_ads_life_story_popups.json": "Why YSK: It can get frustrating skimming through text walls just to find the\nrecipe on blogs/sites. Authors do it to get high ranking on Google.\n\nYou can use OnlyRecipe.app [https://onlyrecipe.app/] to extract the recipe\ninformation. It works on almost all sites/blogs which follow a recipe…",
  "data/reddit-know/r/YouShouldKnow/comments/rfm7du/ysk_harder_work_doesnt_always_mean_a_better_result.json": "Why YSK: There’s an attitude in this world that working hard automatically means\nyou’ll have a better outcome. It’s not true.\n\nJust because you spent an hour and half on liver and onions doesn’t mean you\nmade something tastier than a regular grilled cheese. Just because you wrote a\nsong mixing time…",
  "data/reddit-know/r/YouShouldKnow/comments/rfmlcu/ysk_never_say_at_least_when_someone_is_telling.json": "Why YSK: Saying “at least” implies to the other person that their problem isn’t\nthat bad. In actuality, their problem is bad to them and that’s what matters.\n\nIt also dismisses them and does not let them finish speaking about it. “At\nleast” shuts them down. They should not have to defend why their…",
  "data/reddit-know/r/YouShouldKnow/comments/rfpr2r/ysk_apple_just_released_an_update_that_allows.json": "Why YSK: There has been issues for many years with parents or loved ones who\nhave iOS devices and pass away that their loved ones cannot access their phone\ndata after death due to the security measures on the phone. This has caused many\nmemories to be lost as Apple won’t unlock a phone for anyone…",
  "data/reddit-know/r/YouShouldKnow/comments/rfsybl/ysk_that_naloxone_narcan_can_reverse_the_effects.json": "Why YSK: Opioid overdoses kit [100,000 Americans per year]. If given early\nenough, Naloxone can reverse the effects of an opioid overdose and restore\nnormal breathing. It works by turning off opioid receptors in the brain, meaning\nit has no effects on someone who isn't being affected by…",
  "data/reddit-know/r/YouShouldKnow/comments/rfu8j8/ysk_that_time_magazines_person_of_the_year_isnt.json": "Why YSK: often when Time announces their Person of the Year, it's met with\nbacklash because people think the person they chose is undeserving of praise,\nand they suggest people they think should have been person of the year instead,\nproviding less influential but morally better options.\n\nTime…",
  "data/reddit-know/r/YouShouldKnow/comments/rfyrub/ysk_white_canes_arent_only_used_by_fully_blind.json": "Why YSK:\n\nFully white canes can be used by any visually impaired person. They are often\nused as a signal to others. My dad is legally blind, but doesn't need the cane\nto generally walk around. However, he uses it outside to make crossing the\nstreet easier. In most places, you are required to stop…",
  "data/reddit-know/r/YouShouldKnow/comments/rg7oik/ysk_you_should_stop_saving_your_resume_as.json": "Why YSK: Whenever you send off a resume you should think about it from the point\nof view of the recruiter receiving it and therefore format it in a way that is\ngoing to make it as easy as possible for them. That includes saving it as PDF,\nmaking the information clear and saving it in the format of…",
  "data/reddit-know/r/YouShouldKnow/comments/rgjo1d/ysk_if_you_are_in_the_us_ebt_and_snap_benefits.json": "Why YSK: There is this stigma in the US for people who use these benefits and\nthis makes some people worried to apply in the first place. Some fear going to a\ncheckout line and risk someone judging you or making a remark how you are\n\"relying on handouts\".\n\nAlthough these people should just be…",
  "data/reddit-know/r/YouShouldKnow/comments/rgly9i/ysk_its_possible_to_wash_your_whites_and_colors.json": "Why YSK: Many people wash their whites and darks in seperate loads to prevent\ncoloring their whites, using up extra water and time.\n\nIf you use a whitening laundry powder labeled \"Safe on colors\" AND wash using\ncold water, then most whites will stay white even when washing them with dark or\ncolored…",
  "data/reddit-know/r/YouShouldKnow/comments/rgmkhq/ysk_minimum_wage_is_the_lowest_wage_allowed_by.json": "WHY YSK: I see a lot of employers now calling the entry wage offered their\n\"minimum wage\". While I suppose they are allowed to use those words, it would be\na shame if it caused misunderstanding when they announce they 'raised their\nminimum wage'. A raise in minimum wage is something currently being…",
  "data/reddit-know/r/YouShouldKnow/comments/rgq73g/ysk_to_start_preparing_for_small_animals_entering.json": "Why YSK: it’s getting colder and colder weather sometimes brings unwelcome\nguests into warm and safe spots in your car and/or house. They get hungry and\nwill feed on your wires, insulation, and hoses causing expensive damage. Had a\n2022 MDX come in saying warning lights were all on her brand new…",
  "data/reddit-know/r/YouShouldKnow/comments/rgwtsg/ysk_in_an_incident_involving_a_casualty_in_public.json": "Why YSK: In many cases, these items are frequently stolen by other people who\npretend to be helping.\n\nDo not keep their items in your pocket unless you are related to that casualty.\nThat may come off as you stealing it. It's best to leave it on the floor next to\nthe casualty so everyone can see who…",
  "data/reddit-know/r/YouShouldKnow/comments/rgycx0/ysk_you_should_question_everything_you_see_online.json": "Why YSK: There are so many videos, images and facts on internet platforms. A lot\nof the time these videos are staged, or facts are attributed to an image that\nhas no relation to the images original purpose. A glance at the comments on a\npost will show you just how many people lap it up without…",
  "data/reddit-know/r/YouShouldKnow/comments/rh93nx/ysk_stroke_symptoms_are_different_for_men_and.json": "Why YSK: We all get told what to look out for when someone is having a stroke\nbut men and women actually have different symptoms and they are worth knowing.\n\nDuring a stroke, both men and women typically report these signs appearing\nsuddenly:\n\n- Numbness or weakness in the face, arm or leg,…",
  "data/reddit-know/r/YouShouldKnow/comments/rhcqkz/ysk_to_use_your_proper_headlights_in_the_rain.json": "Why YSK: because we can’t see you in our mirrors. DRLs don’t count.",
  "data/reddit-know/r/YouShouldKnow/comments/rhfks8/ysk_the_addiction_cycle_is_easily_reignited_by.json": "Why YSK: You can break addictions by noticing the early signs. If you can, tell\nyour partner what your trigger is when you find it so that they can be on the\nlookout with you.\n\nThis is exactly the pattern my personal addiction follows, and it adheres\nperfectly to the typical model researchers have…",
  "data/reddit-know/r/YouShouldKnow/comments/rhh0fc/ysk_the_different_types_of_sexual_abuse.json": "why YSK is because i recently just got sexually harassed , and no justice came\nfrom it . all because people didn’t seem like it was “ a big deal “ so here’s\nsome if not all the different types , just so nobody has to suffer the same as\nme . make sure to reach out to someone you love or trust :))\n\n•…",
  "data/reddit-know/r/YouShouldKnow/comments/rhnerx/ysk_no_matter_how_much_your_workplace_pushes.json": "Why YSK: my gf learned this the hard - she worked every hour under the sun for a\nstartup and when she wasn't working would spend evenings with them in a social\ncapacity. She got fired last year due to the company having cash flow issues and\nall of them stopped responding to her messages. She put so…",
  "data/reddit-know/r/YouShouldKnow/comments/rht67a/ysk_that_if_your_wait_at_a_restaurant_is_longer.json": "Why YSK: The primary goal of the hostess at a restaurant is to seat your party\nas quickly as possible. It is in her own best interest to move you right on\nthrough to the dining room, so please be assured that if there was anything she\ncan do to lower your wait time, she would do it. She does not…",
  "data/reddit-know/r/YouShouldKnow/comments/rhxqn1/ysk_that_yelling_screaming_namecalling_etc_is_not.json": "Why YSK: If you're like me, yelling was the only form of communication in your\nhousehold. What many may not realize is the impact of that kind of behavior has\nlong term effects on one's self esteem, view of relationships, mental health\n(negative core self beliefs, trauma, PTSD/CPTSD, anxiety,…",
  "data/reddit-know/r/YouShouldKnow/comments/rhxvsx/ysk_if_you_updated_to_the_latest_version_of_ios.json": "Why YSK: Some people don’t like the change and don’t know that there’s an option\nto return to the legacy layout. This little tip will allow you to toggle back\nand forth between the layouts and will empower you to choose for yourself.",
  "data/reddit-know/r/YouShouldKnow/comments/ri5z9l/ysk_if_youve_updated_your_iphone_ios_15_or.json": "Aggravating not seeing the bar at the bottom because you’re so use to it being\non the top of the page is why YSK this trick! Hope it helps.",
  "data/reddit-know/r/YouShouldKnow/comments/ridzij/ysk_you_shouldnt_feel_guilty_for_wanting_to.json": "Why YSK: I recently left a job because my boss refused to increase my salary\neven though I had met every target set over two years of performance reviews. He\neven made me feel guilty for asking for a salary increase saying that I was\nlucky to have the position and that there were plenty of other…",
  "data/reddit-know/r/YouShouldKnow/comments/rie4ga/ysk_remember_this_christmas_if_someone_buys_a_25.json": "Why YSK: Friends or family might have had a tough year and might have put a lot\nof effort/thought into your gift so even though it may not be hundreds of\ndollars, remember to be kind!",
  "data/reddit-know/r/YouShouldKnow/comments/rifffo/ysk_if_youre_used_to_getting_a_deal_or_discount.json": "Why YSK: They're doing you a favour but it doesn't mean other employees will.\nAnd if you push too hard, you won't get your deal from those employees anymore,\nand you could very well be jeopardizing their employment there, so just keep\nyour mouth shut and be happy with what you get.",
  "data/reddit-know/r/YouShouldKnow/comments/rigvha/ysk_turbotax_is_not_renewing_its_free_file.json": "Why YSK: Many people who make <$72,000 use TurboTax to file taxes for free. This\nyear, they will need to find another provider. Check out\nhttps://www.irs.gov/filing/free-file-do-your-federal-taxes-for-free for more\ninformation about which companies will have partnered with the IRS for free…",
  "data/reddit-know/r/YouShouldKnow/comments/rihl9w/ysk_pet_cats_outdoors_and_feral_cats_are_a_huge.json": "Why YSK: Letting your cats outside may be great for their mental health, but it\nis worse for your local ecosystem. Cats are natural predators, and as a result\nare the largest and most abundant invasive predator of birds in the US.\n\nFeral cats number over 50M in the US, equating to about 8 billion…",
  "data/reddit-know/r/YouShouldKnow/comments/rijkbx/ysk_signs_someone_is_in_a_cult.json": "Why YSK: Well 2021 taught me that it’s very easy to get brainwashed into a cult.\nDo you know the signs? 1. The leader is the ultimate authority If you’re not\nallowed to criticize your leader, even if the criticism is true, you’re probably\nin a cult. 2. The group suppresses skepticism If you’re only…",
  "data/reddit-know/r/YouShouldKnow/comments/rilppc/ysk_speeding_almost_never_is_worth_the_risk_on_a.json": "Why YSK: Speeding is illegal and dangerous. It barely saves you any time while\ndramatically increasing the risk of accidents, injuries, and legal consequences.\nGoing with the flow of traffic is the safest and has much lower risk of any\ntrouble.\n\nHow much time does speeding…",
  "data/reddit-know/r/YouShouldKnow/comments/rinvl6/ysk_talking_about_your_wages_is_not_against_the.json": "Why YSK: the stigma around discussing your wages/salary is unjustified and is\ndriven by employers wanting to take advantage of paying employees different\namounts for the same work. You have every right to discuss your wages and may be\nprotected by law depending on what country/ state you are in.",
  "data/reddit-know/r/YouShouldKnow/comments/riov6j/ysk_do_not_give_people_unasked_for_cutesy.json": "Why YSK: It is not funny or endearing, it is demeaning and unacceptable and will\nmake you appear very unprofessional. Calling someone baby, honey, dear, girl,\nboy, youngster or the like is disrespectful in a professional setting apparently\nused to be OK for previous generations but I can tell you…",
  "data/reddit-know/r/YouShouldKnow/comments/riqjic/ysk_if_you_have_a_cat_and_keep_on_waking_up_in.json": "Why YSK: it might just be your cat being a loveable jerk.\n\nFor the past year and a half, I kept waking up in the middle of the night, wide\nawake startled. I thought my insomnia had flipped- nope. (I usually have the\nhard to fall asleep type) Turns out my cat just smacks my face in the middle of\nthe…",
  "data/reddit-know/r/YouShouldKnow/comments/riqpw9/ysk_that_most_people_misunderstand_what_chance_of.json": "Why YSK: because its a common misperception that can affect how we organize our\nday.\n\nIn simplistic terms: 50% chance of rain means that it is expected that 50% of a\ncertain area is expected to see rain.\n\nThe formula to calculate Precipitation Chance (%) = Confidence of Precipitation\nDeveloping x…",
  "data/reddit-know/r/YouShouldKnow/comments/risckt/ysk_that_the_aflcio_keeps_an_updated_map_of_all.json": "Why YSK: if you're trying to avoid crossing picket lines this should aid you\ngreatly.\n\nStrike Map [https://aflcio.org/strike-map]",
  "data/reddit-know/r/YouShouldKnow/comments/rivgly/ysk_the_horrors_of_the_fast_food_industry.json": "Why YSK: You can save yourself a lot of misery by avoiding fast food jobs, and\nthe stories I will tell you about what happened to some of the food will make\nyou not want to eat there anymore.\n\n\n\nAs someone who has worked numerous fast food jobs, I can tell you these are some\nof the absolute worst…",
  "data/reddit-know/r/YouShouldKnow/comments/rj56k7/ysk_is_your_sliding_closet_door_hard_to_move_have.json": "Our house is 30+ years old and most the sliding closet doors were hard to open\nand close. I saw a video showing household tips & tricks and they used petroleum\njelly (Vaseline) to lubricate the doors and now (2 years later) they still slide\nalong effortlessly.\n\nYou have to be tall enough to reach…",
  "data/reddit-know/r/YouShouldKnow/comments/rjd476/ysk_that_a_pet_is_a_terrible_gift.json": "Why YSK: Caring for a pet is an enormous amount of work. Animal shelters are\noften flooded with unwanted animals after the holidays as people figure this\nout.\n\nIf someone wants a pet, give them toys or treats instead. They can pick out an\nanimal on their own.\n\nPlease don't give someone a puppy…",
  "data/reddit-know/r/YouShouldKnow/comments/rjkjq5/ysk_that_a_fair_amount_of_advice_you_find_online.json": "Why YSK: Not every place on this planet has the same social or legal norms for\nquitting your job, buying a car or formating a CV. So make sure to double check\nwith a source in your own language and from your own country. Use common sense,\nand try to relate what you read in thus sub to expercieas…",
  "data/reddit-know/r/YouShouldKnow/comments/rjl2f5/ysk_that_food_delivery_companies_not_only_charge.json": "Why YSK: You can save money by being more informed about food delivery fees.\nThose ads you see all the time for “free delivery” really mean “no delivery\nfee.” There’s also 15-20% service fees, they inflate menu prices, and add surge\nfees and minimum cart fees. Sales taxes are also calculated…",
  "data/reddit-know/r/YouShouldKnow/comments/rjnkl2/ysk_that_unlimited_ptovacation_is_not_a_perk_even.json": "Why YSK: in a traditional PTO package with a set number of days per year, your\nvacation time is accrued each payroll period essentially creating a bank of days\noff. Some companies will even let you carry over a certain amount of days into\nthe following year (although that is becoming increasingly…",
  "data/reddit-know/r/YouShouldKnow/comments/rjxrki/ysk_aluminum_is_not_an_ingredient_in_deodorants.json": "Why YSK: Deodorant and antiperspirant are two different things. Antiperspirants\nusually contain aluminum as an ingredient. Deodorants, for the most part, do\nnot. I’m seeing people buy the more expensive brand of deodorant, because the\nlabel says it’s aluminum free. Aluminum was never an ingredient…",
  "data/reddit-know/r/YouShouldKnow/comments/rk7hkf/ysk_in_the_united_states_there_is_no_such_thing.json": "Why YSK: The FDA considers antiperspirants as drugs as they prevent\nperspiration. The only active ingredients approved in the United States in the\nOTC monograph are all aluminum derived. So in the United States, anything that\nis “aluminum-free” is a deodorant and will only cover up the scent, but…",
  "data/reddit-know/r/YouShouldKnow/comments/rkf6e1/ysk_that_deleting_your_data_doesnt_always_delete.json": "Why YSK: your data can often still be recovered, and hacked, even after your\nrequest that it be deleted was confirmed by a company.\n\nI worked as a data scientist in big tech, and observed that data deletion is\ntricky business. Data governance laws vary by country and even state, and range\nquite…",
  "data/reddit-know/r/YouShouldKnow/comments/rki013/ysk_if_youre_pumping_at_a_gas_station_and_the.json": "If this happens to you, keep the nozzle in place, shut off the fuel at the pump\nwith the on/off or emergency switch, and tell the attendant who will shut off\nthe main pump and call emergency services. Why YSK: I've seen about 69 videos of\npeople who experience this and immediately remove the nozzle…",
  "data/reddit-know/r/YouShouldKnow/comments/rkubb0/ysk_that_energy_drinks_are_very_acidic_and.json": "Why YSK: Drinks can be acidic even if they don’t taste sour or bitter.\n\nThe average energy drink has a PH of 2.8, really the same as soda.\n\nThe acidity of energy drinks can contribute to enamel degradation and/or acid\nreflux.",
  "data/reddit-know/r/YouShouldKnow/comments/rlgusb/ysk_if_you_get_asked_in_an_interview_whether.json": "Why YSK: was recently asked this in an interview as one of the final questions\nand it was super obvious why they were asking me it. As a women in an industry\nthat is made mostly of men, I felt slightly unfairly treated as I'm sure they\ndon't ask men going for the role that question. I've also read…",
  "data/reddit-know/r/YouShouldKnow/comments/rlhqbh/ysk_that_the_cheap_gifts_that_you_receive_from.json": "Why YSK: I know it's the season to shit on shitty corporate gifts, and I'm all\nfor it in the event that the money does come out of the corporate budget, but\nbefore you light your torches when you get your present, consider that what you\nreceived was paid from the pocket of someone not too far…",
  "data/reddit-know/r/YouShouldKnow/comments/rlicqy/ysk_trade_work_isnt_for_everyone_coming_from_a_13.json": "Why YSK; I hear a lot of people downplay school and hype up trades. While for\nsome trades may be the best way to a successful future, this does not hold true\nfor everyone.\n\nI’ve trained dozens of people and watched at least %80 wash out after claiming\nthey could handle it. Why? It’s hard,…",
  "data/reddit-know/r/YouShouldKnow/comments/rlk62c/ysk_clean_your_dryer_exhaust_yearly_both_inside.json": "Why YSK lint buildup happens in the exhaust no matter how religiously you clean\nit in the dryer and can create a fire hazard if not cleaned. The excess lint\naccumulates in the exhaust (the tube in the wall that goes outside) and due to\nmoisture, will build up fairly quickly, so if you clean it once…",
  "data/reddit-know/r/YouShouldKnow/comments/rlolbn/ysk_google_password_manager_is_not_comparable_to.json": "Why YSK: I figured I'd save someone else the headache I'm currently going\nthough. You should know google password manager is a browser-based manager and\nlinked to your browser's data like history/cookies/cache, so it can be cleared\naccidentally and easily. A third party app (lastpass, keeper,…",
  "data/reddit-know/r/YouShouldKnow/comments/rmafgj/ysk_if_you_work_fulltime_in_the_us_for_a.json": "Why YSK: Student debt is HUGE in the US, and anything that can help people get\nrid of some of that debt is great. The U.S. Department of Education announced a\ntemporary expansion on Oct. 6 for the PSLF program. Get it while you can!\n\nUS full-time nonprofit and government workers that have Federal…",
  "data/reddit-know/r/YouShouldKnow/comments/rmbarc/ysk_targeting_an_aircraft_with_a_laser_is_illegal.json": "Why YSK: Aircraft flying over the US are governed and protected by federal law.\nInterfering with an aircraft in flight is a federal offense. When a pilot sees a\nLASER from the ground it can blind him or her for several minutes, seriously\nendangering the safety of the flight, the aircraft, the…",
  "data/reddit-know/r/YouShouldKnow/comments/rmemil/ysk_youtube_has_been_lowering_your_resolution.json": "Why YSK: Have you noticed videos loading in at 440p even though your internet\nconnection is fine? Install the tampermonkey extension for your browser and then\ninstall https://greasyfork.org/en/scripts/23661-youtube-hd\n\nYou can set your preferred maximum resolution in the editor.",
  "data/reddit-know/r/YouShouldKnow/comments/rmheie/ysk_that_if_you_interact_with_a_nice_worker_in.json": "Why YSK:\n\n 1. it makes your life better to have them put in the extra effort to be nice to\n    you, so it's nice to make their life better. Usually they don't see a ton of\n    reward.\n\n 2. it costs you nothing to call, and only 5 minutes of time usually.\n\n 3. It's a powerful statement, because…",
  "data/reddit-know/r/YouShouldKnow/comments/rmjnod/ysk_that_95_of_your_bodys_serotonin_the.json": "Why YSK: The flora in your gut is responsible for the production of a lot of\nimportant hormones, including serotonin. Maintaining a healthy intestinal\nmicro-biome plays a huge role in lowering stress levels, keeping depression at\nbay, getting enough sleep, and so many other things that can improve…",
  "data/reddit-know/r/YouShouldKnow/comments/rmkqzd/ysk_that_if_you_buy_a_house_or_refinance_your.json": "Why YSK:\n\n-depending on your state's public real estate records and laws, predatory\ncompanies may be able to see whenever your new deed or mortgage is filed into\npublic record when you purchase a property or refinance a mortgage. They have\nalgorithms set up to comb through newly filed public…",
  "data/reddit-know/r/YouShouldKnow/comments/rmm2nk/ysk_if_youre_interested_in_airplane_accidents_and.json": "Why YSK: The website called \"The Aviation Herald\" is an absolute must for people\ninterested in commercial aviation incidents and accidents and avgeeks.\n\nIt's ran by a single person who posts only factual and verifiable information\nabout any commercial aviation incident or accident with incredible…",
  "data/reddit-know/r/YouShouldKnow/comments/rmmeno/ysk_the_fbi_shares_images_of_people_rooms_items.json": "https://www.fbi.gov/wanted/ecap",
  "data/reddit-know/r/YouShouldKnow/comments/rmppwp/ysk_that_waist_to_height_ratio_wthr_is_a.json": "Why YSK:\n\nWeight related illnesses are some of the most devastating and also some of the\nmost preventable diseases, and BMI (likely the most popular metric) actually\ndoes a poor job of predicting weight-related illnesses.\n\nThis post is not intended to body shame anyone. No measure is perfect. It…",
  "data/reddit-know/r/YouShouldKnow/comments/rmprv9/ysk_that_the_your_blank_is_the_first_letter_of.json": "Why YSK: People always comment what they ‘get’ and if you comment on enough of\nthem it’s easy to work out your initials and date of birth as well as various\ndetails about you. Combine that with anything you’ve said in your post history\nand they probably know more than you want them to.",
  "data/reddit-know/r/YouShouldKnow/comments/rmyevn/ysk_the_receive_by_date_that_your_banks_bill_pay.json": "Why YSK: That date is usually just the date they withdraw the funds from your\naccount. Then they print the check and eventually mail it. It could take 2-3\nweeks for it to actually be received by the person/ company you're paying.\n\nSource: I work for a company that performs Home maintenance…",
  "data/reddit-know/r/YouShouldKnow/comments/rn27jx/ysk_getting_a_girl_really_drunk_so_shell_have_sex.json": "Why YSK: it can effect the victim for a long time and could potentially land you\nin a lot of shit\n\nIt seems to me based on films I have seen, many of them are unknowingly\npromoting rape culture. In one very popular film I rewatched recently\n(Superbad), Jonah hill jokes that parties are for getting…",
  "data/reddit-know/r/YouShouldKnow/comments/rn6dl3/ysk_the_symptoms_of_carbon_monoxide_co_poisoning.json": "Why YSK: A simple lack in knowledge of symptoms could be all that is required\nfor the death of you and/or your friends/loved ones.\n\nMy sister and her husband could've died.\n\nI overheard my sister telling our mom that she is still losing hair and can't\nfigure out why - this is red flag #1, but it…",
  "data/reddit-know/r/YouShouldKnow/comments/rnmy9v/ysk_it_isnt_normal_for_your_cats_to_be_vomiting.json": "Why YSK:\n\nI often see people causally mentioning the inconvenience of their cat vomiting\non their floor, as if it is a normal part of cat behaviour.\n\nIt isn't.\n\nCats will throw up occasionally - typically because of a fur ball or having\neaten too quickly, but it isn't normal for them to be doing it…",
  "data/reddit-know/r/YouShouldKnow/comments/rnr906/ysk_vhs_video_cassettes_degrade_over_time_under.json": "Why YSK: Many people have old VHS tapes laying around, not realizing that they\nwill soon be degraded beyond usefulness. These could be the only video of loved\nones, etc. If you want to keep these memories, you must convert these to digital\nASAP.",
  "data/reddit-know/r/YouShouldKnow/comments/rnsq1p/ysk_the_3g_spectrum_phaseout_in_2022_will_affect.json": "Why YSK: Certain medical devices, tablets, smart watches, vehicle SOS services,\nhome security systems, and other connected products may be using 3G network\nservices. Don't forget about devices that use cellular connectivity as a back-up\nwhen a wired internet connection goes down. If the device is…",
  "data/reddit-know/r/YouShouldKnow/comments/ro33cf/ysk_the_immaculate_conception_refers_to_the_birth.json": "Why YSK: this just seems like a super common misconception.\n\nThe idea is that Mary was born free from sin.\n\nGiven the time of year I thought it might be helpful to clarify.",
  "data/reddit-know/r/YouShouldKnow/comments/ro54uv/ysk_subscribe_to_difficult_to_cancel_services.json": "Why YSK: Services such the NY Times are notorious for making you speak to a live\nagent and go though an arduous process to cancel the service you easily signed\nup for online.\n\nServices like this are not rare and growing day by day, however many allow you\nto sign up through the Google Play/ Apple…",
  "data/reddit-know/r/YouShouldKnow/comments/rob9kl/ysk_about_the_fundamental_attribution_error_a_key.json": "Why YSK: if someone is annoying you or does something that you disagree with,\nremember that you can’t see inside their thoughts.\n\nWhen you cut someone off in traffic, it’s because you were being absentminded or\nbecause you’re late to sing lullabies to your newborn, right? But when someone\ncuts YOU…",
  "data/reddit-know/r/YouShouldKnow/comments/rodxlz/ysk_the_morning_afterplan_b_pill_looses.json": "Why YSK: The morning after/plan b pill, is the most effective if you weigh ON\nAVERAGE less than 170lbs. The weight limit does very by brand so always ask the\npharmacist about the weight limit when you buy. This doesn't mean it WON'T work.\nIt may work anyway and it won't hurt you to take it. Just…",
  "data/reddit-know/r/YouShouldKnow/comments/rofvya/ysk_the_popular_bluetooth_tracker_company_tile.json": "Source\n[https://www.theverge.com/2021/12/9/22820381/tile-life360-location-tracking-data-privacy]\n\nWhy YSK: Many people bought Tiles over the years because they wanted a good\nquality convenient bluetooth tracking device for their keys or valuables. With\nthe introduction of Apple's Airtags and Galaxy…",
  "data/reddit-know/r/YouShouldKnow/comments/rp1ekx/ysk_clean_your_toilet_after_a_cleaning.json": "Why YSK: Many people (Including cleaners) don't think to wipe toilet seats down\nwith a rag and water after using cleaning solution or cleaning wipes (like lysol\nwipes). The remaining cleaner residue will burn your bottom prompting you to\nhave an itchy bottom.",
  "data/reddit-know/r/YouShouldKnow/comments/rpa51p/ysk_cucumbers_arent_the_only_delicious_thing_that.json": "Why YSK: other good for yous like mushrooms, onions, carrots, asparagus and even\ncauliflower taste amazing when pickled.\n\nAn oft forgotten yet delicious way to get fiber and nutrients.",
  "data/reddit-know/r/YouShouldKnow/comments/rpakw2/ysk_how_to_save_cash_to_get_out_of_a_relationship.json": "Why YSK: with someone who is controlling your finances leaving may seem\nimpossible- this advice could help you save funds to help with leaving.\n\nIf you need to save cash to get away from an abusive partner who has financial\ncontrol- use grocery trips to put away money a little at a time.\n\nIf your…",
  "data/reddit-know/r/YouShouldKnow/comments/rph9el/ysk_a_wood_fire_in_the_fireplace_is_extremely.json": "The idea of huddling around a lovely warm fire with loved ones is so deeply and\nculturally ingrained that it can be very difficult to accept just how terrible\nit is for health. But the health risks are clear, and smoke from a wood fire\ndamages your respiratory system and heart in a similar fashion…",
  "data/reddit-know/r/YouShouldKnow/comments/rpsvi7/ysk_if_you_are_a_new_homeowner_in_a_snowy_climate.json": "Why YSK: Not all snow shovels are created equal. There are shovels built to\nlift, shovels built to push, and those made to do both (like the Head &\nShoulders of shovels).\n\nFor lighter snowfall, you will appreciate having a wider (30\" or 36\") snow\npusher that is lower profile and allows you to…",
  "data/reddit-know/r/YouShouldKnow/comments/rpt9i9/ysk_that_if_you_wake_up_just_in_time_for_a.json": "Why YSK: if you just wake up you have a morning voice and whether you hear it or\nnot, usually other people can tell. It might make you seem less professional\nespecially if you work from home.\n\nMy suggestion is to sing along to a song before you get on your first call, and\nusually that will warm up…",
  "data/reddit-know/r/YouShouldKnow/comments/rq9enz/ysk_if_you_have_a_new_years_resolution_do_it_now.json": "Why YSK : If you wait for 1st January 2022, its just another form of\nprocrastination delaying your wonderful journey, happy new year everyone!",
  "data/reddit-know/r/YouShouldKnow/comments/rqfr96/ysk_when_sending_relief_supplies_to_disaster.json": "Why YSK: Disaster areas, such as the ones in Kentucky, Arkansas, Illinois, and\nsurrounding areas are usually without power, and fresh milk is in scarce supply.\nBoxed milk, such as Gossner, Horizon, or Parmalat are shelf stable, and a much\nneeded alternative to fresh.\n\nI remembered reading about…",
  "data/reddit-know/r/YouShouldKnow/comments/rqgygv/ysk_how_to_cook_with_garlic_the_tinier_you_mince.json": "Why YSK: I know so many people who always say “triple the recipe recommendation”\nfor garlic. But then I see them just slicing garlic into millimeter slices in\ntheir recipe. Right.. found the problem. Most of the time the recipe is fine,\nyou just have to prepare the garlic correctly in order to get…",
  "data/reddit-know/r/YouShouldKnow/comments/rqhagw/ysk_that_most_retailers_especially_the_luxury.json": "WHY YSK: To make this legal, they sell it online for a short period of time a\nhigher price, let’s say $700 for a bag, then they put it in outlets or on sale\nfor $350 and smack a big 50% off on the label.\n\nThey were never made for mainline stores or main collections.\n\nSadly, there’s no way to tell…",
  "data/reddit-know/r/YouShouldKnow/comments/rqqz56/ysk_your_genetics_can_predisposition_you_to.json": "Why YSK: a lot of people will dismiss dissociation or hearing voices during a\nhigh as \"just a bad trip\" but it can actually be an isolated episode of\ncannabis-induced psychosis (CIP)\n[https://www.psychiatrictimes.com/view/cannabis-induced-psychosis-review] or a\nprecursor to mental illness.\n\n\"Recent…",
  "data/reddit-know/r/YouShouldKnow/comments/rqtp1u/ysk_that_there_is_a_hidden_economy_of_buying_and.json": "I have worked in addiction treatment for 20 years, and YSK that in the\nbackground of all of these organizations is a quasi-legal economy of patient\ntrafficking. One involes non-profit organizations that ostensibly educate and\nsupport the public, then turn around and \"sell\" referrals to treatment…",
  "data/reddit-know/r/YouShouldKnow/comments/rr0632/ysk_your_bank_is_a_better_place_than_a_coinstar.json": "Why YSK: I understand the convenience of the machines in Walmart, but if you are\na member of a bank or credit union also in your neighborhood, they shouldn’t\ncharge a fee to count your coins with a machine and either deposit them or give\nyou cash. CoinStar either charges a percentage or forces you…",
  "data/reddit-know/r/YouShouldKnow/comments/rrgmbe/ysk_most_kid_toys_are_shipped_in_a_try_me_mode.json": "Why YSK: Kid toys that make sound have a try me mode for store display. If you\ndon’t shift it to “On”, most of the phrases and sounds will not function. This\nis especially true for toddler toys that let you try them on display. The\nOn/Off/Try Me mode buttons are usually next to the battery…",
  "data/reddit-know/r/YouShouldKnow/comments/rrko0w/ysk_using_someones_vulnerability_against_them_in.json": "Why YSK: basically it's a d*ck move to make, especially when it's someone close\nto you because it shatters the trust between you on a whole different level. It\ncauses people to stop confiding in you. Don't do it, even if the other person is\nthe one in the wrong.",
  "data/reddit-know/r/YouShouldKnow/comments/rrleto/ysk_that_your_google_searches_can_be_seriously.json": "Why YSK: often the hardest part of finding the information you want is getting\nrid of the information you don’t want. Knowing this trick can get you to that\ninformation a lot quicker and customise what is shown.\n\nEdit: for clarity, adding the minus sign will exclude that word from results.",
  "data/reddit-know/r/YouShouldKnow/comments/rropag/ysk_if_you_enjoy_cooking_with_lots_of_spices.json": "Why YSK: For $6 I got a large bottle of sesame seeds. The tiny bottle of\nMcCormick is almost $4. The quantity difference might be over 50x the seeds for\nan extra 2 dollars. They also support local people better than your regional\nchain.\n\nI used an entire bottle of cumin and other Indian spices for…",
  "data/reddit-know/r/YouShouldKnow/comments/rs35h4/ysk_why_us_radio_and_tv_station_call_letters.json": "Why YSK: In 1923 the Federal Communications Commission (FCC) established the\nMississippi River as the dividing line for station call letter identification.\nAny station East of the river starts with a \"W\" as in WLTW in New York. Any\nstation in the West starts with a \"K\", such as KQED in California.",
  "data/reddit-know/r/YouShouldKnow/comments/rs5wnv/ysk_bings_search_engine_has_a_very_weak_content.json": "Why YSK: Anecdotal Proof --WARNING: NSFL Images--/ Try searching \"5 gum meme\" on\nBing with the Safe Search set as strict as you like --WARNING: NSFL Images--/\n\nParents may want to restrict image searching to more proven-safe search engines\nto avoid \"impressionable minds\" from being scarred.…",
  "data/reddit-know/r/YouShouldKnow/comments/rseed8/ysk_of_radio_garden_an_app_that_lets_you_visually.json": "Why YSK: for the times when you want some spontaneity in the way you listen to\nradio, this app could come in handy.",
  "data/reddit-know/r/YouShouldKnow/comments/rsfp5a/ysk_if_you_enjoy_cooking_with_lots_of_spices_they.json": "Why YSK:\n\nMost people make an effort to buy local/organic/pay attention to where their\nfood comes from, but that doesn't usually extend to spices, and should.\n\nOver a third of spices tested by Consumer Reports contained\narsenic/cadmium/lead.\n[https://www.consumerreports.org/food-safety/your-herbs…"
}