{
  "data/reddit-know/r/YouShouldKnow/comments/n0nywj/ysk_you_can_save_voice_mail_to_voice_memos_to.json": "Why YSK: Many people keep old voicemails because they need the information or\ndon't want lose a sweet message from a loved one. This process will let you keep\nthese messages without cluttering your mailbox.\n\nIf you have an old voicemail that you don't want to delete (loved one, important\nfor other…",
  "data/reddit-know/r/YouShouldKnow/comments/n10dxn/ysk_hand_sanitizer_works_as_deodorant_in_a_pinch.json": "Why YSK: Let's be honest, sometimes, you forget to slide some deodorant on. And\nnow you're over at your lady's house?! Yikes. Well, hand sanitizer is basically\neverywhere these days, and it (allegedly) kills 99.9% of germs. As it turns out,\nsome of those germs are the ones that cause armpit stank.…",
  "data/reddit-know/r/YouShouldKnow/comments/n22xs9/ysk_mothers_day_is_coming_up_use_a_local_florist.json": "Why YSK: There are a number of national flower aggregators like 800-Flowers and\nProFlowers in the US. If you are going to send your Mom (or anyone else)\nflowers, take a few minutes and find a local flower shop that services that\narea. You will pay less for the flowers and the flower shop will make…",
  "data/reddit-know/r/YouShouldKnow/comments/n24z3l/ysk_never_kiss_a_baby_or_childs_ear_it_can_cause.json": "Why YSK: \"An innocent kiss right on the ear opening creates a strong suction\nthat tugs on the delicate eardrum, resulting in a recently recognized condition\nknown as \"cochlear ear-kiss injury.\" Babies and small children are particularly\nvulnerable to hearing damage via a kiss, simply because their…",
  "data/reddit-know/r/YouShouldKnow/comments/n2i7xp/ysk_that_if_you_get_asked_wether_you_plan_on.json": "A German law professor once told me women can lie and say no to that question,\nsince it is illegal. Because if you refuse to answer you kinda tip them off that\nthat is a sensitive topic and you are possibly thinking about it.\n\nSo just say no, what are they gonna do? If get hired and end up having…",
  "data/reddit-know/r/YouShouldKnow/comments/n2u07b/ysk_teens_you_are_your_own_first_doctor_your.json": "This is especially relevant to kids/teenagers, who sort of expect their parents\nto \"handle everything\". If you have problems with health (chronic pains,\nseemingly uncommon body changes, problems with focus, trouble hearing/smelling\netc). Whatever symptoms that seem to affect you significantly more…",
  "data/reddit-know/r/YouShouldKnow/comments/n2x4wt/ysk_that_there_is_a_program_called_youtubedl_that.json": "Why YSK: There are a lot of websites out there that can download videos from\nYouTube and other sites, but those websites are usually really sketchy,\nad-infested, or both. People still use those because it is the easiest, if not\nonly, way to download videos from sites. youtube-dl fixes that\n\nyoutube…",
  "data/reddit-know/r/YouShouldKnow/comments/n2yqlr/ysk_research_has_found_children_as_young_as_20.json": "Why YSK:. If you want your children to have good eating habits, you have to\nteach by example.\n\nhttps://this.deakin.edu.au/self-improvement/the-unseen-influence-how-a-dads-diet-can-impact-his-kids-health",
  "data/reddit-know/r/YouShouldKnow/comments/n2yt9i/ysk_at_the_time_of_conception_the_diet_and.json": "Why YSK:. \"...there is a lot of information available to women who want to\nbecome pregnant about the importance of a healthy lifestyle and good dietary\nchoices both for their own health and that of their child. Interestingly,\nlittle, if any, advice is available for the father.\"\n\n-Dr. Adam…",
  "data/reddit-know/r/YouShouldKnow/comments/n2z6dt/ysk_that_you_must_exit_the_vehicle_if_you_are.json": "TL;DR: Thanks to Pennsylvania v. Mimms, it has been established that a police\nofficer ordering an individual to step out of their car is a lawful command.\n\nWhy YSK: failure to comply will result in a far more dangerous situation for\nboth you and the police officers.\n\nCommon questions:\n\n> > he…",
  "data/reddit-know/r/YouShouldKnow/comments/n34y3y/ysk_that_you_should_always_ask_before_feeding.json": "Why YSK\n\nRegardless of whether you feed your dog human food, you should always ask if\nit’s ok to give someone else’s dog human food. Some people are stricter with\nwhat they give their dog for discipline reasons, while some dogs have dietary\nreasons they can’t eat some food.\n\nFor instance, my dog is…",
  "data/reddit-know/r/YouShouldKnow/comments/n36z7e/ysk_if_someone_goes_into_cardiac_arrest_you.json": "My girlfriend and I were driving yesterday when she saw a man collapse in his\nfront yard. She told me and I pulled over. I found him face down by his\nlawnmower, unconscious.\n\nWe tried to call 911 but didn’t have service, so I flagged down a neighbor and\nhad her call. The neighbor had a friend…",
  "data/reddit-know/r/YouShouldKnow/comments/n3mlnh/ysk_if_you_use_the_life_hack_of_checking_if_eggs.json": "If you search on Reddit or Google on how to check whether your eggs are still\ngood or not, you will most likely come across this ‘life hack’ telling to put\nyour eggs in a bowl of water. As the story goes: If they sink they are safe, if\nthey float they are spoiled. This is dishonest at…",
  "data/reddit-know/r/YouShouldKnow/comments/n43z7x/ysk_its_sometimes_not_enough_to_just_listen.json": "YSK about active listening. To be seen, heard, understood. For every twenty\npeople who cannot listen well, there is one that actively listens and is\nengaging.\n\nActive listening is about being fully present with no distractions. It's about\nhow you listen to the person that you're supporting. We can…",
  "data/reddit-know/r/YouShouldKnow/comments/n44j3e/ysk_mothers_day_is_this_coming_sunday.json": "Why YSK: Cause moms are great for the most part",
  "data/reddit-know/r/YouShouldKnow/comments/n4hf9r/ysk_that_if_youre_worried_about_not_passing_a.json": "Why YSK: Almost every employer runs a background check on you that looks at a\nwide variety of criteria (criminal record, credit score, debt, etc) and if you\nraise any red flags, they will ghost you quicker than than that attractive\nguy/girl you met at the bar that one night that you’ve been telling…",
  "data/reddit-know/r/YouShouldKnow/comments/n4qmja/ysk_if_you_are_in_a_job_you_like_it_is.json": "Why YSK: It gives us a sense of job security when we know more than other\nemployees who might want the position we have, but by transferring your\nknowledge and successful strategies to those people, you create the space that\nfrees you up to advance your career to the next level by backfilling…",
  "data/reddit-know/r/YouShouldKnow/comments/n4qpes/ysk_suntanning_is_dangerous_and_bad_for_you_yes.json": "Why YSK: with summer fast approaching in the northern hemisphere, far too many\npeople don't bother with sunblock or even purposely get tan, but tanning is very\nbad for your skin. It damages and ages your skin and can lead to skin cancer\nlater in life. Even if you tan regularly and haven't seen these…",
  "data/reddit-know/r/YouShouldKnow/comments/n56tcz/ysk_if_a_family_member_dies_and_debt_collectors.json": "Read this:\nhttps://www.consumer.ftc.gov/articles/0081-debts-and-deceased-relatives It is a\nfar-better-worded summary of what I was trying to explain here. (US ONLY. CHECK\nYOUR LOCAL AND STATE LAWS. CONTACT AN ATTORNEY WITH QUESTIONS)\n\nThis is a common tactic of bill/debt collectors, especially with…",
  "data/reddit-know/r/YouShouldKnow/comments/n57o0p/ysk_that_correct_term_for_someone_who_avoids.json": "The term Antisocial is more fitting to describe someone who has no regard for\nthe well-being of those around them. They can be defined as “harmful to\nsociety”.\n\nAsocial is the word you should be using to describe someone who doesn’t like\nsocial interactions and/or social settings. It is much more…",
  "data/reddit-know/r/YouShouldKnow/comments/n5ao9s/ysk_that_both_the_channels_puppy_love_and_pets.json": "Why YSK: These people are abusing these animals, and many of them, despite\ngetting “rescued” are likely actually dead because of the abuse they suffered.\nMore attention needs to be brought to this so that Youtube can shut them down\n\nNick Crowley has a good video on this explaining the situation…",
  "data/reddit-know/r/YouShouldKnow/comments/n5fqz7/ysk_that_in_the_united_states_you_can_look_up.json": "Why YSK: Doctors sometimes receive payments from drug and medical device\ncompanies for a variety of reasons... some are benign (research), and some are\nless so (commissions for medical devices). In the United States, this website\n[https://openpaymentsdata.cms.gov] (which is run by the government)…",
  "data/reddit-know/r/YouShouldKnow/comments/n5jhq3/ysk_if_you_dont_like_oatmeal_you_probably_arent.json": "Why YSK: Because oatmeal is cheap, healthy, and more delicious than you think.\n\nI thought I hated oatmeal, because no matter how much sugar I put on it, it\nstill tasted like worthless slop. I could never get it to taste like the little\nflavored packets. Then I finally realized that my problem was…",
  "data/reddit-know/r/YouShouldKnow/comments/n5sj21/ysk_that_cinco_de_mayo_5th_of_may_is_not_a_real.json": "Why YSK: Cinco de Mayo is more of an American holiday. Only celebrated in the\nUnited States and in one city in Mexico.\n\nThe only real connection to Mexican culture is that of the battle of Puebla( in\nMexico) or Batalla de Puebla as it’s known. Where the Mexican army defeated the\nFrench army in the…",
  "data/reddit-know/r/YouShouldKnow/comments/n5yxnr/ysk_when_people_say_cyanide_tastes_like_bitter.json": "Bitter almonds are used to make almond extract, which helps gives maraschino\ncherries their unique taste. A handful of raw bitter almonds could kill someone.\nYou can’t buy them in a store in the United States. They taste bitter, but also\nhave a fruity taste like peaches or cherries.\n\nThe almonds you…",
  "data/reddit-know/r/YouShouldKnow/comments/n637eb/ysk_many_people_are_not_looking_for_answers_when.json": "Why YSK: People have different reasons for sharing their personal problems with\nyou, but one of the main reasons is simply to have someone to talk to/process\nwith. Talking about a problem can be incredibly helpful for people that need a\nway to process. However, that helpful process can be completely…",
  "data/reddit-know/r/YouShouldKnow/comments/n68fty/ysk_that_if_you_put_your_finger_inside_your_dogs.json": "Why YSK: if your dog is dehydrated just 2% it can feel like the equivalent of\nhaving a hang over. This is mainly for ageing or movement impaired dogs. It can\nmean (this is all according to my vet fyi) they do not have the energy/strength\nanymore to take care of their basic daily needs and can lead…",
  "data/reddit-know/r/YouShouldKnow/comments/n6ks84/ysk_that_toddlers_elbows_can_dislocate_easily_so.json": "why YSK: the ligaments in kids’ elbows are still loose, so dislocating their\nelbow (an injury known as Nursemaid’s elbow) is one of the most common injuries\nin young kids. once it happens, it’s common for it to reoccur in the future.\n\nit mainly affects kids younger than 5 years old.\n\nyou should also…",
  "data/reddit-know/r/YouShouldKnow/comments/n6pl07/ysk_that_charcoal_deodorizes_your_refrigerator.json": "Why YSK:\n\n\"First, charcoal is porous, meaning there are lots of nooks and crannies that\ntrap offending food odors. Second, charcoal is almost entirely made of carbon, a\nsubstance that absorbs all organic compounds (aka smelly food particles).\nThere’s a reason that water purification filters are made…",
  "data/reddit-know/r/YouShouldKnow/comments/n70jb5/ysk_about_the_protection_provided_you_under_tort.json": "Why YSK: When you pay for something that involves risk, companies will typically\ngive you a receipt/ticket telling you that you assume all the risk for the\nservice being provided. For example, when you buy a ticket for a roller coaster\nride, the back of the ticket will typically say something like…",
  "data/reddit-know/r/YouShouldKnow/comments/n7c2mw/ysk_grapes_are_extremely_toxic_to_dogs.json": "WHY YSK Grapes, raisins and other grape products can cause acute kidney injury\nwith anuria. As little as 1 to 2 grapes can kill a dog. Science still has yet to\nfind out what it is about a grape that is so toxic, but they do know that the\ntoxin is in the grape itself. So seedless grapes are still not…",
  "data/reddit-know/r/YouShouldKnow/comments/n7dni1/ysk_if_youre_using_cheap_oven_mits_you_shouldnt.json": "Why YSK: Because I just burned my hand doing this. Thanks for attending my Ted\ntalk.",
  "data/reddit-know/r/YouShouldKnow/comments/n7ff51/ysk_if_an_hvac_tech_says_youre_low_on_refrigerant.json": "Most air conditioning systems are closed systems. That means that the\nrefrigerant that's put into the system when it's installed should be there for\nyears and years.\n\nThis time of year, when people are starting to crank their ACs for the first\ntime of the season, it's the prime time to have the HVAC…",
  "data/reddit-know/r/YouShouldKnow/comments/n7i1ws/ysk_while_they_are_available_adding_cicada_to_you.json": "We add almost everything to our compost piles/bins to improve our gardens, but\ndon't think about adding cicada to the piles also. These annoying critters can\nsupercharge you compost in 2 ways: add nitrogen from the bug guts, also chitin.\nChitin is comes from the crunchy exoskeleton of the bugs, and…",
  "data/reddit-know/r/YouShouldKnow/comments/n7ndua/ysk_that_hygiene_products_made_specifically_for.json": "Why YSK : because men versions are usually bigger at the same price or cheaper\nand they can do their job even better than the women versions. You are getting a\nbetter hygiene and be economical.",
  "data/reddit-know/r/YouShouldKnow/comments/n7pw1a/ysk_sometimes_big_chain_restaurants_use_different.json": "Why YSK: if you are trying to support small businesses it's important you double\ncheck it's not a big chain in disguise\n\nSource:\nhttps://www.getreading.co.uk/whats-on/food-drink-news/deliveroo-reading-truth-behind-fake-20540686",
  "data/reddit-know/r/YouShouldKnow/comments/n7qhla/ysk_that_spam_senders_have_recently_found_new.json": "Why YSK:\n\nSome signs to look for:\n\nErrors in spelling and punctuation\n\nExtra periods and symbols in return email addresses\n\nEmails that list your personal information like addresses or your email in the\nsubject line\n\nAn excessive amount of links in the message\n\nEmails that portend to address you…",
  "data/reddit-know/r/YouShouldKnow/comments/n7rtiv/ysk_there_is_no_such_thing_as_a_private_beach_in.json": "Why YSK: All beaches in California are public domain up to the mean high tide\nline with the exception of the beaches controlled by the United States Military.\nAlthough private properties may show obvious “No Trespassing” and/or “Keep Out”\nsigns, they are in fact illegal and not allowed by the…",
  "data/reddit-know/r/YouShouldKnow/comments/n7wlxz/ysk_recommended_nutrient_intake_is_in_excess_for.json": "Recommended daily allowances are two standard deviations above the mean,\nequalling the estimated average requirement, so that people on the right side of\nthe bell curve do not become deficient. For example, with protein intake, the\nrecommended amount for a 175 lb (80 kg) person is 64 g, but the mean…",
  "data/reddit-know/r/YouShouldKnow/comments/n84p90/ysk_placing_raw_vegetables_such_as_spring.json": "Why YSK: Many people can not bring themselves to eat vegetables, while mixing\nthem within a smoothie would allow more vegetables to be eaten in the same\nvolume as a non vegetable smoothie. Use banana as a sticky binder for the\nvegetables within the smoothie.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSome like me can eat…",
  "data/reddit-know/r/YouShouldKnow/comments/n872cp/ysk_if_you_arent_getting_the_answers_you_need.json": "Why YSK: People tend to put themselves on a pedestal when it has to do with a\nhobby that they are above average in. When they see what they call a \"newbie\"\nquestion, some will refer to google or FAQ(even if it isn't there) rather than\nactually help new comers to the hobby. They may feel that…",
  "data/reddit-know/r/YouShouldKnow/comments/n8l5te/ysk_waiting_2448_hours_to_report_a_missing_person.json": "Why YSK:\n\nHollywood has brainwashed a lot of people into thinking that the police will\nsimply shrug and say \"sorry, we can't do anything until so-and-so has been\nmissing for 48 hours\". This is absolutely not true, and an extremely dangerous\nlie.\n\nThe first hours after someone has been noted to be…",
  "data/reddit-know/r/YouShouldKnow/comments/n8pdkw/ysk_that_you_are_appreciated_never_forget_that.json": "Why YSK: Sometimes a few kind words can have a huge positive impact on someone's\nlife. Be kind to others and be kind to yourself. If you ever feel sad and alone,\nremember that RiverT from Reddit said that you are appreciated!\n\nHave a great life :)",
  "data/reddit-know/r/YouShouldKnow/comments/n8qn6c/ysk_most_organizations_advise_against_using_the.json": "Why YSK: This is unfortunately something always in the news, but the “CP” term\nhas been all over the place this past week with the arrest of Josh Duggar.\n\nPornography is media depicting adults engaging in sexual behaviors with the\nexpress purpose of causing arousal.\n\nAt best, “CP” is inaccurate. At…",
  "data/reddit-know/r/YouShouldKnow/comments/n9255i/ysk_huge_highranking_universities_like_mit_and.json": "Why YSK: While learning is not as passive as just listening to lectures, I have\nfound these resources invaluable in getting a better understanding of topics\noutside of my own fields of study.",
  "data/reddit-know/r/YouShouldKnow/comments/n9c333/ysk_you_can_learn_a_language_for_free_by.json": "Why YSK:\n\nI recently purchased a course in Italian from Living Language. It comes with 3\nworkbooks to follow along with during the audio lessons. The audio lessons are\nprovided via CD, but the website also states you can download the content if you\nprefer. What I didn't realize until today is that…",
  "data/reddit-know/r/YouShouldKnow/comments/n9dol6/ysk_the_stop_line_is_the_stop_sign.json": "Why YSK: Bottom line, that's where you stop.\n\nThis came up in another post. It was clear that there were differing opinions on\nwhat that thick line was supposed to represent. Even if the stop sign is another\n2 car lengths ahead of you, the line is where you make your stop. I am not so\nnaïve as to…",
  "data/reddit-know/r/YouShouldKnow/comments/n9gfo9/ysk_that_unless_you_optout_of_comcasts.json": "Comcast has a clause in their Residential Agreement\n(https://www.xfinity.com/Corporate/Customers/Policies\n/SubscriberAgreement?rid=9714273215&mid=20210508 Adhoc CM Crisis\nUpdatedResiSvcAgreement) that states that you as a customer agree to waive a\njudge and lawyers and instead replace it with an…",
  "data/reddit-know/r/YouShouldKnow/comments/n9mhhn/ysk_if_you_order_from_them_amazon_sellers_can_use.json": "Why YSK: To potentially limit unwanted ads.\n\nAfter getting ads mailed to me by Amazon sellers, I asked support if this is\nallowed since Googling yielded threads saying it violated their terms of\nservice, especially if it directed you to a site that isn't Amazon. Amazon\nsupport told me explicitly…",
  "data/reddit-know/r/YouShouldKnow/comments/na13eq/ysk_if_youre_in_the_bathroom_and_someone_knocks.json": "Why YSK: Common decency. Humans can't see through doors. Don't just sit there\nand not say anything and then be surprised when someone opens the door because\nthere was no response to the knock on the door that you forgot to lock.\n\nA simple \"Yeah\", or \"Just a minute!\" will be more than enough. Hell,…",
  "data/reddit-know/r/YouShouldKnow/comments/na3k6y/ysk_to_always_go_and_look_at_a_house_youre.json": "Why YSK: You should get a gauge of whether the soil gets heavily saturated or\nsuper-saturated during rain events. If your lawn is below the water table during\nflood events, it will be mushy, there will be standing water, and depending on\nhow quick it runs off, you could be living in relatively…",
  "data/reddit-know/r/YouShouldKnow/comments/na680s/ysk_dont_call_or_involve_your_insurance_company.json": "If something minor happens to something you have insured, DO NOT call or inform\nyour insurance company until you know for sure you're going to proceed with a\nclaim. It doesn't matter what type of insurance it is, house, car, boat,\nbusiness, travel, etc.... this applies to everything.\n\nWhy…",
  "data/reddit-know/r/YouShouldKnow/comments/nan4dg/ysk_that_if_youre_hoarding_gas_it_goes_bad_much.json": "Why YSK: people are starting to freak out and hoard gas, but it probably won't\ndo them much good if a shortage really does develop.\n\nWhile it varies a little based on composition (E15 goes bad faster than E10) and\nhow you store it, gas blended with ethanol\n[https://www.jdpower.com/cars/shopping…",
  "data/reddit-know/r/YouShouldKnow/comments/naorlf/ysk_that_restarting_your_pc_is_not_the_same_as.json": "Why YSK: Windows 10 has the feature \"Fast Startup\" enabled by default, which\nessentially puts the PC into a hibernation state instead of completely turning\nit off. When you Shut Down your PC, this feature enables it to start up faster\nlater.\n\nWhen you restart your PC, it completely turns off and on…",
  "data/reddit-know/r/YouShouldKnow/comments/nas163/ysk_used_pizza_boxes_are_almost_never_recyclable.json": "Why YSK: According to the City of San José\n[https://sanjoserecycles.org/guide/pizza-boxes/], \"Greasy pizza boxes\ncontaminate clean recycling and are expensive for the recycling industry: it’s\nestimated that contamination costs recyclers $700 million per year, because of\ndamaged machinery, the cost…",
  "data/reddit-know/r/YouShouldKnow/comments/natqa9/ysk_dont_forget_to_apply_sunscreen_on_cloudy_days.json": "Why YSK: Most clouds can at most block 50% of UV rays and thus sun rays can\nstill, unbeknownst to you, manage to damage your skin. 8000 Americans lose their\nlife to melanoma annually, try not to be one of them.\n\nSource [https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3364536/]",
  "data/reddit-know/r/YouShouldKnow/comments/nauwah/ysk_there_is_hope_in_overcoming_substance.json": "Sharing because 6 months ago I was addicted to nicotine, kratom, and alcohol.\nFor 2 years, I was using 2 cans of 6 mg zyn per day, 3 bottles of premium kratom\nextract per day, and a half bottle of whisky every night. I felt trapped and\nthat there was no hope of ever being able to stop.\n\nDisclaimer:…",
  "data/reddit-know/r/YouShouldKnow/comments/nawktg/ysk_if_you_sit_at_a_chair_for_hours_a_day_raise.json": "Why YSK: this will help prevent you from slouching to one arm rest for support\nand overall promote a more healthy resting posture.\n\nReference:\n\nhttps://www.physiomed.co.uk/uploads/guide/file/22/Physiomed_Sitting_Guide_-_Working_at_a_Desk_Digital.pdf",
  "data/reddit-know/r/YouShouldKnow/comments/nb7tbx/ysk_if_you_have_a_toothache_dont_wait_until_your.json": "Why YSK: when you wait to have a tooth looked at during your cleaning, you are\ntaking time away from your cleaning appointment and affecting the doctor's\ntightly packed schedule. Most dentists keep time set aside every day for urgent\ncare so it's best if you schedule a separate appointment with just…",
  "data/reddit-know/r/YouShouldKnow/comments/nbc3l1/ysk_gasoline_is_not_just_extremely_flammable_and.json": "Why YSK: The USA is currently experiencing a significant gasoline\nshortage/crunch, which is why many photos of people hoarding gasoline using\nplastic bags and other unsafe containers pop up on the internet, especially here\non Reddit. This post is not only a reminder that gasoline is flammable and…",
  "data/reddit-know/r/YouShouldKnow/comments/nbqyfv/ysk_if_someone_you_know_got_scammed_or_robbed_its.json": "Why YSK: Compassion and understanding can go a long way. At the time the person\ndoesn't want to hear that it was their fault. They are probably already beating\nthemselves up about that already. Saying what you believe to be \"good advice\" is\nnot constructive and probably will just make them more…",
  "data/reddit-know/r/YouShouldKnow/comments/nchvkj/ysk_the_weird_smelling_hand_sanitizer_that_has.json": "Why YSK: Everyone hates the smell of cheap drinking alcohol, but it's usually\ntoo late by the time you've put the sanitizer on your hands. A quick check\nbefore you buy or use a bottle of hand sanitizer will save you the bad\nexperience of smelling Crystal Palace for the next 15 minutes. I'm afraid…",
  "data/reddit-know/r/YouShouldKnow/comments/ndqev9/ysk_only_pouring_water_on_your_dog_to_cool_them.json": "Why YSK: This can weigh down the fur and create a layer of insulation that can\nincrease body temperature. If you are going to pour water on your dog please\nalso use fans/ventilation to utilize evaporative cooling.",
  "data/reddit-know/r/YouShouldKnow/comments/ndzskv/ysk_40_of_university_students_are_addicted_to.json": "Context: article\n[https://medlifestyle.news/2021/05/16/40-of-university-students-found-to-be-addicted-to-their-smartphone-study-says/]\n\nWhy YSK: Multiple studies have recently been published showing not only the\nincrease in 'smartphone addiction' amongst the general population, specifically\nwithin…",
  "data/reddit-know/r/YouShouldKnow/comments/ne1ag7/ysk_that_getting_frequent_car_washes_is_important.json": "Why YSK: The amount of dirt and grime that comes from the road builds up in\nplaces you wouldn’t think of. Plus people who live in areas that have snow/ice\non the roads deal with the salt that their respective municipalities or counties\nput on the roads to maintain them. Get a car wash at least once…",
  "data/reddit-know/r/YouShouldKnow/comments/neh0yl/ysk_if_youre_considering_seeking_professional.json": "Why YSK: I know a lot of people who have considered this, and one of the most\ncommon things that held them back was the thought that they weren't feeling bad\nenough to have the right to seek and receive help. It's important to recognize\nyour thoughts and feelings as real, and the fact that some…",
  "data/reddit-know/r/YouShouldKnow/comments/neyc8s/ysk_bbq_brushes_with_metal_bristles_are_deadly.json": "Why YSK: The small wire pieces can break off and be ingested, and those little\nshards can cause significant damage to your body, and require emergency surgery\nfor perforated organs. Keep your family safe this summer and use a plastic (or\nwood, as others have pointed out) BBQ brush.\n\nArticle…",
  "data/reddit-know/r/YouShouldKnow/comments/nf0sbo/ysk_for_a_successful_relationship_its_not_just.json": "Why YSK: Everyone is saying that relationships require compromises. Healthy\nrelationships should be based on support and understanding, therefore\ncompromises should aim to better each other and the relationship. Admitting\nmistakes and character weaknesses is difficult but leads to character…",
  "data/reddit-know/r/YouShouldKnow/comments/nf2icd/ysk_that_if_you_have_medical_debt_from_a_non.json": "Why YSK: It does not matter how old the debt is or if it was sent to\ncollections. It doesn't even matter if you had insurance when the bill was\ncreated. As long as the non profit hospital owns the debt and it wasn't sold off\nthen you'll be eligible for financial assistance if you can't afford to pay…",
  "data/reddit-know/r/YouShouldKnow/comments/nfavm4/ysk_when_you_ring_your_utilities_company_or.json": "Why YSK - Having worked in these industries a lot during my twenties I'd say\nabout 95% of the employees hated their job and the company purely because of the\nway they tend to treat their employees. These companies tend to screw over the\ncustomers and their staff.\n\nAlthough you might be frustrated…",
  "data/reddit-know/r/YouShouldKnow/comments/nfuqlf/ysk_if_you_are_sad_that_avatar_the_last_airbender.json": "And no, I am not talking about Korra. I am talking about the underclaimed show,\nThe Dragon Prince. This show has many of the same writers and voice actors as\nAvatar, and has an amazing plot and animation style. It is on Netflix and I have\nno idea why it isn't promoted better.\n\nWhy YSK: People are…",
  "data/reddit-know/r/YouShouldKnow/comments/nfuzgs/ysk_you_can_easily_control_the_text_cursor_on.json": "Why YSK: When trying to edit posts on Reddit, or trying to fix a typo in a link\non your mobile web browser, it can be a pain since you can’t really see the\ncursor and when you let go of the cursor it snaps to odd places. Holding down\nspacebar on the iPhone keyboard and moving your thumb around gives…",
  "data/reddit-know/r/YouShouldKnow/comments/ngklcz/ysk_how_your_credit_score_is_actually_calculated.json": "Why YSK: There is a lot of bad guidance floating around about what you should\nand should not do with regards to credit.\n\nThis post will focus on the FICO Score since it is the most prolific type of\ncredit score used today. So, what is a FICO score? First, FICO stands for the\nFair Isaac Corporation.…",
  "data/reddit-know/r/YouShouldKnow/comments/ngni7j/ysk_notorious_means_famous_for_a_bad_reason.json": "Why YSK:\n\nUnless you're talking Christopher Wallace, if you say that someone is\n\"notorious\" that implies that what they're known for is some well-known fault or\nreprehensible action. Nobody wants to insult someone they meant to lift up.\nInstead, if you want to compliment someone, use \"acclaimed\",…",
  "data/reddit-know/r/YouShouldKnow/comments/nh05u7/ysk_that_washers_need_to_be_drained_before_you.json": "Why YSK: Not draining a washer before it is stored or moved will not only make\nit heavier, but it will cause water to stagnate and mold inside the tank. Even a\nlittle bit of moisture in storage can wreck your whole world. All you have to do\nis put a shop vac hose on the black drainage hose on the…",
  "data/reddit-know/r/YouShouldKnow/comments/nhaxni/ysk_many_universities_have_surplus_department.json": "Why YSK: Furnishing a new place can be expensive, and Universities always have\nstuff to get rid of. Sometimes even cool vintage stuff. At my local U surplus,\nI've seen everything from basic office supplies, file cabinets, monitors, desks,\nto pianos and weird old lab equipment. It's a crap-shoot, and…",
  "data/reddit-know/r/YouShouldKnow/comments/nhlefq/ysk_sleep_is_not_an_optional_lifestyle_luxury.json": "Why YSK: Matthew Walker, an expert on the subject of sleep, said that sleep is a\nnon-negotiable biological necessity.\n\nBut some people don't care about their sleeping schedule which not only affects\ntheir professional life but personal life as well.\n\nIf you don't know how it affects our day-to-day…",
  "data/reddit-know/r/YouShouldKnow/comments/nhus2x/ysk_the_car_warranty_scam_calls_are_about.json": "Why YSK: You Should know this to defend yourself from the scam if you're\nsusceptible to it, if you're not you should know so you can help make it an\nunviable scam.\n\nStep 1.) Spoof a number from the targets area, read your script about their\nextended warranty\n\nStep 2.) Collect Make of vehicle and…",
  "data/reddit-know/r/YouShouldKnow/comments/ni9dvv/ysk_when_huge_companies_like_amazon_banks_and_etc.json": "Why YSK: Advertisements will often try to change your view of large companies by\nshowing imagery of tiny, home businesses, and family owned/operated business\nthat they are supposedly helping but when they make claims of their involvement\nwith \"small businesses\" they're usually using the definitions…",
  "data/reddit-know/r/YouShouldKnow/comments/nifwwv/ysk_that_powerful_bass_and_terms_alike_are_just_a.json": "Why YSK : Your headphones should represent your music well, not alter it. Not to\nmention that you could get better sound by just avoiding brands with such\nmarketing. Always check headphones sound signature on websites like rtings and\nsoundguys. Detail is also very important",
  "data/reddit-know/r/YouShouldKnow/comments/nikcds/ysk_selfreflection_can_actually_make_your_mental.json": "Why YSK: Self-reflection is considered one of the keys to self-development,\nmental well-being and improvement in therapy. However, research shows\n[http://selfcontrol.psych.lsa.umich.edu/wp-content/uploads/2016/12/1-s2.0-S0065260116300338-main-2.pdf]\nthat if you do it the wrong way, it can actually…",
  "data/reddit-know/r/YouShouldKnow/comments/nio494/ysk_if_youre_using_more_than_one_tin_of_paint_you.json": "If you’re needing to cover a large surface and going to use multiple tins you\nshould mix them together before hand rather than using one and opening another\nas you’ll be able to see the slight differences next to one another and doing\nthis makes the paint job look more uniform.\n\nWhy YSK: Even though…",
  "data/reddit-know/r/YouShouldKnow/comments/niuwil/ysk_the_three_sets_numbers_on_the_inside_arm_of.json": "WHY YSK:\n\nA frame that is too narrow will make your face look wider, while a frame that is\ntoo wide will make your face look narrower. This is one of the most important\nfactors in finding a pair of glasses that fits well. Find a frame that is\nslightly wider than your face — no more than a finger…",
  "data/reddit-know/r/YouShouldKnow/comments/niynqn/ysk_that_stevia_and_ragweed_are_from_the_same.json": "Why YSK: Stevia can give people with Ragweed allergies the same type of (or\nworse) allergic reaction as Ragweed.\nhttps://www.marconews.com/story/life/2018/10/08/ask-pharmacist-allergic-connection-between-stevia-and-ragweed/1525152002/",
  "data/reddit-know/r/YouShouldKnow/comments/nj2o5z/ysk_crying_actually_makes_you_happier.json": "Why YSK: crying releases pheromones which serves as an auto mood-lifter! Never\nbe afraid to cry!",
  "data/reddit-know/r/YouShouldKnow/comments/nj76du/ysk_if_you_give_two_weeks_notice_at_work_they.json": "Why YSK: if you get sent away on the same day as giving notice, your boss might\nbe hoping you don’t realize you are owed this pay.\n\nIf an employer includes a requirement for notice in their contract or employee\nhandbook then the law in most states (US) require they pay out for those two\nweeks even…",
  "data/reddit-know/r/YouShouldKnow/comments/njdb5l/ysk_documentaries_can_be_extremely_misleading.json": "There's an \"interestingasf*ck\" post stating a Monk had to be \"retested\" in 3\nyears if he failed his \"test\" regarding a particular stance/moves.\n\n\n\nIt's an extreme exaggeration. A lot of the information in the documentary\nrelating to it was greatly exaggerated or just plain wrong.\n\n\n\nWhy YSK: Taking…",
  "data/reddit-know/r/YouShouldKnow/comments/njlxej/ysk_smoking_and_vaping_significantly_increases.json": "The chemicals in cigarettes cause poor circulation, doubling a man's chances of\ngetting erectile dysfunction. Because nicotine constricts blood vessels, vaping\nit can also cause erectile dysfunction.\n\nWhy YSK: Many people talk about the future risks of cancer with smoking. But\nthere are a ton of…",
  "data/reddit-know/r/YouShouldKnow/comments/njsj9t/ysk_most_fridgesfreezers_are_safe_to_transport_on.json": "Why YSK: I know a lot of people who have complained about how they broke their\nfridge after they did this, and know even more people who choose to just leave\nbehind/sell their fridge when they move because of what a hassle it is to\ntransport. Knowing how a fridge/freezer works will save you money…",
  "data/reddit-know/r/YouShouldKnow/comments/nk163d/ysk_that_if_you_drive_for_doordash_uber_eats.json": "Why YSK: A lot of people don't know that if you deliver for these apps, your\ninsurance company will not cover you if an accident occurs while your app is\nrunning.\n\nMoreover, while companies like Doordash or Grubhub have their own liability\ninsurance, what many drivers don't realize, is that this…",
  "data/reddit-know/r/YouShouldKnow/comments/nkm3s5/ysk_cicadas_cant_bite_you_they_dont_even_have.json": "Cicadas don't eat; they only consume food in their larval stage. When they grow\nup into what we call cicadas, their body does not even have a \"mouth\". When they\nrun out of energy, they do some final death cries and drop dead. So don't be\nafraid, they literally can't bite you! They do have a…",
  "data/reddit-know/r/YouShouldKnow/comments/nkpsr7/ysk_on_food_labels_the_first_ingredient_listed_is.json": "Why YSK:\n\nFor example, here's the ingredients list for Danone's Dannon Fruit on the Bottom\nYogurt\n[https://www.danoneawayfromhome.com/food-service-products/brand-dannon-fruit-on-the-bottom-strawberry-5-3oz/]:\n\n> Milk, Sugar, Raspberry Puree, Water, Modified Food Starch, Contains Less Than\n> 1% Of…",
  "data/reddit-know/r/YouShouldKnow/comments/nkrlgq/ysk_you_shouldnt_feel_guilty_about_playing_games.json": "At the recent global conference on human-computer interaction (CHI), an AI\nresearcher presented a new free app [http://betwixt.life/] as the next wave in\nmental health innovation and it was described as a cross between the game\nLifeline and Lord of the Rings.\n\nThe idea behind it apparently came from…",
  "data/reddit-know/r/YouShouldKnow/comments/nkxmsk/ysk_that_the_phrase_reduce_reuse_recycle_is_in.json": "Why YSK: Recycling is expensive, and sometimes the product ends up in a landfill\nanyway\n[https://www.theguardian.com/us-news/2019/jun/21/us-plastic-recycling-landfills].\nBuying less junk or reusing things yourself are better for the environment than\nrecycling.\n\nReusing a product is also better than…",
  "data/reddit-know/r/YouShouldKnow/comments/nl0bar/ysk_that_there_is_an_animal_poison_control_number.json": "Why YSK: Time can be very critical when it comes to an accidental poisoning. You\nare connected to a member of the ASPCA Poison Control who can walk you through\nany necessary things you can do or if you need to take your pet to the vet. I\nunfortunately had to utilize this yesterday after my dog got…",
  "data/reddit-know/r/YouShouldKnow/comments/nl0k35/ysk_that_when_using_websites_that_limit_you_to_a.json": "Why YSK: Certain sites like the NYTimes limit users to 3-5 free articles a\nmonth, and require a subscription to read more. By copying and pasting the link\ninto an incognito tab, you bypass this and can read an unlimited amount of\narticles. Still, if you can, it's better to subscribe to support the…",
  "data/reddit-know/r/YouShouldKnow/comments/nlep8l/ysk_your_library_has_more_than_books.json": "Why YSK: This recent comment\n[https://www.reddit.com/r/AskReddit/comments/nkwaqy/whats_a_free_resource_available_to_everyone_that/gzf3x0l?utm_source=share&utm_medium=web2x&context=3]\ninspired me to go to my library. Besides \"books\" (and one hottie librarian), my\nmain library has classes such as art…",
  "data/reddit-know/r/YouShouldKnow/comments/nm0vaz/ysk_apple_has_much_nicer_alarm_ringtones_in_the.json": "Why YSK: Most of us use the clock app for our morning alarms, with crappy\nringtone options that only scare us awake and make us hate the sound, but I\nrecently found that in the health app (which comes with the iPhone) there is a\nsleep section where you can set your sleeping schedule, and choose from…",
  "data/reddit-know/r/YouShouldKnow/comments/nm85br/ysk_to_avoid_feeling_victimized_by_problems_you.json": "At the recent global conference on human-computer interaction (CHI), an AI\nresearcher presented a new free app [http://betwixt.life/] as the next wave in\nmental health innovation and it was described as a cross between the game\nLifeline and Lord of the Rings.\n\nThe idea behind it apparently came from…",
  "data/reddit-know/r/YouShouldKnow/comments/nmqvkj/ysk_that_the_average_residential_oven_is_rarely.json": "Why YSK: your oven face plate temperature scale is printed on a piece of metal\nin a production line that's not really accurate. Baking and cooking have core\ntemps for a reason. Your flopped Japanese cheesecake or overcooked muffins but\nundercooked in the middle may not be entirely your fault.",
  "data/reddit-know/r/YouShouldKnow/comments/nmr2h5/ysk_seizure_treatment.json": "Why YSK: Whenever you see someone having a seizure whilst there are people\naround them panicking, you have to tell them all to stay clear as crowding will\nmake the person panic and make it hard to breathe. Next, you lay them on their\nside so they can breathe and get rid of foam because that can…",
  "data/reddit-know/r/YouShouldKnow/comments/nmsc8c/ysk_captcha_requests_linked_to_feeding_data_to.json": "This is in response to a recent YSK discussing CAPTCHA requests that are used to\nhelp build out AI systems.\n\nWhy YSK: Because, if you do not want to participate in giving free labor to some\nservice to build an AI to be used for who knows what purpose, I imagine it is\nyour right to refuse.\n\nThis may…",
  "data/reddit-know/r/YouShouldKnow/comments/nn75g5/ysk_your_vhs_tapes_and_home_movies_have_a_short.json": "Why YSK : VHS tapes were not meant to last forever and every day that goes by is\none day closer to your precious memories being lost forever. Old VHS tapes and\nhome movies are in danger of being destroyed by mold, age and ribbon\ndeterioration. There are companies all over the world that will…",
  "data/reddit-know/r/YouShouldKnow/comments/nnj14f/ysk_your_mental_imagery_of_drownings_is_probably.json": "Hi, r/YouShouldKnow [/r/YouShouldKnow]! I was a lifeguard for 5 years,\neventually working my way up to running my city’s biggest aquatic facility with\n20+ lifeguards on staff working under me at any given time. With Memorial Day\ncoming up (the start of the summer season for my organization) and…",
  "data/reddit-know/r/YouShouldKnow/comments/np5qt5/ysk_how_to_clutch_your_assignments_last_min.json": "why YSK: you have an assignment due very soon this will help you finish them on\ntime or get the grade.\n\nthis isn't about long-term procrastination. if you can stop, stop asap. these\ntips only work in a hinge and overusing them will get you in trouble as they get\nless effective every time.\n\n3 tips +…"
}