{
  "data/reddit-ask/r/AskHistorians/comments/qjv0j1/historians_rightly_point_out_that_cortés_invasion.json": "I ask because I am a high school teacher and am having a hard time articulating\nan alternative to the simplistic story I was taught (Jared Diamond's description\nof the conquest of the Incan Empire showed up in not one but two of my K-12\nhistory classes). I read \"Seven Myths of Spanish Conquest\" on…",
  "data/reddit-ask/r/AskHistorians/comments/qjxwko/gary_webb_famously_died_of_two_gun_shot_wounds_to.json": "Its pointed to as one of the clearer cases of CIA intervention as revenge for\nWebb revealing damaging secrets about the agencies involvement in drug\nsmuggling. From what I can tell information about how deep the connection goes\nis classified even while we know smuggling was permitted with Contras…",
  "data/reddit-ask/r/AskHistorians/comments/qjyqtl/marcus_aurelius_is_probably_the_most_well_known.json": "His writings such as 'Meditations' are some the most well known writings on\nancient stoicism and give an insight into his thought process and outlook on\nlife, but do we know of any policies that he enacted or of any major actions he\ntook as emperor that can be attributed to his stoic…",
  "data/reddit-ask/r/AskHistorians/comments/qk6v3s/why_was_pederasty_so_relatively_common_in_past.json": "I don't think it requires much research to tell that pedophilia, whether\nconsidered a harmful mental disorder or not, is extremely uncommon. So why was\nit apparently considered normal in societies like those of ancient Greece and\nRome? Even if it wasn't viewed as sexual abuse, you would expect such…",
  "data/reddit-ask/r/AskHistorians/comments/qkalsm/when_and_why_did_blue_become_the_dominant_colour.json": "Is it cheaper to produce or is there a more complicated reason for its\npopularity?",
  "data/reddit-ask/r/AskHistorians/comments/qkcdhl/im_dr_toby_capwell_here_today_to_talk_about_arms.json": "Hello everyone, I’m Toby Capwell, Curator of Arms and Armour at The Wallace\nCollection in London, UK, and an academic specialist in medieval and Renaissance\nweapons and armour. I am an author of various books and articles on this\nsubject, most notably the Armour of the English Knight series, of…",
  "data/reddit-ask/r/AskHistorians/comments/qkdhi8/megathread_roe_v_wade_and_abortion_in_america.json": "On June 8th, 1964, an employee at the Norwich Motel in Norwich, Connecticut\nopened the door to one of the rooms and discovered an unresponsive woman\nkneeling on the floor, her cheek pressed to the carpet, bloody sheets and towels\nbetween her legs. When the police and ambulance arrived, they declared…",
  "data/reddit-ask/r/AskHistorians/comments/qkm3ev/why_did_american_founders_direct_all_of_their.json": "This might be me completely misreading history, but by the time of George III,\nthe British Monarch had already largely been relegated to the symbolic role we\nthink of today. So why did the American Founding Fathers direct all of their\nanger and grievance towards him, when it was parliament that was…",
  "data/reddit-ask/r/AskHistorians/comments/qkp0es/could_your_typical_soldier_in_an_18th_or_early.json": "Up front disclaimer: simply due to keeping the title a decent length I couldn’t\nspecify that I’m fully aware that in most battles, the large majority or\nsoldiers would be unhurt, and that usually a battle is won after a relatively\nsmall portion of the force is killed or wounded. I’m not suggesting…",
  "data/reddit-ask/r/AskHistorians/comments/qkz5rk/were_there_any_reports_of_a_monster_at_the_battle.json": "Firstly, I'll preface this by saying I am a historian, and I have exhausted my\nown skill set looking into this. I've found absolutely nothing whatsoever and I\nonly ever run into the medium that I heard about it on. Secondly, I'm aware that\nthis could just be a REALLY good piece of…",
  "data/reddit-ask/r/AskHistorians/comments/ql7gk5/were_the_wildmen_of_european_folklore_a_cultural.json": "I was reading about the wild men dance of a town in Bavaria that can be dated\nback to Celtic times. Jumping around, I saw that there is a Swiss myth about\npeasant farmers capturing wild men to get their knowledge which echos Roman\nstories also.\n\nIt makes intuitive sense that if there stories are…",
  "data/reddit-ask/r/AskHistorians/comments/ql95ob/what_would_enslaved_peoples_do_throughout_the_day.json": "I was reading a biography on James Madison and it mentioned that he brought an\nenslaved person to college with him that he had inherited. I know Jefferson also\nbrought an enslaved person to college with him. That got me wondering what\nexactly the enslaved person would do all day in relation to the…",
  "data/reddit-ask/r/AskHistorians/comments/qlc7a6/did_hh_holmes_really_build_a_murder_labyrinth_or.json": "The more colorful version of this 19th Century serial killer's life is that he\nhad a \"murder castle\" created; a hotel with confusing architecture, rooms\ndesigned to kill their occupants, trapdoors to drop corpses down into the\ncellar, and so on. Another version I've heard is that Holmes just wasn't…",
  "data/reddit-ask/r/AskHistorians/comments/qlsb2w/why_are_us_state_capitals_often_smaller_towns.json": "As a non-American, it's easy to make assumptions about what state capitals are\nin the US based off the largest and most famous cities there: surely, one might\nassume, NY is NYC, California is LA, Washington is Seattle, Florida is Miami,\nOregan is Portland, Louisiana is New Orleans, Illinois is…",
  "data/reddit-ask/r/AskHistorians/comments/qlt3wn/why_did_western_clothing_become_the_norm_in_most.json": "If you walk down any street in most non-Western countries today, you'll notice\nthat most people regardless of ethnicity, religion or occupation wear Western\nclothes.\n\nBut less than a hundred years ago, it wasn't too uncommon to see most people in,\nsay India [https://youtu.be/SamNTXQrkuk] or Korea…",
  "data/reddit-ask/r/AskHistorians/comments/qm0ovo/medieval_christian_scholars_believed_that_each_of.json": "I can't seem to find anything on where indigenous Australians fit into this\ngenealogy. It seems Native Americans were placed under the line of Shem, but I'm\nunclear of what the basis for that is?\n\nTangential side-question: did Jewish or Islamic scholars have the same theories\nand reactions, or were…",
  "data/reddit-ask/r/AskHistorians/comments/qm6b5p/when_did_christians_stop_believing_dragons_were.json": "Obviously, dragons are now considered mythical, but at one point, Christians\nfirmly believed they were real. So how did we get from there to here? Was it\ngradual? Or was there a tipping point?",
  "data/reddit-ask/r/AskHistorians/comments/qmfzbz/did_people_in_the_70s_not_realise_the_village.json": "When homophobia was more rampant, did typical suburban housewives really believe\nthat camp performers were straight? Or was it always an open secret?\n\nWhat historical evidence is there about this transitory point in social\nattitudes?\n\nThanks",
  "data/reddit-ask/r/AskHistorians/comments/qmk6cz/when_i_was_a_student_in_a_private_religious.json": "My parents were pastors in a... fairly unique church when I was a child. The\nchurch also ran a small school, which I attended until I was twelve (when we got\nkicked out.) In addition to the expected skepticism of evolution and climate\nchange, several other scientific ideas were held in contempt. I…",
  "data/reddit-ask/r/AskHistorians/comments/qmltmd/how_do_professional_historians_explain_the_causes.json": "I was raised Shi'ite*, so what I was taught growing up was that Ali was\nappointed the successor by Muhammad, but there was a coup by Umar and Abu Bakr\nafter the Prophet's death, denying Ali his rightful inheritance, so to speak.\nAnd then after some time, the first Ummayad Caliph, Mu'auiyah** killed…",
  "data/reddit-ask/r/AskHistorians/comments/qmmamy/how_did_paisley_become_the_archetypal_pattern_for.json": "Bandanas with a paisley pattern are seemingly ubiquitous, being even more common\nthan even a plain colored cloth. How did this come to be? Is it the result of\nmass manufacturing?\n\nHave there been other historically popular patterns?",
  "data/reddit-ask/r/AskHistorians/comments/qmnur4/the_first_world_war_was_a_politically.json": "I had a professor claim soldiers who were captured by the Russians were often\nsuccessfully radicalized to Communism, and I am curious how well this notion is\nsupported. It would obviously be hard to disentangle cause and effect, for\nexample: the rank-and-file Navy was a consistent hard-left force,…",
  "data/reddit-ask/r/AskHistorians/comments/qmojd8/a_popular_meme_states_that_nazi_germany_and_the.json": "The meme in question:\nhttps://imageproxy.ifunny.co/crop:x-20,resize:640x,quality:90x75/images/3710a6307bcf7313312e689717b4ec0269f048a8b1f6d9cd308e5ef9fbe10c9d_1.jpg\n\nIs this document real?",
  "data/reddit-ask/r/AskHistorians/comments/qmq7vo/did_any_slave_owners_in_the_us_see_the_writing_on.json": "Were there any US slave owners in the 1800s who foresaw that their time being\nable to legally own slaves was running out? Did any of them liquidate their\n'property' while they could still do so at competitive market prices?",
  "data/reddit-ask/r/AskHistorians/comments/qn5qbj/in_ww2_did_antiaircraft_weaponry_fire_so_many.json": "I searched through older questions and couldn't find any asking about this\nspecifically.\n\nOf course the chance to hit a target is increased by increasing volume of fire,\nbut were armoured planes of the era able to withstand many impacts from AA\nweapons?\n\nI'm trying to understand the effectiveness of…",
  "data/reddit-ask/r/AskHistorians/comments/qn69p8/why_is_the_us_seemingly_the_only_country_that.json": "I’ve read that, for example, the French government pushes back against this\npractice because they want to ensure a coherent French national identity. Do\nother countries share a similar belief? Is there a reason the US in particular\nseems to place so much emphasis on national/racial origin?",
  "data/reddit-ask/r/AskHistorians/comments/qn7zyc/what_was_the_part_2_to_gunpowder_plot.json": "On the 5th of November 1605 a group of English Catholic conspirators attempted\nto blow up the Houses of Parliament with King James and the joint chambers\ninside. This would have left a huge power vacuum with plenty of unknown\nconsequences. Did the conspirators have an after plan? How would they…",
  "data/reddit-ask/r/AskHistorians/comments/qnl2w6/whenever_i_watch_a_cartoon_or_movie_that_has_a.json": "If so, what culture does it originate from and why did they use a crystal ball\nspecifically? Was there any “logic” behind it or does it just look cool and\nmysterious?",
  "data/reddit-ask/r/AskHistorians/comments/qno47a/did_the_roman_republic_fall_due_to_vast_economic.json": "As far as I know, the Roman Republic's decline began with the dictatorship of\nSulla, continued with the dictatorship of Caesar and famously ended with the\nbeginning of the rule of Octavian as the first Augustus.\n\nWhat these eras seem to have in common is rising inequality between the upper\nclasses…",
  "data/reddit-ask/r/AskHistorians/comments/qnu2cr/in_the_japanese_navy_sailors_reacted_to_additions.json": "The above quote is from Beriberi, Beriberi Medicine, and Medical Authority in\nPrewar Japan by Alexander Bay. Rations of polished white rice were (correctly)\nthought to be responsible for the high incidence rates of beriberi, but Takaki\nKanehiro's initial \"Western-style\" bread-and-meat rations were…",
  "data/reddit-ask/r/AskHistorians/comments/qnyy9j/martin_luther_writes_the_95_theses_in_1517_less.json": "Religious beliefs are strongly felt and key to people’s every day lives. How\ncould it be that this shift was so large even among the general population?\n\nAnd of course why was this change so large in England and Scotland but not in\nIreland? If the argument is one of brute force, the monarchy was…",
  "data/reddit-ask/r/AskHistorians/comments/qnzapg/if_the_conditions_of_the_city_and_industrial.json": "What was happening out in the countryside that made it so people found the\nconditions of the factories and cities preferable during the Industrial\nRevolution? What forced people to make the decision to endure life in the\nfactories and cities?",
  "data/reddit-ask/r/AskHistorians/comments/qnzluv/adultery_changed_from_being_one_of_the_most.json": "Flog the adulteress and the adulterer, each one of them, with a hundred lashes.\nLet no pity for them cause you to disobey God, if you truly believe in God and\nthe Last Day; and let their punishment be witnessed by a number of believers.\n[Quran 24:2]\n\n\n\nThou shalt not commit adultery [Exodus…",
  "data/reddit-ask/r/AskHistorians/comments/qoalyc/what_caused_casual_clothing_to_rise_and_replace.json": "Looking at countries like America or Britain, from the 1700s until WWII, people\nseemed to wear much more formal or fancy clothes. But then after WWII, starting\nin the mid 1900s, this seemed to change until now, where sweatpants and hoodies\nare common. What caused this?",
  "data/reddit-ask/r/AskHistorians/comments/qocvks/how_do_we_know_cave_men_lived_poor_lives_almost.json": "I was reading the Wikipedia article on the Lion-man figurine\n[https://en.wikipedia.org/wiki/Lion-man] and there is this quote: \"... so why\nwould a community living on the edge of subsistence, whose primary concerns were\nfinding food, keeping that fire going, protecting children from predators,…",
  "data/reddit-ask/r/AskHistorians/comments/qohguo/the_world_turtle_was_a_common_belief_that_the.json": "How can completely separate cultures that had no contact converge onto the world\nturtle? I look at the geography and I struggle to see a turtle anywhere. Even\nNorth America which was said to be \"in the shape of a turtle\" looks nothing like\na turtle.\n\nAm I taking the \"world turtle\" too literally or…",
  "data/reddit-ask/r/AskHistorians/comments/qomodk/in_the_bible_moses_and_an_egyptian_pharaoh_were.json": "I couldn’t find any sources that didn’t involve using the Bible as proof of\nthese series of events. I’m curious if the Egyptians ever recorded some or all\nof these events in their perspective. In my eyes, any source outside the Bible\nmakes the story of Moses more credible. Is the story of Moses,…",
  "data/reddit-ask/r/AskHistorians/comments/qoqmvs/why_would_the_devil_appear_in_a_mediæval_english.json": "I was reading a sermon for the feast of St. Matthias\n[https://books.google.com/books?id=1bQLAQAAIAAJ&printsec=frontcover&dq=early+english+text+society+festial&hl=en&newbks=1&newbks_redir=0&sa=X&ved=2ahUKEwjqoemQ_PrzAhV3STABHf45ADYQ6AF6BAgGEAI#v=onepage&q=hory%20&f=false]\nfrom the Festial of John…",
  "data/reddit-ask/r/AskHistorians/comments/qor89c/how_has_the_introduction_of_the_trailer_house.json": "So what I've gathered, the classic trailer house was introduced around the 1950s\nand was marketed as the \"home of the future\" that would be cheap, comfortable,\nand everywhere.\n\nCurrently, trailer house communities \"trailer parks\" have an unsavory\nreputation.\n\nIn my rural area, it's very common to…",
  "data/reddit-ask/r/AskHistorians/comments/qot5ns/in_saving_private_ryan_1998_tom_hanks_b_1956_and.json": "Even if we assume they're both playing a bit younger, that still puts the\ncharacters in the 38-45 range. This contrasts with other accounts I've heard of\nmen in their mid-20s being referred to as \"Grandpa\", suggesting that most men in\ncombat roles were between 18-23.\n\nAs an aside, it seems that…",
  "data/reddit-ask/r/AskHistorians/comments/qp1ceu/how_prevalent_was_the_anastasia_survival_myth_in.json": "As a Westerner born after the collapse of the USSR, it seems that the Anastasia\nsurvival myth was quite popular this side of the Berlin Wall (given the various\nmovies, plays, books and imposters) but how prevalent was the myth in the Soviet\nUnion itself?\n\nI realize that answering this question may…",
  "data/reddit-ask/r/AskHistorians/comments/qp2the/why_didnt_north_korea_reform_its_economy_in_the.json": "China and Vietnam's economic reforms are largely credited with rapid economic\ngrowth and increases in quality of life/standard of living. This begs the\nquestion, why didn't North Korea open up their economy if all their ideological\ncounterparts in East and South East Asia did so and to a great…",
  "data/reddit-ask/r/AskHistorians/comments/qp3n1f/in_tolstoys_confession_he_says_that_he_has.json": "I've been wondering about it since I read the book a few months ago, I haven't\nbeen able to find anything about Tolstoy being a criminal or a murderer, It\ncould simply be a turn of phrase or artistic license. I know that he served in\nthe Russian army during the Caucasian War, maybe he's referring to…",
  "data/reddit-ask/r/AskHistorians/comments/qp4me5/did_ben_franklin_ever_talk_about_chili.json": "like the stew with beans",
  "data/reddit-ask/r/AskHistorians/comments/qpa7zq/on_december_15_1970_the_ussrs_venera_7_probe.json": "And if the US did plan any similar missions, why did they not pull through?\n\nEdit: I was misinformed about Venera 7 being the only mission to successfully\ntransmit data from the surface of Venus, as there were later Venera missions\nthat were able to do so.",
  "data/reddit-ask/r/AskHistorians/comments/qpd9k0/is_there_any_reason_why_homer_consistently_refers.json": "I understand cultures have different interpretations of colours, particularly\nblues and greens, with some languages having no native words to differentiate\nthe two. But Homer's Iliad repeatedly refers to black blood. Why is this? Fresh\nblood from a wound is quite clearly red.",
  "data/reddit-ask/r/AskHistorians/comments/qprv6a/in_midsummer_nights_dream_theseus_decides_to.json": "I remember also hearing similar stories of an opera singer around the end of the\n19th century. Curious if this \"tradition\", of engaging in entertainment\nspecifically to laugh at its incompetence, has a longer history. Were there\nfamously bad Roman gladiators? Terrible plays in Ancient Greece to give…",
  "data/reddit-ask/r/AskHistorians/comments/qpvlu4/how_byzantine_was_byzantine_government.json": "Wiktionary defines \"byzantine\" as meaning \"Overly complex or intricate\" or \"Of a\ndevious, usually stealthy, manner or practice\".\n\nCollins Dictionary specifically lists it as \"criticis[ing] a system because it\nseems complicated or secretive.\"\n\nI am aware that the administration of the Eastern Roman…",
  "data/reddit-ask/r/AskHistorians/comments/qq192b/my_japanese_grandmother_is_labeled_as_white_on_my.json": "So, context: My grandmother and grandfather met in Japan after ww2, got married,\neventually moved to USA (Georgia) around 1960 with my uncle, and had several\nmore kids. My mother and all her siblings were born before Loving vs. Virginia\n(1967) and were raised in Georgia.\n\nI recently looked at my…",
  "data/reddit-ask/r/AskHistorians/comments/qq3jg5/with_the_recent_travis_scott_event_in_mind_how.json": "I know it gets exaggerated to upwards of 1.5 million, and it definitely looks\nlike it from the videos of the crowd.\n\nBut somehow this enormous grouping of people, most of whom have never been to a\nmetal concert in their life, managed to have fun without any deaths occurring as\na result of the…",
  "data/reddit-ask/r/AskHistorians/comments/qq3sj8/its_the_middle_of_the_night_and_the_ku_klux_klan.json": "EDIT: To add more details:\n\nLet's assume 3 different scenarios:\n\n1) I fire into the air to let them know I am armed.\n\n2) I fire and injure someone. Do I now have evidence for self-defense? Bob just\ncoincidently got shot in the shoulder last night . . .\n\n3) I fire and kill a Klan member. I just…",
  "data/reddit-ask/r/AskHistorians/comments/qq5zps/just_how_good_to_the_modern_palate_was_food_at_c.json": "Delmonico's (in its mid-19th century incarnation) was the first a la carte\nrestaurant in New York City, and insanely fashionable (it has its own steak cut\nnamed after it, for example). It's the kind of place that Dickens and Mark Twain\n[https://gothamist.com/arts-entertainment/flashback-how-mark…",
  "data/reddit-ask/r/AskHistorians/comments/qq9ztt/in_medieval_times_how_often_did_combat_not_take.json": "Been doing a bunch of reading about the 11th century as part of a project I’m\nworking on about the War of 1066, so I’ve been broadly reading about key events\nthat happened in general from like 600-1400 or so. And it seems like the more\ndeeply you dive into it the more often you come across instances…",
  "data/reddit-ask/r/AskHistorians/comments/qqfaal/most_50_people_i_know_in_europe_describe_the.json": "This may mean nothing, but the more I speak with baby boomers around me, and the\nmore they pinpoint the 1970s as the decade where \"many of the old ways were\nlost\".\n\nAt first I thought \"70s\" may just be shorthand, but the repetition is\nintriguing. Could there be a generational explanation for this?…",
  "data/reddit-ask/r/AskHistorians/comments/qqsn3n/what_happened_to_alexander_the_greats_bloodline.json": "Are there any living descendants of his ?\n\n\n\nAre there any known examples of people claiming to be his descendants ?",
  "data/reddit-ask/r/AskHistorians/comments/qqy8nf/how_realistic_is_the_portayal_of_the_draft_in_mash.json": "On the television show MASH, most of the main characters are said to be drafted.\nI am wondering how realistic the portrayal of conscription during the Korean war\nis. In particular the length of time the conscripts would be expected to serve.\n\nCapt. \"Hawkeye\" Pierce is a board certified thorasic…",
  "data/reddit-ask/r/AskHistorians/comments/qqzku1/what_is_the_latest_i_could_see_a_whites_only_sign.json": "The Civil Rights Act was passed in 1964, but a lot of southern school districts\ndidn’t desegregate until 1968-70, which tells me implementation was hardly\nimmediate. I am aware of de facto segregation never went away, but what would be\nthe latest date one would see the signs in businesses explicitly…",
  "data/reddit-ask/r/AskHistorians/comments/qr2bqt/how_did_italian_cuisine_become_so_conservative.json": "Massimo Bottura became famous for making modifications to traditional dishes and\ngenerating the wrath of locals. It is common to find videos on the internet of\nirate Italians with modifications and changes in the ingredients of Italian\ndishes. there is this reputation that Italians only like the…",
  "data/reddit-ask/r/AskHistorians/comments/qr8eb2/the_us_federal_government_grants_far_more_money.json": "You can see the balance of payments vs receipts here\n[https://rockinst.org/issue-areas/fiscal-analysis/balance-of-payments-portal/].",
  "data/reddit-ask/r/AskHistorians/comments/qratux/is_the_story_of_prometheus_indication_that.json": "In the story of Prometheus he is chained to a rock and every day an eagle eats\nhis liver, no other part of his body, but his liver specifically, and then his\nliver grows again for the eagle to come eat it again the next day\n\nI always found it very odd that out of all the body parts the eagle could…",
  "data/reddit-ask/r/AskHistorians/comments/qrbte6/what_led_34_of_american_state_legislatures_to.json": "Prior to the 17th Amendment to the US Constitution, senators were chosen by\nstate legislatures, rather than directly elected. But constitutional amendments\nin the US require the assent of 3/4 of state legislatures, who, one would think,\nwould logically be resolutely opposed to giving up this…",
  "data/reddit-ask/r/AskHistorians/comments/qrnz35/people_of_iranian_ancestry_seem_overrepresented.json": "Moreover, based on a Twitter thread I saw once, Khurasanis are over-represented\namongst the Iranian authors.\n\nAnd how valid is the argument that Arabs lacked a literary culture when they\ndefinitely have had writing for centuries?\n\nSo really several questions I guess:\n\n 1. Why so many Iranian…",
  "data/reddit-ask/r/AskHistorians/comments/qs0l1o/has_korea_always_found_japans_rising_sun_flag_to.json": "I've been reading about a little controversy recently where a popular children's\ncartoon called Miraculous Ladybug had a brief image of what looked like the\nRising Sun Flag as a visual for Japan explaining different time zones, and a lot\nof Koreans have voiced their displeasure at the show and its…",
  "data/reddit-ask/r/AskHistorians/comments/qs39dg/why_did_this_canadian_newspaper_detail_the.json": "I was looking at old newspapers by the Waterloo Chronicle in Ontario, Canada and\nI came across an odd section [https://imgur.com/a/fPRH2F2] (especially the\nsecond and third columns) in a 1948 edition of the paper. It doesn't have a\ntitle in this edition but in an older one from 1918 I see it used to…",
  "data/reddit-ask/r/AskHistorians/comments/qs9gnb/how_did_poordelicate_health_come_to_be_associated.json": "European/British literature of the 1800s seems to depict poor or “delicate”\nhealth as a positive trait in upper class women, with consumption/TB in\nparticular appearing to have been almost fashionable. Is this accurate, and if\nso, how did poor health come to be associated with gentility and/or…",
  "data/reddit-ask/r/AskHistorians/comments/qsa5lz/why_did_the_ottoman_navy_defect_in_1840.json": "During the Ottoman-Egyptian war (1839-1841), the entire Ottoman navy defected to\nEgypt. What was the cause for this drastic action? How were the deserters\ntreated during and after the war? Did something like this ever happen before or\nafter?",
  "data/reddit-ask/r/AskHistorians/comments/qsb4ib/how_instrumental_was_heinrich_kramer_author_of.json": "From what I understand, for most of the medieval period the Catholic Church's\nofficial stance was witches didn't exist. Because suggesting Satan had power on\nEarth was heretical. Then in 1485, Heinrich Kramer became obsessed with a woman\nnamed Helena Scheuberin, when she wouldn't attend his sermons,…",
  "data/reddit-ask/r/AskHistorians/comments/qsclqi/did_ancient_romans_deliberately_make_mistakes_in.json": "I was reminded recently of a school trip years ago to look at some uncovered\nRoman-era mosaics (Lullingstone in the UK, I think).\n\nI remember the guide/museum person telling us that the Romans viewed perfection\nas a trait of the gods, and in deference would make minor intentional errors in\ntheir…",
  "data/reddit-ask/r/AskHistorians/comments/qsd5o1/back_when_pregnancy_was_extremely_deadly_did_they.json": "Seeing the physical size difference between Hafþór Júlíus Björnsson (the\nmountain from Game of thrones) and his wife got me wondering about this. Big\npeople tend to produce big babies and for smaller women, especially with small\nhips, this can make the delivery much more difficult and deadly.\n\nDid…",
  "data/reddit-ask/r/AskHistorians/comments/qsrbvj/both_denmark_and_swedennorway_were_awarded.json": "We always hear about the British, French, Dutch, and US as the main European\nplayers trading and doing diplomacy with the Qing dynasty, but clearly they were\nnot the only ones. What interests me is, how did the Danish and Swedish manage\nto achieve the same level of influence, as illustrated by…",
  "data/reddit-ask/r/AskHistorians/comments/qsrw1x/what_happened_to_victorian_era_servants_as_they.json": "I’m watching through Downton Abbey (again). I know the story is a highly\nromanticized one and they make it seem like the family is going to take care of\ntheir loyal staff into their old age.\n\nSurely that’s not how things really went, right? Where would aging servants who\nwere no longer able to work…",
  "data/reddit-ask/r/AskHistorians/comments/qsu7h5/was_it_legal_for_a_british_newspaper_or_person_to.json": "Could I, as a random person on the street, go to a public area or pub and openly\nsay the colonists should be independent (disregarding how well-received that\nwould be by my peers)? Could I criticize the British Army's deployment overseas?\nWould I get censored by the government if I tried to publish…",
  "data/reddit-ask/r/AskHistorians/comments/qsuo9s/according_to_the_pew_research_center_29_of_south.json": "And there something distinctive about Korean culture that made it more receptive\nto the endeavors of Christian missionaries?",
  "data/reddit-ask/r/AskHistorians/comments/qszm1u/what_do_you_think_it_was_exactly_that_made_julius.json": "Im not so much interested in the Gallic Wars, bc im sort of in the camp that\ndoubts most of what he presents in Commentarii de Bello Gallico. Ive gone\nthrough it twice now, and I just can not help but think that most of the battles\nwere way, way more one-sided than he lets on. And of course the…",
  "data/reddit-ask/r/AskHistorians/comments/qt08we/why_couldnt_napoleon_build_a_navy_to_rival_the.json": "It really seems like he would have all the resources and manpower needed to\ncrank out ships, so how did the British maintain naval supremacy?",
  "data/reddit-ask/r/AskHistorians/comments/qt2nzc/how_was_thomasalexandre_dumas_a_person_who_was.json": "I know that Thomas was the son of a nobleman, and that his father recognized him\nas a son and gave him a good education. It is also not hard to imagine that\nbeing the son of a nobleman protected Thomas from the worst of the racist ideas\nof that time but how did he manage to achieve such a high rank…",
  "data/reddit-ask/r/AskHistorians/comments/qt6nrx/during_the_war_of_1812_the_united_states_war.json": "More to the point, why were there no legal, political, or even military\nconsequences for what I would have assumed was an act of treason?",
  "data/reddit-ask/r/AskHistorians/comments/qt96jw/meta_the_nazis_improved_the_economy_clean.json": "\"The Nazis improved the economy\", \"Clean Wehrmacht\", \"The Wehrmacht had the best\ntanks and was a highly mechanised army\" ... are but some of the popular history\nfalsehoods that seem to just not want to die.\n\nThe Nazis built an economy on debt and theft of Jewish property that was close\nto…",
  "data/reddit-ask/r/AskHistorians/comments/qtnrt1/were_kunoichis_female_ninjas_in_ancient_japan.json": "What or what didnt happen practically in such a situation",
  "data/reddit-ask/r/AskHistorians/comments/qtpj6g/is_the_idea_that_the_irish_or_italian_were_once.json": "And if so, why? I honestly can't tell whether this is promoted by crypto-racists\ntrying to claim they were discriminated against too, people who think it just\nsounds cool and counter-intuitive, or people with a critical race perspective.",
  "data/reddit-ask/r/AskHistorians/comments/qtqknf/the_maritime_citystate_with_imperial_ambitions.json": "I'm fascinated by the idea of small city-states being able to punch far above\ntheir weight class, but mostly overseas. They had a far harder time dominating\ntheir own \"countries.\" Athens couldn't conquer the mainland Greek states, and\nVenice, Genoa, Pisa, etc, did poorly when they tried to dominate…",
  "data/reddit-ask/r/AskHistorians/comments/qtr8ex/was_there_ever_a_point_in_history_that_a_colonial.json": "I guess I’m just curious, one of my friends was talking about pirates and I was\nthinking “woah what if you were a colonist or something similar back when maps\nweren’t as good and communication took much longer and your\nempire/sponsor/lifeline just lost some paperwork or the people who knew where\nyou…",
  "data/reddit-ask/r/AskHistorians/comments/qtvydo/how_did_israel_revive_hebrew.json": "Hebrew hadn't been spoken as a regular language for thousands of years, and yet\ntoday the language is spoken in its modern form by nearly every Jewish Israeli.\nHow did this happen? Who updated the language to its modern form and how was it\ntaught and learned so quickly? Wouldn't teachers need to be…",
  "data/reddit-ask/r/AskHistorians/comments/qtwu0y/an_ancestor_of_my_husbands_had_charges_brought.json": "While doing my husband's ancestry we found his 26th great grandfather William\nSaunders of the Bury. I'm one biography it says\n\n> In the period 1460-1465 William sought to recover 100 marks' debt from a\n> London grocer who had brought actions against him in the Poultry Counter.\n\nWhat does that mean?",
  "data/reddit-ask/r/AskHistorians/comments/qu3a5o/why_did_the_united_fruit_company_use_a_gun_on_its.json": "The United Fruit Company was a corporation that - to oversimplify and understate\n- caused much political instability in 20th century Central America in order to\nsecure its bananas. Its logo\n[https://upload.wikimedia.org/wikipedia/en/6/6e/United_Fruit_Company_logo_%E2%80%93_Bananas.png],\nfrom what I…",
  "data/reddit-ask/r/AskHistorians/comments/qudf43/why_do_several_religions_share_the_palms_pressed.json": "And why use it in prayers? What's the significance of it that made people thing\nthat they're appropriate for prayers? Why isn't it exclusive to one religion?",
  "data/reddit-ask/r/AskHistorians/comments/que676/what_was_it_like_for_the_very_last_soldiers_on.json": "I try to play the scenario in my mind like an extremely long wall that’s barren\nwith exception of a couple lads just kind of sauntering up and down the\nbattlements praying no savage, blood-thirsty barbarians come-a-climbing.\n\nWhat would it have been like in reality, so close to the last time there…",
  "data/reddit-ask/r/AskHistorians/comments/qufhxz/if_the_whole_point_of_shermans_march_to_the_sea.json": "My understanding is that the defining feature of Sherman's Savannah Campaign was\nthat he didn't actually try to occupy all the land between Atlanta and Savannah.\nHe just walked his army from one end to the other, smashing any important\ninfrastructure he found along the way, without bothering to…",
  "data/reddit-ask/r/AskHistorians/comments/quihzt/throughout_the_20th_century_why_did_the_us_choose.json": " * Examples\n\n 1. Fazlollah Zahedi [https://en.wikipedia.org/wiki/Fazlollah_Zahedi] during the\n    1953 Iranian coup d'état\n    [https://en.wikipedia.org/wiki/1953_Iranian_coup_d%27%C3%A9tat]\n 2. Carlos Castillo Armas [https://en.wikipedia.org/wiki/Carlos_Castillo_Armas]\n    during the 1954…",
  "data/reddit-ask/r/AskHistorians/comments/qum797/were_the_sumerians_a_sex_positive_culture.json": "I have a book called \"The first cities\" by Dora Jane Hamblin. In chapter five,\npage 104 in my edition, it includes a sumerian love song, and I'struck by how\nsex positive it sounds.\n\nI can't write the whole thing here, but I'll include a couple of notable\npassages:\n\n> Husband, the loved one of my…",
  "data/reddit-ask/r/AskHistorians/comments/qun5rw/how_and_why_did_rightwing_political_conspiracy.json": "When I watch older media that depict conspiracy theories, the theories\nreferenced are usually quite broad and borderline fantastical, i.e. flat earth,\nhollow earth, chemtrails, lizard people, and various iterations of doomsday\npreachers and cult leaders.\n\nIt feels like conspiracy theories have taken…",
  "data/reddit-ask/r/AskHistorians/comments/quuffz/lincolns_original_thanksgiving_proclamation_did.json": "Examples of the hats/costumes from the 1970s here.\n[https://www.jenx67.com/2019/11/thanksgiving-1976.html] I grew up in the 1990s\nand vividly remember wearing these kind of hats and being presented with and\nreenacting a Thanksgiving narrative that went roughly \"the pilgrims came to\nAmerica and the…",
  "data/reddit-ask/r/AskHistorians/comments/qv9tej/how_did_chiropractors_become_so_common_in_the_us.json": "I’m a foreigner living in the US (moved here from Israel). Before coming here I\nhave never seen a chiropractor’s office, known a chiropractor or heard people\ntalk of seeing their chiropractor. Moved to a medium size town in the US and\nseems like they are everywhere, lots of people mention visiting…",
  "data/reddit-ask/r/AskHistorians/comments/qvaooj/how_was_william_the_conquerer_able_to_effectively.json": "When he conquered England, many Lords had surrendered to him and he established\nhis authority further in the harrying of the north.\n\nDid he simply murder all of the old nobility? If he didn’t, what did that\nnobility do after their titles were stripped? How did the population of England\nview the new…",
  "data/reddit-ask/r/AskHistorians/comments/qvcnfb/in_seinfeld_s02e10_jerry_cant_get_cable_because.json": "In the episode Jerry wants to get signal for his tv and Kramer insists he should\nget illegal cable because apparently the cable companies have some sort of\ndispute and there is the expectation this problem will last for years as the\ncompanies sue each other\n\nI also assume this wasn't an issue with…",
  "data/reddit-ask/r/AskHistorians/comments/qvjqi8/if_the_trope_of_the_king_spending_all_day_in_the.json": "I've recently learned that the stereotype of the monarch sitting on the throne\nall day, listening to pleas and rendering judgement, is false. It's my\nunderstanding that the throne room was only used to \"preside in majesty\" over\nformal ceremonies and welcome important guests.\n\nIf that's the case,…",
  "data/reddit-ask/r/AskHistorians/comments/qvq2dm/i_dont_understand_this_crest_like_at_all.json": "I’ve been staring at this old family crest for years. My family has no\nhistorians. We are remembered in French history for little besides a destroyed\ncastle on the border with Germany and an old myth or two. But then there is this\nsnake/horn armed lady and I can’t find any…",
  "data/reddit-ask/r/AskHistorians/comments/qvrhop/there_is_a_long_section_on_wikipedia_which_posits.json": "Section for those wanting to see what I am talking about\n[https://en.wikipedia.org/wiki/History_of_HIV/AIDS#Emergence]",
  "data/reddit-ask/r/AskHistorians/comments/qw0kqo/why_did_haiti_pay_reparations_to_france.json": "I know “why” (the cost of the freed slaves) but I can’t imagine the slaves who\nliberated themselves with sweat, blood, and tears would be too big on that. Why\ndid they agree to pay? Or, more likely, who forced them to pay?",
  "data/reddit-ask/r/AskHistorians/comments/qw42pr/why_didnt_norways_elite_steal_oil_money_how_did.json": "This may sound strange, but I am from Eastern Europe.\n\nAlmost all oil countries have weak economies. Why is it different in Norway?\nWere there any incidents of corruption in Government Pension Fund of Norway or\nattempts to steal oil money?",
  "data/reddit-ask/r/AskHistorians/comments/qwe6xc/the_interview_has_dominated_media_for_a_century.json": "Are dialectics interviews? I don't think that's what Plato had in mind?",
  "data/reddit-ask/r/AskHistorians/comments/qwlkgl/how_did_the_muslims_of_the_islamic_caliphates.json": "I have had immense frustration with finding any information on the Byzantines\nbesides the most famous stuff, I have studied the history of the Empire\nextensively for well over a year now, books, Publishes papers regarding history,\nculture, military etc.\n\nThere seems to be an absolute lack of…",
  "data/reddit-ask/r/AskHistorians/comments/qwqmwl/i_want_to_become_a_history_professor_even_if_its.json": "I really really want to teach/instruct history at a college level. I live in\nminnesota and currently working towards a BA in history/history education. Ive\nposted this before and the comments were pretty discouraging about getting a job\nas a professor. Do you guys think high school teaching is the…",
  "data/reddit-ask/r/AskHistorians/comments/qwsk3d/were_baby_boomers_viewed_by_older_generations_the.json": "Millennials are stereotyped as being entitled, impatient, overly sensitive,\nprogressive, technology-obsessed and socially/environmentally conscious.\n\nRelative to the decades before, Baby Boomers (generally) grew up in a more\nprosperous time with many technological advancements and social /…",
  "data/reddit-ask/r/AskHistorians/comments/qx63nl/why_did_hitler_never_order_the_use_of_chemical.json": "I have always thought it was because of his exposure to it during WWI, but\nconsidering the man actively gassed civilians without a qualm and seemed to hate\ncommunism almost as much as Judaism, it’s always baffled me that he never\nordered the use of chemical weapons, especially in or around…",
  "data/reddit-ask/r/AskHistorians/comments/qxb64d/is_it_true_that_joseph_goebbels_spoke_of_the.json": "It says so on his Wikipedia page but can't find any further information about\nthis. Would be grateful if you could shed some light? He also apparently\ndescribed Himmler's ideology as \"in many regards, mad\" and thought Alfred\nRosenberg's theories were ridiculous.",
  "data/reddit-ask/r/AskHistorians/comments/qxci1e/why_are_deli_style_restaurants_so_prominent.json": "I've been to New York City a few times and usually the most common food\nrecommendations are the world renown deli's (Katz in particular) and most of\nthem seem to be Jewish owned. What's the history behind deli's in the Jewish\ncommunity, Why deli vs other restaurant styles (diners,etc), when did they…",
  "data/reddit-ask/r/AskHistorians/comments/qxfeba/is_there_any_evidence_that_trotskyist_joined_and.json": "In her article \"The Myth of the Classically Educated Elite\" Naomi Kanakia makes\nthe following claim,\n\n\"Indeed, the one area where Classical education continues to be in vogue is\namong neoconservatives: that group of former Trotskyists who turned to the\nRepublican Party in the late 20th century and…",
  "data/reddit-ask/r/AskHistorians/comments/qxixb9/im_a_young_italian_noble_in_the_late_14th_century.json": "For extra points:\n\n- What happens if I'm not a noble, could someone get instruction still?\n- Could a woman get fencing lessons, perhaps in the use of the knife and\nabrazare(wrestling), so she can defend herself?\n\n- What is the church's opinion on fencing lessons? (Since technically speaking\nthey're…",
  "data/reddit-ask/r/AskHistorians/comments/qxtti1/what_was_saddam_husseins_long_term_goal_for_iraq.json": "I'm having a hard time learning about this specifically. Did he support a\nsocialist economy or a capitalist one? Did he want to industrialize and\nmodernize Iraq, and make it less secular? Is it true that he implemented social\nprograms? Any comments on this matter would help. Thanks :)",
  "data/reddit-ask/r/AskHistorians/comments/qy4qft/the_word_homosexuality_was_falsely_translated.json": "In 1946 a group of men got together to retranslate the bible and make the\nRevised Standard Version, RSV. When they got to 1 Corinthians 6:9 they\ntranslated the last Greek word in that verse to Homosexuality:\n\n1 Corinthians 6:9 (ESV): 9 Or do you not know that the unrighteous will not\ninherit the…",
  "data/reddit-ask/r/AskHistorians/comments/qy6u09/according_to_bruce_riedel_former_head_of_cia_3.json": "> On September 14, I was with Bush when he had his first phone call after 9/11\n> with British Prime Minister Tony Blair. Bush immediately said he was planning\n> to “hit” Iraq soon. Blair was audibly taken aback. He pressed Bush for\n> evidence of Iraq’s connection to the 9/11 attack and to al-Qaida.…",
  "data/reddit-ask/r/AskHistorians/comments/qycfyg/during_the_1992_la_riots_many_koreanamericans.json": "I will not pretend that this question isn't inspired by recent events, but as\nsomeone born to one of these mythical \"roof Koreans,\" this topic does hit close\nto home for me. In short, what was public perception of these minority groups\nopenly defending their property with weapons? And were any of…",
  "data/reddit-ask/r/AskHistorians/comments/qyej1o/historically_large_parts_of_the_american_midwest.json": "In High School, I learned that the Haudenosaunee/Iroquois Confederacy in New\nYork had a constitution and system of representative democracy predating\nEuropean colonization. I recently found out that further west there were other\nmulti-ethnic political alliances and confederacies. For example, most…",
  "data/reddit-ask/r/AskHistorians/comments/qylip2/why_was_the_black_death_so_much_more_devastating.json": "Hygiene is usually pointed out as one of the reasons but I’ve seen that the idea\nof medieval europeans being unhygienic has mostly been debunked. Also they knew\nwell enough that they had to isolate themselves from the sick and burn the\nbodies.\n\nOn top of that Asia had some major cities 10 times…",
  "data/reddit-ask/r/AskHistorians/comments/qyonde/almaarri_was_an_arab_philosopher_from_the_golden.json": "Oddly enough Al-Ma'arri doesn't have a wikipedia article in english, but he does\nhave articles in spanish and german and that's how I learned about him\n\nI was very surprised to see that was able to publish texts attacking religion in\nthe Abassid Empire, but I guess they were a lot more tolerant than…",
  "data/reddit-ask/r/AskHistorians/comments/qywjyf/how_did_french_vanish_as_a_scientific_language.json": "Today almost all scientific output is published in English. However, the rise of\nEnglish is a quite recent phenomenon. Will it makes sense to me that german went\non a decline after both world wars and the science boycott of the Entente, I'm\nnot sure how french dropped out. Partly probably due to the…",
  "data/reddit-ask/r/AskHistorians/comments/qyyf9g/dan_jones_upcoming_novel_will_give_the_dday_in.json": "On a recent episode of \"Tides of History\" Dan Jones talks about writing his\nupcoming book about the 100 Years War with all the style and clichés of modern\nwar films (e.g. Jarhead, Apocalypse Now). He talked about how Edward III faced\nopposition when landing on what we now know as Omaha Beach (e.g.…",
  "data/reddit-ask/r/AskHistorians/comments/qz92o9/in_1856_richard_francis_burton_briefly_mentions_a.json": "Quote:\n\n> \"The mosquito bites bring on, according to the same authority, deadly fevers:\n> the superstition probably arises from the fact that mosquitoes and fevers\n> become formidable about the same time.\"\n\nSource here. [https://jamanetwork.com/journals/jama/article-abstract/218939]",
  "data/reddit-ask/r/AskHistorians/comments/qzkdfv/it_is_said_the_stoic_philosopher_chrysippus_died.json": "Chrysippus was a stoic philosopher known for his good humour. Here's how\nWikipedia has his death:\n\n> He died during the 143rd Olympiad [https://en.wikipedia.org/wiki/Olympiad]\n> (208–204 BC) at the age of 73.[4]\n> [https://en.wikipedia.org/wiki/Chrysippus#cite_note-dorandi1-4] Diogenes\n> Laërtius…",
  "data/reddit-ask/r/AskHistorians/comments/qzsfl4/in_1974_abba_famously_performed_the_hit_song.json": "edit: Sorry I botched the title. The question was supposed to be: Was there any\noutrage across the French populace to a song celebrating the fall of Napoleon\nwinning a contest intended to promote European unity?",
  "data/reddit-ask/r/AskHistorians/comments/qzx7r0/how_did_scandinavia_become_so_progressive_and.json": "Scandinavia is north of the most fertile lands of the world, and have never been\nparticularly powerful or rich globally. Despite this, they have all solid\ninstitutions, very high rankings in quality of life, democracy and happiness\nmeasurements. Why is that?",
  "data/reddit-ask/r/AskHistorians/comments/r0dnwv/is_there_any_merit_to_the_statement_empires.json": "Recently I've seen a quote thrown around a lot that says that empires only last\n250 years. A bit of googling tell me that this is taken from a work published in\n1978 called The Fate of Empires and the Search for Survival, by Sir John Bagot\nGlubb [https://en.m.wikipedia.org/wiki/John_Bagot_Glubb].…",
  "data/reddit-ask/r/AskHistorians/comments/r0dvez/why_do_we_use_dynastic_names_for_some_historical.json": "For example, when refering to the U.K (or its predecessor states England or\nBritain), they are officially called England/Britain/UK - as opposed to Windsor,\nYork, Stuarts, Tudors etc. Whereas in other cases, particularly states in the\nEast, referring to one state results in distinct names based on…",
  "data/reddit-ask/r/AskHistorians/comments/r0en25/what_were_irish_monks_doing_in_iceland_before_the.json": "From Wikipedia [https://en.m.wikipedia.org/wiki/Hiberno-Scottish_mission]\n\n> Irish monks known as Papar are said to have been present in Iceland before its\n> settlement from AD 874 onwards by the Norse. The oldest source mentioning the\n> Papar is the Íslendingabók (\"Book of the Icelanders\"), between…",
  "data/reddit-ask/r/AskHistorians/comments/r0g484/how_did_jazz_become_academic.json": "You can get a degree in jazz from a large number of universities, which isn't\ntrue for any other form of popular music that has arisen since.",
  "data/reddit-ask/r/AskHistorians/comments/r0unq0/were_there_really_peg_boys.json": "Way back in 2001, when sex columnist Dan Savage ushered \"pegging\"\n[https://www.thestranger.com/seattle/SavageLove?oid=7730] into the cultural\nvocabulary, one of his readers wrote in with the following tidbit: \"Peg boy was\na position in Her Majesty's Navy: He was the boy available for the after…",
  "data/reddit-ask/r/AskHistorians/comments/r1312l/why_have_the_democrats_and_republicans_been_able.json": "Before the 1870s there were different parties that sprouted up and did well. The\nwhigs, federalists, Democratic-Republicans, all rose and fell. But ever since\nthe post civil war just these two parties have dominated everything.\n\nHow have they been able to keep going so long? Why has neither fallen…",
  "data/reddit-ask/r/AskHistorians/comments/r155ue/winston_churchhill_and_lady_astors_recorded.json": "Nancy Astor: \"Sir, if you were my husband, I'd poison your tea.\"\n\nWinston Churchill: \"Madame, if you were my wife, I'd drink it!\"\n------\n\nNancy Astor: \"Winston, you are a drunk!\"\n\nWinston Churchill: \"And you, madam, are ugly. But I shall be sober in the\nmorning.\"",
  "data/reddit-ask/r/AskHistorians/comments/r189so/looking_for_info_on_the_historical_practice_of.json": "Hi there,\n\nI found a really interesting piece of dialogue in a Chinese drama I'm currently\nwatching, and since all the search results were related to concubinage/the\nImperial harem, I was hoping I could get some clarification here. I do of course\nknow that dramas aren't always the most accurate…",
  "data/reddit-ask/r/AskHistorians/comments/r19o20/did_telegraph_operators_talk_to_each_other_to.json": "Robert Service's semi-satirical poem The Telegraph Operator\n[https://www.poetryfoundation.org/poems/45084/the-telegraph-operator] talks\nabout the loneliness of working as a telegraph operator, presumably at an\nextremely remote station in the Canadian prairie somewhere.\n\nWere operators (in any…",
  "data/reddit-ask/r/AskHistorians/comments/r1nkyf/how_did_jeans_become_the_default_casual_pants_was.json": "So I'm sitting in a packed bar the night before Thanksgiving (as one does) and I\nnoticed that literally every man and about 80% of the women are wearing jeans. I\nknow leggings have kind of jumped on the scene the last few years but for as\nlong as I can remember jeans have the been the regular casual…",
  "data/reddit-ask/r/AskHistorians/comments/r1s301/if_raw_milk_is_so_dangerous_how_come_people_drank.json": "Between 1860 and the domestication of cows, sheep and goats, people had to\nhandle raw milk and dairy made from it. How come they didn't get terrible\ninfections from it?",
  "data/reddit-ask/r/AskHistorians/comments/r1zmtx/the_inca_were_famous_for_their_qullqas.json": "In the Mantaro Valley, one of the largest fertile growing regions of the Inca\nEmpire, archeologists have found 2,573 qullqas (storehouses). These could hold\n170,000 square meters of goods. Some of this was for non-food storage, but a ton\nof it was dried potatoes, quinoa, etc. When the Spanish showed…",
  "data/reddit-ask/r/AskHistorians/comments/r2398y/i_dont_know_much_about_native_american_history.json": "Both seem to be tragedies that surround Native Americans, so why is Jackson\ngetting more hate for it than Lincoln does?",
  "data/reddit-ask/r/AskHistorians/comments/r29lyc/how_much_of_the_widespread_poverty_throughout_the.json": "I feel like we have lost a lot of nuances discussing the USSR. But based on what\nseveral people from ex soviet countries have told me, the assuption that\npractically everyone was living in poverty at the time isn't really correct.\nWhere some soviet countries significantly better (or worse) than…",
  "data/reddit-ask/r/AskHistorians/comments/r2t2mt/why_did_married_couples_sleep_in_separate_beds.json": "In a lot of the Victorian and Edwardian fiction I read, it appears that it’s the\nnorm for a married couple to sleep sleep separately from each other. Why was\nthis? And why did it change?",
  "data/reddit-ask/r/AskHistorians/comments/r2uec3/the_first_nuclear_bomb_test_in_1945_didnt_ignite.json": "Our atmosphere has low enough pressure and levels of deuterium that nuclear\nfission in air doesn’t cause hydrogen atoms to fuse into helium. If things were\na bit different, a nuclear explosion might have caught our atmosphere on fire.\n\nSo what was the debate like? Who wad debating the issue? Were…",
  "data/reddit-ask/r/AskHistorians/comments/r2urd2/athens_a_small_city_of_250k_gave_rise_to_a.json": "P.S. I'm aware Archimedes, Euclid, Pythagoras, and Herodotus weren’t from\nAthens, but they were drawn to whatever voodoo the Athenians cooked up.\n\nSo what was the voodoo? Why did it happen, and why have such concentrations of\nbrilliance occurred so rarely in the history of civilization?",
  "data/reddit-ask/r/AskHistorians/comments/r2ydwq/medieval_africa.json": "Everyone knows about what was going on in Europe and Asia. Why isn’t anyone\ntalking about what was happening in africa in the middle ages?",
  "data/reddit-ask/r/AskHistorians/comments/r37l84/why_do_librarians_choose_to_include.json": "Also: do book sales factor that much into curation considerations?",
  "data/reddit-ask/r/AskHistorians/comments/r39i7z/the_phoenicians_colonized_the_mediterranean_world.json": "The Phoenicians seem to be one of the most influential people of the\nMediterranean world; yet they lack a sense of art or unique architecture in my\nopinion (compared to the Greeks and Romans). Is it just survival bias, where\nwhat survived of their civilization isn’t great to our eyes?",
  "data/reddit-ask/r/AskHistorians/comments/r3cpfm/repost_in_1919_the_entire_boston_police.json": "Reposted from u/henry_fords_ghost [/u/henry_fords_ghost]‘s question, which sadly\nwent unanswered.\n\nAdditionally, What impact (if any) did it have on the development of police\nunions? Did the Boston PD had a particularly bad reputation with local Boston\nworkers who attempted to strike or unionize?",
  "data/reddit-ask/r/AskHistorians/comments/r3djn0/why_does_my_jewish_family_traditionally_get.json": "Probably and easy answer, but I come from a Ashkenazi Jewish family on my\nmothers side. Every Christmas they/we either go out to or order in Chinese food.\nHow and why did this tradition start? It’s also popularized in media and\ntelevision.",
  "data/reddit-ask/r/AskHistorians/comments/r3gg0v/weird_question_about_welsh_versus_anglo_saxon.json": "This question is inspired by the historical fiction-Arthurian retelling \"The\nWarlord Chronicles\" by Bernard Cornhill so high possibility of it being made up\nto highlight the cultural divide for the book.\n\nOld monk Derfel is telling his and Arthur's story to a welsh queen patron and\nDerfel tells of…",
  "data/reddit-ask/r/AskHistorians/comments/r3hsis/i_teach_on_land_seized_from_coast_salish_and.json": "Edit: Our school does do work with native tribes and we have elders come every\nyear. I’m asking for resources to supplement that, because my personal\nrelationship isn’t (yet) one where I am comfortable asking them to do much labor\nfor me",
  "data/reddit-ask/r/AskHistorians/comments/r3jpwt/to_what_extent_was_fdr_supportive_of_eleanors.json": "I was surprised when I learned Eleanor had at least one long term sexual\nrelationship with another woman, Lorena Hickok, during her open marriage to FDR.\n\nShe also had a number of intense friendships (at least) with lesbian couples,\nincluding two she lived with at Val Kill, an estate FDR built so…",
  "data/reddit-ask/r/AskHistorians/comments/r3ly0o/its_often_said_that_queen_elizabeth_the_first.json": "Or, what language? Venetian is clearly a different Language to Sicilian, so did\nshe speak Tuscan at all?",
  "data/reddit-ask/r/AskHistorians/comments/r3zd4m/what_is_the_history_behind_moons_on_outhouses.json": "After watching a video on YouTube of a guy making an outhouse, I got to\nwondering where the idea came for people to cut a half moon onto the door of an\nouthouse.",
  "data/reddit-ask/r/AskHistorians/comments/r44baa/where_does_the_motivetropescene_of_firefighters.json": "Hi, last night I watched some TV and stumbeld upon an US-American movie of the\nlast century (80s/90s I guess). In that parcticular movie firefighters were\ncalled to save a poor kitty from a tree. I realized I saw that type of scene in\nmany US movies (more often in old ones) where the firefighters…",
  "data/reddit-ask/r/AskHistorians/comments/r45sfd/should_we_even_bother_reading_pop_history_books.json": "After some time browsing this sub, I've often come across the realization that\nmany a pop-history book I had read and enjoyed in the past was actually sloppy\nand questionable. I've had this happen with Guns, germs and steel (apparently\ncommon enough that it's become a meme in and of itself for…",
  "data/reddit-ask/r/AskHistorians/comments/r4f8mi/did_the_2001_film_enemy_at_the_gates_popularize.json": "The 2001 film \"Enemy at the Gates\" was quite popular. It was very good popcorn\ncinema and arguably remains the most popular movie about the Eastern Front of\nWW2.\n\nThe movie, however, vastly exaggerated the tactical and strategic shortcomings\nof the Red Army during that time. While \"human wave\"…",
  "data/reddit-ask/r/AskHistorians/comments/r4l3js/why_does_liechtenstein_exist.json": "I understand they were Important to the HRE and Austria. But why haven't they\nbeen invaded or joined Switzerland?",
  "data/reddit-ask/r/AskHistorians/comments/r4y40g/why_didnt_serfdom_disappear_in_russia_after_the.json": "I was taught that serfdom gradually disappeared in Europe after the Black Death,\ndue to a much lower working population. This had the effect of lords having to\nhire or convince other people to move to their land to work there. However,\nbecause there was a much higher demand for workers than the…",
  "data/reddit-ask/r/AskHistorians/comments/r51no0/black_soldiers_ordered_to_guard_supply_depot_so.json": "Years ago I heard an anecdote about how during the Battle of the Bulge Patton\nfixed a problem they were having. With German spies being about, Patton gave the\norder to black units to guard supply depots, with orders to shoot any white\nsoldiers that came close.\n\nA while back I made a post on here…",
  "data/reddit-ask/r/AskWomen/comments/qk0r3i/if_your_partner_fell_in_love_with_someone_else.json": "I guess this is a huge fear for anybody, but what would your ideal outcome be?\nThey stay with you and push the feelings down? They leave? They cheat? They\nnever tell you? No option seems good, so what would you choose?",
  "data/reddit-ask/r/AskWomen/comments/qknbn6/what_is_something_you_doubted_until_you_tried_it.json": "Whether it’s a food, song, movie, event, place, experience, sex-related,\nclothing, makeup, trend, etc.",
  "data/reddit-ask/r/AskWomen/comments/qlv13j/whats_something_you_never_buy_new.json": "As in something you will always go to the thrift store or get off Facebook\nmarketplace for",
  "data/reddit-ask/r/AskWomen/comments/qlzffx/what_is_the_most_elaborate_lie_a_manwoman_has.json": "How far can people go to make you put out?",
  "data/reddit-ask/r/AskWomen/comments/qm4vph/if_you_werent_related_to_your_parents_would_you.json": "Curious how you ladies view your relationships with your parents as adults.",
  "data/reddit-ask/r/AskWomen/comments/qm7alo/what_screams_to_you_peaked_in_high_school.json": "Who are the people that obviously peaked in high school and still brag about it\ntoday ?",
  "data/reddit-ask/r/AskWomen/comments/qne227/do_you_cry_easily_during_conflict_if_so_how_do.json": "Title. For women who get emotional during confrontational moments, how do you\nhold back the waterworks which can seem manipulative and unproductive to the\nother party?",
  "data/reddit-ask/r/AskWomen/comments/qntb1j/why_did_you_get_divorced.json": "I'm not talking about cheating. Any other reasons why your marriage ended. Do\nyou regret it or are you happier than when you were married?",
  "data/reddit-ask/r/AskWomen/comments/qnu6uw/in_a_womans_life_what_deals_12_hit_points_of.json": "Some examples I've heard:\n\nWearing stilettos\n\nBrushing your hair and hitting your nipple with the brush\n\nEDIT: Can include psychic damage if you want.",
  "data/reddit-ask/r/AskWomen/comments/qoh0y6/what_are_some_things_that_you_dont_like_to_buy.json": "I think about this often and I’d love to hear what comes to mind for you guys.",
  "data/reddit-ask/r/AskWomen/comments/qomdpz/single_ladies_who_live_alone_how_much_do_you.json": "And how much do you budget for it? Is it hard or easy to stick to said budget\nand why?",
  "data/reddit-ask/r/AskWomen/comments/qpkziy/what_do_you_think_of_workplace_bathrooms_that_do.json": "Do you think that employee bathrooms should have sanitary bins in stalls for\ndisposal of period hygiene products? Do you think this is a barrier to inclusion\nof women at work?",
  "data/reddit-ask/r/AskWomen/comments/qqsqyo/women_who_consider_their_partnership_modern_and.json": "The purpose of this post is that I am interested in how others live their lives\nin an equal and modern relationship where for example both go to work or chores\nequally. I want to collect ideas on how a modern/postmodern partnership could\nlook like with your own experiences, thank you!\n\nedit: thanks…",
  "data/reddit-ask/r/AskWomen/comments/qryt52/what_is_one_habit_from_a_different_culture_that.json": "I'm not sure if this has been posted before. Here goes anyway",
  "data/reddit-ask/r/AskWomen/comments/qsgkzc/are_relationships_always_hardunfair_why.json": "It just seems like there’s only so much compatibility that you can expect from a\npartner & even great people can come with some pretty hard-to-deal-with\nqualities. It makes me curious if relationships are just always bound to be hard\nand unfair.",
  "data/reddit-ask/r/AskWomen/comments/qsko89/what_image_do_you_have_if_yourself_that_you_cant.json": "My boyfriend and I were talking last night and he said to me \"you still see\nyourself as an awkward geeky 14 year old girl\" and I have never heard anything\ntruer. Despite being a 35 year old divorcee with 2 children, working full time\nin a medical profession, I still see myself as an awkward geeky…",
  "data/reddit-ask/r/AskWomen/comments/qtopau/how_often_do_you_speak_to_your_mother_how_do_you.json": "Speak to can include text, email, call, face-to-face etc.",
  "data/reddit-ask/r/AskWomen/comments/qtts9z/whats_your_libido_like_on_a_day_to_day_basis.json": "Do you ever feel self-conscious about having a higher or lower libido? Do you\never feel a weird social pressure to have more or less sex/masturbation?\n\nEdit: appreciate all the wide range of responses—everyone’s different and has\ndifferent needs and I think sometimes we all need that reminder…there…",
  "data/reddit-ask/r/AskWomen/comments/quft1s/how_are_you_really_doing_at_this_point_in_your.json": "And how have you been feeling?",
  "data/reddit-ask/r/AskWomen/comments/quhloj/what_are_some_reason_you_think_or_know_people.json": "Disclaimer: this doesn’t mean you have to necessarily care about these reasons.",
  "data/reddit-ask/r/AskWomen/comments/quy0n1/what_is_something_about_your_significant_other.json": "Is there something that you found out about your significant other, that had you\nknown earlier, could have caused you to not be with them now?",
  "data/reddit-ask/r/AskWomen/comments/qv5vh3/how_do_you_get_over_unreciprocated_love.json": "How did you get over finding out someone you were in a relationship with and\nloved, never really loved you?",
  "data/reddit-ask/r/AskWomen/comments/qvtel3/what_is_a_random_fun_fact_you_know.json": "Having cramps rn and could really use some distraction :')",
  "data/reddit-ask/r/AskWomen/comments/qvz1hv/ladies_who_never_got_told_by_their_parents_that.json": "Or never said any compliment how you look",
  "data/reddit-ask/r/AskWomen/comments/qw3bpu/for_women_who_were_bullied_in_your_younger_years.json": "Edit: Just wanted to say, while I can't respond to everyone personally, I am\nreading all of your answers and thank you all so much for your open, honest, and\nthoughtful responses!",
  "data/reddit-ask/r/AskWomen/comments/qwhb7j/ladies_what_a_surprise_youve_found_the_first_time.json": "I'll start.... another woman's earrings on the sink.",
  "data/reddit-ask/r/AskWomen/comments/qws8ei/lets_say_you_are_offered_five_million_dollars_in.json": "Let’s say you are offered five million dollars in exchange for never drinking\nagain. What would you do in this situation?",
  "data/reddit-ask/r/AskWomen/comments/qx9s9v/whats_your_opinion_on_the_majority_of_women_leads.json": "There's hardly any TV shows or movies where the woman lead just looks like the\naverage person. This doesn't seem to be the case for men.",
  "data/reddit-ask/r/AskWomen/comments/qy56t9/what_are_some_of_the_best_feelings_in_the_world.json": "It can relate to legit anything (pleasure, family, career, financial goals-\nreaching other goals, warm towels… ANYTHING!!!",
  "data/reddit-ask/r/AskWomen/comments/qyyrca/hopeless_romantics_or_not_whats_a_romantic_things.json": "Am really curious what romance real life people experience outside of fiction or\npublic media",
  "data/reddit-ask/r/AskWomen/comments/qzdn7s/ladies_whats_your_opinion_on_when_a_man.json": "I want to hear your guy’s opinions LOL\n\nEdit: I realized I made a few mistakes in the title, but I hope it makes sense\nsomehow LOL",
  "data/reddit-ask/r/AskWomen/comments/r0tdev/women_who_go_to_therapy_what_are_some_of_your.json": "Also, if you like/agree with these phrases or if you find them\nannoying/disagreeable.",
  "data/reddit-ask/r/AskWomen/comments/r1utnr/what_are_your_favorite_romantic_movie_of_all_the.json": "The more I experience reality, the more I escape to imaginations. Love,\nkindness, happiness all these words are bigger than my little life could afford.\nSo eloping to the realm of Movies to find hope.",
  "data/reddit-ask/r/AskWomen/comments/r21sa6/what_phrases_or_terms_strike_you_as_misogynistic.json": "What makes you feel like someone is missing the point of what you are saying\nrather than focusing on you being a woman (with negative connotations)?",
  "data/reddit-ask/r/AskWomen/comments/r281lp/women_who_drink_2l_of_water_how_do_you_you_manage.json": "Edit: 2L through the day\n\nDifference in appearance: includes hair, skin ... etc",
  "data/reddit-ask/r/AskWomen/comments/r36xcb/what_little_thing_do_you_value_most_in_a.json": "They say it’s the simple things east count the most, I’m curious to know what\nthe women here qualify as little things",
  "data/reddit-ask/r/AskWomen/comments/r3mfeg/whats_something_you_really_love_doingbut_are.json": "Can be hobby/activity related or whatever else :) <3\n\nWhatever you're passionate about!",
  "data/reddit-ask/r/NoStupidQuestions/comments/qjk4mn/is_reddit_a_leftleaning_website.json": "I saw a comment of a guy claiming that reddit is a right-leaning website and I\nthought that sounded ludicrous. From what I’ve seen on r/popular [/r/popular],\nthe majority of the commenters and posts are left-leaning but is reddit a\nright-leaning website?",
  "data/reddit-ask/r/NoStupidQuestions/comments/qjpab0/what_do_you_say_when_someone_says_merry_christmas.json": "Do you say thanks",
  "data/reddit-ask/r/NoStupidQuestions/comments/qjt3ko/why_do_americans_have_storage_units_is_this_a.json": "I live in Asia and this boggles my mind. I see a lot of videos of people buying\nthese units and why does the new owner get your belongings? Is this like if you\ncant pay or abandon them? Im confused.",
  "data/reddit-ask/r/NoStupidQuestions/comments/qjxvhr/how_did_we_as_a_society_decide_that_toilet_paper.json": "I know this is somewhat specific to the U.S., but In my opinion, it’s one of the\nmost disgusting and archaic things we collectively do.\n\nPersonally, I usually just go straight to the shower after I shit to because I\nthink it’s a lot more hygienic. I know that it’s not like the most disgusting\nthing…",
  "data/reddit-ask/r/NoStupidQuestions/comments/qk2hyp/how_does_one_trick_or_treat.json": "I wasn't raised celebrating Halloween but I want to take my kid trick or\ntreating. Is it acceptable to knock on every door where it looks like someone is\nhome? Should I stick to only houses with decorations? Any other tips are\nappreciated.",
  "data/reddit-ask/r/NoStupidQuestions/comments/qk3b64/can_you_remove_cum_stains_from_a_carpet_after_its.json": "Yeah ive kind of been cumming on this one area for the last 4-5 months and i've\nonly just noticed theres this big dark spot and my parents are coming over soon\nsoooo",
  "data/reddit-ask/r/NoStupidQuestions/comments/qk52dk/why_is_it_called_a_unicorn_and_not_a_unihorn_its.json": "maybe I'm just too high.",
  "data/reddit-ask/r/NoStupidQuestions/comments/qk58sk/when_did_americans_lose_their_british_accents.json": "If the colonists originally came from Britain, they initially all had British\naccents. But now we speak with American accents. How and when did this happen?",
  "data/reddit-ask/r/NoStupidQuestions/comments/qk68oy/my_girlfriend_is_going_deaf_how_do_i_learn_asl.json": "Due to a head injury, she's loosing her hearing. She works with special needs\nkids, so she already knows sign language, but I don't. There are so many choices\non Google its overwhelming. What's the best way to approach this?",
  "data/reddit-ask/r/NoStupidQuestions/comments/qk6jjs/anyone_else_feel_like_there_used_to_be_a_magic_in.json": "When I was a kid, I imagined things every day. I day dreamed about all kinds of\nscenarios and adventures and played make-believe with my friends. When I was a\nteenager, I used to do dumb things with my friends and dreamed about my future\ncareer and my family and had all kinds of ridiculous goals and…",
  "data/reddit-ask/r/NoStupidQuestions/comments/qkeklv/does_anyone_here_get_anxiety_when_posting_on.json": "Im a very shy person overall but the reason why I want to be more active on\nsocial media is so I wont loose touch with the world and my friends. This came\nto thought after highschool, bc throughout highschool I would never post on\nsocial either but now I feel like I should now so I dont loose touch…",
  "data/reddit-ask/r/NoStupidQuestions/comments/qkhnpm/are_mobile_games_literally_just_ad_delivery.json": "Almost every single game now is just littered with ads.\n\nBanner ad at top and bottom.\n\nYou finished this level. Ad before next level.\n\nYou failed this level. Ad before you can try again.\n\nYou want a hint? Ad.\n\nYou want a temporary boost to an ability in game? Ad.\n\nWould you like some freemium…",
  "data/reddit-ask/r/NoStupidQuestions/comments/qki9y1/how_is_sliced_bread_claimed_to_have_been_invented.json": "Help me?",
  "data/reddit-ask/r/NoStupidQuestions/comments/qkidp7/if_christians_believe_heaven_is_amazing_why_dont.json": "ETA: I’m not talking about suicide.",
  "data/reddit-ask/r/NoStupidQuestions/comments/qkr2mz/my_fiances_dad_has_less_than_48_hours_to_live_due.json": "My fiances dad has less than 48 hours to live due to kidney/liver/heart failure\nfrom alcoholism, how can I help the next 48 hours, and the days after that.\n\nThis is a situation where 2 weeks ago litteraly nothing was wrong other than\nknowing he drinks too much. He was found passed out with low…",
  "data/reddit-ask/r/NoStupidQuestions/comments/qku0l0/if_a_store_is_severely_short_staffed_why_dont.json": "I work at Victoria’s Secret and my location is severely short staffed. They keep\nsaying they need to hire 40 more people by December and we’re nowhere near that\nnumber. I constantly see managers from my store posting stuff like “Please\napply. We are DROWNING.”\n\nLike maybe if you want more people to…",
  "data/reddit-ask/r/NoStupidQuestions/comments/qkvauv/just_got_a_new_samsung_galaxy_note10_and_my.json": "The button works fine but when it says it's on there's nothing coming from my\nphone light, I've tried resetting it and powering it off for a while but it\nstill won't come on",
  "data/reddit-ask/r/NoStupidQuestions/comments/qkvskg/why_is_there_a_d_in_fridge_but_not_in_refrigerator.json": "You know what I mean",
  "data/reddit-ask/r/NoStupidQuestions/comments/qkwotk/who_else_feels_like_they_did_everything_right_and.json": "Hi all—just looking to commiserate with people on this because I’m sure there’s\nother that feel this way.\n\nI did everything I was told to do growing up to have a comfortable life. I\nexcelled in school, got honors, went on to do very well in college and graduated\nwith my BA in English. I was…",
  "data/reddit-ask/r/NoStupidQuestions/comments/ql0d3k/if_failure_is_meant_to_be_okay_and_part_of.json": "Growing up every test or exam we did was made out to be a big deal and affected\nour future (not to the same level though). Never was there any indication at all\nthat it would be okay to fail and that you would get the opportunity to improve\nshould you fail.\n\nIf failure is okay and part of learning…",
  "data/reddit-ask/r/NoStupidQuestions/comments/ql1d00/was_the_condition_dwarfism_named_after_the.json": "I just woke up suddenly at 5am with this thought in my head and I can't figure\nit out and I can't get back to sleep now.\n\nCause like, Dwarfism has likely been around for a long time, probably a lot\nlonger than the idea of Dwarves, but like at the same time there's some truly\nancient bits of…",
  "data/reddit-ask/r/NoStupidQuestions/comments/ql2fnh/do_people_in_america_work_more_than_40_hours_a.json": "Because here in Saudi we work 48 hours and I think it's too long.",
  "data/reddit-ask/r/NoStupidQuestions/comments/ql3hia/how_many_zeros_in_200000000e300.json": "This is the maximum number my phone calculator can calculate. If you know math,\ncan you tell me how many zeros in there?\n\nEdit: Cheers guys, your answers make a lot of sense. I feel dumb lol",
  "data/reddit-ask/r/NoStupidQuestions/comments/ql6o6p/how_do_i_as_a_guy_cope_with_not_getting_any.json": "Lately, I've started to realise that I need all of these things in order to\nfunction properly and not be depressed. I've never had any of the above, yet I\nfeel like I'm missing something and I don't know why.",
  "data/reddit-ask/r/NoStupidQuestions/comments/qla9kl/do_people_in_other_countries_leave_their_babies.json": "Wanna know if this is cultural or a global thing. Here in Scandinavia it's\ncommon for parents to just leave their child outside, sleeping in their\nstroller, while they eat.",
  "data/reddit-ask/r/NoStupidQuestions/comments/qlb30j/do_americans_really_buy_milk_by_the_gallon.json": "I mean, that’s like 8 pints of milk in one go? 4.5 litres of milk? How does it\neven fit in the fridge? How can you use it all before it goes off? What on Earth\nare you guys doing with all that milk?\n\nEDIT: OK, so a US Gallon (3.7 litres) is only slightly bigger than a UK 6 pint\nbottle (3.4 litres),…",
  "data/reddit-ask/r/NoStupidQuestions/comments/qlr8lw/why_is_everyone_hiring_but_its_to_difficult_to.json": "I graduated from high-school with no work experience and wanted to make some\ncash before college so I pretty much applied anywhere. I applied to 60+\nlocations and only got 2 interviews(neither of which called me back). I finally\ngot a job because I found someone to vouch for me. But all summer when…",
  "data/reddit-ask/r/NoStupidQuestions/comments/qlrt3i/im_not_sure_what_to_say_to_him.json": "I matched with a guy on a dating app, I was pretty interested in him. Then I\nfound out, he smokes marijuana and that's a deal breaker to me. What can, I say\nto him? we were talking for a bit, around 2 weeks on the app.I feel awkward\ntelling him, him smoking weed is a deal breaker.\n\nWhy so much…",
  "data/reddit-ask/r/NoStupidQuestions/comments/qlsv2f/does_anybody_have_dreams_so_good_that_when_they.json": "I was literally crying de-icing my car this morning.",
  "data/reddit-ask/r/NoStupidQuestions/comments/qltz1n/can_someone_explain_what_this_jfk_jr_coming_back.json": "I keep seeing videos where there are videos of thousands gathering where JFK Sr.\nwas assassinated 50+ years ago how can they think he will make an appearance he\nwould be 104?",
  "data/reddit-ask/r/NoStupidQuestions/comments/qm0usm/why_do_people_bully_me_for_wearing_fingerless.json": "I (22F) bought a pair of faux leather fingerless gloves, and I think they look\ncool. They also keep my hands warm while letting me do more dexterous tasks.\nHowever, my peers and family don’t seem to appreciate them like I do. “Okay\nJoseph Joestar” “are you trying to look like an incel?” “You know…",
  "data/reddit-ask/r/NoStupidQuestions/comments/qm575x/why_are_printers_so_unbelievably_difficult_to.json": "I live and breathe technology so it’s not like I’m bad with what I’m doing but I\nswear there is not a single thing more frustrating than dealing with a printer.\n\nWhy is it so annoying?",
  "data/reddit-ask/r/NoStupidQuestions/comments/qmi1pi/do_ants_ever_revolt_against_the_system.json": "I have seen how loyal, obedient and workolic ants are they are willing to die\nfor their colony and I heard that they don't sleep in their lifetime. They keep\non working until they die. It seems like a robotic society which I can't even\nimagine in human world but why don't they revolt against such…",
  "data/reddit-ask/r/NoStupidQuestions/comments/qmkkq8/why_do_some_chiropractors_call_themselves_doctors.json": "They're not.\n\nBackstory: I work in the medical field.\n\nConcern: Physicians get certified for a DO, MD, etc. Chiropractors, to the best\nof my knowledge, don't have to do any of this and still call themselves 'Dr.\nSuch&Such'. I'm just flummoxed by this TBH. The other day I called a\nchiropractor's…",
  "data/reddit-ask/r/NoStupidQuestions/comments/qmkzhm/whats_the_deal_with_the_trend_of_twitter_profiles.json": "I have Asperger's, and I think it's a private matter. Nobody needs to know that\nunless i willingly tell people. Yes, I understand the irony of this post.",
  "data/reddit-ask/r/NoStupidQuestions/comments/qml6og/why_do_parents_name_their_children_super_common.json": "Not that you have to name your kid something totally unique (names like\n“Braxton” are just cringe), but why would you want your kid to have one of the\ntop 10 most common names? The number of Emily’s and Matt’s I know are\nridiculous. I can’t imagine wanting to name my kid the same thing as a…",
  "data/reddit-ask/r/NoStupidQuestions/comments/qmlj53/is_it_just_me_or_does_72_degrees_with_ac_on_feel.json": "72 degrees is 72 degrees… but why does A/C make it a cold 72 degrees and heat\nmake it a more hot 72 degrees? Or am I just crazy? Cause that’s 100% a\npossibility.",
  "data/reddit-ask/r/NoStupidQuestions/comments/qmnbzi/if_you_had_an_identical_copy_of_you_and_had_sex.json": "will it be considered homosexual or masturbation? or a homosexual masturbation?\nor incest?\n\n\n\nEDIT: My current answer based on comments: selfcest (thanks to u/asterJ\n[/u/asterJ]), tho i think it is safe to say its pansexual ( u/Toystorations\n[/u/Toystorations])",
  "data/reddit-ask/r/NoStupidQuestions/comments/qn7a82/is_it_weird_to_feel_mentally_younger_than_you.json": "Edit: I've read quite a few comments that suggested that I'm dating underage\ngirls or something... Why would some of you assume such a horrendous thing?\n\nI said 16 and not 18 because the last two years of high school I had easy\nclasses (took all my hardest classes my first two years of high school)…",
  "data/reddit-ask/r/NoStupidQuestions/comments/qncwjd/does_anyone_else_count_the_amount_of_strokes_of.json": "I've been doing this for years and NO, I do not have an OCD.",
  "data/reddit-ask/r/NoStupidQuestions/comments/qncxm0/whats_the_deal_with_men_refusing_to_wear_condoms.json": "And not just young men who may or may not be particularly mature and therefore\nmaybe somewhat excused.. But also men in their late 40s. I mean why?? Why don't\nthey want to be protected against diseases and unwanted pregnancies?\n\nAnd additional question.. Why don't the women they hook up with talk…",
  "data/reddit-ask/r/NoStupidQuestions/comments/qngyjk/are_there_any_literal_sex_films_like_the_whole.json": "Okay, so when I first heard about porn movies when I was a kid, I always\nimagined them as normal movies, where they have several characters, a plot, and\neverything a normal film that you'd see in the cinemas, but it's a porn. Now I'm\nwondering if anything like this exist, or not.",
  "data/reddit-ask/r/NoStupidQuestions/comments/qnhiqo/arent_dress_codes_at_least_somewhat_sexist.json": "I don’t mean dress codes with obvious utilitarian intent (things like requiring\nuse of certain protective clothing/equipment or saying you have to wear a\nuniform) for your job.\n\nI mean things like explicitly forbidding male employees from having long hair,\nbut allowing females to have long hair, as…",
  "data/reddit-ask/r/NoStupidQuestions/comments/qnlv0c/if_mike_wazowski_scratches_the_bottom_of_his_head.json": "My friends were watching Monsters Inc. and they asked this question. I'm\nhonestly as puzzled by the thought as they are and we're looking for some kind\nof answer.",
  "data/reddit-ask/r/NoStupidQuestions/comments/qo0ek9/any_man_have_and_always_had_zero_interest_in_cars.json": "Granted, I don't drive. Maybe it's a \"if you don't play guitar, you most likely\nwon't care about guitars\" situation but even back in school with my friends,\nbefore we were even old enough to be allowed to drive, they were already quite\ninterested in cars.\n\nI even tried to get myself into cars, but…",
  "data/reddit-ask/r/NoStupidQuestions/comments/qo1qxf/if_your_father_dies_and_your_mother_dates_someone.json": "Title",
  "data/reddit-ask/r/NoStupidQuestions/comments/qoa9e0/why_do_redditors_delete_their_entire_account.json": "I see it all the time. Random comments where the entire account was deleted\nwithin a few hours of making it. Upvotes/downvotes.. doesn't really seem to\nmatter.",
  "data/reddit-ask/r/NoStupidQuestions/comments/qoa9uq/why_do_kids_scream_like_they_are_being_eaten_by_a.json": "I live in a suburban neighborhood that has lots of little kids. I never see them\nbut I hear them screaming like Mike Myers is after them and I can't tell if they\nare having fun or if the screams are real.",
  "data/reddit-ask/r/NoStupidQuestions/comments/qp20cy/what_do_we_need_to_do_to_end_daylight_savings_in.json": "Seriously most people hate it. What actually needs to happen to get rid of it? A\npetition or something to get the ball rolling?",
  "data/reddit-ask/r/NoStupidQuestions/comments/qp6058/ftm_dudes_what_is_a_manufactured_penis_like_now.json": "If you have had bottom surgery recently, and you’re a dude, I’m really curious\nto know:\n\nWhat is the quality of the poles they are building in 2021?\n\nWhat is the sensation like? How is it…’wired’ to the rest of your system?\n\nCan you get hard on your own, do you need a pump?\n\nSo curious.\n\nEDIT:…",
  "data/reddit-ask/r/NoStupidQuestions/comments/qpc1g6/im_currently_paying_for_a_storage_unit_that_only.json": "long story short yes I used to be a lonely weirdo and I bought a sex doll when I\nwas drunk then one day I got a girlfriend and I had no idea what to do with the\ndoll so I got a storage unit and put it in there but I'm tired of paying $60 a\nmonth for the unit and then I found out the other day that…",
  "data/reddit-ask/r/NoStupidQuestions/comments/qpl6a0/can_a_pet_name_be_racist.json": "We recently moved to US from India and we have a black dog named 'blackie',\nwhich is a common pet name back home. One of our white neighbor said it was very\noffensive and we should change the name. She said everyone in the neighborhood\nfeel the same and asked her speak with us. The problem is he had…",
  "data/reddit-ask/r/NoStupidQuestions/comments/qptw0n/american_mega_church_pastors_look_like_the_worst.json": "I cannot imagine looking at any of the mega church type pastors with anything\nother than distrust, they look like horrible people living lavish lives under\nthe protection of religion. Do people in those churches feel the same way but\nthink it's an acceptable situation for potential eternal heaven or…",
  "data/reddit-ask/r/NoStupidQuestions/comments/qq0ofj/how_do_i_learn_the_way_young_people_text.json": "Is \"lol\" outdated? Will tagging a message with \"haha\" make me a boomer? Should I\nstop capitalizing?\n\nI get very, very anxious texting my peers but am stubborn enough to not want\nnatural selection to weed me out of a normal social life.",
  "data/reddit-ask/r/NoStupidQuestions/comments/qq1zds/how_did_most_baby_boomers_go_from_not_believing.json": "Basically, just ... what happened ??\n\nI remember seniors over ten years ago preaching to me that I shouldn't believe\neverything I see on the Internet, and now when I go to Facebook ... damn it,\nthey all seem to be out of their minds.",
  "data/reddit-ask/r/NoStupidQuestions/comments/qqbnas/how_am_i_supposed_to_feelreact_to_my_transgender.json": "Ok, so long story short my 14 year old was born a girl and last night he said\nthat he is trans and his name is Eugene and his pronouns are He/him. My kid came\nout to me a few months earlier as gay. My wife and I have been supportive and\nencouraging that if that is what makes them happy, we support…",
  "data/reddit-ask/r/NoStupidQuestions/comments/qqksbw/who_else_prefers_talking_to_a_person_one_on_one.json": "It ruins everything when more people join in.",
  "data/reddit-ask/r/NoStupidQuestions/comments/qqm99u/if_the_universal_studios_logo_were_actually_real.json": "Couple things: 1. How fast would it need to move to stay in orbit 2. Is the\nspeed shown in the Universal logo video clip appear to reflect that speed?\n\nDifferent versions of said logo for reference. [https://youtu.be/vr2-63zzmJg]",
  "data/reddit-ask/r/NoStupidQuestions/comments/qqqbrr/anyone_else_go_through_life_feeling_sub_par_i.json": "Sorry for the depressing title. But I was wondering if anyone else felt the way\nI do.\n\nI’ve been average or less than average on most everything in life. But I knew\nfrom an early age I wasn’t very smart. And although I waited for any hidden\nskills or talent to form, nothing ever did.\n\nI understand…",
  "data/reddit-ask/r/NoStupidQuestions/comments/qqqdy4/is_it_weird_to_get_turned_on_by_your_own_boobs.json": "I find sometimes I'm sat down and I just look down when I'm wearing a low cut\ntop and suddenly feel the need to take pics (just for me to look at in a\nnarcissist kind of way) or uh... engage in single player mode.\n\nIs this weird?",
  "data/reddit-ask/r/NoStupidQuestions/comments/qr0kin/female_virgin_here.json": "Me and my bf are meeting in January and I've been thinking more about being\nintimate. I'm excited about being close and intimate with him but by this point\nfears and worries are kicking in.\n\nWhat if he's too big for me? What if I'm not good enough. I want to discuss this\nwith him beforehand.\n\nI was…",
  "data/reddit-ask/r/NoStupidQuestions/comments/qr4mv4/why_do_people_get_mad_at_billionaires_for_evading.json": "Title. Tax evasion is definitely bad. It’s odd to me we’re not trying to coerce\nthe government into better spending practices, which is something normal people\nhave perhaps more control over the outcome\n\nTLDR policy makers are focusing on taxing billionaires— which is great. But it\nseems nobody, not…",
  "data/reddit-ask/r/NoStupidQuestions/comments/qr5l8w/why_are_people_concerned_about_whats_legal.json": "Far too many times in my life, I see people justify awful behavior by claiming\nthat it's not illegal. That's quite a low bar to clear. You can be a repugnant\nhuman being who regularly does horrible things but as long as nothing you do is\nillegal then everyone's supposed to be okay with that?…",
  "data/reddit-ask/r/NoStupidQuestions/comments/qrivw0/is_anyone_else_scared_they_will_never_make_a.json": "i never grew up with parents telling me i needed to go to college, or how to get\na career, i didn't really care about school and i feel like im so far behind. i\nunderstand that most people dont have their life \"together\" at my age, but it's\ngetting to the point where i have no sense of direction and…",
  "data/reddit-ask/r/NoStupidQuestions/comments/qrkzbt/do_women_really_only_dress_up_for_themselves.json": "I tried posting on askwomen, but they require what/when/where questions.\n\nI always see women criticising people for saying they don't wear make up and\ndress up for other people, it's for themselves. But do you think that is\nactually true? I am a woman, and when I'm sat at home on my own on…",
  "data/reddit-ask/r/NoStupidQuestions/comments/qrn3j5/if_someone_had_a_handgun_and_removed_the_magazine.json": "If so would the gun still be able to fire the bullet with the magazine emptied?\nOr does it depend on the gun?\n\n(Brit here, not an expert on guns.)",
  "data/reddit-ask/r/NoStupidQuestions/comments/qrpp2s/is_it_cringe_to_have_your_pronouns_in_your_social.json": "In my case, I have written he/him in my Instagram bio. Got in an argument where\na person said unless I am a 15 year old girl with blue hair who thinks she is a\ntrans, It's cringe to mention my pronouns.",
  "data/reddit-ask/r/NoStupidQuestions/comments/qrut55/why_is_the_reddit_video_player_so_remarkably_awful.json": "Does anyone actually enjoy using it? Is there any real advantage to it? Why is\nit so slow? Was it developed by an intern?\n\nWhy can’t I rewind without causing it to re-buffer the entire video? Why is it\nfaster to re-open the video than it is to rewind? Why the fuck do users here\nactually use the…",
  "data/reddit-ask/r/NoStupidQuestions/comments/qrz41u/is_my_dog_aware_that_i_am_not_a_dog.json": "I’ve been wondering about this lately.",
  "data/reddit-ask/r/NoStupidQuestions/comments/qs9gr4/i_have_health_insurance_for_the_first_time_in_my.json": "I've never been educated on how health insurance works. I grew up poor and in a\nmessed up family. I've been working on my independence for years and I'm finally\non an insurance plan and after years of hearing \"Just talk to your doctor\" I\ngenuinely don't know what it means to \"have a doctor\"\n\nDo I…",
  "data/reddit-ask/r/NoStupidQuestions/comments/qs9nvj/whats_a_better_way_to_call_something_retarded.json": "I don't like using the word because of the connotation, but it hits the spot in\ncertain contexts. What other cuss words can I use in its place that are\nsimilarly apt",
  "data/reddit-ask/r/NoStupidQuestions/comments/qsdxqi/my_new_refrigerator_has_sabbath_mode_what_would.json": "(I'm not Jewish, apologies if any of this offends) I'm guessing its some kind of\na low power mode on Saturdays? Or does it lock the doors for fasting purposes?\nidk. Is this a common thing I've just never noticed? I'm very curious.",
  "data/reddit-ask/r/NoStupidQuestions/comments/qsf1a8/what_the_heck_is_up_with_this_totally_gross_nsfw.json": "Alright, so go to Youtube, type a Period (.) in the search bar, and a bunch of\nweird letters and symbols as search suggestions will show up, click the first\none.\n\nJust did it by accident and it leads to just all sorts of disturbing videos.\nLike, stuff that seems it SHOULD NOT be on Youtube.\n\nWhat…",
  "data/reddit-ask/r/NoStupidQuestions/comments/qslz3q/how_many_people_have_been_within_10_feet_of_a_cow.json": "I told my GF that I've never been within 10 feet of a cow and she said I was\nweird. Like what percentage of Earth's population has honestly been within 10\nfeet of a cow?",
  "data/reddit-ask/r/NoStupidQuestions/comments/qt1cz1/why_is_death_such_a_frowned_upon_alternative_to.json": "If someone is ill or in pain, and has been for a significant period of time with\nno foreseeable end, why is there such an emphasis on preserving the life,\nparticularly if the person is wanting to die?\n\nFor people who are ill, they are put onto life-support systems, or the mentally\nill are put on…",
  "data/reddit-ask/r/NoStupidQuestions/comments/qt26ip/do_you_smell_the_snow_coming.json": "Small talk while at a gas station, counter clerk commented about how it was\ngetting cold and winter was coming. So I said “yes, I can smell the snow is\ncoming”. Please tell me I’m not the only one that can smell the snow or rain\ngetting ready to drop on our heads.",
  "data/reddit-ask/r/NoStupidQuestions/comments/qt2ntb/grandma_died_but_grandpa_doesnt_know_should_we.json": "My grandma died 2 days ago, she was 74. Her funeral was yesterday. My grandpa,\nwho is 89 and her husband, is immobilised in bed and also very sick.\n\nMy mum (their daughter) thinks she shouldn't tell my grandpa that his wife died,\nbecause that would break him and it would accelerate his death. My…",
  "data/reddit-ask/r/NoStupidQuestions/comments/qtguow/why_for_a_site_as_big_as_reddit_does_its_search.json": "I can search for what I want to find on Reddit and find posts that don’t relate\nat all. Then I can go on google, type the same search and add the word ‘Reddit’\nafter and find tons of articles about what I was searching for\n\nHow can a site this big not have a functional search feature?",
  "data/reddit-ask/r/NoStupidQuestions/comments/qtnaon/why_doesnt_reddit_have_a_seen_it_before_button_so.json": "Im not talking about a cross post but the same image or video appearing again\nand again and again, over the course of days, weeks and even years. After the\n10th or 50th time I’ve seen the same post, I’d like to be able to mark it as a\nduplicate to, at least, removed from my feed. If enough people…",
  "data/reddit-ask/r/NoStupidQuestions/comments/qtwkr0/what_do_people_mean_when_they_use_decimals_for.json": "This drives me crazy. Looking at a measurement and it says 3.2 ft. Does that\nmean 3’2” or literally 3.2 ft? Further, same thing with years. Something like\n2.6 years. Does this mean 2 years and 6 months or literally 2.6 years?\n\nThank you!",
  "data/reddit-ask/r/NoStupidQuestions/comments/qu4qyz/its_not_racist_to_not_be_sexually_attracted_to_a.json": "I’m a tall white guy. I was hanging with a group of friends and acquaintances\nhaving burgers and beers. The topic of attraction was brought up. Everybody was\ntalking about height, build, hair color, etc.\n\nI mentioned that I’m attracted to white women and I love Latina’s. Then a girl\nasked about…",
  "data/reddit-ask/r/NoStupidQuestions/comments/qu9rou/why_do_many_americans_seem_to_have_a_problem.json": "I live in Sweden, and I don't know how many times we have been called socialist\nin America (Bernie Sanders) or, at best, Democratic Socialist. Some even call us\ncommunist.\n\nWe're not. We're a social democracy. Socialism is Cuba and old Soviet, and\nDemocratic Socialist are countries like Venezuela.",
  "data/reddit-ask/r/NoStupidQuestions/comments/quii3w/do_anyone_else_get_a_holy_shit_im_alive_thought.json": "Everytime I think about it I get weirded out and I feel very confused. Another\nexample can be like “Damn, I own a dog”",
  "data/reddit-ask/r/NoStupidQuestions/comments/qukvzz/as_a_new_father_id_love_to_introduce_my_son_to.json": "Sorry if this doesn’t belong here, I just feel stupid for having to ask.",
  "data/reddit-ask/r/NoStupidQuestions/comments/quo0qu/what_happened_if_you_made_a_typo_wile_using_morse.json": "It just occurred to me that you can't really hit the delete key, so how did you\nrecognize and fix a mis-typed Morse message?",
  "data/reddit-ask/r/NoStupidQuestions/comments/quu64d/where_can_i_play_with_a_parachute_like_we_did_in.json": "Remember being in kindergarten or grade school and they would pull out this huge\nsilk multicolored parachute and we'd bounce balls on it or make it all puffy and\nrun under it or play other games?\n\nI do, and I want to do it again but with other adults. Maybe even slightly\ndrunk/stoned adults.\n\nI've…",
  "data/reddit-ask/r/NoStupidQuestions/comments/quw48y/does_life_get_better_after_high_school_i_hope_so.json": "My only motivations for going to school is to get out of it, and move on with my\nlife and doing something I love. Often times my encounters with students are\ndreadful and leave me scared to go to school and self conscious. This is a\ngenuine question I am asking, and I want to know some of your…",
  "data/reddit-ask/r/NoStupidQuestions/comments/qv3nsp/an_atm_gave_me_too_much_money_wtf_do_i_do_if.json": "Late at night (1am) I remembered I needed to pay a friend $60 cash for some work\nhe did, by the next morning. I figured I go hit up the ATM before I go to bed\ninstead of having to do it in the morning.\n\nI go to the ATM, it's one of those outside ATMs. There's no one around, it's 1am\non a Monday and…",
  "data/reddit-ask/r/NoStupidQuestions/comments/qvdpra/i_cant_be_the_only_person_who_is_incredibly_happy.json": "Have to stop and take pictures with your brother and mom holding drinks because\nyou have Jamba juice so she can post it to Facebook, you have to stop and take a\npicture of you all getting ice cream cones, have to wait for your mom to finish\nit food because she took an extra 15 minutes to take a…",
  "data/reddit-ask/r/NoStupidQuestions/comments/qvglii/why_do_humans_seem_to_be_the_only_animals_that.json": "Seems like humans are the only animals that can't just grab a living creature\nand start eating it, skin and flesh all together. This seems like an evolution\nsetback and was curious as to why this is",
  "data/reddit-ask/r/NoStupidQuestions/comments/qvkibp/what_to_say_to_my_grandpa_for_our_final_goodbye.json": "My grandpa is expected to pass away in the next 24 hours. I live out of the\ncountry, but we’ve remained close, and I visit and call whenever I can. He’s\nbeen physically sick for nearly a decade, but his mind and personality are\nintact. In a few hours, we’re going to have a video call, which likely…",
  "data/reddit-ask/r/NoStupidQuestions/comments/qvsibe/did_anyone_else_ever_think_that_animal_testing.json": "what do they actually do to them?",
  "data/reddit-ask/r/NoStupidQuestions/comments/qw48to/is_it_common_for_women_not_to_finish_when_having.json": "I (22F) have only been with one person who consistently made me finish during\nsex (ie. listened to what I wanted/needed to finish). All the other men I’ve\nbeen with have either not cared enough to make me finish, or flat out have\nrefused to even try.\n\nI understand that your partner should try to…",
  "data/reddit-ask/r/NoStupidQuestions/comments/qwb871/im_attracted_to_men_but_intimidated_by_the_idea.json": "I know the title might be a bit crude but I seriously have no idea how to phrase\nit.\n\nAll my life I've known that I'm attracted to both men and women but the idea of\nhaving anal sex makes me very uncomfortable (with either cis men or women). I've\nnever been sexual with another man and I'm honestly a…",
  "data/reddit-ask/r/NoStupidQuestions/comments/qwj5fe/how_do_americans_pay_those_massive_hospital_bills.json": "Australian here, but browsing through Reddit you sometimes see those posts and\ncomments about exorbitant hospital bills going into thousands if not tens or\nhundreds of thousands for even the most basic treatments.\n\nGiven that people in the replies never seem very surprised, it sounds like this\njust…",
  "data/reddit-ask/r/NoStupidQuestions/comments/qwqg79/do_americans_not_use_trains_often.json": "I'm European and I was talking to an American the other day about trains, and\nthey said they'd never been on a train before. That was kind of shocking to me.\nHow do people without a car get around then?",
  "data/reddit-ask/r/NoStupidQuestions/comments/qwvcnf/do_americans_learn_metric_in_school.json": "I'm European, we use metric for everything, such as meters and kilograms.\n\nI understand simple conversions like meters and feet, kilograms and pounds.\n\nBut how about derived units? E.g., in physics class, we are taught Force = mass\n* acceleration. Mass is in kg, acceleration is in m/s2. Hence, the…",
  "data/reddit-ask/r/NoStupidQuestions/comments/qwx2w7/why_is_high_fashion_so_ugly.json": "Who would wear a gigantic super puffy coat over a tiger striped blouse with a\nsouthern belle hoop skirt and crocs?",
  "data/reddit-ask/r/NoStupidQuestions/comments/qx2vp0/does_anyone_feel_like_they_cant_get_back_to_being.json": "I spent all of the lockdowns thinking that now I knew what it was like to be\ntrapped, I would never let anything hold me back again. When lockdown ended I\nwas going to go backpacking round the world or some shit, I can't even remember.\nBut I was raring to go, waiting for my freedom, for nearly two…",
  "data/reddit-ask/r/NoStupidQuestions/comments/qx7a3z/why_do_medical_residents_need_to_work_insanely.json": "You would also think, in such a sensitive profession, that lack of sleep (which\nincludes several interruptions to sleep) could lead to poor decision-making and\ndepleted fine motor skills- not the best combination.\n\nGoogle wasn’t helpful. Thanks for any and all explanations",
  "data/reddit-ask/r/NoStupidQuestions/comments/qxgcdz/is_it_a_labour_law_violation_for_my_boss_to_ask.json": "Like I’m not saying everyday he comes out and asks us, it’s just kind of\nexpected that you stay 20-40 minutes late every shift and if you don’t he’ll\ncall you a clock watcher and accuse you of not showing any effort in your job.\n\nI mentioned to him once that I’m pretty sure it’s a labour law…",
  "data/reddit-ask/r/NoStupidQuestions/comments/qxh179/why_is_america_giving_its_citizen_so_little_aid.json": "Canadian government gave $2,000/month in 2020. Meanwhile the American government\nonly gave 2 checks of 1,200 in 2020 and 2021. Why is American government giving\nso little aid?",
  "data/reddit-ask/r/NoStupidQuestions/comments/qxh570/am_i_being_entitleda_crybaby_or_should_a.json": "So I work at a law firm as a receptionist. And I'm perfectly fine with doing\nwork. I love staying busy, I've worked fast food and retail before this and will\nalways focus and do a task I'm given and seek out work to do when there's\nnothing to do. This isn't a matter of laziness.\n\nHowever, I find…",
  "data/reddit-ask/r/NoStupidQuestions/comments/qxhafd/what_is_the_correct_answer_when_someone_says_you.json": "Cute girl at work told me out of nowhere that I had very beautiful eyes. I\nresponded by saying, ''Thanks, you too.'' 🤷‍♂️",
  "data/reddit-ask/r/NoStupidQuestions/comments/qxowxd/whats_the_story_behind_your_reddit_username.json": "I'm genuinely curious. I often see many unique names or interesting phrases, or\neven just letters and numbers that seem arbitrary, and I always wonder what the\nstory behind some of them might be.",
  "data/reddit-ask/r/NoStupidQuestions/comments/qxpphm/do_animals_not_taste_ass_and_all_the_fecal_matter.json": "I've watched a bunch of animals hunt and usually they bite the neck to kill the\nprey then start eating it from places like the anus. Do predators not have taste\nbuds to taste fecal matter that could carry disease causing bacteria? Or do they\njust like the taste?",
  "data/reddit-ask/r/NoStupidQuestions/comments/qxtrv5/does_scotland_have_deserts.json": "I am reading Frankenstein and during a certain part the monster talked about\ndeserts in Scotland and when I google it I don't really get a clear answer.\n\nThanks:-)\n\nTo clarify: I'm talking about arid land, not a food\n\nEdit: thanks y'all for your answers! I HIGHLY recommend reading Frankenstien btw\nI…",
  "data/reddit-ask/r/NoStupidQuestions/comments/qxyo5k/which_toilet_do_i_go_to_with_my_daughter.json": "Hi, so yesterday in a mall, my 4 yo wanted to go pee so I took her to the\nbathroom, she used mens bathroom no problem. Today she refused that and demanded\nto go to ladies so I took her there. Noone was there at the start but while she\nwas doing her business some girls came, stopped and gave me…",
  "data/reddit-ask/r/NoStupidQuestions/comments/qy6w0l/how_do_new_parents_not_die_of_sleep_deprivation.json": "I recently read that babies need to eat every 2 hours so you will have to wake\nup every 2 hours at night to breast feed or bottle feed.\n\nA common form of torture in prison is to frequently wake up prisoners so they\ncan never reach deep sleep.\n\nConsidering that babies are babies for months or years,…",
  "data/reddit-ask/r/NoStupidQuestions/comments/qy8g3x/are_home_baked_goods_okay_as_christmas_presents.json": "Hi all,\n\n\n\nI hope you mean it with \"no stupid questions\" I don't have a lot of money to be\nable to buy all my friends cool gifts for Christmas.. but what I do have is\nplenty of baking goods, and I can afford a few extra ingredients. Would a\nhandmade loaf of bread and a handmade jam (my stuff is…",
  "data/reddit-ask/r/NoStupidQuestions/comments/qymlq0/why_do_people_hate_greta_thunberg.json": "i just feel like there's a disproportionate amount of ill will toward her? i\nwatched her speech at the UN, but i don't follow her closely. it just seems like\nthe cultural reaction to her was a bit... strange??",
  "data/reddit-ask/r/NoStupidQuestions/comments/qysoaa/anybody_elses_legs_die_when_theyre_on_the_toilet.json": "Sent from an undisclosed location.",
  "data/reddit-ask/r/NoStupidQuestions/comments/qyxc44/i_need_to_know_am_i_the_only_one_that_finds_lip.json": "I'm not trying to offend anyone. I think that anyone should be able to do\nwhatever they please to thier own body that makes them feel good about it. But\nas a heterosexual male I find lip injections completely repulsive. What does\neveryone else think? Am I crazy?",
  "data/reddit-ask/r/NoStupidQuestions/comments/qyy6an/why_can_money_be_immediately_debited_from_my.json": "It can’t have taken 7-10 days for them to get my payment, otherwise they\nwouldn’t send my stuff. So why does it take so long one way but not the other?",
  "data/reddit-ask/r/NoStupidQuestions/comments/qzgr3m/does_anyone_else_cope_with_their_anxiety_by_not.json": "And how do you deal with this?",
  "data/reddit-ask/r/NoStupidQuestions/comments/qzmrdw/why_do_people_participate_in_popular_streamers.json": "Ok so I hope the title makes sense, but basically, I watch a lot of livestreams\nand I never bother looking at the chat because it moves too fast to even read.\nI’ve never felt inclined to type anything in the chat because I know like maybe\n1% of the viewers will see it, let alone the streamer. I…",
  "data/reddit-ask/r/NoStupidQuestions/comments/qznh0b/my_girlfriend_says_she_wants_me_to_share_with_her.json": "Edit: I really appreciate all the good advice I’m getting. You’re all very kind.",
  "data/reddit-ask/r/NoStupidQuestions/comments/qzs0rb/my_boyfriend_20m_cuddled_his_friend_girl_and_got.json": "Hey, this is my first reddit question. I'm currently in a serious relationship\nwith my boyfriend for almost 4 years. Recently, he went on a vacation with his\nfriends and his friends got super drunk and horny. My boyfriend was tipsy and he\nwas also horny. One of his friend which is a girl, wanted to…",
  "data/reddit-ask/r/NoStupidQuestions/comments/qztwem/how_do_you_kiss_someone_almost_a_foot_shorter.json": "I went on a really great date yesterday and really liked the girl but she’s\nalmost a foot shorter than me. That doesn’t bother me at all but it did stop me\nfrom asking to kiss her at the end because I didn’t know how to do it without it\nbeing weird.\n\nI have metal rods in my spine because of…",
  "data/reddit-ask/r/NoStupidQuestions/comments/r09s51/i_have_no_dreams_or_ambitions_is_this_abnormal.json": "I've always had a 'roll with the punches' attitude toward life, and never really\ndesired anything. As a kid, i wanted toys, but growing up i've realized i'm just\nliving like an NPC. Is this weird?",
  "data/reddit-ask/r/NoStupidQuestions/comments/r0c1u9/how_does_one_remove_live_cockroaches_from_a.json": "So this morning I went to empty my coffee machine tray of excess water and saw 2\nbig ones and a few small babies run back up into the machine, after 20 minutes\nof screaming and fear I got the dam thing and put it outside, pulled out the\ntray and sprayed some bug spray in the tray I saw them in, now…",
  "data/reddit-ask/r/NoStupidQuestions/comments/r0lj6p/in_the_us_why_do_employers_try_to_stop_people.json": "Isn’t unemployment paid by the government? Why does it matter to employers\nwhether someone they fired are claiming it?\n\nEdit: I’m not asking “why” in the philosophical sense, but rather how does the\nUS unemployment system work and what makes it incentivise employers to do this.",
  "data/reddit-ask/r/NoStupidQuestions/comments/r0owdw/is_it_normal_to_feel_just_fine_about_never.json": "Or is it just the introvert at me. During the height of the pandemic last year I\nloved using the pandemic as a reason to not attend parties or obligatory family\ngatherings for not going. Now since things are allegedly better regarding the\npandemic people are expecting to see more of me or wanting to…",
  "data/reddit-ask/r/NoStupidQuestions/comments/r0r546/if_somebody_found_46_million_dollars_in_their.json": "Hypothetically.",
  "data/reddit-ask/r/NoStupidQuestions/comments/r0rfrg/are_men_really_that_much_stronger_than_women.json": "I’m a man, and recently I’ve been seeing post about women being weaker than men\nexponentially. This post\n[https://www.reddit.com/r/tifu/comments/qulzyd/tifu_by_showing_my_girlfriend_my_actual_strength/?utm_source=share&utm_medium=ios_app&utm_name=iossmf]\nis the one that surprised me a lot. It made…",
  "data/reddit-ask/r/NoStupidQuestions/comments/r0v6zq/i_passed_a_car_with_the_hazard_lights_on_it_was.json": "It is 10 pm on a dark highway I am a woman alone; is it really expected that I\nshould stop and check on the occupants of a disabled car?",
  "data/reddit-ask/r/NoStupidQuestions/comments/r12gsu/why_do_some_women_get_angry_at_men_for_cheating.json": "I thought this was just a joke till I experienced it myself. This is just\ninsanely stupid to me. Why? I've had dreams where someone's with my gf and when\nI wake up, my thought is \"Thank God that was a dream\" and I move on.",
  "data/reddit-ask/r/NoStupidQuestions/comments/r17c6k/will_doing_yoga_3060_minutes_a_day_help_me_lose.json": "Edit: A lot of people are commenting here purely to lecture me about how\ncalorie-deficit and healthy diet is the best way to lose weight. I already know\nthis. My question is about the effects of yoga specifically.",
  "data/reddit-ask/r/NoStupidQuestions/comments/r19nt9/am_i_only_woman_whose_dad_had_a_talk_with_her.json": "I just read the post about not realizing the average male is far stronger than\nthe average female. It just seemed odd to me because as a very athletic very\nstrong young woman, my dad made sure I knew that I better outrun any man trying\nto hurt me because if he got his hands on me, it was over. We…",
  "data/reddit-ask/r/NoStupidQuestions/comments/r1ao5l/if_testosterone_helps_men_with_strength_and_size.json": "Thinking about an earlier post on men's strength I started thinking. Title,\nbasically.",
  "data/reddit-ask/r/NoStupidQuestions/comments/r1el0o/did_reddit_remove_the_ability_to_scroll_back_up.json": "Hey guys for the last couple days, I have been unable to scroll back up on my\nphone in reddit posts. When I try, it goes to refresh the post instead of just\nscrolling back up.\n\nThanks",
  "data/reddit-ask/r/NoStupidQuestions/comments/r1g3ka/whats_a_tactful_way_i_can_tell_my_wife_to.json": "I don’t want to offend her or make her upset, please help me.\n\nEdit: holy shit my first award? Thank you (?)\n\nI should clarify, she usually takes care of it but it’s been a while since she’s\nshaved and want to know the best way to bring it up. Thank y’all for your\nresponses thus far",
  "data/reddit-ask/r/NoStupidQuestions/comments/r1hq4a/am_i_weird_for_thinking_my_wifes_weird_for.json": "Edit: She came out of the bathroom just a moment ago and said “you asked f******\nReddit”? She’s not talking to me now but if you read this Hunny, I told you it\nwas weird.",
  "data/reddit-ask/r/NoStupidQuestions/comments/r1zwja/how_do_you_tell_your_significant_other_youre.json": "In terms of phrasing. Like I'm going to take a crap, shit, dump, poo, dookie\nsquat? Surely there's some creative phrasing for this.",
  "data/reddit-ask/r/NoStupidQuestions/comments/r2c9e7/what_happens_if_youre_going_number_2_the_fbi.json": "I'm jw, bcz in movies they always break doors down, throw a guy off a girl while\nhaving sex or vise versa, grab them outta the shower etc. Would they do that if\nsomeone's on the toilet with a turd hanging out, or explosive diarrhea??",
  "data/reddit-ask/r/NoStupidQuestions/comments/r2gnso/whats_the_least_awkward_way_of_asking_your.json": "Tried attemps 1) Checking mailbox(name not there) 2) Sending link to bullshit\nonline game (put an alias) 3) Checking WhatsApp for nane (Put a - as profile\nname) 4) Asked other flatmate who has been staying with him for almost 6 months,\nhe also has been addressing him \"dude\" since their introduction.",
  "data/reddit-ask/r/NoStupidQuestions/comments/r2vg3d/how_do_i_throw_away_a_trash_bin.json": "My new house came with two big trash bins (the kind you put on the curb for the\ngarbage men to pick up), but we only really need one. We have no idea how to\nthrow the one away, though. The garbage men won’t take it, the dump turned it\naway, and Salvation Army won’t let us donate it. There’s nothing…",
  "data/reddit-ask/r/NoStupidQuestions/comments/r2vw0b/is_it_normal_to_ask_your_teenage_employee_to.json": "Well this is a throwaway account!\n\nSo I(F17) recently got a new job at a large chain store and my Boss(M38) is\ngreat. He’s pretty extroverted and when we talk it’s never awkward or boring.\nHe’s always been especially friendly with me, we have breaks together, he’s\nwalked me home and Although I work…",
  "data/reddit-ask/r/NoStupidQuestions/comments/r2wstj/why_do_people_walk_so_hard.json": "For example, I used to live with my uncle in his basement and they would always\nwalk like they're taking gigantic leaps and pouncing every foot like it's their\nlast.\n\nA kid in high-school pointed out to me one day after jumping off a small ledge\nthat I landed in a very loud way and ever since then…",
  "data/reddit-ask/r/NoStupidQuestions/comments/r31ihk/it_it_my_place_to_discipline_someone_elses_kids.json": "My friend's kids (ages 3 & 5) destroy things in my house when no one is\nwatching. They don't listen. And they hurt my kids until someone notices.\n\nAm I in my place to discipline them if they're in my home and their parents\naren't doing anything about their behavior?\n\n--------------------------------…",
  "data/reddit-ask/r/NoStupidQuestions/comments/r32d1f/do_college_students_just_forget_they_got_accepted.json": "I feel like once I start uni I won’t get over the fact that a literal school\nwanted me. As in they saw my application, thought it was nice and accepted me.\n\nDoes this make sense?",
  "data/reddit-ask/r/NoStupidQuestions/comments/r39r11/how_do_i_respectfully_ask_someone_if_they_have_a.json": "I (straight male) been flirting with this classmate of mine and I want to\nescalate things(sexualy) but the thing is she kinda looks like a dude. All my\nfriends(straight guys and gals) say she's probably trans and i think so too but\nI'm afraid to ask. If she happens to be trans that wouldn't be an…",
  "data/reddit-ask/r/NoStupidQuestions/comments/r3bitq/how_do_women_say_fuck_me_daddy_without_actually.json": "This is kind of puzzled me for a little while. There was never really much of a\nplatform to ask for a while, but now that I remember why is getting called\n“daddy” not just ruining the room? I kind of get “baby” but “daddy” brings up\nsomeone specific. So how do you do it, and if not do you think of…",
  "data/reddit-ask/r/NoStupidQuestions/comments/r3ltre/is_it_rudeunreasonable_that_i_ask_every_partner.json": "I’m a gay man and there have been a number of guys have wanted to have sex with\nme over the years, and the majority wear protection, and some do not. I’ve asked\nwhat their status is and if they take medication or not, and some guys roll\ntheir eyes saying “It ain’t a big deal…”\n\nThankfully I’ve not…",
  "data/reddit-ask/r/NoStupidQuestions/comments/r3saww/how_does_a_does_a_fart_go_around_poop.json": "Gas rises, i get that. But how does a fart, methane gas if you will, go around\nthe poop, and in front to the anus?",
  "data/reddit-ask/r/NoStupidQuestions/comments/r3sdi2/how_does_everyone_deal_with_it.json": "I'm just so floored by how well everyone deals with life, and deals with\nworking. Like, I'm barely working part time, and it just feels like so much of\nmy time is being wasted where I'm working. But then there's people who are full\ntime who are perfectly happy, and even pick up extra hours and all…",
  "data/reddit-ask/r/NoStupidQuestions/comments/r3z01j/do_children_of_liberal_parents_ever_turn_out_more.json": "I feel like the opposite happens quite a lot, but do the children of liberal\nparents ever grow up to become more conservative?",
  "data/reddit-ask/r/NoStupidQuestions/comments/r41xe5/is_it_weird_to_take_your_date_to_eat_ice_cream_as.json": "So, I once heard a girl say that she was weirded out when her date took her to\neat ice cream because she’s an adult\n\nBut like, what’s the issue? Adults eat ice cream too",
  "data/reddit-ask/r/NoStupidQuestions/comments/r49qx3/whats_the_point_of_having_a_home_feed_if_its.json": "This is beyond annoying. Please stop doing this and give me back a home feed\nthat just contains content from the pages I’m subscribed to.",
  "data/reddit-ask/r/NoStupidQuestions/comments/r4blzp/are_there_any_movies_that_have_no_trees_in_it.json": "I had a conversation with my mother, and we couldn't think of a single one. It's\ngetting quite annoying. Please help.",
  "data/reddit-ask/r/NoStupidQuestions/comments/r4cbqn/my_dad_doesnt_know_his_real_age_is_there_a_way_to.json": "Hey, my Dad comes from a village in Turkey. There is no written record about his\nbirth except for 1st of January. Both of his parents have passed on so no one to\nask.\n\nIs there some sort of test to find out his real age?",
  "data/reddit-ask/r/NoStupidQuestions/comments/r4o5hp/do_girlfriends_really_try_to_shove_their_finger.json": "So my girlfriend tries to shove her finger up my ass as a joke, even when I'm\nwearing shorts. I try to do the same thing. She sent me a meme that basically\nsaid\n\nNobody:\n\nMy boyfriend when I simply try to shove my finger up his ass for the 3405560\ntime today as a joke: I'm gonna fucking punch you\n\nI…",
  "data/reddit-ask/r/NoStupidQuestions/comments/r4rl6j/is_it_true_that_if_you_get_in_an_accident_and_a.json": "Or is this a myth?",
  "data/reddit-ask/r/NoStupidQuestions/comments/r4ux55/is_there_any_morally_good_response_to_why_do_you.json": "Let’s face it, unless you are the small percentage of people who actually kill\ntheir own food, you’re buying from stores.\n\nMost of which are supporting factory farming, and even those which don’t, still\naren’t that great.\n\nI was asked why I ate meat recently and I have to say…I didn’t really have…",
  "data/reddit-ask/r/NoStupidQuestions/comments/r53ske/does_anyone_else_get_creeped_out_when_going.json": "I’ve always had this feeling whenever I break out of the map in a video game,\nwhere I get a bizarre nervousness and sense of impending doom, and I have no\nidea why.\n\nI’ve recently seen a lot of videos online about liminal spaces, and the uncanny\nvalley etc., and I’d say it’s related to that. Very…",
  "data/reddit-ask/r/NoStupidQuestions/comments/r5ce1f/how_to_deal_with_downvote_stalker_sorry_if_this.json": "How do I as an average redditor like myself outcompete an even more average\nredditor who's dedicated his spare time to take my valueless karma points?\n\nIs there a bot or something that gets red flags when someone goes through a post\nhistory downvoting everything?\n\ncontext: dude sulked about Asians…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qjuehh/why_is_relationship_advice_on_reddit.json": "I’m not talking about obvious cases of abuse, yes leave if you can. I’m talking\nabout situations where people got into one argument about not going on a date\nthat was planned, the comment section will be like, “oh well they obviously\ndon’t care about you at all so you should leave them, it’s clear…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qk177p/was_this_racist.json": "Tonight a white guy turn up to a halloween house party dressed as Michael\nJackson (from the BAD album cover) a few people there said it was racist because\nJacko was black and he was making fun of a skin condition. Trouble is I know\nthis guy and he does like Michael Jackson he does the dances and…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qk8mp7/why_are_black_people_allowed_to_be_racist.json": "Okay so before people go off and say “racism has to be systematic oppression”\nlet me just say that’s not what I’m talking about I just don’t know another word\nfor it.\n\nI mean like why is it ok that black people are always talking about and\ngeneralizing white people in media? “You look white” or “you…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qkazws/can_i_date_a_muslim_girl_if_im_christian.json": "We go to school together and i really like her but this question wont just come\nout of me maybe this subreddit will help thanks",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qkb5pm/why_are_so_many_people_so_angry_about_cultural.json": "I guess everyone that hasn't been living under a rock these past few years has\nat least heard the term of \"cultural appropriation\". People who wear and use\nthings that aren't from their \"own\" culture get verbally attacked because of it.\n\nAs far as I have understood it popular examples would be non…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qkbgzs/can_i_ask_parents_of_a_mentally_ill_kid_in_my.json": "I know this is a touchy subject, and I do understand the struggles the mentally\nIll have and how hard the parents must struggle.\n\nBut there is this child in my street, from about 5.30ish pm til about 9pm every\nnight he sings awe-fully although any form of singing loud enough and constantly\nwould get…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qkjnpb/why_is_it_considered_racist_to_ask_for_id_on.json": "People get asked for ID when buying cigarettes, lottery tickets, at a bar,\nbefore you enter a casino but I could walk right into my voting poll, simply\ntell them my name and sign away without anyone properly checking for my\nidentification but if they ask to show ID, it's considered racist if the…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qktsnx/how_can_someone_be_nonbinary.json": "I don’t understand how someone can feel neither male or female. I don’t walk\naround feeling like a girl or feel like I have to dress a certain way because\nI’m a girl. I don’t think about feeling like a girl 24/7. I just feel like me.\nBut that doesn’t make me feel non-binary. I feel comfortable…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qkx82p/wtf_do_i_say.json": "What is the proper response to a dick pic? I only ever go \"God damn\" But then\nthey think I don't like it. What the fuck am I supposed to say?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qkyhjf/why_do_my_parents_pull_a_youre_living_on_our.json": "I’m 15. They cancelled our Netflix subscription, i cant buy more than 2 books in\na month, I’m not allowed to wear clothes of my choice or date. Social media is\nprohibited as well, i cant hang out with my friends more than once a month. I\ndont have a phone either. We are an upper middle class family…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ql5f6d/is_it_okay_to_give_a_muslim_person_a_gift_near.json": "My son recently started taking \"Student Transportation\" meaning he gets driven\nto school in a van. The two people that pick him up and drop him off are Muslim.\nThey are so wonderful to my son, always so patient with him.\n\nMy son gets really excited when he sees his driver pull up to the…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qlbeo6/i_dont_know_what_to_do_about_the_imaginary_people.json": "Hello, a bit of a long post, so bear with me, but I could use some advise. No\none knows about this in real life except for my sister but she either is weirded\nout or doesn't seem that interested.\n\nI've daydreamed (not obsessively, ~30 mins per day) about this fictional family\nI created several years…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qlf37w/what_is_qanon_i_have_tried_to_readunderstand_but.json": "I'd appreciate responses from both Democrats and Republicans.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qljsbt/so_why_does_not_offending_people_seem_like_such_a.json": "Yeah, it's not that I am afraid to ask this question it's just that I don't know\nanyone who would give real answers. Basically all I'm asking is why is media\nI.E. stand up comedians and Hollywood movies so terrfied people are going to see\nsomething they don't like, and when people don't like what…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qljx64/do_you_also_sometimes_want_to_disappear_from_this.json": "To start things of, im not suicidal or have any thoughts of ending my life or\nsomething, and I feel sorry for everyone who is, please look for help, you are\nwanted on this world by somebody, I am sure of it.\n\nBut to get back to my question..\n\nI sometimes have thoughts of me not being there anymore,…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qll5sv/god_i_think_ill_get_downvoted_to_hell_but_here_i.json": "Can’t believe I have to start by saying I’m vaxed, that out of the way here we\ngo. I’m sure we will have to do boosters, but there needs to be a bigger\nconversation about when or even IF we will see a vaccine that will last longer\nthan 6 months to a year. How come there are no reports from Maderaor…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qlnysj/is_it_ok_to_not_invite_my_boyfriend_to_all_of_my.json": "First, if you're wondering why this is on too afraid to ask, I've gotten some\nnasty comments about how i should kill myself on other subreddits for some\nsimple questions like talking about how I don't want a dog because of PTSD, so I\nfeel more comfortable here. (Throwaway btw)\n\nBut anyway on to…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qlr09i/is_the_decision_not_to_have_children_selfish.json": "Aside from the fear of giving birth, I don’t think I am mentally and emotionally\nfit to be a parent. Parenting is a huge responsibility, it’s a lifetime\ncommitment. I am emotionally unstable but I’m trying my best to heal. Healing is\nan ongoing and continuous process. It might take a long time…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qm2l6i/is_it_unreasonable_to_expect_not_to_have_to.json": "I have always said I have no issue dating women who have a kid/kids from a\nprevious relationship but lately I'm questioning it. My mother was a single mom\nfor a few years before she met my stepfather and not once was I ever left alone\nwith anyone else she dated. Even with my stepfather, she'd been…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qm5xql/why_are_people_always_telling_introverts_to.json": "Im an introvert and people are usually telling me to socialize more but it\ndrains the fuck out of me. Yet, I don’t hear them tell extroverts to be more\nquiet and introspective.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qm7ccw/whats_your_job_and_how_much_do_you_make_a_year.json": "Since people are too afraid to ask others in real life, why not ask here?\nConsidering the amount of people leaving their jobs and looking for a new\noccupation, hopefully this can be a very helpful thread.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qmda8q/is_sex_really_that_good_for_people.json": "As a single 26[M], I sometimes go on dates and manage to sleep with women.\nHowever, the pleasure from sex feels only marginally better than a wank. It very\nrarely feels worth all the effort of dressing up, usually spending the better\npart of the day and the money spent. Is there anything I am…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qmefut/am_i_an_arsehole_for_hiding_my_familys_financial.json": "I just came across a question on the relationship sub that has me feeling a bit\nsick. It was a girl who said her bf had lied to her about his family having\nmoney and she was pissed off and wanted to break it off with him. Everyone was\non her side, saying to leave him immediately and that he couldn't…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qmfwwk/can_a_girl_feel_wether_i_have_an_errection_when.json": "Asking for a school project…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qmhyo1/why_do_girls_in_hentai_look_like_they_are_12.json": "Felt creeped out by a subreddit that were into this (and lolis), never again\ncuriosity is a bad thing.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qmhz3r/is_it_bad_that_im_actually_looking_forward_to_my.json": "My SO is leaving on business for a few days and I’m going to have the house to\nmyself and I’m really looking forward to some me time alone. Don’t get me wrong\nI LOVE spending time with them and we are doing great . but I don’t think I’ve\nhad the house to myself in a long time. It’s going to be nice…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qmiyvh/what_exactly_makes_suicide_a_bad_thing_or_wrong.json": "i understand how murder is bad but suicide is different because its killing\noneself. isnt it their choice to die?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qmnay8/do_any_americans_out_there_feel_like_were_on_the.json": "I feel like it's over for this country and we're just waiting for the shit to\nhit the fan in a spectacular enough form to finish it off. It seems like\neveryone either has their blinders on and think it's all hunky dory, or they're\nwaiting for something to deliver the final death blow and are in a…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qmqd1a/men_of_reddit_would_you_actually_date_a_tall.json": "Example: 5’8” 230lbs",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qmzauz/why_hasnt_anyone_assassinated_any_presidents.json": "I am genuinely curious as to why Obama or Trump were never assassinated. They\nwere both wildly despised by their opposing sides. Other presidents were also\ncalled terrible but never assassinated. Is it because it's too difficult to\naccomplish? Or are people just scared of what would happen after?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qncanc/is_it_physically_uncomfortable_being_obese.json": "This is something I have legitimately always wondered about but have been afraid\nto ask because of obvious social norms on this. I am not trying to insult anyone\nbut whenever I see someone obese to the point of being called \"big\" I wonder if\nthey are uncomfortable. It honestly looks…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qncz6d/what_is_so_great_about_biden.json": "I am not political. I don't like biden, i don't like trump, obama, bush,\nclinton, or bush senior. I have had the same question about all the last\npresidents. I always get \"well he did this or that\" but what about all the\nstupid garbage they have done...? I am neither left nor right. I hate…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qnf168/are_there_any_other_gay_people_out_there_that_shy.json": "To start,I'm a guy that likes guys. However I've never really been drawn to\n\"Gay\" things. For one Pride parades come off as kind of cringy to me. I went to\none in my hometown and it felt like an excuse for guys to Parade there fetishes\ndown the street and wear rainbow lingerie in public. I don't…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qnhgld/why_does_it_seem_more_socially_accepted_for_women.json": "There are many girls at my school who are openly LGBTQ+ and are very popular and\naccepted by many, but men who are LGBTQ+ get bullied and it can be just a rumor\ntoo.\n\nEDIT: I'd also like to add: Why does it seem like Bisexual people are accepted\nmore as well?\n\nI'm in high school in Canada for…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qnhwq2/my_girlfriend_only_likes_to_receive_during_sex.json": "!!! we’re a lesbian couple so if that upsets you, kindly refrain from responding\nand help out another user<3 !!!\n\nFor background information, i’m her first and we’ve been together for 7 months.\n\nI have never pressured her or have rushed her to do anything she’s never wanted\nto do. She’s voiced her…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qnnrni/the_real_question_is_not_what_are_people_who_take.json": "I can take a five-minute shower if I skip a whole lot of steps. I can take a\nten-minute shower if I skip fewer, but a still significant number of steps. If I\nskip shaving alone I save five minutes. But a full, complete, head to toe\ncleaning requires about 30 minutes. I can do 25 if I skip cleaning…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qnrmnc/why_are_people_still_so_against_weed.json": "I understand the negative effects and perceptions certain programs and \"reefer\nmadness\" has caused, however nowadays I don't see why people don't mind their\nown business.\n\nSome people smoke recreationally whereas others smoke as a form of medicine for\nphysical or mental health issues. Either way -…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qntgx0/do_you_find_names_like_summer_autumn_dawn_wave.json": "My name is on that list and I am thinking of naming my boy one of those name but\nisn't sure if it's a good idea.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qo1pao/why_dont_we_put_toys_and_playgrounds_in_adult.json": "I don't know how to word it better. I mean, a lot of adults LOVE to play. You\njust don't stop loving Lego or electric toy trains as you turn 18. You don't\nstop enjoying playing on a slide or swing. As adults we have to go to \"adult\"\nplaces to do \"adult\" things, fill documents and wait in lines and…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qo8ds2/how_do_you_cope_when_literally_everyone_calls_you.json": "My parents called me ugly since I was 13. The only friends I had in middle\nschool would call me ugly too and mocked me for it. Even people I don't know irl\ngives me looks of disgust.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qo9pww/why_do_parents_put_so_much_pressure_on_their_kids.json": "(On mobile sorry for formatting)\n\nI just don’t understand why parents are so pushy about having grandkids. It’s\nnone of their business but they act like their kids owe them a grandchild. For\nme personally I don’t want to because I have two chronic illnesses that one or\nboth will be passed on and I…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qoc0wv/is_it_me_or_are_white_women_getting_more_curvy.json": "There's an elderly boss lady that comes occasionally at my job with glasses. She\nindeed DOES look like an evil corporate boss lady antagonist from some animated\nDisney film so if she look like it obv she got the dumpy. She wore those\ntriangle flare pants so I assume she's a freak on a leash. I feel…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qodtsp/do_women_not_like_to_initiate_sex.json": "I’m in my early 30’s and it seems like every partner I’ve had, whether it be a\nhookup, a fling, or longer term partners, it’s always my job to get the ball\nrolling. They’re always into it once we get going, but some push my way would be\nnice for a change",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qoe3qe/does_anybody_ever_get_anxiety_poos.json": "Like whenever you typically get a little anxious before something and need to\nuse the bathroom. And after using the bathroom to poo, your stomach feels way\nbetter and you feel way less anxious than before. Does anyone else get those?\n\nI get these before going to school sometimes and before I have to…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qom2au/is_it_weird_to_be_unattracted_to_porn_after.json": "Any time I see a naked girl, I think \"that's somebody's daughter.\" She was a\nbaby and someone had to care for her. I would hate to see my daughter being\ntaken advantage of or exploited for someone else's gain. I've seriously\ncondensed my interest for women to my wife (who I also started the…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qomusb/why_does_everything_have_to_get_turned_into_a.json": "I feel like in every conversation that could possibly have anything to do with\npeople of color, somebody always has to bring up “PoCs.”\n\nI feel like it further adds to any divide if we can’t refer to them as just\npeople. We always have to bring what race they are into the conversation. Never\njust…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qov3oi/why_are_farleft_ideologies_tolerated_on_reddit.json": "There exists subreddits like r/communism [/r/communism] etc but not like\nr/fascism [/r/fascism] or even similar.\n\nTens of millions have been killed by far-left and far-right governments, but\nonly openly supporting far-right ideologies is forbidden on Reddit.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qowkuq/are_bald_spots_ugly_in_women.json": "I have bald spots on the top middle of my head, and the left and right sides.\nThe top one is the most noticeable. I have a condition and I’m just worried\npeople are going to find me unattractive or ugly… so be honest, are they like a\nturn off? I’m thinking of buying a wig but I don’t know if that’ll…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qoxpqb/why_cant_i_talk_properly_without_sounding_like_a.json": "Is it a disability, or am I just too fucking smart that I can't keep up with my\nown brain because of how fast it works /s.\n\nBasically, I can't put together a sentence without sounding like a complete\ndumbass. It's like, I know what I want to say but I just can't really say it\nwithout fucking…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qp3v9p/why_do_parents_get_so_upset_over_dirty_rooms.json": "My parents don’t really mind that much, but I’ve seen my friends parents have\nfull on meltdowns over a dirty room. Some of my friends get grounded for a month\nat a time for not cleaning their room. Parents, is it a respect thing? Or a\ncontrol thing?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qpeahz/is_it_that_weird_that_my_brother_and_i_snuggle.json": "Basically the title. My brother (23m) and I (23f) are twins. We live together,\ntoo, so we spend a lot of time together (we both go to grad schools in the same\ncity).\n\nAnyway, sometimes we cuddle while hanging out, talking (like if one of us is sad\nabout something, etc.) or watching tv. It’s not a…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qpepiw/do_you_ever_get_incredibly_aware_that_youre.json": "Sometimes I’ll be sitting around eating, idk, a tuna sandwhich and then I’ll get\nall aware. It becomes hard to swallow after that. Am I alone in this? I’ve tried\nbeing vegetarian, it was hard and I only experience this rarely.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qpi7iy/how_can_the_sexuality_debate_even_exist.json": "I really don't understand it. I can't imagine a scenario where I'd be even\nmildly interested in someone else's sexuality (if I'm not trying to get with\nthem).\n\nHow anyone can have enough energy or time to not only think about, but dislike\nother people for their sexual preferences is beyond me.\n\nHow…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qplr4n/is_it_weird_i_love_the_sound_of_my_partners.json": "My partner was over at my house yesterday and we we cuddling while watching tv.\nAnd I was laying on their chest and I was able to hear their heartbeat from\nwhere I was and it really relaxed me. But is it weird I love this sound?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qpoo8h/is_it_normal_to_suck_a_girls_tits_during.json": "So I always thought that this was a perfectly normal thing for a guy to do. (Or\nwant to do)\n\nIt just always kind of.. made sense in my head? I always assumed that it was\npretty normal.\n\nThat is, until the last girlfriend I had said that she thought it was kind of\nweird that I always sucked on them,…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qpxwhg/why_is_human_life_so_valuable_when_every_other.json": "I understand that humans are the most aware and conscious animals… But still,\nWhy do we spend decades mourning over the loss of our mother or brother or\nfriend when we take away a mother’s child everyday to slaughter and EAT. Like\nimagine if a higher being was doing that to us as humans… Again I get…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qq1ybz/so_is_kyle_rittenhouse_going_to_walk_free.json": "I am not a US citizen and I do not know the specifics of the laws. I am honestly\njust really curious given the fact that this is a very well-known case and a lot\nof people talk about self-defense.\n\nAny insight would be appreciated.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qq4ag5/why_is_there_an_american_running_joke_in_tv_and.json": "I’ve heard it in so many TV shows, particularly sitcoms.\n\nIf the main character walks around naked and they excuse themselfs because\neuropeans walk around their house naked all the time.\n\nOr when a new character is introduced and he walks around nude he has to be\neuropean or the rest of the…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qq5hhj/video_of_kim_and_kylie_being_escorted_from_vip.json": "I was trying to show my husband the video of fans screaming for Kylie as the\nAstroworld horror unfolded and the VIP section was being emptied, and was\nconfused as to why I couldn’t find it or any of my comments in my history.\n\nThen I realized the entire r/FuckTravisScott [/r/FuckTravisScott] sub was…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qq7di0/people_who_max_out_credit_cards_whats_your_end.json": "Specifically talking about personal credit cards where the owner makes less than\n$60k/year but has tens of thousands of high-interest debt. I’ve known lots of\npeople in this range and I’ve always been too afraid to ask how they plan to pay\ndown all that debt?\n\nFor example, a colleague of mine makes…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qqa53r/why_is_there_so_much_pressure_to_have_a.json": "Early (M) 30s here, never dated and perpetually single by choice. As time goes\nby I noticed my family and friends are starting to get concerned that I am\nsingle. My family keeps asking when I will have a girlfriend. If they see a\nphoto of me with one of my woman friends the first thing they ask is…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qqatow/why_is_everyone_mad_about_the_rittenhouse_trial.json": "Why does everyone seem so mad that evidence is coming out that he was acting in\nself-defence? Isn’t the point of the justice system to get to the bottom of the\ntruth? Why is no one mad at the guy that instigated the attack on the kid?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qqf0i2/why_am_i_too_attracted_to_my_wife.json": "I know this sounds weird. But I have been with my wife for about 10 years, 8\nyears dating and almost 2 married. I have always found her beautiful and super\nhot, but lately these last few months I’m obsessing over her. I feel like she’s\nway too hot, I can’t stop staring at her when we’re in the same…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qqk8qu/im_34_but_still_feel_like_a_boy_when_are_you.json": "So many things in this life still perplex me, I'm still not on solid ground in\nmy life, requiring my parents to help me along with advice and even financial\nhelp.\n\nI'm supposed to be an \"adult\"! I'm supposed to be a grown up! But sometimes when\nI'm talking with my 10-year-old, I half think, \"Well,…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qqo7zq/why_is_it_controversial_to_state_im_only.json": "I had no idea this was controversial, I mention it to some people and now I'm\npretty sure everyone thinks I'm a misogynist.\n\nI myself am modest, no social media, don't take any pictures of myself and while\nI remain presentable and in shape I don't really care about my looks or try to\nput them on…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qqvwu5/what_is_the_polite_equivalence_to_sirmaam_when.json": "I am assuming a non-binary person would not like to be referred to as ma'am or\nsir, so what would be the NB equivalent to that?\n\nI could also be wrong in the sense that most NB people perhaps don't mind being\nreferred to as sir or ma'am?\n\nOr maybe there is no equivalent and just stick with generic?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qqvy23/is_there_a_way_to_humanely_euthanize_our_cat_at.json": "Our cat is old and her health has been degrading over the past month. We were\ngoing to take her to my father in laws for thanksgiving for her to live out the\nrest of her days before passing on but this morning she seems to be in a good\namount of pain and can barely walk. Over night she really seemed…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qqyw5a/would_you_guys_be_bothered_by_this_or_am_being.json": "Every morning my bf has to go downstairs and stay with his mom in her room for\nthree hours while she gets ready for work. If he doesn’t go down, she will come\nup bang on the door yelling and wake everyone up. I haven’t spent the morning\nwith him in idk how long. Even on our anniversary I thought at…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qr3cc4/how_do_people_work_for_a_living.json": "I just had my first job. It was very very challenging and it made me feel\ndepressed, especially working in an office with actually success-driven people\nwho enjoyed the grind… so I quit after a couple days. I didnt even last a week.\nIt sucks because I studied 6 years at a university for this and now…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qr50kn/has_anyone_noticed_that_newer_commercials_almost.json": "I'm not mad about it or anything, just an observation.\n\nEdit 2- This is specifically after the protests and riots from 2020\n\nEdit - I am American",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qrbani/why_dont_they_have_hot_guys_in_speedos_at_the_ufc.json": "Im very drunk and very serious.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qri8g2/guys_have_different_sized_penises_do_women_have.json": "This is such a fucked up thing to ask I know but the thought won't leave me\nalone\n\nLike imagine if we judged women the same way we do guys for how \"deep\" they were\ninside. Insanity.\n\nEdit: I thought so. Thanks guys! I wonder if I'm deeper or shallow...",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qrtvya/so_can_we_not_criticize_biden_at_all.json": "Biden today called Satchel Paige a \"great negro\" today and all I see are people\ndefending Biden. This was a terrible slip up and should be criticized as such.\nAnd no I did not make this post because I am a butthurt conservative. I am\nfar-left",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qs3e66/i_really_dont_like_being_around_people_and_in.json": "- Since I was very little, I didn't like meeting new people. Not even going to\ntheir houses.\n- In the church (religious family), I didn't stay with the other kids and\npreferred being with the adults.\n- At school, I spoke to a maximum of 4 people.\n- To this day I don't feel any interest in being with…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qs5xoj/why_do_people_think_sending_unsolicited_dick_pics.json": "That shit's ugly and nasty. I just wanted to make friends on a strangers website\nand they had to go and show their cock.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qs7htm/whats_so_bad_about_living_with_your_parents.json": "Whenever a person is asking for advice about changing their life, or how they\nfucked up. They start with saying they're still living with their parents.\nWhat's so bad about it? . A house is a home for a family. And families ought to\nstay together. Why is it considered a mark of failure? Or misery?…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qs83b3/in_psychiatry_why_arent_people_evaluated_for.json": "I have nothing against religion. But I do think there’s a flaw in the system\nwhen psychiatrists go insane if I tell them the government is watching me when\nthe next person believes in gods.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qsbepv/is_it_wrong_to_feel_uncomfortable_dating_a_23.json": "I met this girl while I was out at dinner. She was wearing a mask, but I thought\nshe had the sweetest eyes and personality, so I struck up a conversation. Next\nthing I know she's asking for my number and we set up a date a week or so later\nto go bowling with a bunch of my friends. The good thing was…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qshbyu/do_most_office_jobs_pay_people_to_do_nothing.json": "So I started my first office job a few months ago and I feel like I’m getting\npaid to do nothing. I just have to appear to be online to answer a few emails\nand slack messages per day. Of course sometimes I have more time consuming\nprojects but the majority of the time I only have like an hour of…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qswuvj/why_are_jobs_where_you_work_your_brain_paid_more.json": "I am not talking about exceptional examples like elite athletes, but more about\nthe average, common man. Is it simply because of the economic return on work\ndone, or something deeper about the social structure?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qt1n0m/is_it_just_me_or_is_it_getting_crazier_out_there.json": "Reference aside, it feels like social media is making us all more stupid and\nhostile each day.\n\nWhat do you think it will be like in 10 or 20 years?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qt22ih/what_is_critical_race_theory_and_why_is_everyone.json": "As someone from Europe, I have seen the topic of Critical Race theory come up\nonline a lot. Every time I try to get a real answer as to what it is, I get very\nconflicting stories? Can someone give an unbiased explanation of what it is, so\nI can understand what the topic is",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qthet1/how_widespread_is_it_that_a_woman_will_lose.json": "I feel like I hear about this a ton on r/askmen [/r/askmen], and I haven't\nreally heard many positive experiences with it. I feel like you'd have to be\nsuch a piece of trash human to that, though, so it's hard for me to believe that\nit's very common.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qtr1fd/are_the_women_in_female_dating_strategy_the.json": "When ever I look through this sub reddit it seems they have some really wild and\nunreasonable opinions and they all just agree with each other even if they are\nbashing men as a whole. Or maybe I'm just wrong and out of touch.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qtrz9a/where_do_you_draw_the_line_for_what_is_considered.json": "Siblings/parent+child seem almost unanimously taboo throughout history, and I've\nbeen under the impression that most modern societies also look down on cousins\nbeing in a relationship. Do you agree with that? Can you draw a hard line and\nsay \"a physical relationship with anyone on this side is wrong…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qtszgx/is_it_weird_that_i_m27_love_hugging_my_best.json": "We’ve known each other since 5, and we share all sorts of stuff together. We’re\nused to hugging upon greeting, and never felt weird about it. But most of our\nfriends think it’s weird.\n\nHow come it’s not weird when girls hug each other then?\n\nFYI: we’re both straight, and he recently got engaged too.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qtw64p/how_on_earth_do_you_ask_people_if_they_want_to.json": "Okay so I’m an 18 year old, bisexual student in the UK and wouldn’t mind having\na lil bit of casual sex now and then. Now the real question is, is there any way\nthat you can ask someone ‘hey do you want to have sex with me/fwb?’ and have it\nnot be awkward? I met a girl who I’ve gotten to know a bit…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qu94jh/do_you_get_dreams_about_being_back_in_high_school.json": "I’ve been out over a decade now and I graduated with honors on time and idk why\ni continue to have these reoccurring dreams, they’re the only ones of that\nnature to keep reoccurring…\n\nLike I mentioned I’ve never been in thag situation so it’s not a traumatic\nexperience that replays in my dreams,…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qucmkc/why_do_people_glorify_and_romanticize_mental.json": "it’s always eating disorders, BPD, depression, etc.\n\nit’s literally terrible and i don’t understand why people would want to live\nwith these illnesses.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qui3ux/am_i_going_to_piss_off_my_tattoo_artist.json": "Long story short I’m getting a full sleeve done. It’s a lot of work and I’m not\nnaive to that fact so I just want to clear that up first.\n\nOn 9/1 I had a consultation with an artist and during the consultation I was\ntold “I won’t be able to even start drawing this until next month” to which…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qui711/why_has_it_become_socially_acceptable_to_hate.json": "I’m not talking about deciding against having children of your own. I’m not even\ntalking about adults who don’t especially enjoy being around children. I’m\ntalking about the growing trend I’ve noticed of people who are downright mean\nto/about children and parents, especially in public. Do people not…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/quiz60/why_do_caucasians_have_a_large_array_of_hair.json": "Hope this isn’t racist to ask",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qujsvm/do_people_with_a_piss_fetish_prefer_dating_people.json": "People with diabetes often have sweet tasting piss, so would that be a factor\nsomeone with a piss fetish takes into consideration when picking a partner?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qul8nh/i_work_9_hours_every_day_and_come_home_i_then.json": "I spend every work day counting down the days till my next day off, is this what\ni will be doing until i retire? I just feel like i’m missing out on so much",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qux4ue/there_isnt_anything_scientifically_wrong_with_a.json": "Idk how society views it, but recently I brought home a black girl who I\ngenuinely care about. Heck, she’s the first girl I’ve ever thought of proposing\ntoo. My mother literally lost her mind. She went on a rant how the science is\nagainst it and how it’ll make our kids “umpure”. Keep in mind I am…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qux5dj/i_am_a_17_year_old_boy_and_i_feel_like_i_like.json": "i know this sounds kind of stupid, but i really love women. i love the art they\nmake, the books they write, the ideas they produce. i love the women i'm friends\nwith, the women that make the music and art and books that i like. i love the\nfemale characters in the books i read. this would be pretty…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/quxftt/can_conjoined_twins_use_eachother_to_breathe.json": "If there is a pair of conjoined twins and they have the same set of lungs can\none be underwater while the other keeps their head above and still be able to\nbreathe as long as they want? Kinda like like an extended snorkel",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qv5tlb/are_most_people_also_terrified_of_how_common.json": "I'm from the UK. For the last year and a half or so every single news outlet on\nYouTube uploading videos regarding Covid-19 is spammed with dislikes from\nantivaxxers. Almost every single comment on these videos is heavily antivax and\npeople talk as if taking the vaccine is dangerous. I actually…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qvef97/how_do_roberts_decide_if_they_are_rob_or_bob.json": "I guess that same for Richards being Rick/Dick or Williams being Will/Bill",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qvg1aq/do_pornstars_in_bdsm_videos_have_the_ability_to.json": "I'm very vanilla in my sex life and in the porn that I view, and while I do have\nkinks, they often involve crossdressing, post orgasm/orgasm denial, etc\nsometimes I like to look for new stuff, and I see these videos of women being\ntied u, spanked, electrocuted, whipped or having their clit tortured…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qvgykk/people_who_left_jobs_this_past_year_as_part_of.json": "Like, I keep hearing that people left their jobs and are no longer working. How\nare you paying bills? Are you on unemployment benefits? Participating in the gig\neconomy (Uber, rover, door dash, etc.)? Like, I don’t like working but I need to\nkeep my job or I will literally go hungry. I don’t mean to…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qvno5z/is_there_such_thing_as_paying_someone_to_cuddle.json": "I was just wondering if there is such thing as a person you can pay to have\nphysical intimacy with you and talk that would involve getting close to each\nother (like sitting on lap , hugging or touching of only certain body parts) but\nhave no sex or any intercourse of any kind.\n\nWould this be…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qvx3ak/do_any_cultures_have_prank_foods_to_mess_with.json": "Forgive me if this is insensitive, I don't have much exposure to cultures\noutside my own.\n\nI've been reading about different foods around the world and some of them sound\nso orally chaotic that I think to myself \"there's no way that's a regular thing,\nthey make that to fuck with tourists\".\n\nSome…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qvyeue/is_it_weird_to_identify_myself_more_with_my_hobby.json": "So a bit about me, I am the sole breadwinner in the family. I'm in the military\nwith a moderately high enlisted rank and I make around $65K/year plus benefits.\nPeople in my family talk about how it's so amazing that I serve and that being\nin the military is \"a calling,\" and people I work with often…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qw015i/how_come_company_diversity_targets_are_not_racist.json": "The question is coming from a good place. I’m trying to understand.\n\nSometimes a company says they target to increase diversity in leadership or\nemployees. Some also give metrics e.g. our African American presence grew by x\n%.\n\nHow do they do this without being racist? Don’t they have to choose that…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qw0eol/straight_people_if_your_friend_ask_you_to_hug_and.json": "Not with sexual intentions but just because you guys have a good intimacy and\nconnection.\n\nWould you do that?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qw0fi3/what_is_it_when_you_feel_uncomfortable_around_the.json": "I've had this on my chest for a while now and I feel I should get this out. I\nfully support and do not discriminate lgbtq members. However, I sometimes feel\nuncomfortable or weird when the topic comes up. If I see a gay character,\nsometimes I feel a bit uncomfortable. I want to fix it and I want to…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qw1av0/why_are_so_many_threads_here_versions_of_why_cant.json": "If you're wanting so badly to use language that you know is offensive to some\npeople or groups and/or has a history rooted in discrimination and bigotry, then\njust maybe you really are those things.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qw1spy/where_do_mens_penises_go_when_they_poop.json": "I am just a curious soul. So help this curious soul please...\n\nEdit: What I mean by this question is... Does it hang on the toilet seat or\nunder the toilet seat... I do know basic anatomy...\n\nEdit (2): Spelling",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qw4y31/what_are_flirty_signs_that_guys_miss_when_a_woman.json": "So I hear quite a bit that guys are clueless when it comes to picking up signs\nthat a woman is interested in him. So it has me wondering if any women here care\nin letting a guy in on secrets flirty signs that guys usually miss when a woman\nis flirting with him?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qwk2u2/is_it_worth_it_to_lose_your_virginity_with_the.json": "Read everything before replying.\n\n22M virgin here. I get enough looks and Tinder matches to know I'm somewhat\nattractive. I had originally planned to do it with someone I was in a\nrelationship, but I seem to struggle more in that regard. It's not so much the\nsex itself. I just wanna know what it's…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qwrd3z/ladies_when_youre_wearing_something_revealing_and.json": "The obvious is not to stare of course. Sometimes I see women wear something\nwhere a lot of boob is showing, it could be when out clubbing or a special\nevent. My guess is they probably want to look hot or appealing or whatever the\nreason.\n\nMy eyes are going to meet them at some point. I don't think…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qws08l/why_do_people_get_offended_at_the_statistic.json": "I saw an ask reddit thread asking what’s a shocking statistic and this one kept\ngetting removed. Id say it’s pretty shocking because it even though it’s 12% of\nthe population it probably is more like 6% since men commit most violent crimes.\nThat’s literally what the thread asked for: crazy…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qxeets/why_do_teachers_only_do_something_when_the_kid.json": "I have alwaus thought it was some sort of joke, but it seems to happen\neverywhere around the world.\n\nIt makes 0 sense to me that they would not care enough to stop bullying, but\nenough to stop the kid fighting back",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qxh4yv/is_buying_a_nintendo_switch_being_a_22_year_old.json": "I was talking to my mom and mentioned that I might get myself a Nintendo switch\nfor Christmas as I've been enjoying playing borderlands on PC a lot and I really\nreally want to play animal crossing (I've played it on other people's consoles\nand I love it). Also the second part of my favorite game is…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qxit3l/do_all_guys_measure_their_penises.json": "Okay maybe this is just a Reddit thing I'm not sure. It seems all the guys know\nexactly how long their penis is, like they'll say 6.7 inches or 7.5 inches (btw\nI don't even ask). Then you have the question of \"how long was the longest penis\ninside you?\". I'm like I don't know, I can guesstimate but…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qxo5r7/do_men_really_like_boobs_i_mean_not_just_looking.json": "And by minutes I mean for 10-15 minutes or more?\n\nI'm really sensitive on my boobs, sucking on them is more pleasurable for me\nthan the actual sex, so my boyfriend sucks on them sometimes for half an hour,\nand he says he likes it, but sometimes I feel guilty that maybe he is doing it\nto satisfy me…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qxsibu/is_it_weird_that_i_as_a_teenager_still_play_with.json": "[16F] My birthday is coming up and I am asking for some toys, and I actively\nplay with toys. I love toys, they're so fun to play with. Is that weird?? Am I\nchildish?? Am I a geek??",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qxw3za/is_29_too_old_to_go_back_to_college.json": "I tried community college straight out of high school and pretty much failed\nalmost all of my classes. Nothing ever interested me either. I was working as a\nserver/bartender and my high school sweetheart had just broken up with me. My\nmind was not focused on school. I decided not to go back after 2…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qy6o24/how_do_you_deal_with_friends_that_cancel_plans.json": "This isn't everyone I know. I have friends that stick to plans. If they have to\ncancel they will give a reason and then come up with a plan to meet up another\ntime instead.\n\nHowever, I also have these other friends. They either cancel plans last minute\n(1h before meeting up) or they message back the…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qyabe7/why_do_people_hate_so_much_on_jordan_peterson.json": "Watched some of his interviews and he seems to be pretty smart .",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qychcz/is_it_a_typical_experience_to_have_little_to_no.json": "Not too concerned with karma, but more so interesting discussion. However, I\nhave neither. Even my last post was dismissed and locked after 3 minutes. What's\nthe key to finding intellectual stimulation on Reddit?\n\nContrary to the tone of this post, I am fairly outgoing and engage with people\nvery…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qyijo1/does_whitening_toothpaste_actually_do_anything.json": "They often proclaim giving you noticeable whiter teeths in just 10 days. Are\nthere any actual truth behind that statement, because I've been using the same\ntoothpaste claming that for 5 years and I see no difference.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qyjee6/how_should_a_parent_monitor_a_childs_phone.json": "When ever I hear stories of a child having/doing something bad on their phone\n(Example: talking to someone much older than them, buying contraband etc.)\npeople usually blame the parents. They say that the parent should have been\nmonitoring the child's phone and checking to make sure they weren't…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qyltk6/is_this_embarrassing_to_buy_as_an_adult.json": "Is it embarrassing to have plushies as an adult? Be honest.\n\nI want to buy merchandise of a videogame and one of the merch I want is a\nplushie. Would it be embarrassing for a fully grown adult to have it? Would you\njudge someone in their 30s for still having plushies?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qymdki/why_is_it_not_okay_to_be_afraid_of_black_people.json": "No I’m not using this as an excuse to start hating on black people due to the\ncrime statistics fact. But I’m just wondering why one is considered racist, but\nthe other isn’t considered sexist.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qynf7v/at_which_point_are_adults_with_a_big.json": "I’m 24, but I’m a hell of a lot more mature than when I was 18.\n\nFor this reason, I don’t think I could ever date an 18-year old, cause they are\nstill a kid in my eyes.\n\nBut what about a 75 year old and a 25 year old?\n\nOr 80 and 30?\n\nAt which point does it no longer seem like some sort of…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qyq08g/my_girlfriend_is_insistent_on_getting_a_job_at_a.json": "My girlfriend and I (both 20 years old) have been dating for about 6 months now,\nand I thought it was going really well. We have our differences but we both love\neach other a lot and want to get a place together, mostly to get away from our\nfamilies for personal reasons. We don't have jobs that…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qytr7p/how_many_men_would_remain_in_love_if_sex_was_off.json": "Genuine question since I am feeling quite shocked witnessing two women being\nleft by their partners as they were rendered disabled and couldn’t have sex\nanymore. This seems to be an extremely common pattern where men walk out more\noften or cheat if there is temporary sexlessness is involved . I…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qytura/if_most_people_are_against_animal_crueltyabuse.json": "So I’m not vegan, but have been thinking more about the topic lately, this is\nkind of a last ditch effort to be persuaded away from giving up meat.\n\nPeople avoid this topic so much that I even know this question won’t get much\nresponse, why is that?\n\nIt’s widely accepted at this point that we don’t…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qyugcr/is_it_bad_that_id_rather_die_than_join_the.json": "I don't believe in supporting warfare in the slightest. Killing people to defend\nfictional borders just isn't my thing, and I have literally zero things within\nthose borders I want to defend, or any good memories to make me want to defend\nthose fictional borders.\n\nIf I'd get drafted, I'd run away…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qyvdqf/would_you_get_an_abortion_if_you_knew_your_child.json": "Let's say for the sake of the question: The depression is treatment-resistant\nand chronic They are capable of brief moments of joy, but it is very fleeting\nThere is nothing else particularly wrong with them The depression is\nmoderate-to-severe for the majority of their life They will never achieve…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qyyq82/how_in_the_world_do_i_shave_my_ass.json": "As a 17 Male, how the hell do I shave it? Do I use scissors? Or an electric\nrazor? For my pubic hair I usually use scissors to clip the big parts of the\nbush, then use the razor for the last bits.\n\nBut for ass hair it's different, it's very uneven surface, so using an electric\nrazor there I would…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qz572x/whats_up_with_societys_obsession_on_waking_up_so.json": "I understand it’s efficient since the economy runs from morning to early\nevening, but seeing the same post about waking up at “5 AM to work out, then hit\nthe shower, then work” is starting to sound like a copy pasta. With that in\nmind, do morning people see night owls as inefficient or lazy?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qzeayc/is_it_weird_to_go_to_a_houseapartment_where_you.json": "Even if it's just for 5 minutes. In and out. I've always thought about doing\nthis in my childhood home, and my first apartment. Just a quick in/out. I always\nthought if somebody knocked on my door I'd totally let them have their nostalgic\nmoment.\n\nIs this too weird or is this a thing that sometimes…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qzg13c/whats_the_feeling_called_when_you_just_want.json": "Like a coma sounds like a great idea right now because maybe then I'll get a\nchance to fully recover. Sleep isn't enough. Weekends doing nothing aren't\nenough. You're never fully ready to go back to work on Monday but you have no\nchoice. You just want everything to stop so you can finally relax.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qzh36n/how_do_i_tell_my_girlfriend_that_her_farts_are.json": "my girlfriend's farts smell so bad and so rotten that it is literally turning me\noff sexually. is this normal? she can literally clear out an entire stadium with\nher farts. they absolutely smell so bad!",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qzk27j/would_you_date_a_22_year_old_who_has_never_been.json": "I'm 17 years old and as of now, I have never been in a relationship. I'm joining\nthe Air Force after high school which is going to make dating for me nearly\nimpossible as I'm not interested in dating someone long term. I plan on doing\nonly one enlistment in the Air Force before separating to go to…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qzoti8/son_sleeps_with_his_hoodies_should_i_get_him.json": "He’s 15, when I go into his room in the morning he has a different hoodie next\nto him in bed every time.\n\nI’m assuming he’s using them as a comfort thing to hold or something. Should I\nget him a proper blanket for that, or do you think that’ll just embarrass him?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qzrqyd/im_22_and_have_always_been_fat_my_entire_life.json": "And how do I go about doing it?\n\nUpdate: It’s 2:35am where I am in the world right now but getting everyone’s\nreplies really warms my heart and pushes me to do something about it tomorrow. I\nPROMISE ILL UPDATE YOU GUYS ALL!!! Whether it be tomorrow or next week or when\nI’m finally at a normal weight…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qzs299/why_isnt_the_waukesha_christmas_parade_attack.json": "At least 40 people are injured and 5 are dead. I’ve been watching cable news\nfairly consistently since the incident and it barely gets a passing mention. For\nsomething of this magnitude, it is getting such a disproportionately low amount\nof media attention. This has been mentioned in the comment…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qzsvhh/eating_ass_yay_or_nay.json": "\"For the ladies / would you let a guy eat your booty? If you already did ....\nThoughts?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qzvuf5/why_are_the_tuskegee_experiments_generations_ago.json": "Obviously I'm pro vax but this discrepancy in the depictions and reasonings\nbetween groups I've found kinda problematic",
  "data/reddit-ask/r/TooAfraidToAsk/comments/qzwr2e/why_havent_i_heard_of_anyone_vandalizing_the.json": "This isn't a call to arms or whatever. It's more of a curiosity than anything.\nBut I get the feeling I'm going to end up in a government list if I ask...\n\nAnyway, with all the massive protests that have happened the last few years here\nin the US, all the rioting and vandalism (justified or not), I'm…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/r01wo4/is_it_possible_for_someone_to_be_actually_dumb.json": "i think im pretty dumb. like air head blonde type dumb . im very slow and i hate\nto admit that. i been called dumb by my parents and an ex boyfriend and i\nsee/saw them all the time so they know me well. i never got good grades and i\ncould never focus. i got a low iq score too. simple shit i cannot…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/r06dad/why_is_committing_suicide_viewed_as_a_cowardly_act.json": "No one knows what happens after death and it's a terrifying void to even\nimagine, you gotta be brave af to take that leap into the truly unknown.\n\nYet living to an old age with people who probably despise you is considered some\nsort of major feat of courage?...I honestly don't get it.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/r0obrk/if_elon_musk_or_jeff_bezos_donates_1_days_worth.json": "Without a doubt, one of the most valuable resources on the internet and yet the\nworld's richest put their cash into things like SpaceX etc. As an investment\ninto the future of the site and all the knowledge it holds, why have they not\ntaken on that responsibility?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/r0p54y/if_you_censored_a_female_nipple_with_a_male.json": "Or what if girls walked around with male nipple pasties/bikini tops in public?\nIs that okay?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/r0szix/how_bad_is_it_to_be_23_and_never_kissed.json": "23F. I was always sheltered. Homeschooled. Small town. Overprotective parents. I\nalso have OCD and a fear of germs among other things. I used to model so I know\nit’s not my looks, when I go on dating sites I never have trouble finding a\nmatch. Being in such a small town though it’s hard to click…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/r15gwe/why_isnt_the_waukesha_tragedy_receiving_more.json": "There have been multiple sources linking the suspect to anti-white social media\naccounts. He killed eight people and injured over fifty more, old people and\nchildren. Why is the media nowhere on this? If the races were reversed, a white\nman with a questionable social media history killing black…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/r17dhk/do_guys_actually_tease_each_other_for.json": "I feel like it’s a common media trope where guy friends make fun of/shame their\nguy friends when they prioritize their girlfriend in any way (such as leaving a\nhangout cause they scheduled a date or buying them flowers or saying “I love\nyou” when other people are around) and it seems like some guys…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/r17wu5/do_you_experience_nightmares_wake_up_go_back_to.json": "I have had this happen multiple times, seems to be when I'm stressed out or\nsleeping very late. I don't care about a single nightmare, but it starts to get\nto you when you keep having it and you're anxious about even closing your eyes\nagain. And I don't even feel fear during the later nightmares,…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/r18rso/how_can_i_stay_awake_for_more_than_36_hours.json": "What can I take or do to stay awake for around 36 hours straight?\n\nI badly need some money to pay for medical bills and found some jobs that I can\ndo back to back, like day shift and night shift for a few days at a time. Any\ntips on how to make it work? I don't have family to run to anymore as they…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/r1q5qi/what_is_a_nice_way_to_ask_someone_to_be_quiet.json": "I get overstimulated with noise when I’m stressed, and when I’m around people\nmaking small noises, it gets worse. I always feel mean and unkind when I ask\nthem to stop. How can I do this nicely?\n\nExample; overstimulated from a day at work and carpooling with my husband. He\nstarts singing because he…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/r1s9qx/anyone_get_butterflies_over_literally_any.json": "Sometimes I’ll be sitting in lecture and me and a random girls shoulders will\njust kinda rest up on each other. She’s not moving away and just kind of keeping\nher shoulder planted on mine, and I’m like thinking to myself “should I move my\nshoulder?” But then I’m like nah I’m way too fucking touch…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/r1vm3e/whats_the_right_way_to_tell_your_friends_im.json": "I don't want to talk to people but I feel incredibly guilty not doing so",
  "data/reddit-ask/r/TooAfraidToAsk/comments/r1yqha/why_is_there_body_positivity_for_fat_women_and.json": "It's especially confusing to me since fat people can lose weight, whereas height\nis an immutable characteristic.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/r2hgrg/i_had_unprotected_sex_with_a_girl_who_cant.json": "For reference, I saw on the Planned Parenthood website that due to the brand of\npill she's taking, she should be fine if she just takes the rest of her pills on\nschedule afterwards.\n\nWe're nervous though and would appreciate some feedback. Particularly from\nuterus-owners lol.\n\nEDIT: I forgot to…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/r2nw3u/do_women_really_care_about_you_height.json": "I've met a girl who I liked a lot, and we dated, and the date was really\nawesome. She apologized for being taller than me (as she was wearing boots which\nmade her even taller), to which I replied that I didn't really cared. As I don't\ncare dating women taller than me. Does she cares about how tall…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/r2oqic/does_a_womans_asshole_feel_different_than_a_mans.json": "I apologize.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/r2pyp5/have_we_gone_too_far_with_body_positivity.json": "Please hear me out. I just feel that in recent times there has been an unhealthy\nglorification of obesity. To love your body is one thing but to legitimise it to\nthe point that you don't try to get fit is a whole different hypocritical space\nbrands/people/influencers are owning. Everyone's favourite…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/r2vau4/why_is_the_female_rap_music_championed_as.json": "There has always been a huge problem of misogyny, which mainly stems from the\nview that women are nothing more than objects of sexual desire. In such a\nscenario, the lyrics and music videos of many female rappers, even if done with\nthe purpose of reclaiming their sexuality, seem to embrace this…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/r324jc/you_cant_make_gay_people_straight_and_you_cant.json": "I am in no way condoning pedophilia. This just seems to be a logical conclusion.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/r32eby/why_are_we_ok_with_euthanasia_when_it_comes_to.json": "As the title says. I was reading in r/askvets [/r/askvets] about someone who has\na very old cat that has a clearly very poor quality of life, and they were\nasking if it's ok to talk to the vet about putting the pet down. This got me\nthinking, why don't we extend the same courtesy to people? Why is…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/r33eso/do_you_think_america_would_be_further_along_with.json": "I’m trying to be objective but I do feel like his rhetoric and stance on mask\nmandates and the vaccine led to a lot of the anti-vax movement. Or were\nAmericans going to feel that way regardless?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/r34d04/as_an_adult_is_there_any_way_to_ask_a_fellow.json": "Throwaway account cause I don't want anyone I know to see this lol",
  "data/reddit-ask/r/TooAfraidToAsk/comments/r34n0n/is_the_suicide_prevention_line_actual_helpful.json": "Please answer quick I really need to talk to someone because it feels like\neverything crashing down around me and no one wants be around me\n\nPlease help",
  "data/reddit-ask/r/TooAfraidToAsk/comments/r37mky/do_you_ever_feel_tortured_by_small_social_missteps.json": "Probably once or twice a month I’ll feel like I said something awkward or not\nfunny or dumb in a social situation, and then replay it a ton in my head the\nnext day. I really beat myself up about these things, even though I know the\nother people are never thinking much about it or even remembering…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/r3a8sl/is_it_weird_to_masturbate_when_your_dog_is_around.json": "My dog pretty much follows me everywhere whether I’m taking a\nshower/piss/sleep/work/exercise/chill etc - she likes to observe me and how I\nsound like. So sometimes when i masturbate the moment i wake up/about to go to\nsleep she’s there lol",
  "data/reddit-ask/r/TooAfraidToAsk/comments/r3bxm3/no_suicidal_stuff_or_anything_but_do_any_of_you.json": "I’ve been feeling this mild feeling of dread for a while now, just wonder of\nanyone else does.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/r3ds74/is_it_true_that_most_birds_are_government_drones.json": "Just curious…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/r3fp3g/from_a_purely_results_standpoint_wouldnt_forcing.json": "Ignoring the obvious nuance of this issue, the 'muh freedoms' talking points,\nconspiracy theories, and slippery slope arguments.\n\nIf we forced everyone to vaccinate, couldn't we just end this in the next 3\nmonths? Couldn't it have ended a long time ago? It doesn't seem that\ncomplicated.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/r3ghjv/how_to_handle_my_husband.json": "My husband has an anger problem. I absolutely adore him but the only emotion he\nknows when something bothers him is anger and it’s crushing to me. He would\nnever lay a hand on me although sometimes I think that might be nicer than the\nthings he says to me. And, he’s incredibly stubborn so his…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/r3q02m/can_girls_go_sterile_from_masturbating.json": "Sooo.. I'm a male in a conservative Islamic country with no sex ed and only a\nlittle education on reproduction organs in biology, so sorry if it's a\nr/menwritingwomen [/r/menwritingwomen] moment.\n\nI remember learning that a Woman is born with all her eggs and cannot produce\nmore afterwards..\n\nI bet…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/r3rhwg/are_black_people_more_inclined_to_be_racist.json": "Let me start with this is a question of curiosity and I want a civil discussion.\nFrom my experience as an Asian in NYC, I have only ever experienced racism from\nblack people. My family and friends have also had this experience. Now this may\nbe anecdotal, but I wanted to know why I've never had this…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/r3ruay/why_do_poor_people_living_paycheck_to_paycheck.json": "It almost feels like people are all worried that someone else might have it,\nwhat they perceive as, slightly 'better' or worse off than them.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/r3rvyx/why_dont_people_in_movies_know_how_to_take_pills.json": "They always try swallowing pills without water and they wince about it. Oh, and\nthe method is ridiculous! They put the pills in the palm of their hand and shove\ntheir whole hands on their face rather than use their fingertips. Have actors or\ndirectors never seen someone take pills? (I realize how…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/r43d3j/why_is_it_a_problem_in_america_that_you_have_to.json": "I was just listening to a podcast from like a year ago, and someone mentioned\nGeorgia wanting to pass a law that would make it mandatory for people to show\ntheir ID when voting, and everyone was appalled.\n\nI know the voting process is kinda stupid over there and you have to register\nfor some reason…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/r44858/what_is_the_pro_argument_for_wearing_shoes_inside.json": "As someone that doesn't wear shoes inside im just curious what is the pro\nargument for not taking off my shoes when I enter the house.\n\nEdit: if your argument is that taking the shoes off and putting them back on is\nannoying/feels like a chore, please provide an explanation for how a 25…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/r44erx/was_i_raped_my_post_has_been_removed_multiple.json": "I think my post got removed.. I'm trying to repost again.\n\nHi. I've posted this on another subreddit somewhere. But I've been told by a few\ncommenters that i was raped. I just want to ask here, hoping that the answer is\nno\n\nThis is a little explicit, but bear with me.\n\nSo i met person X via a dating…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/r4g5hq/why_do_adults_act_condescending_to_kids_and_still.json": "THIS. I've never in my life understood why adults act condescending towards\nchildren and don't see how that is simply not the way to go about things. I\nmean, don't they remember what's like being a child? I witness this far too many\ntimes, like how older relatives talk to younger relatives (and I'm…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/r4kasd/men_is_it_a_dealbreaker_if_she_doesnt_give.json": "I’ve been in a few relationships and hookups in my time, and I’ve always HATED\ngiving blowjobs. I have a terrible gag reflex, I throw up after like an inch or\ntwo. I would always try with past partners because they seemed to be into it but\nit always really turned me off bc I had to try so hard not…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/r4kwre/im_going_into_a_hospital_to_get_help_with_my.json": "I know this isn't the place to post this and I know it will get deleted. I just\nreally want to know. I've been struggling too much recently and I need help, I'm\nembarrassed of going there and telling them what is wrong with me but is the\nonly option I have left. I have insurance, I just want to know…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/r4ptaj/is_what_this_girl_does_creepy.json": "OP here, extra info\n\nTheres this girl and shes a junior in college (16) and im a freshman in college\n(18) and shes liked me for a long time. And shes super obsessive over everything\nand controlling even though we aren't dating. I talked to her about her actions\nand I told her they were creepy which…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/r502tj/how_do_i_get_my_friends_to_stop_talking_about.json": "Hi all, I am wondering how I get my girlfriends (we are all the same race) to\nstop talking about race when we are out. It’s either self-degrading or racist,\nsometime productive. But when I’m out I don’t want to bask in self-pity or\npolitical talk. When things get quiet, it goes back to race. When…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/r5094p/is_it_weird_for_me_25_f_put_down_a_towel_before.json": "Just…the above question. I get really wet during sex and I also have a really\nnice bedspread so I don’t want to have to wash it every time I have sex. Last\nnight I ran and grabbed a towel and put it down before I started having sex with\nsomeone. I’m wondering in hindsight if this was weird since it…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/r58rcr/do_you_guys_spot_asshole_hair_during_doggystyle.json": "I wanted to know if men can notice the asshole hair while doggy style? This\nquestion been haunting me since I started having sex. It is actually why i\ncannot properly arche my back for doggy 😂. Thank you!",
  "data/reddit-ask/r/TooAfraidToAsk/comments/r5jlgn/is_there_a_sub_for_people_who_are_just_kinda.json": "Not a sub geared towards depression or suicide per se (though I guess it could\nfeature), but for people who are tired of the state of the world, capitalism,\nthe thought of doing a 9-5 for the next 20 years, etc and would just rather not\nbe here.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/r5kjf5/roommate_jerks_off_and_i_can_hear_it_how_do_i.json": "I live in a college dorm, and I share a dorm with two other dudes. one of them\njerks off pretty often and the problem is that I can hear him from my desk and\nhe doesn’t know. I don’t care that he does it (I mean how else are dudes\nsupposed to destress lmao) but I don’t think it would be…",
  "data/reddit-ask/r/TrueAskReddit/comments/qkx03j/is_the_potential_of_streaming_services_completely.json": "I'm an older guy who remembers the early internet. I remember Kazaa and\nLimewire, and getting to download video content and watch it all in one go. I\nremember downloading the entire series of Most Extreme Elimination challenge and\nthings like that and binging before it was a term, already in the…",
  "data/reddit-ask/r/TrueAskReddit/comments/qmb66a/how_to_get_a_job_as_a_convicted_felon.json": "Im 21 about to be 22 and during the first wave of covid i was self employed\nworking detailing but winter is here and i need to find a job since i live in\nTN. I was convicted for possession of psilocybin and cause i had a scale got\naccused of trying to sell, i went with my public defend plea and well…",
  "data/reddit-ask/r/TrueAskReddit/comments/qnusgv/am_i_a_coward_for_not_speaking_up.json": "I was on a train home tonight and a man started yelling and making these three\ngirls very uncomfortable. He was talking about “impregnating and shooting white\ngirls,” so it was a tense situation. I was worried that saying anything would\nresult in violence, but I was keeping a close eye on things in…",
  "data/reddit-ask/r/TrueAskReddit/comments/qqmr8z/why_do_people_give_so_much_value_to_those_who.json": "I’m guilty of this. I’m working to be grateful and appreciate those closer to me\ninstead of focusing my thoughts on somebody’s else life and endeavors. Well, I\nfeel like A LOT of people spend far too much time focusing on other people lives\nand adoring people in extreme ways who do not know about…",
  "data/reddit-ask/r/TrueAskReddit/comments/qyntlu/did_parents_send_their_children_to_orphanages.json": "This is probably a weird question, but both of my grandfathers, with all of\ntheir brothers, were sent to an orphanage around 6-8 years old while the girls\nstayed. They were allowed to return to their houses when they were old enough to\nwork, both of them ended up abusive and emotionally unstable.…",
  "data/reddit-ask/r/TrueAskReddit/comments/qzp23a/if_the_us_were_to_collapse_what_effect_would_it.json": "By collapse I mean if the US were to collapse either through civil war or maybe\nsomething like a Yellow Stone eruption that would permanently collapse the\ncountry both politically and economically.\n\nI'm thinking that first of all it would cause the worst power vacuum ever\nrecorded in history. How…",
  "data/reddit-ask/r/askphilosophy/comments/qjpxuz/what_is_the_best_argument_for_gods_existence.json": "Thanks",
  "data/reddit-ask/r/askphilosophy/comments/ql5xky/what_are_some_philosophers_that_you_can_approach.json": "Was learning about Kant and kept getting frustrated, so i tried to use\nsupplementary material; but reading on, they say that to understand Kant, you\nhave to understand Leibniz, Locke, and Hume. Reading on some more, to understand\nthem you have to understand Bacon, Descartes, or Spinoza. And to…",
  "data/reddit-ask/r/askphilosophy/comments/qluh5h/the_hardest_logic_puzzle_ever_something_about_it.json": "https://xkcd.com/blue_eyes.html\n\nWas able to solve this last night, for those who haven't solved it and want to,\nI'm going to spoil the heck out of the solution.\n\nMy solution can be proved via induction as follows:\n\n(Base case) suppose there was one blue-eyed person and any amount of brown…",
  "data/reddit-ask/r/askphilosophy/comments/qpandc/when_i_read_plato_am_i_reading_platos_ideas_or.json": "I recently started reading Plato's dialogues. I'm still in highschool and it's\none of the first philosophical text I've read, the ones I've gone through are\nEuthyphro and the Apology, and I'm currently reading Crito.\n\nI'm wondering wether I should see Socrates as a fictional character that…",
  "data/reddit-ask/r/askphilosophy/comments/qq7nso/can_we_treat_identity_in_the_late_stage.json": "It seems that the identities a person acquires in life share the same mechanisms\nof market commodities, and that commodities and brands are becoming part of our\nidentity. Can we treat identity in the late stage capitalism, as a commodity by\nitself?",
  "data/reddit-ask/r/askphilosophy/comments/qqsioe/can_someone_explain_why_most_philosophers_believe.json": "This is in regards to the philpapers survey saying that the majority of\nphilosophers believe in free will.\n\nOff Merriam-Webster:\n\nfree will\n\n1: voluntary choice or decisionI do this of my own free will\n\n2: freedom of humans to make choices that are not determined by prior causes or\nby divine…",
  "data/reddit-ask/r/askphilosophy/comments/qwqf5d/are_there_any_philosophers_who_morally.json": "If so, what would their arguments be? Full disclosure I do eat meat, but I dont\nhunt or kill. So I guess I would be a beneficiary but not a participant of a\nsystem of hunting and killing.\n\nIve read arguments on this sub from a vegetarian/vegan perspective, and came\naway with the belief that my…",
  "data/reddit-ask/r/askphilosophy/comments/qxcdjc/arewere_there_any_antireason_and_antilogic.json": "Today, if someone claims people shouldn't think for themselves nor trust logic\nnor reason, we immediately get shocked and start getting suspicious of the\nperson who said it. (The only modern example I'm aware of are some Jehovah's\nWitnesses)\n\nHistorically (and especially outside of the West) were…",
  "data/reddit-ask/r/askphilosophy/comments/r079pi/how_much_of_philosophy_is_incompatible_with.json": "I’ll try to make that clearer. I was educated in the history of philosophy,\nbroadly speaking classical Western—Plato, Aristotle, Descartes, Kant, Hume,\nSearle, Rawls, Nagel, Russell, Nozick, Parfit, with some detours into Hegel,\nHeidegger, Derrida, etc.\n\nWe never studied Marx, however, and my…",
  "data/reddit-ask/r/askphilosophy/comments/r2uz7p/what_is_the_best_way_to_convince_someone_that.json": "I've always thought philosophy was so important; identifying bad arguments,\nknowing how to spot fallacies, the importance of choosing the right word, and\ncritical thinking in general.\n\nHowever, all my life people I've met have scoffed at philosophy. They\nimmediately think of all the classic…",
  "data/reddit-ask/r/askphilosophy/comments/r45lrd/if_you_were_temporarily_given_the_power_to_end.json": "On one hand, the responsibility seems like too heavy a burden. If you did press\nthe button so to speak, you would be responsible for ending the lives of\ntrillions of beings on Earth and possibly many more elsewhere. But if you do not\npress it, doesn't that also mean that you are responsible for any…",
  "data/reddit-ask/r/askscience/comments/qkbpm1/how_was_the_first_virus_found.json": "What methods were used to distinguish viruses from other pathogens so that we\nknew it was something different than all the known stuff?",
  "data/reddit-ask/r/askscience/comments/qkdhcy/askscience_ama_series_were_experts_here_to.json": "Let's talk about sex(ually transmitted infections [STIs])! We'll be here today\nat 2 PM ET for a discussion, organized by the American Society for Microbiology\n(ASM), about the present and future of STIs.\n\nSTIs are an enormous health issue. According to the World Health…",
  "data/reddit-ask/r/askscience/comments/qksvad/in_dim_light_why_do_unlit_objects_appear_to_lag.json": "This is something I originally noticed while playing my gameboy late at night.\nThere was just enough light to see the gameboy itself, which had a small 'on'\nindicator light. I noticed that moving the gameboy would make the light appear\nto dash ahead, with the rest of the gameboy appearing to lag…",
  "data/reddit-ask/r/askscience/comments/ql1bna/will_the_melting_polar_ice_caps_actually_bring_on.json": "So I’ve been reading a book called “A short history of nearly everything” by\nBill Bryson. (Very good by the way). It brought up some topics that got me\nthinking.\n\nAs the ice caps melt, huge quantities of fresh water are dumped into the oceans,\nwhich I imagine over time would decrease the salinity of…",
  "data/reddit-ask/r/askscience/comments/qlv3fj/ask_anything_wednesday_economics_political.json": "Welcome to our weekly feature, Ask Anything Wednesday - this week we are\nfocusing on Economics, Political Science, Linguistics, Anthropology\n\nDo you have a question within these topics you weren't sure was worth\nsubmitting? Is something a bit too speculative for a typical /r/AskScience post?\nNo…",
  "data/reddit-ask/r/askscience/comments/qlzdtc/i_got_both_a_flu_shot_and_a_covid_booster.json": "I tried to look up \"how can I get 2 vaccines at once\" but nothing I found\nanswered my question, it was just saying it's safe to have multiple. What I'm\ncurious about is how exactly it's working. Does the fact that they were injected\ninto different arms have something to do with the effectiveness as…",
  "data/reddit-ask/r/askscience/comments/qmhrj3/askscience_ama_series_im_iñigo_san_millán_a.json": "Hi, Reddit! I'm Iñigo San Millán. I am an assistant professor in the Division of\nEndocrinology, Metabolism and Diabetes\n[https://medschool.cuanschutz.edu/endocrinology] and Medical Oncology at the\nUniversity of Colorado School of Medicine [https://medschool.cuanschutz.edu/]\nand associate research…",
  "data/reddit-ask/r/askscience/comments/qmkbqo/in_a_frozen_lake_is_the_water_closer_to_the.json": "I know in the ocean the colder water is denser and therefore closer to the\nbottom. But if this is the case in a lake why would the ice be at the surface?",
  "data/reddit-ask/r/askscience/comments/qmtz70/why_are_vaccines_not_sugar_cubes_anymore.json": "My daughter is about to get her COVID vaccine and she is wondering why does it\nhave to be an injection and not a sugar cube (like back in the polio vaccine).\n\nI wondered myself, was the sugar cube idea only possible for polio? Have other\nvaccines used that method? What are the benefits or detriments…",
  "data/reddit-ask/r/askscience/comments/qn3yq2/what_causes_the_sensation_of_ones_blood_running.json": "I got a call from my confused and hysterical girlfriend in the hospital last\nnight, after she gave her head a good crack on the floor, falling down some\nstairs. The combination of SOMETHING being wrong, but NOT being able to tell me\nherself because of memory loss/confusion, made me experience the…",
  "data/reddit-ask/r/askscience/comments/qn40sn/does_sleep_deprivation_during_teen_years_have.json": "For 2 years between the ages of around 14-16 I got almost no sleep most nights,\non average it was around 1-3 hours on school nights and 6-9 hours on weekends.\nI'm almost 17 now and working on getting better sleep but I'm wondering if that\nperiod had a permanent effect on my life. Is it possible that…",
  "data/reddit-ask/r/askscience/comments/qn93z2/we_are_scientists_from_the_society_of_vertebrate.json": "Hi /r/AskScience! We are members of the Society of Vertebrate Paleontology\n[http://vertpaleo.org/], here for our 8th annual AMA. We study fossil fish,\nmammals, amphibians, and reptiles — anything with a backbone! Our research\nincludes how these organisms lived, how they were affected by…",
  "data/reddit-ask/r/askscience/comments/qndcpu/absolute_zero_is_the_coldest_temperature_is_there.json": "My science teacher in high school said this was a stupid question I asked him.\nThis was 25 years ago. I remember.",
  "data/reddit-ask/r/askscience/comments/qnk8ik/how_deep_is_the_sahara_deserts_sand_and_whats_at.json": "Like is it a solid bedrock kind of surface, or is it a gradient where the sand\ngets courser and courser until it's bedrock?",
  "data/reddit-ask/r/askscience/comments/qo2kwv/why_hasnt_bacteriophage_therapy_become.json": "I feel like it’s a discovery on par with something as revolutionary as solar\npower, but I rarely hear about it ever on the news. With its ability to\npotentially end the antibiotic resistance crisis, why hasn’t this potentially\ngame changing treatment taken off?",
  "data/reddit-ask/r/askscience/comments/qocs2x/how_does_radioactive_iodine_work.json": "For treatment of hyperthyroidism, how does the orally ingested radioactive\niodine only have an effect on the thyroid? How does it not cross to other\ntissue/the rest of the body?",
  "data/reddit-ask/r/askscience/comments/qon666/does_the_human_body_secrete_more_less_or_equal.json": "hot, humid environments hinder evaporation, causing a person to be visibly more\nsweaty than they would if they were in a dry climate.\n\nHowever, my question is this this. If you were to place the same person in both\nenvironments with equal temperature, one with zero humidity and one with…",
  "data/reddit-ask/r/askscience/comments/qp5i5w/in_the_seinfeld_episode_the_junior_mint_jerry_and.json": "I presume an infection, but wasn't sure if possibly the body would somehow\nbreakdown/consume the food?",
  "data/reddit-ask/r/askscience/comments/qph4mo/given_a_planet_with_higher_gravity_than_earth.json": "Considering we can easily float on water in our current planet, if the gravity\nwould increase we would be heavier but so would the water, would this extra\nweight make the water easier to swim in?",
  "data/reddit-ask/r/askscience/comments/qpszej/between_eusthenopteron_and_panderichthys_what.json": "Looking at the charts of evolution of land animals the anal fin disappears\nbetween Eusthenopteron and Panderichthys. Do they become part of the pelvis? Do\nthe bones of the anal fin simply stop being being created? Some combination or\ndo they change in some other way all together?",
  "data/reddit-ask/r/askscience/comments/qpyzzl/why_cant_the_immune_system_create_antibodies_that.json": "Rabies lyssavirus is practically 100% fatal. What is it about the virus that\ncauses it to have such a drastic effect on the body, yet not be targeted by the\nimmune system? Is it possible for other viruses to have this feature?",
  "data/reddit-ask/r/askscience/comments/qq00g9/how_is_it_possible_that_each_star_in_the_sky_puts.json": "If I'm looking at a star in the sky, billions of miles away, and I take one step\nto the left, I am stepping into a new stream of photons from that star. What is\nthe resolution of this line of sight? Is there theoretically a small enough\ndistance that I could move to fit in between the stream of…",
  "data/reddit-ask/r/askscience/comments/qq25xa/askscience_ama_series_greetings_science_fans_im_a.json": "I'm an author and editor on the science journal Nature, the place where\nscientists like to publish their coolest finds. As Nature's resident fossil\nhound for more than 33 and a third revolutions (which must be a long playing\nrecord) I've had the honor and privilege of steering the first…",
  "data/reddit-ask/r/askscience/comments/qqskgp/why_do_healthy_habits_usually_require_a_lot_of.json": "What evolutionary reasons made humans so prone to make bad long term decisions?",
  "data/reddit-ask/r/askscience/comments/qro13a/how_does_quantum_tunneling_work.json": "i mean, a particule can go throught matter because, it´s going too fast, or it\ncan travel trought the gasp in our cells?.i mean, in that way why arent we\nchange by this objects. like. Hows a particule can go so fast that can traverse\nyou without been notice.Ex:- you can feel photons (light) but you…",
  "data/reddit-ask/r/askscience/comments/qrzibv/what_is_the_origin_of_the_negative_phase_of_a.json": "The pressure-time characteristic of a blast wave has a positive phase followed\nby a negative phase. What is the cause for this negative phase? I thought it may\nbe conservation of mass accounting for the increased density of the\noverpressured air, but I haven't found any solid answers.",
  "data/reddit-ask/r/askscience/comments/qsaxk0/many_people_seem_to_instinctively_fear_spiders.json": "Not sure whether to put this in anthropology or psychology, but here goes:\n\nI remember seeing some write-up somewhere that described something called\n'primal fears'. It said that while many fears are products of personal and\nsocial experience, there's a handful of fears that all humans are (usually)…",
  "data/reddit-ask/r/askscience/comments/qsg7hm/what_happens_if_a_person_who_was_previously.json": "edit: follow up question, is there some sort of “mild rabies” where you have\njust enough rabies antibodies to not die, but not enough the resist rabies\nfully? or is it death or no death and no in betweens",
  "data/reddit-ask/r/askscience/comments/qsppfj/what_is_the_context_of_the_geometric_mean_when.json": "I had wished to understand why transmission lines and other electrical systems\ntypically use 50ohm loads for impedance. Everywhere I look online, websites just\nrepeat the facts that this is derived from taking the values that provide\nhighest power transfer (30 ohms), lowest power loss (77 ohms),…",
  "data/reddit-ask/r/askscience/comments/qt0qdq/why_are_there_so_many_salt_deposits_in_the_great.json": "Furthermore, is it more common for salt deposits to be under land underwater?",
  "data/reddit-ask/r/askscience/comments/qt41m9/how_did_schrodinger_come_up_with_the_wave.json": "I am from India and conservative people often boast about how Schrodinger got\nhis wave equation from Hinduism. They say Schrodinger, because he used to study\nHindu scriptures, got the equation inspired from Vedanta. Now, I know this is\npseudoscience, so I tried to see how Schrodinger derived…",
  "data/reddit-ask/r/askscience/comments/qt69w7/do_quadrapedal_animals_experience_handdominance.json": "I was just playing with my cats, and realized that since they use they're front\npaws a lot like humans use their hands, that they might experience\nhand-dominance vs natural ambidexterity. Does hand-dominance exist on\nquadrapeds?\n\nAlso, sorry, there wasn't a flair for Zoology, so if this is the wrong…",
  "data/reddit-ask/r/askscience/comments/qt71v1/can_scientists_tell_if_trees_in_a_forest_are.json": "I understand that we can obviously say that a bunch of trees living near each\nother likely all came from the same group of older or long dead trees. But I\nmean can we scientifically say \"Yes this tree is this other tree's direct\ndescendant\" or \"this tree and this other tree came from the same…",
  "data/reddit-ask/r/askscience/comments/qtobjs/how_long_does_it_take_for_the_body_to_replenish.json": "I have seen from various websites that for blood to fully replenish it takes 4-6\nweeks. What I don’t understand is why it takes so long and what variation there\nis depending on the amount of blood lost I.e. 15% vs 30%?",
  "data/reddit-ask/r/askscience/comments/qtrdr7/is_there_a_clear_definition_of_clear_highly.json": "I've read multiple studies posted in /r/science about how a diet rich in \"highly\nprocessed foods\" might induce this or that pahology.\n\nYet, it's not clear to me what a highly processed food is anyway. I've read the\ningredients of some specific packaged snacks made by very big companies and\nthey've…",
  "data/reddit-ask/r/askscience/comments/quev3l/askscience_ama_series_im_a_wildlife_ecologist.json": "Hi everyone, I'm Dr. Rae-Wynn Grant, a wildlife ecologist with an expertise in\nuncovering how human activity influences carnivore behavior and ecology. I have\nbeen studying the world's most threatened mammals for more than 15 years across\nsix of the seven continents.\n\nI received a B.S. in…",
  "data/reddit-ask/r/askscience/comments/qugft5/is_imposter_syndrome_prevalent_in_scientific.json": "I’m currently in my second year of a bsc in biomedical sciences , I’ve kind of\nhit a block where I feel like I’ve faked it to get here , like every grade I’ve\never had was a fluke and I really know nothing , I am an A or A* student though\nwho got a first last year .Am I alone in this or do others on…",
  "data/reddit-ask/r/askscience/comments/quhrie/why_is_binocular_vision_such_a_dominant_model_in.json": "Why do so many mammals / reptiles / fish) hold to the binocular vision model, or\nperhaps why haven't more animals in these categories evolved more than two eyes?",
  "data/reddit-ask/r/askscience/comments/quy1p6/can_an_organisms_physical_structure_be_inferred.json": "For example, if provided the DNA of an elephant, would it be possible to\ndetermine that the organism it codes for has four legs, two tusks, a trunk, and\nso on without knowing in advance that it's an elephant? If not, why is this\nimpractical or impossible?",
  "data/reddit-ask/r/askscience/comments/qvj5jr/will_coffee_stay_hotter_if_i_put_milk_in_right.json": "So I've made myself a cup of coffee but the rest of breakfast is a minute from\nready and I ask myself. \"Will my coffee stay hotter if I put the milk in now or\nif I put the milk in when I sit down to eat?\"\n\nI decided to wait and my coffee is adequately hot but the question remains.",
  "data/reddit-ask/r/askscience/comments/qw145x/ask_anything_wednesday_engineering_mathematics.json": "Welcome to our weekly feature, Ask Anything Wednesday - this week we are\nfocusing on Engineering, Mathematics, Computer Science\n\nDo you have a question within these topics you weren't sure was worth\nsubmitting? Is something a bit too speculative for a typical /r/AskScience post?\nNo question is too…",
  "data/reddit-ask/r/askscience/comments/qw24mg/can_covid19_be_spread_by_mosquitoes.json": "This is something that's been bothering me since the start of the pandemic. We\nknow mosquitoes can transmit pathogens, so is it possible that mosquitoes can\ntransmit Covid-19?",
  "data/reddit-ask/r/askscience/comments/qwkx4g/why_do_viruses_such_as_smallpox_chickenpox_and.json": "Viruses like smallpox lead to blisters, rashes, and or lesions on the surface of\nthe skin. How does the virus cause this an why do the 'pox' tend to appear\nrandomly on the body. What decides the location of these marks and their density\nor cluster formation?",
  "data/reddit-ask/r/askscience/comments/qwo8od/askscience_ama_series_were_here_to_discuss.json": "In recognition of Hunger and Homelessness Awareness Week (#HHWeek), join a\ndiscussion about the societal and medical problems that are not only faced by\nindividuals with homelessness and mental illness, but also the limitations faced\nby the providers and care agents. Ira Glick, MD is an academic…",
  "data/reddit-ask/r/askscience/comments/qwu9v5/is_the_time_component_of_spacetime_expanding_as.json": "It's been established that space is expanding - accelerating, even. But my\nlayman's understanding is that in spacetime, space and time aren't really\nseparate concepts, they're just different relative directions that something can\nmove through it, to use the loaf of bread analogy. But it's one can…",
  "data/reddit-ask/r/askscience/comments/qwwp2o/blood_bank_pioneer_charles_drew_was_killed_in_a.json": "By 1950, the major blood groups and RH would surely have been known for\ntransfusion, (eg in North Carolina where the crash occurred)",
  "data/reddit-ask/r/askscience/comments/qy5ram/any_studiesstatistics_on_effectseffectiveness_of.json": "Lot of countries are now offering 3rd shot for some age groups (mostly mrna\nbased vaccines). Are there any studies on possible side effects from the booster\nshot? (e.g. does someone who had bad side effects after the 2nd shot going to\nhave similar after the 3rd one? or someone who had no bad side…",
  "data/reddit-ask/r/askscience/comments/qyjaku/helicopters_have_rear_rotors_to_control_spin_why.json": "I get that the rotational torque of a helicopter's main rotor needs to be offset\nto prevent it the body from spinning in place--and that is what the rear rotor\nis for, makes sense. But in the case of a single propeller plane, why doesn't it\nneed some smaller prop/rotor at the wingtips to help with…",
  "data/reddit-ask/r/askscience/comments/qywo6p/how_much_of_the_smallpox_fatality_rate_was_due_to.json": "Smallpox killed about 30% of those it infected and the numbers were even higher\namong populations with no exposure. If small pox returned, most of the\npopulation would have no exposure or vaccination history. But with more\nknowledge of viruses and better healthcare today, do we have a sense of…",
  "data/reddit-ask/r/askscience/comments/qyzuhh/why_can_something_such_as_root1_be_categorised_as.json": "This is probably a very vague and poorly thought out question but I'm curious.\nBasically, from my limited understanding of complex and imaginary numbers. A\nnumber which has no real solution can be manipulated and exist within things\nthat have ramifications in the real world. Despite having no \"real\"…",
  "data/reddit-ask/r/askscience/comments/qz1ojz/why_makes_endometriosis_so_hard_to_diagnose.json": "According to Wikipedia, “Women suffering from endometriosis see an average of\nseven physicians before receiving a correct diagnosis, with an average delay of\n6.7 years between the onset of symptoms and surgically-obtained biopsies, the\ngold standard for diagnosing the condition. This average delay…",
  "data/reddit-ask/r/askscience/comments/qzfrxp/the_pauli_exclusion_principle_doesnt_apply_to.json": "Let's say I observe a photon. How would I know that's not, for instance, ten\nphotons in the same state? Once two particles are in the same state, is there\nsome mechanism by which they can diverge?",
  "data/reddit-ask/r/askscience/comments/qzh09o/why_is_argon_used_in_sputtering_pvd_processes.json": "Last week during a lecture about PVD and sputtering my professor showed a graph\nof sputter yield for each atomic number, and it looked like the opposite of\natomic radii for each atomic number, the yield goes up as you move to the right\nin the periodic table, and drops down when you move from a noble…",
  "data/reddit-ask/r/askscience/comments/qzozm6/do_diffused_and_focused_mode_of_thinking_actually.json": "I read this in a book called mind for numbers and is this an actual thing with\ncredible research behind it or not If so how can I rapidly change between them",
  "data/reddit-ask/r/askscience/comments/r06she/can_i_average_out_water_temperature_by_adding.json": "Let's say I want my bath at a perfect temperature, but my water heater is\nbusted. I have a jumbo cauldron at my fireplace, though, so I boil up 25 gallons\nof water, and mix it with my ice cold tap water, trying to get the temperature\njust right.\n\nJust to make the math easy, I have 25 gallons of…",
  "data/reddit-ask/r/askscience/comments/r0f5si/are_sounds_quieter_at_higher_altitudes.json": "I was thinking that there’s virtually no sound in space because there’s\nessentially no matter for it to be transmitted through. Are sounds quieter at\nhigher altitudes because there’s less air?",
  "data/reddit-ask/r/askscience/comments/r0h04r/how_did_rocks_end_up_in_places_that_arent_near.json": "Especially big rocks, how could they just be sitting out in places with no\nwater, near no places with volcanic activity, and if large volcanic eruptions\nput them there wouldn't their be pieces of volcanic rock there too?",
  "data/reddit-ask/r/askscience/comments/r13mk4/askscience_ama_series_were_journalists_who_used.json": "We're ProPublica\n[https://www.propublica.org/newsletters/the-big-story?source=social] reporters\nBernice Yeung [https://twitter.com/bmyeung?lang=en], Michael Grabell\n[https://twitter.com/michaelgrabell] and ProPublica data reporter Irena Hwang\n[https://twitter.com/irenatfh]. Bernice and Michael have…",
  "data/reddit-ask/r/askscience/comments/r16693/how_do_physicists_predict_new_fundamental.json": "What does an “undiscovered particle” look like in the math, and how do you know\nit when you see it?",
  "data/reddit-ask/r/askscience/comments/r1t3r9/why_does_depression_cause_brain_atrophy_in.json": "Is it reversible?",
  "data/reddit-ask/r/askscience/comments/r1w6lf/since_insulin_regulates_the_production_of_ketones.json": "When a Type 1 Diabetic attempts to follow an extremely low carb diet they would\nhave to take close to no insulin or else they would risk facing repeated low\nblood sugar levels which then would force them to eat carbohydrates to raise,\nmaking the diet no longer low carb. When insulin levels are cut…",
  "data/reddit-ask/r/askscience/comments/r2iyyl/can_someone_please_explain_the_name_of_the_newest.json": "I know it is based on PANGO system:\nhttps://en.wikipedia.org/wiki/Phylogenetic_Assignment_of_Named_Global_Outbreak_Lineages\n\nCan you explain how does the PANGO system work?\n\nDoes it always start with a letter? What does the letter means?\n\nWhat does the dot means?\n\nWhat does the number mean?\n\nI know…",
  "data/reddit-ask/r/askscience/comments/r2pydi/historically_speaking_how_was.json": "People must have been aware that you need to breathe in order to stay alive. How\ndid they try to explain this before the modern explanation was established?",
  "data/reddit-ask/r/askscience/comments/r2r87m/whats_the_dry_papery_layer_inside_a_peanut_shell.json": "It's not connected to anything but is (static?) clinging to the \"nut\"/legume\nitself, it must have dried off of something?",
  "data/reddit-ask/r/askscience/comments/r3bg87/why_is_the_new_covid_variant_being_called_omicron.json": "If they follow the Greek alphabet then the new one should be called \"Nu\". So why\ndid they skip not one, but two letters to \"Omicron\"?",
  "data/reddit-ask/r/askscience/comments/r3i5ty/can_annual_plants_become_perennial_in_controlled.json": "If I take my marigolds inside for the winter to protect them from the elements,\nwill they continue to flourish or are they genetically 'programmed' to die after\none growing season regardless of the weather?",
  "data/reddit-ask/r/askscience/comments/r494q3/when_they_talk_about_mutations_escaping_vaccine.json": "I kept hearing that this Omicron variant has the potential to escape vaccine\nprotection, and the word escape to me implies completely avoid it. Is that what\nescape means in this context, or does escape mean that it reduces but doesn’t\nnullify the protection of vaccines?/r/",
  "data/reddit-ask/r/askscience/comments/r4fgsb/how_do_antibodies_find_viruses_its_not_like_they.json": "Is it just a game of chance, where there's enough antibodies produced that they\nare bound to \"bump\" into a virus?",
  "data/reddit-ask/r/askscience/comments/r4nv3g/how_were_the_great_lakes_formed.json": "This one has been bouncing around my head for a long time. I've lived within an\nhour of a Great Lake for 20/24yrs of my life, and I still don't understand how\nthey came to be. I've googled it, and all the sites say is \"the Great Lakes were\nformed by the melting of the Laurentide Ice Sheet during the…",
  "data/reddit-ask/r/askscience/comments/r4xct1/how_do_drugs_know_where_to_go_in_the_body.json": "First of all, I obviously don't think medicine is actually making the choice of\nwhere to go.\n\nBut, if I take (for example) acetaminophen for a sprained ankle, adderall for my\nadhd, and bupropion and lamotrigine for my bipolar, how does all of that get to\nwhere it needs to go? Is it just a matter of…",
  "data/reddit-ask/r/askscience/comments/r5czbw/why_would_vaccines_target_the_spike_protein_when.json": "I was scrolling through popular and ran into this\n[https://www.reddit.com/r/conspiracy/comments/r44y2r/an_immunocompromised_vaccinated_body_gave_birth/]\npost (yeah I know, it's from conspiracy).\n\nAnyway, upon looking at the sources, it seems like future variants of covid will\nhave more variation in…",
  "data/reddit-ask/r/askscience/comments/r5lruj/askscience_ama_series_testing_your_poop_to.json": "Let's talk wastewater-based epidemiology (WBE)!\n\nWBE uses wastewater (aka, sewage) sampling to track public health at a\npopulation level with geographic specificity. While it has been around for\ndecades, wastewater surveillance really entered primetime as a tool for tracking\nthe spread of COVID…"
}