{
  "data/reddit-ask/r/AskHistorians/comments/npvtx2/qin_and_zhao_mobilised_up_to_a_million_men_in.json": "As the title suggested, the historical description of the battle of ChangPing\nsays that both Qin and Zhao sent an army in the size of about 500000 men. And\nafter Zhao lost the battle, Qin buried 400000 Zhao soldiers alive.\n\nI find such figures very difficult to believe. For comparison, the army…",
  "data/reddit-ask/r/AskHistorians/comments/npxb0w/testing_period_of_rules_change_no_exampleseeking.json": "Hello everyone,\n\nTLDR at the Front\n\nWe are contemplating a permanent change to the rules that would remove the 'No\nExample Seeking' Rule and replace it with more expansive allowances. For the\nnext month we will be testing this out, and at that point consider whether to\nmake the change permanent…",
  "data/reddit-ask/r/AskHistorians/comments/nq7gze/why_are_greekroman_ruins_so_much_better_preserved.json": "Iran has been a center of continuous civilization for 2,500 years. Persian\ncities in their heyday were just as grand as any Greek city, so why is classical\nHellenic architecture ao well-known and ancient Persian architecture not? Why is\nthere so little left of Ctesiphon, or Pasargadae, or Persepolis…",
  "data/reddit-ask/r/AskHistorians/comments/nqlq0g/are_there_any_historical_figures_who_were_thought.json": "Otto Braun was a German communist who had a long history in the USSR and East\nGermany. It came out later in his life that he was also Li De an advisor to Mao\nwho was a leader on the long march. Are there any other examples of people who\nwere thought to be two distinct historical figures but were…",
  "data/reddit-ask/r/AskHistorians/comments/nqny7g/who_was_the_gentleman_who_stands_outside_the.json": "According to this Wikipedia article\n[https://en.wikipedia.org/wiki/Uniforms_of_the_Royal_Air_Force#Historic_uniforms]\nJohn Slessor, later air marshall of the RAF, described the then-current RAF\nuniforms as being \"a nasty pale blue with a lot of gold over it, which brought\nirresistibly to mind a…",
  "data/reddit-ask/r/AskHistorians/comments/nqq21z/what_was_the_process_to_reintegrate_newly.json": "In Band of Brothers, there’s a scene where they liberate a concentration camp.\nHowever, the soldiers are told that they can’t provide too much food to the\nprisoners because of their malnutrition and require the prisoners to go back\ninto the camps.\n\nI was wondering what was the exact process, such as…",
  "data/reddit-ask/r/AskHistorians/comments/nqv7cl/a_1944_comic_in_which_lex_luthor_uses_an_atomic.json": "In addition, if anyone has answers:\n\n * I know the idea of using atomic energy for a weapon existed in pop culture\n   well before the Manhattan Project. If the idea of an atomic bomb was so\n   well-known that comic book writers knew about it, what was the harm in comic\n   book readers knowing about…",
  "data/reddit-ask/r/AskHistorians/comments/nr3vaw/what_were_some_notable_or_interesting_conspiracy.json": "A recent interaction elsewhere got me thinking about what conspiracy theories\nthere were in the past. I'm also curious if they have had any significant impact\nor were just downright strange. I've heard of countries creating or spreading\nmisinformation campaigns, but I've honestly not looked into it…",
  "data/reddit-ask/r/AskHistorians/comments/nr8qo8/why_are_chinese_dynasties_not_named_after_the.json": "Usually \"dynasty\" refers to a family of rulers or influential people, like the\nHapsburg dynasty. In Chinese history though \"dynasty\" seems to be a different\nterm, as different eras where China is ruled by different families are given\nnames called \"dynasties\" but not named after the ruling family.…",
  "data/reddit-ask/r/AskHistorians/comments/nrca05/why_were_the_27th_army_group_killing_other_army.json": "One of the aspects of the Tienanmen Square crackdowns I've never really\nunderstood is the role of the 27th Army Group seemingly massacring police, other\nArmy groups, running over army medics and police lines in APCs and shooting\nsoldiers and executing wounded soldiers.\n\nFrom what I've read, they…",
  "data/reddit-ask/r/AskHistorians/comments/nrclng/where_does_the_idea_that_poverty_is_a_moral.json": "I am writing an essay, and I claimed that people have said that poor people are\npoor because of their own moral failings. I have heard this in school when I was\nyounger, but I have been unable to find a reliable source or any source at all\nreally. Is this statement just flat out wrong then? The…",
  "data/reddit-ask/r/AskHistorians/comments/nrho2x/the_rise_of_nazi_germany_is_often_blamed_on_the.json": "This is something that I have wondered for a while. Italy was not burdened with\nthe treaties, reparations, and restrictions that are usually cited as the reason\nthe Nazis were able to gain support.\n\nWere conditions in Italy bad for the average citizen at the time? Did they view\nWWI as a vain…",
  "data/reddit-ask/r/AskHistorians/comments/ns5e22/its_some_time_between_18301860_and_im_a_white.json": "Not just the threat from Natives, but what environmental and animal threats\nwould I face as well?",
  "data/reddit-ask/r/AskHistorians/comments/nseqms/from_1876_to_1916_the_two_main_spanish_political.json": "This system seems so fascinating and bizarre that I'm not even sure what\nquestions to ask about it. I'm completely ignorant on the Spanish political\nclimate at the time too so I'm curious about any context to this.",
  "data/reddit-ask/r/AskHistorians/comments/nsxmcf/why_is_south_africa_the_only_african_country_with.json": "Specifically subsaharan African countries. I'm aware that during the 17-1800's\n(I think) there were a lot of power struggles between European countries over\nwho could colonise what area in Africa. North Africa probably has a larger white\npopulation I'm assuming partly because it is quite close to…",
  "data/reddit-ask/r/AskHistorians/comments/nt3l5t/shakespeare_wrote_hamlet_and_had_a_son_called.json": "Are they the same name but written differently because of nonstandardized\nspelling?\n\nAre they different names, but just happen to be spelt very similarly?\n\nDid people change letters in names like that a lot and are there other examples?\n\nWas it common to name your kid after something important to…",
  "data/reddit-ask/r/AskHistorians/comments/nt4qj1/what_drove_printing_press_makers_to_include_the.json": "Was on an internet binge of language videos and one was talking about the old\nthorn letter 'þ' (th) and how it ended up being converted to 'y' (as in Ye Olde\nwhatever) in printed books as the letter wasn't available in type fonts commonly\navailable. Similarly how we used to have 'ß' (ss) which is…",
  "data/reddit-ask/r/AskHistorians/comments/ntcbl5/why_would_a_grave_in_rural_vermont_be_surrounded.json": "Hello! I am from rural Vermont, and there is a quite small cemetery local to me\nthat I visit semi-frequently. I have family buried there. Many of the stones in\nit are from the mid to late 1800s though there are more modern ones as well.\n\nThe particular stone I have a question about is dated in the…",
  "data/reddit-ask/r/AskHistorians/comments/nu4ges/since_potatoes_have_not_been_discovered_yet_what.json": "Potatoes seem an ingrained part of most diets, but are relatively new on the\nscene to my understanding as they were discovered in North America. Was there a\ntraditional root or starch used in cooking before we added potatoes to\neverything?",
  "data/reddit-ask/r/AskHistorians/comments/nu7c4e/why_did_nearly_all_of_the_worlds_civilisations.json": "Humans have been around for 200,000 years. The world's first civilisation,\nMesopotamia, emerged just around 12,000 years ago. I imagine there is no\nnecessary period of time it takes for a civilisation to emerge from the\nemergence of humanity. Mesopotamia took around 188,000 years to emerge…",
  "data/reddit-ask/r/AskHistorians/comments/nue09r/its_europe_in_the_14th_century_and_war_is_raging.json": "In the modern day, obviously, if the president found his way into a camp in the\nmiddle east, he's well known enough that if someone was impersonating him, it's\na Mystique situation, as opposed to a random guy claiming to be him.\n\nThis question actually came from an episode of the West Wing, when…",
  "data/reddit-ask/r/AskHistorians/comments/nun2k9/how_common_would_knowledge_of_spaghetti_be_in.json": "I recently played Read Dead Redemption 2, and in it, one character remarks that\nthey'd eaten spaghetti from some Italians that they were guests of, and the\nother characters didn't seem to know what it was. The character in question\ncalled it something that \"looked like worms that tasted…",
  "data/reddit-ask/r/AskHistorians/comments/nuw3wt/in_the_sherlock_holmes_stories_holmes_and_watson.json": "This was originally asked\n[https://www.reddit.com/r/AskHistorians/comments/my5go4/in_the_original_sherlock_holmes_stories_holmes/]\nby /u/Jerswar last month, but it didn't get any answers, and I'm now curious\ntoo.",
  "data/reddit-ask/r/AskHistorians/comments/nuz38g/how_did_nations_during_the_height_of_naval.json": "Essentially as it sounds. To extrapolate, where a nation declared war on\nanother, did they try to get into contact with ships at sea, particularly\nmilitary vessels, to let them know of any change in diplomatic status? Or were\nthey just left to themselves?",
  "data/reddit-ask/r/AskHistorians/comments/nv5rcr/two_of_my_favorite_movies_the_kings_speech_and.json": "In the former film, Churchill is seen as a respected advisor to the royal who\nseems to oppose Edward’s marriage to Wallis Simpson, and is the one who suggests\nBertie use King George VI as his name.\n\nIn the latter, King George seems to despise Churchill and they certainly don’t\nseem to have the…",
  "data/reddit-ask/r/AskHistorians/comments/nvj04f/is_there_a_working_theory_for_how_ancient.json": "From my research, it seems that cross-contamination from modern peoples has been\nall but ruled out, and the same mummies have been tested by different peoples\nand by different methods.\n\n\n\nHow did ancient Egyptians do drugs that are native to the western…",
  "data/reddit-ask/r/AskHistorians/comments/nvjqln/in_the_united_states_especially_among.json": "In the US fear of higher education leading to communism seems to have been a\nprominent idea in public conciousness since at least the 1930s. Were there\nsimilar fears of radicalization occurring in pre-modern/early modern high\neducation insitutions or even ancient insitutions of higher learning?…",
  "data/reddit-ask/r/AskHistorians/comments/nvygz0/when_did_99_pricing_become_ubiquitous.json": "I understand the basic psychology of saying its easier for a person to justify\nspending $19.99 rather than $20.00. But when did this pricing scheme become\ncommonplace? was there any particular person or industry who started the trend?",
  "data/reddit-ask/r/AskHistorians/comments/nvz3ap/why_is_judy_garland_regarded_as_a_gay_icon_when.json": "I maybe have it wrong but I was reading about her life (went down a rabbit hole)\nand there is no mention about her being in any relation to the LGBT community,\nbut she's apparently seen as a gay icon (despite her husband having a gay affair\nand not her). All I saw are a few comments she made in…",
  "data/reddit-ask/r/AskHistorians/comments/nw4z28/when_did_a_few_seconds_of_harp_music_become.json": "It's a classic trope that someone will say \"I remember it like it was yesterday\"\nand then a harp will sound and it'll get wavy and go into the memory or dream.\nHow did this begin and become so specific?",
  "data/reddit-ask/r/AskHistorians/comments/nw7r1f/the_mt_vernon_website_lists_at_least_one.json": "Here is the link to the article:\nhttps://www.mountvernon.org/george-washington/health/washingtons-teeth/george-washington-and-slave-teeth/#-\n\nThe author of the article seems to conclude that this arrangement was common and\nvoluntarily between President Washington and the unnamed enslaved persons,…",
  "data/reddit-ask/r/AskHistorians/comments/nwc23c/historians_who_specialize_in_early_american.json": "For the the past nine months, I’ve been trying to confirm or deny the age of a\nCincinnati, Ohio, house widely reported as built in 1804.\n\nThe facts: Although newspaper stories, county records, and the plaque on the\nhouse say 1804, I’ve only been able to date it to 1834. That’s the date on a\nplat…",
  "data/reddit-ask/r/AskHistorians/comments/nwemge/did_some_early_american_settlers_abandon_their.json": "Hello Historians, hopefully this will be an interesting and engaging topic for\nyou to discuss!\n\nIn short, I read a few comments somewhere and the gist of it is this:\n\n\"Some puritans decided to leave their colonies to go live with the native\nAmericans\"\n\nOther comments indicated that young puritan…",
  "data/reddit-ask/r/AskHistorians/comments/nwicge/gonzalo_guerrero_was_shipwrecked_and_then.json": "Did Gonzalo Guerrero have access to military knowledge that was somehow valuable\nto the Maya? And would that be normal for a low-born sailor from some remote\nplace in Spain to have?\n\nAnd wouldn’t the Maya limit their caciques (warlords) to people born in local\nnobility?\n\nAlso, incidentally - would…",
  "data/reddit-ask/r/AskHistorians/comments/nwn6ga/given_strong_mongol_taboos_around_blood_and_the.json": "I just finished reading Genghis Khan and the Making of the Modern World by Jack\nWeatherford. It was a fascinating telling of the Mongols and their history that\nshears away centuries of FUD about the Mongols and their culture, and its\ninfluence on other cultures.\n\nOne question I have after reading…",
  "data/reddit-ask/r/AskHistorians/comments/nx0ckm/im_an_average_peasant_farmer_in_16th_century.json": "This is including basic addition, subtraction and to an extent an understanding\nof economics. Would the average farmer have been educated enough to deal with\nbig figures or would it be limited to simpler ideas such as counting money?",
  "data/reddit-ask/r/AskHistorians/comments/nx3z8b/what_were_napoleonic_war_veterans_opinions_about.json": "Looking over 15 of the only photos taken of Napoleonic veterans in 1858, I\nwondered. What were their opinions of Napoleon III ascension to power?",
  "data/reddit-ask/r/AskHistorians/comments/nx5znk/are_the_stories_of_a_society_a_reflection_of_its.json": "I've been reading a lot of Celtic and Irish folklore, and there is so MUCH\nINCEST, and a LOT of rape as well.\n\nMy question is, did the writers or the storytellers add the embellishments to\nspice up the story, or was rape and incest commonplace? or, was rape and incest\nbetween royals not considered a…",
  "data/reddit-ask/r/AskHistorians/comments/nxds21/how_did_american_emigrees_in_19101950s_europe_get.json": "Many of the notable Americans during the 1920s (Gertrude Stein, Josephine Baker,\nHemmingway) did not have French Citizenship, but were still allowed for long\nperiods of time in the country.\n\nDid they have to apply for visas or was it largely open to Americans?\n\nPassports had just come into pretty…",
  "data/reddit-ask/r/AskHistorians/comments/nxi8ms/was_genghis_khans_mongolia_actually_safe_to_travel.json": "I've often read that Mongolia during the rule of Ghengis Khan was safe for\npilgrims and merchants to travel end to end without encountering bandits. How\nmuch truth is there to that? With that much land being governed how was it even\npossible? Why aren't other empires of smaller scales able to make…",
  "data/reddit-ask/r/AskHistorians/comments/nxmei0/was_there_any_resistance_to_the_rationing_that.json": "Was the rationing during WWII in the United States seen as a universal civic\nduty for Americans or was there notable resistance among the population?",
  "data/reddit-ask/r/AskHistorians/comments/nxqxdv/why_was_the_us_army_so_stingy_with_awarding_the.json": "George Washington was Lieutenant General (until posthumously promoted in 1976).\nAfter Washington, the highest army position (Commanding General/Chief of Staff)\nwas held by Brigadier, Major, and Lieutenant generals until Grant, who was only\npromoted after the Civil War. The two successors to Grant…",
  "data/reddit-ask/r/AskHistorians/comments/nxr1p2/the_last_emperor_was_filmed_in_beijing_in_the_the.json": "The scene can be viewed here [https://www.youtube.com/watch?v=9CitfXK_BvY],\nwhere Puyi's former camp warden and friend is abused by the Red Guards as a\n\"rotten rightist\". Was the CCP at the time permissive of such critique against\nMao's excesses?",
  "data/reddit-ask/r/AskHistorians/comments/nxvovr/how_would_a_medieval_banker_guarantee_that.json": "as kings*",
  "data/reddit-ask/r/AskHistorians/comments/ny261y/how_did_skinhead_culture_got_hijacked_by_racists.json": "From what i know, at first the movement started harmlessly. But then later in\n70s and 80s, the whole thing became asscociate with Neo-Nazi. What the reason\nfor this?",
  "data/reddit-ask/r/AskHistorians/comments/nyos7f/why_did_the_house_of_saud_choose_to_call_their.json": "From my understanding, calling one's self as king in Islam can be considered\nblasphemous, because Allah is supposed to be the only king. So why would the\nHouse of Saud, which was setting up a very religious state, call it the Kingdom\nof Saudia Arabia and not a sultanate or emirate, or something…",
  "data/reddit-ask/r/AskHistorians/comments/nyw2g5/when_the_swedish_parliament_was_looking_for_a_new.json": "The story of how and why Jean Bernadotte became king of Sweden is pretty crazy\nto say the least, if I saw it in a movie I would say it was totally absurd, but\nit happened\n\nNow, if I understand correctly, the Swedish parliament had a few requirements\nthat wanted to fulfil:\n\n * The monarch must not be…",
  "data/reddit-ask/r/AskHistorians/comments/nz71db/why_is_cocaine_not_as_wildly_accepted_now_as_it.json": "In the 80s and 70s coke was so big movies had budgets for it and magazines had\nadd for coke straws.\n\nBut nowadays it is not at the level of cultural permissiveness it was back then.\n\nWhat happened?\n\nDid the crack epidemic shift the persona of coke use from rich white wall street\nand Hollywood guys…",
  "data/reddit-ask/r/AskHistorians/comments/nzaow1/how_many_doctors_and_other_professionals_knew.json": "Edit: While it was running (at any point between 1932-1972 when the\nwhistleblower came forward) to what degree was it common knowledge amongst\nmedical professionals?",
  "data/reddit-ask/r/AskHistorians/comments/nzilbi/bathing_a_guest_and_rubbing_them_with_oil.json": "I have been reading the odyssey and it struck me how often wives and daughters\nbathe male guests and rub them with oil. One of Nestor's daughters bathes\nTelemachus and Helen says she bathes Odysseus. There are definitely more\nexamples in the classics that I cant think of off the top of my…",
  "data/reddit-ask/r/AskHistorians/comments/nzn983/why_do_historians_point_to_the_invasion_of_poland.json": "The historiography for World War 2 seems to point towards Hitler's invasion of\nPoland as the \"official\" start point of the war, however why is it that the\nMarco Polo Bridge Incident between ROC and Japan isn't considered the official\nstart of World War 2? At a glance, it seems pretty Eurocentric to…",
  "data/reddit-ask/r/AskHistorians/comments/nzo9a8/were_there_any_prominent_abolitionists_among_the.json": "I am aware that many believed that slavery caused issues, such as job shortages,\nostensibly because slaves took many of the low-level jobs, but I am not sure if\nany key thinkers of the age were actually opposed to slavery as a concept\nitself.",
  "data/reddit-ask/r/AskHistorians/comments/nzs2dt/in_9_ad_wang_mang_abolished_slavery_in_china.json": "And how did he push through with this type of seemingly wide-scale reform? Was\nThis action done out of some genuine desire to reform society or some sort of\npolitical scheme?",
  "data/reddit-ask/r/AskHistorians/comments/o038s0/roughly_2000_years_ago_paul_the_apostle.json": "I understand that the term Jews nominally identify membership to the Tribe of\nJudah. My understanding, however, is that the term Jews is now an umbrella term\nfor anyone claiming Hebraic descent, and not just limited to actual members of\nthe Tribe of Judah.\n\nIf all Jews were descendants of the Tribe…",
  "data/reddit-ask/r/AskHistorians/comments/o090b0/is_the_spanish_black_legend_a_real_thing_or_just.json": "Is there are more nuanced analysis to take out of the \"Spanish Black Legend\"?\nWhat amount of it is truth, and what is propaganda in bad faith?",
  "data/reddit-ask/r/AskHistorians/comments/o0ii71/in_bbc_sitcom_blackadder_goes_forth_eponymous.json": "Or is Sudan campaign simply a convenient back story prior to the First World\nWar? Wouldn't Boer campaigns make more sense in terms of horror of combat?",
  "data/reddit-ask/r/AskHistorians/comments/o0ts67/did_english_nobility_get_involved_in_the_lives_of.json": "I’m watching Downton Abby for the first time. In the show, the Crawley’s, who\nare the lords of the fictional Downton Abby estate, are very involved in the\nlives of the servants who work and live in their home. They know much about\ntheir personal lives, and even pull strings to get them other jobs,…",
  "data/reddit-ask/r/AskHistorians/comments/o0u0e8/how_common_was_establishing_a_system_of.json": "Inspired by the damsel in a tower question...",
  "data/reddit-ask/r/AskHistorians/comments/o0w9hv/in_the_middle_ages_were_merchants_allowed_to.json": "The author describes a wool merchant chopping a penny into quarters so that he\ncould pay farthings. Was this allowed? Seems like any state concerned about\nforgery and debasement would also prefer to avoid defacement, and also that\npeople would prefer to own whole coins.",
  "data/reddit-ask/r/AskHistorians/comments/o0ywsi/how_did_the_sailors_of_the_earlymodern_and_even.json": "I had a chance to go on a boating trip with a few of my old pals the other day.\nIt was my first time and I didn't bring my sunglasses and it was a very bright\nday. I struggled to not squint my eyes until one of my good friends offered me a\nspare sunglasses. The relief on my eyes were amazing and I…",
  "data/reddit-ask/r/AskHistorians/comments/o14mpx/why_has_occultism_always_had_such_strong.json": "Why do occultism and exotericism of the 19th and 20th centuries have such strong\nties to fascism, racism and traditionalism?\n\nI'm thinking for example about Blavatsky's view on race, Guenon's doctrine of\nPerennialism, Evola's self described \"superfascism\". Is there something inherent\nin exoterical…",
  "data/reddit-ask/r/AskHistorians/comments/o16rv2/is_the_current_obsession_with_spoilers_really_a.json": "I read some discussion about spoilers here on reddit and some users claimed that\n\"our grandparents\" didn't care about spoilers and that people approached\nentertainment in a different way in our grandparents' era. The current obsession\nwith spoilers, they said, is a sign of the commodification of the…",
  "data/reddit-ask/r/AskHistorians/comments/o18r5m/in_1947_a_group_of_33_japanese_soldiers_on_the.json": "While most famous Japanese Holdout stories are much longer, it's still amazing\nto me that a whole group of Japanese soldiers can stay alive and undetected on\nan island less than a quarter the size of Manhattan with thousands of enemy\ncombatants. What do we know about these men? How were they able to…",
  "data/reddit-ask/r/AskHistorians/comments/o1mlv0/was_13_year_olds_getting_married_in_tudor_times.json": "I've heard that most people historically didn't get married until their 20s.\nBut, it was (and, in many regions, still is) legal for people under 18 to marry.\n\nI often hear people explain stuff like Romeo & Juliet or Catherine Howard's\nrelationship with Henry Mannox as being due to differences in age…",
  "data/reddit-ask/r/AskHistorians/comments/o1o7c9/did_fur_traders_in_north_america_build_extremely.json": "This is a historical \"fact\" that teachers here in Canada love to repeat (it also\ncomes up in casual conversation).\n\nDuring the North American fur trade, Europeans would often exchange metal items\nfor beaver furs procured by the natives, to be turned into felt hats back in\nEurope. Among those goods,…",
  "data/reddit-ask/r/AskHistorians/comments/o1vrue/how_historically_unusual_was_it_for_france_to.json": "A gift the size of the Statue of Liberty seems rather strange. Is there a\nhistory of countries making large gestures like that to each other? How much\ncoordination was there between the two governments beforehand, or was it kind of\na surprise?",
  "data/reddit-ask/r/AskHistorians/comments/o1vwdw/why_did_the_british_put_the_50year_provision.json": "I am having trouble understanding this because, on the one hand, it seems like\nif they didn't want China to have control over Hong Kong, they would just not\nhave ceded the territory in the first place. On the other hand, if they were\nfeeling immense pressure to cede the territory, then why include…",
  "data/reddit-ask/r/AskHistorians/comments/o1zp77/what_was_the_public_toilet_experience_in.json": "From what I know of ancient Roman restrooms they were simple rooms with wooden,\nand sometimes stone, benches for people to sit on. These simple rooms offered no\nprivacy aside from the tunics that restroom-goers wore. Some places had buckets\nwith communal sponges on sticks for any wiping that may be…",
  "data/reddit-ask/r/AskHistorians/comments/o23w6j/what_are_some_historical_examples_where_bad.json": "I was thinking of the treaty of pereyaslav between the Zaporizhian Cossacks and\nMuscovy. The cossack side apparently said that Muscovy would be allied with the\ncossack state, while muscovy's translation apparently said that the cossack\nstate would become under muscoy, essentially the cossack state…",
  "data/reddit-ask/r/AskHistorians/comments/o261sa/how_much_contact_did_medieval_europe_have_with.json": "So of course we know Iceland was entirely uninhabited until the late 9th\ncentury, but after it was discovered and settled, did it have much contact with\nthe rest of Europe?\n\nAs a follow-up question, Icelanders surely knew about Greenland, so did any of\nthe rest of Europe know about it? And if so…",
  "data/reddit-ask/r/AskHistorians/comments/o26prw/i_regularly_read_that_romans_greeks_and.json": "From works promoting fasting to something like this in the NYT\n[https://www.nytimes.com/2021/06/17/style/lindy.html], I read regularly read\nthat Greeks, Romans, and Byzantines never ate breakfast.\n\nBut there seems to be a lot of documentation of ientaculum.\n\nSo how did this idea come about? Where…",
  "data/reddit-ask/r/AskHistorians/comments/o28p9v/the_temperance_movement_in_the_us_is_strongly.json": "Many years ago my high school history teacher mentioned that the Temperance\nMovement gained widespread acceptance and membership among women due to\nextremely high rates of alcoholism (and therefore drunken domestic violence) in\npre-Prohibition America. I believe he also mentioned that rates of…",
  "data/reddit-ask/r/AskHistorians/comments/o29obq/does_the_fantasy_trope_of_high_versions_of.json": "In many fantasy settings there are examples of the aristocracy of a society\nmaintaining an old version of a language that is distinct from the common\npeople's language of that society, such as high Valarian in Game of Thrones, or\nhigh Gothic in 40k. What I'm wondering is whether this is purely an…",
  "data/reddit-ask/r/AskHistorians/comments/o2epi8/this_may_be_a_silly_question_but_did_medieval.json": "I had a princess costume as a kid with what was basically a pretty dunce cap\nwith trailing gauze. I’ve seen it painted on a very few historical\nitems/paintings but it doesn’t seem as common as I thought it would be. Were\nthese cone hats/crowns really worn? By whom? And were they worn only for…",
  "data/reddit-ask/r/AskHistorians/comments/o2lbf8/why_did_the_south_korea_and_the_west_help_north.json": "During the 90s, North Korea was a country on the verge of breaking due to the\nfamine, Russia was effectively reduced to a status of a minor power due to the\ncollapse of the USSR and incompetent Yeltsin administration, China was nowhere\nnear as strong as today and the US public was reinvigorated by…",
  "data/reddit-ask/r/AskHistorians/comments/o2p66g/why_is_the_holiday_called_juneteenth_and_how_did.json": "I know what it celebrates, and of course I know Juneteenth is a portmanteau of\nJune and nineteenth, but why is it just named after the date rather than being\nEmancipation Day or Liberation Day or something? And why is it the celebration\nof emancipation, rather than the date of the Emancipation…",
  "data/reddit-ask/r/AskHistorians/comments/o2pd09/did_the_television_show_frasier_influence_the.json": "I watched Frasier for the first time a few weeks ago, and there are several\nmoments where Niles or Marty reference Starbucks as super fancy coffee, which\nfor Niles is saying a lot.\n\nAnd then I realized that, yes, Starbucks was a local Seattle place at first, and\nso the average person probably didn't…",
  "data/reddit-ask/r/AskHistorians/comments/o316vw/in_philip_freemans_collection_of_irish_legends.json": "The passage from Freeman reads:\n\n> There was a certain young and beautiful nun who had taken a vow of virginity,\n> but by human weakness had given in to youthful desire and slept with a man.\n> She became pregnant and her womb began to swell. She came to Brigid to seek\n> her forgiveness and help.…",
  "data/reddit-ask/r/AskHistorians/comments/o37ke4/when_did_the_us_navy_decide_to_build_ships_that.json": "I remember, when I visited the USS Iowa in Los Angeles, they gave us the\ndimensions of the ship and mentioned that the class was designed specifically to\nbe able to fit through the Panama Canal, as being able to quickly move naval\nvessels from coast to coast was naturally very important to the US…",
  "data/reddit-ask/r/AskHistorians/comments/o38qsm/why_is_greece_known_by_a_significantly_different.json": "In hindi Greece is called Yunan. This is still a widely used word and we have\nstores all over selling Yunani medicine etc. Just curious how both the names\norginated, are they linked to each other and why they are so different from each\nother.",
  "data/reddit-ask/r/AskHistorians/comments/o3chqx/why_has_russia_never_collapsed.json": "Why has Russia never collapsed and fractured in the same way other countries\nlike china have? It's massive geographically, and incredibly diverse culturally\nand ethnically speaking. One would have thought that a country so disparate and\ndiverse would have collapsed at least a couple of times. Sure,…",
  "data/reddit-ask/r/AskHistorians/comments/o3hkld/an_explainer_of_juneteenth_and_a_celebration_of.json": "Happy Juneteenth everyone!\n\nFor those not aware, Juneteenth celebrates slavery coming to an end in the\nUnited States, commemorating the date, June 19th, when Galveston, Texas, came\nunder American control. Galveston was the last major rebel territory to have the\nEmancipation Proclamation come into…",
  "data/reddit-ask/r/AskHistorians/comments/o485jo/i_am_interested_in_seafaring_native_american.json": "The fact that the Bahamas and other eastern islands were inhabited seems to\nindicate that there were seafaring people living along the east coast that had\nthe technology to travel quite far across the ocean, yet I can't find any\nresources on them. Have I been looking in the wrong places? Did they…",
  "data/reddit-ask/r/AskHistorians/comments/o4hii8/if_a_modern_catholic_were_to_be_transported_to.json": "I understand that during this time period the Christian faith was quite\nfractitious. There were multiple councils called during this time period with\nthe intent of setting forth a clear doctrine. I am interested in how\nrecognizable the Christian faith of this time period would be to a…",
  "data/reddit-ask/r/AskHistorians/comments/o4kxvs/why_is_siberia_so_well_settled_compared_to_other.json": "I know it sounds crazy to call Siberia densely populated but compared to other\nplaces with similar climates like northern Canada and Greenland it is actually\nvery well populated. There are many major cities like Novosibirsk\n[https://en.wikipedia.org/wiki/Novosibirsk],…",
  "data/reddit-ask/r/AskHistorians/comments/o4m2jm/why_did_people_in_the_us_and_uk_during_the_1800s.json": "Example of a summer day: https://images.app.goo.gl/b4dVomuUNTJm9zct5\n\nTennis example: https://images.app.goo.gl/84CxkVNpuNRmNugd7\n\nHiking: https://images.app.goo.gl/rC9EZ9WZf3nEee977\n\nWhat about heat, mud, sweat, smells, mobility, and comfortability? Was it style\nover everything, back then?",
  "data/reddit-ask/r/AskHistorians/comments/o4ma7x/in_downton_abbey_1922_a_character_gets_an.json": "In Downton Abbey, season 4 episode 7, which takes place in 1922, Ethel goes to a\ndoctor in London to get an abortion. She told her aunt that she found out about\nthe doctor through a magazine in Kings Cross station.\n\nAbortion was illegal at the time. The aunt questions a nurse if the doctor\n\"really…",
  "data/reddit-ask/r/AskHistorians/comments/o4v0c8/what_were_the_borders_of_the_incan_empire_like.json": "What I really want to know is that if there was any kind of \"buffer culture\"\nbetween the large, expansive Incan empire and the smaller Amazonian tribes\n(let's say, east of the Andes in modern day Peru and Ecuador).",
  "data/reddit-ask/r/AskHistorians/comments/o4z9xv/did_ancient_roman_cities_have_their_own_distinct.json": "For example, New Yorkers are seen as tough and loud and people from Seattle are\nseen as compassionate liberals. Would people from Pompeii be seen as drunkards\ndue to their city's history as a major figure in the wine industry? Would\ncitizens of the city of Rome be seen as rich snobs due to it being…",
  "data/reddit-ask/r/AskHistorians/comments/o58fhj/yalta_tehran_these_conferences_would_not_just.json": "At all of these big political meetings, I always wonder what people did for\nfood. As someone with food allergies, that's always a top priority, especially\nin countries that use a lot of my allergies. Did everyone have Iranian cuisine?\nDid people chow down on borscht in Yalta?",
  "data/reddit-ask/r/AskHistorians/comments/o5imj4/until_which_point_in_time_did_the.json": "Also was there mutual intelligibility with e.g. low Saxon? Did English kings try\nto conquer continental Germanic land or interact in other ways?",
  "data/reddit-ask/r/AskHistorians/comments/o5mmvo/are_the_indian_subcontinents_current_religious.json": "To clarify I don't mean the British created Muslim, Sikh, Hindu, Jain etc\ncommunities, its more that they played up and created divisions between them as\na divide and conquer tactic to solidfy their rule. I've seen this idea put\nforward quite extensively in my surface level dips into the subject,…",
  "data/reddit-ask/r/AskHistorians/comments/o5o126/would_there_have_been_name_humour_as_we_know_it.json": "By name name humour I mean stuff like using a particular name to indicate a\nstereotype such as Karen, Kyle, or an elaborate/\"fancy\" name to indicate someone\nrich. Or making fun of someone's name similarly to how school children might\nbastardize someone's name to bully them such as saying someone…",
  "data/reddit-ask/r/AskHistorians/comments/o5o61e/why_are_carrelated_words_so_different_in_british.json": "British and American English aren't so different in general. But when it comes\nto talking about cars they're practically separate languages. Almost every word\nis different:\n\nTrunk/boot, hood/bonnet, tire/tyre, windshield/windscreen, signal/indicator,\ngas/petrol, gas/accelerator, truck/lorry, car…",
  "data/reddit-ask/r/AskHistorians/comments/o608i7/how_did_abolitionist_like_frederick_douglass.json": "And were there different reactions along racial lines? IE white abolitionists\nbelieved that the Justice System would be fair and that slavery as a criminal\npunishment is appropriate while black abolitionists were understandably more\nhesitant?",
  "data/reddit-ask/r/AskHistorians/comments/o60qzf/was_napoleon_a_nice_guy.json": "Not in the perspective of his actions or polices but like was he a straight up a\ncool guy to be around or have a beer with?",
  "data/reddit-ask/r/AskHistorians/comments/o6190j/in_those_american_states_that_did_not_join_the.json": "What I mean to ask is, did things for slave masters and slaves continue to go on\nas before? Were slave owners encouraged or pressured to free their slaves by the\nsociety writ large, so that slavery was abolished de facto? Were slave owners\nseen as a potential fifth column and subject to suspicion?…",
  "data/reddit-ask/r/AskHistorians/comments/o638j7/what_would_be_a_good_place_to_start_for_a_person.json": "I recently visited some Mississippian mounds and also have a visit planned to\nMesa Verde. It made me realize that not only is learning about these places\nfascinating, but I don't know very much either.\n\nI really don't need to learn anything specific, just looking for preferably a\ndocumentary or book…",
  "data/reddit-ask/r/AskHistorians/comments/o65h68/how_did_european_colonizers_battle_the_sun_in.json": "I'm a fair skinned irish man who just returned from the Turks and Caicos and,\neven with all modern advancements in sun blocking, still got burned! How did\npredominantly white colonists in the 15, 16, 17, and even 18 hundreds go about\ntheir days, work, and just live in that environment?",
  "data/reddit-ask/r/AskHistorians/comments/o69pjs/what_was_the_reaction_of_the_east_germans_when.json": "A significant portion of the Germans who became 1st generation citizens of East\nGermany would have been either active supporters of the Nazi regime, or at least\ntacit accomplices. Considering Nazis saw communism as one of their arch-enemy\nand an existential threat, I'd imagine that more than a few…",
  "data/reddit-ask/r/AskHistorians/comments/o6kdzs/are_we_still_looking_for_lost_literature_from.json": "I was listening to a podcast today and the host was talking about how much\nliterature from the past just doesn't exist anymore (Sulla wrote a memoir!), and\nI began to wonder if historians are still looking for this stuff? What are the\nchances that historians will find something like more of…",
  "data/reddit-ask/r/AskHistorians/comments/o6rg64/how_effective_were_the_soviet_union_and_other.json": "I think it's pretty safe to say that the state narrative of there being no\nhomeless people in the USSR quickly fell apart under Glasnost and Perestroika.\nBeing homeless was considered a crime but that wasn't enough to prevent it from\nspouting out in some places (especially towards the 80s). However,…",
  "data/reddit-ask/r/AskHistorians/comments/o6vltl/what_sort_of_influence_has_africanamerican.json": "I know that African-Americans involved themselves in African politics and\nPan-Africanism, but most of the discussion seems to be about the implications on\nAmerican discourse, rather than Africa itself.",
  "data/reddit-ask/r/AskHistorians/comments/o6x833/how_did_people_find_each_other_in_metropolises_in.json": "Thinking about Rome for example. If you had heard of someone but didn't know\nwhere they lived, how could you find them? Was it just a case of asking around\nthe area until you found someone who knew them?",
  "data/reddit-ask/r/AskHistorians/comments/o6zfwj/how_obvious_and_wellcoordinated_were_volleys_of.json": "Peter Wilson, describing the Battle of Nördlingen in Europe's Tragedy: A History\nof the Thirty Years War essentially says as much:\n\n> The Spanish also knew how to deal with the feared Swedish salvo, crouching\n> down each time the enemy prepared to fire. As soon as the bullets whistled\n> over their…",
  "data/reddit-ask/r/AskHistorians/comments/o7c9rc/mass_graves_of_indigenous_peoples_keep_getting.json": "Just 4 hours ago, even more mass graves were found at the site of a Canadian\nresidential school [https://www.bbc.com/news/world-us-canada-57592243].\nConsidering that this source is the BBC, I strongly doubt that a British media\noutlet are fabricating or exaggerating an atrocity that makes a close…",
  "data/reddit-ask/r/AskHistorians/comments/o7cqjo/were_ancient_civilizations_aware_that_they_were.json": "Suppose you are a person living in one of the first agricultural societies, and\nyou are the 10th generation from the people who originally settled.\n\nWould you be aware that your ancestors were hunter-gatherers, or you would only\nknow life as it is now - with farming and some basic society…",
  "data/reddit-ask/r/AskHistorians/comments/o7lkc0/the_history_of_greek_myths.json": "I'm re-listening to Stephen Fry's Mythos, and I've been thinking about how Greek\nmyths seem to be this huge collection of disparate belief systems, woven\ntogether. I've tried to look for some history of the development of Greek myth\nbut it's hard to get beyond retellings of the myths themselves. Is…",
  "data/reddit-ask/r/AskHistorians/comments/o7lui3/teotihuacan_was_the_most_influential_and_powerful.json": "I keep reading about this spider goddess but I keep finding the same question.\n\nIf the city state was so influential, how did this goddess disappear and not be\ninducted into the pantheon of the region? Mesoamerica was very syncretic and\nadopted gods from many different cultures.\n\nWhat caused this…",
  "data/reddit-ask/r/AskHistorians/comments/o7ospc/what_were_the_mechanics_of_sex_work_like_in_1st.json": "This question actually spawned from a Key and Peele sketch where Mary\nMagdalene's pimp comes in, finds her with Jesus, and mistakes him for her new\npimp. It occurred to me that while I know Mary Magdalene herself was unlikely to\nhave been a sex worker, most sex workers probably didn't have pimps in…",
  "data/reddit-ask/r/AskHistorians/comments/o7p60u/britain_in_the_1970s_a_hell_on_earth.json": "The general view we are given of the 1970s is that Britain was an economic\nbasket case due to constant strikes, inflation, militant unions and inefficient\nindustries. Supporters of Margaret Thatcher argued she saved Britain from\ndecline. How valid is this view? Was Britian as bad as is portrayed?…",
  "data/reddit-ask/r/AskHistorians/comments/o7svod/queen_elizabeth_i_of_england_and_oda_nobunaga.json": "I find it fascinating the Queen Elizabeth I of England was born on 7 September\n1533 and Oda Nobunaga was born on 3 July 1534, only 299 days apart.\n\nhttps://en.wikipedia.org/wiki/Elizabeth_I\n\nhttps://en.wikipedia.org/wiki/Oda_Nobunaga\n\nWould the two of them have known of each other's existence, and…",
  "data/reddit-ask/r/AskHistorians/comments/o7y5xc/who_was_healthier_a_rich_citydweller_in_1st.json": "I've heard that medieval European cities were population sinks, but what about\nClassical cities? It seems that, for wealthy people at least, living in a city\nwas a pretty good way to get by (even if plenty of Romans fled to rural villas\nwhenever they could). But what about poor people (I'm also…",
  "data/reddit-ask/r/AskHistorians/comments/o7yi82/napoleon_iiis_wife_empress_eugenie_owned_a_pair.json": "I’ve seen several references to a priceless, one-of-a-kind pair of small grey\ngloves made from spider silk which were created for Empress Eugenie. However, I\ncannot find any photos of them, or any indication that they are in a museum. So\nmy best guess is that they must have been lost or destroyed at…",
  "data/reddit-ask/r/AskHistorians/comments/o7z2y5/i_love_you_guys_ive_learned_so_much_from_you_guys.json": "People here are examples of GOOD NERDS. Yall nerd out on history and every time\nI come back here I learn something new. I am not a historian (I'm a layman), but\nmy field of work frequently requires quick historical answers. You guys give me\nsome information, and then I'm able to find very reputable…",
  "data/reddit-ask/r/AskHistorians/comments/o89l5t/what_might_the_singer_of_barretts_privateers.json": "The song itself is fictional, but also highly realistic. For those not familiar\nwith the song, a 17 year old in Canada signs onto a privateering vessel under\nthe British Crown in 1778, going after American shipping. The ship is completely\nunfit for service and is destroyed by the Americans, with…",
  "data/reddit-ask/r/AskHistorians/comments/o8aash/its_a_known_fact_that_robert_mcnamara_was_a_huge.json": "I want to write an essay on the flaws of McNamara's methods (EDIT: In regards to\nthe Vietnam war) for my history classes but I am finding that concise and\naccurate metrics in this regard are very difficult to come buy. The best I could\nfind was a paper by historian Donald Fisher Harrison. But this…",
  "data/reddit-ask/r/AskHistorians/comments/o8amxp/in_a_til_thread_discussing_the_significance_of.json": "It's my understanding, from a college US history class a few years ago, that the\nUS was incredibly racist. So much so that we considered the Japanese to be less\nthan human, and placing Japanese Americans in camps was a popular move, which\nseemed like common sense to the (white) people of the time.…",
  "data/reddit-ask/r/AskHistorians/comments/o8gpfc/george_washington_carver_said_he_his_sister_and.json": "And is the term \"Ku Klucked\" mean the outlaws were part of the first Klan? I\nshould add he was born as the Civil War came to an end, so this would be in the\npost-war era - though details on his early story are said to be rather murky\nwith a lack of records.",
  "data/reddit-ask/r/AskHistorians/comments/o8p8fl/where_does_the_stereotypical_image_of_a_robber.json": "It seems like an awfully specific image for a someone engaging in a criminal act\nundoubtedly as old as the very concept of personal private property.",
  "data/reddit-ask/r/AskHistorians/comments/o8vcpn/ive_walked_into_a_17th_century_british_coffee.json": "Additionally is there anything I would recognise like a latte or espresso?",
  "data/reddit-ask/r/AskHistorians/comments/o8wcwp/so_whats_the_deal_with_the_merovingian_kings.json": "Every time I try to read up on the Merovingians and understand the early Middle\nAges, something like this (from Wikipedia\n[https://en.wikipedia.org/wiki/Merovingian_dynasty]) happens:\n\n> During the final century of Merovingian rule, the kings were increasingly\n> pushed into a ceremonial role. Actual…",
  "data/reddit-ask/r/AskHistorians/comments/o8zkf6/do_we_have_any_evidence_to_support_the_classic.json": "One of the most reccurring theme in the feminist intellectual foundation, is\nthat humans are \"naturally\" equalitarian (like their Ape cousins) and have been\nliving so until the Patriarchy transition phase 10 000 years ago.\n\nIn this common narrative, patrilinearity was not a thing then. Women…",
  "data/reddit-ask/r/AskHistorians/comments/o931b4/my_greatgrandfathers_sister_went_missing_in.json": "R5: This is the full page ad that my great-grandfather's father took out in the\nChicago Tribune following his daughter's abduction. The story goes that she was\nwalking to her piano lesson in southside Chicago (at the time a wealthier\nneighborhood), but never made it to the piano lesson. They…",
  "data/reddit-ask/r/AskHistorians/comments/o9ia8h/i_am_a_european_king_living_between_10001500_i.json": "How did European royalty respond to domestic violence? Also what would be the\nreaction of it becomes common knowledge and I don't intervene",
  "data/reddit-ask/r/AskHistorians/comments/o9j1qb/web_dubois_asserted_that_around_the_1880s1890s_to.json": "Assuming that DuBois is correct of course, but why German universities? What was\nso special about them? What did he meant by 'real positions'? Obviously, the\ndean is one but what are the other 'real' positions. Also, what was the\nreputation of Harvard University at This time? There was a humorous…",
  "data/reddit-ask/r/AskHistorians/comments/o9mes2/ive_seen_viking_skulls_with_fileddown_teeth_do_we.json": "Pic of filed down teeth\n[https://medieval.gumlet.net/wp-content/uploads/2014/06/viking-filed-teeth.png?compress=true&quality=80&w=768&dpr=2.0].",
  "data/reddit-ask/r/AskHistorians/comments/oa4m5m/dan_carlin_hh_ep_39_carlin_says_scipio_aemilianus.json": "Are there any truth to those statements above?\n\nAlso, at the time Scipio Aemilianus was a Roman General, and Cato was supposedly\nGovernor of an island.\n\nWould a Roman senator be able to show such disrespect to a king? In Egypt or\nelsewhere. What about the relative of a governor. How about a lowly…",
  "data/reddit-ask/r/AskHistorians/comments/oa5ay2/how_did_the_police_proceduraldrama_become_such_a.json": "Police procedurals/dramas are a huge proportion of TV shows, and have been for\ndecades - from episodic shows like the countless Law and Order varieties to\ngenre hybrids like Brooklyn 99.\n\nHow did this start? What factors contributed to this type of show being so\ncommon? How have audience demand and…",
  "data/reddit-ask/r/AskHistorians/comments/oa5nlw/how_seriously_did_the_imperial_japanese_navy.json": "I have read a great deal about the Pacific War my whole life, and I have often\ncome across the statement that commerce raiding by submarine was instrumental in\nweakening Japan's ability to wage war. I have read that the tactics used by the\nUnited States were greatly influenced by Nazi Germany's wolf…",
  "data/reddit-ask/r/AskHistorians/comments/oa7f7v/in_the_image_below_depicts_a_qing_soldier_from.json": "Image\n[https://en.m.wikipedia.org/wiki/File:ChineseSoldierByWilliamAlexander1793.JPG]\n\nNote: Drawn by William Alexander, a draughtsmen to the Macartney Embassy to Qing\nChina.",
  "data/reddit-ask/r/AskHistorians/comments/oa8nqu/its_1066_and_im_somewhere_in_northwestern_europe.json": "For a little further background, what I'm really asking here is how linked in to\nthe \"science news\" of the day could I be? Would it just be some heavenly sign\nwith no context, or would I be more like \"ah yes the priest said the bishop said\nhe got a letter from Rome saying we are seeing something…",
  "data/reddit-ask/r/AskHistorians/comments/oad9zy/why_does_it_always_seem_to_circle_around_to.json": "I've noticed historically speaking the Jewish people are often the target of\nscorn. I can make sense of contemporary hatred as it seems rooted in\nevangelicalism, however, why would for example, the Argentine Military Junta\npick the Jewish people as representative (to some degree) of the…",
  "data/reddit-ask/r/AskHistorians/comments/oajgd1/why_is_st_louis_not_as_culturally_french_as_new.json": "It seems that St. Louis was a major city in French Louisiana, but unlike New\nOrleans, it seems that St. Louis lost much of its French heritage. How come New\nOrleans has managed to stay more French than St. Louis? Did substantial Irish\nand German…",
  "data/reddit-ask/r/AskHistorians/comments/oas5da/crassus_is_often_criticized_for_crossing_through.json": "Alexander the Great's path of expansion\n[https://en.m.wikipedia.org/wiki/Alexander_the_Great#/media/File%3AMacedonEmpire.jpg],\nI don't have a proper pic of the path Crassus took, but this\n[https://earlychurchhistory.org/wp-content/uploads/2014/11/carrhae-Map2.jpg]\ngeneral map of location of Carrhae…",
  "data/reddit-ask/r/AskHistorians/comments/oau8uy/can_you_develop_a_meaningful_degree_of_historical.json": "I love history and care deeply about \"getting it right\". When perusing this\nsubreddit I often see (often in critiques of popular history's sloppy\nhistoriography compared to 'real/good' historians) comments like, \"but really\nthe author you should be consulting is so-and-so, they're an expert in…",
  "data/reddit-ask/r/AskWomen/comments/npueaq/women_who_started_making_a_lot_more_money_than.json": "Do you end up doing things that only the other friend feels like they can\nafford?\n\nDo you feel obligated to pay every time you do something, or to bring some sort\nof gifts, etc.? What about for extended family or parents or siblings?",
  "data/reddit-ask/r/AskWomen/comments/npunfs/women_who_successfully_found_a_partner_online_how.json": "How long were you looking? What were your dealbreakers? How did you decide who\nto meet?",
  "data/reddit-ask/r/AskWomen/comments/nswcxs/update_supplementary_rules_for_thersday_here_to.json": "Hey everyone! Hope your June is off to a fine start. We're here with some notes\nand updates about moderation policy. Without further delay:\n\n\nTHERSDAY\n\nYou suggested and we listened: you wanted a day free of motherhood, parenting,\npregnancy, and similar related posts! In response, we expanded our…",
  "data/reddit-ask/r/AskWomen/comments/nsym37/what_did_you_buy_from_social_media_that_actually.json": "Piggybacking off the opposite post out of curiosity..... what did you buy that\npleasantly surprised you??",
  "data/reddit-ask/r/AskWomen/comments/nt1frm/women_who_arewere_pregnant_but_were_unable_to_get.json": "By “unable to,” it can be due to all reasons (law, religion, beliefs, etc.)",
  "data/reddit-ask/r/AskWomen/comments/ntgoww/for_those_who_got_into_a_healthy_relationship.json": "Especially for those who only had experience with toxic relationships at first",
  "data/reddit-ask/r/AskWomen/comments/nukdsz/women_who_dont_like_bras_how_do_you_get_away.json": "In terms of feeling confident about nipples under shirts in public etc vs\nconcealed under a padded bra. Or do you have a work around to not wear a bra and\nconceal nipples?",
  "data/reddit-ask/r/AskWomen/comments/nwmq9y/ladies_how_did_you_push_yourself_to_take_care_of.json": "In all aspects-physically, mentally, emotionally, and spiritually.",
  "data/reddit-ask/r/AskWomen/comments/nx3rnu/how_did_you_learn_to_stop_apologizing_for.json": "-a woman in her twenties",
  "data/reddit-ask/r/AskWomen/comments/nxet4a/how_do_you_deal_with_women_who_actively_put_you.json": "it rarely happens, but when it does I'm never sure what to do (if social\nsituations with them are hard to avoid) - so how do you handle such treatment?",
  "data/reddit-ask/r/AskWomen/comments/nxxlrv/hey_women_of_reddit_what_are_you_currently.json": "Edit: Thank you guys so much for sharing! Truly inspiring and I hope you all\nwill have success stories.\n\nI'm working on improving to be a better person to those around me and also for\nmyself too so that I can stop living in regret.",
  "data/reddit-ask/r/AskWomen/comments/o1chlp/how_has_your_view_on_love_and_relationships.json": "Question above! Finished reading a book and it's made me realise how much my\nviewpoint on love has shifted over the past few years.",
  "data/reddit-ask/r/AskWomen/comments/o1fqfv/men_apply_for_a_job_when_they_meet_only_60_of_the.json": "Source:\nhttps://hbr.org/2014/08/why-women-dont-apply-for-jobs-unless-theyre-100-qualified\n\nI feel like the impostor syndrome women feel is real!",
  "data/reddit-ask/r/AskWomen/comments/o2loov/why_are_there_so_many_rules_around_what_women.json": "It feels like there are so many types of clothing that are only for women in\nlate high school and college. When you’re in early high school, you’re too young\nand everyone criticizes you for that. When you’re out of college, you need to\ndress “mature” and if you don’t you’re trying too hard. Mature…",
  "data/reddit-ask/r/AskWomen/comments/o2yphg/what_are_your_main_problems_with_dating_in_general.json": "any sexuality/orientation welcome! please specify in your comment if you don't\nmind!",
  "data/reddit-ask/r/AskWomen/comments/o3zggd/was_anyone_the_weird_girl_in_school_how_are_you.json": "No friends, sat alone in lunch during elementary, middle or high school?",
  "data/reddit-ask/r/AskWomen/comments/o4atww/women_who_arent_naturally_social_butterflies_how.json": "Eg house parties, work socials, clubs, socials with a dance floor, etc",
  "data/reddit-ask/r/AskWomen/comments/o4laar/for_women_who_never_get_hit_on_or_crushed_on_how.json": "Also, what have been other people's reactions when they find this out?",
  "data/reddit-ask/r/AskWomen/comments/o4xvdl/what_is_your_favourite_app_something_you_find.json": "It can be anything, say for example — daily life, journaling, period tracker,\ndanger alert, security, photo editing, organiser, productivity. Don't mind me,\nI'm just hoarding information.",
  "data/reddit-ask/r/AskWomen/comments/o5d2gk/how_do_you_handle_getting_ghosted_outoftheblue_by.json": "Friend, significant other, or something in-between.",
  "data/reddit-ask/r/AskWomen/comments/o5lpcb/when_budgeting_what_is_the_first_thing_and_last.json": "If money was tight, what is the first luxury you would be willing to cut out and\nthe last thing you would willingly sacrifice?",
  "data/reddit-ask/r/AskWomen/comments/o5ydq7/women_of_reddit_what_do_you_do_when_youre_sick_to.json": "Like, ugh.\n\n^(Am I going to get downvoted for this?)",
  "data/reddit-ask/r/AskWomen/comments/o6u1g4/what_are_some_long_hair_struggles_youve_encouraged.json": " * encountered",
  "data/reddit-ask/r/AskWomen/comments/o73u6x/whats_something_you_get_compliments_on.json": "Just want to get a feel good thread going! Tell me what people compliment you\non.",
  "data/reddit-ask/r/AskWomen/comments/o7tlva/women_over_30_whats_a_hobby_you_started_late_in.json": "Edit: meant to write Later in life not late",
  "data/reddit-ask/r/AskWomen/comments/o7vchu/derek_chauvin_got_sentenced_to_225_years_in.json": "The original was to be at 30 years. How do you feel about the sentence he got?",
  "data/reddit-ask/r/AskWomen/comments/o8mlml/do_you_get_regular_bikini_waxes_why_or_why_not.json": "Just got waxed for the first time in ~2 years... ugh. Ow.",
  "data/reddit-ask/r/AskWomen/comments/o9d2a4/how_do_you_feel_about_victorias_secret_getting.json": "They are replacing them with The VS Collective, which will include athletes like\nMegan Rapinoe and transgender representatives. Source in comments.",
  "data/reddit-ask/r/AskWomen/comments/o9idlo/how_do_you_feel_about_the_way_your_boobs_look.json": "I saw a post on another sub asking men whether whether they had a preference\nwhether a woman wears bra or not, and alot of the top answers indicated they\neither couldn't tell the difference or didn't care. What are your thoughts?",
  "data/reddit-ask/r/AskWomen/comments/o9jti1/women_who_live_with_their_parents_how_do_you.json": "I mean the constant nagging, fighting, criticism or just overall not feeling\ngood at home. How do you protect yourself from it? Any rituals, habits, coping\nmechanisms or mindsets?",
  "data/reddit-ask/r/AskWomen/comments/o9nb59/how_would_you_love_to_celebrate_your_birthday.json": "I’d love to hear your ideas, budget friendly or extravagant; cozy or\nadventurous; daytime or nighttime activities - anything goes!",
  "data/reddit-ask/r/AskWomen/comments/o9x1sb/whats_the_problem_with_panty_lines.json": "I mean what the hell else would you be wearing? It’s not like I would expect\nwomen to be wearing boxer shorts.",
  "data/reddit-ask/r/AskWomen/comments/oam6fl/what_was_your_fuck_i_need_therapy_moment.json": "I recently had this revelation and was curious if/when others had it.",
  "data/reddit-ask/r/Ask_Politics/comments/nqmpw2/is_critical_race_theory_something_that_is.json": "I've heard a lot of conservatives lately talking about how schools across the\ncountry are teaching critical race theory. However I have yet to hear of an\nactual school that is teaching it.",
  "data/reddit-ask/r/Ask_Politics/comments/ns83ic/can_democrats_pass_smaller_piecemeal.json": "Maybe go item by item: like super-speed internet - I think everyone can see the\nneed for infrastructure that is future-proof, so 20 years from now when the\ninternet is billions of times faster our rural communities will still have\naccess.\n\nSlow internet speeds are a death sentence for our rural…",
  "data/reddit-ask/r/Ask_Politics/comments/nsxy3l/what_is_the_connection_between_qanon_and_the.json": "QAnon has obviously become a major force in Republican politics with I think now\nover a dozen \"QAnon\" Congress Members with their own caucus.\n\nBut what is this thing, what do they want and why is it in our politics in the\nmost powerful country on earth?\n\nLiz Cheney warned that the Republican Party…",
  "data/reddit-ask/r/Ask_Politics/comments/o0dqh4/why_do_republicans_seem_to_be_more_organized_and.json": "Hey everyone, this is just something I've noticed in the last 5-10 years maybe.\nIt could have always been this way, and I just never noticed it so clearly. But,\nthere seems to be a LOT more long-term strategy and maneuvering by Republicans\nthan there does with Democrats. For example, in the news…",
  "data/reddit-ask/r/Ask_Politics/comments/o143by/why_is_the_covid_lab_leak_theory_now_accepted_as.json": "Just to be clear, when I say lab leak I mean a virus that was being studied that\nescaped.\n\nI don't think many scientists thought that a lab leak was absolutely impossible,\nbut anyone who brought up that covid had anything but natural origins was seen\nas a bit of a conspiracy theorist.\n\nNow, the…",
  "data/reddit-ask/r/Ask_Politics/comments/o1ncr8/can_states_move_their_election_days_to_juneteenth.json": "I've been seeing liberals call for election day to be made a national holiday,\nto make it easier for people to vote. Some states with democratic governments\nhave already made election day a state holiday, but this only affects government\nagencies in that state.\n\nIf a state with a democrat-controlled…",
  "data/reddit-ask/r/Ask_Politics/comments/o6bllv/how_does_a_large_country_go_from_3rd_world_status.json": "I am a Singaporean, and I've been researching my country's history. Mostly on\nthe transition from when the British left and today. My country has managed to\ngo from... you know, a backwater to something worth looking at twice. A mention\nhas been made that majority of the programs my leader made was…",
  "data/reddit-ask/r/Ask_Politics/comments/o9ouhk/are_trumps_scotus_judges_less_conservative_than.json": "When Gorsuch was nominated, I was told by my polo sci professors that he would\nbe to the right of Scalia and to the left of Thomas. When Kavanaugh was\nnominated, I heard multiple times that he was predicted to be to the right of\nGorsuch and to the left of Thomas. With Barrett, I heard at least twice…",
  "data/reddit-ask/r/NoStupidQuestions/comments/npie2j/really_important_for_me_its_tearing_my_family.json": "I brought this up during dinner two weeks ago and it’s been tearing my family\napart. My mother thinks you can only fit a couple thousand, my father thinks\nbillions, my siblings think trillions and I think maybe a few million at the\nmost, couple hundred thousand at the least. It’s sparked so much…",
  "data/reddit-ask/r/NoStupidQuestions/comments/npl4k3/can_anyone_give_advice_on_what_to_do_if_a.json": "USA,CA. I live in a neighborhood with mostly street parking. My neighbor won't\nstop buying junk BMWs, I am not exaggerating the dude has like 23 of them, and\ntakes almost all of the parking on our street. They aren't nice cars at all.\nMostly \"craigslist specials\". His front yard looks like a…",
  "data/reddit-ask/r/NoStupidQuestions/comments/npswf5/does_anyone_else_have_a_hard_time_being_on_social.json": "All I see are people’s lives being amazing, oh look at me I have 3 houses and 10\ncars and I never have to work a day in my life, that’s great dude but I have to\nwork 60 hours a week I never get to see my kids and I’m tired even when I’m\nasleep, it just feels like I’m the odd ball like nothing will…",
  "data/reddit-ask/r/NoStupidQuestions/comments/nqt9qd/if_i_was_going_to_die_of_heat_stroke_and_only_had.json": "Let's assume it has no balls to make it easier.",
  "data/reddit-ask/r/NoStupidQuestions/comments/nrhvg1/are_there_any_subreddits_on_this_site_that.json": "I tried to post in one subreddit only to be told my account needs to be 60 days\nold and I need to have 500 comment karma to make post submissions.\n\nI found this to be a little bit on the ridiculous side. How are new users\nsupposed to get anywhere when there are only like 6 subreddits that don’t…",
  "data/reddit-ask/r/NoStupidQuestions/comments/nrj9te/you_ever_look_in_the_mirror_directly_into_your.json": "Not because you look attractive or vice versa, but the act of widening your eyes\nand looking directly at yourself gives me the heeby jeebies. It’s like I think\nto myself “am I really controlling this body”",
  "data/reddit-ask/r/NoStupidQuestions/comments/nrjbbm/why_arent_there_playgrounds_for_adults.json": "Every playground I see, even the big parks, are all meant for kids under 13, and\nreally by the time you’re 11 you’re expected to not play on them. I don’t see\nany places with swings, and monkey bars, and rock climbing, and slides, and\njust. A playground meant for adults. That’ are adult sized. I’d…",
  "data/reddit-ask/r/NoStupidQuestions/comments/nsn21l/does_anyone_else_find_taking_a_shower_to_be.json": "I feel like I ran a mile each time.",
  "data/reddit-ask/r/NoStupidQuestions/comments/nsw6qt/is_it_normal_i_18_m_still_have_sleepovers_with_my.json": "I'm an 18 year old dude, this girl is the same age as me and she's been my best\nfriend since we were 3 and we are just friends. Since we met in preschool, we\njust clicked and we're going to the same college together in the fall. Our\nFriday night sleepovers have been a tradition since our friendship…",
  "data/reddit-ask/r/NoStupidQuestions/comments/nt9k93/is_it_weird_for_me_to_like_moss_over_any_other.json": "Does anyone else just... Like it? It's soft to the touch, vibrant green, is\nunique, you can find it in the weirdest places, and there's actually a huge\nvariety!\n\nWelp.. I guess I just have to make a lonely moss club.",
  "data/reddit-ask/r/NoStupidQuestions/comments/ntaatz/why_is_it_so_much_easier_to_spot_typos_only_𝘢𝘧𝘵𝘦𝘳.json": "I swear, I'll read through a post I'm making, a message I'm sending, or even\nnarrative stuff I'm writing over and over again, and it's only 𝘢𝘧𝘵𝘦𝘳 I've\nfinished it and hit send that I spot typos, and even just general errors in\npunctuation and tone!\n\nIt's certainly not just me, either! Why is…",
  "data/reddit-ask/r/NoStupidQuestions/comments/ntbada/my_dog_pooped_out_a_condom_should_i_be_worried.json": "I had been dating my live-in girlfriend for about six months. One night, while I\nwas walking our dog, the dog pooped out a condom. She was on birth control, and\nwe had not used condoms in about six months. Should i be worried?",
  "data/reddit-ask/r/NoStupidQuestions/comments/ntedlf/wouldnt_any_plane_you_cant_identify_be_a_ufo.json": "Everybody keeps saying that \"UFOs are real\" and \"The government just confirmed\nUFOs\" but wouldn't the term UFO just refer to any object that was flying that we\ncouldn't identify? To be honest this is absolutely more of a nitpicky sort of\ngrammatical question but weren't UFOs were already real, and…",
  "data/reddit-ask/r/NoStupidQuestions/comments/nvisiu/can_someone_please_tell_me_why_my_dog_decided.json": "She got hosed off without remorse and I just wanna know why it was necessary in\nthe first place. Why.",
  "data/reddit-ask/r/NoStupidQuestions/comments/nvn4nx/what_does_dying_feel_like.json": "I’m 21 years old and I am a terminal cancer patient. I was doing well for awhile\nbut it appears my borrowed time is up. I have Ewing’s sarcoma in my lungs and I\nwas wondering if anyone here could help me understand what’s going to happen as\nthis starts to progress further. I want to know what I’m in…",
  "data/reddit-ask/r/NoStupidQuestions/comments/nw8wkg/am_i_being_abused.json": "I ask friends and they say yes, but I ask family members and they say I’m being\nridiculous.\n\nI’m not allowed to lock doors, but my parents have padlocks on the door so I\ndon’t leave the house without them. My dad constantly screams at us for\neverything and my mom’s always mad at me for doing…",
  "data/reddit-ask/r/NoStupidQuestions/comments/nwllt6/if_a_smoker_falls_into_a_coma_for_a_long_time.json": "Since yknow the person hasn't had a smoke in such a long time would it be like\nthey practically gave up on smoking",
  "data/reddit-ask/r/NoStupidQuestions/comments/nx4vp6/does_anyone_else_get_really_sad_on_their.json": "Today is my birthday and I always find i get really down every year. Is this\ncommon for people?",
  "data/reddit-ask/r/NoStupidQuestions/comments/nx6zjc/does_anybody_else_stop_their_microwave_at_exactly.json": "P.S. (The Final three beeps will betray you)",
  "data/reddit-ask/r/NoStupidQuestions/comments/nxlz42/why_are_american_houses_made_of_drywall.json": "Whenever I see a video of someone punching a hole through the wall or just\nleaning too hard I keep asking myself why are American houses made of such\nflimsy walls? They look like they'd crumble with a weak earthquake or something\nlike that",
  "data/reddit-ask/r/NoStupidQuestions/comments/nxsuee/why_do_people_like_joe_rogan.json": "I finally tried watching some of his stuff after hearing good things about him\nfor years, but man. He just kinda sits there like a big stoned gorilla and goes\n\"mm...\" sometimes and asks really basic questions. I watched his interview with\nMacaulay Culkin and Robery Downey Jr. and he seemed like he…",
  "data/reddit-ask/r/NoStupidQuestions/comments/ny4fnl/this_isnt_a_troll_post_but_i_need_to_know_if.json": "This is a serious question. I'm 16.\nWhenever I look at machines, I can feel what it is to be that machine.\nLike I know what it is to mow grass as a lawnmower or how it feels to ride on\nthe freeway as a car. I know how heavy a garage door is because I can feel that.\nIt's not like I imagine it, I feel…",
  "data/reddit-ask/r/NoStupidQuestions/comments/ny7s7m/why_does_chris_brown_still_have_a_career.json": "And why are the majority of his supporters women?????",
  "data/reddit-ask/r/NoStupidQuestions/comments/nyqpcf/how_do_girls_cum_what_comes_out_and_how_long_does.json": "For some context, I live in a religious neighborhood and the sex education at my\nschool is pretty trash. They only teach us about the dangers of not using\ncontraceptives and nothing else. I'm 17m and I have a lot of questions about the\nfemale anatomy that my school and parents would never teach me…",
  "data/reddit-ask/r/NoStupidQuestions/comments/nz5lri/am_i_the_only_one_that_just_gives_up_writing.json": "What the title says. Quite often I write a reply to a comment and just give up\nin the middle of it and discard the comment because I know either no one will\nsee it, care or someone will just be rude about it? Even right now i'm tempted\nto cancel writing this post but I don't know if i'm a drama…",
  "data/reddit-ask/r/NoStupidQuestions/comments/nz8hbk/are_men_not_supposed_to_wear_rings_while_engaged.json": "So I just got engaged to my fiancée, and we went to go get the ring sized at our\nlocal jewelry store.\n\nWhen we got there, as well as looking at the diamond up close and sending the\nring off to be resized, I found a ring I really liked. I ended up buying it for\nmyself, just so that way I could… show…",
  "data/reddit-ask/r/NoStupidQuestions/comments/nzmp1l/what_can_i_do_to_be_less_intimidatingscaring_to.json": "(Im not really sure where to post this question because I am not on reddit very\noften. If you know a better fitting subreddit let me please know. Thank you.)\n\nSo I(25m) am a pretty big guy (6'3). Two years ago I started balding and to not\nbe worrying about my hairline every time I look into a mirror…",
  "data/reddit-ask/r/NoStupidQuestions/comments/nzna5b/aunt_recently_diagnosed_with_alzheimers_how_do_i.json": "Throwaway because this is a sensitive topic for me.\n\n\n\nMy great aunt lives far away from me but has always been a very close and\nimportant presence in my life. She got me into music when I was a kid, and now\nI'm a professional musician. Without going into too much detail, I love her to\nbits and so…",
  "data/reddit-ask/r/NoStupidQuestions/comments/o0blll/why_are_there_people_in_developed_countries_who.json": "I was watching Benefits Britain - which honestly is pretty skewed to make people\non benefits look like lazy moochers... And that's a huge issue in and of itself.\n\nBut still, the question stands. What the hell is up with these people? Like\nthere's no way you can't think of using protection EVER, why…",
  "data/reddit-ask/r/NoStupidQuestions/comments/o0bqof/why_is_my_cat_hellbent_on_watching_me_take_a_shit.json": "Like he will start scratching the door like crazy and wont stop until i open the\ndoor and then he just looks at me, judgingly\n\nAlways watching , judging and watching",
  "data/reddit-ask/r/NoStupidQuestions/comments/o0c4t2/anyone_else_finds_those_tedx_talks_pretentious.json": "I know, \"just dont watch them if you dont like\". I just a few of them and that\nwas enough. It seems like a bunch of pseudo-intellectuals talking about\nessentialy nothing.",
  "data/reddit-ask/r/NoStupidQuestions/comments/o0cy0x/ive_seen_women_complain_about_their_pocket_sizes.json": "If it's obviously such a needed thing, surely somebody (probably a woman) could\ncome out with a clothing line catered to women that includes pockets?",
  "data/reddit-ask/r/NoStupidQuestions/comments/o0gnq2/why_do_we_add_yie_to_the_end_of_words_to_make.json": "For example: Dog becomes Doggie. Cat/Kitten becomes Kitty. Rabbits are bunnies,\nwe have birdies and fishies and my little cousin has a stuffed whale she’s named\nwhaley. It’s not even just to describe cute things. We turn oops and whoops into\noopsie and whoopsie. Even poop becomes poopie. Why do we…",
  "data/reddit-ask/r/NoStupidQuestions/comments/o0ilgt/how_do_you_feel_when_you_see_a_chubbier_guy_at.json": "I'm 17 and kinda worried to go to the gym since I'm a little bit chubbier. I'm\nworking out of my anxiety but I feel like all eyes are on me sometimes.",
  "data/reddit-ask/r/NoStupidQuestions/comments/o0w4xb/who_the_fuck_is_buying_all_these_houses_with_cash.json": "Seems like every place I hear about in the US is going through a crazy housing\ncrisis right now. Where I live, there is zero affordable housing. There is zero\nhousing at ALL actually, because it gets snapped up so fast. Who tf are all\nthese rich ass people? Why are they suddenly buying houses right…",
  "data/reddit-ask/r/NoStupidQuestions/comments/o0zqp5/in_the_us_is_it_commonplace_to_have_a_garbage.json": "I'm trying to work out if this is a rich people thing, a poor people thing, an\napartment thing, a thing that only exists in movies or is from the past, or if\nit's just a common thing to have. You hear the stories of it turning on when\nsomeone has a hand in there cleaning it, or of wedding rings…",
  "data/reddit-ask/r/NoStupidQuestions/comments/o14hye/why_do_neonazis_so_often_deny_the_holocaust.json": "I mean, obviously aside from the fact \"they're stupid af\" but logically, if\nneo-Nazis love the Nazis so much, why would they go to so much effort to try and\n\"prove\" the Holocaust never happened? Surely if they love and worship what the\nNazis did, they should be supporting their \"achievement\" and if…",
  "data/reddit-ask/r/NoStupidQuestions/comments/o15mft/why_do_some_americans_have_such_a_vehement_hate.json": "When a unilingual American shits on a bi/trilingual person for not speaking\nEnglish well, for example. But also getting upset for just hearing a different\nlanguage other than English.\n\nJust wondering based on first hand experience.\n\nEdit: Thanks for all the answers, consensus seems to just be…",
  "data/reddit-ask/r/NoStupidQuestions/comments/o1sx6a/if_you_have_sex_with_someone_already_in_a.json": "Lately I've discovered that people think that sleeping with someone already in a\nrelationship and being aware of that fact is OK because you don't have any\nobligations and therefore you did nothing wrong\n\nI personally think it's wrong, all parties except the partner getting cheated in\nare doing…",
  "data/reddit-ask/r/NoStupidQuestions/comments/o1tqer/are_most_white_collar_jobs_just_easy.json": "Fresh out of university last year, guys! Due to a strange sequence of events and\nsome good luck (and timing?) I got promoted VERY quickly at my first job and I'm\na pretty well-paid project manager, almost hitting 6 figures annually and\nreporting to the top executives within the first few…",
  "data/reddit-ask/r/NoStupidQuestions/comments/o1yk2w/do_couples_in_muslim_countries_often_confuse_or.json": "If they wear a Burka, for example, you wont be able to know who is who aside\nfrom height and voice, are there cases where you might genuinely confuse someone\nelse as your partner?",
  "data/reddit-ask/r/NoStupidQuestions/comments/o2bsbd/does_anyone_else_write_out_entire_narratives_in.json": "I do this all the time on literally every sub I’m on. I’ll be responding to\nsomeones post or comment and then just scrap the entire thing.",
  "data/reddit-ask/r/NoStupidQuestions/comments/o2gdtj/who_picks_up_a_seeingeye_dogs_poo.json": "So if a blind person is out with their seeing-eye dog, and the dog has to take a\npoo... who picks up the poo? Is the dog trained to guide the blind person to\nsaid poo?\n\nWelcome to the crap I think about while I cannot sleep, lol.",
  "data/reddit-ask/r/NoStupidQuestions/comments/o2kmic/does_anyone_else_get_weirded_out_saying_their_own.json": "Strange question i know, when i have to tell someone my name or talk about\nsomeone else with my name it makes me uncomfortable. Like i dont hate my name\nbut when I have to say it i dont like it. Anyone else have this?",
  "data/reddit-ask/r/NoStupidQuestions/comments/o2mi42/did_online_privacy_get_progressively_worse.json": "Basically, did it get worse or was it always the same and people got more aware\nof it just now? I am excluding stuff like Alexa since they didn't exist; the\nquestion applies for preexisting products like browsers, instant messengers,\netc.",
  "data/reddit-ask/r/NoStupidQuestions/comments/o2s8kl/is_anyone_noticing_a_huge_spike_in_ads_on_youtube.json": "I honestly want to use an Ad-Blocker now. It’s absolutely crazy!\n\n4 double ads in a single 15 minute video!",
  "data/reddit-ask/r/NoStupidQuestions/comments/o34lq6/why_do_humans_teeth_need_to_be_brushed_and_other.json": "Like why don’t other animals get cavities and shit. What’s different between\ntheir teeth and ours that cause ours to be damaged differently.",
  "data/reddit-ask/r/NoStupidQuestions/comments/o35hm4/do_i_like_being_alone_or_is_being_alone_what_im.json": "Honestly I grew without any friends. In childhood, I never went over to someone\nelse’s home before, I never had a sleep over, I never have been to a birthday\nparty before. In high school I never went to the dances, never texted anyone,\nnever met up with people after school, never had a girlfriend.…",
  "data/reddit-ask/r/NoStupidQuestions/comments/o3ps7m/how_the_heck_is_my_generation_supposed_to_buy.json": "All I see are constant headlines about how house prices have hit all time\nrecords, and the rate prices are increasing doesn't look like it is going to\nslow down.\n\nAlso, how the hell did it get like this in the first place and why is nothing\nbeing done to stop it?\n\nExcuse me if I seem a bit out of…",
  "data/reddit-ask/r/NoStupidQuestions/comments/o42lc0/why_do_flatearthers_care_what_shape_the_earth_is.json": "I don't see why the concept of it not being round is such a big deal. Why do\npeople care so much? Why would people lie about the shape it is?",
  "data/reddit-ask/r/NoStupidQuestions/comments/o44oag/does_anyone_else_feel_like_were_not_supposed_to.json": "I think it's becoming pretty obvious that humans are not doing well in the\ncurrent state of society, with internet, canned food, cars, fame... It's\nprobably too much for our monkey brains. I feel like we built more than we can\nhandle. I think soon we're going to be suffering from new health…",
  "data/reddit-ask/r/NoStupidQuestions/comments/o4k756/did_i_come_across_a_dead_body_should_i_contact.json": "My girlfriend and I went kayaking today (Upper Peninsula of Michigan) and we\nstopped along the shore multiple times to find rocks. On one of these stops, we\nnoticed that behind a row of trees there seemed to be a field. I wanted to check\nit out so we did. It turned out to be a pond just behind the…",
  "data/reddit-ask/r/NoStupidQuestions/comments/o4ke6a/why_do_people_reply_to_questions_in_the_customer.json": "i get a kick out of it every time. its so funny to see a question under a\nproduct in the questions section that has an answer along the lines of “im not\nsure”.\n\ni remember a while ago i saw someone was asking about the dimensions of a\nproduct in the question section and someone else answered with “i…",
  "data/reddit-ask/r/NoStupidQuestions/comments/o4l2n7/would_it_be_weird_if_i_21f_became_friends_with_an.json": "She's a patient where I work and has been trying to chat with the other older\nladies there saying she just wants a friend. She's isolated and alone most of\nthe time and can't drive herself anymore. Would it be weird if I offered to be\nher friend? She likes to talk a lot and reminds me of my…",
  "data/reddit-ask/r/NoStupidQuestions/comments/o4uk9l/why_is_prostitution_frowned_apon.json": "I am referring to consensual prostitution, where a person willingly chooses this\nprofession. Forced and child prostitution is 200% bad.\n\nIgnoring the religious reasons, I see no reason prostitution should be taboo.\nIt's an honest living with other legal job options.",
  "data/reddit-ask/r/NoStupidQuestions/comments/o4xdap/if_your_heart_stopped_beating_would_your_death.json": "Idk much about strokes and stuff, so I'm asking this sub.\n\nI know that a blockage in a heart might make you feel pain before death, but\nwhat if your heart just stopped. No blockage, and no muscle contractions, would\nyour death hurt?\n\nAnother question; are strokes always painful?",
  "data/reddit-ask/r/NoStupidQuestions/comments/o4xn5z/why_are_butts_so_sexy_seriously_why.json": "This question has been bothering me for a while and can't get it of my chest. I\nGoogle it but I didn't get a good enough response. I mean it's the part where\nshit comes out like wtf.",
  "data/reddit-ask/r/NoStupidQuestions/comments/o533op/anyone_else_with_a_fucked_up_family_here_who.json": "I want to emphasize by saying I don’t judge people for having a better childhood\nor adolescence than I had. However I noticed that often times I look for people\nwho have not so perfect family. I think it’s because I feel like I get\nintimidated when I am surrounded by them because of the fear of…",
  "data/reddit-ask/r/NoStupidQuestions/comments/o53h9g/if_bras_are_necessities_then_why_didnt_we_evolve.json": "Sorry if this is a stupid question, I'm a small-breasted woman so I really don't\nunderstand why bras are necessary. I've heard it said that bras are important\nfor back support, especially for women with larger breasts, and I've certainly\nheard larger-breasted women echo this. It's not just large…",
  "data/reddit-ask/r/NoStupidQuestions/comments/o5543v/is_anyone_else_scared_to_change_jobs_because_your.json": "I got a job offer today and I do not know what to do. My current job is not\nexactly fun, it’s hard work but my colleagues feel like family and I have proven\nmyself to the company. Changing jobs feels like starting over and I’m scared I\nmight make the wrong decision.",
  "data/reddit-ask/r/NoStupidQuestions/comments/o5iit4/if_my_penis_is_so_sensitive_why_cant_it_read.json": "Genuine question, despite its silliness. The tip of a penis has more nerve\nendings than a fingertip (4,000 vs 3,000), and yet it's the fingertip that can\nmake out the dots of Braille. What the difference? Are they different types of\nnerves?",
  "data/reddit-ask/r/NoStupidQuestions/comments/o5n02i/what_is_the_theythem_version_of_calling_somebody.json": "I always use proper respectful pronouns like “ma’am” and “sir” when talking to\nmost people, I am a born and raised Texan so it’s just engraved in my mind to do\nso. Last night I had an androgynous looking waiter and it got me wondering, what\nis the equivalent for non binary people?",
  "data/reddit-ask/r/NoStupidQuestions/comments/o5pn03/why_do_some_people_literally_roar_when_they.json": "These loud sneezers make me poop my pants every time.",
  "data/reddit-ask/r/NoStupidQuestions/comments/o5t2bw/in_english_we_call_our_planet_earth_which_is_just.json": "Edit: Even though I've gotten a bunch of answers so far, I'm still leaving it\nmarked as unanswered in case someone from another place might come across this\nand know something we don't.\n\nEdit 2: Making this as answered. Thank you everyone for all your great answers.\nI'm a little sad to learn that…",
  "data/reddit-ask/r/NoStupidQuestions/comments/o61wyl/why_is_everyone_scared_of_china_becoming_the_most.json": "Edit: Apparently we should have nuked the Chinese before they could have became\nthe number one power.",
  "data/reddit-ask/r/NoStupidQuestions/comments/o66ust/why_dont_the_police_have_to_go_to_law_school.json": "Doesn’t their whole job revolve around keeping up the law?",
  "data/reddit-ask/r/NoStupidQuestions/comments/o69nu8/i_asked_my_interviewer_what_was_her_proudest.json": "The interview went very well and she was satisfied with most of my answers and\nwas laughing as well on some of my replies as she thought that I am funny, but\nwhen she asked me whether I have any questions I asked her what was her proudest\nmoment in this company?\n\nShe replied, it's like I am giving…",
  "data/reddit-ask/r/NoStupidQuestions/comments/o6kbkm/why_does_becoming_a_barber_harder_than_becoming_a.json": "My roommate was in cosmetics and he said he needed hundreds if not thousands of\nhours of training and training for becoming a police man is for a couple of\nmonths",
  "data/reddit-ask/r/NoStupidQuestions/comments/o6nyxs/should_i_wear_hat_backwards_or_front.json": "https://imgur.com/a/WFQki3p",
  "data/reddit-ask/r/NoStupidQuestions/comments/o6y1kk/what_are_some_worktrade_secrets_youre_legally.json": "Edit: you guys are making some really interesting comments. Thanks a lot.",
  "data/reddit-ask/r/NoStupidQuestions/comments/o6zeg5/why_do_people_get_so_offended_by_swear_words.json": "To preface, I am neurodivergent and really struggling with swearing, to me it is\nsimply emphasis or expression using the words available to me.\n\nDon't get me wrong, I understand calling someone an unpleasant name brings\ninsult, I'm not talking about that.\n\nWhat I don't understand is why people get…",
  "data/reddit-ask/r/NoStupidQuestions/comments/o7448s/how_is_it_legal_to_price_something_to_11000_of_a.json": "It doesn't make sense because I can't physically pay that and my bank doesn't\nmeasure my balance to that decimal so how is it legal to include it anyway?",
  "data/reddit-ask/r/NoStupidQuestions/comments/o75azt/why_is_ableism_bad.json": "I kept hearing the word “ableism” and decided to look up what it meant.\n\nIt seems to be “the belief that those with disabilities are in some way lesser\nthan those without”. But…isn’t that true? All other things being equal, it is a\nbad thing to be blind compared to being able to see because sight…",
  "data/reddit-ask/r/NoStupidQuestions/comments/o7dziu/why_cant_britney_spears_just_leaveflee_her.json": "I’m just confused. Seems like a human rights violation…\n\nalso, easy on downvoting my posts, it’s a fucking question",
  "data/reddit-ask/r/NoStupidQuestions/comments/o7j1qb/why_do_people_always_assume_youre_arguing.json": "Is this just a common thing, or likely my issue of coming across as\nargumentative?",
  "data/reddit-ask/r/NoStupidQuestions/comments/o7n2ox/what_the_hell_are_you_supposed_to_do_while.json": "I don't know why but this is the most awkward thing ever. Can someone please\ntell me, what do you do? Smile? Sing along? WHAT?!",
  "data/reddit-ask/r/NoStupidQuestions/comments/o7v7ke/why_do_toddlers_who_fall_over_and_slam_their_face.json": "I see this all the time. Toddlers will fall down and I swear they are totally\nfine and right when you think they are actually all good they burst into tears.\nIt's like for 5 full seconds they are absolutely not experiencing pain or they\nare waiting for a reaction from parents or others before…",
  "data/reddit-ask/r/NoStupidQuestions/comments/o7vsjl/why_are_ids_a_bad_thing_when_it_comes_to_voting.json": "I saw a while back thst people wanted to not require an ID when it came to\nvoting. Why would we want that to not be a thing? In the usa of course.\n\nedit* so what im getting so far is that its about poor people(or one person said\nracism but i dont get whats racist about this). but arent some form of…",
  "data/reddit-ask/r/NoStupidQuestions/comments/o7xggk/does_anyone_else_instantly_forget_what_shirt.json": "Like the moment anyone says that, I immediately forget what my shirt has on it\nand have to look down at it before saying thanks, lol.",
  "data/reddit-ask/r/NoStupidQuestions/comments/o7zr3e/what_actually_happens_if_you_get_a_boner_at_a.json": "Like is there some social rule against it? Does no one care? The thought\noccurred to me just now.\n\nAlso periods. Like are you just not allowed if you’re on your period or is there\nsome process with it?",
  "data/reddit-ask/r/NoStupidQuestions/comments/o85p15/whos_the_idiot_at_reddit_hq_that_decided_to_make.json": "It's terrible. If it was one person they should be fired if it was a team of\npeople they all should go. I'm honestly gonna uninstall the app. I want names.",
  "data/reddit-ask/r/NoStupidQuestions/comments/o88jml/why_is_naked_yoga_allowed_on_youtube_while_other.json": "I don’t get it… if you look up naked yoga on YouTube, you’ll get… well, naked\nyoga. How is this allowed, but when a different YouTuber swears they get\ndemonetized?",
  "data/reddit-ask/r/NoStupidQuestions/comments/o8yj19/how_did_every_nation_decide_to_agree_to_a_7day.json": "I'm sure there were nations that didn't abide by these rules before\nmodernization, but how did the 7-day week come to fruition in all nations?",
  "data/reddit-ask/r/NoStupidQuestions/comments/o90i7c/am_i_being_manipulative.json": "So a while back, I noticed this cute girl in my class so I (F/26) was asking\nabout her to my friends in the same program. We had no common friends. I ended\nup finding her account through our program's student Instagram page where she\nwas featured that same week I was looking for her. Through that, I…",
  "data/reddit-ask/r/NoStupidQuestions/comments/o93r4r/do_animals_with_less_brainpower_make_mistakes_the.json": "Let’s use an ant as an example. If a worker ants job is to clean the eggs, is\nthere a chance they forget? Or perhaps pop an egg? Or are their brains so\nhardwired to their roles that they have no room for interpretation?\n\nOn the flip side, if you ask a human child what 2+2 is, they’ll probably say…",
  "data/reddit-ask/r/NoStupidQuestions/comments/o970a9/whats_the_point_of_keeping_up_to_date_and_aware.json": "From Amazon’s abhorrent treatment of its warehouse workers, to the giant trash\npile in the pacific, to cutting down rainforests for palm oil to make chocolate\nnice and smooth, to political corruption… you read the news and listen to the\npodcasts and it’s all so depressing. Then I try to talk to…",
  "data/reddit-ask/r/NoStupidQuestions/comments/o98x8i/are_there_any_websites_that_feature_recipes.json": "I know there are subreddits or social media pages but I'm looking for a\ndedicated website to use. I'm not following any special diets. Thank you\n\nEdit: I marked this as solved but feel free to leave suggestions.",
  "data/reddit-ask/r/NoStupidQuestions/comments/o99ao0/anybody_else_genuinely_prefer_rainovercast_over.json": "Don’t get me wrong, the sun is great and absolutely essential but.. does anybody\nelse get genuinely excited for rain? Or enjoy days with overcast (dark gray\nclouds above) more than those bright sunshine days?\n\nI feel like everybody always talks about how great the weather is and then you\nlook…",
  "data/reddit-ask/r/NoStupidQuestions/comments/o99kba/there_are_studies_shown_that_workers_who_stay.json": "This is something I've thought about a lot but have never understood. I just got\na few new job offers and the salary for most of them is almost double what I'm\nmaking now (and one of the offer the salary IS double).\n\nWe have a culture of switching jobs every 2-3 years but it makes sense from…",
  "data/reddit-ask/r/NoStupidQuestions/comments/o9yr2v/how_many_times_can_you_go_through_a_roundabout.json": "Hi im baked and i was wondering if it was illegal (i dont think it is!) and my\nfriend thought it would be illegal to go around and around over and over in a\nroundabout. can someone tell me if it is and if so how it is?",
  "data/reddit-ask/r/NoStupidQuestions/comments/oa231x/if_i_farted_into_someones_butthole_then_they.json": "ETA: ok ignore practicality. Assume we have a tube or something, whatever the\nmeans are, the fart has entered the butthole. Go from there",
  "data/reddit-ask/r/NoStupidQuestions/comments/oa8z8b/if_food_takes_hours_to_digest_why_do_i_have_to.json": "Sometimes it’s before I even finish my meal. For example I am currently drinking\na homemade mass gainer for breakfast. (Protein powder, oatmeal, banana, MCT oil,\nPeanut butter, almond milk, and water) I’m almost done with the shake when I\njust had to go to the bathroom. (#2)\n\nThis has been going on…",
  "data/reddit-ask/r/NoStupidQuestions/comments/oacwo1/is_it_rude_to_feed_someone_weed_laced_brownies.json": "Basically a while ago, my cousin told me an instance where he fed his parents a\nbit (obviously not an insane dosage, but still) of 'weed brownies' without their\nknowing. They aren't weed smokers at all, so it's not like your every day prank.\nEven though weed is harmless, would you consider this…",
  "data/reddit-ask/r/NoStupidQuestions/comments/oaf244/why_do_i_keep_hearing_pre_madana_all_the_time.json": "Did she use to do some other thing before she was famous or am I just dumb?\n\nEdit: I was just stupid",
  "data/reddit-ask/r/NoStupidQuestions/comments/oafj5q/is_there_a_name_for_a_kink_where_you_get_your.json": "Some of my best experiences in life have been when I was chillin with my dealer\nand we just talked and played games and shit, is there a name for wanting that\nin a sexual way?",
  "data/reddit-ask/r/NoStupidQuestions/comments/oagsve/why_do_british_people_tend_to_turn_statements.json": "For example, instead of saying \"that's a big dog\", a British person might say\n\"that's a big dog, isn't it?\"",
  "data/reddit-ask/r/NoStupidQuestions/comments/oakydp/do_you_guys_considered_the_term_you_guys_to_be.json": "I am curious because I saw something on Instagram where if you don't know\nsomeone's gender identity, then you should say \"you all\" instead of \"you guys\" I\ndon't know about you but my whole life me and plenty of other people I know use\nthe term you guys as a gender neutral way to refer to people. Is…",
  "data/reddit-ask/r/NoStupidQuestions/comments/oaoy4b/is_it_weird_if_your_parents_put_a_camera_in_your.json": "I'm not going to do anything because I hate confrontations and I'm honestly fine\nwith it being here, but it's apparently odd in \"regular\" households. It felt\nlike a massive breach of privacy at first, but I've grown used to it since it's\nbeen here for maybe half a year. My parents also barge into my…",
  "data/reddit-ask/r/NoStupidQuestions/comments/ob7zx9/how_do_i_stop_being_racist.json": "I was raised by a hardcore racist, “hardcore” as in would and probably still is\nharassing non white people on the daily assaulting them and being a all around\npos, now I don’t associate myself with them anymore.\n\nI’ve been working on myself for about 3 years now and it’s been going great I’m\nat a…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/npe84l/has_anyone_been_in_a_position_where_they_want_to.json": "Prob a weird (and confusing, honestly) question to ask, but for years I have\nbeen alone. I have many people come and go. Recently, I have done everything in\nmy power to not be alone just to be back in square one. I would read a whole lot\nof romances stories just to feel something I guess. I haven’t…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/nphila/does_anyone_else_know_a_lot_of_people_but_still.json": "Right, so I'm a 17 Y/o guy and I would say I know quite a lot of people, who I\ncan generally see anywhere and strike a conversation with, ranging from 1 minute\nto possibly even more than an hour in some cases.\n\nHowever, I may know a lot of people, but I still don't really and truly have any\nfriends…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/nptvvi/do_you_feel_that_hollywood_films_have_lost_the.json": "Since the last 10 years I am finding Hollywood films less and less memorable. I\ncant even remember or bother to know actors name. For example when spider man\nwas first released after watching the film I could remember who Toby MacGuire\nand Kirsten Dunst are. But current Spiderman I don't even know…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/npv2et/almost_30yrs_old_and_i_feel_like_im_still_waiting.json": "I’m turning 30 soon and I haven’t been in a relationship, I still live day to\nday, I don’t have a concrete career plan and I constantly feel like I’m waiting\nfor something that’s not going to happen. I know my concern seems shallow with\neverything that’s happening to the world right know but I don’t…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/npwj4l/am_i_the_only_one_who_thinks_it_is_too_much_of_a.json": "I am not discouraging people from being open about this condition, I just think\nits funny every teenager I run into with this syndrome online has the same edgy\nticks, always giving the finger, saying \"fuck you\" and their neck bending foward\nsooo if I'm just being an asshole about this condition let…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/nq2xrt/why_does_it_bother_people_so_much_that_i_prefer.json": "Recently the state I live in has lifted mask restrictions once again. I work out\nand about in the city driving around to different mechanic/body shops seeing\nindividual people. I’m fully vaxxed and most people that meet me with my mask on\nask if I’m vaccinated (fishing for why I’m still wearing it?)…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/nqidvx/do_anyone_else_get_annoyed_at_someone_who.json": "I feel kinda bad to feel like this...but we would be having a conversation about\nthis something, sometimes important and they would all of a sudden would be so\ninto a show (they would be flipping the channel) or their phone. They would just\nleave me hanging, if i try to get their attention, they…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/nqio9m/why_do_people_consider_jk_rowling_transphobic.json": "I just realized I'm not sure what she actually said to cause this cancellation\nof her, so I went to google to see the tweets. I found nothing transphobic in\nthem, or maybe I read the wrong articles?\n\nI'm not defending her, but neither am I condemning her for anything - I'm\nassuming I don't have the…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/nqka4y/why_dont_more_men_sit_when_they_pee.json": "So at first, this may seem preposterous, but by the end of the post I hope to\nchange some of your minds.\n\nIn my opinion, there are lots of advantages to sitting while you pee.\n\n 1. More discreet: I absolutely hate going into someones bathroom and unleashing\n    a stream of piss so loud that everyone…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/nqug8y/does_anyone_else_hate_when_people_call_them.json": "I won't even answer my cell phone anymore if I don't know who it is and say \"If\nit's important, they'll leave a message.\" I think mostly because texting allows\nme more time to articulate my thoughts and think about what I'm saying, as well\nas allowing both parties to focus on other tasks (not…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/nrjqxm/is_it_weird_that_im_irked_by_someone_bringing_up.json": "So I'm a bisexual woman currently in a cis relationship. I'm an out and proud bi\nwoman just to be clear, everyone of significance knows my sexuality. I've never\nreally felt it was a big part of my personality though I've been with women and\nI've been with men I just happens to be in a committed…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/nrmf3h/does_anyone_else_not_believe_in_religion_or.json": "I'm an atheist but I find learning about religions to be really cool and super\ninteresting. Also, occult magic and stuff like that is super interesting.\n\nI went to a magic shop today with some friends where they sold crystals to heal\nyou or give you luck and shit, they had tarot cards, books on…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/nrmlaa/how_do_people_see_thunderstorms_as_a_form_of.json": "Someone enlighten me!",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ns0c9e/why_does_modern_healthcare_focus_on_extending.json": "At my university I see publications about advances in the efficacy of\nchemotherapy or longevity of Alzheimer’s patients. But I see no news on\ntreatments to help people with diabetes or scoliosis to live more useful lives,\netc.\n\nAs people live longer and longer, this will strain our economy. Peoples…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ns44ru/should_onlyfans_models_have_to_pay_to_advertise.json": "Nsfw reddit I think has been ruined by Onlyfans, Snapchat sellers, cash app etc\netc. I've got no problem with women doing this if they want to, but, reddit as I\nsee it is an amateur user content platform for people who want to freely share\nideas, pictures, memes, art etc. and actually want to…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/nsj5v3/does_anyone_else_feel_like_they_lack_that.json": "I'm a few months away from starting university and the course I've chosen still\nfeels like something I only have a mild interest in (and that's being generous).\n\nThis isn't just exclusive with school work.\n\nI've realised that even when compared to other people who don't have concrete\ndreams or…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/nslehx/why_cant_we_keep_masks_on_as_a_normal_clothing.json": "There are so many potential (with newly designed masks) benefits of wearing a\nmask:\n\nProtection against diseases\n\nPrivacy against facial recognition by people/cameras\n\nCover up for any insecurities (acne, marks, etc.)\n\nLess likely to be discriminated based off of who you are\n\nWe will be attracted to…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/nsrexe/is_it_normal_to_think_every_now_and_then_that_it.json": "I just think that if I was never born, I would've never had to go through all\nthe craziness and hardships of life. I do realize that there nice things too but\nit just doesn't seem to balance out... Not even close to be honest.\nI mean... What's the point? Going through all this shit, never being…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/nstk03/why_name_a_condom_trojan.json": "Sorry if this sounds stupid but it really buggs me. Why would you name a condom\nbrand Trojan if the Trojan horse was a way to lure the Trojans during the Trojan\nwar to take the Greeks in only for them to attack when their enemies slept.\nDoesn't that pretty much contradict the whole meaning of…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/nsuw1h/why_do_people_claim_looks_and_money_dont_matter.json": "To be very clear, I don't think women owe men relationships or anything. But I\ncan't help feel that whenever I see men share their dating struggles and how\nlooks impact them, they instantly get bashed and shamed. \"Just be confident bro\"\n\" It's probably your personality\". How can people deny and…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/nsxya5/does_anyone_else_get_the_inescapable_feeling_that.json": "The past few weeks I've had this unshakable feeling of grief deep in my gut, and\nI feel like it's been grief for my self and for my own life. I didn't really get\nto have a childhood and especially didn't get to have a normal teenager\nexperience. My Dad died when I was 16 and I had to step up and be…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ntd4l2/does_anyone_else_feel_scared_and_overwhelmed_as.json": "If I just stop and think about the fact that I need to keep paying rent to stay\ninside and that I need to work on Monday to do that I start almost\nhyperventilating. I start worrying about losing my job and I start realizing how\nlong I need to do this for, another like 50-60 years of working to make…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ntqokq/you_ever_notice_that_the_people_who_acts_like.json": "I wonder why that is. What goes through their heads \"oh this guy did exactly\nwhat I did, let's get them banned\"",
  "data/reddit-ask/r/TooAfraidToAsk/comments/nue4o2/why_do_people_think_that_lollipops_are_only_for.json": "I am 17-year-old guy and whenever I am eating a lollipop everyone feels the need\nto tell me that I am almost an adult and lollipop are only for kids and I should\neat some adult snack.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/nuhsxp/does_anybody_else_have_a_slight_fear_of_a_snake.json": "I live in the uk and i know it’s very unlikely but i remember hearing a news\nstory about someone getting bit by a snake that came through their toilet and\neven though it doesn’t prevent me from doing anything i have a tendency to stuff\nmy toilet with toilet paper just in case and i want to know how…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/nv1slj/what_do_you_do_when_you_realize_you_are_the_toxic.json": "Recently I was given a wake up call. My fiancé (whom I am marrying at the end of\nthis year) told me that he’s having second thoughts about whether he feels like\nI will be a good partner forever. The words hit me like a freight train. I have\nbeen so blind to how shitty of a partner I’ve been. On…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/nvjot0/is_it_ok_to_just_feel_fucking_sad_all_of_the.json": "Sometimes, I just feel like this. I have a good life, good friends, etc. But\nsometimes I just feel sad for a few hours and I don’t know why sometimes. Like\nright now, I lost out on about 200 bucks so I am pretty pissed at myself for\nthat, but a lot of the times it just comes for no reason and I…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/nvoskj/am_i_bad_for_being_slightly_sad_that_lockdown.json": "Lockdown sucked but at least I didn't feel like I was the only one trapped at\nhome alone all the time anymore. It feels like lockdowns lifts now but for me\npersonally it just continues except I can go to shops now too...",
  "data/reddit-ask/r/TooAfraidToAsk/comments/nw2ev1/am_i_in_the_minority_for_disliking_cars_and.json": "So in my mind, I am thinking that if you're in a city, there's no need for your\nown personal vehicle, that's kind of the point isn't it? Density means you can\naccomplish everything on foot/bike/public transit or maybe rideshare. When you\nadd cars, it takes away from your ability to do that because…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/nwnf5q/does_anyone_else_get_mildly_depressed_when_you.json": "Like that feeling when you finish watching someone's video and go check out\ntheir channel but the last video uploaded was 1 year ago. It's mild when the\nchannel is quite well known but any small channel just hits me with sadness. It\nfeels melancholy, like when you're done reading a story. It just…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/nwyyr6/as_a_white_person_living_in_the_us_i_want_someone.json": "*should have learned about it a long time ago in school",
  "data/reddit-ask/r/TooAfraidToAsk/comments/nxa7pr/why_do_americans_always_go_on_about_freedom_like.json": "Its seems like whenever America is being compared to another country Americans\nalways like to use their freedom as a advantage, usually over China. But I dont\nunderstand what is so free about American that we dont have here in the Uk/Eu.\nIf anything I feel like not being forced into capitalism for…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/nxl479/why_are_conservatives_so_upset_over_critical_race.json": "It's been around for over 40 years? Why all of a sudden are they so upset about\nit?\n\n> Critical race theory is an academic concept that is more than 40 years old.\n> The core idea is that racism is a social construct, and that it is not merely\n> the product of individual bias or prejudice, but also…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/nxlt49/why_is_it_that_the_phrase_you_get_what_you_pay.json": "Like how can you expect maximum effort from someone while extremely underpaying\nthem? What makes our work inherently less value than what we provide?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/nxt5lc/where_are_all_the_adult_jungle_gymsplaygrounds.json": "Seriously!! We have them for our kids at parks and schools but if I play on one,\nI’m the weird guy. If more adults had a fun place to go play and hang out like\nwe did in recess in elementary school, America would probably be less obese as a\nnation.\n\nYeah, you can say we have gyms, but it’s not the…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/nymii2/i_wanted_to_kill_myself_at_18_but_i_only_kept.json": "I very much feel stuck and depressed, even more so now in my early 20s than at\n18.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/nyohsc/what_happened_with_the_nursing_profession_when_i.json": "Some of the dumbest anti-vaxxing idiots I know are nurses. And more\nstatistically, they are known to be \"vaccine hesitant\" per recent studies. Sooo,\ndon't they have to know anatomy / biology and have a degree and shit?\n\nHas it always been like this and I just never noticed, or is it getting…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/nz96dv/im_19_but.json": "I found myself wanting to go buy a doll house and play with toys again I was\nhaving a break down from my bpd and I asked myself what would make me feel\nbetter and my brain answers with toys and a doll house, has anyone ever picked\nit up again secretly and felt werid",
  "data/reddit-ask/r/TooAfraidToAsk/comments/nzpbxc/16_year_old_dating_a_24_year_old.json": "I am 19 (F) and my younger sister is 16 and her boyfriend is 24. She hasn’t told\nmy mom or dad, and none of her friends or his friends know about it. They do\neverything bf and gf do and they’ve had sex. She told me and I voiced my\nconcerns about it because obviously I don’t approve. And I don’t know…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/nzrld0/anyone_else_grow_up_not_with_role_models_but_with.json": "Sorry if it sounds confusing. Basically, I don't remember ever having a role\nmodel to look up to or to mentor me. I grew up with people I absolutely don't\nwant to be like. They set bad examples and I try to do what's necessary to not\nbecome like them. Anyone else have similar stories? How did you…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/o0sw1w/why_dont_we_reopen_most_things_and_just_let.json": "I’m curious why we don’t just reopen and let the people who don’t want to get\nvaccinated get sick? I do understand that maybe we are still at the point that\npeople who want to get vaccinated don’t have the ability still. Though we must\nbe getting close?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/o0ya4i/can_anyone_tell_me_what_im_supposed_to_do_with_my.json": "It's my cake day today. I know it means I've been here for two years now (it's\nmy second one), but I don't know if I have to do something in particular. I've\nseen people taking it seriously, but idk if it's just cause it shows they've\nbeen on Reddit for at least a year, or if there's something else…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/o15puc/how_do_i_tell_my_friends_that_am_dieing.json": ".... I've been diagnosed with a terminal illness last year (around march i\nguess) ..only my parents and few family members know about this.... I would die\nin a year or sooner (according to my recent medical reports)\n\nNone of my friends know about this... And these are the guys i went college\nwith.…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/o1a7xr/what_do_orchestra_conductors_actually_do_to_help.json": "All of the musicians seem so heavily trained, and they all seem to look at their\nsheet music through the whole thing… so if the conductor was gone, would there\nreally be much of a difference?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/o1kar4/is_it_normal_to_feel_sexual_attraction_but_not.json": "I don't feel the need to have sex with anyone, but I don't think I'm asexual\neither.\n\nFrom what I understand, asexual people don't feel sexual attraction, but I do. I\nfind some people hot and I can have sexual fantasies about them. But the thing\nis, I don't want to have sex with them in real life.…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/o1unkp/are_big_nipples_unattractive_and_why_do_mine_keep.json": "Every single month when I get my period my areolas grow and they’re so big ive\ngenuinely never seen anyone else with this big of areolas unless they have\nextremely large breasts. Mine are more like small to medium so the boob to\nnipple ratio is way off. This has been an ongoing cycle. I’d say they…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/o285vz/am_i_the_only_one_who_cant_take_themselves.json": "Any time I try to initiate or do something for my partner I just feel so awkward\nand like I should be getting laughed at for it.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/o2bp0k/does_anyone_else_with_a_good_life_ever_just_feel.json": "By many standards, I have a good life. I live in a first world country. I have a\njob that pays pretty well in an in demand field I enjoy and I will easily make\nvery good money within my lifetime if I keep on the path im on. I have a\ngirlfriend of 7 years who I love dearly and is my best friend. I…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/o2q55n/is_it_normal_to_not_to_cry_in_a_sad_real_life.json": "It’s so weird. For example: If my gf is crying because something bad happened, I\nfeel sad but I don’t feel the need to cry. If I listen to music and hear an old\nsong of a Disney movie like Tarzan I could cry like a freaking baby. Or if I\nwatch a sad scene in a show or read it in a book/comic it’s…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/o2u9q0/why_is_everyone_so_accepting_of_being_spied_on_by.json": "It seems so odd to me, people just accept it. In the states,l 25th we have the\n4th amendment that SHOULD prevent government from doing this. You can't fully\nturn off yourm phone since manufacturers have mad it impossible to easily remove\nthe battery, and Apqple just released recently that the \"Find…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/o3aiux/does_anyone_else_not_want_to_have_children_to.json": "I am hoping that wording makes sense.\n\nThere are a few reasons I don’t want to have kids but the overarching one is\nthat life is tough. I don’t feel like I should bring a new soul in the world to\ndeal with all of the bullshit that previous generations have left behind.\n\nI understand the negativity…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/o3ok8m/who_else_deeply_loves_their_partner_but_would.json": "Been living with my girl friend for 3 years now. We both love each other tons\nand still get jiggy with it. I’m finding that we both get much better sleep when\nwe don’t sleep in the same room. Any couples out there that don’t share a bed\nthat can share their experience. Did it hurt or strengthen your…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/o3wh5w/anyone_else_just_not_care_about_covid_anymore.json": "Hope I don’t get downvoted to all hell, but has anyone just... not cared about\nanything covid related? Like I genuinely don’t care about the delta variant,\nmaybe because this is like the 4th variant (“the deadliest one yet”, even though\nthat was said about the Brazilian variant)\n\nI don’t care about…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/o45ror/does_anyone_else_find_mass_shooting_more.json": "Obviously I'm American, most democratic countries at least pretend murder is\nbad. It's not that I don't care, it's that I'm aware nothing will be done about\nit in the foreseeable future, so every mass shooting is just \"oh, the deaths\naren't even double digits, that's not that bad. What should I have…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/o4f5ya/why_do_anorexicbulimic_people_get_so_much.json": "For context, I used to be obese during my childhood and teens, and people\nconstantly bullied me for being fat. Now that I'm an adult I'm anorexic and can\nbarely eat without having anxiety attacks, I am depressed and alone. The\ndifference is people try to help me now.\n\nIs there a biological reason we…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/o4u2y4/are_there_people_who_are_just_destined_to_be.json": "A friend of mine seems like he is detached most of the time. He does not enjoy\nconversations usually. Does not have many friends, and no close friends. Can't\ntalk about things most of the time. Is described as weird at times. Used to be\nvery funny, but now he is a shut in.\n\nHe is a good person, just…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/o5k0p0/have_we_swung_too_far_the_other_way_with_the.json": "Asking as my wife who had a legitimate complaint was afraid to complain because\nshe didn't want to be seen as a Karen.\n\nDoes the \"Karen wants to see the manager\" thing negatively affect socially\nanxious folks who have reason to actually see a manager or lodge a complaint? We\ncan't pretend there…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/o5mkdr/if_bread_is_jesus_body_and_wine_is_jesus_blood.json": "I know this is a silly question, but I’m curious. And nothing against\nChristians. I’m just curious.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/o61odx/does_anyone_else_type_reddit_at_the_end_of_a.json": "Has \"word count\" in our education done this to our society?\n\nWhether it's reviews on a specific product or a general question, I always drop\n\"reddit\" after my google search. Articles these days just be like *ADS*\"DO YOU\nACCEPT COOKIES FROM THIS WEBSITE?\"*ADS\\Article *blahblahblahblah never gets…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/o6l4bd/my_understanding_is_that_you_have_no_control_in.json": "im thinking that maybe this situation could be analogous to the thinking that is\n\"thoughts dont make a bad person, actions do\", and it does fit well i guess.\nthoughts are neutral and dont impact the world. Now the actions described doesnt\nimpact the world either, but maybe its still not morally ok.…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/o6m6bn/do_people_really_think_porn_with_girls_getting.json": "I feel it looks so painful and there is no way the girl is enjoying it. They\nusually have tiny actresses in it too. To make things worse they usually have\nmultiple male actors involved the whole production just looks brutal.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/o6obcf/imagine_person_is_graduating_from_yale_law_school.json": "If possible include stats",
  "data/reddit-ask/r/TooAfraidToAsk/comments/o6q9o0/did_anyone_else_like_wearing_a_mask_because_it.json": "Idk, I personally think I look way better with a mask on then off cause I have a\nstupid smile and I think my eyes look good.\n\nSad that I’m taking one off now cause I look way worse and I’m afraid people\nwill think I’m ugly now 😂😅",
  "data/reddit-ask/r/TooAfraidToAsk/comments/o6tzd0/does_anyone_else_look_into_the_beautiful_night.json": "Because why am I always thinking about dying more than living. Maybe It’s\nbecause I am over all of this and want the next thing in life. It’s my birthday\ntoday and I just want to do the opposite of live.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/o6xnqo/does_anyone_else_eat_primarily_just_to_survive.json": "So when I eat at a restaurant on a rare occasion, I always enjoy my meal. But\nwhen it comes to eating at home, it's the opposite.\n\nLet me explain. It's not that I'm a terrible cook. I can make a half decent meal\nthat I'd somewhat enjoy. The problem is it takes too damn long. Going to the\nstore,…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/o6zkzw/how_should_i_celebrate_me_being_7_months_clean.json": "I'm officially 7 months clean of sh today but I wanna know how should I\ncelebrate this amazing day?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/o72dtv/is_it_bad_that_i_fantasize_about_my_boyfriends.json": "Me and my boyfriend have been talking to each other about threesomes and we’re\nboth pretty open to the idea just not comfortable acting on it just yet. He\nfantasizes about letting another guy use me while he watches and tells me what\nto do. Honestly when he first told me this I was a bit confused…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/o7bp89/as_a_man_is_it_okay_to_want_to_be_the_sub_in_the.json": "In all of my previous relationships I've had to be the dominant one but deep\ndown I actually really prefer to be the submissive. However I feel extremely\nuncomfortable opening up about it to any partners because I'm scared of how it\nwill be perceived for a guy to admit he likes being the sub in the…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/o7hl9s/why_is_slavery_in_america_talked_about_so_much.json": "I'm bringing up Britain because my family originated from a country that they\ncolonized. My family's life under the british was hell-- violence, famine,\ngenocide. Many were shipped off to Carribean islands and other places to work as\nindentured servants. etc. This was within Queen Elizabeth's…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/o7kd31/can_you_guys_answer_my_questions_about_america.json": "Hi all. I'm too afraid to ask at this point, but this seems a safe space:\n\n 1. What the hell is prom? I don't understand the rituals involved.\n 2. Why do so many people join the military? It seems not fun.\n 3. Why do people move super far away from their family? I keep seeing things\n    like: drove…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/o7mbho/being_a_man_complimenting_women_how_can_i_make.json": "I have a lot of female friends and I often see pictures they post on Facebook\nand whatnot and I want to compliment them on how beautiful they look in their\npictures. As a man I worry that I'll come off as creepy when I really just want\nto compliment them so they can feel good about themselves. How…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/o7mhr1/people_who_say_paris_is_the_most_beautiful_city.json": "Just wondering .. because I see / hear this a lot. If you’ve actually been\nthere, please tell me what you enjoyed that much because we obviously haven’t\nbeen to the same place 🤔",
  "data/reddit-ask/r/TooAfraidToAsk/comments/o83rw5/does_anyone_feel_like_reddit_just_fucking_sucks.json": "Like it’s been a slow degrade, but between the horrendous video player and\nliterally every post on my feed being followed by one or two ads and then one or\ntwo “recommended because you looked at a similar subreddit”, usually for\nsubreddits that I’m not interested in at all. I fucking hate it.\n\nEdit:…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/o849jj/why_dont_incels_just_hire_an_escort.json": "I really don't understand, if not being able to have sex is causing your THAT\nmuch distress, if it's making you THAT happy. Why not just get an escort? It's\nlike complaining that you must involuntarily cook every meal. You can literally\npay for someone to cook and serve your meal if it's that…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/o88wzq/why_is_everyone_in_america_so_opinionated_on.json": "As a non American I have seen so many Americans being highly opinionated about\nissues such as pineapple on pizza to all the way about pro life/choice and anti\nvaxxers etc. Don't get me wrong, having opinions is completely OK and a human\ntendency. Every country and its citizens have opinions of their…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/o8iedn/is_this_a_fetishbdsm_related.json": "I don't know why but I get so turned on from the idea of me being forced into\ndoing sexual shit with someone or else I get \"punished\". I think it's a bdsm\nthing but since consent is their biggest thing I don't really know. Is it\nhealthy to feel this way? To want to be forced to doing certain things?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/o8j7u9/does_anyone_else_love_when_theres_a_typo_in_a_book.json": "I just get a kick out of it, makes me smile and remember that no one is\ninfallible, however many dozens of people read and proofread that book, sent it\nto the printers, made thousands or millions of copies with a misspelled word or\nsome forgotten punctuation. does it make anyone else laugh, or does…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/o8jp8d/why_does_no_one_seem_to_care_that_the_us_prison.json": "Basically the title, the us constitution directly states that people cannot be\nforced to do free labour..... Unless theyre imprisoned and incarceration rates\nhave reflected this since then. theres a direct incentive for incarceration\nrates to remain high aslong as that statement is in the…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/o8um4z/do_women_really_not_enjoy_working_for_female.json": "A girl I'm seeing recently got a new job and mentioned how she's glad her boss\nis a man. I asked what she meant and she basically said a lot of older career\nwomen who become bosses see younger women in the workforce as competition for\nher power/social prestige and get jealous of them, so they engage…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/o9fk56/can_anyone_else_not_piss_or_shit_if_they_feel.json": "For example, when I’m in a public bathroom and there is people walking in and\nout, I feel uncomfortable and I just can’t fucking piss, I mean, my ducks out\nwith this tiny ass divider with all these dudes knowing what I’m doing right\nbehind me, and they see me standing there for ages without pissing.…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/o9hr06/is_the_downvote_button_a_youre_being_a_dick.json": "I only downvote people who are being a total dick, not for disagreeing with me,\nI always just thought a downvote was for somebody being an ass but sometimes I\nget downvoted for saying something like \"I personally didn't like this\nvideogame\" and I'm like oh okay, is it an \"I disagree\" button?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/o9hx4z/am_i_the_only_one_who_never_remembers_artist.json": "Unless I actively listen to that specific artist very frequently I almost never\nremember artist names and album names, even if I've heard them before. And I\nlisten ot Music 4-12 hours a day (only if I'm gaming or activity).\n\nEverybody's always like \"Oh you heard Lil Shitball9000's new song?\" I'll be…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/o9m3mq/is_it_normal_for_a_man_to_get_slightly_physical.json": "I (female) have been in a relationship for six years now. My one and only\nrelationship so nothing for me to compare to. (I’m in my mid twenties.) We got\nengaged earlier this year. Everything’s great between us except that\noccasionally when we fight he loses his temper and tries to manhandle…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/o9vvc2/am_i_the_only_one_that_thinks_power_mods_on.json": "\"Power mods\" such as AwkwardTheTurtle are moderators of thousands of subreddits\nand abuse their power every day to ban people that they disagree with.\nAwkwardTheTurtle is a mod of over 2500 subreddits, many of which happen to be\nextremely popular.\n\nDisclaimer: I've just been banned in…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/o9wzi6/whats_the_point_of_having_a_mansion.json": "Almost every single rich person I have seen 9 times out of 10 buys these\nhumungous mansions, my question is why?\n\nI'm not exactly Mr. Moneybags and have never even lived in anything CLOSE to a\nmansion so a lot of this is speculation, but from looking at it from the outside\nhaving a mansion seems…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/oa36sf/isnt_anyone_else_worried_about_how_much_waste.json": "We use plastic bags for everything, even when we don't need it and only once.\n\nWe buy technology like phones and televisions and consoles that become obsolute\nwithin a decade and toss it out for the newer models.\n\nWe toss out tons of food daily and lock the dumpsters.\n\nOffices shred documents after…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/oaasnq/would_you_really_be_upset_if_you_caught_your.json": "I was reading r/loveafterporn [/r/loveafterporn] where women share their stories\nabout partners who secretly watch porn and it baffled me about how heartbreaking\nmost of the stories are. Finding out about possible porn addiction caused huge\ndistress to the level of anxiety and depression. Most…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/oadc7m/if_we_hate_arguing_and_how_divided_america_is.json": "Also why not just have like an internet shut off day/week either annually or\nmonthly?\n\nThis is not to start an argument, idc which channel you hate, both are bad like\nit or not.\n\nEdit:\n\n\nDO NOT ARGUE, AND NO BIASED ANSWERS PLEASE",
  "data/reddit-ask/r/TooAfraidToAsk/comments/oao58w/why_is_lesbian_twin_porn_generally_seen_as_okay.json": "Title. It's pretty glorified, and most people don't find it wrong, but if it was\na real non-same-sex twin or family, they would find it gross.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/oapgte/is_it_considered_weird_to_masturbate_in_the.json": "For context you can take a look at my profile and read my post from earlier\ntoday lmao. A lot of commenters said that it was not normal to masturbate in a\ncommon area of the house even if I’m home by myself and I was honestly surprised\nlolol\n\nAnyways, sometimes if I’m home alone, I masturbate in the…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/oaqsq4/why_do_we_get_annoyed_at_customers_for_bad.json": "I seriously don’t know the answer to this question. Help.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/oay14h/anyone_write_out_long_responses_only_to_delete.json": "There's been quite a handful of times where people have looked up my reddit\nhistory only to use it against me in completely unrelated matters down the line.\n(sometimes even outside of reddit)\n\nI really do enjoy writing and giving my opinions even if they are just an\nopinion and not worth much. Gives…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ob1g15/as_an_american_what_is_something_really_patriotic.json": "Disclaimer: I can't stop anyone from posting, but I would really rather have\npositive comments. I am not looking for anyone to tell me to hate America, or\nburn a flag, or anything negative. I'm in a good mood and I want to help people.\nPlease don't put me in a bad mood. Thank you! :)",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ob1n5d/why_does_my_voice_get_higher_when_im_talking_to.json": "So I'm a woman with a somewhat deep voice, (I usually sound tired). But I've\nnoticed that when I talk to guys, especially ones I'm interested in on a\nromantic level, I speak in a higher tone and I'm not sure why.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ob6jmq/does_anyone_else_feel_like_they_dont_want_sex_but.json": "Am I the only one?\n\nEdit: I'm sorry if this is a popular opinion, I just never hear about it.",
  "data/reddit-ask/r/TrueAskReddit/comments/nphwqp/why_is_it_that_people_let_go_of_their_dreams_and.json": "I'm only twenty, but I think about this a lot. Shouldn't pursuing your dreams be\nwhat makes you happy? Having 2.1 kids, a suburban home, and the usual 9-5, it\nall seems a bit crushing to me. This set-up doesn't work for many people, yet\nit's still seen as the default. Can someone who's older explain…",
  "data/reddit-ask/r/TrueAskReddit/comments/nr9gco/why_are_people_as_a_whole_so_unforgiving_of_first.json": "I've noticed people, as a general rule, have difficulty letting go of their\nfirst impression of someone (me included sometimes). First impressions are\nrarely accurate in my experience given people take time to warm to you, are\ninitially nervous or have difficulty starting a social situation. So why…",
  "data/reddit-ask/r/TrueAskReddit/comments/nu6yrp/is_companies_stealing_our_data_really_that_bad.json": "I used to think personalised ads were a bit icky and invasive. And I guess they\nare as they're keeping records of your habits. But after a while I got used to\nthem and started to think do I really care? If the worst they are going to do is\nadvertise things I like, I can live with that. To be honest…",
  "data/reddit-ask/r/TrueAskReddit/comments/nzw8k6/why_is_male_bisexuality_doubted_more_than_female.json": "Bisexuality is ironically stigmatized not just amongst some straight people but\nin LGBT circles. It's common for people to believe \"bi woman are really just\nstraight and bi men are just gay\".\n\nBut when it comes to males and being attracted to both genders, many people\ndoubt it. I recently thought…",
  "data/reddit-ask/r/TrueAskReddit/comments/o3fyro/what_is_going_on_in_the_minds_of_those_lying_to.json": "These four guys\n[https://www.bbc.com/news/uk-england-hereford-worcester-57501164] tried to make\nit look like hospitals were empty of patients showing there was no pandemic. Why\nwould they do that?\n\nI can understand those that believe in a hoax. Humans have a problem with that\nsort of thing. But…",
  "data/reddit-ask/r/TrueAskReddit/comments/o4fsfo/why_are_usamerican_sandwichesburgers_so.json": "At least in cooking shows they are usually made to (seemingly) 1,5-2 times the\nsize of a regular humas mouth, and eating them reminds me of watching a snake\nunhinge their jaws to feed.\n\nExample 1 [https://youtu.be/lMAVnI-2MIA] Example 2\n[https://youtu.be/3f0vm1k2SmI]",
  "data/reddit-ask/r/TrueAskReddit/comments/o4xs8x/have_any_of_you_successfully_come_back_from_being.json": "I should start by saying I can function ok on a day to day basis in society, I\ndon't live in a cave or never interact with people positively, but I just kind\nof have a growing, bitter disappointment with humans generally (myself\nincluded). Everywhere I turn it seems like I just see weakness,…",
  "data/reddit-ask/r/TrueAskReddit/comments/o5bsed/how_are_you_supposed_to_interview_for_another_job.json": "Most Interviews seemingly take place during normal work hours, so what do you do\nif you're already working during normal work hours?",
  "data/reddit-ask/r/TrueAskReddit/comments/o6bxtn/racism_towards_african_americans_how_i_can_better.json": "I would like to apologize in advance if I am not using the correct terms or if I\nsound insensitive. While I understand ignorance and naivety should not be an\nexcuse, I am a Southeast Asian where American politics and relating factors are\nnot often talked about in-depth, or are those situations…",
  "data/reddit-ask/r/TrueAskReddit/comments/o7axf0/what_do_you_think_children_of_today_will_change.json": "After every generation, there is usually a cultural shift in attitudes towards\nraising children. Corporal punishment, for example, used to be the norm, and\nmost parents practiced it without any hesitation. Over time, corporal punishment\nhas become more and more taboo due to future generations…",
  "data/reddit-ask/r/askphilosophy/comments/nssovk/i_need_book_recommendations_to_practice_critical.json": "I have a good idea about what fallacies exist on a theoretical level. But since\nthe list of fallacies is pretty long, i find it hard to analyse ot arguments\nright away and look for fallacies in them.\n\nAre there any books/textbook that would have exercises (like In a maths text\nbook) which require…",
  "data/reddit-ask/r/askphilosophy/comments/nu74bw/ethics_is_it_okay_to_enjoy_the_rain.json": "Dumb question but here it goes.\n\nIs it ethically ‘okay’ to enjoy the rain brought by a typhoon/hurricane, when\nthat weather disturbance is wreaking havoc on the lives of marginalized people?\n\nI am from a country that is frequently visited by typhoons, and being an\nintrovert I find rains comforting.…",
  "data/reddit-ask/r/askphilosophy/comments/nuktag/child_beauty_pageants.json": "Hi! We are 3rd years/Grade 8's from England and are working on an ethics\nproject, we have decided to centre it around Child Beauty Pageants and whether\nthey are morally justifiable. We are looking for a Philosophical perspective of\nthem for one of our exam marks, we were wondering what some…",
  "data/reddit-ask/r/askphilosophy/comments/nvnqib/whats_a_day_in_the_life_of_a_philosophy_professor.json": "I'm in high school and considering this career path; I would appreciate having\nthe title answered as well as satisfaction, salary, job opportunity, and\nanything else you find worth mentioning.",
  "data/reddit-ask/r/askphilosophy/comments/nwhto2/can_philosophy_offer_some_comfort.json": "I'm not a philosopher, nor trained in philosophy, nor smart enough to understand\nmost of it, but after years of armchair reading, all I ended up with is moral\nand metaphysical uncertainty, lost between schools of thought offering arguments\nwith what seems to be equal logical strength (or almost…",
  "data/reddit-ask/r/askphilosophy/comments/nwqiup/south_asian_philosophy.json": "Hi everyone. I am a South Asian student studying philosophy at school in the US.\nI love it but so much of what we read is obviously western philosophy. I was\nwondering whether anyone knew any books I could check out or any writers I could\ncheck out to get started. Obviously, there are things like…",
  "data/reddit-ask/r/askphilosophy/comments/nz0yey/do_forces_actually_exist.json": "I was practicing some physics problems using Lagrangian mechanics instead of\nNewtonian mechanics, and although I noticed that forces aren't really\nconsidered, I started thinking about whether forces actually exist or whether if\nit was a convenient construct that physicists use to explain how objects…",
  "data/reddit-ask/r/askphilosophy/comments/nzfzbs/reincarnation_doesnt_make_sense_to_me.json": "If I die and my \"soul\" is supposedly reborn as another person or thing, but that\nnext incarnation has none of my memories or physical characteristics, in what\nsense is that person related to me?\n\nIf the other incarnations have a completely different body and mind, what other\npart of me could be in…",
  "data/reddit-ask/r/askphilosophy/comments/nzz41t/is_necrophilia_immoral.json": "My instinct would be to say it is immoral, but I am no moral philosopher, and I\ndon't know if I could justify that position. I would say that it is\ndisrespectful to the dead person, but how can you be disrespectful to something\nthat is not conscious, and also, is it even immoral to be…",
  "data/reddit-ask/r/askphilosophy/comments/o0cvm9/has_any_philosopher_ever_questioned_cogito_ergo.json": "Maybe this is a bit far fetched, I was just curious if any philosophical ideas\nhave ever been developed to question even this basic truth of Descartes?\n\nAlso, as evidence for his hypothesis that you might be deceived, Descartes used\nthe prof that our senses are imperfect and therefore can be fooled.…",
  "data/reddit-ask/r/askphilosophy/comments/o1bt7n/is_it_possible_to_understand_hegel_without_having.json": "I'm just an engineer but I fell in with a bad sort (philosophers) and they\nintroduced me to lots of different philosophical things. Hegel is something they\ntalk about but they do it much in the same way I would talk about antenna design\nor high-level physics i.e. something only capable of being…",
  "data/reddit-ask/r/askphilosophy/comments/o25763/do_there_exist_novels_or_other_fiction_works.json": "I think it would be very cool to see a story so detached from natural language,\nbeing driven forward from the premise and the properties of how people and\nobjects interact without the focus on aesthetics and prose. Not sure if it'd be\nenjoyable, but the idea seems intriguing and I think I'd be about…",
  "data/reddit-ask/r/askphilosophy/comments/o2mshm/female_philosophers.json": "Over the past year I have gotten into philosophy, reading Nietzsche, the Stoics\n& almost all of Camus' works but am yet to read any work by a female\nphilosopher.\n\nWho are some good female philosophers worth reading for an individual relatively\nnew to philosophy like myself or good female…",
  "data/reddit-ask/r/askphilosophy/comments/o3ilnn/struggling_to_read_foucault_am_i_too_dumb_to_read.json": "I started Madness and Civilization about two weeks ago. I’m taking it slowly,\nbut I find that at the end of a chapter I need to look up the cliff notes to get\na better idea of what the overall point is.\n\nAt times I can follow the book pretty easily, but at other points, particularly\nwhen Foucault…",
  "data/reddit-ask/r/askphilosophy/comments/o42x4y/how_can_one_morally_justify_spending_money_on.json": "Everytime I feel the urge to munch down on a burger or gorge on nachos after an\narduous day, I cant help but feel that 5-10 dollars of pleasure could have gone\nto support an animal liberation group or a charity that objectively need the\nmoney more than I do my need for taste.\n\nWhat is this feeling…",
  "data/reddit-ask/r/askphilosophy/comments/o59km7/is_there_a_name_for_this_experience.json": "I don’t know where else to ask so bear with me please.\n\nWhen I was really young, I used to intentionally put myself into this mental\nstate.\n\nI used to start looking around the room and ask “what is this?” And if I did it\nrepeatedly, the object would look absurd, meaningless, and eerie. If I could…",
  "data/reddit-ask/r/askphilosophy/comments/o5mmi6/whats_your_general_reading_strategy_in_the.json": "Hi all, a bit of a meta discussion here.\n\nI've always been one of those people who has insisted that if you didn't read\nsomething carefully, you didn't read it at all. In my academic life, I've prided\nmyself on being someone who maybe hasn't read as much as some of my colleagues\nhave claimed to, but…",
  "data/reddit-ask/r/askphilosophy/comments/o6qq0m/what_philosophy_books_for_friend_who_locked_up.json": "Hey /r/askphilosophy, i come to you in a time of need.\n\nI have a good friend who is locked up for 3 years, and i am about to provide him\nwith some fun and interesting reading material. Problem is - his reading\ncomprehension skills are NOT above average, he was never really the one to read\nbooks…",
  "data/reddit-ask/r/askphilosophy/comments/o6u0za/i_didnt_ask_to_be_born_what_is_the_philosophical.json": "A close friend of mine, whom I have known for several years, just had a breakup\nwith his girlfriend. He is in depression for some days now, and just yesterday\nhe hit me up with a question - \"I didn't ask to be born. I just randomly spawned\ninto existence. Give me a good reason why I should build a…",
  "data/reddit-ask/r/askphilosophy/comments/o877wx/how_do_you_justify_private_ownership_of_land.json": "I understand the concept of private ownership when it comes to artifacts like a\nhouse, a bicycle etc. Someone has put in the work to gather the materials and\ncreate the artifact, so naturally they have a claim to ownership of that\nartifact. The creator is the owner and if they so choose they can…",
  "data/reddit-ask/r/askphilosophy/comments/oa4yvv/are_there_other_universitylevel_courses_like.json": "I want links to university-level courses on YouTube like these:\n\n- Death [https://youtube.com/playlist?list=PLEA18FAF1AD9047B0] by Shelly kagan\n\n- Justice [https://youtube.com/playlist?list=PL30C13C91CFFEFEA6] by Sandel",
  "data/reddit-ask/r/askscience/comments/npepgw/whats_outside_the_universe.json": "So firstly im just some dumb 17 y.o with a question, and the question is... So\nspace between all the objects in space is a vacuum of nothingness or spacetime\nor whatever but what is beyond that, that the universe is expanding into. Is\nthere no space no time laws of physics???",
  "data/reddit-ask/r/askscience/comments/npwh7z/a_2_year_old_toddler_learns_about_6000_words_and.json": "Assume there's two 2 year old kids, 'A' and 'B'. A lived their entire childhood\nwith only their parents. And B lived their entire childhood with a joint family\nwhich includes their parents, grandparents and their uncle aunts. Will their\nword learning rate at the age of 2 will be different and how…",
  "data/reddit-ask/r/askscience/comments/nqvz98/what_exactly_is_missing_for_the_covid19_vaccines.json": "I trust the results that show that the vaccinea are safe and effective. I was\ntalking to someone who is not an anti Vax, but didn't want to take any covid\nvaccine because he said it was rushed. I explained him that it did follow a\nthorough blind test, and did not skip any important step. And I also…",
  "data/reddit-ask/r/askscience/comments/nsqumo/is_there_an_orbital_distance_that_would_allow_an.json": "My understanding is that for an object to be in orbit it must travel faster the\ncloser it is to the surface.\n\nPerhaps the Earth's rotations is too slow for something to travel the same speed\nand remain in orbit.\n\nBut I was curious to know if there was a point in Earth's orbit where you could\nplant a…",
  "data/reddit-ask/r/askscience/comments/nvzdow/why_doesnt_the_strong_nuclear_force_have_an.json": "So the Strong Nuclear force is like the Weak force with a short range,\n\nThe range of the strong force is about 1x10^-15 meters, (so quite a short range)\n\nThe weak force has a low range as it's communicated by massive particles, that\nare so massive they can't actually be created so they have to…",
  "data/reddit-ask/r/askscience/comments/nw9z9h/what_affects_the_lifespan_of_memory_t_and_b_cells.json": "I got curious and have been trying to find the information but I just couldn't\nfind it. I know that memory lymphocytes formed after infections. But I didn't\nknow why some live long while some are not and what makes them like that.…",
  "data/reddit-ask/r/askscience/comments/nwl3ck/why_does_the_moderna_vaccine_include_two_100.json": "Considering the overall efficacy rate is comparable.",
  "data/reddit-ask/r/askscience/comments/nxakev/do_other_vaccines_that_are_widely_used_also_have.json": "I tried googling this but I could only find stuff about covid vaccines (no\nsurprise I guess). So that got me wondering what other vaccines that are widely\nused (like stuff against the flu or polio etc) also have a 1 in a million chance\nof creating blood clots?",
  "data/reddit-ask/r/askscience/comments/nxfyrs/does_anyone_know_what_octyal_hydroxide_stearate_is.json": "I tried to google it but nothing with that name comes up. Instead results show\nOctyl Stearate which is completely different. If anyone knows it I would like to\nknow what it is and its uses in cosmetic chemistry and if it has other names.",
  "data/reddit-ask/r/askscience/comments/nxr1z0/how_does_host_selection_work_for_different.json": "There are thousands of species of parasitic wasps, and they have a diverse range\nof hosts for which they lay their eggs in, such as caterpillars, spiders,\naphids, etc. However, could, for instance, a tarantula hawk wasp be able to lay\neggs in a caterpillar, and just prefers targeting spiders, or can…",
  "data/reddit-ask/r/askscience/comments/ny2rl4/how_strong_is_the_evidence_for_alternative.json": "Meteorite strike: I get it. Big bump, irridium, dinos dead. But recently I ran\ninto a geologist who is pointed out that there are other, bigger, craters that\nare not associated with mass extinctions, and who is convinced there story\nbehind the K-Pg mass extinction event is more complicated.\nI'm not…",
  "data/reddit-ask/r/askscience/comments/ny6l7p/how_far_does_the_radius_of_suns_gravity_extend.json": "How far does the Sun's gravity reach? And how it affects the objects past\nNeptune? For instance: how is Pluto kept in the system, by Sun's gravity or by\nthe sum of gravity of all the objects of the system? What affects the size of\nthe radius of the solar system?",
  "data/reddit-ask/r/askscience/comments/nyfopn/would_any_of_the_recent_flu_vaccines_protect_me.json": "Edit: are any of the markers targeted by any of the recent flu vaccines in the\n1918 strain of flu and would those protect me if they were?",
  "data/reddit-ask/r/askscience/comments/nyv1qh/why_dont_microplastics_keep_breaking_down.json": "It's my understanding that as pieces of \"stuff\" dissolve or disintegrate into\nsmaller pieces the process accelerates as the surface area/volume ratio changes.\nIt seems like plastics in the ocean have broken down into \"micro\" sized pieces\nthen just... stopped? Is there some fundamental unit of…",
  "data/reddit-ask/r/askscience/comments/nzh4j0/the_earth_is_about_45_billion_years_old_and_the.json": "At what point can we say that the silence is an indication of the rarity of\nintelligent life?",
  "data/reddit-ask/r/askscience/comments/o0bncs/askscience_ama_series_we_have_60_years_of.json": "\"We\" are part of REN21 [https://www.ren21.net/]'s team, a network made up of\nacademia, NGOs, industry, govt and individuals who are supporting the world to\ntransition to renewable energy.\n\nToday we released the Renewables 2021 Global Status Report so we're hosting an\nAMA to talk about renewables,…",
  "data/reddit-ask/r/askscience/comments/o0cbbe/if_the_earth_was_hit_by_another_large_planetary.json": "If another large body crashed into us and ejected a bunch of debris that created\nthe moon, shouldn't that have thrown our orbit out of whack, how come it's still\nrelatively circular?",
  "data/reddit-ask/r/askscience/comments/o0cs74/did_the_goods_south_image_capture_colliding.json": "I was looking at the GOODS south image\n[https://hubblesite.org/contents/media/images/2016/39/3920-Image.html?keyword=goods]\nand noticed what looks to me like two galaxies on a collision course\n[https://i.imgur.com/J3GBTVC.png].\n\nIs this just an illusion in the image or a collision in…",
  "data/reddit-ask/r/askscience/comments/o0i9s0/how_deep_can_water_be_before_the_water_at_the.json": "Let's assume the water is pure H20 (and not seawater). How deep could this body\nof water be before the water pressure is great enough to phase change? What\nwould the water look like at that depth? What type of ice would form?\n\nWould average seawater change this answer?",
  "data/reddit-ask/r/askscience/comments/o0k1fs/why_are_liquids_almost_always_shinyreflective.json": "I am painting some furniture and just started wondering why almost anything that\nis in liquid form has a shine? Even flat finish paint is shiny until it dries.\nPaint, icing, foundation, etc all has shine when wet. And then some materials\nare still shiny even when dry/solid. Why? I assume it has to…",
  "data/reddit-ask/r/askscience/comments/o13haj/what_happens_to_a_person_dying_of_thirst_if_they.json": "If a person is dying of thirst on a raft adrift in the sea, they'll likely be\ntempted to drink seawater even though they know it won't help.\n\nWhat will happen to the person once they consume some seawater?\n\nI know they will eventually die, but I'm curious as to how. Specifically, what\nhappens…",
  "data/reddit-ask/r/askscience/comments/o161aj/how_does_mad_cow_disease_stay_dormant_for_upto.json": "I was reading a thread about blood donation and I read that people born in the\nUK during the Mad Cow Disease spread are still not allowed to donate blood\ntoday. How does Mad Cow Disease stay dormant for that long without visible\nnegative effects? Why can't we just test for the individuals who might…",
  "data/reddit-ask/r/askscience/comments/o1ue31/how_does_the_immune_response_that_causes_hay.json": "I always have a rough time aroung grass pollen season, and recently got the\nModerna vaccine. I've been assured that taking my usual antihistamies won't have\nany effect on the vaccine working, and I believe that, but I'd love to know why.\n\nSince allergies are an immune response, and antihistamines…",
  "data/reddit-ask/r/askscience/comments/o2tj79/why_dont_mrna_vaccines_require_an_adjuvant.json": "Most other vaccine types, especially the inactivated virus/bacteria or subunit\nvaccines require the co-administration of an adjuvant to elicit a good immune\nresponse leading to immunity. Vector vaccines, to my knowledge, also contain an\n\"adjuvant\" in the form of the actual virus used to deliver the…",
  "data/reddit-ask/r/askscience/comments/o39z7d/is_misophonia_culturally_dependent.json": "In some cultures, it's considered polite to eat loudly. In my house, I might\nkill you for it. Is misophonia something that manifests significantly\ndifferently from culture to culture like schizophrenia does? What are some\nunique ways in which it manifests, if so?",
  "data/reddit-ask/r/askscience/comments/o44hzz/why_flux_is_some_finite_number_even_if_there_are.json": "If there is a charged particle of charge +q in a sphere then flux passing\nthrough the sphere is said to be q/⋳ₒ . But there are infinite number of\nelectric field lines passing through the sphere of finite radius. So how can the\nflux be finite?",
  "data/reddit-ask/r/askscience/comments/o4ojij/is_there_any_form_of_matter_that_cannot_be.json": "ie: is there any mass that breaks the standard rules of how elements work?",
  "data/reddit-ask/r/askscience/comments/o5iqml/if_tesla_was_on_the_path_of_making_electricity_be.json": "Edit: how about shorter distances, not radio-like? Let's say exactly like WiFi,\nin order for me to charge my phone even when I'm 5 meters away from the charger?\nRight now \"wireless\" charging is even more restraining than cable charging.",
  "data/reddit-ask/r/askscience/comments/o5yrec/whats_the_main_barrier_to_creating_an_hiv_vaccine.json": "Is it that the virus mutates too quickly? Is the virus too complex/have\nantigenic surfaces that wouldn't produce effective antibodies? Would it be a\ngood candidate for mRNA vaccine technology/is there a highly conserved protein\non it that would work?",
  "data/reddit-ask/r/askscience/comments/o6ao2v/how_effective_is_the_jj_vaxx_against.json": "I cannot find any reputable texts stating statistics about specifically the\nchances of Hospitalization & Death if you're inoculated with the JJ vaccine and\nyou catch the Delta variant of Cov19.\n\nIf anyone could jump in, that'll be great. Thank you.",
  "data/reddit-ask/r/askscience/comments/o6ysqw/ice_burns_make_no_sense_to_me_on_a_molecular.json": "you can damage your skin via conduction on too hot and too cold objects (-5°C -\n54 °C). Now i can somewhat understand how fast moving molecules can damage\ncells, but what causes the skin cells to be damaged after being in contact with\nslowly moving molecules? Does the water in cells and blood…",
  "data/reddit-ask/r/askscience/comments/o7er3l/do_tides_levels_predict_sinkhole_formation_in.json": "Apologies in advance if the question begs anti-science supposition about current\nevents.\n\nThe recent collapse of a condominium happened after 3 days of the highest tides\nof the month in Miami. What's more, it happened 15 minutes prior the lowest\ntide. after two days of tides in excess of 3 feet…",
  "data/reddit-ask/r/askscience/comments/o7pgeu/does_name_familiarity_create_unintended_bias.json": "I know there has been some research done around unintended name discrimination,\nespecially in hiring practices, but I was wondering if there is any data on more\ngeneral familiarity bias?\n\nA recent example that made me think of this - I'm in sales and I've been having\nkind of a stressful morning,…",
  "data/reddit-ask/r/askscience/comments/o7znd1/why_is_chickenpox_more_dangerous_for_adults.json": "Adults get more dangerous symptoms and are more likely to die because of\nchickenpox but why does it hit adults so much worse than children? Google\ncouldn't tell the reason. It only told it is worse for adults but didn't tell\nwhy.",
  "data/reddit-ask/r/askscience/comments/o83585/when_someone_is_emotional_and_choked_up_or_has_a.json": "Basically the title, sometimes when I’m really sad and crying, it’s really hard\nfor me to talk because my throat feels like it’s closing up, what’s the deal\nwith that?",
  "data/reddit-ask/r/askscience/comments/o8cmbg/how_do_we_know_weve_discovered_a_new_species_of.json": "This article [https://www.bbc.co.uk/news/science-environment-57432104] claims\nthey’ve discovered a new species of human, which is awesome, but since the claim\nis based off a single fossil, how do we know that it wasn’t just one person with\nsome sort of genetic defect?",
  "data/reddit-ask/r/askscience/comments/o8paqg/is_it_true_some_prey_taunt_predators.json": "I heard somewhere gazelle are so fast, they are quite cocky and will taunt\ncheetahs by displays of athleticism, kind of like saying “try me; I am fast.”\n\nOr how some zebras may display an aloof or cool nature while looking directly at\nlions, and then you learn that some zebras have actually killed…",
  "data/reddit-ask/r/askscience/comments/o8ryu9/if_ocean_waves_are_a_perturbation_of_a_medium_the.json": "We know that electricity does not need matter (e.g. induction chargers work in a\nvacuum / in space) as well as light (seen from space yet space is a vacuum) so\nI'm wondering what the field medium could be.",
  "data/reddit-ask/r/askscience/comments/o8y04s/how_do_they_know_that_the_skull_found_in_harbin.json": "I was just reading an article about it, and there was a drawing of a male Homo\nlongi, and I thought, why couldn't it be a female? Is there a scientific way of\nknowing that from the skull, considering that their characteristics differ from\nH.Sapiens?\n\nI then googled, \"archaic human\" and saw mostly…",
  "data/reddit-ask/r/askscience/comments/o921m0/why_dont_planes_have_dimples_like_golf_balls.json": "If golf balls are made more aerodynamic by having a dimpled surface, than why\ndon't we use this design principle for other things that need low drag such as\ncars, aircraft, boats, etc?",
  "data/reddit-ask/r/askscience/comments/o9aalo/are_birds_today_descended_from_a_single_dinosaur.json": "Basically the title. Do we know? If not, will we ever know?\n\nOr is my understanding of evolution so poor that this question makes no sense?",
  "data/reddit-ask/r/askscience/comments/o9msp0/having_a_large_supply_of_atp_inhibits_oxidative.json": "Wouldn't it be better for the body to just stockpile ATP rather than store\nenergy as triacylglycerol?\n\nEdit: my best guess is that ATP is less energy dense than fats, so if you kept\nmaking it you'd inflate like a balloon. I'm also thinking that maybe we don't\nhave enough adenosine to be using it all…",
  "data/reddit-ask/r/askscience/comments/oaa9d0/is_vaccination_always_recommended_after_infection.json": "Is it my understanding that vaccination for COVID-19 is recommended even if you\nhave previously tested positive for the virus. Is this also the case for other\ntypes of pathogens with (relatively) new vaccines such as chickenpox? Why or why\nnot?",
  "data/reddit-ask/r/askscience/comments/oas3hs/since_there_isnt_any_resistance_in_space_is.json": "Without any resistance deaccelerating the object, the acceleration never stops.\nSo, is it possible for the object (say, an empty spaceship) to keep accelerating\nuntil it reaches light speed?\n\nIf so, what would happen to it then? Would the acceleration stop, since light\nspeed is the limit?",
  "data/reddit-ask/r/askscience/comments/oavzi7/do_semi_aquatic_animals_get_ticks_and_lice.json": "Hey all, so I saw a video of a platypus scratching itself and it got me\nthinking.\n\nCan they get ticks and lice?\n\nSince they would be underwater most of the time, wouldn’t the ticks and lice\ndrown?\n\nAlso can water living mammals get ticks and lice?\n\nEdit: I see a few replies about aquatic parasites…"
}