{
  "data/reddit-stocks/r/wallstreetbets/comments/wd2yb1/i_think_my_husband_might_have_committed_insider.json": "I am going to be intentionally vague in this post . . .\n\nI am speaker of the house and my husband is an ape. He was squeezing my huge\nsand bags one night a few weeks ago and I mentioned I was working on a bill that\nsubsidized microchip companies.\n\nNext thing I know, this ape goes wild on chip…",
  "data/reddit-stocks/r/stocks/comments/wd6mxt/the_stock_market_could_surge_18_to_new_highs_by.json": "https://markets.businessinsider.com/news/stocks/stock-market-outlook-bear-market-over-new-sp500-highs-fundstrat-2022-7\n\nThe stock market could be gearing up for new record highs before year-end as the\n2022 bear market is over, Fundstrat's [https://fsinsight.com/] Tom Lee said in a\nnote on…",
  "data/reddit-stocks/r/stocks/comments/wd42ed/need_a_devils_advocate_but_realistic.json": "23m sitting on about 37k portfolio, 10k roth and making 70-80k a year.\n\nMy current strategy is to buy june 2024 options (50c / 60c ) on big tech.\nCurrent positions are 2x aapl, 1x googl, 1x amzn.\n\nHow i see it, if the Companys trade flat for 2 years, i only lose 1-2% of the\ntheta premiums I’ve been…",
  "data/reddit-stocks/r/stocks/comments/wdemqb/apple_nabs_key_lamborghini_executive_to_work_on.json": "> Apple Inc. has enlisted one of Lamborghini’s top car-development managers in a\n> sign that it’s stepping up work on a self-driving electric vehicle, according\n> to people with knowledge of the situation.\n> \n> The company hired Luigi Taraborrelli, a 20-year veteran of the Italian\n> carmaker, to…",
  "data/reddit-stocks/r/stocks/comments/wd6oyq/earnings_for_the_first_week_of_august_2022_expect.json": "Let me know if I missed any important ones or tickers you baghold.\n\nMonday:\n\n * Energy: Devon (DVN), Diamondback (FANG), Williams Companies, Inc (WMB)\n * Agriculture: Mosaic (MOS, fertilizer), CF (fertilizer)\n * HSCB\n * Activision (ATVI)\n * Pintarest (PINS)\n * Mitsubish (MUFG)\n * Avis Budget Group…",
  "data/reddit-stocks/r/wallstreetbets/comments/wdd77q/is_it_normal_for_a_broker_to_be_way_too_late.json": "So I have some shares, and that company did a stock split and dividend. Ex\ndividend date was the 18th and delivery date the 22nd of July.\n\nWhen I didn't receive my shares I contacted my Belgian bank and they told me\nthat the pay date was the 26th of July and that their broker would book the\nshares…",
  "data/reddit-stocks/r/investing/comments/wde01j/dividend_aristocrats_etf_vs_sp_any_historical.json": "I have a pretty standard all market portfolio atm but am thinking to offload\nsome of my allocations into SCHD for a low expense dividend focused ETF. In the\nprocess though I became curious if it’s such a good move. My goal would be to\nhave a significant stream of dividend income in 10yrs by…",
  "data/reddit-stocks/r/Bogleheads/comments/wdef45/should_i_sell_my_last_stock.json": "I purchased 10 shares of a stock for $350 before I stumbled upon the Boglehead\nphilosophy and I don't know if I should sell it or not. It's price has\ndepreciated more than 10% from when I bought it.\n\nI'm still young (23M) and I won't need the money for a really long time. So a\npart of me thinks…",
  "data/reddit-stocks/r/stocks/comments/wdkarg/us_factories_grow_at_slowest_pace_in_two_years.json": "A key barometer of American factories fell to a 25-month low of 52.8% in July in\na sign of creeping weakness in the U.S. economy. The good news? Inflation\npressures eased. The Institute for Supply Management’s closely followed\nmanufacturing gauge dipped from 53% in June, in no small part due to…",
  "data/reddit-stocks/r/Bogleheads/comments/wdlo7t/need_advice.json": "Longtime client and big fan but I've really lost faith in Vanguard.\n\nMy wife's mother died and left a VG trust to her 3 daughters. About half VFIAX\nand half cash.\n\nThey had a conference call to divide it 3 ways.\n\n\n\nStarted:\n\n * Trust = VFIAX & Cash\n\nA few days later:\n\n * Sis 1 = 1/3\n * Sis 2 = 1/3\n…",
  "data/reddit-stocks/r/wallstreetbets/comments/wdkw51/psa_we_could_be_losing_the_greatest_trader_of_all.json": "Just wanted to get the word out that Nancy Pelosi is going ahead with her Taiwan\nvisit and Winnie has threatened to shoot her plane down. I estimate the entire\nmarket could be effected by such a move as the rest of congress will have to\npick up the insider trading and I’m not sure they’re as good…",
  "data/reddit-stocks/r/stocks/comments/wdmmdk/tesla_tsla_surges_higher_ahead_of_stock_split_vote.json": "Tesla’s stock (TSLA) is surging higher ahead of its shareholders voting on a\nstock split later this week. The company announced its intentions to do a stock\nsplit back in March 2022. And last month, Tesla revealed its intentions for a\n3-for-1 stock split, if approved by shareholders. The vote is…",
  "data/reddit-stocks/r/Bogleheads/comments/wd4e0w/how_does_one_retire_with_taxable_and_non_taxable.json": "I’m interested, do you get some email saying “congratulations! You’re now ready\nto start pulling funds out”\n\nDo you start to just pull out as much is necessary? What if the market is at a\ndownturn?\n\nIs 59 & a half really the earliest we can pull out?",
  "data/reddit-stocks/r/investing/comments/wdszaa/personal_investment_or_llc.json": "Hello all I have the opportunity to invest in a business. I've reviewed the\nbusiness plan, met with the leadership, and investigated the market for the\nproduct. I feel this company is worth the investment.\n\nMy question is should I do my investment as a personal Investment or should I\nset up an LLC…",
  "data/reddit-stocks/r/stocks/comments/wdr05o/what_companies_have_the_most_trustworthy.json": "Example reasons:\n\n * Guidance is consistently accurate or conservative\n * Significantly cut down costs\n * Retains high quality employees/executives due to culture\n * Issues are communicated to investors clearly and well in advance\n * Management minimizes shareholder dilution\n * Navigates difficult…",
  "data/reddit-stocks/r/wallstreetbets/comments/wdsr8o/mfw_i_have_to_work_50x_harder_for_half_the_reward.json": "wake up babe, time to pay 50% increase in rent since 2020",
  "data/reddit-stocks/r/stocks/comments/we08cr/can_i_direct_register_the_shares_i_have_in_every.json": "With all I've read about GME fuckery, I've just lost faith in the market and I'm\nnot sure I want anything I'm invested in to be used for any purpose other than\nfor the benefit of myself and the companies I bought into. Can anyone discuss\nall this stuff with me, straight up explain the finer points…",
  "data/reddit-stocks/r/stocks/comments/wdjy1z/best_stocks_for_new_investors.json": "I am a 16 year old male and my mother has given permission to use her name to\ninvest in stocks. I have been doing my research and I am confused to how to\ncorrectly identify an undervalued stock and if it’s going to go up\n\nI really want to understand this to a greater depth and want to know how…",
  "data/reddit-stocks/r/Bogleheads/comments/wdsam4/taking_control_of_my_roth_ira_at_19_start_over.json": "Hi,\n\nI \"got into\" investing when I was a bit younger and somehow convinced my dad to\nmake me a roth IRA. With some money I made from part time jobs and his own\ncontributions over the years, it now looks like this:\n\n- 30% FNILX\n- 40% FXAIX\n- 30% FZROX\nValue: ~$1000\n\nI wasn't very consistent on…",
  "data/reddit-stocks/r/stocks/comments/wdxg9h/do_you_believe_this_rally_is_another_headfake.json": "So the question is, have we already hit bottom for 2022? If you're buying\nindividual stocks or pouring money into ETF's, you probably think we've already\nhit bottom. However, others believe this is just a temporarily rally, with much\nmore pain headed our way. Including new 52 week lows for just…",
  "data/reddit-stocks/r/Bogleheads/comments/wdw9dm/almost_caught_myself_slipping_today.json": "I have about $17K I lump summed 6 months ago into mostly VT and VXUS and my\nlowest has been down $2K and now I’m just about to break even… I try not to\ncheck my balance but today I had the strangest urge to sell everything based on\nthis monkeypox business and buy in case of a COVID -like…",
  "data/reddit-stocks/r/stocks/comments/wdpj1m/uber_reports_earnings_tomorrow_whatre_your.json": "Uber reports 2Q earnings tomorrow before the market and appears to be up today\nin anticipation of good news.\n\nWhat do you think may happen?\n\nPosition: 150 shares @23.50 and thinking about buying more depending on the\nresults",
  "data/reddit-stocks/r/wallstreetbets/comments/we6sh1/joke_du_jour.json": "*CHINA THREATENS TO RETALIATE FOR PELOSI’S TAIWAN TRIP BY RELEASING HER FULL\nTRADING RECORDS AND WHATSAPP MESSAGES TO HER BROKER",
  "data/reddit-stocks/r/Bogleheads/comments/we6eo9/investing_10kmonth_into_etfs.json": "I'm currently investing $10K a month into ETFs doing a 75/25 VTI/VXUS split.\n\nso far I have $50K invested and plan to continue to invest $10K monthly for the\nnext 5 years. I'm 30yrs old. Goal is early retirement.\n\nAnything I need to do differently?\n\nall feedback would be appreciated!",
  "data/reddit-stocks/r/stocks/comments/we92oo/this_blows_your_mind_hkd_a_chinese_ticker_2mmonth.json": "I am in the process of researching this.\nThis topic is so important, so we need a lot of smart people.\n\nIt is not a typical penny stock pump and dumb // no news and low social media\nreach pretty uncommon for a normal dump and pump - it's Place 80 among the\nlargest companies ranked by Market…",
  "data/reddit-stocks/r/stocks/comments/we93uq/uber_earnings_dont_look_great_to_me_but_get_a.json": "Uber earnings are out and while beating on revenue and turning cash flow\npositive, it still looks like their profit margins are actually getting worse,\nnot better. Shares are surging as I guess turning cash flow positive was what\ninvestors wanted to see, but this still looks like an overpriced…",
  "data/reddit-stocks/r/stocks/comments/wea08q/nvidia_vs_amd_vs_intel.json": "Between the 3 semiconductor stocks which one is your favorite and which one do\nyou think can grow the most and have the best returns in the next 10 years or\nabove?\n\ni presonally think all 3 comapnies are great and can have very impressive\nreturns in the long run.",
  "data/reddit-stocks/r/investing/comments/webjth/uber_turns_cash_flow_positive_for_the_first_time.json": "https://www.reuters.com/business/autos-transportation/uber-turns-cash-flow-positive-first-time-2022-08-02/\n\nAug 2 (Reuters) - Uber Technologies Inc (UBER.N)\n[https://www.reuters.com/companies/UBER.N] on Tuesday reported positive\nquarterly cash flow for the first time ever and forecast third-quarter…",
  "data/reddit-stocks/r/Bogleheads/comments/we4hd9/thoughts_on_my_portfolio_choices.json": "Current portfolio value is $12,000.\n\nVTI-65% VGLT-20% VXUS-15%\n\nI’m 26 and very long term.",
  "data/reddit-stocks/r/Bogleheads/comments/wdu00j/my_mother_is_asking_me_if_its_a_bad_time_to_put.json": "I think historically it's always been a good idea but if there's a looming\n\"crash\" coming, maybe this is the first time in decades it's actually a bad\nidea? I'm a bit illiterate in the topic and would appreciate any answers,\nthanks!",
  "data/reddit-stocks/r/stocks/comments/wedlgx/us_job_openings_drop_below_11_million_for_first.json": "Job openings in the U.S. fell to 10.7 million in June to mark the lowest level\nsince last fall, signaling that a red-hot labor market is cooling off a bit as\nthe economy slows. Job openings slipped from 11.3 million in May. They have\ndropped three months in a row after peaking in the early spring…",
  "data/reddit-stocks/r/stocks/comments/we7rb9/how_many_of_you_have_actually_researched_stocks.json": "Whenever I see people ask about learning how to research stocks or concentrated\nportfolios I can't help but notice that people in the comments section are very\ndiscouraging about it and regurgitate advice about going into ETFs and leaving\ninvesting to hedgefunds, people with faster information,…",
  "data/reddit-stocks/r/stocks/comments/weh0i5/lets_talk_about_the_31s_highest_marketcap_company.json": "Hey Guys,\n\nThis morning I made a post about the NYSE ticker: HKD. I was confused how a\n„pump and dumb“ realizes a market cap of 150 billion.\n\nGuess what happened the post got viral but unfortunately the mods removed the\npost.\n\nSo the definition of a pump and dumb:\n\n„Pump-and-dump is a manipulative…",
  "data/reddit-stocks/r/stocks/comments/wec1l4/any_reason_not_to_buy_hyundai_motors.json": "In the past year they opened up new factories in Korea & Indonesia and announced\na $7 billion EV factory in Georgia.\nIn June last year they bought up Boston Dynamics with the intent to \"introduce\nthis advanced robotic technology into a wide variety of mobility systems\". They\nrank highly in…",
  "data/reddit-stocks/r/wallstreetbets/comments/wedj1s/overnight_gainsyolo.json": "Yesterday I bought 3k shares of AMTD GROUP on Robinhood, that was 29k gain amd\nalso bought 24k shares on Ameritrade, that was the nice one. My first big gain\nin my life. Omg",
  "data/reddit-stocks/r/wallstreetbets/comments/wegalp/hkd_amtd_digital_is_now_the_35th_most_valuable.json": "Correction: 31st most valuable now. Worth the same as Bank of America\n[https://companiesmarketcap.com]\n\nHKD IPO’d at $7 on July 19 as a subsidiary of AMTD (which had around a $2b\nmarket cap).\n\nWhat does it do? Not really anything. It has some bullshit things on its website\nbut the last press…",
  "data/reddit-stocks/r/stocks/comments/welwt0/breaking_robinhood_cutting_about_23_of_jobs.json": "According to WSJ\n[https://www.wsj.com/articles/robinhood-lays-off-23-of-staff-11659471011]:\n\n> The job cuts mark the second round of layoffs this year at Robinhood, which in\n> April laid off about 9% of its full-time employees. Together, the two rounds\n> have cut more than 1,000 jobs from the…",
  "data/reddit-stocks/r/stocks/comments/welvuj/advanced_micro_devices_nongaap_eps_of_105_beats.json": "Summary:\n\n * Q2 Non-GAAP EPS of $1.05 beats by $0.01.\n * Revenue of $6.55B (+70.1% Y/Y) beats by $20M.\n\nFor the third quarter of 2022, AMD expects revenue to be approximately $6.7\nbillion, plus or minus $200 million, an increase of approximately 55%\nyear-over-year led by growth in the Data Center…",
  "data/reddit-stocks/r/Bogleheads/comments/wejc1t/is_it_time_for_bonds_ive_been_at_1_for_many_years.json": "I'm sitting around 1M in assets. 15-20% of those assets are currently cash, from\na recent home sale. Luckily I did not invest that when I sold it last Fall.\n\nCurrently 35y and hoping to retire by 40. The recent volatility took my\ninvestments down about 150k.\n\nI see that Bonds are pretty low right…",
  "data/reddit-stocks/r/stocks/comments/wemarx/sofi_beats_earnings_and_raises_guidance.json": "SOFI TECHNOLOGIES, INC. REPORTS\nSECOND QUARTER 2022 RESULTS\nRecord GAAP and Adjusted Net Revenue for Second Quarter 2022\nGAAP Net Revenue of $363 Million Up 57%; $356 Million Record Adjusted Net\nRevenue Up 50% Year-over-Year\nAdjusted EBITDA of $20 Million Up 81% Year-over-Year\nNew Member Adds of…",
  "data/reddit-stocks/r/Bogleheads/comments/weh5oy/where_to_store_our_cash_for_a_house.json": "We've saved up money for a downpayment for a house. We're not buying\ntoday....but keeping it for a purchase in the next year or two. We're waiting\nfor the right house to pop up. The catch then is we want to save our money in a\nplace where we can quickly access it e.g. not a 1 year CD where we can't…",
  "data/reddit-stocks/r/stocks/comments/welono/starbucks_beats_earnings_and_revenue_estimates.json": "Starbucks on Tuesday reported better-than-expected quarterly earnings and\nrevenue, despite lockdowns in China weighing on its performance.\n\nHere’s what the company reported for the quarter ended July 3 compared with what\nWall Street was expecting, based on a survey of analysts by Refinitiv:\n\n *…",
  "data/reddit-stocks/r/investing/comments/wei612/dallas_fed_us_likely_didnt_slip_into_recession_in.json": "https://www.dallasfed.org/research/economics/2022/0802\n\n> Inspecting Individual Recession Indicators\n> \n> The NBER committee’s indicators used to date business cycles include real\n> (inflation-adjusted) personal income minus transfers, nonfarm payroll\n> employment, employment as measured by the…",
  "data/reddit-stocks/r/Bogleheads/comments/wefyie/15_year_old_interested_in_geting_started_on_all.json": "hello everyone, as the title says im a teenager getting really interested in all\nof this investing, etf, bonds etc. During tge last year or so i made myself with\nlow single digit savings (~3k to be more specific). I may fit into a weird\ncategory since I still dont know if I want to reside here (the…",
  "data/reddit-stocks/r/wallstreetbets/comments/weizqg/a_deep_dive_into_amtd_hkd_madness_now_the_13th.json": "We're now way above the point in market cap where we can talk about this shady\nHK stock.\n\nThis article breaks down P/E (now over 13,000), what the company does (including\nits WIX-builder website), what the revenue and EPS look like, and why the volume\nlooks extremely sketchy.\n\nTl;dr: HDK is up more…",
  "data/reddit-stocks/r/stocks/comments/wetj9s/paypal_pypl_earning_q2_2022.json": " * Earnings: 93 cents per share, adjusted, vs. 86 cents per share as expected by\n   analysts, according to Refinitiv.\n * Revenue: $6.81 billion, vs. $6.79 billion as expected by analysts, according\n   to Refinitiv.\n\nRevenue grew 9% year over year, but the company reported a $341 million net\nloss,…",
  "data/reddit-stocks/r/Bogleheads/comments/wf3u5l/boglehead_eu_portfolios.json": "Hi everyone? I was wondering what everyone in EU has for portfolio given that\nmost advice and literature is for US investors. I currently invest in VWCE etf\nas my “boglehead” strategy, 100% stock since I am young and also own paid for\nreal-estate. What are your EU portfolio allocations? Bonds?…",
  "data/reddit-stocks/r/Bogleheads/comments/wej4aw/best_current_hysa.json": "I have my emergency fund sitting at my local credit union earning peanuts while\nI wait for my ibonds to mature and become my new emergency fund. I want to move\nthe money to a HYSA, is anyone aware of a particularly high yielding one right\nnow?",
  "data/reddit-stocks/r/stocks/comments/wf3rna/a_consistent_financial_powerhouse_cvs_beats.json": "CVS has been a long hold of mine for a couple years now. Whatever you may think\nof their pharmacy experience, they are a financial powerhouse. Consistently\ngrowing revenue and margins and delivering quarter after quarter beats on\nestimates. I have also been a fan of their minute clinics models and…",
  "data/reddit-stocks/r/wallstreetbets/comments/wf0wgp/austrian_retard_here_which_didnt_receive_his_gme.json": "Hey retards, i am from austria and i hold all my GME moontickets in my\nbankaccount.... I wrote my bank bevore the split and i asked how the process\nwill be => the answer was you need to wait or ask gamestop directly.\n\nAfter nearly 2 weeks... i still didnt receive my dividend and the bank…",
  "data/reddit-stocks/r/Bogleheads/comments/wev5z6/401k_fidelity_offers_some_options_how_should_i.json": "Hi, I'm trying to figure out how to allocate my 401K investments. It's done\nthrough Fidelity. I'm not extremely well-versed in this, so I thank y'all in\nadvance for any help sent my way.\n\nBackground: I'm 22, and I plan on maxing out my 401K contributions to reach the\n$20,500 limit. Currently, I am…"
}