{
  "data/reddit-stocks/r/Bogleheads/comments/t3ug05/why_are_so_many_younger_investors_drawn_to.json": "I see questions here all the time from first time investors and they almost\nuniversally mention Robinhood, Wealthfront, or M1 Finance instead of one of the\nold standbys: Vanguard, Fidelity, or Schwab.\n\nAre Robinhood/Wealthfront/M1 marketed at younger people or something? I can\nhonestly say that…",
  "data/reddit-stocks/r/wallstreetbets/comments/t3w282/ukraine_selling_war_bonds_not_the_usual_wsb.json": "https://news.yahoo.com/ukraine-to-auction-war-bonds-to-fund-armed-forces-173623142.html\n\nWe should see if we can name some tanks or bombs if we buy enough bonds!\n\nWhat would the Russian equivalent of Sum Ting Wong be?",
  "data/reddit-stocks/r/stocks/comments/t438zp/visa_mastercard_block_russian_financial.json": "> U.S payment card firms Visa and Mastercard have blocked multiple Russian\n> financial institutions from their network, complying with government sanctions\n> imposed over Moscow's invasion of Ukraine.\n> \n> Visa said on Monday it was taking prompt action to ensure compliance with\n> applicable…",
  "data/reddit-stocks/r/investing/comments/t44pro/ukraine_supplies_70_of_the_worlds_neon_chip.json": "Again, the world's major chip and semiconductor companies are watching the\nconflict closely as the Russian invasion of Ukraine will likely hamper the\nsupply of neon.\n\nNeon is used in lithography to make microchips.\n\nCurrently it appears the larger chip manufacturers have plenty in reserve but\nare…",
  "data/reddit-stocks/r/Bogleheads/comments/t47u97/maintain_discipline_during_uncertainty_vanguard.json": "> Hello. I’m Tim Buckley, Vanguard’s CEO.\n> \n> Recent events have added a new dimension of risk to the markets.\n> \n> Beyond the very real human cost, the invasion of Ukraine by Russian forces has\n> resulted in increased market volatility and significant sanctions. Further\n> economic costs in the…",
  "data/reddit-stocks/r/Bogleheads/comments/t47s66/bogleheads_on_investing_podcast_hits_1000000.json": "Happy to announce my podcast: \"Bogleheads on Investing\" has hit a milestone of\n1,000,000 downloads! Thank you! The latest guest is Eduardo Repetto, Ph.D.,\n[https://bogleheads.podbean.com/e/episode-043-eduardo-repetto-on-factor-investing-host-rick-ferri/]CIO\nof Avantis and former CIO and CEO of…",
  "data/reddit-stocks/r/stocks/comments/t3ybdp/tsm_taiwanese_semiconductor.json": "This stock was ATH in mid January 2022 then started dipping, I am assuming, due\nto sentiment that China will get inspired by Russia and invade Taiwan. It's now\ndown 25% and all 2021 gains have been wiped out. What do you think? Buy the dip?",
  "data/reddit-stocks/r/wallstreetbets/comments/t3wmgz/canada_to_supply_antitank_weapons_to_ukraine_ban.json": "https://www.reuters.com/world/canada-foreign-minister-says-more-sanctions-coming-against-russia-2022-02-28/\n\nCanada imports a little of Russian oil. But just like the sanctions, I can see\nthis catapulting to other countries. This’ll cause gas prices to rocket slowly.\n\nWhat oil companies or etfs are…",
  "data/reddit-stocks/r/stocks/comments/t4898g/tell_me_why_i_am_crazy_to_think_oil_will_easily.json": "I believed every article weeks ago when it said we will hit $100 a barrel. I\nalso believe the ones that say we will pass $120 a barrel. Tbh $200 a barrel\nwith everything going on right now in Ukraine is not out of the question. Many\ndays ago I posted somewhere about buying OILU shares. I am buying…",
  "data/reddit-stocks/r/Bogleheads/comments/t4baxt/just_invested_300k_in_vtsax.json": "I’m freaking out and feeling liberated at the same time (was a windfall I’ve had\nfor a month; held while researching). Net worth is about 450K now, still in my\n20s.\n\nVXUS is 20% of my portfolio. Thinking of balancing 80% domestic / 20%\ninternational, but feedback is always welcome",
  "data/reddit-stocks/r/stocks/comments/t4cqtd/russia_to_spend_up_to_103b_to_buy_shares_in.json": "Russia not throwing in the towl yet. Plans to do a substantial buy on the market\n(when it opens).\n\n\"March 1 (Reuters) - The Russian government has ordered the finance ministry to\nchannel up to 1 trillion roubles ($10.3 billion) from the National Wealth Fund\nto buy shares in Russian companies, a…",
  "data/reddit-stocks/r/stocks/comments/t4arvf/intc_insiders_have_purchased_additional_shares.json": "INSIDER ACTIVITY ALERT\n\nIntel CEO Pat Gelsinger and Chairman Omar Ishrak were part of a group of\ninsiders who bought stock when it dipped in late October. Last week, both men\nbought more Intel stock as shares edged lower.\n\nOn Tuesday, Gelsinger paid $247,890 for 5,600 shares, a per-share average…",
  "data/reddit-stocks/r/stocks/comments/t4haa9/apple_pay_and_google_pay_no_longer_work_on.json": "> It has been reported that Apple Pay and Google Pay are no longer working for\n> Russians [https://www.buzz.ie/all-about/russia] as they attempt to use\n> Moscow’s metro system.\n> \n> This news comes as Western nations agreed to block some Russian banks from the\n> Swift international payment system,…",
  "data/reddit-stocks/r/stocks/comments/t4gjmf/russia_have_suspended_trading_on_moex_throughout.json": "Doing everything they can to reduce damage lol\n\nMeanwhile, the Moscow Stock Exchange, Russia’s largest exchange group with some\n200 stock listings, remained closed Tuesday, after the nation’s central bank\nannounced it would halt stock trading through Saturday as it “assesses the\nfeasibility” of…",
  "data/reddit-stocks/r/investing/comments/t4iokb/apple_stops_all_product_sales_in_russia_as_rt_and.json": "Apple has paused all product sales in Russia in response to the invasion of\nUkraine.\n\nThe tech company said it has also limited Apple Pay and other services in\nRussia, and that it has removed state-backed news outlets RT and Sputnik from\nits App Store in other countries.\n\nIn a statement, Apple…",
  "data/reddit-stocks/r/wallstreetbets/comments/t49bfw/wake_up_honey_new_pelosi_financial_disclosure.json": "Here's a link\n[https://disclosures-clerk.house.gov/public_disc/ptr-pdfs/2022/20020515.pdf] to\nthe disclosure. Pelosi exercised:\n\n * Up to $5M in call options in $AAPL\n * Up to $5M in call options in $DIS\n * Up to $1M in call options in $PYPL\n * Up to $500K in call options in $AXP\n\nand put up to…",
  "data/reddit-stocks/r/stocks/comments/t44y9z/rstocks_daily_discussion_technicals_tuesday_mar.json": "This is the daily discussion, so anything stocks related is fine, but the theme\nfor today is on technical analysis (TA), but if TA is not your thing then just\nignore the theme and/or post your arguments against TA…",
  "data/reddit-stocks/r/stocks/comments/t4d94w/goodrx_shares_fall_over_35_to_a_record_low_after.json": "GoodRx Stock Is Plunging to a Record Low. Its Earnings Were That Bad.\n\nhttps://www.barrons.com/articles/goodrx-stock-price-earnings-51646088690\n\nHighlights from their earnings report:\n\n> For the quarter, GoodRx posted revenue of $213.3 million, up 39% from a year\n> earlier, but below the Street…",
  "data/reddit-stocks/r/wallstreetbets/comments/t4jaji/this_is_vladimir_putin_my_dd_on_ukraine.json": "So, the last few months during Covid I've been isolated, being alone with hazmat\nsuit on big mansion with kilometric tables got me lot of time to think and I've\ncome with a brilliant plan.\n\n\n\nDo you know this country?\n\n\n\nCrimea 100%…",
  "data/reddit-stocks/r/stocks/comments/t4nx6s/flashback_to_cathie_wood_in_2020_i_believe_that.json": "Oil demand probably hit a secular peak last year and, thanks to #EV's, now is in\nsecular \"decline\".\n\nFrom her tweet on 2020 07-15 (not sure I can post tweets on here? I'll do it on\nreply)\n\n\"EV's\" was the biggest sham in 2020-2021. Yes they are coming, no oil will be\nnever be taken over when…",
  "data/reddit-stocks/r/wallstreetbets/comments/t4l4z7/hey_you_retard_yeah_you_retail_owns_90.json": "https://i.redd.it/lh7ewcn4ruk81.gif\n\nLt. Popcorn Retard here reporting for duty to spread the good word of the\nlatest:\n\nEarnings boring report:\nhttps://finance.yahoo.com/news/amc-earnings-201950084.html\n\nPopcorn stock earnings call update highlights:\n\n\n\n> CEO of AMC confirms over 4 million…",
  "data/reddit-stocks/r/stocks/comments/t4nvc4/sofi_earnings.json": "> Shares of SoFi were soaring 14% in after-hours trading Tuesday after the\n> financial-technology company exceeded expectations with its earnings outlook.\n> \n> SoFi recorded a fourth-quarter net loss of $111.0 million, or 15 cents a\n> share, whereas it recorded a net loss of $82.6 million, or $1.85…",
  "data/reddit-stocks/r/wallstreetbets/comments/t4df2e/how_to_make_115x_return_easy.json": "Guys, I just found out ONE USD is actually worth 115 RUBLES! If I take $1, I can\ntransform that into 115 other money - in case you missed it, that's a 115 times\nreturn. And it just keeps getting better and better by the hour!\n\nAnyway, I gotta peace out. Bought to take a mortgage out on my home to…",
  "data/reddit-stocks/r/Bogleheads/comments/t4tzao/jack_story.json": "I was at a Boglehead event a few years back, “near Philly,” it was my second\ntime attending and I had realized by then why people were so excited when Jack\nattended. Anyway this year he had a little book signing so I got in line with my\nbook (a few years prior, I found the way people acted around…",
  "data/reddit-stocks/r/wallstreetbets/comments/t4ljrd/amc_90_float_owned_by_retail.json": "AMC earnings call revealed 90% of the float is held by retail investors. The\nnumber is roughly 4 million holders. Same from a year ago. AMC apes are not\nleaving…The only way a price can drop like it does on tickers like AMC and GME\nis naked shorting and routing a majority of orders through dark…",
  "data/reddit-stocks/r/wallstreetbets/comments/t4lwvr/nike_pulling_products_from_foot_locker.json": "After Nike pulled products from Foot locker in a move to go directly to\nconsumer, rumors have been floating they might pull Dicks out as well.\n\nFoot locker plunged 35% on the news, so needless to say I’m #ShortDicks",
  "data/reddit-stocks/r/wallstreetbets/comments/t4ydnt/dont_go_into_russian_stocks.json": "Fellow apes, please do yourself a favor and don't even consider buying the dip\nof Russian stocks.\n\nOn the London Stock Exchange, equities like Gazprom, Sberbank, Lukoil etc.\nalready went to zero (literally -99.9%) trading at a few cents a share.\n\nInvestors are unloading the shares as pressure rises…",
  "data/reddit-stocks/r/stocks/comments/t50qdr/fed_chair_powell_notes_highly_uncertain_ukraine.json": "https://www.cnbc.com/2022/03/02/fed-chair-powell-notes-highly-uncertain-ukraine-impact-but-says-rate-hikes-are-still-coming.html\n\nFederal Reserve Chairman Jerome Powell still sees interest rate hikes coming,\nbut noted Wednesday that the Russia-Ukraine war has injected uncertainty into\nthe…",
  "data/reddit-stocks/r/stocks/comments/t4ugqo/eli5_should_i_buy_the_dip_now_or_wait_until_feds.json": "Basically the title. I am having a dilemma on whether I should buy the dip now\nor wait for feds announcement regarding rates change. I am having a hunch that\nthe market will price instantly the moment feds announcements are out. Do you\nthink so? Why or why not? Please state your argument for or…",
  "data/reddit-stocks/r/stocks/comments/t4zkeg/ukraine_and_russia_to_have_second_negotiation.json": "Hope they came to some positive conclusion for our own and the market sake.\n\nDow, S&P and Nas futures are all positive so hope this stays this way today.\n\nAlso no suprise but \"China will not join sanctions against Russia, banking\nregulator says\"\n\nhttps://www.cnbc.com/2022/03/02/china-will-not-join…",
  "data/reddit-stocks/r/stocks/comments/t535ap/rivian_hikes_the_base_price_of_its_quadmotor_r1t.json": "> Rivian has raised the original $67,500 base price of its quad-motor R1T\n> electric pickup with large battery packs to $79,500 (sans destination\n> charges). That's a whopping $12,000 increase that will apply to most\n> reservation holders except for those in the very final stages of purchase. The\n>…",
  "data/reddit-stocks/r/investing/comments/t4xjxw/sberbank_shares_how_screwed_am_i.json": "Question - Sberbank ADR (the largest Russian bank) is trading at $0.01 on the\nLondon stock exchange (symbol SBER) but listed at $1.00 on the OTC markets\n(SBRCY). Do the shares represent shares in the European subsidiary or something\nthat just went bankrupt? Is either price accurate? Just wondering…",
  "data/reddit-stocks/r/investing/comments/t53ubi/us_interest_rates_are_headed_higher_very_soon_to.json": "US Central Bank is going to raise interest rates later March.\n[https://www.msn.com/en-us/money/markets/powell-says-rates-are-headed-higher-even-as-ukraine-poses-uncertainty/ar-AAUvThI?ocid=msedgdhp&pc=U531]\n\nFeds will move toward a “predictable” shrinking of its big bond holdings after\nraising…",
  "data/reddit-stocks/r/wallstreetbets/comments/t51xk5/should_we_allow_russian_ultrarich_billionaires_to.json": "The 21 ultra-rich Russians among the world’s 500 wealthiest people have lost a\ncombined $83 billion in 2022, according to the Bloomberg Billionaires Index.\n\nThe biggest loss porn is credited to Vaget Alekperov, chairman of energy titan\nLukoil, who has lost $13 billion and “only” $6 billion left.",
  "data/reddit-stocks/r/stocks/comments/t56bte/us_stocks_rebound_as_powell_says_he_supports_25.json": "Fed Chairman Jerome Powell on Wednesday said the central bank intends to raise\nits policy interest rate by a quarter-percentage point following the end of its\ntwo-day meeting on March 16, despite uncertainties from the Russian invasion of\nUkraine.\n\n“With inflation well above 2% and a strong labor…",
  "data/reddit-stocks/r/stocks/comments/t55b6i/crude_hits_a_high_of_11251_a_barrel_overnight.json": "Even though yesterday the US and other nations would release 60m barrels\n[https://www.wsj.com/articles/u-s-iea-agree-to-release-60-million-barrels-from-oil-stockpiles-amid-ukraine-turmoil-11646151424]\nto counter high prices and, arguably, helped bring prices as low as $103, crude\noil continued to…",
  "data/reddit-stocks/r/Bogleheads/comments/t53qu2/how_and_where_do_i_receive_dividends.json": "Just purchased VTI and want to make sure I am putting the dividends back into\nit.\n\nIs this something i have to do manually?\n\nI use Fidelity",
  "data/reddit-stocks/r/Bogleheads/comments/t50qtc/the_bogleheads_conference_is_back_in_2022.json": "Mark you calendars for October 12-14.\n\nConference information\n[https://www.bogleheads.org/forum/viewtopic.php?f=10&t=371810]",
  "data/reddit-stocks/r/stocks/comments/t575io/closing_rivn_puts.json": "Two months ago I decided to go short on Rivian stock. RIVN was trading at around\n$85 when I made the decision. As such, I have been heavily buying RIVN puts.\n\nI've bought and have been adding to RIVN $70 Jan2023 puts. My profit as of today\nis approximately $32k, about 48% of the book cost.\n\nThis is…",
  "data/reddit-stocks/r/stocks/comments/t5c0ro/which_stocks_do_you_think_will_never_see_their.json": "So the intention of this post is to talk about which companies will never reach\ntheir All-Time High stock prices\n\n\n\nFor me personally, I think that Peloton is a good shout. Peloton's all-time high\nstock price was $172, which gave the company a Market Cap of over $60 Billion at\ntheir peak. I believe…",
  "data/reddit-stocks/r/Bogleheads/comments/t5ftd1/which_fidelity_index_funds_to_choose_for.json": "Only recently I (male 47) came to know of index funds.\n\nI have around 400K to invest and thinking of investing in some fidelity funds\nwith low expense ratio. Since I have a fidelity account for 401k in thinking of\ninvesting in fidelity index funds since it'll have low expense ratio.\n\nIf it was you,…",
  "data/reddit-stocks/r/stocks/comments/t5gaej/credit_suisse_asks_investors_to_destroy_documents.json": "Came upon this article over at r/Switzerland [/r/Switzerland] from poster\nu/ubley [/u/ubley]. In short Credit Suisse off loaded packaged loans to hedge\nfunds, which means there’s some counterparty risk. How long oligarchs continue\nto make payments in billions worth of toys they can’t touch remains…",
  "data/reddit-stocks/r/Bogleheads/comments/t5givc/i_understand_vt_is_basically_a_mix_of_vti_vxus.json": "https://imgur.com/a/mMnfkKR",
  "data/reddit-stocks/r/wallstreetbets/comments/t5c6t8/its_only_a_matter_of_time_before_the_russian.json": "Maybe you care about the war in Ukraine or maybe you don't.\n\nJust putting it out there, in case anyone cares.\n\nIt's just a matter of time before the Russian trollfarms will put two and two\ntogether and try to make reddit smoothbrains buy Russian shit.\n\nThis is not financial advice etc. etc.",
  "data/reddit-stocks/r/wallstreetbets/comments/t526h2/oil_is_about_to_go_through_the_damn_ceiling.json": "I think oil will hit a minimum of $130 a barrel and lead to $5-6 a gallon at the\npump.\n\nSource: I work in oil and gas and have extensive market knowledge and we are\nfucked.\n\nSmall position because my wife doesn’t let me put more in:\nhttps://imgur.com/gallery/PAvljCG",
  "data/reddit-stocks/r/stocks/comments/t5felj/never_sell_stocks_you_own_or_want_to_own.json": "Disclaimer: By “never,” I don’t mean absolutely never. Obviously, companies can\nchange, and should something change that gives us good reason to sell rather\nthan hold, we should sell. That being said, are there any stocks you “never”\nplan to sell that you’re either holding or really want to buy?\n\nI…",
  "data/reddit-stocks/r/investing/comments/t55y7q/are_interest_rate_increases_priced_in.json": "I know there are increases planned for this year. This month will see some, and\nlikely more throughout ‘22 to combat inflation.\n\nBecause it is so clear that this is necessary, would it also not stand to reason\nthat big money/smart money has already priced this in to the markets?\n\nObviously, I’m not…",
  "data/reddit-stocks/r/wallstreetbets/comments/t5f7dg/russia_will_exempt_it_companies_from_income_tax.json": "From a Russian news media outlet's Telegram channel, translated by google\ntranslate. Russian efforts to help combat sanctions include:\n\n\"New measures are being introduced to support the Russian economy. In\nparticular, IT companies will be exempted from income tax for 3 years, and\nemployees will be…",
  "data/reddit-stocks/r/Bogleheads/comments/t5bynq/backdoor_roth.json": "I did the Backdoor ROTH for year 2021 earlier today. But I have already filed\nthe tax return for 2021 in January. Will I need to fill form 8086 this year and\nreport to IRS or can i do it next year?",
  "data/reddit-stocks/r/investing/comments/t5p5mq/volkswagen_says_to_halt_activities_in_russia.json": "As title mentions: “VOLKSWAGEN SAYS TO HALT ACTIVITIES IN RUSSIA UNTIL FURTHER\nNOTICE”\n\nThis comes on the backdrop of major sanctions by European and American companies\nalike. Services such as Apple Pay and Google Pay are already not working for\nRussian citizens. Additionally, many airlines have…",
  "data/reddit-stocks/r/wallstreetbets/comments/t5m6ri/the_next_bullrun_for_this_stock_begins_tomorrow.json": "Video is pretty self-explanatory. Based on the history, the next bullrun begins\ntomorrow, March 3rd. (Was off by 2 days. 1 due to holiday, and 1 due to T+3\ninstead of T+2 which happened twice before that I didn't take into account).\nBull or Bear, there's money to be made with these cycles. I loaded…",
  "data/reddit-stocks/r/Bogleheads/comments/t5njoq/impact_of_mcsi_and_ftse_removing_russian_stocks.json": "Note to (hopefully) help out the Mods: This is an impact on the market/funds\npost, not an excuse to bring politics/world news into this forum. Please try to\nkeep responses to my post about the mechanics of what will go on with the\nindexes and the funds that track them.\n\nBoth MCSI and FTSE Russell…",
  "data/reddit-stocks/r/wallstreetbets/comments/t5kpd8/market_crash_imminent_jim_cramer_points_to.json": "We all know when Jimmy Creamie says UP it goes DOWN...\n\n * There are signs of relief for stocks that could individually, or together,\n   result in a sustained rally, CNBC’s Jim Cramer said Wednesday, as Russia’s\n   invasion of Ukraine and soaring inflation continue to roil markets.\n * “You do not…",
  "data/reddit-stocks/r/stocks/comments/t5q216/amazon_closing_physical_stores_cannot_be_all.json": "Over the last year or two I have seen news of Amazon trying to stretch into\nevery sector imaginable from physical retail to pharmacy etc. often there move\ninto a new space was followed by a refrain of how they will crush existing\nbusinesses in that space and take it over, much like they took over…",
  "data/reddit-stocks/r/Bogleheads/comments/t5bvhp/401k_max_out_question.json": "I started my job in 2019 with Traditional 401k and my employer contributes 6% of\ntotal pay each year. I have been contributing roughly 10k each year. Starting\nfrom this year i am thinking on maxing out my 401k. Would that be wise\ndecision?. I have no debt and a fair emergency fund.\n\nI started my…",
  "data/reddit-stocks/r/stocks/comments/t5supt/on_this_day_13_years_ago_barack_obama_almost.json": "VIDEO [https://streamable.com/dlgjzj]\n\nIf you made a $10,000 investment at the time in the following you would have\ntoday (dividends reinvested, where applicable):\n\n * S&P 500: (SPY): $76,465\n * Apple (AAPL): $609,908\n * Amazon (AMZN): $469,370\n * Google (GOOGL): $158,769\n * Netflix (NFLX):…",
  "data/reddit-stocks/r/wallstreetbets/comments/t5rxq9/russia_will_stop_deliveries_of_rocket_engines_to.json": "Calls on spacex\n\nAlphabet, Googles parent company, owns 7.5% of SpaceX so that's as close as you\ncan get.\n\nSo basically.... Ukraine internet down (only solution is Elon's Starlink).\nRussia bans rocket engine (only solution is Elon's Space X). I'm starting to\nthink Solar City, a Starlink Phone,…",
  "data/reddit-stocks/r/stocks/comments/t5shza/etsy_raising_fees_jan_11_sellers_not_happy.json": "Etsy is raising transaction fees from 5% to 6.5% a 30%increase.\nThis is not the only cost to selling a item.\nOn average I lose about 16.5% of the total sale amount to costs/fees.\nWhich will increase to about 18% Jan 11th.\n\nI personally am going to look into setting up my shop elsewhere and might…",
  "data/reddit-stocks/r/investing/comments/t5upmv/msci_and_ftserussell_will_be_removing_russia_from.json": "Haven't seen this noted anywhere yet. Both have of announced Russia as\n'uninvestable'. These are the two big boys as far as international is concerned,\nshould expect the rest to follow suit. We should expect further dips as passive\nindicies liquidate Russian exposure.\n\nRussia isn't a huge piece of…",
  "data/reddit-stocks/r/wallstreetbets/comments/t5l1r8/jon_stewart_on_wsb_apes.json": "Jon Stewart stock market episode praises apes and breaks down payment for order\nflow and citadel nefariousness:\n\nhttps://tv.apple.com/us/show/the-problem-with-jon-stewart/umc.cmc.4fcexvzqezr25p9weks6sxpob",
  "data/reddit-stocks/r/investing/comments/t5ypwj/how_the_hell_does_uber_lose_so_much_money.json": "I’m writing this post as I am walking somewhere and I have not had time to look\nthrough their statements, but how the hell do they lose so much money?\n\nThey dont have employee drivers, no vehicle fleets, drivers are paid when they\ncomplete a fare.\n\nAre there just too many extraordinary costs?…",
  "data/reddit-stocks/r/stocks/comments/t66csv/futures_plummet_as_russian_troops_are_shelling.json": "Russia’s invasion of Ukraine enters its second week Thursday as fighting\ncontinues across the smaller country.\n\nThere were conflicting reports about which side controls the city of Kherson.\nUkrainians still control capital Kyiv despite Russian efforts to overtake the\ncity. Port city Maripol and…",
  "data/reddit-stocks/r/investing/comments/t62a23/why_do_actively_managed_funds_exist_if_they_wont.json": "I am mainly talking about funds that invest in individual stocks. I can\nunderstand how some may want to invest more in bonds than stocks due to lower\nrisk especially nearing retirement. But in general I would imagine that the goal\nis just to make money and as it currently stands it seems like…",
  "data/reddit-stocks/r/Bogleheads/comments/t67kjj/target_fund_outside_tax_advantage_account.json": "I foolishly put the majority of my brokerage account in a target retirement fund\nabout 5 years ago when first investing with Vanguard. I am up about 11%.\n\nThoughts on whether to make any significant changes, I am worried about the\nlong-term tax consequences.",
  "data/reddit-stocks/r/stocks/comments/t696il/all_loss_joking_aside_some_people_may_never.json": "In the late 90s, I was making a great salary, aggressively saving, living\nfrugally, but for investing was risk averse, by nature. I did not want to lose\nmoney I had earned and saved. I still don't.\n\nFull blown dot com mania rolled around when the globe.com went public in late\n1998. I played around…",
  "data/reddit-stocks/r/investing/comments/t69u99/china_will_not_join_sanctions_against_russia.json": "https://www.cnbc.com/2022/03/02/china-will-not-join-sanctions-against-russia-banking-regulator-says.html?&amp;qsearchterm=sanctions\n\nBEIJING – China’s banking and insurance regulator said on Wednesday that the\ncountry opposes and will not join financial sanctions against Russia\n\n“Everyone is…",
  "data/reddit-stocks/r/Bogleheads/comments/t6avxs/and_its_gone.json": "These days it feels like you put any money in and portfolio looks bigger for the\nday but very next day market drops again and it looks like I didn't even put\nanything in. I'm seeing this consistently for last 3 DCA atleast. Reminds me of\none those episodes on southpark. I know I shouldn't be…",
  "data/reddit-stocks/r/Bogleheads/comments/t5sfzt/saving_money_for_a_35_year_timeline.json": "Hi everyone! So as someone who recently converted over about a year ago, I’ve\nbeen slowly organizing my finances as a Boglehead. Like a lot of people, I’m\nsaving up to buy a home. My timeline is a little foggy, so I have a flexible\nrange of 3-5 years. I’m trying to figure out all options on where I…",
  "data/reddit-stocks/r/stocks/comments/t69c3t/over_the_past_13_years_apple_stock_has_traded_at.json": "In the 13 years from 2009 to the present, Apple stock has returned 60 times.\n\nThen there is a very interesting question, the market value of Apple's company\nis now 2.6 trillion. So in the next 5-10 years, can Apple's market value reach\n13 trillion-26 trillion? That's a 5-10x gain. At present, our…",
  "data/reddit-stocks/r/stocks/comments/t6519i/what_is_the_toughest_loss_youve_had_to_endure.json": "As per the title.\n\nI've made some buys these past few months which in hindsight was way too early\nand expensive, or simply horrible and I'm mulling over taking the losses and\nreinvesting it somewhere else.\n\n*note: the losses I'm seeing is probably a lot lesser. Around the ballpark of\naround 900USD.…",
  "data/reddit-stocks/r/stocks/comments/t6jmtc/february_jobs_rose_a_surprisingly_strong_678000.json": "https://www.cnbc.com/2022/03/04/jobs-report-february-2022.html\n\nJob growth accelerated in February, posting its biggest monthly gain since July\nas the employment picture got closer to its pre-pandemic self.\n\nNonfarm payrolls for the month grew by 678,000 and the unemployment rate was\n3.8%, the…",
  "data/reddit-stocks/r/investing/comments/t6ko3m/russias_second_biggest_oil_company_calls_for_an.json": "https://www.cnn.com/2022/03/04/business/lukoil-end-war/index.html\n\nRussia's second largest oil company has broken ranks with President Vladimir\nPutin.\n\nLukoil, which produces more than 2% of the world's crude oil and employs over\n100,000 people, has called for an end to Russia's war in…",
  "data/reddit-stocks/r/stocks/comments/t65ubm/intel_intc_stock_falls_on_morgan_stanley.json": "\"Shares of Intel (NASDAQ: INTC) are down 2% in pre-open Thursday after Morgan\nStanley analyst Joseph Moore downgraded to Underweight from Equal Weight with a\nprice target of $47.00 per share (down from the prior $55.00).\n\nAlthough Moore says he likes the turnaround story that is underway at Intel,…",
  "data/reddit-stocks/r/wallstreetbets/comments/t6hgxw/satire_5_gas_means_new_form_of_essential_workers.json": "As the price of oil approaches 150 a barrel. Gas will approach $5 for 87%\noctane. This will lead to a new form of lockdown. Essential Workers will become\ntruck drivers and logistic drivers. The same way health care workers needed mask\npriority at the beginning of the pandemic. The truck drivers…",
  "data/reddit-stocks/r/stocks/comments/t6n5sv/whos_going_shopping_today.json": "Stocks are getting destroyed yet again, almost everything is in deep discount,\nApple at $161, Google is close to below it's pre-earnings 3 weeks ago, AMD and\nNvidia are close to their 6 month low. What is everyone's buying? Will you wait\nout another week? A month? After the weekend is over?\n\nHigh…",
  "data/reddit-stocks/r/investing/comments/t6ctik/a_snapshot_of_russian_economy.json": "An investment expert goes live on air and says his current career trajectory is\nto work as \"Santa Claus\" and then drinks to the death of the stock market.\n\nWith subtitles.\n\nLink to video\n[https://mobile.twitter.com/peterliakhov/status/1499341576518217730?t=n2y4dLyruYyRKInc2i45lQ&s=08]\non twitter.…",
  "data/reddit-stocks/r/stocks/comments/t6nybh/russia_may_default_passive_funds_still_have_to.json": "Russia could default on its debt as soon as this month, and investors still own\nbillions of dollars of the securities through emerging-market bond funds.\nRussian financial markets have been called “uninvestable” after the country’s\ninvasion of Ukraine was met with sanctions from the U.S., Europe,…",
  "data/reddit-stocks/r/stocks/comments/t6lw6a/average_investors_belief_in_etf_and_chill.json": "It’s pretty apparent that due to many factors like the internet, common\nknowledge, etc. that the average investor has sort of been indoctrinated to\nbelieve in just buying VTI and never selling. Or that when the markets crashing\nthat they should start buying, which maybe has led to this crazy…",
  "data/reddit-stocks/r/wallstreetbets/comments/t6o8rn/jon_stewart_ama_on_wsb_next_monday_march_7th_at.json": "Twatter Link [https://twitter.com/theproblem/status/1499761588219392001?s=21]\n\nJon Stewart is doing an AMA here on Monday to continue the pressure on the\nfuckery going on in Wall St. Check out his latest episode of The Problem with\nJon Stewart regarding the stock market.",
  "data/reddit-stocks/r/stocks/comments/t6rkr9/just_in_russia_blocks_access_to_facebook.json": "https://www.mediaite.com/news/just-in-russia-blocks-access-to-facebook/\n\nRussia has blocked access to Facebook, reported The New York Times on Friday.\n\n“The Russian government has blocked access to Facebook inside the country,\nclaiming the network has engaged in ‘discrimination against Russian…",
  "data/reddit-stocks/r/stocks/comments/t6pxz5/standalone.json": "S&P just announced that all stocks domiciled or based on Russian investments\nwill be removed from all indexes and placed into their own index called\nSTANDALONE. In this manner, the stocks can still exist (they are not even\ntrading in Russia) and not affect other indexes like Emerging Markets.\n\nThis…",
  "data/reddit-stocks/r/stocks/comments/t6sj9e/ukrainian_retail_chains_remove_cocacola_products.json": "https://ua.interfax.com.ua/news/general/807324.html\n\nUkrainian retail chains withdraw from sale the products of the American company\nCoca-Cola Co. due to the continuation of its work in the market of the Russian\nFederation. Thus, the chains stop selling Coca-Cola, Sprite, Fanta,…",
  "data/reddit-stocks/r/wallstreetbets/comments/t6f6lt/bloomberg_goldman_sachs_and_jp_morgan_already.json": "https://www.bloomberg.com/news/articles/2022-03-03/wall-street-is-already-pouncing-on-russia-s-cheap-corporate-debt\n\n> As the U.S. and allies tighten sanctions on Russia and choke off investor\n> demand for its assets, parts of Wall Street are jumping on the buying\n> opportunity that it’s…",
  "data/reddit-stocks/r/stocks/comments/t6g316/rstocks_daily_discussion_fundamentals_friday_mar.json": "This is the daily discussion, so anything stocks related is fine, but the theme\nfor today is on fundamentals, but if fundamentals aren't your thing then just\nignore the theme and/or post your arguments against fundamentals…",
  "data/reddit-stocks/r/stocks/comments/t6vyym/who_else_is_losing_copious_amounts_of_money_the.json": "I read the daily threads and twitter in general and don't seem to get the sense\nothers are getting f'd by this market as much as me.\n\nI'm in banks, travel stocks, reopening plays, a little retail and restaurants.\nAlso have oil which is helping me beat the NASDAQ but otherwise getting screwed.\n\nIs…",
  "data/reddit-stocks/r/Bogleheads/comments/t6qcur/russian_invasion_of_ukraine_impact_on_bogleheads.json": "We're seeing a lot of inquiries about the how this ongoing conflict could or\nwill impact investments\n[https://www.reddit.com/r/Bogleheads/comments/t5njoq/impact_of_mcsi_and_ftse_removing_russian_stocks/].\nFirst, keep in mind that Russia represents less than 0.3% of the global stock\nmarket. Also,…",
  "data/reddit-stocks/r/investing/comments/t6tb61/wall_street_is_pouncing_on_russias_cheap.json": "https://www.bloomberg.com/news/articles/2022-03-03/wall-street-is-already-pouncing-on-russia-s-cheap-corporate-debt\n\nGoldman Sachs Group Inc. and JPMorgan Chase & Co. have been purchasing\nbeaten-down company bonds tied to Russia in recent days, as hedge funds that\nspecialize in buying cheap credit…",
  "data/reddit-stocks/r/Bogleheads/comments/t6ubws/what_do_you_prefer_holding_in_your_taxable.json": "New-ish to investing, recently opened a brokerage account to hold my extra\nsavings after maxing out my Roth. Kinda torn between something like FSKAX for\nexample and an etf like VTI. My understanding is that ETFs are gonna be slightly\nmore tax efficient than a standard mutual fund, but I've also…",
  "data/reddit-stocks/r/wallstreetbets/comments/t6wjax/whenif_the_russian_stock_market_reopens_many.json": "I personally have $1000usd to put in, which might be enough to buy 5-6 large\ncompanies at bare minimum. Yes, you may lose all your US$, but imagine the\nfeeling of being an Oligarch for a few days. Think of the stories you’ll tell\nyour children, assuming the world exists long enough for you to have…",
  "data/reddit-stocks/r/stocks/comments/t72zpx/elon_musk_calls_for_increase_in_us_oil_gas.json": "https://www.foxbusiness.com/politics/elon-musk-calls-for-u-s-increase-in-oil-gas-production-to-combat-russia-despite-negative-effect-on-tesla\n\nHave to hand it to Elon Musk he is not looking at profit when it comes to\nUkraine as this stance will affect his Electric car company negatively.\n\nNow to…",
  "data/reddit-stocks/r/stocks/comments/t6u904/russias_version_of_google_yandex_yndx_warns_it.json": "https://www.cnn.com/2022/03/04/tech/yandex-russia-internet-warning/index.html\n\nRussia's biggest search engine could collapse as financial fallout from the\ninvasion of Ukraine spreads. Yandex (YNDX), which handles about 60% of internet\nsearch traffic in Russia and operates a big ride-hailing…",
  "data/reddit-stocks/r/stocks/comments/t7996j/i_started_investing_in_january_2021_and_now_down.json": "Over the course of 2021 I invested in FB, NFLX, TMUS, DIS, JPM, GS, ADBE, LEN,\nSAM, PYPL, SQ, SHW, BABA, BKNG, SE, SHOP, MRNA, NET, DKNG, PLTR, HD, and NVDA\nand have unrealized losses ranging from 13% to 75% on all these stocks. I bought\nAMZN in March 2021 and SPY/VOO/VTI in July 2021 and those…",
  "data/reddit-stocks/r/stocks/comments/t714y0/in_such_a_bear_market_what_do_you_usually_do.json": "As we all know, the market has been really volatile. It could start with -10%\npremarket and end up +10% post market.\n\nDo most people just look at it everyday and tries to do something about it?\n\nDo you just go away and come back years later?\n\nWhat's ideal for a long term investor?",
  "data/reddit-stocks/r/stocks/comments/t7aamc/nvdia_to_stop_all_product_sales_to_russia.json": "Nvidia on Friday said it’s halting all product sales to Russia following the\ncountry’s invasion of Ukraine. “We are not selling into Russia,” an Nvidia\nspokesperson told PCMag.\n\nThe company didn’t elaborate on why. But the spokesperson said the sales\nsuspension covers all Nvidia products.\n\nOther…",
  "data/reddit-stocks/r/investing/comments/t7b506/on_risk_tolerance_some_people_may_never_invest_in.json": "In the late 90s, I was making a great salary, aggressively saving, living\nfrugally, but for investing was risk averse, by nature. I did not want to lose\nmoney I had earned and saved. I still don't.\n\nFull blown dot com mania rolled around when the globe.com went public in late\n1998. I played around…",
  "data/reddit-stocks/r/stocks/comments/t78uj7/fodn_the_fear_of_doing_nothing.json": "FODN has erased more value from my TD account than any other acronym and it’s\nnot close.\n\nOften times, most often I’d say, doing nothing is best. For example, I’m in the\nshower watching the market per usual. I feel spooked. I feel smarter than I\nreally am. I must dodge the crash. Buying QQQ puts. I…",
  "data/reddit-stocks/r/Bogleheads/comments/t7defr/9_reasons_why_active_investing_is_difficult_9.json": "9 REASONS WHY ACTIVE INVESTING IS DIFFICULT\n[https://www.bankeronwheels.com/9-reasons-why-active-investing-is-difficult/] (9\nCHARTS YOU MUST SEE BEFORE YOU INVEST)\n\n#1: A Few Winners Take It…",
  "data/reddit-stocks/r/stocks/comments/t7ebcm/so_many_opportunities_in_the_stock_market_right.json": "What are you buying right now? I would buy some index funds, but I think they\nare still pretty expensive right now. Maybe some ETFs like SOXX, JETS, IWM, SKYY\nare bargains right now but there are a few of them. What stocks do you at the\nmoment for long-term? I’m buying PayPal, Facebook (more like…",
  "data/reddit-stocks/r/investing/comments/t7es9a/understanding_stock_returns_are_clustered_and.json": "Okay folks out there seem to think (seems logical enough) that stock returns are\nlinear. They get upset when they hold stocks and they don't return like a bond\nor CD whose distributions are set forth in a specific manner specified ahead of\ntime. That is NOT how the stock market rewards its…",
  "data/reddit-stocks/r/investing/comments/t7fq88/can_someone_please_explain_macd_to_me_without.json": "I’m trying learn what the MACD (moving average, convergence, divergences) but\nevery video and articles I find on it explains it like I have a fucking degree\nin astrology because the shit their saying is going right fucking over me.\n\nCan someone please just give me a basic rundown of what it is and…",
  "data/reddit-stocks/r/stocks/comments/t7kz6r/visa_suspends_all_russia_operations.json": "(Bloomberg) -- Visa Inc. is suspending its Russia operations and all\ntransactions initiated with its cards issued in the country will no longer work\nabroad.\n\nAny Visa cards issued by financial institutions outside of Russia will also no\nlonger work within the country, the company said in a…",
  "data/reddit-stocks/r/investing/comments/t7hc25/europe_fears_it_could_be_too_late_to_shake_off.json": "https://www.wsj.com/articles/europe-fears-it-could-be-too-late-to-shake-off-russian-gas-addiction-11646476200\n\nThe European Union gets around 40% of its gas from Russia—and that dependence\nhas grown in recent years. This week, as the West sought to hobble Russia with\nsanctions, the EU was paying as…",
  "data/reddit-stocks/r/investing/comments/t7m8dj/mastercard_suspends_operations_in_russia.json": "https://www.businesswire.com/news/home/20220305005035/en/\n\n\"This decision flows from our recent action to block multiple financial\ninstitutions from the Mastercard payment network, as required by regulators\nglobally.\n\nWith this action, cards issued by Russian banks will no longer be supported…",
  "data/reddit-stocks/r/stocks/comments/t7d4tj/theres_a_difference_between_timing_the_market_and.json": "I think the advice of \"don't time the market\" is actually pretty damn good. Life\nis unpredictable, and the market is often irrational. The notion that you can\nenter and exit perfectly, IMO, is pretty naive.\n\nThat said, I think we've thrown the baby out with the bathwater with this one.\nTiming the…",
  "data/reddit-stocks/r/stocks/comments/t7m87n/mastercard_suspends_operations_in_russia.json": "https://www.businesswire.com/news/home/20220305005035/en/\n\n\"This decision flows from our recent action to block multiple financial\ninstitutions from the Mastercard payment network, as required by regulators\nglobally.\n\nWith this action, cards issued by Russian banks will no longer be supported…",
  "data/reddit-stocks/r/stocks/comments/t7nr77/the_dow_drops_4_weeks_in_a_row_which_bargain.json": "On friday:\n\n\"The Dow Jones Industrial Average dropped 179.86 points, or 0.53%, to close at\n33,614.80. The S&P 500 declined 0.79% to 4,328.87, while Nasdaq Composite moved\ndown 1.66% to 13,313.44.\"\n\nhttps://www.cnbc.com/2022/03/03/stock-futures-rise-slightly-as-investors-brace-for-february-jobs…",
  "data/reddit-stocks/r/stocks/comments/t7czri/i_have_just_started_investing_and_only_buying.json": "Like I said, I'm not trying to get rich the easy or the fast way, Im just trying\nto make sure my money doesnt sit useless and get an insurance for the future.\nThe stock market has to go up eventually right? Then what else can I do?\n\nEdit: Thanks everyone. There are still many stuff I cant really…",
  "data/reddit-stocks/r/stocks/comments/t7r0of/paypal_bagholderfeeling_unmotivatedlost_appetite.json": "Hey I have 1500 share of paypal at $157. And am I down 30%. I looked at the\nfundamentals of paypal its still strong. And the average pe of pypl is 45 and\naverage p/s is 7.5 to 8. Even if we take the lowest of lowest expectations with\n40 pe I still get $185 target and with p/s ratio of even 6 and…",
  "data/reddit-stocks/r/investing/comments/t7gub9/what_are_you_buying_if_theres_a_second_crash.json": "Obviously, if we see anything like the crash from earlier this year, most of\nthem will be a bargain. But what specific stocks would you buy?\n\nI’m inclined to steer clear of travel stocks and financials. Delinquency a\nproblem for the latter. Already pilled into travel and we may see some sort…",
  "data/reddit-stocks/r/stocks/comments/t7pnno/a_lot_of_btdbuy_the_dip_threads_recently.json": "Are we jumping the gun by saying thinking that this is the trough of this\nUkraine war?\n\nU.S and Europe intelligence has mentioned that they believe the \"Worst is yet to\ncome.\"\n\nEven though the DOW has fallen for the 4th consecutive week.The war is only 2\nweeks long, and it seems to me that it will…",
  "data/reddit-stocks/r/stocks/comments/t80xv1/why_were_investors_so_excited_about_ebay_paypal_a.json": "Please help me to what do I not understand?\n\nI've been using Ebay for 24 years now. Amazon and Etsy grew for the last 10\nyears. Last 5 years, FB Marketplace had to eat into the action, also. I believe\nAlibaba also become more popular for certain goods. Also, many boutique sites\nfor certain products…",
  "data/reddit-stocks/r/stocks/comments/t810e0/reuters_2021_foreign_funds_now_own_81_of_all.json": "https://www.reuters.com/article/us-russia-moex-idUSKBN2EZ1XU\n\nI seriously think we’re undermining the repercussions of $MOEX and the heavy\nsanctions imposed on the market. When Russia’s stock market reopens I fear there\nwill be a lot of liquidity and margin issues.\n\n“Foreign funds held 80.7% of…",
  "data/reddit-stocks/r/Bogleheads/comments/t7yj21/another_lucky_edward_jones_client.json": "Hi Everyone, I'm only 42 but have been becoming increasingly interested in\nfinances and believe I now have enough understanding to manage my own money. I\ndon't panic during downturns, in fact, I'll usually purchase a lot more!\nLikewise, I'm not stupid enough to buy some MEME stock. Anyways, about 4…",
  "data/reddit-stocks/r/stocks/comments/t82czn/the_single_biggest_mistake_that_underwater.json": "Thinking their entry price matters means anything.\n\nThis it is not an easy thing to explain. It borders on philosophy, but I will do\nmy best to explain my opinion. If you disagree, that is ok, but I hope to\ngenerate a useful discussion from this, since this situation applies to many\npeople today. I…",
  "data/reddit-stocks/r/investing/comments/t7zia8/russian_creditors_to_be_paid_in_rubles.json": "Putin has signed a decree that creditors will be paid in Rubles according to a\nreport from Bloomberg today. This will apply to sovereign and corporate debtors\npaying countries who are hostile to Russia. List of countries to be published\nlater today. Guess all the NATO countries will be on the…",
  "data/reddit-stocks/r/stocks/comments/t83yl2/buy_oil_and_gas_stocks_now.json": "Is it a good idea to buy energy stocks? I have been hearing two opposing\nopinions on this. 1. Buy now because of the oil price is going up. 2. Take\nprofits or short them because the energy stocks are at ATH.\n\nWhat’s your thoughts on this?",
  "data/reddit-stocks/r/Bogleheads/comments/t82rwh/cousin_is_interested_in_the_boglehead_strategy_im.json": "My cousin recently asked me about my investments and what to do during this\ntumultuous time. I gave him a brief explanation of low-cost index funds, why\nbuying single stocks are bad, time in the market, etc. He's interested and wants\nto follow my advice, but everything is tied up in single company…",
  "data/reddit-stocks/r/Bogleheads/comments/t823ib/vti_vtsax_correct.json": "VTI is the ETF\n\nVTSAX is the mutual fund with a cool name.\n\nThere is virtually no difference between these two, other than a small tax\nbenefit when it comes to ETFs.\n\nBut as far as performance, they will always mirror eachother, am I correct?",
  "data/reddit-stocks/r/stocks/comments/t89z6l/national_average_for_a_gallon_of_gas_in_us_tops_4.json": "https://www.cnbc.com/2022/03/06/national-average-for-a-gallon-of-gas-tops-4-the-highest-price-at-the-pump-since-2008.html\n\nGasoline prices surged to the highest level since 2008 on Sunday, as crude oil\nsupply fears stemming from Russia’s war on Ukraine increase the impact on\nconsumers at the pump.…",
  "data/reddit-stocks/r/wallstreetbets/comments/t85i04/blinken_says_nato_countries_have_green_light_to.json": "https://www.cbsnews.com/news/ukraine-russia-war-fighter-jets-antony-blinken-face-the-nation/\n\nSecretary of State Antony Blinken said Sunday that NATO members have the\ngo-ahead to send fighter jets to Ukraine as the U.S. and allies continue their\nefforts to help Ukraine defend itself against…",
  "data/reddit-stocks/r/Bogleheads/comments/t8akvy/any_reassurances_for_a_young_investor_feeling_down.json": "I'm 19 and the last two years I put basically all my work earnings into VTWAX,\nI've done $9K in contributions total, and I plan on doing another $3K in a month\nor so when I've saved up enough. But damn does it sting to see my account in the\nred when this is not only my first time making my own…",
  "data/reddit-stocks/r/stocks/comments/t8b03s/oil_surges_above_130_sunday_evening_15bbl_vs.json": "(Bloomberg) -- Stocks face a challenging open Monday after the U.S. raised the\nprospect of working with allies to ban imports of Russian oil, a step that could\nstoke the rally in crude and intensify inflationary pressures.\n\nSecretary of State Antony Blinken said Sunday the U.S. and its allies…",
  "data/reddit-stocks/r/wallstreetbets/comments/t8axg2/putin_and_russia_could_trigger_nuclear_apocalypse.json": "> Putin warned this weekend that international sanctions on Russia are \"akin to\n> an act of war,\" and hinted the conflict could spread beyond Ukraine unless the\n> west changes course.\n> \n> But despite the risk of \"civilization-ending global nuclear war\" rising to 10%\n> over the next 12 months…",
  "data/reddit-stocks/r/wallstreetbets/comments/t8d51u/chewy_cofounder_ryan_cohen_takes_large_stake_in.json": "The meme king will reign for 1000 years. You shall not stop him. You will hear\nhis name from generation to generation. No one man should have all that power?\nThis is who Kanye was referring to. Even he has seen what is transpiring in\nfront of our eyes. Ryan Cohen will never be…",
  "data/reddit-stocks/r/investing/comments/t8atr4/oil_likely_headed_higher_over_us_discussing_oil.json": "I expect the market to price in the discussion of banning Russian oil imports,\nsending oil prices higher. The two things I find interesting are how Europe\nfeels pressure from stories of civilian casualties, and the idea of sanctioning\nRussian oil without impacting Russian gas. Until this is…",
  "data/reddit-stocks/r/stocks/comments/t8kwsn/how_red_are_your_portfolios_right_now.json": "I am a relatively new investor - got nervous in January sold everything and\nrealized around -0.5% losses. I invested immediately afterwards, because I\nunderstood that I need to plan long-term, with a new strategy (ETFs World, an\nEurope ETF and Deutsche Bank).\n\nRight now I am at - 8% and tbh it does…",
  "data/reddit-stocks/r/investing/comments/t8j9zf/will_the_united_states_become_energy_independent.json": "A growing question politicians and economists are starting to ask themselves, is\nwill the United States become energy independent? With the ongoing war between\nRussia and Ukraine, the US has sanctioned Russia and is determining whether or\nto impose tougher restrictions on the Russian energy sector,…",
  "data/reddit-stocks/r/stocks/comments/t8gbwk/oil_companies_to_short_soon.json": "I see a lot of people on this sub having some Fomo of missing out on high oil\nprices. I honestly think it’s going to come crashing because I don’t believe\nabove $150 is sustainable. So that brings me to my question..\n\nWhat are some good companies I can buy puts on to take advantage of…",
  "data/reddit-stocks/r/stocks/comments/t8a85u/in_the_11_years_since_it_went_public_tsla_has.json": "In the 11 years since it went public, Tsla has grown 49 times. How much do you\nthink Tsla can grow in the next 10 years?\n\nSince going public in June 2010, Tsla has grown 49 times. The current share\nprice is $839, and the price-earnings ratio is 151 times, which is an ultra-high\nprice-earnings…",
  "data/reddit-stocks/r/stocks/comments/t8kyec/stock_futures_sink_as_us_and_its_allies_consider.json": "U.S. stock-index futures fell sharply after trading began late Sunday, as\ninvestors remain rattled by the ongoing war in Ukraine. Dow Jones Industrial\nAverage futures YM00, -1.70% tumbled more than 400 points, while S&P 500 futures\nES00, -1.77% and Nasdaq-100 futures NQ00, -1.75% each fell more…",
  "data/reddit-stocks/r/wallstreetbets/comments/t8clbx/us_crude_oil_jumps_to_125_a_barrel_a_13year_high.json": "https://www.cnbc.com/2022/03/06/us-crude-oil-jumps-to-125-a-barrel-a-13-year-high-on-possible-western-ban-of-russian-oil.html\n\n> The U.S. and its allies are considering banning Russian oil and natural gas\n> imports, Secretary of State Antony Blinken said in an interview with CNN’s\n> “State of the…",
  "data/reddit-stocks/r/Bogleheads/comments/t8o5u6/my_ira_with_ej_has_7_funds_all_from_the_same.json": "I posted yesterday about leaving Edward Jones and this is a work in progress.\nI'm trying to stage it so that they can't lock me out of my money, and give\nmyself enough time to ensure I've saved all my financial documents from the last\n4 years. The first leg of my succession plan is moving my…",
  "data/reddit-stocks/r/stocks/comments/t8pv9t/uranium_is_poised_to_have_an_incredible_2022.json": "TLDR: Uranium is setting itself up to be on the best performing investment asset\nclasses over the coming years. There are various catalysts that are in place\nright now and on the horizon, with the price of uranium in my view going much\nhigher in 2022 and beyond as the market gets tighter and the…",
  "data/reddit-stocks/r/stocks/comments/t8nahw/here_we_go_again_dow_futures_lost_550_points_what.json": "\"Dow futures lost 549 points, or 1.63%, while S&P 500 futures and Nasdaq 100\nfutures slid 1.46% and 1.55%, respectively.\"\n\nThe international benchmark, Brent crude has increased 6,24% and spiked to\n139,13$ it's highest since 2008.\n\nU.S. oil benchmark, West Texas Intermediate crude futures increased…",
  "data/reddit-stocks/r/stocks/comments/t8oew5/oil_above_130_briefly_what_does_this_mean_for.json": "As we have seen in the news the recent sanctions and possibly new sanctions are\ndriving oil high, causing tightening in supply chains, and increasing inflation.\n\nRecent reports have shown that the American consumer has continued to finance\ntheir life through credit cards that show accelerating debt…",
  "data/reddit-stocks/r/stocks/comments/t8p814/cathie_woods_says_her_fund_will_see_spectacular.json": "spectacular\n\n[ spek-tak-yuh-ler ] adjective- of or like a spectacle\n[https://www.dictionary.com/browse/spectacle]; marked by or given to an\nimpressive, large-scale display.dramatically daring or thrilling:a spectacular\ndive from a cliff.\n\nThe last part got me. lol. Anyone nibbling, or yoloing for…",
  "data/reddit-stocks/r/stocks/comments/t8pj18/how_many_of_you_are_waiting_for_rate_hikes_to_be.json": "It seems quite a few retail investors bough the dip in January and some are down\nsignificantly since then. Others are sticking to DCA strategy, regardless of how\nthe market is doing (I think this is the best approach and the one I prefer).\nIt’s been a gradual pullback, so I’m guessing there are…",
  "data/reddit-stocks/r/wallstreetbets/comments/t8pd4x/the_russian_ruble_is_down_another_23_today_and.json": "Russian Ruble loss - Imgur [https://imgur.com/a/WQaIB3I]\n\nSource: Charlie Bilello op Twitter: \"The Russian Ruble is down another 23% today\nand has now lost 83% of its value against the US Dollar since its peak in 2008.\n$RUBUSD https://t.co/YFMv2LsmlI\" /…",
  "data/reddit-stocks/r/investing/comments/t8rc8w/intels_mobileye_confidentially_files_for_us_ipo.json": "Looks like Intel is spinning off MobilEye. Looks like it may have been a good\ninvestment for Intel since they bought the company for $15.3 billion in 2017.\nAlso, it looks like this is Intel moving to focus on their semi manufacturing\ncore competencies. I wonder if the market is still frothy for…",
  "data/reddit-stocks/r/stocks/comments/t8t9ep/biden_administration_is_moving_ahead_with_a_ban.json": "WASHINGTON, March 7 (Reuters) - The Biden administration is willing to move\nahead with a ban on Russian oil imports into the United States without the\nparticipation of allies in Europe, two people familiar with the matter told\nReuters, after Russia's invasion of Ukraine.\n\nPresident Joe Biden is…",
  "data/reddit-stocks/r/stocks/comments/t8mbgm/rstocks_daily_discussion_monday_mar_07_2022.json": "These daily discussions run from Monday to Friday including during our themed\nposts.\n\nSome helpful links:\n\n * Finviz [https://finviz.com/quote.ashx?t=spy] for charts, fundamentals, and\n   aggregated news on individual stocks\n * Bloomberg market news [https://www.bloomberg.com/markets]\n *…",
  "data/reddit-stocks/r/investing/comments/t8taem/biden_administration_is_moving_ahead_with_a_ban.json": "WASHINGTON, March 7 (Reuters) - The Biden administration is willing to move\nahead with a ban on Russian oil imports into the United States without the\nparticipation of allies in Europe, two people familiar with the matter told\nReuters, after Russia's invasion of Ukraine.\n\nPresident Joe Biden is…",
  "data/reddit-stocks/r/Bogleheads/comments/t8hung/is_it_worth_eating_into_investments_and_emergency.json": "For context I’m a 24m that makes about 73k a year. I’m starting to look into\nbuying my first home with a budget of 250-300k. However, I don’t have enough\ncash for for the 20% down payment to avoid private mortgage insurance. I have\nabout 25k in cash savings (my emergency fund), and about another…",
  "data/reddit-stocks/r/Bogleheads/comments/t8qyj3/hsa_as_an_investment_vehicle.json": "Looking to use my HSA as a long-term investment vehicle (likely have 30 years of\nwork left at least).\n\nWould welcome thoughts on splitting between:\n\nVFIAX VTMGX* (intl)-corrected VSMAX\n\nThinking mostly VFIAX and a mix of the second two. My options for investments\nare limited by the HSA company. I…",
  "data/reddit-stocks/r/Bogleheads/comments/t8vqbx/taxable_accounts_101.json": "TAXABLE ACCOUNT [https://www.bogleheads.org/wiki/Taxable_account] - BOGLEHEADS\nWIKI\n\nBelow is an overview of taxable accounts: when to use one, how investments are\ntaxed, and tax-minimization strategies/tips. It's specific to US investors / tax\nlaws, though some of the general themes might be…",
  "data/reddit-stocks/r/stocks/comments/t8qhy2/stop_panicking_about_big_tech.json": "Nothing has fundamentally changed with any of the stocks that are currently\nfalling, Apple still has a massive cash reserve, as does Microsoft.\n\nThis is a great time to buy stocks at a discount, I can almost guarantee within\ntwo years most of the stocks of big tech will be at ATHs again.",
  "data/reddit-stocks/r/stocks/comments/t8q7n1/palantir_gotham_as_a_military_stock.json": "Hi Everyone,\n\nThe military budgets of all the western countries are increasing vastly and will\nincrease further in the next 5/10 years. In Europe especially some rich\ncountries are doubling their budgets.\n\nMany have started to buy shares of the typical hardware military company (BAE\nSystems, LHM,…",
  "data/reddit-stocks/r/wallstreetbets/comments/t8uo1q/russia_just_became_one_of_the_best_places_for_a.json": "If you've ever wanted to have a mansion for a few thousand in a semi developed\ncountry, now is your chance. It's risky but hear me out. The ruble is down 50%.\nThat means basically no ordinary 9-5 worker can still afford to buy a house\nsince they all just lost half their savings and Russian banks…",
  "data/reddit-stocks/r/Bogleheads/comments/t900bt/investing_in_a_bear_market.json": "Just want some reassurance. With inflation going to direction that it is I am\ncontinuing to make investments into my three fund approach. It’s hard looking at\nit knowing that I’m continuing to lose hundreds of dollars a day in each of my\naccounts. I know it’ll rebound but At times I feel that I’m…",
  "data/reddit-stocks/r/stocks/comments/t90tn1/investors_should_sell_any_stock_market_rally_says.json": "Any rally in the stock market should be taken an as opportunity to sell as\ninvestors are facing a convergence of risk factors that will pose outsized risks\nto the market, Morgan Stanley analysts wrote in a note on Monday.\n\nThe Federal Reserve is unlikely to deviate from its path of raising…",
  "data/reddit-stocks/r/stocks/comments/t91rts/nasdaq_enters_3rd_bear_market_in_35_years.json": "As of todays close the NASDAQ has entered its 3rd bear market in 3.5 years, way\nabove the historical average frequency of bear markets:\n\nLate 2018 - 22% drop\n\nSpring 2020 - 29% drop\n\nSpring 2022 - 20% drop\n\nRemarkably the index is also up around 60% from August 2018 to now.\n\nDoes it mean it's a…",
  "data/reddit-stocks/r/stocks/comments/t90k70/whos_still_green_and_how_so.json": "I see a lot of red posts but even if barely I can't be the only one green and we\nshould discuss more successful strategies than unsuccessful in reddit\n\nI can think of at least a few reasons for some people to be green:\n\n * Started investing in the dip of the 2020 pandemic\n * Started investing now…",
  "data/reddit-stocks/r/stocks/comments/t8oz6c/european_stock_indexes_have_reached_bear_market.json": "For example Germany:\n\nToday also marked the beginning of a new era on the German stock market. As of\ntoday, the DAX is officially in a bear market, meaning that the price losses\nsince its record high of 16,290 points in January amount to more than 20\npercent.\n\n92% of all German stocks in the major…",
  "data/reddit-stocks/r/wallstreetbets/comments/t8mvja/unlike_other_chains_mcdonalds_owns_the_vast.json": "I would stay quiet too with that amount of restaurants. Best part is they are\nall still open and getting \"pressured\" to close in Russia.\n\nhttps://www.google.com/amp/s/www.nytimes.com/2022/03/05/world/europe/russia-food-ukraine.amp.html\n\nEdit: obviously a trap. We should probably invert",
  "data/reddit-stocks/r/wallstreetbets/comments/t924sr/top_5_most_welltimed_stock_purchases_by_us.json": "I've been writing code to track stock trading by US politicians\n[https://www.reddit.com/r/wallstreetbets/comments/rddj7l/in_regards_to_the_pelosi_portfolio_tracker_being/]\nfor a while, and wanted to share a short data update for 2022.\n\nI made a list of the top stock purchases by members of congress…",
  "data/reddit-stocks/r/stocks/comments/t93kpq/losing_a_fortune.json": "Looking for advice from the big boys here. Somehow PayPal and Facebook became\n17% of my portfolio, each. Lost about 20% percent in total, and just dunno what\nto do. I’m here for the long-term, but It’s hard for me to see these stocks\nrecover. I’m holding Intel and Google as well (about 10% each)…",
  "data/reddit-stocks/r/stocks/comments/t97w5b/21_and_finding_it_hard_to_cope_with_my_market.json": "Anyone else in the same boat ? Being so young this loss has really taken a toll\non me and every night I just think about how stupid I am for losing this much. I\ndon’t have rich parents but I am fortunately to have no college debt because of\na merit scholarship . Most of the money I lost was from…",
  "data/reddit-stocks/r/wallstreetbets/comments/t8x6ko/i_havent_checked_my_portfolio_in_days_and_i_feel.json": "All my options expire in 2024. My shares won't ever expire, . I decided to just\nnot check my account since last Thursday and today. And you know what? Feels\namazing. I'm not stressing, I'm not refreshing, I'm not reading news. Dude I\nfeel so calm and I can focus on so many other things now.\n\nI…",
  "data/reddit-stocks/r/investing/comments/t99dty/morgan_stanley_says_russias_set_for.json": "The odds of Russia making its foreign debt payments are diminishing as bond\nprices fall, recession in the nation looms and various payment restrictions pile\nup after the invasion of Ukraine, according to Morgan Stanley & Co.\n\n“We see a default as the most likely scenario,” Simon Waever, the firm’s…",
  "data/reddit-stocks/r/Bogleheads/comments/t96jwp/my_edward_jones_exit_plan_is_nearly_completed.json": "I wanted to thank everyone for all their help over the last couple days. Sorry\nif this is considered a repetitive post but I wanted to keep asking for guidance\nto make sure I'm doing everything by the book. FYI - I currently have a 401k\nwith Fidelity with ~150k in it.\n\n 1. Today, I moved my ~170k…",
  "data/reddit-stocks/r/investing/comments/t8wpjf/were_in_a_bear_market_and_its_going_to_get_worse.json": "TLDR - Even if the war in Ukraine ends tomorrow, we're still going to see\npermanent east-west trade disruption. Over half the major global indices are in\nbear market territory and it can only get worse in the next 12 months. Convince\nme I'm wrong!\n\nOver half of all major market indices are in bear…",
  "data/reddit-stocks/r/Bogleheads/comments/t99nb5/is_there_a_danger_of_etfs_becoming_a.json": "I'm totally on board with the narrative and I love the simplicity. I've just\nbeen pondering the following thought for months and no one I ask seems to have a\ngood answer.\n\nETFs work because they track the total market, but what happens if rather than\ntracking it they start making it. What I mean is…",
  "data/reddit-stocks/r/Bogleheads/comments/t988lm/leaving_our_uncle_financial_advisor.json": "So, my wife’s uncle is our financial advisor. He’s the first person to tell me\nabout finances/investing and has essentially been in control of my wife’s entire\nfamily’s finances for decades. However, over the last 24 months, I’ve become\nobsessed with finances and investing. After reading every book…",
  "data/reddit-stocks/r/stocks/comments/t8t01v/why_are_financial_stocks_doing_so_poorly.json": "I'm getting killed in BAC and AXP, I'm also watching Black Rock and some\ninsurance companies. They all seem to be dropping fast. ADM and COP are the only\nstocks keeping me from some serious loss. What's your take?\n\nEdit: For those of you saying there's a war I'm aware of that, the intention of\nthis…",
  "data/reddit-stocks/r/stocks/comments/t9fi2d/does_anyone_agree_that_the_market_is_oversold.json": "I am aware of the substantial geopolitical tensions at this time, but does\nanyone else think the market is overreacting?\n\nThe current sanctions imposed on Russia by the West won’t significantly affect\nthe majority of US businesses. AMZN is down nearly 20% this year due to an\nincrease in inflation…",
  "data/reddit-stocks/r/stocks/comments/t9ig7n/biden_to_ban_imports_of_russian_oil_over_ukraine.json": "President Joe Biden has decided to ban Russian oil imports, reports said\nTuesday, as he seeks to ratchet up pressure on Moscow in retaliation for its\ninvasion of Ukraine. Ukrainian President Volodmyr Zelensky has pleaded with to\nU.S. and Western officials to cut off the imports, as the Associated…",
  "data/reddit-stocks/r/stocks/comments/t9g4qo/is_now_a_good_time_to_buy_stocks_or_would_you.json": "I’ve always been told to “buy in the dip” but current events seem to not paint a\ncrystal clear picture here. I know no one can predict the future but given the\nrising inflation and the Russian-Ukrainian war, the stock market seems wildly\nunpredictable. What are other fellow investors considering?",
  "data/reddit-stocks/r/wallstreetbets/comments/t9h07v/biden_set_to_ban_us_imports_of_russian_oil_as.json": "https://www.bloomberg.com/news/articles/2022-03-08/biden-set-to-ban-u-s-imports-of-russian-oil-as-soon-as-today\n\nThe Biden administration is poised to impose a ban on U.S. imports of Russian\nenergy as soon as Tuesday without the participation of its European allies,\naccording to people familiar…",
  "data/reddit-stocks/r/stocks/comments/t9jinn/us_gasoline_price_hits_its_all_time_record_with_a.json": "https://www.wsj.com/articles/gasoline-price-hits-record-high-11646730771\n\nU.S. drivers are now paying an average $4.173 a gallon at the pump, AAA says.\n\nThe previous record of $4.114 was reached in July 2008.\n\nThe price increased 15% compared to last week and 21% than the previoues month.\n\nWe can't…",
  "data/reddit-stocks/r/stocks/comments/t9f0t9/berkshire_hathaway_100_portfolio_allocation.json": "Berkshire Hathaway outperformed the S&P 500 in the last 20 years (if not more).\nIts CAGR in is 20%, while the S&P's is 10%.\n\nIf outperformed the it in the last 10 years (306% vs. 206%).\n\nIt outperformed it in the last 5 years (84% vs. 77%).\n\nIt outperformed it in the last 2 years (67% vs. 52%).\n\nIf…",
  "data/reddit-stocks/r/wallstreetbets/comments/t9g3yk/russia_warns_that_if_western_countries_refuse_to.json": "Russian Deputy Prime Minister Alexander Novak said on Monday that if the United\nStates and the European Union banned oil imports from Russia, international oil\nprices could climb to more than $300 a barrel. \"It is clear that rejecting\nRussian oil will have disastrous consequences for the global…",
  "data/reddit-stocks/r/stocks/comments/t9mc4z/every_time_crude_oil_rises_50_a_full_recession.json": "That's right. Every time crude oil prices have rises by 50% of the standard\ndeviation over a 50 yr period, the stock market has experienced a full\nrecession. We are breaking into that ceiling currently and with the Nasdaq\nofficially entering a correction, there is a VERY high probability the…",
  "data/reddit-stocks/r/stocks/comments/t9muug/lmao_this_volatility_is_just_stupid.json": "Any idea how much trading is done by machines nowadays? Remember the debate of\nviral videos and what causes a video to go viral? A tiny surge made at the right\ntime would push algorithms to act and a video would spring to the front of web\npages. The market moves similarly now. This volatility makes…",
  "data/reddit-stocks/r/wallstreetbets/comments/t9mm8e/fuck_you_all_im_never_listening_to_this_sub_again.json": "Yesterday I said we’d see a rally\n[https://www.reddit.com/r/wallstreetbets/comments/t91ebv/tomorrow_we_shall_have_an_amazing_rally_unlike/?utm_source=share&utm_medium=ios_app&utm_name=iossmf]\nlike we’ve never seen before\n\nI was ridiculed and the market went down this morning so I accepted defeat…",
  "data/reddit-stocks/r/stocks/comments/t9jkhg/shop_is_now_trading_below_its_prepandemic_price.json": "Shopify is now trading at 530 on the NYSE, a price it first reached in February\n2020 before the Covid crash.\n\nIf someone correctly predicted the pandemic and bought the stock, they'd be in\nthe red after holding it for two years.\n\nNot sure where I'm going with this, I mainly find it interesting. Any…",
  "data/reddit-stocks/r/investing/comments/t9sacw/putin_is_banning_the_export_of_products_and_raw.json": "From market rebellion, “Putin is banning the export of products and raw\nmaterials until the end of the year” what will this mean for stagflation and the\nUS economy in terms of raw materials? What stocks will benefit?\n\nCommodities may continue their rise up the rest of the year and we are in…",
  "data/reddit-stocks/r/Bogleheads/comments/t9rtud/what_is_the_bogle_way_to_live_in_retirement.json": "Everything I see here is about how 20-40-somethings to save/invest FOR\nretirement. What are we supposed to do once retirement comes. I don't see\nanything in the sidebar links.\n\nMy situation:\n\n10 years into retirement\n\nDefined benefit pension and SS cover all of my expenses for now, with a bit…",
  "data/reddit-stocks/r/stocks/comments/t9ugzd/oil_price_spike_nearing_demand_destruction_levels.json": "Oil prices are so high that \"we are encroaching upon the area of demand\ndestruction,\" ConocoPhillips (NYSE:COP) CEO Ryan Lance told Bloomberg in an\ninterview at the CERAWeek by S&P Global energy conference in Houston.\n\nCrude oil futures racked up their highest settlements since 2008 on…",
  "data/reddit-stocks/r/stocks/comments/t9teup/friendly_reminder_that_nobody_neither_the_bears.json": "Recently, everyone seems to have become an overnight expert on geopolitics,\nnational wars, federal monetary policy, the effect of inflation on the economy,\nand the oil and energy industries. Many people are convinced that the market is\ndoomed, and that we are just at the start of a total…",
  "data/reddit-stocks/r/stocks/comments/t9s972/putin_is_banning_the_export_of_products_and_raw.json": "From market rebellion, “Putin is banning the export of products and raw\nmaterials until the end of the year” what will this mean for stagflation and the\nUS economy in terms of raw materials? What stocks will benefit?",
  "data/reddit-stocks/r/stocks/comments/t9u81x/from_3700_to_2700_amazon_took_4_months_when_do.json": "From $2,700 to $3,700, Amazon took a year; from $3,700 to $2,700, Amazon took 4\nmonths. The rate of decline is always fast.\n\nAmazon currently trades at 41 times earnings, with a market cap of $1.38\ntrillion, and operating income has grown 21% year over year.\n\nThe Nasdaq is still down sharply today,…",
  "data/reddit-stocks/r/stocks/comments/t9sxxz/iconic_us_brands_cocacola_pepsi_and_mcdonalds.json": "https://www.cnbc.com/2022/03/08/coca-cola-follows-mcdonalds-starbucks-in-suspending-business-in-russia.html\n\nPepsiCo, Coca-Cola, McDonald’s and Starbucks each said Tuesday they are\nsuspending business in Russia after that country’s invasion of Ukraine, a\nsymbolic step-back by four iconic U.S.…",
  "data/reddit-stocks/r/investing/comments/t9sxj6/iconic_us_brands_cocacola_pepsi_and_mcdonalds.json": "https://www.cnbc.com/2022/03/08/coca-cola-follows-mcdonalds-starbucks-in-suspending-business-in-russia.html\n\nPepsiCo, Coca-Cola, McDonald’s and Starbucks each said Tuesday they are\nsuspending business in Russia after that country’s invasion of Ukraine, a\nsymbolic step-back by four iconic U.S.…",
  "data/reddit-stocks/r/wallstreetbets/comments/t9tra1/im_down_31000_in_the_last_six_months_4_bd_apt_in.json": "Loss porn here [https://i.imgur.com/0rHwWqd.png]\n\nI save everything that I earn, never eat outside, live with my parents in my\nlate 20's to save money, and earn a good salary. We are never going to catch up\nto the wealth of the old idiots who bought apartments back when it was possible.",
  "data/reddit-stocks/r/stocks/comments/t9dxwo/rstocks_daily_discussion_technicals_tuesday_mar.json": "This is the daily discussion, so anything stocks related is fine, but the theme\nfor today is on technical analysis (TA), but if TA is not your thing then just\nignore the theme and/or post your arguments against TA…",
  "data/reddit-stocks/r/Bogleheads/comments/t9uh5x/could_we_be_entering_a_lost_decade.json": "The traditional advice has always been to DCA into a broad market ETF and have a\nlong term view.\n\nThis advice worked great when the Fed was always there to bail out the markets.\nHowever this time, interest rates are already at 0 and inflation is high. In all\nprevious recessions /crashes, the Fed…",
  "data/reddit-stocks/r/wallstreetbets/comments/t9xnk7/were_fudged_gas_to_10gallon_the_saudis_and_uae.json": "But they did take one from Putin.\n\nhttps://www.wsj.com/articles/saudi-emirati-leaders-decline-calls-with-biden-during-ukraine-crisis-11646779430",
  "data/reddit-stocks/r/stocks/comments/t9w3o7/do_i_keep_investing_in_the_sp_500.json": "I’ve been investing a little bit every week for about 6 months now. I’ve seen a\nloss of ~8.5%. I know the golden rule is to buy and hold, which I plan on\nholding, but should I stop buying and try growing my money elsewhere?\n\nEdit: my plan was to buy and sell in a couple years to help for a down…",
  "data/reddit-stocks/r/stocks/comments/t9y0er/oil_executives_and_insiders_are_selling.json": "According to most recent reports, the following Oil & Gas Insiders have sold\ntheir personal holdings:\n\n$CIVI CFO & Dir\n\n$CLR Pres & VP\n\n$DVN Dir, CAO, VP\n\n$FANG VP, Dir, VP, COO\n\n$MUR CEO & VP\n\n$PDCE CEO, VP, Dir & CFO\n\n$PXD CEO, VP, Dir, CAO\n\nThis is on the backdrop of oil prices spiking in the…",
  "data/reddit-stocks/r/stocks/comments/t9zleo/us_politicians_loaded_up_on_energy_stocks_right.json": "Numerous politicians bought energy plays BEFORE their run ups, and general\ndiscussions on banning Russian oil. Many are on committees privy to private\ninformation, including Defense and Energy. Many had not purchased energy plays\nbefore.\n\nJust Some Examples:\n\nMarjorie Taylor Greene bought American…",
  "data/reddit-stocks/r/investing/comments/t9zmfr/us_politicians_loaded_up_on_energy_stocks_right.json": "Numerous politicians bought energy plays BEFORE their run ups, and general\ndiscussions on banning Russian oil. Many are on committees privy to private\ninformation, including Defense and Energy. Many had not purchased energy plays\nbefore.\n\nJust Some Examples:\n\nMarjorie Taylor Greene bought American…",
  "data/reddit-stocks/r/wallstreetbets/comments/t9vtyw/the_end_of_markets_the_fed_cannot_control_what.json": "Evidence shows that the P.P.T. (U.S. Gov't's Plunge Protection Team)'s trading\ndesk is working behind the scenes to attenuate the rate of decline of global\nmarkets. Even with this support, all markets are plummeting, and commodities\nmarkets [and nickel, and wheat, etc] are being prevented from free…",
  "data/reddit-stocks/r/Bogleheads/comments/ta1od3/any_take_on_ray_dalios_new_book_and_youtube_video.json": "Link to video - https://www.youtube.com/watch?v=xguam0TKMw8\n\nTrying to get experts' views on that and how we should be planning for the US\nnot being a world superpower anymore?",
  "data/reddit-stocks/r/Bogleheads/comments/ta54uc/is_there_a_bogle_approach_to_fire.json": "How would things change with the three-fund portfolio if looking at retiring in\n10 years and needing the money to last 40-50 years?",
  "data/reddit-stocks/r/investing/comments/tabd45/is_todays_jump_begin_of_rally_or_a_trap.json": "How do you see today's big jump both in Europe (+7%) and in the US (+2%)? Is it\nthe beginning of a turnaround and rally or could it be a trap? The bull news\ntoday is that Europe seems to have enough natural gas to make it through the\nwinter even if Putin would cut them off.\n\nHowever there are still…",
  "data/reddit-stocks/r/Bogleheads/comments/tabn0z/investing_when_the_future_doesnt_seem_too_bright.json": "How do you guys go about with the thoughts about how the future will look like\nwhile investing? I invested into my roth IRA last year (full $6,000 in November)\nand continue to make my 401k contributions as a 22 year old and I can't get over\nthe thought that by the age of 60 will earth still be…",
  "data/reddit-stocks/r/stocks/comments/tacyy2/report_microsofts_activision_blizzard_deal_being.json": "> Three investors are being investigated for insider trading in relation to\n> Microsoft's acquisition of Activision Blizzard.\n> \n> The Wall Street Journal reports\n> [https://www.wsj.com/articles/u-s-probes-options-trade-that-gained-on-microsoft-activision-deal-11646787000?mod=hp_lead_pos2]\n> that…",
  "data/reddit-stocks/r/stocks/comments/tadtf5/draftkings_ceo_says_people_selling_his_companys.json": "DraftKings Inc. DKNG, 3.16% CEO Jason Robins vows that people who are selling\nhis company’s stock will “regret that decision.”\n\nRobins wrote this message on Twitter TWTR, 4.85% on Tuesday as DraftKings stock\ncontinued its recent slump.\n\n“If you sold #DKNG today, just be aware that my team and I are…",
  "data/reddit-stocks/r/wallstreetbets/comments/ta8xpe/russia_warns_the_west_our_sanctions_will_hurt_you.json": "The Russian government today warned that it was working on a retaliatory\nresponse to US energy sanctions on Russia.\n[https://www.msn.com/en-us/news/world/kremlin-tells-united-states-to-await-response-to-economic-war/ar-AAUPbhy?ocid=entnewsntp&pc=U531]\nSo that begs the question as to what Russian…",
  "data/reddit-stocks/r/stocks/comments/taigkw/amazon_announces_a_201_stock_split.json": "The last time Amazon dished out a stock split was back in 1999, when two shares\nwere exchanged for every one share in investors' hands to push its price down to\naround $60.\n\n\n\nI for one am very surprised given Bezos' opinion on splits. I wonder if the\nAlphabet split had any influence.\n\n\n\nAlso…",
  "data/reddit-stocks/r/investing/comments/taihkg/amazon_announces_a_20_for_1_stock_split_of.json": "Amazon announces a 20 for 1 stock split of company’s common stock, effective\nJune 6th\n\nFrom market rebellion\n\nAfter 2 years of sideways action, I think it will finally happen for them and\ngoogle (which has done much better) to finally start to see some positive\nmomentum and upswing in this stock in…",
  "data/reddit-stocks/r/stocks/comments/tahqox/crowdstrike_earnings_the_growth_continues.json": "Record net new ARR of $217 million with growth accelerating for the second\nconsecutive quarter\nEnding ARR grows 65% year-over-year to exceed $1.7 billion\n\nRecord operating and free cash flow for the second consecutive quarter, bringing\noperating and free cash flow for the fiscal year to a record…",
  "data/reddit-stocks/r/Bogleheads/comments/taoj4o/can_someone_please_help_me_alleviate_the_anxiety.json": "I've never in my life invested beyond my 401k and my Roth IRA. I'm 26. I had\nboth my 401K and Roth IRA maxed out, realized I had ~50k laying around in a\nsavings account doing absolutely nothing, and decided it was time to change\nthat. So back in December, I thought fuck it: I'm going to find a fund…",
  "data/reddit-stocks/r/wallstreetbets/comments/tanb4w/sony_just_single_handedly_made_putin_regret_the.json": "https://www.cnbc.com/2022/03/09/sony-suspends-all-playstation-sales-in-russia-over-ukraine-war.html\n\nJust watch. Tomorrow, all hell breaks loose. Playstation sales may be suspended\nin Russia, but not torches and tridents. Because that’s what the gamers of\nRussia are going to be marching onto the…",
  "data/reddit-stocks/r/wallstreetbets/comments/taif1t/amazon_doing_the_splits_201.json": "Amazon announces 20-for-1 stock split, $10 billion buyback\nhttps://www.cnbc.com/2022/03/09/amazon-announces-20-for-1-stock-split-10-billion-buyback.html?__source=iosappshare%7Ccom.apple.UIKit.activity.CopyToPasteboard\n\nEdit: Amazon up 9 percent on news lollllll\n\nDouble Edit: They are also raising…",
  "data/reddit-stocks/r/stocks/comments/tam1nx/what_does_everyone_see_in_block_sq.json": "Block Stock has an awful risk/reward ratio.\n\nWithout Bitcoin Revenue and Cost of Bitcoin Revenue (A seemingly strange\naddition to a financial statement), Block has only 7.6b in revenue for FY21.\nWhile growth is still seemingly good, gross profit margins are 24.39%, and net\nmargins are…",
  "data/reddit-stocks/r/Bogleheads/comments/taobrj/considering_moving_to_vt_from_vti_vea_vwo_in_the.json": " 1. I read a lot about this and understand I won't get the foreign tax credits.\n    From what I read it seems pretty negligible. But what exactly is it? (I'm in\n    a very low tax bracket).\n 2. Right now I'm at 5 basis points. I'd be going to 8, so while the extra 3 is\n    something; the way I…",
  "data/reddit-stocks/r/stocks/comments/tayrqr/usd_inflation_surges_79_on_an_annual_basis.json": "The Consumer Price Index for All Urban Consumers (CPI-U) increased 0.8 percent\nin February on a seasonally adjusted basis after rising 0.6 percent in January,\nthe U.S. Bureau of Labor Statistics reported today. Over the last 12 months, the\nall items index increased 7.9 percent before seasonal…",
  "data/reddit-stocks/r/investing/comments/taz6p1/cpi_rises_8_in_february_79_over_last_12_months.json": "https://www.bls.gov/news.release/cpi.nr0.htm\n\nYou can see a very specific breakdown per item here:\nhttps://www.bls.gov/news.release/cpi.t02.htm\n\n> The Consumer Price Index for All Urban Consumers (CPI-U) increased 0.8 percent\n> in February on a seasonally adjusted basis after rising 0.6 percent…",
  "data/reddit-stocks/r/stocks/comments/taxuzu/the_mother_of_all_supply_shocks_brewing_for.json": "Russia will ban the export of certain commodities within hours. (\nhttps://www.google.com/amp/s/www.wsj.com/amp/articles/russia-set-to-ban-commodity-exports-following-western-sanctions-11646768260\n). They did not specify which commodities they will regulate this way, this will\nbe a counter-sanction…",
  "data/reddit-stocks/r/Bogleheads/comments/tb2xc8/if_boglehead_philosophy_is_the_long_run_lazy.json": "Isn't anything outside of index funds essentially gambling, right?",
  "data/reddit-stocks/r/investing/comments/tb59y2/lol_it_begins_bloomberg_the_fed_needs_to_delay.json": "Via Bloomberg\n[https://www.bloomberg.com/opinion/articles/2022-03-10/ukraine-war-should-cause-fed-to-slow-down-its-rate-hikes?sref=q1j4E2z1]\n(non-paywall link at archive.is [https://archive.ph/7zYIA]):\n\n> The U.S. Federal Reserve is widely expected to raise interest rates by at\n> least a 25 basis…",
  "data/reddit-stocks/r/Bogleheads/comments/tb7a2y/swing_trading_dad_update.json": "Original Post:\nhttps://www.reddit.com/r/Bogleheads/comments/qi4d3s/my_dad_is_literally_gambling_with_swing_trades/?utm_medium=android_app&utm_source=share\n\nI was supposed to update you all in a year but might aswell do it now\nconsidering the state of the market. All his profits have been wiped out.…",
  "data/reddit-stocks/r/Bogleheads/comments/tb32i9/emerging_markets_down_19_ytd_any_insight_on_why.json": "I've searched online and couldn't see any commentary on the big dip that EMs are\nsuffering. Is this all part of Ukraine and COVID reeking havoc, do you think?\n\nI'm not worried or anything; I'm just interested, especially as it doesn't seem\nto be a topic of conversation despite the large dip.",
  "data/reddit-stocks/r/stocks/comments/tavtns/rstocks_daily_discussion_options_trading_thursday.json": "This is the daily discussion, so anything stocks related is fine, but the theme\nfor today is on stock options, but if options aren't your thing then just ignore\nthe theme and/or post your arguments against options…",
  "data/reddit-stocks/r/wallstreetbets/comments/tb59ks/lol_it_begins_bloomberg_the_fed_needs_to_delay.json": "Via Bloomberg\n[https://www.bloomberg.com/opinion/articles/2022-03-10/ukraine-war-should-cause-fed-to-slow-down-its-rate-hikes?sref=q1j4E2z1]\n(non-paywall link at archive.is [https://archive.ph/7zYIA]):\n\n> The U.S. Federal Reserve is widely expected to raise interest rates by at\n> least a 25 basis…",
  "data/reddit-stocks/r/stocks/comments/tbb6rk/rivian_shares_tumble_as_supplychain_woes_cut.json": "By Akash Sriram and Paul Lienert\n\n(Reuters) - Rivian Automotive Inc ( RIVN ) warned on Thursday that supply-chain\nissues could cut its planned production in half in 2022 to 25,000 vehicles,\nsending shares of the EV maker down nearly 12% in extended trading.\n\nRivian made about 200 fewer vehicles…",
  "data/reddit-stocks/r/Bogleheads/comments/tbcap0/farewell_edward_jones.json": "I have been posting over the last few days about my growing disdain toward\nEdward Jones and their ridiculous fees. I guess it was okay at first since they\ndid get me started and freed me from a life of CDs and savings account. Hell, I\nwould've missed a lot of returns over the last 4 years with all…",
  "data/reddit-stocks/r/stocks/comments/tbfw38/treasury_secretary_janet_yellen_says_americans.json": "https://www.cnbc.com/2022/03/10/treasury-secretary-janet-yellen-says-inflation-could-be-high-for-a-year.html\n\nTreasury Secretary Janet Yellen said Thursday that Americans will likely see\nanother year of “very uncomfortably high” inflation as Russia’s invasion of\nUkraine muddles her prior forecast…",
  "data/reddit-stocks/r/wallstreetbets/comments/tbboau/deutsche_bank_defends_decision_not_to_exit_russia.json": "https://www.cnbc.com/2022/03/10/deutsche-bank-says-not-practical-to-exit-russia-business.html\n\nWithout doing options, my broker knows I am a retard, how can one profit from\nDB's decision which I bet will be roundly panned. Surely sanctions will force\nthem to divest, for even less.",
  "data/reddit-stocks/r/Bogleheads/comments/tbdczl/stupid_and_got_hosed_for_almost_50k_in_vanguard.json": "Using a throwaway account due to embarrassment. 2 separate Vanguard taxable\nbrokerage accounts. Over 70. Vanguard Target Retirement 2025 Fund (VTTVX) and\nVanguard Target Retirement 2020 Fund (VTWNX). My fault. Inheritance and I\nthought I was good to go doing it on my own. This has been the most…",
  "data/reddit-stocks/r/stocks/comments/tbepq6/can_anyone_present_the_bear_case_for_nvidia.json": "I’m a super bull on Nvidia, and I want to hear bear cases. I won’t lay out the\nbull case now (maybe in the comments), but I want to hear legitimate long term\nbear cases for Nvidia. Nothing about Russia-Ukraine or interest rates, because\nthose are near term headwinds. I’m just trying to create a…",
  "data/reddit-stocks/r/investing/comments/tb45ts/build_a_bear_crushes_their_numbers_from_last_year.json": "I’m confused to say the least. They increased their guidance sometime in\nFebruary and the only explanation is that they didn’t beat expectations because\nthey were so high. Otherwise, they had a revenue surprise of over 300% and a\nmassive jump in EPS over Q3 among other very positive news.\n\nWhat am…",
  "data/reddit-stocks/r/wallstreetbets/comments/tbbx3f/what_happened_to_all_the_lossporn_and_gainsporn.json": "I came here to jack off to gains and loss porn, not read about a bunch of\nspeculative news articles with no positions posted. What happened to this place?\nThere appears to have been zero flaired gainsporn and lossporn within the past\nweek.\n\nI want to see RIVN and DOCU gainsporn and lossporn,…",
  "data/reddit-stocks/r/Bogleheads/comments/tb9aqm/does_it_concern_any_bogleheads_that_over_95_of.json": "We had 800 Billion before then, and 25 Trillion now. this definitely played a\nhuge part in the crazy bull run we saw for the last 13 years. Does anyone get\nconcerned about how markets will react after the FED stops printing money?",
  "data/reddit-stocks/r/stocks/comments/tbgjlw/6k_in_roth_ira_then_whats_next.json": "I’m 31 and just opened a Roth IRA account. I contributed 6k and then… what’s\nnext?\n\nUsing Fidelity & I bought DIS stocks for $1k… just because. TBH, I don’t know\nwhat I’m doing. Is this something wrong ? Where should I invest for Roth?\n\nPlease, any wise advise would do.",
  "data/reddit-stocks/r/investing/comments/tbjtzy/in_1994_jeff_bezos_noticed_the_internet_was.json": "In 1994, Jeff Bezos famously spotted a stat that made him leave his high-paying\nPE job to start Amazon: The Internet was growing 2300% per year. What are some\ngeneration-defining stats of today that can tell us where we should be investing\nour money for the future?\n\nI'll post a few to kick things…",
  "data/reddit-stocks/r/stocks/comments/tbjuon/what_are_some_future_social_and_economic_trends.json": "In 1994, Jeff Bezos famously spotted a stat that made him leave his high-paying\nPE job to start Amazon: The Internet was growing 2300% per year. What are some\ngeneration-defining stats of today that can tell us where we should be investing\nour money for the future?\n\nI'll post a few to kick things…",
  "data/reddit-stocks/r/Bogleheads/comments/tbredy/3fund_portfolio_vs_tdf.json": "I am starting out new and wanted recommendation on choosing from 401K investment\noptions available to me. I am currently in Vanguard Target 2055 (54/36/10) but\nam wondering if should instead do a 3-fund portfolio.\n\n|**Name**|**Asset Class**|**Category**|**Gross Expense Ratio****|\n\n:--|:--|:--|:-…",
  "data/reddit-stocks/r/stocks/comments/tbtkyc/berkshire_hathaway_brka_continues_to_set_ath_each.json": "How is this possible? What is driving this stock to hit an all-time high each\nmonth for the last 5 months while what seems like everything else has been in a\ndowntrend? Would love to hear your thoughts.",
  "data/reddit-stocks/r/investing/comments/tbdw7z/is_this_the_renewal_of_renewables.json": "After a massive rise in 2020 on Biden's election, green energy took a beating\nlast year due to the GOP Senate's blocking of Build Back Better. Now Russia's\ninvasion of Ukraine and energy-extortion of Europe seems to be reminding\neveryone that oil and gas addiction is a bad idea for multiple…",
  "data/reddit-stocks/r/investing/comments/tbs8xe/what_are_some_good_questions_to_ask_my_portfolio.json": "I have a review of my portfolio today and wanted to get an idea of some good\nquestions to ask to ensure they are managing it properly. I also want to get\ntheir sense of the market and how they have my portfolio positioned to mitigate\nany risks that are ongoing and may be coming. I sometimes wonder…",
  "data/reddit-stocks/r/stocks/comments/tbtzs1/goldman_cuts_us_gdp_forecast_as_it_says_recession.json": "The U.S. stock market put in a resilient performance on Thursday, given the data\nshowing inflation surging to a new 40-year high even before the impact of the\nrecent sanctions on Russia, what appeared to be a pretty dismal result from the\nRussian-Ukrainian meeting of foreign ministers in Turkey,…",
  "data/reddit-stocks/r/Bogleheads/comments/tbsxyf/illinois_doesnt_apply_state_income_tax_to_roth.json": "TLDR: Illinois does not apply it's state tax to Roth conversions.\n\nSharing this as I got tremendous help here about converting my Simple IRA to a\nRoth a few months back. Originally I thought I couldn't convert my Simple IRA's\ndue to the pro-rata rule, though you guys made me realize I was…",
  "data/reddit-stocks/r/investing/comments/tbrqac/wont_western_companies_have_to_write_down_russian.json": "All these companies walking away from huge $ of assets from McDonald's to\nVolkswagen and Putin seizing them... won't they have to write down their value ?\n850 locations avg book value (say) $500K = $400+M ? (and 130 Starbucks and a\ngiant Volkswagen factory and ...)\n\nwhat about their lenders ? what…",
  "data/reddit-stocks/r/stocks/comments/tb7vuu/alibaba_bullish.json": "A close friend of mine Just bought a couple hundred Alibaba shares. Today was\nquite bad but at a 100 dollars Baba is starting to look undervalued. Its been a\ntough year for Baba holders. What are your thoughts on Baba?",
  "data/reddit-stocks/r/Bogleheads/comments/tbwq9f/should_i_pause_on_contributing_to_my_taxable.json": "I want to purchase a home ideally in the next 5 years but I have been putting\nall my money into my 401k, ROTH, and taxable brokerage accounts ever since I\nstarted working (29 years old at the time of this post). I am starting to look\ninto things like bonds in order to start parking my money for a…",
  "data/reddit-stocks/r/stocks/comments/tbna7o/rstocks_daily_discussion_fundamentals_friday_mar.json": "This is the daily discussion, so anything stocks related is fine, but the theme\nfor today is on fundamentals, but if fundamentals aren't your thing then just\nignore the theme and/or post your arguments against fundamentals…",
  "data/reddit-stocks/r/stocks/comments/tc8qmg/the_current_hivemind_and_why_you_should_be_careful.json": "It reminds me of browsing this sub exactly 2 years ago (all over again). At that\ntime, while we were dropping during covid the overwhelming consensus was \"This\nis just the beginning of the mother of all crashes\" and \"Crash? The stock has\nonly down to where it was in 2016. We're going a lot lower,…",
  "data/reddit-stocks/r/stocks/comments/tc55qf/might_it_be_time_to_buy_fintech.json": "Fintech was down big today despite many of these names already being down 60-70%\nfrom their highs.\n\nI was looking at $UPST earlier and if you take the run rate of their Q4 earnings\nthey have a PE of around 35 which seems very reasonable for a profitable company\nprojecting strong growth in 2022. I…",
  "data/reddit-stocks/r/investing/comments/tc6vdb/is_meta_fb_on_sale_right_now_or_a_plague_to_be.json": "FB has been one of the successful tech stocks for a long time now. It's only 187\na share with a high of 378. I don't see why it would tank. They have adapted and\ncontinue to acquire new apps and platforms. With the metaverse coming I can see\nthat also adding a lot of value in ways we can't really…",
  "data/reddit-stocks/r/investing/comments/tc8sea/is_it_worth_it_to_maximize_my_2021_roth.json": "Currently I have an automatic portfolio at fidelity and it’s doing pretty well\nall things considered. I just started getting into the investment seen like 4-5\nmonths ago so I don’t have my 2021 roth contribution maxed yet.\n\nDo you think it’s worth it to put every available sent into my 2021 Roth…",
  "data/reddit-stocks/r/investing/comments/tc5l22/some_perspective_for_anybody_getting_wrecked_by.json": "I come bearing the scars of this turbulent market and I wanted to offer guidance\nfor people struggling with the psychology of getting crushed.\n\nYes, I’ve made mistakes and my account is nearly cleaned out but I realized\nthere are still highlights. It’s important to take stock of the blessings…",
  "data/reddit-stocks/r/Bogleheads/comments/tcdegz/home_bias_for_nonamericans.json": "I believe in “VT and chill”, getting ~60% US and ~40% international. However, I\nbelieve this approach is way easier for Americans since you guys are getting 60%\nof your home country. Me on the other side, is from a country that has 1% of\nMSCI World index. I can buy my own country index a bit…",
  "data/reddit-stocks/r/Bogleheads/comments/tcbdr7/if_you_had_6070k_in_cash_would_you_invest_it_in.json": "As the title of the post says, if you had 60,000-70,000 USD in your account,\nwould you immediately invest it into your favourite index fund/ETF, regardless\nof the current stock price for the said fund, or would you rather spread your\ntransactions over at least a few months by investing a few…",
  "data/reddit-stocks/r/stocks/comments/tcgmib/there_is_a_lot_of_wild_conspiracy_nonsense_in.json": "Fears of government seizing assets because of clear sanctions enforced against\nRussian oligarchs. Talk of piling into commodities because the global economy is\nsurely crashing. More talk of rigged markets because greedy idiots are trying to\npile into cheap Russian assets or oil at the very top and…",
  "data/reddit-stocks/r/stocks/comments/tchdta/are_there_any_high_growthhigh_valuation_stocks.json": "My new positions are: Nvidia at 215, AMD at 106, Square/Block at 103, TSM at\n102, SOFI at 8.77, SnowFlake at 180, Spotify at 125, and PayPal at 110.\n\nOther stocks that have fallen from their highs, but aren't really that high\ngrowth/high PE include: Apple at 156, Microsoft at 280, 3M at 141, Intel…",
  "data/reddit-stocks/r/investing/comments/tcl07x/chip_shortage_ukraine_gas_prices_recession.json": "All the markets, especially crypto, are getting hammered. I'm probably wrong but\nit seems the biggest cause is the chip shortage followed by the war in Ukraine\nand gas prices. People are pulling out of the markets and either are holding\ncash or buying homes. Chip shortage may be resolved by 2023,…",
  "data/reddit-stocks/r/Bogleheads/comments/tcaldt/this_is_a_first_for_me.json": "My portfolio is taking such a beating I stopped watching CNBC and Bloomberg. I\nno longer read Baron's and the WSJ; investing porn is no longer fun. I'm now\nwatching the war and the Price is Right; \"come on down.\"\n\nIn other words I'm just stand there and doing nothing.",
  "data/reddit-stocks/r/stocks/comments/tcl6dy/mcdonalds_says_russian_shutdown_will_cost_the.json": "McDonald’s expects its Russian shutdown will cost the fast-food giant roughly\n$50 million a month until it reopens its restaurants there. The Chicago-based\ncompany announced Tuesday it would temporarily shutter its Russian locations as\nRussian President Vladimir Putin’s forces continue their…",
  "data/reddit-stocks/r/Bogleheads/comments/tcntlk/is_my_son_right.json": "Husband and I recently inherited invested funds. Some are in an IRA that we need\nto withdraw over 10 years. Other funds are in a joint tenant brokerage account.\nAll funds were invested for long term growth with very low risk, so mostly bonds\nand one USAA income and growth fund. Our son is…",
  "data/reddit-stocks/r/stocks/comments/tc9dz8/ford_is_looking_cheap.json": "Ford is, by my estimation, the legacy car maker in the best position to capture\nEV sales in the future.\n\nI have three basic premises:\n\n 1. Ford is likely one of the top two companies in the US in terms of EV\n    positioning, second only to Tesla.\n 2. EV automotive manufacturing and marketing is…",
  "data/reddit-stocks/r/stocks/comments/tcmusl/how_much_of_a_rip_will_there_be_if_the_ukraine.json": "I'm thinking a solid %5 in the S&P.\n\nSay.... from 4200 to around 4400 over the course of a few weeks.\n\nOnce things start to head back up, there is a ton of cash that will come into\nthe market. Just need a catalyst like the war ending.",
  "data/reddit-stocks/r/Bogleheads/comments/tcia3k/hsa_in_california.json": "I'm 27 and have an HDHP as of this year. I opened an HSA account with Fidelity\nand almost maxed my $3,600 contribution limit to a FIDELITY FREEDOM INDEX 2060\nINVEST (target retirement fund).\n\nI just noticed that my contributions are not deductible and earnings are taxable\nfor California state…",
  "data/reddit-stocks/r/wallstreetbets/comments/tcqov5/this_is_how_the_financial_world_ends.json": "So, this week, we saw the start of the total collapse of the modern financial\nsystem and the end of the Bretton Woods era of international monetary policy.\n\nBold claim, yeah baby? You're probably thinking this has to do with the war in\nUkraine or something, right? Well, it does a little bit, but…",
  "data/reddit-stocks/r/stocks/comments/tcnl0g/share_your_most_valuable_investment_tips_and.json": "Haven't been investing for a long time so would like to learn from other's\nlessons to avoid possibly making the same mistakes.\n\nI understand that investing long term seems to be the best strategy and I'm\navoiding cfds and levarages.\n\nAlso been watching youtube videos and reading internet stuff to…",
  "data/reddit-stocks/r/investing/comments/tcp8qh/things_are_going_to_get_a_lot_worse_before_they.json": "Ive been bullish for a long time despite even the pandemic. I was confident the\nFED would do the right thing and raise rates, and the government would chill the\nfuck out with the spending. (Monetary and fiscal policy).\n\nWell, after seeing inflation data and the governments response, I’m…",
  "data/reddit-stocks/r/Bogleheads/comments/tcro3g/all_my_faqs_i_have_done_so_far.json": "FAQ's\n\nIf You Can by William Bernstein (Basic Bogle 3 Fund/TDF Portfolio)\n\nhttps://www.etf.com/docs/IfYouCan.pdf\n\nWhy Own Gold?\n\nhttps://www.reddit.com/r/Bogleheads/comments/shtvc3/why_own_gold/\n\nOverbalancing\n\nhttps://www.reddit.com/r/Bogleheads/comments/sjr59f/overbalancing/\n\nDCA/Lump…",
  "data/reddit-stocks/r/stocks/comments/tc8ssi/should_probably_pin_this_echo_chambers_in.json": "Source:\nhttps://www.microsoft.com/en-us/research/wp-content/uploads/2017/03/investment-echo-chambers.pdf\n\nTL;DR: Following investment message boards has no correlation with better\ninvestment performance, but does get you to trade more often, which has a\nnegative impact on performance. The study…",
  "data/reddit-stocks/r/stocks/comments/tcv1yy/oil_stocksmissiles_launched_at_the_american.json": "Iran suspected of a missile attack on the American Consulate in Iraq.\nI guess we aren't getting any more oil from them. Wouldn't expect if from a\nplace like Venezuela either. I suspect oil wasn't actually at it's all time high\nlast week and this thing is just getting started. Anyone else out there…",
  "data/reddit-stocks/r/Bogleheads/comments/tcm2ff/finally_moving_my_retired_mom_from_edward_jones.json": "She has early onset dementia and I have power of attorney. After explaining to\nher how terrible EJ is in terms of fees, she’s ready (for me) to make the move.\nHer EJ account is split between a trad and ROTH IRA, with about 20 funds in\neach. Looking to sell all and consolidate. I don’t necessarily…",
  "data/reddit-stocks/r/stocks/comments/tcmsmv/can_the_russian_stock_market_reopen.json": "As the news of the Russian financial system gets worse and worse and they keep\npostponing re-opening their stock market, I'm left with the question:\n\n> Can they re-open the market without it being a total dumpster fire?\n\nMy opinion is they cannot. At least not until the war is over and the…",
  "data/reddit-stocks/r/stocks/comments/tcuvfu/i_dont_understand_why_inflation_is_such_a_threat.json": "I really don’t understand why inflation is such a threat to stock prices. Like\nwhy does inflation cause the price of everything to increase- groceries, fuel,\nhousing, etc etc but yet the price of stocks are supposed to go down ???? I mean\nI understand that input cost for companies like labor, raw…",
  "data/reddit-stocks/r/Bogleheads/comments/tcp3wt/im_61_and_probably_losing_job_this_year_what_to.json": "Two years ago I moved my 401k from target date funds to more stocks. Late 2021 I\ngot nervous and moved all to cash. Now I’m looking to reinvest the cash but\nworried about a market crash. Was thinking about a conservative income fund like\nvwiax. Does this make sense? This is about 800k total. I’m…",
  "data/reddit-stocks/r/wallstreetbets/comments/tczyzz/the_end_is_near_markets_down_this_week_9999.json": "I have been running the numbers, and things aren't looking good. My mother's\nhusband's wife boyfriend is big in the stock game, and he was frowning this\nmorning when he read the newspaper. Look at this graph I just saw on Bloomberg:\n\nI'm not a genius but this…",
  "data/reddit-stocks/r/Bogleheads/comments/td6e31/would_you_buy_bonds_now_in_2022.json": "Hi I'm an 27yo expat living in Germany.\n\nTo stabilize the portfolio and have a 70/30 % of stocks/bonds\n\nWould you buy bonds as interest rates will increase? Does that mean bond that I\nbuy today will have a less value and a bad idea?\n\nWhat do you think?",
  "data/reddit-stocks/r/investing/comments/tcyvp8/actively_managed_vs_sp_500.json": "The title pretty much says it all. Up until now I’ve been “managing” my\nportfolio aside from my 401k that’s offered at my job. I want to also have\nanother account that would be ready to pull from in the next 10-15 years (I’m\n20). Should I just DCA into the S&P for the next 15 or so years or should…",
  "data/reddit-stocks/r/stocks/comments/tcxely/is_this_a_buying_the_dip_moment.json": "Everyone is talking about how low stocks are right now. but are they really? the\nDow is still at 33000.\n\nI am afraid people are going to start buying stocks that have \"dipped\" when they\nare really just settling down.\n\nMy thought process is to slow down and really study what stocks are a good…",
  "data/reddit-stocks/r/stocks/comments/td8bwk/how_are_recent_first_time_investors_feeling_right.json": "I spent the first 10 years of my career building up my savings acct and not\ninvesting in anything aside from my employer 401k. Joined a company pre-IPO that\nwent public in 2021, and ended up with a bunch of equity that hit its first vest\ncliff in Nov 2021 - I cashed that whole cliff and moved it…",
  "data/reddit-stocks/r/stocks/comments/tda7rh/what_are_the_disadvantages_of_drs.json": "I see all this talk about DRS to avoid brokers from lending your stock to\nshorts. Please enlighten me what are the pitfalls of doing this. I've considered\nit but want to understand all the ramifications",
  "data/reddit-stocks/r/stocks/comments/tdaeqw/many_indicators_are_suggesting_a_recession_in_the.json": "The yield curve\n\nAt the point of closing on Friday, the US treasury bond yield curve is slightly\ninverted between the 7 and 10, besides the slight inversion the yield curve is\ngenerally extremely flat pointing at a high probability for a weak economy in\nthe future if not a recession. The yield…",
  "data/reddit-stocks/r/stocks/comments/tdamk6/amazons_stock_split_explained_amzn.json": "Amazon's Stock Split Explained [for any new investors, or investors of $AMZN]:\n\n\n\n * Amazon is the latest tech giant to announce a stock split, following Apple,\n   Tesla, and Google.\n * This is Amazon's first stock split in over 20 years, and historically, stock\n   split announcements have often…",
  "data/reddit-stocks/r/wallstreetbets/comments/td780n/15_simple_tricks_for_saving_money_in_the_coming.json": "Boomer here. Having lived through every downturn since the 1973-75 recession,\nhere are some tips that might possibly save you some money in the impending hard\ntimes.\n\n 1.  Make a budget, and stick to it.\n 2.  Cut down on buying meat, it is one of the costlier grocery items.\n 3.  Cut down on…",
  "data/reddit-stocks/r/stocks/comments/tdcphn/what_are_your_theories_for_an_unexpected_bull.json": "I think everyone was caught off guard with how fast and prolonged the markets\nrallied within the first month of covid. The nation was still locked down in\nMarch when out of nowhere the markets ferociously rallied.\n\nIs this time different? Is there any possible way we could see lower lows then\nout…",
  "data/reddit-stocks/r/Bogleheads/comments/tdg583/im_getting_a_book_reading_list_together_so_far_i.json": "Also Bogles The Little Book of Common Sense Investing",
  "data/reddit-stocks/r/stocks/comments/tdif02/you_guys_got_any_overlookedunorthodox_plays_that.json": "Now I don’t want to hear PayPal or FB cause there over 60% off, I’d like to keep\nsuggestions to stocks you don’t see on this sub day in and day out.\n\nMy suggestion is $RVP. I don’t have a position but I am waiting for some bullish\nsignals. Company designs safety medical products. Revenues and…",
  "data/reddit-stocks/r/investing/comments/tdkwvp/is_there_a_chance_for_deflation.json": "The economic situation is incredibly tough right now, even on people doing\nmoderately well (engineers, docs, lawyers).\n\nMarkets are down 10-12 %. Crypto isnt doing so hot. International markets are\nalso down\n\nBut the cost of everything is getting worse and worse.\n\nI know gas can go up and down…",
  "data/reddit-stocks/r/Bogleheads/comments/tdhfrs/nervous_about_investing_extra_cash.json": "I'm 24 and I have 40k in cash just sitting in my savings account. I want to\ninvest it because I want to grow it and I'm worried about inflation. I have\nabout 27k in my checking account, more than enough to cover an emergency and\ncover my expenses for several months. I have a 401k with about 12k in…",
  "data/reddit-stocks/r/Bogleheads/comments/tdly77/whats_your_optimization_level_on_credit_cards.json": "I am curious how Bogleheads approach credit card rewards in general. Not\nactually asking for you to list the cards you have — that has been discussed in\ndetail in the past — more-so your theory on 1 card vs 3 cards vs 10 cards and\noptimizing cashback / points. 10 cards requires more brainpower than…",
  "data/reddit-stocks/r/stocks/comments/tdm5iy/eli5_why_do_companies_do_stock_splits_when.json": "Everything I’ve read talks about how stock splits increase a stock’s\nattractiveness to a “wider” audience (aka poorer investors). But how does that\nmatter in an age where you can just buy pieces of stock? Is it just a\npsychological play to change the perception of a stock’s affordability?…",
  "data/reddit-stocks/r/Bogleheads/comments/td8a7y/vanguard_digital_advisor.json": "For a taxable account, anyone try this vanguards roboadvisor vs DIY option. They\nare using 4 ETFs that’s available to everyone, so I don’t know what the benefit\nof paying an extra advisory fee is for. Anyone has personal experience with\nthis?",
  "data/reddit-stocks/r/stocks/comments/tdd2ma/investing_in_companies_with_wide_moats.json": "The term \"economic moat\" was coined by Warren Buffett.\n\nThink about a castle that is surrounded by a deep trench, a moat, filled with\nwater. The moat acts to protect the castle from invaders, and the bigger the\nmoat, the less of a chance attackers have of getting across the moat!\n\nMoats, in the…",
  "data/reddit-stocks/r/stocks/comments/tdnmjc/sentiment_everywhere_is_absolutely_bearish_plan.json": "A crash is around the corner and everyone is convinced. All the indicators are\nnot suggesting, proving we are in a recession and a stock market crash.\n\nYou know when everyone thinks something it's usually very wrong. Plenty of\npeople have lost large amounts in their favorite tech and growth stocks.…",
  "data/reddit-stocks/r/stocks/comments/tdmj1s/citi_analyst_jim_suva_maintained_a_buy_rating_on.json": "The reasons he gave were:\n\nSuva said Apple's spring launch will focus on the iPhone SE 5G, the iPad Air\nwith the M1 chip, the high-performance Mac Studio desktop and Studio Display,\nand sports content from Apple TV. Suva told investors that the\nwidely-anticipated cheap, compact iPhone SE already…",
  "data/reddit-stocks/r/Bogleheads/comments/tdkyw2/were_starting_a_weekly_bogleheads_twitter_spaces.json": "This Wednesday, March 16, at 4 PM ET, we're starting a weekly \"Bogleheads\nTwitter Spaces\" for live discussions on different topics from investing to\npersonal finance. Rick Ferri, CFA, (me) will be co-hosting this inaugural event\nwith Jon Luskin, CPF, and other co-hosts will follow. You'll be able…",
  "data/reddit-stocks/r/stocks/comments/tdorrh/fb_13_times_earnings_cheap_enough_yet.json": "I am typically averse to high-growth, low-income, high-valuation tech stocks.\nIt's just not the corner of the market I normally play in, which I realize\nprobably puts me in the minority here.\n\nHowever, a PE of 13 is reasonable by almost any standard, and I think the view\nthat FB's top line has…",
  "data/reddit-stocks/r/wallstreetbets/comments/tdj4wd/one_of_you_called_it_big_macs_in_russia_going_for.json": "https://news.yahoo.com/russians-trying-sell-big-macs-122120599.html\n\nOne of you all called it. They are reselling the big Macs they stored in their\nfridge.\n\nThat price increase is a near 3000% return on investment.\n\nEdit: spelling 🤣",
  "data/reddit-stocks/r/stocks/comments/tdy18g/ford_to_release_7_new_evs_in_europe_by_2024.json": "Ford Motor Co. said it plans to roll out seven new electric cars in Europe by\n2024, including four electric commercial vehicles. With the rollout of the new\nelectric models in Europe, Ford said it now expects annual sales of electric\ncars in Europe to exceed 600,000 units in 2026. The company is…",
  "data/reddit-stocks/r/stocks/comments/tdnfr0/foxconn_halts_iphone_shenzhen_site_due_to_covid.json": "(Bloomberg) -- Apple Inc. supplier Foxconn is halting operations at its Shenzhen\nsites, one of which produces iPhones, in response to a government-imposed\nlockdown on the tech hub city.\n\nThe Taiwanese company, also known as Hon Hai Precision Industry Co., has its\nChina headquarters in the area and…",
  "data/reddit-stocks/r/investing/comments/tdvcb2/stagflation_in_the_1970s_stagflation_in_the_in.json": "When people think of the U.S. economy in the 1970s, many things come to mind:\n\n- High oil prices\n\n- Inflation\n\n- Unemployment\n\n- Recession\n\nA question for baby boomer investors and historians who have studied the US or\nEuropean stock market during the 70's.\n\na) Which sectors of the economy…",
  "data/reddit-stocks/r/wallstreetbets/comments/tdzoqz/in_march_of_2005_this_guy_bought_100_of_shares.json": "Focal Video [https://imgur.com/gallery/iPknYQK]\n\nIn March of 2005, this guy bought 100% of shares (1.1M shares) in a traded\ncompany to prove Wall Street corruption. The next two days that same stock\ntraded 50 million times and dropping the price 99% in two hours. All this with\nLITERALLY NO SHARES…",
  "data/reddit-stocks/r/stocks/comments/tdtir7/rstocks_daily_discussion_monday_mar_14_2022.json": "These daily discussions run from Monday to Friday including during our themed\nposts.\n\nSome helpful links:\n\n * Finviz [https://finviz.com/quote.ashx?t=spy] for charts, fundamentals, and\n   aggregated news on individual stocks\n * Bloomberg market news [https://www.bloomberg.com/markets]\n *…",
  "data/reddit-stocks/r/stocks/comments/tdhrx2/a_friendly_reminder_that_there_are_almost_10000.json": "In Canada, where I invest, there are over 3000 companies listed on the TSX and\nTSX venture. My point is that instead of buying what everyone else buys, do a\nmountain of research and find your own opportunities to be confident and patient\nwith. *Side note: many of those ten thousand listings are the…",
  "data/reddit-stocks/r/stocks/comments/te4ckc/this_is_not_the_end.json": "Seeing lots of post and comments like, I'm never going to recover, or this is\nit, this is the big one...big one of what?!?!\n\nIf you bought into some memestock, sorry, but sucks to suck, that likely won't\nrecover. If you're holding quality stocks (i.e. MSFT, JNJ, AAPL, etc...) you\nwill be fine in…",
  "data/reddit-stocks/r/investing/comments/te4da8/10_year_treasury_yield_up_to_213_yield_curve_now.json": "Crazy move in bond yields today as stocks and bonds retreat lower. Fed expected\nto raise rates this week to .25bps as the fed funds rate. Nasdaq is now down\n-22% since its high and officially in a bear market. Since 2018, it is pretty\nevident any tightening of monetary policy will send markets…"
}