{
  "data/reddit-crypto/r/CryptoCurrency/comments/ufvnmo/sol_attacked_yet_again_why_invest_in_sol_when.json": "It's common knowledge here that the SOL network goes down frequently, gets\nhacked, doesn't work etc yet people still continue to invest in it. And yet\nagain it was attacked recently! If traditional banking was this flakey the\ngovernment would haul it over the coals and watch it burn.\n\nYet people…",
  "data/reddit-crypto/r/Bitcoin/comments/ufsz2o/in_the_family_guy_episode_s14e11_aired_10012016.json": "The price back then was US$448.70. If anyone was stupid enough to take advice\nfrom a ridiculous cartoon back then they'd be up 8,500% by now.",
  "data/reddit-crypto/r/CryptoCurrency/comments/ufxzmx/yuga_labs_and_bayc_couldve_saved_users_up_to_80.json": "The highly-anticipated virtual land sale related to the Bored Ape Yacht Club\nwent live hours ago and affected a large portion of the entire crypto market.\nThe massive demand led to ETH fees worth nearly $200 million to be spent on gas\nfor the land sale in one hour. This is because their contract…",
  "data/reddit-crypto/r/CryptoCurrency/comments/ug41ga/after_weeks_of_research_i_think_there_is_enough.json": "OBJECTIVE: ENDING BITCOIN'S FOUR YEAR CYCLES AND THEIR EFFECT ON THE WIDER\nCRYPTO MARKETS\n\nBitcoin's halving cycles are the prime target because they are the main catalyst\nbehind all crypto bull cycles. When bitcoin rallies, fresh capitals flow into\ncrypto, and those seeking higher returns flow…",
  "data/reddit-crypto/r/CryptoCurrency/comments/ug89ma/is_elon_musks_twitter_grab_good_for_nft.json": "https://preview.redd.it/x2zaeeo49xw81.png?width=2615&format=png&auto=webp&s=1d7c7e3ea12363b3ca168f9694eb872a8f007148\n\nHey Guys,\n\nTesla founder Elon Musk’s acquisition of Twitter ought not to have taken anyone\nby surprise — least of all those of us in the cryptocurrency community. But\nthere may be…",
  "data/reddit-crypto/r/Bitcoin/comments/ug52gj/my_daughter_just_managed_to_purchase_800_worth_of.json": "I have no experience with bitcoin. My daughter was messing with my phone (she's\n1.5) and somehow purchased $800 worth via cashapp. How do I handle this. I'm not\nreally in the crypto market, and that wasn't really money allotted to\ninvestment. Rn it's at $784. Any advice?",
  "data/reddit-crypto/r/CryptoCurrency/comments/ug2isw/bored_ape_yacht_club_just_broke_the_ethereum.json": "So just read this on cnet\n[https://www.cnet.com/personal-finance/crypto/bored-ape-yacht-club-just-broke-the-ethereum-blockchain/#ftag=CAD590a51e]\nand found this interesting:\n\n\n\n> A new NFT collection was launched on Saturday by the Bored Ape Yacht Club\n> team. The Ethereum blockchain was crushed by…",
  "data/reddit-crypto/r/CryptoCurrency/comments/ug9n19/is_this_really_the_end_of_cryptocom.json": "I recently invested a considerable amount into cro and I am in the believe, that\nit's an upcoming crypto exchange with quite some room to grow.\n\nNow with the news about the crypto.com cards the price tanked from 40 to 30ct\nand I am wondering if that could be a better entry point or if everything…",
  "data/reddit-crypto/r/CryptoCurrency/comments/ug3im5/with_cdc_shooting_themselves_in_the_foot_whats.json": "I've been a pretty extensive user of Crypto.com, but with them slashing\nbasically everything that made them competitive, I'll probably be looking for\nthe next best thing.\n\nI never had a bad experience with their platform, and I appreciated their\nvariety of services, maybe I am in the minority…",
  "data/reddit-crypto/r/CryptoCurrency/comments/ugkp3v/warren_buffet_is_a_true_value_investor_bitcoin.json": "Bitcoin just flipped Berkshire Hathway again in terms of market cap.\n\nMarket cap of BTC: $724Bn, Market cap of Berkshire (BRK) - $713 BN\n[https://preview.redd.it/ci0mvljks0x81.jpg?width=1420&format=pjpg&auto=webp&s=822c140c37a08d5b458a9ef427fb0602c8437bcb]\n\nYet he wants to buy all of Bitcoin's…",
  "data/reddit-crypto/r/CryptoCurrency/comments/ugjz3c/cryptocom_is_perfect_example_why_you_do_not.json": "Been browsing /r/Crypto_com/\n\nExpected backlash. But number of people stating they talked their friends and\nfamily into CDC is staggering. And now they look like idiots and friends lost\nmoney.\n\nWe risk our own money and that is our decision to make. For better or worse.\n\n\n\nDon't shill coins and…",
  "data/reddit-crypto/r/Bitcoin/comments/ugfr4d/bitcoin_just_closed_its_5th_red_week_in_a_row.json": "December of 2014 at the end of the bear market. 2 Weeks later it set in its\ncycle low and never looked back.",
  "data/reddit-crypto/r/Bitcoin/comments/ugh0af/my_parrot_just_managed_to_purchase_800_worth_of.json": "I have no experience with bitcoin. My parrot was messing with my phone (while\nrepeating \"to da moon\") and somehow purchased $800 worth via cashapp. How do I\nhandle this. I'm not really in the crypto market, and that wasn't really money\nallotted to investment. Rn it's at $831. Any advice?",
  "data/reddit-crypto/r/Bitcoin/comments/ugb8gg/this_is_the_way_accumulate_as_much_bitcoin_as_you.json": "Never sell with the purpose of \"locking profits\". This means that your end goal\nis more dollars instead of more bitcoin. You don't get it yet.\n\nNever sell with the purpose of \"buying back lower\". You cannot predict the\nmarket. It is much more likely that you will do better by simply hodling…",
  "data/reddit-crypto/r/CryptoCurrency/comments/ugogec/prediction_were_about_learn_that_cryptocom_got.json": "Just, wow. In one 24h period, my crypto.com Obsidian founders card went from\nsomething I'm proud to pull out of my wallet to a useless chunk of metal. My\nwife has Icy White, as well. I'm stunned by these changes. For me there can be\nonly one explanation... This is a controlled demolition of the…",
  "data/reddit-crypto/r/CryptoCurrency/comments/ugnbjw/kraken_cryptocom.json": "Reject Crypto.com, Return to Kraken\n\nIt's the most secure and has the best support. Although the interface isn't the\nbest for new users it is quite manageable and reliable.\n\nKraken has proof of reserves and the have shown they hold users coins 1:1.\nKraken is so honest that there CEO himself has…",
  "data/reddit-crypto/r/CryptoCurrency/comments/ughai4/guys_this_is_what_a_bear_market_is.json": "The market has a negative trend from 6 months, and flat (if you are very\noptimistic) for 1 year.\n\nNow, we see the bad news coming out, Cro, Solana(again), and more will come. In\na near future, people will ask, so much good news, why is it still crashing?\n\nAnd its now cryptos fault, im very bullish…",
  "data/reddit-crypto/r/CryptoCurrency/comments/ugops5/the_longer_im_in_crypto_the_more_of_a_btc_maxi_i.json": "Don't get me wrong, I'm a slut for some altcoins. There's some that I am very\nexcited about and could see or are doing great things.\n\nBut there's one big problem with each of these altcoins: you can't fully trust\nthem anymore. Stuff like the recent crypto dot com ordeal, SOL, and the…",
  "data/reddit-crypto/r/CryptoCurrency/comments/ugscd0/staked_for_obsidian_2_weeks_ago_i_have_never_felt.json": "So yes after starting at icy White about a year ago i grew my CRO holding and\nkept investing into it. Saw the ads on F1 and other big events. Saw the great\nearn rates which i have been using for months now to generate interest since in\nthe EU the interest is negative. So after saving up for a long…",
  "data/reddit-crypto/r/CryptoCurrency/comments/ugorfc/warren_buffet_is_very_old_91_years_old_and_very.json": "Warren Buffet was probably greatest investor in second half of XX century, a\nlegend of investing. He is still very rich, but most of his investments were\nmade decades ago. He have his Coca Cola stock since 1980's. He can do nothing at\nthis point and he still become richer, simply cause companies he…",
  "data/reddit-crypto/r/CryptoCurrency/comments/ugto1l/charlie_mungers_hypocrisy_calls_btc_evil_right.json": "Charlie Munger, the Vice-Chair of Berkshire Hathaway and colloquially known as\nWarren Buffet's right hand man took on BTC during Berkshire Hathaways annual\nshareholder meeting\n\nThere he called Bitcoin \"stupid because it’s very likely to go to zero\" and also\npraised Chinese leader Xi Jinping for…",
  "data/reddit-crypto/r/CryptoCurrency/comments/ugqyx6/why_learning_about_market_cap_can_help_you_have.json": "I'll start by stating that I like Hopium as much as anybody else on this sub,\nthinking about my small bag of crypto shooting up in price so I can call my boss\nand quit in the morning is great.\n\nBut you know what I like more than Hopium?\n\n\nKNOWLEDGE!\n\nI after reading some comments on this sub I feel…",
  "data/reddit-crypto/r/CryptoCurrency/comments/ugxfra/free_garlicoin_all_you_have_to_do_is_post_pot_of.json": "HELLO R/CRYPTOCURRENCY [/r/cryptocurrency]\n\nGarlicoin is hot out of the oven and ready to serve you with its buttery\ngoodness. Forked from LTC, this decentralized cryptocurrency with almost no new\ntechnology will help you through the darkest times in your life. This is the\ncoin you never thought…",
  "data/reddit-crypto/r/CryptoCurrency/comments/uguywp/bitcoin_is_actively_being_added_to_loans_401ks.json": "As we all continue to be depressed about Bitcoin not doing anything in the past\nfour months while being down 45% from its ATH for half a year. Bitcoin does not\ncare and is undergoing a prime phase of mass adoption with everything from loans\nto option trading in banks to legal tender.\n\nEspecially…",
  "data/reddit-crypto/r/CryptoCurrency/comments/uh45bn/cryptocom_card_changes_revised_is_it_enough_for.json": "To those who haven't seen it, the CEO of Crypto.com tweeted out revised changes\nto the Crypto.com card staking rates in response to community feedback.\n\nThis is the general summary of the changes:\n\n> Instead of eliminating card staking earn rates completely, we will offer a\n> more balanced…",
  "data/reddit-crypto/r/CryptoCurrency/comments/uhej7x/if_youre_70_down_why_not_invest_now_you_can_only.json": "We're all probably more or less in the red by now. That's why now more than ever\nits crusial to stick to your strategy, make rational decisions and NOT fall for\nmind tricks and fallacies. And it's certainly not the time to abandon simple\nmath!\n\nWe've all heard of sunk cost fallacy, gambler's…",
  "data/reddit-crypto/r/CryptoCurrency/comments/uh96u9/this_is_big_algorand_has_started_marketing.json": "Algorand has the best technology of all chains. If you have been lurking on r/cc\n[/r/cc] for few months, you would notice how most of this sub loves Algorand.\nLess than $0.01 transaction fees, seconds of finality and TPS of over thousands,\nwhat is there not to like?\n\nThe price action. The price…",
  "data/reddit-crypto/r/CryptoCurrency/comments/uhjean/icp_does_the_first_useful_thing_in_its_existence.json": "ICP's price and market performance has been forgettable, as it has crashed from\na high of $450 to now $16! The \"Internet Computer\" has been the butt of all\njokes in the crypto world.\n\nIn an attempt to get back some relevance, now ICP is suing the mother of all\nthieves - Facebook themselves! Dfinity…",
  "data/reddit-crypto/r/Bitcoin/comments/uhdadl/bitfinex_lost_my_10000_usd_deposit_support_ticket.json": "Posting here as Bitfinex immediately deleted my original post on r/bitfinex\n[/r/bitfinex]\n\nOn February 1st 2021, I sent 10,000 USD to Bitfinex to lend out to margin\ntraders, but the funds have not shown up in my account since. I have been in\nconstant contact with Bitfinex support and my personal…",
  "data/reddit-crypto/r/Bitcoin/comments/uhjrz7/the_recent_congressional_letter_penned_to_the_epa.json": "I posted on this sub recently, imploring Bitcoiners in the United States who\nvote Democrat to start speaking up and clean house, because the party as it\nstands is going the direction of the Communist Party in China with respect to\nBitcoin. I was downvoted / shouted down for the crime of suggesting…",
  "data/reddit-crypto/r/CryptoCurrency/comments/uhv1fu/is_ethereum_actually_good_or_does_it_just_have.json": "After doing a plethora of research, I’m finding out that Ethereum might not be\nthe best blockchain tech wise. Blockchains such as Cardano, Algorand, Cosmos etc\nall seem to have various advantages over Ethereum.\n\nThese advantages include lower fees, speed, scalability, decentralization and\nalready…",
  "data/reddit-crypto/r/CryptoCurrency/comments/ui4g3y/elon_musk_twitterscrewed_the_market_yet_again_ape.json": "1) Musk changed his Twitter profile picture to a bunch of Bored Apes.\n\n2) APE jumped up 20%. The news was spreading fast. People wanted to ride that\ntrain \"to the moon.\" News articles started to emerge \"APE soared...\" \"Elon Musk\nchanged his Twitter profile pic...\" \"Musk endorsed BAYC\"...\n\n2) Musk…",
  "data/reddit-crypto/r/CryptoCurrency/comments/uiech3/fed_meeting_raising_rates_by_the_expected_half.json": "Bullish news overall, at least short term.\n\n\nBACKGROUND: HOW HIGH ARE THOSE FED RATES EVENTUALLY GONNA GO AND HOW BIG IS THE\nEFFECT?\n\nIt's important to keep things in perspective.\n\nLowering or increasing rates, doesn't necessarily mean we'll have very high or\nvery low rates.\n\nIn fact, Fed rates are…",
  "data/reddit-crypto/r/Bitcoin/comments/uig3b6/forked_over_380000_btc_to_to_the_us_government_to.json": "By 2013, Slomp had made 380,000 Bitcoin, valued at €3 million (£2.6 million) at\nthe time. According to court documents, he sold about 104 kilograms of MDMA,\n566,000 ecstasy pills, four kilograms of cocaine and “substantial quantities” of\namphetamine, LSD, weed, ketamine and Xanax on the dark web…",
  "data/reddit-crypto/r/CryptoCurrency/comments/uijvn6/its_annoying_to_see_bitcoin_follows_the_stock.json": "As the title says, it annoys me that bitcoin is following the nasdaq. Because\nBitcoin and other cryptos are supposed to be a hedge against the stock markets\ncorrections. But bitcoin basically follows the stock market. And if a recession\nhappens I want to be making money on crypto so that I doesn’t…",
  "data/reddit-crypto/r/CryptoCurrency/comments/uintxh/safemoon_liquidity_has_been_consistently_dropping.json": "The liquidity pool for everyone’s favourite scam token has been dropping\nsignificantly. It is losing approximately a million dollars each week it\ncurrently has less than $7m.\n\nIf the liquidity pool is no longer able to support the swapping of tokens\nbetween Safemoon and Binance coin, it will have…",
  "data/reddit-crypto/r/Bitcoin/comments/uijimr/bitstamp_blocked_my_account_because_im_from_russia.json": "Sorry if I posted in the wrong section, but I don't know where else to post. I\nalready wrote in the Bitstamp thread, but the post was blocked without comments.\n\nSo 2 weeks ago I saw that my account is blocked, they don't let me trade and\nalso withdraw my funds. I wrote to their support and here is…",
  "data/reddit-crypto/r/CryptoCurrency/comments/uiumqx/sec_documents_show_that_binance_is_contributing.json": "Binance seems to be interested in commiting funds to Elon for his Twitter\ntakeover. In a letter filed with SEC, Elon has disclosed backing for upto $7 BN\nfor his proposed takeover of Twitter, from big names such as Brookfield,\nFidelity, Qatar, Sequoia and now Binance too!\n\nAs per the filing,…",
  "data/reddit-crypto/r/CryptoCurrency/comments/uj00j2/yet_again_us_markets_open_entire_crypto_market.json": "I've seen this like 20 times in the last year. Everything goes well the entire\nday in the Asia/Europe markets, but the moment US markets open, everything\ntanks.\n\nI've had alts doing +15% today, total portfolio was up like 6-7%, all wiped in a\nmatter of 2hrs. Sure, it is related to alts being…",
  "data/reddit-crypto/r/CryptoCurrency/comments/uixqda/cryptocom_just_announced_some_further_changes_in.json": "Via the CEO, Kris, Crypto.com has just announced that they have VERY SLIGHTLY\nincreased the cashback rewards based on community feedback.\n\nEssentially, this has allowed them to tank the price for a week and continue to\nthrow tiny breadcrumbs in the hope most users will forgive them.\n\nI am…",
  "data/reddit-crypto/r/CryptoCurrency/comments/uiv32d/i_think_the_fact_that_we_can_now_send_thousands.json": "There are a lot of features that give crypto an edge over fiat currency. There’s\nthe fact that some cryptos have a limited supply just like Bitcoin. Other coins\nare untraceable like Monero and are great for privacy and DeFi is decentralized\nand safe from government interference.\n\nBut out of all…",
  "data/reddit-crypto/r/CryptoCurrency/comments/uj4z6g/elizabeth_warrens_obsession_with_crypto_continues.json": "She seems to be trying the throw everything at the wall and see what sticks\napproach this time.\n\nCalled it a gamble —\n\n> “Investing in cryptocurrencies is a risky and speculative gamble, and we are\n> concerned that Fidelity would take these risks with millions of Americans’\n> retirement…",
  "data/reddit-crypto/r/CryptoCurrency/comments/uj0x8x/crypto_has_been_taken_over_by_the_same_people_it.json": "I’m not the first person to notice this on this sub, but the last couple years\nthe crypto market seems to really move with the regular stock markets. Case in\npoint, the last couple of days the two big swings in the NASDAQ I’m literally\ncoincided with the same swing of all my crypto. This tells me…",
  "data/reddit-crypto/r/CryptoCurrency/comments/uj3vfe/i_hate_dogecoin_because_of_its_fanbase.json": "I had nothing against Dogecoin. To be honest, I liked it because it was the most\npopular meme coin these last years and the community seemed really cool - until\nElon Musk started to talk about it (at least, that's why I think it became so\nannoying).\n\nEVERY POST involving crypto (in some cases not…",
  "data/reddit-crypto/r/CryptoCurrency/comments/ujli2g/im_out.json": "Over the past few years I have gained a good bit and i have lost a (really) good\nbit.\n\nI can safely say that i am certainly sure I have addiction issues with crypto.\nAs it is, quite literally like gambling.\n\nI loved the highs, but frankly I have only begun to dig my own grave by the\namount of lows…",
  "data/reddit-crypto/r/CryptoCurrency/comments/ujl5tb/why_does_everyone_care_about_virtual_real_estate.json": "The hype around Yuga Labs’ Otherside mint has started a new wave of discussion\naround virtual real estate. Minting their “Otherdeeds” cost 305 APE and\ngenerated over $550 million in sales in the first day all on the hope that\nthey’re going to do something interesting with virtual real estate. I…",
  "data/reddit-crypto/r/Bitcoin/comments/ujx99l/bitcoin_is_rat_poison_says_munger_hes_right_all.json": "For the longest time I disliked the statement Charlie said. But it finally\nclicked today when I re-watched that clip. So, thanks Charlie. The rats better\nstart to scatter!",
  "data/reddit-crypto/r/CryptoCurrency/comments/uk4icb/bitcoin_falls_40k_and_crypto_continuous_plunge_is.json": "If you are new in crypto you may fear and panic because of this prices and I\ncan’t blame you, but I just want to tell you about Bitcoin price history\n\nIn 2014 … Bitcoin went below $400 and everyone thought that the Digital Gold is\ngone forever\n\nThen in 2018 … Bitcoin went below $4K and everyone…",
  "data/reddit-crypto/r/CryptoCurrency/comments/uk3sw0/dont_be_in_denial_that_your_500_to_100k_token.json": "There's a common reason people get extremely hostile and defensive, and it's\nbecause they do not handle acceptance well. Don't believe me, then sort by\ncontroversial on a popular post.\n\nIf you've made a bad decision, and have to accept a negative outcome it's worth\naknowledging that to move on.…",
  "data/reddit-crypto/r/CryptoCurrency/comments/ujz328/getting_pretty_tired_of_the_crypto_market.json": "I've been here for a while now and I've gotta say ... I'm getting pretty tired\nof our little market. There's so much that is just so rediculous.\n\nFor starters, wasn't the whole point to get away from the mainstream markets and\nbanks? Now here we are, directly correlated to the moves of the stock…",
  "data/reddit-crypto/r/CryptoCurrency/comments/uke7on/people_in_here_treat_nfts_like_the_rest_of_reddit.json": "I'ts so strange to watch the crytonatives in here shit talking NFTs on exactly\nthe same way and people on the rest of Reddit shit talk crypto in general. I'm\nsure I'm going to get downvoted into oblivion but shouldn't we embrace NFTs if\nit leads to wider mass adoption of the underlying blockchain…",
  "data/reddit-crypto/r/CryptoCurrency/comments/ujypgz/safemoon_ceo_john_karony_squanders_150000_of.json": "This is one of those truly remarkable things which I personally think elevates\nSafemoon to #1 Crypto scam, far above Bitconnect.\n\nIn the latest Coffeezilla video [https://www.youtube.com/watch?v=kIUrE7Ovm5k],\nour intrepid investigator finally confirmed that John Karony, the CEO of\nSafemoon,…",
  "data/reddit-crypto/r/CryptoCurrency/comments/ukeaw0/lets_be_honest_how_many_of_you_actually_held_your.json": "I see a lot of people talking about how those who hold through the bear run will\nbe rewarded, but I rarely see people stating that they're the ones who went\nthrough that.\n\nAre any of you the ones that supposedly held through the insane crypto winter of\na couple years back? And if so, how much did…",
  "data/reddit-crypto/r/CryptoCurrency/comments/ukm6l2/about_one_year_ago_dogecoin_hit_070_usd_now_its.json": "Going back one year. Crypto is in it full \"mania\" stage as the rise of meme\ncoins takes place lead by the godfather of memes, Dogecoin itself. Dogecoin hits\nabout 0.70 crossing the magical 0.69 mark. It's just complete doge hype all over\nthe internet. Investors are already seeing the 1$ mark in…",
  "data/reddit-crypto/r/CryptoCurrency/comments/ukj53q/ironically_bitcoin_has_been_more_stable_than.json": "Stock market people always made fun of crypto about how volatile it is. They\nwere right until recently. The most popular growth stocks have been more\nvolatile than Bitcoin. This proves that Bitcoin is more stable than some of the\nmost popular stocks.\n\nHere is the charts\n\nBitcoin price, past 6…",
  "data/reddit-crypto/r/Bitcoin/comments/ukuzsu/finally_made_it_to_1_btc.json": "Overjoyed at this today.\n\nFinally hit my goal of 1 BTC.\n\nBeen hearing about Bitcoin since 2009, Thought it's farmville money. I had a GPU\nthat could mine hundeds of Bitcoin a week in 2011 but I rather played Call of\nDuty with it. Till 2021, I didn't give a damn about what Bitcoin is but now it\nis…",
  "data/reddit-crypto/r/CryptoCurrency/comments/ukn5tx/the_bitcoin_bloodbath_will_get_worse_this_is_fine.json": "The current crypto market carnage will probably get worse—but don't take your\neyes off the big picture.\n\nIt's getting ugly out there. Bitcoin is down over 8% this week and has fallen\nnearly 50% from last year's all-time-high. The situation isn't much better for\nEthereum, down 5% over the week,…",
  "data/reddit-crypto/r/CryptoCurrency/comments/ukzwtu/benjamin_cowen_believes_his_lengthening_cycles.json": "If you still don't think we're in a bear market, I'm not sure what to say to\nyou. You can't associate constant dumps and weak pumps Bitcoin has been going\nthrough for the last 4 months as a bull market.\n\nBenjamin Cowen is one of the few people I follow and I enjoy his content. It's\nsad to him say…",
  "data/reddit-crypto/r/CryptoCurrency/comments/ul10rr/five_months_ago_i_combed_through_all_the_posts.json": "Good morning all,\n\nWe're in a bear market. Shit sucks. But that doesn't mean we can't still have\nsome fun right?\n\nFor those that were around at the beginning of the year, you might remember that\nI created this. The FOLIO OF HATE. I invested (yolo'd?) $100 into this subs most\nhated coins. Some coins…",
  "data/reddit-crypto/r/CryptoCurrency/comments/uklsdj/what_is_your_worst_crypto_investment_to_date.json": "I got caught up in one too many alts during the run up in the summer and I’ve\nbeen left with some that would need to treble to get close to their ATH. I cut a\nfew at the beginning of the year to buy some BTC, which turned out to be a\ndecent idea considering how much more most alts have bled in…",
  "data/reddit-crypto/r/CryptoCurrency/comments/ul42ma/if_you_are_still_here_and_still_buying.json": "Regardless of if we continue up or down from here ( or just crab for a couple\nyears) we are currently in the market phase where during the next bull run all\nthe newbies will look at the charts and say \"if only I would have know about\ncrypto back then\". I myself was one of those people at the start…",
  "data/reddit-crypto/r/CryptoCurrency/comments/ul6unv/btc_is_officially_down_50_from_all_time_high.json": "Bitcoin has dropped 50% from its ATH\n\nFor me this is an easy buy not necessarily currently but anytime I buy I know\nthat with in time my money will double in the future on any buy below this\nprice. Lots of altcoins out there looking very tempting as well, but one thing I\nhave learned is Id rather…",
  "data/reddit-crypto/r/CryptoCurrency/comments/ul8z4r/for_being_into_crypto_since_2017_im_kinda.json": "Hello all,\n\nI really thought we would encounter at least some greater real world usage by\nnow, but atm we only have ponzi like DeFi Apps, NFT that suck all the \"usage\"\nand copycats all over the place. I seriously thought crypto would have a better\nimpact by now or at least some useful usage, kinda…",
  "data/reddit-crypto/r/Bitcoin/comments/ul5yo7/im_proud_of_bitcoin.json": "Listen , I bought at 69k , and my portfolio is down a lot to say the least . But\nhear this :\n\nLook at us now . We are at 35 thousand per coin. We have proven to the world the\nvalue of decentralised money . Look at every other time bitcoin peaked , and\nthen it went down after . This is just the same…",
  "data/reddit-crypto/r/CryptoCurrency/comments/ulg72c/some_advice_from_a_previous_bear_market.json": "I got into crypto in 2016 pretty casually. Bought 2 BTC for $900, sold them for\n$1000 and thought I was a genius. Didn’t take it too seriously.\n\nAfter trading them for awhile and doing more research I started thinking crypto\ncould have a really bright future. Then I woke up one day in 2017 and BTC…",
  "data/reddit-crypto/r/Bitcoin/comments/uli5dl/finally_at_001_of_a_coin.json": "Been enjoying the dip and bringing my average down. Finally made it to 1/100th\nof a coin. I know it’s not a huge amount, but it’s a big milestone for me.\n\nJust wanted to share :)",
  "data/reddit-crypto/r/Bitcoin/comments/uli4dc/reiterating_my_400k_late_2022_early_2023_price.json": "I authored this post a few weeks back discussing why changing the 21M hard cap\nis completely irrelevant in the future. The reason for that is because assuming\nbitcoin successfully becomes the honest transparent base layer that we need so\ndesperately to replace the dishonest fiat/debt base layer-…",
  "data/reddit-crypto/r/CryptoCurrency/comments/ulpeiw/crypto_market_crash_is_probably_the_best.json": "All the people are depressed because market is down. I understand them. But for\nme, a crypto market crash is probably the best thing that can happen in my life\ntime.\n\nPlease stop being depressed. Wake up.\n\nNow this is the great opportunity for those who believe in crypto. Probably the\nnext bull…",
  "data/reddit-crypto/r/CryptoCurrency/comments/ulqg7o/what_we_are_experiencing_now_is_the_start_of_a.json": "Unless you are living under a rock, cryptocurrencies and the stock market are\ntaking a beating with worse to come in the short term.\n\nThe likely explanation is that investors are moving money away from stocks and\ncrypto into fiat, precious metals and other low risk options.\n\nRising inflation,…",
  "data/reddit-crypto/r/Bitcoin/comments/ulolvg/whales_arent_selling_so_why_are_you.json": "Go look up the top 100 Bitcoin addresses. None of them are selling. We're\ntalking accounts worth billions of dollars. They aren't worried so why are you?",
  "data/reddit-crypto/r/CryptoCurrency/comments/ulvokw/if_you_arent_buying_now_you_will_regret_your.json": "Let me start off by saying that a lot of us are facing an acute shortage of fiat\naka money to invest and are probably balls deep.\n\nLets just look at the bloodbath right now\n\nThe market right…",
  "data/reddit-crypto/r/CryptoCurrency/comments/ulrj40/if_you_didnt_panic_during_may_2021_crash_you_also.json": "I know some of you waited for that $20K dip and was panicking to buy at $28K\nbecause your favorite Twitter crypto influencer told you $28K isn't the bottom.\n\nStop listening to these influencer they can't tell you where the bottom or top\nis. Stick to your plan, DCA during these crashes because if…",
  "data/reddit-crypto/r/CryptoCurrency/comments/ulyatt/the_luna_foundation_moved_all_their_btc_after_ust.json": "After UST lost it's peg and briefly dropped to 0.92, it appears they are\ndesperately trying to recover.\n\nhttps://www.blockchain.com/btc/address/bc1q9d4ywgfnd8h43da5tpcxcn6ajv590cg6d3tg6axemvljvt2k76zs50tv4q\n\nThey just transferred all their BTC out of their wallet, probably going to dump\nit on the…",
  "data/reddit-crypto/r/CryptoCurrency/comments/ulynqb/you_are_delusional_if_you_believe_that_we_are_not.json": "First of all, there is a 0% chance that we are in a bull market like this\ndumbass post\n[https://www.reddit.com/r/CryptoCurrency/comments/udrns8/ive_been_here_since_2013_and_sorry_but_the_bull/]\nwith 1k upvotes stated.\n\nSecond of all, we ARE in a bear market. And I am not talking about the last…",
  "data/reddit-crypto/r/CryptoCurrency/comments/ulzirq/is_it_normal_for_a_stable_coin_to_be_worth_096.json": "Just wondering if its normal for a stable coin to be worth four cents less than\nthe dollar that its supposed to be pegged to?\n\nThe live TerraUSD price today is $0.961231 USD with a 24-hour trading volume of\n$1,932,677,188 USD. We update our UST to USD price in real-time. TerraUSD is\ndown 3.60% in…",
  "data/reddit-crypto/r/CryptoCurrency/comments/ulyipf/luna_just_emptied_their_entire_13b_btc_wallet.json": "link to the wallet [https://bitinfocharts.com/bitcoin/wallet/Luna-LFG]\n\nSo far it’s been moved to a new created address with no transactions before.\nThis could just be a normal move or their preparation to sell. If LUNA decides\nto dump their entire stock of BTC it can move the price down -8-10% and…",
  "data/reddit-crypto/r/CryptoCurrency/comments/ulzith/el_salvador_just_bought_the_dip_again.json": "Just 25 mins ago El Salvador president Nayib Bukele announced he bought another\n500 coins at $30,774.\n\nSource: Twitter\n[https://preview.redd.it/pp097yit6iy81.png?width=741&format=png&auto=webp&s=5833f945a43c66bc9bfdedd2652321fc2bdb4366]\n\nSomebody made a website to show the purchase history and it…",
  "data/reddit-crypto/r/CryptoCurrency/comments/um4k8s/ust_a_stable_coin_is_currently_down_14_this_is_a.json": "I posted only a couple of days ago\n[https://np.reddit.com/r/CryptoCurrency/comments/ukv56a/terra_luna_has_dropped_almost_three_times_as_much/]\nwarning everyone this was pretty much on the cards. I obviously don’t want to\nsee anyone or anything fail, but it really is important to read everything…",
  "data/reddit-crypto/r/Bitcoin/comments/um4b7r/from_a_guy_who_bought_at_50.json": "I've been here for years, reading your posts, even though my friends are hardly\naround any more. I bought at $50 in 2011 on a long gone exchange, and\nimmediately Bitcoin fell to $12. I felt stupid. So in defiance, I promised\nmyself I wouldn't sell until it reached an impossibly high number. 1000x.…",
  "data/reddit-crypto/r/CryptoCurrency/comments/um5d5f/in_the_past_24_hours_1_billion_longs_were.json": ":(\n[https://preview.redd.it/84ovg0crhjy81.png?width=1408&format=png&auto=webp&s=ac5d9880941349c59f7a76824dcf9ae6ba47b130]\n\nIn the past 24 hours, 259,220 traders were liquidated, the total liquidations\ncome in at $1.00 billion.\n\nThe largest single liquidation order happened on Bitmex - XBTUSD value…",
  "data/reddit-crypto/r/CryptoCurrency/comments/um5qs6/the_terraterrausd_peg_is_continuing_to_slide_and.json": "This is a follow up post to when I noticed it was down 3% which is incredibly\ndangerous for a stablecoin.\n\nAt this point it's a question of - \"will the bleeding stop\" or will UST/Terra\nRug itself out of existence?\n\nTwo months ago /u/cwm9 made a very detailed post about his concerns with UST.\nWhich…",
  "data/reddit-crypto/r/Bitcoin/comments/ulxjyn/if_it_gets_down_to_30k_im_buying_1000_worth_whos.json": "How much are you getting at $30k? You're on your honor to be honest now...\n\nEDIT: I BOUGHT $1,000 everyone!!! Went on Kraken, bought it. I can NOT seem to\nfigure out how to post the screenshot on this post...for the LIFE of me I can't\nseem to....but I swear I bought in, got me 3,229,000 sats!!! Woo…",
  "data/reddit-crypto/r/CryptoCurrency/comments/um6swz/condolences_to_all_the_cryptocom_users_that.json": "I know once CDC announced earned cuts mostly to their stablecoins it was a\nnightmare and basically most people went from getting 12% apy down to 1%-5% apy\non their stablecoins depending on how much they had.\n\nI remember seeing a lot of people suggest the next best stablecoin to invest in\nwas the…",
  "data/reddit-crypto/r/CryptoCurrency/comments/uluae3/there_will_come_a_point_when_most_people.json": "Sentiment is a difficult thing to judge. People may seem negative about crypto\nnow, but I think most of us would agree that we are still bullish on crypto in\ngeneral for the mid to long term future.\n\nWhile this is not the worst time to buy, there will probably be a years long\nperiod relatively soon…",
  "data/reddit-crypto/r/CryptoCurrency/comments/um5hax/when_people_say_buy_the_dip_youll_never_get.json": "You know what people were saying around this time last year? The same exact\nthings they're saying now. The crypto market crashed and people were saying buy\nas much as you can now, because BTC is going to $100k by the end of the year.\nNow fast forward one year..... Many of the big crypto are at or…",
  "data/reddit-crypto/r/CryptoCurrency/comments/um9dfc/put_your_money_in_stable_coins_they_said.json": "“What’re you doing? Don’t you know we’re in a bear market. Why are you putting\nyour money in Bitcoin and alt coins?\n\nHere’s what you should do. Put your money in stable coins. It’s what all of the\nsmart millionaires and whales are doing. Do you think whales want to lose\nmoney?”\n\nAnd so there it is.…",
  "data/reddit-crypto/r/CryptoCurrency/comments/umdz5i/what_do_you_mean_buy_now_we_still_have_room_to.json": "Not sure what people are on about with their \"Buy buy buy\" posts. I mean, I\nhaven't seen a suicide hotline posts stickied in months now. Some people argue\nthat the fear and greed index (currently at 10) is the right way to go, and\nnormally I agree, but I don't think this is a normal…",
  "data/reddit-crypto/r/CryptoCurrency/comments/umcs1r/a_year_ago_today_icp_was_listed_on_coinbase.json": "A year ago today, May 10, 2021, a new coin seemed to suddenly appear out of\nnowhere for most of us: a coin with the pretty weird name Internet Computer\n(ICP). It had the most explosive start of any coin I've ever seen. It entered\nthe top 10 immediately, even went to…",
  "data/reddit-crypto/r/CryptoCurrency/comments/umfeus/lunaust_discussion_megathread.json": "In the past several hours, UST stablecoin lost its peg and dropped to as low as\n69c to the dollar. As a result, the Luna token also saw severe drawdowns and the\nentire market braved volatility.\n\nHere is an explanation of what happened to…",
  "data/reddit-crypto/r/CryptoCurrency/comments/umoaj9/have_you_been_in_the_safemoon_sub.json": "It’s wild. I can’t believe how many people are, lack of a better word,\nbrainwashed. I feel like it has been proven that the developers are engaging in\nshady practices and not ethical. I am thinking they will take that money and run\nat some point. Why do you think people are so adamant that it’s a…",
  "data/reddit-crypto/r/CryptoCurrency/comments/umr6t6/tech_industry_lost_1_trillion_in_the_past_3_days.json": "Apple, the most valuable publicly traded company, has seen its market\ncapitalization trimmed by over $200 billion since Wednesday.\n[https://www.cnbc.com/2022/05/09/tech-giants-lost-over-1-trillion-in-value-in-last-three-trading-days.html]\nMicrosoft has lost around $189 billion in value, Tesla lost…",
  "data/reddit-crypto/r/CryptoCurrency/comments/umygrb/if_you_entered_in_2021_your_exit_strategy_should.json": "This is in reference to the stock-to-flow model, which I believe is a solid\nindication on BTC's path albeit taking a different route right now. The\nstock-to-flow model suggests that should be roaming in the region of USD 100k\nduring this period, but we have not even seen it going passed USD 70k…",
  "data/reddit-crypto/r/CryptoCurrency/comments/umnjcu/polkadot_may_seem_quiet_now_but_i_believe_one_day.json": "I've been bullish with Polkadot ever since and now that it's regaining a\nfoothold after a huge Drop Since ATH, I can't help but think about it's approach\nto solving the decentralized problem. And I think this approach will be proved\nsuperior in time.\n\nRight now, I'm looking forward to seeing how…",
  "data/reddit-crypto/r/CryptoCurrency/comments/umwf7u/did_you_sell_or_hodl_during_the_last_couple_of.json": "Quick check on the audience here. Let’s see how many of us sold or not during\nthe bloodbath.\n\nYou can also post what you are currently holding and have trust in and what you\nget rid of.\n\nI’ve got rid on half of the CRO bags I had with profits and I am currently\nbuying the dip with that with BTC and…",
  "data/reddit-crypto/r/CryptoCurrency/comments/umnk0o/why_do_l2_scalings_solutions_require_their_own.json": "It's weird if you think about it. Imagine if Lightning was made such that you\nhad to buy THUNDER token to use it. How stupid would that be? Yet that's exactly\nthe situation going on in the alt coins space.\n\nIt seems like the classic case of the hare and the tortoise. Lightning was\nproposed 7 years…",
  "data/reddit-crypto/r/CryptoCurrency/comments/un1rfw/we_are_12_bad_news_away_from_complete_collapse_of.json": "Disclaimer: This is a financial advice but I am not a certified financial\nadvisor. I just happened to be in crypto market since 2013.\n\nBefore we dive into the why of the message above, here are the kind of things\neveryone needs to be EXTREMELY CAREFUL about:\n\n 1. A lot of YouTube scammers and…",
  "data/reddit-crypto/r/CryptoCurrency/comments/un6plb/now_its_not_the_time_to_be_careless_with_your.json": "Disclaimer: I was invested in LUNA and UST so I'm talking from experience here\n\nI just want to say to everyone using crypto social media in this past day,\nplease please be very gentle with your words. There are a lot of posts on Reddit\ntalking about people losing their life savings, feeling…",
  "data/reddit-crypto/r/CryptoCurrency/comments/un8rch/crypto_market_manipulation_by_citadel.json": "By now you've likely seen the theory that Citadel is to blame for the depegging\nof UST. Most will likely chalk this up to a conspiracy theory but after having\nseen the manipulation Citadel is capable of from a certain stonk over the last\nyear and a half I honestly personally 100% believe the…",
  "data/reddit-crypto/r/CryptoCurrency/comments/un5fvb/im_sorry_for_all_the_people_that_lost_their_life.json": "In my 6 years of being in this rollercoaster i have seen countless of people\nlose their money taking too much risk and getting caught in scams, ponzi's,\nrugpulls, lies, traps, ... you name it.\n\nEspecially new people always get pulled in to these things and they believe all\nthe smart words they get…",
  "data/reddit-crypto/r/CryptoCurrency/comments/unc20z/btc_finally_hit_100k.json": "Well boys and girls, we did it! We got BTC over $100K. Many thought we'd have to\nwait until the next halvening before we saw the 6-figure price, once again, Big\nDaddy Bitcoin surpises us. We have reached the psychological threshold amidst a\nmarket crash.\n\nAs you'll see in the picture below, the…",
  "data/reddit-crypto/r/CryptoCurrency/comments/unccxz/lost_10k_yesterday_got_it_back_by_shorting_the.json": "I'm so angry/happy/upset/tired that I don't even know why I'm writing this post.\nI just want to share it with someone and sadly I don't know anyone involved in\ncrypto.\n\nWhen CRO sunk, I sold my $ 10k worth of CRO and bought LUNA. I was already at\nloss but somehow I saved 10k. Before they were 20k.…",
  "data/reddit-crypto/r/CryptoCurrency/comments/unejko/next_time_someone_tells_you_about_easy_money_you.json": "When I entered cryptomarket at early 2021, everyone was talking about how easily\nyou can make a fortune just by buying the right coin. You will be rich they\nsaid. Just hodl.\n\nBut few really knew how hard can it be to hodl through a market crash. Fewer\neven knew the toll it will take on your mental…",
  "data/reddit-crypto/r/CryptoCurrency/comments/ungzko/there_is_0_chance_that_98_drop_was_caused_by.json": "First of all, I am thankfully not invested in TerraLuna. My heart goes out to\neveryone impacted by the price drop and I hope you seek the necessary help.\nNothing is worth losing your life over.\n\nTerra's market dropped from 6.7 billion USD to 790 million USD in 24 hours. Do\npeople seriously think…",
  "data/reddit-crypto/r/CryptoCurrency/comments/umwhav/daily_discussion_may_11_2022_gmt0.json": "Welcome to the Daily Discussion. Please read the disclaimer and rules before\nparticipating.\n\n--------------------------------------------------------------------------------\n\n \n\n\nDISCLAIMER:\n\nConsider all information posted here with several liberal heaps of salt, and\nalways cross check any…",
  "data/reddit-crypto/r/CryptoCurrency/comments/ungne7/why_95_of_you_will_lose_money_on_this_sub_hard_to.json": "Being in crypto for over 6 years now (which shouldn't mean anything) and got\ninto solidity this sub has become unbearable for me this past year. Every single\npost 9 times out of 10 was pure hopium and anyone with a different view was\ndownvoted into oblivion. Majority of the posts here reminded me…",
  "data/reddit-crypto/r/CryptoCurrency/comments/unids5/an_important_warning_keep_your_money_safe_for_a.json": "Ladies and gentleman, please keep your money safe for a few days / weeks. Stop\nholding stablecoins if you can. USDT has been deppeged 1-1 for the last 7 hours,\nwith the highest daily trade volumes ever:\n\nhttps://imgur.com/a/rKXX81b\n\nOther stablecoins are suffering the pressure as well as people try…",
  "data/reddit-crypto/r/CryptoCurrency/comments/unenq4/seems_like_the_great_altcoin_reset.json": "Terra is literally bringing down the major altcoins like Solana, Avalanche,\nPolkadot. The bloodbath looks like it’s not over and we might find these\naltcoins trading much lower.\n\nI wouldn’t be surprised to see Polkadot trading at $5/$6 within the next days,\nSolana at $40 and Avalanche at $20.\n\nThe…",
  "data/reddit-crypto/r/Bitcoin/comments/unejuj/is_anybody_panicking.json": "I keep seeing articles, stories, posts, videos about how much bitcoin investors\nare panicking. I'm not panicking...have these people actually talked to anyone\nwho holds bitcoin?\n\nIs anyone here panicking?",
  "data/reddit-crypto/r/CryptoCurrency/comments/unmg5b/the_market_is_crashing_because_the_illuminati_is.json": "Best believe, it’s deliberate. How do I know? I just do. They’re watching me.\nWatching how I invest. When I invest in something, they move to sink it. When I\npull out, they inflate it.\n\nIt’s the Illuminati’s fault. They’re afraid that if I get rich, it could spell\nthe end of the world because I’m…",
  "data/reddit-crypto/r/CryptoCurrency/comments/unls6e/if_your_coin_can_go_to_0_due_to_an_attack_then.json": "Crypto exists in a space that is largely a completely unregulated free market.\nIf your crypto project can be made worthless due to some economic actors\nperforming a free market action, then that coin never had any worth to begin\nwith. Complaining about \"attacks\" post hoc is a useless activity that…",
  "data/reddit-crypto/r/Bitcoin/comments/unehob/musings_from_someone_who_has_been_buying_since.json": "This sub has been a guilty pleasure of mine for almost 8 years now. The memes,\nthe fear, the panic, and the echo chamber quality of it all. But above all, I\nstay for the quality memes. Here are some of my musings. Hopefully it can offer\nsome comfort for those of you who bought at ATH.\n\n1) Don't…",
  "data/reddit-crypto/r/CryptoCurrency/comments/unhdhw/a_stablecoin_implosion_is_not_even_over_yet.json": "What should a crypto exchange do right at the time a top 10 stablecoin is\nimploding with billions of dollars vanishing and people losing all their\nsavings?\n\nSurely not shill another algorithmic stablecoin that almost uses the same design\nas the one imploding...\n\nThats what Poloniex is doing.\n\nUSDD…",
  "data/reddit-crypto/r/CryptoCurrency/comments/unl1dp/seriously_chill_coinbase_is_not_going_bankrupt.json": "There's a run on Coinbase. Hysteria in r/Coinbase [/r/Coinbase], you'd think\nthere's blood running in the streets.\n\nAs I myself can attest, many people are unable to get their USD or coins out of\nCoinbase. Mysterious error messages happen if you try. (I can put money in and\nbuy though.)\n\nWhy? This…",
  "data/reddit-crypto/r/CryptoCurrency/comments/un6ts0/staking_coins_is_not_safe_as_its_being_built_up.json": "On a lot of threads here, people keep saying stake your coins for passive\nincome.. while passive income is indeed a good strategy (who doesnt like extra\nbeer money?), staking has massive risks as well which have played out with the\nongoing collapse.\n\nOn most staking networks, you have a long unlock…",
  "data/reddit-crypto/r/CryptoCurrency/comments/unparj/what_alts_do_you_see_surviving_the_bear_market.json": "Unless your Patrick from SpongeBobs roommate, you’ve noticed that the crypto is\ngetting absolutely nuked right now. I know everyone is saying “Just invest in\nBTC/ETH.” I get it. Those are safer and have less volatility.\n\nTruthfully, I’m not looking for safety. I’ll go to the stock market for…",
  "data/reddit-crypto/r/Bitcoin/comments/unktm3/should_i_buy_bitcoin_now.json": "Have never tried any crypto - is now a good time to buy bitcoin? 😀",
  "data/reddit-crypto/r/CryptoCurrency/comments/unum8i/dont_you_dare_use_your_emergency_funds_for_this.json": "I know I know, the dip is tempting. You looked at your bank account and think:\nHey, a couple of grand wouldn't be that bad, it's going back up.\n\nYes, it's going back up, but not in the short term tho. If you need money for\nbills, food and accommodation, please stop yourself from doing stupid shit.…",
  "data/reddit-crypto/r/CryptoCurrency/comments/unscze/are_prices_about_to_fall_off_a_cliff.json": "Stock prices are supported by something in the real world - corporate assets and\nearnings. Crypto prices are supported entirely by investor (speculator)\nconfidence. I think a lot of whales and little guys have been massively burned\nover the last 6 months. The little guys don't have money to put in…",
  "data/reddit-crypto/r/CryptoCurrency/comments/unqzmr/be_careful_we_may_fall_much_further.json": "Unless you have been living under a rock, we just experienced a catastrophic\ncrypto meltdown.\n\nPeople are understandably upset, posts here are now emotionally charged. However\nthe writing was on the wall as highlighted in my previous…",
  "data/reddit-crypto/r/CryptoCurrency/comments/unx4a2/dont_buy_the_dip.json": "(This was my post 110 days ago which never got approved)\n\nDip is 10-20% down. Don't buy it.\n\nWhen it happens, Redditors will jump on you screaming BUY THE DIP directly to\nyour ear. Don't buy it. You're calm, your mind is clear, you aren't fueled by\nemotions.\n\nSoon it will dip 20-30%. You will…",
  "data/reddit-crypto/r/CryptoCurrency/comments/unudb6/the_next_stable_coin_is_crashed.json": "The next stable coin is crashed.\n\n\nNEUTRINO USD\n\nNeutrino USD is crashed to 0,77 USD that is nealy a 20% crash on this stable\ncoin.\n\nNeutrino is an algorithmic price-stable assetization protocol acting as an\naccessible DeFi toolkit. It enables the creation of stablecoins pegged to\nspecific real…",
  "data/reddit-crypto/r/CryptoCurrency/comments/uny876/i_was_mad_about_only_earning_05_interest_in_a.json": "Back in November of last year I was trying to make a quick $500 so put some Fiat\ninto Crypto to see if I can earn more than 0.5% interest.\n\nFast forward to right now and my 37k turned into 12k.\n\nYep. So I need my portfolio to triple just to be behind 1k.\n\nAll I have to say is... Worst financial…",
  "data/reddit-crypto/r/CryptoCurrency/comments/unt5be/terraluna_sub_and_compassion.json": "I just took a trip over to r/terraluna [/r/terraluna] and I have to say, most of\nus are hurting right now but those people literally lost everything.\n\nThere is post after posts of users actively contemplating suicide after losing\neverything.\n\nI know it’s easy to dunk on their terrible Lead as all…",
  "data/reddit-crypto/r/Bitcoin/comments/uno6bn/thanks_to_all_the_toxic_bitcoin_maximalist_that.json": "I got into bitcoin back in 2019, when I was learning about it, I questioned\nabout other coins. Most bitcoiners said to stay away from other coins, that they\nweren’t decentralized and safe. At the begging I didn’t understand, even\nbelieved that other coin could be better. But as the years passed and…",
  "data/reddit-crypto/r/CryptoCurrency/comments/unrg3o/this_crash_has_taught_me_a_valuable_lesson_about.json": "I bought into crypto at the end of May 2021, around this time a year ago and\nDCAed every week until around the beginning of August before deciding to just\nhold and not DCA during the bullrun last year (best decision I made in\nhindsight). I have the majority of my portfolio in BTC and ETH with…",
  "data/reddit-crypto/r/CryptoCurrency/comments/uo24yb/i_think_i_finally_understand_bitcoin.json": "It's a silent project that operates in the background. There's no face to it.\nThe founders created it and walked away. It's like an elegant clock set into\nmotion that continues to tick away. There's no promise of some complex protocol\nto come 3, 5, or 10 years down the road. It does what it's…",
  "data/reddit-crypto/r/CryptoCurrency/comments/untkom/this_crash_was_desperately_needed.json": "The past year I became relatively entrenched in crypto. I would check the charts\nconstantly, along with research and spending way too much time doing so.\n\nAt a certain point, I had a large portion of my savings invested and began\nwondering if everyone was in some sort of fever dream.\n\nNew coins…",
  "data/reddit-crypto/r/CryptoCurrency/comments/uo09a4/the_reason_why_ust_failed_is_much_simpler_than.json": "Hi,\n\nso yeah we all know that UST has drastically de-pegged.\n\nmost people here believe that Citadel and Gemini or whoever did a coordinated\nattack to lower its value because they had loans in it (basically shorting it).\nNot like anyone cares to provide any sort of evidence for that because \"trust…",
  "data/reddit-crypto/r/Bitcoin/comments/uo2fet/i_think_i_finally_understand_bitcoin.json": "It's a silent project that operates in the background. There's no face to it.\nThe founders created it and walked away. It's like an elegant clock set into\nmotion that continues to tick away. There's no promise of some complex protocol\nto come 3, 5, or 10 years down the road. It does what it's…",
  "data/reddit-crypto/r/CryptoCurrency/comments/uo4337/luna_supply_has_inflated_425_since_may_9th.json": "Edit: Breaking Luna blockchain has been halted\n[https://www.theblockcrypto.com/post/146615/terra-blockchain-halted-to-protect-against-possible-attack].\nI’m not familiar with details of that yet, but read below for my initial post.\nThe blockchain has resumed without staking\n\nEdit2: multiple sources…",
  "data/reddit-crypto/r/CryptoCurrency/comments/uo6195/900000000_worth_of_positions_just_got_liquidated.json": "For the love of God and all that is holy. Please don't use leverage during\nturmoil like this. Stop trying to catch falling knives people! Wait a couple of\ndays for things to stabilise a little. We are in the middle of a major disaster\nand people keep trying to make a quick buck using leverage.…",
  "data/reddit-crypto/r/CryptoCurrency/comments/uo7o8z/after_13_years_of_crypto_most_of_the_market_is.json": "Now that we've had the latest face-melting event, and the crypto marketcap as a\nwhole has plummeted from ``$3 trillion to $1.25 trillion, I thought it would be\nworthwhile to survey the landscape a bit and see where things stand.\n\nOf the $1.25 trillion market cap, Bitcoin dominance is at 44.8%,…",
  "data/reddit-crypto/r/CryptoCurrency/comments/uo9v7w/this_right_now_is_peak_cryptofear_if_you_are.json": "Bitcoin just made its wickets below 28 and even further down to 25k. Luna is\nbasically going down in a literally straight line and achieved 1$ before even\nUST. We got over a billion long liquidations. Today the markets just shed $200B\nalone from the combined market cap. This is not everyday Crypto,…",
  "data/reddit-crypto/r/CryptoCurrency/comments/uoc0mi/i_turned_my_mother_in_laws_1000_to_1.json": "So As the title says pretty much, as a true gentleman, she insisted and I could\nnot refuse, I took her money, put it (you know where) and just under a few\nmonths managed to turn it to 1$\n\nWhen they said, never invest friends and families money, did I listen? No. Do I\nregret it? Also no, because…",
  "data/reddit-crypto/r/Bitcoin/comments/uo8q0k/why_are_people_panickingcashing_out.json": "I’ve only been in this space for a few years and this is so ridiculous to me.\nEveryone should be ecstatic they get to buy btc so cheap. Instead, people panic\nand sell everything. This is dumb for many reasons.\n\n 1. You’re selling for a loss\n 2. Nothing about Bitcoin has changed\n 3. You could get…",
  "data/reddit-crypto/r/CryptoCurrency/comments/uof2lx/warning_dont_buy_the_9999_dip.json": "The way the algorithm works for the mechanism means you can trade UST for equal\nvalue of LUNA. So the simple version is that when someone sells one UST for\n$0.40 then it creates another 400 LUNA if the price is at $0.001 per LUNA. And\nif the price is $0.0001 it will create another 4000 LUNA from…",
  "data/reddit-crypto/r/CryptoCurrency/comments/unvnyw/daily_discussion_may_12_2022_gmt0.json": "Welcome to the Daily Discussion. Please read the disclaimer and rules before\nparticipating.\n\n--------------------------------------------------------------------------------\n\n \n\n\nDISCLAIMER:\n\nConsider all information posted here with several liberal heaps of salt, and\nalways cross check any…",
  "data/reddit-crypto/r/CryptoCurrency/comments/uofhvf/what_do_you_think_do_kwon_is_doing_right_now.json": "Do you think he's just absolutely losing his mind right now? He's still watching\neverything burn to the ground and has gone silent since tweeting yesterday about\nhow he was in the process of fixing this whole mess. Circulating supply of luna\nhas sky rocketed today going from 345 million to 210…",
  "data/reddit-crypto/r/CryptoCurrency/comments/uofy2x/almost_1_trillion_terra_luna_are_now_minted.json": "https://terra.smartstake.io/ust\n\nThere are now over 1 Trillion Luna tokens minted (a little less in circulation),\nthis is a rise from 1,576,957,952 (1.5 billion) tokens…",
  "data/reddit-crypto/r/CryptoCurrency/comments/uogwbj/korean_newspaper_reports_that_do_kwon_requested.json": "https://twitter.com/DooWanNam/status/1524915757938667521\n\nThe source article is in Korean, but here's the Google translation\nhttps://news-mt-co-kr.translate.goog/mtview.php?no=2022051308574726920&MT_T&_x_tr_sl=auto&_x_tr_tl=en&_x_tr_hl=en&_x_tr_pto=wapp\n\nHe needs to totally get himself and his…",
  "data/reddit-crypto/r/Bitcoin/comments/uobqqc/bitcoin_has_survived_worse_it_has_survived.json": "Bitcoin has survived worse, it has survived corrections of 70-80% in the past.\n\n-2011: $30 to $2\n\n-2012: $220 to $70\n\n-2016: $1,100 to $200\n\n-2018: $20,000 to $3,000\n\n-2021: $64,000 to $30,000\n\n$BTC is the first real innovation of money since the creation of the Gold\nStandard in 1816",
  "data/reddit-crypto/r/Bitcoin/comments/uog6qa/its_a_total_bust_its_uninvestable_the_technology.json": "DO NOT INVEST IN FACEBOOK it is highly speculative...",
  "data/reddit-crypto/r/CryptoCurrency/comments/uobt7b/10_years_ago_the_point_of_cryptocurrency_was_to.json": "I like the idea of a fully decentralized p2p e-cash, is there anything that\nstill resembles this vision?\n\nAfter reading the bitcoin whitepaper which outlines how bitcoin was supposed to\nwork, crypto seemed really cool. But the vision of BTC is long dead and it no\nlonger aims to be what it was…",
  "data/reddit-crypto/r/CryptoCurrency/comments/uo96al/why_does_nobody_follow_the_dont_invest_more_than.json": "Scroll down the various cryptocurrency feeds for a few minutes and you will see\nwithin seconds dozens of people who invested more than they can afford to lose.\n\nWhy does literally nobody follow this advice? I put $500 into crypto (mostly a\nbag of ULTRASAFE coin and GenWealth coin and a little bit…",
  "data/reddit-crypto/r/CryptoCurrency/comments/uomt56/i_love_terrraaconneeect.json": "Hey hey hey! Hey hey hey! Hey hey hey!\nWhatsawhatsawhatsawhatsawhatsawhatsawhatsa up TERRACONNECT!\n\nHey hey hey everybody my name is Do Kwon and I am coming from Korea and let me\ntell you guys that I am so excited, I am so happy, I am really so thrilled to be\nright now sharing this amazing,…",
  "data/reddit-crypto/r/CryptoCurrency/comments/uoo43v/terra_is_now_going_full_mental_the_community_is.json": "source:\nhttps://twitter.com/stablechen/status/1525023238895837184?cxt=HHwWgIDRycmj_KkqAAAA\n\nSo just rewriting history is now a serious option. I am sure this is legal and\nthe exchanges will surely have nothing against this :D\n\nHonestly why can't they just stop. This hurts the whole cryptospace and…",
  "data/reddit-crypto/r/CryptoCurrency/comments/uomd9j/ccip031_remove_vaultless_users_below_10_karma.json": "Problem:\n\nAs we all know, the crypto-space is flooded by spams, scams, shills, bots etc...\nand of course, r/CryptoCurrency [/r/CryptoCurrency] is no exception. While most\nusers don't see this spam due to our bots removing it, this affects our\ngovernance token by lowering the ratio as well as the…",
  "data/reddit-crypto/r/CryptoCurrency/comments/uopa1b/people_blaming_matt_damon_show_that_so_many.json": "If you invested while near the top and you lost a lot of your money, that's on\nyou. Though I'm sure most people here know this, and it's people on twitter and\nfacebook that are insulting and harassing Matt Damon for his ad that pushed so\nmany to start investing.\n\nThat upward swing was never meant…",
  "data/reddit-crypto/r/CryptoCurrency/comments/uoop7f/germany_announces_no_tax_on_crypto_sales_for.json": "While the crypto world is going crazy, Germany publishes a crypto sale tax\nguide. According to Katja Hessel, German Parliamentary State Secretary, crypto\ntraders can get tax exemption benefits on the sale of digital currencies.\nFurthermore, if they have held onto their assets for one year or more,…",
  "data/reddit-crypto/r/CryptoCurrency/comments/uot7vh/im_a_bit_shocked_the_crypto_market_isnt_trading.json": "Anyone else surprised? The macro economic factors look bleak. The nasdaq sold\noff like crazy, including Apple, ostensibly the top dog. One of the “most\npromising” crypto projects outright failed, alongside its stable coin. A stable\ncoin failing breaches a lot of trust. That and Kwon sold off a ton…",
  "data/reddit-crypto/r/CryptoCurrency/comments/uoyyc0/genuine_question_if_everyone_now_is_talking_about.json": "I have seen and watched multiple videos recently about how something like\nLuna/UST was always going to be unsustainable and that 19.5% apy for staking it\ncouldn't work long term.\n\nIf all that is so obvious now, why couldn't people see it before the crash? I\nknow people were warning Do Kwon that…",
  "data/reddit-crypto/r/CryptoCurrency/comments/uowhud/new_proposal_by_do_kwon.json": "https://agora.terra.money/t/terra-ecosystem-revival-plan/8701\n\nSo finally he broke the silence and he proposed in a forum discussion about his\n“recovery plan”.\n\nI am already highly skeptical with the blockchain being salvageable, but looking\nat this proposal it is very underwhelming.\n\nMy opinions…",
  "data/reddit-crypto/r/CryptoCurrency/comments/up09rm/are_you_all_starting_to_understand_toxic_af.json": "New crypto users often mistake the conduct and attitudes from experienced\nBitcoiners as them just trying to protect BTC bags and \"outdated technology\".\nWhat new users don't understand is that these people HAVE SEEN SOME SHIT.\n\nImagine living through not just the Terra/Luna meltdown but also…",
  "data/reddit-crypto/r/CryptoCurrency/comments/uozt3h/the_algorun.json": "The ALGOrun - FAQ, Responses, Ideas\n\nTL;DR: Take your ALGO off exchanges unless you are actively trading. June 5 is\nthe target \"date\" of the ALGOrun, but really this an ongoing affair. This is\ngood for decentralization of the ALGO chain.\n\nNot long ago, our brethren in Monero staged the Monerun. It…",
  "data/reddit-crypto/r/CryptoCurrency/comments/up2mna/emergency_security_warning_multiple_sites.json": "Looks like many sites have been hit with a front end attack. Some like Spirit\nSwap are reporting the attacker managed to change swap address by hacking into\nAWS..\n\nCoinGecko…",
  "data/reddit-crypto/r/Bitcoin/comments/uou8nz/just_reached_001_bitcoin_for_the_first_time_ever.json": "I know it ain’t much but hear me out. I have been following actively the crypto\nmarket for 6 years now (Since I was 18 y/o). The first time I heard about\nbitcoin I was a 12y/o kid who had just heard about the deep web and how Bitcoin\nwas used to pay for assassinations and drugs and child porn and…",
  "data/reddit-crypto/r/CryptoCurrency/comments/up7o9q/we_are_ready_to_listen_this_is_a_maximum_fud.json": "As the post title says, we keep seeing all these people crawling out of the\nwoodwork to say “see? I told you 3 months ago that LUNA/UST was going to crash,\nbut no one listened”. They say hindsight is 20/20, so maybe all the signs are\neasier for people to see when it's already happened, but as we've…",
  "data/reddit-crypto/r/CryptoCurrency/comments/upctln/wcgw_if_i_buy_10_worth_of_terral_right_now.json": "So now I am thinking about throwing $10 at LUNA, and buy 50k tokens, ofcourse it\nis going to be a gamble.\n\nI think people should take this risk, and throw $10 at LuNA and treat it as a\nlottery ticket, if the prices recovers then it would be good., if not then what\nit will cost $10,the risk and…",
  "data/reddit-crypto/r/CryptoCurrency/comments/upjjfk/do_kwon_is_turning_the_situation_from_a_failed.json": "While a police report have been made against Do Kwon, on behalf of UST and Luna\ninvestors in Singapore, CZ is publicy asking on twitter where the BTCs are, that\nwere supposed to buyback Luna.\n\nBut in the meantime Do Kwon making proposals to fork a worthless coin on a\nwortless chain? He is supposed…",
  "data/reddit-crypto/r/CryptoCurrency/comments/upj2sz/how_many_times_do_people_need_to_get_scammed.json": "We saw it with squidgame coin, we saw it with CRO and people blaming Matt Damon,\nand now it's being reported that the creator of LUNA and his family are afraid\nfor their lives. Now, the creator of LUNA is obviously much more at fault in\nthis case, but it's not like this shit couldn't be seen from…",
  "data/reddit-crypto/r/CryptoCurrency/comments/upqjor/its_crazy_how_you_can_hodl_the_best_projects.json": "I'm not saying it's either bad or good, it's just truly crazy.\n\nYes, buying ETH or BTC at the start of their existence and HODLing till 4K or\n67K, was really smart and worth it.\n\nBut now, holding the best projects will double your money in the best case and\nthrowing $100 at a random Shitcoin or…",
  "data/reddit-crypto/r/CryptoCurrency/comments/upnbl9/psa_crypto_is_full_of_software_engineers_with.json": "The title says it all. Crypto is dominated by software engineers who think they\nare more knowledgeable than they actually are, especially when it comes to\nfields like economics and finance that are FAAAAR out of their wheelhouse.\n\nTerra's failure was a failure of economics more than it was a…",
  "data/reddit-crypto/r/Bitcoin/comments/upp3q2/been_buying_bitcoin_every_month_since_october.json": "So I got obsessed with bitcoin back in October 2017. Was really bummed I found\nit so late and it was too late to have any sizeable amount of bitcoin anymore.\nDecided to buy as much as possible and tightened the budget to buy maximum\namount every month. Been doing that for 56 months and gonna…",
  "data/reddit-crypto/r/Bitcoin/comments/upl5wg/40_of_all_dollars_were_printed_in_2020.json": "Read that title carefully. 40%. It doesn't even include the dollars printed in\n2021, and the first quarter of 2022.\n\nPeople around Reddit are saying \"the dollar is getting stronger!!1\". No it\nisn't. It is getting stronger compared to other currencies that haven't stopped\nthe money printing. I don't…",
  "data/reddit-crypto/r/CryptoCurrency/comments/upmpkg/the_only_people_panicking_right_now_are_the_ones.json": "When you’re in the green and making lots of profits your brain will\nautomatically make you double down even though you told yourself multiple times\nthat “this is enough”That’s just how human greed works. The majority of FOMO\nafter all is simply just greed and events like this one should always be…",
  "data/reddit-crypto/r/CryptoCurrency/comments/upygce/do_kwon_disolved_terraform_labs_on_april_30th.json": "KWON-DO-HYUNG is listed in this Korean document as disolving his company\nTerraform Labs on April 30th, registered May 4th. The act of dissolving just\ndays before the collapse of UST suggests the intent to eliminate responsibility\nof the aftermath, which serves as evidence that he knew something was…",
  "data/reddit-crypto/r/Bitcoin/comments/upvfim/the_next_612_months_will_be_the_best_opportunity.json": "Stack hard and hold on tight. Enjoy!",
  "data/reddit-crypto/r/CryptoCurrency/comments/upuach/discussion_about_usdt_crashing_behind_the_scenes.json": "Hello everyone,\n\nI wanted to make my own thread of this issue because in the other thread, I did\nnot feel that it compiled enough information in the body of the post to\nfacilitate a healthy discussion of the current situation.\n\nUSDT has lost about 6.6b in market cap since May 11, 2022 (~9% of their…",
  "data/reddit-crypto/r/CryptoCurrency/comments/uq331f/this_sub_is_a_lot_more_bearable_during_a_bear.json": "Obviously we all like green and that's why we're invested in this market. But\none thing that struck me is how calm or more balanced this sub has become as a\nresult of a bear market.\n\nDuring the bullrun of 2021 this place was so full of scammers, bots, hype and\njust pure psychosis that anything…",
  "data/reddit-crypto/r/CryptoCurrency/comments/uq038j/fyi_justin_trons_new_stable_coin_usdd_is_just.json": "It launched like 2 weeks ago and he's shilling insane rates (20-40%) on his\ntwitter.\n\nWhite paper - https://usdd.io/USDD-en.pdf\n\nTron interview with coindesk about USDD\nhttps://www.coindesk.com/markets/2022/05/14/justin-sun-talks-usdd-stablecoin-in-wake-of-lunaust-unravel/\n\n“I still believe in…",
  "data/reddit-crypto/r/CryptoCurrency/comments/uptzf5/we_should_see_bitcoins_price_increase.json": "Bitcoin (BTC) is now halfway to its next halving.\n\nA 50% reduction in block rewards paid to miners on the network (which occurs\nabout every four years) is expected to happen around March 30 of 2024.\n\nThe reward will be cut in half from BTC 6.25 to BTC 3.125 per block mined.\n\nDo we expect a reaction…",
  "data/reddit-crypto/r/CryptoCurrency/comments/uq03w1/ok_im_in_for_2_just_wanna_be_apart_of_crypto_lore.json": "Ok I’ve decided to be apart of this LUNA implosion event and have just invested\n$2 into the project.\n\nHaving barely heard of the project up until this week and to have seen it’s\nprice plummet from the $100s to the $0.00001s I have decided I now no longer\nwanna sit on the sidelines of this epic…",
  "data/reddit-crypto/r/CryptoCurrency/comments/uq9nq4/if_you_have_438_moons_thats_equivalent_to_having.json": "The current supply of our very own subreddit's community ERC-20 token MOON is at\n92 million.\n\nIf you manage to open your reddit vault and manage to earn 4.38 MOONs, you have\nthe percentage ownership of having 1 full Bitcoin in the Bitcoin ecosystem.\n\n92,000,000/21,000,000 = 4.38\n\nWhile monetary…",
  "data/reddit-crypto/r/CryptoCurrency/comments/uqcwaf/is_crypto_actually_useful.json": "I'll try to keep it simple : try to think about crypto from the perspective of a\nno-coiner, you know, an everyday average Joe.\n\nApple makes phones, Spotify gives you music streaming, Chase keeps your money\nsafe, KFC serves you chicken wings, Zoom helps employees communicate, but what\nthe fuck does…",
  "data/reddit-crypto/r/CryptoCurrency/comments/uqbllg/the_nano_network_has_been_subject_to_ddos_and.json": "From the Nano sub: Nodes on the network are being directly attacked with a heavy\nload of unchecked blocks that are slowing them down as it ties up disk write\noperations, causing node processes to spend time waiting for these writes to\nfinish. Enough nodes are being targeted to cause settlement…",
  "data/reddit-crypto/r/CryptoCurrency/comments/uq4bhc/people_who_know_how_to_control_both_their_panic.json": "It’s really easy to say “don't panic” or “don't buy the hype” when in reality\nits VERY hard to disregard and ignore these feelings cause they’re wired into\nthe brains as human beings.\n\nAny investor that knows how to control these feels needs to have A LOT of will\npower and patience which obviously…",
  "data/reddit-crypto/r/CryptoCurrency/comments/uqe9hw/i_took_my_crypto_off_coinbase_today_im_now_the.json": "After the recent market turmoil I became anxious that Coinbase might collapse\nand I'd lose my Bitcoin.\n\nThe Coinbase share price has fallen from $345 to only $53 in six months.\nAlthough unlikely, it's possible that Coinbase will go out of business and\neveryone who holds their crypto on the exchange…",
  "data/reddit-crypto/r/CryptoCurrency/comments/uqi69g/this_weeks_crash_had_to_happen_for_the_betterment.json": "We’ve all have seen or have become aware of what had happen with Luna this week.\nIt’s frightening. A top 10 asset, stablecoin at that, has crumbled to zero.\nPeople have lost millions in this. Imagine going for a week-long vacation and\nyou’ve come back, your life savings disappeared. I’m really…",
  "data/reddit-crypto/r/CryptoCurrency/comments/uqnjre/we_are_in_the_phase_of_disbelief_in_crypto.json": "Just look around you, left and right people and quitting crypto because \"they\ndon't believe in it anymore\" but the true reason why is because they aren't\nmoney off it anymore. If we were in a bull market where we would see green\ncandles all day everyday they wouldn't dare get out but the opposite…",
  "data/reddit-crypto/r/CryptoCurrency/comments/uqp4we/explanation_of_how_usdt_could_burn_8_billion_with.json": "Nearly 70% of all the USDT ever printed was given to just two companies Alameda\n( FTX owners) and Cumberland ( Binance Market Makers). The remaining amounts to\nsimilar Market Makers and CEX associated entities\n\nLet us be clear Tether and by extension Deltec ( bank for Tether) and Ifinex's (\nowners…",
  "data/reddit-crypto/r/CryptoCurrency/comments/uqs81m/lfg_just_confirmed_they_have_sold_most_of_their.json": "As of Saturday, May 7, 2022, the Luna Foundation Guard held a reserve consisting\nof the following assets:\n\n· 80,394 $BTC\n\n· 39,914 $BNB\n\n· 26,281,671 $USDT\n\n· 23,555,590 $USDC\n\n· 1,973,554 $AVAX\n\n· 697,344 $UST\n\n· 1,691,261 $LUNA\n\nConsistent with its non-profit mission & focus on the health of the…",
  "data/reddit-crypto/r/CryptoCurrency/comments/ur25ka/a_police_report_has_been_filed_in_singapore.json": "Terra / LUNA, once in the top 10 of the crypto capitalization list, crashed more\nthan 99% from its all-time high and its holders saw their portfolio being\ndestroyed in a few days. This event caused a general cryptocurrency bloodbath as\na reaction.\n\nA police report has been filed yesterday by a…",
  "data/reddit-crypto/r/CryptoCurrency/comments/ur7uqe/analysis_shows_a_possibility_that_lfgoperators.json": "Transaction analysis has uncovered a possible series of transactions that could\nhave possibly allowed few holders to cash out almost at 100% peg, while majority\nwho held on till late lost all their savings.\n\nThis becomes even more suspicious as LFG and other operators are not releasing\nevidence of…",
  "data/reddit-crypto/r/Bitcoin/comments/ur2t4n/i_finally_took_my_coins_out_of_coinbase.json": "I have been hodling for several years at this point, and have had \"not your\nkeys, not your coins\" drilled into my head, but have kept my coins on Coinbase\nthe whole time anyway. I even bought a hardware wallet several years ago but was\ntoo nervous to actually transfer my coins to it. I figured a…",
  "data/reddit-crypto/r/CryptoCurrency/comments/uqzzav/i_bought_1000_worth_of_alts_yesterday_as_a_long.json": "I posted about this plan last week and went through with it yesterday. I’m sure\nI could of timed it better. But my plan is to stake what’s available of these\nand cold storage the rest. The plan would be to revisit all these purchases\nbetween 2024-2026. If they’re still alive either hodl longer or…",
  "data/reddit-crypto/r/CryptoCurrency/comments/urqhib/during_the_last_bear_market_bitcoin_reached_a.json": "Decided check the Daily post on the three days in the past around the last\nbitcoin bottom and see what people were discussing around that time. Links to\ndaily post and screen shots of some of the top comments below.\n\nDecember 13,…",
  "data/reddit-crypto/r/CryptoCurrency/comments/urtbhx/tether_has_not_reported_its_supply_for_3_days_now.json": "Tether is usually reports its supply on their official website once every day,\nat an inconsistent time. That's why you can see stairs like this on a market cap\nchart:\n\nTether market cap in the past 7 days - not counting the depeg it's the same as\nthe…",
  "data/reddit-crypto/r/CryptoCurrency/comments/urxd6o/founder_of_maker_called_it_4_months_ago.json": "Not to beat a dead horse, but on another episode of Everyone Saw This Coming,\nthe founder of Maker predicted the Terra crash. 4 months ago.\n\nhttps://imgur.com/gallery/3MtTiWd\n\nIt seems anyone who was in the crypto space saw the obvious Ponzi scheme of\nTerra Luna for what it was.\n\nHow could this…",
  "data/reddit-crypto/r/CryptoCurrency/comments/usg3lo/𝟐𝟎𝟐𝟓.json": "🅸 🅷🅰🆅🅴 🆂🅿🅴🅽🆃 🅼🅾🅽🆃🅷🆂 🅾🅽 🆃🅷🅸🆂 🅸🅽🅵🅾🆁🅼🅰🆃🅸🅾🅽,\n🆂🅾🅼🅴🆃🅸🅼🅴🆂\n🆆🅾🆁🅺🅸🅽🅶 🆃🆆🅴🅽🆃🆈 🅵🅾🆄🆁 🅷🅾🆄🆁🆂 🅰 🅳🅰🆈 🆃🅾 🅼🅰🅺🅴 🆂🆄🆁🅴\n🅸🆃 🆆🅰🆂\n🅲🅾🆁🆁🅴🅲🆃. 🅸 🅷🅰🆅🅴 🅰🅻🆂🅾 🆂🅴🅽🆃 🆃🅷🅸🆂 🅾🆄🆃 🆃🅾 🆃🅷🅴\n🅱🅴🆂🆃 🅼🅰🆃🅷\n🅼🅰🅶🅸🅲🅸🅰🅽🆂…",
  "data/reddit-crypto/r/CryptoCurrency/comments/us4w6f/for_all_you_hoping_for_tether_to_die_a_quick_and.json": "Been seeing even more “rip the bandaid off” and more amateur sleuthing into how\ntether is worthless/smoke and mirrors. Some have gone so far to call tether a\ncancer that must die for crypto to ascend to some magical new ath.\n\nPersonally, I acknowledge that they aren’t a model coin and do have…",
  "data/reddit-crypto/r/CryptoCurrency/comments/ushp7c/tether_explains_how_it_is_able_to_maintain_its.json": "Tether's official website released an article named \"How Tether USD₮ Is Able to\nMaintain Its Peg When Other Stablecoins Fall\". So, there should be a\nprofessional explanation about their reserves? Nope.\n\nThe entire article is pretty much useless:\n\n> Given the recent losses UST investors suffered,…",
  "data/reddit-crypto/r/CryptoCurrency/comments/useyr9/lets_be_real_the_current_macroeconomic_situation.json": "Bitcoin still being on 29k shows that it's quite struggling to make a V-shaped\nrecovery after hitting high support levels on 25k. Bitcoin got constantly\nrejected at ~31k the past days and it does not look like anything is making a\nfast recovery just now.\n\nCrypto prices, as every other financial…",
  "data/reddit-crypto/r/CryptoCurrency/comments/uswdhh/people_investing_in_high_yield_projects_need_to.json": "You cannot escape basic finance. Crypto is NO DIFFERENT to everyday finance,\nhere is why.\n\nYou cannot have a system where savings are higher than lending rates. You cannot\nhave high APR’s without inflation in the token supply.\n\nHigh APR’s just mean infinite money printing, and high inflation in the…",
  "data/reddit-crypto/r/CryptoCurrency/comments/ut3exb/tether_just_released_its_quarterly_reserve.json": "So after the UST/Luna fiasco, stablecoins have rightfully came under much more\nscrutiny. And everyone in this space knows that USDT (Tether) has long been\nsuspected of hiding its true reserves.\n\nThis morning, Tether published a report\n[https://tether.to/en/assurance-opinion-once-again-re-affirms…",
  "data/reddit-crypto/r/CryptoCurrency/comments/ut4esc/stablegains_a_registered_company_in_us_was_taking.json": "Remember this was a small setup company registered in USA. They were taking\nfunds from customers and going balls deep in Anchor for that 20% gains without\ntelling their customers. Now they have lost $42M of funds.\n\n\n\nRegistered…",
  "data/reddit-crypto/r/Bitcoin/comments/ut85et/all_this_dip_fiesta_we_are_living_through_has.json": "Imagine what I can accomplish just by dcaing. I‘m feeling good & positive.",
  "data/reddit-crypto/r/CryptoCurrency/comments/ut38av/1k_invested_into_the_top_ten_cryptos_in_january.json": "EXPERIMENT - Tracking Top 10 Cryptos Of 2021 - Month Sixteen – UP +177%\n[https://preview.redd.it/gzyvmghslf091.png?width=666&format=png&auto=webp&s=279162274d11be3909a53358d8dca2eb94a0b3b1]\n\nFull blog post with all the tables here\n[https://toptencryptoindexfund.com/tracking-2021-top-10…",
  "data/reddit-crypto/r/CryptoCurrency/comments/utd5se/i_finally_have_wife_changing_money.json": "It finally happened. I know it’s what we all dream about, but I finally have\nwife changing money! And it’s all thanks to this glorious dip and my investment\nstrategies! I do remember they always said that the bear market is where the\ntrue riches are made. They were right.\n\nThey say I’m one in a…",
  "data/reddit-crypto/r/CryptoCurrency/comments/ut8kh1/you_really_shouldnt_try_to_convince_or_even_talk.json": "It's not worth it, trust me. Any gains they make will be their own\naccomplishment and any losses will be all your fault.\n\nMoreover, I'm of the opinion that you definitely don't want to be the \"crypto\nguy\" in your family or friend group, for many reasons. First, you probably won't\nendear yourself to…",
  "data/reddit-crypto/r/CryptoCurrency/comments/uto6j0/5_years_ago_today_bitcoin_hit_2000_for_the_first.json": "I would've never thought that Bitcoin will reach these huge price marks, not\neven close to thinking that we would be calling these high price numbers, \"the\nbottom of a crash\". As we have seen a lot can happen in 5 years.\n\nWhat do you think the next 5 years hold for us in the cryptocurrency…",
  "data/reddit-crypto/r/Bitcoin/comments/utfmkj/i_have_just_bought_my_first_1000_dollars_in.json": "I am 4 years old and am looking to make money for college funds and my future\ncareer. I don't have any money in the bank I could spend on bitcoin, but I\nremembered I had around 2000 Dollars in an old Skrill account of mine, which is\nnow 1000 Dollars because of fine's for inactivity. I have seen…",
  "data/reddit-crypto/r/CryptoCurrency/comments/utoqtu/litecoins_privacy_upgrade_has_just_activated.json": "It's official, litecoins major privacy upgrade MWEB has now activated. Shortly\nyou should see major exchanges rolling it out in the coming weeks.\n\nLitecoin will have now has an optional privacy feature which will allow users to\nhide their address and crypto amounts when transferring (In addition to…",
  "data/reddit-crypto/r/CryptoCurrency/comments/utrfno/i_asked_an_anticrypto_sub_with_100k_members_for.json": "> 1. The existence of exchanges has made Bitcoins core claims completely\n> irrelevant.\n> \n> 2. it is, at best, a toy. in reality it's a massive disaster. to people who\n> were scammed. to the environment. to victims of ransomware. the list goes on\n> and on. right now a million crypto bros are…",
  "data/reddit-crypto/r/CryptoCurrency/comments/uuaj5b/for_those_thinking_that_luna_will_come_back_to.json": "TL;DR — I'll show you that it's mathematically impossible (under some\nassumptions, of course) that LUNA's price can't go back up to its' glorious days\nagain.\n\n\n\n\nLET'S DO SOME METH—UMM I MEANT MATH!\n\nThere are some important assumptions we need to make. This mini-analysis assumes\nthat:\n\n * UST will…",
  "data/reddit-crypto/r/CryptoCurrency/comments/utv42c/the_tezos_ecosystem_career_fair.json": "https://preview.redd.it/datspkv3pm091.png?width=1920&format=png&auto=webp&s=aca113f3041a1cb26fd1298198e567292a08693e\n\nHello everyone, and welcome to the Tezos ecosystem career fair! We’ve noticed\nthat many people on r/Cryptocurrency [/r/Cryptocurrency] seem to have an\ninterest in getting a job in…",
  "data/reddit-crypto/r/CryptoCurrency/comments/uuitqp/ama_with_cz_binance_ceo.json": "Hi r/CryptoCurrency [/r/CryptoCurrency] - thanks for having us today.\n\nAccounts you can expect to see in this thread:\n\n * /u/cpzhao - that's CZ! If you don't know CZ, he's the CEO of Binance.\n * /u/Binance - that's us, Binance!\n\nCZ will be here answering questions at 1:30pm UTC for around an hour.…",
  "data/reddit-crypto/r/CryptoCurrency/comments/uuitqp/removed_by_reddit.json": "[ Removed by reddit on account of violating the content policy\n[/help/contentpolicy]. ]",
  "data/reddit-crypto/r/CryptoCurrency/comments/uumhsm/ceo_of_binance_might_have_been_hit_harder_than_we.json": "CEO of Binance Changpeng Zhao's Luna investment of about $3 million which peaked\nat $1.6 Billion dollars came crashing down to just worth $3000. He also had\nsome(a lot) of UST staked too.\n\nChangpeng now also holds the title for Losing the most money in History from $97\nbillion to just $11…",
  "data/reddit-crypto/r/CryptoCurrency/comments/uuskgo/12_years_ago_today_history_was_made_when_laszlo.json": "Today May 22, 2022 crypto lovers are celebrating Bitcoin pizza day. Our 12th\nanniversary.\n\nPreviously cryptos were not accepted as a payment method, but after a man from\nFlorida bought a meal using Bitcoin, that was all people could talk about.\n\nOn 22 May 2010, Laszlo Hanyecz, a programmer and BTC…",
  "data/reddit-crypto/r/Bitcoin/comments/uul8o3/regulation_two_birds_one_stone_my_dark_maximalism.json": "Regulation is coming for altcoins. Most of the 17,000 will disappear. This is\nthe s-curve adoption shakeout we as bitcoiners have been warning about for\nyears. SEC Chair Gary Gensler met with the FTC on Wednesday, and again\nreiterated that bitcoin is NOT a security, but that \"Many, I'd say most of…",
  "data/reddit-crypto/r/Bitcoin/comments/uuy972/as_we_currently_enter_a_recession_worse_than_2008.json": "In 2007 as stocks formed their final peak before crashing during the 2008 global\nfinancial crisis everything fell alongside stocks. Even gold tanked and for six\nlong months kept declining alongside stocks.\n\nBut then a decoupling happened, after the inital panic where everything got\ncaught up in a…",
  "data/reddit-crypto/r/CryptoCurrency/comments/uv05zs/usdtea_depegged.json": "Just after u/evelynvee [/u/evelynvee] posted shilling USDTea, a new stablecoin\nbacked by Arizona Iced Tea, I went to the local supermarket to grab as many $1\ncans as I could and found this! [https://imgur.com/a/NPmz8PG] Now the stablecoin\nhas already depegged and is soon to crash to $0. I feel bad…",
  "data/reddit-crypto/r/CryptoCurrency/comments/uv6f5v/crypto_has_never_existed_through_a_global.json": "I’m seeing far too much chatter from people who are a.) sure we are entering a 2\nyear bear market and others who are b.) sure this is just a dip in an extended\ncycle.\n\nI have a question for all of you people: when was the last time you were hungry,\nand I mean really hungry? When was the last time…",
  "data/reddit-crypto/r/CryptoCurrency/comments/uut8iu/do_kwon_on_why_he_wont_steal_3_bn_stealing_3_bn.json": "Old posts on lunatic forums are turning out to be gems..\n\nWhen asked about the keys to a \"burn wallet\" (usually a wallet where funds are\nsent so they can never be recovered) but in this case seemed like a user\ncontrolled wallet being used as a burn wallet...\n\nDo Kwon replied that he controls the…",
  "data/reddit-crypto/r/CryptoCurrency/comments/uv21h0/til_in_the_90s_bill_gates_was_a_big_enthusiast_of.json": "Before bitcoin there was digiCash and its creator David Chaum. He was the first\nto describe digital money and wrote his paper in 1983.\n\nquotes from the article:\n\n> In his paper, he describes the key point that his digital money differs from\n> credit card payments through anonymity. Users receive…",
  "data/reddit-crypto/r/CryptoCurrency/comments/uvfhmn/do_kwon_arrogance_is_on_another_level_it_has_also.json": "Twitter user FatmanTerra recently tweeted a thread about Do kwon's arrogance\nwhich costed Anchor users in $20.8 in losses.\n\nhttps://preview.redd.it/x96ux0tt82191.png?width=668&format=png&auto=webp&s=39f5400a539fb16f5e00a06da3c8932ef30f6435\n\n> In August of 2021, whitehat dev\n> \n> @0xfr_ (Twitter)…",
  "data/reddit-crypto/r/Bitcoin/comments/uv6whu/achieved_my_btc_goal_of_01.json": "I’m so stoked to say I have finally achieved my goal of 0.1 BTC. It may not\nsound like much to some but I have hope that one day it might help me out to buy\na house using this amount.\n\nI have been stacking sats for the past year and a half and just putting bits in\nwhen ever I can. If you can take…",
  "data/reddit-crypto/r/CryptoCurrency/comments/uvpenp/gamestop_wallet_launch_layer_1_on_ethereum_and.json": "Not sure your views on Loopring, not sure it matters cause it’s good news for\nall, but the GameStop NFT beta wallet has just launched!\n[https://twitter.com/gmedd/status/1528517009629016064?s=21&t=1GX0imOnDfI-TUJ3WFrAyg]\n\nFeatures include 1) your keys, your wallet 2) decentralized Ethereum apps…",
  "data/reddit-crypto/r/CryptoCurrency/comments/uvfpeq/bitcoin_was_priced_at_5000_in_march_2020_why_is.json": "You guys are really out of your fucking mind. Around 2 years ago in march 2020,\nBitcoin's price was around 5000$ and now its around 29000-30,000$\n\nThats literally x6 in two fucking years. The people who were against bitcoin\nback then should be underneath our fucking feet begging for their regret.…",
  "data/reddit-crypto/r/CryptoCurrency/comments/uvzw4f/lunatic_community_member_fatman_alleges_insider.json": "FatMan is a popular account on the Lunatic community and governance groups, and\nsince the debacle he has been extremely critical of what happened and the\nworkings of the insiders in the collapsed scheme.\n\nJust few hours ago, he has made startling revelations claiming he has been\napproached by…",
  "data/reddit-crypto/r/Bitcoin/comments/uw39wx/bitcoin_could_fall_to_8000_analyst_warns_but.json": "All these “news” article headlines are getting so old. I don’t even bother\nreading them anymore. I will say these are most likely not good “selling” prices\nbut yes prices COULD fall even more.. prices also will most likely rebound once\nsome negative macro economic activity slows down (hopefully…",
  "data/reddit-crypto/r/CryptoCurrency/comments/uw5xiz/bitcoin_had_its_8th_red_week_in_a_row_the.json": "With the recent weekly close, Bitcoin once again clearly ended up as a red\nweekly candle. It's now the eight red candle in a row for Bitcoin, something\nthat never happened before. The last record was six red candles and that dates\nbackt to even 2013. One thing is sure we are in a bear market and…",
  "data/reddit-crypto/r/CryptoCurrency/comments/uw6ysk/the_crypto_community_is_still_way_too_inmature.json": "I hate having to say this but it is true. One of the many reasons people hate\ncrypto is the community itself. I would rather spend one week watching\nr/animemes [/r/animemes] than spending one hour looking at crypto twitter.\n\nAnd im not talking only about ape pfps being, well, ape pfps; im talking…",
  "data/reddit-crypto/r/CryptoCurrency/comments/uwlkfg/move_to_earn_like_stepn_are_the_latest_ponzis.json": "Move to earn apps are gaining popularity and many seem to even think all of this\nis sustainable. A huge number of such apps have just launched out of nowhere.\n\nStepn for their part helps further the scam by closely controlling how many\ninvites can be sent out each day, thereby ensuring…",
  "data/reddit-crypto/r/CryptoCurrency/comments/uwexge/immutable_x_gaming_collections_coming_soon_to_the.json": "Immutable X also partnered with GameStop and has committed $100M in grants to\nbring premium Web3 content to the GameStop NFT marketplace.\n\nThese are going to be some of the biggest NFT gaming experiences coming in the\nFuture, I decided to give you a quick run down of what to expect.\n\nGods Unchained…",
  "data/reddit-crypto/r/CryptoCurrency/comments/uw8cta/loopring_and_gme_have_a_chance_to_trigger.json": "I get it GME and Loopring are both memes yada yada yada, but there is a perfect\nstorm brewing:\n\nInflation is running rampant, markets are collapsing, banks have super high\ninterest rates, and in general, there seems to be a general distrust in the\nestablished authority, who time and time we have…",
  "data/reddit-crypto/r/Bitcoin/comments/uwpfce/im_14_with_my_own_hardware_wallets_and_completely.json": "Putting this edit at the top: I worded the title badly, I do not “completely\nunderstand” how bitcoin works. I’m asking for peoples opinions if it’s a good\nidea to do what I’m doing. I understand the fundamentals and systems behind\nBitcoin, but I’m still learning.\n\nThis isn’t probably the type of…",
  "data/reddit-crypto/r/CryptoCurrency/comments/uwttok/friend_has_500k_in_gains_he_cant_access.json": "For starters this seems to me like a total scam. But I'm no crypto expert and\ndon't trade any. I figured I'd come here and ask the best.\n\nHere [https://imgur.com/a/a3SJNMh] are a few screenshots showing the balance and\nthe \"support teams\" response in order to withdrawal it all.\n\nThey claim he needs…",
  "data/reddit-crypto/r/CryptoCurrency/comments/uwv2yv/refuting_the_latest_antibitcoin_list_of_points.json": "Recently, r/buttcoin [/r/buttcoin] posted a list of all the main problems they\nhave with Bitcoin and crypto.\n\nIt kind of looked like it could be their manifesto:\n\nhttps://np.reddit.com/r/Buttcoin/comments/uvz90h/to_the_rbitcoiners_that_keep_coming_to_this_sub/\n\n(Please, remember Reddit's rules, and…",
  "data/reddit-crypto/r/CryptoCurrency/comments/uwy6um/its_been_a_year_since_elon_musk_announced_hed_be.json": "April 2021\n\nSadly Sporklin a Dogecoin developer for 7 years loses her fight against cancer\n[https://cryptopotato.com/dogecoin-developer-sporklin-dies-cancer/]\n\nIn one of her last post\n[https://www.reddit.com/r/dogecoindev/comments/lpucjw/dogecoin_can_reach_1_with_significant_dev]\nshe is clear on…",
  "data/reddit-crypto/r/CryptoCurrency/comments/uwzueq/cope_a_token_built_on_solana_ecosystem_their_devs.json": "Yes, this is exactly what it sounds like. COPE is built on Solana Ecosystem I\nvisited their site so you don't have to\n\n> Earn COPE through staking across pools in the Solana ecosystem such as on\n> Raydium and Orca and upcoming COPE Trading Pools. Stake in Sollet/Phantom\n> (on-chain) wallet to earn…",
  "data/reddit-crypto/r/Bitcoin/comments/ux9196/more_than_12_million_bitcoin_have_not_been_moved.json": "More than 12 million bitcoin have not been moved in the last 12 months.\n[https://preview.redd.it/l17f4i54rj191.jpg?width=960&format=pjpg&auto=webp&s=6f618a49bd0a2edc8657d80f171fa38f2d92b934]",
  "data/reddit-crypto/r/CryptoCurrency/comments/uxchz2/raoul_pal_publicly_recommended_20_risk_free.json": "How to go from something to zero, Raoul Pal Real Vision style: Recommend\nsomething, then when your recommendation crashes and burns, go back on your own\nstatement and say \"I never did any of it\"\n\n\nPART 1: RECOMMEND\n\nPart 1:…"
}