{
  "data/reddit-changemyview/r/changemyview/comments/l9fhc0/cmv_white_privilege_only_applies_to_rich_white.json": "I am left-wing, I appreciate racism exists, more so in the US than here in the\nUK, but I see this attitude seeping over across the pond that because I’m white,\nI’m privileged.\n\nFuck that. I am NOT privileged. I had nothing growing up and I have nothing now.\n\nI am NOT in support of any right-wing…",
  "data/reddit-changemyview/r/changemyview/comments/l9zh5y/cmv_websites_that_dont_matter_should_not_force.json": "When my bank, or my university, or my email forces me to have a password that's\nat least 10 symbols, letters and numbers and uppercase and lowercase, I respect\nthat. Fair enough. You want to keep my money and important information safe, and\nI'm happy to come up with something that complies. But…",
  "data/reddit-changemyview/r/changemyview/comments/la3rwp/cmv_people_and_organizations_should_have_to.json": "The world of influence is complicated. We have overt advertisements, which are\nannoying, but at least obviously advertisements. But we also have an entire\nindustry of subtle advertisements. Politicians and companies can purchase crowds\nto flood protests or hearings. They can buy actors to infiltrate…",
  "data/reddit-changemyview/r/changemyview/comments/la54gt/cmv_wonder_woman_1984_is_one_of_the_worst.json": "Absolute crap-shoot of a film. Pedro Pascal and Gal Gadot's acting were the only\ntwo enjoyable things this piece of trash had to offer. As a huge DC AND Marvel\nfan, this was on the same level as Birds of Prey and Justice League... just\nhorrid. Failed style with no substance.\n\n\n\nCheesy effects didn't…",
  "data/reddit-changemyview/r/changemyview/comments/la9xqq/cmv_if_republicans_believe_impeachment_of_a.json": "First off, I don't outright reject the notion that impeachment was never\nintended to be used against someone who has already left office. I think the\npoint is arguable.\n\nHowever, I completely reject the notion that our founders intended that someone\ncould commit high crimes and misdemeanors against…",
  "data/reddit-changemyview/r/changemyview/comments/laja0f/cmv_considering_the_majority_of_society_arent.json": "For example, if somebody is facing the death penalty or a life sentence, it is\nunfair to have someone’s life hanging in the balance of legally uneducated\npeople. Surely legally trained professionals are far more capable of deciding\nwether somebody is guilty beyond a reasonable doubt. Letting…",
  "data/reddit-changemyview/r/changemyview/comments/laq777/cmv_i_have_no_reason_to_care_whether_a_creative.json": "The following applies to creative works of any genre: music, literature, film,\netc. Most of my examples will be about literature.\n\nTo me, a creative work is good to the extent that it is enjoyable and/or to\nexperience or think about.\n\nI often hear arguments of the form: \"You may like it, but it is…",
  "data/reddit-changemyview/r/changemyview/comments/lar27d/cmv_its_okay_to_break_up_with_someone_if_they.json": "Fitness is a huge part of my life. When I was a teen, I was overweight and was\nsocially awkward. I've had girls breaking up with me for things some may\nconsider superficial. Once i started working out, my self confidence\nskyrocketed. When i started dating my (ex) girlfriend, she was a…",
  "data/reddit-changemyview/r/changemyview/comments/layw70/cmv_secular_values_and_ideals_not_christian_ones.json": "Conservative pundits like Stephen Crowder, Ben Shapiro, and Denis Prager claim\nthat what makes America, and \"the West\" more broadly, great are Judeo-Christian\nvalues.\n\nHowever, individualism, civil liberties, democracy, science and reason... All\nthe ideals that make America as great as it is today…",
  "data/reddit-changemyview/r/changemyview/comments/layz88/cmv_reddit_markets_itself_as_a_discussion.json": "This all starts with the karma system. How much you can engage in a discussion\nis down to your karma and you are literally hindered from actively engaging when\nyou have low karma in a sub. This plays directly into the cards of people\ndownvoting others for simply having another view they don’t agree…",
  "data/reddit-changemyview/r/changemyview/comments/lb3eqi/cmv_rpolitics_is_in_the_very_least_a_misleading.json": "Regardless of your personal political stance, it is impossible to not\nacknowledge the extreme bias in the subreddit r/Politics\n[http://reddit.com/r/Politics].\n\nMost subreddit titles are an accurate description of the topic that the\nsubreddit encapsulates, so with such a vaugue title as \"Politics\",…",
  "data/reddit-changemyview/r/changemyview/comments/lb8bzd/cmv_supporting_businesses_by_race_is_racist.json": "I think it's a good idea to support businesses regardless of what race they are.\nI think it's a very toxic mindset to have so say, only support black owned\nbusinesses JUST because they are black. Assuming that the company is struggling\njust because they are black, IS RACISM.\n\nThe problem I have with…",
  "data/reddit-changemyview/r/changemyview/comments/lbbnos/cmvnuclear_power_is_far_superior_to_renewable_and.json": "Just to clarify I am talking about fission and fusion\n\nI don’t quite understand stand how people can argue that nuclear is dangerous an\ninefficient when it produces so much power and causes so little waste and\ndanger. A single handful of uranium holds enough power to support someone for\nthere whole…",
  "data/reddit-changemyview/r/changemyview/comments/lbfsa6/cmv_pete_buttigieg_is_a_weak_choice_for_secretary.json": "A tangential post on a different sub in which a bunch of people jumped on Ted\nCruz for voting against Pete Buttigieg got me thinking, why do people think Pete\nButtigieg is a good pick for Secretary of Transportation?\n\nTo preface, I voted Biden, I'm certainly left of the Democratic Party, and I\nhave…",
  "data/reddit-changemyview/r/changemyview/comments/lbh1hu/cmv_feminism_in_the_west_is_a_redundant_movement.json": "Feminism in the Western world is redundant and its goals have already been\nachieved. I come from an African country where women have few rights. They can't\nrent houses on their own without a husband figure. They are actively discouraged\nfrom studying certain courses at university or at vocational…",
  "data/reddit-changemyview/r/changemyview/comments/lbh45q/cmv_life_doesnt_always_get_better_and_we_arent.json": "I get frustrated, because the one message people always seem to insist on is\nthat \"you are in control\" - uh, no. To get a job, I have to have humans give me\nthe job. To buy a house, I have to work with humans to give me the house. There\nare things like auditions, interviews, and basic transactions…",
  "data/reddit-changemyview/r/changemyview/comments/lbqam1/cmv_the_concept_of_an_omniscient_and_capable.json": "For this argument to work, omniscient minimally entails that this creator knows\nwhat will ever happen.\n\nHence the (*).\n\nCapable means that this creator can create as it wishes.\n\n1) Such a creator knows everything that will happen with every change it makes\nto its creation. Nothing happens…",
  "data/reddit-changemyview/r/changemyview/comments/lbu456/cmv_terms_and_conditions_as_a_system_needs_a_huge.json": "I think at this point in time when it comes to technology and the age of apps\nand services for anything you could possibly think of, how companies use the\n\"Terms and Service or Conditions\" to basically give them free reign to do\nanything they want even if they are unethical.\n\nThis system has evolved…",
  "data/reddit-changemyview/r/changemyview/comments/lc3ry0/cmv_the_american_healthcare_system_is_designed_to.json": "Hospitals and doctors can't/won't tell you what something costs before you get\nit. Pricing for numerous things from prescriptions to medical procedures and\nscreenings are vague and and often impossible to know. Bills change once you\nrequest itemized copies. Insurance companies make it as difficult…",
  "data/reddit-changemyview/r/changemyview/comments/lchz9p/cmv_there_should_be_a_universal_sign_language_the.json": "In 2021, it seems perplexing there is not a universal language.\n\nClearly agreeing on one verbal language would be difficult (such as English or\nMandarin).\n\nI realize there are many sign languages too, which again, is a similar problem\nto verbal languages in the sense of 'how do you pick one over the…",
  "data/reddit-changemyview/r/changemyview/comments/lcmxnd/cmv_farmed_animals_live_better_lives_than_wild.json": "*with exception to factory farming, veal, fur farming, etc, and putting a pin in\nenvironmental concerns.\n\nIf animals reared for food live lives without predation, with a constant supply\nof food, in the open air, then they have an incredibly coddled existence\ncompared to an overwhelming, 99%+,…",
  "data/reddit-changemyview/r/changemyview/comments/lcpxgs/cmv_the_idea_of_the_nword_being_a_black_only_term.json": "Let me start by saying that I am a black man. Also, even though I might be\n“entitled” as a black person to say the n-word, I would prefer to keep this post\nformal and professional, and I don’t think that freely throwing around the\nn-word promotes that tone. I should also add that I’m mostly…",
  "data/reddit-changemyview/r/changemyview/comments/lcw0xd/cmv_you_should_always_play_the_devils_advocate_or.json": "Thinking about the other side gives you a better insight no matter how wrong you\nthink the other side is. Everyone has inherent bias. This is true for all issues\nand sides, but playing the other side is always a good way to check for any\ninherent bias you may have that you might not even know you…",
  "data/reddit-changemyview/r/changemyview/comments/lcy9ou/cmv_passing_on_genetic_illness_like_bipolar.json": "Background: I have bipolar disorder. It is debilitating and affects me every\nday. My brother has schizophrenia. It is debilitating for him. Our grandmother\nhad bipolar disorder. It caused her immense difficulty in her life.\n\nIt feels so cruel to pass on a disability to your child. No one in their…",
  "data/reddit-changemyview/r/changemyview/comments/ld44ga/cmv_the_degradation_of_men_by_saying_things_like.json": "Writing this makes me sound like an incel, but this is just genuinely something\nI don't understand and something that I would 100% be willing to have a\ndiscussion about and hopefully change my mind about.\n\nIt's pretty often that I see people generalize about men online with comments\nlike \"All men…",
  "data/reddit-changemyview/r/changemyview/comments/ld5heg/cmv_free_healthcare_for_all_citizens_should_be.json": "I live in Sweden and we have free healthcare for all. If I get HIV or need an\nambulance I know I won't be fucked for life. It removes stress from my life and\nmight even save it.\n\nLooking at countries like the US I don't understand why people are so up in arms\nabout the concept. This is not a gripe…",
  "data/reddit-changemyview/r/changemyview/comments/ld6pxx/cmv_shethey_and_hethey_pronouns_make_no_sense_and.json": "Okay so let me get this straight.\n\nShe/her pronouns = the user identifies as female\n\nHe/him pronouns = the user identifies as male\n\nThey/them pronouns = the user identifies as non-binary\n\nHow can someone not have a gender but at the same time have a gender? It makes\nno sense. All the people I met…",
  "data/reddit-changemyview/r/changemyview/comments/ldwptc/cmv_the_term_mansplaining_shouldnt_exist.json": "I'm not sure what the origins of the term \"mansplaining\" are, however I can see\nno reason why \"explaining\" required a gendered term to describe men being\npatronising or condescending towards women.\n\nI haven't seen any evidence that patronising or condescending behaviour is\nparticularly skewed to one…",
  "data/reddit-changemyview/r/changemyview/comments/le2oiz/cmv_the_united_states_should_replace_our_motto_of.json": "Why have “In god we trust” when that just alienates people who may not believe.\nThe United States specifically separates church and state. Eisenhower put it\nthere after putting “under god” in the pledge of allegiance(which should also be\nthrown out).\n\nEisenhower said “In this way we are reaffirming…",
  "data/reddit-changemyview/r/changemyview/comments/lelq0v/cmv_young_people_dying_is_much_more_tragic_than.json": "I'm not saying that old people dying isn't tragic or anything, I am just saying\nthat it is more tragic for a young person to die who has their whole life ahead\nof them. Old people have mostly already lived their full lives, especially if\nthey are over 80 years old, they got to build their own lives…",
  "data/reddit-changemyview/r/changemyview/comments/lewhal/cmv_delivery_drivers_have_a_right_to_refuse.json": "Most restaurants that offer delivery service have their employees using their\nown vehicles. At my job, if I were to crash while on delivery with my own car,\nthey won't offer any financial compensation. Now I know citizens can be in dire\nneed of a delivery, but if the driver feels it's too dangerous…",
  "data/reddit-changemyview/r/changemyview/comments/lf1ycx/cmv_we_should_abolish_the_income_tax_for_the.json": "I did my math as follows: I googled the median income a US individual, and it is\napparently $31,133.\n\nThe work force in this country is about 150 million people. Now, lets say the\nbottom 50% all make $31,133 - I know this is not how medians work, but I don't\nhave all the data, and so by making this…",
  "data/reddit-changemyview/r/changemyview/comments/lfhyzg/cmv_universal_basic_income_ubi_is_in_concept_much.json": "If your goal is to keep workers desperate and powerless, UBI is probably not an\nattractive concept -- so I'm going to narrow my focus down & make this pretty\nclean.\n\nMy premise: If we agree on a specific set of societal goals (1), then we are\nmuch better served with my outline of UBI (2) than by the…",
  "data/reddit-changemyview/r/changemyview/comments/lfqkad/cmv_if_political_subreddits_can_get_banned_for.json": "Every day, people go on those subs, often with very valid and heartfelt\nconcerns, sharing details of their lives with complete strangers who A. Lack a\nton of context by default and B. Have no qualifications at all to be giving the\nadvice they're giving. This isn't r/askhistorians [/r/askhistorians]…",
  "data/reddit-changemyview/r/changemyview/comments/lfqy0g/cmv_people_who_are_wokeantiracist_who_follow.json": "It's hypocritical to be an activist who fights back against systemic racism or\nsomeone that holds anti-racist/woke viewpoints and also think anti-semitism is\nno big deal and/or that Farakkahn talking about how Jewish people are fake\nJews/the synagogue of satan and about how we're termites is…",
  "data/reddit-changemyview/r/changemyview/comments/lfscqg/cmv_the_existence_of_anxious_breeds_of_dogs_is.json": "We have been preferentially breeding dog traits we like for thousands of years.\nOne thing essentially all dog breeds have in common, because we’ve created the\ntrait through hundreds of generations of purposeful choices, is the emotional\nneed to be near us. It’s so pronounced in some breeds (and…",
  "data/reddit-changemyview/r/changemyview/comments/lfyl3r/cmv_being_a_true_journalist_in_mexico_you_must.json": "Sadly mexico has the record for the most journalist killed and everytime one\ntries to uncover the dirty tricks of the government or the narcos they end up\nkilled, as for last year in 2020 mexico had the horrible record of most\njournalist killed with almost 30 killed.\n\nAccording to article19.org…",
  "data/reddit-changemyview/r/changemyview/comments/lg4rg4/cmv_policemen_need_to_be_punishment_more_if_they.json": "I very bad at this there will be flaws in my view. I want to know if this is a\nvalid view and not just some crazy thought. If a mod is reading this. I think\nits to short but i dont know how to explain it better. And i want feedback on\nit.\n\nSo a Policemen is there to protect us and make sure the…",
  "data/reddit-changemyview/r/changemyview/comments/lge124/cmv_the_socialismcapitalism_debate_is_pretty.json": "Socialism and Capitalism have different definitions depending on who you ask. A\nlot of capitalists say that socialism is a centrally planned economy whereas\ncapitalism is a market economy. A lot of socialists say that socialism is a\ncommunal economy whereas capitalism is a corporate…",
  "data/reddit-changemyview/r/changemyview/comments/lgf5g9/cmv_the_health_insurance_system_of_the_united.json": "Extortion, racketeering, preying on the weak and vulnerable. They have leaned on\npoliticians for years for legitimacy. The business exists only to collect\nprotection money from our population. A terrible side effect is the strain\nplaced on the doctors and nurses that are unable to use their…",
  "data/reddit-changemyview/r/changemyview/comments/lgh54z/cmv_in_the_united_states_attending_college_is_not.json": "Most universities cost thousands, to tens of thousands of dollars to attend\ndepending on what type of institution you are going to. Community college ->\ntransfer to state school route tends to be less expensive compared to going full\n4 years to a public or private school - but generally most would…",
  "data/reddit-changemyview/r/changemyview/comments/lgj6ry/cmv_failure_to_disclose_transexuality_voids.json": "Let's just say for an example two people met, 1 was a post operation transexual,\none was cis. In this example the transgender person has really transitioned\nwell; they look convincingly like the gender they align with. If these two\npeople met and had sexual intercourse, but at no point before did…",
  "data/reddit-changemyview/r/changemyview/comments/lgvfi0/cmv_prostitution_should_be_legal.json": "That’s about all there is to say. Politically I am a left libertarian, which you\nmight’ve guessed lol. But honestly I don’t really see a problem with\nprostitution. “We don’t want a spread of STDs”\n\nThere are ways around this. I believe that we should have licenses for\nprostitution, and they should…",
  "data/reddit-changemyview/r/changemyview/comments/lgwegy/cmv_the_prolife_movements_general_opposition_to.json": "The number one cause of abortions is unwanted pregnancies. Unwanted pregnancies\nare prevented by contraception - so it makes no sense that religious groups who\noppose abortion also oppose contraception coverage in employer health insurance\nplans (ie Hobby Lobby case). If anything, religious groups…",
  "data/reddit-changemyview/r/changemyview/comments/lhkep6/cmv_a_sexless_relationship_is_as_bad_as_a.json": "While literally on the opposite ends of the spectrum the trauma it creates on\nthe non consenting partner is pretty much the same. Feelings of being unworthy\nof love, loneliness, abandonment and betrayal. I’ve been in both situations and\nemotionally I don’t think there’s a difference. To be clear on…",
  "data/reddit-changemyview/r/changemyview/comments/lhkjsg/cmv_disproportionate_outcomes_dont_necessarily.json": "Racism is defined (source is the Oxford dictionary) as: \"Prejudice,\ndiscrimination, or antagonism by an individual, community, or institution\nagainst a person or people on the basis of their membership of a particular\nracial or ethnic group, typically one that is a minority or marginalized.\"\n\nSo one…",
  "data/reddit-changemyview/r/changemyview/comments/lhmtg2/cmv_gina_caranos_post_was_shockingly_stupid_but.json": "EDIT: Deltas given on a couple points below. And I shouldn’t have used\n“ridiculous” the way I did in the post title. In isolation, what she posted\ndoesn’t meet my personal standard for antisemitism, but it may well for other\npeople, particularly those who have survivors in their family. Please…",
  "data/reddit-changemyview/r/changemyview/comments/lhysps/cmv_if_you_celebrate_sex_workers_and_support.json": "I've seen this come up a lot lately for some reason. It seems many people who\nare extremely pro sex-worker's rights are vehemently anti\ncustomer-of-sex-worker. My confusion is, how do you expect them to make any\nmoney without people on the other end of the transaction? I have seen the\nargument made…",
  "data/reddit-changemyview/r/changemyview/comments/li1x65/cmv_everyone_should_know_how_to_cook_wash_clothes.json": "Recently I’ve been seeing lots of friends of mine posting stories on social\nmedia about not being able to cook at all, not knowing how to clean their own\nclothes or even wash dishes. And they all seem very proud of it for that matter.\nWhen I asked them about it, most of them said that they don’t…",
  "data/reddit-changemyview/r/changemyview/comments/li3016/cmv_expecting_people_especially_those_you_dont.json": "Let me preface this by obligatorily stating I'm not against LGBTQ+ rights in any\nform or fashion, do what you want, however you want, and be who you want, I\ndon't care.\n\nThat being said, the backbone of my argument is this: I don't care. I don't care\nwhat your pronouns are and you shouldn't expect…",
  "data/reddit-changemyview/r/changemyview/comments/lidqqc/cmv_alcohol_culture_is_significantly_cringier.json": "Alcohol culture is SO much fucking cringier than Marijuana culture, society is\njust so engulfed in it to realize\n\nAlso, just to clarify one thing - I always see people compare casual drinkers to\nstoners. Which is an unfair comparison. If you want to mention stoners, lets\nalso mention the equal…",
  "data/reddit-changemyview/r/changemyview/comments/liib9v/cmv_in_terms_of_utility_reward_and_cost_there_is.json": "It's all there in the topic. Learning to cook is useful every day, allows you to\nsave money and improve your health through a good diet, and gives you a skill\nthat is transferable to truly every walk of life. While there are many great\nhobbies out there, cooking is by far the most practical. Since…",
  "data/reddit-changemyview/r/changemyview/comments/lil0m3/cmv_living_rooms_should_be_on_the_top_floor_of_a.json": "The vast vast majority of two story houses have living rooms (kitchens, dining,\nlounge) on the bottom floor of a house, and bedrooms on the too floor.\n\nI believe bedrooms should be on the bottom floor, and living rooms on the top\nbecause:\n\n 1. Temperature: people prefer warmer rooms during the day,…",
  "data/reddit-changemyview/r/changemyview/comments/lj1h9v/cmv_china_is_going_to_be_the_biggest_global.json": "Have we not learnt from the lessons of the past where Germany literally did the\nsame fucking thing to their minorities. Now at the moment from what we know\nChina isn't straight up murdering these minorities but \"educating\" them. Funny\nthing is that Nazi Germany always claimed that these…",
  "data/reddit-changemyview/r/changemyview/comments/lj23xi/cmv_if_you_have_an_issue_with_cancel_culture_you.json": "Many right wing Americans are currently concerned about \"cancel culture\", i.e.\nPeople unjustly being fired by their employers for something they said on social\nmedia, possibly even decades prior.\n\nAs a leftist I actually kind of agree with that assessment. However, I find it\nhighly hypocritical that…",
  "data/reddit-changemyview/r/changemyview/comments/lj6b63/cmv_there_is_a_disproportionate_amount_of_support.json": "For clarity, I am a moderate but left leaning, secular male. I would absolutely\ndescribe myself as pro-women’s rights and equality for all, no matter their\ngender, race, religion, etc as long as their views are not hurtful to others. I\nam not here to debate whether Islam is a more violent religion…",
  "data/reddit-changemyview/r/changemyview/comments/ljhxhi/cmv_the_body_positivity_movement_has_been_taken.json": "CMV: The body positivity movement has convinced people that you can be obese and\nhealthy\n\nObviously, I don’t agree with health at every size. But any time I see a\nstraight sized person attempt to post content about body positivity(mostly on\ntik tok), they are called fat phobic by obese people. It…",
  "data/reddit-changemyview/r/changemyview/comments/ljq325/cmv_narcissism_on_social_media_has_become.json": "Context I’m in my early 20s about to graduate from university. I really hope\nthis doesn’t come across as virtue signalling because it’s not, I just really\ndislike people who do this and I want to know if it’s justified and if anyone\nfeels the same way or differently.\n\nAnd my take is, yeah if you’re…",
  "data/reddit-changemyview/r/changemyview/comments/ljtkcq/cmv_governments_should_be_run_like_experiments.json": "Pretty simple concept. Governments and the laws that they pass should be treated\nlike scientific experiments and follow the scientific method: Observation -\nHypothesis - Test - Refine.\n\nObserve and identify societal problems. Formulate an idea as to how to fix it.\nEstablish objective criteria upon…",
  "data/reddit-changemyview/r/changemyview/comments/ljtu1d/cmv_the_dems_campaigned_on_and_promised_2000.json": "People are saying \"oh well you already got $600 (nevermind that I still have not\nreceived that) and 1400+600=2000 so the promised 2k is really 1400\".\n\nBut I distinctly remember people explicitly campaigning on 2k checks, not 1400,\nand only changing their tune after they got elected.\n\nAnd if \"well…",
  "data/reddit-changemyview/r/changemyview/comments/ljxl3h/cmv_netflix_quality_is_now_so_bad_its_worth.json": "It used to be so good, I had no need for cable. Now, if it wasn't for others\nusing my account I think I would cancel it entirely. There haven't been any\ndecent series in a while, not much new content comes out, the original series\nare mostly B rate, and so many of the movies that are A quality are…",
  "data/reddit-changemyview/r/changemyview/comments/ljyayg/cmv_having_an_lgbtq_character_in_a_tv_show_isnt.json": "Two caveats:\n\nIts only really a problem to have an lgbtq+ character in a TV Show, story, or\nany art form if someone makes it a problem. Which most people don't.\n\nAnd literally everything is politicized as politics are omnirelevant to our\ndaily lives. Politics bleed into everything.\n\nI just finished…",
  "data/reddit-changemyview/r/changemyview/comments/ljyeqp/cmv_people_use_the_phrase_love_yourself_the_way.json": "Self-acceptance and self-love are important, of course, but the phrase should be\nsomething along the lines of \"Love the things about yourself that you can't\nchange!\" instead.\n\nIn today's internet-culture, there are countless movements for acceptance and\nnormalization of all sorts of things, which is…",
  "data/reddit-changemyview/r/changemyview/comments/ljz5gx/cmv_people_who_love_to_complain_about_how.json": "That’s it, that’s the post. (jk explanation below)\n\nI do understand people’s sentiments about Valentine’s Day being commercialized,\nbecause it has been. My issue is, if you’re going to bitch about the\ncommercialization of Valentine’s Day, keep that same energy for every other\nholiday that has been…",
  "data/reddit-changemyview/r/changemyview/comments/ljzpse/cmv_in_stories_where_the_antagonists_goal_seems.json": "I love stories where the villain is relatable, where even if you do not agree\nwith his/her goals or methods, you can still understand his/her motivation.\nGreed, envy, pride, wrath, and vengeance are all easily relatable motivations\nfor an evil actor, but the \"burn it all down\" trope has never sat…",
  "data/reddit-changemyview/r/changemyview/comments/ljzthu/cmv_anyone_can_be_racist_and_anyone_can_be_sexist.json": "I have met P.O.C who are clearly racist and women who blindly hate men. No\noffense but if you think only white people can be racist and only men can be\nsexist, I think that is incredibly ridiculous. Look up the definitions of racism\nand sexism and yes its says typically racism is held against…",
  "data/reddit-changemyview/r/changemyview/comments/lk11n2/cmv_america_needs_a_dominant_3rd_political_party.json": "Yes, there are more than 2 political parties, but honestly no one votes for\nthem. I'm talking about a dominant 3rd party that rivals the Democrats and\nRepublicans.\n\nI've had people in real life disagree with me, but I have yet to hear a strong\nargument to change my opinion.\n\nDemocrats and…",
  "data/reddit-changemyview/r/changemyview/comments/lkek7y/cmv_the_army_should_not_make_their_fitness_tests.json": "I read a story today about how the army is considering making their fitness\ntests different depending on gender. They found that women were not passing at\nthe same rates as men, so they are considering lowering the bar / changing the\ntests that women do. I feel like this is a bad thing for 2 main…",
  "data/reddit-changemyview/r/changemyview/comments/lkewr3/cmv_public_proposals_are_a_big_nono.json": "I'm not talking about merely proposing in a place that happens to be public\n(balconies, waterfalls) where there's just the two of you, I'm talking about\nproposing in front of a crowd that's paying attention.\n\nSeriously, in things like that, you'd want the one you're proposing to to\nprovide the most…",
  "data/reddit-changemyview/r/changemyview/comments/lkeyyc/cmv_food_delivery_apps_should_change_their.json": "On all the food delivery apps I use, they recommend tipping the driver on a\npercentage of the total bill. Why is that?\n\nI'm arguing that delivery drivers should be tipped on an algorithm based on\ndistance they have to travel to deliver to the household, and not based on how\nmuch a person has paid…",
  "data/reddit-changemyview/r/changemyview/comments/lktw1z/cmv_politicians_should_be_punished_for_false.json": "In both cases someone is making a claim about what they are going to provide. I\nget sometimes it can’t be accomplished, but there are also other times when it\nis completely in a politician’s power.\n\nAs an example, if someone says “I will do X in my first 100 days in office” to\nget votes but has no…",
  "data/reddit-changemyview/r/changemyview/comments/lkxhvk/cmv_there_should_be_term_limits_for_congressmen.json": "I feel like there should be term limits for the Senate and House of Reps. It\njust feels like there are too many old, career politicians working for their own\ngain instead of trying to take this country to a better place. These people have\nno idea what the average American citizen experiences on a…",
  "data/reddit-changemyview/r/changemyview/comments/lkxqkz/cmv_im_tired_of_texas_begging_the_the_federal.json": "Today, once again, less than a week making a ruckus about seceding from the US,\nTexas has come begging for US disaster funds to save it from itself and it's\nindependent electrical grid that fails when it snow a little.\n\nSo, here is the relevant history of Texas as part of the United States.\n\nThey…",
  "data/reddit-changemyview/r/changemyview/comments/lkxsry/cmv_it_doesnt_matter_whether_transgenderism_is.json": "I often see debates on YouTube where people argue about the logistics of\ntransgenderism and the transgender community. Some people argue that it is real\nand others argue that trans people are mentally ill or just want attention.\n\nAfter thinking about this for a very long time I realized it doesn't…",
  "data/reddit-changemyview/r/changemyview/comments/llcvwc/cmv_pretty_much_all_news_articles_should_have.json": "The average news article sometimes seems to list a bunch of stats based on the\nwriter's research and knowledge, which is great, but I feel like seeing more\nvisual data would allow people to\n\n 1. become more data fluent (which I feel average people are lacking),\n 2. understand the issue at hand as…",
  "data/reddit-changemyview/r/changemyview/comments/llr6kz/cmv_it_is_counterproductive_for_feminists_to_say.json": "As a woman, I got really upset when my friends said that they agreed with\n#killallmen, and they said that since men had been oppressing women for years,\nrevenge was justified. I called them sexist and part of the problem, and they\nsaid they don't believe you can be sexist to the group with power.…",
  "data/reddit-changemyview/r/changemyview/comments/llw4i0/cmv_organized_religion_is_harmful_to_human_society.json": "Organized religion, specifically the main three monotheistic religions\n(Christianity, Islam, and Judaism) cause more harm than good to human society\nand individual people.\n\nReligion causes conflict between people. Almost everyone would agree that\nconflict is bad, since it causes physical and…",
  "data/reddit-changemyview/r/changemyview/comments/lm0dry/cmv_there_is_nothing_wrong_with_celebrating_when.json": "I think this is unambiguous if the person is actively making the world a worse\nplace. In that case, their death makes the world a better place, and that's\nsomething to celebrate.\n\nI can see some argument that if they've done bad things in the past, but are now\njust living a private life, death…",
  "data/reddit-changemyview/r/changemyview/comments/lm2tcx/cmv_abolish_prisons_or_abolish_the_policewhen.json": "EDIT 3: I'm still not convinced. But what I AM convinced of is that it only\nhurts the movement if we willfully choose to not use language that might appeal\nto people on the other side and those who are unpersuaded.\n\nI'm begging anyone who sees this—even if you disagree with me and think…",
  "data/reddit-changemyview/r/changemyview/comments/lmai04/cmv_gun_manufacturers_should_not_be_able_to_be.json": "So some people would welcome the idea to sue gun manufacturers and distributors\nfor simple normal operating procedures. Thankfully there is some protection on\nthe books for them already.\n\nI believe gun manufacturers should not be held liable in any way if someone uses\none of the products in a crime.…",
  "data/reddit-changemyview/r/changemyview/comments/lmb3wl/cmv_it_is_not_transphobic_to_not_date_trans_people.json": "They only Identify as a woman/Man/NB. Especially if they havent transitioned and\nexpect you tk have sex with them.Even if they are fully a woman/man, they still\nhave the structure of a man/woman, and all that they did was dress\nandrogynous/get top and bottom surgery/take E and get surgery.\n\nWhat I…",
  "data/reddit-changemyview/r/changemyview/comments/lmcj4p/cmv_it_does_honestly_seem_kinda_unfair_to_cancel.json": "I'm no conservative; I'm basically as leftist as they come, but cancelling all\nstudent debt seems a little bit unfair. I definitely think the government should\nhelp pay off student loan debt, especially because of predatory practices, and\ninstate fair-priced college, but cancelling all student loan…",
  "data/reddit-changemyview/r/changemyview/comments/lmpmwb/cmv_canceling_student_loan_debt_is_not_a.json": "Hey peeps. I'm a progressive voter who supported Ilhan Omar and Elizabeth Warren\n(I'm in MN). I have a masters degree and about $20K in student loan debt.\nHowever I don't understand why canceling student loan debt is a progressive\npolicy that is being championed by the likes of Warren, Bernie, AOC,…",
  "data/reddit-changemyview/r/changemyview/comments/lmqqi4/cmv_issues_like_homelessness_and_world_hunger.json": "There is enough money in the world to easily feed and house every single person\non Earth. With all of the wealth currently being hoarded, the haves could very\neasily provide for the have-nots.\n\nSo why don't they? The most common answer I see is something along the lines of\n\"handouts will make people…",
  "data/reddit-changemyview/r/changemyview/comments/lmyo4l/cmv_those_who_pretend_to_be_offended_by_colin.json": "I’m sorry, but I don’t see the “shut up and play ball” crowd as being very\nenthusiastic about MLK’s March on Washington had they been around back then. I\ncan’t see the Tucker Carlson’s and the Tomi Lahren’s of the world being on board\nwith the Montgomery Bus Boycott.\n\nAnd I can also totally see this…",
  "data/reddit-changemyview/r/changemyview/comments/ln3jio/cmv_as_a_person_from_a_third_world_country_i.json": "I just a read a report that said higher income nations in Europe have less\nconfidence in vaccines and it just infuriates me to think they have access to\nall the top medical facilities, clean water, good quality food and then come to\ncountries like mine and spread diseases especially ones infecting…",
  "data/reddit-changemyview/r/changemyview/comments/lnbee2/cmv_the_greatest_triumph_of_civil_american.json": "Imagine. Freely available and vast knowledge on tap for anyone, irrespective of\nrace, class, citizenship, sex, etc. What an incredible idea and investment. And\nrelatively cheap to boot.\n\nHospitals? Haha no, good luck if you have a chronic disease. Hospitals are\nobligated to stabilize you only. I…",
  "data/reddit-changemyview/r/changemyview/comments/lneupk/cmv_portraying_fitattractive_actors_as_characters.json": "I really started to take diet and exercise seriously and found that to reach\ncertain target body types, it's massively more challenging than I expected. I\npartly put this down to TV constantly portraying these young, attractive, fit,\nsuccessful people as eating junk food all the time and never…",
  "data/reddit-changemyview/r/changemyview/comments/lnkhwg/cmv_tipping_should_not_be_expected_for_takeout.json": "This is inspired from an argument over tipping on pizza takeout orders, but I\nfeel like it applies to all restaurants offering takeout. My points are below.\n\nI tip for services that are provided where I feel the employee/worker generally\nhas to go out of there way to complete that service. Examples…",
  "data/reddit-changemyview/r/changemyview/comments/lo3sg6/cmv_cultural_appropriation_is_a_western_concept.json": "I’m tired of seeing people getting mad/hating on people for wearing clothing of\nother cultures or even wearing hairstyles of other cultures like braids. All\nthese people who claim that this is cultural appropriation are wrong. Cultural\nappropriation is taking a part of ones culture and either…",
  "data/reddit-changemyview/r/changemyview/comments/lo4vr2/cmv_hollywood_needs_to_stop_recycling_the_same.json": "Honestly I haven't been excited for a hollywood movie in a very long time. They\nmainly fall into three categories. Comic book movies, remakes/reboots or\nsequels. Hollywood just keeps looking to the past. Do we really need to reboot\nthe Matrix? Do we really need to remake the Disney movies in live…",
  "data/reddit-changemyview/r/changemyview/comments/loakbf/cmv_criticizing_the_chinese_government_does_not.json": "As said in the title I think that some people think that some countries\nshouldn't be criticized because it somehow is a racist attack on a certain\nethnic group. I feel like it has become more and more popular to try and prevent\nany discussion about these countries and I think that is wrong. China…",
  "data/reddit-changemyview/r/changemyview/comments/loemq3/cmv_it_should_not_be_illegal_for_homeless_people.json": "I live in Toronto, Ontario in Canada and recently, municipal police have been\ntearing down makeshift homeless shelters on the basis that they do not comply\nwith whatever building codes are applicable.\n\nThe alternatives available for people living in makeshift shelters would be to\nfind a homeless…",
  "data/reddit-changemyview/r/changemyview/comments/lol31m/cmv_election_day_should_be_a_federal_holiday.json": "CMV: Election Day should be a federal holiday.\n\nI don’t really see a strong argument against this.\n\nMany Americans are not able to vote because they must work on Election Day.\nMaking voting easier and more accessible should be a priority. It is already a\nholiday in many other countries around the…",
  "data/reddit-changemyview/r/changemyview/comments/loqmp0/cmv_minors_lying_about_their_age_to_have_sex_with.json": "I think this belief is held in many peoples minds already. Lying to get sex is\nrape. Such as someone claiming to be wearing a condom during sex when not, or\nremoving the condom during the act. Or someone claiming to be on birth control\nwhen they are not. I believe both of these to be rape. I think a…",
  "data/reddit-changemyview/r/changemyview/comments/lowoae/cmv_racism_systemic_racism_is_a_dumb_argument.json": "Ok first things first.\n\nI'm black , let me say that out of the bat because surely some people judge\nothers on this matter starting with the race of the person. Which is ironic to\nthink about it but let's move ahead.\n\nMy wife has encountered this argument a lot in social media , be it Twitter…",
  "data/reddit-changemyview/r/changemyview/comments/lp90a6/cmv_equality_forms_when_applying_to_some_jobs.json": "In the last year or so, I have applied to multiple universities and jobs. On\nevery application, I have had to fill out an equal opportunities form, stating\nmy ethnic background, my gender and my sexuality etc. I am bisexual, and I can't\nhelp but feel like that may put me at an advantage. I see that…",
  "data/reddit-changemyview/r/changemyview/comments/lpat0s/cmv_asians_have_also_been_slaves_in_the_us_and.json": "Asian indentured servants, or “coolies” as a derogatory term, have been used as\na source of cheap labor in the United States as early as the 1800s.\n\nWhile indentured servants are different from slaves because they have paid\ncontracts, in the case of Asian coolies (and also many indentured…",
  "data/reddit-changemyview/r/changemyview/comments/lpc17j/cmv_death_of_presumption_of_innocence_in_the_west.json": "\"Presumption of innocence\" is a fundamental concept that constitutes Westerner\nlaw systems: you're not guilty (thus accountable) until proven so.\n\nIn current times, this concept has socially died. I'm going to use a\ncontroversial argument to explain it: accusations of harassment or rape on\nTwitter,…",
  "data/reddit-changemyview/r/changemyview/comments/lpdsd8/cmv_space_exploration_is_not_a_waste_of_money.json": " 1. Money is NOT the issue. Only a tiny fraction of the U.S. tax goes to NASA.\n    I'm tired of \"but it's a lot of money\" argument. Much more money have been\n    spent on more unhelpful and destructive projects, maybe we should spare some\n    of those to feed people instead. Do you want to spend…",
  "data/reddit-changemyview/r/changemyview/comments/lpgy7d/cmv_if_casting_scarlet_johanson_was_tonedeaf.json": "when movie directors replace white characters with black characters( like how\nthey cast Jodie Turner-Smith for the role of Queen Anne Boleyn, a clearly white\nfigure and historical character) white people aren't allowed to complain without\nbeing called racist or having white fragility.\n\nand when…",
  "data/reddit-changemyview/r/changemyview/comments/lps0ei/cmv_drug_addiction_is_purely_a_health_concern_not.json": "As the title already states I believe that all drugs should be decriminalized\nand here's the points why:\n\nFreedom of choice no matter how bad of a decision it may be should still be\nconsidered a human right, the last word on what you choose to put in your body\nshould still be up to you.\n\nThe…",
  "data/reddit-changemyview/r/changemyview/comments/lptnk2/cmv_if_theres_a_cigarette_tax_there_should_be_a.json": "I am not a smoker but in Oregon we recently voted on upping the cigarette tax (I\ndidn’t) and I find the whole thing rather ridiculous. Seems more political than\nscientific considering salt and sugar cause heart disease most of the time. Why\ncan people over indulge in terrible food without tax…",
  "data/reddit-changemyview/r/changemyview/comments/lqh77o/cmv_dandelions_are_the_best_flowers.json": "Yea you heard me, Dandelions\n[https://www.google.com/search?q=dandelions&rlz=1C1CHBF_enSE917SE917&source=lnms&tbm=isch&sa=X&ved=2ahUKEwiBuKPn5P_uAhVskIsKHQ1oChYQ_AUoAXoECBcQAw&biw=1646&bih=1280]\nAre the best flowers.\n\nMost people when posed with the question, what is the best flower? would\nprobably…",
  "data/reddit-changemyview/r/changemyview/comments/lqmxxj/cmv_sex_is_a_spectrum_is_not_only_incoherent_and.json": "Lately I've seen a lot of people making this argument, that not only is gender a\nspectrum, but sex is too. This argument goes beyond acknowledging that some\npeople are intersex and have some difference of sexual development; it actually\nredefines what \"sex\" means altogether. It says we define sex…",
  "data/reddit-changemyview/r/changemyview/comments/lqp11z/cmv_bullying_some_because_they_are_naturally.json": "growing up ginger hasn't been fun at all, from primary school to university and\ngoing outside I've been bullied because of my ginger hair, from name calling and\nbeing teated differently to even being beaten up all because my hair. my problem\nis that bullying someone due to their natural hair being…",
  "data/reddit-changemyview/r/changemyview/comments/lqpz6r/cmv_mass_subscription_to_political_ideologies_is.json": "My view is that considering yourself to be left-wing, right-wing, liberal,\nlibertarian, conservative or subscribing to any political ideology is a mistake\nfor most people.\n\nIn truth, this is a very complex area and the approach to dealing with the\nquestions around how to manage our existence is…",
  "data/reddit-changemyview/r/changemyview/comments/lqtno4/cmv_theres_nothing_wrong_with_the_snl_joke_about.json": "Michael Che said: “Israel is reporting that they’ve vaccinated half of their\npopulation. I’m going to guess it’s the Jewish half.”\n\nThis is a population map\n[https://upload.wikimedia.org/wikipedia/commons/9/96/Demographic_map_of_Palestine_-_Israel_-_with_Legend.png]\nof the territory the Israeli…",
  "data/reddit-changemyview/r/changemyview/comments/lrhxpr/cmv_women_wanting_more_pay_for_sports_and.json": "I'm reluctant to post this view...and if I'm off base hopefully someone can\nexplain that to me in a way I can understand in the comments.\n\nFemale athletes want higher pay. Female sports in general do not have as much\ninterest, for a variety of reasons we can discuss further if someone would…",
  "data/reddit-changemyview/r/changemyview/comments/lrj882/cmv_the_attack_on_the_capitol_isnt_being_taken.json": "Despite pointed warnings in editorials\n[https://www.latimes.com/opinion/story/2021-01-16/donald-trump-insurrection-capitol-beer-hall-putsch]\nabout how much worse a more determined, organized attack could have been, we\nhave seen little in the way of repercussions for anyone in higher positions…",
  "data/reddit-changemyview/r/changemyview/comments/lrkrhl/cmv_there_should_be_a_news_channel_with_both.json": "I hold my view because I feel like news channels like CNN and Fox just create\nmore division than unity as they seem to villainize the opposite side. Any bad\npiece of news that does not look good for their views, they will minimize. To me\nthis is nothing less than unhealthy as it just creates an echo…",
  "data/reddit-changemyview/r/changemyview/comments/lrn86l/cmv_copyrigtht_lasting_longer_than_the_lifetime.json": "Copyright is a brilliant thing, protecting the ideas of an artist, writer or\ndirector. With that they are encouraged to produce something and sequels to\nsuccessful stuff.\n\nBut no person on earth can produce new things, after they died. They don't need\nany encouragement or protection after their…",
  "data/reddit-changemyview/r/changemyview/comments/lrp4sm/cmv_its_understandable_to_not_want_to_date_obese.json": "Now I should explain: I'm assuming most people don't want to date obese people\nfor preference reasons, however there are actually good reasons not to, such as:\n\nNon vanity related physical issues, such as differences in lifestyle and\ndistribution of work in the house, long term health, etc. As well…",
  "data/reddit-changemyview/r/changemyview/comments/ls2ofb/cmv_the_fact_that_another_person_has_been_killed.json": "On May 25th, we saw a horrifying video of George Floyd being murdered after\nbeing choked for 5 minutes. It's fair to say that everyone was shocked but we\nall sort of anticipated that this might happen. Protest's broke out all around\nthe world, 19 million people signed the petition to have justice…",
  "data/reddit-changemyview/r/changemyview/comments/ls3yz4/cmv_most_people_dont_want_their_niche_hobby_to.json": "This was a thought that just popped into my head. I'm not very committed to it,\nand I'm curious to explore it, so it should be relatively easy to CMV.\n\nI've been a bit hipsterish about a few things in my life. Some music genres,\nsome game genres, some computer UI elements. Hell, I first joined…",
  "data/reddit-changemyview/r/changemyview/comments/ls5duk/cmv_the_average_liberal_is_exactly_as_hateful_as.json": "So to expand on the title, conservatives tend to mistrust, fear and/or hate\nunfamiliar cultures and lifestyles, while liberals tend to do the same in\nregards to people who support traditional power structures and lifestyles,\nconservatives, and anyone who they have labelled a bigot in some form…",
  "data/reddit-changemyview/r/changemyview/comments/lsj4dr/cmv_monarchies_are_an_outdated_concept_that_have.json": "In many former British colonies that are independent democratic countries, they\nhave this post called the Governor-General, who is technically an extension of\nthe Queen of England. When laws are passed by parliament and signed into law, it\nis referred to as “given royal assent.”\n\nWhile the Royal…",
  "data/reddit-changemyview/r/changemyview/comments/lskxa5/cmv_companys_caught_using_child_labour_even_if_it.json": "I think that if a company is caught using child labour in 3rd world countries,\nit should be faced with absolutely massive fines. Something along the lines of\nhaving to pay works 2-3 times the wages they would have been owed if working in\nthe country the company is based in. As well as having to pay…",
  "data/reddit-changemyview/r/changemyview/comments/lsy1vi/cmv_dogs_should_be_kept_on_a_leash_in_public.json": "I had a bad experience with a dog and my baby at a public park today. The dog\nwas let off of its leash, came charging up to me and my baby, and started very\naggressively barking/snarling. When the owner was calling it to come back to\nher, it took a few minutes for the dog to obey. There wasn't…",
  "data/reddit-changemyview/r/changemyview/comments/lsyk4j/cmv_if_an_older_person_dates_a_person_whos_legal.json": "I’ve seen so many people getting mad at older dudes for dating young women.\nThink mid 50’s dating a 20-30 year old. I don’t see the problem with this?\nFirstly, some of these girls are explicitly in it for the money. These girls are\nmaking a conscious decision about dating an older dude, none of them…",
  "data/reddit-changemyview/r/changemyview/comments/lt32jh/cmv_society_is_apathetic_to_child_abuse_and_its.json": "I am primarily speaking about those who endured abuse and survived. Not that\nchildren currently enduring abuse do not count. We will get to them later, as\nthey do matter. But in general, my argument is that society doesn't care about\npeople who were abused as children, simply dismissing it as the…",
  "data/reddit-changemyview/r/changemyview/comments/ltk8jj/cmv_youtube_censorship_is_on_a_slippery_slope.json": "YouTube censorship is on a slippery slope. Why on earth are certain words being\nbleeped out of videos. It's a weird version of censorship and I don't think it's\nhealthy. Adults should be allowed to watch a video about a court case without\nevery other word blanked out. And YouTubers should be able to…",
  "data/reddit-changemyview/r/changemyview/comments/ltlvbc/cmv_we_have_done_nothing_to_avoid_the_social.json": "As many modern thinkers have pointed out: we in the West lack meaning in our\nlives. Depression and existential dread are on the rise, people are losing faith\nin traditional systems (politics, media, academia, etc.) that used to be well\nrespected and trusted.\n\nThis has come as Christianity has…",
  "data/reddit-changemyview/r/changemyview/comments/ltpwpa/cmv_forgiving_student_debt_isnt_a_solution_at_all.json": "If we cancel student debt it means the taxpayers pay a ton of $$$$ to colleges\nand universities. So what will happen in a few more years when the next round of\ngraduates are finished? Do we just forgive student debt again? and forever? This\nis the equivalent of bailing water out of a boat with a…",
  "data/reddit-changemyview/r/changemyview/comments/ltv9fl/cmv_the_reason_the_kosher_method_of_killing.json": "If we look at the Torah from the lens of people from thousands of years ago then\nthe reasoning for the kosher method of killing animals becomes clearly an\nattempt to make the most moral method that they could come up with given their\nlevel of scientific knowledge and technology at the time.\n\nAfter…",
  "data/reddit-changemyview/r/changemyview/comments/ltzmy0/cmv_la_is_an_absolute_shithole_of_a_city_both_to.json": "LA doesn’t really even feel like a unified city - more like a jumbled\nclusterfuck of corporatized, commercialized Americana. It has no core, unless\nyou consider its brutally ugly downtown a core. DTLA literally has no attractive\nqualities for a visitor or a resident. Its basically composed of…",
  "data/reddit-changemyview/r/changemyview/comments/lujzzo/cmv_theres_nothing_wrong_with_a_man_sharing_his.json": "This has happened to me many times and I honestly hate this double standard.\n\nI've dated many women that outright told me they shared my phone number and\npicture with a trusted friend before going on a date with me. And that's cool,\ndo what you need to do to feel safe, i have no issue whatsoever…"
}