{
  "data/reddit-books/r/books/comments/npkogc/book_price_changed_after_order_was_placed_and.json": "I've gotten a lot of books through Biblio.com [https://Biblio.com] over the\nyears, and I've recommended them to a lot of people. What happened today is\nmaking me reconsider that. Here's the message I sent to the Support people\ntoday:\n\n> Price changed AFTER order was placed, and then order apparently…",
  "data/reddit-books/r/books/comments/npoih7/i_cant_stand_goodreads_anymore_anyone_else.json": "Goodreads feels so old & outdated & like it has not been updated in years imo.\nThe reviews are so biased sometimes & I can NOT stand the stupid use of gifs in\nthem. I basically just use it to track what ive read & what i want to read. It\nsucks because Ive used it for so long & i dont know of any…",
  "data/reddit-books/r/books/comments/nq0zfn/what_makes_or_breaks_a_book_for_you.json": "Personally it is the writing style for me. Even if the book has a more a less\nbasic story line, i can still enjoy the book if the author's writing style is\ncompelling to me. But if i find the writer's language, word flow, sense of\nhumor, sarcasm etc... somber, then there is high chance i will either…",
  "data/reddit-books/r/books/comments/nq499n/a_happy_reading_moment.json": "I've been an avid reader my entire life. I even relish time spent commuting on\npublic transit because it gives me time to read more. For me, any moment reading\nis a happy moment.\n\nI've never had my book cause a conversation, though, until last weekend. I was\nreading Jasper Fforde's The Fourth Bear…",
  "data/reddit-books/r/books/comments/nqd1aw/just_picked_up_house_of_leaves.json": "Don’t know anything about it other than what I’ve just read in the intro. I’m\nexcited, intrigued, and a bit freaked out, I have to say. For anyone who’s read\nit, is it as good as all the raving reviews on the back of the cover say it is?\n\n“House of Leaves is dizzying in every respect.”\n\nShoot, I…",
  "data/reddit-books/r/books/comments/nqsq5u/i_had_an_epiphany_about_audiobooks.json": "I used to look down on audiobooks, I saw them as an inferior way to consume\nbooks. I saw them as being more akin to podcasts than books.\n\nHowever, I had an epiphany. I realized just what people saw in audiobooks. I\nthought about listening to my parents read stories or a master reading poetry\naloud.…",
  "data/reddit-books/r/books/comments/nqu0nr/do_you_have_trouble_with_starting_books_heres_a.json": "In the beginning of books, actively imagine what you are reading.\n\nThe reason books become easier to read and more immersive the further you read\nis that you need less and less effort to convert the text into imagination.\nRemember this!\n\nDon't be discouraged when you start a new book and it's not as…",
  "data/reddit-books/r/books/comments/nr09hb/we_are_chuck_palahniuk_and_chelsea_cain_running.json": "I, Chuck Palahniuk and my brilliant cohort, Chelsea Cain, have rented a derelict\nmovie palace for the summer. Just a haunted dream factory where twenty writers\nwill meet to tell stories. Sound familiar? Like the Villa Diodati, where in 1816\nMary Shelley created her monster and John Polidori his…",
  "data/reddit-books/r/books/comments/nrgi98/im_edward_slingerland_and_i_just_wrote_a_book.json": "I’m Edward Slingerland [https://www.edwardslingerland.com/], Distinguished\nUniversity Scholar and Professor of Philosophy at the University of British\nColumbia, and I have spent the last several years researching why humans like to\nget high on chemical intoxicants, especially alcohol.\n\nMy new book,…",
  "data/reddit-books/r/books/comments/nrnsdz/people_are_unnecessarily_mean_to_marie_kondo_and.json": "So, I’ve recently finished the The Life-Changing Magic of Tidying Up and loved\nit! Of course, like most people who’ve read it, I was quite surprised by some of\nher methods (like thanking the possessions for their work/their part in ones\nlife) However, I came to appreciate it (the book). Sure, it’s…",
  "data/reddit-books/r/books/comments/nrrkvc/bram_stokers_dracula_does_not_get_enough_love.json": "I have been trying to tell anyone who will listen how great this book has been.\nI read a lot, and I think it is at least equal to all my favorite books. It is\nnot just great, reading it was a beautiful experience. The themes are simple,\nbut the imagery, tangible and emotional, are the pinnacle of…",
  "data/reddit-books/r/books/comments/nsa8ds/thomas_harris_must_be_a_genius_and_red_dragon_a.json": "This is absolutely the best crime fiction, I have read in a while. The last one\nthat came close to it is James Ellroy. Ahh forgive me comparison is poor form.\nIf you haven't read it, it is about a psycho killer being hunted by the b.s.u\nguys. But the villain has been given a great back story and you…",
  "data/reddit-books/r/books/comments/nsitu8/your_favorite_bookstore_experience.json": "I feel like most of us might have that one memory we hold onto in a bookstore.\nWhether it was waiting outside before opening for a book you were excited for\nrelease, finding a cool new bookstore unlike any other you’ve been to, or just a\nfond memory you might’ve had while browsing through a…",
  "data/reddit-books/r/books/comments/nsm1z6/i_have_a_hard_time_understanding_some_books_is.json": "I'm currently reading Gulliver's Travels, and I find that, especially with older\nbooks like this, I sometimes fail to comprehend entire passages, and it's really\nfrustrating. I feel like I'm missing things, especially considering I'm reading\nsatire, which I'm sure has a lot of nuanced jokes and…",
  "data/reddit-books/r/books/comments/nswe3p/we_need_to_stop_shaming_people_who_honestly_say.json": "I think the most frustrating thing for most readers on this sub is that when\nthey read a book that so many people love and realize they are part of the group\nthat doesn't like the book. They can't share the feeling without having fans\nhang the noose around them. We muat be able to let readers share…",
  "data/reddit-books/r/books/comments/nt30x2/ive_read_at_least_20_minutes_for_the_last_7_days.json": "To many this probably dosnt seem like a big deal, but for me it’s huge.\n\nI am a high school student growing up in a generation with a rapidly declining\nattention span and a ever growing library of stimulating games, shows, and\nmovies.\n\nI’ve always loved the idea of reading, the benefits of reading…",
  "data/reddit-books/r/books/comments/nt5mj1/oceania_is_probably_just_britain_and_maybe_even.json": "I mean, how likely is it that the world would actually split in 3? It’s probably\njust propaganda being told to the populace that Oceania is this grand socialist\nland when in reality “oceania” is more likely to just be a hermit state, akin to\nNorth Korea, with made up enemies. The refugees winston…",
  "data/reddit-books/r/books/comments/nt7f1r/i_only_read_books_that_are_part_of_completed.json": "Have you ever read a book, only to realize that it's the first of a series and\nthe next book doesn't come out until next year? And by the time the next book\ncomes out, you'll have forgotten that the book even existed.\n\nOne thing I always check before starting a new book is if it has an…",
  "data/reddit-books/r/books/comments/ntd19i/trying_to_avoid_books_about_middle_aged_men_going.json": "Since reading an interview by the creator of the Vampire Diaries, Julie Plec,\nwhere she explicitly says she no longer wants to read or wrote the typical man\nfeeling unsatisfied in his life narrative I had a revelation that I could avoid\nthose stories too. But it’s hard because they are often…",
  "data/reddit-books/r/books/comments/ntfz1a/i_honestly_thought_id_hate_pride_and_prejudice.json": "I started it on a whim and thought it'd be boring.\n\nI chugged thru the first couple chapters but now that I'm past chapter ten and\nthe characters are getting more fleshed out I'm hooked.\n\nI think it started with all the smack talk the Hursts and Bingleys were saying\nabout Elizabeth while she was out…",
  "data/reddit-books/r/books/comments/ntmqdv/anyone_get_pissed_off_about_fake_books.json": "Recently, I put up a new bookshelf in my office space and I was telling my\ncoworker that I didn't have enough books to put up on the bookshelf and he\ncasually told me to just buy fake books and fill the space or buy books by the\nbunch sorted by color on Etsy. He also admitted that that's exactly…",
  "data/reddit-books/r/books/comments/ntvdat/the_bene_gesserit_are_an_under_appreciated_coven.json": "As all female covens go, the Bene Gesserit are an extremely underappreciated and\nundervalued group of witches. They're enormously powerful in the world of Dune,\nand maybe the most powerful in the whole fiction. They don't often come up in\nsome of the popular subs on this site. I just wanted to point…",
  "data/reddit-books/r/books/comments/ntwz1q/war_and_peace_is_kinda_a_huge_and_great_soap_opera.json": "Basically the title. I'm reading the brazilian portuguese translation (direct\ntranslation from the Russian, probably the most highly regarded here in Brazil\nwith thousands of footnotes, etcetera) and the whole thing seems to be a good\nand funny soap opera with all the aristocratic families dramas…",
  "data/reddit-books/r/books/comments/nu755c/i_just_finished_the_perks_of_being_a_wallflower.json": "Spoiler Warning\n\nTbh considering the general mood of the book I never saw it coming, Charlie is\nhurt on so many deep levels but I never thought he was sexually abused as a kid\nby his \"favorite person in the whole world\"\n\nMy heart just dropped when I found out, you know, that sick feeling you get…",
  "data/reddit-books/r/books/comments/nua5nn/almost_every_ya_romance_fantasy_protagonist_is.json": "I've just started reading shadow and bones and realized after reading similar\nbooks before that almost everyone of the protagonist are equally annoying. They\nare all like lower-class people that got a new power and they all react the\nsame. It's always \"I don't belong here\", \"everyone hates me\" or \"I…",
  "data/reddit-books/r/books/comments/nug2oi/the_ghost_map_on_londons_worst_pandemic.json": "Just finished The Ghost Map\n[https://en.wikipedia.org/wiki/The_Ghost_Map#/media/File:The_Ghost_Map_cover.jpg]\nabout London's worst pandemic (pre Covid) in the Cholera outbreak in Victorian\nLondon. The book was published in 2006, so the author had no idea about Covid at\nthe time. I found it…",
  "data/reddit-books/r/books/comments/nujx2z/halfway_through_ulysses.json": "I posted awhile back about starting Ulysses, and it's taken me a few months but\nI'm finally at about the halfway point. I know it's been said a million times,\nbut the book really is damn hard to read lol I knew it would be difficult but\neven with that expectation, it still is a struggle. That said,…",
  "data/reddit-books/r/books/comments/nuk6ox/dean_koontz_odd_thomas.json": "So...I finally started 'reading' (audible) Odd Thomas (I love the movie). Let me\njust say I love how he writes. This is not what I expected. I don't know what I\nexpected. I'm not much of a horror fan typically..so I guess I thought it would\nbe more like Stephen King (not much a fan)? IDK.\n\nI love…",
  "data/reddit-books/r/books/comments/nult07/finishing_book_name_left_me_broken_inside_posts.json": "Since I joined this subreddit I've had at least three books from my to-read list\npartially spoiled. I get it, the ending was sad, you need to discuss it with\nfellow book lovers, but please consider that you're spoiling it for anyone who\nsees your title.\n\nNow I know there is more to a good book than…",
  "data/reddit-books/r/books/comments/nuvdmj/ive_found_that_writing_reviews_helps_me_retain.json": "Like a lot of folks on this subreddit (presumably), I use Goodreads to help me\nkeep track of books I have read and want to read. It's a wonderful site, and the\nability to filter for your specific edition/cover of a piece of literature is\ngreat.\n\nHowever, the review section is not as appreciated,…",
  "data/reddit-books/r/books/comments/nv5nql/whats_the_longest_book_that_youve_ever_read_that.json": "I was thinking about this question while reading \"Anna Karenina\", a book that I\njust started the other day. Supposing that I finish it (knock on wood), it will\nbe the longest book I've ever read at a whopping 870 pages.\n\nIt fascinates me how some of the longest books out there (Brothers…",
  "data/reddit-books/r/books/comments/nv83g6/susanna_clarke_references_piranesi_2020_twice_in.json": "When I finished Piranesi, I was entirely taken by the mystifying experience of\nreading it. I immediately bought a paperback copy of Strange & Norrell at my\nlocal used bookstore for $5.\n\nWhile I still have 300 pages to go, I feel compelled to share these references\nwith you all now.\n\n 1. A…",
  "data/reddit-books/r/books/comments/nv9gi7/many_people_have_a_vivid_minds_eye_while_others.json": "I have seen quite a few posts here where people discuss how well they can\nvisualize what they are reading. Some scientists found that a very small\npercentage of people could not visualize at all. They also found a slightly\nlarger (but still small) group of people excelled at visualizing.…",
  "data/reddit-books/r/books/comments/nvbnbv/i_feel_like_depression_is_causing_me_to_choose_tv.json": "I used to read loads when I was little, but now I barely read anything. I much\nprefer to watch TV and I was wondering if anyone else has this problem.\n\nI feel like reading is something you have to do, whereas watching TV is\nsomething that's being done to you. I feel like depression is sapping…",
  "data/reddit-books/r/books/comments/nvlsyo/do_you_hear_yourself_reading_in_your_head.json": "If I try and read at a faster pace, I just hear myself, in my head, reading more\nquickly, and it feels... wrong. Especially when characters are talking. So I\ntend to read as I would if narrating out loud (maybe a bit faster).\n\nWhich made me wonder, is it possible to read without sounding it out in…",
  "data/reddit-books/r/books/comments/nvqvyb/harry_potter_is_not_as_good_as_i_remember.json": "Lets me just start by saying that I love the Harry Potter Series. But upon\nthinking back on it, in pretty sure the reason I like It now is because I liked\nit when I was younger, and when I was younger, it was a genuinely new and\ninteresting concept that was executed mostly pretty well.\n\nBut now,…",
  "data/reddit-books/r/books/comments/nvw6wk/i_got_around_to_reading_brandon_sanderson_and_i.json": "Now, I realize that this may be an unpopular opinion, as Sanderson seems to be\none of the most popular fantasy authors out there. That’s actually the reason I\npicked up his books to begin with. I’m not an avid reader of fantasy by any\nmeans. I’m a big fan of Tolkien, GRRM, Robin Hobb, Neil Gaiman,…",
  "data/reddit-books/r/books/comments/nw3jwg/rebecca_is_such_a_hauntingly_beautiful_novel.json": "Im only on chapter 4 and I feel what could only be described as this haunting\nand beautiful atmosphere. It looms over me just as Rebecca's shadow will loom\nover the protagonist (I watched the Hitchcock film so I know what happens). The\nfirst chapter does a great job of engendering this haunting…",
  "data/reddit-books/r/books/comments/nw4k3r/i_just_finished_east_of_eden_and_i_really_loved_it.json": "Pretty much what the title says. I'm just in awe of it. This will contain plot\nspoilers.\n\nI've always been drawn to books that draw such rich characters and Steinbeck\ndoes this so well. Even the minor characters are described so well and\nsuccinctly. Samuel Hamilton might be one of the best…",
  "data/reddit-books/r/books/comments/nw84a7/the_wheel_of_time_series_has_already_cured_so.json": "I have never been an avid reader. I presume that I may have undiagnosed ADHD\nbased on my inability to focus on anything for an extended period of time. I use\nSparkNotes through high school and college. The last novel I completed before\nthis year was over 5 years ago and no more than 300 pages. Then…",
  "data/reddit-books/r/books/comments/nwcwut/appreciation_for_the_his_dark_materials_series.json": "I’m currently re-reading the series, I’m about halfway through “The Amber\nSpyglass”, and I just have to say that my middle school self, when I read it\nabout 6 years ago did not fully appreciate Pullman’s work.\n\nThe world(s) he built with his artful language is baffling - it’s beautifully\ncomplex and…",
  "data/reddit-books/r/books/comments/nwga7p/the_is_overrated_posts_are_becoming_tiresome.json": "First off, yes this is in response to the Brandon Sanderson thread. And no, I’ve\nnever read Sanderson, this post is more an observation of this subreddits\ngeneral attitude and current state.\n\nWhy do we have to have so many “overrated” posts? We all have books/authors we\nlike and dislike, why do we…",
  "data/reddit-books/r/books/comments/nwks20/what_do_you_think_differentiates_a_good_writer.json": "It's easy to say \"the way they write\", but what about their writing specifically\nmakes them stand out over the never-ending sea of other writers?\n\nFor me, it seems to be the way they organize their thoughts/story telling\nprocess. Everything that comes after each thing seems to be natural and…",
  "data/reddit-books/r/books/comments/nwnj9h/appreciation_for_sir_terry_pratchett.json": "My dad got me readings Guards! Guards! When I was a teen and I've been hooked\never since. When I first started my Disc World journey I enjoyed the adventure\nand mystery in the books and also got a good couple of chuckles too.\n\nWhen I re read them in my 20s I fell in live all over again, it was like…",
  "data/reddit-books/r/books/comments/nwqf7m/i_just_finished_reading_a_book_about_eels_and_it.json": "The Book of Eels: Our Enduring Fascination with the Most Mysterious Creature in\nthe Natural World by Patrik Svensson was such a nice read. I've never been\ninterested in eels until I recently learned that science still has a lot of\nquestions about them. This book taught me a lot about the enduring…",
  "data/reddit-books/r/books/comments/nwqgzt/neuromancer_is_something_else.json": "I discovered this book back in college, but found it too dense at that time to\nreally get into it. I came across it again about 3 years ago, and haven't been\nable to let go of it since.\n\nWhat works so well about it, for me, is William Gibson's stubborn refusal to\ndescribe any of the innumerable…",
  "data/reddit-books/r/books/comments/nwqm0l/whats_a_book_you_wish_you_could_read_again_for.json": "I was thinking about rereading Animal Farm last night, and while it is a good\nbook in its own right, I remember a lot of the pleasure of reading it was the\nslow realization of just where the story was headed (I won't explain further\nhere as I want people who read it for the first time to enjoy the…",
  "data/reddit-books/r/books/comments/nwt7dk/appreciation_for_my_highschoolsenior_year.json": "Thank you for acknowledging that some of the \"classics\" or other works we read\nduring the year can be quite boring and dry reads. Instead of trying to convince\na bored group of high school seniors that Dubliners or anything by Faulkner was\nthe epitome of riveting storytelling, you told us outright…",
  "data/reddit-books/r/books/comments/nwvmz8/pulitzer_prize_for_fiction_announced_tomorrow.json": "Who you got? Below is an in-no-way complete list of eligible books I think will\nget consideration:\n\nThe Vanishing Half by Brit Bennett\n\nHomeland Elegies by Ayad Akhtar\n\nDeacon King Kong by James McBride\n\nShuggie Bain by Douglas Stuart\n\nTranscendent Kingdom by Yaa Gyasi\n\nInterior Chinatown by Charles…",
  "data/reddit-books/r/books/comments/nwxodk/tristram_shandy.json": "I’m curious to find out who here has read The Life and Opinions of Tristram\nShandy, Gentleman by Laurence Sterne. I finished it recently and it is one of\nthe most challenging novels I’ve ever read.\n\nWhen I only read for a bit or tried to rush myself, nothing would register\nbecause of the manic…",
  "data/reddit-books/r/books/comments/nwxs3v/what_are_small_moments_in_a_story_that_you_really.json": "I really enjoy when a protagonist actually treat their friends like friends, and\nnot a support cast!\n\nReal friendship is a mutual give and take, you take turns listening to each\nother's problems, giving advice, and offering support. But it feels like too\noften in books the main character's…",
  "data/reddit-books/r/books/comments/nwzjl1/does_anyone_remember_the_secrets_of_droon.json": "It’s baffling to me how history seems to have forgotten this epic fantasy\nchapter book series by Tony Abbott. There were 44 of them! Maybe I’m crazy, but\nI have to think there’s more people out there who remember this series… right?\nJust hear my melodramatic self out.\n\nSo, these books were released…",
  "data/reddit-books/r/books/comments/nx3usy/how_are_people_doing_with_rothfuss_i_dont_think_i.json": "I loved Name of the Wind. I've read it twice (which I don't normally do), and I\nextolled its virtues to anyone who would listen. It perfectly resonated with me.\nI loved the magic and the mysteries, the theories and the fun. I couldn't set\nthe book down! I felt the same way at the beginning of Wise…",
  "data/reddit-books/r/books/comments/nx5yuo/the_sound_of_waves.json": "I just finished Mishima's The Sound of Waves, and it is hands down the best book\ni've ever had the pleasure of reading.\n\nThe entire book felt as tranquil as relaxing in a meadow or garden; yet, I\ncouldn't help but feel a sense of urgency and worry as I flipped through the\npages. Because what the…",
  "data/reddit-books/r/books/comments/nx6xps/do_you_guys_listen_to_musicaudio_while_reading.json": "Hey all,\n\nI've never been much of a \"sit down and read a book\" type of person, but lately\nhave started reading a few Biographies along with some educational books.\n\nOne issue I've had while reading is that I am unable to concentrate longer than\n30-45 minutes. I am someone who is used to either…",
  "data/reddit-books/r/books/comments/nxecgu/the_book_that_changed_my_dads_life.json": "Last week I suddenly remembered I had a gift card for books. I never had it with\nme when I needed it, so it went unused for 'bout 2 years. I put it in my\nbackpack, so I would have it with me when I needed it. A few days later I had to\nwait for someone at the train station and went to peruse the…",
  "data/reddit-books/r/books/comments/nxjh2k/im_helene_wecker_author_of_the_hidden_palace_and.json": "Hi all! Happy to be back for another AMA! My newest book, THE HIDDEN PALACE,\ncontinues the story of Chava the golem and Ahmad the jinni, two mythological\nimmigrants trying to make their way in 1900s New York. You can order it through\nany of the links here\n[https://www.harpercollins.com/products/the…",
  "data/reddit-books/r/books/comments/nxthqj/my_parents_love_story.json": "I would not have been born without literature. Is \"book baby\" a thing? Because\nit should be. Back in the 90s, my dad (a divorcée) and my mum (who never\nintended to get married) was introduced to each other via a string of connection\nbecause people love to meddle. On their 2nd meeting, they decided…",
  "data/reddit-books/r/books/comments/ny3ini/im_so_tired_of_books_titled_the_xs_daughter_or.json": "Maybe it’s because I’m a librarian, but I feel like every second book at the\nmoment has a title following this format and it immediately turns me off. It’s\njust so overdone!\n\nI wanted to see if anyone else has noticed this trend and it turns out I’m not\nthe only one:\n\n…it’s that familiar-sounding…",
  "data/reddit-books/r/books/comments/ny3mdw/just_finished_the_main_story_of_lotr_all_three_of.json": "I had not watched the movies nor read the books before. And since I got into\nreading last year, I thought it would be great to read the LOTR during my summer\nholidays. It took me about a month to read all three of them, excluding the\nappendices, and I really enjoyed it. I enjoyed every part of it,…",
  "data/reddit-books/r/books/comments/ny4a7c/the_holiday_house_weve_rented_in_southwold_uk.json": "PD James, who died six years ago, had a holiday home\n[https://www.visitsuffolk.com/blog/literature-themed-holiday-in-suffolk.aspx] in\nSouthwold on the east coast of the UK. (Apparently she also sheltered Salman\nRushdie here during the fatwa.) We didn't rent this place knowing it had been\nhers, but I…",
  "data/reddit-books/r/books/comments/nygowy/i_have_not_yet_found_a_joy_to_match_sharing_a.json": "My girls are 4 and 6. We have read to them almost every single night since they\nwere born. Literally, when we were home from the hospital, we would lay in bed\ntogether in the evenings: baby and mama cuddled up together, and me reading to\nthem. We had no illusions that the babies were getting…",
  "data/reddit-books/r/books/comments/nyjm1v/the_color_purple_is_one_of_those_books_that_will.json": "I finished The Color Purple yesterday. What is there to say?! Jeez. An\nabsolutely amazing book. The story of a southern, downtrodden woman fighting\nagainst the tyranny of men and racism is incredibly compelling. The\ncharacterisation is masterful and it’s written exquisitely by Alice Walker.\nMoved me…",
  "data/reddit-books/r/books/comments/nyrkkz/just_finished_the_count_of_monte_cristo_and_im_in.json": "I don't cry over books, but my god this book made me cry a river. Everything was\njust PERFECT! From the clever vengeance of the Count, the amazing narration and\nanalogies, the VAST but nail biting storyline, the moral dilemmas and beautiful\nthemes including but not limited to providence, everything…",
  "data/reddit-books/r/books/comments/nyv21j/the_midnight_library.json": "I finished this today and I feel...really disappointed. I knew this was a\npopular/hyped read and avoided it as a result for quite some time. I decided to\nread two of his non-fiction books and was sort of thrown off by them — maybe\nbecause I felt as though the tips/things mentioned I already knew. I…",
  "data/reddit-books/r/books/comments/nznd06/i_bought_the_uk_version_of_an_american_book_and.json": "I’ve bought UK versions of American books before, and usually the only thing\ndifferent is the punctuation. This one though, the actual content of the book is\ndifferent. It’s Good Girl, Bad Blood which is the sequel to A Good Girl’s Guide\nto Murder. I first noticed “mum” instead of “mom”, but then…",
  "data/reddit-books/r/books/comments/nzq4iw/im_lawrence_wright_pulitzer_prizewinning_author.json": "I'm Lawrence Wright, staff writer for The New Yorker, playwright, screenwriter,\nand a Pulitzer Prize–winning author who has released eleven books of\nnon-fiction, including The Looming Tower\n[https://www.penguinrandomhouse.com/books/194238/the-looming-tower-movie-tie-in-by-lawrence-wright/],\nGoing…",
  "data/reddit-books/r/books/comments/nzvatn/just_finished_project_hail_mary_what_an_enjoyable.json": "First, I’ll say that I loved The Martian, both the book and the adapted movie.\nThis book has a similar feel in a lot of ways, which I liked. I felt the\nemotional roller coaster more than I was expecting, especially towards the end.\nI went into this story completely blind to the premise and am so…",
  "data/reddit-books/r/books/comments/o0ae2g/an_informal_book_review_on_when_breath_becomes.json": "I truly don't know where to start. Paul Kalanithi, do I speak of you as a\nneurosurgeon, a neuroscientist, a husband, a father, or a cancer patient? I\nthink that's the beauty of who Kalanithi was, no matter how hard you tried, one\ntitle wouldn't be enough to capture his essence.\n\nI picked up this…",
  "data/reddit-books/r/books/comments/o0cgsf/the_rbooks_book_club_selection_for_july_is.json": "If you are looking for the announcement thread for the previous month, it may be\nfound here\n[https://old.reddit.com/r/books/comments/nf76bm/the_rbooks_book_club_selection_for_june_is/].\n\nDuring the month of July, we will be reading Anxious People by Fredrik Backman.\nEach week there will be a…",
  "data/reddit-books/r/books/comments/o0fnki/anyone_else_more_but_shorter_book_chapters_make.json": "There are some books with a looooot of chapters but each chapter's just around\n1-9 pages long. Then there are some books with fewer chapters but they can go on\nto be 30+ pages long.\n\nThere must be some psychological explanation for this but for me I find that the\nones with a lot of chapters make…",
  "data/reddit-books/r/books/comments/o0gk56/homegoing_by_yaa_gyasi_was_such_a_beautiful_read.json": "A historical novel written by Yaa Gyasi, it was simultaneously beautiful and sad\nnovel. With the turn of each pages, I found myself transported back in time and\nwatched how the lives of each character unfolded- as if they were all living,\nbreathing characters while I was the one who was ageless, and…",
  "data/reddit-books/r/books/comments/o0l5ft/ranting_book_review_of_the_invisible_life_of.json": "I finished this book yesterday and am still so angry about it that I just had to\nwrite a ranting book review for catharsis. This book had such a great premise.\nWhat a good idea for a story! Which is why I'm so angry that the author did such\na poor job. Everything from the writing to the plot to the…",
  "data/reddit-books/r/books/comments/o0lexd/in_what_books_have_you_truly_seen_yourself.json": "As a longtime reader, only recently while reading “The Razor’s Edge” by Somerset\nMaugham have I truly seen who I am reflected in the pages. This was such a\nsurprising and welcome thing to stumble across. One of the character’s thoughts,\nfeelings, place in life and even his experiences in the events…",
  "data/reddit-books/r/books/comments/o0vjj4/my_book_bag_was_stolen_out_of_my_car.json": "Thankfully, there was nothing of substantial monetary value in the bag. But the\nbooks that were in it were incredibly important to me. But my fiancée’s copy of\nOathbringer, a book which is well loved and one that I was working my way\nthrough, was in that bag. Nearly worthless to someone putting in…",
  "data/reddit-books/r/books/comments/o0w4l5/starless_sea_by_erin_morgenstern_the_struggle_is.json": "I am exactly 50% through this book and I am really fighting to keep up the\nmotivation to read it.\n\nThe prose is beautiful (if perhaps a little description heavy) and the premise\nof the story is so exciting, but seems to be going nowhere. The main character\nis DULL and has very little valid…",
  "data/reddit-books/r/books/comments/o11c4v/on_earth_were_briefly_gorgeous_by_ocean_vuong_is.json": "As part of Cindy Pham's (booktuber) Asian Readathon I picked up 'OEWBG' and I\nwas blown away. The book is framed as a letter addressed to the author's mother\nwho is illiterate.He doesn't outright refer to the narrator of the book by his\nname but by a childhood nickname : Little Dog.\n\nIt weaves in…",
  "data/reddit-books/r/books/comments/o12l28/the_endless_train_of_older_manyounger_woman.json": "Hello everyone - ah, my first post on r/books [/r/books] and it's a rant!\n\nSo I just read 'The Paper Magician'. It was a good idea, not amazingly well\nwritten, but honestly the gripe is with the 19 year old, fresh out of school,\ngirl, \"falling in love\" with her 30+ year old mentor, the end of the…",
  "data/reddit-books/r/books/comments/o157xl/happy_bloomsday_im_almost_finished_with_ulysses.json": "I've been on a kick of reading \"hard\" books this year (Moby Dick, Don Quixote),\nand decided to tackle Ulysses. I'd heard it's one of the toughest books to read,\nso I figured it would be an interesting challenge. I found a guide online to\nhelp me through it, and it's actually been my favorite book…",
  "data/reddit-books/r/books/comments/o16ch8/i_really_appreciate_people_who_eagerly_talks.json": "Recently I started reading more and while I personally don't find the reading\nactivity so enjoyable the social part is wonderful. I love talking about books &\nstories. Like with great book talkers one can get lost in the book again. Be it\ntalking about the plot, about the characters, sometimes it's…",
  "data/reddit-books/r/books/comments/o189ry/im_terry_miles_i_love_writing_rabbits_is_real_ama.json": "I make movies, podcasts, music, books and whatever they'll let me. I wrote and\ndirected movies starring Jennifer Beals, Donald Sutherland, Christian Slater and\n\"Stone Cold\" Steve Austin. I created The Public Radio Alliance\n[http://www.publicradioalliance.com/] which features the podcasts:…",
  "data/reddit-books/r/books/comments/o1c4bw/remember_to_check_your_local_library_for_a.json": "Went to the library with the kids yesterday. Had my mom with us, so for once I\nactually got to browse the bookshop inside. Ended up with 6 books. 4 are\ncrafting and “how to” manuals. Other two are Anna Karenina and The Hound of the\nBaskervilles. The cost for all 6? $5.50\n\nTell me about the best deal…",
  "data/reddit-books/r/books/comments/o1lhnz/just_finished_reading_project_hail_mary.json": "Wow. Just wow. This book was absolutely amazing. The humor was genuine, the plot\nwas compelling and the characters were relatable.\n\nIt definitely was one of the most fun I have had reading in a long time. The\nvarious conflicts that arise in the story are all so enthralling.\n\nThe ending surprised me…",
  "data/reddit-books/r/books/comments/o1njl9/the_disappearing_spoon_a_delightful_surprise_of_a.json": "I have just finished reading Sam Kean's The Disappearing Spoon and Other True\nTales of Madness, Love, and the History of the World from the Periodic Table of\nthe Elements (a mouthful of a title) and I would like to share with you how much\nI enjoyed the book.\n\nI bought this book on a whim at a Barnes…",
  "data/reddit-books/r/books/comments/o2sk6z/i_reread_a_book_i_hated_in_high_school_and_fell.json": "We were assigned “Farenheiht 451” by Ray Bradbury in my 10th grade English\nclass. I remember not enjoying it all. (I also did not enjoy reading “Lord of\nthe Flies” by William Golding that year either)\n\nI’m 30 now. I decided to reread it to see if I still did not enjoy it, or if it\nwas a case of me…",
  "data/reddit-books/r/books/comments/o33dip/what_are_some_books_you_love_with.json": "For me I would put forth, among others, Marilynne Robinson's Gilead. I'm\ninterested in religious history and theology from a historical perspective while\nthis novel is inextricable from a deep and vibrant sense of genuine faith and a\npersonal connection to Christianity. It's also one of the…",
  "data/reddit-books/r/books/comments/o3blzj/house_on_the_borderland_by_william_hodgson.json": "This book has a slow-going unsettling weirdness to it all throughout, and\nsuddenly at the end everything collapses theatrically. A very heavy book, but\nwell worth the read. The poetry is beautiful and Hodgson's writing style is\ndistinguishable. Just wanted to throw it out there!\n\nTake it or leave…",
  "data/reddit-books/r/books/comments/o3btuo/wheel_of_time_appreciation_please_no_spoilers.json": "Hey guys, I just wanted to chime in having just started Eye of the World and I\ngotta say, contrary to what everyone else said about the first story being slow\nor whatever... I'm really loving it.\n\nI have tried to read both J.R.R. Tolkien in the past as well as GoT and I\nreally, really am enjoying…",
  "data/reddit-books/r/books/comments/o3inkb/dune_reignited_my_love_for_reading.json": "A little over a month ago, I was with some friends and we visited a book store\non Main Street that had just opened. I didn't necessarily wanna go there, but I\nwent in with them regardless. I didn't see anything too interesting, which had\nbeen the case since high school, which is when I felt my…",
  "data/reddit-books/r/books/comments/o3jrvy/i_had_an_absolute_blast_reading_the_martian.json": "I had been thinking about reading The Martian ever since I watched the movie and\nfinally I read it. And I have to say, this is the most fun I've had reading a\nbook 'cause I'm into astronomy, NASA and all things space related.\n\nGranted some of the scenarios in the book seem far-fetched like the…",
  "data/reddit-books/r/books/comments/o3m6pq/i_reread_the_call_of_the_wild_for_the_first_time.json": "This book really covered a lot of ground for me: its sense of realism,\nadventure, and fable kept me captivated the whole time. It was fascinating to\nwatch Buck's evolution, aligning himself once again with his primal roots.\n\nBut so many moments along the way stood out. Situations such as Buck…",
  "data/reddit-books/r/books/comments/o3n1sa/reading_is_a_gift.json": "When I was a kid I was an avid reader, primarily because my dad was. When he\ndied I couldn’t sit with a book long enough to fully dive in. Why, I don’t know.\n\nRecently I picked up the Harry Potter books, it was what I read with him as a\nkid. I began to realise how wonderful books are, getting lost…",
  "data/reddit-books/r/books/comments/o3s5g7/asimovs_guide_to_the_bible_a_secular_look_at_the.json": "I recently found out that Isaac Asimov, arguably one of the keystones of the\nScience Fiction world, published quite a few books outside of the Sci-Fi world,\nforgive the error of my ways. I was recently gifted a copy of his Guide to the\nBible…",
  "data/reddit-books/r/books/comments/o3uf44/im_sick_and_tired_of_buying_like_new_books_from.json": "I'm a pretty big used book buyer. That being said, buying a used book without a\nphoto of the actual book is pretty risky these days. I tend to buy Like New or\nVery Good ones instead of the Good or Acceptable ones, as the latter tend to be\npretty trashed. (Readable but not aesthetically pleasing).…",
  "data/reddit-books/r/books/comments/o3vvx4/just_read_persuasion_by_jane_austen_for_the_first.json": "Its clear why her books have withstood the test of time. She knew how to write\nabout real human emotions that everybody feels or can feel, no matter their\nstatus. Her writing resonates with her readers centuries later because she knew\nhow it felt to be embarrassed by over-the-top family members, but…",
  "data/reddit-books/r/books/comments/o3w8ri/i_didnt_read_as_a_kid_rantlife_story_sorry.json": "When people talk about how they blazed through books in middle school, like\nreading all of Percy Jackson in a week, I’m a bit jealous. I avoided reading at\nall costs until my 11th grade English class.\n\nWhen I was a kid I didn’t particularly like the books that my older sister and\ndad liked, and when…",
  "data/reddit-books/r/books/comments/o3yg8z/moby_dick_appreciation_post.json": "Listen, why did no one tell me that Melville is fabulous?\n\nI’ve been on a campaign to read classics that I can’t believe I didn’t read\nbefore graduating with a degree in English. I started with Jane Eyre (which I\nADORED and genuinely did not care about any of the parts about Rochester), and\nnow am…",
  "data/reddit-books/r/books/comments/o4089a/anyone_read_huckleberry_finn_as_a_teen_not_for.json": "I was a 12 year old immigrant so when I read the book, so I didn't know about\nits historical context. I simply picked up Adventures of Tom Sawyer and\nHuckleberry Finn because I heard it was a classic, and I thought the boy on the\ncover was cute. It's funny how the only thing I remember about…",
  "data/reddit-books/r/books/comments/o440al/read_the_brave_new_world_and_feeling_like_the.json": "If you're someone like me, who has a tough time reading classics, try this book!\nIt's a short little book with strong disillusioning material that's both\nenticing and scary at times.\n\nImagine this, the idea of dystopia often stems from dissent; But Huxley in this\nbook, recreated the idea in a world…",
  "data/reddit-books/r/books/comments/o44gae/first_they_killed_my_father_a_daughter_of.json": "My parents never talked about their experiences of the war. As I read through\nthis book, Ung's memoir helped me fill in the gaps that are difficult for my\nparents to speak of. I have several different emotions while flipping through\nthe pages. I've learnt about had happened to the people of Cambodia…",
  "data/reddit-books/r/books/comments/o47sxx/just_a_helpful_suggestion_for_anyone_who_uses.json": "I know in my state, and I'm sure it's the same in many others, you only have to\nbe a resident of said state to get library cards from more than one city. This\nis obviously helpful as many online catalogues are different and some will have\nwhat others do not. Also, if something you want is already…",
  "data/reddit-books/r/books/comments/o4amyy/how_do_you_guys_read_the_songs_written_in_books.json": "I always imagine every part of the book vividly except the songs. The scenery,\nthe character intonations, everything is quite easy to picture and hear. But\nwhen there’s a whole song written in, I lose immersion. I don’t understand how\nto think of the tone or theme of the music, let alone the vocals.…",
  "data/reddit-books/r/books/comments/o4ed84/choose_your_own_adventure_books_as_a_serious.json": "I remember reading these kinds of \"Choose Your Own Adventure\" children's books\nwhen I was young: you know, \"if you pick up the shining amulet, turn to pg. 36;\nif you leave it where it is, turn to pg. 40\" etc. They were great fun, although\nI think the novelty somewhat wore off after I'd tried a…",
  "data/reddit-books/r/books/comments/o4egha/east_of_eden_was_a_terrific_book_that_made_me.json": "I've only read Grapes of Wrath before this, and it was great, but EoE was\nbetter. I don't know what is it that is so enticing, perhaps his writing style,\nor the cast of characters. Cathy is particularly an interesting character, and\nit's still a mystery why she is the way she is (and I believe…",
  "data/reddit-books/r/books/comments/o4lcqs/if_you_hate_working_post_office_by_charles.json": "A semi autobiographical account, we follow Henry, a man in his mid 30s who needs\na job and joins the Postal Office only to absolutely hate it. Yet despite this,\nhe is only a handful of 200 employees that last 11 years. We follow his\nmomentous routine of filing letters, being micro managed and taking…",
  "data/reddit-books/r/books/comments/o4ls99/i_love_reading_because_it_helps_keep_my.json": "You know how it is when things get boring but then you pick up an interesting\nbook and suddenly you're swept into this whole new world with all these people\nwith real-life problems and you just get so caught up it feels like everything\nin your real world doesn't matter?\n\nI love reading because of…",
  "data/reddit-books/r/books/comments/o55mm3/bookshoporg_has_free_shipping_today_and_tomorrow.json": "Bookshop.org sources your purchases from your local bookstores, it's a great\nservice that helps support local businesses that are otherwise struggling with\nonline competition and e-books. For today and tomorrow they're offering free\nshipping to compete with Amazon Prime Day. There's a book you can…",
  "data/reddit-books/r/books/comments/o582r2/this_is_a_must_read_the_westing_game.json": "This book is my absolute favorite book in the world. It was written by Ellen\nRaskin, a pronounced children's book illustrator. She did no drafts of the book\nand no written infrastructure, yet she produced a very interconnected and\nexquisite story. The book won the 1979 Newbery Medal.\n\nThe book…",
  "data/reddit-books/r/books/comments/o5hps8/just_finished_reading_animal_farm_and_would_like.json": "I loved this satirical allegory and how Orwell brilliantly demonstrated the\ndynamics of oppression, tyranny, propaganda through symbolism. I feel like its\nlowkey just about failed revolutions everywhere. I was, in particular, wondering\nwhat symbolisms I might have missed or maybe weren't the most…",
  "data/reddit-books/r/books/comments/o5ojwt/why_does_everyone_know_of_norse_mythology_or.json": "The Kalevala can be attributed, at least partially, to a ton of the archetypes\nwe see in fantasy today. In large part, that’s due to the fact it inspired\nTolkien and quite a few elements, and even some characters, of the Lord of the\nRings come right out of the Kalevala. Despite that, it seems like…",
  "data/reddit-books/r/books/comments/o5q7kn/oscar_martinezs_account_of_the_el_salvadorus.json": "Oscar Martinez is an award winning journalist from El Salvador and cofounder of\nelfaro.net, an online newspaper in El Salvador. One of the most intrepid\njournalists I've ever encountered in nonfiction, he beautifully captures both\nthe horrific conditions these migrants face while simultaneously…",
  "data/reddit-books/r/books/comments/o5vf6q/do_you_ever_finish_a_book_and_then_feel_kinda.json": "I finished reading \"I'm Thinking of Ending Things\" which overall I thought was\nan interesting book, until I got to the end. I had no fucking clue what the\nending was trying to tell me had happened and what it meant for the previous\nparts of the story that happened. I had to go to Google to figure…",
  "data/reddit-books/r/books/comments/o616p2/audiobooks_have_ruined_me.json": "It started during lockdown. Whether I was cleaning, exercising, or curled up in\nthe fetal position under my bed, I could be listening to a wonderful story,\nnarrated by an amazing voice actor. Since then my bedside book stack has grown,\nso I finally picked up The Blade Itself and, while I’m really…",
  "data/reddit-books/r/books/comments/o62xvt/what_books_blew_you_away_that_they_made_you.json": "For example, I'm reading through Kim Stanley Robinson's Mars trilogy and I am in\nawe of how much scientific knowledge he has. The physics, chemistry, and biology\nknowledge to convincingly tell the story of the terraforming of Mars and make it\nseem so believable without any inexplicable technobabble…",
  "data/reddit-books/r/books/comments/o68eyi/to_kill_a_mockingbird_is_very_well_crafted_piece.json": "Completed just yesterday, took me 15 days but at the end I can say it proudly\nthat it deserve all the time and attention; it's such a masterpiece.\n\nEnglish being my second language, I must admit that it was a hard read for me,\nnevertheless I enjoyed it. The way in which the author paints the…",
  "data/reddit-books/r/books/comments/o6c8um/the_show_good_omens_is_a_damn_fine_representation.json": "Just finished the series after reading the book, everything the show left out it\nmade up for with tasteful additions and an amazing performance by David Tennant\nand Michael Sheen. I'm usually skeptical of movie adaptations, but I feel like I\ncould easily pass this off to someone who hasn't read the…",
  "data/reddit-books/r/books/comments/o6m2b1/why_are_names_or_some_persons_or_places_in_books.json": "I recently started reading again after many many years. I've currently read the\nCount of Monte Cristo and Frankenstein in English (both from project Gutenberg)\nand then I'm currently reading Pride and Prejudice in Finnish. I think in all of\nthese books, there has been some names of places or persons…",
  "data/reddit-books/r/books/comments/o6qgth/lord_of_the_rings.json": "I know it is an unpopular opinion but I just finished the first two Lord of the\nRings books and it has been one of those rare instances where I enjoyed the\nmovies way more than the source books.\n\nWith the novels I just never felt the true desperation and overwhelming odds\nfacing the characters. The…",
  "data/reddit-books/r/books/comments/o6z9r4/what_makes_agatha_christies_books_so_great.json": "I started to read Murder on the Orient Express yesterday afternoon and just felt\ncompelled to read through well into the night.\n\nThis morning, I was surprised. Not only had it been a long time since a book\nkept me up, my latest reads had not surprised me or made me laugh like\nChristie's great story.…",
  "data/reddit-books/r/books/comments/o6zf61/reading_catch22_this_paragraph_is_indecipherable.json": "This is from the first chapter and my second attempt at the book. The last time\nI tried reading, I didn’t understand this paragraph and it put me off reading\nthe rest of the book for some reason. Paragraph is below:\n\n“The colonel was in Communications, and he was kept busy day and night\ntransmitting…",
  "data/reddit-books/r/books/comments/o70knn/happy_birthday_to_octavia_butler.json": "I wanted to bring attention to the fact that Octavia Butler's birthday was\nearlier this week. She was a literary and sci fi visionary and trailblazer. She\nwas the first (and I think only) science fiction author to recurve the MacArthur\nGenius grant. Her work and representation in the genre helped to…",
  "data/reddit-books/r/books/comments/o784bj/so_i_hated_the_ending_of_harry_potter_and_the.json": "(possible spoilers)\n\nI recently finished reading (for the first time) all the Harry Potter books, and\nI really hated the very end. It seemed so rushed and it didn't go into detail on\nhow the deaths of major characters impacted their lives afterwards. To me, the\nending seemed like 'oh we won, now…",
  "data/reddit-books/r/books/comments/o7bvpi/i_just_finished_read_a_thousand_splendid_suns_by.json": "When I was halfway through the book, I couldn't resist the urge to spoil it for\nmyself on the internet. The book's just so compelling. Its honestly one of the\nbest - maybe even the best - books I've ever read. I feel so ignorant about not\nknowing how severe Afghanistan's situation is. And the two…",
  "data/reddit-books/r/books/comments/o7f06f/read_shakespeares_work_for_the_first_time_it_is.json": "I am 21 and I have never read Shakespeare before untill the last 3-4 days. I had\nspent last days just reading and studying about Shakespeare's characters and\nstories.\n\nI had 2 of his work in my shelf bought at a sale, I started off with the\nthinnest one. It was As you like it, It was a quick 2-3…",
  "data/reddit-books/r/books/comments/o7iht5/i_just_read_the_alchemist.json": "and I'm livid. I can't even express in words how much I hated that\nbaby's-first-philosophy BS. Why does everyone love this book so much? Can\nsomebody please explain to me what I was supposed to get out of this experience?\nAm I just too stupid to \"get it?\" It's so... basic. So surface level.…",
  "data/reddit-books/r/books/comments/o7kfji/a_confederacy_of_dunces.json": "Sirs, I just finished reading the book. It was a wonderful read. I thoroughly\nenjoyed Ignatius’s worldview, his wanting to start a revolution, Mrs Reily’s\ntransformation, Santa’s don’t care attitude, Mancuso’s helplessness, Jones’s\nwanting to cause a sabotage, Darlene’s innocence, Lana’s attitude,…",
  "data/reddit-books/r/books/comments/o7mi9j/are_books_keeping_you_alive.json": "I was talking to a friend today about taking a break from exam stress to read\nsome interesting books, and his reply was \"pfftt..what a nerd!\", which is the\nusual response and I don't really think about it usually. But now I started\nthinking- I don't have much of a social life, nor do I have lasting…",
  "data/reddit-books/r/books/comments/o7miic/so_i_just_discovered_pg_wodehouse.json": "I came across a random post on this sub regarding humorous books and P.G.\nWodehouse's Bertie and Jeeves series came up.\n\nI don't think I laughed so much at a book in years! (The Code of the Woosters)\nhad to be the funniest book about a cow-creamer out there... probably the only\none but the point…",
  "data/reddit-books/r/books/comments/o7o856/the_inflated_talents_of_protagonists_in_ya_books.json": "I don’t know if it’s just me or the books I am reading but I am finding it more\ncommon place for protagonists (or at least main characters we are designed to\nroot for) to posses inflated talents.\n\nWhat I mean is, almost every protagonist has an array of gifts all at once.\nThese talents consist of…",
  "data/reddit-books/r/books/comments/o7org9/cant_seem_to_get_super_engrossed_in_books_like.json": "Back when I was still a kid, getting into a book - and staying there - seemed\nsuper easy. Probably the best example of this, not just for me but for a lot of\npeople, was Harry Potter. If I got a new Harry Potter in my hands I just had to\nfinish it that same day, sleeping be damned, and the world…",
  "data/reddit-books/r/books/comments/o7t048/when_i_read_i_pretend_i_am_a_filmmaker_and_as_i.json": "I assume this is a well known common thing but it only clicked with me recently\nand I have been a voracious reader! Before then, I've always been one of those\n\"I must focus on each word and nothing else or I will get lost\" kind of kid. I\ncould not afford anything else happening in my head other than…",
  "data/reddit-books/r/books/comments/o7t87l/i_just_finished_the_murder_on_the_orient_express.json": "I don't know what to say, I suspected that they were all in on it, pages before\nthe big reveal. I thought maybe M.bouc would have been in on it and organized\nbeing the manager of the train but I didn't see anything coming.\n\nsuspecting that it was a group murder was only possible due to Poirot…",
  "data/reddit-books/r/books/comments/o7v50n/has_there_been_any_huge_hit_in_the_past_decade.json": "Hello !\n\nHas there been any huge hit (like Harry Potter scale) in the book industry the\npast decade ? I'm not talking about books that got popular afterwards such as\nthe GoT books, I'm talking about books that got insanely popular right from\nrelease.\n\nThis quesion rose from watching \"the mystery of…",
  "data/reddit-books/r/books/comments/o7zg9h/just_finished_of_mice_and_men.json": "This was one of the first novels I’ve ever actually liked (the other one is Safe\nas Houses).\n\nThe characters all feel so real and the writing is so incredibly descriptive.\nIt’s so easy to get lost in it since you can easily construct every last aspect\nof every setting and person in your head. You…",
  "data/reddit-books/r/books/comments/o8a6yr/dostoevsky_russian_naming_conventions.json": "Finished and loved Crime and Punishment today, but I am extremely unfamiliar\nwith Russian naming conventions which was a source of great confusion for me\nwhile reading. Can anybody explain to me what is behind the different variations\nof names?\n\nE.g. Rodion Romanovitch Raskolnikov aka Rodya aka…",
  "data/reddit-books/r/books/comments/o8a70m/all_quiet_on_the_western_front_by_e_m_remarque.json": "I've finished «All Quiet on the Western Front» several days ago. So this the\nfirst book since I started reading Remarque. And I'm very delighted of him. This\nbook is forcing to think about what really means to be a soldier and would there\nis any honour at war? Once I thought about to become a…",
  "data/reddit-books/r/books/comments/o8bgml/the_ending_of_1984.json": "I recently finished reading George Orwell's 1984 and it was fantastic, but the\nending was incredibly morbid and quite soul crushing. The idea that the\nindividual can never overcome the insurmountable control from the government and\npressure to conform left me floored upon ending the book. I'm trying…",
  "data/reddit-books/r/books/comments/o8ii1g/are_there_many_people_in_this_sub_who_are_not.json": "I know many people who read a lot of books growing up and subsequently can now\nread at a lightning fast pace.\n\nHowever, I'm curious if there are any 'late to the party' readers in here like\nmyself? And if so, what got you into reading for entertainment?\n\nI started studying History when I was 20 and…",
  "data/reddit-books/r/books/comments/o8ns9j/the_coddling_of_the_american_mind.json": "I finished this book a bit ago, and I think it's a really important read. Haidt\nand Lukianoff (the authors) discuss the rise of what they call \"safetyism\" in\nAmerica, and how it's backfiring on us and creating a culture of intolerance and\nfragility. They make convincing arguments.\n\nI was wondering…",
  "data/reddit-books/r/books/comments/o8p59t/i_love_pride_and_prejudice.json": "Like the title says, I love Pride and Prejudice. One of my favorite books. Don’t\nknow how many other guys love that book but I have no shame in saying that I\nlove it. First off, Elizabeth Bennet is an incredibly awesome heroine and I have\na hard time finding others who are like her. The characters…",
  "data/reddit-books/r/books/comments/o8t83d/what_do_you_think_happened_to_george_rr_martin.json": "Two of the most famous and successful writers of this century and both have\nseemingly stopped writing.\n\nRothfuss is supposedly finishing his trilogy but his last book was released over\na decade ago (2011).\n\nMartin has written 5 books in his 7 part series. His last release was also 2011.\n\nWhat do you…",
  "data/reddit-books/r/books/comments/o8t9fh/the_blind_assassin_margaret_atwood.json": "So I'm not an avid reader like most here, but I used to be when I was younger.\nRecently I've started trying to get into reading again and it's going\nwonderfully.\n\nOn different sites online you can now order something called \"Blind date with a\nbook\", with most options allowing you to choose a genre…",
  "data/reddit-books/r/books/comments/o8wzwt/what_are_the_books_you_reread_at_least_2_times.json": "> I know this is not a book suggesting sub, but this helps people find some\n> great books because there are more members in this sub, so please don't remove\n> this post\n\nI'm new to books, I just adopted the reading habit last year, and read few\nbooks, and one thing that striking me is to pick that…",
  "data/reddit-books/r/books/comments/o8ynxc/the_book_thief_markus_zusak.json": "This is one book that I've made an attempt to read two or three times previously\nbut I just couldn't do it. I'd always stop at 5 or 6 pages. Then, the book would\njust lay forgotten there.\n\nBut I finally did it this time! And I honestly don't know why I wasn't able to\nread it earlier.\n\nI was sucked…",
  "data/reddit-books/r/books/comments/o91lmb/fairly_unimpressed_with_patrick_rothfuss.json": "So Im a big fantasy reader but have been pretty hesitant to start To Name The\nWind because of the slow timetable with which he is writing the books. I don't\nmind starting a series before its finished to support the author but at this\npoint it basically seems he's never going to finish it.\n\nHowever,…",
  "data/reddit-books/r/books/comments/o92pnr/the_idiot.json": "I just finished part one of the idiot and I am really impressed. Someone posted\nin this sub that they thought the brothers karzmazov was the best book of all\ntime. Naturally, I went out and bought the book, but I also bought the idiot (I\nwanted to read it as a warm up to the author). Dostoevsky has…",
  "data/reddit-books/r/books/comments/o9b0zg/i_just_finished_the_stand_complete_uncut_last.json": "I've had The Stand on my shelf for a handful of years, never really remembering\nwhat it was about. But everyone just screamed \"classic\" at me when I mentioned\nthe name, so it sat in my mental book queue for a while. Go figure I decide to\nmake it my goal for the year 2021 after the bizarre year that…",
  "data/reddit-books/r/books/comments/o9bbqd/if_you_started_your_own_little_free_library.json": "What would the first round of books you put in it look like? Would you start\nwith classics or go for crowd pleasers?\n\nWould you use circulating themes (i.e. Pride Month in June, beach reads in\nsummer, Christmas books in winter) or would you stock it with whatever you'd\njust recently read?\n\nI'm…",
  "data/reddit-books/r/books/comments/o9evwi/is_there_an_app_like_goodreads_that_actually_has.json": "God I hate Goodreads. The way you log books, rate them, add friends, see\nfriend’s activity, etc. I could go on for days. The interface is just terrible\nand clunky.\n\nIs there a Goodreads alternative that actually gets frequent love and attention?\nSomething closer to the simplicity of Letterboxd?\n\nIf…",
  "data/reddit-books/r/books/comments/o9iac6/the_persian_boy_by_mary_renault.json": "I just finished this up and wanted to recommend it to any fans of historical\nfiction here. The story follows Bagoas, a eunuch gifted as a servant to\nAlexander the Great not long after his great victory over Darius of Persia.\nBagoas is a real historical person who gets only occasional mention in…",
  "data/reddit-books/r/books/comments/o9lfwq/is_there_a_way_to_avoid_books_about_suicide.json": "I'm wondering if anyone knows a resource that identifies books that feature\nsuicide. Last night I was reading a book and a character unexpectedly killed\nthemself, and the personal repercussions of reading that kept me up for most of\nthe night.\n\nPlease note, this is NOT saying that books which…",
  "data/reddit-books/r/books/comments/o9mx7w/ive_finished_reading_the_amazing_adventures_of.json": "Like the title says, it's an amazing feeling to go back and thoroughly re-read a\nfavorite book of mine, The Amazing Adventures of Kavalier and Clay. Especially\nthe second time around I'm now older and seeing for the first time all these\nlittle details and foreshadowing throughout the book I've…",
  "data/reddit-books/r/books/comments/o9n3ed/hiya_im_douglas_stuart_author_of_shuggie_bain.json": "I am a Scottish-American author and screenwriter. My debut novel, Shuggie Bain,\nwon the 2020 Booker Prize and was a finalist for the National Book Award,\nPEN/Hemingway Award, as well as several other literary awards. Shuggie Bain won\nthe Sue Kaufman Prize from the American Academy of Arts and…",
  "data/reddit-books/r/books/comments/o9oww2/how_fast_can_a_books_bad_writing_turn_you_off.json": "Without needing to go into detail (unless you want to) how quickly can an author\nalienate you? And I’m not talking about content, I mean in terms of the actual\ncraft of writing. In the last two weeks I’ve been done with two different books\nwithin three pages because of the writing ability of the…",
  "data/reddit-books/r/books/comments/o9qblz/unpopular_opinion_people_are_too_harsh_on_ya.json": "When you pick up a YA book, then it's going to be YA, right? It's marketed to\nyoung adults and usually centered around them in terms of plot. The themes won't\nbe too deep beyond \"good vs evil\" or \"forbidden love\" and tropes and so on.\nThat's because it won't hold the attention of the average teen if…",
  "data/reddit-books/r/books/comments/o9s9fk/do_you_guys_sometimes_just_not_feel_ready_to_move.json": "I just finished reading this collection of short stories, and I was thinking it\nwould be a good time to move on to another book. But I just keep thinking about\nrereading them again, or at least just browsing a few select pages, maybe just\nlooking at the chapter titles I dunno.\n\nI just wish there…",
  "data/reddit-books/r/books/comments/o9uoh0/just_finished_the_stranger_by_camus_what_did_i.json": "I just read The Stranger, and I found the main character to be a sociopath whose\nonly redeeming quality was honesty, and Meursault even abused that at times,\nbeing bluntly honest in ways that gained him nothing but hurt others.\n\nI felt as though some of the points being made during the trial were…",
  "data/reddit-books/r/books/comments/o9y0aj/a_mighty_fine_series_artemis_fowl.json": "While not the best books in the world, the Artemis Fowl series is among my Top\n10 favorite reads. I would strongly recommend it if you want to feel like a kid\nagain. It is somewhere in the middle of a kids fairy tale book, and an adult's\nfiction novel.\n\nWritten by Eoin Colfer (I don't know how to…",
  "data/reddit-books/r/books/comments/oa0qtv/is_there_anything_in_book_that_makes_it.json": "I was looking through my read shelf on Goodreads and found a pattern with all of\nmy one star rated books. I’ve always had a strong sense of justice and anytime a\ncharacter does something awful and receives no consequences/ gets exactly what\nthey wanted anyway, it ruins the entire book for me. Is…",
  "data/reddit-books/r/books/comments/oa7rjp/neil_gaimans_omission_of_jesus_in_american_gods.json": "When 'American Gods' was first recommended to me, I was told it was a cultural\nwar. The sides waging war being the idols we used to worship vs the idols we\nactually worship now. Maybe in an effort to save me from spoilers they never\nmentioned that the gods in question would be lesser known Gods. In…",
  "data/reddit-books/r/books/comments/oacu01/i_cant_believe_i_fell_for_it.json": "I just finished reading The Princess Bride. I've never seen the movie, but I\nknew enough about it from pop culture references to know the famous lines like,\n\"Inconceivable,\" or \"Hello. My name is Inigo Montoya. You killed my father.\nPrepare to die,\" but I didn't really know anything about the…",
  "data/reddit-books/r/books/comments/oaejit/giovannis_room_james_baldwin_one_of_the_best_love.json": "This is the first work of fiction from James Baldwin that I've read and I was\nvery impressed with its restraint and emotional power. It tells the story of a\nyoung American named David who lives aimlessly in Paris among the clientele of a\nlocal gay bar. David develops a general loathing of everyone…",
  "data/reddit-books/r/books/comments/oaipcr/book_podcasts.json": "Hi everyone! I posted on here over a month ago trying to find some good book\npodcast recommendations and you all did not disappoint! I wanted to share some\nof my favorites that I’ve been listening to and hear about your favorites too!\n\nMarlon and Jake Read Dead People—The booker prize award winning…",
  "data/reddit-books/r/books/comments/oaozg7/she_released_a_breath_she_didnt_realise_she_was.json": "EDIT (final thoughts): There are some great explanations in the comments. It\nseems most people don't like this phrase because it is a cliche. Personally,\neven though it is a cliche, it gets the job done. And if an author can recreate\nthe same feeling or visualization as this phrase in a more…",
  "data/reddit-books/r/books/comments/oatgxg/my_fiancé_hates_this_book_so_much_he_burned_it.json": "Back a while ago he and his class were asked to read it for an assignment.\n\nHe loves books, he practically hoards them, but this book he hated so much that\nhe consigned it to fire.\n\nEnduring Love by Ian McEwan.\n\nHe called it the longest narrative of pointless drivel and thinks it best used\nin…",
  "data/reddit-books/r/books/comments/oawoxa/im_currently_reading_where_the_crawdads_sing_and.json": "I'm only on chapter 9 and I already feel like I personally know all the\ncharacters, Kya especially. And don't get me started on the description of the\nmarsh and surrounding area... beautiful.\n\n\n\nIf you have read or are currently reading \"Where The Crawdads Sing\", what are\nyour thoughts on it?",
  "data/reddit-books/r/books/comments/ob0clt/i_am_neither_neil_gaiman_nor_andy_weir_nor_anyone.json": "As you might get from the title, I've got some severe imposter syndrome lately,\nin particular doing an AMA here on r/books [/r/books]. I made the mistake of\nlooking at the 'all time' upvoted list before doing this and saw my heroes like\nGaiman, Weir, Sanderson, Atwood, Lawrence and Lois f**king…",
  "data/reddit-books/r/books/comments/ob318o/why_do_schools_still_put_go_ask_alice_in_their.json": "When I was in school I was forced to read Go ask Alice by Beatrice Sparks for\nenglish class. It was introduced as a real diary and true story, exactly the way\nit was marketed. When I started reading I noticed the scenarios were unrealistic\nso a quick google search led me to figuring out it was…",
  "data/reddit-books/r/booksuggestions/comments/npg4ur/looking_for_vampire_books_where_the_vamps_are.json": "I'm not looking for porn in book form, or for vampires who're dark,\nmisunderstood, tragic souls. I'm looking for vampires that'll tear out your\nthroat while laughing for no other reasons than thirst and sadistic pleasure,\nthe kind that make children tightly cover themselves up to the neck at night…",
  "data/reddit-books/r/booksuggestions/comments/nps13l/looking_for_some_hard_scifi.json": "I have never read any hard sci-fi books, but I want to try one. I love cyberpunk\nand human abysses. Stories Like ghost in the shell\n\nEdit: thank you all for those good ideas",
  "data/reddit-books/r/booksuggestions/comments/nq6yr7/finished_reading_the_song_of_achilles_need_more.json": "Any other mythology works too. It's just that I've been a fan of of Percy\nJackson when I was younger, and now suddenly I came across TSoA and really liked\nit. Genuine books about the Greek mythology would be appreciated too. Thanks!",
  "data/reddit-books/r/booksuggestions/comments/nqjysw/books_to_learn_smalltalk_for_socially_inept_people.json": "basically, i just started a job that entails lots and lots of small talk to\npeople. i love the job, but can be somewhat inept especially in terms of\nsmalltalk. is there any good book specifically for learning smalltalk?",
  "data/reddit-books/r/booksuggestions/comments/nrcsih/middle_school_teacher_here_good_horror_books_for.json": "They loved \"The thief of always\", but I'm at a loss with other ideas for horror\nbooks. I've got a couple of short story collections but I'd also like a novel.\nAny ideas?",
  "data/reddit-books/r/booksuggestions/comments/nrnghw/help_me_get_out_of_this_reading_stand_still.json": "I’m 17 and I’ve loved reading my whole life. I used to love YA series like the\nHunger Games, Maze Runner, Cinder, Divergent, etc but in the last couple years I\nkind of grown out of them. No hate towards YA, it can be enjoyed by any age or\nreading level. I just feel that I’ve read so many of them…",
  "data/reddit-books/r/booksuggestions/comments/ns7dha/the_invisible_life_of_addie_larue.json": "I’ve seen a lot of mixed reviews on this book. For those that didn’t enjoy it,\nwhy didn’t you and what books would you recommend instead?",
  "data/reddit-books/r/booksuggestions/comments/ntax49/books_where_everything_is_not_what_it_seems.json": "i'm looking for a book where the main character is slowly becoming self-aware of\ntheir environment. something like the truman show or wandavision in the sense\nthat everyone else is acting weird and definitely hiding something. maybe even\nsomething like the lottery where what they're doing seems…",
  "data/reddit-books/r/booksuggestions/comments/ntm7bw/books_that_teach_you_to_think_like_a_therapist.json": "If I ever try to help a friend, I want to make sure that I know how to help\nhim/her instead of just saying what I think would help. There is obviously a lot\nof education that a therapist would have, so I don't think I can try to replace\nthat by reading some books. I'm not looking for a self-help…",
  "data/reddit-books/r/booksuggestions/comments/nu870l/books_about_male_friendships.json": "I really struggle finding books solely focusing on male friendships, so any\nrecommendations will be helpful. Thank you! (Apart from A Little Life and the\nThe Kite Runner).",
  "data/reddit-books/r/booksuggestions/comments/nuk71j/looking_for_a_book_that_has_a_crazy_amount_of.json": "Can you guys recommend me a book that’s extremely suspenseful and that will also\nkeep me on my toes. I don’t really care if it’s a thriller or not, just need a\nbook that I won’t be able to put down.",
  "data/reddit-books/r/booksuggestions/comments/nv7v3r/fiction_or_nonfiction_about_indigenous_peoples.json": "I've picked up 1491, but I'm looking for some other titles about Indigenous\npeoples. Bonus points for books about Indigenous Canadians.",
  "data/reddit-books/r/booksuggestions/comments/nvt3zm/narnia_series.json": "Is Narnia series worth reading for an adult? Or will I find it too kiddish or\noutdated? P.S - I am 24 btw.",
  "data/reddit-books/r/booksuggestions/comments/nvt402/lm_montgomery_anne_of_green_gables_etc_but_for.json": "Hello! I really like LMM’s books for young adults, and recently read and LOVED\none of her two adult books, {{The Blue Castle}}. Now I’m on the hunt for similar\nreads. If anyone has any recs, I’d be very grateful!\n\nNon-contemporary settings preferred; doesn’t have to be set in Canada; I’d love\nfor it…",
  "data/reddit-books/r/booksuggestions/comments/nw13uw/a_book_where_characters_discover_themselves_in.json": "Hey all, so here a personal note: I am 25 years old and work in tech industry. I\nchoose this industry because it pays well and I had/have no idea what I wanted\nto do in life. Lately the books I've been reading have mostly been depressing\nfor me. Example, I read Sadie where the character are in…",
  "data/reddit-books/r/booksuggestions/comments/nwg0kb/most_shocking_nonfiction_novels.json": "By shocking, I mean disturbing or almost unbelievable content that makes you\nthink. An example of the last book I read was “The Hot Zone” by Richard Preston.\n\nLooking for autobiographies, true crime, or just any book that really makes you\nthink.\n\nThank you!",
  "data/reddit-books/r/booksuggestions/comments/nwopbx/any_good_laymenlike_books_on_climate_change_that.json": "Hello,\n\nI'm looking for good non-fiction books that, yes, outline the (upsetting\nperhaps) facts about climate change, but instead of presenting it\npessimistically, provides solutions that people are working on, or what *can* be\ndone?\n\nFor example, someone told me \"The Uninhabitable Earth\" by David…",
  "data/reddit-books/r/booksuggestions/comments/nwtjc3/gone_girl.json": "Is 'Gone Girl' worth reading if I have already watched the movie?",
  "data/reddit-books/r/booksuggestions/comments/nwx5na/new_to_stephen_king.json": "So I’m a big reader but never given SK a chance, until last month when I read\nLater followed by Revival and absolutely blew me away on both accounts.\n\nCan you suggest me a book that has a coming of age but mystery twist to it,\nhappy to jump into more King stories but his back catalogue intimidates…",
  "data/reddit-books/r/booksuggestions/comments/nx0ccg/books_by_garciamarquez_or_authors_with_a_similar.json": "I'm in the middle of The Autumn of the Patriarch and it's written so\nbeautifully, but it's also one of the most gruesome things I've ever read and\nit's not mixing well with the wave of depression I'm experiencing. Can anyone\npoint me towards something that's written with a similar semi-surrealist…",
  "data/reddit-books/r/booksuggestions/comments/nx6wy2/book_about_a_mother_and_daughter_similar_to.json": "Tldr; Brave could've been better and I'm trying to fill that gap.\n\nI love the movie Brave. However I recently found out that the movie was\noriginally based on the original director's, Brenda Chapman, relationship with\nher own daughter and until she was fired for \"creative differences.\" The movie\nwas…",
  "data/reddit-books/r/booksuggestions/comments/nxcian/looking_for_books_with_some_mind_games_and.json": "I'm not sure what genre it was called (suspense?), but I would love to find out\nmore books that have that same kinda feeling when u are reading it 😄\n\nBesides, are they any good intros to detective mystery genre? Or basically any\nbest entry to mystery genre 😂 as I do not have much exposure to any…",
  "data/reddit-books/r/booksuggestions/comments/nyeio2/please_help_me_find_a_new_series_for_my_dad_to.json": "My dad ((who turns 60 in August)) loves to read and he constantly has his kobo\nout and takes it places with him often. I’ve recently found out though that he\njust rereads the same few books and series over and over again because he has\ntrouble searching online to find new books he has interest in.…",
  "data/reddit-books/r/booksuggestions/comments/nyusxj/can_you_guys_suggest_me_books_full_of_positive.json": "Themes like childhood imagination, pure innocence, memories, getting excited\nlooking at everything once we had and all",
  "data/reddit-books/r/booksuggestions/comments/nz2370/books_like_hitchhikers_guide_dirk_gently_disc.json": "So, I've ready basically everything by D.A. And T. P. But most recently I\nfinished a long marathon of Stephen King and Chuck Palahniuk (very bleak), and I\nneed something fun and light to pull out of a bit of a personal downward spiral.\nI love all of these books are irreverent, and I want something…",
  "data/reddit-books/r/booksuggestions/comments/nzdty5/can_you_suggest_me_a_pageturner_to_knock_me_out.json": "Hi all,\n\nThough usually an avid reader, I’ve been in a funk for a few months and the last\nfew books I’ve tried to pick up just haven’t grabbed me.\n\nI’m really craving a non-formulaic thriller, hopefully one with a mystery that\nwill hook me. But I’m hoping for something outside of “the next Gone…",
  "data/reddit-books/r/booksuggestions/comments/nzk9cj/asian_titles_with_interesting_plot_any_genre_will.json": "Hello book community! I want to buy more Asian titles this year. Well, asian or\nnon-asian authors are pretty cool. I just like to read more and collect from\nthat genre/type.\n\nSome book recommendations from Asian authors you can read:\n\n 1. Pachinko - Min Jin Lee\n 2. Miracle Creek - Angie Kim\n 3.…",
  "data/reddit-books/r/booksuggestions/comments/nzl2se/should_i_read_masterpieces_if_im_new_to_reading.json": "Hi all. I recently started getting into reading but I struggle to keep my focus\nand it takes me a while to finish a book. I don't feel as interested in a book\nas I think I should. Bc of this I was thinking of reading what people would\nconsider some of the best literature such as don quixote (or so…",
  "data/reddit-books/r/booksuggestions/comments/nzpmhs/why_is_every_enemiestolovers_book_stupid_compared.json": "I'm a lifelong Pride & Prejudice fan, but I only recently found out that\n\"enemies to lovers\" is a really common trope in romance novels.\n\nObviously I was delighted, because I thought that I was sure to discover a\nwonderland of never-ending entertainment.\n\nBut after googling lists of “best enemies to…",
  "data/reddit-books/r/booksuggestions/comments/nzvg08/thanks_all.json": "Just a quick note to say that since joining this subreddit the quality of my\nreading list has greatly improved, and because of that so has my pleasure in\nreading. I've gotten some wonderful suggestions from my own request and as well\nas looking at other's requests. This is a good group. For all of…",
  "data/reddit-books/r/booksuggestions/comments/o0cyt2/books_on_palestine.json": "Hello community, I am looking for books that cover the historical context behind\nwhat is happening in Palestine as well as what happened more recently. Thanks in\nadvance!",
  "data/reddit-books/r/booksuggestions/comments/o0kv5h/i_would_like_to_have_a_basic_knowledge_of_trees.json": "A passing understanding, not looking to go deep into nature right now.\n\nI moved to the PNW a little over a year ago, and it's gorgeous, filled with\nforests and so much beauty. I would like to know the names of the tree species\nand flowers as I take my mini-hikes. I love rocks too.\n\nI don't have time…",
  "data/reddit-books/r/booksuggestions/comments/o0v8k7/anyone_just_really_sad_that_we_will_never_be_able.json": "i am just sad.",
  "data/reddit-books/r/booksuggestions/comments/o1cum2/looking_for_books_like_interstellar_and_gravity.json": "I’m new to the sci fi genre and am looking for some suspenseful sci fi books set\nin space that have thriller or horror elements. Preferably without any romantic\nsubplots.",
  "data/reddit-books/r/booksuggestions/comments/o1gs82/what_book_do_you_wish_everyone_would_read.json": "I belong to an extremely small book club (literally just two of us) and we are\nlooking for a book that is out of what we usually gravitate towards, which is\nfantasy. We've tried to vary the books we read somewhat. So far we've read:\n\nWay of Kings, Sanderson (5/5)\n\nAmerican Gods, Gaiman (2/5)\n\nSword…",
  "data/reddit-books/r/booksuggestions/comments/o1xik6/help_my_find_a_punishment_book.json": "I co-host a weekly book podcast that we've been doing since 2017 and I'm looking\nfor a very specific kind of book. Normally we read classics, bestsellers, etc\nbut for our Christmas episode we buy each other a special book. We try to find a\nbook to punish the other guys with. Christmastime is special…",
  "data/reddit-books/r/booksuggestions/comments/o268a9/most_disturbing_horror_books.json": "What are some of the most disturbing horror stories out there. I'm looking for\nbooks that are nightmare inducing, but aren't Stephen King books. Thanks to\nanyone who has suggestions.",
  "data/reddit-books/r/booksuggestions/comments/o2ota3/what_are_the_best_books_on_self_help_self.json": "I’m a really anxious, lazy person who’d like to be more confident, less reliant\non social media and more productive. I want to live a more meaningful life now\nthat I’m in my 20s. I want to drink less, etc. Do you have any literature\nrecommendations that could influence me positively ?\n\nThanks!",
  "data/reddit-books/r/booksuggestions/comments/o34oic/looking_for_a_victorian_mystery_but_more_risqué.json": "I loved Sherlock and I’m interested in some moody, mystery, Victorian themed\nlit, I don’t mind if it’s a little more risqué than Doyle’s writing. It’s\nraining here and I think this would fit perfectly. Merci!",
  "data/reddit-books/r/booksuggestions/comments/o39cni/looking_for_a_book_like_shutter_island.json": "Something that is interesting and fast paced with a gripping story line and\nmassive plot twist",
  "data/reddit-books/r/booksuggestions/comments/o3e1n9/the_martian.json": "I'm so excited to FINALLY be starting this one!! Anyone who knows me knows that\nI'm obsessed with space and NASA and will stay up until 3am to watch a rocket\nlaunch or ISS space walk. And I desperately miss my tv husband, Gordo Stevens,\nso this will be a welcome distraction\n\nSYNOPSIS: Six days ago,…",
  "data/reddit-books/r/booksuggestions/comments/o3eng0/looking_for_a_novel_based_in_poland_that_embodies.json": "Hi, would love to read a novel that’s set in modern day Poland that I can really\nget an understanding of Polish culture and mentality. Would respect appreciate\nit if anyone has any recommendations.",
  "data/reddit-books/r/booksuggestions/comments/o3l34n/recommendations_on_books_written_about_postwwii.json": "Seeking recommendations on books pertaining to Japanese history immediately\nfollowing the conclusion of the Second World War. Such as re-construction, role\nin the Cold War, political climate, etc.",
  "data/reddit-books/r/booksuggestions/comments/o3l6xk/a_great_scifi_book_for_beginners.json": "Hello everyone, I'm searching for a great sci-fi that will be easily readable\nand not too complicated to understand. I've tried \"Neuromancer\" from William\nGibson but it was really difficult to understand what was happening with all\nthese strange names of the future. I'm searching either like a…",
  "data/reddit-books/r/booksuggestions/comments/o3vcbv/any_history_of_the_flow_of_wealth_over_the.json": "I'm looking for answers to questions like, What happened to Roman wealth after\nthe empire fell? What happened to all that Aztec gold? What corrupting\ninfluences did big wealth have centuries ago?",
  "data/reddit-books/r/booksuggestions/comments/o46sgi/my_favorite_book_of_all_time_is_eleanor_and_park.json": "Ive read this book a million times, I love the story and the characters - any\nsuggestions to something similar to this book?",
  "data/reddit-books/r/booksuggestions/comments/o472sv/project_gutenberg.json": "So Project Gutenberg is a free site that provides you with free ebooks, novels\nwithout any such costing! Doesn't require any fee or registration either! You\ncan either download or read online. Have any of you considered reading from\ntheir site?",
  "data/reddit-books/r/booksuggestions/comments/o4g6be/books_that_give_a_peak_behind_the_curtain_of_an.json": "I love anything that shows what an industry or group of powerful people is like\nbehind the scenes. Can be fiction or non fiction!",
  "data/reddit-books/r/booksuggestions/comments/o4n0b5/my_first_love_began_and_ended_during_the_pandemic.json": "My life changed overnight - twice. I found my person and I blew it. Once in a\nlifetime chances are real. Would appreciate suggestions on what books were\nmeaningful to you during such a loss. This is so fucking hard, I don’t see an\nend to it",
  "data/reddit-books/r/booksuggestions/comments/o4r0dx/books_that_make_you_feel_happy_and_adventurous.json": "I'm going through a very tough breakup after a toxic relationship. Enough tears\nhave been shed, now I want to find that spark back and enjoy life again.\n\nI prefer books without romance but if it's a small subplot it's ok. Please help\nme out!",
  "data/reddit-books/r/booksuggestions/comments/o4zjlx/need_impossible_to_put_down_books_for_an_upcoming.json": "I've been on here reading many suggestions from others and now I would love some\nsuggestions from ya'll. I'm going on vacation in a week and I want to get lost\nin books that I will not be able to put down; any genre, but something well-\nwritten (not cheap quick writing) fast-paced and possibly mind…",
  "data/reddit-books/r/booksuggestions/comments/o5jhje/funniest_book_youve_ever_read.json": "What is the funniest book you have read? Please provide a line of plot summary\nwith no spoilers. Thanks!",
  "data/reddit-books/r/booksuggestions/comments/o5l1gx/books_about_mythology_and_tales.json": "Hi All!\n\nI'm looking for books about Arabian mythology. I have already read \"One thousand\nand one nights\", so if you have any recommandations, I will be happy to take a\nlook :)\n\nI am also interested in other kinds of mythologies - Chinese, Japanese or\nNordic.",
  "data/reddit-books/r/booksuggestions/comments/o5t990/are_there_any_good_nonfiction_books_on_the.json": "Something about their history, their culture, practices, etc!",
  "data/reddit-books/r/booksuggestions/comments/o5xywq/suggestions_for_90_year_old_refuses_audio_and.json": "Primarily looking for mystery fiction. She finds \"cozies\" of any stripe insipid.\nOn the other end, can't be too dark/brutal/sexual. No vampires, paranormal,\nsci-fi, or straight-up romance. Nothing historical before 1830's. She really\nliked News of the World, which led to Elmer Kelton, which she also…",
  "data/reddit-books/r/booksuggestions/comments/o60zhs/after_piranesi.json": "I received Piranesi for my birthday earlier this year and knew nothing about it.\nThis book blew me away. I now see it recommended on this sub and it always gets\nlots of love. So my question is, for those of you who loved Piranesi, what else\nhas been on your top three list this year?",
  "data/reddit-books/r/booksuggestions/comments/o63moe/irish_mythology.json": "I am looking for a book about Irish Mythology that is as accessible as \"Norse\nMythology\" by Neil Gaiman. Maybe something that breaks down the four cycles into\ndetail. Any suggestions are welcome.",
  "data/reddit-books/r/booksuggestions/comments/o69u95/essential_fun_books.json": "Ok, I want a book that’s fun to read. I have just come to a realization that\nI’ve spent most of my life reading books that have received critical acclaim,\nbooks that are “must reads” and books that I wanted to be able to say I read. I\nhave since realized that I just want to enjoy reading, and I’m…",
  "data/reddit-books/r/booksuggestions/comments/o6e7xy/what_did_you_read_and_love_because_it_was.json": "I come here almost every day -- and I sometimes wonder if lots of us take the\nsuggestions we all offer one another, and how they work out for the readers --\nso, tell us... what super books, what great reading experiences did you have\nbecause someone on this sub suggested it? What was the book or…",
  "data/reddit-books/r/booksuggestions/comments/o6p9if/anyone_know_any_good_scifi_andor_dystopian_books.json": "i want a book that really makes u think about life/humanity that has sci-fi\nthemes because that stuff is cool. im also looking for a book that will leave me\nfeeling very empty when i finish it and be stuck on my mind long after i finish",
  "data/reddit-books/r/booksuggestions/comments/o71jcj/favorite_audiobooks_based_on_both_book_quality.json": "I have 8 Audible book credits to use before canceling my account, which I would\nlike to do before my next credit hits on 7/1. So, I need to pick 8 books ASAP.\nI’ve found some great books are ruined by a bad narrator, and some mediocre ones\nshine with the right talent. What are the best books you…",
  "data/reddit-books/r/booksuggestions/comments/o74wdv/classics_that_arent_too_difficult_to_read.json": "pls i am too small brained to absorb a lot of the must read classics but i\nreally wanna get into reading some. any suggestions?\n\nEDIT: thanks for the suggestions so far!! to add, some genres i really like are\nfiction, historical fiction, fantasy, thriller, a good mystery, and anything\nthat gets this…",
  "data/reddit-books/r/booksuggestions/comments/o7eapz/is_the_girl_who_played_with_fire_and_the_girl_who.json": "I watched David Fincher's one!\n\nWill I be able to understand both of them? Or should I read all the 3 books.",
  "data/reddit-books/r/booksuggestions/comments/o7kejq/i_want_to_thank_this_sub.json": "So, right off the bat I need to be honest and mention that I had not read a\nnovel in 15 years until March of this year. Something changed during the\nlockdown and a spark ignited within me for change so I became a member of this\nsubreddit. I need to thank all the people who contributed and posted…",
  "data/reddit-books/r/booksuggestions/comments/o83ulz/what_is_a_book_that_is_frequently_suggested_here.json": "I have an ongoing list of books I see suggested here a lot because I want to\nread them all, and so many have been great!\n\nBut sadly, I am reading “Circe” by Madeline Miller and I just can’t get into it!\nI have gotten through over half the book and I just don’t feel connected or\ncaptivated, which…",
  "data/reddit-books/r/booksuggestions/comments/o8fx8b/which_book_have_you_read_more_than_once_and_has.json": "Hey guys,\n\nI have been struggling to find a good book to fill in the time during the\nsummer. And after re-reading some of my favorite books, I was wondering if any\nof you has a story, which you always go to. What is this book that gives you\nthis amazing insatiable feeling of happiness and love…",
  "data/reddit-books/r/booksuggestions/comments/o8jbok/the_secret_history.json": "I just finished the Secret History by Donna Tartte and LOVED it. (Side Note: I’m\nactually going to Bennington College which is the college that Hamden College is\nbased on and where Tartte studied) anyways I have read her other books but I\nwasn’t a huge fan. Does anyone have any suggestions for books…",
  "data/reddit-books/r/booksuggestions/comments/o8mdiq/are_stephen_king_books_that_scary.json": "I've never read one of his books because I generally don't like gore or very\nscary stuff. I do enjoy thrillers with some scary elements though. What end of\nthe scary spectrum would you place Stephen King's books? From 1-10 how scary and\nlikely to give me nightmares are they?",
  "data/reddit-books/r/booksuggestions/comments/o8svbs/is_the_house_in_the_cerulean_sea_worth_reading.json": "I have grown up reading Harry Potter several times..\n\nWill I be enchanted in the same manner by this book?",
  "data/reddit-books/r/booksuggestions/comments/o8yorg/is_the_hobbit_worth_reading_as_a_stand_alone.json": "So, I tried to read 'The Lord Of The Rings' 2 years ago, but couldn't get into\nit..\n\nHave heard that 'The Hobbit' is a great cozy read..So should I go for it? Or\nshould I give Lord of the rings trilogy one more chance?",
  "data/reddit-books/r/booksuggestions/comments/o9hcr7/my_partner_has_ptsd_and_depression_i_need_a_book.json": "Hello my partner has ptsd from childhood and depression, nothing worked out in\nher life and she had a lot of family problems so she has a lot of trauma and I'm\nlooking for a book to understand her better, and what should i avoid saying\nbecause i know i have to be careful around her she's sensitive…",
  "data/reddit-books/r/booksuggestions/comments/oa0f7o/best_fantasy_books_that_can_give_me_a_cozy.json": "I have read Harry Potter countless number of times...\n\nI love the cozy feelings that are there in the books such as the descriptions of\nsnow fall, Christmas, The Burrow etc etc...\n\nWow!! Even mentioning all this gave me a cozy feel\n\nAny recommendations?\n\nP.S - Not just Fantasy, any genre!:-)",
  "data/reddit-books/r/booksuggestions/comments/oab5b7/a_inexperienced_fantasy_reader_at_23_looking_for.json": "Hi, so Id be lying If I said exactly what Im looking for but Ive read a few of\nthe most common ones, but had little success branching out of that. So I guess\nIm asking you all more experienced readers for some advice. I know Im looking\nfor some good fantasy though, preferably High fantasy though I…",
  "data/reddit-books/r/booksuggestions/comments/oai09y/so_my_wife_received_this_for_an_upcoming_bridal.json": "A simple request from the bride to be whose favorite thing to do is read: bring\na book for my collection, new or used, it is your selection. Psych thrillers,\nromance, true crime are a few genres I read in spare time. Please abide my wish\ninstead of a gift.",
  "data/reddit-books/r/booksuggestions/comments/oatatj/book_recs_with_a_young_woman_character_with.json": "A friend of mine who is a young woman has recently learnt that she has autism. I\nsometimes find it difficult to understand how she thinks, which leads to\nmisunderstandings between us. So I'd like to read a fiction novel that allows me\nto gain insight to living with asperger's.\n\nI am aware that…",
  "data/reddit-books/r/booksuggestions/comments/ob1wyp/im_a_somewhat_sheltered_lowermiddle_class.json": "I’m currently reading “between the world and me” be Ta-Nehisi Coates, and it’s\npersonalized experiences very different from my own, and it’s encouraged me to\nconfront some of my own sheltered notions.\n\nI recently read “where do we go from here: chaos or community?” By Martin Luther\nKing, and that…"
}