{
  "data/reddit-projects/r/SideProject/comments/ufzm33/discord_bot_paneldashboard_dbp.json": "I made this small project that I wanted to share with you guys.\n\nhttps://github.com/jareer12/DiscordBotPanel",
  "data/reddit-projects/r/SideProject/comments/ugpmhg/i_built_gitlog_easily_search_your_github_commit.json": "I was working on another side project and hit a bug that I had thought I fixed\nso went to GitHub to search through the commit messages to search for certain\nkeywords I think I would have used but to my surprise found GitHub doesn't\nsupport it.\n\nI therefore built GitLog over the course of a few…",
  "data/reddit-projects/r/SideProject/comments/uh0eoj/digicivicom_resume_builder_with_automatic.json": "Hi everyone,\n\nI want to show you my ideas and startup.\n\nDigicivi.com [https://digicivi.com/] — the world's fastest resume builder with\nautomatic translations for every official language spoken in the countries of\nthe European Union.\n\nDigicivi.com [https://digicivi.com/] team has developed a…",
  "data/reddit-projects/r/SideProject/comments/ugk1c5/xdox_a_better_way_to_keep_track_of_your_challenges.json": "Hey everyone,\n\nToday I am launching XdoX, an application that lets you start challenges, log\nyour progress and share it with the world, on Producthunt.\n\nWould love to hear what the community says!\n\nProducthunt link - https://www.producthunt.com/posts/xdox",
  "data/reddit-projects/r/SideProject/comments/ugxm18/my_side_art_project_inspired_by_the_movie.json": "Hey everyone!\n\nI made a fun side project after seeing the (incredible) film \"Everything\nEverywhere All At Once\".\n\nI'd love to hear your thoughts on different UX strategies I can employ to make\npeople's eyes line up better. 👀\n\nhttps://everyoneeverywhereallatonce.com/",
  "data/reddit-projects/r/SideProject/comments/uhm83d/for_those_who_like_magic_the_gathering_and_want.json": "Similar to the stock market I've created a Telegram bot that sends notifications\nfor the cards that have had price spikes. You can try the bot for free, just add\nit using this username: mtg_price_alert_bot.\n\nAll feedback is valid. Let me know what you think.\n\nCheers!",
  "data/reddit-projects/r/SideProject/comments/uhmb53/prepform_an_ai_tutor_to_help_students_learn_more.json": "Prepform [https://prepform.com/] uses machine learning and spaced-repetition to\nshow students what to study, how long to study, and when they've mastered a\nconcept.\n\nIt's free to use without signing up, and I would love to hear your feedback!",
  "data/reddit-projects/r/SideProject/comments/uhn3le/gamechanger_feature_for_anyone_who_has_trouble.json": "I just launched a new feature to make it easy to both design AND write a resume.\n\nYou can try it here: https://www.resumemaker.online/\n\nThe truth is that a well-designed resume can help you stand out, but if the\ncontent is badly written, it is difficult to compensate with an attractive,\nwell…",
  "data/reddit-projects/r/SideProject/comments/uidbic/streamerhunt_discover_your_next_favorite_streamer.json": "Disclaimer\n\nRight now you are in front of an MVP with a 99,99% improvement margin.\n\nWhat is\n\nif you know producthunt, you already know what Streamerhunt\n[https://www.streamerhunt.com] is.\n\notherwise:\n\n * product hunt: users submit products, which are listed in a linear format by\n   day. Each day…",
  "data/reddit-projects/r/SideProject/comments/uiuczf/the_new_compreface_10_version_release.json": "If you are using Compreface, a free open-source facial recognition solution, it\nhas some new useful updates in the new version. It allows now to manage subjects\nand images collections without any scripts or code, now you can also test\nCompreFace REST endpoints right away with predefined methods,…",
  "data/reddit-projects/r/SideProject/comments/ujhr2p/i_created_a_baby_name_generator_backed_by_data.json": "The baby name generator [https://www.sleeplessparent.com/baby-names/generator]\nfinds you the best baby boy / girl name based on the name's gender, popularity,\nlength and category.\n\nAlready scaled this project from English to Spanish, Swedish and even Hebrew..\n\nYou can then share the names you like…",
  "data/reddit-projects/r/SideProject/comments/uko280/i_made_an_anime_search_engine.json": "You can check it out here\n\nAnime Info Platform [https://anime-info-platform.vercel.app/]\n\nStarted web development not too long ago, I'm curious about what people think\nand where I can improve\n\nlink to repo here: Github Repo | Anime Info Platform\n[https://github.com/Mini-Sylar/Anime-Info-Platform]",
  "data/reddit-projects/r/SideProject/comments/uln5ep/acquired_stridist_from_microacquire_added_700.json": "We acquired Stridist.com [http://stridist.com/] in Nov 2021 after finding it\nlisted on MicroAcquire. At the time it had 31 users\n\nNow at 724\n\nStridist is an online coaching software for training and nutrition professionals\nwho love their clients\n\nClient programming, communication and tracking in…",
  "data/reddit-projects/r/SideProject/comments/um6f0d/create_a_tool_to_help_manage_huge_spreadsheets.json": "https://www.matrixease.com\n\nAutomatic Visualization and Categorization of matrix data allowing a you to\ninteractively recognize important relationships and filter data to further\nidentify meaningful insights. Builds detailed metrics on data.",
  "data/reddit-projects/r/SideProject/comments/umeebq/have_you_found_any_of_the_side_projects_here_so.json": "I always wonder if any of the many projects that people post here ever take off.\nYou often see makers post success stories or Product Hunt launches, never to be\nheard from again. So if you found someone else's project useful and use it\nregularly, post it here!",
  "data/reddit-projects/r/SideProject/comments/umw954/oc_canva_for_data_analytics_5_minutes_from_data.json": "Hi there,\n\nI would love to introduce Columns [https://columns.ai] to this community.\n\nColumns is a modern BI tool, while many tools stop at visualization and\ndashboard, Columns supports you to bring your creativity (design, storytelling)\nand your network (collaboration, communication). My goal is…",
  "data/reddit-projects/r/SideProject/comments/unqkxk/my_new_side_project_free_twitch_ad_blocker.json": "Hi guys,\n\nI'm a huge Twitch user, but I'm always tormented by pop-up ads, and my partner\nand I were discussing how to make a popular browser extension, so we decided to\nmake a free Twitch ad blocker.\n\nThis browser extension blocks ads by automatically reducing video resolution to\nensure users are…",
  "data/reddit-projects/r/SideProject/comments/untmzy/ive_created_a_lightweight_tool_to_help_new.json": "Over the years I've sat through decision-making meetings where the loudest\nperson often tips the decision in their favor... or where decisions are made by\ngut feelings or soft factors. I often see bias, constraint, and ego get in the\nway while awesome choices get buried... I've been on both ends of…",
  "data/reddit-projects/r/SideProject/comments/uodg09/1_min_music_playlist_app_update.json": "I was doing some class research for a Music Discovery Algorithm project, and I\nfound that people's (Gen Z and Millenials) main complaint is that it takes too\nlong to find new music you love on Spotify (sifting through new playlists).\n\nThis was the core insight that led me to develop a new app to…",
  "data/reddit-projects/r/SideProject/comments/uoou5e/our_team_worked_on_a_new_remote_access_tool_for.json": "DeskIn is developed by group of young, passionate developers saw the gap where\nexisting remote desktop software (RDS) on market failed to deliver what it\nshould. With 4k image quality and 4:4:4 color available, DeskIn requires less\ndependence on local devices as well as internal speed.\n\nThat being…",
  "data/reddit-projects/r/SideProject/comments/uorftp/brevesit_a_service_that_can_help_you_to_avoid.json": "Hi all,\n\nI've written a free service that can help you to avoid uninteresting job\npositions by asking the recruiter to answer your questionnaire.\n\nThe service is completely free.\n\nThe service is available here [https://breves.it/?campaign=redis_side]\nfeedbacks are appreciated :)",
  "data/reddit-projects/r/SideProject/comments/uonof4/dug_nocode_tool_to_structure_and_fluidify.json": "Hi from Belgium,\nI developed the MVP for DUG. Dug is a no-code tool using personalized templates\nto structure and fluidify business interactions.\n\nYou can see a DUG in action here:\nhttps://dugapp.com/dugapp/whatisdug\n\nDUG is a tool that helps structure all kind of purpose-driven…",
  "data/reddit-projects/r/SideProject/comments/uq1gg6/i_present_you_my_biggest_project_yet_pokédexus_an.json": "Hello everyone!\n\nI am really proud to release my biggest project yet which I worked on for the\nlast 2 years, Pokédexus!\n\nPokédexus is a beautiful and free fan-made Pokédex app with lots of unique\nfeatures like catching Pokémon, completing quests, battle against other\ntrainers, climb leaderboards,…",
  "data/reddit-projects/r/SideProject/comments/upuqjy/create_clean_versions_of_spotify_playlists.json": "Hey y'all! My friend and I just created a simple website that allows you to\ncreate clean versions of Spotify playlists automatically. Feel free to lmk of\nany bugs/ways we could improve the site. Thanks!\n\nLink:\n\nhttps://www.cleanerfy.net/",
  "data/reddit-projects/r/SideProject/comments/uqfuht/create_your_own_map_for_the_world_to_see.json": "I developed an app where you can create a map of globally visualized geofences,\nand share it with friends.\n\nCreate a polygon geofence around any place you go, and the app aggregates it\nwith the global dataset.\n\nPlease watch the video here [https://www.placesmainapp.com].\n\nYou can create as many…",
  "data/reddit-projects/r/SideProject/comments/ur2fl2/what_is_your_websites_response_time_in_japan.json": "Hi Everyone,\n\nI would like to share a free tool. It is useful for learning your website's\nresponse time across the world. I hope you find it useful.\n\nTool: https://checker.ddosify.com/\n\nDdosify…",
  "data/reddit-projects/r/SideProject/comments/urar8n/my_story_as_a_freelancer_and_how_i_got_this_new.json": "After many years of freelancing, I realized that the hardest and most\ntime-consuming task is prospecting and lead generation.\n\nOf course there are many tools and strategies to generate leads, but most of\nthem help you generate cold leads that aren't always interested in your services\nas a…",
  "data/reddit-projects/r/SideProject/comments/urjhhs/is_there_any_significant_risk_of_using_a_remote.json": "Remote desktop/remote access software has been around long before COVID, and\nthere are much more than what the name implied. Remote desktop software would\nnot only allow you access a device remotely, you could also transfer files,\nstream contents, even play video games. It also allows you to access…",
  "data/reddit-projects/r/SideProject/comments/urukr9/a_fake_smtp_server_for_integration_testing.json": "I made a fake SMTP server: See what emails your app would send, before you\nrelease to production.\n\nComments and criticism welcome.\n\nhttps://fakemail.stream",
  "data/reddit-projects/r/SideProject/comments/urtvob/ive_developed_an_innovative_solution_named_ai2sql.json": "With AI2sql, engineers and non-engineers can easily write efficient, error-free\nSQL queries without knowing SQL.\nIt's the perfect tool for database engineers and non-engineers to work together.\nMany great opportunities are hidden behind complex queries that take hours to\ncreate. With Al2sql, it…",
  "data/reddit-projects/r/SideProject/comments/us7jmz/i_built_a_website_where_you_can_receive_secret.json": "Hello, I am 19 years old! I am practicing programming in my spare time.\n\nI want you guys to give feedback on my website.\n\n\n\nTry: https://www.confessionally.xyz\n[https://www.confessionally.xyz/message.php?id=d1a2454]",
  "data/reddit-projects/r/SideProject/comments/usenws/music_artist_oriented_wordle_clone.json": "Hi, I'm a big fan of music and I wanted to build something around this interest\nfor so long. Seeing the success Wordle and clones like Actorle had, I finally\nfigured out something that is both motivating and doable for me.\n\nEnter Featurle [https://featurle.com/], a game where you have to guess…",
  "data/reddit-projects/r/SideProject/comments/usm66i/music_shortening_app.json": "Takes a song and shortens it to the \"best\" 10 seconds.\n\nLearns what the \"best\" 10 seconds snippets are to you as you listen more. Uses\ngenre/class/mood/song/weather/chorus/bridge and other factors.\n\nRecommends new music in 10 second snippets to help you discover new media\ncontent faster in a Tik…",
  "data/reddit-projects/r/SideProject/comments/uszic6/i_made_a_list_of_30_google_analytics_alternatives.json": "Hi everyone, I have curated a list of 32 Google Analytics alternatives or\nadd-ons that don't use cookies (with exceptions), don't require consent and\nfocus on privacy. GDPR, CCPA and PECR compliant.\n\nThe list of web analytic tools are sorted by creation year, name or size. Also,\nyou can filter by…",
  "data/reddit-projects/r/SideProject/comments/utobsm/leaddelta_20_launch_on_product_hunt.json": "Hey everyone!!!\n\nToday is a big day for my team and me because we are launching LeadDelta 2.0\nexactly one year after our fists launch. Let's change the perception of the word\n\"Networking\" together.\n\nWe would appreciate the support and feedback of the wonderful Reddit community.\n\nThe link to our…",
  "data/reddit-projects/r/SideProject/comments/uub5bo/this_is_what_i_came_up_with_after_trying_many.json": "Hi,\n\nAfter using many productive apps I decided to create my own combining time,\nhabit and mood tracker. The greatest difference of this app in my opinion is the\nfeature to track time while unlocking the phone.\n\nThe design was built from ground up by me combining some inspirations, I hope\nyou like…",
  "data/reddit-projects/r/SideProject/comments/uufsd8/created_a_platform_for_students_to_get_help_from.json": "I am currently in school and thought that it would be great for other students\nto get help from other students in the same subjects. So I quickly created\nhttps://allouo.com Anyone can sign up for free and either give or receive help.\nLet me know what you guys thing! Any feedback would be great.",
  "data/reddit-projects/r/SideProject/comments/uulzyn/helloinbox_ultimate_email_deliverability.json": "https://helloinbox.email/\n\nhttps://preview.redd.it/ybjvqfx8nt091.png?width=2540&format=png&auto=webp&s=335b47a3e343e3289e85bb6f3bbdbdb9774fb189\n\nHey r/SideProject [/r/SideProject] community 👋\n\nFrustrated with low open rates, I deep dived into email deliverability and\ndiscovered a lot I didn't…",
  "data/reddit-projects/r/SideProject/comments/uuqswv/made_a_bionic_text_converter_after_learning_about.json": "I made a quick, barebones, but no frills bionic text converter after seeing the\npost on popular.\n\nI can't believe they've wrapped something simple like this behind a paid API so\nI created a free tool :)\n\nhttps://www.bionictextconverter.com/",
  "data/reddit-projects/r/SideProject/comments/uvaqy1/i_made_a_free_landing_page_template_specifically.json": "In my 10+ years of career working with paid traffic, I've noticed that landing\npages are one of the best ways to improve conversion rates, but also one of the\nmost complicated. I made a solution to the problem - any digital marketer can\nmake a DIY landing page that's faster and better than any paid…",
  "data/reddit-projects/r/SideProject/comments/uwwssq/whatsapp_conversations_in_different_languages.json": "Hi guys\n\nI'm an ex-pat and I've created a useful little tool to help me with Spanish\nWhatsApp conversations while I learn the language.\n\nUsing the BabelBot [https://www.babelbot.io/] chatbot, everyone writes in their\nlanguage and the chatbot automatically adds translations so…",
  "data/reddit-projects/r/SideProject/comments/uxcbe5/i_made_superdesigner_a_collection_of_design_tools.json": "Hello,\n\nI like to create simple design tools so I created a collection of tools to\ncreate unique designs elements and ended up creating Superdesigner\n[https://superdesigner.co].\n\n\n\nDesign tools in super designer\n\n- Background generator: Create 10+ unique backgrounds\n\n- Pattern generator: Create…",
  "data/reddit-projects/r/SideProject/comments/uxrndh/crazy_story_kinda_but_i_just_got_offered_2mil_for.json": "Hey SideProject fam,\n\nIn 2018 I started a Side Project SaaS company after quitting a high paying sales\njob at Vonage.\n\nIn 2019 I signed up for Stripe.\n\nIn 2022, yesterday more specifically, I got offered $2.3 million to sell it.\n\nIf you are interested, here is how it went down and what I learned…",
  "data/reddit-projects/r/SideProject/comments/uy0k1l/add_upi_donation_option_to_your_website_under_60.json": "Add UPI Donation Option to your website under 60 seconds.\n\nIt's free, and takes less than a minute.\n\nGive Your Supporters a way to say thanks.\n\nCreate A Widget - Create A Link - Create A Button\n\nWe makes it simple and easy for Supporters to scan and pay to you directly via\nUPI.\n\nUrl:…",
  "data/reddit-projects/r/SideProject/comments/uy6da3/the_modern_react_ui_components_float_ui.json": "If you are working as a web developer with a company, just as a freelancer, or\nbuilding your first Start-Up of course you will need something to build your\nwebsites, web apps quickly.\n\nThe React UI libraries like material UI and React Bootstrap built to help others\nto save the time, by building web…",
  "data/reddit-projects/r/SideProject/comments/uygro4/i_made_a_wikipedia_text_formatter_so_you_dont.json": "I made a tool that removes annoying characters and references from Wikipedia\ntexts to make copy-pasting easier. I just made it so I haven't tested it much,\nbut for my needs, it worked…",
  "data/reddit-projects/r/SideProject/comments/uyr9dt/we_build_a_facebook_chatbot_to_maintain_a.json": "Hey Reddit,\n\n\n\nMy friend sometimes has communication problems with his partner when they just\ndon't understand each other and don't know how to behave properly.\n\nSo we did some research and found out that the problem of mutual understanding\nand communication between partners is one of the biggest…",
  "data/reddit-projects/r/SideProject/comments/uywpgp/pine_keep_and_share_memories.json": "I've been working hard lately on my first mobile app, called Pine, so I'm happy\nto show you since it's on AppStore now.\n\nThe idea of the app is easy, we forget tons of important memories, for example:\nDo you remember the best memory you had on your vacation 10 years ago? or Do you\nremember the best…",
  "data/reddit-projects/r/SideProject/comments/uywjbg/i_built_an_alternative_to_hey_for_domains.json": " 1. inbox for your domain\n 2. blog from your inbox\n 3. built-in file storage\n\nWhy?\n\nOver the last few years, I've been weaning myself off Gmail and building an\ninbox seemed like a natural thing to do. One thing led to another and now I have\na nice little CMS built around email @…",
  "data/reddit-projects/r/SideProject/comments/uz8tym/i_created_a_saas_to_easily_create_a_table_with.json": "Hey!\n\nI've been working on a \"startup\" side project over the last few months to try\nout the Lean startup processes (ship fast, talk to users, repeat), and learn\nabout some new technologies (integrating with Stripe for payments and\nElasticsearch). This is the first time I've built something with the…",
  "data/reddit-projects/r/SideProject/comments/uzixnj/we_made_macarons_a_slack_app_for_random_lunch_and.json": "My friends and I have a development studio, mostly focused on iOS dev, but on\nthe side we've created this chat roulette app for Slack.\n\nhttps://preview.redd.it/m1xyv3nte6291.png?width=3016&format=png&auto=webp&s=33d3a0f5f2e0e79258446e67d44fc187bc1b9c0f\n\nWhy?\n\nWhile there are already Slack apps…",
  "data/reddit-projects/r/SideProject/comments/uz053u/doqs_fill_your_pdfs_per_rest_api.json": "https://preview.redd.it/iwlmem1o71291.png?width=2400&format=png&auto=webp&s=2a472ca03f167925159b5ba2d362a01491013665\n\nI worked the last ~4 months on my side project doqs [https://doqs.dev].\n\nWhat is doqs?\ndoqs [https://doqs.dev] is a SaaS app allowing its users to fill and customize\ntheir documents…",
  "data/reddit-projects/r/SideProject/comments/v066n7/emu_boards_multiplayer_pastebin_todo_lists.json": "This is a free todo list and textshare I made. I always thought sharing\nplaintext should be way easier, so this is my attempt. Two of my preferred ways\nto share plaintext previously: Discord - nice, but there is a very small size\nlimit, and pinning messages is not ideal. Pastebin - good but it's…"
}