{
  "data/reddit-projects/r/SideProject/comments/shntci/launched_a_platform_for_developers_to_share_the.json": "PRESENTING SKILLSHACK(⚡); [https://skillshack.dev/]\n\n> skillShack(⚡); is a community for software professionals looking to share the\n> projects they are working on and get feedback. From side projects to startups!\n\n\n\nBuilt this over the last year while I was finishing my final year in college.\n(You…",
  "data/reddit-projects/r/SideProject/comments/si3j2m/it_took_us_5_months_and_3_pivots_to_get_our_first.json": "Aug 2021, my partner and I are sitting in front of a blank page, after leaving\nhigh-paying jobs, with no idea, no research, no customers, but with a clear\ngoal. We are going to build a product for content creators (espri.io).\n\nIn a nutshell, the biggest lessons we’ve learned over the past 5 months:…",
  "data/reddit-projects/r/SideProject/comments/shvu80/i_made_a_tool_to_promote_side_projects_on_reddit.json": "I am a coder who creates fun projects in his free time.\nI don't have any fan-following for promoting or any money for ads, so I usually\nuse Reddit to reach users.\n\nI created a cheatsheet on \"how to promote projects on Reddit\",\nTutorial on how to use the tool : 7 steps to go trending on…",
  "data/reddit-projects/r/SideProject/comments/siheoa/ochi_an_app_that_blocks_websites_and_apps_so_you.json": "Hi everyone! 👋\n\nToday I launched my second indie app Ochi, a flexible app & website blocker that\nhelps you stay focused and spend your time wisely.\n\nOchi is inspired by the idea of blocking distractions on a whim, while working\nduring the day, and also in the evening when it's time to go to bed.…",
  "data/reddit-projects/r/SideProject/comments/sj03bi/making_a_collective_soundscape_of_the_future_year.json": "Hello!\n\nI'm working on a side project that involves making a collective soundscape,\nexploring what people imagine their environment will sound like in the year\n2040. If you're interested in joining me in this, there is a two question form\nlinked below that will walk you through identifying two…",
  "data/reddit-projects/r/SideProject/comments/sja44y/creating_a_digital_ant_farm.json": "https://streamable.com/986aeb\n\nIt doesn't look like much yet, but figured I'd share. I found some code written\nin 1991 for Unix that is an ant farm simulation. I've ported the core bits of it\nto React. Ants have the ability to pick up dirt (turning it to sand), dig\ntunnels, and pile sand up. I'm…",
  "data/reddit-projects/r/SideProject/comments/skal6l/just_launched_phase_1_of_my_website_builder.json": "Been working on https://websites4.me [https://websites4.me/] for quite a while\nnow, and just launched free websites as a subdomain of my domain. Full user\nlogin system, referral system, rewards, member only content, easily add facebook\nlogin, and a simple point and click interfaces. Let me know…",
  "data/reddit-projects/r/SideProject/comments/skf11m/hiddentalent_the_best_talent_already_has_a_job.json": "This is a project I have been building on the side.\n\nHiddenTalent.io [https://www.hiddentalent.io/]\n\nThe idea behind it was I had a friend who was looking for a new job but was\nstill employed. I realized it was way easier to look for a new job when you have\nalready quit because you can just post on…",
  "data/reddit-projects/r/SideProject/comments/ski398/new_couples_apple_watch_app_for_valentines_day.json": "Recently, my boyfriend and I have released an app on the App store for Apple\nWatches called LoveTouch: Couples App. We started long distance for college at\nthe beginning of the school year and felt that this app was a great way to\nconnect. Now we want to share the app with the rest of the world for…",
  "data/reddit-projects/r/SideProject/comments/sksg6y/should_i_build_a_site_where_users_can_leave.json": "Just want to get some feedback on my idea. I'm thinking of building a site like\nGlassDoor but instead of company reviews, it'll be recruiter reviews. Can you\nsee yourself or others using a site like that and actually help?",
  "data/reddit-projects/r/SideProject/comments/slueou/roastmystartup_get_landing_pages_website_and_apps.json": "Hi there,\n\nI created this side project to showcase my skills. I'm a backend developer and\nwanted to build something for very long time but have not gotten stick with one\nidea but finally I decided to work on this idea.\n\nThis is like subReddit roastmystartup but not that much heated content. I…",
  "data/reddit-projects/r/SideProject/comments/slohxa/seashotio_online_screenshot_tool.json": "https://seashot.io/ is a site that can take screenshot of your desktop. I\ndecided to start on web first. Then do other platforms. I plan on releasing a\ndesktop version (windows, mac, linux) in like a week. I also want to release on\nmobile and browser extensions.\n\nList of feature I want to add:\n\n *…",
  "data/reddit-projects/r/SideProject/comments/slmu7p/built_this_fun_project_this_weekend_stumbleupon.json": "Wanted to learn Svelte. Had this side project in idealist for a long time.\nBrowsing SaaS product landing pages like StumbleUpon. Check it out\nhttps://phupon.com/\n\nI had to manually compile the list. It was a bit exhausting. You can submit your\nside project too if it's a SaaS.",
  "data/reddit-projects/r/SideProject/comments/smqvvz/dwarven_academy_a_free_dungeons_and_dragons.json": "Combat section for my Forge Domain Cleric\n[https://preview.redd.it/0te398xy2fg81.jpg?width=1913&format=pjpg&auto=webp&s=4e99ce1a36e0969fd532056820a118daf5c01b68]\n\nDwarven Academy [https://dwarven.academy/] is a free character builder for 5e\nthat I am developing in my spare time. It's aimed at…",
  "data/reddit-projects/r/SideProject/comments/sob1hi/my_side_project_is_on_product_hunt_today.json": "Hi everyone,\n\nMy cofounder and I have been working on Recall for the last year or so. We\nlaunched a beta back in November and got about 200 signups.\n\nToday we are on Product Hunt: https://www.producthunt.com/posts/recall-7\n\nWe would really love it if you could checkout the post and give us…"
}