{
  "data/reddit-crypto/r/CryptoCurrency/comments/v2c9h5/a_fact_ignored_by_most_crypto_investors_profits.json": "How often did I read something like \"crypto can help the little men to escape\npoverty\" or \"it could make us all financially independent\". Yesterday (I\nbelieve) someone posted a study claiming that the average crypto investor knows\na lot about crypto, but a lot less about our financial system than…",
  "data/reddit-crypto/r/CryptoCurrency/comments/v2ewy6/fake_tickets_lead_to_riots_before_cl_final.json": "On Saturday night Liverpool played the Champions League final against Real\nMadrid in Paris. The final in Paris was briefly delayed due chaotic scenes\noutside the Stade de France. The French police tear gassed fans (including\nfamilies) that showed up to stadium with fake tickets.\n\nAccording to the…",
  "data/reddit-crypto/r/CryptoCurrency/comments/v2moky/and_the_solana_network_has_been_halted_yet_again.json": "Solana network is currently down yet again and is not producing blocks.\n\nAccording to Solscan, the last block was produced 5 hours ago. This is the 4th\nor 5th time the network is going down in recent months.\n\nSolscan - 5 hours…",
  "data/reddit-crypto/r/Bitcoin/comments/v2i64h/bitcoin_is_hope.json": "I'm a guy in my late 20's from Germany. Growing up I never forgot how they gave\nus the Euro when I was a kid in the early 2000s. Initially for every 'deutsche\nmark' we got 0.5 Euros, but I was super confused when my parents told me that\ntheir salary got divided by 2 (x0.5), but consumer prices went…",
  "data/reddit-crypto/r/CryptoCurrency/comments/v2mokc/aaaaaand_its_gone_nearly_500000000_worth_of.json": "Nearly $500,000,000 worth of positions got wiped in the last 24h and the numbers\nkeep going up.\n\nWhen will people learn? The market recovered slightly for one day and people\naped into long positions again immediately. Why not wait a bit longer to see if\nthis is just a dead cat…",
  "data/reddit-crypto/r/CryptoCurrency/comments/v2kb9t/ust_how_i_lost_1m_because_of_kucoins_manipulation.json": "Disclaimer: sorry for my poor language, English is not my mother tongue.\n\nUpdate #1: Initial post\n\nAt the beginning of May 2022, investors in Anchor protocol panicked and withdrew\ntheir funds ($15B) during a bank run. UST (Terra stable coin) unpegged. The\nTerra ecosystem collapsed. 50 billion has…",
  "data/reddit-crypto/r/CryptoCurrency/comments/v2z4ry/bitcoin_in_2009_a_surreal_look_into_the_first.json": "Jan 3rd, 2009, Satoshi began mining the genesis block. Bitcoin was born.\n\nBlock 0 - January 03, 2009 at 10:15 AM PST\n\nMined by → 1A1zP1eP5QGefi2DMPTfTL5SLmv7DivfNa (50 BTC - unspent)\n\nUsing the Blockchain.com Bitcoin explorer, you can locate the address.\n\nOn the 672nd page of this address'…",
  "data/reddit-crypto/r/CryptoCurrency/comments/v378h0/investing_in_luna_20_is_like_sending_a_scammer.json": "You know that classic attempt from a scammer to grab more money by asking their\nvictims to send him more money, so he can send them their previously stolen\nmoney back?\n\nThis is exactly what the whole Luna 2.0 situation feels like. People lost\nmillions and now they are investing in a shitcoin in the…",
  "data/reddit-crypto/r/CryptoCurrency/comments/v2oggk/costco_hotdog_stable_coin_hotdoge.json": "With all the issues with stable coins these days with frauds running around, we\nneed something we can trust. It has to be auditable from outside sources at any\ntime.\n\nFrom the beginning Costco hotdogs were $1.50. They are still $1.50. They are\npegged to that value always. No matter what fiat is…",
  "data/reddit-crypto/r/CryptoCurrency/comments/v3il6w/algorand_has_settled_85_million_transactions_in.json": "Source: https://metrics.algorand.org/\n\nOther cool stuff about ALGO Tech:\n\nAlgorand has amazing developer resources and documentation.\n\nYou can program dApps on Algorand in any of these languages:\n\nPython, PyTEAL, Java, JavaScript, Go, Reach\n\nSource:…",
  "data/reddit-crypto/r/Bitcoin/comments/v3cv9i/addresses_holding_at_least_1_bitcoin_hits_alltime.json": "https://preview.redd.it/dpl70ao5j8391.png?width=700&format=png&auto=webp&s=e65a99aeeb9c02b3142694aafa966a5e5e03480b\n\nThe number of addresses holding at least one Bitcoin has reached a new all-time\nhigh of 848,082. It seems whales are buying the dip in bitcoin, are you\ncurrently long or short $BTC?",
  "data/reddit-crypto/r/CryptoCurrency/comments/v3vcls/sol_attacked_yet_again_why_invest_in_sol_when.json": "It's common knowledge here that the SOL network goes down frequently, gets\nhacked, doesn't work etc yet people still continue to invest in it. And yet\nagain it was attacked YET AGAIN recently! If traditional banking was this flakey\nthe government would haul it over the coals and watch it burn.\n\nYet…",
  "data/reddit-crypto/r/CryptoCurrency/comments/v3qbct/fact_not_known_by_most_crypto_investors_its_not.json": "A couple of days ago, a post\n[https://www.reddit.com/r/CryptoCurrency/comments/v2c9h5/a_fact_ignored_by_most_crypto_investors_profits/?utm_source=share&utm_medium=web2x&context=3]\ngot popular that contained a fair bit of \"armchair redditor expertise\" on what\n\"is happening\" in crypto using a very…",
  "data/reddit-crypto/r/CryptoCurrency/comments/v3zbp1/someone_changed_the_colors_of_pokémon_and_made_63.json": "Well Jake Paul promoting should have been the biggest red flag but people still\nwent for it. The second red flag was so obvious they said first 15 cards are\nlegendary whoever owns them will get $2500 every month for life.\n\nRed…",
  "data/reddit-crypto/r/CryptoCurrency/comments/v41kz3/you_should_regularly_read_anticrypto_pieces_and.json": "Unfortunately being in an echo chamber makes it very easy to fall into scams or\njust really bad investments. Even if you think crypto is the future, even if you\nthink those against it are neanderthals who don't understand anything and will\nnever be loved, it's probably still a good idea to search…",
  "data/reddit-crypto/r/CryptoCurrency/comments/v3ypxp/if_your_plan_is_to_hodl_please_make_sure_you_are.json": "TL;DR: it’s very important to stick to your plan and be fully aware what it\nmeans.\n\nThe most important part is to always have a plan. A lot of people follow the\nHODL strat and “I’m never gonna sell it’ll go back up again” mentality. It makes\nsense, it’s a good strategy but please be aware of what…",
  "data/reddit-crypto/r/CryptoCurrency/comments/v3uxj0/usdd_and_trx_has_the_exact_same_mint_and_burn.json": "Important Edit: Someone just mentioned there seems to be no contract for minting\nTRX right now. I double checked the white paper and looks like the full mint and\nburn mechanism wont be implemented until November. Until USDD can be burned for\nnewly minted TRX there is 0 chance of a failed mint and…",
  "data/reddit-crypto/r/CryptoCurrency/comments/v4e3d1/this_place_has_straight_up_died_which_is_good_for.json": "You wanna know what makes me excited? Opportunity, you can call it morbid but\neveryone is excited by different things. It's interesting to me how a few big\nplayers prop up the market and it's no more apparent than now.\n\nJust look at this sub, a month ago even during that massive downturn we…",
  "data/reddit-crypto/r/CryptoCurrency/comments/v4nw6o/after_2017_crashit_took_roughly_1_year_to_find.json": "After 2017 crash,it roughly took 1 year to find the bottom for BTC and ETH. The\nso called experts telling you this could be the bottom then take that with the\ngrain of salt.\n\n> If we match the 2017 drawdowns for BTC and ETH, it's 85% and 95% respectively,\n> then we are looking at levels of $10k BTC…",
  "data/reddit-crypto/r/CryptoCurrency/comments/v4vxwo/the_longer_im_in_crypto_the_more_i_lean_toward.json": "Only been in crypto for two years. At first I invested in all sorts of coins and\nslowly, as I spent more time researching and learning, began to narrow it down.\nBut the one I keep coming back to, and the one in which my conviction continues\nto strengthen, is BTC. It keeps weathering storms and…",
  "data/reddit-crypto/r/CryptoCurrency/comments/v4s6kh/once_again_bored_ape_yacht_club_and_otherside.json": "This happened when their community manager's discord account got compromised and\nhackers posted a phishing link through his account and stole almost 175 ETH.\n\n\n\nCommunity Manager…",
  "data/reddit-crypto/r/CryptoCurrency/comments/v54kg9/the_longer_im_in_crypto_the_more_i_lean_toward.json": "In 4 days time the Ropsten test merge will happen, turning the Ropsten testnet\nfrom POW to Proof of stake. On the 30th june, the difficulty bomb will go off,\ngradually increasing the difficulty for miners to mine blocks. The data can be\nfound here:\n\nHttp://wenmerge.com\n\nAnd in an as yet unspecified…",
  "data/reddit-crypto/r/CryptoCurrency/comments/v4ux6l/i_spent_a_week_trading_based_on_an_ais_signals_so.json": "AI is taking over many jobs, starting from cashiers all the way to doctors. I\nwanted to see if AI could replace traders by running a small (and maybe a\ncostly) experiment.\n\nRules are simple. For the next week, I’ll long/short Bitcoin based on an AI\ntwitter bot [https://twitter.com/predictBTC]'s…",
  "data/reddit-crypto/r/CryptoCurrency/comments/v4yqup/all_the_hype_investors_seem_to_be_gone_its_now.json": "The past months have been showing several very hard shake offs on the Crypto\nrollercoaster. But it's all playing out like the market wanted, nearly all hype\ninvestors seem to be gone. Only real investors with conviction in the tech or\nprice action or whatever are remaining.\n\nSuch drastic declines…",
  "data/reddit-crypto/r/CryptoCurrency/comments/v53ulp/both_do_kwon_bernie_madoff_lost_investors_60.json": "In 2009 ,[TLDR] Bernie Madoff lost investors 60billion usd in his ponzi scheme.\nThe ponzi slowly unravelled during the Great Recession when investors started to\nwant to withdraw funds, he wasnt able to keep up with the withdraw requests as\nhe was now lacking funds. He eventually told his sons. They…",
  "data/reddit-crypto/r/CryptoCurrency/comments/v5lrll/we_just_broke_the_9_consecutive_week_of_red.json": "Congrats to those who is still sticking in this very bitter time! Well we got\nnot much choice anyway ¯\\_(ツ)_/¯\n\nIt's already Monday here in most part of South East Asia, weekly candle is\nalready green I doubt it will dump with the remaining time of the week in other\ntimezones (I'm not trying to…",
  "data/reddit-crypto/r/Bitcoin/comments/v5hrsf/list_of_big_things_to_forward_to_before_the_next.json": " * Bi-partisan crypto bill by the GOP's Cynthia Lummis and the Democrat's\n   Kristen Gillinbrand (this is a person who voted against bailing out Wall\n   Street & banks circa 2008). The bill should be out this month, but probably\n   won't get a vote until the 118th Congress begins next year. My…",
  "data/reddit-crypto/r/CryptoCurrency/comments/v5y27v/how_can_we_take_crypto_market_seriously_when_a.json": "Sol is in the top 10, Tron is the top 15, SHIB is in the top 20 and to be honest\nat the current stage, 99% of coins in the market has no real utility or\nintrinsic value. What they can do is swapping a shitcoin for another shitcoin or\nstaking to gain more shitcoins. How crypto market isn’t just a…",
  "data/reddit-crypto/r/Bitcoin/comments/v625h3/wtf_is_happening_with_prices_around_us.json": "I just returned from grocery shopping just few minutes ago after a gap of 2-3\nweeks. I found that the same shop is now selling everything at almost double the\nprice now compared to last few weeks.\n\nI have been hearing about inflation and was aware of price increases (since I\ndon't have a car,…",
  "data/reddit-crypto/r/CryptoCurrency/comments/v69ngy/reuters_investigate_has_found_that_in_the_last.json": "An inquiry into the world’s largest crypto exchange, Binance, financial\nactivities by Reuters, reveals that the exchange platform has aided in\nlaundering no less than $2.35 billion in corrupt funds, over a five year period.\nIn a recurring pattern, as published by Reuters investigation report,…",
  "data/reddit-crypto/r/CryptoCurrency/comments/v6oepj/dear_crypto_a_message_from_a_telegram_hacker_link.json": "https://twitter.com/adyingnobody/status/1534021154674966529?s=21\n\n“I want to come clean, and I will likely tear a rift in the entire community\nwhile I'm at it and on my way out.\n\nOver the course of these next few weeks I will be releasing 137.21GB of Telegram\ngroup chats and messages, of which I…",
  "data/reddit-crypto/r/CryptoCurrency/comments/v6wpi8/a_data_scientist_claims_that_only_64_individuals.json": "An American data scientist unveiled in the mainstream media yesterday the\nresults of an investigation she conducted on the early days of Bitcoin during\nthe 2009 to 2011 period. It's fascinating: according to her, 64 individuals\ncontrolled virtually all of the mining at that time, and they could…"
}