{
  "data/reddit-crypto/r/CryptoCurrency/comments/shh81u/i_see_it_now_most_of_us_are_neither_investors_nor.json": "I had a post last day advising people to be either a trader or an investor and\ngod did it get some crazy reactions! Half of you said we are both. Another half\nwere pissed (don't tell us what to do!). Out of five hundred comments and more ,\nonly a handful understood what I was actually saying.\n\nLet…",
  "data/reddit-crypto/r/CryptoCurrency/comments/shiy2o/is_ethereum_still_worth_the_investment_a_deeper.json": "ETHEREUM\n\n2021 was a fantastic year for crypto, in particular Ethereum. Ethereum reigns as\nthe second-largest blockchain despite the slew of competition from Binance SC,\nSolana, Avalanche. But it remains far ahead showcased by various metrics, and\nthere are no signs of slowing down.\n\nTOTAL…",
  "data/reddit-crypto/r/CryptoCurrency/comments/shomjg/indian_government_announces_it_will_bring_crypto.json": "Indian government just announced that crypto will be taxed at 30% of gains. This\nis the first time the Indian government is discussing crypto taxation. The tax\nwill apply to all gains on digital virtual assets, and no capital losses will be\nallowed. Business expenses will also not be…",
  "data/reddit-crypto/r/CryptoCurrency/comments/shgmmb/bored_apes_have_reached_a_floor_price_well_above.json": "Honestly, I wonder who could have seen it coming. People are spending thousands\nof dollars on Monkey jpegs, and get rewarded for this moronic behavior with\nbetter return rates than almost any other asset can provide. Maybe it's a sign\nthat instead of investing in utility and smart concepts, people…",
  "data/reddit-crypto/r/CryptoCurrency/comments/shq9na/ill_admit_it_i_didnt_trust_you_guys_about.json": "Last few days, I've been playing around on Algorand experimenting with a lot of\nstuff. AND I LOVE IT. Silvio Micali really knows his stuff. This network is an\nabsolute rocket and costs nothing.\n\nAmong other things I also tried the \"famous\" NFT on Algorand. What a crazy\nthing. It costs close to…",
  "data/reddit-crypto/r/CryptoCurrency/comments/shqevq/creators_of_nft_project_doodled_dragons_promised.json": "A Solsea-verified NFT project on the Solana Blockchain, Doodled Dragons\nannounced that they would distribute all profits \"straight to charities\nprotecting animals on the brink of extinction\".\n\nThey announced on Twitter that they would be donating $30k, \"our first donation\nto the World Wildlife…",
  "data/reddit-crypto/r/Bitcoin/comments/shnu7k/economics_professor_asked_whats_the_point_of.json": "Today at my university class, the professor asked “whats the point of bitcoin?”\nThe room was somewhat silent, then some responses about it being purely for\nspeculation pop corned around the room. I sat in silence while he proceeded to\nslander btc and state multiple points of false information, such…",
  "data/reddit-crypto/r/CryptoCurrency/comments/shw6sa/you_guys_understand_that_el_salvador_wants_13.json": "Two posts are on the front page right now: \"El Salvador angrily rejects IMF call\nto drop Bitcoin use\"\n[https://np.reddit.com/r/CryptoCurrency/comments/she2t3/el_salvador_angrily_rejects_imf_call_to_drop/]\nand El Salvador Treasury Minister Alejandro Zelaya angrily rejects IMF demand to\ndrop Bitcoin…",
  "data/reddit-crypto/r/Bitcoin/comments/shrxge/criticizing_bitcoin_for_its_high_energy_use_is.json": "Bitcoin is energy. Its high energy use is an investment. Bitcoin miners securing\na huge network is a good thing.",
  "data/reddit-crypto/r/CryptoCurrency/comments/si1abt/you_dont_need_to_convince_nor_argue_with_anyone.json": "I’ve seen a lot of opinions thrown out here, whether you should or shouldn’t\ntell your family, friends, neighbours about crypto.\n\nThe general consensus of this subreddit is always: “DCA and HODL!” Yes, the past\nalready proved that it’s one of the best if not the best strategy out there. But\ndo we…",
  "data/reddit-crypto/r/CryptoCurrency/comments/si3m4a/why_you_should_make_xmr_part_of_your_portfolio.json": "I’m sure that a lot of you have heard about Monero (XMR) and that it is\nPrivate/Untraceable [https://imgur.com/a/Skb5L4q] and most commonly used in\n“boating accidents” but there’s more to XMR then just that and it’s potential\nuse cases are solid\n\nA lot of people seem to have this understanding that…",
  "data/reddit-crypto/r/CryptoCurrency/comments/si4p19/it_will_never_sit_right_with_me_this_double_tax.json": "9-5 people, perhaps not living paycheck to paycheck, but someone who's not more\nthan half a year of unemployment away from having their life turned on its head\n- These people are not going to get much better off by working, nor by saving\nmoney in the bank. They don't have wealthy relatives so…",
  "data/reddit-crypto/r/Bitcoin/comments/shy3vj/how_many_of_you_actually_hold_only_bitcoin.json": "I understand this is a bitcoin sub, but there is no way you ONLY hold Bitcoin\nright?",
  "data/reddit-crypto/r/CryptoCurrency/comments/sib6ur/the_concept_of_nfts_is_valuable_but_a_jpeg_is_not.json": "In fact, I don’t think these JPEGs should be valued for more than 5 digits. And\nmost of the time its not the market that’s setting these prices. They’re usually\ninorganically inflated.\n\nThis is exactly why NFT like Bored Apes are so hated. I think the only valuable\nthing about Bored Apes is the…",
  "data/reddit-crypto/r/CryptoCurrency/comments/si8krl/an_addiction_will_ruin_your_crypto_trading.json": "I wanted to raise awareness on this, because I think there isn't much\ninformation out there on this topic (at least it hasn't come across me).\n\nThe thing is, when it comes to addictions, the vast majority of them trigger\ndopamine, when you do that particular activity. That's the main reason why…",
  "data/reddit-crypto/r/CryptoCurrency/comments/siicsk/teach_a_man_how_to_stake_and_he_shall_enjoy.json": "There are a lot of people who buy and only HODL your coins and tokens. This post\nis for those of you that do.\n\nWhat is staking?\n\nStaking is a mechanic where you lock up your cryptos and generate passive income\nas you are helping to secure the blockchain through said mechanic. So you don't\nhave to…",
  "data/reddit-crypto/r/CryptoCurrency/comments/sipu9k/popular_rapper_gunna_shilled_a_shitcoin_pushingp.json": "Here's the deleted tweet where he's supporting the coin.\n\nGunna's Tweet.\n[https://preview.redd.it/w7el1hargff81.jpg?width=1283&format=pjpg&auto=webp&s=e5ec1a86f4cea052f178f54d12773f9b9938e1ed]\n\nAfter shilling this shitcoin he tweeted again with \"I wunna C Everybody Win\"\nwhich is kinda ironic since…",
  "data/reddit-crypto/r/CryptoCurrency/comments/siv00k/update_to_my_country_announcing_3_years_jail_for.json": "Original\npost:https://np.reddit.com/r/CryptoCurrency/comments/sanct2/my_government_announced_1_year_jail_time_for/?utm_source=share&amp;utm_medium=ios_app&amp;utm_name=iossmf\n\nI contacted many Embassies and they didn't approve when I applied for political\nasylum.I have been staying off this Reddit…",
  "data/reddit-crypto/r/CryptoCurrency/comments/siyhjx/every_country_in_the_world_is_in_debt_the_global.json": "Every country in the world is in debt, some much more than others\n\nThe US national debt is $30 Trillion, China $7 Trillion, Russia $0.5 Trillion,\nIndia $2.3 Trillion\n\nSome smaller countries have staggering debt levels, for example Japan has debt\nof 235% it's GDP.\n\nI think most of this the debt is…",
  "data/reddit-crypto/r/CryptoCurrency/comments/sivx1j/so_wtf_happened_to_loopring_its_almost_80_down.json": "2-3 months ago it went 0.5$ to 3.7$,everyone were saying it will reach 10$ by\nEOY. Now it's around 0.70-0.90$,almost 80% down from ATH. I know most of alts\nalso crashed but not that much. Is hype finished? Did devs rugpulled? Did they\noverhyped and not deliver? I don't get it..\n\nI know LRC devs…",
  "data/reddit-crypto/r/CryptoCurrency/comments/sj0nb0/moons_are_definetly_a_sitcoin_no_utility_no.json": "This sub is very anti-shitcoin and sure why shouldn't it be, people are thinking\nsome just made shitcoins are a better investment than some utility crypto. Over\nthe longterm the utility always wins and hype leaves.\n\nBut thus subs own crypto MOONS are also, definitely, a shitcoin. It's far away\nfrom…",
  "data/reddit-crypto/r/CryptoCurrency/comments/sj013u/the_whales_arent_selling_smaller_investors_are.json": "A lot of people left the Crypto market in fear of a Crypto winter. However, the\npeople who did not leave are the ones who went through at least 2 Bitcoin bull\ncycles and the whales. A 45% steady price decrease is nothing but an\naccumulation strategy, and we can see this across the board with…",
  "data/reddit-crypto/r/CryptoCurrency/comments/sj59mf/the_irs_may_not_tax_crypto_earned_through_staking.json": "In May of last year Josh and Jessica Jarrett requested a refund of income tax\nthey paid on Tezos staking rewards in 2019. (Around $3200 for approximately 8800\nTezos tokens)\n\nToday, the IRS has decided to issue that refund.\n\nThey will not refund any amount that was sold obviously but the couple…",
  "data/reddit-crypto/r/Bitcoin/comments/sixbuk/i_did_my_first_serious_bitcoin_purchase_today.json": "I’m sure no one cares but Im happy about it.",
  "data/reddit-crypto/r/CryptoCurrency/comments/sj16yr/which_coin_gave_you_completely_lost_faith_in.json": "After a few false starts, I’ve condensed my portfolio into coins I fully believe\nin. Time will tell if they are good choices are not, but for now I’m confident.\n\nThe biggest cut i’ve made is Solana, thankfully before the January crash kicked\nin. I didn’t make any money, but I didn’t lose any…",
  "data/reddit-crypto/r/CryptoCurrency/comments/sjfad1/solana_is_the_mcdonalds_ice_cream_machine_of_the.json": "I tried to give this chain the benefit of the doubt multiple times yet it always\nseems to fail my expectations.\n\nEither it’s down cause its out of RAM, got attacked by a DDOS and now it got\nhacked. There’s always something wrong with this chain.\n\nHonestly I feel like it’s one of the most overhyped…",
  "data/reddit-crypto/r/CryptoCurrency/comments/sjgkhx/crypto_isnt_going_to_magically_make_you_rich_get.json": "This is probably a massively unpopular option.\n\nI see a lot of people on this sub saying that crypto is their path to financial\nfreedom, early retirement and a lambo. Many of these people boast a portfolio of\nup to 100% in crypto.\n\nIf you don’t have much invested to begin with, let’s say $10,000 or…",
  "data/reddit-crypto/r/CryptoCurrency/comments/sjk2i0/i_recently_acquired_80000_eth_for_a_very_very.json": "Yesterday, I was doing some good old arbitrage trading between Solana and\nEthereum, and I managed to get my hands on 80,000 ETH for a really low price -\nso low, in fact, that you wouldn't believe me if I told you how I pulled off\nthis deal.\n\nNow I don't know what to do with all this ETH. It's worth…",
  "data/reddit-crypto/r/CryptoCurrency/comments/sjfwrz/btc_mining_contributes_to_a_staggering_008_of.json": "According to digital investing firm CoinShares, BTC miners contribute to 0.08%\nof the world's Total carbon dioxide (CO2) emissions.\n\nAlthough 0.08% might seems small, we are talking about the Total CO2 emmisions\nworldwide... this is not little at all. Especially not now we are dealing with a\nharsh…",
  "data/reddit-crypto/r/CryptoCurrency/comments/sjerjo/crypto_companies_publishing_research_reports.json": "Today (maybe a few days ago? I saw it posted today), a company called\n\"CoinShares\" published a report\n[https://coinshares.com/research/bitcoin-mining-network-2022] that tries really\nhard to push the narrative that BTC is totally not bad for the environment and\nthat all of that is FUD.\n\nWho is…",
  "data/reddit-crypto/r/CryptoCurrency/comments/sjn58u/why_facebook_should_not_be_allowed_to.json": "In yesterday's Facebook earnings report of 2021 Q4, this is what they disclosed\nabout future earning projections.\n\nWe expect first quarter 2022 total revenue to be in the range of $27-29 billion,\nwhich represents 3-11% year-over-year growth. We expect our year-over-year\ngrowth in the first quarter…",
  "data/reddit-crypto/r/CryptoCurrency/comments/sjul4i/bitcoin_is_the_broccoli_of_this_sub.json": "You know Broccoli won't hurt you. On the contrary, it would be very very healthy\nto eat broccoli more often.\n\nInstead, you keep reaching for one of the thousands of sweets that seem so\ndelicious. They have such interesting names and the packaging says all sorts of\ngreat things. When you're out…",
  "data/reddit-crypto/r/CryptoCurrency/comments/sjxf29/how_can_i_acquire_moons_as_a_lurker.json": "I like the idea of moons although there seems to be absolutely no use for them\noutside of getting special features in this sub? I also don't have much to\ncontribute to the CC sub. I enjoy reading the discussions and seeing the\npanic/anger that ensues with the market fluctuations, but besides…",
  "data/reddit-crypto/r/CryptoCurrency/comments/sk0fix/since_facebookmeta_lost_237_billion_in_market.json": "Meta also said the augmented and virtual reality business at the heart of its\nmetaverse plans is generating revenue but is unprofitable. \n\nI would expect a price drop in the three following cryptos as they are\nassociated with the meta verse.\n\n-Mana -Sand -AXS\n\nI'm calling it right now, the…",
  "data/reddit-crypto/r/CryptoCurrency/comments/sk2rg0/the_320m_wormhole_hack_was_replenished_by_jump.json": "Yesterday, the Wormhole bridge one of Solana's biggest bridges lost $320m in a\nhack. Within hours, a trading desk Jump Capital agreed to replenish the entire\namount so that the liquidations calamity is avoided. The loss of the peg due to\nthe hack could have sent the network into cascading…",
  "data/reddit-crypto/r/CryptoCurrency/comments/sjwzgk/why_do_people_invest_in_sol_when_cryptocurrencies.json": "It's common knowledge here that the SOL network goes down frequently, gets\nhacked, doesn't work etc yet people still continue to invest in it. Christ if\ntraditional banking was this flakey the government would haul it over the coals\nand watch it burn.\n\nYet people still invest in this centralized…"
}