{
  "data/reddit-ask/r/NoStupidQuestions/comments/ufo23t/is_dating_soulcrushing_for_everyone_or_am_i_just.json": "I’ve only started dating recently and I’m ready to delete all the apps and just\ndie alone. I hate going on pointless first dates.\n\nI was also starting to feel more confident in myself until I started dating, now\nI just have a whole lot of self-doubt. If a guy doesn’t want a second date I…",
  "data/reddit-ask/r/AskHistorians/comments/ufs52y/islamic_sources_describe_the_vikings_rus_as_very.json": "The 10th-century Muslim traveler Ahmad ibn Fadlan had this to say about the\nvikings. “They are the filthiest of all Allah's creatures: they do not purify\nthemselves after excreting or urinating or wash themselves when in a state of\nritual impurity after coitus and do not even wash their hands after…",
  "data/reddit-ask/r/NoStupidQuestions/comments/uft96f/is_it_alright_to_ask_my_dad_not_to_kiss_me_anymore.json": "Okay some context, my (31f) family has a lot of issues when it comes to\nboundaries. Touching, joking, giving advice when not asked, and so on. Well my\nbiggest issue is that my dad likes to kiss my neck or back. I hate it. It\nliterally makes my stomach knot and I have told him on multiple occasions…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ufp206/what_does_it_mean_when_a_girl_tell_me_i_fuck_like.json": "asking For a friend...",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ufvz6i/how_do_i_politely_tell_the_owner_of_the_gym_i_go.json": "So I go to a gym. In said gym, there's a VERY small tank that houses a very sick\nBetta fish. The tank is filthy and has no filtration whatsoever. It doesn't take\na fish expert to see that this fish is dying. I have a tank at home and whenever\nI go to the gym and see the Betta, all I want to do is…",
  "data/reddit-ask/r/NoStupidQuestions/comments/ufoosa/does_anyone_else_use_the_word_we_when_thinking.json": "I caught myself randomly, I had this thought when asking myself if I ought to\nhave some chocolate ice cream; “well, we’re home alone, it’s the perfect time to\nsneak some ice cream before dinner.” Let’s disregard the fascinating and\nplan-to-unpack-later quandary that I’m an adult married woman who…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ufy2k4/why_is_it_considered_offensive_for_white_people.json": "i know if its not done properly or taken care of the right way it can harm your\nscalp or hair. but when done properly, whats the harm in having them?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ufziz2/why_are_people_more_focused_on_forgiving_student.json": "I understand that forgiving student loans would change a lot of people’s lives,\nbut it just seems like it’s not addressing the core of the problem. Forgiving\nexisting loans doesn’t change that people will continue to go to college and\naccumulate the same massive amounts of debt that we’re seeing…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/uftr4d/how_do_you_actually_know_if_you_are_attractive_or.json": "Simply put i either look great or terrible on photos because I know my angles.\nI'm usually the center of attention when it is a flirtatious situation.\n\nThing is I dont feel like I'm not attractive but I also don't think im really\nattractive. I do feel like people tell me I'm beautiful out of pity…",
  "data/reddit-ask/r/askscience/comments/ug0an2/why_cant_we_reproduce_the_sound_of_very_old.json": "What exactly stops us from just making a 1:1 replica of a Stradivarius or\nGuarneri violin with the same sound?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ug1c9g/why_should_i_respect_peoples_religious_views_if.json": "I'm talking mainly about Islam, Judaism, Christianity and any other religion\nthat has doctrine that perpetuates hatred. I would never look at, say, a Muslim\nand beat the crap out of them just because of what they believe. But I would\njudge them and treat them with suspicion because they are at a…",
  "data/reddit-ask/r/NoStupidQuestions/comments/ug1q4s/isnt_im_in_love_with_you_different_than_i_love_you.json": "Edit: As a non native speaker, it's always so confusing to me when people in\nmovies say \"I'm in love with you\" and then the other person says \"I love you\ntoo\".",
  "data/reddit-ask/r/AskHistorians/comments/ufv2vr/more_indian_movies_sold_over_20_million_tickets.json": "According to Wikipedia's list of highest grossing movies in the Soviet Union\n[https://en.wikipedia.org/wiki/List_of_highest-grossing_films_in_the_Soviet_Union],\n50 Indian movies sold over 20 million tickets, ahead of the US's 41 and France's\n38. Given the ostensible popularity of Indian movies, how…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ufx32n/as_a_man_should_i_be_prioritizing_my_partners.json": "I know the common answer will probably be, \"just talk to your partner\". I don't\nhave one right now, but I'd like some input or understanding on this, since I\nsee a lot of discrepancy regarding this.\n\nI have a small penis, and suffer poor body image because of the shaming of it.\nThe one refrain I…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ufy6kx/why_are_jews_so_hated_around_the_world.json": "What is the reason behind the jew hate? It wasn’t just that 1 specific ww2\nmoment. From my understanding jews have been hated and looked down upon for a\nvery long time, before and after ww2. Why? There must be a reason for such\nenormous groups of people to all hate the jews.\n\nEdit: please keep it…",
  "data/reddit-ask/r/NoStupidQuestions/comments/ufybwz/why_do_people_think_germans_wouldnt_talk_about.json": "I just watched an episode of Family Guy where, as in so many other movies and\nseries, the joke is made that Germans won't talk about their past. But where\ndoes this stupid idea come from? When you turn on the TV in Germany it is almost\nimpossible not to see something about the Second World War, in…",
  "data/reddit-ask/r/AskHistorians/comments/ug1yzt/how_common_were_comfort_girls_during_slavery_in.json": "I’m doing an essay about what life would have could’ve been like during slavery\nin the 1800s. I’m a mixed (black/white) woman so life would have obviously been\nrather.. interesting. I’m trying to cover every option of what could’ve become\nof mixed woman and I was wondering if Django Unchained was…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ug25x9/is_it_weird_to_ask_a_girl_to_help_find_her_clit.json": "Weird title but I (20M) have been some issues recently. So I broke up with me a\nex gf of 2 years recently enough. I always was so confident during sex as you\nlearn alot about someone for 2 years. I never had issues finding her clit.\n\nSo I've been with a few one night stands now and for some of them…",
  "data/reddit-ask/r/NoStupidQuestions/comments/ug2dch/would_it_be_illegal_for_me_to_follow_paparazzi.json": "Paparazzi can follow around celebrities for no reason and photograph them like\nwalking around. i heard once they get away with this because they can argue it’s\na “public service” or something. So could i get away doing the same to them?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ufzo08/im_straight_but_disgusted_by_vaginas.json": "(16M). I'm turned on by every other part of a woman but not the vagina. This was\nespecially a problem yesterday when I was making out with a girl and she was\nhinting me to finger her but i was like not a chance.\n\nLater in the night I got a condom (because somehow do tolerate the possibility\nof…",
  "data/reddit-ask/r/AskHistorians/comments/ug5nxq/the_film_the_northman2022_has_been_criticized_in.json": "I’m interested in the subject of historical diversity in general. Fiction\nusually depicts medieval Europe as a place where only white people exist; in\nrecent years, I’ve seen claims that this is inaccurate, and Europe was\nhistorically more diverse than we tend to imagine in pop culture.\n\n“The…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ug7s1h/im_a_34_year_old_who_has_never_been_to_a_concert.json": "What's more, I'm going alone.",
  "data/reddit-ask/r/NoStupidQuestions/comments/ug68zf/what_would_happen_if_you_ate_a_piece_of_cancer.json": "Like you cut it off/out/whatever and ate it?\n\nETA: I’m just curious if you could get cancer from it or if you’d be relatively\nunharmed?\n\nSecond edit: Getting some good answers! Thanks! Btw, I haven’t, nor do I ever,\nplan on eating cancer specifically but I’ve been watching TWD and remembered…",
  "data/reddit-ask/r/askscience/comments/ufy1jk/is_it_true_that_fasting_makes_our_cells_age_at.json": "Title itself.",
  "data/reddit-ask/r/TrueAskReddit/comments/ufx74n/why_modern_american_politicians_dont_assasinate.json": "Please guys, no funny obvious racist replies like \"Cuz we're not savages like\nyou\" lol. As a citizen in a 3rd world country, politicians \"eliminating\"\ncompetitions before, during and after elections is so common like a morning\ncoffee.Its also possible even duringnthe their term. Lots of times, its…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ugfv7h/if_a_woman_rapes_a_man_and_gets_pregnant_should.json": "Just a philosophical question I was having with a buddy of mine today.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ug1dli/why_do_so_many_people_prefer_to_get_plastic.json": "Do they not realize that people who get too much plastic surgery all end up\nlooking the same? It's confusing to me because really no one looks at those\npeople and thinks \"Wow they look great!\" everyone knows what they did and\nacknowledges it didn't really work. So if someone knows that when…",
  "data/reddit-ask/r/NoStupidQuestions/comments/ughhmq/why_are_the_people_who_go_on_about_free_speech.json": "I guess this might be a US specific post.\n\nBut for example, getting banned on social media, removed from a private\nbusiness, or losing your job for saying certain things or causing a disturbance\nare all things that can legally happen under our first amendment, which only\nprevents being arrested and…",
  "data/reddit-ask/r/NoStupidQuestions/comments/ugmwev/question_for_boob_enjoyers.json": "hello, I am currently figuring out my sexuality. I am male and I have a question\nabout boobs.\n\ndo people actually like them? like, do you see a boob and think that's hot or\nyou want to touch it or something.\n\ni don't really understand the appeal for them and I'm wondering if this is\nsomething…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ugog0s/why_do_americans_care_that_they_are_10_irish_and.json": "In Europe, I have never heard someone casually tell you this information because\nI guess it is irrelevant that one ancestor came from another country.\n\nI have heard people talk about how they're descendants from dark ages royalty\nbut that's about it.",
  "data/reddit-ask/r/NoStupidQuestions/comments/ugnrqz/anyone_else_think_fuck_it_ill_let_future_me_deal.json": "Future me fucking hates me",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ugijqd/is_struggling_with_mental_health_a_new_cool_thing.json": "I understand that as a society we’ve been opening up a lot more on topics\nrelated to mental health in the past few years, and admitting depression or\ngoing to therapy sessions has become much more common and accepted. Which is\nwonderful! But why does it feel that every second relationship related…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ugpn54/would_fucking_schrodingers_cat_be_necrophilia_or.json": "If I don't observe it and I fuck it would it be Necrophilia or Beastiality or\nboth?",
  "data/reddit-ask/r/NoStupidQuestions/comments/ug545q/i_wasnt_born_yet_i_want_to_know_what_was_it_like.json": "Were there a lot of headlines mentioning stuff about entering a new millennia in\nnewspapers, were people making a lot of conversations about what might be\ndifferent? Was it a talking point at get-togethers? Did people make jokes about\n\"see you next millennia\" or \"it's going to be weird not writing…",
  "data/reddit-ask/r/AskHistorians/comments/uge2eu/john_wilkes_booth_was_a_famous_actor_in_his_day.json": "I just got to thinking about Booth's occupation the other day and a lot of\nquestions came to mind. I didn't see them answered previously and wanted to know\nif anyone had any information about this sort of stuff.",
  "data/reddit-ask/r/AskHistorians/comments/ugr0ds/to_what_extent_if_any_did_abraham_lincoln_know.json": "Apologies if this is a rather strange question but it's been on my mind lately.\nLiving in the South, I've met a wide variety of people but I recently met some\n\"Lost Cause\" neo-Confederate sympathizers and what they had to say about\nPresident Lincoln was very strange. Aside from their obvious hatred…",
  "data/reddit-ask/r/NoStupidQuestions/comments/ugu9xa/when_i_look_in_a_mirror_thats_3_ft_away_from_me.json": "Basically does the light going to the mirror and bouncing back to me make it as\nthough I'm twice as far away as I actually am?",
  "data/reddit-ask/r/AskHistorians/comments/ugm65a/throughout_the_history_of_muslim_rule_over.json": "Wikipedia\n[https://en.wikipedia.org/wiki/Islamization_of_Jerusalem#Islamization_of_Jerusalem_under_Jordanian_rule],\nquoting 3 different sources:\n\n> Tourists [i.e. non-Israelis] entering East Jerusalem had to present baptismal\n> certificates or other proof they were not…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ugx3xw/if_incels_are_so_convinced_that_women_only_care.json": "This is something I never got about the movement. If incels are so convinced\nthat women only ever exclusively want to date or hook up with attractive or good\nlooking men what’s stopping them from working out, working on their style, and\nmaking themselves more attractive to women?\n\nWhy are incels…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/uh1buo/why_do_people_get_offended_on_behalf_of_my.json": "I’m thai, me and I know a lot of other Thai people that like it when foreigners\nwear our traditional clothes, get involved in our holidays and cultural\ngatherings. Why do people seem to think it’s cultural appropriation when someone\nwears our traditional clothing when they are on holiday in…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/uh3qw2/besides_her_being_unfunny_why_do_people_hate_amy.json": "People literally fantasize about her death on Reddit & Twitter and I’m just so\nout of the loop. It seems super disturbing to hate a comedian that much but\nmaybe there’s something I don’t know?",
  "data/reddit-ask/r/AskHistorians/comments/uh5sup/the_great_roman_general_scipio_africanus_liked_to.json": "Modern men often look ridiculous on the dance floor. There are many memes about\nthis, so it's fun to see the topic come up in Seneca's work\n\nThe men of Seneca's day, \"mince and wriggle with more than effeminate\nvoluptuousness,\" when they're just walking around.\" Dances, we must assume, were\neven…",
  "data/reddit-ask/r/NoStupidQuestions/comments/uh3zmj/if_gender_and_sex_are_different_why_do_people.json": "I see people denying the “a woman is someone who identifies as a woman” all the\ntime. Instead, I imagine it’s like identifying as a conservative or liberal,\nyour beliefs make you that. Can we please talk about this without getting\nbanned?",
  "data/reddit-ask/r/askscience/comments/uh5re6/do_we_have_a_wider_field_of_view_when_our_pupils.json": "In the dark our pupils get wider, which I would imagine means there is a larger\nangle of light that we can see, and the opposite for our pupils shrinking in\nbrightness. Is this actually how it works?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/uh4mdb/whi_arent_female_condoms_talked_about_more_and.json": "https://www.plannedparenthood.org/learn/birth-control/internal-condom",
  "data/reddit-ask/r/TooAfraidToAsk/comments/uh5m7d/how_is_artificially_raising_the_price_of_drugs.json": "For example I see stuff all the time about how insulin is ridiculously expensive\nonly because the company’s raised the price for profit. How is there no law\nmaking something like that illegal, or is it like some loophole?",
  "data/reddit-ask/r/AskWomen/comments/uh4103/how_do_you_feel_when_guys_try_to_impress_you_by.json": "We all know the meme of the kid trying to carry a ton of chairs to impress\ngirls. Have you ever noticed someone doing this around you irl and what was your\nreaction?\n\nEdit: 16K views and 16 upvotes good lord",
  "data/reddit-ask/r/NoStupidQuestions/comments/uh79tu/do_people_still_use_lol.json": "I've started feeling old when using it....\n\nGirls keep messaging me with \"hhh\" and for months I didn't realize it meant ha\nha ha.... I'm only 30 damn it.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/uh7ke8/is_it_okay_to_feel_annoyed_about_sitting_next_to.json": "Their flab encroaches on my space and makes my trip uncomfortable. Why should I\nhave to suffer?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/uh5co0/with_the_supreme_courts_opinion_can_i_still_get.json": "I’m 16 and I’m terrified that I won’t be able to get an abortion if I’m raped or\nsomething else terrible happens.\n\nAlso, what’s next for the anti choice people? Will they go after doctors who\noffer birth control next?\n\nEdit: I’m from Iowa.",
  "data/reddit-ask/r/NoStupidQuestions/comments/uh9jd2/how_did_overturning_roe_v_wade_even_come_about.json": "THIS IS A QUESTION ABOUT THE AMERICAN SUPREME COURT SYSTEM. NOT THE MORALITY OF\nABORTIONS.\n\nI feel like I am out of the loop when this morning my feed is full of\n\"overturning Roe v Wade\" posts.\n\nI thought the job of the supreme court was to set precedent, by hearing out\ncases that are escalated to…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/uhd6vt/why_shirtless_chris_hemsworth_full_of_sexy.json": "I really can not grasp my head around this extremely popular things. I mean\npeople want to see most attractive things on screen. And anytime I mention this\nI get a massive backlash with 0 explanation of \"how and why\" that involves both\nsides.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/uha5pe/why_are_people_suddenly_siding_with_johnny_depp.json": "Rewind 2 years and it was a totally different atmosphere. People were shitting\non Depp so hard, even though virtually all the damning evidence was already out\nthere. We knew about the finger, we knew about the audio recordings, and yes we\nabsolutely knew she took a dump in his bed. So what gives? I…",
  "data/reddit-ask/r/AskHistorians/comments/uhh2j1/megathread_abortion_in_america.json": "Late last night, the website Politico announced they had a draft copy of the\nruling in the Thomas E. Dobbs, State Health Officer Of The Mississippi\nDepartment Of Health, Et Al, Petitioners V. Jackson Women's Health Organization.\nThe draft is attributed to Justice Alito and court…",
  "data/reddit-ask/r/AskWomen/comments/uh9l02/ladies_living_alone_what_do_you_do_when_you_get.json": "How do people deal with being unsettled or creeped out, even scared when there's\nno one else in the house? Specifically with the horror medium, like scary movies\nor unsettling games. Even just feeling like there's something in the corner in\ngeneral. Not situations where you might actually be in…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/uhfhhf/why_is_all_porn_with_people_of_colour_relegated.json": "Any time you're on a porn site different ethnicities have their own category,\nlike 'Asian', 'ebony', 'Indian' etc., but porn with white performers doesn't\nhave to be searched for under 'white' even though the category does exist. But\nit's almost like they push the other races to their own…",
  "data/reddit-ask/r/AskWomen/comments/uhhvs3/abortion_rights_and_access_megathread.json": "What are your thoughts and experiences about abortion rights and access? What\nresources would you recommend to people regarding these topics?\n\n * This post is in contest mode and only top level responses are permitted. Do\n   not reply to someone else's comment and do not leave a top level comment\n …",
  "data/reddit-ask/r/TooAfraidToAsk/comments/uhddar/do_people_really_care_which_way_the_toilet_paper.json": "Do people care or is it just something to \"be right about\"",
  "data/reddit-ask/r/TooAfraidToAsk/comments/uhgqmk/why_do_so_many_people_think_danny_devito_is_sexy.json": "I have nothing against him as a person, but I don’t see what everyone else sees.",
  "data/reddit-ask/r/askscience/comments/uh9s9e/why_do_so_many_new_drug_names_end_in_umab.json": "Just wondered what it’s derived from. I’ve seen many drugs ending in umab or\nmab, especially in clinical trials.",
  "data/reddit-ask/r/askscience/comments/uhlfvw/what_would_be_observed_by_two_objects_moving_at.json": "From how I understand it, all velocities are relative, and nothing can surpass\nthe speed of light. So I would assume this means you can't observe anything move\nfaster than C, but what I can't grasp is what an object moving at, say, 99% of C\nwould observe if another object was moving at the same…",
  "data/reddit-ask/r/askscience/comments/uhjsee/why_isnt_apparent_gravity_greater_at_the_poles.json": "If centifugal force increases with the radius of rotation (all else staying the\nsame), why doesn't our apparent weight vary depending on our relative distance\nfrom the equator i.e. if there is less centrifugal force at the North/South Pole\nto balance the constant gravity, why don't we feel like we…",
  "data/reddit-ask/r/Ask_Politics/comments/uha3w1/before_roe_v_wade_is_overturned_what_is_stopping.json": "The draft Supreme Court opinion was just leaked / shared; Roe and Casey will\nlikely be reversed. What is stopping the current Democratically controlled\nCongress (the Senate is split 50-50, but VP Harris could cast a tie breaking\nvote) from passing a federal law protecting abortion patients and…",
  "data/reddit-ask/r/NoStupidQuestions/comments/uhpsvw/why_is_the_us_supreme_court_overwhelmingly.json": "A quick preface: I am not American, I am not seeking an argument, I am not\ndebating the legality or morality of any individual topic.\n\nI am interested in the recent history that led to this trend. Wikipedia says\nthat as many as seven of the justices are Catholic; definitely six. Is there a\nroot to…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/uhr8f3/heterosexual_people_regularly_say_that_person_is.json": "I don't mean this in a negative way at all, but it happens. I'm just wondering\nif it goes both ways.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/uhguxi/why_are_christian_conservatives_such_hypocrites.json": "Whenever we ask them trust science it's always \"Never believe everything youre\ntold. Don't ask question\", but whenever we ask them why did God let slavery\nhappen then it's always \"God works in mysterious ways. Who are you to question\nhim?\" What's up with that?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/uhsr68/can_people_really_just_not_have_sex.json": "Maybe it’s just me being a massive virgin but is it really that hard to just not\nhave sex. I see all these relationship post about not being able to have sex\nwith their wife or husband and they want a divorce. Like just wank one out and\nmove on. Yeah I know it’s a natural biological want but damn…",
  "data/reddit-ask/r/NoStupidQuestions/comments/uhsc8h/isnt_the_q_in_lgbtq_a_bit_redundant.json": "Wikipedia describes queer as an umbrella term for anyone not heterosexual or\ncis. Those both get covered by the LGBT in the name, so why is it included? I'm\nnot about excluding groups of people but it seems like the abbreviation already\nhas every base covered. EDIT: added the \"not\" in between \"I'm…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/uhzbd9/why_do_so_many_people_caregive_a_shit_about_depp.json": "I mean its not like we don’t have more important news to cover. Why do we even\ncare about this so much. Is there going to be any huge changes to the law or\nsomething due to this case?. Will either of them be jailed after this?",
  "data/reddit-ask/r/AskHistorians/comments/ui0dm6/what_was_student_life_like_at_a_medieval_european.json": "I have absolutely no idea what medieval universities were like and especially in\nwhat way they differ from modern universities. I read quite a bit about\nuniversities in the early modern period but I imagine that they were quite\ndifferent before printed books became available. So roughly from 12th…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ui2z2q/the_homosexual_people_who_marry_straight_people.json": "So a lot of gay/lesbian people marry straight people, have children and then\ncome out. They are then lauded as brave. But their SO, who lived a life of lie\nare forced to not only accept it, but also appreciate their brave decision. It\nalways confuses me. Isn't it better to stay single than hurting…",
  "data/reddit-ask/r/askscience/comments/uhxele/is_crying_an_inflammatory_process.json": "After I cry, especially for a while, my eyes feel sore and my eyelids get puffy\nand red, and they can take almost a day to feel back to normal. I also feel\ntired for the next +/-12 hours.\n\nIs there an inflammatory feedback mechanism from crying?\n\nAlso, this brings up another question: does anyone…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ui4njz/why_do_so_many_people_list_their_mental_health.json": "Honestly don't understand it myself but I'm genuinely curious about the\nmotivation. Is it to get sympathy? Is it to brag? Is it to obtain power through\nvictimhood? Is it seen as their direct personhood? Something else entirely?\nAnyone who does this and can shed some light on it, I would very much…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ui4nxb/how_much_does_having_a_baby_cost_in_the_united.json": "To clarify, I mean giving birth",
  "data/reddit-ask/r/askscience/comments/ui7vwy/does_the_original_strain_of_covid_still_exist_in.json": "What do we know about any kind of lasting immunity?\n\nIs humanity likely to have to live with Covid forever?\n\nIf Covid is going to stick around for a long time I guess that means that not\nonly will we have potential to catch a cold and flu but also Covid every year?\n\nI tested positive for Covid on…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/uhxryu/how_am_i_supposed_to_find_happiness_and_joy_in_a.json": "I know it's bad that I see more evil in the world than good, but it just seems\nlike the more realistic way to see things. It's impossible to avoid it. If I\nturn off all news and media information and keep myself away from reddit, I'm\nlooked at differently because I'm uninformed. Yet if I keep…",
  "data/reddit-ask/r/AskWomen/comments/ui2nv5/whats_your_favourite_dinosaur_and_why.json": "Mine is a megalodon, because they’re the biggest sea creature.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ui7xwm/have_you_ever_looked_in_the_mirror_and_instantly.json": "It’s almost like a disassociation feeling. Idk but it's really bizarre when it\nhappens.",
  "data/reddit-ask/r/NoStupidQuestions/comments/uib4cc/how_did_bullshit_become_the_premier_animal_shit.json": "When you feel as if someone is lying you would say \"bullshit\". So how did the\nbull become the premier animal for shit? Why not \"hipposhit\" or \"lionshit\" or\nmaybe even \"sharkshit\". I guess it flows off the tongue better."
}