{
  "data/reddit-ask/r/TooAfraidToAsk/comments/vomtl5/how_to_tell_people_you_dont_want_kids_without.json": "Hi all,\n\nI (32f) and my husband (35m) have been together for almost 14 years and married\nfor almost 9 years. When we got married, we were asked when we were going to\nhave kids. We always came up with a response around the fact that we are waiting\nand it’ll happen when/if it happens. The past couple…",
  "data/reddit-ask/r/NoStupidQuestions/comments/vonplo/why_does_my_girlfriend_embarrass_me_in_public.json": "She always has to make a scene or question my manhood to her friends or any\nrandom person who’ll listen. I can’t stand it. Then when I say something, I’m\nthe problem, I’m the one being a little bitch.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/voypkl/women_have_many_different_sexy_lingerie_etc_what.json": "As the title says, I find it slightly strange that women can get dressed up to\nbe sexy, but what can a man do?",
  "data/reddit-ask/r/AskHistorians/comments/vov2qp/ancient_civilisations_were_built_on_river.json": "All great ancient civilisations were centered on river flood plains. India on\nthe Indus and Ganges, China on the Yellow and Yangtze, Egypt on the Nile and\nMesopotamia on the Tigris and Euphrates. The yearly flooding would irrigate the\nland and make it very fertile.\n\nAccording to this global survey…",
  "data/reddit-ask/r/AskWomen/comments/voslv9/ladies_whats_your_protocol_for_leaving_after_a.json": "If nothing is established from the beginning do you leave once the other person\nfalls asleep or do you wait until the morning to leave?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/vox6n5/are_working_conditions_in_the_usa_really_that_bad.json": "Having worked in Germany, the UK and Australia, I have always been relatively\nlucky with my line of work and the benefits associated with it, regardless of my\nemployer. However, I keep reading about these atrocious working conditions in\nthe US with people claiming they get less than 2 weeks holiday…",
  "data/reddit-ask/r/NoStupidQuestions/comments/vp32g9/does_high_school_really_start_at_730am_in_the_us.json": "I saw a post that had a few comments from, what I assume, were American talking\nabout how a 9am start was unheard of at school. People even talking about\ngetting the bus at 5:30am?? Surely this isn’t the norm?\n\nIn the UK the vast majority of schools start between 8:30am and 9:00am,\nfinishing around…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/voz0ig/is_american_democracy_truly_on_the_brink_of.json": "I have lived in America my whole life. I know our history, both the good and the\nbad. One thing that I always was taught was how strong our democracy was. Our\ndemocracy is what made us great. I cant help but feel like when a substantial\nportion of the country believes in a lie about an election…",
  "data/reddit-ask/r/NoStupidQuestions/comments/vovbuv/who_was_the_woman_who_took_instructions_too.json": "As a kid I remember reading about a woman who would always follow instructions\nto the tee. For example, if you told her to string the beans, she would\nliterally take some string and string them up like she was putting clothes out\nto dry. If you told her to mop every inch of the house, she would do…",
  "data/reddit-ask/r/askscience/comments/votq8u/gases_and_liquids_are_fluids_but_solids_arent.json": "Most of my search results are giving me information on blood plasma, and I’m not\nfinding a clear yes or no about the kind of plasma I actually want to know\nabout. Is the definition of fluid absolutely applicable to plasma the same way\nit is for liquids and gases, or is it just used as a theoretical…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/vp50dd/how_do_i_handle_a_ring_thats_way_too_expensive.json": "Yesterday, my long-term boyfriend proposed, and I’m incredibly excited about it.\nHowever, his parents bought him the ring, and I’m really uncomfortable with it.\n\nI knew his parents had money, but they’re very low key people, so I just assumed\nthey don’t spend. But I’m pretty close with them, as is…",
  "data/reddit-ask/r/askscience/comments/voz867/how_are_cancer_rates_going_up_when_weve_made.json": "as the title says, it just seems like cancer rates are going up, but we've made\ntons of regulations, warnings and other things to show, limit or stop use of\ncarcinogens. to me this means cancer rates should trend down. but they're not??\nwhat would cause this in modern society??? are genes less…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/vpe6es/what_does_it_mean_that_some_days_im_totally.json": "I know it sounds weird but I have inconsistent emotions about my boyfriend. He’s\na wonderful guy and many days I feel like I couldn’t imagine life without him,\nbut then there are other days that I find myself asking if I really want to be\nin this relationship. There won’t be any particular event or…",
  "data/reddit-ask/r/AskHistorians/comments/vpbc0j/in_a_recent_linkedin_post_bill_gates_shared_his.json": "LinkedIn post is here\n[https://www.linkedin.com/posts/williamhgates_whether-youre-a-recent-grad-or-a-college-activity-6948310563722579970-6qrH/]\n(will remove if I'm breaking any rules)",
  "data/reddit-ask/r/askscience/comments/vp7luv/how_does_mixing_magmas_of_different_types_cause.json": "I've read from several different sources that when a fresh injection of basaltic\nmagma intrudes into a more silica-rich magma chamber under a volcano, some sort\nof reaction happens that ultimately leads to a large explosive eruption. I've\nspecifically heard this implicated for the 19th century…",
  "data/reddit-ask/r/askscience/comments/vpdumo/will_a_small_puncture_at_a_vein_cause_more.json": "I was trimming bushes when I noticed a small thorn stuck itself into my knuckle.\nMy finger looked normal and didn't hurt, so I removed the small thorn and\ncontinued trimming. 30 seconds or so later I raise the same hand up again and\nnoticed I had blood all over the finger, and some had dripped onto…",
  "data/reddit-ask/r/askscience/comments/vpduvd/what_happens_after_a_hormone_binds_with_a_receptor.json": "For example: Insulin binds to the insulin receptor, which causes a chain of\nevents to happen to ultimately move GLUT4.\n\nAfter insulin binds to the receptor, what happens to insulin itself? Does it get\nreleased from the receptor? Absorbed? Does it change/get recycled? Break down?",
  "data/reddit-ask/r/AskHistorians/comments/vpevr4/what_was_wrong_with_anglosaxon_poetry.json": "In Good-Bye to All That, Robert Graves talks about his time at Oxford right\nafter the Great War. He says that “The Anglo-Saxon lecturer was candid about his\nsubject: it was, he said, a language of purely linguistic interest, and hardly a\nline of Anglo-Saxon poetry extant possessed the slightest…",
  "data/reddit-ask/r/AskHistorians/comments/vpkkpa/which_modern_languages_would_be_mutually.json": "My immediate guess would be Hebrew due to its lack of day-to-day use in the\nintermediate time (maybe leading to less linguistic drift?), But what about\nArabic? Farsi? Mandarin? Hindi? Greek?\n\nBonus question: what language is mutually intelligible with its past counterpart\nthe farthest back that we…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/vpjgln/if_a_girl_ask_you_if_you_have_a_girlfriend_what.json": "Ok so the last day of school this girl that I am friend with came up to me and\nasked if I had a girlfriend I said no then she said nothing else so I think she\nwas like trying to ask me out but there a chance not .",
  "data/reddit-ask/r/TooAfraidToAsk/comments/vpsz7x/how_do_i_15m_ask_my_grandmother_for_male_grooming.json": "I don’t know if this is the right place for this question but I hope it is. I\nwant to ask my grandmother for something to tame my jungle with but I don’t know\nhow to ask without it being awkward. I can’t get them for myself and she is my\nonly parent. Any advice?",
  "data/reddit-ask/r/NoStupidQuestions/comments/vpjzff/why_are_aliens_always_naked.json": "In every form of media I’ve seen where aliens are intelligent enough to invent\nuniversal travel I don’t understand how they skipped the clothing part. Like,\nit’s not rocket science even though they’ve conquered that already. Pls halp",
  "data/reddit-ask/r/NoStupidQuestions/comments/vpohqt/how_the_hell_can_people_afford_to_live_on_their.json": "I assume this isn't even possible without roommates and a part-time job at the\nleast, but I want to know how most other people manage to pull it off?\n\nAnd don't say you have to be born into wealth.\n\nIs it even possible without some type of other financial aid or loans? How do\nyou afford rent?",
  "data/reddit-ask/r/NoStupidQuestions/comments/vpqp0l/whats_the_difference_between_everyone_and.json": "Thank you Reddit, you just made a non-English speaking persons, linguistic life,\nmuch easier!",
  "data/reddit-ask/r/askscience/comments/vptiys/will_the_universe_turn_out_to_be_very_different.json": "What if the speed of light is much slower or much faster than it is? Would the\nuniverse turn out to be different? My guess is that the speed is an arbitrary\nconstant and its value may not matter but I am not sure.",
  "data/reddit-ask/r/askscience/comments/vpqiqy/if_a_tunguskalike_meteoroid_impact_event_happens.json": "Everywhere I look up the Tunguska event of 1908, it seems to suggest that a\nmeteoroid of this size impacts Earth every few hundred years. Some go so far as\nto put it at around every three hundred years. But I couldn't find references to\nany other impact event of this scale from the last two…",
  "data/reddit-ask/r/NoStupidQuestions/comments/vpsz3v/why_do_americans_lie_about_the_number_of.json": "I see a LOT of posts here saying that the UK has extreme knife murder issues.\n\nI am confused. Do people just pull this stuff out of their arse, or is there an\nagenda?\n\nNot only is the murder rate in the UK 1/5th that of the US, but knife murders\nhappen at a rate roughly 50% that of the US.\n\nBoth…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/vpw9qp/what_do_i_do_when_my_gynecologist_sticks_up.json": "I’m scheduled to have a transvaginal ultrasound soon, and it’s my first time\ngetting checked by an OB-GYN. Plus, I’m not sexually active (am 19) so it might\nbe hard to insert the device (& me not being relaxed lol). Those who have had\nit, were you having convos with your doctor? Saying oh’s and…",
  "data/reddit-ask/r/askscience/comments/vpxsx9/what_is_denser_a_black_hole_or_a_neutrons_star.json": "Thank you.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/vq5d2n/i_make_32_grand_a_year_and_still_feel_poor.json": "I feel spoiled and ungrateful to even ask this question",
  "data/reddit-ask/r/TooAfraidToAsk/comments/vq5pc3/is_this_a_red_flag_or_is_my_bf_just_a_bit_too.json": "I had a birthday dinner with my friends and family, I thought it would be nice\nfor my boyfriend to come along and meet them as well. I invited my friend\n(Female) and she's gorgeous, that's not a question. My boyfriend has always been\noutgoing, likes to everyone. Doesn't matter the gender and the…",
  "data/reddit-ask/r/NoStupidQuestions/comments/vq9in0/was_it_normal_as_a_kid_growing_up_in_the_90s_to.json": "Now a days no one gets spanked like this but I think in the 90s it was pretty\nnormal to get your ass whooped."
}