{
  "data/reddit-stocks/r/wallstreetbets/comments/wd2yb1/i_think_my_husband_might_have_committed_insider.json": "I am going to be intentionally vague in this post . . .\n\nI am speaker of the house and my husband is an ape. He was squeezing my huge\nsand bags one night a few weeks ago and I mentioned I was working on a bill that\nsubsidized microchip companies.\n\nNext thing I know, this ape goes wild on chip…",
  "data/reddit-stocks/r/stocks/comments/wd6mxt/the_stock_market_could_surge_18_to_new_highs_by.json": "https://markets.businessinsider.com/news/stocks/stock-market-outlook-bear-market-over-new-sp500-highs-fundstrat-2022-7\n\nThe stock market could be gearing up for new record highs before year-end as the\n2022 bear market is over, Fundstrat's [https://fsinsight.com/] Tom Lee said in a\nnote on…",
  "data/reddit-stocks/r/stocks/comments/wd42ed/need_a_devils_advocate_but_realistic.json": "23m sitting on about 37k portfolio, 10k roth and making 70-80k a year.\n\nMy current strategy is to buy june 2024 options (50c / 60c ) on big tech.\nCurrent positions are 2x aapl, 1x googl, 1x amzn.\n\nHow i see it, if the Companys trade flat for 2 years, i only lose 1-2% of the\ntheta premiums I’ve been…",
  "data/reddit-stocks/r/stocks/comments/wdemqb/apple_nabs_key_lamborghini_executive_to_work_on.json": "> Apple Inc. has enlisted one of Lamborghini’s top car-development managers in a\n> sign that it’s stepping up work on a self-driving electric vehicle, according\n> to people with knowledge of the situation.\n> \n> The company hired Luigi Taraborrelli, a 20-year veteran of the Italian\n> carmaker, to…",
  "data/reddit-stocks/r/stocks/comments/wd6oyq/earnings_for_the_first_week_of_august_2022_expect.json": "Let me know if I missed any important ones or tickers you baghold.\n\nMonday:\n\n * Energy: Devon (DVN), Diamondback (FANG), Williams Companies, Inc (WMB)\n * Agriculture: Mosaic (MOS, fertilizer), CF (fertilizer)\n * HSCB\n * Activision (ATVI)\n * Pintarest (PINS)\n * Mitsubish (MUFG)\n * Avis Budget Group…",
  "data/reddit-stocks/r/wallstreetbets/comments/wdd77q/is_it_normal_for_a_broker_to_be_way_too_late.json": "So I have some shares, and that company did a stock split and dividend. Ex\ndividend date was the 18th and delivery date the 22nd of July.\n\nWhen I didn't receive my shares I contacted my Belgian bank and they told me\nthat the pay date was the 26th of July and that their broker would book the\nshares…",
  "data/reddit-stocks/r/investing/comments/wde01j/dividend_aristocrats_etf_vs_sp_any_historical.json": "I have a pretty standard all market portfolio atm but am thinking to offload\nsome of my allocations into SCHD for a low expense dividend focused ETF. In the\nprocess though I became curious if it’s such a good move. My goal would be to\nhave a significant stream of dividend income in 10yrs by…",
  "data/reddit-stocks/r/Bogleheads/comments/wdef45/should_i_sell_my_last_stock.json": "I purchased 10 shares of a stock for $350 before I stumbled upon the Boglehead\nphilosophy and I don't know if I should sell it or not. It's price has\ndepreciated more than 10% from when I bought it.\n\nI'm still young (23M) and I won't need the money for a really long time. So a\npart of me thinks…",
  "data/reddit-stocks/r/stocks/comments/wdkarg/us_factories_grow_at_slowest_pace_in_two_years.json": "A key barometer of American factories fell to a 25-month low of 52.8% in July in\na sign of creeping weakness in the U.S. economy. The good news? Inflation\npressures eased. The Institute for Supply Management’s closely followed\nmanufacturing gauge dipped from 53% in June, in no small part due to…",
  "data/reddit-stocks/r/Bogleheads/comments/wdlo7t/need_advice.json": "Longtime client and big fan but I've really lost faith in Vanguard.\n\nMy wife's mother died and left a VG trust to her 3 daughters. About half VFIAX\nand half cash.\n\nThey had a conference call to divide it 3 ways.\n\n\n\nStarted:\n\n * Trust = VFIAX & Cash\n\nA few days later:\n\n * Sis 1 = 1/3\n * Sis 2 = 1/3\n…",
  "data/reddit-stocks/r/wallstreetbets/comments/wdkw51/psa_we_could_be_losing_the_greatest_trader_of_all.json": "Just wanted to get the word out that Nancy Pelosi is going ahead with her Taiwan\nvisit and Winnie has threatened to shoot her plane down. I estimate the entire\nmarket could be effected by such a move as the rest of congress will have to\npick up the insider trading and I’m not sure they’re as good…",
  "data/reddit-stocks/r/stocks/comments/wdmmdk/tesla_tsla_surges_higher_ahead_of_stock_split_vote.json": "Tesla’s stock (TSLA) is surging higher ahead of its shareholders voting on a\nstock split later this week. The company announced its intentions to do a stock\nsplit back in March 2022. And last month, Tesla revealed its intentions for a\n3-for-1 stock split, if approved by shareholders. The vote is…",
  "data/reddit-stocks/r/Bogleheads/comments/wd4e0w/how_does_one_retire_with_taxable_and_non_taxable.json": "I’m interested, do you get some email saying “congratulations! You’re now ready\nto start pulling funds out”\n\nDo you start to just pull out as much is necessary? What if the market is at a\ndownturn?\n\nIs 59 & a half really the earliest we can pull out?",
  "data/reddit-stocks/r/investing/comments/wdszaa/personal_investment_or_llc.json": "Hello all I have the opportunity to invest in a business. I've reviewed the\nbusiness plan, met with the leadership, and investigated the market for the\nproduct. I feel this company is worth the investment.\n\nMy question is should I do my investment as a personal Investment or should I\nset up an LLC…",
  "data/reddit-stocks/r/stocks/comments/wdr05o/what_companies_have_the_most_trustworthy.json": "Example reasons:\n\n * Guidance is consistently accurate or conservative\n * Significantly cut down costs\n * Retains high quality employees/executives due to culture\n * Issues are communicated to investors clearly and well in advance\n * Management minimizes shareholder dilution\n * Navigates difficult…",
  "data/reddit-stocks/r/wallstreetbets/comments/wdsr8o/mfw_i_have_to_work_50x_harder_for_half_the_reward.json": "wake up babe, time to pay 50% increase in rent since 2020",
  "data/reddit-stocks/r/stocks/comments/we08cr/can_i_direct_register_the_shares_i_have_in_every.json": "With all I've read about GME fuckery, I've just lost faith in the market and I'm\nnot sure I want anything I'm invested in to be used for any purpose other than\nfor the benefit of myself and the companies I bought into. Can anyone discuss\nall this stuff with me, straight up explain the finer points…",
  "data/reddit-stocks/r/stocks/comments/wdjy1z/best_stocks_for_new_investors.json": "I am a 16 year old male and my mother has given permission to use her name to\ninvest in stocks. I have been doing my research and I am confused to how to\ncorrectly identify an undervalued stock and if it’s going to go up\n\nI really want to understand this to a greater depth and want to know how…",
  "data/reddit-stocks/r/Bogleheads/comments/wdsam4/taking_control_of_my_roth_ira_at_19_start_over.json": "Hi,\n\nI \"got into\" investing when I was a bit younger and somehow convinced my dad to\nmake me a roth IRA. With some money I made from part time jobs and his own\ncontributions over the years, it now looks like this:\n\n- 30% FNILX\n- 40% FXAIX\n- 30% FZROX\nValue: ~$1000\n\nI wasn't very consistent on…",
  "data/reddit-stocks/r/stocks/comments/wdxg9h/do_you_believe_this_rally_is_another_headfake.json": "So the question is, have we already hit bottom for 2022? If you're buying\nindividual stocks or pouring money into ETF's, you probably think we've already\nhit bottom. However, others believe this is just a temporarily rally, with much\nmore pain headed our way. Including new 52 week lows for just…",
  "data/reddit-stocks/r/Bogleheads/comments/wdw9dm/almost_caught_myself_slipping_today.json": "I have about $17K I lump summed 6 months ago into mostly VT and VXUS and my\nlowest has been down $2K and now I’m just about to break even… I try not to\ncheck my balance but today I had the strangest urge to sell everything based on\nthis monkeypox business and buy in case of a COVID -like…"
}