{
  "data/reddit-stocks/r/investing/comments/ufsnuy/warren_buffett_says_markets_have_become_a.json": "https://www.wsj.com/articles/warren-buffett-says-markets-have-become-a-gambling-parlor-11651340230?mod=hp_lead_pos2\n\n“It’s a gambling parlor,” Mr. Buffett said Saturday of the markets over the past\nfew years. He added that he blamed the financial industry for motivating risky\nbehavior among…",
  "data/reddit-stocks/r/stocks/comments/ufxal8/the_stock_market_is_the_greatest_tool_to_build.json": "Look everyone's portfolio is likely looking red, so here's what you need to do:\nLikely doing nothing for now is the right move. Don't sell at a loss. Work more\nhours so you have more money to buy solid, economy defining stocks at a fraction\nof their price they once were and build your retirement…",
  "data/reddit-stocks/r/stocks/comments/ufsocn/warren_buffett_says_markets_have_become_a.json": "https://www.wsj.com/articles/warren-buffett-says-markets-have-become-a-gambling-parlor-11651340230?mod=hp_lead_pos2\n\n“It’s a gambling parlor,” Mr. Buffett said Saturday of the markets over the past\nfew years. He added that he blamed the financial industry for motivating risky\nbehavior among…",
  "data/reddit-stocks/r/stocks/comments/ufy5e8/buffet_finally_starting_his_buying_spree.json": "After watching Berkshire hold their massive cash pile without significantly\ndeploying for years, we are now seeing Buffett make some significant moves. As a\nBerkshire holder I’m excited to see big guys outside of share buybacks. I think\nit’s also worth noting that the notorious value hound is…",
  "data/reddit-stocks/r/stocks/comments/ug3sdi/just_a_friendly_reminder_that_nobody_knows_what.json": "Hello guys!\n\nThe last weeks have been stressful for a lot of folks out there. Some are\nalready calling the bottom, and some are already calling an incoming 30%\ncorrection of SPY. Even the best funds and individuals underperform in the last\nsix months - starting from Nancy's calls to Ackman's…",
  "data/reddit-stocks/r/investing/comments/ufxrja/anyone_investing_in_ev_battery_industry_etfs.json": "The global electric vehicle battery market is projected to grow from $27.30\nbillion in 2021 to $154.90 billion in 2028 at a CAGR of 28.1% in forecast\nperiod.\n\nSauce:https://www.fortunebusinessinsights.com/industry-reports/electric-vehicle-battery-market-101700\n\nSo, I'm looking to park some cash for…",
  "data/reddit-stocks/r/stocks/comments/ufxovr/can_a_true_squeeze_really_happen_with_circuit.json": "I'm not into memes but I'm just curious how this works. I've seen several stocks\nstart to squeeze then get halted. Once they're trading again people tend to sell\noff, so they lose momentum. I'm thinking even the best set up for a short\nsqueeze can't happen with them getting halted like this. Maybe…",
  "data/reddit-stocks/r/stocks/comments/ug7ce0/elon_musk_has_583_of_his_entire_net_worth_pledged.json": "He has over 159 million Tesla shares pledged as collateral for loans. $140\nBillion USD. 58.3% of his net worth. If there is an extreme drop in Tesla's\nshare price those loans will be called and depending on the price of Tesla at\nthe time it could financially ruin him.\n\nDiscuss.",
  "data/reddit-stocks/r/investing/comments/ug94nb/how_does_a_stock_split_help_the_company_if_it_has.json": "I keep seeing the explanation that a stock split is useful for a company because\nit lowers the share price to a level where more people are willing / able to\ntrade it.\n\nMy question is how does this affect the company in any way? I thought IPOs raise\nmoney in the original offering, and then…",
  "data/reddit-stocks/r/investing/comments/ug90qf/portfolio_of_factset_sp_500_predictions_of.json": "See S&P 500 Predictions Weekly chart at the bottom of the\nhttps://insight.factset.com/through-the-looking-glass-predicting-sp-500-constituent-changes\n\nI do not have access to this API but is there any other way to invest in that\nportfolio for a retail investor?",
  "data/reddit-stocks/r/Bogleheads/comments/ug1qww/hedging_against_the_building_and_construction.json": "u/The_SHUN [/u/The_SHUN] brought up an interesting idea of hedging against his\nindustry and I thought about it overnight.\n\nAs an architect (who survived the dotcom and great recession busts) I'm keenly\naware about how this industry is tightly tied to the wider economic health.\n\nI've already done…",
  "data/reddit-stocks/r/investing/comments/uge3lf/the_old_saying_of_sell_in_may_and_go_away.json": "The effect is real, and violates the efficient market hypothesis\n\nhttps://en.wikipedia.org/wiki/Sell_in_May\n\nSell in May and go away is an investment strategy for stocks based on a theory\n(sometimes known as the Halloween indicator) that the period from November to\nApril inclusive has significantly…",
  "data/reddit-stocks/r/Bogleheads/comments/ug76kh/why_did_you_pick_your_certain_fund_provider.json": "NEW to Bogle-ism.\n\nWhen it comes to a \"three fund portofolio\"... is there any diffference between\ngoing with vehicles from Vanguard vs Schwab vs Fidelity... etc.\n\nI know the MF vs ETF debate, and I understand differences in fees, but when it\ncomes to the mix of the funds, anyone have a favorite…",
  "data/reddit-stocks/r/Bogleheads/comments/ugb6uc/permanently_make_treasurydirect_password_field.json": "I can only speak for Greasemonkey and Firefox though I assume that this would\nwork the same with Tampermonkey on Chrome and maybe Edge.\n\nI've seen other posts in the sub about making the password field pasteable but I\nlike this as it's permanent and set and forget.\n\n 1. Get greasemonkey\n   …",
  "data/reddit-stocks/r/investing/comments/ug9eeh/any_investing_books_by_experienced_investors_with.json": "I feel like a successful investment has so many key elements: good business\nmodel, good management team, good (underpriced) valuation, good industry\ntailwinds, and the potential for other investors to realize the same things\nafter you. (You may find a hidden gem, but if no one else realizes it, you…",
  "data/reddit-stocks/r/Bogleheads/comments/ugg8tv/my_target_date_fund_is_down_about_as_much_as_the.json": "I guess I'm looking for some advice here. My Roth IRA is totally in FDKLX\n(Fidelity Freedom Index 2060). It's down -13.39% YTD (and down -8.88% over the\nprevious 1 year period), while the S&P 500 is down -13.86% (and actually down\n-1.45% over the previous 1 year period). I assumed that a target…",
  "data/reddit-stocks/r/wallstreetbets/comments/ug3xvl/student_loan_debts_are_going_to_be_cancelled_just.json": "So joe biden is getting more butt fucked at the polls than an average wsb trader\nis getting fucked at the stock market.\n\nits kinda helping that the media has stopped broadcasting his speeches much of\nit doesn't make absolutely any sense\n[https://www.youtube.com/watch?v=XYu6RgA8yis]. Democrats are…",
  "data/reddit-stocks/r/stocks/comments/uglthk/rumour_apple_and_intel_booked_all_tsmc_n3_2023.json": "DigiTimes is the source of the rumour, an usually well informed Taiwanese\nsemiconductor newspaper. AMD is selling 7 nm Zen 3 since 2020 and is expected to\nlaunch N5 Zen 4 later this year. If AMD N3 production capacity is delayed they\ncould decide to produce Zen 5 on N5 or N4.\n\nAMD reports 2022Q1…",
  "data/reddit-stocks/r/stocks/comments/ugnsb9/european_stock_market_flash_crash_this_morning.json": "I haven't seen a thread on the brief 'flash crash' that hit some European\nmarkets this morning. Particularly the Nordic markets:\n\n\n\n> The OMX Stockholm 30 Index slumped as much as 8% in just five minutes before\n> recovering most of the losses shortly after. The index was trading 1.1% lower\n> as of…",
  "data/reddit-stocks/r/stocks/comments/ughgxt/is_there_any_positive_news_this_coming_week.json": "I need to sell some msft and apple asap for personal reasons. I have about 4\nweeks during which this needs to happen.\n\nShould incur losses Monday and run? I am wondering if there will be any positive\nnews this week to stabilize things. I know that markets take into consideration\nthe coming…",
  "data/reddit-stocks/r/Bogleheads/comments/ugobvk/when_putting_my_emergency_fund_into_ibonds_im.json": "title",
  "data/reddit-stocks/r/stocks/comments/ugo67f/hot_takes_from_berkshirehathaway_shareholder.json": "In their 90s and still kicking. Buffett and Munger gave their best \"I told you\nso\" talks at Berkshire Hathaway’s annual shareholders meeting this weekend.\n\nBuying the dip? Berkshire scooped up $51.1 billion of US stocks during the\nmarket sell-off in Q1.\n\nFollow the money: Here's what they're…",
  "data/reddit-stocks/r/investing/comments/ugpunm/selling_stocks_in_a_high_inflation_environment.json": "Cash is a guaranteed to lose buying power.\n\nDo the sellers just think that they can time the market even though they will\nalways be late?\n\nI was talking to someone in a bar the other day and they just sold their house\nbecause they wanted to \"sell at the top\".\n\nThere are a ton of new jobs coming to…",
  "data/reddit-stocks/r/wallstreetbets/comments/ugoc3x/if_ericks_position_moves_0001_up_he_gets_a.json": "Last time TSLA rally of 7 days made it go up 34.4%. He could potentially make\n$34.4Tn in the span of a week.\n\nWhich would realistically make him the first trillionaire on this planet.\n\nBecause he bought calls.. for the company… of the guy.. that’s almost the first\ntrillionaire.\n\n…\n\nI’m buying TSLA…",
  "data/reddit-stocks/r/Bogleheads/comments/ugsceh/this_sub_has_completely_changed_my_life_thank_you.json": "I found out about index investing at the age of 20, a few months before my first\ninternship. After I found out, I put every penny of money into different index\nfunds and let it sit while i continuously invested. I worked part time for the\nsame company during my junior year of college, and then full…",
  "data/reddit-stocks/r/stocks/comments/ugtlv5/after_amzn_released_its_earnings_report_the_stock.json": "AMZN reported a first-quarter loss of $3.84 billion, or $7.56 a share. In the\nfirst quarter of last year, Amazon reported a profit of $8.1 billion, or $15.79\na share.\n\nAMZN said Thursday that it expects second-quarter revenue to be in the range of\n$116 billion to $121 billion, below the average…",
  "data/reddit-stocks/r/Bogleheads/comments/ugfe33/questions_about_the_effect_of_buybacks_on_the.json": "Okay, this might be a silly question, but I've been thinking about this for a\nfew days:\n\nLet's stick with SP500. Since 1982, companies started returning value to\nshareholders by share repurchasing (buying back their own stock) in addition to\ndistributing dividends. My understanding is that when…",
  "data/reddit-stocks/r/stocks/comments/ugvnef/eighteen_months_laterback_where_i_started.json": "I started investing in October 2020, using dollar cost averaging strategy over\nthe last several months. My profits peaked several months ago at +16k. Now it's\ndown to 1k, nearly all my profits gone. A savings account would've been better.\nTell me this is fine. I don't need the money now, and QQQ is…",
  "data/reddit-stocks/r/stocks/comments/ugxkm0/russia_looking_to_close_out_their_conflict_in_may.json": "> US intel reports Russia will try to annex Donetsk and Luhansk regions by\n> \"mid-May,\" ambassador says\n> \n> The US has “highly credible” intelligence reports that Russia will try to\n> annex the separatist-occupied regions of Donetsk and Luhansk “some time in\n> mid-May,” and that there are plans to…",
  "data/reddit-stocks/r/stocks/comments/ugzdd5/have_rental_car_prices_increased_800_how_is_avis.json": "Look at CAR price.\n\nHow is this price justified?\n\nIn 2019, I imagine travel was very robust. Stock was $40 or less. Now it's above\n$300, and might squeeze up more.\n\nAre the fundamentals justifying the price?\n\nhttps://finviz.com/quote.ashx?t=CAR&p=m&tas=0\n\nlook at this chart. It looks like a…",
  "data/reddit-stocks/r/Bogleheads/comments/ugx4aa/just_discovering_bogle_and_the_bogleheads.json": "Hi everyone. I’m 22 and looking to start investing. I’ve seen my friends lose\nsome money on some crypto/stock gambles so that turned me off from investing,\nbut looking into some more appropriate investment strategies I stumbled upon\nJack Bogle and eventually this Reddit page. I’ve only done some…",
  "data/reddit-stocks/r/wallstreetbets/comments/ugxhyn/you_guys_cannot_be_fucking_serious_with_this.json": "I cannot fucking tell if you legit believe something will happen but I swear\nhalf of you do. What the fuck , this sub is literal children somehow who got\npast the parental controls on their parents’ iPads",
  "data/reddit-stocks/r/stocks/comments/uglshd/rstocks_daily_discussion_monday_may_02_2022.json": "These daily discussions run from Monday to Friday including during our themed\nposts.\n\nSome helpful links:\n\n * Finviz [https://finviz.com/quote.ashx?t=spy] for charts, fundamentals, and\n   aggregated news on individual stocks\n * Bloomberg market news [https://www.bloomberg.com/markets]\n *…",
  "data/reddit-stocks/r/wallstreetbets/comments/uh1jzs/why_erickl0930_is_an_idiot_and_you_are_too.json": "There was a time that Ericl0930 would have just been instantly banned for being\na fucking idiot and referring to himself as a Legend.\n\nBefore you click downvote for me \"killing the fun\" realize that this whole\nsituation is about as stupid as a 5 year old writing out \"I want to buy a\nbillion tacos\"…",
  "data/reddit-stocks/r/Bogleheads/comments/uh0pa0/just_venting.json": "Just came on here vent. I made a six figure lump sum investment into ITOT and\nVXUS back in January. The market has had it's worse start to the year since\n1939. Shit is lame man. I should've waited until June. Everyone was talking\nabout the rates and how this would happen and wait until the fed…",
  "data/reddit-stocks/r/Bogleheads/comments/ugsgdg/do_you_enjoy_your_95_job.json": "as the title states, i’m curious to what extent you enjoy your job (or main\nsource of income). knowing we follow the boglehead principles is it more of a\nmeans to an end?\n\nthanks!",
  "data/reddit-stocks/r/stocks/comments/ugx9sz/if_you_had_2530k_to_invest_today_with_mid_to_long.json": "Looking at helping a family member invest some money they recently acquired.\nThey’re older and looking for something mid to long term where they can see some\ngrowth but still reasonably secure.\n\nWas thinking a general S&P500 ETF, maybe a global ETF, and they’d like to put\nsome money into individual…",
  "data/reddit-stocks/r/investing/comments/uh5r5n/is_vanguard_ever_going_to_make_their_platform.json": "It just baffles me how ancient Vanguards platform seems. The features they offer\ncompared to competitors are terrible. With them having some of the most used\nfunds in the world, why don't they invest in their website and app and make it\nas good as fidelity and M1? They would dominate the world if…",
  "data/reddit-stocks/r/stocks/comments/ugymxp/thoughts_on_cloudflare_net.json": "I’ve been watching this stock for quite some time. I’m considering starting a\nDCA into it for the next few years. I know it has quite a high valuation, but do\nyou guys think it will grow into it? What are your thoyghts on the company?",
  "data/reddit-stocks/r/stocks/comments/uh60vq/goog_amzn_upcoming_201_split.json": "Greetings All,\n\nI haven’t seen much talk about the upcoming 20:1 splits on these two stocks GOOG\n& AMZN and would like to hear your opinion on it.\n\nGOOG is set to split at the close of business July 15th\n\nAMZN is set to split at the close of business July 3rd\n\nAt the current prices, GOOG would…",
  "data/reddit-stocks/r/stocks/comments/uh5ubp/china_slaps_compulsory_measures_on_person_named.json": "https://uk.finance.yahoo.com/news/china-slaps-compulsory-measures-person-014314636.html\n\nChinese authorities in the city of Hangzhou, home base to Alibaba Group Holding\nLtd. and Ant Group Co., have imposed “compulsory curbs” on an individual\nsurnamed Ma, state broadcaster CCTV reported…",
  "data/reddit-stocks/r/stocks/comments/uh5mw4/alibaba_tumbles_as_much_as_9_in_hong_kong_after.json": "(Bloomberg) -- Chinese authorities in the city of Hangzhou, home base to Alibaba\nGroup Holding Ltd. and Ant Group Co., have imposed “compulsory curbs” on an\nindividual surnamed Ma, state broadcaster CCTV reported Tuesday.\n\nThe person, who was otherwise unidentified, was placed under the so…",
  "data/reddit-stocks/r/stocks/comments/uh2nz8/convince_me_that_the_markets_will_always_go_up_in.json": "I don't imagine this will be a very popular post here, but I want to put forward\nthe argument that there is no good reason to think that markets will always go\nup in the long term. Every argument I have heard just seems illogical to me, and\nas a result the idea of near-guaranteed long-term growth…",
  "data/reddit-stocks/r/stocks/comments/uhcvyc/citigroup_admits_causing_yesterdays_flash_crash.json": "Title says it. According to Citi, one of their traders made caused a transaction\nerror which they discovered soon after. It caused Scandinavian indices to\nplummet as much as 8% in a matter of minutes. Such errors are called fat-finger\nerror; a typo. Flash crashes like these make me wonder woth how…",
  "data/reddit-stocks/r/investing/comments/ugr3fz/importance_of_accounting_to_investing.json": "Accounting is considered to be \"the language of business\". Does that mean I'll\nbe a bad investor if I dont understand Accounting?\n\nI do understand and am able to interpret and analyze the financial statements.\nBut I lack the skill of writing up financial statements on my own.\n\nHow much accounting…",
  "data/reddit-stocks/r/stocks/comments/uh35yl/chegg_stock_plummets_32_toward_lowest_price_in_4.json": "Chegg Inc. shares plunged toward their lowest price in four years Monday\nafternoon, after the online-education company slashed an annual forecast\nprovided three months ago.\n\nChegg CHGG, +0.97% righted itself from a stock free-fall in February by\nproviding an optimistic annual forecast after its…",
  "data/reddit-stocks/r/investing/comments/uhj5q5/burger_king_parent_earnings_beat_estimates_as.json": "https://www.cnbc.com/2022/05/03/restaurant-brands-international-qsr-q1-2022-earnings-.html\n\nTicker: QSR\n\nThe linked CNBC article talks more about their growth overseas, and they also\nown Tim Horton's. Anyone have any opinions on holding this vs. something like\nMCD or PEP?",
  "data/reddit-stocks/r/wallstreetbets/comments/uh77c0/the_market_went_back_up_today_we_are_headed_back.json": "Typically, throughout history, when the market indices have quadrupled in the\nlast decade, and doubled in the last two years, it is the sign of a stable bull\nmarket that lasts for years to come.\n\nI can think of a number of precedents in history when the peak of a sustained\nparabolic trend is…",
  "data/reddit-stocks/r/Bogleheads/comments/uhabdy/i_bonds_now_set_to_deliver_962_if_bought_in_the.json": "According to news on Monday, I bonds are supposed to return 9.62% through\nOctober 2022.\nhttps://www.cnbc.com/2022/05/02/i-bonds-to-deliver-a-record-9point62percent-interest-for-the-next-six-months.html\n\nI've seen increasingly more and more topics about these bonds and they sound\ngood, but there…",
  "data/reddit-stocks/r/stocks/comments/uhowv4/advanced_micro_devices_q1_adj_eps_113_beats_091.json": "Advanced Micro Devices (NASDAQ:AMD) reported quarterly earnings of $1.13 per\nshare which beat the analyst consensus estimate of $0.91 by 24.18 percent. This\nis a 117.31 percent increase over earnings of $0.52 per share from the same\nperiod last year. The company reported quarterly sales of $5.89…",
  "data/reddit-stocks/r/stocks/comments/uhm6qp/bloomberg_motley_fool_stockpick_hacker_charged.json": " * An Idaho man who allegedly managed to access stock picks by personal finance\n   website Motley Fool before publication and made millions of dollars trading\n   on the information has been charged with securities fraud.\n * David Stone, 36, was charged Tuesday by federal prosecutors in Manhattan…",
  "data/reddit-stocks/r/investing/comments/uhjqij/buffets_view_on_leverage.json": "Warren Buffet is really old, so there is a lot of great quotable stuff that he\nhas said over the years and it's easy to miss some good ones. Over the weekend I\nheard this quote about leverage and thought it was spot on:\n\n\"My partner Charlie says there is only three ways a smart person can go…",
  "data/reddit-stocks/r/stocks/comments/uhiijd/whats_your_reason_for_not_buying_meta_fb.json": "-Top line has 2x over the last 4 years.\n\n-Bottom line growth of 68% since 2018.\n\n-24 billion dollars invested in R&D in 2021.\n\n-Facebook and Instagram are still growing and are expected to keep growing\nthrough 2023, with over 3 billion users combined.\n\n-40% of the VR games are being developed for…",
  "data/reddit-stocks/r/stocks/comments/uhn2nj/vanguard_rep_convinced_my_mom_to_move_to_an.json": "My mom is coming up on 70, and isn't very financially literate. When my father\ndied, he had a decent amount of life insurance and a retirement fund that she's\nnow living off of combined with his old pension and social security. After she\nalmost got swindled by one of her cousins into joining his…",
  "data/reddit-stocks/r/stocks/comments/uhifzj/on_october_14th_2020_cathie_woods_ark_invest.json": "Take a look: https://mobile.twitter.com/arkinvest/status/1316483578189012992\n\nConsidering their performance since this has to be a prime example of\nagedlikemilk material. She was pretty much the face of the bull run mostly based\non a crazy call with Tesla that ended up materializing I wonder if…",
  "data/reddit-stocks/r/stocks/comments/uhuaol/something_everyone_can_enjoy_robinhood_crashing.json": "We’ve seen many high growth stocks that soared post covid come crashing down but\nthis one might unite Reddit the most. Whether you hate their stupid valuation,\ntheir godawful financial performance or any other chicanery let’s all reflect on\nthe death bells for…",
  "data/reddit-stocks/r/Bogleheads/comments/uhnmgf/feeling_very_lost.json": "I posted a similar thread in the FIRE sub, but I thought I might get more\nguidance from this thoughtful group.\n\nI'm feeling very lost, discouraged, and overwhelmed right now with the situation\nwe have with our Financial Advisor.\n\nMy husband has been with this advisor for ten years. When we got…",
  "data/reddit-stocks/r/stocks/comments/uhv8y7/paul_t_jones_says_you_should_be_100_cash_now.json": "I was watching CNBC today and Andrew Sorkin had Paul Tudor Jones on. Paul said\nhe sees \"nothing good in this environment\" and that everyone should basically\n\"not own ANY stocks or bonds right now!\"\n\nHe says it's \"going to be VERY negative for both stocks and bonds\"\n\nThoughts?",
  "data/reddit-stocks/r/investing/comments/uhrknj/are_you_guys_continuing_to_buy_or_holding_onto.json": "I personally think the market will be even lower in a few months, I’m holding\ncash to buy at that time.\n\nIf you are holding out for a lower market, what is your entry point?\n\nI threw in some significant money into etfs the last few months and am down\nabout 2%. I don’t have plans to use this money…",
  "data/reddit-stocks/r/investing/comments/uhv6it/finra_proposes_limiting_access_to_leveraged_and.json": "https://finance.yahoo.com/news/finra-proposes-limiting-access-leveraged-140000511.html\n\nUnder the regulations being considered by the Financial Industry Regulatory\nAuthority (FINRA), you may not be able to buy leveraged and inverse funds and\ndozens of other popular investments deemed to be complex…",
  "data/reddit-stocks/r/stocks/comments/uhov0k/starbucks_reports_q2_fiscal_2022_results.json": "Consolidated Net Revenues Up 15% to a Q2 record $7.6 Billion\nQ2 Comparable Store Sales Up 7% Globally; Up 12% in the U.S. and Double Digits\nInternationally, ex-China\nQ2 GAAP EPS $0.58; Non-GAAP EPS of $0.59, Despite Lockdowns in China and\nInflationary Headwinds\nActive Starbucks® Rewards Membership…",
  "data/reddit-stocks/r/stocks/comments/uhsxrl/disney_discussion.json": "How do you guys feel about this stock? Is it a buy or sell? Do you guys think\nthe Florida legislation will hurt, help, or not affect it?\n\nI invested a good amount of capital into it a few weeks ago and I'm starting to\nhave second guesses. What do you all think?",
  "data/reddit-stocks/r/stocks/comments/uhysoa/i_predict_amazon_will_acquire_lyft_in_the_next_18.json": "As Lyft drops 25% to its all time low - I predict Amazon will acquire Lyft in\nthe next 18 months.\n\nLyft is five times cheaper to acquire than Uber. It has 35% of ridesharing\nmarketshare in America and is rapidly growing in Canada—two of Amazon's biggest\nmarket.\n\nCurrently, no major Western…",
  "data/reddit-stocks/r/Bogleheads/comments/uhul2s/why_is_my_ibond_interest_so_little.json": "I bought $3000 in I-Bond in October 2021, and to April 2022, it shows \"current\nvalue: $3026\". Why has it only grown $26 in 6 months??? I thought the rate I was\ngetting was 7.21%",
  "data/reddit-stocks/r/stocks/comments/uhqh7u/which_companies_could_you_see_being_acquired_by.json": "So after the markets and especially Nasdaq has nosedived over the past few\nmonths, it's made me wonder what kind of acquisitions we might see as an effect\nof market caps of pretty high quality businesses drop so hard.\n\nOne good example is Microsoft (MSFT) buying Activision Blizzard (ATVI) for…",
  "data/reddit-stocks/r/stocks/comments/uhvbad/inflation_sale_post_your_watch_list.json": "I made one of these posts in Q418\n[https://www.reddit.com/r/stocks/comments/9wkq3x/the_dips_im_buying_this_week/?utm_source=share&utm_medium=web2x&context=3]\nand March…",
  "data/reddit-stocks/r/investing/comments/uht6rg/becoming_an_accredited_investor_through_series_65.json": "I just found out you can take the Series 7, 65, or 82 exams to qualify as an\naccredited investor if you don’t qualify by wealth means. The 65 exam does not\nrequire require a FINRA sponsor so this is what I plan to study for.\n\nThis is my plan for the year as I want to invest in a hedge fund\n\nAny…",
  "data/reddit-stocks/r/stocks/comments/ui28rf/friend_with_netflix_is_down_more_than_40_i_dont.json": "I told my friend to wait for a rise and sell as they would be better off selling\nbecause I don't see Netflix recovering those 40% any time soon.\n\nWhat are your thoughts and what do you do with major losses like that?\n\nLast time I was in a situation like this I waited for a significant green day\nand…",
  "data/reddit-stocks/r/investing/comments/ui7db3/being_young_in_a_market_dip.json": "In a weird way, isn't it great for a little market dip to happen when you're in\nyour mid 20's? Personally, I'm loving the extra shares my 15% 401K contribution\nis purchasing. Also DCA'ing $SPY every month in my brokerage account. I know\ntimes are rough now and there's future uncertainty, but head…",
  "data/reddit-stocks/r/stocks/comments/ui4uts/since_everyone_seems_to_be_talking_about_recession.json": "Can someone explain how is recession a possibility? It's unlikely that Fed will\nraise rates beyond 3% and with such a neutral rate, how is recession a\npossibility? I believe the definition of recession is two consecutive quarters\nwith negative GDP growth Didn't we already have that in 2020? So what…",
  "data/reddit-stocks/r/investing/comments/ui9kwh/the_fed_is_about_to_make_history_again_today.json": "The US Federal Reserve is expected to raise its benchmark policy rate by half a\npercentage point for the first time since 2000 and formalise plans to shrink its\n$9tn balance sheet, as it embraces a more aggressive approach to tackling\nelevated inflation. What will be the consequences of this choice…",
  "data/reddit-stocks/r/investing/comments/ui95o5/airbnb_beats_estimates_with_70_revenue_growth_as.json": "https://www.cnbc.com/2022/05/03/airbnb-abnb-earnings-q1-2022.html\n\nGross booking value, which Airbnb uses to track host earnings, service fees,\ncleaning fees and taxes, totaled $17.2 billion in the first quarter, exceeding\nWall Street’s estimate of $16.54 billion, per StreetAccount. That’s up 67%…",
  "data/reddit-stocks/r/stocks/comments/ui61wj/nearly_riskfree_i_bonds_to_deliver_a_record_962.json": "https://www.cnbc.com/amp/2022/05/02/i-bonds-to-deliver-a-record-9point62percent-interest-for-the-next-six-months.html\n\nIf you're eyeing ways to fight swelling prices, I bonds, an inflation-protected\nand nearly risk-free asset, may now be even more appealing.\n\nI bonds are paying a 9.62% annual rate…",
  "data/reddit-stocks/r/Bogleheads/comments/uia00p/what_percentage_of_your_income_do_you_save.json": "Numbers aside I always heard 15-20% of your income, but I’d be interested to\nhear from the community! I’m closer to 30%",
  "data/reddit-stocks/r/stocks/comments/uiboba/lyft_plunged_as_much_as_35_the_most_ever_dragging.json": "https://ca.finance.yahoo.com/news/lyft-craters-dragging-down-uber-154409229.html\n\nLyft plunged as much as 35%, the most ever, dragging Uber down more than 12%\nafter both companies reported quarterly results that pointed to strong demand\nfor rides, but failed to reassure Wall Street that a driver…",
  "data/reddit-stocks/r/stocks/comments/uid5i3/fed_hikes_rates_halfpoint_will_shrink_assets_to.json": "The Federal Reserve delivered the biggest hike in interest rates since 2000 and\nannounced it would start shrinking its massive balance sheet next month,\ndeploying the most aggressive tightening of monetary policy in decades to combat\nsoaring inflation.\n\nThe U.S. central bank’s policy-setting…",
  "data/reddit-stocks/r/stocks/comments/uid1yd/what_happened_to_disney.json": "Im out of the loop can anyone sum it up? So until 2019 they were a really nice\ncompany, dinamically growing revenue, EPS and with a decent P/E as well (between\n10-20). Then covid happened.\n\nTheir movies are more famous than ever. Disney+ is growing. Was disneyland the\nmajority of their profit…",
  "data/reddit-stocks/r/stocks/comments/uid7z6/fed_delivers_50_basis_point_rate_hike_biggest_in.json": "The Federal Reserve made its largest rate hike in more than two decades\nWednesday, while confirming plans to reduce its $9 trillion balance sheet, but\nadded that follow-on moves would be 'appropriate' to the health of the broader\neconomy.  \n\nThe Fed lifted its Fed Funds rate by 50 basis points, to…",
  "data/reddit-stocks/r/investing/comments/ui7l8i/predicting_the_2023_recession.json": "“With current solid fundamentals, in particular a very strong labor market, if a\nrecession does come it would likely not be until 2023 or even 2024.“ — Gus\nFaucher, Chief Economist, PNC Financial\n\n“The US economy is expected to take a major hit from the extra Fed tightening by\nlate next year and…",
  "data/reddit-stocks/r/wallstreetbets/comments/ui61pu/finra_is_considering_restricting_access_of_small.json": "A radical and unprecedented threat by regulators could affect your right to buy\ndozens of popular public investments deemed to be “complex.”\n\nUnder the regulations being considered by the Financial Industry Regulatory\nAuthority (FINRA), if some public securities are deemed to be “complex”, you…",
  "data/reddit-stocks/r/stocks/comments/ui2oq2/rstocks_daily_discussion_wednesday_may_04_2022.json": "These daily discussions run from Monday to Friday including during our themed\nposts.\n\nSome helpful links:\n\n * Finviz [https://finviz.com/quote.ashx?t=spy] for charts, fundamentals, and\n   aggregated news on individual stocks\n * Bloomberg market news [https://www.bloomberg.com/markets]\n *…",
  "data/reddit-stocks/r/Bogleheads/comments/ui5jn7/overweighting_smallcap_value_emerging_markets.json": "I'm exploring the idea of tilting my portfolio toward SCV and EM to achieve\ngreater diversification and higher returns over the long-term, by taking on more\nrisk. I'm 29 years old, and this would be held in a tax-advantaged account.\n\nI've based my allocation on the Ben Felix portfolio, but have…",
  "data/reddit-stocks/r/Bogleheads/comments/uig18s/npr_planet_money_did_a_piece_on_ibonds.json": "guess I-bonds are mainstream now : )\n\nhttps://www.npr.org/2022/05/03/1096314685/a-secret-weapon-to-fight-inflation\n\nthey should have asked u/misnamed [/u/misnamed] to be the expert though",
  "data/reddit-stocks/r/stocks/comments/uif4xv/fed_chair_takes_any_interest_rate_increases_above.json": "The stock market has responded positively after Fed Chair Powell took interest\nrate raises above 50 basis points off the table. This adds a level of comfort\nand reliability for investors who were concerned that the Federal Reserve has\nbecome too hawkish. It will be interesting to see if today's big…",
  "data/reddit-stocks/r/stocks/comments/uid196/what_is_motley_fool_and_are_they_trolling_their.json": "I am new to stocks and try to find sources to educate myself about (certain)\nstocks. After looking into Tilray (as an example) I noticed that several\nsides/sources appear to upload articals that literally use the same info but in\none instance praise the stock for it and in another warn of their…",
  "data/reddit-stocks/r/stocks/comments/uii65e/why_are_stocks_up_after_an_interest_hike.json": "New to investing, can you guys explain to me why stocks are up today after the\nfed increased interest rates? Correct me if I’m wrong, but doesn’t rising\ninterest rates mean less people borrowing money to put into stocks, resulting in\nstocks going down? Thanks.",
  "data/reddit-stocks/r/stocks/comments/uifq0q/should_i_take_my_money_out_of_robinhood.json": "Hi - noob here new to investing.\n\nI opened a Roth IRA about a year ago with Vanguard, have a retirement account\nthrough Voya with my work, and have been DCA'ing the rest of my investments in\nRobinhood (now at ~$20k). I see people on here talk about Robinhood as a bad\napp/only to be used for fun but…",
  "data/reddit-stocks/r/stocks/comments/uinxs4/us_delisting_register_adds_80_more_companies.json": "The US Securities and Exchange Commission on Wednesday added dozens of Chinese\ncompanies – including new economy giants like JD.com, NetEase and Pinduoduo – to\nits list of shares that face expulsion from stock exchanges because of Beijing’s\nrefusal to allow auditing access.\n\nOne of China’s largest…",
  "data/reddit-stocks/r/stocks/comments/uiuj6b/70_of_the_time_stocks_go_down_the_day_after_a.json": "Want to make a short-term gain in your stock market trading? Buy SPXU which will\nshort the SP500. So if the S&P500 goes down you make money.\n\nI did a careful and comprehensive historical review of stock market gains and\nlosses on the days after a large- 2% or more- gain. About 70% of the time…",
  "data/reddit-stocks/r/wallstreetbets/comments/uicknf/fed_decides_for_a_50_bp_rate_hike.json": "The federal reserve bank has decided for a 50 bp rate hike and expects ongoing\nincreases in interest rates going forward\n\nhttps://www.cnbc.com/2022/05/04/fed-raises-rates-by-half-a-percentage-point-the-biggest-hike-in-two-decades-to-fight-inflation.html",
  "data/reddit-stocks/r/Bogleheads/comments/uiwxa5/the_best_part_of_being_a_boglehead_i_dont_have_to.json": "The markets and the entire investing landscape is so complex and there is so\nmuch to learn. I'm lazy. I don't want to learn any of that stuff. Earnings,\ndebt, profits, when to buy and sell, evaluating companies, blah blah. Who cares\nabout any of that? I don't. And even if I did, how would I beat…",
  "data/reddit-stocks/r/investing/comments/uioeik/where_is_a_decent_place_to_park_cash_these_days.json": "Over the past few years, I have moved my univested cash around a lot, mostly due\nto the interest rate changes. Savings account rates were over 2.5% a few years\nago, now lucky to get 0.7%. However, with the fed increasing rates 0.5% a few\nhours ago, that may change. Money market rates still suck.…",
  "data/reddit-stocks/r/investing/comments/uir5s6/investing_in_stocks_vs_purchasing_a_more.json": "What are your thoughts on using your savings for purchasing a more expensive\nhouse (your savings would go towards the down payment) as opposed to investing\nin stocks?\n\nI've read conflicting material on the internet as to which has the better yield.\nIt definitely depends on where you buy a house…",
  "data/reddit-stocks/r/stocks/comments/uiz9kf/the_nasdaq_was_up_319_on_wednesday_and_has_fallen.json": "Let's take a look at the state of the market today:\n\nAMZN -7%,\n\nTSLA -6.2%,\n\nGOOGL -5.4%,\n\nAAPL -4%,\n\nMSFT -4.6%,\n\nNFLX -6.2%,\n\nFB -6%,\n\nNVDA -7%,\n\nAMD -6%,\n\nQCOM -6%\n\n....\n\nTechnology stocks fell across the board, VIXY rose 9%, and even financial and\nbanking stocks generally fell better than 2%.…",
  "data/reddit-stocks/r/stocks/comments/uivkce/shopify_reports_1q_financial_results.json": "First-Quarter Financial Highlights\n\n * Total revenue in the first quarter grew 22% to $1.2 billion, which represents\n   a two-year compound annual growth rate of 60%. The first quarter of 2021\n   marked the highest revenue growth in the company's history as a public\n   company.\n\n * Monthly…",
  "data/reddit-stocks/r/stocks/comments/uizmxc/for_the_first_time_airbus_is_now_worth_more_than.json": "Or in other words, Boeing now worth less than Airbus. Airbus reported stellar\nearnings today, causing the stock to rise 7% and pushing it's market cap above\nthe one of Boeing. Also they announced that by 2025 they are planning to be\nproducing 75 A320s a month, compared with 50 a month now.\n\nBoeing…",
  "data/reddit-stocks/r/investing/comments/uizkxs/the_stock_market_is_a_total_joke.json": "Up 3% yesterday, down 3% this morning. How does any of this make any sense\nanymore?\n\nCan anyone explain these wide market swings? At this point, they’re starting to\nseem arbitrary to me. But, then again, I’m just a passive trader trying to\nscrape together enough to maybe retire one day. What do I…",
  "data/reddit-stocks/r/stocks/comments/uj0na5/is_today_the_day_a_5_decrease_in_the_qqq_and_4.json": "These are large downward movements for QQQ and VTI, and while I'm not an analyst\n(and DO hold positions in both of these); similar movements are tied to some\nprevious downturns in the market - at least on early catalyst days.\n\nAn additional note: I get that this isn't a crypto related subreddit,…",
  "data/reddit-stocks/r/stocks/comments/uitnel/rstocks_daily_discussion_options_trading_thursday.json": "This is the daily discussion, so anything stocks related is fine, but the theme\nfor today is on stock options, but if options aren't your thing then just ignore\nthe theme and/or post your arguments against options…",
  "data/reddit-stocks/r/stocks/comments/uj54pb/the_best_thing_that_can_happen_in_your_20s_and.json": "For you 30 year olds who are probably making more money now than you were in\nyour 20s. Or for you 20 year olds who may not be making as much as you would\nlike but are saving by living at home, saving your money. Now is not the time to\nbe wishing the market would be at an all time high. Now is the…",
  "data/reddit-stocks/r/stocks/comments/uj2q6d/is_this_dotcom_20_2000_again.json": "Hi, as a longtime lurker on here curious to hear your guys’ thoughts. Obviously\nwe can all see the shitshow in the markets today, which prompted me to post\nthis.\n\nYTD the Nasdaq 100 is down >20%. Across the wider Nasdaq the situation is worse\nin that big tech is holding up the index, with numerous…",
  "data/reddit-stocks/r/Bogleheads/comments/uj4z4b/dr_william_bernstein_just_quietly_destroyed_the.json": "I have always found Dr. Bill Berstein to be among the most brilliant and least\nrigid of the experts that the Bogleheads regularly turn to. He just did a\nTwitter Space inverview sponsored by Bogleheads which you can hear at\nhttps://twitter.com/i/spaces/1rmGPgNWXRMKN?s=20. It is well worth listening…",
  "data/reddit-stocks/r/investing/comments/uj5qds/remember_it_will_all_be_fine_dont_panic_just_keep.json": "If you thought the SPX was gonna go up at 4400 you still think it will go up at\n4000 and you definitely think it will go up at 3000. It might take a while. Add\nmoney you can miss on the downturn. And keep steady.\n\nIf you think the SPX would've gone to 5000, it will still. The fact that it's\ngoing…",
  "data/reddit-stocks/r/stocks/comments/uj59tb/is_this_what_a_true_bear_market_feels_like.json": "Been in the stock market for only 2.5 years, I was lucky to get in after the\npandemic crash so I'm still in the +ve (plus Im hedging my position with SQQQ).\n\nI'm curious that if this is what a bear market feels like? The sentiment,\neveryone's griefing, ppl struggling and keep telling ppl to…",
  "data/reddit-stocks/r/stocks/comments/uj6w6p/cloudflare_q1_2022_earnings.json": "https://cloudflare.net/news/news-details/2022/Cloudflare-Announces-First-Quarter-2022-Financial-Results/default.aspx\n\nHighlights:\n\nRevenue: Total revenue of $212.2 million, representing an increase of 54%\nyear-over-year.\n\nGross Profit: GAAP gross profit was $165.1 million, or 77.8% gross…",
  "data/reddit-stocks/r/investing/comments/uj16c3/us_dollar_index_hits_highest_level_since_2002.json": "I remember just a year back how many posts we were getting on here discussing\nimminent devaluation of the US dollar, or how the US dollar was collapsing. At\nthat time, the dollar was down maybe 10% from the spike it took during initial\ncovid lockdowns, so it was never really a real thing aside from…",
  "data/reddit-stocks/r/investing/comments/uj2haj/this_is_now_the_worst_drawdown_on_record_for.json": "https://www.bloomberg.com/news/articles/2022-03-23/global-bond-losses-deepen-to-11-from-2021-high-most-on-record\n\nGlobal bond markets have suffered unprecedented losses since peaking last year,\nas central banks including the Federal Reserve look to tighten policy to combat\nsurging inflation.\n\nThe…",
  "data/reddit-stocks/r/Bogleheads/comments/uj8it0/what_you_dont_want_to_do.json": "Is listen to Cathy Woods when investing. She and surprisingly Elon Musk slam\npassive index investing. Woods flagship fund ARKK is down 45% YTD. Yes the 5\nyear return is very good but if you can sleep with that kind of volatility then\nhave at it.\n\nhttps://www.thestreet.com/technology/elon-musk-and…",
  "data/reddit-stocks/r/investing/comments/uj2rlc/shopify_move_toward_fulfillment_centers_isnt_all.json": "Shop just acquired Deliverr for 2.1b this will enable two day delivery. Moving\ntowards a fulfillment center doesn't seem all that bad to me. Considering thats\na pain point for their clients.\n\nI feel like most people are concerned that they wont be pure tech co and ofc the\ncapex spend.\n\nWhat are…",
  "data/reddit-stocks/r/stocks/comments/uja7np/powcycle_the_next_day.json": "Hi, all.\n\nFor those who have been following my warnings in my first\n[https://www.reddit.com/r/stocks/comments/u521ic/beware_the_powcycle/?context=3]\nand second\n[https://www.reddit.com/r/stocks/comments/u9mj9o/powcycle_the_next_turn/]\nPOWcycle post, going back three weeks, I explained that \"the…",
  "data/reddit-stocks/r/stocks/comments/uja44t/hot_take_people_dont_want_to_admit_i_dont_know.json": "Throw all of it out. The notion that \"stocks always go up\" is not true. There's\nno rule written into the fabric of the Universe that says that. Historically,\nyes, stocks have gone up. Just look, we've had three major crises in the last 20\nyears (dotcom bubble, Global Financial Crisis, and Covid),…",
  "data/reddit-stocks/r/stocks/comments/ujenc8/my_case_for_buying_tsla.json": "I used to get downvoted for posts and comments about Tesla but I've noticed that\npeople are willing to discuss it more reasonably now. I welcome all points of\nview. But tonight I wrote out my Long TSLA thesis and I figured it was worth\nsharing.\n\n\n\nAssume that Tesla hits Wall Street estimates for…",
  "data/reddit-stocks/r/Bogleheads/comments/ujav0h/fellow_bogleheads_whats_your_investment_guilty.json": "In other words, what's an investment you know rationally may not be the best\ndecision, but you can't help but hold out hope (i.e. crypto, a particular stock,\na narrow sector, etc.)?",
  "data/reddit-stocks/r/stocks/comments/uj64k0/remember_it_will_all_be_fine_dont_panic_just_keep.json": "If you thought the SPX was gonna go up at 4400 you still think it will go up at\n4000 and you definitely think it will go up at 3000. It might take a while. Add\nmoney you can miss on the downturn. And keep steady.\n\nIf you think the SPX would've gone to 5000, it will still. The fact that it's\ngoing…",
  "data/reddit-stocks/r/stocks/comments/ujb8n4/why_has_most_of_brka_volume_moved_offexchange.json": "BRK.A Volume by Exchange [https://i.redd.it/jahi3igf4px81.png]\n\nI am trying to understand why/how that would happen; BRK.A is typically low\nvolume and PE/banks/insurance typically invest in it, so what would cause this?\nMajor shift started in March of last year.\n\nBRK.A Short Volume…",
  "data/reddit-stocks/r/Bogleheads/comments/ujc1ln/opinion_my_two_cents_on_fixed_income_choices_for.json": "In light of the Bernstein interview today, I wanted to throw out my own\nperspective, which somewhat aligns with his -- we share a view that bonds should\nbe for safety -- though he tends to advocate more for shorter duration and\ndoesn't seem as keen on inflation-hedged bonds (at least for younger…",
  "data/reddit-stocks/r/investing/comments/ujfo62/stagflation_etf_launches_as_fed_attempts_to_tame.json": "Quoting article from Bloomberg\n[https://www.bloomberg.com/news/articles/2022-05-04/stagflation-etf-launches-as-fed-attempts-to-tame-sky-high-prices]\n(non-paywall link here [https://archive.ph/4XBbP])\n\n> Traders worried about the Federal Reserve’s ability to tamp down ultra-hot\n> inflation without…",
  "data/reddit-stocks/r/stocks/comments/ujkf0o/arkk_not_updating_their_ytd_return_on_their.json": "ARKK is now -50% YTD.\n\nWebsite still says -29% YTD on 3/31/22.\n\nOh, I thought, maybe they just don't update the website every week? Nope. The\nNAV and daily return are updated daily on the website. Yet the YTD calc is\nalmost a week stale. So, are they deliberately not updating this YTD for almost\na…",
  "data/reddit-stocks/r/wallstreetbets/comments/ujbp0a/for_everyone_that_lost_money_or_missed_out_on.json": "Remember that the universe is 13 billion years old, the earth is 4 billion years\nold. Human beings have only been around for 200 thousand years, and civilization\nand money as we know it has only been around for 6 thousand years.\n\n10 thousand years ago your daily life would consist of a constant…",
  "data/reddit-stocks/r/stocks/comments/uj5zfo/elon_musk_and_cathie_wood_knock_passive_index.json": "https://www.cnbc.com/2022/05/05/elon-musk-and-cathie-wood-knock-passive-index-investing-saying-its-gone-too-far.html\n\nElon Musk and Cathie Wood took aim at index funds in a Twitter thread, arguing\nthat passive investments have controlled too big a percentage of the stock\nmarket. The CEO of Tesla…",
  "data/reddit-stocks/r/investing/comments/ujmcdq/is_investing_based_on_the_speculation_of_infinite.json": "While I have been in the stock market for two years, and I have seen my\nportfolio increase I now have a concern as a long term investor. Over the past\nseveral decades we have seen the S&P provide an average annual return of around\n10% greatly outpacing 3% inflation. I am concerned this can not be…",
  "data/reddit-stocks/r/Bogleheads/comments/ujedyk/has_anyone_who_followed_a_passive_index.json": "Many examples exist of people who have regrets playing stocks and timing the\nmarket, but I’ve never heard of someone regretting going with a Bogle-inspired\napproach to investing. Is this simply because the strategy works, or is it\nsomething else?",
  "data/reddit-stocks/r/stocks/comments/ujlhtg/the_counterargument_to_all_the_doom_and_gloom.json": "Warren Buffett is buying. That’s good enough for me.\n\nIn 2020, (stupid) people were roasting Buffett and Munger for not buying into a\nroaring market:\nhttps://www.fool.com/investing/2020/05/18/im-sorry-warren-buffett-im-not-buying-your-stock.aspx\n\n“We have not done anything, because we don’t see…",
  "data/reddit-stocks/r/stocks/comments/ujmq96/job_growth_accelerated_by_428000_in_april_more.json": "The U.S. economy added slightly more jobs than expected in April amid an\nincreasingly tight labor market and despite surging inflation and fears of a\ngrowth slowdown, the Bureau of Labor Statistics reported Friday.\n\nNonfarm payrolls grew by 428,000 for the month, a bit above the Dow Jones\nestimate…",
  "data/reddit-stocks/r/investing/comments/ujq7cb/every_arkk_holding_is_in_the_red_this_year_except.json": "https://www.bloomberg.com/news/articles/2022-05-06/every-arkk-holding-is-in-the-red-this-year-except-for-its-cash\n\nRemember when they started an inverse ARKK ETF specifically to bet against\nCathie Wood's picks? Why is this fund still attracting any serious attention?",
  "data/reddit-stocks/r/stocks/comments/ujnnck/how_to_protect_the_purse_during_the_stock_market.json": "First, shorting the market\n\nWant to \"short\" the stock market when you think it will keep falling? There are\na few trading platforms where you can short stocks or short the S&P 500 -\nProShares ETF ($SH ) is an option, a simple and liquid tool that allows retail\ninvestors to see their stocks as the…",
  "data/reddit-stocks/r/stocks/comments/ujoquj/my_simple_perspective_on_investing.json": "People tend to say, “if you invest in the stock market long term you will make\nmoney” but they never tell you why…I’m here to tell you that the future is going\nto be filled with technology and will only become better and faster. If you want\nto make money, Tech mutual funds (VOO, SPY, QQQ, FOCPX,…",
  "data/reddit-stocks/r/investing/comments/ujomsc/why_youre_not_going_to_see_99_bearishness_at_the.json": "I keep seeing people here claim \"as long as there are people saying DCA and buy\nthe dip, we're not at the bottom yet.\" I believe the difference is the role of\nthe internet and social media. Even in 2008, when the market crashed, there was\nnot this prevalence of online investing communities. Pro…",
  "data/reddit-stocks/r/Bogleheads/comments/ujq0oj/dave_ramseys_mutual_fund_claim_where_do_you_get.json": "Hello,\n\nI'm a \"fan\" of Dave. He did wonders for my Mom - she was in a financially shitty\nsituation and now she's doing great because of him. I follow most of what he\nsays but not everything.\n\nAnyway...\n\nI just heard Dave say \"The average american makes $60k a year. If you put away\n15% of that,…",
  "data/reddit-stocks/r/stocks/comments/ujp7f6/why_do_companies_need_to_grow_isnt_the_original.json": "These days everything is about growth. The original idea behind investing is\nthat you bought a portion of the company and then received a portion of the\nprofits. No where in that concept does it say that companies need to grow. I'd\nbe more than happy with a company having the same profits year…",
  "data/reddit-stocks/r/stocks/comments/ujwusg/a_little_bit_of_optimism_with_the_pessimism_if.json": "Although it varies depending on where you pull your information from, most\nsources will state that bear markets last on average between 280-450 days (here\n[https://www.schwab.com/resource…",
  "data/reddit-stocks/r/stocks/comments/ujjkug/rstocks_daily_discussion_fundamentals_friday_may.json": "This is the daily discussion, so anything stocks related is fine, but the theme\nfor today is on fundamentals, but if fundamentals aren't your thing then just\nignore the theme and/or post your arguments against fundamentals…",
  "data/reddit-stocks/r/stocks/comments/ujwi0q/can_anyone_explain_this_market_in_simple_terms.json": "As a 20 something who just came into my first job that will grant me disposable\nincome, I was planning to start really investing by the end of the year, when I\nam debt free. I was hunkering down, practicing, reading, watching. Then this\nhuge \"crash\". I am seeing a lot of differing opinions. Some…",
  "data/reddit-stocks/r/stocks/comments/ujw9vf/five_things_i_am_thinking_about_in_this_bear.json": "1. There is no rush. No rush whatsoever to do anything. Seriously. Just sit and\nwatch, and watch. Who cares if the market rips higher on a random day like it\ndid this week after the Fed. The Nasdaq-100 alone is down almost 25% since the\nstart of the year. Okay, so it spikes 2% in a day... it still…",
  "data/reddit-stocks/r/stocks/comments/ujzede/til_sp500_beats_arkk_in_5_year_period.json": "https://www.google.com/finance/quote/ARKK:NYSEARCA?sa=X&ved=2ahUKEwi9h-Xy-Mv3AhXpIUQIHVotDF4Q3ecFegQIHRAg&comparison=NYSEARCA%3ASPY&window=5Y\n\nSP500 5Y return: 72.12%\n\nARKK 5Y return 70.83%",
  "data/reddit-stocks/r/wallstreetbets/comments/uk0j8s/today_at_21_years_old_i_received_the_highest.json": "About 3 years ago I bought into this piece of shit company named paringa\nresources that went bankrupt. They filed for chapter 11 and all shares became\n\"share receipts\". 1 year later in 2020 they for some reason did a reverse split\nof 50 for 1 receipts, than a year later another 50 for 1 receipts…",
  "data/reddit-stocks/r/Bogleheads/comments/ujyzsv/we_know_this_but_many_very_intelligent_people_dont.json": "I found this Frontline documentary from 2013; The Retirement Gamble is about\npeople trusting \"advisors\" not knowing \"advisors\" are really sales people. Sales\npeople that may be paying 401k administrators to include high commission funds\nin the plan.\n\nThis short video is Mr. Bogle telling it like it…",
  "data/reddit-stocks/r/stocks/comments/ujxfhb/what_is_the_common_factor_of_all_the_sp_500.json": "Im not talking about unprofitable companies that are crashing, its normal for\nthose to crash. But im talking about the S&P 500 / Nasdaq 100 stocks that are\nprofitable and large. Since the nasdaq is down 20%, we'll consider anything down\nmore than 30% YTD as exceptionally crashing. What do they all…",
  "data/reddit-stocks/r/stocks/comments/ujzzzz/musk_and_twitter_are_being_sued_to_stop_their_deal.json": "The Orlando Police Pension Fund says that Musk's backing agreement with Morgan\nStanley and Jack Dorsey created an entity with over 15% of company shares,\ntriggering a poison-pill clause that will delay transfer of ownership for 3\nyears unless they get concurrence from 2/3rds of the remaining…",
  "data/reddit-stocks/r/wallstreetbets/comments/ujzcw8/goldman_sachs_dark_pools_are_under_federal.json": "Goldman Sachs' Dark Pools Are Under Federal Investigation - Franknez.com\n[https://franknez.com/goldman-sachs-dark-pools-are-under-federal-investigation/]\n\nThe SEC just released a report breaking down this Goldman Sachs investigation.\n\nThey're looking into dark pools, HFTs, management, inside…",
  "data/reddit-stocks/r/investing/comments/ujy8k2/do_you_think_ford_and_amazon_will_dump_rivian_on.json": "https://www.marketwatch.com/articles/rivian-ipo-stock-price-lockup-51651494868?mod=mw_latestnews\n\nRivian is down 72.23% YTD but they just got 1.5B to build a plant in Georgia\n\nhttps://www.marketwatch.com/story/rivian-to-get-1-5-billion-in-incentives-to-build-georgia-electric-vehicle-plant…",
  "data/reddit-stocks/r/stocks/comments/uk10oq/any_good_reason_not_to_go_100_all_world_etf.json": "As asked above: are there any good reasons not to go 100% All world ETF?\n\nI mean, statistically speaking, ETFs outperform the usual investor that tries to\noutperform.\n\nIf I want to buy and hold an ETF vs buy and hold single stocks, what are the\nreasons not to chose the etf?\n\nOf course you can argue…",
  "data/reddit-stocks/r/Bogleheads/comments/ujwzhz/can_someone_please_offer_me_some_peace_of_mind.json": "I only started investing about 6 months ago. I put about 100k of my savings into\nVTWAX. I am now down 11k dollars.\n\nI know strategy is to just hold and wait it out, but losing that much makes me\nworried. I’m only 26, so I’m guessing I have plenty of time for it to bounce\nback?",
  "data/reddit-stocks/r/stocks/comments/uk70mg/under_armour_has_biggest_plunge_in_5_years_after.json": "Under Armour said Friday that inventory fell 3 per cent in the transitional\nquarter ended March 31, and gross margin shrank to 46.5 per cent on higher\nfreight costs. '\n\nShares of the Baltimore-based company plunged 24 per cent in New York, their\nbiggest drop since January 2017. The stock has now…",
  "data/reddit-stocks/r/Bogleheads/comments/uk7yvy/recently_12_months_invested_1m_in_vti_vxus_7525.json": "I tried to dca. But picked the worst timing. The pain is real. I'm still\noptimistic but just frustrated on the timing. I planned on a 15vyear investment\nthough so hoping I don't hit the the lost decade or even worse. Someone talk me\noff the ledge",
  "data/reddit-stocks/r/investing/comments/ukaei2/nvidia_fined_55_million_by_sec_for_hiding_how.json": "Link to article from The Verge\n[https://www.theverge.com/2022/5/6/23059930/nvidia-sec-charges-fine-settlement-gaming-gpu-crypto-mining]\n\n\"Nvidia will pay $5.5 million to settle charges that it unlawfully obscured how\nmany of its graphics cards were sold to cryptocurrency miners. The US…",
  "data/reddit-stocks/r/stocks/comments/uk8csr/bear_case_against_googl_allin_with_15_year_scope.json": "Hi, I plan to invest mid 6-figures into GOOGL early next week as I'm convinced\nit won't matter in a 10-15 year timeframe. I may have to endure another 10-20%\ndrop in the meantime, but who really knows.\n\nFrom all the bear cases I've read, only the \"ads will slow during recession\"\nsticks a bit.\n\nI…",
  "data/reddit-stocks/r/stocks/comments/ukadoa/nvidia_pays_55_million_for_allegedly_hiding_how.json": "Link to article from The Verge\n[https://www.theverge.com/2022/5/6/23059930/nvidia-sec-charges-fine-settlement-gaming-gpu-crypto-mining]\n\n\"Nvidia will pay $5.5 million to settle charges that it unlawfully obscured how\nmany of its graphics cards were sold to cryptocurrency miners. The US…",
  "data/reddit-stocks/r/stocks/comments/uk3j38/as_the_nasdaq_drops_many_stocks_have_dropped_50.json": "As the Nasdaq drops, many stocks have dropped 50% or more. What are your\nthoughts on buying a tech etf of medium and small cap companies?\n\nApple, Msft have dropped but not as much and they make a large part of the\nnasdaq, so would it be better value to buy and hold an etf of medium and small\ncap…",
  "data/reddit-stocks/r/Bogleheads/comments/ukeep9/for_those_that_dont_invest_in_an_intl_fund_why_not.json": "I'm curious to hear opinions from Bogleheads who do not invest in VXUS, IXUS, or\nsimilar (maybe they don't exist?). Our very own John Bogle did not invest in\ninternational stocks, seeing too much risk, saying:\n\n“The reality is that we [USA] do better than the rest of the world. You don’t\nneed…",
  "data/reddit-stocks/r/investing/comments/ukfxps/can_someone_explain_why_buffet_thinks_bitcoin.json": "Buffet recently said at the BKR annual meeting that Bitcoin is likely to go to\nzero and he wouldn’t pay $25 for all the supply of it. I completely get being\nagainst btc and thinking it’ll go down significantly in value. I understand that\nthe crypto craze is a product of US monetary policy creating…",
  "data/reddit-stocks/r/stocks/comments/ukbh8d/what_is_your_view_on_chinese_stocks.json": "Curious what is your view on the Chinese stock market A/H/ADR shares.\n\nChina has been deemed uninvestable over the past year especially after the\ngovernment killed the entire education sector over a course of a few months.\nSince last summer, the government has been heavily cracking down on real…",
  "data/reddit-stocks/r/stocks/comments/uklg1n/forget_gasoline_diesel_is_even_more_important_to.json": "I made a post\n[https://www.reddit.com/r/investing/comments/ufio32/how_long_will_insanity_in_the_oil_markets_last/]\nlast week on insanity on the oil markets. There I summarized historic drawdowns\nin inventories, most pronounced in crude oil and distillates (including jet\nfuel, diesel). Gasoline was…",
  "data/reddit-stocks/r/Bogleheads/comments/ukdvfk/i_ran_out_of_cheese_and_its_hard_to_stop_buying.json": "I have been DCAing in a significant windfall since last August. I finally ran\nout of cash beyond my core safety amount yesterday and now have to hold. I still\nDCA in every month through my maxed out 401K, but now I have to stop buying in\nmy other accounts because I’m fully invested.\n\nIt’s hard!…",
  "data/reddit-stocks/r/stocks/comments/ukldms/how_far_do_you_think_msft_and_aapl_could_fall.json": "Ok serious questions here.\n\nHow far in your honest opinion could you see MSFT and AAPL fall?\n\nTim Seymour the other day said \"we need to see AAPL at $125 to call a bottom\" or\nsomething similar. He said $125 is a good valuation to buy AAPL.\n\nGuy Adami said \"MSFT at $260. .... Back up the truck... \"…",
  "data/reddit-stocks/r/stocks/comments/ukn9cl/apple_workers_in_shanghai_riot_over_covid.json": "During COVID lockdowns Shanghai facilities including the Apple factory kept\noperating by forcing workers to sleep in the factory.\n\n\n\nFactory workers at a Shanghai facility that makes Apple products rioted on\nThursday, clashing with guards in hazmat suits and jumping across security\nbarriers in an…",
  "data/reddit-stocks/r/stocks/comments/ukq1d0/apple_hires_31year_ford_veteran_to_ramp_up.json": "Apple Inc. has recruited a longtime Ford Motor Co. executive who helped lead\nsafety efforts and vehicle engineering, a sign the iPhone maker is again ramping\nup development of an electric car. \n\nThe tech giant hired Desi Ujkashevic for the car project, according to people\nwith knowledge of the…",
  "data/reddit-stocks/r/Bogleheads/comments/ukn72h/what_is_your_end_goal.json": "Like the title says: what is ur end goal with investing?\n\nLets say i am 100% VTWAX and been investong montly into it my whole life and its\naccumulating etf so therefore no real money comes in to ur bank account unless\nyou do something with the stock.\n\nDo you plan to:\n\n * Let your portfolio just…",
  "data/reddit-stocks/r/stocks/comments/ukjxf3/a_marathon_not_a_sprint.json": "Investing is not comparable to growing a tomato plant. It's more comparable to\ngrowing a TREE.\n\nIf you plant an apple tree or an orange tree or an avocado tree and it doesn't\nmature and produce fruit in 6 months do you get frustrated and uproot it? No, I\nhope not.\n\nShort term market volatility is…",
  "data/reddit-stocks/r/stocks/comments/ukd8xs/tsla_shorts_to_stay.json": "interesting news I came across\n\noriginal post\n[https://www.reddit.com/r/wallstreetbets/comments/ujst15/tsla_shorts_to_stay/]\n\nInterpreting this as Bill is going to keep the TSLA shorts going as the stock is\n“infinitely” overvalued in which case he has ? ? for that position which will be\na weighty…",
  "data/reddit-stocks/r/Bogleheads/comments/ukozay/what_is_your_portfolio_valueage.json": "View Poll [https://www.reddit.com/poll/ukozay]",
  "data/reddit-stocks/r/investing/comments/ukq8ni/recession_and_stagflation_investing.json": "Hi all,\n\nWith all the news about an upcoming recession, rising interest rates,\nstagflation and lost decade, where should investors park their money? I know I'm\nnot smart or informed enough to pick stocks.\n\nShould people like me keep it in index funds like VTSMX (total stock market\nfund)? Covered…",
  "data/reddit-stocks/r/stocks/comments/ukrejh/why_is_that_one_stock_still_up_so_high_from_when.json": "Hope y’all know what I’m talking about. Everything else has come back to earth\nmostly. Why is it still so elevated almost a year and a half later? It’s been\npuzzling me and has come to shape how I look at the stock market completely!",
  "data/reddit-stocks/r/stocks/comments/uktm7y/is_it_a_bad_time_to_get_into_the_stock_market.json": "I’m 24 and still living at home. Looking to invest my money. Was planning to do\nit through a financial advisor. Something like a Schwab, Morgan Stanley, etc.\nRecommendations encouraged for investing firms as well!",
  "data/reddit-stocks/r/Bogleheads/comments/ukr4pb/anyone_here_using_leveraged_etfs.json": "So I'm aware of Hedgefundie's Excellent Adventure, but it got me thinking....if\none wanted to do a traditional 60/40 portfolio and had an investment horizon of\ngreater than 20 years (and can stomach greater volatility along the way) why not\nleverage that portfolio 2x or 3x?\n\nFor example, rather…",
  "data/reddit-stocks/r/investing/comments/ukx5hk/ford_motor_is_selling_8_million_of_its_rivian.json": "Ford Motor is selling 8 million of its Rivian Automotive shares, with the\ninsider lockup for the stock of the once high-flying electric vehicle maker is\nset to expire on Sunday, sources told CNBC’s David Faber.\n\nThe automaker currently owns 102 million shares of Rivian. Ford will be selling\nthe…",
  "data/reddit-stocks/r/Bogleheads/comments/ukzk97/why_do_some_people_call_passive_investing_a_bubble.json": "I’ve heard it from Elon Musk, Kathy Wood, and honestly the only one who matters\nto me: Michael Burry.\n\nWhy do people think that passive index funds are a market bubble?",
  "data/reddit-stocks/r/stocks/comments/ul4vls/lol_why_are_you_getting_your_advice_from_reddit.json": "I'd like to quickly make a point. I've seen many posts bashing people for\nseeking advice on Reddit.\n\nSee the top comment on this post for example - someone asking about a bear case\nfor Google. They deleted the post due to ridicule on THIS…",
  "data/reddit-stocks/r/Bogleheads/comments/ul4ebm/should_relative_use_financial_advisor_or_passive.json": "My relative does not have much investment experience and is very risk-averse. He\nwill retire within 10-15 years. He has placed around $80K in a Truist investment\naccount and pays a financial advisor to manage their funds. He chose the most\nconservative allocation, so the advisor has divided the…",
  "data/reddit-stocks/r/Bogleheads/comments/ul6bti/help_i_need_to_be_able_to_explain_to_my_father.json": "My dad recommended this book. I read it in good faith but the message it teaches\nseems flawed to me.\n\nThe author shoots down and hates on 401Ks, IRAs, and index funds because of\n\"singie-digit returns\" and instead advocates for investing everything in risky\nstocks, real estate, becoming an…",
  "data/reddit-stocks/r/Bogleheads/comments/ulcs9u/i_am_slowly_falling_into_the_trap_of_selling.json": "Hello dear friends, This community is a God sent to me .I learnt a lot from this\nsub. I mean it . Personal finance , money guy and bogleheads are three places I\nattribute lot of my knowledge and success to so far . But this bear market is\nkilling me. Constantly thinking if I should sell and wait (…",
  "data/reddit-stocks/r/stocks/comments/ulcyl6/bigger_picture_if_the_fed_is_unwinding_9_trillion.json": "Is there any way to reasonably quantify how much the market could shrink, given\nwhat the fed is doing?\n\nwhat formulas are the bearest of the bears using?\n\nwhat figures are we supposed to look at?\n\nfor instance, the 10year is now at mid 2018-2019 level, and likely going…",
  "data/reddit-stocks/r/investing/comments/ul4wiq/if_the_fed_is_starting_qt_quantitative_tightening.json": "M2 money supply is shown as M2SL on Tradingview - this is a perfect geometric\ncurve that never goes down.\n\nSo even if the Fed does QT, wont overall money supply still increase as it\nalways has? And therefore over the long term liquidity will still increase and\nrisk assets go up?\n\nIm just trying to…",
  "data/reddit-stocks/r/stocks/comments/ulddep/bill_gates_says_economy_bears_have_strong.json": "Bill Gates said interest rates are likely to rise enough to cause a global\neconomic slowdown, triggered by Russia’s invasion of Ukraine and fallout from\nthe Covid-19 pandemic.\n\n“I’m afraid the bears on this one have a pretty strong argument that concerns me\na lot,” Gates said Sunday on CNN’s…",
  "data/reddit-stocks/r/stocks/comments/ukzr41/what_are_you_doing_right_now.json": "To hedge your portfolio? What are the best option strategies right now? I’m\nselling covered calls (unrealistic strike prices) so the premiums are quite low.\nAnd selling some puts on stocks I’d like to hold. Was thinking on buying SQQQ or\njust short QQQ, but I think it’s too risky. What do you hedge…",
  "data/reddit-stocks/r/stocks/comments/ul52k9/the_fear_is_becoming_overwhelming.json": "\"Don't fight the Fed\".\n\nI'm sure we've all heard this multiple times in the past 10+ years. Whenever the\nmarket grinded higher, despite whatever had caused it to go down initially,\npeople would say \"Don't fight the Fed.\"\n\nNow, the Fed is reversing its easy money policy, raising interest rates,…",
  "data/reddit-stocks/r/Bogleheads/comments/uldz6r/how_does_the_actual_retiring_part_work_on_a_three.json": "You invest for years in a three-fund portfolio then it's time to retire. Is the\nexpectation you have enough of all three funds to live on the dividends (stop\nreinvesting those) or are you selling portions of your portfolio to live on?",
  "data/reddit-stocks/r/stocks/comments/uli9bc/stocks_are_done.json": "Futures are red. No bounce. Rallies get sold off. Feels like late 2018 and early\n2020 all over again. Stocks are done. I'm going to sell everything tomorrow and\nwatch as we hit all time highs within several months.\n\nThen I'm going to buy back in and start this process all over again. 🤪",
  "data/reddit-stocks/r/stocks/comments/ul3wo8/repost_bear_facts.json": "This was posted by a user who seems to have been deleted, so I am reposting for\narchival posterity purposes.\n\n-------------\n\nI haven't posted in a while due to personal circumstances but I've been reading\nalong regularly in the daily posts and sharing in all your tales of joy and\nsuffering.\n\nI want…",
  "data/reddit-stocks/r/investing/comments/ulfpjx/financing_others_and_donations_ive_been_told_i.json": "I come from nothing. Skidding down dirt hills, making the biggest splash in the\ncreek was my form of entertainment as a kid.\n\nI've been told I shouldn't tell my family and childhood friends about my new job\nand paycheck. \"It will change how they view you\".\n\n... is this true?\n\nI want to help as many…",
  "data/reddit-stocks/r/Bogleheads/comments/ul7eog/how_about_that_sequence_of_returns_risk.json": "I feel bad for anyone who retired last year. This year has been hell for those\nmaking withdrawals with VTI, VXUS and BND all down YTD. Or if you have a\nLifeCycle fund with Vanguard doing your asset allocation.\n\nIf you have a Three Fund, what's the best way to deal with this kind of\nenvironment,…",
  "data/reddit-stocks/r/investing/comments/ulehj3/im_young_but_have_some_savings_im_wanting_to.json": "I’m young, and no knowledge besides some basic readings recently on investing. I\nonly have around 5,000 dollars I’m wanting to invest with. Any advice as to what\nto get into? I’ve heard stocks, P2P, forex, etc. I am young and it isn’t “ all “\nmy savings so I’m willing to be risky with it. Thank you…",
  "data/reddit-stocks/r/stocks/comments/ulkp5x/please_stop_recommending_overcomplicated.json": "I'm going to target Vanguard funds because I see 'mistakes' (more like poor\naesthetics) with these funds the most. The TL;DR is this graphic I made: Figure\n1 [https://i.imgur.com/sPrFT7D.png].\n\nHere is your Menu:\n\n * US Large cap = Burgers (VOO)\n * US Small/mid cap = Drink (VXF or VB or similar)\n *…",
  "data/reddit-stocks/r/investing/comments/ulicru/whats_the_difference_between_etfs_and_index_funds.json": "I've been reading some articles online about the difference between index funds\nand ETFs and am still a bit confused. I understand that both are passively\nmanaged to track a published index.\n\nETFs can be traded like a stock intraday whereas index funds are executed at\nmarket closing. But what's the…",
  "data/reddit-stocks/r/investing/comments/ulgd1s/how_long_can_we_keep_rates_increasing_to_battle.json": " * so, if I understand this correctly, we're raising rates to cool off the\n   economy and to make it harder for companies to grow through cheaper\n   financing. As long as we're not in a recession, does this mean the fed will\n   continue to raise rates to keep inflation under control? If this…",
  "data/reddit-stocks/r/wallstreetbets/comments/ulim9l/nestles_relationship_with_a_drug_cartel_exposed.json": "I expect nothing less. This is some Ozark type shit and it being Nestle makes\nthis even funnier. Which Nestle business executive will be disappearing soon\n\nhttps://nypost.com/2022/05/06/half-ton-of-cocaine-found-in-coffee-at-swiss-nespresso-plant/",
  "data/reddit-stocks/r/stocks/comments/ula3jo/i_have_some_dd_on_crox_i_need_to_post_so_here.json": "Company: Crocs inc. Ticker: CROX traded on the NASDAQ exchange MC, TEV, & Price\n(as of Apr. 22): $4.54Bn, $5.29Bn, & $71.18 Sector: Consumer Discretionary\nIndustry: Textiles, Apparels, and Luxury Goods - more specifically Footwear &\nAccessories Recommendation: Buy Current Analyst Target Stock Price…",
  "data/reddit-stocks/r/stocks/comments/ulot3k/palantir_earnings_are_horrible.json": "Q1 EPS $0.02 vs est. $0.04\n\nRevenue $446M vs est. 443.38M\n\n\n\nGUIDANCE: Q2 2022 revenue $470M vs est. $483.84M\n\nCompany is trading at 12 P/S before market open. For this growth, that valuation\nshould be half if not less.",
  "data/reddit-stocks/r/stocks/comments/ulou35/palantir_technologies_nongaap_eps_of_002_misses.json": "Palantir Technologies: Q1 Non-GAAP EPS of $0.02 misses by $0.02.\n\nRevenue of $446M (+30.8% Y/Y) beats by $2.49M.\n\nCommercial revenue grew 54% Y/Y; US commercial revenue grew 136% Y/Y; Government\nrevenue grew 16% Y/Y; Customer count grew 86% Y/Y.\n\nQ2 Outlook: The company is guiding to a base case of…",
  "data/reddit-stocks/r/stocks/comments/ulear2/current_thoughts_on_palantir.json": "I know a lot of you probably lost a lot of money on this one. But what do you\nthink about it now? Seems like its picked up a lot of big contracts lately. At\nwhat price do you think its a good buy, if any?",
  "data/reddit-stocks/r/investing/comments/ulownt/in_case_of_recession_where_should_one_put_his.json": "Deutsche Bank is the first major bank to forecast a US recession. \"We will get a\nmajor recession,\" Deutsche Bank economists wrote.\n\nThe problem, according to the bank, is that while inflation may be peaking, it\nwill take a \"long time\" before it gets back down to the Fed's goal of 2%. That\nsuggests…",
  "data/reddit-stocks/r/stocks/comments/ulmtdl/us_futures_fall_on_early_monday_after_dramatic.json": "Stock futures fell early Monday as traders looked for the market to find its\nfooting after a dramatic week of trading.\n\nDOW FUT: -443 (-1.35%) S&P FUT: -64 (-1.55%) NASDAQ FUT: -230 (-1.8%)\n\nLast week, the Nasdaq Composite lost 1.54%, while the S&P 500 and Dow dropped\n0.21% and 0.24%, respectively.…",
  "data/reddit-stocks/r/stocks/comments/ultg18/sub_is_full_of_hypocrites_time_and_time_again.json": "Yes, the market is red again and spy is dumping again. Something anyone who\nlooked at a chart can tell you. Or maybe the fact when politicians started\nselling stocks essentially called the top. What's funny is look through post\nhistory of all the people who were freaking out and they were all like…",
  "data/reddit-stocks/r/stocks/comments/ulra3q/any_bull_cases_to_be_made_for_the_next_13_years.json": "I’ve seen posts reference 2018 and 2020 with similar market corrections as\nexamples that things will go right back up in the near future. I don’t agree as\nin both of these instances there was Fed policy and in 2020, fiscal policy to\nthe rescue of the economy and stock market. The Fed clearly isn’t…",
  "data/reddit-stocks/r/Bogleheads/comments/ulugj9/do_not_sell_do_not_sell_ever_keep_holding.json": "Fellow Bogleheads,\n\nThe market is down bad. VTI and other index funds keep sinking. I didn't think\nit would sink lower than it has but today it's gone down even more.\n\nRegardless, do not sell ever. If you have the money, buy the dip and keep\nholding.\n\nTime in the market beats timing the…",
  "data/reddit-stocks/r/stocks/comments/ulthpe/my_stock_portfolio_is_down_46_and_still_going_im.json": "Started trading during the lows of the Coronavirus crash in 2020 and from 2020\nI’ve had realised profits of 34 %, however, I have taken profits and invested\nthe profits into other assets that will appreciate in the long term.\n\nAs of now, my portfolio is down 46%, being the worst YTD. The best my…",
  "data/reddit-stocks/r/wallstreetbets/comments/ult9lo/just_a_reminder_that_its_just_money.json": "I just found out that my friend killed her self. I’m completely devastated.\nDuring the covid crash, I saw countless stories on various platforms of people\nending their lives due to the stock market crashing.\n\nI just want to remind everyone that this pain that we’re feeling in the markets\nright now…",
  "data/reddit-stocks/r/investing/comments/ulvwmh/anyone_else_find_this_downturn_legitimately.json": "I’ve lost $35K since November and am down like $25K lifetime due to dumping a\nlot into stocks after I got bonuses in December. I just find it depressing that\nI could have never saved/invested and instead burned $35K on living a luxurious\nlife for many months, and I’d be in the same financial…",
  "data/reddit-stocks/r/stocks/comments/ulnccf/rstocks_daily_discussion_monday_may_09_2022.json": "These daily discussions run from Monday to Friday including during our themed\nposts.\n\nSome helpful links:\n\n * Finviz [https://finviz.com/quote.ashx?t=spy] for charts, fundamentals, and\n   aggregated news on individual stocks\n * Bloomberg market news [https://www.bloomberg.com/markets]\n *…",
  "data/reddit-stocks/r/wallstreetbets/comments/ulqh91/bill_gates_says_theres_a_strong_argument_were.json": "https://www.businessinsider.com/bill-gates-strong-argument-economic-slowdown-inflation-ukraine-pandemic-recession-2022-5\n\nWhen it comes to the fate of the global economy, Bill Gates is siding with the\nbears.\n\nIn an interview with CNN Sunday, Gates was asked how he sees the war in Ukraine\naffecting…",
  "data/reddit-stocks/r/stocks/comments/ulu0db/those_of_you_holding_cash_when_would_you_be_a.json": "For those of you holding cash right now I'm curious what it would take for you\nto look to get back into the market? Is it a price target or some fundamental\nchange in the economic data / outlook?\n\nI remain mostly invested, but I'm holding a decent cash position at the moment.\nBefore I redeploy my…",
  "data/reddit-stocks/r/stocks/comments/ulzleh/if_youre_young_you_should_be_dumping_every_dollar.json": "If you aren’t 10 years or less from retirement, you should be excited about the\nupcoming potential recession or market correction. These happen from time to\ntime and historically speaking, every recession is a perfect time to get a\ndecent position in whatever your favorite Blue chip companies…",
  "data/reddit-stocks/r/investing/comments/ultmzk/at_what_level_will_we_see_capitulation.json": "Buying the CoVID flash crash of 2020 turned out to (at least shortly after) be a\nreally good dip buying opportunity.\n\neverybody seems to know how much the Fed will do quantitive tightening per\nmonth, but nobody seems to be aware of any of their targets long-term. For\nexample, we don’t know if…",
  "data/reddit-stocks/r/Bogleheads/comments/ulz0ph/a_friendly_reminder_to_all_bogleheads_especially.json": "First off, I love being part of this great community with stonewall investing\nadvice for the LONG HAUL. I started off a bit late in life (40s) but it's\nrefreshing to see the market behave the way it's supposed to as Jack Bogle,\nWarren Buffet, Charlie Munger and Peter Lynch has stated throughout…",
  "data/reddit-stocks/r/stocks/comments/ulre9u/fed_prioritizes_rising_inflation_over_recession.json": "Looks like the Fed is choosing to stop rising inflation over economy. Personally\nI feel this is the opposite of how it has acted for several years. We could\nalways count on the Fed to \"juice\" the market/economy.\n\nBill Dudely, former New York Fed President, said there is an “almost zero”\nchance that…",
  "data/reddit-stocks/r/stocks/comments/um2hgx/its_okaytodays_3_loss_was_less_than_yesterdays_3.json": "And tomorrows 3% loss will be less than todays. If you continually move halfway\nto something, it can never be reached…. If we keep dropping 3% on a daily basis,\n0 can never be reached.\n\nJust keep that in mind before you sell any stocks :) We’re better off today than\nwe were last week.",
  "data/reddit-stocks/r/stocks/comments/um0v96/new_investors_dont_panic_this_will_pass.json": "Remember that market drops are an opportunity for long term investors, not a\nrisk.\n\nLong-term wealth is built on red days. We’ve had crashes in the past, but since\n1926, the stock market has increased 11% each year on average, or 1,325,558%\nover 96 years.\n\nIf there is ever a crash that never…",
  "data/reddit-stocks/r/investing/comments/um4inc/bitcoin_tumbles_more_than_50_below_its_alltime.json": "At a price of just below $31,000, bitcoin is more than 50% below its record high\nof near $69,000 from late last year and at its lowest point since July 2021.\nCryptocurrencies are proving to be just as risky as stocks and susceptible to\nthe same concerns that are dragging down the Dow, S&P 500 and…",
  "data/reddit-stocks/r/stocks/comments/ultbl1/palantir_craters_most_since_2020_on.json": "Palantir Technologies Inc. shares plummeted as much as 22% on Monday, the\nbiggest intraday drop since September 2020, after the software maker reported\nmounting losses and a disappointing sales forecast.\n\nThe company lost $101 million in the first quarter, a sign it’s struggling to\nimprove margins…",
  "data/reddit-stocks/r/stocks/comments/um089p/upstart_upst_beats_earnings_stock_is_down_35.json": "Basically the title. What are we thinking of this?\n\nThey beat on EPS and revenue for the quarter:\n\nQ1 EPS $0.61 Beats $0.51 Estimate, Sales $310M Beat $300\n\nHowever guidance is no revenue growth (small decline) for next quarter and (4)\nto 0 in net income for the next quarter. Market is punishing…",
  "data/reddit-stocks/r/stocks/comments/um4q0l/whats_the_most_shocking_stock_decline_youve_seen.json": "So many to choose from, but some of my favourites include:\n\nSHOP: $1475 > $340\n\nC3ai: $46 > $16 (was as high as $153 last Feb)\n\nRoblox: $95 > $24\n\nRIVN: $100 > $22\n\nCOIN: $328 > $83\n\nProbably so many others that could be added to the list I'm sure, but curious to\nhear some other perspectives as…",
  "data/reddit-stocks/r/stocks/comments/ulx6fs/so_many_opportunities_for_longterm_investors.json": "I’ve been waiting for this so long , although I got only 20% cash :(\n\nWhat are you buying at these levels? I’m looking for Google, Adobe, Facebook,\nPayPal, MU, Disney etc So many bargains in the market right now.\n\nName some stocks you’re looking for",
  "data/reddit-stocks/r/wallstreetbets/comments/um03v7/i_would_like_to_publicly_shame_this_user.json": "User \"bubblesinajar\" made this bold statement earlier today, only to be proven\nabsolutely incorrect.\n\n\n\nhttps://preview.redd.it/2deznl4gciy81.png?width=897&format=png&auto=webp&s=ed240b2dd4f3f847cfaf912796edf7e2319e4df3\n\nTherefore, I would like to publicly shame bubblesinajar for being a…",
  "data/reddit-stocks/r/stocks/comments/um4npk/upstart_aged_well.json": "Smashed earnings just as I expected from my last post. My birthday wish came\ntrue.\n\nTomorrow we’ll see some green. Hold my people for we will rise to victory!\n\nAlthough I say that, I only invested like $3000 at 79$ average, i probably won’t\nmake much. But you guys will, may the gains be with…",
  "data/reddit-stocks/r/Bogleheads/comments/um8a94/976_of_vanguards_etfs_are_negative_ytd.json": "Of Vanguards 82 ETFs, only TWO are positive year to date. One is VDE (energy\netf) +36.82%. The other is VPU (utilities etf) which is barely up at +0.08%.\n\nThis goes to show how broadly this sell off is effecting multiple sectors,\nmarket caps, and styles. If you’re worried about losing money in…",
  "data/reddit-stocks/r/Bogleheads/comments/ulwsnu/it_seems_that_people_knew_the_ibonds_rate_of_962.json": "I am considering whether I should invest in i-bonds now, or wait until October\nthis year, when we may have a better indication of where the i-bonds inflation\nrate for the following 6 months may be going.\n\nHow did people know in April 2022 what the rate announced in May 2022 would be?\nFrom what I…",
  "data/reddit-stocks/r/stocks/comments/um2rfo/any_tips_for_staying_calm_during_this_volatile.json": "Hi everyone,\n\nDuring the last two years, I invested a lot of money to stock market. I invested\nmostly in large cap stocks and mid cap, and some small cap and cryptos. Now, I\nhave unrealized loss of as much as $45k. I felt very dumb and greedy for putting\nso much money to stocks and not taking more…",
  "data/reddit-stocks/r/investing/comments/um7a92/is_a_recession_being_priced_into_the_market_now.json": "markets are down nearly 25% ytd and we're not in a recession yet. So, are we\npricing in a recession now so that when a recession actually hits, it won't be\nthat bad or can we expect another 30 to 40 percent drop after we officially go\ninto a recession?",
  "data/reddit-stocks/r/Bogleheads/comments/ulzdax/i_wave_the_white_flag_moving_to_index_funds.json": "I thought i could beat the market by 'adding smart beta' to my portfolio, hyper\ngrowth companies reshaping the human landscape; so glamorous and also great to\ntalk about at cocktail parties. I mean telling people that i'm invested in\ncompanies which are on the bleeding edge, it sounds so great. I…",
  "data/reddit-stocks/r/stocks/comments/uluys6/stock_market_pullbacks_vs_corrections_vs_bear.json": "🔹\"pullback,\" a drop of 5% to 9.99%\n\n🔹 \"correction,\" a decline of 10% to 19.99%\n\n🔹 \"bear market,\" or 20% + drop.\n\n🔸 Pullbacks are normal, and often begin without warning, but tend to be\nshort-lived, and they normally aren't disruptive enough to change the market's\nlonger-term trend.\n\n🔸…",
  "data/reddit-stocks/r/stocks/comments/ulx5n0/serious_bear_markets_and_crashes_often_undershoot.json": "I suspect a lot of people on this sub have never lived through a real crash or\nserious bear market. As such, they expect that these markets just take us down\nto fair value, but that's almost never true. If a market can be 20% too frothy\nwhen sentiment is high, it can end up 20% undervalued when…",
  "data/reddit-stocks/r/wallstreetbets/comments/ulz8zz/prayer_thread_for_may_9th_2022.json": "It has been 74 days 4 days 0 days since the last prayer thread\n[https://www.reddit.com/r/wallstreetbets/comments/uj16wj/prayer_thread_for_thursday_may_5th_2022]\n\nGod save us all.\n\nEarnings thread…",
  "data/reddit-stocks/r/stocks/comments/um9vpk/how_much_of_an_opportunity_is_this_really_sp_is.json": "considering that its still up 20 percent in the past 2 years, how much of an\n\"opportunity\" is this really?\n\nI'm not saying if it is or isnt. I will start to dca into SPY soon, but is this\nreally the opportunity that some posts claim it to be?\n\nfyi, i dont know jack.",
  "data/reddit-stocks/r/stocks/comments/um943s/please_explain_this_basic_concept_to_me.json": "Let's say I buy $10,000 worth of a stock, and 6 months later it's worth\n$100,000.\n\nSo I sell the stock for $100,000, but I immediately change my mind and re-buy\nall $100,000 of it.\n\nI realized short-term gains of $90,000, so I have to pay $90,000 * 30% = $27,000\nin taxes.\n\nSo I just lost a ton of…",
  "data/reddit-stocks/r/Bogleheads/comments/umgwb6/started_my_boglehead_experiment_a_month_ago_its.json": "I really just want someone to say “it’s gonna be fine,” but read on.\n\nI’ve had a Roth and taxable account with an advisor since I was 18 (I’m 33) and\nrecently my fees increased to .85% AUM. As I understand it I was getting a\npretty good deal, and this still isn’t horrible, but I had been toying…",
  "data/reddit-stocks/r/stocks/comments/um5uo1/have_you_seen_any_personal_first_hand_signs_of_a.json": "I follow the used music gear market pretty close and I've noticed similar price\nincreases and patterns compared to the stock market. Vintage music gear selling\n3 or 4 times what it would have sold for 3 years ago.....broken gear selling at\ndouble the price of the same working units of…",
  "data/reddit-stocks/r/stocks/comments/ulydj3/is_coinbase_oversold_right_now.json": "Today the stock dipped an additional 20%. Reasons being would be the fall in\nBTC, as well as fears of the quarterly earnings releasing tomorrow. Am I missing\nsomething here? It seems like the market is exaggerating the sell.\n\nDo you think counbasecis currently oversold? Or is the market…",
  "data/reddit-stocks/r/stocks/comments/umgok2/what_is_the_game_plan_when_we_hit_a_recession.json": "We are raising rates and will do so untill the something breaks and can't raise\nanymore.\n\nOnce they can't raise rates anymore and Inflation is still high. What will be\nthe feds gameplay to reduce inflation without destroying everything ?",
  "data/reddit-stocks/r/stocks/comments/umi6z6/upstart_and_its_50_drop_premarket.json": "Upstart reported earnings last evening and beat for the quarter on top and\nbottom line however it cut its outlook for the year as they now expect the surge\nin interest rates to lead to lower demand for loans and therefore slowed growth.\n\nThis is really a side story. The major issue is the rise of…",
  "data/reddit-stocks/r/stocks/comments/um4ozh/cathie_woods_arkf_crashes_10_and_approaches.json": "Cathie Wood’s ARK Fintech Innovation ETF (NYSEARCA:ARKF) crashed 10.4% during\nMonday’s general sell-off, sending the exchange traded fund near its record\ntrading low.\n\nARKF closed trading at 17.67 -- a 26-month trading low. The last time the\nfintech ETF traded this low was when the fund touched…",
  "data/reddit-stocks/r/stocks/comments/umkbca/netflix_is_down_20_since_it_was_reported_that.json": "Price on April 21 open: $220\nPrice today at open: $176.01\n\nThis sub often talks about holding on to your losers since stocks always go up\nand it will eventually recover as well as throwing shade at an investors who\nsell at a loss, but if Ackman was/is able to use the money he received from the\nsell…",
  "data/reddit-stocks/r/stocks/comments/umg5d4/peloton_earnings_miss_on_adjusted_operating.json": "(Peloton stock down 25% premarket)\n\nPeloton earnings miss on adjusted operating profits, CEO says company is 'thinly\ncapitalized'\n\nPeloton's turnaround will take a while, new CEO Barry McCarthy warned\nshareholders on the company's earnings Tuesday.\n\n\"Turnarounds are hard work,\" McCarthy said at the…",
  "data/reddit-stocks/r/stocks/comments/umepy5/rstocks_daily_discussion_technicals_tuesday_may.json": "This is the daily discussion, so anything stocks related is fine, but the theme\nfor today is on technical analysis (TA), but if TA is not your thing then just\nignore the theme and/or post your arguments against TA…",
  "data/reddit-stocks/r/stocks/comments/umi57p/cathie_wood_buys_into_general_motors_after_stocks.json": "(Bloomberg) -- Cathie Wood’s fund on Monday marked its first purchase of shares\nin U.S. automaker General Motors Co., according to trading data from ARK\ncompiled by Bloomberg.\n\nWood’s firm ARK Investment Management LLC bought 158,187 shares of General\nMotors in a transaction worth just over $6…",
  "data/reddit-stocks/r/stocks/comments/umkvee/are_stocks_dropping_because_of_interest_rate.json": "In short, the question is why are stocks dropping. Everything is tanking as we\nall know.\n\nBut, I think there's a big difference in stocks dropping due to interest rate\nrises and stocks dropping because there is a potential recession coming as a\nresult of the interest rate rises.\n\nIn the case of the…",
  "data/reddit-stocks/r/stocks/comments/um4m7z/market_inflation_expectations_spiked_lower_today.json": "Today both the 5 year and 10 year inflation breakevens dropped quite\nsignificantly breaking out of their recent ranges.\n\nhttps://fred.stlouisfed.org/series/T5YIE\n\nhttps://fred.stlouisfed.org/series/T10YIE\n[https://fred.stlouisfed.org/series/T10YIE#]\n\nThis is likely one of the metrics the Fed has…",
  "data/reddit-stocks/r/stocks/comments/ulyw1x/saudis_drastically_cut_oil_prices_to_china.json": "According to Bloomberg (non pay walled): [https://archive.ph/fMQ2v]\n\n> Saudi Arabia cut oil prices for buyers in Asia as coronavirus lockdowns in\n> China weigh on demand, countering uncertainty around Russia’s supplies as the\n> Ukraine war drags on.\n> \n> Saudi Aramco is lowering prices for the…",
  "data/reddit-stocks/r/stocks/comments/umm7gd/which_companies_are_you_happy_to_see_taking_a_dive.json": "I don't mean you are happy because you want to buy them at a cheap price. I mean\nyou genuinely dislike the company and are happy to see them plummeting.\n\nFor me, it's Peloton. They have polluted our airwaves for long enough. They are\ncult-ish. I'm a relatively well-off guy, but even I found the…",
  "data/reddit-stocks/r/stocks/comments/umo3cn/my_grandmother_just_gave_me_77k_of_stocks_for_my.json": "What do you guys think? All the stocks are Indian. I’m thinking of selling half\nof it to buy Amazon and google and then hold. Will it be a wise decision?\n\nI am an Indian who lives in India but will be moving to the uk for college next\nyear.\n\nI won’t need the money so thinking of holding for at…",
  "data/reddit-stocks/r/wallstreetbets/comments/umjsk3/roblox_is_going_to_continue_to_eat_shit.json": "In no universe is Roblox a $15 billion company. The entire business model is\nbased on 8 year olds begging their parents for money.\n\nThe people who play that shit can't actually spend money on the game. Even if\nthey report more users and uptake it barely matters. The company still isn't\nprofitable.…",
  "data/reddit-stocks/r/Bogleheads/comments/umja50/this_market_is_good_for_us.json": "I'm a 16 year old boglehead. This market gets me excited. I look forward to\nlooking at stocks more and more. The money in my portfolio? I won't need it for\ndecades and I know with like 99.9% certainty that it'll recover. All this means\nis I get in at a discount. Bring on the red. Many of us knew…",
  "data/reddit-stocks/r/Bogleheads/comments/umpqyd/isnt_it_just_common_sense_to_not_always_expect.json": "Complaints about losses over the past week, month, and year are somewhat\nastonishing to me lol.\n\nDoes anyone out there really think they’re going to be up every single time?\nEach week, month etc?\n\nThose that are new investors especially, that complain, were they going to cash\nout if they gained a…",
  "data/reddit-stocks/r/stocks/comments/umofl4/so_tired_of_this_market.json": "Tired of seeing everything going down everyday so I've decided to take the\nadvice I have seen alot on reddit:\n\nI just realized a 50% loss on everything I have and decided to go all cash. I\nplan on buying back in when everything recovers and reaches an all time high\nagain. Meanwhile I'll make sure…",
  "data/reddit-stocks/r/investing/comments/umpd03/hedge_fund_tiger_global_loses_17bn_ytd_or.json": "https://www.marketwatch.com/story/hedge-fund-tiger-global-loses-17-billion-due-to-tech-stock-rout-11652189689\n\n> The hedge fund Tiger Global has lost roughly two-thirds of the cumulative\n> gains it has made for investors since its inception in 2001, according to data\n> from an investor that tracks…",
  "data/reddit-stocks/r/stocks/comments/ummfya/sofi_earnings_leaked_early_trading_halted.json": "Edit: Trading has resumed\n\nCopied from Barrons:\n\nSoFi Technologies stock was sinking after Bloomberg released the fintech\ncompany's earnings, which weren't supposed to arrive until after the close,\nearly.\n\nAccording to the Bloomberg article, SoFi reported a loss of 14 cents a share,\nmeeting analyst…",
  "data/reddit-stocks/r/Bogleheads/comments/umolvv/4000_every_month_for_20_years_960000_or_500000.json": "This is a throwaway for privacy reasons.\n\nLet's say you'd have the choice between:\n\n 1. getting $4,000 every month for the next 20 years which will be a total of\n    $960,000\n 2. or getting $500,000 right now\n\nLet's also say that you'd invest 100% of this money (in VTI for simplicity) no\nmatter…",
  "data/reddit-stocks/r/stocks/comments/umry69/coinbase_down_another_15_ah_after_disappointing.json": " * Net revenue fell 53% to $1.165B\n\n * Total trading volume fell 43.5% to $309B\n\n * Retail & institutional trading volume fell 58% and 36.6%, respectively\n\n * Monthly transacting users fell 19.3% to 9.2M\n\n * Sees Q2 MTU Lower VS Q1",
  "data/reddit-stocks/r/stocks/comments/umprwr/what_are_we_expecting_for_cpi_tomorrow.json": "I've seen some people mention that gasoline/diesel prices increased\nsignificantly, and that will have a big impact on inflation.\n\nOther people say these next 3 months are the strongest for base effects so we\nshould see a decline in the inflation rate.\n\nAny thoughts on data you've seen that gives…",
  "data/reddit-stocks/r/stocks/comments/umrp6n/unity_software_stock_plunges_33_after_guiding.json": "Unity Software press release (NYSE:U): Q1 Non-GAAP EPS of -$0.08 in-line.\n\nRevenue of $320.13M (+36.3% Y/Y) misses by $1.04M.\n\n2Q22 Guidance: Revenue $290 — $295M vs. consensus $359.65M, Year-over-year\nrevenue growth 6% — 8%, Non-GAAP loss from operations ($62)M — ($64)M.\n\nFY2022 Guidance: Revenue…",
  "data/reddit-stocks/r/wallstreetbets/comments/umnl82/if_biden_is_giving_a_speech_the_day_before_cpi.json": "https://youtu.be/4muv-srvjRY\n\nSo Biden is giving a address today I’m regards to his administrations action on\ncontrolling inflation and how important it is and that he’s taking it seriously.\n\nGiven how CPI numbers come out tomorrow, does that suggest he’s trying to calm\npeople down as it will be a…",
  "data/reddit-stocks/r/stocks/comments/umvui9/my_grandpa_left_me_100k_in_stocks.json": "What should I do with it? Should I sell the 78k in stocks and buy something\nelse? I want to be responsible and don't need it right now so I'd rather\nreinvest all 53k instead of blowing it on dumb stuff. I've heard this was a\ngreat time to invest so how do I use this 17k to make me rich?",
  "data/reddit-stocks/r/Bogleheads/comments/umo0wq/should_i_always_max_my_401k_before_putting.json": "My options are limited in my 401K where the best option I have is the T. Rowe\nPrice Target Retirement (it's a actively managed TDF with an expense ratio of\n0.46).\n\nAccording to Morningstar they consider it to be a very good TDF so I'm not \"too\nworried\", but I wonder if it might be better for me to…",
  "data/reddit-stocks/r/stocks/comments/umyl0t/reminder_that_at_no_point_in_its_history_has_the.json": "And, in fact, has grown significantly over time.\n\nIt’s scary seeing all the red every day. Balances bleeding out.\n\nBut unless this is the one time in its entire history (and, to be fair, it only\ntakes one time) that it never bounces back, we probably have far worse problems\nand things to worry…",
  "data/reddit-stocks/r/stocks/comments/umvv98/can_anyone_explain_to_me_how_door_dash_was_unable.json": "They had the optimal conditions with Covid where everyone stayed home and door\ndashed some food. Nearly every restaurant had them as an option (atleast around\nmy area). They also had plenty of people know about them, their app was one of\nthe most owned for a little while there too. What aspect of…",
  "data/reddit-stocks/r/stocks/comments/umn7ri/anyone_start_investing_in_2020_and_in_the.json": "I started investing in 2020 and obviously made good profits. I sold a bunch\nalong the way but reinvested the money into other stocks.\n\nI am now negative. Is anyone in the same boat as me? This is pretty stressful\nbut I’m very young so I’m looking a 30 year time frame.",
  "data/reddit-stocks/r/stocks/comments/umkkp8/what_stocks_are_you_buying_on_the_way_down.json": "This question is meant for people who are choosing to buy the dip. Now that\nsentiments have shifted towards fear and it looks we are trending into a bear\nmarket and recession, What stocks and industries and your buying into now that\nthey are one sale, and why? What is your strategy?",
  "data/reddit-stocks/r/investing/comments/ummb76/what_stops_msft_to_buy_atvi_shares_cheaper_than.json": "Basically what the title says. What stops Microsoft from acquiring Activision\nshares as much as it can now on the market and below the 95$ target price and\nthe rest on when the full acquisition happens? Berkshire seems to want to take\nadvantage of this situation and acquired almost a billion worth…",
  "data/reddit-stocks/r/Bogleheads/comments/umvji2/how_long_does_it_take_for_hysas_to_increase.json": "With Ally’s HYSA holding steady at 0.5% while rates were at 0% and several more\n25 & 50 bp hikes expected, I’m curious how long the lag will be before we see\nsavings yields increase.\n\nDoes anyone have any insights on the methodology or factors at play for banks\nsetting HYSA rates?",
  "data/reddit-stocks/r/investing/comments/umywl0/tesla_ceo_musk_open_to_acquiring_a_mining_company.json": "Musk said on the 9th that Tesla is unlikely to acquire another automaker, but\nthe possibility exists to acquire a mining company. \"We're not simply looking to\nacquire a mining company, if that's the only way to accelerate the transition to\nelectric vehicles, then the possibility is on the…",
  "data/reddit-stocks/r/Bogleheads/comments/umyqpn/jason_zweig_your_money_and_your_brain_summary.json": "BEHAVIORAL AND HISTORICAL FINANCE\n\n\nJASON ZWEIG YOUR MONEY AND YOUR BRAIN\n\n * Neuroeconomics\n   * A monetary loss or gain causes a biological change that has profound\n     physical effects on the body\n   * Neural activity of someone making money in investments are\n     indistinguishable from…",
  "data/reddit-stocks/r/Bogleheads/comments/umrm3g/psa_now_may_be_a_really_good_time_to_do_some_tax.json": "With what the market's been doing in the last few weeks, a lot of people are\nlikely sitting on some substantial unrealized losses.\n\nI know for the most part Bogleheads like to just sit back, and wait out the\nmarket, but that doesn't mean ignoring tax planning! Depending on your\ncircumstances, tax…",
  "data/reddit-stocks/r/stocks/comments/umruau/roblox_down_15_after_missing_on_earnings.json": "Roblox (NYSE:RBLX): Q1 GAAP EPS of -$0.27 misses by $0.08.\n\nBookings of $631.21M (-3.2% Y/Y) misses by $15M.\n\nRevenue increased 39% over Q1 2021 to $537.1 million.\n\nNet cash provided by operating activities of $156.4 million; Free cash flow was\n$104.6 million.\n\nHours Engaged were 11.8 billion, an…",
  "data/reddit-stocks/r/investing/comments/umic14/i_guess_if_im_neither_a_bull_nor_a_bear_im_a.json": "THE MARKET TURMOIL: THE REACTION OF INDIVIDUALS; The Lonely Feeling Of Small\nInvestors\n[https://www.nytimes.com/1987/10/21/business/market-turmoil-reaction-individuals-lonely-feeling-small-investors.html]\n\n> ''I haven't sold anything, and I haven't bought anything,'' said Mr. Bacon, a\n> retired…",
  "data/reddit-stocks/r/wallstreetbets/comments/umt8fn/i_think_my_daughter_belongs_here.json": "My daughter came to my wife an I a week ago asking how she could earn  $1,000 usd to convert to Robux. Naturally we asked her why and she was prepared to answer. \n\n\nApparently there was an item on the Roblox market place she had been tracking\nthe value of. It is called “Super super happy face”.…",
  "data/reddit-stocks/r/investing/comments/umcoy6/50k_in_an_etf_or_50k_in_msftgoog.json": "Hi all,\n\nI know we may see more downside over the coming months but I’m not expecting to\ntime the bottom perfectly. I want to park some cash and I’m unsure of what the\noptimum pick is.\n\nI’ve been looking at QQQ and VOO and VTI and VGT. I plan to park the 50k for 10\nyears and add smaller increments…",
  "data/reddit-stocks/r/stocks/comments/umuicv/what_a_time_were_in_right_now.json": "Before I begin, I understand there are a lot of people who are in losses to an\nextent that greatly impact their lives (although technically you aren't supposed\nto invest money that you need in short term). I apologize if this post irritates\nyou in any way.\n\nBut I just found myself hysterically…",
  "data/reddit-stocks/r/stocks/comments/umven7/serious_question_but_why_is_everyone.json": "sorry if this sounds ignorant but its an honest question. With all the\nartificial growth and pumps we saw since the pandemic, whys everyone so\nsurprised and scared that shit finally hit the fan? Like it just doesnt seem\nlogical to think that any of these tech stocks or other stocks could…",
  "data/reddit-stocks/r/stocks/comments/un3xko/when_buying_the_dip_doesnt_work_an_analysis_of.json": "Thought this article was brilliant: When Buying the Dip Doesn’t Work: An\nAnalysis of the Dot-com Crash\n[https://endlessmetrics.substack.com/p/when-buying-the-dip-doesnt-work-an]\n\n> The most notorious of these bear markets is, of course, the Great Depression.\n> But another great (and more recent)…",
  "data/reddit-stocks/r/stocks/comments/umxwi3/facebooks_new_hiring_freeze_and_stock_slump_has.json": "With a broad hiring freeze in place, some workers at Facebook are growing\nconcerned that layoffs may be next.\n\nThe company told employees last week in memos seen by Insider it was enacting a\nhiring pause that would first affect many levels of engineers and would expand\nto impact \"almost every team…",
  "data/reddit-stocks/r/stocks/comments/un8d7w/my_father_in_law_put_a_quarter_of_my_savings_in.json": "Almost a year ago I sat down to assess my savings, with the intent of investing.\nMy girlfriend started telling me how my father in law is a “stock wizard” and\nhow I should let him put a portfolio together for me. Up until this point I had\nonly ever bought VTI due to it being safe (and me knowing…",
  "data/reddit-stocks/r/stocks/comments/un8s8f/usd_inflation_rose_an_additional_03_in_the_month.json": "https://www.bls.gov/news.release/cpi.nr0.htm\n\nCONSUMER PRICE INDEX - APRIL 2022 The Consumer Price Index for All Urban\nConsumers (CPI-U) increased 0.3 percent in April on a seasonally adjusted basis\nafter rising 1.2 percent in March, the U.S. Bureau of Labor Statistics reported\ntoday. Over the last…",
  "data/reddit-stocks/r/investing/comments/un8qyt/cpi_rises_03_in_april_83_over_last_12_months.json": "https://www.bls.gov/news.release/cpi.nr0.htm\n\nYou can see a very specific breakdown per item here:\nhttps://www.bls.gov/news.release/cpi.t02.htm\n\n> The Consumer Price Index for All Urban Consumers (CPI-U) increased 0.3 percent\n> in April on a seasonally adjusted basis after rising 1.2 percent in…",
  "data/reddit-stocks/r/stocks/comments/un7nlf/will_tsla_be_the_next_nflx.json": "Around year 2014, I remember the same hype for Netflix which Tesla has in recent\nyears. Then around 2018 we started to discuss if the mainstream media companies\nare catching up and they indeed did. We do talk about the contemporary\nautomotive companies finally catching up with Tesla. What happens…",
  "data/reddit-stocks/r/Bogleheads/comments/unahe1/i_just_want_to_say_in_times_like_these_im.json": "Title says it all. I used to get fomo from 2x+ swings in crypto and the tech\nstocks that went up 10% per day. I’ve been staying the course over the years and\njust kept the auto purchases for every other Friday.\n\nIn this past week, we’ve seen all that fomo stuff implode. Thankful for reading\nbooks…",
  "data/reddit-stocks/r/stocks/comments/un8e8t/when_buying_the_dip_does_work_an_analysis_of_the.json": "In regards to the other post: One time investments have a higher risk. However\nmost people will invest with their monthly or yearly salary. So lets assume you\ninvest 1.000$ each year for 10 years instead of buying all at once:\n\nIn the article\n[https://endlessmetrics.substack.com/p/when-buying-the…",
  "data/reddit-stocks/r/Bogleheads/comments/unc2lb/fidelity_is_superior_to_vanguard_in_everyway_but.json": "I've had accounts with Fidelity for about six years or so now. The website, the\napp, the customer service is all far superior to what Vanguard offers. Their\nmutual fund line up is just as good as what Vanguard offers. Vanguard has the\nedge in ETF's. But that's about it.\n\nHowever, Fidelity makes it…",
  "data/reddit-stocks/r/stocks/comments/un5xfl/rstocks_daily_discussion_wednesday_may_11_2022.json": "These daily discussions run from Monday to Friday including during our themed\nposts.\n\nSome helpful links:\n\n * Finviz [https://finviz.com/quote.ashx?t=spy] for charts, fundamentals, and\n   aggregated news on individual stocks\n * Bloomberg market news [https://www.bloomberg.com/markets]\n *…",
  "data/reddit-stocks/r/wallstreetbets/comments/unad7t/no_the_inflation_rate_did_not_decrease.json": "That 8.3% number they published is the YOY change compared to a month that was\nalready starting to see high inflation growth.\n\nIf you look at a 2 year rate, or anything longer than 1 year, you will see that\nthe rate ACTUALLY INCREASED from 11.39% to 12.8% (that's for 2 years)\n\nMaths for the…",
  "data/reddit-stocks/r/stocks/comments/undaa6/do_you_hold_crpto_on_coinbase_your_assets_could.json": "https://www.bloomberg.com/news/articles/2022-05-11/coinbase-ceo-says-no-risk-of-bankruptcy-amid-black-swan-event?srnd=premium\n\n> A filing late Tuesday by Coinbase included a “new risk factor” based on recent\n> Securities and Exchange Commission requirement for public companies that hold\n> cr*pto…",
  "data/reddit-stocks/r/stocks/comments/uncnuo/grindr_to_go_public_in_21_billion_deal.json": "https://www.businesswire.com/news/home/20220509006161/en/Grindr-to-Become-a-Public-Company-Advancing-Mission-to-Connect-LGBTQ-People-With-One-Another-and-The-World\n\nGrindr, the #1 social network for the LGBTQ+ community, today announced that it\nhas entered into a definitive agreement to merge with…",
  "data/reddit-stocks/r/stocks/comments/unbjx8/investing_is_not_like_cheering_for_a_sports_team.json": "This is a long read but 100% worth it and necessary for today’s investing\nclimate.\n\nPeople become sports fans mainly to support the home team. Whether the team is\ngood or bad they watch, go to games, buy memorabilia. And the majority of times\nthey stick with one team their entire lives through ups…",
  "data/reddit-stocks/r/stocks/comments/unesxp/amazon_is_back_to_precovid_levels.json": "Assuming we all forgot about the massive shoot up of Tech during lockdown (that\noccurred fora number of reasons), it appears Amazon is back into it’s pre-Covid\nterritory/price. It would seem the markets decided that in fact, their growth\nwasn’t a product of company fundamentals or some change in…",
  "data/reddit-stocks/r/Bogleheads/comments/un8e6t/where_do_you_hold_your_emergency_fund.json": "I've been reading a lot about emergency funds lately and basically I found that\nthere are multiple \"strategies\" to choose from.\n\n- Cash\n- HYSA\n- Money Market Account\n- Certificate of Deposit\n- Securities (stocks, bonds, precious metals)\n- A combination of all the above\n\nPersonally, I have 1 month…",
  "data/reddit-stocks/r/stocks/comments/unerqc/apple_now_at_150share_buy_the_dip.json": "Apple is now trading at 150$/share --- for all you dip buyers.maybe now is a\ngood time to buy the dip if you think apple will go up.Apple has been swinging\nbetween 180 and 150 this year.\n\nwhat do you think?\n\n\n\nunrelated but related news: Saudi Aramco has now surpassed apple in market cap\nand is now…",
  "data/reddit-stocks/r/stocks/comments/unirmw/disney_nongaap_eps_of_108_misses_by_011_revenue.json": "Disney press release (NYSE:DIS): Q2 Non-GAAP EPS of $1.08 misses by $0.11.\n\nRevenue of $19.24B (+23.3% Y/Y) misses by $800M.\n\nSegments: Disney Media and Entertainment Distribution of $13.62B; Disney Parks,\nExperiences and Products $6.65B.\n\nDisney+ subscribers of 137.7M vs. 129.8M in 4Q21.",
  "data/reddit-stocks/r/investing/comments/unlfzb/elon_musks_twitter_acquisition_under.json": "　The U.S. Securities and Exchange Commission (SEC) is investigating Musk for\nfailing to disclose information about his holdings in a timely manner; in\naddition, the U.S. Federal Trade Commission is also investigating the\nacquisition.\n\nWhat do you guys think of this news? Will this affect Tesla's…",
  "data/reddit-stocks/r/stocks/comments/unh5yq/shopify_ceo_and_vp_tweet_about_buying_more_shop.json": "Tweets in question:\n\nhttps://twitter.com/tobi/status/1524421351942983681\n\nhttps://twitter.com/CanadaKaz/status/1524427941836320768\n\nTo me this has a bad vibe about it... Kind of like the Bear Sterns moment from\nthe Big Short...",
  "data/reddit-stocks/r/stocks/comments/unkv7e/nasdaq_down_30_percent_from_alltime_highs.json": "NASDAQ is down 30% from all-time high. While I am not shocked too much at that,\nI am very surprised that the NASDAQ 100 is down that much too which I did not\nconsider so outrageously priced as some of the others. And of course, a lot of\ngood stocks are down 90%.\n\nI hope better times are ahead for…",
  "data/reddit-stocks/r/investing/comments/unlwup/percentage_of_arm_mortgages_now_at_early_2008.json": "There has been an explosion in adjustable-rate mortgages issued in the last 4\nmonths, from 3% of all outstanding loans, to over 11%\n\nhttps://www.cnbc.com/2022/05/11/adjustable-rate-mortgage-demand-surges-to-14-year-high-as-homebuyers-try-to-afford-this-pricey-spring-market.html\n\nand in addition to…",
  "data/reddit-stocks/r/stocks/comments/unmytq/how_are_we_not_considered_to_be_in_a_crash_yet.json": "What title says. many many stocks are down 80%? Facebook netflix amazon which\nwere not too long ago considered impenetrable are down 30% and more? Im not\nsaying the worst is here yet but surely we have experienced a huge crash?",
  "data/reddit-stocks/r/stocks/comments/unmfx8/if_youre_feeling_depressed_stressed_or_suicidal.json": "If you are feeling down, suicidal or depressed due to current sell off in the\nmarket. Please contact friends, family or the suicide contact line.\n\nA real human will talk to you and listen to your story.\n\nText HOME to 741741 if you’re from the US.\n\nText SHOUT to 116123 if you’re from the UK.\n\nStay…",
  "data/reddit-stocks/r/stocks/comments/unlnvf/remember_your_life_is_more_valuable_than_your.json": "Not sure whatever the hell to call this. capitulation, peak fear, bottom,\nwhatever the hell you want to call it. This recent drawdown has been especially\nharsh for people. I'm seeing posts such as this…",
  "data/reddit-stocks/r/stocks/comments/un410i/market_drop_caused_by_low_liquidity.json": "I think most people are shocked by the recent drop in the market. I think during\nthese times it's good to understand that prices can drop for any number of\nreasons beyond fundamentals.\n\nCurrently we are seeing a lot of forced selling and triggering of stop-losses\ncombined with a severe lack of…",
  "data/reddit-stocks/r/stocks/comments/unon8o/i_crippled_my_future_and_lost_all_of_my_life.json": "I’ll preface with some personal info. I’m 21 years old and set to graduate\ncollege next year with a degree in Computer Information Technology with a track\nin Cybersecurity. I have about 10k left I have to pay in tuition, I still live\nwith my family, and I have my car paid off.\n\nIt’s been a pretty…",
  "data/reddit-stocks/r/wallstreetbets/comments/undcrz/unemployment_is_rising_and_you_arent_seeing_it.json": "https://www.businessinsider.com/layoffs-sweeping-the-us-these-are-the-companies-making-cuts-2022-5\n\nPeloton laid off thousands of workers, Robinhood cut 9% of staff, Carvanna cuts\nthousands of staff… This is just what is making headlines and what we know of.\n\nI myself was just recently laid off.…",
  "data/reddit-stocks/r/Bogleheads/comments/unjj8q/something_i_hadnt_realized_about_automated.json": "I peeked at my retirement account for the first time in a while (I know, I\nknow). I noticed I was \"only\" down about 8% based on my recollection of my\nprevious balance. But looking at the performance of my individual funds,\neverything I owned was down between 10-25% YTD.\n\nHow could this be? How…",
  "data/reddit-stocks/r/investing/comments/unmtwn/what_the_fed_is_really_trying_to_fix.json": "Let’s get right down to it.\n\nWe know that the Federal Reserve is hiking interest rates (market expects rate\nto be at about 3% by year end) and it will trim its almost $9 trillion balance\nsheet. This balance sheet includes $2.7 trillion in mortgage backed securities\n(MBS). There are proposals to…",
  "data/reddit-stocks/r/investing/comments/unoxcy/beyond_meat_losses_mount_on_product_launches_deep.json": "Beyond Meat Inc's quarterly losses ballooned, as the plant-based protein maker\nspent heavily on product launches and offered big discounts as it tried to guard\nits market share against deep-pocketed players and nimble upstarts.\n\nThe company's stock slid 20% in extended trading on Wednesday, as…",
  "data/reddit-stocks/r/stocks/comments/unpt1j/just_saw_a_meme_that_said_coinbase_was_at_50share.json": "I thought it was a joke until I checked and coinbase is actually at $50 a share.\n\nA few weeks ago it was going between 220-280. What the fuck happened??? I don't\nown any, or any crypto, but just wonder how this could possibly be.",
  "data/reddit-stocks/r/Bogleheads/comments/unfvwv/markets_crashing.json": "So you hold.\n\nThe time to be a Boglehead is now. Not when the sun is shining on your face and\nthe wind is to your back. Be Boglehead then too, but that’s what all these hold\nstrategies are.\n\nAnyone can be a market expert and hodler when everything’s in the green.\n\nSo glad I found this philosophy 2…",
  "data/reddit-stocks/r/stocks/comments/unlngs/alright_bagholders_what_are_your_biggest_losers.json": "It’s been the worst start to the year for the S&P500 since 1939 so let’s hear it\nfor another reason we’re living through historic times. In an attempt to find\ncomfort by having company in misery let’s hear everyone’s worst picks and\nperformers. I’ll share mine and realize some of these losses are…",
  "data/reddit-stocks/r/investing/comments/unl4x3/airbnb_how_can_we_justify_its_current_price.json": "Title says it all. Noticed the P/E ratio for AirBnb was 99 compared to Meta at\n~14, Google at ~20, Marriott at ~37, and Hilton at ~52.\n\nIf we believe a recession is incoming and a suspected real estate bubble\nhappening, how can we justify this evaluation for a company that is facing…",
  "data/reddit-stocks/r/stocks/comments/un6kvk/selling_individual_stocks_at_a_gain_and.json": "Hello all. I have a few stocks that have weathered the current downturn pretty\nwell.\n\nLLY, UNH, KO, SYY, MCD, WMT, COST. Roughly around 35k all together. I am up\nbetween 4-25+ % all time of these buys.\n\nMy question is: Would it make sense to sell these stocks at a gain, and put the\nmoney directly…",
  "data/reddit-stocks/r/stocks/comments/unocre/ark_invest_buys_more_coinbase_after_earning_drop.json": "ARKK\n\nDirection Ticker Company Name Shares Traded % of Total ETF Buy COIN COINBASE\nGLOBAL INC 360,855 0.252 Sell SE SEA LTD 319,278 0.243\n\n\n\nARKF\n\nDirection Ticker Company Name Shares Traded  % of Total ETF Buy COIN COINBASE\nGLOBAL INC 123,122 0.7747 Sell SE SEA LTD 81,336 0.5579\n\n\n\nARKW\n\nDirection…",
  "data/reddit-stocks/r/stocks/comments/uncxt7/institutional_buyers_have_been_net_buyers_of.json": "Per Bank of America, Institutional buyers been net buyers of stocks recently.\nDitto for individuals. A positive sign for all those looking for a bottom. Of\ncourse any economic news or global news could easily change that perspective.",
  "data/reddit-stocks/r/Bogleheads/comments/unch08/reminder_keep_investing_in_proven_funds_stay.json": "https://finance.yahoo.com/news/coinbase-keep-customer-balances-event-103410414.html\n\n\"Coinbase will take your coins if it goes bankrupt.\n\nThat was the rather jarring message in the first quarter earnings release for\nthe leading U.S.-based centralized exchange. It says customers balances will…",
  "data/reddit-stocks/r/stocks/comments/unq1tj/are_we_honestly_surprised.json": "I've been investing for more than a decade and I don't get why everybody is\nfreaking out about the market. I'm also down significantly on certain stocks,\nbut let's not act like we never saw a possibility of this happening. SHOP at\n200B evaluation? EV-makers with barely any development worth more…",
  "data/reddit-stocks/r/stocks/comments/unr1bx/lessons_from_a_market_crash.json": "Hi everyone, I'm feeling really depressed for the past few days. The Luna/UST\ndebacle and watching the market continue to tank while DCAing is really getting\nto me. To clear my mind, I wrote this piece:\n\n\nLESSONS FROM A MARKET CRASH\n\nWhen the initial panic hits, it hits hard and fast. As soon as…",
  "data/reddit-stocks/r/Bogleheads/comments/unsdq5/oh_no_the_market_is_going_down_how_terrible.json": "On his sixteenth birthday, a boy gets a horse as a present. All of the people in\nthe village say, “Oh, how wonderful!”\n\nThe Zen master says, “We’ll see.”\n\nOne day, the boy is riding and gets thrown off the horse and hurts his leg. He’s\nno longer able to walk, so all of the villagers say, “How…",
  "data/reddit-stocks/r/stocks/comments/unxqpb/now_will_people_admit_we_were_in_a_bubble.json": "I remember about a year ago how many people were debating it on here\n[https://www.reddit.com/r/stocks/comments/ke9vze/reading_about_the_dotcom_bubbleit_seems_exactly/gg1cdj9/?context=3]\nand people blasted and downvoting anyone that stated it was a bubble. Saying it\nis different now - yes, causes…",
  "data/reddit-stocks/r/stocks/comments/unp5ra/with_todays_dip_vti_is_officially_in_2020_price.json": "I truly think the market will continue going down this quarter, but today VTI\nhit a milestone. It hit Dec 2020 pricing. Nasdaq has been there for quite a\nwhile now, but today was the first for VTI. I know this sub hates doing it, BUT\nany guesses at the bottom for VTI before rebuilding? May be 170…",
  "data/reddit-stocks/r/stocks/comments/unm5qj/rivian_lost_159_billion_and_delivered_1227.json": "Rivian, the buzzy electric vehicle company backed by Ford and Amazon, reported a\nnet loss of $1.59 billion in the first quarter of 2021 based on $95 million in\nrevenue. The company said it delivered 1,227 vehicles to customers during the\npast three months, bringing its total number of deliveries to…",
  "data/reddit-stocks/r/stocks/comments/uny0ns/life_is_more_than_money_and_you_shouldnt_take.json": "The first time that I entered the stock market was way back in 2017, when AMD\nwas still at $11. I was 100% sure that it would go up since semiconductors are\nthe future, and it was being shorted and so undervalued. But as a newbie in the\nstock market, I panic sold at a loss (I could've been up 900%…",
  "data/reddit-stocks/r/investing/comments/unva24/can_someone_explain_to_me_where_value_goes_when.json": "Crypto is obviously not a safe storage of wealth when it easily crashes 50-90%\n(or more) on a whim. People are moving their money out of stocks and the bubble\nhas burst.\n\nBut where is money going? Cash is losing like 8-10% in value each year and we\ncan clearly see this by rising food and energy…",
  "data/reddit-stocks/r/stocks/comments/uo0fua/be_greedy_when_others_are_fearful.json": "The market is in panic mode. Peak fear is when the news are bad and will\nprobably continue to be bad in the future. And I'm seeing a lot of people\ntalking themselves into how what they're doing isn't panic selling, it's\n\"changing my strategy\" or \"adapting to the macro economics\". Nobody who's…",
  "data/reddit-stocks/r/investing/comments/uo07kk/excuse_me_for_sounding_ignorant_but_it_seems_like.json": "So, I’m just one person in the stock market, so my perspective and knowledge is\nlimited to my own, so pardon please. I’m trying to wrap my head around the\ncurrent situation with the fed and the interest rate hikes and deleveraging\nevents etc.\n\nSo…we have high inflation rate, which is are supposedly…",
  "data/reddit-stocks/r/Bogleheads/comments/uo1eh7/william_bernstein_the_delusions_of_crowds_why.json": "BEHAVIORAL AND HISTORICAL FINANCE\n\n\nWILLIAM BERNSTEIN THE DELUSIONS OF CROWDS: WHY PEOPLE GO MAD IN GROUPS\n\n4 Signs of a bubble\n\n 1. Everyone around you is talking about it. And you should start worrying when\n    people talking about getting rich in certain areas of the market don't have\n    a…",
  "data/reddit-stocks/r/investing/comments/untrr0/supply_chain_shock_will_likely_get_slightly_worse.json": "As Shanghai lockdown goes into its end, we would expect supply bottlenecks ease\na little bit. But the short term shock is still to be felt. The largest increase\nin CPI is most likely March as oil jumps. But the largest increase in PPI might\nstill be ahead of us as the shock unravels.\n\nAs an…",
  "data/reddit-stocks/r/stocks/comments/unye0s/margin_debt_the_equivalent_of_2008_housing_crash.json": "Seeing a lot of posts about folks encouraging others not to harm themselves\nbecause of the market or posting about wanting to harm themselves. Most of these\nrelate to margin accounts that got blown up. Just like in 2008, just because\nsomeone will lend you money does not mean you can necessarily…",
  "data/reddit-stocks/r/stocks/comments/uo1gtr/i_am_beginning_to_think_that_the_priced_in_theory.json": "So many people will tell you that the markets are forward looking. That\neverything but a true crisis will not affect the markets too badly since it is\nalready “priced in.”\n\nSince this latest drop in the market more or less started with the Fed’s last\nmeeting announcement (excluding the little fake…",
  "data/reddit-stocks/r/stocks/comments/unwjym/and_so_a_generation_of_shorts_was_born.json": "\"Average in\" \"Diversify\" \"Invest\". Words you used to hear. Now it's a game of\nboom and busts. Is the entire market/economy a pump and dump? Are the pro's,\nmarket makers, fed bad at this, or is it all to create the most wealth? 8% here\n& there seems not to be enough. How to create the most money?…",
  "data/reddit-stocks/r/Bogleheads/comments/uo4gw1/how_many_of_you_feels_nothing_about_the_recent_dip.json": "Just checked my portfolio yesterday, my thought was it's funny to see my gains\nwas gone, but I'm gonna keep invest through the next 35+ years, nothing to worry\nabout, it's not like I have any better alternative to invest in long term.\n\nI understand it's not big crash, not 2008 level, I wonder how…",
  "data/reddit-stocks/r/stocks/comments/unhiy3/coinbase_stock_crashing_today_again.json": "Coinbase Tumbles to Record Lows as Crypto Meltdown Deepens\n\nCoinbase Global Inc. shares and bonds fell to new lows Wednesday, signaling\ninvestor skepticism about the prospects of the crypto exchange in a\nbear-market. \n\nShares plunged 23% to $56.04 as of 10:17 a.m. in New York, a far cry from…",
  "data/reddit-stocks/r/stocks/comments/uo21px/seriously_why_is_rivian_moving_upwards.json": "I'm baffled at this. The stock is shooting up 20% in spite of blatantly giving\nlip service to investors and missing every single target that would have shown\nthey're actually scaling up production. So far they've:\n\n * Missed revenue estimates\n * Increased spending and debt exponentially\n * Produced…",
  "data/reddit-stocks/r/Bogleheads/comments/uo23op/i_was_buying_spy_at_440_oof_guess_that_means_ill.json": "Buy more",
  "data/reddit-stocks/r/stocks/comments/uo2jq2/nintendo_announces_surprise_10for1_stock_split.json": "Nintendo announced that they will do a stock split which will take effect on\nOctober 1. I do not own any but plan on doing so.\n\nhttps://www.cnbc.com/2022/05/10/nintendo-plans-10-for-1-stock-split-says-switch-sales-to-fall-9percent…",
  "data/reddit-stocks/r/stocks/comments/uo6m3s/just_stop_trading.json": "New day, new self-help thread.\n\nPeople panic-selling, panic-buying, averaging down, liquidating, talking about\n\"the crash isn't even here yet.\"\n\nNobody knows. Nobody. And honestly, if you're retiring, you need to talk to a\nfinancial advisor.\n\nThe rest of you are <35 and got your asses beat. Now…",
  "data/reddit-stocks/r/stocks/comments/unx6t2/rstocks_daily_discussion_options_trading_thursday.json": "This is the daily discussion, so anything stocks related is fine, but the theme\nfor today is on stock options, but if options aren't your thing then just ignore\nthe theme and/or post your arguments against options…",
  "data/reddit-stocks/r/stocks/comments/uo6qsq/apple_enters_a_bear_market_today.json": "Its official as of today, Apple the last tech giant to hold out is now in a bear\nmarket. Google, Microsoft, Netflix, Facebook, and Amazon entered a bear market\naround the March and beginning of May sell off while Apple was the last tech\ngiant to enter a bear market. Today is the day where…",
  "data/reddit-stocks/r/Bogleheads/comments/uo74iw/tomorrow_513_is_the_day_im_going_to_buy_in.json": "because it falls on a Friday and that is when my weekly autoinvest into Vtsax is\nscheduled.",
  "data/reddit-stocks/r/investing/comments/uo8arv/teetering_on_the_brink_of_a_bear_market_the_greed.json": "https://www.cnn.com/markets/fear-and-greed\n\nit has reached a low of 6, indicating extreme fear and extreme bearish sentiment\nfrom investors across the board. The S&P 500 is teetering on the brink of a bear\nmarket and is less than 1 percentage point away from hitting the necessary -20%\nbenchmark for…",
  "data/reddit-stocks/r/stocks/comments/uo9cgd/some_stocks_are_looking_downright_irresistible.json": "I'm not making any moves yet, but I'm getting my shopping list ready and there\nare some absolutely crazy values out there right now.\n\n 1. PYPL - Currently trading at a price it hasn't seen since 2018, and is at the\n    lowest P/E in its entire history. The last time the P/E was anywhere near\n   …",
  "data/reddit-stocks/r/stocks/comments/uo7ymc/i_thought_i_could_get_ahead.json": "Invested my down payment in April to try and “be smart” and grow the money to\nbuild a rocket to try and catch runaway home prices. And now I’ve lost 20% of my\nprincipal, effectively setting me back 2 years worth of saving. This rocket I\nwas trying to build, blew up in my face. Houses continue to…",
  "data/reddit-stocks/r/stocks/comments/uo2vxo/nasdaq_was_down_almost_as_much_as_it_was_in_march.json": "On February 19, 2020, the NASDAQ composite made a local peak of $9,840. News of\na rapidly spreading global pandemic, shutdowns of entire economies, and lots of\ndeaths sent the NASDAQ spiraling basically straight down for 5 weeks in a row to\n$6,631 by March 23, in total, 32.6% of the value was lost…",
  "data/reddit-stocks/r/stocks/comments/uo7u1q/senate_prepares_to_confirm_powell_to_second_term.json": "https://www.wsj.com/articles/senate-prepares-to-confirm-jerome-powell-to-second-term-leading-federal-reserve-11652364772\n\nThe Senate is poised to confirm Federal Reserve Chairman Jerome Powell to a\nsecond four-year term that is shaping up to be every bit as trying as his first\nterm as the central…",
  "data/reddit-stocks/r/investing/comments/uoafni/softbank_loses_26_billion_on_tech_investments.json": "https://www.wsj.com/articles/softbank-reports-13-billion-annual-loss-hit-by-tech-share-slump-11652339726\n\nTOKYO— SoftBank Group Corp. 9984 -8.03% on Thursday reported an enormous $26.2\nbillion loss on its big portfolio of technology companies in the first three\nmonths of the year, as the company…",
  "data/reddit-stocks/r/stocks/comments/uobcww/powell_sees_more_pain_ahead_admits_soft_landing.json": "Some of the important parts of Powell recent interview:\n\nPowell: So you can see that inflation is just way too high here in the United\nStates. And by the way, the same all over the world, really, the global\neconomies all around the world have been hit by a series of inflationary shocks\nand, pretty…",
  "data/reddit-stocks/r/investing/comments/uobsfs/backtested_a_volatility_strategy_from_an_academic.json": "Hello r/investing [/r/investing] friends, FinanceTLDR here,\n\nI recently backtested a \"volatility managed strategy\" from Alan Moreira and\nTyler Muir's 2017 paper \"Volatility Managed Portfolios\"\n[https://onlinelibrary.wiley.com/doi/abs/10.1111/jofi.12513]. My results show\nthat following their…",
  "data/reddit-stocks/r/stocks/comments/uof705/i_needed_to_see_this_market_crash.json": "Yes it sucks that nearly all of my stocks are in the red right now. It is\npainful. But I needed this reminder, as I'm sure many of you did. Seeing the\nhuge bubble for not only stocks, but especially crypto and NFT's made me have\nthat thought of \"what if this time is different?\" \"They didn't have…",
  "data/reddit-stocks/r/stocks/comments/uodtpp/invested_200k_in_january_2022_now_what_i_need.json": "Unfortunately it was a lump sum. Luckily i invested in the SPY ETF broad index\nfund, but still it hurts a lot that my balance is now only 160k! What should i\ndo? just wait and DCA? I mean it will probably take years to break even! This\nwas like 90% of my net worth being crushed on a daily basis, i…",
  "data/reddit-stocks/r/stocks/comments/uofcca/a_simple_south_park_index_fund_beats_the_sp_not_a.json": "INTRO\n\nI'm aware of how WallStreetBets-y this post sounds, and to be fair I did post\nsomething similar there earlier today\n[https://www.reddit.com/r/wallstreetbets/comments/uo246c/ask_and_you_shall_receive_the_south_park/].\nBut bear with me - I tried to be more sober with this analysis.\n\nI made…",
  "data/reddit-stocks/r/investing/comments/uocdc2/how_come_bank_stocks_are_falling_so_hard.json": "if interest rates are going up shouldn't this be a positive thing for bank\nstocks? bank of america, JPM etc.. have all been destroyed over the last 2\nweeks.\n\n\n\nif interest rates are going up shouldn't this be a positive thing for bank\nstocks? bank of america, JPM etc.. have all been destroyed over…",
  "data/reddit-stocks/r/stocks/comments/uodzms/to_the_long_term_later_in_life_investors_when_do.json": "I began investing about 8 years ago but I was a teenager at the time. I have\nbeen lucky enough to have family teach me about money and investing from an\nearly age so I was excited to start.\n\nI did a fair amount of research, and bounced ideas off family and decided to put\nmy little big money into…",
  "data/reddit-stocks/r/stocks/comments/uofg16/if_you_had_a_large_cash_position_today_how_would.json": "Some relatives of mine recently sold real estate. They noticed that the stock\nmarket was down almost 20% and wanted to invest, instead of leaving the cash in\nthe bank. How would you invest if you had a large cash position today?",
  "data/reddit-stocks/r/investing/comments/uoc6rq/what_are_you_loading_up_on_during_this_dip.json": "I’ve been getting more interested in ETFs, I’m 90% VTI and 10% LIT, but there’s\na lot that I’m watching. I’m curious to what everyone else is doing. I’m\ncurrently just buying more VTI.\n\nAnyone have interesting plays for short term? Long term? NVDA? Real\nestate/REITs? Convertibles? What’s your…",
  "data/reddit-stocks/r/stocks/comments/uo4hs9/bagholders_of_dkng_whats_your_plan.json": "I'm bag holding 200 shares of DKNG at an average price of $48.49/share.\n\nI'm thinking of waiting it out, but I'm more than aware that it's gonna be it\ncould (and likely will) be a long wait.\n\nWhat are the rest of you doing?",
  "data/reddit-stocks/r/stocks/comments/uooesy/for_everyone_who_asked_what_the_risk_was_buying.json": "It is obviously still to be seen if the deal will close, but this is a perfect\nexample of the risks that exist along the way. Twitter shares have currently\ntumbled, which also begs the question if the $54/share offer will come down\nbefore it closes, if it…",
  "data/reddit-stocks/r/investing/comments/uooodr/musk_puts_on_hold_44billion_deal_for_twitter.json": "Another twist in the Twitter acquisition soap opera. Posted since quite a few\npeople had been interested in arb-ing the acquisition recently.\n\nhttps://www.reuters.com/technology/musk-says-44-billion-twitter-deal-hold-2022-05-13/\n\n> May 13 (Reuters) - Elon Musk on Friday put his $44-billion deal for…",
  "data/reddit-stocks/r/stocks/comments/uoqev0/twitter_musk_deal_on_hold_he_likely_thinks_its.json": "Source:\nhttps://www.cnbc.com/2022/05/13/elon-musk-says-twitter-deal-on-hold-pending-details-on-fake-accounts.html\n\nAlso breaking news on most other financial publications....\n\n\"Elon Musk announced Friday that his Twitter deal is on hold until he receives\nmore information about how many fake…",
  "data/reddit-stocks/r/Bogleheads/comments/uopzd7/pay_day_also_known_as_dca_day.json": "Stay the course daddies and mommies\n\nEdit: I've been educated on what DCA actually means. I guess it's lump sum day?\nHonestly don't even know when the money hits the 401K, I just know the employer\nsends it on payday\n\nEdit 2: Maybe I was right the whole time, lol",
  "data/reddit-stocks/r/stocks/comments/uojtfo/realistically_what_is_the_worst_thing_that_can.json": "I’m 20 years old and bought a house about a year ago. I believe that if I were\nto sell it right now I would come out with a little under $100k. If I were to\nput all of this into spy which will never touch $0 unless the world falls apart\nwhat could go wrong? I don’t need the money short term and if…",
  "data/reddit-stocks/r/stocks/comments/uox06i/what_the_fuck_happened_to_this_sub.json": "I used to come here and see informative posts on tickers I've never heard of. I\nhad intellectual conversations with people on sectors and learned new stuff\nabout industries I didn't know about.\n\n\n\nNow I come here, and all I see is the same stuff, \"I have 20k, where should I\ninvest it?\" or, \"Is the…",
  "data/reddit-stocks/r/investing/comments/uojspd/sp_600_small_caps_has_lowest_forward_pe_ratio_in.json": "Yarden reasearch showed some data from last few days that shows that s&p 600\nsmall caps slashed their forward P/E from 28 to less than 12. S&P 600 had 12\nforward P/E ratio only briefly in 2020 before absolute bullrun and in 2008 after\nstart of housing crisis, it didnt crashed so low not event in…",
  "data/reddit-stocks/r/stocks/comments/uoxz1f/cnbcs_jim_cramer_says_the_market_is_signaling_to.json": "CNBC’s Jim Cramer says the market is signaling to pick up beaten-down,\nprofitable tech names. If you had taken the opposite of Jim Cramer’s trades you\nwould be up 9.49% YTD. Given his prediction track record, do you think the sell\noff will continue?\n\nYes, Inverse Cramer\n\nI’m also buying\n\nI am not…",
  "data/reddit-stocks/r/stocks/comments/uosnn2/tesla_places_electric_vehicle_plans_for_india_on.json": "Tesla (TSLA) has been pushing the government in India for more than a year to be\nallowed to sell electric vehicles locally imported from production hubs in the\nUnited States and China at lower tariffs.\n\n\n\nThe Indian government has been steadfast in its demand that Tesla commit to\nbuilding a local…",
  "data/reddit-stocks/r/Bogleheads/comments/uoujmk/would_you_recommend_buying_fzrox_in_your_roth_ira.json": "Im 18 years old-fashioned and I set up a ROTH IRA recently with Fidelity and I\nhave put abt $1500 all into FZROX. I dont have really much more money to invest\nright now but i plan on putting ‏‏‎ some money every paycheck.",
  "data/reddit-stocks/r/stocks/comments/uoz8os/warner_bros_discovery_a_bargain.json": "WarnerMedia was recently spun into Discovery Inc, creating the world's second\nlargest media company and possibly the most profitable. Instead of generating\nenthusiasm, it entered into a declining market that is particularly skeptical of\nmedia stocks, and the combined companies are now trading at…",
  "data/reddit-stocks/r/stocks/comments/up16l4/what_do_you_think_is_going_to_happen_once_the_fed.json": "The fed is going to start reducing their balance sheet by 50 billion next month\nand going up to 95 billion by Sept, what is effectively going to be a \"reverse\nmoney printer\" event. Do you guys think the market has priced this in yet or is\na lot more pain to come? I look at the charts and see how…",
  "data/reddit-stocks/r/Bogleheads/comments/uou041/what_types_of_bondsbond_funds_do_people_hold_for.json": "I've been thinking about getting Ibonds since I'm currently an all equity\nposition (20% voo 80% VT) since I still have a huge investing time frame and I\nwasn't sure if Ibonds counts for that, or if I should invest in something like\nBNDW for that position?\n\nBNDW looking kind of sad lately, but…",
  "data/reddit-stocks/r/Bogleheads/comments/uozyw7/way_to_buy_seriesi_bonds_for_10k_per_year.json": "Given the high inflation adjusted rates on I-bonds currently, I know several of\nus wish there was a way to buy more than the $10k (or 15k if using tax refund).\nI recently found out that there is in fact a way to do this using the gifting\nfeature of ibonds through TreasuryDirect.\n\nIn Jan this year,…",
  "data/reddit-stocks/r/Bogleheads/comments/up3qg7/sell_voo_at_a_loss_to_buy_vti.json": "I have 50 shares of VOO. I'd like to own VTI instead. Right now, I'm down 6.9%\nsince I bought the VOO shares. Since I want to be in VTI, and I wouldn't pay\ncapital gains if I sold, is there any reason why I shouldn't sell and re-buy\nnow?",
  "data/reddit-stocks/r/stocks/comments/uonvmr/rstocks_daily_discussion_fundamentals_friday_may.json": "This is the daily discussion, so anything stocks related is fine, but the theme\nfor today is on fundamentals, but if fundamentals aren't your thing then just\nignore the theme and/or post your arguments against fundamentals…",
  "data/reddit-stocks/r/investing/comments/up69zk/tesla_begins_accepting_orders_for_electric.json": "Tesla has reportedly begun taking orders for electric semi-trailer trucks in the\nUnited States. Tesla is offering two models, a semi-trailer model starting at\n$150,000 with a 300-mile range and a semi-electric vehicle starting at $180,000\nwith a 500-mile range per charge.\n\nTesla shares were up 6.73…",
  "data/reddit-stocks/r/stocks/comments/uoxxe4/ko_and_other_value_stocks_are_overvalued.json": "As the markets take a leg down many investors rush to safer assets seeking\nstability this inflow in buying pressure is inflating assets such as JNJ, KO,\nCOST since they have a better margin to stand inflation. These are companies are\nprofitable and will keep a healthy net margin as the fed…",
  "data/reddit-stocks/r/investing/comments/up1wxq/what_the_fed_shouldcouldwill_do_with_monetary.json": "Hello FinanceTLDR here again.\n\nBy now we should all agree that the Fed is tightening monetary policy. However,\nthere is a lot of disagreement on what the Fed should/could/will do with\nmonetary policy moving forward. And whatever they do end up doing will have huge\nimplications on the overall…",
  "data/reddit-stocks/r/Bogleheads/comments/up86db/psa_dont_forget_to_tax_loss_harvest_if_you_have.json": "Sell one broad index for another similar one -- don't get out of the market. But\nharvest those losses!\n\nFor example: I had VTI which lost thousands, so I sold it and bought ITOT (very\nsimilar but not a wash sale). That lost thousands, too, so I sold it and bought\nVOO. I was only out of the market…",
  "data/reddit-stocks/r/Bogleheads/comments/upbzkg/hedgefundies_excellent_adventure_update_this.json": "Whenever people stop talking about a recently hot strategy, I feel the urge to\ncheck in on it and see why. The two components of HFEA are UPRO (3x leveraged\n500 index) and TMF (3x leveraged long-term Treasuries). These are currently down\n~45% and ~50%, respectively YTD. One of the big 'selling…",
  "data/reddit-stocks/r/investing/comments/uou8j1/one_key_component_in_the_economy_and_why_a_major.json": "It’s personal savings rate and its ability to prop up consumer demand. Look at\nthe chart in https://fred.stlouisfed.org/series/PSAVERT, you will see that the\nsavings rate is dangerously low from 04-08. Then the bubble popped and nobody is\nable to spend anymore.\n\nNow looking at what we have now -…",
  "data/reddit-stocks/r/wallstreetbets/comments/uowhsv/the_only_thing_up_this_year_is_your_rent_and_its.json": "CPI from the BLS says that rents are up 5% over the last 12 months, but that's\nnot even close to reflecting the rents shown elsewhere. We all know this though,\nask anyone about their rent and you'll get some anecdotes saying 2-5%, but\nyou'll get a lot more saying 15-30%.\n\nThe chart below shows how…",
  "data/reddit-stocks/r/Bogleheads/comments/uowka0/bogleheads_conference_update_5132022.json": "https://sparknetwork.com/bogleheads-annual-conference-2022-registration\n\nOctober 12-14\nOak Brooks Hills Resort\nWestmont, IL (15 miles south of O’hare Airport).\n\n78% of the 500 tickets sold in the first two weeks and the Hilton room block is\nalso filling.\n\nThe Early Bird price of $395 goes through…",
  "data/reddit-stocks/r/stocks/comments/upbipy/why_are_people_freaking_out_now_is_the_time_to.json": "Like, people wish they had bought things like aapl and goog back in 09-12 after\nthe recession, but now are afraid to put money into the market. If it blows\nup…that’s a good thing. In five years you’re gunna be rich when all this\nstabilizes",
  "data/reddit-stocks/r/investing/comments/up6mh6/is_it_too_early_to_start_dollar_cost_averaging_in.json": "I’m 28, in it for the long-term, and currently have 100% of my portfolio in the\nS&P 500 Index VOO (low six-figure). I’m still way up since I started investing a\nfew years so happy to keep holding what I have as I’m not one to try and predict\nwhere the bottom is, I’d rather just ride the wave and…",
  "data/reddit-stocks/r/Bogleheads/comments/up8dj1/i_have_5_figures_in_losses_in_vti_i_make_about.json": "Unrealized losses in taxable brokerage. Having trouble bringing myself to TLH\nbecause I’m afraid of making a mistake.",
  "data/reddit-stocks/r/stocks/comments/up8oi2/bofa_strategists_say_investor_exodus_signals_true.json": "To sum up the article: this is a bear market rally and we haven't hit bottom\nyet.\n\n“The definition of true capitulation is investors selling what they love,”\nHartnett said, citing Apple, big tech, the dollar and private equity. The\nmeltdown in cryptocurrencies and speculative tech now rivals the…",
  "data/reddit-stocks/r/Bogleheads/comments/up4kvi/is_vt_chill_unsustainable_for_american_investors.json": "https://www.morningstar.com/articles/698315/how-much-foreign-stock-and-bond-exposure-do-you-need\n\nThis article is from a few years ago now (back when global market cap weights\nwere closer to 50/50 rather than the 60/40 they are now), but their argument\nstill holds seems to me.\n\nIn particular they…",
  "data/reddit-stocks/r/stocks/comments/upjbv5/why_inflation_has_most_likely_peaked_according_to.json": "I wanted to highlight a superb Substack blog post\n[https://apricitas.substack.com/p/peak-inflation?s=w] by Joseph Politano, an\nanalyst at the Bureau of Labor Statistics. I'm going to briefly summarize\narticle and pepper in my own graphs and commentary, but as always, please read\nand support his…",
  "data/reddit-stocks/r/investing/comments/upiim3/safe_play_for_choppy_markets_and_strong_usd.json": "Keeping it as simple as possible...Markets have been weakening recently.\n\nThe dollar has been strengthening.\n\nIf you are bullish about economic recovery in world markets it seems sensible\nimo to back Gold right now. Why?\n\nGold has an inverse relationship with the USD traditionally. When the value…",
  "data/reddit-stocks/r/investing/comments/upkdto/why_does_this_fund_invest_in_treasury_bills.json": "I’m was researching into funds and found \"Lazard Commodities Fund C Acc GBP”\nwhich is supposed to invest in commodities, but when I look at it’s holdings 7\nof it’s top 10 holdings and almost 90% of it’s portfolio is in US Treasury\nBills. Is this correct?\n\nPlease go to this link to see its…",
  "data/reddit-stocks/r/stocks/comments/upnm28/a_data_driven_detailed_analysis_of_why_weve_hit.json": "I live in the Midwest and everyone here loves Mountain Dew Livewire. Over the\npast few years I’ve been able to gauge how bad the supply chain woes have been\nbased on it’s availability in gas stations. Every gas station is now restocked\nwhich means supply chain issues are easing. I’ll report back if…",
  "data/reddit-stocks/r/wallstreetbets/comments/upganz/elon_musk_said_his_team_is_going_to_do_a_random.json": "Elon Musk on Friday said he plans to conduct his own research to determine the\namount of Twitter users that are actually bots before his purchase of the social\nmedia company continues.\n\nIn a tweet sent early Friday morning, Musk said the Twitter deal was on hold\nuntil he could verify the site's…",
  "data/reddit-stocks/r/investing/comments/uphj04/best_broker_for_short_positions.json": "All of my brokerage accounts (Schwab, Vanguard, IBKR) allow selling stock short,\nbut they charge an interest rate. This interest for shorting isn't easy to find,\nwhich makes it hard to compare brokers.\n\nIf there are any short sellers here, what is your experience on various brokers?\n\nWhere can I…",
  "data/reddit-stocks/r/stocks/comments/upno8s/high_volume_dumping_apple_shares_thursday_at_142.json": "My question to you;\n\n1)There was a lot of volume trading Apple on thursday when apple dropped to\n142$/share.... does that mean that more people wanted to sell apple then buy\napple on that day?\n\n2) then the next day apple shares rose to 146$/share but on a smaller volume ,\nso does that mean there…",
  "data/reddit-stocks/r/stocks/comments/upsas5/my_dad_wants_to_sell_his_whole_portfolio_how_to.json": "So he just read an article which states that the market will crash by 90% this\nyear which will result in the biggest crash the world has ever seen. My attempts\nto convince him otherwise have all failed today. He is planning on selling his\nwhole portfolio when markets open on monday. Anybody got any…",
  "data/reddit-stocks/r/investing/comments/upsopn/the_fed_is_really_worried_about_a_wageprice_spiral.json": "Hello FinanceTLDR here again,\n\nI spent the last few days reviewing Fed commentary and here’s what I gleaned\nabout what the Fed is really worried about.\n\nMost of us know the Fed is targeting inflation at 2%. Actual inflation is way\nhigher than that.\n\nThe Fed used to think it’s transitory, but have…",
  "data/reddit-stocks/r/stocks/comments/upoqpf/with_7_trillion_evaporated_in_nasdaq_alone_per.json": "During COVID19 crash and recovery, US federal government and Federal Reserve\ninjected to 10.6 Trillion USD to the market providing liquidity, which turned\nout to throw fuel on inflationary fires [SOURCE]\n[https://www.covidmoneytracker.org/]\n\nNow per Bloomberg, 7.6 Trillion USD has been evaporated…",
  "data/reddit-stocks/r/Bogleheads/comments/upm9l4/it_it_always_recommended_to_max_401k_and_roth_ira.json": "Background, I am in union that has a defined benefit pension, and a annuity\ncontribution(defined contribution), payed for by the employer. The union also\noffers a non-employer matched 401k. I already max a Roth IRA, is it still\nimportant to max a 401k before investing in a taxable account, or…",
  "data/reddit-stocks/r/Bogleheads/comments/upwo30/maxed_out_a_roth_for_the_year_then_got_a_raise.json": "I maxed out my Roth in January, and our family got raises bringing us above the\ncontribution limit. Also faced massive losses on what I bought (VFIFX, FUBO, and\nSPYG). How do I approach selling to comply with tax laws? Do I still face the\nearly sell penalties even if there’s a loss? Do I get to…",
  "data/reddit-stocks/r/investing/comments/upyyjh/the_sec_just_raised_the_fees_investors_pay_on.json": "https://www.marketwatch.com/articles/sec-trading-transaction-fees-51652556909?mod=mw_quote_news\n\n\n\n\" Put another way, that amounts to 2.3 cents per $1,000 of a securities sale.\nThat wouldn’t change most traders’ plans. The rate is recalculated every year,\nor sometimes semiannually, and has varied…",
  "data/reddit-stocks/r/investing/comments/uplndn/analysis_basic_fit_nv_low_cost_gym_operator_in.json": "QUANTITATIVE EVALUATION\n\nhttps://docs.google.com/spreadsheets/d/1RCHHJNLCwdxm8cPQT7kohKkqzj-5dOstOHEvAfVXKHY/edit?usp=sharing\n\n\nQUALITATIVE EVALUATION\n\nBasic Fit is a low cost gym operator in Europe.\n\nIt’s the largest operator around, with big growth potential in terms of\nlocations and niche (under…",
  "data/reddit-stocks/r/stocks/comments/upkw0v/running_out_of_cash_should_i_sell_my_apple_and.json": "Hi all ♥️\n\nI am quickly running out of cash. I have always had a little cushion in my\nportfolio of Apple and Facebook stock, but not much… Only about $50,000 worth.\n\nI was hoping to hold them long-term, but wondering at this point if I should go\nahead and sell them. That is all I have, and worried…",
  "data/reddit-stocks/r/stocks/comments/upx8eh/what_do_people_think_of_amzn.json": "As the title asks. I have a sizable position in the company, but it is down 40%.\nIt is the only individual stock I own. Most of my other investments are in SPY\nand QQQ, with a little in mid-cap and international index funds.\n\n 1. Its P/E is very high, especially compared to Apple, Google, MS. Some…",
  "data/reddit-stocks/r/stocks/comments/uq8vp3/friendly_reminder_not_everyone_here_is_2030_years.json": "Yes, the market will recover: that’s a fact.\n\nHowever, it can take a long time to recover. The nasdaq took over a decade to\nrecover in some instances.\n\nI understand the sentiment of “hold and even buy more when they start to go\ndown” but if you are in your 60s and want to retire soon and can’t wait…",
  "data/reddit-stocks/r/investing/comments/uq231v/im_looking_for_a_security_that_represents.json": "Inflation is brutal and I'm looking to park my money in an asset that will hedge\nagainst inflation and give on top of that a small but stable return.\n\nFor some odd reason, my mind went to buying a flock of sheep and I'm thinking\nit's a great idea for the following reasons:\n\n 1. While sheeps as an…",
  "data/reddit-stocks/r/wallstreetbets/comments/upm1a5/real_estate_the_biggest_ponzi_scheme_in_history.json": "The mean housing price in 1971 was $25,200. The mean housing price today is\n$392,000\n\nYou can say that that’s inflation, but let’s look at the CPI:\n\nA gallon of milk in 1971 was $1.19, and it’s $4 now.\n\nHow come home prices have gone up 16x, while milk has increased in price by less\nthan 4x?\n\nHome…",
  "data/reddit-stocks/r/stocks/comments/uq9hwd/an_overview_of_musks_proposed_twitter_acquisition.json": "I want to focus on the recent developments in Musk's offer to acquire twitter,\nand some aspects not always discussed in 3 minute finance articles or headlines.\nBut first, a refresher:\n\nElon Musk built a 9.2% stake in Twitter during the first few months of 2022. On\nApril 20th, he offered to take…",
  "data/reddit-stocks/r/investing/comments/uq8smy/is_investing_very_small_amounts_of_money_worth_it.json": "I’ve never invested before but I’m very interested in it and it’s something I’d\nlike to learn more about.\n\nI’m currently a student so I don’t have a large amount of disposable income.\n\nI was wondering if investing very small amounts, like around £10 is worth it\njust to practice and observe what…",
  "data/reddit-stocks/r/Bogleheads/comments/uqcldg/fyi_it_took_qqq_16_years_to_reach_back_up_to_the.json": "2000->2016\n\nYou can see from the graph below:\n\nhttps://finance.yahoo.com/quote/QQQ/\n\nIf you click on the \"max\" setting. it hit $106 in 2000 and it took until 2016,\nwhich is 16 entire years, to hit that again. This is even worse when counting 16\nyears of inflation too.\n\nI am telling investing…",
  "data/reddit-stocks/r/Bogleheads/comments/uq8ivw/if_someone_has_been_investing_for_a_really_long.json": "The consensus seems to be that bonds are needed to be held at a higher % as\nsomeone gets older/near retirement, why?\n\nObviously this is hypothetical, but you’ll see where I’m coming from.\n\nIf someone has been investing for a really long time, why not just always be\n100% stocks?\n\nI’m assuming their…",
  "data/reddit-stocks/r/stocks/comments/uq6yak/what_do_you_do_with_your_cash_once_you_have.json": "I am holding tight. Not selling any of my AAPL, AMZN, GOOG nor NVDA. We know\nthat the market is going down. It's, in general, got little to do with the\ncompany financials at the moment. It's interest rate, inflation and Russian\ninvasion scares. When one sells your shares, what do you actually do…",
  "data/reddit-stocks/r/stocks/comments/uqhu31/anybody_else_just_buying_msft.json": "I don't know which way this market is going, and neither does anyone else. I do\nknow Microsoft is embedded in practically every workflow in the country. As a\ntech worker, it's also my observation that they've been remarkably on the ball\nsince Ballmer vacated.\n\nThings are weird right now, and I…",
  "data/reddit-stocks/r/investing/comments/uqc0xf/fyi_it_took_qqq_16_years_to_reach_back_up_to_the.json": "2000->2016\n\nYou can see from the graph below:\n\nhttps://finance.yahoo.com/quote/QQQ/\n\nIf you click on the \"max\" setting. it hit $106 in 2000 and it took until 2016,\nwhich is 16 entire years, to hit that again. This is even worse when counting 16\nyears of inflation too.\n\nI am telling investing…",
  "data/reddit-stocks/r/investing/comments/uqggy5/how_to_get_a_401k_have_never_had_a_job_offer_it.json": "I have never had a job where a 401k is offered but I max out my Roth IRA and\nHSA.\n\nIs the only way to get a 401k is through a job that offers it? This seems like\nsuch an unfair concept.\n\nI would like to put more money into tax advantage accounts but Roth and hsa are\nall I can do.",
  "data/reddit-stocks/r/Bogleheads/comments/uqclt8/no_ones_giving_it_to_me_straight_are_bonds.json": "I’m hearing that bonds are awful in this market.. but so are stocks.. I’m 32 and\nI’m putting 10% of every contribution into bonds and the rest into the sthocks.\n\nBut it seems like I should just be going 100% into stock market each time.\n(VTI/VXUS or VT).\n\nI thought bones were necessary for a…",
  "data/reddit-stocks/r/stocks/comments/uqilfs/america_is_running_out_of_baby_formula_because_3.json": "https://fortune.com/2022/05/14/baby-formula-shortage-milk-monopoly-fda/\n\nA baby formula shortage gripping the U.S. since March has parents in a panic\nover where and when they’ll be able to find the products they need to feed their\nkids. The out-of-stock rate, representing the amount of formula…",
  "data/reddit-stocks/r/investing/comments/uq1as5/are_house_prices_always_going_up.json": "Hi would you be able to clarify my conclusion.I am doing a little bit of\nlearning/reaserch and i know that the market is alwas going up thats why index\nfounds as a long term investment is popular .Is the same with house market?The\nhouse prices are aleays going up apart from some events like the one…",
  "data/reddit-stocks/r/stocks/comments/uqlqu3/us_tech_stocks_hit_hard_goldman_sachs_shouts_to.json": "Growth stocks derive more of their value from cash flow at more distant points\nin time, so these assets take the biggest hit when interest rates are going to\nrise. But Katie says those who already hold these assets should remain patient\nwith them, because eventually we will be in a world where…",
  "data/reddit-stocks/r/stocks/comments/uqmo1q/the_stock_market_is_on_a_6week_losing_streak_how.json": "**The stock market is on a 6-week losing streak, the longest losing streak since\n2001. How did we get here?**\n\nThe economy is in a very tight place and is likely going to get worse. This has\ncaused stocks to come down, with major indexes down anywhere from 15% to 30%.\nCPI inflation is at 8.3% and…",
  "data/reddit-stocks/r/stocks/comments/uqth45/gamestop_appoints_new_chief_operating_officer.json": "Article\n[https://www.businesswire.com/news/home/20220516005312/en/GameStop-Appoints-New-Chief-Operating-Officer]\n\nMay 16, 2022 07:00 AM Eastern Daylight Time\n\nGRAPEVINE, Texas--(BUSINESS WIRE)--GameStop Corp. (NYSE: GME) (“GameStop” or the\n“Company”) today announced it has appointed Nir Patel to…",
  "data/reddit-stocks/r/investing/comments/uqsagw/china_vs_us_wealth_and_gdp.json": "I have looked up data on China vs US and seen that China’s net worth is larger\nthan the US’s at $120 trillion compared with $90 trillion respectively\n[https://asia.nikkei.com/Economy/China-overtakes-U.S.-in-national-net-worth-to-grab-top-spot]\n. Alternatively US has a larger GDP than China at $21…",
  "data/reddit-stocks/r/stocks/comments/uqw1tk/i_just_sold_enough_assets_to_not_have_anymore.json": "The main reason I was stressed about these dips was the idea of a margin call. I\ntruly believe that no matter how far down in value the assets I own go, that\nlong term they will win. However, with leverage like this, it’s possible they’d\ndip enough that I get a margin call, and then the exchange…",
  "data/reddit-stocks/r/stocks/comments/uqrbre/3x_levered_etfs_are_horrible_longterm_investments.json": "There have been several posts about buying 3x levered ETF as long term\ninvestment. However that is not a great idea. Here is why:\n\nAssume we have an index at 100$ and a 3x levered ETF.\n\nIf the index gains 3%, they would close at 103 and the 3xETF at 109. Easy until\nnow.\n\nLets then assume that the…",
  "data/reddit-stocks/r/stocks/comments/uqtiq0/can_we_please_stop_with_the_adviceasset.json": "These posts saying “If you’re 60+ you should have this asset mix”, or “if you\nare retired you should have that asset allocation or consider going all to\ncash.” Just stop. They always full of terrible advice. There is no blanket\napproach, nor does the age method of asset allocation work. Sure, it…",
  "data/reddit-stocks/r/stocks/comments/uqugx1/sp_forward_pe_value_below_5_and_10year_averages.json": "No one know when the bottom will be reached, if it has not already. But the\nforward price-to-earnings for the S&P 500 is 16.6. This is below the five-year\naverage of 18.6 and 10-year average of 16.9. This implies to me that we are at\nleast close to the bottom. An analyst just lowered their estimate…",
  "data/reddit-stocks/r/Bogleheads/comments/ur1a5y/which_should_i_buy_more_of.json": "I have a brokerage account with 4 shares VOO, 1 share VTI, and 8 shares VUG and\nam looking to invest approx ~10k more right now, maybe more if that seems like a\ngood strategy. If you were me, what would you do? Which fund would you most\nwanna buy up/how would you \"split\" $ between them? I'm also…",
  "data/reddit-stocks/r/investing/comments/ur4fah/musk_reportedly_says_twitter_deal_at_lower_price.json": "https://www.cnbc.com/2022/05/16/musk-reportedly-says-twitter-deal-at-lower-price-not-out-of-the-question.html\n\nElon Musk hinted that he could seek to renegotiate the price of his Twitter\ntakeover, saying a deal at a lower price wasn't \"out of the question,\" Bloomberg\nreported Monday.\n\nThe stock has…",
  "data/reddit-stocks/r/investing/comments/uqt2lv/why_is_makinghaving_debt_positive_under_inflation.json": "Dear community,\n\nIt bothers me that I cant grasp a seemingly fundamental thing, which is, that\nunder strong inflation having or making debt is good. So maybe it helps if I\ntell you quickly my situation:\n\n * My wife and me make around 250k a year, being engineers\n * We bought a place for 700k two…",
  "data/reddit-stocks/r/stocks/comments/uqv1rp/jetblue_launches_hostile_takeover_for_spirit.json": "JetBlue (ticker: JBLU) has begun a tender offer for Spirit (SAVE) shares. Spirit\nrejected JetBlue’s $3.6 billion takeover proposal earlier this month, opting to\nstick with a lower-priced bid from Frontier Group ULCC +4.56% (ULCC).\n\nIs this the new norm now I guess? I suppose with how low prices are…",
  "data/reddit-stocks/r/stocks/comments/ur4lqx/ray_dalios_bridgewater_fund_sold_its_tesla_stake.json": "Article\n[https://markets.businessinsider.com/news/stocks/ray-dalio-bridgewater-q1-tesla-elon-musk-gamestop-amc-stock-2022-5]\n\nRay Dalio's Bridgewater Associates cashed out its Tesla stock, and built new\nstakes in GameStop and AMC Entertainment last quarter, Securities and Exchange\nCommission…",
  "data/reddit-stocks/r/stocks/comments/ur4ukr/twtr_closes_below_its_price_prior_to_elon_musk.json": "On April 1 before Musk disclosed his ownership share of Twitter, TWTR closed at\n$39.31.\n\nToday it closed at $37.39.\n\nThis reflects the increasing possibility that TWTR share owners do not believe\nMusk will be able to close his deal to buy Twitter, or that he will renegotiate\nto a lower price.\n\nFor…",
  "data/reddit-stocks/r/stocks/comments/uqrx93/rstocks_daily_discussion_monday_may_16_2022.json": "These daily discussions run from Monday to Friday including during our themed\nposts.\n\nSome helpful links:\n\n * Finviz [https://finviz.com/quote.ashx?t=spy] for charts, fundamentals, and\n   aggregated news on individual stocks\n * Bloomberg market news [https://www.bloomberg.com/markets]\n *…",
  "data/reddit-stocks/r/stocks/comments/uquqgg/analysis_dca_minimizes_losses_vs_lumpsum_but.json": "Inspired by a stupid argument with somebody who was convinced DCA is just\nanother form of market timing and lumpsum is the better advice, I did a bit of\nnumber crunching.\n\nHypothesis: Dollar Cost Averaging (DCA) is better for risk averse investors who\nwant to minimize losses, because losses for DCA…",
  "data/reddit-stocks/r/stocks/comments/ur1jff/michael_burrys_end_of_q1_portfolio_short_apple.json": "Michael Burry's end of Q1 portfolio: Short Apple, Long Alphabet, Meta Platforms\n& Discovery. Only the one short position has paid off so far.\n\nhttps://markets.businessinsider.com/news/stocks/big-short-michael-burry-scion-stock-portfolio-apple-alphabet-meta-2022-5",
  "data/reddit-stocks/r/Bogleheads/comments/ur7fi6/i_just_adjusted_my_401k_contribution_allocation.json": "Am I doing this right? Or have a made a grave error?",
  "data/reddit-stocks/r/stocks/comments/ur7xol/gates_foundation_exits_alphabet_pares_microsoft.json": "Bill & Melinda Gates Foundation Trust exits its holdings in Alphabet\n(NASDAQ:GOOGL), shedding 62K of class A shares and 62K of class C shares in the\nfirst quarter of 2022, according to its latest 13F filing.\n\nThe philanthropic foundation's trust also pared its holdings in Microsoft (MSFT)\nto 945K…",
  "data/reddit-stocks/r/wallstreetbets/comments/ur7qb0/i_think_this_sub_encouraged_me_to_stop_trading.json": "Between the loss porn and my inability to discern when you cucks are being\nsarcastic or not, I think it best to get the fuck from this dark pit of despair.\nAnd I’m not talking about leaving the subreddit, I’m talking about keeping my\nmeasly money in my shallow pocket. Although there could be lots…",
  "data/reddit-stocks/r/stocks/comments/ur8ug5/warren_buffetts_berkshire_hathaway_reveals.json": "> Warren Buffett's Berkshire Hathaway added Citigroup and Paramount Global to\n> its stock portfolio last quarter, a Securities and Exchange Commission filing\n> revealed on Monday.\n> \n> The famed investor's company owned $2.9 billion worth of the banking giant's\n> shares, and $2.6 billion of shares…",
  "data/reddit-stocks/r/stocks/comments/ur9k8d/arkk_is_trading_about_30_below_its_peak_in_feb.json": "ARKK peaked just below ~$59 in February 2020. Today it closed at $41.02. In\nfact, outside of those that bought on a few select dips, investors are now\nseeing negative to flat returns going back 4 years.\n\nWhere does it go from here?",
  "data/reddit-stocks/r/wallstreetbets/comments/ur9ujx/i_am_calling_you_out.json": "User \"SolitaireyEgg\" made this post earlier today.\n\n\n\nhttps://preview.redd.it/5ibtk6pugxz81.png?width=713&format=png&auto=webp&s=d11735a772b1b80179402261413fc91493220539\n\n\n\nSolitaireyEgg, if you have any integrity, you will follow…",
  "data/reddit-stocks/r/stocks/comments/urf49y/inflation_is_a_blank_check_against_the_economy.json": "There have been a lot of opinions offered on when we might see the selling stop,\nbut it really all comes down to one issue: inflation.\n\nInflation is a blank check against the US economy. It gives the Fed complete\npower to slow the economy until it can get inflation controlled. Until investors\nknow…",
  "data/reddit-stocks/r/stocks/comments/urhx27/elon_musk_says_twitter_bid_cant_move_forward.json": "Elon Musk said his $44 billion bid for Twitter Inc. TWTR -8.18% can’t move\nforward until the company is clearer about how many of its accounts are fake.\n\nIn a tweet early Tuesday, Mr. Musk said, “yesterday, Twitter’s CEO publicly\nrefused to show proof of <5%.”\n\n“This deal cannot move forward until…",
  "data/reddit-stocks/r/Bogleheads/comments/uqz9mp/advisor_on_vtsax_vti_potential_capital_gains.json": "Hi, so I'm in the process of moving away from an actively managed portfolio at\nan advisor. One of the issues I brought up was all the capital gains taxes I pay\nyearly because they decide to sell a stock when they believe it is overvalued. I\ntold them that with VTI / VTSAX I would not have the…",
  "data/reddit-stocks/r/stocks/comments/urk1be/friendly_advice_from_a_former_stock_broker.json": "If you ever call a broker and they begin asking about why you are placing a\ntrade or what your trading strategy is trying to accomplish…that’s our nice way\nof saying the fuck are you doing?\n\nWe are professionally trained and can see what trades you are doing. We don’t\ncare about what your giant…",
  "data/reddit-stocks/r/stocks/comments/urkb3c/a_forum_thread_about_netscape_from_1999.json": "Accidentally found this:\nhttps://boards.fool.com/long-nscp-10517327.aspx?sort=whole#10517327 thread on\nNetscape from 1999 and it is incredibly fascinating time capsule.\n\nInteresting to see quite a few parallels to discussions today",
  "data/reddit-stocks/r/wallstreetbets/comments/urk35h/friendly_advice_from_a_former_broker.json": "Friendly advice from a former stock broker.\n\nIf you ever call a broker and they begin asking about why you are placing a\ntrade or what your trading strategy is trying to accomplish…that’s our nice way\nof saying the fuck are you doing?\n\nWe are professionally trained and can see what trades you are…",
  "data/reddit-stocks/r/stocks/comments/urkuv4/walmart_reports_big_earnings_miss_as_higher_costs.json": "KEY POINTS\n\nWalmart missed earnings expectations for the fiscal first quarter, as the\nretailer felt cost pressure from fuel prices, higher inventory levels and\noverstaffing.\n\nThe nation’s largest retailer on Tuesday raised its sales outlook for the year,\nbut lowered its profit expectations.\n\nCEO…",
  "data/reddit-stocks/r/Bogleheads/comments/urovnc/lost_my_bil_this_week_has_two_young_children.json": "Lost my brother-in-law unexpectedly this week. He left behind two young kids\nunder 5 and his wife. I want to setup something that will help them in life, and\nam debating between a 529-plan and custodial IRA. Obviously their education is\nimportant but keeping debating if the IRA will help more in…",
  "data/reddit-stocks/r/stocks/comments/ur8jhe/what_are_the_top_3_risks_facing_tesla_stock_in.json": "I often see people list a myriad of risk factors against investing in TSLA,\nincluding:\n\nCompetition, margin compression, material costs, new battery tech, China,\nexecution risk, PE compression...etc, and not least of all, Elon himself.\n\nIMO, the top 3 risks are:\n\n 1. Elon (in various forms)\n 2.…",
  "data/reddit-stocks/r/investing/comments/urnqoj/alphabet_inc_goog_googl_analysis.json": "Hey Guys whats up, this is my first analysis. I would like to get some feedback\non it so give me your thoughts.\n\n\nCORE BUSINESS\n\nGoogle’s operations are divided in three categories: Google Services, Google\nCloud and so called “Other Bets” consisting of several ventures including A.I.,\nrobotics,…",
  "data/reddit-stocks/r/wallstreetbets/comments/urmqyy/diamond_hands_cringe_documentary_proof_or_ban.json": "Just watched the documentary \"Diamond Hands\" from MSNBC. It was super cringe.\n\nCringe\n[https://preview.redd.it/ci2qqrt1i1091.png?width=1147&format=png&auto=webp&s=9b0710872ddba6013152ef5a487f99fa8f535b34]\n\nI'm calling you out u/Jeffamazon [/u/Jeffamazon] post proof of your alleged\n$8,000,000 gains…",
  "data/reddit-stocks/r/stocks/comments/urt3e2/netflix_lays_off_150_employees_as_the_streaming.json": "Netflix is laying off around 150 employees across the company, CNBC confirmed\nTuesday.\n\nThe eliminated positions represent less than 2% of the streamer’s 11,000\nstaffers, with most of the cuts happening in the U.S.\n\n“As we explained on earnings, our slowing revenue growth means we are also\nhaving…",
  "data/reddit-stocks/r/stocks/comments/urumgr/bridgewater_hedge_fund_dumps_tesla_stock_buys_up.json": "Article\n[https://finance.yahoo.com/video/ray-dalio-hedge-fund-dumps-150012044.html]\n\nRay Dalio's Bridgewater has parted ways with its stake in Tesla, placing new\nbets on meme stocks, AMC and GameStop, in the first quarter. Yahoo Finance's\nAlexandra Semenova has all the details on this one.…",
  "data/reddit-stocks/r/stocks/comments/ursmmj/apple_delays_plan_to_have_workers_in_office_three.json": "with new york moving to high coronovirus [https://nypost.com/2022/05/17/d/] risk\nlevel and now apple delaying plans to have workings come back to the offices\n[https://www.bnnbloomberg.ca/apple-delays-plan-to-have-workers-in-office-three-days-a-week-1.1767169]\n... is this a sign that covid is…",
  "data/reddit-stocks/r/investing/comments/urpgir/here_we_go_again_the_ethics_of_indexing_redux.json": "Excerpt from a blog post by David Nadig, by way of TL;DR -\n\n\"Every so often, the handwringing about indexes destroying the markets gets to a\nfever pitch, and I’m obliged to at least put something out there. Well, it’s\nbeen a year or so, so now’s the time. Here’s the most recent catalyst:\"\n\nTweet…",
  "data/reddit-stocks/r/investing/comments/ury8lc/jpmorgan_investors_hand_jamie_dimon_a_rare_rebuke.json": " * Just 31% of investors participating in the New York-based bank's annual\n   shareholder meeting voted in support of a $52.6 million award that was part\n   of Dimon's 2021 compensation package.\n * The bonus, in the form of 1.5 million options that Dimon can exercise in\n   2026, was designed to…",
  "data/reddit-stocks/r/stocks/comments/urv7wy/older_investors_of_rstocks_what_were_the_meme.json": "I'm sure of today's speculative picks, some of them will turn out to be very\nsuccessful. In /r/stocks, we love taking risks, so everyone is constantly\nputting out a bull case.\n\nWhat were the SOFI, UPST, CLOV, PLTR, WISH, ... stocks of the pre-2000s, or\nimmediately post financial crisis, etc, that…",
  "data/reddit-stocks/r/Bogleheads/comments/urzj44/i_wonder_why_a_boglehead_having_an_emergency_fund.json": "Edit: I mean, what drives people to panic sell?",
  "data/reddit-stocks/r/stocks/comments/us1k6m/friendly_psa_whether_you_have_lost_or_won_this.json": "So I spend a lot of time reading up on financial news because it's something\nthat interests me. Sometimes I feel fomo when I miss out; sometimes I feel like\na moron when I take a risk and invest in something and it blows up; sometimes I\nfeel boring for just buying spy every month and thinking it's…",
  "data/reddit-stocks/r/stocks/comments/uretlo/what_is_your_highest_conviction_growth_stock.json": "This is a great time to get into some highly speculative tech stocks by DCA\n(after doing your homework on them). What is your biggest bet for the future? I\npersonally agree with Cathie Woods overall thesis but her top picks in\ninnovative industries are weak in my opinion. I’d love to hear what…",
  "data/reddit-stocks/r/stocks/comments/urwb65/amd_and_qualcomm_collaborate_to_optimize.json": "https://finance.yahoo.com/news/amd-qualcomm-collaborate-optimize-fastconnect-130000515.html\n\nAMD (NASDAQ: AMD) and Qualcomm Technologies, Inc., a subsidiary of Qualcomm\nIncorporated (NASDAQ: QCOM), today announced a collaboration to optimize the\nQualcomm® FastConnect™ connectivity system for AMD…",
  "data/reddit-stocks/r/Bogleheads/comments/uru75w/avantis_instead_of_vanguard_etfs_for_total_market.json": "What does everyone here think about replacing VT or VTI/VXUS with\nAVUS/AVDE/AVEM?\n\nI heard alot of good things about Avantis, their roots in DFA and the scrupulous\nresearch they apply to their ETF strategies. They primarily focus on size/value\nfactors but also take momentum into account with their…",
  "data/reddit-stocks/r/Bogleheads/comments/uryxaj/whats_the_best_way_to_set_my_kid_up_for_financial.json": "I am very, very late to financial literacy. I’m 38 and just started paying\nattention to my retirement finances. Fortunately I have had state jobs that took\n10% off the top and threw them in a pension that I never had to manage, so I’m\nnot at zero or anything.\n\nBut my kid is sub 10 years old, and I…",
  "data/reddit-stocks/r/stocks/comments/uriley/rstocks_daily_discussion_technicals_tuesday_may.json": "This is the daily discussion, so anything stocks related is fine, but the theme\nfor today is on technical analysis (TA), but if TA is not your thing then just\nignore the theme and/or post your arguments against TA…",
  "data/reddit-stocks/r/wallstreetbets/comments/uryudo/elon_musk_wont_pay_twitter_a_1_billion_breakup.json": "With more and more people agreeing that Elon Musk Isn’t Buying Twitter\n[https://politiquerepublic.substack.com/p/elon-musk-isnt-buying-twitter?r=1o2ns&s=w&utm_campaign=post&utm_medium=web]\nthe conversation has moved to whether the billionaire will have to pay the\ncompany a $1 billion breakup fee to…",
  "data/reddit-stocks/r/wallstreetbets/comments/urk18d/i_told_you_so_but_you_didnt_listen_heres_whats.json": "For TL:DR people. Read it down below to see how!!!\n[https://preview.redd.it/ts38fvmgl0091.jpg?width=610&format=pjpg&auto=webp&s=0a07a2a0bf8c2e72cee353ce2453cfd514a8e678]\n\nDisclaimer : This subreddit is not for picking specific stocks to make lambo\nprofits in a day or weeks by YOLO option trading…",
  "data/reddit-stocks/r/stocks/comments/us8xf3/invested_everything_in_qqq_in_nov_2021_down_30.json": "I had a lump sum saved for home purchase. I live in a HCOL area and I am not\nquite there yet.\n\nI read online that lump sum investment in index funds beats DCA in the long run.\n\nSo, I went all in on $QQQ. When it went down 10% by January, I added a few more\npay checks into it.\n\nNow I am wondering if…",
  "data/reddit-stocks/r/stocks/comments/us9wnx/target_profit_hit_hard_by_high_costs_inventory.json": "Target on Wednesday reported quarterly earnings that fell far short of Wall\nStreet’s expectations, as the retailer coped with pricey freight costs, higher\nmarkdowns and lower-than-expected sales of discretionary items from TVs to\nbicycles.\n\nShares fell about 22% in premarket trading.\n\nHere’s what…",
  "data/reddit-stocks/r/stocks/comments/uroc3c/big_media_analysts_are_not_your_friend.json": "What makes you believe that the talking heads on TV have your best interests at\nheart and will give you sound financial advice? Money cannot be made without\nsomeone on the other side of the trade. I really believe some of the best\ninvestments will not be applauded by the media (or even discussed).…",
  "data/reddit-stocks/r/investing/comments/uscsek/reits_in_an_inflationaryclimbing_rates_environment.json": "A lot of people are talking about low valuations in the market lately, however,\na lot of trash companies are still above 40 PE and good bluechips are still\n15-25 PE which is on the richer side. As such I have been looking at REIT's\nwhere you can find yields up to 10% on well established long…",
  "data/reddit-stocks/r/investing/comments/usdq14/target_shares_sink_25_after_company_says_high.json": "https://www.cnbc.com/2022/05/18/target-tgt-q1-2022-earnings.html\n\nEarnings were $2.19 adjusted vs. $3.07 expected. Blame was placed on the usual\nsuspects - \"supply chain troubles, higher fuel costs and lower than expected\nsales of discretionary merchandise.\"",
  "data/reddit-stocks/r/stocks/comments/usbrd8/stale_data_on_housing_costs_are_40_of_corecpi_or.json": "TL;DR: While there’s a lot of talk about inflation, by far the largest component\nof core-CPI (40% or several orders of magnitude more heavily weighted than\neverything else) is housing costs and due to the methodology “updated” numbers\nare actually over a year old. Virtually no one mentions this…",
  "data/reddit-stocks/r/Bogleheads/comments/usb6vo/vanguard_over_schwab.json": "Most comments I see suggest investing in VTI/VOO/VT etc. and less mentions about\nSchwab/Fidelity ETFs or Mutual Funds.\n\nSeems like most posts are all about investing in Vanguard. Is there a reason\nmore people invest and recommend Vanguard then Schwab’s SCHX/SCHB/Etc.\nequivalent?\n\nIs Vanguards…",
  "data/reddit-stocks/r/stocks/comments/usdcsc/costco_down_almost_10_at_open_today.json": "Coming into today, shares of the warehouse club operator had lost 15.77% in the\npast month. In that same time, the Retail-Wholesale sector lost 15.28%, while\nthe S&P 500 lost 9.39%.\n\nWall Street will be looking for positivity from Costco as it approaches its next\nearnings report date. This is…",
  "data/reddit-stocks/r/Bogleheads/comments/usfxy1/psa_backdoor_your_roth_if_you_make_90k_single_or.json": "Assuming you don’t have any IRA Assets that you can’t or don’t want to move into\nyour employers 401K (you didn’t roll over your old employers 401K for no reason,\ndid you), you will save a lot of headache and reduce new threads on this\nsubreddit in February - April 2023 by about 20% if you simply…",
  "data/reddit-stocks/r/wallstreetbets/comments/usdjg3/martin_shkreli_is_finally_out_of_prison.json": "Photo of him and Edmund Sullivan on Twitter\nhttps://twitter.com/edmundsullivan/status/1526904327620665345",
  "data/reddit-stocks/r/Bogleheads/comments/usibn0/my_advice_to_new_bogleheads_in_any_market.json": "Before Investing: 1. Create an emergency fund of 3-6 months expenses. 2. Pay off\nconsumer debts. 3. Invest a little time and or money each month for personal\ndevelopment. (Professional trade books, personal finance books, Booglehead wiki,\nu/captmorgan50 [/u/captmorgan50]'s book…",
  "data/reddit-stocks/r/stocks/comments/us8yak/rstocks_daily_discussion_wednesday_may_18_2022.json": "These daily discussions run from Monday to Friday including during our themed\nposts.\n\nSome helpful links:\n\n * Finviz [https://finviz.com/quote.ashx?t=spy] for charts, fundamentals, and\n   aggregated news on individual stocks\n * Bloomberg market news [https://www.bloomberg.com/markets]\n *…",
  "data/reddit-stocks/r/stocks/comments/usj5od/most_stocks_popular_here_are_priced_they_were_a.json": "If you assume that over time the market will go up, which you should if you are\neven deciding to dip into the stock market, then naturally you should view dips\nand crashes as the best time to get into the market. Spy is priced at where it\nwas March 2021. VGT at Jan 2021. And QQQ at September 2020.…",
  "data/reddit-stocks/r/stocks/comments/usirac/this_market_is_really_taking_a_toll_on_me.json": "I can’t be the only one considering selling their portfolio even when they’re\ndown 25%. This is very hard and emotionally draining. Sure I can keep buying to\nlower my average but it seems as though a depression is eminent. How do you feel\nabout this?",
  "data/reddit-stocks/r/stocks/comments/ushg74/river_of_blood_absolute_red_wednesday_another_day.json": "River of blood, absolute red Wednesday. Another day of slump in the stock\nmarket. How many people fell into the trap?\n\n\n\nYou look at the top five companies by market capitalization (published at 12:30\nPM ET):\n\nAAPL -4.45%\n\nMSFT -3.33%\n\nGOOGL -3.13%\n\nAMZN -5.57%\n\nTSLA -6%\n\n\n\nBeginning on May 12, the…",
  "data/reddit-stocks/r/stocks/comments/usgfht/isnt_poor_retail_result_good_right_now.json": "So we saw Walmart reported a decline yesterday and cut its forecast for the full\nyear.\n\nTarget reported a decline today and also cut its forecast for the full year.\n\nWe saw Amazon also cut its forecast for the next quarter\n\nSo people have started buying less (it seems) due to inflation I suppose.…",
  "data/reddit-stocks/r/stocks/comments/uslgss/dow_drops_1100_points_for_its_biggest_decline.json": "The Dow Jones Industrial Average headed for its biggest loss since 2020 on\nWednesday after another major retailer warned of rising cost pressures,\nconfirming investors’ worst fears over rising inflation and rekindling the\nbrutal 2022 sell-off.\n\nThe Dow shed 1,255 points, or 3.8%, or the average’s…",
  "data/reddit-stocks/r/investing/comments/use3jf/michael_burry_vs_warren_buffett_on_apple.json": "I was scrolling though Yahoo Finance and noticed a bit of an interesting \"fight\"\nshaping up. Berkshire has been loading up on Apple shares while famous short\nseller Michel Burry has taken up a short position. I think this is pretty\ninteresting since AAPL, like so many other tech stocks, has seen a…",
  "data/reddit-stocks/r/stocks/comments/usl5ti/when_i_started_investing_i_checked_my_numbers.json": "I just wanted to share this with anyone else who is decades out from retirement\nand feeling really disappointed about how things are looking. I'm confident that\nthe value of my collective retirement savings is down by some obscene number,\nbut I'm not worried about it at all because I'm invested in…",
  "data/reddit-stocks/r/stocks/comments/usojm9/melvin_capital_hedge_fund_torpedoed_by_the.json": "https://www.nytimes.com/2022/05/18/business/melvin-capital-gamestop-short.html\n\nMelvin Capital, the hedge fund run by Gabe Plotkin that struggled with heavy\nlosses last year as it reeled from wrong-way bets on GameStop, is shutting down,\naccording to a letter sent to investors on Wednesday that was…",
  "data/reddit-stocks/r/wallstreetbets/comments/usnnlr/melvin_capital_to_wind_down_after_losses.json": "https://www.bloomberg.com/news/articles/2022-05-18/gabe-plotkin-s-melvin-capital-to-wind-down-funds-after-losses\n\n\n\nThe GameStop saga got featured as the reason that started the fund's ultimate\ndownfall.\n\n1 down, many more to go 🚀🚀🚀",
  "data/reddit-stocks/r/stocks/comments/usmvn8/the_worlds_largest_cannabis_company_by_market_cap.json": "When I say \"world's largest cannabis company\" you may think of Tilray or Canopy\nGrowth, or maybe you're familiar with the big US cannabis companies like Green\nThumb Industries or Curaleaf. Well, those companies have all been dwarfed by a\nnew giant in the space, Bright Green Corporation (BGXX).\n\nAt…",
  "data/reddit-stocks/r/stocks/comments/usrg9r/peak_pe_ratios_often_happen_at_the_bottom_of_a.json": "I see a lot of people on this sub treat PE ratios as though they are only\naffected by price. They say things like \"PEs have come down enough that things\nmight be a good buy.\" But what they are really saying is that prices have come\ndown enough that PE ratios look reasonable if we assume this…",
  "data/reddit-stocks/r/Bogleheads/comments/usokuo/little_tired_of_losing_50k_a_day_in_index_funds.json": "Remind me how this market is efficient and how it is is possible for all these\nanalysts to not know that boring stocks like walmart, costco, and target are\nmissing estimates so severely?!\n\nAt least I have a cold sam adams.",
  "data/reddit-stocks/r/stocks/comments/ustgnt/melvin_capital_to_shut_after_heavy_losses_on_meme.json": "\"The appropriate next step is to wind down the Funds by fully liquidating the\nFunds' assets and accounts and returning cash to all investors,\" Plotkin wrote\nin a letter reviewed by Reuters on Wednesday.\n\nMelvin Capital had $7.8 billion in assets at the end of April. The fund lost 23%\nin the first…",
  "data/reddit-stocks/r/investing/comments/usggmk/can_someone_remind_me_why_the_stock_market_is.json": "I was bearish about the stock market just a few months ago and I had every right\nto be. It was clear, I remember. ”Inflation doesn’t magically make the stock\nmarket go up, even if it is at 20%” but today, a few months later, I forgot why\nI held that view and how it actually works. I know inflation…",
  "data/reddit-stocks/r/stocks/comments/usmzfc/googles_russian_division_is_filing_for_bankruptcy.json": "Google's Russian division submitted a notice of intention to declare bankruptcy\nafter officials seized its bank account. That \"has made it untenable for our\nRussia office to function, including employing and paying Russia-based\nemployees, paying suppliers and vendors, and meeting other…",
  "data/reddit-stocks/r/stocks/comments/usrc9g/my_friend_holds_positions_in_all_ark_funds_and.json": "they are held in a TFSA and to contribution room would be gone forever if sold.\nWhat would you do if you were in my friends shoes? sell and throw the remainder\non spy? QQQ? or keep riding the rough seas and hope for a recovery.\n\nthanks in advance. from my friend of course",
  "data/reddit-stocks/r/stocks/comments/ussl9f/the_nasdaq_plunged_47_us_stocks_sell_off_again.json": "U.S. stocks fell sharply on Wednesday, as the Fed's determination to fight\ninflation hit market sentiment. Multiple retailers have warned that rising cost\npressures are having a huge impact on earnings. As of the close, the Dow fell\n1164.52 points, or 3.57%, to 31490.07 points, the Nasdaq fell…",
  "data/reddit-stocks/r/stocks/comments/usib0h/well_i_moved_to_about_70_cash_as_of_yesterday.json": "I’m 27 and have luckily been able to build up a respectable sized portfolio over\nthe last few years (over 6 figures). I’ve been fortunate enough to own a\nbusiness and work a full time job as well which has allowed me to build my net\nworth pretty quickly at a young age. My worth was split up to…",
  "data/reddit-stocks/r/investing/comments/ut04u7/inventories_are_high_what_ever_happened_to_supply.json": "I've read multiple reports that consumer spending is down (expected, due to\nprice hikes on a lot products), but inventory is high?! \"Stocks slammed by\n'chain reaction' — here's what pros are saying\"\n[https://finance.yahoo.com/news/stocks-slammed-by-chain-reaction-095038951.html]\n\nThis makes no…",
  "data/reddit-stocks/r/stocks/comments/ut1dm8/sp500_at_3000_seemed_absurdly_high_precovid.json": "I know dollar value milestones are meaningless, but with the S&P crossing below\n$4000 I found this article interesting, which was written just a few months\nbefore covid hit. The S&P had just run up to $3000 and the writers said this\ncould be a dangerous growth rate and to perhaps expect a crash…",
  "data/reddit-stocks/r/Bogleheads/comments/ut3l3o/looks_like_well_officially_be_heading_into_a_bear.json": "This is just a friendly reminder that stock returns are not like bank interest.\nYou don’t get a steady monthly yield just for parking your money in them with\nthe promise it will all be returned to you on demand. There is a huge amount of\nspeculative value in stock prices and they will swing up and…",
  "data/reddit-stocks/r/Bogleheads/comments/usxxv7/should_i_hold_bonds_in_my_portfolio_a_quick_faq.json": "I'm seeing a lot of posts about bonds right now, and honestly, a lot of\nquestionable takes about unsuitable alternatives to fixed income. Fixed income\nassets are important in a balanced portfolio. So OK, here goes:\n\n-------------------------------------------------------------------------------…",
  "data/reddit-stocks/r/investing/comments/ut4mmn/us_existing_home_sales_fall_for_third_straight.json": "https://www.reuters.com/business/us-existing-home-sales-fall-third-straight-month-house-prices-record-high-2022-05-19/\n\nU.S. existing home sales dropped to the lowest level in nearly two years in\nApril as house prices jumped to a record high amid a persistent lack of\ninventory.\n\nExisting home sales…",
  "data/reddit-stocks/r/investing/comments/ut4ok9/cisco_stock_falls_13_after_company_projects.json": "https://www.cnbc.com/2022/05/19/cisco-stock-falls-10percent-after-company-projects-revenue-decline.html\n\nI know Cisco is one that people always point to as a \"check out the all time\nhigh and get back to me\" stock, but the shrinking revenue was still a surprise.",
  "data/reddit-stocks/r/stocks/comments/ut5a4v/tesla_hit_694_today_the_first_time_below_700.json": "I read claims recently that there are \"psychological barriers\" below which Tesla\ncould not fall. At one point, the \"barrier\" was claimed to be $1,000. Then $900.\nMost recently I saw claims it was $700.\n\nThere clearly are no barriers. Some folks try to make them sound more real by\ngiving them names…",
  "data/reddit-stocks/r/stocks/comments/ut3j40/tesla_faces_weak_china_sales_supply_issues_in.json": "\"The current Shanghai lockdowns have been an epic disaster so far in the June\nquarter and we expect Tesla to see modest delivery softness this quarter with a\nslower growth trajectory in the key China region\" into H2, Wedbush said.\n\nIn addition, regarding Tesla Chief Executive Elon Musk's bid to buy…",
  "data/reddit-stocks/r/Bogleheads/comments/ut75t4/stay_strong_my_younger_boglehead_friends.json": "I have been index investing since the late 90s. I know it is a gut punch to look\nat your portfolio and see it being beat down. Speaking from experience, having\nbeen through this multiple times, what works best for me is to not even look at\nmy holdings at a frequency of more than once a quarter.…",
  "data/reddit-stocks/r/wallstreetbets/comments/ut0m5p/1_year_ago_i_was_called_retarded_for_going_long.json": "February 2021 I posted this guide on how to short the USD.\nhttps://www.reddit.com/r/wallstreetbets/comments/libnng/if_youre_a_real_youll_go_short_on_usd_heres_how/?utm_source=share&utm_medium=web2x&context=3\n\nAfter more than a year of price inflation in commodities across the board,\ncanned beans…",
  "data/reddit-stocks/r/stocks/comments/uszkrf/rstocks_daily_discussion_options_trading_thursday.json": "This is the daily discussion, so anything stocks related is fine, but the theme\nfor today is on stock options, but if options aren't your thing then just ignore\nthe theme and/or post your arguments against options…",
  "data/reddit-stocks/r/investing/comments/usmaih/are_any_of_you_100_cash_or_rather_0_stocks.json": "When did you get out, and why did you make that decision at the time you did? Do\nyou have a plan for reentry? I was completely out in January, saying I wouldn't\ninvest until inflation trended in the right direction. It was an amazing\ndecision, and super simple. But I was weak, and my stock…",
  "data/reddit-stocks/r/stocks/comments/ut89xg/tesla_whale_calls_on_tsla_to_buy_back_15_billion.json": "Billionaire Leo Koguan, who describes himself as the third-largest individual\nshareholder of Tesla stock, has called on the automaker to announce a $15\nbillion share buyback as the company's stock price continues to fall.\n\nIn a tweet to Martin Viecha, Tesla's senior director of investor…",
  "data/reddit-stocks/r/stocks/comments/ut7i6c/why_has_ciscos_stock_never_bounced_back_from_the.json": "Cisco reached an ATH of $80.06 per share in March 2000, and it’s remained fairly\nstagnant ever since it’s share price crashed when the bubble burst.\n\nThey had a bunch of stock splits in the 90s and one in February 2000 because\ntheir share prices kept climbing. But ever since the bubble burst…",
  "data/reddit-stocks/r/stocks/comments/ut1vy4/srad_reports_q1_results_eps_beat_004_vs_003.json": "$SRAD, a picks and shovels gambling stock, posted their Q1 earnings yesterday.\n\nPrevious deep dive research\n[https://www.reddit.com/r/stocks/comments/rkib3w/the_case_for_srad_to_hit_100_in_4_years/]\n\n\n\n * Revenue of $186.4M (+16.5% Y/Y) beats by $19.71M.\n * Annual Financial Outlook: Revenue is…",
  "data/reddit-stocks/r/stocks/comments/ut89if/bipartisan_bill_aims_to_force_google_to_break_up.json": "https://www.cnbc.com/2022/05/19/new-bipartisan-bill-would-force-google-to-break-up-its-ad-business.html\n\nThis bill would ban companies that process more than $20B in ad revenue from\nparticipating in more than one part of the ad process. Amazingly, this bill is\nbeing introduced by a bipartisan group…",
  "data/reddit-stocks/r/stocks/comments/uszz3x/wall_street_is_set_for_another_rough_day_with_dow.json": "Wall Street is set for another rough day, with Dow futures falling more than 400\npoints\n\nPUBLISHED WED, MAY 18 20226:06 PM EDTUPDATED 6 MIN AGO\n\n￼\n\nHannah Miao@HANNAHMIAO_\n\n￼\n\nTraders work on the floor of the New York Stock Exchange (NYSE) on May 18, 2022\nin New York City.\n\nSpencer Platt | Getty…",
  "data/reddit-stocks/r/stocks/comments/uteinx/it_is_time_for_the_housing_market_to_fall_too.json": "Stocks are falling. Crypto is falling.\n\nSame with many other asset classes, I’m sure. But the housing market has barely\nexperienced anything.\n\nIf anything good is to come from these turbulent market conditions, I would hope\nwe see a decline in housing prices too. It is about time that this…",
  "data/reddit-stocks/r/Bogleheads/comments/uta0xh/what_if_i_die_before_59_and_get_none_of_it.json": "I keep hearing people who don’t want to invest long term say this same thing.\nSome have GREAT points. First off i hope I’m correct.. we could start pulling\nmoney out “tax free” after 59 and half?\n\nWhat’s your thoughts on this?",
  "data/reddit-stocks/r/Bogleheads/comments/ute4nn/edward_jones_is_finally_in_the_rear_view_mirror.json": "I'm glad to finally be done for good with that cesspool. Sure, it has it's\npurpose -- like helping us who would have had our entire savings in CDs or\nchecking accounts. However, easily my biggest regret was letting them convince\nme to transfer over an IRA that was already doing VERY well as is. It…",
  "data/reddit-stocks/r/investing/comments/utf65p/im_calling_powells_bluff.json": "In short I predict Jerome Powell and the Fed are talking a tough game on\ninflation, but will soften later this year leading to a market rally. I also\nbelieve we will have a minor recession at worst. Putting this here to refer back\nto and see if I was on the money.\n\n\n> WHAT WILL PLAY OUT THIS…",
  "data/reddit-stocks/r/wallstreetbets/comments/utgx3x/costco_is_selling_its_hotdogs_at_a_loss_we_can.json": "In 1985, Costco introduced a deal at its food court: for the price of just $1.50\nyou could get a quarter pound hotdog and soda. Now, 37 years later, the price\nstill hasn't changed, even as the cost of beef, labor, and other inputs has\ndramatically increased. With the rampant inflation that we are…",
  "data/reddit-stocks/r/Bogleheads/comments/utab0w/whats_everyones_reaction_when_people_berate_you.json": "Catching up with an old friend and he’s telling me that DCA’ing is a terrible\nidea (for context he had no idea was DCA stood for. I’ve also kept course since\n2014, bi-weekly paychecks into VTSAX and have zero desire to trade). He kept up\nwith the unsolicited advice and is still going on. I’m too…",
  "data/reddit-stocks/r/stocks/comments/utqrpa/chinas_stimulus_tops_5_trillion_as_covid_zero.json": "> China’s plans to bolster growth as Covid outbreaks and lockdowns crush\n> activity will see a whopping $5.3 trillion pumped into its economy this year.\n> \n> The figure -- based on Bloomberg’s calculation of monetary and fiscal measures\n> announced so far -- equates to roughly a third of China’s…",
  "data/reddit-stocks/r/stocks/comments/utpo4v/are_people_calmer_than_prior_decades_when_stocks.json": "The other day someone posted a link on here discussing a forum from 2001 they\nfound in which the posters were discussing stocks. That led me to start\nsearching myself for similar historic conversations, as you can imagine, there\nis not that much for the 2000 bubble as the internet was still in its…",
  "data/reddit-stocks/r/Bogleheads/comments/utk9n6/thank_you_bogleheads.json": "Turning 40 this year so realizing its time to get really serious preparing for\nretirement. I've generally made good choices and a few bad ones (including\ncashing out my pension and investing it myself... idiot), but overall I think\nI'm in a decent spot. I'm fortunate that I have a good job that I…",
  "data/reddit-stocks/r/stocks/comments/utnudu/high_conviction_bringittograve_stocks.json": "Few months ago when the market starts to go down, I read a comment that \"it's\nnot done until Apple is done\", I was sceptical that companies like AAPL, AMZN\nand GOOGL will drop more than 20% and agree that when people are forced to pawn\ntheir family heirlooms, while they may not have hit rock bottom…",
  "data/reddit-stocks/r/investing/comments/utw19n/we_might_be_closer_to_the_bottom_than_we_might.json": "Over the past few months I’ve been watching stocks fall and monitoring them just\nas everyone else. I tried to keep a large diversified portfolio and like most of\nthe people my portfolio has been down like everyone else. Except that I’ve\nnoticed that most of my positions are more down YTD than most…",
  "data/reddit-stocks/r/Bogleheads/comments/utfg3q/update_my_wifes_401k_plan_is_switching_to_a_more.json": "UPDATE to the following link:\nhttps://www.reddit.com/r/Bogleheads/comments/ur2v32/my_wifes_small_employer_is_changing_their_401k/\n\nNothing gives me more satisfaction than seeing a FA start sweating.\n\nI attended the 401k presentation and met my wife’s two bosses/owners of the\ncompany prior to the…",
  "data/reddit-stocks/r/stocks/comments/utywtv/tsla_was_down_6_as_of_11am_the_nasdaq_fell_just.json": "As previously reported, Tesla was removed from the S&P 500 ESG Index by S&P. In\nthis regard, Margaret Dorn, director of ESG Indexes in North America, explained\nthat Tesla was excluded from the index because the company did not publish\nrelevant details of its low-carbon strategy or business conduct…",
  "data/reddit-stocks/r/Bogleheads/comments/uty9c8/hello_fellow_bogleheads_long_time_lurker_im_a_36.json": "My wife and I earn $20k/month net this year because of a project I'm on\ncurrently. Here is my portfolio.\n\nOld employer 401k = $110,000 (VTSAX)\n\nHSA = $20,000\n\n3 year old son's 529 = $10,000 (Avg - $3k/year contribution)\n\nWife + My Roth = $36000 (2020 - 2022 3 year contribution) to VTSAX\n\nBrokerage…",
  "data/reddit-stocks/r/stocks/comments/utugr3/coin_insider_director_frederick_ernest_ehrsam.json": "COIN insider Director Frederick Ernest Ehrsam purchased 706,554 COIN shares for\n$50 Million on May 13 2022.\n\nWhat’s Happening: Coinbase Global recently reported worse-than-expected Q1 sales\nresults.\n\nWhat Coinbase Does: Founded in 2012, Coinbase is the leading cryptocurrency\nexchange platform in…",
  "data/reddit-stocks/r/stocks/comments/utyv5f/2022_is_just_2008_except_now_the_chickens_are.json": "Due to the destruction of unions, alongside deindustrialization of the\nheartland, the standards of living of the average American have been slowly in\ndecline since the 1980s and the 1990s because of stagnating wages and lack of\ndecent job opportunities for the uneducated. To offset this decline,…",
  "data/reddit-stocks/r/Bogleheads/comments/utx6lu/would_you_go_for_dividends_if_there_where_no_tax.json": "I live in Switzerland and there is only wealth tax (which depends on your income\nas well) and income tax.\n\nIf I have no income and make 1M in Stock I don't pay any taxes. If I have income\nI will have to pay wealth tax regardless how much I have gained with stocks. But\nwealth tax is still very…",
  "data/reddit-stocks/r/stocks/comments/uu2b68/sp500_just_entered_bear_market.json": "The S&P 500 lost more then 1.7% in afternoon trading dipping below 20% from its\nJan. 3 closing record so a close at that level would meet the common definition\nfor a bear market.\n\nThe S&P 500 is headed for its seventh weekly decline that would make the longest\nlosing streak since the dotcom bubble…",
  "data/reddit-stocks/r/wallstreetbets/comments/uturc3/crash_over_china_money_printer_activated.json": "China is going to do for 2022 what America did in 2020, print money and save the\nstock market, I mean economy. The world is about to be flooded with cheap Yuan.\nThis comes after a massive deleverage cycle that has been occurring for the last\ntwo years and appears to have…",
  "data/reddit-stocks/r/stocks/comments/uu0wbm/tesla_alleged_sexual_misconduct_on_elon_musk.json": "Yesterday Tesla $TSLA fell to as low as $680, a level it last traded in August\n2021. This came as Business Insider published an alleged sexual misconduct story\non Elon Musk:\nhttps://www.businessinsider.com/spacex-paid-250000-to-a-flight-attendant-who-accused-elon-musk-of-sexual-misconduct-2022…",
  "data/reddit-stocks/r/stocks/comments/utpy8v/rstocks_daily_discussion_fundamentals_friday_may.json": "This is the daily discussion, so anything stocks related is fine, but the theme\nfor today is on fundamentals, but if fundamentals aren't your thing then just\nignore the theme and/or post your arguments against fundamentals…",
  "data/reddit-stocks/r/wallstreetbets/comments/uu3uax/apple_is_down_15_since_my_post_where_i_warned.json": "Hey goofs,\n\n21 days ago I told you that Buffett stuffed 47.6% of Berkshire's $300 billion\npublic portfolio in one single stock - Apple. Here is the original…",
  "data/reddit-stocks/r/stocks/comments/uu3no7/sp500_is_closing_in_weekly_red_again_making_the.json": "Last time this happened was during the dotcom crash, between the last week of\nJanuary 2001 to the 2nd week of March 2001.I know the sentiment is extremely\nbearish atm, but statistically speaking this looks like absolutely not normal to\nme. Even though we are in a bear market, we should have a bear…",
  "data/reddit-stocks/r/investing/comments/uts6pf/at_what_age_did_you_start_investing_and_what_did.json": "24, just beginning. The more earnings I could have potentially made long term by\nstarting at 18 is a good kick in the gut. I’ll be starting out with a three fund\nportfolio of ETFs in a Roth IRA and will most likely add 1 or 2 more down the\nline along with dabbling in either individual stocks and/or…",
  "data/reddit-stocks/r/investing/comments/uu3xe4/can_we_stop_saying_crypto_is_an_inflation_hedge.json": "Stocks covered in this post: ZJG, GOLD, AEM, DYG\n\nIt’s been a couple of months since BTC dropped nearly 40% from its most recent\nrecovery, continuing its long term downtrend. Since its last high in November,\nBTC’s dropped nearly 60%. Even the folks at Bank of America are saying this:\n\n“Instead,…",
  "data/reddit-stocks/r/investing/comments/uu6jz2/how_much_are_you_cutting_back_on_spending_now.json": "I was in cash for the last year, so i missed some gains and these losses.\nstill my equities are down 19%.\ni bought some shares today and last time we hit 3850.\nI'm not traveling on airplanes this summer, not because the costs went up 50%,\nbut because its is a zoo these days. I still buy tons of…",
  "data/reddit-stocks/r/stocks/comments/uu1c98/a_recession_is_not_inevitable_but_stocks_are.json": "GS main economists tells us that there is 35% chance we will have recession.\nThis implies 65% no recession. Do we believe what Goldman says or we move in\nopposite direction. Also does \"no recession\" means good or it also include\n\"complete apocalypse\"?",
  "data/reddit-stocks/r/stocks/comments/uu5z1v/went_from_30k_profit_to_8k.json": "Hello, I know I know, all we know is the graph is going to the right. Maybe up\nmaybe down.\n\nI started investing in May 2020 during the printer Brrrrrr phase. At one point I\nwas up 30k and today my profits are down to \"only 8k\".\n\nAlthough I haven't lost money yet, i was thinking if I should sell all…",
  "data/reddit-stocks/r/stocks/comments/uu54n8/tesla_is_no_longer_the_largest_holding_in_cathie.json": "Roku is officially the biggest ARKK holding as of today. It's crazy to think\nabout Cathie Wood's biggest bet is Roku, a small streaming company that is\nlosing market share to Google TV and it's not doing great recently. I just don't\nunderstand her thinking..",
  "data/reddit-stocks/r/Bogleheads/comments/uu91os/why_does_everyone_here_say_international.json": "Considering this sub is called \"Bogleheads\" and Jack Bogle recommended 0%\ninternational equity, why do people here think allocating up to 40%\ninternational makes sense? Bogle said if you're going to invest internationally,\nlimit it to 20%.\n\nThe long term return of US equities beats international by…",
  "data/reddit-stocks/r/stocks/comments/uu5bwu/inflationlinked_us_bonds_crashed_the.json": "People searching for a respite from inflation have flooded the Treasury\nDepartment phone lines and website to try to buy Series I savings bonds, causing\nmuch longer waits than usual. It’s the latest example of outdated government\ncomputer systems causing anguish for Americans.\n\nOn May 2, the…",
  "data/reddit-stocks/r/investing/comments/uu26mm/started_investing_in_oct_of_last_year_can_count.json": "Think we used up all the green crayons :D seriously though, I typically invest\n$125 every Monday into my investment portfolio and I've had several large\namounts go in from things I've sold. Most of my portfolio is VTI, REIT's,\ndividend stocks, and oil. My portfolio is currently -5.3% (which…",
  "data/reddit-stocks/r/stocks/comments/uucub7/for_the_first_time_in_a_century_dow_in_eight.json": "Recession worries rise.\n\nRecession worries rise, once the S&P 500 index into the bear market, but the\nmain stock index late strong pull up, the Dow and the S&P 500 index erased\nweekday losses, the latter temporarily escaped the bear market range.\n\nAs of the close, the Dow rose slightly by 8.8…",
  "data/reddit-stocks/r/Bogleheads/comments/uuf5vd/can_we_put_an_end_to_the_international_vs.json": "Who even cares at this point. The fact of the matter is that you're investing.\n\nWhen we look at the core tenants that Bogle requested we adhere to it's to SPEND\nLESS THAN YOU EARN, INVEST THE DIFFERENCE AND STAY THE COURSE.\n\nYou could invest in purely China stocks for God sake and you'll still come…",
  "data/reddit-stocks/r/stocks/comments/uuesu4/how_did_retail_investors_cost_teacher_their.json": "Yesterday Kenneth griffin got on national television and told the financial\nworld that retail investors are to blame for diminishing pension funds. Now I\ndon’t know about anybody else but I had no access to anyone’s pension fund. The\nonly money I am allowed to invest is my own money from my bank…",
  "data/reddit-stocks/r/investing/comments/uu3nxy/my_top_rankings_of_dividendpaying_stocks_by.json": "As an investment professional and dividend-growth investor, I'm always looking\nfor better ways to evaluate the investment quality of a stock individually as\nwell as part of my broader portfolio. In the very beginning I used to heavily\ninvest in stocks that were Dividend Aristocrats. But I started…",
  "data/reddit-stocks/r/Bogleheads/comments/uud04n/is_there_ever_a_bad_time_to_buy_a_home.json": "I’ve gone full Boglehead with all my investments: 15% of every paycheck into a\n401k (80/20 stock-bond index funds), 5% into a personal stock account, 5% cash\nsavings, etc. I generally subscribe to the belief that now is always the best\ntime to invest, & time in the market beats timing the…",
  "data/reddit-stocks/r/investing/comments/uuawwx/wayback_playback_arkk_founder_cathie_wood.json": "> “We won’t let benchmarks and tracking errors hold our strategies hostage to\n> the existing world order,” Wood wrote. She described the success of the ARK\n> ETFs as one not solely bolstered by fervor for “stay at home” investment\n> opportunities, amid the COVID pandemic, but rooted in…",
  "data/reddit-stocks/r/Bogleheads/comments/uud68z/retire_from_govt_job_moving_to_corporate_world.json": "I am retiring from a government job in a month after 25 years but only 46 years\nold. I will receive a guaranteed pension (approximately $46,000/year same for\nspouse if I become deceased) with medical insurance fully paid. I live in a\nlower cost portion of the country in the south. Spouse will…",
  "data/reddit-stocks/r/investing/comments/uued7d/my_complete_list_of_stocks_and_their_rankings_by.json": "This is a repost that now includes the full list of stocks that can be\nviewed/downloaded from GoogleSheets.\n\nAs an investment professional and dividend-growth investor, I'm always looking\nfor better ways to evaluate the investment quality of a stock individually as\nwell as part of my broader…",
  "data/reddit-stocks/r/stocks/comments/uubnc5/anyone_down_a_lot.json": "I'm asking because people all over internet keep saying there only down small\nincrements while market is heck of a lot down from all time high and not\neveryone could've gotten out for instance I'm down 65 percent plus. I got\nslaughtered in buying something other than stocks (not going to say it…",
  "data/reddit-stocks/r/stocks/comments/uueulc/google_enters_a_slow_growth_cycle_analysis_says.json": "Alphabet (Google's parent company) is still growing slowly and steadily, and\nanalysts believe that antitrust has undoubtedly had a certain impact on Google's\ndevelopment.\n\n\n\nAlphabet, better known as Google, is one of the largest and most valuable\ncompanies in the world.\n\n\n\nAlphabet has never been…",
  "data/reddit-stocks/r/investing/comments/uug6o9/bonds_and_the_great_depression.json": "Does anyone have the numbers specifically on how bond prices performed on\naverage by year between 1930 and 1960 and how their distributions performed as\nwell? (I believe the proper term is coupons)\n\nIt would be nice if there was a graph that splits up total returns from bond\nprice appreciation and…",
  "data/reddit-stocks/r/investing/comments/uugone/just_4_years_to_recover_from_the_great_depression.json": "According to Robert Schiller, it took only 4 years to recover your money after\nthe crash. This is because the average yield at the time was 14%. So even if\nshare prices were flat for 30 years, reinvesting meant that you recovered your\nmoney soon after.\n\nCan anyone confirm if this is true? I find…",
  "data/reddit-stocks/r/stocks/comments/uuln9g/why_does_there_need_to_be_capitulation.json": "All the talking heads on CNBC and money managers have been saying that they are\nwaiting for a capitulation where vix goes above 40 and we see a overcorrection,\ninstitutions blow up etc... before buying in.\n\nWhy does this need to happen during this downturn? I dont see any immediate\nmacro factors…",
  "data/reddit-stocks/r/Bogleheads/comments/uuqbuh/finding_and_funding_a_good_life_whitepaper_by_ben.json": "FINDING AND FUNDING A GOOD LIFE\n[https://www.pwlcapital.com/wp-content/uploads/2022/05/2022-04-25_PWL_WP_Felix_Finding_and_Funding_Good_Life-2.pdf]\n[PDF]\n\nIntroduction:\n\n> Is a higher paying job with longer hours worth it? How should you prioritize\n> saving for the future against enjoying life…",
  "data/reddit-stocks/r/stocks/comments/uunhu4/wsj_article_wgraphics_illustrate_how_long_sp_bear.json": "This WJ article (free link) is somewhat bullish\n[https://www.wsj.com/articles/the-market-is-melting-down-and-people-are-feeling-it-my-stomach-is-churning-all-day-11653105601?st=mikt94wpx3fexpo&reflink=desktopwebshare_permalink]\nin that it leads with a financial advisor telling his clients to stay…",
  "data/reddit-stocks/r/stocks/comments/uupibr/need_cash_so_should_i_sell.json": "Like almost all of you, I am down 40% from ATH and 15% from my initial\ninvestment(50k). I have two mortgages with very low rates to pay and my wife\njust got laid off. I have emergency funds for 3 months but the problem is what\nif she can not find a job?\n\nThe issue is, I can take care of us for the…",
  "data/reddit-stocks/r/stocks/comments/uurf0j/is_this_recession_going_to_be_worse_than_expected.json": " * People have been paying crazy prices on homes because of low rates\n * Now that rates are going up, no one is going to be able to purchase those\n   homes (if you live in the house for a long time and do not lose your job, it\n   might not affect you)\n * With rates and prices going up, people will…",
  "data/reddit-stocks/r/Bogleheads/comments/uup25n/bogle_vs_edward_jones_ding_ding_ding_fight.json": "My mom recently retired and is trying to put some of her nest eggs in Edwards\nJones. I'm freaking out because some other \"advisor\" she worked with sold her an\nannuity, and also gambled away some of her money without her permission. With\nthat she is taking all her funds (except the annuity) to…",
  "data/reddit-stocks/r/stocks/comments/uuvqk8/recession_risk_on_thursdaybonds_will_offer.json": "Gdp growth data is going to be announced on thursday,correct me if i am wrong,if\ndata comes negative then we are officially in recession right?In this case i am\nexpecting that bonds yields would drop significantly , because money will look\nfor a safe harbour and bonds are the best place for such…",
  "data/reddit-stocks/r/investing/comments/uuxi61/can_someone_touch_on_return_of_capital.json": "Hi guys,\n\nSome have said that it is just your money coming back to you. Others have said\nthat it can mean that but not necessarily so. ROC can actually be a good thing:\n\nhttps://www.youtube.com/watch?v=wsFe-KNyZZI\n\nFor example, if NAV is going up this would be good ROC. This is supposedly\npresent…",
  "data/reddit-stocks/r/Bogleheads/comments/uuxgyp/the_beauty_of_compounding_power_in_the_example_of.json": " * Coca-Cola went public in 1919 with a price of $40 per share ($40 in 1919 is\n   equal to $650 in 2022 due to inflation)\n\n * throughout its history, Coca-Cola has experienced 11 stock splits. So one\n   share sold in 1919 has become 9216 shares today\n\n * if you purchased one share of Coca-Cola in…",
  "data/reddit-stocks/r/stocks/comments/uv0m9c/seems_like_every_post_nowadays_is_from_an.json": "Your portfolio is down 50%? How long have you been in the market.. <1 year? Yes\nit’s unfortunate that you started investing at all time high’s, the market has\nbeen dropping like the time square new years ball at 12:00. Are we entering a\nrecession? Maybe. Are we in a bear market? Yes. Is it useful…",
  "data/reddit-stocks/r/stocks/comments/uuxilp/what_are_you_doing_in_this_market_right_now.json": "I’m down about 25 percent this year. Bleeding nonstop. Losing a fortune.\nPainful. Is there anyway to hedge my portfolio a little bit? Right now I’m\nselling puts on stocks like V, Dis, Intel and a few more and selling calls\n(Covered Calls). I’m going for unrealistically prices while I’m selling puts…",
  "data/reddit-stocks/r/stocks/comments/uuzgjk/caravanas_expansion_plan_into_minnesota_rejected.json": "https://bringmethenews.com/minnesota-business/brooklyn-center-rejects-carvana-plans-for-minnesotas-first-ever-car-vending-machine\n\nI've been noticing increasingly worsening news for Caravana. Accelerating cash\nburn. Laying off 12% of their work force. Their dealer license being suspended\nin…",
  "data/reddit-stocks/r/stocks/comments/uv23ss/can_we_stop_posting_about_index_funds_and_move.json": "Index funds are the safe and easy way to invest your money, but shouldn’t we\ntalk about stocks in r/stocks [/r/stocks] and not just vti, spy and qqq. Sure no\none knows for sure which way a stock is going to go, but we can speculate and\nhave the odds on our favor. r/stocks [/r/stocks] isn’t for the…",
  "data/reddit-stocks/r/stocks/comments/uux9r8/i_only_started_investing_2_years_ago_is_it.json": "I am fine with holding long term, but seeing 20% loss in like 2 months and being\ndown 7000 dollar when I am trying to save up to buy a home doesn't feel good\n\nIs it possible for me to lose all my money?\n\nI am fine with waiting, I just want to know if I am pumping money into an\nincinerator whenever…",
  "data/reddit-stocks/r/stocks/comments/uv3hgs/ea_is_reportedly_trying_to_get_acquired_by_disney.json": "Interesting read.\n\nThe video game market is consolidating like never before, and Electronic Arts is\nscrambling like everyone else. The Battlefield\n[https://kotaku.com/battlefield-2042-dice-ea-breakthrough-128-player-remove-1848952986]\nand FIFA\n[https://kotaku.com/next-gen-sports-games-on-pc-always…",
  "data/reddit-stocks/r/stocks/comments/uv64jj/i_made_an_investing_strategy_tracking_fed.json": "Edit: Here's the graphs for the people who can't read:\n\nCalls [https://ibb.co/qg8q4M4]\n\nPuts [https://imgur.com/a/D4Mo8Zd]\n\n\n\n\nINTRO\n\nHey everyone! So some background [https://reddit.com/u/schemeelectronic9058] - I\nmake indexes/strategies that sound really fucking WallStreetBets-y but have a\nlittle…",
  "data/reddit-stocks/r/investing/comments/uv9e5g/why_does_yahoo_finance_say_this_company_has_186.json": "I must be missing something here.\n\nFor this Canadian company AutoCanada Inc. ACQ.TO Yahoo financier is saying it\nhas $1.86 billion in debt\n[https://ca.finance.yahoo.com/quote/ACQ.TO/key-statistics?p=ACQ.TO]\n\nWhen I look up it’s latest financial report (Q1 2022) it is saying $358 million\nof long…",
  "data/reddit-stocks/r/stocks/comments/uv9b4j/the_shift_of_logic_on_this_sub.json": "Based on the number of posts, comments and their upvotes, yesterday vs. today\ncomparison:\n\nYesterday: \"The best time to invest was yesterday. The second best is today.\"\nToday: \"You bought at ATH, didn't you? lol\"\n\nYesterday: \"Don't time the market\"\nToday: \"It's going to keep going down. I sold my…",
  "data/reddit-stocks/r/stocks/comments/uvcwuc/im_selling_everything_rstocks_may_2022.json": "I've seen too many posts and comments on this subreddit of people claiming\nthey're selling 100% of their portfolio when they're -30% to -50% down. I don't\nsee ANY scenario where anyone should be doing this unless they put money in that\nthey were going to need in less than 18 months or are thinking…",
  "data/reddit-stocks/r/stocks/comments/uvfz2b/maybe_the_worst_pr_week_for_elon_and_tesla_ever.json": " 1. Self driving being exposed as fraud by new documentary mainstream press\n    [https://www.npr.org/2022/05/20/1100022168/elon-musks-crash-course-new-york-times-fx-hulu-twitter-tesla-self-driving-cars]\n    ?\n 2. TSLA booted from ESG index\n 3. Ongoing Twitter fiasco\n 4. Sexual misconduct coverup…",
  "data/reddit-stocks/r/Bogleheads/comments/uvhs37/perspective_question_who_went_through_2008_and.json": "I know the .com burst and 2008 are the most familiar events for myself but\ncurious if anyone can provide their input on what they went through and how you\ninvested through those major downturns?\n\nI am currently investing $1000 a week into VTI and I continue hearing that many\nwho consistently…",
  "data/reddit-stocks/r/investing/comments/uvfs20/lockdown_crash_of_2022_an_overview_of_prior_bear.json": "The value investing folks thought this would be better posted here.\n\nData is taken from table 1 - History of US Equity Bear Markets - from Bank of\nAmerica’s Global Investment Strategy.\n\nThe bear market numbers:\n\nAll time\n\nAverage Down - 37%\n\nFall time - 1.9 years\n\nRecovery - 3.5 years\n\nN = 19\n\nAll…",
  "data/reddit-stocks/r/stocks/comments/uvlh6g/a_deep_dive_into_who_actually_buys_teslas.json": "It seems to be a common assumption around here that Musk’s latest political\ntweets could alienate Tesla’s main customer base: democrats. But instead of\ndebating about whether or not that’s true, let’s first look at if it’s even\naccurate to assume that most Tesla buyers are democrats.\n\nLuckily,…",
  "data/reddit-stocks/r/wallstreetbets/comments/uv7uh1/monday_will_be_a_bloodbath_proof_included.json": "WSBros, I come bearing bad news.\n\nI have spent all weekend doing key bumps, chugging White Claws, and reading\ncharts using proprietary methods. You know the glorious 1980s documentary,\nTrader, about Paul Tudor Jones famously calling his shot? Of course, you do —\nit's an essential hype-film for our…",
  "data/reddit-stocks/r/stocks/comments/uvlouv/nvidia_to_slow_hiring_amid_inflationary.json": "Nvidia is slowing the pace of hiring, the company confirmed on Sunday.\n\nThe chip maker joins several other major technology companies that have decided\nto be more prudent with their operating budgets in recent weeks.\n\nOn Friday, The New Indian Express reported the semiconductor company’s\nmanagement…",
  "data/reddit-stocks/r/investing/comments/uvhk0k/series_i_bond_interest_reporting.json": "So with the bonds earning a significant %, I’m looking into purchasing the\nallotment for this year. I was reading up on tax implications on the treasury\nwebsite and it has two options on paying interest.\n\nYou have a choice. You can report the interest every year put off (defer)\nreporting the…",
  "data/reddit-stocks/r/wallstreetbets/comments/uvd68w/i_would_like_to_short_the_whole_city_of_gary.json": "Last week I had the misfortune of visiting Gary, Indiana. To say it is among the\ncrappiest cities I have been to would be an understatement. After seeing Gary in\nperson for the first time, it is clear that being the birthplace of michael\njackson is all the city has going for it.\n\nI'm very bearish…",
  "data/reddit-stocks/r/stocks/comments/uvh7ly/lets_talk_about_wheat.json": "*Ahem,*\n\nI read this article: World has 10-week supply of wheat, expert tells UN Security\nCouncil: ‘This is seismic’ (fox29.com)\n[https://www.fox29.com/news/world-wheat-supply-food-shortage-un-security-council-sara-menker]\nwhich claims we have about 10 weeks left of reliable wheat supply (alt…",
  "data/reddit-stocks/r/stocks/comments/uvpzdz/apple_aaplus_plans_to_increase_production_in.json": "Apple (AAPL.US [https://AAPL.US]) has told some of its contract manufacturers\nthat it wants to increase production outside of China. India and Vietnam,\nalready home to a small portion of Apple's global production, are also on\nApple's shortlist to replace China.\n\n\n\nMore than 90% of Apple products…",
  "data/reddit-stocks/r/wallstreetbets/comments/uvicar/this_is_the_scariest_chart_i_have_seen_on_the.json": "It helps explain what is happening and also what might happen in the rest of\n2022?!?! The annual cost of mortgage payments on the average house in the US was\nabout 10,000 a mere 15 months ago (a little over 800$/month). It is now almost\n24,000 (roughly 2k/month). That is an insane change in a short…",
  "data/reddit-stocks/r/investing/comments/uvhuxg/underappreciated_risk_in_leveraged_loan_clo.json": "I'm entirely uncertain of where this post belongs, so forgive me if this isn't\nthe best sub.\n\nThe current macro environment has seen a bit of flight to safety and increasing\ncredit spreads. So, I've been looking at the leveraged loan & CLO markets and\nhow they have been handling the transition to…",
  "data/reddit-stocks/r/investing/comments/uvsl79/what_wasis_unique_to_japans_economy_that_caused.json": "I'm hoping someone can explain this to me like I'm a toddler, because all the\nresearch I do seems to yield more questions than answers.\n\nInvestopedia\n[https://www.investopedia.com/articles/economics/08/japan-1990s-credit-crunch-liquidity-trap.asp]\nseems to explain it best, Japan's lost \"decade\" was…",
  "data/reddit-stocks/r/stocks/comments/uvqifv/stock_selloff_to_intensify_as_fresh_10_plunge.json": "With the S&P 500 flirting with a bear market last week and notching more than $1\ntrillion in losses, participants in the latest MLIV Pulse survey reckon there’s\nmore pain to come.\n\nThe gauge is likely to keep falling this year before bottoming at around 3,500,\naccording to the median projection of…",
  "data/reddit-stocks/r/Bogleheads/comments/uvr637/retiring_solely_with_index_funds_no_roth_no.json": "I am a US citizen living abroad in my mid-20s. This makes me ineligible to\ncontribute to a Roth IRA and I will not be able to collect social security. I am\nnow at a point in my career however where I can reasonably contribute $1500 per\nmonth to Vanguard. Using some basic investment calculators…",
  "data/reddit-stocks/r/stocks/comments/uvybp4/sp_is_down_1000_points_since_january.json": "How many people thought that might actually happen?\n\nI know there are permabears who are always predicting a crash that predicted\nthis, but I think this large drop caught 99.9% of people off guard. Especially\nall those who thought markets only go up.",
  "data/reddit-stocks/r/stocks/comments/uvzuh7/gamestop_launches_wallet_for_cryptocurrencies_and.json": "May 23, 2022\n\nGRAPEVINE, Texas--(BUSINESS WIRE)--May 23, 2022-- GameStop Corp. (NYSE: GME)\n(“GameStop” or the “Company”) today announced it has launched its digital asset\nwallet to allow gamers and others to store, send, receive and use\ncryptocurrencies and non-fungible tokens (“NFTs”) across…",
  "data/reddit-stocks/r/Bogleheads/comments/uw1sx0/thanks_to_the_bogleheads_what_an_excellent_group.json": "I'm in my 50's and only recently discovered this group along with the wiki site\nand other online forum.\n\nYou all provide a wealth of information and although I cannot turn back time and\ncorrect my mistakes, I can move forward with better information and confidence.\nI can also pass along the lessons…",
  "data/reddit-stocks/r/wallstreetbets/comments/uw34pa/g_m_e_the_data_reveals_that_a_historical_stock.json": "BIG PICTURE DISCUSSION\n\nAs the wealth shock\n[https://www.yahoo.com/now/5-trillion-wealth-shock-cracking-132734925.html] (and\nmarket crash) that I predicted here\n[https://www.reddit.com/r/wallstreetbets/comments/tsa8t7/yield_curve_stagflation_fed_rate_hikes_world_war/]\nis taking place, seasoned…",
  "data/reddit-stocks/r/wallstreetbets/comments/uw6ltu/why_everyone_should_own_at_least_1_share_of_gme.json": "Whether you believe in all the DD or not, you have to acknowledge that there is\na non-zero chance that GME could still squeeze in the thousands of dollars or\nmore. Given the asymmetric risk/reward ratio on this stock, everyone should own\nat least 1 share of GME.\n\nAt the current price of roughly…",
  "data/reddit-stocks/r/stocks/comments/uw6d1o/starbucks_leaving_russia.json": "Starbucks is leaving Russia.\n\nThe coffee chain said it had closed 130 stores in the country, where a licensing\npartner employs about 2,000 workers, and ended its brand presence there.\n\nStarbucks said employees in Russia would be paid for six months and supported in\nfinding new jobs.\n\nStarbucks…",
  "data/reddit-stocks/r/investing/comments/uw9xjk/i_think_a_pause_in_september_might_make_sense.json": "https://www.reuters.com/markets/us/bostic-baseline-is-pause-rate-hikes-september-assess-impact-2022-05-23/\n\nIt \"might make sense\" for the Federal Reserve to pause further interest rate\nhikes following expected half-point rate increases over the next two months as\nthe central bank assesses the…",
  "data/reddit-stocks/r/stocks/comments/uwb9de/snap_ceo_evan_spiegel_preannounces_a_miss_of.json": "https://www.cnbc.com/2022/05/23/snap-shares-fall-as-ceo-says-company-will-miss-revenue-and-earnings-estimates-plans-to-slow-hiring.html\n\nThe CEO cited rapid deterioration in macroeconomic landscape and also announced\nthe company will slow hiring (among a number of companies to do the…",
  "data/reddit-stocks/r/stocks/comments/uwaybq/googl_dip_after_hours.json": "The whole market, for the most part, saw a Green Day today.\n\nHowever, GOOGL has, since market close, given up the entire day’s earnings and\nthen some.\n\nI tried to find some news, but not seeing it.\n\nDid something shake GOOGL down at market close that is not easily found online?\n\nNote: AMZN also…",
  "data/reddit-stocks/r/Bogleheads/comments/uw9tmz/i_am_investing_7030_long_term_what_else_is_there.json": "Hi everyone,\n\nafter reading „The intelligent investor“, „A random walk down Wall Street“ and\n„The Four Pillars of Investing“, I came to the simple conclusion that investing\n70:30 is everything I need long term: 70% developed markets (of which approx.\n58% are the US) and 30% Emerging Markets.…",
  "data/reddit-stocks/r/Bogleheads/comments/uwdsax/has_anyone_used_their_bogleknowledge_as_a_career.json": "I'm getting close to the point where I can start coasting to retirement. My\ncurrent job will put me in an early grave, so I'm just there until I don't need\nto be... And that is coming up relatively quick.\n\nI would love to enter and end up in a career where I actually enjoy the work,\nand not just…",
  "data/reddit-stocks/r/stocks/comments/uw6wyf/airbnb_is_closing_its_domestic_business_in_china.json": "Key points from the article.\n\n\n\n * All mainland Chinese listings — homes and experiences — will be taken down by\n   this summer, but Airbnb will continue to maintain an office in the country to\n   focus on outbound travel.\n * Airbnb formally launched its mainland China business in 2016 and has…",
  "data/reddit-stocks/r/stocks/comments/uw0e94/denmark_hits_streaming_services_with_levy_to.json": "Lawmakers in Denmark have agreed global TV streaming services such as Netflix\n(NFLX [https://www.tradingview.com/symbols/NASDAQ-NFLX/news/]), Amazon (AMZN\n[https://www.tradingview.com/symbols/NASDAQ-AMZN/news/]) and Disney (DIS\n[https://www.tradingview.com/symbols/NYSE-DIS/news/]) must pay a levy…",
  "data/reddit-stocks/r/stocks/comments/uwi3vs/klarna_to_lay_off_10_of_its_workforce_as_souring.json": "https://www.cnbc.com/2022/05/23/klarna-to-lay-off-10percent-of-its-workforce-.html\n\nKlarna plans to lay off about 10% of its global workforce, making the buy now,\npay later company the latest major tech name to announce job cuts. Sebastian\nSiemiatkowski, Klarna’s CEO and co-founder, made the…",
  "data/reddit-stocks/r/stocks/comments/uwh8as/141_companies_in_the_sp_still_have_a_pe_above_30x.json": "Source: https://finviz.com/screener.ashx?v=111&f=idx_sp500&o=-pe\n\n12 companies in the S&P still have a P/E above 100x\n\n28 companies in the S&P still have a P/E above 75x\n\n52 companies in the S&P still have a P/E above 50x\n\n141 companies in the S&P still have a P/E above 30x\n\n203 companies in the…",
  "data/reddit-stocks/r/stocks/comments/uwow57/tech_rout_set_to_drag_wall_street_lower_as_snap.json": " * Marketwatch: Tech rout set to drag Wall Street lower, as Snap warning drags\n   Facebook, Google, Twitter lower in premarket\n   [https://www.marketwatch.com/story/tech-rout-set-to-drag-wall-street-lower-following-a-grim-warning-from-snap-11653378644]\n\n * Wall Street Journal (Paywall free): Stock…",
  "data/reddit-stocks/r/stocks/comments/uwqaeo/earnings_expectations_are_getting_worse_morgan.json": "Earnings expectations for U.S. companies are \"deteriorating rapidly,\" according\nto a report from Morgan Stanley, which could exacerbate the stock market's\nyear-to-date losses.\n\n“Reduced earnings estimates and unexpected negative economic factors could lead\nto a further 5% to 10% decline in the S&P…",
  "data/reddit-stocks/r/wallstreetbets/comments/uwo1ti/tesla_going_bellow_400_would_margin_call_elon_and.json": "By Senad Karaahmetovic:\n\nToni Sacconaghi, a Senior Analyst at Bernstein covering U.S. IT Hardware, has\ndiscussed implications for Tesla (TSLA) shares amid an ongoing saga concerning\nCEO Elon Musk and his deal to acquire Twitter (TWTR) for $44 billion.\n\nMusk may “ultimately elect or be forced to…",
  "data/reddit-stocks/r/stocks/comments/uwso3p/metas_zuckerberg_sued_by_dc_attorney_general_over.json": "Read full article:\nhttps://www.barrons.com/articles/meta-facebook-mark-zuckerberg-sued-cambridge-analytica-51653322179?siteid=yhoof2\n\nWashington D.C. Attorney General is suing FB's Mark Zuckerberg over Cambridge\nAnalytica scandal. Do you think this lawsuit might have adverse effects on Meta\nFB…",
  "data/reddit-stocks/r/investing/comments/uwrp4s/what_happens_to_amazon_stock_after_split.json": "Hello,\n\nI understand how rhe basics of splits work and I know the number of shares we\nhave will be multiplied by 20, while the price is divided by 20. My question is\nwhat happens after to split to the shares we own that are not divisible by 20?\nWould we have, for example, 1.12 shares with the…",
  "data/reddit-stocks/r/stocks/comments/uwsdig/social_media_stocks_decline_sharply_after_snaps.json": "Social media stocks were sliding in Tuesday trading after Snap (SNAP\n[https://www.tradingview.com/symbols/NYSE-SNAP/news/]) said late Monday it is\nlikely to miss its own targets for Q2 revenue and adjusted earnings before\ninterest, taxes, depreciation and amortization, citing faster-than…",
  "data/reddit-stocks/r/stocks/comments/uwkedg/should_i_sell_could_use_some_help.json": "I purchased 25 shares of Marathon Oil at $5 during the Pandemic. The shares are\nnow worth almost $30 each. This is the highest it’s been in over 5 years. Should\nI sell them? I’ve never sold any of my stocks and I’m up on a few of them.\nAlthough I don’t have a ton of shares. I only just got into the…",
  "data/reddit-stocks/r/investing/comments/uwthjf/i_hate_how_people_act_like_investing_is.json": "No one knows anything. No one knows what’s going to happen next. Don’t come at\nme with long winded paragraphs about why people need to be educated on all these\ndifferent stats and metrics that need to be calculated or whatever to determine\nwhat’s worth investing- if you knew how the market was…",
  "data/reddit-stocks/r/Bogleheads/comments/uwrkos/thoughts_on_my_us_international_allocation.json": "I’m thinking of tilting to 50/50 US and ex-US in my HSA, 529, Roth, and taxable\naccount via Fidelity.\n\nI would do 50% FSKAX & 50% FTIHX in all accounts.\n\nBackground/reasoning for this: Im a federal employee with federal pension and my\nTSP is allocated for 80/20 C/S approximately the US Total Stock…",
  "data/reddit-stocks/r/stocks/comments/uwgecp/this_is_an_opportunity_to_build_a_bestinclass.json": "That tag line came from a JP Morgan analyst during a CNBC interview today (Matt\nRoss).\n\nI think it summed up pretty well what I as an investor (vs trader) am trying to\naccomplish right now... and need to remind myself during the now seemingly\nunending run of red days.\n\nI have to ask myself - Am I…",
  "data/reddit-stocks/r/Bogleheads/comments/uwtyyr/is_it_better_to_keep_feeding_my_portfolio_or_buy.json": "i am entering my 30's single, no dependents, and renting an apartment. I plan on\nstaying single, and not having kids for a long time, if ever. I am disabled, so\ni receive government benefits that are not taxed, each month, but cannot be used\nin any kind of tax advantage retirement account. I have a…",
  "data/reddit-stocks/r/stocks/comments/ux07p4/fed_critic_jeremy_siegel_now_says_money_supply.json": "For the last year Jeremy Siegel has been complaining that the Fed wasn't doing\nenough. Today, he said he was shocked by the drastic drop in money supply, he\nsaid money supply is the key indicator he looks at for forecasts, and that he's\nseeing:\n\n> 2nd largest monthly decline in money supply in 60…",
  "data/reddit-stocks/r/Bogleheads/comments/uwvv7b/looking_for_allocation_advice_on_a_core4.json": "Hello all,\n\nI am looking for some advice regarding my percentage of allocation. For VNQ, is\n13% too high? If so what is the recommendation for allocation? I am currently 29\nyears…",
  "data/reddit-stocks/r/Bogleheads/comments/uwyil5/help_needed_a_few_questions_on_bonds.json": "Hello everyone,\n\nbackground: currently I‘m 100% into stocks (globally diversified). I‘m from\nEurope.\n\nI would also like to get into bonds and turn the 100% stocks into 70% stocks ans\n30% bonds. My preferred bond marke entry would be through an ETF.\n\n1.Do bonds have to be globally diversified (as…",
  "data/reddit-stocks/r/Bogleheads/comments/uwz4kt/roth_ira_portfolio_for_a_23_year_old.json": "Hello, fellow bogleheads!\n\nI’m 23 years old. I have a decent Emergency Fund and a little bit of savings\ntoo. Now, I’m hoping to open a ROTH IRA for myself and another one for my\ngirlfriend. I’m new to investing and keep second-guessing myself. I’m hoping to\nget some help here. My thought process so…",
  "data/reddit-stocks/r/stocks/comments/ux2rt9/the_south_park_investing_strategy.json": "Intro\n\nGreetings you filthy animals! In light of the collapsing market I've been\nlooking for investing strategies that still work (like this\n[https://www.reddit.com/r/StockMarket/comments/uw86l4/this_is_actually_beating_the_sp_500_this_year/]).\nThis is another one of them!\n\nThe Question\n\nCould a…",
  "data/reddit-stocks/r/Bogleheads/comments/ux6xsn/a_reminder_to_and_update_for_folks_worried_about.json": "Year to date returns:\n\n * US stocks -18%\n * US Treasuries -7%\n * US TIPS -6%\n\nUS stocks are on the whole down around 2.5 times as much as safe US bonds. Even\nwhen the direction of movement is similar for a while, the *magnitude* matters\nas well. Diversify, buy, hold, and stay the course.\n\nSource:…",
  "data/reddit-stocks/r/stocks/comments/ux2mdt/lyft_to_slow_hiring_and_cut_costs_in_face_of.json": "Lyft Inc. plans to slow hiring and cut costs in parts of the company as the\nride-hailing giant grapples with the turbulence hitting technology stocks. \n\nPresident John Zimmer told employees on Tuesday that the company isn’t planning\nto lay off staff, according to spokeswoman Jodi Seth. And even as…",
  "data/reddit-stocks/r/stocks/comments/ux82gj/what_could_have_happened_when_the_market_crashed.json": "A recent conversation with my dad had me wondering about how close (or far away)\nthe US economy was to collapse in March 2020. Basically, we come to a point in\nthe discussion where we couldn't figure out if the circuit breakers used during\nthis time period saved the economy or not. For context, the…",
  "data/reddit-stocks/r/wallstreetbets/comments/uwxga2/i_just_watched_a_documentary_about_the_2008_crash.json": "Watch the small clip from 42:19-44;55 ( https://youtu.be/T2IaJwkqgPk) and it\ngives a great example of these companies shorting or counterfeiting stock and\nthe extent and needs their ceos and managers are willing go taking mortgage\nloans that will not risk their funds and driving up housing prices.…",
  "data/reddit-stocks/r/investing/comments/ux92pi/cathie_wood_laps_up_16m_in_tesla_marking_2nd.json": "Cathie Wood-led Ark Invest scooped up more shares in Tesla Inc (NASDAQ: TSLA\n[https://www.tradingview.com/symbols/TSLA/]) on Tuesday, a day after the money\nmanaging firm resumed buying shares in the Elon Musk-led company. The stock has\nplunged 37% in a month in the backdrop of production issues in…",
  "data/reddit-stocks/r/stocks/comments/ux4w1p/if_the_market_only_goes_up_over_time_or_at_least.json": "Like wouldn’t it make sense to buy it now (yeah yeah yeah DCA blah blah blah)\nand hold it for the next 30+ years? I’m only 24 so I have time to eat shit for a\nfew years in the meantime.\n\nIt’s up 230% vs QQQ’s 109% over the past 5 years.",
  "data/reddit-stocks/r/stocks/comments/uxbtkb/nike_is_leaving_russia.json": "Nike has not extended its franchise agreement with Inventive Retail Group (IRG),\nwhich owns the company’s Russia-based largest single-brand chain. IRG manages 37\nNike stores, 9 stores are currently closed.\n\nAccording to IRG President Tikhon Smykov, Nike will therefore not be able to set\nup…",
  "data/reddit-stocks/r/wallstreetbets/comments/ux6ej2/moderna_ceo_at_world_economic_forum_we_are_in_the.json": "Pfizer and Moderna are fukt. Ceo of moderna said it himself. Nobody wants them\nanymore. Lots of wasted product. Makes sense when you look at the data, covid\nvaccinations have been plateauing. Nobody wants to get jabbed every 4 months.\n\nModerna CEO telling the world they are about to lose a shit ton…",
  "data/reddit-stocks/r/Bogleheads/comments/uxfnf6/milestones_reached.json": "I finally was able to max out my HSA contribution and just opened a Roth (not\nmaxed yet, but still)! I’m 43 but it’s never too late right? Just had to share\nwith people who care about this stuff.\n\nEdit: For anyone interested, I have target date funds in both.",
  "data/reddit-stocks/r/stocks/comments/uxhwd2/elon_musk_moves_into_restaurant_business_will.json": "Tesla (TSLA.O) has submitted documents to the city of Los Angeles on May 19\nlocal time, applying to open a 24-hour restaurant at 7001 Santa Monica Avenue in\nHollywood. The 9,300-square-foot restaurant is understood to include a drive-in\nmovie theater and a supercharging station. Tesla did not…",
  "data/reddit-stocks/r/stocks/comments/ux9ag3/can_we_add_a_pinned_post_to_warn_people_about.json": "There’s a lot of people that come here thinking tqqq is just a free money\nmachine or mergers are guaranteed profit. Wouldn’t it be smart to provide some\nwarning to protect people from these common traps?",
  "data/reddit-stocks/r/stocks/comments/uxiabr/amzn_shareholders_meeting_what_news_do_you_most.json": "Amazon stock was one of the first stocks hit by the great sell-off in retail.\nPity it’s not really a retailer.\n\nThe stock was due to open May 23 at $2,177, a market capitalization of just\n$1.09 trillion. You can say “just” in this case because it has lost 35% of its\nvalue this year. That's thanks…",
  "data/reddit-stocks/r/investing/comments/uxi44m/amazoncom_opens_clothing_retail_store_in_los.json": "Amazon.com (AMZN [https://www.tradingview.com/symbols/NASDAQ-AMZN/news/]) opens\nits first physical clothing retail store in Los Angeles, California, Reuters\nreported Wednesday, citing the company.\n\nThe store, called Amazon Style, will make use of machine learning technology to\nassist in finding…",
  "data/reddit-stocks/r/investing/comments/uxks5j/sequoia_capital_this_is_a_crucible_momentcheap.json": "https://www.theinformation.com/articles/sequoia-warns-founders-of-crucible-moment-advises-how-to-avoid-the-death-spiral\n\nSequoia has put out some legendary decks/memos, like the Black Swan memo of\n2020, but I still think it's worth examining their sentiment. If you can't track\ndown their most…",
  "data/reddit-stocks/r/stocks/comments/uxgjpc/why_invest_in_brk_when_the_sp_500_exists.json": "I know Berkshire Hathaway, is popular and considered a strong stock, and I\nmyself have been interested in it for a while. But why invest in $BRK when\nrecently it has basically followed the S&P 500\n[https://i.imgur.com/VZr4cwL.jpg]? Hell, even Buffett himself has told his wife\nto put their money…",
  "data/reddit-stocks/r/stocks/comments/uxkxot/only_18_of_americans_plan_to_increase_their_stock.json": "Read full article:\nhttps://www.cnbc.com/2022/05/23/18percent-of-americans-plan-to-increase-stock-market-investments-this\nyear.html#:~:text=About%2018%25%20of%20Americans%20are,1%2C500%20investors%20April%2019%2D22\n[https://www.cnbc.com/2022/05/23/18percent-of-americans-plan-to-increase-stock-market…",
  "data/reddit-stocks/r/stocks/comments/uxm4hs/borrow_fees_of_100_anyone_with_prior_examples_of.json": "Obvious amateur to the market. Are there significant examples of borrow fees\nskyrocketing to this extent and what/why are the usual suspects of this\nhappening and how had this played out with other tickers?",
  "data/reddit-stocks/r/stocks/comments/uxold2/retail_commodity_traders_choose_oil_gas_over_gold.json": "Full Article:\nhttps://energycentral.com/c/og/retail-commodity-traders-choose-oil-gas-over-gold-according-report-capitalcom\n\n\"Generally, commodities have often acted as a safe haven when markets are\nplummeting. However, while gold still continues to attract a significant\nincrease in activity, oil…",
  "data/reddit-stocks/r/investing/comments/uxoye4/an_amusing_economic_indicator_strippers_say_a.json": "I'm kind of a fan of amusing alternative maybe-leading indicators. Before this\none, the most amusing was the \"Fluffy Puppy\" indicator, which was flashing red a\nshort time ago (accompanied by cute puppy video)\n[https://finance.yahoo.com/news/the-fluffy-puppy-indicator-signaling-a-recession…"
}