{
  "data/reddit-top/r/antiwork/comments/rug5ib/my_boss_exploded.json": "After the 3rd person quit in a span of 2 weeks due to overwork and short-staffed\nissues, he slammed his office door and told us to gather around.\n\nHe went in the most boomerific rant possible. I can only paraphrase. \"Well, Mike\nis out! Great! Just goes to show nobody wants to actually get off their…",
  "data/reddit-top/r/antiwork/comments/s0fgz7/owners_didnt_want_to_give_me_what_i_deserved_now.json": "I am a young Project Manager for an unlimited commercial GC. I picked up a\nhammer for the first time 6 years ago (no prior experience). I was raised\nbelieving if you work hard and apply yourself you will be successful. For 2\nyears I learned everything that I could in the construction industry. Took…",
  "data/reddit-top/r/antiwork/comments/s1deoh/i_made_my_boss_over_15_million_in_commission_over.json": "I worked my ass off for this man, essentially running his entire book of\nbusiness for him. For Christmas he got me a $25 AMC gift card. The closest AMC\ntheater is 1.5hrs away in another state. That pissed me off and made me start\nlooking for other jobs. I genuinely cared about my job and the…",
  "data/reddit-top/r/antiwork/comments/s294dh/ive_been_getting_paid_80k_a_year_for_the_last_5.json": "throwaway - I am an account manager for a telecom company that provides VOIP\nphones to companies. There are about 20 of us and our job is primarily to answer\nany questions about the phones, the service, billing, etc. We have hundreds of\nclients.\n\nWhat the boss does is assign clients to each of us…",
  "data/reddit-top/r/antiwork/comments/s2igq9/i_automated_my_job_over_a_year_ago_and_havent.json": "I saw some similar posts to this so I thought I'd jump on the bandwagon.\n\nI work for a mid-size lawfirm that hired me as an IT specialist to handle all of\ntheir digital evidence for trials. The law-firm was in the process of changing\ntheir evidence managing system to Cloud based and wanted me to to…",
  "data/reddit-top/r/tifu/comments/s3f513/tifu_by_lying_to_my_wife_for_13_years.json": "TIFU by lying to my wife for 13 years…\n\nMy wife hates orange and lime flavored candies. I love them. Well, love the\norange, like the lime.\n\nSo, she passes on the orange starburst to me. She passes the orange and green\nskittles to me. She passes the orange and green gummy bears to me. This has…",
  "data/reddit-top/r/antiwork/comments/s5hwzn/manager_steals_tips_one_upvote_and_he_gets_my_2.json": "Edit: I am going to quit tonight. Not even finish my shift. He’s getting my keys\nand uniform and im gone. Thank you guys for the words and the help! I’ve been\nworking since I was 14 under incredibly shitty bosses so I never realized how\nillegal his actions were. I’m going to call him out tonight…",
  "data/reddit-top/r/antiwork/comments/s6y54e/boss_wouldnt_accept_my_resignation_letter.json": "After several months of having my vacation time off requests denied, my staff\nbeing fired and not replaced and my work hours increased without my consent, I\nwalked into my boss' office and handed her my resignation letter. I was giving 4\nweeks notice, which I thought was nice. She looks at me, says…"
}