{
  "data/reddit-ask/r/TooAfraidToAsk/comments/ru93cu/why_are_the_covid_variants_promoted_as_a_bad.json": "<!-- SC_OFF --><div class=\"md\"><p>From what I understand, a virus needs a host\nin order to replicate. If the virus is killing the host, it has less of a chance\nof being transmitted.</p> <p>So in subsequent mutations the virus will become\nless deadly but more easily spread.</p> <p>After a number of…",
  "data/reddit-ask/r/askscience/comments/rubcq6/where_does_gut_bacteria_come_from_and_how_does_it.json": "My understanding\n\nGut bacteria is single cell bacteria of foreign DNA, that interacts with the\nfood we have chewed and broken down with stomach acid. It breaks down the food\ninto more basic compounds that are easily absorbed into the walls of the\nintestines.\n\nThe bacteria species are different at…",
  "data/reddit-ask/r/askscience/comments/rud4gd/is_a_single_vertical_propeller_enough_for_full.json": "I’ve seen a toy floating around my advertisements that looks like a small ball\nwith a fan on the inside. You’re supposed to be able to toss it and it will come\nback to you. It’s called the fly orb.\n\nMy question is though, is this single “propeller” enough to give this toy full\nflight capabilities…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rumot4/why_is_there_a_gay_accent.json": "Why is there a stereotypical gay accent? What causes it? And is there any major\nchange between regions or is it semi static?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ruf0jw/why_do_a_lot_of_people_think_black_people_cant_be.json": "Full disclosure: I am not American, I live in America however and I believe that\nI understand the history of this country to some degree and the sensitivity that\ncomes with this topic.\n\nThat being said, I am genuinely trying to understand why a lot of people have\nthat notion (title). Do people mean…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rultma/if_i_wanted_to_experiment_with_prostate.json": "The idea of having a fake penis in my butt doesn’t exactly get my motor going.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rut46t/why_is_anal_so_popular.json": "IMO anal seems so gross and useless when you have a vagina right next to it. Why\nwould anyone want to have anal?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rugano/why_do_so_many_weed_smokers_seem_to_have_a_need.json": "I realize there is far more that don't. And I have nothing against smoking, it\njust seems odd to me.\n\nEDIT: thankyou all for your time responding, I have learned a fair bit thanks to\nyou all sharing your opinions and experiences. It seems it is mainly due to a\nmixture of the legalization of…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/run3n9/are_we_just_waiting_out_covid_at_this_point.json": "If you’re going to respond about how covid is fake or vaccines are about\ncontrol, don’t bother responding.\n\nBut at this point, most everyone is eligible to get vaccinated. While the\nvaccine does not prevent the spread of Covid, it does reduce risk of\nhospitalization. People who do not get…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rusxdb/why_dont_people_google_things_they_want_to_know.json": "For example: I just saw someone ask in this sub what OP means on reddit. But\nthis extends into bigger things like climate change, politics, social issues,\nscience, etc. Even simple things like is this image I see on Facebook\nphotoshopped, or what's a substitute for butter in a recipe.\n\nI'm not…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ruifo6/what_if_youve_been_following_the_wrong_religion.json": "This is probably a more opinion based questions but... What do you think happens\nwhen someone has been following \"the wrong religion\"?\n\nAs in if someone is of religion X and has been good according to the teachings,\nbut then dies and ends up being judged in the way of religion Y... Would they go\nto…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ru7spr/do_guys_actually_care_if_a_girl_has_the_lower.json": "i’m kinda insecure about it and becoming intimate with a s/o because of it so i\njust wanna know what guys really think of it",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ruq2wu/why_are_the_changes_in_the_voting_laws_in_the_us.json": "I'm European, and every voter has to show his or her ID to be able to vote. I\ncan't wrap my head around the idea that identity of a person trying to vote\nisn't verified before they can vote.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ru7ika/why_does_rich_celebrities_gather_money_for.json": "All i mean is, you are a celebrity or an streamer or something else, why do you\ngather money from other people and give it to charity by your name! This is\nweird for me! I don't get it!",
  "data/reddit-ask/r/NoStupidQuestions/comments/ruonri/a_question_for_men.json": "basically when women are out walking alone at night, and there’s a guy walking\nbehind, we usually get nervous ans panic a bit and hope it’s not a murderer or a\nkidnapper or something like that\n\ndo you guys usually think ”damn how can i make myself not scary when heading the\nsame direction as…",
  "data/reddit-ask/r/NoStupidQuestions/comments/ruc9al/is_reddit_kinda_toxic_i_really_feel_that_always.json": "It's like people always wanted to villanize you. If I ask in a parenthood group,\nI sucks as a father, \"you should've done....\" If I ask in a relationship advice\ngroup \"find new friends\"\n\nEdited: thanks a lot guys for your answers, they gave me a better view.",
  "data/reddit-ask/r/NoStupidQuestions/comments/rul8ln/apple_pear_grape_orange_cranberry_etc_juices_are.json": "I have literally never seen pure strawberry juice being sold at a grocery store\n- it's always mixed in with other fruits such as cranberries or kiwis.\n\nIs there a reason why strawberry juice is never sold on its own?",
  "data/reddit-ask/r/NoStupidQuestions/comments/rutcnu/why_cant_porn_just_have_a_believable_and.json": "Like I can't be the only one who either skips through the plot part of straight\nup mutes it, right?\n\nEdit: I probably should have mentioned that I search by specific porn stars. I\nhave many people replying that normal porn does exist and that I'm just not\nlooking hard enough for it, and that's…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ruqd0v/why_do_people_post_the_same_obvious_shit_on_here.json": "I dont come on here to wage comment wars and get empty likes for saying things\npeople just agree with.",
  "data/reddit-ask/r/askscience/comments/ruzsp7/when_a_huge_piece_of_ice_calves_off_a_glacierice.json": "I hope this lengthy question makes sense. Essentially, I have always wondered\nwhether sea levels around the world rise simultaneously when something large\nenters the ocean (e.g. an iceberg forms in Greenland and sea levels in the\nPacific rise immediately once the initial wave caused by the falling…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ruzyuy/i_cant_find_one_of_my_balls_please_help.json": "So I was beating my meat and usually my right ball goes inside of me and I can\neasily push it back out but this time it’s my left one. I can’t push it out\ncause idk where it’s at. I only have one right now!!!!!",
  "data/reddit-ask/r/AskWomen/comments/ruvdmg/what_is_your_goto_depression_meal.json": "Mine is fried fish fingers with rice and mayonnaise",
  "data/reddit-ask/r/NoStupidQuestions/comments/rv1oxp/would_i_be_able_to_win_a_fight_with_a_silverback.json": "I‘m a pretty built guy with 220lbs at a height of about 5‘10 and I‘ve been\nboxing/kickboxing for over 9 years. I also did some Karate when I was 8 (lol).\n\nDo you think I would be able to defeat a Silverback Gorilla if I had a baseball\nbat?",
  "data/reddit-ask/r/AskHistorians/comments/rutbd2/how_did_native_americans_protect_themselves_from.json": "Like I'm sure it varies from civilization to civilization, but even now with all\nthe protective measures we have in place we're pretty vulnerable, and they\ndidn't have cars to drive to safety",
  "data/reddit-ask/r/AskHistorians/comments/rv2lho/monday_methods_why_are_there_letters_in_the_ogham.json": "Happy New Year to all, and a special thanks to the mods for this brief foray\ninto some philology!\n\nI have attempted to write this in a way that is accessible and comprehensible to\na general reader, as well as attempting to remain relatively concise, and thus\nthere are, of course, areas upon which I…",
  "data/reddit-ask/r/AskHistorians/comments/rv081l/is_there_any_truth_to_the_story_that_paypal.json": "I've heard semi-knowledgable people state that PayPal effectively sourced a\nsubstantial portion of its early funds by accepting payments from customers, but\nthen would not pass on the funds to the recipients. The idea was that targeted\nusers would be given 'payment error' notices that implied that…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rv5s7t/men_of_reddit_do_you_look_at_other_women_despite.json": "I love my partner and would never do or dream of doing anything. However, I\ncan't help but look at other women and think wow she has a gorgeous face or wow\nthat's a nice butt (and stare a bit too long). I don't vocally say anything and\nI don't think it affects my relationship but I'm wondering if…",
  "data/reddit-ask/r/NoStupidQuestions/comments/rv59ef/damn_so_im_19_and_i_inherited_120k_from_my.json": "Like i don't wanna drink it away. Even tho I'm tempted.",
  "data/reddit-ask/r/NoStupidQuestions/comments/rv6hwv/why_do_old_people_stand_in_everyones_way_in_the.json": "I ask this not to be rude, but out of genuine curiosity. There has been many a\ntime where I’ve been at the grocery store, and old people are standing in the\nmiddle of the aisle with their carts either talking to someone or shopping, and\nthey make no effort to move out of the way, and appear…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rv3785/if_people_think_abortion_is_murder_why_do_they.json": "I am serious. I really can’t figure out why people believe that these women are\nmurders, and why on earth they would want that same “murderer” to birth a child\nand raise it.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rv2ukl/why_is_jk_rowling_so_hated_all_of_a_sudden.json": "What did she say that make people treat her like Satan?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ruwmqi/how_the_fuck_do_you_smalltalk.json": "i can’t do it. i just genuinely can’t hold conversations with anyone that\nrequires small chat. not only that but i am visibly awkward during these\nconversations, i can’t form sentences and i start stuttering and just nod in\nsilence. it’s embarrassing. what the hell are you even meant to talk…",
  "data/reddit-ask/r/askphilosophy/comments/ruzpvj/is_there_a_point_in_reading_criticism_of.json": "Now obviously there literally are things I can do such as vote, treat people\nbetter, limit my usage of certain things but I hope you can understand what I'm\nsaying here. I can't really see a way to fundamentally change the human\ncondition I live under\n\nIt worries me that many theorists such as…",
  "data/reddit-ask/r/AskWomen/comments/rus494/what_movie_always_turns_you_into_a_sobbing_mess.json": "Update: thanks for the award and all the responses! And by the way mine is\nLegends of the Fall. Quality ugly cry guaranteed every time 👌",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rvcfi4/22f_black_i_do_not_support_black_lives_matter_as.json": "As a black woman, I hate Black Lives Matter as a movement, but love it as a\nsimple message. I do not believe funding or time is being spent to actually\nfurther the ENTIRE black community but only make a very small percentage richer.\n\nIm tired of the organizations saying their goal is to help black…",
  "data/reddit-ask/r/NoStupidQuestions/comments/rv2v4j/why_do_we_have_the_bad_feeling_before_returning.json": "I’m returning to work tomorrow and for the life of me, I’m having the bad\nexistential stomach churning experience. I’m in my late 20’s now and I know from\nthe past it’s nothing, I will show up to work and it will be like before I left\nat Christmas. Same as when we used to return back to school.\n\nSo…",
  "data/reddit-ask/r/AskHistorians/comments/rv9tew/does_anyone_have_any_info_about_the_mythical.json": "Ok, the headline sounds insane, but this Vanity Fair article\n[https://www.vanityfair.com/news/2008/05/jewish200805] has the following quote:\n\n> The last stop of this meditation is Zagorsk, Russia, where, troubled by the\n> anti-Semitism he encountered there, my friend Andrew Solomon asked a local\n>…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rvh4ai/is_it_judgmental_if_i_lose_interest_in_being.json": "My best friend is almost 30 years old, never had a job, and plays video games\n24/7.\n\nI’ve tried helping her find a job and live a healthy lifestyle, and she always\nacts like she wants to but doesn’t put in any effort, I even wrote her resume\nfor her once. (I had to make it up because she had no…",
  "data/reddit-ask/r/askscience/comments/rvepm4/when_you_successfully_fight_off_a_mutated.json": "This question is geared towards the Omicron Covid-19 outbreak, but really\nextends to the immune system in general.\n\nAfter receiving a booster of the Covid-19 vaccine, your body will produce\nantibodies targeting the original strain of the virus. Even though the potency\nof the antibodies against the…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rvfzc6/girls_why_do_you_do_this.json": "I’ve slept/made out with a few girls that had a habit of not just gently\nsqueezing my balls but literally crushing them. It really hurts and isn’t even\nsexy painful. Even when I bring tell them “hang on”, they stop but as soon as\nthey touch me again they hurt me. One even blamed their nails instead…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rvj3j7/what_is_more_exhausting_than_arguing_about_covid.json": "Is anyone else just sick and tired of arguing about the same shit everyday? Can\nwe just argue about fun things like is TB12 the GOAT or should Bonds and Clemens\nbe in the HOF? Is Christmas better than Thanksgiving? What’s better drakes or\nlittle Debbie’s?\n\nCome on people life should be fun not…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rvkwfr/waitso_people_dont_talk_to_themselves.json": "Howdy, ever since I was a kid i would talk to myself, not in the I have an\nimaginary friend or split personalities sense but more of narration. I'll say,\n\"okay, got my phone, keys, wallet, oh and I can't forget those papers for the\ndoctor\" or at work I'll say \"okay I need 16 packages of 11487 where…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rvpvml/are_most_men_plagued_with_skid_marks_in_their.json": "So I’m honestly just not sure at this point. I once lent some white basketball\nshorts to my dad when he wasn’t doing so great financially, and was living with\nme at my apartment. When I finally got them back after literal weeks (he’s the\nopposite of a punctual person) there were… um… well 💩 stains…",
  "data/reddit-ask/r/AskWomen/comments/rvk4v7/for_those_of_you_with_careers_you_actually_enjoy.json": "Edit: Wow! Thank you so much to everyone who shared their responses. I woke up\nto so many lovely answers. I might not be able to respond to them all but I will\ndefinitely read and appreciate them when I get back from work. Have a great\nday/night wherever you are in the world!",
  "data/reddit-ask/r/NoStupidQuestions/comments/rvqqfu/do_people_actually_prefer_to_not_wear_pants_when.json": "Ever since the pandemic started, I've heard jokes about people going on a Zoom\nmeeting without any pants and looking professional from the waist up. Hell, even\nbefore covid, I've heard about people walking around the house with no pants on,\nparticularly when they're home alone.\n\nIs this an actual…",
  "data/reddit-ask/r/NoStupidQuestions/comments/rvr1x2/am_i_wasting_my_life.json": "So I’m 19, and I have a lot of regrets.\n\nI was always a socially awkward kid, but I was pretty ok until high school where\nI got a lot more socially isolated and my grades stated slipping.\n\nNow I’m a college student.Except I don’t even go to campus and do college\nonline.This means I live at home and…",
  "data/reddit-ask/r/AskHistorians/comments/rvskca/the_famous_rumble_in_the_jungle_fight_between_ali.json": "Even accepting the fight was the biggest sporting event in the world, that\nnumber has to be way off right?\n\nThat would mean that over a quarter of the world population would have to be:\n\ninterested in the fight\n\nAwake\n\nNot working\n\nWith access to a television\n\nThat seems hard to believe to me, yet…",
  "data/reddit-ask/r/askscience/comments/rvuohl/does_repeated_exposure_to_covid_after_initial.json": "I’ve read that viral load seems to play a part in severity of COVID infection,\nmy question is this:\n\nSay a person is exposed to a low viral load and is infected, then within the\nnext 24-72 hours they are exposed again to a higher viral load. Is there a\ncumulative effect that will cause this person…",
  "data/reddit-ask/r/NoStupidQuestions/comments/rvsg11/when_exactly_does_water_become_unsafe_to_consume.json": "Let's say I fill up a clean glass with clean filtered water. I set it on a clean\ncoffee table of a clean, well maintained home, that's always kept at 72°F\n(22°C). The home is well insulated and there are no pets or insects inside.\nLet's say that 2 people live there. Life goes on and the glass just…",
  "data/reddit-ask/r/AskHistorians/comments/rvrssg/when_did_women_stop_working.json": "Hello everyone! I was listening to some ultra conservative guy talking about\ntraditional gender roles and how women should not go out to work and it made me\nwonder, how traditional is that really? In my head I have this image of women\nworking in the medical period and up to the 19th century, then…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rvizu2/is_it_acceptable_to_cut_ties_with_siblings.json": "For context: I am the youngest, 12 years gap between my older sister. I have 4\nsisters, but only one is greedy, manipulative and self-serving. I have witnessed\nhow she almost manipulated my parents into signing off land to her name, never\npaid debts she owed my parents, almost always causing them…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rvupw0/are_there_men_out_there_actually_fucking_with.json": "We all know how it’s a fun gift at a birthday for one of your friends in a dry\nspell. Or letting them sit on your shoulder during a music festival and they\n“die” within a few hours after your first beer.\n\nBut the thing I’m very affraid to ask, but very curious about.. Are there\nactually men…",
  "data/reddit-ask/r/AskWomen/comments/rw14k5/what_happened_when_you_found_a_reddit_post.json": "As in, did you ever find a post written about you from a friend, peer, (ex) SO,\netc.? What happened?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rw2c08/what_gives_predominantly_black_male_music_artists.json": "I noticed on social media and im interviews mainly black male artists refer to\nwomen as bitches or females. Even as far as calling their past or current wives\ngfs their bitch. Yet there is no outrage, but I never see other races refer to\nwomen in this way.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rw5yh0/is_adult_life_really_as_miserable_as_people_make.json": "Everyone on Reddit once they have reached 18 makes it seem that living the adult\nlife is awful. That we are all dirt poor, living paycheck to paycheck, working\nevery day of your life, never having time for hobbies, being more aware of the\nshit world around us.\n\nThat's the pattern I see around me…",
  "data/reddit-ask/r/askscience/comments/rvuzcv/many_emojis_have_taken_on_their_own_meanings_from.json": "For example if we were to keep seeing a picture of an animal, how would we know\nthey mean that animal, instead of perhaps that meaning something completely\ndifferent due to a cultural meme at the time.\n\nIt could instead be related to virtually anything, just as many of our emojis\nhave already taken…",
  "data/reddit-ask/r/AskHistorians/comments/rvz8y1/what_actually_is_the_origin_of_the_half_your_age.json": "A Google search\n[https://www.google.com/search?q=half+your+age+plus+seven+origin&hl=en] reveals\na variety of results:\n\n> In the 1950s, Nation of Islam leader Elijah Muhammad “taught that a wife's\n> ideal age was half the man's age plus seven”;\n> \n> Half your age plus seven is an unofficial rule of…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rvzcv0/i_find_reddits_humor_exhausting_is_this_common.json": "No, they are not exactly offensive but they are just too repetitive and so\nunoriginal. I swear I know what the top 5 comments are going to be just from the\ntitle and content.\n\nI'm not a funny guy, not gonna lie and I don't try to be at all. I don't do\nhumor and I might be genuinely the least funny…",
  "data/reddit-ask/r/NoStupidQuestions/comments/rw5cfz/over_the_years_lol_and_lmao_have_prevailed_in.json": "I remember seeing ROFL a lot more about a decade ago, along with the other two\nmentioned. But it seems like over the years it’s been getting used less.\n\nWhy do we think this one was left behind?",
  "data/reddit-ask/r/NoStupidQuestions/comments/rw7c2m/why_in_the_fucking_hell_do_companies_refuse_to.json": "It makes no sense to me. I'm not talking about burger flipping jobs either, I\nmean jobs that require a degree or years of experience in a certain field.\nPeople who already have experience (i.e. already have a fucking job) aren't\ngoing to apply to another job if they don't know how much money they…",
  "data/reddit-ask/r/AskHistorians/comments/rvx4q1/its_time_to_vote_for_the_best_of_askhistorians.json": "2021 has concluded, and that means it is time to look back and reflect on all\nthe amazing content that was written on the subreddit this past year.\n\nAnd while every single answer, and writer, who contributed over the past year\ndeserves recognition for the part they played in making this such an…",
  "data/reddit-ask/r/AskHistorians/comments/rvvpuf/from_1824_to_the_1980s_nycs_ticker_tape_parades.json": "The first major parade in NYC was for the returning revolutionary war hero, the\nMarquis de Lafayette in 1824.\n\nYou an read the full list of honorees here\n[https://en.wikipedia.org/wiki/List_of_ticker-tape_parades_in_New_York_City].\n\nBut it's striking how the parades go from mostly honoring…",
  "data/reddit-ask/r/AskHistorians/comments/rw9ef2/in_the_game_return_of_the_obra_dinn_the_titular.json": "For example, the ship's carpenter and his mate are Americans, the Bosun and his\nmate are from Austria and France, respectively. There are also New Guinean,\nRussian, Chinese, Danish, Swedish, etc topmen and seamen serving as crewmates.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rw6ybb/if_god_gave_us_free_will_why_would_he_condemn_us.json": "Seems to me a bit manipulative. Like when a bf/gf says “do whatever you want,”\nbut really they expect a certain outcome. Either God is not whom we think he is\nor he just doesn’t care and the idea of sin/free will is a human concept.\n\nEdit: For context, I am an ex charismatic/evangelical Christian…",
  "data/reddit-ask/r/AskHistorians/comments/rwee8b/how_prevalent_was_nazi_sympathizing_in_germany_in.json": "With society’s current struggles against disinformation, I’m wondering how\ndifficult it was to convince people who were subjected to a totalitarian state\nand it’s propaganda for over a decade that everything they’d been led to believe\nabout race, the government, their leaders, the war, etc was…",
  "data/reddit-ask/r/AskHistorians/comments/rw7a1o/what_caused_the_tokugawa_shogunate_to_stop_within.json": "At the start of the 1600s the country had a strong modern military, with tons of\nexperience and was newly United.\n\nHowever after a failed invasion of Korea they retreated into military isolation.\nWhy? Why didn’t they ever try expanding again?",
  "data/reddit-ask/r/AskHistorians/comments/rwf4fu/how_did_other_nations_besides_japan_and_the_usa.json": "Hey so I'm just curious, how did other nations of the world react to the atomic\nbombings of Japan? Were these nations shocked by the power of the bomb or were\nthey aware of it's development more than we were lead to believe?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rvw5fo/i_earned_money_from_crypto_and_idk_how_to_tell_my.json": "I recently joined an airdrop for a new crypto and was able to sell it for about\n140 USD i was able to use it to get amazon pay gift cards and i used it to buy a\nheadset and a ps5 controller.\n\nNow the hard part my package arrives in 3 days but I as a 15 yo teen boy dont\nknow how to tell my parents…",
  "data/reddit-ask/r/NoStupidQuestions/comments/rw7obw/im_canadian_visiting_usa_for_the_first_time_ive.json": "I'm visiting Alaska to meet my girlfriend's family and there was this big family\ngathering. I made blueberry cheesecake from scratch, even boiled down\nblueberries to make a syrup. It was nice. Maybe a couple people had a piece. I\nended up picking at it over the next few days but ended up throwing…",
  "data/reddit-ask/r/AskHistorians/comments/rw3eqj/why_do_we_surf_the_internet.json": "When did the metaphor of “surfing” the Internet come about? How did early\nnetizens conceptualize using the Internet, and were there competing metaphors?",
  "data/reddit-ask/r/NoStupidQuestions/comments/rwet8u/can_i_put_regular_bacon_in_the_microwave.json": "I don’t have time to cook it I am not sober and I am starving I want to make it\nquick PLEASE TELL ME J CAN HEAT IT UP\n\nFor all of you who told me I couldn’t make boiled eggs in the microwave I have\nsuccessfully finished bacon and boiled eggs in the microwave for 10 minutes!!",
  "data/reddit-ask/r/askscience/comments/rwmkru/are_there_any_organisms_that_consume_viruses.json": "Not thinking multicellular likely a marine plankton or small single called\nprotists",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rwk7fq/how_is_it_so_common_for_people_on_internet_to.json": "I'm european and I work around 40h a week and in american dollars I'm making\nlike 19k a year (I'm not very far from minimum wage) but making 100k would be\nlike making 8.3k a month which would mean, even if you work 60 hours a week,\nthat you make four times more than me for the same time worked, and…",
  "data/reddit-ask/r/NoStupidQuestions/comments/rwk2j4/what_do_americans_say_before_eating.json": "I am from germany and we say \"Guten Appetit\"- \"good appetite\", what do smerican\nor in generall english people say before eating something?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rwnrb8/is_turning_a_decent_guy_into_a_stalker_funny_to.json": "Yesterday night, two friends of mine (L and K) pranked me but I think it went\ntoo far. I didn't get mad at them or anything because they seemed like they\nreally meant it as a joke but it'll be hard for me to trust them again in the\nfuture.\n\nBasically, there's this guy (I'll call him B) who has a…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rwqro5/is_everyone_else_really_poor_right_now.json": "My wife and I make roughly 125k a year. She makes about 75, and I make 50.\n\nWe have two kids, a $1,600 mortgage, two cars, and I work from home (pre\npandemic)\n\nThe past few months I'm noticing our monthly expenses and bills have really gone\nup. I felt like we went from being a middle class family…",
  "data/reddit-ask/r/NoStupidQuestions/comments/rwpz7m/what_logical_reason_is_there_to_wear_shoes_in_the.json": "Even though im American born, my parents are immigrants and grew up never\nwearing shoes in the house. When I walked into friends houses, I find it so\ndisgusting they walk anywhere like on carpet or even to bed. To my knowledge it\nseems to be very American thing. Everyone else seemed to have the…"
}