{
  "data/reddit-projects/r/SideProject/comments/nqne3x/i_made_awesome_devtools_a_collection_of_tools_and.json": "Hey everyone. I want to share a little side project I've been working on called\nAwesome Devtools. The site is a collection of tools and resources for web\ndevelopers from around the internet. You can check out the code and the site\nbelow. Consider contributing if you have an awesome devtool to…",
  "data/reddit-projects/r/SideProject/comments/nqnz8e/i_made_a_website_and_app_thats_like_a_personal.json": "Hey there fellow entrepreneurs and start-up enthusiasts! For a long time I\nwondered why the way we store files in the digital space has remained unchanged\nfrom how we’ve been storing physical paper for centuries. About three years ago,\nI decided there must be a better way and, after studying an MSc…",
  "data/reddit-projects/r/SideProject/comments/nrfe3m/i_created_a_browserbased_video_editor_100_free.json": "Hey everyone,\n\nAfter looking around online for a free video editor, I started getting\nfrustrated with the options out there. After working on a video for a while, I\nwould click the export button only to be hit by one of the following options\n(ordered from most to least aggravating)\n\n 1. Pay a…",
  "data/reddit-projects/r/SideProject/comments/nro4h7/find_your_next_business_idea_over_600_hours_of.json": "I have a habit of analyzing interesting business trends every week. I started 6\nmonths ago and have curated over 20 reports so far.\n\nHere's a sample report, hope you enjoy it!\n\nIf you do, you can find 20 more of them here [https://signals.page/] (scroll\ndown for the archive).\n\n---\n\n\nLOW-RISK…",
  "data/reddit-projects/r/SideProject/comments/nsiywf/i_was_tired_of_looking_up_sale_items_at_whole.json": "Hi everyone, been working on this project for a little bit now - it used to be a\nscript I just ran but then I decided to make it into a more wholistic package to\npractice UI/UX and put something out there.\n\nAll coded in python, hosted on Heroku, $0 to make it which is always my\nconstraint since it…",
  "data/reddit-projects/r/SideProject/comments/nso2rr/i_created_a_fullstack_starter_template_for_react.json": "https://preview.redd.it/90ejgcvjpd371.png?width=1450&format=png&auto=webp&s=75b4dafc996f4e030d117b1ce5b47fd2ee12634d\n\nhttps://github.com/braydenwerner/Wern-Fullstack-Template",
  "data/reddit-projects/r/SideProject/comments/nsttn7/i_feel_working_remotely_is_lonely_so_i_built_this.json": "Basically, with Pipewing.com [https://Pipewing.com] I want to connect remote\nworkers with other remote workers from the same city through 1:1 video calls.\nThat way they can get to know each other and eventually meet in person for lunch\nor work.\n\nWhat's the difference to lunchclub? Lunchclub is…",
  "data/reddit-projects/r/SideProject/comments/nt9hgc/spent_a_year_and_a_half_building_a_dating_app.json": "Spent over a year learning coding and design from scratch but finally build and\nlaunched my first app.\nhttps://apps.apple.com/us/app/pooch-dating-app/id1558043054\n\nA dating app with an emphasis around your pets. Got a lot of features I want to\nadd and super excited to learn and develop this farther.…",
  "data/reddit-projects/r/SideProject/comments/nthsk3/280_top_directories_to_submit_your_startup_in_2021.json": "We spent 80+ hours reviewing 2,000+ websites to find the best Free and Paid ones\nto post your startup.\n\n- And yes, I am sharing it for free!\n\n- Yup, not even asking for your email.\n\nFind out which sites get the most traffic, how much traffic they get from your\ntarget country, and what SEO value you…",
  "data/reddit-projects/r/SideProject/comments/nuu2az/an_all_in_one_telegram_bot_i_am_aiming_to_build.json": "All utility bot [https://t.me/allutilitybot] is a Fast and Efficient ⚡️ telegram\nbot, forget about maintaining different bots for different utilities.\n\nAll the things you want are here ❤️\n\nDownload 3Million+ EBooks 📚,\n\nTranslate text to many languages 💟 ,\n\nText-to-Speech 💬 conversion,\n\nUnlimited…",
  "data/reddit-projects/r/SideProject/comments/nvxhzh/i_built_a_you_laugh_you_lose_webbased_game_that.json": "DEMO [https://youlaughyoulose.netlify.com] GitHub\n[https://github.com/vaibhavpras/youlaughyoulose]\n\nThis is a fun little idea that I decided to bring to life which ended up working\nmuch better than I expected. It is also my first react-js project and I am super\nexcited to continue learning.\n\nThe…",
  "data/reddit-projects/r/SideProject/comments/nvyt6n/my_side_project_will_be_a_100_privacyfocused.json": "Backstory: I don't trust Plaid's privacy policy. At the end of the day, they own\nyour data. So I decided to approach the problem from a different perspective. No\nusernames, no passwords to surrender. You only provide a token from your bank\naccount's API and I take care of the rest. 100% data-owned…",
  "data/reddit-projects/r/SideProject/comments/nwi7ix/launching_my_mobile_app_today_microvist.json": "Hi /r/sideproject, I've been working on my first ever mobile app Microvist and\nam launching it today. I would love extra support on my product hunt page\nhttps://www.producthunt.com/posts/microvist-for-mobile if people would give it a\nlook and upvote if you like it :)\n\nThe apps goal is to be a…",
  "data/reddit-projects/r/SideProject/comments/nx1rm3/i_built_a_tool_to_check_whether_the_emails_you.json": "A friend of mine gave me the idea and we've been working on it together for the\npast 2 months. We finally got it to a place where we're ready to launch, so here\nit is: InboxTarget [https://inboxtarget.com]\n\nYou can sign up and use it for free. The goal is to allow email marketers and\nsalespeople to…",
  "data/reddit-projects/r/SideProject/comments/nyh3fp/first_paying_customer.json": "Small for many, but a great joy for me. Today I received notification from\nGumroad saying there was a sale of the template (NFT Marketplace)\n[https://gum.co/vOiUJ] I released 24 hours ago.\n\nTwo months ago I launched my side project – Launchoice [https://launchoice.com].\nIt's a marketplace of free…",
  "data/reddit-projects/r/SideProject/comments/nyh755/i_created_a_subreddit_where_people_tell_which.json": "I always wanted to both share which tools I wish existed and see what other\npeople want. I created a subreddit r/wishexisted\n[https://www.reddit.com/r/wishexisted/]. I would be very happy if you join and\ngive feedback :). Thank you!",
  "data/reddit-projects/r/SideProject/comments/nyzfsw/impulse_domain_purchase.json": "About a year ago, while I was working on adding an easter egg to our website on\napartmentlist.com [https://apartmentlist.com], I had one of those brilliant(!!)\ndomain idea moments. I'm not gonna tell you where exactly the easter egg is, for\nthose of you who enjoy finding them, but I can tell you…",
  "data/reddit-projects/r/SideProject/comments/nz1yij/i_made_an_app_where_you_can_safely_rent_lend.json": "Spent the past four months working on Rentr.me [https://Rentr.me] !\n\nApp download link: https://apps.apple.com/us/app/rentr-app/id1552998611\n\n\n\nWould appreciate any and all feedback, and if you are located in NYC and have an\nitem to post feel free!",
  "data/reddit-projects/r/SideProject/comments/o1rp9a/i_made_wordpress_dark_mode_plugin.json": "https://i.redd.it/qgiwx89c8s571.gif\n\nAs the dark mode is very trendy and everyone loves to use apps/websites in dark\nmode. So recently, my team developed and launch a new WordPress plugin and\nalready it hits 1000 active installations on wordpress.org. If you are a\nWordPress user then I asked you to…",
  "data/reddit-projects/r/SideProject/comments/o22dah/multiverse_written_by_you_and_ai.json": "Hello, everyone. I am a programmer and also a science fiction enthusiast. From\nchildhood, I am fascinated by the idea of building a real-intelligent machine,\nlike housekeeping-robot Andrew in the movie \"Bicentennial Man\" or SETTLER in\n“Expelled from Paradise (Rakuen Tsuihō)”. After graduating, I…",
  "data/reddit-projects/r/SideProject/comments/o2lnzt/automatic_online_bankroll_management_tracker.json": "There are currently a number of poker software solutions that allow you to do\nthis by logging each session of live or online poker -- I have been working on\nmaking an online bankroll tracker which would automatically collect this session\ndata allowing users to easily track and analyze your poker…",
  "data/reddit-projects/r/SideProject/comments/o3pwjg/better_linktree_link_in_bio_alternative_for.json": "Couple friends and I built a link in bio product to help creators better display\ntheir content, increase conversion, and track analytics across social media\nchannels all on one link.\n\nWould love to get your guys' thoughts: bytesize.me [https://bytesize.me/]\n\nExample: https://bytesize.me/postmalone",
  "data/reddit-projects/r/SideProject/comments/o54iaj/ive_asked_750_startup_founders_how_did_you_come.json": "First, they most commonly say:\n\n\"Solve your own problems. Meaning, live on the edge of tech and see what issues\nyou encounter. Then build a startup to solve it.\"\n\nI agree, and I love that.\n\nBut it's not the whole answer you want. Where do these problems actually come\nfrom?\n\n1) I’ll start by defining…",
  "data/reddit-projects/r/SideProject/comments/o5luoi/i_built_a_streaming_aggregator_to_access_free.json": "https://onestreamtv.com/\n\nHey guys, OneStream TV is a streaming aggregator that allows you to have free\nstreaming access on content on Netflix, Amazon Prime Video, HBO Max, and many\nother streaming services, without subscribing to any service or paying money.\n\nI know what you're thinking: \"Is this…",
  "data/reddit-projects/r/SideProject/comments/o7fodu/my_favorite_resources_for_solo_founders.json": "Hi folks,\n\nI want to introduce an app I've been working on and as a quick \"thank you\" for\nyour time, I'm listing the most valuable resources for solo startup founders I\nfound:\n\n * Product Disrupt [https://productdisrupt.com/] - Curated List of Resources to\n   Learn Product Design\n * ManyPixels…",
  "data/reddit-projects/r/SideProject/comments/o7ioxa/permanent_and_immutable_cloud_storage_for_files.json": "https://preview.redd.it/v4mor8tb4d771.png?width=1891&format=png&auto=webp&s=68a2fd969ee3828cee2cee37302de25baba1c191\n\nHi! I am thrilled to announce that I've launched Forever.so [https://Forever.so]\n- permanent and immutable cloud storage.\n\nIt's a place where you can safely store your precious files…",
  "data/reddit-projects/r/SideProject/comments/o86jnk/an_honest_reflection_on_the_first_two.json": "Ngl, I’m pretty excited to share this reflection with y’all.\n\nPredis.ai was launched just over 2 months ago, and we thought of taking some\ntime off to reflect on the journey, and determine what worked well and what\ndidn’t (we really weren’t prepared for how many things did not work :’))\n\nPredis is…",
  "data/reddit-projects/r/SideProject/comments/o8d3x2/command_line_tool_for_react_applications.json": "Hi, everyone!\nI am happy to share my recent small utility project with you all. It is a\ncommand-line tool that helps developers to automate some obvious tasks like\nscaffolding a new react application and generating a new component. It supports\nboth typescript & javascript templates.\n\nRefer to the…",
  "data/reddit-projects/r/SideProject/comments/o8y90x/my_first_finished_project_reveal_fun_insights.json": "Finally fought my distractions and saw a side project through completion. Using\nGatsbyJS, ReactJS, ChartJS, I created a simple web app that analyzes fun\ninsights from WhatsApp chats into pretty graphs plus sentiment analysis and word\ncloud. No ads, no user registrations/logins, no monetization…",
  "data/reddit-projects/r/SideProject/comments/o973xy/compare_cost_of_living_in_1000_cities_in_the.json": "Hi,\n\nLet me share with you a project I created mostly for fun. I am currently looking\nfor monetization ideas though - so will appreciate your ideas and any feedback\nreally!\n\nI myself have moved to a different country a few times, and likely not the last\ntime in my life. And I've found it quite…",
  "data/reddit-projects/r/SideProject/comments/o9vxit/waterme_plant_care_app_an_app_to_help_you.json": "Hi everyone,\n\nThe early access version of my app is now on the Play Store! It's designed to\nhelp you organize and track your plants and was completed using Flutter/Dart. It\nhas a multitude of features with many more in the pipeline. Would be grateful to\nanyone that checks it out! Happy to receive…",
  "data/reddit-projects/r/SideProject/comments/oa2ypj/aipowered_app_to_make_you_happier_live_on_product.json": "We always see data being well-utilized in businesses, so that our team was\nwondering - why don't we see extensive applications of data in our daily lives?\n\nThat's why we are building lyfe.ltd which we hope will become your personal\nbuddy-interface between you and the mountains of data that you…",
  "data/reddit-projects/r/SideProject/comments/oa68ih/i_have_just_launched_for_the_first_time_on.json": "After months of 12-hour workdays, we finally launched on Product Hunt!\n\nhttps://www.producthunt.com/posts/identid-me\n\nWe all pursue a dream, but achieving it is not an easy task. We have created\nidentid.me to help creatives stand out from the crowd and have the online\nportfolio that really shows…",
  "data/reddit-projects/r/SideProject/comments/oa78w1/after_starring_too_many_github_awesome_repos_i.json": "I tracked 500+ most popular awesome repos, updated daily, for free.\n\nFor browsing awesome repos on Github, I have two pain points, one is that I\ncan't see the latest added items, and the second is that I can't see the star\ncount of the items, so I created trackawesomelist.com and solved my own…",
  "data/reddit-projects/r/SideProject/comments/oab31c/manamoney_manage_your_finances_has_never_been_so.json": "Hi, I invite you to try ManaMoney.me. It's a new money manager provided as a\nfully responsive Web App (and PWA) that I've developed in my spare time.\n\nIn total, the app needed seven months of development to reach the current MVP\nstatus. The app is now ready for the closed beta.\n\nOn the homepage, you…",
  "data/reddit-projects/r/SideProject/comments/oac0vb/i_made_an_app_to_make_people_smile.json": "I recently developed an app that is based around happiness and only showing\npositive news, as well as jokes and cute videos of animals.\n\nEspecially during a time like this where headlines are full of negativity and\nmillions of people struggle with their mental health, I wanted to make an app\nthat…",
  "data/reddit-projects/r/SideProject/comments/oajrh7/my_daily_podcast_about_trying_to_turn_side.json": "A while ago I decided to quit my job and focus 💯 in my side projects in hopes\nto someday make a paycheck and be able to live from them. I am narrating my\njourney in a podcast where I share my conquers and frustrations and interview\nother entrepreneurs in the same situation.\n\nHere is the pilot…",
  "data/reddit-projects/r/SideProject/comments/oau88t/customizable_video_templates_pixiko_are_already.json": "It has been about 2 months since we finalized our 🎬editor to the Evolution\nversion🎬 and reached a completely new level in video creation and editing.\nDuring this period, we received a lot of positive feedback on video effects and\ntext animation, which is used by every 5th user of the service.\n\nBut…",
  "data/reddit-projects/r/SideProject/comments/oaxk6z/weve_built_a_tool_to_turn_hardcoded_strings_into.json": "https://dico.app\n\n18 seconds demo [https://reddit.com/link/oaxk6z/video/2nk1k6yfqe871/player]",
  "data/reddit-projects/r/SideProject/comments/oayq7x/i_taught_myself_how_to_code_so_i_could_build_a.json": "TL;DR: Learnt to code and built CompareDial [https://www.comparedial.com]\n\nWhen I was younger I used to build simple websites with Geocities and Microsoft\nFrontpage. I was more focused with the design aspect of websites rather than\nactual programming - not because I had no interest in programming,…"
}