{
  "data/reddit-projects/r/SideProject/comments/v2fj48/an_automated_assistant_to_increase_cold_email.json": "Hey guys! Every week I post here with a business idea from my newsletter, Daily\nIdea. If you’d like to find more of these ideas, I’ll leave a link to our\narchive at the bottom of this post.\n\nCold emails are a great sales mechanism. It is estimated that over 300 billion\nemails are sent every…",
  "data/reddit-projects/r/SideProject/comments/v2j5ku/a_social_media_platform_where_individuals_can.json": "I wanted to create a social platform that revolves around productivity and self\nimprovement through plans. There’ll be a feature called a “Plan” which will be\nused as a guide to help users accomplish what it is they wish to accomplish.\nIt’ll consist of primary and secondary steps (clicking on a…",
  "data/reddit-projects/r/SideProject/comments/v39g9w/niles_curated_uptodate_code_templates_for_your.json": "Hey, everyone,\n\nAs a freelance developer I think I've kickstarted new projects hundreds of times\nover the past 15 years. I have to say, the process gets old really quick,\nespecially in recent years. Booting up a fresh react project, integrating it\nwith state management and UI libraries du-jour,…",
  "data/reddit-projects/r/SideProject/comments/v4mhbk/i_will_redesign_your_website_for_1.json": "Yes, that's right I will redesign your website for a just a dollar.\n\nWhy am I doing this you ask? I'm trying to build up my design portfolio.\n\n\n\nHere's a website I recently redesigned for reference:\nhttps://astrsk-v2.webflow.io/\n\nhttps://monkedao.webflow.io/\n\n\n\nIf you're interested, pm me!",
  "data/reddit-projects/r/SideProject/comments/v4vvpp/discover_new_songs_on_spotify_faster_add_on.json": "Spotify Recommendations, TikTok songs, DJ sets, AUX road trips with friends and\nthe classic, “Wow, what is that groovy song that’s playing in the cafe right\nnow?” Often, we can easily tell whether we like a song by listening to just a\nshort snippet of it.\n\nSo for class, built an add on to Spotify…",
  "data/reddit-projects/r/SideProject/comments/v52dcd/built_a_web_app_that_takes_kanyes_voice_and_reads.json": "https://yeezus-gbertkim.vercel.app/\n\nHello! I'm a bootcamp coder and built this project to learn TypeScript. I call\non a Bible Api and Uberduck Api to generate audio of bible verses in the voice\nof Kanye. I did have to use a proxy as I was having CORS issues with Vercel and\nUberduck. Also, I…",
  "data/reddit-projects/r/SideProject/comments/v59mc4/cheating_in_marketing_how_whatsapp_reddit_amazon.json": "MARKETING SOMETIMES MEANS CHEATING\n\nAbusing loopholes in the systems for some might be controversial\n\nFor others, they are prime examples of resourcefulness - as long as you don't\nhurt anyone\n\nLet's see how WhatsApp, Reddit, Amazon, Paypal, and Airbnb cheated on their way\nup:\n\n\n\n\n1. WHATSAPP\n\nKoum…",
  "data/reddit-projects/r/SideProject/comments/v592ld/i_just_launched_my_first_ever_info_product_today.json": "https://pascio.gumroad.com/l/0-1kfollowers",
  "data/reddit-projects/r/SideProject/comments/v619lq/a_mobile_app_helping_with_car_maintenance_looking.json": "Hi all,\n\nI'm currently working on a mobile app for individual car owners that is supposed\nto help to keep all car-related appointments / maintenance intervals in mind and\nthat gives automatic reminders when a maintenance is due.\n\nTo gather some user feedback I'm looking for people who are willing…",
  "data/reddit-projects/r/SideProject/comments/v7y1nc/i_built_a_free_property_management_saas_for.json": "Hello folks\n\nI have built a free SaaS for property managers and landlords to help them manage\nand keep track of their properties, leases and expenses, furthermore Invoices\ncan be generated and get notifications via mobile phone (Yes we have a mobile\napp too), email or WhatsApp on critical dates…",
  "data/reddit-projects/r/SideProject/comments/v8h6jl/together_with_my_girlfriend_weve_created_an_app.json": "Hi everyone,\n\nWe’ve built Couple Joy, an iOS app\n[https://apps.apple.com/us/app/couple-joy-journal-memories/id1624758651] where\nwe can add our memories with date & location and beautifuly visualize them. Our\nphones’ gallery is usually very full of photos of our cat 😅, random stuff and\nscreenshots…",
  "data/reddit-projects/r/SideProject/comments/v8ioo4/polltimeme_find_when_everyone_you_want_to_meet.json": "https://www.producthunt.com/posts/polltime-me\n\nHey everyone! I wanted to share this free to use project I've been working on\nover the past few weekends called PollTime.me (please excuse the fact the name\nsounds like an exotic dancer request app!) So PollTime came from a place of\nnecessity for…"
}