{
  "data/reddit-changemyview/r/changemyview/comments/pyzxpq/cmv_people_who_cheat_regardless_of_the.json": "I feel important to first preface that I have never personally been cheated on\nmyself.\n\nI just don’t understand why people don’t have the courtesy to simply tell\nsomeone it’s not working out, or end things before they move on to other\nrelationships. It makes sense to me that that would be…",
  "data/reddit-changemyview/r/changemyview/comments/pz8lzw/cmv_gangbangs_are_gay.json": "Why do rappers sing about being a gang banger in their song when in reality gang\nbangs are actually super gay, think about it, its 1 girl with like 13 naked men\nall jacking off around her waiting their turn. Most the time spent by the guys\nis gonna be Jacking off next to another naked man and unless…",
  "data/reddit-changemyview/r/changemyview/comments/pzacfc/cmv_i_am_not_smartknowledgeable_enough_to_have.json": "Using politics as an example. Most people want to be on the side of justice,\nequality, etc., and very few people (I hope) believe that things like racism are\nok opinions to have. I am obviously in the camp of “racism is bad”, which to\nmost means that I should agree with the political left. However,…",
  "data/reddit-changemyview/r/changemyview/comments/pzfkoc/cmv_reddit_should_have_an_unseen_option_when.json": "I’m not sure if anyone even will want to change my view or if everyone thinks\nit’s actually a good idea, but I think Reddit should have an option to filter\nposts by what the user hasn’t yet seen.\n\nThis would be great because there are usually tons of posts that have been\nunread but you would have to…",
  "data/reddit-changemyview/r/changemyview/comments/pzs8vd/cmv_as_long_as_men_arent_encouraged_as_much_to.json": "I think the argument is quite simple. We as a society encourage behavior and\npersonality traits in other people that we consider virtuous and beneficial for\nsociety. So what we did in the last decades was to encourage women to adopt many\naspects of the traditional stereotypical male role like having…",
  "data/reddit-changemyview/r/changemyview/comments/pzwen8/cmv_comunism_is_an_unreacheable_utopia.json": "I have been interested in the topic for years and I have disscuss and debated it\nwith several activist and members of various socialists organizations, through\nall of it and their different perspectives one thing remain for me and that is\nthe fact that the society they are claiming to be aiming for…",
  "data/reddit-changemyview/r/changemyview/comments/pzx7ri/cmvtwoxchromosomes_should_not_be_on_the_front_page.json": "(My argument also applies to other identity based echochambers, this is just the\nonly one I know on the front page)\n\nTwoxchromosomes is a place for women and women identifying people. I dont agree\nbut some people think its important for them to share their experiences in a\n\"safe space\", and yes,…",
  "data/reddit-changemyview/r/changemyview/comments/pzykgu/cmv_our_modern_day_laws_should_never_be_based_on.json": "The Bible is a moral guide for some but it is completely irrelevant when it\ncomes to modern day laws. The Bible encourages rape, genocide, slavery, murder\nand human sacrifice. I really don’t want any of those horrible things to be\nlegal and encouraged like the Bible commands\n\nThankfully we have…",
  "data/reddit-changemyview/r/changemyview/comments/q02gbi/cmv_people_broadly_agree_on_who_is_good_looking.json": "This is my personal view and I think it’s backed up by a lot of personal\nexperience, but I realize that anecdotes are not reliable evidence so I found\nsome actual scientific data. In the review article I have linked below,\nresearchers establish with 11 meta-analyses that contrary to what people…",
  "data/reddit-changemyview/r/changemyview/comments/q04hhe/cmv_white_americans_who_say_that_white_south.json": "I am a 18 year old white male from South Africa. I cannot even remember how many\ntimes white americans online have said to me: You are not from Africa, you are\njust the descendant of evil colonists who killed and enslaved the native\npopulation, go back to Europe. Really? Tell me, american, why dont…",
  "data/reddit-changemyview/r/changemyview/comments/q08va3/cmv_lawsrules_that_have_a_religious_exemption_are.json": "This is nothing against religions, but more about pointless laws or rules that\nare in place. If there’s a rule in place but a religious exemption to get around\nit, clearly the rule isn’t that important in the first place and probably\nshouldn’t apply to anyone. If the rule truly is that important,…",
  "data/reddit-changemyview/r/changemyview/comments/q0byi6/cmv_the_idea_that_men_should_pay_for_everything.json": "What is the point of a first date? It’s a time for 2 people to meet up together\nand hopefully have a good time which will lead to a second date (or hookup if\nthat’s your thing). Generally speaking the date is planned around something both\npeople will enjoy. Whether it’s a bad time or a good time…",
  "data/reddit-changemyview/r/changemyview/comments/q0cusk/cmv_euthanasia_or_assisted_suicide_should_be.json": "Similarly to my view about antinatalism, I came to this conclusion because I've\nseen many people suffer and thought that this would be a viable option for\nending their suffering. I simply think that people should be allowed the right\nto die on their own terms. Why should we force other people to…",
  "data/reddit-changemyview/r/changemyview/comments/q0gi49/cmv_too_many_people_blame_their_crappy_behaviour.json": "I have a few mates who I know suffer with these problems, but it seems like\nwhenever their behaviour is poor they blame it on their mental illness.\n\nI understand cutting people some slack, but there also comes a point when one\nneeds to take responsibility.\n\nExamples: - not turning up at an agreed…",
  "data/reddit-changemyview/r/changemyview/comments/q0iekr/cmv_homemakers_are_the_most_under_appreciated.json": "I can’t say for other countries because I don’t have enough first hand\nexperience, however, at least in my life it seems that the people who never get\nacknowledged for how much they legitimately contribute to their families and\ncommunities are the homemakers.\n\nOften times it seems it is their…",
  "data/reddit-changemyview/r/changemyview/comments/q0jx0l/cmv_polyamory_is_just_promiscuity_and_the_is.json": "I’m skeptical about the idea of open relations. People say it selfless but I\ndisagree the idea of committing yourself to one person is quintessential to\nlove. It just feels like people are trying to eat there cake and have it to. I’m\nnot just talking about jealousy, if you love someone doesn’t that…",
  "data/reddit-changemyview/r/changemyview/comments/q0pjd1/cmv_prostitution_should_be_fully_legal.json": "The crux of my view is:\n\n-Anti-prostitution laws are non-sensical: It is legal (and widespread) to have\nsex with a consenting adult. It is legal (and widespread) to sell services. But\nit is illegal to sell sexual services. The same applies to places where is\nillegal to buy but not sell sexual…",
  "data/reddit-changemyview/r/changemyview/comments/q0suxa/cmv_marijuana_is_safer_and_less_physically_and.json": "Id like to preface this by saying I am not trying to convince anyone that weed\nis completely harmless, or that you should start smoking. All I am trying to say\nis that it's safer than alcohol.\n\n1: Addictiveness and withdrawals\n\nMarijuana is less addictive than alcohol. I'm not saying that it is…",
  "data/reddit-changemyview/r/changemyview/comments/q0ty77/cmv_braids_are_not_cultural_appropriation.json": "Braids\n[https://www.byrdie.com/history-of-braids#:%7E:text=In%20relation%20to%20time%20periods,braid%20from%201644%20to%201912%3B]\nare not cultural appropriation. They have been used for 5500 years and have been\nworn by almost every culture.\n\nModern cornrows originated in the Caribbean in the…",
  "data/reddit-changemyview/r/changemyview/comments/q0wwzc/cmv_cultural_appropriation_at_least_as_its_used.json": "Okay so heres a little story from australia. Happened a number of years ago but\nif you do some googling you can find this story. We had a disney princess event\na few years ago. All fairly innocent, little girls all lined up dressed as their\nfavorite princess. In attendance was a little aboriginal…",
  "data/reddit-changemyview/r/changemyview/comments/q11gmh/cmv_we_should_use_minority_deprivation_rather.json": "Hello Hivemimd,\n\nHope you've all been having good days so far.\n\nI think Minority deprivation is a better term for what is now commonly referred\nto as 'White privilege' when discussing race, especially racial\noppression/discrimination, or for campaigns talking about racial issues. This is\nfor a few…",
  "data/reddit-changemyview/r/changemyview/comments/q127jk/cmv_i_think_the_nonbinary_gender_identity_is.json": "Just to start I want to say that I completely accept everyone and respect what\npronouns anybody wants to be referred to as. I keep my thoughts on this to\nmyself, but think maybe I just don’t understand it fully.\n\nI am a female who sometimes dresses quite masculine and on rare occasion will\ndress…",
  "data/reddit-changemyview/r/changemyview/comments/q13owi/cmv_there_are_no_rules_in_standup_comedy_so.json": "Too often I see comedians get into trouble for saying something that is funny\nbut is perhaps a little or very racist or sexist. \"you can't punch down\",\ncritics will often say. Sometimes they say something sexist or racist and it\nisn't funny, and then they will definitely get a lot of backlash.\n\nI…",
  "data/reddit-changemyview/r/changemyview/comments/q1656h/cmv_separated_parents_who_share_5050_custody_are.json": "I’ve seen people mention they are single parents, but then I find out they have\n50/50 custody with their ex spouse/partner. It’s just seems strange to me, as\nsomeone who knows literal parents that are “single” in the sense they have %100\nresponsibilities due to the death or complete neglect of their…",
  "data/reddit-changemyview/r/changemyview/comments/q195qo/cmv_most_drag_shows_are_offensive.json": "So, this is a tough view for me since drag shows and such are a large part of\nqueer culture and I myself am a very liberal butch lesbian.\n\nLet me start by saying I have no problem with people who identify as male (or\nany gender) dressing in \"feminine\" clothing or wearing makeup or presenting in…",
  "data/reddit-changemyview/r/changemyview/comments/q1d0i2/cmv_pronouns_are_great_but_the_over_the_top.json": "So pronouns are great, and I think workplaces, and schools, etc asking the\npeople what their pronouns are, is also great.\n\n * He/Him\n   \n * She/Her\n   \n * They/Them\n   \n * Xe/xem\n\nHowever, recently there has been an uptick in people, mainly younger persons,\ngoing by Bug/Bugself, God/Godself,…",
  "data/reddit-changemyview/r/changemyview/comments/q1m26k/cmv_a_decentralized_monetary_system_is_inherently.json": "When I say decentralized finance I am specifically talking about removing banks\nand thus also central banks from the equation which would make it that we\ntheoretically lend to each other with no middle man and no lender of last\nresort, this would also make it that a central entity wouldn't have…",
  "data/reddit-changemyview/r/changemyview/comments/q1ots3/cmv_fat_acceptance_does_absolutely_nothing_and.json": "I’m open to my mind being changed as maybe I’m missing something.\n\nBefore I begin, let me rule out the obvious here. People who are medically\nunable to lose weight or anything that makes them considered obese are\nexceptions to this, because obviously, they are unable to physically do anything\nabout…",
  "data/reddit-changemyview/r/changemyview/comments/q1vafo/cmv_breaking_news_should_be_forbreaking_news.json": "This morning I wake up and I see breaking news so of course I stop to\nwatch...only for it to be about how Facebook was down.\n\nFirst of all this shouldn’t have gotten nearly as much air time as it did. If\nFacebook going down for half a day had that much of an impact on your life and\nyou weren’t an…",
  "data/reddit-changemyview/r/changemyview/comments/q1wrhd/cmv_its_not_just_that_the_minimum_wage_is_too_low.json": "Don’t get me wrong: Everybody should be able to live off of what they can earn\nfrom a week’s work. If a company can’t survive by paying people properly for\ntheir time, it shouldn’t survive at all. HOWEVER… Just focusing on the\ndollar-amount of the minimum wage draws attention away from the fact…",
  "data/reddit-changemyview/r/changemyview/comments/q2ay4e/cmv_atheism_isnt_a_religion_and_it_should_never.json": "Atheism isn’t a religion and shouldn’t be lumped into the same category as one.\nBy definition atheism is “the lack of belief in a God”. Atheism doesn’t resemble\norganized religion in any way and there are no collective goals it seems.\nChristians often try to incorrectly categorize it as a religion…",
  "data/reddit-changemyview/r/changemyview/comments/q2b9t0/cmv_as_a_constituent_of_a_corrupt_government_i.json": "I see a lot of people in Western countries getting angry over people not paying\ntheir fair share of taxes and all that. Now I don’t know how it is in America,\nbut where I come from (the Philippines), I sure as hell do not trust my\ngovernment to use my tax money wisely.\n\nIn my country, politicians…",
  "data/reddit-changemyview/r/changemyview/comments/q2j9me/cmv_joel_osteen_is_a_piece_of_garbage.json": "People defend him because he gets his money from book sales instead of the\noffering plate. He says God wants to see him rich because he is loved and God is\nlooking out for him. So never mind the thousands who could benefit from being\ndonated too, he’s God’s special person and you can be too. You can…",
  "data/reddit-changemyview/r/changemyview/comments/q2ph3q/cmv_rather_than_criticizingaiming_their_anger_at.json": "Particularly on Reddit, I tend to see a lot of vitriol directed at landlords. I\nthink part of this has to do with Covid-related eviction stays and a concern\nabout what people are doing as these stays expire. However, people talk about\nlandlords -- even just mom-and-pop type landlords who are renting…",
  "data/reddit-changemyview/r/changemyview/comments/q2so2h/cmv_i_have_no_faith_in_humanity_after_how_people.json": "Anti-vaxxers, anti-maskers, the conspiracy theorists calling the entire pandemic\na hoax - I'm just continually floored by these people. Their subbornness,\nstupidity and selfishness are at levels I used to think were impossible on this\nscale. At every stage of the pandemic, they've found new lows to…",
  "data/reddit-changemyview/r/changemyview/comments/q2w16l/cmv_the_symmetrical_analog_stick_placement_on.json": "I very much believe that PlayStation got the controller right and that the Xbox\ncontroller’s analog stick placement makes it a worse controller. There are a lot\nof reasons that I feel this way, but I’m curious if anybody can change my view.\n\nI tend to play shooter games, so a big point for me is…",
  "data/reddit-changemyview/r/changemyview/comments/q2ytv3/cmv_police_should_have_to_pass_a_physical_as_well.json": "I’ll keep this short because I think it speaks for itself. We have officers in\nhigh stress situations that are taxing on the heart, they’re usually hauling\naround at least 10 pounds of gear, as well as having to perform foot chases,\netc. I think it benefits both officers and the public alike if…",
  "data/reddit-changemyview/r/changemyview/comments/q31et8/cmv_telling_little_boys_to_toughen_up_or_put_some.json": "You don't need to cry over every somewhat painful injury. I've seen grown women\ncry over injuries that aren't even that bad, they may leave a bruise but that's\nabout it. Learn to fucking deal with the pain like how a lot of boys are taught.\n\nIt's not toxic masculinity teaching boys to not cry over…",
  "data/reddit-changemyview/r/changemyview/comments/q31yaf/cmv_nuclear_power_should_replace_fossil_fuels.json": "the reason that fossil fuels are still a problem is because we're not using the\nproper methods to create cleaner energy. don't be mistaken, i support wind,\nsolar and hydro, but all of those methods of energy creation either affect the\nenvironment in ways other than global warming, or don't produce…",
  "data/reddit-changemyview/r/changemyview/comments/q36bi3/cmv_body_positivity_has_the_wrong_message.json": "I believe people who have a BMI out of the healthy range which pose risks to\ntheir physical health: Increased risk of heart disease/diabetes/organ failure\netc... are told phrases such as \"Be proud of your figure\" as a way to comfort\ntheir mental health, which I believe is a risk of making people…",
  "data/reddit-changemyview/r/changemyview/comments/q3a56h/cmv_the_minneapolis_police_department_is_depraved.json": "The more I learn about the Minneapolis police, the more I’m disgusted about\nthem. These officers hunted peaceful people like animals, fist bumping and\ncursing after hitting people. They fired from unmarked cars and are surprised\nthat people fired back thinking they were being hit with a drive-by…",
  "data/reddit-changemyview/r/changemyview/comments/q3f5gl/cmv_having_a_cat_or_a_dog_as_a_pet_in_a_city.json": "I understand that there are benefits on both sides. Pets make people happy, they\nmake them feel less lonely and are sometimes their best or only companion in\nlife. Also for the pet, coming from a shelter to a home is like hitting the\njackpot.\n\nNevertheless, I feel like a cat cannot be happy living…",
  "data/reddit-changemyview/r/changemyview/comments/q3fiso/cmv_the_facebook_whistleblower_is_doing_exactly.json": "On Tuesday, Facebook \"whistleblower\" Frances Haugen testified before Congress\n[https://www.nytimes.com/live/2021/10/05/technology/facebook-whistleblower-frances-haugen]\nand called for the regulation of Facebook.\n\nMore government regulation of the internet and of social media is good for\nFacebook and…",
  "data/reddit-changemyview/r/changemyview/comments/q3jokk/cmv_choosing_to_not_shave_your_head_completely.json": "There's this common refrain that once you start showing signs of balding, not\nshaving your hair off is somehow pathetic and vain. Like you're trying to cling\non to your youthfulness/virility/whatever and failing miserably or embarrassing\nyourself. That the only 'dignified' thing to do is to resign…",
  "data/reddit-changemyview/r/changemyview/comments/q3n1ah/cmv_its_crazier_not_to_believe_in_aliens_than_to.json": "Just watched this video:\nhttps://www.reddit.com/r/oddlyterrifying/comments/q37xrc/how_big_this_universe_really_is/?utm_source=share&utm_medium=ios_app&utm_name=iossmf\n\nThere’s about 8.7 million species on earth alone. Humans make up exactly one of\nthose. Its crazy to think that out of the billions…",
  "data/reddit-changemyview/r/changemyview/comments/q3n41l/cmv_neopronouns_like_xey_zir_and_xe_have_no.json": "Now before I state my reasoning on why I think this, I have non-binary friends\nwho I've talked to and asked them what this means and the importance of it, I\ndidn't watch a Ben Shapiro owns liberal vid and base my argument on that.\n\n\n\nThe definition of neo pronouns are a category of new (neo)…",
  "data/reddit-changemyview/r/changemyview/comments/q3ov4r/cmv_computer_games_now_have_better_music_than.json": "When I was younger I remember going to the movies and being stunned by the\nquality of the score. I went so far as to buy soundtracks to listen to. Who does\nnot feel a tingle down their spine on hearing \"The Imperial March\", that is\nmusic that stands the test of time. Every movie (well not quite) had…",
  "data/reddit-changemyview/r/changemyview/comments/q3ovat/cmv_adding_phobic_to_the_end_of_a_statement_does.json": "Merely adding the term “phobic” to the end of a sentence dismisses the other\nperson’s perspective and automatically causes you to assume you are in the\nright, which does not allow for open discussion.\n\nNow, some of you may say, “What if that person is hating toward the LGBTQ\ncommunity in an…",
  "data/reddit-changemyview/r/changemyview/comments/q3r2p3/cmv_military_shouldnt_be_able_to_recruit_in.json": "You shouldn’t be able to walk into a classroom, look into the eyes of someone\nwho is not an adult, promise them a future, and turn them into a stone cold\nkiller.\n\nThey are not understanding of the gravity of the role they are taking on and how\nit will impact their life. If an adult entices a child…",
  "data/reddit-changemyview/r/changemyview/comments/q3tavn/cmv_average_service_should_receive_3_stars_on_5.json": "First I personally don't put much trust on crowd sourced reviews unless criteria\nare outlined clearly. If site or survey don't state what 3 stars means in\ncomparison to 4 stars then the whole system is bit sketchy. But in my view 3 is\naverage (because it is in the middle) and half of establishments…",
  "data/reddit-changemyview/r/changemyview/comments/q3xkm4/cmv_the_tv_series_the_wire_champions_conservative.json": "fyi: some spoilers within (tho for a show that is more than a decade old)\n\n\n\nif you're a fan of the hbo series, the wire, at first glance you may think it is\nshow that illustrates more neutral to liberal ideas. many ppl will point out the\nfailures of the police or how some working within the drug…",
  "data/reddit-changemyview/r/changemyview/comments/q3ze9m/cmv_the_root_cause_for_cosmetic_surgery_is_fear.json": "I have been arguing with my family and friends about this for a while now. Their\nargument is that if there is something that annoys you about your appearance\nthat can be changed, you should just change it.\n\nTo this I say, why should it annoy you? You should be happy as your self-worth\nshould be…",
  "data/reddit-changemyview/r/changemyview/comments/q3zi3k/cmv_if_a_news_headline_quotes_someone_stating.json": "Basically, my view is that the word \"said\" is the most neutral word to use in\nthis situation. Other words carry certain implications, and thus are more likely\nto be misleading. Consider the following three hypothetical headlines:\n\n\"Government insider claims policy X has been a failure\"\n\n\"Government…",
  "data/reddit-changemyview/r/changemyview/comments/q48hb1/cmv_toothpaste_squeezers_are_a_waste_of_money.json": "I am referring to this type of product.\n[https://www.amazon.com/dp/B084KHHF5F/ref=cm_sw_r_oth_api_glt_fabc_225C9YW97R2VBJ149QD3?_encoding=UTF8&psc=1]\nI believe these are a waste of money.\n\nMy wife go through a tube of toothpaste every 2 or 3 months, but I’ll be\ngenerous for this example and estimate…",
  "data/reddit-changemyview/r/changemyview/comments/q4cjw6/cmv_rhode_island_should_be_absorbed_into.json": "Aside from historical concerns, there is no longer a good reason for Rhode\nIsland to be its own state. Instead, Little Rhody should be split up, with the\nwestern mainland area being annexed by Connecticut and everything east of\nNarragansett Bay becoming part of Massachusetts. While this is a good…",
  "data/reddit-changemyview/r/changemyview/comments/q4e829/cmv_calling_a_black_person_whitewashed_is_racist.json": "(If this has already been discussed please link it😁)\n\nSo I've been on tiktok a lot and there will be a video with a black person\ntalking \"proper\", basically not AAVE, and there will be hundreds of comments\ncalling them whitewashed and asking if they've been \"picked\" by the whites yet.\nThey also…",
  "data/reddit-changemyview/r/changemyview/comments/q4hi1c/cmv_social_media_companies_tracking_storing_or.json": "\"but you agreed to in in the ToS\" shut up. They shouldn't be able to put that in\nthe ToS\n\n\"But they're a private company and should be able to do what ever they want\"\nshut up. Nestle, ENRON, BP and Monsanto are private companies who were allowed\nto do whatever they want; just look how that ended…",
  "data/reddit-changemyview/r/changemyview/comments/q4p4lz/cmv_the_play_hamilton_encourages.json": "As a history buff, a BA historian, and recently, a history teacher, I've long\nhad my gripes with how the general public views a number of historical events,\nas well as history as a whole. That's why I decided I wanted to teach it. I want\nto encourage passionate and nuanced understanding of history…",
  "data/reddit-changemyview/r/changemyview/comments/q4pla8/cmv_single_issue_evangelical_antiabortion_voters.json": "I’ve had a few conversations with evangelical family members and I often ask why\nthey are so stringent and hard lined on a few faith-braised political stances,\nwhile willing to let so many others go? Like blood sacrifices aren’t such a huge\npart of life, and why can we eat shellfish or mix fabrics…",
  "data/reddit-changemyview/r/changemyview/comments/q4r1f1/cmv_society_needs_to_get_back_to_ignoring_speech.json": "There are exceptions to this and that is if they are in a position of power and\nauthority and their speech indicated they are negatively impacting groups of\npeople in their lives due to being the owner of a business, a politician, or a\nperson of legal authority.\n\nWith in that exception it needs to…",
  "data/reddit-changemyview/r/changemyview/comments/q4s63v/cmv_hating_on_people_who_take_refuse_the_covid19.json": "Especially online I've noticed it's become very accepted to refer to people who\nrefuse the vaccine as \"idiots\", \"deliberately selfish\", or even going as far as\ntoo make light of, or even act as if it's good when these people get sick and\ndie.\n\nThis is an unprecedented rejection of modern medicine in…",
  "data/reddit-changemyview/r/changemyview/comments/q5159q/cmv_dave_chappelle_was_not_being_transphobic.json": "First let me say that i not 100% sure if i agree with the affirmation in the\ntitle that's why i came here to talk to you guys, so i can form a better\nunderstanding and opinion about the situation. For a little bit of context, i\ntalked about the controversy with my therapist, (i think its important…",
  "data/reddit-changemyview/r/changemyview/comments/q54j0l/cmv_everyone_should_make_good_money_not_just.json": "Every worker provides a service to society. People say “why should whopper\nflippers make good money? They don’t deserve it”. I disagree with that. They’re\nmaking food that we all like to eat. Come on. Who doesn’t like a good whopper?\nIt’s almost as if people who say this are implying that unskilled…",
  "data/reddit-changemyview/r/changemyview/comments/q5d6q8/cmv_pizza_makers_should_spend_extra_time_to_make.json": "At first, this seems like a CMV with no opposing side. But considering how many\npizzas that I've eaten in my life and how many have unevenly spread out\ntoppings, I believe this CMV is needed. I'm talking about all the pizzas. Full\npies from a pizza shop, frozen pizza, personal pies. Having an empty…",
  "data/reddit-changemyview/r/changemyview/comments/q5e0jr/cmv_in_self_defense_the_defender_should_have.json": "To be clear, I'm only talking about cases where the threat is still active. If\nsomeone's running away you obviously shouldn't be able to shoot them in the\nback. But if someone punches you and is still an active threat to you, you\nshould be able to stab/shoot them to neutralize them. A punch can…",
  "data/reddit-changemyview/r/changemyview/comments/q5eg52/cmv_sometimes_i_feel_like_people_from_usa_wants.json": "Why is that people love to refer themselves as African American, Italians,\nAsians, native Americans... anything but their main culture? As an European I\nfind it very weird when people from the states discuss online about racism and\ncall themselves japanese just because their parents are japanese,…",
  "data/reddit-changemyview/r/changemyview/comments/q5hmnu/cmv_the_slavery_in_the_old_testament_is.json": "I was a Christian for 25+ years (currently Agnostic). During my Christian years,\nmy view on slavery in the Old Testament was basically, \"social norms were\ndifferent back then and God was trying to work with what he had.\"\n\nThis is a terrible excuse because a divine author of morality shouldn't…",
  "data/reddit-changemyview/r/changemyview/comments/q5ift8/cmv_the_current_political_climate_us_is_mostly_a.json": "There are obviously actual differences in what people believe to be the \"right\"\npolicies. However, much of this is exaggerated and exacerbated by the creation\nof echo chambers, which in turn are wielded by media and others in power to\nincrease their influence and income as applicable.\n\nThere are…",
  "data/reddit-changemyview/r/changemyview/comments/q5nf40/cmv_following_the_rules_of_the_road_when_driving.json": "When I say “courteous” I don’t mean me turning on my left blinker and the car\nbehind me and to the left slows down a bit so I can get over. I appreciate\nthings like that. Im referring to people who throw all traffic laws out the\nwindow and as a result, become very unpredictable. Here’s some…",
  "data/reddit-changemyview/r/changemyview/comments/q5ov6d/cmv_giving_reddit_awards_to_celebrities_or_large.json": "People giving awards to celebrities or large and well-known companies is a waste\nof the award and the money. For instance take a look here:\n\nhttps://www.reddit.com/user/RobinhoodTeam/\n\nThis account belongs to Robinhood/ the COO of Robinhood. She received tons of\nawards including gold on many…",
  "data/reddit-changemyview/r/changemyview/comments/q5pwyn/cmv_fahrenheit_is_less_usefull_than_celcius.json": "The most often argument I hear in favour of Fahrenheit is the base of the system\nwhich means 0 = really cold and 100 = really hot. This is definitely a system\nthat could be used from a day to day basis and if your used to it you know how\nthe weather behaves.\n\nHowever often 0-100 example is…",
  "data/reddit-changemyview/r/changemyview/comments/q5px8l/cmv_the_use_of_the_word_depressed_as_an_adjective.json": "I want to keep this short and sweet as opposed to a long post. Of course, I know\nthis won’t guarantee much of anything, but I still feel that, at least from the\nbottom of my heart, I still want to see some discourse on this matter.\n\nRecently, there has been a crackdown on the use of terms such as…",
  "data/reddit-changemyview/r/changemyview/comments/q5wch8/cmv_i_am_happy_to_see_that_seeking_therapy_is.json": "This is just something that I have come to observe. Now, it might have something\nto do with me and whom I choose to surround myself around, but it feels like\nmore people are beginning to throw the \"have you considered therapy\" line as a\nway of shutting others up. They don't really want to hear about…",
  "data/reddit-changemyview/r/changemyview/comments/q5wx18/cmv_it_makes_more_sense_logically_to_join_the.json": "The Reddit community enjoys downing the military and says troops are “stupid”\nbut I think it actually makes more sense logically to join the military at 18\nthan to go to college and here’s why.\n\nCollege: Pros: You have more choice on where you go if you can get into a school\nthere. You have more…",
  "data/reddit-changemyview/r/changemyview/comments/q5xda8/cmv_it_should_be_socially_acceptable_for_men_to.json": "I can't think of anything, I've really tried and I just want to know what people\nthink? I'm really looking here. If we are all for equality in today's society\nthen you shouldn't be unaccepting of men wearing women's clothes when women wear\nmen's clothes all the time and no one gives a fuck. My…",
  "data/reddit-changemyview/r/changemyview/comments/q5y5zu/cmv_china_is_basically_the_same_if_not_worse_than.json": "First of all and most obviously they are committing a genocide of a minority\npopulation, sure it's not at shove as many people into the gas chamber level of\ngenocide yet but neither was pre-war nazi Germany. China is systematically\ndestroying every single culture and people's that aren't fully…",
  "data/reddit-changemyview/r/changemyview/comments/q5zf9m/cmv_you_should_not_use_reddit_as_a_primary_source.json": "I was inspired by this thread here\n[https://old.reddit.com/r/changemyview/comments/q5xsnt/cmv_i_should_get_the_covid19_booster_even_though/].\nTL;DR A redditor was asking to have their view changed on getting a COVID\nvaccine booster even though they are not eligible nor authorized to get it.…",
  "data/reddit-changemyview/r/changemyview/comments/q6186e/cmv_traffic_laws_should_be_enforced_by_an_unarmed.json": "Having police officers enforce traffic laws is an inefficient use of resources\nand creates unnecessarily dangerous situations for both the public and the\npolice officers. Police have so many difficult jobs to do and taking traffic\nenforcement off the list would allow them to focus and get better at…",
  "data/reddit-changemyview/r/changemyview/comments/q621lb/cmv_unless_you_are_an_elite_or_personally_profit.json": "Julian Assange is currently sitting in Belmarsh Prison in the UK, awaiting a\ndecision on the US government's appeal of the lower court's decision not to\nextradite him to the US to…",
  "data/reddit-changemyview/r/changemyview/comments/q68itd/cmv_the_catholic_church_is_the_oldest_running_and.json": "France is the latest jurisdiction in which the Catholic Church has been outed\nfor historic abuses of children.\n\nIt’s apparent that paedophiles are attracted to opportunities where they can\ninfiltrate and gain trust to groom and abuse. I admit that’s not restricted to\nthe Catholic Church, nor solely…",
  "data/reddit-changemyview/r/changemyview/comments/q6amx0/cmv_trickle_down_economics_does_not_work_and_the.json": "I’m old. Most of my life trickle down economics have been in place. Give major\ntax cuts to the big businesses, it will keep them in the US and it’ll eventually\nreach the little man. In my experience, that doesn’t happen. The wealth has been\nkept at the top with a major tax disproportion. Cost of…",
  "data/reddit-changemyview/r/changemyview/comments/q6cc4v/cmv_neo_pronouns_are_useless.json": "Of course I'm pro lgbtq and all that, but I never understood the point of making\nup words and calling them pronouns (like xe/xem for example). I can't even\nunderstand what those pronouns refere to, or how you could identify as something\nyou just made up. Like, even if you made up your own gender,…",
  "data/reddit-changemyview/r/changemyview/comments/q6i01j/cmv_wandavision_romanticized_wanda_and_her.json": "If I had a traumatic life and then a loss of a loved one caused me to snap and\nkidnap a bunch of people I would been sniped on the spot and considered a\ncriminal yet this is literally what Wanda did in Wandavision.\n\nA psychotic episode doesn't make anyone inherently criminal, fine. Things got…",
  "data/reddit-changemyview/r/changemyview/comments/q6kua0/cmv_all_drugs_should_be_fully_legalized_including.json": "I believe all drugs (yes, ALL drugs) should immediately be legalized and we\nshould create legal, regulated, and taxed markets for people to sell them on.\n\n> But then people will be able to try drugs whenever they want! Overdoses will\n> go through the roof!\n\nIf people want to try drugs, I am not…",
  "data/reddit-changemyview/r/changemyview/comments/q6mvsu/cmv_gender_doesnt_change_throughout_the_day.json": "https://www.ravishly.com/im-genderfluid\n\nI believed \"genderfluid\" to mean that someone was exploring gender, not that\nthey felt and wanted to be referred to as different genders throughout the day.\n\n\"Throughout a single day, I will most likely fluctuate between masculine to\nandrogynous to feminine…",
  "data/reddit-changemyview/r/changemyview/comments/q6n2bf/cmv_there_is_no_mental_health_epidemic_were_just.json": "A lot has been said of the 'mental health epidemic\" that is going on with the\nyouth of today, but I would argue that this is nothing new. We are finally\nbecoming aware of mental health issues and accepting it for what it is. In\nprevious generations, people didn't go to therapy, it was perceived as…",
  "data/reddit-changemyview/r/changemyview/comments/q6omck/cmv_saying_that_you_cannot_be_racist_towards_a.json": "Whilst I understand the logic behind the sentiment, the 'racism = power +\nprivilege', the arguement falls apart when you zoom out and attempt to\ncomprehend the scope of the prejudice and discrimination that happens all over\nthe world on a daily basis.\n\nI have been spat on in the streets of Tunisia…",
  "data/reddit-changemyview/r/changemyview/comments/q6sasp/cmv_the_believesurvivors_movement_is_too_extreme.json": "[EDIT] I've reached the conclusion that I'm simply reading into the slogan more\nliterally than I ought to. I tend to take things quite literally, and the\n\"BelieveSurvivors\" slogan makes me think we should take their word as 100%\nabsolute truth, when this simply isn't the case. Thanks for changing my…",
  "data/reddit-changemyview/r/changemyview/comments/q6y1wj/cmv_the_movement_toward_canceling_people_for.json": "Getting people fired from their jobs or removed from volunteer posts, etc. for\nsaying or writing things that are offensive to groups of people doesn't teach a\nworthy lesson; it teaches people that if you offend with your\nthoughts/jokes/words via speech or written word, you are going to…",
  "data/reddit-changemyview/r/changemyview/comments/q71f8c/cmv_communism_is_a_fundamentally_unworkable.json": "To start with, I am defining communism as an economic system where all property\nis publicly owned, and resources are given to citizens to fulfill their needs,\nas described by Marx.\n\nThis system, however, has a number of fundamental flaws that are inherent to it\nand cannot be escaped.\n\nIts largest…",
  "data/reddit-changemyview/r/changemyview/comments/q742hc/cmv_we_should_defund_the_atf.json": "Give the ATF a budget of $0.00. they have systematically proven that they are\nthe most incompetent and corrupt federal law enforcement agency. Waco, Ruby\nridge, their gun running scandal. That's only the surface. They have one of the\nmost ass backwards corrupt and utterly insane histories of any law…",
  "data/reddit-changemyview/r/changemyview/comments/q75f3f/cmv_the_subreddit_twoxchromosomes_is_one_of_the.json": "A huge portion of the posts there are sexist towards men; they are generalizing\nto the extreme, and often writing how men are e.g., rapists, bad at every\npossible task, do not understand social cues, etcetera. It is authoritarian as\nheck too -- if you try to have a critical and civil conversation…",
  "data/reddit-changemyview/r/changemyview/comments/q7bgco/cmv_the_uswnt_has_no_clothes.json": "A new movie paid for and produced by CNN is coming out and capping a few years\nof heavy media coverage of the US women's soccer party structure.\n\nConsistently they have claimed unequal pay.\n\nThe official judgement when dismissing their lawsuits were based on the\nfollowing points:\n\nThey and their…",
  "data/reddit-changemyview/r/changemyview/comments/q7esuq/cmv_legitimate_news_sites_need_to_stop_saying.json": "I am so sick of everything getting \"slammed\". It's completely meaningless. If\nsomeone was \"slammed\" by someone else it tells me exactly nothing about what\nactually happened.\n\nNews needs to report what actually happened and why. Was something illegal? Was\nit just someone's opinion? Is it legitimate?…",
  "data/reddit-changemyview/r/changemyview/comments/q7hab0/cmv_it_is_ok_to_give_a_beggar_money.json": "I firmly believe it is okay to give a beggar money if they are asking for it.\n\nYeah, many will take advantage of the money and will use it for unsavory things.\nHowever, what if you gave money to a beggar and they were JUST able to buy food\nfor themselves, purchase a suit for a job interview,…",
  "data/reddit-changemyview/r/changemyview/comments/q7jlfz/cmv_adding_pronouns_to_emails_sigs_and_zoom_call.json": "Okay, let's say you get an email from someone named \"Steven\". What are Steven's\npronouns? I'm gonna guess they're probably \"he/him\". Now, it's possible that\nSteven is actually a ciswoman. After all, I have known women named Michael and\neven met several cis men named Maria. So it's not like it's…",
  "data/reddit-changemyview/r/changemyview/comments/q7y58k/cmv_xenogenders_arent_valid_and_dont_make_any.json": "This belief is based on the idea of categories and their utility. When you have\na category, in this instance “gender”, it must contain some things and exclude\nothers for it to be a category. If it can be molded to be anything you want,\nthan it’s not a category anymore and is just a word that could…",
  "data/reddit-changemyview/r/changemyview/comments/q82vrq/cmv_the_united_states_should_require_a_stint_of.json": "In countries such as Finland\n[https://en.wikipedia.org/wiki/Conscription_in_Finland], Denmark\n[https://en..wikipedia.org/wiki/Conscription_in_Denmark], Norway, and Greece,\nseveral months of military service is required once citizens reach a certain\nage, with those who object having the option to…",
  "data/reddit-changemyview/r/changemyview/comments/q8427b/cmv_the_variants_mrs_and_miss_should_be.json": "There is no good reason to have these variants. Back when women were viewed as\nobjects to marry off to men, it served more of a purpose. But now it is\nunnecessarily judgmental that in a wide variety of settings, women are expected\nto announce their marital status. And while the use of Miss…",
  "data/reddit-changemyview/r/changemyview/comments/q85he5/cmv_things_like_watch_your_drink_or_use_a_buddy.json": "There was a guide on r/coolguides [/r/coolguides] that flipped these tips on\ntheir head like \"if you see a drink, don't spike it\" or similar inversions of\nthese tips on the basis that you should not victim blame. But these aren't\nvictim blaming. If you don't lock your door to your house and it gets…",
  "data/reddit-changemyview/r/changemyview/comments/q868e6/cmv_there_is_nothing_inherently_wrong_with_the.json": "Context: I work in a field that is both tech- and arts-adjacent in a very\nliberal city. In the past year, multiple thinkpieces and articles have made\ntheir way around encouraging people to change the vocabulary they use around\ntech. Example: removing terms like \"blacklist,\" \"whitelist,\"…",
  "data/reddit-changemyview/r/changemyview/comments/q8c63k/cmv_genital_mutilation_of_minors_must_be_banned.json": "We're talking about the West here, situation may be different in other world\nregions.\n\nI don't see a valid reason why it's illegal to surgically remove parts of girl's\ngenitals, and totally legal and even common (at least in USA) to do same thing\nto boy's genitals. Only reason when it should be…",
  "data/reddit-changemyview/r/changemyview/comments/q8pzax/cmv_curved_phone_screens_are_designed_to_be_more.json": "I let my phone ( Huawei p30 pro ) fall like an idiot and the cover i had on it\ndid fuck all to protect it even one bit: totally smashed the shit out of it - i\ncalled a reputable phone shop to get it fixed and was quoted 220€ to have it\nfixed. Am i imagining things or is that about 3x or 4x more than…",
  "data/reddit-changemyview/r/changemyview/comments/q8wzeb/cmv_exams_should_utilize_multiple_choice_less.json": "I mean the issue is that multiple choice oftentimes encourage students to cram,\nmemorize and regurgitate rather then learn. In certain subjects multiple choice\nis fine when you cannot just come to the correct answer by guessing or using\nprocess of elimination (or by memorizing everything before the…",
  "data/reddit-changemyview/r/changemyview/comments/q8yq0e/cmv_jason_voorhees_is_highly_derivative_of.json": "There are certain traits that are shared across the slasher horror subgenre as a\nwhole. You have some kind of of killer stalking down and killing a group of\npeople (often teenagers), one-by-one. Though most people wouldn't call it the\nfirst slasher, one of the most seminal movies is John Carpenter's…",
  "data/reddit-changemyview/r/changemyview/comments/q95blb/cmv_lavish_campaign_contributions_to_usa.json": "At dinner, family and I were discussing this contention — lavish campaign\ncontributions to USA political candidates lack transparency. But nobody could\ncome up with counterargument or counterevidence. Is there any?\n\nPlease write in Simple English. English isn't my first language. I'm not a\npolitical…",
  "data/reddit-changemyview/r/changemyview/comments/q97a6m/cmv_builtin_ads_on_youtube_are_bs_and_should_not.json": "I think that when YouTubers advertise their sponsors in the video, it is pretty\nscummy. I understand that creators need monetization. So, I'm not against the\n30sec-2min ads that you sometimes can skip. I'm talking about when the creator\nsays \"now before we go any further, I'd like to talk about our…",
  "data/reddit-changemyview/r/changemyview/comments/q9crtx/cmv_rude_servers_shouldnt_expect_tips.json": "Probably going to wish I picked a throwaway for this one, but here we go.\n\nFor context, I am not American, and American tipping culture is what I'm focused\non here. There is a tipping culture here in the UK, but as we receive standard\nmin wage, the 'expected' tip is generally around 10%. I spent 10y…",
  "data/reddit-changemyview/r/changemyview/comments/q9goeu/cmv_racegendersexuality_should_be_removed_from.json": "What’s the difference between these 2 stories: 1. Person breaks into house,\nsteals car 2. White man breaks into house, steals car\n\nObviously the answer is race and gender. You might say it’s just adding detail\nbut we have to think about how we perceive these details consciously…",
  "data/reddit-changemyview/r/changemyview/comments/q9hqk9/cmv_there_is_a_fundamental_difference_between.json": "Healthcare, food, water are basic human needs, not rights. This may seem\nsemantic but I think the distinction is important and blurring these lines is a\npretty negative aspect of current political discourse. Let’s start with the\ndefinitions.\n\nNeed: anything a human being needs to reasonably sustain…",
  "data/reddit-changemyview/r/changemyview/comments/q9htmt/cmv_conservatives_are_the_ones_that_are_actually.json": "First of all when I say conservative I mean people who hold conservatives views\nin general, not just people who vote conservatively. But Conservatives often\ncomplain that people these days are too sensitive but in reality they are the\nones that are so unwilling to change that they are offended by…",
  "data/reddit-changemyview/r/changemyview/comments/q9k0rh/cmv_context_needs_to_be_determined_before_u_can.json": "before someone can say if something is offensive or racist they need the entire\ncontext,otherwise u have an incomplete understanding and aren’t qualified to\nmake a judgment\n\nI’ll give an example here to back up my point\n\nImagine to ur left is a group of 3 Jews and u hear someone say “those…",
  "data/reddit-changemyview/r/changemyview/comments/q9qziz/cmv_trying_to_rewrite_spanish_with_the_stupid_x.json": "To clarify, when I say Latin American, I mean people from Mexico, Central\nAmerica, and South America, not just Latin people who immigrated to the US.\n\nLanguage is, in my opinion, the most important part of a culture. Second would\nbe traditions/rituals, third would be cooking, fourth would be art.…",
  "data/reddit-changemyview/r/changemyview/comments/q9uyr9/cmv_i_dont_think_georgia_should_outlaw_the_combat.json": "There is an option for a combat trial (I will answer any questions in the\ncomments)in a few counties in Georgia. Basically it is a route to take in a\ncivil lawsuit (usually in small claims courts). and while this is kind of\nbarbaric and primitive, it is outlawed in most counties/cities here in…",
  "data/reddit-changemyview/r/changemyview/comments/q9z90w/cmv_men_should_have_the_right_to_optout_of.json": "For this discussion I would like to focus on the matter of men's rights with\nregard to fatherhood. This is not a discussion about the morality of abortion.\nIn order to stay on topic we'll assume that abortion is morally ethical, safe\nand accessible for all women regardless of the circumstances of…",
  "data/reddit-changemyview/r/changemyview/comments/q9zuua/cmv_term_limits_on_the_basis_of_age_for_united.json": "The United States needs to set term limits on the basis of age for Congress and\nthe President.\n\n70+ year olds are frequently regarded as unemployable due to mental decline and\ndisconnect with the current times, but a high number of them are serving as\npoliticians in the United States. The oldest…",
  "data/reddit-changemyview/r/changemyview/comments/qa1oz1/cmv_the_term_latinx_is_an_imperialist_intrusion.json": "I came across this video: https://youtu.be/UCVCPJqIguU\n\nWhere a much younger latina student, talks down to her latino teacher, trying to\nforce him to adopt the word latinx.\n\nEven ending it by making a false analogy listing bunch of english words that end\nin \"nx\" ....which does not detract from the…",
  "data/reddit-changemyview/r/changemyview/comments/qa5xkt/cmv_modern_day_american_christianity_is_only.json": "EDIT: I’m saying the Christianity in the USA is framed as a positive\ninstitution, while in reality it actively holds society back with intolerance\nand hypocrisy.\n\nEDIT 2: I don’t think my viewpoint on Christianity’s effects on culture and\npolicies has changed, but as someone pointed out 1 in 3…",
  "data/reddit-changemyview/r/changemyview/comments/qa9xlj/cmv_marijuana_should_be_legalized_in_all_50_states.json": "There are some many things with this topic that I don’t understand. For\nmarijuana to be legal in SOME states but not ALL just doesn’t make sense. States\nare entitled to have their own laws, but my question is why? Why legalize\nmarijuana in only some states? What is the reason it’s not legalized in…",
  "data/reddit-changemyview/r/changemyview/comments/qae1si/cmv_had_jfk_lived_he_would_still_be_remembered_as.json": " 1. Charisma: This is probably the main reason JFK is so well liked, and it\n    would still be true had lived. He would be remembered as among the most\n    charismatic in US history, which allowed him to win hearts and minds across\n    the political spectrum. JFK had among the highest approval\n   …",
  "data/reddit-changemyview/r/changemyview/comments/qaixj9/cmv_bitcoin_mining_using_non_renewables_should_be.json": "Global warming is a serious threat to the survival of the human species and it's\ninsane we are adding to this problem for no good reason. Currently Bitcoin\nmining consumes more power per year than the whole country of Argentina. There\nwould be hardly any downsides in banning the mining of crypto…",
  "data/reddit-changemyview/r/changemyview/comments/qakf69/cmv_drugs_should_be_completely_decriminalised_for.json": "People shouldn’t be able to charge someone for possession of any drug for\npersonal use. I believe drug dealers and distributors should be held to the full\naccount of the law but by criminalising users you are only contributing to the\nproblem. Most people with substance abuse issues do so so because…",
  "data/reddit-changemyview/r/changemyview/comments/qaq4cv/cmv_the_term_elope_does_not_include_the_concept.json": "Pretty simple concept here. I don’t believe semantic change has come so far as\nto have the term elope change so drastically that it now can be applied to\nsomething small and local.\n\nElope, as defined by the Oxford dictionary is:\n\n> > run away secretly in order to get married, especially without…",
  "data/reddit-changemyview/r/changemyview/comments/qaqvys/cmv_im_convinced_that_people_who_believe_in.json": "Edit: View changed, fellas. Thanks for your posts, i appriciate all of the views\nand information provided here. All posts contributed, and crazyashley1's post\ntipped me over the edge. Not everyone needs defined evidence or even any\nevidence to honestly believe something, i think thats interesting…",
  "data/reddit-changemyview/r/changemyview/comments/qb0yi5/cmv_the_us_needs_to_tax_the_rich_more_and.json": "I could argue all day that rich people don't need more yachts and everybody\ndeserves second chances and all humans should be able to live with dignity. I\nthink all of those are decent arguments for redistribution.\n\nBut some people will say \"it's not your money, you are not entitled to it\"…",
  "data/reddit-changemyview/r/changemyview/comments/qb2cvm/cmv_deus_ex_machina_as_a_plot_device_used_in_any.json": "I've seen it plenty of times that in any situation where the protagonist has\ntheir back against the wall, the situation is dire and there seems to be no\nescape, all hope is lost, but then a miracle that has nothing to do with the\nactions of the protagonist or anyone in the situation comes and saves…",
  "data/reddit-changemyview/r/changemyview/comments/qb48d5/cmv_gender_is_not_a_social_construct_gender.json": "Before you get your pitchforks ready, this isn't a thinly-veiled transphobic\nrant.\n\nGender is something that's come up a lot more in recent discussions(within the\nlast 5 years or so), and a frequent refrain is that gender is a social\nconstruct, because different cultures have different…",
  "data/reddit-changemyview/r/changemyview/comments/qb70mz/cmv_preference_in_physical_attraction_doesnt.json": "I'm sorry for the poorly worded title but k couldn't think of any other way to\nput it.\n\nI was recently watching a video of \"Game or Lame\" a game in which guys tell\npick-up lines and a lady has to eventually narrow it down to one winner. In one\nof the episodes, the lady knocked off one of the guys…",
  "data/reddit-changemyview/r/changemyview/comments/qbdo8f/cmv_there_is_no_reason_for_the_us_to_support.json": "Here is what I understand about Israel's situation. Israel is currently fighting\na war against Hamas, a terrorist organization that launches rockets\nindescriminatly into Israel. In order to fight back, the US donates around 3\nbillion to 4 billion dollars a year to fund Iron dome, a defense system…",
  "data/reddit-changemyview/r/changemyview/comments/qbdt09/cmv_censoring_the_word_rpe_does_no_good.json": "Note: I’m not a native speaker and I might not be aware of some fine\nimplications of the words I mention.\n\nI get the idea that words like f*ck or sh*t are considered rude language and its\npolite or good manners to censor them.\n\nBut: Rape IS very bad. It is not a “bad” word or rude language. It is a…",
  "data/reddit-changemyview/r/changemyview/comments/qbfhe1/cmv_child_genital_mutilation_should_be_completely.json": "My belief is predicated on the following:\n\n * It has been decided that children are too young to undergo arbitrary\n   permanent changes to their body even with their consent. For instance it is\n   illegal to tattoo children.\n\n * Genital mutilation is not reversible upon adulthood\n\n * It is extremely…",
  "data/reddit-changemyview/r/changemyview/comments/qbkh1y/cmvwe_should_never_see_master_chiefs_face.json": "The Halo franchise has provided exciting,deep, and fantastic games throughout\nthe years.\n\nThe protagonist (or semi protagonist as Halo tells stories about humanity and\nother characters like the arbiter)\n\nIs a man who is usually quiet and faceless.\n\nBut the characters actions say enough.\n\nThat being…",
  "data/reddit-changemyview/r/changemyview/comments/qbnpfp/cmv_the_guillotine_is_better_than_lethal_injection.json": "If we are going to execute someone, we might as well use the guillotine. It is\nnot pretty, but it is far more humane than lethal injection. Lethal injection is\nexpensive, messy, inefficient, and cruel.\n\nProblems with lethal injection:\n\n-Companies do not want to sell drugs to states for executions,…",
  "data/reddit-changemyview/r/changemyview/comments/qbrle0/cmv_weve_gone_from_striving_for_virtue_to.json": "We no longer discuss what is virtuous, just, or moral. Nowadays we have plenty\nof social movents designed to merely accept whatever it is people believe. I\ndon't mean this to denigrate any of those groups, they may or may not be good\ncauses in themself. But the entire notion of virtue has gone out…",
  "data/reddit-changemyview/r/changemyview/comments/qc45m0/cmv_i_would_rather_people_be_blunt_with_me_and.json": "My generation (today’s older teenagers and young adults) has for some reason\nseemed to think communication is not important at all and has forgotten about\nit. When a girl likes me they usually will “drop hints” instead of saying “I\nlike you.” I know it isn’t easy to say that, but dropping hints…",
  "data/reddit-changemyview/r/changemyview/comments/qc4gbs/cmv_im_female_and_im_sexist_but_i_want_to_believe.json": "I’m the single mother and have a 12yr old son. I think about this everyday\nraising him. I acknowledge that my view may be ..skewed due to personal\nexperiences. Also that society raises boys and girls with opposite values,\ndestined to fail together.\n\nWarning -I use absolutes here*\n\nSo every dad I’ve…",
  "data/reddit-changemyview/r/changemyview/comments/qcd5bm/cmv_employees_should_be_able_to_opt_out_of_unpaid.json": "Let’s establish a baseline. I hold this opinion towards where I currently work,\nI’m not sure how other employers handle lunch breaks. I understand that\nemployers are required to provide breaks, my opinion is that employees should be\nfree to choose how to use unpaid breaks, depending on the needs of…",
  "data/reddit-changemyview/r/changemyview/comments/qchuqq/cmv_america_sucks_in_2021_because_rich_people.json": "Thesis: Middle class and poor people in America only occasionally resent being\ngoverned poorly. The rich - at all times - resent being governed at all.\n\nThe last time this country didn't suck for working people, the top tax rates\nwere in the 80%-90% range (1940s and 1950s). No rich people went…",
  "data/reddit-changemyview/r/changemyview/comments/qcmjlf/cmv_climate_protestors_should_target_the.json": "I'm basing this off the ongoing Extinction Rebellion protests and their sister\ngroup Insulate Britain here in the UK.\n\nMy theory is that they would be more effective in their aims were they to\ncompromise infrastructure and inconvenience people related directly to the\nindustries, government…",
  "data/reddit-changemyview/r/changemyview/comments/qcq1zw/cmv_the_british_cheese_toastie_is_superior_to_the.json": "I use the terms British and American to describe the different styles of making\ntoasted cheese sandwiches as they are most synonymous with these countries,\nalthough not strictly limited to.\n\nFor the uninitiated, many British households have one of these machines tucked\nat the back of a cupboard…",
  "data/reddit-changemyview/r/changemyview/comments/qcuqos/cmv_abortion_is_always_tragic_and_should_be_rare.json": "My view of abortion is that it should be safe and legal but as rare as possible,\nas it is always tragic to lose a baby.\n\nI have had multiple conversations with friends and family over the years, and\nseen dozens of posts online, about women (and men) mourning miscarriages. Losing\na pregnancy you…",
  "data/reddit-changemyview/r/changemyview/comments/qd7swo/cmv_pitbulls_should_not_be_viewed_as_inherently.json": "I recently saw a comment on here saying essentially \"pitbulls are a dangerous\ndog breed.\" I replied to the contrary and was surprised by the overwhelming\ndisagreement I got. So, am I wrong here?\n\nMy view is that to claim pitbulls are inherently violent does a disservice to\nthem and biases humans to…",
  "data/reddit-changemyview/r/changemyview/comments/qda3zy/cmvi_dont_think_religion_should_be_a_reason_to.json": "okay so i'm 15 (so you can get a better grip of my mindset) and obviously i'm in\nhigh school and if you've ever been in a gym class with both genders there's a\ndance unit where you have to be partnered with a male if your female, BUT if\nyour religion says you cant do something like touch a male…",
  "data/reddit-changemyview/r/changemyview/comments/qdka8a/cmv_it_is_wrong_to_use_small_dick_or_variations.json": "I'm of the belief that using an intrinsic quality of someone as a basis of\ninsult is wrong. There are countless other ways we try to improve our language\nto be more sensitive and inclusive; I don't see a valid reason this should be an\nexception.\n\nAs a corollary part of my view on this I believe that…",
  "data/reddit-changemyview/r/changemyview/comments/qdkd35/cmv_i_hate_my_pet_just_died_posts.json": "It seems almost impossible to scroll through any animal-related sub (or /all for\nthat matter) without coming across one of these. I invariably see the\npicture/video/whatever first, and about halfway through the warm-fuzzy feeling I\nget when I see someone's pet, I register that the title is something…",
  "data/reddit-changemyview/r/changemyview/comments/qdpsrn/cmv_constitutional_monarchies_have_no_place_in.json": "The reason I'm only talking about constitutional ones, like what we've got in\nEurope, is that even if there's a democracy in place and the monarch is just a\nfigurehead, the position of head of state is still inherited and taxpayers have\nto fund the expenses (which includes security) of an entire…",
  "data/reddit-changemyview/r/changemyview/comments/qdr0x3/cmv_the_most_plausible_outcome_of_death_is.json": "i believed in god and a afterlife until the last week or so when i started to\nquestion my beliefs, alot of the stuff does not make sense to me, one of these\nthings is the afterlife,\n\nAs far as we know now conciousness (most likely) is connected the brain, And\nwhen we die, the brain does not fully…",
  "data/reddit-changemyview/r/changemyview/comments/qe3wj0/cmv_the_term_gatekeeping_has_no_place_in.json": "What I mean is, if someone says they have autism, but do not have any/enough of\nthe symptoms of autism to meet criteria for that diagnosis, it is not\n\"gatekeeping\" to say they do not have autism. Diagnoses are definitions of\ndiifferent types brains and/or different types of human suffering based…",
  "data/reddit-changemyview/r/changemyview/comments/qe7eu0/cmv_thou_shall_not_rape_is_an_example_of_a.json": "A Universal Law, according to Kant's Categorical Imperative, should be able to\nbe followed by everyone, with absolutely no exceptions.\n\nThere is no situation that I can think of in which this maxim should be\nviolated. This is because rape is never a solution to a problem. A person will\nnot die due…",
  "data/reddit-changemyview/r/changemyview/comments/qe8nw6/cmv_conservatives_use_identity_politics_just_as.json": "Edit: No, I'm not saying that all Conservatives do this Conservatives use\nidentity politics in these ways and I agree that calling black conservatives\nracial slurs or race based insults is racist and it makes me cringe whenever I\nsee someone do that\n\n 1. Claiming that it is racist for a white…",
  "data/reddit-changemyview/r/changemyview/comments/qeban8/cmv_we_shouldve_never_shipped_manufacturing_to.json": "I feel as though our major manufacturing shift from our countries to overseas\n(and especially China) has had many devastating economic, ethical and even\neconomical issues throughout the past 40 years.\n\nI’m not suggesting we should be “America first” when it comes to a lot of\nthings, but I do believe…",
  "data/reddit-changemyview/r/changemyview/comments/qecw4q/cmv_mlk_was_entirely_against_rioting_and_to_say.json": "Honestly, I’m not entirely sure how I feel in regards to rioting as a form of\nprotest, but regardless of that, I feel that when leftists say something along\nthe lines of “well actually, MLK did riot and supported rioting actually!” I\njust can’t help but chuckle to myself and shake my head in…",
  "data/reddit-changemyview/r/changemyview/comments/qecx2k/cmv_echo_chambers_and_engagementfocused_media_are.json": "In recent years it seems that many subjects have become much more divisive. I\ndon't want to dwell on who's right, because my concern isn't about right or\nwrong, but about our ability as a society to live together with these growing\ndifferences.\n\nPolitics - In the USA there you can…",
  "data/reddit-changemyview/r/changemyview/comments/qed8ym/cmv_the_solution_to_lack_of_representation_in.json": "I'm not against representation in media. While I don't personally care much\nabout it, I recognize that it matters to a lot of people and is ultimately\nnecessary. However, in regards to historical pieces, I think that forcing\nrepresentation in cases where it does not make sense is bad. Instead, we…",
  "data/reddit-changemyview/r/changemyview/comments/qefoon/cmv_a_gun_is_always_loaded_regardless_of_who_you.json": "This was drilled into my mind a thousand times, I am curious if people think\nthere are legitimate cases where this doesn't apply. I was always told that\nregardless of whether or not you just checked the gun, or just finished firing\nit, or any other set of circumstances, the only safe way to approach…",
  "data/reddit-changemyview/r/changemyview/comments/qegdrg/cmv_african_americans_have_more_culture_in_common.json": "If you are born and raised in the United States then you are an American,\nespecially in the working class. We share the same culture, deal with the same\nstruggles. My message I’m trying to get across here is that if we stop being so\ntribal we might can make a difference. Black or white doesn’t…",
  "data/reddit-changemyview/r/changemyview/comments/qel3pm/cmv_singing_a_song_or_lyric_that_has_the_nword_in.json": "I understand that there is a LOT of baggage and history and context behind the n\nword that me as a non-black person couldn’t fully understand. With that said\nhowever, I cannot understand the logic behind not being able to sing a lyric\ncontaining said n word without being labeled a racist, other than…",
  "data/reddit-changemyview/r/changemyview/comments/qeqaa5/cmv_tribalism_is_the_biggest_obstacle_in.json": "Mainly using my points here regarding US politics as the issue is most\npronounced there, but this does apply to other democratic politics aswell.\n\nhttps://en.wikipedia.org/wiki/Tribalism\n\nModern democracy still has a long way to go until it is the idealized system\nit's often described as. But I…",
  "data/reddit-changemyview/r/changemyview/comments/qesnb3/cmv_cancel_culture_is_a_manipulative_tactic_used.json": "Cancel culture is annoying. No one is perfect so we all make mistakes but what's\nannoying about this is how people exploit these mistakes to use you as a\nstrawman by looking for hipocrisy in your words.\n\nI just can't help but see that as a way to undermine an opponent and not as a\nway to promote a…",
  "data/reddit-changemyview/r/changemyview/comments/qeufza/cmv_in_a_humane_society_painless_assisted_suicide.json": "The reason for the age restriction is that people's brains are not done\ndeveloping until their mid-twenties, and because there are a lot of fluctuations\nin emotions and life circumstances in your youth. There should be a time lock\nafter signing up for the assisted euthanasia where you have to wait…",
  "data/reddit-changemyview/r/changemyview/comments/qf2108/cmv_belief_systems_that_rely_heavily_on_shame_are.json": "We seem to agree as a society that shame is harmful to mental health, and is\nparticularly harmful to children. In my state, intentionally leading a child to\nbelieve that he or she is bad or defective is considered emotional abuse or\nneglect. It's grounds to involve social services. Some examples of…",
  "data/reddit-changemyview/r/changemyview/comments/qfc094/cmv_burgers_are_sandwiches.json": "it boggles my mind how many people I've met who think that burgers aren't\nsandwiches. it's crazy. they're so obviously sandwiches. the definition of a\nsandwich is 2 pieces of bread, crackers etc, with something between them. a\nburger is 2 bread buns with a beef (sometimes chicken) patty in the…",
  "data/reddit-changemyview/r/changemyview/comments/qfccof/cmv_neopronouns_are_selfish.json": "I’m all for trans rights, gender roles should burn in flames and gender\nidentities should rise from the ashes, but we have 3 pronouns everyone is used\nto, he, she, and they. if none of these apply to you, you can’t get offended\nwhen your own personal unique pronoun isn’t used, because you’re forcing…",
  "data/reddit-changemyview/r/changemyview/comments/qff4qj/cmv_saying_sex_work_is_real_work_is_dangerous.json": "I’m less inclined to change my view on this topic, more interested to hear\nopposing views; I am, however, open to re-evaluating my position and realise my\nlogic may be wrong.\n\nI am not saying that sex work isn’t HARD work, even in the slightest. I just\nfeel that the line between ‘lingeries on…",
  "data/reddit-changemyview/r/changemyview/comments/qfma4w/cmv_apartments_should_reserve_their_ground_floors.json": "Imagine the apartment you live in catches on fire and you live on the third\nfloor. You get to the elevator but of course there’s a sign that says “in case\nof fire use stairs” Seems easy enough, right? But what if you’re in a wheelchair\nor scooter. You can’t use the stairs so your only options are…",
  "data/reddit-changemyview/r/changemyview/comments/qfscr7/cmv_its_not_an_employees_responsibility_to_find_a.json": "I remember when I first started working, as long as someone gave a few days\nnotice before calling off, the manager would handle scheduling. It was nice if\nyou had already found someone to fill in for you but it wasn’t an expectation.\n\nBut it seems at some point that changed where now the employee is…",
  "data/reddit-changemyview/r/changemyview/comments/qfwx95/cmv_college_in_the_us_isnt_free_because_doing_so.json": "One of the largest selling points of joining the military is that you get a\nlarge stipend to spend on your post-secondary education through the GI Bill.\nTalking to many recruits and veterans, many of them bring up joining the army to\npay off their college education because they didn't want to deal…",
  "data/reddit-changemyview/r/changemyview/comments/qg0l1v/cmv_taxing_unrealized_capital_gains_is_an.json": "To illustrate my point, let’s take a simple example:\n\nI buy $100 worth of stock in a company, that stock then appreciates in value to\n$500, meaning I owe taxes on $400 worth of “unrealized capital gains”.\n\nIf the stock then plummets to $50 in value, all of a sudden I owe the government\nfor assets I…",
  "data/reddit-changemyview/r/changemyview/comments/qgegs2/cmv_its_not_okay_to_reach_out_to_someone_you.json": "I don’t have my social handles listed on any of my dating profiles but I’ve\nstill had people be able to find my Instagram as some of them go to the same\ncollege as me and we have mutual followers. I don’t think this is okay as the\nfact that we didn’t match should indicate that I may not be…",
  "data/reddit-changemyview/r/changemyview/comments/qgic8r/cmv_despite_disillusioned_people_humans_are.json": "There are some people that think humanity is only getting worse, all changes\nthat come forth are bad etc, you know the type. But I don't think that's how it\nis. But challenge me. I don't see humanity getting worse, or people getting\nworse, but better, even despite the melting pots of people who are…",
  "data/reddit-changemyview/r/changemyview/comments/qgjnc9/cmv_abortion_is_a_red_herring_political_issue_and.json": "It's pretty easy to find abortion advocates, on either side, who treat this as\nthe ONE issue that will dominate political discourse.\n\nThe US has ~610,000 abortions/year. For comparison, heart disease kills\n~650K/year and cancer kills ~ 600K/year. We all agree cancer and heart disease\nare bad, but…",
  "data/reddit-changemyview/r/changemyview/comments/qgjxeu/cmv_pronouns_other_than_heshethey_defeat_the.json": "I have no issue with inclusivity and couldn’t care less why you identify as/who\nyou’re attracted to, that’s totally your business. But the point of a pronoun is\nto be a general term used to identify/refer to someone. There are currently 78\ngender pronouns… 78. At that point, wouldn’t it make more…",
  "data/reddit-changemyview/r/changemyview/comments/qgq4k1/cmv_every_social_media_site_would_be_like_4chan.json": "Everybody likes to delude themselves that 4chan is some sort of aberration, a\ndisgusting pimple on the face of the internet, and that the \"real\" internet is a\nwelcoming and wholesome place.\n\nBut 4chan is the ONLY place on the internet where all legally protected speech\nis permissible, and only…",
  "data/reddit-changemyview/r/changemyview/comments/qgvk0h/cmv_waking_up_early_doesnt_necessarily_mean_that.json": "I don't understand why waking up early is considered a great thing and people\nlook down on those who wake up late (atleast in my country, India)\n\nI wake up late because I start my work at 10 and if I wake up at 5 in the\nmorning, I would just be draining my energy till 10. Waking up at 9 and…",
  "data/reddit-changemyview/r/changemyview/comments/qgyjwf/cmv_cancel_culture_is_a_conservative_dogwhistle.json": "A phrase I've seen used a lot recently in internet discourse is this idea of\n\"cancel culture\", moreso in the last few weeks because of controversy\nsurrounding Dave Chappelle's new comedy special. Interestingly it seems like\nthis idea has become popular even among the center-left (which I feel are…",
  "data/reddit-changemyview/r/changemyview/comments/qh2us4/cmv_there_is_a_shortage_of_workers_because_the.json": "I am a professional chef and the pandemic and lockdown hit the food scene like\nthe fist of an angry god. Many restaurants immediately shut down to wait it out.\nMany restaurants shut down and went out of business. Some restaurants were able\nto stay in business by effectively converting to a dine-out…",
  "data/reddit-changemyview/r/changemyview/comments/qhfig1/cmv_i_think_it_should_be_okay_to_criticize_people.json": "A lot of times, we hear people in the West defending atrocities committed by\nother cultures/nations, saying that \"We are not in a position to judge them for\ntheir wrongdoings, since we are a product of Western culture and we have been\nindoctrinated with Western values.\" I think this sentiment is…",
  "data/reddit-changemyview/r/changemyview/comments/qhl9p7/cmv_people_should_stop_referring_to_american.json": "“White culture” is synonymous with American culture because most Americans are\nwhite and “white culture” is the dominant culture in the USA. People should stop\nreferring to American culture as “white culture” and start referring to it as\n“American culture” because it doesn’t let nonwhites assimilate…",
  "data/reddit-changemyview/r/changemyview/comments/qhpfuy/cmv_money_does_buy_happiness_its_literally_the.json": "Money doesn't buy happiness. Its a statement that is a complete and udder lie\nthat is only used to keep the poor from feeling bad about their current\nsituations. Of course money buys happiness. The world was literally built on the\nidea of currency. You'd have to be an absolute buffoons' to assume…",
  "data/reddit-changemyview/r/changemyview/comments/qhtxyb/cmv_circumcision_for_children_should_be_illegal.json": "Circumcision is not only almost always medically unnecessary, but it is a clear\nviolation of the rights of the child. If somebody who is at an age capable of\nconsenting, then sure, let them do it.\nBeing allowed to mutilate our children in the name of religion is completely\ninsane, and should not at…",
  "data/reddit-changemyview/r/changemyview/comments/qhx1iz/cmv_theres_no_reason_for_me_to_put_my_pronouns_in.json": "Many of my colleagues include their pronouns in their email signature and in\nother types of professional correspondence. I am totally fine with them doing\nthat. I have no complaints about the practice at all.\n\nI don't, however, feel any need to follow suit and put my pronouns in my email\nsignature.…",
  "data/reddit-changemyview/r/changemyview/comments/qhx7f5/cmvi_dont_have_to_respect_your_culture_or.json": "As the title suggests , I don't believe that I have to respect every\nculture/religion. Since they can be promoting ideas that don't align with my\nmoral values ( misogyny ,sexism,inequality,racism , pedophilia...). What I do\nhave to respect is one's choice to follow a desired religion and practice…",
  "data/reddit-changemyview/r/changemyview/comments/qi1j3a/cmv_its_disingenuous_to_tell_someone_to_love_your.json": "I see this with celebrities and “influencers” but also in general. Many people\npromote this message of “loving yourself for who you are” while they themselves\nare refuse to be seen without makeup, use filters and photoshop and get\nsurgeries to look better.\n\nI think one of the goofiest things I’ve…",
  "data/reddit-changemyview/r/changemyview/comments/qi278p/cmv_science_cannot_tell_you_to_do_something.json": "Disclaimer: Since I'm probably going to be called an anti-vaxxer for making this\nargument, I want to make it clear that I have taken the vaccine and would\nencourage anyone who is medically fit to do so also take it.\n\nWith that out of the way, I see a lot of pro-vaccine and pro-mandate…",
  "data/reddit-changemyview/r/changemyview/comments/qi6oud/cmv_buying_expensive_diamond_weddingengagement.json": "The act of buying an expensive, timeless diamond ring is perpetuated by the De\nBeers company, that suppresses the supply of diamonds to retain an artificially\nhigh price.\n\nThe utility obtained from the diamond ring is completely detached from the\nprice. This is also true for other day-to-day things…",
  "data/reddit-changemyview/r/changemyview/comments/qibiiy/cmv_passion_trusting_your_feelings_should_be.json": "If a million kings made a million decisions for their subjects with a mindset of\n\"trust your feelings\", and another million kings made a million decisions for\ntheir subjects with a dispassionate mindset (Vulcan style), the latter group\nwould have more success more often.\n\nWhenever someone defends a…",
  "data/reddit-changemyview/r/changemyview/comments/qif42b/cmv_returning_your_shopping_cart_is_always_the.json": "No matter the rush, no matter the circumstance, assuring that your grocery cart\nis returned is the right thing to do in every instance. I absolutely hate it\nwhen I go to pull into a spot and someone left their cart in it. It seems to me\nlike there’s no excuse. Parking lots are already accident prone…",
  "data/reddit-changemyview/r/changemyview/comments/qixmg2/cmv_freddy_krueger_is_the_greatest_horror_movie.json": "He's an all original character with a fantastic backstory and the idea of his\nexistence is far more disturbing then any of his decade counterparts like Jason,\nMicheal, or Chucky. My man Freddy has the best style of dress, the best methods\nof killing, and the best dialog one liners (winning out…",
  "data/reddit-changemyview/r/changemyview/comments/qj7xcv/cmv_the_mass_resignations_and_push_for_higher.json": "I went to college and worked hard and got a 4 year degree. I then got a job\npaying the equivalent of 25 or so an hour, with small raises each year.\n\nNow that the service industry is spiking wages over 20 an hour, middle class\nwages already in the 20s per hour have not gone up and probably will…",
  "data/reddit-changemyview/r/changemyview/comments/qj9jbx/cmv_most_influencers_are_just_random_attention.json": "Note this comment applies to 99% of so-called influencers. While there are\ncertainly a few who actually sell product and get people to copy their style /\nfashion (sports stars, Hollywood icons etc), the vast majority of people calling\nthemselves influencers are just extroverts from Podunk…",
  "data/reddit-changemyview/r/changemyview/comments/qjapxt/cmv_the_definition_of_asexuality_is_too_broad_and.json": "I started thinking of this after seeing this tweet. It's an asexual model\nadvertising an asexual-themed lingerie line.\nhttps://twitter.com/SophNar0747/status/1453702975222919168?t=2zXdqNmFzX5C8xV7pUL99A&s=09\n\nApparently the accepted definition of asexual has broadened to include people\nthat enjoy…",
  "data/reddit-changemyview/r/changemyview/comments/qjdyxs/cmv_capitalism_and_socialism_have_become.json": "When people claim to oppose capitalism or socialism, they typically don't know\nwhat they are talking about. I'm all for questioning the status quo, but these\nwords get thrown around so much that they've lost all meaning. So, why not be\nmore precise? Let's have discussions about economics, human…",
  "data/reddit-changemyview/r/changemyview/comments/qjr0r7/cmv_employers_abuse_immigration_visas_instead_of.json": "Recently there has been a lot of talks about the shrinking middle class, lower\nwages in relation to cost of living, and not enough \"educated\" Americans for\ncertain positions.\n\nI am of the opinion that this has all been the caused by corporations no longer\nlooking to train up or spend time on local…",
  "data/reddit-changemyview/r/changemyview/comments/qjr7dt/cmv_in_the_western_world_there_is_no_point_in.json": "I'll limit it to Canada and USA, but I am sure this applies to others.\n\nWhen I hear people being concerned about low birth rates, I think, even if\nthat's a problem, what can we do about it. I would like my view changed because\nright now I'm a pessimist. Please note that this post isn't about…",
  "data/reddit-changemyview/r/changemyview/comments/qjsvwa/cmv_the_claim_that_100_companies_produce_71_of.json": "You'll often hear the that 100 companies produce 71% of carbon emissions. This\nis technically true given a couple of definitions. You'll also usually hear\npeople say that because of that, we really just need to get those 100 companies\nto clean up and we'll solve climate change. This, however, is…"
}