{
  "data/reddit-projects/r/SideProject/comments/t43pma/ukraine_crisis_we_open_our_small_platform_for.json": "Hi all,\nWe are two product builders - Lisa and Damian. Lisa's from Ukraine, I'm in\nPoland. We observe the crisis with dread, watching friends and relatives under\nattack. We need to get active.\nTherefore we decided to contribute with our small freelancing platform -\nramen.network…",
  "data/reddit-projects/r/SideProject/comments/t47dma/i_am_tired_of_meta_and_mainstream_social.json": "A little background, I am a software engineer fresh out of college. Never\nstarted a business, but I understand the technical aspects of starting a social\nnetworking platform. I understand the following challenges and difficulties:\n\n 1. Content Moderation.\n 2. Scaling and funds.\n 3. Security.\n 4.…",
  "data/reddit-projects/r/SideProject/comments/t4p9mx/payrequest_just_launched_on_producthunt_and_quite.json": "SINCE IT'S IMPORTANT TO ALSO SHARE THINGS THAT DIDN'T WORK AS EXPECTED...\n\nOn 1 March 2022, we launched our update on Producthunt:\nhttps://www.producthunt.com/posts/payrequest-4-0-1\n\n\nTHE NUMBERS ARE DISAPPOINTING:\n\n * 15 Upvotes\n * 1 reply (but from a loyal customer)\n * Not much…",
  "data/reddit-projects/r/SideProject/comments/t5372g/i_created_a_website_that_helps_you_valuate_stocks.json": "Hey guys, I created a website that helps valuate stock using discounted flow and\nprice to sales model so please have a look. Also, since this is my first\nwebsite, so if there’s any suggestions to add additional features feel free to\nlet me know. I look forward to reading your comments, Thank…",
  "data/reddit-projects/r/SideProject/comments/t4qjaj/first_project_looking_for_general_feedback.json": "Hello. I'm an AS graduate in CS and also partially self-taught as well. I'm new\nto the programming world and am looking for general feedback regarding my first\nprogramming project, an image gallery written in Java/JavaFX. I've worked on it\nfor some time(about 8 months) while also learning some Git…",
  "data/reddit-projects/r/SideProject/comments/t5nmfw/i_created_a_database_client_for_popular_sqlnosql.json": "web: https://dbgate.org\nsource code: https://github.com/dbgate/dbgate\ndemo: https://demo.dbgate.org",
  "data/reddit-projects/r/SideProject/comments/t557io/i_built_an_app_to_track_my_grocery_list_recipes.json": "I was tired of picking up soggy messes from the back of my fridge, so I built an\napp that lets me manage a grocery list that starts a clock when items are\npurchased. The app sorts my pantry/fridge/freezer based on when things are about\nto go bad. Oh, and it also lets you scrape websites for recipes…",
  "data/reddit-projects/r/SideProject/comments/t5md2f/i_made_a_call_sheet_builder.json": "Hello,\n\nI have just made a film/photoshoot call sheet builder.\n\nhttps://avogato.co/\n\n\n\nI would be happy to hear any feedback from you :)",
  "data/reddit-projects/r/SideProject/comments/t5naz6/just_launched_habitual_money_on_product_hunt.json": "Hey r/SideProject [/r/SideProject]!\n\nWe just went live on Product Hunt with my side-project turned full-time project\nHabitual Money!\n\nIt’s a personal finance app that makes it easy to track and categorize your\nspend across your Amazon, Venmo and daily transactions.\n\nWe enable you to personalize and…",
  "data/reddit-projects/r/SideProject/comments/t5gd88/im_creating_a_mobile_app_for_pets_that_classifies.json": "Hi y'all!\n\nI’m the founder of PawsPlace a mobile application that classifies foods, plants\nand households items based on their level of toxicity for cats and dogs. I’ve\ndedicated the last two years in researching how these various items interact\nwith our pets (cat and dogs) bodies based on their…",
  "data/reddit-projects/r/SideProject/comments/t676g4/rayzor_a_mobile_platform_for_affordable_expert.json": "Hey, y'all!\n\nStartup Name / URL: Rayzor https://rayzor.io\n\nElevator Pitch: Rayzor is a mobile application that lets users submit quick,\nbite-sized submissions to experts. Users receive affordable, valuable\nadvice/feedback while experts finally get a way to fit paid teaching/guidance\ninto their busy…",
  "data/reddit-projects/r/SideProject/comments/t6cq3j/i_created_an_app_that_makes_it_possible_for.json": "App:\n\nDreamnocs.\n\nhttps://dreamnocs.com [https://dreamnocs.com/]\n\nAvailability:\n\niOS and Android\n\nAbout:\n\nA team oriented habit tracker. Basically after creating account you:\n\n * Find a team with goals and habits that interest you\n\n * Or you create your own team and craft your own habits\n\n * You…",
  "data/reddit-projects/r/SideProject/comments/t69sjz/i_wrote_a_very_small_state_manager_vssm_in_pure.json": "Wanted to share my first serious package with you.\n\nI wrote a Very Small State Manager (Vssm) in pure Javascript. It has no\ndependencies, is plug-and-play and weighs <2Kb minified.\n\nNpm [https://www.npmjs.com/package/vssm]\n\nDocumentation [https://tk-ni.github.io/Vssm-docs/]\n\nSource code…",
  "data/reddit-projects/r/SideProject/comments/t6nx2h/would_you_do_it_for_a_dollar.json": "I have had this idea for a long time called Would You Do It For A Dollar?\nBasically you post something that people might do for $1 (or potentially more)\nand someone does it, post a proof in form of a pic or a video and then that\nperson gets paid $1 (from your account)\n\nI'm aware that this idea…",
  "data/reddit-projects/r/SideProject/comments/t6o6ss/12_products_in_12_months.json": "My partner and I are building 12 products in 12 months.\n\n\nWHY?\n\nThere are a lot of reasons I'm excited about this project.\n\nI'm a builder. Creating things excites me. It makes me feel alive. I love\neverything from naming products, designing logos, writing bits of code, and\nsetting up deployments.…",
  "data/reddit-projects/r/SideProject/comments/t7xzz6/i_made_an_app_that_asks_you_to_vote_for_problems.json": "https://reddit.com/link/t7xzz6/video/6a9p413ferl81/player\n\nHi Folks,\n\nWhat is Hulacorn?\n\nIt's a tool for getting feedback from potential customers, you can enter a\nproblem and examples of the problem and allow people to vote on which one\nappeals to them.\n\nGive it a try @…",
  "data/reddit-projects/r/SideProject/comments/t8q1t8/i_built_a_service_to_discover_rapidly_growing.json": "Hey everyone, as a bootstrapped founder, I'm always looking for emerging trends\nsince I definitely don't have the budget to create demand from scratch. So I\nbuilt Under the Radar, [https://undertheradar.io] a simple tool that\nautomatically surfaces interesting new trends.\n\nThe raw input comes from…",
  "data/reddit-projects/r/SideProject/comments/t8tw06/i_made_a_website_for_brainstorming_side_project.json": "https://ideastrikes.com/ is a pretty simple website I made to help myself and\n(hopefully) others brainstorm new project ideas.\n\nI've always been one of the folks who can never seem to come up with the perfect\nidea. My biggest blocker was that I felt any new project needed to be novel and\nfresh.…",
  "data/reddit-projects/r/SideProject/comments/t907up/beacon_get_notified_when_the_interesting_stuff.json": "Hi,\n\nI've got a small SideProject I'd love some feedback on, essentially it's a super\nsimple way to connect up your server with your favourite platforms. I've just\nadded some docs to help you get started and even check it out before signing up\nto see if it's for you! Check it out…",
  "data/reddit-projects/r/SideProject/comments/t9jqa0/i_have_created_a_vscode_plugin_that_provides_js.json": "It's no secret software developers search the web a lot.\nAccording to some source, we waste about 15% of our coding time searching for\ncode snippets online.\n\nTo overcome this time waste, I have created a plugin that allows developers to\ntype, in plain English, what they want to do and provides them…",
  "data/reddit-projects/r/SideProject/comments/ta4bj6/i_made_a_twitter_and_mastodon_bot_posting_random.json": "Hi :)\n\nI made a bot to post every hour a random indie website:\n\nTwitter bot: https://twitter.com/IndieRandWeb\n\nMastodon bot: https://mastodon.social/web/@FunRandWeb\n\nSource code: https://github.com/xojoc/randomwebsitebot\n\nThe websites are fetched from https://stumblingon.com/ (made by…",
  "data/reddit-projects/r/SideProject/comments/tae1gn/after_8_months_of_hard_work_just_launched.json": "Today, I’m existed to share an awesome news with you: Nextless.js is on Product\nHunt. The perfect full-stack React SaaS Boilerplate to build faster your SaaS\nproduct and help you earn your 1st MRR.\n\nSomething I was working in the last 8 months. You can learn more at Nextless\nProduct Hunt…",
  "data/reddit-projects/r/SideProject/comments/ta6iwr/i_have_created_an_allinone_tool_for_managing_your.json": "https://preview.redd.it/shlo8lxhmcm81.png?width=1346&format=png&auto=webp&s=9957f4f91b625e66c44773041d19c5881ffebd08\n\nThis tool will help you save your bookmarks, create a Collection (library) of\nBookmarks and generate Short URLs for bookmarks and any other links.\n\nYou can get analytics on Short…",
  "data/reddit-projects/r/SideProject/comments/taxhib/i_have_a_saas_idea_where_should_i_start.json": "I am a developer and I have an idea for a SaaS that I would like to create. I\ndon't have anything at the moment except this idea, where should I start?\n\nIf you have any resources (books, courses, articles, newsletters ..) or any tips\nto share that would be great!",
  "data/reddit-projects/r/SideProject/comments/taw3to/wordpress_sites_make_over_45_of_all_websites_so.json": "Over 455 million websites used WordPress as of 2021! The default WordPress\nsearch tool is nice but it returns irrelevant results, lacks facet\nfunctionality, loads sluggishly, and offers few customization options. Your\nbusiness and, especially your visitors deserve better UX on your WordPress…",
  "data/reddit-projects/r/SideProject/comments/tb2q9j/wanna_test_my_twitter_growth_tool_first_version.json": "Hey,\n\nIf you're eager to grow your Twitter audience, and give me feedback to make the\ntool better together, please sign up here: Twitter Growth Tool\n[https://twitteroid.com/dashboard/users/register]\n\n\n\nPs. I talked about it a few months ago in this…",
  "data/reddit-projects/r/SideProject/comments/tbb3wg/hi_im_a_java_developer_and_i_want_to_develop_your.json": "My english is pretty bad, specially when I'm talking. I will some day try to\nimprove it, but not any time soon. Meanwhile, I would like to try to use what I\nknow of it to talk with someone about software development related things, as in\nthe future my goal is to work for a foreign company and I'm…",
  "data/reddit-projects/r/SideProject/comments/tbiccp/beta_testers_needed_a_conversational_chatbot.json": "Hello, this is BLOONY Team at TUNiB.\n\nTUNiB is a natural language processing start-up, and we are preparing various AI\nservices.\n\nOur company recently released a closed beta version of a conversational chatbot\nnamed BLOONY.\n\nBLOONY is an AI Chatbot based on OpenAI's GPT-3 that allows you to chat…",
  "data/reddit-projects/r/SideProject/comments/tbnumz/ive_built_a_virtual_coworking_space_where_you_can.json": "I think the title says it all. Basically, you can work in focused 50 minute\nsprints with an accountability partner. At pipewing.com [https://pipewing.com/]",
  "data/reddit-projects/r/SideProject/comments/tbvimq/suck_at_product_launches_want_to_do_better.json": "Hey there! 👋\n\nEveryone is writing their Product Hunt launch stories since 2013. Fortunately,\nyou don't have to read all of them as I have read \\most* of them by spending a\nfew weeks and condensing all of them into this checklist. These 200+ tips are\ndivided into 12 checklists:*\nThese 200+ tips are…",
  "data/reddit-projects/r/SideProject/comments/tbtwa0/ive_built_a_job_board_for_asynchronous_jobs.json": "The goal of the job board is to post jobs that offer time flexibility to\nemployees. It includes async culture/ part-time/ the freedom to work on side\nprojects, etc.\n\nHere is the link: https://asynccjobs.com/\n\nPlease do support and share. Thank you.",
  "data/reddit-projects/r/SideProject/comments/tb8dll/pppalette_easy_color_palette_generator.json": "Hey all! 👋\n\nI made this color palette generator: https://fffuel.co/pppalette/\n\nI'll be using it to help me pick colors for my own designs, and hoping it'll be\nuseful to others that need to pick colors for their projects.\n\nCheers and thanks for checking it out! ✨",
  "data/reddit-projects/r/SideProject/comments/tc8gj0/reactive_resume_a_free_and_open_source_resume.json": "Hello, r/SideProject [/r/SideProject]!\n\nThe free and open-source resume builder app you all know and love is now on\nversion 3.0, almost two years since its initial release, and it's out there!\n\nWithout dwelling into the details too much at once, here are the links of\ninterest:\n\nhttps://rxresu.me…",
  "data/reddit-projects/r/SideProject/comments/tcawnv/we_created_our_own_toy_programming_language_for.json": "We always had a curiosity about what it takes to create a programming language,\nbut we always thought that it would be tedious and complicated work. But guess\nwhat? We were wrong. It's actually quite fun! The actual Idea for \"Bhailang\" was\noriginated from an internal joke a couple of years back…",
  "data/reddit-projects/r/SideProject/comments/tdgc86/ama_startup_founder_ask_me_anything.json": "I bootstrapped a startup [https://www.BungalowSoftware.com] 25 years ago. I've\nrun it since then.\n\nI learned a lot along the way, often the hard way :)\n\n\n\nAsk me anything",
  "data/reddit-projects/r/SideProject/comments/td8022/want_to_read_more_but_cant_stay_focused_well_i.json": "Do you wish to read more but can't make time for it, or stay focused? I always\nwanted to read more from history's best minds. At one place - instead of\ngoogling an author every time. So I made this bot that does exactly that …",
  "data/reddit-projects/r/SideProject/comments/tdse41/its_an_honor_to_show_you_my_list_of_side_projects.json": "Hello everyone, I am very happy to be here to show you my projects, this is the\nhard work of me and my partners!\n\nhttps://preview.redd.it/0s3qpd1n4bn81.png?width=2240&format=png&auto=webp&s=b38fc7a413bdea41076b22de61ce89244d49bd35\n\nWe are committed to developing free online web downloaders, here is…",
  "data/reddit-projects/r/SideProject/comments/tdra66/i_made_an_app_to_connect_with_like_minded.json": "I just launched the app which I was working for last few months. The idea is to\nconnect with like minded people when traveling to another country as well as\nanywhere you like since there are always some people interested to meet you. App\nName :- \"HeyNomad - Connect with Nomads\" (Android version…"
}