{
  "data/reddit-stocks/r/stocks/comments/rud6aa/tesla_beats_wall_street_expectations_again.json": "<!-- SC_OFF --><div class=\"md\"><p><a\nhref=\"https://ir.tesla.com/press-release/tesla-q4-2021-vehicle-production-deliveries\">Tesla\ndelivers 308k cars in Q4</a>. Giving a total of 936k cars in 2021. </p> <ul>\n<li>308,600 deliveries is a <strong>+27.9%</strong> quarter-over-quarter\ngrowth</li>…",
  "data/reddit-stocks/r/stocks/comments/ruaoux/student_loans_will_not_cause_the_next_crash.json": "<!-- SC_OFF --><div class=\"md\"><p>After writing my old post (Link:<a\nhref=\"https://www.reddit.com/r/stocks/comments/rtdpr6/student_loans_might_cause_the_next_crash/\">https://www.reddit.com/r/stocks/comments/rtdpr6/student_loans_might_cause_the_next_crash/</a>)\nI have done some more research and come…",
  "data/reddit-stocks/r/stocks/comments/rud2bw/tesla_beats_analyst_consensus_deliveries_in_q4.json": "https://ir.tesla.com/press-release/tesla-q4-2021-vehicle-production-deliveries\n\nAnalyst consensus deliveries\n\nBloomberg compiled consensus: 266,000\n\nCompany compiled consensus: 266,183\n\nFactSet compiled consensus: 267,000\n\nHighest analyst estimate: 290,000 (Credit Suisse)\n\nActual deliveries:…",
  "data/reddit-stocks/r/stocks/comments/ru65e5/cash_is_a_position_and_a_bad_one.json": "My person: I am 59 years of age and bought my first security 40 years ago.\n\nI keep reading that cash is a good thing to hold in case the market breaks.\nBonds (except maybe Junk Bonds) are basically the same as cash when looking at\ninflation.\n\nI write this article because it seems that 95% of…",
  "data/reddit-stocks/r/stocks/comments/rudyps/jpmorgan_says_january_effect_will_boost.json": "> Despite raging inflation and warnings from some prominent investors that the\n> stock market is dangerously overheated, JPMorgan still expects a boost from\n> “the January effect.\"\n> \n> The phrase refers to the belief that the market’s best month tends to be the\n> year’s first.\n> \n> This month,…",
  "data/reddit-stocks/r/stocks/comments/rul6na/smaller_boring_companies_that_are_quietly.json": "In One Up on Wall Street, Lynch suggests a strategy of scouting for smaller\ncompanies that do unexciting things very well and quietly expand their reach and\nprofitability as a result. These companies tend to go unnoticed by most\ninvestors, but can reward avid scouts handsomely as the market catches…",
  "data/reddit-stocks/r/stocks/comments/ruqpl8/2022_strategy.json": "Nasdaq gained 26.32% in 2021. S&P gained 26.68% in 2021. VTI gained 23.57% in\n2021.\n\nFor those of you who didn’t beat those numbers what is your strategy for 2022?\n\nI personally spent a lot of time reading/researching and only did 15.58%. I\nthink my 2022 strategy is going to be a lot more of the…",
  "data/reddit-stocks/r/stocks/comments/rus7ml/embattled_china_evergrande_shares_halt_trading.json": "Curious… who would even own Any shares knowing the public info that they have\ndefaulted on debt?\n\nAlso… you think we’ll be red or green on the first trading day of the year?!\n\nEmbattled China Evergrande shares halt trading\n[https://www.reuters.com/markets/europe/china-evergrande-shares-halt-trading…",
  "data/reddit-stocks/r/stocks/comments/rujfir/semiconductors.json": "I've been doing my research on semiconductors and I'm struggling deciding what\nstocks to buy, because there's a lot of competition and I don't understand\nenough about the industry to know the pros and cons of each company.\n\nFrom the \"big boys\", Intel is considerably cheaper, costing about 51$ per…",
  "data/reddit-stocks/r/investing/comments/rujpqr/too_many_people_are_getting_influenced_by.json": "I think most of them are down on short positions or paid by hedge funds to\nspread FUD. The outlook for 2022 is not as good as 2021 but companies are still\ngenerating record earnings. The US economy is growing not contracting(recession)\nso these guys are not basing their predictions on even the most…",
  "data/reddit-stocks/r/investing/comments/rurz0d/evergrande_suspends_shares_in_hong_kong_as_firm.json": "> Crisis-hit Chinese real estate giant Evergrande has suspended trade in its\n> shares on the Hong Kong as investors await news on its restructuring plan.\n> \n> The statement to the stock exchange did not give a reason for the trading\n> halt.\n> \n> Evergrande has more than $300bn (£222bn) of debts and…",
  "data/reddit-stocks/r/investing/comments/rucgh4/2022_tesla_nio_and_lucid_what_to_expect.json": "Source: TheStreetTesla\n\nAfter a rocky 2020 for the entire auto industry, electric vehicle sales\nrebounded in 2021 amid high demand for vehicles and a shortage of actual cars to\nbuy. Tesla, to be fair, never really suffered the way many traditional\nautomakers did. The EV-maker led by CEO Elon Musk…",
  "data/reddit-stocks/r/Bogleheads/comments/ruh4m5/how_can_i_put_6k_in_my_roth_for_2022_already.json": "If the Roth is for post-tax earned income, I certainly haven't earned $6,000\nfrom employment by January 2d, and I don't believe many here have as well.\n\nIn fact, I haven't been paid a single penny for 2022 and won't for another week\nor so. So isn't plunking down the entire $6k this week a form of…",
  "data/reddit-stocks/r/Bogleheads/comments/rukdxn/confused_about_bond_returns.json": "I understand the relationship between yield and prices. Yields move up, prices\ngo down and vice versa. But, if for example, I buy a bond at $100 yielding 5%\nand the price goes up to $105, why is that a negative thing? You can sell your\nbond for more than you bought it for, isn’t that the point of…",
  "data/reddit-stocks/r/Bogleheads/comments/rufiyc/should_i_keep_buying_more_voo.json": "Hello everyone and Happy New Year!\n\nI have a question, back in May 2021 I finally started investing in Index Funds\n(M28), I invested $2,500 into my 2020 Roth IRA an then another ~$4,000 into my\nRoth IRA 2021.\n\nMy current portfolio is 10 VOO and 5 VTI, I started buying VTI and then I\nrealized how…",
  "data/reddit-stocks/r/Bogleheads/comments/ruhgq5/bnd_for_home_savings.json": "Is it crazy to use BND for home savings? Late 20's planning to purchase our\nfirst home in the next 5-7 years with a minimum goal of $100k for the\ndown-payment. We have ~$50k cash in savings for this purpose right now and are\ntrying to determine the best place to keep/add money while we save. At…",
  "data/reddit-stocks/r/Bogleheads/comments/ruedri/if_you_have_15k_in_bank_account_how_much_would.json": "I’ve always been told, you only need emergency money. Well, I want to invest\naggressively since I’m still under 25 years old and live with my parents.\n\nHow would you allocate 15k?\n\nETFs, Stocks, Crypto, Bonds, Savings account..",
  "data/reddit-stocks/r/stocks/comments/ruu8xz/i_want_to_short_the_company_i_used_to_work_for.json": "Left a tech company about 8 months ago for a new one because they offered double\nmy old salary. Ive always had misgivings about the previous company and have\nwanted to short them since I worked there. Obviously couldnt short it when I\nworked there, but is there a period of time that has to pass…",
  "data/reddit-stocks/r/stocks/comments/rv2lhp/feeling_like_a_complete_and_total_idiotshould_i.json": "Hi all- I should have made this post a long time ago...\n\nLast year (around the early stages of the GME debacle) I got more and more into\nbuying/selling stocks. Sadly, I am not cut out for this and made some very poor\nchoices- down about 25% on the year while the rest of the market is up that…",
  "data/reddit-stocks/r/Bogleheads/comments/rv28yo/if_your_lifestyle_matchesor_god_forbid.json": "Not native english speaker. What does this saying actually means?",
  "data/reddit-stocks/r/Bogleheads/comments/ruree7/rbogleheads_what_are_your_thoughts_on_post_flairs.json": "It's been in the back of my mind for a while to add post flairs as a way to\ndistinguish things like questions, articles, links to the forum and so on. So\ntoday, I added some flairs to my own posts and a few others to try it out.\n\nTo be clear: we (mods) don't have any plan to make flairs mandatory…",
  "data/reddit-stocks/r/Bogleheads/comments/rv6jlw/i_feel_really_poor_just_by_reading_other_pplposts.json": "I am in my late 30s living in Munich, Germany, up until now I was living alone\nand recently I started investing in ETFs. So far so good, but my overall net\nworth is about 130K with a bit over 100K in ETF and I am reading constantly\nabout people having a lot bigger savings than mine, even though I…",
  "data/reddit-stocks/r/Bogleheads/comments/ruyp7z/roth_401k_vs_regular_401k.json": "Company started offering Roth 401k. Would it make sense to do Roth than regular?\nI know my tax rate now but have no idea what taxes will be in say 15-20 yrs when\nI will retire. Either way money just goes to index funds in 401 that are being\noffered",
  "data/reddit-stocks/r/stocks/comments/rv92bv/apple_hits_3_trillion_market_cap_becoming_the.json": "https://finance.yahoo.com/news/apple-hits-3-trillion-market-cap-184825195.html\n\n“Apple (AAPL) officially has a market capitalization of $3 trillion. The tech\ngiant passed the $182.86 mark Monday, making it the first publicly traded\ncompany in history to hit such a market valuation. Shares were…",
  "data/reddit-stocks/r/investing/comments/rv62i9/is_it_a_good_idea_to_use_roth_ira_for_swing.json": "Hello!\n\nI’m a 27 year old who just started contributing to a Roth IRA in March of 2021.\nI make enough to max out my Roth every year and save some on the side in an\nindividual brokerage account (currently approx $12K in Roth and $7K in\nindividual with consistent disbursements to individual…",
  "data/reddit-stocks/r/investing/comments/rva43k/avoid_paid_signal_bots_services_esp_rick_rahim.json": "After learning this lesson the hard way, I'm hoping this post will save a few\nother people some money and time.\n\nLast week I paid for a Lifetime Membership to Rick Rahim's ProChartSignals.com\n($1,699). It was supposed to include custom signal indicators, lots of\neducational material, information…",
  "data/reddit-stocks/r/investing/comments/rvc5sz/is_there_any_point_to_a_non_deductible_ira_if_the.json": "Long story short, I’m a high earner who is beyond the limit for a traditional\ndeductible IRA and beyond the limit to contribute directly to a Roth IRA.\n\nThinking ahead to 2023, I’m envisioning a world where the backdoor and mega\nbackdoor Roth options are gone.\n\nThat leaves me with maxing my 401k…",
  "data/reddit-stocks/r/Bogleheads/comments/ruwd8l/why_do_stock_prices_always_grow_long_term.json": "Why do stock prices always go up?? Isn’t the projected future earnings baked\ninto today’s pricing? If yes, what kind of unforeseen things are causing future\nearnings to outpace today’s expectations? And if that’s such a common thing, why\nisn’t that also already baked into the price today? I guess…",
  "data/reddit-stocks/r/stocks/comments/ruypug/rstocks_daily_discussion_monday_jan_03_2022.json": "These daily discussions run from Monday to Friday including during our themed\nposts.\n\nSome helpful links:\n\n * Finviz [https://finviz.com/quote.ashx?t=spy] for charts, fundamentals, and\n   aggregated news on individual stocks\n * Bloomberg market news [https://www.bloomberg.com/markets]\n *…",
  "data/reddit-stocks/r/Bogleheads/comments/rvce0c/beginners_guide.json": "I’m 30 and doing pretty well now maxing out my 401k have a house and I’m\nstarting to get too much money in my bank account that I feel like I’m losing\nmoney for it being there. Is there a step by step guide on safe options? I have\nno clue on what to do and never thought I’d be in the situation I am…",
  "data/reddit-stocks/r/stocks/comments/rv9xso/are_there_any_positions_that_have_sentimental.json": "My grandpa set up an account for me and got me into investing at a young age. It\nwas something he’d always try to teach me more about. He’d explain in basic\nterms by telling me a pretty good company usually has a lot of customers. Yes\nthat’s not always the case but mind you I was like 6 years old,…",
  "data/reddit-stocks/r/stocks/comments/rvcp6o/here_is_a_market_recap_for_today_monday_january_3.json": "PsychoMarket Recap - Monday, January 3, 2022\n\nDisclaimer: There will be no market recap tomorrow since I will be travelling\nback to my home after the holidays.\n\nStocks rose in the first trading session of the year as the three major indexes\ncontinued to hover near record-highs, building on the…",
  "data/reddit-stocks/r/stocks/comments/rvgznt/a_regret_as_an_investor.json": "When I look at what F has done this past year, I think I’ve learned some\nvaluable lessons:\n\n 1. If you believe in a stock and have researched it, stay the course- sold off\n    F when it was $8 and before the Mngmt change!\n\n 2. Think mid to long term and keep emotions out of if it!\n\nDoes anyone else…",
  "data/reddit-stocks/r/investing/comments/rvi2rc/business_wants_to_build_to_suit_on_our_landwhat.json": "Fast food restaurant wants to either purchase 0.6 acre or we build to suit.\n\n1,200 sq. Ft building, they pay for FF&E. They guesstimate a total of $450K to\nbuild. Said they would like to keep initial total investment below $1million.\n\nWould pay us ~$8,000/month(they said low 8’s) for 10 years, then…",
  "data/reddit-stocks/r/Bogleheads/comments/rv472f/is_there_a_simple_way_to_transfer_funds_from_a.json": "The expense ratio is lower on the ETF for some reason, so I don't see why I\nwouldn't own it instead of the index fund. Is there an easy way to transfer my\nmoney from one to another without having to pay taxes on my gains thus far?\nThank you.",
  "data/reddit-stocks/r/Bogleheads/comments/rv0crv/compound_frequency.json": "The concept of compound interest is simple enough but I’m pretty confused on the\neffects of compound frequency. I have also found very little information on how\noften your portfolio on a vanguard managed fund compounds. Could somebody help\nme out with this?",
  "data/reddit-stocks/r/stocks/comments/rvfn4s/new_job_new_pay_what_do_i_do_now.json": "I went from a job that paid 68k to a new job paying 130k. And just like that my\nwife and I are able to save roughly 4-5k a month. We have debt but I am looking\nat investing the money and then paying off debt. I don’t want to put everything\ninto stocks but I think it’s a must now that we have some…",
  "data/reddit-stocks/r/Bogleheads/comments/rvhmon/target_retirement_funds_worse_than_100_equities.json": "Background: I'm a 21-year-old investor.\n\nI'm deciding where to put my money and I think I've got it narrowed down between\na 100% equities fund and a target date fund with the retirement year at 2060. I\nwanted to see which is a better bet.\n\nI've known about FIRECalc since last summer. It's a really…",
  "data/reddit-stocks/r/stocks/comments/rvd0k9/visa_v_vs_paypal_pypl.json": "Why is Visa (V) is a better stock to buy than PayPal (PYPL) right now\n\n(This is also my first stock analysis so please leave some tips on what I can do\nbetter)\n\nI have recently many people comment on the recent sell of in PayPal and visa,\nPayPal being the more drastic dip. This recent dip makes…",
  "data/reddit-stocks/r/stocks/comments/rv7ed6/i_cant_find_anything_i_want_to_invest_in_these.json": "I can’t find any stocks worth buying\n\nI’m at the point where I’d rather sit in cash than buy stocks at this time.\nEvery stock I look at has a P/E of 30-40, and often into the hundreds. I see\nthat PSEC has a less than 4 P/E ratio and pays a great dividend, so that’s\ntempting, but I still see it as…",
  "data/reddit-stocks/r/Bogleheads/comments/rvbz1v/poor_customer_service.json": "Vanguard clearly cannot provide a 5-star level of customer service. I've been\ntrying for 4 days to talk to someone about an RMD in-kind transfer but they just\nkeep me on hold with the same repeating message to find the answers at their\nwebsite. Their Facebook moderator said this is a question that…",
  "data/reddit-stocks/r/Bogleheads/comments/rvcyle/how_do_you_track_your_investments.json": "I started out dumping money into investment accounts years ago with no record\nkeeping beyond account numbers. A few years ago I started to track transactions\nin notepad files but, in hindsight, what I have isn't very helpful. As my\nbalances have grown, my need for accurate tracking has also grown,…",
  "data/reddit-stocks/r/stocks/comments/rv61vc/any_other_frustrated_sofi_investors_out_there.json": "I just noticed the short interest for SOFI ticked up to just over 9%. I\ngenerally stay away from stocks that are near or above 8-10% short. This may be\ndue to the recent extension of the student loan payback moratorium. SOFI is my\nlong term growth play, so Im sitting tight. But if that short…",
  "data/reddit-stocks/r/Bogleheads/comments/rvlij7/whos_actually_invested_in_the_bond_equivalent_of.json": "I love Jack Bogle’s philosophy. I love the Boglehead’s Guide to Investing. But\nit’s tough for me to recommend to a 25 year old that they place 25 percent of\ntheir money in bonds when they have 40 years until retirement. Do you all\nactually do this?",
  "data/reddit-stocks/r/stocks/comments/rvl29n/what_is_your_favorite_stock_going_into_2022.json": "I am timid of TSLA and NVDA, although they seem to be the premiere securities of\nthis time. I am aware of stocks like VISA selling at a discount. COST seems like\na safe investment with ample opportunity. This is the stock I will probably\nbegin to analyze in contrast to companies like Walmart and…",
  "data/reddit-stocks/r/stocks/comments/rvttw3/im_going_to_be_buying_150_each_week_of_different.json": "Complete idiot here. I’m saving up money to move in with my girlfriend at the\nend of July. $135 a week is about what I would need, but in case I mess up I’m\ngoing to be putting $150 into it. I currently make about $2,000 a month working\nat a gas station. I’m going to DoorDash for a 2nd job while…",
  "data/reddit-stocks/r/stocks/comments/rvvzfr/ford_plans_to_nearly_double_production_of_its_new.json": "https://www.cnbc.com/2022/01/04/ford-plans-to-nearly-double-production-of-its-new-all-electric-f-150-lightning-pickup.html\n\nFord on Tuesday said it plans to nearly double annual production capacity of its\nupcoming electric F-150 pickup to 150,000 vehicles per year at a plant in\nMichigan.\n\nThe…",
  "data/reddit-stocks/r/investing/comments/rvvght/if_you_are_not_100_stocks_what_bond_funds_do_you.json": "More money is invested in bond funds than stocks but you would never know it by\nreading this board.\n\nIs anyone here invested in either BOND ETFs or Bond Mutual Funds?\n\nIf so what funds are you invested in? I am old so it is not a good idea to be\n100% in stocks. So I put 40% of my invested assets in…",
  "data/reddit-stocks/r/Bogleheads/comments/rvvzjf/thinking_of_buying_a_house_within_2_years_best.json": "Hey fellow Bogleheads, I’ll keep it short and sweet. I’m thinking of buying a\nhouse within the next two years and am looking for a way to efficiently store\nmoney and not have to pay a fat gains tax once I sell. Any thoughts? I’ve heard\nof iShares and obviously T-bills, but not sure if anyone has…",
  "data/reddit-stocks/r/wallstreetbets/comments/rvuzw8/should_you_listen_to_jim_cramer_i_analyzed_20000.json": "Jim Cramer has made 21,609 stock picks in the past 5 years! Let that sink in for\na moment. Here is one person, making buy/sell/hold recommendations on more than\n2,200+ different stocks across all types of industries. On average, he was\nmaking more than 20 picks per episode of his show [1]. This is…",
  "data/reddit-stocks/r/stocks/comments/rvx9sn/should_i_cut_my_losses_in_growth_stocks_and_dump.json": "My portfolio is heavy growth stocks. It isn't stuff like weed stocks and SPACs.\nIt is stuff like ETSY, SHOP, SQ, PYPL, CRWD, MRNA, SE, and NET.\n\nQuite a few of those stocks had such positive sentiment. Now it is disappeared\nand people are saying stuff like they will buy those stocks at prices that…",
  "data/reddit-stocks/r/stocks/comments/rvkitb/sell_mega_caps_msft_and_aapl_buy_back_in_lower.json": "AAPL is 6.7% of my portfolio. My cost basis is $103 a share. I now have a 76%\ngain in AAPL .\n\nMSFT is now 9.4% of portfolio. Cost basis $211.\n\nThe shares are mostly long so I could trim.\n\nI know most say \"let your winners ride\", but isn't part of a winning long term\nstrategy to sell when at all…",
  "data/reddit-stocks/r/Bogleheads/comments/rvw2tt/which_etfs_to_buy.json": "Hello everyone, Long time lurker of the subreddit and have started reading the\ncommon sense investing red book. I'm convinced that low-cost ETFs and index\nfunds would be the ideal investment instruments for me but I'm not sure about\nwhich ones to buy.\n\nI am aware of the 3 fund strategy of 1 SP500 /…",
  "data/reddit-stocks/r/Bogleheads/comments/rvelwl/maxing_roth_vs_traditional.json": "Is there a point where it's advantageous to go with Roth over traditional when\nmaxing out a 401k? (and HSA + IRA).\n\nWhat I'm getting at is that saving 20.5k in a Roth is effectively saving more\nthan you could in a traditional since the tax has already been accounted for.",
  "data/reddit-stocks/r/Bogleheads/comments/rvx98i/does_dont_panic_and_sell_apply_to_bonds.json": "Hello, i’m wondering if the advice/directive to not sell during a market\ndownturn a.k.a. bear market applies to equities as well as bonds. I Keep quite a\nlarge percentage of bonds versus equities for my age because I do not have a\nlarge income and I see those bonds as a safety net if we do have a…",
  "data/reddit-stocks/r/Bogleheads/comments/rvzrzr/it_literally_doesnt_matter_which_of_the_common.json": "According to vanguard's website, a $10,000 investment made 10 years ago in VTSAX\nand a $10,000 investment made 10 years ago in VOO only amounts to a $30\ndifference today. Don't stress yourself out trying to decide between VOO and\nVTSAX, or between any two of their \"rest of the US market funds\" or…",
  "data/reddit-stocks/r/stocks/comments/rvxxgx/cloudflare_and_crowdstrike_2022_outlook.json": "I’ve been holding these two for a little while now and in the past few months\nthey’ve been completely disappointing and considering selling and shifting into\nother positions. The thing is, I do believe that they are good companies, I just\ndon’t know if they’re great stocks right now. Is there any…",
  "data/reddit-stocks/r/Bogleheads/comments/rvxi3o/did_i_choose_the_wrong_index_fund.json": "Hi guys,\n\nSo my wife and I finally got smart enough to start putting some money into Index\nfunds. Started about half a year back and now have about 16k in it. But...\nlooking at it - it seems we might have chosen the wrong Index fund - FZILX. I\njust looked at it over the last 5Y and it only grew…",
  "data/reddit-stocks/r/investing/comments/rvxbr4/annoyed_with_vanguards_ui_am_i_missing_something.json": "My chief (and really only) complaint with Vanguard is their website interface.\nFor example, they have a super nice chart under their \"performance\" tab.\nHowever, it seemingly will only show the performance of all accounts you have\nwith Vanguard.\n\nMore often than not, I want to see the performance of…",
  "data/reddit-stocks/r/stocks/comments/rw590a/i_truly_must_have_been_one_of_the_worst_investors.json": "I picked truly the very worst sectors possible, pot stocks, China stocks, growth\nstocks and tech stocks. Im completely destroyed and will never be able to\nrecover. I guess thats why they say 90% of retail traders lose in the end.",
  "data/reddit-stocks/r/stocks/comments/rvx6on/is_f_a_growth_stock_now.json": "I’ve been following Ford for roughly 4 years now and it usually sat around\n$9-$12 and never below or above (with the exception of 2020 correction, it hit\nbelow $4) and now it’s up nearly 200% since 2020 and started issuing a dividend\nagain. What’s driving the price so high?",
  "data/reddit-stocks/r/wallstreetbets/comments/rw3qgq/i_traded_over_286_million_dollars_in_2021.json": "Started the year at 45k, yolo’d into GME and sold the top perfectly, hit 350k in\nearly February.\n\nThen in a series of bad decisions I yolo’d into SPAC warrants and lost all my\ngains and more. My portfolio hit 38k in June.\n\nMy next move was to yolo into TELL calls and I rebounded to 150k in…",
  "data/reddit-stocks/r/stocks/comments/rvzsb2/is_sony_undervalued.json": "I've been holding SONY for a little less than a year now and am up sizably, but\nI still can't help like this company flies dramatically under the radar.\n\nThey:\n\n * make cameras for the iPhone\n   [https://www.google.com/url?sa=t&rct=j&q=&esrc=s&source=web&cd=&cad=rja&uact=8&ved=2ahUKEwjS…",
  "data/reddit-stocks/r/Bogleheads/comments/rvy04a/wait_so_after_roth_maxed_rest_goes_into.json": "I’ve learned a ton in the last year, especially with you guys. I never asked and\ndon’t understand,\n\nAfter maxing out your ROTH, do you start putting the rest of your contributions\nif you have any into the traditional ROTH or into the brokerage account ?\n\nWhy?",
  "data/reddit-stocks/r/stocks/comments/rw5nm7/charlie_mungers_daily_journal_nearly_doubles.json": "The Daily Journal held 602,060 American depositary shares in Alibaba at\nyear-end, up from 302,060 as of Sept. 30, according to a regulatory filing\nTuesday. The company’s other investments, such as its Wells Fargo & Co. and Bank\nof America Corp. bets, were…",
  "data/reddit-stocks/r/stocks/comments/rw2ji9/nvidia_amd_apple_microsoft_alphabet_are_these.json": "Nvidia, AMD, and Apple were honestly some of my best performing stocks in 2021.\n\nI also purchased some 3x Leveraged Nvidia and Apple shares last year for an\nexperiment and at one point I was up nearly 900% with Nvidia (now it's just 500%\ndue to the recent price fall).\n\nNow since I already have over…",
  "data/reddit-stocks/r/stocks/comments/rw4xbx/i_truly_must_have_been_one_of_the_worst_investors.json": "I picked truly the very worst sectors possible, pot stocks, China stocks, growth\nstocks and tech stocks. Im completely destroyed and will never be able to\nrecover. I guess thats why they say 90% of retail traders lose in the end.",
  "data/reddit-stocks/r/stocks/comments/rwazte/so_what_happens_after_ive_waited_2_decades.json": "Currently 18, I was always interested in stocks and the number one thing I've\nheard across all these subreddits/youtube/tik tok/ boards is to \"Buy VOO/blue\nchips and then wait. Just wait decades and you'll see the results\".\n\nAnd I wholeheartedly believe and understand that. I have like $900 in VOO…",
  "data/reddit-stocks/r/Bogleheads/comments/rwff4o/im_deeply_shocked_to_learn_that_the_main.json": "Dividends are (of course) a significant contributor to long-term stock returns,\nbut as I was looking at the main dividend-oriented subreddit today I was\ngenuinely at a loss for words when I read one of their basic rules:\n\n> The question of taxes often comes up a lot in investing communities, and\n>…",
  "data/reddit-stocks/r/stocks/comments/rwe392/gm_sold_26_evs_in_q4_also_dethroned_by_toyota_on.json": "https://www.reuters.com/business/autos-transportation/toyota-poised-\n\n * Total Q4 EV sales: 26\n\n * Silverado slips to third best selling vehicle\n\n * Lost 90 year crown for yearly sales to Toyota\n\n * All Bolt EVs ever made were recalled due to risk of fire. They had to ask\n   customers to not park…",
  "data/reddit-stocks/r/wallstreetbets/comments/rw6t0k/users_who_did_not_create_their_account_in_the.json": "Honestly want to hear the take from legitimate users so I'm sorry for the bias\nto older accounts but there has been too much bs activity from newer accounts\never since GME exploded so let's just try and have an honest conversation that\ncontrols for that variable.\n\nI am writing more here to expand…",
  "data/reddit-stocks/r/stocks/comments/rw8xyu/your_top_etf_picks_for_2022.json": "What are your top 5 ETF picks for 2022 and why?\n\nMy picks so far:\n\nSMH - semiconductors\nSOXQ - semiconductors\nFINX - Fintech\nNEA - Tax Exempt Municipal Bonds\nPAVE - Infrastructure\n\n2022 seems like it'll be another good year for semiconductors. For Fintech there\nseems to be a lot of stuff brewing…",
  "data/reddit-stocks/r/investing/comments/rwgf6b/dollarcost_average_my_ira_or_just_jump_in.json": "So I've been waiting for the new year so I can max out my IRA again. Now that I\nhave fresh funds waiting to be invested, I'm wondering if I should just buy my\nusual allocations, or dollar-cost average in and buy gradually?\n\n\"Time in the market > timing the market\" leads me to believe it's best to…",
  "data/reddit-stocks/r/Bogleheads/comments/rwjdbp/ive_inherited_6_million_dollars_help_i_dont_want.json": "My father passed away on thanksgiving and has left me and my sibling 6 million\ndollars each. About 33% is in SPY, with huge gains. 20% is in bonds (BND) and\nstraight up cash. The rest is in individual stocks with many having large gains\n(nvidia, AMD, Apple, MSFT).\n\nI’d like to switch to a more…",
  "data/reddit-stocks/r/stocks/comments/rwjfwr/how_come_cnbc_commentators_can_own_the_stocks.json": "I heard that Jim Cramer can't own stocks directly but can via his charitable\ntrust. Ok.\n\nHow come Jim Lebenthal, Josh Brown, Joe Tarrenova, and most others can own and\nrecommend their own stovks then?\n\nAnd then one CNBC host (Brian Sullivan) said \"it's one of the few stocks that we\ncan own, as…",
  "data/reddit-stocks/r/stocks/comments/rwavkf/sony_announces_second_visions_ev_modell_new.json": "SONY will build its own EV cars.\n\n“The excitement we received after we showed off the Vision-S really encouraged\nus to further consider how we can bring creativity and technology to change the\nexperience of moving from one place to another,” said Yoshida, before revealing\nthe new Vision S SUV…",
  "data/reddit-stocks/r/stocks/comments/rwl6qe/ubs_downgrades_salesforce_slashes_price_target_by.json": "> UBS analyst Karl Keirstead downgraded Salesforce.com Inc  - to Neutral from\n> Buy with a price target of $265, down from $315. The price target implies an\n> upside of 6.7%.\n> \n> After speaking to large enterprise IT executives and services partners of\n> Salesforce, the analyst is concerned that…",
  "data/reddit-stocks/r/investing/comments/rwl0aq/what_are_your_predictions_for_top_performing.json": "What are the raw materials? Financials? Healthcare? Tech? Cyclicals?\n\nIn light of the impending taper, I'm leaning toward more \"boomer\"-type equities\nnext year rather than technology. If another opportunity arises, I will increase\nmy exposure to cyclicals and re-opening trades, as well as to tech…",
  "data/reddit-stocks/r/stocks/comments/rwmgjk/hyundai_heavy_industries_palantir_to_build_new.json": "Hyundai Heavy Industries and US company Palantir Technologies will work on\nbuilding a new big data platform, the companies said Wednesday. \n\nThe two firms clinched a partnership in Las Vegas a day before the official\nkickoff of the CES 2022. The deal is reportedly valued at above $25…",
  "data/reddit-stocks/r/stocks/comments/rwhc9w/a_lot_of_fellow_redditors_here_should_consider.json": "The S&P500 returned about 28% in 2021. I'd love to know what percentage of\nredditors here beat that. You can achieve those gains with virtually no time\ncommitment...just DCA into VOO or something similar.\n\nThat being said, obviously this is r/stocks [/r/stocks] and investing in stocks\nis much more…",
  "data/reddit-stocks/r/investing/comments/rwpjo0/would_anyone_be_interested_in_a_tool_that_lets.json": "I'm a developer and was thinking of building something like this using the API\nto a few brokerages. So the idea is the tool would allow you to define criteria\nfor your index(market cap, industry, p/e and p/b, etc) and form it, then allow\nyou to make adjustments as needed.\n\nFrom there, the tool…",
  "data/reddit-stocks/r/stocks/comments/rwtx8c/bye_bye_aapl.json": "I am disgusted the valuation for an overhyped company selling hot air. So, I\ndecided to put an end to it and bought 10 AAPL at $182. It's working! AAPL is\ndown to $178 today. Rest assured we'll see double digits soon.\n\nIf things go well, I might follow up and buy 1 or 2 TSLA...",
  "data/reddit-stocks/r/stocks/comments/rwuf6k/why_i_raised_my_rklb_price_target_to_7090_longterm.json": "Raising my long term price target on RKLB to $70. The more research I do on this\ncompany, the more I think it can go to $70-$100 within a few years. That’s a\n$30-$40 billion valuation by then. I really think that is possible given how the\nvalue premium attached to a successful launch track record…",
  "data/reddit-stocks/r/investing/comments/rwtr9t/intel_intc_stock_pops_on_upgrade_to_outperform_at.json": "https://www.streetinsider.com/Analyst+Comments/Intel+%28INTC%29+Stock+Pops+on+Upgrade+to+Outperform+at+Northland/19421880.html\n\nNow they're getting it. It was intensely obvious to me that Intel was extremely\nundervalued at 9-10x PE as a key provider in the growing cloud and edge space\nalready, and…",
  "data/reddit-stocks/r/stocks/comments/rwjuvg/rstocks_daily_discussion_wednesday_jan_05_2022.json": "These daily discussions run from Monday to Friday including during our themed\nposts.\n\nSome helpful links:\n\n * Finviz [https://finviz.com/quote.ashx?t=spy] for charts, fundamentals, and\n   aggregated news on individual stocks\n * Bloomberg market news [https://www.bloomberg.com/markets]\n *…",
  "data/reddit-stocks/r/stocks/comments/rwwav3/what_is_going_on_with_the_market.json": "Bro Im like 20% in red since last year and still nose diving down. I didnt want\nto sell at a loss but god damn Im depressed to see my portfolio. Im in between\non just shutting my monitor off for the next year or sell everything and stop my\nloss and wait till the market chills for a bit. I keep…",
  "data/reddit-stocks/r/investing/comments/rwx4u6/federal_reserve_minutes_released.json": "For those wondering why there was a broad market sell off this afternoon, the\nFederal Reserve released the minutes of the December 14-15 FOMC meeting at\n2:00pm ET.\n\nThe transcript for the minutes can be found here - The Fed - Monetary…",
  "data/reddit-stocks/r/wallstreetbets/comments/rwv86i/remember_january_2021_pepperidge_farm_remembers.json": "Hi everyone, bob here.\n\nI posted this same data yesterday (with less detail) and have gotten a tidal\nwave of requests from fellow apes to repost for visibility, so here I am\nreposting an update to the update on FTDs…",
  "data/reddit-stocks/r/stocks/comments/rwmvgw/private_job_growth_totals_807000_in_december_more.json": "https://www.cnbc.com/2022/01/05/adp-december-2021.html\n\n-Private job growth totaled 807,000 for the month, well ahead of the Dow Jones\nestimate for 375,000 and the November gain of 505,000 according to ADP.\n\n-Hiring was broad-based, though leisure and hospitality led with 246,000 new\npositions.\n\n…",
  "data/reddit-stocks/r/stocks/comments/rwym1r/here_is_a_market_recap_for_today_wednesday.json": "PsychoMarket Recap - Wednesday, January 5, 2022\n\nSorry, there was no recap yesterday, I spent all day traveling back home after\nspending holidays/ New Year back with friends and family. Unfortunate how the\nmarket performed while I was gone\n\nThe stock market sank on Wednesday, pressured by a sell…",
  "data/reddit-stocks/r/wallstreetbets/comments/rwshrf/millionaire_or_bust.json": "I turned $261,115 into $101,822 in 2021.\n\nMy portfolio\n\n * I have $24k in meme coins\n   * Heavily weighted to LRC\n * $75k in GME\n   * 100% DRS'd with ComputerShare.\n * $2,800 in options contracts.\n   * 3 $300 1/21 calls on GME\n   * 15 $30 1/21 calls on SPXS\n   * 5 $300 1/28 calls on GME\n   * 1 $200…",
  "data/reddit-stocks/r/Bogleheads/comments/rwsffr/should_i_sell_my_entire_dividend_portfolio_to_buy.json": "Hey everyone. I'm 29yo, started investing in mid-2020 with a long time horizon\nof 20+ years. When I started investing I put together a dividend portfolio of\ndividend kings/aristocrats and have been DCAing since.\n\nA few months later, I read A Simple Path to Wealth and started indexing to the\npoint…",
  "data/reddit-stocks/r/stocks/comments/rwxyd5/the_perfect_time_for_long_term_investors_to_buy.json": "Since Feb 2021, at that first sniff of inflation and the prospect of interest\nrate rises, growth stocks have seen a continual and quite brutal decline with\nmany well over 50% down from their ATH's and some even as far as 80%.\n\nIf you go back in time to a year ago today, these boards were full of…",
  "data/reddit-stocks/r/Bogleheads/comments/rwr1sr/shell_shocked.json": "Hello! I've been converting my holdings to a boglehead approach after losing 20%\nlast year. It was my first year investing and my portfolio looked like something\nstraight out of a wsb thread. In fact our only gains came from my wife's 401k\nemployer plan (2055 tdf).\n\nSo far I've converted my sep ira…",
  "data/reddit-stocks/r/stocks/comments/rx3i2u/cathie_woods_ark_etfs_are_in_a_deep_holealready.json": "https://www.barrons.com/articles/ark-etf-funds-performance-51641424042\n\nThe new year didn’t bring a fresh start for Cathie Wood’s ARK Invest, a fund\ncompany known for its focus on innovation stocks and high price targets.\n\nThe firm’s flagship ARK Innovation exchange-traded fund (ticker: ARKK)…",
  "data/reddit-stocks/r/stocks/comments/rwzwxx/uber_is_a_shit_company.json": "https://wtop.com/virginia/2022/01/uber-rider-stuck-on-i-95-hit-with-600-bill/\n\n--------------------------------------------------------------------------------\n\n\"Andrew Peters, from Richmond, Virginia, not only got stranded on the highway\nbut was also hit with a massive Uber bill... Peters made it…",
  "data/reddit-stocks/r/stocks/comments/rx4fy5/wondering_why_stocks_are_redtraders_are_worried.json": "Bernanke had the same issues at the end of 2008. Go pull up a chart and compare\nequity markets to a decline in the Fed’s balance sheet then:\nhttps://www.federalreserve.gov/monetarypolicy/bst_recenttrends.htm\n\nWelcome to the world of debt monetization, where the government buys its own\ndebt en…",
  "data/reddit-stocks/r/investing/comments/rx6iwz/investors_should_understand_warren_buffett_and.json": "Benjamin Graham was Warren Buffett's mentor during his time at Columbia\nUniversity, and Warren Buffett subsequently went to work for Graham as well.\nFrom time to time, Warren Buffett often references various aspects of investing\nthat he learned while under the wings of Graham. According to Buffett…",
  "data/reddit-stocks/r/wallstreetbets/comments/rx5jzt/were_all_about_to_get_royally_fucked.json": "As a surgical resident at a major city hospital, I suspect the CDC knows\neveryone is going to get omicron in the next 2-4 weeks.\n\nThe CDC reduced the recommended quarantine for asymptomatic Covid positive\nhealthcare worker to 5 days REGARDLESS OF A NEW POSITIVE COVID TEST without\nciting sufficient…",
  "data/reddit-stocks/r/Bogleheads/comments/rxa5do/i_think_some_folks_here_are_missing_the_best.json": "The return on the amount of time you invest in investing. When you’re fully\ncommitted to VTSAX and chill (or VTI, VT, whatever), that’s it, you’re done.\n\nYou don’t have to do any company or stock DD, you don’t have to watch or listen\nto financial news or follow the charts. Just buy and hold and do…",
  "data/reddit-stocks/r/wallstreetbets/comments/rwxmz5/loss_and_loss.json": "Hi my fellow retards, today I resign from my trading habits, I've lost over 20k\nover the last 2 months and have over 50k in debt with no more savings, I tried\nlearning how to trade and to be patient but happen to be retarded and can't do\neither, thank you for all the ups and downs, but now I must…",
  "data/reddit-stocks/r/stocks/comments/rx4d1b/im_no_financial_advisor_but_be_measured_in_your.json": "Obviously, those of you with a near endless supply of dry powder can ignore this\npost. I'm talking to those of you, like myself, that try to keep a small amount\nof cash (e.g., 5%-20%) for buying moments. Right now, I'm thinking about SHOP,\nQQQ, and GOOG.\n\nHowever, I think there is still room for a…",
  "data/reddit-stocks/r/stocks/comments/rx6l98/why_is_the_fed_taper_and_interest_rates_rising.json": "The fed essentially said the economy is strong and near maximum employment so\nthey relax on the stimulus. Why is this such a big deal that leads to market\nsell offs/bear markets? Will higher interest rates and tapering suddenly cause\nevery company in the s&p 500 to be unprofitable?",
  "data/reddit-stocks/r/wallstreetbets/comments/rxcheq/were_in_a_bubble_folks.json": "Currently sitting in an Apple Store about to spend some tendies and I’m\noverhearing a convo between two Apple employees.\n\nOne is explaining the concept of leverage stating that you can x10 on a trade\nand is explaining the only thing you could lose during a margin call is the\nupfront cash you put…",
  "data/reddit-stocks/r/Bogleheads/comments/rx4hkn/comparing_impact_on_fed_minutes_on_bnd_versus_vti.json": "A lot of posts the last few weeks about the impact of rising rates on Bonds. I\nasked “Define what a bond crash looks like.” @misnamed said “If you think rising\nrates hit bonds hard, wait until you see what happens to stocks.”\n\nToday we got a bit of a preview. Fed minutes were released today showing…",
  "data/reddit-stocks/r/stocks/comments/rx4lrn/beyond_meat_bynd_is_officially_the_10th_most.json": "https://www.marketwatch.com/tools/screener/short-interest\n\nRoughly 21 out of the 56 million float are being shorted. This means about 40%\nof its shares are being shorted.\n\nSome other stats, Beyond meat has grown its revenues from $30 million in 2017 to\nover $400 million in 2020. Its market cap…",
  "data/reddit-stocks/r/stocks/comments/rxcq3y/which_overpriced_stocks_are_you_most_bearish_on.json": "With the increasing rates, growth overpriced companied with terrible\nfundamentals are going to have a very bad time, for now.\n\nInstead it's wiser to invest in solid companies with strong foundation.\n\nThe problem is, those weak fundamentals companies have also fallen recently,\nthus shorting them is…",
  "data/reddit-stocks/r/stocks/comments/rwza0q/for_those_whove_been_investing_for_a_while.json": "A week ago I decided to finally begin investing. I’ve been steadily losing money\nsince but just TODAY I lost $1600 between my Alphabet, Microsoft, and Roblox\nshares.\n\nIt really feels like a gut punch but obviously I will continue to hold since\nthis is a long term investment.\n\nI guess advice or…",
  "data/reddit-stocks/r/stocks/comments/rxhxie/an_sp_500_bear_full_teardown.json": "THE LAST FEW WEEKS IN THE S&P500 HAVE BEEN A BIT OF A ROLLER-COASTER RIDE\nDECLINING JUST OVER 5% IN A 8 DAY PERIOD AND SUBSEQUENTLY MAKING SEVERAL NEW ALL\nTIMES HIGHS OVER THE FOLLOWING 15 DAY PERIOD.\n\nYour analysis suggests you should want to be bearish the S&P500. You are pretty\n(**extremely**)…",
  "data/reddit-stocks/r/stocks/comments/rxjuoe/payment_apps_must_report_payments_of_600_or_more.json": "Your thoughts on how this will affect user growth.\n\n\n\n\nlink: https://finance.yahoo.com/video/venmo-paypal-cash-app-must-191900276.html\n\n\n\n\n\"New year, new tax requirements. The Internal Revenue Service (IRS) is cracking\ndown on payments received through third-party apps like Venmo, PayPal and…",
  "data/reddit-stocks/r/Bogleheads/comments/rxh2b1/2021_etf_inflows_hit_900b.json": "Vanguard has 6 ETFs in the top 10. VT only had 6,337.13mm in inflows for 2021.\n\nhttps://www.etf.com/sections/monthly-etf-flows/etf-monthly-fund-flows-december-2021\n\n2021 Top Gainers (values are in millions)\n\n 1.  VOO 46,559.92\n 2.  VTI 44,087.72\n 3.  SPY 35,209.53\n 4.  IVV 27,980.22\n 5.  QQQ…",
  "data/reddit-stocks/r/stocks/comments/rxkzba/why_are_people_shamed_for_investing_in_growth.json": "I am not trying to start a dispute between growth vs value. My portfolio\nconsists of both value and growth in case the rising rates are really some\nshort-term fear mongering. In the longer-term I believe both will go up.\n\nBut I find it noticeable how people are shamed everywhere on the internet…",
  "data/reddit-stocks/r/investing/comments/rxi4rb/sp500_investing_breakdown_with_charts.json": "The last few weeks in the S&P500 have been a bit of a roller-coaster ride\ndeclining just over 5% in a 8 day period and subsequently making several new all\ntimes highs over the following 15 day period.\n\nYour analysis suggests you should want to be bearish the S&P500. You are pretty\n(**extremely**)…",
  "data/reddit-stocks/r/Bogleheads/comments/rxekoh/funding_vtsax_after_the_3k_initial_purchase.json": "I know the minimum purchase for VTSAX is $3K...but once I have funded at least\nthat amount, can I contribute any amount (like automated weekly purchases) after\nthat? TIA.",
  "data/reddit-stocks/r/wallstreetbets/comments/rxee9w/wtf_is_going_on.json": "Ive watched the stock market, krypto market, and precious metal market for a the\npast 5ish years. One thing I always found fascinating is the way the markets\nmove together, most common example, one going up while another goes down and the\nthird not doing anything noteworthy.\n\nSince this whole GME…",
  "data/reddit-stocks/r/investing/comments/rxm96g/where_did_the_money_go_today.json": "Hello folks\n\nWe've all noticed the market dip over the past few days and, knowing that money\ndoesn't simply disappear from existance (fiat debt repayments aside), I'm trying\nto piece together where the money is going.\n\nFirst I saw that crypto was being slayed on all fronts. Then I saw that…",
  "data/reddit-stocks/r/stocks/comments/rxprf3/gamestop_shares_surge_on_report_it_will_create.json": "Gamestop shares rose over 14% in extended trading on Thursday after the Wall\nStreet Journal reported the retailer plans to create a marketplace for\nnon-fungible tokens, often called NFTs.\n\nGamestop also plans to establish cryptocurrency partnerships for the\nmarketplace, according to the…",
  "data/reddit-stocks/r/Bogleheads/comments/rxly8r/a_respectful_discussion_on_dividends.json": "I want to start by saying u/misnamed [/u/misnamed] is an absolute legend and I\nappreciate the time you’ve put into making this sub a great place. That being\nsaid, I want to have a light hearted discussion on dividends, after yesterdays\npost saying dividends are meaningless. I watched the video, and…",
  "data/reddit-stocks/r/wallstreetbets/comments/rxq8ds/gme_20.json": "GameStop Corp. is launching a division to develop a marketplace for nonfungible\ntokens and establish coin partnerships, according to people familiar with its\nplans, pushing the company into much-hyped areas as it tries to turn around its\ncore videogame business.\n\nThe retailer has hired more than 20…",
  "data/reddit-stocks/r/stocks/comments/rxqu8e/here_is_a_market_recap_for_today_thursday_jan_6.json": "PsychoMarket Recap - Thursday, January 6, 2022\n\nAfter the worst day for technology stocks since March, the market finished\nmodestly lower in a very volatile session, with stocks dropping hard in the\nmorning before recovering throughout the session as market participants continue\nto digest signals…",
  "data/reddit-stocks/r/wallstreetbets/comments/rxqgrm/gme_is_currently_up_30_ah.json": "As the title says GME has a decent jump after hours.\n\nAny ideas?\n\nMy first post was removed for being too short so here are some quotes from\nfamous people as per goog\n\nQuotes by Famous People\n\n 1. The greatest glory in living lies not in never falling, but in rising every\n    time we fall. -Nelson…",
  "data/reddit-stocks/r/Bogleheads/comments/rxr8jb/i_maxed_out_my_roth_ira_at_the_beginning_of_2021.json": "Hello, sorry if this is an obvious question I couldn't find the answer by\ngoogling.\n\nAs the title says, I maxed out my ROTH IRA like a good Boglehead on January 2nd\n2021. However, going through my records today I realized that me and my wife\nmade above the income limit (204k) and thus I would be…",
  "data/reddit-stocks/r/Bogleheads/comments/rxolcb/should_i_adjust_401k_holdings_to_chase_lower.json": "Currently I'm contributing 5% into my company 401(k) to get their (whopping)\n1.5% match. My contribution will increase when I pay off the last of my student\nloans this summer. The investment choices (through Prudential) are pretty\nlimited, and after reading \"A Bogleheads Guide to Investing\" I'm re…",
  "data/reddit-stocks/r/stocks/comments/rxusdn/number_of_nasdaq_stocks_down_50_or_more_is_almost.json": "(Bloomberg) -- A near-record number of tech stocks have plunged by some 50% in\nan echo of the dot-com crash.\n\nRoughly four in every 10 companies on the Nasdaq Composite Index have seen their\nmarket values halve from their 52-week highs, while the majority of gauge\nmembers are mired in bear markets,…",
  "data/reddit-stocks/r/Bogleheads/comments/rxx8q6/100_vti_at_18.json": "I just opened my Roth and and will be maxing out my 21’ and 22’ contributions\nsoon, after looking at my options I keep coming back to 100% VTI. Im not very\nknowledgeable yet and I figure this will be a safe bet for now, is there any\nother etfs or funds I should be looking at? I’d also appreciate…",
  "data/reddit-stocks/r/stocks/comments/rxiuej/target_get_it_while_its_cheap.json": "I have been eagerly waiting for Target holiday sales figures to come on. While\nwe wait it is looking like Target will post better sales numbers than Walmart,\nwhich I think is a key benchmark. It appears target is growing foot traffic\nwhile Walmart is decreasing. I think this will be a powerful…",
  "data/reddit-stocks/r/Bogleheads/comments/rxmxk7/fidelity_hsa_charges_75_transaction_fee_for_vtsax.json": "I just moved my HSA to Fidelity and I wanted to divide the monies between 3\nVanguard funds. Each has a Fidelity transaction of $75. This seems to be a fee\neach time you buy. So, I guess every year I would be paying them $225 to invest\nin a 3-fund HSA.\n\nI looked at equivalent Fidelity funds, but I…",
  "data/reddit-stocks/r/investing/comments/rxzr3h/ive_done_it_ive_finally_gone_two_and_a_half.json": "I can't wait to see how many ATH's were set by VTing and Chilling and my other\ninvestments. it's been hard but I finally distracted myself from everything. I\nhave been focusing on my career and myself and betting my situation, and I\nfinally managed to distract myself for two and a half months. I'm…",
  "data/reddit-stocks/r/Bogleheads/comments/rxzook/the_simple_path_to_wealth_book_summary_by_jl.json": "SIMPLE PATH TO WEALTH\n\n * Money is the single most powerful tool we have for navigating this complex\n   world we have created, understanding it is critical. If you choose to master\n   it, money becomes a wonderful servant. If you don't, it will surely master\n   you\n * Complex investments exist only…",
  "data/reddit-stocks/r/Bogleheads/comments/ry02eu/ive_finally_done_it_ive_gone_two_and_a_half.json": "I can't wait to see how many ATH's were set by VTing and Chilling and my other\ninvestments. it's been hard but I finally distracted myself from everything. I\nhave been focusing on my career and myself and betting my situation, and I\nfinally managed to distract myself for two and a half months. I'm…",
  "data/reddit-stocks/r/investing/comments/ry2ugd/reuters_gamestop_shares_surge_on_plan_to_enter.json": "Jan 6 (Reuters) - GameStop Corp (GME.N) is launching a division to develop a\nmarketplace for nonfungible tokens (NFTs) and establish cryptocurrency\npartnerships, a source familiar with the matter said on Thursday, boosting the\nvideo game retailer's shares 27% in extended trading.\n\nGameStop declined…",
  "data/reddit-stocks/r/stocks/comments/ry2swm/im_bearish_on_every_single_streaming_platform.json": "Netflix, Viacom, Comcast, Disney, AT&T (HBO Max).\n\nThese stocks were boosted because of the pandemic, and regardless of how many\nnew shiny objects they can have now, the market is too saturated with absolutely\neverything for me to feel comfortable investing in them.\n\nThe priced in expectations for…",
  "data/reddit-stocks/r/stocks/comments/ry2qxq/at_this_time_last_year_the_weed_and_gambling.json": "Since a year ago to this day PENN is down 47%, CGC is down 73%, and DKNG is down\n48%. And this was after a year when supposedly growth stocks had a fantastic\nyear\n\nJust something to take note of when we are talking about the new \"hot sectors\"\nin play for this year. I personally am more focused on…",
  "data/reddit-stocks/r/stocks/comments/rxylma/online_sports_betting_to_become_legal_in_new_york.json": "I'll start with this: \"Sports betting and internet gambling revenue combined\nincreased more than 200% year-over-year for the first nine months of 2021,\nreaching $5.36 billion\".\n(https://frontofficesports.com/sports-betting-helps-u-s-casinos-reach-record-revenue/)\nCurrently only 17 out of 50 states…",
  "data/reddit-stocks/r/stocks/comments/ry7nq1/hiring_falters_in_december_as_payrolls_rise_only.json": "https://www.cnbc.com/2022/01/07/hiring-falters-in-december-as-payrolls-rise-only-199000.html\n\nThe U.S. economy added far fewer jobs than expected in December just as the\nnation was grappling with a massive surge in Covid cases, the Labor Department\nsaid Friday.\n\nNonfarm payrolls grew by 199,000,…",
  "data/reddit-stocks/r/investing/comments/ry7wtn/us_10year_note_rate_is_too_high.json": "Here are the 10-year rates of the G7:\n\nUSA 1.75 UK 1.15 JAPAN 0.15 GERMANY -0.056 CANADA 1.72 ITALY 1.30 FRANCE 0.27\n\nIt makes no sense to me that the US is paying such a high rate when compared to\nother countries. The dollar will strengthen against other currencies and cause\nimports to become more…",
  "data/reddit-stocks/r/Bogleheads/comments/ry420x/boglehead_but_check_3x_a_day_the_stock_market.json": "A rather simple question for you my friends of r/Bogleheads [/r/Bogleheads].\n\nI am a 100% leaning towards Bogle strategy and long-term lazy investment, not\neven tilting towards the \"5% fun active trading\" (since I know I'll loose most\nof it, and 5% ads up in the end).\n\nI have an ultra-boring…",
  "data/reddit-stocks/r/stocks/comments/ryakgb/hedge_funds_are_selling_tech_shares_at_their.json": "Surging bond yields have triggered hedge funds to sell growth-focused technology\nshares at a speed not seen in the past decade. The hedge fund community dumped\ntech stocks in the four sessions between Dec. 30 and Tuesday as interest rates\nspiked. The four-session tech unloading marked the biggest…",
  "data/reddit-stocks/r/Bogleheads/comments/ry3oij/but_didnt_bogle_and_buffett_say_usonly_investing.json": "Jack Bogle said: \"If there's one place I don't want people to take my advice,\nit's international. I want you to think it through for yourself.\" He knew his\nstrengths and the things in which he wasn't an expert.\n\nSetting that aside, consider the sources: two men, born in 1929 and 1930, who\ngrew rich…",
  "data/reddit-stocks/r/stocks/comments/ryazi8/roblox_rblx_stock_plunges_7_on_china_app_removal.json": "Shares of Roblox (NYSE: RBLX\n[https://www.streetinsider.com/Analyst+Comments/Roblox+%28RBLX%29+Stock+Plunges+7%25+on+China+App+Removal%2C+Seen+as+Incremental+Unforeseen+Headwind/stock_lookup.php?q=RBLX])\nare down over 6% today after Reuters reported that the video gaming company has\nremoved its…",
  "data/reddit-stocks/r/Bogleheads/comments/ryec86/how_are_these_401k_options_even_legal.json": "These are my wife's 401k options. Believe it or not, this is the \"improved\" 401k\nthey reworked this year after \"someone\" anonymously suggested they renegotiate\ntheir 401k.\n\nPerformance data (only aggregate view provided by her plan administrator…",
  "data/reddit-stocks/r/stocks/comments/ryb880/potential_big_tech_stocks_shopping_list_for_long.json": "The nasdaq is down about 5% ytd and there are many good quality big tech stocks\nthat could be adding to investors long term portfolio. Stocks such as amzn,\naapl, adbe, msft, googl, nvda, fb, and intu are some good example. Costco and\nhome depot are quality stocks too. Investors should be keep…",
  "data/reddit-stocks/r/stocks/comments/ry937l/whats_your_favorite_stock_that_has_been.json": "I have been watching my investors bank position keep hitting new ATHs. I bought\nin 2020 around $8.50 and it’s not topped $17. I like financials a lot and this\nwas my smaller, regional play. But it has crushed all my expectations. Anyone\nelse have some picks they didn’t expect to soar but that have…",
  "data/reddit-stocks/r/investing/comments/ryf075/latest_rotation_is_another_reminder_you_cannot.json": "The stock market seems to have been a game of rotation from one sector to\nanother the past 1-2 years. During early pandemic stay at home was all the rage.\nThen turned into recovery towards the end of 2020 when good data behind the\nvaccine was coming out. Early 2021 was all about meme stocks. Growth…",
  "data/reddit-stocks/r/Bogleheads/comments/ryfc0v/100_vtwax.json": "Hello everyone! Im 22 and just started last year October, already maxed my\ncontribution last year and for this year 2022 I have put 4k. Im just wondering\nif I made the right choice? I keep seeing people with VTSAX, but some say\ninternational might be better. Should I get VOO as well, since my close…",
  "data/reddit-stocks/r/stocks/comments/ryi3jd/why_did_everyone_forget_20162018_growth_10xd_the.json": "Growth stocks tanked during the FEAR of rate hikes (similar to this whole year,)\nthen skyrocketed during the actual hikes.\n\nWhy do so many people believe gradual .25% increases will tank valuations? That\nhistorically has not been true. The fear and fud of a hawkish fed is what tanked\nthese stocks,…",
  "data/reddit-stocks/r/wallstreetbets/comments/ry9vfd/why_is_everyone_so_hopeful_because_of_gmes_nft.json": "As retarded as this question might seem, I don't get it why suddenly everyone is\nso hyped again. I mean, GME NFTs have been in discussion for a long time iirc.\nAlso, commonly, NFTs have been marked as a scam and bullshit by the majority of\nthe internet (e.g. this Doom mod where you take monkey…",
  "data/reddit-stocks/r/Bogleheads/comments/rygb0o/can_the_popularity_of_index_funds_have_negative.json": "Simple question - but if everyone invested in index funds, would this have a\nnegative effect? It seems that in general, when a particular financial strategy\nbecomes massively popular, it causes distortions that negate the original\nbenefits of the strategy. Example: everyone tries to gain wealth by…",
  "data/reddit-stocks/r/stocks/comments/rykijp/here_is_a_market_recap_for_today_friday_january_7.json": "PsychoMarket Recap - Friday, January 7, 2022\n\nStocks closed the first week of 2022 in the red, the worst start to a year since\n2016, as market participants continue to digest the December labor market and\nthe Federal Reserve’s meeting minutes, which signaled participants favor an\ninterest rate hike…",
  "data/reddit-stocks/r/investing/comments/ryii0h/the_federal_reserve_is_scaring_markets_with_the.json": "Quoting original article at CNBC\n[https://www.cnbc.com/2022/01/06/the-fed-is-scaring-markets-with-the-triple-threat-of-policy-tightening.html]:\n\n> Investors have been preparing for the Federal Reserve to start hiking interest\n> rates. They also know the central bank is cutting the amount of bonds…",
  "data/reddit-stocks/r/wallstreetbets/comments/ryjnl5/for_those_with_insane_loss_porn_how_do_you_cope.json": "I’m one of the retards here with 5 figures loss porn. Others too I’m sure are\nhurt.\n\nI’ve been depressed and mentally drained since the new year, and since I’m\ngraduating college in May it’s hard to just go back into the workforce right now\nsince I’m traveling from school, back home, gonna be…",
  "data/reddit-stocks/r/stocks/comments/rylp2u/be_prepared_for_a_bigger_drop_cpi_data_release_is.json": "The coming week will include a very hot inflation report, the banks kicking off\nearnings season, US-Russia talks, and a bunch of Fed speak. Inflation is not\nletting up and will continue to make the Fed uneasy. On Wednesday, the headline\nyear-over-year inflation reading is expected to rise from 6.8%…",
  "data/reddit-stocks/r/stocks/comments/ryp4w1/does_anyone_else_feel_stuck_in_purgatory_of_not.json": "There are looming concerns about rate hikes, inflation, businesses shuttered\nduring the pandemic, national debt, personal debt, etc. that make me leery of\nbuying just about anything except for a few rare bargains and oil. 95% of the\nmarket seems inflated and due for correction or worse.\n\nHowever,…",
  "data/reddit-stocks/r/stocks/comments/ry4hac/rstocks_daily_discussion_fundamentals_friday_jan.json": "This is the daily discussion, so anything stocks related is fine, but the theme\nfor today is on fundamentals, but if fundamentals aren't your thing then just\nignore the theme and/or post your arguments against fundamentals…",
  "data/reddit-stocks/r/stocks/comments/rybuvy/roku_key_vice_president_scott_rosenberg_to_exit.json": "Major streaming provider Roku has announced that one of its top execs, platform\nchief Scott Rosenberg, plans to depart the company in the spring after a nearly\n10-year run.\n\nIn an announcement, company founder and CEO Anthony Wood said Rosenberg is\n“ready for his next professional…",
  "data/reddit-stocks/r/investing/comments/ryu2nb/number_of_nasdaq_stocks_down_50_or_more_is_almost.json": "A near-record number of tech stocks have plunged by some 50% in an echo of the\ndot-com crash.\n\nRoughly four in every 10 companies on the Nasdaq Composite Index have seen their\nmarket values cut in half from their 52-week highs, while the majority of gauge\nmembers are mired in bear markets,…",
  "data/reddit-stocks/r/stocks/comments/rync2e/recent_tech_dip_buying_opportunities.json": "I’m thinking this dip is a solid buying opportunity, and I’m really liking the\nlevels google has dipped to.\n\nAny other solid companies that have dipped to reasonable valuations? Or any\nother stock that y’all see is a must buy?",
  "data/reddit-stocks/r/stocks/comments/ryi97w/microsoft_thoughts.json": "Stock is down 6.20% YTD not a large amount but I just love the company and\nwondering if this is a good place to start buying. It had a huge run in 2021 but\nearnings are in a few weeks and I feel like inflation will not really effect\nthis company. It’s going down with the rest of tech. Thoughts on a…",
  "data/reddit-stocks/r/Bogleheads/comments/ryrcjc/good_starter_etf.json": "So I'm early 20s college student and I have a lil nest egg set aside(+/- 10k) I\ndon't need for bills. I've been looking into something to invest while I'm in\nschool because I won't really need it for awhile. I'm not talking 30 years,\nmaybe 3-10. What would be a good stock with some solid return.…",
  "data/reddit-stocks/r/wallstreetbets/comments/rynx6h/i_will_never_never_financially_recover_from_this.json": "In November of 2020, I was in six figure debt from a failed business that got\nshut down due to COVID. I didn’t have enough money to pay my debt so I started\nlooking around to see what I could do to help my bills.\n\nThanks to some finance YouTubers, I came across Cathie Wood. I was skeptical at\nfirst…",
  "data/reddit-stocks/r/stocks/comments/ryznm8/this_killed_day_trading_for_me.json": "I haven't told hardly anyone this because it kills me to think about. I had\nstarted day trading paper stocks. I was reading day trading books by reputable\nday traders, watching live YouTube traders and actually was doing pretty good.\nIn 1 year, I had turned the original 10,000 paper money I started…",
  "data/reddit-stocks/r/stocks/comments/rypjyh/has_anyone_on_this_sub_used_palantirs_software.json": "I'm in the middle of doing my DD on Palantir, and one thought I can't shake is\nhow I CAN'T use their product myself. When I was looking into TSLA I scheduled a\ntest drive and asked local Tesla owners their experiences. I know the product is\nfor large corporations and governments, so most people…",
  "data/reddit-stocks/r/Bogleheads/comments/ryy31u/set_it_and_forget_it_for_the_next_25_years.json": "I'm a 27 year old European and am just now starting to learn more about\ninvesting. My plan for the next 25-30 years is to invest around 300 EU (340 USD)\neach month into a portfolio. Howeer, I am not really sure what the portfolio\nshould consist of.\n\nA lot of people here seem to be saying that VT is…",
  "data/reddit-stocks/r/wallstreetbets/comments/rz25wv/is_it_illegal_to_keep_withdrawing_money_from_a.json": "I just found out a local shitty bank is a publicly traded stock with a 2 billion\ndollar market cap. And I’d like to short it.\n\nMy plan is to withdraw cash like 100$ from them and deposit it with a different\nbank then transfer it back to them and withdraw the same 100 $ until they run\nout of…",
  "data/reddit-stocks/r/stocks/comments/rz1pvf/can_marijuana_stocks_go_lower.json": "Marijuana WILL be legalized federally. Whether it takes 1 year or 5 or longer,\nit's going to happen. Too many Americans want it, the tax benefits are massive\nand it has not had the negative social effect people thought after its was\nlegalized at the state level. There are 3 or 4 bills in the Senate…",
  "data/reddit-stocks/r/stocks/comments/rz3hfv/predict_the_best_performing_stock_of_2022_and.json": "As the title says predict the best performing stock of 2022 and I will give away\nReddit awards to the people who correctly predict the best performing stock of\n2022.\n\nThe award will given early next year. And if there is no correct prediction the\naward will be given to the person who’s stock comes…",
  "data/reddit-stocks/r/Bogleheads/comments/rz3rgv/should_i_choose_traditional_401k_or_roth_401k.json": "My company currently offers the option of investing in a traditional 401k, Roth\n401k, or a split between the two. I’m unsure which makes the most sense in my\ncurrent situation, balancing maximum savings and minimizing taxes.\n\nThere is no company match and I’ll be maxing out my contribution either…",
  "data/reddit-stocks/r/investing/comments/rz7beq/why_tesla_will_hit_an_unexpected_wall_and_it_has.json": "Edit: Skip ahead to \"Electrifying the grid: The truth\" if you want to get right\nto the thesis..\n\nTesla is currently sitting on a P/S ratio of roughly 25.0. This is as compared\nto other mature industrial conglomerates that trade at P/S between 1.0-2.0 (ie\nSiemans, Northrup). This represents an…",
  "data/reddit-stocks/r/Bogleheads/comments/rz49p4/any_thoughts_on_dimensional_fund_advisors_new_etfs.json": "I was wondering what other Bogleheads think about these ETFs, as they are\nsuppose to be based on thorough research and they have been doing this since the\nmid-80s. Ben Felix from Common Sense Investing also talks a lot about them,\nwhich were previously unavailable to the general public (they…",
  "data/reddit-stocks/r/stocks/comments/rz5kx1/to_those_getting_uncomfortable_and_thinking_of.json": "If we took a look at intra-year stock market declines over the 20-year period\nfrom 2000–2019, a decline of at least 10% occurred in 11 out of 20 years, or 55%\nof the time, with an average pullback of 15%.\n\nAnd in two additional years, the decline was just short of 10%. Despite these\npullbacks,…",
  "data/reddit-stocks/r/stocks/comments/rz9gp3/index_funds_will_not_make_you_rich_quick_please.json": "Hello fellow investors,\n\nover the past few weeks I have read a lot of posts and comments that suggested\nsome investment model along the lines of \"just DCA into the S&P 500 and you'll\nbe rich in a few years!\". I find statements like this extremely unsettling as\nthey suggest to me a lackluster…",
  "data/reddit-stocks/r/Bogleheads/comments/rz43wq/climate_change_and_investment_horizons.json": "Hey there, longtime lurker here (really appreciate all of the helpful\ndiscussion).\n\nI just turned 24 and something I’ve been thinking a lot about recently is how\nclimate change might impact retirement for people my age. Maybe I’m being too\npessimistic, but I worry about saving all this money for…",
  "data/reddit-stocks/r/Bogleheads/comments/rz6enc/i_bonds_are_they_emergency_fund_or_bonds.json": "as title - do you consider i bonds as part of your emergency fund, your bond\nfund, or is the distinction not meaningful?",
  "data/reddit-stocks/r/stocks/comments/rze0am/citigroup_will_terminate_unvaccinated_workers.json": "> The bank reminded employees in a memo sent Friday about its policy, first\n> disclosed in October, that they must be “fully vaccinated as a condition of\n> employment.” At the time, the bank said that employees had to submit proof of\n> vaccination by Jan. 14.\n> \n> Those who haven’t complied by next…",
  "data/reddit-stocks/r/wallstreetbets/comments/ryrb0t/can_we_get_a_moment_of_silence_for_the_idiots_who.json": "Who the hell expected Roblox to lose 18% in 5 days? Its a shit stock but isn’t\nshe supposed to be some magic fortune teller when it comes to this?",
  "data/reddit-stocks/r/stocks/comments/rz3m1n/we_need_to_talk_about_tesla.json": "As if there weren’t enough posts on this subreddit about Tesla already I’ve\ndecided to make another. I’d like to start with something that will become\nobvious later in this post: I’m bullish on the company and own the stock.\n\nI think we as investors are extremely lucky to have mediums like Reddit…",
  "data/reddit-stocks/r/wallstreetbets/comments/rz6v07/can_i_short_tim_hortons_by_buying_a_donut_a_day.json": "Once I bought a coffee at the local timmies and it was cold. If I stop by every\nday, buy a donut until they run out of donuts, then tell everyone that they ran\nout of donuts, leading to everyone no longer trying to buy their donuts, can I\nmake their stock price go down?\n\nAre there any real…",
  "data/reddit-stocks/r/stocks/comments/rzcyk0/going_short_on_rivn.json": "I know this seems to be a provocative title, but I've finally decided to short,\nor buy puts on, Rivian (*RIVN) next week. More likely one year puts, tbh, as\nthey have capped downside.\n\nNow I know that some of you EV fanboys out there think that there's something\nwrong with me in the head. But, as…",
  "data/reddit-stocks/r/wallstreetbets/comments/rzdy6e/can_i_short_the_healthcare_industry_by_buying_an.json": "Once I bought an apple a day and it kept the doctor away. If I stop by every\nday, buy an apple until they run out of doctors, then tell everyone that they\nran out of doctors, leading to everyone no longer trying to get healthcare, can\nI make their stock price go down?\n\nAre there any real…",
  "data/reddit-stocks/r/wallstreetbets/comments/rzbcvw/passive_income_revenue_stream_investing_infinite.json": "I currently live paycheck to paycheck. At the end of the month, I use my $2300\nbalance to pay for rent, loans, and food. This week, I transferred that money to\nmy investing account to buy NVDA calls. I’ll worry about paying rent at the end\nof the month, when the time comes for it.\n\nBut I need more…",
  "data/reddit-stocks/r/stocks/comments/rznlyl/i_dont_think_people_understand_whats_going_on.json": "I often read posts / comments from people who talk about the stock market as if\nit were an isolated entity. \"It has some good years, it has some bad years,\nlately we've had good years, there will be bad years, too, but it always goes up\nover time.\" All of this is true. But I don't think you can…",
  "data/reddit-stocks/r/investing/comments/rzq6fq/citigroup_will_terminate_unvaccinated_workers.json": "> The bank reminded employees in a memo sent Friday about its policy, first\n> disclosed in October, that they must be “fully vaccinated as a condition of\n> employment.” At the time, the bank said that employees had to submit proof of\n> vaccination by Jan. 14.\n> \n> Those who haven’t complied by next…",
  "data/reddit-stocks/r/investing/comments/rz64yc/ps_over_30_is_still_incredibly_risky.json": "Following up from my post 10 months ago\n[https://www.reddit.com/r/investing/comments/lqqoks/watch_your_ps_ratio_ps_over_30_is_incredibly_risky/].\n\nHere's a graph of the number of US traded stocks with a PS over 30 and market\ncap of $5 billion (as of 2021-Dec…",
  "data/reddit-stocks/r/investing/comments/rzs88t/largest_position_for_2022.json": "Warren Buffet says diversification is protection from ignorance, and the best\nway to have market leading returns is to over allocate your portfolio if you’re\nconfident in your selections.\n\nWhat’s your largest position for 2022? What percentage of your portfolio is it?\nWhat makes you confident?\n\nFor…",
  "data/reddit-stocks/r/stocks/comments/rztcim/why_im_long_oil.json": "TL;DR - Oil isn't anywhere near it's death throes and provides more upside IMO\nthan the broader market\n\nEdit - And of course, this should not be construed as legitimate financial\nadvice\n\nI saw a post recently asking why people were long oil given that it's a\ndeclining industry. In the spirit of…",
  "data/reddit-stocks/r/investing/comments/rzdsoh/18_year_old_looking_for_advice.json": "So basically I do freelance web design work and have saved up around $10k and\ncan put it around $1000-1200 more every month in the market as I currently have\nno bills to pay\n\nMy current positions are:\n\n10 shares of BABA at an AVG PRICE OF $128\n\n2 shares of SPY AVG PRICE $479\n\n36 shares of UPWK AVG…",
  "data/reddit-stocks/r/Bogleheads/comments/rzscd9/is_there_any_reason_to_own_bnd_as_opposed_to_cash.json": "I know Jack Bogle said to own your age in bonds, but I see that the BND ETF I\nbought last year is down 5 percent. I could have held cash and preserved my\ncapital better. Since higher interest rates lowers bond prices, is there any\nreason to buy BND, or should I hold it cash? Also, would you…",
  "data/reddit-stocks/r/wallstreetbets/comments/rzxs92/foolproof_investment_opportunity_inquire_within.json": "Here's the plan: we're shorting Hilton and we're buying into power companies.\nHow? Easy. We stay at Hilton hotels and run the microwave in the room the whole\ntime, we bring space heaters, we bring gaming PCs. Guess what, Hilton now has\ninsanely high electric bills. They go under. The power…",
  "data/reddit-stocks/r/stocks/comments/rzyq2s/is_now_the_time_to_be_buying_growth_stocks.json": "People have been saying growth stocks were in a bubble for months. Since Feb\n2021 dozens of those high fliers are now down 30-90% off their highs.\n\nCOST, WM, DPZ, CMG, and AAPL come to mind as stocks trading at valuations that\nworry me the problem is unlike stuff like PLTR, DKNG, weed stocks, and…",
  "data/reddit-stocks/r/investing/comments/rzvfbt/best_vehicle_for_short_term_35_years_growth_and.json": "Hello,\n\nI am active duty military and I am eligible to retire with pension in exactly\nthree years. I am 90% decided that I want to get out and just spend a few years\njust crossing off a few items on my bucket list (e.g. doing whatever the heck I\nwant and NOT WORKING).\n\nI have zero debt. I have…",
  "data/reddit-stocks/r/stocks/comments/rzxq0k/if_were_in_the_middle_of_inflation_and_rising.json": "Hi everyone,\n\nThe 10-year Treasury yield percentage is determined by an auction and when\nthere's good faith in the market, this results in less people present at these\nauctions, meaning the yield goes up in order to entice interest in these\nTreasuries.\nThat's my understanding based on this…",
  "data/reddit-stocks/r/Bogleheads/comments/rzqs9s/question_about_money_needed_in_4_years_3_interest.json": "Hi. Thanks for reading. My wife and I are saving for a home that we would like\nto buy in about 4 years. I am of the impression that that timeframe is a bit\nshort to put our savings in the market. Perhaps I am misguided in thinking that;\nperhaps not... I know that holding cash is foolish, so we are…",
  "data/reddit-stocks/r/stocks/comments/rzttix/thoughts_on_semiconductors.json": "I am bullish on semiconductors.\n\nThe amount of things that require a chip is growing exponentially. Like how\ncould one go wrong investing in semiconductors for the long term?\n\nI know semiconductor companies are overvalued at the moment ,but the reason they\nhave high P/E ratios is because investors…",
  "data/reddit-stocks/r/stocks/comments/s00g70/fed_unites_left_and_right_in_warning_its_behind.json": "https://www.bloomberg.com/news/articles/2022-01-09/fed-unites-left-and-right-in-warning-it-s-behind-inflation-curve\n\nThe Federal Reserve has managed to do something that’s rarely seen in the U.S.\nthese days: Get members of the Democratic and Republican parties to agree.\n\nAt this year’s annual…",
  "data/reddit-stocks/r/Bogleheads/comments/rzibpj/60_fzrox_40_fzilx.json": "I have no idea what I'm doing, but I'm trying to start a retirement fund. I\nopened a Roth IRA with Fidelity and followed the formula stated above.\n\nI will also have a pension and an annuity fund from my union, but I think it's a\ngood idea to have my own fund in case those are mishandled.\n\nI'm under…",
  "data/reddit-stocks/r/investing/comments/rzx4gl/what_is_your_investing_philosophy.json": "One thing I'm struck by is the number of different approaches to investing that\npeople have and their ability to make money from them. A few examples:\n\nBogleheads: Hold index funds and reap the benefits of the growth of the market.\n\nBuffet: Invests in high quality companies with managements that he…",
  "data/reddit-stocks/r/Bogleheads/comments/s00iuw/news_the_nasdaq_is_quietly_being_shredded.json": "https://finance.yahoo.com/news/the-nasdaq-is-quietly-being-shredded-new-data-130747360.html\n\nI am definitely not one to time the market, but this seems to spell bad news for\nQQQheads (I used to have a portion allocated to it, even posted about it\nrecently here, but decided to ditch it after reading…",
  "data/reddit-stocks/r/stocks/comments/rzz9wy/what_im_seeing_with_supply_chain_disruptions_dec.json": " * See my prior post for a primer on how I monitor supply-chain disruptions: How\n   to monitor the supply chain disruptions : stocks (reddit.com)\n   [https://www.reddit.com/r/stocks/comments/prfsi4/how_to_monitor_the_supply_chain_disruptions/]\n * Sep '21 Edition**:** (3) What I'm seeing with supply…",
  "data/reddit-stocks/r/stocks/comments/s01s31/paypal_explores_launch_of_own_stablecoin_in.json": "https://www.bloomberg.com/news/articles/2022-01-07/paypal-is-exploring-launch-of-own-stablecoin-in-crypto-push\n\n“We are exploring a stablecoin; if and when we seek to move forward, we will of\ncourse, work closely with relevant regulators,” Jose Fernandez da Ponte, senior\nvice president of crypto…",
  "data/reddit-stocks/r/Bogleheads/comments/rzu6sj/bad_401k_roth_vtwax_is_there_anything_i_could_do.json": "I'd like opinions on my choices, I think I've made the best decisions I can with\nthe options available. Always keen to hear views from other folks.\n\n \n\n * Age: 33\n * Located: USA (NC)\n * Total Income: $80k ($77k salary + $3k bonus)\n * Goal: to retire around 60 in a healthy financial position, with…",
  "data/reddit-stocks/r/Bogleheads/comments/rzzymo/taxable_account_vtsax_vtiax_vtwax_or_something.json": "Hi everyone,\n\nI hope I can get some advice. I am about 30 years away from retirement.\n\nI set up a taxable account with hopes to use it to help pay for a house in\ntwo-three years. (I know you’re not “supposed” to invest money you need in a\ncouple years, but if I lose money by the time I want to use…",
  "data/reddit-stocks/r/investing/comments/s0aunx/what_is_your_outlook_on_paypals_current_stock.json": "I've seen a lot of positive information about Paypal's stock and what the future\nmight hold for Paypal especially with Venmo hitting Amazon; however, it seems\nevery other day it's 3 steps forward and 3 steps back as Paypal stock sits\nbetween 180 and 195 for a single share. What do you guys think…",
  "data/reddit-stocks/r/stocks/comments/s09x7i/invest_in_strong_companies_when_the_market.json": "COIN, SQ, NVDA, BA, CCL\n\nThese are my recent picks in the past month's pullback. There are few reasons to\nhate them but many more to love them. In particular what I'm looking for is\ncustomer stability, market dominance, profit control and stock price\ndemandzones. I can make a solid case for each…",
  "data/reddit-stocks/r/Bogleheads/comments/s05no6/7months_into_investing_need_help_with_rebalance.json": "Hey bogles,\n\nI started my individual and Roth IRA before I knew what I was doing and after\nmonths of stress and research I think I have a plan I'd like to run by you all.\nI'm 25 and make 60K with no debt.\n\nTraditional and Roth TSP\n\nI started my contributions to my traditional TSP with a 5% match…",
  "data/reddit-stocks/r/Bogleheads/comments/s0am2c/do_you_have_an_investment_policy_statement_ips_or.json": "I'm in the middle of composing an IPS only because I know I'm the kind of person\nwho is more likely to follow through on something if I put it in writing, and at\nthe very least, I don't see how taking the time to compose an IPS can hurt.\n\nThat said, while I was browsing a…",
  "data/reddit-stocks/r/wallstreetbets/comments/s089s7/will_january_2022_bring_meme_stocks_back_alive.json": "First of all, hope everyone's phenomenal this Sunday.\n\nI'd like to discuss the following titled post.\n\nDo you believe we will see the basket of stocks involved in the crazy run up of\nJanuary 2021 meme upwards again for its 1 year anniversary?\n\nWill Roaring Kitty reappear from the shadows?\n\nWill all…",
  "data/reddit-stocks/r/stocks/comments/s0jbg1/take_two_interactive_ttwo_to_purchase_farmville.json": "From CNBC:\n\nTake-Two Interactive is buying mobile gaming company Zynga for $12.7 billion,\nmarking the latest blockbuster acquisition in a string of major deals in the\nvideo game industry.\n\nThe company announced Monday that it would acquire all outstanding shares of\nZynga at $9.86 a share, a 64%…",
  "data/reddit-stocks/r/stocks/comments/s0clgs/is_now_a_good_time_to_get_in.json": "Finally in a position to start investing for retirement etc. and have a small\nsum to get started (likely with VTSAX). I know nobody has a crystal ball, but am\nI better off holding out seeing that Fed rates may trigger a downturn?",
  "data/reddit-stocks/r/investing/comments/s0jd4i/take_two_interactive_ttwo_to_purchase_zynga_in.json": "From CNBC:\n\nTake-Two Interactive is buying mobile gaming company Zynga for $12.7 billion,\nmarking the latest blockbuster acquisition in a string of major deals in the\nvideo game industry.\n\nThe company announced Monday that it would acquire all outstanding shares of\nZynga at $9.86 a share, a 64%…",
  "data/reddit-stocks/r/wallstreetbets/comments/s02n57/can_i_keep_buying_full_insurance_on_a_car_crash.json": "I'm not sure if this legal or not, but with the supply chain issues, I'm\nguessing manufacturers will start having problems delivering cars. So if I buy a\nnew car, get full insurance on it from day 1, and crash it, the insurance\ncompany will get me a brand new car with equal value from the…",
  "data/reddit-stocks/r/stocks/comments/s0m51f/goldman_predicts_the_fed_will_hike_rates_four.json": "Persistently high inflation combined with a labor market near full employment\nwill push the Federal Reserve to raise interest rates more than expected this\nyear, according to the latest forecast from Goldman Sachs. The Wall Street\nfirm’s chief economist, Jan Hatzius, said in a note Sunday that he…",
  "data/reddit-stocks/r/investing/comments/s0cbtj/are_we_heading_into_taper_tantrum_2.json": "given the fears of rising interest rates, it feels like we very well may be\nheading into another showtime run of a taper tantrum again. I expect Monday will\nbe down as well. If anything though, if you've invested in solid fundamentals\nand solid companies or ETF's, this would be one of the best…",
  "data/reddit-stocks/r/Bogleheads/comments/s0mho8/its_days_like_this_that_i_appreciate_being_a.json": "Folks at /r/Stocks and /r/StockMarket are panicking. Good to know that I'm\nmostly in Index Funds. Feels nice having a long term outlook",
  "data/reddit-stocks/r/wallstreetbets/comments/s0ir56/can_someone_give_me_a_logical_and_intelligent.json": "Not a shill or a GME fanboy, just keep seeing people obsessed over this stock\nand trying to figure out why. They keep talking about upcoming expired options,\nhedge funds that haven’t closed out their short positions, fail to deliver ETF\nexposure today, this new NFT and turnaround plan for GME. And…",
  "data/reddit-stocks/r/investing/comments/s0nldd/cash_is_only_thing_holding_value_in.json": "My portfolio is a split between stocks, bonds, gold, and some crypto.\n\nOver the last week, everything is down a fair amount since the Fed announcement\nabout raising rates to fight inflation.\n\nStocks, gold, and crypto have all been touted as inflation-hedges, while cash\nhas no possible upside versus…",
  "data/reddit-stocks/r/Bogleheads/comments/s0fclm/berkshire_hathaway.json": "Personally, I know many people who have a significant portion of their wealth in\nBRK.B whats you guys' thoughts on the conglomerate?",
  "data/reddit-stocks/r/investing/comments/s0n5r5/the_tech_stock_im_currently_looking_at_is.json": "The stock I'm looking at is Opendoor (OPEN). I would have been happy buying in\nthe mid teens, and I was accumulating cash to do so when the recent bear trend\nwent in to overdrive.\n\nI still have the cash sitting on the sideline, but I'm wondering whether it's\nbetter to wait for a green \"bounce\" or…",
  "data/reddit-stocks/r/investing/comments/s0qu2m/pardon_my_interruption_but_we_are_not_in_a_bear.json": "I recently wrote that too many on this site have never experienced a market\ncrash. The link is here:\nhttps://www.reddit.com/r/stocks/comments/ru0ic7/too_many_of_you_have_never_experienced_a_stock/?utm_source=share&utm_medium=web2x&context=3\n\nNow, I am beginning to believe that too many don't know…",
  "data/reddit-stocks/r/investing/comments/s0ncv2/intel_drops_a_bomb_on_the_robotaxi_industry.json": "Original article at Seeking Alpha (non-paywall link): https://archive.is/CUIAS\n\n\nINTEL DROPS A BOMB ON THE ROBOTAXI INDUSTRY\n\n\nSUMMARY\n\n * Despite most investors focusing on Tesla for robotaxis, Intel’s Mobileye is\n   currently in volume production of its camera-only L2+ autonomous driving\n  …",
  "data/reddit-stocks/r/stocks/comments/s0ntd7/i_have_100_shares_of_arkg_now_down_52_hold_or_sell.json": "It's the smallest position in my portfolio but it still amounts to about $5k\nloss if I sell now. I've been stuck with it since Feb last year (oh boy have I\nlearned a lot since then) and it's my biggest loser by far.\n\nI'm not sure if I should take the loss now and get the remaining 5k on…",
  "data/reddit-stocks/r/stocks/comments/s0msw0/nvidias_fair_valuation.json": "Hello everyone,\n\nI can't help but notice that Nvidia is often cited as one of the greatest stocks\nan investor could pick in this red hot stock market and I'd be curious to ask\nthose who invested at the current price or higher, which figures did you use to\nget to a fair value which is supposedly…",
  "data/reddit-stocks/r/stocks/comments/s0r1zd/why_didnt_the_fed_combat_inflation_and_being.json": "Apologies if this is commonly asked or a stupid question, but as I look at the\nSPY chart over the last two years and comments from people about the last few\ndays reaction to the FEDs decision to raise rates over the course of this year:\n\n\"The feds going to take a fire hose to the market. Rightfully…",
  "data/reddit-stocks/r/stocks/comments/s0h0f9/rstocks_daily_discussion_monday_jan_10_2022.json": "These daily discussions run from Monday to Friday including during our themed\nposts.\n\nSome helpful links:\n\n * Finviz [https://finviz.com/quote.ashx?t=spy] for charts, fundamentals, and\n   aggregated news on individual stocks\n * Bloomberg market news [https://www.bloomberg.com/markets]\n *…",
  "data/reddit-stocks/r/stocks/comments/s0w7qj/here_is_a_market_recap_for_today_monday_jan_10.json": "PsychoMarket Recap - Monday, January 10, 2022\n\nToday was one of the wildest days I’ve seen in the markets in a long time. After\nsinking more than 2.5% in the morning, the Nasdaq (QQQ) staged a remarkable\nred-to-green move as market participants piled in to buy the dip in technology\nstocks. This…",
  "data/reddit-stocks/r/stocks/comments/s0uj7w/cathie_wood_calls_recent_surges_in_ford_and_gm.json": "Ford hit its highest level in 20 years last week after it announced plans to\ndouble the production of its electric F-150 to 150,000 units by 2023. General\nMotors also saw a stock price boost after it unveiled the electric version of\nits best selling pick-up truck, the Silverado.\n\n\"They soared on…",
  "data/reddit-stocks/r/wallstreetbets/comments/s0raz6/everything_is_fine.json": "We are not in a bubble. 1000+ PE ratios are sustainable. EV companies with $0 in\nrevenue being worth 150bil is normal. Online pictures anybody can copy+paste\nbeing sold for millions is fine. Made up internet meme money making millionaires\nis expected. Real wages going down while stocks go up is…",
  "data/reddit-stocks/r/wallstreetbets/comments/s0chdl/exercising_calls_gme_squeeze_fuel.json": "Posted this in another sub and was predictably downvoted and shouted down for\nspeaking the word “options”. Figure you retards might be more inclined to\ndiscuss.\n\nSomeone please poke a hole in this strategy for retail to kick things into high\ngear (beyond the obvious “most apes don’t have the…",
  "data/reddit-stocks/r/stocks/comments/s0uiq8/fed_vice_chair_clarida_to_step_down_early.json": "Federal Reserve Vice Chairman Richard Clarida said Monday he will be leaving his\npost with just a few weeks left on his term and amid revelations regarding his\ntrading of stocks.\n\nCredit to Jeff Cox from CNBC: Link\n[https://www.cnbc.com/2022/01/10/fed-vice-chair-clarida-to-step-down-early-following…",
  "data/reddit-stocks/r/stocks/comments/s0yxuq/rivian_shares_decline_on_2021_production_and.json": "Shares of Rivian Automotive fell 5% in afterhours trading Monday after the\ncompany said it missed its 2021 vehicle production target and confirmed the\ndeparture of its chief operating officer.\n\nThe electric vehicle start-up said it built 1,015 vehicles in its first few\nmonths of production –…",
  "data/reddit-stocks/r/Bogleheads/comments/s106xm/i_give_upyou_win.json": "I’ve finally come around to VT and Chill. Despite thinking I knew better or\ncould do better, I’ve conceded.\n\nI actually hate stocks and worrying about them. I hate the Fed’s interference in\nthe market and how bad news is bullish (at least things like unemployment right\nnow).\n\nIt’s incredibly…",
  "data/reddit-stocks/r/Bogleheads/comments/s0tnha/finally_debt_free_now_what.json": "so... basically... just dug myself out of ten years and about 25k in credit card\ndebt... I'm 37 years old.\n\nI was able to put away 15% in retirement that whole time... so I am not too\nworried there.\n\nmy question is this: I have $1000 in my emergency fund.... earning basically\nnothing at a…",
  "data/reddit-stocks/r/Bogleheads/comments/s0n898/30_yo_100_vti_in_taxable_account.json": "Hey curious what you guys recommend for the main taxable portion? I'm planning\non using HFEA in my retirement accounts 100%, so as for my taxable I wasn't sure\nwhat to do. I know it's common to recommend bonds, but not sure this makes sense\nin a taxable account hence why I was considering 100% VTI.…",
  "data/reddit-stocks/r/stocks/comments/s0tuqt/tsla_bounce_after_1000_resistance_point.json": "TSLA dropped below $1,000 today, I believe to $980, and popped back up. Anyone\nelse tracking this and making a buy? Seems like that 1k support is pretty\nreliable. The last time I saw it bounce at 1k was 2.5 weeks ago.",
  "data/reddit-stocks/r/stocks/comments/s12k4d/100_on_stocks_for_a_baby.json": "This might sound a bit silly, but my son’s grandfather gave him $100 for\nChristmas and instructed me to “buy stocks and leave it there for him”. Given my\nson is 1 year old, and I have zero experience with stocks, the cash has just\nbeen sitting on my dining room. I want to respect his grandfather’s…",
  "data/reddit-stocks/r/wallstreetbets/comments/s10ona/seems_like_someone_sued_robinhood_for_turning_off.json": "Here the link to the news!\n\nhttps://www.marketwatch.com/story/a-27-year-old-truck-driver-just-became-robinhoods-first-big-headache-of-2022-11641856157",
  "data/reddit-stocks/r/wallstreetbets/comments/s0xd88/gather_round_autists_of_old_lets_put_this.json": "Anyone complaining of \"cult-like\" stock buying and stock following in this sub\nare the true retards. This sub has ALWAYS had autists yoloing because \"Fuck it\"\nand \"Lambos or Ramen\". Anyone remember the cult following behind TSLA? We ALL\nmade tendies - the true autists anyways. It had waaaayy more…",
  "data/reddit-stocks/r/stocks/comments/s11e94/today_was_wild.json": "The bear was mulling the bull early on but at 1 P.M EST, the bull got a second\nwind and ko'ed the bear. What a wild day. The stock market is predictably\nunpredictable.\n\nYes, the market has appeared particularly chaotic of late, with stocks dropping,\njumping, dropping, and jumping again.\n\nThis isn’t…",
  "data/reddit-stocks/r/stocks/comments/s12ws4/whats_up_with_the_poor_performance_of_the_video.json": "CHART [https://i.imgur.com/9hz6nfk.png]\n\nToday's announcement of the TTWO offer for ZNGA highlights the struggles of that\nentire industry. Most of the major players trail the S&P 500 since the start of\n2022, 2021 and 2020. Every stock in that industry's Finviz group is at least 14%\noff its 52-week…",
  "data/reddit-stocks/r/wallstreetbets/comments/s11upg/is_it_illegal_to_purposely_get_margin_called_in.json": "I just found out that the shitty brokerage Robinhood has a market cap of over 13\nbillion. And I’d like to short it.\n\nMy plan is to short it or buy puts using another brokerage. Then purposely lose\nmoney and get margin called on my Robinhood account. I would then delete the app\nand never pay them…",
  "data/reddit-stocks/r/stocks/comments/s169qy/in_prepared_marks_for_his_senate_confirmation.json": "Federal Reserve Chair Jerome Powell said the central bank will prevent higher\ninflation from becoming entrenched while cautioning that the post-pandemic\neconomy might look different than the previous expansion.\n\n“We will use our tools to support the economy and a strong labor market and to\nprevent…",
  "data/reddit-stocks/r/Bogleheads/comments/s173jx/xpost_rpersonalfinance_i_made_a_webbased.json": "http://forsyth.im/stasis\n\nHey guys.\n\nAbove is a link to a web based portfolio rebalancer that I originally just wrote\nfor myself. I got tired of looking up quotes and punching numbers into a\ncalculator manually, so I wrote a little app that speeds things up considerably.\n\nAll you have to do is…",
  "data/reddit-stocks/r/stocks/comments/s1bnn1/stocks_that_will_dip_50_or_more_in_2022.json": "We've already seen a 30~50% market correction on some overvalued stocks like\nPLTR, DASH, PTON, ZM, RBLX in the second half of 2021.\n\nWhat stocks do you think can further crash by 50% or more in 2022?\n\nSome companies that I'm bearish on\n\nRIVN and LCID - Self explanatory. Still valued similarly as…",
  "data/reddit-stocks/r/investing/comments/s15lz9/in_prepared_marks_for_his_senate_confirmation.json": "Federal Reserve Chair Jerome Powell said the central bank will prevent higher\ninflation from becoming entrenched while cautioning that the post-pandemic\neconomy might look different than the previous expansion.\n\n“We will use our tools to support the economy and a strong labor market and to\nprevent…",
  "data/reddit-stocks/r/investing/comments/s18c7p/what_if_you_put_6000_into_roth_then_get_a_raise.json": "Let's say you make $100,000 a year and contribute your standard 6000 limit every\nJanuary 1. But what happens if, say, in July of the same year you get a new\nposition that pays $250,000 -- that is, it makes you ineligible for a roth\ncontributions but you already made a contribution in the calendar…",
  "data/reddit-stocks/r/Bogleheads/comments/s101hp/how_does_foreign_tax_credit_work.json": "If I buy VXUS in a non-vanguard broker, and DCA throughout the year, how do I\nend up claiming the FTC? Morever, how would this play out for other ETFs like\nCQQQ? And finally- can you apply this to individual stocks / ADRs?",
  "data/reddit-stocks/r/Bogleheads/comments/s1e6i9/role_of_cash.json": "What's the Boglehead view on the role of cash in a portfolio. Is there any role\nfor it? Why cash vs bonds? Pros/cons?",
  "data/reddit-stocks/r/Bogleheads/comments/s1d5fs/have_about_100k_to_throw_in_market_for_retirement.json": "Title. Also, lump sum or DCA? I've lump-summed 125k when I was new to taxable\naccounts back in Feb 2020. COVID killed that value pretty quickly. Soon as I\nbroke even, I withdrew the money. Been sitting on it since and need to put it\nback in as I missed out on 20% gains. Learned my lesson the hard…",
  "data/reddit-stocks/r/Bogleheads/comments/s1jqar/the_classic_boglehead_hold_the_world_portfolio_is.json": "Like Jack said I think there is a part of our human nature thats to not be\naverage and make things more complicated. However, in this case “average” puts\nyou in the 90% percentile of professional investors. Therefore, I think we\ndrastically underestimate for how many people (90%+ not retired) this…",
  "data/reddit-stocks/r/stocks/comments/s1o2cf/here_is_a_market_recap_for_today_tuesday_january.json": "PsychoMarket Recap - Tuesday, January 11, 2022\n\nAfter one of the wildest days I’ve experienced in the market, stocks carried on\nyesterday’s momentum, with all three major indexes advancing as market\nparticipants digested new testimony from Federal Reserve Chair Jerome Powell.\n\nMarkets Today\n\n * S&P…",
  "data/reddit-stocks/r/stocks/comments/s1ilj9/how_would_you_invest_100k_right_now.json": "A close family relative recently asked me about investing and how i would invest\n100k in stock. However i dont have too much knowledge on the stock market and\nmostly keep up with it out of pure Interest and dont invest alot of money\nmyself, therefore my knowledge is very limited.\n\nWe mainly want to…",
  "data/reddit-stocks/r/Bogleheads/comments/s1il75/some_confusion_on_index_funds.json": "Hello All- want to open by saying this forum is awesome and has taught me a lot.\nI’m finishing Bogle’s Little Book of Simple Investing now, and opened/maxed out\nmy wife and my ROTH IRA’s last year.\n\nI seem to have some confusion on where I should allocate my funds within the IRA\n(we use Fidelity).…",
  "data/reddit-stocks/r/stocks/comments/s1mhr7/what_am_i_not_understanding.json": " 1. 61.9% labor participation rate\n    [https://www.bls.gov/charts/employment-situation/civilian-labor-force-participation-rate.htm]\n 2. Inflation\n 3. Printing money [https://fred.stlouisfed.org/series/CURRCIR]\n 4. Supply chain problems\n 5. Covid is only getting worse\n\nYet SP500 is near ATH. I'm no…",
  "data/reddit-stocks/r/stocks/comments/s1pdj8/is_uranium_a_good_longterm_investment.json": "Title, basically. I'm pretty new to investing, and I heard some good things\nabout uranium as a potentially undervalued investment. Information on it is\npretty lacking, however- it seems like there was an attempt at a squeeze of it\nin September 2021, and it's remained somewhat steady since then. The…",
  "data/reddit-stocks/r/Bogleheads/comments/s1phnx/vt_and_chill_in_portugal_as_a_us_citizen.json": "My wife and I have been thinking of working remotely and living in Portugal in\nthe future, but I've realized that the investment situation is a lot more\ncomplicated.\n\nDoes anyone know what boglehead options are available to individuals in the\nsituation? We'd both become Portuguese residents but…",
  "data/reddit-stocks/r/investing/comments/s1qefh/buying_stocks_vs_leaps_contracts.json": "If there’s a company you are very bullish on long-term, is there any reason not\nto just buy LEAPS instead of shares outright? This could be extremely risky for\n“meme” stocks or stocks with poor fundamentals, but I was considering using this\nstrategy mostly for ETFs like SPY or QQQ or companies with…",
  "data/reddit-stocks/r/Bogleheads/comments/s1o24u/how_do_you_allocate_money_that_you_need_in.json": "I'm maxing my retirement accounts and iBonds already. Retirement accounts are in\n80/20 equity/bond index funds with $47k being added annually.\n\nBut I need a taxable account for a specific goal.",
  "data/reddit-stocks/r/investing/comments/s1tja5/0_expense_ratio_mutual_funds_vs_indexed_etfs.json": "I have a taxable brokerage and ROTH IRA with Fidelity. A Fidelity advisor I met\nwith recently suggested a two things that I am hoping to get some thoughts on.\n\n1) He said in a taxable account, generally an indexed ETF is more tax efficient\nthan an equivalent indexed mutual fund. His explanation was…",
  "data/reddit-stocks/r/Bogleheads/comments/s1d0e4/etf_fund_with_sustainability_and_ethical.json": "My partner has asked me about looking into a fund, most likely attached to a\nVanguard ISA where a little bit of money can be put into investments of\nethical/sustainability minded companies each month rather than a savings\naccount. I appreciate this may not be the place to ask however I can't think…",
  "data/reddit-stocks/r/Bogleheads/comments/s1kpat/places_to_invest_in_vti.json": "Quick questions Bogleheads.\n\nThose it matter if one invest at places lime M1 or Robinhood or is just beat to\ngo straight to the source and invest at Vanguard?",
  "data/reddit-stocks/r/stocks/comments/s1tuxg/axios_white_house_braces_for_brutal_inflation.json": "https://www.yahoo.com/now/white-house-braces-brutal-inflation-012747187.html\n\nThe White House is bracing for another bad report Wednesday on inflation — but\nnow expects it to slow down by the end of the year, administration officials\ntell Axios.\n\nWhy it matters: The Biden administration had been…",
  "data/reddit-stocks/r/investing/comments/s1o045/monetary_inflation_graphs.json": "I don't know if this is the correct forum to ask this question so please delete\nif this is too off topic. I am trying to find a graph or a visual of USD\nmonetary inflation per year but everything I find keeps directing me back to CPI\nand that's not what I'm wanting. Are there any graphs or visuals…",
  "data/reddit-stocks/r/wallstreetbets/comments/s1uf49/the_fed_is_trapped_they_have_to_hike_rates_but.json": "The fed has fucked up. Inflation wasn't transitory and their favorite measure,\ncore PCE, is the highest it's been in 4 decades.\n\nNow they have to look like they are fighting inflation by raising rates and\ntapering asset purchases. They are talking quite a big game right now. Many fed\nofficials are…",
  "data/reddit-stocks/r/Bogleheads/comments/s1pd04/34_years_old_receiving_postipo_equity_for_the.json": "I’m new to having this amount of disposable income thanks to getting very lucky\nwith the timing of a company I joined pre-IPO. My 4yr grant was worth $850k a\nfew months ago, but has since lost a lot of value (now in the 400s) as it is one\nof the growth stocks getting beat up. It seems to be…",
  "data/reddit-stocks/r/investing/comments/s1l459/has_anyone_here_actually_invested_with_a_hedge.json": "I'm considering one and wondering what the onboarding process is like, what\ninformation I need to gather in advance, questions to ask, etc. Is there\ntypically a zoom call to interview each other or something?\n\nI understand the investment niche well and have followed them for some time. But\nare…",
  "data/reddit-stocks/r/stocks/comments/s26d2l/inflation_rises_7_over_the_past_year_to_the.json": "The consumer price index for December 2021 was expected to increase 7% from a\nyear ago, according to economists surveyed by Dow Jones.\n\nInflation rises 7% over the past year to the highest level since 1982\n\nThe consumer price index, a gauge that measures costs across dozens of items,\nincreased 7%,…",
  "data/reddit-stocks/r/stocks/comments/s25njq/why_do_all_the_best_stock_traders_go_into_politics.json": "I just can’t fathom it. They’re so good at trading stocks. I mean look!\n\nhttps://imgur.com/a/UyqR26z\n\nThey outperform SPY, which 99% of Hedge Funds (filled with ‘genius’ investors)\nfail to do\n[https://www.aei.org/carpe-diem/the-sp-500-index-out-performed-hedge-funds-over-the-last-10-years-and-it…",
  "data/reddit-stocks/r/Bogleheads/comments/s22l1d/differences_between_vanguard_sp_500_offers_and.json": "Hello guys :)\n\nBeginner inverster, I started looking at DCAing an index fund. So I read a lot\nabout it, and here I am wanting to start with the S&P 500.\n\nAaaaaaand I'm lost :)\n\nThere are so many different references for the same index fund by the same\ncompany... So I started looking for the…",
  "data/reddit-stocks/r/investing/comments/s26br1/most_recent_consumer_price_index_print_is_at_7.json": "This morning at 8:30am eastern it was announced that the US Consumer Price Index\nhad reached '7%' Year over Year and 5.5% YoY excluding food and energy. However\nthere are a lot of analysts and economists thinking this year with fed rate\nhikes that they should hopefully slow down this high…",
  "data/reddit-stocks/r/wallstreetbets/comments/s1vxmg/robinhood_pays_trader_30k_settlement_for_losses.json": "https://www.marketwatch.com/story/a-27-year-old-truck-driver-just-became-robinhoods-first-big-headache-of-2022-11641856157\n\nFile a Complaint Here:\nhttps://www.finra.org/investors/need-help/file-a-complaint",
  "data/reddit-stocks/r/Bogleheads/comments/s1xpje/investing_after_401k_and_ira.json": "I have maxed out my Roth 401k (Fidelity target-date fund through an employer)\nand Roth IRA (100% VTSAX) and wanted to know if I could use a similar approach\nthrough a brokerage to store money that could be used for a down payment for a\nhouse in 3-5 years. I have an emergency fund saved in an HYSA…",
  "data/reddit-stocks/r/Bogleheads/comments/s29jhv/switching_from_active_to_passive_investing_after.json": "I consider myself a fairly competent and sharp person, but when it comes to\ninvestment decisions, my track record is abhorrent. I passed on Bitcoin\npre-2015, and Ethereum pre-2018. I sold NVIDIA when I was 14 years old (2007\ncustodial account), I barely broke even during the 2020 crash, and my…",
  "data/reddit-stocks/r/stocks/comments/s25x95/if_youre_going_to_pick_stocks_you_need_a_venture.json": "We've all heard the warnings, \"don't pick individual stocks, just buy a broad\nmarket index fund.\" But I enjoy picking stocks, I like researching companies and\nspeculating on the future. So, I decided to dig deeper into the rationale behind\nthis advice to understand how I might make stock picking…",
  "data/reddit-stocks/r/stocks/comments/s29rce/who_cares_about_cathie_wood.json": "I don't get it. I see it here, I see it on other subs, I get it in my daily\nnewsletters. Everybody is talking about Cathie Wood, Cathie Wood, Cathie Wood.\n\nWho the fuck cares? She's a fund manager. One of thousands, if not tens of\nthousands of fund managers. Her fund sucks, so do many others and…",
  "data/reddit-stocks/r/wallstreetbets/comments/s22iu0/study_finds_cannabis_prevent_covid19_infection.json": "The tides have turned.\n[https://preview.redd.it/3exs1cb098b81.jpg?width=1353&format=pjpg&auto=webp&s=831d20659b10802f329c1d882d108955dd385e33]\n\nToday the news about medical marijuana blocking Covid-19 binding to cells came\nout. This puts the company Tilray, and the whole sector, in a whole new…",
  "data/reddit-stocks/r/stocks/comments/s2cd9e/closed_on_my_first_option_today_and_i_can_see_the.json": "I spent 10k 4 days ago for a QQQ call option with a Friday expiration. I was\nvery anxious about the possibility of losing all that money, but figured the\nsell off was likely to bounce back a little within a week. Ended up selling\ntoday after over a 100% gain! That's more than I made with 40k in…",
  "data/reddit-stocks/r/Bogleheads/comments/s267d6/looking_for_more_boglehead_perspectives_on_the.json": "Hello everyone I've been lurking a lot recently on Bogleheads. First I would\nlike to thank you for the interesting and respectful analysis I see here.\nRecently I saw someone post about dividend ETFs and having dividend paying\nstocks in a small percentage of their tax advantaged account. Some…",
  "data/reddit-stocks/r/Bogleheads/comments/s2ibl1/what_happens_if_everyone_bogles.json": "To preface, I’ve only been investing for about a year and I’m 100% VTWAX. I’m\nfollowing the Boglehead mentality if only for its simplicity and safe returns.\n\nI was recently listening to the NPR Planet Money Summer School podcast episode\nabout investing in index funds (“Index Funds and The Bet”),…",
  "data/reddit-stocks/r/stocks/comments/s2i3cp/received_23_shares_of_carvana_stock.json": "Carvana gave every employee 23 shares of stock for selling their millionth car.\nSupposedly it is worth $5000 before taxes, I was just curious if I choose to\njust sell my stocks how do I calculate how much taxes would come out of the\n$5000? I actually have $5500 because I already had $500 worth of…",
  "data/reddit-stocks/r/stocks/comments/s2i2fv/here_is_a_market_recap_for_today_wednesday.json": "PsychoMarket Recap - Wednesday, January 12, 2022\n\nStocks rose on Wednesday despite a new report on inflation coming out this\nmorning, which showed the fastest rate of increase in consumer prices since\n1982. The inflation report comes the day after Fed Chairman Jerome Powell\ntestified before…",
  "data/reddit-stocks/r/stocks/comments/s2pl5n/josh_hawley_and_jon_ossoff_offer_bills_to_end.json": "Republican Sen. Josh Hawley of Missouri and Democratic Sen. Jon Ossoff of\nGeorgia are introducing competing bills to end stock-trading by members of\nCongress.\n\nA key difference between the proposals is reportedly that Ossoff's bill includes\ndependent children — who may have access to the same…",
  "data/reddit-stocks/r/Bogleheads/comments/s2ri87/it_hurts_hearing_the_bad_stories.json": "Thankfully found indexing a few years back (I was Bogling before I even knew\nBogleheads was a thing!) and have stayed the course. Posts from this r/ always\nhelp.\n\nTalked with a friend today that had bet big on specific companies and not only\ndidn’t make any money, but actually lost quite a bit of…",
  "data/reddit-stocks/r/stocks/comments/s2row0/sen_tommy_tuberville_once_again_bought_alibaba.json": "> Sen. Tommy Tuberville of Alabama, who has been a staunch critic of China and\n> companies there, yet again bought stock and options in Chinese e-commerce\n> giant Alibaba last month, a new disclosure report reveals.\n\nBABA has been doing well recently and is getting more and more attention. Do…",
  "data/reddit-stocks/r/investing/comments/s2wy7q/investors_are_paying_millions_for_virtual_land_in.json": "Real estate in virtual worlds — sometimes called the metaverse — is going for\nmillions of dollars in some cases.\n\nThe most expensive spots are near where lots of users congregate — for instance,\nsomeone recently paid $450,000 to be Snoop Dogg’s neighbor in a virtual world\ncalled the…",
  "data/reddit-stocks/r/investing/comments/s2oa5a/hey_rinvesting_ive_been_meaning_to_diversify_my.json": "So I've been meaning to diversify my portfolio to emerging markets and have been\ntracking the Indian markets since last year as a potential market I could invest\nin. I see their stock market has been blowing up for the past few years breaking\nnew highs almost every month. I was looking at a few…",
  "data/reddit-stocks/r/stocks/comments/s2v433/tsmc_quarterly_profit_rose_164_yoy_plans_to_spend.json": "Big news for the semi's. How are you guys going to play this one?\n\nSources:\n\nhttps://asia.nikkei.com/Business/Companies/TSMC-plans-to-spend-record-44b-on-capacity-expansion-in-2022\n\nhttps://www.reuters.com/technology/tsmc-q4-profit-rises-164-beats-market-forecasts-2022-01…",
  "data/reddit-stocks/r/stocks/comments/s2y61e/china_critic_sen_tommy_tuberville_once_again.json": "China critic Sen. Tommy Tuberville once again bought Alibaba stock and options.\n\nTuberville made three separate purchases of Alibaba shares valued at as much as\n$300,000 in total.\n\nhttps://www.cnbc.com/2022/01/12/china-critic-sen-tommy-tuberville-of-alabama-bought-alibaba-stock.html",
  "data/reddit-stocks/r/Bogleheads/comments/s31fl1/im_joining_the_bogleheads_for_a_unique_reason.json": "Long-time lurker. I've been a big fan of finding good entry points on stocks\n(while also having VOO/VXUS in my tax account and VT in my Roth).\n\nBut...I'm having twins! Well, the wife is, and I realized that I can't be\nwasting so much time researching companies, refreshing stock prices, jumping…",
  "data/reddit-stocks/r/Bogleheads/comments/s2zq00/all_in_on_vtsax_but_loosing_my_nerve_considering.json": "Wife and I are mid 30's but spent some time getting debt free before we started\ninvesting so pardon the low numbers. Right now we are both maxing 401ks,\nbackdoor Roth IRAs, and we autoinvest $5,000 a month in index funds. All of it\nis in VTSAX but wondering if I should keep investing $113,000…",
  "data/reddit-stocks/r/Bogleheads/comments/s2ooxh/emergency_fund_investment.json": "Sorry if this question was already asked; newbie here.\n\nI have accumulated about 6 months worth of expenses and have them stored in a\nregular saving account. Growing up, everyone I talked to about finances, even\nprofessionals, have to me to keep my emergency fun liquid in a savings account.\n\nNow,…",
  "data/reddit-stocks/r/investing/comments/s35972/with_an_80_jump_in_margin_use_among_individual.json": "With an 80% jump in margin use among individual investors over the last 2 years,\nhow much margin do you currently have (as a percentage of your portfolio)? And\nat what rate? Do you plan on reducing your margin amount as rates increase this\nyear and if so, how/how much?\n\nI.e. I’m currently borrowing…",
  "data/reddit-stocks/r/wallstreetbets/comments/s2j75i/the_wall_st_mentality.json": "If algos treat GME and AMC the same, that demonstrates where Wall St's head is\nat. AMC's enterprise value is more than 2.5x GME, but GME has way better\nprospects and financial health. Wall St is wrong on GME again because they're\nnot hedged appropriately for its long term business potential. They…",
  "data/reddit-stocks/r/stocks/comments/s32e1r/why_are_nasdaqs_small_and_micro_caps_crashing.json": "Since early 2021, a lot of small and micro stocks traded on the Nasdaq have\ndropped more than 50%. A lot of those are biotech and healthcare companies that\nalready had low valuations. Will they rebound and is it a good buying\nopportunity at this point? Thanks for the advice. Number of Nasdaq Stocks…",
  "data/reddit-stocks/r/Bogleheads/comments/s36quq/just_hit_the_20_savings_mark.json": "I've been doing the Boglehead thing for a bit over 10 years and it's been a\nlittle slow as I have 3 kids and no shortage of regular expenses. But as my pay\nhas crept up, we've kept our spending pretty flat, and I've allocated pay bumps\nto retirement savings. This month, my mortgage insurance…",
  "data/reddit-stocks/r/stocks/comments/s3a3ko/its_been_disheartening_to_see_the_funds_i_get.json": "I’m a young, inexperienced investor. I essentially have a group of blue-chip\nstocks, and then VOO/QQQ. I put most of the money I’m able to save after all of\nmy necessary living expenses, into VOO/QQQ, then followed by the blue-chips (in\nother words, VOO/QQQ are funded first, then any remaining…",
  "data/reddit-stocks/r/stocks/comments/s3b09g/why_did_spy_drop_today_so_much_wasnt_inflation.json": "I feel like everyone knew it will fall hard today because there wasn't much\nwhipsaw at the open. I read every possible news before the market open and\nmanaged to miss. Is there any rationale behind todays drop and how to predict it\nin the future?",
  "data/reddit-stocks/r/stocks/comments/s300se/rivian_why_i_am_doubtful.json": "Rivian Automotive\n\nMarket Cap: 76.4B Employees: 11,000+ Cars Delivered: 920 Daniel Foelber said\n“Raising an eyebrow or two at Rivian's lofty valuation isn't unwarranted given\nthe company is even more unproven than other up-and-coming EV companies like\nLucid Group and Nio. However, one of the…",
  "data/reddit-stocks/r/stocks/comments/s3equf/i_messed_up_bad.json": "I'm down heavily on some of my investments. I invested in MTCH at $160 (now\n$123), Robinhood at $50 (now $14), Affirm at $109 (now $72), Farfetch at $45\n(now $27) and some other smaller investments that are also running me a loss.\n\nI can't believe I gave into the hype. Looking back at the time of…",
  "data/reddit-stocks/r/Bogleheads/comments/s3d8hk/why_do_bogleheads_hate_dividend_investing.json": "also why do we hate REITs?",
  "data/reddit-stocks/r/stocks/comments/s3bfqf/here_is_a_market_recap_for_today_thursday_january.json": "PsychoMarket Recap - Thursday, January 13, 2022\n\nVolatility resumed in the markets after a brief two-day rally, as market\nparticipants digested new weekly unemployment data and the monthly CPI and PPI\nreports, which showed the fastest pace of inflation in decades.\n\nMarkets Today\n\n * S&P 500 (SPY): …",
  "data/reddit-stocks/r/stocks/comments/s2wgf4/rstocks_daily_discussion_options_trading_thursday.json": "This is the daily discussion, so anything stocks related is fine, but the theme\nfor today is on stock options, but if options aren't your thing then just ignore\nthe theme and/or post your arguments against options…",
  "data/reddit-stocks/r/Bogleheads/comments/s3eih0/what_convinced_you_to_become_a_boglehead_what.json": "Just some general questions about your journey to becoming a Boglehead!\n\nDid you think you could time the market? What convinced you otherwise? What was\nthe hardest part about moving to a passive portfolio?",
  "data/reddit-stocks/r/stocks/comments/s39icm/stock_i_bought_took_a_40_nosedive_shortly_after.json": "I recently bought a few shares of Hubspot (Ticker: HUBS). It seemed to be\nunstoppable going up, hitting $850 a share, so I went in in the mid 700's when\nit dipped. I have been using the tool myself for a few years and I can see the\ncompany continuing to evolve.\n\nShortly after I purchased it started…",
  "data/reddit-stocks/r/investing/comments/s2v2if/what_do_you_think_the_is_the_current_requiredrate.json": "So, to value stocks you need to have an idea of the required-rate of return\n[https://www.investopedia.com/terms/r/requiredrateofreturn.asp](RRR).\n\nI know Peter Lynch has suggested using an RRR of 6%, but that was probably\nwritten in a time when bond-rates were higher than today. Presumably the RRR…",
  "data/reddit-stocks/r/investing/comments/s3g457/what_could_you_do_with_100_a_month.json": "Good evening everyone, just coming here with a conversation I had with a friend\nearlier today.\n\nIf you were given $100 a month to make investments with what would you do? Do\nyou even believe that would he enough to put towards anything that would see a\nsolid return over time?\n\nWe were trying to…",
  "data/reddit-stocks/r/stocks/comments/s3ij0i/coming_into_an_inheritance_of_100k_what_should_i.json": "I'm a fairly new investor, I have about $15K in the market already but I've\nnever really managed funds like this. I've heard the term compound interest, and\ndon't let it sit in a savings account. Open to suggestions. Don't have any\ndebts, and am fairly young.",
  "data/reddit-stocks/r/stocks/comments/s3dg4h/thoughts_on_cloudflare.json": "On the one hand, its technology is used widely on the internet and also could be\nused for IOT in the future, perhaps even metaverse due to edge computing and\nCDNs helping provide fast real-time experiences. On the other hand, that P/S of\nover 50 (despite the recent crash).\n\nThoughts on…",
  "data/reddit-stocks/r/Bogleheads/comments/s31hua/fidelity_vs_vanguard_vs_schwab.json": "Is there any practical difference, for purposes of rolling over an old employer\n401(k)?\n\nJust sort of seeing if people have any observations on fund offerings, customer\nservice, or any other deciding factors they used. Thanks for all opinions! 😊",
  "data/reddit-stocks/r/stocks/comments/s3gxht/arkk_vs_nasdaq_11_month_ago_and_now.json": "https://twitter.com/awealthofcs/status/1481737137351540736?s=20\n\nIf you were early -- really, anytime prior to 2021 -- she did make you a ton of\nmoney.\n\nBut a May 2021 Barron’s column noted \"The majority of the inflows into the ETF\nhave come in the last 9 months;\" past 12 months $ARKK is down…",
  "data/reddit-stocks/r/investing/comments/s3hpq8/should_i_close_my_roboadvisor_and_reinvest_or.json": "Background, I (27) put a decent chunk of change into a taxable Schwab\nIntelligent Portfolios robo advisor back in 2019. It has made some nice gains\nand I continue to contribute to it bi-weekly after maxing out retirement\naccounts, BUT it certainly has not kept pace with the market.\n\nI originally…",
  "data/reddit-stocks/r/stocks/comments/s3nq3j/going_through_2nd_forclosure_while_sitting_on_a.json": "So I just sold my house was clean g out the garage and found these stock\ncertificates from 1968 that my grandfather purchased. He died in 1983 and my\nmother and my uncle (who's an ass) would be the inheritants. There's about a\ndozen of them all counter signed and registered but definitely not…",
  "data/reddit-stocks/r/stocks/comments/s3ovvw/why_are_people_underestimating_the_antitrustlegal.json": "Title basically. Facebook is the chief culprit but there are probably others at\nrisk like Google.\n\nJust in the last week we've had:\n\nThe attempt to dismiss the FTC case thrown out\n[https://news.sky.com/story/facebook-loses-attempt-to-dismiss-antitrust-lawsuit-demanding-it-sells-whatsapp-and…",
  "data/reddit-stocks/r/investing/comments/s3v102/best_roth_ira_mutual_fundsetfs_through_vanguard.json": "Hello. Basically I’m looking at redoing my Roth IRA. I’ve only had it for a year\nand maybe I’m being too anxious about is but I just think there has to be better\nmutual funds or an etf ratio that I could do. Currently I’m with vanguard and I\nhave their life strategy fund. I have and 80/20 mix with…",
  "data/reddit-stocks/r/stocks/comments/s3touc/apple_aapl_stock_receives_three_price_targets.json": "Three price target hikes on AAPL today, mostly on AR/VR and iPhone demand.\n\nhttps://www.streetinsider.com/Analyst+Comments/Apple+%28AAPL%29+Stock+Receives+Three+Price+Targets+Hikes+Today%2C+Wedbush+Positive+on+Live+Sports+Content+Opportunity/19461164.html",
  "data/reddit-stocks/r/stocks/comments/s3vou0/how_low_are_we_expecting_this_to_go_and_when_do.json": "I know of course no one knows the future, but it's fair to say most people who\nhad a price target for when they wanted to enter into many stocks, have well\nreached that, only to see it now plummet even further. At this point, figured\nwould grab opinions on how low we theoretically think our common…",
  "data/reddit-stocks/r/stocks/comments/s3xro1/my_great_grandmother_gave_me_100_shares_of.json": "This is the best gift I have ever received. I ended up not needing it for\ncollege, so I was able to purchase a used car outright a few years after\ngraduation, I was able to put a down payment on my first house, and I still have\nsome leftover. It has helped me build my savings as well. I have…",
  "data/reddit-stocks/r/stocks/comments/s3p9kn/rstocks_daily_discussion_fundamentals_friday_jan.json": "This is the daily discussion, so anything stocks related is fine, but the theme\nfor today is on fundamentals, but if fundamentals aren't your thing then just\nignore the theme and/or post your arguments against fundamentals…",
  "data/reddit-stocks/r/stocks/comments/s3z6m4/please_for_the_love_of_anything_that_is_good.json": "I understand that sub is for speculation and conversation, but these desperate\ncries from bagholders is really cringy to see every day. SPY is down, SPY has A\nLOT more room to go down. Covid, America, labor shortages, supply shortages,\nholy fucking shit. We all know this economy is propped up on a…",
  "data/reddit-stocks/r/stocks/comments/s3xhzn/is_this_a_good_buy_opportunity_for_growth_stocks.json": "Given that I hold my portfolio in S&P 500 only, would it be a good opportunity\nto purchase different growth and/or speculative stocks?\n\nThere are massive corrections and I am wondering what would be a good indication\nof market overreaction. Would you recommend to start DCA-ing now or wait for…",
  "data/reddit-stocks/r/investing/comments/s3z0z5/can_i_invest_in_a_company_i_work_for.json": "Looking to start investing and the company I work for has performed amazingly\nover the past couple of years. However, I'm unsure about the legality of it. I\nam not exactly high up - I only work part-time, as I'm a full-time student. I'm\nalso pretty low-level, and it is a huge company.\n\nA good…",
  "data/reddit-stocks/r/investing/comments/s3u8lh/software_is_eating_value_investors.json": "Hey guys,\n\nI thought I would share some of my thoughts regarding the tension between value\ninvesting and software businesses. Would love some of your comments and feedback\non this to see if you agree / disagree with particular parts.\n\n---\n\nValue investing is a form of allocating capital based on…",
  "data/reddit-stocks/r/investing/comments/s3ykxa/investing_in_a_roth_for_your_children_inheritance.json": "I have given my adult children money to invest in their Roths as soon as they\nhad income. I see this as a wealth transfer and gives them a huge start as time\nis on their side.\n\nI am about six years into this and it has been a great learning experience for\nthem. I have an annual chart showing their…",
  "data/reddit-stocks/r/Bogleheads/comments/s4ac6x/extra_150000_tax_bill_for_my_2021_returnthanks.json": "I feel so burned by Vanguard. I have been investing regularly in VTTHX (Target\nRetirement 2035) for nearly 20 years. First it was my tax deferred accounts and\nthen when those were maxed out, I put extra money in my business into taxable\naccounts. I remember the Target Retirement funds were new when…",
  "data/reddit-stocks/r/Bogleheads/comments/s42sau/total_noob_with_10k_to_invest_60vti_40vxus.json": "Yup was totally lost and a kind stranger recommended r/bogleheads\n[/r/bogleheads]. I’m 35, no kids, no assets other than savings and\npension&retirement plans from a job. I have 10-20k I can invest instead of\ncollecting dust in the savings account but the rest has to stay there since I\nmay start…",
  "data/reddit-stocks/r/stocks/comments/s43j0e/here_is_a_market_recap_for_today_friday_january.json": "PsychoMarket Recap - Friday, January 14, 2022\n\nAs a reminder, the market will be closed Monday to celebrate Martin Luther King\nJr Day. Have a wonderful long weekend.\n\nStocks ended the day mixed in another highly volatile session, with both the S&P\n500 (SPY) and Nasdaq (QQQ) pushing sharply higher…",
  "data/reddit-stocks/r/investing/comments/s4dw8q/what_is_your_highest_held_stock.json": "Lads,\n\nI'm curious as to what most of you hold!\n\nI currently hold 4800 DIV stocks, DIV is a Canadian company, my highest stock\namount.\n\nBeing canadian I'd rather hold stocks that don't hold a percentage % of\ndividends when they're distributed. I'm still interested in what you lads have!\n\nI've…",
  "data/reddit-stocks/r/stocks/comments/s3z5fg/a_warning_if_your_companies_are_not_selffunding.json": "I’ve seen a lot of people in here distressed that stocks are down. If you’re\nreally a long-term investor,and your businesses are performing well, and you\nhave an adequate cash reserve, then you should not give a shit about whatever\ntantrum the market is having today or even over the next few…",
  "data/reddit-stocks/r/Bogleheads/comments/s4ahss/what_made_you_become_a_boglehead.json": "I switched after a few years of roughly matching the market, but realizing that\nthe time, stress, and risk of individual securities was not worth it. I still\nhold about 10% individual stocks, while 80% is VT and 10% is BND. But enough\nabout me–what made you become a Boglehead?",
  "data/reddit-stocks/r/investing/comments/s4em4m/best_etfs_to_place_large_amount_of_cash_in_401k.json": "So I'm 29, i just liquidated a large amount of my employers stock that I held in\nmy 401k (through Fidelity). I plan to put that cash (just over 100k USD) into\nfidelity's Brokerage Link, and park it into some mutual funds for the next 20,\n30 years.\n\nI'm considering 70% FXAIX, 20% FBGRX, not sure…",
  "data/reddit-stocks/r/stocks/comments/s4amym/before_the_fall_cisco_has_beaten_the_estimations.json": "So I was interested in reading about what happened to CISCO once the top notch\ngrowth stock, of course inflated. I found a CNN Money article that got published\njust during the start of the decline mentioned below.\n\n> it was the first time since 1994 that Cisco fell short of the Street's\n> consensus…",
  "data/reddit-stocks/r/stocks/comments/s3vqjc/housing_market_still_jumping_for_now.json": "When the Fed initially lowered interest rates at the beginning of the pandemic\nthe housing market exploded. 30-year fixed mortgage rates dipped below 2.7%,\nspurring the housing market turkey shoot that ensued. For nearly two years, this\nhousing boom has remained steady in the United States, but how…",
  "data/reddit-stocks/r/stocks/comments/s4dozt/how_do_i_learn_about_a_stocks_news_before_the.json": "A lot of times in my experience a stock will just run up for no reason, or drop\n40% out of no where and then 5 minutes or so I hear about dilution or\nacquisitions etc.\n\nIs there anyway to stay up on my stocks current news before the news causes\nsignificant price action? Do I need Benzinga pro or…",
  "data/reddit-stocks/r/Bogleheads/comments/s4ite3/psa_change_your_cost_basis_in_taxable_accounts_to.json": "At least once a day, someone posts about an investment they want out of. Many it\nwas pre-Bogleheads or maybe they don’t want VT anymore but VTI/ VXUS instead.\n\nGetting out of an investment in taxable is easier if you set your cost basis up\nto reflect the actual purchase price of each lot rather…",
  "data/reddit-stocks/r/stocks/comments/s4lh1b/serious_how_rigged_are_finance_news_really.json": "Just wondering - I know you should take EVERYTHING you read about finance with a\ngrain of salt.Im still wondering if I should even bother reading news articles\nfrom big firms like Motley Fool, Yahoo finance ... . I am not sure to what\nextend you can use informations provided by mainstream…",
  "data/reddit-stocks/r/stocks/comments/s4lm43/an_actual_tesla_valuation_model.json": "There's so much to cram into this DD/model that I'm going to try to keep each\npoint brief.\n\nTable of contents:\n1) First, what are the risks; Notes; Disclaimers\n2) Master equation\na) gaap earnings per EV\n---i) model & explanation\n---ii) dropping battery costs\n---iii) increase in efficiency of…",
  "data/reddit-stocks/r/investing/comments/s4j7un/in_whichs_sectors_are_you_going_to_invest_in_2022.json": "Hi, I would like to know in what sectors the majority of you are going to invest\nin 2022. I would also like to know why you are going to invest into that\nspecific sector.\n\nPersonally, I think I'm going to invest into mining stocks. This is due to the\nexpansion of nuclear energy in Europe and the…",
  "data/reddit-stocks/r/stocks/comments/s41813/american_airlines_expects_12b_4q_loss.json": "disclosure: no positions but wish i had bought close to the money puts on cruise\nlines and airlines\n\nlooks like airlines are gonna get spanked in Q4 due to unparalleled canceled\nflights, fuel cost increases, crews falling ill due to covid, airlines flying\nhundreds of empty flights due to a crazy…",
  "data/reddit-stocks/r/stocks/comments/s4mzeq/how_is_the_looming_conflict_in_russiaukrain_going.json": "Just curious, I haven’t seen anyone bring this up. But this seems like a rather\nbig deal. Like it could turn into a more complete annexation and invasion of\nUkraine. The 2014 invasion was partially successful for Russia but I think they\nwanted to take more than they did. I think they might follow…",
  "data/reddit-stocks/r/stocks/comments/s4oral/aswath_damodarans_tsla_valuation_model.json": "I wanted to post this since I saw another guy threw up his own TSLA DCF this\nmorning.\n\nI work in valuation for a living, so I thought it'd be a good idea to introduce\nthe novice investors on this sub to the valuation and financial modelling GOAT -\nAswath Damodaran of NYU Stern…",
  "data/reddit-stocks/r/Bogleheads/comments/s4rui1/should_i_sign_up_for_401k.json": "So, I (40M) have never invested money in my life. I've been reading this sub now\nfor a couple months but the more I read the more confused I get. I was able to\nfigure out how to buy ibonds. Bought 10k in Dec and another 10k in Jan. Step 1\ncompleted haha. Now I'm trying to figure out if I should…",
  "data/reddit-stocks/r/stocks/comments/s4qyrg/your_favorite_growth_stocks.json": "As everyone is talking about rotating to value, I'm thinking maybe now's the\ntime to start looking at growth stocks again. Interest rates are still extremely\nlow and growth has taken a massive hit from just talking about small interest\nrate increases. What are you favorite growth stocks? And why do…",
  "data/reddit-stocks/r/investing/comments/s4wqda/biggest_investment_mistake.json": "Lads,\n\nWhat investment mistake do you often look back on?\n\nLooking to see if people have learned from their mistakes, I for one certainly\nhave. Thankfully it wasn't a huge loss. I've dabbled in penny stocks and sadly\nhave only taken losses on them (haven't sold yet!)\n\nMy Currently loss about 100$,…",
  "data/reddit-stocks/r/stocks/comments/s50ngv/jim_cramer_says_wells_fargo_is_the_number_one_big.json": "Wells Fargo reported fourth-quarter earnings of $1.38 per share, which beat the\nestimate of $1.12 per share. The company reported quarterly revenue of $20.86\nbillion, which came in well above the estimate of $18.78 billion.\n\nCramer said\n\n> \"This is a very good sign of things to come.\"\n\nWould you…",
  "data/reddit-stocks/r/stocks/comments/s4vdrf/thoughts_on_my_largest_bagholds.json": "I am bagholding ROKU bought at $260, PYPL at $230, SQ at $180, and NVDA at $297.\nWhat would you do with these bags? Hold, buy more, sell? Disclaimer: I'll of\ncourse make my own decisions with these purchases but curious what others would\ndo in this case.",
  "data/reddit-stocks/r/wallstreetbets/comments/s4z8i9/youre_all_about_to_lose_a_lot_of_money.json": "I'm going to tell you exactly what's going to happen from here on out because\nwe've seen this 3 times in the past 20 years and it will repeat itself.\n\n 1. 2001: People get scared, blame the dot com bubble, sell everything, and then\n    it skyrockets.\n 2. 2008: People get scared, blame the housing…",
  "data/reddit-stocks/r/Bogleheads/comments/s50do6/inheritance_guilt.json": "I’m receiving a relatively moderate inheritance from my grandpa in a few months.\nMy plan is to pay off my student loans, fund my 2021 and 2022 rIRA, drop a few\ngrand in my sons 529, and gift a grand to each of my brother’s kid’s 529s. After\nall of this I’ll still have roughly $30k for invest in a…",
  "data/reddit-stocks/r/stocks/comments/s4zmsa/nvda_or_msft_for_starting_a_long_term_portfolio.json": "I have around $1000 to play with, I’m only 21 so I understand it’s not a lot to\nplay with but I’d rather put the $1000 into one play for the time being and then\nfocus on diversification later on when I have more money.\n\nI really like NVDA and I think they have an incredible future ahead of them…",
  "data/reddit-stocks/r/investing/comments/s4v6xh/how_do_you_determine_holdings_for_a_roth_ira_vs.json": "Hi, I’m wondering what strategies to keep in mind when determining what to hold\nin a ROTH IRA versus a regular brokerage account. I’m not sure if riskier plays\nare better suited for one versus the other, and if it’s a better idea to park\nsomething like VTI in the ROTH IRA since that is more of a…",
  "data/reddit-stocks/r/Bogleheads/comments/s4wn3n/anybody_use_security_keys.json": "I use Vanguard and have been content with sms codes being sent to my phone when\nan unrecognized device logs in. My Vanguard balance is at high level (based on\npercent of my total assets) and I am thinking about getting a physical security\nkey.\n\nVanguard supposedly supports it, but I am always wary…",
  "data/reddit-stocks/r/stocks/comments/s4rg1z/what_is_the_best_way_to_allocate_capital_when.json": "A lot of my stocks are in bear markets right now. These include CRWD, NET, MRNA,\nDIS, PLTR, TMUS, SQ, PYPL, SAM, and MSTR. With every single one I was in the\ngreen. Tried to be a long term holder and it blew up in my face and now I am\ndown on them all. Then there is the stuff in retrospect I bought…",
  "data/reddit-stocks/r/investing/comments/s53082/high_inflationary_environment_warren_buffett_and.json": "All around the news that US inflation is at 40 year high and we can also feel\nthat while shopping. High inflation is all always a bad thing cause money in our\nhand is lot lesser valued than yesterday. Hope we don't move into hyper\ninflationary environment. Keeping our worry aside and lets focus on…",
  "data/reddit-stocks/r/stocks/comments/s53wbw/for_those_who_were_around_the_2018_correction.json": "How similar/differnet is it from today? From my understanding, the 2018\ncorrection came from fear of central bank monetary tightening. How were the\nmonths leading up to the correction? What was the sentiment like?",
  "data/reddit-stocks/r/stocks/comments/s5d0qx/should_people_invest_in_sp_500_index_funds_in_2022.json": "Hello everyone, I'm looking for a long term investment to invest a percentage of\nmy salarie. A lot of people recommend index funds but I'm also seeing a lot of\npeople comment that the market is very inflated and that the market is going to\ngo down. What do you think? Is VOO a good investment if I'm…",
  "data/reddit-stocks/r/stocks/comments/s4w3yx/oil_gas_the_super_cycle_has_just_begun.json": "Hey everyone! I wanna hear everyone’s thoughts on oil and gas. Oil is knocking\non $85/barrel and the hedge funds/institutions can’t ignore the profits for much\nlonger. Will retail investors follow? (Some are already there) 2022 is the year\nof commodities and the super cycle has just begun!",
  "data/reddit-stocks/r/stocks/comments/s5c51n/stocks_to_pick_in_energy_financial_sectors.json": "I am sure I am very late in buying these sectors as most of it already making\nnew highs. However, assuming these sectors are going to do well for at least\nanother 6 months to a year what would be some stocks you would recommend. There\nmaybe a few that still has bit more upsides left. Let’s hear…",
  "data/reddit-stocks/r/investing/comments/s5f9qo/investing_in_people_is_a_concept_that_has_grown.json": "Let's take a step back from growth vs value discussion, bull vs bear market,\nblue chips vs hyped tech companies, inflation worries and the rise of interest\nrates. From time to time I read about investors who \"invest in people\" not\nnumbers of an up and coming company.\n\nSo aside from product,…",
  "data/reddit-stocks/r/Bogleheads/comments/s5fhbg/small_cap_value.json": "I know there have been a few discussions on this topic, but I wanted to get the\ngroup's latest opinion on what ETF y'all think does the best job for the purpose\nof adding a SCV tilt to a portfolio. I feel like VIOV doesn't quite have the\nvalue concentration and VBR dilutes the small-cap piece by…",
  "data/reddit-stocks/r/stocks/comments/s5jd9v/if_the_pandemic_ends_wont_the_metaverse_fail.json": "So many companies are getting ready to roll out the Metaverse but I just can’t\nsee people wanting to stay home anymore. I know there will be an audience for\nit, but I just think the majority will just not find it appealing to put a\nheadset on after 2+ years of not really going out.",
  "data/reddit-stocks/r/investing/comments/s58p7l/daily_general_discussion_and_advice_thread.json": "Have a general question? Want to offer some commentary on markets? Maybe you\nwould just like to throw out a neat fact that doesn't warrant a self post? Feel\nfree to post here!\n\nIf your question is \"I have $10,000, what do I do?\" or other \"advice for my\npersonal situation\" questions, you should…",
  "data/reddit-stocks/r/stocks/comments/s53owf/the_silver_tsunami_how_will_baby_boomer.json": "According to Wikipedia, the median baby boomer was born in 1955 which puts them\nat age 66 today. Much has been said about employers having trouble finding\nqualified workers recently, and it has been attributed to the pandemic,\nunemployment benefits, and working age adults switching careers or…",
  "data/reddit-stocks/r/Bogleheads/comments/s5g87g/how_do_i_demonstrate_to_a_skeptical_family_member.json": "I start investing about a year and half ago, and started out by buying shares of\nsome companies that I am knowledgeable about and also some companies that I'm\ninterested in.. So far, my returns have been good for most of my picks, but for\nthe last month the stock market has been in the toilet and I…",
  "data/reddit-stocks/r/stocks/comments/s5jig9/should_i_put_all_or_more_of_my_savings_in_the.json": "Hi, (24F) here and I have a couple thousand dollars in savings and Roth IRA. I\nonly have about $700 in the market. I’m kind of scared to put my savings in\nthere bc the market always fluctuates and I don’t wanna lose money. Right now\nthe money in my savings is in a high interest saving account of…",
  "data/reddit-stocks/r/investing/comments/s5mupa/why_arent_more_people_in_their_60s_in_the_us.json": "According to a compounding calculator I just tried, someone who starts with $0\nat age 25 and adds 10k a year until age 60 to an investment account with a\nyearly average ROI of 5% will end up with just shy of a million at age 60. 5% is\na fairly conservative estimated yearly return.\n\nBut according to…",
  "data/reddit-stocks/r/Bogleheads/comments/s5iwny/fire.json": "Is the approach supported here, 80% VTSAX and 20% VTIAX, enough for FIRE? Or are\nthere any other steps someone should be taking?",
  "data/reddit-stocks/r/Bogleheads/comments/s5isvv/vtsax_3000_minimum_investment.json": "Tough for me to DCA with putting up so much money up front for the starting\nminimum investment. Any way around this other than to buy VTI instead?",
  "data/reddit-stocks/r/Bogleheads/comments/s5soiz/put_60k_bulk_into_voo.json": "I am new to Bogleheads and I reading that folks in here prefer bulk over DCA.\nBut, market right now is crazy 🚀\n\nIs bulk still a good strategy as of today? I am 40, expecting 80k bonus pre tax\ndollars. I have 110k remaining on mortgage at 2.75%\n\nEdit: I am planning on putting at least 3k in to VOO…",
  "data/reddit-stocks/r/Bogleheads/comments/s5fter/best_way_to_transfer_employer_ira.json": "I currently have an employer sponsored simple ira with a yearly match. The\nproblem is the provider the employer uses is terrible. Fees are hovering around\n.75% and there aren't many good options on funds to invest in.\n\nMy question is - what is the best way of rolling this over into vanguard? I…",
  "data/reddit-stocks/r/stocks/comments/s62x5o/why_i_fail_to_see_how_the_metaverse_will_succeed.json": "I've read that a lot of people here are super bullish on the Metaverse and\nvarious \"digital words\"\n\nAs a VR consumer and developer I however am very skeptical that the masses will\nflock to an digital world.\n\nThe metaverse is not a new concept, its been around since the 90s if not further\nback.…",
  "data/reddit-stocks/r/investing/comments/s5psvv/if_were_printing_money_at_a_record_pace_why_are.json": "Excuse my elementary-level knowledge of the stock market.. but I want to\nunderstand a basic concept. I’ve heard that a rise in interest rates generally\ncauses asset prices to decrease. Why is that?\n\nWouldn’t it make some sense that if inflation is rising and the fed is printing\nmoney at a fast…",
  "data/reddit-stocks/r/stocks/comments/s64c38/stop_clutching_your_pearls.json": "I'm seeing a lot of pearl-clutching, teeth-gnashing, and dust-throwing about\ninflation and its negative impact on the stock market. Having lived through the\nCarter administration, which was one of the worst inflationary periods on\nrecord, I decided to see how the markets did while he was president.…",
  "data/reddit-stocks/r/wallstreetbets/comments/s663ux/margin_debit_of_over_200k_i_just_logged_out_of.json": "The message threatened to liquidate to pay down the debt, but the retarded algo\nthat sent out this message does not know I have nothing to liquidate - no stock,\nno options, no assets, no cash in any account.\n\nIs there anything else they can do? So far I just am keeping quiet, and\nuninstalled the…",
  "data/reddit-stocks/r/investing/comments/s5zzqo/unilever_shares_fall_6_as_it_defends_50bn.json": "Shares in consumer goods giant Unilever have fallen after it defended its £50bn\ntakeover approach for the consumer healthcare arm of GlaxoSmithKline (GSK),\ndescribing the business as a \"strong strategic fit\".\n\nThe group, whose products range from Domestos bleach and Dove soap to Marmite\nand…",
  "data/reddit-stocks/r/Bogleheads/comments/s69z9i/psa_taxgain_harvesting_may_reduce_your_future_tax.json": "Tax gain harvesting - Bogleheads Wiki\n[https://www.bogleheads.org/wiki/Tax_gain_harvesting]\n\nIf your taxable income in a given year allows you to pay 0% in taxes on some\namount of long-term capital gains, you may want to consider taking advantage of\nthat by selling & immediately rebuying some long…",
  "data/reddit-stocks/r/stocks/comments/s66gug/china_warns_west_against_rapid_interest_rate_rise.json": "https://www.theguardian.com/business/2022/jan/17/china-warns-west-against-rapid-interest-rate-rise\n\n\n\n> China [https://www.theguardian.com/business/chinese-economy] has warned the US\n> and Europe against a rapid rise in interest rates\n> [https://www.theguardian.com/business/2021/dec/15/us-federal…",
  "data/reddit-stocks/r/wallstreetbets/comments/s61lab/using_the_price_of_shredders_to_predict_a_crash.json": "I was browsing some of the other stocks subreddits and someone made the point\nthat if the money printer shuts off, take it as a major warning sign and\nconsider closing out your positions, or try and sell when you hear that the\nmoney printer is going to be shut off.\n\nThen someone made a follow up…",
  "data/reddit-stocks/r/investing/comments/s6gs28/my_oilrenewables_pick_for_potential_10x_returns.json": "With the indices looking increasingly shaky and a further 10-15%+ SPY/QQQ\ndownturn on the cards, I have been looking for sectors that are likely to\noutperform in 2022 to try and find some upside through the turbulence of the\ncoming rate hikes.\n\nWith oil at almost $85 per barrel, up 10% YTD already…",
  "data/reddit-stocks/r/investing/comments/s6i7rc/controversial_opinion_technical_analysis_is_just.json": "I’ve tried to learn technical analysis and the different patterns of stock\ncharts. There’s obviously thousands of courses and online videos about this sort\nof thing. But it seems that almost none of these patterns can be used\nsustainably over long periods of time, as external news events always…",
  "data/reddit-stocks/r/stocks/comments/s6j6zp/literally_no_one_knowsactually_no_one.json": "I keep seeing post, new articles, twitter this, WSB, Hedgefund this guy, etc...\nwith what is going to happen to the markets in 2022. As the title says, nobody\nhas any damn clue, not even the big dogs. The market could go up, down, remain\nflat with no volatility, have lots of volatility, it does…",
  "data/reddit-stocks/r/stocks/comments/s6jnqv/how_can_i_invest_in_roman_catholic_church.json": "Their book value is unbelievable (think of their owned properties, art, gold\naccumulated since 300 AD).\n\nThe stream of revenue from donations, all tax-free, is not stopping anytime\nsoon.\n\nTheir portfolio is super diversified (not only the aforementioned property\nbefore, but also holdings in such…",
  "data/reddit-stocks/r/stocks/comments/s6ffy6/docu_ceo_daniel_springer_buys_more_docusign.json": "Daniel Springer Buys More DocuSign. It's the 2nd time he's buying shares after\nthe first purchase about a month ago.\n\nBoth times there was a stock surge on the news. ~4% higher on the latest\noccasion.\n\nDOCU is down like 60% since the ATH\n\nDo you think Daniel knows something that market is missing?…",
  "data/reddit-stocks/r/stocks/comments/s62be7/amazon_and_visa_end_game_of_corporate_chicken.json": "Amazon and Visa appear to have agreed an 11th-hour resolution to their bitter\ndispute after the online retailer told customers they can continue using Visa\ncredit cards on the site.\n\nOn Monday morning, Amazon started sending affected customers emails telling them\nthey would be able to continue to…",
  "data/reddit-stocks/r/stocks/comments/s66glv/are_there_any_companies_whose_fundamentals_have.json": "It seems the market has moved past looking at how companies are doing to\nworrying about interest rate hikes. Are there any companies that are now doing\nbetter now than they were when the growth stocks started tanking in mid\nNovember. Either through a major partnership, a new business segment…",
  "data/reddit-stocks/r/stocks/comments/s5zxm4/unilever_shares_fall_6_as_it_defends_50bn.json": "Shares in consumer goods giant Unilever have fallen after it defended its £50bn\ntakeover approach for the consumer healthcare arm of GlaxoSmithKline (GSK),\ndescribing the business as a \"strong strategic fit\".\n\nThe group, whose products range from Domestos bleach and Dove soap to Marmite\nand…",
  "data/reddit-stocks/r/wallstreetbets/comments/s6nx5b/wifes_boyfriend.json": "I thought yall were just fucking around when you talked about your wives\nboyfriends. Turns out, mine actually had one! What the fuck! If I didn't belong\nhere before I certainly do now",
  "data/reddit-stocks/r/stocks/comments/s6nw9o/are_we_suspicious_of_chinas_xi_about_the_warning.json": "'China has warned the US and Europe against a rapid rise in interest rates that\nwould “slam on the brakes” of the global recovery from the pandemic. Central\nbanks should maintain the monetary stimulus or risk “serious economic\nconsequences” from the spillover effects with developing markets bearing…",
  "data/reddit-stocks/r/stocks/comments/s6rv5y/keep_updating_what_happened_last_night_and_this.json": "Abstract:\n\n * Due to the impact of Martin Luther King Day holiday, US stocks are closed for\n   one day on Monday;\n * Brent crude oil hit a new high in more than three years, and US oil rose\n   above US $84 to a two-month high;\n * Gold tried to break $1820;\n * Apple was forced to relax payment…",
  "data/reddit-stocks/r/stocks/comments/s6t8nq/10year_treasury_yield_jumps_to_2year_high_topping.json": "The 10-year U.S. Treasury yield jumped to its highest point in two years on\nTuesday morning, topping 1.83%!\n\nThe yield on the benchmark 10-year Treasury note soared 5 basis points to\n1.8305% at 3:40 a.m. ET. The yield on the 30-year Treasury bond climbed 3 basis\npoints to 2.1492%. Meanwhile, the 2…",
  "data/reddit-stocks/r/stocks/comments/s6ximx/activision_shares_soar_37_on_report_microsoft.json": "Shares of Activision soared about 37% in pre-market trading Tuesday following a\nWall Street Journal report that Microsoft would buy the video game giant.\n\nMore to come here:\n\nhttps://www.cnbc.com/2022/01/18/microsoft-to-buy-activision.html\n\nApparently Bobby K to stay on board. Overall $68.7B…",
  "data/reddit-stocks/r/investing/comments/s6xjr1/microsoft_to_acquire_activision_blizzard.json": "https://news.microsoft.com/2022/01/14/microsoft-to-acquire-activision-blizzard-to-bring-the-joy-and-community-of-gaming-to-everyone-across-every-device/\n\nWith three billion people actively playing games today, and fueled by a new\ngeneration steeped in the joys of interactive entertainment, gaming…",
  "data/reddit-stocks/r/Bogleheads/comments/s6wr6g/dollar_cost_average_frequency.json": "As the title says, what frequency should you DCA? Right now I have my\ninvestments set to DCA weekly. Is there an advantage/disadvantage to DCA daily,\nweekly, or monthly?\n\nThanks!\n\nEdit: the different frequencies assumes the same total monthly contribution\nregardless of frequency",
  "data/reddit-stocks/r/Bogleheads/comments/s702xr/bogleheads_investments_chartinfo_for_vanguard.json": "I created this flowchart/list of common Boglehead approach investments for\nVanguard, Fidelity, and Schwab ETFs and Mutual Funds\n[https://smithplanet.com/stuff/BogleheadFunds.svg]\n\nFeedback and corrections are very welcome. I'm frequently finding myself looking\nthese up, so thought this might be…",
  "data/reddit-stocks/r/stocks/comments/s6ui4w/rstocks_daily_discussion_technicals_tuesday_jan.json": "This is the daily discussion, so anything stocks related is fine, but the theme\nfor today is on technical analysis (TA), but if TA is not your thing then just\nignore the theme and/or post your arguments against TA…",
  "data/reddit-stocks/r/stocks/comments/s6zia8/keep_or_sell_activision.json": "What happens to my stock in Activision with the Microsoft acquisition? I'm up 30\npercent at the moment , do I take the cash and walk ? It's tempting but I also\ndon't know what is going to happen and was looking for some better info",
  "data/reddit-stocks/r/stocks/comments/s6wsa3/samsung_partners_with_amd_to_power_up_mobile_chips.json": "Samsung Electronics Co. introduced its first mobile processor powered by\nAdvanced Micro Devices Inc. graphics as the company tries to better compete with\nthe gaming prowess of archrival Apple Inc.’s iPhones.\n\nThe new Exynos 2200 processor is built using Samsung’s most advanced 4nm\nfabrication…",
  "data/reddit-stocks/r/investing/comments/s72csm/microsoft_to_buy_activision_blizzard.json": "Microsoft will buy troubled games company Activision Blizzard, maker of Call of\nDuty, World of Warcraft and a bunch of other popular games. Should provide some\ninteresting synergy with Microsoft owning Xbox. But as Activision Blizzard has\nsuffered serious controversy lately with allegations of…",
  "data/reddit-stocks/r/Bogleheads/comments/s70nqw/do_you_really_need_emergency_fund_if_youre_well.json": "I'm trying to wrap my head around a need of having an emergency fund in any\nsignificant amount \"just in case\" - do I really need this when I live in Europe?\n\n- I have healthy income from a job in a jurisdiction where I can't be fired at\nwill and even if I am fired due to restructuring or something…",
  "data/reddit-stocks/r/stocks/comments/s74m4b/if_microsoft_is_buying_activision_at_95_dollars_a.json": "Big news today as microsoft is set to aquire another video game giant in\nActivision at 95 dollars a share. Activision share price has soared from the\nnews but as I am writing it, \"only\" about 25% to 80 dollars. Why not closer to\n95 dollars? What would prevent this deal from going through?",
  "data/reddit-stocks/r/stocks/comments/s6zlfi/which_stocks_are_you_buying_right_now.json": "As we all have seen it has been a rough start of the year for most growth/tech\n(and just the market in general). Now I've held off for a little bit but I am on\nthe verge of buying the dip with the nasdaq about to hit a 6 month low.\n\nStocks I am currently looking at are:\n\nPYPL V MA MSFT ATVI (guess…",
  "data/reddit-stocks/r/stocks/comments/s714eo/us_home_builders_less_optimistic_due_to_high.json": "High inflation and persistent shortages of key supplies dimmed the optimism of\nU.S. home builders early in the new year. The National Association of Home\nBuilders’ confidence index slipped 1 point to 83.\n\nKey details: A measure of customer traffic at homes for sale fell a few points\nin January, as…",
  "data/reddit-stocks/r/stocks/comments/s77124/intc_is_entering_the_computer_mining_space_they.json": "The move would bring the chip maker into the same market with such companies at\nBitmain and MicroBT.\n\nIntel, one of the world's largest chip makers, is likely to unveil a specialized\nmining chip at the International Solid-State Circuits Conference (ISSCC) in\nFebruary, according to the conference's…",
  "data/reddit-stocks/r/stocks/comments/s7ayok/sofi_receives_regulatory_approval_to_become_a.json": "Release\n[https://www.sofi.com/press/sofi-receives-regulatory-approval-become-national-bank/]\n\nSAN FRANCISCO, CALIF. – January 18, 2022 – SoFi Technologies, Inc. (“SoFi”), the\ndigital personal finance company, today announced that the Office of the\nComptroller of the Currency (OCC) and the Federal…",
  "data/reddit-stocks/r/investing/comments/s77u52/when_did_you_start_feeling_your_retirement.json": "I’m 23 just put more money in my Roth for the first time in 2022. I did the math\nif immediately maxed out it and if it grew 8% I would net an 1500 dollars this\nyear.\n\nLike that’s cool and all but somehow that feels disappointing. Like I’ve been\ndoing this for 3 years now and I can only guess I’ll…",
  "data/reddit-stocks/r/stocks/comments/s7atxr/occ_conditionally_approves_sofi_bank_national.json": "OCC Conditionally Approves SoFi Bank, National Association\n\nRelease\n[https://www.occ.gov/news-issuances/news-releases/2022/nr-occ-2022-4.html]\n\nWASHINGTON—The Office of the Comptroller of the Currency (OCC) today\nconditionally approved applications from Social Finance Inc. (SoFi) to create\nSoFi…",
  "data/reddit-stocks/r/stocks/comments/s6vutb/its_normal_to_panic_we_are_humans_not_machines.json": "History has shown us that humans repeat themselves. We always will. There is\nnothing wrong if you want to sell and make a profit. Nothing wrong if you take a\nloss either. It is better to lose some than to lose all of it.\n\nPeople can easily get rid of stress by not looking at their P&L every…",
  "data/reddit-stocks/r/investing/comments/s74hpe/uk_government_to_strengthen_rules_on_misleading.json": "From the govt website:\n\nThe government plans to legislate to address misleading cryptoasset promotions\n\nAdverts will be brought into line with other financial advertising, ensuring\nthey are fair and clear\n\nNew rules will increase consumer protection while encouraging innovation\n\nAround 2.3 million…",
  "data/reddit-stocks/r/Bogleheads/comments/s7fadb/too_late_to_play.json": "I’m in my mid 40’s. Is it too late to start a ROTH IRA? Have 6K to contribute\ntowards 2021 and can fund another 6K for 2022. Would put in more if possible.",
  "data/reddit-stocks/r/stocks/comments/s71rod/has_the_nasdaq_hit_correction_territory_today.json": "Stock market correction is defined as a drop of between the time when the market\nenters the \"correction territory\" of a more than 10% decline and less than 20%\nwhich then becomes a crash. Since its high in November of 16,212 and today a low\nof 14,565 we surely have met the greater than 10% decline.…",
  "data/reddit-stocks/r/Bogleheads/comments/s7e78m/saving_for_the_short_term.json": "I'll be heading to graduate school in 3-4 years. Is VTI & chill (in a 529\naccount) still the best approach for such a short period?",
  "data/reddit-stocks/r/investing/comments/s7gxlw/xi_jinping_warns_fed_against_hiking_interest_rates.json": "> Chinese President Xi Jinping took to the virtual Davos stage to address Fed\n> Chairman Jerome Powell with this message: Please don’t lift interest rates.\n> \n> “If major economies slam on the brakes or take a U-turn in their monetary\n> policies, there would be serious negative spillovers. They…",
  "data/reddit-stocks/r/wallstreetbets/comments/s7e3nc/the_reality_of_the_gme_saga_demipopular_opinion.json": "Sup autists. There’s a lot of debate around these parts about whether or not the\nGME primates are into something or complete Neanderthals. Here’s my two cents:\nGME may or may not still be a short squeeze play. No one knows 100% or else\nthere wouldn’t be any debate. GME’s business fundamentals are…",
  "data/reddit-stocks/r/Bogleheads/comments/s7a1jk/should_the_bond_portion_of_your_asset_allocation.json": "I'm wondering if this is ever talked about with BHs. The bonds act as crash\nprotection, so I am curious if it's common practice to go 100% stocks during a\ncrash when you have a long time horizon, and then add more to your bond position\nlater on to get it back up.",
  "data/reddit-stocks/r/stocks/comments/s78eq4/quantumscape_vs_solid_power_vs_microvast.json": "If you had a chunk of money would you go into one of these battery companies\nspecifically knowing the world is going electric or would you split it across\nthe 3 or not go into any of them (why not?) Your thoughts are appreciated, would\nbe nice to generate a discussion.",
  "data/reddit-stocks/r/stocks/comments/s7ju8e/why_is_microvast_so_cheap.json": "As the title states, I can't quite seem to get my head around why Microvast is\nso cheap. From my understanding, they are a vertically aligned company that\nproduces batteries already and is generating revenue, they have key partnerships\nincluding a big one in the bag with USPS about to start (in…",
  "data/reddit-stocks/r/stocks/comments/s7qni2/my_8_investing_guidelines.json": "I've been investing, trading, gambling for about 5 years now and I've done\npretty much every rookie mistake there is. Sold winners from 2016\n(Shop,Nvidia,AMD,Paypal) Lost fortunes on chasing that pennystock. Played and\nlost with trying to time the market, option trading.\n\nI've been very active…",
  "data/reddit-stocks/r/stocks/comments/s7pxvh/arkk_a_buy_now.json": "I know people been shitting on Cathie for the last year, which is\nunderstandable. I’m looking at the top holdings of the ARKK portfolio and other\nthan Tesla, most of the stocks are pretty solid “growth” companies at 52 week\nlows, with most of them pre-pandemic levels. This is starting to look like…",
  "data/reddit-stocks/r/Bogleheads/comments/s7u3dd/how_do_you_guys_turn_it_off_when_everything_is.json": "Maybe it's because I work in Finance, but all I ever hear about is the markets.\nI stuffed about 60k lump sum in Jan and its down a few thousand now. Trying to\ndrown it out, but its just always on.\n\nIdc about my monthly 401k/HSA money coming in, but now I'm getting nervous for\nthat lump sum.…",
  "data/reddit-stocks/r/Bogleheads/comments/s7ocmj/my_403b_was_scamming_me.json": "Spent 4 years with an employer who gave a full match up to 5% of my salary.\nSweet. Took that deal and had the money in vanguard funds through it.\n\nWith new employer now and took a look at most recent statement. Was being\ncharged 50/month (!) in management fee.\n\nNope! Took that money and did a…",
  "data/reddit-stocks/r/stocks/comments/s7qf9q/mr_market_is_there_to_serve_you_not_to_guide_you.json": "As I watch my growth stocks plummet, while the wider market barely registers a\nblip - I'm reminded of the timeless parable of Mr Market.\n\nFirst described by Benjamin Graham in 1949, then resurrected by Warren Buffett\nin a letter to shareholders\n[https://www.berkshirehathaway.com/letters/1987.html]…",
  "data/reddit-stocks/r/stocks/comments/s7utc9/ford_expects_82_billion_q4_gain_from_rivian.json": "https://www.marketwatch.com/amp/story/ford-books-8-2-billion-fourth-quarter-profit-on-rivian-investment-11642541196\n\nFord Motor Co. on Tuesday said it expects to book an $8.2 billion gain from its\ninvestment in electric vehicle maker Rivian for the fourth quarter of 2021 when\nit reports earnings…",
  "data/reddit-stocks/r/investing/comments/s7y1f9/why_this_is_not_the_tech_bubble_19992000.json": "Due to the recent drawdowns in technology and growth, people have been calling\nparallels to the technology boom and bust of 1999-2000.\n\nFirst and foremost is the obvious argument that the companies today are\nfundamentally different from the companies back then. During the 1999 cycle,\ncompanies with…",
  "data/reddit-stocks/r/wallstreetbets/comments/s7xym6/unpopular_opinion_gme_is_going_to_go_parabolic.json": "I'm retarded and I eat crayons.\n\nThis is the 1 day\n[https://preview.redd.it/pmqvv22m0pc81.png?width=1158&format=png&auto=webp&s=e1413260504259577424d32e614cd9a1d455a177]\n\nMACD, Stochastics are showing oversold and we are nearing the squeezaversary.\nThere is a shit ton a puts that expire worthless…",
  "data/reddit-stocks/r/stocks/comments/s7zowd/peloton_down_80_insiders_sell_500m_man_i_love_a.json": "Still think is a not fad? Gym equipment come and go, as will this company.\nOnward to $5.\n\nPeloton executives and insiders sold nearly $500 million worth of their stock\nbefore its big decline, according to filings with the Securities and Exchange\nCommission.\n\nPeloton stock is down more than 80% from…",
  "data/reddit-stocks/r/investing/comments/s7s9zt/im_very_worried_about_investing_at_all_time_highs.json": "I’m a young investor, I have decent capital, but not a lot of buffer.\n\nOf course I have enough to cover 6 months expenses and now I have a few thousand\nsurplus.\n\nBut I’m very skeptical of the market right now, inflation, rising interest\nrates, overvalued tech. Rising China, and more serious threats…",
  "data/reddit-stocks/r/stocks/comments/s7n7eg/rstocks_daily_discussion_wednesday_jan_19_2022.json": "These daily discussions run from Monday to Friday including during our themed\nposts.\n\nSome helpful links:\n\n * Finviz [https://finviz.com/quote.ashx?t=spy] for charts, fundamentals, and\n   aggregated news on individual stocks\n * Bloomberg market news [https://www.bloomberg.com/markets]\n *…",
  "data/reddit-stocks/r/stocks/comments/s810ba/nasdaq_falls_1_wednesday_to_close_in_correction.json": "https://www.cnbc.com/2022/01/18/stock-market-futures-open-to-close-news.html\n\nThe Nasdaq Composite fell again on Wednesday, bringing its decline from its\nNovember high to more than 10% as investors continue to dump tech shares as\ninterest rates spike to start the new year.\n\nThe technology-focused…",
  "data/reddit-stocks/r/stocks/comments/s84drs/cathie_woods_ark_invest_now_publishes_the_5_year.json": "Website on Jan 4, showing YTD as of Nov 2021:\n\nhttps://web.archive.org/web/20220104175626/https://ark-funds.com/funds/arkk/\n\nWebsite today: https://ark-funds.com/funds/arkk/\n\nScreenshot of the change: https://imgur.com/a/lAEicvP\n\nIs it normal for fund managers to change the metric shown…",
  "data/reddit-stocks/r/investing/comments/s7ydkg/luckin_coffee_plots_relisting_in_us_two_years.json": "Luckin Coffee is exploring plans to relist its shares in the US, nearly two\nyears after an accounting scandal in which the Chinese coffee chain fabricated\nmore than $300m of sales, according to two people familiar with the matter.\n\nOnce touted as the biggest challenger to Starbucks’ dominance in…",
  "data/reddit-stocks/r/Bogleheads/comments/s835qj/does_anyone_put_money_aside_to_buy_more_during.json": "I'm newish to investing and just buy a set amount when I'm paid. But I'm\nwondering if it makes sense to spread out my buys over the month in case the\nmarket drops. And if it doesn't, I'd still buy that month anyway.\n\nPut differently, do you buy once a month? Or do you spread it out throughout…",
  "data/reddit-stocks/r/stocks/comments/s7v7cx/luckin_coffee_plots_relisting_in_us_two_years.json": "> Luckin Coffee is exploring plans to relist its shares in the US, nearly two\n> years after an accounting scandal in which the Chinese coffee chain fabricated\n> more than $300m of sales, according to two people familiar with the matter.\n> \n> Once touted as the biggest challenger to Starbucks’…",
  "data/reddit-stocks/r/investing/comments/s85l64/the_nasdaq_is_in_a_10_correction_what_have_you.json": "As a young investor not needing any of this retirement money, I secretly love\nthe down days. I have been nibbling at some companies like TGT, SBUX, COIN, and\nNVDA.\n\nI think there will be a lot of rotation into banks and more value stocks so\nthose are definitely areas to look into. Tech Stocks will…",
  "data/reddit-stocks/r/stocks/comments/s84bw1/microsoft_is_bigger_than_google_amazon_and.json": "More than 24 hours after Microsoft announced its plans to purchase Activision\nfor nearly $70 billion, aggressive trustbusters in Congress were\nuncharacteristically quiet.\n\nThe silence underscores how Microsoft has carved out a distinct reputation among\npolicymakers, distancing itself from the…",
  "data/reddit-stocks/r/Bogleheads/comments/s7xt9t/vanguard_vs_other_investment_firms_the_simple.json": "I just read J. L. Collins book and he goes as far as saying Vanguard's company\nand investment funds are the only ones you should use because they're owned by\nthe shareholders.\n\nVTSAX and FSKAX seem to be almost identical on the surface, but is there\nsomething I'm missing as far as hidden fees goes?…",
  "data/reddit-stocks/r/stocks/comments/s7ny7i/greatest_investors_in_history_and_their_strategies.json": "Name Returns Time Horizon Most Famous For Jim Simons (Co-Founder Renaissance\nTechnologies) 71.8% CAGR 1994 to 2014 (best investing record ever recorded) Pure\nQuant Based Investing Joel Greenblatt 40% CAGR 21 years at Gotham Capital\n\"Above-Average Quality Companies At Below-Average Prices\" George…",
  "data/reddit-stocks/r/Bogleheads/comments/s8dk6j/ben_felix_videos.json": "There's not many YouTubers I would recommend.\n\nBut this guy is excellent. He only ever recommends index funds and his level of\nresearch is excellent.\n\nHere he details why timing the market doesn't work:\n\nhttps://youtu.be/w_aOERmUWdA",
  "data/reddit-stocks/r/Bogleheads/comments/s7v4wf/i_sometimes_think_that_no_price_is_too_high_for_a.json": "Ok guys, please explain to no native speaker what does the quote below actually\nmeans. The quote is from \"The Psychology of Money\" Книга от Морган Хусел\n\nA mindset that can be paranoid and optimistic at the same time is hard to\nmaintain, because seeing things as black or white takes less effort…",
  "data/reddit-stocks/r/Bogleheads/comments/s87v4z/what_is_your_retirement_portfolio_during_your.json": "So is everyone like 60% bonds 40% stocks (SP500 and international) during their\nterminal distribution phase? Curious how the end game portfolio looks like, its\nholdings and strategy for everyone when it comes time to distribute and live off\nit for next 30 yrs or even 50 if early retiree.",
  "data/reddit-stocks/r/investing/comments/s8hhik/should_you_listen_to_jim_cramer_i_analyzed_20000.json": "Jim Cramer has made 21,609 stock picks in the past 5 years! Let that sink in for\na moment. Here is one person, making buy/sell/hold recommendations on more than\n2,200+ different stocks across all types of industries. On average, he was\nmaking more than 20 picks per episode of his show [1]. This is…",
  "data/reddit-stocks/r/stocks/comments/s825d2/here_is_a_market_recap_for_today_wednesday.json": "PsychoMarket Recap - Wednesday, January 19, 2022\n\nStocks ended a volatile session sharply lower, with soaring treasury yields\npressuring technology and growth stocks. The Nasdaq (QQQ) closed -1.10% lower to\nofficially enter into correction territory, with the technology-led index\nfalling more than…",
  "data/reddit-stocks/r/stocks/comments/s8khuh/the_standard_explanation_is_that_when_interest.json": "Theoretically this makes them less attractive. But if you look at the balance\nsheets of the tech giants they have hundreds of billions in cash on hand to\nspend on anything they want. Borrowing is not necessary. Why the shifting\nsentiment about their attractiveness? Earnings growth, cash flow,…",
  "data/reddit-stocks/r/investing/comments/s8i84z/real_estate_is_the_most_zombified_sector_and_rate.json": "https://www.cnbc.com/2022/01/20/property-sector-is-most-zombified-rate-hikes-will-be-risky-kearney.html\n\nThere’s a “big risk” of real estate companies filing for insolvency when\ninterest rates rise, said Nils Kuhlwein of consulting firm Kearney.\n\nThe real estate sector had the highest absolute…",
  "data/reddit-stocks/r/stocks/comments/s8pcjg/pelotons_stock_plunges_20_following_report_it.json": "Shares of Peloton Interactive PTON were halted midday Thursday after a report\nsaid the exercise-equipment maker was temporarily pausing production of its\nfitness products, including its popular bike and treadmill because of slumping\ndemand.\n\nCiting confidential internal documents, CNBC reports that…",
  "data/reddit-stocks/r/stocks/comments/s8ka51/what_did_i_miss_with_amd.json": "For the first time in quite a long time AMD is not moving together with other\nsame-sector stocks, sitting at like -2% premarket compared to the rest which is\nmostly green.\n\nWondering if I missed some kind of exclusive AMD news, earnings haven't hit yet\nor anything, anyone know what's going on?\n\nI'd…",
  "data/reddit-stocks/r/investing/comments/s8qwg4/peloton_halts_production_of_bikes.json": "After the news from yesterday of insiders selling nearly $500M of their stock,\nPeloton has announced today that it will be halting bike production for the near\nfuture.\n\nPeloton is down nearly 20% intra-day due to this news. The stock is down 80% in\nthe last 6 months.\n\nIronically, it was the Peloton…",
  "data/reddit-stocks/r/Bogleheads/comments/s8jlna/i_kind_of_dont_like_the_title_of_this_group.json": "“ Passive Indexing Community for Lazy Long-Term Investors”\n\nNot everyone who invests in index funds for long term low risk growth choose it\nbecause they’re lazy.\n\nEven if it’s tongue-in-cheek I feel it sends the wrong message to people\nespecially rookies who come here to learn about the Bogleheads…",
  "data/reddit-stocks/r/stocks/comments/s8t6eo/i_was_up_500_for_the_day_in_the_morning_ended_up.json": "I’ve never seen this kind of volatility before, the last couple of weeks have\nbeen absolutely crazy. Granted, I’ve only been investing for the past couple\nyears.\n\nI ain’t touching my money until I’m 65. Here’s to the rest of 2022, AND my next\n40 years!\n\nEdit: apologies if my title sounded…",
  "data/reddit-stocks/r/stocks/comments/s8t1or/netflix_shares_fall_11_on_slowing_subscriber.json": "Netflix reported fourth-quarter earnings after the bell on Thursday. The\nstreamer beat on both the top and bottom lines, but shares plunged 10% in\nafter-hours trading.\n\nHere are the key numbers:\n\nEarnings per share (EPS): $1.33 vs 82 cents expected in a Refinitiv survey of\nanalysts.\n\nRevenue: $7.71…",
  "data/reddit-stocks/r/stocks/comments/s8oa1m/dkng_nears_another_52_week_low_highlighting_some.json": " 1. DraftKings Bets on Scale, M&A, Cross Marketing: Company Outlook\n\nDraftKings appears poised to maintain a leading share of the $5 billion North\nAmerica online sports-betting (OSB) and icasino trade, which it projects will\nreach $30 billion, though new-market promotions could moderately dampen…",
  "data/reddit-stocks/r/investing/comments/s8tako/netflix_shares_fall_11_on_slowing_subscriber.json": "Netflix [https://www.cnbc.com/quotes/NFLX] reported fourth-quarter earnings\n[https://s22.q4cdn.com/959853165/files/doc_financials/2021/q4/FINAL-Q4-21-Shareholder-Letter.pdf]\nafter the bell on Thursday. The streamer beat on both the top and bottom lines,\nbut shares plunged 11% in after-hours…",
  "data/reddit-stocks/r/Bogleheads/comments/s8u8rc/friendly_reminder_to_stay_the_course_bogleheads.json": "Headlines blaring about tech stocks getting pummeled, indexes going down across\nthe board. Stay the course. Keep to your scheduled investment plans (in my case,\nVTI and VXUS). 10, 15, 20 years from now this won't even be a thought.",
  "data/reddit-stocks/r/stocks/comments/s8tuoh/a_rush_for_the_exits.json": "It has been said before, but I'm going to say it again.\n\nIf you have all of your savings in the market, are highly leveraged, or are\nusing money you cannot lose, you need to really think hard about what you are\ndoing.\n\nThe Fed said that they are going to taper and rates will rise.\n\nThe government…",
  "data/reddit-stocks/r/stocks/comments/s8tmo8/dont_regret_selling_your_stocks_early_inflation.json": "I want to remind everyone to stay calm before all the doom and gloom posts take\nover. Stocks are very oversold currently which can be a good time to take\nadvantage of opportunities. Think about where you would put your money if you\nsell. People who sit on cash will lose to inflation either way.…",
  "data/reddit-stocks/r/investing/comments/s8ubbu/peloton_stock_plunges_below_ipo_price_for_first.json": "https://www.marketwatch.com/story/pelotons-stock-plunges-20-following-report-it-will-pause-production-of-bikes-treadmills-11642702222?mod=mw_quote_news\n\n> Shares of Peloton Interactive Inc. were cratering Thursday after a report\n> indicated that the company temporarily planned to halt production of…",
  "data/reddit-stocks/r/stocks/comments/s8uh6w/random_facts_about_the_nasdaq_correction.json": "On January 19, 2022, the NASDAQ finally hit correction territory exactly three\nmonths after hitting an all-time high. I just ran some data, and this is what I\nfound.\n\nWeight-adjusted, half of the index's losses were accounted for by four\ncomponents:\n\n * Microsoft ($MSFT) -10.74%\n * Amazon ($AMZN) …",
  "data/reddit-stocks/r/Bogleheads/comments/s8xyo5/to_whoever_convinced_me_to_keep_some_bonds_in_my.json": "I want to thank you and this subreddit. Those bonds that everyone else has been\nshitting on are giving me a lot of comfort on days like this!",
  "data/reddit-stocks/r/stocks/comments/s8snv5/what_is_going_on_with_the_stock_market.json": "hello all, apologies if this is a stupid question, i’m a new investor, only\ndoing it for 1 year. so far for most of the year i was doing pretty good, saw\nsome nice green numbers but since October all i see is red over red.\n\nmoat of the stocks i own fell 20%, 30% in a matter of 1-2 months and i…",
  "data/reddit-stocks/r/investing/comments/s8y36c/nflx_is_an_excellent_illustration_of_why_fair.json": "As I'm sure you've seen, Netflix is down 18% in after hours trading. The degree\nto which the stock declined is not, however, unforeseeable. For one, Netflix was\nalready in decline since November from a high of $700 per share.\n\nJust days ago, Netflix also interestingly hiked their subscription fees,…",
  "data/reddit-stocks/r/stocks/comments/s8g0if/rstocks_daily_discussion_options_trading_thursday.json": "This is the daily discussion, so anything stocks related is fine, but the theme\nfor today is on stock options, but if options aren't your thing then just ignore\nthe theme and/or post your arguments against options…",
  "data/reddit-stocks/r/Bogleheads/comments/s8yjc4/some_entertaining_the_sky_is_falling_threads_to.json": "US stocks are in free fall\n[https://www.bogleheads.org/forum/viewtopic.php?f=10&t=80065] -- the original\nongoing panic thread started way back in 2011 (26,567 posts to date!)\n\nInternational stocks are in free fall\n[https://www.bogleheads.org/forum/viewtopic.php?f=10&t=193902] -- inspired by\nthe US…",
  "data/reddit-stocks/r/Bogleheads/comments/s8xaqw/thoughts_on_this_five_fund_portfolio.json": "40% VTI 20% VXUS 20% AVUV 10% AVDV 10% AVES\n\nI find the Avantis funds very interesting and enjoy the small cap value tilt -\nanyone else do something similar?",
  "data/reddit-stocks/r/stocks/comments/s93h9k/i_threw_my_life_savings_into_the_market_and.json": "I know obviously what I did was extremely stupid but at this point I don’t know\nwhat to do. I thought I could buy the dip on the growth stocks that have been\ngetting hammered and it blew up in my face. At this point I can’t do anything\nrisky and just want make long term buys to slowly start earning…",
  "data/reddit-stocks/r/wallstreetbets/comments/s903yw/a_stock_market_crash_is_exactly_what_need_to.json": "This is how brilliant the system works. Please welcome the limit down.",
  "data/reddit-stocks/r/stocks/comments/s8t99f/here_is_a_market_recap_for_today_thursday_january.json": "PsychoMarket Recap - Thursday, January 20, 2022\n\nThe stock market struggled for direction, with the Nasdaq (QQQ) eventually\nclosing red after jumping roughly 2% early on in the session. Market\nparticipants continue to digest the Federal Reserve’s hawkish pivot, a fresh\nweekly unemployment report,…",
  "data/reddit-stocks/r/stocks/comments/s8zlt8/with_all_the_selling_going_on_have_you_panic_sold.json": "I don't hear much about people panic selling on here, more so people confused or\nworried about the selling? Since there are a lot of retail investors nowadays,\nfor those of you who have panic sold these past couple weeks, I want to ask,\nwhy?",
  "data/reddit-stocks/r/stocks/comments/s95dcl/pelosi_says_shes_open_to_stock_trading_ban_for.json": "Speaker Nancy Pelosi (D-Calif.) on Thursday appeared to suggest she is open to a\nban on stock trading by members of Congress.\n\nAsked about the issue during her weekly press conference, Pelosi said she trusts\nlawmakers but would be willing to back a ban if it had the support of her\ncaucus.\n\nLater in…",
  "data/reddit-stocks/r/investing/comments/s8osw3/jeremy_grantham_let_the_wild_rumpus_begin.json": "https://www.gmo.com/americas/research-library/let-the-wild-rumpus-begin/\n\nSome highlights, with my added emphasis:\n\n\"In a bubble, no one wants to hear the bear case. It is the worst kind of\nparty-pooping. For bubbles, especially superbubbles where we are now, are often\nthe most exhilarating…",
  "data/reddit-stocks/r/stocks/comments/s99i92/intel_to_invest_at_least_20_billion_in_new_chip.json": "https://www.nytimes.com/2022/01/21/technology/intel-chip-factories-ohio.html\n\nIntel has selected Ohio for a new chip manufacturing complex that would cost at\nleast $20 billion, ramping up an effort to increase U.S. production of computer\nchips as users grapple with a lingering shortage of the vital…",
  "data/reddit-stocks/r/stocks/comments/s8whnc/jeremy_grantham_let_the_wild_rumpus_begin.json": "Value investor Jeremy Grantham (83 years old) has written a 4000 word article\nexplaining his opinion that we're in the start of an epic drawdown, the fourth\nmajor bubble of his career.\n\nTL;DR:\n\n * we're seeing the same thing that that happened in the 1929 and 2000 crashes:\n   (1) massive build-up…",
  "data/reddit-stocks/r/Bogleheads/comments/s9cc45/the_elders_were_right.json": "My 30% big tech tilt isn't looking so sweet right now...",
  "data/reddit-stocks/r/Bogleheads/comments/s9elbb/tldr_give_this_a_read_if_this_monthweekday_has.json": "Mini rant incoming because I'm starting to see people freak out about a minor\ncorrection to start 2022 with after enjoying the longest bull market we've seen\nin a decade. Yes, there will be a crash sometime in the future. No, we don't\nknow when it will happen, not even if you are Michael Burry, so…",
  "data/reddit-stocks/r/stocks/comments/s9c12o/pelosi_says_us_house_will_soon_introduce.json": "WASHINGTON, Jan 21 (Reuters) - U.S. House Speaker Nancy Pelosi said on Friday\nthe House of Representatives would soon introduce its bill on competitiveness,\nwhich would help bolster semiconductor investment.\n\n\"The House legislation will supercharge our investment in chips, strengthen our\nsupply…",
  "data/reddit-stocks/r/stocks/comments/s97tg4/rstocks_daily_discussion_fundamentals_friday_jan.json": "This is the daily discussion, so anything stocks related is fine, but the theme\nfor today is on fundamentals, but if fundamentals aren't your thing then just\nignore the theme and/or post your arguments against fundamentals…",
  "data/reddit-stocks/r/stocks/comments/s9hjb5/good_luck_well_all_need_it_us_market_approaches.json": "The U.S. is approaching the end of a “superbubble” spanning across stocks,\nbonds, real estate and commodities following massive stimulus during the COVID\npandemic, potentially leading to the largest markdown of wealth in its history\nonce pessimism returns to rule markets, according to legendary…",
  "data/reddit-stocks/r/stocks/comments/s9devp/which_blue_chipsbest_of_breed_are_looking_most.json": "I just bought a share of TGT and put in a buy order for JPM. Thinking of amazon,\nmsft...costco, sbux....curious what blue chips you guys think look best today\nfor long holds....\n\nplease stick specifically to blue chips or those near blue chip territory\n(understanding definitions may differ for each…",
  "data/reddit-stocks/r/investing/comments/s9j2qn/warren_buffett_and_benjamin_graham_in_the_short.json": "Borrowing this quote from Benjamin Graham, Warren Buffett's mentor, to remind\ninvestors during this turbulent time.\n\nIn the short term, the stock market is simply a voting machine based on how\nother investors are feeling that day. Emotions obviously get in the way and play\na large role in the day…",
  "data/reddit-stocks/r/stocks/comments/s97c6m/looking_forward_to_the_next_bear_market.json": "... as there is no better time to make money. A bear market is defined by a 20%\ndrop of the SP500 from last high. We are now at a 7%, only 1/3 through so far.\nStill a long way to go. And the 20% is just a definition, nobody knows what will\nhappen.\n\nThat said, the losses are hard to swallow. But…",
  "data/reddit-stocks/r/stocks/comments/s9iwqn/disney_is_now_trading_at_same_price_as_before.json": "This really blows my mind. Pros for Disney:\n\n * It is now trading as if none of the growth of Disney+ happened at all.\n * Omicron news is getting better all the time.\n * Given weaker growth for Netflix, it might give Disney more room to catch up\n   in content.\n\nPossible cons:\n\n * Maybe Netflix's…",
  "data/reddit-stocks/r/stocks/comments/s9jm4r/markets_can_correct_through_price_or_through_time.json": "I see a lot of posts about 30% or greater crash ahead but not a lot about a\n“third option” which would be a correction based on time: meaning that we trade\nsideways for weeks-months until we have the longer and stronger support EMA’s or\nMA’s catch up to our current position. Be prepared for…",
  "data/reddit-stocks/r/Bogleheads/comments/s9hxbm/rbogleheads_mentioned_in_wsj_column_on.json": "\"The Huge Tax Bills That Came Out of Nowhere at Vanguard\"\n[https://www.wsj.com/articles/vanguard-target-retirement-tax-bill-surprise-11642781228],\nan article written by Jason Zweig for his Intelligent Investor column in the\nWall Street Journal, contains this excerpt referencing a recent post in…",
  "data/reddit-stocks/r/stocks/comments/s9m4sz/i_need_a_drink.json": "Guys/gals, I think it’s fair to say that we’ll all need some drinks (except the\nguy who turns 36k into 880k buying NFLX puts).\n\nFor the longest time, my position was always “unrealized loss is a real loss”\nand I always chucked a little when someone else said otherwise. After a few\ndrinks, I think I…",
  "data/reddit-stocks/r/investing/comments/s9js1t/what_stocksetfs_are_you_loading_up_on_during_this.json": "For long term holding (about 1-2y hold), this current market dip/downturn looks\nlike a good opportunity to DCA downwards. Which stocks have you been buying\nand/or eyeing to buy in the very near future despite the known upcoming rate\nhikes?\n\nPersonally I’m loading up on as much AMD and NVDA as…",
  "data/reddit-stocks/r/stocks/comments/s9l0eo/here_is_a_market_recap_for_today_friday_january.json": "PsychoMarket Recap - Friday, January 21, 2022\n\nThe stock market sank lower today to close out the worst week in the market\nsince March 2020, as technology and growth stocks continued their sell-off amid\nelevated inflation, a hawkish pivot by the Federal Reserve, and the start of\nearnings…",
  "data/reddit-stocks/r/stocks/comments/s9k2h7/current_dip.json": "For those who are feeling the heat, the current dip (for QQQ) is 50% of what we\nhad during the Covid in 2020. If you think a stock and it's PE ratio, growth are\nreasonable, just buy the dip (50% of your ammo) and keep DCAing for the rest.\n\nEdit: added QQQ",
  "data/reddit-stocks/r/stocks/comments/s9mp82/all_arkk_buyers_since_july_2020_are_under_water.json": "Sven Henrich posted a chart on his Twitter feed showing ARKK has dropped to July\n2020 levels.\n\nMy condolences to any bagholders.\n\nhttps://twitter.com/NorthmanTrader/status/1484536558648762368?cxt=HHwWgIC5pc-IkZopAAAA\n\nread the replies. some funny stuff in…",
  "data/reddit-stocks/r/Bogleheads/comments/s9hhyn/first_time_investor_good_time_to_by_vti.json": "I'm just getting into personal investing after paying off all high interest\ndebt, paying off student loans, purchasing a house, and maxing out roth 401k to\nthe full contribution limit. Aside from my six month emergency fund, I have\nabout 60k in the bank. I'd like to take 20 or so to make an initial…",
  "data/reddit-stocks/r/stocks/comments/s9i93z/stocks_youve_been_waiting_for_to_be_this_low.json": "When the market is low is when you get the opportunity to buy really good\ncompanies for cheap. I'm talking stocks that never dip and go up like almost a 1\nevery week on average lets say. Something like TMO.\n\nVisa is an example- usually hella green but at a 20% discount rn roughly.\n\nMy question is -…",
  "data/reddit-stocks/r/investing/comments/s9h4t4/longterm_investment_allocation.json": "Hey guys,\n\nI would love some input and feedback on my long-term investment strategy. I am\nin my early 20's and unbeknownst to me until recently, a family member wrote\nsome bonds in my name. I just cashed them out and while I do not want to give\nspecifics, I have a sizable amount of $ to invest.\n\nI…",
  "data/reddit-stocks/r/stocks/comments/s9pw9d/next_week_will_be_insane.json": "Next week, some of reddit's most mentioned companies will have earnings. And the\nearnings of Tesla, Microsoft and Apple are really going to determine how things\nwill look for the next few months.\n\nNext week earnings include:\n\n * Tesla\n * Microsoft\n * Apple\n * Visa\n * Mastercard\n * Boeing\n *…",
  "data/reddit-stocks/r/wallstreetbets/comments/s9j4y8/faang_without_netflix_is_faag.json": "That is what you all are.",
  "data/reddit-stocks/r/stocks/comments/s9rcf3/we_are_seeing_the_effects_of_tapering.json": "The market is red, it's down. People are panicking, saying their portfolio is\ndown 50%.\n\nI believe the main reason is tapering. We just had a year of fake gains. A lot\nof fake money was pumped into the system, it pumped up overvalued companies even\nmore. So when someone asks you why the entire…",
  "data/reddit-stocks/r/stocks/comments/s9ntxg/buy_a_house_in_todays_environment_or_invest_and.json": "Let's say you have finally saved a lot of cash and can purchase a house (200k in\ncash with a stable monthly income working in accounting). The setting is\nSouthern California where like the rest of the world, housing prices are insane\nand have gone up 20% in a year. Other factors are no debt,…",
  "data/reddit-stocks/r/stocks/comments/s9tqfc/so_how_much_are_you_down_after_this_week.json": "I thought it might be cathartic for people to share their losses after this\nbrutal week. I’m down about 40k from my ATH. Luckily I’m 40% cash now but it\ndefinitely sucks seeing so many months of unrealized gains disappear in a week.\nSo many stocks I was up 50-100+% that I’m now just about breaking…",
  "data/reddit-stocks/r/investing/comments/s9ees2/how_do_people_borrow_using_a_personal_brokerage.json": "I heard about this the other day and it had never occurred to me, it would have\nto be a low enough interest rate that it would make sense.\n\nI think what I'm trying to figure out is, Is this the same as just applying for\na business or personal loan from a bank but you're just additionally…",
  "data/reddit-stocks/r/stocks/comments/s9ilet/imf_warning_to_fed_on_raising_interest_rates.json": "“…biggest concern is for low income countries with high levels of this debt,\nhighlighting that two-thirds were now either in \"debt distress\" or in danger of\nfalling into it — that's twice as many as in 2015.”\n\nhttps://www.cnbc.com/2022/01/21/imf-chief-fed-rate-hike-could-throw-cold-water-on…",
  "data/reddit-stocks/r/stocks/comments/s9wwzr/devastated_and_depressed_any_advice.json": "So my portfolio is down from 1.2m to 350k this year. I was devastated and have\nbeen depressed for quite some time now. I make a humble income and this\nportfolio is most of my networth, so this has been incredibly difficult for me.\n\nThat being said, I would like some advice from here. Some may think…",
  "data/reddit-stocks/r/investing/comments/s9s7s1/i_bought_an_option_right_before_earnings_to_learn.json": "I'm sure all novice investors have gotten the idea to buy options before\nearnings in hopes of making outrageous money on big moves, only to be brought\nback down to earth by the IV crush concept.\n\nSo yesterday (Jan 20) I bought one NFLX $400 PUT Exp. 1/28 for $56 in hopes of\nlearning about the…",
  "data/reddit-stocks/r/stocks/comments/s9z14w/discussion_the_market_crash_has_already_happendis.json": "All this talk about claiming a stock market crash is bound to happen, I’m here\nto tell you it’s happening while you’re waiting for it.\n\nIn the past all we’ve seen were ‘unexpected sudden’ crashes (for the avg joe\nthat is). So how do market makers crash the market learning from the past and\nmake…",
  "data/reddit-stocks/r/stocks/comments/sa2yb6/know_how_much_ive_lost_this_week_neither_do_i.json": "I'm laughably far from wealthy, but I'm also far from poor. I'm decades from\nretirement, and I've got investments scattered between my employer's 401k, an\nIRA, and a small handful of individual stocks.\n\nI haven't opened a single financial app or website this week, and I don't plan\non doing so at…",
  "data/reddit-stocks/r/stocks/comments/sa436u/some_of_you_are_about_to_get_wrecked.json": "I made a post 3 weeks ago and I’m making another one. More of a PSA,\nspecifically for those investing since 2020. I’m really trying to help you\nnewbies out here.\n\nYou’ve heard long time investors talk about valuations returning to normal and\nthis and that, and I’m here to tell you if you are 100%…",
  "data/reddit-stocks/r/investing/comments/sa6cnd/john_deere_is_antagonizing_its_customers_for.json": "John Deere is facing a farmer revolt\n[https://www.bloomberg.com/news/articles/2022-01-20/john-deere-is-facing-a-farmer-revolt-over-the-right-to-repair]\n\nThis is not a discussion about right to repair!\n\nJohn Deer's business model is based on selling services for their equipment and\nthis is obviously…",
  "data/reddit-stocks/r/stocks/comments/sa17g6/how_does_a_bubble_pop_play_out_when_so_many_are.json": "Before you downvote or upvote, I'm not arguing for or against a pop happening.\nI'm honestly asking how you think the competing dynamics will play out.\n\nThe Fed hasn't even begun quantitative tightening. They're still just easing\nless. They have announced their plans to stop buying bonds by March,…",
  "data/reddit-stocks/r/stocks/comments/sa3cxm/crypto_overnight_crash.json": "Woke up to see a really low Ethereum buy went through early this morning. Your\nthoughts? I see this as further evidence the poop is hitting the fan. Monday is\ngoing to be very interesting! I shorted BITO. I will be watching the foreign\nmarkets closely Sunday.",
  "data/reddit-stocks/r/Bogleheads/comments/s9xdw6/how_to_stay_the_course.json": "Hello, I am young (18 male), I am freelancer, this year I made more money than\nmy family made in last 5 years combined (I am from India, a low income country)\nI have low expenses so I have saved 80% of my post tax income since my income\nisn't guaranteed, I am worried about overspending... I have 1…",
  "data/reddit-stocks/r/stocks/comments/s9syi4/dip_in_amzn_nflx_aapl_efx.json": "AMZN - 12% drop this week\n\nNFLX - 24% drop this week\n\nAAPL - 6% drop this week\n\nEFX - 9% drop this week\n\nMany big names are doing a dip this week to levels most of them haven't seen in\nmany months or even years. AMZN especially just dropped 6% today alone, normally\nI would think buy buy buy. Should…",
  "data/reddit-stocks/r/stocks/comments/sa89c8/if_you_plan_on_buying_and_holding_for_the_next_20.json": "I started investing in November. Should someone holding for 20+ years just\ncontinue to buy like they would regularly each month? I don't plan on taking the\nmoney out unless I absolutely have no choice.",
  "data/reddit-stocks/r/Bogleheads/comments/sa7dgw/fell_into_dumb_luck_with_inadvertent_market_timing.json": "I was switching employers and initiated a 401k rollover. This happened right\nbefore the recent market downward swing. The rollover is sitting in mm in my new\nemployer plan. Right now do I dca in every pay period by moving the money to my\ntarget date fund from mm? Or do I lump sum back into the…",
  "data/reddit-stocks/r/stocks/comments/sa9a02/does_anyone_else_think_the_market_is_overreacting.json": "According to Reuters, most projections have rates going to 0.75-1.00% by the end\nof the year. That’s still an extremely low discount rate. Yields are also rising\nin anticipation of a fed balance sheet unwinding that hasn’t happened yet and\nwill probably be executed extremely slowly. So am I missing…",
  "data/reddit-stocks/r/stocks/comments/sa69pa/its_already_down_70_cant_go_down_more_fallacy.json": "i think it's common for people to think \"wow it's down 70%, no way it can go\ndown more\" I am guilty of this as well so i went back and tried to remember\nwhich stocks i bought with that mentality. the first one that came to mind was\nDM (desktop metals). I bought somewhere close to the peak (high…",
  "data/reddit-stocks/r/stocks/comments/sa55uz/with_everyone_hyping_up_msft_is_it_an_actual_safe.json": "The expected EPS is 2.32 and expected Revenue: 50.78 billion for Q4. This is a\nsharp increase from its previous expected quarters.\n\nWhat is the cause of this increase? It seems like Microsoft has tough\nexpectations to beat.\n\nThinking of buying puts and would like some opinions",
  "data/reddit-stocks/r/stocks/comments/saenm8/i_am_a_permabull_and_you_can_not_stop_me.json": "I am a permanent bull on the United States equity market. I have been purchasing\n$500 of VTI per month for over 17 years. Anyone who is trying to time the market\nand freaking out about this past weeks price movement is doing it wrong. You're\nnot going to make money. You are going to be wrong about…",
  "data/reddit-stocks/r/stocks/comments/sabmwt/tech_stocks_arent_going_anywhere.json": "So I want to keep this short & sweet. I've got an investment horizon of 20 odd\nyears, tech is not going anywhere, regardless as to whether or not current\ncompanies are overvalued in qqq, the big 5 etc, if doesn't matter as it will be\nre-weighted. There is no reason to panic at all, who can…",
  "data/reddit-stocks/r/stocks/comments/sace3y/the_market_isnt_going_to_crash.json": "The market isn’t going to crash. First of all the sell off is just people who\nhave been wanting to take profits because things were getting overheated, but no\none really wanted to be the first one out. That has been resolved now and people\nare grabbing profits and piling up cash.\n\nSo once this…",
  "data/reddit-stocks/r/stocks/comments/sagayv/are_you_more_than_10_years_away_from_retirement.json": "No one knows what's going to happen next week. If the markets do crash you have\n2 options.\n\n 1. Close your tabs and apps and look back in a few weeks / months. Try to find\n    the 2008 recession on a chart of your favorite stock for reference of what I\n    mean.\n\n 2. Stress out and try to sell, and…",
  "data/reddit-stocks/r/investing/comments/sae63a/the_plausible_worst_case_scenario_is_not_that_bad.json": "...as far as broad market indexes are concerned, and the calls for a 50% crash\nare completely absurd.\n\nWorst case scenario, market valuations return back to the high end of \"normal\"\nthis year. Historically, forward P/E peaked around 16x to 17x. Ed…",
  "data/reddit-stocks/r/stocks/comments/sa941h/coinbase_coin_pe_ratio_is_14_while_the_company_is.json": "Coinbase’s P/E is being reported incorrectly on several platforms, even my own\nbroker. This is due to their recent IPO and not having 4 quarters reported as a\npublic company, so Google and others are reporting the P/E over 20.\n\nThe numbers as a public company are\n\n$3.05 Q1 Diluted Earnings per…",
  "data/reddit-stocks/r/stocks/comments/saae9x/trying_to_have_a_level_headed_conversation_about.json": "I would like to have a level headed conversation about having a tech heavy\nportfolio.\n\nIn this post, I try to lay out the risks associated with having a tech heavy\nportfolio, and how one can mentally prepare for the next 6-12 months as we go\nthrough some serious volatility in the market.\n\nI'm only…",
  "data/reddit-stocks/r/stocks/comments/sadwmc/the_tortoise_and_the_hare_berkshire_hathaway.json": "https://media-exp1.licdn.com/dms/image/C4E22AQG7yjmJ13xyQg/feedshare-shrink_1280/0/1642882212674?e=1645660800&v=beta&t=zQk4aE-_l84JfQzVwFXy3svsFPFNXVJ-Et2zqzPvCQc\n\n\"The relative performance of the two fund managers has been particularly stark\nthis month, with Berkshire’s stock climbing around 2 per…",
  "data/reddit-stocks/r/stocks/comments/sadm25/stocks_at_52week_lows_catching_your_attention.json": "Friday saw many stocks across the board hit 52-week lows. If anything, it\ncreates a silver lining that there’s value to be reaped in buying up stocks at\nsaid prices come the start of next week.\n\nWhat, if any, 52-week low stocks have caught your attention in scooping up and\nwhy?",
  "data/reddit-stocks/r/Bogleheads/comments/san3w0/should_you_be_investing_at_all.json": "Sometimes I wonder if I shouldn’t be directing more people to r/personalfinance\n[/r/personalfinance] and the flowchart [https://m.imgur.com/lSoUQr2] rather than\ngiving investing advice about fund selection and how to weather stock market\nturbulence on this sub.\n\nWhen I see people get nervous over…",
  "data/reddit-stocks/r/Bogleheads/comments/sah0st/do_ibonds_count_as_bogleheading.json": "I noticed I-Bonds have a set rate of 7% for this year, which is pretty appealing\ngiven what VTI has been doing lately (shivers lol).\n\nDoes this sort of asset count as the bonds in a Boglehead portfolio? And are\nthere any catches? (Can the rate change to negative?)",
  "data/reddit-stocks/r/stocks/comments/sal66d/tech_is_on_discount_but_if_anything_near_the.json": "There's a bunch of stocks that I've been watching for a half year or more and\nplanning to buy some of them once the price gets low enough. However, now all\nthe prices are down. I have some cash for 1-3 positions, but not for pure\ngambling. So is there anything that's so low that it's safe to buy in…",
  "data/reddit-stocks/r/stocks/comments/saq65i/the_market_isnt_who_buys_your_stocks.json": "This is not investment advice. I am not a financial advisor or a finance\nprofessional. You should always conduct your own due diligence and might not\nwant to make investment decisions based on what strangers say on the internet.\nYou should not invest money you aren't prepared to lose.\n\nSo I saw a…",
  "data/reddit-stocks/r/Bogleheads/comments/sa9a4n/victim_of_circumstance.json": "While timing the market is never the goal....I began a rollover of a substantial\nIRA about a week ago, right before the bottom fell out.\n\nI'm about 14 years from retirement, playing pretty big catch up, and just trying\nto remain zen about a 30k loss on paper 🙄\n\nThanks for coming to my Ted Talk.…",
  "data/reddit-stocks/r/stocks/comments/saujen/stock_youtuber_meet_kevin_sold_out_of_999_of_his.json": "He probably has the most subs among the finance youtube space. For months in\n2021 he had been saying inflation would inflect down in September/October 2021\nand there would be an end of year rally. So he loaded up on call options in\nAugust to prepare for it. Then adjusted his timeline to Jan-Feb…",
  "data/reddit-stocks/r/stocks/comments/sawet6/something_to_consider_before_market_open_tomorrow.json": "Panic selling gives you two things:\n\n 1. A large tax bill (assuming you are in the green after this insane 2 year\n    bull spree)\n 2. Opportunity cost of missed gains when a recovery happens\n\n----\n\nScenarios:\n\n 1. Earnings are reported and they suck. Fear of lower earnings and recession.\n    Stocks…",
  "data/reddit-stocks/r/stocks/comments/sauzt1/so_who_are_you.json": "Happy Weekend! Since we could all use a break from looking at our portfolios,\nhere are the people I see on r/stocks [/r/stocks]. Who are you and who am I\nmissing?\n\nSevere Denial OP: Often found posting manically during any downturn. They want\nreassurance they are making the right moves, but they…",
  "data/reddit-stocks/r/wallstreetbets/comments/samkcl/yolos_arent_about_risking_your_livelihood_how_wsb.json": "Look, I like loss porn as much as the next guy. It's hard not to be be enamored\nby someone that had so much conviction and degeneracy that they gambled away\nyears of earnings just for the chance to make it big and become a WSB legend.\nReddit karma is great too. But WSB has changed over the years.…",
  "data/reddit-stocks/r/Bogleheads/comments/savnly/winning_the_losers_game_by_charles_ellis_book.json": "WINNING THE LOSER'S GAME BY CHARLES ELLIS\n\n * Investment managers are not beating the market, the market is beating them\n   * Over 1 year, 70% of professionals underperform their benchmarks\n   * Over 10 years, 80%\n   * Over 15 years, 90%\n * Yes, some professional money managers will beat the market…",
  "data/reddit-stocks/r/Bogleheads/comments/sax5tz/followed_jl_collins_advice_doubt_setting_in.json": "I absolutely loved The Simple Path to Wealth by JL Collins and amongst all the\nnoise out there, I decided to follow this book almost to a tee.\n\nOne part of that approach was favouring lump sum investing vs. DCA. Collins\nmakes a very sound argument for lump sum investing (based on empirical data)…",
  "data/reddit-stocks/r/investing/comments/sazdgr/some_perspective_on_the_state_of_the_market.json": "I think it’s kind of funny how quickly sentiment changes based on how the market\nperforms in the last couple of weeks\n\nIf SPY had gradually gone up from January 2021 to where we are now, everyone\nwould be super bullish right now.\n\nYet, because the last few weeks have been red, arriving at the same…",
  "data/reddit-stocks/r/stocks/comments/sb2v6x/everybody_in_the_world_is_a_longterm_investor.json": "Ask yourself, what would Peter Lynch say?\n\nA sure cure for taking a stock for granted is a big drop in the price. - Peter\nLynch\n\nEverybody in the world is a long-term investor until the market goes down. -\nPeter Lynch\n\nIf you buy superior companies, time is on your side. - Peter Lynch\n\n\n\nIt's hard…",
  "data/reddit-stocks/r/stocks/comments/saowkg/where_would_they_put_their_money_if_the_stock.json": "One of the common answers, e.g. on WSB, to the question of \"whether this is the\nend of the world\" is \"if the stock market crashes, where else would people put\ntheir money\"?\n\nI must admit the answer makes some sense, as at least I for sure have no idea. I\ndon't believe all the commonly provided…",
  "data/reddit-stocks/r/stocks/comments/sazzon/white_house_releases_a_fact_sheet_regarding.json": "https://www.whitehouse.gov/briefing-room/statements-releases/2022/01/21/fact-sheet-biden-harris-administration-bringing-semiconductor-manufacturing-back-to-america-2/\n\n> FACT SHEET: Biden-⁠Harris Administration Bringing Semiconductor Manufacturing\n> Back to America\n> \n> Intel Announces $20 Billion…",
  "data/reddit-stocks/r/stocks/comments/sb9t9u/stock_futures_rise_following_sp_500s_worst_week.json": "> Stock futures rose slightly in overnight trading Sunday, following the S&P\n> 500′s worst week since March 2020, as investors awaited more corporate\n> earnings results and a key policy decision from the Federal Reserve.\n> \n> Futures on the Dow Jones Industrial Average edged up 120 points. S&P…",
  "data/reddit-stocks/r/stocks/comments/sawwtl/thinking_of_selling_everything_and_full_porting.json": "Is this a stupid move? I’ve got a number of tech stocks that are down\nsignificantly, and feel that they’ll will continue to slide down. If I sold\neverything I’d have around $30k.\n\nAmazon & Shopify seems like a safe bet to park my money with some good upside\npotential in the coming months/years when…",
  "data/reddit-stocks/r/stocks/comments/sax9r9/why_do_you_want_to_sell_lets_try_to_rationalize.json": "All of a sudden everyone wants to sell and have a \"40% cash portfolio\". This\nmeans selling winners and losers alike. This means selling nearly half of your\nportfolio that you put time and research into and creating very reasonable goals\nand strategies around these companies.\n\nWhat was your goal…",
  "data/reddit-stocks/r/stocks/comments/sb9hpi/history_of_stock_market_crashes.json": "With a correction happening at the moment, I thought I would post a history of\nall stock market crashes.\n\n\n\n * Tulip mania - Happened around 1634-1637 in Dutch, which some single tulip\n   bulbs allegedly sold for more than 10 times the annual income of a skilled\n   artisan, is often considered to…",
  "data/reddit-stocks/r/Bogleheads/comments/sb8h9i/why_i_dont_invest_in_frontier_markets_or.json": "Before we get started: I posted something else about crypto recently, and things\ngot heated. In part, I think that was because of the headline of the piece in\nquestion, which was provocative. So this time, I just want to say that I'm just\nspeaking for myself here, offering a point of view as I work…",
  "data/reddit-stocks/r/wallstreetbets/comments/sb2491/money_is_never_earned_it_is_only_traded.json": "You are not paid because of how useful you are. You are not paid according to\nyour contribution to society. You're not even actually 'paid' at all. You're\nsimply on one side of a trade.\n\nIf you work for an hourly wage, you are not 'earning money'. You are making a\ntrade, time for money, and it's a…",
  "data/reddit-stocks/r/stocks/comments/sbemxe/just_a_thought_please_dont_hate.json": "Please don't hate me. Just had a Sunday night thought,...\n\nI joined this subreddit hoping for Market/Stock experts that would give me\ninsights into trading. But after monitoring this subreddit and comparing to the\nmarket performance, I've realized that... most folks on here don't know what\nthey're…",
  "data/reddit-stocks/r/investing/comments/sbc2io/number_of_midlarge_caps_with_ps_over_30.json": "Following up on this\n[https://www.reddit.com/r/investing/comments/rz64yc/ps_over_30_is_still_incredibly_risky/]\npost from 15 days ago....\n\nHere's an updated graph of the number of US traded stocks with a PS over 30 and\nmarket cap of $5 billion (as of 2022-Jan…",
  "data/reddit-stocks/r/Bogleheads/comments/sbfywl/stay_the_course.json": "Just wanted to remind everyone that most of us are long term investors, the\nmarket dropping right now will pass. Do not panic. As Jack Bogle once said “keep\nyour emotions out of it”.\n\nThat is all. Goodnight fellow bogleheads.",
  "data/reddit-stocks/r/stocks/comments/sbbj3x/rates_cannot_go_up_much_and_be_sustained.json": "I feel like everyone just accepts that rates will go up a lot and inflation will\ngo down. But how can the fed pay the enormous debt if they lower inflation and\nraise rates. It seems obvious to me they are stuck and really have no options\nexcept to let inflation run hot.",
  "data/reddit-stocks/r/investing/comments/sbas23/long_term_boring_investor_question_fxaix_vs_vti.json": "I browse occasionally and most people mention VTI or VTISAX for a safer/boring\nlong term growth. Just curious to know if FXAIX would be a smart move as well?\n\nBasically I've been putting money into that before I even knew about these\nsubreddit so wondering if I should hold what I have and begin…",
  "data/reddit-stocks/r/stocks/comments/sbh68l/when_do_i_start_buying_stocks.json": "So I just recently started investing my savings into mutual funds and so far\nthey've dropped. I don't mind honestly cause I'm planning on holding for the\nlong term. I've been looking at stocks for the past couple of months debating\nwhether I should buy into individual companies. With the prices…",
  "data/reddit-stocks/r/stocks/comments/sbj6v8/rstocks_daily_discussion_monday_jan_24_2022.json": "These daily discussions run from Monday to Friday including during our themed\nposts.\n\nSome helpful links:\n\n * Finviz [https://finviz.com/quote.ashx?t=spy] for charts, fundamentals, and\n   aggregated news on individual stocks\n * Bloomberg market news [https://www.bloomberg.com/markets]\n *…",
  "data/reddit-stocks/r/Bogleheads/comments/sb3nrf/timing_of_ibond_purchase.json": "Given the expectation that rates are expected to rise a bit this year, the fact\nthat I-bonds are currently at 0% interest on the fixed component, the fact that\nthe fixed component for I-bonds is permanent at the date of purchase, and the\nfact that you lock in the inflation component for six months,…",
  "data/reddit-stocks/r/stocks/comments/sbku5g/buying_tqqq_at_tech_bottom.json": "The last few months have been quite painful for my portfolio. I have\nconcentrated positions in VTI, DIS, MSFT, GOOGL, and SCHD. Many of the others\nwhich were not big positions I've completely sold out out. I've done some DCA\nover the last few weeks, but now I'm brainstorming the idea of leveraging…",
  "data/reddit-stocks/r/stocks/comments/sbc3lc/number_of_midlarge_caps_with_ps_over_30.json": "Following up on this\n[https://www.reddit.com/r/investing/comments/rz64yc/ps_over_30_is_still_incredibly_risky/]\npost from 15 days ago....\n\nHere's an updated graph of the number of US traded stocks with a PS over 30 and\nmarket cap of $5 billion (as of 2022-Jan…",
  "data/reddit-stocks/r/stocks/comments/sbodqz/what_stocks_are_you_most_excited_to_buy_this_week.json": "As the title implies. I've lost a big bag on some of my growth stocks, but there\nalso seems to be huge potential in some value stocks, and also in some of the\nmarket stalwarts (I know I'll be putting some in Microsoft and Apple).\n\nAre there any stocks you think will have large recovery after this…",
  "data/reddit-stocks/r/stocks/comments/sbprtb/no_amount_of_books_or_lectures_can_help_you.json": "Just a quick example. In February and March 2020 I was selling all my portfolio\nwhen the stock market was going down. I made some money but I didn't rebuy up\nuntil September 2020 missing a lot of gains. I thought that a global pandemic\nwill destroy many businesses, will put a lot of people on…",
  "data/reddit-stocks/r/Bogleheads/comments/sbnern/buying_the_dip.json": "This past week I have seen lots of comments about buying the dip, or that stocks\nare on sale \"now so I can make my investment.\"\n\nPensionCraft put out a great video about this topic over the weekend:\nhttps://www.youtube.com/watch?v=UvkqIDE9itg\n\nLong-story short: Holding cash to buy during a drop…",
  "data/reddit-stocks/r/stocks/comments/sbpi0l/why_do_most_stocks_move_in_tandem_these_days.json": "What the title says - why do most stocks move in tandem - meaning today,\nbasically all of my charts look the same - dump in the beginning of the day,\ntaper off and then begin to rise a bit, then fall again. They basically move in\ntandem. This is not supposed to happen IMO.",
  "data/reddit-stocks/r/investing/comments/sbpcla/washpo_breaks_out_the_c_word.json": "Many of you have read my comments/posts here over the past year and know my\nposition on the current state of markets. I've long been a value investor and\nrepeatedly emphasized that overpriced securities tend to revert to the mean\ngiven some kind of catalyst—e.g. shifts in monetary policy…",
  "data/reddit-stocks/r/stocks/comments/sbqu0e/could_you_panic_people_please_stop_yelling.json": "Yes we have really bad times at the moment but if it’s so hard for you then you\nare not the right person to invest or you have too much money in.\n\nI’m badly down in Januar too but I keep my stocks and wait for recover. It will\ncome once the panic is over. I have patience. I don’t let smart money…",
  "data/reddit-stocks/r/stocks/comments/sb2kw8/is_anyone_not_down_that_much.json": "Does anyone else feel like they're not down as much as the overall market /\nsentiment.\n\nI'm holding only 3 stocks $TSLA which I have been for a long time so $1200-940\ndoesn't feel like that much of a hit.\n\n$ABNB built this out over the past 2 months has held up decently compared to the\noverall…",
  "data/reddit-stocks/r/stocks/comments/sbi7h9/how_will_the_stock_market_react_in_a_possible.json": "I am a bit concerned about the possibility of a Russian invasion to Ukraine. Not\nonly because of the obvious humanitarian reasons, but also on how this may\naffect the stock market.\n\n\n\nHave you seen any analysis discussing this?",
  "data/reddit-stocks/r/Bogleheads/comments/sbqpwr/thank_you_bogleheads.json": "My ETF based highly diversified portfolio is faring pretty well in these\nunstable times. This crash feels more like a rainshower than a tsunami to me.\nThis is because I decided to take this subs advice when I began investing.\nConsequently, i've been spared the worst effects of this crash.",
  "data/reddit-stocks/r/stocks/comments/sbs0w0/dow_falls_more_than_900_points_in_7th_straight.json": "U.S. stocks fell Monday following the S&P 500′s worst week since March 2020, as\ninvestors awaited more corporate earnings results and a key policy decision from\nthe Federal Reserve.\n\nThe Dow Jones Industrial Average lost about 925 points, or 2.7%, falling for a\nseventh straight day. The S&P 500…",
  "data/reddit-stocks/r/stocks/comments/sbs9s0/is_it_just_me_or_does_this_market_pullback_seem.json": "It feel like less of a crash and more a correction from the insanely high levels\nwe were at before. If you look at SPY, it's still up 10% compared to a year ago\nand QQQ is about breakeven. And if you zoom out more, indexes are still up\n30-40% compared to pre-pandemic.\n\nImo there's a lot of good…",
  "data/reddit-stocks/r/Bogleheads/comments/sbrrpt/the_only_reason_i_know_that_the_stock_market_is.json": "Not that mods should ban these types of posts, but one of the tent poles of this\nstrategy is being able to set aside the butthole clenching that happens on a\ndownturn and looking long term. If you can’t stomach the stock market ups and\ndowns, don’t get in.",
  "data/reddit-stocks/r/stocks/comments/sbqo0p/people_are_excited_to_buy.json": "Yes the VIX is heading up, but think about it - a lot of us are sitting on the\nsideline with cash waiting to get good deals on the companies that we are\ninvested in. Actually this could be a good opportunity for most of us to get\nprices for these companies that we wouldn't have been able to,…",
  "data/reddit-stocks/r/wallstreetbets/comments/sboekk/these_are_the_days_where_the_money_is_made.json": "I know most you guys don't want to hear this. But the past weeks and the coming\nweeks are one of those days where looking back you always wished you would have\nbought stocks.\n\nI don't need to tell you this. We have all seen every Buffet video there is on\nyoutube.\n\"Blahblah be greedy when others are…",
  "data/reddit-stocks/r/stocks/comments/sbwnk1/wild_today_market_went_from_down_5_to_up_5_in_3.json": "Just a wild bounce back. And im 90% sure it was because of technicals. The s&p\nbroke below the 200 day EMA for the first time since may 2020 and then within 3\nhours rose 5% to get right back to the 200 day EMA. And if you go weekly\nintervals, the market just barely goes past the 60 week EMA, for…",
  "data/reddit-stocks/r/stocks/comments/sbx99c/did_the_sp_just_close_in_the_green.json": "Six hours ago, I thought we were starting the next Great Recession......now\nwe're in the green?\n\nIf anybody could help me make some sense of what is going on and why we just saw\nsuch volatility today, that'd be great.\n\nIs this a good sign?",
  "data/reddit-stocks/r/stocks/comments/sbw6lg/nasty_selloff_for_those_that_are_heavy_in_tech.json": "But now that many retail investors are throwing in the towel, THIS is the time\nto buy and continue buying throughout March. If you're watching the technicals,\nSPY likely just logged a bottom at 422.\n\nMarket media has become a hive-mind of bearishness with retail - I have not seen\na greater bullish…",
  "data/reddit-stocks/r/investing/comments/sbx6ht/what_happened_today_in_the_us_equities_markets.json": "Futures were lightly positive. Then bloodbath: DOW -1000pts, NASDAQ -4.9%, etc.\nOnly indexes that were positive were China, Taiwan, and Nikkei. The VIX was at\n30%+. Europe’s STOXX 600 saw it finally inheriting the headwinds from US ->\nChina -(to finally)-> Europe.\n\nNow with the mkt closed we see…",
  "data/reddit-stocks/r/wallstreetbets/comments/sbshvd/we_are_in_the_early_stages_of_an_inflation_driven.json": "I keep coming back and commenting this over and over, hoping more people take\nheed. Decided to finally make a post in hopes a few people will read it.\n\nThis dip is NOT about the FOMC meetings or heightening tensions with Russia.\nThose are short term catalysts.\n\nThe real problem is inflation.\n\n\n7%…",
  "data/reddit-stocks/r/stocks/comments/sbtkjx/anyone_else_in_here_learned_their_lesson_and.json": "How many of you are doing this? Until today i was 80% growth in my portfolio….\n\nCashing out is no option for me after losing around 35% of my portfolio... But\nswitching from lets say Unity/Monday/Trade Desk small/mid cap high growth to\nnormal NQ or SPY ETF makes me feel better.\n\nNQ is down 20%.…",
  "data/reddit-stocks/r/stocks/comments/sby4s6/here_is_a_market_recap_for_today_monday_january.json": "PsychoMarket Recap - Monday, January 24, 2022\n\nWhat an action-packed day! After dropping steeply in the morning, stocks\nreversed sharply higher to close the day in the green as market participants\nlook ahead to a busy week of earnings and new commentary by the Federal Reserve.\n\nMarkets Today (low…",
  "data/reddit-stocks/r/stocks/comments/sc0m8f/here_we_go_with_earnings_ibm_reports_best_growth.json": "-Sales rose 6.5% to $16.7 billion in the months ending Dec. 31 (expected 16b)\n\n- IBM’s software unit, the biggest business group, grew 8.2% to $7.3 billion.\n\n- The consulting unit, formerly known as Global Business Services, reported $4.7\nbillion in revenue, a 13% increase compared with the year…",
  "data/reddit-stocks/r/stocks/comments/sbz8du/it_was_me_i_died_so_you_all_could_live.json": "I finally decided to sell lucid after debating for literally two weeks. Went\noffline to come back and see the market somehow go positive. Looked when I sold,\nthe exact bottom and everything moved higher after that.\nTLDR: Your Welcome and yes I did still make money"
}