{
  "data/reddit-ask/r/TooAfraidToAsk/comments/v23vyl/how_do_i_report_a_discord_server_for_child.json": "i do youtube videos, i wanted to join random discord servers and troll for a\nyoutube video, to find servers i went onto twitter and searched \"discord\" and\nwent to newest first, i found a link to a server captioned \"Crazy Leaks\" or\nsomething like that, i didnt think much of it, and entered the…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/v274xn/if_people_cant_use_mental_illness_as_an_excuse.json": "I'm not saying people should use mental health issues as an excuse, but at least\nwith that it isn't their choice to be unwell. Unlike religion, which is a\nchoice.\n\nCan anyone explain this?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/v29we0/is_antiracism_simply_thinly_veiled_racism.json": "I’ve seen “anti racists” talk about how white men shaped this world, but when\nyou tell them that Arab and Chinese empires contributed vastly they act like you\nare lying.\n\nOne woman said Christin Europe established a patriarchy in the Middle Ages, but\nI told her the Abbasid caliphate was the…",
  "data/reddit-ask/r/askscience/comments/v29pew/what_determines_the_ideal_number_length_width_and.json": "I notice that wind turbines have only three very long blades, yet windmills and\nwater pump windmills have many more. Likewise, home fans can have three, five,\nor more blades, and there is a lot of variation in the lengths available. How do\nyou determine what's optimized for a given usage?",
  "data/reddit-ask/r/NoStupidQuestions/comments/v24yuw/do_unattractive_people_find_other_unattractive.json": "Throwaway because I don’t want the people who know my main to know I’m a petty\nbitch, but really…\n\nWe all know that some people are more attractive than others, and some people\nare significantly less attractive. I feel like the less attractive people KNOW\nthey’re less attractive, right? Despite…",
  "data/reddit-ask/r/AskHistorians/comments/v2dv17/to_what_extent_did_normans_identity_as_norse.json": "In the mid-9th Century, the French king decided that the best way to prevent\nvikings raiding up the Seine was to permanently station some vikings of his own\nat the mouth, buying their loyalty with land and titles. Thus, the Normans. The\nNormans would go on to be fairly successful, going on to form…",
  "data/reddit-ask/r/NoStupidQuestions/comments/v2e999/is_it_possible_to_shit_yourself_while_delivering.json": "When you squeeze your hole while delivering a baby, does it also squeeze your\nanus? and has it happened before?",
  "data/reddit-ask/r/AskHistorians/comments/v2ca2i/did_frontier_people_in_ancient_times_speak_hybrid.json": "I watched \"Kingdom of Heaven\" and in this movie you can see Crusader knights\ngreeting by saying \"Salam alaykum\". The first thing I thought was: \"is this\nhistorically accurate, did they talk like that?\" I'm Spanish and in the very\nSouth where Spain and Morocco really intertwine, it's not rare that…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/v29xlb/is_it_homophobic_or_whatever_to_dislike_the_lgbtq.json": "I couldn’t care less about the LGBTQ people themselves, if they’re good people,\nI like them. If they’re bad people, I don’t like them. I just don’t like the\ncommunity as a whole. Kinda toxic and I just don’t like groups in general.\n\n(Groups as in the idea of the group not the people in it)\n\nAnd…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/v2gguh/why_do_so_many_people_believe_that_you_cant_be.json": "I’ve seen this idea of ‘you can’t be racist to white people’ for a while now.\nConfused on why so many people believe in it. When I debate this, they always\ngroup white folks into being American or English? When there’s many many\ncountries other than that. ? They also tend to believe that there’s…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/v2cs44/if_someone_is_homophobic_racist_sexist_etc_and.json": "Like if you go on any social media you will find a lot of people trying to\nprotray each other like that. My question is why should I care that some random\nstranger in their mom's basement is homophobic or racist. If you keep it to\nyourself then my opinion on your thoughts about some community…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/v2npfu/why_are_half_the_questions_on_this_subreddit_just.json": "\"Why are people angry at Chris Rock? Isn't Will Smith just being overly\nsensitive?\" \"I agree\"\n\n\"Does anyone else feel there are too many superhero movies?\" \"Yeah, I do\"\n\n\"Why does Donald Trump do this dumb thing?\" \"Because he's an idiot\"\n\n\"Is it ok if I believe [politically incorrect opinion]?\"…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/v2kgzk/how_can_someone_be_both_nonbinary_and_gay.json": "A person I graduated high school with now identifies as \"gay non-binary.\" If\nnon-binary means you don't identify as either gender and gay means you're\nattracted to the same gender, how can you be both at the same time?",
  "data/reddit-ask/r/askscience/comments/v2glh3/why_arent_the_subspecies_of_brassica_rapa_just.json": "I guess the question is, what's the difference between subspecies and species,\nat least in the plant world? Is there even a clear distinction?",
  "data/reddit-ask/r/AskWomen/comments/v2gpmm/what_is_sex_after_a_hysterectomy_like.json": "Are orgasms still satisfying? Are you able to have rough sex after healing\nfully? If so, how long did it take to get to that point? Are there any positions\nyou find uncomfortable or have to avoid now? Did you ever get over the fear of\nthe cuff tearing? Did you have any complications?",
  "data/reddit-ask/r/AskHistorians/comments/v2ohrp/why_did_someone_put_a_shoe_in_the_wall_of_a_200.json": "During a renovation, we found an old shoe in the wall of a 200 year old house in\nNew England. I'm looking for information on why it was put in the wall in the\nfirst place. Failing that, what other subreddits should I try, because r/shoes\n[https://www.reddit.com/r/shoes/] doesn't seem like the right…",
  "data/reddit-ask/r/NoStupidQuestions/comments/v2s3bm/was_the_80s_really_as_nice_as_stranger_things.json": "I'm only 21, so I wasn't born in the 80's. But I love the general aesthetic of\nthe 80's in general, there's just something oddly nostalgic about it even though\nI'm not from the era? Like the way shows portray that time period, there was a\nmuch bigger sense of community, and people acted like…",
  "data/reddit-ask/r/askscience/comments/v2eaob/askscience_ama_series_im_futurist_amy_webb_and_i.json": "We can now program cells as if they were tiny computers. What happens when\nanyone can manipulate organisms - or even create new ones? My new book, The\nGenesis Machine\n[https://www.amazon.com/Genesis-Machine-Rewrite-Synthetic-Biology/dp/1541797914],\ngives you the background you need to think…",
  "data/reddit-ask/r/askscience/comments/v2waae/dogs_can_smell_covid_infections_in_patients_with.json": "You'd just have to build a detector sensitive to the specific molecule or group\nof molecules that cause the smell, right? And while we are at it, can't we have\na bomb-sniffing and drug-sniffing machine, the same way dogs do? Or is there\nsomething about dog morphology that allows them to detect…"
}