{
  "data/reddit-ask/r/TooAfraidToAsk/comments/t3xyxf/are_kkk_members_pro_or_against_masks.json": "Or do they just not wear masks under their masks in defiance?",
  "data/reddit-ask/r/AskHistorians/comments/t3upes/what_was_the_relationship_between_the_native.json": "After the Trail of Tears, the \"Five Civilized Tribes\" of American South made\nOklahoma their home. But I assume there were natives in Oklahoma before then.\nThis made me think about what was the relationship between the Oklahoma Natives\nand the Newcomers. What did they think of eachother, and were…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/t41ia3/if_i_only_attract_people_that_i_find_unattractive.json": "I (M 29) have dated people that I did in fact find attractive in the past, but a\nhuge majority of the women I attract I do not have reciprocal feelings for. Not\nto diss them or anything. I've met some really great people that were into me,\nbut I was 100% not attracted back romantically or…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/t3x8i5/why_is_there_a_culture_of_asian_immigrants.json": "Obviously, it's due to tradition. But when & how did it originate? I notice that\nmany nails techs are mostly made up of specifically Chinese or Vietnamese\nimmigrants-- they're always polite but very quiet; I would try to make\nconversation with them but everything is usually lost in translation.…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/t44soc/bf_called_me_ugly_am_i_overreacting.json": "I’m pretty hurt. Earlier today I posted a pic of me 21 f and my bf 24m in insta\nand i know it’s not the best pic. I’m not wearing makeup and he is in the middle\nof putting his hat on. But we are both laughing and look so happy I really\nwanted to share the moment. After he woke up and saw it he got…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/t444uf/is_it_okay_to_just_be_a_lameboring_mom_who_doesnt.json": "I read a lot of books and watch a lot of movies. I am blown away to realize the\nimpact one human can have. Favorite authors and actors have created things that\nsave me from dark depression. That I watch/read over and over .\n\nYet, I will never do that. I am not looking for bullshit reassurance that…",
  "data/reddit-ask/r/askscience/comments/t3yp0t/can_you_work_out_your_intraocular_eye_muscles_the.json": "I've found many exercises online related to exercising your intraocular muscles,\nand the wording of most of these exercises seem to imply a \"stiff\" or \"tight\"\nmuscle if you have near/farsightedness. One example being the 20/20/20 rule, of\nlooking at something 20 feet away for 20 seconds every 20…",
  "data/reddit-ask/r/AskHistorians/comments/t469za/how_did_the_russians_not_discover_the_new_world.json": "Russia and Alaska (according to Google earth) are less than 100km apart, I\nunderstand that this part of Russia is extremely remote and the sea pretty rough\nbut on a clear day you see at the very least the islands between the two.\n\nHow did nobody at any point in history prior to columbus think to…",
  "data/reddit-ask/r/AskWomen/comments/t3yhgh/what_is_it_like_to_have_a_family_that_actually.json": "Most of my family outings end in someone crying, or horrible overall tension. So\ngive me a peak please! Lol",
  "data/reddit-ask/r/TooAfraidToAsk/comments/t46l03/why_do_people_just_strengthen_gender_stereotypes.json": "So people say they don't believe in gender stereotypes and then they are gender\nfluid. They say on certain days they feel like a different gender but how do you\nknow what it's like to be that gender? Also my friend says they're agender\nbecause they do stuff that makes them not a male like painting…",
  "data/reddit-ask/r/AskHistorians/comments/t480uw/why_did_the_uk_and_irelands_cuisine_not_lean.json": "I've been reading a lot of UK and Irish history lately and this question always\nsticks in my head. Considering how close the ocean is at any moment for someone\nliving in the UK and Ireland, why does the modern cuisine of the British Isles\nnot heavily leaning towards seafood like that of Japan?\n\nIs…",
  "data/reddit-ask/r/askscience/comments/t48nda/is_it_possible_to_construct_a_biconvex_lens_with.json": "Hi there,\n\nLike the title says, I was wondering if this is possible. If so, how would such\na lens look?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/t49akl/why_do_so_many_people_incorrectly_refer_to.json": "Why do so many people incorrectly refer to taxpayer paid healthcare and college\nas \"free\" healthcare and college?",
  "data/reddit-ask/r/NoStupidQuestions/comments/t4ckv1/does_anyone_else_get_frustrated_about_having_to.json": "I get frustrated about being hungry and having to eat when I am about to start a\ntask or in the middle of one because it takes time to get up and find food, and\nusually by the time I'm done eating, the motivation for doing said task is gone.\nBeing hungry is so disruptive but we literally can't…",
  "data/reddit-ask/r/NoStupidQuestions/comments/t4ddow/what_happened_to_my_sexuality_did_i_turn_gay_not.json": "m21 I used to enjoy normal porn but in the last 3 years i started to watch trans\nporn than gay porn now i feel like i wanna get fucked in the ass or give some\nguy or ts BJ and that's the only way that makes me cum\n\nwhat should i do ?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/t4hrvo/how_have_we_allowed_for_13000_nuclear_bombs_to_be.json": "I've been reading up on Mutually Assured Destruction, Dead Hand and Nuclear\nWinter and I've been stressing to say the least. Learning more about this stuff\nhas left me shocked beyond belief. I absolutely cannot wrap my head around how\nthe production of nuclear weapons has not been outright banned…",
  "data/reddit-ask/r/NoStupidQuestions/comments/t4jdhg/i_just_went_in_for_a_job_interview_and_got_hired.json": "I was called in for an interview over the phone. I went to the restaunt I\nthought I was supposed to be at. Told them I was there for my interview and got\nhired on the spot. Realized after the interview that it wasn't even the location\nI applied to.\n\nShould I pretend it never happened and try to go…",
  "data/reddit-ask/r/AskHistorians/comments/t4dqyg/would_a_small_church_in_1439_even_own_a_bible.json": "Would a small church in even own a bible in 1439 before the invention of the\nprinting press? How expensive was a bible? Is it cheaper to build a church or\nbuy a bible? How does this answer change in 200 AD?",
  "data/reddit-ask/r/AskHistorians/comments/t4cffx/would_a_ships_captains_log_in_colonial_times.json": "In fiction (or science fiction) a captain’s log is a real narrative device. But\nwould a real one have told us much about the actual people?",
  "data/reddit-ask/r/AskHistorians/comments/t4e7p5/montaigne_offhandedly_asserts_that_julius_caesars.json": "from the Frame translation of Montaigne's essay \"Of War Horses\":\n\n\"As Nature willed to make of that man [Julius Caesar] and Alexander two miracles\nof military art, so you would say that she also made an effort to arm them\nextraordinarily: for everyone knows that Alexander's horse Bucephalus had a…",
  "data/reddit-ask/r/AskWomen/comments/t4j5zn/women_who_exercise_what_made_you_start.json": "what are your goals pertaining body type, health, & nutrition?",
  "data/reddit-ask/r/NoStupidQuestions/comments/t4jchm/does_anyone_else_disregard_google_search_ads.json": "Even if it’s the thing I’m looking for, I always scroll down past the ads\nbecause I don’t want to be targeted by ad companies 😂",
  "data/reddit-ask/r/TooAfraidToAsk/comments/t4lit3/is_there_a_single_word_to_describe_the_kind_of.json": "Not necessarily in English. I know other languages have great words that have no\ndirect translation. I'm open to those as well. I feel like there should be a\nword. I had no idea what flair to use.",
  "data/reddit-ask/r/askscience/comments/t4id40/are_geostationary_satellites_only_around_the.json": "I assume the orbital planes of every satellite has to cross the centre of the\nearth, otherwise what are they turning around? And geostationary satellites are\nmeant to stay still in the sky when you look up at them, right? But that only\nworks around the equator otherwise the geostationary satellite…",
  "data/reddit-ask/r/NoStupidQuestions/comments/t4lv1f/whats_up_with_child_free_weddings.json": "I feel like all of the posts on subs like aita are about people wanting weddings\nwithout kids. This is absolutely bonkers to me– in my family and at every\nwedding I've ever been to, it's a celebration of family and community, and kids\nare not only at the wedding but included in the ceremony as…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/t4ozw5/is_15_too_young_to_get_an_abortion.json": "I may be pregnant and I am deathly terrified of having children especially at my\nage, and abortion seems to be exactly what I want to do but I’m scared it could\nhurt my body somehow?\n\nWhy do people say it’s so bad? Am I wrong for wanting this?\n\nINFO: condom broke",
  "data/reddit-ask/r/NoStupidQuestions/comments/t4q2lq/just_found_out_f19_my_boyfriend_m20_thinks_its.json": "Ive read other posts about this same topic and I NEVERRRR thought I would end up\nin this predicament 😭😭😭😭 wtf! Lmao! How do I convince him it’s NOT ??!",
  "data/reddit-ask/r/AskHistorians/comments/t4d874/the_roman_emperor_marcus_aurelius_was_annoyed_by.json": "> “Are you angry when someone’s armpits stink or when their breath is bad? What\n> would be the point? Having such a mouth and such armpits, there’s going to be\n> a smell emanating. You say, they must have sense, can’t they tell how they are\n> offending others? Well, you have sense too,…",
  "data/reddit-ask/r/askscience/comments/t4u1b3/is_it_theoretically_possible_for_someone_or.json": "It's kind of something I've wondered for a long time, I've always had this small\nfear of the idea of just falling upwards into the sky, and the moons low gravity\nsure does make it seem like something that would be possible, but is it\nactually?",
  "data/reddit-ask/r/AskHistorians/comments/t4hupo/what_american_cultural_practices_might_have.json": "I have read a lot of english language sources about early Chinese immigration.\nReading many of these you inevitably come across descriptions of how various,\noften mundane Chinese cultural practices were viewed with shock and horror by\nwhite people. How about the reverse?\n\nWhat are some american…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/t4v7em/are_there_men_out_there_who_dont_mind_waiting_for.json": "I (19f) have only been in one relationship but it was a strange one lol so it\ndoesn’t count.\n\nIm totally clueless on this subject and whether or not it’s actually normal,\npreferable, reasonable, a turn-off, or a deal-breaker if a girl asks her partner\nto wait for a few months because she wants to…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/t4xam1/why_is_body_shaming_penises_so_popular_in_culture.json": "People keep saying Putin has a tiny penis and has small dick energy. Basically\nthis means having a small penis is considered a humiliating, shameful thing and\nused to insult terrible people. But what about people who don’t invade countries\nbut have small penises? How are we meant to react? Do you…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/t4z915/is_there_really_any_difference_between_ukrainin.json": "As far as most civilians are concerned \"X bad guys are invading my country I\nwill defend my home\". I just find it interesting what is praised when one group\ndoes something and what is condemned when another does basically the same thing.\nI think Ukrainians should defend their homes, this is just…",
  "data/reddit-ask/r/NoStupidQuestions/comments/t4yvkj/i_have_a_friend_whos_going_through_a_second.json": "He's literally actively looking for another girlfriend as we speak!",
  "data/reddit-ask/r/askscience/comments/t4ym5r/askscience_ama_series_im_a_comparative.json": "Hi! I'm Dr. Alex Schnell, a Research Fellow from Darwin College at the\nUniversity of Cambridge. I'm a comparative psychologist interested in the\nbehaviour and mental processes of animals. More specifically, I investigate\nlearning, memory, and self-control in mainly cephalopods (e.g. octopuses…",
  "data/reddit-ask/r/NoStupidQuestions/comments/t4vcc1/can_you_tell_if_somebody_is_turned_on_through_an.json": "I had an EEG done recently, which is that test where they stick nodes on your\nhead and record your brain's electrical activity to see if you have epilepsy.\nThey make you do all sorts of things like blow a pinwheel or look at flashing\nlights, and during the process some of the node things near the…",
  "data/reddit-ask/r/AskWomen/comments/t4zj97/what_is_your_go_to_meal_for_breakfast.json": "It's morning where I am at and I know I probably just gonna skip it and have\ncoffee. What are your favorites in the AM?",
  "data/reddit-ask/r/NoStupidQuestions/comments/t5b1cm/nowhere_in_the_bible_does_it_say_that_you_cant.json": "A lot of Christian colleges, schools and churches have these types of rules in\nplace, so I’m wondering where they came from and why they exist, seeing as they\nprobably didn’t come from the Bible.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/t5eo8c/why_arent_evil_political_leaders_assassinated.json": "I’m not condoning murdering anyone or suggesting anyone should do it, I’m just\nwondering why it doesn’t happen more often.",
  "data/reddit-ask/r/NoStupidQuestions/comments/t5fxl7/is_this_something_normal_that_a_lot_of_guys_do_at.json": "My mom found out from an old friend today that my dad fucked at least 3 other\nwomen at his bachelor party. They’re divorced now so that’s why the friend was\nhonest. I think it’s extremely immature and shows that you don’t truly love who\nyou’re marrying and it made me really sad to hear. Either way…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/t5f5tl/if_cults_are_frowned_upon_how_is_religion_still_a.json": "In all honesty the majority of religions have so many brainwashed people, it's\nreally sad.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/t5f7fv/do_people_actually_enjoy_being_alive.json": "I can’t find the right way to word my question so the title is about as close as\nI can get. I just really don’t understand how anyone can enjoy life. The\nstruggle never ends and is 9/10 it isn’t worth the money effort\n\nI suppose this question is subjective, but I’d still like to know what…",
  "data/reddit-ask/r/AskHistorians/comments/t5gih0/how_frequently_did_wartime_leaders_such_as.json": "Recently, President Zelensky of Ukraine said that \"work and sleep\" is all he has\ndone since the start of the war last week. This made me wonder if/when he may\nsuffer from burnout or be incapacitated with stress, and how often wartime\nleaders in the past might have suffered the same.\n\nMy question is…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/t5fupj/is_it_disrespectful_after_a_breakup_of_a_3_year.json": "Me and my gf split up and it feels like she almost immediately found a\nreplacement. Kinda makes me feel like absolute shit, what do u guys think?",
  "data/reddit-ask/r/AskHistorians/comments/t58805/the_boy_in_the_striped_pajamas_is_going_to_get_a.json": "I will admit that I have not read the first book; I've just come across it amid\nthe recent announcement.",
  "data/reddit-ask/r/NoStupidQuestions/comments/t5jnhx/why_is_the_joke_that_vaginas_smell_like_fish_or.json": "Ok so, despite being a grown-ass woman, I still genuinely do not know where the\njoke/perception about vaginas smelling like fish, or smelling bad in general,\ncomes from. I’ve been under the impression that vaginal odor is uncommon, from a\nhormone imbalance, or cause by something like an infection…",
  "data/reddit-ask/r/askscience/comments/t5lkfk/if_memories_are_synaptic_connections_in_the_brain.json": "As I understand it, synapses are neurons making contact with one another. So to\nmake new synapses, the neurons would have to change on a cellular level. Surely\nthis would take hours, or possibly days (or more) to happen.\n\nSo why is it, if (for example) someone tells me their name, I'm sometimes…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/t5kn65/i_dont_want_to_die_i_just_want_to_disappear_for.json": "I’m about to turn 25 on Saturday and I want to turn and run and be on my own\nwith no contact with anyone I know. When I say run I mean run like overnight\nwithout saying a word to anybody. I’d obviously send out reassurance letters to\nmy parents so they are not worried but that’s as far as I want it…",
  "data/reddit-ask/r/NoStupidQuestions/comments/t5o5qc/how_much_is_a_cup_of_butter_i_found_online_that.json": "I found online that grams and cups are not interchangeable so can please someone\nthat has \"a stick\" tell me what quantity is written on it?\n\nEdit: thanks for the quick reply, I'm kinda high and trying to make some\ncookies. Y'all saved me\n\nEdit 2: don't worry, I figured it out thanks to you and it…",
  "data/reddit-ask/r/AskHistorians/comments/t5m88b/has_a_leader_ever_directly_killed_another_leader.json": "Not an ordered assassination, but in a direct one-on-one confrontation. Leader\nmight be a broad description, but basically any key figure killing their enemy\ncounterpart, say a general shooting a general, or a king striking down another\nking on a battlefield.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/t5rnim/why_women_and_children_first.json": "I searched for it and there is no solid rule like that (in mordern world) but in\nmany places it is still being followed. Most recent is Russian-Ukrainian war. Is\nthere any reason behind this ?\n\nEdit1 : Reply to people saying \"more women are needed to repopulate the world\" :\nIt is a good reasoning…",
  "data/reddit-ask/r/NoStupidQuestions/comments/t5rttp/i_like_leaving_my_origami_figurines_in_public.json": "I'm really into origami and I love giving them to people. One time I've\naccidentally left a pink crane on a bench. When I realized I wanted to go back\nand pick it up, but then I saw a woman who picked it up and put it into her bag.\n\nEver since then I started leaving little animals (cranes, crabs,…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/t5rb84/is_it_racist_to_dislike_black_americans_because.json": "Im sure this will spark some outrage and I dont mind being called names on the\ninternet but please elaborate first. Also, this isnt bait, just a legit\nquestion.\n\nLets just say that thanks to my job I served people all over the world.\nAmericans in general were by far the worst, however I havent had…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/t5rr2s/do_people_really_think_a_childteen_should_be_able.json": "It seems absurd to me that some people are ok with the idea of letting a\nchild/teen make a decision like that. I’m all for adults doing whatever makes\nthem happy. But to let a child/teen make such a life changing choice when their\nbrain isn’t even close to being fully developed is closer to child…",
  "data/reddit-ask/r/AskHistorians/comments/t5v776/what_means_of_contraception_or_ways_did_sex.json": "Apologies for the crudeness of the question, but the way I see it a woman having\nintercourse daily would lead to pregnancy quite often which couldn't have been\nprofitable for the brothel. Abortions were not completely safe procedures and I\nimagine raising the child might be costly in both resource…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/t5taof/why_does_black_history_month_always_center_around.json": "I understand the historical importance but there's so much more to black history\nthan that. It also seems to reinforce division between races, albeit\nunintentionally.\n\nWouldn't it be better to focus on positive contributions from Black Americans\nand the beautiful and vibrant culture that exist in…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/t61eux/is_rtooafraidtoask_just_becoming_the_new.json": "I joined this sub a few months ago, and I have seen a noticeable uptick recently\nof a specific type of post.\n\nIt seems like every single day someone comes in asking something along the lines\nof “Is it bad that I don’t like queer people? And (supposedly) citing one bad\nexperience they had with a…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/t60hmi/why_does_he_stop_midway_through_sex.json": "When my guy and me have sex sometimes he stopped in the middle of sex and seems\nto collect himself before continuing on. I don’t want to embarrass him and ask\nhim why he does this. Any ideas? Is he trying to stop himself from cumming too\nearly?",
  "data/reddit-ask/r/NoStupidQuestions/comments/t5u0s4/why_are_companies_forcing_people_back_to_the.json": "People can claim all the stuff they need to work from home as a tax write off\n(computer, internet, furniture, work space, ect)\n\nThe company can justify not having to pay you enough to commute (buying a car,\ninsurance, gas, office clothing, ect),\n\nThen if it's the more desirable work location, you…",
  "data/reddit-ask/r/askscience/comments/t5vzra/why_does_the_hawaiian_underwater_mountain_chain.json": "Looking at the Hawaiian hotspot, the underwater mountain chain makes a large\nturn a bit before it disappears. Why did it make such a turn? Was it the hotspot\nor the plate? Do such big shifts in direction happen often?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/t652z6/does_anyone_pull_the_shower_curtain_back_in_the.json": "Didn’t know what to really flair it as.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/t66vk3/why_is_every_3th_post_here_right_wing_complaints.json": "Why has it become normal for this sub to have whiny dogwhistle-title posts\ntrending all the time? Every third post is not a question but rather an\nunderlying statement about how (white) men are oppressed and how feminism has\nruined movies, also sometimes stories about how gay men are predators,…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/t67skt/why_do_doctors_get_blamed_if_the_surgery_gets.json": "It seems like a double standard. Why can nobody blame “God” for the heart attack\nbut they can blame the doctor for messing up the surgery?\n\nOn the flip side, why does “God” get the praise when the surgery goes\nsuccessfully? “God” didn’t go to med school for 8 years and go $200,000 in debt\nto help…",
  "data/reddit-ask/r/AskHistorians/comments/t5pt9m/where_does_the_dabdabadabdab_dabdab_knocking.json": "It‘s everywhere and known to everyone (at least in Europe/North-America). Could\nnot google it.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/t68ab7/why_do_we_keep_voting_old_men_into_power.json": "It seems all the articles I've read state that cognitive function can start to\ndecline after 60. They have said that the brain shrinks by 5% per decade once\nyou are over 40 and this rate increases again after 70. There are a lot of other\nchanges that occur as well.\n\nWe have a retirement age for…",
  "data/reddit-ask/r/NoStupidQuestions/comments/t62z4i/i_lost_my_2_week_old_kitten_and_i_cant_find_her.json": "The last time I saw her was about an hour ago before I left for a quick grocery\ntrip. I came back about 20 minutes later and she was nowhere to be found. I’ve\nlooked all around my room numerous times but I just can’t seem to find her and\nI’m starting to get nervous, especially since she’s usually…",
  "data/reddit-ask/r/NoStupidQuestions/comments/t690a2/drinks_to_order_at_a_bar_that_dont_taste_like.json": "Can't fucking stand alcohol. 2-3% fruity ciders are genuinely my limit. I\nusually order sodas or juices, but that's been getting me a lot of hate when I\ngo out with others. Just need some drink suggestions that aren't the usual dead\ngiveaway \"This guy can't drink alcohol\" orders",
  "data/reddit-ask/r/NoStupidQuestions/comments/t6c030/instead_of_making_trans_people_play_on_either.json": "I see this argument a lot when people don’t want transwomen playing in women’s\nsports, but transpeople also deserve to feel their gender is accepted.\n\nMore broadly, Why does a trans person have to be labeled “woman” or “man” (i.e\nFTM, MTF)? Can’t they just be called a different gender, which would…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/t63cyy/my_girlfriend_spit_on_my_chest_during_sex_and.json": "I liked it but idk felt kinda weird",
  "data/reddit-ask/r/TooAfraidToAsk/comments/t69h3k/why_do_atheist_and_agnostics_tend_to_be_more_left.json": "I know this isn't always the case but I'm curious about the correlation.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/t6esro/how_do_so_many_guys_just_dont_wash_their_dicks.json": "Am i overthinking this too much?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/t6eaf5/why_are_men_on_average_uglier_than_women.json": "Maybe I am biased as a heterosexual male, but I am not the kind who can't\nacknowledge a good looking man when he sees one.\n\nHowever it seems to me, that women are just better looking. There is very few\nmen where I go \"this man is good looking\" whereas I see every day real\nattractive women.",
  "data/reddit-ask/r/askscience/comments/t63qbz/do_birds_cross_breed_is_it_possible_for_birds_to.json": "Is it possible for birds to cross breed, like dogs/cats do?\n\nFrom my observations, I don't recall seeing any hybrid birds that may have been\nthe result of cross breeding, like an owl with parrot colours.\n\nIs this because of the evolutionary drive of these animals being so ingrained\nthat they have…",
  "data/reddit-ask/r/AskWomen/comments/t6agk8/what_is_the_most_romantic_heart_fluttering.json": "People on here always asks what are the worst dates you’ve been on or any bad\nstories you’ve experienced, but I want to know what’s the most romantic thing\nthat’s happened to you.",
  "data/reddit-ask/r/askscience/comments/t6aqwb/are_charcoals_in_soils_always_a_good_thing_ie.json": "https://www.youtube.com/watch?v=YB9g9l5CjGk\n\nCharcoals have polar surfaces with tremendous numbers of nooks and crannies and\nare found ubiquitously in the world's soils deposited from fire. These legacy\nstructures modulate soil fertility, individual plant response, and subsequent\nlarge-scale…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/t6g2t9/why_is_everybody_so_dumb.json": "I came out of school into work life thinking adults had it all figured out. I\nstarted a construction job and I’ve been working on job sites for 4 years now.\nIt seems like every person has a problem that is easily fixable but they just\ncontinue to fail at life.\n\nExample. People staying out drinking…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/t6fxav/why_is_body_dysmorphia_considered_a_mental.json": "Both definitions taken from Wikipedia:\n\nGender dysphoria (GD) is the distress a person feels due to a mismatch between\ntheir gender identity—their personal sense of their own gender—and their sex\nassigned at birth.\n\nBody dysmorphic disorder (BDD), occasionally still called dysmorphophobia, is…",
  "data/reddit-ask/r/NoStupidQuestions/comments/t6hfhs/does_drinking_6_beers_every_night_make_one_an.json": "I resent the label, and I don't binge drink. But I do go through a six pack\nevery night, but spread between 3pm until 10pm. I don't touch hard liquor except\non weekends.\n\nI have a job, can think clearly, never been caught with crime, etc.\n\nWould I still be considered an \"alcoholic\"?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/t6hc9x/why_do_we_call_the_old_greek_gods_myths_but_we.json": "I really don’t want to have this conversation face to face.",
  "data/reddit-ask/r/NoStupidQuestions/comments/t6mjim/if_your_kidnapper_was_forcing_you_to_write_a_im.json": "I remember listening to a true crime podcast about a girl that was kidnapped,\nthe police were looking for her.\n\nAfter she stayed in the news for a while the kidnapper made her write a letter\nwhich he would send to her home, she ended up pushing her fingernail into one of\nthe words in attempt to…",
  "data/reddit-ask/r/NoStupidQuestions/comments/t6m7w2/a_key_argument_for_veganism_is_the_amount_of.json": "Obviously I know there's not one consisting opinion across all vegans. And this\nis not a hate on vegans, I'm just genuinely curious about what they think we\nshould do with the farm animals instead?\n\nLike even if we gave up eating meat, and turned the pastures into crop fields,\nwe'd still need…",
  "data/reddit-ask/r/NoStupidQuestions/comments/t6kpay/does_it_seem_like_search_engines_are_getting_less.json": "It seems like over the last 5-10 years, search engines for general internet\nsearch (google, duck duck go, bing, etc) have become less useful in finding\naccurate results. I am just trying to gauge if this is true or something I am\nimagining.\n\nFor example, earlier, I typed in \"Best Bose products of…",
  "data/reddit-ask/r/AskWomen/comments/t6oofy/what_unhealthy_habitchoice_do_you_think_is_worth.json": "I was reading an article about how wellness obsession (the idea that you have to\nalways make the healthy choice, in all aspects of your life) can be toxic in\nitself.\n\nWe all have little pleasures that might not be the healthiest but makes life\nworthwhile. I wanna hear what is yours?",
  "data/reddit-ask/r/askscience/comments/t69jth/how_can_you_determine_the_most_efficient_gear.json": "I am part of a robotics team and thought that it would be useful to find the\nrelationship between gear ratio and the efficiency of a DC motor. When I looked\nit up I found plenty of graphs that represent the efficiency as a parabola,\nincreasing as RPM increases and torque decreases, then dropping…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/t6tabx/when_did_society_decide_big_boobs_are_the.json": "I'm a little drunk so this will probably be deleted laterlol",
  "data/reddit-ask/r/AskHistorians/comments/t6ojum/did_chinese_eunuchs_ever_have_lovesex_lives.json": "I'm very fascinated by eunuchs from Imperial China. I know there are lots of\nstories about them being corrupt or bad, but I'm also curious about the more\nhuman side of them.\n\nIf I was going to lose my penis and testicles, I know that how it would affect\nmy love life would be one of the first things…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/t6vyhe/what_do_buttplugs_do.json": "I hear about them all the time in various kinky scenarios some which include\njust leaving one in whole walking around town, home, or gaming. They just seem\nsuper uncomfortable. Do they actually provide arousal or is it just sorta a kink\nthing?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/t76u63/why_do_people_never_talk_about_how_hard_it_is.json": "I came out of a 4 year relationship last year and the reason we broke up is I\nfound the relationship was getting platonic. We had a toxic relationship but we\nboth couldn't imagine ourselves being with anybody else. I think a lot of the\ntoxicity came from constantly being in each others space, like…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/t777fw/do_girls_also_lose_interest_in_sex_right_after_an.json": "Most guys would agree that sex instantly becomes the least interesting thing in\nthe world right after ejaculation. I wonder if girls ever experience this to the\nsame extent. I've heard that girls also have the refractory period but since\nmany of them can have multiple orgasms it looks like they're…",
  "data/reddit-ask/r/NoStupidQuestions/comments/t73my6/am_i_a_creep.json": "Okay, so I'm making this on a throwaway account because I don't want to be seen\nas creepy because I don't know if this is stalkerish or not.\n\n\n\nI've had a crush on a YouTuber since I was around 11. We're around the same age\n(19(me) & 24(YouTuber), respectively). I don't follow any of his social…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/t77krx/why_do_racist_people_dislike_being_called_racist.json": "I don't know the title says it all. Why don't they own up to it. If that's what\nthey believe.",
  "data/reddit-ask/r/NoStupidQuestions/comments/t78e5f/fellow_corporate_travelers_how_much_do_you_tip_at.json": "I work for a multi-billion dollar company and travel about 50% of the time for\nwork. Even through the pandemic I needed to travel. We get $50 a meal for food\nbudget, but there is no guidance on tipping.\n\nFor the last two years, I have tipped around 25%, as long as it stays under the\n$50. My…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/t79ldg/how_come_its_socially_acceptable_to_generalize.json": "It's already 2022 but I still see a lot of \"all men are trash\" or \"why are men\nlike this?\" kind of posts not just in twitter, but also here in reddit and\nfacebook.\n\nBut when others say the same thing about women, they get downvoted, reported or\nbanned from social media.",
  "data/reddit-ask/r/NoStupidQuestions/comments/t79ggo/why_is_it_acceptable_for_women_to_grope_men.json": "Hear me out here. I have experienced countless of times at parties where women\ncome up to me and grope me, latest was yesterday.\n\nObviously they don't come up and just grab me, but they do it gradually.\nGrabbing my bicep, touching my chest and so on. It happened to so many times\nyesterday after I…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/t70qg0/theres_been_a_rise_in_ass_eating_within_the_past.json": "Is it like fashion that goes in and out of style. Like was there a few years\nwhere everyone was getting foot jobs did a while?\n\nI really hope this makes sense. I’m very high.",
  "data/reddit-ask/r/NoStupidQuestions/comments/t6o3px/why_are_white_people_consider_to_not_have_culture.json": "Just like the title says. I've (White, M, 29) seen a few \"viral\" videos of black\nstudents telling white student that they shouldn't be in a universites cultural\ncenter because \"white people don't have culture\".\n\nAs I understand it culture is the \"customs, arts, social institutions and\nachievements…",
  "data/reddit-ask/r/NoStupidQuestions/comments/t78qkt/how_do_i_get_my_cat_to_stop_waking_me_at_4am_for.json": "I recently moved out on my own and my cat, who previously lived with other cats,\nis waking me at ungodly hours for food. This is new behavior. He's 14 and I've\nhad him since kitten.\n\nHe gets half can of wet food in AM and PM and access to dry food all day that he\ndoesn't eat much of. I started PM…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/t78axz/if_i_get_drunk_can_i_kill_the_possible_tapeworm_i.json": "It might just be a stomach bug but idk its bee 5 days",
  "data/reddit-ask/r/askscience/comments/t7crof/how_does_the_language_in_which_we_think_change.json": "So at one time the language my brain uses to express thought changed from one\nlanguage into another and I can’t understand the process behind that. (At that\ntime I lived in another country for some time and was not confronted a lot with\nmy first language.)\n\nHow does that happen? My brain made all…",
  "data/reddit-ask/r/AskWomen/comments/t7agii/how_do_you_handle_love_bombing.json": "so for those who haven't experienced it yet I'll try to explain it.\n\nsomeone targets you with overwhelming cheesy gestures such as love songs, gifts,\ncompliments, harassment, faking future, gets in your space, could involve some\nstalking, keeping an eye on you etc.\n\nThe point is whatever they are…",
  "data/reddit-ask/r/AskHistorians/comments/t7bx9k/when_did_the_distinct_ukrainian_identity_emerge.json": "I know they were part of the Kievan Rus, yet they are not Russians, they were\nalso part of the Polish-Lithuanian Commonwealth, yet they are not Polish nor\nLithuanian. When did the idea of Ukraine as a people emerge, and how was it\ndifferent from nearby states like Russia?",
  "data/reddit-ask/r/NoStupidQuestions/comments/t7fs1v/why_do_some_people_write_of_in_place_of_have.json": "I have noticed this on almost all social platforms. People using 'would of' or\n'should of' instead of 'would have' or 'should have'. Is this like a short way\nof writing the verb? Or is it another of those most common grammatical errors\ndone by people online, like it's/its? Genuinely confused.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/t7kwy7/attractive_in_30s.json": "Do men consider women in their 30s attractive? I'm a few months away from 30 and\nrecently single. I'm feeling a bit down and worried to be dating at this age.\nMostly interested in how men in my age range view women in their early 30s.",
  "data/reddit-ask/r/AskHistorians/comments/t7di8i/did_nazis_really_greet_each_other_like_this.json": "https://streamable.com/d77kpm",
  "data/reddit-ask/r/TooAfraidToAsk/comments/t7jcx5/why_do_people_complain_about_desk95_jobs_so_much.json": "I simply don’t get it. For YEARS we’ve been fed that a 9-5 office type job is\nthe most soul crushing job on earth but after working food service for like 5\nyears and just getting a front desk job at a barber shop this shit is the life.\nI just check in and out customers, answer some phone calls,…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/t7nt6z/how_the_hell_does_my_dad_have_a_massive_dong_and.json": "I had never seen my Dad naked for some reason. Not that I ever wanted to. But\nlast month I saw him changing in the gym. The guy has a freaking porn dick. It\nwasn't even hard but it was massive regardless. It sounds extremely gay and\nincestuous but that's been stuck in my head from that very day.…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/t7oaxw/why_do_people_think_gas_prices_are_caused_by_the.json": "Serious question. I see no correlation and can’t find any information that would\nexplain this connection.\n\nIf there is a connection I want to see it. Please show me.",
  "data/reddit-ask/r/AskHistorians/comments/t7m54v/was_thomas_edison_really_as_terrible_as_people.json": "Honestly all this time all I ever heard was that Edison was a their and cruel\nbusinessman who destroyed Teslas career as an inventor for profit and stole\ninventions form many and claimed them as their own. Is this all true and was he\nreally this evil person most people see him as.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/t7nb6h/why_is_it_selfish_to_not_have_children.json": "Isn’t it way more selfish to create a human for the wrong reason? Not saying\nhaving kids is always selfish, just if it’s done for the wrong reasons.\n\nI’ve heard stories of child free people being told they’re “selfish” by\nrelatives for not having children. But I don’t understand the logic.\n\nEdit:…",
  "data/reddit-ask/r/NoStupidQuestions/comments/t7rtve/does_anyone_know_what_happened_to_hentai_between.json": "This is not a troll post, I swear. I'm genuinely curious. I was screwing around\nin Google Trends and, behaving like the pervert that I am, I noticed that google\nsearch interest in hentai PRECIPITOUSLY dropped between those two months, and\nhasn't fully recovered since. I would post screenshots of…",
  "data/reddit-ask/r/NoStupidQuestions/comments/t7ocgf/will_prices_on_every_day_goods_ever_drop_after.json": "I don’t really understand economics so sorry if this is an easy answer.",
  "data/reddit-ask/r/AskHistorians/comments/t7u61y/why_werent_jews_able_to_hide_the_fact_they.json": "How come they couldn’t lie, did they not want to, or was there a state register\nof all the jews, or were snitches just so common it wasn’t possible to lie? Or\nwere they able to hide they were jewish, and if so, how?",
  "data/reddit-ask/r/AskHistorians/comments/t7ou18/how_did_people_survive_hyperinflation_in_weimar.json": "I've seen a lot of talk about how hyperinflation was bad in Weimar Germany, and\nprices were doubling every day. Most places just talk about what caused it\n(printing money), but not how average people survived.\n\nMy question is, how did people survive this?\n\nIn a scenario like this, I'd assume that…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/t7zko4/is_sleeping_in_underwear_bad.json": "When I was younger(13M)my mom told me not to sleep in my under wear which is\nusually semi tight boxers, I listened to her of course and I still do, but I was\nwondering is it really bad for you or just some thing?",
  "data/reddit-ask/r/AskHistorians/comments/t80wiq/former_chief_justice_warren_burger_in_1991.json": "Full quote in question:\n\n> He declared on PBS that the Second Amendment \"This has been the subject of one\n> of the greatest pieces of fraud, I repeat the word fraud, on the American\n> public by special interest groups that I have ever seen in my lifetime.\"\n\nAnd if you look at Gallup polls, there…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/t7wvjj/why_would_anyone_want_to_get_married.json": "Sounds like a huge pain In the ass and z lot of a hard work which fails half the\ntime",
  "data/reddit-ask/r/TooAfraidToAsk/comments/t80g5g/why_do_judges_impose_sentences_of_170_years_254.json": "The title says it all. I always wondered what's point of handing out such\nspecific sentences. Why not simply say life imprisonment or do they think\nperhaps, there might be a chance someone outlive those sentences?",
  "data/reddit-ask/r/NoStupidQuestions/comments/t820d0/does_joe_biden_really_have_anything_to_do_with.json": "If so, how? And if not, what is the cause?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/t81lbg/is_it_ok_to_be_excited_to_tell_my_therapist_i_was.json": "So my therapist and I have been working on my social anxiety and my ability to\nhold conversation with other people. The goal she set for me was to talk to at\nleast one girl (even if I’m not attracted to them, talking to girls trip me up\nbecause the last thing I want to do is make a girl feel…",
  "data/reddit-ask/r/NoStupidQuestions/comments/t88unw/are_the_grownups_i_meet_irl_secretly_as_fucked_up.json": "I literally can't process the disconnect",
  "data/reddit-ask/r/AskHistorians/comments/t8cb38/sk8er_boi_a_lavigne_2002_argues_that_in_high.json": "The artistry in question [https://www.youtube.com/watch?v=TIy3n2b7V9k].\n\nI find the implication that Sk8er is a loser intriguing because I feel like\nmedia has led me to associate skateboarding with being cool, and this song kinda\nsubverts that understanding. The description that he's a punk I think…",
  "data/reddit-ask/r/NoStupidQuestions/comments/t8cj38/can_my_neighbor_legally_do_this.json": "Hi everyone! Last night was my 27th birthday and I had a group of friends over\nat my house. This afternoon my neighbor across the street came over and\ncomplained to me about cars parked in front of his house last night. He told me\nthat he doesn't want anyone parking in front of his house especially…",
  "data/reddit-ask/r/AskHistorians/comments/t8dl5u/chinese_textbooks_state_the_korean_war_was.json": "Source of Chinese textbooks from the second to last paragraph here\n[https://supchina.com/2021/12/01/the-real-battle-at-lake-changjin/]",
  "data/reddit-ask/r/NoStupidQuestions/comments/t8fbeh/are_there_people_out_there_who_dont_pick_their.json": "As soon as I wake up I gotta take all that shit out of there. It's so relieving\nand it's hard to believe that there's people who just don't do it from time to\ntime, not even out of relief but out of necessity. I can barely breath out of my\nnose when I wake up, and as I go through my day there's…",
  "data/reddit-ask/r/NoStupidQuestions/comments/t8icck/does_everyone_feel_like_they_need_to_make_things.json": "It’s kind of hard to explain, I guess like for example if I step on a crack with\none foot I have to step on another crack with the other foot. And I often need\nto have even pressure/touch on my body on both sides, especially if I’m\noverstimulated. (If I don’t it feels really uncomfortable and I…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/t8a0sn/should_i_be_ashamed_to_work_at_mcdonalds_at_24.json": "I’ve been collecting unemployment because I have complex-PTSD. I have huge gaps\nin my resume from when I was sexually trafficked and from when I experienced\ndomestic violence. I can’t exactly put that on my resume and I’m not okay with\nlying to fill in the gaps.\n\nMy family is really snooty and used…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/t8k7gs/why_are_people_in_north_america_such_prudes.json": "Nudism is very popular in Europe. There are nude beaches everywhere, designated\nspots for nudity, and people generally go naked when using the saunas.\n\nIn Europe simple nudity does not equal sex. There are countries that have\ntelevision shows teaching kids what normal bodies look like. Europeans…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/t8hacv/how_do_i_clean_my_penis.json": "This might be somewhat disgusting to read so I apologize in advance.\n\nI am 16 years old, uncircumcised, and I was never really taught how to do it. I\nrecently learned that you have to pull down your foreskin, then clean with soap\nand water. I remember trying to pull down my foreskin as a kid, but…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/t8kiob/is_masturbation_innate_in_humans_or_learned.json": "Imagine if someone was born in a white room with nothing but a straw to suck\nfood and water out of, would they discover masturbation?\n\nEdit: my friend said they didn’t know what to do and had to watch a tutorial",
  "data/reddit-ask/r/NoStupidQuestions/comments/t8mlm6/does_anyone_tuck_themselves_in_bed_comfortably.json": "I wonder if it’s just me. Why should I feel worse when I got one more thing off\nmy mind? 🤷🏾",
  "data/reddit-ask/r/NoStupidQuestions/comments/t8ro7o/why_doesnt_apple_include_a_charger_when_i_drop.json": "Been a Samsung guy and every time I've upgraded to a new phone in the box I got\nphone, charger, charging cable, and headphones. Decided to try iphone and got\nthe 13 pro max and just went to set it up and it didn't come with a charger and\nI do not have any chargers that fit it. Have all companies…",
  "data/reddit-ask/r/NoStupidQuestions/comments/t8rz08/is_there_anyone_else_who_gets_overwhelming.json": "I have to do one today and I’ve been procrastinating. Not only that, if I do get\nthe courage to do so, I’ll stammer a lot and I’ll be visibly shaking as I do it.\nIf I feel I got my answer I end the call before they even say goodbye. I’m\npretty sure I’m just some weirdo who can’t even talk to…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/t8tm8m/my_15_year_old_bf_got_his_outfit_for_a_wedding.json": "Today I accompanied my BF and his mom (at her invitation) to buy a suit for him\nand the poor guy wasn't even allowed to decide for himself. Tbh my bf can't\nstand nice clothes and i can imagine he would give his mom a hard time buying\nhim something nice, but the fact that he isn´t allowed to choose…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/t8udqk/my_gfs_friend_who_happens_to_be_in_the_lgbtq_keep.json": "I’ve been thinking about this a lot but I rarely see this person and they keep\nmaking small comments like “oh I dont hear straight guys sing much that’s weird\nto hear” as well as a big one last night when she said “straight men make me\nfeel uncomfortable” after asking why she responded “what have…",
  "data/reddit-ask/r/AskHistorians/comments/t8i1pt/japans_miraculous_economic_rise_came_to_a.json": "So, I just watched a documentary based on the book \"Princes of the Yen\" and it\nargues with many quotes from Japanese higher ups that the \"window guidance\" was\nthe critical force behind Japanese economic \"miracle\", in which the Bank of\nJapan gives quotas to banks how much they should lend and to…",
  "data/reddit-ask/r/askscience/comments/t8tbxa/before_einstein_did_physicists_believe_that_the.json": "Today, we know that it would take infinite energy to achieve a finite speed\n(with that speed being the speed of light). But before we learned that fact, did\nphysicists believe that if you had infinite energy you could achieve infinite\nspeed?",
  "data/reddit-ask/r/AskHistorians/comments/t8tmpo/american_comic_book_author_rob_liefeld_is_not.json": "For starters, I am not big into comics, and so only know Liefeld by reputation\nand the art\n[https://3.bp.blogspot.com/-LpUNDt1iQBw/TheIbJ_ArAI/AAAAAAAAI4M/k2Cdc9IHHnk/s1600/liefeld-cap.jpg].\nI was looking into him today and discovered that he has defenders, including,\napparently, Grant Morrison,…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/t8y0ff/am_i_ridiculous_that_im_still_wearing_a_face.json": "I've been wearing my face covering every since the begining of the pandemic, am\nI ridiculous in still wearing my face mask up to this point in the pandemic? I\nsee some people around me that have no mask on",
  "data/reddit-ask/r/NoStupidQuestions/comments/t8vf5c/does_anyone_else_have_debates_with_themselves.json": "Like, I have full structured debates and conversations with myself, not even in\nmy head. I'll just be in my room muttering to myself about random things.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/t93xkj/do_people_actually_like_small_boobs.json": "Not gonna lie I’ve been insecure for quite some time cause of the size of my\nchest, It doesn’t help when people comment negatively on how small or flat they\nare and it’s not \"feminine\". I just never understood why it’s seen as\n\"unattractive\" and we get put down for having something that’s out of…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/t91afq/does_anyone_actually_like_kanye.json": "The man’s been delusional since birth. He’s cocky, aggressive, destructive, dumb\nas hell, severely mentally ill, and has a god complex. I’m curious if anyone\nactually likes this man, aside from his subpar music",
  "data/reddit-ask/r/TooAfraidToAsk/comments/t96m4v/i_may_not_have_anyone_in_person_to_tell_this_to.json": "I can't sleep anyway. We all have a story to tell. Everyone story matters.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/t8wmn0/is_it_common_to_feel_depressed_on_your_birthdays.json": "I'm only 17 and basically started around my 14th or 15th birthday, ill just be\ndepressed most of the day and overthink about everything",
  "data/reddit-ask/r/AskWomen/comments/t962a5/what_is_the_weirdest_celebrity_crush_youve_had_in.json": "Idk about other women, but BOY have I had some strange ones.",
  "data/reddit-ask/r/AskHistorians/comments/t959b7/marie_anne_of_austria_was_said_to_have_been_born.json": "https://en.m.wikipedia.org/wiki/Archduchess_Marie_Anne_of_Austria#:~:text=Marie%20Anne%20of%20Austria%20(Maria,Theresa%20of%20Naples%20and%20Sicily\n[https://en.m.wikipedia.org/wiki/Archduchess_Marie_Anne_of_Austria#:%7E:text=Marie%20Anne%20of%20Austria%20(Maria,Theresa%20of%20Naples%20and%20Sicily…",
  "data/reddit-ask/r/AskHistorians/comments/t955n3/why_were_the_freemasons_so_controversial_in_the.json": "Like wtf was going on back then",
  "data/reddit-ask/r/askscience/comments/t9abox/i_learned_from_green_planet_that_many_plants.json": "What is the down side to having the substances present all the time? Is it that\nthe insects evolve a defence?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/t9dzti/why_didnt_we_cancel_trade_with_saudi_arabia_and.json": "Right from harbour, funding and morally defending Islamic terrorism to what it’s\ndoing to Yemen ( another “sovereign” country ).\n\nWhereas europe and USA just cancelled oil and gas trade at the expense of\ncitizens. A lot of people are already facing the music and are shit scared with\nthe soaring…",
  "data/reddit-ask/r/AskHistorians/comments/t9csgr/how_did_the_germans_depropagandize_after_wwii_and.json": "In light of the current events, that once again prove that history repeats\nitself, I am curious to know what happens to people whose whole worldview\ncollapsed and who realize that \"they were the baddies\" all along.",
  "data/reddit-ask/r/AskHistorians/comments/t9a25l/political_science_theory_puts_a_lot_of_emphasis.json": "It kind of seems to me that \"the modern territorial state sprung into existence\nwith the signing of the Peace of Westphalia\" is something of an axiom within\nacademic polsci. However, I often see it being mentioned as a throwaway\nstatement by legal and political science scholars that don't…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/t9fchr/why_do_christians_say_that_god_hates_certain.json": "I mean people have taken the bible out if context, so maybe that's why? Its\ncontradictory though.",
  "data/reddit-ask/r/AskHistorians/comments/t9awge/when_did_usury_stop_being_a_sin.json": "When did usury stop being a sin in Christianity and Islam?\n\nDoes it have any ramifications in modern times with especially religious\ncountries?",
  "data/reddit-ask/r/NoStupidQuestions/comments/t9gl8e/why_do_the_people_on_the_right_screaming_about.json": "Please make it make sense. How can they hate fascism and anti fascists? This is\nnot a satirical question. I'm truly this stupid and need someone to explain what\nI'm missing.",
  "data/reddit-ask/r/AskHistorians/comments/t9ccra/how_did_germany_go_from_a_collapsed_economy_in.json": "Didn't they have to pay reparations to the victors of WW1 and also had some of\ntheir territory taken away?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/t9grpk/how_drunk_can_a_girl_be_before_its_considered.json": "Like when does it switch from two drunk people sleeping together and a rape? And\nif I’m sober and she is buzzed, is that rape?",
  "data/reddit-ask/r/NoStupidQuestions/comments/t9g0m8/if_the_5_day_work_week_was_designed_with_men.json": "Logically, shouldn't we be working half as many hours?",
  "data/reddit-ask/r/NoStupidQuestions/comments/t9k2gb/why_dont_all_the_states_in_the_us_that_support.json": "A state like California or New York would have more than enough population by\nitself, so they and other likeminded states together would have no issues\nconcerning funding. And it could serve as an example of how universal health\ncare could work (or not should that be the case).",
  "data/reddit-ask/r/NoStupidQuestions/comments/t9ltzb/is_life_just_suffering_for_most_people.json": "I keep seeing these articles about how like 65% of Americans live paycheck to\npaycheck, how everyone is making $50k just to live in a shitty apartment with 3\nother people, can't start a family because they can barely support themselves,\netc.\n\nI'm 19 and I likely won't be making much more than…",
  "data/reddit-ask/r/AskHistorians/comments/t9fu6d/are_there_examples_of_authoritarian_governments.json": "In The Age of Revolution, Eric Hobsbawm writes “The decisive importance of the\ncapitals was universally accepted, though it was not until after 1848 that\ngovernments began to replan them in order to facilitate the operation of troops\nagainst revolutionaries.”\n\nReading this, I was curious to learn…",
  "data/reddit-ask/r/AskHistorians/comments/t9t9vj/why_native_american_names_tend_to_be_translated.json": "Every time I read anything about North American natives, their names are\nliterally translated to English, and I do not understand it. Why Native leaders\nare called \"Spotted Elk\", \"Sitting Bull\" or \"Long Horn\", seeing how nobody\ncalls, say, tlatoani Motecuzoma \"Speaker Who Frowns Like Lord\" and if I…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/t9sxii/are_men_turned_off_by_saggy_boobs.json": "I’m not talking down to your knees grandma cartoon boobs. Just, regular boobs\nthat are no longer perky. You can fit a granola bar under one of them. If you\nlean forward, you could fit your wallet under one. Thoughts?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/t9lqo9/how_euthanasia_is_still_not_a_thing_in_most.json": "Fuck man, my 17 year old cat had to go by euthanasia today, he wasn't able to\nwalk anymore, he couldn't go and eat by himself, he couldn't go to WC by\nhimself. He was just laying there. He was like this for a total of 1 day, before\nI decided to put him down. It sucks, a lot, I'm extremely sad and…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/t9tehc/are_50_of_reddit_users_literal_children.json": "This is a slightly hyperbolic framed question, but I get the impression that a\nlot of Redditors are just a bunch of Russian trolls and kids who haven't\nfinished high school yet. I don't mind trolling/goofing around for the sake of\nbeing funny, but in EVERY comment section there's toxic behavior, no…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/t9vk9o/how_do_i_pull_back_my_foreskin.json": "Whenever I try to it hurts. I really wanna do it because I don’t want to develop\nhygiene issues, I can’t clean my penis properly because of this. Please help !",
  "data/reddit-ask/r/AskWomen/comments/t9ylup/how_do_you_dry_off_down_there_after_shower_during.json": "I am a grown woman and I have still yet to figure out a reasonable solution to\nthis. Usually, I just use a towel, but during my period, I don’t want blood to\nget on it. Sometimes I will just use a paper towel, but it just seems wrong and\nbizarre. How do you do this?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ta26aw/why_do_people_that_clearly_cant_afford_it_yet.json": "I don’t mean by ‘accident’, but by choice. When it’s clear beforehand that you\ndon’t have the financial means to afford it and you still go through with it.\n\nThese days, having children can put you in permanent poverty. In some (Western)\ncountries it’s so expensive that you could possibly never…",
  "data/reddit-ask/r/NoStupidQuestions/comments/ta3an6/why_do_people_spend_thousands_of_dollars_on_a_new.json": "If you look on the Facebook marketplace or just do an easy google search you can\nfind full-sized traditional pianos that people give to you at no cost. All you\nhave to do is go and get it! And the bonus to these free pianos is that they\nhave rich history versus the new ones that... well have no…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ta7rgm/my_mom_is_level_10_abusive_my_dad_didnt_answer.json": "(Mind you my mom has/is physically, emotionally, sexually, and psychologically\nabusive)\n\nI recently lost weight and MUCH look more attractive. I wear nicer clothing,\nhair, the whole 9 yards. She always comments on my look, “who are you dressing\nup for?”, giving me the side eye, doesn’t like when I…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ta8szm/why_does_everyone_on_reddit_seem_like_the_same.json": "This might have been asked before, but literally every comment with the\nexception of a few sound the same and have a similar tone. They all sound funny,\nself depricating but confident. Is it because Reddit attracts a certain crowd?\nLet alone everyone seems like they know each other in the comment…",
  "data/reddit-ask/r/AskHistorians/comments/ta59pn/what_is_the_real_context_behind_this_photo.json": "This photo\n[https://cdn.discordapp.com/attachments/642140736216629250/949163665473560626/unknown.png]\nis frequently brought up to claim that the Tiananmen Square massacre was a\njustified by the protesters' barbarity, including on…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ta6sh5/so_what_are_you_planning_to_do_if_the_price_of.json": "I understand gas will go down one day. But probably not under $3 if keeps going\nup. Used Car prices may come down in a 2years but not anytime soon. However my\nutilities are 2x higher for less usage. They wont go down. Supply chain issues\nhas turned into a blanket bs statement in most cases. I’m…",
  "data/reddit-ask/r/NoStupidQuestions/comments/ta8ivm/why_doesnt_biden_ask_all_employees_who_are_able.json": "Isn’t what caused the major drop in gas prices the lack of demand during the\npandemic? If Biden asked, voluntarily of course, for as many businesses as are\nable to have their employees work from home, wouldn’t that lower gas prices?\nMany companies already have experience with their employees…",
  "data/reddit-ask/r/NoStupidQuestions/comments/taaoag/when_does_the_again_part_of_the_phrase_make.json": "Honest question.\n\nWhat time period precisely was America “great” during that certain individuals\nwant to go back to, which is exemplified with the “again” part?",
  "data/reddit-ask/r/AskWomen/comments/taa7ft/what_do_you_do_when_youre_too_tired_to_cook_but.json": "Especially if you’re living on your own.",
  "data/reddit-ask/r/askscience/comments/ta728d/why_do_places_with_very_ariddeserted_conditions.json": "I know there are loads of other places that produce oil, but a very large amount\nseems to come from specifically deserted or freezing places that don’t easily\nsupport a whole lot of vegetation or animal life. Why is that?",
  "data/reddit-ask/r/AskHistorians/comments/ta4u7j/when_did_english_monarchs_become_less_powerful.json": "So for example, Queen Victoria (as far as I understand), had about the same\namount of influence as Queen Elizabeth (present-day) within her native\ncountry/empire - relatively little, if any at all.\n\nI refer to political power in practice; I understand that on paper the Queen\nstill has quite a bit…",
  "data/reddit-ask/r/NoStupidQuestions/comments/tagsnc/why_doesnt_the_us_irs_just_tell_us_what_we_owe.json": "Why do we have to file our taxes to see what they owe us or we owe them? Why\ncan’t they just tell us, if they already know? Why don’t they just take the\nproper amount in the first place? I find this very frustrating and haven’t found\nanyone who has an answer that I can wrap my head around.",
  "data/reddit-ask/r/NoStupidQuestions/comments/tabf24/was_al_bundy_being_able_to_afford_an_entire_house.json": "This question is mainly for people who were alive during this era and who were\nold enough to understand finances and the housing market. And this is in\nreference to the TV show “Married…with Children”\n\nWas this ever a thing? Obviously the idea of a single income supporting a family\nof 4 and a house…",
  "data/reddit-ask/r/AskHistorians/comments/ta6g2t/how_did_japanese_culture_become_so_deeply.json": "Pretty much everybody has an idea of what ninjas, samurai, geisha, origami,\nbonsai and sumo wrestling are and may also be familiar with Japanese pop\nculture, i.e. anime, video games and characters like Astro Boy, Godzilla,\nPikachu, etc.\n\nMeanwhile, when you ask people about China, they probably…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/taqzq8/can_a_relationship_survive_cheating.json": "I recently found out my boyfriend of 10 years has been cheating on me for about\na month. I just don’t know what to do. I thought we were going to get engaged\nsoon. He is the only person I have ever romantically loved. He is the only\nperson I have ever been with physically. I have been with him…"
}