{
  "data/reddit-stocks/r/stocks/comments/vot0x0/former_apple_lawyer_admits_to_insider_trading.json": "APPLE'S GUY IN CHARGE OF STOPPING INSIDER TRADING GUILTY OF … INSIDER TRADING\n\nOne of Apple's most senior legal executives, whom the iGiant trusted to prevent\ninsider trading, has admitted to insider trading.\n\nGene Levoff pleaded guilty to six counts of security fraud stemming from a\nFebruary 2019…",
  "data/reddit-stocks/r/investing/comments/voz0mi/exclusive_meta_slashes_hiring_plans_girds_for.json": "https://www.reuters.com/technology/exclusive-meta-girds-fierce-headwinds-slower-growth-second-half-memo-2022-06-30/\n\nJune 30 (Reuters) - Facebook-owner Meta Platforms Inc (META.O)\n[https://www.reuters.com/companies/META.O] has cut plans to hire engineers by at\nleast 30% this year, CEO Mark…",
  "data/reddit-stocks/r/stocks/comments/vowex5/eurozone_preliminary_inflation_soars_86_yoy_in.json": "The annualized Eurozone Harmonised Index of Consumer Prices\n[https://www.fxstreet.com/economic-calendar/event/54334a3a-4347-40bc-8755-78f6f4ae4b9a?timezoneOffset=0] (HICP)\nsurged by 8.6% in June vs. the previous reading of 8.1%, the latest data\npublished by Eurostat showed on Friday. The market…",
  "data/reddit-stocks/r/Bogleheads/comments/voy0li/serious_question_what_happens_to_vti_if_the_us.json": "I’m not American but most of my holdings are with VTI.\n\nLooking from the outside in, it seems there’s a very hard political line in the\nmiddle getting harder by the month.\n\nI don’t think it’s unreasonable to say something similar to the USSR split may\nhappen to the US in the coming decades and if…",
  "data/reddit-stocks/r/stocks/comments/vozsz4/the_chip_boom_likely_over_as_micron_says_its_in_a.json": "Full Article\n[https://www.msn.com/en-us/money/companies/the-chip-boom-likely-over-as-micron-says-it-s-in-a-downturn/ar-AAZ3D1z?cvid=52b2caf1274346a2897195fbf51af60d]\n\n“PC unit sales [are] now expected to decline by nearly 10% year over year from\nthe very strong unit sales in calendar 2021,”…",
  "data/reddit-stocks/r/Bogleheads/comments/vozu1j/saving_for_a_home.json": "How do Bogleheads approach saving for a downpayment? Is keeping it in cash the\ndefault?\n\nI live in a VHCOL city, and my partner and I want to buy our first home in the\nnext 5 years. We expect to spend around $900,000 to $1.2M for a two-bedroom\napartment in our area. As a result, we're looking at a…",
  "data/reddit-stocks/r/stocks/comments/vopc6g/what_the_bond_market_is_telling_us.json": "Hello everybody, my understanding about bond yields is pretty basic so please\nfeel free to correct if I am saying anything wrong.\nThe federal reserve has started quantitative tightening , selling about 95\nbillions in bonds and mortgage-back securities every month.\nAfter one month, especially…",
  "data/reddit-stocks/r/Bogleheads/comments/vozg7x/what_are_the_main_downsides_to_etf_broad_index.json": "Hi guys\n\nI’ve been holding a index portfolio (good ol VTI/VXUS) and it’s been performing\nwell (other than this year lol).\n\nI have been reading some Bloomberg articles (I’ll link later) where analysts\nhypothesise the next decade might be dearth for broad investing given the\nparallel shift in…",
  "data/reddit-stocks/r/wallstreetbets/comments/vowl9x/the_lore_of_tsla_short_now_or_die_trying.json": "https://preview.redd.it/tnnto4xlax891.png?width=1246&format=png&auto=webp&s=122c4ee824c2cab0ade365c77a1966365ed3c64e\n\nListen Up,\n\nI hate to interrupt while you are planning your wife's and her boyfriend's\nromantic getaway for the Independence Day weekend. With you sitting alone at\nhome priced in,…",
  "data/reddit-stocks/r/stocks/comments/votd8z/article_from_2010_about_options_how_steve_jobs.json": "This article is from 2010, but i thought options traders would find this\ninteresting;\n\nApple CEO Steve Jobs owns about $2.5 billion worth of Apple stock. But he would\nown about $13 billion worth of Apple stock if it weren't for a huge mistake he\nmade back in 2003, MarketWatch's Brett Arends…",
  "data/reddit-stocks/r/stocks/comments/vp29pg/do_you_think_energy_stocks_are_still_a_good_buy.json": "Energy stocks are the best bet in the market right now, says JPMorgan. JPMorgan\nis once again pounding the table on energy stocks. The sector has been\nJPMorgan's highest-conviction overweight since late 2020, and following the\nrecent and sharp pullback, the firm said now's the time to buy.\n\nRead…",
  "data/reddit-stocks/r/investing/comments/vp5yxc/bofa_analyst_sees_tesla_market_share_of_evs.json": "https://www.motortrend.com/news/tesla-general-motors-ford-shares-analysis-car-wars/\n\n> Tesla has held about 70 percent of the EV market share in recent years. That\n> is forecast to drop to a mere 11 percent over the next four years, says John\n> Murphy, the Bank of America analyst behind the annual…",
  "data/reddit-stocks/r/stocks/comments/vp7898/down_over_45_on_over_100_shares_of_nvdia_should_i.json": "As the title states, I am down a lot on my NVDIA position. Probably the most I\nhave ever been on a stock :( Got in at 247, now down over a hundred dollars a\nshare, though, I have done some cc so brought the cost basis down a bit.\n\nPeople always say, watch it and always have a price you will get…",
  "data/reddit-stocks/r/investing/comments/vp0ndl/not_since_1788_the_year_before_the_founding_of.json": "https://www.bloomberg.com/news/articles/2022-06-22/deutsche-bank-looks-back-three-centuries-for-parallel-to-us-rout\n\nBy Alice Gledhill June 22, 2022 at 10:16 AM EDT\n\nThe strategists cited an unconventional index from Global Financial Data, which\nstrings together centuries of returns using proxies…",
  "data/reddit-stocks/r/stocks/comments/vp6hzs/semi_stocks_crashing_buying_opportunity.json": "Which semi stocks you guys planning to buy at current levels?? Must have strong\nfinancials, reasonable valuations , and good future growth prospects.\n\nI like: $TXN $AMAT $LRCX $KLAC $ INTC $QCOM $MU $QRVO",
  "data/reddit-stocks/r/stocks/comments/vpas29/how_long_do_you_personally_think_the_bear_market.json": "So I've been crashing since November with my portfolio encompassing my 60k net\nworth at age 28... I'm now down 55-60% and am wondering how long you guys think\nthis hell will last? I continue to average down because I believe in my high\ngrowth/speculative portfolio but how low will we go? In the…",
  "data/reddit-stocks/r/stocks/comments/vpbh1m/global_oil_prices_could_reach_a_stratospheric_380.json": "(Bloomberg) -- Global oil prices could reach a “stratospheric” $380 a barrel if\nUS and European penalties prompt Russia to inflict retaliatory crude-output\ncuts, JPMorgan Chase & Co. analysts warned.\n\nThe Group of Seven nations are hammering out a complicated mechanism to cap the\nprice fetched by…",
  "data/reddit-stocks/r/stocks/comments/vpequa/im_not_a_doomer_just_realistic_this_isnt_a_crash.json": "if you hear anybody say \"stocks have been crashing!!\", they're uninformed. 2020\nwas a stock market crash. 2022 is a bear market. there's a difference. it may be\na crash for some people when the S&P 500 is down 20% and their portfolio is down\n40-70%, or even 80%+, but this is just with very…",
  "data/reddit-stocks/r/stocks/comments/vpjt46/i_invested_a_huge_chunk_of_my_savings_at_the.json": "From Oct 2021 to May 2022, I dumped $100,000 into an etrade account. I had been\nresearching stocks for months and I was finally ready to jump in and start\ninvesting. I bought stocks, etfs, and a balanced mutual fund. I immediately lost\nclose to $20,000, because right after I bought everything, it…",
  "data/reddit-stocks/r/stocks/comments/vpplnw/whats_going_on_with_blue_apron_the_dying_company.json": "Blue Apron was started in 2010 as America's most aggressive \"meal kit\" startup.\nHowever, because of increased competition, especially by German firm Hello\nFresh, the company continually lost market share. In 2017, the company was value\npeaked at $1.77 billion. Today, the company sits at a valuation…",
  "data/reddit-stocks/r/stocks/comments/vpu59a/warren_and_charlie_always_talk_about_producing.json": "Look, I love listening to Warren and Charlie, but it's still a fair question.\n\nOne time I watched a video with Warren explaining the ideal former owner of one\nof his holdings. It was to the effect that the person would work super hard, not\nask to be well-compensated, and be happy the profits are…",
  "data/reddit-stocks/r/investing/comments/vpplfa/the_capital_city_is_growing_and_expected_to.json": "Hi all, so in my country the capital city is targeting to triple the population\nin the coming years and yes “I can see it happening” in a fast base.\n\nI would like to take the opportunity and start investing in the stock market for\na long term.\n\nImagine a small city is growing, what do you think…",
  "data/reddit-stocks/r/investing/comments/vps73v/company_does_not_match_anything_on_401k_401k_vs.json": "I know it’s unbelievable in todays world but my company matches absolutely\nnothing to my 401k. My husbands company has a pension and a 401k match. I just\nwant something for myself for “just in case”. Should I even invest in it or\nshould I just open my own Roth IRA. I make about $55k/year and…",
  "data/reddit-stocks/r/stocks/comments/vq33ui/tesla_ev_deliveries_fall_nearly_18_in_second.json": "https://techcrunch.com/2022/07/02/tesla-ev-deliveries-fall-nearly-18-in-second-quarter-following-china-factory-shutdown/\n\nTesla delivered 254,695 electric vehicles globally in the second quarter, a\nnearly 18% drop from the previous period as supply chain constraints, China’s\nextended COVID-19…",
  "data/reddit-stocks/r/investing/comments/vpz508/you_cant_beat_the_market.json": "So the neverending unsolicited advice from basically everyone that invests in\nthe markets instead of trading in the market is \"You can't beat the market!\" or\n\"Statistically it's almost impossible to do better than the market YoY.\"\n\nIf this is true, then what's the point of investing? Trading…",
  "data/reddit-stocks/r/stocks/comments/vq6ua2/here_are_some_stocks_im_strongly_considering.json": "$JPM: One of the best bank with now reasonably low P/E and respectable 3.5%\ndividend.\n\n$MFC: Manulife is a huge Canadian insurance and investments service provider.\nP/E is now 4.67 with a 5.80% dividend.\n\n$MPW: Medical properties trust. This is a bet on healthcare real estate. 8.3 P/E\nwith a…",
  "data/reddit-stocks/r/Bogleheads/comments/vpxlub/value_of_ibonds_as_a_young_investor.json": "Is there any value in holding I bonds for retirement as someone more than 40\nyears away from retirement? I'm considering using them for some short term\nsavings goals but dont want to miss out if I should keep them in my IRA.",
  "data/reddit-stocks/r/stocks/comments/vq4kfk/thoughts_on_tesla_q2_delivery_number_came_in_just.json": "Any thoughts on Tesla? Q2 delivery number came in just over 250k, missed\nestimate by about 6k, and well under the previous record of 300k+. It’s still\nover 20% higher YoY. Now, I am surprised by the number being that high, it’s\nbiggest output, the Shanghai factory, was in limbo for more than half…",
  "data/reddit-stocks/r/investing/comments/vq5swm/anyone_know_anything_about_inherited_margin.json": "So my father passed away back in February and he had an account with Merrill\nLynch that had around $1,000,000 worth of stocks in it with half of it being\nmargin, we still aren’t allowed to access it and I’m pretty sure it’s damn near\n$0 now since it had $130,000 of coinbase which is now 1/4 of what…",
  "data/reddit-stocks/r/investing/comments/vqhv5e/meta_is_pulling_the_plug_on_its_failed_crypto.json": "https://fortune.com/2022/07/01/meta-novi-crypto-payments-wallet-end-september-2022/\n\nThe remainder of the cryptocurrency project that Meta Platforms Inc.’s Founder\nMark Zuckerberg took a beating over from Congress is officially shutting down.\nMeta’s Novi pilot—a money-transfer service using the…",
  "data/reddit-stocks/r/investing/comments/vqidaz/kellogs_motivation_to_split_into_3_companies.json": "I'm wondering if anyone knows what would be Kellogg's motivation for splitting\ntheir company into 3 independant companies. Usually it seems companies acquire\nand merge with other companies and it seems more rare what Kellogg's is doing.\n\nThe Kellogg's CEO claims each division of the company is…",
  "data/reddit-stocks/r/stocks/comments/vqdwqt/how_will_crypto_tanking_and_ethereum_moving_away.json": "Now that mining is all but dead how badly will this affect nvidia's stock price?\nDemand should be lower, profits should be lower, etc\n\nPersonally I think Nvidia will be lucky to ever reach their ath again, but\nadmittedly I don't know all their details.\n\nWhat do you think happens to their price in…",
  "data/reddit-stocks/r/investing/comments/vqljwe/meta_is_pulling_the_plug_on_its_failed_crypto.json": "https://fortune.com/2022/07/01/meta-novi-crypto-payments-wallet-end-september-2022/\n\nThe remainder of the cryptocurrency project that Meta Platforms Inc.’s Founder\nMark Zuckerberg took a beating over from Congress is officially shutting down.\nMeta’s Novi pilot—a money-transfer service using the…",
  "data/reddit-stocks/r/stocks/comments/vqqjjw/i_bought_aapl_at_175_nvda_at_290_msft_at_329.json": "I went heavy into the ARKK and high flier tech stocks that were popular in\nJan-Feb 2021. You probably know the names if you browsed reddit in that time\nsome of them were SHOP, NET, PLTR, SQ, and SOFI. Lost 60% of my capital on\nthose. And decided to sell all of them on the last trading day of 2021.…",
  "data/reddit-stocks/r/wallstreetbets/comments/vqk7b0/short_tinder_mtch_for_being_a_terrible_app.json": "So I downloaded tinder last week because I’m graduated from college and going to\nbe in my hometown for a while. I figured may as well try the dating app again. I\neven bought the $8 unlimited swipes to try and help boost my chances of talking\nto women.\n\nI got one match and she never responded after…",
  "data/reddit-stocks/r/stocks/comments/vqqysl/why_are_a_lot_of_investors_not_buying_small_cap.json": "I see a lot of $100 MM to $2 billion market cap stocks that are reputable and at\ngood valuation buy points. In 2021 these stocks performed great, but the last 9\nmonths or so they crashed and no bounce. Why is that?",
  "data/reddit-stocks/r/stocks/comments/vqqhnn/jeff_bezos_lashes_out_at_biden_over_call_for.json": "Why does Jeff think Biden has a misunderstanding of basic market dynamics?\n\n\n\n--------------------------------------------\n\n(Bloomberg) -- Amazon.com Inc. founder Jeff Bezos criticized a tweet from US\nPresident Joe Biden calling for oil executives to reduce gasoline prices. \n\nBezos was responding…",
  "data/reddit-stocks/r/Bogleheads/comments/vqfgqj/is_investing_8k10k_at_22_too_aggressive.json": "I've been investing for the last few years since 2019 and I've been investing\naggressively, or at least I think so. I hear a lot about how people are\ninvesting 40k a year and I thought 8k-10k was a lot...\n\nI worry I'm investing a bit too much and that I should pursue life more I guess?\nlike, I'm…",
  "data/reddit-stocks/r/Bogleheads/comments/vqve91/treasury_direct_authorization_form_approval_times.json": "Hello,\n\nI have prepared and sent my FS 5444 form to TD on Jun 9, 2022, and I am yet to\nreceive any communication regarding this. The did not sent reception mail to me\nyet. How long does it take to process this? Does anyone have recent experience?",
  "data/reddit-stocks/r/Bogleheads/comments/vqpba6/new_employer_only_offers_a_traditional_401k.json": "Hello, I will be switching jobs in the near future and the employer I'm moving\nto only offers a traditional 401k with a 5% match. At my current employer I have\na roth 401k with about 70k in it. My understanding is I cannot roll the roth\n401k into the traditional. I'm curious what my best play here…",
  "data/reddit-stocks/r/stocks/comments/vqts7h/buy_qqq_now.json": "Do you guys think it is a good time to buy qqq with it being down almost 30\npercent YTD given that it has a 100 percent return over 5 years? Or do you think\nit is better to wait to see if the market falls further/ invest in another ETF\nor holding company?",
  "data/reddit-stocks/r/wallstreetbets/comments/vr0v8k/i_hate_you_all.json": "FYI I’m 3 u/ deep. Every time I come back here it’s worse. Anyone that actually\ncared about this sub would take a gander at what it looked like pre-GME and STFU\nbecause you all sound literally retarded, like literally. Even the memes don’t\nmake sense. You know those really awkward people where you…",
  "data/reddit-stocks/r/Bogleheads/comments/vr04cc/eu_question.json": "Most bogleheads forums are heavily leaning towards the us market and us tax\nsituation. I wonder if there is a resource explaining these things by a EU-based\nperson perspective. I've done some research and found two major differences: 1.\nOne should buy EU-domicicled funds instead of the US-based…",
  "data/reddit-stocks/r/Bogleheads/comments/vqo4fu/in_the_current_market_which_is_better_to.json": "I have just established a self-employment 401k. I hadn't been contributing much\nto retirement this year (besides IRA) but am starting again now. I have not\nmaxed out my I Bonds yet. 401k investment would be mostly in VTSAX. Is maxing\nout I Bonds a fairly safe idea? I realize this is like asking to…",
  "data/reddit-stocks/r/stocks/comments/vr9iy6/former_us_treasury_secretary_larry_summers_says.json": "Former Treasury Secretary Lawrence Summers said that there’s an increasing risk\nthe looming recession he’s anticipated will start sooner, in 2022, and that\ninflation may cool as a result.\n\n“The risks of a 2022 recession are significantly higher than I would have judged\nsix or nine weeks ago,”…",
  "data/reddit-stocks/r/investing/comments/vr52oi/chinese_real_estate_crisis_real_or_not.json": "https://www.cnn.com/2022/07/04/economy/chinese-developer-shimao-default-intl-hnk/index.html\n\nAnother Chinese real estate investment missed payment. So just how bad is this.\nI mean, evergrande seem to have fall out of news for no reason.\n\nPeople have been predicting Chinese real estate collapse for…",
  "data/reddit-stocks/r/stocks/comments/vrbuxb/traditional_value_stocks_are_arguably_some_of_the.json": "Title. I’ve seen too many people in here flood into traditionally “safe”\ncompanies as they have weathered the recent volatility. I’m here to tell you\nthat the risk/reward on these companies is terrible, and even under optimistic\nassumptions you are guaranteeing subpar returns. I’m specifically…",
  "data/reddit-stocks/r/wallstreetbets/comments/vrbwxm/the_housing_market_will_collapse.json": "https://preview.redd.it/7jahgbbt7k991.png?width=1160&format=png&auto=webp&s=559a832e22a9c64071694eddaea3fc5c26f5a5e4\n\nAfter the median home price has risen at the fastest pace ever for the last two\nyears, there is no surprise a bubble…",
  "data/reddit-stocks/r/stocks/comments/vrd088/looking_at_sas_airline_how_can_they_even_exist.json": "Negative cash flow for years, current liabilities double current assets, long\nterm debt is massive and they recently devalued the stock by issuing tons of new\nshares. How is this able to stay in business?",
  "data/reddit-stocks/r/stocks/comments/vrdymq/thinking_about_cashing_out_for_down_payment_on_my.json": "I’m down 4000 dollars on an 11000 dollar investment because of the market crisis\nbut thinking about cashing out the remaining 7k to buy an apartment. Yes I will\nbe selling for a loss but it will make me stop paying rent and therefore\nminimise living expenses. Since the housing market in Sweden went…",
  "data/reddit-stocks/r/investing/comments/vrgix1/sell_the_rally_instead_of_buy_the_dip_after_musk.json": "In case you still somehow doubt things will get alot worse in coming months,\nafter Musk also Zuckerberg issues dire conomic warning to employees.\n\nMark Zuckerberg has issued a chilling message to Meta Platforms Inc. employees:\nThe company faces one of the “worst downturns that we’ve seen in…",
  "data/reddit-stocks/r/Bogleheads/comments/vr0lp0/401k_alternatives.json": "My employer offers a 401(k) but it's pretty bad--the TDF they auto-enrolled me\nin is something like 1.15% ER, and everything else is not much better.\n\nAre there any similar non-IRA alternatives that I can make use of in lieu of the\nhorrible 401(k)? (They don't offer a self-directed, either)",
  "data/reddit-stocks/r/stocks/comments/vrke4k/take_a_look_at_the_upcoming_big_macro_events_that.json": " 1. On July 13th we are gonna get the Inflation CPI numbers from the US and as\n    we have seen the last time they were over mostly over predictions and\n    actually increased in the midst of rate hikes, so markets tanked heavily.\n    Right now they are expected to be about 8.5%, anything above…",
  "data/reddit-stocks/r/stocks/comments/vrkanu/best_and_worst_stocks_to_hold_during_a_recession.json": "What are your ideas of good and bad stocks to hold during a recession?\n\nI want to trade some of the cash I'm holding for stock in companies/industries\nthat will be able to weather a downturn and come out stronger on the other side.\nThe only thing I'm looking at right now is energy, but I'm worried…",
  "data/reddit-stocks/r/wallstreetbets/comments/vr86l6/do_you_agree_that_the_sp_500_spy_might_bottom_out.json": "Michael Burry, the founder of Scion Asset Management who was made famous by\nChristian Bale in the movie “The Big Short,” said on Twitter that the first half\ndeclines in equity markets this year were “multiple compression” and following\nthis will be earnings…",
  "data/reddit-stocks/r/Bogleheads/comments/vri22y/two_fund_portfolio_7030_vtivxus.json": "I've been researching for quite a bit on what to add to my portfolio as I just\nopened my custodial account and am new to investing. I'm currently 16 years old\nand want to invest for the long term and have been thinking about doing a two\nfund 70/30 VTI/VXUS split. I currently have 500 dollars in my…",
  "data/reddit-stocks/r/investing/comments/vrnmre/us_moving_overseas_soon_what_should_i_do_with_my.json": "Currently in my 30's (single) in the US. My career is taking me overseas (APAC)\nand while I may not need a lump sum immediately (i.e. < 1 year), I do want to\nmake sure my money (approx. $400k in cash) isn't locked in case I do need access\nto it for buying a house, etc. At the same time, I don't…",
  "data/reddit-stocks/r/wallstreetbets/comments/vrp4do/the_financial_crisis_in_the_united_states_is.json": "Whether you agree with what I said, I hope you have the patience to read all\nthis article I wrote. I think the financial crisis in the United States may be\nsimmering and preparing to break out. Compared with inflation in the United\nStates and the Fed's shrinking balance sheet. I'm more concerned…",
  "data/reddit-stocks/r/Bogleheads/comments/vrnqqq/to_the_older_bogleheads_how_did_you_manage_the.json": "I sight the charts and they are terrifying.. Did you stay the course? ⠀Did you\nbuy the dip? Did you panic sell? What did you do?",
  "data/reddit-stocks/r/stocks/comments/vrez0i/sprouts_farmers_market_can_a_boring_company_can.json": "Sprouts Farmers Market ($SFM) is quite a boring company. However, boring\ncompanies can turn out to be great investments. Is SFM one of them?\n\nThe goal of this post is to analyze the company's fundamentals and provide\ninsights into the business fundamentals, financials as well as valuation.…",
  "data/reddit-stocks/r/stocks/comments/vrta62/why_havent_cruise_companies_recovered_in_terms_of.json": "Carnival's revenue is down 71% since the pandemic.\n\nRoyal Caribbean revenue is down 77% since the pandemic.\n\nMeanwhile, every other travel company is hot hot hot because there is a pent-up\ndemand for traveling.\n\nBookings Holdings revenue is down just 12% since the pandemic.\n\nAirbnb says their…",
  "data/reddit-stocks/r/Bogleheads/comments/vrs8d6/since_december_2006_vxus_is_flat_in_real_terms.json": "I was playing around with PV yesterday when I noticed this. Pretty staggering,\nand shows you how much the US has out-performed since the 2008 crisis. The\noft-quoted line is that from 1950-2008, US and Ex-US performance was the same,\nand all the US out-performance has come since then.\n\nWhat does…",
  "data/reddit-stocks/r/Bogleheads/comments/vryl7k/mega_backdoor_roth_after_maxing_out_all_other.json": "I'm maxing out my 401k, and HSA, and also completed my backdoor Roth for this\nyear. I have access to an after-tax 401K. Should I invest money into it instead\nof just investing in taxable accounts?",
  "data/reddit-stocks/r/stocks/comments/vrtywk/timing_the_market.json": "I noticed whenever someone gave a hint of timing the market, it is quickly\ndismissed with comments like \"time in the market....\", \"DCA\" or \"let me take out\nmy crystal ball\". So I want to preface my question by saying \"you don't need to\nbelieve in Jesus to study the bible\". I'm not going to debate…",
  "data/reddit-stocks/r/stocks/comments/vruhtw/can_stocks_truly_stage_a_rally_in_the_second_half.json": "It's easy to look at statistics to see how violently the market has often\nrallied after a historically bad first half. However, a year such as 2008 stands\nout as an example of a year where things simply went from bad to worse, even\nwith the first 6 months already being historically awful. The…",
  "data/reddit-stocks/r/wallstreetbets/comments/vrw5r6/why_is_the_russian_rubel_stronger_than_the_usd_i.json": "Clearly I am a retard. I am on WSB. But I am a bigger retard in currencies. So\nhere is my question. Why is the Russian currency outperforming the USD?\n\nInitially it did what was expected, it crashed, but now it is gaining value. It\nis even stronger than before the war,...\n\nThanks guys, also to…",
  "data/reddit-stocks/r/investing/comments/vs4mpj/whats_the_point_of_investing_in_european_indices.json": "Disclaimer before someone gets outraged: I am European, and I'm not hating, but\njust confused.\n\nQuestion is in the title. Whenever I look at indices like the S&P 500, the DAX\n30 and the CAC 40, it seems like European indices always mirror the losses of\nthe US counterparts, but only ever have a…",
  "data/reddit-stocks/r/stocks/comments/vrtx5w/rstocks_daily_discussion_technicals_tuesday_jul.json": "This is the daily discussion, so anything stocks related is fine, but the theme\nfor today is on technical analysis (TA), but if TA is not your thing then just\nignore the theme and/or post your arguments against TA…",
  "data/reddit-stocks/r/investing/comments/vs1vws/form_s3_issue_of_shelf_offerings.json": "I came across a company today that recently filed Form S-3. I read into it and\nbelieve I understand what that entails. Essentially it allows the company to\nissue stock within a given period whenever they choose, dependent on market\nconditions.\n\nWhat are some of the reasons a company would do this?…",
  "data/reddit-stocks/r/stocks/comments/vs8ubw/what_if_i_bought_google_stocks_after_july_1_and.json": "“Each shareholder at the close of business on July 1 will receive, on July 15,\n19 additional shares for each share of the same class of stock they own.”\n\nNot sure what this means. Would I not benefit from the stock split if I bought\nmy stocks after July 1 and before July…",
  "data/reddit-stocks/r/stocks/comments/vrz6kp/does_anyone_like_ford_f_or_us_steel_x.json": "Both of them are near multi year lows, both have average estimates well above\ncurrent prices, both have extremely low PE's. I realize the headwinds with raw\nmaterial prices, fuel prices, etc, but both seem to be established, top tier\nproducers in their fields.",
  "data/reddit-stocks/r/stocks/comments/vsc6gr/thoughts_on_blackberry_bb.json": "Good day to you all. This is my first post here. I have been lurking for over a\nyear trying to learn the basic principles of the market and have learned a lot\nfrom the people kind enough to share their wisdom here.\n\nI raise this post to talk about Blackberry, the previously failed phone…",
  "data/reddit-stocks/r/investing/comments/vsh8gw/average_inflation_expectations_are_falling_off_a.json": "Breakeven inflation rates are falling off a literal cliff back down to our usual\nand persistent low inflationary environment. If we assume that this and next\nyear will average ~6% annualized inflation, then by 2025, we could theoretically\nface lower inflation than 2018. This is a sudden return to…",
  "data/reddit-stocks/r/investing/comments/vs90m1/invest_350k_monthly_return_required.json": "If you had $350K to invest, but needed a monthly return, what options would you\nconsider in this economy? Real estate seems to be the easy choice, and I'm\nleaning heavily toward a turnkey type setup (yes I'm aware of the pros and cons\nof turn key real estate... I researched on Reddit). I wanted to…",
  "data/reddit-stocks/r/stocks/comments/vsqh9s/sell_spy_and_take_the_loss.json": "I realized about a year ago that I'm an idiot when it comes to stocks (and lots\nof other things), and rather than invest in random individual companies, I'd\njust start putting my money into SPY.\n\nI guess I lucked out, because I would've lost even more money in recent months\nif I'd stuck to my old…",
  "data/reddit-stocks/r/Bogleheads/comments/vsqcdn/no_fractional_shares_on_vanguard_making_it.json": "Hi all. This is a mini vent + advice seeking post.\n\nMy work offers my 401k through vanguard, which has been just fine so far. I’m\npretty hands off on my 401k (100% 2055 TDF) but my Roth I like to be a little\nmore hands on.\n\nI opened the IRA through vanguard as I like having my 401k and IRA in…",
  "data/reddit-stocks/r/investing/comments/vsq47o/yield_curve_inverted_again.json": "Probably not a surprise, but wanted to share this for discussion points. Given,\nthe initial and brief inversion in April 2022 garnered most of the attention,\nbut I personally think this one will get a bit deeper unless the Fed immediately\nwalks back some rhetoric. Keep in mind, the inversion in…",
  "data/reddit-stocks/r/Bogleheads/comments/vspqui/investment_strategy_for_1_yo_daughter.json": "Like title states, I am trying to set my daughter up for success/decent nest egg\nwhen she turns of age or needs it. I currently am putting away $150/month into a\nvanguard account. My current plan was just to focus on VFIAX, but after\ndiscovering this sub, might want to rethink that. I currently…",
  "data/reddit-stocks/r/stocks/comments/vszd6k/gamestop_announces_fourforone_stock_split.json": "Source:\nhttps://www.reuters.com/markets/us/gamestop-announces-four-for-one-stock-split-2022-07-06/\n\nJuly 6 (Reuters) - GameStop Corp (GME.N) said on Wednesday its board has\napproved and declared a four-for-one split of the video game retailer's class A\ncommon…",
  "data/reddit-stocks/r/investing/comments/vst23n/us_job_openings_slip_but_employment_remains_to_be.json": "By CHRISTOPHER RUGABER, AP Economics Writer\n\nEmployers posted 11.3 million job openings at the end of May, the Labor\nDepartment said Wednesday [https://www.bls.gov/news.release/pdf/jolts.pdf], down\nfrom nearly 11.7 million in April. Job openings reached 11.9 million in March,\nthe highest level on…",
  "data/reddit-stocks/r/wallstreetbets/comments/vszfxl/gamestop_announces_fourforone_stock_split.json": "GAMESTOP CORP SAYS TRADING WILL BEGIN ON A STOCK SPLIT-ADJUSTED BASIS ON JULY\n22, 2022\n\n\n\nGAMESTOP UP 5.2% IN EXTENDED TRADE AFTER CO ANNOUNCES STOCK SPLIT\n\n\n\nGAMESTOP UP 5.2% IN EXTENDED TRADE AFTER CO ANNOUNCES STOCK…",
  "data/reddit-stocks/r/investing/comments/vt0kre/gamestop_board_approves_stock_split_plan_shares.json": "https://www.reuters.com/markets/us/gamestop-announces-four-for-one-stock-split-2022-07-06/\n\nJuly 6 (Reuters) - GameStop Corp (GME.N)\n[https://www.reuters.com/companies/GME.N] said on Wednesday its board has\napproved a four-for-one stock split, sending the video game retailer's shares up\nmore than…",
  "data/reddit-stocks/r/wallstreetbets/comments/vszh7m/gme_stock_split_incoming.json": "Here you go boys and girls!!\n\n\n\nSource:\nhttps://www.sec.gov/Archives/edgar/data/0001326380/000132638022000100/a991-stocksplitannouncement.htm\n\n\n\nMy 6 shares will now become 24, LET'S GO!!!!",
  "data/reddit-stocks/r/investing/comments/vsuz7p/help_me_understand_my_dads_bond_portfolio.json": "My dad opened a $1 million IRA account back in October of 2017. He invested the\nmoney purely in corporate bonds, keeping the maturity of the bonds short at\naround 1-3 years. Whenever a bond matures, he will reinvest the proceeds in the\nsame rolling maturity profile. He's been buying bonds in the…",
  "data/reddit-stocks/r/wallstreetbets/comments/vt1l1z/41_stock_split_gme_retail_shorts_can_suck_my_nuts.json": "Hey Mods, sticky this one :-^\n\nSource, Barron's and twitter\n\nI want all the gme hate in the comments please, you're fuel to my fire.\n\nLFG",
  "data/reddit-stocks/r/investing/comments/vt44ns/why_doesnt_the_fed_just_say_fuck_it_and_hike.json": "If a recession is coming why not do this, tame inflation and get it over with.\nThe sooner the recession comes, the sooner we can start the recovery. It feels\nlike hiking it little by little just prolongs an already painful process.\nEspecially since many economist and bankers believe that the…",
  "data/reddit-stocks/r/Bogleheads/comments/vt9w4b/feeling_stupid_maintaining_40_vxus_while_vti_has.json": "Is the 60:40 allocation collected valid? or should be‍ adjusted intelligently",
  "data/reddit-stocks/r/wallstreetbets/comments/vt9eg9/correction_gme_stock_dividend_incoming.json": "Wny are there three posts at the top of hot saying $GME is having a 4:1 stock\nsplit when it isn't having a stock split at all?\n\nSeriously. $GME is not doing a stock split. It is issuing a *STOCK DIVIDEND*.\nThere is a difference!\n\nStock Split:\n\nAll shares in all accounts holding $GME are cut in…",
  "data/reddit-stocks/r/Bogleheads/comments/vthng8/feeling_stupid_for_holding_vti_while_tsla_has.json": "This is a bit of a shit post, but what would the members of this sub say to\nsomeone who was thinking this way? How is the argument around holding\ninternational any different than the argument over holding any one very\nsuccessful stock?",
  "data/reddit-stocks/r/stocks/comments/vtk1p9/its_a_ghost_town_in_here.json": "If your Uber driver giving you stock picks is a sign of a market top, perhaps\nthe fact that this sub has emptied out is a sign of a bottom.\n\nPersonally I'm sitting tight, accumulating cash and watching for bases to form\nin stuff I want to buy. I actually picked up some QQQ at the end of last week.",
  "data/reddit-stocks/r/investing/comments/vtk5ya/i_calculated_how_much_a_stock_would_be_worth_from.json": "Lets be realistic here but some stock like AIG or C will probably never reach\nATH again. However there may be some good stocks out there that was caught up in\nthe market; so you can see the glass half full or half empty. If you believe\nthat your favorite stock will get back to its ATH here is how…",
  "data/reddit-stocks/r/stocks/comments/vtkjiw/bloomberg_us_mortgage_rates_plunge_to_53_in.json": "It appears the massive spike we saw in mortgage rates has peaked (temporarily).\nThe market is pricing in a less hawkish a Fed or cooling housing market.\n\nHere are some graphs of the mortgage rates over time\n[https://imgur.com/a/sXLez0C]. The first plot shows a larger historical context,\nwhile the…",
  "data/reddit-stocks/r/investing/comments/vtn31k/us_mortgage_rates_plunge_to_53_in_biggest_drop.json": "From the article\n[https://www.bnnbloomberg.ca/us-mortgage-rates-plunge-to-5-3-in-biggest-drop-since-2008-1.1788989]:\n\n> The average for a 30-year loan fell to 5.3%, the lowest in a month and down\n> from 5.7% last week, Freddie Mac said in a statement Thursday.\n> \n> Buyers are getting a slight…",
  "data/reddit-stocks/r/investing/comments/vttms0/gamestop_fires_its_cfo_and_announces_layoffs_as.json": "GameStop fires its CFO and announces layoffs as part of aggressive turnaround\nplan\n\nhttps://www.cnbc.com/2022/07/07/gamestop-cfo-is-leaving-the-company-retailer-announces-layoffs.html",
  "data/reddit-stocks/r/stocks/comments/vtso3c/gamestop_cfo_is_leaving_the_company_retailer.json": "https://www.cnbc.com/2022/07/07/gamestop-cfo-is-leaving-the-company-retailer-announces-layoffs.html\n\nGameStop said Thursday its Chief Financial Officer, Mike Recupero, is leaving\nthe company and that it will make staff cuts across departments as part of an\neffort to turn around the videogame…"
}