{
  "data/reddit-crypto/r/CryptoCurrency/comments/shh81u/i_see_it_now_most_of_us_are_neither_investors_nor.json": "I had a post last day advising people to be either a trader or an investor and\ngod did it get some crazy reactions! Half of you said we are both. Another half\nwere pissed (don't tell us what to do!). Out of five hundred comments and more ,\nonly a handful understood what I was actually saying.\n\nLet…",
  "data/reddit-crypto/r/CryptoCurrency/comments/shiy2o/is_ethereum_still_worth_the_investment_a_deeper.json": "ETHEREUM\n\n2021 was a fantastic year for crypto, in particular Ethereum. Ethereum reigns as\nthe second-largest blockchain despite the slew of competition from Binance SC,\nSolana, Avalanche. But it remains far ahead showcased by various metrics, and\nthere are no signs of slowing down.\n\nTOTAL…",
  "data/reddit-crypto/r/CryptoCurrency/comments/shomjg/indian_government_announces_it_will_bring_crypto.json": "Indian government just announced that crypto will be taxed at 30% of gains. This\nis the first time the Indian government is discussing crypto taxation. The tax\nwill apply to all gains on digital virtual assets, and no capital losses will be\nallowed. Business expenses will also not be…",
  "data/reddit-crypto/r/CryptoCurrency/comments/shgmmb/bored_apes_have_reached_a_floor_price_well_above.json": "Honestly, I wonder who could have seen it coming. People are spending thousands\nof dollars on Monkey jpegs, and get rewarded for this moronic behavior with\nbetter return rates than almost any other asset can provide. Maybe it's a sign\nthat instead of investing in utility and smart concepts, people…",
  "data/reddit-crypto/r/CryptoCurrency/comments/shq9na/ill_admit_it_i_didnt_trust_you_guys_about.json": "Last few days, I've been playing around on Algorand experimenting with a lot of\nstuff. AND I LOVE IT. Silvio Micali really knows his stuff. This network is an\nabsolute rocket and costs nothing.\n\nAmong other things I also tried the \"famous\" NFT on Algorand. What a crazy\nthing. It costs close to…",
  "data/reddit-crypto/r/CryptoCurrency/comments/shqevq/creators_of_nft_project_doodled_dragons_promised.json": "A Solsea-verified NFT project on the Solana Blockchain, Doodled Dragons\nannounced that they would distribute all profits \"straight to charities\nprotecting animals on the brink of extinction\".\n\nThey announced on Twitter that they would be donating $30k, \"our first donation\nto the World Wildlife…",
  "data/reddit-crypto/r/Bitcoin/comments/shnu7k/economics_professor_asked_whats_the_point_of.json": "Today at my university class, the professor asked “whats the point of bitcoin?”\nThe room was somewhat silent, then some responses about it being purely for\nspeculation pop corned around the room. I sat in silence while he proceeded to\nslander btc and state multiple points of false information, such…",
  "data/reddit-crypto/r/CryptoCurrency/comments/shw6sa/you_guys_understand_that_el_salvador_wants_13.json": "Two posts are on the front page right now: \"El Salvador angrily rejects IMF call\nto drop Bitcoin use\"\n[https://np.reddit.com/r/CryptoCurrency/comments/she2t3/el_salvador_angrily_rejects_imf_call_to_drop/]\nand El Salvador Treasury Minister Alejandro Zelaya angrily rejects IMF demand to\ndrop Bitcoin…",
  "data/reddit-crypto/r/Bitcoin/comments/shrxge/criticizing_bitcoin_for_its_high_energy_use_is.json": "Bitcoin is energy. Its high energy use is an investment. Bitcoin miners securing\na huge network is a good thing.",
  "data/reddit-crypto/r/CryptoCurrency/comments/si1abt/you_dont_need_to_convince_nor_argue_with_anyone.json": "I’ve seen a lot of opinions thrown out here, whether you should or shouldn’t\ntell your family, friends, neighbours about crypto.\n\nThe general consensus of this subreddit is always: “DCA and HODL!” Yes, the past\nalready proved that it’s one of the best if not the best strategy out there. But\ndo we…",
  "data/reddit-crypto/r/CryptoCurrency/comments/si3m4a/why_you_should_make_xmr_part_of_your_portfolio.json": "I’m sure that a lot of you have heard about Monero (XMR) and that it is\nPrivate/Untraceable [https://imgur.com/a/Skb5L4q] and most commonly used in\n“boating accidents” but there’s more to XMR then just that and it’s potential\nuse cases are solid\n\nA lot of people seem to have this understanding that…"
}