{
  "data/reddit-stocks/r/stocks/comments/rud6aa/tesla_beats_wall_street_expectations_again.json": "<!-- SC_OFF --><div class=\"md\"><p><a\nhref=\"https://ir.tesla.com/press-release/tesla-q4-2021-vehicle-production-deliveries\">Tesla\ndelivers 308k cars in Q4</a>. Giving a total of 936k cars in 2021. </p> <ul>\n<li>308,600 deliveries is a <strong>+27.9%</strong> quarter-over-quarter\ngrowth</li>…",
  "data/reddit-stocks/r/stocks/comments/ruaoux/student_loans_will_not_cause_the_next_crash.json": "<!-- SC_OFF --><div class=\"md\"><p>After writing my old post (Link:<a\nhref=\"https://www.reddit.com/r/stocks/comments/rtdpr6/student_loans_might_cause_the_next_crash/\">https://www.reddit.com/r/stocks/comments/rtdpr6/student_loans_might_cause_the_next_crash/</a>)\nI have done some more research and come…",
  "data/reddit-stocks/r/stocks/comments/rud2bw/tesla_beats_analyst_consensus_deliveries_in_q4.json": "https://ir.tesla.com/press-release/tesla-q4-2021-vehicle-production-deliveries\n\nAnalyst consensus deliveries\n\nBloomberg compiled consensus: 266,000\n\nCompany compiled consensus: 266,183\n\nFactSet compiled consensus: 267,000\n\nHighest analyst estimate: 290,000 (Credit Suisse)\n\nActual deliveries:…",
  "data/reddit-stocks/r/stocks/comments/ru65e5/cash_is_a_position_and_a_bad_one.json": "My person: I am 59 years of age and bought my first security 40 years ago.\n\nI keep reading that cash is a good thing to hold in case the market breaks.\nBonds (except maybe Junk Bonds) are basically the same as cash when looking at\ninflation.\n\nI write this article because it seems that 95% of…",
  "data/reddit-stocks/r/stocks/comments/rudyps/jpmorgan_says_january_effect_will_boost.json": "> Despite raging inflation and warnings from some prominent investors that the\n> stock market is dangerously overheated, JPMorgan still expects a boost from\n> “the January effect.\"\n> \n> The phrase refers to the belief that the market’s best month tends to be the\n> year’s first.\n> \n> This month,…",
  "data/reddit-stocks/r/stocks/comments/rul6na/smaller_boring_companies_that_are_quietly.json": "In One Up on Wall Street, Lynch suggests a strategy of scouting for smaller\ncompanies that do unexciting things very well and quietly expand their reach and\nprofitability as a result. These companies tend to go unnoticed by most\ninvestors, but can reward avid scouts handsomely as the market catches…",
  "data/reddit-stocks/r/stocks/comments/ruqpl8/2022_strategy.json": "Nasdaq gained 26.32% in 2021. S&P gained 26.68% in 2021. VTI gained 23.57% in\n2021.\n\nFor those of you who didn’t beat those numbers what is your strategy for 2022?\n\nI personally spent a lot of time reading/researching and only did 15.58%. I\nthink my 2022 strategy is going to be a lot more of the…",
  "data/reddit-stocks/r/stocks/comments/rus7ml/embattled_china_evergrande_shares_halt_trading.json": "Curious… who would even own Any shares knowing the public info that they have\ndefaulted on debt?\n\nAlso… you think we’ll be red or green on the first trading day of the year?!\n\nEmbattled China Evergrande shares halt trading\n[https://www.reuters.com/markets/europe/china-evergrande-shares-halt-trading…",
  "data/reddit-stocks/r/stocks/comments/rujfir/semiconductors.json": "I've been doing my research on semiconductors and I'm struggling deciding what\nstocks to buy, because there's a lot of competition and I don't understand\nenough about the industry to know the pros and cons of each company.\n\nFrom the \"big boys\", Intel is considerably cheaper, costing about 51$ per…",
  "data/reddit-stocks/r/investing/comments/rujpqr/too_many_people_are_getting_influenced_by.json": "I think most of them are down on short positions or paid by hedge funds to\nspread FUD. The outlook for 2022 is not as good as 2021 but companies are still\ngenerating record earnings. The US economy is growing not contracting(recession)\nso these guys are not basing their predictions on even the most…",
  "data/reddit-stocks/r/investing/comments/rurz0d/evergrande_suspends_shares_in_hong_kong_as_firm.json": "> Crisis-hit Chinese real estate giant Evergrande has suspended trade in its\n> shares on the Hong Kong as investors await news on its restructuring plan.\n> \n> The statement to the stock exchange did not give a reason for the trading\n> halt.\n> \n> Evergrande has more than $300bn (£222bn) of debts and…",
  "data/reddit-stocks/r/investing/comments/rucgh4/2022_tesla_nio_and_lucid_what_to_expect.json": "Source: TheStreetTesla\n\nAfter a rocky 2020 for the entire auto industry, electric vehicle sales\nrebounded in 2021 amid high demand for vehicles and a shortage of actual cars to\nbuy. Tesla, to be fair, never really suffered the way many traditional\nautomakers did. The EV-maker led by CEO Elon Musk…",
  "data/reddit-stocks/r/Bogleheads/comments/ruh4m5/how_can_i_put_6k_in_my_roth_for_2022_already.json": "If the Roth is for post-tax earned income, I certainly haven't earned $6,000\nfrom employment by January 2d, and I don't believe many here have as well.\n\nIn fact, I haven't been paid a single penny for 2022 and won't for another week\nor so. So isn't plunking down the entire $6k this week a form of…",
  "data/reddit-stocks/r/Bogleheads/comments/rukdxn/confused_about_bond_returns.json": "I understand the relationship between yield and prices. Yields move up, prices\ngo down and vice versa. But, if for example, I buy a bond at $100 yielding 5%\nand the price goes up to $105, why is that a negative thing? You can sell your\nbond for more than you bought it for, isn’t that the point of…",
  "data/reddit-stocks/r/Bogleheads/comments/rufiyc/should_i_keep_buying_more_voo.json": "Hello everyone and Happy New Year!\n\nI have a question, back in May 2021 I finally started investing in Index Funds\n(M28), I invested $2,500 into my 2020 Roth IRA an then another ~$4,000 into my\nRoth IRA 2021.\n\nMy current portfolio is 10 VOO and 5 VTI, I started buying VTI and then I\nrealized how…",
  "data/reddit-stocks/r/Bogleheads/comments/ruhgq5/bnd_for_home_savings.json": "Is it crazy to use BND for home savings? Late 20's planning to purchase our\nfirst home in the next 5-7 years with a minimum goal of $100k for the\ndown-payment. We have ~$50k cash in savings for this purpose right now and are\ntrying to determine the best place to keep/add money while we save. At…",
  "data/reddit-stocks/r/Bogleheads/comments/ruedri/if_you_have_15k_in_bank_account_how_much_would.json": "I’ve always been told, you only need emergency money. Well, I want to invest\naggressively since I’m still under 25 years old and live with my parents.\n\nHow would you allocate 15k?\n\nETFs, Stocks, Crypto, Bonds, Savings account..",
  "data/reddit-stocks/r/stocks/comments/ruu8xz/i_want_to_short_the_company_i_used_to_work_for.json": "Left a tech company about 8 months ago for a new one because they offered double\nmy old salary. Ive always had misgivings about the previous company and have\nwanted to short them since I worked there. Obviously couldnt short it when I\nworked there, but is there a period of time that has to pass…",
  "data/reddit-stocks/r/stocks/comments/rv2lhp/feeling_like_a_complete_and_total_idiotshould_i.json": "Hi all- I should have made this post a long time ago...\n\nLast year (around the early stages of the GME debacle) I got more and more into\nbuying/selling stocks. Sadly, I am not cut out for this and made some very poor\nchoices- down about 25% on the year while the rest of the market is up that…",
  "data/reddit-stocks/r/Bogleheads/comments/rv28yo/if_your_lifestyle_matchesor_god_forbid.json": "Not native english speaker. What does this saying actually means?",
  "data/reddit-stocks/r/Bogleheads/comments/ruree7/rbogleheads_what_are_your_thoughts_on_post_flairs.json": "It's been in the back of my mind for a while to add post flairs as a way to\ndistinguish things like questions, articles, links to the forum and so on. So\ntoday, I added some flairs to my own posts and a few others to try it out.\n\nTo be clear: we (mods) don't have any plan to make flairs mandatory…",
  "data/reddit-stocks/r/Bogleheads/comments/rv6jlw/i_feel_really_poor_just_by_reading_other_pplposts.json": "I am in my late 30s living in Munich, Germany, up until now I was living alone\nand recently I started investing in ETFs. So far so good, but my overall net\nworth is about 130K with a bit over 100K in ETF and I am reading constantly\nabout people having a lot bigger savings than mine, even though I…",
  "data/reddit-stocks/r/Bogleheads/comments/ruyp7z/roth_401k_vs_regular_401k.json": "Company started offering Roth 401k. Would it make sense to do Roth than regular?\nI know my tax rate now but have no idea what taxes will be in say 15-20 yrs when\nI will retire. Either way money just goes to index funds in 401 that are being\noffered",
  "data/reddit-stocks/r/stocks/comments/rv92bv/apple_hits_3_trillion_market_cap_becoming_the.json": "https://finance.yahoo.com/news/apple-hits-3-trillion-market-cap-184825195.html\n\n“Apple (AAPL) officially has a market capitalization of $3 trillion. The tech\ngiant passed the $182.86 mark Monday, making it the first publicly traded\ncompany in history to hit such a market valuation. Shares were…",
  "data/reddit-stocks/r/investing/comments/rv62i9/is_it_a_good_idea_to_use_roth_ira_for_swing.json": "Hello!\n\nI’m a 27 year old who just started contributing to a Roth IRA in March of 2021.\nI make enough to max out my Roth every year and save some on the side in an\nindividual brokerage account (currently approx $12K in Roth and $7K in\nindividual with consistent disbursements to individual…",
  "data/reddit-stocks/r/investing/comments/rva43k/avoid_paid_signal_bots_services_esp_rick_rahim.json": "After learning this lesson the hard way, I'm hoping this post will save a few\nother people some money and time.\n\nLast week I paid for a Lifetime Membership to Rick Rahim's ProChartSignals.com\n($1,699). It was supposed to include custom signal indicators, lots of\neducational material, information…",
  "data/reddit-stocks/r/investing/comments/rvc5sz/is_there_any_point_to_a_non_deductible_ira_if_the.json": "Long story short, I’m a high earner who is beyond the limit for a traditional\ndeductible IRA and beyond the limit to contribute directly to a Roth IRA.\n\nThinking ahead to 2023, I’m envisioning a world where the backdoor and mega\nbackdoor Roth options are gone.\n\nThat leaves me with maxing my 401k…",
  "data/reddit-stocks/r/Bogleheads/comments/ruwd8l/why_do_stock_prices_always_grow_long_term.json": "Why do stock prices always go up?? Isn’t the projected future earnings baked\ninto today’s pricing? If yes, what kind of unforeseen things are causing future\nearnings to outpace today’s expectations? And if that’s such a common thing, why\nisn’t that also already baked into the price today? I guess…",
  "data/reddit-stocks/r/stocks/comments/ruypug/rstocks_daily_discussion_monday_jan_03_2022.json": "These daily discussions run from Monday to Friday including during our themed\nposts.\n\nSome helpful links:\n\n * Finviz [https://finviz.com/quote.ashx?t=spy] for charts, fundamentals, and\n   aggregated news on individual stocks\n * Bloomberg market news [https://www.bloomberg.com/markets]\n *…",
  "data/reddit-stocks/r/Bogleheads/comments/rvce0c/beginners_guide.json": "I’m 30 and doing pretty well now maxing out my 401k have a house and I’m\nstarting to get too much money in my bank account that I feel like I’m losing\nmoney for it being there. Is there a step by step guide on safe options? I have\nno clue on what to do and never thought I’d be in the situation I am…",
  "data/reddit-stocks/r/stocks/comments/rv9xso/are_there_any_positions_that_have_sentimental.json": "My grandpa set up an account for me and got me into investing at a young age. It\nwas something he’d always try to teach me more about. He’d explain in basic\nterms by telling me a pretty good company usually has a lot of customers. Yes\nthat’s not always the case but mind you I was like 6 years old,…",
  "data/reddit-stocks/r/stocks/comments/rvcp6o/here_is_a_market_recap_for_today_monday_january_3.json": "PsychoMarket Recap - Monday, January 3, 2022\n\nDisclaimer: There will be no market recap tomorrow since I will be travelling\nback to my home after the holidays.\n\nStocks rose in the first trading session of the year as the three major indexes\ncontinued to hover near record-highs, building on the…",
  "data/reddit-stocks/r/stocks/comments/rvgznt/a_regret_as_an_investor.json": "When I look at what F has done this past year, I think I’ve learned some\nvaluable lessons:\n\n 1. If you believe in a stock and have researched it, stay the course- sold off\n    F when it was $8 and before the Mngmt change!\n\n 2. Think mid to long term and keep emotions out of if it!\n\nDoes anyone else…",
  "data/reddit-stocks/r/investing/comments/rvi2rc/business_wants_to_build_to_suit_on_our_landwhat.json": "Fast food restaurant wants to either purchase 0.6 acre or we build to suit.\n\n1,200 sq. Ft building, they pay for FF&E. They guesstimate a total of $450K to\nbuild. Said they would like to keep initial total investment below $1million.\n\nWould pay us ~$8,000/month(they said low 8’s) for 10 years, then…",
  "data/reddit-stocks/r/Bogleheads/comments/rv472f/is_there_a_simple_way_to_transfer_funds_from_a.json": "The expense ratio is lower on the ETF for some reason, so I don't see why I\nwouldn't own it instead of the index fund. Is there an easy way to transfer my\nmoney from one to another without having to pay taxes on my gains thus far?\nThank you.",
  "data/reddit-stocks/r/Bogleheads/comments/rv0crv/compound_frequency.json": "The concept of compound interest is simple enough but I’m pretty confused on the\neffects of compound frequency. I have also found very little information on how\noften your portfolio on a vanguard managed fund compounds. Could somebody help\nme out with this?",
  "data/reddit-stocks/r/stocks/comments/rvfn4s/new_job_new_pay_what_do_i_do_now.json": "I went from a job that paid 68k to a new job paying 130k. And just like that my\nwife and I are able to save roughly 4-5k a month. We have debt but I am looking\nat investing the money and then paying off debt. I don’t want to put everything\ninto stocks but I think it’s a must now that we have some…",
  "data/reddit-stocks/r/Bogleheads/comments/rvhmon/target_retirement_funds_worse_than_100_equities.json": "Background: I'm a 21-year-old investor.\n\nI'm deciding where to put my money and I think I've got it narrowed down between\na 100% equities fund and a target date fund with the retirement year at 2060. I\nwanted to see which is a better bet.\n\nI've known about FIRECalc since last summer. It's a really…",
  "data/reddit-stocks/r/stocks/comments/rvd0k9/visa_v_vs_paypal_pypl.json": "Why is Visa (V) is a better stock to buy than PayPal (PYPL) right now\n\n(This is also my first stock analysis so please leave some tips on what I can do\nbetter)\n\nI have recently many people comment on the recent sell of in PayPal and visa,\nPayPal being the more drastic dip. This recent dip makes…",
  "data/reddit-stocks/r/stocks/comments/rv7ed6/i_cant_find_anything_i_want_to_invest_in_these.json": "I can’t find any stocks worth buying\n\nI’m at the point where I’d rather sit in cash than buy stocks at this time.\nEvery stock I look at has a P/E of 30-40, and often into the hundreds. I see\nthat PSEC has a less than 4 P/E ratio and pays a great dividend, so that’s\ntempting, but I still see it as…",
  "data/reddit-stocks/r/Bogleheads/comments/rvbz1v/poor_customer_service.json": "Vanguard clearly cannot provide a 5-star level of customer service. I've been\ntrying for 4 days to talk to someone about an RMD in-kind transfer but they just\nkeep me on hold with the same repeating message to find the answers at their\nwebsite. Their Facebook moderator said this is a question that…",
  "data/reddit-stocks/r/Bogleheads/comments/rvcyle/how_do_you_track_your_investments.json": "I started out dumping money into investment accounts years ago with no record\nkeeping beyond account numbers. A few years ago I started to track transactions\nin notepad files but, in hindsight, what I have isn't very helpful. As my\nbalances have grown, my need for accurate tracking has also grown,…",
  "data/reddit-stocks/r/stocks/comments/rv61vc/any_other_frustrated_sofi_investors_out_there.json": "I just noticed the short interest for SOFI ticked up to just over 9%. I\ngenerally stay away from stocks that are near or above 8-10% short. This may be\ndue to the recent extension of the student loan payback moratorium. SOFI is my\nlong term growth play, so Im sitting tight. But if that short…",
  "data/reddit-stocks/r/Bogleheads/comments/rvlij7/whos_actually_invested_in_the_bond_equivalent_of.json": "I love Jack Bogle’s philosophy. I love the Boglehead’s Guide to Investing. But\nit’s tough for me to recommend to a 25 year old that they place 25 percent of\ntheir money in bonds when they have 40 years until retirement. Do you all\nactually do this?",
  "data/reddit-stocks/r/stocks/comments/rvl29n/what_is_your_favorite_stock_going_into_2022.json": "I am timid of TSLA and NVDA, although they seem to be the premiere securities of\nthis time. I am aware of stocks like VISA selling at a discount. COST seems like\na safe investment with ample opportunity. This is the stock I will probably\nbegin to analyze in contrast to companies like Walmart and…",
  "data/reddit-stocks/r/stocks/comments/rvttw3/im_going_to_be_buying_150_each_week_of_different.json": "Complete idiot here. I’m saving up money to move in with my girlfriend at the\nend of July. $135 a week is about what I would need, but in case I mess up I’m\ngoing to be putting $150 into it. I currently make about $2,000 a month working\nat a gas station. I’m going to DoorDash for a 2nd job while…",
  "data/reddit-stocks/r/stocks/comments/rvvzfr/ford_plans_to_nearly_double_production_of_its_new.json": "https://www.cnbc.com/2022/01/04/ford-plans-to-nearly-double-production-of-its-new-all-electric-f-150-lightning-pickup.html\n\nFord on Tuesday said it plans to nearly double annual production capacity of its\nupcoming electric F-150 pickup to 150,000 vehicles per year at a plant in\nMichigan.\n\nThe…",
  "data/reddit-stocks/r/investing/comments/rvvght/if_you_are_not_100_stocks_what_bond_funds_do_you.json": "More money is invested in bond funds than stocks but you would never know it by\nreading this board.\n\nIs anyone here invested in either BOND ETFs or Bond Mutual Funds?\n\nIf so what funds are you invested in? I am old so it is not a good idea to be\n100% in stocks. So I put 40% of my invested assets in…",
  "data/reddit-stocks/r/Bogleheads/comments/rvvzjf/thinking_of_buying_a_house_within_2_years_best.json": "Hey fellow Bogleheads, I’ll keep it short and sweet. I’m thinking of buying a\nhouse within the next two years and am looking for a way to efficiently store\nmoney and not have to pay a fat gains tax once I sell. Any thoughts? I’ve heard\nof iShares and obviously T-bills, but not sure if anyone has…",
  "data/reddit-stocks/r/wallstreetbets/comments/rvuzw8/should_you_listen_to_jim_cramer_i_analyzed_20000.json": "Jim Cramer has made 21,609 stock picks in the past 5 years! Let that sink in for\na moment. Here is one person, making buy/sell/hold recommendations on more than\n2,200+ different stocks across all types of industries. On average, he was\nmaking more than 20 picks per episode of his show [1]. This is…",
  "data/reddit-stocks/r/stocks/comments/rvx9sn/should_i_cut_my_losses_in_growth_stocks_and_dump.json": "My portfolio is heavy growth stocks. It isn't stuff like weed stocks and SPACs.\nIt is stuff like ETSY, SHOP, SQ, PYPL, CRWD, MRNA, SE, and NET.\n\nQuite a few of those stocks had such positive sentiment. Now it is disappeared\nand people are saying stuff like they will buy those stocks at prices that…",
  "data/reddit-stocks/r/stocks/comments/rvkitb/sell_mega_caps_msft_and_aapl_buy_back_in_lower.json": "AAPL is 6.7% of my portfolio. My cost basis is $103 a share. I now have a 76%\ngain in AAPL .\n\nMSFT is now 9.4% of portfolio. Cost basis $211.\n\nThe shares are mostly long so I could trim.\n\nI know most say \"let your winners ride\", but isn't part of a winning long term\nstrategy to sell when at all…",
  "data/reddit-stocks/r/Bogleheads/comments/rvw2tt/which_etfs_to_buy.json": "Hello everyone, Long time lurker of the subreddit and have started reading the\ncommon sense investing red book. I'm convinced that low-cost ETFs and index\nfunds would be the ideal investment instruments for me but I'm not sure about\nwhich ones to buy.\n\nI am aware of the 3 fund strategy of 1 SP500 /…",
  "data/reddit-stocks/r/Bogleheads/comments/rvelwl/maxing_roth_vs_traditional.json": "Is there a point where it's advantageous to go with Roth over traditional when\nmaxing out a 401k? (and HSA + IRA).\n\nWhat I'm getting at is that saving 20.5k in a Roth is effectively saving more\nthan you could in a traditional since the tax has already been accounted for.",
  "data/reddit-stocks/r/Bogleheads/comments/rvx98i/does_dont_panic_and_sell_apply_to_bonds.json": "Hello, i’m wondering if the advice/directive to not sell during a market\ndownturn a.k.a. bear market applies to equities as well as bonds. I Keep quite a\nlarge percentage of bonds versus equities for my age because I do not have a\nlarge income and I see those bonds as a safety net if we do have a…",
  "data/reddit-stocks/r/Bogleheads/comments/rvzrzr/it_literally_doesnt_matter_which_of_the_common.json": "According to vanguard's website, a $10,000 investment made 10 years ago in VTSAX\nand a $10,000 investment made 10 years ago in VOO only amounts to a $30\ndifference today. Don't stress yourself out trying to decide between VOO and\nVTSAX, or between any two of their \"rest of the US market funds\" or…",
  "data/reddit-stocks/r/stocks/comments/rvxxgx/cloudflare_and_crowdstrike_2022_outlook.json": "I’ve been holding these two for a little while now and in the past few months\nthey’ve been completely disappointing and considering selling and shifting into\nother positions. The thing is, I do believe that they are good companies, I just\ndon’t know if they’re great stocks right now. Is there any…",
  "data/reddit-stocks/r/Bogleheads/comments/rvxi3o/did_i_choose_the_wrong_index_fund.json": "Hi guys,\n\nSo my wife and I finally got smart enough to start putting some money into Index\nfunds. Started about half a year back and now have about 16k in it. But...\nlooking at it - it seems we might have chosen the wrong Index fund - FZILX. I\njust looked at it over the last 5Y and it only grew…",
  "data/reddit-stocks/r/investing/comments/rvxbr4/annoyed_with_vanguards_ui_am_i_missing_something.json": "My chief (and really only) complaint with Vanguard is their website interface.\nFor example, they have a super nice chart under their \"performance\" tab.\nHowever, it seemingly will only show the performance of all accounts you have\nwith Vanguard.\n\nMore often than not, I want to see the performance of…",
  "data/reddit-stocks/r/stocks/comments/rw590a/i_truly_must_have_been_one_of_the_worst_investors.json": "I picked truly the very worst sectors possible, pot stocks, China stocks, growth\nstocks and tech stocks. Im completely destroyed and will never be able to\nrecover. I guess thats why they say 90% of retail traders lose in the end.",
  "data/reddit-stocks/r/stocks/comments/rvx6on/is_f_a_growth_stock_now.json": "I’ve been following Ford for roughly 4 years now and it usually sat around\n$9-$12 and never below or above (with the exception of 2020 correction, it hit\nbelow $4) and now it’s up nearly 200% since 2020 and started issuing a dividend\nagain. What’s driving the price so high?",
  "data/reddit-stocks/r/wallstreetbets/comments/rw3qgq/i_traded_over_286_million_dollars_in_2021.json": "Started the year at 45k, yolo’d into GME and sold the top perfectly, hit 350k in\nearly February.\n\nThen in a series of bad decisions I yolo’d into SPAC warrants and lost all my\ngains and more. My portfolio hit 38k in June.\n\nMy next move was to yolo into TELL calls and I rebounded to 150k in…",
  "data/reddit-stocks/r/stocks/comments/rvzsb2/is_sony_undervalued.json": "I've been holding SONY for a little less than a year now and am up sizably, but\nI still can't help like this company flies dramatically under the radar.\n\nThey:\n\n * make cameras for the iPhone\n   [https://www.google.com/url?sa=t&rct=j&q=&esrc=s&source=web&cd=&cad=rja&uact=8&ved=2ahUKEwjS…",
  "data/reddit-stocks/r/Bogleheads/comments/rvy04a/wait_so_after_roth_maxed_rest_goes_into.json": "I’ve learned a ton in the last year, especially with you guys. I never asked and\ndon’t understand,\n\nAfter maxing out your ROTH, do you start putting the rest of your contributions\nif you have any into the traditional ROTH or into the brokerage account ?\n\nWhy?",
  "data/reddit-stocks/r/stocks/comments/rw5nm7/charlie_mungers_daily_journal_nearly_doubles.json": "The Daily Journal held 602,060 American depositary shares in Alibaba at\nyear-end, up from 302,060 as of Sept. 30, according to a regulatory filing\nTuesday. The company’s other investments, such as its Wells Fargo & Co. and Bank\nof America Corp. bets, were…",
  "data/reddit-stocks/r/stocks/comments/rw2ji9/nvidia_amd_apple_microsoft_alphabet_are_these.json": "Nvidia, AMD, and Apple were honestly some of my best performing stocks in 2021.\n\nI also purchased some 3x Leveraged Nvidia and Apple shares last year for an\nexperiment and at one point I was up nearly 900% with Nvidia (now it's just 500%\ndue to the recent price fall).\n\nNow since I already have over…",
  "data/reddit-stocks/r/stocks/comments/rw4xbx/i_truly_must_have_been_one_of_the_worst_investors.json": "I picked truly the very worst sectors possible, pot stocks, China stocks, growth\nstocks and tech stocks. Im completely destroyed and will never be able to\nrecover. I guess thats why they say 90% of retail traders lose in the end.",
  "data/reddit-stocks/r/stocks/comments/rwazte/so_what_happens_after_ive_waited_2_decades.json": "Currently 18, I was always interested in stocks and the number one thing I've\nheard across all these subreddits/youtube/tik tok/ boards is to \"Buy VOO/blue\nchips and then wait. Just wait decades and you'll see the results\".\n\nAnd I wholeheartedly believe and understand that. I have like $900 in VOO…",
  "data/reddit-stocks/r/Bogleheads/comments/rwff4o/im_deeply_shocked_to_learn_that_the_main.json": "Dividends are (of course) a significant contributor to long-term stock returns,\nbut as I was looking at the main dividend-oriented subreddit today I was\ngenuinely at a loss for words when I read one of their basic rules:\n\n> The question of taxes often comes up a lot in investing communities, and\n>…",
  "data/reddit-stocks/r/stocks/comments/rwe392/gm_sold_26_evs_in_q4_also_dethroned_by_toyota_on.json": "https://www.reuters.com/business/autos-transportation/toyota-poised-\n\n * Total Q4 EV sales: 26\n\n * Silverado slips to third best selling vehicle\n\n * Lost 90 year crown for yearly sales to Toyota\n\n * All Bolt EVs ever made were recalled due to risk of fire. They had to ask\n   customers to not park…",
  "data/reddit-stocks/r/wallstreetbets/comments/rw6t0k/users_who_did_not_create_their_account_in_the.json": "Honestly want to hear the take from legitimate users so I'm sorry for the bias\nto older accounts but there has been too much bs activity from newer accounts\never since GME exploded so let's just try and have an honest conversation that\ncontrols for that variable.\n\nI am writing more here to expand…",
  "data/reddit-stocks/r/stocks/comments/rw8xyu/your_top_etf_picks_for_2022.json": "What are your top 5 ETF picks for 2022 and why?\n\nMy picks so far:\n\nSMH - semiconductors\nSOXQ - semiconductors\nFINX - Fintech\nNEA - Tax Exempt Municipal Bonds\nPAVE - Infrastructure\n\n2022 seems like it'll be another good year for semiconductors. For Fintech there\nseems to be a lot of stuff brewing…",
  "data/reddit-stocks/r/investing/comments/rwgf6b/dollarcost_average_my_ira_or_just_jump_in.json": "So I've been waiting for the new year so I can max out my IRA again. Now that I\nhave fresh funds waiting to be invested, I'm wondering if I should just buy my\nusual allocations, or dollar-cost average in and buy gradually?\n\n\"Time in the market > timing the market\" leads me to believe it's best to…",
  "data/reddit-stocks/r/Bogleheads/comments/rwjdbp/ive_inherited_6_million_dollars_help_i_dont_want.json": "My father passed away on thanksgiving and has left me and my sibling 6 million\ndollars each. About 33% is in SPY, with huge gains. 20% is in bonds (BND) and\nstraight up cash. The rest is in individual stocks with many having large gains\n(nvidia, AMD, Apple, MSFT).\n\nI’d like to switch to a more…",
  "data/reddit-stocks/r/stocks/comments/rwjfwr/how_come_cnbc_commentators_can_own_the_stocks.json": "I heard that Jim Cramer can't own stocks directly but can via his charitable\ntrust. Ok.\n\nHow come Jim Lebenthal, Josh Brown, Joe Tarrenova, and most others can own and\nrecommend their own stovks then?\n\nAnd then one CNBC host (Brian Sullivan) said \"it's one of the few stocks that we\ncan own, as…",
  "data/reddit-stocks/r/stocks/comments/rwavkf/sony_announces_second_visions_ev_modell_new.json": "SONY will build its own EV cars.\n\n“The excitement we received after we showed off the Vision-S really encouraged\nus to further consider how we can bring creativity and technology to change the\nexperience of moving from one place to another,” said Yoshida, before revealing\nthe new Vision S SUV…",
  "data/reddit-stocks/r/stocks/comments/rwl6qe/ubs_downgrades_salesforce_slashes_price_target_by.json": "> UBS analyst Karl Keirstead downgraded Salesforce.com Inc  - to Neutral from\n> Buy with a price target of $265, down from $315. The price target implies an\n> upside of 6.7%.\n> \n> After speaking to large enterprise IT executives and services partners of\n> Salesforce, the analyst is concerned that…",
  "data/reddit-stocks/r/investing/comments/rwl0aq/what_are_your_predictions_for_top_performing.json": "What are the raw materials? Financials? Healthcare? Tech? Cyclicals?\n\nIn light of the impending taper, I'm leaning toward more \"boomer\"-type equities\nnext year rather than technology. If another opportunity arises, I will increase\nmy exposure to cyclicals and re-opening trades, as well as to tech…"
}