{
  "data/reddit-crypto/r/CryptoCurrency/comments/voyvms/i_calculated_the_current_inflation_rates_for_a.json": "I tried unsuccessfully to find a good resource that regularly updates/calculates\nthe current inflation rates for cryptocurrencies.\n\nWhat is inflation of a crypto?\n\nI am invested into a small number of projects, but one key factor I focus\nheavily on is the inflationary nature of the native token or…",
  "data/reddit-crypto/r/CryptoCurrency/comments/voz9f7/whats_up_with_the_coinbase_fud.json": "First we're seeing fud that coinbase might be insolvent. Wich is just plain\nridiculous if you check their revenue. They are literally a money making machine\nwith all the fees from you apes.\n\nNext we're seeing those posts that they are selling geo location. Guess what\nalmost all websites nowadays…",
  "data/reddit-crypto/r/CryptoCurrency/comments/vpe7i8/i_bought_1k_of_the_top_10_cryptos_on_january_1st.json": "EXPERIMENT - Tracking 2018 Top Ten Cryptocurrencies – Month Fifty-Three - Down\n-32%\n[https://preview.redd.it/rxma7hmli1991.png?width=640&format=png&auto=webp&s=477b135cb1ed29df5d14d1129a496961af1b9e09]\n\nFind the full blog post with all the tables here\n[https://toptencryptoindexfund.com/tracking…",
  "data/reddit-crypto/r/CryptoCurrency/comments/vpacf8/95_harmony_is_done_now_hackers_have_laundered_all.json": "On 30 June, Harmony team sent the last transaction asking hackers to return\nstolen assets. They could retain $10M in ETH. If the hackers are willing to do\nso, they will cease the investigation or manhunt they called.\n\nhttps://twitter.com/harmonyprotocol/status/1542327331426955264\n\nSadly, the…",
  "data/reddit-crypto/r/CryptoCurrency/comments/vpgs5z/warning_5_pull_your_assets_out_of_exchanges_asap.json": "Not your keys not your coin. When you deposit crypto to an exchange you are an\nunsecured creditor loaning out your assets so that Wallstreet types etc.. can\ntake leveraged bets using your money.\n\nMore exchanges will be locking out customers in the next few weeks and it will\nbe with no warning at…",
  "data/reddit-crypto/r/CryptoCurrency/comments/vpati6/megathread_voyager_suspends_trading_deposits.json": "Voyager has announced their decision to temporarily suspend trading, deposits,\nwithdrawals, and loyalty rewards, effective at 2:00 PM EDT July 1. This follows\nVoyager’s previous announcement\n[https://www.coindesk.com/business/2022/06/27/voyager-digital-issues-default-notice-to-3ac-draws-down-75m-of…",
  "data/reddit-crypto/r/Bitcoin/comments/vpeutv/bitcoin_family_i_made_it_to_1_btc_after_saving.json": "I just wanted to say that I have been DCA'ing everything I could for more than a\nyear and it was really tough to not get that fancy clothes, eat at good\nrestaurants. But I am happy that with this market I made it to 1 BTC.\n\nThis community really helped me and motivated to DCA when I first started…",
  "data/reddit-crypto/r/CryptoCurrency/comments/vpilgs/a_couple_of_months_ago_i_tried_to_warn_this_sub.json": "This is the post where I clearly warned people about the risk of lending your\ncoins:\nhttps://www.reddit.com/r/CryptoCurrency/comments/u4j817/you_should_think_twice_before_lending_your_coins/?utm_medium=android_app&utm_source=share\n\nAs we now know both Celsius and Voyager were engaging in high risk…",
  "data/reddit-crypto/r/Bitcoin/comments/vpoxgz/celsius_three_arrows_blockfi_voyager_all_killed.json": "The business model and activities of these platforms can continue and thrive\nONLY if prices of the crypto they have in asset keep increasing; yet, even noobs\nknow BTC fluctuates a lot and corrections should be expected from time to time;\nIn other words, price correction now is deemed to happen, and…",
  "data/reddit-crypto/r/CryptoCurrency/comments/vpz87z/cryptocom_is_price_gouging_on_transfer_fees_big.json": "This is incredibly super shady and is going to make me think twice when using\ncrypto.com [https://crypto.com] app platform again. Right now, 12:10 pm PST time\nI'm trying to withdraw ETH and BTC.\n\nOn L2Fees.info [https://L2Fees.info] it has it ETH listed as 0.36 USD. Even on\ntheir own CDC defi app…",
  "data/reddit-crypto/r/CryptoCurrency/comments/vpqthc/bitcoin_was_supposed_to_be_a_currency_but_has.json": "Currently on mobile so I’m unable to post graphs and charts with useless lines\nand maybe a red circle. With all of this “Security vs. Commodity” bullshit\npeople are really getting away from the original aspect of Bitcoin. Venezuela\njust bought how much more in hopes of restoring their economy? I am…",
  "data/reddit-crypto/r/CryptoCurrency/comments/vpx18n/a_reminder_that_coinbase_cried_about_sec_stopping.json": "https://blog.coinbase.com/the-sec-has-told-us-it-wants-to-sue-us-over-lend-we-have-no-idea-why-a3a1b6507009\n\n> The SEC has told us it wants to sue us over Lend. We don’t know why.\n> \n> Last Wednesday, after months of effort by Coinbase to engage productively, the\n> SEC gave us what’s called a Wells…",
  "data/reddit-crypto/r/CryptoCurrency/comments/vqfa5e/ethereum_ceo_has_immediately_accepted_president.json": "US President Joe Biden yesterday requested companies running gas stations to\nbring down the price as we are in a time of war and global peril.\n\nJoe Biden: Bring down the price you are charging at the pump to reflect the cost\nyou’re paying for the product. And do it…",
  "data/reddit-crypto/r/CryptoCurrency/comments/vqcg3n/the_bitcoin_supply_cap_or_how_i_learned_to_stop.json": "INTRODUCTION\n\nYou've probably heard over and over that Bitcoin has a 21 million supply cap.\nBut where does that number come from? As is always the case with blockchain and\ncryptocurrencies it's important to understand how they work so when you decide\nto go all in, you can be confident that you at…",
  "data/reddit-crypto/r/CryptoCurrency/comments/vqfsct/it_literally_says_in_the_coinbase_and_celsius.json": "I mean I always knew \"not your keys, not your coins\" was a fact, but after\nlearning that anything you have on these exchanges is not yours, and in the\nunfortunate event that they go bankrupt your coins are gone forever is actually\nin their terms of service is fucking down right scary!\n\nAll of this…",
  "data/reddit-crypto/r/CryptoCurrency/comments/vq9nbe/everyday_we_stray_further_from_satoshis_vision.json": "At the time the 08 global financial crisis had a huge impact on Bitcoins\ncreator, Satoshi.\n\nSatoshi saw what happened when people blindly trusted their money in banks. In\n08 banks collapsed under dodgy lending schemes and people got seriously burnt.\n\nBitcoin was created to create a decentralized…",
  "data/reddit-crypto/r/CryptoCurrency/comments/vqspcr/youtube_crypto_influencers_are_21st_century_snake.json": "It has to be said: an overwhelming amount of crypto “influencers” are no better\nthan used car salesmen or snake oil salesmen.\n\nTheir enthusiasm during bull runs is almost never curbed by the principles of\nsound investing practices.\n\nGuys like James from Investanswers try to sound responsible by…",
  "data/reddit-crypto/r/Bitcoin/comments/vqma4t/if_you_bought_most_of_your_bitcoin_in_2021_this.json": "Here's an example:\n\nLet's say you managed to buy 1 BTC last year at an average price of $40k. Now\nyou have to wait for the price to get back to $40k to \"break even\".\n\nHere are some scenarios:\n\nIf you buy 1 BTC at $19k, you lower your average purchase price to $29k.\n\nIf you buy 0.25 BTC at $19k, you…",
  "data/reddit-crypto/r/CryptoCurrency/comments/vr21it/peter_schiff_famous_btc_opponent_has_bank_account.json": "In what some might consider as \"peak irony\" Peter Schiff, renowned bitcoin\nopponent, crypto hater and general melt, has had his accounts frozen by\nregulators in Puerto Rico \"without…",
  "data/reddit-crypto/r/CryptoCurrency/comments/vr50ro/famous_btc_influencer_planb_the_author_of_failed.json": "This bear market hits really hard, but is this the bottom signal we have all\nwaited for? PlanB has shared a referral link to ByBit exchange (ranked 17th on\nCMC) to his 1.8M followers, starting a lot of laughs and confusion on\ncrypto-twitter. He also recommends options and futures. Sadly he did not…",
  "data/reddit-crypto/r/CryptoCurrency/comments/vqzo4u/vauld_has_paused_withdrawls.json": "https://www.vauld.com/blog/corporate-statement/\n\n\n\n 1. The Vauld management wishes to inform that we are facing financial\n    challenges despite our best efforts. This is due to a combination of\n    circumstances such as the volatile market conditions, the financial\n    difficulties of our key…",
  "data/reddit-crypto/r/Bitcoin/comments/vr5ttr/bitcoin_isnt_about_getting_rich_quick_despite_90.json": "It's permissionless, decentralized, sound money. Bitcoin isn't an investment.\n\nLet me say that again... Bitcoin isn't an investment. It is money.\n\nI know that most of you in this sub are treating it as an investment and don't\ncare about this and have just blindly jumped into the water with this…",
  "data/reddit-crypto/r/CryptoCurrency/comments/vr2wqh/not_your_keys_not_your_crypto_but_scammers_can.json": "I have been using exchanges for a year now, but after all this craziness\nhappening with the withdrawals, I decided to slowly start DCA-ing on Metamask,\nbecause I wanted to keep my crypto off exchanges.\n\nI do not have my secret recovery phrase anywhere digitally, its in my house on\npaper and I live…",
  "data/reddit-crypto/r/CryptoCurrency/comments/vra3g9/newbie_guide_all_major_coins_explained.json": "The crypto space can be overwhelming for beginners, there's just so many coins!\n\nBut fret not, I created simple explanations for all major coins to help you\nlevel up your crypto knowledge. Enjoy!\n\nBitcoin (BTC): The first crypto currency, created by Nvidia to boost graphics\ncard sales\n\nEthereum…",
  "data/reddit-crypto/r/CryptoCurrency/comments/vrcb1h/i_calculated_how_much_a_coin_would_be_worth_from.json": "You can see the glass half full or half empty. If you believe that your favorite\ncryptocurrency will get back to its ATH here is how much it would be worth with\na 1K USD investment. Glass empty crowd here is how much some of these coins has\ndropped from ATH.\n\nFor example, for BTC a 1K investment…",
  "data/reddit-crypto/r/CryptoCurrency/comments/vrg9yp/take_a_look_at_the_upcoming_big_macro_events_that.json": "With cryptos big correlation to the stock market crypto is getting heavily\ninfluenced by macro events to choose the upcoming direction. Obviously we can't\nreally predict what's gonna in the world next but there indeed some major events\nscheduled on July where we know that they will dictate the…",
  "data/reddit-crypto/r/CryptoCurrency/comments/vrqyeh/since_november_2021_the_number_of_bitcoin.json": "BTC\n[https://preview.redd.it/ivhmzfcbuo991.jpg?width=760&format=pjpg&auto=webp&s=4fa8a059a043c34651a3e64972f560eb61a7c786]\n\nAnd if I give a specific number instead of percentages, it becomes even scary.\n\nIn six months, 82,602 bitcoin millionaires have lost their status as a result of\nthe negative…",
  "data/reddit-crypto/r/CryptoCurrency/comments/vrzlcf/polkadot_dot_announces_upgraded_blockchain.json": "https://preview.redd.it/zndi48qyhr991.png?width=1012&format=png&auto=webp&s=8a3fe52bd8e80fe27317642142a1ea1fe4713b64\n\n\nINTRODUCING POLKADOT’S GOV2, AN UPGRADED GOVERNANCE DESIGN FOR POLKADOT NODES\n\nThe Polkadot network’s decision-making process is set to increase its capability\nto process a greater…",
  "data/reddit-crypto/r/CryptoCurrency/comments/vshqdx/against_the_odds_celsius_may_be_about_to_save.json": "I'm not involved in Celsius in any way. I had no funds nor did I particularly\ncare about them either way. I thought perhaps some of the things they were doing\nmay have been too good to be true, but my decision to stay away was more out of\nlaziness than anything else. However, their presence across…",
  "data/reddit-crypto/r/CryptoCurrency/comments/vt8pe0/crema_finance_hacker_returns_6064_eth_239679_sol.json": "ABOUT CREMA FINANCE\n\nCrema finance is a decentralised liquidity protocol based on Solana.\n\n\n\nIt offers a solution to illiquid markets by offering rewards to liquidity\nproviders to swap illiquid cryptocurrencies.\n\n\nHACK RECAP\n\nThe exploiter found a vulnerability in its tick size and activated six…",
  "data/reddit-crypto/r/CryptoCurrency/comments/vtihzz/celsius_have_closed_their_maker_vault_and_are.json": "Celsius onchain activity has seen a lot of big moves in the last few hours.\n\nThey closed down their maker vault by replaying the loan and retaken their 22k\nBTC from there And now have consolidated the 22k BTC into an intermediary\nwallet, and this is moving to FTX.\n\n\n\nDAI loan…",
  "data/reddit-crypto/r/CryptoCurrency/comments/vtjs7w/not_your_keys_not_your_crypto_not_for_everybody.json": "This is definitely an unpopular opinion and I’ll probably get downvoted to the\npits of hell especially so in this sub-reddit for saying this but please don’t -\nhear me out.\n\n“Not your keys, not your crypto” is definitely a mantra chanted over and over\nagain in this sun-reddit but I’m of the opinion…",
  "data/reddit-crypto/r/CryptoCurrency/comments/vtou1g/the_president_of_el_salvador_and_ceo_of_the.json": "Just today the President of El Salvador and the CEO of Binance trolled Peter\nSchiff on a tweet about Bitcoin. In the tweet Peter Schiff, the well known\nGold-believer and Crypto hater, said that Crypto failed and now institutions are\ngoing to back out (meaning that he acknowledged at the first that…",
  "data/reddit-crypto/r/CryptoCurrency/comments/vtzrzl/solana_is_going_to_be_the_next_rug_pull_im_a.json": "For the average investor, if you are not technical, I've supplied notes in bold\nthat might make more sense.\n\n\nSOLANA IS A TICKING TIME BOMB\n\n(Hackers, Raiders, and Thieves are coming for your moneys.)\n\nSolana decided to build their smart contracts on Rust and C++. The crypto craze\ncaused the demand…",
  "data/reddit-crypto/r/CryptoCurrency/comments/vu2fg8/one_year_ago_i_gave_my_kids_100_each_and_asked.json": "One year ago, I made a post\n[https://np.reddit.com/r/CryptoCurrency/comments/ofzwd4/i_gave_my_kids_100_each_and_asked_them_to_pick/]\nabout giving my kids $100 in crypto and asking them to choose three cryptos\neach. I was asked by many in the thread to post a monthly update. I only have\nthe time…",
  "data/reddit-crypto/r/Bitcoin/comments/vtxvq2/an_old_timers_tale_segwit2x_the_block_wars_when.json": "I think its time we take a moment and reflect back on the event, many years ago,\nthat proved bitcoin is unstoppable (at least in the foreseeable future). It\nseems that the Segwit 2x\\bcash shills have come out of hiding due to the drop in\nbitcoin's price, as the \"bitcoin is terrible as a currency,…",
  "data/reddit-crypto/r/CryptoCurrency/comments/vu26qy/the_great_algo_mass_inflation_event_of_2021_the.json": "Algorand [https://coinmarketcap.com/currencies/algorand/] is supposed to have a\nmax supply of 10B and was launched in June of 2019. As of Jan. 01st 2021 it had\na price of $.399 and a circulating supply of 1.19B it ended the year with a\nprice of $1.66 and a circulating supply of 6.36B. Meaning over…",
  "data/reddit-crypto/r/CryptoCurrency/comments/vuaeuu/whats_your_unpopular_crypto_opinion.json": "What are some things you can say on this sub that'll probably get you downvoted?\n\nMine are:\n\n * Holding isn't always the best strategy. While you hold others take profit and\n   the price goes down.\n\n * Keeping your crypto on an (big and reputable) exchange is often the better\n   way. No lost keys…",
  "data/reddit-crypto/r/CryptoCurrency/comments/vudrxp/reddit_released_the_new_nft_collectible_avatars.json": "You can read the post on r/reddit [/r/reddit] (link\n[https://np.reddit.com/r/reddit/comments/vtkmni/introducing_collectible_avatars/?utm_source=share&utm_medium=web2x&context=3])\n\nFor the most part people seem to not like the idea of reddit selling nfts, it\nalso seems like reddit avoided calling…",
  "data/reddit-crypto/r/CryptoCurrency/comments/vuh4c6/mammoth_rise_in_volume_anyone_got_any_theory_as.json": "The rise in volume has been so big, my chart on Binance got completely squished:\n\n\n\nhttps://preview.redd.it/oirfc7vntda91.jpg?width=898&format=pjpg&auto=webp&s=092162fde227457b3e6714709853b5fa29899d0b\n\n\n\nHere's a comparison of the volume prior to the spike.\n\nCompared to the average volume we've had…",
  "data/reddit-crypto/r/CryptoCurrency/comments/vv1ape/i_calculated_how_much_a_coin_would_be_worth_from.json": "I know this sub can be passionate about alt-coin projects. Please read and\nconsider before commenting or downvoting.\n\nThis is a response to this post\n[https://www.reddit.com/r/CryptoCurrency/comments/vrcb1h/i_calculated_how_much_a_coin_would_be_worth_from/]\nthat got a lot of attention recently.\n\nI…",
  "data/reddit-crypto/r/CryptoCurrency/comments/vv1ana/satoshis_last_public_message_before_disappearing.json": "From: Satoshi Nakamoto satoshin@gmx.com Sat, Apr 23, 2011 at 3:40 PM\n\nTo: Mike Hearn mike@plan99.net\n\nI've moved on to other things. It's in good hands with Gavin and everyone.\n\nI do hope your BitcoinJ continues to be developed into an alternative client. It\ngives Java devs something to work on,…",
  "data/reddit-crypto/r/CryptoCurrency/comments/vv2c29/i_used_an_algorithm_to_find_coins_that_can_20x.json": "I've ran an algorithm to find coins that have a 20x or even 50x potential.\nFirst, I took a list of all coins from CoinGecko API, and I filtered them to\nexclude leveraged tokens like \"SPDR S&P 500 ETF tokenized stock FTX\" and of\ncourse shitcoins. This step eliminated 7302 out of 13403 coins, leaving…",
  "data/reddit-crypto/r/CryptoCurrency/comments/vvipwu/its_really_important_to_have_an_emergency_fund.json": "Emergency funds are something I don't see mentioned very much outside of \"only\ninvest what you can afford to lose\". While it is good advice, it is very\npossible that we experience a recession in the near future and having an\nemergency fund is really important right now.\n\nFor those who don't know…",
  "data/reddit-crypto/r/CryptoCurrency/comments/vvi92u/someone_managed_to_remotely_grab_my_phones_sim.json": "honestly thought i did everything (mostly) right. use a password manager, never\nclick on phishy shit, etc. today, someone managed to usurp my phone's SIM and\nwas able to drain my Coinbase account.\n\npretty surreal, honestly. wish i'd moved shit to a wallet regularly. i'm not\nsuper technical, but it…",
  "data/reddit-crypto/r/CryptoCurrency/comments/vvlkz6/crypto_investing_from_a_perspective_of_someone.json": "It's great how non-tech savvy people who don't know anything about tech or\ncrypto simply don't care. They don't spend time on reddit. They don't follow any\ninfluencers. They don't use Twitter, YT etc.\n\nWe always talk about how we shouldn't be introducing family or friends inco\ncrypto. And I always…",
  "data/reddit-crypto/r/CryptoCurrency/comments/vw0saw/looks_like_coinbase_will_be_discontinuing_the.json": "Got a notification to select a new reward but it appears that there are no\noptions to select from that don’t expire on the 17th of July, 2022. No more Amp\nat 2%, no more USDC at 1%, no more DAI at 1%, no more Ethereum at 1% and no more\nBitcoin at 1.5%. From 4% rewards to 2% rewards to 0%. Honestly…",
  "data/reddit-crypto/r/Bitcoin/comments/vvqw2r/been_buying_bitcoin_every_month_since_october.json": "Started just before the all-time high of 2017, thought I was late (everyone\ndoes). Didn't have much savings, but wanted as much bitcoin as possible. Was\nreading the early retirement blogs like Mr. money mustache etc. so already was\nkinda committed to being frugal and saving/investing every month.…",
  "data/reddit-crypto/r/CryptoCurrency/comments/vvxsfq/i_compared_real_world_prices_between_the_big_cexs.json": "We keep hearing that prices are significantly different between exchanges,\nespecially with free commission which people are claiming that the spread will\nbe much higher? But is it really?\n\nHere I tested the price difference, the real price that you would buy at and not\ntheoretical price, between:…",
  "data/reddit-crypto/r/CryptoCurrency/comments/vwbt26/the_terror_of_luna_goes_on_part_1.json": "As you can see by the title, you must already know what this post is about.\n\nAlthough the issue with LUNA have been stated over and over again, it still\naffects families and individuals today.\n\nAs a korean living in korea, I get to see news reports of people who are\naffected by LUNA crash.\n\nAnd…",
  "data/reddit-crypto/r/CryptoCurrency/comments/vvv67f/one_of_most_important_crypto_rules_never_tell.json": "This is rule many people forgot about especially in bear market. In bull market\nmost people protect their profits, but during bear market a lot of people like\nto share their losses. Problem is when bull market will come back you will have\ntarget on your back.\n\nIf you need share loses or gains use…",
  "data/reddit-crypto/r/CryptoCurrency/comments/vwhdqd/cryptocom_slashes_earn_rates_for_a_5th_time.json": "Crypto.com continues its saga of reducing earn rates by lowering its stablecoin\nearn rates today. This is the 5th time now in just a few months it has lowered\nits rates without giving any notice again to its customers.\n\nIt seems even with all the complaints of communication about these changes…",
  "data/reddit-crypto/r/CryptoCurrency/comments/vwrhgr/celsius_just_paid_off_another_113m_from_their.json": "Celsius has been seen as another big possible candidate for going bankrupt in\nthis bear market as they had a ton of debt, liquidation risk at 23k BTC price\nand they got heavily shorted at FTX. If they would have failed millions of\ncostumers would have basically been feeling \"rug pulled\" as this…",
  "data/reddit-crypto/r/CryptoCurrency/comments/vx0ztk/7500_eth_91_million_stolen_in_uniswap_phishing.json": "WHAT HAPPENED? (HACK RECAP)\n\n73,399 addresses have been sent a malicious token to target their assets, under\nthe false impression of a $UNI\n[https://twitter.com/search?q=%24UNI&src=cashtag_click] airdrop based on…",
  "data/reddit-crypto/r/CryptoCurrency/comments/vx7f7w/i_thought_i_had_more_time_as_a_european_now_eur.json": "We often speak about \"that African nation currency\" being devalued and many\npeople running towards Crypto (or USD).\n\nBecause we assume that a nation with a small (and often weak) economic area will\nface inflation consequences more rapidly than those called \"developed nations\".\n\nWell, me as a…",
  "data/reddit-crypto/r/Bitcoin/comments/vx7om3/my_son_cost_me_1_btc.json": "In 2020, I sold 1 btc at the worst price to help pay for an IVF (in vitro\nfertilization). Today my wife and i have the most amazing little guy, a few btc\nleft, and we joke he will have cost us millions in the near future.\n\nI consider him the ultimate wholecoiner (still working on making him an…",
  "data/reddit-crypto/r/CryptoCurrency/comments/vxm7ox/gamestops_nft_marketplace_earns_the_company_45k.json": "ARTICLE FOR REFERENCE:\nhttps://arstechnica.com/gaming/2022/07/analysis-gamestops-nft-marketplace-earns-the-company-just-45k-in-first-day/\n\nFrom this article, I would argue that $45,000 transaction fees out of about\n$1.98 million in volume in the first day of launching the NFT market place is\nreason…",
  "data/reddit-crypto/r/Bitcoin/comments/vxh8t6/congratulations_to_all_you_new_1btc_holders_now.json": "Would you tell everyone how much money you have in your bank account? Wouldl you\ntell folks on social media that you just bought $20k worth of stuff to brag?\nStop doing this for the upvotes.\n\nCome on guys, what the hell is going on in this Sub?\n\nRULE NUMBER ONE:\n\nNOT YOUR KEYS NOT YOUR COINS\n\nRULE…",
  "data/reddit-crypto/r/Bitcoin/comments/vxgr3j/i_am_dumping_my_whole_weeklypaycheck_every_week.json": "I make 800 and sum and I feel like I should yeet it all into bitcoin while I\ndon't pay rent (live at home with dad) and I'm confident it will be the best\nthing I have ever done",
  "data/reddit-crypto/r/CryptoCurrency/comments/vy31gc/today_will_not_be_a_good_day_for_crypto_but_might.json": "New inflation numbers coming out today and the markets are already panicking,\nreports are coming out about June inflation rates hitting 9.1%.\n\nToday will be a Red day which might not be good for Crypto but if you were\nwaiting for the right time to buy this might be it.*\n\nI know some of you don't…",
  "data/reddit-crypto/r/CryptoCurrency/comments/vy84rw/3ac_borrowed_millions_from_voyagerblockfi_user.json": "3AC borrowed hundreds of millions from user's deposits through custodial agents\nlike Voyager and BlockFi, and used it to recklessly gamble on all kinds of\nridiculous crypto things, including \"CryptoDickButt\" NFT.\n\nThis is one of the wallets of…",
  "data/reddit-crypto/r/CryptoCurrency/comments/vyb4w0/indepth_analysis_heres_what_the_cpi_data_is.json": "The biggest crypto market is still the US (hopefully that will be more balanced\nin the future). And right now, one of the many concerns in this market is US\ninflation.\n\nCPI is up 1.3%, hitting a high of 9.1%.\n\nThat's 9.1% over the last 12 months.\n\nCore CPI is up 5.9% (it was 6% in May).\n\nCPI is a…",
  "data/reddit-crypto/r/CryptoCurrency/comments/vyialk/brute_forcing_531441_seeds_only_to_lose_a_reddit.json": "This challenge was posted 5 hours ago:\nhttps://www.reddit.com/r/CryptoCurrency/comments/vyaj4t/how_to_remember_your_12_word_seed_by_spreading_it/ig27rrv/\n\nAfter setting up an elaborate social game where individual words of the seed are\ntrickled out to commenters who must work with each other, the…",
  "data/reddit-crypto/r/CryptoCurrency/comments/vyqdct/crypto_winters_next_victims.json": "We have seen a number of unsustainable projects that have stumbled their way\ninto oblivion like:\n\nLuna Three Arrows Capital Voyager Celsius\n\nIt is tragic for anyone caught up in these projects. Perhaps we can share some\nadvice to save ourselves trouble in the future.\n\nWhat are some other projects…",
  "data/reddit-crypto/r/CryptoCurrency/comments/vyn4h1/the_current_highest_yield_for_stable_coin_staking.json": "So I've been comparing stable coin yields across DeFI/CeFI platforms\n\n\n\n * Curve 3Pool (DAI-USDC-USDT) : 0.15%\n * AAVE USDC : 0.41%\n * Curve sUSD (DAI-USDC-USDT-sUSD): 1.42%\n * Coinbase USDC : 2%\n * Uniswap USDC-USDT : 2.2%\n * Blockfi USDC : 6%\n * Celsius USDC : 8.5%\n\n\n\nAnd the winner is…",
  "data/reddit-crypto/r/CryptoCurrency/comments/vyym0r/bear_market_is_actually_nice_here_is_why.json": "When I first invested in crypto around 2021 everyone was talking about buying\nLambo or home. Btc was supposed to reach 100k, ADA 5$ and Doge 1$. Instead, by\nthe end of the year everything has went to shit.\n\nThis year, story went differently:\n\n 1. First of all with same amount of money you can buy…",
  "data/reddit-crypto/r/CryptoCurrency/comments/vyuvy5/xrp_news_abound_this_week_former_ripple_chair.json": "My goodness friends, what a week for Ripple. XRP holders, catalysts abound yet\nwe remain stuck in by the bears. Let's do a quick recap anyway, and hope that\nthe market begins to reflect the bullish news:\n\nMichael Barr Confirmed: Michael Barr, a former Ripple adviser, is set to assume\none of the…",
  "data/reddit-crypto/r/CryptoCurrency/comments/vziazb/more_than_50_of_ethereum_is_hosted_on_amazons_aws.json": "https://preview.redd.it/rfk0os4rjob91.jpg?width=679&format=pjpg&auto=webp&s=747a60b20226f1ab0e429fce381b3ce66b39511d\n\nEthereum gets a lot of love from the crypto community for being properly\ndecentralized, but has anyone actually taken the time to analyze that network\nusing Ethereum's own topology…",
  "data/reddit-crypto/r/CryptoCurrency/comments/vzoktn/how_i_made_a_bitcoin_cold_storage_wallet_out_of.json": "There are many ways to generate a Bitcoin cold storage wallet offline (dice, a\ndeck of cards, shelling out cash for a ledger). As so many centralized exchanges\nare suddenly going bust, it's important to remember: (1) DCA through the bear\nmarket (\"plant seeds in the bear market to harvest in the…",
  "data/reddit-crypto/r/CryptoCurrency/comments/vztjus/they_always_tell_you_to_dyor_but_they_never_tell.json": "DOING YOUR RESEARCH IS THE SINGLE MOST IMPORTANT THING IN THE CRYPTO SPACE, AS\nTHERE ARE SOOOOOOOO MANY SCAMS AND SHADY PROJECTS OUT THERE. REMEMBER: KNOWLEDGE\nIS POWER!\n\nI will start with some general sources about crpyto knowledge and get more and\nmore specific through this post. Getting into…",
  "data/reddit-crypto/r/CryptoCurrency/comments/vzuz02/what_are_your_honest_opinions_on_crypto_in_the.json": "I started heavily researching this subject and eventually decided to start\ninvesting three years ago basically just accumulating little whenever I could.\n\nMarket sentiments not just for crypto but for other assets don't seem too\noptimistic with Crypto being the most volatile losing soo much of its…",
  "data/reddit-crypto/r/CryptoCurrency/comments/w0owbk/just_found_out_more_than_88k_usd_worth_of_crypto.json": "Im completely devastated. I honestly have no idea how or when my metamask or\nlaptop got compromised. To think i was planning to get a hardware wallet. Not\neven in the mood to write anything. My life was already going backwards and now\nthis. Any ideas on what i should do. Also If someone can shed…",
  "data/reddit-crypto/r/Bitcoin/comments/w0o38p/calm_before_the_storm.json": "I love times like these, no one is talking about bitcoin, the speculators are\ngone, its just quiet. We are only left with high conviction users who don't feel\nthe need to spread fud or hype. They just stack sats and sleep easy knowing they\nare preserving their wealth by being an early adopter of a…",
  "data/reddit-crypto/r/CryptoCurrency/comments/w0qfzw/why_july_the_28th_is_going_to_be_one_of_the_most.json": "Right now everything seems good, we hit a way too high inflation data but we are\nstill pumping just a few days later and to not forget the merger hype seems to\nbe kicking in again. So are we set for a few weeks of relief and maybe even\nreversal? Don't be foolish te real test of Crypto is yet to…",
  "data/reddit-crypto/r/CryptoCurrency/comments/w1dls7/too_big_to_fail_does_not_exist_for_coinbase_or.json": "This subreddit has been riddled with warning after warning and yet people are\nstill shocked, somehow, when a large exchange or stablecoin goes belly up and\ntheir funds are locked or liquidated.\n\nIn terms of stablecoins failing, cant do much about that.\n\nIn terms of where you keep your decentralized…",
  "data/reddit-crypto/r/CryptoCurrency/comments/w1bpt6/coinbase_rumors.json": "There are a lot of CB rumors right now involving liquidity and potential\nbankruptcy. First, I have seen no credible report that indicates CB is about to\ngo bankrupt. CB going bankrupt would be a huge setback for crypto and I have to\nimagine that if CB was in such serious trouble that they were…",
  "data/reddit-crypto/r/CryptoCurrency/comments/w1cmxa/fear_and_greed_index_has_been_in_extreme_fear.json": "Even after a pretty good relief rally for Bitcoin and especially alts and\nEthereum this week despite the bad inflation data, there is no denying that we\nare very deep in a bear market right now. And the once in a century kind of bad\nmacro situation with 40 year high inflation (with real data its 70…",
  "data/reddit-crypto/r/Bitcoin/comments/w1di0k/please_understand_what_1_btc_1_btc_really_means.json": "Often a bitcoiner will say \"1 btc = 1 btc\" and then someone, thinking they are\nclever, will respond with \"well 1 usd = 1 usd\" - so I'd like to explain the flaw\nin this response, and I'll use a simple example to do so.\n\nLet's take some constant, like \"1 meter.\" The \"meter\" is defined as the…",
  "data/reddit-crypto/r/CryptoCurrency/comments/w1ztmf/despite_popular_believe_crypto_is_not_the_best.json": "Users in this sub and other crypto subs have this mentality that crypto is the\nbest and only opportunity they have to get ahead financially. This is\nridiculous, getting a good job would be far more beneficial, especially if you\nhave a shitty job and can't afford to buy much crypto in the first…",
  "data/reddit-crypto/r/CryptoCurrency/comments/w1x5r4/is_there_any_proof_that_the_crypto_market_will_be.json": "I based this on previous cycles and weekly moving averages. There are people\nmaking claims that crypto ATL will be in when the stock market is also at an\nATL. The way I see it, BTC and alts follow the Nasdaq. The worst stock market\nbear markets lasted two to three years. This one is about six…",
  "data/reddit-crypto/r/CryptoCurrency/comments/w28yt5/three_arrows_capital_founder_bought_a_50m_yacht.json": "A few weeks ago 3AC has collapsed and filed for a Chapter 11 bankruptcy. Some\nreasons have been the LUNA-UST collapse but also a very bad business model of\nthe exchange where the crypto hedge fund basically just borrowed money from many\nother companies without every repaying that and now even those…",
  "data/reddit-crypto/r/CryptoCurrency/comments/w2hkln/i_blocked_a_deposit_into_voyager_two_days_before.json": "I deposited $1000 as USD in voyager two days before we were unable to mane\nwithdraws. Once this was frozen, I called my bank to see if I can put a stop or\nreversal on this charge, since I am unable to access that $1000. The money went\nback to my checking account a couple of days later. Here we are…",
  "data/reddit-crypto/r/Bitcoin/comments/w1vn2g/in_a_few_years_many_will_say_all_bitcoin.json": "Russian war, inflation, recession, regulations, haters, politicians, and\nreckless platforms and exchanges; adding to the fact we are still early and BTC\nstill fluctuates a lot and thus testing you everyday: when BTC goes down, should\nI sell to cut lost, keep dca or buy more? When BTC goes up,…",
  "data/reddit-crypto/r/CryptoCurrency/comments/w2nopr/if_you_use_tiktok_and_crypto_i_recommend_you.json": "After todays FCC announcement of TikTok and their recommendations of banning it\nfrom stores, a lot of information regarding what they collect from users came to\nsurface.\n\nIt’s even worse than I imagined.\n\nTikTok is said to collect “everything”, from search and browsing histories;\nkeystroke…",
  "data/reddit-crypto/r/CryptoCurrency/comments/w2nyk9/you_dont_need_a_high_paying_job_you_just_need_an.json": "HIGH PAYING JOBS BUT VERY LITTLE WEALTH\n\nI know a lot of people with 6-figure incomes that are basically living paycheck\nto paycheck or are in debt up to their eyeballs. I also know a lot of people\nwith median incomes for their area who are much more disciplined and financially\nliterate and have…",
  "data/reddit-crypto/r/CryptoCurrency/comments/w2tcw7/whale_no_3_just_moved_155k_btc_out_of_storage.json": "EDIT: The wallet sold so much that it's at 4th position, no longer \"No. 3\"\n\nFor those who do not know, \"Whale No. 3\" is a well-known holder of bitcoin and\nhas gotten famous due to the sheer amount of BTC and anonymity. You can check\nout their holding…",
  "data/reddit-crypto/r/CryptoCurrency/comments/w3jjz9/anyone_else_wish_the_price_would_stop_rising.json": "We're supposed to be in a bear market, it's perfect for me to get more bang for\nmy buck.\n\nI was promised a year long bear market, at first I was saddened at the thought\nof seeing my portfolio dwindle down to low amounts but then I had excitement, I\ncan get this shit cheap as chips.\n\nAnd what does…",
  "data/reddit-crypto/r/CryptoCurrency/comments/w3sz7k/i_dont_trust_this_rally_one_bit.json": "Inflation data just released few days again and we printed another 5% plus.\nThat’s a red flag for any investor investing in a risky assets like crypto\nbecause it is 100% sure that the interest rates are going to go up again in the\nnext FOMC meeting.\n\nTo me, I think this is a co ordinated rally for…",
  "data/reddit-crypto/r/CryptoCurrency/comments/w3kfzu/terra_luna_and_celsius_have_really_opened_my_eyes.json": "I'm talking percentage of their overall wealth.\n\nWhen Terra Luna collapsed and then subsequently Celsius went bankrupt the sheer\namount of posts and comments talking about losing all their savings was\nstartling. People putting hundreds of thousands of dollars in one project\nbecause they somehow…",
  "data/reddit-crypto/r/CryptoCurrency/comments/w3kcmk/free_mit_courses_on_blockchain_crypto_and_finance.json": "I thought this might be helpful for anyone looking to dig a little deeper and\nlearn more about the crypto/blockchain space. I took a break from staring at the\n1m charts a couple of months ago and decided to fill my free time with some of\nthis curriculum. Amazingly, this resource exists for…",
  "data/reddit-crypto/r/CryptoCurrency/comments/w49jir/nft_owner_created_a_fake_joke_bid_of_100_weth.json": "Quick summary :\n\n * @franklinisbored minted \"stop-doing-fake-bids-its-honestly-lame-my-guy.eth\"\n   NFT.\n * He fake bid 100 ETH on it, to increase its value.\n * Another user bid the NFT for 1.9 ETH.\n * @franklinisbored then accepted the 1.9 ETH but forgot to cancel his own 100\n   ETH fake bid.\n *…",
  "data/reddit-crypto/r/CryptoCurrency/comments/w4jflp/a_coinbase_product_manager_was_just_charged_with.json": "From the Justice Department:\n\nBeginning in approximately October 2020, ISHAN WAHI worked at Coinbase as a\nproduct manager assigned to a Coinbase asset listing team. In that role, ISHAN\nWAHI was involved in the highly confidential process of listing crypto assets on\nCoinbase’s exchanges and had…",
  "data/reddit-crypto/r/CryptoCurrency/comments/w4etrr/when_canadian_dollar_becomes_worthless_we_will_be.json": "Just saw this response from Nunchuk wallet to Ontario court order requested them\nto freeze bitcoin wallets associated with current protests.\n\nEverything was normal except this last line.\n\n\"When the Canadian Dollar becomes worthless,we will be here to serve you,too\"\n\nOfficial Response\n\n> Dear the…",
  "data/reddit-crypto/r/CryptoCurrency/comments/w472ng/btc_wallet_3_now_has_0_btc.json": "What used to be BTC #3 wallet only last week now has 0 (ZERO) coins left\n[https://bitinfocharts.com/bitcoin/address/1P5ZEDWTKTFGxQjZphgWPQUpe554WKDfHQ?__cf_chl_jschl_tk__=e2d9eddf24c98aa1287c0c08cd7184e4a9bd3aa5-1624536934-0…",
  "data/reddit-crypto/r/CryptoCurrency/comments/w57n0t/so_i_got_bored_and_drunk_and_decided_to_play.json": "lol jesus, would this even count as a proper thread for CC? ok i hope so, so\nhere we go.\n\nso while ive been chasing the recent BTC/ETH rally during this big bear, i got\nstressed out and decided to hit the bottle again and take a small break. and i\nget a message on Twitter from a scammer giving out…",
  "data/reddit-crypto/r/Bitcoin/comments/w4q34x/signs_you_should_get_off_crypto_lending_platforms.json": "Figured I share a couple of observations regarding current state of crypto\nlenders:\n\n 1. Bear market: CeFi wasn't built for crypto winter\n\n 2. Near competitor liquidation/insolvency: this is the contagion effect. We\n    have seen this w/ Celsius, 3AC, Bancor, Vauld, Voyager.\n\n 3. Increase in…",
  "data/reddit-crypto/r/CryptoCurrency/comments/w5afuh/uh_oh_i_leaked_my_seed_phrase_crack_a_weak.json": "One week ago, someone posted a challenge\n[https://www.reddit.com/r/CryptoCurrency/comments/vyaj4t/comment/ig27rrv/] on\nthis sub, which was solved surprisingly (or not-so-surprisingly, after reading\nthe explanation) fast, as detailed in this…",
  "data/reddit-crypto/r/CryptoCurrency/comments/w5qt81/bitcoins_next_halving_is_1_year_8_months_and_14.json": "With bitcoins next halving a mere 621 days away let’s take a look at some of the\npast halving’s…\n\n2012 the first halving\n\n * happened on November 28th 2012\n * the price on the date: $12.35\n * price 150 days later: $127\n\n2016 the second\n\n * happened on July 6th 2016\n * the price on the date:…",
  "data/reddit-crypto/r/CryptoCurrency/comments/w6edr5/next_week_is_going_to_be_very_brutal_for_crypto.json": "After we have had a bit of a relief, now shit us actually getting real as we are\ngoing to enter probably one of the worst or at least most interesting week for\nthe stock markets, crypto and the world in general. So you gotta keep an open\nmind throughout the week and be ready for everything. Here…",
  "data/reddit-crypto/r/CryptoCurrency/comments/w6ntgx/audius_community_treasury_hacked_for_185m_audio.json": "ABOUT AUDIUS PROJECT:\n\nAudius is a decentralised music streaming service, built on POA Network, an\nEthereum sidechain, and later moved some services to the Solana blockchain. It\nlets artists upload their tunes to the app and connects fans directly with\nartists and exclusive new music.\n\n\nHACK…",
  "data/reddit-crypto/r/CryptoCurrency/comments/w6dipo/help_i_think_ive_been_scammed.json": "So I posted to this forum asking for advice about transferring my BTC and ETH to\nmy hardware wallet. I set up my trezor wallet and initiated the transfer of my\ncoins. 2 days later, my BTC was in my wallet but not my ETH. I then went on this\nsubreddit asking for help. Someone messaged me with these…"
}