{
  "data/reddit-ask/r/TooAfraidToAsk/comments/shh2p2/does_anybodys_parents_charge_them_rent.json": "I'm in hs and I soon as I hit a job my mom started charging me rent, I only earn\nabout 600 a motnh during the school year.\n\nShe charges me $400, then I pay my own phone bill which is around $35 then I pay\nmy own gas for my car which is about $80 a month.\n\nMeaning I only save 85 a month, if…",
  "data/reddit-ask/r/NoStupidQuestions/comments/shh11p/did_anybody_parents_charge_them_rent.json": "I'm in hs and I soon as I hit a job my mom started charging me rent, I only earn\nabout 600 a motnh during the school year.\n\nShe charges me $400, then I pay my own phone bill which is around $35 then I pay\nmy own gas for my car which is about $80 a month.\n\nMeaning I only save 85 a month, if…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/shj5zj/completely_not_joking_am_i_the_only_person_who.json": "I’ve seen the news recently about Spotify and stuff... but I actually have no\nidea who he is at all!",
  "data/reddit-ask/r/TooAfraidToAsk/comments/shmt2m/how_much_do_you_feel_inside_your_vagina.json": "Are there any women out there besides me whose vaginas have numb walls? I can\nfeel my cervix when it's touched and my g-spot but not the rest. I can feel a\nsense of fullness when a thick dick is in me but that's it. No tingling\nsensations or however you want to describe the feeling. I cum just fine…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/shlkv2/how_is_wwii_taught_in_german_schools.json": "Title says it all. As an American, I’m genuinely curious.",
  "data/reddit-ask/r/AskWomen/comments/shmrnh/whats_something_that_people_think_is_a.json": "Title says it all.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/shpifr/what_do_girls_fantasize_about_while_masturbating.json": "recently a friend of mine told me she doesn't really imagine anything just does\nit like that.. i have hard time believing it but she doesn't really like men and\ni can kinda believe her.. is it like this only for her or mostly girls actually\ndo this with imagining scenarios or so?",
  "data/reddit-ask/r/askscience/comments/shnncq/to_what_extent_do_most_cultures_recognize_the.json": "Some cultures only have words for red, white, and black, while other cultures\nhave words for red, orange, yellow, etc.—does the same hold for emotions?\n\nPut another way: in primary schools, there are posters with cartoon faces\ncaricaturing important emotions, but would an analogous poster on the…",
  "data/reddit-ask/r/askscience/comments/shs145/covidflu_transmission_is_dont_touch_your_face.json": "Much of the public health messaging I see around COVID, Flu, and other common\nsicknesses emphasizes not touching your face with dirty hands. When I hear that,\nI hear \"don't touch your eyes, the inside of your nose, or your mouth\"/your\nmucous membranes. Is this right or is your cheek genuinely a…",
  "data/reddit-ask/r/NoStupidQuestions/comments/shws0a/is_the_us_just_stupidly_expensive_because_when.json": "I'm a student in Italy and I deliver pizza to make some bucks. My pay after tax\nis 7 € (7,9 $).\n\nI hear people complaining about 15$ an hour, maybe it's pre-tax or the US is\njust expensive af.\n\nBy living in italy my university expenses are really low, for an higher\neducation in a top 1% University…",
  "data/reddit-ask/r/AskHistorians/comments/shtqgl/the_1916_irish_proclamation_in_every_generation.json": "As above, the 1916 Proclamation invokes the 'rising in every generation' belief\nand claims 6 in the past 300 years. The 5 obvious ones seem the Confederate Wars\nof 1641, the United Irishmen of 1798, Robert Emmet in 1803, the Young Irelanders\nof 1848, the Fenians of 1867 (several of them are pushing…",
  "data/reddit-ask/r/NoStupidQuestions/comments/shxqhu/did_cavemen_know_to_pull_out.json": "A wet dark cave lit only by a fire. What else are you going to do in there than\nfuck? But would they know to pull out, when fucking for fun?",
  "data/reddit-ask/r/AskHistorians/comments/shyfjq/a_tweet_has_been_circulating_claiming_the_ussr.json": "In a few subreddits a screenshot has been posted saying that rents were capped\nat 4% of salary. This is generally used to contrast with rent costs in\npresent-day United States and other nations of the so-called \"Western Block\".\nWhile I can't find the original tweet, several others have made this…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/shsj0o/how_do_you_feel_like_you_are_a_certain_gender.json": "This has been a question that has been on my mind for quite some time so I'll\nguess I'll ask it here.\n\nHow does one \"feel\" as though they are male or female?\n\nMost humans have a sexual preference - e.g., straight, gay, bi etc. I get that.\nBut that doesn't necessarily change one's gender identity…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/si6k1t/should_i_feel_bad_because_i_genuinely_want_to.json": "I am a 16 years old male and I have always thought about having kids ever since\nI was young. I see so many people my generation talk about not wanting to have\nkids and it made me feel bad because I fell like the only one in my generation\nwho actually wants to have kids.\n\nOf course, I perfectly…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/shw3xx/why_is_it_that_muslims_calling_out_lgbt_people_is.json": "asking from personal experience. was nearly harassed by muslims for being part\nof LGBT and how it is bad. it was perfectly fine by them. and the other way\nround, by questioning their religion's values and ethics its Islamphobic.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/si5duy/is_it_bad_that_my_bf_says_this_during_sex.json": "I’m in my mid 20s and my bf is in his mid 30s. Sometimes during sex he’ll say “I\nlove fucking that tight young pussy” or something similar to it, and I could\ntell he gets off to that, and something about it makes me feel off. Should this\nbe something I should be concerned about? Or is it just…",
  "data/reddit-ask/r/AskWomen/comments/si5naw/women_who_thought_youd_lost_the_one_but_then.json": "Feeling a little heartbroken at the moment and need some hopeful stories.",
  "data/reddit-ask/r/NoStupidQuestions/comments/si85lj/i_got_fired_and_now_my_boss_is_withholding_my.json": "I got fired from my job two weeks ago. Long story. Now my boss who is also the\nowner of the business is telling me she won’t give me my last paycheck unless I\nsign some papers saying I quit. Obviously I don’t want to sign the papers\nbecause I want to collect unemployment and I didn’t quit. What can…",
  "data/reddit-ask/r/NoStupidQuestions/comments/sia77z/is_it_just_me_or_is_everyones_mental_health_at_an.json": "I have literally no motivation to get anything done rn. Not having a routine,\nnot meeting friends because of covid etc is really making me feel like I have\nnothing to live for. I seriously underestimated all the stuff I had going in my\nlife until now. Anyone else feeling the same?",
  "data/reddit-ask/r/AskHistorians/comments/shya88/do_we_have_evidence_of_how_humans_raised_babies.json": "All I hear nowadays is your baby should be eating solid foods by 6 months.. your\nbaby should be sitting up on their own by 8 months.. your newborn baby should be\nfed every 2-3 hours and sleep on their backs only.. etc But babies have somehow\nevolved from being strictly breastfed to, at some point,…",
  "data/reddit-ask/r/AskHistorians/comments/sibq2r/was_it_possible_to_prank_call_high_ranking_nazis.json": "I was just thinking, if you were in Nazi Germany in WWII, would it have been\npossible to make prank calls to members of the Reich government without being\ncaught? I mean, how would they ever realistically trace the call? Could I have\nphoned the Reich Chancellery in 1941, said something stupid like…",
  "data/reddit-ask/r/NoStupidQuestions/comments/si3knz/is_it_normal_to_not_be_able_to_eat_in_the_morning.json": "I have no appetite when I first wake up. Idk how people just wake up and eat a\nbig breakfast dude I have to be awake for a solid 2-3 hours before I can bring\nmyself to eat anything significant.\n\nI can wake up and drink water, juices, milk, etc. but not solid food for some\nreason. Don’t know why.",
  "data/reddit-ask/r/AskHistorians/comments/shu9yb/why_do_so_many_mid20th_century_american_recipes.json": "Spaghetti jello ring, jellied meatloaf, jello salad…Where did all these savory\njello recipes come from, and where did they go? Were there economic incentives\nto use gelatin as an ingredient? Was putting things in gelatin a novelty, or a\n“serious”/“normal” thing to do?",
  "data/reddit-ask/r/AskHistorians/comments/shyblu/what_is_the_historical_basis_for_why_most.json": "The Jewish high holidays (Yom Kippur, Rosh Hashanah) are expressly referenced in\nthe Tanakh, and my understanding is that there is some written evidence that\nJesus and the apostles celebrated the high holidays. I also understand that, on\nthis basis, certain Christian sects today do indeed promote…",
  "data/reddit-ask/r/AskHistorians/comments/si45g3/sławomir_rawicz_a_polish_officer_claimed_in_his.json": "I loved the book growing up, and recently found out there are questions about\nthe account. Wikipedia mentions another person, Witold Gliński, who claimed\nRawicz stole his story, but whose account also had holes. Apparently the son of\na British officer who was stationed in Calcutta also remembered…",
  "data/reddit-ask/r/NoStupidQuestions/comments/sigvad/as_a_girldo_you_ever_get_sad_that_you_have_never.json": "For context I’m a 20 year old female. Today as I was checking out my groceries I\nsaw a guy around my age buy roses and candies. The first things that went to my\nmind was how lucky the girl who will received them be. It’s not really jealousy\nbut more sadness. I’m not really crazy into the romantic…",
  "data/reddit-ask/r/askphilosophy/comments/shycmm/why_not_build_up_philosophy_like_math.json": "I'm a Math/Physics Student and in discussions I've always tried to pick a\n\"mathematical\" approach. Figure out what the differing axioms are between the\ntwo parties. And If I were to make an argument for i.e. the existence of god or,\nwell, any philosophical argument,\n\nI'd start with a number of…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/si2i4k/how_can_dads_abandon_their_kids_when_they_find.json": "I have seen many posts about husbands finding out their wives cheated on them\nand a child they have raised is not their blood. So the husband packs up and\nleaves. Now I understand, kind of, if the child is young. But how can you do\nthat if the child is a little older? You’ve spent your life and all…",
  "data/reddit-ask/r/NoStupidQuestions/comments/siihu3/doctors_swear_an_oath_to_do_no_harm_why_does.json": "This is mostly a USA question I suppose. The financial fallout from\nhospitalization has the ability to financially decimate nearly any lower to\nmiddle class person or family in this country. Such a financial hit can ruin\npeople, making them unable to live reasonably, forget financial…",
  "data/reddit-ask/r/AskHistorians/comments/sih39a/the_wikipedia_page_for_antónio_salazar_the.json": "This is a twofer! I want to know what are some better sources for learning about\nSalazar and the Estado Novo, and find out if it's feasible for the article\n[https://en.wikipedia.org/wiki/Ant%C3%B3nio_de_Oliveira_Salazar] to be improved.\n\nI don't know much about Salazar. I heard that he is revered…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/sim8me/how_tf_do_you_guys_manage_to_live_with_your_past.json": "Thank you guys for your advices. Seriously, from the bottom of my heart. I'll\nwork on myself from here and try to see things from another angle. Please, if\nyou still want to add something, do so, I'll be reading it",
  "data/reddit-ask/r/TooAfraidToAsk/comments/sijr7x/im_serious_if_you_can_biologically_engineer_your.json": "I'm sure we can all agree this is not science fiction anymore it's bound to\nhappen eventually",
  "data/reddit-ask/r/askscience/comments/sikrc2/how_do_spiders_produce_silk.json": "Obviously they don’t have a spool in their large rump, but is it like… just goop\ninside of them until they start pulling on it like a clown with an endless\nseries of handkerchiefs?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/sin47h/why_whoopie_goldberg_was_criticised_and_suspended.json": "I don't understand what was so controversial about her post. Jewish people are\ngenerally white. In fact you cannot tell them apart from an ordinary white folk\n- the way to tell if someone is Jewish is when they declare themselves as such.\nYou can also become a Jewish person by joining the…",
  "data/reddit-ask/r/NoStupidQuestions/comments/sil90b/why_is_being_jewish_a_religion_as_well_as_race.json": "I don't mean this question in any sort of mean spirited way, I'm just confused.\nI see talk of Judaism as a race of people. But isn't race more genetic oriented?\nYou can't \"convert' to being white, black, asian, etc. But you can convert to\nJudaism due to change in personal philosophy. Why is Judaism…",
  "data/reddit-ask/r/AskHistorians/comments/sir6uh/were_many_native_american_tribes_really_as.json": "Hello!\n\nRecently, I’ve been hearing a lot of reference to “two spirit” people as a\ngeneral term for genderfluid individuals in the native community historically.\nHowever, as a historian, I’ve found myself questioning a lot of the discourse on\nthe topic for multiple reasons\n\n1.) Many activists speak…",
  "data/reddit-ask/r/NoStupidQuestions/comments/siujvo/theres_a_polar_bear_outside_of_my_house_for_the.json": "I live in Alaska in the North, a bit isolated doing some experiments with native\nplants. Anyway, there's a damn polar bear outside and it just stares at my\nwindow and waits. TF am i supposed to do? I have guns, but i dont want to kill\nit (unless necessary).\n\nEdit:it's Knocking(banging) my door...…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/siof7q/its_bullying_in_the_usa_really_as_terrible_as_it.json": "Ok so... Well that. I mean in my country bullying is more \"no contact\" stuff\n(scream stuff, nicknames, making fun of someone, excluding people, mocking,\netc.) almost never physical (AKA punching, kicks etc.) but in the movies and\ninternet bullying in the USA it looks like prision stuff. Like for…",
  "data/reddit-ask/r/askscience/comments/sis3j2/what_exactly_are_tensors.json": "I recently started working with TensorFlow and I read that it turn's data into\ntensors.I looked it up a bit but I'm not really getting it, Would love an\nexplanation.",
  "data/reddit-ask/r/AskHistorians/comments/siqtn5/how_and_when_did_the_stereotypical_french_maid.json": "I realize these are essentially two questions (though I'm guessing it reached\nJapan after it was fetishized), but I'm not finding much believable information\non either, just unprofessional blogs with no citations. Any leads?",
  "data/reddit-ask/r/askscience/comments/sjaue2/do_comatose_people_sleep.json": "Sounds weird I know. I hear about all these people waking up and saying they\nwere aware the whole time. But is it the WHOLE time? like for example if I\nplayed a 24 hour podcast for a comatose person would they be aware the whole\ntime? Or would they miss 8 or so hours of it because they were…",
  "data/reddit-ask/r/AskWomen/comments/sj946v/women_how_did_you_spot_a_predatory_man_early.json": "Women how did you spot a predatory man early?",
  "data/reddit-ask/r/NoStupidQuestions/comments/sipkkf/best_fish_to_slap_someone_with.json": "What is the best type of fish to slap someone with? Taking into account\naffordability, damage, weight (for an average person to handle easily), etc",
  "data/reddit-ask/r/AskWomen/comments/sj6vcw/women_of_reddit_what_does_a_forehead_kiss_really.json": "Thank you for all the amazing responses. It seems the general theme is safety\nand comfort.",
  "data/reddit-ask/r/NoStupidQuestions/comments/sjdejw/is_it_easy_to_fool_child_protective_services.json": "My neighbors are drug addicts and they have 3 young little girls. They moved in\nunexpectedly because the mom lied and told the landlord that she fleeing a\ndomestic violence situation with her boyfriend and that he stole all of her\nstuff. I knew it was a lie because he helped her move into this…",
  "data/reddit-ask/r/NoStupidQuestions/comments/sjdiso/what_happened_to_sugar_cubes.json": "I feel like I always saw sugar cubes when I was a kid. At cafes, school,\ngrandparents house. But I feel like I haven't seen any in ages! What happened to\nthem? Did horses eat them all?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/sj8n6g/why_do_people_want_children.json": "As snarky as this might sound, it’s a genuine question; I seriously don’t\nunderstand. I was recently asked by an acquaintance if I had/wanted kids, to\nwhich I said no, but it got me thinking. I honestly just can’t think of a single\nway in which raising one or more kids sounds even remotely pleasant…",
  "data/reddit-ask/r/NoStupidQuestions/comments/sjg2dv/why_do_men_think_women_want_big_dicks.json": "i’ve always found it kind of dumb how guys think like this. the female vagina\nstretches out 5 inches and the average male penis is 5 inches. imagine trying to\nfit a 16 inch stick into a 5 inch hole in the ground. it wouldn’t work at all\nand would be very painful. and women who want big dicks has…",
  "data/reddit-ask/r/AskHistorians/comments/sjgal7/do_you_think_the_lost_dutchmans_gold_mine_ever.json": "I’ve Just read here [https://itshistoria.com/social-history/gold-mine/] that\nSince 1891, more than a hundred persons have claimed to have found the Lost\nDutchman Mine, which has been sought for more than a century. It's possible,\nhowever, did the mine ever exist, or was it the product of someone’s…",
  "data/reddit-ask/r/AskHistorians/comments/sjidzv/how_much_chinese_history_was_actually_lost_during.json": "I keep reading that an unfathomable amount of culture, history, knowledge was\nlost during the Chinese cultural revolution. Are there any numbers or\ncomparisons that would help me wrap my head around how big this loss really is?\nMaybe someone can reccomend some good reading?",
  "data/reddit-ask/r/NoStupidQuestions/comments/sjhiiw/should_a_woman_shoot_their_shot.json": "My mom told me (F22) growing up that if a man wants a woman, he'll let them\nknow. And asking a guy out just makes you look desparate. I guess I took it to\nheart. Both times I made moves towards crushes, it ended badly. The first time,\nI was 15 and the second time was yesterday.\n\nI feel so confused.…",
  "data/reddit-ask/r/NoStupidQuestions/comments/sjiy7z/what_is_fascism.json": "I see people throw around this word a lot and I’m honestly confused. I thought\nit meant corporations run the government or something like that. Which seems\nmore like our current system in the US. But I often see people comparing some\npublic figure as a fascist. And then the next step is calling…",
  "data/reddit-ask/r/NoStupidQuestions/comments/sj1xdv/why_more_girls_believe_in_astrology_as_compared.json": "Can't back it up with data. But have experienced it a lot in real life. I don't\nknow a single guy who knows which sign represents what but every fourth or fifth\ngirl I meet keeps mentioning it.",
  "data/reddit-ask/r/NoStupidQuestions/comments/sjmbq8/anyone_notice_that_comments_are_starting_to_show.json": "Not 'comment score below threshhold' or when there are a bunch of replies to one\npost, but top comments without any votes in either direction or even\nhighly-upvoted top comments show up as collapsed often now. I started to notice\nthis around when the new blocking rules were introduced so I wonder…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/sjvtwu/do_you_ever_wish_something_horrible_would_happen.json": "I’m not talking full on suicide, although those intrusive thoughts have weaseled\ntheir way into my head. I mean a car accident, terminal illness, or a freak\naccident. My life is going down the shitter and I just don’t know how I’m\nsupposed to keep up. I’m too bitch to actually take my own life. But…",
  "data/reddit-ask/r/askscience/comments/sjsq28/could_one_make_a_vaccine_to_train_ones_immune.json": "As opposed to markers of some virus or whatever. Have there been incidents of\npeople getting an autoimmune disease from vaccination trials?\n\n(obligatory: this is unrelated to covid, though perhaps the soreness from the\nbooster is encouraging this on my mind. Very pro-vaccine, I am just curious…",
  "data/reddit-ask/r/NoStupidQuestions/comments/sjyp9j/why_did_reddit_change_the_video_format.json": "It's conclusively a worse change, you have to now click on the video which\nenlarges it and then turn on the sound, then turn it off and then hit the back\nbutton ... WTF?? Why can't they just leave it alone?? You used to be able to\nscroll down to go back to the last screen but you can't even do that…",
  "data/reddit-ask/r/NoStupidQuestions/comments/sk00tc/does_anyone_else_take_their_phone_out_to_check.json": "Or am I just stupid?",
  "data/reddit-ask/r/askscience/comments/sjvxge/when_a_neuron_makes_a_new_connection_is_it.json": "I have been reading about neuron function, and really artificial neuron logic.\nFrom what I have read the cell takes inputs, does something and turns the output\noff or on. But what I am really struggling to find is when we say there is a new\nconnection or pathway in the brain, do the cells…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/sjbv93/why_do_horses_need_shoes_and_other_animals_dont.json": "I saw a video of someone refinishing a hoof and they sliced it like it was the\ninside of a goddamn coconut. What is the hoof made out of? Why does it slice so\neasily? Does it grate like parmesan?? If hooves need so much maintenance, do\nwild horses just walk around with deformed painful feet all the…",
  "data/reddit-ask/r/askscience/comments/sjxrj4/during_astronomical_night_how_much_solar.json": "On a moonless clear night (Sun is below 18° below the horizon and Moon is too\ndim / too deep below the horizon to cause any effect on the dark night sky), how\nmuch solar radiation (including IR, visible and UV) still reaches the ground?",
  "data/reddit-ask/r/NoStupidQuestions/comments/sk2g2k/is_this_offensive.json": "I am male, my friend is a woman. We were talking about pomegranate.\n\nFemale Friend: \"I have never had pomegranate but only ever heard about it being\nused by women to try to be skinnier\"\n\nMe: \"Lol I have never heard of that, although I have eaten pomegranate before so\nmaybe that is where my girlish…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/skda4h/how_did_fck_the_police_too_much_government.json": "Just a decade ago I remember people praising the Waco cult for making a last\nstand, ruby ridge for defending his property and glorifying killdozer for\nstanding up to the man. Now these types of people are the ones singing back the\nblue and all lives matter.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/skde3y/are_there_actually_people_out_there_how_live_that.json": "I am not even talking about being able to afford it (we all know SATC was\nunrealistic).\n\nI am talking about having the energy, the friends and the contacts to do that.\n\nAs a 20-something living in a big city I never get invited to fancy parties,\nclub openings or charity events. I wouldn't even know…",
  "data/reddit-ask/r/NoStupidQuestions/comments/skc1tv/does_reddit_think_every_single_person_who_is_nice.json": "Almost every single time I’ve just been a little bit nicer than everyone else to\na woman in here, I almost immediately get called a “white night” or a “simp…\n\nWhat gives?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/sjv2sn/how_would_a_zombie_apocalypse_be_a_threat_to.json": "I'm watching the walking dead and I'm just asking myself why there's so many\nzombies able to walk when clearly they're in a summer climate and the zombies\ndefinitely aren't embalmed.\n\nTbh the dead coming back to life would be the easiest crisis to manage of\nanything I can imagine",
  "data/reddit-ask/r/askscience/comments/skfjt8/if_cheetahs_were_extinct_would_palaeontologists.json": "And how well are we able determine the speed and mobility of other extinct\ncreatures?",
  "data/reddit-ask/r/AskHistorians/comments/sk4no4/why_did_roman_emperors_have_so_few_children.json": "Listening to the history of Rome, and really struck by the fact that patrilineal\nsuccession was so rare. Julius Caesar, one of the most famous men in history,\nhad no male heir. Compare this with someone like Genghis Khan.\n\n 1. Is it likely that Caesar had many illegitimate children, and nobody can\n…",
  "data/reddit-ask/r/NoStupidQuestions/comments/skhubg/why_does_the_kkk_have_ranks_that_sounds_like.json": "Is there a particular reason why they have ranks of Grand Wizard, Imperial\nWizard, Knight Hawk, Knights?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/skgbsd/how_do_you_shave_your_ass.json": "This question is quite embarrassing for me to ask, but how do you shave your\nass?\n\nLike, what tools do you use? How do you reach the ass-area? How do you know that\nyou're shaving in the \"right\" places when you can't see anything? Do you put\nsome kind of mirror or?\n\nThere are so many questions I'm…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/skinvj/whats_the_point_of_wearing_a_mask_into_a.json": "I’ve been having a hard time understanding this one, especially when it comes to\ndining out at restaurants. Restaurants will say they require the masks upon\nentry but then parties will stay at their tables “dining” close to 1-1.5 hours\nwithout a mask on (I put dining in quotes because more than 99%…",
  "data/reddit-ask/r/NoStupidQuestions/comments/skiksi/banning_books_in_the_us_is_against_the_first.json": "Was gonna post on TooAfraidToAsk but it wouldn’t let me."
}