{
  "data/reddit-stocks/r/Bogleheads/comments/t3ug05/why_are_so_many_younger_investors_drawn_to.json": "I see questions here all the time from first time investors and they almost\nuniversally mention Robinhood, Wealthfront, or M1 Finance instead of one of the\nold standbys: Vanguard, Fidelity, or Schwab.\n\nAre Robinhood/Wealthfront/M1 marketed at younger people or something? I can\nhonestly say that…",
  "data/reddit-stocks/r/wallstreetbets/comments/t3w282/ukraine_selling_war_bonds_not_the_usual_wsb.json": "https://news.yahoo.com/ukraine-to-auction-war-bonds-to-fund-armed-forces-173623142.html\n\nWe should see if we can name some tanks or bombs if we buy enough bonds!\n\nWhat would the Russian equivalent of Sum Ting Wong be?",
  "data/reddit-stocks/r/stocks/comments/t438zp/visa_mastercard_block_russian_financial.json": "> U.S payment card firms Visa and Mastercard have blocked multiple Russian\n> financial institutions from their network, complying with government sanctions\n> imposed over Moscow's invasion of Ukraine.\n> \n> Visa said on Monday it was taking prompt action to ensure compliance with\n> applicable…",
  "data/reddit-stocks/r/investing/comments/t44pro/ukraine_supplies_70_of_the_worlds_neon_chip.json": "Again, the world's major chip and semiconductor companies are watching the\nconflict closely as the Russian invasion of Ukraine will likely hamper the\nsupply of neon.\n\nNeon is used in lithography to make microchips.\n\nCurrently it appears the larger chip manufacturers have plenty in reserve but\nare…",
  "data/reddit-stocks/r/Bogleheads/comments/t47u97/maintain_discipline_during_uncertainty_vanguard.json": "> Hello. I’m Tim Buckley, Vanguard’s CEO.\n> \n> Recent events have added a new dimension of risk to the markets.\n> \n> Beyond the very real human cost, the invasion of Ukraine by Russian forces has\n> resulted in increased market volatility and significant sanctions. Further\n> economic costs in the…",
  "data/reddit-stocks/r/Bogleheads/comments/t47s66/bogleheads_on_investing_podcast_hits_1000000.json": "Happy to announce my podcast: \"Bogleheads on Investing\" has hit a milestone of\n1,000,000 downloads! Thank you! The latest guest is Eduardo Repetto, Ph.D.,\n[https://bogleheads.podbean.com/e/episode-043-eduardo-repetto-on-factor-investing-host-rick-ferri/]CIO\nof Avantis and former CIO and CEO of…",
  "data/reddit-stocks/r/stocks/comments/t3ybdp/tsm_taiwanese_semiconductor.json": "This stock was ATH in mid January 2022 then started dipping, I am assuming, due\nto sentiment that China will get inspired by Russia and invade Taiwan. It's now\ndown 25% and all 2021 gains have been wiped out. What do you think? Buy the dip?",
  "data/reddit-stocks/r/wallstreetbets/comments/t3wmgz/canada_to_supply_antitank_weapons_to_ukraine_ban.json": "https://www.reuters.com/world/canada-foreign-minister-says-more-sanctions-coming-against-russia-2022-02-28/\n\nCanada imports a little of Russian oil. But just like the sanctions, I can see\nthis catapulting to other countries. This’ll cause gas prices to rocket slowly.\n\nWhat oil companies or etfs are…",
  "data/reddit-stocks/r/stocks/comments/t4898g/tell_me_why_i_am_crazy_to_think_oil_will_easily.json": "I believed every article weeks ago when it said we will hit $100 a barrel. I\nalso believe the ones that say we will pass $120 a barrel. Tbh $200 a barrel\nwith everything going on right now in Ukraine is not out of the question. Many\ndays ago I posted somewhere about buying OILU shares. I am buying…",
  "data/reddit-stocks/r/Bogleheads/comments/t4baxt/just_invested_300k_in_vtsax.json": "I’m freaking out and feeling liberated at the same time (was a windfall I’ve had\nfor a month; held while researching). Net worth is about 450K now, still in my\n20s.\n\nVXUS is 20% of my portfolio. Thinking of balancing 80% domestic / 20%\ninternational, but feedback is always welcome",
  "data/reddit-stocks/r/stocks/comments/t4cqtd/russia_to_spend_up_to_103b_to_buy_shares_in.json": "Russia not throwing in the towl yet. Plans to do a substantial buy on the market\n(when it opens).\n\n\"March 1 (Reuters) - The Russian government has ordered the finance ministry to\nchannel up to 1 trillion roubles ($10.3 billion) from the National Wealth Fund\nto buy shares in Russian companies, a…",
  "data/reddit-stocks/r/stocks/comments/t4arvf/intc_insiders_have_purchased_additional_shares.json": "INSIDER ACTIVITY ALERT\n\nIntel CEO Pat Gelsinger and Chairman Omar Ishrak were part of a group of\ninsiders who bought stock when it dipped in late October. Last week, both men\nbought more Intel stock as shares edged lower.\n\nOn Tuesday, Gelsinger paid $247,890 for 5,600 shares, a per-share average…",
  "data/reddit-stocks/r/stocks/comments/t4haa9/apple_pay_and_google_pay_no_longer_work_on.json": "> It has been reported that Apple Pay and Google Pay are no longer working for\n> Russians [https://www.buzz.ie/all-about/russia] as they attempt to use\n> Moscow’s metro system.\n> \n> This news comes as Western nations agreed to block some Russian banks from the\n> Swift international payment system,…",
  "data/reddit-stocks/r/stocks/comments/t4gjmf/russia_have_suspended_trading_on_moex_throughout.json": "Doing everything they can to reduce damage lol\n\nMeanwhile, the Moscow Stock Exchange, Russia’s largest exchange group with some\n200 stock listings, remained closed Tuesday, after the nation’s central bank\nannounced it would halt stock trading through Saturday as it “assesses the\nfeasibility” of…",
  "data/reddit-stocks/r/investing/comments/t4iokb/apple_stops_all_product_sales_in_russia_as_rt_and.json": "Apple has paused all product sales in Russia in response to the invasion of\nUkraine.\n\nThe tech company said it has also limited Apple Pay and other services in\nRussia, and that it has removed state-backed news outlets RT and Sputnik from\nits App Store in other countries.\n\nIn a statement, Apple…",
  "data/reddit-stocks/r/wallstreetbets/comments/t49bfw/wake_up_honey_new_pelosi_financial_disclosure.json": "Here's a link\n[https://disclosures-clerk.house.gov/public_disc/ptr-pdfs/2022/20020515.pdf] to\nthe disclosure. Pelosi exercised:\n\n * Up to $5M in call options in $AAPL\n * Up to $5M in call options in $DIS\n * Up to $1M in call options in $PYPL\n * Up to $500K in call options in $AXP\n\nand put up to…",
  "data/reddit-stocks/r/stocks/comments/t44y9z/rstocks_daily_discussion_technicals_tuesday_mar.json": "This is the daily discussion, so anything stocks related is fine, but the theme\nfor today is on technical analysis (TA), but if TA is not your thing then just\nignore the theme and/or post your arguments against TA…",
  "data/reddit-stocks/r/stocks/comments/t4d94w/goodrx_shares_fall_over_35_to_a_record_low_after.json": "GoodRx Stock Is Plunging to a Record Low. Its Earnings Were That Bad.\n\nhttps://www.barrons.com/articles/goodrx-stock-price-earnings-51646088690\n\nHighlights from their earnings report:\n\n> For the quarter, GoodRx posted revenue of $213.3 million, up 39% from a year\n> earlier, but below the Street…",
  "data/reddit-stocks/r/wallstreetbets/comments/t4jaji/this_is_vladimir_putin_my_dd_on_ukraine.json": "So, the last few months during Covid I've been isolated, being alone with hazmat\nsuit on big mansion with kilometric tables got me lot of time to think and I've\ncome with a brilliant plan.\n\n\n\nDo you know this country?\n\n\n\nCrimea 100%…",
  "data/reddit-stocks/r/stocks/comments/t4nx6s/flashback_to_cathie_wood_in_2020_i_believe_that.json": "Oil demand probably hit a secular peak last year and, thanks to #EV's, now is in\nsecular \"decline\".\n\nFrom her tweet on 2020 07-15 (not sure I can post tweets on here? I'll do it on\nreply)\n\n\"EV's\" was the biggest sham in 2020-2021. Yes they are coming, no oil will be\nnever be taken over when…",
  "data/reddit-stocks/r/wallstreetbets/comments/t4l4z7/hey_you_retard_yeah_you_retail_owns_90.json": "https://i.redd.it/lh7ewcn4ruk81.gif\n\nLt. Popcorn Retard here reporting for duty to spread the good word of the\nlatest:\n\nEarnings boring report:\nhttps://finance.yahoo.com/news/amc-earnings-201950084.html\n\nPopcorn stock earnings call update highlights:\n\n\n\n> CEO of AMC confirms over 4 million…",
  "data/reddit-stocks/r/stocks/comments/t4nvc4/sofi_earnings.json": "> Shares of SoFi were soaring 14% in after-hours trading Tuesday after the\n> financial-technology company exceeded expectations with its earnings outlook.\n> \n> SoFi recorded a fourth-quarter net loss of $111.0 million, or 15 cents a\n> share, whereas it recorded a net loss of $82.6 million, or $1.85…",
  "data/reddit-stocks/r/wallstreetbets/comments/t4df2e/how_to_make_115x_return_easy.json": "Guys, I just found out ONE USD is actually worth 115 RUBLES! If I take $1, I can\ntransform that into 115 other money - in case you missed it, that's a 115 times\nreturn. And it just keeps getting better and better by the hour!\n\nAnyway, I gotta peace out. Bought to take a mortgage out on my home to…",
  "data/reddit-stocks/r/Bogleheads/comments/t4tzao/jack_story.json": "I was at a Boglehead event a few years back, “near Philly,” it was my second\ntime attending and I had realized by then why people were so excited when Jack\nattended. Anyway this year he had a little book signing so I got in line with my\nbook (a few years prior, I found the way people acted around…",
  "data/reddit-stocks/r/wallstreetbets/comments/t4ljrd/amc_90_float_owned_by_retail.json": "AMC earnings call revealed 90% of the float is held by retail investors. The\nnumber is roughly 4 million holders. Same from a year ago. AMC apes are not\nleaving…The only way a price can drop like it does on tickers like AMC and GME\nis naked shorting and routing a majority of orders through dark…",
  "data/reddit-stocks/r/wallstreetbets/comments/t4lwvr/nike_pulling_products_from_foot_locker.json": "After Nike pulled products from Foot locker in a move to go directly to\nconsumer, rumors have been floating they might pull Dicks out as well.\n\nFoot locker plunged 35% on the news, so needless to say I’m #ShortDicks",
  "data/reddit-stocks/r/wallstreetbets/comments/t4ydnt/dont_go_into_russian_stocks.json": "Fellow apes, please do yourself a favor and don't even consider buying the dip\nof Russian stocks.\n\nOn the London Stock Exchange, equities like Gazprom, Sberbank, Lukoil etc.\nalready went to zero (literally -99.9%) trading at a few cents a share.\n\nInvestors are unloading the shares as pressure rises…",
  "data/reddit-stocks/r/stocks/comments/t50qdr/fed_chair_powell_notes_highly_uncertain_ukraine.json": "https://www.cnbc.com/2022/03/02/fed-chair-powell-notes-highly-uncertain-ukraine-impact-but-says-rate-hikes-are-still-coming.html\n\nFederal Reserve Chairman Jerome Powell still sees interest rate hikes coming,\nbut noted Wednesday that the Russia-Ukraine war has injected uncertainty into\nthe…",
  "data/reddit-stocks/r/stocks/comments/t4ugqo/eli5_should_i_buy_the_dip_now_or_wait_until_feds.json": "Basically the title. I am having a dilemma on whether I should buy the dip now\nor wait for feds announcement regarding rates change. I am having a hunch that\nthe market will price instantly the moment feds announcements are out. Do you\nthink so? Why or why not? Please state your argument for or…",
  "data/reddit-stocks/r/stocks/comments/t4zkeg/ukraine_and_russia_to_have_second_negotiation.json": "Hope they came to some positive conclusion for our own and the market sake.\n\nDow, S&P and Nas futures are all positive so hope this stays this way today.\n\nAlso no suprise but \"China will not join sanctions against Russia, banking\nregulator says\"\n\nhttps://www.cnbc.com/2022/03/02/china-will-not-join…",
  "data/reddit-stocks/r/stocks/comments/t535ap/rivian_hikes_the_base_price_of_its_quadmotor_r1t.json": "> Rivian has raised the original $67,500 base price of its quad-motor R1T\n> electric pickup with large battery packs to $79,500 (sans destination\n> charges). That's a whopping $12,000 increase that will apply to most\n> reservation holders except for those in the very final stages of purchase. The\n>…",
  "data/reddit-stocks/r/investing/comments/t4xjxw/sberbank_shares_how_screwed_am_i.json": "Question - Sberbank ADR (the largest Russian bank) is trading at $0.01 on the\nLondon stock exchange (symbol SBER) but listed at $1.00 on the OTC markets\n(SBRCY). Do the shares represent shares in the European subsidiary or something\nthat just went bankrupt? Is either price accurate? Just wondering…",
  "data/reddit-stocks/r/investing/comments/t53ubi/us_interest_rates_are_headed_higher_very_soon_to.json": "US Central Bank is going to raise interest rates later March.\n[https://www.msn.com/en-us/money/markets/powell-says-rates-are-headed-higher-even-as-ukraine-poses-uncertainty/ar-AAUvThI?ocid=msedgdhp&pc=U531]\n\nFeds will move toward a “predictable” shrinking of its big bond holdings after\nraising…",
  "data/reddit-stocks/r/wallstreetbets/comments/t51xk5/should_we_allow_russian_ultrarich_billionaires_to.json": "The 21 ultra-rich Russians among the world’s 500 wealthiest people have lost a\ncombined $83 billion in 2022, according to the Bloomberg Billionaires Index.\n\nThe biggest loss porn is credited to Vaget Alekperov, chairman of energy titan\nLukoil, who has lost $13 billion and “only” $6 billion left.",
  "data/reddit-stocks/r/stocks/comments/t56bte/us_stocks_rebound_as_powell_says_he_supports_25.json": "Fed Chairman Jerome Powell on Wednesday said the central bank intends to raise\nits policy interest rate by a quarter-percentage point following the end of its\ntwo-day meeting on March 16, despite uncertainties from the Russian invasion of\nUkraine.\n\n“With inflation well above 2% and a strong labor…",
  "data/reddit-stocks/r/stocks/comments/t55b6i/crude_hits_a_high_of_11251_a_barrel_overnight.json": "Even though yesterday the US and other nations would release 60m barrels\n[https://www.wsj.com/articles/u-s-iea-agree-to-release-60-million-barrels-from-oil-stockpiles-amid-ukraine-turmoil-11646151424]\nto counter high prices and, arguably, helped bring prices as low as $103, crude\noil continued to…",
  "data/reddit-stocks/r/Bogleheads/comments/t53qu2/how_and_where_do_i_receive_dividends.json": "Just purchased VTI and want to make sure I am putting the dividends back into\nit.\n\nIs this something i have to do manually?\n\nI use Fidelity",
  "data/reddit-stocks/r/Bogleheads/comments/t50qtc/the_bogleheads_conference_is_back_in_2022.json": "Mark you calendars for October 12-14.\n\nConference information\n[https://www.bogleheads.org/forum/viewtopic.php?f=10&t=371810]",
  "data/reddit-stocks/r/stocks/comments/t575io/closing_rivn_puts.json": "Two months ago I decided to go short on Rivian stock. RIVN was trading at around\n$85 when I made the decision. As such, I have been heavily buying RIVN puts.\n\nI've bought and have been adding to RIVN $70 Jan2023 puts. My profit as of today\nis approximately $32k, about 48% of the book cost.\n\nThis is…",
  "data/reddit-stocks/r/stocks/comments/t5c0ro/which_stocks_do_you_think_will_never_see_their.json": "So the intention of this post is to talk about which companies will never reach\ntheir All-Time High stock prices\n\n\n\nFor me personally, I think that Peloton is a good shout. Peloton's all-time high\nstock price was $172, which gave the company a Market Cap of over $60 Billion at\ntheir peak. I believe…",
  "data/reddit-stocks/r/Bogleheads/comments/t5ftd1/which_fidelity_index_funds_to_choose_for.json": "Only recently I (male 47) came to know of index funds.\n\nI have around 400K to invest and thinking of investing in some fidelity funds\nwith low expense ratio. Since I have a fidelity account for 401k in thinking of\ninvesting in fidelity index funds since it'll have low expense ratio.\n\nIf it was you,…",
  "data/reddit-stocks/r/stocks/comments/t5gaej/credit_suisse_asks_investors_to_destroy_documents.json": "Came upon this article over at r/Switzerland [/r/Switzerland] from poster\nu/ubley [/u/ubley]. In short Credit Suisse off loaded packaged loans to hedge\nfunds, which means there’s some counterparty risk. How long oligarchs continue\nto make payments in billions worth of toys they can’t touch remains…",
  "data/reddit-stocks/r/Bogleheads/comments/t5givc/i_understand_vt_is_basically_a_mix_of_vti_vxus.json": "https://imgur.com/a/mMnfkKR",
  "data/reddit-stocks/r/wallstreetbets/comments/t5c6t8/its_only_a_matter_of_time_before_the_russian.json": "Maybe you care about the war in Ukraine or maybe you don't.\n\nJust putting it out there, in case anyone cares.\n\nIt's just a matter of time before the Russian trollfarms will put two and two\ntogether and try to make reddit smoothbrains buy Russian shit.\n\nThis is not financial advice etc. etc.",
  "data/reddit-stocks/r/wallstreetbets/comments/t526h2/oil_is_about_to_go_through_the_damn_ceiling.json": "I think oil will hit a minimum of $130 a barrel and lead to $5-6 a gallon at the\npump.\n\nSource: I work in oil and gas and have extensive market knowledge and we are\nfucked.\n\nSmall position because my wife doesn’t let me put more in:\nhttps://imgur.com/gallery/PAvljCG",
  "data/reddit-stocks/r/stocks/comments/t5felj/never_sell_stocks_you_own_or_want_to_own.json": "Disclaimer: By “never,” I don’t mean absolutely never. Obviously, companies can\nchange, and should something change that gives us good reason to sell rather\nthan hold, we should sell. That being said, are there any stocks you “never”\nplan to sell that you’re either holding or really want to buy?\n\nI…",
  "data/reddit-stocks/r/investing/comments/t55y7q/are_interest_rate_increases_priced_in.json": "I know there are increases planned for this year. This month will see some, and\nlikely more throughout ‘22 to combat inflation.\n\nBecause it is so clear that this is necessary, would it also not stand to reason\nthat big money/smart money has already priced this in to the markets?\n\nObviously, I’m not…"
}