{
  "data/reddit-ask/r/AskHistorians/comments/npvtx2/qin_and_zhao_mobilised_up_to_a_million_men_in.json": "Qin and Zhao mobilised up to a million men in ChangPing, and the battle ended with a casualty exceeding 50% of the size of the armies engaged. How is it possible that the production level and logistics in 260BC could support a battle in such scale?",
  "data/reddit-ask/r/AskHistorians/comments/npxb0w/testing_period_of_rules_change_no_exampleseeking.json": "Testing Period of Rules Change: \"No Example-Seeking\" will not be enforced for the next month",
  "data/reddit-ask/r/AskHistorians/comments/nq1pwy/i_was_doing_some_research_on_american_recipes.json": "I was doing some research on American recipes from the 1700s, and mostly what I found is an insane number of recipes for beer... including \"children's beer\" and \"breakfast beer.\" When did our modern idea that alcohol is only appropriate for certain people at certain times of day appear?",
  "data/reddit-ask/r/AskHistorians/comments/nq7gze/why_are_greekroman_ruins_so_much_better_preserved.json": "Why are Greek/Roman ruins so much better preserved than Persian?",
  "data/reddit-ask/r/AskHistorians/comments/nqlq0g/are_there_any_historical_figures_who_were_thought.json": "Are there any historical figures who were thought to be two distinct historical figures but were actually the same person? Simialir to Otto Braun and Li De.",
  "data/reddit-ask/r/AskHistorians/comments/nqmbfd/when_did_samhain_become_popularly_known_as.json": "When did Samhain become popularly known as \"Halloween\", and why?",
  "data/reddit-ask/r/AskHistorians/comments/nqn4fh/repost_as_per_mod_suggestions_were_there.json": "Repost as per mod suggestions: were there antimaskers during the Spanish flu of 1918, and if so what kind of rhetoric did they employ?",
  "data/reddit-ask/r/AskHistorians/comments/nqny7g/who_was_the_gentleman_who_stands_outside_the.json": "Who was 'the gentleman who stands outside the cinema' in early 20th-Century Britain?",
  "data/reddit-ask/r/AskHistorians/comments/nqq21z/what_was_the_process_to_reintegrate_newly.json": "What was the process to reintegrate newly liberated Holocaust victims back into society?",
  "data/reddit-ask/r/AskHistorians/comments/nqv7cl/a_1944_comic_in_which_lex_luthor_uses_an_atomic.json": "A 1944 comic in which Lex Luthor uses an atomic bomb was delayed until 1946 upon request by the War Department to protect the secrecy of the Manhattan Project. How would the US government know what comic storylines were in the works?",
  "data/reddit-ask/r/AskHistorians/comments/nr3vaw/what_were_some_notable_or_interesting_conspiracy.json": "What were some notable or interesting conspiracy theories or misinformation campaigns of the past?",
  "data/reddit-ask/r/AskHistorians/comments/nr8qo8/why_are_chinese_dynasties_not_named_after_the.json": "Why are Chinese dynasties not named after the actual dynasties that ruled them? For example, the Ming dynasty was ruled by the Zhu family, why is it not the Zhu dynasty?",
  "data/reddit-ask/r/AskHistorians/comments/nrca05/why_were_the_27th_army_group_killing_other_army.json": "Why were the 27th Army Group killing other Army Groups/Police at Tiananmen Square?",
  "data/reddit-ask/r/AskHistorians/comments/nrclng/where_does_the_idea_that_poverty_is_a_moral.json": "Where does the idea that poverty is a moral failing come from?",
  "data/reddit-ask/r/AskHistorians/comments/nrho2x/the_rise_of_nazi_germany_is_often_blamed_on_the.json": "The rise of Nazi Germany is often blamed on the conditions created after Germany's defeat in WWI. However, Italy was on the winning side of WWI, yet was the first country where fascism took hold. What caused the rise of/support of fascism in interwar Italy?",
  "data/reddit-ask/r/AskHistorians/comments/ns5e22/its_some_time_between_18301860_and_im_a_white.json": "It's some time between 1830-1860 and I'm a white male who wants to travel alone with my horse throughout the American west. How truly dangerous would my travels be?",
  "data/reddit-ask/r/AskHistorians/comments/nseqms/from_1876_to_1916_the_two_main_spanish_political.json": "From 1876 to 1916 the two main Spanish political parties alternated terms in offices by agreeing election results in advance. How did the system come about and stay stable? Were they any party differences? How was this enforced at a local voter level?",
  "data/reddit-ask/r/AskHistorians/comments/nsg6un/did_the_90_of_the_roman_empires_population_who.json": "Did the 90% of the Roman Empire's population, who were poor subsistence farmers, get to enjoy running water, amphitheaters, and the other luxuries the empire is famous for?",
  "data/reddit-ask/r/AskHistorians/comments/nst3ag/world_war_1_forts_such_as_at_liege_or_verdun_were.json": "World War 1 forts, such as at Liege or Verdun, were vast underground structures, but above ground they look to be just a dome with one to two guns therein. Why were these structures with seemingly limited firepower considered “impassable” against the enormity of passing armies?",
  "data/reddit-ask/r/AskHistorians/comments/nsxmcf/why_is_south_africa_the_only_african_country_with.json": "Why is South Africa the only African country with a large white population?",
  "data/reddit-ask/r/AskHistorians/comments/nt116i/how_much_ancient_history_is_lost_forever_simply.json": "How much ancient history is lost forever simply because it was made of wood?",
  "data/reddit-ask/r/AskHistorians/comments/nt3l5t/shakespeare_wrote_hamlet_and_had_a_son_called.json": "Shakespeare wrote Hamlet and had a son called Hamnet. What's up with that?",
  "data/reddit-ask/r/AskHistorians/comments/nt4a33/did_prince_phillip_have_an_affair_while_visiting.json": "Did Prince Phillip have an affair while visiting Vanuatu as depicted in the show The Queen?",
  "data/reddit-ask/r/AskHistorians/comments/nt4qj1/what_drove_printing_press_makers_to_include_the.json": "What drove printing press makers to include the letters they commonly did ( like 'q' and 'x' but not 'þ' and 'ß')?",
  "data/reddit-ask/r/AskHistorians/comments/nt9vd3/when_the_aztecs_found_teotihuacan_they_didnt_know.json": "When the Aztec's found Teotihuacan they didn't know who built it or why but moved in and made the abandoned complex their own. Is this true and, if so, what other examples are there of \"ancient\" civilizations claiming ruins they knew very little about for their own purposes?",
  "data/reddit-ask/r/AskHistorians/comments/ntcbl5/why_would_a_grave_in_rural_vermont_be_surrounded.json": "Why would a grave in rural Vermont be surrounded by chains?",
  "data/reddit-ask/r/AskHistorians/comments/ntjlj4/how_did_the_name_lucifermeaning_lightbringer.json": "How did the name “Lucifer”(meaning “Lightbringer”), originating from Roman Folklore as the name for the planet Venus, become the name of the biblical Devil aka Satan?",
  "data/reddit-ask/r/AskHistorians/comments/ntk1fw/new_snoo_sunday_introducing_juana_asnoorduy_snoo.json": "New Snoo Sunday: Introducing Juana Asnoorduy, Snoo Masekela, and Snookel of Hameln",
  "data/reddit-ask/r/AskHistorians/comments/ntugdr/how_did_the_british_biscuit_become_an_american.json": "How did the British \"biscuit\" become an American \"cookie\", and why is the American \"biscuit\" more similar to a British \"scone\"?",
  "data/reddit-ask/r/AskHistorians/comments/nu4ges/since_potatoes_have_not_been_discovered_yet_what.json": "Since potatoes have not been discovered yet, what was the starch used in \"traditional\" cooking before potatoes say 1540 in England?",
  "data/reddit-ask/r/AskHistorians/comments/nu7c4e/why_did_nearly_all_of_the_worlds_civilisations.json": "Why did nearly all of the world's civilisations emerge so soon after each other",
  "data/reddit-ask/r/AskHistorians/comments/nue09r/its_europe_in_the_14th_century_and_war_is_raging.json": "It's Europe in the 14th century and war is raging. I walk into a military camp, storm into the medieval version of a CO's tent, and start barking orders, claiming to be their liege. Do they have security in place to verify if I am in fact the king, and whether or not my orders should be followed?",
  "data/reddit-ask/r/AskHistorians/comments/nuhzex/between_1880_and_world_war_ii_coney_island_had_a.json": "Between 1880 and World War II, Coney Island had a huge amusement park industry, attracting several million visitors a year. But by 1964 the last park had closed. With such a large local audience and consistent demand, what killed the amusement parks?",
  "data/reddit-ask/r/AskHistorians/comments/nun2k9/how_common_would_knowledge_of_spaghetti_be_in.json": "How common would knowledge of spaghetti be in 1899 USA?",
  "data/reddit-ask/r/AskHistorians/comments/nuw3wt/in_the_sherlock_holmes_stories_holmes_and_watson.json": "In the Sherlock Holmes stories, Holmes and Watson keep addressing each other by their surnames, even after decades of friendship. Was this typical etiquette in Britain at the time?",
  "data/reddit-ask/r/AskHistorians/comments/nuz38g/how_did_nations_during_the_height_of_naval.json": "How did nations, during the height of naval warfare in the 17/18th century, contact ships at sea about changes in diplomatic status with other countries?",
  "data/reddit-ask/r/AskHistorians/comments/nv5rcr/two_of_my_favorite_movies_the_kings_speech_and.json": "Two of my favorite movies, “The King’s Speech” and “Darkest Hour”, paint very different pictures of the relationship between Winston Churchill and King George VI",
  "data/reddit-ask/r/AskHistorians/comments/nvj04f/is_there_a_working_theory_for_how_ancient.json": "Is there a working theory for how Ancient Egyptian Mummies tested positive for Cocaine and Nicotine?",
  "data/reddit-ask/r/AskHistorians/comments/nvjqln/in_the_united_states_especially_among.json": "In the United States, especially among conservatives, College is seen as a liberal institution that radicalizes it's students turning them into \"socialists\" and \"Communists\". Did societies before the modern era hold a similar view of higher education as \"radicalizing\"?",
  "data/reddit-ask/r/AskHistorians/comments/nvtg47/did_the_catholic_church_speak_out_against_the.json": "Did the Catholic Church speak out against the fascist governments of Italy and Nazi Germany or make any attempt to help Jewish people during the holocaust?",
  "data/reddit-ask/r/AskHistorians/comments/nvv0x1/dostojewskijs_crime_and_punishment_contains_many.json": "Dostojewskij's \"Crime and Punishment\" contains many instances where characters speak negatively about Germans (describing them e.g. as stupid, greedy, etc.). Was this typical for Russians of this time period and what where reasons for this?",
  "data/reddit-ask/r/AskHistorians/comments/nvygz0/when_did_99_pricing_become_ubiquitous.json": "when did .99 pricing become ubiquitous?",
  "data/reddit-ask/r/AskHistorians/comments/nvz3ap/why_is_judy_garland_regarded_as_a_gay_icon_when.json": "Why is Judy Garland regarded as a gay icon when she wasn't part of the LGBT community?",
  "data/reddit-ask/r/AskHistorians/comments/nw05pj/im_a_nobleman_in_france_in_1793_in_the_midst_of.json": "I'm a nobleman in France in 1793, in the midst of the terror. Assuming that I give up my titles, profess loyalty to the ideas of the revolution, don't get entangled in politics and generally keep a low profile, will my chances of survival if I stay in the country be decent?",
  "data/reddit-ask/r/AskHistorians/comments/nw4z28/when_did_a_few_seconds_of_harp_music_become.json": "When did a few seconds of harp music become associated with dreaming or memories?",
  "data/reddit-ask/r/AskHistorians/comments/nw7r1f/the_mt_vernon_website_lists_at_least_one.json": "The Mt. Vernon website lists at least one transaction of George Washington \"purchasing\" teeth from enslaved people on his estate. Was this practice common between slave-owners and their slaves and was it done as \"voluntarily\" as the website would lead one to believe?",
  "data/reddit-ask/r/AskHistorians/comments/nwc23c/historians_who_specialize_in_early_american.json": "Historians who specialize in early American history, where would you look for information on a house built in southern Ohio between 1804 and 1828?",
  "data/reddit-ask/r/AskHistorians/comments/nwemge/did_some_early_american_settlers_abandon_their.json": "Did some early American settlers abandon their colonies to live among the Native American populations?",
  "data/reddit-ask/r/AskHistorians/comments/nwicge/gonzalo_guerrero_was_shipwrecked_and_then.json": "Gonzalo Guerrero was shipwrecked and then captured by the Maya in 1511; when found by other Spaniards about 20 years late, he had been made a warlord and refused to return to Spain. Why would the Maya make a low-born European sailor a warlord?",
  "data/reddit-ask/r/AskHistorians/comments/nwn6ga/given_strong_mongol_taboos_around_blood_and_the.json": "Given strong Mongol taboos around blood and the body, what was battlefield medical care like for Genghis Kahn and his successors",
  "data/reddit-ask/r/AskHistorians/comments/nx0ckm/im_an_average_peasant_farmer_in_16th_century.json": "I’m an average peasant farmer in 16th century England, what is my understanding of simple mathematics?",
  "data/reddit-ask/r/AskHistorians/comments/nx3l6v/how_popular_was_jane_austen_books_when_they_came.json": "How popular was Jane Austen books when they came out?Did men read them too or was it seen as something that only women read?",
  "data/reddit-ask/r/AskHistorians/comments/nx3z8b/what_were_napoleonic_war_veterans_opinions_about.json": "What were Napoleonic war veterans opinions about Napoleon iii rise to power?",
  "data/reddit-ask/r/AskHistorians/comments/nx5znk/are_the_stories_of_a_society_a_reflection_of_its.json": "Are the stories of a society a reflection of its morals?",
  "data/reddit-ask/r/AskHistorians/comments/nx6d60/why_was_switching_rations_from_wheat_to_barely_an.json": "Why was switching rations from wheat to barely an effective punishment for a Roman soldier?",
  "data/reddit-ask/r/AskHistorians/comments/nxds21/how_did_american_emigrees_in_19101950s_europe_get.json": "How did American emigrees in 1910-1950s Europe get permission to live in Europe?",
  "data/reddit-ask/r/AskHistorians/comments/nxi8ms/was_genghis_khans_mongolia_actually_safe_to_travel.json": "Was Genghis Khan's Mongolia actually safe to travel?",
  "data/reddit-ask/r/AskHistorians/comments/nxmei0/was_there_any_resistance_to_the_rationing_that.json": "Was there any resistance to the rationing that took place in the United States during and after WWII?",
  "data/reddit-ask/r/AskHistorians/comments/nxmilq/its_1820_and_ive_just_been_elected_to_the_us.json": "It’s 1820 and I’ve just been elected to the US congress from Georgia. How do I go about actually claiming my seat? Without photo ID, how can I prove to anyone in Washington that I really am the new congressman?",
  "data/reddit-ask/r/AskHistorians/comments/nxqxdv/why_was_the_us_army_so_stingy_with_awarding_the.json": "Why was the US Army so stingy with awarding the rank of (full) General before WW2?",
  "data/reddit-ask/r/AskHistorians/comments/nxr1p2/the_last_emperor_was_filmed_in_beijing_in_the_the.json": "\"The Last Emperor\" was filmed in Beijing in the the 1980s, and has a scene that portray the Cultural Revolution and the Red Guards in a decidedly negative light. Why was this permitted by the Chinese authorities at the time?",
  "data/reddit-ask/r/AskHistorians/comments/nxvovr/how_would_a_medieval_banker_guarantee_that.json": "How would a medieval banker guarantee that powerful clients such as a kings would repay their loans?",
  "data/reddit-ask/r/AskHistorians/comments/ny261y/how_did_skinhead_culture_got_hijacked_by_racists.json": "How did skinhead culture got hijacked by racists in the UK, 1970s?",
  "data/reddit-ask/r/AskHistorians/comments/nyg5b0/traditional_english_food_is_stereotyped_as_bland.json": "\"Traditional\" English food is stereotyped as bland and unhealthy. But I've heard the popularity of this style of food is a consequence of rationing in WWI and WWII. What was home English cooking like in the 1890s-1900s? Did WWI/WWII change it?",
  "data/reddit-ask/r/AskHistorians/comments/nyjycq/why_did_the_title_caesar_survive_and_evolve_into.json": "Why did the title Caesar survive and evolve into the German kaiser and Russian tsar but not the title of Augustus which was the higher ranking title?",
  "data/reddit-ask/r/AskHistorians/comments/nykrx1/how_did_stalin_and_other_soviet_high_command.json": "How did Stalin and other Soviet high command react when they found out about the Nazi concentration camps, if they didn’t already know?",
  "data/reddit-ask/r/AskHistorians/comments/nyos7f/why_did_the_house_of_saud_choose_to_call_their.json": "Why did the House of Saud choose to call their state a kingdom and not something like Sultanate?",
  "data/reddit-ask/r/AskHistorians/comments/nyw2g5/when_the_swedish_parliament_was_looking_for_a_new.json": "When the Swedish parliament was looking for a new king, did they ever consider the Ethiopian royal family?",
  "data/reddit-ask/r/AskHistorians/comments/nywdbg/new_snoo_sunday_introducing_snoor_inayat_khan.json": "New Snoo Sunday: Introducing Snoor Inayat Khan, Snoollarawarre Bennelong, and Chief Snooseph",
  "data/reddit-ask/r/AskHistorians/comments/nz3cw9/bertrand_russel_warned_of_the_plague_of.json": "Bertrand Russel warned of the \"plague of efficiency,\" stealing man's soul and leisure time. That was 86 years ago, but when did the \"death of leisure\" begin, and what started it? Do we blame religion? The industrial revolution?",
  "data/reddit-ask/r/AskHistorians/comments/nz71db/why_is_cocaine_not_as_wildly_accepted_now_as_it.json": "Why is Cocaine not as wildly accepted now as it was in the past?",
  "data/reddit-ask/r/AskHistorians/comments/nza6me/how_did_italian_americans_react_to_the_us_being.json": "How did Italian Americans react to the U.S. being at war with Fascist Italy during WW2? Was there any widespread support for Mussolini among Italian Americans?",
  "data/reddit-ask/r/AskHistorians/comments/nzaow1/how_many_doctors_and_other_professionals_knew.json": "How many doctors and other professionals knew about the Tuskeegee Syphilis experiment? In 1965 Dr. Irwin Shatz read an article about it in a medical journal and wrote an outraged letter to the study’s authors. Was this a big journal? Was the study published repeatedly?",
  "data/reddit-ask/r/AskHistorians/comments/nzfypo/nowadays_it_is_possible_to_identify_a_time_period.json": "Nowadays it is possible to identify a time period based on the style of clothes worn down to the decade. Has style and fashion changed as often in the past as now? Can you accurately differentiate a stylish person from the 1860’s compared to 1870s?",
  "data/reddit-ask/r/AskHistorians/comments/nzh6hu/how_did_nonaryan_legal_residents_embassy_workers.json": "How did non-Aryan legal residents (Embassy workers, diplomats) live while inside Nazi Germany? Do they casually walk into bars/grocery stores/restaurants sitting next to germans?",
  "data/reddit-ask/r/AskHistorians/comments/nzilbi/bathing_a_guest_and_rubbing_them_with_oil.json": "Bathing a guest and rubbing them with oil",
  "data/reddit-ask/r/AskHistorians/comments/nzl1ey/napoleons_grande_armee_lost_thousands_to_the.json": "Napoleon's Grande Armee lost thousands to the winter conditions in their Russia campaign. Were the Russians themselves better equipped to handle the conditions or did they suffer similar losses to the cold?",
  "data/reddit-ask/r/AskHistorians/comments/nzn983/why_do_historians_point_to_the_invasion_of_poland.json": "Why do historians point to the invasion of Poland as the start of WWII instead of the Marco Polo Bridge Incident in 1937?",
  "data/reddit-ask/r/AskHistorians/comments/nzo9a8/were_there_any_prominent_abolitionists_among_the.json": "Were there any prominent \"abolitionists\" among the middle and upper classes during the height of the Roman Empire, who wanted to see the institution of Roman slavery eliminated?",
  "data/reddit-ask/r/AskHistorians/comments/nzqhrt/on_the_14th_october_1956_indian_politician_b_r.json": "On the 14th October 1956, Indian politician B. R. Ambedkar and half a million of his supporters converted to Buddhism on masse, beginning the Dalit Buddhist movement. How seriously did contemporaries view this act and what social implications did it have for those that took part?",
  "data/reddit-ask/r/AskHistorians/comments/nzs2dt/in_9_ad_wang_mang_abolished_slavery_in_china.json": "In 9 AD, Wang Mang abolished slavery in China. Considering that slavery was universally normalized in the ancient world, what led Wang Mang to abolish slavery?",
  "data/reddit-ask/r/AskHistorians/comments/o038s0/roughly_2000_years_ago_paul_the_apostle.json": "Roughly 2000 years ago, Paul the Apostle identified himself as a member of the Tribe of Benjamin. As far as I know, none of my Israeli or friends of Hebraic origins identify with any particular tribe of Israel. When and how did persons of Hebraic heritage lose their knowledge of tribal descent?",
  "data/reddit-ask/r/AskHistorians/comments/o090b0/is_the_spanish_black_legend_a_real_thing_or_just.json": "Is the Spanish Black Legend a real thing, or just an excuse from the Spanish far right to deny any atrocities committed by the Spanish Empire?",
  "data/reddit-ask/r/AskHistorians/comments/o0ctdy/when_did_the_age_of_massed_musket_armed_line.json": "When did the age of massed musket armed 'line infantry' end, and were there any battles in which a force still fought in the old style of line ranks against whichever tactics replaced it?",
  "data/reddit-ask/r/AskHistorians/comments/o0dn7y/in_fairy_tales_there_is_a_popular_trope_of.json": "In fairy tales, there is a popular trope of beautiful damsels being locked away in a tower, only to be rescued by a clever beau. Was it really that common in the medieval period to trap women in obscure towers? If so, for what reasons were they put there?",
  "data/reddit-ask/r/AskHistorians/comments/o0ii71/in_bbc_sitcom_blackadder_goes_forth_eponymous.json": "In BBC sitcom \"Blackadder Goes Forth\" eponymous protagonist tries to avoid combat by feigning madness \"doing the trick they all used to do in Sudan\". Was Anglo-Sudan war a particularly nasty business that British officers would also try avoid?",
  "data/reddit-ask/r/AskHistorians/comments/o0ts67/did_english_nobility_get_involved_in_the_lives_of.json": "Did English nobility get involved in the lives of their house-servants like in Downton Abby?",
  "data/reddit-ask/r/AskHistorians/comments/o0u0e8/how_common_was_establishing_a_system_of.json": "How common was establishing a system of government based on strange women lying in ponds distributing swords in some farcical aquatic ceremony? But, seriously, are there any real life examples of folk tale-like unusual means of usurping a king/replacing one when a blood line couldn't be kept going?",
  "data/reddit-ask/r/AskHistorians/comments/o0vd93/why_did_so_many_ancient_cultures_consider_the.json": "Why did so many ancient cultures consider the heart, rather than the brain, to be the seat of the mind? Surely they must have noticed that head injuries frequently result in mental impairment and personality change, but chest injuries never do?",
  "data/reddit-ask/r/AskHistorians/comments/o0w9hv/in_the_middle_ages_were_merchants_allowed_to.json": "In the Middle Ages, were merchants allowed to physically cut up coins for more exact transactions? Particularly in England? This is depicted in The Pillars of the Earth.",
  "data/reddit-ask/r/AskHistorians/comments/o0ywsi/how_did_the_sailors_of_the_earlymodern_and_even.json": "How did the sailors of the early-modern (and even before that) avoid things such as sunburn and sun glare while at sea?",
  "data/reddit-ask/r/AskHistorians/comments/o14mpx/why_has_occultism_always_had_such_strong.json": "Why has occultism always had such strong connections to fascism?",
  "data/reddit-ask/r/AskHistorians/comments/o16rv2/is_the_current_obsession_with_spoilers_really_a.json": "Is the current obsession with \"spoilers\" really a recent phenomenon? Or were people already wary of spoilers in, say, the XIX century, when a lot of novels were published in a serial form in many countries?",
  "data/reddit-ask/r/AskHistorians/comments/o18r5m/in_1947_a_group_of_33_japanese_soldiers_on_the.json": "In 1947, a group of 33 Japanese Soldiers on the island of Peleliu finally surrendered, three years after the US won control of the 5 square mile island. How were these individuals able to stay undetected and supplied for three years? Did they have any contact/support from the outside?",
  "data/reddit-ask/r/AskHistorians/comments/o1mlv0/was_13_year_olds_getting_married_in_tudor_times.json": "Was 13 year olds getting married in Tudor times truly acceptable? If you were married as a teen, were you considered an adult?",
  "data/reddit-ask/r/AskHistorians/comments/o1o7c9/did_fur_traders_in_north_america_build_extremely.json": "Did fur traders in North America build extremely long rifles in order to swindle natives?",
  "data/reddit-ask/r/AskHistorians/comments/o1vrue/how_historically_unusual_was_it_for_france_to.json": "How historically unusual was it for France to send the Statue of Liberty to the US?",
  "data/reddit-ask/r/AskHistorians/comments/o1vwdw/why_did_the_british_put_the_50year_provision.json": "Why did the British put the 50-year provision (which makes Hong Kong pseudo-independent until 2047) in their agreement to cede Hong Kong to China?",
  "data/reddit-ask/r/AskHistorians/comments/o1x8ys/whats_the_origin_of_jinx_you_owe_me_a_coke_was.json": "What's the origin of \"Jinx! You owe me a Coke!\"? Was this some kind of promotional campaign for Coca-Cola? Or were people indebted to others when saying the exact same thing as the other person for something other than Coke before it was invented?",
  "data/reddit-ask/r/AskHistorians/comments/o1zp77/what_was_the_public_toilet_experience_in.json": "What was the public toilet experience in Republican Rome and were there any stigmas or cultural nuances associated with communal restrooms?",
  "data/reddit-ask/r/AskHistorians/comments/o206tf/europa_universalis_4_depicts_the_caribbean_as_one.json": "Europa Universalis 4 depicts the Caribbean as one of the most productive regions in the Americas, only rivaled by parts of Mexico and the Andes. Were the tiny islands of the Caribbean really this economically valuable? If so, why?",
  "data/reddit-ask/r/AskHistorians/comments/o23w6j/what_are_some_historical_examples_where_bad.json": "What are some historical examples where bad translations lead to terrible outcomes?",
  "data/reddit-ask/r/AskHistorians/comments/o261sa/how_much_contact_did_medieval_europe_have_with.json": "How much contact did medieval Europe have with Iceland?",
  "data/reddit-ask/r/AskHistorians/comments/o26prw/i_regularly_read_that_romans_greeks_and.json": "I regularly read that Romans, Greeks, and Byzantines never ate breakfast. But what about ientaculum? Where did the no-breakfast myth come from.",
  "data/reddit-ask/r/AskHistorians/comments/o28p9v/the_temperance_movement_in_the_us_is_strongly.json": "The Temperance Movement in the US is strongly associated with women who championed both personal \"moral practices\" and changes to public policy. Was this involvement significantly driven by alcoholism-related domestic abuse?",
  "data/reddit-ask/r/AskHistorians/comments/o29obq/does_the_fantasy_trope_of_high_versions_of.json": "Does the fantasy trope of \"high\" versions of languages have a basis in history?",
  "data/reddit-ask/r/AskHistorians/comments/o2bzpd/why_did_so_many_us_cities_and_states_ban_the.json": "Why did so many US cities and states ban the construction of multifamily housing after WW2?",
  "data/reddit-ask/r/AskHistorians/comments/o2epi8/this_may_be_a_silly_question_but_did_medieval.json": "This may be a silly question, but did medieval nobles and princesses actually wear tall conical hats with veils?",
  "data/reddit-ask/r/AskHistorians/comments/o2lbf8/why_did_the_south_korea_and_the_west_help_north.json": "Why did the South Korea and the West help North Korea during the 90s famine by donating food instead of trying to dismantle the crippled country or forcing it to rejoin with the South Korea?",
  "data/reddit-ask/r/AskHistorians/comments/o2p66g/why_is_the_holiday_called_juneteenth_and_how_did.json": "Why is the holiday called “Juneteenth”, and how did it come to be celebrated outside of Texas?",
  "data/reddit-ask/r/AskHistorians/comments/o2pd09/did_the_television_show_frasier_influence_the.json": "Did the television show Frasier influence the growth of Starbucks?",
  "data/reddit-ask/r/AskHistorians/comments/o316vw/in_philip_freemans_collection_of_irish_legends.json": "In Philip Freeman's collection of Irish legends and folklore, the story of St. Brigid involves her performing a miracle which strongly resembles an abortion. How were abortions perceived in Medieval Christian Ireland?",
  "data/reddit-ask/r/AskHistorians/comments/o37ke4/when_did_the_us_navy_decide_to_build_ships_that.json": "When did the US Navy decide to build ships that couldn't fit through the Panama Canal?",
  "data/reddit-ask/r/AskHistorians/comments/o38qsm/why_is_greece_known_by_a_significantly_different.json": "Why is Greece known by a significantly different name (Yunan) in India and the middle east? And how did the two different names come to be?",
  "data/reddit-ask/r/AskHistorians/comments/o3chqx/why_has_russia_never_collapsed.json": "Why has Russia never collapsed?",
  "data/reddit-ask/r/AskHistorians/comments/o3hkld/an_explainer_of_juneteenth_and_a_celebration_of.json": "An explainer of Juneteenth and a celebration of African-American history",
  "data/reddit-ask/r/AskHistorians/comments/o3ki9p/yesterday_i_was_a_slave_in_1865_texas_this.json": "Yesterday, I was a slave in 1865 Texas. This morning, a messenger rode onto the plantation and announced that I’ve been freed per General Order No. 3. What are the next 24 hours like?",
  "data/reddit-ask/r/AskHistorians/comments/o44p8x/every_book_i_read_jumps_to_erich_ludendorff_de.json": "Every book I read jumps to Erich Ludendorff “de facto dictator”of Germany in 1917 without ever explaining how he obtained such power.I realize he was a prodigy general,and rose through the military ranks,but what were the events that led him to both absolute political and military dictatorial power?",
  "data/reddit-ask/r/AskHistorians/comments/o452qh/new_snoo_sunday_introducing_viola_snoomond_snoose.json": "New Snoo Sunday: Introducing Viola Snoomond, Snoosé Rizal, and Jane Snoosten",
  "data/reddit-ask/r/AskHistorians/comments/o485jo/i_am_interested_in_seafaring_native_american.json": "I am interested in sea-faring Native American nations on the East coast of the Americas. I found an ask on this sub-reddit's faqs about watercraft in the pre-Colombian Americas, but it only mentions examples from the west coast. There must have been seafaring nations on the east coast?",
  "data/reddit-ask/r/AskHistorians/comments/o4det3/the_russians_converted_from_paganism_to.json": "The Russians converted from paganism to Christianity in the 10th century. Is there any in-depth information about the pre-Christian religion(s)? Are there any remains of such places of worship, or any remnants of the earlier religion still present in local tradition in the present?",
  "data/reddit-ask/r/AskHistorians/comments/o4fvw6/almost_every_new_popular_history_book_has_a.json": "Almost every new Popular History book has a review blurb from the same 20-30 other popular history writers (Niall Ferguson, Andrew roberts etc…) on the cover. Do these guys read every history book that comes out or are they paid to write good reviews?",
  "data/reddit-ask/r/AskHistorians/comments/o4hii8/if_a_modern_catholic_were_to_be_transported_to.json": "If a modern catholic were to be transported to the fourth or fifth century common era, how familiar would the Christian faith be to them?",
  "data/reddit-ask/r/AskHistorians/comments/o4ka07/the_aztec_emperor_montezuma_welcomed_cortes_into.json": "The Aztec emperor Montezuma welcomed Cortes into his awe-inspiring palace and gave a speech in which he supposedly surrendered to the Spanish. But this speech went through two translators before reaching the ears of the Spaniards. How likely is it that Montezuma was misunderstood?",
  "data/reddit-ask/r/AskHistorians/comments/o4kxvs/why_is_siberia_so_well_settled_compared_to_other.json": "Why is Siberia so well settled compared to other areas with a similarly harsh climate?",
  "data/reddit-ask/r/AskHistorians/comments/o4m2jm/why_did_people_in_the_us_and_uk_during_the_1800s.json": "Why did people in the US and UK during the 1800s wear so many layers of clothing – not even switching it up for sports, hiking, or heat?",
  "data/reddit-ask/r/AskHistorians/comments/o4ma7x/in_downton_abbey_1922_a_character_gets_an.json": "In Downton Abbey (1922), a character gets an abortion illegally in London. It was advertised in a magazine. How would illegal operations have been advertised, and at the same time hidden from authorities?",
  "data/reddit-ask/r/AskHistorians/comments/o4v0c8/what_were_the_borders_of_the_incan_empire_like.json": "What were the borders of the Incan empire like? Did their leaders practice diplomacy with smaller tribes or were those conquered until there was none around?",
  "data/reddit-ask/r/AskHistorians/comments/o4vaux/before_california_created_the_uss_first_nofault.json": "Before California created the US's first no-fault divorce law, someone wanting a divorce would have to have (or fabricate) a reason why their partner had violated marriage norms. Did divorce involve a lot of slander? Did people make up reasons to get divorced?",
  "data/reddit-ask/r/AskHistorians/comments/o4yf21/in_the_right_stuff_wolfe_claims_that_the.json": "In \"The Right Stuff,\" Wolfe claims that the stereotypical pilot/ATC voice originated from other pilots mimicking West Virginian Chuck Yeager's distinctive voice. Is this correct?",
  "data/reddit-ask/r/AskHistorians/comments/o4z9xv/did_ancient_roman_cities_have_their_own_distinct.json": "Did Ancient Roman cities have their own distinct cultures and attitudes like cities do today?",
  "data/reddit-ask/r/AskHistorians/comments/o50irs/why_is_the_19th_century_russian_empire_described.json": "Why is the 19th century Russian Empire described as being \"autocratic\", while other similar 19th century states, such as the Austrian Empire, are not described as such, despite also being very illiberal? Why is \"autocratic\" a description only used for the Russian Empire? What was unique about it?",
  "data/reddit-ask/r/AskHistorians/comments/o58fhj/yalta_tehran_these_conferences_would_not_just.json": "Yalta, Tehran, these conferences would not just decide the fate of ww2, but even the world after. But, more importantly, what was the catering like? What did the delegates eat?",
  "data/reddit-ask/r/AskHistorians/comments/o5eftv/why_is_the_japanese_yen_so_weak_in_terms_of_one.json": "Why is the Japanese Yen so weak in terms of one unit? Did the Japanese economy experience hyperinflation at some point and then stabilize or was the yen designed to trade in the thousands for daily stuff?",
  "data/reddit-ask/r/AskHistorians/comments/o5gw3r/much_of_mein_kampf_apparently_involves_ranting.json": "Much of Mein Kampf apparently involves ranting about the status of the Southern Tirol, which Italy had annexed from Austria at the end of WWI. Why this obsession with a piece of Alpine territory? And how typical were Hitler's views on the matter within Austria and/or Germany?",
  "data/reddit-ask/r/AskHistorians/comments/o5imj4/until_which_point_in_time_did_the.json": "Until which point in time did the English/Anglo-Saxons perceive themselves as Germanic? Was there such a time at all?",
  "data/reddit-ask/r/AskHistorians/comments/o5k51g/in_the_early_days_of_seafaring_exploration_when.json": "In the early days of seafaring exploration, when news/maps travelled more slowly, did places often get \"discovered\" twice by Europeans? How were disputes handled/resolved?",
  "data/reddit-ask/r/AskHistorians/comments/o5mmvo/are_the_indian_subcontinents_current_religious.json": "Are the Indian subcontinent's current religious divisions a construct of intentional British colonial policy during their colonial rule?",
  "data/reddit-ask/r/AskHistorians/comments/o5o126/would_there_have_been_name_humour_as_we_know_it.json": "Would there have been name humour as we know it in medeival Europe?",
  "data/reddit-ask/r/AskHistorians/comments/o5o61e/why_are_carrelated_words_so_different_in_british.json": "Why are car-related words so different in British and American English?",
  "data/reddit-ask/r/AskHistorians/comments/o608i7/how_did_abolitionist_like_frederick_douglass.json": "How did abolitionist like Frederick Douglass react to the exception within the 13th Amendment allowing for slavery in the prison System? Did they foresee its abuse by white Americans in the Justice System?",
  "data/reddit-ask/r/AskHistorians/comments/o60qzf/was_napoleon_a_nice_guy.json": "Was Napoleon a nice guy?",
  "data/reddit-ask/r/AskHistorians/comments/o6190j/in_those_american_states_that_did_not_join_the.json": "In those American states that did not join the Confederacy but still had legal slavery such as Maryland, Delaware and Missouri, what was the practice of slavery like during the war?",
  "data/reddit-ask/r/AskHistorians/comments/o638j7/what_would_be_a_good_place_to_start_for_a_person.json": "What would be a good place to start for a person who is wanting to learn about Native American artifacts, culture and lifestyle?",
  "data/reddit-ask/r/AskHistorians/comments/o65h68/how_did_european_colonizers_battle_the_sun_in.json": "How did European colonizers battle the sun in places like the Caribbean and South America?",
  "data/reddit-ask/r/AskHistorians/comments/o69mzy/when_prophet_muhammad_was_preaching_islam_and.json": "When prophet Muhammad was preaching Islam and introducing its laws and guidelines were there any robust intellectual challenges among the adherents to his edicts e.g. on alcohol consumption, eating pork and drawing portraits.",
  "data/reddit-ask/r/AskHistorians/comments/o69pjs/what_was_the_reaction_of_the_east_germans_when.json": "What was the reaction of the East Germans when they realized they now had to live under communism?",
  "data/reddit-ask/r/AskHistorians/comments/o6e0tp/did_american_children_in_the_1970s_and_1980s.json": "Did American children in the 1970s and 1980s actually have more unsupervised play time than children in the 1990s through today? If so, are there any clear causes of the decline in unsupervised play?",
  "data/reddit-ask/r/AskHistorians/comments/o6kdzs/are_we_still_looking_for_lost_literature_from.json": "Are we still looking for “lost” literature from Antiquity?",
  "data/reddit-ask/r/AskHistorians/comments/o6mn3w/much_of_the_homeless_population_of_the_united.json": "Much of the homeless population of the United States has problems with addiction or mental health. Did the US once accommodate these people in asylums and state-run care facilities? Did that system work well? Why was it done away with?",
  "data/reddit-ask/r/AskHistorians/comments/o6punt/had_the_united_states_not_annexed_the_kingdom_of.json": "Had the United States not annexed the Kingdom of Hawaii, is it likely that some other power would have done so?",
  "data/reddit-ask/r/AskHistorians/comments/o6rg64/how_effective_were_the_soviet_union_and_other.json": "how effective were the Soviet Union and other countries in the eastern bloc at eliminating homelessness?",
  "data/reddit-ask/r/AskHistorians/comments/o6s9aq/marco_polo_said_he_helped_the_mongols_conquer_the.json": "Marco Polo said he helped the Mongols conquer the Chinese city of Xiangyang by teaching them how to build mangonels. According to Chinese and Mongol records, Xiangyang fell in 1273. Marco Polo did not go to China until 1275. How is this possible?",
  "data/reddit-ask/r/AskHistorians/comments/o6vltl/what_sort_of_influence_has_africanamerican.json": "What sort of influence has African-American culture had on Africa itself?",
  "data/reddit-ask/r/AskHistorians/comments/o6x833/how_did_people_find_each_other_in_metropolises_in.json": "How did people find each other in metropolises in the ancient world?",
  "data/reddit-ask/r/AskHistorians/comments/o6zfwj/how_obvious_and_wellcoordinated_were_volleys_of.json": "How obvious and well-coordinated were volleys of fire in 17th century warfare? Could well-trained troops reliably learn to just duck when the other guys all shot at once?",
  "data/reddit-ask/r/AskHistorians/comments/o7c9rc/mass_graves_of_indigenous_peoples_keep_getting.json": "Mass graves of Indigenous peoples keep getting discovered at the sites of Canadian residential schools. Should I expect mass graves to be found at Aboriginal missions here in Australia?",
  "data/reddit-ask/r/AskHistorians/comments/o7cqjo/were_ancient_civilizations_aware_that_they_were.json": "Were ancient civilizations aware that they were descendants of hunter-gatherers?",
  "data/reddit-ask/r/AskHistorians/comments/o7lkc0/the_history_of_greek_myths.json": "The History *of* Greek Myths?",
  "data/reddit-ask/r/AskHistorians/comments/o7lui3/teotihuacan_was_the_most_influential_and_powerful.json": "Teotihuacan was the most influential and powerful city state of its time, with control over a large trade network. They worshiped a \"spider goddess\" but this goddess doesn't seem to show up in later pantheons after the city was abandoned. Why?",
  "data/reddit-ask/r/AskHistorians/comments/o7ospc/what_were_the_mechanics_of_sex_work_like_in_1st.json": "What were the mechanics of sex work like in 1st Century Galilee? How would I find a sex worker, proposition them, and pay for it? Were there brothels, procurers, or was everybody freelance?",
  "data/reddit-ask/r/AskHistorians/comments/o7p60u/britain_in_the_1970s_a_hell_on_earth.json": "Britain in the 1970s - a hell on earth?",
  "data/reddit-ask/r/AskHistorians/comments/o7rfif/how_do_the_mods_decide_what_questions_are_great.json": "How do the mods decide what questions are \"GREAT QUESTION!\"s? I just had a question flaired that way, after submitting it a second time, when it was not flaired that way the first time.",
  "data/reddit-ask/r/AskHistorians/comments/o7svod/queen_elizabeth_i_of_england_and_oda_nobunaga.json": "Queen Elizabeth I of England and Oda Nobunaga were born less than a year apart. What would they have known about each other? Would they have had any interaction at all, even indirect?",
  "data/reddit-ask/r/AskHistorians/comments/o7y5xc/who_was_healthier_a_rich_citydweller_in_1st.json": "Who was healthier: a rich city-dweller in 1st century Europe or a rich a city-dweller in 11th century Europe? What about a *poor* city-dweller in 1st century Europe compared to a *poor* a city-dweller in 11th century Europe?",
  "data/reddit-ask/r/AskHistorians/comments/o7yi82/napoleon_iiis_wife_empress_eugenie_owned_a_pair.json": "Napoleon III's wife, Empress Eugenie, owned a pair of gloves made from spider silk. What happened to them?",
  "data/reddit-ask/r/AskHistorians/comments/o7z2y5/i_love_you_guys_ive_learned_so_much_from_you_guys.json": "I love you guys. I've learned so much from you guys over the years.",
  "data/reddit-ask/r/AskHistorians/comments/o89l5t/what_might_the_singer_of_barretts_privateers.json": "What might the singer of Barrett's Privateers future be?",
  "data/reddit-ask/r/AskHistorians/comments/o8aash/its_a_known_fact_that_robert_mcnamara_was_a_huge.json": "It's a known fact that Robert McNamara was a huge proponent of using mathematical data analysis and computing to influence his decisions as Secretary of Defense. But is it known what calculations he did in particular, what his formulas and models were and to what extent they influenced his strategy?",
  "data/reddit-ask/r/AskHistorians/comments/o8amxp/in_a_til_thread_discussing_the_significance_of.json": "In a TIL thread discussing the significance of fire bombing in Japan vs Atomic bombs in WW2, it was claimed that Kyoto was removed from the list of cities to bomb due to the city's cultural significance. Is it true? Why would cultural significance justify not bombing an enemy city at the time?",
  "data/reddit-ask/r/AskHistorians/comments/o8dzqa/i_often_hear_that_modern_hinduism_is_fact.json": "I often hear that modern Hinduism is fact extremely different from earlier forms and that what is considered today’s mainstream Hinduism did not actually exist until the 20th century. How accurate are these claims and how is recent Hinduism different from its ancient roots?",
  "data/reddit-ask/r/AskHistorians/comments/o8gpfc/george_washington_carver_said_he_his_sister_and.json": "George Washington Carver said he, his sister and his mother were \"Ku Klucked\" when he was very young. He says it was a band of outlaws who abducted them, and sold them in Arkansas - though he was found on the road, he never saw his other family again. How common were these acts in the Missouri area?",
  "data/reddit-ask/r/AskHistorians/comments/o8jhok/in_fiddler_on_the_roof_why_is_a_tailor_poor_and_a.json": "In Fiddler on the Roof, why is a tailor poor and a butcher rich? Is it just random or meant to depict the actual status or wealth associated with these jobs in old Eastern European Jewish villages?",
  "data/reddit-ask/r/AskHistorians/comments/o8mcq0/ive_read_mein_kampf_it_seems_like_trite_racist.json": "I've read Mein Kampf. It seems like trite racist material that isn't well written or original. Did the book become famous because Hitler wrote it, or because it was considered a powerful work?",
  "data/reddit-ask/r/AskHistorians/comments/o8p8fl/where_does_the_stereotypical_image_of_a_robber.json": "Where does the stereotypical image of a robber wearing a black-and-white striped shirt, a black eye-mask, and a beret or beanie and carrying a big bag (in which to store the stolen proceeds) come from?",
  "data/reddit-ask/r/AskHistorians/comments/o8vcpn/ive_walked_into_a_17th_century_british_coffee.json": "I've walked into a 17th century British coffee house, what's on the menu?",
  "data/reddit-ask/r/AskHistorians/comments/o8wcwp/so_whats_the_deal_with_the_merovingian_kings.json": "So, what's the deal with the Merovingian kings, anyway?",
  "data/reddit-ask/r/AskHistorians/comments/o8wjrh/new_snoo_sunday_introducing_snoorodotus_snoo.json": "New Snoo Sunday: Introducing Snoorodotus, Snoo al-Mulk, and Frederick Snoouglass",
  "data/reddit-ask/r/AskHistorians/comments/o8zkf6/do_we_have_any_evidence_to_support_the_classic.json": "Do we have any evidence to support the classic Patriarchy transition theory ?",
  "data/reddit-ask/r/AskHistorians/comments/o931b4/my_greatgrandfathers_sister_went_missing_in.json": "My Great-Grandfather's sister went missing in Chicago in 1898 at the age of 14 while walking to her piano lesson. What likely happened to young children like her who were abducted during the turn of the century in large American cities like Chicago? (Her missing person's ad included!)",
  "data/reddit-ask/r/AskHistorians/comments/o9az9k/my_dad_says_that_young_boysmale_teens_were_not.json": "My dad says that young boys/male teens were not allowed to work in the flax fields in Ireland in the 1800s to early 1900s due to the effects of the estrogen from the plants. I have not found much of anything to support this. What's a possible source for this story beyond phytoestrogen myths?",
  "data/reddit-ask/r/AskHistorians/comments/o9ia8h/i_am_a_european_king_living_between_10001500_i.json": "I am a European King living between 1000-1500, I hear from my spy that my sister is shoved around/abused by her husband the king of Random Kingdom with whom an alliance is beneficial/necessary (hence the marrige). What can I do? Do I care enough to do anything? Is it expected of me to intervene?",
  "data/reddit-ask/r/AskHistorians/comments/o9j1qb/web_dubois_asserted_that_around_the_1880s1890s_to.json": "W.E.B. DuBois asserted that around the 1880s-1890s, to get a ‚real position in a university‘ every American had to go to Germany‘s universities to get their degree. Why and how did this tradition develop in the US university System?",
  "data/reddit-ask/r/AskHistorians/comments/o9mes2/ive_seen_viking_skulls_with_fileddown_teeth_do_we.json": "I've seen Viking skulls with filed-down teeth. Do we know how common this was, and why the Vikings did it? Wouldn't it have made chewing difficult?",
  "data/reddit-ask/r/AskHistorians/comments/o9zkk8/when_did_sigmund_freuds_ideas_lose_their.json": "When did Sigmund Freud’s ideas lose their authority among the public (at least in the USA)? Intellectuals in the postwar period cited Freud constantly, whereas today, most people remember him mainly for his wackier theories about sex with your mom.",
  "data/reddit-ask/r/AskHistorians/comments/oa4m5m/dan_carlin_hh_ep_39_carlin_says_scipio_aemilianus.json": "Dan Carlin HH Ep. 39, Carlin says Scipio Aemilianus forced the Egyptian king on a tour of Alexandria to see if the fat king could walk. He also says that Cato received the king while Cato used a toilet. How far down the Roman ladder did you have to go before client kings no longer showed deference?",
  "data/reddit-ask/r/AskHistorians/comments/oa5ay2/how_did_the_police_proceduraldrama_become_such_a.json": "How did the police procedural/drama become such a large part of TV programming?",
  "data/reddit-ask/r/AskHistorians/comments/oa5nlw/how_seriously_did_the_imperial_japanese_navy.json": "How seriously did the Imperial Japanese Navy actually take the threat of Allied submarines during the Pacific War?",
  "data/reddit-ask/r/AskHistorians/comments/oa7f7v/in_the_image_below_depicts_a_qing_soldier_from.json": "In the image below depicts a Qing soldier from the Qianlong Era. Did their attire truly consist of steel armour, especially when muskets (even shown in the picture) made said armour obsolete?",
  "data/reddit-ask/r/AskHistorians/comments/oa8nge/seeing_the_clouds_from_above_on_an_aeroplane.json": "Seeing the clouds from above on an aeroplane never fails to amaze me. Are there are any historical accounts of people sighting this for the first time, either in the early history of aviation or perhaps from earlier when climbing tall mountains?",
  "data/reddit-ask/r/AskHistorians/comments/oa8nqu/its_1066_and_im_somewhere_in_northwestern_europe.json": "It's 1066 and I'm somewhere in northwestern Europe. What would I think when I look up and see Haley's Comet? What would I know of what educated thinkers have to say about it?",
  "data/reddit-ask/r/AskHistorians/comments/oad9zy/why_does_it_always_seem_to_circle_around_to.json": "Why does it always seem to circle around to antisemitism ?",
  "data/reddit-ask/r/AskHistorians/comments/oah3br/whenwhyhow_did_chopsticks_become_a_part_of_all.json": "When/why/how did chopsticks become a part of all Asian cuisine? Who made them first? How come no western country was introduced to them early?",
  "data/reddit-ask/r/AskHistorians/comments/oajgd1/why_is_st_louis_not_as_culturally_french_as_new.json": "Why is St. Louis not as culturally French as New Orleans?",
  "data/reddit-ask/r/AskHistorians/comments/oas5da/crassus_is_often_criticized_for_crossing_through.json": "Crassus is often criticized for crossing through the desert to reach the Tigris and getting slaughtered in the scorching heat at Carrhae. Alexander the Great took a similar path on his expansion and won at Gaugamela, was this ever addressed by ancient and early-modern writers?",
  "data/reddit-ask/r/AskHistorians/comments/oasqdw/why_did_the_us_founding_fathers_decided_the.json": "Why did the US founding fathers decided the highest office to be called President? Were there any other suggestions regarding the name of the office?",
  "data/reddit-ask/r/AskHistorians/comments/oau8uy/can_you_develop_a_meaningful_degree_of_historical.json": "Can you develop a meaningful degree of historical rigour if life circumstances preclude you from getting a PhD and becoming a trained historian?",
  "data/reddit-ask/r/AskHistorians/comments/oauo7h/in_the_context_of_slavery_in_the_usa_a_lot_of.json": "In the context of slavery in the USA, a lot of focus is given to those working in plantations or in domestic homes. But what about in mining, forestry, fishing, and other industries in America at the time?",
  "data/reddit-ask/r/AskHistorians/comments/oaw8r1/im_a_citizen_of_rome_during_the_height_of_roman.json": "I'm a citizen of Rome during the height of Roman power and influence. I accidentally stub my toe, trip, and faceplant. In modern times, a \"God dammit, FUCK that hurt,\" would do the trick. What words am I using as a Roman to describe my pain/annoyance?",
  "data/reddit-ask/r/AskReddit/comments/npjn03/gay_people_of_reddit_what_was_the_bestworst.json": "Gay people of Reddit, what was the best/worst reaction you received to coming out?",
  "data/reddit-ask/r/AskReddit/comments/nplfhj/people_who_lost_their_ability_to_hear_what_was.json": "People who lost their ability to hear what was the last thing you remember hearing?",
  "data/reddit-ask/r/AskReddit/comments/npmb42/what_do_you_do_when_you_cant_fall_asleep.json": "What do you do when you can’t fall asleep?",
  "data/reddit-ask/r/AskReddit/comments/npq0tk/what_thing_about_you_is_absolutely_not_a_secret.json": "What thing about you is absolutely not a secret, but you've just never told anyone because nobody's ever asked?",
  "data/reddit-ask/r/AskReddit/comments/npu2bd/what_is_something_you_think_every_human_should.json": "What is something you think every human should experience and why?",
  "data/reddit-ask/r/AskReddit/comments/npv73d/who_is_a_really_well_written_villian_from_an.json": "Who is a really well written villian from an animated/kids show?",
  "data/reddit-ask/r/AskReddit/comments/npvjlm/who_is_the_most_famous_person_youve_spoken_to.json": "Who is the most famous person you’ve spoken to?",
  "data/reddit-ask/r/AskReddit/comments/npx0wj/whats_the_cruelest_prank_youve_ever_seen.json": "What's the cruelest \"prank\" you've ever seen?",
  "data/reddit-ask/r/AskReddit/comments/nq4n9y/whats_a_pickup_line_so_bad_its_awesome.json": "What’s a pickup line so bad it’s awesome?",
  "data/reddit-ask/r/AskReddit/comments/nq93cd/what_is_the_craziest_paranormal_experience_youve.json": "What is the craziest paranormal experience you've had?",
  "data/reddit-ask/r/AskReddit/comments/nq9fjc/people_who_work_at_5_star_hotels_what_type_of.json": "People who work at 5 Star Hotels: what type of shit goes on that management doesn’t want people to know?",
  "data/reddit-ask/r/AskReddit/comments/nqjyhq/whats_a_compliment_you_dont_like_receiving_and_why.json": "what's a compliment you don't like receiving and why?",
  "data/reddit-ask/r/AskReddit/comments/nqkh7n/people_who_have_heard_deathbed_confessions_what.json": "People who have heard deathbed confessions, what were some interesting ones?",
  "data/reddit-ask/r/AskReddit/comments/nql6xv/whats_something_from_the_90s_you_miss.json": "What’s something from the 90s you miss?",
  "data/reddit-ask/r/AskReddit/comments/nqpuda/at_this_exact_moment_how_far_away_are_you_from.json": "At this exact moment, how far away are you from where you were born?",
  "data/reddit-ask/r/AskReddit/comments/nqtjn9/people_who_ended_up_with_their_first_crush_whats.json": "People who ended up with their first crush, what's your story?",
  "data/reddit-ask/r/AskReddit/comments/nqzts4/whats_the_best_fathers_day_gift_idea.json": "What's the best Father's Day gift idea?",
  "data/reddit-ask/r/AskReddit/comments/nr7mox/which_punishment_either_real_or_imagined_sounds.json": "Which punishment (either real or imagined) sounds \"light\" or \"not a big deal\" at first, but is actually horrific to experience?",
  "data/reddit-ask/r/AskReddit/comments/nrakgv/whats_generally_considered_sexy_but_a_turn_off.json": "What's generally considered sexy but a turn off for you?",
  "data/reddit-ask/r/AskReddit/comments/nrd747/you_are_now_a_professor_at_supervillain.json": "You are now a professor at Supervillain University. What course do you teach?",
  "data/reddit-ask/r/AskReddit/comments/nre277/how_are_we_supposed_to_start_a_conversation_with.json": "How are we supposed to start a conversation with someone we want to be friends with?",
  "data/reddit-ask/r/AskReddit/comments/nrfsp2/a_7yearold_boy_in_new_york_was_charged_with_rape.json": "A 7-year-old boy in New York was charged with rape. How should the justice system deals with young offenders?",
  "data/reddit-ask/r/AskReddit/comments/nrguv3/what_is_something_free_from_the_internet_which.json": "What is something free from the internet, which everyone should take advantage of?",
  "data/reddit-ask/r/AskReddit/comments/nrhf3c/whats_a_common_misconception_about_sex.json": "What’s a common misconception about sex?",
  "data/reddit-ask/r/AskReddit/comments/nrkgqm/people_on_amazon_who_answer_a_question_about_a.json": "People on Amazon who answer a question about a product with \"I don't own one of these so I don't know\" What is your reasoning?",
  "data/reddit-ask/r/AskReddit/comments/nrpgsp/serious_what_was_the_most_horrific_thing_you_have.json": "[serious] What was the most horrific thing you have ever seen?",
  "data/reddit-ask/r/AskReddit/comments/nrr3bk/what_is_your_best_advice.json": "What is your best advice?",
  "data/reddit-ask/r/AskReddit/comments/nrshwk/the_late_christopher_lee_said_every_actor_has_to.json": "The late Christopher Lee said \"Every actor has to make terrible films from time to time, but the trick is never to be terrible in them.\" What actor or actress has played their part the best in the most terrible movie?",
  "data/reddit-ask/r/AskReddit/comments/nrtjqk/what_advertisment_completely_turned_you_off_to.json": "What advertisment completely turned you off to its product or service?",
  "data/reddit-ask/r/AskReddit/comments/nru64u/whats_a_legit_way_to_make_a_100_everyday_without.json": "What's a legit way to make a $100 everyday without a 9-5?",
  "data/reddit-ask/r/AskReddit/comments/nrztne/if_you_could_have_one_nsfw_power_what_would_it_be.json": "If you could have one NSFW power, what would it be?",
  "data/reddit-ask/r/AskReddit/comments/ns4jjx/what_is_a_fashion_trend_you_hate.json": "What is a fashion trend you hate?",
  "data/reddit-ask/r/AskReddit/comments/ns8jwq/what_seemingly_pointless_or_meaningless_thing.json": "What seemingly pointless or meaningless thing gives you that good, good serotonin release?",
  "data/reddit-ask/r/AskReddit/comments/ns8k8t/teachers_of_reddit_what_was_a_i_dont_get_paid.json": "Teachers of reddit what was a \"I don't get paid enough for this shit\" moment for you?",
  "data/reddit-ask/r/AskReddit/comments/nscug0/teachers_who_zoom_classes_whats_the_most.json": "Teachers who zoom classes, what’s the most disturbing thing you’ve seen on a student’s zoom?",
  "data/reddit-ask/r/AskReddit/comments/nse3et/what_foods_seem_completely_fine_until_you_realize.json": "What foods seem completely fine until you realize how it's actually made?",
  "data/reddit-ask/r/AskReddit/comments/nspbqi/your_ex_texts_you_i_am_dating_someone_better_than.json": "Your ex texts you, \"I am dating someone better than you\" what's your reply ?",
  "data/reddit-ask/r/AskReddit/comments/nsqh3l/as_an_introvert_what_irritates_you_the_most.json": "As an introvert what irritates you the most?",
  "data/reddit-ask/r/AskReddit/comments/nsr3pa/hows_your_mental_health_are_you_ok.json": "How’s your mental health? Are you ok?",
  "data/reddit-ask/r/AskReddit/comments/nsum80/what_fictional_character_do_you_hate_with_every.json": "what fictional character do you hate with every fiber of your being?",
  "data/reddit-ask/r/AskReddit/comments/nswkjm/gamers_of_reddit_what_is_the_game_that_has_low.json": "Gamers of Reddit, What is the game that has low graphics and great gameplay?",
  "data/reddit-ask/r/AskReddit/comments/nsxny1/whats_the_worst_thing_youve_had_happen_to_your.json": "What’s the worst thing you’ve had happen to your genitals?",
  "data/reddit-ask/r/AskReddit/comments/nsygb2/what_is_one_thing_that_porn_taught_you_about_sex.json": "What is one thing that porn taught you about sex, that turned out to not be true at all?",
  "data/reddit-ask/r/AskReddit/comments/nszcd4/whats_your_damn_im_a_badass_moment.json": "What's your \"damn I'm a badass\" moment?",
  "data/reddit-ask/r/AskReddit/comments/nt3y49/what_is_far_deadlier_than_most_people_realize.json": "What is far deadlier than most people realize? [serious]",
  "data/reddit-ask/r/AskReddit/comments/ntblu5/people_of_reddit_what_really_specific_thing.json": "People of reddit, What really specific thing annoys the hell out of you?",
  "data/reddit-ask/r/AskReddit/comments/ntbqem/womens_pocket_makers_how_much_money_do_you_make.json": "Women’s pocket makers, how much money do you make from the handbag mafia?",
  "data/reddit-ask/r/AskReddit/comments/ntefbx/people_who_actually_fucked_their_friends_mom_how.json": "People who actually fucked their friends mom, how did you find out she was interested?",
  "data/reddit-ask/r/AskReddit/comments/ntf5cx/stephen_hawking_has_stated_that_we_should_stop.json": "Stephen Hawking has stated that we should stop trying to contact Aliens, as they would likely be hostile to us. What is your position on this issue? Any ideas?",
  "data/reddit-ask/r/AskReddit/comments/ntofxm/what_the_scariest_true_story_you_know.json": "What the scariest true story you know?",
  "data/reddit-ask/r/AskReddit/comments/ntqiyq/what_happens_in_movies_that_never_happens_in_real.json": "What happens in movies that NEVER happens in real life?",
  "data/reddit-ask/r/AskReddit/comments/ntqo1h/serious_what_are_some_misconceptions_about_sex.json": "[Serious] What are some misconceptions about sex that you had when you were younger?",
  "data/reddit-ask/r/AskReddit/comments/ntyz6v/what_are_some_areas_that_science_has_a_blind_spot.json": "What are some areas that science has a blind spot in because they're too unethical to research and why?",
  "data/reddit-ask/r/AskReddit/comments/nu0nnh/potato_chip_lovers_of_reddit_what_is_your.json": "Potato chip lovers of Reddit, what is your favorite chip?",
  "data/reddit-ask/r/AskReddit/comments/nu7iab/r34_artists_what_is_the_weirdestmost_concerning.json": "R34 artists, what is the weirdest/most concerning commission you've ever gotten?",
  "data/reddit-ask/r/AskReddit/comments/nucofr/without_saying_who_your_favorite_band_or_singer.json": "Without saying who your favorite band or singer is, what is one fact about them?",
  "data/reddit-ask/r/AskReddit/comments/nudcok/what_are_the_best_growing_careers_to_go_into.json": "What are the best growing careers to go into?",
  "data/reddit-ask/r/AskReddit/comments/nudd3z/what_is_the_worst_business_decision_youve_ever.json": "What is the Worst Business Decision You’ve Ever Seen?",
  "data/reddit-ask/r/AskReddit/comments/nuezh7/truckers_of_reddit_what_are_some_less_common_road.json": "Truckers of reddit, what are some less common road courtesies that we can offer to you to make your job safer and easier?",
  "data/reddit-ask/r/AskReddit/comments/nuotli/adults_that_acted_in_horror_movies_as_children.json": "Adults that acted in horror movies as children, how did it impact you psychologically later in life?",
  "data/reddit-ask/r/AskReddit/comments/nuow9e/if_god_called_your_phone_right_now_what_would_you.json": "If God called your phone right now, what would you ask him for?",
  "data/reddit-ask/r/AskReddit/comments/nurg8f/what_is_morally_right_but_legally_wrong.json": "What is morally right but legally wrong?",
  "data/reddit-ask/r/AskReddit/comments/nus5gq/what_are_the_most_brutal_hardest_to_watch_movie.json": "What are the most brutal, hardest to watch movie scenes?",
  "data/reddit-ask/r/AskReddit/comments/nuu2q4/a_lot_of_famous_recipes_are_claimed_to_be_made.json": "A lot of famous recipes are claimed to be made with love, but what’s a dish that’s probably made with hatred?",
  "data/reddit-ask/r/AskReddit/comments/nuuarl/you_have_come_across_a_small_bottle_of_love.json": "You have come across a small bottle of Love Potion No. 9; one spray in your mouth, and the sound of your voice makes anyone in earshot become enamored of you for 48 hours...oddly enough, there are 9 sprays left...how do you use them?",
  "data/reddit-ask/r/AskReddit/comments/nv1lh8/if_you_could_ask_for_a_miracle_what_would_it_be.json": "If you could ask for a miracle, what would it be?",
  "data/reddit-ask/r/AskReddit/comments/nv3chw/whats_the_most_fucked_up_thing_youve_seen_at_a.json": "What’s the most fucked up thing you’ve seen at a friend’s house?",
  "data/reddit-ask/r/AskReddit/comments/nv48rw/whats_the_worst_houseguest_experience_youve_had.json": "What's the worst houseguest experience you've had?",
  "data/reddit-ask/r/AskReddit/comments/nv50i6/in_the_united_states_what_should_you_never_do.json": "In the United States, what should you never do?",
  "data/reddit-ask/r/AskReddit/comments/nv61u3/people_who_lied_in_their_resume_and_actually_got.json": "People who lied in their resume and actually got the job they were unqualified for, what ended up happening?",
  "data/reddit-ask/r/AskReddit/comments/nvaoh6/would_you_date_someone_with_0_sexual_or_romantic.json": "Would you date someone with 0 sexual or romantic experience? Why or why not?",
  "data/reddit-ask/r/AskReddit/comments/nvbhxz/what_movie_tv_show_etc_had_heroes_so_insufferable.json": "What movie, TV show, etc, had \"heroes\" so insufferable you were actively rooting for the villain?",
  "data/reddit-ask/r/AskReddit/comments/nveqkf/whats_your_i_dont_know_i_didnt_think_id_get_this.json": "What's your \"I don't know, I didn't think I'd get this far\" moment?",
  "data/reddit-ask/r/AskReddit/comments/nvi5ia/what_is_the_worst_thing_you_would_wish_on_your.json": "What is the worst thing you WOULD wish on your worst enemy?",
  "data/reddit-ask/r/AskReddit/comments/nvl2dd/whats_a_book_everyone_should_read_at_least_once.json": "What’s a book everyone should read at least once in their lives?",
  "data/reddit-ask/r/AskReddit/comments/nvm78l/hikers_of_reddit_what_is_weirdestcreepiest_thing.json": "Hikers of Reddit, what is weirdest/creepiest thing you’ve come across while hiking?",
  "data/reddit-ask/r/AskReddit/comments/nvnb8d/what_is_a_good_way_to_get_rid_of_a_boner.json": "what is a good way to get rid of a boner?",
  "data/reddit-ask/r/AskReddit/comments/nvsqyr/whats_something_you_think_you_understand_why.json": "What's something you think you understand why other people like it, and wish you enjoyed it like they did, but just don't?",
  "data/reddit-ask/r/AskReddit/comments/nvtqm1/what_is_the_stupidest_thing_that_ever_came_out_of.json": "What is the stupidest thing that ever came out of your mouth?",
  "data/reddit-ask/r/AskReddit/comments/nvvf53/you_get_stuck_in_the_book_you_are_reading_now_how.json": "You get stuck in the book you are reading now. How badly are you screwed?",
  "data/reddit-ask/r/AskReddit/comments/nvxfi8/whos_that_one_celebrity_that_has_like_no_haters.json": "who's that one celebrity that has like no haters?",
  "data/reddit-ask/r/AskReddit/comments/nvxiw9/those_that_dont_have_an_internal_monologue_what.json": "Those that don't have an internal monologue, what is writing like for you?",
  "data/reddit-ask/r/AskReddit/comments/nvymi6/what_movie_should_everyone_watch_at_least_once_in.json": "What movie should everyone watch at least once in their life?",
  "data/reddit-ask/r/AskReddit/comments/nw0c0h/what_would_be_the_worst_thing_to_hear_in_a_public.json": "What would be the worst thing to hear in a public bathroom?",
  "data/reddit-ask/r/AskReddit/comments/nw0g9q/redditors_with_an_unusual_kink_what_is_it.json": "Redditors with an unusual kink, what is it?",
  "data/reddit-ask/r/AskReddit/comments/nw0lcy/the_first_time_you_heard_about_covid_how_far_did.json": "The first time you heard about Covid, how far did you think this would all go?",
  "data/reddit-ask/r/AskReddit/comments/nw7e8y/what_will_probably_be_illegal_in_25_years.json": "What will probably be illegal in 25 years?",
  "data/reddit-ask/r/AskReddit/comments/nwbbm3/what_are_some_deeply_unsettling_facts_that_you.json": "What are some deeply unsettling facts that you know?",
  "data/reddit-ask/r/AskReddit/comments/nwc1mt/if_you_could_bring_back_any_cancelled_show_for_a.json": "If you could bring back any cancelled show for a 90-minute tv movie to wrap things up, which show would you choose?",
  "data/reddit-ask/r/AskReddit/comments/nwdy5b/whos_a_celebrity_that_receives_way_more_hate_than.json": "Who's a celebrity that receives way more hate than they deserve?",
  "data/reddit-ask/r/AskReddit/comments/nwlnv2/what_tattoo_screams_i_want_ink_but_i_dont_know.json": "What tattoo screams \"I want ink but I don't know what to get\"?",
  "data/reddit-ask/r/AskReddit/comments/nwnm9t/whats_the_best_experience_youve_had_seeing_a_film.json": "What's the best experience you've had seeing a film in the theater/cinema?",
  "data/reddit-ask/r/AskReddit/comments/nwo4nm/whats_something_youve_done_that_has_probably_put.json": "What's something you've done that has probably put you on some list?",
  "data/reddit-ask/r/AskReddit/comments/nwpf1a/what_are_you_the_1_of.json": "What are you the 1% of?",
  "data/reddit-ask/r/AskReddit/comments/nwq97a/whats_a_piece_of_information_you_know_that_feels.json": "What’s a piece of information you know that feels illegal to know?",
  "data/reddit-ask/r/AskReddit/comments/nww9oz/if_you_live_in_an_area_heavily_visited_by.json": "If you live in an area heavily visited by tourists, what is the dumbest thing you've seen tourists do?",
  "data/reddit-ask/r/AskReddit/comments/nwzm5e/without_naming_the_character_whats_one_quote_that.json": "Without naming the character, what’s one quote that gives it away?",
  "data/reddit-ask/r/AskReddit/comments/nx366y/people_of_reddit_what_is_the_most_fucked_up_shit.json": "People of Reddit, what is the most fucked up shit you know?",
  "data/reddit-ask/r/AskReddit/comments/nx397w/what_is_the_most_disturbing_true_crime_story_you.json": "What is the most disturbing true crime story you know?",
  "data/reddit-ask/r/AskReddit/comments/nx3sju/what_should_society_stop_forcing_on_us.json": "What should society stop forcing on us?",
  "data/reddit-ask/r/AskReddit/comments/nx40yz/what_is_something_you_did_when_you_were_younger.json": "What is something you did when you were younger that you are still facing the consequences of?",
  "data/reddit-ask/r/AskReddit/comments/nxbnsz/what_made_you_join_reddit.json": "What made you join reddit?",
  "data/reddit-ask/r/AskReddit/comments/nxcoqv/serious_hi_there_what_did_your_crush_do_that_made.json": "[Serious] Hi there! What did your crush do that made you fall in love intensely with him or her?",
  "data/reddit-ask/r/AskReddit/comments/nxdhpx/what_are_some_reasons_to_not_move_to_your_country.json": "What are some reasons to NOT move to your country?",
  "data/reddit-ask/r/AskReddit/comments/nxf46m/pet_owners_of_reddit_how_often_do_you_call_your.json": "Pet owners of Reddit: how often do you call your pet(s) by their actual name vs a nickname?",
  "data/reddit-ask/r/AskReddit/comments/nxfzkh/how_do_introverted_people_wish_to_be_socially.json": "How do introverted people wish to be socially interacted with?",
  "data/reddit-ask/r/AskReddit/comments/nxibkp/what_are_some_skinny_people_problems.json": "What are some skinny people problems?",
  "data/reddit-ask/r/AskReddit/comments/nxmhdg/whats_really_fucked_up_but_we_are_pretty_much_ok.json": "What’s really fucked up but we are pretty much ok with?",
  "data/reddit-ask/r/AskReddit/comments/nxmvsr/whats_something_fixable_that_annoys_you_every_day.json": "What's something fixable that annoys you every day?",
  "data/reddit-ask/r/AskReddit/comments/nxqdma/liberals_of_reddit_who_were_conservative_before.json": "Liberals of reddit who were conservative before, or conservatives who were liberal before, what made you change your state of mind?",
  "data/reddit-ask/r/AskReddit/comments/nxv75u/how_do_you_cope_with_the_fact_that_were_all_going.json": "How do you cope with the fact that we're all going to die?",
  "data/reddit-ask/r/AskReddit/comments/nxvg1w/what_life_changing_item_can_you_buy_for_under_100.json": "What life changing item can you buy for under 100$?",
  "data/reddit-ask/r/AskReddit/comments/nxvl55/what_is_a_famous_movie_that_you_cannot_understand.json": "What is a famous movie that you cannot understand the appeal of?",
  "data/reddit-ask/r/AskReddit/comments/nxw1i9/spouses_who_married_the_cool_girlboy_from_your.json": "Spouses who married the cool girl/boy from your high school, what are they like now?",
  "data/reddit-ask/r/AskReddit/comments/nxxh4f/what_is_a_food_everyone_likes_but_you_hate.json": "What Is A Food Everyone Likes But You Hate?",
  "data/reddit-ask/r/AskReddit/comments/nxz63w/if_your_boner_made_a_sound_when_it_got_erect_what.json": "If your boner made a sound when it got erect, what sound would you want it to make?",
  "data/reddit-ask/r/AskReddit/comments/ny2z18/serious_what_is_something_you_wish_you_did_when.json": "[serious] What is something you wish you did when you were younger, to improve your quality of life when you got older?",
  "data/reddit-ask/r/AskReddit/comments/ny42s4/americans_of_reddit_what_do_you_think_about_the.json": "Americans of Reddit: what do you think about the metric system? Is it better or worse?",
  "data/reddit-ask/r/AskReddit/comments/ny5zzj/whats_something_you_secretly_judge_people_about.json": "What’s something you secretly judge people about?",
  "data/reddit-ask/r/AskReddit/comments/ny82tc/what_is_something_you_have_always_regretted_doing.json": "What is something you have always regretted doing?",
  "data/reddit-ask/r/AskReddit/comments/ny8kvv/what_is_something_that_was_hugely_popular_back_in.json": "What is something that was hugely popular back in the day, but would not be popular if it came out today?",
  "data/reddit-ask/r/AskReddit/comments/nya5k7/serious_what_gives_your_life_meaning.json": "[SERIOUS] What gives your life meaning?",
  "data/reddit-ask/r/AskReddit/comments/nyiurf/whats_the_most_memorable_comeback_youve_heard_in.json": "What’s the most memorable comeback you’ve heard in your life?",
  "data/reddit-ask/r/AskReddit/comments/nykgmy/whats_the_scariest_thing_thats_ever_happened_to.json": "What’s the scariest thing that’s ever happened to you?",
  "data/reddit-ask/r/AskReddit/comments/nykkbo/whats_a_movie_you_loved_as_a_child_that_you_now.json": "What's a movie you loved as a child that you now consider to be cringe worthy?",
  "data/reddit-ask/r/AskReddit/comments/nym67s/out_of_all_the_deaths_you_seen_in_movies_which.json": "Out of all the deaths you seen in movies, which one really stands out to you as the worst?",
  "data/reddit-ask/r/AskReddit/comments/nyo8fj/what_do_you_suspect_is_true_but_you_cant_prove_it.json": "What do you suspect is true but you can’t prove it?",
  "data/reddit-ask/r/AskReddit/comments/nyomy9/whats_scarier_at_day_than_night.json": "What's scarier at day than night?",
  "data/reddit-ask/r/AskReddit/comments/nypysn/if_we_judge_the_older_generations_now_for_being.json": "If we judge the older generations now for being racist, what do you think the future generations will judge us for?",
  "data/reddit-ask/r/AskReddit/comments/nyv58m/what_popular_movie_have_you_never_seen.json": "What popular movie have you never seen?",
  "data/reddit-ask/r/AskReddit/comments/nywjgk/what_screams_that_person_that_everyone_hates.json": "What screams “that person that everyone hates?”",
  "data/reddit-ask/r/AskReddit/comments/nyx1vk/whats_something_you_made_that_was_100_delicious.json": "What's something you made that was 100% delicious but Gordon Ramsay would slap you for anyway?",
  "data/reddit-ask/r/AskReddit/comments/nyyba3/what_are_some_insane_books_to_enlighten_your_brain.json": "What are some insane books to enlighten your brain?",
  "data/reddit-ask/r/AskReddit/comments/nz1gwz/what_food_is_overhyped.json": "What food is overhyped?",
  "data/reddit-ask/r/AskReddit/comments/nz2pj6/whats_the_worst_double_standard.json": "What's the WORST double standard?",
  "data/reddit-ask/r/AskReddit/comments/nz4ojn/what_movie_can_you_ruin_by_adding_the_word_moist.json": "What movie can you ruin by adding the word MOIST in the title?",
  "data/reddit-ask/r/AskReddit/comments/nz58h6/serious_people_who_knew_murders_before_they.json": "(Serious) People who knew murders before they killed someone, what are some red flags you didn’t notice at the time?",
  "data/reddit-ask/r/AskReddit/comments/nz6hwd/what_is_the_most_boring_large_city_on_earth.json": "What is the most boring large city on Earth?",
  "data/reddit-ask/r/AskReddit/comments/nz70xx/people_who_have_taken_the_gas_station_sex.json": "People who have taken the gas station sex boosting pill why and how'd it go?",
  "data/reddit-ask/r/AskReddit/comments/nzcyl9/how_do_you_cope_with_all_of_the_terrible_things.json": "How do you cope with all of the terrible things going on in the world?",
  "data/reddit-ask/r/AskReddit/comments/nzg6d0/exsuicidal_people_of_reddit_who_are_currently.json": "Ex-suicidal people of reddit who are currently genuinely happy and enjoying life right now, whats your story?",
  "data/reddit-ask/r/AskReddit/comments/nzgi9z/what_is_your_opinion_of_restaurants_that_ban.json": "What is your opinion of restaurants that ban children?",
  "data/reddit-ask/r/AskReddit/comments/nzhs2l/what_are_early_signs_of_an_abusive_partner.json": "What are early signs of an abusive partner?",
  "data/reddit-ask/r/AskReddit/comments/nzhzal/what_is_perfectly_legal_but_creepy_as_hell.json": "What is perfectly legal, but creepy as hell?",
  "data/reddit-ask/r/AskReddit/comments/nzmzsn/who_is_seen_as_a_good_guy_in_history_but_was.json": "Who is seen as a “good guy” in history but was actually a terrible person?",
  "data/reddit-ask/r/AskReddit/comments/nzolbe/serious_what_is_illegal_but_most_people_dont_even.json": "[Serious] What is illegal but most people don't even know it?",
  "data/reddit-ask/r/AskReddit/comments/nzospf/what_movie_you_fucking_hate_to_death_why.json": "What movie you fucking hate to death? Why?",
  "data/reddit-ask/r/AskReddit/comments/nzpoda/what_are_your_absolutely_weirdest_runs_in_the.json": "What are your absolutely weirdest \"runs in the family\" traits or characteristics?",
  "data/reddit-ask/r/AskReddit/comments/nzs14j/who_is_seen_as_a_bad_guy_in_history_but_was.json": "Who is seen as a ‘bad guy’ in history but was actually ok?",
  "data/reddit-ask/r/AskReddit/comments/nzx3h0/serious_what_are_some_of_the_small_things_in_life.json": "[Serious] What are some of the small things in life that make you happy?",
  "data/reddit-ask/r/AskReddit/comments/o00g20/whats_the_strangestscariest_thing_youve_seen_in.json": "What’s the strangest/scariest thing you’ve seen in the middle of the night?",
  "data/reddit-ask/r/AskReddit/comments/o01ein/what_makes_you_nervous_no_matter_how_many_times.json": "What makes you nervous no matter how many times you do it?",
  "data/reddit-ask/r/AskReddit/comments/o04m7r/what_are_the_best_games_for_gettogethers_with.json": "What are the best games for get-togethers with friends?",
  "data/reddit-ask/r/AskReddit/comments/o0602n/what_should_people_know_about_fighting_serious.json": "What should people know about fighting? [Serious]",
  "data/reddit-ask/r/AskReddit/comments/o0cqo1/its_a_saturday_morning_when_you_were_a_kid_what.json": "It's a Saturday morning when you were a kid. What cartoons are you watching?",
  "data/reddit-ask/r/AskReddit/comments/o0cyeh/what_do_people_think_makes_them_look_cool_but.json": "What do people think makes them look cool, but actually makes them look like a douchebag?",
  "data/reddit-ask/r/AskReddit/comments/o0g3tf/what_is_something_that_used_to_be_considered.json": "What is something that used to be considered safe/okay but now we know is harmful?",
  "data/reddit-ask/r/AskReddit/comments/o0k7ma/what_is_the_most_insane_documentary_youve_ever.json": "What is the most insane documentary you've ever seen?",
  "data/reddit-ask/r/AskReddit/comments/o0mihe/what_is_a_single_sentence_that_can_trigger_an.json": "What is a single sentence that can trigger an entire fanbase?",
  "data/reddit-ask/r/AskReddit/comments/o0o677/whats_your_favorite_question_to_ask_someone_to.json": "What’s your favorite question to ask someone to get to know them better?",
  "data/reddit-ask/r/AskReddit/comments/o0rupf/home_inspectors_of_reddit_what_are_some_horrible.json": "Home inspectors of reddit, what are some horrible things that almost went unnoticed?",
  "data/reddit-ask/r/AskReddit/comments/o0ukf1/whats_something_youre_good_at_but_dont_get_to.json": "What’s something you’re good at but don’t get to brag about much?",
  "data/reddit-ask/r/AskReddit/comments/o0x06o/ladies_what_is_a_dead_giveaway_that_a_man_watches.json": "Ladies: What is a dead give-away that a man watches too much porn when he’s in bed with you?",
  "data/reddit-ask/r/AskReddit/comments/o0z2v2/redditors_who_watched_an_r_rated_film_when_they.json": "Redditors who watched an R rated film when they were a kid, how did it effect you as a child? [Serious]",
  "data/reddit-ask/r/AskReddit/comments/o12s5e/what_recent_movies_will_be_considered_classics_25.json": "What recent movies will be considered classics 25 years from now?",
  "data/reddit-ask/r/AskReddit/comments/o135od/drill_instructors_drill_sergeants_of_reddit_what.json": "Drill instructors/ Drill sergeants of reddit, what is the funniest thing you have seen a Private do?",
  "data/reddit-ask/r/AskReddit/comments/o154tx/guys_whats_a_good_sign_that_a_woman_is_just_using.json": "Guys, What's a good sign that a woman is just using you?",
  "data/reddit-ask/r/AskReddit/comments/o16ufn/progressivesleftists_of_reddit_whats_your_most.json": "Progressives/Leftists of Reddit, what's your most conservative believe?",
  "data/reddit-ask/r/AskReddit/comments/o1827t/divorced_redditors_what_is_the_craziest_thing_you.json": "Divorced Redditors, what is the craziest thing you or your former spouse did after divorce?",
  "data/reddit-ask/r/AskReddit/comments/o185wu/serious_people_who_unironically_tell_jokes_about.json": "[Serious] People who unironically tell jokes about how they hate their significant other - why don't you just split up / get divorced?",
  "data/reddit-ask/r/AskReddit/comments/o18b7r/what_is_your_goto_comeback_when_insulted.json": "What is your go-to comeback when insulted?",
  "data/reddit-ask/r/AskReddit/comments/o1bs06/people_who_lived_under_communism_what_was_it_like.json": "People who lived under communism what was it like?",
  "data/reddit-ask/r/AskReddit/comments/o1e2zs/what_is_the_coldest_way_you_found_out_your.json": "What is the coldest way you found out your relationship was over?",
  "data/reddit-ask/r/AskReddit/comments/o1hasb/serious_employers_whats_the_most_insane_complaint.json": "(Serious) Employers, what's the most insane complaint you've had about an employee that turned out to be completely true?",
  "data/reddit-ask/r/AskReddit/comments/o1hgg6/what_is_a_massive_recent_event_to_us_past_5_years.json": "What is a massive recent event to us (past 5 years) that will be forgotten by history?",
  "data/reddit-ask/r/AskReddit/comments/o1l3p1/you_have_24_hours_to_get_yourself_on_national.json": "You have 24 hours to get yourself on national television, not just in the background, but as a featured segment. If you succeed, you will be given 100 million dollars. You will have to face the consequences of any crime you commit. What would you do?",
  "data/reddit-ask/r/AskReddit/comments/o1ndl9/if_you_were_all_of_a_sudden_asked_to_stand_up_and.json": "If you were all of a sudden asked to stand up and give a 1 hour talk on something, what subject would you pick?",
  "data/reddit-ask/r/AskReddit/comments/o1oy6f/what_is_the_most_awkward_live_television_moment.json": "What is the most awkward live television moment that you are aware of?",
  "data/reddit-ask/r/AskReddit/comments/o1wl1j/what_is_the_worst_season_of_a_good_show.json": "What is the worst season of a good show?",
  "data/reddit-ask/r/AskReddit/comments/o1zbql/people_who_actually_love_their_jobs_how_and_why.json": "People who actually love their jobs: how and why?",
  "data/reddit-ask/r/AskReddit/comments/o22ot1/what_does_work_but_shouldnt_work.json": "What does work, but shouldn't work?",
  "data/reddit-ask/r/AskReddit/comments/o26dxe/president_biden_just_signed_and_juneteenth_is_now.json": "President Biden just signed, and Juneteenth Is now an official Federal Holiday. What are your thoughts?",
  "data/reddit-ask/r/AskReddit/comments/o2clnt/what_is_the_worst_ending_you_have_seen_in_a_movie.json": "What is the worst ending you have seen in a movie?",
  "data/reddit-ask/r/AskReddit/comments/o2doky/lawyers_of_reddit_how_do_you_argue_without_crying.json": "Lawyers of Reddit, how do you argue without crying?",
  "data/reddit-ask/r/AskReddit/comments/o2dtro/unburden_yourself_here_what_is_destroying_you.json": "Unburden yourself here, what is destroying you right now?",
  "data/reddit-ask/r/AskReddit/comments/o2fmfy/for_5000_you_have_to_watch_the_same_movie_on.json": "For $5,000 you have to watch the same movie on repeat for 48 hours. What movie are you picking?",
  "data/reddit-ask/r/AskReddit/comments/o2gly2/whats_something_that_people_glamourize_but_its.json": "What's something that people glamourize but it's actually just extremely toxic?",
  "data/reddit-ask/r/AskReddit/comments/o2h1gv/whats_that_one_blatantly_illegal_or_unethical.json": "What’s that one blatantly illegal or unethical thing management forced you to do at work??",
  "data/reddit-ask/r/AskReddit/comments/o2hlbv/your_consciousness_is_sent_back_to_when_you_were.json": "Your consciousness is sent back to when you were at age 15, and you maintain all of your current knowledge and experience. What do you do?",
  "data/reddit-ask/r/AskReddit/comments/o2k7ki/people_over_35_who_havent_lost_their_virginity.json": "People over 35 who haven't lost their virginity yet, what's the story?",
  "data/reddit-ask/r/AskReddit/comments/o2pdr3/why_did_your_friend_group_break_up.json": "Why did your friend group break up?",
  "data/reddit-ask/r/AskReddit/comments/o2pu1v/if_you_came_with_a_disclaimer_what_would_it_say.json": "If you came with a disclaimer what would it say?",
  "data/reddit-ask/r/AskReddit/comments/o2qda4/you_are_kidnapped_and_blindfolded_after_a_while.json": "you are kidnapped and blindfolded. after a while you hear something that makes you realize you are now in Florida. what you heard cannot contain the word \"Florida\". what did you hear?",
  "data/reddit-ask/r/AskReddit/comments/o2rc2n/what_common_foods_in_your_country_are_considered.json": "What common foods in your country are considered delicacies by foreigners?",
  "data/reddit-ask/r/AskReddit/comments/o2rx69/people_who_got_fired_for_the_stupidest_reason.json": "People who got fired for the stupidest reason, what happened?",
  "data/reddit-ask/r/AskReddit/comments/o2te3k/whats_the_creepiest_thing_you_caught_someone_doing.json": "What’s the creepiest thing you caught someone doing?",
  "data/reddit-ask/r/AskReddit/comments/o2uajp/what_video_game_is_actually_extremely_depressing.json": "What video game is actually extremely depressing to play?",
  "data/reddit-ask/r/AskReddit/comments/o33np7/what_are_some_obscure_video_games_you_grew_up_with.json": "What are some obscure video games you grew up with?",
  "data/reddit-ask/r/AskReddit/comments/o359j3/how_would_the_world_be_different_if_we_valued.json": "How would the world be different if we valued rest, relaxation and patience over excessive hard work, building wealth and instant gratification?",
  "data/reddit-ask/r/AskReddit/comments/o370ov/whats_the_pettiest_reason_youve_rejected_someone.json": "What's the pettiest reason you've rejected someone?",
  "data/reddit-ask/r/AskReddit/comments/o37z71/whats_a_scam_most_people_dont_even_realize_is_a.json": "What’s a scam most people don’t even realize is a scam?",
  "data/reddit-ask/r/AskReddit/comments/o3ca87/what_if_earth_is_like_one_of_those_uncontacted.json": "What if Earth is like one of those uncontacted tribes in South America, like the whole Galaxy knows we're here but they've agreed not to contact us until we figure it out for ourselves?",
  "data/reddit-ask/r/AskReddit/comments/o3co34/what_everyday_skill_becomes_suspicious_if_youre.json": "What everyday skill becomes suspicious if you’re too good at it?",
  "data/reddit-ask/r/AskReddit/comments/o3ddgx/people_who_listen_to_what_ever_music_sounds_good.json": "People who listen to what ever music sounds good and don't really have a genre , What's a song that someone showed you or found by accident and was good ?",
  "data/reddit-ask/r/AskReddit/comments/o3emae/former_disney_theme_park_employees_of_reddit_what.json": "Former Disney theme park employees of Reddit, what are some dirty secrets or stories you can tell us about your time there?",
  "data/reddit-ask/r/AskReddit/comments/o3fgd9/lefties_of_reddit_what_is_something_us.json": "Lefties of Reddit, what is something us right-handed people won't understand?",
  "data/reddit-ask/r/AskReddit/comments/o3g2ax/was_there_ever_a_time_youre_thankful_the_pandemic.json": "Was there ever a time you're thankful the pandemic happened? What was the reason?",
  "data/reddit-ask/r/AskReddit/comments/o3gr8i/whats_a_movie_that_doesnt_have_a_romantic_plot_or.json": "What's a movie that DOESN'T have a romantic plot OR sub-plot?",
  "data/reddit-ask/r/AskReddit/comments/o3hizm/what_extremely_minor_superpower_would_you_choose.json": "What extremely minor superpower would you choose?",
  "data/reddit-ask/r/AskReddit/comments/o3pzaq/gay_men_what_do_you_think_about_boobs.json": "Gay men, what do you think about boobs?",
  "data/reddit-ask/r/AskReddit/comments/o3q4vt/what_should_you_do_once_but_not_twice.json": "What should you do once, but not twice?",
  "data/reddit-ask/r/AskReddit/comments/o3ui7k/what_is_a_tv_show_that_was_great_all_the_way_to.json": "What is a TV Show that was great all the way to the end?",
  "data/reddit-ask/r/AskReddit/comments/o3vxsy/what_is_something_you_were_bullied_for_growing_up.json": "What is something you were bullied for growing up that has now become a trend?",
  "data/reddit-ask/r/AskReddit/comments/o3vydx/what_is_the_stupidest_injury_youve_ever_gotten.json": "What is the stupidest injury you've ever gotten?",
  "data/reddit-ask/r/AskReddit/comments/o46b9s/whats_something_nostalgic_for_your_age_group.json": "What's something nostalgic for your age group?",
  "data/reddit-ask/r/AskReddit/comments/o46lf1/how_do_you_not_get_completely_anxious_and.json": "How do you not get completely anxious and terrified at the state of the world today?",
  "data/reddit-ask/r/AskReddit/comments/o47bqh/what_are_your_thoughts_on_parallel_universes.json": "What are your thoughts on parallel universes?",
  "data/reddit-ask/r/AskReddit/comments/o49ulg/fathers_of_reddit_in_honour_of_fathers_day_what.json": "Fathers of reddit in honour of fathers day what is you're favorite dad joke?",
  "data/reddit-ask/r/AskReddit/comments/o4d5wa/parents_of_porn_actors_when_did_you_find_out_and.json": "Parents of porn actors, when did you find out and how did you react/how do you deal with it?",
  "data/reddit-ask/r/AskReddit/comments/o4h0v1/home_depot_paint_mixers_of_reddit_what_is_the.json": "Home Depot paint mixers of Reddit, what is the weirdest thing you’ve had to color match?",
  "data/reddit-ask/r/AskReddit/comments/o4h10j/whats_the_stupidest_thing_you_did_because_you.json": "What’s the stupidest thing you did because you were horny?",
  "data/reddit-ask/r/AskReddit/comments/o4it2g/reddit_what_are_your_thoughts_about_having_a.json": "Reddit, what are your thoughts about having a mandatory high school class that teaches kids about the fundamentals of adulthood including finances, taxes, credit, mortgages, and more?",
  "data/reddit-ask/r/AskReddit/comments/o4jev1/whats_the_most_dangerous_thing_you_did_as_a_kid.json": "What's the most dangerous thing you did as a kid without realizing?",
  "data/reddit-ask/r/AskReddit/comments/o4mgvu/how_do_native_english_speakers_still_mix_up_youre.json": "How do native english speakers STILL mix up \"you're\" and \"your\" or \"their\", \"there\" and \"they're\"?",
  "data/reddit-ask/r/AskReddit/comments/o4mr7y/what_conversation_or_interaction_with_a.json": "What conversation or interaction with a physically normal stranger left you wondering if you'd just talked to something non-human or supernatural (like an angel/demon/ghost/alien/time traveller etc.)?",
  "data/reddit-ask/r/AskReddit/comments/o4p5wl/what_movie_is_so_good_but_so_depressing_that_you.json": "What movie is so good but so depressing that you can't watch it again?",
  "data/reddit-ask/r/AskReddit/comments/o4rxgh/if_you_were_given_50000_dollars_so_you_could.json": "If you were given 50,000 dollars so you could chase your dream, what dream would you chase?",
  "data/reddit-ask/r/AskReddit/comments/o4tzin/what_short_movie_quote_can_people_instantly.json": "What short movie quote can people instantly recognise?",
  "data/reddit-ask/r/AskReddit/comments/o4u4n3/people_who_have_worked_on_infamously_bad.json": "People who have worked on infamously bad products/games/apps/films, did you know it was bad when it was being made? Did the company? What happened?",
  "data/reddit-ask/r/AskReddit/comments/o4xlqb/what_is_something_most_people_dont_realize_is_a.json": "What is something most people don’t realize is a privilege?",
  "data/reddit-ask/r/AskReddit/comments/o4yj4j/what_do_you_think_is_the_most_overrated_movie_ever.json": "What do you think is the most overrated movie ever?",
  "data/reddit-ask/r/AskReddit/comments/o51m0c/what_is_normalized_in_porn_but_isnt_so_normal_irl.json": "What is normalized in porn but isn't so normal irl?",
  "data/reddit-ask/r/AskReddit/comments/o553il/people_who_carry_those_large_duffle_bags_to_the.json": "People who carry those large duffle bags to the gym.... what’s in there?",
  "data/reddit-ask/r/AskReddit/comments/o56n1t/what_is_something_youve_done_purely_out_of_the.json": "What is something you’ve done purely out of the goodness of your heart, but have never told anyone?",
  "data/reddit-ask/r/AskReddit/comments/o5b2ku/what_is_the_female_equivalent_to_being_a_leg_man.json": "What is the female equivalent to being a “leg man” or a “breast man”?",
  "data/reddit-ask/r/AskReddit/comments/o5d4n8/whats_your_favorite_song_in_a_language_that_you.json": "What’s your favorite song in a language that you can’t speak?",
  "data/reddit-ask/r/AskReddit/comments/o5dmyj/what_are_your_thoughts_on_medically_assisted_death.json": "What are your thoughts on medically assisted death?",
  "data/reddit-ask/r/AskReddit/comments/o5jepd/what_do_you_wish_was_illegal.json": "What do you wish was illegal?",
  "data/reddit-ask/r/AskReddit/comments/o5kwm1/redditors_who_have_stumbled_upon_human_remains.json": "Redditors who have stumbled upon human remains, what’s your story?",
  "data/reddit-ask/r/AskReddit/comments/o5lyoh/what_are_the_unwritten_rules_for_new_reddit_users.json": "What are the \"unwritten\" rules for new Reddit users?",
  "data/reddit-ask/r/AskReddit/comments/o5mpk2/whats_this_chapter_of_your_life_called.json": "What's this chapter of your life called?",
  "data/reddit-ask/r/AskReddit/comments/o5n00e/what_is_your_biggest_nonacademic_non_workrelated.json": "What is your biggest non-academic, non work-related accomplishment?",
  "data/reddit-ask/r/AskReddit/comments/o5n9s0/since_deaf_people_dont_hear_them_self_how_loud.json": "Since deaf people don't hear them self, how loud are they during sex?",
  "data/reddit-ask/r/AskReddit/comments/o5pkfr/girls_of_reddit_what_are_some_seemingly_small.json": "Girls of Reddit, what are some seemingly small gestures you wish guys did more often?",
  "data/reddit-ask/r/AskReddit/comments/o5r5a9/lawyerssolictors_what_is_the_strangest_or_oddest.json": "Lawyers/Solictors, what is the strangest or oddest law that's won a case for you?",
  "data/reddit-ask/r/AskReddit/comments/o5rr7r/what_do_most_people_not_understand_about_being.json": "What do most people not understand about being poor?",
  "data/reddit-ask/r/AskReddit/comments/o5t7h3/what_widely_believed_historical_fact_is_actually.json": "What widely believed historical \"fact\" is actually totally false?",
  "data/reddit-ask/r/AskReddit/comments/o5wuxc/guys_what_are_the_sensation_differences_with.json": "Guys, what are the sensation differences with putting your penis in a mouth, vagina, and ass, and which do you prefer?",
  "data/reddit-ask/r/AskReddit/comments/o5wzlu/whats_something_normal_the_rest_of_the_world_does.json": "What's something normal the rest of the world does, that americans are confused by?",
  "data/reddit-ask/r/AskReddit/comments/o62isz/which_store_is_the_most_painful_to_shop_at.json": "Which store is the most painful to shop at?",
  "data/reddit-ask/r/AskReddit/comments/o633y0/what_popular_sayings_are_actually_bullshit.json": "What popular sayings are actually bullshit?",
  "data/reddit-ask/r/AskReddit/comments/o63ev2/what_did_your_teacher_do_that_made_you_call_them.json": "What did your teacher do that made you call them \"worst teacher ever\"?",
  "data/reddit-ask/r/AskReddit/comments/o6446e/what_is_something_subtle_people_say_that_is_a_red.json": "What is something subtle people say that is a red flag to you?",
  "data/reddit-ask/r/AskReddit/comments/o64f2u/what_is_the_biggest_plot_hole_of_reality.json": "What is the biggest plot hole of reality?",
  "data/reddit-ask/r/AskReddit/comments/o65mi1/after_sex_she_asks_what_are_we_how_do_you_reply.json": "After sex she asks \"What are we?\" How do you reply?",
  "data/reddit-ask/r/AskReddit/comments/o670dd/say_you_get_kidnapped_by_someone_but_instead_of.json": "Say you get kidnapped by someone but instead of killing you they ask you \"Duel me in any game it's your choice, If you lose you get killed, if you win I have to let you go.\" what's your game choice?",
  "data/reddit-ask/r/AskReddit/comments/o68orw/do_you_sleep_naked_why_or_why_not.json": "Do you sleep naked? Why or why not?",
  "data/reddit-ask/r/AskReddit/comments/o6bsx9/what_fan_base_community_do_you_know_that_just.json": "What fan base/ community do you know that just needs to chill out?",
  "data/reddit-ask/r/AskReddit/comments/o6c5se/serious_what_celebrity_death_hit_you_the_hardest.json": "[Serious] What celebrity death hit you the hardest?",
  "data/reddit-ask/r/AskReddit/comments/o6cmrp/what_single_question_reveals_the_most_about_a.json": "What single question reveals the most about a person?",
  "data/reddit-ask/r/AskReddit/comments/o6dx0z/canadians_of_reddit_if_a_new_gta_game_gets.json": "Canadians of reddit: if a new GTA game gets released where it's 'Greater Toronto Area', what are some of the unique quests in the game ?",
  "data/reddit-ask/r/AskReddit/comments/o6fxff/your_username_is_the_reason_why_your_house_was.json": "Your username is the reason why your house was destroyed. What happened?",
  "data/reddit-ask/r/AskReddit/comments/o6m7ho/what_tv_showseries_have_you_been_most_deeply.json": "What tv show/series have you been most deeply attached to?",
  "data/reddit-ask/r/AskReddit/comments/o6r6vq/what_is_a_song_you_instantly_fell_in_love_with.json": "What is a song you instantly fell in love with?",
  "data/reddit-ask/r/AskReddit/comments/o6uxyr/if_you_were_given_a_chance_to_rename_the_moon.json": "If you were given a chance to rename the moon, what will you name it?",
  "data/reddit-ask/r/AskReddit/comments/o6veez/serious_frequent_travelers_of_reddit_whats.json": "[Serious] Frequent travelers of reddit, what's something you saw when traveling that was so scary you never went back somewhere?",
  "data/reddit-ask/r/AskReddit/comments/o6vnbi/which_body_part_of_the_opposite_gender_do_you.json": "Which body part of the opposite gender do you find most attractive?",
  "data/reddit-ask/r/AskReddit/comments/o6xeqw/what_is_an_activity_that_keeps_you_away_from_your.json": "What is an activity that keeps you away from your phone for hours?",
  "data/reddit-ask/r/AskReddit/comments/o6y9oq/what_is_the_easiest_way_to_make_a_million_dollars.json": "What is the easiest way to make a million dollars?",
  "data/reddit-ask/r/AskReddit/comments/o6yinb/you_have_a_infinite_supply_of_potatoes_what_do.json": "You have a infinite supply of potatoes. What do you do?",
  "data/reddit-ask/r/AskReddit/comments/o70pzg/what_is_something_you_should_not_be_afraid_of.json": "What is something you should not be afraid of?",
  "data/reddit-ask/r/AskReddit/comments/o712hj/people_who_caught_other_people_naked_or_having.json": "People who caught other people naked or having sex through windows or in public, what happened?",
  "data/reddit-ask/r/AskReddit/comments/o728ps/what_is_something_an_adult_told_you_as_a_kid.json": "What is something an adult told you as a kid \"you'll understand when you're older\", that you now understand because you're older?",
  "data/reddit-ask/r/AskReddit/comments/o76lzv/which_celebrity_can_just_fuck_off.json": "Which celebrity can just fuck off?",
  "data/reddit-ask/r/AskReddit/comments/o782em/whats_a_famous_cover_song_that_not_many_people.json": "What’s a famous cover song that not many people know is a cover?",
  "data/reddit-ask/r/AskReddit/comments/o7bmha/what_movie_franchise_shouldve_stopped_at_2.json": "What movie franchise should’ve stopped at 2?",
  "data/reddit-ask/r/AskReddit/comments/o7jeqe/you_die_and_get_sent_to_hell_but_satan_shakes.json": "You die and get sent to hell but Satan shakes your hand and says “I’m glad I finally got to meet you,” what did you do?",
  "data/reddit-ask/r/AskReddit/comments/o7kgzo/who_has_the_sexiest_voice_youve_ever_heard.json": "Who has the sexiest voice you've ever heard?",
  "data/reddit-ask/r/AskReddit/comments/o7mdyf/males_of_reddit_what_are_some_guy_tips_you_think.json": "Males of reddit, what are some \"guy tips\" you think every man should know?",
  "data/reddit-ask/r/AskReddit/comments/o7q46f/straight_men_of_reddit_who_is_your_man_crush.json": "Straight men of reddit, who is your man crush?",
  "data/reddit-ask/r/AskReddit/comments/o7r41u/what_movie_can_we_all_agree_is_terrible.json": "What movie can we all agree is terrible?",
  "data/reddit-ask/r/AskReddit/comments/o7rawv/you_are_stuck_in_an_elevator_with_the_person_on.json": "You are stuck in an elevator with the person on your lock screen. Who are you stuck with?",
  "data/reddit-ask/r/AskReddit/comments/o7suqp/what_made_you_orgasm_like_never_before.json": "What made you orgasm like never before?",
  "data/reddit-ask/r/AskReddit/comments/o7ymgw/whats_something_everyone_should_know_before.json": "What's something everyone should know before having sex for the first time?",
  "data/reddit-ask/r/AskReddit/comments/o80tpj/serious_when_you_turned_18moved_out_of_your.json": "[SERIOUS] When you turned 18/moved out of your parents house on your own, what were some life lessons you wish someone told you or warned you about being a grown up or being out on your own, instead of just \"figuring it out?\"",
  "data/reddit-ask/r/AskReddit/comments/o81fm8/autopsy_doctors_of_reddit_what_was_strangest.json": "Autopsy Doctors of Reddit, what was strangest discovery you’ve made while preforming an autopsy?",
  "data/reddit-ask/r/AskReddit/comments/o84o4k/escape_room_operators_of_reddit_what_was_the.json": "Escape room operators of Reddit, what was the weirdest thing you've seen a group do?",
  "data/reddit-ask/r/AskReddit/comments/o85hhs/what_song_lyrics_is_instantly_recognizable.json": "What song lyrics is instantly recognizable?",
  "data/reddit-ask/r/AskReddit/comments/o86lhf/what_would_happen_if_instead_of_a_stream_people.json": "What would happen if instead of a stream, people pee'd via blasting their entire load all at once like a shotgun blast?",
  "data/reddit-ask/r/AskReddit/comments/o87tel/what_is_your_catchphrase.json": "What is your catchphrase?",
  "data/reddit-ask/r/AskReddit/comments/o88kre/what_movie_is_a_1010.json": "What movie is a 10/10?",
  "data/reddit-ask/r/AskReddit/comments/o8a238/you_are_the_worlds_worst_marriage_guidance.json": "You are the world's worst marriage guidance counselor. What advice do you give?",
  "data/reddit-ask/r/AskReddit/comments/o8apvu/if_youve_been_sentenced_to_death_but_they_let_you.json": "If you've been sentenced to death but they let you choose your own method, what would it be ?",
  "data/reddit-ask/r/AskReddit/comments/o8cmeb/what_video_game_is_a_1010.json": "What video game is a 10/10?",
  "data/reddit-ask/r/AskReddit/comments/o8e0sn/whats_not_as_sexy_as_most_people_seem_to_think_it.json": "What’s not as sexy as most people seem to think it is?",
  "data/reddit-ask/r/AskReddit/comments/o8h3b8/what_were_you_doing_on_9112001.json": "What were you doing on 9/11/2001?",
  "data/reddit-ask/r/AskReddit/comments/o8hh7f/people_who_keep_trying_to_open_a_clearly_locked.json": "People who keep trying to open a clearly locked bathroom door... Why?",
  "data/reddit-ask/r/AskReddit/comments/o8nhqe/people_who_unpack_their_clothes_and_put_them_in_a.json": "People who unpack their clothes and put them in a hotel room’s dresser drawers…why?",
  "data/reddit-ask/r/AskReddit/comments/o8nkbw/whats_something_that_people_turn_into_their_whole.json": "What’s something that people turn into their whole personality?",
  "data/reddit-ask/r/AskReddit/comments/o8nwxz/what_can_you_say_during_sex_but_also_at_a_family.json": "What can you say during sex, but also at a family dinner?",
  "data/reddit-ask/r/AskReddit/comments/o8qkyf/straight_men_of_reddit_what_is_something_youve.json": "Straight men of Reddit, what is something you've been told not to do because it's \"gay\"?",
  "data/reddit-ask/r/AskReddit/comments/o8rete/how_do_you_guys_feel_about_women_asking_you_out.json": "How do you guys feel about women asking you out?",
  "data/reddit-ask/r/AskReddit/comments/o8s3os/everyone_wants_to_be_attractive_but_what_are_some.json": "\"Everyone wants to be attractive\", but what are some disadvantages of being highly physically attractive?",
  "data/reddit-ask/r/AskReddit/comments/o8stou/what_common_things_in_porn_are_a_turn_off_for_you.json": "What common things in porn are a turn off for you?",
  "data/reddit-ask/r/AskReddit/comments/o8ugdl/you_are_stuck_in_an_elevator_with_the_main.json": "You are stuck in an elevator with the main character in the last book you read. Who are you stuck with?",
  "data/reddit-ask/r/AskReddit/comments/o8w0zy/what_is_the_worst_age.json": "What is the worst age?",
  "data/reddit-ask/r/AskReddit/comments/o8wkg3/whats_something_thats_cute_when_youre_a_kid_but.json": "What's something that's \"cute\" when you're a kid, but creepy when you're an adult?",
  "data/reddit-ask/r/AskReddit/comments/o8xe7b/what_do_you_think_about_shazam_for_birds_an_app.json": "What do you think about Shazam for birds, an app that identifies what kind of bird is singing?",
  "data/reddit-ask/r/AskReddit/comments/o8y3tn/men_of_reddit_what_pisses_you_off_most_about.json": "Men of Reddit, what pisses you off most about other men?",
  "data/reddit-ask/r/AskReddit/comments/o8yzxq/which_movie_title_becomes_funny_if_you_add_in_the.json": "Which movie title becomes funny if you add \"in the toilet\" after it?",
  "data/reddit-ask/r/AskReddit/comments/o93epp/911_operators_of_reddit_what_is_the_pettiest.json": "911 Operators of Reddit, what is the pettiest reason someone has called 911?",
  "data/reddit-ask/r/AskReddit/comments/o978gm/whats_one_food_everyone_seems_to_love_but_you.json": "What's one food everyone seems to love but you find repulsive?",
  "data/reddit-ask/r/AskReddit/comments/o97ton/redditors_who_live_in_a_beautiful_home_with_a.json": "Redditors who live in a beautiful home, with a beautiful wife, and drive a large automobile, or have found themselves in another part of the world: well, how did you get here?",
  "data/reddit-ask/r/AskReddit/comments/o98y37/men_of_reddit_what_is_a_turn_on_most_girls_dont.json": "Men of Reddit, what is a turn on most girls don't even think of?",
  "data/reddit-ask/r/AskReddit/comments/o998ca/replace_the_main_star_of_any_movie_with_jack.json": "Replace the main star of any movie with Jack Black. What movie becomes the greatest?",
  "data/reddit-ask/r/AskReddit/comments/o99ui1/whats_a_rabbit_hole_that_would_blow_most_peoples.json": "What’s a rabbit hole that would blow most people’s mind within an hour?",
  "data/reddit-ask/r/AskReddit/comments/o9bxpd/what_is_an_alternative_but_equivalent_pleasure_to.json": "what is an alternative but equivalent pleasure to sex?",
  "data/reddit-ask/r/AskReddit/comments/o9ftb4/what_is_expensive_but_worth_buying.json": "What is expensive, but worth buying?",
  "data/reddit-ask/r/AskReddit/comments/o9h1dy/if_you_were_on_your_death_bed_what_would_your.json": "If you were on your death bed, what would your final words be?",
  "data/reddit-ask/r/AskReddit/comments/o9htwd/the_last_person_you_searched_up_on_google_has_sex.json": "The last person you searched up on Google has sex with you, who would it be?",
  "data/reddit-ask/r/AskReddit/comments/o9jrmo/nonboomers_of_reddit_whats_your_most_boomer.json": "Non-boomers of Reddit, what's your most boomer opinion?",
  "data/reddit-ask/r/AskReddit/comments/o9lgpm/the_ratio_of_people_to_insects_is_114_billions_if.json": "The ratio of people to insects is 1:1.4 billions. If there was a war how would you fight your 1.4 billion?",
  "data/reddit-ask/r/AskReddit/comments/o9ltn5/whats_a_sign_that_a_movie_is_gonna_be_good.json": "What's a sign that a movie is gonna be good?",
  "data/reddit-ask/r/AskReddit/comments/o9o5ov/what_fetish_would_you_consider_the_weirdest.json": "What fetish would you consider the weirdest?",
  "data/reddit-ask/r/AskReddit/comments/o9ormf/what_extinct_creature_would_be_an_absolute.json": "What extinct creature would be an absolute nightmare for humans if it still existed?",
  "data/reddit-ask/r/AskReddit/comments/o9oxn9/what_hobby_will_you_never_understand.json": "What hobby will you never understand?",
  "data/reddit-ask/r/AskReddit/comments/o9pn2k/if_there_was_one_person_in_the_world_you_could.json": "If there was one person in the world you could have sex with, dead or alive, who would it be and why?",
  "data/reddit-ask/r/AskReddit/comments/o9qt43/theoretically_if_you_caused_a_major_crash_at_the.json": "Theoretically, if you caused a major crash at the Tour de France and were now on the run, what would you do to assure you aren't caught?",
  "data/reddit-ask/r/AskReddit/comments/o9qymw/whats_a_popular_saying_you_dont_really_understand.json": "What’s a popular saying you don’t really understand?",
  "data/reddit-ask/r/AskReddit/comments/o9riaj/what_is_the_worst_sub_reddit_you_ever_seen.json": "what is the worst sub reddit you ever seen ?",
  "data/reddit-ask/r/AskReddit/comments/o9sxhr/what_doesnt_impress_you.json": "What doesn’t impress you ?",
  "data/reddit-ask/r/AskReddit/comments/o9tv1c/what_album_from_any_genre_do_you_believe_is_100.json": "What album from any genre, do you believe is 100% perfect having no skips whatsoever?",
  "data/reddit-ask/r/AskReddit/comments/o9ui8a/the_german_word_for_birth_control_pills_is.json": "The German word for “birth control pills” is “Antibabypille” If all medicine/drugs were named like this, what would they be?",
  "data/reddit-ask/r/AskReddit/comments/o9uo66/garbage_menwomen_of_reddit_what_are_some_things.json": "Garbage men/women of Reddit, what are some things we, as the general public, should know about our trash habits? Also, what drives you nuts that people do?",
  "data/reddit-ask/r/AskReddit/comments/o9w6ye/what_is_the_most_gruesome_thing_you_have_ever_seen.json": "What is the most gruesome thing you have ever seen?",
  "data/reddit-ask/r/AskReddit/comments/o9y3xi/serious_desert_dwellers_whats_the.json": "[Serious] Desert dwellers, what's the strangest/scariest thing you've seen out in the sands?",
  "data/reddit-ask/r/AskReddit/comments/oa05nw/veterinarians_of_reddit_what_is_something_most.json": "Veterinarians of Reddit, what is something most pet owners can do to make their pets lives better?",
  "data/reddit-ask/r/AskReddit/comments/oa3m8i/which_celebrity_do_you_irrationally_hate.json": "Which celebrity do you irrationally hate?",
  "data/reddit-ask/r/AskReddit/comments/oa6ktu/nonamericans_of_reddit_whats_the_weirdest_thing.json": "Non-Americans of Reddit, what's the weirdest thing an American has said to you?",
  "data/reddit-ask/r/AskReddit/comments/oa9jeh/what_do_you_say_after_sex.json": "What do you say after sex?",
  "data/reddit-ask/r/AskReddit/comments/oa9jzc/what_celebrity_do_you_think_is_genuinely_a_good.json": "What celebrity do you think is genuinely a good person and is not faking for press?",
  "data/reddit-ask/r/AskReddit/comments/oaad5n/god_gave_man_a_brain_and_a_penis_and_only_enough.json": "\"God gave man a brain and a penis. And only enough blood to run one at a time.\" - Robin Williams What are some real-life examples of this?",
  "data/reddit-ask/r/AskReddit/comments/oab3gz/what_movie_is_a_perfect_1010.json": "What Movie is a perfect 10/10?",
  "data/reddit-ask/r/AskReddit/comments/oabv1a/respectfully_what_job_do_you_think_people_are.json": "Respectfully, what job do you think people are overpaid?",
  "data/reddit-ask/r/AskReddit/comments/oad7jz/what_is_your_alltime_favourite_wouldyourather.json": "What is your all-time favourite ‘would-you-rather’ question?",
  "data/reddit-ask/r/AskReddit/comments/oaf539/what_is_your_username_a_reference_to.json": "What is your username a reference to?",
  "data/reddit-ask/r/AskReddit/comments/oaktuk/what_is_the_biggest_threat_to_america_right_now.json": "What is the biggest threat to America right now in your opinion?",
  "data/reddit-ask/r/AskReddit/comments/oan2f3/people_who_have_left_thirdworld_countries_for.json": "People who have left third-world countries for first-world countries, what surprised you the most about life in first-world countries?",
  "data/reddit-ask/r/AskReddit/comments/oan4td/whats_something_that_is_awkward_to_buy_in_bulk.json": "What’s something that is awkward to buy in bulk?",
  "data/reddit-ask/r/AskReddit/comments/oanhr8/what_invention_has_done_more_harm_than_good.json": "What invention has done more harm than good?",
  "data/reddit-ask/r/AskReddit/comments/oatjvx/what_is_a_good_reason_to_live.json": "What is a good reason to live?",
  "data/reddit-ask/r/AskReddit/comments/oauuyn/what_is_something_that_will_be_normalized_in_10.json": "what is something that will be normalized in 10 years from now?",
  "data/reddit-ask/r/AskReddit/comments/oavmvc/whats_a_nerd_debate_that_will_never_end.json": "What's a nerd debate that will never end?",
  "data/reddit-ask/r/AskReddit/comments/oavomo/whats_your_strongest_addiction.json": "What's your strongest addiction?",
  "data/reddit-ask/r/AskReddit/comments/oaxh27/whats_a_scam_most_people_dont_realize_is_a_scam.json": "What’s a scam most people don’t realize is a scam?",
  "data/reddit-ask/r/AskReddit/comments/ob1ykt/whats_the_absolute_worst_thing_you_could_name.json": "What’s the absolute worst thing you could name your baby?",
  "data/reddit-ask/r/AskWomen/comments/npgxmy/those_who_regret_having_cosmetic_surgery_what.json": "Those who regret having cosmetic surgery, what procedure did you have done, and why do you regret it?",
  "data/reddit-ask/r/AskWomen/comments/npueaq/women_who_started_making_a_lot_more_money_than.json": "Women who started making a lot more money than they grew up with, is it uncomfortable to hang out with your old friends who don't make nearly as much? What are those friendships like?",
  "data/reddit-ask/r/AskWomen/comments/npunfs/women_who_successfully_found_a_partner_online_how.json": "Women who successfully found a partner online, how did you do it?",
  "data/reddit-ask/r/AskWomen/comments/nqa4ku/what_was_the_last_straw_in_a_previous.json": "What was the last straw in a previous relationship of yours?",
  "data/reddit-ask/r/AskWomen/comments/nqjfhg/what_are_some_sexist_and_misogynistic_terms_jokes.json": "What are some sexist and misogynistic terms, jokes and stereotypes that men online throw around like they're nothing and why are they offensive?",
  "data/reddit-ask/r/AskWomen/comments/nr7faf/what_are_some_skinhairface_products_youve_used.json": "What are some skin/hair/face products you’ve used that have shown significant visual results?",
  "data/reddit-ask/r/AskWomen/comments/nriqs3/how_do_you_cope_with_lonelinessdepressive.json": "How do you cope with loneliness/depressive thoughts when you have no support system?",
  "data/reddit-ask/r/AskWomen/comments/nrm6mn/what_hurt_more_than_you_were_expecting.json": "What hurt more than you were expecting?",
  "data/reddit-ask/r/AskWomen/comments/ns2rn0/when_you_had_a_strong_intuition_about_someone.json": "When you had a strong intuition about someone that turned out to be true what was it?",
  "data/reddit-ask/r/AskWomen/comments/nsm2i1/what_did_you_buy_because_you_saw_it_on_social.json": "What did you buy because you saw it on social media and it turned out to be terrible?",
  "data/reddit-ask/r/AskWomen/comments/nsvbwb/what_was_the_moment_you_realised_that_it_was.json": "What was the moment you realised that it was going to be a lot harder living happily in this society as a woman than you anticipated?",
  "data/reddit-ask/r/AskWomen/comments/nswcxs/update_supplementary_rules_for_thersday_here_to.json": "Update: Supplementary rules for Thersday here to stay, a clarification regarding our disrespectful commentary rule, and a THANK YOU!",
  "data/reddit-ask/r/AskWomen/comments/nswutw/what_caused_you_start_having_a_healthy.json": "What caused you start having a healthy relationship with yourself?",
  "data/reddit-ask/r/AskWomen/comments/nsym37/what_did_you_buy_from_social_media_that_actually.json": "What did you buy from social media that actually turned out to be great?",
  "data/reddit-ask/r/AskWomen/comments/nszv3p/what_sounds_boring_but_is_actually_a_lot_of_fun.json": "What sounds boring, but is actually a lot of fun?",
  "data/reddit-ask/r/AskWomen/comments/nt1frm/women_who_arewere_pregnant_but_were_unable_to_get.json": "Women who are/were pregnant but were unable to get an abortion, how are things now?",
  "data/reddit-ask/r/AskWomen/comments/nt3ycd/how_do_you_deal_with_society_constantly_telling.json": "How do you deal with society constantly telling women their value decreases as they age ?",
  "data/reddit-ask/r/AskWomen/comments/ntgoww/for_those_who_got_into_a_healthy_relationship.json": "For those who got into a healthy relationship after a toxic one, what surprised you the most about it?",
  "data/reddit-ask/r/AskWomen/comments/nugw0w/what_song_changed_your_life.json": "What song changed your life?",
  "data/reddit-ask/r/AskWomen/comments/nukdsz/women_who_dont_like_bras_how_do_you_get_away.json": "Women who don’t like bras, how do you get away without wearing one?",
  "data/reddit-ask/r/AskWomen/comments/nv4wyx/do_your_attitudes_about_a_person_change_when_you.json": "Do your attitudes about a person change when you learn they're not particularly fans of dogs or other pets? If yes, how so?",
  "data/reddit-ask/r/AskWomen/comments/nveg7e/how_do_you_tell_the_difference_between_love_lust.json": "How do you tell the difference between love, lust and just liking the attention someone gives you?",
  "data/reddit-ask/r/AskWomen/comments/nvly7j/former_pushoversdoormats_how_did_you_learn_to.json": "Former pushovers/doormats, how did you learn to become assertive? Any tips?",
  "data/reddit-ask/r/AskWomen/comments/nvmkai/women_with_naturally_curly_wavy_etc_hair_what_are.json": "Women with naturally curly, wavy, etc. hair, what are your favorite products to keep your curls happy and healthy?",
  "data/reddit-ask/r/AskWomen/comments/nvu1p2/women_of_reddit_how_do_you_deal_with_a_depressive.json": "Women of Reddit, how do you deal with a depressive episode if it happens when you're loaded with work?",
  "data/reddit-ask/r/AskWomen/comments/nvw1n7/women_who_changed_careers_what_are_some_things.json": "Women who changed careers, what are some things you did to improve your resume in a field you had no experience in?",
  "data/reddit-ask/r/AskWomen/comments/nw5ez8/what_do_you_think_when_you_see_another_woman_with.json": "What do you think when you see another woman with clearly visible body hair (legs/armpits...)?",
  "data/reddit-ask/r/AskWomen/comments/nwbnwp/whats_your_bestworst_experiences_from.json": "What's your best/worst experiences from participating in an MLM(Multi-level marketing i.e Herbalife, Mary Kay and Amway)?",
  "data/reddit-ask/r/AskWomen/comments/nwkfar/what_are_some_tips_for_working_in_corporate_for.json": "What are some tips for working in corporate for the first time?",
  "data/reddit-ask/r/AskWomen/comments/nwmq9y/ladies_how_did_you_push_yourself_to_take_care_of.json": "Ladies, how did you push yourself to take care of yourself?",
  "data/reddit-ask/r/AskWomen/comments/nwzfj9/what_are_signs_that_a_partner_may_become.json": "What are signs that a partner may become physically abusive?",
  "data/reddit-ask/r/AskWomen/comments/nx3rnu/how_did_you_learn_to_stop_apologizing_for.json": "How did you learn to stop apologizing for... everything?",
  "data/reddit-ask/r/AskWomen/comments/nx5vxn/for_everyone_who_is_selfconscious_or.json": "For everyone who is self-conscious or uncomfortable with the way they look, did your perceptions change when you started to wear a mask everywhere? did anyone treat you differently or was it all in your head?",
  "data/reddit-ask/r/AskWomen/comments/nx7qat/women_of_reddit_how_does_finding_a_nice_piece_of.json": "Women of reddit how does finding a nice piece of clothing with functional pockets feel? (Descriptions of said clothing are appreciated)",
  "data/reddit-ask/r/AskWomen/comments/nx8two/women_who_met_their_partners_when_they_were.json": "Women who met their partners when they were teenagers and are still happily together, have you ever regretted it ? How did you get past the hardships ?",
  "data/reddit-ask/r/AskWomen/comments/nxet4a/how_do_you_deal_with_women_who_actively_put_you.json": "How do you deal with women who actively put you down around men?",
  "data/reddit-ask/r/AskWomen/comments/nxj47f/whats_the_worst_wedding_youve_ever_been_to_and_why.json": "What's the worst wedding you've ever been to and why?",
  "data/reddit-ask/r/AskWomen/comments/nxxlrv/hey_women_of_reddit_what_are_you_currently.json": "Hey women of Reddit... What are you currently working on to be a better you?",
  "data/reddit-ask/r/AskWomen/comments/ny2jbk/whats_a_part_of_your_body_you_are_embarrassed_of.json": "What's a part of your body you are embarrassed of, but you're aware it is unreasonable?",
  "data/reddit-ask/r/AskWomen/comments/ny3lh9/what_is_the_weirdest_thing_youve_done_to_someone.json": "What is the weirdest thing you've done to someone who was being a creeper to you?",
  "data/reddit-ask/r/AskWomen/comments/nyne5o/tw_to_those_whove_been_sexually_assaultedraped.json": "TW: To those who've been sexually assaulted/raped, when did you feel okay again?",
  "data/reddit-ask/r/AskWomen/comments/nyrdhp/as_a_woman_how_do_you_feel_about_helping_a.json": "As a woman, how do you feel about helping a transgender woman with things like heels, lingerie makeup etc? Sort of being like a mentor?",
  "data/reddit-ask/r/AskWomen/comments/nzc2rw/married_women_of_reddit_what_is_your_opinion_on.json": "Married Women of Reddit, what is your opinion on the expression \"the worst they treat you in dating is the best they'll treat you in marriage\"?",
  "data/reddit-ask/r/AskWomen/comments/nzcd6a/in_terms_of_compatibility_what_are_some_traits_or.json": "In terms of compatibility, what are some traits or habits people often forget to watch out for before deciding to enter a marriage or long term relationship?",
  "data/reddit-ask/r/AskWomen/comments/nzqrsb/when_was_that_flip_of_the_switch_moment_for_you.json": "When was that flip of the switch moment for you, when you realized how you're being treated isn't right, and you deserve better?",
  "data/reddit-ask/r/AskWomen/comments/nzrot0/where_have_you_been_fantasizing_about_traveling.json": "Where have you been fantasizing about traveling to lately?",
  "data/reddit-ask/r/AskWomen/comments/nzyvhx/how_do_you_respond_to_are_you_on_your_period.json": "How do you respond to \"Are you on your period?\" asked mockingly by a man when just being firm or assertive?",
  "data/reddit-ask/r/AskWomen/comments/o0257m/whats_something_you_wish_society_would_stop.json": "What’s something you wish society would stop forcing into you as a woman?",
  "data/reddit-ask/r/AskWomen/comments/o0b5td/how_do_you_train_the_voice_in_your_head_to_be_a.json": "How do you train the voice in your head to be a nice person, especially when it comes to self-image?",
  "data/reddit-ask/r/AskWomen/comments/o0s085/women_who_have_witnessed_their_ideas_being_passed.json": "Women who have witnessed their ideas being passed over and later witnessing a man presents the same idea, and then people listen... How did you handle it?",
  "data/reddit-ask/r/AskWomen/comments/o18ee6/how_do_you_cope_with_never_receiving_closure_and.json": "How do you cope with never receiving closure and what steps have you taken to numb or let go of the thoughts? Whether it be from a relative, relationship break up (romantic or friendship), death, losing a pet, etc.",
  "data/reddit-ask/r/AskWomen/comments/o1chlp/how_has_your_view_on_love_and_relationships.json": "How has your view on love and relationships changed from 5 years ago?",
  "data/reddit-ask/r/AskWomen/comments/o1d2pp/what_lines_from_the_pop_culture_film_mean_girls.json": "What lines from the pop culture film \"Mean Girls\" do you find yourself referencing most often?",
  "data/reddit-ask/r/AskWomen/comments/o1fqfv/men_apply_for_a_job_when_they_meet_only_60_of_the.json": "\"Men apply for a job when they meet only 60% of the qualifications, but women apply only if they meet 100% of them.\" - What are your thoughts on this?",
  "data/reddit-ask/r/AskWomen/comments/o2087t/what_is_something_about_people_that_you_become.json": "What is something about people that you become more convinced of as you get older (especially if you didn’t think so when you were younger)?",
  "data/reddit-ask/r/AskWomen/comments/o22fzp/women_who_have_been_babytrapped_whats_your_story.json": "Women who have been baby-trapped what's your story?",
  "data/reddit-ask/r/AskWomen/comments/o2krn7/did_you_ever_regret_staying_as_long_in_a.json": "Did you ever regret staying as long in a relationship as you did? Why and what were the signs to break it off instead of trying to fix things?",
  "data/reddit-ask/r/AskWomen/comments/o2loov/why_are_there_so_many_rules_around_what_women.json": "Why are there so many rules around what women should wear depending on their age?",
  "data/reddit-ask/r/AskWomen/comments/o2yphg/what_are_your_main_problems_with_dating_in_general.json": "what are your main problems with dating (in general)?",
  "data/reddit-ask/r/AskWomen/comments/o3avqt/how_do_you_get_over_someone_you_never_dated.json": "How do you get over someone you never dated?",
  "data/reddit-ask/r/AskWomen/comments/o3r4d8/women_in_successful_relationships_with_a_so_from.json": "Women in successful relationships with a SO from another country & culture, what cultural differences posed challenges and how did you overcome?",
  "data/reddit-ask/r/AskWomen/comments/o3u35z/ladies_what_do_you_think_of_the_upcoming_sequel.json": "Ladies, what do you think of the upcoming sequel to The Legend of Zelda: Breath of the Wild?",
  "data/reddit-ask/r/AskWomen/comments/o3zggd/was_anyone_the_weird_girl_in_school_how_are_you.json": "Was anyone the weird girl in school? How are you now?",
  "data/reddit-ask/r/AskWomen/comments/o49mvu/college_educated_women_how_do_you_feel_about.json": "College educated women, how do you feel about dating someone who hasn't been to college?",
  "data/reddit-ask/r/AskWomen/comments/o4atww/women_who_arent_naturally_social_butterflies_how.json": "Women who aren't naturally social butterflies, how did you learn to become more comfortable in a large (>20 people) social setting without disappearing into the corner?",
  "data/reddit-ask/r/AskWomen/comments/o4fsp1/ladies_what_do_you_wish_people_would_stop_asking.json": "Ladies, What do you wish people would stop asking you?",
  "data/reddit-ask/r/AskWomen/comments/o4h770/how_do_you_tell_someone_you_want_to_take_a.json": "How do you tell someone you want to take a friendship break/stop being friends altogether?",
  "data/reddit-ask/r/AskWomen/comments/o4laar/for_women_who_never_get_hit_on_or_crushed_on_how.json": "For women who never get hit on or crushed on, how has this affected your self-esteem?",
  "data/reddit-ask/r/AskWomen/comments/o4sebb/almost_halfway_done_with_the_year_how_are_things.json": "Almost halfway done with the year! How are things going in terms of 2021 goals and ambitions? Things working out as planned?",
  "data/reddit-ask/r/AskWomen/comments/o4syar/what_can_be_done_to_become_a_more_likeable.json": "What can be done to become a more likeable individual?",
  "data/reddit-ask/r/AskWomen/comments/o4xvdl/what_is_your_favourite_app_something_you_find.json": "What is your favourite app? Something you find useful.",
  "data/reddit-ask/r/AskWomen/comments/o50pb4/whats_a_wild_assumption_a_man_has_made_about_you.json": "What’s a wild assumption a man has made about you?",
  "data/reddit-ask/r/AskWomen/comments/o57zh9/when_did_life_get_better_for_you.json": "When did life get better for you?",
  "data/reddit-ask/r/AskWomen/comments/o5d2gk/how_do_you_handle_getting_ghosted_outoftheblue_by.json": "How do you handle getting ghosted out-of-the-blue by a significant, long-term person in your life?",
  "data/reddit-ask/r/AskWomen/comments/o5lpcb/when_budgeting_what_is_the_first_thing_and_last.json": "When budgeting, what is the first thing and last thing you would be willing to sacrifice?",
  "data/reddit-ask/r/AskWomen/comments/o5nv0z/what_widely_believed_female_myth_would_you_most.json": "What widely believed female myth would you most like to see dispelled?",
  "data/reddit-ask/r/AskWomen/comments/o5ydq7/women_of_reddit_what_do_you_do_when_youre_sick_to.json": "Women of Reddit, what do you do when you're sick to death of looking at your partner's face?",
  "data/reddit-ask/r/AskWomen/comments/o6bpbe/what_is_something_that_your_surprised_you_the.json": "What is something that your surprised you the first time you saw a man naked?",
  "data/reddit-ask/r/AskWomen/comments/o6g1y2/women_with_small_boobs_do_you_feel_pressure_to.json": "Women with small boobs: Do you feel pressure to have a completely flat stomach? How do you deal with that?",
  "data/reddit-ask/r/AskWomen/comments/o6rjyl/women_of_reddit_what_makes_you_feel_respected_in.json": "Women of Reddit, what makes you feel respected in a relationship?",
  "data/reddit-ask/r/AskWomen/comments/o6s0lz/women_of_reddit_what_do_you_commonly_keep_in_your.json": "Women of reddit, what do you commonly keep in your generally undersized pockets?",
  "data/reddit-ask/r/AskWomen/comments/o6u1g4/what_are_some_long_hair_struggles_youve_encouraged.json": "What are some long hair struggles you’ve encouraged?",
  "data/reddit-ask/r/AskWomen/comments/o6unzp/what_was_your_experience_seeing_a_sex_therapist.json": "What was your experience seeing a sex therapist like? Was it worth it/did it help you overcome your sex-related issues?",
  "data/reddit-ask/r/AskWomen/comments/o73u6x/whats_something_you_get_compliments_on.json": "What's something you get compliments on?",
  "data/reddit-ask/r/AskWomen/comments/o7au5v/what_is_a_show_or_movie_you_tried_to_get_into_but.json": "What is a show or movie you tried to get into but just couldn’t?",
  "data/reddit-ask/r/AskWomen/comments/o7cr17/women_of_reddit_what_do_you_have_to_do_in_order.json": "Women of Reddit, what do you have to do in order to be able to orgasm?",
  "data/reddit-ask/r/AskWomen/comments/o7csty/whats_the_worst_sales_pitch_youve_ever_been_given.json": "What's the worst sales pitch you've ever been given by somebody trying to sell you something?",
  "data/reddit-ask/r/AskWomen/comments/o7gvz0/were_you_ever_bodyshamed_by_your_parents_what_did.json": "Were you ever bodyshamed by your parents? What did they say and how has it affect you?",
  "data/reddit-ask/r/AskWomen/comments/o7lx8z/have_you_ever_been_genuinely_disturbed_by_a_movie.json": "Have you ever been genuinely disturbed by a movie scene (horror or otherwise) to the point you can’t watch the movie again and which movie??",
  "data/reddit-ask/r/AskWomen/comments/o7sbc0/whats_a_longstanding_family_tradition_that_you.json": "What's a long-standing family tradition that you didn't follow?",
  "data/reddit-ask/r/AskWomen/comments/o7tlva/women_over_30_whats_a_hobby_you_started_late_in.json": "Women over 30, what’s a hobby you started late in life that you were surprised with how much you enjoyed it?",
  "data/reddit-ask/r/AskWomen/comments/o7vchu/derek_chauvin_got_sentenced_to_225_years_in.json": "Derek Chauvin got sentenced to 22.5 years in prison for murder of George Floyd, what are your thoughts on this?",
  "data/reddit-ask/r/AskWomen/comments/o81heg/what_would_impress_you_about_a_potential_partners.json": "What would impress you about a potential partner's apartment when coming over?",
  "data/reddit-ask/r/AskWomen/comments/o83u4f/if_money_wasnt_an_issue_what_would_you_do_all_day.json": "If money wasnt an issue, what would you do all day?",
  "data/reddit-ask/r/AskWomen/comments/o88pcq/what_is_your_take_on_the_stereotype_of_women.json": "What is your take on the stereotype of women being too passive in bed like a \"star fish\"? Have you worried about it before?",
  "data/reddit-ask/r/AskWomen/comments/o88tra/women_with_skin_condition_psoriasis_eczema.json": "Women with skin condition (psoriasis, eczema, rosacea, vitiligo, acne..) how has it affected you social life, self esteem and mental helth?",
  "data/reddit-ask/r/AskWomen/comments/o89ru1/whats_that_one_thing_on_earth_you_wish_it_never.json": "What's that one thing on earth, you wish it never existed?",
  "data/reddit-ask/r/AskWomen/comments/o8ad2w/first_bornseldest_daughter_of_reddit_what_did_you.json": "first borns/eldest daughter of reddit, what did you do when your parents expected you to be a \"parent\" to your younger siblings?",
  "data/reddit-ask/r/AskWomen/comments/o8ad7n/ladies_of_reddit_whats_your_i_amwas_very_badass.json": "Ladies of Reddit, What’s your “I am/was very badass” story?",
  "data/reddit-ask/r/AskWomen/comments/o8amcx/women_whove_tried_toregularly_go_braless_whats.json": "Women who've tried to/regularly go bra-less, what's your experience out in public?",
  "data/reddit-ask/r/AskWomen/comments/o8j67f/women_who_married_for_money_how_is_your_life_now.json": "Women who married for money, how is your life now?",
  "data/reddit-ask/r/AskWomen/comments/o8mlml/do_you_get_regular_bikini_waxes_why_or_why_not.json": "Do you get regular bikini waxes? Why or why not?",
  "data/reddit-ask/r/AskWomen/comments/o8pd1z/how_did_you_overcome_insecurities_that_were.json": "How did you overcome insecurities that were stopping you from dating, applying for the job, going out, etc?",
  "data/reddit-ask/r/AskWomen/comments/o8qeut/what_are_your_storiesopinions_on_iuds.json": "What are your stories/opinions on IUDS?",
  "data/reddit-ask/r/AskWomen/comments/o8z528/genz_whats_something_you_wish_others_better.json": "Gen-Z, what’s something you wish others better understood about your generation?",
  "data/reddit-ask/r/AskWomen/comments/o96b00/what_is_the_lamest_excuse_you_have_ever_heard.json": "What is the lamest excuse you have ever heard from a partner for not committing and taking your relationship to the next level?",
  "data/reddit-ask/r/AskWomen/comments/o9ajq3/women_who_have_tinderbar_hookups_how_do_you_make.json": "Women who have Tinder/bar hookups, how do you make sure you are doing it safely?",
  "data/reddit-ask/r/AskWomen/comments/o9d2a4/how_do_you_feel_about_victorias_secret_getting.json": "How do you feel about Victoria’s Secret getting rid of the angels?",
  "data/reddit-ask/r/AskWomen/comments/o9idlo/how_do_you_feel_about_the_way_your_boobs_look.json": "How do you feel about the way your boobs look without a bra?",
  "data/reddit-ask/r/AskWomen/comments/o9jti1/women_who_live_with_their_parents_how_do_you.json": "Women who live with their parents: how do you protect yourself from the negative energy in your household?",
  "data/reddit-ask/r/AskWomen/comments/o9nb59/how_would_you_love_to_celebrate_your_birthday.json": "How would you love to celebrate your birthday this year?",
  "data/reddit-ask/r/AskWomen/comments/o9twwq/what_to_do_when_you_feel_like_disappearing_and.json": "What to do when you feel like disappearing and starting a new life?",
  "data/reddit-ask/r/AskWomen/comments/o9vzu3/women_of_reddit_what_is_a_wholesome_movie_you.json": "Women of Reddit what is a wholesome movie you adore and wish every young girl had the opportunity to see in her youth?",
  "data/reddit-ask/r/AskWomen/comments/o9x1sb/whats_the_problem_with_panty_lines.json": "What’s the problem with panty lines?",
  "data/reddit-ask/r/AskWomen/comments/oaab9m/what_do_you_think_about_womens_clothes_sizes.json": "What do you think about women's clothes sizes being arbitrary? (e.g., \"Size 1\") Do you think women's sizing should change to objective measurements? (e.g., \"30x30\")",
  "data/reddit-ask/r/AskWomen/comments/oab367/whats_an_item_that_you_see_a_woman_ownwear_that.json": "What's an item that you see a woman own/wear that makes you instantly think that she is classy or elegant?",
  "data/reddit-ask/r/AskWomen/comments/oae4eg/whats_a_lighthearted_compliment_youll_never_forget.json": "What’s a lighthearted compliment you’ll never forget?",
  "data/reddit-ask/r/AskWomen/comments/oam6fl/what_was_your_fuck_i_need_therapy_moment.json": "What was your \"Fuck, I need therapy\" moment?",
  "data/reddit-ask/r/AskWomen/comments/oamoks/how_do_you_deal_with_other_people.json": "How do you deal with other people liking/expressing interest in your SO?",
  "data/reddit-ask/r/AskWomen/comments/oat1re/women_who_got_dumped_because_the_grass_was.json": "Women who got dumped because 'the grass was greener on the other side', how did you take it? did your SO came back? did you take them back?",
  "data/reddit-ask/r/AskWomen/comments/oat59x/what_makes_your_lose_attraction_to_a_partner_or.json": "What makes your lose attraction to a partner or crush?",
  "data/reddit-ask/r/AskWomen/comments/oav000/what_question_should_never_be_asked_to_a_woman.json": "What question should never be asked to a woman?",
  "data/reddit-ask/r/AskWomen/comments/oazm5m/what_is_something_youve_been_taught_as_a_child.json": "What is something you’ve been taught as a child that you’ve had to unlearn as an adult?",
  "data/reddit-ask/r/Ask_Politics/comments/nqmpw2/is_critical_race_theory_something_that_is.json": "Is critical race theory something that is actually being taught in schools?",
  "data/reddit-ask/r/Ask_Politics/comments/ns83ic/can_democrats_pass_smaller_piecemeal.json": "Can Democrats pass smaller piecemeal infrastructure bills with Republicans now, and pass a bigger one later after 2022 if they win more seats?",
  "data/reddit-ask/r/Ask_Politics/comments/nsxy3l/what_is_the_connection_between_qanon_and_the.json": "What is the connection between QAnon and the Republican Party?",
  "data/reddit-ask/r/Ask_Politics/comments/o0dqh4/why_do_republicans_seem_to_be_more_organized_and.json": "Why do Republicans seem to be more organized and focused than Democrats?",
  "data/reddit-ask/r/Ask_Politics/comments/o143by/why_is_the_covid_lab_leak_theory_now_accepted_as.json": "Why is the covid lab leak theory now accepted as a possibility in left-leaning circles?",
  "data/reddit-ask/r/Ask_Politics/comments/o1ncr8/can_states_move_their_election_days_to_juneteenth.json": "Can states move their election days to Juneteenth, now that it will be a national holiday?",
  "data/reddit-ask/r/Ask_Politics/comments/o6bllv/how_does_a_large_country_go_from_3rd_world_status.json": "How does a large country go from 3rd world status to 1st world?",
  "data/reddit-ask/r/Ask_Politics/comments/o9ouhk/are_trumps_scotus_judges_less_conservative_than.json": "Are Trump's SCOTUS judges less conservative than expected?",
  "data/reddit-ask/r/NoStupidQuestions/comments/npie2j/really_important_for_me_its_tearing_my_family.json": "Really important for me, it’s tearing my family apart. How many bees can fit in a Lexus GX? I swear to god this isn’t a joke.",
  "data/reddit-ask/r/NoStupidQuestions/comments/npl4k3/can_anyone_give_advice_on_what_to_do_if_a.json": "Can anyone give advice on what to do if a neighbor won't stop buying cars and taking up all the parking spaces? He has about 23 cars and it's growing.",
  "data/reddit-ask/r/NoStupidQuestions/comments/npswf5/does_anyone_else_have_a_hard_time_being_on_social.json": "Does anyone else have a hard time being on social media",
  "data/reddit-ask/r/NoStupidQuestions/comments/nq2h3l/so_if_minors_cannot_vote_but_can_be_taxed_isnt.json": "So if minors cannot vote but can be taxed, isn’t that taxation without representation?",
  "data/reddit-ask/r/NoStupidQuestions/comments/nqj499/why_are_greek_norse_etc_mythologies_are.json": "Why are Greek, Norse etc mythologies are considered 'mythology, while current religions aren't?",
  "data/reddit-ask/r/NoStupidQuestions/comments/nqt9qd/if_i_was_going_to_die_of_heat_stroke_and_only_had.json": "If I was going to die of heat stroke and only had a dildo made out of ice, would I have a better chance at survival if I consumed it orally or stuck the entire thing up my butt?",
  "data/reddit-ask/r/NoStupidQuestions/comments/nqwe26/if_youre_reincarnated_but_dont_retain_any_memory.json": "If you’re reincarnated, but don’t retain any memory from your former life, how exactly is that any different than death?",
  "data/reddit-ask/r/NoStupidQuestions/comments/nrhvg1/are_there_any_subreddits_on_this_site_that.json": "Are there any subreddits on this site that actually allow new users?",
  "data/reddit-ask/r/NoStupidQuestions/comments/nrj9te/you_ever_look_in_the_mirror_directly_into_your.json": "You ever look in the mirror, directly into your own eyes, and have a weird experience?",
  "data/reddit-ask/r/NoStupidQuestions/comments/nrjbbm/why_arent_there_playgrounds_for_adults.json": "Why aren’t there playgrounds for adults?",
  "data/reddit-ask/r/NoStupidQuestions/comments/ns2a3g/am_i_the_only_person_for_who_the_reddit_video.json": "Am I the only person for who the Reddit video player constantly freezes and refuses to play the video. I can stream a 1080p YouTube video, but Reddit just doesn't work.",
  "data/reddit-ask/r/NoStupidQuestions/comments/nsn21l/does_anyone_else_find_taking_a_shower_to_be.json": "Does anyone else find taking a shower to be completely exhausting?",
  "data/reddit-ask/r/NoStupidQuestions/comments/nsw6qt/is_it_normal_i_18_m_still_have_sleepovers_with_my.json": "Is it normal I (18 M) still have sleepovers with my best friend who's a girl (18 F)",
  "data/reddit-ask/r/NoStupidQuestions/comments/nt9k93/is_it_weird_for_me_to_like_moss_over_any_other.json": "Is it weird for me to like moss over any other plants? Everyone around me just looks at me weird..",
  "data/reddit-ask/r/NoStupidQuestions/comments/ntaatz/why_is_it_so_much_easier_to_spot_typos_only_𝘢𝘧𝘵𝘦𝘳.json": "Why is it so much easier to spot typos only 𝘢𝘧𝘵𝘦𝘳 our message is sent?",
  "data/reddit-ask/r/NoStupidQuestions/comments/ntbada/my_dog_pooped_out_a_condom_should_i_be_worried.json": "My dog pooped out a condom, should I be worried?",
  "data/reddit-ask/r/NoStupidQuestions/comments/ntedlf/wouldnt_any_plane_you_cant_identify_be_a_ufo.json": "Wouldn't any plane you can't identify be a UFO?",
  "data/reddit-ask/r/NoStupidQuestions/comments/ntilgp/is_it_just_me_or_does_anyone_else_feel_that.json": "Is it just me or does anyone else feel that people around them are getting more and more selfish, self-centered, mean and shrewd slowly and gradually?",
  "data/reddit-ask/r/NoStupidQuestions/comments/nusil8/in_the_toy_story_universe_are_sex_dolls_alive.json": "In the TOY STORY universe, are sex dolls alive?",
  "data/reddit-ask/r/NoStupidQuestions/comments/nuz70t/is_tortellini_a_good_name_for_a_tortoise.json": "Is Tortellini a good name for a tortoise?",
  "data/reddit-ask/r/NoStupidQuestions/comments/nv0e5f/why_is_chess_separated_by_gender_it_makes_sense.json": "Why is chess separated by gender? It makes sense in physical sports, but here men have no advantages over women",
  "data/reddit-ask/r/NoStupidQuestions/comments/nv93vh/if_hollow_points_are_outlawed_in_military_combat.json": "If hollow points are outlawed in military combat by the Geneva conventions as they cause “excessive pain and suffering,” why are the police allowed to use them on the civilians they’re supposed to be protecting?",
  "data/reddit-ask/r/NoStupidQuestions/comments/nvisiu/can_someone_please_tell_me_why_my_dog_decided.json": "Can someone please tell me why my dog decided that the first thing she should do on our walk was roll around in the first hot pile of shit she found.",
  "data/reddit-ask/r/NoStupidQuestions/comments/nvn4nx/what_does_dying_feel_like.json": "What does dying feel like?",
  "data/reddit-ask/r/NoStupidQuestions/comments/nvzhf4/if_a_disinfectant_kills_999_of_bacteria_doesnt.json": "If a disinfectant kills 99.9% of bacteria, doesnt that just mean that you're selectively breeding bacteria that are resistant to disinfectant?",
  "data/reddit-ask/r/NoStupidQuestions/comments/nvzubs/does_anyone_else_think_expensive_jewelry_is.json": "Does anyone else think expensive jewelry is outdated and a waste of money?",
  "data/reddit-ask/r/NoStupidQuestions/comments/nw5dea/does_anyone_else_feel_lost_and_insignificant.json": "Does anyone else feel lost and insignificant?",
  "data/reddit-ask/r/NoStupidQuestions/comments/nw8wkg/am_i_being_abused.json": "Am I being abused?",
  "data/reddit-ask/r/NoStupidQuestions/comments/nwl6or/if_a_muslim_greets_me_with_assalamu_alaykum_whats.json": "If a Muslim greets me with As-salamu alaykum, what's the most appropriate response as a non-Muslim?",
  "data/reddit-ask/r/NoStupidQuestions/comments/nwllt6/if_a_smoker_falls_into_a_coma_for_a_long_time.json": "If a smoker falls into a coma for a long time, would their smoking addiction go away once they wake up?",
  "data/reddit-ask/r/NoStupidQuestions/comments/nwsqys/why_is_gender_studies_a_major_i_have_nothing.json": "Why is gender studies a major? I have nothing against it, I just don’t get how you can make a whole major out of, well, genders.",
  "data/reddit-ask/r/NoStupidQuestions/comments/nx4vp6/does_anyone_else_get_really_sad_on_their.json": "Does anyone else get really sad on their birthdays or holidays?",
  "data/reddit-ask/r/NoStupidQuestions/comments/nx6zjc/does_anybody_else_stop_their_microwave_at_exactly.json": "Does anybody else stop their microwave at exactly 0:01 sec. so you don't announce your presence",
  "data/reddit-ask/r/NoStupidQuestions/comments/nxlz42/why_are_american_houses_made_of_drywall.json": "Why are American houses made of drywall?",
  "data/reddit-ask/r/NoStupidQuestions/comments/nxscwk/my_mother_died_and_when_i_walked_into_her_closet.json": "My mother died and when I walked into her closet it smelled like her. How can I preserve this smell somehow so it isn’t gone forever?",
  "data/reddit-ask/r/NoStupidQuestions/comments/nxsuee/why_do_people_like_joe_rogan.json": "Why do people like Joe Rogan?",
  "data/reddit-ask/r/NoStupidQuestions/comments/ny4fnl/this_isnt_a_troll_post_but_i_need_to_know_if.json": "This isn't a troll post but I need to know if other people can feel machines. I don't know where to ask about this.",
  "data/reddit-ask/r/NoStupidQuestions/comments/ny7ir8/what_can_i_drink_instead_of_just_plain_water_that.json": "what can i drink instead of just \"plain water\" that is low on calories and has nice flavors?",
  "data/reddit-ask/r/NoStupidQuestions/comments/ny7s7m/why_does_chris_brown_still_have_a_career.json": "Why does Chris Brown still have a career?",
  "data/reddit-ask/r/NoStupidQuestions/comments/nyaens/is_it_bad_that_i_almost_feel_bad_for_criminals.json": "Is it bad that I almost feel bad for criminals being beat up on video? I know they’re criminals but anyone being beat up makes me feel empathetic for them.",
  "data/reddit-ask/r/NoStupidQuestions/comments/nyay8e/who_else_watches_cute_videos_of_cats_dogs_and.json": "Who else watches cute videos of cats, dogs and other pets online and want one so much, but can't get any because your life is a mess and you can't take care of yourself, much less another living thing?",
  "data/reddit-ask/r/NoStupidQuestions/comments/nycwml/why_do_drinks_seem_colder_after_eating_something.json": "Why do drinks seem colder after eating something minty?",
  "data/reddit-ask/r/NoStupidQuestions/comments/nyp2xe/anyone_salt_their_ketchup_instead_of_salting.json": "Anyone salt their ketchup instead of salting their fries? Cause it will stick better to ketchup?",
  "data/reddit-ask/r/NoStupidQuestions/comments/nyqpcf/how_do_girls_cum_what_comes_out_and_how_long_does.json": "How do girls cum? What comes out and how long does it take for them to cum?",
  "data/reddit-ask/r/NoStupidQuestions/comments/nz5lri/am_i_the_only_one_that_just_gives_up_writing.json": "Am i the only one that just gives up writing stuff on reddit",
  "data/reddit-ask/r/NoStupidQuestions/comments/nz5tz6/isnt_it_kind_of_rude_when_a_christian_says_youre.json": "Isn't it kind of rude when a Christian says you're going to hell if you don't believe in Jesus ?",
  "data/reddit-ask/r/NoStupidQuestions/comments/nz8hbk/are_men_not_supposed_to_wear_rings_while_engaged.json": "Are men not supposed to wear rings while engaged?",
  "data/reddit-ask/r/NoStupidQuestions/comments/nz9cyb/is_it_a_requirement_or_something_for_recipe.json": "Is it a requirement or something for recipe websites to have the entire life story of the creator before the actual recipe?",
  "data/reddit-ask/r/NoStupidQuestions/comments/nzmp1l/what_can_i_do_to_be_less_intimidatingscaring_to.json": "What can I do to be less intimidating/scaring to women on the streets?",
  "data/reddit-ask/r/NoStupidQuestions/comments/nzna5b/aunt_recently_diagnosed_with_alzheimers_how_do_i.json": "Aunt recently diagnosed with Alzheimers, how do I respond to her emails?",
  "data/reddit-ask/r/NoStupidQuestions/comments/nzpvx9/just_shaved_my_head_should_i_be_washing_it_with.json": "Just shaved my head should I be washing it with shampoo, body wash, or face wash?",
  "data/reddit-ask/r/NoStupidQuestions/comments/nztfy4/why_is_it_that_if_i_skip_breakfast_i_can_go_all.json": "Why is it that if I skip breakfast I can go all day without feeling very hungry yet if I do have breakfast then I’m pretty much hungry all day and can’t stop eating?",
  "data/reddit-ask/r/NoStupidQuestions/comments/o0blll/why_are_there_people_in_developed_countries_who.json": "Why are there people in developed countries who have like 11 kids they can't afford to raise?",
  "data/reddit-ask/r/NoStupidQuestions/comments/o0bqof/why_is_my_cat_hellbent_on_watching_me_take_a_shit.json": "Why is my cat hellbent on watching me take a shit?",
  "data/reddit-ask/r/NoStupidQuestions/comments/o0c4t2/anyone_else_finds_those_tedx_talks_pretentious.json": "Anyone else finds those \"TEDx talks\" pretentious and self righteuos?",
  "data/reddit-ask/r/NoStupidQuestions/comments/o0cy0x/ive_seen_women_complain_about_their_pocket_sizes.json": "I've seen women complain about their pocket sizes for over 2 decades now, and have yet to see anybody actually set out to make women's clothes with pockets instead of just complain about it. Why?",
  "data/reddit-ask/r/NoStupidQuestions/comments/o0gnq2/why_do_we_add_yie_to_the_end_of_words_to_make.json": "Why do we add “y/ie” to the end of words to make them sound more “cute”?",
  "data/reddit-ask/r/NoStupidQuestions/comments/o0ilgt/how_do_you_feel_when_you_see_a_chubbier_guy_at.json": "How do you feel when you see a chubbier guy at the gym?",
  "data/reddit-ask/r/NoStupidQuestions/comments/o0kgkz/if_we_could_clone_dinosaurs_would_they_be_safe_to.json": "If we could clone dinosaurs would they be safe to eat?",
  "data/reddit-ask/r/NoStupidQuestions/comments/o0w4xb/who_the_fuck_is_buying_all_these_houses_with_cash.json": "Who the fuck is buying all these houses with cash, way over asking price?",
  "data/reddit-ask/r/NoStupidQuestions/comments/o0zqp5/in_the_us_is_it_commonplace_to_have_a_garbage.json": "In the US, is it commonplace to have a 'garbage disposal' that is basically a blender in the sink drain?",
  "data/reddit-ask/r/NoStupidQuestions/comments/o14hye/why_do_neonazis_so_often_deny_the_holocaust.json": "Why do neo-Nazis so often deny the Holocaust?",
  "data/reddit-ask/r/NoStupidQuestions/comments/o15mft/why_do_some_americans_have_such_a_vehement_hate.json": "Why do some Americans have such a vehement hate for other languages ?",
  "data/reddit-ask/r/NoStupidQuestions/comments/o1imoi/ive_got_a_really_long_list_of_notifications.json": "I’ve got a really long list of notifications informing me my post/questions in subreddits have been removed basically because I’m new. How can a new user become part of the conversation of a topic that interest them? It seems like it’s going to take forever to meet some of these expectations",
  "data/reddit-ask/r/NoStupidQuestions/comments/o1kkgy/why_do_washing_machines_have_a_window_but.json": "Why do washing machines have a window but dishwashers don’t? If I had to choose I’d rather see my dishes been cleaned than my clothes spin round",
  "data/reddit-ask/r/NoStupidQuestions/comments/o1rgf2/when_a_country_buys_weapons_from_another_country.json": "When a country buys weapons from another country, can't that country just disassemble the weapon and learn how to build it? Then build it for cheaper?",
  "data/reddit-ask/r/NoStupidQuestions/comments/o1sx6a/if_you_have_sex_with_someone_already_in_a.json": "If you have sex with someone already in a committed relationship to someone else and you are aware of that fact, are you not in the wrong?",
  "data/reddit-ask/r/NoStupidQuestions/comments/o1tqer/are_most_white_collar_jobs_just_easy.json": "Are most white collar jobs... just easy?",
  "data/reddit-ask/r/NoStupidQuestions/comments/o1yk2w/do_couples_in_muslim_countries_often_confuse_or.json": "Do couples in Muslim countries often confuse or mistake someone else for their wife?",
  "data/reddit-ask/r/NoStupidQuestions/comments/o25sz4/am_i_the_only_one_who_looks_at_the_keyboard.json": "Am I the only one who looks at the keyboard whenever I see a typo to see if the wrong key is close to the supposedly right one, if it's not, I immediately assume the person who wrote it is dumb?",
  "data/reddit-ask/r/NoStupidQuestions/comments/o2bsbd/does_anyone_else_write_out_entire_narratives_in.json": "Does anyone else write out entire narratives in the comment section and then delete them before you post because you figure “Who actually cares?”",
  "data/reddit-ask/r/NoStupidQuestions/comments/o2gdtj/who_picks_up_a_seeingeye_dogs_poo.json": "Who picks up a seeing-eye dogs poo?",
  "data/reddit-ask/r/NoStupidQuestions/comments/o2kmic/does_anyone_else_get_weirded_out_saying_their_own.json": "Does anyone else get weirded out saying their own name?",
  "data/reddit-ask/r/NoStupidQuestions/comments/o2mi42/did_online_privacy_get_progressively_worse.json": "Did online privacy get progressively worse?",
  "data/reddit-ask/r/NoStupidQuestions/comments/o2s8kl/is_anyone_noticing_a_huge_spike_in_ads_on_youtube.json": "Is anyone noticing a huge spike in ads on YouTube?",
  "data/reddit-ask/r/NoStupidQuestions/comments/o327ad/is_it_worth_it_to_rinse_out_a_difficult_to_clean.json": "Is it worth it to rinse out a difficult to clean jar like ranch or peanut butter in order to recycle it? I know for most you can fill them with water and just shake but these ones always leave a residue and I feel like I'm using tons of water, which seems wasteful on its own.",
  "data/reddit-ask/r/NoStupidQuestions/comments/o34lq6/why_do_humans_teeth_need_to_be_brushed_and_other.json": "Why do humans teeth need to be brushed and other animals don’t?",
  "data/reddit-ask/r/NoStupidQuestions/comments/o34r56/do_italians_still_do_the_accent_when_nobodys.json": "Do italians still do the accent when nobody's around?",
  "data/reddit-ask/r/NoStupidQuestions/comments/o35hm4/do_i_like_being_alone_or_is_being_alone_what_im.json": "Do I like being alone, or is being alone what I’m used to?",
  "data/reddit-ask/r/NoStupidQuestions/comments/o3826i/in_the_movie_the_dark_night_if_heath_ledger.json": "In the movie the dark night , If Heath ledger pulled his testicles out during the hospital explosion scene and started waving them around could they have sued him?",
  "data/reddit-ask/r/NoStupidQuestions/comments/o385iy/if_an_incel_actually_gets_laid_do_the_other.json": "if an incel actually gets laid do the other incels worship him or shun him?",
  "data/reddit-ask/r/NoStupidQuestions/comments/o3nblo/is_it_just_me_or_does_anyone_else_lock_the_door.json": "is it just me or does anyone else lock the door while in the bathroom even when nobody else is home?",
  "data/reddit-ask/r/NoStupidQuestions/comments/o3ps7m/how_the_heck_is_my_generation_supposed_to_buy.json": "How the heck is my generation supposed to buy houses when we are old enough?",
  "data/reddit-ask/r/NoStupidQuestions/comments/o42k1d/why_dont_we_federally_tie_the_minimum_wage_to.json": "Why don’t we federally tie the minimum wage to inflation? That way, the labor force won’t have to worry as much about being to underpaid to afford to live going forward.",
  "data/reddit-ask/r/NoStupidQuestions/comments/o42lc0/why_do_flatearthers_care_what_shape_the_earth_is.json": "Why do flat-earthers care what shape the earth is?",
  "data/reddit-ask/r/NoStupidQuestions/comments/o44oag/does_anyone_else_feel_like_were_not_supposed_to.json": "Does anyone else feel like we're not supposed to live like this?",
  "data/reddit-ask/r/NoStupidQuestions/comments/o4658m/i_never_understood_why_getting_up_early_is_seen.json": "I never understood why getting up early is seen as superior and staying up late as a bad thing. If I wake up later than you but also stay up later than you, we are both awake for the same amount of time and get just as much done.",
  "data/reddit-ask/r/NoStupidQuestions/comments/o4k756/did_i_come_across_a_dead_body_should_i_contact.json": "Did I come across a dead body? Should I contact local authorities?",
  "data/reddit-ask/r/NoStupidQuestions/comments/o4ke6a/why_do_people_reply_to_questions_in_the_customer.json": "why do people reply to questions in the “customer questions” section on amazon when they dont know the answer?",
  "data/reddit-ask/r/NoStupidQuestions/comments/o4l2n7/would_it_be_weird_if_i_21f_became_friends_with_an.json": "Would it be weird if I (21F) became friends with an older woman (89F)?",
  "data/reddit-ask/r/NoStupidQuestions/comments/o4uk9l/why_is_prostitution_frowned_apon.json": "Why is prostitution frowned apon?",
  "data/reddit-ask/r/NoStupidQuestions/comments/o4wkei/what_would_actually_happen_if_you_hired_two.json": "What would ACTUALLY happen if you hired two private investigators to follow eachother?",
  "data/reddit-ask/r/NoStupidQuestions/comments/o4xdap/if_your_heart_stopped_beating_would_your_death.json": "If your heart stopped beating, would your death hurt?",
  "data/reddit-ask/r/NoStupidQuestions/comments/o4xn5z/why_are_butts_so_sexy_seriously_why.json": "Why are butts so sexy? Seriously why?",
  "data/reddit-ask/r/NoStupidQuestions/comments/o533op/anyone_else_with_a_fucked_up_family_here_who.json": "Anyone else with a fucked up family here who often gets intimidated to date someone with perfect family?",
  "data/reddit-ask/r/NoStupidQuestions/comments/o53h9g/if_bras_are_necessities_then_why_didnt_we_evolve.json": "If bras are necessities then why didn't we evolve some kind of natural back support like stronger back muscles?",
  "data/reddit-ask/r/NoStupidQuestions/comments/o53oce/if_an_emergency_services_vehicle_ambulance_fire.json": "If an emergency services vehicle (Ambulance, Fire Truck, Police) witness a bad accident on the way to respond to a another call, what are they supposed to do?",
  "data/reddit-ask/r/NoStupidQuestions/comments/o5543v/is_anyone_else_scared_to_change_jobs_because_your.json": "Is anyone else scared to change jobs because your current one feels safe?",
  "data/reddit-ask/r/NoStupidQuestions/comments/o5dnfg/does_anybody_else_keep_checking_the_upvote_score.json": "Does anybody else keep checking the upvote score on their posts every couple of minutes? And feel depressed when it stays the same or goes down?",
  "data/reddit-ask/r/NoStupidQuestions/comments/o5ezsj/does_anyone_else_absolutely_hate_working_or_get.json": "Does anyone else absolutely HATE working or get depressed at the thought of spending 1/3rd of your life just... working? Do you have advice for how to cope?",
  "data/reddit-ask/r/NoStupidQuestions/comments/o5iit4/if_my_penis_is_so_sensitive_why_cant_it_read.json": "If my penis is so sensitive, why can't it read Braille?",
  "data/reddit-ask/r/NoStupidQuestions/comments/o5jlkg/was_at_a_friends_place_she_has_two_cats_that_like.json": "Was at a friend's place, she has two cats that like me, but they were sitting on either side of me hissing at one another. This went on for about a minute so I interjected and hissed at both of them, asserting my dominance and they stopped. My friend was shocked at what I did. Did I do wrong?",
  "data/reddit-ask/r/NoStupidQuestions/comments/o5n02i/what_is_the_theythem_version_of_calling_somebody.json": "What is the they/them version of calling somebody “mam” or “sir”?",
  "data/reddit-ask/r/NoStupidQuestions/comments/o5o0wl/how_many_times_do_i_have_to_press_show_me_less_of.json": "How many times do I have to press \"show me less of this\" on those live broadcasts until I don't see them anymore?",
  "data/reddit-ask/r/NoStupidQuestions/comments/o5pn03/why_do_some_people_literally_roar_when_they.json": "Why do some people literally ROAR when they sneeze but others sneeze as quiet as a mouse?",
  "data/reddit-ask/r/NoStupidQuestions/comments/o5t2bw/in_english_we_call_our_planet_earth_which_is_just.json": "In English, we call our planet \"Earth\" which is just a fancy word for dirt. Is that the same in every language and culture, where the planet is just named one of their words for dirt?",
  "data/reddit-ask/r/NoStupidQuestions/comments/o61wyl/why_is_everyone_scared_of_china_becoming_the_most.json": "Why is everyone scared of China becoming the most powerful country in the world? What will the Chinese do with all that power?",
  "data/reddit-ask/r/NoStupidQuestions/comments/o66ust/why_dont_the_police_have_to_go_to_law_school.json": "Why don’t the police have to go to law school?",
  "data/reddit-ask/r/NoStupidQuestions/comments/o69nu8/i_asked_my_interviewer_what_was_her_proudest.json": "I asked my interviewer what was her proudest moment in this company?",
  "data/reddit-ask/r/NoStupidQuestions/comments/o69uzg/hypothetically_could_you_take_a_modern_day_car.json": "Hypothetically, could you take a modern day car back to the 1930’s, 40’s or 50’s and have it run on the gasoline from that era or has fuel changed too much?",
  "data/reddit-ask/r/NoStupidQuestions/comments/o6hhkg/do_you_ever_watch_a_movie_and_ask_yourself_what.json": "Do you ever watch a movie and ask yourself what you were doing while the movie was being filmed?",
  "data/reddit-ask/r/NoStupidQuestions/comments/o6kbkm/why_does_becoming_a_barber_harder_than_becoming_a.json": "Why does becoming a barber harder than becoming a cop?",
  "data/reddit-ask/r/NoStupidQuestions/comments/o6nyxs/should_i_wear_hat_backwards_or_front.json": "Should I wear hat backwards or front?",
  "data/reddit-ask/r/NoStupidQuestions/comments/o6p9jr/did_anyone_else_notice_pink_toilet_paper_in_rich.json": "Did anyone else notice pink toilet paper in rich people's homes in the 90's? What was up with that?",
  "data/reddit-ask/r/NoStupidQuestions/comments/o6y1kk/what_are_some_worktrade_secrets_youre_legally.json": "What are some (work/trade) secrets you’re legally bound to not share but can share here anonymously?",
  "data/reddit-ask/r/NoStupidQuestions/comments/o6zeg5/why_do_people_get_so_offended_by_swear_words.json": "Why do people get so offended by swear words?",
  "data/reddit-ask/r/NoStupidQuestions/comments/o71tkb/am_i_the_only_one_who_instinctively_starts.json": "Am I the only one who instinctively starts walking back and forth and all over the place when I get on the phone with somebody? I never really knew. It's not always that it happens, but often when somebody calls me up when I'm at home for example it does happen.",
  "data/reddit-ask/r/NoStupidQuestions/comments/o72y1j/im_a_driver_for_teenage_kids_and_i_select_music.json": "I’m a driver for teenage kids and I select music for them to listen to on their way. I don’t know really what kids that age listen to, and it needs to be somewhat clean. Any ideas?",
  "data/reddit-ask/r/NoStupidQuestions/comments/o740m8/obesity_increases_the_risk_of_cancer_if_you_were.json": "Obesity increases the risk of cancer. If you were obese, but then lost all the weight, do you still have a higher risk than somebody who has always been a healthy weight?",
  "data/reddit-ask/r/NoStupidQuestions/comments/o7448s/how_is_it_legal_to_price_something_to_11000_of_a.json": "How is it legal to price something to 1/1000 of a dollar ($3.269) when we don't have currency that small?",
  "data/reddit-ask/r/NoStupidQuestions/comments/o75azt/why_is_ableism_bad.json": "Why is ableism bad?",
  "data/reddit-ask/r/NoStupidQuestions/comments/o77eeg/do_straight_men_ever_watch_gay_porn_or_at_least.json": "Do straight men ever watch gay porn or at least watched it once in their life just to test ?",
  "data/reddit-ask/r/NoStupidQuestions/comments/o7dziu/why_cant_britney_spears_just_leaveflee_her.json": "Why can’t Britney Spears just leave/flee her current situation?",
  "data/reddit-ask/r/NoStupidQuestions/comments/o7hiam/in_the_movies_when_getting_into_trouble_people.json": "In the movies, when getting into trouble, people always exclaim: \"I want to see my lawyer!\" Does everyone have \"their\" lawyer? I never needed one, so how do I get \"my\" lawyer?",
  "data/reddit-ask/r/NoStupidQuestions/comments/o7j1qb/why_do_people_always_assume_youre_arguing.json": "Why do people always assume you're arguing, disagreeing, or challenging them if you reply to their reddit comment?",
  "data/reddit-ask/r/NoStupidQuestions/comments/o7n2ox/what_the_hell_are_you_supposed_to_do_while.json": "What the hell are you supposed to do while someone is singing the \"Happy Birthday Song\" to you?",
  "data/reddit-ask/r/NoStupidQuestions/comments/o7rwdv/do_titties_float.json": "Do titties float?",
  "data/reddit-ask/r/NoStupidQuestions/comments/o7saxn/why_dont_we_just_throw_our_trash_into_volcanoes.json": "Why don’t we just throw our trash into volcanoes?",
  "data/reddit-ask/r/NoStupidQuestions/comments/o7v7ke/why_do_toddlers_who_fall_over_and_slam_their_face.json": "Why do toddlers who fall over and slam their face on the ground sit up and look around with a calm expression on their face for a full 5 seconds before they freak out?",
  "data/reddit-ask/r/NoStupidQuestions/comments/o7vsjl/why_are_ids_a_bad_thing_when_it_comes_to_voting.json": "Why are id's a bad thing when it comes to voting?",
  "data/reddit-ask/r/NoStupidQuestions/comments/o7xggk/does_anyone_else_instantly_forget_what_shirt.json": "Does anyone else instantly forget what shirt they're wearing the moment someone says \"Hey, I like your shirt.\"?",
  "data/reddit-ask/r/NoStupidQuestions/comments/o7zr3e/what_actually_happens_if_you_get_a_boner_at_a.json": "What actually happens if you get a boner at a nude beach?",
  "data/reddit-ask/r/NoStupidQuestions/comments/o85p15/whos_the_idiot_at_reddit_hq_that_decided_to_make.json": "Who's the idiot at reddit HQ that decided to make adds play sound at make volume when you click into the comments on the app and why?",
  "data/reddit-ask/r/NoStupidQuestions/comments/o88jml/why_is_naked_yoga_allowed_on_youtube_while_other.json": "Why is naked yoga allowed on YouTube while other channels get demonetized for swearing?",
  "data/reddit-ask/r/NoStupidQuestions/comments/o88t81/does_anybody_else_talk_to_people_and_you_think.json": "Does anybody else talk to people and you think they'll definitely misunderstand you? Every time I say something, I try to repeat my main point like 3 times, I repeat the most important few words. Idk if I express myself badly, but people seem to never understand what I'm saying.",
  "data/reddit-ask/r/NoStupidQuestions/comments/o89ypb/how_is_the_ozone_layer_doing_now_about_15_years.json": "How is the ozone layer doing now? About 15 years ago it was always in the media as a concern, holes in the ozone layer, etc. Then it all went silent, nobody talks about it anymore, was it fixed?",
  "data/reddit-ask/r/NoStupidQuestions/comments/o8lhv8/if_you_needed_to_get_into_a_fingerprint_protected.json": "If you needed to get into a fingerprint protected safe and you killed someone and took their hand, how long would the hand be viable for opening the safe before it decomposes too far?",
  "data/reddit-ask/r/NoStupidQuestions/comments/o8q1yi/why_dont_they_create_official_transgender_sports.json": "Why don’t they create official TransGender sports teams instead of creating a bunch of confusion and controversy?",
  "data/reddit-ask/r/NoStupidQuestions/comments/o8tjw2/is_it_completely_normal_to_have_no_interest_and.json": "Is it completely normal to have no interest and intention on having a kid?",
  "data/reddit-ask/r/NoStupidQuestions/comments/o8v1np/why_is_it_when_you_leave_a_lollipop_touching_the.json": "Why is it when you leave a lollipop touching the inside of your cheek for a while, it leaves that spot rough?",
  "data/reddit-ask/r/NoStupidQuestions/comments/o8yj19/how_did_every_nation_decide_to_agree_to_a_7day.json": "How did every nation decide to agree to a 7-day week?",
  "data/reddit-ask/r/NoStupidQuestions/comments/o90i7c/am_i_being_manipulative.json": "Am I being manipulative?",
  "data/reddit-ask/r/NoStupidQuestions/comments/o93r4r/do_animals_with_less_brainpower_make_mistakes_the.json": "Do animals with less brainpower make “mistakes” the way we do?",
  "data/reddit-ask/r/NoStupidQuestions/comments/o95i4k/do_friendship_crushes_exist_someone_who_you_think.json": "Do \"friendship crushes\" exist? Someone who you think is really interesting and pretty, who you want to know better in a non-romantic way?",
  "data/reddit-ask/r/NoStupidQuestions/comments/o970a9/whats_the_point_of_keeping_up_to_date_and_aware.json": "What’s the point of keeping up to date and aware of world issues when nobody else seems to care and it’s all just depressing?",
  "data/reddit-ask/r/NoStupidQuestions/comments/o98x8i/are_there_any_websites_that_feature_recipes.json": "Are there any websites that feature recipes without a back story, location requests and a million pop ups?",
  "data/reddit-ask/r/NoStupidQuestions/comments/o99ao0/anybody_else_genuinely_prefer_rainovercast_over.json": "Anybody else genuinely prefer rain/overcast over sunshine?",
  "data/reddit-ask/r/NoStupidQuestions/comments/o99kba/there_are_studies_shown_that_workers_who_stay.json": "There are studies shown that workers who stay loyal to companies make 50% less money overtime. Why don't companies incentivize employees to stay at their company with drastically higher raises instead of finding new talent?",
  "data/reddit-ask/r/NoStupidQuestions/comments/o9g7xn/if_satan_punishes_evil_people_does_that_mean_he.json": "If satan punishes evil people. Does that mean he is a good guy?",
  "data/reddit-ask/r/NoStupidQuestions/comments/o9i7ub/why_do_many_americans_seemingly_have_a_im_not.json": "Why do many Americans seemingly have a \"I'm not helping pay for your school/healthcare/welfare\"-mindset?",
  "data/reddit-ask/r/NoStupidQuestions/comments/o9lrtx/my_understanding_of_handicap_stall_etiquette_is.json": "My understanding of Handicap Stall etiquette is, if there is a line up and there is handicap and non-handicap stalls, you use either as they become available, but if a special needs person requires the handicap stall, you let them have it next regardless. Is that right?",
  "data/reddit-ask/r/NoStupidQuestions/comments/o9uu3x/why_did_we_decide_that_the_final_enemy_of_a_game.json": "Why did we decide that the final enemy of a game would be called a \"boss,\" even if it was entirely incapable of directing workflow at a company?",
  "data/reddit-ask/r/NoStupidQuestions/comments/o9yr2v/how_many_times_can_you_go_through_a_roundabout.json": "How many times can you go through a roundabout before its illegal?",
  "data/reddit-ask/r/NoStupidQuestions/comments/o9zrd2/all_i_do_is_smoke_weed_play_video_games_and_jerk.json": "All i do is smoke weed, play video games, and jerk off. Is that bad?",
  "data/reddit-ask/r/NoStupidQuestions/comments/oa231x/if_i_farted_into_someones_butthole_then_they.json": "If I farted into someone’s butthole, then they closed their butthole, would they then need to fart?",
  "data/reddit-ask/r/NoStupidQuestions/comments/oa33k8/do_americans_genuinely_think_that_the_usa_is_the.json": "Do Americans genuinely think that the USA is the best country?",
  "data/reddit-ask/r/NoStupidQuestions/comments/oa621a/is_there_another_way_to_live_besides_working_and.json": "Is there another way to live besides working and having schedules till we die?",
  "data/reddit-ask/r/NoStupidQuestions/comments/oa8z8b/if_food_takes_hours_to_digest_why_do_i_have_to.json": "If food takes hours to digest, why do I have to use the bathroom immediately after eating?",
  "data/reddit-ask/r/NoStupidQuestions/comments/oacwo1/is_it_rude_to_feed_someone_weed_laced_brownies.json": "Is it rude to feed someone 'weed laced' brownies without their consent in your opinion?",
  "data/reddit-ask/r/NoStupidQuestions/comments/oaf244/why_do_i_keep_hearing_pre_madana_all_the_time.json": "Why do I keep hearing “pre madana” all the time?",
  "data/reddit-ask/r/NoStupidQuestions/comments/oafj5q/is_there_a_name_for_a_kink_where_you_get_your.json": "Is there a name for a kink where you get your girlfriend to dress up like your dealer and you guys kick it back with each other?",
  "data/reddit-ask/r/NoStupidQuestions/comments/oagsve/why_do_british_people_tend_to_turn_statements.json": "Why do British people tend to turn statements into questions?",
  "data/reddit-ask/r/NoStupidQuestions/comments/oakydp/do_you_guys_considered_the_term_you_guys_to_be.json": "Do you guys considered the term \"you guys\" to be gender neutral when referring to a group of people (regardless of gender)?",
  "data/reddit-ask/r/NoStupidQuestions/comments/oaoy4b/is_it_weird_if_your_parents_put_a_camera_in_your.json": "Is it weird if your parents put a camera in your room?",
  "data/reddit-ask/r/NoStupidQuestions/comments/oav4tp/why_is_prostitution_illegal.json": "Why is prostitution illegal?",
  "data/reddit-ask/r/NoStupidQuestions/comments/ob39ix/if_blackface_is_considered_offensive_whites.json": "If blackface is considered offensive — whites portraying themselves as blacks in an exaggerated way — why isn’t drag considered offensive to women?",
  "data/reddit-ask/r/NoStupidQuestions/comments/ob7zx9/how_do_i_stop_being_racist.json": "How do i stop being racist.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/npe84l/has_anyone_been_in_a_position_where_they_want_to.json": "Has anyone been in a position where they want to be alone but don’t want to be alone at the same time?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/nphila/does_anyone_else_know_a_lot_of_people_but_still.json": "Does anyone else know a lot of people but still don't actually have any 'friends'?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/nptvvi/do_you_feel_that_hollywood_films_have_lost_the.json": "Do you feel that Hollywood films have lost the charisma/pull that they once had???",
  "data/reddit-ask/r/TooAfraidToAsk/comments/npv2et/almost_30yrs_old_and_i_feel_like_im_still_waiting.json": "Almost 30yrs old and I feel like I’m still waiting for ‘life’ to happen. Can anybody relate?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/npwj4l/am_i_the_only_one_who_thinks_it_is_too_much_of_a.json": "Am I the only one who thinks it is too much of a coincidence that after Billie Eilish opened up about her tourette syndrome a lot of people suddenly had it too?? And with the same \"offensive\" ticks",
  "data/reddit-ask/r/TooAfraidToAsk/comments/nq2xrt/why_does_it_bother_people_so_much_that_i_prefer.json": "Why does it bother people so much that I prefer to keep wearing my mask even though I don’t HAVE to?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/nq4jyo/why_is_it_called_herd_immunity_when_community.json": "why is it called “herd immunity” when “community immunity” is so damn fun to say?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/nqidvx/do_anyone_else_get_annoyed_at_someone_who.json": "Do anyone else get annoyed at someone who completely ignores you while having a conversation with that person due to that person being engrossed on their phone or tv?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/nqio9m/why_do_people_consider_jk_rowling_transphobic.json": "Why do people consider JK Rowling transphobic?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/nqka4y/why_dont_more_men_sit_when_they_pee.json": "Why don't more men sit when they pee?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/nqklii/how_are_children_harmed_when_people_swear_in.json": "How are children harmed when people swear in front of them? I just don't understand why we try to keep some random words away from children and act like there is logic behind it.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/nqug8y/does_anyone_else_hate_when_people_call_them.json": "Does anyone else hate when people call them instead of texting?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/nrjqxm/is_it_weird_that_im_irked_by_someone_bringing_up.json": "Is it weird that I'm irked by someone bringing up my sexuality all the time?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/nrmf3h/does_anyone_else_not_believe_in_religion_or.json": "Does anyone else not believe in religion or occult magic but still loves to learn about it?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/nrmlaa/how_do_people_see_thunderstorms_as_a_form_of.json": "How do people see thunderstorms as a form of therapy? I dont understand how people feel relaxed when its storming out and loud flashes of thunder hit nearby. I don't like the sudden loud sounds of thunder and I feel very jumpy, therefore I can't understand why anyone considers them as relaxing.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ns0c9e/why_does_modern_healthcare_focus_on_extending.json": "Why does modern healthcare focus on extending length of life more than the quality and length of a healthy life?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ns44ru/should_onlyfans_models_have_to_pay_to_advertise.json": "Should Onlyfans models have to pay to advertise on reddit like any other business?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/nsj5v3/does_anyone_else_feel_like_they_lack_that.json": "Does anyone else feel like they lack that fundamental drive or passion other people seem to have?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/nslehx/why_cant_we_keep_masks_on_as_a_normal_clothing.json": "Why can't we keep masks on as a normal clothing accessory forever? Or is it likely that a new \"mask culture\" may be adapted well after places reopen?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/nsrexe/is_it_normal_to_think_every_now_and_then_that_it.json": "Is it normal to think every now and then that it would've been much better if you were never born?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/nstk03/why_name_a_condom_trojan.json": "Why name a condom Trojan?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/nsuw1h/why_do_people_claim_looks_and_money_dont_matter.json": "Why do people claim looks and money don't matter for relationships, while they most certainly do?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/nsxya5/does_anyone_else_get_the_inescapable_feeling_that.json": "Does anyone else get the inescapable feeling that you've missed out on your own life?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/nt9bx6/why_when_women_have_to_deal_with_crazy_male_exes.json": "Why, when women have to deal with crazy male exes, they’re (rightfully) considered victims, but when men have to deal with crazy female exes, they’re just told to “don’t stick your d*ck in crazy”?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ntd4l2/does_anyone_else_feel_scared_and_overwhelmed_as.json": "Does anyone else feel scared and overwhelmed as soon as they start thinking about their lives?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ntqokq/you_ever_notice_that_the_people_who_acts_like.json": "You ever notice that the people who acts like dicks to you, immediately go to authority when you act like a dick back?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ntx7ms/do_you_ever_vent_to_yourself_and_then_wipe_your.json": "Do you ever vent to yourself and then wipe your own tears and tell yourself \"Pull yourself together\" because you have no option but to be strong?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/nue4o2/why_do_people_think_that_lollipops_are_only_for.json": "Why do people think that lollipops are only for kids?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/nuhsxp/does_anybody_else_have_a_slight_fear_of_a_snake.json": "Does anybody else have a slight fear of a snake being in their toilet whenever they go to take a shit?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/nujcan/is_it_true_women_masturbate_frequently_and_are.json": "Is it true women masturbate frequently and are just as horny as men or does this not apply to the majority of women?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/nv1slj/what_do_you_do_when_you_realize_you_are_the_toxic.json": "What do you do when you realize you are the toxic one in the relationship?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/nvjot0/is_it_ok_to_just_feel_fucking_sad_all_of_the.json": "Is it ok to just feel fucking sad all of the sudden for like a few hours and then be fine later?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/nvoskj/am_i_bad_for_being_slightly_sad_that_lockdown.json": "Am I bad for being slightly sad that lockdown ends because I see everyone else go out with friends again but I can't because I have none?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/nw2ev1/am_i_in_the_minority_for_disliking_cars_and.json": "Am I in the minority for disliking cars and wanting walkable cities?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/nw3p1r/does_anyone_else_try_to_sleep_more_so_they_can.json": "Does anyone else try to sleep more so they can continue dreaming?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/nwdku4/am_i_a_bad_person_for_disliking_pride_month_it.json": "Am I a bad person for disliking pride month? It feels like a whole month of pandering. Maybe I’m not looking at it through the right lens?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/nwl91w/why_is_faking_mental_and_emotional_disorders_so.json": "Why is faking mental and emotional disorders so popular online?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/nwnf5q/does_anyone_else_get_mildly_depressed_when_you.json": "Does anyone else get mildly depressed when you find an abandoned yt channel?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/nwyyr6/as_a_white_person_living_in_the_us_i_want_someone.json": "As a white person living in the U.S., I want someone to tell me why at 29 years old I’m just learning about the Tulsa massacre from youtube? This is one of the evil acts that whites have committed against black people in our history and I should have learned about it.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/nxa7pr/why_do_americans_always_go_on_about_freedom_like.json": "Why do Americans always go on about freedom like most countries in the world are not just as free??",
  "data/reddit-ask/r/TooAfraidToAsk/comments/nxl479/why_are_conservatives_so_upset_over_critical_race.json": "Why are conservatives so upset over critical race theory?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/nxlt49/why_is_it_that_the_phrase_you_get_what_you_pay.json": "Why is it that the phrase ‘you get what you pay for’ doesn’t apply to workers and their income?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/nxt5lc/where_are_all_the_adult_jungle_gymsplaygrounds.json": "Where are all the adult jungle gyms/playgrounds?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ny927g/how_many_of_you_guys_hug_your_pillow_at_night_and.json": "How many of you guys hug your pillow at night and pretend it’s someone that loves you?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/nymii2/i_wanted_to_kill_myself_at_18_but_i_only_kept.json": "I wanted to kill myself at 18, but I only kept going because people said life would get better after I started college and work in the next few years. Well, it hasn’t; what do I do?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/nyohsc/what_happened_with_the_nursing_profession_when_i.json": "What happened with the nursing profession? When I was a child I thought you had to be smart to be a nurse. Has something changed with the requirements?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/nyr984/does_anyone_else_try_to_masturbate_when_theyre.json": "Does anyone else try to masturbate when they’re depressed hoping it will take the pain away? Does it ever work?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/nz96dv/im_19_but.json": "I’m 19 but?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/nzpbxc/16_year_old_dating_a_24_year_old.json": "16 year old dating a 24 year old?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/nzrld0/anyone_else_grow_up_not_with_role_models_but_with.json": "Anyone else grow up, not with role models, but with people they didn't want to grow up like?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/nzzn1p/do_people_actually_question_if_joe_biden_will.json": "Do people actually question if Joe Biden will complete his term or is it just a joke that gets thrown around?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/o07suy/am_i_the_only_one_who_gets_really_mad_when.json": "Am I the only one who get’s really mad when friends/family just randomly show up at my house without warning?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/o0sw1w/why_dont_we_reopen_most_things_and_just_let.json": "Why don’t we reopen most things and just let people who aren’t vaccinated get sick?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/o0ya4i/can_anyone_tell_me_what_im_supposed_to_do_with_my.json": "Can anyone tell me what I'm supposed to do with my cake day ?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/o0ysg0/if_you_fall_asleep_with_your_dick_in_someone_will.json": "If you fall asleep with your dick in someone, will it get pruney like your fingers?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/o15puc/how_do_i_tell_my_friends_that_am_dieing.json": "How do i tell my friends that am dieing?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/o1a7xr/what_do_orchestra_conductors_actually_do_to_help.json": "What do orchestra conductors actually do to help the song?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/o1ce0u/is_it_normal_to_get_a_semi_erection_every_time_i.json": "Is it normal to get a semi erection every time I hug my wife?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/o1kar4/is_it_normal_to_feel_sexual_attraction_but_not.json": "Is it normal to feel sexual attraction but not want sex?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/o1qdeh/where_can_i_find_the_video_of_hulk_hogans_sex.json": "Where can I find the video of Hulk Hogan’s sex tape where he says the N-word?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/o1tsy3/is_it_normal_to_not_really_enjoy_eating_food_but.json": "Is it normal to not really enjoy eating food but instead find it more of a chore ?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/o1unkp/are_big_nipples_unattractive_and_why_do_mine_keep.json": "Are big nipples unattractive and why do mine keep growing?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/o285vz/am_i_the_only_one_who_cant_take_themselves.json": "Am I the only one who can’t take themselves seriously doing something sexual/sexy for an SO?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/o2bp0k/does_anyone_else_with_a_good_life_ever_just_feel.json": "Does anyone else with a \"good\" life ever just feel like completely dropping out of society to become a hermit?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/o2q55n/is_it_normal_to_not_to_cry_in_a_sad_real_life.json": "Is it normal to not to cry in a sad real life situation but being able to cry easily due to reasons like nostalgia and tragic moments in fiction?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/o2u9q0/why_is_everyone_so_accepting_of_being_spied_on_by.json": "Why is everyone so accepting of being spied on by the government and corporations?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/o3aiux/does_anyone_else_not_want_to_have_children_to.json": "Does anyone else not want to have children to spare their possible kids from the difficulty of life?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/o3ok8m/who_else_deeply_loves_their_partner_but_would.json": "Who else deeply loves their partner but would prefer to sleep in their own bed/room?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/o3wh5w/anyone_else_just_not_care_about_covid_anymore.json": "Anyone else just not care about Covid anymore?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/o45ror/does_anyone_else_find_mass_shooting_more.json": "Does anyone else find mass shooting more exhausting than horrifying these days?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/o4f5ya/why_do_anorexicbulimic_people_get_so_much.json": "Why do anorexic/bulimic people get so much emotional support but overweight/obese people just get treated like animals?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/o4u2y4/are_there_people_who_are_just_destined_to_be.json": "Are there people who are just destined to be unlikable?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/o4xykk/do_you_ever_get_the_feeling_that_at_least_90_of.json": "Do you ever get the feeling that at least 90 % of posts on reddit are fake or embellished?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/o5k0p0/have_we_swung_too_far_the_other_way_with_the.json": "Have we swung too far the other way with the Karen label?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/o5mkdr/if_bread_is_jesus_body_and_wine_is_jesus_blood.json": "If bread is Jesus’ body, and wine is Jesus’ blood, does that mean that raisin bread is an entire Jesus?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/o61odx/does_anyone_else_type_reddit_at_the_end_of_a.json": "Does anyone else type \"reddit\" at the end of a google search for a straight-to-the-point result?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/o6idc2/could_i_buy_an_acre_of_land_and_dig_deep_to_build.json": "Could I buy an acre of land and dig deep to build an underground city without buying any more property?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/o6l4bd/my_understanding_is_that_you_have_no_control_in.json": "My understanding is that you have no control in whatever you are attracted to, so its okay to be attracted to a friend, but is it generally \"acceptable\" to beat the meat thinking about em?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/o6m6bn/do_people_really_think_porn_with_girls_getting.json": "Do people really think porn with girls getting fucked by massive dicks is hot?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/o6obcf/imagine_person_is_graduating_from_yale_law_school.json": "Imagine person is graduating from yale law school with great grades - How do their opportunities for the next 20 years differ if person is white vs black vs asian?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/o6q9o0/did_anyone_else_like_wearing_a_mask_because_it.json": "Did anyone else like wearing a mask because it made you look better?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/o6tzd0/does_anyone_else_look_into_the_beautiful_night.json": "Does anyone else look into the beautiful night sky and think “wow, I just wanna die”?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/o6u4u9/how_are_people_released_from_prison_expected_to.json": "How are people released from prison expected to go straight and not commit crime again if nobody will give them a job to enable them to survive and provide because they’ve got a criminal record? It’s a no-brainer that they’ll then turn back to the only way they know how to earn money.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/o6xnqo/does_anyone_else_eat_primarily_just_to_survive.json": "Does anyone else eat primarily just to survive, and doesn't enjoy their meals at all?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/o6zkzw/how_should_i_celebrate_me_being_7_months_clean.json": "how should I celebrate me being 7 months clean?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/o72dtv/is_it_bad_that_i_fantasize_about_my_boyfriends.json": "Is it bad that I fantasize about my boyfriends best friend?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/o7bp89/as_a_man_is_it_okay_to_want_to_be_the_sub_in_the.json": "As a man, is it okay to want to be the sub in the relationship?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/o7hl9s/why_is_slavery_in_america_talked_about_so_much.json": "Why is slavery in America talked about so much, but not the slavery and subjugation by Britain and other empires?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/o7kd31/can_you_guys_answer_my_questions_about_america.json": "Can you guys answer my questions about America?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/o7mbho/being_a_man_complimenting_women_how_can_i_make.json": "Being a man complimenting women, how can I make sure I don't come off creepy?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/o7mhr1/people_who_say_paris_is_the_most_beautiful_city.json": "People who say Paris is the most beautiful city in the world .. have you actually been there ?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/o7s0bl/are_there_still_people_in_the_world_that.json": "Are there still people in the world that legitimately believe in/worship the ancient Greek or Egyptian gods?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/o7utt2/men_how_do_you_feel_about_pubic_hair_on_women.json": "Men, how do you feel about pubic hair on women?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/o83rw5/does_anyone_feel_like_reddit_just_fucking_sucks.json": "Does anyone feel like Reddit just… fucking sucks now?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/o849jj/why_dont_incels_just_hire_an_escort.json": "Why don't incels just hire an escort?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/o88wzq/why_is_everyone_in_america_so_opinionated_on.json": "Why is everyone in America so opinionated on mundane things? And by everyone I mean from a common person to the government itself? Sorry if it comes out as rude.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/o8iedn/is_this_a_fetishbdsm_related.json": "Is this a fetish/BDSM related?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/o8j7u9/does_anyone_else_love_when_theres_a_typo_in_a_book.json": "does anyone else love when there’s a typo in a book??",
  "data/reddit-ask/r/TooAfraidToAsk/comments/o8jp8d/why_does_no_one_seem_to_care_that_the_us_prison.json": "Why does no one seem to care that the us prison system is just slavery with extra steps?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/o8um4z/do_women_really_not_enjoy_working_for_female.json": "Do women really not enjoy working for female bosses?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/o92ioc/is_reddit_just_a_echo_chamber_of_guys_in_their.json": "Is Reddit just a echo chamber of guys in their 20s and early 30s, from the USA?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/o93z6k/are_small_boobs_attractive.json": "Are small boobs attractive?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/o96a97/i_am_a_straight_married_man_i_dont_care_who_you_i.json": "I am a straight married man. I don't care who you, I don't care what color your are. I don't care what sex you are. I don't care who you love. I am tired of hearing about it. Is it wrong to want people to just go about the lives and mind their own business and not push it onto others?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/o9fk56/can_anyone_else_not_piss_or_shit_if_they_feel.json": "Can anyone else not piss or shit if they feel uncomfortable?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/o9hr06/is_the_downvote_button_a_youre_being_a_dick.json": "Is the downvote button a \"You're being a dick\" button or \"I disagree\"?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/o9hx4z/am_i_the_only_one_who_never_remembers_artist.json": "Am I the only one who never remembers artist names, album names, etc?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/o9lc8a/why_do_prisoners_in_the_us_get_free_meals_in.json": "Why do prisoners in the US get free meals in prison but kids that are forced to go to school for 5-8 hours a day have to pay for their lunch?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/o9m3mq/is_it_normal_for_a_man_to_get_slightly_physical.json": "Is it normal for a man to get slightly physical towards his partner during arguments?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/o9vvc2/am_i_the_only_one_that_thinks_power_mods_on.json": "Am I the only one that thinks \"power mods\" on Reddit are a massive problem for this website?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/o9wzi6/whats_the_point_of_having_a_mansion.json": "What's the point of having a mansion?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/oa2agq/why_is_the_sex_position_called_missionary_even.json": "Why is the sex position called \"missionary\" even though that is a religious term?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/oa36sf/isnt_anyone_else_worried_about_how_much_waste.json": "Isn't anyone else worried about how much waste there is everywhere?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/oaasnq/would_you_really_be_upset_if_you_caught_your.json": "Would you really be upset if you caught your partner watching porn? Does it hurt so badly?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/oadc7m/if_we_hate_arguing_and_how_divided_america_is.json": "If we hate arguing and how divided America is getting, why keep CNN and Fox News?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/oao58w/why_is_lesbian_twin_porn_generally_seen_as_okay.json": "Why is lesbian twin porn generally seen as okay, when other forms of incest porn are not?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/oaoeiq/was_anyone_else_ever_in_their_life_afraid_of_a.json": "Was anyone else ever in their life afraid of a snake was gonna come out of the toilet and bite you in the ass?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/oapgte/is_it_considered_weird_to_masturbate_in_the.json": "Is it considered weird to masturbate in the living room (home alone) when you live with other people?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/oaqsq4/why_do_we_get_annoyed_at_customers_for_bad.json": "Why do we get annoyed at customers for bad tipping when we should be mad at the people that made us rely on tipping?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/oay14h/anyone_write_out_long_responses_only_to_delete.json": "Anyone write out long responses only to delete them without ever posting?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ob1g15/as_an_american_what_is_something_really_patriotic.json": "As an American, what is something really patriotic I can do that would be both enjoyable, and help out my community?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ob1n5d/why_does_my_voice_get_higher_when_im_talking_to.json": "Why does my voice get higher when I'm talking to men?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ob6jmq/does_anyone_else_feel_like_they_dont_want_sex_but.json": "Does anyone else feel like they dont want sex, but just some to give them a real tight hug and tell them they are loved and appreciated and that everything might just be alright?",
  "data/reddit-ask/r/TrueAskReddit/comments/nphwqp/why_is_it_that_people_let_go_of_their_dreams_and.json": "Why is it that people let go of their dreams and 'settle down' as they grow old?",
  "data/reddit-ask/r/TrueAskReddit/comments/nr9gco/why_are_people_as_a_whole_so_unforgiving_of_first.json": "Why are people, as a whole, so unforgiving of first impressions?",
  "data/reddit-ask/r/TrueAskReddit/comments/nu6yrp/is_companies_stealing_our_data_really_that_bad.json": "Is companies stealing our data really that bad?",
  "data/reddit-ask/r/TrueAskReddit/comments/nzw8k6/why_is_male_bisexuality_doubted_more_than_female.json": "Why is male bisexuality doubted more than female bisexuality?",
  "data/reddit-ask/r/TrueAskReddit/comments/o2jyqm/why_are_low_income_workers_even_taxed_at_all.json": "Why are low income workers even taxed at all?",
  "data/reddit-ask/r/TrueAskReddit/comments/o3fyro/what_is_going_on_in_the_minds_of_those_lying_to.json": "What is going on in the minds of those lying to prove that covid is a hoax?",
  "data/reddit-ask/r/TrueAskReddit/comments/o4fsfo/why_are_usamerican_sandwichesburgers_so.json": "Why are US-American sandwiches/burgers so overstuffed compared to other places?",
  "data/reddit-ask/r/TrueAskReddit/comments/o4xs8x/have_any_of_you_successfully_come_back_from_being.json": "Have any of you successfully come back from being deeply misanthropic?",
  "data/reddit-ask/r/TrueAskReddit/comments/o5bsed/how_are_you_supposed_to_interview_for_another_job.json": "How are you supposed to interview for another job when you already have one?",
  "data/reddit-ask/r/TrueAskReddit/comments/o6bxtn/racism_towards_african_americans_how_i_can_better.json": "Racism towards African Americans - How I can better understand to support my friend",
  "data/reddit-ask/r/TrueAskReddit/comments/o7axf0/what_do_you_think_children_of_today_will_change.json": "What do you think children of today will change about parenting when they become the adults of tomorrow?",
  "data/reddit-ask/r/askphilosophy/comments/nssovk/i_need_book_recommendations_to_practice_critical.json": "I need book recommendations to practice critical thinking.",
  "data/reddit-ask/r/askphilosophy/comments/nu74bw/ethics_is_it_okay_to_enjoy_the_rain.json": "[Ethics] Is it okay to enjoy the rain?",
  "data/reddit-ask/r/askphilosophy/comments/nuktag/child_beauty_pageants.json": "Child beauty pageants",
  "data/reddit-ask/r/askphilosophy/comments/nvnqib/whats_a_day_in_the_life_of_a_philosophy_professor.json": "What's a day in the life of a philosophy professor?",
  "data/reddit-ask/r/askphilosophy/comments/nvyzqp/philosophy_books_for_beginners.json": "Philosophy books for beginners???",
  "data/reddit-ask/r/askphilosophy/comments/nwhto2/can_philosophy_offer_some_comfort.json": "Can philosophy offer some comfort?",
  "data/reddit-ask/r/askphilosophy/comments/nwqiup/south_asian_philosophy.json": "South Asian Philosophy?",
  "data/reddit-ask/r/askphilosophy/comments/nz0yey/do_forces_actually_exist.json": "Do forces actually exist?",
  "data/reddit-ask/r/askphilosophy/comments/nzfzbs/reincarnation_doesnt_make_sense_to_me.json": "Reincarnation doesn't make sense to me",
  "data/reddit-ask/r/askphilosophy/comments/nzz41t/is_necrophilia_immoral.json": "Is necrophilia immoral?",
  "data/reddit-ask/r/askphilosophy/comments/o0cvm9/has_any_philosopher_ever_questioned_cogito_ergo.json": "Has any philosopher ever questioned ‘cogito ergo sum’ ? Can you really be sure that it is you that think?",
  "data/reddit-ask/r/askphilosophy/comments/o1bt7n/is_it_possible_to_understand_hegel_without_having.json": "Is it possible to understand Hegel without having a (few) PhD(s) and/or an 8-dimensional alien brain?",
  "data/reddit-ask/r/askphilosophy/comments/o1sutg/what_does_beauvoir_mean_when_she_says_that_one_is.json": "What does Beauvoir mean when she says that, “One is not born, but rather becomes woman”",
  "data/reddit-ask/r/askphilosophy/comments/o25763/do_there_exist_novels_or_other_fiction_works.json": "Do there exist novels, or other fiction works written in formal logic?",
  "data/reddit-ask/r/askphilosophy/comments/o2mshm/female_philosophers.json": "Female philosophers",
  "data/reddit-ask/r/askphilosophy/comments/o3ilnn/struggling_to_read_foucault_am_i_too_dumb_to_read.json": "Struggling to read Foucault, am I too dumb to read philosophy?",
  "data/reddit-ask/r/askphilosophy/comments/o42x4y/how_can_one_morally_justify_spending_money_on.json": "How can one morally justify spending money on lesiure when it could have gone towards a social cause?",
  "data/reddit-ask/r/askphilosophy/comments/o59km7/is_there_a_name_for_this_experience.json": "Is there a name for this experience?",
  "data/reddit-ask/r/askphilosophy/comments/o5mmi6/whats_your_general_reading_strategy_in_the.json": "What's your general reading strategy in the context of a daunting reading list?",
  "data/reddit-ask/r/askphilosophy/comments/o6qq0m/what_philosophy_books_for_friend_who_locked_up.json": "What philosophy books for friend who locked up",
  "data/reddit-ask/r/askphilosophy/comments/o6u0za/i_didnt_ask_to_be_born_what_is_the_philosophical.json": "\"I didn't ask to be born.\" What is the philosophical solution to get out of this mindset?",
  "data/reddit-ask/r/askphilosophy/comments/o7e1ce/can_somebody_know_something_without_being_able_to.json": "Can somebody know something without being able to explain it in language?",
  "data/reddit-ask/r/askphilosophy/comments/o877wx/how_do_you_justify_private_ownership_of_land.json": "How do you justify private ownership of land?",
  "data/reddit-ask/r/askphilosophy/comments/o8z21q/why_is_it_consider_humane_to_put_an_animal_down.json": "Why is it consider humane to put an animal down when their situation is dire or pain great, yet humans we go to great lengths to keep people alive who should be allowed to depart?",
  "data/reddit-ask/r/askphilosophy/comments/oa4yvv/are_there_other_universitylevel_courses_like.json": "Are there other university-level courses like these on YouTube?",
  "data/reddit-ask/r/askscience/comments/npepgw/whats_outside_the_universe.json": "What's outside the universe?",
  "data/reddit-ask/r/askscience/comments/npwh7z/a_2_year_old_toddler_learns_about_6000_words_and.json": "A 2 year old toddler learns about 6000 words and with the rate of 2500% according to studies, if the kid is in touch with multiple people throughout his early childhood, will this metrics increase, if yes then how?",
  "data/reddit-ask/r/askscience/comments/nqda9j/if_a_stars_color_is_determined_by_its_temperature.json": "If a star’s color is determined by it’s temperature (the bluer the hotter) then why aren’t any stars for an example green or purple? (Only red, orange, yellow and blue)",
  "data/reddit-ask/r/askscience/comments/nqvz98/what_exactly_is_missing_for_the_covid19_vaccines.json": "What exactly is missing for the covid-19 vaccines to be full approved, and not only emergency approved?",
  "data/reddit-ask/r/askscience/comments/nrjs19/i_got_the_moderna_vaccine_6hr_ago_how_many_spike.json": "I got the Moderna vaccine ~6hr ago. How many spike proteins have my ribosomes produced in this time (order of magnitude)?",
  "data/reddit-ask/r/askscience/comments/ns9k3x/does_electromagnetic_radiation_like_visible_light.json": "Does electromagnetic radiation, like visible light or radio waves, truly move in a sinusoidal motion as I learned in college?",
  "data/reddit-ask/r/askscience/comments/nsqumo/is_there_an_orbital_distance_that_would_allow_an.json": "Is there an orbital distance that would allow an object to move at *precisely* the same speed as the ground?",
  "data/reddit-ask/r/askscience/comments/ntjcm0/covid19viruses_mutate_often_but_can_scientists.json": "Covid-19/viruses mutate often, but can Scientists predict certain mutations ahead of time to safeguard via vaccination?",
  "data/reddit-ask/r/askscience/comments/nurbsp/how_can_rabies_still_exist_and_be_as_prevalent_as.json": "How can Rabies still exist and be as prevalent as it is, if it's lethality is 99.99% and it's disease cycle is relatively short?",
  "data/reddit-ask/r/askscience/comments/nvzdow/why_doesnt_the_strong_nuclear_force_have_an.json": "Why doesn't the strong Nuclear force have an infinite range?",
  "data/reddit-ask/r/askscience/comments/nw9z9h/what_affects_the_lifespan_of_memory_t_and_b_cells.json": "What affects the lifespan of memory T and B cells?",
  "data/reddit-ask/r/askscience/comments/nwl3ck/why_does_the_moderna_vaccine_include_two_100.json": "Why does the Moderna vaccine include two 100 micrograms doses of mRNA, while that for Pfizer is two doses of 30 micrograms each?",
  "data/reddit-ask/r/askscience/comments/nxakev/do_other_vaccines_that_are_widely_used_also_have.json": "Do other vaccines that are widely used also have the side effect of sometimes creating blood clots?",
  "data/reddit-ask/r/askscience/comments/nxfyrs/does_anyone_know_what_octyal_hydroxide_stearate_is.json": "Does Anyone know what Octyal Hydroxide Stearate is?",
  "data/reddit-ask/r/askscience/comments/nxmyza/what_are_the_exact_processes_at_work_that_allow.json": "What are the exact processes at work that allow Gallium to “poison” other metals like aluminum? I’ve seen several videos of the phenomenon, but want to understand the exact science behind it.",
  "data/reddit-ask/r/askscience/comments/nxr1z0/how_does_host_selection_work_for_different.json": "How does host selection work for different species of parasitic wasps?",
  "data/reddit-ask/r/askscience/comments/ny2rl4/how_strong_is_the_evidence_for_alternative.json": "How strong is the evidence for alternative hypotheses for the dinosaur extinction event?",
  "data/reddit-ask/r/askscience/comments/ny6l7p/how_far_does_the_radius_of_suns_gravity_extend.json": "How far does the radius of Sun's gravity extend?",
  "data/reddit-ask/r/askscience/comments/nyfopn/would_any_of_the_recent_flu_vaccines_protect_me.json": "Would any of the recent flu vaccines protect me against the flu strain from 1918 if I were to travel back in time?",
  "data/reddit-ask/r/askscience/comments/nyv1qh/why_dont_microplastics_keep_breaking_down.json": "Why don't microplastics keep breaking down?",
  "data/reddit-ask/r/askscience/comments/nzh4j0/the_earth_is_about_45_billion_years_old_and_the.json": "The earth is about 4,5 billion years old, and the universe about 14,5 billion, if life isn't special, then shouldn't we have already been contacted?",
  "data/reddit-ask/r/askscience/comments/nzy81l/if_haileys_comet_loses_ice_to_form_its_tail_how.json": "If Hailey’s comet loses ice to form its tail, how many years will it take for the comet to erode into nothing?",
  "data/reddit-ask/r/askscience/comments/o03muo/when_you_look_at_a_crescent_moon_it_seems_you_can.json": "When you look at a crescent moon it seems you can see the edge of the darkened portion. Are we really seeing an edge or is our brain just filling out the rest of the circle?",
  "data/reddit-ask/r/askscience/comments/o0bncs/askscience_ama_series_we_have_60_years_of.json": "AskScience AMA Series: We have 60+ years of experience with renewable energy & the energy transition. Ask us anything!",
  "data/reddit-ask/r/askscience/comments/o0cbbe/if_the_earth_was_hit_by_another_large_planetary.json": "If the earth was hit by another large planetary body early in its life, why is our orbit still relatively circular?",
  "data/reddit-ask/r/askscience/comments/o0cs74/did_the_goods_south_image_capture_colliding.json": "Did the GOODS south image capture colliding galaxies?",
  "data/reddit-ask/r/askscience/comments/o0i9s0/how_deep_can_water_be_before_the_water_at_the.json": "How deep can water be before the water at the bottom starts to phase change from liquid to solid?",
  "data/reddit-ask/r/askscience/comments/o0k1fs/why_are_liquids_almost_always_shinyreflective.json": "Why are liquids almost always shiny/reflective?",
  "data/reddit-ask/r/askscience/comments/o13haj/what_happens_to_a_person_dying_of_thirst_if_they.json": "What happens to a person dying of thirst if they drink seawater?",
  "data/reddit-ask/r/askscience/comments/o161aj/how_does_mad_cow_disease_stay_dormant_for_upto.json": "How does Mad Cow Disease stay dormant for upto decades in humans? How have we still not eliminated the disease?",
  "data/reddit-ask/r/askscience/comments/o1ue31/how_does_the_immune_response_that_causes_hay.json": "How does the immune response that causes hay fever differ from the immune response that is utilised by COVID vaccines? (And why don't antihistamines affect the latter?)",
  "data/reddit-ask/r/askscience/comments/o1zuxt/does_mars_have_caves_and_if_we_discover_a_large.json": "Does Mars have caves and if we discover a large enough cave system on Mars, how deep would we need to go to reach a hospitable temperature?",
  "data/reddit-ask/r/askscience/comments/o2mscv/how_can_certain_bacteria_and_viruses_be_deadly_to.json": "How can certain bacteria and viruses be deadly to one species but completely harmless to another?",
  "data/reddit-ask/r/askscience/comments/o2tj79/why_dont_mrna_vaccines_require_an_adjuvant.json": "Why don't mRNA vaccines require an adjuvant?",
  "data/reddit-ask/r/askscience/comments/o39z7d/is_misophonia_culturally_dependent.json": "Is misophonia culturally dependent?",
  "data/reddit-ask/r/askscience/comments/o3qxec/can_chinese_alligator_hybridize_with_american.json": "Can Chinese Alligator hybridize with American Alligator?",
  "data/reddit-ask/r/askscience/comments/o40gr6/if_a_neutrinos_can_travel_through_the_earth.json": "If a neutrinos can travel through the earth without ever colliding with another particle due to their incredibly small mass, why do photons collide with anything at all when their mass is non-existent?",
  "data/reddit-ask/r/askscience/comments/o44hzz/why_flux_is_some_finite_number_even_if_there_are.json": "Why flux is some finite number even if there are infinite number of electric field lines passing through finite area of cross section?",
  "data/reddit-ask/r/askscience/comments/o4ojij/is_there_any_form_of_matter_that_cannot_be.json": "Is there any form of matter that cannot be categorized on the periodic table?",
  "data/reddit-ask/r/askscience/comments/o4x925/do_any_other_species_have_their_children_go.json": "Do any other species have their children go through a rebellious phase like our teenagers do? How unique are humans teenage years compared to other animals?",
  "data/reddit-ask/r/askscience/comments/o50gzf/other_than_influenza_cases_dramatically.json": "Other than influenza cases dramatically decreasing due to lockdown, increased sanitization, mask wearing, and social distancing during the COVID-19 pandemic, have we recorded other dramatic decreases in other diseases such as measles, mono, strep, staph, etc?",
  "data/reddit-ask/r/askscience/comments/o5iqml/if_tesla_was_on_the_path_of_making_electricity_be.json": "If Tesla was on the path of making electricity be conducted through air, like WiFi, how come we can't do it now since technology advanced so much?",
  "data/reddit-ask/r/askscience/comments/o5yrec/whats_the_main_barrier_to_creating_an_hiv_vaccine.json": "What's the main barrier to creating an HIV vaccine?",
  "data/reddit-ask/r/askscience/comments/o6ao2v/how_effective_is_the_jj_vaxx_against.json": "How effective is the JJ vaxx against hospitalization from the Delta variant?",
  "data/reddit-ask/r/askscience/comments/o6xnan/what_is_the_theoretical_maximum_size_of_a.json": "What is the theoretical maximum size of a terrestrial planet?",
  "data/reddit-ask/r/askscience/comments/o6ysqw/ice_burns_make_no_sense_to_me_on_a_molecular.json": "Ice burns make no sense to me on a molecular level. Your skin cells are damaged because they came in contact with molecules that move too slowly?",
  "data/reddit-ask/r/askscience/comments/o7er3l/do_tides_levels_predict_sinkhole_formation_in.json": "Do tides levels predict sinkhole formation in seaside areas?",
  "data/reddit-ask/r/askscience/comments/o7klfh/what_happens_if_we_delay_the_second_dose_for.json": "What happens if we delay the second dose for AstraZeneca vaccine to 12+ weeks after the first one?",
  "data/reddit-ask/r/askscience/comments/o7lz50/if_a_reptile_that_uses_van_der_waals_forces_to.json": "If a reptile, that uses Van Der Waals forces to stick to walls, were to die whilst stuck to a surface, would it stay in place?",
  "data/reddit-ask/r/askscience/comments/o7mqdl/why_do_waves_always_move_towards_the_shore.json": "Why do waves always move towards the shore?",
  "data/reddit-ask/r/askscience/comments/o7pgeu/does_name_familiarity_create_unintended_bias.json": "Does name familiarity create unintended bias?",
  "data/reddit-ask/r/askscience/comments/o7y8x6/against_the_delta_variant_do_vaccines_still.json": "Against the Delta variant, do vaccines still protect against serious illness and complications in breakthrough infection patients with chronic conditions, like asthma or sleep apnea?",
  "data/reddit-ask/r/askscience/comments/o7znd1/why_is_chickenpox_more_dangerous_for_adults.json": "Why is chickenpox more dangerous for adults?",
  "data/reddit-ask/r/askscience/comments/o83585/when_someone_is_emotional_and_choked_up_or_has_a.json": "When someone is emotional and “choked up” or has a lump in their throat, what is actually happening?",
  "data/reddit-ask/r/askscience/comments/o8cmbg/how_do_we_know_weve_discovered_a_new_species_of.json": "How do we know we’ve discovered a new species of human based on a single fossil, and not just a really ugly dude?",
  "data/reddit-ask/r/askscience/comments/o8paqg/is_it_true_some_prey_taunt_predators.json": "Is it true some prey taunt predators?",
  "data/reddit-ask/r/askscience/comments/o8ryu9/if_ocean_waves_are_a_perturbation_of_a_medium_the.json": "If ocean waves are a perturbation of a medium (the ocean), and sound waves are a perturbation of another medium (air), then what is the medium for light / electricity?",
  "data/reddit-ask/r/askscience/comments/o8y04s/how_do_they_know_that_the_skull_found_in_harbin.json": "How do they know that the skull found in Harbin (AKA Dragon Man) belonged to a male and not a female?",
  "data/reddit-ask/r/askscience/comments/o921m0/why_dont_planes_have_dimples_like_golf_balls.json": "Why don't planes have dimples like golf balls?",
  "data/reddit-ask/r/askscience/comments/o9aalo/are_birds_today_descended_from_a_single_dinosaur.json": "Are birds today descended from a single dinosaur species or multiple dinosaur species?",
  "data/reddit-ask/r/askscience/comments/o9msp0/having_a_large_supply_of_atp_inhibits_oxidative.json": "Having a large supply of ATP inhibits oxidative phosphorylation, thus preventing more ATP from being synthesized. Is there any particular reason that the body wouldn't want to keep creating more ATP?",
  "data/reddit-ask/r/askscience/comments/o9y5k1/if_a_person_has_been_depressed_for_a_long_time_is.json": "If a person has been depressed for a long time, is there some kind of 'damage' to their brain, and can anti-depressants reverse the damage?",
  "data/reddit-ask/r/askscience/comments/oaa9d0/is_vaccination_always_recommended_after_infection.json": "Is vaccination always recommended after infection regardless of the type of pathogen?",
  "data/reddit-ask/r/askscience/comments/oas3hs/since_there_isnt_any_resistance_in_space_is.json": "Since there isn't any resistance in space, is reaching lightspeed possible?",
  "data/reddit-ask/r/askscience/comments/oavzi7/do_semi_aquatic_animals_get_ticks_and_lice.json": "Do semi aquatic animals get ticks and lice?",
  "data/reddit-ask/r/askscience/comments/ob0rjb/for_breakthrough_covid_cases_in_fully_vaccinated.json": "For \"breakthrough\" Covid cases in fully vaccinated people that are deemed to be \"mild\" (presumably in terms of symptoms), is there still danger of other hidden internal damage (i.e. heart, lungs, etc)?"
}