{
  "data/reddit-crypto/r/CryptoCurrency/comments/wd8vuj/i_find_it_hilarious_that_the_most_optimistic.json": "I find it hilarious whenever I see someone say to sell and how its a sure sell\nbuy at 10k or buy at 15k, and everytime I look at their history, they got\nwrecked during the bullrun.\n\nThe article where a lot of low income individuals sold at a loss during the drop\nis really indicative in this sub…",
  "data/reddit-crypto/r/CryptoCurrency/comments/wd7lpi/eth_is_up_60_in_a_month.json": "I'd like to ask the opinion of the ETH holders in this sub, do you think this\nbull trap will persist ? I'm about breaking even and want to know if I should\ntransfer over to BTC which hasn't seen the same level of explosive growth this\npast month. Both are the only two I hold and am wondering if…",
  "data/reddit-crypto/r/CryptoCurrency/comments/wdud7n/do_not_click_on_the_coinbase_email_to_confirm.json": "I don't care who thinks this is a stupid post. I just got a scam email so I am\nsure others here did too from what looks like Coinbase. First of all,\n\"Confirmation billing account has been update\" is not a sentence. The word is\n\"updated\". The body of the email contains similar grammatical errors.…",
  "data/reddit-crypto/r/CryptoCurrency/comments/wduowx/my_6_year_crypto_journey_to_becoming_a_day_trader.json": "Obligatory this is not financial advice – read on at your own risk and make sure\nyou are comfortable with your own trades. The old age saying of only put money\ninto Crypto that you are prepared to lose is extremely valuable. This post will\naim to give you a bit of an insight into how I became…",
  "data/reddit-crypto/r/CryptoCurrency/comments/we5446/the_first_truly_decentralized_robbery_was_just.json": "At this point I am sure many of you have heard of the nomad bridge exploit.\nUnlike previous exploits, this wasnt a flashloan or even carried out by a single\ngroup of attackers. After an initial attacker struck, hundreds of separate\naccounts figured out the trick and copy pasted their way into…",
  "data/reddit-crypto/r/Bitcoin/comments/wee3hx/has_anyone_cashed_out_a_large_amount_to_their.json": "I mean from exchanges such as Coinbase, kraken or crypto.com start to their\nbanks",
  "data/reddit-crypto/r/CryptoCurrency/comments/wehf00/this_is_how_much_you_need_to_invest_during_the.json": "Been seeing a few popular post and comment asking how much you would need to\ninvest in to get 1 million dollars USD if the coin ever reaches ATH again. Here\nI calculated how much you would need to invest into a coin to net 1 million.\n\nIts just for fun and don't take it too seriously since each coin…",
  "data/reddit-crypto/r/CryptoCurrency/comments/wf4io8/vitalik_sounded_the_alarm_on_cross_chain_bridges.json": "Seems cross chain bridges have serious problems with security.\n\nBack in January 7th 2022 Vitalik posted this warning:\nhttps://nitter.net/i/status/1479501366192132099\n\nMy argument for why the future will be multi-chain, but it will not be\ncross-chain: there are fundamental limits to the security of…",
  "data/reddit-crypto/r/CryptoCurrency/comments/wfds7v/i_collected_and_curated_the_top_50_antinft.json": "They say to build something during the bear market, so I did!\n\nI wanted to make something funny to entertain my fellow crypto enthusiasts while\nthe skeptics and haters are taking victory laps about our supposed collapse.\nSomething to document the sheer hatred generated by this new tech we're…",
  "data/reddit-crypto/r/CryptoCurrency/comments/wfk2xl/i_was_just_scammed_in_the_most_sophisticated_way.json": "I know I'm an idiot, a dumb teen falling for something so stupid, but it's\nlesson learned, at at least losing $20 in ether wasnt the end of the world.\n\nI'm taking a peek at the CoinMarketCap comment section, right under ADA. Just\ndoing some general browsing, until I come across a comment that…",
  "data/reddit-crypto/r/CryptoCurrency/comments/wf0tih/brave_new_user_numbers_for_july_22_are_out.json": "Brave just published their new user numbers for the month of July:\n\n\n\nMonthly Active Users: 59.58M\n\nDaily Active Users 19.35M (+0.8% HWM; 28-day mean: 18.9M)\n\n\n\nAt the same time the numbers for the privacy-focused search engine were\npublished as well:\n\nQPM: 429.3M (+5.8%)\n\nAnnualized: 5.15B QPD…",
  "data/reddit-crypto/r/CryptoCurrency/comments/wfs403/rant_why_im_done_with_sol_and_why_you_should_pull.json": "Typed on mobile.\n\nSomewhere in this sub I read about DCA'ing top ten coins outperformed trying to\nfind the next moonshot over the long term. SOL was a top ten coin at some point\nin time . So I decided time to expand my portfolio and buy some SOL.\n\nAt first it was quite nice, the concentrated…",
  "data/reddit-crypto/r/CryptoCurrency/comments/wg7xae/ccip034_enable_gifs_in_comments_for_all_users.json": "Reddit have released a new feature allowing all users to post GIF comments:\n\nAnnouncing Inline GIFs in Comments available to all SFW subreddits\n[https://np.reddit.com/r/modnews/comments/vs5ne7/announcing_inline_gifs_in_comments_available_to/]\n\n> Users in enabled subreddits will be able to search…",
  "data/reddit-crypto/r/CryptoCurrency/comments/wg4pa3/ccip036_remove_link_posts_to_paywalled_articles.json": "Summary\n\nModerators should remove link posts to paywalled articles unless a paywall\nfeatures an easy to notice and use cryptocurrency payment option.\n\nProblem Statement\n\nYou all know the feeling, you see an interesting title of a link post you open\nit up only to find out the article is behind a…",
  "data/reddit-crypto/r/CryptoCurrency/comments/wg9zes/ccip038_reduce_karma_for_link_post_from_1x_to_05x.json": "Problem:\n\nr/CryptoCurrency [/r/CryptoCurrency] is spammed with low effort external links\nthat are made into a post. 45 out of the top 100 post this month are just links.\nPosting a link takes little to no effort (just copy and paste) and should not be\nrewarded as much as posting a written comment or…",
  "data/reddit-crypto/r/CryptoCurrency/comments/wh5wh5/bitcoin_has_been_below_its_ath_for_9_brutal.json": "It is no secret that the last few months will be seen as probably one of the\ncraziest even for Crypto. An ATH at 69k was comical enough and then all the\ndenial that we will still rally back up. Then the endless crabbing, ended by one\nof the biggest collapses in crypto, LUNA-UST implosion. Causing a…",
  "data/reddit-crypto/r/CryptoCurrency/comments/wh0fxe/im_beginning_to_think_that_bears_in_this_market.json": "BEAR BEHAVIOR IS SIMILAR TO BULL BEHAVIOR RIGHT AFTER WE CRASHED FROM $69K:\n\nRemember when we started to crash down from $69K, after the bull market peaked,\nand bulls were the ones in denial?\n\nBulls were saying it was a fake drop and we would bounce back to eventually\n$100K. It was \"obviously…",
  "data/reddit-crypto/r/CryptoCurrency/comments/whpncs/why_does_anyone_still_buy_solana_seriously.json": "“Oh it's another person ripping on Solana, predictable\". Yep. Yeah it is I don't\nget how rhetorical this discussion on Solana is and yet it stays relevant.\n\nSince its launch back in March 2020 [https://messari.io/asset/solana/profile],\nSolana has had a series of issues - from hacking to downtime to…",
  "data/reddit-crypto/r/Bitcoin/comments/whlcyi/nobody_should_be_boasting_how_much_btc_they_have.json": "This will probably get downvoted to oblivion, but I feel it must be said. Why\nare there so many people here who tell complete strangers on the internet how\nmuch money they have?\n\nI mean, it's cool to be a fullcoiner, and it's perfectly fine to be proud of\nyour stacking, but Reddit is not a safe and…",
  "data/reddit-crypto/r/CryptoCurrency/comments/whyo67/ethereum_merge_is_going_to_be_the_game_changer_we.json": "The merge is huge guys. At this point if you are not convinced of what an\nenormous event this will be for crypto and all of us who believe in the Ethereum\nproject all I can say is be ready to watch this thing take off. It won't be over\nnight although the media will praise this one of the biggest…",
  "data/reddit-crypto/r/CryptoCurrency/comments/whs5pn/we_are_stuck_in_a_bear_market_until_you_guys.json": "It's investing 101. When everyone is having babies, the market is in a bull run\nand the opposite is true. Look at the markets, they're all not doing too hot and\nneither is the political and socioeconomic enviroment of the world or something\nsmart. Then look at your social media, people have…",
  "data/reddit-crypto/r/Bitcoin/comments/whooxi/been_buying_bitcoin_every_month_since_october.json": "The plan is to continue doing so until I can retire. It's the bitcoin retirement\nplan. I'm documenting the success (or failure) in this blog. Soon its gonna be 5\nyears in, how many more to go? I have zero confidence in my governments ability\nto give me retirement, and 100% confidence in bitcoins…",
  "data/reddit-crypto/r/CryptoCurrency/comments/whr2dt/the_eth_merge_may_be_the_catalyst_for_another.json": "I really think there is a more than likely chance that when the ETH merge\nhappens, or right before it will trigger a massive “buy the rumor sell the news”\nevent.\n\nETH has been pumping recently and I suspect this is the “buy the rumor” phase.\n\nIF there is to be lower lows and another big leg down in…",
  "data/reddit-crypto/r/CryptoCurrency/comments/widqyp/cryptonft_games_will_fail_until_they_prioritise.json": "In their current form, crypto games are terrible. At best, most games look like\nsecond-rate games from the early 2000s. Shitty graphics, janky controls and\nanimations, devoid of any gameplay of merit and best of all; they have predatory\ncrypto/NFT transactions forcibly reamed into every orifice…",
  "data/reddit-crypto/r/CryptoCurrency/comments/wio1zj/vitalik_buterin_i_think_the_next_10_years_is_when.json": "In a closed press conference at the ongoing ETH Seoul 2022 Hackathon, the\nco-founder of Ethereum (ETH) spoke on the future expectations of the Ethereum\nblockchain and the crypto industry in general.\n\n> “I think the next 10 years is when crypto has to transform into something that\n> is not based on…",
  "data/reddit-crypto/r/Bitcoin/comments/wimu3f/ama_i_was_arrested_as_a_buyer_off_of_dark_web.json": "Hi, I’m doing this AMA as a way to bring closure to a bad period in my life. Me\nand co-defendants sold marijuana bought off of Alphabay (dark web marketplace).\nIt’s rare for LE to go after buyers rather than vendors. I was the leader so to\nspeak that orchestrated the whole thing. We live in the US…",
  "data/reddit-crypto/r/CryptoCurrency/comments/wj9i7l/famous_btc_influencer_planb_wrote_an_article.json": "In his latest Twitter post PlanB has linked a PDF with his most recent article\nabout \"quant trading\".\n\nhttps://preview.redd.it/9b3pd2rvuhg91.png?width=589&format=png&auto=webp&s=fd83cf49fc6f34eec5e70d86ffdbdad1dfca0786\n\nIn the article he describes a simple quant trading strategy that will turn…",
  "data/reddit-crypto/r/CryptoCurrency/comments/wj5jl5/hodlnaut_halting_withdrawals_token_swaps_and.json": "Update1: Hodlnaut just set their reddit sub to private only.\n\nUpdate2: from u/AshamedFlame [/u/AshamedFlame] : Everything’s private - twitter,\ntelegram, discord etc\n\nHere is the full text I received via email:\n\nTo all users, we regret to inform you that we will be halting withdrawals, token\nswaps…",
  "data/reddit-crypto/r/CryptoCurrency/comments/wjd777/need_some_help_with_a_ledger_i_bought_off_of_ebay.json": "I bought this Ledger on ebay for $19.99 and I'm concerned that it's not legit.\n\nI know it's recommended that you buy directly from the manufacturer but after\ndoing some research it seems you can reset the ledger and create a new seed\nphrase which should make it safe. also the ledger live software…",
  "data/reddit-crypto/r/CryptoCurrency/comments/wjyj6w/would_you_sacrifice_5_years_of_your_life_for_100.json": "You will be given 100 Bitcoin and 100 Ethereum, but in return you will be put to\nsleep for 5 years. Would you accept that? (When you wake up, Bitcoin will be\nworth 300K and Ethereum 65K)\n\nEven though I know I would probably say yes, the possibility that something bad\nmight happen to my…",
  "data/reddit-crypto/r/Bitcoin/comments/wjmh84/i_have_been_dcaing_so_hard_i_to_bitcoin_during.json": "20K-17K was a godsend for me. Started buying when it was at 45J back in February\n2021, went through the whole \"Bitcoin is too old\" phase, really learnt about it,\nchanged all my shitcoins to Bitcoin, started DCAing, doubled down once the\nRussia-Ukraine situation hit and now I'm in positive numbers…",
  "data/reddit-crypto/r/CryptoCurrency/comments/wk75p2/pack_your_moons_were_moving_to_mainnet.json": "Hello hello everyone in r/cryptocurrency [/r/cryptocurrency]!\n\nFor those of you who have been following Reddit’s Community Points\n[https://www.reddit.com/community-points/] project, you may be aware that the\nsystem behind Moons has been living on something called a “testnet”. After a\ncouple years…",
  "data/reddit-crypto/r/CryptoCurrency/comments/wkdwj8/someone_is_using_tornado_cash_to_send_eth_to.json": "It appears there's still some chaotic good left in the world. Earlier today,\nsomeone or a group of individuals began using tornado cash to send ETH to known\nwallets of celebrities. Recipients included Donald Trump, Jimmy Fallon, Beeple,\nShaq, Brian Armstrong, Randi Zuckerberg, BitBoy and many…",
  "data/reddit-crypto/r/Bitcoin/comments/wkb04j/few_understand_how_to_read.json": "This is too fun... my guy thinks this bill is going to start taxing BTC over $50\n\nMy dude, everything was a taxable event before; this bill makes you tax EXEMPT\nfor purchases under $50 with BTC 😂\n\nIt's a giant catalyst for BTC, if anything.\n\nStay informed yall. Don't be like Buttcoin",
  "data/reddit-crypto/r/CryptoCurrency/comments/wjygre/the_crypto_community_is_not_what_it_was_serious.json": "The majority of crypto users have forgotten or never cared about the true goal :\nDecentralisation.\n\nHopefully, the tornado cash / USDC freezing situation opens some eyes. Corpos\nand governments are NOT welcome, and should be resisted every step of the way.\nCrypto has become all about money and no…",
  "data/reddit-crypto/r/CryptoCurrency/comments/wke092/coinbase_reported_q2_earnings_they_lost_11.json": "Coinbase’s revenue declined nearly 64% as investors exited the crypto market\nafter last year’s dramatic run. Retail transaction revenue came in at $616.2\nmillion, down 66% and below the $667.1 million consensus among analysts polled\nby StreetAccount.\n\nCoinbase reported a $1.1 billion net loss,…",
  "data/reddit-crypto/r/CryptoCurrency/comments/wkwgmg/usinflation_comes_in_at_85_finally_below.json": "Just now, US CPI has offically been released and comes in at 8.5%. That's a good\nmargin below the estimates of 8.7% and massively below last month's CPI of 9.1%.\nMarkets will now probably start to rally. And that lower inflation was crucial\nfor Crypto to continue its rally and expand it further…",
  "data/reddit-crypto/r/CryptoCurrency/comments/wku1u4/so_moons_went_mainnet.json": "So moons went mainnet and price is pumping...\n\nBut in order for that to happen someone needs to sell and another person needs\nto buy.\n\nSo where are you all buying and selling moons ?\n\nWant to get in on the action, alas like everything in crypto information is hard\nto find.\n\nGoogle gives no info,…",
  "data/reddit-crypto/r/CryptoCurrency/comments/wl1tcn/a_day_in_the_life_of_a_buttcoiner_vs_a_day_in_the.json": "A DAY IN THE LIFE OF A BUTTCOINER:\n\nAt 1pm you wake up and quickly light up a cigarette. Breakfast is the most\nimportant meal of the day afterall.\n\nWhile you smoke and watch a video of Joe Rogan fighting a polar bear and Alex\nJones in a bikini, you decide to go to buttcoin subreddit.\n\nIt's 3pm. To…",
  "data/reddit-crypto/r/CryptoCurrency/comments/wkxnmi/i_was_offered_crypto_to_promote_some_new_project.json": "The name of the project has been blacked out, so not actual promotion is taking\nplace.\n\nAfter years of hard work shit posting on Reddit, I've reached the level of paid\ncrypto promoter similar to Bit Boy, Kim Kardashian and Matt Damon. I've been\noffered money (crypto to be exact) to promote a new up…",
  "data/reddit-crypto/r/CryptoCurrency/comments/wkwbvp/reminder_to_ignore_the_hot_girl_in_your_dms_he_is.json": "As moons keep pumping and hopium keeps coming. This is a gentle reminder to the\ncrypto security challenged among us: The girl in your dm’s asking for your seed\nis actually 300lbs and definitely not a girl.\n\nDon’t connect your wallets to any links they send you. No s(he) won’t triple\nyour investment…",
  "data/reddit-crypto/r/CryptoCurrency/comments/wlougr/the_importance_of_sending_a_small_testamount.json": "So I a few weeks ago I finally decided to move all my ETH to my cold storage\nwallet. Being a paranoid fuck, I decided to test with a small test-amount first.\n\nTurns out I had accidentally copy/pasted the wrong address. The test amount\nnever arrived. Thankfully, I only lost about what was then €15.…",
  "data/reddit-crypto/r/Bitcoin/comments/wlr25s/biden_announces_0_inflation_mission_accomplished.json": "https://www.theguardian.com/global/video/2022/aug/10/joe-biden-hails-zero-inflation-july-us-video\n\n(The official CPI number is 8.5% for July)",
  "data/reddit-crypto/r/CryptoCurrency/comments/wm2fcl/finally_robinhood_is_facing_claims_of_market.json": "A US judge just confirmed that Robinhood must face the claims of market\nmanipulation by restricting trading during the 2021 meme-stock/crypto rally.\nAfter the many other problems including ever-decreasing users this is another\none for Robinhood and actually a very well deserved one as they did…",
  "data/reddit-crypto/r/CryptoCurrency/comments/wlstu9/has_anyone_here_actually_been_in_crypto_for_more.json": "Most of us here are relatively new with only one cycle under our belts. And\nlet's face it, the fair-weather hodlers have already crawled their way back to\nbeg their wives to reconsider the divorce. So if you’re still in this sub\nreading this post, it means either you’re unfazed and have seen it all…",
  "data/reddit-crypto/r/CryptoCurrency/comments/wmvlk5/i_analyzed_buying_bitcoin_on_mondays_and_selling.json": "Reading through this subreddit I often stumble on the term 'red Monday' and\n'dildo Sunday'... It seems that there is a prevelant opinion that during\nweekdays the crypto market is pumping while dumping on weekends. The current\nmantra is buy when it's low and sell before it dumps,…",
  "data/reddit-crypto/r/CryptoCurrency/comments/wn2yjq/eth_went_up_more_than_55_in_the_last_30_days_and.json": "ETH is trying again to break 2000$ ceiling. It is still too far below its ATH of\nalmost 4900$ but at least for now market seems a little more enthusiastic.\n\nHow much of this upward movement is due to upcoming merge is anyone's guess. As\nBTC also slowly moving toward 25k.\n\nGood news is if the market…",
  "data/reddit-crypto/r/CryptoCurrency/comments/wnaslk/update_to_user_trolling_by_sending_others_01eth.json": "Few days ago some one was trolling by sending lots of popular users/celebs\n0.1Eth from Tornado Cash.\n\nIn response, quite a few dapps have blocked all these wallets that received\nfunds from Tornado.\n\nProminent defi apps like Uniswap, Aave, Balancer have already blocked these\naccounts. While the…",
  "data/reddit-crypto/r/CryptoCurrency/comments/wnbm4q/eth_back_over_2000_for_first_time_since_may_25.json": "Pleasantly surprised to wake up to ETH being back over $2,000. Feels like it’s\nbeen forever but according to CMC data it was last over that mark at 12am on May\n25th, so a little less than 3 months ago.\n\nIs it just pumping because of the upcoming merge or is this the start of the\nnext crypto rally?…",
  "data/reddit-crypto/r/CryptoCurrency/comments/wndwy2/friendly_reminder_as_market_goes_up_so_do.json": "The sub is getting that tingly feeling again.\n\nBTC and ETH have hit 30 day highs. The merge is nearly upon us. Surely winter\nmust be thawing.\n\nBut buyer beware.\n\nThere will be a ton of “smart” sounding posts with all kinds of technical\npredictions that make it sound like gains are guaranteed.\n\nThe…",
  "data/reddit-crypto/r/CryptoCurrency/comments/wnjt5n/10t_asset_manager_blackrock_is_apperantly_allowed.json": "BlackRock, the asset manger with about $10T in clients assets, has just said\nthat it will release a private fund for its clients to have actual spot Bitcoin.\nMeanwhile we are not getting a spot ETF approved by the SEC. How are those\npeople buying at BlackRock any better than normal retail…",
  "data/reddit-crypto/r/CryptoCurrency/comments/wnqske/shitcoins_not_even_once_man_turned_500000_into.json": "You ever hear the expression \"Throwing good money after bad?\"\n\nTechnically, this was his second transaction, where he followed his 1BNB\npurchase of Safemoon on the 17th April 2021 with another 151 BNB, and then\napparently found another 1.84BNB underneath the couch cushions and lobbed that\nin as…",
  "data/reddit-crypto/r/CryptoCurrency/comments/wnobq1/why_are_people_still_comparing_bitcoin_and.json": "Just as the Ethereum Merge is inching closer and ETH is pumping a lot due to the\nhype many are once again starting to compare Ethereum to Bitcoin and talk about\n\"The Flippening\". Why? Probably just because they are two OG cryptos and by far\nthe most safe ones. There is literally no other similarity…",
  "data/reddit-crypto/r/Bitcoin/comments/wnoxrc/got_flexed_on_after_orange_pilling_my_boss.json": "So I orange pilled the shit out of my boss today, dropped a lot of knowledge\nabout what Bitcoin actually is and how it works. He then proceeded to first go\non Amazon and order a trezor, then immediately opened up robinhood and became a\nwholecoiner instantly. I am so jealous.",
  "data/reddit-crypto/r/CryptoCurrency/comments/wo65bn/i_feel_like_i_should_just_give_upwhy_even_bother.json": "A few months ago I was super excited for Fantom and ita Solidly with Andre\nCronje as a main developer. Super good tech, really bullish… boom main dev left,\ndust remains.\n\nNext one JUNO. Awesome usecase, crazy fast, top tier Cosmos coin…boom down like\na stone after whale fiasco.\n\nLUNA came swiftly…",
  "data/reddit-crypto/r/CryptoCurrency/comments/wo3v12/apparently_everyone_93_of_eth_addresses_are_only.json": "The other day I had posted how one of my addresses had previous trfs on the\nchain from Tornado Cash. So, ironically, I now need a mixer to clean my ETH.\n\nWell, turns out, everyone could need this.\n\nAccording to this researcher\nhttps://twitter.com/ElBarto_Crypto/status/1558428428763815942\n\nOnly…",
  "data/reddit-crypto/r/CryptoCurrency/comments/woe0nu/hiring_87000_irs_agents_is_the_most_bullish.json": "If the markets have taught me anything, it's to try to look at things from a\ndifferent perspective.\n\nMany people suggest that the increase in IRS agents is a bad thing for the\naverage Joe.\n\nMaybe it is. Maybe it isn't.\n\nOne thing is true though, tax implications usually occur during the sale…"
}