{
  "data/reddit-books/r/books/comments/pfipch/have_you_ever_experienced_the_joy_of_someone.json": "While cleaning out old bookshelves this weekend my mom rediscovered her copy of\nLittle Women. That moment of pure happiness to be holding not only a book she\nloved but her copy that she read over and over when she was younger was so\nspecial to see. That joy made everyone in the room smile. You could…",
  "data/reddit-books/r/books/comments/pfj7y4/what_is_a_book_you_heard_a_lot_of_good_things.json": "Is there a book you can remember hearing a lot of good things about, be it from\nfriends, family, literary critics or social media, that yoy ended up reading\nyourself and were disappointed with because it failed to live up to the hype?\n\nWas there any particular aspect that you felt did not live up to…",
  "data/reddit-books/r/books/comments/pfms3v/the_guest_list_by_lucy_foley_would_make_a_great.json": "A quick summary: The Guest List is about a murder during a celebrity wedding on\nan Irish island.\n\nThe characters are richly drawn and deeply layered. The isolated setting is\nhaunting and atmospheric. The mystery has multiple great payoffs.\n\nIt’s the best thriller I’ve read in recent memory. HBO…",
  "data/reddit-books/r/books/comments/pfqpao/the_bell_jar_by_sylvia_plath.json": "RATING: 4.25/5\n\n\"I am, I am, I am.\"\n\nI heard of this book when I was 17, after which I slipped into a paralysing\ndepressive episode and physically feared the power this book held over me. I\ncouldn't read for the next two years. So I am glad that I picked it up again,\nthanks to my bookclub. I treaded…",
  "data/reddit-books/r/books/comments/pftjlm/any_secret_history_by_donna_tart_fan_here.json": "And what are your views on it... I felt Donna tart did a remarkable work. As\nsomeone who takes great interest in Greek mythologies, reading some being\nembodied in the novel was such a treat. The whole Dionysus evoking ritual got me\nso absorbed. All the dark secrets hidden deep within each of their…",
  "data/reddit-books/r/books/comments/pfttgo/carl_sagans_foreboding_of_an_america_a_quote_from.json": "“I have a foreboding of an America in my children's or grandchildren's time --\nwhen the United States is a service and information economy; when nearly all the\nmanufacturing industries have slipped away to other countries; when awesome\ntechnological powers are in the hands of a very few, and no one…",
  "data/reddit-books/r/books/comments/pfvx4z/is_there_any_author_that_knows_the_depths_of_the.json": "I just finished Crime and Punishment for the second time, and I can't help but\nmarvel at Dostoyevsky's insight on the workings of Raskolnikov's conscience and\nsoul. While most modern books are eloquently written page turners, with a\ncompelling story and decently ( sometimes wonderfully) developed…",
  "data/reddit-books/r/books/comments/pfy84z/agatha_christie_is_exquisite.json": "Firstly, I apologize. Every single person on this subreddit has heard the name\nand has probably read her books. But holy shit.\n\nI 'read' her books in eighth grade, at least I thought I was reading. But now\nthat I actually understand them, it really hits me hard how ahead of her time\nshe was. A book…",
  "data/reddit-books/r/books/comments/pfydil/i_finished_the_gulag_archipelago_by_alexander.json": "I feel like I won something very sad and don't know where to go from here. I can\ndefinitely say without a doubt that this book changed my soul and now I feel\nempty and at a loss. I don't have Solzhenitsyn's memory, and I can't imagine\nusing any part of this book in normal conversation, but I want to…",
  "data/reddit-books/r/books/comments/pg3b9m/have_you_ever_read_a_book_that_you_liked_so_much.json": "Hi, I think this might sound like a really weird question but there have been\nbooks I read that I enjoyed so much that I didn't want to finish them.\n\nJust to give one example, when I was little it happened with To Kill A\nMockingbird. I wanted to be in that family, learn from the father's lessons…",
  "data/reddit-books/r/books/comments/pg3vvn/is_stephen_king_considered_a_good_writer_or_just.json": "I haven’t read… well… any Stephen King, really. But I’m working my way through\nSalem’s Lot right now. I’m really enjoying it overall, but that’s mainly because\nI like the mystery that he’s building. His actual writing is leaving a lot to be\ndesired for me.\n\n• The main character of the book is a…",
  "data/reddit-books/r/books/comments/pghsy7/kurt_vonneguts_cats_cradle_is_a_really_good_book.json": "I was reading this book for school thinking it was going to be another one of\nthose boring books, but it turned out to be a fascinating read especially after\nanalyzing the contextual influences that sparked his entire writing to be so\nnihilistic/existential in his writing. Particularly in Cat's…",
  "data/reddit-books/r/books/comments/pgks8k/hi_im_yaa_gyasi_author_of_the_bestselling_books.json": "TRANSCENDENT KINGDOM\n[https://www.penguinrandomhouse.com/books/622478/transcendent-kingdom-by-yaa-gyasi/?pdivflag],\nmy second book, follows Gifty, a young woman studying reward-seeking behavior at\nStanford, as she deals with the sudden loss of her brother and grapples with her\nfaith and…",
  "data/reddit-books/r/books/comments/pgldww/when_i_am_stress_or_anxious_i_read_haruki.json": "When I am stress or anxious, I read Haruki Murakami. I find his books relaxing,\nwith no real sense of urgency. It put my mind at ease for some reason. When I\nread his books, I find myself less anxious and enjoy the little things, like a\ncup of chamomile or a simple toast.\n\nWhen I read his books, I…",
  "data/reddit-books/r/books/comments/pgvdni/do_you_find_ratings_and_reviews_on_goodreads.json": "I use goodreads for a looong time. And I now I'm in a situation that I see the\nrating & reviews of a book, if it seems intriguing I mark that as \"Want to Read\"\nand later read that when I can get the book. It has become impossible for me to\nstart a book without checking it on goodreads. What about…",
  "data/reddit-books/r/books/comments/pgyk5k/im_not_a_sharer.json": "I’ve recently started my book collection and one of my friends is very keen on\nborrowing my books. Because of these situations my inner child that hated to\nshare is coming out. I never thought I could feel this protective of my things\nagain until I let her borrow 2 of my books over a month ago. She…",
  "data/reddit-books/r/books/comments/ph712h/i_just_finished_frank_herberts_dune_and_need_to.json": "So I found an old copy of Dune in a used bookstore a while ago, picked it up for\nthe low price of €2,50 because I was curious after hearing so much about it and\nseeing the trailers for the upcoming movie.\n\nMy my, what a ride this novel is. I must admit that I am not the biggest\nliterature guy. I…",
  "data/reddit-books/r/books/comments/ph7gap/the_market_of_printing_english_books_is_hot_hot.json": "Here's the photo:\n\nhttps://imgur.com/a/RBhLwam\n\nSo, most book stores have an English book section these days. In my city,\nMashhad, there's a dingy book shop called \"Ofogh Book\" that sells all sorts\nEnglish, French, German, Italian etc etc books. These books are printed\nunofficially. And there's no…",
  "data/reddit-books/r/books/comments/ph9bn1/read_the_metamorphosis_recently_thought_it_was.json": "Okay, so on 26th August, I completed the The Metamorphosis by Franz Kafika, and\nwhen I completed the book it didn't lived up to the hype it created because I\nheard a lot of people say it's one of the goats and so deep and so and so. Well,\nwhen I finished it, it wasn't the case for me, but then, I…",
  "data/reddit-books/r/books/comments/phfell/pillars_of_the_earth_by_ken_follett_why_all_the.json": "Just finished reading Pillars of the Earth, and I guess I'm just really\nconfused... why is this book so beloved and by so many? I was very, very excited\nto finally give it a read after reading so many glowing reviews (BBC ranked it\n#33 on it's \"Most Beloved Books in Britain\", as an example), and in…",
  "data/reddit-books/r/books/comments/phkj89/i_know_the_book_was_better_than_the_movie_is_a.json": "It's a cliché for a reason. I can easily name a dozen examples off the top of my\nhead where the book was better than the movie. I realized though that I've never\nread a book that was adapted into a movie where I enjoyed the movie more. I'm\ncurious if anyone has an example that goes against the norm.…",
  "data/reddit-books/r/books/comments/phqv4s/the_princess_bride_is_one_of_the_few_of_which_i.json": "As an adult, I still enjoy reading children's books. I love discovering how an\notherwise cliche plot has a whole new meaning when reading it as an adult. (A\nspecial mention to A Monster Calls by Patrick Ness.)\n\nThis was how I discovered The Princess Bride three years ago. Once I started\nreading it,…",
  "data/reddit-books/r/books/comments/phugaj/do_overly_unique_character_names_bother_anybody.json": "I understand why authors might want to make their characters stand out a little.\nBut when every character in the book has a one in a million name? It's always\nthe whole squad of characters. It kind of takes me out of the immersion, like\ntheir names are just costumes instead of real people. If that…",
  "data/reddit-books/r/books/comments/phuxb0/the_name_of_the_wind_ruining_my_weekends_plans.json": "A few weeks back, I wandered into r/books [/r/books] having been in a bit of a\nbook-drought and buried in the comments of a post, someone recommended The Name\nof the Wind. I am halfway through and wanted to say thank you (and curses!) to\nwhomever mentioned this book. It is enthralling! (and I have…",
  "data/reddit-books/r/books/comments/pi24zj/yall_ever_get_so_excited_reading_a_book_that_you.json": "I've always had a hard time focusing, usually I listen to audiobooks, but\nrecently I've really got into some comics and sometimes I get so damn excited\nwith what will come next that I start doing other stuff, like I intentionally\nlook for ways to overload my senses or something like that.\n\nI'm…",
  "data/reddit-books/r/books/comments/pi3yyt/jesus_christ_neromancer_is_hard_to_read.json": "I went in with an open mind and excited but I’m just forcing myself to finish it\nat this point. I understand that the author wanted to overload the reader with\nso much information and having everything explained sucks but holy hell this\nisn’t a fun read. It jumps from point to point and is really…",
  "data/reddit-books/r/books/comments/pia229/do_any_of_you_have_concentration_issues_when.json": "I dont mean in a \"meh, this book must just be boring\" kinda way, cus it happens\nto me with good and bad books. For me, i have a hard time concentrating in\ngeneral, which is one of the reasons i want to read more. It should strengthen\nit, or so ive heard. But often when i try to, music will play in…",
  "data/reddit-books/r/books/comments/pib24a/is_vonnegut_popular_in_countries_outside_of_usa.json": "Idk much about this but have always liked Kurt Vonnegut’s books and thought of\nthem to have an American appeal to the philosophies behind the stories. I\nunderstand that anyone all over the world could relate to these stories but it\ndef has USA satire in it. My favorite of his is sirens of titan, but…",
  "data/reddit-books/r/books/comments/pid58e/i_am_really_interested_in_reading_complicated.json": "I tried to read books such as “A tale of two cities” by Charles Dickens.\nHowever, i really struggled to understand what exactly was it trying to tell me.\nAlso, i want to try read classic literature books such as maybe ”Pride and\nPrejudice” by Jane Austen. (I hope you get what kind of books i am…",
  "data/reddit-books/r/books/comments/pienh5/just_finished_robin_hobbs_farseer_trilogy.json": "I feel like I read a lot of fantasy in my life, so I'm not sure how I missed out\non Robin Hobb--but I'm here now and I have to say, I kind of like it.\n\nThe first two books were particularly good in that both kept me up past my\nbedtime regularly. The third book, though does slow down a bit and I…",
  "data/reddit-books/r/books/comments/pif6wt/how_can_nonnative_speaker_understand_the_classic.json": "I have been always fascinated and interested on reading the classics, stuff like\n\"Pride and prejudice\", \"Persuasion\", \"The Great Gatsby\". And maybe some\ncontemporaries like The Hobbits or the Lord of the Ring fascinated me a lot.\n\nBut my problem is that people like myself who sometimes forgot the…",
  "data/reddit-books/r/books/comments/pifuis/is_the_young_adult_boom_over.json": "I haven’t really kept up with the genre since the mid 2010s, so that may be the\nreason why I haven’t heard of any super popular YA books like i use to back\nthen… but usually, the books would be so popular that even if you weren’t a\nreader, you still heard about them even before they had a movie, ex:…",
  "data/reddit-books/r/books/comments/pigzrp/have_you_ever_disliked_a_book_that_everyone_loves.json": "I remember reading Magnus by Sylvie Germain at school. And I really didn't enjoy\nthat book. None of my classmates felt the same, everyone loved it. And I read\nsome reviews about it, all of them are 4 or 5 stars. It's so strange to see that\nno one shares my opinion about this book.\n\nHave you ever…",
  "data/reddit-books/r/books/comments/pii41l/just_finished_reading_the_handmaids_tale.json": "Honestly its one of the best political books I have ever read. Its based on a\nfictional future of the United States called the \"Republic of Gilead\" which\ntreats women like objects. Women have to become handmaids who are basically\nglorified mistresses for rich, old men. They are expected to produce…",
  "data/reddit-books/r/books/comments/piozeb/rant_the_problem_with_selfhelp_books.json": "Let me get straight to the point, 90% of Self-Help books are just to make the\nbook longer.\n\nI get it, the author is not going to make a 30-page book on the stuff they have\nlearned over the years but still.\n\nLike holy, some self-help I read just has so much padding and fluff that it\nmakes it hard to…",
  "data/reddit-books/r/books/comments/piz89b/possibly_the_coolest_free_reading_group_ive_ever.json": "This information is from Openculture\n[https://www.openculture.com/2021/09/100-days-of-dante-join-the-largest-divine-comedy-reading-group-in-the-world-starts-september-8.html?utm_source=feedburner&utm_medium=email&utm_campaign=Feed%3A+OpenCulture+%28Open+Culture%29]\n\nIn honor of Dante’s 700th year…",
  "data/reddit-books/r/books/comments/pizd39/the_midnight_library.json": "This might not be the best book there is but the reason why I love it is\nbecause, first, I relate with the character. Like Nora, I struggle with poor\nmaking decisions. I have opportunities in front of me but I always end up\nletting them go. I’m so caught up with my own shit that I forgot other…",
  "data/reddit-books/r/books/comments/pj0pze/just_read_1984.json": "This book was absolutely brilliant.\n\nIt is quite rare that book can be so intellectually profound and thorough that\nit can pervade every aspect of life. 1984 is a brilliant dystopian which pushes\nreaders to question the very nature of reality. The society the book depicts is\none with a totalitarian…",
  "data/reddit-books/r/books/comments/pj6sv8/do_people_usually_whine_and_complain_this_much.json": "I’d say I’m new to reading, really enjoyed the Wheel of Time series. I was very\nexcited to see it becoming a TV series. But holyyyyy the fandom finds every\nlittle thing to complain about. I understand you really enjoy the books, but to\nassume EVERY little detail in the books will be the same in the…",
  "data/reddit-books/r/books/comments/pj6wxo/the_most_disturbing_book.json": "Hi all,\n\nI recently read “Haunted” by Chuck Palahniuk. This contains a short story called\n“Guts”, which curled my toes and turned my stomach more than anything I have\never read.\n\nI felt a similar sensation in Cormac McCarthy’s “The Road”, when the protagonist\ndiscovers living victims of cannibalism…",
  "data/reddit-books/r/books/comments/pj96ca/feelings_after_finishing_neuromancer.json": "Disorienting, bleak, and thought provoking. Prophetic in some ways and outdated\nin others. If you can adjust to Gibson's vague writing style, Neuromancer is a\nfantastic book.\n\nI was always a little bit confused on what was happening. But this is a\nreflection of the world that our main character…",
  "data/reddit-books/r/books/comments/pjf3nx/24_year_journey_has_come_to_an_end.json": "In 1997 I was working in a pizza shop in my hometown. I had ran out of fantasy\nnovels to read from our local library and a coworker at the pizza shop loaned me\nThe Eye of the World, by Robert Jordan. I devoured that book. I quickly ran\nthrough all of the Wheel of Time books that were published at…",
  "data/reddit-books/r/books/comments/pjkrke/i_finally_read_eye_of_the_world.json": "Well, this turned out to be a good time to get into The Wheel of Time.\n\nAfter dipping my toe into the series, I see the hype. This was a joy to read.\nDespite having heard the series’ praises for years, it still managed to surprise\nme. The thing that surprised me most was the pacing. After having…",
  "data/reddit-books/r/books/comments/pjpc2j/do_advertisements_on_books_irritate_you.json": "Last year I purchased a copy of the complete Hercule Poirot short stories, and\nthe cover includes the line \"look for the major motion picture Death in the\nNile\". Am I wrong for thinking it's silly to advertise an upcoming movie on a\nbook cover? I also think it unnecessarily dates an otherwise…",
  "data/reddit-books/r/books/comments/pjpd92/spoilers_finally_read_my_first_ever_hemingway.json": "I can honestly say that I loved it. It was/is a brilliant book from start to\nfinish. I loved the relationship between Santiago and the young boy. Almost as\nthough Santiago was teaching his son.\n\nThe scene in which the old man went out to the sea started of exciting but it\nwas sad to read Santiago…",
  "data/reddit-books/r/books/comments/pjqh2p/watchmen_missing_the_main_point.json": "Actually there's many points and ideas the graphic novel raises but one I\nthought was pretty obvious was this; having super heroes in our world would be a\nterrible idea. The problems that arise are directly linked to the existence of\nsuper heroes, so they basically solve the problems they started.…",
  "data/reddit-books/r/books/comments/pjqnr2/i_think_the_divine_comedy_is_actually_a_funny_book.json": "I know the title of the book doesn't have anything to do with humour, but\nimagine a guy always being quite when you disrespect him, and he's actually\nthinking: \"I'm going to wait a few years and then I'm going to write one of the\nmost important books of human history and immortalize you as someone…",
  "data/reddit-books/r/books/comments/pjrx9s/im_not_a_squeamish_person_but_last_days_by_brian.json": "Seriously, after finishing this book I'm not sure why it isn't more well known.\nThe obsession and hyperfocus on amputation made this book scarier than any\nactual \"horror\" novel I've ever read. More often than not I could only read a\nfew pages before having to put it down again because it made me…",
  "data/reddit-books/r/books/comments/pjvks6/i_finally_did_it_i_just_finished_war_and_peace.json": "I can't believe I've actually done it, what a journey that was. I remember\nseeing a post on here - something along the lines of 'after the first 200 pages\nit really kicks in' - and I couldn't agree more. This time last week I was 280\npages in after 3 months of on and off reading, and I've just…",
  "data/reddit-books/r/books/comments/pjxq4y/i_am_in_love_with_braiding_sweetgrass.json": "I have never posted here so sorry in advance if I miss anything but I simply\nwanted to say, I love this book. It is historical, mythical, introspective,\npoetic, scientific, informative, well balanced, and every line is pure honey in\nmy ear. I even stopped listening to the audible version (which by…",
  "data/reddit-books/r/books/comments/pjxumx/where_the_red_fern_grows.json": "Okay, I'll start at the beginning, my husband has always talked about getting a\nRedbone Coonhound and about two years ago I found a puppy not too far away,\ngreat luck. So I'm picking up the puppy and learn the owners sister teaches at\nour school, wow, small world I think. Well, now my son has that…",
  "data/reddit-books/r/books/comments/pk8onk/read_tuesdays_with_morrie.json": "I sobbed a little. What a lovely book. As someone who is struggling from\nexistential crisis and anxiety, this book hits hard. I want to live my life too\n- like Morrie talks about.\n\nThis line is something I absolutely adore - Everyone knows they're going to die.\nBut nobody believes it. If we did, we…",
  "data/reddit-books/r/books/comments/pk9iru/do_you_think_that_the_digital_world_is.json": "Older generations often tell younger people with contempt that nowadays the\nattention span is much shorter and that's because we are looking for immediate\ngratification. But the decline in reading dates back decades ago, and the\ndigital world brought about other ways of reading such as audiobooks.…",
  "data/reddit-books/r/books/comments/pka4e7/how_do_you_read_and_most_importantly_enjoy.json": "For a while now i don't have the appetite for anything: Books, movies, walks to\nsome of my regular places, running etc. I want to do those things but i can't\nconvince myself to do them, i keep thinking \"what's the point?\" Now i start to\nlose interests even for music which is something that i love…",
  "data/reddit-books/r/books/comments/pkbrpp/what_audiobook_do_you_think_was_narrated_perfectly.json": "The book Fear and Loathing In Las Vegas by Hunter S Thompson was a great paper\nback but the audio version on audible was really dated and difficult to enjoy.\nGood Omens was really well done, and Campfire Stories by Steve Rinella was\nnarrated by the person's who lived the near death experiences…",
  "data/reddit-books/r/books/comments/pkcai6/i_just_finished_fahrenheit_451.json": "This is surely one of those books that I can give a 5-star rating.\n\nI like how this book tackles an interesting concept of censorship where all the\nbooks are burned with fire and the firemen are those who do not extinguish the\nfire but start it. Unbelievable!\n\nThe story was short and incredibly…",
  "data/reddit-books/r/books/comments/pkjici/i_keep_hearing_nonfiction_is_boring_ugh_please.json": "I'll go first.\n\nOne I loved was Big Magic by Elizabeth Gilbert. It's the most inspiring book for\ncreatives I've ever read.\n\nOne I hated was Mark Manson's \"Subtle Art of Not Giving a F#$@\". Life advice\nfrom a sheltered frat boy at a bar? Hard pass.\n\nOne that changed my life was definitely The Life…",
  "data/reddit-books/r/books/comments/pkkzb6/please_have_patience_with_barnes_noble_employees.json": "Hi all, this is a throwaway I use for fear of retaliation.\n\nBooksellers at Barnes & Noble are really suffering right now. Other than the\nusual frustrations of being booksellers in the year 2021 we have also been the\nsubject of constant abuse from customers. All we’re asking is please be patient\nwith…",
  "data/reddit-books/r/books/comments/pkpm9t/predictability_doesnt_define_the_quality_of_the.json": "I have seen people reviewing books negatively because of predictable endings. It\ndoes make sense sometimes when it's a mystery/thriller novel due to overused\ntropes, but expecting an unexpected end for every book doesn't make sense. A few\nfans were disappointed when a famous theory of the Song of…",
  "data/reddit-books/r/books/comments/pl18pv/reading_speed_is_not_important_getting_the_ideas.json": "In short: Improving your process so that you add what you learn from a book to\nwhat you already know is a far better use of your time than trying to learn how\nto finish a page more quickly.\n\nOf course you're thinking, \"Yeah, no shit, I know I'm reading to get to the\nideas, I'm not looking at ink on…",
  "data/reddit-books/r/books/comments/pl1ewb/i_just_read_metamorphosis_by_franz_kafka.json": "It's a great book. The first out of three chapters is a bit confusing\n(especially if you read it in foreign language like me) but don't get daunted by\nit, it gets better in the following two chapters. The last one is really\nemotional. I was on the edge of crying the whole time while reading it.\n\nI…",
  "data/reddit-books/r/books/comments/pl33l2/i_just_read_there_will_come_soft_rains_by_ray.json": "Someone in my previous discussion of Fahrenheit 451 suggested reading this short\nstory and having finished it, I can say that Ray Bradbury is just straight fire!\n\nWhat is with his writing style?? It was somehow a bit different to me. It was\nfast-paced and he poured in some exquisite adjectives that…",
  "data/reddit-books/r/books/comments/pl9g3v/just_a_reflection_about_the_act_of_reading_at.json": "Maybe this is an unpopular opinion (And I'm pretty sure that it's mainly valid\nfor third world countries like mine) but this whole \"read a book a week because\nleaders are readers\" is nonsense. Here are a couple loose ideas about that.\n\nWe're telling people that reading is an \"beneficial activity\"…",
  "data/reddit-books/r/books/comments/plgql2/slaughterhouse_five_is_brilliant.json": "I just finished my first of hopefully many Kurt Vonnegut books, and I honestly\ndon't understand why I didn't read this book sooner. I'm sure Slaughterhouse\nFive has been praised to all hell and I probably won't add much to the overall\nconversation, but I just wanted to give this book some…",
  "data/reddit-books/r/books/comments/pliuvp/gratitude_for_knowing_how_to_read.json": "People literally cannot learn to read unless they are taught. Kids can pick up\non spoken language and how to speak just through listening to others, and this\nis a natural process.\n\nReading, though, is an unnatural process. So is writing. The fact that we can\nread and write at all is a stunning…",
  "data/reddit-books/r/books/comments/plm8cj/theres_nothing_like_reading_when_youre_a_child.json": "I still love reading. I do, but sometimes I miss the magic of reading as a\nchild. There’s nothing else to occupy your mind, you have so much more time to\nread, to get lost in a book, your imagination is free and still being moulded. I\nused to enjoy just the feeling of holding a book and the smell of…",
  "data/reddit-books/r/books/comments/plmkwq/anyone_else_feel_that_the_more_they_learn_about.json": "Let me explain. I’m generally a thriller/mystery reader, but about a year ago I\nfell into romance reading. I was wanting to read something that read like a\nfeel-good Netflix original.\n\nI started by casually reading about one book a week and not digging too deeply\ninto the genre, just enjoying each…",
  "data/reddit-books/r/books/comments/plnxu3/just_finished_the_first_book_id_read_in_years.json": "As a kid, I used to spend hours and horus every day reading books. I got sucked\ninto them like nothing else. At night, I'd stay up way later than I should\nbecause I just couldn't stop. But as I got older and busier, I kinda... stopped.\nI'm an aspiring screenwriter, so my attention turned towards…",
  "data/reddit-books/r/books/comments/pm51mp/gone_girl_is_a_compelling_read.json": "I expected a fairly mundane book on domestic drama involving cheating, deceit,\nlies and exaggerated drama. It definitely had all that but also much more. First\nthings first, the story was good. However, Flynn's structure of telling the\ncurrent story from Nick's perspective and simultaneously adding…",
  "data/reddit-books/r/books/comments/pm5q36/as_an_adult_i_have_favorite_childrens_books_that.json": "I'm not referring to books that I grew up with or books that were read to me\nwhen I was a kid; I'm referring to children's books that I discovered as an\nadult and enjoyed.\n\nBooks for ages 3-5.\n\nI don't have kids; my point being I have no reason to be reading kid's books;\nbut I do read and love…",
  "data/reddit-books/r/books/comments/pm8nbz/a_very_proud_day.json": "My 16 yr old daughter (high-functioning autistic) just declared Animal Farm to\nbe the best book ever after finishing a recent school assignment. tears of joy\nBefore now, she has really only read small pieces of info; trivia, world\nrecords, jokes.. With little interest in chapter books. I've been a…",
  "data/reddit-books/r/books/comments/pm9ns2/should_i_feel_guilty_for_having_to_turn_to.json": "Very often, when I do not understand a certain part of the text of any work I\nread, I'm fairly quick to turn over to Sparknotes, or any other analysis blog to\nread a rather short summary of the text. Does this imply injustice to the\nauthor's writing in any manner? Should I spend more time actually…",
  "data/reddit-books/r/books/comments/pm9yoy/examples_of_overhyped_books_that_faded_into.json": "I guess this is hard a hard question to answer because: if a book has faded into\noblivion, likely no one has come in contact with it in a long time. There are\nalso plenty of books that go from the press straight to the literary graveyard,\nbut I'm not interested on those. I am talking about books…",
  "data/reddit-books/r/books/comments/pme41q/do_people_still_read_mishima.json": "I recently started reading a book by the brilliant and controversial Japanese\nauthor Yukio Mishima, and curious what, if anything, western audiences think of\nhim these days.\n\nGrowing up in Japan in the 80s, he was a name that everyone knew, but not many\npeople read. There was an intellectually…",
  "data/reddit-books/r/books/comments/pmgu10/just_finished_reading_where_the_red_fern_grows_to.json": "My mom read this to me for the first time when I was about 9 and, as you might\nimagine, I was a blubbering mess. I read it again at 18, by myself this time,\nthinking that surely it wasn't as sad as I remembered. I was shattered. Now, as\na parent myself, I just finished reading this to my daughter. I…",
  "data/reddit-books/r/books/comments/pmmqcs/the_joys_of_reading.json": "“What better occupation, really, than to spend the evening at the fireside with\na book, with the wind beating on the windows and the lamp burning\nbright...Haven't you ever happened to come across in a book some vague notion\nthat you've had, some obscure idea that returns from afar and that seems…",
  "data/reddit-books/r/books/comments/pmo5x1/youre_not_bad_at_reading.json": "I was an avid reader in my teens, but ever since adulthood happen, I find myself\nbrowsing and buying books more than reading. Years went by when, despite being a\nbook lover, I just read a couple of books a year. I wasn't sure why, but I would\npick up a book and leave it after a few chapters. My…",
  "data/reddit-books/r/books/comments/pmp73t/have_you_ever_loved_a_book_by_an_author_read_a.json": "Recently I loved, really loved, one book by an author that writes dark fairy\ntale retellings. It's one of those books I can see staying with me forever, the\nkind I'll re-read and think about in the future. I was excited to read more\nstories by her.\n\nEverything the author had done well in the first…",
  "data/reddit-books/r/books/comments/pmsnlp/reading_a_book_twice_why_do_some_people_do_it.json": "I never read a book twice, with very rare exceptions. I don't know about other\npeople. Everyone is different and has a different approach to reading. Once I've\nread a book, I know what's in it. I know the story, or, if it's a non-fiction\ntitle, I remember the most important facts. Reading a book can…",
  "data/reddit-books/r/books/comments/pmu9un/best_single_book_author_youve_read.json": "I've been thinking of authors who write one amazing book, possibly a\nmasterpiece, and aren't heard from again. I guess the most famous is Harper Lee\nand her seminal To Kill A Mockingbird. (I'll ignore the publishing of the first\ndraft scribbles found in her attic.) Or Confederacy of Dunces, a…",
  "data/reddit-books/r/books/comments/pn37s8/its_okay_if_you_dont_like_the_characters_in_older.json": "I often see this happening with The Great Gatsby, for example. People read it\nand say something like “the book has interesting themes and good prose, but I\njust don’t care about the characters and they’re not likable.”\n\nI find it kind of amusing because I doubt it ever even crossed FSF’s mind…",
  "data/reddit-books/r/books/comments/pn5029/just_reached_75_read_books_10_months_after.json": "I finally got into reading last November. My friend recommended audiobooks as a\nway to ease into reading. After listening to a few great books, I took the next\nstep and started reading physical books as well.\n\nThe first books that blew my mind were The Alchemist by Paulo Coelho , 1984 by\nOrwell and…",
  "data/reddit-books/r/books/comments/pnb3t1/did_you_ever_steal_a_book_if_so_which_book_where.json": "I mentioned my book-stealing story in a comment on r/suggestmeabook\n[/r/suggestmeabook] and it seemed to have struck a cord with a few people there,\nso I thought it might be a good topic for discussion. Here's my brief story of\nbook-thievery haha\n\nI was on the newspaper club in high school, first…",
  "data/reddit-books/r/books/comments/pneog4/whats_the_longest_break_youve_taken_from_a_book.json": "I have a habit of not finishing books, not because I don't like them, but\nbecause I'll start reading another book for whatever reason (thank you easily\ndistracted brain). I usually come back and finish though but I don't often start\ncompletely over. I recently jumped back into a book I thought I had…",
  "data/reddit-books/r/books/comments/pnh5gh/unpopular_opionion_neil_gaiman_adaptations_are.json": "I love adaptations of neil gaimans works? Amerigan gods, Good omens, stardust.\nHowever i cannot stand his books they just drag on and on and on. Neverwhere is\none of the most boring book ive ever read and i gave up on american gods when it\nwas just chapter after chapter of him in lakeside with…",
  "data/reddit-books/r/books/comments/pnogvl/how_did_hari_seldon_know_his_psychohistory_worked.json": "So.....psychohistory predicts future of humanity on the large scale through\nstatistics and math, it is a form of science. I believe it is stated in the\nbooks that acts of individuals essentially cancelled out and therefore didn't\nreally matter in Seldon's predictions (ergo. why the Mule's reign…",
  "data/reddit-books/r/books/comments/pnrv7n/turns_out_i_actually_like_reading.json": "About a month ago I bought a Kobo on a whim, for no reason other than I thought\nthat maybe reading a book here or there would be a more productive use of my\ntime than gaming or surfing youtube/netflix. I haven't read an actual book in\nyears, not since high school, so I wasn't expecting much from…",
  "data/reddit-books/r/books/comments/pns7uj/reading_ulysses_for_a_class_and_feeling.json": "I'm a college student reading Ulysses for the first time for a college class. I\nhave always loved literature, even -- especially -- \"difficult\" literature but\nthis book, and this class, has me really doubting my ability as a reader and\nstudent. I guess that's good for me. I've just never felt this…",
  "data/reddit-books/r/books/comments/pnzopm/can_someone_explain_to_me_the_general_criticism.json": "I've read the book multiple times and, while it doesn't stand out to me as\nanything exceptionally masterful or brilliant, overall it doesn't seem like a\nbad book.\n\nHowever, it seems to be a running joke/theme in multiple pieces of media (The\nGood Place is one that comes to mind) that this book in…",
  "data/reddit-books/r/books/comments/po28zp/looking_forward_to_the_wheel_of_time_adaptation.json": "WHEEL OF TIME is tricky for me\n\nThere's so much to like about it. Sure you got trite cliches like a chosen one\nand a dark evil entombed but rising up. But then you also get great goodies like\nthe despicable wild card Padan Fain or the Seanchan randomly showing up to\nenslave everyone.\n\nI think it's…",
  "data/reddit-books/r/books/comments/pocfdj/gödel_escher_bach_was_an_absolute_masterpiece.json": "This book was essentially about how consciousness arises using the works the of\nKurt Gödel the mathematician, MC Escher the artist and Johann Sebastian Bach the\ncomposer/musician. The book is a bit dense and there’s parts that are a little\nmath heavy but there’s so many concepts to explore all…",
  "data/reddit-books/r/books/comments/poeeqs/as_readers_do_you_ever_think_about_writing_your.json": "I’m wondering whether anyone else occasionally ponders about writing their own\nbook. Personally, I have always envisioned myself writing about about the events\nthat occurred in my life (call it narcissism but I seriously think it has\npotential to be really good “fiction”).\n\nAnyway, I always envision…",
  "data/reddit-books/r/books/comments/pofjy9/i_visited_a_library_today_and_it_made_me_so_happy.json": "I think you guys already know that, but... libraries are awesome. I'm usually\nusing Libby for books/audiobooks, but today I went to a library in person and it\nmade me so happy. I'm trying to learn how to play a music instrument, so I\nwanted a beginner book and some beginner friendly music sheets…",
  "data/reddit-books/r/books/comments/poiyzg/im_32_years_old_havent_read_a_single_book_in_over.json": "When I was a kid I adored reading. I read all the time. I was the first kid in\nmy kindergarten class who knew how to read. In the 8th grade I gave up on\nreading, and I'm not sure why. The last book I read was either Fahrenheit 451 or\nFlowers for Algernon. Both great works. Since then I haven't read…",
  "data/reddit-books/r/books/comments/poqfmv/project_hail_mary_is_a_must_read_for_science.json": "I finished this last night, and whew, what an odyssey this book is.\n\nAndy Weir's writing style is actually perfectly suited for this kind of\nstorytelling - the stakes are high (like, existentially high), but it never gets\noverbearingly foreboding or oppressive, and the light and breezy way with…",
  "data/reddit-books/r/books/comments/pos0b9/whats_your_favorite_literary_insult.json": "I was reading Proust last night and stumbled across this one:\n\n“You are a formless water that will trickle down any slope that offers itself, a\nfish devoid of memory, incapable of thought, which all its life long in the\naquarium will continue to dash itself a hundred times a day against a…",
  "data/reddit-books/r/books/comments/povtz7/v_for_vendetta_as_relevant_as_ever.json": "After reading watchmen I decided to read this graphic novel despite only finding\nthe movie version ok. I understand why Alan Moore hates his work adapted on the\nbig screen because this story is full of depth. The domestic terrorist known as\ncode name V crusade against a Authoritarian government,…",
  "data/reddit-books/r/books/comments/pozvmn/what_sort_of_literary_or_publishing_trends_are.json": "I'm pretty bored of books with titles like: \"The Boy of This\", \"The Daughter of\nThat\", \"The Sisters Who...\", \"The Father That...\".\n\nLooking at upcoming releases, it seems the trend will only continue into 2022.\nWhat publishing or marketing trends have you noticed that, if ended today, would\nbring…",
  "data/reddit-books/r/books/comments/pp4o2l/whats_a_book_you_thought_was_going_to_be_a_fun.json": "To give an example last month at my Grandma's I read a children's book called\n\"The Silver Arrow\" about two siblings Kate and Tom who end up getting a train\nfrom their uncle and go on a fantastical adventure.\n\nSince I love trains and I share a name with one of the leads I decided to give\nthe book a…",
  "data/reddit-books/r/books/comments/pp5hz8/is_there_a_book_you_enjoyed_but_probably_wouldnt.json": "I just finished The Magic Mountain by Thomas Mann and I would put it squarely in\nthat category. It's a long read. German, French, and Latin is peppered in\nindiscriminately. The flow is difficult to adjust to -- shifting from classic\nliterary prose to dense philosophical debate. Theres a good 250+…",
  "data/reddit-books/r/books/comments/pp9npr/screens_and_distractions_are_killing_my_reading.json": "This will probably get wiped by the mods but I wanted to share my experience\nwith fellow readers.\n\nOver the past 6 or so months I've noticed a steady decline in my reading speed\nand general interest in the books I'm reading. I chalked it down to life\nbecoming more stressful through starting a new…",
  "data/reddit-books/r/books/comments/ppbncn/love_in_the_time_of_cholera_and_the_musicality_of.json": "I'm not sure why I put off reading this book for so long. I loved 100 Years of\nSolitude and wanted more by Márquez, and yet I resisted reading this other\ndeservedly famous work. Partly, because I foolishly dismissed it as a silly\nromance, and partly because a friend described it as 'pointless and…",
  "data/reddit-books/r/books/comments/ppc00e/who_is_the_target_audience_of_catcher_in_the_rye.json": "Today was the second day of my AP Lang class (I’m a junior in hs) and my teacher\nwas explaining primary and secondary audiences. He started off with an example,\nasking us if The Catcher in the Rye was written for us. Everyone shook their\nhead, but I raised my hand to disagree. When he called on me,…",
  "data/reddit-books/r/books/comments/ppda3h/finished_my_first_ever_novel_that_wasnt_an.json": "Just finished a novel for the first time on my own accord. I read the first\nnovel of the Song of Ice and Fire series, Game of Thrones.\n\nI really enjoyed it despite how long it took me to read and I've already started\nthe second and I'm already a quarter through.\n\nJust wanted to share and say that…",
  "data/reddit-books/r/books/comments/ppdfp0/people_who_scribble_on_books_why.json": "I hate it when people scribble on books. In my opinion it's the second worst\nthing that could happen to a book, first being the book not being read.\n\nI especially hate it when it happens to my books. I recently lent my favourite\nbook to a friend. This book was first published in 1940s and belonged…",
  "data/reddit-books/r/books/comments/ppdrky/currently_reading_don_quixote_and_i_cant_get.json": "I kept noticing Don Quixote being referred as \"the guy who fought the windmills\"\nway too many times, but never really thought about giving it a try until\nrecently, a friend of mine recommended it to me. And honestly, it keeps exceeded\nmy expectations.\n\nI was dubious about reading it because bulky…",
  "data/reddit-books/r/books/comments/ppemja/last_book_you_gave_one_star.json": "Mine was Caught Dead Handed by Carol Perry, which I thought was going to be a\nlighthearted mystery novel (which it kind of was) but had a really predictable\ntwist that was a little...problematic for something that only came out in 2014.\nSucks because I usually wont give a book one star and I try to…",
  "data/reddit-books/r/books/comments/ppg7q3/should_i_sell_my_books_when_i_know_deep_inside.json": "I’ve been reading for about 6 years now. I have acquired quite a collection of\nyoung adult novels, mostly romance because I am a 20 year old girl, duh. To call\nit my favorite genre would be false—in retrospect, I think I was just scared of\nexploring new genres as a preteen, so romance became my go…",
  "data/reddit-books/r/books/comments/pphc3s/a_letter_of_appreciation_to_jorge_luis_borges.json": "I don’t know if this post will be suitable for this subreddit but lately I’ve\nbeen wanting to express my love for the short stories of Borges.\n\nI discovered my passion for reading a little late in my life, maybe 5 years ago.\nSince then I’ve read many books and I believe that I have solidified my…",
  "data/reddit-books/r/books/comments/ppi7ey/east_of_eden.json": "I know, what a shocker, I loved a classic. A classic written by a legend of the\ncraft. That being said: I fucking loved this book. I needed to make a post to\nshout into the void about.\n\nAs it is a rather long book spanning multiple generations, I can’t and won’t go\ninto everything I loved about. I…",
  "data/reddit-books/r/books/comments/ppnpzd/the_brothers_karamazov_oh_dear_god_this_is.json": "I happened to be gifted a small travel copy of the brother's Karamazov a while\nback and have been slowly working through it. I'm now on page 500 only to\nrealize: \"Wait, this is the abridged edition?! How long was the original?! Note\nthat this version is still about 730 pages long (Barnes and Nobel…",
  "data/reddit-books/r/books/comments/pppd0h/the_three_musketeers_and_the_nonidealization_of.json": "I love the three Musketeers and I liked that Alexandre Dumas avoided the\nidealization of the characters. In romanticism there was the pure and good\nheroe.\n\nI liked that Dumas prevented us from having a pure hero and no moral defects. If\nyou go to the History books, we'll see abuse and cruelty.e And…",
  "data/reddit-books/r/books/comments/ppq0b4/what_book_should_be_boring_but_isnt.json": "For me, it's The Queen's Gambit which I just finished. The book is done in a\nthird perspective and has quite some descriptions about each chess games.\nThere's not much 'hot romance' or huge disputes. I feel it's easy to write it as\nboring, but due to the author's brilliant writing, it isn't.\n\nWhat…",
  "data/reddit-books/r/books/comments/pq02ra/what_are_the_classic_books_from_your_countries.json": "I just joined this community and I'm not sure which country you are from, but\nI'm curious: which books MUST be read by someone from that country? For example,\nI'm from Brazil and here Machado de Assis' books are classics and an assiduous\nreader will surely read more than one of his works. Who would…",
  "data/reddit-books/r/books/comments/pq0iuo/i_dont_think_slaughterhouse_five_can_in_any_way.json": "So I just reread it and I think it is a very fucked up novel, not that I didn't\nalready know that.\n\nI'll start by saying I am in no way married to my interpretation of the novel. I\nmay very well be wrong.\n\nI also really hope this makes sense, but if you read the novel you know the\nwhole premise is…",
  "data/reddit-books/r/books/comments/pq1a4m/flowers_for_algernon_as_a_research_scientist.json": "I first read this book when I was in my teenage years. Though I understood the\nmain plot points and the aim of the author, I didn't really know the\nimplications of the situation of Algernon.\n\nNow, I am a research scientist and I work extensively with mice. I re-read\nflowers for Algernon after what…",
  "data/reddit-books/r/books/comments/pq1tms/in_foreign_books_and_stories_do_you_prefer_the.json": "I was thinking about this recently, there are a lot of names in Portuguese and\nSpanish that have equivalents in English. Like, João is just Portuguese for\nJohn; Lucas is Luke, Guilherme is William, José is Joseph, etc.\n\nIn a book, do you prefer these kinds of names translated or left in…",
  "data/reddit-books/r/books/comments/pq95gy/why_twilight_wasis_so_popular.json": "I used to love, love, love Twilight, the books and the movies but now looking\nback at that time is just so embarassing. I have read a lot more books, watched\nmore shows and anime and for the longest time it was absurd to me why Twilight\nwas so popular and why I liked it so much, but now I have come…",
  "data/reddit-books/r/books/comments/pq9jey/books_and_dryer_sheets_may_they_never_meet.json": "Fellow Bibliophiles,\n\nLast week, I purchased an art book from a third party seller on Amazon. The\nbook's condition was listed as: \"Condition: Used - Good\"\n\nWhen the book arrived, I found that the seller, or previous owner, had stuffed\nthree dryer sheets in between the pages close to the middle of…",
  "data/reddit-books/r/books/comments/pqk4dj/i_am_two_pages_away_from_finishing_the_end_of.json": "No spoilers here, but it has been awhile since a story stuck with me like this.\nMade me think about it, wonder what would happen, how, etc. And now, at the end,\nI am in my edge. Don't want to finish, but I will and will update you guys.\n\nIdk if this is the best introduction to Asimov's work, but I…",
  "data/reddit-books/r/books/comments/pqkipa/anyone_read_classic_literature_and_think_man_this.json": "I don’t mean in terms of syntax of course. Having just finished Flatland I was\nblown away by how self aware the author was and even the narrative structure of\nit as it approached the end. It felt strangely anachronistic as though it were\nwritten recently. I’m not sure if I’m conveying this…",
  "data/reddit-books/r/books/comments/pqm0td/enders_game_is_one_of_the_best_books_ive_ever.json": "I finished Ender's Game last week, and what a brilliant book it is. It was\nsitting on my shelf for 2 years because I ordered it online and lost all\ninterest in reading it after reading the back cover summary \"a 6-year-old trying\nto save the world from bugs\" made me think it's a book for 6yo.\n\nBut I…",
  "data/reddit-books/r/books/comments/pqxtro/can_publishers_stop_pulling_normal_prints_in.json": "I absolutely freaking HATE books that have a shitty little circle on it that\nsays \"Soon to be a Netflix Original\" or \"Soon to be a series on Amazon Prime\".\nIt's infuriating to be forced into buying a book with a non-removable\nadvertisement because of promotions because they pulled the other versions…",
  "data/reddit-books/r/books/comments/pqyp1o/what_book_titles_do_you_think_would_make_good.json": "I’ve got a few:\n\nGravity’s Rainbow is a pop group based purely off the name. Something fun and\ncatchy.\n\nInfinite Jest is a group that plays big ensemble-like songs, similar to Car Seat\nHeadrest\n\nJohnny Got His Gun is the hardest punk band in Cali rn\n\nBlood Meridian is metal, like a more poetic…",
  "data/reddit-books/r/books/comments/prbx4a/i_just_read_niccolo_machiavellis_infamous_the.json": "As with many people, I'd often flippantly use the term 'machiavellian' as a\neuphemism for using immoral methods to get what you want.\n\nBut nursing a hangover today I found myself in a bookshop where I saw a copy on\nthe shelf. At under a hundred pages, I hadn't realised how short a book it was.\nSo…",
  "data/reddit-books/r/books/comments/priqis/just_finished_shogun_wow.json": "I read this because it was recommended here on r/books [/r/books]. I haven’t\nbeen so ambivalent on recommending a book before. It was long, it was also a\ngreat story and really tied in to the last book I read, The Count of Monte\nCristo. If you read them in that order I think it will give you a…",
  "data/reddit-books/r/books/comments/prlynz/has_anyone_else_experienced_brain_fog_on_resuming.json": "I've read more the last month than I had the previous decade, and I'm enjoying\nit, but my brain is like mush. Sometimes I manage fewer than 30 pages an hour.\nI'll get hung up on a sentence and reread it several times. Sometimes with the\naddition of a new detail I'll realize I don't quite have the…",
  "data/reddit-books/r/books/comments/prn1n5/finished_lotr_for_the_first_time_wow_silmarillion.json": "Hey everyone, today I finished the beautiful masterpiece of LOTR. I never\nwatched the movies so everything was experienced for the very first time. God,\nit was quite an adventure and I laughed, cried, thought about the story every\nmoment of everyday even when I wasn’t reading it. It is now a…",
  "data/reddit-books/r/books/comments/prn9pp/read_frankenstein_for_the_first_time_and_wow.json": "My self yearns to embark on an undertaking to draft a whole essay on the jewel\nthis book turned out to be but the limited time and skills as such has been\nendowed to me keeps me away from this noble pursuit. Instead, I will at every\npossible opportunity, make people conscious of their reading list…",
  "data/reddit-books/r/books/comments/pror2b/whats_a_quote_from_a_book_that_made_your_heart.json": "for me it was in this book My Dark Vanessa by Kate Elizabeth Russell. its where\n(tw; underage, gross old man young girl) you get the pov (past and present) of a\ngirl, Vanessa, who has a relationship with her teacher. the the girl was a young\nage the teacher, Mr.Strane, was infatuated with her but…",
  "data/reddit-books/r/books/comments/prrbk1/haruki_murakami_im_done_trying.json": "I can see why Murakami is beloved by so many. His writing is dreamlike and\nprecises. The atmosphere of his book draws me in, and I’d love to read more – if\nthere wasn’t strange depiction of women.\n\nAfter a failed attempt to finish “Kafka at the Shore”, I wanted to give Murakami\na second chance and…",
  "data/reddit-books/r/books/comments/prrnkz/what_is_your_favourite_opening_from_a_book.json": "I just finished A Tale of Two Cities and started The Call of Chtulhu. I was\nblown away by both opening passages. Dickens managed to really make me consider\nhow we are living in a period of extreme change but it's hard to consider it or\nit's effects while you're in it. Lovecraft just blew me away…",
  "data/reddit-books/r/books/comments/pru4ws/the_types_of_posts_you_see_on_rbooks.json": " * I read a book again! It's been 84 years.\n * How do you feel when your favorite author dies? Are you sad?\n * Is it just me or is this super famous author just like, NOT good?\n * How fast do you read? Should I read faster?\n * I finally read this classic, which has about 700,000 resources online,…",
  "data/reddit-books/r/books/comments/prvhrk/good_books_by_famous_authors_that_are.json": "I just read The Mysterious Stranger by Mark Twain, and am now reading Letters\nFrom the Earth. Though, those tittles are never really talked about as soon as\nMark Twain is brought up, which is fine, his other books are very good. And I\ngot to thinking if there are any other books by famous authors…",
  "data/reddit-books/r/books/comments/ps7idt/the_more_you_read_the_better_the_books_get.json": "I am currently reading “Project Hail Mary” by Andy Weir and listening to “A\nShort History of Nearly Everything” by Bill Bryson.\n\nThe main character in Hail Mary is doing some experiments with microscopic\nparticles and says:\n\n> Anyway, even gamma couldn’t penetrate the little bastards. Which is…",
  "data/reddit-books/r/books/comments/psk5al/some_fans_are_horrible_or_a_story_i_want_to_share.json": "This came up when I was talking to an old friend recently.\n\nSo, in the early aughts, one of my college buddies introduced me to The Sword of\nTruth series by Terry Goodkind. I was just wrapping up the available Wheel of\nTime books and wanted another big fantasy series. I checked out the first…",
  "data/reddit-books/r/books/comments/pskdsb/what_was_the_worst_book_youve_ever_read.json": "For me it was The House Next Door by Anne Rivers Siddons. I picked it up last\nyear around October because I wanted to read something spooky, and it was the\nexact opposite. The writing was dull, boring, and the supposedly haunted house\ndidn't even do anything scary. Oh, I forgot - it made two guys…",
  "data/reddit-books/r/books/comments/psu005/how_do_people_read_so_fast.json": "I know I'm in the minority for reading slow but I just can't read fast even\nthough I'm trying. I just don't find enjoyment reading fast because I can't\npicture the scene in my head right or get the faces and expressions right in my\nhead. I want to see everything and get the details. - though I hear…",
  "data/reddit-books/r/books/comments/pt68z1/do_you_have_any_seasonal_books_that_you_read.json": "Every year sometime in late September through November I will read “The\nHistorian” by Elizabeth Kostova. I think I’ve read this book 10 times or more.\nThere is just something about the tone of the book that screams Fall to me. I\ncan’t help but read it and bask in the idea of traveling and eating…",
  "data/reddit-books/r/books/comments/ptlpak/please_dont_gatekeep_how_multiracial_poc_are.json": "I've been seeing some comments on novels complaining how this or that character\ndoesn't present enough as a member of X race. And while I do think some\ncriticisms are valid, such as clear moments when authors that are not of that\nrace didn't do their research, it's very frustrating when someone…",
  "data/reddit-books/r/books/comments/ptnii3/i_think_i_liked_foundation_but_i_dont_think_i.json": "So I just got done reading Foundation for the first time and while I loved the\npremise and enjoyed the overall plot, I found getting to the end to be a bit of\na dull experience. Mainly due to the way Asimov seems to write (at least in this\nbook, it's the only thing of his I've read). The characters…",
  "data/reddit-books/r/books/comments/ptpzvr/do_you_guys_listen_to_audiobooks_whywhy_not.json": "Over the pandemic I really started getting into audiobooks - now I can’t imagine\nnot listening to them and the amount I read has quadrupled.\n\nI’m wondering as a community of readers how do people feel about them? Do you\nenjoy them?\n\nIf you don’t listen, why is that? Is it the audiobooks themselves,…",
  "data/reddit-books/r/books/comments/ptr18u/heres_a_rare_joy_tomorrow_i_get_to_help_a_12th.json": "I run the D&D club at the school where I teach English, and one of my favorite\nplayers came to me today at lunch, and confessed that when his teacher took him\nto the library, he had no idea how to find a book, because he has never read\none.\n\nSure, when he was small he read Dr. Seuss, but he has…",
  "data/reddit-books/r/books/comments/ptr617/roald_dahl_is_stephen_king_for_kids.json": "My kids are finally of an age where all three of them are excited for me to read\nthem a bedtime story. So for the past while I've been reading them the stories I\nloved as a child. We've gone through Enid Blyton's Book of Brownies and the\nMagic Faraway Tree compilation, which they loved and were…",
  "data/reddit-books/r/books/comments/ptt421/100_years_of_solitude.json": "It didn't take too long to realise that this novel was different. The magical\nrealist elements at first catch you off guard, making you doubt if you read the\nline correctly; but later on they begin to make total sense, and are something\nthat you look forward to, giving the novel its distinct tone. I…",
  "data/reddit-books/r/books/comments/ptwlq0/do_you_love_libraries_and_if_so_do_you_support.json": "So I love libraries and have always had a library card, but many people I talk\nto who love books do not own a library card and do not borrow books. Why not?\n\nPersonally, it allows me to read so many more books than I otherwise could,\nbecause books are expensive and I tend to read a book a week. Even…",
  "data/reddit-books/r/books/comments/pu126k/reading_for_an_hour_a_day.json": "I love reading but making time for it is sometimes an issue. After finally\nfinishing a book I'd been stuck on for six months,I decided that from now on I\nwould read for an hour a day. My system is basically read for a minimum of an\nhour a day and anything over an hour doesn't roll over to the next…",
  "data/reddit-books/r/books/comments/pualax/my_basement_flooded_and_i_lost_almost_every_book.json": "Wife and I moved into our house recently and I foolishly put all of our\npossessions into the basement so that we could unpack one box at a time to avoid\nan overwhelming mess.\n\nWell, life gets busy and sometimes boxes find a way to not get unpacked.\n\nBasement flooded yesterday and of course every box…",
  "data/reddit-books/r/books/comments/puc40b/the_stainless_steel_rat_series_by_harry_harrison.json": "Its been a good 15 years since i read them, a sci fi fan friend was asking for\nreccomendations and i told him to give it a shot. I think every book is sub 150\npages and because its about a master criminal told in the first person they are\nnearly impossible to put down. You can smash one in 2 days…",
  "data/reddit-books/r/books/comments/puhpgs/what_would_you_consider_the_most_overlooked_title.json": "I believe The Silmarilion by JRR Tolkien / Christopher Tolkien does not even\ncome within a whisker of being recognised for what it is. Christopher Tolkien\ndid a great job piecing together his fathers notes. The lore and scale of the\nstory telling is fantastic and in my mind makes the Lord of the…",
  "data/reddit-books/r/books/comments/pv0qoh/reading_lord_of_the_rings_for_the_first_time.json": "The movies have been a staple of my childhood and recently, I went of a 3 day\nhike with some friends and brought along the fellowship of the ring just for\ngiggles. After reading the intro part and a few chapters after that, it really\ncaught my interest. It's so beautifully written!! For most of my…",
  "data/reddit-books/r/books/comments/pv2n7l/something_i_really_like_about_secondhand_books.json": "I pick up secondhand books from a local store for cheap all the time and\noccasionally I'll find out they belonged to people who aren't from the same\ncountry, or even the same continent.\n\nI picked up The Robber Bride by Margaret Atwood yesterday. The first page has\n\"9th March 1998, Auckland\" in red…",
  "data/reddit-books/r/books/comments/pv45hv/since_my_english_degree_ive_struggled_to_read.json": "Fifteen years ago (!) I did an English Literature degree. I read copiously and\nhabitually. I read prose, poetry, drama, Middle English, Ancient Greek and threw\na bit of art history into the mix too.\n\nSometimes I felt uneasy about the pressure of my course. I tried reaching out to\nfriends at other…",
  "data/reddit-books/r/books/comments/pv81c7/easy_to_see_the_reason_why_amazon_is_winning.json": "I just want to start out by saying that I am not endorsing Amazon or suggesting\nyou not use your local independent book shops but these are just my\nobservations.\n\nSo I am buying quite a few books from a certain book series and spending a\ndecent amount. Thought I'd use an independent book shop so…",
  "data/reddit-books/r/books/comments/pvmytl/just_got_back_into_reading_after_a_five_year.json": "My to-read list is also 47 books long already. I think reading has really helped\nmy mental health. I also started creative writing for the fun of it too. I wish\nI had started years ago.\n\nSide note: someone told me today that Stephen King's It the book was bad because\nIt the movie was bad. But she…",
  "data/reddit-books/r/books/comments/pvqnk9/why_cant_i_comprehend_any_book_i_read.json": "When I am reading a book, I find that I have to go over the text several times\nto understand what the text is saying, but even then it still isn't clear what\nis being mentioned in the book. I am generally considered a smart person,\nhowever I have always had issues with reading comprehension. It is…",
  "data/reddit-books/r/books/comments/pvvdgp/thank_you_for_the_endless_posts_about_the_song_of.json": "I’ve seen this book mentioned and discussed on this subreddit countless times\nover the last 2 years since I’ve joined and finally got a chance to read it.\nBased on the acclaim it received, I had high hopes it was going to be remarkable\nand for the last year I was hoping to find it organically either…",
  "data/reddit-books/r/books/comments/pvy9ib/what_is_the_one_thing_that_will_get_you_to_dnf_a.json": "For me, it's the writing style. I can look past sort of dull or just plain evil\ncharacters, plots with enough holes to use as a fishnet, and lazy dialogue and\ninteractions. Sex scenes irritate me, but never enough to make me stop reading.\nBut if the writing style doesn't click with me, I DNF that…",
  "data/reddit-books/r/books/comments/pw1hr2/reading_agatha_christie.json": "Hi, I'm Aleks. This summer I read \"And then there were none\" by Agatha Christie.\nIt really captivated me, the writing was great and easy to follow. Some mystery\nbooks are really confusing and once you finish them you don't really understand\nhow the author solved the mystery without revisiting…",
  "data/reddit-books/r/books/comments/pw8wdz/reading_wuthering_heights_compelled_me_to_jump.json": "Am I the only one who does not see this book as the insufferable 500+ pages long\nsnooping around and piece of gossip it is???!!! Don't get me wrong I love the\nClassics, and especially the Bronte sister's works. Emily Bronte has outshined a\nlot of her sister's works with her writing style.\n\nBut it is…",
  "data/reddit-books/r/books/comments/pwc8wb/are_jane_austen_books_really_worth_it.json": "Now, I've never noticed this but I was browsing my library and most of the books\nI own are either high fantasy, hard scifi, heavy non-fictions and philosophies,\n600+ pages of Dostoyevsky and Tolstoy books. I can't believe I never got\nanything to just unwind and relax. So will Jane Austen books do…",
  "data/reddit-books/r/books/comments/pwg4rr/the_best_books_he_perceived_are_those_that_tell.json": "Fair warning before we start (since so many people have a problem with this\npost?): This is my first ever post on this site.\n\nIn my opinion, the above quote perfectly summarises why 1984 is a classic. The\nbook is a perfect blend between caricature and reality. When you start this book\nyou think to…",
  "data/reddit-books/r/books/comments/pwg7iv/libby_library_cards.json": "I live in Southeast Asia and so desperately want to use Libby but my local\nlibrary offers a small catalog and a lot of libraries abroad have more books I’m\ninterested in reading. Is there a way I can use a free out of country library\ncard? (im broke and still a student) Can I use someone else’s…",
  "data/reddit-books/r/books/comments/pwiwsq/im_m_l_rio_author_of_if_we_were_villains_and_five.json": "I’m an author and actor-turned-academic. I wrote a novel in college, somehow\nsold it, then moved to England to get a master’s degree in Shakespeare at King’s\nCollege London and the Globe. Now I’m back in the States, IWWV has been\npublished in seven languages, and is coming out in a special hardback…",
  "data/reddit-books/r/books/comments/pwnjkp/buyer_beware_amazon_is_shipping_books_in_paper.json": "I waited a week for this boxed set to arrive, only to find Amazon sent it in a\npaper bag with no packing so it got beat up in transit.\n\nhttps://i.imgur.com/6tuARNK.jpeg\n\nAll 8 corners of the boxed set are damaged along with the corners of the two\noutside books. I already have a return & replacement…",
  "data/reddit-books/r/books/comments/pwpcbl/is_it_okay_to_give_an_infant_a_book_as_a_gift.json": "I did not really grow up around babies, my family was pretty small. But now my\nsib-in-laws by marriage have a new baby girl and despite living far away from\nthem I want to be the cool aunt that sends books. Is it annoying as a parent to\nget a book as a gift when your child can't read? It's a picture…",
  "data/reddit-books/r/books/comments/pwv51a/the_gatekeeping_around_books_is_so_flipping.json": "We've all seen it.\n\n\"If you haven't read (insert any book, usually a classic (or even an author))\nyou're not a real book fan!\"\n\n\"If you read (insert genre, usually YA or romance), you're not a real fan of\nbooks)!\"\n\n\"(Insert genre, again usually YA or romance) is BAD and if you read it, you're\nnot a…",
  "data/reddit-books/r/books/comments/pww6nz/i_wanna_thank_translator_for_their_hard_work.json": "Being from a country with little to no published books in my native language it\nmakes me happy with translators that are clearly in love with the original book\nthey are working on, specially because I mostly read in english for the ease of\naccess of material. Sometimes it even adds up quality to the…",
  "data/reddit-books/r/books/comments/px1prp/book_really_does_feels_like_a_friend_sometimes.json": "I've been lonely most of my life, and books have been my refuge, more than I can\nimagine it would be. I don't know how, even though the books I'm reading doesn't\noffer the same story, or even similar story to my personal baggage, I felt\ncloseness to its characters. It's like hearing a friend talked…",
  "data/reddit-books/r/books/comments/px2k7s/philippa_gregory_is_neither_feminist_historian_or.json": "--even though she likes to call herself all three. Honestly, all I got from her\nbooks was that women hate each other, women are motivated almost solely by\npassionate romance, and women are either bitchy shrews or epitomes of virginal\ngoodness (the latter being a construct right out of medieval…",
  "data/reddit-books/r/books/comments/px5qhw/got_my_hands_on_a_grosset_dunlap_oliver_twist.json": "Recently, I bought a secondhand Oliver Twist published by Grosset & Dunlap\nbecause I liked the hardcover design. I thought I scored a beautiful special\nedition when I saw the written name of the presumed first owner with the date\n1928. Then turning the pages, I saw the frontispiece with a photograph…",
  "data/reddit-books/r/books/comments/px68wi/how_do_you_feel_about_books_that_purposefully.json": "I'm not talking about mystery books, where a detective tries to solve a case and\ngather information.\n\nI'm talking about books where the driving action kicks off with an issue that\nwas known by the characters from the start, but which are only revealed to the\nreaders at the end, usually at the…",
  "data/reddit-books/r/books/comments/px7mue/am_i_misunderstanding_the_stranger_by_albert_camus.json": "I was left feeling confused after reading the book. Meursault is a character\nthat embodies absurdist ideals, and is Camus' mouthpiece for many of his\nphilosophical beliefs. However, am I supposed to therefore pardon him and feel\npity for him in spite of his immoral crimes? Does morality not hold any…",
  "data/reddit-books/r/books/comments/pxba0o/medicinal_value_of_reading.json": "I have always been a voracious reader. When I deployed overseas I had a half\ndozen books in the bottom of my duffel bag, and came back with the entire bottom\nof my foot locker full…lol. After I was injured on the job, though, reading\nbecame more than just a fun and relaxing pastime. Reading took on…",
  "data/reddit-books/r/books/comments/pxbpf1/what_would_your_pastchildhood_self_think_of_your.json": "I was thinking about how my taste in books has changed ever since I started\nenjoying them.\n\nMy 10-year-old self would be flabbergasted to know that, at age 26, I am\nvoluntarily reading and enjoying many of my choices today. At that age I thought\nonly boring old geezers read Classics, and Non-Fiction…",
  "data/reddit-books/r/books/comments/pxin5v/why_are_so_many_fantasy_books_a_series_rather.json": "One fun fact of Trivia that I learned from Lord of the rings that it was written\nas a single 1000 page book but because of World War II and a shortage of paper\nwas split into 3 volumes thus becoming the trilogy we know today. That got me\nthinking about how many fantasy books i read that are book one…",
  "data/reddit-books/r/books/comments/pxnfwn/the_next_terry_pratchett.json": "I know in my heart there cannot be another Terry Pratchett. There are, and will\nbe, greats and perhaps, in the fullness of time, maybe even greaters but there\ncan never be another Pratchett. Every time I pick up a Discworld book I feel a\npang knowing there will not be any more \"first times\".\n\nDrew…",
  "data/reddit-books/r/books/comments/pxrrau/how_many_books_do_you_own_that_you_havent_read_yet.json": "I have seen a post on Instagram of a friend, and wondered about it: how many\nbooks do you own that you havent yet read through?\n\nThe post said she had 80-something (!) books on her shelves that are waiting to\nbe read, which got me thinking. I currently have 8 that i havent read, but most\nof those…",
  "data/reddit-books/r/books/comments/pxxy4a/anyone_else_with_amazon_kindle_lost_rights_to.json": "The short story is Dear Amazon Kindle users be wary. Your electronic rights are\nonly five years and after that you have no right of access to THEIR books.\n\nThe long story and a rabbit hole of frustration for you fine peeps will be an\nimage in the comments I received when I tried to open my books…",
  "data/reddit-books/r/books/comments/py0ggr/misery_by_stephen_king.json": "I just finished reading Misery. This was the first time I read a horror book and\nthe first book I ever read by Stephen King. And I absolutely loved it. It is so\nwell-written and even through there are just two characters and the story takes\nplace in one location, something interesting is always…",
  "data/reddit-books/r/books/comments/py0pxf/freakonomics_hate_mail.json": "I used to love the podcast when I was younger, so I finally picked up a copy of\nthe book. I read a few chapters and was surprised to realize I could not stand\nit! The authors come across to me as cocky, wannabe rock stars who think they\ncan convince you there's a black and white easy answer to all…",
  "data/reddit-books/r/books/comments/py1hc0/whats_the_point_of_a_personal_library.json": "I don't mean to be insincere with the question; it's a legitimate one.\n\nI have a large personal library I'm quite proud of, but my girlfriend has been\nurging me to sell it off because I don't need all those books. And the more I\nthought about it, I realized I didn't have a response to that. There's…",
  "data/reddit-books/r/books/comments/py3swg/i_just_finished_project_hail_mary_by_andy_weir.json": "If this book is on any of your reading lists I would highly encourage you not to\nlisten to any reviews or even read the books own blurb before beginning as it\nreally helped enhance the mystery of the story. I feel too many books give too\nmuch away these days in order to hook their viewers.\n\nFor…",
  "data/reddit-books/r/books/comments/pyflvz/the_morality_of_pirating_books.json": "Hey, teenager (17) living in Lebanon, that is going through one of the worst\neconomic crisis in recent history.\n\nI grew up reading everyday. At home, we have bookshelves in almost every room,\nall full with all sorts of litterature, english, french, arabic. The need to\nread is kind of engrained in me…",
  "data/reddit-books/r/books/comments/pyj6be/stop_relying_on_the_streisand_effect_to_save_you.json": "Sorry, this might be a bit of a rant, but there are many posts in this sub about\nbook censorship, and there are consistently comments under them that I feel\ndeserve a general response.\n\nThey usually go something like this:\n\n\"LMAO, schools banning books? Kids will actually just seek out anything…",
  "data/reddit-books/r/booksuggestions/comments/pf4c1n/books_about_capitalism.json": "Recommended books explaining all the bad sides of capitalism.",
  "data/reddit-books/r/booksuggestions/comments/pfkilo/cozy_fall_books.json": "Recommendations for cozy fall books? Nothing horror related, it doesn't have to\npositive all the time and can have conflict just not looking for something that\nwill keep me up all night anxious 😅",
  "data/reddit-books/r/booksuggestions/comments/pfs2za/i_need_some_books_of_different_topics_for_the.json": "I live in Victoria, Australia and we're in the middle of a very long lockdown.\nIt's not expected to lift for another eight weeks. Due to the lockdown I can\nonly do the following things:\n\n * Essential Shopping\n * Go for a vaccination\n * Emergency Medical Services\n * Work\n * Two Hours of Exercise\n\nAs…",
  "data/reddit-books/r/booksuggestions/comments/pg15rf/wanna_get_the_life_that_was_stolen_away_from_me.json": "okay yeah cringe title but tltr: i was raised in a cult. I'm 20 now.\n\nI wanna find a book that will help me cope with that and move on. Therapy isn't\nan option.\n\nA book that'll help me make friends, and focus on my life without always feeling\nlike i had 90% of it stolen.\n\nMaybe even a book that's…",
  "data/reddit-books/r/booksuggestions/comments/pgfuj1/books_about_women_but_not_about_having_babies.json": "Are there any books out there with a female protagonist, who starts out\nchildless, possibly husbandless, and her 'happy ending' doesn't include a baby?\n\nI just read The Hour of the Witch by Chris Bohjalian and I loved it, but of\ncourse in the last couple of pages she gets a baby just like (it seems)…",
  "data/reddit-books/r/booksuggestions/comments/pgzcgs/an_easy_read.json": "I just read the road by Cormac McCarthy it's a really hard to read book IMO I\nguess I'm just slow or something so please recommend me a book that's less of a\nstruggle to read than that",
  "data/reddit-books/r/booksuggestions/comments/ph1dfs/book_on_how_to_be_a_better_husband.json": "As per the title. Been married nearly 7 years, together 9 years. M34 f33. I've\nread the 5 love languages many times but I need more help. I work a fly in fly\nout job/career and my wife finds it hard when I'm away. I want to be a kick ass\nhusband and dad. Please help.\n\nHer LL is words if affirmation…",
  "data/reddit-books/r/booksuggestions/comments/phdjif/chapter_books_to_read_to_a_4_yo.json": "I’m looking for chapter book suggestions for my 4 yo. She can’t read but loves\nbeing read to. She really loves Beverly Cleary books (Henry Huggins, the Ramona\nbooks). I also read Roald Dahl and the Little House books to her. She also liked\nCharlotte’s Web. Does anyone have any suggestions? Bonus…",
  "data/reddit-books/r/booksuggestions/comments/phj59e/books_like_schitts_creek.json": "Maybe a weird request. I love this show and would like to know if their are any\nbooks that have a family/story similar to theirs. The family dynamic, homophobic\nfree atmosphere, comedy mixed with realism and overall just wholesome vibe. I\nneed more literature like this in my life.",
  "data/reddit-books/r/booksuggestions/comments/phpmzm/book_or_literature_about_how_small_our_problems.json": "Hey I know my request is not common but am looking for a book to kill my ego and\nself important and to not take life seriously.",
  "data/reddit-books/r/booksuggestions/comments/phvr4s/great_books_to_read.json": "Recommend me any book you believe is a masterpiece. Regardless of the genre, as\nlong as it is good and well plotted. I want to read some good novels.\n\n * just don't recommend science fiction books, I don't like them",
  "data/reddit-books/r/booksuggestions/comments/pi51yg/any_erotic_book_recommendations.json": "I’ve been really horny lately and porn isn’t my strong anymore, does someone\nknows any good erotic literature? Thanks! :) I also want to improve my English\nvocabulary in the sexual way i usually moan in Spanish hhaha I’d like to learn\nhow to in English",
  "data/reddit-books/r/booksuggestions/comments/pif9ug/what_are_some_of_the_books_that_are_close_to_your.json": "I just got diagnosed with lymphoma. I have never been able to make close\nconnections because I chose to make a successful career and earn money over\neverything else. But now this goal seems frivolous as I don't have much time\nleft. It's too late for me to make friends now but I do want to feel that…",
  "data/reddit-books/r/booksuggestions/comments/pj0d79/easy_to_read_yet_interesting_book_for_a_couple.json": "Hello everyone, My girlfriend and I are in a long distance relationship and have\ndecided on holding our own little book club to help us cope. For our first book,\nI wanted something quite easy to digest, but also something we could have\ninteresting discussions about. I know the request is a bit…",
  "data/reddit-books/r/booksuggestions/comments/pj0ypq/which_stephen_king_book_should_i_read_first.json": "I enjoy reading crime/thriller/horror, but somehow I never got to reading any of\nStephen King's work.\n\nLately, whenever I go to a bookshop I find myself staring at his books, but I\nalso feel overwhelmed and don't know where to start. So, I'm hoping you guys\ncould help.",
  "data/reddit-books/r/booksuggestions/comments/pj7zti/dont_u_just_love_discovering_a_new_author_thats.json": "Don Winslow for me. Crushed power of the dog and on to the cartel now. His\nreading is everything I love - dark, gritty epic tales , no cheesy humor in his\nwriting. Reminds me of David simons homicide which I loved but he has so few\nbooks. Winslow has a quite a few and I’m pumped to read more by…",
  "data/reddit-books/r/booksuggestions/comments/pjnaka/witty_dark_humor_cynical_book_but_like_really.json": "Hi! I’m looking for a writer or a book with a very very sharp and smart sense of\nhumor. I don’t mind if it is complex or/and philosophical. something to provoke\nmy thoughts and a witty way. thanks!",
  "data/reddit-books/r/booksuggestions/comments/pjvjz0/fantasy_scifi_with_a_sense_of_humour_and_some.json": "Current read is getting me down, it all feels so hopeless and serious. I’ve\nready pretty much every book by Douglas adams , v.e schawbs. Recent good reads\nwould be deadly education, six of crows, harrow the ninth, good omens, murderbot\ndiaries.\n\nAny recommendations?",
  "data/reddit-books/r/booksuggestions/comments/pkbloq/a_cozy_90s_new_york_book_in_the_style_of_youve.json": "Hi, I was rewatching the Nora Ephron classics recently and I was wondering if\nyou guys could recommend a book with a similar vibe? Something that takes place\nin 90s New York, maybe during autumn or winter. Ideally, something that is a\nlight read but still witty and well written like those movies…",
  "data/reddit-books/r/booksuggestions/comments/pkugge/looking_for_science_fiction_books_like_hyperion.json": "These are books I really enjoyed over the last couple of years. Dune took me a\nwhile to get into but I wanted to finish it before the movie came out. I\ncurrently have the first Expanse book to read as well. Thanks!",
  "data/reddit-books/r/booksuggestions/comments/pl7rtj/just_read_andy_wiers_hail_mary_and_i_couldnt_put.json": "I'm looking for a book with similar pacing and characterization. Literally from\nthe start till the end of the book I was at the edge of my seat. I loved the\ninvestigative quality to the story. I loved how the events came together. I\nloved the central characters and their flow to the dialogue. Just…",
  "data/reddit-books/r/booksuggestions/comments/plmosm/is_harry_potter_worth_the_read.json": "Hi,\n\nSo iv just recently seen all the harry potter films. I thought they were OK but\ndon't fall into my top films. On saying this I have always wanted to watch a\nfilm series and then read the book series just to see how close or different\nthey are. Is the harry potter series a good/ worth the…",
  "data/reddit-books/r/booksuggestions/comments/pm4tmy/whats_the_best_book_about_911.json": "Title",
  "data/reddit-books/r/booksuggestions/comments/pm958o/best_short_story_collections.json": "What are the top 10 best short story collections?",
  "data/reddit-books/r/booksuggestions/comments/pmglca/books_to_learn_how_to_be_happier_less_regretful.json": "I have struggled with imposter syndrome and self-esteem issues my whole life\n(because of my family issues) and it has had a really negative impact on my\nability to succeed, be satisfied with my accomplishments, make human\nconnections, etc. I graduated college last year and I’m not where I wanted to…",
  "data/reddit-books/r/booksuggestions/comments/pmk5s5/books_to_learn_about_autism_and_neurodivergent.json": "My 15 year old son makes fun of her possibly autistic grandmother, I've talked\nto him but nothing seems to work. We are both avid readers so I am asking for\nsuggestions for books that talk about autism or that feauture neurodivergent\ncharacters. He and I talk almost daily about what we are reading,…",
  "data/reddit-books/r/booksuggestions/comments/pmuo8o/is_george_orwells_1984_really_that_good.json": "Is it worth reading? I've sean many top lists where this book was presented.\n\nWhat do you guys think?",
  "data/reddit-books/r/booksuggestions/comments/pmveu5/looking_for_a_book_for_a_teen_who_isnt.json": "My friend’s daughter is 12yo and is incredibly uncomfortable with everything\nsurrounding sexuality and intimacy.\n\nShe hates the thought of their parents touching or getting close to one another.\nShe once heard them having s*x ans since that she’s been sleeping on the couch\nto be as far as she can…",
  "data/reddit-books/r/booksuggestions/comments/pn834o/what_books_left_you_thinking_everyone_needs_to.json": "I'm looking for books that were so impactful and beautiful that you felt they\nmust be shared with others.\n\nHere is an example. I'm not a fan of Stephen King (at all) but a friend kept\ntelling my \"I had to read\" his book 11/22/63. Well after a year of this I\nfinally took a chance and read the book.…",
  "data/reddit-books/r/booksuggestions/comments/pnm0bl/that_one_book_that_you_have_reread_several_times.json": "I have a habit of re-reading books, when I am not able to get over them. Is\nthere a book that you find yourself very attached to?",
  "data/reddit-books/r/booksuggestions/comments/pnzlol/any_books_with_sikh_characters.json": "I love to read, particularly YA fiction and I was hoping that there are some\nbooks with sikh characters but I've been unable to find any so far.\n\nIf you know any fiction novels with sikh characters please let me know!",
  "data/reddit-books/r/booksuggestions/comments/pogdsa/books_about_native_americans.json": "I want to learn more about Native Americans in the United States — specifically\nNew England and into southeastern Canada (for the moment).\n\nI looked into An Indigenous People's History of the United States, which I'll\nprobably end up getting, but I also wanted something that explains who…",
  "data/reddit-books/r/booksuggestions/comments/pogwpv/any_good_bigfoot_erotica_out_there.json": "I first heard of Bigfoot erotica and thought it was a joke but turns out it’s\nreal and there’s a lot of it… now my brain is curious and would like to read a\nsomewhat decent one just to experience it.",
  "data/reddit-books/r/booksuggestions/comments/poopuw/books_that_cover_existentialism_essays_or_novels.json": "Hello!\n\nThis summer I started reading some novels written by Kafka (The castle, The\nmetamorphosis...) and also some short tales. I really enjoy the surreal and dark\nway of portraying life. I read some articles about the philosophical current of\nexistentialism, so I am looking for some essays (Not as…",
  "data/reddit-books/r/booksuggestions/comments/pp6qxs/space_scifi_novel_that_spans_many_worlds_across.json": "I’m surprised I’m finding it hard to find any that are full length novels with\nthis criteria. I’m open to any suggestions for this, but if possible, I’d prefer\nany suggestions that have a hardcover copy for purchase. I just like having a\nphysical collection of my books. If not possible I understand.",
  "data/reddit-books/r/booksuggestions/comments/ppfexj/i_want_a_scary_read_similar_to_the_exorcist_or.json": "Can be true crime or supernatural. But scary and well written. No sci fi or\nfantasy please. Looking for a classic, possibly something that’s been adapted\ninto a movie.\n\nTIA!!!",
  "data/reddit-books/r/booksuggestions/comments/ppriuc/a_book_on_grieving_a_parent_who_passed_that_you.json": "If this doesn't exist, I'll take great secular recommendations on grieving,\nplease. My dad just passed away unexpectedly in a motorcycle accident and I am\n26.\n\nTIA",
  "data/reddit-books/r/booksuggestions/comments/ppzchq/best_books_of_2021_so_far.json": "Looking for everyone's favorite book that has come out so far in 2021.",
  "data/reddit-books/r/booksuggestions/comments/pq2u9z/female_authors.json": "I decided this year, was going to be my year of the women and read as many\nfemale authors as I can, considering I have read so many male authors. I am\ndipping my toes for the very first time into Jane Austen, starting with Sense\nand Sensibilities, I don't know if it is something I would normally…",
  "data/reddit-books/r/booksuggestions/comments/pqk05p/book_for_20yo_in_psychiatric_hospital.json": "My daughter is struggling with depression and bipolar disorder. I am looking for\nsuggestions on books to help her escape. Much love",
  "data/reddit-books/r/booksuggestions/comments/pql76d/books_about_women_living_alone_maybe_on_a_farm_or.json": "I really wanna read something with a happy woman living alone, but not lonely\nand waiting for prince charming. If she lives on a farm or has e really big\ngarden even better. Maybe some cozy crime mysteries? No science fiction pls :)",
  "data/reddit-books/r/booksuggestions/comments/pqpuvn/anyone_like_kazuo_ishiguro.json": "Hi! I'd like to start reading more literary fiction. I recently read \"Klara and\nthe Sun\" and loved it. Any recommendations?",
  "data/reddit-books/r/booksuggestions/comments/pqy0jy/what_is_the_funniest_book_youve_ever_read_or.json": "I need some inspiration for something I finally intend on actualizing and\nwriting.",
  "data/reddit-books/r/booksuggestions/comments/pr8jt8/whats_your_personal_favorite_work_of_surrealist.json": "It's a genre I adore. Not quite full-blown fantasy, but reality with fantastic\nelements.\n\nSome works I especially enjoyed were:\n\nDas Parfum by Patrick Suskind. Some may remember it as Kurt Cobain's favorite\nbook - it's about a boy with no sense of smell who becomes a perfumer when he\ndiscovers…",
  "data/reddit-books/r/booksuggestions/comments/pr901a/any_good_phsycological_thrillers.json": "I started reading phsycological thrillers recently and I've been enjoying it a\nlot so do you all have any good recommendations except silent patient, gone girl\nand no exit?",
  "data/reddit-books/r/booksuggestions/comments/prkc6p/books_that_made_you_lol.json": "I love autobiographies by comedians (Sarah Silverman, Rob Delaney, Tina Fey) so\ndefinitely looking for similar books, or otherwise just books that you found to\nbe absolutely hilarious. Thanks!",
  "data/reddit-books/r/booksuggestions/comments/prsdtv/which_is_the_best_bhagavad_gita_translation.json": "I am searching for best Bhagavad Gita translation in English. But many people\nare claiming the some translation have manipulation. Can you suggest a Bhagavad\nGita in English without manipulation?",
  "data/reddit-books/r/booksuggestions/comments/ps0334/stephen_king.json": "I’ve never read any of Stephen King’s works. Where do I start? Something\nspooky/haunted would be great if possible, given the season.",
  "data/reddit-books/r/booksuggestions/comments/psflfe/books_that_changed_peoples_lives_made_your_eyes.json": "Hi guys, I’m looking for some new books to read. Any ideas would be greatly\nappreciated! Thanks.",
  "data/reddit-books/r/booksuggestions/comments/psrgyt/do_you_read_one_book_at_a_time_or_multiple_books.json": "I would like to read multiple books at a time but it may take me longer to\nfinish each of them. If I focus on one book at a time then I can spend more\nhours per day on it and finish books at a faster rate.",
  "data/reddit-books/r/booksuggestions/comments/pt48fu/fictional_books_that_involve_a_group_of_people.json": "I have no genre preference.\n\nI liked :\n\n * The Bromance Book Club series\n * One of Us is Lying\n * Superpowered series\n * Percy Jackson series\n * Charlie Bone series\n * Harry Potter series\n * The Mysterious Benedict Society series\n * Six of Crows",
  "data/reddit-books/r/booksuggestions/comments/pti6np/my_57yearold_dad_wants_to_go_back_and_complete.json": "So basically the title. My Dad can talk well (considering where he came from)\nbut he has trouble spelling words and reading sentences that are beyond a 4th of\n5th grade level. He has great ideas but doesn't know how to express himself.\nAnything you guys think might be helpful or advice would be…",
  "data/reddit-books/r/booksuggestions/comments/ptv3lf/looking_for_spooky_autumn_reads.json": "I'm looking for autumn leaves falling, a dark haunted castle on a stormy night,\na cemetery wreathed in mists. I want something to read on my porch at dusk\nsipping coffee with that nip in the air that gives me that spooky autumn feel.\nFantasy, series or one-off, straight fiction, murder mystery-…",
  "data/reddit-books/r/booksuggestions/comments/puah6h/i_am_in_a_reading_slump_and_need_a_book_thats.json": "I have been reading so much this year and right now I can’t seem to keep myself\nreading anything. What is a book that you just couldn’t put down?",
  "data/reddit-books/r/booksuggestions/comments/puatet/to_the_person_who_recommended_still_alice_a_year.json": "I mean this in the nicest way possibly, but I kind of hate you. I have a book\nhangover from it still and can’t seem to get over it. So thanks.",
  "data/reddit-books/r/booksuggestions/comments/puita3/books_about_a_monster_who_raises_a_human_and_sees.json": "I want a book where a giant raises a girl and sees her as his daughter and the\ngirl sees the giant as her father! :) Example: the bfg book and movie!",
  "data/reddit-books/r/booksuggestions/comments/pung2w/little_house_on_the_prairie_in_space.json": "I'm looking for any books or series which could loosely be described as \"Little\nHouse on the Prairie in Space.\" It doesn't have to be as wholesome or churchy.\nI'd just like something focuses on small-scale character stories about life in\ncolonies on alien worlds, generational starships, et cetera.…",
  "data/reddit-books/r/booksuggestions/comments/pur4hb/is_the_book_suggestions_bot_gone_forever.json": "Used to be you could put curly braces around a title+author and a friendly bot\nwould come along and comment with a link to the book. I notice it hasn't been\nworking for a few days. Anyone know what's the deal? I miss it.",
  "data/reddit-books/r/booksuggestions/comments/pv59i3/a_book_like_an_amy_shermanpalladino_show_with_a.json": "I just rediscovered the Gilmore Girls and remembered how much I love Palladino’s\nwriting. I also just rewatched The Marvellous Mrs. Maisel and am attempting to\nwatch Bunheads for the first time.\n\nI would love a book recommendation that has a similar feel to one of her shows,\nideally with a strong…",
  "data/reddit-books/r/booksuggestions/comments/pv6pk8/reads_for_halloween_spooky_season.json": "Does anyone have any good recommendations for books to read over Halloween or\nthe autumn months ? I don’t mind if they’re scary or just set in these months.\nThanks !!!",
  "data/reddit-books/r/booksuggestions/comments/pveoy2/apocalyptic_book_suggestions.json": "I am a huge fan of anything apocalyptic. It doesn’t have to be just zombies. I\nlove natural disaster books too. But I struggle to find good ones.\n\nI especially love book plots that focus on revenge or taking care of someone (a\nchild for example)\n\nAnyone know any good ones?",
  "data/reddit-books/r/booksuggestions/comments/pvs8qd/looking_for_a_regency_era_romance_where_sex_andor.json": "Hey all! I've read most of Jane Austen's works and I think them absolutely\nbrilliant (what a surprise, I know :D), so I've been looking for something\nsimilar. One of my favourite things about Jane Austen is that her books are\nundeniably romance novels, but still, they are not sex-obsessed. Austen…",
  "data/reddit-books/r/booksuggestions/comments/pw6ene/i_need_more_books.json": "So I’m in a reading slump and I need some books pronto. My favorite genres are\nhistorical fiction and fantasy. Some of my favorite books ever are The Boom\nThief, Harry Potter series, The Last Green Valley, and the Hunger Games series.\nI LOVE YA fantasy, especially dystopian.",
  "data/reddit-books/r/booksuggestions/comments/pwdysx/im_interested_in_reading.json": "Preferably across cultures, but it doesn’t have to be. I’m more interested in\nhow people from different cultures honour their beloved dead",
  "data/reddit-books/r/booksuggestions/comments/pwo40w/ugoodreadsbot_is_back.json": "Sorry everyone. Google Cloud shut down the bot due to a billing error on their\nend. I got the bot started again today. Sorry for the temporary outage. I didn't\nrealize until today!\n\nu/goodreads [/u/goodreads] bot lives to see another day!",
  "data/reddit-books/r/booksuggestions/comments/px2a9c/books_like_sapiens_and_a_short_history_of_nearly.json": "I've read the other ones by Yuval Noah Harari which were also great. What are\nsome other ones? I'm interested in anything to do with humans or other animals",
  "data/reddit-books/r/booksuggestions/comments/px63c6/which_book_or_books_started_your_obsession.json": "I am sure, that this is, probably, a question that has been asked plenty on\nhere. I have never been good at making myself read. This came from a somewhat\nhigh laziness, but also because I never was able to find a book that hooked me.\nI am now 21 and feel ready to get myself into reading, but I have…",
  "data/reddit-books/r/booksuggestions/comments/pxjdas/are_there_any_books_that_criticize_hustle_culture.json": "Or anything similar. May have topics or themes about overworked societies,\ncapitalism, etc.",
  "data/reddit-books/r/booksuggestions/comments/pxnojm/do_you_check_goodreads_ratings_and_reviews_to.json": "Granted that, In the past when there was no internet, we used to buy books from\nthe same author again and again. It's no longer needed and we can skip dubiously\nbad books and read only the good ones. Would like to know if this trend of\nyesteryears is still prevalent.",
  "data/reddit-books/r/booksuggestions/comments/pxxjao/any_books_or_authors_really_portray_the_life_of.json": "I don't need grandiose settings or plots. It can be about a cashier or CEO\nliving the life of quiet desperation. What books or authors who really capture\nthat in your opinions?",
  "data/reddit-books/r/booksuggestions/comments/py7wno/fictional_books_about_depression.json": "I read \"The Midnight Library\" after many people's suggestions about how it\ntackles mental illness, and I was severely disappointed. The book started off\ngreat but turned in to a YA drivel-fest. Not awful, just super pandering and\nobvious ending.\n\nWould love a book that focuses on a character with…",
  "data/reddit-books/r/booksuggestions/comments/pyaha9/non_reading_husband_help_us_start_a_family_time.json": "I've been struggling with a feeling of dismay . . .\n\nI've been praying and working on being more efficient with my time so that I can\nfind a moment and sit with a book in front of my children instead of always have\na device in my hand. I need to lead by example and I am here to solicit your\nhelp as…",
  "data/reddit-books/r/booksuggestions/comments/pyhfvi/books_with_a_haunted_mansiongothic_noir_vibe.json": "I'm looking for long dark hallways, a massive library, creepy characters, a\nfamily cemetery, and perhaps a hidden dungeon or something. Ghosts and gothic\nVictorian aesthetic encouraged.",
  "data/reddit-books/r/booksuggestions/comments/pylxko/books_with_heroines_that_are_just_like_other.json": "I don't know if I've just been down on my luck or books are actually all\nfeaturing the same heroine nowadays, but literally almost EVERY book I've read\nrecently have the same heroine with the at least two or more following traits:\n\n-Not like other girls (because they know how to read books or is…",
  "data/reddit-books/r/booksuggestions/comments/pyp7h2/just_got_accepted_in_college_after_growing_up_in.json": "what books will help me"
}