{
  "data/reddit-stocks/r/Bogleheads/comments/n9m856/3_questions_every_stock_picker_should_be_able_to.json": "Hey all, my first post\n[https://www.reddit.com/r/Bogleheads/comments/myloqh/how_to_set_up_a_great_boglehead_portfolio_in_5/]\nprompted a good discussion so I thought I'd write up a second one.\n\nMy first article was a walk through on how to set up a low-cost, globally\ndiversified stock portfolio with…",
  "data/reddit-stocks/r/Bogleheads/comments/n9ujit/retirement_target_date.json": "We’ve recently had demographic surveys on the sub about age and investment\nexperience, so I’m curious about the other end of the spectrum: people’s long\nterm plans for their investments.\n\nAnd while the Boglehead investment philosophy isn’t specifically geared toward\nretirement per se, that’s one of…",
  "data/reddit-stocks/r/Bogleheads/comments/na5721/how_do_you_guys_manage_your_emotions_when_the.json": "Hi all,\n\nToday it was one of the first days since I started investing in which I saw the\nmarket fell by a significant amount. I know that I am investing for a long time\nperiod (>10 years) and that I should not worry about those short term\nfluctuations.\n\nHowever today because of that fall, I started…",
  "data/reddit-stocks/r/Bogleheads/comments/na61r3/psa_for_newish_and_youngish_investorsyou_need_an.json": "I've seen the mods make several comments lately about the rapid number of new\nusers on this sub. So, I feel like there is chance to reach some people who may\nbe in the sweet spot for capitalizing on the value of an HSA. I really wish that\nat 25 (instead of 45) I had known about the investment value…",
  "data/reddit-stocks/r/Bogleheads/comments/nay9lf/i_just_bought_some_more_vtsax.json": "Told myself would DCA half of my ginormous amount of cash over a month or so. I\nknow - I need to go all in but even putting in 10% today was so difficult. I\ncame here to this page to just get some solace that I am doing the right thing.\nI have to admit - it felt like throwing money into a fire pit…",
  "data/reddit-stocks/r/Bogleheads/comments/nb6d2i/when_the_market_is_having_a_3_sale_and_you.json": "Market for me is more like VTI 😂",
  "data/reddit-stocks/r/Bogleheads/comments/nbj0bu/you_bogleheads_are_saving_me.json": "I inherited 2 dozen funds and 6 stocks a few months ago. Been trimming down the\nfunds. I been getting ready to transfer into the vanguard funds you guys\nmentioned. I have prwcx from trowe and was wondering if that would mess up the\nwhole philosophy if I keep 40% in that or will it overlap and mess…",
  "data/reddit-stocks/r/Bogleheads/comments/nbo1pv/fund_for_young_child.json": "Hoping for advice. My wife and I set up a mutual fund for our son when he was\nborn. We didn’t know a whole lot about investing at that time, we ended up going\nwith VASGX. The fund is simply meant to be savings that will be moved into our\nson’s name when he is 18, which is still 15+ years away.…",
  "data/reddit-stocks/r/Bogleheads/comments/nbqt2c/role_of_bonds_in_a_portfolio.json": "Crossposting here because I figure bogleheads portfolios are more likely to have\nan allocation towards bonds than most of the other investing subreddits.\n\nSorry to bring this up again. I've always believed that despite their low\nreturns, bonds had a role to play in a balanced portfolio. Either to…",
  "data/reddit-stocks/r/Bogleheads/comments/nbr0py/it_has_been_over_1_year_since_covid19_changed_our.json": "It has been over 1 year since COVID19 changed our world. How has this impacted\nyou? Positive impacts?📷\n\nToday I am in a reflective mood. I still remember March 13 2020 like it was\nyesterday. That is the day in Virginia that schools were shuttered and COVID\nimpacted our daily life. In those early…",
  "data/reddit-stocks/r/Bogleheads/comments/nbznxa/factor_investing_avdv_avuv_specific_questions.json": "Have some more questions about factor investing. I'm about to buy my first\nshares of AVDV and AVUV. Should these be going in taxable or tax-advantaged\nretirement accounts? I'm guessing AVDV should be in taxable to claim the foreign\ntax credit, but not sure.\n\nAlso on the topic of asset allocation…",
  "data/reddit-stocks/r/Bogleheads/comments/ncedbz/whats_an_old_lady_to_do.json": "I'm wondering which funds would be best for me to put my pathetic nest egg into.\nI'd like to see my investments grow, but I also know that at my age, I may need\nto be more conservative.\n\nI'm 72 and trying to improve my finances in my old age. Due to circumstances and\ndumb business decisions earlier…",
  "data/reddit-stocks/r/Bogleheads/comments/ncgje9/just_standing_here_and_doing_nothing_while.json": "Just thinking to myself today that while I've been \"standing there and doing\nnothing\", someone has been losing money by panic selling the last few days while\nsomeone else has been eating their lunch by buying the dip. I just can't wrap my\nhead around this mindset where you would try to time the…",
  "data/reddit-stocks/r/Bogleheads/comments/nd4uje/perspectiveadvice_to_someone_that_just_swallowed.json": "I posted some of this yesterday in r/investing\n[https://www.reddit.com/r/investing/] and r/valueinvesting [/r/valueinvesting].\nSomeone suggested to post it here to get talked down off the ledge. :) What I\nlearned from those conversations yesterday was that I need a better conception\nof my risk…",
  "data/reddit-stocks/r/Bogleheads/comments/nda3xp/roth_vs_traditional_in_a_no_income_tax_state.json": "I’m currently 24 and in a no income tax state. I’ve been maxing my Roth IRA and\n401(k). So far, I’ve chosen the Roth for both because I’m in the low end of 24%\ntax bracket with about $90k a year of total comp.\n\nMy compensation will increase over the years, but I’m considering going full\ninto Roth…",
  "data/reddit-stocks/r/Bogleheads/comments/ndcyy2/20_of_every_paycheck_into_an_etf.json": "My wife and I started investing a few years ago in mutual funds. Over the past\ntwo years I choose an ETF on the Wednesday before payday, and buy as many shares\nas possible in Vanguard on Friday, with the remainder into VFIAX.\n\nHere's how it's worked out so…",
  "data/reddit-stocks/r/Bogleheads/comments/ndlaw7/my_friend_doesnt_want_to_listen_to_mehelleven_my.json": "Ive told more people about investing and especially being a boglehead and nobody\nseems to listen to me.Im just a teen and Ive saved some bucks to invest, I was\nhoping I can help more people but everybody seems to disagree with me and I dont\nknow why.Well I tried I guess at least",
  "data/reddit-stocks/r/Bogleheads/comments/ndp5wc/broker_for_indexed_funds_in_jersey_channel_islands.json": "My wife has some of her savings from years working overseas deposited in HSBC in\nJersey (Channel Islands). She is not happy with the fees and choice of\ninvestment products.\n\nI would appreciate any tips or info on brokers / institutions in Jersey (or Isle\nof Man) that would allow her to invest in…",
  "data/reddit-stocks/r/Bogleheads/comments/nel99g/recently_opened_a_taxable_account_at_fidelity_and.json": "How do you navigate these myriad of options, sub-options, and sidebars? I'm just\ntrying to pull up simple lists of very basic index funds and ETFs such as their\nequivalents of VTI, BND, VT, VGIT, etc. and I'm getting reams of results far\nafield. Their interface looks like the television feed from…",
  "data/reddit-stocks/r/Bogleheads/comments/nen8th/voo_via_fidelity_instead_of_vanguard.json": "I'd like to add an S&P 500 ETF to my portfolio and am wondering are there any\nreasons to buy VOO in Vanguard vs. Fidelity? Fidelity allows fractional shares\nto be purchased so I see that as a big benefit to allow for set amounts to be\ninvested each week.",
  "data/reddit-stocks/r/Bogleheads/comments/netvfx/finally_faced_my_fear_of_investing_and_put_12k.json": "Ever since I was a child my family has always been teaching me that investing =\ngambling = losing money and that the only way to get \"rich\" was to save money.\nSo clearly I used to be super scared of investing and put it off for so, so\nlong. I am now in my mid 20s and during the past few months I've…",
  "data/reddit-stocks/r/Bogleheads/comments/nexzx3/i_invest_in_vti_vxus_everyday_thanks_to_this_forum.json": "So after gaining a bunch of money last year and losing a bunch more during GME/\nAMC rides early this year, I decided to stick to the advice from r/ Bogleheads\nand started redirecting my investments towards a steady long term plan with\ndiversification and selected VTI & VXUS. I wanted to make a habit…",
  "data/reddit-stocks/r/Bogleheads/comments/nfbcfo/how_should_someone_whos_76_years_old_and_retired.json": "So I notice my mom is keeping all of her wealth in a savings account, and I\nsuggested that maybe she should look into something that can preserve or grow\nher wealth, as inflation is slowly eating away at her wealth. After I made the\nsuggestion, she agrees and asked me to advise her. Unfortunately,…",
  "data/reddit-stocks/r/Bogleheads/comments/nfdam4/ive_done_it_im_fully_aboard_the_bogle_train.json": "After years of lurking and learning, I've finally sold all my remaining stocks\nand ETFs (which I did quite well with actually). I'm now all in, both Roth and\nTaxable. Turning 40 this summer and thought that would be a nice gift to myself.\nNo longer checking my accounts every day and really enjoying…",
  "data/reddit-stocks/r/Bogleheads/comments/nff6fv/new_to_investing_and_i_want_to_use_my_gme_and.json": "Hi!\n\nI just started trading in December of last year. Luckily, I was able to come out\nahead in the GME / Crypto mess the past 5 months. I was able to turn my measly\n$3k in savings into $20k. Having said that, I have realized that the stress of\nhigh volatility is not for me, and I wish to make good…",
  "data/reddit-stocks/r/Bogleheads/comments/nfgliy/a_quick_and_easy_method_for_fighting_fomo_or_just.json": "Hey everyone, Boglehead here who is prone to fits of raw and sweaty panic. I\nblame my parents.\n\nLots of threads here about FOMO over doge coin and other nonsense. Just wanted\nto provide a mental hack I came up with.\n\nThis past January, I watched the news with a pit in my stomach. Rona cases\nrising,…",
  "data/reddit-stocks/r/Bogleheads/comments/nfpvpn/the_ui_of_some_of_these_brokerages_hurts_my_soul.json": "Go ahead and yell at me but how bad is it really to use Stash app or Robinhood\nto build a Bogle-esque portfolio, both give you access to total US,\ninternational, and bond markets and the UI doesn't make you want to gouge your\neyes out. I know they skim money with order routing on robinhood, I know…",
  "data/reddit-stocks/r/Bogleheads/comments/ng91xi/question_about_buying_a_lot_of_voo.json": "I'm finally selling my company stock and should be getting around $5M in cash in\nAugust (I got very lucky). I decided to put it into VOO .. and was wondering\nbecause it has a lower daily volume than SPY ... is it safe to just put a market\norder in for the full amount? Should I split it across a few…",
  "data/reddit-stocks/r/Bogleheads/comments/ngz9az/25_year_old_looking_to_get_involved_and_become_a.json": "Hi all,\n\nI'm 25 and I have recently managed to clear up all of the debt that I occurred\nthrough my 18-21 so I am looking to start investing some money in different\nplaces so I don't have to work a 9-5 job for the rest of my life.\n\nAt the moment I am using Kraken for Cryptocurrencies and I am doing…",
  "data/reddit-stocks/r/Bogleheads/comments/nh4nx8/40_and_learning.json": "My wife and I are 40 and have had no retirement funds. Recently I opened up a\nRoth IRA through Fidelity for each of us and maxed out 2020's contributions.\nWith my account I'm playing the market for now but with hers I'm trying to take\nthe Boglehead approach. I've allotted $5000 of hers to VT and now…",
  "data/reddit-stocks/r/Bogleheads/comments/nhgovp/maxed_out_401k_and_roth_ira_finally_opening.json": "Hi folks - long time lurker, first time poster. Wanted to get your advice as I\nget more serious about investing and utilizing savings that have been sitting in\n0.4% HYSA accounts.\n\nSeveral questions as I think about opening a taxable:\n\n 1. If my Roth IRA and 401k are both Vanguard, I'm thinking of…",
  "data/reddit-stocks/r/Bogleheads/comments/nhhj3l/vanguard_mutual_funds_are_tax_efficient_like_etfs.json": "I was sharing this in a comment but thought this deserved its own post. There is\na long running truth that ETF’s are more tax efficient than mutual funds. While\nthat is true, it is not true at Vanguard.\n\nVanguard has patented this technology with the 14 index mutual funds being a\nshare class of the…",
  "data/reddit-stocks/r/Bogleheads/comments/nhlctk/just_want_to_thank_everyone_who_said_stay_the.json": "I got interested in the three fund portfolio after reading a \"bogleheads guide\nto investing\" I started putting money away and investing in the total U.S. total\nstock market, total international market, and some bonds all through fidelity\nbecause I had seen so many of their commercials lol. When I…",
  "data/reddit-stocks/r/Bogleheads/comments/nhv3oj/25_year_old_looking_to_start_investing.json": "Hi everyone! Been browsing this subreddit for a couple of days and am amazed by\nthe awesome support that everyone has shown.\n\nAs a beginner investor, there are a couple of questions I hope you guys can help\nme out with. My apologies if these questions are unintelligent.\n\nIm looking to invest in VT…",
  "data/reddit-stocks/r/Bogleheads/comments/ni0uzz/spy_vs_vo_vs_voo_vs_vt_vs_vti_how_do_i_choose_etfs.json": "Basically I’m having trouble picking an ETF to buy. How do i know which etfs are\nbetter than others?",
  "data/reddit-stocks/r/Bogleheads/comments/nije15/how_much_do_expense_ratios_really_matter_overtime.json": "Would the difference in expense ratios between Vanguard and Fidelity's Total\nStock Market funds make a sizable difference if I don't touch the money for 45\nyears? Am I missing any other variable here other than the 0.04 vs 0.00 %\nexpense ratios? I understand this sub is largely partial to Vanguard…",
  "data/reddit-stocks/r/Bogleheads/comments/nilk7q/selfdeclared_ira_from_taxable_account_is_this_real.json": "This is based on a conversation I had with a coworker before the pandemic. He\nwas a bit of a old boglehead and was telling us millennials that instead of\ncontributing directly to a Roth IRA, we can fill out a form with our broker to\nset aside $6k worth of a taxable account as a \"self-declared Roth…",
  "data/reddit-stocks/r/Bogleheads/comments/niy5gp/how_to_structure_taxable_and_tax_advantaged.json": "Which of the following options are the best way to structure my brokerage\naccounts? I want to keep things simple - I am just starting out with investing.\n\nI was thinking the tax efficiency and ability to avoid wash sales would favor\noption 3, but what do you think? Main drawback is trying to retain…",
  "data/reddit-stocks/r/Bogleheads/comments/nj5bpm/how_does_the_bogle_method_hold_up_against_the_big.json": "Dear Bogleheads I need your help with some argumentative convincing. I'm in no\nway a financial expert so I don't have the knowledge to do so myself.\n\nSo, I've decided to get my dad into this style of investing, but knowing him he\nwould just say \"aah it's all a lottery\". But I believe if I can show…",
  "data/reddit-stocks/r/Bogleheads/comments/nj9ddh/dave_ramsey_comparing_his_active_growth_funds_to.json": "I saw this video [https://www.youtube.com/watch?v=swKB0dFlxa8] where Dave Ramsey\nkept comparing his actively managed \"growth\" funds to the S&P 500. This seems\nlike an inappropriate comparison.\n\nA closer, and thus better, comparison would be to compare his large-cap growth\nfund to a growth index like…",
  "data/reddit-stocks/r/Bogleheads/comments/njefpz/any_canadian_bogles_out_there.json": "What do your portfolios look like? I’m currently sitting at around 80% VEQT (I\nbelieve this is the equivalent to VT or VTI?) and 20% VFV (S&P 500) but I’m\nwondering if it would be smarter to switch that VFV to a US total market ETF",
  "data/reddit-stocks/r/Bogleheads/comments/njmhgk/is_there_any_reason_to_have_a_brokerage_account.json": "Hi, I’m asking this since I recently transferred my Roth IRA from Fidelity to\nVanguard. My Roth IRA at Vanguard is currently 100% VTWAX, but I noticed that\nFidelity allows you to purchase for example VT with a 0.08% ER instead of\nVTWAX’s ER of 0.10% with fractional shares, which is the whole point…",
  "data/reddit-stocks/r/Bogleheads/comments/njqz8z/just_put_6000_into_a_roth_ira_with_vanguard_whats.json": "I just contributed $6,000 to a new Roth IRA account with Vanguard after doing a\nlot of research. Just trying to figure out how to best allocate these funds.\n\nSome context: I’m 30 years old, I have about $27,000 in my Roth 401K, I have\nzero debt, my gross pay is $105,000, and I have about $25,000…",
  "data/reddit-stocks/r/Bogleheads/comments/njwgek/investing_in_etfs_from_singapore.json": "Hello,\n\nI am a beginner investor based in Singapore. Just bought my first S&P 500 ETF\nstocks (VUAA:xlon) from an online trading broker (Saxo). My question is the\nfollowing:\n\n- Which is the best method to periodically make investments into the VUAA:xlon\n(or other index ETFs) from Singapore? I was…",
  "data/reddit-stocks/r/Bogleheads/comments/nk29xm/vti_turns_20_years_old_today.json": "20 years ago Vanguard gave us one of the best ETF’s out there. Gonna celebrate\nby not even checking the markets today.",
  "data/reddit-stocks/r/Bogleheads/comments/nkc7s0/thank_you_im_a_boglehead_now.json": "Thank you all for enduring my questions these last few months. I’ve made the\nswitch. I’m now a Boglehead! Just switched my IRA to a four fund total market\napproach. It feels so good! :)",
  "data/reddit-stocks/r/Bogleheads/comments/nkkxbb/wisdomtree_launches_9060_etfs_for_international.json": "NTSX [https://www.wisdomtree.com/etfs/efficient-core/ntsx] is my favorite fund\nto recommend. It is 90% S&P500 and 10% cash and collateral for treasury futures\nequal to 60% exposure. It hits the diversification/leverage sweet spot to\ndeliver higher return with lower risk. It’s a very tax efficient…",
  "data/reddit-stocks/r/Bogleheads/comments/nkr5xp/what_to_read_after_the_little_book_of_common.json": "Almost finished and I need a new book to read. I understand bogleheads guide to\ninvesting is usually suggested however I am a little more interested in learning\nabout how to analyze graphs and trends, using fundamental/technical analysis,\nunderstanding not only the financials of a company but how…",
  "data/reddit-stocks/r/Bogleheads/comments/nlijeb/interesting_article_comparing_equity_bonds_and.json": "Considering how many new posts we see asking if bonds make sense in today's\nenvironment, I thought users here might appreciate this article I came across\nwhich explicitly ignores the current news and uses data from the 50s and 80s and\ncompares it to today's prices to come to a conclusion about what…",
  "data/reddit-stocks/r/Bogleheads/comments/nlip77/what_happens_to_voting_shares_in_etfsindexmutual.json": "Do fund managers vote or do they abstain for each company? Would it be possible\nfor fund share owners to vote?",
  "data/reddit-stocks/r/Bogleheads/comments/nmam88/where_to_check_marketcap_weightings.json": "I know that the Portfolio & Management tab of Vanguard's page for VT\n[https://investor.vanguard.com/etf/profile/portfolio/vt] lists allocation\npercentages for regions and certain countries, but what if I wanted to check\npercentages for large, mid, and small caps for the world or a specific…",
  "data/reddit-stocks/r/Bogleheads/comments/nmcvy3/looking_for_advice_on_allocation_for_401k_27_yo.json": "Lifecycle is 56.8% US, 34.8% Intl, 8.4% bonds. Recently opened and maxed a Roth\nIRA (100% VTWAX)\n[https://preview.redd.it/013fu39b6p171.png?width=462&format=png&auto=webp&s=2c41c44a34e75c087ff3fdc66ab28671e917b21f]",
  "data/reddit-stocks/r/Bogleheads/comments/nmqekh/moving_from_stocks_to_etfs_do_or_dont.json": "I've started to invest in ETFs only of-late, (mostly targeting VTI, VTEB, VUG,\nCMF) in my taxable account. And I have close to 800k worth of stocks, 30-40% of\nit being AAPL, which I have been holding since around 2010. Most of my other\nholdings are also stable holdings like JNJ, PFE, FB, NFLX, AMZN,…",
  "data/reddit-stocks/r/Bogleheads/comments/nn0b02/looking_for_help_starting_out_23m.json": "Hi Everyone! I was doing some research and the Boglehead approach really\nresonated with me. I am 23 years old and will be starting my first job soon.\nUnfortunately, my parents passed away during COVID, but left me with some money.\nI really do not want to waste their money and prepare myself for…",
  "data/reddit-stocks/r/Bogleheads/comments/nn6dou/do_your_expenses_per_person_decrease_when_married.json": "I'm currently single (late 20s), and planning my financial future. One big life\nchange I hope to have is getting married, which has tax benefits, and I'm sure\nsome \"economies of scale\" benefits.\n\nI know this is dependent on any lifestyle changes (such as having kids, etc.),\nbut do you have any…",
  "data/reddit-stocks/r/Bogleheads/comments/nnh3vj/100_vt_vs_vti_vxus.json": "Lately I have seen a lot of people recommending VTI+ VXUS. I am just wondering\nisn't it almost the same thing as 100% VT?\n\nWhy not go 100% VT to save the broker fee?\n\nEdit: Thanks for the response. However I would like to point out that the broker\nfee is inevitable for me as I am from South East…",
  "data/reddit-stocks/r/Bogleheads/comments/nnpds8/what_to_buy_inside_roth_ira_with_fidelity.json": "Hello I'll try to keep this short. Recently received 30k and am looking to put\nit into a Roth IRA through Fidelity (already have fidelity account and want to\nkeep everything together).\n\nI will be putting in 6k immediately and will put in another 6k as soon as I'm\nallowed again until fully invested.…",
  "data/reddit-stocks/r/Bogleheads/comments/nnr5z0/migration_to_boglehead_portfolio_is_complete.json": "I had a super risky portfolio and was in the process of moving everything to\nBoglehead style funds\n[https://old.reddit.com/r/Bogleheads/comments/mnmzf5/my_portfolio_is_healing_transition_is_in_progress/].\nNow migration is completed but since I didn't want to realize gains I kept the\nsame stocks and…",
  "data/reddit-stocks/r/Bogleheads/comments/nnv574/joining_the_crew.json": "Like the title says, I’m gonna go the Boglehead route. Am tired of the stressed\nand all the BS trying to chase individual stocks. Nothing wrong with good\nDD/blue chips/ stuff you believe in but I am gosh darn tired of looking at and\nstressing over price changes every 5 min. Imma just make smart…",
  "data/reddit-stocks/r/investing/comments/n2fchi/not_a_single_one_of_you_are_able_to_argue_why.json": "Reading through this sub you get the feeling that everyone “knows” it but no one\nis exactly giving a single reason for why, other than “it should because of high\nvaluations”.\n\nIt reads as a lot of wishful thinking and arrogance. Where the hell do you place\nApple, the largest company in the world…",
  "data/reddit-stocks/r/investing/comments/n2iz5s/good_idea_to_keep_cash_in_money_market_for_dry.json": "Read this article from The NY Times a few days ago and started to wonder about\nmy strategy of keeping cash (50-150k) in a money market fund to move to the\nSP500 as dollar cost averaging and/or as 'dry powder' in case of larger swings.\n\nI had followed my CPAs advice a while back to use Money Market…",
  "data/reddit-stocks/r/investing/comments/n2n415/why_i_am_invested_in_psychedelics.json": "(\\***Disclaimer: The purchase, sale, and use of psychedelic drugs is currently a\nFederal Offense and their consumption comes with great dangers when used in an\nuncontrolled environment.\\**)*\n\nI have been following psychedelic research for many years now. And I am writing\nthis post for anyone who is…",
  "data/reddit-stocks/r/investing/comments/n2o4zl/amzn_q1_earnings_eps_1579_vs_954.json": "Still couldn't find amazon post in this sub, wanted to discuss. These are\namazing numbers. It has been consolidating in this range for past 7 months.\nReady to shoot up and find new base. Shares went up almost 5% after hours and\nstrangely closed red on Friday.\n\nEPS: $15.79 vs. $9.54…",
  "data/reddit-stocks/r/investing/comments/n2w9h1/well_health_in_the_financial_post_this_morning.json": "This is the most analysts I have ever seen respond to a short report...\n\nhttps://financialpost.com/investing/short-sellers-dont-always-win-and-shouldnt-get-the-glory\n\nReally sheds light on the current market we are in. \" If you own a great company\ntheir is no reason to worry\" . Excited to see what…",
  "data/reddit-stocks/r/investing/comments/n34369/berkshire_earnings_jump_buffett_continues_to_buy.json": " * Berkshire Hathaway reported operating income of $7.018 billion in the first\n   quarter, up 20% from $5.871 billion in the same period a year ago.\n * During the first quarter, the company bought back $6.6 billion of Berkshire\n   shares, after a record $24.7 billion in buybacks last year in lieu…",
  "data/reddit-stocks/r/investing/comments/n34we7/whats_your_average_return.json": "The stock market has been crazy over the last few years, and everyone keeps\ntalking about high-fliers like Tesla and other companies that have increased\ntheir market cap by 800%+ in the last year or so. Unfortunately, it's not always\npossible to pick the winners like these when investing, since…",
  "data/reddit-stocks/r/investing/comments/n3ollc/credit_suisse_made_just_175m_in_archegos_fees_in.json": "https://www.ft.com/content/429f2cd2-db55-42b8-a65c-a228cdb3089d\n\n> Credit Suisse made just SFr16m ($17.5m) of revenue last year from Archegos\n> Capital, the family office whose sudden collapse in March caused the Swiss\n> bank $5.4bn in losses, according to people with knowledge of the…",
  "data/reddit-stocks/r/investing/comments/n3rwq5/why_hasnt_facebook_stock_reacted_to_apples.json": "Recently apple announced a number of privacy changes coming with IOS 14.5, which\nwill ask users when they use an app for the first time whether they want to\nallow the app to track them across the device as a whole.\n\nFacebook noted this will most likely hurt profits and slow growth somewhat.\nRevenue…",
  "data/reddit-stocks/r/investing/comments/n4ifxt/q1_2021_tesla_market_share_is_shrinking.json": "While Tesla sales are booming, as a whole its market share is shrinking\nworldwide [http://ev-sales.blogspot.com/2021/05/2021-q1-sales-by-oem.html]:\n\n> If we gather plugin sales by Automotive Groups, Tesla ended the first quarter\n> of the year in the lead, with 16% share, 3% less than a year ago\n> \n>…",
  "data/reddit-stocks/r/investing/comments/n4l1ye/g1_therapeutics_as_a_future_of_oncology.json": "If you ever met CANCER you must know how tough it is, tough to fight with it,\ntough to watch how your beloved struggle and sometimes the only thing that can\nhelp is chemo!\n\nBut chemo also not easy to go through, thats why you need to know about G1\nTherapeutics and Cosela!\n$GTHX - G1 Therapeutics\n\n *…",
  "data/reddit-stocks/r/investing/comments/n4m397/persistent_high_inflation_wont_happen.json": "The Fed can raise interest rates to infinity in lock step with rising prices to\ntame inflation when they want. This Fed power is far more effective than money\nprinting. Right now, they want asset inflation, which through a wealth effect,\nstimulates aggregate demand. Powell doesn't want or need to…",
  "data/reddit-stocks/r/investing/comments/n4m67d/corsair_gaming_q1_eps_beats_by_025_beats_on.json": "Corsair Gaming (NASDAQ:CRSR):\n\n• Q1 Non-GAAP EPS of $0.58 beats by $0.25; GAAP EPS of $0.47 beats by $0.18.\n\n• Revenue of $529.4M (+72% Y/Y) beats by $76.13M.\n\n• Gaming and creator peripherals sales increased 132% to $175.9M. Gaming\ncomponents and systems revenue was up 52% to $353.5M.\n\n• Gross…",
  "data/reddit-stocks/r/investing/comments/n52di6/questions_about_my_roth_ira_options_reposted_from.json": "The AutoMod decided this was a bad post for /r/personalfinance so I am here now.\n\nHello /r/investing I was wondering what I should do in regards to my Roth IRA,\nbasically I am focused growth, with plans to retire at age 55-62 depending on\nhow everything goes (IE I hit whatever number I feel is…",
  "data/reddit-stocks/r/investing/comments/n55982/commodities_futures_or_producers.json": "Hey folks.\n\nWith talks of looming inflation, and the rotation into value,\ninflation-protected, and \"reopening\" oriented stocks, I figure more than a few\npeople are looking to adjust their portfolios a bit, and may have some similar\nquestions.\n\nSomething I had not heavily considered before now are…",
  "data/reddit-stocks/r/investing/comments/n5a2ms/in_your_opinion_is_cryptocurrency_a_sound.json": "I've got a good friend who has been told that a certain crypto-currency is going\nto rise substantially (I know I know... I'm cynical as well).\n\nThe thing that makes me ponder whether this is genuine or not is that the advice\nshe has received is from a very trusted source to her - i.e. someone with a…",
  "data/reddit-stocks/r/investing/comments/n5b5yf/has_any_possession_become_an_investment_over_time.json": "I'm wondering if anyone else has experience with items becoming investments over\ntime due to massive appreciation in value. Last year, I bought a couple of\nvaunted Magic cards from its early history, such as a Black Lotus, figuring that\nit was the only chance to own one after a 500% increase in the…",
  "data/reddit-stocks/r/investing/comments/n5bhps/daily_general_discussion_and_spitballin_thread.json": "Have a general question? Want to offer some commentary on markets? Maybe you\nwould just like to throw out a neat fact that doesn't warrant a self post? Feel\nfree to post here!\n\nThis thread is for:\n\n * General questions\n * Your personal commentary on markets\n * Opinion gathering on a given stock\n *…",
  "data/reddit-stocks/r/investing/comments/n5jtkv/peloton_pton_recalls_its_tread_and_tread.json": "> The company will no longer sell either product and is offering owners full\n> refunds\n> \n> Peloton recalled its Peloton Tread+ and Peloton Tread treadmills today,\n> according to an announcement from the Consumer Product Safety Commission\n> [https://www.cpsc.gov/Newsroom/News-Releases/2021/CPSC-and…",
  "data/reddit-stocks/r/investing/comments/n5v0cr/teladoc_stock_is_down_another_8_this_week_dont.json": "\"The stock has been under pressure for the past few months since the firm\nsignaled that it expects little membership growth in 2021\n[https://www.barrons.com/articles/teladoc-stock-falls-on-downbeat-forecast-for-membership-51614267007?mod=article_inline].\nA lack of growth is bad for any company, but…",
  "data/reddit-stocks/r/investing/comments/n5z0z4/uber_investors_finally_see_the_costs_of_treating.json": "https://www.marketwatch.com/story/uber-investors-finally-see-the-costs-of-treating-drivers-as-employees-and-the-stock-is-falling-11620265604\n\nUber Technologies Inc. has spent and fought to keep its drivers from becoming\nclassified as employees instead of contractors, and investors finally got…",
  "data/reddit-stocks/r/investing/comments/n6822k/what_are_your_ppe_manufacturer_plays.json": "Tech earnings are receiving all the hype recently, and if you guys are like me,\nyou’re looking for stocks to get into at low prices, and ride out the growth\n(we’re all aiming for the next TSLA). While tech like TSLA is always in the\nnews, I’m starting to think more about COVID stocks and those who…",
  "data/reddit-stocks/r/investing/comments/n6dh3d/i_sold_every_share_i_own_today.json": "I got into the market last year post Covid around May or June. Since then it has\nbeen an absolute rollercoaster trying to pick stocks. I was up 100% on multiple\nstocks including Tesla, Carvana, Square, Fiverr. I didn't sell because you're\nsupposed to hold for the long term I heard, only for those…",
  "data/reddit-stocks/r/investing/comments/n6fysa/in_just_3_months_tesla_has_issued_80_of_the.json": "Their model is beyond amateurish. Tesla share count at the end of Q1 was 963.3M,\nup from 960M at the end of Q4. This is just 700K away from ARK's 964M 2025\nprojected share count.\n\nThose are only the outstanding shares. They missed Tesla's diluted share count\nby over 100M in their newest model. And…",
  "data/reddit-stocks/r/investing/comments/n6h9r8/square_q1_eps_beats_by_025_beats_on_revenue.json": "Square (NYSE:SQ):\n\n• Q1 Non-GAAP EPS of $0.41 beats by $0.25; GAAP EPS of $0.08 beats by $0.14.\n\n• Revenue of $5.06B (+266.7% Y/Y) beats by $1.73B.\n\n• In the first quarter of 2021, mid-market Seller GPV increased 43% year over\nyear, more than 2x the growth of total Seller GPV.\n\n---------------------…",
  "data/reddit-stocks/r/investing/comments/n6ixwf/cloudflare_net_q1_revenues_top_estimates_stock.json": "After Fastly reported disappointing numbers this morning and $NET followed it\ndown (see here:\nhttps://www.reddit.com/r/investing/comments/n65ljk/fastly_reports_disappointing_1q_results_light/),\n$NET responded strongly.\n\nCloudflare earnings and revenue for the March quarter topped analyst…",
  "data/reddit-stocks/r/investing/comments/n6klu0/according_to_morningstar_only_42_of_the_top_5000.json": "Source: How Many Stocks Beat the Indexes?\n[https://www.morningstar.com/articles/1035348/how-many-stocks-beat-the-indexes]\n\nRecent posts about people losing their initial investments over the past 6-12\nmonths made me think of this article that I heard the guys on the recent…",
  "data/reddit-stocks/r/investing/comments/n6l995/the_roaring_2020s_economystocks.json": "So.\n\nUnlike a lot of naysayers who think taxes, inflation, or certain political\nparties will derail this train, I don't agree.\n\n * Personal Saving Rate | U.S. Bureau of Economic Analysis (BEA)\n   [https://www.bea.gov/data/income-saving/personal-saving-rate] , savings rate\n   has averaged 18.75%.…",
  "data/reddit-stocks/r/investing/comments/n6uka6/fastly_drops_27_after_release_of_q121_results.json": "Fastly released its Q1-21 performance on Thursday, after which the stock price\ndropped a whopping 27%. The company generated revenues of $84.9 million (35%\nYoY) vs. $85.1 million market consensus. Net loss per share was $0.12 vs. an\nexpected $0.11.\n\nThese are not big misses but make the company one…",
  "data/reddit-stocks/r/investing/comments/n6xw0g/us_bureau_of_labor_statistics_announces_increase.json": "\"Total nonfarm payroll employment rose by 266,000 in April, and the unemployment\nrate was little changed at 6.1 percent, the U.S. Bureau of Labor Statistics\nreported today. Notable job gains in leisure and hospitality, other services,\nand local government education were partially offset by…",
  "data/reddit-stocks/r/investing/comments/n6zin9/cnn_steel_prices_have_tripled.json": "> US Steel (X\n> [https://money.cnn.com/quote/quote.html?symb=X&source=story_quote_link]),\n> which crashed to a record low last March\n> [https://www.investopedia.com/us-steel-stock-hits-all-time-low-4799379] amid\n> bankruptcy fears, has skyrocketed 200% in just 12 months. Nucor (NUE\n>…",
  "data/reddit-stocks/r/investing/comments/n74k0c/using_math_followed_by_some_due_diligence_to.json": "TLDR: I did a bunch of math based on some reasonably good ideas to determine a\nselection of stocks worth investing/reviewing. Lists of stocks found in 2020 and\n2021 Experiment sections.\n\n\nOBSERVATIONS/ASSUMPTIONS\n\n * Index funds have been shown to be the most successful stock investing\n   instrument…",
  "data/reddit-stocks/r/investing/comments/n7802u/competition_is_growing_in_the_telehealth_sector.json": "The pandemic has changed a lot of things for good, including healthcare. Since\nthe demand for telehealth skyrocketed in 2020, it’s been a super hot sector with\nnot only a lot of investments, but a lot of new players in the arena. As I’ve\ndebated on which company to put my stake in, I’ve always had…",
  "data/reddit-stocks/r/investing/comments/n7cmlw/help_me_understand_cathie_woods_math_on_her.json": "Recent interview of Cathie Wood on CNBC (search YouTube for \"I love this setup,\nrotation is good news\" to find video) got my head scratching around the math she\njust did in her statements. Back in February she said she expects 15% YoY\ncompounded returns in next 5 years when ARK funds (say ARKK) was…",
  "data/reddit-stocks/r/investing/comments/n7ei1n/guess_who_has_no_future_competetion_and_is_not_in.json": "Ok, there is some competetion but, future competetion is non existant. The\nregulatory hurtles, the land that would need to be baught, the man power it\nwould take to build a new railroad network is just out of the question.\n\nSo what are we left with? Well with whats already there. They are…",
  "data/reddit-stocks/r/investing/comments/n7z2b6/blackrock_reports_71_decrease_in_ownership_of_pltr.json": "Link - https://fintel.io/so/us/pltr/blackrock\n\n2021-05-07 - BlackRock Inc. has filed a 13F-HR form disclosing ownership of\n9,378,527 shares of Palantir Technologies Inc. Class A (US:PLTR) with total\nholdings valued at $218,425,000 USD as of 2021-03-31. BlackRock Inc. had filed a\nprevious 13F-HR on…",
  "data/reddit-stocks/r/investing/comments/n7zcg9/breaking_us_fuel_pipeline_system_shuts_down_after.json": "The infiltration of a major fuel pipeline is \"the most significant, successful\nattack on energy infrastructure we know of.\"\n\nhttps://www.politico.com/news/2021/05/08/colonial-pipeline-cyber-attack-485984\n\nThe main fuel supply line to the U.S. East Coast has shut down indefinitely\nafter the…",
  "data/reddit-stocks/r/investing/comments/n7zop3/if_youre_one_of_the_absolute_nutters_who_has.json": "All over the internet today I’ve seen DOGE enthusiasts proclaiming you will set\nyou sell limit to $1. Please, if this is life changing or important money, do\nnot set your sell limit to $1.\n\nGuess what will happen if and when the price hits $1? A lot of sell orders, a\nlot of traffic and crashing…",
  "data/reddit-stocks/r/investing/comments/n89kz5/we_sometimes_say_that_we_plan_to_hold_certain.json": "I have positions in a few blue chip companies like MSFT, AMZN, DIS, etc., and\nwhile I’m sure they’ll be good investments for quite a long time, do you think\nthey’ll really still be good investments in 30-50 years? Even the best companies\nwill eventually die- surely it would be better to try and sell…",
  "data/reddit-stocks/r/investing/comments/n8nkcd/why_would_someone_invest_in_real_estate_today.json": "Traditionally, real estate was always seen as one of the best kinds of\ninvestment, but imo that's largely because knowledge on stocks was much more\nrare, and it wasn't as easy back then, since there weren't many investing apps,\nhigher fees, and it wasn't as easy to do.\n\nWhile there are of course…",
  "data/reddit-stocks/r/investing/comments/n8zfda/why_is_it_possible_that_an_inflow_into_funds_are.json": "https://www.marketwatch.com/story/why-you-should-worry-about-the-flood-of-new-cash-into-u-s-stock-funds-11620102925?siteid=yhoof2\n\nIt says that it is a bearish sign that there has been a net of inflow of money\nto ETFs and other funds this year. I would assume that if they are getting cash,\nthey…",
  "data/reddit-stocks/r/investing/comments/n90hkk/market_valuations_and_investing_allocations.json": "Hi.\n\nI want some input here, cause I simply can't make my mind up.\n\nI'm currently holding my PF, while adding a small amount of money in 5 different\nindex funds monthly.\n\nIn terms of money I'm saving about $ 700 in an world index fund every month as\nlocked in pension savings, and another $ 700 in 5…",
  "data/reddit-stocks/r/investing/comments/n93q2k/my_shortlist_for_screening_stocks_against.json": "It seems many are trying to bail on stocks because inflation. (collectibles that\nwe treat as currency, commodities etc). I wanted to explore is if there are\ncertain categories of stocks that are better positioned against Inflation.\n\nSo I came up with a short-list of they type of stocks I might look…",
  "data/reddit-stocks/r/investing/comments/n93uwi/cnbc_a_psychedelic_drug_boom_in_mental_health.json": "Mental illness is among the most costly medical expenses in the U.S., and it has\na high cost to employers in lost productivity. In 2019, 51.5 million adults were\nliving with a mental illness in the U.S., and the number of people suffering and\ndrug costs, already in the tens of billions of dollars…",
  "data/reddit-stocks/r/investing/comments/n94bfc/some_longterm_strategies_worth_remembering_in.json": "Before we get into the juicy details, think for yourself: What are you shooting\nfor? What is your financial goal? How risk-sensitive are you? Answering these\nquestions will help to set you up for eventual success and develop your\nindividual asset allocation strategy accordingly.\n\nLet’s get to the…",
  "data/reddit-stocks/r/investing/comments/n974pi/motley_fool_current_model_for_uber_lyft_just.json": "https://www.fool.com/investing/2021/05/10/quarterly-losses-uber-lyft-confirm-ride-hailing/\n\nThe business premise seems sound enough, at least on the surface. The problem:\nOwning a vehicle is more trouble than it's worth, but taxi cabs are costly and\nso yesterday. The solution: Just use a mobile app…",
  "data/reddit-stocks/r/investing/comments/n9odr2/what_is_the_longest_future_trend_you_know_of_that.json": "Inflation or deflation, is crypto a bubble or an S curve, are value stock\ninvestors missing by not investing in bankrupt or non-profit generating\ncompanies... it seems nothing is certain these days. Which made me think. Are\nthere long term trends that it makes sense investing in for at least the…",
  "data/reddit-stocks/r/investing/comments/n9qxag/do_you_think_the_sothebys_banksy_auction_on_the.json": "On the 12th May Sotheby's will auction a Banksy and, for the first time, allow\npayment in both Bitcoin and Ethereum. I'm interested in what effect this might\nhave on the value of Ethereum (especially as I have some of those) but also, the\neffect on other crypto currencies reputation in the general…",
  "data/reddit-stocks/r/investing/comments/n9xe0d/what_is_the_best_way_to_gain_exposure_to.json": "There has been quite a bit of talk on various portfolios like Ray Dalio's all\nweather portfolio or the 100 year \"dragon\" portfolio and they all have a\ncomponent of commodities (or trend)\n\nBut lets say I didn't want to invest in a fund that uses rolling future\ncontracts to gain exposure but invest in…",
  "data/reddit-stocks/r/investing/comments/n9zazb/stanley_druckenmiller_says_the_fed_is_endangering.json": " * Fed policies could end up threatening the long-term health of the U.S.\n   dollar, investing magnate Stanley Druckenmiller told CNBC.\n * “I can’t find any period in history where monetary and fiscal policy were\n   this out of step with the economic circumstances, not one,” the chair and CEO\n   of…",
  "data/reddit-stocks/r/investing/comments/n9zur3/palantir_earnings_report_is_out.json": "Link\n[https://investors.palantir.com/news-details/2021/Palantir-Reports-49-Revenue-Growth-117M-in-Cash-Flow-from-Operations-up-404M-YY-and-151M-in-Adj.-Free-Cash-Flow-up-441M-YY-for-Q1-2021]\n\nFigures in thousands\n\nParticular Q121 Q120 Percentage Change Revenue 341,234 229,327 49% Gross…",
  "data/reddit-stocks/r/investing/comments/nabnrv/cathie_wood_deep_dive_into_her_20_year.json": "How could an equity manager that has been in the game for over 30 years and\nrelatively unheard of suddenly make a splash with Ark? What was she doing before\nArk? I have been able to dig into her past performance and the results of which\nare below.\n\n \n\nQuick summary\n\n * She has a long history of…",
  "data/reddit-stocks/r/investing/comments/naecz6/question_for_the_investor_millionaires_at_which.json": "Often times I hear about people who reach a $1 million net worth yet they don’t\nfeel wealthy or satisfied at all when I believe that this should be viewed as a\ntremendous accomplishment. Getting to $5 million is impossible if you never\nreach $1 million.\n\nI view $1 million as the ticket to true…",
  "data/reddit-stocks/r/investing/comments/nau5r6/10_year_treasury_auction_5122021.json": "10 Year Treasury auctions are always important as the rate sets the benchmark\nfor discount rates in 4 corners of the finance world.\n\nGiven the CPI jump today, this auction became that much more important to watch\nand I thought you fellows would appreciate a take on how it went.\n\nIn short, today's…",
  "data/reddit-stocks/r/investing/comments/nawyv7/the_latest_cpi_numbers_can_be_explained_by_the.json": "A lot of you have looked at the numbers, but how many of you have actually\nlooked INTO the numbers? I'm going to break down the numbers, and tell you why\nyou're worrying your heads off over nothing. Precursor: Things haven't\nsignificantly changed, inflation is no more than it was last month.\n\n\nTHE…",
  "data/reddit-stocks/r/investing/comments/nb164d/elon_musk_tesla_will_no_longer_accept_bitcoin_as.json": "https://twitter.com/elonmusk/status/1392602041025843203?s=19\n\n\"Tesla has suspended vehicle purchases using Bitcoin. We are concerned about\nrapidly increasing use of fossil fuels for Bitcoin mining and transactions,\nespecially coal, which has the worst emissions of any fuel.\n\nCryptocurrency is a good…",
  "data/reddit-stocks/r/investing/comments/nb8mhb/yahoo_uber_used_50_dutch_shell_companies_to_dodge.json": "https://news.yahoo.com/champions-league-tax-avoidance-uber-025211310.html\n\nUber used around 50 Dutch shell companies to help reduce its global tax burden,\nan Australian research group found. Despite earning $5.8 billion in global\nrevenues in 2019, Uber claimed a $4.5 billion loss for tax purposes.…",
  "data/reddit-stocks/r/investing/comments/nbcn9g/why_is_inflation_bad_for_stocks.json": "As the title suggests, I am really wondering why inflation is bad for stock's\nand why is everybody \"panicking\". As I understand it, inflation especially hyper\ninflation isn't a bad thing at all for a stock holder. If your fiat of choice\nevaporates you wanna hold real values, like real estate or art,…",
  "data/reddit-stocks/r/investing/comments/nbdnjt/why_does_the_market_react_so_strongly_to_the.json": "I find it strange that the market reacts so strongly to the release of inflation\nnumbers. Today, there is no shortage of sources from which real-time price data\ncan be compiled and analyzed by private actors. Enormous corporations like\nAmazon and Wal-Mart must be keeping track of prices across a…",
  "data/reddit-stocks/r/investing/comments/nbkfox/abnb_price_has_been_weak_and_how_low_you_think.json": "Experts:\n\nI have been watching ABNB price movement for a while, and it has been trending\nlower since Feb 2021. The price moved from $200ish to $134. I initially\npurchased ABNB at $149ish and wanted to add more. How low do you think ABNB will\nbe? According to a Motley Fool article, ABNB sold…",
  "data/reddit-stocks/r/investing/comments/nblr1d/baba_analysis_for_alibaba_after_earnings.json": "Most Recent Earnings as of 05/13/2021 (CNBC\n[https://www.cnbc.com/2021/05/13/alibaba-earnings-q4-net-loss-after-2point8-billion-antitrust-fine.html]):Price\nat the time of posting: $206.89\n\nRevenue: 187.39 billion ($28.6 billion) vs. 180.41 ($27.96 billion) billion yuan\nestimated, up 64% year-over…",
  "data/reddit-stocks/r/investing/comments/nbqj5j/the_role_of_bonds_in_a_portfolio.json": "Sorry to bring this up again. I've always believed that despite their low\nreturns, bonds had a role to play in a balanced portfolio. Either to dampen\nvolatility, provide something to rebalance against during the equity dips,\nimprove risk-adjusted returns due to low correlations to lever an…",
  "data/reddit-stocks/r/investing/comments/nbxa4m/a_reckoning_for_tech_202021_ipos_coinbase.json": "Note: this post has been expanded from the 5 companies in the title to 11\ncompanies also including Snowflake, Airbnb, Qualtrics, Affirm, Deliveroo and\nOpendoor.\n\n11 of the biggest COVID tech IPOs in 7 different categories (cloud, crypto, gig\neconomy, app economy, e-commerce, fintech, and real…",
  "data/reddit-stocks/r/investing/comments/nc7ui9/agfy_dd_sectorwide_weakness_has_tossed_a.json": "Introduction\n\nHi everyone. I wanted to do this writeup to talk about an exciting stock I’m\nheavily invested in. First, a disclaimer: I’m not an expert, I have a position\nand may add or sell, and you should do your own DD! With that out of the way\nlet’s talk about Agrify.\n\nMany successful stocks take…",
  "data/reddit-stocks/r/investing/comments/ncc7gx/23_of_teslas_q1_earnings_were_from_bitcoin.json": "Title says it all.\n\nTesla's earnings in the first quarter were $438 million.\n\n$101 million (23%) of that came from selling Bitcoin for profit.\n\nThe other interesting part is that it would have been an earnings miss without\nthe trading.\n\nDid one make the other happen?\n\nConsidering the recent news…",
  "data/reddit-stocks/r/investing/comments/ncp9na/lyn_schwartzer_on_inflation_trends.json": "https://seekingalpha.com/article/4426754-investing-with-inflation-150-years-data\n\nSay what you want about Seeking Alpha, but this writer is generally considered\nthe most analytical author there and in no way limits her team's work to Seeking\nAlpha. I notice some people don't like the website, which…",
  "data/reddit-stocks/r/investing/comments/ndd7oo/calculating_intrinsic_value_personal_price.json": "I'm fairly new to the game, but I'm starting to notice on this sub that some\npeople express \"anti- intrinsic-value\" sentiments, such as...\n\n * \"I don't do DCFs\"\n * \"Nobody can predict where the market will go\"\n\nI've been trying to follow along and learn from Aswath…",
  "data/reddit-stocks/r/investing/comments/nder9c/us_how_will_a_lazy_portfolio_handle_the_inflation.json": "For example, how will a 3-fund or 4-fund portfolio weather the increased\ninflation we are starting to see?\n\nFor example, with the following vanguard etfs...\n\nvti vxus vnq bnd\n\nI would guess that vxus would do well purely from a US dollar inflation\nperspective since it is international and therefore…",
  "data/reddit-stocks/r/investing/comments/ndfhbz/googl_what_am_i_missing.json": "I am typically a value oriented investor and focus heavily on valuations.\nFundamentals on Google are sound: strong recurring revenue base, monopolistic\ntendencies, value add to customer, network effects, cross selling across revenue\nstreams etc. I find it hard to argue that Google is going anywhere…",
  "data/reddit-stocks/r/investing/comments/ndjmqd/how_to_check_if_profits_are_believable_an.json": "Focus on Cashflow over Profit to check if the Profits is believable.\n\nEarnings & Free Cash Flow, let's look at the relationship between them.\n\nThread (1/15)\n\n1) Earnings and free cash flow are two measures of the same thing,\n\nHow much money the company made from operating activities after deducting…",
  "data/reddit-stocks/r/investing/comments/ndmymd/the_weekly_dd_att_t_a_bond_proxy.json": "What if I told you there was a stock that offers a ~6-7% dividend AND has\npotential for revenue growth, is that something you would be interested in? That\ncompany is AT&T (T) and we’ll break-down some opportunities & challenges this\ncash-generating machine faces in the mid-to-long term.\n\nThe…",
  "data/reddit-stocks/r/investing/comments/ndow0k/simple_alibaba_intrinsic_value_caluclation.json": "Warren Buffet always said that a business is only worth how much cash you can\npull out of the business in the future discounted at the appropriate rate.\n\nKnowing this simple statement, we can look at how many shares of Alibaba are\noutstanding, which is approximately 2.76 Billion.\n\nWe then look at…",
  "data/reddit-stocks/r/investing/comments/ndp0q0/soros_bought_up_stocks_linked_to_bill_hwangs.json": "Soros Bought Up Stocks Linked to Bill Hwang’s Archegos Implosion - Bloomberg\n[https://www.bloomberg.com/news/articles/2021-05-15/soros-bought-up-stocks-linked-to-bill-hwang-s-archegos-implosion]\n\n> Billionaire George Soros’s investment firm snapped up shares of ViacomCBS,\n> Discovery and Baidu as…",
  "data/reddit-stocks/r/investing/comments/ndsznc/att_t_in_talks_to_combine_media_assets_with.json": "The Wall Street Journal reports that AT&T is in advanced talks to combine media\nassets, including CNN, with Discovery to consolidate their industry against\nincoming attacks from streaming.\n\nThe article states that T shareholders will maintain a large stake in the new\nentity. It’s unclear (at least…",
  "data/reddit-stocks/r/investing/comments/ne9xp2/elon_musk_clarifies_that_tesla_has_not_sold_any.json": "From Elon Musk's Twitter: \"To clarify speculation, Tesla has not sold any\nBitcoin\"\n\nhttps://twitter.com/elonmusk/status/1394170030741413888?s=19\n\nThis was after his previous tweet caused Bitcoin to fall c.20% where he implied\nTesla has sold their Bitcoin:\n\n@CryptoWhale: \"Bitcoiners are going to slap…",
  "data/reddit-stocks/r/investing/comments/nehv61/lockheed_martin_lmt_dd.json": "I should start off by saying that I am a dividend growth investor. I usually\nlike investing in stocks where the risk vs. reward is appealing. In my opinion,\nLockheed Martin fits into that category and is one of my largest positions.\n\nBASIC COMPANY INFORMATION\n\nLockheed Martin is aerospace and…",
  "data/reddit-stocks/r/investing/comments/nem9c3/the_worlds_largest_lithium_producer_sociedad.json": "Chilean equities are taking a big hit today after the country's voters\noverwhelmingly chose left-wing and independent candidates for the country's\nupcoming constitutional convention, rather than those favored by the ruling\ncenter-right government.\n\nMajor losers include Sociedad Química y Minera de…",
  "data/reddit-stocks/r/investing/comments/nenw6h/michael_burry_of_the_big_short_reveals_a_530.json": "https://www.cnbc.com/2021/05/17/michael-burry-of-the-big-short-reveals-a-530-million-bet-against-tesla.html\n\n\n\n * Michael Burry bought more than 800,000 Tesla put options contracts in the\n   first quarter worth $534.4 million, according to a filing with the U.S.\n   Securities and Exchange…",
  "data/reddit-stocks/r/investing/comments/nercxl/coinbase_announced_a_125b_private_offering.json": "Article:\nhttps://www.businesswire.com/news/home/20210517005881/en/Coinbase-Announces-Proposed-Private-Offering-of-1.25-Billion-of-Convertible-Senior-Notes-Due-2026/\n\n> Coinbase Global, Inc. (“Coinbase”) (Nasdaq: COIN) today announced its\n> intention to offer, subject to market conditions and other…",
  "data/reddit-stocks/r/investing/comments/nf5rgc/if_burry_is_right_about_the_index_fund_bubble.json": "Michael Burry is saying index funds are a bubble - they pump up equity values\nthrough passive investing which is disconnected from any kind of analysis, thus\nforming a bubble.\n\nNot saying he is correct, or not, but assuming he is correct what's a good way\nto achieve diversification (so you can 'set…",
  "data/reddit-stocks/r/investing/comments/nfcxdz/possible_play_on_discovery_in_light_of_the_coming.json": "Deal Structure:\n\nThe deal will be carried out in the form of the Reverse Morris Trust, which\nimplies spinning off WarnerMedia into a separate company, let's call it NewCo\n(no official name yet), which will then merge with Discovery. As a result of the\ntransaction, the share of the current AT&T…",
  "data/reddit-stocks/r/investing/comments/nfgipo/update_on_your_hometown_deli_in_new_jersey.json": "https://www.bloomberg.com/opinion/articles/2021-05-18/s-p-firm-forgot-to-update-the-xiv-index\n\nRelevant text:\n\n> How are things at the $2 billion deli?\n> \n> > Hometown International, the mystifying New Jersey deli company that is\n> > valued at nearly $100 million on the stock market — despite…",
  "data/reddit-stocks/r/investing/comments/nfhan1/why_do_passive_investors_frequently_say_past.json": "Passive investors say not to pick an outperforming mutual fund or ETF because\nyou don’t know that it will outperform in the future. However, they look at\nmarket returns from the past to predict or expect returns in the future. Just\nbecause businesses have grown at a rate of 10% annually since 1926,…",
  "data/reddit-stocks/r/investing/comments/nfusx5/shoeshine_boys_of_the_21st_century.json": "https://www.cnbc.com/2021/05/18/now-teenagers-can-trade-stocks-with-fidelitys-new-youth-investing-accounts.html\n\nThere's a famous story about JFK's father getting stock tips from a shoeshine\nboy, and realizing the market was overblown so he sold everything right before\nthe 1929 crash.\n\nWhether this…",
  "data/reddit-stocks/r/investing/comments/ng36dz/china_bans_financial_payment_institutions_from.json": "https://www.reuters.com/technology/chinese-financial-payment-bodies-barred-cryptocurrency-business-2021-05-18/\n\nThis is probably something a lot of people have been speculating, and i think it\nwould warrant discussion regarding the new IPO's and how the market will move\nforward with this.Keep in…",
  "data/reddit-stocks/r/investing/comments/ng39jw/the_long_straddle_explained_for_beginners_an.json": "Hey all, I’m doing a series where I breakdown and simplify popular option\nstrategies while trying to be as concise yet comprehensive as possible. For\ntoday, we’ll be breaking down the Long Straddle Option Strategy as it has come\nto my attention that TSLA has been edging closer to a point where this…",
  "data/reddit-stocks/r/investing/comments/ng3im3/the_truth_about_tether_and_crypto_prices.json": "DISCLAIMER: This is not my post. I have researched tether a good bit and find\nthe information here true based on what I found but I did not take the time to\nwrite something like this. u/VodkaHaze [https://www.reddit.com/user/VodkaHaze/]\nWROTE THIS\n\nWhat's Tether?\n\nUSDT is a \"stablecoin\" -- a…",
  "data/reddit-stocks/r/investing/comments/ngavio/amd_announces_4_billion_share_repurchase_program.json": "https://finance.yahoo.com/news/amd-announces-4-billion-share-162100452.html\n\nSANTA CLARA, Calif., May 19, 2021 (GLOBE NEWSWIRE) -- AMD [https://www.amd.com/]\n(NASDAQ: AMD) today announced that its Board of Directors approved a new share\nrepurchase program. Under this program, the company intends to…",
  "data/reddit-stocks/r/investing/comments/ngscic/there_needs_to_be_legal_ramifications_for_this.json": "FaZe Kay (whoever he is) just posted this on twitter:\n\n\"Holy. Clucoin is going nuts. With the market in its current state, this is\ncrazy I’m gonna be watching this one for awhile #CluCoin (Not financial advice)\"\n\nA coin with a $500m valuation can easily fork out tens of millions to pay\ninfluencers…",
  "data/reddit-stocks/r/investing/comments/nh44p9/guggenheim_inflation_is_spiking_but_you_only.json": "https://www.guggenheimpartners.com/perspectives/macroeconomic-research/inflation-spiking-but-you-only-reopen-economy-once\n\n> Core CPI jumped to 3.0 percent year-over-year in April, the fastest pace since\n> 1996. While the base effect from low readings in April 2020 was widely\n> expected by markets,…",
  "data/reddit-stocks/r/investing/comments/nh7az0/the_fed_this_summer_will_take_another_step_ahead.json": "> The Federal Reserve will release a research paper this summer that explores a\n> move to a central bank digital currency.\n> \n> The moves of multiple countries, most prominently China, in the central bank\n> digital currency space has intensified talk about how aggressively the Fed\n> should…",
  "data/reddit-stocks/r/investing/comments/nhap36/oatly_jumps_in_debut_after_raising_14_billion_in.json": "https://www.bloomberg.com/news/articles/2021-05-19/oatly-is-said-to-price-ipo-at-top-of-range-with-markets-slumping\n\nOatly Group AB, the vegan food and drink maker, jumped in its debut after\npricing its initial public offering at the top of a marketed range.\n\nShares opened Thursday at $22.12 in New…",
  "data/reddit-stocks/r/investing/comments/nhbpf8/us_seeks_to_have_cryptocurrency_transfers_above.json": "U.S. Treasury seeks reporting of cryptocurrency transfers, doubling of IRS\nworkforce | Reuters\n[https://www.reuters.com/business/finance/us-treasury-says-can-shrink-7-trillion-tax-gap-by-10-over-next-decade-2021-05-20/]\n\n> The Biden administration's tax enforcement proposal would require that\n>…",
  "data/reddit-stocks/r/investing/comments/nhv1rp/is_supplying_ppe_directly_to_business_the_way.json": "PPE is becoming much more of a B2B industry, with businesses in need of face\nmasks and other gear to keep operations running smoothly while restrictions are\nlifted for the general public. This is especially true in states like NY where\nrestrictions are tighter than Miami.\n\nAs the CDC loosens fask…",
  "data/reddit-stocks/r/investing/comments/nhwhxu/nyt_soaring_prices_herald_boom_time_for_steel.json": "> For decades, the story of American steel had been one of job losses, mill\n> closures and the bruising effects of foreign competition. But now, the\n> industry is experiencing a comeback that few would have predicted even months\n> ago.\n> \n> Steel prices are at record highs and demand is surging, as…",
  "data/reddit-stocks/r/investing/comments/ni2mjv/nvidia_proposes_4for1_stock_split.json": "NVIDIA (NVDA) said Friday its board has approved a four-for-one split of its\ncommon stock in the form of a stock dividend.\n\nThe computer systems design services company said the move would make stock\nownership more accessible to investors and employees. The dividend is\nconditioned on shareholder…",
  "data/reddit-stocks/r/investing/comments/ni2sjd/invest_like_the_norwegian_oil_fund.json": "(Scroll down for tl;dr)\n\nHave you ever heard of the Norwegian State Fund? No? Not only is it the largest\nfund in the world, but it is also considered one of the most cleverly managed.\nHe has built a huge fortune from virtually nothing through constant, low-risk\ninvesting. His strategy has proven…",
  "data/reddit-stocks/r/investing/comments/nigsd4/nano_dimension_has_as_much_cash_as_market_cap.json": "Nano Dimension Ltd., together with its subsidiaries, provides additive\nelectronics in Israel and internationally. Its flagship product is the\nproprietary DragonFly lights-out digital manufacturing (LDM) system, a precision\nsystem that produces professional multilayer circuit-boards, radio…",
  "data/reddit-stocks/r/investing/comments/nikmbr/whats_the_disadvantage_if_any_in_using_a_fund.json": "As the title says, what is the disadvantage, if any, in using a fund like\nvanguards NJ Long-term tax-exempt fund (VNJTX) (I happen to live in NJ) or the\nlike? Historical returns are about the same as a normal bond fund, but are tax\nexempt both at federal and state level. Seems like an obvious winner…",
  "data/reddit-stocks/r/investing/comments/nipews/what_is_the_difference_between_patience_and.json": "Two of the popular advice are:\n\n 1. Be patient during some losses and not sell position at the first sign of\n    trouble. If you are an investor, hold it patiently for years.\n\n 2. Don't be married to your position. If a stock is losing you money, exit it.\n\nThese 2 seem a bit contradictory to me.…",
  "data/reddit-stocks/r/investing/comments/nixiio/dividend_stocks_you_would_buy_if_all_equities.json": "What if a credit related event caused liquidity to dry up. What dividend paying\nstocks would you buy if there was a 60% haircut on nearly all companies? Leading\nto dividend yields going up (assuming dividends aren't cut). I would try to\navoid companies with debt financed dividend (say Exxon). The…",
  "data/reddit-stocks/r/investing/comments/nixvku/most_stock_pickers_loses_to_the_index_just_buy.json": "If you invest in the best-known index fund, the Tracker Fund 2800.HK, 10 years\nago, you are looking at ~23% + 8.01 HKD dividend per share.\n\nInflation at 2% p.a. is about 22%.\n\nMore details here:\nhttps://selfprofessednerd.blogspot.com/2021/05/most-stock-pickers-loses-to-index-just.html\n\nGiven the…",
  "data/reddit-stocks/r/investing/comments/njg0vr/why_or_what_is_the_justification_for_hanging_on.json": "So Cathie Wood,\n\nI like her mind, and I think she is campaigning for a cool sector of the world;\ndisruptive and innovative technology.\n\nNow in 2020, the market and social structure was set up that her ETF thrived.\nNow in 2021, the market is not doing so good and her ARRK investment is not\ndoing so…",
  "data/reddit-stocks/r/investing/comments/njlara/does_the_market_still_do_better_overnight_than.json": "I was re-reading a post I'd bookmarked here\n[https://money.stackexchange.com/questions/125340/why-do-most-of-the-stock-markets-gains-occur-overnight-it-has-an-overall-loss]\nthat discusses a trend, up to that point at least, where almost all of the\nmarket's gains happen overnight, as opposed to…",
  "data/reddit-stocks/r/investing/comments/njy53z/cnbc_pro_goldman_starts_coinbase_with_a_buy.json": "Investors should ride through volatility in the crypto space by buying shares of\nCoinbase, according to Goldman Sachs.\n\nAnalyst Will Nance initiated coverage of the cryptocurrency exchange on Monday\nwith a buy rating, saying in a note to clients that Coinbase is the best way to\ngain exposure to…",
  "data/reddit-stocks/r/investing/comments/nk02im/inflation_risk_is_now_the_consensus_trade_it_is.json": "According to BofA's monthly Global Fund Manager Survey published last Tuesday,\n\"higher inflation is now the consensus.\" And furthermore \"inflation is now again\nthe biggest risk for markets,\" as initially identified by 35% of the survey's\n194 respondents who manage a combined $592 billion worth of…",
  "data/reddit-stocks/r/investing/comments/nklmfn/the_single_greatest_edge_an_investor_can_have.json": "“The single greatest edge an investor can have is a long-term orientation. In a\nworld where performance comparisons are made not only annually and quarterly but\neven monthly and daily, it is more crucial than ever to take the long view. In\norder to avoid a mismatch between the time horizon of the…",
  "data/reddit-stocks/r/investing/comments/nl640m/sold_my_company_for_750k_but_its_a_promissory.json": "Hey gang\n\nI sold my company in December and would love your advice.\n\nBasically I sold i for about $750k but it's all based on earn-outs on the\ncompanies future revenue. I don't have to do anything other than just receive\nchecks for the next 4 years.\n\nI have a promissory note for the value but I'd…",
  "data/reddit-stocks/r/investing/comments/nli79t/amazon_will_buy_mgm_film_and_television_in_845.json": "> The MGM deal is Amazon’s second largest in its history, after its $13.7\n> billion acquisition of Whole Foods in 2017. Whole Foods in 2017 reported\n> around $16 billion in revenue in 2017, the same year MGM reported $1.3 billion\n> in revenue. Those numbers, along with the fact that analysts valued…",
  "data/reddit-stocks/r/investing/comments/nmbklj/richard_branson_confirms_that_he_is_going_through.json": "Source: interview confirming Branson going through training\n\nhttps://youtu.be/BUi09sd9HsQ\n\nSo a few days ago Virgin Galactic had a successful test flight to the edge of\nspace with is VSS Unity spaceship. Afterwards Richard Branson did a interview in\nwhich he confirms he is going through training for…",
  "data/reddit-stocks/r/investing/comments/nmetge/apple_represents_2013_of_vanguards_information.json": "I was looking at Vanguard Information Technology (VGT) holdings this afternoon,\nand was shocked to find that although there are 331 companies in this ETF, 36%\nof the entire fund consists of just two companies: Apple and Microsoft. See\nhere:…",
  "data/reddit-stocks/r/investing/comments/nn19q9/nasdaq_approves_high_tides_application_to_list.json": "https://www.prnewswire.com/news-releases/nasdaq-approves-high-tides-application-to-list-301301434.html\n\n * High Tide becomes the first major publicly traded cannabis retailer to\n   announce it has been approved to trade on Nasdaq.\n\n * High Tide shares expected to begin trading on Nasdaq on June 2nd,…",
  "data/reddit-stocks/r/investing/comments/nn4wvf/why_i_like_stic_soon_to_be_bark_aka_barkbox_risk.json": "Disclosure I own shares at $10.50.\n\nBarkBox is a spac that today approved the merger. The Ticker $stic will be $bark\non June 2nd.\n\nMany of these subscription box companies get a bad reputation because there were\nso many grocery ones that lose billions for years and the pet ones made no money\nbecause…",
  "data/reddit-stocks/r/investing/comments/nnb85e/what_is_your_due_diligence_criteria.json": "I assume when most of us started investing, it went something like; buying the\ncool stock, buying a stock that represents an ideal, buying a stock of what you\nthink is a good business, learning about earnings, learning about the PE ratio,\nlearning about a bunch of ratios, learning about financial…",
  "data/reddit-stocks/r/investing/comments/nnk43e/this_inflation_wave_is_not_driven_by_growth_and.json": "I'm going to explain how I came to these conclusions, and although for some of\nyou it may be obvious, I think that it is important to re-emphasize the effects\nof inflation.\n\nInflation can be good, bad or neutral. The logic behind this is pretty simple:\n\nIf inflation is driven by productive growth,…",
  "data/reddit-stocks/r/investing/comments/nnr3pu/qualcomm_qcom_whats_the_bear_case.json": "I’m big into Qualcomm ($QCOM). I think they’re massively undervalued for their\ncurrents prospects, but also for their continued growth potential and their\nupcoming superiority in the 5G market (I’ll leave it at that so this doesn’t get\nmistaken for a pump post).\n\nBasically, I know the bull case. I…",
  "data/reddit-stocks/r/investing/comments/nnv7be/arkk_sells_leverage_not_alpha_and_they_overcharge.json": "Wanted to get all your thoughts on this, I’m just kind of thinking out loud and\nwould welcome a different opinion!\n\nLooking at ARKK annual percentile returns (via Morningstar, performance\npercentile vs peers):\n\n2015: 75th 2016: 98th 2017: 1st 2018: 17th 2019: 57th 2020: 1st 2021: 100th\n\nARKK is…",
  "data/reddit-stocks/r/investing/comments/nodibt/does_anyone_buy_exclusively_sector_etfs.json": "I've been adding more of the X-Etf's in the last month; XLF, XME, XLI, XLE, XLT,\netc. I do own several stocks I have conviction about, but I'm thinking of\ntrimming and going into more sector specific ETFs.\n\nIs this completely pointless? Does it just make sense to just buy in SPY?\n\nI've been able to…",
  "data/reddit-stocks/r/investing/comments/noxl2g/should_i_invest_20_000_in_sp_500.json": "I am new to the investing world. I have saved 20k over a year and I'm looking\nfor a safe/small risk investment where I can get some passive income. Is S&P a\ngood option? Do you know any better or more profitable options with small risk\nchances? I've been also investing in crypto for fun, not looking…",
  "data/reddit-stocks/r/investing/comments/nozzic/if_i_am_not_from_us_should_i_still_invest_in_sp.json": "The Question is self explanatory but are there extra taxes and stuff or i can\nbenefit the average 10% return by DCAing over 10-15 years? I am from a third\nworld country so basically there are not many good global institutions yet and\nhence the ETF are not very interesting and since the beginning i…",
  "data/reddit-stocks/r/stocks/comments/n21p40/green_investing.json": "Hey everyone! I have been looking into investing in the green/carbon neutral\nindustry and i have actually struggled to find some proper stocks or ETFs that\nare actually sustainable. The stocks that I did stumble on are nano stocks such\nas DGB Group NV (ticker:DGB), in which I have actually done a…",
  "data/reddit-stocks/r/stocks/comments/n24g0m/pltr_ceo_alex_karp_recent_selling_breakdown.json": "First of all, this is not FUD. I'm just trying to break down the given numbers\non Karp's recent stock sales.\nAlex Karp has sold over 54 million shares so far according to\nhttp://openinsider.com/insider/Karp-Alexander-C./1823951According to\nhttps://fintel.io/i/karp-alexander-c his last file date…",
  "data/reddit-stocks/r/stocks/comments/n24gpf/my_allweather_portfolio_for_this_crazy_market.json": "I posted this in the thread but got no response. :( Maybe if I post it here and\nelaborate it might be worthy of feedback and discussion. Here it goes.\n\nSo firstly, this wasn't exactly my main inspiration, but retroactively I did\nrealize that my portfolio was, in a way, similar to Ray Dalio's All…",
  "data/reddit-stocks/r/stocks/comments/n2705g/best_sector_for_the_next_5_years.json": "Alright so i know a lot of people like EV’s but I also think the energy sector\nwill do well under Biden. I dont have the most extensive knowledge of finance,\njust picking up stuff as I go. But what sectors do you like now and think will\ndo well in the next 5-10 years?\n\nEdit: Thanks so much for all…",
  "data/reddit-stocks/r/stocks/comments/n2hzd3/i_analyzed_all_the_motley_fool_premium.json": "Preamble: There is no way around it. A vast majority of us Redditors absolutely\nhate The Motley Fool. I feel that it’s justified, given their clickbait titles\nor “5 can't miss stocks of the century” or turning 1,000 into 100,000 posts\ndesigned just to drive traffic to their website. Another Redditor…",
  "data/reddit-stocks/r/stocks/comments/n2ihgo/why_hasnt_robinhood_still_not_received_any_form.json": "This article contains the list:\nhttps://www.yahoo.com/lifestyle/robinhood-expands-trading-restrictions-50-225241993.html\n\nI know other brokerages restricted GME/AMC. But Robinhood's restricted list was\nway bigger and included stocks such as AMD, AAL, BYND, GM, IPOE, MRNA, and SBUX.\nI had got into…",
  "data/reddit-stocks/r/stocks/comments/n2n4gh/soon_all_car_manufacturers_are_going_to_be.json": "This is excluding new companies specialising in EV such as Tesla as they will\nnaturally grow as they enter the market.\n\nBut for the likes of let's say Volkswagen or Ford...\n\nPeople seem to dive at the chance to invest in these companies when they\nannounce their move into the EV market.\n\nHowever the…",
  "data/reddit-stocks/r/stocks/comments/n2nmdi/when_we_look_back_at_this_era_one_of_the_talking.json": "A company that lost $310 million last quarter, and has so far run up an\naccumulated deficit of $8 billion was able to privately place $1.15 billion of\n0% bonds\n[https://www.sec.gov/Archives/edgar/data/1564408/000119312521145731/d165819dex41.htm].\nThere was apparently so much demand for their…",
  "data/reddit-stocks/r/stocks/comments/n2ok5c/i_dont_understand_how_dividends_affect_a_stock.json": "I read today that if a stock is trading at 20.04 and pays a .04 dividend, on\nex-dividend day the stock will adjust down to 20.00 to reflect that dividend no\nlonger being available to buyers.\n\nI got down voted to hell for saying it's not necessarily 1:1 like that, but\nactually now I'm just confused.…",
  "data/reddit-stocks/r/stocks/comments/n2qdd8/selling_apple_shares_was_probably_a_mistake_and.json": "Source\n[https://finance.yahoo.com/news/selling-apple-shares-last-year-was-probably-a-mistake-buffett-195811746.html]\n\nWarren Buffett conceded that selling some shares of Apple (AAPL\n[https://finance.yahoo.com/quote/AAPL?p=AAPL&.tsrc=fin-srch]) in Berkshire\nHathaway's portfolio last year was likely a…",
  "data/reddit-stocks/r/stocks/comments/n2ud90/about_87_of_companies_in_the_sp_have_beaten.json": "https://www.reuters.com/business/wall-st-week-ahead-blow-out-us-earnings-suggest-market-has-room-run-2021-04-30/\n\nArticle for those who want to scroll through quickly:\n\nU.S. companies are leaping above expectations on first-quarter earnings, giving\ninvestors stronger confirmation that profit growth…",
  "data/reddit-stocks/r/stocks/comments/n2vy7k/financial_post_had_a_great_piece_on_well_health.json": "Most analysts I have ever seen respond to a short report...\n\nhttps://financialpost.com/investing/short-sellers-dont-always-win-and-shouldnt-get-the-glory\n\nReally sheds light on the current market we are in. \" If you own a great company\ntheir is no reason to worry\" . Excited to see what this company…",
  "data/reddit-stocks/r/stocks/comments/n2we74/which_faamg_stocks_do_you_think_have_the_most.json": "Not asking for recommendations but curious to hear thoughts. FAAMG, as Goldman\nSachs defines as Facebook, Amazon, Apple, Microsoft, and Google, (Not to be\nconfused with Jim Cramer's FAANG, which substitutes Netflix for Microsoft) have\nbeen among the most dominant players in terms of growth, volume…",
  "data/reddit-stocks/r/stocks/comments/n2ze6w/oil_play_for_the_summer.json": "Goldman Sachs is predicting that the oil price can hit 80 after summer\nreopening. Which of the ETF's are good for short term play and tracks oil price?\nOr companies like XOM or BP will be good for 3-4 months?",
  "data/reddit-stocks/r/stocks/comments/n34rkx/wall_street_week_ahead_for_the_trading_week.json": "Goooooood Sunday morning to all of you here on r/stocks [/r/stocks]. I hope\neveryone on this sub made out pretty nicely in the market this past week, and is\nready for the new trading week ahead.\n\nHere is everything you need to know to get you ready for the trading week\nbeginning May 3rd,…",
  "data/reddit-stocks/r/stocks/comments/n38c3h/how_would_you_feel_about_the_stock_market_being.json": "So, I’ve had a thought recently about how it would be if the market was open\n24/7.\n\nI think there would be sufficient liquidity for most of the time; the US market\nis one of the most extensive and prominent in the world. In fact, I live in the\nUK and I actually like the US market more than the UK…",
  "data/reddit-stocks/r/stocks/comments/n392a4/twitter_twtr_has_done_basically_nothing_in_its.json": "I started investing in late 2013 and TWTR was the hot IPO at the time. I\ndistinctly remember buying a few shares at $57 figuring I'd get in on the ground\nfloor of what was already a culturally-significant company.\n\nAmazingly, over 7 years later the stock is trading lower than where I bought it\nall…",
  "data/reddit-stocks/r/stocks/comments/n3c8mo/clov_hype_and_those_hyping_it.json": "CLOV might be the greatest play in the history of investments. However, I've\nstarted looking at the comment history of some of the profiles hyping this stock\nand it's all comments that have come in the past couple of months, and all of\nthem are devoted to CLOV stock jumping.\n\nNo additional comments,…",
  "data/reddit-stocks/r/stocks/comments/n3ppiw/tsmc_just_announced_they_expect_to_catch_up_with.json": "I currently hold Ford (and a couple other pure EVs) as longer-term auto/EV\nplays. FORD gave up most of its 2021 gains after lowered guidance for the rest\nof 2021 at earnings on 4/28 (due partly to chip contstraints).\n\nHopefully this news from TSMC today that they may start catching up with…",
  "data/reddit-stocks/r/stocks/comments/n3tdg7/palantir_hires_former_ibm_watson_health_exec_as.json": "https://www.cnbc.com/2021/05/03/palantir-hires-former-ibm-watson-health-exec.html\n\nPalantir has hired its first U.S. government chief medical officer, a former\nexecutive from IBM's Watson Health business, as the data analytics company\ndoubles down on its life sciences business.\n\nWhile the company…",
  "data/reddit-stocks/r/stocks/comments/n3ublk/iron_ore_hitting_all_time_highs_and_continuing.json": "Thats right, iron ore is at all time highs and theres no signe of it stopping.\n\nShort term play on this is Lif\n\nLabrador iron ore royalties. They have s 15.1% stake in Iron Ore Canada.\n\nAnd have a 7% off the top royalty.\n\nMine life is 24 years long, so you can hold this for a couple years and…",
  "data/reddit-stocks/r/stocks/comments/n3uk2j/gamestop_completes_voluntary_early_redemption_of.json": "Elimination of Long-Term Debt Further Strengthens Company’s Balance Sheet and\nSupports Transformation\n\nGRAPEVINE, Texas, May 03, 2021 (GLOBE NEWSWIRE) -- GameStop Corp. (NYSE: GME)\n(“GameStop” or the “Company”) today announced that on April 30, 2021 it\ncompleted its voluntary early redemption of…",
  "data/reddit-stocks/r/stocks/comments/n3vqmp/uranium_market_update_one_of_the_biggest.json": "To say we had an interesting few weeks in the uranium sector would be a massive\nunderstatement. We have seen new geopolitical support for nuclear power and a\nmassive new catalyst in the form of the newly formed Sprott Uranium Trust (more\non that later). There was also a new version released of the…",
  "data/reddit-stocks/r/stocks/comments/n470ko/here_is_a_market_recap_for_today_monday_may_3_2021.json": "PsychoMarket Recap - Monday, May 3, 2021\n\nStocks traded mixed, with the S&P 500 (SPY) and Dow Jones (DIA) ticking higher\nwhile the tech-Nasdaq (QQQ) declined. The SPY rose 5% in April, for the best\nperformance since November of last year. Following a rotation into cyclical and\nreopening stocks at…",
  "data/reddit-stocks/r/stocks/comments/n4bbcm/stop_panicking_come_up_with_a_plan.json": "I know some of you are tired of these \"it's ok everything will be ok\" posts, but\nthe daily thread is a mess. Browsing it would make some of you think that the\nmarket is down 10%.\n\nIf you're looking at your portfolio and it's really doing a number on your\nstomach, you need to reevaluate your…",
  "data/reddit-stocks/r/stocks/comments/n4e3w6/why_is_nvda_worth_so_much_more_than_amd.json": "I'm newer to the game so maybe someone can help me with this. I am sure I am\nmissing something basic but, looking at their revenue, NVDA is not much more\nthan AMD. NVDA shows $5 billion for quarterly revenue January 21 and AMD is\nshowing $3.44 billion for the same time period. So roughly, 1.5 times…",
  "data/reddit-stocks/r/stocks/comments/n4k6cm/rstocks_daily_discussion_technicals_tuesday_may.json": "This is the daily discussion, so anything stocks related is fine, but the theme\nfor today is on technical analysis (TA), but if TA is not your thing then just\nignore the theme and/or post your arguments against TA…",
  "data/reddit-stocks/r/stocks/comments/n4o8yb/why_should_we_even_bother_investing_in_growthtech.json": "Let's assume the fed is right and we don't raise interest rates until ~2023,\nit's my understanding that raising rates is going to send growth/tech stocks\ndown because money isn't as cheap as it used to be. Under that assumption,\nshouldn't that mean it would be smarter to sit these next few years out…",
  "data/reddit-stocks/r/stocks/comments/n4r3k8/why_is_the_market_down_so_much_today.json": "Holy shit. The nsadaq is down a whole 2.5% right now. SP500 is almost 1.5 and\nthe Dow is down a little under 1%. Whats going on? I know the market is\novervalued right now, but I didn’t think it would drop this fast or this soon.\nIs there another reason so many people sold today?",
  "data/reddit-stocks/r/stocks/comments/n4ryy2/every_time_the_fed_talks.json": "The market commits suicide. This will happen every first week of every new month\nuntil the market corrects itself to pre pandemic valuations. By Oct. the market\nwill look like it crashed as compared to the start of this new year.\n\nFear not the color red. I'm prepared to look at -99% unrealized…",
  "data/reddit-stocks/r/stocks/comments/n4thts/general_electric_shareholders_reject_ceo_pay.json": "Sane vote imo. \"A majority of shareholders at the General Electric Co annual\ngeneral meeting rejected the pay packages for named executive officers,\nincluding CEO Larry Culp, whose compensation for 2020 tallied $73.2 million.\"\nHow much money do these CEOs really…",
  "data/reddit-stocks/r/stocks/comments/n4wwl5/here_is_a_market_recap_for_today_tuesday_may_4.json": "PsychoMarket Recap - Tuesday, May 4, 2021\n\nStocks fell on Thursday following a mixed session yesterday, as the selloff in\ntechnology stocks accelerated following remarks from Treasury Secretary Janet\nYellen. Market participants wait for the next set of corporate earnings reports\nand economic data,…",
  "data/reddit-stocks/r/stocks/comments/n4x3hy/is_the_geo_group_inc_geo_stock_a_smart_investment.json": "Over the past year the S&P 500 is higher by 48.80% while GEO is lower by\n-53.25%. GEO earned $0.94 a per share in the over the last 12 months, giving it\na price-to-earnings ratio of 6.17.\nHowever, the GEO Group Inc (GEO) stock is lower by -53.25% over the last 12\nmonths, and the average rating from…",
  "data/reddit-stocks/r/stocks/comments/n4xq7t/dont_be_me_stay_strong.json": "I think I am just writing to vent.\n\nThe past 4 months have been a learning lesson for me.\n\nI finally started to understand that this is not as easy as some people make it\nout to be.\n\n\n\nStarted in Dec. Was sure solar (TAN), Lithium great buys got into tech etc\n(ARKK).\n\nMid Feb was up 20%, cloud…",
  "data/reddit-stocks/r/stocks/comments/n50zpg/yellen_says_i_didnt_say_that.json": "https://www.bloomberg.com/news/articles/2021-05-04/yellen-says-spending-jump-could-mean-higher-interest-rates\n\nTreasury Secretary Janet Yellen said Tuesday afternoon she wasn’t forecasting\ninterest-rate increases to rein in any inflation spurred by President Joe\nBiden’s proposed spending, clarifying…",
  "data/reddit-stocks/r/stocks/comments/n59bno/how_can_people_possibly_build_any_sort_of_passive.json": "I am doing DD on dividend stocks as a new investor. I am a little lost starting\nout. So, let's take Lowes as an example, a company that has consistently payed\ndividends for over 50 years.\n\nRight now their cost per share is 200.30$\n\nLowe's Companies pays an annual dividend of $2.40 per share, with a…",
  "data/reddit-stocks/r/stocks/comments/n5a1vy/if_you_inherited_200000_today_how_would_you_go.json": "Still learning about the market and diversification. Purely theoretical, but\nwould be greatful for others thoughts. Whether it be bonds,stocks,etfs and how\nto balance the portfolio / whether to hold a certain amount of cash for\nopportunities etc.\n\nAny opinions would be great!",
  "data/reddit-stocks/r/stocks/comments/n5bwii/rstocks_daily_discussion_wednesday_may_05_2021.json": "These daily discussions run from Monday to Friday including during our themed\nposts.\n\nSome helpful links:\n\n * Finviz [https://finviz.com/quote.ashx?t=amd] for charts, fundamentals, and\n   aggregated news on individual stocks\n * Bloomberg market news [https://www.bloomberg.com/markets]\n *…",
  "data/reddit-stocks/r/stocks/comments/n5czoz/asts_a_revolution_in_5g.json": "Today, I will cover $ASTS, AST Space Mobile\n[https://npa-corp.com/wp-content/uploads/AST_SpaceMobile_Investor_Presentation_Public_12-15-20.pdf].\nThe company will provide 5G capabilities to regular cellphones from space, they\ntarget the 5 billion phones moving in and out of coverage every day or…",
  "data/reddit-stocks/r/stocks/comments/n5g8si/what_is_a_good_way_to_learn_about_those_stocks.json": "I started dipping my toes into the stock market back in Feb when the whole craze\nblew up and it made me a small but good profit. All this time I only really\ninvested into companies that are big and everyone recognizes (Car manufacturers,\ncell phone companies, etc.) Where can I find information about…",
  "data/reddit-stocks/r/stocks/comments/n5gg3f/the_6_phase_model_of_how_this_uranium_bull_market.json": "The recent run up in equities has people questioning if they missed the top, if\nthey are too late and if this was already the end of a young bull market in\nuranium. This couldn’t be further from the truth, as a long term price per pound\nof uranium is still in need of between 50 and 60 dollars. If it…",
  "data/reddit-stocks/r/stocks/comments/n5i8o7/asts_a_revolution_in_5g_resubmit.json": "Resubmit: Sorry mods, I made a mistake and provided a link to a youtube channel.\nMoreover, I added a Risk section as it was lacking before.\n\nToday, I will cover $ASTS, AST Space Mobile\n[https://npa-corp.com/wp-content/uploads/AST_SpaceMobile_Investor_Presentation_Public_12-15-20.pdf].\nThe company…",
  "data/reddit-stocks/r/stocks/comments/n5ikkk/peloton_recalls_treadmills_after_safety_warnings.json": "https://nyti.ms/2QZBxiN\n\nPeloton is recalling its Tread+ and Tread treadmills, the at-home fitness\ncompany said on Wednesday, less than a month after it fought the U.S. Consumer\nProduct Safety Commission as it warned that dozens of injuries and one death of\na child had been linked to the…",
  "data/reddit-stocks/r/stocks/comments/n5osas/no_one_knows_when_the_market_is_at_the_top.json": "As the Title Suggests, No One can accurately predict when the market is at the\ntop or when it will crash. If people knew, they certainly wouldn't share on\nReddit because they would be earning millions or billions of dollars.\n\nTiming the market is impossible and it's better to ride out the ups and…",
  "data/reddit-stocks/r/stocks/comments/n5pc5x/most_dont_beat_the_sp_500_index.json": "As many of you know, the S&P 500 Index is a great way to invest as it reduces\nall your individual stock risk also known as non-systematic risk and we have\nbeen lucky to have had some great years of a strong bull market.\n\nMost professionals don't beat the index and only a select few beat it and…",
  "data/reddit-stocks/r/stocks/comments/n5qbf7/here_is_a_market_recap_for_today_wednesday_may_5.json": "PsychoMarket Recap - Wednesday, May 5, 2021\n\nStocks reversed from yesterday’s technology-led selloff, with the Dow Jones\n(DIA) reaching a new intraday record high. Continuing the recent bout of\nvolatility, the three major indexes sold off in the last few hours of the market\nsession, with the Nasdaq…",
  "data/reddit-stocks/r/stocks/comments/n5r2wt/etsy_surpasses_q1_earnings_and_revenue_estimates.json": "> Etsy reported first-quarter results late Wednesday that toppled estimates on\n> the top and bottom lines. However, Etsy stock fell.\n> \n> The company reported adjusted earnings of $1 a share on revenue of $550.6\n> million. Analysts expected Etsy to report earnings of 88 cents a share on\n> revenue of…",
  "data/reddit-stocks/r/stocks/comments/n5r8nl/fastly_misses_earnings_and_cfo_to_leave.json": "Fastly stock dropped in the extended session Wednesday after the cloud-based\nonline content-services company reported a quarterly loss and outlook short of\nWall Street expectations and announced the departure of its financial chief.\n\nFastly also lower the guidance for the month of June. What do you…",
  "data/reddit-stocks/r/stocks/comments/n5rjpc/roblox_rblx_breaks_monthly_user_record_202_million.json": "https://gamerant.com/roblox-monthly-users-record-may-2021/\n\n\"Roblox metric blog RTrack has now reported that the game reached a new record\nof 202 million estimated users across the month of April. The impressive stat\nindicates that the game grew by 10 million users just since the previous month,\nand…",
  "data/reddit-stocks/r/stocks/comments/n5uz1x/anyone_else_extremely_bullish_on_disney.json": "Maybe I am biased because I love Marvel but Disney+ already surpassed 100+\nsubscribers within less than 2 years since it launched. I do think Disney will\nbe a fantastic growth stock for the next 10 years because of Disney+, they are\npumping out more and more content for the next 2 years compared to…",
  "data/reddit-stocks/r/stocks/comments/n5zbxh/im_up_80_yoy_and_learned_i_dont_know_anything.json": "I’m up a lot, but I’m closing out all my positions to start over.\n\nI thought I knew what I was doing, but after taking some graduate level finance\ncourses, I learned I didn’t actually know anything about assessing the\nfundamental value of a company, projecting future enterprise value, or even\nwhere…",
  "data/reddit-stocks/r/stocks/comments/n632xa/i_bought_into_goog_instead_of_googl_did_i_make_a.json": "I was trying to buy some Google shares and picked up GOOG instead of GOOGL\nwithout checking.\n( I simply assumed the more expensive one had voting rights , not that I care\nabout the vote at all )\n\nBut since GOOGL is Cheaper & has Voting rights. Would I be better off selling\nGOOG and repurchasing…",
  "data/reddit-stocks/r/stocks/comments/n63da7/rstocks_daily_discussion_options_trading_thursday.json": "This is the daily discussion, so anything stocks related is fine, but the theme\nfor today is on stock options, but if options aren't your thing then just ignore\nthe theme and/or post your arguments against options…",
  "data/reddit-stocks/r/stocks/comments/n65p5j/us_coast_guard_renews_partnership_with_palantir.json": "https://www.businesswire.com/news/home/20210506005437/en/U.S.-Coast-Guard-Renews-Partnership-with-Palantir-to-Fight-COVID-19\n\nMay 06, 2021 06:59 AM Eastern Daylight Time\n\nDENVER--(BUSINESS WIRE)--Palantir Technologies Inc. (NYSE:PLTR) today announced\nthe U.S. Coast Guard has extended its commitment…",
  "data/reddit-stocks/r/stocks/comments/n65x7r/i_started_investing_in_february_2021_how_do_i.json": "I didnt get to invest in 2020. I finally started in Feb this year after my\nfriends kept telling me how easy it was to make money in stock market all their\nstocks were up at least 50%. So I am not sitting on gains. With how the charts\non many of the tech/growth stocks look like. It is looking like I…",
  "data/reddit-stocks/r/stocks/comments/n6655y/us_space_forces_space_and_missile_systems_center.json": "https://www.losangeles.spaceforce.mil/News/Article/2592151/smc-awards-325-million-to-palantir-usg-inc-for-data-as-a-service/\n\nLOS ANGELES AIR FORCE BASE, Calif. -- The U.S. Space Force's Space and Missile\nSystems Center’s Cross-Mission Ground & Communications Enterprise (ECX) has\nawarded a firm…",
  "data/reddit-stocks/r/stocks/comments/n67yep/has_tech_got_you_down_consider_commodities_in.json": "Steel manufacturing companies are set to make record profits in the next few\nyears. Demand is up huge. The post-COVID boom is starting.\n[https://www.appraisalbuzz.com/biggest-construction-boom-since-2006-best-2-weeks-for-rates-in-a-year/]\nThe rotation out of tech is under way. And analysts are…",
  "data/reddit-stocks/r/stocks/comments/n69vbv/ark_funds_time_to_take_gains_and_move_elsewhere.json": "Any of us who have invested in the ARK funds have probably enjoyed some really\nnice gains over the past year or two but certainly over the last several months\nthese funds have faced a lot of downward movement.\n\nWhile I used to see 99% all positive feedback on the ARK funds now the pendulum\nhas swung…",
  "data/reddit-stocks/r/stocks/comments/n6a4a2/how_you_should_start_with_investing.json": "I've seen a ton of posts recently from new investors asking how they should get\nstarted in investing along with a lot of posts from people who have just gotten\ninto the stock market, lost a lot of money and are now panicking. As such I\nfigured I'd just make a quick post to recommend what I feel is…",
  "data/reddit-stocks/r/stocks/comments/n6byd0/viac_is_very_undervalued_in_an_overvalued_market.json": "VIAC is massively undervalued following a hedge fund selloff and even after an\namazing earnings report.\n\nAs of right now, VIAC has a PE ratio of about 10.5, in a market where all of its\ncompetitors in the industry have an average of 44. VIAC's quarterly report just\ncame in today, and earning were…",
  "data/reddit-stocks/r/stocks/comments/n6dl5x/new_investors_the_average_return_of_the_stock.json": "2020 was an unprecedented year. New investors (of which there are tens of\nmillions now) need to know that on average the return of the market is around\n10% (it ranges from 7%-11% depending on your metric, but for simplicities sake\nwe'll average it to 10%).\n\nIf you have gone beyond that 10%, that is…",
  "data/reddit-stocks/r/stocks/comments/n6gx5p/here_is_a_market_recap_for_today_thursday_may_6.json": "PsychoMarket Recap - Thursday, May 6, 2021\n\nRemarkably, despite many individual companies pulling back steeply today, the\nthree major indexes finished the day positive, driven by gains in financial\nstocks and stability in mega-caps. Growth stocks and more speculative plays have\nbeen hit hard by a…",
  "data/reddit-stocks/r/stocks/comments/n6hl0h/cloudflare_net_announces_first_quarter_2021.json": " * First quarter revenue totaled $138.1 million, representing an increase of 51%\n   year-over-year\n\n * Record dollar-based net retention of 123%, representing an increase of 600\n   basis points year-over-year\n\n * Strong large customer growth, with a record addition of roughly 120 large\n   customers…",
  "data/reddit-stocks/r/stocks/comments/n6iw9i/buckle_up_ladies_and_gentlemen_fed_warns_of.json": "Per CNBC:\n\nIn its semiannual Financial Stability Report, the central bank said that while\nthe system overall has remained largely stable even through the Covid-19\npandemic, future dangers are rising, in particular should the aggressive run on\nstocks tail off.\n\n“High asset prices in part reflect the…",
  "data/reddit-stocks/r/stocks/comments/n6keio/the_market_is_unpredictable_and_stocks_going_down.json": "Since the March lows, it seems a lot of the stocks have gone up +100% in one\nyear which is very abnormal and does not happen in \"regular\" years. We have seen\nthis, especially in the tech sector. We have seen a bit of a pull back in the\ntech sector with stocks going down 10- 20% or more since…",
  "data/reddit-stocks/r/stocks/comments/n6l1ul/flashback_to_feb_2021_the_king_of_spacs_wants_you.json": "Just a great reminder (or maybe 'learning lesson') of how some of these\ncharacters people on this sub cling to often turn out to be full of BS. Luckily\nhe's been quite quiet as of late, because as this tweet\n[https://twitter.com/TheStalwart/status/1390341185202540552] shows, his\nperformance is…",
  "data/reddit-stocks/r/stocks/comments/n6oae5/fidelity_brokerageminimum_you_must_leave_in_your.json": "TIL. Couldn't find this through Googling, found it out through a call after 1/2\nhour of hold.\n\nIt should be public information, and this seemed as good a place as any to\ndeposit it.\n\nTransfer takes about 5 days, so if you're leaving e.g. a security, make sure it\nwill be still worth $150 by then.",
  "data/reddit-stocks/r/stocks/comments/n6sq76/palantir_technologies_and_the_royal_navy_extend.json": "https://www.businesswire.com/news/home/20210506006341/en/Palantir-Technologies-and-the-Royal-Navy-Extend-Contracts\n\nhttps://twitter.com/PalantirTech/status/1390562068315656194?s=20\n\nMay 07, 2021 02:00 AM Eastern Daylight Time\n\nLONDON--(BUSINESS WIRE)--Palantir Technologies Inc. (NYSE:PLTR) announced…",
  "data/reddit-stocks/r/stocks/comments/n6t2o7/ibm_breakthrough_on_2nm_technology.json": "IBM annouced that they had a breakthrough on 2nm technology. They said there\nwill be advantages to this technogy summed up as:\n\nThe potential benefits of these advanced 2 nm chips could include:\n\nQuadrupling cell phone battery life, only requiring users to charge their\ndevices every four daysii.…",
  "data/reddit-stocks/r/stocks/comments/n6ukdj/rstocks_daily_discussion_fundamentals_friday_may.json": "This is the daily discussion, so anything stocks related is fine, but the theme\nfor today is on fundamentals, but if fundamentals aren't your thing then just\nignore the theme and/or post your arguments against fundamentals…",
  "data/reddit-stocks/r/stocks/comments/n6x779/why_does_the_market_close_and_open.json": "I’m sure this is a dumb question but it has been floating around in my head this\nmorning. Is there a reason that requires the market to open and close each day?\n\nMy thinking is that that the market opens and closes to reflex the 9-5 workday,\nwhen someone actually physically needed to execute trades.…",
  "data/reddit-stocks/r/stocks/comments/n6y5at/us_job_growth_misses_all_estimates_unemployment.json": "Highlights-\n\n * April Payrolls increased 266,000 after a downwardly revised 770,000 March\n   gain, according to a Labor Department report Friday that fell well short of\n   the projected 1,000,000 increase. Economists in a Bloomberg survey projected\n   a 1 million hiring surge in April. The…",
  "data/reddit-stocks/r/stocks/comments/n6yu2y/tesla_saw_new_registrations_drop_25_in_germany_in.json": "This popped up on my TD Ameritrade app this morning:\n\n“Tesla Inc (NASDAQ: TSLA) saw new registrations fall 24% year-over-year in April\nin Germany, while Volkswagen AG's secured a 108.4% rise.\n\nTesla new registrations in Germany totaled 484 in April, while in the preceding\nmonth the tally was at…",
  "data/reddit-stocks/r/stocks/comments/n70krq/is_beyond_meat_bynd_a_buy_after_the_recent_dip.json": "Company Description:\n\nBeyond Meat is one of the fastest growing food companies in the United States\nand offers consumers a range of various plant-based meats. This company’s\nmission is to build meat directly from plants and have their final product\nconsist of the same attributes as actual meat…",
  "data/reddit-stocks/r/stocks/comments/n71e59/when_you_sell_a_stock_which_one_gets_sold.json": "I’m still learning all the nuances of trading, so forgive me if this seems\nrudimentary, but I was wondering, say I have two shares of a stock (say XYZ).\nOne I bought over a year ago and one I bought last week. If I sell one share of\nXYZ, which one gets sold? I’m thinking in terms for tax purposes,…",
  "data/reddit-stocks/r/stocks/comments/n77ko5/robinhood_is_terrible_for_trading_for_more.json": "I am one of the people that played the COIN IPO. I was so mad about how much\nmoney I lost I sold every position I had and cashed out my account. About 5\nminutes later when I cooled down I realized how stupid that was. There was no\nway I was going to give up trading but I triggered a PDT restriction…",
  "data/reddit-stocks/r/stocks/comments/n77pcd/why_does_amazon_not_want_to_split_their_stock.json": "One share of AMZN costs 3.300$. What could be the reason why Amazon does not\nwant to split their stock?\n\nOn the other side, Apple and Tesla are also among the most valuable companies in\nthe world and they did a stock split only a few months ago- what could be the\nreason they decided to split their…",
  "data/reddit-stocks/r/stocks/comments/n7chm7/help_me_understand_cathie_woods_math_on_her.json": "Recent interview of Cathie Wood on CNBC (search YouTube for \"I love this setup,\nrotation is good news\" to find video) got my head scratching around the math she\njust did in her statements. Back in February she said she expects 15% YoY\ncompounded returns in next 5 years when ARK funds (say ARKK) was…",
  "data/reddit-stocks/r/stocks/comments/n7egrl/what_stocks_are_you_holding_long_term.json": "what stock are you holding for at least a year from now?\n\nFor me, I'm holding etsy, conoco phillips, Opendoor, and poshmark. I've held\netsy for a year now and it's done phenomenal. Conoco phillips (just bought\ntoday) all analysts rate it a strong buy. I believe opendoor tech will be the\nfuture. The…",
  "data/reddit-stocks/r/stocks/comments/n7eybf/96_of_us_users_opt_out_of_app_tracking_in_ios_145.json": "\"It seems that in the United States, at least, app developers and advertisers\nwho rely on targeted mobile advertising for revenue are seeing their worst fears\nrealized: Analytics data published this week suggests that US users choose to\nopt out of tracking 96 percent of the time in the wake of iOS…",
  "data/reddit-stocks/r/stocks/comments/n7zc6w/breaking_us_fuel_pipeline_system_shuts_down_after.json": "The infiltration of a major fuel pipeline is \"the most significant, successful\nattack on energy infrastructure we know of.\"\n\nhttps://www.politico.com/news/2021/05/08/colonial-pipeline-cyber-attack-485984\n\nThe main fuel supply line to the U.S. East Coast has shut down indefinitely\nafter the…",
  "data/reddit-stocks/r/stocks/comments/n80bmo/alibaba_a_short_analysis.json": "What does Alibaba do?\n\nFirst and foremost, they are an online commerce platform. They sell retail, they\nsell wholesale, they sell single items, they sell container loads of items. This\nalso includes a logistics platform and global fulfillment network, Cainiao\nNetwork, and an on-demand delivery and…",
  "data/reddit-stocks/r/stocks/comments/n83cjy/well_health_earnings_tuesday.json": "Was reading this article from the Motley and saw the company has earnings\nTuesday. After digging a little deeper I think they might blow them out of the\nwater.\n\nIf all is accurate this is what I found.\n\n 1. Earnings out earlier than scheduled which is very bullish\n 2. They just did a $305M raise…",
  "data/reddit-stocks/r/stocks/comments/n89hz4/which_is_your_smallcap_tech_stock.json": "When I mean small cap, I mean that the company has a market capitalization\nbetween $300 million and $3 billion.\n\nMy stock is Kaleyra (KLR). Its an Italian company, a competitor of Twilio but in\nits infant stage. Its a very undervalued tech play as well: its valuation is\nonly $380 million, compared…",
  "data/reddit-stocks/r/stocks/comments/n8bsqu/what_stock_do_you_think_has_the_highest_potential.json": "I imagine few have the unique combination of access to information and\nexperience to be able to identify the next WorldCom or Enron but often times it\nstarts with a feeling that something is just off. Maybe you are a supplier who\nis always paid late or an employee who sees something out of…",
  "data/reddit-stocks/r/stocks/comments/n8dhxx/stocks_to_hold_forever.json": "Hi I’m turning 19 soon and I have invested 90% of my savings since last year to\nhave a combined net worth of little more than 13k. I currently live abroad but I\nexpect to go back in less than a year. I use a foreign brokerage that charges me\nfor all the transaction and exchange rate, which is quite…",
  "data/reddit-stocks/r/stocks/comments/n8lkh6/the_lovehate_mating_dance_of_cathie_wood_ark_with.json": "Preface: I'm not invested in any ARK funds myself. I do hold some of the stocks\nin her funds.\n\nLoved by most of this subreddit in 2020. Hated by most in 2021. Yikes. In the\npast 3 months, correlating with the sharp drop in most of her funds (Most of\nthem have dropped 30%+ since February), more and…",
  "data/reddit-stocks/r/stocks/comments/n8m8aa/dutch_govt_grants_24_bln_in_subsidies_to_huge.json": "https://www.reuters.com/business/sustainable-business/dutch-govt-grants-24-bln-subsidies-huge-carbon-storage-project-2021-05-09/\n\nArticle for those who want a quick scroll. Companys that benefit from this are\nRoyal Dutch Shell, ExxonMobil, Air Products and Chemicals, and Air Liquide.\n\nThe Dutch…",
  "data/reddit-stocks/r/stocks/comments/n8xqzh/if_the_whole_stock_market_crashed_what_stocks.json": "I started thinking to myself while I'm stoned and drunk \"why try to pick future\nwinners?\" When I could pick what stocks I would most likely want to be stuck\nwith during a big market crash. It is actually a decent strategy in picking a\nportfolio, but what do I know I'm just watching spawn, drinking…",
  "data/reddit-stocks/r/stocks/comments/n8zkio/psfe_paysafe_a_better_way_to_bet_on_multiple_high.json": "Paysafe is one hell of a company. They are a fin-tech like PayPal and Squares,\nthus should be given a higher multiple for valuation. They got a lot of exciting\nand growth customers like Barstool (PENN), YouTube (Google), Twitch (AMZN),\nFanDuel (PDYPY), Roblox (RBLX), CoinBase (COIN), Visa (V),…",
  "data/reddit-stocks/r/stocks/comments/n90dae/rstocks_daily_discussion_monday_may_10_2021.json": "These daily discussions run from Monday to Friday including during our themed\nposts.\n\nSome helpful links:\n\n * Finviz [https://finviz.com/quote.ashx?t=amd] for charts, fundamentals, and\n   aggregated news on individual stocks\n * Bloomberg market news [https://www.bloomberg.com/markets]\n *…",
  "data/reddit-stocks/r/stocks/comments/n93fnv/dkng_has_not_had_a_great_couple_of_weeks.json": "Draftkings had a moderately positively trending earnings report and they have\nbeen dropping pretty consistently the last couple weeks. Any news I’m missing\nhere directly associated with them? They have been a pretty substantial part of\nmy portfolio for a while and I’m confident they will be much…",
  "data/reddit-stocks/r/stocks/comments/n95yej/are_we_in_the_middle_of_a_correction_or_signaling.json": "Every 3 month chart of stocks I look at has gone down. Unfortunately I got into\ninvesting 3 months ago, and all my positions are at losses. Now I know that we\nhad a ton of new investors over 2020 and into 2021, but in your opinion why has\nthe market been down so much on individual stocks? I’m still…",
  "data/reddit-stocks/r/stocks/comments/n990dq/himax_himx_is_a_strong_buy_in_my_opinion.json": "Himax Technologies: $HIMX\n\n * Market cap - approximately $2.0 B @ $12.3x~ per share at the moment.\n * Full Investor presentation:\n   https://www.himax.com.tw/wp-content/uploads/2021/05/1Q21_HIMX-Investor-Presentation_Final.pdf?v=1\n * TLDR; on why it's a strong buy:\n   * Company is consistently…",
  "data/reddit-stocks/r/stocks/comments/n9a2nc/chipotle_to_hike_wages_debut_referral_bonuses_in.json": "Chipotle said it will increase restaurant wages resulting in a $15 average\nhourly wage by the end of June, as it looks to bring on 20,000 workers.\n\nStarting pay for hourly crew members will range from $11 to $18 an hour. There\nare opportunities to advance to general manager positions with average…",
  "data/reddit-stocks/r/stocks/comments/n9iwj6/ford_will_reveal_all_electric_f150_may_19th.json": "I know, I know... it is not as sexy as some other cars. But I think this is\ngreat. The name “Lightning” is also quite perfect 😂.\n\nI also read few days ago that Ford invested in Solid-State battery along with\nBMW. Supposedly promising although I am not an expert.\n\nI kept going back and forth on Ford…",
  "data/reddit-stocks/r/stocks/comments/n9jkf3/trying_to_find_the_next_big_growth_stock_is.json": "Since the 2020 bull-run, I have been seeing a rising trend on social, and\nespecially on Reddit, of people looking to buy deep into speculative stocks. It\nseems that each individual small-cap growth stock that is at least remotely\nknown has some cult-like following attached it, convinced it will be…",
  "data/reddit-stocks/r/stocks/comments/n9t2iq/rstocks_daily_discussion_technicals_tuesday_may.json": "This is the daily discussion, so anything stocks related is fine, but the theme\nfor today is on technical analysis (TA), but if TA is not your thing then just\nignore the theme and/or post your arguments against TA…",
  "data/reddit-stocks/r/stocks/comments/n9u0o7/with_the_market_being_mostly_red_today_what_you.json": "I want to buy a growth stock for my mom. A lot of things on discount. Is the ARK\ninnovation ETF a good buy at $100? It can return to previous high of $150 and\npass that eventually. I want something in an emerging market and a safe long\nterm play. What you guys buying on the dip?",
  "data/reddit-stocks/r/stocks/comments/n9ukvq/palantir_reports_49_revenue_growth_117m_in_cash.json": "Palantir Technologies Inc. (NYSE:PLTR) today announced financial results for the\nfirst quarter ended March 31, 2021.\n\nQ1 2021 Highlights\n\n * Total revenue grew 49% year-over-year to $341 million\n * US commercial revenue grew 72% year-over-year\n * US government revenue grew 83% year-over-year\n * Cash…",
  "data/reddit-stocks/r/stocks/comments/n9ymq4/every_stock_i_buy_so_far_has_been_a_loss_any.json": "There was a post in here a few ago from someone where she wanted to buckle down\nand learn stocks, so I followed that post. Someone more experienced copied and\npasted their write up with advice. I followed that write up, researched stocks,\nlooked at earnings reports, etc.\n\nBut so far the only stock…",
  "data/reddit-stocks/r/stocks/comments/n9zs4h/tech_stocks_on_sale_or_stay_away.json": "I’ve only been seriously investing since Jan. Pretty heavy on tech. My portfolio\ntook quite a hit during the dip in mid feb/early mar, but I remember the\nsentiment around reddit was “now is the time to buy!” “Stonks on sale!” This dip\ndoesn’t seem to be quite as bad just yet, but I’m not seeing that…",
  "data/reddit-stocks/r/stocks/comments/na1ok6/todays_interesting_premarket.json": "Today's premarket was definitely... interesting to say the least. I opened up my\nYahoo finance app and saw literally all of the holdings in my speculative\nportfolio down anywhere from 4-12 percent. Specifically both $OPEN and $PLTR\nwere down more than 10 percent (PLTR down that much initially after…",
  "data/reddit-stocks/r/stocks/comments/na1qvf/every_nasdaq_pullback_lasting_longer_than_three.json": "I made a graphic showing every time the NASDAQ pulled back from previous highs\nand stayed down longer than three months since 2007. I hope it's acceptable to\npost an image like this.\n\nhttps://i.imgur.com/eDnQEp8.jpg\n\nI defined pullback as any drop that did not sustain a recovery for at least a\nweek…",
  "data/reddit-stocks/r/stocks/comments/na51kp/sofi_debuts_new_weekly_dividend_stock_etf_wkly.json": "From the email I got:\n\n\"WKLY is the first equity ETF that aims to provide income weekly (see what we\ndid there) to shareholders. To do this, WKLY tracks the performance of SoFi\nSustainable Dividend Index, made up of numerous well-known companies that have\nhistorically paid consistent dividends—think…",
  "data/reddit-stocks/r/stocks/comments/na7anh/fubotv_delivered_record_1197m_revenue_in_q1.json": "Great Q1 results from FUBO - 135% YoY revenue growth and 105% YoY subscriber\ngrowth. Shows the continued shift away from traditional cable TV. Looking\nforward to the planned integration of their betting platform.\n\nUp 20% in after hours.\n\nEDIT: holding 75 at average $30",
  "data/reddit-stocks/r/stocks/comments/na862w/unity_q1_revenue_up_41_exceeding_expectations.json": "SAN FRANCISCO--(BUSINESS WIRE)-- Unity Software Inc. (NYSE: U), the world’s\nleading platform for creating and operating interactive, real-time 3D content,\ntoday announced results for the first quarter ended March 31, 2021.\n\n“Our first quarter results are reflective of the powerful transition from…",
  "data/reddit-stocks/r/stocks/comments/na8rm8/lucid_ceo_wont_confirm_guidance_for_2022.json": "https://youtu.be/LI-QyS3bx2Q\n\nLucid CEO was recently interviewed and would not confirm guidance of 20,000\nvehicles for 2022. He actually avoided answering multiple times and would only\nstate they are on track to produce and deliver 567 cars this year.\n\nPretty serious concern if you ask me. They were…",
  "data/reddit-stocks/r/stocks/comments/nabdwh/not_a_good_idea_to_sell_off_on_a_crash_day.json": "I was in $PLTR. I almost NEVER sell for a loss. At least not a big one\n(relatively speaking). This morning I did and it has been eating away at me all\nday. I know better and I have no problem holding out during crashes. Maybe it\nwas too early in the morning and my brain wasnt functioning quite yet.…",
  "data/reddit-stocks/r/stocks/comments/naklxe/rstocks_daily_discussion_wednesday_may_12_2021.json": "These daily discussions run from Monday to Friday including during our themed\nposts.\n\nSome helpful links:\n\n * Finviz [https://finviz.com/quote.ashx?t=spy] for charts, fundamentals, and\n   aggregated news on individual stocks\n * Bloomberg market news [https://www.bloomberg.com/markets]\n *…",
  "data/reddit-stocks/r/stocks/comments/nar4ow/morningstar_upgrades_palantir_to_buy_with.json": "https://www.morningstar.com/articles/1039009/palantir-proves-solutions-are-resonating-growth-ahead\n\nPalantir Proves Solutions Are Resonating, Growth Ahead\n\nWe are raising our fair value estimate for the narrow-moat company.\n\nWe are raising our fair value estimate for narrow-moat Palantir…",
  "data/reddit-stocks/r/stocks/comments/narq4c/lesson_learned_from_buying_the_dip.json": "I began investing it the second half of 2020 and like most people, things were\ngoing very well until February hit.\n\nEveryone started saying “buy the dip” and “it’s on sale!” when a stock dropped\n4-5% and it sounded like a good idea to make back a quick 5% once the stock\nrecovered. However the dips…",
  "data/reddit-stocks/r/stocks/comments/nasz50/being_a_bitch_in_this_market_is_costly.json": "Ever since mid February its been a constant lesson on how to hold and how to be\npatient with getting a good price on whatever investment.\n\nAlways keep more than one income because whatever your strategy that worked 6\nmonths ago might not apply well today. I don't plan to follow this bearish\nmomentum…",
  "data/reddit-stocks/r/stocks/comments/naz3qf/here_is_a_market_recap_for_today_wednesday_may_12.json": "PsychoMarket Recap - Wednesday, May 12, 2021\n\nThe selloff in stocks intensified after a report that showed the consumer price\nindex (CPI) rose at a faster-than-expected pace, spooking market participants\nabout the prospects of inflationary pressures, increasing pressure on equities.\nThe S&P 500…",
  "data/reddit-stocks/r/stocks/comments/nazu9q/inflation_explained_like_youre_five.json": "I started that as a comment but it became quite lengthy and I decided that it\nshould be a separate post instead.\n\nLet's say, currently the inflation is 0%, a burger costs $1 and a single stock\nshare of any company costs $20. You can buy 20 burgers if you sell that share.\n\nTomorrow the inflation…",
  "data/reddit-stocks/r/stocks/comments/nb00oc/how_bad_do_we_realistically_expect_this_dip_to.json": "I have a lot of tech stocks (please no lectures on diversify. I know. But I\ncan't diversify when my holdings are thousands in the hole).\n\nAnyway, my biggest holding (dkng) has gone down virtually 10 straight trading\ndays. 1 of those were green but by 13 cents so not much of a gain there.\n\nThe…",
  "data/reddit-stocks/r/stocks/comments/nb0p47/how_worried_are_you_about_the_current_volatility.json": "I've chased meme stocks this year and had some great success, which was then\nevaportated by chasing more meme stocks and turned into a loss.\n\nAs a result, on Friday, I went safe. I split my entire potfolio across \"safe\"\nlong term S&P500 etf's, along with high dividend low volatility and FTSE…",
  "data/reddit-stocks/r/stocks/comments/nb1e3u/for_those_unaware_a_loss_in_share_value_doesnt.json": "It may seem like a \"no brainer\" to most people but stocks don't work this way. A\nmove 5% higher might have happened over 100,000 share volume and 4 weeks of\ntime. The following move 5% lower can happen with 10,000 share volume over 2\ndays time. This would mean there are 90,000 shares out there with…",
  "data/reddit-stocks/r/stocks/comments/nb2j3d/tesla_has_a_change_in_payment_methods.json": "Elon has just stated they will no longer allow a certain coin for payment.\n\nhttps://mobile.twitter.com/elonmusk/status/1392602041025843203?s=21\n\nThis is a big change due to Elon's influence in that sector and TSLA's\nprofitability with that coin.\n\nI am wondering if going forward we will see it…",
  "data/reddit-stocks/r/stocks/comments/nb6reh/buy_the_dip_what_are_you_guys_buying_now_that.json": "I feel this is temporary dip, tech has been taking a beating so I loaded up on\nQQQ, XLK and CRSR. Any other good recommendations you think are a good value\nright now? And what's your opinion on the stocks I chose, think they'll keep\ndipping or a good buy?",
  "data/reddit-stocks/r/stocks/comments/nb81w0/in_the_wake_of_musks_announcement_this_evening_i.json": "'During a live question-and-answer session Saturday, an investor challenged\nBuffett and Munger on their well-documented skepticism of X, especially X, whose\nprice has surged more than sixfold over the last year.\n\nCharlie Munger - “I don’t welcome a currency that’s so useful to kidnappers…",
  "data/reddit-stocks/r/stocks/comments/nb8ht6/mat_ishbia_called_out_in_feb_q4_earnings_that_he.json": "I have shared my thoughts on UWMC in past. The company announced Q1 earnings and\nwhile they look like they are below expectations it was explained by the CEO\nthat because of the speed of their execution, their results are reflective of\nthe higher rate environment already while competitors are…",
  "data/reddit-stocks/r/stocks/comments/nban9p/where_do_people_find_money_to_buy_the_dip_every.json": "I keep hearing everytime the market crashes to \"buy the dip\"\n\nThe thing is...where do people go for money for the dips? Margin? Cash on Hand?\nOr is it just a mantra to calm ourselves from going mad.\n\nWhat do you guys do? For me is hard having a lot of cash in my account cause i\nfeel i'm trying to…",
  "data/reddit-stocks/r/stocks/comments/nbcb96/how_i_turned_10k_into_50k_with_mainly.json": "I decided to make this post since this community basically changed my life in\nthe last 6 months.\n\nWhat this money means to me\n\nFor context of this post, I'm not from USA, I live in a country where minimum\nwage is 300$/month and the average wage is around 700$/month. So 50k is A LOT of\nmoney here. I…",
  "data/reddit-stocks/r/stocks/comments/nbchqt/toyota_expects_to_sell_about_8_million.json": "(RTTNews) - Toyota Motor Corp. (TYT.L,TM) said Wednesday that it is committed to\nmaking battery electric vehicles or BEVs. It expects to sell about 8 million\nelectrified vehicles globally by 2030, of which 2 million will be battery\nelectric vehicles and fuel cell electric vehicles.\n\nThe company…",
  "data/reddit-stocks/r/stocks/comments/nbdcko/pulled_outdont_know_what_to_do_with_it.json": "Pulled my 450K out of the market a couple of weeks ago...Got scared being a\nrental property owner and thinking of what is going to happen when these renter\nmoratoriums and COVID unemployment extras are gone...I’m 52 and would like to\nre-enter the market via ETFs...\n\nWhat would you do with it?",
  "data/reddit-stocks/r/stocks/comments/nbejsw/excuse_me_if_im_stating_the_obvious_here_but_did.json": "I have not been massively involved in the musk btc hype over the past few weeks\nand I can’t say that I was ever in favour seeing anyone’s favour and support for\na currency which as some finance mogul have put it, is like injecting a poison\nin to the worlds monetary supply, and undercut a prominent…",
  "data/reddit-stocks/r/stocks/comments/nbeuca/alibaba_group_announces_march_quarter_and_full.json": "The company reported adjusted earnings of $1.58 a share on revenue of $28.6\nbillion. Analysts expected BABA to report earnings of $1.79 on revenue of $27.8\nbillion for the period ended March 31.\n\nBUSINESS HIGHLIGHTS\n\nIn the quarter ended March 31, 2021:\n\n * Revenue was RMB187,395 million (US$28,602…",
  "data/reddit-stocks/r/stocks/comments/nbfbur/cathie_wood_piles_up_palantir_for_third_day_in_a.json": "Article\n[https://www.benzinga.com/markets/penny-stocks/21/05/21097552/cathie-wood-piles-up-palantir-for-third-day-in-a-row-adding-39m-worth-of-shares]\n\nCathie Wood-led Ark Investment Management on Wednesday snapped up 2.07 million\nshares, worth about $39 million, in Palantir Technologies Inc PLTR ,…",
  "data/reddit-stocks/r/stocks/comments/nbk41n/looking_for_reasons_why_i_should_not_go_hog_wild.json": "This is my reasoning below. Would like to hear some counterarguments before I\nbegin to go on a shopping spree; I’m sure many users here know way more about\nthis than me and can provide some great food for thought. Thanks in advance.\n\nBasically, a lot of growth stocks have been pummeled mainly due to…",
  "data/reddit-stocks/r/stocks/comments/nblkuk/bumble_taking_a_tumble_after_good_earnings_is.json": "Bumble reported stellar Q1 2021 earnings after market hours on Wednesday\nalthough it was cautious in its outlook. This was enough to send the stock\nplummeting to more than 13% losses today. Your view guys...\n\nHere are some of the highlights from its Q1 earnings\n\n * First quarter 2021 revenue…",
  "data/reddit-stocks/r/stocks/comments/nbmq5e/just_sold_everything_and_went_index_fund.json": "I just sold all my tech/meme stocks and just went straight to index funds. Over\nthe past few months of \"investing\" I realized volatility is not my friend. Maybe\nthat is the wrong approach but I figured, I'll take the loss as a tax credit and\njust keep everything in VTI/SCHG and some dividend stocks.",
  "data/reddit-stocks/r/stocks/comments/nbo3iw/thoughts_about_sq_below_200_good_entry_point.json": "Been wanting to get in on this stock for a while. Bought some at 208 and then\nagain at 205. I see its dipped below 200 after a long time. I see it rebouncing\npretty strongly and making a nice 20 pc return in short run. Thoughts?\n\nAm i missing something that is causing the stock to tank? Probably the…",
  "data/reddit-stocks/r/stocks/comments/nbqcqe/disney_misses_on_subscriber_expectations_parks.json": "https://www.cnbc.com/2021/05/13/disney-dis-q2-2021-earnings.html\n\nEarnings per share: 79 cents vs 27 cents expected in a Refinitiv survey of\nanalysts\n\nRevenue: $15.61 billion vs $15.87 billion expected in the survey\n\nThe company missed on subscriber estimates for Disney+, coming in at 103.6\nmillion…",
  "data/reddit-stocks/r/stocks/comments/nbqeit/disney_reports_q1_earnings.json": "EPS Beats $0.79 Adj. vs. $0.27 Est.\n\nRevs. Miss $15.61B vs. $15.87B Est.\n\nDisney+ Q2 Subscribers: 103.6M vs. 109.M Est.\n\n\n\nDisney reports 103.6 million Disney+ subscribers in latest quarterly earnings,\nup from 94.9 million in February; 13.8 million for ESPN+, up from 12.1 million;\nand 41.6 million…",
  "data/reddit-stocks/r/stocks/comments/nbqhfy/here_is_a_market_recap_for_today_thursday_may_13.json": "PsychoMarket Recap - Thursday, May 13, 2021\n\nThe wild swings in the market continue, with three indexes bouncing back after\nyesterday’s selloff. With the market fluctuating so wildly, it is difficult to\npinpoint the reasons behind this price action, but I think there are two main,\ncompeting factors…",
  "data/reddit-stocks/r/stocks/comments/nbtk08/anyone_else_just_plan_on_hunkering_down_and.json": "I see a lot of people saying \"I moved everything to ETFs\" or \"I sold all my\nstocks and have pillows for my couch now with all the cash\".\n\nAm I crazy that I am going to buy some on the dip and just hold? Shit sucks\nright now, but fundamentally, companies falling haven't had their future change.\n\nMy…",
  "data/reddit-stocks/r/stocks/comments/nbx2i8/found_paper_stocks.json": "I recently found 3 shares of coke stock from a couple decades age. I know it has\nsplit twice and I was wondering the best way to get this transferred to a\nbroker.\n\nI was also curious about dividends. Do they owe me back dividends for 20+ years\nor am I SOL?",
  "data/reddit-stocks/r/stocks/comments/nc4j1m/rstocks_daily_discussion_fundamentals_friday_may.json": "This is the daily discussion, so anything stocks related is fine, but the theme\nfor today is on fundamentals, but if fundamentals aren't your thing then just\nignore the theme and/or post your arguments against fundamentals…",
  "data/reddit-stocks/r/stocks/comments/nc59wa/yahoo_finance_celularity_looks_to_advance.json": "https://finance.yahoo.com/video/celularity-looks-advance-cellular-therapies-194948672.html\n\nFri, May 14, 2021\n\nALEXIS CHRISTOFOROUS: The clinical stage biotech company Celularity has joined\nforces with Palantir, introducing artificial intelligence into its pursuit of\ncancer treatments with patented…",
  "data/reddit-stocks/r/stocks/comments/ncai5u/nio_grabbed_23_share_of_chinas_allelectric_suv.json": "As reported by Benzinga:\n[https://www.benzinga.com/news/21/05/21120647/nio-grabbed-23-share-of-chinas-all-electric-suv-market-in-april-ahead-of-teslas-17]\n\n> Nio Inc (NYSE: NIO) grabbed the largest market share in China's all-electric\n> SUV market in April, higher than its U.S.-based rival Tesla Inc…",
  "data/reddit-stocks/r/stocks/comments/ncajlk/dont_worry_about_the_green_days.json": "I have seen quite a few posts here about others just not dealing well with the\ngood days. I understand that it can be hard to see a stock you've invested in go\nup so much. It can easily take hold of your emotions and cause you to make some\npretty irrational choices. My advice to all of you during…",
  "data/reddit-stocks/r/stocks/comments/nccd8v/are_we_still_high_on_pltr.json": "I made a post a while asking the question why do people like Palantir? The\nconsensus was that it’s an innovative company with huge growth potential and its\nproduct is like no other. I’ll leave the post below. I too have bought into\nPalantir because i to believe it has huge growth potential. Problem…",
  "data/reddit-stocks/r/stocks/comments/ncfhmv/best_stocks_in_your_portfolio.json": "What do I mean by “best”? I’ll let you set your own criteria.\n\nFor me, as a very new investor (I’m only a little over a month in, so take my\nword with a grain of salt), “best” are the stocks that have shown consistent,\nsteady growth and have been minimally affected by losses. At this time, my…",
  "data/reddit-stocks/r/stocks/comments/ncfwmz/amazon_to_hire_75k_fulfillment_workers_with.json": "'Amazon.com Inc (NASDAQ: AMZN) will employ 75,000 logistics and fulfillment\nworkers in North America at an average starting wage of $17 an hour.\n\nMost of the hires will be placed at the company fulfillment locations and\nnetwork of local delivery centers after positioning its final-mile…",
  "data/reddit-stocks/r/stocks/comments/ncihqg/here_is_a_market_recap_for_today_friday_may_14.json": "PsychoMarket Recap - Friday, May 14, 2021\n\nStocks continued yesterday’s momentum, with the S&P 500 (SPY) closing 1.51% up,\nthe tech-heavy Nasdaq (QQQ) closed 2.21% up, while the Dow Jones (DIA) closed\n1.11% up. The price action this week has been nothing short of remarkable, with\nthe market selling…",
  "data/reddit-stocks/r/stocks/comments/nckyig/owning_net_is_an_abusive_relationship.json": "Full disclosure: I’m all in on $NET. I’ll be holding at least for five years\nknowing where this company is going to go. Nevertheless, it’s impossible to\npredict how any day will turn out with these wild swings.\n\nObviously I’m long so these little things don’t matter but I’m praying for the\nday when…",
  "data/reddit-stocks/r/stocks/comments/ncl56i/why_i_think_amc_will_result_in_bagholders.json": "Alright, this will be quite unpopular, but I don't buy this AMC will squeeze to\nthe moon thesis for a few reasons.\n\nLet’s look at liquidity:\n\nAMC had $813m in cash as of 3/31/21. Since then they’ve raised $428m in fresh\ncapital through share issuance, bringing up their total to $1.241b. This is…",
  "data/reddit-stocks/r/stocks/comments/ncnad9/23_of_teslas_q1_earnings_were_from_bitcoin.json": "23% of Tesla's Q1 earnings were from Bitcoin trading - and they would have\nmissed earnings otherwise\n\nTitle says it all.\n\nTesla's earnings in the first quarter were $438 million.\n\n$101 million (23%) of that came from selling Bitcoin for profit.\n\nThe other interesting part is that it would have been…",
  "data/reddit-stocks/r/stocks/comments/ncutxn/growth_stocks_for_the_next_10_years.json": "In February of this year my sister unfortunately passed away from covid and I\nwas the beneficiary of her roth ira. I set up a beneficiary roth ira at fidelity\nto try to take advantage of the tax free benefits of a roth ira instead of\ntaking a lump sum. From my understanding I have 10 years to grow…",
  "data/reddit-stocks/r/stocks/comments/ncw45t/wall_street_week_ahead_for_the_trading_week.json": "Good Saturday morning to all of you here on r/stocks [/r/stocks]. I hope\neveryone on this sub made out pretty nicely in the market this past week, and is\nready for the new trading week ahead.\n\nHere is everything you need to know to get you ready for the trading week\nbeginning May 17th,…",
  "data/reddit-stocks/r/stocks/comments/nd6q9f/given_30000_in_tesla_stock_what_should_i_do_with.json": "I just got offered a job at Tesla. Nothing high up unfortunately/.\n\nBut, one of their benefits is getting $30k in Tesla stock. They said I can sell\nit, use it as a bonus, or keep it and.. wait? Till it is worth more? What would\nbe best for this company?\n\nI have no idea of stocks so simplicity would…",
  "data/reddit-stocks/r/stocks/comments/nd7h8o/i_have_about_2k_sitting_on_the_sidelines_what.json": "I have another ~$5k in random stocks, mostly tech (surprise surprise, right?) So\nI’m looking for a few tickers/indexes to diversify and am wondering what y’all\nwould do if you were in my shoes. I’ve been debating getting some Goldman Sachs\nor WF and possibly Disney and Home Depot.\n\nI’ll probably be…",
  "data/reddit-stocks/r/stocks/comments/ndbsx8/trying_to_understand_the_ark_fund_backlash.json": "Cathie Wood has been getting slammed lately as the ARK Funds suffer some steep\nlosses. My question is what is she supposed to do? Growth stocks as a whole have\nbeen taking a hit. The ARK Funds are described on their website as “ETFs focused\non disruptive innovation”. This alone says ARK is bit of a…",
  "data/reddit-stocks/r/stocks/comments/ndfeng/how_useful_is_a_bloomberg_terminal_for_an.json": "I have what is probably a unique situation. I work as a faculty member at a\nuniversity on the first floor of the business school. Although I’m not in\nbusiness or finance, my office is about a few doors down from a few Bloomberg\nterminals. Recently, they opened up a Bloomberg certification program…",
  "data/reddit-stocks/r/stocks/comments/ndib9g/what_is_the_general_sentiment_about_the_stock.json": "Hello all,\n\nI’m curious to hear what other redditor’s opinions are on the current market. Do\nyou see it continue to rise within the next year? Do you expect a crash? A\ncorrection? What are your thoughts on the state of the housing market over the\nnext two years? How bad of a hit do you expect…",
  "data/reddit-stocks/r/stocks/comments/ndme9o/how_is_my_diversification_in_my_portfolio.json": "I’m 21 years old, staying at home and making $45k a year. I will likely make\n$80k (promotion) if i’m lucky within the next 6 months. Should I be more\naggressive? I also own crypto.\n\nHere is my portfolio:\n\nVTI: 61.9% SCHD: 16.8% ARKW: 5% ARKG: 5% ARKF: 5% YOLO: 3% ICLN: 3%\n\n[Edit] for those who want…",
  "data/reddit-stocks/r/stocks/comments/ndo7u3/whats_causing_icln_to_gradually_decline_since_the.json": "When I look at the graph of ICLN in the last 10 years, the there's been barely\nany growth in it until the pandemic hit and suddenly after April 2020, it\nstarted growing and kept growing until the beginning of January 2020.\n\nPerhaps this sudden growth is down to the optimism that Biden will…",
  "data/reddit-stocks/r/stocks/comments/ndovur/if_your_goal_is_to_live_off_your_stock_returns.json": "I was looking into how much I wanna have invested in stocks before I go part\ntime somewhere in the future. I don't really spend a lot of money so most of my\nincome just sits there, with some of it invested.\n\nI know I could easily live off 2k bucks a month, but obviously that takes quite\nthe…",
  "data/reddit-stocks/r/stocks/comments/ndq2ig/how_am_i_doing.json": "I’m 19, going to College for my bachelors in Economics. I’m working at a small\npizza joint as an assistant manager making okay money but I only work 25-30\nhours a week due to school.\n\nRight now I have essentially convinced myself to INVEST, INVEST, and oh yea...\nINVEST. I live with my parents and…",
  "data/reddit-stocks/r/stocks/comments/ndqg8f/what_are_some_aggressiverisky_etfs.json": "What is currently considered an agressive ETF?\n\nI am looking for an aggressive/risky ETF to pair with VT to hold long term.\n\nI was at first looking at growth ETFs like VUG but then looked at value ETFs\nsuch as VIOV and VTV.\n\nBut I’m wondering what’s a good example of an aggressive/risky ETF I can…",
  "data/reddit-stocks/r/stocks/comments/ndsxx7/att_t_in_talks_to_combine_media_assets_with.json": "The Wall Street Journal reports that AT&T is in advanced talks to combine media\nassets, including CNN, with Discovery to consolidate their industry against\nincoming attacks from streaming.\n\nThe article states that T shareholders will maintain a large stake in the new\nentity. It’s unclear (at least…",
  "data/reddit-stocks/r/stocks/comments/nduoba/why_would_anyone_invest_in_ibm_losing_money_since.json": "I don't get it. What would be the incentive of investing in a company like IBM?\nThe stock price has been depreciating since 2013.\n\nI realize they have a nice 4.5% dividend, but does that make up for losing your\nprinciple investment?\n\nWhat am I failing to see?",
  "data/reddit-stocks/r/stocks/comments/ndyzxa/is_now_the_time_to_buy_tech_stocks.json": "Hello everyone! I do't know if you guys will be looking at this on the\nweekend...\n\nI was hoping some more experienced investors could provide some advice for me, a\nnew trader.\n\nI turned 18 at the beginning of this year and created a brokerage account (TD\nAmeritrade). I put my savings (about 5k) into…",
  "data/reddit-stocks/r/stocks/comments/ndzht4/what_happens_when_a_company_buys_back_stock.json": "Do they just own the stock ? Does the stock get removed from circulation and now\nthe outstanding shares are reduced? If that's the case does the value of the\ncompany go down? Price of stock * outstanding shares",
  "data/reddit-stocks/r/stocks/comments/ne2k7o/dymon_asia_capital_purchases_100000000_worth_of.json": "http://pdf.secdatabase.com/44/0001172661-21-001130.pdf\n\nSECURITIES AND EXCHANGE COMMISSION\n\nFORM 13F-HR\n\nInitial quarterly Form 13F holdings report filed by institutional managers\n\nFiling Date: 2021-05-14 Period of Report: 2021-03-31 SEC Accession No.\n0001172661-21-001130\n\nFILER:\n\nDYMON ASIA CAPITAL…",
  "data/reddit-stocks/r/stocks/comments/nef8qs/how_did_they_know_about_the_t_merger_last_month.json": "I’ve been a long time T owner and it’s really had a hard time holding above $30\nfor a year plus now. Consolidated around $28 though there was a serious new year\ndip. Suddenly in April it pushed past $30. Explanation was weak. Something about\nHBO, which seemed a little lame considering other stay at…",
  "data/reddit-stocks/r/stocks/comments/nekijv/my_acronym_for_big_cap_tech_stocks_that_i_believe.json": "BAGMAN\n\nB-BABA\n\nA-AAPL\n\nG-GOOG\n\nM-MSFT\n\nA-AMZN\n\nN-NVDA\n\nI think these companies have great growth ahead of them and with the earnings\nreports these companies have been putting out they are poised for great growth\nfor the next decade. Thoughts?",
  "data/reddit-stocks/r/stocks/comments/nemvwc/burrys_scion_asset_management_buys_534000000.json": "https://whalewisdom.com/filer/scion-asset-management-llc#tabholdings_tab_link\n\nAs shown in Scion Asset Management's 13F filings published today, Michael Burry\nbought 800,100 put options on TSLA, making up nearly 40% of his portfolio.\n\nBefore his twitter account was deleted, he was very vocal about…",
  "data/reddit-stocks/r/stocks/comments/neqr5i/amazon_gains_as_morgan_stanley_paints_bullish.json": "'Investing.com – Amazon (NASDAQ:AMZN) shares rose in a weak market after Morgan\nStanley 's (NYSE:MS) latest bullish target for the stock: $6,000 by 2023.\n\nAccording to StreetInsider, Morgan Stanley analyst Brian Nowak reiterated his\noverweight rating on Amazon with a target of $4,500, while going on…",
  "data/reddit-stocks/r/stocks/comments/nerh13/here_is_a_market_recap_for_today_monday_may_17.json": "PsychoMarket Recap - Monday, May 17, 2021\n\nThe market fell modestly on Monday, as concerns over rising inflation, marked by\na higher than expected print in the April Consumer Price Index (CPI), continued.\nTechnology stocks continued their volatility, with the Nasdaq (QQQ) going as low\nas 1.42% down…",
  "data/reddit-stocks/r/stocks/comments/newz73/i_have_been_acquiring_joann_fabrics_stock_because.json": "Like the Post says I have been steady acquiring Joann fabrics (JOAN) stocks\nbecause it is a pick and shovel stock. If you are unfamiliar with the topic,\nwhat that means is in a gold rush you don’t go digging for gold you sell the\npicks and shovels to dig gold. Tech stocks can be way overvalued, so…",
  "data/reddit-stocks/r/stocks/comments/nf6i80/i_own_some_shares_in_a_stock_that_the_company.json": "So, I bought the shares kind of cheap and this is my first time going through a\nbuy back or 100% redeeming of shares by the company. I want to know how the\nprocess takes place. Since I have the shares through TD, and this is a 100%\nredeem by the company, will this automatically take away my shares…",
  "data/reddit-stocks/r/stocks/comments/nf8jnv/california_dmv_investigates_teslas_selfdriving.json": "\"Tesla is under investigation by the California Department of Motor Vehicles\nwith the investigation seeking to determine if Tesla is misleading customers\nwhen it advertises its “full self-driving capability” option.\"\n\nEnron Elon Musk is currently under investigation by the California DMV.…",
  "data/reddit-stocks/r/stocks/comments/nf9uhx/walmart_earnings_beat_estimates_as_retailer_sees.json": "https://www.cnbc.com/2021/05/18/walmart-wmt-q1-2022-earnings.html\n\nEarnings per share: $1.69 adjusted vs. $1.21 expected\n\nRevenue: $138.31 billion vs. $131.97 billion expected\n\nE-commerce sales in the U.S. rose by 37% even as consumers returned to more\nnormal activities.\n\nIt is now a good time to…",
  "data/reddit-stocks/r/stocks/comments/nfgeit/what_are_your_current_underrated_stock_picks.json": "Just underrated or undervalued in your opinion! Anything is fair game just\ninclude the name and a possible reason why. What do you think has great\npotential for growth either short or long term?\n\nOn a personal note, personally, I’m looking for more science/biotech/medical\nstocks, so any…",
  "data/reddit-stocks/r/stocks/comments/nfj008/things_i_wish_people_had_told_me_when_i_started.json": "This is original content copied from my other post as this community doesn’t\nallow cross posts but is an equally good home for it.\n\nI’ve been doing really well and I feel like sharing my thoughts for anyone\ninterested. These are the things I wish I had known which would have saved me a\nlot of…",
  "data/reddit-stocks/r/stocks/comments/nflbtz/here_is_a_market_recap_for_today_tuesday_may_18.json": "PsychoMarket Recap - Tuesday, May 18, 2021\n\nStocks held steady today, with the three major indexes trading within a 0.5%\nrange of the even line. It’s encouraging to see the market holding steady after\nthe volatility experienced in the last few weeks. As I have said before, I\nthought the initial…",
  "data/reddit-stocks/r/stocks/comments/nfrmgh/worst_buys_youve_made_this_year_so_far.json": "I’m new to investing, and like any new investor (except for the ones who are\nsuper lucky beyond comprehension), I knew I was bound to make a few poor\npurchases here and there, even with all the research I did before I made my\nfirst purchase. So far, there are only three buys I regret:\n\n3) INTC -…",
  "data/reddit-stocks/r/stocks/comments/ng15bn/rstocks_daily_discussion_wednesday_may_19_2021.json": "These daily discussions run from Monday to Friday including during our themed\nposts.\n\nSome helpful links:\n\n * Finviz [https://finviz.com/quote.ashx?t=spy] for charts, fundamentals, and\n   aggregated news on individual stocks\n * Bloomberg market news [https://www.bloomberg.com/markets]\n *…",
  "data/reddit-stocks/r/stocks/comments/ng2d39/next_set_of_trillion_dollar_companies.json": "Aside from FB, I think the next set of trillion dollar companies will almost\ncertainly come from the semiconductor and fintech industries. NVDA, TSM, V, and\nMA are all good candidates. JPM and BRK will also eventually get there but at a\nslower pace. What do you all think?",
  "data/reddit-stocks/r/stocks/comments/ng2w5l/warren_buffetts_berkshire_hathaway_portfolio_q1.json": "Full credit goes to John Vincent on Seeking Alpha. This is just very brief\nsummary.\n\n\n\nSold all:\n\n * Synchrony Financial (SYF)\n * Suncor Energy (SU)\n\nSold some:\n\n * U.S. Bancorp (USB)\n * General Motors (GM)\n * Chevron Corp. (CVX)\n * AbbVie Inc. (ABBV)\n * Merck & Company (MRK)\n * Bristol-Myers Squibb…",
  "data/reddit-stocks/r/stocks/comments/ngcedr/can_anyone_explain_why_earnings_no_longer_matter.json": "I really don't understand this shit.\n\nAll the time now, a company performs well and the stock price drops because of\nit. Take Lowe's today for example. It blasted earnings. It literally doubled\nthem. 8th earnings in a row it has smashed, and today it's down. Literally, you\nhave a company coining it…",
  "data/reddit-stocks/r/stocks/comments/nggtdd/here_is_a_stock_market_recap_for_today_wednesday.json": "PsychoMarket Recap - Wednesday, May 19, 2021\n\nThe stock market opened deep in the red but managed to climb throughout the\nsession to pare much of the losses. For example, the Nasdaq (QQQ) opened 1.73%\ndown but managed to close the day 0.12% up. Despite the market declining\nmodestly the last three…",
  "data/reddit-stocks/r/stocks/comments/ngi6ua/what_stocks_are_you_watching_that_no_one_else.json": "Let's put aside the popular names for a while and share some of the hidden names\nI rarely see people discussing. I would be curious to hear what everyone shares.\nI'll share my list shortly!",
  "data/reddit-stocks/r/stocks/comments/ngt4js/i_am_considering_doing_a_100_to_10000_challenge.json": "Would any of you be interested in weekly updates starting next week? I plan on\nbuying calls for some health care stocks which is the only sector I believe\nhasn’t had an absurd run up. If I can’t find contracts for the desired 100 limit\nI will increase it to 150 and at maximum 200 If you have any…",
  "data/reddit-stocks/r/stocks/comments/ngvmrw/rstocks_daily_discussion_options_trading_thursday.json": "This is the daily discussion, so anything stocks related is fine, but the theme\nfor today is on stock options, but if options aren't your thing then just ignore\nthe theme and/or post your arguments against options…",
  "data/reddit-stocks/r/stocks/comments/nh7ld4/stock_holdings_for_retirement_ie_next_30_years.json": "Looking at stocks to own for the long term I've put together a list of companies\nthat\n\n\"A\" I like\n\n\"B\" I think have strong prospects to continue growing into the future.\n\nAre there any not on this list you would add... or any you think I'm off base\nwith?\n\n * AAPL\n * AMZN\n * BA\n * BRK/B\n * CME\n *…",
  "data/reddit-stocks/r/stocks/comments/nhbg63/here_is_a_market_recap_for_today_thursday_may_20.json": "PsychoMarket Recap - Thursday, May 20, 2021\n\nStocks snapped their modest three-day losing streak and jumped higher today,\nwith market participants encouraged by the Weekly Unemployment Report and\ninflationary fears tempering. As I said yesterday, I was encouraged to see\nvolatility decreasing this…",
  "data/reddit-stocks/r/stocks/comments/nhfij4/consumer_reports_publishes_scathing_review_of.json": "> “Tesla has repeatedly rolled out crude beta features, some of which can put\n> people’s safety at risk and shouldn’t be used anywhere but on a private test\n> track or proving ground,” says William Wallace, manager of safety policy for\n> Consumer Reports.\n> \n> Tesla says these features will improve…",
  "data/reddit-stocks/r/stocks/comments/nhnnui/is_draftking_a_big_buy_the_dip_moment.json": "In the recent wall street riot, DKNG has pulled by 40% from the high of March.\nOn closely looking at financial report and stock analysis\n[https://www.myfinreads.com/draftkings-strong-buy-the-dip-opportunity/] :\n\n>  1. Gambling sector growth forecast: CAGR of 11.5% from 2020 to 2027.\n>  2. Execution…",
  "data/reddit-stocks/r/stocks/comments/nhnwg4/oatly_otly_valuation_makes_any_sense.json": "Oatly IPO happened yesterday. Market cap at close: ~ 12 billion USD. Pre-market\nit’s up 10%.\n\nIn comparison, Beyond Meat (BYND) currently sits at ~ 6,8 billion USD market\ncap.\n\nBoth have similar revenue. In 2020 Oatly’s revenue was 421,4 million USD. Beyond\nMeat’s 2020 revenue: 406,8 million…",
  "data/reddit-stocks/r/stocks/comments/nhpkn0/is_it_worth_it_to_invest_in_multiple_shares_of.json": "I am a new investor and while I am learning more every day and looking into\nstuff more and more, Coca Cola has caught my eye. Basically, coca cola (I'll\njust say KO for now on) was shown to have a div/yield of around 3. On top of\nthat, KO isn't going anywhere any time soon, and even though it's a…",
  "data/reddit-stocks/r/stocks/comments/nhs698/nvidia_announces_fourforone_stock_split.json": "> NVIDIA today announced that its board of directors declared a four-for-one\n> split of NVIDIA’s common stock in the form of a stock dividend to make stock\n> ownership more accessible to investors and employees.\n> \n> The stock dividend is conditioned on obtaining stockholder approval at the\n>…",
  "data/reddit-stocks/r/stocks/comments/nht0ky/alibaba_baba.json": "Alibaba is trading way below fair price. They are the only e-commerce giant in\nChina that actually makes a reliable profit, and even if growth slows down with\nthe Chinese government giving the industry more scrutiny, a decent discounted\ncash flow calculation still makes Alibaba easily worth at least…",
  "data/reddit-stocks/r/stocks/comments/nhtr0l/netflix_seeking_executive_to_lead_videogame.json": "Source:\nhttps://www.theinformation.com/articles/netflix-seeks-executive-to-expand-game-efforts\n\n\n\n * Netflix is trying to hire an executive to oversee an expansion into video\n   games, The Information reports.\n * And it's approached industry veterans in the past few weeks in the effort,\n   according…",
  "data/reddit-stocks/r/stocks/comments/nhzaus/amazon_is_shutting_down_its_prime_now_fast.json": "https://www.cnbc.com/2021/05/21/amazon-is-shutting-down-its-prime-now-fast-delivery-app.html\n\nAmazon said it's discontinue its stand-alone Prime Now app and website this\nyear.\n\nThe service launched in 2014 as a way for Prime members to get one- or two-hour\ndelivery on a range of goods, from…",
  "data/reddit-stocks/r/stocks/comments/ni19au/volkswagen_ceo_herbert_diess_says_electric.json": "Volkswagen CEO Herbert Diess Says Electric Batteries Are Better than Hydrogen\nCars\n\nhttps://interestingengineering.com/vw-ceo-says-electric-batteries-are-better-than-hydrogen-cars\n\n> The German newspaper Handelsblatt was the first to report on the PIK's\n> research, which in turn sparked Diess's…",
  "data/reddit-stocks/r/stocks/comments/ni2ty8/here_is_a_market_recap_for_today_friday_may_21.json": "PsychoMarket Recap - Friday, May 21, 2021\n\nStocks traded mixed today, with the S&P 500 (SPY) and Nasdaq (QQQ) declining\nmodestly after yesterday’s rally. It’s encouraging to see the market holding on\nto yesterday’s gains following the volatility experienced in recent weeks. It\nseems overall market…",
  "data/reddit-stocks/r/stocks/comments/ni8fp6/disappointing_but_hopeful_stocks_you_hold.json": "Are there any stocks in your portfolio right now that have been disappointing so\nfar, but they don’t frustrate you as much because you’re hopeful that they’ll\nturn it around at some point in the foreseeable future? Also, for those who’ve\ninvested for several years, have there been any stocks from…",
  "data/reddit-stocks/r/stocks/comments/nig1b3/wall_street_week_ahead_for_the_trading_week.json": "Good Saturday morning to all of you here on r/stocks [/r/stocks]. I hope\neveryone on this sub made out pretty nicely in the market this past week, and is\nready for the new trading week ahead.\n\nHere is everything you need to know to get you ready for the trading week\nbeginning May 24th,…",
  "data/reddit-stocks/r/stocks/comments/niiukt/baba_is_now_a_value_stock_with_50_upside_time_to.json": "First off, if you've been living under a rock and don't know what Alibaba is,\nhere's a video about what the company does from CNN Business.\nhttps://www.cnn.com/videos/business/2021/05/21/marketplace-asia-alibaba-cainiao.cnnbusiness\n\n\n\nAlibaba, the mega-cap Chinese conglomerate has had a rough 3…",
  "data/reddit-stocks/r/stocks/comments/nikw11/want_to_invest_in_biotech_a_quick_guide.json": "Short answer: don't. I work in the industry and learned early on not to touch it\nwith a ten-foot pole. If you want to invest in the pharma/biopharma/biotech\nindustry, investing in small-cap biotech stocks - MBIO, VKTX, ATOS, etc. for\nexamples is basically gambling. Here are the alternatives I…",
  "data/reddit-stocks/r/stocks/comments/nilf7d/spce_virgin_galactic_test_flight_5222021_is.json": "FINAL EDIT: VMS Eve has landed safely. Thanks to our pilots Kelly Latimer and\nMichael Masucci for flying the mothership today and their vital role in helping\nVSS Unity complete today’s spaceflight!\n\nTwitter link for direct updates from Virgin Galactic team ->\nhttps://twitter.com/virgingalactic;\n\n-…",
  "data/reddit-stocks/r/stocks/comments/nivh79/what_price_are_you_gonna_buy_baba_at.json": "I’m waiting for it to get to $200 and jump on it. This dip is insane and I think\nit’s a great opportunity. Also, JD.com looks like a good pick up too. I think\nthose two are great long term holds and should provide great returns for the\nyears to come",
  "data/reddit-stocks/r/stocks/comments/niyift/15_companies_with_the_most_cash_reserves_traded.json": "Total cash, cash equivalents and marketable securities of the company as per the\nlatest quarter (in billions of dollars).\n\n 1.  Cigna (NYSE:CI) - 10.1 B\n\n 2.  Cisco (NASDAQ:CSCO) - 11.8 B\n\n 3.  Costco (NASDAQ:COST) - 13.6 B\n\n 4.  IBM (NYSE:IBM) - 14.3 B\n\n 5.  JPMorgan Chase (NYSE:JPM) - 24.9 B\n\n 6. …",
  "data/reddit-stocks/r/stocks/comments/nj653k/how_to_hedge_against_a_market_crash_with_spy_puts.json": "Let's assume that I think it is possible that the market crashes some time\nbefore the 3/18 2022 by more than 40-50%. What percentage of my portfolio should\nI put in SPY puts that expire by 3/18 then and what strike price would be most\nideal for such a bet? Basically I am asking how much return these…",
  "data/reddit-stocks/r/stocks/comments/nj6mt3/question_how_do_triple_leveraged_etfs_lose_money.json": "I was reading an article,\nhttps://www.thebalance.com/leveraged-etfs-lose-money-357489, and it basically\nexplains that holding things like TQQQ always lose money over the long term, but\nif I look at it's graph, well you can see it has profited, I know this isn't how\nit works, and I know i'm missing…",
  "data/reddit-stocks/r/stocks/comments/nj8r6q/first_option.json": "So I’ve been watching YouTube videos trying to understand options.\n\nMostly while I row, so I have it on with subtitles. And I’m listening to music.\nSo maybe not the best way to learn.\n\nSo I finally get like I kinda got it. Then I heard some new on Thursday about\nVirgin Galactic being able to launch…",
  "data/reddit-stocks/r/stocks/comments/nj9kk4/do_yall_track_what_smart_money_are_buying.json": "Sourcing some stocks to buy in this pullback, and am wondering if any of y'all\nlook for stocks ideas by looking at what smart money (hedge funds with tracked\nrecords or institutions) are buying recently.\n\nIs there an aggregated website to pool all these datas together?",
  "data/reddit-stocks/r/stocks/comments/njc9ur/cruise_stock_holders_when_are_you_selling.json": "I bought CCL/CUK (Carnival Corp) starting late April last year and made it 100%\nof my portfolio. Now it is up around 100% (mostly long term gains) and I\nrecently reflected if my hypothesis for the stock was seen through.\n\nFrankly I did not expect to hold so long. I bought expecting a faster return…",
  "data/reddit-stocks/r/stocks/comments/njd3bd/estateinheritance_tax_on_us_or_uk_stocks_for_a.json": "Hey guys, I really appreciate you taking the time to read my post and help me. I\nhope you can bear with me through my inexperience and confusion\n\nI am from Serbia, living in Serbia. With that in mind, I realized that my\npersonal investments in US stocks will be liable to a 60% tax upon…",
  "data/reddit-stocks/r/stocks/comments/njdkpf/tsm_intc_or_samsung_electronics.json": "Which one between TSM, INTC or Samsung electronics could be the better\ninvestment in semiconductors? Currently, TSM is the leader in the sector which a\nmarket share of 80% and they announced an investment of 100 billion for increase\ntheir production capacity; I have read they invented a new nanochip…",
  "data/reddit-stocks/r/stocks/comments/njequn/question_regarding_airline_and_stocks.json": "Hello, so I was just chatting with my father about investing in stock and he\nthought about flights/airline stocks. I was looking up a few and they had seemed\nto drop by a few dollars within the last year but they were also very cheap.\n\nWhen looking at airlines and stocks, is this an area that isn't…",
  "data/reddit-stocks/r/stocks/comments/njfu67/the_crypt_rule_is_a_bit_too_strict.json": "Example: Some dude ask if coinbase is a good stock to buy. Even just replying\nanything with a \"mean\" keyword instantly gets your post removed. I think being\nunable to mention anything crypt related when discussing stocks, especially ones\nlike coinbase, is becoming increasingly impossible.\n\nYea sure,…",
  "data/reddit-stocks/r/stocks/comments/njgyv3/if_i_hold_a_stock_long_term_and_keep_adding_to_it.json": "Recently I bought more shares of a company called CPSL I had originally been\nholding 100k shares that I bought in 2018 but I purchased another 61k in March\n2021 I’m just curious if I sell will my full portfolio be taxed long term or\nshort term or will they split it up?",
  "data/reddit-stocks/r/stocks/comments/njhuqf/im_investing_in_a_allstreetets_sentiment_etf_and.json": "EDIT (moved this from the bottom to the top) Before you comment:\n\n 1. No, I don't think this will hold up forever\n 2. For those asking for my project's details -- check out my profile. Won't be\n    discussing anything regarding investing in it - the aim of this post is not\n    self promo. It's just…",
  "data/reddit-stocks/r/stocks/comments/njtw5g/rstocks_daily_discussion_monday_may_24_2021.json": "These daily discussions run from Monday to Friday including during our themed\nposts.\n\nSome helpful links:\n\n * Finviz [https://finviz.com/quote.ashx?t=spy] for charts, fundamentals, and\n   aggregated news on individual stocks\n * Bloomberg market news [https://www.bloomberg.com/markets]\n *…",
  "data/reddit-stocks/r/stocks/comments/nk0anz/schwab_bought_ameritrade_but_will_they_keep_that.json": "Benzinga is probably the worst alert service in the world. THe clown that mans\nthe chat is always late, and often not there at all.\n\n\n\nPlease Schwab , fire those idiots and get a REAL service",
  "data/reddit-stocks/r/stocks/comments/nk23fu/rick_and_mort.json": "It's not a meme; they're both genuinely good stocks. I have 5% in $RICK and\n1.25% in $MORT.\n\n$RICK is up 435% since last year. They manage up-scale cabarets, strip clubs,\nand nightclubs. There's no other publicly traded company like it. Until someone\ncomes up with a strip clubs and porn ETF, I'm…",
  "data/reddit-stocks/r/stocks/comments/nk4df4/peloton_to_invest_400_million_to_build_its_first.json": "https://www.cnbc.com/2021/05/24/peloton-to-invest-400-million-on-first-us-production-facility-in-ohio.html\n\nKey points:\n\nPeloton will invest $400 million to build its first U.S. factory in Troy\nTownship, Ohio.\n\nIt will break ground later this summer and hopes to be producing equipment…",
  "data/reddit-stocks/r/stocks/comments/nk5zl6/apple_stock_analysis_is_aapl_a_good_buy.json": "Hey there guys, I just started analyzing stocks more and I thought I´ll try to\ndo that and post it here. That´s my first analysis that I post anywhere. If you\nhave any feedback for me that would be great and highly appreciated. If you have\nquestions feel free to ask, I´ll try to answer…",
  "data/reddit-stocks/r/stocks/comments/nk67sx/amazon_nears_deal_to_buy_mgm_studios_for_nearly_9.json": "https://www.cnbc.com/2021/05/24/amazon-nears-deal-to-buy-mgm-for-nearly-9-billion.html\n\nAmazon is close to a deal to buy MGM for between $8.5 billion and $9 billion,\nsources say.\n\nIt’d be Amazon biggest acquisition since it bought Whole Foods in 2017 for $13.7\nbillion.\n\nA transaction could be…",
  "data/reddit-stocks/r/stocks/comments/nk7ipu/here_is_a_market_recap_for_today_monday_may_24.json": "PsychoMarket Recap - Monday, May 24, 2021\n\nAfter weeks of volatility, stocks rallied today as fears over rising inflation\nforcing the Federal Reserve to tighten monetary policy tempered. As I have said\nfor weeks, there are several reasons I thought the initial reaction to the April\nConsumer Price…",
  "data/reddit-stocks/r/stocks/comments/nkdpq6/sofi_ipoe_is_a_great_longterm_play.json": "SoFi is a phenomenal combination of debt investing/management, retail trading\nplatform, and fin-tech. They are pending to get their bank charter right now,\nand if approved will be in your standard commercial bank offering as well. As I\nsee it, they are the new age of finance. They are a company I…",
  "data/reddit-stocks/r/stocks/comments/nke9vc/peloton_pton_30_billion_is_valued_60x_more_than.json": "Nautilus, Ticker NLS. This company is about 20% short, has 113 million in cash\nin the bank with just under 15 million in debt, has a market cap of 500 million.\nThey have generated about 80 million over the past 2 quarters as well. We have a\nmajor catalyst still….people aren’t running to the gym. If…",
  "data/reddit-stocks/r/stocks/comments/nki7qb/nio_announces_deal_to_double_its_production.json": "> Chinese electric-vehicle maker NIO said that it has extended its current\n> manufacturing deal for another three years -- and that its manufacturing\n> partner has agreed to double the factory's production capacity.\n> \n> Although the company has talked from time to time about building a factory,\n>…",
  "data/reddit-stocks/r/stocks/comments/nknzhl/people_who_work_for_publicly_listed_company_do.json": "Hi, I was just wondering what are people doing who work for listed companies.\nWould be cool to hear experience of other people.\n\nI work for company that is part of large multinational conglomerate that owns\nmany other companies in the same sector. Our parent company is listed on NYSE.\nHowever, it is…",
  "data/reddit-stocks/r/stocks/comments/nkug7q/investing_more_than_you_can_afford.json": "...it happens.\n\nIt's a common mistake even experienced investors mistake. I've made it. I\nguarantee half the people on here who ridicule others for it, have done it.\nMillionaires have gone bankrupt through bad investments. It isn't just retail\ntraders and lower/middle class who suffer from it.\n\nLike…",
  "data/reddit-stocks/r/stocks/comments/nkx8pc/dodid_you_participate_in_the_meme_stock_movement.json": "With meme stocks GME and AMC pumping off again today (after gaining\nsignificantly over the past few days), I’m curious if anyone here in this\nsubreddit participates or has participated in the movement. Were you a part of\nthe last major rise in January that caught national attention? Are…",
  "data/reddit-stocks/r/stocks/comments/nky43y/my_big_bet_on_molson_coors_beverage_company_tap.json": "$TAP\n\nI only make two or three \"high-conviction\" trades per year. When I trade, I go\nbig with serious conviction. I want to tell you about my biggest trade ever -\nMolson Coors (3500 shares @ $55.44). I've also got a bunch of options that\nexpire in October.\n\nI am not a \"technical\" trader. Nor am I a…",
  "data/reddit-stocks/r/stocks/comments/nl0qad/due_diligence_how_do_i_perform_it.json": "Hey everyone,\n\nI wanted to go over how I like to perform DD on stocks I come across. This isn't\nfinancial advice, its just my personal process and style.\n\n\nPROFILE: IS THIS COMPANY REAL?\n\n 1. Website\n 2. Address, Google Maps of HQ\n 3. LinkedIn\n 4. Wikipedia\n 5. Social Media Accounts\n 6. News…",
  "data/reddit-stocks/r/stocks/comments/nldj8c/trying_to_understand_options.json": "Say I’m doing a call on AMC for $19 and the date is may 28th, that means that I\nwant to buy this if I have a good feeling that it will hit $19 by may 28th,\nright?\n\nThe call also says it costs 74 cents. So I have to multiply that by 100, so it\ncosts me $74 for the call. Is the $74 like the cost for…",
  "data/reddit-stocks/r/stocks/comments/nlh6fq/amazon_confirmed_mgm_takeover_for_845billion.json": "> A joint statement from the companies said: \"Amazon will help preserve MGM's\n> heritage and catalogue of films, and provide customers with greater access to\n> these existing works.\"\n> \n> The acquisition is Amazon's second biggest after it snapped up grocery chain\n> Whole Foods for nearly $14bn in…",
  "data/reddit-stocks/r/stocks/comments/nlhbrq/i_build_a_model_that_supplements_stock_market.json": "TLDR (because I hate it when they are at the end) – I build a model that\nenriches investors’ intuition with AI and alternative data. For example if\nexperience taught an investor that TSMC (Taiwanese semiconductor stock) is\ndriven by Tech, tension between US-China, news on Taiwan and consumer…",
  "data/reddit-stocks/r/stocks/comments/nlhpv3/dutch_court_rules_oil_giant_shell_must_cut_carbon.json": "LONDON — A Dutch court on Wednesday ruled oil giant Royal Dutch Shell\n[https://www.cnbc.com/quotes/RDS.A] must reduce its carbon emissions by 45% by\n2030 from 2019 levels.\n\nThat’s a much higher reduction than the company’s current aim of lowering its\nemissions by 20% by 2030.\n\nShell’s current…",
  "data/reddit-stocks/r/stocks/comments/nln5br/blackberry_listen_to_my_son.json": "Hello I'm just a regular mom who knows nothing about stocks or trading. My 17\nyear old son told me to invest in Gamestop way back and now I'm kicking myself\nin the ASS!!! He also told me to invest in Etheruem and in Jan I bought $250\nworth and now I have over $1k in there. (I'm saving it for his…",
  "data/reddit-stocks/r/stocks/comments/nlqtjo/nvda_nvidia_announces_financial_results_for_first.json": " * Record revenue of $5.66 billion, up 84 percent from a year earlier\n * Record Gaming revenue of $2.76 billion, up 106 percent from a year earlier\n * Record Data Center revenue of $2.05 billion, up 79 percent from a year\n   earlier\n\n\n\nGAAP earnings per diluted share for the quarter were a record…",
  "data/reddit-stocks/r/stocks/comments/nlr7pv/here_is_a_market_recap_for_today_wednesday_may_26.json": "PsychoMarket Recap - Wednesday, May 26, 2021\n\nStocks mostly consolidated today, finishing modestly higher led by a 0.34% gain\nin the Nasdaq (QQQ). After the volatility experienced in the first weeks of May\nit is very encouraging to see market volatility calming down and holding on to\nrecent gains.…",
  "data/reddit-stocks/r/stocks/comments/nltj9w/rite_aid_walgreens_and_cvs_down_today_may_26_2021.json": "RITE AID (RAD), WALGREENS ( WBA ), AND CVS ALL DOWN TODAY MAY 26, 2021 ON REPORT\nAMAZON (AMZN) IS CONSIDERING ENTERING THE PHYSICAL RETAIL PHARMACY SPACE. WHAT\nTHE MARKET IS MISCALCULATING IS THAT WITH A MARKET CAP OF ONLY $1 BILLION, RAD\nIS NOW A PRIMARY TAKEOVER TARGET FOR AMZN OR WALMART ( WMT…",
  "data/reddit-stocks/r/stocks/comments/nmb9t6/til_you_can_get_friends_and_family_discount_on.json": "link\n[https://www.google.com/url?sa=t&rct=j&q=&esrc=s&source=web&cd=&ved=2ahUKEwi_2q33ourwAhUxIjQIHRlvCMAQFjAAegQIBBAD&url=https%3A%2F%2Fshareholder.ford.com%2Finvestors%2Fresources%2Fdefault.aspx&usg=AOvVaw1AloXhdbbrkLuCEEAgYSLk]\n\nWish I would've known before. Maybe everyone else knows. A bit salty…",
  "data/reddit-stocks/r/stocks/comments/nmgr81/here_is_a_market_recap_for_today_thursday_may_27.json": "PsychoMarket Recap - Thursday, May 27, 2021\n\nStocks traded mixed today, with the S&P 500 (SPY) and Dow Jones (DIA) rising\nwhile the tech-heavy Nasdaq (QQQ) fell modestly as market participants looked\ntoward the new weekly jobless report. Market participants continue to closely\nmonitor incoming…",
  "data/reddit-stocks/r/stocks/comments/nmgwfh/salesforce_growth_accelerates_as_company_offers.json": "https://www.cnbc.com/2021/05/27/salesforce-crm-earnings-q1-2022.html\n\nEarnings: $1.21 per share, adjusted, vs. 88 cents per share as expected by\nanalysts, according to Refinitiv.\n\nRevenue: $5.96 billion, vs. $5.89 billion as expected by analysts, according to\nRefinitiv.\n\nThis stock is up 4% after…",
  "data/reddit-stocks/r/stocks/comments/nmj230/what_if_you_bought_1_share_each_of_top_50_highest.json": "https://docs.google.com/spreadsheets/d/14hyGy734pxznA--wL7hHqbOn8Sa6xjq8fNHtL_3XZ4o/edit#gid=0\n\nIn case you want to use the Sheet template for something else, go to File and\nmake a Copy, then you can use it yourself. Don't ask for permission.\n\nThose are the 50 highest rated stocks on Seeking Alpha…",
  "data/reddit-stocks/r/stocks/comments/nmmz3r/asking_as_a_novice_what_is_happening_with_amc_now.json": "Hello guys! I'm a complete novice in this, just getting started, and I think I\nwould need an insightful opinion on this.\n\nI bought AMC at 10 some 2 weeks ago, and now it seems the price is getting\nskyrocketed (now at 26) by pretty much the same type of operation than for\nGameStop, which I understand…",
  "data/reddit-stocks/r/stocks/comments/nmw2zw/palantir_pltr_awarded_111_million_contract_to.json": "Palantir Technologies Inc. said it has been selected by the U.S. Special\nOperations Command to continue its work as their enterprise data management and\nAI-enabled mission command platform as part of the Mission Command System/Common\nOperational Picture program.\n\nThe company said the contract is…",
  "data/reddit-stocks/r/stocks/comments/nmweb8/accounting_101_part_3_the_cash_flow_statement.json": "Hey everyone, here's part 3 of the series.\n\nIn case you missed anything, here are the other parts:\n\nPart 1: The Income Statement -\nhttps://www.reddit.com/r/stocks/comments/nlhcci/accounting_101_part_1_the_income_statement/\n\nPart 2: The Balance Sheet …",
  "data/reddit-stocks/r/stocks/comments/nmzbs7/spce_next_week_in_new_exchange.json": "I’ll keep it simple. As of now the only way Russians can buy spce is from the St\nPetersburg exchange. St Petersburg is known to buy company stocks and re-sell\nthem without the permission of the company…\n\nApril 2018: “Under Russian securities laws, a Russian stock exchange can\nunilaterally admit…",
  "data/reddit-stocks/r/stocks/comments/nn10tr/amcs_fourday_surge_slaps_short_sellers_with_13.json": "The relentless four-day winning streak in AMC Entertainment Holdings Inc.\n[https://www.bloomberg.com/quote/AMC:US] is drawing even more blood from short\nsellers.\n\nThe movie theatre’s 120% surge so far this week has dealt investors betting\nagainst it roughly $1.3 billion in losses, according to…",
  "data/reddit-stocks/r/stocks/comments/nn1f5a/be_wary_of_stock_discords.json": "Hello everyone,\n\nI am posting here since it was removed from r/investing\n[https://www.reddit.com/r/investing/]. I apologize to the mods if this is the\nright content for this sub.\n\nWith the popularity of stock trading at an all-time high, I just wanted to give\na small PSA and a note about my…",
  "data/reddit-stocks/r/stocks/comments/nn38p8/i_made_1728_in_two_weeks.json": "Hello r/stocks [/r/stocks]\n\nI'm a grown ass man that knows essentially nothing about finances despite being\nfinancially well off. So I decided to learn and blow 200$ on a brokerage app\n(WS). I figured if I fuck up and mess up I don't care, it's just 200$ and it'll\nbe like going to the casino.\n\nSo I…",
  "data/reddit-stocks/r/stocks/comments/nn7etx/here_is_a_market_recap_for_today_friday_may_28.json": "PsychoMarket Recap - Friday, May 28, 2021\n\nStocks gained on Friday, with market participants encouraged by new economic\ndata on consumer spending, income and inflation, and a strong Weekly\nunemployment report. The market has made a remarkable recovery, particularly in\ntechnology, after the market…",
  "data/reddit-stocks/r/stocks/comments/nnl9c5/thoughts_on_baba.json": "Hi guys,\n\nBABA has been in a downtrend lately, was wondering if anyone else sees this as\nan opportunity. It is very appealing in this ~200$ zone.\n\nWhat do you guys think? Any major concerns I should be worried about?",
  "data/reddit-stocks/r/stocks/comments/nnn1og/i_think_xiaomi_has_huge_long_term_potential_in.json": "Xiaomi (HK: 1810) is a mere 11 years old and didn't go public until 2018 - the\nsame year they turned profitable, yet the are a well known brand and already\nthird in global smartphone sales.\n\nA few days ago the company delivered a pretty wicked earnings…",
  "data/reddit-stocks/r/stocks/comments/nnq8y8/keep_amzn_stock.json": "Hey guys I was wondering if I should keep holding Amazon or if I should sell it\nand re invest that money into other stocks such as GOOGL or SMH. AMZN has been\nstagnant for the past few months, feel like I’m missing out on growth, should I\nsell AMZN or hold it? AMZN according to CFRA report is fair…",
  "data/reddit-stocks/r/stocks/comments/nntgg0/thoughts_on_apple.json": "The stock price is still down 6% ytd, I am wondering if anyone else is still\nadding more. What do you guys think? Is there any major concerns that people are\nworried about so the stock price keep trading under $130? I still think that the\nstock price will hit $150 before the end of the year.",
  "data/reddit-stocks/r/stocks/comments/nnx710/what_is_your_usual_im_out_percentage_gain_on_calls.json": "Currently very sad I sold my Logitech 7/16 $110 calls for $450 (250% profit)\ninstead of the current $1200 price. This has happened a lot to me recently and I\nknow I’m being a good boy, but FML I’ve left about 15k on the table in the last\n3 months with my conservative profit taking.\n\nDo you all have…",
  "data/reddit-stocks/r/stocks/comments/nnyfep/more_and_more_i_see_yt_content_creators_with_new.json": "These channels are starting to flourish, and while I’m all for increased\nparticipation by non-professionals, YOLO’ers, and all other amateurs, I think\nsome of them do more harm than good. It’s a lot like the flood of half-assed\nnutritional and fitness guys offering broscience on YT. These financial…",
  "data/reddit-stocks/r/stocks/comments/nnzuwg/consider_yourself_an_investor_imagine_the_sell.json": "If you want to swing trade, try to cash out on short squeezes, whatever, then\nfine: You do you. Otherwise, if you actually want to invest, then let me give\nyou a trick to help you approach the market correctly...\n\nImagine that the \"sell\" button is greyed out until a security is held for 5\nyears.\n\n *…",
  "data/reddit-stocks/r/stocks/comments/no1uzz/apples_massive_success_with_carplay_paves_the_way.json": "'Apple introduced CarPlay in 2014 as a way to integrate the iPhone and a car’s\ndashboard. Since then, it’s become ubiquitous in new cars.\n\nAround the world, over 80% of new cars sold support CarPlay, Apple said last\nyear. That works out to about 600 new models, including cars from Volkswagen,\nBMW,…",
  "data/reddit-stocks/r/stocks/comments/nohefp/the_more_i_gain_the_more_i_get_greedy_how_do_you.json": "After a series of losses in my early trading career, I thought I'd be humbled\nenough to realize that any gain is a good gain, no matter the trajectory of a\nstock. Even after being in deep red earlier this year, and finally realizing\nsome profits, I can't help but think about the \"could haves\".\n\nI…",
  "data/reddit-stocks/r/stocks/comments/noia7g/thoughts_on_pinterest.json": "Pinterest is currently my biggest holding and I have a strong conviction about\nit. I love that it's a women-driven investment that is growing impressively fast\naround the world and sits at 500M monthly active users.\n\nThe leadership refers to the company as a personal media application and a\nsearch…",
  "data/reddit-stocks/r/wallstreetbets/comments/n24jla/inflation_nation.json": "The current economic data being released combined with recent statements from\nlarge corporations about pricing should be ringing inflation alarm bells. It’s\nnot just meme stocks that are mooning, the price of everything is going thru the\nroof. Could it be that the inevitable hangover from the money…",
  "data/reddit-stocks/r/wallstreetbets/comments/n30u1l/why_i_think_the_market_will_see_a_3050_correction.json": "I'm not going to give you a wall of text that you will probably skim through,\ninstead I'd like to show you 4 graphs that I've studied at length which I feel\ndepict my thesis in shortest amount of time then provide brief explanations\n\nThesis- The stock market is at an unsustainable high valuation and…",
  "data/reddit-stocks/r/wallstreetbets/comments/n3vlr0/nok_has_potential_to_reach_10.json": "$NOK has the potential to reach $10+, here's why:\n\n\nREVENUE AND EARNINGS BEAT\n\nNet sales rose 3% year-over-year to €5.08 billion ($6.2 billion), beating the\nFactSet consensus for sales of €4.75 billion. The sales beat was driven by\ngrowth in Nokia’s mobile networks unit — due to strong sales of 5G…",
  "data/reddit-stocks/r/wallstreetbets/comments/n4dvka/msft_infinite_money_glitch.json": "Disclaimer: I am not a financial or investment advisor. \n\nBefore this subreddit was ruined by ten million people, solid DD used to get\ndone. Do you ever find yourself reminiscing about the good ‘ol WSB days? \n\nWell, your prayers have been answered. Degenerates gather around, as I am\nbringing you a…",
  "data/reddit-stocks/r/wallstreetbets/comments/n5gkmr/be_careful_out_there_etrade_is_shady.json": "I've been an E*TRADE user for close to a decade now, but over the last few\nmonths, I've had a few significant issues within my account that simply\nshouldn't be happening. The type of mistakes that would likely throw the average\nperson into a full-blown panic attack, or worse...\n\n\n\nThe first \"issue\"…",
  "data/reddit-stocks/r/wallstreetbets/comments/n5lvld/mods_that_are_only_2_days_old.json": "Wow! They seem to have gotten a lot of experience in 48 hours!",
  "data/reddit-stocks/r/wallstreetbets/comments/n5nsmc/are_gme_and_amc_posts_no_longer_allowed_here.json": "Not sure what is going on today but all I see is pump and dumps being pushed it\nseems",
  "data/reddit-stocks/r/wallstreetbets/comments/n5rw9o/my_giant_rkt_mistake.json": "If anyone bought RKT thinking it would moon like I did, I hope you bought shares\nand not calls. If you bought calls, you are not alone. I went all in on calls.\nWhen I say all in, I mean I have less than $100 left in my bank account... all\nin. I don’t have a lot of money, but I truly believed RKT had…",
  "data/reddit-stocks/r/wallstreetbets/comments/n5z4si/bring_gme_back.json": "Enough with the new pump and dump every week, bring back good DD or atleast the\ndaily. GME and dare I even say AMC (3 mil individual investors confirmed today\nbtw) is a once in a lifetime stock. There literally cannot be another Gamestop\ndue to legislation that has been put forward since the baby…",
  "data/reddit-stocks/r/wallstreetbets/comments/n62fi3/wsb_mods_sleeping_amc_gme_to_the_mooooooon.json": "AMC and GME let's go.\n\nEdit: holy shit you apes are killing my battery 😂 🚀🚀🚀🚀",
  "data/reddit-stocks/r/wallstreetbets/comments/n6yv3h/bill_gates_liquidating_stock_in_the_form_of.json": "“What if I told you that both the Gates and Bezos Divorces are nothing more than\ncovers to allow each to liquidate large amounts of stock at the peak of a\nmulti-decade asset market top without raising suspicion?”\n\nConspiracy? Yes. Possible? Yes.\n\nLou Pai (CEO of Enron) divorced his wife and the…",
  "data/reddit-stocks/r/wallstreetbets/comments/n70cim/my_first_dd_im_a_doctor_and_i_think_ino_is_about.json": "First of all this is all just my speculation and not financial advice. I have no\nidea what I'm talking about when it comes to stocks and I've only been doing\nthis for like a couple months. I am not a financial advisor or professional.\nWhat I am is a physician with at least some literacy, though not…",
  "data/reddit-stocks/r/wallstreetbets/comments/n7b3py/lessons_learned_the_hard_way_advice_from_someone.json": "As most on here know, I lost nearly every dollar to my name going all in on RKT\ncalls. When I say everything I mean all my savings and 90% of my checking\naccount. Now I’m a stupid, broke husband and dad of 3 with number 4 coming in\nearly June. I am now going to be Uber driving every night for…",
  "data/reddit-stocks/r/wallstreetbets/comments/n8f30j/got_losses_no_worries_its_just_a_tax_write_off.json": "Remember that the system was made to benefit the market. If you are an American\nTax Payer. Capital Gains tax can be something you are worried about. But you\nalso have Capital Loss Dedications. If you are married and filing jointly or\nSingle (like most retail investors are), you can claim 3k…",
  "data/reddit-stocks/r/wallstreetbets/comments/n9ydod/palantirs_pltr_fundamentals_just_became_even.json": "First of all let's take a look at PLTR's Q1 financial performance.\n\n * Total revenue grew 49% year-over-year to $341 million\n * US commercial revenue grew 72% year-over-year\n * US government revenue grew 83% year-over-year\n * Cash flow from operations of $117 million, up $404 million year-over…",
  "data/reddit-stocks/r/wallstreetbets/comments/n9zlpn/important_connection_between_ufos_and_defense.json": "TLDR: The U.S. Government has confirmed several sightings of UFO's (possibly\naliens). Several government officials have come out and said that U.S. military\nhas had several encounters with physics-defying vehicles. Based off this\nevidence, defense stocks have a direct relationship with UFO…",
  "data/reddit-stocks/r/wallstreetbets/comments/nanynr/i_analyzed_9000_trades_made_by_us_congress.json": "Preamble: The ability of Congress Members to trade stocks have been\ncontroversial from the start. The 2020 congressional insider trading scandal\n[https://en.wikipedia.org/wiki/2020_congressional_insider_trading_scandal] where\nCongress Members used insider knowledge to trade large positions in stocks…",
  "data/reddit-stocks/r/wallstreetbets/comments/nbdztx/why_potential_inflation_could_lead_to_a_financial.json": "A bit of history\n\nThe decade of the 2000s may have been a pretty good decade in many aspects,\nmovies such as the lord of the rings or harry potter were released; music albums\nsuch as The Strokes' \"Is this It\" or Bob Dylan's \"Modern Times\" were released.\nNevertheless, this decade was not a good one…",
  "data/reddit-stocks/r/wallstreetbets/comments/nc8sj2/cnbcs_jim_cramer_is_so_full_of_shit.json": "Don't ask me why but I often watch Mad Money on CNBC. I also make note of where\nI got recommendations when I buy stocks, and I'm starting to realize how bad his\nrecommendations often are and how dishonest he is about his bad calls. A few\nexamples:\n\n\n\n1) Last night, someone called into to ask about…",
  "data/reddit-stocks/r/wallstreetbets/comments/neetnp/200k_allin_because_i_believe_that_uwmc_is.json": "I have shared my thoughts on UWMC in past. The company announced Q1 earnings and\nwhile they look like they are below expectations it was explained by the CEO\nthat because of the speed of their execution, their results are reflective of\nthe higher rate environment already while competitors are…",
  "data/reddit-stocks/r/wallstreetbets/comments/nehj2m/implied_volatility_surging_for_gamestop_gme_stock.json": "[Implied Volatility Surging For GameStop (GME) Stock Options\n\n](https://www.barchart.com/story/news/1712043/implied-volatility-surging-for-gamestop-gme-stock-options)\n\nInvestors in GameStop Corp. GME need to pay close attention to the stock based\non moves in the options market lately. That is…",
  "data/reddit-stocks/r/wallstreetbets/comments/nexq9s/gme_ta_big_breakout_today_setup_looks_better_than.json": "I don't normally play meme stocks - but I thought the GME technical setup was\nespecially intriguing recently.\n\nGME TA\n[https://preview.redd.it/1tmj448o6sz61.png?width=2233&format=png&auto=webp&s=1de6593bb253ff2a102250d3e4a97d521e0b3455]\n\nThe setup is a symmetrical triangle. Normally when…",
  "data/reddit-stocks/r/wallstreetbets/comments/ng5tcb/this_is_coin_every_time_there_is_high_volatility.json": "https://preview.redd.it/6ydt2a0mw2071.png?width=1495&format=png&auto=webp&s=5ff5e5a5934ea5239dccfd16965be359f35b3990",
  "data/reddit-stocks/r/wallstreetbets/comments/nje1e9/it_is_what_it_is.json": "So, I’ve been a holder since after the run up in January. I’ve held because I\nhave faith in the DD. I’ve held because I have faith in the apes. I’ve held\nbecause I believe the people causing this deserve what they get.\n\nThings have been going well... up until now.\n\nI am going through a lot. My…",
  "data/reddit-stocks/r/wallstreetbets/comments/njizhs/when_did_this_subreddit_become_therapy.json": "I swear if I see one more “I invested in GME before my wife and her boyfriend\nleft me” story I am going to shoot myself.\n\nThis subreddit is for two things: tendies and gambling\n\nSometimes we gain them and sometimes we lose ‘em, but that’s what this place is.\nIf you want to cry about your life there…",
  "data/reddit-stocks/r/wallstreetbets/comments/nk4m0g/amc_gme_spce_shorts_are_at_risk_or_losing_400.json": "While Reddit investors’ risky gambit continues to play out in their favor,\nshort-sellers are feeling the pain for a change. AMC is one of the three most\nshorted stocks alongside GME and Virgin Galactic (SPCE), all of which are\ntrading in the green today. Short-sellers are at risk of losing close to…",
  "data/reddit-stocks/r/wallstreetbets/comments/nk4z03/i_am_financially_ruined_and_my_life_is_hell.json": "The year was 2019. I was convinced that in two years at the latest we'd all be\neating cockroaches. They're a good source of protein, environmentally friendly,\nthey're crunchy, you can make bread with them, and cockroaches are fuckin\nsturdy. Nuclear war? No problem. The cockroaches give zero fucks.…",
  "data/reddit-stocks/r/wallstreetbets/comments/nlkayt/proof_i_have_to_get_a_banana_tattoo_if_amc_closes.json": "Okay guys, it's 1.30am here in Australia. Im gaming and watching my stonks.\nWatching AMC creep up and I say to my mates 'holy shit, if AMC closes above $20\ntonight I'll get an AMC tattoo' and immediately got told to post what I said to\nreddit. Considering I'm an $AMC and $GME January ape, I changed…",
  "data/reddit-stocks/r/wallstreetbets/comments/nlmlev/daym_it_feels_good_to_be_a_gme_hodler_in_times.json": "GME Daily Chart\n[https://preview.redd.it/7f0br59p2i171.jpg?width=2379&format=pjpg&auto=webp&s=8235e35a004aee7fa7f74e591251a636aa2421ce]\n\nSup, WSB folks!\n\nIt’s Roman here with my Technical ANALysis, remember me? I’m the guy who put the\nbeard on the line, stating that GME is heading at least to…",
  "data/reddit-stocks/r/wallstreetbets/comments/nlvay0/after_3_years_of_learning_investment_my_5_tips.json": "I had my fair share of losing money, trading capital drawdowns, busting my own\ntrading capital many times before finally learning from past mistakes to become\na better trader and stop do stuff like it's a mf casino.\n\nI don’t want to share with you something that you all heard so many times (yep,\nI…",
  "data/reddit-stocks/r/wallstreetbets/comments/nmtcr3/bb_technical_analysis_the_bottom_has_fully_been.json": "Is it time to pick some juicy berries? 🍇\n\nI had a look at $BB and assume that we finally formed the bottom. In the last\nfew days we saw a sharp rise which might continue in the next weeks. If we can\nbreak the 12$ resistance, the next targets would be aroung 25-28$.\n\nUsing Elliot wave theory we are…",
  "data/reddit-stocks/r/wallstreetbets/comments/nn268r/10_commandments_of_options_trading.json": " 1.  Thou shall always take 100% daily gains or 200% all time gains.\n 2.  Do not fall into temptation and buy during the first 30 minutes of market\n     open. (Selling positions is still permitted)\n 3.  Thou shall not buy calls on green days.\n 4.  Thou shall not buy puts on red days.\n 5.  Avoid…",
  "data/reddit-stocks/r/wallstreetbets/comments/nn36fw/there_is_no_silver_short_squeeze_happening_none.json": "Silver might go up nicely and for a time but don't get high on hopium, this is\nnot gonna go in the 100s.\n\nhttps://twitter.com/michaeljburry/status/1356111612759789568\n\n> A corner in the silver market has been tried before - and let's be clear, that\n> is what is being attempted now. In 1980, a rule…",
  "data/reddit-stocks/r/wallstreetbets/comments/nnriwg/amc_volume_price_analysis.json": "Hey fellow traders. Today, l’ll present to you a very strong bull case on AMC\nthat is not explained by simply putting a rocket emoji (I love this emoji by the\nway) or because someone else posted a strong YOLO bet on the stock. Here is my\nanalysis based on volume, price action, and a powerful pattern…",
  "data/reddit-stocks/r/wallstreetbets/comments/no5gqd/bb_shorts_won_on_friday_28th_may_next_week_bulls.json": "🍇 Chart update for $BB 🍇\n\nLast friday we saw a first attempt to start a new uptrend. The first price\ntarget (12$) was reached in less than 24 hours. Subsequently the price got\nheavily rejected at the resistance level of 12$, forming a bearish candle.\n\nThe volume on Friday was much higher than the…",
  "data/reddit-stocks/r/wallstreetbets/comments/nok7pa/opinions_on_why_the_big_short_investor_michael.json": "I'm a little confused about why the big short investor Michael Burry was visited\nby the SEC. When going over his archive of tweets he rails against tesla,\nrobinhood and warns of a bubble in the market; what I don't understand is why he\nwould be visited by the SEC for expressing his opinion on…",
  "data/reddit-stocks/r/wallstreetbets/comments/nosznl/people_are_missing_the_point_on_burrys_534m_tesla.json": "People don't see the full idea behind Michael Burry's TSLA short. Every single\narticle is about how he tweeted at papa Musk and how he thinks that the company\nis the worst thing since he dropped his glass eye into his cat's litter box.\n\nHe doesn't think that Tesla will implode. He doesn't think it's…"
}