{
  "data/reddit-changemyview/r/changemyview/comments/npgqnc/cmv_the_amount_of_morallyquestionable_or_couplike.json": "As Americans, we're always told to \"support the troops\"--and in many cases this\nseems harmless... But as I've learned more about history, it just is becoming\nharder and harder to \"support the troops\" knowing how many morally-questionable\nconflicts our country has been involved in...Iraq being the…",
  "data/reddit-changemyview/r/changemyview/comments/npgz6m/cmv_neither_isreal_or_palestine_should_be_blindly.json": "Lately I've seen a lot of #FreePalestine or #FreeIsrael in response to the\nrecent conflicts. Of course neither of these #s will change anything, but I\nthink supporting 1 side over the other is simply idiotic. There are perfect\narguments as to why either side is the good side, but the way I see it,…",
  "data/reddit-changemyview/r/changemyview/comments/npkmj2/cmv_internet_should_be_treated_like_a_basic.json": "The whole world, especially during the pandemic, is relying on the internet to\nfunction. Students need the internet to learn. People need the internet for\ndirections and most people use it for entertainment. Some restaurants use the\ninternet to order. I need to use the internet to pay my rent every…",
  "data/reddit-changemyview/r/changemyview/comments/npqmxa/cmv_universal_healthcare_would_be_cheaper_per.json": "I've seen a lot of posts online recently that we already pay for universal\nhealthcare, in the form of the money that we pay to private insurance, which is\ncorrect, but I think it goes even one step further.\n\nPreventative care.\n\nAmericans right now massively avoid preventative care because of…",
  "data/reddit-changemyview/r/changemyview/comments/nprez2/cmv_dubai_is_a_monument_to_wealth_and_consumerism.json": "I don’t have much to add beyond the title. Metropolises don’t just spring up out\nof nowhere in 30 years.\n\nRegarding wealth and consumerism, that much is obvious to the naked eye.\n\nA quick internet search will provide an insight into the horrific treatment that\nthe construction workers are subjected…",
  "data/reddit-changemyview/r/changemyview/comments/nq0nj3/cmv_we_should_forgo_rehabilitation_and_humane.json": "Deltas:\n\n * For showing why the punishment does more harm than good:\n   https://reddit.com/r/changemyview/comments/nq0nj3/_/h085rci/?context=1\n * For showing why such a punishment is actually a slippery slope (everyone’s\n   different take on what is vile):\n  …",
  "data/reddit-changemyview/r/changemyview/comments/nq1gif/cmv_the_us_electoral_college_is_outdated_and.json": "In 1824\n[https://en.wikipedia.org/wiki/1824_United_States_presidential_election], 1876\n[https://en.wikipedia.org/wiki/1876_United_States_presidential_election], 1888\n[https://en.wikipedia.org/wiki/1888_United_States_presidential_election],…",
  "data/reddit-changemyview/r/changemyview/comments/nq2gpf/cmv_in_the_developed_society_we_live_in_today_we.json": "My belief is that we should have universal healthcare that is very cheap if not\nfree. People developing diseases like cancer isn't their fault. We all have a\nchance of getting cancer in the future, and we shouldn't have to worry about\nmassive health costs for things that aren't even our fault.…",
  "data/reddit-changemyview/r/changemyview/comments/nq8zyx/cmv_people_glamorize_weed_way_too_much.json": "I smoke frequently, but way too many people (especially on Reddit) look at weed\nas some harmless plant that solves all the worlds problems. And I know weed is\nsafer than alcohol, cigarettes, coffee, sugar and almost every drug in the book\nbut that doesn’t necessarily mean it’s safe, especially when…",
  "data/reddit-changemyview/r/changemyview/comments/nqqgtq/cmv_youre_a_hypocrite_if_you_make_small_dick.json": "I have noticed recently that self-proclaimed proponents of body positivity -\ntypically found on twitter, also are quick to say things such as \"found the guy\nwith a small dick\", or make jokes at the expense of short men. They're the first\nto default to making fun of Trump's hands, while…",
  "data/reddit-changemyview/r/changemyview/comments/nqsmol/cmv_everyone_is_all_mental_health_awareness_until.json": "People stigmatize personality disorders way too much. There are entire basically\nhate subreddits saying everyone with one is inherently abusive. I have\nBorderline Personality Disorder and on Reddit alone I’ve gotten called a\n“monster” been told that I should be “sterilized”, etc simply for saying I…",
  "data/reddit-changemyview/r/changemyview/comments/nqu1ae/cmv_blaming_a_gun_owner_for_having_their_gun.json": "Let’s say John as a single guy leaves a couple of his firearms outside of his\nsafe in his home. No one lives with him nor is supposed to have access to his\nhome.\n\nIf someone breaks into his home and takes one/some of his firearms and you blame\nJohn for that or for the crime committed afterwards with…",
  "data/reddit-changemyview/r/changemyview/comments/nqx4sv/cmv_twitter_will_always_breed_extremist_views_as.json": "Everyone always talks about how twitter is toxic and is responsible for cancel\nculture, but no one ever talks about why that is.\n\nIn my opinion, the mechanics of social media are wholly to blame.\n\nIf you don't have nested comments, no one can have a more meaningful\nconversation about any topic. It…",
  "data/reddit-changemyview/r/changemyview/comments/nr4t7n/cmv_the_electoral_college_system_would_be_more.json": "For example, if 60% of Californians had voted for Biden and 40% for Trump, then\n60% of its 55 electoral votes (33) would have gone to Biden and 40% to Trump. Of\ncourse, it wouldn't come out evenly oftentimes so you'd have to do some awkward\nrounding.\n\nThe reason I like this better is because the…",
  "data/reddit-changemyview/r/changemyview/comments/nrfbrg/cmv_democrats_will_regret_it_if_they_ever_get_rid.json": "To preface, the filibuster in its current form is awful. So, I'm not saying that\nchange isn't needed. What I do believe, is that if Democrats do get rid of the\nfilibuster they will regret it.\n\nDemocrats will not hold onto the senate forever. The Republicans will be back in\ncharge of both chambers at…",
  "data/reddit-changemyview/r/changemyview/comments/nrho97/cmv_there_are_no_good_or_bad_music_genres_just.json": "I get it. Rock is your favorite music genre, you hate country or pop. Whatever\nit is, it doesn’t make your favorite genre “the one”.\n\nMusic is like food. There’s pizza, hamburguers, sandwiches, tacos, burritos,\nnuggets, etc. That doesn’t make one better than the other. But there are people\nor…",
  "data/reddit-changemyview/r/changemyview/comments/nsd1zb/cmv_the_majority_of_selfhelp_books_are_painfully.json": "This post has been on the back burner for a while now, because of an\nundisputable insecurity regarding my premise. There were quite a few gray areas\nthat could have proliferated some misunderstandings, and due to this, I’ll try\nmy best to be as unambiguous and precise as possible.\n\n 1. I do not want…",
  "data/reddit-changemyview/r/changemyview/comments/nsmrl2/cmv_biological_immortality_for_humans_will_not_be.json": "I read stories of Aubrey de Grey who think we are going to defeat biological\nimmortality in 15-20 years. I want to believe him, but we don't even completely\nunderstand why we age or the human body as a whole. He comes off as more of a\nsnake oil salesman at worst, and someone who is scared of his own…",
  "data/reddit-changemyview/r/changemyview/comments/nsvmmv/cmv_incel_rhetoric_doesnt_get_as_much_pushback.json": "https://mobile.twitter.com/SportIsARight/status/1178619997704327168\n\nhttps://everydayfeminism.com/2017/04/cissexist-say-never-date-trans/\n\nhttps://mobile.twitter.com/blackfatqueer/status/1169449076573822976\n\nYou can find many examples of people voicing opinions such as “It’s bigoted to\nnot date or…",
  "data/reddit-changemyview/r/changemyview/comments/nszc6d/cmv_gender_identity_is_entirely_arbitrary_and.json": "Alright, let's start with some basics before the pitchforks come out. I do not\nsupport the restriction of people's rights to self expression or bodily autonomy\nor any other potential right the people who don't support trans people want to\nrestrict. If you want to remove your organs and replace them…",
  "data/reddit-changemyview/r/changemyview/comments/nt0c9d/cmv_choosing_to_wear_a_mask_in_certain_crowded.json": "Am I living in fear because I wear a seat belt, use turn signals and follow\ntraffic signs? Am I living in fear because I wear sunscreen? Am I living in fear\nbecause I get vaccines and make sure my daughter is vaccinated? Am I living in\nfear because I brush my teeth everyday and floss a few times a…",
  "data/reddit-changemyview/r/changemyview/comments/nt4vt3/cmv_all_religion_should_have_their_ideology.json": "I think any set of ideas (religious or not) should be open to criticism, but I\nfeel in society we are not free to criticize some of the ideas within Islam.\n\nTechnically we are “Free” but Personally I feel that there is a lot of hostility\nwhen Islam is brought into conversation. The same level of…",
  "data/reddit-changemyview/r/changemyview/comments/nt528x/cmv_if_dr_aruna_khilanani_is_not_called_out_for.json": "https://nypost.com/2021/06/04/nyc-pyscho-fantasizes-about-shooting-white-people-in-yale-talk/\n\nThe existence of institutional racism against BIPOC does not imply the\nimpossibility of the existence of the same against a different set of humans by\na different institution.\n\nAny white person making the…",
  "data/reddit-changemyview/r/changemyview/comments/nt9rty/cmv_communist_symbols_and_iconography_are_just_as.json": "Communist symbols & iconography are often considered cool and hip. They are put\non handbags, t- shirts, jackets, posters, bumper stickers, etc. Think Che t\nshirts, mao hand bags, red stars, hammer and sickles, etc. I think these symbols\nare just as detestable as a Nazi swastika or SS lightning…",
  "data/reddit-changemyview/r/changemyview/comments/ntdnon/cmv_you_are_allowed_to_explosively_lose_your.json": "Everyone should learn to control their temper, be more understanding,\nde-escalate a situation, find a non-angry solution and if all else fails, be\nallowed to remove themselves from the scene\n\nBut if a person is trapped in a scenario where they are not allowed to escape\ne.g. being cornered/restrained…",
  "data/reddit-changemyview/r/changemyview/comments/ntiusi/cmv_believing_in_a_zodiac_sign_seriously_is_stupid.json": "First I would like to mention, if you are into in astrology and find it\ninteresting then you do you, I may not personally get it but if it makes you\nhappy, who am I to take that away\n\nHowever what really grinds my gears are apps like tinder showing you the zodiac\nsign of each potential partner, OMFG…",
  "data/reddit-changemyview/r/changemyview/comments/ntke9k/cmv_not_taking_responsibility_for_things.json": "Players blaming their teammates when they die.\n\nStudents blaming their teachers when they fail.\n\nParents making their children as scapegoats to continue living together.\n\nPeople blaming foreign country's intervention for their own misery even after\nseveral years.\n\nEVERYONE blaming their genes for…",
  "data/reddit-changemyview/r/changemyview/comments/nuaibc/cmv_abortion_debates_will_never_be_solved_until.json": "Taking a different angle from the usual abortion debates, I'm not going to be\narguing about whether abortion is right or wrong.\n\nInstead, the angle I want to take is to suggest that we will never come to a\nconsensus on abortion because of the question of what constitutes life. I\nbelieve that if we…",
  "data/reddit-changemyview/r/changemyview/comments/nugh21/cmv_its_not_wrong_to_try_to_find_a_cure_for_autism.json": "Full disclosure: I am a 13 year old Male who is just barely on the spectrum and\nI have light aspergers.\n\nThat being said, my experience isnt the worse you can have if you’re autistic. I\njust randomly lose my train of thought while speaking, and get easily distracted\nwhile studying.\n\nThis is really…",
  "data/reddit-changemyview/r/changemyview/comments/nuv03b/cmv_opinion_pieces_without_facts_should_no_longer.json": "\"Democrats are idiots\" and \"republicans are Nazis\" serve no real purpose other\nthan profiting the greedy creator by luring in extremists who want biased\nsources to reinforce their viewpoint.\n\nBut opinion pieces without facts are pure rhetoric and sometimes even\npropaganda. News means noteworthy…",
  "data/reddit-changemyview/r/changemyview/comments/nv06a5/cmv_online_games_should_have_option_to_disable.json": "If you want, you should be able to disable custom visuals of fellow players.\nThis would mean that they would appear to you in their standard skins but from\ntheir perspective nothing changes. This will keep largest possible player base\nhappy and thus will keep the game alive longer.\n\nThere are…",
  "data/reddit-changemyview/r/changemyview/comments/nv1k3r/cmv_the_prolife_movements_tactics_to_dissuade.json": "Let me preface this by saying that I’m Pro-Choice. I do think women have the\nright to control what’s going on in their bodies. I will caveat that I’m not a\nproponent of late term abortions though. I personally draw the line at 21 weeks,\n5 days. So around 5 months. Why this specific number? Well,…",
  "data/reddit-changemyview/r/changemyview/comments/nv3g1t/cmv_tipping_should_not_be_expected.json": "I find it incredible that tipping is expected for good friendly service.\n\nThe job role of a server is to provide good service. Why should the customer pay\nextra to contribute to the wage of someone just for doing their job? I know\nthere is an argument for them not being paid enough, but surely its…",
  "data/reddit-changemyview/r/changemyview/comments/nv95y1/cmv_identity_politics_and_affirmative_action.json": "The relentless focus on identity politics, which has wide ranging\nmanifestations, does not do anything to truly promote social equality. It is the\nmoral equivalent of tweeting \"thoughts and prayers\" to victims of a mass\nshooting - it is a public communication that does absolutely nothing to…",
  "data/reddit-changemyview/r/changemyview/comments/nve9ud/cmv_selling_people_into_slavery_is_just_as_bad_as.json": "We are taught that Europeans ran around snatching up Africans with nets when in\nreality they were sold by warring African tribes. They sold each other's\nprisoners of war, dwindling each other's numbers for a profit. For some reason\nwe place the burden of guilt squarely on the buyers and give the…",
  "data/reddit-changemyview/r/changemyview/comments/nvgm9d/cmv_suicide_isnt_selfish_and_people_that_say_it.json": "People that say suicide is selfish are themselves selfish. People that are\ndepressed to the point of suicide just want relief from their own suffering.\nThey want peace from this hellish and cruel world. Imagine being in such pain\nand distress that you'd rather end your own life than to keep going.…",
  "data/reddit-changemyview/r/changemyview/comments/nvlcqh/cmv_the_patriots_of_metal_gear_solid_2_raise_a.json": "The video game Metal Gear Solid 2 which came out back in 2001 contains some\nshockingly prescient writing when it comes to their villains (well one of their\nvillains the plot of the games makes your average Chris Nolan movie look clear\ncut and simple) have an evil scheme for being able to control…",
  "data/reddit-changemyview/r/changemyview/comments/nvu1zw/cmv_workers_not_by_default_entitled_to_the_full.json": "Derived from the writings of Marx, and the labor theory of value, many of those\non the left claims that all workers are exploited, due to the fact that because\nthey sell their labor to capitalists and are not rewarded the full value of the\ncommodities they produce with their labor. However, labor…",
  "data/reddit-changemyview/r/changemyview/comments/nvxxx5/cmv_nothing_makes_me_angrier_than_calling_a.json": "Nothing boils my blood quicker than for example calling fedex, getting to an\nautomated menu, and having a patronizing voice on the other end ask me with fake\nsweetness \"what do you need?\", requiring me to use my ACTUAL VOICE to talk to a\nmaddening menu robot. Instantly ruins whatever good mood I'm…",
  "data/reddit-changemyview/r/changemyview/comments/nvyxnc/cmv_hashtags_or_slogans_like_bigisbeautiful_or.json": "Firstly, let's assume for argument sake that society preferring skinny/fit\npeople over fat people is a social construct. Even if that were the case, you're\nnot going to change what people find attractive by telling them what is\nattractive. People were never told to find fit people attractive, we…",
  "data/reddit-changemyview/r/changemyview/comments/nvzzw8/cmv_if_you_look_like_girl_talk_with_a_feminine.json": "If all signs indicate that you are a certain gender, then there's really no\npoint in you telling me your third person pronouns. It's very simple. Now if you\nknow that it is harder for people to tell what gender you are, then I get why\nyou would need to tell me your pronouns. But I've had people come…",
  "data/reddit-changemyview/r/changemyview/comments/nw01pe/cmv_sports_fans_are_just_as_lazy_and_unhealthy_as.json": "To preface this post, there's nothing wrong with wasting time in any way you see\nfit. But there is a difference in the way these hobbies are viewed.\n\nFrom my personal view, many sports fans kick back, drink beer and eat junk food\nwhile enjoying the game. The demographic is a ton of old has-beens who…",
  "data/reddit-changemyview/r/changemyview/comments/nwe8d1/cmv_the_campaign_by_republicans_to_denounce_the.json": "Ironically, I think Mitch McConnell said it best when he said that rejecting the\nresults of the US presidential election “would send democracy into a death\nspiral.”\n\nIt’s been almost 8 months now since Biden was declared the winner and I still\nwill see republicans talking about the stolen election,…",
  "data/reddit-changemyview/r/changemyview/comments/nwhraf/cmv_the_lgbt_community_is_managing_to_harm.json": "Tl:dr - putting yourself in a separate bubble only results in others not liking\nyou. If conservative views are now the minority can we please just merge with\nnormal society where no one needs to give a fuck who you’re with, as there is\nlegal representation, and far more accepting views, and we can…",
  "data/reddit-changemyview/r/changemyview/comments/nwimxp/cmv_islam_is_an_outdated_religion_that_has_no.json": "For starters, I grew up in a heavily religious muslim household and I am now an\nex-muslim and an atheist. I grew up under sharia law for my childhood. I now\nrealize how indoctrinated and brainwashed I was into believing into this\nreligion. For one, no one ever talks about how the prophet was a…",
  "data/reddit-changemyview/r/changemyview/comments/nwintw/cmv_being_an_internationally_recognized_adult.json": "https://graziadaily.co.uk/life/in-the-news/who-is-father-lana-rhoades-baby-pregnant/\n\nThis is the article that inspired me to post this. It was shared by numerous\ngirls in my town, with captions aimed towards the toxic men of today. Apparently\nwe have to stop viewing this porn star as a porn star…",
  "data/reddit-changemyview/r/changemyview/comments/nx1bp4/cmv_if_your_genetically_healthy_child_is_morbidly.json": "Title says it all.\n\nIf you are a parent to a child ages 0-12 (without genetic conditions), and\nthey're obese. That's your fault.\n\nYou let them become that. Now they'll have health issues, get bullied at school,\nwon't be able to participate in sports as much, self-esteem issues, and have to\nwaste a…",
  "data/reddit-changemyview/r/changemyview/comments/nxaiiu/cmv_most_companies_dont_really_care_about_suicide.json": "Companies like Google pretend to care about suicide by linking help call lines,\nand other employers will pretend to care by offering \"counseling\" but they don't\nreally care. In fact, I'd say most people don't care. They only care enough to\nspew out some platitude about \"we could have never…",
  "data/reddit-changemyview/r/changemyview/comments/nxgs3e/cmv_somaliland_should_be_recognized_as_a.json": "Somaliland is a former British Protectorate that was called British Somaliland\nand they joined with Italian Somaliland after independence to form Somalia.\n\nAfter the dictatorship and civil war the country of Somalia has been plagued by\nviolence, anarchy and insurgencies.\n\nSomaliland on the other…",
  "data/reddit-changemyview/r/changemyview/comments/nxidkc/cmv_internal_monologue_should_be_more_normalized.json": "You ever see a scene in a film or a show that just makes you go, \"uhhhhhhh, what\nwere you thinking?\"\n\nI find that there are many scenes in film and television that are a little too\nopen to interpretation. Often it would be helpful for the audience to know\nexactly what a character is thinking, and…",
  "data/reddit-changemyview/r/changemyview/comments/ny2f0q/cmv_the_lgbt_black_lives_matter_combo_flag_is.json": "I'm going to preface this by saying that I am part of the LGBT community and\nnone of what I'm going to say is against the movements just my distaste of them\nbeing crammed together.\n\nSo this new flag is just fundamentally ugly right? Like brown never looks good\non a flag and you are taking an good…",
  "data/reddit-changemyview/r/changemyview/comments/ny3cy9/cmv_its_unhealthy_to_not_do_things_because.json": "Following social trends doesn't mean one is lacking originality.\n\nMingling with other people is a healthy, natural process which improve\nsociability and allows one to interact with other people.\n\nAs long as people behave on their free will to imitate others, it's fine.\n\nBeing naive, gullible and…",
  "data/reddit-changemyview/r/changemyview/comments/nya50v/cmv_non_binary_people_arent_women_so_im_confused.json": "To preface this, I am a lesbian. However I am also a cis girl, and the most I\nhave of a second opinion are non binary friends that I have.\n\nBut basically the title. Non binary people aren't really either men or women,\nand they shouldn't be forced into those binary categories. Which is why I find\nit…",
  "data/reddit-changemyview/r/changemyview/comments/nycakk/cmv_it_should_be_illegal_for_parents_to_have.json": "There are usually two reasons people put forward to justify mutilating an\ninfant's genitals:\n\n * Because it's more \"hygienic\" that way\n\n * Because my religious book/authority says I should do it\n\nLet's pick those two apart shall we?\n\n * No one in their right mind would say that mutilation is an…",
  "data/reddit-changemyview/r/changemyview/comments/nyl07l/cmv_if_you_intentionally_drive_a_loud_car_you_are.json": "Please tell me why you have to drive a loud car/bike?? And rev that shit in the\nmost public places?? Do you really need attention THAT bad? If you wanna go to a\nshow or whatever and do it with like minded people, more power to you! But do\nyou really think the rest of society wants to hear that…",
  "data/reddit-changemyview/r/changemyview/comments/nymbva/cmv_people_need_to_call_out_news_articles_that.json": "I see this a lot in British news. British news, especially the less serious\nnews, is vile and unethical, and over half their articles go:\n\n\"a source says\"\n\n\"an anonymous source said\"\n\n\"a source informed on the matter said\" (fyi this often can mean another\nreporter, they give \"sources\" to each other…",
  "data/reddit-changemyview/r/changemyview/comments/nyv7dt/cmv_nonjapanese_wearing_kimono_or_nonindians.json": "People have different definitions of cultural appropriation. Some think that it\nis simply a matter of how disrespectful the act is. Others believe that other\nfactors, such as the oppressor-oppressed dynamics between the cultures that\ntakes practices and the cultures from which they are taken, are…",
  "data/reddit-changemyview/r/changemyview/comments/nz2kwb/cmv_when_it_comes_to_relationships_looks_are_as.json": "Hi all, I wanted to go for a light topic today! I’ve been having this chat in\nreal life with my GF, and I want to ask what you all think. I think we all heard\nthe idea that personality is more important than looks when it comes to our SO.\nI simply don’t believe so. I do not believe that looks are…",
  "data/reddit-changemyview/r/changemyview/comments/nz8d5d/cmv_tariq_nasheed_is_a_grifter_that_pushes.json": "Tariq Nasheed's latest documentary 'Buck Breaking' makes unverifiable claims\nthat slave owners ritualistically sodomized slaves as a form of control. He has\nclaimed slave rebellions often failed because black women \"snitched\" on\nrebelling slaves. He has also made inflammatory claims about hate…",
  "data/reddit-changemyview/r/changemyview/comments/nzar9l/cmv_the_word_opressed_is_flung_around_way_too_much.json": "If someone calls what you identify with a bad name or slur, you are not being\nopressed. Oppression is when someone or a group of people are consistently\ndenied rights and are treated harshly due to one common link.\n\nUhgyrs in China are being opressed\n\nGays in Iran are being opressed\n\nJews in Nazi…",
  "data/reddit-changemyview/r/changemyview/comments/nzf3z2/cmv_i_dont_think_trans_surgery_should_be_allowed.json": "So, I completely support the lgbtq+ community, and I support trans kids, who\nhave gotten the surgery, even if I think they shouldn't have. I would never call\nsomeone out or insult someone for doing it, I just disagree. But my main opinion\nis that children who identify as trans should not be able to…",
  "data/reddit-changemyview/r/changemyview/comments/nzgoqq/cmv_there_should_be_an_age_restriction_for.json": "The youngest president to be elected in the last 100 (according to a google\nsearch, might be off) was Kennedy, who was 43 when he entered office. Trump is\n75, Biden is 78. Both of them have had multiple incidents which make you\nquestion the state of their mental health, which in turn makes you…",
  "data/reddit-changemyview/r/changemyview/comments/nzmm6f/cmv_people_who_blast_their_music_when_refueling.json": "So this week I went on a little road trip and had to refuel my car twice. Both\ntimes I had a similar thing happen and it really made me angry so I am posting\nhere to see if my anger is justified.\n\nSo both times it was something similar:\n\nYoung guy pulls up with his sports car (looks like sports car…",
  "data/reddit-changemyview/r/changemyview/comments/nzrxw8/cmv_there_is_so_little_evidence_to_supportexplain.json": "Given everything we understand about consciousness, it seems pretty clear that\nthe brain is required for any kind of conscious experience, and that once a\nbrain that is not functioning, or has rotted away all together, there will be no\nother consciousness to speak off.\n\nWe already know that certain…",
  "data/reddit-changemyview/r/changemyview/comments/nzucvp/cmv_actors_should_be_allowed_to_play_any_role.json": "This has been bugging me since Alison Brie was forced to apologize for voicing\nDiane Nguyen, a Vietnamese Amercian character from BoJack Horseman.\n\nSimply put, I find the entire situation ridiculous. It is the nature of actors'\njob to play someone they are not! \"Cancelling\" performers for accepting…",
  "data/reddit-changemyview/r/changemyview/comments/nzwuv0/cmv_believing_black_lives_matter_does_not_require.json": "So I have argued this for a while, someone came up to me and asked me if, \"I\nthought black lives matter\" this was in a major city (Seattle) and I said, \"The\nconcept of black people being equally as important and supported as any race and\nthey shouldn't be blindly murdered, Yes I think black lives…",
  "data/reddit-changemyview/r/changemyview/comments/nzxpde/cmv_preventing_normal_teenagers_from_having_sex.json": "Some disclaimers: I use the US as an example because someone I know was an\nexchange student there, but I am fully aware it’s not only an American thing to\ndo. I am not trying to make fun of anyone’s culture, every culture has their\nweirdnesses and shortcomings, my own (Denmark) included.\n\nSo in many…",
  "data/reddit-changemyview/r/changemyview/comments/o04nbs/cmv_culture_appropriation_is_not_a_crime_and.json": "As per my understanding, culture appropriation means adoption of certain aspects\nof foreign cultures which may or may not be for profit.\n\nWhenever a celebrity makes an attempt to utilise characteristics of a culture\nthat is not theirs, I often notice people bringing up 'culture appropriation'.\n\nI…",
  "data/reddit-changemyview/r/changemyview/comments/o0acjx/cmv_fines_should_be_proportional_to_a_persons.json": "When someone gets, for example (but not exclusively) a parking fine, the amount\nthey have to pay should change depending on how much money they earn. This is\nbecause the fine is not a payment for an item, it's supposed to be a punishment\nand a deterrent. If someone with no income has to pay a £50…",
  "data/reddit-changemyview/r/changemyview/comments/o0f4ca/cmv_calling_any_rightleaning_person_or_thing.json": "To be clear, I am firmly leftist so feel free to consider how this influences my\nobservations and assumptions.\n\nBeing on reddit - a rather leftist space - I have noticed a lot of people\ndecrying any policy that is right of centre as fascist. I also particularly\nnotice this on things like supporting…",
  "data/reddit-changemyview/r/changemyview/comments/o0rdib/cmv_its_racist_to_ask_that_we_support_businesses.json": "I'm going to preface this by saying I'm actually terrified to state my view.\nNevertheless my curiosity has overtaken my fear, which is why I'm here. I don't\nmean to be disrespectful in any way.\n\nIf this is relevant to my stance in any way, I belong to a minority.\n\nWhen someone asks that people…",
  "data/reddit-changemyview/r/changemyview/comments/o0tqt9/cmv_americas_dont_really_understand_what_farleft.json": "I'm going to start this post by saying that I'm super jet-lagged and I'm just\nlooking for a way to pass the time while I try to fall asleep. So, please\nforgive me if this does not make much sense and please know that I'm more than\nready to change my view, or at least have it adjusted.\n\nAnyway, it…",
  "data/reddit-changemyview/r/changemyview/comments/o0z7ao/cmv_some_transgender_nonconforming_activist_ideas.json": "So, in thinking about how I'm raising, and will continue to raise, my children,\nI've realized something. You can't simultaneously teach the most extreme forms\nof trans acceptance and that gender roles are harmful social constructs.\n\nSo basically, we're trying to open up our society to all of these…",
  "data/reddit-changemyview/r/changemyview/comments/o14pd6/cmv_just_be_yourself_is_unhelpful_advice.json": "When someone asks for help about an interview, dating, or other social\nsituation, the go-to advice that people give is to \"just be yourself\".\n\nI find this advice useless for two reasons:\n\n 1. I am lazy and lack confidence. If I was being myself, I would avoid social\n    situations altogether. If I…",
  "data/reddit-changemyview/r/changemyview/comments/o1652c/cmv_sponsored_product_reviews_are_not_real.json": "I have been working primarily from home as a Full Stack Developer for the past\nseveral years. My fingers have been married to a keyboard since my early teens,\nand as I make the climb through my late 20s, I am starting to feel the effects\nof constantly sitting down. Earlier this week, I came to the…",
  "data/reddit-changemyview/r/changemyview/comments/o18xv8/cmv_when_the_media_reports_on_offensive_social.json": "A common trend I have been noticing for a while is that when an old social media\npost by a celebrity is unearthed and the story makes the news, mainstream media\noutlets typically do not actually include the posts in question in their\narticles. The article might say something like 'X posted several…",
  "data/reddit-changemyview/r/changemyview/comments/o19q0x/cmv_workplace_programs_should_be_the_focus_of.json": "I'm specifying North America because most of my knowledge about the obesity\nepidemic and interventions is about the US and Canada, but I'm sure it applies\nelsewhere too. From my knowledge, most government initiatives for reducing\nobesity and improving nutrition/exercise knowledge have focused on…",
  "data/reddit-changemyview/r/changemyview/comments/o1f61x/cmv_optical_insurance_should_be_part_of_regular.json": "In the US, vision insurance is usually sold separately from health insurance\nplans for the rest of your body. The reason for this, I understand, is\nhistorical. Eye doctors/optometrists aren't educated at the same facilities as\nophthalmologists and the professions were historically considered…",
  "data/reddit-changemyview/r/changemyview/comments/o1hr2f/cmv_terminator_2_is_the_most_solid_action_movie.json": "The story is really well done and engaging. The characters all have a good arcs,\nand even the cold unfeeling robot is able to learn what it means to be human by\nthe end of the film. The action in the film is not just to have mindless action,\nit serves a purpose based on what the characters are…",
  "data/reddit-changemyview/r/changemyview/comments/o1m9oo/cmv_antivaxxers_and_antimaskers_from_rich.json": "I’ve often seen sentiments to the tune of: Anti-Vaxxers are victims of a poor\neducation system or poverty. They’re people who slipped through the net. Dropped\nout of school.\n\nNah I don’t buy it.\n\nIn developed countries, everyone gets access to an education. The people coming\nout of the woodwork as…",
  "data/reddit-changemyview/r/changemyview/comments/o1n0y6/cmv_the_price_of_your_restaurant_bill_should_not.json": "First of all, I want to clarify that I am not against tipping in anyway. I've\nworked in the restaurant industry and make sure to always tip well. However, I\ndon't like the common idea of tipping 15-20% of your bill. For instance, one\nwould tip their waiter $10 if they get a $50 plate (going with 20%…",
  "data/reddit-changemyview/r/changemyview/comments/o1zw15/cmv_rfemaledatingstrategy_is_nothing_but_toxic.json": "As the title says, FDS is nothing but toxic. Every single time I’ve opened that\nsubreddit all I EVER see is women complaining about men for whatever reason. Man\ngoing through a hard time? He needs to man up. Man got it going good for him? He\nstepped on women to do it. Literally, is a whole thread…",
  "data/reddit-changemyview/r/changemyview/comments/o21s4g/cmv_on_first_dates_the_bill_should_almost_always.json": "I’m a guy who goes on quite a few dates, mostly with girls met on Tinder or\nother dating apps. Like the practice of tipping, guys paying for the girl isn’t\ninherently required but there are currently strong social norms pressuring for\nit. Up until now I’ve been footing the bill on the first date,…",
  "data/reddit-changemyview/r/changemyview/comments/o25pu5/cmv_us_federal_elections_should_operate_by_the.json": "Now, we all know that the debate is something.to the effect of \"but we don't do\nit that way here\" My opinion is that if they want to have a caucus and bake sale\nand have delegates and candidates picked by Helen the Psychic Chicken, keep that\nshit to local elections only. For federal elections, one…",
  "data/reddit-changemyview/r/changemyview/comments/o290q4/cmv_death_penalty_is_sometimes_necessary.json": "Context: in Brazil, there is a serial killer called Lázaro who’s been killing\npeople since 2007. He has already gone to prison three times since then and\nescaped every time. Recently he killed a whole family in Brasília, and the\npolice is still looking for him.\n\nThere is no death penalty in Brazil…",
  "data/reddit-changemyview/r/changemyview/comments/o2dy9t/cmv_the_thing_of_girls_who_makesuggest_their.json": "I've heard and read about lots of women who make or suggest that their boyfriend\nunfollow attractive girls on instagram or twitter and stuff because it makes\nthem feel uncomfortable and, in some cases, disgusted. This seems to be rooted\nin some sort of insecurity and jealousy that (primarily) girls…",
  "data/reddit-changemyview/r/changemyview/comments/o2emnh/cmv_banning_nuclear_power_because_of_chernobyl_is.json": "One badly made example shouldn't ruin the whole thing. Chernobyl happened\nbecause of a combination of neglect and cheap-and-nasty Soviet technology, yet\nthe message from this tragedy was \"NuClEaR pOwEr BaD\", setting nuclear power\nback many years and unfairly stigmatising it as unsafe. Imagine if…",
  "data/reddit-changemyview/r/changemyview/comments/o2g3rk/cmv_there_is_no_platform_for_the_republican_party.json": "CMV: There is no republican party, only greedy conspirators and people that are\nbrainwashed\n\nI have a tendency to speak my mind on social media and I engage into discussions\nwith people on both sides. I have come to the conclusion that while the left has\nits issues, every person that I speak to that…",
  "data/reddit-changemyview/r/changemyview/comments/o2gsi5/cmv_sjws_have_done_more_for_altright_recruitment.json": "When ‘social justice warriors’ go on about how all white people are all racist,\nare everyday white citizens who make an effort to not be racist going to enjoy\nhearing this? No. Instead they’ll get annoyed and may even begin to develop a\nhatred for these kinds of people. Although the majority of…",
  "data/reddit-changemyview/r/changemyview/comments/o2h55v/cmv_there_is_absolutely_no_reason_tipping_should.json": "Tipping is optional outside of North America, and frowned upon in Asia, yet in\nCanada and the U.S. it is expected and sometimes mandatory in restaurants. I\nunderstand that in the U.S. the servers are paid $2 an hour and they need to\nmake up their pay in tips but let’s talk about where tipping…",
  "data/reddit-changemyview/r/changemyview/comments/o2k9uo/cmv_we_ought_to_lose_all_hope_about_the_situation.json": "Why do I say this?:\n\n 1. Direct military action against the PRC is suicidal because they have nuclear\n    weapons. Even if they didn't, who would be willing to sacrifice millions (if\n    not tens of millions) of their countrymen to liberate the Uyghurs? Also, in\n    the last 20 years, military…",
  "data/reddit-changemyview/r/changemyview/comments/o2p8cs/cmv_when_charlie_said_from_now_on_im_going_to_pay.json": "Willy Wonka and the Chocolate Factory.\n\nCharlie had just come home from watching other kids singing with the Candyman,\nthen ran a paper route on what must have been a nearly empty stomach. He walks\nin, sees his exhausted mom and looks at the one grandparent he knows perfectly\nwell could (and should)…",
  "data/reddit-changemyview/r/changemyview/comments/o2wlam/cmv_cutting_out_toxic_deleterious_or_just_not.json": "I practiced this method (to break off with someone completely) a few times in my\nlife. Doesn't matter if a sibling, a classmate or an old \"friend\", sometimes it\nwas for me the easy way out of an uncomfortable situation and I don't regret it\nso far (it's been a few years since). I am willing to deal…",
  "data/reddit-changemyview/r/changemyview/comments/o39qjf/cmv_juneteenth_is_a_stupid_name_for_a_day.json": "I think Juneteenth is a particularly bad name for any special day. I want to\npreface that I'm not saying anything about the day itself or any reasons for\ncelebrating it, just criticizing the name.\n\nFirst, the name doesn't tell anything about why it's celebrated. As someone\nwho's originally not from…",
  "data/reddit-changemyview/r/changemyview/comments/o3adet/cmv_antivax_doctors_and_nurses_and_other_licensed.json": "In Canada, if you are a nurse and openly promote antivaccination views, you can\nlose your license.\n\nI think that should be the case in the US (and the world, ideally).\n\nIf you are antivax, I believe that shows an unacceptable level of ignorance,\ninability to critically think and disregard for the…",
  "data/reddit-changemyview/r/changemyview/comments/o3kggd/cmv_reddits_downvote_button_is_for_when_you.json": "I was taught, somewhere, that the downvote button is for when a post breaks a\nsubreddit rule or hinders discussion. On Reddit's \"reddiquette\" page, it says\nthat \"if you think something contributes to conversation, upvote it. If you\nthink it does not contribute to the subreddit it is posted in or is…",
  "data/reddit-changemyview/r/changemyview/comments/o3kutx/cmv_golf_courses_are_incredibly_wasteful_and.json": "In the United States, 470 billion gallons of water is used annually to keep\ncourses green. Grass in general can be very difficult upkeep, on the grass on\ncourses especially so. I imagine more than any other Sport since the quality of\nthe grass really determines the quality of the game\n\nThe average…",
  "data/reddit-changemyview/r/changemyview/comments/o3mddh/cmv_without_sexist_gender_stereotypes_gender.json": "The foundation of \"gender identity\" as a concept is built upon sexist\nstereotypes. Gender identity legitimizes traditional gender roles and\nstereotypes, and repackages it as progressive.\n\nI also believe that everyone is gender non-conforming in their daily lives,\ntherefore everyone is functionally…",
  "data/reddit-changemyview/r/changemyview/comments/o3o3oj/cmv_if_you_need_to_sell_your_product_through.json": "Ever since the GME/WSB fiasco; the amount of ‘money influencers’ has exploded\nand their core business model is designed to hurt their audience rather than\nhelp. This is the same type of marketing which propped up ITT Tech which is well\nknown for scamming thousands of students with a useless…",
  "data/reddit-changemyview/r/changemyview/comments/o3qhoc/cmv_the_new_way_of_introducing_badass_female.json": "As I think many of you have, I've been watching a whole lot of TV series and\nfilms that came out since the pandemic hit.\n\nAnd something else that's been on the rise is the \"badass\" female protaganist.\n\nThe \"badass\" introduction has always been quite problematic, and I'll get into a\nspecific example…",
  "data/reddit-changemyview/r/changemyview/comments/o3tf3y/cmv_instead_of_trying_to_avoid_voter_id_laws_we.json": "Everyone should be able to vote, but absolute integrity is more important than a\nlittle inconvenience. So many countries have these requirements when their\nelections are free and fair.\n\nThe only issue is how someone can get an ID, but we should get legislators to\nbuild more DMVs and get them to open…",
  "data/reddit-changemyview/r/changemyview/comments/o41wcf/cmv_it_is_more_important_to_have_friends_who_are.json": "TITLE EDIT: IT IS MORE IMPORTANT TO HAVE FRIENDS WHO ARE RESPECTFUL THAN FRIENDS\nWHO AGREE WITH YOU\n\nPeople of reddit were correct, the title needed a rehash\n\nIn the era of polarizing politics, and the ability to more thoroughly vet your\ncolleagues before allowing them into your 'inner circle of…",
  "data/reddit-changemyview/r/changemyview/comments/o44ojs/cmv_the_ccp_is_the_biggest_threat_to_humanity.json": "There are a couple “theories” in this thread but they all combine to illustrate\na viable point that we should be afraid of the CCP.\n\nCCP has articulated their vision in a 100 year plan for decades now, and part of\nit is global supremacy.\n\nWe’ve seen it with Hong Kong, Tibet, Taiwan and Uyghars it’s…",
  "data/reddit-changemyview/r/changemyview/comments/o47m9j/cmv_white_people_should_not_be_angry_at.json": "All this outrage about Juneteenth is so ridiculous because it's completely\nunnecessary. It's not even a day celebrating black people. It's a day\ncelebrating the white people who fought and died and without any financial\nincentives to do so looked into their hearts and realized on a moral level…",
  "data/reddit-changemyview/r/changemyview/comments/o4cg7q/cmv_there_is_nothing_wrong_with_being.json": "How so many people don’t seem to get this, I’ll never understand. Most of the\n“arguments” against this that I’ve heard are “But (country) has problems with x,\ny, and z.”\n\nYou can love your country but still dislike parts of it, just the same way you\ncan love people and dislike things they do.…",
  "data/reddit-changemyview/r/changemyview/comments/o4dzfv/cmv_its_not_ableism_to_exclude_kids_from_parts_of.json": "I was reading this article:\nhttps://www.cnn.com/2021/06/18/opinions/down-syndrome-cheerleading-photo-utah-perry/index.html.\nand all this person seems to care about is the special needs kid's experience.\n\nI want to start off by saying I do not think the girl with down syndrome should\nbe excluded from…",
  "data/reddit-changemyview/r/changemyview/comments/o4jq4z/cmv_neopronouns_have_no_real_reason_to_exist_and.json": "I am all for gay/trans/whathaveyou rights, but some of the things that seem to\ninvolve the more 'complex' areas of the LGBT community don't make any sense to\nme. Among them are Neopronouns. \"Xir,\" \"Nir\", etc.\n\nI find them to be completely pointless and, in all honestly, stupid. 'They/Them'\nhas…",
  "data/reddit-changemyview/r/changemyview/comments/o4qq8y/cmv_your_tip_shouldnt_change_depending_on_the.json": "I don't really get why tips are typically thought of in terms of percentages\nrather than absolute dollar value. Like--it's not substantially more work for\nthe server to bring you a sixty dollar bottle of wine than a five dollar shot,\nso why would the former substantially increase how much they get…",
  "data/reddit-changemyview/r/changemyview/comments/o4ul60/cmv_it_is_hypocritical_to_advocate_for_cancel.json": "I believe there are mainly two types of cancel culture that we see today. The\nfirst type is just cancelling someone from the platform where they committed\negregious behavior on. If you act like a piece of shit at a bar, the bar can\ncancel you from stepping foot in their business in the future. If…",
  "data/reddit-changemyview/r/changemyview/comments/o4zdiw/cmv_in_the_vast_majority_of_instances_there_isnt.json": "More and more I hear the discourse from \"illuminated\" entrepreneur, managers and\nCEO complaining that they can't hire people for work X, that people nowadays\naren't willing to put in the work anymore, that it's hard to hire, and so on.\nAnd this comes from days before the current pandemic, so its not…",
  "data/reddit-changemyview/r/changemyview/comments/o5c8c7/cmv_a_lot_of_peoples_definition_of_cultural.json": "Cultural appropriation only consists of the following: 1.Someone taking all of\nthe credit (and perhaps profit) for inventing some idea which wasn't theirs to\nbegin with and which is an especially common practice in a specific culture, or\n2. Clearly using a costume to mock a certain culture, such as…",
  "data/reddit-changemyview/r/changemyview/comments/o5ci1v/cmv_the_default_position_of_public_toilet_seats.json": "Public toilet seats are almost always disgusting. If they are servicing any\nremotely busy location, some lazy asshole is inevitably going to get piss on the\nseat and not clean it off. As soon as that happens, all bets are off, no one\nfrom that point on sees it as their responsibility for cleaning…",
  "data/reddit-changemyview/r/changemyview/comments/o5ij09/cmv_elon_musk_is_vastly_overrated.json": "I am currently studying to become an engineer with focus on air/space flight,\nand a lot of colleagues tell me they want to work for Elon Musk. And i just dont\nget the hype, (the spaceX rockets are not bad dont get me wrong), I ( and\nespecially data) tell that they are not that efficient as the…",
  "data/reddit-changemyview/r/changemyview/comments/o5ljlh/cmv_arguing_that_homophobic_people_are_closeted.json": "I see the idea that \"homophobic\" people are, in general, gays themselves as if\nthey can't recognize their own sexuality is very common and for me doesn't make\nany sense and even portrays gays as being worse than the general public when it\ncomes to tolerance to others preferences.\n\nFirst of all, you…",
  "data/reddit-changemyview/r/changemyview/comments/o5tgmd/cmv_amazon_prime_day_is_a_consumer_scam_in_the.json": "I've noticed that a lot of items that were on sale are things that were either\nalready on sale elsewhere previously and on more than one occasion or that were\non sale and the supposed original price was extremely marked up beyond belief.\nOf course it seems like a sale if an item is $800 instead of…",
  "data/reddit-changemyview/r/changemyview/comments/o5udmv/cmv_i_can_hold_awful_views_such_as_sexism_or.json": "So, I am 70% sure that this is not a common opinion, although not 100%, which is\nwhy I mention this.\n\nIt’s mostly in the title, but I’ll give an example. Basically, if someone is\nugly, then I’ll be slightly out off by that, but I won’t actually do anything\nmean because of it. However, if I decided I…",
  "data/reddit-changemyview/r/changemyview/comments/o5xd1u/cmv_toxic_has_become_a_lazy_and_misleading.json": "First, sorry this is poorly articulated--it's an incomplete thought that I need\nto just get out so it stops distracting me from an all-consuming project I'm\nworking on. This belief has been mounting for a while, but I'll admit that the\nimpetus for this post is somewhat reactive. I just saw a NYT…",
  "data/reddit-changemyview/r/changemyview/comments/o60uny/cmv_raising_income_taxes_in_the_us_is_a_heavily.json": " 1. My main problem is not with the purpose of the income tax, but rather how\n    overwhelming the tax burden lies on the middle and upper middle class\n    relative to that of corporations. Effective tax rates as of right now in the\n    United States would have typical corporations paying around the…",
  "data/reddit-changemyview/r/changemyview/comments/o655d4/cmv_covid19_has_been_used_repeatedly_as_an_excuse.json": "Something I’ve noticed for a while has been the terrible excuse of covid to\nexplain manufacturers, distributors, and store fronts blatant laziness. For\nexample normal store fronts would have you purchase a product, take if home,\nfind out it’s defective and rather than offering an exchange, they…",
  "data/reddit-changemyview/r/changemyview/comments/o6bf41/cmv_prescribing_puberty_blockers_for_transgender.json": "Recently the NHS banned puberty blockers for kids under 16 years old looking to\ntransition to the opposite gender. In response to this ruling, there has been\nsocial media backlash (in particular on Instagram) saying that these puberty\nblockers are \"completely reversible\" and that \"trans youth should…",
  "data/reddit-changemyview/r/changemyview/comments/o6ediz/cmv_i_believe_the_usa_should_have_universal.json": "I've seen so many people go bankrupt and lose homes because of healthcare costs.\nDiabetes, cancer, lupus....these are diseases requiring expensive medical care\nfor survival. In the process, people have to manage daily life expenses and\noutrageous medical costs. It seems unfair to die because you…",
  "data/reddit-changemyview/r/changemyview/comments/o6g4x6/cmv_there_is_a_legitimate_discussion_to_be_had.json": "I was destroyed in the comment section earlier for saying I think there’s a fair\ndiscussion to be had about trans folks and sports. Let me be clear I\nwholeheartedly support the trans community and I want trans people to be\naccepted and comfortable in all aspects of life including athletic…",
  "data/reddit-changemyview/r/changemyview/comments/o6ncb2/cmv_every_time_a_media_personality_says_something.json": "It's becoming a legitimate business model where unethical \"news\" relies on\nsaying something false or incendiary, and if called out prints a tiny apology\nlater on. I think the only way to solve this is if there is a forced rule that\nthe apology must be as loud as the misinformation.\n\nSpend 5 minutes…",
  "data/reddit-changemyview/r/changemyview/comments/o6obio/cmv_criminals_who_are_given_life_without_parole.json": "I'm of the opinion that prison should be to rehabilitate criminals. to reform\nthem and to make them better people when they are released. I'm aware that\npeople are against the death penalty for things like false convictions and the\ncost of appeals. But what if they were given the option.\n\nBenefits…",
  "data/reddit-changemyview/r/changemyview/comments/o6obu5/cmv_people_in_heated_online_debates_are_more.json": "It seems that when people get angry in online debates, often due to their own\nignorance in their positions, they invent an opponent and lobby accusations\nagainst this person. The more heated they become, the bigger the strawman\nbecomes. Maybe this is partially because it is easier to hate this…",
  "data/reddit-changemyview/r/changemyview/comments/o6ou6j/cmv_while_there_is_honor_in_wanting_to_serve_your.json": "The US has not fought a defensive war since WWII, and at most maybe Korea could\nbe justified but that’s extremely hard to do. In recent years, the next closest\njustifiable war, Afghanistan, involved killing a terrorist group that had\nnothing to do with 9/11 and Osama Bin Laden was found hiding in…",
  "data/reddit-changemyview/r/changemyview/comments/o6ruav/cmv_having_mandatory_monthly_mental_health_check.json": "One of the things about mass shooters is that sometimes they can come out of\nnowhere. The warning signs can be very subtle and they can strike suddenly. If\nwe could have a semi mandatory mental health test given to students in all kinds\nof schools with an opt out option, the system could have the…",
  "data/reddit-changemyview/r/changemyview/comments/o6v0a9/cmv_reddit_fosters_groupthink_bias.json": "Simply put, Reddit makes it easy for users to suppress valid opinions with its\nflawed voting system. Downvotes are not used for their intended purpose to\nremove spam, trolling, and s***posts. They are used by people who disagree with\na perspective/stance that doesn’t align with their own. This leads…",
  "data/reddit-changemyview/r/changemyview/comments/o704ca/cmv_mcaffe_did_kill_himself.json": "Pretty sure most have heard about him committing suicide. I've been reading the\ncomments about it in various subs, and there are sooo many people claiming he\n\"got epsteined\" (in other words, he was assasinated)\n\nI tried to understand and see reasons why this might be true but nobody that\naccused him…",
  "data/reddit-changemyview/r/changemyview/comments/o72e20/cmv_onlyfans_and_our_overly_sexualized_society.json": "I feel like in the wake of pseudo-feminism we have this really weird push to be\noverly sexual and not consider the repercussions of that.\n\nI feel that making decisions to share your naked body with strangers is going to\nbite you in the ass at some point in your life. whether its…",
  "data/reddit-changemyview/r/changemyview/comments/o7610x/cmv_taxation_isnt_theft.json": "Taxes. Everyone hates taxes, everyone bitches about having to pay them but then\nthey complain about the roads not being paved sufficiently, and not having\nenough infrastructure ect ect... My view on taxes is this: In order to live in a\nhigh functioning society we will have to pay taxes. Like when…",
  "data/reddit-changemyview/r/changemyview/comments/o77pl6/cmv_theres_no_good_way_to_have_rules_against_hate.json": "Reddit itself has rules against 'hate speech', but neither reddit or any other\nplatform has been able to come up with a good, consistent definition of hate\nspeech that doesn't threaten to censor well-meaning and constructive free\nexpression.\n\nI think we can start by focusing on two major fundamental…",
  "data/reddit-changemyview/r/changemyview/comments/o7dxpg/cmv_people_should_be_allowed_to_discuss_uncertain.json": "Modern discourse on medicine and vaccines discourages critical thinking and\ncreates a rift in society. Individuals who says something in line with \"but what\nabout this thing I'm concerned about?\" In context of recent developments are\noften crucified, regardless of where they stand on established…",
  "data/reddit-changemyview/r/changemyview/comments/o7r5bn/cmv_thousands_of_upvotes_or_retweets_doesnt.json": "All social media platforms are just echo chambers where thousands or even\nmillions of people with similar view points will group together all agreeing\nwith and retweeting, liking, upvoting, etc, everything that is pro whatever the\ntopic is while anyone who disagrees is met with a swarm or push…",
  "data/reddit-changemyview/r/changemyview/comments/o7thtq/cmv_in_the_event_of_a_real_zombie_apocalypse_the.json": "To first establish some middle ground, I would think that zombies in this\nscenario are the typical. They are deadly but not overly supernatural. They\nshould embody the typical bite and bodily fluid types of infection, with\ninstantaneous 1 hour incubation times. (Sad to change such a vital piece…",
  "data/reddit-changemyview/r/changemyview/comments/o7u84n/cmv_if_companies_are_using_prison_labor_upon.json": "Now the easy thing to say here is… get rid of prison labor all together.\n\nSince that doesn’t look like it will happen any time soon, I think think more\nrequirements should happen in order for a positive outcome of the prisoners. The\nsystem as is does nothing to really keep people out. Recidivism…",
  "data/reddit-changemyview/r/changemyview/comments/o7w5jf/cmv_if_corporations_legally_count_as_people_then.json": "Welcome to my glorified shower thought. I'm hoping to learn from people more\ninformed than myself about corporate and criminal law in the USA.\n\nMy basic understanding is that one reason that corporations are able to spend\nextravagant funding on political campaigns in the USA is that (a) they have…",
  "data/reddit-changemyview/r/changemyview/comments/o80oop/cmv_i_do_not_use_trigger_warnings_in_my_videos_or.json": "The other day I posted a cooking video on TikTok, in which I used a knife to\nchop up some ingredients. I immediately got an influx of comments telling me I\nneed to put a trigger warning, for people who might be set off by seeing a knife\nor a sharp object. That’s actually ridiculous. It’s a cooking…",
  "data/reddit-changemyview/r/changemyview/comments/o85wbw/cmv_elderly_people_should_have_to_take_another.json": "For the safety and well-being of all other drivers I think it makes sense to\nretest/reevaluate if an older aged individual is still capable of driving\nsafely.\n\nI’m not sure at what age I would suggest the retest takes place, but I believe\nit should be done.\n\nMy main point behind this is that it…",
  "data/reddit-changemyview/r/changemyview/comments/o88bme/cmv_anyone_who_supports_transwomen_mtf_in.json": "Recently the news about trans weightlifter from New Zealand competing in OI were\ntrending. She used to compete in men’s division, and now at 43 after\ntransitioning for about a decade is going to compete against female\nweightlifters.\n\nI simply don’t get how people are oblivious to potential…",
  "data/reddit-changemyview/r/changemyview/comments/o88ysh/cmv_just_because_someone_is_older_doesnt.json": "The premise of my argument here is that. Being of old age doesn't necessarily\nmean that you are knowledgeable about today's current trends, or the struggles\nof the newer generations going on, or what's happening in society. For example,\nI was having a conservation with my grandfather who's a WW2…",
  "data/reddit-changemyview/r/changemyview/comments/o8ajdn/cmv_mandatory_documents_such_as_identification.json": "Most sovereign states require people within their border to own and carry some\nform of valid identification, by law. This evidently applies to their own\ncitizens. However obtaining those documents generally has a cost. IMO such\ndocuments should always be free for a citizen. Lack of income should…",
  "data/reddit-changemyview/r/changemyview/comments/o8c7rx/cmv_diversity_quotas_are_not_the_best_way_to.json": "Hi reddit,\n\nLet me be clear from the beginning. I think that anyone who is against fairness\nor equal chances should significantly rethink their life philosophy. Being\ndiscriminated based on gender / race / etc is horrible and we should do\neverything in our power to change that.\n\nNow, from what I…",
  "data/reddit-changemyview/r/changemyview/comments/o8oarr/cmv_the_concept_of_nonbinary_genders_is_harmful.json": "If someone decides their gender identity doesn’t correlate with their assigned\nsex, they are assuming that cisgender people HAVE to follow the stereotypes\naccording to their birth sex. For example, if an individual who is female by sex\ndecides they are non-binary, they are compartmentalizing the…",
  "data/reddit-changemyview/r/changemyview/comments/o8opys/cmv_if_you_smoke_weed_daily_and_fail_to_stop_you.json": "Now before I begin I must make clear that I have nothing against pot, those who\nuse it, I use it myself and I’m all for legalization worldwide.\n\nI am tired of hearing people use the argument: “because it is not physically\naddictive, it isn’t addictive”, yet they seem to forget that things…",
  "data/reddit-changemyview/r/changemyview/comments/o8r4ar/cmv_its_better_to_be_an_athiest_than_someone_who.json": "For perspective, this is coming from someone who is religious.\n\nI'm trying to improve myself and follow the teachings of my religion, but it\nseems like some people don't even TRY to follow the teachings of the religion\nthat they claim to be a part of. They don't attend religious services often…",
  "data/reddit-changemyview/r/changemyview/comments/o91m9c/cmv_i_think_its_wrong_to_expect_homeless_people.json": "Let me start out by saying, it really bothers me when I see people “helping” the\nhomeless by offering their half eating food and then getting sad and confused on\nwhy the homeless man didn’t take their food.\n\nI’ve never been homeless nor poor, I’m upper middle class. However, I never look\ndown on the…",
  "data/reddit-changemyview/r/changemyview/comments/o91yx1/cmv_the_term_africanamerican_is_racist_and_is.json": "I am not American.\n\nFor the longest time I have believed that the term African-American is racist\nfor the following reasons:\n\n 1. It lumps all black people into the same category as being African. The\n    person being referred to as African may be from Trinidad and Tobago,\n    Barbados, Jamaica, the…",
  "data/reddit-changemyview/r/changemyview/comments/o9780j/cmv_uber_is_an_unethical_company_and_should_be.json": " 1. They severely undercut prices to put taxi companies out of business so that\n    they can have a monopoly on the market, and eventually increase fares and\n    cut wages for their employees\n 2. They regularly oppose legislation that would force them to provide their\n    full time drivers with…",
  "data/reddit-changemyview/r/changemyview/comments/o9a9dy/cmv_social_media_companies_are_trying_to.json": "Often you'll see some great outrage sweep across tiktok or twitter, and a lot of\nit seems fine upon first glance, but a lot of it is just fluff that doesn't hold\nup to scrutiny and isn't really a new issue, just a variant of a different\nissue, but the secret sauce is to just call people a bigot of…",
  "data/reddit-changemyview/r/changemyview/comments/o9gikx/cmv_there_has_never_been_a_better_time_in_human.json": "It’s not strange to think the world is a horrible place. That's all you see in\nthe new, on social media and especially on Reddit . My view is that there has\nnever ever been a better time to be alive. For anyone, anywhere.\n\n * Food has never been more plentiful, despite increasing populations.…",
  "data/reddit-changemyview/r/changemyview/comments/o9n36h/cmv_the_argument_shouldnt_be_that_the.json": "I am saying this as a woman who was in the military. I've thought about this for\na while so I would like to see how my argument can be challenged and if possibly\nI am not looking at this the right way or haven't taken something into\nconsideration.\n\nThe draft should be entirely abolished it's not…",
  "data/reddit-changemyview/r/changemyview/comments/o9nj29/cmv_claiming_to_hearsee_a_deity_is_part_of_an.json": "People who claim to have heard a deity speak to them, or who have claimed to see\none, have hallucinations. The definition of hallucination is \"a sensory\nexperience that appears real, but is created by the mind\". - paraphrased from\nHealthline. This is often a symptom of several illnesses, so we can…",
  "data/reddit-changemyview/r/changemyview/comments/o9p52f/cmv_in_the_long_run_i_believe_outright_banning.json": "As a fan of various politically incorrect comedians, I don't think they are\nracist beyond their complete ignorance of the line that divides jokes between\nwhat is a little on the nose and what is more racist than humerous. I can see\nsome potential harm stemming from this type content in the form of a…",
  "data/reddit-changemyview/r/changemyview/comments/o9pqhm/cmv_you_cant_be_offended_on_behalf_of_another.json": "For perspective. I am half chinese/half white. My mom is 100% Chinese, born in\nHong Kong. My fiancee is 100% white (for lack of a better term).\n\nWe were all playing golf and saw an older Asian couple playing a second round.\nThe course attendant asked if they paid for a second round. They said…",
  "data/reddit-changemyview/r/changemyview/comments/o9pyz7/cmv_we_should_cure_disabilities_if_we_can_despite.json": "TLDR; Why shouldn't we try to cure preventable disabilities if possible?\n\nSome background; I'm reading this book 'No Pity' for a class. I have not\nfinished the book but in the first chapter there are some claims I disagree\nwith. I feel ablest for holding these views but they seem to be right to me.…",
  "data/reddit-changemyview/r/changemyview/comments/o9twgc/cmv_we_should_raise_the_minimum_age_to_engage_in.json": "While I am perfectly fine with 18 being the age of consent in general, I think\nthe minimum age to engage in the sex work economy (e.g., stripping, porn, etc.)\nshould be 21. I know many people will say, \"well, like it or not, you're an\nadult at 18.\" But we've determined as a society, in the US at…",
  "data/reddit-changemyview/r/changemyview/comments/o9ui5q/cmv_youtube_twitter_and_other_western_social.json": "A quick search on youtube reveals CGTN news, which is Chinese state run news.\nYoutube is a banned website in China, so why is China posting on youtube? Two\nreasons, one to spread their propaganda to the west to indoctrinate followers.\nTwo, in China there is a massive gray area, and many Chinese…",
  "data/reddit-changemyview/r/changemyview/comments/oa8td7/cmv_only_having_private_companies_for_necessities.json": "For systems that are needed by people, like public transport, access to food and\nhealthcare, there is no competition. When the customer doesn't have the ability\nto abstain from the system as a whole, companies aren't incentivised to higher\nquality and lower prices, they're incentivised to just be…",
  "data/reddit-changemyview/r/changemyview/comments/oaeb14/cmv_police_purposely_putting_incorrect.json": "I think if it can be proven beyond a reasonable doubt, that an officer purposely\nput the wrong information in a report, they should be imprisoned for that\nconduct.\n\nNow I know human memory can be fickle. Remembering something exactly as it\nhappened even 5 hours prior can prove to have some…",
  "data/reddit-changemyview/r/changemyview/comments/oag13m/cmv_there_exists_a_period_of_lockdown_perhaps_2.json": "The rise of the delta variant has got me thinking:\n\nLet's start with an extreme case: lockdown for the entire natural lives of\npeople born today.\n\nWould anyone disagree that this period of lockdown would not be justified even\nif scientifically established to save lives?\n\nI think not.\n\nSo then the…",
  "data/reddit-changemyview/r/changemyview/comments/oag3um/cmv_just_because_a_couple_does_not_marry_does_not.json": "Just because a couple doesn’t want to have a wedding or sign any documentation,\nthat does not mean that they are any less committed to each other than a couple\nthat chooses do so. It also does not mean that they will not be together\nlong-term or even forever......because they still could. I mean, I…",
  "data/reddit-changemyview/r/changemyview/comments/oahqlj/cmv_standardized_tests_actually_do_a_pretty.json": "I have tutored many of the American standardized tests (SAT, ACT, GRE, LSAT,\netc) for years. They're actually pretty good.\n\nThe reading sections of the SAT/ACT perhaps leave the most to be desired. Being\nable to parse text from 300 years ago is to a large degree a function of having\nexperience…",
  "data/reddit-changemyview/r/changemyview/comments/oaixvf/cmv_all_the_us_flag_apparel_people_wear_and_use.json": "Background: -US Federal Law Code says the flag isn’t to be used for clothing.\nThe code isn’t enforceable because of the 1st amendment. -American Legion says\nit’s okay to have the flag resembled on clothing.\n\nThe flag is something to be honored and respected. It’s colors and design is not\nsomething…",
  "data/reddit-changemyview/r/changemyview/comments/oamfqf/cmv_cultural_appropriation_is_not_a_real_issue.json": "It can be corny or hurt someone’s feelings, but that is the extent of it. The\nonly negative consequence i can think of is that it would make someone upset.\nBut, i think their reason for being upset is not legitimate.\n\nIf a white person opens a Jamaican restaurant, that would be considered…",
  "data/reddit-changemyview/r/changemyview/comments/oapwcp/cmv_as_a_mexican_people_from_my_culture_living_in.json": "Seeing \"latino culture\" defended by people as far from it as any other around\nthem because it \"belongs to them\" just because of their ancestry has made me\nlook into it as people pushing towards stereotypes harder than everyone else.\nSomeone from another culture wants their tacos made in a way that…",
  "data/reddit-changemyview/r/changemyview/comments/oaw37t/cmv_nutrition_sleep_and_other_physical_aspects_of.json": "Let me start off by saying that I am beyond the point in my interests of\nnutrition and sleep where I think they are end all be all determiners of health.\n\nBUT… I do strongly believe that the connection between how you feel (your\nenergy, outlook, emotions, cognition, decision making abilities) is not…",
  "data/reddit-changemyview/r/changemyview/comments/oay3cb/cmv_political_debates_should_modernize_by.json": "The way the US currently runs political debates is kinda a clusterfuck.\nPoliticians are throwing numbers around left and right. After the debate is over\nyou have another 30-45 minutes of programming dedicated to fact-checking what\nthey said, again without any sources.\n\nAs part of a political debate,…",
  "data/reddit-changemyview/r/changemyview/comments/oay9ks/cmv_as_someone_who_generally_identifies_as_pretty.json": "Throwaway because I've noticed that this can be a pretty inflammatory topic, but\nI am trying to be curious, honest, open, and earnest. That said, I have a pretty\nprivileged background and none of these issues have impacted my life directly,\nso I will definitely have pretty big gaps in my…",
  "data/reddit-changemyview/r/changemyview/comments/oaybaw/cmv_countries_such_as_the_uk_that_have_egyptian.json": "I often hear about how countries \"plundered\" these artifacts from Egypt that\nthey have no right to have, and that this is wrong and they should return these\nartifacts, but I disagree with this for several reasons. While I can understand\nthis reasoning for many of the existing cultures that had their…",
  "data/reddit-changemyview/r/changemyview/comments/ob1x57/cmv_i_dont_find_libertarianism_to_be_all_that.json": "Naturally, an individual libertarian can be unreasonable. And any political\nviewpoint will look insane when taken to its logical extremes.\n\nAt it's most basic form, a libertarian believes that a person or group of people\nin government are not capable of knowing what's best for me as an individual,…"
}