{
  "data/reddit-stocks/r/Bogleheads/comments/t3ug05/why_are_so_many_younger_investors_drawn_to.json": "I see questions here all the time from first time investors and they almost\nuniversally mention Robinhood, Wealthfront, or M1 Finance instead of one of the\nold standbys: Vanguard, Fidelity, or Schwab.\n\nAre Robinhood/Wealthfront/M1 marketed at younger people or something? I can\nhonestly say that…",
  "data/reddit-stocks/r/wallstreetbets/comments/t3w282/ukraine_selling_war_bonds_not_the_usual_wsb.json": "https://news.yahoo.com/ukraine-to-auction-war-bonds-to-fund-armed-forces-173623142.html\n\nWe should see if we can name some tanks or bombs if we buy enough bonds!\n\nWhat would the Russian equivalent of Sum Ting Wong be?",
  "data/reddit-stocks/r/stocks/comments/t438zp/visa_mastercard_block_russian_financial.json": "> U.S payment card firms Visa and Mastercard have blocked multiple Russian\n> financial institutions from their network, complying with government sanctions\n> imposed over Moscow's invasion of Ukraine.\n> \n> Visa said on Monday it was taking prompt action to ensure compliance with\n> applicable…",
  "data/reddit-stocks/r/investing/comments/t44pro/ukraine_supplies_70_of_the_worlds_neon_chip.json": "Again, the world's major chip and semiconductor companies are watching the\nconflict closely as the Russian invasion of Ukraine will likely hamper the\nsupply of neon.\n\nNeon is used in lithography to make microchips.\n\nCurrently it appears the larger chip manufacturers have plenty in reserve but\nare…",
  "data/reddit-stocks/r/Bogleheads/comments/t47u97/maintain_discipline_during_uncertainty_vanguard.json": "> Hello. I’m Tim Buckley, Vanguard’s CEO.\n> \n> Recent events have added a new dimension of risk to the markets.\n> \n> Beyond the very real human cost, the invasion of Ukraine by Russian forces has\n> resulted in increased market volatility and significant sanctions. Further\n> economic costs in the…",
  "data/reddit-stocks/r/Bogleheads/comments/t47s66/bogleheads_on_investing_podcast_hits_1000000.json": "Happy to announce my podcast: \"Bogleheads on Investing\" has hit a milestone of\n1,000,000 downloads! Thank you! The latest guest is Eduardo Repetto, Ph.D.,\n[https://bogleheads.podbean.com/e/episode-043-eduardo-repetto-on-factor-investing-host-rick-ferri/]CIO\nof Avantis and former CIO and CEO of…"
}