{
  "data/reddit-stocks/r/stocks/comments/ttdukk/the_gme_dividend_stock_split_and_you.json": "Disclaimer: I do not currently hold ANY GameStop stock and haven’t for over a\nyear.\n\nOk so by now you may know GME is considering a stock split in the form of a\ndividend. We need to take a closer look at why the dividend matters.\n\nIn the case of a normal stock split, all shares and positions are…",
  "data/reddit-stocks/r/Bogleheads/comments/ttf4m5/vanguard_taking_in_nearly_1b_each_day.json": "Saw this tweet from Rick Ferri mentioning it and initially did a double take on\nit saying no way, but I guess when your managing what ... now $8T or so total, I\nguess a billion a day is another day at the office for the Vanguard Group\nemployees. Kudos to Jack for laying the…",
  "data/reddit-stocks/r/Bogleheads/comments/tthmda/is_a_03_expense_ratio_on_1000000_just_300.json": "Hi, am I understanding expense ratios correctly?\n\nIf I invest in VTI and the value of my investment reaches $1,000,000 then I\nessentially have paid $300?",
  "data/reddit-stocks/r/investing/comments/ttpttj/us_job_growth_solid_in_march_unemployment_rate.json": "From the article:\n\n> U.S. job growth continued at a brisk clip in March, with the unemployment rate\n> falling to a new two-year low of 3.6% and wages re-accelerating, positioning\n> the Federal Reserve to raise interest rates by a hefty 50 basis points in May.\n> \n> The Labor Department’s closely…",
  "data/reddit-stocks/r/investing/comments/ttpour/china_considers_giving_us_full_audit_to_alibaba.json": "Welp. There it goes again.\n\nThis was my post 10 days ago:\nhttps://www.reddit.com/r/investing/comments/tk3mvm/alibaba_stock_the_steal_of_a_lifetime/\n\n\n\nToday, China has announced it is considering giving the US FULL audit to Alibaba\n\nhttps://www.bloomberg.com/news/articles/2022-04-01/china-weighs…",
  "data/reddit-stocks/r/stocks/comments/ttpmv4/payrolls_rose_431000_in_march_despite_worries.json": "https://www.cnbc.com/2022/04/01/jobs-report-march-2022-.html\n\nAmid soaring inflation and worries about a looming recession, the U.S. economy\nadded slightly fewer jobs than expected in March as the labor market grew\nincreasingly tighter.\n\nNonfarm payrolls expanded by 431,000 for the month, while the…",
  "data/reddit-stocks/r/stocks/comments/ttw5xc/cannabis_bill_passed_the_house_220204.json": "https://thehill.com/news/house/3256370-house-approves-bill-legalizing-marijuana/amp/\n\nJust a few minutes ago, the bill passed the house 220-204 with 3 republicans\njoining all but 2 democrats\n\nThe measure now goes to the Senate, where Majority Leader Charles Schumer\n(D-N.Y.) is working with fellow…",
  "data/reddit-stocks/r/stocks/comments/ttsxe8/are_cannabis_stocks_a_buy_they_are_priced_so_low.json": "I used to own various companies in the cannabis industry a few years back and\ndecided randomly to sell them conveniently before they ultimately plummeted.\nObviously Congress getting ready to vote on this, biggest traction I believe\nthis bill has is it will essentially wipe out almost if not all…",
  "data/reddit-stocks/r/stocks/comments/ttrb18/should_i_sell_dis_and_put_the_cash_in_something.json": "So I have invested around 1k in Disney with average 178-177. Yeah, for the past\nyear this stock has been nothing but a disappointment for me - it serves me\nright I hardly did and DD on it, I just thought hey it's Disney even if it\ncrashes it will bounce back quickly. Lately I have been thinking of…",
  "data/reddit-stocks/r/Bogleheads/comments/ttpjz7/a_mental_exercise_to_realize_the_folly_of_dollar.json": "We all know that trying to time the market is a losing game. However,\nironically, I often see the advice to \"DCA your investment into the market over\nX period.\" This is irrational advice. The example below illustrates why using\nDCA is illogical.\n\n[EDIT]: In the context of this post, I'm talking…",
  "data/reddit-stocks/r/Bogleheads/comments/tu25gh/maxed_out_ira_for_first_time.json": "I just turned 20 and I maxed out my Roth IRA for 2021 now I’m starting to\ncontribute to 2022. My portfolio is 70% US and 30% International. Posting here\nbecause I have no one else to tell!!",
  "data/reddit-stocks/r/Bogleheads/comments/tu1bp4/how_do_i_handle_it_when_people_ask_me_for_money.json": "With everyone investing long term here, I could only imagine there are people in\nyour families who have come to you for money. Maybe even friends. I’m 22 years\nold and have a higher net worth than 90% of all family members, including aunts\nand uncles. I’m also the first person in my family to…",
  "data/reddit-stocks/r/investing/comments/ttuqer/financial_advisor_advises_not_to_invest_cash.json": "My girlfriend let me look at her finances recently, and I saw she had a lot of\ncash set aside in her account managed by her financial advisor. She is a medical\nstudent currently and won't be touching that money for the next 3.5 years due to\nher being in school; she was planning to use part of that…",
  "data/reddit-stocks/r/Bogleheads/comments/tu7roi/100k_year_into_vti.json": "Are you comfortable with investing 100-150 per year into VTI? At any point did\nyou feel like payoff house?",
  "data/reddit-stocks/r/wallstreetbets/comments/tu3p40/resigning_as_head_mod_of_rwallstreetbets.json": "This is not a joke. [https://i.imgur.com/fiP0MmV.png]\n\n--------------------------------------------------------------------------------\n\nAfter over 7 years of moderating r/wallstreetbets [/r/wallstreetbets], I have\nmade the difficult decisions to step down as head mod.\n\nIt has recently come to…",
  "data/reddit-stocks/r/stocks/comments/ttyn6y/why_is_china_suddenly_more_cooperative_about.json": "Chinese stocks have been a bloodbath last year with concerns of delisting. But\nthere seems to be a small turnaround from Chinese government\n[https://www.finews.asia/finance/36531-could-beijing-s-audit-concessions-mark-a-turnaround-for-chinese-stocks]:\n\n> Beijing is preparing to make concessions on…",
  "data/reddit-stocks/r/stocks/comments/tudm9d/deceased_friends_mom_has_paper_shares_of_ibm_from.json": "I am going to pay cash for these old paper shares. If I ever redeem them I have\nno problem if they are in what condition? I heard of framing these too?\n\nI feel like I am doing a service IBM is up 7% last week but I never traded paper\nonly electronically over the phone honestly.\n\nCan you believe she…",
  "data/reddit-stocks/r/investing/comments/tu8hsw/mega_cap_marketweighted_idea.json": "I’m just looking for advice, questions, recommendations, etc\n\nI did some back tests which revealed that the top 5-10 S&P stocks tend to\noutperform the market over the long term.\n\nWhat if you made a portfolio 50% vti (or vt) and the rest the top 5-10 stocks\nweighted by market cap?",
  "data/reddit-stocks/r/investing/comments/tujxgn/safe_1015_year_investments.json": "My parents recently sold their home and downsized. At Christmas they gave each\nof us kids $1,000 for each grandkid (our kids) to be given to them on their 18th\nbirthday. I’d like to put this somewhere for each of my kids that will make it\nworth close to $1,000 when they take it out (keep up with…",
  "data/reddit-stocks/r/Bogleheads/comments/tucu0g/how_offen_do_your_check_your_longterm_investment.json": "hey , I a new boglehead. I can't stop to check my account from time to time.\nWhat's your experiences as your were a new boglehead? As I became a boglehead\nonly half a year, I didn't suffer the pandemic market crash. I can't imagin what\nI would have thought , If I had invested all I had. What did…",
  "data/reddit-stocks/r/stocks/comments/tumycz/tesla_delivers_310048_electric_vehicles_in_the.json": "TESLA TO THE MOON! Apparently y’all thought this was a hit job on Tesla? I’m\nbullish\n\nTesla delivered 310,048 electric vehicles in the first quarter of 2022, below\nanalysts estimates.\n\nDeliveries are the closest approximation to sales numbers reported by Tesla.\n\nAfter a rough start to 2022, Tesla…",
  "data/reddit-stocks/r/Bogleheads/comments/tuhk62/vanguard_2045_fund.json": "So, I use target date funds for my Roth, I'm lazy and not smart and this might\nbe further proof of me not being smart but -\n\nDo these funds seem solid over the long term? Or am I better off doing something\nelse?",
  "data/reddit-stocks/r/stocks/comments/tumsf5/softbank_liquidates_most_of_portfolio_at_nasdaq.json": "SoftBank has liquidated almost all of the positions in its abortive internal\nhedge fund SB Northstar after racking up between $6bn and $7bn in losses in the\nunit behind the notorious “Nasdaq whale” trades.\n\nThe future of the Japanese technology conglomerate’s buccaneering trading unit\nhas been in…",
  "data/reddit-stocks/r/Bogleheads/comments/tugdfv/a_neighbor_showed_me_his_portfolio_from_a.json": "A neighbor of mine and I were talking about investing and he showed me briefly\nthe list of his investments as recommended by his Fidelity Financial Planner.\nWOW! A huge long list of stocks, bonds, mutual funds, and ETFs.\n\nI did not want to push too hard but it would have been great if I could make…",
  "data/reddit-stocks/r/Bogleheads/comments/tugv77/too_much_bonds_60_retiring_in_4_months_allocation.json": "I've been helping my wife's parents with their portfolio for the last couple of\nyears. They just turned 60 and since they started working early on are now\neligible for the State's pension.\n\nThe pension amounts to €30k/year net of taxes, which is half what they used to\nmake on an average year. They…",
  "data/reddit-stocks/r/Bogleheads/comments/tuqf0g/why_vti_over_voo_long_term.json": "I’m early 20s with plenty of time so why not go voo over vti?\n\nUpdate: to clarify it holding both with VTI 40% VXUS 30% BND 15% and VOO 15% but\nI want to consolidate that to a 3 fund portfolio hopefully. I know about VT but\nI’d rather have more control over my international investing percentage. I…",
  "data/reddit-stocks/r/wallstreetbets/comments/tumdex/deep_dive_into_the_market_cycle_and_how_it.json": "First and foremost, I am not financial advice and this is not a financial\nadvisor. I don't know shit about fvck - I literally lick windows for a living. I\npity the fool who takes anything I say to heart.\n\nTLDR: $GMEs price, just like every other stock in the US Equities market, is\ncontrolled by the…",
  "data/reddit-stocks/r/stocks/comments/tuojch/for_those_waiting_on_the_sideline_what_indicators.json": "I understand someone will definitely say “time in the market beats timing the\nmarket”.\nThanks for the advice, but I would like to hear from those on the sideline.\n\nWhat indicators and metrics do you follow and watch?\n\nThank you.",
  "data/reddit-stocks/r/Bogleheads/comments/tun9fo/when_is_the_vanguard_fee_taken.json": "So I understand that BND has a 0.035% fee. Is that fee taken quarterly or more\nfrequently? I can't seem to find the information or I'm not looking hard enough.\nCould be either one. I'm attempting to create a spreadsheet w/current balances\nincluding the fee and my sheet and Vanguard don't match up.…",
  "data/reddit-stocks/r/stocks/comments/tu6rv4/wall_street_week_ahead_for_the_trading_week.json": "Good Friday evening to all of you here on r/stocks [/r/stocks]! I hope everyone\non this sub made out pretty nicely in the market this past week, and are ready\nfor the new trading week ahead. :)\n\nHere is everything you need to know to get you ready for the trading week\nbeginning April 4th,…",
  "data/reddit-stocks/r/stocks/comments/tutww0/amazon_warehouse_unionized.json": "Surprised this isn’t being discussed here so I figured I’d make the thread.\n\nhttps://www.aljazeera.com/economy/2022/4/1/amazon-union-maintains-commanding-lead-in-new-york-election\n\nMainstream Media take is that it’s a big win for “the people” and a knock on\n“evil big tech”.\n\nMy expectation is that…",
  "data/reddit-stocks/r/investing/comments/tuyr0s/vti_and_voo_should_i_invest_in_both_or_just_one.json": "I’ve recently started automatically investing about $250 each week split between\nVTI and VOO. I thought the diversity would be beneficial but im reading that\nthey are composed of essentially the same stocks. Should i just pick one and\ninvest $500 in it each week? And which one would you recommend?…",
  "data/reddit-stocks/r/stocks/comments/tup35r/european_inflation_soars_to_record_75_in_march.json": "Source:\nhttps://uk.news.yahoo.com/charting-global-economy-european-inflation-090000565.html\n\nEuro-zone inflation surged to a record 7.5% in March from a year ago as Russia’s\nwar in Ukraine further boosted already soaring energy costs.\n\nWhile that’ll cost consumers about 230 billion euros ($254…",
  "data/reddit-stocks/r/stocks/comments/tv20la/one_year_ago_i_wrote_a_bear_case_for_amd_lets.json": "About me: I like to write about semiconductor companies and tech stocks. My\nprevious analysis (examples:…",
  "data/reddit-stocks/r/stocks/comments/tumrfy/china_allows_onsite_inspections.json": "Monday should be a very interesting day for Chinese stocks:\n\nhttps://www.bloomberg.com/news/articles/2022-04-02/china-removes-major-hurdle-to-allow-u-s-full-access-to…",
  "data/reddit-stocks/r/Bogleheads/comments/tv93tz/considering_pensions.json": "I’m one year away from vesting in the pension system for my public school based\njob in Texas (TRS-teachers retirement system). A recent article I read said that\nretired teachers in Texas had not received a cost of living adjustment since\n2004. Someone receiving $2000 in 2004 should now be receiving…",
  "data/reddit-stocks/r/Bogleheads/comments/tvac39/if_you_are_34_years_old_and_only_want_to_have_one.json": "Edit: preferably ETFs, not necessarily a fund but one position",
  "data/reddit-stocks/r/stocks/comments/tvdgay/how_many_of_you_saw_the_warning_signs_and_shifted.json": "Due to inflation and international economic struggles, there was a clear winner\nin the equity markets the last quarter.\n\nDid many of you move your assets to the energy sector, and are others who\nhaven't yet going to move assets that direction for the year?",
  "data/reddit-stocks/r/stocks/comments/tvfbln/tim_in_the_market_is_better_than_timing_the.json": "What’s your experience been with “time in the market is better than timing the\nmarket” philosophy? I’m a young investor (mid 20’s) and just keep buying VTI\nevery other week or so. How has it worked for you veterans in the long run?\nShould I change anything?",
  "data/reddit-stocks/r/investing/comments/tv99zz/how_many_people_actually_read_the_investor_reports.json": "Once I found my winning stock I like to research comparable stocks in the sector\nand dive into the latest financial report or two including the M and D. How\noften do people actually read through everything verse not doing any research? A\ncouple friends suggested they pick up stocks based on…",
  "data/reddit-stocks/r/investing/comments/tvavdl/etfs_to_invest_in_the_world.json": "Hi guys, I'm learning about finance and would like to ask if given 10 choices,\nwhich ETFs would you invest in to have the most wide-reaching coverage across\ndifferent asset classes and countries? (Given that the returns don't matter)\n\nI'm taking a theoretical standpoint in a sense that I want…",
  "data/reddit-stocks/r/investing/comments/tvc9yg/inflation_and_its_effect_on_the_stock_market.json": "While reading a bit on the ideas to protect money from inflation, I noticed many\npeople have the idea to move their money into the general stockmarket (e.g.\nindexes, managed-funds, S&P, NASDAQ). The idea behind this is that the money is\n\"save\" in the market due to companies in general profiting…",
  "data/reddit-stocks/r/stocks/comments/tv3zcj/advice_on_starting.json": "I am 23 and more or less financilally illiterate. I grew up in a paycheck to\npaycheck home and never really learned I should be thinking about my money\nbesides paying bills and saving. I was quite literally taught nothing about\nfinances in highschool or college. Now I hear the only way anyone will…",
  "data/reddit-stocks/r/stocks/comments/tvn72q/safest_stock_in_the_world.json": "Let's play a game: what is the safest stock in the world?\n\nI mean, if the world was to collapse, undergo a prolonged period of depression,\nif the US dollar was to lose its' hegemony, or any other depressing event that\nyou might think of.\n\nWhich stock/company do you think will survive these hard…",
  "data/reddit-stocks/r/Bogleheads/comments/tvibg7/does_the_amount_of_shares_u_get_matter_with_the.json": "Ifeel so stupid asking this but lets say I bhave 50$ to invest every month (i’m\nonly 15 im getting a job sometime soon so i can invest more) into voo even\nthough its 416$? it shouldn’t change anything right? ill still get the roi\ncorrect since overtime it will add up?",
  "data/reddit-stocks/r/wallstreetbets/comments/tvgb6i/but_amc_is_cheaper_than_gme_proven_wrong_with_data.json": "INTRO\n\nRecently, I've been arguing with internet finance professionals over the\noverused and misunderstood argument of \"POPCORN is a cheaper stock to own than\nGME\" or \"Why would I buy 1 GME share when I can have 10 POPCORN shares?\" or my\npersonal favorite \"if both stocks go to $10,000 at one point…",
  "data/reddit-stocks/r/wallstreetbets/comments/tvnuao/gme_stock_dividend.json": "Stock dividend isn’t a normal stock split. It has the same effect of a stock\nsplit but the mechanism is different.\n\nStock split: if there is 100 shares worth $10 each, a stock split, say 2:1 will\nmake 200 shares each worth $5. In this case Hedgies etc don’t have to do\nanything. Life stays the same.…",
  "data/reddit-stocks/r/wallstreetbets/comments/tvnxir/i_hate_you_gme_fucktards.json": "I work for a UK broker and all you GME dweebs are the bane of my life. You are\nliterally fucking clueless on how trading and settlement works, we get bombarded\nwith stupid fucking questions by you motherfuckers who think the whole world is\nagainst you when in reality the more money you make the…",
  "data/reddit-stocks/r/investing/comments/tvpf7l/the_2y30y_yield_curve_is_inverted.json": "At the time of this writing, the 2y/30y yield is inverted (1-2 basis points).\n\nSource: https://www.cnbc.com/quotes/30Y2YS\n\nIt's historically rare and usually happens near the end of a rate hike cycle by\nthe Fed. I know it's preceded some significant contractions in the economy, but\nthe inversion…",
  "data/reddit-stocks/r/stocks/comments/tvrjxt/why_do_some_gold_industry_stocks_plummet_during_a.json": "I’ve been searching for stocks in the gold industry to help me hedge against\nrising inflation. Because these stocks tend to be inverse the market, I just\nassumed that they would thrive or at least hold up well during a recession.\n\nAfter searching through about 40 gold stocks I noticed that a good…",
  "data/reddit-stocks/r/wallstreetbets/comments/tvw3yv/i_love_you_gme_fucktards.json": "I work for a US broker and all you GME chads are the highlight of my life. You\nare literally fucking spot on how trading and settlement works, we get bombarded\nwith amazing fucking questions by you beautiful bastards who think the whole\nworld is on your side when in reality the more money you make…",
  "data/reddit-stocks/r/Bogleheads/comments/tvqzw6/how_to_build_a_portfolio_step_by_step.json": "I see lots of questions about how do I go about putting together my portfolio. I\nam going to give you some resources below. These are just guidelines and your\nspecific situation can change these. The steps below describe how to build your\nportfolio.\n\nAnd the optimal portfolio can only be known in…",
  "data/reddit-stocks/r/stocks/comments/tvyoxd/elon_musk_takes_92_passive_stake_in_twitter.json": "Elon Musk has taken a 9.2% passive stake in Twitter, according to a 13G filing,\nBloomberg News reports. Twitter rose about 26% in pre-market trading.\n\nMore information is available on the Bloomberg Terminal.\n\nhttps://www.bloomberg.com/news/articles/2022-04-04/elon-musk-takes-9-2-passive-stake-in…",
  "data/reddit-stocks/r/investing/comments/tvyx7l/twitter_is_up_26_premarket_as_elon_musk_reveals_a.json": "Per Bloomberg data, Musk’s 9.2 per cent Twitter stake would make him the largest\nshareholder in the company. Notably it’s more than quadruple the 2.25 per cent\nposition of founder Jack Dorsey. At pixel time, Twitter’s stock is up 25 per\ncent in pre-market trading to…",
  "data/reddit-stocks/r/stocks/comments/tvz5um/elon_musk_takes_99_stake_in_twitter.json": "Elon Musk has taken a 9.2% passive stake in social media company Twitter Inc\n(TWTR), according to a Bloomberg report.\n\nMusk, the CEO of car company Tesla Inc (TSLA) and SpaceX, often uses Twitter to\ndispel his views. Shares of Twitter jumped over 26% to $49.79, while shares of\nTesla were up 1% in…",
  "data/reddit-stocks/r/investing/comments/tvude8/everyone_talks_about_the_strong_job_growth.json": "I’m talking about people that do Uber, Lyft, Doordash, Postmates, Ebay, Amazon,\nEtsy, etc. Let’s say someone gets a full time job at Walmart and also starts\ndoordash on the weekends and sells random things on eBay. Does the government\ncalculate that 3 jobs were “created” that month? Is there a…",
  "data/reddit-stocks/r/stocks/comments/tvuyvz/are_index_funds_really_in_a_bubble_pls_help_me.json": "Long story short, I repeatedly heard the notion that Index Funds have crossed\nthe bubble territory based on the continuous Inflow of funds without a valid\nprice finding mechanism behind it.\n\nI‘m an avid Warren Buffet fan who repeatedly praised investment in the broad\nmarket as a fairly good…",
  "data/reddit-stocks/r/wallstreetbets/comments/tvylmu/elon_takes_92_stake_in_twtr.json": "Damn. That SOB is really going to do it guy. Hostile takeover of TWTR?\n\nAll this time we were thinking he is starting a competitor. Well played sir!!\n\nhttps://www.streetinsider.com/dr/news.php?id=19866072",
  "data/reddit-stocks/r/stocks/comments/tvwgct/elon_musk_says_tesla_aiming_at_30_gross_margin.json": "CEO Elon Musk said on Sunday that the electric vehicle maker is aiming at a 30%\ngross margin or about 10% profitability including all costs for its Supercharger\nnetwork business.\n\nWhat Happened: Investor Ross Gerber had asked Musk if Tesla works on “a 50%\ngross margin on the energy cost,” and “if…",
  "data/reddit-stocks/r/Bogleheads/comments/tvzpp2/how_much_do_you_usually_spend_or_save_or_invest.json": "As for me after taxes I roughly Spend: 40% (food,rent,bills and etc) Invest: 27%\nSave: 20% Donate: 13%\n\nAlthough experts recommend to invest 15-20% of your income but I think we all\ngot our own different situations here\n\nWhat about you guys?",
  "data/reddit-stocks/r/stocks/comments/tvuobp/tesla_delivered_310000_in_the_first_quarter_a.json": "Tesla delivered 310,000 vehicles in the first quarter, compared with an\nestimated 309,200; in the first quarter, it produced 305,400 vehicles, compared\nwith an estimated 311,900.\n\nDuring the same period, traditional automakers such as GM, Ford, and Chrysler\ndeclined year-on-year.\n\nOn Friday, Tesla…",
  "data/reddit-stocks/r/stocks/comments/tw3u2l/musk_held_twitter_stock_then_twitter_stock_soared.json": "It was announced that Musk held more than 73.48 million shares of Twitter,\nholding a 9.2% stake. Twitter shares rose to 20% after Tesla CEO Musk reported\nhis stake in Twitter.\n\nIt seems like it's a strange law that Musk owns a certain stock, they all go up.\n\nWhat do you think will happen to Twitter…",
  "data/reddit-stocks/r/stocks/comments/tw8tjw/amd_to_buy_cloudservices_provider_pensando_for_19.json": "https://www.barrons.com/articles/amd-stock-price-pensando-51649075903\n[https://www.barrons.com/articles/amd-stock-price-pensando-51649075903?mod=hp_DAY_Theme_2_1]\n\nAdvanced Micro Devices [https://www.barrons.com/market-data/stocks/amd]reached a\ndeal to acquire cloud-services provider Pensando…",
  "data/reddit-stocks/r/Bogleheads/comments/tw5ntj/project_i_bond_rate_on_51.json": "I'm curious if there's a way to know what the new I bond rate published on May\n1st will be? Is it worth it to buy $10k worth of bonds now for 2022, or wait\nuntil May? Still figuring out how these bonds work.",
  "data/reddit-stocks/r/Bogleheads/comments/tw9wm7/am_i_doing_too_much_pretax_investing.json": "My wife and I make about $175,000/year ($187,000/year if you add PERS) as\nfollows:\n\nMe: Government Attorney — $66,000 salary plus $12,000 PERS (retirement like a\ntIRA) Me: Solo Law Practice on Side — $30,000 salary (S corp employee) plus\n$50,000 distribution Wife: Part-Time Home Health —…",
  "data/reddit-stocks/r/stocks/comments/twh4ap/hertz_to_buy_up_to_65000_electric_vehicles_from.json": "> Hertz (HTZ) is turning up the wattage on its push to have a mostly electric\n> rental car fleet.\n> \n> The company said Monday it will purchase 65,000 electric vehicles from upstart\n> Tesla rival Polestar. Mostly consisting of the sporty Polestar 2 sedan, the\n> purchases will occur over five years.…",
  "data/reddit-stocks/r/stocks/comments/twctej/i_have_20000_usd_and_i_want_you_opinion_on_what_i.json": "I have 2,000 in investments that aren’t particularly safe but they are not\nstupid. I have been heavily debating taking the rest of my savings and investing\nit into an extremely safe company for the long term. Do you think this is a good\nidea and if so any good companies in mind?",
  "data/reddit-stocks/r/Bogleheads/comments/twgze5/ameritrade_vtsax_75_transaction_fee.json": "I’m trying to purchase just over $1000 in VTSAX and they are quoting me a $74.95\ntransaction fee. I feel like I’m doing this wrong.\n\nSuggestions?",
  "data/reddit-stocks/r/investing/comments/twhu4v/hertz_to_buy_up_to_65000_electric_vehicles_from.json": "WASHINGTON (Reuters) -Rental car firm Hertz Global Holdings said on Monday it\nwould buy up to 65,000 electric vehicles over five years from Swedish EV maker\nPolestar, the latest move by the rental car firm to add zero-emission models.\n\nHertz said Polestar cars would be available beginning this…",
  "data/reddit-stocks/r/stocks/comments/twc13f/are_school_stock_competitions_good_for_teaching.json": "After seeing another post about a school stock competition, it reminded me of\nthe \"feud\" on whether YouTuber boxing is good for the sport.\n\nOn one hand, introducing kids to finance and stocks is good because it\n(hopefully) destigmatize fears and misconceptions about the stock market. This\ncould…",
  "data/reddit-stocks/r/stocks/comments/twm05p/how_did_elon_musk_by_almost_10_million_shares_of.json": "Just like the title says. THIS is one thing I haven't the slightest clue about\nwhen it comes to stock. How in TF do you buy almost 10 percent of a company 21\ndays ago but NOW today it goes up the way it does. Dark pool? Elon Musk magic?\nStock share gnomes that only come out when the headlines hit?…",
  "data/reddit-stocks/r/investing/comments/twhh3d/if_roth_contributions_can_be_accessed_anytime_why.json": "Hello, so lately, I've been thinking of liquidating my regular taxable account\nand putting all my money from now in a roth account. My reasonings are:\n\n 1. dividend and profit are not taxed at all, so I don't have to worry about\n    selling or accruing dividends (without withdrawing, of course)\n 2.…",
  "data/reddit-stocks/r/investing/comments/twk20t/after_seeing_dark_waters_would_you_invest_in.json": "“DuPont started conducting cancer studies in 1988. The company’s own studies\nshowed that exposure to C8 killed rats, dogs and monkeys, by causing testicular\ncancer, liver disease and pancreatic disease. Not only did DuPont continue to\nmanufacture Teflon, but it also continued to dump the chemical…",
  "data/reddit-stocks/r/Bogleheads/comments/twmxg0/why_do_bonds_make_sense_at_40.json": "Using the rule of 120, I should have 20% of my portfolio in bonds. If I’m\ninvesting money I don’t need for 20-25 years, why does it make sense to have any\nportion in bonds at my age? Isn’t it safe to assume that the S&P is going to be\nhigher 20 years from now, so even if we experience a massive…",
  "data/reddit-stocks/r/stocks/comments/twu6o5/twitter_ceo_parag_agrawal_im_excited_to_share.json": "Full tweet is \"I’m excited to share that we’re appointing @elonmusk to our\nboard! Through conversations with Elon in recent weeks, it became clear to us\nthat he would bring great value to our Board.\"\nHe goes on to say.\n\"He’s both a passionate believer and intense critic of the service which…",
  "data/reddit-stocks/r/wallstreetbets/comments/twexv3/lost_over_100_grand_in_a_couple_months_on_my_dads.json": "i told him he was getting a call and just say yea when they needed to approve\nthe account for options lol. Dad has no idea what options are, been in mutual\nfunds his whole life from a manager who i told to drop because he charged 300$\nper quarter when I can just manage his money for no payment. Mom…",
  "data/reddit-stocks/r/investing/comments/twudj4/twitter_ceo_parag_agrawal_im_excited_to_share.json": "Full tweet is \"I’m excited to share that we’re appointing @elonmusk to our\nboard! Through conversations with Elon in recent weeks, it became clear to us\nthat he would bring great value to our Board.\"\nHe goes on to say.\n\"He’s both a passionate believer and intense critic of the service which…",
  "data/reddit-stocks/r/Bogleheads/comments/twla4r/avoid_target_date_retirement_funds_in_taxable.json": "lesson learnt by me the hard way while preparing 2021 taxes. I always thought\ntarget date funds were, an easy way to simplify retirement investments . This\nyear vanguard converted a significant portion of target retirement 2045 while\nrebalancing , which shows up as capital gains. Of course the…",
  "data/reddit-stocks/r/stocks/comments/tw8u4i/att_april_5th_split_t_disca_disck_wbd_and_wbdwv.json": "https://www.fool.com/investing/2022/04/02/heres-what-will-happen-to-att-and-discovery-commun/?source=eptyholnk0000202&utm\\_source=yahoo-host&utm\\_medium=feed&utm\\_campaign=article\n[https://www.fool.com/investing/2022/04/02/heres-what-will-happen-to-att-and-discovery…",
  "data/reddit-stocks/r/Bogleheads/comments/twx4ut/roth.json": "So I thought I was a smart guy and last year wanted to start my boglehead\njourney. Opened a self directed ROTH and made $6k contribution for 2020 and\n2021. Total $12k.\n\nNow Im finding out I am ineligible to open a ROTH if my income was over $120k.\nThat I need to close the ROTH, open a traditional…",
  "data/reddit-stocks/r/investing/comments/twtlxv/why_is_borrowing_to_invest_frowned_upon.json": "I get it, but I don’t. People take out $50k loans to purchase a vehicle like\nit’s no big deal. If you took out that same amount to put in the stock market\npeople would think you’re insane. Like a vehicle will most certainly lose value,\nwhile a stock has at least a chance to go up in value while…",
  "data/reddit-stocks/r/stocks/comments/tx1pu5/natural_gas_prices_will_increase_at_a_greater.json": "With Biden planning on releasing 1 million b/day of oil from the strategic\nreserves I think that natural gas producing companies will do very well. With\nthe US government supplementing the market with a ton of oil for 6 months, but\nnot doing the same with natural gas the total supply of natural gas…",
  "data/reddit-stocks/r/stocks/comments/twyyxy/i_might_be_naïve.json": "Did I just find a loophole? Can you take out a loan with say 2.5 APR and then\nput it into a stock with a higher yield in dividends such as AT&T which has\naround 7% this means that you could pocket 5% of the yield off of your loan.\nPlease let me know if I can do this.",
  "data/reddit-stocks/r/stocks/comments/twye3y/feds_brainard_sees_balance_sheet_reduction_soon.json": "> Federal Reserve Governor Lael Brainard, who normally favors loose policy and\n> low rates, said Tuesday that the central bank needs to act quickly and\n> aggressively to drive down inflation.\n> \n> In a speech for a Minneapolis Fed discussion, Brainard said that policy\n> tightening will include a…",
  "data/reddit-stocks/r/Bogleheads/comments/tx9vzf/any_other_bogleheads_believe_capitalism_is.json": "The bogleheads forum nukes any post related to climate change so maybe we can\ntalk about it here?\n\nI am super concerned about climate change and believe our economic system that\npursues endless economic growth is madness. I think most corporations treat\nemployees and the planet like crap and…",
  "data/reddit-stocks/r/Bogleheads/comments/tx6x2h/terrible_advice_from_an_angle_investoruniversity.json": "I am taking a software business class in college taught by a professor who used\nto be an angel investor and is now a multi-millionaire. Today in class he gave a\nlecture on personal finance and said some things that really did not sit right\nwith me. In fact, I think he was 100% wrong about a few…",
  "data/reddit-stocks/r/stocks/comments/tww359/if_you_have_1_million_in_cash_would_dumping_it.json": "If you have $1 million in cash right now, would putting all of it into a S&P500\nIndex Fund and adding $20,000 yearly into it make you a multi-millionaire in 30\n- 40 years?\n\nWould that be a better investment method (in terms of effort, time and risk)\ncompared to something like real estate investing?",
  "data/reddit-stocks/r/stocks/comments/tx5u21/what_was_the_dip_today_about.json": "Just generally confused about such a steep dip today after such a strong rally\nyesterday. I made the classic noob move of trying to buy in too late with fear\nof missing out when there wasn't a gap down at market open and bought in only to\nbe left seeing red. I know there was talks from the Fed, but…",
  "data/reddit-stocks/r/stocks/comments/tx9kf1/aercaps_aer_35b_loss_of_aircraft_to_russia_could.json": "Aercap, the world’s largest aircraft leasing company, has submitted an insurance\nclaim for 3.5 billion worth of aircraft and engines that Russia refuses to\nreturn.\n\nHowever, even if they do get the entire insurance claim (unlikely as the claim\nis going to be fought in court, Loyds of London…",
  "data/reddit-stocks/r/stocks/comments/txcetq/inputting_each_individual_transaction_in_your.json": "First time trader in 2021, luckily I only did like 30 transactions, I think the\ntaxes and upgrading from \"simple return\" options to one that included\nindependent investments probably wiped most my stock earnings. The tax program\nrecommended I use a different site that would charge $50 to compile my…",
  "data/reddit-stocks/r/stocks/comments/txdzdm/tomorrow_i_go_80_cash_there_is_no_hope_im_serious.json": "So after another depressing night of reading nothing but bad news about years of\nwar with Russia, threats from China, inflation, watching Cramer say to sell\ntonight on Mad Money, Tim Seymour and Dan Nathan and Karen laying out the case\nfor below 4000 level and just generally not seeing any hope in…",
  "data/reddit-stocks/r/stocks/comments/tx3hnz/jet_blue_offers_36b_for_spirit_airlines_stock_up.json": "Breaking news:\nhttps://www.cnbc.com/2022/04/05/spirit-airlines-shares-spike-20percent-on-report-jetblue-has-made-bid-to-buy-airline.html\n\nBreaking news as the trading day comes to a close.. Jet Blue has offered to buy\nSpirit Airlines for $3.6B.\n\nEarlier in the year, an announcement of Spirit…",
  "data/reddit-stocks/r/stocks/comments/tx9qy6/what_are_the_strategies_to_reduce_capital_gain_tax.json": "Do you sell at a loss to lower taxes?\n\nI recently started buying stocks. And learnt about capital gain tax.\n\nFor example, I sell 100 stocks and make gain of $1000. Do I have to sell some\nstock which is not giving me any gain to counter the capital gain tax?\n\nWhat are the strategies to minimize…",
  "data/reddit-stocks/r/stocks/comments/txhdc3/be_honest_how_many_of_you_are_actually_beating.json": "Reading the daily discussion thread, I'd be stunned if more than 2 out of 20\npeople who. post here are actually beating the S&P and DOW this year.\n\nI'm about 1-2% pts off from the S&P but beating the Nasdaq. Given how many\ngrowth names and tech names that are beloved here (which have NOT been in…",
  "data/reddit-stocks/r/investing/comments/txitan/im_confused_which_should_i_choose_dividends_or.json": "My parents are convincing me to invest together as a family. They want us to\nsplit the cost and try our luck in either real estate or dividend investing, but\nwe can't decide which. We are weighing the benefits and drawbacks of both\noptions.\n\nMy father suggested that we consider real estate…",
  "data/reddit-stocks/r/wallstreetbets/comments/tx6je3/gamestop_share_record_date_april_8_2022.json": "Broker Wealthsimple stated Gamestop will have a share record date of April 8,\n2022 in preparation for an upcoming shareholder meeting and will thus halt\ndirect registration requests as of April 5, 2022 until April 11, 2022. Do with\nthis knowledge what you will.",
  "data/reddit-stocks/r/stocks/comments/txo96r/the_fed_has_more_money_on_its_balance_sheet_89.json": "5 trillion of that was added to the Fed’s balance sheet since Feb. 2020:\nhttps://fred.stlouisfed.org/series/WALCL\n\n401k balances: https://www.ici.org/401k\n\n——\n\nBut oh ya, inflation is only happening because the ships and ports and all that\njazz. Definitely not because of the largest instance of…",
  "data/reddit-stocks/r/stocks/comments/txmctj/what_is_the_least_volatile_stock.json": "My bank is running a promo where I receive a cash prize if I make a trade for a\ncertain amount on their platform. I don’t really intend to stay with them so .\nAny recommendations for which stock to look at? Not really looking to make any\ngains but just to minimize my downside as I will be closing…",
  "data/reddit-stocks/r/investing/comments/twyyg5/labor_shortage_boomers_retiring_and_how_it_will.json": "To me the biggest effect of the pandemic is just how many boomers decided to\nretire and how it’s affecting labor shortage.\n\nAlmost no one wants to take a low wage job since they can work anywhere and can\nchoose. Articles claiming trucking companies have a shortage of truck drivers\nwhile other…",
  "data/reddit-stocks/r/Bogleheads/comments/txq2yq/why_do_bogleheads_constantly_say_stocks_are_on.json": "It doesn't make any sense to me.\n\nBogleheads believe 1) information is reflected in the current prices at all\ntimes (efficient market basically), 2) one can not time the market or pick\nstocks consistently, 3) higher expected returns come with higher risk. Fair\nenough.\n\nThen why are there so many…",
  "data/reddit-stocks/r/investing/comments/txr4c5/former_ny_fed_pres_bill_dudley_fed_might_need_to.json": "It's rare to see a Fed official, even a former one, be this explicit about the\nwealth effect going the other direction. The Fed relied on the wealth effect to\nboost the economy when stocks were on the way up. (Bernanke famously said so in\n2010). Now Dudley says the Fed wants equities lower to slow…",
  "data/reddit-stocks/r/stocks/comments/txpf2u/the_us_fed_will_force_stocks_down.json": "> In contrast to many other countries, the U.S. economy doesn’t respond directly\n> to the level of short-term interest rates. Most home borrowers aren’t\n> affected, because they have long-term, fixed-rate mortgages. And, again in\n> contrast to many other countries, many U.S. households do hold a…",
  "data/reddit-stocks/r/Bogleheads/comments/txkghv/how_to_think_about_investment_decisions.json": "I recently read this\n[https://old.reddit.com/r/Bogleheads/comments/ttpjz7/a_mental_exercise_to_realize_the_folly_of_dollar/]\npost by u/Dubs13151 [/u/Dubs13151] on how to think about DCA-ing a windfall in a\nway that such that intuition matches with the optimal path as suggested by\nstatistics and…",
  "data/reddit-stocks/r/investing/comments/txwfi8/what_happens_during_a_recession.json": "Simply that, I’m 20 this year and if we do reach a recession, what happens to\nthe stock market? Are there any sectors or stocks that perform or does the whole\nmarket tank?\n\nIf everything does go down, maybe you can’t time the bottom but that means you\nshould just sell now, lock in profits and wait…",
  "data/reddit-stocks/r/stocks/comments/txi7d4/rstocks_daily_discussion_wednesday_apr_06_2022.json": "These daily discussions run from Monday to Friday including during our themed\nposts.\n\nSome helpful links:\n\n * Finviz [https://finviz.com/quote.ashx?t=spy] for charts, fundamentals, and\n   aggregated news on individual stocks\n * Bloomberg market news [https://www.bloomberg.com/markets]\n *…",
  "data/reddit-stocks/r/investing/comments/txkrxv/balance_sheet_to_be_focus_of_fed_minutes_amid.json": "Shedding light on US central bankers’ hawkish stance, minutes from the Federal\nReserve March meeting are expected to reveal a committee leaning towards more\naggressive monetary tightening.\n\nLikely to mirror post-meeting rhetoric, the Fed minutes are set to reinforce an\nurgency to frontload policy…",
  "data/reddit-stocks/r/stocks/comments/ty9lkc/anyone_familiar_with_sex_toys_companies_listed_on.json": "I might be a bit late, but Im sure this business will only grow larger the\ncoming years. However Im completely unfamiliar with the companies. Can anyone\nprovide some basic information or where to look?",
  "data/reddit-stocks/r/stocks/comments/ty4z33/how_often_do_you_buy_stocks_when_they_didnt_dip.json": "How often do you buy stocks when they DIDN'T dip?\n\nI tend to prefer to buy stocks whenever they are on a down day (3-5% etc), but I\nwas wondering how people who buy stocks on the \"up and up\" do when they buy\nstocks that are up for the day or week etc..\n\nAs an example, stocks like PLD, LNTH or even…",
  "data/reddit-stocks/r/investing/comments/ty9l1e/50k_invested_for_20_years_robo_investor_or_doing.json": "Heeya investment people!\n\nI want to invest $50.000 into an overall passive investment strategy, and hold\nit for +20 years.\n\nI'm okay with the risk involved in a 100% stock portfolio, now that my goal is\nto hold for so many years.\n\nNow I have two main options for this:\n\n 1. Robo investor with SoFi…",
  "data/reddit-stocks/r/investing/comments/tyb0ef/portfolio_for_a_rising_interest_rate_and_high.json": "I'm thinking about how to position myself for a high inflation and rising\ninterest rates environment. My current thesis is this:\n\n * Rising interest rates, and thereby a rising risk-free rate, are going to\n   compress multiples in the broad stock market. This makes investing in broad\n   index ETFs…",
  "data/reddit-stocks/r/stocks/comments/ty81uf/hps_stock_rockets_after_berkshire_hathaway.json": "Shares of HP Inc. surged in after-hours trading Wednesday after Warren Buffett’s\nBerkshire Hathaway Inc. disclosed that it had taken a large stake in the Silicon\nValley maker of personal computers and printers.\n\nBerkshire BRK.A, +0.19% BRK.B, -0.03% disclosed in a late Wednesday filing that\nit…",
  "data/reddit-stocks/r/investing/comments/tyii6f/dutch_housing_market_first_drop_in_average.json": "\"After years of steadily rising house prices, the housing market shows the first\nsign of cooling. Homebuyers, on average, paid 2.1 percent less for an existing\nhouse in the first three months of 2022 than in the previous quarter, realtors'\nassociation NVM reports. That's the first quarterly price…",
  "data/reddit-stocks/r/Bogleheads/comments/tyhxjy/dazed_and_confused_first_timer_roth_401k_need.json": "Background: 36 yr old been in the bar business since 21, left that side of the\nthings recently and moved to a corporate distributing company that has Schwab\n401k and Roth. Been reading the Bogle wiki and I’m just not retaining the info\nbc I’m sleep deprived from our week old newborn, just need…",
  "data/reddit-stocks/r/stocks/comments/tyb8xe/ways_congress_may_be_about_to_pump_up_qualcomm.json": "Biden just held a meeting to hurry lawmakers to approve the $52billion CHIPS Act\nhttps://www.congress.gov/bill/116th-congress/house-bill/7178\n\nBut that’s just one of several acts to fund the semiconductor industry. Some are\nsignificantly larger.\n\nhttps://www.commerce.senate.gov/2022/3/senate…",
  "data/reddit-stocks/r/stocks/comments/tyk3a6/what_are_some_popular_stocks_you_think_are.json": "Do you think there are popular stocks that are overvalued? If so, what is your\ntheory about why it is overvalued and do you expect it/them to see correction\nsoon? What would it look like? What do you consider the fair market value of the\nstock to be?",
  "data/reddit-stocks/r/wallstreetbets/comments/tyey2l/can_mods_lower_the_15b_market_cap_limit_for.json": "I understand why mods have this rule in place but I think 1B is a better\nseparator of shit penny stock companies and ones with real growth potential. May\nnot seem like a huge difference, but 1B to 1.5B is a 50% growth which can happen\nin days, and us reetards NEED these gains to offset our…",
  "data/reddit-stocks/r/stocks/comments/tyifo7/whats_the_downside_of_investing_in_highyield.json": "Beginner here. Was looking at different stock investing strategies, and one that\ncame up was investing in high-yield dividend stocks.\n\nFrom what I understand, investing in this manner may not get you the greatest\nreturns year after year, but it’s a safe means of investing.\n\nFor example, let’s say…",
  "data/reddit-stocks/r/stocks/comments/tyo3om/peter_thiel_calls_warren_buffett_a_sociopathic.json": "At a bitcoin conference on Thursday, billionaire venture capitalist Peter Thiel\nsaid Warren Buffett tops an “enemies list” of people who are trying to stop the\ncryptocurrency. “Enemy number one,” Thiel said to a booing Miami crowd, is “the\nsociopathic grandpa from Omaha.” Buffett’s Berkshire…",
  "data/reddit-stocks/r/stocks/comments/tymg2c/if_you_had_to_choose_one_dividend_stock_right_now.json": "Few things for you to understand what kind of stock I'm looking for:\n\n * Yield higher than 2,5% extra pts if higher than 3%;\n\n * Good valuation, near it's 52 year low or with room to grow;\n\n * Without known future problems like MMM (paying lawsuits of millions for\n   compensatory damage);\n\n * With…",
  "data/reddit-stocks/r/Bogleheads/comments/tyqx49/how_would_a_boglehead_get_ready_to_buy_a_house.json": "I’m looking to buy a house within the next 2 years. Assuming Retirement accounts\nare set. What would you do in this sandbox scenario to prepare to buy a house in\nthe next year or two.",
  "data/reddit-stocks/r/investing/comments/tz342h/are_indexfunds_hurting_the_economy.json": "“The problem with common ownership in index funds is that you have institutional\nfirms—BlackRock, Vanguard, State Street—become the biggest owners of companies\nlike Ford and GM. It hurts these companies’ incentive to compete with each\nother, leads to higher prices and slower economic growth. That’s…",
  "data/reddit-stocks/r/stocks/comments/tz3q84/lets_speculate_on_100_baggers.json": "I thought it would be fun for us to have a discussion on some companies that are\nchasing massive opportunities out there. These are the future Microsoft’s,\nTeslas and Apples.\n\nWe only need a few of these and small investments early on to reap massive\ngains. What potential 100 baggers are you…",
  "data/reddit-stocks/r/stocks/comments/tz8vor/serious_trouble_ahead_for_solar_stocks_especially.json": "80% of solar panel shipments to the US will be halted, perhaps for the whole\nyear, by an anticircumvention investigation. This is going to be a huge disaster\nfor most solar stocks, especially utility-scale sector. Domestic manufacturers\nlike First Solar may weather the storm better, but the…",
  "data/reddit-stocks/r/investing/comments/tz6hpw/big_short_keeps_nickel_market_on_edge_one_month.json": "Bloomberg has been covering this pretty extensively, but, strangely, there has\nbeen almost zero discussion on the topic on this sub (of all places).\n\nArticle [https://imgur.com/gallery/V87Rtv3]\n\nNickel spot prices L3Y [https://imgur.com/a/h7309SW]\n\nPrice history since 12/2021…",
  "data/reddit-stocks/r/Bogleheads/comments/tz5mob/does_simple_bogle_investing_make_sense_in_the.json": "I have 50k I'd like to invest. I have the option to use my bank's wealth\nmanagement fund because I already have a large enough account balance to be of\ninterest to them. I heard that this is a waste because of the fees. I was warned\nby some of my friends who care about investing that now is very…",
  "data/reddit-stocks/r/Bogleheads/comments/tz2tiv/a_few_good_funds.json": "I wish I learned about index funds when I first started investing, had the\nintelligence to buy a few good funds, added to them over my lifetime, and never\nquestioned the concept. I’d have more money than I do today and would have\ncreated more time to do more enjoyable things. ~Rick Ferri",
  "data/reddit-stocks/r/stocks/comments/tzev4e/nvidia_seeks_approval_to_double_authorized_shares.json": "Reuters:\n\n> (Reuters) - Chipmaker Nvidia Corp said on Friday it would seek shareholders'\n> approval to increase the number of authorized shares of common stock to 8\n> billion from 4 billion.\n\nThat's the entire article. I tried looking for additional info on this but can't\nfind any. Some people on…",
  "data/reddit-stocks/r/Bogleheads/comments/tzdzrk/recommendations_for_hysa.json": "I'm looking to park a large sum of money which I plan to use in the next few\nyears as the down-payment for a house. For this reason I am unwilling to put the\nmoney in the market. For context, I have already maxed out my I-Bond allowance\nfor the year.\n\nWhich HYSA accounts are recommended by this…",
  "data/reddit-stocks/r/Bogleheads/comments/tzifzo/i_recently_stopped_a_tenyear_run_of_heavy.json": "I'm 36. Started applying the Boglehead philosophy last year after receiving a\nlow six-figure inheritance on top of experiencing a change in jobs that more\nreadily allowed me to put money away for retirement. That's later in life than I\nwould have ideally liked to have begun this journey, but based…",
  "data/reddit-stocks/r/stocks/comments/tz4vtx/is_there_any_downside_to_shareholders_when.json": "Google, Meta, Apple, seem to pay a lot of their employees in what can go as high\nas 50% cash/50% shares. This caught me offguard, is there any downside to\nshareholders when companies do this?\n\nOr is it beneficial to shareholders since the companies have to pay out less\ncash? Maybe there's no effect…",
  "data/reddit-stocks/r/investing/comments/tzcia9/will_data_center_reits_ever_be_obselete.json": "Hi there,\n\nI have a question for the tech guys around here, or anyone who has a legit\nanswer, basically.\n\nI have been looking at data center REITs like Equinix & Digital Realty. They\nseem to have an excellent track record of growth.\n\nHowever, the tech world is constantly changing.\n\nSo the question…",
  "data/reddit-stocks/r/investing/comments/tzha5i/reuters_nvidia_seeks_approval_to_double.json": "April 8 (Reuters) - Chipmaker Nvidia Corp (NVDA.O) said on Friday it would seek\nshareholders' approval to increase the number of authorized shares of common\nstock to 8 billion from 4 billion.\n\nAgain this is not a stock split this is a dilution of shares. Any insight from\nmy fellow redditors would…",
  "data/reddit-stocks/r/stocks/comments/tzfu64/wall_street_week_ahead_for_the_trading_week.json": "Good Friday evening to all of you here on r/stocks [/r/stocks]! I hope everyone\non this sub made out pretty nicely in the market this past week, and are ready\nfor the new trading week ahead. :)\n\nHere is everything you need to know to get you ready for the trading week\nbeginning April 11th,…",
  "data/reddit-stocks/r/investing/comments/tz4maq/preferred_stock_what_are_the_proscons.json": "Preferred stocks often pay higher dividend yields. Why would someone choose to\ninvest in common stock rather than preferred? Do preferred stock values\ntypically mirror those the the common stocks? What exactly happens to your\ninvestment in preferred stock if the stock is 'called'?",
  "data/reddit-stocks/r/stocks/comments/tznfdl/30k_want_to_buy_some_blue_chips_what_do_you.json": "I’m 21 and would be holding these for a long time. I have already maxed my Roth\nso… I was thinking about buying apple, a couple shares of Amazon (pre split) and\nI’m not too sure what I would choose for the third. Walmart? Disney? Microsoft?\nWould like to hear your ideas. Was thinking of throwing…",
  "data/reddit-stocks/r/stocks/comments/tzoif7/what_are_some_lesserknown_industries_thats.json": "Industries where there's very few players tend to have more pricing power and\nstability. For example, well-known oligopolies include:\n\n * Enterprise server: Google, Amazon, Microsoft.\n * Search: Google\n * Consumer Home Improvement: Home Depot, Lowes\n\nRecently I've learned of a few more areas such…",
  "data/reddit-stocks/r/stocks/comments/tztgea/im_2_years_old_get_25_a_year_for_my_birthday_and.json": "I think by the time I’m 50 science will have advanced enough to let me live\nanother 300 years. I need a stock to buy that doesn’t exist yet but that you\nthink might exist in the next 10 years. I also need to know when exactly the\nmarket will crash each time and when you think it will surge. I need…",
  "data/reddit-stocks/r/wallstreetbets/comments/tzsleq/i_analyzed_2000_stock_splits_over_the_last_3.json": "Stock splits are all the rage - After Google announced in Feb that there would\nbe a 20:1 stock split in July this year, Amazon has followed suit announcing a\nsimilar 20:1 split and sending the market into a frenzy. Amazon’s price was up\nby 6% the next day and Google’s stock rose more than 9% in…",
  "data/reddit-stocks/r/investing/comments/tzua4n/sp_becomes_first_ratings_agency_to_declare.json": "After Russia attempted to make payments on dollar denominated debt in Rubles,\nS&P Global changed Russia's foreign debt credit rating to the default\nclassification. Russia tried to make the payment on April 4th, but it was\nblocked under US Sanctions. The Treasury Department had recently granted…",
  "data/reddit-stocks/r/stocks/comments/tziby5/why_are_central_banks_irrational.json": "We had 40 years of decreasing interest rates, by excluding shelter from the CPI,\nand the wealth effect from housing. But what is the point in all this, is there\na section in economics textbooks about intentionally blowing up bubbles?\n\nNow rates have to rise, and a lot of debt printed will have…",
  "data/reddit-stocks/r/Bogleheads/comments/tztjgh/the_rebalancing_bonus_theory_and_practice_william.json": "THE REBALANCING BONUS: THEORY AND PRACTICE\n[http://www.efficientfrontier.com/ef/996/rebal.htm] - WILLIAM BERNSTEIN /\nEFFICIENT FRONTIER\n\n\nABSTRACT\n\nThe actual return of a rebalanced portfolio usually exceeds the expected return\ncalculated from the weighted sum of the component expected returns. A…",
  "data/reddit-stocks/r/Bogleheads/comments/tzvjsx/18yearsold_with_9000_in_my_roth_ira.json": "Yay! I’ve worked hard to make that money, and I’m proud of my achievements. I\nhave mainly been following random advice I found online, and I just discovered\nthis subreddit today so I figured I’d ask for more random advice, online…\nCurrently all of that money is invested in an S&P 500 ETF, but now…",
  "data/reddit-stocks/r/stocks/comments/tzw2z4/why_are_stock_upgrades_by_analysts_after_their.json": "I have only been investing since Jan 2021 but I have seen it dozens of times. A\nblock trade sale then a couple weeks later that same bank suddenly gives it an\nupgrade.\n\nI want this to be a general question but if an example is needed Goldman Sachs\njust did it with CPNG yesterday source below. But I…",
  "data/reddit-stocks/r/stocks/comments/u05m80/1000_for_newborn.json": "I’m expecting my first daughter in 2 weeks. I opened a Fidelity account with\n$1000 in it I’m going to invest the day she’s born to start saving for her\ncollege / ext. I’m wanting at least $100 of it to go to a general market\ntracking ETF. Looking for suggestions for what to buy.",
  "data/reddit-stocks/r/stocks/comments/u02410/sofi_company_analysis_and_valuation_big_story_and.json": "SoFi has been a very popular retail stock and I underestimated the amount of\ninformation that was available for it. It took me quite some time to\ndifferentiate what is important and what isn't and this post is a summary of my\nfindings and it includes valuation at the very end.\n\nWhat is SoFi?\n\nSoFi…",
  "data/reddit-stocks/r/stocks/comments/u00e1p/sofi_back_down_thoughts.json": "Whoever said it was going to drop, I salute to you. Not only did it plummet but\nit’s stayed at the bottom.\n\nDo I buy more to lower my average from 7.8 to 7.6 or keep watching. Entire\nmarkets been down and I’ve got 800 to spend.\n\nWhat’s the thoughts on this guys? All I know is that holding for now…",
  "data/reddit-stocks/r/stocks/comments/tzzr6q/apple_or_amd_or_nvidia.json": "I’m starting to get back into investing in stocks and I have about 1k to invest.\nI’m currently looking at Apple, AMD, and Nvidia. Should I split the 1k between\neach or just put the 1k into a single stock? Also I kind of know the difference\nbetween AMD and Nvidia but I don’t. Which one do you guys…",
  "data/reddit-stocks/r/Bogleheads/comments/u053rv/equally_weighted_or_market_cap_weighted.json": "Over the years I’ve invested 1/3 to large cap, 1/3 to mid cap and 1/3 to small\ncap. I have also invested 15-20% to international. I’m intrigued by JL Collins’s\nsimplicity approach of simply using a Total Market Index fund. However, I can’t\nignore the past outperformance of the equally weighted…",
  "data/reddit-stocks/r/stocks/comments/u06m4w/is_it_a_good_idea_to_invest_in_tsmc.json": "Taiwan Semiconductor Manufacturing Company (TSMC) has been on my wish list and\nif the stock continues to drop would it be a good invest to consider for long\nterm despite the political tension?\n\nOne of the main compelling point of this company for me is that based on the Q3\n2021…",
  "data/reddit-stocks/r/stocks/comments/u0fw0u/what_is_one_idea_or_mindset_you_hold_onto_with.json": "As a disclaimer, I am not trying to ''educate'' anyone or act like I know it\nall. I am far from an expert, and I will never consider myself as such out of\nrespect for the complexity of stock-picking, but after reading the major works\nof Howard Marks, Graham, Buffet, Munger, and having observed my…",
  "data/reddit-stocks/r/stocks/comments/u09dm6/what_feels_like_a_red_flag_dividend_rate.json": "So people have asked why not invest for qualified dividends and so on, and a\nmyriad of reasons why it's at least a mixed strategy for companies have been\noffered, largely because it takes money from the potential value of the company.\nSo if you're dividend skeptical, what's the percentage where it…",
  "data/reddit-stocks/r/investing/comments/u0gnzj/out_of_everyone_in_rinvesting_is_there_an_asset.json": "Maybee I have just been lurking here too long, but everting is all kind of\nstarting to look the same. Tesla + uranium + weed stocks + crypto. Over and over\nand over again.\n\nThe point of me plugging into a community is to come across new ideas I had not\nconsidered before. So lets have em. What is…",
  "data/reddit-stocks/r/stocks/comments/u0fowb/what_the_heck_is_going_on_with_bac.json": "I thought that raising interest rates would be beficial for a bank but the stock\nprice has been falling for the past weeks pretty much after the FEDs decision to\nstart raising rates.\n\nSo what is going on there?",
  "data/reddit-stocks/r/investing/comments/u0iqre/if_russia_defaults_on_its_debt_what_goes_up.json": "Obviously a lot of stocks go down, but there’s always big institutional\ninvestors that move their money from one place to another when something like\nthis happens. There’s also some type of business that would benefit from this. I\nam not smart enough to figure this out, but I know some of you…",
  "data/reddit-stocks/r/stocks/comments/u0ouyy/forgot_to_report_miniscule_gains_what_are_the.json": "So I had already filed my taxes and I realized afterward I forgot to include\nsome Computershare sales I had. At most I only made like $50 from the sale,\nmeaning taxes would have only been another $5-10\n\nApparently the IRS overlooked this because they did get a report of the sale\nfrom Computershare,…",
  "data/reddit-stocks/r/stocks/comments/u0ovvb/semi_conductors_a_buy.json": "It seems of everything lately semiconductors have taken on of the biggest hits,\nyet still ever increasing demand for them. I’m curious if this could be a good\nbuy opportunity for them especially before the earnings start, or is there\nsomething that I am missing which will continue to drive them…",
  "data/reddit-stocks/r/stocks/comments/u0jb9q/with_the_amazon_and_google_stock_splits_coming_up.json": "Looking to capitalize on Amazon and Google splitting their stocks since I don't\nown either today, I've never purchased stock from a stock split so is it just as\neasy as purchasing regular stock(s) at the current price at market open?",
  "data/reddit-stocks/r/Bogleheads/comments/u0m90g/file_your_taxes.json": "might want to get started early enough to fix any problems\n(over/undercontributing, rustling up money to pay a larger than expected bill).\nidk, seems like good advice.\n\nPS: Deadline is Apr 18 (Monday) rather than the 15th because of some holiday, so\nyou have time to get things sorted.",
  "data/reddit-stocks/r/stocks/comments/u0kfjh/are_multiple_years_of_growth_factored_into_the.json": "I’m currently looking into ABNB and I have to say it’s valuation is pretty\nsteep. $100b for a company with circa $6b in annual revenue and only just\nturning profitable.\n\nOn the other side I understand that the company has a lot of\ntailwinds/strengths: - Working from home culture - Lifting of COVID…",
  "data/reddit-stocks/r/investing/comments/u0m4rk/sell_arkk_at_a_loss_for_vti.json": "I had invested about 5k into ARK funds. I lost about 50 percent. My initial idea\nwas that this was a good long term play however given that they are consistently\nmaking bad trades and don’t generally have a long term outlook for their stocks,\nplus the management fee I think it may be wise to take…",
  "data/reddit-stocks/r/wallstreetbets/comments/u0tvnj/can_i_refuse_delivery_on_50_tons_of_egg_futures.json": "So I went a bit overboard with DCE JD contracts. (Fresh Hen Egg Futures). I took\na bunch of drugs and my friend had a bird and idk why but it made me think a\nBird flu strain coming this year so I got a shit ton of contracts.\n\nTurns out I hit the lottery as farmers across the nation massacred their…",
  "data/reddit-stocks/r/stocks/comments/u0ygcy/elon_musk_decides_not_to_join_twitter_board_says.json": "Tesla and SpaceX CEO Elon Musk has abandoned his plans to join the board of\nTwitter, his social network of choice. Twitter CEO Parag Agrawal announced on\nSunday that Musk remains the largest shareholder of Twitter, and the company\nwill remain open to his input.\n\nhttps://www.cnbc.com/2022/04/11/elon…",
  "data/reddit-stocks/r/investing/comments/u0yfos/elon_musk_decides_not_to_join_twitter_board_says.json": "“Elon has decided not to join our board. I sent a brief note to the company,\nsharing with you all here.” - Parag Agrawal\n\nhttps://twitter.com/paraga/status/1513354622466867201?s=20&t=ljgxw1kVvOZi3M-FDeQi3g\n\nhttps://www.cnbc.com/2022/04/11/elon-musk-decides-not-to-join-twitter-board-says-ceo-parag…",
  "data/reddit-stocks/r/stocks/comments/u0sip1/buffetts_alpha_academic_paper_review_and_takeaways.json": "I recently came across the paper Buffett’s Alpha\n[http://docs.lhpedersen.com/BuffettsAlpha.pdf]. It’s an award-winning, highly\ntechnical paper filled with math equations and other heavy financial modeling to\nunderstand how Warren Buffett, probably America’s greatest investor, was able…",
  "data/reddit-stocks/r/stocks/comments/u0to2l/what_is_the_point_of_learning_beyond_the_basics.json": "Most retail traders actually lose money and even less can beat the market.\nhttps://raposa.trade/blog/four-reasons-why-retail-traders-lose-money-in-the-markets/\n\nIf you cannot dedicate yourself full time to learning stocks and options and\nwhatever is there any point in trying to trade by yourself…",
  "data/reddit-stocks/r/stocks/comments/u0y4yf/former_treasury_secretary_summers_makes_another.json": "The combination of economic overheating, policy delays, and supply shocks makes\na U.S. recession more likely in the coming years. Economists' latest forecasts\nalso show the chance of a recession in the next 12 months has risen to 27.5%\nfrom 20% last month\n\nAccording to former US Treasury Secretary…",
  "data/reddit-stocks/r/stocks/comments/u117cq/tesla_needs_lithium_elon_musk_suggests_it_might.json": "Tesla CEO Elon Musk lamented the rising cost of lithium in a recent tweet. He\neven suggested that Tesla might get into the mining business to help solve\nshortages of the key raw material that goes into rechargeable lithium-ion\nelectric vehicle batteries.\n\nTesla-as-miner has far-reaching…",
  "data/reddit-stocks/r/stocks/comments/u17bwh/luckin_coffee_successfully_emerges_from_all.json": "> BEIJING, April 11, 2022 (GLOBE NEWSWIRE) -- Luckin Coffee Inc. (“Luckin\n> Coffee” or the “Company”) (OTC: LKNCY) today announced the successful\n> completion of the restructuring of its financial indebtedness and its\n> emergence from the bankruptcy proceeding commenced with respect to the…",
  "data/reddit-stocks/r/stocks/comments/u1an30/etsy_sellers_start_strike_over_rising_transaction.json": "https://www.barrons.com/articles/etsy-sellers-strike-rising-transaction-fees-51649690984\n[https://www.barrons.com/articles/etsy-sellers-strike-rising-transaction-fees-51649690984?mod=hp_LATEST]\n\nThousands of sellers on Etsy\n[https://www.barrons.com/market-data/stocks/etsy]began a planned weeklong…",
  "data/reddit-stocks/r/stocks/comments/u1bcrs/shopify_plans_10for1_split.json": "\"Shopify Inc. said it plans a 10-for-1 stock split and will give Chief Executive\nOfficer Tobi Lutke a special “founder share” that will preserve his voting power\nas long as he’s at the company.\"\n\nI think Tobi is doing a fantastic job managing the company, so I'm ok with the\nother changes.\n\nWhat are…",
  "data/reddit-stocks/r/investing/comments/u0tftm/short_term_investments_for_the_next_25_years.json": "Going to be saving heavily (goal is $125k) for the next 2.5 years for a home\npurchase. I’m trying to position my portfolio understanding that we’re in a high\ninflation, interest rates rising environment with a potential recession\noccurring during this time period.\n\nMy number one goal is…",
  "data/reddit-stocks/r/stocks/comments/u1hvsq/realistically_where_do_you_see_the_stock_market.json": "Hi there,\n\nWe can all feel the negative atmosphere in the stock market, since the beginning\nof the year, we've been hearing nothing but bad news.\n\nNow, let's try to look beyond the near term challenges.\n\nWhat are your realistic expectations for the stock market in the next 10 years?\n\nWill it be…",
  "data/reddit-stocks/r/stocks/comments/u1f92t/disadvantages_of_etfs.json": "Everybody is quite positive about ETF's these days and it is obvious to see why.\nFor a great price, you got great diversification, low risk and a relatively high\nreward in the long run.\n\nMy question is though, with all the hype surrounding ETF's, what are some actual\ndisadvantages of ETF's that…",
  "data/reddit-stocks/r/wallstreetbets/comments/u1fuis/j_powell_just_pulled_down_his_pants_and_is.json": "Inflation has grown so much The WH is releasing statements talking up how bad\nthe CPI report will be before it’s even released…\n[https://www.cnbc.com/amp/2022/04/11/inflation-data-white-house-expects-big-price-hikes-in-march-cpi-report.html]\n\nWhat does that mean: J Powell is going to be given the…",
  "data/reddit-stocks/r/investing/comments/u1hvc4/realistically_where_do_you_see_the_stock_market.json": "Hi there,\n\nWe can all feel the negative atmosphere in the stock market, since the beginning\nof the year, we've been hearing nothing but bad news.\n\nNow, let's try to look beyond the near term challenges.\n\nWhat are your realistic expectations for the stock market in the next 10 years?\n\nWill it be…",
  "data/reddit-stocks/r/stocks/comments/u1nzni/jim_cramer_says_big_tech_uninvestable_just_two.json": "Just took this screenshot a moment ago. It's hilarious how bad this guy's advice\nis sometimes: https://imgur.com/a/YF2gJGH\n\n28th March:\nhttps://www.cnbc.com/video/2022/03/25/jim-cramer-says-to-buy-these-big-tech-stocks-next-time-analysts-say-theyre-not…",
  "data/reddit-stocks/r/stocks/comments/u1fa6a/popular_old_forum_about_a_company_that_was_going.json": "Does anyone have a link to the forum about a bunch of investors who owned a\ncompany that they expected to be acquired by Apple or have Apple use there parts\nin phones.\n\nI remember it got halted one day and they all thought they would be rich, but it\nturns out the halt was because the company was…",
  "data/reddit-stocks/r/stocks/comments/u13pxq/rstocks_daily_discussion_monday_apr_11_2022.json": "These daily discussions run from Monday to Friday including during our themed\nposts.\n\nSome helpful links:\n\n * Finviz [https://finviz.com/quote.ashx?t=spy] for charts, fundamentals, and\n   aggregated news on individual stocks\n * Bloomberg market news [https://www.bloomberg.com/markets]\n *…",
  "data/reddit-stocks/r/stocks/comments/u1gjqq/anyone_notice_a_lot_of_growth_stocks_were_up_today.json": "A bit of an odd day today, it seems like big tech took a large hit while a lot\nof the most expensive growth stocks were up or faired much better. To name a few\nthat were up today: NET, SNOW, FSLY, SHOP, CRWD, ROKU, SQ, ETSY. Even ARKK\noutperformed the major indexes today, although it was still down…",
  "data/reddit-stocks/r/investing/comments/u1ocku/nine_years_ago_someone_here_asked_what_stock_to.json": "https://www.reddit.com/r/investing/comments/1bbbgh/if_you_were_to_buy_a_stock_today_to_hold_for_20/\n\nI saved this thread and looked back to see winners and losers. Some interesting\npicks here, GOOG, AAPL, along with some \"safer\" picks. Towards the bottom a few\nfolks suggest TSLA, and at the very…",
  "data/reddit-stocks/r/Bogleheads/comments/u1kcs8/any_bogleheads_in_public_service_with_a_pension.json": "Any LEOs, teachers, state/federal employees on here that have a pension to\nfactor into their retirement plans? I’m 27 have been employed by a state agency\nfor about a year and plan to do it long term. While the pay isn’t great, there\nare a lot of benefits that make it financially worthwhile. Most…",
  "data/reddit-stocks/r/wallstreetbets/comments/u1k9ir/100000_in_a_bank_account_earns_less_than_100_per.json": "$100,000 in a bank account earns less than $100 per year,\n\n$100,000 invested in an S&P 500 index fund can earn over $10,000 per year.\n\nYou cannot save your way to wealth, you must invest.\n\nThe wealthy understand this.\n\nSaving is a wealth incinerator.\n\nInvesting is a wealth accelerator.\n\nInvesting…",
  "data/reddit-stocks/r/Bogleheads/comments/u1nnts/hows_my_long_term_plan_for_a_28_year_old_im_100.json": "I figure I don’t need bonds for another 20+ years?\n\nI have about $12,000 in my Roth IRA , and about $15,000 in a taxable account.\n\nHow’s my plan? I plan on maxing out the Roth IRA and about another $5,000\nannually in the taxable account. I’ll be able to do that and additionally save a\ncouple…",
  "data/reddit-stocks/r/Bogleheads/comments/u1n8cm/proscons_100_into_vt_in_both_roth_ira_and_taxable.json": "I have a ton of anxiety about pulling the trigger on this strategy and just want\nsome insight to the Pros and Cons of this approach. For reference, I am 28 and\nwould like to retire between 55-60.",
  "data/reddit-stocks/r/stocks/comments/u1y17a/usd_inflation_surges_to_85_on_an_annual_basis.json": "> The Consumer Price Index for All Urban Consumers (CPI-U) increased 1.2 percent\n> in March on a seasonally adjusted basis after rising 0.8 percent in February,\n> the U.S. Bureau of Labor Statistics reported today. Over the last 12 months,\n> the all items index increased 8.5 percent before seasonal…",
  "data/reddit-stocks/r/investing/comments/u1xyrn/cpi_rises_12_in_march_85_over_last_12_months.json": "https://www.bls.gov/news.release/cpi.nr0.htm\n\nYou can see a very specific breakdown per item here:\nhttps://www.bls.gov/news.release/cpi.t02.htm\n\n> The Consumer Price Index for All Urban Consumers (CPI-U) increased 1.2 percent\n> in March on a seasonally adjusted basis after rising 0.8 percent in…",
  "data/reddit-stocks/r/Bogleheads/comments/u1zdgq/may_series_i_bond_six_month_rate_estimate_to_be.json": "Shout out to David at TipsWatch.com\n\nhttps://tipswatch.com/tracking-inflation-and-i-bonds/\n\nNobody really likes inflation, but if you are able to hold some cash in I bonds,\n9.62% is pretty sweet.",
  "data/reddit-stocks/r/wallstreetbets/comments/u1y33v/inflation_has_reached_85.json": "The announcement just came in that inflation in the US has reached 8.5%. This is\nstill at a 40 year high for inflation. In March inflation surged another 0.3%\ncausing higher prices on goods all around the US",
  "data/reddit-stocks/r/investing/comments/u1yuea/i_bondss_new_variable_rate_will_rise_to_962_with.json": "Since inflation might be peaking, this might be the highest variable rate for I\nbonds that we'll see for a while! And probably best to lock in the current 7.12%\nin April while you can, so that it can have both high rates in the year long\nminimum holding period.\n\nhttps://tipswatch.com/2022/04/12/i…",
  "data/reddit-stocks/r/stocks/comments/u1xwcz/seriously_sell_me_on_the_metaverse_and_the.json": "For anyone who is very knowledgeable about the metaverse—both where it’s at now\nand where it is headed—I’m asking that you sell the investment to me. I’m\nearnest—if there really is money to be made, pitch it.\n\nWho besides FB is poised to dominate?\n\nI read the metaverse will be worth 800B in 2024…",
  "data/reddit-stocks/r/stocks/comments/u1hb12/charlie_mungertied_daily_journal_slashes_alibaba.json": "> Daily Journal Corp., a newspaper and software business that counts Charlie\n> Munger as one of the overseers of its stock portfolio, cut its stake in\n> Chinese internet giant Alibaba Group Holding Ltd. by roughly half.\n> \n> The Los Angeles-based company owned 300,000 American depositary shares…",
  "data/reddit-stocks/r/stocks/comments/u23e4d/how_much_money_should_a_29_year_old_have_saved.json": "I try not to compare myself with the progress of others, but I often wonder how\nmuch money I should have saved by now. I rent in California, and kind of wish I\nlived at home after college sometimes to save money. I have about $7000 invest\nin the stock market, and then $3000 in savings account and…",
  "data/reddit-stocks/r/stocks/comments/u2b2a0/stunning_realization.json": "Earlier today I was finding myself really torn about whether or not to add cash\nto my positions thinking about how rates are increasing, p/e at all time highs,\nand an overvalued market etc. and I realized I am being overly hard on myself\nduring a time when the market is extremely difficult to…",
  "data/reddit-stocks/r/stocks/comments/u2d6o0/itll_be_okay.json": "I don’t know who needs to hear this or what, but there’s some turbulence in the\nmarkets right now. It has a lot of people spooked, a lot of “experts”\nbewildered. We’ve seen times like these before- and the one we are in is not\neven close to the worst.\n\nWork on increasing your income, lowering your…",
  "data/reddit-stocks/r/stocks/comments/u2ep2q/googl_pe_is_22.json": "The last few times it dipped into a 22 handle it stayed there max two days\nbefore going back up. If you add their cash their P/E is in the teens.\n\nThis is gonna pop on earnings. It is my highest conviction stock.",
  "data/reddit-stocks/r/investing/comments/u21wbq/shorting_the_las_vegas_housing_market.json": "For a variety of reasons that would take a long time to explain, I believe the\nfundamentals of the Las Vegas housing market are terrible and prices will peak\nin the next several months.\n\nI've looked at a lot of REITs, but all the residential ones I can find are\npretty diversified and not…",
  "data/reddit-stocks/r/Bogleheads/comments/u1xnrs/bond_investment_for_nonamericans.json": "Bonds have been the most obscure part of the portfolio for me, which is only\nmade worse by the lack of discussion about non-US bonds. I figured it would be\nworthwhile asking for suggestions for bond investments for British citizens and,\nmore broadly, non US citizens.\n\nWhat bond investments would…",
  "data/reddit-stocks/r/investing/comments/u2fxcd/opened_a_treasury_direct_account_to_purchase_i.json": "Is anyone else doing this? Is it as easy as it seams?\n\nHad no issues opening the account and linking my funding account.\n\nDo I just need to put in $10k and let it go for the year? And assume that I can\nput in $10k each year after?\n\nIf an emergency arrises I can pull the purchase it seems? Just take…",
  "data/reddit-stocks/r/stocks/comments/u2bcv7/bank_of_america_market_selloff_is_overdone_nvidia.json": "Bank of America analyst Vivek Arya said in a research report that Nvidia (NVDA\n[https://NVDA.US]) shares have been sold off recently due to concerns about\nslowing growth, but the sell-off appears to be overdone.\n\nArya said Nvidia shares fell sharply last week, likely due to concerns about…",
  "data/reddit-stocks/r/Bogleheads/comments/u2f14n/leaving_ameriprise.json": "They’ve got about $140k and we have another 100 that we’re sitting on. I’m\nstarting to read up bogleheads but not 100% confident.\n\nAm confident I need to leave. Only been with them for a year. Fees are 1500 a\nyear plus ~$100/month = ~$3000 annually.\n\nI am thinking Fidelity over Vanguard.\n\nIs there…",
  "data/reddit-stocks/r/investing/comments/u2gt5t/buying_ibonds_today_will_yield_a_guaranteed.json": "Why would I not max this out? I understand that I-bonds exist to simply keep up\nwith inflation and if the S&P moons I have missed out, but this kind of no risk\nreturn is not something I have come across in my short time investing. The other\nside of the coin is the S&P could continue to…",
  "data/reddit-stocks/r/stocks/comments/u2hdf7/the_us_seasonally_adjusted_annual_cpi_was_85_in.json": "Two very important pieces of information were released this morning:\n\nAt 20:30, the annual rate of the US CPI in March was non-seasonally adjusted,\nthe previous value was 7.90%, and the expected 8.4% was announced at 8.5%.\n\n\n\nAs of 8:30 p.m., the U.S. reported a post-quarter adjusted monthly CPI of…",
  "data/reddit-stocks/r/Bogleheads/comments/u20umy/should_i_sell_my_bnd_and_buy_i_bonds.json": "Thanks to this sub, I found that this is the last month before rates for I bonds\nincrease. I already have about 10k of BND sitting in a taxable account. Does it\nmake sense to sell that and buy I Bonds? I'll be looking to hold the investment\nfor 1 year minimum.",
  "data/reddit-stocks/r/stocks/comments/u2phfs/producer_prices_rose_112_from_a_year_ago_in_march.json": "The prices that goods and services producers receive rose in March at the\nfastest pace since records have been kept.\n\nProducer prices rose 11.2% from a year ago in March, the biggest gain on record\nhttps://www.cnbc.com/2022/04/13/producer-price-index-march-2022…",
  "data/reddit-stocks/r/Bogleheads/comments/u2oj6y/what_is_in_your_opinion_the_best_bogle_quote.json": "Hi all,\n\nA bit of background: I'm currently writing my thesis about the effect of active\nmanagement on mutual fund performance. I still need to find a \"catchy\" opening\nsentence which will make the reader interested in reading the paper. I thought\nthat using a quote from Bogle might be…",
  "data/reddit-stocks/r/stocks/comments/u2r22x/elon_musk_sued_by_investor_for_delay_in.json": "\"Elon Musk has been sued by a Twitter shareholder who alleges the Tesla CEO\ndelayed disclosing his stake in the social media company so he could buy more\nshares at lower prices.\n\nThe suit, filed in Manhattan federal court on Tuesday, claimed Musk violated\nsecurities laws by not revealing by March…",
  "data/reddit-stocks/r/stocks/comments/u2ryuy/why_breaking_things_is_not_profitable_wars.json": "It has come to my attention that at least some users here don't understand why\nthe broken window fallacy is a fallacy. For those who have been misled into\nthinking war is somehow good for the economy it is time to take a reading field\ntrip to Investopedia.com\n\nWhen money and productivity have to be…",
  "data/reddit-stocks/r/wallstreetbets/comments/u2n3e4/elon_musk_is_sued_by_shareholders_over_delay_in.json": "https://preview.redd.it/2c5sgvz2v9t81.jpg?width=890&format=pjpg&auto=webp&s=42917dbe4a8cb6769bacc2fe47ee358ffd510614\n\nWhich one of you is this? I almost fell out of my chair when I read this in\nReuters this morning.\n\n\n\nhttps://www.reuters.com/technology/elon-musk-is-sued-by-shareholders-over-delay…",
  "data/reddit-stocks/r/Bogleheads/comments/u318va/financial_advisor_constantly_mocking_index_funds.json": "Hi, so my parents have had a financial advisor forever and last year I mentioned\nthe option of doing index funds. I got my parents bogle's books. We've been\nreading them and they agreed it was a good idea. The advisor buys and sells\nindividual stocks causing large capital gains taxes every year. If…",
  "data/reddit-stocks/r/investing/comments/u33xkn/alleghany_shareholder_sues_to_block_116_billion.json": "Alleghany Corp, which agreed last month to be acquired by Warren Buffett's\nBerkshire Hathaway Inc, was sued on Wednesday by a shareholder who accused the\ninsurance company of making inadequate and misleading disclosures about the\n$11.6 billion takeover.\n\nIn a complaint filed in Manhattan federal…",
  "data/reddit-stocks/r/stocks/comments/u2za3n/out_of_nvda_googl_and_msft_which_one_do_you_think.json": "Assuming you can only buy one of the three and that you are not interested in\nsomething like QQQ. Also assume that one already has other plays like value,\noil, etc. e.g. I am not asking if these stocks are overpriced and if we should\ninstead buy CVX or HAL, etc.\n\nNVDA has AI, which appears to still…",
  "data/reddit-stocks/r/Bogleheads/comments/u2wu5d/buying_i_bonds_for_kidthen_rolling_into_529.json": "I have in mind a particular strategy that I haven't seen discussed anywhere\n(which normally means I'm missing something). It's a way to buy more I\nbonds...and then contribute the returns tax free into 529 plan for my kid.\nAppreciate any feedback...\n\nStep 1) Open Minor linked account for my kid…",
  "data/reddit-stocks/r/investing/comments/u392xs/how_do_i_explain_to_my_smaller_sibling_that.json": "I hear this from them that they do not want to invest and only want to spend\ntheir money. So I tried explaining that actually everything is an investment, if\nyou buy a meal you enjoy, you’re investing your money in exchange for satiety,\nif you pay to do something you like, that’s an investment too,…",
  "data/reddit-stocks/r/Bogleheads/comments/u2uww7/vtsaxvtiax_is_it_ok_to_do_fskaxftihx_to_avoid.json": "Hi, just looking for advices/opinions here. I have my $6,000 ready to be\ninvested in my fidelity account. Im on early 30's, looking to invest for 20 to\n30yrs.\n\nEdit: thank you for all your response.Im really grateful to be in this sub. I\nhave my Roth IRA in Fidelity, thats why wondering if above…",
  "data/reddit-stocks/r/stocks/comments/u3bmm7/tsm_q1_earnings_net_profit_up_46_revenue_up_36.json": ">  * Q2 revenue $17.6 bln-$18.2 bln, vs $13.3 bln year prior\n> \n>  * Q1 profit T$202.7 bln vs T$184.67 bln analyst view\n> \n>  * Q1 revenue up 36% on year in U.S. dollar terms\n> \n> TAIPEI, April 14 (Reuters) - Taiwan's TSMC posted a better-than-expected surge\n> in quarterly profit on Thursday and…",
  "data/reddit-stocks/r/stocks/comments/u3e9rx/elon_musk_offers_to_buy_twitter_for_5420_per_share.json": "Tesla founder Elon Musk is offering to buy Twitter for $54.20 per share in cash,\nBloomberg reported Thursday.\n\nTwitter shares are up 12% in premarket trading.\n\n\"Twitter has extraordinary potential. I will unlock it,\" Musk said in an amended\n13-D…",
  "data/reddit-stocks/r/investing/comments/u3eaw3/elon_musk_offers_to_buy_twitter_for_4139_billion.json": "After taking a 9.2% stake in twitter, Elon musk has now offered to buy the\nentire company for $41.39 billion. This comes after some recent news\nannouncement of Elon Musk not accepting the board seat position at Twitter\nbecause of some alleged background check.\n\nAccording to Twitter CEO, Parag…",
  "data/reddit-stocks/r/stocks/comments/u3714r/any_truth_to_they_can_only_raise_interest_rates.json": "I see macro-economists in the media say this all the time. They say that the\namount of interest rate hikes needed to aggressively combat inflation is\nimpossible because the Fed and most central banks are pinned to a corner. They\ncan raise interest rates but if they raise interest rates too high,…",
  "data/reddit-stocks/r/stocks/comments/u3bxpl/facebook_parent_meta_set_to_take_nearly_50_cut.json": "Facebook parent Meta Platforms Inc.’s intent to take a nearly 50% cut of digital\nasset sales within its emerging metaverse is drawing widespread criticism from\ndevelopers and longtime nemesis Apple Inc. Meta FB, +0.40% said in a blog post\nMonday it is allowing a handful of Horizon Worlds creators…",
  "data/reddit-stocks/r/wallstreetbets/comments/u38r30/ryan_cohens_plan_for_bbby_and_why_its_going_higher.json": "BBBY is going higher and is going to turn everything around. This last earnings\nreport was horrendous BUT there are some interesting clues in the earnings call\nwe will get to later.\n\nLets start with Ryan's letter to Bed Bath:\n\nhttps://s.wsj.net/public/resources/documents/bbbletter030622.pdf\n\nSome…",
  "data/reddit-stocks/r/wallstreetbets/comments/u3e77l/elon_musk_wants_to_buy_out_twitter_for_5420_per.json": "Sources:\n\nLink to Tweet\n[https://twitter.com/elonmusk/status/1514564966564651008?s=20&t=yTPdQ4R1evwkZwQmxYlMrw]\n\nLink to Bloomberg\n[https://www.bloomberg.com/news/articles/2022-04-14/elon-musk-launches-43-billion-hostile-takeover-of-twitter?cmpid=socialflow-twitter-business&utm_campaign=socialflow…",
  "data/reddit-stocks/r/stocks/comments/u3jsm1/what_happens_to_the_twtr_shares_people_own_if.json": "How does this even work? Could Twitter just accept his offer and everyone who\nowns shares would just be forced to sell their shares at $54.20/share? Or could\nshareholders individually decide not to sell their share to Musk?\n\nEDIT: I do not own any shares of Twitter, I'm merely curious",
  "data/reddit-stocks/r/stocks/comments/u3b965/commissionfree_broker_alpaca_now_trying_to_charge.json": "I use the Alpaca API to trade penny stocks. Yesterday I got an email:\n\n> We have reviewed the activity in your account. The orders continue to be\n> executed on the opening and closing auctions. Starting on Tuesday we will\n> route your orders to a non retail route and you will be charged a fee of…",
  "data/reddit-stocks/r/stocks/comments/u3ncd8/elon_musk_says_hes_not_sure_hell_be_able_to_buy.json": "Billionaire Tesla CEO Elon Musk acknowledged Thursday he is “not sure” he’ll\nactually be able to buy Twitter, hours after he revealed a $43 billion offer.\n\nMusk comments came at the TED2022 conference just hours after he revealed in a\nregulatory filing Thursday that he offered $54.20 per share to…",
  "data/reddit-stocks/r/investing/comments/u3oqdt/elon_musk_says_hes_not_sure_hell_be_able_to_buy.json": "Billionaire Tesla CEO Elon Musk acknowledged Thursday at the TED2022 conference\nin Vancouver that he is “not sure” he’ll actually be able to buy Twitter. The\ncomments came hours after a regulatory filing revealed that he offered to\nacquire the company for $54.20 per share, or about $43…",
  "data/reddit-stocks/r/Bogleheads/comments/u3ma8n/where_to_put_money_for_house_down_payment.json": "My wife and I are setting money aside for a house down payment. We have less\nthan $20k and will not spend this money for at least a year. For various reasons\nwe may not buy a house for up to 10 years (personal reasons, not financial\nreasons). HYSA? Bonds? Which type of bonds if so? If we end up…",
  "data/reddit-stocks/r/stocks/comments/u3nvg8/amazon_ceo_andy_jassy_says_costs_from_pandemic.json": "https://www.cnbc.com/2022/04/14/andy-jassy-on-inflation-surcharge-amazon-cant-keep-absorbing-costs.html\n\nAmazon CEO Andy Jassy said the company needed to add a fuel and inflation\nsurcharge to deal with rising costs tied to inflation, the coronavirus pandemic\nand the war in Ukraine. “At a certain…",
  "data/reddit-stocks/r/investing/comments/u3stlu/what_are_some_investment_ideas_that_are_atypical.json": "What are some investment strategies that you have utilized that may take a\nlittle upfront work, but have great returns in the long run?\n\nAnd no, mutual funds, stocks, ETFs and buying rental properties have all been\ntalked to death here. I'm more asking about something not everybody thinks\nabout,…",
  "data/reddit-stocks/r/investing/comments/u3tufz/what_am_i_missing_about_googl.json": "Google has:\n\n*Nearly its lowest P/E since 2015\n\n*Still putting up insane growth numbers YoY\n\n*At a roughly 9 month low and very strong support\n\n*Obviously a very strong future with tons of investment in research and\ndevelopment (particularly cloud computing and working on autonomous cars)\n\n*Stock…",
  "data/reddit-stocks/r/Bogleheads/comments/u3tpgg/even_the_dumbest_person_can_become_wealthy_with.json": "I know the title can come off as aggressive, but I am a college student with\nbelow a 3.0 GPA. I am not inherently genius at anything, just a guy who works\nrelatively hard. I used to think you have to be this in depth analyst to\nunderstand investing, but boglehead strategy makes it extremely…",
  "data/reddit-stocks/r/Bogleheads/comments/u3s18o/never_try_to_time_the_market_just_keep_buying.json": "So the stock market has been down all year and that means mostly negative\nreturns for our investments.\n\nPrior to the recent tech sell-off, I bought VTI at close to its peak max price\n(around $243). I bought in around $234 and I've seen my investment lose value\ndue to the sell-off.\n\nVTI has dropped…",
  "data/reddit-stocks/r/stocks/comments/u3pd25/after_1_month_goog_stock_was_under_2550_twice.json": "Been waiting for 1 month for the stock to go under $2550 and it did today at\n17:45h and I wasn't fast enough but luckily it just went under $2550 again so\nI'm really happy!!\n\nDid you got some Goog shares today as well?\n\nNote to self and to you too, if the stock is at the value you wanted don't…",
  "data/reddit-stocks/r/stocks/comments/u3yw4d/vanguard_group_swooped_in_and_knocked_elon_musk.json": "“Funds held by Vanguard Group recently upped their stake in the social-media\nplatform, making the asset manager Twitter's largest shareholder and bumping Mr.\nMusk out of the top spot.\n\nVanguard disclosed on April 8 that it now owns 82.4 million shares of Twitter,\nor 10.3% of the company, according…",
  "data/reddit-stocks/r/stocks/comments/u3yuwo/ark_invest_sets_new_tesla_price_target_4600_in.json": "https://ark-invest.com/articles/analyst-research/arks-tesla-model/\n\nARK’s updated open-source Tesla model yields an expected value per share of\n$4,600 in 2026.\n\nThe bull and bear cases, tuned to the 75th and 25th percentile Monte Carlo\noutcomes respectively, are approximately $5,800 and $2,900 per…",
  "data/reddit-stocks/r/Bogleheads/comments/u3zbyz/for_those_like_me_worried_about_an_upcoming_lost.json": "I played around with the Portfolio Visualizer with an 80/20 Total US Stock/Total\nUS Bond mix. No matter how I tried to cherry pick, since the early 70s, I\ncouldn't find a 20-year period where the money didn't at least triple (if not\nmore).\n\nI then tried having heavy stocks in bad cycles and…",
  "data/reddit-stocks/r/stocks/comments/u3ddz5/rstocks_daily_discussion_options_trading_thursday.json": "This is the daily discussion, so anything stocks related is fine, but the theme\nfor today is on stock options, but if options aren't your thing then just ignore\nthe theme and/or post your arguments against options…",
  "data/reddit-stocks/r/stocks/comments/u40a05/mercedes_ev_breaks_1000kilometer_range_barrier_to.json": "https://www.bloomberg.com/news/articles/2022-04-13/mercedes-ev-breaks-1-000-kilometer-range-barrier-to-outdo-tesla?utm_campaign=instagram-bio-link&utm_medium=social&utm_source=instagram&utm_content=business\n\nA Mercedes-Benz AG electric car drove more than 1,000 kilometers (621 miles)\nfrom Germany…",
  "data/reddit-stocks/r/wallstreetbets/comments/u3uthx/the_hiking_cycle_is_almost_over_why_the_fed_is.json": "A few months ago I made this post about how the fed is trapped\n[https://www.reddit.com/r/wallstreetbets/comments/s1uf49/the_fed_is_trapped_they_have_to_hike_rates_but/]\nand can only raise rates roughly 5 times (in increments of 25bp) before they\nhave to start easing again\n\nWell in that time, the…",
  "data/reddit-stocks/r/stocks/comments/u44fqe/why_the_success_of_apple_m1_series_is_hard_to.json": "When the Apple M1 series came out, lots of people were saying that x86 is\ndoomed, Intel and AMD will be out of business and every big tech companies will\nbe designing their own ARM-based processor. In my opinion, these statements are\nquite detached from reality and is a display of lack of…",
  "data/reddit-stocks/r/Bogleheads/comments/u3w1fn/vanguard_v_fido_thoughts_about_switching_over.json": "I love Jack and all that he stood and stands for even after his passing. Man\nmade more people wealthy than anyone I know of.\n\nMy main question / comment is as follows.\n\nSeems Vanguards customer service has tanked and their technology is bad as we\nall know.\n\nHas anyone thought about going over to…",
  "data/reddit-stocks/r/stocks/comments/u3mt9e/anyone_else_really_bullish_on_fb.json": "Everybody seems to be dog piling on FB and the metaverse. It seems everyone is\nignoring the Fact that they make a ton of money from Facebook still. There is\npotential to monetize instagram. Their PE ratio is really good and the stock\ntook a massive discount, maybe too much of a sell-off. I am long…",
  "data/reddit-stocks/r/investing/comments/u4cupj/opinions_needed_employee_share_buy_in_plan_15.json": "Hi everyone!\n\nI get to choose whether to take 1% - 10% to buy 15% discounted company shares.\nHow would you think about which percentage to choose?\n\nIt's my first year working, not much in savings. But I do like my paychecks atm.\nI appreciate all input",
  "data/reddit-stocks/r/investing/comments/u4dpff/twitter_adopts_poison_pill_to_ward_off_musk.json": "Twitter Inc. adopted a measure that would shield it from hostile acquisition\nbids, taking steps to thwart billionaire Elon Musk’s unwelcome offer to take the\ncompany private and make it a bastion of free speech.\n\nSource:\nhttps://www.bloomberg.com/news/articles/2022-04-15/twitter-adopts-poison-pill…",
  "data/reddit-stocks/r/stocks/comments/u4crab/backtested_a_volatility_strategy_from_an_academic.json": "Hello r/stocks [/r/stocks] friends,\n\nI recently backtested a \"volatility managed strategy\" from Alan Moreira and\nTyler Muir's 2017 paper \"Volatility Managed Portfolios\"\n[https://onlinelibrary.wiley.com/doi/abs/10.1111/jofi.12513]. My results show\nthat following their methodology for a little over…",
  "data/reddit-stocks/r/wallstreetbets/comments/u44o08/why_twotter_is_going_back_to_32_or_lower_quick.json": "Hey dipshits,\n\nThe moment i saw this whole Elon vs Twotter buyout shit happen, i bought myself\nsome nice OTM puts cause i know my boi Elon's planning to fuck Twatter up the\nbumble hole one way or another.\n\n\n\n\nSO HERE'S THE OG DD\n\nLike him or not, Elon is a mega memer troll shitposter and you know…",
  "data/reddit-stocks/r/Bogleheads/comments/u4eky8/will_i_be_okay.json": "23M, can only afford to invest $500 a month for the foreseeable next 4-5 years\n(student loans). since finding out ab finance, investing, FIRE, i’ve only gotten\nmore worried about my future.\n\nany reassuring comments or thoughts or relatable aspects? sorry for a random\npost.",
  "data/reddit-stocks/r/stocks/comments/u4ee21/twitter_counters_a_musk_takeover_with_a_plan_to.json": "Today in NYTIMES:\n\nThe company is intent on trying to fend off the billionaire’s bid to buy it in a\ndeal that could be worth more than $40 billion.\n\nTwitter unveiled its counterattack against Elon Musk on Friday, using a strategy\ninvented to repel corporate raiders in an attempt to block a takeover…",
  "data/reddit-stocks/r/stocks/comments/u4h2b8/how_do_you_deal_with_facing_that_you_bought_the.json": "Bought stock at its top during 2020 and now stuck with heavy bags with it being\ndown over 50%. Seems like it will be impossible for it to ever recover as you\nwill need it to gain over 100% to even breakeven.\n\nAnd on the same mindset, for people who is buying in at these prices which have\nalready…",
  "data/reddit-stocks/r/investing/comments/u4ht6s/twitter_board_adopts_poison_pill_after_musks_43.json": "Note: The term poison pill refers to a defense strategy used by a target firm to\nprevent or discourage a potential hostile takeover by an acquiring company.\nPotential targets use this tactic in order to make them look less attractive to\nthe potential acquirer:…",
  "data/reddit-stocks/r/investing/comments/u49d80/investing_in_the_past_as_entertainment_and.json": "Does anyone know of a trading platform that has simulation of the past? Like a\nsort of 'live historical stock market data paper-trader' where you can make all\nthe plays you wish you would have. Works near identical to a regular paper\ntrading platform, except you can set the date back and fast…",
  "data/reddit-stocks/r/investing/comments/u4ko6u/ten_members_of_international_stock_manipulation.json": "Global “Pump-and-Dump” Scheme Targeted Retail Investors and Generated Over $100\nMillion in Illicit Proceeds:\n\nhttps://www.justice.gov/usao-sdny/pr/ten-members-international-stock-manipulation-ring-charged-manhattan-federal-court\n\nThis is just one of the juicy parts:\n\n> First, the defendants and…",
  "data/reddit-stocks/r/Bogleheads/comments/u4idjz/charlie_rose_interviews_warren_buffett.json": "Buffett mentions Jack Bogle and indexing starting at 59:20.\n\nThis is Buffett's first interview in about a year and Charlie Rose's first\ninterview in about four years.\n\nhttps://charlierose.com/videos/31221",
  "data/reddit-stocks/r/stocks/comments/u4lmdb/today_jim_cramer_on_cnbc_told_readers_to_sell.json": "He said its because growth stocks dont tend to do well when interest rate rises.\nWhy might this be? Is it because growth stocks rely on debt to finance their\ngrowth and operations? He specifically said to turn away from Big Tech and other\ngrowth stocks as the fed rises interest rates.",
  "data/reddit-stocks/r/Bogleheads/comments/u4hdso/i_have_a_hard_time_understanding_how_an_index.json": "Take a fictional index fund as example, lets name it ABC.\n\nABC is tracking S&P500 and 100,000 people have invested in it.\n\nFrom what I understand, ABC index should have percentage returns or losses based\non what the S&P500 index is doing. But in my head, I actually believe that the\nABC index will…",
  "data/reddit-stocks/r/Bogleheads/comments/u4g06t/do_you_believe_that_the_stock_market_will_have.json": "I’ve been retirement planning lately and I’m in a couple “retire early”subs and\nI posted asking about returning early with my plan and they said that 9% average\nreturn was too high for retirement planning and I should be using 3-4% instead.\n\nWhat are your thoughts on this? This is the first I’m…",
  "data/reddit-stocks/r/stocks/comments/u4jfa7/twitter_company_analysis_and_valuation_is_the.json": "Twitter's share price from the 1st day of trading (back in November 2013) until\ntoday increased by only 8%. The long-term shareholders have every right to be\nunhappy with the performance as well as the way the company has been managed.\nThis post is my attempt to value the company based on the…",
  "data/reddit-stocks/r/Bogleheads/comments/u4hvfb/should_i_invest_my_emergency_fund.json": "I’m 24, I just found this sub a few months ago, and I’ve spent that time saving\nup a $3,000 emergency fund. I made my first Roth IRA contribution of $500 a\ncouple weeks ago.\n\nI just heard back from a job that pays 3x what I’m currently making (I thought i\nwanted to be a teacher).\n\nMy question is,…",
  "data/reddit-stocks/r/wallstreetbets/comments/u4ehc9/lawyers_representing_twitter_shareholders_are.json": "When the Twitter shareholder lawsuits begin the class action lawyers are going\nto have a field day with Goldman Sachs. Just two months ago Goldman's Equity\nResearch [https://twitter.com/elonmusk/status/1514726980909948928] team\npredicted that Twitter's share price would decline from $37.83 to…",
  "data/reddit-stocks/r/stocks/comments/u4s7hl/mark_cuban_says_elon_musk_is_fking_with_the_sec.json": "FROM ARTICLE\n\nMusk offered to buy Twitter for about $43 billion on Thursday\n[https://www.foxbusiness.com/economy/mark-cuban-says-musk-is-f-with-the-sec-thinks-twitter-will-do-everything-possible-not-to-sell?cmpid=fb_fbn]\n\nDallas Mavericks owner Mark Cuban chimed in on Elon Musk's attempt to…",
  "data/reddit-stocks/r/Bogleheads/comments/u4z72g/summarythe_little_book_of_common_sense_investing.json": "I will be starting posting my notes of book am reading .I want to keep them in a\nrecord so i can quick read and remind me things that i shouldn't be forgetting ,\nso i can also post them here if someone want to have a look\n\n 1.  Bumps are large. But we get over them.\n 2.  In our foolish focus on the…",
  "data/reddit-stocks/r/Bogleheads/comments/u4rzxu/figuring_out_the_bond_portion_of_your_portfolio.json": "From what I have read, as long as the average duration of your bond fund is less\nthan or equal to your expected retirement date, you will be fine as far as risk\nis concerned.\n\nLet's say that right now I have 18 years until retirement. Would it make sense\nto have the bond portion of my portfolio be…",
  "data/reddit-stocks/r/stocks/comments/u521ic/beware_the_powcycle.json": "Hi, all.\n\nI posted this earlier, but it's so deeply buried in a very long thread that no\none will see it. In case it might prove helpful, here it is:\n\nThere's something that I call the POWcycle that has defined market conditions\nsince mid-Feb 2021. The cycle is this:\n\n 1. Each month, the CPI is…",
  "data/reddit-stocks/r/investing/comments/u4wke3/upcoming_phosphorus_shortage_as_an_investment.json": "Howdy folks,\n\nI was listening to a podcast last night (it's not in English so I'm not going to\nlink it here) with a paleo-climatologist talking about global warming/climate\nchange and all that interesting and often controversial stuff. Not the point.\nOne thing he noted, however, is the availability…",
  "data/reddit-stocks/r/stocks/comments/u53yb7/what_stock_today_do_you_think_is_similar_to_ge_or.json": "I watched a conference with Buffett a few months ago. Basically he had a chart\nof the top 30 companies in the world by market cap 30-40 years ago or so. Not a\nsingle company of those 30 are in the list of the top 30 companies by market cap\ntoday.\n\nSo, which large cap stocks do you believe are our…",
  "data/reddit-stocks/r/investing/comments/u559cn/is_pe_ratio_still_a_good_indicator_for_deciding.json": "I remember reading long ago that 15:1 was a good P/E ratio for a company.\n\nI just saw that Disney is trading at 77:1 and who knows about many other high\nflyers. I understand that some companies are in growth mode, and may not even\nhave earnings, but what about all the others?\n\nI understand there…",
  "data/reddit-stocks/r/stocks/comments/u59mqo/whats_a_stock_youve_vowed_to_never_touch.json": "For me it’s Tesla. They were a disruptor in the automotive industry but their QC\nis getting quite poor and dare I say it, other brands are starting to make\nsuperior products. I definitely don’t see their reign lasting forever.",
  "data/reddit-stocks/r/stocks/comments/u4z0ug/costco_or_target_a_good_add_to_my_portfolio.json": "I have VTI as my main position. About 40% of my recurring investment goes to it.\n25% goes to Ethereum. 5% of the rest goes to each non-US stocks since I didn't\nwant VXUS or VT. Wanted to diversify my non-US positions both in country\n(Germany, Australia, Taiwan, Japan, Israel, and Netherlands) and…",
  "data/reddit-stocks/r/Bogleheads/comments/u58ita/buying_an_index_is_you_betting_that_the_world.json": "Here is a chart of global GDP over the last 60 years.\n\nhttps://www.macrotrends.net/countries/WLD/world/gdp-gross-domestic-product\n\nHere is a chart of the S&P over the last 40…",
  "data/reddit-stocks/r/Bogleheads/comments/u586rl/is_vti_and_vxus_diverse_enough.json": "Are there better options in your opinion?\n\nI was always under the impression VTI and VXUS was enough",
  "data/reddit-stocks/r/stocks/comments/u58y90/nasdaq_at_the_same_level_it_was_16_months_ago_in.json": "Nasdaq hit 13,543 points on Jan 28, 2021. Right now we are at 13,351. Last ATH\nfor Nasdaq was in November 2021 at 16,212. Tech stocks index have been flat for\nliterally 1.5 years now. Not to mention bear market crash for bonds, (high\ngrowth stocks which are down -70%) and cryptos (down -40%)\n\nAll…",
  "data/reddit-stocks/r/Bogleheads/comments/u59jpb/worth_abandoning_voo_for_a_total_market_index.json": "Does it matter that much? Worried I don’t have small and mid cap exposure.\nInternational not so worried about since s&p companies have significant\nexposure.\n\nI’m at about 60% voo, 20% VT, 20% vgt right now but haven’t touched the latter\ntwo in a while.",
  "data/reddit-stocks/r/Bogleheads/comments/u5frx9/reddit_investing_advice_is_all_aimed_at_young.json": "\"Time in the market beats timing the market\" is the classic advice given to\neveryone who asks anything indicating that they are trying to figure out where\nthe market might go in the future. The thing about this quote is that it's\nflawlessly good advice... for young people.\n\nThe problem is that the…",
  "data/reddit-stocks/r/investing/comments/u5hhq1/is_it_better_to_invest_early_in_many_small.json": "I know the obvious answer is of course diversify, especially when it comes to\nsmall projects. But in reality, I know that those that have for example risked\nit all on a small project like Bitcoin back in the day, had all to gain. There’s\na distinct difference between investing, and gambling. So I…",
  "data/reddit-stocks/r/stocks/comments/u5atil/my_tax_person_didnt_report_8_dividend_2_tax_in_my.json": "Hello!\n\nI received dividends worth $8 and taxes on that was $2. When the person who does\nmy taxes tried to put it in the software (Guessing Turbo tax), it said it's too\nsmall to report and it won't take it.\n\nMy taxes has been filed. What can I do now?\n\nThanks!\n\nEdit: Hahaha, you guys are…",
  "data/reddit-stocks/r/Bogleheads/comments/u5l3zt/is_only_buying_etfs_like_vti_to_retire_off_it.json": "Hi, I'm a beginner and do not know much about economics in general so I please\nbear with me.\n\n•But is the strategy to put all your earnings into an ETF like the VTI or VOO\nand live off of it risky?\n\n•What is the guarantee that the price only keeps increasing and also generates\nenough returns for me…",
  "data/reddit-stocks/r/investing/comments/u57akr/ytd_top_25_stocks_sp_500_take_a_look_and_see_how.json": "Here are the top 25 stocks in the S&P 500 year to date. Take a look at the\nsectors and first figure out how much you have invested in these sectors and\ncompare your returns YTD to these. None of these moves are a surprise as most\nprognosticators outside of Cathy Woods were telling us this is where…",
  "data/reddit-stocks/r/wallstreetbets/comments/u5peqf/remember_when_robinhood_told_everyone_no_social.json": "Well, that was a lie. Today I was notified by my bank that my social security\nnumber along with information I’ve only provided to Robinhood is being spread\nacross the web.\n\nCheers, and happy Easter.\n\nLink for those who weren’t aware of the security…",
  "data/reddit-stocks/r/Bogleheads/comments/u5kehu/401k_vs_taxable.json": "I don't get any employer match, so I am considering the advantages of a taxable\naccount over contributing to my 401k. I understand the benefits of 401k being\npre-tax dollars, so I can invest more by sacrificing less today. However, on\nretirement, 100% of withdrawals are taxed as income. On the…",
  "data/reddit-stocks/r/investing/comments/u5r59s/i_started_investing_with_little_money.json": "Hey everyone i have a question. so i started investing with little money. I put\nmy first 500$ in vanguard etf. I intend to put like 50 every month. Im 25 and i\nhave a long term plan to do it for like 15-20 years or something. Do you think\nits worth it. I think the amount is really small but thats…",
  "data/reddit-stocks/r/stocks/comments/u5ni84/japanese_stocks.json": "Does anyone have any explanation on why Japanese stocks have such low P/E Ratios\n(of the popular, most are under 15 and almost all are under 20)? I know this is\nnot the only indicator of fair price evaluation but it seems that the American\nstocks are all overpriced for multiple reasons more than…",
  "data/reddit-stocks/r/stocks/comments/u5qogm/is_intel_really_a_good_long_term_investment_right.json": "Its yield, p/e, p/s and PEG ratios are all great and it’s growth is solid. I’ve\nalso read their annual report and they seem to have a rigid plan. However, it’s\nrecent drop in its EPS and income on top of its heavy selling from its insiders\nis really worrying for me. All in all, I am a novice so…",
  "data/reddit-stocks/r/stocks/comments/u5t4km/i_panick_sold_all_my_stocks_before_the_war.json": "feb 23rd hours before the invasion (when i heard it was the largest military\nbuild up in europe since ww2) i panick sold ALL My stocks.... stocks that i had\nheld for over 10 years.. i dumped everything and i felt like i did the right\nthing but then stocks went back up and i was kicking myself for…",
  "data/reddit-stocks/r/investing/comments/u5tkb4/is_it_reasonable_to_expect_sp_500_etf_return.json": "I know that Michael Burry, who predicted the 2008 recession, has said that he\nthinks it is a \"dangerous bubble\" and that he is expecting an \"epic crash.\"\n\nDo you agree? Moreover, is it reasonable to expect S&P 500 ETF return rates to\ncontinue averaging ~10.5% in the future?",
  "data/reddit-stocks/r/stocks/comments/u5ql81/fertilizers_are_still_cheap_ntr_mos_and_cf_with.json": "The fertilizer industry has been unattractive since 2013 when the Belarusian\nPotash cartel broke apart\n[https://www.reuters.com/article/us-russia-uralkali/potash-sector-rocked-as-russias-uralkali-quits-cartel-idUSBRE96T0S220130730].\nBack in 2006-2012, investors used to gush over fertilizer…",
  "data/reddit-stocks/r/Bogleheads/comments/u5s1hj/whats_the_problem_of_having_your_entire_net_worth.json": "I have an emergency fund and am renter looking to keep things in life simple and\nretire early.",
  "data/reddit-stocks/r/stocks/comments/u5vl5n/where_to_make_a_40year_investment.json": "Good evening, I'm an European, more specifically Portuguese, and I'm considering\nmaking a 10.000$ Investment (90%VOO and 10%QQQ[accepting suggestions in regards\nto the portfolio, I'm relatively to the world of investment]) with DCA every\nmonth (the value of those monthly contributions will be 100%…",
  "data/reddit-stocks/r/stocks/comments/u5sbq0/amds_latest_acquisitions.json": "So, it is just me or Lisa sue is actually building an empire. Buying xilianx and\nthen pensando. Entered in CPU market and then GPU and now finally DPU. I mean\nshe is the only CEO I can trust the most. Whats your thoughts on her aggressive\napproach with all these massive acquisitions.",
  "data/reddit-stocks/r/wallstreetbets/comments/u5puy0/uncle_same_says_i_own_him_70k_in_taxes_on_my.json": "So yeah, basically that. I made some pretty gains last year and forgot to set\naside some dough for the greedy Sam. I gotta pay 70k tomorrow or I'll be in\nshambles. Need a good 0DTE play for the remaining 4k so I can pay off my taxes\nand have some dollars left to buy ramen!!",
  "data/reddit-stocks/r/stocks/comments/u62jcy/elon_musks_tweets_about_taking_tesla_private_in.json": "https://www.cnbc.com/2022/04/16/elon-musk-funding-secured-tweets-ruled-false-new-court-filing-suggests.html\n\nIn a court filing out late Friday, shareholders who are suing Tesla and CEO Elon\nMusk over alleged securities fraud said they won part of a critical ruling in\ntheir class-action lawsuit. The…",
  "data/reddit-stocks/r/stocks/comments/u5ujf3/wsj_shipping_stocks_will_sink_as_us_consumers.json": "I posted a similar thread\n[https://www.reddit.com/r/stocks/comments/tz6r47/container_shipping_rates_are_going_mad_again_read/]\n9 days ago, and there was much pushback in the comments to the article. Paging\n/u/namjd72 and /u/Easy7777 as you both seemed 'in the know.' That article was\nall about spot…",
  "data/reddit-stocks/r/stocks/comments/u5yas3/i_put_together_a_list_of_the_top_10_publicly.json": "Since the beginning of this year, the CPI has risen month by month, inflation\nhas gradually risen, and the Nasdaq has also fallen sharply.\n\nI compiled a list of the top eight listed companies in the US semiconductor\nfield, including: INTC, MU, QCOM, NVDA, AVGO, TXN, AMD, ADI, KLAC, LRCX.…",
  "data/reddit-stocks/r/stocks/comments/u5yed9/tesla_amazon_or_google.json": "Came across a spare $3600 cash.\n\nConsidering grabbing ~3.5shares of Tesla tomorrow at open before their earnings\non the 20th.\n\nI also have some Amazon and Google. Considering maybe I say screw Tesla and grab\nmore of one of those two companies pre split. Wouldn’t be a bad thing to wake up\nwith 40…",
  "data/reddit-stocks/r/investing/comments/u60cpp/bond_rout_promises_more_pain_for_investors.json": "https://www.wsj.com/articles/bond-rout-promises-more-pain-for-investors-11650122040?mod=hp_lead_pos3\n\nThe worst bond rout in decades shows few signs of abating, threatening further\npain for both investors and borrowers.\n\nRising Treasury yields are in many ways a reflection of a robust economy. A…",
  "data/reddit-stocks/r/investing/comments/u5y549/investments_that_cash_flow_that_arent_real_estate.json": "Basically the title.\n\nWhat kind of investments are out there that generate consistent income that\ndon't involve the purchase, maintenance and upkeep of real estate?\n\nI.e. You invest in it, it generates money on a monthly/quarterly/time goes here\nbasis if you play your cards right, and generally…",
  "data/reddit-stocks/r/Bogleheads/comments/u6b3b8/converting_all_accounts_to_vtwax.json": "I own 4 accounts at Vangard with 100% VTSAX in each. I’m 35 and wife is 27, so\nkeeping it stocks for now.\n\nThe 4 accounts are joint brokerage with wife, my IRA, wife’s IRA, and wife’s\nbrokerage. I’d like to get rid of wife’s brokerage and roll into joint brokerage\nwhile I’m at this.\n\nI also have a…",
  "data/reddit-stocks/r/stocks/comments/u6bmnf/is_it_difficult_for_the_us_economy_to_make_a_soft.json": "Historically, the gap between jobs and the labor force has narrowed\nsignificantly only during recessions, and as a result, Goldman Sachs believes\nthe Fed's economic soft landing is \"on a tough road.\"\n\nHigh-fever inflation in the U.S. is putting increasing pressure on the Fed, and\nGoldman Sachs sees…",
  "data/reddit-stocks/r/stocks/comments/u638w1/use_an_oculus_quest_2_or_meta_quest_2_before_you.json": "Try First Steps with the Meta Quest 2, then spend 40 hours watching different\ncontent, using a variety of different applications, etc. after you’ve done so,\nif you still think it’s stupid, then touché, you’re allowed to say that VR is\nstupid and has no staying power in the future of global society.…",
  "data/reddit-stocks/r/investing/comments/u6eido/can_someone_in_plain_english_explain_the_change.json": "Full email:\n\n“An update on over-the-counter securities\n\nDear Vanguard Client,\n\nBeginning April 28, 2022, Vanguard will no longer accept purchases and transfers\nin of most over-the-counter (OTC) securities. This change allows us to better\nsupport a targeted, enduring suite of products and services…",
  "data/reddit-stocks/r/Bogleheads/comments/u6evyd/recent_losses.json": "Hi guys and gals, I dumped a good bit of money into VTSAX and VTIAX a few months\nago and have lost over 10% on both since. I know this is just how it is and the\nmarket will keep ebb and flowing with net positive growth over a long enough\nperiod of time, but does anyone have any encouraging words or…",
  "data/reddit-stocks/r/stocks/comments/u6azox/bank_of_america_beats_eps_expectations_by_056.json": "\"Bank of America press release (NYSE:BAC): Q1 GAAP EPS of $0.80 beats by $0.05.\n\nRevenue of $23.2B (+1.7% Y/Y) beats by $110M.\n\nProvision for credit losses of $30 million increased $1.9 billion\n\nAverage deposits up $240 billion, or 13%, to $2.0 trillion\n\nAverage Global Liquidity Sources rose $106…",
  "data/reddit-stocks/r/wallstreetbets/comments/u67g3z/jack_dorsey_rips_twitters_board_says_it_has.json": "https://finance.yahoo.com/news/jack-dorsey-rips-twitter-board-225516616.html\n\n\n\n'Twitter cofounder and short-time board member Jack Dorsey called out his social\nmedia platform's board on Saturday, saying \"it's consistently been the\ndysfunction of the company.\"\n\n\"If [sic] look into the history of…",
  "data/reddit-stocks/r/stocks/comments/u6921p/rstocks_daily_discussion_monday_apr_18_2022.json": "These daily discussions run from Monday to Friday including during our themed\nposts.\n\nSome helpful links:\n\n * Finviz [https://finviz.com/quote.ashx?t=spy] for charts, fundamentals, and\n   aggregated news on individual stocks\n * Bloomberg market news [https://www.bloomberg.com/markets]\n *…",
  "data/reddit-stocks/r/stocks/comments/u6d7zp/what_are_some_of_the_best_index_funds_with_the.json": "Just recently got into buying stocks, but I've been told by a lot of people\nindex funds are the way to go when investing. Just wondering what you guys think\nare the best ones to invest in. And what's the best trading app do you\nrecommend.",
  "data/reddit-stocks/r/stocks/comments/u6ma0f/if_the_twitter_board_of_directors_have_a.json": "Given that Goldman Sachs is advising the Twitter board on how to go about the\nbid from Elon Musk has a Sell rating with a price of $30/share, and Elon is\noffering way more, why are they suddenly backtracking and implementing a poison\npill?\n\nI don't really care if Elon buys the company or not, but…",
  "data/reddit-stocks/r/investing/comments/u6k3de/am_i_in_an_echo_chamber_or_are_index_funds_really.json": "I'm nearing 30 and have recently started looking doing more with my savings than\njust a HYSA. I found r/personalfinance [/r/personalfinance] and r/Bogleheads\n[/r/Bogleheads] about 6 months ago and have been following their advice pretty\nclosely (setting up a Roth IRA and investing in a 3-fund…",
  "data/reddit-stocks/r/investing/comments/u6milx/new_us_gov_ibond_interest_rates_for_april_2022_962.json": "don't know if this was already noted somewhere but this is a nice inflation\nhedge: looks like US Gov I-Bond interest rates will jump from a healthy 7.12% to\na very nice 9.62% this month, for at least the next 6 months.\nhttps://keilfp.com/blogpodcast/i-bond-rate-november-2021-to-april-2022/",
  "data/reddit-stocks/r/Bogleheads/comments/u6n4a6/officially_in_the_market_first_purchase_3000_vfiax.json": "Hey everyone, thank y’all for the advice over the last couple days. I was stuck\nbetween mutual fund vs etf and whether or not to go total market or S&P 500. I\ndecided to go mutual fund and with the S&P 500. I know the majority of y’all\nrecommend VTSAX. But everything I’ve learned show they are…",
  "data/reddit-stocks/r/Bogleheads/comments/u6faix/are_ibonds_good_to_buy_and_hold_long_term.json": "I’m in my wealth accumulation years (37 years old) and my portfolio is currently\n100% stock market index funds. I’m planning to start getting into bonds at some\npoint.\n\nIs it a good strategy to buy and hold I-bonds long term as a means of wealth\npreservation and to hedge against inflation and stock…",
  "data/reddit-stocks/r/Bogleheads/comments/u6lufw/twentytwo_mental_mistakes_in_investing_identified.json": "For additional insight into why Clements selected these 22 mental pitfalls, his\nsection on this was influenced by this publication.\n[https://www.wiley.com/en-us/Behavioral+Finance+and+Wealth+Management%3A+How+to+Build+Investment+Strategies+That+Account+for+Investor+Biases%2C+2nd+Edition-p…",
  "data/reddit-stocks/r/stocks/comments/u6f7b3/what_are_the_best_dividend_stocks_right_now.json": "I'm looking to increase my stake in dividend stocks, i hold a couple of stocks,\nbut they all seem high right now, so what stocks do you recomend?\n\nI'm 19 and i plan to hold for years.\n\nI invest $130 every month, and have been for over a year.\n\nMy portfolio as today: (in %)\n\nXOM 19.33% MSFT 13.39%…",
  "data/reddit-stocks/r/investing/comments/u6m6bj/hot_economy_rising_inflation_the_fed_has_never.json": "https://www.wsj.com/articles/inflation-jobs-fed-recession-economy-11650294297?mod=hp_lead_pos9\n\nThe Federal Reserve is setting out to do something it has never accomplished\nbefore: reduce inflation a lot without significantly raising unemployment.\n\nCentral bank officials think it is possible with…",
  "data/reddit-stocks/r/stocks/comments/u6m7o0/hot_economy_rising_inflation_the_fed_has_never.json": "https://www.wsj.com/articles/inflation-jobs-fed-recession-economy-11650294297?mod=hp_lead_pos9\n\nThe Federal Reserve is setting out to do something it has never accomplished\nbefore: reduce inflation a lot without significantly raising unemployment.\n\nCentral bank officials think it is possible with…",
  "data/reddit-stocks/r/wallstreetbets/comments/u6s2ma/you_all_are_smart_enought_to_know_these_are_fake.json": "TLDR : Be retaded but don't be fully stupid.\n\nMods, please do a better job at recognizing fake DD's and that it's a red flag\nif a DD (outside of u/deepfuckingvalue [/u/deepfuckingvalue]) get's 10+ awards\nin the first 5 mins of posting with no upvotes. Seriously...\n\nFirst up, WEBR!!! What doesn't…",
  "data/reddit-stocks/r/stocks/comments/u6poha/feds_bullard_says_75_basispoint_hike_could_be.json": "https://www.bloomberg.com/news/articles/2022-04-18/fed-s-bullard-says-75-basis-point-hike-could-be-option-if-needed\n\nFederal Reserve Bank of St. Louis President James Bullard said the central bank\nneeds to move quickly to raise interest rates to around 3.5% this year with\nmultiple half-point hikes…",
  "data/reddit-stocks/r/Bogleheads/comments/u6tg7h/what_would_be_the_most_aggressive_lazy_portfolio.json": "I recently surpassed my first 100k and would like to be more aggressive with an\nindex fund such as VUG or VTV. Barring any unforeseen circumstances I am willing\nto hold 30+ years as well as contributing 6k each year\n\nI also have my vanguard 2055 target Fund VFFVX getting just shy of $1500 a…",
  "data/reddit-stocks/r/wallstreetbets/comments/u6pp8i/i_still_dont_understand_how_gme_doesnt_defy_the.json": "POST TOO LONG, HERE IS TLDR:\n\nEfficient market hypothesis sucks balls because GME is being traded around it's\nSI rather than it's performance. Overall market go poo poo if theory is true\nonce dividends populate. You go homeless. I go homeless. Death from starvation.\n\n\n\n\n\nGameStop's share price is…",
  "data/reddit-stocks/r/stocks/comments/u6o8ti/jim_cramers_0414_mad_money_stock_recommendations.json": "These are Jim Cramers recommendations from his 04/14 Mad Money Show\n\nCompany Ticker Symbol Recommendation Stock Price 1-800-Flowers (FLWS) FLWS buy\n$13.40 AT&T (T) T sell $19.54 American Express (AXP) AXP buy $181.16 Bank of\nAmerica (BAC) BAC buy $37.57 Carmax (KMX) KMX negative $91.79 Clearfield…",
  "data/reddit-stocks/r/Bogleheads/comments/u72j5s/what_is_the_vti_or_vt_equivalent_option_for.json": "Which ETFs or Mutual Funds should be in the list of top choices for an Indian\nresident to consider for passive investing?",
  "data/reddit-stocks/r/stocks/comments/u76mm3/why_do_we_just_accept_the_irs_tax_laws.json": "Unlimited tax gains for them on the way up and only 3000 a year on losses.\nReddit has a large group of people, surely lobbying politicians would at least\nraise the issue. Paid lobbying? At least let people write off if they made money\npreviously and then lost it. No reason to just accept things as…",
  "data/reddit-stocks/r/wallstreetbets/comments/u74ugb/1_dollar_invested_3_million_dollars_saved.json": "Listen up degenerates. I see you yoloing your money on Tesla and AMD\n\nBut I’m about to give you the best investment of all time.\n\nA 1 dollar condom.\n\nSo… it costs 233 000 dollars to raise a child.\nInstead of raising a kid you put that into the qqq and make 7% per year\n\nInvest for decades and that…",
  "data/reddit-stocks/r/Bogleheads/comments/u73ty9/closest_approximation_to_a_total_market_stock_fund.json": "I’m looking at a potential employer’s list of funds in their 401k offerings.\n\nThere’s no total market (or SnP 500) index funds at all. It’s mostly bond funds,\na few exUS funds, and a long list of TDFs.\n\nIf I want the closest in this list to a total market stock fund, would TDF2060\n(the furthest out…",
  "data/reddit-stocks/r/Bogleheads/comments/u78683/to_all_new_investors_a_reflection_on_current.json": "I have seen several posts over the past few weeks wondering if now is a good\ntime to invest due to \"current events\" (war in Ukraine, rising interest rates,\netc). Here is some reflection on these events:\n\nIs it a good time to invest? Yes it is always a good time to invest. As has been\nproven over…",
  "data/reddit-stocks/r/Bogleheads/comments/u77atr/vanguard_to_end_support_for_grayscale_bitcoin_and.json": "https://cryptobriefing.com/vanguard-to-end-support-for-grayscale-bitcoin-and-ethereum-products/",
  "data/reddit-stocks/r/stocks/comments/u7b8xn/putin_signs_decree_to_remove_russian_stocks_from.json": "Putin signed a new decree on April 16 that requires Russian companies to remove\ntheir listings from overseas exchanges.\n\nNow, billionaires won't be able to collect foreign-currency dividends from\ndepository receipt programs.\n\nThe decree also means foreign holders of the canceled receipts must…",
  "data/reddit-stocks/r/stocks/comments/u7e8x7/netflix_nflx_reported_an_unexpected_decline_in.json": "Revenue: $7.87 billion vs. $7.95 billion expected, $7.16 billion Y/Y\n\nEarnings per share: $3.53 vs. $2.91 expected, $3.75 Y/Y\n\nNet subscribers: -200,000 vs. +2.51 million expected, +3.98 million million Y/Y\n\nDown 20% in pre-market\n\nhttps://finance.yahoo.com/news/netflix-earnings-preview-q1-2022…",
  "data/reddit-stocks/r/stocks/comments/u758te/if_i_buy_bbb_rated_5yr_corp_bonds_5_now_and_hold.json": "Dumb question but I see so much stuff going on in the bonds market that I wonder\nthe risks wit inflation, rates, and overall plan to hold bonds the whole way\nthrough instead of selling. And all that secondary market of buying and selling\n“used” bonds. Or just overall info about the bond market If…",
  "data/reddit-stocks/r/stocks/comments/u7ctm9/puts_on_nflx.json": "Given all the gloomy news recently : Russia, Rate hikes, inflation at all time\nhighs, I don't see this earnings report playing out well for NFLX.\n\nINFLATION is a particularly big headwind I think, cause when people have to cut\ncost, the 1st thing that they'll look at are the services that they can…",
  "data/reddit-stocks/r/stocks/comments/u712lg/rstocks_daily_discussion_technicals_tuesday_apr.json": "This is the daily discussion, so anything stocks related is fine, but the theme\nfor today is on technical analysis (TA), but if TA is not your thing then just\nignore the theme and/or post your arguments against TA…",
  "data/reddit-stocks/r/Bogleheads/comments/u7cnyz/ibond_interest_rate.json": "I want to make sure I understand how interest works on iBonds. If I buy now, I\nget 3.56% (7.12%/2) for the first 6 months and then in October, it will increase\nto 4.81% (9.62%/2) for the next 6 months? Then after that we’ll need to wait and\nsee what the rate will change to?\n\nFor the first 12…",
  "data/reddit-stocks/r/stocks/comments/u7a3t0/thoughts_on_netflix_nflx_earnings_today_after.json": "Netflix is going to kick off earnings for this week, which may result in more\nconviction or uncertainty in this market.\n\nConsidering its last earnings report dropped the stock about 30% overnight, it\nhas trended down about another 6% and has been relatively flat after their\nearnings came…",
  "data/reddit-stocks/r/investing/comments/u7dnu9/mcdonalds_as_inflation_hedge.json": "I am trying to hedge against inflation and thought McDonald's stock might be a\ngood idea. My reasoning behind this is: 1. In essence, they are a real estate\ncompany and generate much of their profits through leases to franchises 2. As a\nworldwide company, international revenue will protect against…",
  "data/reddit-stocks/r/stocks/comments/u7b81x/large_cap_stocks_like_dis_are_lower_than.json": "I'm really interested in getting a good entry, and stocks like $DIS is as almost\nas low as when the pandemic crash first started. Seems to be like this would be\na good time to start buying? Disney is a bluechip stock and has room to grow\nwith it's streaming service and acquisition of Marvel and…",
  "data/reddit-stocks/r/stocks/comments/u7hbm1/nflx_still_too_expensive_at_260.json": "Is there any objective case for the company to still be valued above $260, given\nhow the streaming landscape has changed?\n\nA lot of the networks have their own platforms now and there isn’t any genre\n(maybe kdrama?) that I think they could get into that could eat other market\nshare\n\nAnime -…",
  "data/reddit-stocks/r/wallstreetbets/comments/u718ue/calling_on_uinternal_ad_1091_to_post_your.json": "SAVA is down another 20% this morning and down more than 60% from\nu/Internal_Ad_1091 [/u/Internal_Ad_1091] ‘s cost basis. It’s only fitting for\n“The largest bet in WSB history” to also be the largest loss porn in WSB history",
  "data/reddit-stocks/r/Bogleheads/comments/u7pnno/lumpsum_vs_dollarcost_averaging_i_invested_92000.json": "Today I invested $92000, a gift from my parents. I purchased small-cap value\nETFs: 70% US and 30% international.\n\nI equally distributed the US portion between AVUV, DFSV, and VIOV and the\ninternational portion between AVDV, DISV, and ISVL.\n\nIt will be interesting to see my portfolio in 30 years.",
  "data/reddit-stocks/r/Bogleheads/comments/u7lch6/portfolio_for_510_year_time_horizon.json": "Any advice for a portfolio for a taxable account with a 5-10 year time horizon?\nThis is 100% a “fun” pot of money used for upgrading vehicles, hobbies,\nvacations, etc. I guess the point is I want to maximize my extra spending money,\nfully aware that the market could tank and I might have to hold…",
  "data/reddit-stocks/r/stocks/comments/u7q9c6/please_dont_be_fooled_by_netflix_pe_number.json": "Saw a lot of posts referencing Netflix p/e in the mid twenties and how it can't\ngo much lower... \"It's already lower than Coca Cola great value play\"...\n\nBe careful basing your investments off of a P/E number. Netflix is a tricky\ncompany to evaluate the way they amortize their content. Netflix has…",
  "data/reddit-stocks/r/stocks/comments/u7gfwb/why_are_people_so_confident_in_megacap_stocks.json": "It's interesting how people think that the big companies of today will be the\nbig companies tomorrow, even though history has shown time and time again that\neven the biggest hitters can and do fall. I understand investing in them in the\nshort-medium term, but putting all of your eggs in the current…",
  "data/reddit-stocks/r/stocks/comments/u7kpao/everyones_going_on_about_nflx_afterhours_when_dis.json": "Man oh man what a day for streaming!\n\nBesides what happened to Netflix, has anyone noticed what happened to Disney\ntoday? It was a beautiful day of rebounding until AH took away all gains and\nthen some. I understand that sentiment has gone down for Disney due to their\ninvolvement with the Dont Say…",
  "data/reddit-stocks/r/stocks/comments/u7w8nr/anyone_else_think_29_on_nflx_is_a_bit_overdone.json": "I understand the bad earnings report and lowered guidance, but the stock was\nalready ~50% off of 2021 highs. To me, a 29% drop overnight is a completely\nemotional overreaction. Netflix is still a powerful brand, with large resources,\nand a dominant player in streaming/content creation.\n\nAnyone else…",
  "data/reddit-stocks/r/stocks/comments/u7ku29/faang_earnings_what_do_you_expect.json": "All the remaining FAANG companies will report their earnings next week...\n\nFacebook (aka Meta) April 27\n\nApple April 28\n\nAmazon April 28\n\nNetflix(already happened)\n\nGoogle April 26\n\n(also MSFT will report April 26)\n\n...what do you expect will happen? bull, bear? Upvote the comments that…",
  "data/reddit-stocks/r/stocks/comments/u7wgph/florida_governor_says_the_state_may_get_involved.json": "something I came across\n\noriginal post\n[https://www.reddit.com/r/wallstreetbets/comments/u7btfc/florida_governor_says_the_state_may_get_involved/]\n\nFlorida Governor DeSantis, during a Tuesday press conference for the signing of\na bill designed to improve accountability for higher education in the…",
  "data/reddit-stocks/r/wallstreetbets/comments/u7s47b/g_m_e_morally_and_ethically_this_must_be_shared.json": "💲 G M E Technicals indicate a return of the market price above the historical\nsupport\n[https://preview.redd.it/fus9cwrhenu81.png?width=949&format=png&auto=webp&s=a3fe5e020967f10b2214116236aaf4972632c24e]\n\n\n\n💲 G M E Technicals also indicate a notable return of volume, Bottoming-Out of\nRSI, a…",
  "data/reddit-stocks/r/investing/comments/u7zf3i/streaming_reset_when_does_it_hit_bottom_netflix.json": "Seems like we are in a very volatile situation with the Netflix reset. Will the\ncontagion from Netflix bring the other streaming services down more?\nIt seems to me that Disney may be at rock-bottom. But then again it keeps going\nlower. Any thoughts regarding a good time to look at buying some…",
  "data/reddit-stocks/r/stocks/comments/u7xqd8/netflix_just_plummed_almost_40_38_for_disastrous.json": "Netflix shocked the market with another disastrous quarter and having the first\nquarterly subscriber lost in a decade sure didn't help.\n\nSeems like Disney or WBD or Amazon could be gaining terrain and Netflix was\ntrading at premium compared to this other stocks when it's no longer the only\nknow…",
  "data/reddit-stocks/r/stocks/comments/u7x44b/netflix_has_plans_to_add_commercials_for_some.json": "https://deadline.com/2022/04/netflix-advertising-streaming-reed-hastings-1235006083/\n\nNetflix co-CEO Reed Hastings finally acknowledged what most people outside of\nthe company have been saying for years: In order to keep growing, the company\nwill need to incorporate ads. The executive offered his…",
  "data/reddit-stocks/r/Bogleheads/comments/u7dets/i_just_bought_more_bonds_today_and_feel_great.json": "I had extra cash (from work, not 'dry powder' or any kind of market-timing\nnonsense) and checked my allocation, determined that to stay on target it should\ngo to bonds instead of stocks. It felt frankly good too, because rates are\nhigher now than they've been for most of the last decade. Fund NAV…",
  "data/reddit-stocks/r/stocks/comments/u85bac/tesla_earnings_beat_expectations.json": "https://www.cnbc.com/2022/04/20/tesla-tsla-earnings-q1-2022.html\n\n\n\nTesla [https://www.cnbc.com/quotes/TSLA] reported earnings after the bell. Here\nare the results.\n\n * Earnings per share: $3.22 vs $2.26 expected\n * Revenue: $18.76 billion vs $17.80 billion expected\n   \n\nstock up 5% afterhours",
  "data/reddit-stocks/r/stocks/comments/u7su2v/asml_q1_earnings_slightly_beats.json": "ASML reports sales of 3.5bn euros on the upper end of guidance.\n\nASML forecasts Q2 sales of 5.1-5.3bn euros and 20% revenue growth for the full\nyear.\n\nASML stock up over 6% on the Amsterdam exchange\n\nDisclaimer: held\n\nThe semiconductor sector has been hit hard to a sell-off this year due…",
  "data/reddit-stocks/r/stocks/comments/u89ewn/bill_ackmans_pershing_square_has_exited_the.json": "https://pershingsquareholdings.com/pershing-square-holdings-ltd-releases-letter-to-shareholders/\n\nIn a letter to shareholders, Bill Ackman reveals that he has sold the entirety\nof his fund's investment in Netflix that he made in January, saying \"changes in\nthe company’s future subscriber growth can…",
  "data/reddit-stocks/r/stocks/comments/u7xbpd/why_is_paypal_share_price_crashing_right_now.json": "Any idea why PayPal share price fell from $102 to $96 all of a sudden just now?\n\nI can't find any news that would explain it?\n\nWondering about \"buying the dip\", unless this turns out to be \"the start of a\nlandslide\" based on some news I can't find.",
  "data/reddit-stocks/r/stocks/comments/u84ca2/so_many_cheap_stocks_just_getting_crashed.json": "Why is that? Facebook, PayPal, Pinterest, Wix, Google and so many more just\ngoing down NONSTOP. Does it really make sense to you that companies like LOW,\nHD, KO and so on have higher P/E ratio than the stocks I mentioned? What is\ngoing with high growth stocks?\n\nI understand that there are many…",
  "data/reddit-stocks/r/Bogleheads/comments/u7zopr/cash.json": "My CD just renewed for 0.80% 😕 I’ve already maxed out I-bonds. Where are you\nguys keeping your “emergency funds”?",
  "data/reddit-stocks/r/stocks/comments/u8a4uj/not_sure_if_anyone_knows_this_netflix_is_known.json": "I have a friend that’s a tech recruiter. For big tech, Netflix pays double the\ngoing rate for computer programmers in Silicon Valley. They have a crazy culture\ndeck and fire programmers incredibly quickly if not up to par (with the best\nseverance package in America).\n\nI say this because there’s a…",
  "data/reddit-stocks/r/wallstreetbets/comments/u8745q/state_of_california_lost_approximately_685m_on.json": "The California Public Employees Retirement System, are like us, loaded up on\ntech stocks unhedged in their pension fund, knowing they could very well fall\ndrastically…",
  "data/reddit-stocks/r/stocks/comments/u8c4bn/what_is_up_with_paypal.json": "I can't seem to find a reason why paypal is dying harder than expected. I get\nthat it needs to return to pre pandemic but not 2015 levels! I'm selling all my\npapyal I bought at 105 and waiting till after the earnings. Hell i'm almost\ntempted to buy some paypal puts for the 22nd.\n\nWhat do you think…",
  "data/reddit-stocks/r/investing/comments/u88ij2/what_was_it_like_being_invested_through_the_great.json": "What did the markets do, what did you do? Did stop losses even matter, did the\nprices plummet after hours? Did it change how you invest? I only have two\nanecdotes. I know a guy who lost his daughter's college/future fund. It was\naround 100k. He was devastated and said he'd never invest again. Then…",
  "data/reddit-stocks/r/stocks/comments/u8c9rq/can_someone_explain_why_costco_is_trading_at_48x.json": "Is the market just going crazy right now and anything with a “value” bend is\nbeing bought up and anything with a “growth” bend is being sold off?\n\nCostco is trading at over TWICE the P/E of Alphabet, 1.5x the P/E of AMD, and\nclose to the P/E of NVDA. These are all companies with literally 10x the…",
  "data/reddit-stocks/r/stocks/comments/u8fb6r/tech_stocks_are_absurdly_cheap_now_putting_my.json": "Buckle in.\n\nInvesting isn't easy, and yet people are--and always will--try to act like it\nis. Just like every other period in stock market history, retail 'investors' are\nbeing lazy and emotional and valuing businesses based off the direction their\nprices are heading rather than long term…",
  "data/reddit-stocks/r/Bogleheads/comments/u84f5d/should_i_buy_ibond_today_or_wait_for_1_may_2022.json": "Hi,\n\nI am going to buy I-Bond. The interest rate will increase on May 1. Should I buy\nIbond today or on May 1 ?",
  "data/reddit-stocks/r/Bogleheads/comments/u8fdpg/what_to_do_when_401k_expense_ratios_are_high_but.json": "Im sure many people have this problem but what do Bogleheads do to limit fees\nwhen they don’t control the index funds they have access to? I feel very limited\nin my choices.",
  "data/reddit-stocks/r/stocks/comments/u8k7ge/what_will_we_rename_faang_stocks_as.json": "so seeing as how facebook and netflix have both shat the bed, it's no longer all\nabout the \"FAANG\" stocks, all we have left are the \"AAG\" stocks, but that sounds\nsilly, so let us discuss:\n\nwhat stocks will replace F and N as the new top dogs and what will the new\nacronym be?",
  "data/reddit-stocks/r/stocks/comments/u8kyg2/nobody_is_talking_about_amazons_press_release.json": "https://press.aboutamazon.com/news-releases/news-release-details/amazon-unveils-buy-prime-expanding-prime-shopping-benefits\n\nToday, Amazon announced Buy with Prime—a new benefit for Prime members that will\nextend the convenience of Prime shopping to online stores beyond Amazon.com. Buy\nwith Prime…",
  "data/reddit-stocks/r/stocks/comments/u8lk0p/reportedly_elon_musks_pay_rises_by_23_billion.json": "With Tesla's strong quarterly report on Wednesday, Chief Executive Elon Musk has\nscored a hat trick of performance goals worth a combined $23 billion in new\ncompensation.\n\nTesla reported quarterly revenue of $18.76 billion and so-called adjusted\nearnings before interest, taxes, depreciation and…",
  "data/reddit-stocks/r/stocks/comments/u8cfjp/teslas_new_quarter_revenue_of_18756_billion.json": "Tesla stock has been my largest position since I returned to the stock market,\nand I remain bullish on Tesla's future. Does today's earnings release herald a\nbig rally in Tesla's stock tomorrow?\n\nAccording to Tesla's financial report for the first quarter of fiscal 2022,\nwhich ended on March 31,…",
  "data/reddit-stocks/r/stocks/comments/u8swoq/elon_musk_secures_funding_for_twitter_takeover.json": "Looks like he's all in..\n\nWhat will Twitter board do now? They can still accept his offer or make a\ncounter offer.\n\nSources:\n\nhttps://arstechnica.com/tech-policy/2022/04/elon-musk-still-wants-twitter-and-he-now-has-46-5-billion-in-financing/\n\nhttps://www.theverge.com/2022/4/21/23033445/elon-musk…",
  "data/reddit-stocks/r/stocks/comments/u8jla3/rstocks_daily_discussion_options_trading_thursday.json": "This is the daily discussion, so anything stocks related is fine, but the theme\nfor today is on stock options, but if options aren't your thing then just ignore\nthe theme and/or post your arguments against options…",
  "data/reddit-stocks/r/stocks/comments/u8ka1h/on_teslas_valuation_part_deux.json": "Five months ago I made this post\n[https://www.reddit.com/r/stocks/comments/qj07jj/on_teslas_valuation/], breaking\ndown Tesla's hotly debated valuation to determine whether it's really as cheap\nas Tesla bulls say, or as expensive as most of the rest of the sub thinks it is.\n\nAfter yesterday's…",
  "data/reddit-stocks/r/stocks/comments/u8u374/shop_is_now_trading_10_below_its_prepandemic.json": "I guess I just find this hard to believe. We all understand that rates put\npressure on long-duration assets, but SHOP's revenues have tripled since COVID\nand is still projecting strong double digit growth going forward. This is a huge\namount of repricing when you consider a lot of blue chip stocks…",
  "data/reddit-stocks/r/stocks/comments/u8tfyp/if_this_change_allowing_pot_shop_banking_happens.json": "Senator Murray from WA thinks she has found a sound path to allowing cannabis\nstores to participate in traditional banking and process electronic payments,\nfor states that have legalized marijuana. You can read the details in this\narticle\n[https://www.thestranger.com/slog/2022/04/20/71280602/sen…",
  "data/reddit-stocks/r/stocks/comments/u8y9tf/florida_house_passes_bill_to_dissolve_disneys.json": "> The Florida House passed a bill Thursday to eliminate the special district\n> [https://www.nbcnews.com/politics/politics-news/florida-gov-ron-desantis-asks-legislature-consider-eliminating-disneys-rcna25012] that\n> allows the Walt Disney Co. to self-govern its Orlando-area theme park, sending\n>…",
  "data/reddit-stocks/r/wallstreetbets/comments/u8wx25/petition_to_make_upvotes_tits_up_and_downvotes.json": "Mods please make new buttons I don’t like these boring boomer meta buttons\npersonally.\n\nObviously the problem here is that going tits up is bad so maybe this is a bad\nidea I don’t know or maybe it’s good because it’s like a nesting doll with the\nhidden meaning showing that the idea may be upvoted…",
  "data/reddit-stocks/r/Bogleheads/comments/u8gk6k/mega_backdoor_roth_or_10_off_faang_company_stock.json": "I currently have the choice of either investing in my company’s mega Backdoor\nRoth 401k or purchasing my company’s stock at a 10% discount (in a taxable\naccount). There are tax implications of the 10%, so more like 7% off or so.\n\nHaving the choice of one or the other, which would you invest in and…",
  "data/reddit-stocks/r/stocks/comments/u8x2dz/what_great_company_do_you_think_is_the_most.json": "There are many great companies but the stock may be overvalued, and there are\nalso many undervalued companies that may not be so great. Is there any great\ncompany that you've seen that seems to be severely undervalued?",
  "data/reddit-stocks/r/stocks/comments/u8or9g/is_intel_a_steal_for_longterm.json": "$Intc of course has been beaten up with Amds latest chips market share for their\npc chips but ive recently watched a video on how they are going to turnaround\nthe company yet again. Gelsinger the ceo has been with the company for a long\ntime. They are building more and more into america and plan to…",
  "data/reddit-stocks/r/stocks/comments/u8zx2l/cnn_streaming_service_shuts_down_only_one_month.json": "maybe cnn+ was shut down because they fear a shrinking customer base? netflix\nlost 200,000 customers and netflix is predicting to lose 2million more customers\nnext quarter. cnn parent company is warner brothers. kind of wierd they would\ndrop cnn+ all of a sudden. is this the fate of streaming…",
  "data/reddit-stocks/r/investing/comments/u8yz5m/meta_going_on_a_hiring_freeze.json": "Looks like Meta is going on a hiring freeze.\n\nAccording to users on Blind all interviews have been cancelled (I saw people\nsaying it's only for E3s and E4s, but some E5s (Sr eng) have also been reported\nto be canceled)\n\nhttps://us.teamblind.com/s/cHsKpcQC\n\nThis seems to very abrupt. Maybe it has to…",
  "data/reddit-stocks/r/wallstreetbets/comments/u8you9/do_i_hear_a_gme_stock_split_coming_on_june_3rd.json": "https://preview.redd.it/qgnuyw5zeyu81.png?width=1583&format=png&auto=webp&s=8eabc607b3208ec9ced1497d56c9379c9f3c93e9\n\nSEC Filing | Gamestop Corp. (gcs-web.com)\n[https://gamestop.gcs-web.com/node/19701/html]",
  "data/reddit-stocks/r/Bogleheads/comments/u905wf/the_simple_path_to_wealth.json": "I’m listening to this book now and it’s pretty good. What’s other opinions on\nit?",
  "data/reddit-stocks/r/Bogleheads/comments/u8xcci/how_much_percent_to_put_down_on_a_mortgage.json": "Just curious what the typical Boglehead approach is for downpayments.\n\nI understand that 20% is typical because of the extra fees associated with being\nbelow. I can probably afford ~30% down, and with mortgage rates at ~5%, I think\nit makes sense to only pay 20% and put the rest of my money into…",
  "data/reddit-stocks/r/investing/comments/u92olg/feds_powell_seals_expectations_of_halfpoint_rate.json": "https://www.wsj.com/articles/feds-powell-could-seal-expectations-of-half-point-rate-rise-in-may-11650533444?mod=hp_lead_pos1\n\nFederal Reserve officials have broadly signaled a desire to raise interest rates\nto levels that don’t provide stimulus\n\nFederal Reserve Chairman Jerome Powell signaled the…",
  "data/reddit-stocks/r/investing/comments/u8w2wa/is_meta_platforms_inc_fb_a_value_pick_or_value.json": "Despite earnings going from $23.5 Billion in June 2020 to $39 Billion in\nDecember 2021, the stock price has dropped by 18% in that time period and has\nhalved since September. I understand there are concerns around a slight decrease\nin users and the uncertainty of the metaverse, but it feels like…",
  "data/reddit-stocks/r/Bogleheads/comments/u998s3/rinvesting_2021_im_the_greatest_investor_of_all.json": "r/investing [/r/investing] 2022: Why is the market doing this? It makes no\nsense!!!\n\nAh, to be young again",
  "data/reddit-stocks/r/stocks/comments/u8wptp/sp_500_and_nasdaq_are_going_backwards_to_their.json": "S&P was around 3400 and Nasdaq was below 10000 before the pandemic started in\n2020. With all the stuff happening lately, do you think that is it possible to\nsee the indicies going back to their pre-pandrmic levels in a couple of months?\nHow likely do you think that is? I can totally see S&P going…",
  "data/reddit-stocks/r/stocks/comments/u9a132/cathie_woods_ark_funds_sell_nearly_100_million.json": "Cathie Wood's ARK Invest sold nearly $100 million worth of Tesla TSLA, +3.23%\nshares after the electric vehicle maker's well-received first-quarter results.\nThe flagship ARK Innovation ETF ARKK, -4.97% sold $70 million worth of Tesla\nstock. Tesla is still the top holding of the ARK Innovation ETF,…",
  "data/reddit-stocks/r/investing/comments/u9gnv1/is_there_any_investment_thats_safe_right_now.json": "With bonds getting slaughtered, and stocks continuing their slow bleed, is there\nanything safe right now? I always thought that common sense stated that bonds\nwere supposed to be the \"safer\" and less volatile investment, but it doesn't\nseem be the case any more.",
  "data/reddit-stocks/r/stocks/comments/u9fj4r/whats_a_bag_that_you_had_to_sell.json": "It’s tough out there. Everyone has one stock that they’ve more than likely had\nto cut bait on. What was the reason you took the L? Could be losing conviction\nin the stock itself or maybe other opportunities came to light that you liked\nbetter as many things have come down.",
  "data/reddit-stocks/r/stocks/comments/u9g0bq/which_stock_do_you_think_will_be_the_1st_to_reach.json": "My vote is for Google mostly because of their dominance in the public education\nmarket. There’s hundreds of millions of kids using Chromebooks for school today.\nKids around the world will have spent all of their K-12 experience in the Google\necosystem. Even more kids will migrate to Chromebooks, as…",
  "data/reddit-stocks/r/stocks/comments/u9ktez/i_cancelled_my_membership_with_motley_fool_today.json": "There's a quote from Warren Buffett in the preface to The Intelligent Investor.\n\"To invest successfully over a lifetime does not take a stratospheric IQ,\nunusual business insights, or inside information. What's needed is a sound\nintellectual framework and the ability to keep emotions from corroding…",
  "data/reddit-stocks/r/stocks/comments/u9kcoa/reddit_etf_progress_from_jan_2021_to_apr_2022.json": "So I just found a Reddit ETF post\n[https://www.reddit.com/r/stocks/comments/ku6skz/reddit_etf/] from the beginning\nof last year, near the period of peak euphoria. I felt like it was going to play\nout poorly so I bookmarked it and forgot about it until now. Here are the\nresults using the closing…",
  "data/reddit-stocks/r/stocks/comments/u9eonq/if_a_growth_company_such_as_goog_or_amzn_said.json": "How do you think that would play out? Considering how profitable they are\ncurrently and how much they can afford to pay out to shareholders, would you\nstay invested in a growth stock like this if they were done dumping their\nprofits into growing more rapidly and instead just wanted to pay…",
  "data/reddit-stocks/r/stocks/comments/u9l220/markets_are_oversold_right_now.json": "Ok, so yesterday I made a post about the indicies are heading towards their\npre-pandemic levels (i.e S&P500 below 3400, Nasdaq below 10000) and I still hold\nthis opinion that we're probably gonna see these levels in a couple of months.\nHowever I think the markets are oversold currently because…",
  "data/reddit-stocks/r/stocks/comments/u9kxee/all_us_indexes_drop_over_2.json": "the s&p, nasdaq 100, dow.. all falling 2% today.. just becuase fed chair powel\nmade some comments on thursday? but nothing he said was new, right? so is\nsomething else happening that we dont know about?\n\nand the vix up 24%\n\nsigns of a bear market? or just a dip?\n\nEarnings next week.. google, fb,…",
  "data/reddit-stocks/r/Bogleheads/comments/u9idak/buying_the_whole_haystack_instead_of_shares_in_a.json": "I work at a rapid growth tech company and have the opportunity to buy shares in\nit (at $60 dollars a share). Many employees are taking out $10k++ loans to buy\ncompany shares. I have chosen keeping investing in global index funds instead.\n\nWhat do you fellow Bogleheads think? Have any of you been in…",
  "data/reddit-stocks/r/stocks/comments/u9os4y/i_invested_75k_at_market_close_today_thoughts.json": "I spend 30k on tesla and 20k on SPY, and 25k on Apple at the end of the day\ntoday for a +1 year hold, how do you think i will do? Any changes? I feel like i\nshould have waited for some of their earnings next week but i saw this dip the\nlast couple days in the market and had to capitalize on it.\n\nI…",
  "data/reddit-stocks/r/stocks/comments/u9se6t/next_week_will_be_insanse.json": "Next week's earnings will make or break the market!\n\nNext week is one of the most important weeks all year in the market, with key\ncompanies having earnings which will make or break the market. It will show if\nthe market can handle .50 basis rate hike or not.\n\nCompanies with earnings include:\n\n *…",
  "data/reddit-stocks/r/stocks/comments/u9li0u/what_is_the_bear_case_for_google.json": "Google is currently off its high by 20% and i see no fundemtal change in why it\nshould be repriced. I see is a high margin company that is growing fast with 120\nbillion in cash and trading at record low P/E. Is the repricing all because of\nFUD surrounding interest rates hikes or something else…",
  "data/reddit-stocks/r/investing/comments/u9nqf5/what_copper_company_do_you_think_has_the.json": "I just noticed that Gold and silver cost 400 and 5 times more than copper,\nrespectively. The reasons can be largely explained by both material scarcity and\nby enduring public opinion. But, The good thing about copper is that the cheaper\na commodity is, the more volatile its price can be. Gold isn’t…",
  "data/reddit-stocks/r/Bogleheads/comments/u9sjfm/rates_are_going_up_should_i_sell_all_my_bonds_and.json": "Just kidding. Just rebalanced and sold a sizable amount of stocks and bought\nmore long treasuries. Feels good being a stay the course Boglehead 💪",
  "data/reddit-stocks/r/Bogleheads/comments/u9qi8v/what_are_your_favorite_indexbased_etfs_besides.json": "I would say that 75% of the discussion on here is about VTI, VT, and VXUS, which\nmakes sense because this is a Boglehead forum.,\n\nHowever, being a Boglehead is about regular saving, broad diversification, and\nsticking to one's investment plan regardless of market conditions.\n\nSo with that said,…",
  "data/reddit-stocks/r/stocks/comments/u9k5ug/should_i_buy_amd_rn.json": "In the past week or so they have dipped a lot and they are currently at $88 a\nshare. Do you think this trend will continue to go down and if so what would be\na good price to buy the dip or should I just avoid?",
  "data/reddit-stocks/r/stocks/comments/u9pfeb/former_dominos_accountant_ordered_to_pay_2m.json": "https://www.sec.gov/news/press-release/2022-66\n\nThe Securities and Exchange Commission today announced a court-approved\nsettlement requiring a Michigan-based former accountant at Domino’s Pizza Inc.\nto pay a penalty of nearly $2 million for insider trading in the company’s\nstock. The SEC’s…",
  "data/reddit-stocks/r/investing/comments/u9x6bn/dow_tumbles_nearly_1000_points_as_stocks_extend.json": "https://www.wsj.com/articles/global-stocks-markets-dow-update-04-22-2022-11650613003?mod=hp_lead_pos1\n\nWorries about slowing corporate earnings and the Federal Reserve’s plans to\nrapidly raise interest rates dragged the Dow industrials to their worst day\nsince 2020.\n\nInvestors this week parsed…",
  "data/reddit-stocks/r/Bogleheads/comments/u9fjii/what_should_i_do_with_the_money_sitting_in_my.json": "Basically I had close to 46K in my checking account, I sent 25,500 towards my\nstudent loans, to cut 51K in half. Since my payments resume in 10/2022, I have 6\nmonths, unless the Feds do something for the 26K left in student loans. What\nshould I do with the 22K plus since I get direct deposit in my…",
  "data/reddit-stocks/r/stocks/comments/u9aw55/what_mistakes_have_you_done_and_how_have_you.json": "Hi all\n\nI’m curious about whether any of us have done any mistakes and any learning you\nderived from them?\n\nI’m a new investor and having some less successful trades has made me more\nconscious and careful. I now just play the VTI long-con game however I would\nlike to be more active in the…",
  "data/reddit-stocks/r/stocks/comments/u9tddr/can_fb_keep_going_lower_indepth_analysis.json": "There's a lot of bearishness around Meta right now, and bearish market\nconditions going into next week. A lot of fair concerns with the company as far\nas smartphone ad restrictions, slowing growth and overinvestment into the\nmetaverse. Hence analysts project an abysmal 2.51 EPS, would be a 35%…",
  "data/reddit-stocks/r/stocks/comments/u9hxdh/despite_everything_what_stocks_have_you_not_sold.json": "Of course right now the market isn't looking too good. A lot of the growth\nstocks are down big and it doesn't look like the trend is going to stop.\n\nSo which stocks despite being down a lot have you decided not to sell? For me it\nhas to be Nvidia, I was up about 20% and now I am down 15% (Ouch!).…",
  "data/reddit-stocks/r/stocks/comments/ua38hn/what_are_your_purchases_this_past_week.json": "Crazy weeks like this one tingle my buying senses.\n\nI ended up buying some GOOGL, MSFT and wanted more but didn't have enough\navailable cash.\n\nDefinitely going to stock up on cash for next week and get some more, looking\ninto PFE, DIS, COST and maybe expand my VOO holding as well.\n\nWhat did you…",
  "data/reddit-stocks/r/stocks/comments/ua4jpu/bill_gates_has_half_a_billion_dollar_short.json": "Source: https://twitter.com/WholeMarsBlog/status/1517626832241057792\n\nImages of chat discussion between Elon Musk and Bill Gates regarding\n\"philanthropy on climate change\" have been leaked. Elon confirmed their\nauthenticity on Twitter by saying:\n\n\"Yeah, but I didn’t leak it to NYT. They must have…",
  "data/reddit-stocks/r/stocks/comments/u9y5xj/can_someone_explain_the_overvaluation_of_tesla.json": "What has caused the recent (past two years) spike in Tesla? I understand they've\nimproved production and steadily increased earnings. But does that really\njustify the price? To compare with another company, in their last annual reports\n\n- Ford reported 17.9B in net income. Their current valuation…",
  "data/reddit-stocks/r/Bogleheads/comments/ua6ods/form_5444_for_i_bonds_is_the_most_annoying_thing.json": "I made any account on treasury direct. As soon I click submit I am hit by form\n5444. Apparently this form will take 3 weeks to complete and requires approval\nfrom a bank. I hate this because I will miss out on current interstate rate for\n6 months.",
  "data/reddit-stocks/r/investing/comments/ua044f/what_is_the_next_tech_company_that_you_believe.json": "When Facebook and Netflix both posted the first time they lost subscribers for a\nquarter their stock dropped by 20-30% respectively. Maybe this will end up being\na domino effect and more tech companies will follow suit.\n\nFor example Amazon might’ve been a good bet. But unfortunately…",
  "data/reddit-stocks/r/investing/comments/ua8jth/best_place_to_hold_part_of_an_emergency_fund.json": "My wife and I are pretty diversified. We have solid 401k’s that we continue to\ncontribute to, we have a personal investment fund with some stocks and lots of\nETF’s that we drip into every month, we have a small savings (primarily for\nvacations and bills), and an additional emergency fund of about…",
  "data/reddit-stocks/r/stocks/comments/uah6lk/disney_under_120_is_it_a_buy.json": "I bought a ton of Disney for a long term play a couple weeks ago. Obviously\nthis, in the short term, was not a very good idea since I’ve maybe seen the\nbiggest flop in my portfolio since coronavirus. But as I learned by holding onto\nother large cap companies during the corona scare, you don’t lose…",
  "data/reddit-stocks/r/investing/comments/uaec5v/my_thoughts_on_current_macroeconomic_state.json": "So the Federal Reserve is going to hike rates to cool the economy and inflation.\nInflation itself will tamp down demand, and so will the rate hikes. Housing\nprices are already inflated, add in some rate hikes, the demand for housing\nshould drop some, or at least not go up anymore.\n\nUnemployment…",
  "data/reddit-stocks/r/wallstreetbets/comments/uaa36c/whats_with_the_hate_boner_for_bill_gates.json": "This is literally the subreddit where we worship money and find ways to profit\noff of late stage capitalism. Bill Gates is an exemplar, not a pariah.\n\nAlso, how are you going to suck on Elon’s balls like he isn’t a filthy rich\nbillionaire that hoards wealth just like all the others?\n\nGet your head…",
  "data/reddit-stocks/r/Bogleheads/comments/uaedyj/just_for_fun_and_education.json": "What do your portfolios/asset allocations look like? Hope it’s not too personal.\nJust want to see what all everyone is doing. Looking forward to seeing the\nresponses!\n\nInvestment theories and such are fascinating. I could spend all day everyday\nlooking at different funds and their characteristics,…",
  "data/reddit-stocks/r/wallstreetbets/comments/uaeav6/if_netflix_enforces_this_expect_that_2_million.json": "Netflix reportedly updated their terms with this gem. No idea how this will be\nenforced in an age of mobile data but I can't imagine this boding well.\n[https://preview.redd.it/fle02k9qacv81.jpg?width=854&format=pjpg&auto=webp&s=5bf407dda9b1f44411e6c734c1d6e3684fb323ea]",
  "data/reddit-stocks/r/Bogleheads/comments/uactgo/edward_jones_portfolio.json": "Long story short a family friend and EJ advisor convinced me to invest with him\nwhen I was 18. I didn’t know any better at the time but I’m 25 now, I’ve been\nreading this sub for over a year now and I’m moving everything to Fidelity this\ncoming week.\n\nOut of curiosity, what are your thoughts on my…",
  "data/reddit-stocks/r/stocks/comments/u9xjjm/shut_up_and_wait_or_my_10_years_in_markets.json": "2011 Euro debt crisis 2012 Fiscal clif 2013 10Y went from 1,7 to 3.1 doomers\ncalled the end of days and Hyperinflation, sp500 was up 30% 2014 “ easy money\nhave been made “ 2015 some shit was in august I don’t remember, I think China\ndid something and we had like -15%? Who gives a shit 2016 Feb…",
  "data/reddit-stocks/r/stocks/comments/uaiybj/this_time_is_really_different_the_market_is_way.json": "This market is acting like 1999-2001 dot com and 2007/2008 financial crisis.\nThere is only one major difference. Inflation is 2-3x higher than it was during\ndot com & during the financial crisis. And US bonds are selling off. The Wall\nStreet traders are selling everything, but they will not stay in…",
  "data/reddit-stocks/r/stocks/comments/uakipz/50_in_6_months.json": "Hello, by the name of the post you could probably realize I have not been doing\ntoo well. My portfolio has gone down and down with each month. I started the 4th\nquarter of 2021 very optimistically and added new stocks into my portfolio. But\nnow most of those stocks have gone red with one of them…",
  "data/reddit-stocks/r/Bogleheads/comments/uagdy4/taking_advantage_of_market_dips.json": "For those of you that regularly invest, whether it be a little every week,\nmonth, quarter, etc., and still monitor the markets, do you tend you take\nadvantage of opportunities like Friday to move your next scheduled investment\nup? I know this may be considered timing the market. After messing…",
  "data/reddit-stocks/r/Bogleheads/comments/ualgv1/what_to_do_with_almost_300k.json": "Hello everyone!\n\nI have been saving over the past few years and have accumulated over 250k in\nsavings. I have zero debt, cars and homes are paid off.\n\nI've never invested before and could use any advice.\n\nWhat/ where is and/or are the best ways/places etc to put this money to work ?\n\nI am 100% open…",
  "data/reddit-stocks/r/stocks/comments/uan6xy/block_sq_cofounder_jack_dorsey_no_longer_the_tech.json": "https://www.cnbc.com/2022/04/22/jack-dorseys-new-title-block-head.html\n\nJack Dorsey [https://www.cnbc.com/jack-dorsey/] is no longer the CEO of Block\n[https://www.cnbc.com/quotes/SQ].\n\nIn a filing\n[https://www.sec.gov/ix?doc=/Archives/edgar/data/0001512673/000119312522115187/d337596d8k.htm]\nwith…",
  "data/reddit-stocks/r/investing/comments/uara78/elon_musk_doesnt_own_a_house_how_does_he.json": "Is it part of his strategy to reduce tax and perhaps liability? As the richest\nman on earth you can easily be targeted by a lot of predatory people, this of\ncourse, includes ex-wives and ex-girlfriends who want to get a piece of the pie.\nWhen you face a lawsuit, predatory people come after your…",
  "data/reddit-stocks/r/stocks/comments/uavfl8/google_meta_and_others_will_have_to_explain_their.json": "https://www.theverge.com/2022/4/23/23036976/eu-digital-services-act-finalized-algorithms-targeted-advertising\n\nThe EU has agreed on another ambitious piece of legislation to police the online\nworld.\n\nEarly Saturday morning after hours of negotiations, the bloc agreed on the broad\nterms of the…",
  "data/reddit-stocks/r/investing/comments/uaxck4/smg_value_or_value_trap.json": "Ticker: SMG\n\nScott's Miracle Grow\n\nhttps://finviz.com/quote.ashx?t=SMG&ty=c&ta=1&p=d\n\n-P/E Ratio: of 11.72 (Historically SSMG has been above 15)\n\n-Debt to Equity Ratio of 3.90\n\n-They don't seem to have a lot of cash on hand\n\nhttps://www.macrotrends.net/stocks/charts/SMG/scotts-miracle-gro/cash-on…",
  "data/reddit-stocks/r/Bogleheads/comments/ub1upp/im_bored.json": "After about 1.5 years of immense learning of finances and investing, I feel I've\ngot things \"set\". Now I just need to continue increasing income and savings rate\nbut the thrill is completely over.\n\nWhat do you financial mutants do at this stage to stay engaged?",
  "data/reddit-stocks/r/stocks/comments/uazmxa/amsterdam_trade_bank_part_of_russias_alfa_bank.json": "I came across this news\n\noriginal post\n[https://www.reddit.com/r/wallstreetbets/comments/uabene/amsterdam_trade_bank_part_of_russias_alfa_bank/]\n\nAnyone else missed this news? I didn't see this at all on 22nd.\n\n&#x200B;\n\nQuick background:\n\nAmsterdam Trade Bank (ATB) is subsidiary of Alfa…",
  "data/reddit-stocks/r/stocks/comments/ub2onv/dont_be_fooled_this_environment_has_no_historical.json": "This is a response to a multitude of posts I've seen attempting to waive away\nthe current Fed path as no big deal. This is not a doom post. The economy is\nunlikely to face a major recession any time soon. The pain in stocks on the\nother hand, is almost certain to continue for a while and may be…",
  "data/reddit-stocks/r/investing/comments/uazg01/does_anyone_else_remember_motley_fools_readymade.json": "Perhaps 15 years ago, MF promoted an investing scheme called \"Ready-Made\nMillionaire\" what they made sound like an investment opportunity of a lifetime.\n\nNow in 2022, I can't find a mention of it anywhere on the internet.\n\nDoes anyone else remember this, and if so what happened to it?",
  "data/reddit-stocks/r/stocks/comments/ub1b3u/vix_in_uptrend_for_first_time_since_2008_2000.json": "I have no positions in VIX.\n\nVIX in Uptrend. [https://imgur.com/gallery/RjpOwAv]\n\n2020 and 2018 \"flash crashes\" did not exhibit prolonged volatility runups. They\nwere volatility spikes. All major volatility spikes on VIX are followed by a\ndowntrend with intermittent volatility spikes. This holds…",
  "data/reddit-stocks/r/stocks/comments/uaye22/should_i_start_selling_all_those_overpriced.json": "I was originally not going to name names of the overpriced stocks since they all\nhave positive sentiment as the safety stocks to hide out on but felt I should\ngive examples.\n\nI own them and they have performed well but I feel they are overvalued and the\ngrowth stocks down 50-70% in the last 6…",
  "data/reddit-stocks/r/stocks/comments/ub4k8z/where_are_all_the_people_who_advised_new.json": "I have a spreadsheet tracking most of the stocks I was interested getting into.\nIt didn't serve too much but I wanted a place to collect them together.\n\nThere is a row called \"Percent from 52 Week High\". If you check that row now,\nmany big stocks are trading -70%, -80% of their ATH price and a lot…",
  "data/reddit-stocks/r/stocks/comments/ub806p/stop_asking_what_you_should_buy.json": "If you are here asking what you should buy, how much you should allocate and to\nwhere, whether you should buy now or DCA over time, or if your post can be\nsummated to “will this ticker(s) go up from here?”, then fuck off!\n\nNobody knows anything.\n\nPelosi bought $100 $RBLX LEAPs and the stock hit an…",
  "data/reddit-stocks/r/stocks/comments/uaz719/the_stock_market_mantra_re_nflx_grow_forever_or.json": "The reactionary commentary to NFLX earnings report is kind of interesting…\n\nIt’s basically saying the only true advantageous value in a company is to grow\nevery quarter for the rest of eternity…\n\nAnd as soon as there is a speed bump, “we hate this stock, it is worthless, and\nshould be bought…",
  "data/reddit-stocks/r/stocks/comments/ub42po/want_to_invest_50k_in_these_stock_thoughts.json": "Hi all,\n\nI'm thinking about putting $50k in these stocks and forget about it for at least\n5 years:\n\nVOO $15000\nGOOG $5000\nDIS $5000\nMSFT $5000\nAAPL $5000\nAMD $5000\nNVDA $5000\nAMZN $5000\n\nI would love to hear your thoughts on this. Any input/tips are of course more\nthan welcome!\nThanks all!",
  "data/reddit-stocks/r/investing/comments/ubacuj/are_we_on_pace_to_have_a_decade_like_the_1970s_in.json": "There were 4 years in which the dow was in red with the highest being -27% in\n1974 and the lowest being -3% in 1978. Overall, not a great year for the\nmarkets. Obviously, this year is probably lost with inflation fears and the war\nin ukraine. what r your thoughts about this decade being similar to…",
  "data/reddit-stocks/r/stocks/comments/ub6gcc/twitter_is_reexamining_a_takeover_bid_from_elon.json": "https://www.cnbc.com/2022/04/24/twitter-is-reportedly-taking-another-look-at-musk-takeover-bid.html\n\n\n\n * Twitter is re-examining a takeover bid from Elon Musk after the billionaire\n   disclosed he has secured $46.5 billion in financing, The Wall Street Journal\n   reported on Sunday.\n * Executives…",
  "data/reddit-stocks/r/stocks/comments/ubc6pl/us_stock_futures_sink_suggesting_more_losses.json": "Hope conditions improve when the earning coming out.\n\nWall Street is bracing for a busy earnings week, with quarterly reports due from\nApple Inc.\n[https://www.marketwatch.com/story/apple-gave-investors-more-than-100-billion-last-year-how-much-more-is-coming-11650654829?mod=home…",
  "data/reddit-stocks/r/Bogleheads/comments/ubef7e/is_interactive_brokers_ib_safe_enough_to_invest.json": "Basically the city I am living in (Hong Kong) is not covered by IB LLC’s\nprotection. IB established a separate corporation in Hong Kong to handle the\nbusiness there.\n\nIs it worth risking the chance that IB will close its business (i) in Hong Kong;\n(ii) globally, for whatever reasons and taking all…",
  "data/reddit-stocks/r/investing/comments/ubc9td/the_fed_wants_to_raise_rates_quickly_but_may_not.json": "https://www.wsj.com/articles/the-fed-wants-to-raise-rates-quickly-but-may-not-know-where-to-stop-11650792603?mod=hp_lead_pos5\n\nFederal Reserve Chairman Jerome Powell is shifting monetary tightening into a\nhigher gear. His goal sounds straightforward—lift interest rates to “neutral,” a\nsetting that…",
  "data/reddit-stocks/r/stocks/comments/ub6n9u/how_is_your_managed_account_doing_mine_is_10_ytd.json": "Have a managed account at Merrill Lynch and 15 years from retirement, so\nmoderate risk tolerance. I own the whole decision to pay someone to manage my\nmoney, albeit not one I’m very proud of at the moment.\n\nCurious what others who have managed funds are seeing as an over YTD return and\nwho you use?",
  "data/reddit-stocks/r/stocks/comments/ubiw1f/elon_musks_twitter_buyout_offer_is_turning_more.json": "His $43 billion offer was easily dismissed as a stunt when he put it on the\ntable earlier this month. It looked even less plausible after Twitter took steps\nto prevent the Tesla CEO from increasing his stake further.\n\nBut last week, Musk laid out funding for the deal—not just with an idle…",
  "data/reddit-stocks/r/investing/comments/ubkklq/twitter_set_to_accept_musks_43_bln_offer_sources.json": "From the article:\n\n> NEW YORK, April 25 (Reuters) - Twitter Inc (TWTR.N) is poised to agree a sale\n> to Elon Musk for around $43 billion in cash, the price the chief executive of\n> Tesla Inc (TSLA.O) has called his \"best and final\" offer for the social media\n> company, people familiar with the…",
  "data/reddit-stocks/r/Bogleheads/comments/ubky2d/im_45_and_only_just_starting_investing_should_i.json": "My spouse and I (no kids) have no debt except for our mortgage (175k). Our\ninvestment strategy is 70% VT and 30% BND. Our emergency fund is in I-Bonds. I\nknow that for many on this sub, being both a Boglehead and young has you unfazed\nabout the state of the market. Does that hold true for us late…",
  "data/reddit-stocks/r/wallstreetbets/comments/ub5t0b/melvin_capital_apologizes_to_investors.json": "Melvin Capital has written to investors to apologize. Tweet from Lydia Moynihan\nincludes text of letter.\nhttps://twitter.com/LJMoynihan/status/1518331429209395200?t=2sNnVvYjc1CeRxuhwZi7gw&s=19",
  "data/reddit-stocks/r/stocks/comments/ubh43f/everyone_who_started_investing_investing_during.json": "The title speaks for itself.\n\nBut seriously, I cannot imagine how any new keen investor that started out\nduring 2021 would be able to be in green right now. Unless he/her invested in\nstocks like WMT etc.\n\nAnyone?",
  "data/reddit-stocks/r/stocks/comments/ubj3g5/i_think_youre_all_too_bearish.json": "It’s been a volatile year. In addition to rate hikes which most saw coming we\nhad a war in Ukraine and a slew of bad earnings/guidance from some major\ncompanies. But Christ the world as we know it is not ending. We have also had\nseveral major companies post strong earnings. Even in a very…",
  "data/reddit-stocks/r/stocks/comments/ubjbli/just_a_reminder_to_stay_strong.json": "By now, this year's downturn seems to have broken numerous users I've seen\ncommenting around here. I understand, it's rough.\n\nNormally you could see people repeating the golden rules of what makes good\nreturns, like \"DCA, specially when stock down because then you'll get a\ndiscount\" or the famous…",
  "data/reddit-stocks/r/stocks/comments/ubh3q7/rstocks_daily_discussion_monday_apr_25_2022.json": "These daily discussions run from Monday to Friday including during our themed\nposts.\n\nSome helpful links:\n\n * Finviz [https://finviz.com/quote.ashx?t=spy] for charts, fundamentals, and\n   aggregated news on individual stocks\n * Bloomberg market news [https://www.bloomberg.com/markets]\n *…",
  "data/reddit-stocks/r/Bogleheads/comments/ubjd00/difference_between_admiral_funds_and_investor.json": "Is there any indispensable different other ⠀then expense ratio and buy in price?\nAny benefits to picking one over the other?",
  "data/reddit-stocks/r/investing/comments/ubdrs4/do_i_smell_2008_can_the_housing_market_really_be.json": "Hi All\n\nBeen reading some posts about housing in the US. I'm based in Europe and we are\nseeing ridiculous housing prices.\n\nMy house was just valued at a crazy amount and there seems to be nothing on the\nmarket.\n\nI'm in Slovakia which is bordering Ukraine so there is also an increased demand\nfrom…",
  "data/reddit-stocks/r/stocks/comments/ubserg/twitter_accepts_elon_musks_buyout_deal.json": "Twitter’s board has accepted an offer from billionaire Elon Musk to buy the\nsocial media company and take it private, the company confirmed.\n\nThe announcement ends a weeks-long saga Musk kicked off when he disclosed a\nlarge stake in the company. Soon after, the company said he would join the\nboard,…",
  "data/reddit-stocks/r/investing/comments/ubsnxd/elon_musk_to_acquire_twitter.json": "https://www.prnewswire.com/news-releases/elon-musk-to-acquire-twitter-301532245.html\n\n> Twitter, Inc. (NYSE: TWTR) today announced that it has entered into a\n> definitive agreement to be acquired by an entity wholly owned by Elon Musk,\n> for $54.20 per share in cash in a transaction valued at…",
  "data/reddit-stocks/r/stocks/comments/ubsfu2/twitter_halted_pending_news_bloomberg.json": "“Twitter Inc. is in the final stretch of negotiations about a $43 billion sale\nto Elon Musk that could rank as one of the biggest-ever leveraged buyouts of a\nlisted company, people with knowledge of the matter said, placing an influential\nblogging platform under control of the world’s richest…",
  "data/reddit-stocks/r/wallstreetbets/comments/ubr6fd/gme_price_prediction_gme_to_the_moon.json": "Here's my point-to-point analysis for GME. (It looks Super Bullish to me).\n\n\n\nA long term trend line\n[https://preview.redd.it/ep56w17orpv81.jpg?width=1920&format=pjpg&auto=webp&s=d0360ffd60ea778e97fc35e85444dccd5debc760]\n\nSo here is the big picture of historic price movements.\n\n 1. Since the…",
  "data/reddit-stocks/r/Bogleheads/comments/ubscdn/why_is_vanguard_500_index_fund_vfiax_down_more.json": "At the time of this writing, VFIAX is down -11.26 (-2.77%) while the S&P 500 is\nup +1.66 (+0.04%).\n\nWhy is this? I've been in the fund for a while and just so happened to check on\nit today and noticed this. I thought the results should be roughly identical, so\nI wanted to inquire on what I might be…",
  "data/reddit-stocks/r/investing/comments/ubuhjy/honest_why_invest_in_crypto.json": "I keep hearing about crypto but I don't understand it so I'm asking for some\nhelp. So why do people invest in it? I know all investing is kind of like\ngambling but with stocks there's some tangible thing you get. Most stocks pay\nout dividends and in theory if a stock is undervalued then some very…",
  "data/reddit-stocks/r/stocks/comments/ubvlva/gm_says_it_will_produce_electric_chevrolet.json": "Some bad news for Tesla after last week's earnings.\n\nhttps://www.cnbc.com/2022/04/25/gm-says-it-will-produce-electric-chevrolet-corvettes.html\n\nDETROIT – General Motors [https://www.cnbc.com/quotes/GM] will produce an\nelectrified Chevrolet Corvette next year, followed by an all-electric version…",
  "data/reddit-stocks/r/wallstreetbets/comments/ubsdgx/twitter_halted.json": "TWITTER ACCEPTS BUYOUT, GIVING ELON MUSK TOTAL CONTROL OF THE COMPANY\n\nElon Musk will buy Twitter for $44 billion\n\nhttps://www.theverge.com/2022/4/25/23028323/elon-musk-twitter-offer-buyout-hostile-takeover-ownership\n\nhttps://twitter.com/MarketWatch/status/1518664625595760645\n\n---------------------…",
  "data/reddit-stocks/r/Bogleheads/comments/uc0nus/do_not_waste_time_depositing_money_into_your.json": "There's a lot of interest in buying I bonds before the end of the month to lock\nin that 7.12% annual rate for the next six months and then 9.62% for the\nfollowing six months.\n\nUnfortunately, I've seen a lot of bad instructions on this sub that is going to\ncost some people the opportunity to buy…",
  "data/reddit-stocks/r/stocks/comments/uc2vk7/ford_lunches_the_f150_lightning_on_tuesday_ford.json": "Deliverys will begin this month. This is the first legacy automaker to deliver a\nmass market electric pickup. The F series pickups are the best selling vehicles\nin the north America. Ford sells 900,000 ICE F series pickup trucks annually.\nStarting price on the new F-150 lighting is just under $40k.…",
  "data/reddit-stocks/r/Bogleheads/comments/ubyv9q/bnd_what_is_going_on.json": "https://preview.redd.it/3lsah8kzdrv81.png?width=466&format=png&auto=webp&s=dec7629c1b9ea11899ddb7b68ad77b0116a2ba5f\n\nI hold VOO, VXUS, & BND. I started buying BND probably at the wrong time, around\n$85 last year. I have been in the red ever since but decided to start buying as\nit was going down. My…",
  "data/reddit-stocks/r/Bogleheads/comments/uc1jj2/anyone_changed_their_glidepath_from_what_they.json": "I started saving for retirement in the mid/late 2000's. At the time, the\nstandard BH recommendations regarding asset allocation tended to be one of: (1)\nalways keep at least 25% in bonds (Graham), often softened to 20%, or (2) age in\nbonds (Bogle) / age-10 in bonds. These rules of thumb are still…",
  "data/reddit-stocks/r/investing/comments/uc8niv/what_was_the_most_trendy_nobrainer_investment_30.json": "These days the popular go-to advice is \"Just buy VOO.\" So what was the\nequivalent of that in the 1990's and 2000's respectively? What was the thing\nmost educated investors recommended to people in general as the safest most\nreliable and yet also most potentially beneficial investment the way they…",
  "data/reddit-stocks/r/stocks/comments/uc32wi/facebook_fb_earnings_this_wednesday.json": "FB earnings wednesdays..in the previous quarter fb reported that they lost daily\nusers, for the first time in fb's 18 year history (link\n[https://www.washingtonpost.com/technology/2022/02/02/facebook-earnings-meta/])\nand their stock dropped 20%... . so I am anxious to see if they loose daily\nusers…",
  "data/reddit-stocks/r/Bogleheads/comments/uc9yet/young_nurse_trying_to_make_the_most_of_her_money.json": "As the title states, I'm a nurse with just under a year of experience and, given\nthe pandemic and staffing shortages, I've accumulated quite a bit of money from\nhospital desperation pay to retain what staff they have left. For context, I am\n22 years old\n\nTo provide some insight into what I've got…",
  "data/reddit-stocks/r/stocks/comments/uc6qwf/so_with_elon_buying_twitter_for_5420_does_this.json": "I’m new to this and have never experienced a company going from public to\nprivate. I read around and I see that apparently shareholders are supposed to\nreceive a tender offer for him to buy our shares from us. Does this mean that no\nmatter what price I buy it at, as long as it’s below 54.20 I will…",
  "data/reddit-stocks/r/Bogleheads/comments/ucc02j/jack_bogle_was_a_punk_rocker.json": "https://tonyisola.com/2022/04/was-jack-bogle-the-5th-sex-pistol/\n\nThis is probably not essential reading for most of us. And if you’ve been a\nBoglehead for a while you could skip this.\n\nBut I thought this was a nice way of describing what Bogle did for the world of\ninvesting.\n\nIsola has done some…",
  "data/reddit-stocks/r/stocks/comments/ucej7q/what_percentage_of_your_net_worth_have_you_lost.json": "Title speaks for itself. I lost 40% of my net worth this year, a six figure\nnumber. Painful AF. Want to hear what other folks are going through right now.\n\n\n\nSo, what percentage of your net worth have you lost? This can also be a place\nfor people that made money this year to brag, how much are you…",
  "data/reddit-stocks/r/stocks/comments/ucergw/bloomberg_news_reports_russia_has_cut_off_gas.json": "I was watching Bloomberg news just now.. they said that they have reports that\nrussia has cut off the gas they supply to Poland.. i have been looking the\ninternet for confirmation but can not find it yet so if you have a link to the\nnews please post it..how do you think this will effect the markets…",
  "data/reddit-stocks/r/stocks/comments/uce352/the_nasdaq_fell_25_today_while_tsla_fell_8_what.json": "The whole market is in the red today, and the blue-chip stocks in the broader\nmarket fell sharply.\n\nTesla fell 8%\n\nAmazon fell 3.8%\n\nGoogle fell 2.7%\n\nApple shares fell 2.11%\n\nMicrosoft shares fell 2%\n\nFB fell 3.2%\n\nNvidia fell 5%\n\nAMD fell 4.5%\n\nNext week, the Fed will raise interest rates for the…",
  "data/reddit-stocks/r/stocks/comments/uce801/one_year_since_the_what_under_the_radar_stock.json": "Original Post: What 'Under The Radar' Stock Have You Been Buying? : stocks\n(reddit.com)\n[https://www.reddit.com/r/stocks/comments/mts4ne/what_under_the_radar_stock_have_you_been_buying/]\n\nAlmost everyone stock is down bigly.\n\n\n\nTop Rated Comments (in order of highest rating:\n\nSPY (for reference)…",
  "data/reddit-stocks/r/Bogleheads/comments/ucedi7/are_these_401k_plan_provider_fees_ok_they_acted.json": "2055 vanguard target fund (0.09%)\n\nRecord keeping fee ($2 per every $1000) - my provider told me this goes to\nvanguard.\n\nAdvisory fee (.75%) goes to our personal advisors / provider company\n\n3rd party fee (0.05%) goes to the 3rd party administrator.\n\nLast year this totaled about $620/year, year…",
  "data/reddit-stocks/r/wallstreetbets/comments/ucf0ht/what_happens_when_a_hacker_takes_a_look_at_the.json": "Because I hack companies (legally) for a living, and my day trading cousin\nconvinced me to use my skills to analyze the stock market, I decided to build a\ntool based on options greeks that allows me to forecast stock market moves with\nhigh probability. I'll show you what I mean:\nTake note of each…",
  "data/reddit-stocks/r/investing/comments/ucesl3/is_this_twitter_deal_free_money.json": "Hi Friends,\n\nI am looking at this twitter deal. Elon is buying all of the shares at 54.20 but\nright now the stock is trading around 50.20. That's around an 8% premium. Why\nshouldn't I put all of my portfolio into twitter until the sale and then move\neverything back to my normal…",
  "data/reddit-stocks/r/stocks/comments/uclhej/alphabet_earnings_are_out_here_are_the_numbers.json": "Alphabet reported earnings after the bell. Here are the results:\n\n * Earnings per share (EPS): $24.62 per share, vs. $25.91 expected, according to\n   Refinitiv\n * Revenue: $68.01 billion, vs. $68.11 billion expected, according to Refinitiv\n\nWall Street is also watching other key numbers in the…",
  "data/reddit-stocks/r/stocks/comments/uclkde/microsoft_earnings_are_out_here_are_the_numbers.json": "Here’s how the company did:\n\n * Earnings: $2.22 per share, adjusted, vs. $2.19 as expected by analysts,\n   according to Refinitiv.\n * Revenue: $49.36 billion, vs. $49.05 billion as expected by analysts,\n   according to Refinitiv.\n   \n\nSource: https://www.cnbc.com/2022/04/26/microsoft-msft-earnings…",
  "data/reddit-stocks/r/stocks/comments/uck148/stay_calm_during_these_times.json": "“The stock market is a device for transferring money from the impatient to the\npatient.” - Warren Buffett\n\nI know the volatile times panic some but this quote has me holding tight. How is\neveryone feeling?",
  "data/reddit-stocks/r/investing/comments/ucmdx4/alphabet_q1_earnings_miss_despite_inline_revenue.json": "already down 7%. LOL, tommorow is gonna be a blast. don't catch any falling\nknives.\n\noh yeah, paypal, already down nearly 85% reports tommorow. The slightest miss\nand we're gonna have fun tommorow.\n\nGoogle's parent company Alphabet (GOOG\n[https://finance.yahoo.com/quote/GOOG?p=GOOG&.tsrc=fin-srch],…",
  "data/reddit-stocks/r/stocks/comments/ucho8g/are_we_going_back_to_jan_2020_market_prices.json": "Before the Fed started pumping-in cash, and inflating their balance sheet we\nwere at:\n\n * Dow was 28.2k\n * Nasdaq was 9.1k\n * S&P was 3.2K\n\nWith the Fed reversing course + raising interest rates, are we dropping back to\n(at least) the Jan 2020 levels?\n\n\n\nEdit: added S&P",
  "data/reddit-stocks/r/investing/comments/uchnfp/best_place_to_park_money_if_equities_are_tanking.json": "Pretty straight forward.\n\nWe are seeing SPY fall hard but currently diesel is parabolic indicating high\ninflation across all goods coming back with a vengeance (after last month\nshowing inflation easing).\n\nWhere is the best place to put your money in this situation?",
  "data/reddit-stocks/r/stocks/comments/ucm4lq/the_nasdaq100_has_now_lost_more_than_half_of_its.json": "Just thought it was interesting that at it's peak the NASDAQ100 was up more than\n7,000 points from pre-COVID levels and as of today it has lost over 3,500 of\nthose points.\n\nMany tech stocks are also trading way below their pre-pandemic valuations. PYPL\nspecifically is now trading at early 2018…",
  "data/reddit-stocks/r/investing/comments/ucp8pg/robinhood_lays_off_9_of_fulltime_employees_after.json": "https://blog.robinhood.com/\n\nRobinhood CEO Vlad Tenev shared the below to Robinhood employees following a\ncompany-wide meeting to discuss the changes.\n\nToday we made the difficult announcement that we are letting go approximately 9%\nof our full-time employees. While this decision was necessary, it…",
  "data/reddit-stocks/r/stocks/comments/ucp7ot/robinhood_lays_off_9_of_fulltime_employees_after.json": "https://blog.robinhoo.com/ (add the d to the end)\n\nRobinhood CEO Vlad Tenev shared the below to Robinhood employees following a\ncompany-wide meeting to discuss the changes.\n\nToday we made the difficult announcement that we are letting go approximately 9%\nof our full-time employees. While this…",
  "data/reddit-stocks/r/stocks/comments/ucphc5/psa_to_the_young_investors_out_there.json": "The fear that is driving this market down is from old investors with different\ninvesting goals (less risk-averse, retiring sooner, and have less time than you\nhave in the market), traders, and anyone that is over-leveraged (getting margin\ncalled and being forced to sell).\n\nI'd imagine that many of…",
  "data/reddit-stocks/r/stocks/comments/ucnodh/visa_earnings_report.json": "EPS $1.70 vs $1.65 expected\n\nRevenue $7.19 billion vs $6.83 billion expected\n\nShares were up more than 4% in after-hours trading.\n\n“The omicron variant impacts were short lived and the global economic recovery\nthat began in the middle of last year continued,” Chief Executive Al Kelly said\nin a…",
  "data/reddit-stocks/r/investing/comments/ucowsu/microsoft_earnings_report.json": "· Revenue was $49.4 billion and increased 18%\n\n· Operating income was $20.4 billion and increased 19%\n\n· Net income was $16.7 billion and increased 8% GAAP (up 13% non-GAAP)\n\n· Diluted earnings per share was $2.22 and increased 9% GAAP (up 14% non-GAAP)\n\nhttps://www.microsoft.com/en…",
  "data/reddit-stocks/r/wallstreetbets/comments/ucr5jn/the_great_reset_now_entereth_the_chat_like.json": "2008'S 'THE GREAT RECESSION'\n\nYes, I traded through it. I remember those days very clearly now. Everybody was\nscared. Literally everyone - except for Volkswagen longs\n[https://internationalbanker.com/history-of-financial-crises/the-volkswagen-short-squeeze-2008/].\n\n\n\n\n2022S 'THE GREAT RESET' NOW…",
  "data/reddit-stocks/r/Bogleheads/comments/ucplgo/if_the_market_and_index_stopped_going_up_are_we.json": "One of the questions I've periodically thought about is about the market going\nup. The market has continuously gone up over the decades and the index, which\ntracks it, goes up along with it.\n\nA few skeptics wonder: \"How high can the market keep going? It has to peak at\nsome point right?\" And they…",
  "data/reddit-stocks/r/stocks/comments/uco2uo/if_elon_musk_and_twitter_dont_complete_their_deal.json": "IF ELON MUSK AND TWITTER DON’T COMPLETE THEIR DEAL, ONE OF THEM WILL HAVE TO PAY\n$1 BILLION\n\n\n\nhttps://www.marketwatch.com/story/if-elon-musk-and-twitter-dont-complete-their-deal-one-of-them-will-have-to-pay-1-billion-11651009838?siteid=bnbh",
  "data/reddit-stocks/r/stocks/comments/ucirmh/bears_who_think_the_market_is_still_overvalued_why.json": "I'm not a sophisticated trader. I don't even think I'm that smart or anything,\nbut from what I do know, you can typically tell when a company is overvalued (\nexcept some extraordinary situations like with TSLA ) by looking at their PE\nratio. And yeah, we were way overvalued at the start of the…",
  "data/reddit-stocks/r/stocks/comments/uchjky/buying_google_today.json": "Hello all, I want to buy Google today, but I am conflicted about when to pull\nthe trigger. I am thinking of buying now. Whichever way earnings go in this\nenvironment, the stock will surely follow in a big way. Any good\nguidance/forecasts out there? Does anyone think they will beat earnings or…",
  "data/reddit-stocks/r/investing/comments/ucczgt/why_not_leverage_spy_instead_of_individual_stock.json": "So much sentiment and data proves it's nearly impossible to beat the S&P500 with\nstock picking. So why not use 2x, 3x, and options as leverage as \"risky\" bets\nfor a portfolio?\n\nEven doubling the S&P500's performance with a leveraged ETF at 10-15% of a\nportfolio seems like a better deal than picking…",
  "data/reddit-stocks/r/Bogleheads/comments/ucl1pi/why_has_the_sp500_been_outpacing_the_whole_index.json": "I was calibrating my portfolio with the new price changes of the bear market and\nmaking my monthly DCA.\n\nWhen I noticed that my VT index fund was actually in the red, while my VOO was\nsignificantly over in the green.\n\nI then searched for performance differences and saw that VOO is beating…",
  "data/reddit-stocks/r/investing/comments/ucsilw/fidelity_announced_this_morning_20220426_that.json": "Fidelity announced this morning (2022-04-26) that they will be the first major\nretirement plan to allow investors to put bitcoin in their 401k plans.\n\n> Fidelity Offers Bitcoin as 401(k) Investment Option\n> \n> Will become first provider to allow cryptocurrency in 401(k) accounts\n> \n> By MARK…",
  "data/reddit-stocks/r/stocks/comments/uco2i0/amd_earnings_and_price_projection.json": "The Specifics: Using AMD and Xilinx earning history, I was able to fit the data\nwith a sloped line with an R2 value of 0.97-0.98 (meaning it's pretty linear). I\ncombined both of them to get the best estimates. Here are the values I received.\nReported in millions, except EPS.\n\n \n\nReport Value…",
  "data/reddit-stocks/r/stocks/comments/ucphqw/why_dont_all_companies_buyback_shares_instead_of.json": "It's more tax efficient for both the shareholders and companies so why don't\ncompanies just buyback shares instead of ever issuing a dividend? I would very\nmuch prefer for my stocks to go up more versus receiving dividends and having to\npay taxes on it immediately.",
  "data/reddit-stocks/r/stocks/comments/ucoxmi/what_would_everyones_goto_stocks_be_after_a.json": "As the title says, what would everyones go-stocks be after a market crash and\nwhy?\n\nWhat stocks would you be licking your lips at when discounts come rolling in?\n\nI’m wanting suggestions so I can do a bit of research myself and build up a\nportfolio of the best picks.",
  "data/reddit-stocks/r/Bogleheads/comments/ucvqfw/as_a_new_investor_coping_with_my_first_market.json": "I know the story of Bob the worst market timer but I’m still in that phase where\nI check my portfolio every day and it feels really bad having lump sum invested\nso much of my net worth at a market peak only to then have the market\nimmediately tank by ~12% (or thereabouts where it’s at now).\n\nIn…",
  "data/reddit-stocks/r/stocks/comments/ucrgac/googles_operating_income_was_2009_billion_it_also.json": "Alphabet today announced Q1 2022 earnings with $68.01 billion in revenue. These\nnumbers range from January to March, and kick off the company’s fiscal year.\n\nRevenue is up 23% from $55.3 billion in Q1 2021, with operating income at $20.09\nbillion and net income of $16.44 billion for this quarter…",
  "data/reddit-stocks/r/stocks/comments/ucp3i9/microsoft_stock_rallies_on_strong_earnings_and.json": "https://www.barrons.com/articles/microsoft-stock-price-earnings-51650921904\n[https://www.barrons.com/articles/microsoft-stock-price-earnings-51650921904?mod=hp_LEAD_1_B_3]\n\nMicrosoft [https://www.barrons.com/market-data/stocks/msft]is providing tech\ninvestors with some badly needed good news,…",
  "data/reddit-stocks/r/investing/comments/uclytm/coinbase_87_pe_ratio_how_come_it_is_such.json": "Basically the title, how come Coinbase, a software company, has such a low PE\nratio? In the current overvalued market Coinbase seems to be dramatically\nundervalued. I get it, the whole Nasdaq is cooling down (almost 4% at the time\nof writing this post), but a lot of these companies have insane…",
  "data/reddit-stocks/r/stocks/comments/ucsdap/are_we_already_in_a_recession.json": "Blue chips are missing earnings, Stocks are entering a bear market, interest\nrates are going up, China is on lockdown, war in Ukraine, record smashing\ninflation and demand for housing and goods are drying up. Are there any metrics\nthat point towards us being in a beginning of a recession on paper,…",
  "data/reddit-stocks/r/stocks/comments/ucnhls/anyone_deploying_their_cash_and_buying.json": "The red needs to stop at some point. Always has done and always will do.\n\nThe question is, has anyone decided that now is the time? We are now at a point\nwhere even some tech stocks are beginning to appear as decently valued. GOOGL is\nnow heading to <20 P/E and AAPL is in the sub-20s too.",
  "data/reddit-stocks/r/stocks/comments/ud21c6/archegos_founder_bill_hwang_hit_with_criminal.json": "https://www.bloomberg.com/news/articles/2022-04-27/archegos-founder-hit-with-criminal-charges-in-massive-fund-rout\n\nU.S. prosecutors charged Archegos Capital Management founder Bill Hwang and\nChief Financial Officer Patrick Halligan with fraud, in the latest fallout from\nthe spectacular collapse of…",
  "data/reddit-stocks/r/investing/comments/ud5ayv/wsj_facebook_parent_meta_expected_to_post_slowest.json": "https://www.wsj.com/articles/meta-platforms-facebook-fb-q1-earnings-report-2022-11651022191\n\nFacebook parent Meta Platforms Inc. is expected to post its slowest revenue\ngrowth on record as the company navigates growing competition for users and\nprivacy headwinds in its advertising business.\n\nMeta’s…",
  "data/reddit-stocks/r/stocks/comments/ud3q7e/google_trends_suggests_summer_travel_boom.json": "Let's get through this week, month, year... by dreaming of getaways.\n\nAs a surprise to no one, according to Google, people are in vacation planning\nmode.\n\nBy the numbers: Google shared this data in their latest earnings call. The\nanticipated summer travel boom could contribute $2 trillion to the…",
  "data/reddit-stocks/r/stocks/comments/ud4v8g/do_you_think_these_tech_selloffs_are_reasonable.json": "I think that the recent sell offs in FB, NFLX, GOOGL, etc. are reasonable. It\nfeels like they should just go back to their pre-pandemic levels since their\ngrowth was exacerbated by the pandemic with everyone in their houses using these\ncompanies services. What are your thoughts?",
  "data/reddit-stocks/r/Bogleheads/comments/ud1a6y/how_long_have_you_been_invested_in_your_current.json": "How long have you had money in the market?\n\nView Poll [https://www.reddit.com/poll/ud1a6y]",
  "data/reddit-stocks/r/stocks/comments/ud7igt/whatever_happened_to_cathie_wood_never_hear_about.json": "Does anyone know whatever happened with Cathie Wood and Ark Invest? I don't see\nthem in the news anymore, and I remember how certain Reddit communities were\nbreathlessly encouraging others to put their life savings into her funds. I\nwonder where they are now...",
  "data/reddit-stocks/r/stocks/comments/udcu5q/shares_of_facebook_parent_meta_jumped_in_extended.json": "Shares of Facebook parent Meta jumped in extended trading on Wednesday after the\ncompany reported earnings that topped estimates even as revenue disappointed.\n\nHere are the results.\n\n * Earnings per share: $2.72 vs $2.56 expected, according to a Refinitiv survey\n   of analysts\n * Revenue: $27.91…",
  "data/reddit-stocks/r/stocks/comments/uda0to/fb_meta_down_5_ahead_of_earnings_anyone_buying.json": "I'm a bit surprised to see FB down 5% today given how much it's already fallen\nYTD and the fact the NASDAQ is up over a 1% as of writing this.\n\nFB is now trading at an EV/EBITDA multiple of 8. I get the concerns, but FB is\nstill the second largest digital advertising company in the world with…",
  "data/reddit-stocks/r/stocks/comments/udcph9/tech_qualcomm_revenue_pops_41_driven_by_android.json": "https://www.cnbc.com/2022/04/27/qualcomm-qcom-earnings-q2-2022.html\n\nQualcomm [https://www.cnbc.com/quotes/QCOM] reported second-quarter earnings\nWednesday after the bell, beating Wall Street expectations for sales and\nearnings, and driving the stock up over 3% in extended trading.\n\nHere’s how…",
  "data/reddit-stocks/r/stocks/comments/ud1vd7/boeing_stock_drops_toward_17month_low_after_much.json": "Here’s how Boeing performed in the first quarter compared with analysts’\nestimates:\n\nAdjusted results: A core loss of $2.75 a share vs. an expected loss of 27 cents\na share.\n\nRevenue: $13.99 billion vs. $16.02 billion, expected.\n\nhttps://www.cnbc.com/2022/04/27/boeing-ba-1q2022…",
  "data/reddit-stocks/r/Bogleheads/comments/ud6g4n/what_to_do_with_dividends.json": "Hey all -\n\nI've continued to read and research, but cannot 100% decipher what\nrecommendations are for dividends in my taxable brokerage & what I want to do\nwith them. Since we have some weeks before the big index ETFs pay out\nquarterlies (June), I want to make sure I'm prepared.\n\nJust a small…",
  "data/reddit-stocks/r/wallstreetbets/comments/ud1gey/doj_set_to_charge_bill_hwang_with_fraud.json": "The DOJ has revealed an indictment against archegos fund manager Bill Hwang who\nsingle handedly fucked the NASDAQ in late summer of 2020.\n\nUpdate: he has been arrested\n\nEdit: according to the indictment, it’s alleged that Hwang’s fund amassed the\nequivalent of 70% of the float of GSX, over 60% of…",
  "data/reddit-stocks/r/investing/comments/udcsye/to_everyone_asking_if_buying_twitter_is_free_money.json": "First, I understand this may be the first merger you've been exposed to. As much\nas it grinds my gears that this question is only asked about Twitter and not the\ncountless other mergers that go through I'll provide some data on the strategy\nof buying companies that will be acquired.\n\nIs it free…",
  "data/reddit-stocks/r/stocks/comments/ud99j8/401k_100_invested_in_bank_of_america_stock.json": "I've just found out that my mom's 401k invested 100% in Bank of America stock.\nBasically she works for Bank of America and at some point somebody must have\ntold her that this would be a good idea. Right now she had been waiting for it\nto go back up from the dip in 2009 to diversify. She has…",
  "data/reddit-stocks/r/stocks/comments/uddjzd/should_i_give_up_on_arkk.json": "I invested as a believer in Cathies vision of a five year outlook on her\nholdings. (Initially, buying at all time high at 130's)\n\nBut the holdings are getting crushed. Teledoc, #3 in percentage of holdings\nafter hours tanked 30%.\n\nDoes anyone think the stock will get back up to ATH's? Are we…",
  "data/reddit-stocks/r/Bogleheads/comments/udawra/are_stocks_real.json": "I am a long-time Boglehead and index fund investor. Recently I am ruminating on\nsome things and it is causing me to question my assumptions about investing in\ngeneral, and about the stock market in particular.\n\nI would like to hear everyone's thoughts on the following--Is it possible that\nwe have a…",
  "data/reddit-stocks/r/stocks/comments/udgnb7/teladoc_plummets_38_after_hours_on_q1_bottom_line.json": "Cathie Wood's 3rd biggest holding (in ARKK) down the shitter tonight...\n\n--------------------------------------------------------------------------------\n\nShares of Teladoc Health (NYSE:TDOC) fell 38% in after-hours trading Wednesday\nafter the telehealth provider's Q1 2022 results missed on the top…",
  "data/reddit-stocks/r/stocks/comments/uczkfr/rstocks_daily_discussion_wednesday_apr_27_2022.json": "These daily discussions run from Monday to Friday including during our themed\nposts.\n\nSome helpful links:\n\n * Finviz [https://finviz.com/quote.ashx?t=spy] for charts, fundamentals, and\n   aggregated news on individual stocks\n * Bloomberg market news [https://www.bloomberg.com/markets]\n *…",
  "data/reddit-stocks/r/stocks/comments/udieyc/goog_split_201.json": "So July 1st is the 20:1 split for alphabet. Are there any real downsides to\nbuying now and riding the rally once the stock is more affordable to many more\nbuyers when it’s in the $1XX range? I own zero tech stocks and really think this\nis a good long term play. NFA comments are accepted.",
  "data/reddit-stocks/r/investing/comments/udc7md/are_there_still_any_arkk_fans_out_there.json": "ARKK has dipped severely back to its price circa 2019. Despite this, if you look\nfrom 2016-2019, you can see that someone who had invested in the fund would have\n3x their money. Wondering if anyone is still bullish on this fund for the future\nand if anyone is buying the dip. Seems like the perfect…",
  "data/reddit-stocks/r/stocks/comments/udczqk/fill_me_in_on_pypl.json": "I have not kept up with PayPal, but I noticed today that it is down over 70%\nfrom highs. I imagine they were probably overly-inflated highs, but what has\nbeen going on? Have the fundamentals changed enough to wipe out $200B+?\nBull/bear case?",
  "data/reddit-stocks/r/Bogleheads/comments/uds9nv/but_bonds_are_crashing.json": "Over the past full year, as well as YTD, safe bonds have beaten stocks overall.\nI see some folks saying 'but they're supposed to be stable, and not crash like\nstocks!' Well, they are relatively stable, and they aren't crashing 'like\nstocks' -- equities can tank by 50%+ in a bad downturn, and we've…",
  "data/reddit-stocks/r/stocks/comments/udu25j/us_economic_growth_rate_unexpectedly_declined_in.json": "https://www.cnbc.com/2022/04/28/us-q1-gdp-growth.html\n\nGross domestic product unexpectedly declined 1.4% in the first quarter, marking\nan abrupt reversal for an economy coming off its best performance since 1984,\nthe Commerce Department reported Thursday.\n\nThe negative growth rate missed even the…",
  "data/reddit-stocks/r/investing/comments/uduelf/gdp_unexpectedly_contracts_in_q1_2022.json": "https://www.bea.gov/sites/default/files/2022-04/gdp1q22_adv.pdf\n\n\n\nDP annualized, quarter-over-quarter: -1.4% vs. 1.0% expected\n\n\n\nThe decrease in real GDP reflected decreases in private inventory investment,\nexports, federal government spending, and state and local government spending,\nwhile…",
  "data/reddit-stocks/r/Bogleheads/comments/udu7tf/last_day_to_buy_i_bonds_for_712.json": "Just a reminder for you procrastinators out there, when you buy I bonds,\nTreasury fulfills the order the next business day. That means today is the last\nday to buy I bonds in April to lock in the 7.12% annualized rate for the first\nsix months.",
  "data/reddit-stocks/r/investing/comments/udtyqm/why_im_long_on_long_read_dna_sequencing_pacb.json": "I work in the biotech field and want to lay out why the 2022 biotech sell-off\nhas created an unparalleled opportunity to buy cheaply into technology leaders\nin a growing field. Specifically, I want to talk about two companies involved in\nDNA sequencing: the US-listed Pacific Biosciences ($PACB) and…",
  "data/reddit-stocks/r/stocks/comments/udq13x/spotify_stock_plunges_on_q1_earnings_despite.json": "https://finance.yahoo.com/video/spotify-stock-plunges-q1-earnings-134253697.html\n\nOne very interesting thing to talk about is how much money Spotify makes out of\nits users. It's $4,61 per month from Premium users, $0,39 per month from free\nusers. Gives a better perspective for how much Spotify then…",
  "data/reddit-stocks/r/Bogleheads/comments/udhstj/i_am_so_freaking_confused_on_where_to_start.json": "Long one so I apologize in advance. I made a post in here a few days ago asking\nabout VTI vs VOO. After some reading I decided to invest my Roth IRA in VTI and\nVXUS.\n\nAside from this, I am so overwhelmed by the amount of information out there. I’m\nreally REALLY new to investing, as in my Roth IRA…",
  "data/reddit-stocks/r/stocks/comments/udyrit/why_are_people_freaking_out_now_is_the_time_to.json": "Like, people wish they had bought things like aapl and goog back in 09-12 after\nthe recession, but now are afraid to put money into the market. If it blows\nup…that’s a good thing. In five years you’re gunna be rich when all this\nstabilizes",
  "data/reddit-stocks/r/stocks/comments/ue4j6i/apple_posts_big_beat_and_9_revenue_pop_authorizes.json": "Apple’s revenue grew nearly 9% on an annual basis in the quarter ending in\nMarch, the company said on Thursday, showing strong growth and bucking investor\nworries about a deteriorating macroeconomic environment affecting demand for\nhigh-end smartphones and computers.\n\nApple stock rose over 3% in…",
  "data/reddit-stocks/r/stocks/comments/ue45ad/amazon_q1_2022_earnings.json": "Amazon shares plummeted as much as 10% in extended trading on Thursday after the\ncompany issued a revenue forecast that trailed analysts’ estimates.\n\nHere’s how the company did:\n\n * Loss: Loss per share of $7.56\n * Revenue: $116.44 billion vs. $116.3 billion expected, according to…",
  "data/reddit-stocks/r/investing/comments/ue427k/amazon_q1_earnings_reported.json": "https://www.cnbc.com/2022/04/28/amazon-amzn-q1-2022-earnings.html\n\nAmazon reported earnings after the bell. Here are the results.\n\nLoss: Loss per share of $7.56\n\nRevenue: $116.44 billion vs. $116.3 billion expected, according to Refinitiv\n\nIt is not immediately clear if the reported earnings per…",
  "data/reddit-stocks/r/stocks/comments/udxxoz/isnt_the_negative_gdp_print_actually_a_positive.json": "tl:dr a recession sooner rather than in 2023 is a positive for the market. It's\ndoing the inflation work for the Feds while rates remain manageable for continue\nbusiness growth (though slower than 2020-21).\n\n1) This print is a surprise for most economists. Feds have been hawkish because\nof an…",
  "data/reddit-stocks/r/stocks/comments/ue4e61/robinhood_shares_fall_as_losses_widen_on.json": "https://www.cnbc.com/2022/04/28/robinhood-hood-q1-2022-earnings.html\n\nLosses per share: 45 cents vs. 36 cents expected\nRevenue: $299 million vs. $355.8 million expected\n\nRobinhood also reported that MAUs declined to 15.9 million from 17.7 million in\nthe year ago period and 17.3 million in the…",
  "data/reddit-stocks/r/investing/comments/ue4ooi/apple_reports_second_quarter_results.json": "Apple Reports Second Quarter Results\n\nRevenue up 9 percent to new March quarter record\n\nServices revenue reaches new all-time high\n\nCUPERTINO, CALIFORNIA APRIL 28, 2022\n\nApple today announced financial results for its fiscal 2022 second quarter ended\nMarch 26, 2022. The Company posted a March…",
  "data/reddit-stocks/r/wallstreetbets/comments/udzynx/stop_beating_this_jim_cramer_joke_to_death_ffs.json": "Title basically.\n\nIt was funny the first 10,000 times the joke was made... now it's half the front\npage every fucking day just resaying the exact same thing.\n\nLook, Cramer is going to say and tweet things every single fucking day. We don't\nneed to all remake the same exact fucking joke over and…",
  "data/reddit-stocks/r/stocks/comments/ue4fka/amazon_takes_76_billion_loss_on_rivian_stake.json": "https://www.cnbc.com/2022/04/28/amazon-takes-7point6-billion-loss-on-rivian-stake-from-q1-stock-plunge.html\n\n * Rivian shares lost over half their value in the first quarter of 2022,\n   forcing Amazon to take a big markdown on its stake in the electric vehicle\n   company.\n * On Wednesday, Ford took…",
  "data/reddit-stocks/r/stocks/comments/udh79x/david_zaslav_buys_1m_in_warner_bros_discovery.json": "Link to the source:\n\nhttps://www.hollywoodreporter.com/business/business-news/david-zaslav-buys-1m-in-warner-bros-discovery-shares-1235136767/\n\nLink to the filling:\n\nhttps://www.sec.gov/Archives/edgar/data/0001437107/000143710722000142/xslF345X03/wf-form4_165108969016425.xml\n\n\n\nSummary:\n\nWarner…",
  "data/reddit-stocks/r/stocks/comments/ue517d/which_is_the_better_buy_at_these_levels_amzn_or.json": "By these levels, I mean 2300 for GOOGL and 2600 for AMZN.\n\nFor AMZN, I like their AWS growth and their Project Kuiper, which could be a\ngame changer. Their e-commerce is not doing super well lately though, and they\nare facing a risk of diworseification.\n\nFor GOOGL, their cloud growth and their AI…",
  "data/reddit-stocks/r/stocks/comments/ue4f0b/intel_q1_report.json": "Earnings: 87 cents per share, adjusted, vs. 81 cents as expected by analysts,\naccording to Refinitiv.\n\nRevenue: $18.35 billion, vs. $18.31 billion as expected by analysts, according\nto Refinitiv.\n\nIntel reported first-quarter net income of $8.11 billion, or $1.98 a share,\ncompared with $3.36…",
  "data/reddit-stocks/r/stocks/comments/udr3zy/rstocks_daily_discussion_options_trading_thursday.json": "This is the daily discussion, so anything stocks related is fine, but the theme\nfor today is on stock options, but if options aren't your thing then just ignore\nthe theme and/or post your arguments against options…",
  "data/reddit-stocks/r/Bogleheads/comments/ue4bmz/im_about_to_cash_in_most_of_my_crypto_to.json": "Hello, I am 30 years old and I make ~120k/year. I have no debt besides my 195k\nmortgage. I've never really saved for retirement/my future, and I would like to\nstart doing so.\n\nCurrent assets:\n\n * $30k emergency fund in a savings account with my credit union (just over 6\n   months worth)\n\n * $115k…",
  "data/reddit-stocks/r/wallstreetbets/comments/ue5nzs/robinhood_hood_posts_yet_another_disappointing_q1.json": "Robinhood (NASDAQ: HOOD) released its FY22 Q1 earnings on Thursday after the\nmarket closed. The trading platform posted a revenue of $299 million, down 43%\nfrom a year earlier and an EPS loss of -$0.45.\n\nRobinhood has consistently underperformed ever since it illegally restricted\ninvestors from…",
  "data/reddit-stocks/r/wallstreetbets/comments/ue92vr/the_real_reason_elon_musk_bought_twitter_and_why.json": "ELON MUSK BOUGHT TWITTER FOR ONE REASON AND ONLY ONE REASON,\n\n\nTO CREATE ARTIFICIAL INTELLIGENCE!!!!\n\nLets take a look at the facts, and as I lay them out, it should become fairly\nobvious why this will be fucking terrible for all of man kind. Then we will\nexamine the best fiscal path forward.\n\n *…",
  "data/reddit-stocks/r/Bogleheads/comments/ue3hnz/new_bogleheads_on_investing_podcast_nick_gendron.json": "Do you own a bond market index fund? If so, did you know you own about 8% in\nforeign bonds? Listen to my podcast with Bloomberg's Nick Gendron and Vanguard's\nJosh Barrickman on how the bond index is created and how Vanguard manages BND\nand VBTLX.\n\nThe Total Bond Index Fund…",
  "data/reddit-stocks/r/stocks/comments/uecwqv/elon_musk_sold_around_4_billion_worth_of_tesla.json": "Elon Musk sold roughly $4 billion worth of Tesla shares in the days following\nhis bid to take Twitter private, according to filings with the Securities and\nExchange Commission.\n\nIn a flurry of trades executed Tuesday and Wednesday, the Tesla and SpaceX CEO\noffloaded about 4.4 million shares of his…",
  "data/reddit-stocks/r/investing/comments/ue113x/twitter_q1_earnings_eps_beat_revenue_miss.json": "Link:\nhttps://www.nasdaq.com/articles/twitter-inc.-q1-profit-increases-beats-estimates\n\n * The company's bottom line totaled $513.29 million, or $0.61 per share.\n\n * This compares with $68.01 million, or $0.08 per share, in last year's first\n   quarter.\n\n * Excluding items, Twitter, Inc. reported…",
  "data/reddit-stocks/r/stocks/comments/ueb78c/official_as_of_today_since_the_2014_inception_of.json": "For all the talk about Cathie's \"5 year\" or \"long term\" outlook:\n\n> And there it is folks. Since the 2014 inception of $ARKK, the ETF has now\n> underperformed Berkshire Hathaway. Hickory Dickory Teladoc. $BRK cumulative\n> advantage on ARKK’s decline today is now 10%. There are GOATs and there are\n>…",
  "data/reddit-stocks/r/stocks/comments/ue590m/congress_approves_tougher_financial_disclosure.json": "Legislation that would subject the nine Supreme Court justices as well as some\n2,500 federal appellate, district court, bankruptcy and magistrate judges, to\ntougher disclosure requirements for their financial holdings and stock trades\npassed the House of Representatives on Wednesday in a rare show…",
  "data/reddit-stocks/r/stocks/comments/ue0jle/activisionatvi_shareholders_approve_microsoft.json": "Solid play on this, around 77 bucks on a microsoft purchase price of 95 and\nclearing the hurdle of the vote today.\n\nOf course this still requires regulatory approval in the US and Europe but fears\non this are overblown imo, it's hard to argue exactly how this transaction\nprovides Microsoft any real…",
  "data/reddit-stocks/r/Bogleheads/comments/ueedso/friend_thinks_i_should_focus_on_dividends_instead.json": "Hello, I have a friend and we were discussing investment approaches the other\nday. He has a very complicated portfolio, with lots of individual stocks, maybe\n40 or so, across different sectors, all targeted for dividend yields. When I\ntold them I just buy VT and don't worry about dividends, they…",
  "data/reddit-stocks/r/investing/comments/ueg9ot/microsoft_acquires_activision_activision.json": "Microsoft: Microsoft to acquire Activision Blizzard to bring the joy and\ncommunity of gaming to everyone, across every device - Stories\n[https://news.microsoft.com/2022/01/18/microsoft-to-acquire-activision-blizzard-to-bring-the-joy-and-community-of-gaming-to-everyone-across-every…",
  "data/reddit-stocks/r/stocks/comments/uegxt3/china_to_end_big_tech_regulation_and_support_big.json": "> China is scheduled to have a symposium with the country’s Big Tech firms on\n> the heels of the Politburo meeting on Friday\n> [https://www.scmp.com/economy/china-economy/article/3175951/chinas-politburo-vows-new-tools-refined-policies-will-help?module=inline&pgtype=article],\n> raising hopes that…",
  "data/reddit-stocks/r/stocks/comments/ue1f2f/why_does_amd_continue_to_go_down.json": "AMD market cap is currently around $146B. It acquired xlnx for 35B. The\nprojected sales after combining is suppose to go go +25 to 30%, net income\n+100%. Right when it was about to acquire i think AMD was about 140B, but at its\npeak it was alot more than that, without accounting for share change…",
  "data/reddit-stocks/r/Bogleheads/comments/ueo3cg/when_should_i_tell_someone_i_am_in_a_relationship.json": "I’m asking here cause the advice i’ve gotten here is 10x better than any other\nsub, but i am 22 years old and have roughly 76k in stocks/401k. While this isn’t\na whole lot, it definitely is a decent amount for people my age. For instance,\nthe person im dating (on the other hand) tends to think…",
  "data/reddit-stocks/r/stocks/comments/ueo6iq/would_investors_accept_5_a_year_return_from_aapl.json": "Why do people seem to bitch if a stock like AAPL would return 5% a year going\nforward( if that were the case for a year or two say) but they'll happily hold a\nvalue stock giving them a flat to negative return and a 3% dividend for 5 years?\n\nAAPL has returned 333% the last 5 years and everyone will…",
  "data/reddit-stocks/r/stocks/comments/ueql8e/historically_every_downturn_for_big_tech_has_been.json": "And this looks to be no different. These companies have competitive advantages\nin the marketplace, close to the level of a Monopoly.\n\nAnd to be clear, we are talking about Apple, Google, Microsoft, Amazon, and\nMeta.\n\nFortunes favor the bold. Stay thirsty my friends.",
  "data/reddit-stocks/r/investing/comments/uen4lf/musk_sells_4_billion_in_tesla_stock_probably_to.json": "> Elon Musk has sold 4.4 million shares of Tesla stock worth roughly $4 billion,\n> most likely to help fund his purchase of Twitter.\n> \n> Musk reported the sale in a filing with the Securities and Exchange Commission\n> on Thursday. The shares were sold over the past few days, at prices ranging\n>…",
  "data/reddit-stocks/r/stocks/comments/ueq1wz/nasdaq_slides_2_led_by_amazon_as_benchmark_heads.json": "U.S. stocks fell Friday with the Nasdaq Composite on pace for the worst month\nsince 2008, as Amazon became the latest victim in the technology-led sell-off.\n\nThe tech-heavy Nasdaq Composite fell 2.3%, weighed down by Amazon’s\npost-earnings plunge. The S&P 500 retreated by 2.1%. The Dow Jones…",
  "data/reddit-stocks/r/stocks/comments/uetsqa/i_analyzed_23000_recommendations_made_by_jim.json": "Intro\n\nThe actual stock picking ability of Jim Cramer has been called into question\nsince the 90s, when he left his own private hedge fund, Cramer & Co in 1999. How\nbad does this guy suck? That's what I wanted to find out.\n\nDisclosure\n\nI'm actually running this strategy lmao - check…",
  "data/reddit-stocks/r/investing/comments/uepycb/higher_food_and_energy_prices_could_last_for.json": "https://www.cnn.com/2022/04/27/business/world-bank-ukraine-shock/index.html\n\nRussia's invasion of Ukraine has contributed to an historic shock to commodity\nmarkets that will keep global prices high through the end of 2024, according to\nthe World Bank.\n\nThe spike in energy prices over the past two…",
  "data/reddit-stocks/r/stocks/comments/uess26/apple_stock_is_down.json": "That’s actually insane. Those earnings were incredible. Beats all around.\n\nThey beat revs by over 4 BILLION and the stock is down almost 3%\n\nThere’s no hope for this market in the short term. I’ll be keeping my head down\nbuying stocks all the way down however low we go. This is a buyers market.…",
  "data/reddit-stocks/r/stocks/comments/uetuea/anyone_else_fully_invested_a_few_months_ago_and.json": "I get it--time in the market beats timing the market--but fuck me man, if I had\njust waited a few more months, I could have started positions at much, much\nbetter entry points. I wouldn't have had to baghold for 2+ years to break even,\nrather I would have 2+ years of gains. I have no more cash to…",
  "data/reddit-stocks/r/investing/comments/ueue83/listen_this_bubble_is_either_going_to_pop_or_it.json": "There’s a lot of people anxious about what’s going to happen the next few weeks\n/ months / years. Inflations running hot, feds increasing rates, economy shrunk\nby 1.4% last quarter, war in Russia, we just got out of a pandemic, bla bla bla.\n\nListen, if you are wealthy enough to be investing any…",
  "data/reddit-stocks/r/stocks/comments/ueoqvn/supply_chains_recovering_auto_inventory_with.json": "Source [https://twitter.com/MikeZaccardi/status/1520000548409384960] and the\nlinked graph [https://i.imgur.com/geBxOUL.png].\n\nEarlier I made two posts on the shipping industry. Post 1\n[https://www.reddit.com/r/stocks/comments/u5ujf3/wsj_shipping_stocks_will_sink_as_us_consumers/]\nand Post…",
  "data/reddit-stocks/r/stocks/comments/ueud5h/listen_this_bubble_is_either_going_to_pop_or_it.json": "There’s a lot of people anxious about what’s going to happen the next few weeks\n/ months / years. Inflations running hot, feds increasing rates, economy shrunk\nby 1.4% last quarter, war in Russia, we just got out of a pandemic, bla bla bla.\n\nListen, if you are wealthy enough to be investing any…",
  "data/reddit-stocks/r/stocks/comments/uewepn/bull_markets_feel_good_bear_markets_make_you_rich.json": "The NASDAQ is down 22% on the year, and has been in decline since about November\nlast year\n\nMillionaires are made during bear markets, keep buying the dips on ETFs or any\nsolid companies and you will be rewarded eventually\n\ndon't forget the impatient are transferring their wealth over to the…",
  "data/reddit-stocks/r/stocks/comments/uew83y/for_those_who_think_popular_tech_stocks_always.json": "Look up Cisco. It was the AAPL of the 90s.\n\nAlso, look up charts of BIG TECH like Intel Dell Lucent Yahoo.\n\nThey NEVER got past the dotcom highs.\n\nAlso, MSFT took 15 years to regain its peak from 2000 in 2016.\n\n\n\nEDIT: These were blue chip tech stocks not PETS or TGLO. dot com bubble…",
  "data/reddit-stocks/r/wallstreetbets/comments/uewi7u/800_2738255_suicide_hotline_number_for_those_who.json": "The past 6 months have been rough for a lot of people in the market. If you’re\nstruggling please reach out to this number! You’re not alone. Especially in this\nsub!",
  "data/reddit-stocks/r/Bogleheads/comments/ueywj4/for_those_who_love_market_volatility_i_salute_you.json": "Who doesn't love a fire sale? I'm nearly 70 years old my portfolio is down more\nthan my yearly income and I'm ecstatic at the prices I'm paying for my index\nfund DCA buys...who is with me????",
  "data/reddit-stocks/r/stocks/comments/uf0ia3/i_20m_have_been_aggressively_dumping_half_my.json": "Like the title says, I moved out a year ago and I've been consistently dumping\n$1,000 into my portfolio every 2 weeks since then.\n\nI'm primarily invested in SPY (75%), F, QCOMM, and RBLX.\n\nHowever I'm down 10% and it seems like I've just been losing money slowly.\n\nI make $45,000 salary and have…",
  "data/reddit-stocks/r/Bogleheads/comments/uey6xo/did_i_do_something_dumb.json": "I recently sold my house, and got about $500K in proceeds. I got in the market\nfor a new house a couple of weeks ago.\n\nI figured it might take a few months to find a new house. So, rather than have\nthat money sit around, I decided to put it in the stock market & then I'd\nwithdraw once I needed the…",
  "data/reddit-stocks/r/stocks/comments/ueyqcc/carvana_once_a_stock_market_darling_forced_to.json": "https://www.wsj.com/articles/apollo-to-purchase-1-6-billion-of-carvana-bonds-11651084271\n\nCarvana's financial troubles spilled over into debt markets this week when the\nonline used-car dealer struggled to sell bonds and was forced to turn to Apollo\nGlobal Management Inc. for $1.6 billion to salvage…",
  "data/reddit-stocks/r/stocks/comments/uf7z1y/has_anyone_ever_just_not_paid_their_broker.json": "I’m down a little over 40k on credit and as of yesterday I no longer have my\nbrokerage account (deleted it yesterday). I’m wondering since I deleted my\naccount will I just likely not hear from them? Should I take other steps i.e\nclosing my bank accounts for now? Thank you",
  "data/reddit-stocks/r/investing/comments/uf55kk/amzn_will_be_fine_in_the_long_run.json": "Anyone looking at the latest AMZN financial report is, in my opinion, missing\nthe most important change in AMZN's income distribution. For the first time\never, income from services (~$60 billion) has overtaken income from products\n(~$56.5 billion).\n\nServices (which includes AWS, advertisement,…",
  "data/reddit-stocks/r/stocks/comments/ufb0mt/shortly_after_everyone_agrees_here_i_realize.json": "I started following Reddit during the GME squeeze. I never went all in I just\nfound it fascinating. As many have noticed, over the last few months, rather\nthan reddit favorite stocks getting pumped they seem to do the complete\nopposite. I don't know if it's coincidence or if there is a true pattern…",
  "data/reddit-stocks/r/stocks/comments/ufb19f/deutsche_bank_hq_in_frankfurt_raided_over.json": "repost of some news I found\n\noriginal post\n[https://www.reddit.com/r/wallstreetbets/comments/uentw7/deutsche_bank_hq_in_frankfurt_raided_over/]\n\nGerman authorities have raided Deutsche Bank’s headquarters in Frankfurt over\nsuspected money laundering at the country’s largest lender.\n\nOfficers from…",
  "data/reddit-stocks/r/stocks/comments/ufd38r/bill_gates_short_position_pays_dividends_as_musk.json": "Elon Musk sold $8.5B in Tesla stock after agreeing to $44B Twitter deal\n[https://arstechnica.com/information-technology/2022/04/elon-musk-sold-8-5b-in-tesla-stock-after-agreeing-44b-twitter-deal/]\nApril 30th 2022\n\nElon Musk Says Bill Gates Is Shorting Tesla Stock—and He’s Not…",
  "data/reddit-stocks/r/investing/comments/ueyev9/where_does_one_put_their_money_in_this_turbulent.json": "Was wondering what strategies traders are taking to navigate this turbulent\nmarket? Holding cash is bad due to inflation, putting money in the market and\nyou’ll get short-term negative returns. How does one take advantage of the\ncurrent economic developments?",
  "data/reddit-stocks/r/stocks/comments/ufe7kd/for_a_reminder_we_are_just_13_off_the_ath_on_the.json": "Hi,\n\nThe last few days, this forum was dominated by \"long-term\" mindset and that\nthings are close to bottoming.\n\nFirst: It is impossible to properly time the market. Good diversification\n(countries and asset classes) can take out the tail events. The market might go\ndown 50% or it might go up 50%…",
  "data/reddit-stocks/r/investing/comments/uf9s6t/everybodys_pointing_at_jpow_for_the_mess_of_last.json": "Hi all,\n\nI understand that a lot of stuff is suboptimal right now, with supply chain\nissues, labor market, the war etc. But I keep thinking that it's in a way\nignorant to only point the finger at JPOW and the FED for the high inflation,\nbonds market under pressure tc...I mean yes, I understand how…",
  "data/reddit-stocks/r/stocks/comments/uffqbg/internal_nasdaq_damage_more_than_45_of_stocks.json": "The only comparisons are Oct 2000 - Oct '02 and Nov 2008 - Apr '09.\n\nhttps://twitter.com/jasongoepfert/status/1520040516955643905\n\nSaw it from the tweet above. How do you feel about this? Are you still buying?\nOr are you heading for the exits?\n\nFor myself I started investing in January 2021. I…",
  "data/reddit-stocks/r/stocks/comments/ufbw2g/why_is_gold_down_and_up_wouldnt_it_be_the.json": "*if\n\nI’m asking because I thought the fed helping so much with liquidity would have\nlowered the value of the dollar which would make gold value rise.\n\nI’m reading all different types of articles but still , wouldn’t the notion that\ninflation is mainly due to too much money and therefore dollar…",
  "data/reddit-stocks/r/stocks/comments/ufcxta/730k_aapl_position_looking_to_diversify_any.json": "I first invested in apple in Dec 2015, I bought $100k worth stock for a price of\n29ish (post-split price) Then I have been only buying apple stock throughout\nthese years. I have not sold any yet. The dividends are decent, but not much,\nbut I like it. While the company is a monster and I have never…",
  "data/reddit-stocks/r/investing/comments/ufio32/how_long_will_insanity_in_the_oil_markets_last.json": "[Repost from /r/stocks]\n\nBefore proceeding with this post, please directly read the original source\n[https://www.commoditycontext.com/p/how-low-can-oil-inventory-go?s=r] for the\nfull context for the graphs, which I will also reproduce here for convenience.\nThe author is Rory Johnston and I highly…",
  "data/reddit-stocks/r/Bogleheads/comments/ufj0fg/the_idiocy_of_the_outdated_treasurydirectgov.json": "Just wanted to post this review I found from Yelp:\n\nI submitted 100% accurate information and provided the address of my permanent\nmailing address, and then I got an email saying they can't verify my information\nand I have to go to a physical bank and get a signed witness document proving I\nam a…",
  "data/reddit-stocks/r/stocks/comments/ufhjt8/why_does_the_market_close_for_the_nights_and.json": "It feels so archaic to me that the stock markets close for nights and weekends.\nThese markets, the great engines of capitalism that are all-important to society\nas we know it, just... close? It seems the same to me as, say, logging into\nAmazon to buy something but finding the website shut down…",
  "data/reddit-stocks/r/Bogleheads/comments/ufi4rt/why_dont_people_recommend_treasuries_for.json": "Every time I see a post asking about where to put money for 1-3 years, the\nresponses are all \"savings account,\" \"HYSA,\" etc. Do people just not know about\ntreasuries? Right now HYSAs are paying about 1%, while you can buy a treasury\nsecurity maturing in 2 years paying 2.7% or in 3 years paying…",
  "data/reddit-stocks/r/wallstreetbets/comments/ufbfdw/just_found_my_wifes_password_book.json": "Found her password book last night. Second page. FIDELITY information. Thought\nI’d just take a peek…. $46,387 just chillin. Half of it in🤮🤮 Starbucks stocks.\n\nIf I would have known I’d have sold that shit back when it was $125 a share.\nAnyway. What should I yolo into Monday.\n\nWill have about $20k…",
  "data/reddit-stocks/r/stocks/comments/ufn741/warren_buffett_says_berkshire_owns_95_of.json": "Source: MSNBC\n[https://www.cnbc.com/2022/04/30/buffett-berkshire-owns-9point5percent-of-activision-blizzard-shares-in-merger-arbitrage-bet.html].\n\n> Warren Buffett on Saturday said Berkshire Hathaway has been increasing its\n> stake in Activision Blizzard in a merger arbitrage play, betting that\n>…",
  "data/reddit-stocks/r/wallstreetbets/comments/uflx06/the_2022_real_estate_collapse_is_going_to_be.json": "There's going to be a lot of text here, so all you smooth brain apes who are on\nreddit, a text based website, yet are still to retarded to read, can skip to the\nend where there will be a very short summary, a bottle of milk from your mother,\nand a blankie.\n\nFirst, lets talk about the part of the…",
  "data/reddit-stocks/r/Bogleheads/comments/uff5hr/equities_and_bonds_during_inflation_from_the_book.json": "Saw some good questions about equities and bonds during inflation and wanted to\nreview Bernstein Deep Risk book to clarify some of the key points that were made\nin my summary. From Pages 23-33 of Deep Risk by William Bernstein\n\nSevere and persistent inflation reduced equity returns, but it did not…",
  "data/reddit-stocks/r/stocks/comments/ufl93y/amd_earnings_this_upcoming_week.json": "After doing a lot of DD I came to the conclusion last Friday to go very heavy in\nAMD. I see a lot of upside in the next 5 years. I’m expecting earnings to be\ngood this week, but I’m fully prepared for the stock to -10 plus percent. I was\ncurious to see what the great minds at r/stocks [/r/stocks]…",
  "data/reddit-stocks/r/stocks/comments/ufiiwh/how_long_will_insanity_in_the_oil_markets_last.json": "TL;DR: Oil Inventories Steeply Falling, especially Crude and Distallates such as\nDiesel and Jet Fuel\n\nBefore proceeding with this post, please directly read the original source\n[https://www.commoditycontext.com/p/how-low-can-oil-inventory-go?s=r] for the\nfull context for the graphs, which I will…",
  "data/reddit-stocks/r/investing/comments/ufhekh/those_who_are_using_the_opportunity_to_buy_right.json": "Outside of my emergency fund I have $7k of cash that I’ve been planning to move\ninto the market in VOO this year and basically any excess cash from here on out\ninstead of dumping more in my emergency which many would say is too large anyway\nbecause I grew up poor and kept money in the bank…",
  "data/reddit-stocks/r/stocks/comments/ufmoo1/saying_last_decades_bull_run_happened_because_of.json": "I often see around here everyone claiming that the last decade's bull run is\nsolely because of the loose monetary policy Fed has adapted after the 2008\ncrisis, and the QE is the only reason we are at the current levels, the market\nhas been propped by the Fed etc. And we are going to see it all go…",
  "data/reddit-stocks/r/stocks/comments/ufmpc5/why_doesnt_tsla_get_included_as_part_of_mega_caps.json": "Not trying to start a flame war, but almost everytime I see mega caps mentioned,\nit's always the usual suspects, though much less mentions of NFLX of late.\n\nFor being around a Trillion in market cap, I find it strange TSLA rarely gets\nlumped into as mega cap, why?",
  "data/reddit-stocks/r/investing/comments/uffq1o/how_to_continue_investing.json": "I am very close to my max contributions for my 401k, HSA, and IRA. I usually\ndollar cost average throughout the year, but with the recent drop i decided to\ngo all in earlier in the year. My primary concern is with my 401k, my employer\nmatches 5% and gifts 3%, but since I am close to my max I am…"
}