{
  "data/reddit-know/r/YouShouldKnow/comments/o9rwsy/ysk_cleaning_using_a_vinegar_and_baking_soda.json": "Why YSK? When making a cleaner using vinegar and baking soda, the two will\nactually neutralise each other when the two are mixed together. This happens\nbecause one is acidic and the other is the complete opposite, a base. The\nfizzing is actually just carbon dioxide being released as the two…",
  "data/reddit-know/r/YouShouldKnow/comments/ob75n3/ysk_if_you_are_a_parent_in_a_joint_custody.json": "Why YSK: When a child lives part time at one parent's home and spends the rest\nof the time at their other parent's home, they usually start to expect how\nthey'll feel at each house. At one house, they may feel like they are free to do\nanything, and at the other they may feel they are restricted from…",
  "data/reddit-know/r/YouShouldKnow/comments/obf8gi/ysk_pesticides_that_are_safe_for_honeybees_are.json": "Honey bees in fact aren't the most prolific pollinators, even among bees. In\nfact, if you live in the US, they are actually not a native species, but a\ndomesticated one, like a pig or cow. Although there are pesticides that are made\nsafer for honeybees, most will kill other pollinators, increasing…",
  "data/reddit-know/r/YouShouldKnow/comments/obhs1y/ysk_rating_anything_on_airbnb_below_4_is_a_death.json": "Why YSK: European cultures don't think 5/5 is \"everything was fine\".\n\nThis is not much of an issue in the US.\n\nBut many cultures in Europe rate things where 3 means \"everything was\nsatisfactory\" and 4 means something especially nice happened and 5 is reserved\nfor \"mind blown\" kind of things.\n\nNow,…",
  "data/reddit-know/r/YouShouldKnow/comments/obj4d8/ysk_the_popular_whats_a_potato_reddit_poststory.json": "Why YSK: Sorry if I burst anyone's bubble, but I see people post about how it's\na legendary story/meme on reddit and it irks me that's it's just basically\nripped from a sitcom and I think the site deserves the truth.\n\nRight here: https://youtu.be/OJAEaAom5FQ\n\n(the episode aired in 2014, a year…",
  "data/reddit-know/r/YouShouldKnow/comments/obnejk/ysk_the_official_website_for_nonfilers_to_sign_up.json": "Why YSK: Intuit, the terrible company that's behind this website and also\nlobbies hard to make tax filing more expensive and complicated, is also behind\nsetting up this new terrible website for non-filers to sign up for the Child Tax\nCredit. It's extremely user unfriendly!\n\nNon-filers are those who…",
  "data/reddit-know/r/YouShouldKnow/comments/obqxzf/ysk_if_youre_having_trouble_falling_asleep_you.json": "Why YSK: If you’re lying in bed and struggling to either relax or fall asleep,\ntry unclenching your face. A lot of times I find my face is tensed up, and when\nI consciously think about relaxing my face I immediately feel relief and am able\nto fall asleep pretty easily.",
  "data/reddit-know/r/YouShouldKnow/comments/oc5f8s/ysk_a_lot_of_pups_get_anxiety_from_fireworks_and.json": "Why YSK: My little guy can't stand the fourth of July, poor little dude gets all\nshaky and whiny every year, talked to the vet today and looking into getting him\nsome medications, or a thundershirt, and of course lots of love.\n\nHas anyone ever tried Dutch? [https://dutchforpets.com/anxiety…",
  "data/reddit-know/r/YouShouldKnow/comments/ocas2a/ysk_you_should_fliprotate_your_mattress_every_3_6.json": "Why YSK: Many people are unaware of this but it actually decreases wear on a\nspecific part of your mattress and makes it last longer, so you won't have to\nbuy a new mattress.",
  "data/reddit-know/r/YouShouldKnow/comments/ocat6t/ysk_you_can_go_to_aaha_universal_microchip_lookup.json": "Especially with July 4th coming up, as many pets run away, get out or lost on\nthis day.\n\nThe chip doesn't get your pet home if the information tied to it isn't up to\ndate!\n\nYou can call your vet, or most may allow swing bys (pandemic changes may apply)\nto scan your pet, to get their chip number.…",
  "data/reddit-know/r/YouShouldKnow/comments/ocaug3/ysk_you_need_to_water_new_concrete_daily_for.json": "Why YSK: when you get new concrete for your driveway or whatnot you must sweat\nit everyday for 7 days. This prevents it from drying in layers and peeling away.",
  "data/reddit-know/r/YouShouldKnow/comments/ocek88/ysk_bear_pepper_spray_is_less_potent_then_human.json": "Bear pepper spray is purposely diluted because bears are more susceptible to the\nactive ingredient, oleoresin capsicum. Why YSK is because lots of people think\nthat bear spray is a more effective alternative for deterring humans when in\nfact the opposite is true.",
  "data/reddit-know/r/YouShouldKnow/comments/ocfljz/ysk_there_is_no_information_to_indicate_gmos_are.json": "Why YSK: Companies always try to label their products as GMO free in an attempt\nto make them seem more healthy, but in fact that is not the case and it is\nlikely the product is even worse for you than if it did have GMOs. While the\nname \"Genetically Modified Organism\" sounds scary, it's actually…",
  "data/reddit-know/r/YouShouldKnow/comments/ocgfcz/ysk_how_to_report_ads_on_youtube.json": "I've been seeing a lot of scam ads before YouTube videos recently and they've\nbeen making me very angry, especially when the videos are aimed at kids. (One\nI've been seeing recently is \"$1000 from Mr.Beast if you visit this site\")\n\nI've also been seeing posts about how you can't report the ads, but…",
  "data/reddit-know/r/YouShouldKnow/comments/ocikhj/ysk_how_to_get_rid_of_robocalls_an_easy_trick.json": "Why YSK: This technique can help to reduce the number of robocalls you receive.\n\nWhen you get a call from a number you don't recognize, answer it but don't say\nanything (or even put your phone on mute so there is absolutely no sound).\n\nWait and listen. If it happens to be a human being who is trying…",
  "data/reddit-know/r/YouShouldKnow/comments/ocp2zf/ysk_about_the_mothers_kiss_maneuver_if_a_child.json": "Why YSK: Save yourself the hassle and expense of a trip to the emergency room.\n\nArticle\n[https://www.webmd.com/children/news/20121015/mothers-kiss-expel-foreign-objects-kids-noses]\nFull disclosure I first read about this…",
  "data/reddit-know/r/YouShouldKnow/comments/oct3l6/ysk_you_have_to_sign_up_to_donate_your_body_to.json": "Why YSK: A lot of people want their body to be donated to science when they pass\naway. My mother was one of these people. While researching who could/would\naccept her body, I found out that the person has to sign up for their body to be\ndonated before they pass away and that nobody can do it post…",
  "data/reddit-know/r/YouShouldKnow/comments/ocxuvj/ysk_the_blood_in_your_rare_meat_is_not_blood.json": "Why YSK: Many people do not like to get rare or medium meat because it is so\n\"bloody\" but in reality all of the blood is removed during the butchering\nprocess. The red liquid in the meat is actually myoglobin and is used to carry\noxygen through muscles.",
  "data/reddit-know/r/YouShouldKnow/comments/ocz3zr/ysk_if_you_are_at_the_beach_and_are_being_pulled.json": "Why YSK: If you are caught by a riptide you could exhaust yourself fighting the\ncurrent and trying to swim directly back to shore. Instead, swim parallel to the\nbeach until you are released by the current.\n\nIf you see an area of calm between waves, do not enter the water at this spot as\nthe space…",
  "data/reddit-know/r/YouShouldKnow/comments/odaxqx/ysk_many_sauces_and_dressings_are_more_calorie.json": "For example a can of soda has just as many calories as a serving of ranch (2\ntbs). Why YSK: if you're having a hard time losing weight or counting calories\nat meals, don't forget to add contributions from your dressing or dipping sauce!",
  "data/reddit-know/r/YouShouldKnow/comments/odibis/ysk_more_pets_are_lost_on_the_4th_of_july_in_the.json": "Not too surprising to most, but just a reminder that many Pets get spooked by\nfireworks, some more than others. Why YSK: The night of July 4th in the US sees\nthe most cases of lost/killed animals, with July 5th being the busiest day for\nAnimal Shelters.\n\nIt's smart to take precautions for all pets,…",
  "data/reddit-know/r/YouShouldKnow/comments/odmxd9/ysk_caffeine_pills_exist.json": "Why YSK: this is the cheapest way to get caffeinated. It's costs $4 USD for 80\n200mg capsules. This is the equivalent of 160 cups of coffee or about 200 cans\nof RedBull. Same price for 100mg capsules (but I recommend breaking the 200mg in\nhalf). Many of us need caffeine to do our jobs at the…",
  "data/reddit-know/r/YouShouldKnow/comments/odnxb7/ysk_if_an_old_laptop_is_constantly_running_its.json": "Why YSK:\n\nOver time laptops (and all PCs) will build up dust inside if they're not cleaned\nregularly. After a few years this can be enough to prevent the fans properly\nmoving air to keep it cool. As a result the fans run faster and more often than\nthey should have to, making a lot of noise and…",
  "data/reddit-know/r/YouShouldKnow/comments/odoc7n/ysk_that_experiences_policies_laws_and_cultural.json": "Why YSK: It's easy to criticize America's issues with healthcare, policing,\neducation, economics, or societal taboos as if they're a ubiquitous problem for\nevery American. But the way we all live with these things really depends on\nwhere we live.\n\nThere are 50 states (and several territories) and…",
  "data/reddit-know/r/YouShouldKnow/comments/odwteg/ysk_many_pets_are_extremely_afraid_of_fireworks.json": "So much so that they will try to run away, or involuntary go to the bathroom.\n\nWhy YSK: Be cautious going to see fireworks with your pet. It can really\ntraumatize certain pets.",
  "data/reddit-know/r/YouShouldKnow/comments/odxdrn/ysk_the_united_states_is_abandoning_nearly_18000.json": "Why YSK - You should know, despite their sacrifice of life and limb, the United\nStates is ignoring a promise of help, and is abandoning nearly 18,000\ninterpreters and their families to die at the hands of the Taliban as withdrawal\nfrom Afghanistan continues. Many of these interpreters have saved…",
  "data/reddit-know/r/YouShouldKnow/comments/odxzi3/ysk_approximately_9095_of_your_bodys_serotonin.json": "You should know that your gut health can have a direct impact on your mental\nhealth as well as your physical health.\n\nWhy YSK: Poor digestion, undiagnosed/discovered food allergies or sensitivities,\nand a multitude of other issues in your stomach have been linked with\ndepression, anxiety, OCD/BPD…",
  "data/reddit-know/r/YouShouldKnow/comments/oeccq9/ysk_if_you_have_symptoms_similar_to_bipolar.json": "Why YSK: I thought I had bipolar disorder my second semester of college because\nI had very sudden mood swings. Went to the doc, but they said since the\ndepressive episode only lasted about a week/week and a half, it was too quick to\nbe BD.\n\nDidn’t make the correlation to my depression and my…",
  "data/reddit-know/r/YouShouldKnow/comments/oefj4v/ysk_some_cooking_recipes_online_use_unnecessarily.json": "Why YSK:\n\nI'm an amateur cook, and I come across a lot of recipes online, either websites\nor on YouTube, and here are some learnings:\n\n1) Recipes generate clicks. They would reference other similar recipes they've\nmade or say that one of the ingredients which they use was made in another\nvideo/…",
  "data/reddit-know/r/YouShouldKnow/comments/oefo3b/ysk_you_should_look_both_ways_before_crossing_the.json": "Why YSK: As you guys know, there are a lot of crazy/drunk drivers out there and\nthere might be a chance where the crazy driver might cross the red light causing\nan accident involving you.\n\nYou looking both ways before crossing the green light helps you and other\ndrivers be more safe out on the…",
  "data/reddit-know/r/YouShouldKnow/comments/oezkat/ysk_that_staying_together_for_the_kids_is_bad_for.json": "Why YSK: Many parents are compelled to stay in miserable, toxic marriages due to\nguilt and fear over the effects of divorce. Unfortunately people are still\nshamed and told they should have worked things out for the kids. Contrary to\npopular belief, there is plenty of research showing that children…",
  "data/reddit-know/r/YouShouldKnow/comments/ofda9b/ysk_everyone_grieves_differently_and_its_not.json": "Why YSK: grief is a massively overwhelming emotion that may just be one of the\nmost difficult to overcome as it deals with our mortality that is utterly\ninescapable and as such every person deals with it differently and that has to\nbe respected.\n\nDon't think grief is wailing or denying or erratic…",
  "data/reddit-know/r/YouShouldKnow/comments/ofjhsk/ysk_adding_filetypepdf_to_your_google_search.json": "Why YSK:\n\nSearching through webpages will often give you simplified, incomplete or\nwaffling explanations or just irrelevant stuff altogether. Webpages take more\neffort to develop than simply uploading a pdf to the internet (and are often\nmade by people who want your attention ). Which do you think…",
  "data/reddit-know/r/YouShouldKnow/comments/oflpkq/ysk_if_you_squeeze_a_lemon_over_apple_slices_it.json": "Why YSK: If you wanted to cut up an apple but eat it later it may oxidize and\nget brown. Not too appealing. But if you add lemon juice to it it gets preserved\nby the vitamin C which is a preservative and you can keep it longer to a few\nhours to a few days from just an hour without!",
  "data/reddit-know/r/YouShouldKnow/comments/oflyng/ysk_for_people_who_feel_like_they_need_to_get.json": "Why YSK: Parents and families tend to pressure us into getting married sooner\nand tell us if we don't get married by a certain age, nobody will ever want us.\n\"I got married at this age and you should too.\"\n\nBut in reality the average age of people getting married keeps increasing, so\nyou're just…",
  "data/reddit-know/r/YouShouldKnow/comments/ofmh4g/ysk_paying_off_collections_wont_necessarily.json": "Why YSK: People often think paying off collection accounts will bring their\ncredit score up. Paying off a collection will NOT remove the negative mark on\nyour credit score from having an account go to collections in the first place.\nSo you might be throwing money away that is better used…",
  "data/reddit-know/r/YouShouldKnow/comments/ofqles/ysk_erections_are_often_involuntary_and_not_sex.json": "I am writing this because of the women I have met who legitimately don't know\nthis. Bloodflow causes the penis to be erect while sleeping, often while waking\nup, exercising, standing up quickly, needing to pee, etc.\n\nWhy YSK: If you see a guy with a boner it doesn't mean he's thinking…",
  "data/reddit-know/r/YouShouldKnow/comments/ofx1nv/ysk_pooping_isnt_supposed_to_hurt_if_you_commonly.json": "Why YSK: i was concerned recently when I saw a starter pack about painful poop\nand it seemed like most of the commons found it super relatable, so apparently a\nlot of people think its normal and fine to experience pain and difficulty\npooping. Pooping should not hurt. If it happens on occasion, once…",
  "data/reddit-know/r/YouShouldKnow/comments/og1sun/ysk_ants_cant_walk_though_vaseline.json": "Why YSK: if you put Vaseline around the base of each leg of a chair or table,\nants cannot climb up it.",
  "data/reddit-know/r/YouShouldKnow/comments/og82es/ysk_bungee_cords_are_the_leading_cause_of_serious.json": "Why YSK: When a bungee cord snaps back, it can travel at more than 200 miles an\nhour. This can cause serious damage to your eye and lead to vision loss or\nblindness.\n\nInstead of using bungee cord to tie down loads in a vehicle, use rope or\nratcheting straps. It could save you from a devastating…",
  "data/reddit-know/r/YouShouldKnow/comments/og8jej/ysk_that_if_youre_not_at_fault_in_a_car_accident.json": "Why YSK: I just discovered something that most people are unaware of. If you are\ninvolved in an accident through no fault of your own, you can file a diminished\nvalue claim with the at-fault party’s insurance company and receive a settlement\nfor the loss of value of your vehicle.\n\nA month ago, a…",
  "data/reddit-know/r/YouShouldKnow/comments/og97zo/ysk_you_should_always_open_any_mail_you_get_from.json": "Why YSK: it often looks like junk but they almost always include the cash as\nincentive for you to sign up for the program. You get to keep the cash even if\nyou don’t sign up.",
  "data/reddit-know/r/YouShouldKnow/comments/ogfrdr/ysk_that_baby_carrots_and_babycut_carrots_are_two.json": "Why YSK: A lot of people, including me, like to buy these small snack sized\ncarrots to munch on but several of them think that they are buying baby carrots.\nIn reality, majority of the time they are buying baby-cut carrots. Baby carrots\nare either bred for being smaller than regular carrots or are…",
  "data/reddit-know/r/YouShouldKnow/comments/ogldto/ysk_if_you_think_you_felt_an_earthquake_you_can.json": "Why YSK: Every time there is an earthquake people post updates to their social\nmedia channels that are largely experiential and subjective. They are sharing\ntheir thoughts and feelings about the earthquake, but the posts aren't being\ncomplied and analyzed in a meaningful way (as far as I know).\n\nYou…",
  "data/reddit-know/r/YouShouldKnow/comments/ogta4w/ysk_one_of_the_best_ways_to_change_your_musical.json": "Why YSK: the music industry has taken advantage of this for ages, yet most\npeople don’t even realize this connection. It’s called the mere exposure effect,\nand essentially, it means that the more you are exposed to something, the less\nuncertainty you feel and the easier it is to understand.\n\nFirst…",
  "data/reddit-know/r/YouShouldKnow/comments/ogxfmm/ysk_sunscreen_beyond_30spf_provides_negligible.json": "Why YSK: many people think that getting spf 100 or whatever works much better\nthan 30 or 50SPF. That’s simply not true. Higher SPF also does not mean you can\nbe out in the sun for a longer period of time. You should be applying sunscreen\n30 min prior to exposure and reapplying every 2 hours, no…",
  "data/reddit-know/r/YouShouldKnow/comments/ogzf4i/ysk_you_should_know_how_to_spot_the_most_common.json": "Why YSK: Identifying these most common fallacies will be practical in everyday\nuse. Knowing even a few of these logical fallacies will help you avoid\nmanipulation by others and identify bad reasoning.\n\n\n\nThis is a list of the types of fallacies I find to be the easiest to spot and\nthe most commonly…",
  "data/reddit-know/r/YouShouldKnow/comments/oh1w8w/ysk_there_are_a_variety_of_different_types_of.json": "Why YSK: For the many dogs are terrified of thunder, fireworks and other very\nloud noises, a possible solution is noise cancelling headgear. There's a lot of\nresearch on the technology and articles that rate different brands on the net.\nThere are many different types, configurations and styles…",
  "data/reddit-know/r/YouShouldKnow/comments/oh5kgq/ysk_trans_is_an_adjective_so_trans_man_or_trans.json": "Why YSK: The term is commonly misunderstood by people not familiar with the\ntrans community. It can be confusing for someone who doesn't understand the\ndistinction, and misuse or misunderstanding can lead to embarrassing or\nupsetting interactions in people's personal or professional lives.\n\nKnowing…",
  "data/reddit-know/r/YouShouldKnow/comments/ohghgy/ysk_that_flaming_drinks_are_meant_to_be.json": "Why YSK: it seems like a no-brainer but you still see it happen and it is\ndangerous. With more and more bars opening up and strange drinks on the menu,\nplease just ask your bartender or server how a drink (flaming or with weird\nattachments) is meant to be drunk. Sometimes a drink is meant to burn…",
  "data/reddit-know/r/YouShouldKnow/comments/ohhk04/ysk_you_can_press_f5_to_reload_a_page_if.json": "Why YSK;\n\nMany websites break, especially ones with shitty videoplayers or something like\nthat. We have all experienced it at one point or another.\n\nWell, page refreshing isn't new, and that's kind of what causes what we are\ntalking about. See, back in the days of 56k modems where you could wait for…",
  "data/reddit-know/r/YouShouldKnow/comments/ohk4ju/ysk_propane_tank_exchanges_give_you_only_15_lbs.json": "Most if not all places that exchange an empty 20-lb propane tank for a \"full\"\none don't really give you a full tank, they give you a tank that can hold 20 lbs\nof propane with only 15 lbs in it. Look at the fine print on their sign.\n\nTo get what you're paying for, go to a place that refills tanks.…",
  "data/reddit-know/r/YouShouldKnow/comments/ohk5f7/ysk_that_you_should_use_two_chipscrisps_to_rescue.json": "If you are ever eating potato chips/crisps (the thin ones, I believe the name\ndiffers between US and UK English) with dip, it is inevitable that one will\nbreak in the dip and that you will try to get it out with a second crisp/chip.\nWhen you go in for the rescue you should use TWO crisps/chips to…",
  "data/reddit-know/r/YouShouldKnow/comments/ohmmbo/ysk_from_the_1800s_to_mid_1900s_britain_had_sent.json": "People worldwide have been shocked to learn of what happened with Canada's\nresidential school program, but there is another part of dark history from the\nsame time period that many people are likely totally unaware of. This would be\nthe history of British Home Children.\n\nIn a nutshell, back in the…",
  "data/reddit-know/r/YouShouldKnow/comments/ohncwm/ysk_genuine_leather_means_its_lowquality.json": "Why YSK: Some furniture (or other) stores will often advertise that \"Our\nproducts are made of real, GENUINE leather!\", attempting to trick customers into\nthinking that they're high-quality because the leather is real. In reality, if\nleather is classified as Genuine, that means that they took the…",
  "data/reddit-know/r/YouShouldKnow/comments/ohulg7/ysk_that_touching_a_baby_bird_will_make_it_so.json": "Why YSK : If it's on the grass, it's better you move it so no one steps on it.\nBetter a moved bird, even if the mother will look for it a bit, than a crushed\nbird under the foot of uncaring humans. Also, to hide it from cats, for a while\nat least.",
  "data/reddit-know/r/YouShouldKnow/comments/ohyuh5/ysk_employees_just_goto_text_on_their_phones_99.json": "Why YSK because I'm literally typing this right now instead of looking for that\nproduct. I'm not saying dont do it, I'm saying the opposite. Thanks for the 3\nminute break 😁 maybe order that thing online next time.",
  "data/reddit-know/r/YouShouldKnow/comments/ohzf6s/ysk_how_your_actions_have_effects_on_people_you.json": "WHY YSK. I have tried to die a lot. Also, over the years I've lost an unfair\namount of friends and family to unhealthy thoughts and urges, like I myself,\namong millions have experienced. Tonight my wife, who lives separately to me,\nleft a happy house party to see a neighbour, a mutual friend,…",
  "data/reddit-know/r/YouShouldKnow/comments/oi4f8k/ysk_if_you_look_ugly_in_photos_it_doesnt_mean_you.json": "Why YSK : A lot of people look good in real life but their pictures come out bad\n(and vice versa). The reason is that you're just not photogenic, it happens to a\nlot of people. In converting a 3d image like a person into a 2d image like a\nphoto, some features are lost. We see in 3D because we have…",
  "data/reddit-know/r/YouShouldKnow/comments/oi9kfu/ysk_services_like_doordashubereats_will_charge.json": "Why YSK:\n\nNot every place has their own delivery service but all it takes is a quick phone\ncall to find out. I've noticed more and more places i see daily have their own\ndelivery service now.\n\nIt can save you $10-$20 in fees, you get your food faster, and more money goes\nto your favourite store. So…",
  "data/reddit-know/r/YouShouldKnow/comments/oiglwp/ysk_the_final_boss_is_you.json": "Why YSK: When you find yourself negatively comparing yourself to others,\nremember, you’re really only competing against yourself. Your ego. Your\nthoughts. Your habits. Your actions. The “final boss” is you. Take a look in the\nmirror & ask yourself, “am I being the best version of myself today?” If…",
  "data/reddit-know/r/YouShouldKnow/comments/oigsgy/ysk_contraceptives_are_not_just_to_prevent.json": "Why YSK: many people think contraceptives are only there to prevent unwanted\npregnancies. I started with the Pill when I was 18 to control irregular periods\nway before I was sexually active. Eventually I learned about an injection that\nwas much better because it was only once every 3 months so I…",
  "data/reddit-know/r/YouShouldKnow/comments/oisbry/ysk_you_can_unlistoptout_from_truecallers_database.json": "Why YSK:\n\nTruecaller uploads contacts of their users and shares information with\nthird-party companies. If someone you know uses Truecaller and has your contact\nsaved, your details are being shared without your permission.\n\nIf you don't use Truecaller, you can unlist your number from their…",
  "data/reddit-know/r/YouShouldKnow/comments/oivgx2/ysk_that_when_walking_in_the_mountains_you_should.json": "Why YSK: mountains are beautiful. Hiking in the mountains is wonderful. But\nmountains are not made for walks in the park. Too many tourists take a wrong\npath or lose their path or go off the path. Too many tourists get lost, get hurt\nand need to be rescued. It can be hard, even in perfect weather…",
  "data/reddit-know/r/YouShouldKnow/comments/oj0tx1/ysk_never_plug_in_a_flash_drive_you_dont.json": "There exist devices that look like flash drives, but actually emulate keyboards\nto hack your computer, or use capacitors to fry your computer.\n\nDo not plug in a flash drive you do not recognize into a computer you care\nabout! Also, if you lose your flash drive for awhile, it might have…",
  "data/reddit-know/r/YouShouldKnow/comments/ojh5u8/ysk_excessive_thinking_about_negative_feelings.json": "Why YSK: Persistent rumination can amplify the symptoms of some existing mental\nhealth conditions such as depression.\n\nAn endless loop of negative thoughts about our current suffering, which in turn\ncreates even more suffering. Conversely, by controlling our rumination we can\nease…",
  "data/reddit-know/r/YouShouldKnow/comments/ojjpbb/ysk_that_only_toilet_paper_waste_should_be.json": "Why YSK:\n\nIn light of the recent spill in the Santa Monica Bay\n[https://www.nbcnews.com/news/us-news/17-million-gallon-sewage-spill-closes-miles-beaches-california-n1273808],\nI thought it best to remind people that wipes, paper towels, and tampons being\nflushed cause serious issues with both your…",
  "data/reddit-know/r/YouShouldKnow/comments/ojko9i/ysk_if_you_meet_someone_online_who_offers_to_help.json": "R/scams has a great writeup of how this scam works:\n\nhttps://www.reddit.com/r/Scams/comments/na8oax/asian_guygirl_from_online_dating_mentors_you_to\n\nTl;dr: scammer connects with you online, scammer talks up how much money they're\nmaking from cryptocurrency, you send your money to scammer to invest,…",
  "data/reddit-know/r/YouShouldKnow/comments/ojqxt7/ysk_putting_fruit_in_a_cooler_with_dry_ice.json": "Why YSK: If you ever go somewhere with a cooler with dry ice and fruit, be aware\nthat your fruit will become carbonated.\n\nThe reason this happens is because dry ice is solid carbon dioxide so it is\nliterally carbonating your fruit. This means that just like carbonated drinks,\nyour fruit will quite…",
  "data/reddit-know/r/YouShouldKnow/comments/ok3f6g/ysk_images_videos_and_documents_may_embed.json": "Why YSK: These private informations may include GPS coordinates, device ID,\naccount ID, time created, program used, and more. They're handy for personal\nuse, but probably aren't desirable for when you need to send the file to someone\nelse. Most messenger apps strips image and video metadata…",
  "data/reddit-know/r/YouShouldKnow/comments/ok3u14/ysk_if_your_flatulence_sometimes_smells.json": "Why YSK: By identifying any food intolerance you have, you can avoid foul farts,\nfatigue, bloating, and other discomfort.\n\nWhen I was in college, I ripped a super nasty fart in my friend's car, and he\nwas absolutely disgusted (even though he isn't usually fazed by such things). He\nwas in medical…",
  "data/reddit-know/r/YouShouldKnow/comments/ok4kfp/ysk_many_public_libraries_offer_free_technology.json": "Why YSK: Email has the been the standard for business communications for at\nleast 20 years and I still speak to customers who are stubborn about anything\n\"computery\" when they don't realise how intuitive and life-improving modern tech\ncan be.\n\nWhy drive to a post office to pay a bill and waste fuel,…",
  "data/reddit-know/r/YouShouldKnow/comments/ok5mdx/ysk_that_taking_a_break_for_just_five_minutes_to.json": "Why YSK: The last 15 months have been stressful for all of us and many are also\nexperiencing anxiety like we've never had before.\n\nWhen you're in the midst of this, taking a break for just 5 minutes to breathe\ndeeply can calm your anxieties and stress.\n\nTo start, find somewhere quiet that you won't…",
  "data/reddit-know/r/YouShouldKnow/comments/ok8gb0/ysk_if_you_are_having_ongoing_issues_with_mental.json": "Why ysk: there are a lot of people out there who own a gun but don't have anyone\nto give it to during times of crisis.",
  "data/reddit-know/r/YouShouldKnow/comments/okbjwk/ysk_your_vacuum_cleaner_is_probably_not_broken.json": "Why YSK:\n\nEmptying the clip-in container doesn't clear out the system, and many times your\nissues result from a clogged filter and/or long hair twisting up in the carpet\nroller under the vacuum.\n\nIf you take 10 minutes to explore your vacuum, you'll find filters that are\nsuper easy to remove. Either…",
  "data/reddit-know/r/YouShouldKnow/comments/okcwhp/ysk_if_you_ever_find_yourself_in_a_position_youre.json": "Why YSK: Most of the gyms have shower facility. If you successfully get a\nmembership then you don't have to worry about using unhygienic means to keep\nyourself clean.\n\nYou can go and take a shower, plus this will give you an excuse to go to gym,\nexercise and stay fit n healthy.\n\nThis isn't new…",
  "data/reddit-know/r/YouShouldKnow/comments/okkl3v/ysk_that_your_iphone_can_scan_documents.json": "Why YSK: With recent comments in the news about how many rural folks cannot\neasily photocopy a document — your iPhone can do so. (Android too, maybe?)\n\nOpen a new note in the Notes app, then click on the camera and choose “scan\ndocuments”. This is not the same as taking a picture of a piece of…",
  "data/reddit-know/r/YouShouldKnow/comments/oky2re/ysk_most_of_brand_new_cars_come_with_a_low.json": "Why YSK: Most of car manufacturers decide to put a low quality\nnot-that-functional paper-like cabin air filter only to be able to say \"there is\na filter\", that's the quality level of most of those filter, just replace it\nwith a better one and I believe most of you people care about the air you…",
  "data/reddit-know/r/YouShouldKnow/comments/ol11mk/ysk_about_aunt_bertha_if_you_are_in_the_usa_and.json": "Why YSK: you can search by zip code to find programs both local and national\nthat can offer financial assistance to those in need.\n\nEdit: if you are outside the US try googling \"Social Care Organizations [your\narea]\" for similar programs",
  "data/reddit-know/r/YouShouldKnow/comments/ol2thy/ysk_cable_internet_service_providers_may_offer_a.json": "Why YSK…\n\nAll I have is internet service through Spectrum (no cable, land line, etc). I\nstarted with their $40/month introductory promo which increased to $75/month\nafter 12 months.\n\nAfter the 12 months I called Spectrum to see if they could give me a loyal\ncustomer discount. They responded with a…",
  "data/reddit-know/r/YouShouldKnow/comments/olc871/ysk_clothing_accounts_for_10_of_all_green_house.json": "Clothing is incredibly bad for the environment to produce. The electricity used\nto make it and transport it is astronomical, and a single shirt can use hundreds\nof gallons of water during manufacturing, as well as toxic chemicals. And many\nshirts are made from oil-based plastic products (most/many…",
  "data/reddit-know/r/YouShouldKnow/comments/olf62t/ysk_always_have_a_mechanic_you_trust_inspect_a.json": "Why YSK: Problems that can be spotted by a complete professional inspection,\nwhich includes putting the car up on a lift, include: frame damage, damage to\nwires or insulation caused by animals, poor previous repair work, flood or fire\ndamage, hidden rust, fluid leaks, burned-out bulbs,…",
  "data/reddit-know/r/YouShouldKnow/comments/ollaqx/ysk_bed_bugs_can_live_in_electronics_such_as.json": "Why YSK: If you're ever unfortunate enough to have bed bugs make sure you check\nyour electronics, especially laptops. Also, if you get refurbished electronics,\nmaybe check. This could be enough to stop an infestation or reinfestation.\n\nWhere I work requires that I clean used laptops. Recently I've…",
  "data/reddit-know/r/YouShouldKnow/comments/om0i69/ysk_that_your_documents_are_as_likely_to_get.json": "Why YSK:-Many homes get damp in winter, many cupboards, basements and lofts are\nsusceptible to damp. People always think about fire and flood when they package\nup passports/driver’s licenses, exam certs but they don’t think about the cold\nor damp. Package them in a plastic wallet Photocopy a spare…",
  "data/reddit-know/r/YouShouldKnow/comments/om8265/ysk_thiamine_deficiency_is_common_among_heavy.json": "Why YSK: It takes extra thiamine and folic acid to process alcohol, leading to\ndeficiency if the individual does not supplement. Thiamine deficiency can\nprogress to Wernicke’s encephalopathy or Wernicke-Korsakoff syndrome (WKS) which\ncan be deadly and requires medical treatment. The treatment is…",
  "data/reddit-know/r/YouShouldKnow/comments/omd8rr/ysk_iphone_has_a_feature_to_automatically_send.json": "Why YSK: now you don’t have to bother manually ignoring robo callers and other\nspam. Numbers not saved in contacts are sent to voicemail. Unknown callers can\nleave messages; if you get a call from a hospital or some emergency call they\naren’t “blocked” but your phone will not ring. You will get a…",
  "data/reddit-know/r/YouShouldKnow/comments/omuxls/ysk_a_restaurants_posted_closing_time_is_the_time.json": "Why YSK: it’s a common misconception that it’s ok to arrive by the time the\nrestaurant closes and stay well past that time. While most places will\naccommodate you if you do it, it is incredibly rude.",
  "data/reddit-know/r/YouShouldKnow/comments/omyn84/ysk_you_can_get_a_melanoma_skin_cancer_any_place.json": "Why YSK: If you go sunbathing, especially at a nude beach, make sure to protect\nall the places where you wouldn't want a scalpel. The eyes are most at risk for\nblue-eyed people, but sunglasses are always a good idea either way. Talk to a\ndermatologist about the safest way to protect your genitals on…",
  "data/reddit-know/r/YouShouldKnow/comments/on45kc/ysk_never_post_pics_of_keys_online.json": "Why YSK: lots of people post pictures of house keys in celebration of getting a\nnew house or apartment, it's trivial and easy to make a copy of that key from\nthe picture. You're literally giving your house key to the Internet. It doesn't\neven have to be a…",
  "data/reddit-know/r/YouShouldKnow/comments/ong4cm/ysk_when_youre_about_to_fight_someone_or_getting.json": "Why ysk: When it comes to fights. Most punches can be directed to your face.\nWhen you are about to fight someone, you may not be thinking of your jaw but it\nshould be taken very seriously.\n\nNot clenching your jaw can lead to several bad things to occur. For one, if the\nother person lands a good hit,…",
  "data/reddit-know/r/YouShouldKnow/comments/onhv11/ysk_dont_use_spray_sunscreen_on_a_sunburn.json": "Why YSK: the alcohol content among other things will dry out the already damaged\nskin and it will hurt more than you'd expect, think of a slap to a sun burn but\neverywhere the sun screen touches for as long as it's not absorbed and some.\n\nI only just realized rub in sunscreen didn't hurt my sunburns…",
  "data/reddit-know/r/YouShouldKnow/comments/oni8v5/ysk_that_chip_or_snack_bags_are_a_common_cause_of.json": "Why YSK: It may not be obvious how much of a hazard these can be, and it is an\neasy problem to deal with once you aware of it.\n\nThey probably kill kids too, I dunno.",
  "data/reddit-know/r/YouShouldKnow/comments/onsqml/ysk_a_contract_does_not_have_to_be_physically.json": "Why YSK: There are two good reasons to understand this; So you don't get hurt by\nyour own words and so others don't take advantage of you. A contract is not a\npiece of paper, it's an agreement between two or more parties where and offer is\nmade and accepted. For example, if I offer to sell you my…",
  "data/reddit-know/r/YouShouldKnow/comments/onvmtr/ysk_native_advertising_is_a_web_advertising.json": "Why YSK: There’s a type of online advertising called Native Advertising, which\nis designed specifically to look like content published by the website where\nthese ads appear. Sometimes these ads fall under the category of “clickbait,”\nbut often times they’re so well disguised the average web user may…",
  "data/reddit-know/r/YouShouldKnow/comments/oobcjo/ysk_if_raw_fruits_and_vegetables_make_your_throat.json": "Why YSK: Oral allergy syndrome is the most common food allergy and you, or\nsomeone you know, may have it. You can help them out by killing the pollen on\nthe food you serve.\n\nI've been surprised that numerous friends who had their throat itch from\nbananas, watermelon plums etc. weren't aware of oral…",
  "data/reddit-know/r/YouShouldKnow/comments/oocge9/ysk_black_cat_hate_is_an_urban_myth_spread_by.json": "Why YSK: They get adopted as or more often than other types. Black and white\ncats are the ones who are actually less likely to be adopted perhaps because\nthey're compared to the much more interesting pure black or pure white cats.\nMoreover there is no evidence of ritualistic \"sacrifice\" or abuse of…",
  "data/reddit-know/r/YouShouldKnow/comments/oodo39/ysk_you_can_start_your_key_fob_activated_car_when.json": "Why YSK: Having a dead battery in the key fob has always been a fear for me. If\nit dies, you can still start your car by pressing the start button with the dead\nFOB. I personally know this to work with Nissan, Toyota and GMC cars.",
  "data/reddit-know/r/YouShouldKnow/comments/oopxzv/ysk_free_shipping_over_x_amount_is_not_a_gift_to.json": "Why YSK: To make more educated decisions when buying something. It is not a gift\nand doesn't require your loyalty to the seller.",
  "data/reddit-know/r/YouShouldKnow/comments/ooqlrt/ysk_your_retirement_account_will_not_grow_if_you.json": "Why YSK: Many people are unaware of the extra step required after contributing\nto an IRA, 401K, or other retirement account and end up with their money just\nsitting there for years at the same amount they put in, or even losing value due\nto fees (not to mention inflation).\n\nA recent post in…",
  "data/reddit-know/r/YouShouldKnow/comments/oown5a/ysk_on_most_cars_turning_and_holding_the_key_will.json": "Other than cars operated purely by a fob, turn your key in the door as if you\nwere locking it yet hold it there for a second or two. Any windows which are\nrolled down should automatically roll up again.\n\nWhy YSK: Because it's super useful on these hotter days and saves you turning\nthe car back on…",
  "data/reddit-know/r/YouShouldKnow/comments/oozdfa/ysk_when_making_your_own_bodyroom_sprays_to_use.json": "Why YSK: Most websites and blogs that contain DIY instructions on how to make\nbody and room sprays never explain why the ingredients are necessary. One common\ningredient listed is witch hazel or vodka to help bind everything together, but\nthat was the most explanation I could find. I came across an…",
  "data/reddit-know/r/YouShouldKnow/comments/op1br9/ysk_that_men_can_also_develop_postpartum.json": "Why YSK: This is a mental health problem that not many people are aware of.\nObviously women have much higher rates of it, due to the bodily and hormonal\nchanges that occur during the entire pregnancy and birth process. But men should\nknow that they also experience hormonal changes during this time…",
  "data/reddit-know/r/YouShouldKnow/comments/opcocg/ysk_the_physical_properties_of_floodwaters_in_a.json": "There have been many videos recently of people and vehicles submerged in brown\nsoil- and debris-laden floodwaters across the world.\n\nWhen sediment and debris are swept up in floods, it increases the density (and\ntherefore the force) of the fluid mixture, sometimes more than twice that of\nclear…",
  "data/reddit-know/r/YouShouldKnow/comments/opf6im/ysk_that_if_you_suffer_from_constant_unwanted.json": "Why YSK: A lot of people think OCD is about being a neat freak. It can manifest\nitself this way in some people, but that’s not usually the case. Intrusive\nthoughts are a symptom as well. In fact, there are people who only have\nintrusive thoughts and don’t engage in visible compulsions. We call this…",
  "data/reddit-know/r/YouShouldKnow/comments/opfqu8/ysk_you_can_speedrun_growing_a_forest.json": "Why YSK: people assume it has to take hundreds of years instead of being\npossible in only a decade, and having your own forest can cut money off your\npower bill by cooling your home, along with providing weather protection and\nnoise reduction for your property, while being zero maintenance after 3…",
  "data/reddit-know/r/YouShouldKnow/comments/opi0z4/ysk_if_you_want_to_easily_access_soviet_era_films.json": "YSK Mosfilm (Mosfilm Cinema Concern) filmstudio has uploaded an array of Soviet\nera films to their YouTube channel. Most of them can be seen with high quality\nand English subtitles. You only need to see one ad before you can enjoy it\nuninterrupted.\n\nLink to channel:…",
  "data/reddit-know/r/YouShouldKnow/comments/opjtgh/ysk_when_walking_down_a_road_you_should_walk.json": "Why YSK: When walking against the flow of traffic you can see vehicles coming\nyour direction and be careful to avoid dangerous drivers. If you walk with the\nflow you cannot see the drivers coming your way and thus the risk of you getting\nhit is much higher.",
  "data/reddit-know/r/YouShouldKnow/comments/opqc4u/ysk_that_being_jewish_is_both_an_ethnicity_and_a.json": "Why YSK: As the title says, just because someone is Jewish, doesn’t necessarily\nmean they follow Judaism. And just because someone follows Judaism, doesn’t\nnecessarily mean they have Jewish blood. You can be both and either/or without\nhaving to be the other.",
  "data/reddit-know/r/YouShouldKnow/comments/opsoa7/ysk_theres_a_fast_easy_and_cheap_way_to_fix.json": "Why YSK: Curled corners of rugs not only look bad, but they can be trip hazards.\n\nJust get a peel and stick vinyl tile from your local home improvement store, cut\nit in half to form a triangle, and stick it to the underside of the curled up\ncorner. Viola! Super cheap and easy fix. Enjoy not tripping…",
  "data/reddit-know/r/YouShouldKnow/comments/optu41/ysk_if_you_are_jogging_and_approaching_someone.json": "Why YSK: a person running up behind someone without a greeting can really\ntrigger some individuals into feeling they're about to be attacked. Women\nespecially are hyper vigilant about footsteps approaching them at a rapid pace.\nIf one is particularly skilled in martial arts, you actually could…",
  "data/reddit-know/r/YouShouldKnow/comments/oq4yfq/ysk_asking_loaded_questions_in_a_relationship_can.json": "Why YSK: questions that seem harmless but are forcing an uncomfortable answer\nout of your significant other are asking for trouble. But it's our nature to ask\nquestions where we want both honest feedback from our SO but also want\nvalidation. Instead, express your feelings about the topic or question…",
  "data/reddit-know/r/YouShouldKnow/comments/oq6pg8/ysk_you_can_use_cloudflares_dns_service_on_your.json": "Why YSK: Cloudflare's 1.1.1.1 [https://1.1.1.1] service has been an easy way to\nget free, private, secure DNS lookups (and in the case of your mobile devices, a\nVPN too) for a few years now. However, I only just found out today that they\nalso offer two small variants to this service which all you to…",
  "data/reddit-know/r/YouShouldKnow/comments/oq6xbp/ysk_about_microsoft_maths_solver.json": "why YSK: if you are a student and have trouble with maths then you should use\nMicrosoft Maths Solver. it is an app which can solve most of your math problems.\nUnlike traditional calculators, it explains and breaks down the equations and\nproblems. I have been using this for a while and you should…",
  "data/reddit-know/r/YouShouldKnow/comments/oq8hbr/ysk_if_you_have_the_option_call_emergency.json": "Calling emergency services on a landline allows them to triangulate your\nposition accurately rather than them having to work out exactly where you are\nand potentialy getting it wrong.\n\nWhy YSK: when it comes to emergency situations every second matters and can be\nthe difference between life and…",
  "data/reddit-know/r/YouShouldKnow/comments/oqo38u/ysk_if_you_own_a_samsung_refrigerator_with_a.json": "Why YSK: There has been a lot of issues with Samsung’s french door refrigerators\nand their ice makers. The ice maker will freeze over causing it to no longer\nmake ice until force thawed and ice will melt in the storage holder.\n\nIf you contact Samsung with a model that has this issue, they’ll send…",
  "data/reddit-know/r/YouShouldKnow/comments/oquhaa/ysk_that_split_lips_are_a_sign_of_an_iron.json": "Why YSK: Most people think that split lips are simply a form of chapped lips,\nwhen in reality they can be a sign of an iron deficiency which could lead to\nother adverse health effects. My PCP noticed my split lip and ordered a blood\ntest to check my iron levels. Lo and behold, I was quite low likely…",
  "data/reddit-know/r/YouShouldKnow/comments/oqvq0s/ysk_that_pressing_your_car_key_fob_up_against.json": "If you take your car key fob and press it up to the skin on your temple and or\nunder your chin/jaw, you can effectively double the range to which the signal\ntravels to your car.\n\nWhy YSK this:\n\nIt's great for walking away from your car and realizing you forgot to lock it\nand you usually don't even…",
  "data/reddit-know/r/YouShouldKnow/comments/oqzwzn/ysk_just_because_a_child_doesnt_want_to_do.json": "Why YSK:\n\nThey could have depression, they could have a better time at doing an activity\n(just like adults)\n\nSome people work better in the morning, some people work better in the\nafternoon, some people work better in the evening. So see when the child is\nbetter at being more productive.\n\nEvery…",
  "data/reddit-know/r/YouShouldKnow/comments/ora2oc/ysk_that_using_a_microwave_power_setting_is_the.json": "Why YSK: most reheating goes like this: microwave food for a minute, stir,\nrepeat, stir, repeat. If you use a half power setting and microwave for the same\namount of time or even a minute longer, your food will heat evenly throughout\nwith no hot or cold spots and no need to stir in the middle of the…",
  "data/reddit-know/r/YouShouldKnow/comments/orcj2r/ysk_that_most_banks_will_honor_checks_up_to_180.json": "Why YSK: \"Personal, business, and payroll checks are good for 6 months (180\ndays). Some businesses have \"Void after 90 days\" pre-printed on their checks.\nMost banks will honor those checks for up to 180 days and the pre-printed\nlanguage is meant to encourage people to deposit a check sooner than…",
  "data/reddit-know/r/YouShouldKnow/comments/ore86s/ysk_if_you_struggling_with_acne_for_over_a_year.json": "Why YSK: Because life is short. Stop wasting your time looking for advice.\n\nTrust me.\n\nI understand it's expensive to see a derm(I live in US), but calculate how much\n\"TIME\" you've spent trying and failing various products for your acne. There's a\nchance it's cheaper to see a derm than continuing to…",
  "data/reddit-know/r/YouShouldKnow/comments/orfsq7/ysk_that_you_can_remove_hairdye_stains_from_your.json": "Why YSK: No one wants to go to work or go out after getting hairdye stains on\nyour face, arms, etc. If you're one of those people who dye your hair dark of\ncrazy colors, sometimes those stains can stay on your skin for days. Especially\ninconvenient for work or outings. Use a wet rag, put a little…",
  "data/reddit-know/r/YouShouldKnow/comments/orn9gc/ysk_you_can_hide_your_number_when_calling_people.json": "Dial *67 then the phone number your calling to come up as a restricted number.\n\nWhy YSK: Personally I work in construction and just recently discovered this and\nI use it to make calls for work and at the end of the day I dont have people\ncalling my phone back. This saves me so many \"please don't…",
  "data/reddit-know/r/YouShouldKnow/comments/orq2he/ysk_it_is_important_to_have_2_cell_phones_in_your.json": "Why YSK: in the ever increasing world of technology companies expect you to use\nyour personal phone for work (for example calling it BYOD (Bring your own\ndevice)), the problem is corporations want to protect their intellectual\nproperty and these two things butt up against each other. The most…",
  "data/reddit-know/r/YouShouldKnow/comments/orr1yl/ysk_applying_heat_to_mosquito_bites_will.json": "I rarely see this method shown as a remedy so I thought I’d share. You just want\nto expose the affected areas to heat. I’ve found the best way is to use a\nhairdryer set on high and simply leaving it over each bite for as long as\npossible, ideally around 15 seconds. The area will itch during the…",
  "data/reddit-know/r/YouShouldKnow/comments/ort6ky/ysk_if_you_saw_something_bright_and_fast_in_the.json": "Why YSK: The American Meteor Society aggregates reports, and shares the data\nwith NASA. Tracking meteorites and fireballs is an important part of the study\nof space, our solar system, and the universe.\n\nHere is the link to report a fireball, which is what they call a large…",
  "data/reddit-know/r/YouShouldKnow/comments/os8tpi/ysk_having_a_1_mg_vs_a_10_mg_thc_edible_can_be_a.json": "Why YSK: I've heard a lot of stories recently about people who take an edible\nfor their first time using cannabis, and many people aren't acutely aware of how\nmany MG of THC they should take, despite the instructions being clear on the\npackage. So I guess this is my RTFM for cannabis.\n\nFor people…",
  "data/reddit-know/r/YouShouldKnow/comments/osecwh/ysk_donations_for_charity_done_via_checkouts_help.json": "Everyday at fast food, grocery and major stores, during checkout they will ask\nyou to donate change, to a local or nation wide charity.\n\nThese companies will then collect all the donations and give them to the\ncharity. From the company, not the consumer. By doing this, it becomes a major\ntax write…",
  "data/reddit-know/r/YouShouldKnow/comments/osf2wz/ysk_if_you_take_extra_time_in_a_drive_thru_the.json": "Why YSK: Most drive thrus have timers inside. Depending on the store, they are\noften unreasonable and impossible to maintain, to \"promote more productivity\".\n\nIn reality, this means that customers who read the menu, don't pull away fast\nenough, or generally spend more than 90 seconds (total) in the…",
  "data/reddit-know/r/YouShouldKnow/comments/osn0zm/ysk_theres_evidence_of_no_x_is_not_the_same_as.json": "Why YSK: it will help you take the correct and logical conclusions and to think\ncritically.\n\nFor example, when your doctor says that he didn't see any signs of cancer, it\nactually means that in his observation, there's no evidence of cancer, not that\nthere's evidence that you don't have cancer. You…",
  "data/reddit-know/r/YouShouldKnow/comments/oso4qt/ysk_flushable_wipes_do_not_break_down_well_and.json": "Why YSK: Companies are obviously incentivized to advertise the best qualities of\ntheir products. While flushable wipes are more likely to break down and\ndecompose compared to traditional wipes, they are not as efficient as doing so\nas many people believe. You should very wary of flushing them down…",
  "data/reddit-know/r/YouShouldKnow/comments/osupur/ysk_not_everyone_is_fluent_in_the_language_youre.json": "Why YSK: The biggest fear a non-fluent speaker has is saying something\ninappropriate or something ridiculous by accident.\n\nI personally, while learning English have had a lot of moments where I’ve said\nsomething seemingly normal that a fluent speaker could interpret as being an\ninnuendo, or have…",
  "data/reddit-know/r/YouShouldKnow/comments/osz449/ysk_theres_a_9999_chance_that_your_car_has_a_gps.json": "A few days ago a friend of mine (a salesman at a Jeep dealership) told me they\ninstall GPS tracking devices and ignition cutoff switches in every vehicle they\nsell (used and new) so that lenders can track your vehicle and disable it if you\nmiss a payment. I started doing some digging online and…",
  "data/reddit-know/r/YouShouldKnow/comments/ot2yf8/ysk_that_dump_trucks_are_still_liable_for_damage.json": "Why YSK: Trucking companies will put signs/stickers on their trucks saying “Stay\nBack 300 Feet” (the distance varies) or “Company Not Responsible For Damage” as\na way to prevent people from making insurance claims against them for\nchipped/cracked windshields, headlights, paint damage, etc. However,…",
  "data/reddit-know/r/YouShouldKnow/comments/ot6r46/ysk_that_sunscreen_takes_sharpie_off_skin.json": "i used to draw on my ENTIRE arm as a kid, and i remember being DEVASTATED that\nall my “art” smeared off at field day.\n\nwhy ysk: this may be useful for those of you who will someday wake up with a\ndick sharpied on your face by a drunk friend.\n\nedit: people are commenting that all lotion does this,…",
  "data/reddit-know/r/YouShouldKnow/comments/otaf8c/ysk_that_head_and_shoulders_shampoo_clears_up.json": "WHY YSK : Anti-dandruff shampoos with pyrithione zinc are very effective against\npersistent adult acne. anti dandruff acne remedy\n[https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4120804/]",
  "data/reddit-know/r/YouShouldKnow/comments/otj7is/ysk_free_guest_passes_at_gyms_almost_always_have.json": "Source: I have worked at multiple gyms over a period of about 4 years and have\nalso been going to various gyms my whole life.\n\n“Free guest pass” is more often than not a way for the gym to collect leads ,\nthen bother the ever-loving F out of you trying to get you to sign up/buy\npersonal training/…",
  "data/reddit-know/r/YouShouldKnow/comments/oto92l/ysk_that_misusing_the_phrase_demonstrated_history.json": "Why YSK: because you probably want to be a successful applicant!\n\nI interview applicants both for professional positions and for graduate school,\nand this has to be one of my biggest pet peeves. I'm not alone, so I can assure\nyou that this mistake will make you seem unprofessional in the eyes of…",
  "data/reddit-know/r/YouShouldKnow/comments/otzy5f/ysk_the_100_companies_are_source_of_71_of.json": "Why YSK: To better understand the impact of companies and private individuals on\nclimate change and avoid being misled by statistics.\n\nTL;DR: The statistic only looks at fossil fuel companies and includes the\nemissions from their products, i.e. the fuel your car uses.\n\nEdit to clarify my intent:…",
  "data/reddit-know/r/YouShouldKnow/comments/ou39q8/ysk_that_while_the_cost_of_insulin_is_always_in.json": "Why YSK: A government program called the 340b Drug Discount Program requires\ndrug companies to sell drugs to community health centers at the same prices they\nsell to Medicaid.\n\nThere are no income restrictions and you just need to schedule an appointment\nwith a doctor at the local community center…",
  "data/reddit-know/r/YouShouldKnow/comments/ou48kz/ysk_the_less_you_say_the_better.json": "Why YSK: You have less chances to be wrong, more chances to listen.",
  "data/reddit-know/r/YouShouldKnow/comments/ou76ji/ysk_most_women_cannot_orgasm_from_penetration.json": "Why YSK: Being able to give your partner better sexual pleasures can be a great\nthing for the both of you.\n\nFingering, mouth, sex toys, and so on. See what works best for her. If anything,\nit makes you more of a man to think about what she needs and desires instead of\nonly focusing on…",
  "data/reddit-know/r/YouShouldKnow/comments/ou8vhs/ysk_that_while_protein_is_often_heavily.json": "Why YSK: protein is an essential nutrient for muscle growth, yeah, but it’s\nabout all tissue growth. It provides the building blocks for muscle, organs,\nskin, blood, antibodies and more. The heavy connection our society gives protein\nto exercising often leaves the impression of “well, I’m not…",
  "data/reddit-know/r/YouShouldKnow/comments/ou98pc/ysk_that_its_i_couldnt_care_less_and_not_i_could.json": "Why YSK, Too many people online and irl incorrectly use this phrase to express\nhow little care they have for something, not realising that saying the latter “I\ncould care less” actually means ‘I have more room to care less which means I\nactually care a bit” please stop it friends. It hurts me",
  "data/reddit-know/r/YouShouldKnow/comments/oudtr6/ysk_to_not_lie_to_your_mechanic.json": "Why YSK: like Doctors, mechanics just want to help you with your problem. Most\nof us are good people who are trying to make a living. If you had your cousin\nJoe Jack try to mickey mouse something. Please let the mechanic know. It would\nbe much better to tell them “Yeah some idiot messed around with…",
  "data/reddit-know/r/YouShouldKnow/comments/oumox4/ysk_personalfitness_trainers_are_not_required_to.json": "Unlike barbers and massage therapists, fitness/personal trainers are not\nrequired to get a state license to practice. What most trainers do is get a\n\"Certification\", which is just a textbook/test. Why YSK: Working with a trainer\nthat is uneducated is dangerous and does more harm and good. Just…",
  "data/reddit-know/r/YouShouldKnow/comments/ouskjl/ysk_reduce_reuse_recycle_are_actually_in_order_of.json": "Why YSK: Reducing what you consume is by far the most effective of the three,\nand you should be reusing what you can't reduce!\n\nBefore buying an item new, you should get the most use out of the item you\ncurrently have, or you should consider borrowing said item from a friend if you\ndon't need this…",
  "data/reddit-know/r/YouShouldKnow/comments/out0wt/ysk_that_the_most_common_therapy_for_autism.json": "Why YSK: a lot of well-meaning parents of autistic children are inundated with\ninformation promoting ABA therapy, but it is actually founded on principles of\nabuse. There is evidence that about half of autistic people who go through ABA\nexperience PTSD as a result of the process, which is founded on…",
  "data/reddit-know/r/YouShouldKnow/comments/ouu874/ysk_prostate_stimulation_can_be_a_healthy_and.json": "Why YSK: most men go their whole lives not experiencing what is one of the best\nsexual experiences a man can have, simply because of the stigma attached to\ndoing so.\n\nI first discovered prostate stimulation on Reddit about a decade ago in my early\n20s. Someone had written their story of having mind…",
  "data/reddit-know/r/YouShouldKnow/comments/ov1b8o/ysk_flushable_wipes_are_not_goodsafe_for_your.json": "Plumber here, yes it's true.\n\nUnfortunately for consumers, marketers specialize in the one skill they share\nwith lawyers and salespeople; lying.\n\nTurns out there's actually no regulation on claims on package such as \"Flushable\nWipes\" (Hell they're boldly advertised and displayed as such) or \"World's…",
  "data/reddit-know/r/YouShouldKnow/comments/ov5svc/ysk_if_you_have_difficulty_taking_medication_in.json": "Why YSK: many people (myself included) have difficulty taking medicines,\nespecially when they come in a large pill form. This can lead to a decrease in\npatient compliance when it comes to taking one's prescribed medication. Harvard\nHealth Publishing\n[https://www.health.harvard.edu/blog/two-tricks…",
  "data/reddit-know/r/YouShouldKnow/comments/ov8bcu/ysk_it_is_illegal_to_block_required_means_of.json": "Why YSK - Businesses cannot block required means of egress for ANY reason.\n\nBuildings are designed to accommodate an occupant load with exits placed to\nhandle those occupants with the least amount of travel distance.\n\nIf there is an exit sign above the blocked door, contact the local fire…",
  "data/reddit-know/r/YouShouldKnow/comments/ov9p73/ysk_not_to_shield_the_people_in_your_life_from.json": "Why YSK:\n\nA lot of people struggle to tell their loved ones (partners, family, friends,\netc.) about the bad things in their life because we don’t want to burden them\nwith more bad news or more worries. When you’re so close to these people, you\nfeel like you know all their worries and concerns…",
  "data/reddit-know/r/YouShouldKnow/comments/ovausl/ysk_xylitol_is_being_used_more_frequently_as_a.json": "Why YSK: Anything labeled sugar free or no added sugar, that is sweet, most\nlikely has xylitol or some other equivalent sweetener product in it (xylitol can\nalso be called birch sugar). These kill animals in tiny amounts by causing a\nsudden extreme drop in blood sugar which induces seizures and…"
}