{
  "data/reddit-crypto/r/CryptoCurrency/comments/t3uofc/if_you_want_crypto_exchanges_to_freeze_russian.json": "A lot of people are rooting for big exhanges like Binance and Kraken to freeze\nRussian people's crypto account.\n\nThis is plain bullshit. If you're rooting for this then you have no single\nfucking idea what crypto actually is.\n\nCrypto = Freedom.\n\nFreezing a specific country's citizens account…",
  "data/reddit-crypto/r/CryptoCurrency/comments/t3y5vb/if_144_million_people_can_move_markets_in_an.json": "Russia has about 144 million people within it's territory (contested and non\ncontested). After sanctions and severe economic restrictions placed on the\nnation and it's inhabitants by the rest of the world due to the invasion of\nUkraine, crypto is pumping, and BTC alone is up 13% or so. On top of…",
  "data/reddit-crypto/r/CryptoCurrency/comments/t425ph/friendly_reminder_that_a_50_drop_of_1000_followed.json": "Was just discussing this with a friend the other day and figured I'd share it\nhere as well (but doubt this is new to anyone here)\n\n50% down from a $1000 investment leaves you at $500. If the market goes up 50%\nagain you'll have $750, not $1000 (50% of $500 is $250)\n\nTo get back to the initial…",
  "data/reddit-crypto/r/CryptoCurrency/comments/t451kn/the_vox_released_an_article_saying_bitcoin_is_the.json": "On April 24 , 2018 Vox released an article saying Bitcoin is the greatest scam\nin history\n[https://www.vox.com/2018/4/24/17275202/bitcoin-scam-cryptocurrency-mining-pump-dump-fraud-ico-value].\n\nThe article mostly talks about how Bitcoin is a huge pump and dump scheme and\nyou know how it's a…",
  "data/reddit-crypto/r/CryptoCurrency/comments/t488c7/we_should_give_laszlo_hanyecz_the_guy_who_bought.json": "Whenever we hear of his story it's usually a lesson about holding, being patient\nand not selling all your bag at one.\n\nHe's generally painted in a relatively negative light or at least painted as\nsomeone who made a terrible decision but the truth is at the time he did what\nnot many other people…",
  "data/reddit-crypto/r/CryptoCurrency/comments/t48uck/gavin_wood_kept_his_pomise_and_donated_5_million.json": "here is the link to the subscan address:\n\nhttps://polkadot.subscan.io/account/1x8aa2N2Ar9SQweJv9vsuZn3WYDHu7gMQu1RePjZuBe33Hv\n\ngavin's original tweet: https://twitter.com/gavofyork/status/1497914456118075394\n\nukraine's answer tweet:…",
  "data/reddit-crypto/r/CryptoCurrency/comments/t4bt7b/elizabeth_warren_is_yet_again_hitting_out_on.json": "Elizabeth Warren says crypto could be used to evade sanctions.\n\nCryptocurrencies risk undermining sanctions against Russia, allowing Putin and\nhis cronies to evade economic…",
  "data/reddit-crypto/r/CryptoCurrency/comments/t4e9dl/its_been_exactly_6_years_to_this_day_i_owned.json": "That's right, in this day, it's money. The Moola, the dinero, cash that's the\nmost important thing that I get out of cryptocurrency. All of that privacy\njargon is cool and all, but I just heard Gas will hit $10 by EOY in California\nwhich means it will be close to $7 on the east coast. My taxes on a…",
  "data/reddit-crypto/r/CryptoCurrency/comments/t4p880/hillary_clinton_i_was_disappointed_to_see_that.json": "> Former US presidential candidate – Hillary Clinton – criticized those\n> cryptocurrency trading venues that refused to stop servicing Russian-based\n> users. She once again opined that digital assets should be put under a\n> regulatory framework.\n> \n> Amidst the Russian invasion in Ukraine, Mykhailo…",
  "data/reddit-crypto/r/CryptoCurrency/comments/t4noch/stablecoin_staking_reaches_up_to_20_in_аpy_its.json": "Learned this the hard way during this crash. People who had big amount of\nstablecoins staked barely felt a thing and didn't panic as much as others.\n\nI'm not gonna go all in on stablecoins but it would be nice to ensure a chunk of\nmy wealth won't get wiped out each dip.\n\nAlthough I wouldnt get…",
  "data/reddit-crypto/r/CryptoCurrency/comments/t4y4v7/besides_if_we_were_going_to_voluntarily_freeze.json": "Following the requests from Ukrainian minister to sabotage ordinary users from\nCrypto exchanges\n\nKraken CEO Jesse Powell has a very good and fair point\n\n> Besides, If we were going to voluntarily freeze financial accounts of\n> residents of countries unjustly attacking and provoking violence around…",
  "data/reddit-crypto/r/CryptoCurrency/comments/t4yy7f/a_balanced_portfolio_should_consist_of_at_least.json": "I’ve been seeing a lot of people post about adding BTC and ETH to their\nportfolio and asking questions how they should split up their portfolio. In this\nthread, I will share my experience on the perfect breakdown.\n\nTo start, you want at least 70% in BTC. This is the granddaddy of all coins and\nyour…",
  "data/reddit-crypto/r/CryptoCurrency/comments/t4x2zz/new_decree_prohibits_leaving_russia_with_more.json": "Russians are no longer allowed to leave Russia with more than $10k in a foreign\ncurrency.\n[https://www.marketwatch.com/story/putin-signs-decree-to-prohibit-leaving-russia-with-more-than-10-000-in-foreign-currency-01646176225]\n\nNow imagine you want to leave Russia and bring money with you. You don't…",
  "data/reddit-crypto/r/CryptoCurrency/comments/t4u5vj/brave_browsers_bat_rewards_are_a_disaster_and_the.json": "Advertisers pay Brave to buy BAT to run ad campaigns on the Browser. Users can\nearn BAT by viewing these ads, and Brave keeps a cut (30%) to run their\noperations. This process has been steadily regressing, with more and more issues\nthis month and seems to be…",
  "data/reddit-crypto/r/CryptoCurrency/comments/t515jk/i_am_the_guy_whose_flights_have_predicted_the.json": "I don't know if you remember me but I posted about two months ago about how my\nflights have correlated with a sudden severe drop in the price in Bitcoin. I\nwanted to let the community know this time beforehand that I will be flying on\nSaturday to evacuate my current country and reunite with my…",
  "data/reddit-crypto/r/Bitcoin/comments/t4zh3j/why_is_it_mostly_men_who_are_under_30_trading.json": "According to a bitcoin-focused trading app, with tens of thousands of users,\nwomen and older investors are largely staying out of the crypto craze, leaving\nmainly young men to be the driving force behind crypto rallies and lows.\n\nThe overwhelming majority of people using the app to trade in bitcoin…",
  "data/reddit-crypto/r/CryptoCurrency/comments/t5bdwz/today_is_safemoons_1st_birthday_lets_look_at_what.json": "NOTHING.\n\nHah, just kidding. But it's not too far off from the mark.\n\n * Safemoon was released on the 2nd March 2021, after core developer\n   \"Safemoondev\" copy-pasted the BEE contract line for line, changing the\n   overall tax from 5% to 10% [https://editor.mergely.com/tNAqXd2g/].\n\n * Safemoon to…",
  "data/reddit-crypto/r/CryptoCurrency/comments/t51f4s/if_banks_freeze_our_accounts_how_does_crypto_help.json": "Sorry if I’m missing something obvious here, but it doesn’t add up. Everyone is\nsaying unbank yourself, but when you sell your crypto, where are you getting the\nfiat from to survive?\n\nMost countries and places don’t accept crypto as payment yet. Don’t most people\nsell their crypto on the exchange…",
  "data/reddit-crypto/r/CryptoCurrency/comments/t5hx7m/robinhood_finally_lets_me_transfer_my_eth.json": "I guess there are bigger problems than having too much ETH, but this is\nridiculous. Apparently, \"for my safety\" I cannot transfer more than $2000 in ETH\nper hour. With incredibly high-gas fees on Ethereum right now, it's obviously\nbest to avoid unnecessary transactions. No problem, I'm a hodlr…",
  "data/reddit-crypto/r/CryptoCurrency/comments/t5afmp/am_i_the_only_one_who_doesnt_like_how_more_and.json": "I understand when people mix crypto and politics when talking about regulations.\nSince I believe that crypto regulations are needed in order to achieve mass\nadoption. However, I think that things have gone too far recently.\n\nDuring last weeks (especially since the Ukraine-Russian war got into…",
  "data/reddit-crypto/r/CryptoCurrency/comments/t5uwgg/elizabeth_warren_is_at_it_again_she_is_now_urging.json": "I dont get her obsession with crypto. First she starts tweeting about how\nregulators need to increase scrutiny of crypto\n\nhttps://news.bitcoin.com/us-senator-urges-regulators-to-increase-scrutiny-on-crypto-as-it-risks-undermining-sanctions-against-russia/\n\n> As governments worldwide are placing…",
  "data/reddit-crypto/r/CryptoCurrency/comments/t5o5dz/crypto_exchanges_in_moral_dilemma_over_whether_to.json": "Does CZ, Binance and cryptocurrency\n[https://swapzone.io/currencies?utm_source=reddit&utm_medium=social&utm_campaign=promo]\nat large not have a responsibility to stand up and join the masses in levelling\neconomic sanctions? Are they providing Russia a means to circumvent financial\nsanctions? Are…",
  "data/reddit-crypto/r/CryptoCurrency/comments/t5wcvx/algorand_state_proofs_are_here_this_is_huge.json": "Blockchain ecosystems are like cities: each one provides value that draws people\nto visit — ranging from business opportunities, community, entertainment,\ninfrastructure, local governance, to plain personal preference. As the industry\nmatures, people will have more reasons to visit different…",
  "data/reddit-crypto/r/CryptoCurrency/comments/t60q2e/til_the_winklevoss_private_keys_are_stored_on_3.json": "According to Ben Mezrich’s biographical novel “Bitcoin Millionaires”, which\nchronicles the Winklevoss twins story...\n\nThe twins split their private key into 3 shards - referred to as “alpha”,\n“beta”, and “Charlie”. Which were then stored in fireproof / waterproof\nenvelopes, and stashed in…"
}