{
  "data/reddit-changemyview/r/changemyview/comments/pfkd0r/cmv_people_arent_smarter_than_people_50_years_ago.json": "Let me preface this with I think there are less uneducated folks than there used\nto be, but I just don’t think we’ve gotten much smarter. I’ve seen some things\nafter the olympics that say people are bigger, better, faster and stronger. It\ndidn’t say explicitly that we are “smarter” but it is…",
  "data/reddit-changemyview/r/changemyview/comments/pfm9tr/cmv_the_pandemic_wasnt_hard_for_all_of_us.json": "Please stop saying it was hard for \"all\" of us. If you were a millionaire no it\nmost probably wasnt hard for you. If you were from a abusive family and are\nstill studying/underage then yes for you it was hard. If you are someone who was\nfinacially in a hard place before pandemic yes its hard for…",
  "data/reddit-changemyview/r/changemyview/comments/pfn2lo/cmv_every_us_president_in_the_last_20_years_at.json": "I only really pay a lot of attention to current politics, so I'm going to stick\nto the guys that were president while I've been alive though I imagine a lot of\nthe past ones should be too. But for the sake of this post, I'm talking about\nBush, Obama, Trump and Biden. Which I think puts me in a good…",
  "data/reddit-changemyview/r/changemyview/comments/pfod3m/cmv_shaming_someone_for_being_short_is_worse_than.json": "Just wanna make it clear that I feel shaming is wrong and it shouldn't be done\nunless someone truly deserves it. But it's not possible to stop people from\ndoing it and hence my view.\n\nI feel this way due to how much control a person has over certain aspects of\ntheir body. A person has very minimal…",
  "data/reddit-changemyview/r/changemyview/comments/pfuxje/cmv_the_us_government_has_lost_all_credibility.json": "Afghanistan is just the latest in a string of wars that in retrospect were\ncompletely in vain & a waste of human life & money. Vietnam, Iraq, Afghanistan,\nall of these were failed wars. People in charge knew they were & didn't want to\nend them for various political reasons. We can see how bad the…",
  "data/reddit-changemyview/r/changemyview/comments/pfw3f1/cmv_there_is_no_point_in_telling_kids_that_there.json": "By \"kid\" I mean someone under the age of about 8.\n\nWe hear a lot of parents saying to their kids \"There's no such thing as boy\ncolours and girl colours.\"\n\nAnd I would be inclined to agree. There is nothing wrong with a boy liking pink\nor a girl liking blue and no child should feel left out for…",
  "data/reddit-changemyview/r/changemyview/comments/pfwskw/cmv_the_withdrawal_of_troops_from_afghanistan_was.json": "Let me start off by saying that I do think the way the withdrawal was done was\nabsolutely awful in every sense of the word and I think it should 100% have been\nhandled differently (maybe slower withdrawal or insuring the country was\nstable).\n\nI do think that overall getting US troops out of…",
  "data/reddit-changemyview/r/changemyview/comments/pfzq04/cmv_antivaxxerscoviddeniers_should_be_given_the.json": "I've seen this concerning sentiment on Reddit that antivaxxers and conspiracy\ntheorists should be subject to triage or sign some sort of waiver forfeiting\ntheir rights to treatment. I'm sure this stems from frustration with\nconservative propaganda and general psuedoscience treatments such as…",
  "data/reddit-changemyview/r/changemyview/comments/pg9ejg/cmv_overpopulation_is_an_issue_and_declining.json": "I have seen lots of people talk about how overpopulation is not an actual issue\nas the earth has enough space for lots more people and that we need to be\nremedying declining birthrates in the first world, and I very much disagree with\nboth of these claims. First off, the claim that the earth has the…",
  "data/reddit-changemyview/r/changemyview/comments/pgfb3h/cmv_the_fact_that_pharmaceutical_companies_would.json": "Let's say a chemist working for a pharmaceutical company discovers a new\ndrug/molecule that is cheap and easy to make, no side effects, and cures any\nillness - viral/bacterial infections, cancers, whatever. Let's say for the sake\nof argument that people could even make this drug themselves at home…",
  "data/reddit-changemyview/r/changemyview/comments/pgk6r7/cmv_nfts_are_internet_beanie_babies.json": "NFTs have a place in our society, such as game ticket sales or professional\ntrading cards. If a known company or artist like Banksy created an NFT, I could\nsee it having and holding value. Other than those exampled exceptions, I don’t\nsee how the collector fad will continue once the excitement…",
  "data/reddit-changemyview/r/changemyview/comments/pgkddz/cmv_no_one_wants_to_kill_babies_and_passing_laws.json": "I am not making this into an argument of whether or not a fetus is a baby, that\nis an entirely different discussion, my view is that attempting to ban abortions\ndoes not significantly decrease the number of abortions. With the recent SB8 law\npassed in Texas there is a lot of debate and outrage. The…",
  "data/reddit-changemyview/r/changemyview/comments/pgmipl/cmv_anyone_who_says_that_mask_mandates_infringe.json": "Both masks and underwear are pieces of fabric that cover the body in order to\nprotect others.\n\nAn argument why we have laws against nudity is that it is to protect public\nsafety...the safety from the trauma of seeing somebody nude.\n\nThe debate revolves around personal liberty vs public safety. The…",
  "data/reddit-changemyview/r/changemyview/comments/pgtgv0/cmv_it_is_foolish_to_try_to_punish_people_with.json": "I've seen many posts and comments saying \"restrict the voting rights of people\nwith beliefs I don't like\" and \"people with anti-vax beliefs should not be given\nhealthcare.\" Is it truly worth it to do such things?\n\nIt might seem favorable when your beliefs are popular and loved by the public.\nBut…",
  "data/reddit-changemyview/r/changemyview/comments/pgthwr/cmv_the_gender_pay_gap_is_largely_explained_by.json": "When I first started hearing about the general consensus that women are\nunderpaid compared to their male counterparts, (sometime around 2015) I was\nquick to believe that it was a result of deeply-rooted, institutional biases by\nemployers and business models.\n\nSince then, on several occasions, I have…",
  "data/reddit-changemyview/r/changemyview/comments/ph7bby/cmv_the_best_way_to_eat_a_banana_is_to_completely.json": "For some reason it seems like most people eat a banana like this 🍌. Namely they\npartially peel it and hold the banana by the peel while they eat it. A preferred\nway of eating a banana is to completely remove the peel and throw it away before\ntaking the first bite.\n\nThe first advantage of the full…",
  "data/reddit-changemyview/r/changemyview/comments/ph8pzw/cmv_the_usas_version_of_capitalism_is_just.json": "Man do Americans get a quick stiffy for something if you call it \"Capitalism,\"\nbut, here's the thing-\n\nIn medieval Europe, most people were Serfs. The Serf worked on the resources\n(land) that the Ruling Class Held by law, backed up by force (in that time,\ntheir men-at-arms). The Serf would produce a…",
  "data/reddit-changemyview/r/changemyview/comments/phawqg/cmv_its_perfectly_okay_to_snitch_on_someone_its.json": "If someone does something that’s worth reporting, fucking report it. Now, this\ndoesn’t mean report petty little bullshit, but I’ve seen situations that were\n100% worth reporting but the person was pressured into not reporting due to\nhaving a “snitch” label. For example, in 9th grade, my phone got…",
  "data/reddit-changemyview/r/changemyview/comments/phce5n/cmv_dinner_and_a_movie_dates_should_go_movie.json": "EDIT: I'd like to clear up that I'm not saying you do this with someone you\nbarely know. I'm thinking about this in terms of asking someone out on a date\nyou've known for a while or had one or two dates with already. Also, I'm really\nonly here to debate which should come first: dinner or a movie,…",
  "data/reddit-changemyview/r/changemyview/comments/phcs5f/cmv_us_society_will_normalize_living_with_your.json": "Young americans are suffering from both wage stagnation and exploding property\nprices. So they will no longer be able to buy/rent on their own, forcing them to\nlive with their parents.\n\nAnd this isn't a bad thing as many americans think, families living together\nwork mostly everywhere else in the…",
  "data/reddit-changemyview/r/changemyview/comments/phj7ue/cmv_people_shouldnt_get_off_as_easily_with_racism.json": "Let me ask you a question. How many times have you heard a racist comment\ntowards the white race? Maybe you’ve been in a conversation about spicy food and\nsomeone brought up how white people have low spice tolerances. The ironic thing\nis that you might hear those same people talk about racist…",
  "data/reddit-changemyview/r/changemyview/comments/pho71b/cmv_there_is_no_moral_difference_between_killing.json": "I’m a vegetarian and would hate to eat either. But I’ve seen several news\narticles recently about campaigners trying to pressure China and other Asian\ncountries into banning the killing and consumption of dogs.\n\nTo me, there is no moral difference between the two. I find it paradoxical to be\nin…",
  "data/reddit-changemyview/r/changemyview/comments/phs15z/cmv_a_stay_at_home_husband_is_no_different_than_a.json": "I am the breadwinner in my household. I am also the female. However, I am\nconstantly asked “what does my husband do for work” and when I tell them he\ndoesn’t work, I am always barraged with either looks of concern or questions\nlike “does it bother you that he doesn’t work?” Or similar gender…",
  "data/reddit-changemyview/r/changemyview/comments/phxdae/cmv_everyone_voting_in_favor_of_abortion.json": "It is extremely short sighted and apathetic to make safe abortions much more\ndifficult to obtain so that you can sleep better at night, while doing nothing\nto support the already problematic foster care system you are indirectly causing\nto be overwhelmed with unwanted/unsupported births. It is an…",
  "data/reddit-changemyview/r/changemyview/comments/phxm7v/cmv_instead_of_asking_society_to_change_language.json": "In America, we learn from an early age not to let other peoples mean words\neffect them, with slogans like \"sticks and stones may break my bones...\" along\nwith many others. This was so critical for me growing up as a minority in a\nracist southern state, if I didn't learn early on not to let other…",
  "data/reddit-changemyview/r/changemyview/comments/pi067y/cmv_weddings_are_overwhelmingly_for_women_and.json": "The idea of a formal wedding seems awful to me. The planning, the stress, the\ncost, the outdated ceremonial garbage of it all, the whole thing seems like a\nuseless waste of time and money. All the preparation and ceremony is nightmarish\nto me. MAYBE I could see the appeal if the wedding was way more…",
  "data/reddit-changemyview/r/changemyview/comments/pi0ipt/cmv_the_invention_of_the_internet_has_made_it.json": "Preface: I believe that as we propel ourselves into a more technologically savvy\nfuture, our generations to come will/should subjectively be a lot more\nintelligent.\n\nThink about it. We live in the most technologically advanced era in human\nhistory, with a plethora of information available at our…",
  "data/reddit-changemyview/r/changemyview/comments/pi2lz6/cmv_it_should_be_illegal_for_a_company_to_post.json": "This should be the basic requirement for a Employer Employee relationship, The\nEmployer says how much they are willing to pay for their position and the\napplicant's decide if they are willing to that job for the compensation.\n\nNone of this bullshit of either not saying the pay or requiring copious…",
  "data/reddit-changemyview/r/changemyview/comments/pi4gi7/cmv_québec_is_for_all_practical_purposes_a.json": "So for starters. This is not an argument for Québec separatism. Rather, this is\na normative claim that Québec is already effectively an independent country\n\nContext: I am a lifetime Anglophone Torontonian who is moving to Québec City\nsoon for work. I, for various reasons, always saw Québec as a semi…",
  "data/reddit-changemyview/r/changemyview/comments/pictll/cmv_individual_sustainability_is_meaningless_the.json": "As a disclaimer, I’d like to clarify my own actions as an individual towards\nsustainability: I’m aware that I’m still very far from being a zero-waste\nperson, but I consider myself as someone above the average: E.g., I use recycled\npaper toilet and napkins, metal straws, reuse shopping bags, turn…",
  "data/reddit-changemyview/r/changemyview/comments/pif9g8/cmv_human_civilization_will_collapse_within_my.json": "A warning at the outset: if you’re prone to anxiety and depression, especially\nabout existential risk and/or the impacts of climate change, please take care of\nyourself and maybe avoid this discussion entirely.\n\nThrowaway because talking about this makes me feel like a crazy person. Sorry\nabout all…",
  "data/reddit-changemyview/r/changemyview/comments/pigmgv/cmv_parents_with_obese_children_should_be_charged.json": "I'm not talking about kids who are a little heavy, I'm talking about kids who\nare morbidly obese. They don't understand the issues obesity can cause later in\nlife and they don't understand the importance of physical health at a young age.\n\nIts incredibly irresponsible of the parent to let their…",
  "data/reddit-changemyview/r/changemyview/comments/pik7zy/cmv_if_others_around_me_refuse_to_get_the_covid.json": "I live in a part of the United States where the number of unvaccinated people is\nvery high. I received my first and second covid shots back in March and April.\n\nResearch shows that a third shot / booster has a strong protective effect for\npeople who have already been vaccinated. There is already…",
  "data/reddit-changemyview/r/changemyview/comments/pilxup/cmv_social_media_can_be_one_of_the_worst_parts_of.json": "This is coming from someone who has been using social media for years. Some\nbeyond screwed up people have platforms to express some of the most vile\nbehaviors ever.\n\nFor anyone watching the US Open, I'm sure you know about the abuse Sloane\nStephens has received. For anyone that has not, after tennis…",
  "data/reddit-changemyview/r/changemyview/comments/pim01q/cmv_i_dont_think_theres_going_to_be_a_way_to.json": "On an individual basis I can understand the LGBTQ community.\n\nYou wanna date/marry someone of the same sex? Sure who cares. You want to\nidentify as a different gender? Doesn’t effect me, you do you. You want to go by\na different pronoun? Ok fine.\n\nBut then i can see issues and contradiction start to…",
  "data/reddit-changemyview/r/changemyview/comments/pixtgh/cmv_mr_beasts_prizes_are_fake.json": "Over the weekend the YouTube algorithm recommended I watch this video:\n\nhttps://www.youtube.com/watch?v=zxYjTTXc-J8\n\nThe premise is that one hundred people are put in a circle and the last to leave\nwill be awarded half a million dollars. Throughout the video the contestants\nplay games to either…",
  "data/reddit-changemyview/r/changemyview/comments/piyhu3/cmv_all_arguments_about_abortion_boil_down_to.json": "Everyone agrees that ending the life of a 1 year old is murder. Abortion\ndisagreements exist because most don't agree on how far to dial that back and\nnot consider it murder.\n\nI think most everyone agrees that after the child is born, we would convict a\nperson of murder to end the \"life\". What if we…",
  "data/reddit-changemyview/r/changemyview/comments/pj1yc3/cmv_the_use_of_plastic_surgery_and_hormone.json": "EDIT: I have given deltas to arguments based on the idea that gender dysphoria\nis a medical ailment with medical treatments. I had been hesitant to label it as\na disease in my post because I had been told in the past that labeling it as a\ndisease is dangerous because being gay used to be considered…",
  "data/reddit-changemyview/r/changemyview/comments/pj22jw/cmv_abortion_is_no_different_than_pulling_the.json": "How is it that people can say abortion is immoral or murder when it is\nessentially the same concept as pulling the plug on someone who is brain dead?\nWhen you remove a fetus from a body it is not able to survive on its own the\nsame way if you remove someone who is brain dead from life support their…",
  "data/reddit-changemyview/r/changemyview/comments/pj2veq/cmv_boys_shouldnt_be_circumcised.json": "Change my view: Circumcision of baby boys is genital mutilation.\n\nBackground: about 70% of American boys are circumcised each year. This almost\nexclusively occurs shortly following birth. While circumcision prevents smegma\n(dick gunk) from building up, so does proper hygiene. Circumcision has…",
  "data/reddit-changemyview/r/changemyview/comments/pjcj0g/cmv_australia_isnt_a_democracy_anymore.json": "After reading about this disturbing new bill that only took 24 hours to be\npassed through government, I decided it was a good time to do a stock take on\nAustralians' current political system:\n\n'The Surveillance Legislation Amendment (Identify and Disrupt) Bill 2020 gives\nthe Australian Federal…",
  "data/reddit-changemyview/r/changemyview/comments/pjibuc/cmv_most_of_the_economic_issues_affecting.json": "- The population in the developed world is getting older\n\n- The developed world is becoming increasingly urban\n\n- The developping world is now wealthier and more educated\n\n- Women have entered the workforce\n\n\n\nThat's why politicians serve the interest of boomers: in the UK's last election\nhalf of…",
  "data/reddit-changemyview/r/changemyview/comments/pjl7fb/cmv_teenagers_and_kids_should_be_less_exposed_to.json": "I'm a 17 year old boy recently graduated from high school in the middle East.\nSince my graduation, it's been summer holidays and covid has been terrible so I\nhave to stay in home, which means more internet and more TV. I tune in and it's\nlike that: wildfires in Turkey and Greece, flood in China,…",
  "data/reddit-changemyview/r/changemyview/comments/pjoh6c/cmv_gender_identity_is_one_of_the_most_conflated.json": "Lately it seems like everyone is discussing gender and all of its facets. I\nshould begin by saying I support most of the LGTBQ facets. Sexual orientation\nmakes total sense to me. You love and want to have sex with whoever who want. No\nbiggie. But when it comes to gender identity and everything…",
  "data/reddit-changemyview/r/changemyview/comments/pjqm2y/cmv_now_that_taliban_are_in_power_afghanistan.json": "So, Taliban took over the country. Their agenda is to destroy any military\nopposition, establish total control with raw power and plunder any available\nresources. They absolutely have no care for economy or any sort of well-being\nfor population other than what would come from humanitarian aid.\n\nWide…",
  "data/reddit-changemyview/r/changemyview/comments/pjqnd1/cmv_one_cannot_have_a_genuine_opposition_to.json": "To start and for the sake of transparency: I am a pro-choice male living in a\nstate within the USA where abortion rights are codified into law.\n\nThe response I often see from pro-life individuals who are accused of \"not being\npro-life, but pro-birth\" is that in their personal deep help…",
  "data/reddit-changemyview/r/changemyview/comments/pjty9f/cmv_the_size_and_spending_on_our_military.json": "The United States has either tied (stalemate) or lost every ‘war’ it’s fought in\nsince WW2. And yet we have the biggest military world wide, we are the biggest\nseller of arms and ammunition, we spend more on our military than all other\nwealthy western countries. Having the most advanced as well as…",
  "data/reddit-changemyview/r/changemyview/comments/pjy8tg/cmv_if_you_believe_abortion_should_be_illegal_on.json": "If we are going to consider those fetus' human beings which need protection from\n\"murder\" or whatever form of child abuse you want to call it, then that fetus\nshould be legally treated exactly as a child. This means it is a citizen and\nit's parents are protected from deportation.\n\nIt means child…",
  "data/reddit-changemyview/r/changemyview/comments/pjyu9v/cmv_joking_about_the_deaths_of_unvaccinated.json": "I’m fully vaccinated, I will be getting a third dose, and I wear my mask\ndiligently. I go above and beyond to keep myself and my family safe from COVID.\nI wipe down all groceries and packages. I strip out of my scrubs and immediately\nthrow them in the wash as soon as I get home from my shifts in the…",
  "data/reddit-changemyview/r/changemyview/comments/pkejam/cmv_i_dont_buy_the_whole_we_could_have_stopped.json": "With the WHO announcing Covid is likely here to stay, I feel like the caveat\nthat “we had an opportunity early on to stop this”, is kind of bullshit.\n\nSure - in a perfect world where humans didn’t need to eat, get medicine, go to\nthe hospital, interact with their kids, call the police, check on…",
  "data/reddit-changemyview/r/changemyview/comments/pkey1o/cmv_to_restrict_abortion_on_purely_religious.json": "The 1796 Treaty of Tripoli states that the USA was “in no way founded on the\nChristian religion.”\n\n75% of Americans may identify as some form of Christian, but to base policy (on\na state or federal level) solely on majority rule is inherently un-American. The\nfact that there is no law establishing a…",
  "data/reddit-changemyview/r/changemyview/comments/pks7hd/cmv_its_not_erasing_history_to_remove_statues.json": "So it is often said that removing Statues erases history as, \"It removes\ndiscussion\" about the figure in question whether it be a Robert E Lee or\nChristopher Columbus or any other controversial figure of which said Statue was\nremoved. However it is can long be said that it is not erasing history…",
  "data/reddit-changemyview/r/changemyview/comments/pkx184/cmv_the_western_world_needs_a_cultural_shift_on.json": "I think it is safe to say that by this point in the pandemic, everyone in the\nUnited States possesses a mask. As an American, prior to the pandemic I had\nnever seen anyone wearing a mask outside of a medical or hazardous work\nenvironment situation… except while overseas. When I was stationed in…",
  "data/reddit-changemyview/r/changemyview/comments/pkz0ap/cmv_a_fetus_being_alive_is_irrelevant.json": " 1. A woman has no obligation to provide blood, tissue, organs, or life support\n    to another human being, nor is she obligated to put anything inside of her\n    to protect other human beings.\n\n 2. If a fetus can be removed and placed in an incubator and survive on its own,\n    that is fine.\n\n 3.…",
  "data/reddit-changemyview/r/changemyview/comments/pl3456/cmv_if_being_unvaccinated_should_bar_you_from.json": "The principal argument in favour of forgoing medical treatment for unvaccinated\npeople is that, because of their refusal to take a 100% free prophylactic\nmeasure, people who find themselves ill through no fault of their own might be\nplaced in jeopardy due to hospital beds being over-occupied with…",
  "data/reddit-changemyview/r/changemyview/comments/ple99p/cmv_bidens_vaccine_mandate_has_a_multitude_of.json": "The Supreme Court already ruled 7-2 on the side of compulsory vaccines in 1905.\nThe court decided that the right to individual liberty in regards to vaccination\nis not above the rights of the collective. This is just one case of precedence\nout of dozens.\n\nJacobson vs.…",
  "data/reddit-changemyview/r/changemyview/comments/pljvmn/cmv_as_long_as_neighborhood_schools_are_the_norm.json": "I used to be a teacher. I often hear people complain that education should be\nequal and people shouldn't have to move to give their kids a great education.\n\nIn theory, I agree. But its just not realistic for a number of reason.\n\nBiggest one is that states set their own standards. When some states…",
  "data/reddit-changemyview/r/changemyview/comments/plpuew/cmv_colleges_are_becoming_more_and_more_of_a.json": "EDIT: ASIA is a big geographical factor, as I've realised from conversations in\nthe comments, for any validity to this view.\n\nWho am I? Final year STEM field dual degree undergrad at a supposedly\nprestigious university in a highly populated Asian country.\n\nColleges and their ever growing offerings…",
  "data/reddit-changemyview/r/changemyview/comments/pm0m2x/cmv_the_original_method_is_better_than_common.json": "Why was it changed? Who changed it? I really need someone to tell me what's so\nspecial about this new way of doing simple maths. I don't understand! Well... I\ndo understand how it's done but I don't understand why it's better than the\noriginal method. I mean, if it isn't broken don't fix it am I…",
  "data/reddit-changemyview/r/changemyview/comments/pm3vjc/cmv_the_rich_of_the_middle_east_do_not_give_a.json": "As in all cases exceptions do apply. But as I see the rich middle eastern\ncountries are in their own self re-enforcing bubble of luxury and grandiose.\n\nFor example, the citizens of third world countries of Nigeria, India get paid\nfar little as compared to their foreign counterparts in the middle…",
  "data/reddit-changemyview/r/changemyview/comments/pm48p2/cmv_almost_irregardless_of_opinion_if_we_expect.json": "I was having this conversation with my gf today, who is asian (which is\napplicable, explained later.) I basically take the viewpoint that no matter how\nabhorrent, unless in the most extreme circumstances, should you condemn\nsomeone’s line of reasoning/ morality for almost any given topic. To put…",
  "data/reddit-changemyview/r/changemyview/comments/pm9gph/cmv_humane_euthanisia_should_be_legal.json": "For context, I work with animals for a living. When a patient is horribly sick\nwith no chance of recovery, we recommend euthanasia. This is the compassionate\nchoice. I've seen what happens when people don't elect for this option. The\npatient gets sicker, suffering over days or weeks until they…",
  "data/reddit-changemyview/r/changemyview/comments/pmm672/cmv_banks_should_not_be_too_big_to_fail.json": "Promoting things like being \"too big to fail\" is rewarding horrible behavior and\nallowing companies to do whatever they like regardless of how it effects the\npopulation, workers, market, business, government, etc. You are saying \"ah\nshucks, you deliberately went out of your way to screw folks over…",
  "data/reddit-changemyview/r/changemyview/comments/pmr0qs/cmv_the_body_positivity_movement_is_extremely.json": "I'm sorry if someone else posted this but I'm still really annoyed. I'm closing\nin on 3 months of successful Weight loss journey and it's boiling my blood when\nI see the body positivity movement. It practically encourages people to keep\neating junk food and that it is okay to be obese and do nothing…",
  "data/reddit-changemyview/r/changemyview/comments/pmr441/cmv_i_shouldnt_have_to_even_bother_to_think_about.json": "Ridiculous. I made a few crypto exchanges all under 100USD and then I heard that\nI have to f***ing file for a 100 dollar profit even if the tax is 0. Absolutely\nridiculous. Obviously the IRS isn't going to hunt me down not filing this small\namount, in fact it'd cost them more to do so... but the…",
  "data/reddit-changemyview/r/changemyview/comments/pmyr6n/cmv_outdoor_cats_are_an_unacceptable_invasive.json": "People who let their cats outside are willingly allowing their animal to do\nirreversible harm on their environment. It’s so commonplace and widespread to\nhave a cat outside people joke and laugh about their cats being “killers”\nleaving native birds and reptiles on their doorstep. Occasionally they…",
  "data/reddit-changemyview/r/changemyview/comments/pn1tiz/cmv_climate_change_is_impossible_to_solve_because.json": "When I look at typical suburban neighborhoods, I see exactly why we ABSOLUTELY\nCANNOT solve climate change.\n\nThe people in these neighborhood are normal. They go to work every day, then\ncome home and spend time with their kids.\n\nBut they live in large suburban McMansions (like 5000 sft) and drive…",
  "data/reddit-changemyview/r/changemyview/comments/pn5xmu/cmv_trans_athletes_should_not_be_allowed_to.json": "Combat sports are about inflicting damage to the point your opponent can no\nlonger continue. It goes without saying that strength and athleticism play a\nhuge part in fighting. I believe it’s not only immoral, but dangerous for trans\nathletes (mtf) to be allowed to compete versus peers that don’t…",
  "data/reddit-changemyview/r/changemyview/comments/pn7xmc/cmv_vatican_city_shouldnt_beshouldnt_be.json": "e: my title means \"Vatican City shouldn't be a sovereign state/Vatician City\nshouldn't be recognized as a sovereign state\", I now realize it looks really\nweird the way I typed it above.\n\nI understand that under the constitutive theory of statehood, VC is a state\nbecause it is recognized as such by…",
  "data/reddit-changemyview/r/changemyview/comments/pnejil/cmv_covid_antivaxxers_arent_worried_about_the.json": "The ridiculous anti-vaccine hysteria on the right is NOT a result of concern\nover the shot. Their excuses from the Bill Gates microchip to George Soros\nfunding or every other variation of this alleged massive conspiracy is simply to\nprovide cover for their dislike/hatred of the left who are running…",
  "data/reddit-changemyview/r/changemyview/comments/pnhgfd/cmv_the_folks_over_at_rhermancainreward_are_sick.json": "One look at that sub and it looks like everyone is glorifying covid deaths of\nthe unvaccinated. The people were mothers, fathers, daughters, sons. Sure they\nshould’ve gotten vaccinated but why are we celebrating their deaths? It’s\nliterally in the name of the sub, its a “reward”. I mean what the…",
  "data/reddit-changemyview/r/changemyview/comments/pnhrn0/cmv_in_a_representative_democracy_there_should_be.json": "So, it is often taken for granted that the US (I will be using the US for this\npost, but this can be applied to any representative \"democratic\" body) that we\nhave representative democracy. We do not.\n\nIf you \"vote\" for a candidate in a representative body that loses their\nelection, you have no voice…",
  "data/reddit-changemyview/r/changemyview/comments/pnor29/cmv_corporal_punishment_is_a_form_of_child.json": "CMV: Corporal punishment is a form of child maltreatment and should be illegal\nin the US.\n\nAre people against prohibiting corporal punishment because they think our\ngeneration is full of “privileged pansies” or are people against prohibiting\ncorporal punishment because their parents engaged in this…",
  "data/reddit-changemyview/r/changemyview/comments/pnpggo/cmv_tenochtitlan_was_far_more_impressive_than.json": "It was literally built on water. They had a mail system that could send messages\nsome 200 miles within 24 hours l, fastest postal service in the world. In fact\nfaster than it takes to transport mail this very day. 15 story pyramids.\nGuaranteed Free Education for all of its citizens regardless of…",
  "data/reddit-changemyview/r/changemyview/comments/pnthwe/cmv_abolishing_the_police_is_a_lazy_and.json": "Im not arguing that police always have a positive impact on communities, and not\ndenying that violence and racism are relatively widespread issues that stem from\npolicing.\n\nIm purely comparing the flawed structure of policing with the actual\nalternatives:\n\n1) privatised security forces. Justice is…",
  "data/reddit-changemyview/r/changemyview/comments/pnu8hg/cmv_every_adult_person_if_they_revealed_all_their.json": "I don't care if it's your sweet grandma or that super nice friend of yours. If\neveryone revealed all their true thoughts about everything, whether that be\npolitics, race, thoughts on other people, or anything else, there would be\nsomething that society would \"cancel\", \"shun\" and \"demonize\" that…",
  "data/reddit-changemyview/r/changemyview/comments/pnv4mp/cmv_it_is_completely_justified_to_hate_the_new.json": "I sometimes I hate how American most of Reddit is. I'm Indian and I have taken\nthe vaccine which is available here and I'm also wearing masks all the time\nbecause India.\n\nBut, even though I understand how Work From Home is awesome (and I'm for it\ncompletely) I just can't feel the same way about…",
  "data/reddit-changemyview/r/changemyview/comments/pnzsny/cmv_people_should_stop_confusing_the_words.json": "One thing that really irks me about American political discourse is the way that\npeople use the words liberal and leftist as though they were synonyms. I’m going\nto offer my own discombobulated explanation of why I think this came to pass and\nalso my own view of why it is important to return to…",
  "data/reddit-changemyview/r/changemyview/comments/po2g1h/cmv_the_us_government_should_reform_their.json": "I believe that the US government has proven itself to be a poor steward of the\nmoney generated from income tax. 50% of the US Government's income is generated\nfrom income taxes:\nhttps://www.taxpolicycenter.org/briefing-book/what-are-sources-revenue-federal-government\n\nGovernment waste is atrocious,…",
  "data/reddit-changemyview/r/changemyview/comments/po7v0x/cmv_rfemaledatingstrategy_is_one_of_the_most.json": "The major irony here is that if one of them reads this, they would get on their\npedestal and scoff. Probably celebrate because it's just another \"example\" of\nwhy they're around. Yeah...okay...\n\nThere's much hypocrisy and terrorism to go around there, but the most\nhate-filled rhetoric I've seen is…",
  "data/reddit-changemyview/r/changemyview/comments/poflki/cmv_ken_jennings_hoe_response_on_jeopardy_should.json": "During his 2004 run as champion on Jeopardy!, Ken Jennings infamously responded\n[https://youtu.be/KoPFkjF-Bdo] \"What's a hoe?\" to the following clue in the\ncategory \"Tool Time\":\n\n> This term for a long-handled gardening tool can also mean an immoral pleasure\n> seeker.\n\nAlex Trebek judged the…",
  "data/reddit-changemyview/r/changemyview/comments/pog058/cmv_unpeeled_or_only_partially_peeled_shrimp_clam.json": "When you sit down to a meal, I think we can all agree that it should be a\nrelaxing, pleasant experience. The last thing someone should have to do is\nperform surgery on their pasta. Yet, that is often exactly what is required of\ndiners when a restaurant offers pasta with shrimp that have not been…",
  "data/reddit-changemyview/r/changemyview/comments/poqszc/cmv_industry_standards_for_plussized_beauty_only.json": "Plus-sized modeling has become a mainstream source of women's fashion , but\nwhere are all the plus-sized men models?\n\nI was watching Hulu yesterday when an advertisement popped up showing a group of\nplus-sized women dancing for an Old Navy commercial. I was thinking about the\ncommercial for a brief…",
  "data/reddit-changemyview/r/changemyview/comments/poraq3/cmv_genderneutral_pronouns_reinforce_the_gender.json": "Gender roles are outdated and there is no realistic reason in America for people\nto confine to a gender norm or gender roles. It is socially acceptable today in\nmainstream culture for both men and women to do many things that once\ntraditionally belonged to only one gender. For instance, it is…",
  "data/reddit-changemyview/r/changemyview/comments/potgtg/cmv_in_most_cases_people_that_choose_to_home.json": "Even with a structured standard curriculum, parents are only going to be able to\nteach their kids what they know or think they know. What they teach is going to\nbe biased according to their own personal beliefs and prejudices with no\nalternative views presented or discussed. Parents who are anti…",
  "data/reddit-changemyview/r/changemyview/comments/poub0s/cmv_youth_and_high_school_sports_have_become_way.json": "I’m going to come right out and date myself. When I graduated from high school\n20 years ago, football season started in the fall and ended sometime in\nDecember. Basketball season started afterwards, and then a lot of kids ran track\nin the spring. I remember they had football camps in the summer,…",
  "data/reddit-changemyview/r/changemyview/comments/poulih/cmv_exposure_to_misinformation_and_invalid.json": "John Stuart Mill said it best when he argued 160 years ago, in his classic On\nLiberty, that it is impossible to truly know if 'x' is false if we refuse to\nhear any arguments or evidence purported to be in favor of 'x'. If, for example,\na given society were to decide that holocaust deniers and anti…",
  "data/reddit-changemyview/r/changemyview/comments/povc3u/cmv_my_reduced_participation_in_capitalism_and.json": "I currently have been trying to reduce putting my money towards businesses like\nAmazon with known, unethical practices. I understand that morality and ethics\nare subjective measures, but I personally deem businesses with evidence of\nworker exploitation, poor wages, poor working conditions, illegal…",
  "data/reddit-changemyview/r/changemyview/comments/pow3r4/cmv_forcing_people_to_use_inclusive_language_is.json": "Disclaimer: I support everybody's right to use whatever language, pronouns and\neuphemisms they want. However, I won't always return the favour. I don't do this\nout of spite or hate, I'll explain.\n\nIf at any point in the post you think I'm joking or making a parody of it, I'm\nnot. Sometimes I'm just…",
  "data/reddit-changemyview/r/changemyview/comments/pp125e/cmv_allison_macks_sentence_of_3_years_for_sex.json": "Sentencing guidelines were 14-17 years. She gets 3 years and community service\nfor charges of sex trafficking, sex trafficking conspiracy and forced labor\nconspiracy. She was second in command of NXIVM, lured women into sex slavery,\neven branding some with her own initials, a ritual she created.…",
  "data/reddit-changemyview/r/changemyview/comments/pp7y6s/cmv_this_trend_of_college_kids_glorifying.json": "I recently began my first year at university and was shocked to see how many\npeople identify as communists and socialists. As someone who’s family comes from\na communist country, I don’t think they quite understand what actually living in\ncommunism is like. No one who actually lives in a communist…",
  "data/reddit-changemyview/r/changemyview/comments/pp8z8j/cmv_implementation_of_any_extremist_ideology.json": "It doesn't matter which part of the spectra we talk about; Communism, Fascism,\nDominionism, Salafism, absolute Monarchy, etc.\n\nAll of these ideologies being implemented resulted in worse living standards,\ndestruction of cultural heritage, destruction of personal freedoms, social\nstagnation, economic…",
  "data/reddit-changemyview/r/changemyview/comments/ppal4s/cmv_there_is_no_ethical_way_to_become_a.json": "First of all, income inequality. The structure of the economy allows amounts of\nwealth to be distributed unevenly. Rather than money going towards the cost of\nlabour, it goes straight to the aleady very wealthy. The more demand of these\nproducts, the more jobs for minimum wage workers and more money…",
  "data/reddit-changemyview/r/changemyview/comments/pphd5n/cmv_if_we_solve_the_problem_of_food_deserts_we.json": "One in nine people in the U.S. used SNAP — the Supplemental Nutrition Assistance\nProgram (also known as food stamps, the largest food assistance program for\nlow-income Americans in the nation) — in 2019, according to the Center on Budget\nand Policy Priorities. SNAP benefits vary depending on the…",
  "data/reddit-changemyview/r/changemyview/comments/ppj0r2/cmv_nicki_minaj_is_not_somebody_we_should_be.json": "I’m so confused as to why people are regarding any medical information from\nNicki Minaj? Seriously, why?\n\nShe has no formal education, specifically in science. The government, Fauci, and\nWhite House shouldn’t even be entertaining conversations around her. In fact,\nshe has had enough surgeries where…",
  "data/reddit-changemyview/r/changemyview/comments/pplh60/cmv_a_criminal_defendants_civil_liberties_and_due.json": "Every time there's a news story involving a crime and a person who isn't\npunished to the degree that the public wants him or her to be, there's bound to\nbe at least one of the following comments, or some variation thereof:\n\n\"This paedophile 'got off' on a technicality! How is this fair?\"\n\n\"How can…",
  "data/reddit-changemyview/r/changemyview/comments/ppn253/cmv_defunding_the_police_will_only_worsen_the.json": "First things first: - Not saying we shouldn't fund mental health services. We\nabsolutely should. - Not saying police should be allowed to buy all the military\ntoys. We fund them so obviously we can decide what they're allowed to buy and\nuse. - Not saying we should reward the bad behavior and simply…",
  "data/reddit-changemyview/r/changemyview/comments/ppqrgn/cmv_nuclear_energy_is_a_viable_tool_to_revert.json": "I totally get that nuclear power isn't ideal and it does have its flaws, but as\nI see most concerns with it can be solved: that it produces radioactive waste,\nthat there have been some ugly nuclear disasters in history, that supposedly it\ncan be used to develop nuclear weapons and that it is…",
  "data/reddit-changemyview/r/changemyview/comments/ppscg4/cmv_20_years_in_the_middle_east_wouldve_been.json": "The cartels of Mexico are a big source of drugs for the US and Canada. They rule\nMexico like governments, tax drug farmers like governments, and some set up\nutilities like governments. 20 years fighting the cartels with the might of the\nmilitary would have,\n\n1) Made Mexico, a (sort of) ally of the…",
  "data/reddit-changemyview/r/changemyview/comments/pq2cmn/cmv_being_in_the_military_doesnt_make_you_a_hero.json": "I am a military veteran. I served during the Vietnam war. I see nothing heroic\nin military service. I see mostly kids from disadvantaged socio-economic\nbackgrounds joining the military to escape their dead end lives. And the\nmilitary offers that, there is no doubt. I served and I'm glad I did.…",
  "data/reddit-changemyview/r/changemyview/comments/pq39dr/cmv_with_very_few_exceptions_single_family_houses.json": "The housing situation in the United States is out of control. I'm looking at\nbuying my first home in the next few years in Western Washington and the\nsituation there is ridiculous. Houses are selling for tens of thousands over\nasking, realtors are getting many offers the same day the house is…",
  "data/reddit-changemyview/r/changemyview/comments/pqep7w/cmvi_am_terrified_of_dying_please_change_my_view.json": "Hello, I was really hoping someone would be able to change my view on this\ntopic. I have lived a good life so far, I am only 25 years old and have much\nlife ahead of me. I am loved by my family, friends and girlfriends. But I am\nabsolutely terrified of death. The never ending nothingness is…",
  "data/reddit-changemyview/r/changemyview/comments/pqh0wl/cmv_the_lgbt_community_is_extremely_unwelcoming.json": "Starting this off with saying that I’m very pro-LGBTQA+ when it comes to\nindividuals and I understand that some people have been able to find comfort in\nthese spaces where they haven’t been able to before. However, I personally have\nfound that the LGBT+ community is extremely unwelcoming/unaccepting…",
  "data/reddit-changemyview/r/changemyview/comments/pqnr3d/cmv_the_problem_isnt_that_bezos_is_a_billionaire.json": "So here is how I see it. Bezos is the richest person out there. I'm OK with that\nbecause he revolutionized a huge part of the economy. Whether you are OK is a\ndifferent argument, there are things he does that I despise, which for this\ndiscussion I will ignore. His wealth is due to the stock he owns…",
  "data/reddit-changemyview/r/changemyview/comments/pqsbvi/cmv_there_is_nothing_wrong_with_american_gun.json": "I am a Marxist, and Marx himself said \"Under no pretext should arms and\nammunition be surrendered; any attempt to disarm the workers must be frustrated,\nby force if necessary\".\nI believe that most of the shootings that take place in America are due to the\nsocial conditions surrounding them; schools…",
  "data/reddit-changemyview/r/changemyview/comments/pqtstg/cmv_youtube_should_allow_comment_dislikes_to.json": "I think most Youtube users have realized for a long time that YouTube comments\nhave a \"like\" and \"dislike\" button setup where the dislike button does not\nactually seem to do anything. At best it possibly affects the comment's rating\nin the background, but it does not affect the comment's shown…",
  "data/reddit-changemyview/r/changemyview/comments/pr5izr/cmv_more_support_should_be_offered_to_those.json": "I'm not sure what it's like for other countries, but in the UK there is free\ntreatment available for people suffering with mental health issues. That said,\nthis section of the NHS is woefully underfunded (just like all the other sectors\nI suppose). As is logically the case, all of these treatments…",
  "data/reddit-changemyview/r/changemyview/comments/prex47/cmv_the_best_part_of_a_drumstick_ice_cream_cone.json": "That hardened, cheap, tiny bit of chocolate stuck in the bottom the cone is\ndelicious. Sure, the ice cream is good, and the nuts…the filling, etc. but I’m\npretty sure the only reason I buy drumsticks is for that last tiny bite of\nchocolate and waffle cone mixed together. If I could just buy waffle…",
  "data/reddit-changemyview/r/changemyview/comments/prgxtg/cmv_the_american_healthcare_system_is_broken.json": "I am an american studying to going the american healthcare system and everything\nI see is how bad insurance has hurt the system and made it so doctors are\ndrowned in paperwork and erecords, and cannot spend quality time with their\npatients anymore.\n\nI hear a lot about moral injury and how burnout is…",
  "data/reddit-changemyview/r/changemyview/comments/prsmez/cmv_its_not_okay_to_punch_above_like_how_some.json": "We have a couple of Swedish celebrities who have posted \"I hate men, HATE HATE\nHATE!\" on Instagram, twitter etc.\n\nThey all use the same excuse, \"it's never wrong to punch upward as a minority\ngroup, besiiiides we never talk about individuals!\".\n\nI don't agree. if we are ever gonna reach a point…",
  "data/reddit-changemyview/r/changemyview/comments/prwvmz/cmv_god_is_just_santa_claus_for_adults.json": "You believe in Santa Claus and all the \"magic\" and ignore the obvious illogical\nissues with it because you get presents. Then when you finally understand the\nworld a little more, you question it and figure out Santa isn't real. God is the\nsame way for all religions created by humans. You ignore all…",
  "data/reddit-changemyview/r/changemyview/comments/prymcu/cmv_countries_are_slowly_becoming_more_and_more.json": "TL;DR: Both government and private companies are eroding civil liberties and\npersonal freedoms in most countries.\n\nWith the Patriot Act in the US and similar laws being passed in other countries,\nGovernment surveillance on private citizen with little to no justification,\nGovernments employing…",
  "data/reddit-changemyview/r/changemyview/comments/psjpnx/cmv_culture_is_not_defined_by_your_skin_colour.json": "Lately I have heard the phrase ‘white culture’ quite a bit, and it’s really\nconfusing me. Isn’t it a little racist to generalize all of white people into\none culture? Wouldn’t it seem a little off if I were to say that all African\nAmericans share the same culture? Let’s take a white person who grew…",
  "data/reddit-changemyview/r/changemyview/comments/psjsdd/cmv_the_trend_in_moviesseries_that_glorifies_it.json": "Title explains itself.\nThe only exceptions to this are the good ol' kick in the balls in self defense\n(or if a guy is being extremely sexist/ sexually harassed a woman), or\ncastration in revenge for rape.\n\nIn any other case it's just sexual violence and humiliation that is equally\nsevere as groping…",
  "data/reddit-changemyview/r/changemyview/comments/psk8ol/cmv_theres_no_such_thing_as_a_religious_exemption.json": "There’s no such thing as a “religious exemption” from vaccines.\n\nLet me qualify: Idon’t have any intimate knowledge of other faiths, but I do\nknow the Bible and Christian doctrine well, and the Bible doesn’t say shit about\nvaccinations.\n\nThe Bible does say plenty about loving your neighbor, and it…",
  "data/reddit-changemyview/r/changemyview/comments/pspbmk/cmv_paparazzi_should_be_illegal.json": "I recently saw that old clip of Kanye chewing out some paparazzi for being at\nhis house at 4am. Kanye makes good points, why the fuck should you be outside\nany house not your own at that hour? Regular people get arrested for harassment\nfor doing something like that, but if you have a camera suddenly…",
  "data/reddit-changemyview/r/changemyview/comments/psre0z/cmv_assisted_suicide_should_be_legal_to_anyone.json": "I believe that assisted suicide should be a legal procedure for anyone over the\nage of 18. My reasoning is simple, we should have autonomy over own bodies so we\nshould decide how and when we die. You don't have to be mentally ill to be\nsuicidal. Sometimes life can just suck and your circumstances…",
  "data/reddit-changemyview/r/changemyview/comments/pst1ak/cmv_woke_americans_who_say_us_is_a_third_world.json": "I see a bunch of young people talking about how America sucks and to check your\nprivilege (lol look in the mirror pal) and is a third-world country with a Gucci\nbelt, which is seriously mind-blowing.\n\nThese specific kids have never had to pay for anything in their lives because\ntheir parents do it…",
  "data/reddit-changemyview/r/changemyview/comments/psusti/cmv_the_vast_majority_of_incels_are_unwanted.json": "I can’t even count how many times I’ve seen a totally average (sometimes below\naverage) man get with someone incredibly hot.\n\nHow did they do this you wonder? Well believe it or not, it’s because they\nactually spent time learning how to interact with women instead of criticizing\nthem in online…",
  "data/reddit-changemyview/r/changemyview/comments/pt0k2o/cmv_landlords_are_over_villainized.json": "I’m sure so many people have bad experiences with Landlords, however i do think\nthey’re over bashed imo.\n\nNot every landlord is a mega rich dude who owns thousands of buildings.\n\nAnd if im being fair i think they encounter more shit from their tenants than we\nlike to admit.\n\nSeriously, being a…",
  "data/reddit-changemyview/r/changemyview/comments/pt3wsr/cmv_i_dont_think_human_society_has_what_it_takes.json": "A simple definition of terms is required. By climate catastrophe, I'm proposing\na specific threshold of 3 degrees Celsius.\n\nThis is something I think about entirely too often and I have for a long time\nnow. It might be a side effect of recently becoming a father and having a lot of\nyounger family…",
  "data/reddit-changemyview/r/changemyview/comments/pt50fq/cmv_if_it_isnt_sexist_to_have_sex_preferences.json": "In the case of racial preferences and sex preferences, physical characteristics\nare being used to discriminate against potential partners.\n\nIf someone doesn't like dick, they won't fuck/date guys. If someone doesn't like\nblack features, they won't date black people. Both of these seem…",
  "data/reddit-changemyview/r/changemyview/comments/pt8ofc/cmv_gay_marriage_should_be_legalised_in_all.json": "I never understood as to why gay marriage is not legalised, I’ve tried looking\nup opinions as to why people are against it but all I’ve got is religious\nanswers. I’m not religious, I’m bisexual and have a boyfriend, we’re both from\nreligious background, converted in atheism. Based on that, is there…",
  "data/reddit-changemyview/r/changemyview/comments/ptcghe/cmv_americans_have_been_split_apart_by_the_media.json": "You made politics about everything for the past 2 years and look where it has\nbrought us. Look at our country and how much we are split apart. Where is the\npride in being American anymore. How come all we do is just shit on other people\nwho support the opposite views, instead of trying to find…",
  "data/reddit-changemyview/r/changemyview/comments/pteddo/cmv_pregnant_women_should_be_automatically.json": "I'm a Catholic and my father received stem cell treatment a few years ago. It\nmassively improved his quality of life. I learned shortly beforehand that a\nwoman's afterbirth and its core blood contains a lot of stem cells which can be\nused, to the point that women can actually donate them. I think…",
  "data/reddit-changemyview/r/changemyview/comments/pthme4/cmv_blues_states_should_take_a_leaf_out_of_texass.json": "It's simple, based on the \"your right to swing your fist ends where my nose\nbegins\" principle, if someone exercising their freedoms incurs costs to someone\nelse, the party responsible for the the harm should be held accountable. \nPolitical reality may limit holding someone who refused to vaccinate…",
  "data/reddit-changemyview/r/changemyview/comments/ptxdb1/cmv_insurance_is_a_scam.json": "Car insurance and homeowners insurance is a scam. It often operates like a\npyramid scheme. You file a claim and your rate goes up. Why do we pay for\ninsurance if we have to pay them back, over time, any money we get from them,\nthrough an increased rate...\n\nI know there are times that you have an…",
  "data/reddit-changemyview/r/changemyview/comments/ptztth/cmv_the_us_republican_party_is_not_fascist_and.json": "If you believe one of these statements, then you ought to believe the other.\n\nHere's why:\n\nWe are 8 months away from a transfer of power from a Republican-led divided\ngovernment to a Democrat-led government. We are 3 years away from a\nRepublican-led government. If we were experiencing transfers of…",
  "data/reddit-changemyview/r/changemyview/comments/pu21g3/cmv_there_is_no_good_reason_against_universal.json": "CMV: There is no good reason against universal health care for children (<18) in\nthe US\n\n 1. Children can't get their own health insurance because health insurance is\n    tied to employment and their full time job should be school\n 2. Children are part of a vulnerable population who as a society we…",
  "data/reddit-changemyview/r/changemyview/comments/pu4cl9/cmv_regional_restrictions_in_software_are.json": "Hi everyone. I realise this will possibly be an unfamiliar topic to the majority\nof reddit, but, as a Eastern European, I keep bumping into restrictions that\nhonestly make no sense to me.\n\nExhibit A: I've got a bluetooth speaker with Alexa on it. I've got a Spotify\npremium. When I try to connect the…",
  "data/reddit-changemyview/r/changemyview/comments/pu4oun/cmv_asshole_aggregation_subreddits_dedicated_to.json": "Subs like /r/vaxxhappened and /r/therightcantmeme and the hundreds of other subs\nthat exist to highlight assholes on The Other Side, are ultimately just\nplatforming their propaganda and increasing mainstream exposure to their\nmessaging strategy.\n\nLike shills and right wingers will just post whatever…",
  "data/reddit-changemyview/r/changemyview/comments/pu50qh/cmv_16_while_a_historically_awful_event_was_not.json": "My main point that I’m curious if my mind will be changed on is that nobody -\nNot Trump, Cruz, or anyone else in the Republican Party - planned on having\ntheir supporters storm the capital and harm members of Congress in order to\nallow Trump to remain in power.\n\nFor starters, if it was planned, what…",
  "data/reddit-changemyview/r/changemyview/comments/pu8jp9/cmv_your_religion_should_have_no_effects_on_my.json": "Your religion is YOUR religion and it should have no affect on MY laws. You can\nchoose what you would like to do with your own body and who you would like to\nsleep with. I can choose what I would like to do with my own body and who I will\nsleep with.\n\nI genuinely don’t understand how 2,000 year old…",
  "data/reddit-changemyview/r/changemyview/comments/puksvs/cmv_there_is_nothing_intrinsically_wrong_with.json": "(1) Cannibalism is a recent (relatively recent) taboo, and a thoroughly western\none. It has been (or is) practiced on every continent, most famously the\nAmericas and the Pacific. It was even practiced in Europe at various points in\nhistory. \"Cannibalism\" is derived from the Carib people.\n\n(2) The…",
  "data/reddit-changemyview/r/changemyview/comments/pumx0q/cmv_institute_a_proper_minimum_wage_rather_than.json": "I earlier today stumbled on a conversation about the tipping culture in America,\nwhich I personally consider ridiculous. Expectedly, most Americans that\ncontributed to the topic, were pro-tipping, and argued in poor taste, that\neating out should be avoided in its entirety if a customer cannot afford…",
  "data/reddit-changemyview/r/changemyview/comments/puni86/cmv_the_us_federal_government_should_institute_a.json": "The United States has a debt problem and a data security problem that I believe\nhave a mutually beneficial solution: severe financial ramifications for\ncompanies and institutions that have data breaches. We have a systemic\nreoccurrence of data breaches across all sectors in the US and organizations…",
  "data/reddit-changemyview/r/changemyview/comments/puqq7n/cmv_a_workstudy_program_where_active_addicts_get.json": "As anyone who has been or known an addict, nothing matters to them but that next\nhigh. Things like rent/bills/food might as well be chopped liver. Once these\npeople are strung-out on the streets is where the trouble starts.\n\nIf we could start a vocational program for heroin addicts, etc. They could…",
  "data/reddit-changemyview/r/changemyview/comments/pv4a43/cmv_at_least_part_of_the_reason_of_why_mens.json": "The title may sound weird, but allow me to explain.\n\nSpeaking as a man, there are a lot of societal issues that affect men, such as\nbias in family and criminal courts, homelessness, more pressure to sucess, less\nsupport for a variety of ills,etc. These issues do not receive the (positive)\nattention…",
  "data/reddit-changemyview/r/changemyview/comments/pv5lgb/cmv_910_people_buying_the_brand_new_iphone_13_on.json": "CMV: Apple's marketing is so killer they have millions of \"lifetime customers\"\nfinancing these devices which provide 0 performance value upgrade to them. If\nyou replaced every single component of a new iPhone other than the exterior\nappearance, 9/10 people buying them would not notice, and would…",
  "data/reddit-changemyview/r/changemyview/comments/pv630v/cmv_boba_fett_at_least_as_he_appears_in_the.json": "Let me point out that I am a Star Wars super-fan, at least when it comes to the\nDisney canon. I've seen every show, played every game, regularly rewatch every\nmovie, and have even read a couple of the books.\n\nWith that being the case, I feel that I can definitively say that Boba Fett is\nthe most…",
  "data/reddit-changemyview/r/changemyview/comments/pv79q7/meta_a_brief_clarification_on_rule_5.json": "Our removal message for rule 5 has been unclear and frequently misunderstood for\ntoo long, so we are revising it. Previously it read:\n\n> Comments must contribute meaningfully to the conversation. Comments that are\n> only links, jokes or \"written upvotes\" will be removed. Humor and affirmations\n> of…",
  "data/reddit-changemyview/r/changemyview/comments/pv8mqo/cmv_extended_payment_terms_should_be_abolished.json": "I’ll explain quickly how they work then offer a quick syllogism arguing why you\nshould care about this issue.\n\nFirst, I’m not an economist or an accountant, I’m a business leader working in a\nlarge corporation who has drawn some conclusions watching what happens in my\ncorner of the world and has…",
  "data/reddit-changemyview/r/changemyview/comments/pvew60/cmv_highschools_in_nations_with_wide_internet.json": "I think a large degree of why people often end up causing each other so much\nstress, anguish, and other ill feelings on the internet is often because to some\ndegree there is no handbook that we're all operating out of, if we used public\neducation to establish a baseline level of internet knowledge…",
  "data/reddit-changemyview/r/changemyview/comments/pvh0l8/cmv_america_should_have_tax_funded_healthcare.json": "1) So many other countries have it besides the US\n\n2) It’s way too expensive currently. Paying hundreds to get a diagnosis is\nridiculous\n\n“But my individualism”\n\nThis argument annoys me. Should we take away police and force you to fend for\nyourself since you live privacy so much?\n\nAlso, just because…",
  "data/reddit-changemyview/r/changemyview/comments/pvkg56/cmv_theres_nothing_really_wrong_and_terrible.json": "I’ve heard/seen lots of people talk about how it’s ridiculous that people have\nto work just to live. Since the very beginning of humans, we have had to work to\nsurvive - whether this was working the fields for food or something less\ndirectly connected to living. All animals have to work and hunt to…",
  "data/reddit-changemyview/r/changemyview/comments/pvnjye/cmv_skin_color_plays_a_pretty_minor_role_when.json": "For starters I am not some angry white guy (far from it) but in my opinion,\nsomeone's skin color plays a fairly minor role when determining one's privilege.\n\nA lot of privilege comes from the types of means someone has to help them live a\nfulfilling life. A person of color who is able-bodied, highly…",
  "data/reddit-changemyview/r/changemyview/comments/pvsvkp/cmv_capitalist_practices_are_seriously_causing.json": "EDIT : Consumerist practices is probably more apt - in my head they kinda went\none and the same.\n\nUnderstand that I’v been trying to come to terms with this issue and it’s a bit\ncomplicated - but I’ll do my best to keep it kind of sectioned into paragraphs\nwith points for you to CMV on.\n\nEverything…",
  "data/reddit-changemyview/r/changemyview/comments/pvugat/cmv_i_solely_blame_the_current_state_of_the.json": "As of the creation of this post, the US now sees about 2000 deaths per day due\nto Covid-19. We haven’t seen this many deaths per day since March, and with the\ndelta variant of the virus spreading, we’re starting to regress as far as\ngetting over this pandemic is concerned. We’re starting to go back…",
  "data/reddit-changemyview/r/changemyview/comments/pvwycj/cmv_social_media_causes_more_problems_than_its.json": "Defining social media as Facebook, Instagram, Tiktok, and any other platform\nwhere faces/identities are tied to what seems to be actual people.\n\nSocial media allows people to communicate over long distances, share stories,\nand offers connection to those otherwise too remote or “different” in…",
  "data/reddit-changemyview/r/changemyview/comments/pw6k5o/cmv_to_solve_the_housing_crisis_we_should_just.json": "If we broke up real estate empires and capped the number of homes that\nindividuals and companies can own, it would force them to sell and drive the\nprices back down to real-world, while opening up housing to people who need it.\n- Why not cap individuals at say, 5 homes (generously) - Smaller real…",
  "data/reddit-changemyview/r/changemyview/comments/pwd4wg/cmv_sex_work_should_be_decriminalized_not.json": "There are many reason sex work shouldn’t be legalized. People say it’s no\ndifferent than working any other job such as McDonald’s but we know that’s not\ntrue. A picture of you taking someone’s order probably isn’t going to hurt your\nfuture while a picture of you naked will. You always hear about how…",
  "data/reddit-changemyview/r/changemyview/comments/pwfp6f/cmv_climate_change_protesters_who_block.json": "Every few days the UK news shares about arrests taking place on major\nroads/motorways because of climate change activists blocking them. This seems to\nbe a common way for them to protest and in my opinion it’s counterproductive.\n\nI do care about the environment obviously, but as a driver myself, if…",
  "data/reddit-changemyview/r/changemyview/comments/pwithn/cmv_residential_homes_should_only_be_sold_to.json": "Alright fellow humans this will be a contentious one so I'm going to detail the\nproblem and the plan.\n\nProblem: Big money is buying up properties, competing directly with normal\npeople who couldn't possibly. Normal citizens are restricted to buying\nproperties based on their personal income; holdings…",
  "data/reddit-changemyview/r/changemyview/comments/pwm9bw/cmv_the_united_states_is_actually_doing_a_pretty.json": "I'll try my best to keep this as succinct as possible.\n\nOf late, I have been hearing about how terrible of a job the United States is\ndoing with vaccinations because of anti-vaxxers and all that. Often cited is the\nnumber of 55% of the total population vaccinated and how it is something like\n30th…",
  "data/reddit-changemyview/r/changemyview/comments/pwn722/cmv_there_is_no_excuse_for_cheating_in_a.json": "Edit: I am talking about the USA, Canada, and other similar countries, not those\nwhere divorce is illegal or practically impossible.\n\nI cannot see there being a valid reason for cheating on a spouse or\nboyfriend/girlfriend. Especially when it comes to marriage, since you said your\nvows and promised…",
  "data/reddit-changemyview/r/changemyview/comments/pwngya/cmv_misogynistic_rap_music_fuels_rape_culture_is.json": "As the Wikipedia article, \"Misogyny in rap music\n[https://en.wikipedia.org/wiki/Misogyny_in_rap_music],\" demonstrates in gross\ndetail, misogyny is a prominent and prevalent feature of rap music — especially\nin its most popular expressions. There are several reasons why this has weighed\nheavily on my…",
  "data/reddit-changemyview/r/changemyview/comments/pwpl1s/cmv_any_social_media_that_has_a_like_button.json": "Without the ability to (functionally) downvote or dislike posts on social media\nyou are in away creating an environment where people are able to say whatever\nthey like and get almost only positive feedback. Say you have someone who posts\nsomething incredibly racist. Though 10,000 people may have…",
  "data/reddit-changemyview/r/changemyview/comments/pwro0y/cmv_if_you_are_nonbinary_it_is_ok_and_completely.json": "An AFAB non-binary friend just posted a tirade on Instagram about how a complete\nstranger misgendered them over the phone! Then someone else responded about how\nthey should report the business and also shared stories about being misgendered\nby strangers and how horrible it is for people to assume…",
  "data/reddit-changemyview/r/changemyview/comments/px3zc1/cmv_the_right_to_vote_should_never_be_removed.json": "(Edit: I have switched to desktop and am having trouble finding new posts...if I\ndon't reply to yours, I apologize...I'm probably still looking for it.)\n\nThe only ways I know of that you can be disenfranchised (permanently or\ntemporarily) in the US are: 1) Crime 2) Debt 3) Disability 4) Place of…",
  "data/reddit-changemyview/r/changemyview/comments/px7c9e/cmv_its_fine_to_call_yourself_vegan_if_youre_only.json": "Most vegans on Reddit will tell you that veganism is a lifestyle or ideology.\nYou must be into animal rights to be a vegan, and you must be very strict about\nit. If you aren't, then you're just \"plant-based\".\n\nHowever, in casual usage, veganism refers to a diet. When people talk about\nvegans or…",
  "data/reddit-changemyview/r/changemyview/comments/pxb2sg/cmv_for_those_who_arent_selling_the_us_should.json": "Seems pretty odd that you can go to jail for decades for doing a drug. I don't\nadvocate it by any means, but if the idea is truly to \"rehabilitate\" wouldn't it\nmake more sense to give folks an opportunity to get clean through other means\nother than just sitting in a cell? Are there not better…",
  "data/reddit-changemyview/r/changemyview/comments/pxeibe/cmv_if_a_leader_is_democratically_elected_the.json": "People always talk about how people are different from politicians, and you are\nnot supposed to judge a person based on what their politicians do. However I\nwould argue that this is simply a tactic used to avoid responsibility. I do not\nwant to point fingers at specific countries in my actual post,…",
  "data/reddit-changemyview/r/changemyview/comments/pxescs/cmv_abolishing_mental_institutions_in_the_us_was.json": "Before I present my view, I feel that providing some background information and\na personal anecdote will help clarify my view on this issue:\n\nI've been somewhat aware of the problems plaguing the US healthcare system, but\nI was completely unaware of just how poorly the healthcare system treats…",
  "data/reddit-changemyview/r/changemyview/comments/pxf1uy/cmv_it_is_the_responsibility_of_members_of_the.json": "I feel like there are new pronouns or statements that are declared insensitive\nevery other day. This isn’t a problem for me. I am happy to call people whatever\nthey want and treat them however they want. However, since what language is\nacceptable is changing so frequency, it is not my responsibility…",
  "data/reddit-changemyview/r/changemyview/comments/pxl7on/cmv_forcing_a_vegan_diet_on_your_dogs_and_cats_is.json": "Though dogs and cats can survive on plant based diet, ideal nutrition- the\nfoundation of good health- is not well served on that diet.\n\nCats, in particular, don’t do well on a meatless diet. Because they’re obligate\ncarnivores, or \"true\" carnivores — meaning they depend only on the nutrients\nfound…",
  "data/reddit-changemyview/r/changemyview/comments/pxphej/cmv_an_artist_being_a_terrible_person_doesnt_make.json": "the first thing I hear after telling people my favorite series and story of all\ntime (rurouni kenshin) is \"Did you hear about that mangaka?\". like no duh person\nI literally just said it's my favorite series I probably keep track of the\nauthor and his current works and dealings.\n\nQuick note for those…",
  "data/reddit-changemyview/r/changemyview/comments/pxqkrm/cmv_a_significant_amount_of_redditors_have_no.json": "This in reference to any political post that you find on this website. Sort by\ntop comments & you’ll find multiple sweeping generalizations attacking the\nopposing party. For example, earlier I saw a top comment on an r/all [/r/all]\npost that said “Republicans are racist but deny it since they’re not…",
  "data/reddit-changemyview/r/changemyview/comments/pxv9fs/cmv_the_keyboard_click_sound_on_phones_does.json": "It's a feature plenty of phones have, and it does not do anything to enhance\nuser experience. If you're typing something, you know you're typing. If you're\nstaring at your screen, you know you're not typing. what does the sound add?\nHell, if your phone has a keyboard it's not even as loud as the…",
  "data/reddit-changemyview/r/changemyview/comments/pxwvvx/cmv_people_who_condemn_other_people_for.json": "Edit: I am from Germany. This generally means that most parties do not disregard\nany human rights and you are not going to change my mind by telling me how\nhorrible a certain American party is.\n\nMost of the western world lives in a democracy and one of its basic principles\nis pluralism. Pluralism…",
  "data/reddit-changemyview/r/changemyview/comments/py6h11/cmv_the_posts_in_rgunfights_should_be_blurred.json": "I realize that the sub has a nsfw tag upon entry. That's a different story than\nscrolling the front page and seeing a post with no warning that you're about to\nsee a video start, unprompted, that will graphically show gun violence and in\nsome cases actual death from that gun violence. I haven't been…",
  "data/reddit-changemyview/r/changemyview/comments/pyjita/cmv_there_is_virtually_no_reason_to_have_spaces.json": "To start, I am not denying the existence of gender identity or gender. However,\nthere is no significant reasons to separate societal physical spaces due to an\nidentity. Most male/female divisions (bathrooms, prisons, dressing rooms, etc.)\nare separated due to physical differences in bodies, not…",
  "data/reddit-changemyview/r/changemyview/comments/pyjr7y/cmv_most_back_in_my_day_type_statements_are_worth.json": "I accept that this could be a flawed view, but I think most people need to stop\nbeing so self-righteous and just accept older people often do have better advice\nbecause they have had more time to be wrong and make mistakes and then find\nbetter ways to deal with them than younger people have. There…",
  "data/reddit-changemyview/r/changemyview/comments/pylydc/cmv_transgender_inclusion_fairness_and_safety.json": "This isn't just a view I personally hold, it's also the conclusion of a wide\nranging review of transgender inclusion in sport by Equality in Sport\n[https://equalityinsport.org/docs/300921/Guidance%20for%20Transgender%20Inclusion%20in%20Domestic%20Sport%202021.pdf]\nin the UK.\n\nFor a long time now…",
  "data/reddit-changemyview/r/changemyview/comments/pyn1ps/cmv_it_is_not_transphobic_not_to_wish_to_date_a.json": "If you do not want to date a trans person because you hateful towards them, that\nis wrong. I will explain my personal perspective since this is my opinion and\nreally I want to either confirm or disprove my view since I ultimately want to\nbe as loving and accepting as possible. I am attracted to…",
  "data/reddit-changemyview/r/changemyview/comments/pyod3b/cmv_the_consensus_that_centrism_is_badwrong_and.json": "This one is probably going to a long one. Let me preface this by saying, I\nconsider myself \"LibCenter\", using PCM terminology. Additionally, my experience\nwith Reddit is largely with: non-political subs, like subs for video-games or\nsubs for niche topics, and then also some Left leaning subs since…",
  "data/reddit-changemyview/r/changemyview/comments/pyq93v/cmv_netflix_should_bring_back_advanced_dungeons.json": "Netflix removed this episode of Community because Chang wore \"blackface\".\n\nMy stance is not very complex.\n\nFirstly, I understand that dark elves are arguably based on racial stereotypes\nand I think the only argument in favor of removing the episode is that\nsupportting something based on a…"
}