{
  "data/reddit-projects/r/SideProject/comments/r679id/come_draw_on_my_collaborative_pixel_art_canvas.json": "Hi Reddit!\n\nI created a collaborative pixel art canvas called Everyone Draw\n[https://everyonedraw.com/]. Go play with it and let me know what you think!\n\nThis is certainly not a new concept. It's heavily inspired by /r/place, but it\ndiffers in two major ways:\n\n 1. No account is required to draw.…",
  "data/reddit-projects/r/SideProject/comments/r6najz/we_built_a_firewood_map_for_the_camping_community.json": "My buddy and I are big campers, and we've forgotten to pick-up firewood too many\ntimes, which inspired this little side project called Stacked. It's a web-based\nmap of user-submitted locations where campers, RV-ers, and van-dwellers can find\nplaces to purchase firewood. The idea was to create a…",
  "data/reddit-projects/r/SideProject/comments/r794f6/messaging_app_that_always_appends_positive_emoji.json": "I made everyday normal regular messaging app. The only difference is that\neverytime you send a message it appends smiley at the end of the message.\n\nJust so your message comes out as friendly :)",
  "data/reddit-projects/r/SideProject/comments/r7f5pb/generate_available_domain_name_ideas_name_lantern.json": "Hello Reddit! 🙌\n\nSince our last post in this subreddit, we have built the mobile layout, fixed\nbugs, and implemented suggested features such as having links to multiple domain\nregistrars to effectively buy the domains generated on Name Lantern\n[https://namelantern.com/].\n\nIn short, the web…",
  "data/reddit-projects/r/SideProject/comments/r7n1pa/the_easiest_way_to_the_neuroscience_world_with.json": "https://github.com/Ildaron/EEGwithRaspberryPI\n\nThis project is the result of several years of work on the development of BCI.\nWe believe that the easiest way to get started with biosignals is to use a\nshield. We will try to reveal the process of reading EEG signals as fully and\nclearly as possible.",
  "data/reddit-projects/r/SideProject/comments/r7x6d8/i_built_a_side_project_that_i_needed_for_my.json": "Hey guys,\n\nI don't know why Reddit doesn't allow filtering communities by their growth\nrate, but it's been bothering me for a while.\n\nBesides me just being curious, I also wanted a list of fast growing subreddits\nfor my business opportunities newsletter where I do research in different\nsubreddits…",
  "data/reddit-projects/r/SideProject/comments/r86viz/im_an_introvert_made_an_app_to_help_maintain.json": "https://preview.redd.it/9mo6rlmdod381.png?width=1024&format=png&auto=webp&s=204fd81560337e73fdea92d354c2b2c7a3cfc6d8\n\nhttps://communiqai.com\n\nI developed this app to help people communicate more frequently, particularly in\nlight of the pandemic. It has helped me and many others and I’ve received…",
  "data/reddit-projects/r/SideProject/comments/r8hr6c/i_created_a_meme_generator.json": "Hi everyone,\n\nI would like to share my first app that I made called Memify. It took a long\ntime and I worked really hard on it. It's a simple and quick tool to make\nclassic memes and is available on the App Store at this very moment.\n\nhttps://apps.apple.com/app/id1594777865\n\nMemify is very simple…",
  "data/reddit-projects/r/SideProject/comments/r8rpos/i_built_open_source_telegram_bot_with_tradingview.json": "I built a Telegram Bot that will reply to you with a screenshot of TradingView\ncharts. It is my first public open-source project based on CHART-IMG\n[https://chart-img.com] API that I made a few weeks ago. I am planning to\nimprove and add more features for both projects over time. Let me know if…",
  "data/reddit-projects/r/SideProject/comments/r8ttsy/help_to_build_products_and_get_paid_in_equity.json": "This is an attempt to match non-technical founders with experienced software\nengineers to build collaboratively amazing products. Instead of working on a\nside project of another clone of an existing product, help the founders to build\ntheir products. You shall help with the technical side, they…",
  "data/reddit-projects/r/SideProject/comments/r9817s/i_made_this_atarionlineorg.json": "AtariOnline.org [https://AtariOnline.org] is dedicated to protect and to share\nthe Atari game library in the form of online emulation. Currently, there are\n650+ Atari 2600 games available to play online.\n\nHope you enjoy the site. Any feedback is welcome.",
  "data/reddit-projects/r/SideProject/comments/rahyv5/a_job_board_of_tech_jobs_that_dont_ask_algorithm.json": "I have made a website that aggregates job posts for companies which hire without\nAlgo/DS questions.\n\nScreening process for these jobs is like pairing on a real world problem or\npaid/unpaid take home assignment, etc.\n\nThese are great for developers who are really good at building stuff, but…",
  "data/reddit-projects/r/SideProject/comments/raux0e/codelibclub_find_solutions_in_open_sourced_apps.json": "Hey,\n\nMy friend and I had this problem -- in another project, we were supposed to use\na few javascript libs we knew nothing about, and googling for how others use\nthem wasn't fruitful.\n\nSo we scraped open-source repos on the internet and created a serchable index\nwhere you can find apps by the…",
  "data/reddit-projects/r/SideProject/comments/rb5njk/i_am_creating_a_notes_app_for_software_developers.json": "It does all basic tasks like creating a notebook, adding todos, and code\nsupport, etc plus it scans all git repositories and creates a notebook for each\nrepository with 3 subnotebooks (git tasks, tasks, and wiki) and git tasks create\nnotes for every new branch automatically. Please check out…",
  "data/reddit-projects/r/SideProject/comments/rbpgxf/problemsolving_product_what_do_you_think.json": "Hi, we are a small statistics/AI company. We mostly analyze data in pursuit of\nfinding something spectacular.\n\nWe launched a product on problem-solving in startups. What do you think?\n\nI provide you with the link to the launch\n[https://www.producthunt.com/posts/peersolver], however, I can delete it…",
  "data/reddit-projects/r/SideProject/comments/rbvbc0/product_demo_sell_a_product_directly_via_a_url.json": "Picture from demo\n[https://preview.redd.it/ubbt0m77jc481.png?width=882&format=png&auto=webp&s=40c517691393008a7e92b7558def777093f6c234]\n\nTry out the product demo\n[https://www.figma.com/proto/2tHKu1BShbCxXmwhuYJXdF/Medusa-Express-(Copy]?node-id=41%3A1184&scaling=min-zoom&page-id=41%3A1183&starting…",
  "data/reddit-projects/r/SideProject/comments/rbwj78/i_have_an_idea_but_help_me_validated_it_by.json": "I have a really simple/dummy idea, but first and before buying a domain domain I\nwould like to know/see your 404 pages\n\nWhat about a service (free) that generate a meme 404 page so everytime a user\ngoes to your 404 page he sees a different meme image, it could be done by\nreturning a url to the link…",
  "data/reddit-projects/r/SideProject/comments/rc2nlp/launched_wannadocs_knowledge_base_management.json": "Link: https://www.producthunt.com/posts/wannadocs/ It's my first PH launch I've\ntried to do my best, huh.\n\nWannadocs – Knowledge Base Management System.\n\nWe know that creating a good public documentation or knowledge base often\nrequires too much energy.\n\nWe saw that pain inside many companies and…",
  "data/reddit-projects/r/SideProject/comments/rc4tcv/database_of_top_startups_jobs_salaries.json": "I made an interactive database [https://topstartups.io/] of top startups and\njobs, all funded by Tier 1 investors. Coming soon: startup salary and equity by\nstage, location, role, experience\n\nWhy this: Crunchbase paywalls you hard, Angel is noisy, LinkedIn is, well...\nLinkedIn. Bopping from VC site…",
  "data/reddit-projects/r/SideProject/comments/rcenw4/i_finally_finished_a_side_project_after_a_long.json": "I'm working as a fullstack web dev with a passion for gaming.\n\nYears ago I've started to get into game development in my freetime and my goal\nwas a simple mobile game with website & leaderboard API. My motivation was\nreally high and as usual 80% of the project was implemented really fast.\n\nAfter…",
  "data/reddit-projects/r/SideProject/comments/rcez3g/question_as_a_maker_what_do_you_struggle_with.json": "I myself am a maker, primarily working on iOS and macOS apps, but I've always\nfound the making the easy part. What's hard for me is marketing: Creating\nmarketing media (videos, images), creating a landing page and reaching out to\npress and potential customers.\n\nI'm interested in how others see…",
  "data/reddit-projects/r/SideProject/comments/rcl36i/i_made_a_chrome_extension_that_groups_similar.json": "The chrome extension can be found here:\nhttps://chrome.google.com/webstore/detail/smart-tabs-organizer/ijefkdkfgdhiomggpammggofhnkaeopl?hl\n\nThe extension is for people who have too many tabs opened in their browser. It\nhelps you clean up your browser by assigning the tabs to different groups.\n\nAny…",
  "data/reddit-projects/r/SideProject/comments/rcnd1q/tell_me_what_you_dont_like_about_my_freelance.json": "Hey guys,\n\nI'm looking to get your thoughts on what you don't like about my Freelance\nwebsite.\n\nWebsite staging link: https://agitated-nobel-b332d7.netlify.app/\n\nPositive comments are more than welcome too, just looking at ironing out the\nissues at the moment :)\n\n\n\nThanks for your time.",
  "data/reddit-projects/r/SideProject/comments/rcs7td/i_built_a_website_to_easily_print_out_my_logs.json": "Hi All,\n\nLast night, I spent some time creating a small web app to make it easier to\nprint out my logs and debug comments when I work on hardware projects and I\nthought I'd share here to see what you guys think! I would appreciate any sort\nof feedback to make this better xD.\n\nconsole.logsnag.com…",
  "data/reddit-projects/r/SideProject/comments/rdamo8/codeprintsdev_get_a_personalized_print_of_your.json": "Today I'd like to share a side project I've been working on together with a few\nfriends over the past few months: https://Codeprints.dev is a tool that takes\nyour personal GitHub contributions and allows you to purchase a high-quality\nprint of it.\n\nSince many of us have been working in a home…",
  "data/reddit-projects/r/SideProject/comments/rdcikq/how_i_created_a_side_saas_project_from_an.json": "https://preview.redd.it/34iixmzdks481.jpg?width=2099&format=pjpg&auto=webp&s=e35ce7679142658b885405a9565465c164cf8a60\n\nParsio.io [http://parsio.io/] 's story began a couple of years ago. At this time\nwe were developing e-commerce and CRM extensions and selling them on different\nmarketplaces.\n\nOnce…",
  "data/reddit-projects/r/SideProject/comments/rdel5q/i_made_an_app_just_to_say_fk_to_lastpass.json": "In autumn my password manger, LastPass, decided they would charge a monthly\nsubscription to access passwords on other devices, you could choose computer or\nphone, crippling my ability to login in Reddit in half my devices...\n\nRather than paying the €2.90/month I planned a more cleaver way to say…",
  "data/reddit-projects/r/SideProject/comments/rdlt5m/donate_to_charity_for_free_charifree.json": "I made an app that allows you to donate to charity for absolutely free.\n\nBy completing different tasks like watching ads (new tasks are on their way),\nyou can earn coins that you can then donate to the listed organizations. Based\non the number of coins and the total amount of money collected, at…",
  "data/reddit-projects/r/SideProject/comments/rdvssp/finally_seem_to_be_getting_some_love_for_my.json": "Man, it's tough to be an android dev.. specially if you're alone trying to do\neverything - development, designing, maintenance, marketing, support and\nliterally anything associated with running an app.\n\ni, like any other developer, feel very proud of what i've made: Snap…",
  "data/reddit-projects/r/SideProject/comments/re5agh/reorganize_your_spotify_playlists_with_emotional.json": "If, like me, all your music is disordered in your playlists and makes listening\na bit anarchic, I have developed a little tool that reorders them according to\nan emotional progression.\n\nhttps://wd400.github.io/Moodplaner_x_Spotify/ (direct access to the…",
  "data/reddit-projects/r/SideProject/comments/re9j1g/free_trading_journal.json": "Hi everyone,\n\nI made a VueJS trading journal web app. I was frustrated tracking my trades in a\nspreadsheet, other apps were either cumbersome to use, expensive or full of ads.\nIts currently an ALPHA build with many features still missing, but the core\nbasic functionality is there. I hope you all…",
  "data/reddit-projects/r/SideProject/comments/rel2y4/i_made_a_tool_that_makes_large_datasets_like.json": "Hey All,\n\nWith all the WSB hype I've developing/testing automated investment/trading\nstrategies in crypto/stocks. I was struggling to get large amounts of data\ncheaply like total historical stock/crypto prices or historical news to analyse\npatterns and so I built a tool [https://gigadata.com.au/]…",
  "data/reddit-projects/r/SideProject/comments/rf078x/an_app_that_allows_anyone_to_build_an_ai_model_in.json": "I've been working over the past 6 months on an app that enables anyone to build\nAI (machine learning) models in less than a minute, without writing a single\nline of code, and while keeping your data private.\n\nMLConsole (https://mlconsole.com/)\n\nScreenshot of the MLConsole…",
  "data/reddit-projects/r/SideProject/comments/rf09nd/display_a_linkedin_badge_in_your_github_profile.json": "https://reddit.com/link/rf09nd/video/fzdwjfi217581/player",
  "data/reddit-projects/r/SideProject/comments/rfhdd0/a_trickle_of_users_here_and_there_getting_some.json": "Need some inputs from fellow builders in this thread.\nOur startup is Netflix for motivational content. Netgoals\n[https://www.netgoals.io/]\n\nMany trials / many errors and still a lot to learn from users feedback. A few\nsign ups here and there some say they love it, some feel meh about it. Overall\nwe…",
  "data/reddit-projects/r/SideProject/comments/rg1hmk/subreddits_you_recommend_beyond_rsideproject.json": "Hi r/SideProject [/r/SideProject]\n\nMy friends and I are in the process of a building a new app that fits our needs\nand our family needs. We would love to expand our services to an audience beyond\nus and I know there is a lot for me to learn.\n\nAre there any subreddits you would recommend to learn…",
  "data/reddit-projects/r/SideProject/comments/rg33qr/i_scaled_multiple_products_from_launch_1000_users.json": "Hey 👋🏼\nAs a serial maker myself, I launch multiple products or side projects every\nyear. I am so stoked to be sharing the First 1000 Users Guide\n[https://www.producthunt.com/posts/first-1000-users-guide] for founders that I\nhave been working on for a couple months now synthesizing my learnings…",
  "data/reddit-projects/r/SideProject/comments/rg4bo2/i_brought_back_the_youtube_dislike_counter.json": "Hello everyone!\n\nYesterday I posted a video on YouTube where I explain how I built a browser\nextension that shows the number of dislikes a video has.\n\nIt's a little project but it was still fun to do!\n\nHope you enjoy: https://www.youtube.com/watch?v=qveWEhfUCmE",
  "data/reddit-projects/r/SideProject/comments/rgcpf5/giving_away_an_illustration_tool_that_helps_you.json": "Hey everyone, Happy holidays! I have been running a design newsletter,\nFontDiscovery, that shares weekly font and design tips. This holiday, I am doing\na special giveaway for my newsletter.\n\nI am giving away an illustration pack to help build holiday promo graphics. I'm\na designer, and I created…",
  "data/reddit-projects/r/SideProject/comments/rgjegs/webstickies_i_made_a_browser_extension_to_take.json": "What is it? A browser extension to take notes on websites. It's a bit bare bones\nat the moment, but has the basics. You can create sticky notes on a website that\nwill reappear on subsequent visits. There's also a list and search view with all\nyour sticky notes.\n\nWhy? In the past I used Google docs…",
  "data/reddit-projects/r/SideProject/comments/rgjr1j/what_do_you_think_should_i_create_one.json": "Hey guys,\n\nI was thinking of creating a chrome extension that will let you type emojis just\nlike you do on Discord, Slack, or Github.\n\nAn example is typing :smile: and having it bring up the emoji\n\n\n\nhttps://i.redd.it/ahsg9q0a9l581.gif",
  "data/reddit-projects/r/SideProject/comments/rh7jx0/i_created_a_new_application_for_contact_tracing.json": "I noticed a lot of places almost 95% i visited using pen and paper to record\ncontact tracing information. That meant that when going for something to eat if\nI had to fill in my own details, it meant touching a pen someone else had been\ntouching. This seems like the wrong time for that. So I built…",
  "data/reddit-projects/r/SideProject/comments/rhs1oy/i_started_a_blog_and_directory_for_no_code_tools.json": "Hey all, I have started a blog about me tinkering with no code tools and then\nposting tutorials, and reviews on them.\n\nI also have a directory of 300+ tools so far which runs alongside me posting.\n\nI will make it clear I do have affiliate links throughout my site (not all, but\nsome). Just making…",
  "data/reddit-projects/r/SideProject/comments/rhtx7q/how_to_make_online_courses_webinars_live_lessons.json": "E-learning is beneficial not only for professionals but also for a vast\ncommunity of makers, who can earn by sharing their knowledge via:\n\n * Design, development, no-code long-term courses;\n * Short video lessons on how to achieve a specific task: how to build MVP with\n   no-code, how to scale…",
  "data/reddit-projects/r/SideProject/comments/ri3y8u/3_simple_seo_tips_for_your_side_project.json": "Hey there, my name is Tiago and I am the host of the Wannabe Entrepreneur\npodcast. I just published my chat\n[https://wannabe-entrepreneur.com/episodes/174] with an SEO expert (Roberto\nRobles) 🧙‍♂️. He has been working in SEO for more than 15 years and what he\nteaches in our chat is really useful…",
  "data/reddit-projects/r/SideProject/comments/ricnc6/i_built_pipewing_where_you_can_network_with_other.json": "It's super simple. You place a marker on a world map. Then, from the world map,\nyou select the people you'd like to meet. The people you have selected can then\nbook a call with you. And vice versa.\n\nhttps://pipewing.com/\n\nI thought this might be interesting, because\n\n * It's location-specific…",
  "data/reddit-projects/r/SideProject/comments/riiedr/i_was_tired_of_getting_daily_newsletters_for.json": "Working on Email Monster [https://eml.monster], Raaarrrr! 💙\n\nI was tired of getting daily newsletters for products I like. I wanted them just\nonce a week, with my coffee, like a weekend newspaper. So I started working on\nEmail Monster.\n\nIt's an email forwarding/firewall for your real email…",
  "data/reddit-projects/r/SideProject/comments/rimcru/do_you_ever_worry_about_what_your_employer_will.json": "In the past, I've always been nervous about what my employer might think if they\nfound out about my side projects, especially as they get closer to making money.\nI'm curious if it's just me or if others worry about this too.\n\nView Poll [https://www.reddit.com/poll/rimcru]",
  "data/reddit-projects/r/SideProject/comments/risrbf/just_launched_the_best_group_travel_platform_to.json": "I have been working on Hoku for the past 18 months to ease the group travel\nexperience. When I started working on this platform I had no idea how to create\na mobile application but through ups, downs and a lot of stack-overflow\nsearches, I have been able to create this platform. Would love to know…",
  "data/reddit-projects/r/SideProject/comments/rixvx3/i_created_an_ios_app_that_generates_printable.json": "The app can be found here\n[https://apps.apple.com/us/app/culur-custom-colour-by-number/id1568546440] and I\nhave attached a few completed…",
  "data/reddit-projects/r/SideProject/comments/riz99e/been_building_for_about_8_months_with_8_paying.json": "I've been building https://tapex.app for about 8 months now and have 8 paying\ncustomers, I moved from a monthly sub to a lifetime sub and so far have 0 sales\nin the lifetime sub model.\n\nThinking about switching back or just getting rid of some of the free features\nand making them premium. There are…",
  "data/reddit-projects/r/SideProject/comments/rjqy12/i_made_an_email_parser_to_extract_and_share_email.json": "Link - https://moogle.cc/nirvaancms.html\n\nI was getting tired of uploading content to S3 before using it on my project so\nI built a system to extract attachments from emails and store it in a public\nlocation.\n\nWith this, you simply email the attachments to a specific email address and we\ndo the…",
  "data/reddit-projects/r/SideProject/comments/rjta1g/i_made_a_website_where_you_can_find_cofounders.json": "cofinds.com [https://cofinds.com/]\n\nUsers can browse and apply to collaborate on the posts that they find\ninteresting. In addition, you can subscribe to your favorite topics and the\nposts relevant to the topic are grouped together in your home page. This is an\nMVP. I am looking forward to hearing…",
  "data/reddit-projects/r/SideProject/comments/rjxjfh/faq_builder_web_app.json": "Hey!\n\nI would like to share an application that I built that lets you build FAQ\nsections that you can either embed on your website or share via URL.\n\nThe FAQ section component is built as a web component which makes it platform\nindependent and should work on any CMS/website.\n\nOther benefits:\n\n *…",
  "data/reddit-projects/r/SideProject/comments/rkbw7c/looking_for_beta_testers_for_upcoming_app_for.json": "Hi!\n\nI am building Checklisty and am currently looking for beta testers!\n\nThe app is created to help you increase trial conversion, get faster onboarding\nand cut down time-to-value. It is a Gamified User Onboarding Software to engage\nyour users with incentives, see where they dropped off and get…",
  "data/reddit-projects/r/SideProject/comments/rkmtow/exabox_essential_tools_for_developers.json": "Hey everyone 👋,\n\nI'd like to introduce you exabox, a side project I've been working on in the\nlast few months. It is a set of 30+ tools for developers: convert/format\nJSON/YAML, encode/decode Base64, generate fake data, parse JWTs, transform a\ntext using multiple rules, and much more. All in a…",
  "data/reddit-projects/r/SideProject/comments/rl9k4o/web_app_that_creates_shareable_selfcontained_web.json": "Hi! I've made a small web app for fun that creates shareable self-contained web\npages using data URIs with no need for hosting.\n\nhttps://mattiasw.github.io/self-contained/\n\nI haven't seen this before so I thought it would be a fun experiment.\nUnfortunately many apps don't seem to automatically link…",
  "data/reddit-projects/r/SideProject/comments/rlfxxn/hi_i_tracked_mentions_of_the_keywords_i_needed_on.json": "I decided to automate this and make the project public https://mentionlist.com/\n\nIf you have the same problem, then add to the waiting list and I will notify you\nof the launch. I also have a question for you. What sites do you track mentions\non?",
  "data/reddit-projects/r/SideProject/comments/rlssps/explain_code_app_understand_code_like_never_before.json": "I'm launching a new tool to assist people with understanding code quickly.\n\nThis tool uses AI to provide easy-to-understand code explanations, code\nsummarization, class breakdowns and more.\n\n\n\nMy goal is to help new developers understand what the code the write does, while\nalso helping seasoned…",
  "data/reddit-projects/r/SideProject/comments/rlzvkv/ive_made_a_free_newsletter_that_sends_you_every.json": "Hi guys,\n\nwith a dear friend of mine I've created Wikibites, a free newsletter containing\nshort pills of culture every week about Art, History, Science, Technology, and\nwe'll add more topics as we go.\n\nYou can check it out here [https://wikibites.substack.com/] and if interested\nyou can subscribe…",
  "data/reddit-projects/r/SideProject/comments/rm0gfz/i_have_created_infinite_runner_with_cute_graphics.json": "I have worked 4 months as solo project and finished my first Android Infinite\nRunner game.\nI am interesting creating new games in the near future if this gets attention :)\n\nEvery like I get from you is another good motivation for me\nPlease download and like the game if you enjoy it…",
  "data/reddit-projects/r/SideProject/comments/rmcyjm/my_private_browser_just_beat_all_other_browsers.json": "So I found this website (adblock-tester.com) for testing adblock and obviously\nsince a huge part of Snap Search\n[https://play.google.com/store/apps/details?id=cybersky.snapsearch] is making\nsure ads/trackers/analytics are efficiently blocked, I was curious enough to\ncheck out how we're doing…",
  "data/reddit-projects/r/SideProject/comments/rmhwil/launching_strusocom_saas_app_platform_with_free.json": "I will soon be launching my Saas app platform with 20 Apps and offer a free\nlifetime Deal for up to 10 team members if you signup before we launch.\n\nhttps://struso.com/solutions/\n\nCampaign Tracking - Contact Management - Content Calendar - Customer Onboarding\n- Customer Relationship Management…",
  "data/reddit-projects/r/SideProject/comments/rnmpd2/me_my_husband_my_classmate_and_his_brother_have.json": "We've created a flexible tool that gives you freedom in what you can create\nwithout programming, yet is easy to use. Mindmaps. Complex networks. Words.\nPictures. Videos. Embed other webs. You got it all.\n\nMy husband promised his supervisor who was on a deathbed that he would promote a\nthinking…",
  "data/reddit-projects/r/SideProject/comments/rnt3qh/how_to_validate_your_side_project_idea.json": "I've been seeing quite a lot of people in this sub ask about how to validate\ntheir product idea before building it.\n\nIdea validation is definitely a worthwile investment. Best case scenario is that\nyou get confidence in your solution and might even have your first couple of\ncustomers lined up.…",
  "data/reddit-projects/r/SideProject/comments/rnuy27/pls_sign_up_for_our_beta_if_you_need_a_better.json": "Hi everyone,We just launched our new landing page\nfor https://www.synchronizd.com/.\n\nSynchronizd enables you to get busy people on your calendar fast by making\nresponding to your calendar invites, and rescheduling them, effortless. The\nplatform considers everyone's preferences to find the perfect…",
  "data/reddit-projects/r/SideProject/comments/ro5c6w/i_made_a_great_development_on_my_project_by.json": "Uni-Tie is a universal tie-down device that connects any two pieces of 8mm-12mm\nrope (continuous or individual) without any knots!\n\nThe main concept of personally creating this device is to help you connect any\ntwo piece without knots and my new device is also to help you replace the\nconcept of…",
  "data/reddit-projects/r/SideProject/comments/rodwyu/we_got_20k_users_in_6_months_today_we_are_live_on.json": "Hi Folks\n\nPH link - https://www.producthunt.com/posts/flickcall-teleparty-with-video-chat\n\nWe started Flickcall as side project in May this year. Since then it has gained\norganic traction and we are more than 20k+ users now. We added audio/video call\nas feature using webRTC. We expanded to 5…",
  "data/reddit-projects/r/SideProject/comments/rof9a0/please_roast_my_landing_page.json": "Hey everyone and merry Christmas!\n\nWorking on a new landing page:\n\nhttps://www.espri.io/y\n\nWould love to get any kind of feedback and suggestions for improvements, thanks\n🙏",
  "data/reddit-projects/r/SideProject/comments/rog3bj/i_created_a_toast_notification_component_to_use.json": "👋🏻 Hi There\n\nI've recently learned about web components and trying to build a simple\ncomponent to understand how it works. I've loved react-hot-toast so I'm trying\nto recreate it using web components and share it to npm so I can reuse it on my\nother projects who don't use React. Turns out it…",
  "data/reddit-projects/r/SideProject/comments/roqmum/ankiquizlet_vocabulary_learning_alternative.json": "Here is the link:\n\nhttps://flashi.netlify.app/\n\nLot of people use flashcard method to learn vocab. But creating a flashcard\ntakes a bit of time. You need to translate the word and add an image. So I had\nan idea to make it a bit easier to create new flashcard. My app has automatic\ntranslation and…",
  "data/reddit-projects/r/SideProject/comments/roxmsu/i_made_wind_of_change_a_social_notetaking_app.json": "I've always loved using Twitter for threads and \"thinking out loud\". But Twitter\nis also a slightly depressing experience — e.g. when I get likes but no replies,\nor when I scroll through the feed for half an hour and don't see anything I can\nreply to.\n\nSo I built my own app with threads: Wind of…",
  "data/reddit-projects/r/SideProject/comments/rpucwt/need_some_feedback_on_my_work.json": "Hello everyone. I've started a beta version of my startup recently and already\nhave some quite interesting results, but there is a problem out there - I have\nonly a few users and because of that, I can't evaluate the progress. It is a\nwebsite that uses AI to predict if stocks will grow and gives…",
  "data/reddit-projects/r/SideProject/comments/rq3k6j/it_would_be_great_if_there_was_something_like.json": "Examples\n\n1\n[https://web.archive.org/web/20070320134234/http://www.hfml.ru.nl:80/levitation…",
  "data/reddit-projects/r/SideProject/comments/rq71tt/ive_launched_my_first_saas.json": "Hi Everyone,\n\nNot generating revenue at the moment just have a few beta users. Hoping to\nacquire my first 10 users within the next couple of months.\n\nThe site offers businesses a way to send text messages to their customers\noffering discounts, promotions, or links to stores. Ideally this would be…",
  "data/reddit-projects/r/SideProject/comments/rqfwx7/we_built_a_cool_tool_for_compensating.json": "Some friends and I built a cool thing and I wanted to show it off. It's an\nEthereum-based tool that lets you pay out commitments to pay contributors in the\nfuture at defined milestones. (we happened to need that).\n\nHere’s the webapp if you want to play with it: https://contributorcredits.com/ .\nIt…",
  "data/reddit-projects/r/SideProject/comments/rqpmxq/tell_when_people_on_linkedin_are_humble_bragging.json": "I got annoyed at all the humble brags on LinkedIn, and I wanted to see if I\ncould at least make it more explicit on my feed when something was a humblebrag.\nI built this chrome extension\n[https://chrome.google.com/webstore/detail/humblebrag/enmddkghflcnpedhjjpfmidmdhlglncj?authuser=1]\nto autodetect…",
  "data/reddit-projects/r/SideProject/comments/rrb5rt/subtitle_software_took_over_a_year_to_finish_part.json": "I just launched a new version of the subtitle tool I built on product hunt\ntoday. I'm really excited to finally get this released after a year of work.\n\nhttps://www.closedcaptioncreator.com/lp/producthunt.html\n\nPlease feel free to check it out and let me know if you have any questions…",
  "data/reddit-projects/r/SideProject/comments/rrbfvr/how_much_money_should_i_ask_my_client_for.json": "I have developed this site for a client. This is my first freelance project and\nI don't have any idea how much to ask for. So kindly help me with that.\n\nsite - https://biocloud.vercel.app/",
  "data/reddit-projects/r/SideProject/comments/rrhlne/opensource_chat_app_with_no_history.json": "Inspired by Facebook's whistleblower confession about how Facebook cares more\nabout negative content and doesn't care about privacy, I decided to create an\nopen-source chat app.\n\nThis chat app doesn't save any history in the database. Chat history is active\nas long as you are in the conversation…",
  "data/reddit-projects/r/SideProject/comments/rrnwwj/i_created_a_free_website_that_pairs_philips_hue.json": "I just released a beta version of a site that allows you to connect your hue\nlights to live basketball games. Say the Miami Heat are playing the Los Angeles\nLakers -- As the Heat start to take a big lead, the room will grow more and more\nred in real time.\n\nI originally made this app just for myself…",
  "data/reddit-projects/r/SideProject/comments/rrqr6c/i_created_a_platform_to_help_you_validate_your.json": "👋 r/SideProject [/r/SideProject],\n\nDo you have a startup idea in mind which you would like to validate & maybe\nraise a \"domain-name round\" funding for?\n\nCheckout https://buymeadomain.com where you can submit your project & investors\ncan buy you a domain in return of 1% stake thus validating your…",
  "data/reddit-projects/r/SideProject/comments/rruu3v/ownstore_launch_your_online_store_instantly.json": "What is OwnStore? An end-to-end e-commerce solution that can be configured\naccording to your business needs. To simply put, you will receive a set of\nconfigurable projects to set up your online…",
  "data/reddit-projects/r/SideProject/comments/rry6qq/followup_feedback.json": "Hello everyone! You may have seen my previous post here, where I collected\nfeedback about my startup (an app that helps to find the most promising stocks\nusing AI). I carefully read all the suggestions and made adjustments to the\nsite, so I ask you to look at it again, for other possible issues.…",
  "data/reddit-projects/r/SideProject/comments/rs29sd/trying_out_something_new_in_the_edtech_space.json": "Hey guys,\nI've been working on this idea for the last six months as a solution to one's\nhomeschooling needs.\n\nwww.tomoclub.org [https://www.tomoclub.org/]\nIt basically focuses on learning life skills via gamification (The skills they\ndon't tach you at school). We're still working on the product…",
  "data/reddit-projects/r/SideProject/comments/rs44t7/humbo_the_imdb_of_travel.json": "Fueled by Vietnamese ice coffee, a friend, my girlfriend, and I have spent our\nevenings and weekends during the pandemic building Humbo.\n\nHumbo is where you can create a travel bucket list for the places you want to\nvisit, and a beautiful map of the places that you have already been to.\n\nThe idea…",
  "data/reddit-projects/r/SideProject/comments/rs6bdx/dashnoteapp_my_note_takingtask_tracking_side.json": "Project Link: dashnote.app [http://dashnote.app/]\nOver the last 6 months I've spent my free time here and there building a note\ntaking/task tracking app for myself. I've used quite a few existing products for\ntaking notes and tracking to-do's in the past, but none were exactly what I was\nlooking…",
  "data/reddit-projects/r/SideProject/comments/rsd8ww/i_made_2_minigames_on_ios.json": "Hello Reddit !\n\n9 months ago, I released my first apps to the App Store, I wanted to begin with\nsomething pretty simple before beginning to develop bigger applications.\n\nSo here are my 2 mini games : Janken and Toss it.\n\nFYI, Toss it is inspired by a mini-game on Rhythm Paradise (Nintendo DS)\n\nFeel…"
}