{
  "data/reddit-top/r/antiwork/comments/qpqcon/everyones_quitting_at_my_job_i_had_a_meeting.json": "I wrote my letter of resignation over the weekend. I'm submitting it tomorrow.\n\n:)\n\n\n\nEdit: For clarification, I accepted a job offer on Friday that's offering me way\nbetter pay, benefits, and work/life balance. This wasn't a spur of the moment\nthing, I was already planning on submitting my…",
  "data/reddit-top/r/antiwork/comments/qstsdp/my_5year_getting_paid_for_doing_nothing_is_over.json": "I got a night-shift job doing data entry back in 2015. I quit and needed\nsomething fast at night while I look for something better during the day.\n\nIt was a data entry position, meaning I get an email containing the details of\nan order and proceeding to input the information into our system.\n\nRight…",
  "data/reddit-top/r/antiwork/comments/qvlts5/half_of_my_offices_staff_is_quitting_today.json": "Last Thursday my office ( a dental practice in a very wealthy area of CA) had a\nmeeting and we were informed that we would only be approved for one day off per\nquarter. So 1 day off every 3 months. None of us in the office get ANY benefits.\nNo PTO, no medical, no holidays, nothing. We were also told…",
  "data/reddit-top/r/antiwork/comments/qw6jlz/getting_fired_for_refusing_the_vaccine_does_not.json": "I've seen a few posts here from people saying they're going to lose their jobs\nbecause they won't get the vaccine. \n\nYour decision not to get vaccinated has nothing to do with anti-work.\n\nYou're getting fired because you could be carrying a virus that has killed\nhundreds of thousands of people and…",
  "data/reddit-top/r/antiwork/comments/qzgqnr/from_a_manager_this_sub_has_changed_my_company.json": "Throw away because I don’t want this linked to my main account which includes\nwork related posts.\n\nI’m a senior manager at small firm (under 30 staff). During covid, our revenue\nskyrocketed as we were all able to work from home in a high demand industry. My\nboss, the business owner asked for my…"
}