{
  "data/reddit-projects/r/SideProject/comments/v2fj48/an_automated_assistant_to_increase_cold_email.json": "Hey guys! Every week I post here with a business idea from my newsletter, Daily\nIdea. If you’d like to find more of these ideas, I’ll leave a link to our\narchive at the bottom of this post.\n\nCold emails are a great sales mechanism. It is estimated that over 300 billion\nemails are sent every…",
  "data/reddit-projects/r/SideProject/comments/v2j5ku/a_social_media_platform_where_individuals_can.json": "I wanted to create a social platform that revolves around productivity and self\nimprovement through plans. There’ll be a feature called a “Plan” which will be\nused as a guide to help users accomplish what it is they wish to accomplish.\nIt’ll consist of primary and secondary steps (clicking on a…",
  "data/reddit-projects/r/SideProject/comments/v39g9w/niles_curated_uptodate_code_templates_for_your.json": "Hey, everyone,\n\nAs a freelance developer I think I've kickstarted new projects hundreds of times\nover the past 15 years. I have to say, the process gets old really quick,\nespecially in recent years. Booting up a fresh react project, integrating it\nwith state management and UI libraries du-jour,…",
  "data/reddit-projects/r/SideProject/comments/v4mhbk/i_will_redesign_your_website_for_1.json": "Yes, that's right I will redesign your website for a just a dollar.\n\nWhy am I doing this you ask? I'm trying to build up my design portfolio.\n\n\n\nHere's a website I recently redesigned for reference:\nhttps://astrsk-v2.webflow.io/\n\nhttps://monkedao.webflow.io/\n\n\n\nIf you're interested, pm me!",
  "data/reddit-projects/r/SideProject/comments/v4vvpp/discover_new_songs_on_spotify_faster_add_on.json": "Spotify Recommendations, TikTok songs, DJ sets, AUX road trips with friends and\nthe classic, “Wow, what is that groovy song that’s playing in the cafe right\nnow?” Often, we can easily tell whether we like a song by listening to just a\nshort snippet of it.\n\nSo for class, built an add on to Spotify…"
}