{
  "data/reddit-changemyview/r/changemyview/comments/kin9bc/cmv_college_is_a_better_setting_than_high_school.json": "I'm in my late 20s and I've graduated high school and college and I would say\nthat both were pivotal to me being the person I am currently. However, when I\nlook at pop culture aimed at younger people, it's 90% set in high school, with\nshows like Riverdale, Euphoria, Vampire Diaries, etc. I think…",
  "data/reddit-changemyview/r/changemyview/comments/kio2o4/cmv_if_an_artist_doesnt_write_or_produce_their.json": "At best they would be a performer, and if they lip sync then they're not a\nperformer, they're an entertainer. I just hate that people put people on\npedestals when they really didn't do anything. This goes for most pop artists,\nand a lot of rappers. Especially Kpop, if you dont know about that…",
  "data/reddit-changemyview/r/changemyview/comments/kiry0u/cmv_i_believe_the_power_of_a_us_president_to.json": "Though this would be a major constitutional change, the pardon system has been\nabused by both Democrats and Republicans, so a bipartisan solution under an\nincoming Democratic administration should be taken up and passed.\n\nWhen a president of either party becomes a lame duck, there is nothing…",
  "data/reddit-changemyview/r/changemyview/comments/kiuv0j/cmv_there_is_no_evidence_of_widespread_fraud_in.json": "Trump & Co claim this election was \"stolen\" by Biden, but have so far presented\nonly spurious evidence to back this up. Many of his claims are so patently wrong\n[https://www.reuters.com/article/uk-factcheck-milwaukee-detroit-lansing-p/fact-check-posts-claiming-more-votes-than-residents-in-milwaukee…",
  "data/reddit-changemyview/r/changemyview/comments/kiwhjs/cmv_reddit_is_too_eager_to_tell_people_theyve.json": "CW: rape\n\nI was reading another post on relationship advice last night. OP is unhappy in\nher marriage, she described how she wanted to stop having sex but her husband\nholds her down and keeps going.\n\nRight, that's rape, and OP needs to understand it's not okay at all so she can\nget out of that…",
  "data/reddit-changemyview/r/changemyview/comments/kj0dzd/cmv_people_who_hate_happy_holidays_are_more.json": "What I mean when I say “people who hate happy holidays”: People who complain\nvocally or online about how the phrase ‘Happy Holidays’ is bad in any way.\nOften, they are upset that ‘Happy Holidays’ diminishes their tradition or\nreligion.\n\nWhat I mean when I say “people who hate merry christmas”:…",
  "data/reddit-changemyview/r/changemyview/comments/kj0wa0/cmv_islam_is_not_a_feminist_religion_not_even.json": "EDIT- Just got my first ever death threat. I'll quote from my DM.\n\n\"You may think you're safe behind a keyboard but remember what happened to the\nCharlie Dubois cartoonist in france\"\n\nLovely.\n\n------‐-------------------------\n\nI've had to post this here because every where I go Muslims shut me down…",
  "data/reddit-changemyview/r/changemyview/comments/kj70z0/cmv_im_sorry_but_the_media_does_have_a_liberal.json": "definition of bias, that decisions are being made that are not a random\nrepresentation of the US population.\n\nDefinition of media. I actually don’t love the word media- but for this lets\ncategorize political media into three buckets: news, commentary/analysis, and\nentertainment. With entertainment…",
  "data/reddit-changemyview/r/changemyview/comments/kjefpw/cmv_if_a_couple_is_infertile_on_just_one_side.json": "Explaining the title a little bit, I mean that if in a cohabitating couple\nsituation where you’re actively wanting kids but one person is infertile while\nthe other is fertile, it is typically a better idea to adopt your child rather\nthan get a sperm or egg donor. My reasoning is as follows:\n\nIf, as…",
  "data/reddit-changemyview/r/changemyview/comments/kjfr9a/cmv_pardons_made_by_politician_shouldnt_be_a.json": "CMV: No President (or other politician) should be able to pardon felons. At the\nend of each presidency there are all these pardons for convicted criminals. It\ncomes to mind because of the more or less tit for tat pardons Trump is handing\nout. Don't get me wrong I do not think other Presidents should…",
  "data/reddit-changemyview/r/changemyview/comments/kjms1j/cmv_truly_inclusivediverse_groups_do_not_exclude.json": "I'll start out by saying that I don't believe white men face structural\noppression; and, I acknowledge that women and minorities do. To put it another\nway, my view doesn't challenge whether systems of oppression exist but rather\nhow many on the left increasingly attempt to counteract those systems.…",
  "data/reddit-changemyview/r/changemyview/comments/kjrr67/cmv_before_marijuana_was_legalized_a_cop_could.json": "No warrant? No problem! He could simply claim to smell marijuana odor coming\nfrom your vehicle and that alone would legally give the officer probable cause\nto search it, 4th Amendment be damned.\n\nAs for reporting the cop for conducting illegal searches, there was no way for\nyou to prove that there…",
  "data/reddit-changemyview/r/changemyview/comments/kk28o6/cmv_i_dont_think_being_overly_materialistic_is.json": "I’m in Denmark, this might be more or less applicable to different countries.\n\nI have a materialistic hobby: I like fashion. It brings me joy. I like making\nand maintaining clothes and putting different outfits together, and thus, it’s\nmore fun to have a great amount of clothes. This does not mean…",
  "data/reddit-changemyview/r/changemyview/comments/kk3v5v/cmv_most_people_dont_know_how_to_properly.json": "This is something I see every single day in real life, and online.\n\nI see this with couples quarrelling, friends or family having arguements and\nespecially how people discuss things online.\n\nIt's also a major problem for society as a whole as people have generally become\nextremely close minded…",
  "data/reddit-changemyview/r/changemyview/comments/kkiws7/cmv_uk_people_focus_too_much_on_the_career_aspect.json": "It really shocked me just how many people I have met in college/university that\nappear to be flatly disinterested in, or unenthusiastic about the subject they\nare currently studying.\n\nFrom what I have seen, people tend to choose a subject for study that just\n\"bores them the least\" and then they go…",
  "data/reddit-changemyview/r/changemyview/comments/kkmn94/cmv_race_doesnt_excuse_child_abuse.json": "I saw a YouTube video that had a guy sharing his stories about being beat as a\nkid. The one I saw was about one time when his dad beat him with a belt when he\nwas in the shower. It was horrifying seeing how many people in the comments were\njoking about it and saying how they had the same thing. I…",
  "data/reddit-changemyview/r/changemyview/comments/kkqin1/cmv_the_2nd_amendment_was_intended_to_overthrow_a.json": "\"We hold these truths to be self evident, that all men are created equal, that\nthey are endowed by their Creator with certain unalienable Rights, that among\nthese are Life, Liberty, and the pursuit of happiness - that whenever any form\nof Government becomes destructive to these ends, it is the Right…",
  "data/reddit-changemyview/r/changemyview/comments/kkwq7i/cmv_historical_shows_casting_should_focus_on.json": "There is many examples of Netflix doing this but in this instance am talking\nabout the show Bridgerton. Where the show is based on the elite class romance\naround the Victorian era Britain.\n\nAs a history vivid reader what am witnessing is a naive attempt to eradicate\nfacts and brainwash new…",
  "data/reddit-changemyview/r/changemyview/comments/kkz9oz/cmv_atheists_experience_the_same_existential_and.json": "Preface: I was raised in the southern United States within a \"holy rollin\"\nfamily. My late teens and early twenties were spent in the Infantry. Not present\nfather is Islamic (these two facts should help some zealots write off my\nopinion).\n\nThe very existence of religion is a side effect of an…",
  "data/reddit-changemyview/r/changemyview/comments/kl62q9/cmv_its_ok_to_blame_your_parents_for_your_issues.json": "I know a lot of people get annoyed by this and think they are just angsty teens\nor not talking responsibility, but I think sometimes it's ok to tell our parents\nthey did a bad job or made a mistake. It doesn't have to be disrespectful or\nnasty.\n\nI think this because recently I have realised that…",
  "data/reddit-changemyview/r/changemyview/comments/kl91t8/cmvall_pet_cats_should_be_kept_indoors.json": "There are so many reasons why pet cats should be kept indoors. One reason is\nthat cats predate greatly on local wildlife (especially birds and rodents)\nreducing biodiversity and competing with local predators. It’s also dangerous\nfor cats to be allowed to roam freely especially in urban areas, where…",
  "data/reddit-changemyview/r/changemyview/comments/klfgwk/cmv_what_you_post_on_twitter_facebook_or_youtube.json": "I keep seeing people freak out over 1st ammendment violations for social media\nsites censoring content.\n\nThese are companies. If you went into McDonald's and started screaming\nconspiracy theories they would kick you out. Is that a 1st ammendment violation?\n\nIf you don't like it, post what was…",
  "data/reddit-changemyview/r/changemyview/comments/klg8o3/cmv_wonder_womans_boyfriend_cannot_consent_to_sex.json": "There are some necessary spoilers ahead for the new Wonder Woman 1984 movie to\nunderstand my view.\n\nIn the new WW84 movie Wonder Woman wishes upon a magic rock that her boyfriend\n(played by Chris Pine) comes back to life (unintentionally, not really realizing\nthat it might come true). When a strange…",
  "data/reddit-changemyview/r/changemyview/comments/klgor9/cmv_the_majority_of_the_population_is_not.json": "Let me just make one thing clear, there is no better alternative to democracy at\nthe moment but my point stands in my mind. I believe this because of the need in\ngovernment to be able make highly intellectual decisions for a whole country\nthat will impact a vase majority of people. Generally…",
  "data/reddit-changemyview/r/changemyview/comments/klhc7r/cmv_the_president_of_the_us_should_not_have_the.json": "This give the “power to grant reprieves and pardons for offenses against the\nUnited States, except in cases of impeachment.” But the executive branch is not\nthe branch in charge of justice in the US and it definitely is not a monarchy.\n\"We the people\" are in charge of governing ourselves, even…",
  "data/reddit-changemyview/r/changemyview/comments/kls780/cmv_those_who_call_for_education_help_dont_care.json": "I see every day advertisements advocating for more funding for inner city\nschools because they don't have adequate access to STEM and computer science\neducation. However, with living in a rural area of a heavily rural state I've\nonly ever seen 1 person or advertisement advocating for rural…",
  "data/reddit-changemyview/r/changemyview/comments/klxqoj/cmv_cashiers_should_never_be_forced_to_stand_if.json": "Cashiers are rarely allowed to sit in grocery stores, and other retail jobs.\nSitting might sometimes affect the ability to perform certain tasks, but\ncashiers can stand for these, if needed. But in my experience, most cashier\nduties involve scanning, hitting buttons, and putting things in bags. All…",
  "data/reddit-changemyview/r/changemyview/comments/kly455/cmv_the_very_fact_that_we_need_lawyers_to.json": "Imagine you were trying to set up rules for people to follow in a game. Most\npeople don't get any help following the rules, such as keeping tack of them, or\nunderstanding them, and if they break them, regardless of weather they know they\nbroke them or not, you punish them. Then, you write a legal…",
  "data/reddit-changemyview/r/changemyview/comments/klyqdv/cmv_people_that_refuse_vaccines_should_not.json": "If people refuse a vaccination (that is people that refuse vaccinations for\nthemselves not parents refusing them for their children etc.) they should not\nrecieve free public heathcare. I'm from the UK so free public heathcare (NHS) is\nthe norm. I think that if you refuse a vaccine - which is clearly…",
  "data/reddit-changemyview/r/changemyview/comments/klzmme/cmv_if_you_eat_meat_you_cant_get_mad_when_people.json": "If you choose to eat more typical meat (cows, pigs, chickens, sheep, etc.) you\nshouldn't be judging people for doing the same thing with cats or dogs. The\ntruth is farm animals are just as alive and sometimes as smart as our pets and\nso if you believe it is okay to eat farm animals you can't also…",
  "data/reddit-changemyview/r/changemyview/comments/km43pb/cmv_opposition_to_illegal_immigration_does_not.json": "I'm an immigrant to the US. My parents came from Ukraine in 1994, I was\nfourteen. It was not easy, neither the application process nor the emotional\nupheaval, but my parents felt that our family was never going to a fair shake at\nsuccess in the corrupt anarchy that was Ukraine in the 1990s.\n\nI…",
  "data/reddit-changemyview/r/changemyview/comments/kmfcyb/cmvpsychedelic_drugs_are_significantly_less.json": "By saying psychedelic drugs - I mean 5HT2A receptor agonists: LSD and\npsilocybin.\n\n * These substances are orders of magnitude less harmful to the body than\n   alcohol. In fact, in recreational doses they haven't ever been shown to\n   possess have any poisonous qualities at all, meanwhile alcohol is…",
  "data/reddit-changemyview/r/changemyview/comments/kmgjsl/cmv_free_speech_and_name_calling_no_matter_how.json": "I saw a video of a guy dressed as a nazi get punched in the face and there were\nso many people agreeing with this. I absolutely in no way agree with that nazi\nbut violence was not warranted in that situation.\n\nIf someone calls you every horrible name in the book but is not physically or\nverbally…",
  "data/reddit-changemyview/r/changemyview/comments/kmmofa/cmv_if_youre_a_corporation_that_refuses_to_pay.json": "In a country with an increasingly-declining middle class, as well as a vast\namount of citizens who’re struggling to keep up with housing payments, I find it\nquite aggravating to see big, multi-million dollar organizations try their\nhardest to make sure that the wages are not properly fitting with…",
  "data/reddit-changemyview/r/changemyview/comments/kmpakt/cmv_superheroes_who_refuse_to_kill_regularly.json": "First I should just state up front my credentials here: I'm mostly familiar with\nthe MCU and DC films, but I have read a few comics in my day and certainly gone\ndown some deep wiki rabbit holes reading up on various characters and events.\n\nOne of the things that bugs me the most about these…",
  "data/reddit-changemyview/r/changemyview/comments/kmup0m/cmv_calling_your_movement_socialism_or.json": "I would just like to say that I am not an economist or a professional political\nphilosopher. I am merely someone who enjoys conversation and critical thinking\non recent events.\n\nThis is not meant to be a conversation on the pros/cons of socialism, or if\nsocialism or socialist ideas should be…",
  "data/reddit-changemyview/r/changemyview/comments/kn1h3t/cmv_sarcasm_doesnt_make_you_intelligent_or_cool.json": "Sarcasm is a really cool thing we have in language but I've met people that base\ntheir whole personality around it. I've read somewhere that sarcasm is a sign of\nintelligence. I don't know if I can agree with that. The ability to assess a\nsituation and use sarcasm correctly may be an indicator of…",
  "data/reddit-changemyview/r/changemyview/comments/kn70nz/cmv_capitalism_is_neither_inherently_good_nor_bad.json": "To be clear, I'm not arguing for or against capitalism. Under capitalism, people\nare allowed to give money or possessions to anyone they want. Therefore,\nvoluntary socialism could exist within a capitalist society, and gigantic\ndifferences in wealth do not have to exist.\n\nNo rules within capitalism…",
  "data/reddit-changemyview/r/changemyview/comments/knighn/cmv_life_is_unfair_and_thats_the_way_it_is_just.json": "This is probably the go to argument for anyone who can't justify some specific\nlaw and custom despite the harm it might bring but also wants to keep it for\nsome reason.\n\nThe argument seems to ignore that the world can improve and in fact did, mainly\nbecause of people who didn't accept the status…",
  "data/reddit-changemyview/r/changemyview/comments/knvpy2/cmv_female_nudity_in_tv_and_films_is_almost.json": "I came across a clip of an actress I was looking up - she’s relatively unknown\nand I was surprised to see she’s done work in front of the camera much less been\ntopless (and I’m not going to link the scene). It seemed like in that scene and\nso many others I’ve seen the characters are in a hurry, and…"
}