{
  "data/reddit-ask/r/AskHistorians/comments/r610yn/of_the_twentyfive_einsatzgruppe_commanders_a.json": "From Chapter 4 of Timothy Snyder's Bloodlands\n\n> Einsatzgruppen had been deployed in Austria and Czechoslovakia, but met little\n> resistance in these countries and had no special mission to kill selected\n> groups. It was in Poland that the Einsatzgruppen were to fulfill their mission\n> as…",
  "data/reddit-ask/r/AskHistorians/comments/r61pmh/why_did_napoleon_i_attack_to_seize_moszow_instead.json": "Was it because Moscow was the spiritual capital of the Russians? Was it the\nBritish Royal Navy making hugging the coastline too dangerous?",
  "data/reddit-ask/r/AskHistorians/comments/r6a31h/how_did_the_byzantines_blind_15000_people_after.json": "The story is that the Byzantines blinded 15,000 Bulgars after the Battle of\nKleidion, leaving every 100th man half-blind so he could lead the others home.\nHow is this even possible? It makes no sense.\n\n 1. How did the Byzantines logistically blind so many people? Even using hot\n    irons to blind…",
  "data/reddit-ask/r/AskHistorians/comments/r6c21g/columbine_was_not_the_first_school_shooting_so.json": "My brain decided to dig up some memories from when I was in 5th grade for some\nreason.\n\nWhile I've never studied the case in depth I do know what most people know or\nmaybe slightly more, just what happened and a general idea of why. (Why is\nalways a complicated thing, I try not to dig too deep into…",
  "data/reddit-ask/r/AskHistorians/comments/r6cuhu/how_come_the_netherlands_managed_to_pull_their.json": "The trading empire of the Dutch Republic would be impressive alone for it's\nachievements in trade and warfare, but it's astounding when you realize that by\n1600, the Netherlands had 1.5m for population! Compare that to 18m of France, or\n9m approx of Spain, or 5.6m by England.\n\nI get that they were…",
  "data/reddit-ask/r/AskHistorians/comments/r6eq5d/for_a_long_time_french_was_considered_the.json": "Ever since William of Normandy invaded England, French words have been used in\nthe English language and was predominantly spoken by the upper class. If French\nhad this distinct culture around it, then why did the phrase ‘Pardon my French,\nthat you say when you speak in a ‘lesser’ manner especially…",
  "data/reddit-ask/r/AskHistorians/comments/r6o5nf/since_the_supreme_court_justices_are_all.json": "Edit: I greatly appreciated the great answers regarding how the SCOTUS system\ncame to being. That was enlightening. I was thinking these questions because in\nthe last two months, I' ve read and listen to interviews from three different\nJustices, nominated by Democratic and Republican presidents,…",
  "data/reddit-ask/r/AskHistorians/comments/r70vye/was_hans_christian_andersen_mentally_disabled_or.json": "When you read about Hans' life you get the impression he was a bit... odd\n\nHe attended a school for children when he was 22. He would start acting scenes\nof his plays at social events, unprompted, often interrupting whatever was going\non. Charles Dickens was nice to him once and Hans took that as…",
  "data/reddit-ask/r/AskHistorians/comments/r74ogp/was_there_anything_to_stalins_accusations_that.json": "Or variations on this, say that they wanted the Soviets to take the brunt of\nGermany? Or with an eye toward post-war advantage?",
  "data/reddit-ask/r/AskHistorians/comments/r78gm2/why_do_so_many_documentaries_glorifies.json": "Nazi Germany is often portrays as an elite military machine instead of a brutal\nopressive regime.\n\nJulius Ceasar is remembered as a great conqueror and not a tyrant\n\nThe Congress of Vienna and the Industrial Revolution arguably have a bigger\nimpact than the Napoleonic Wars itself but are less…",
  "data/reddit-ask/r/AskHistorians/comments/r78ntn/how_did_we_come_to_have_two_very_different_ways.json": "These two.\n[https://upload.wikimedia.org/wikipedia/commons/thumb/a/a4/Vier.jpg/220px-Vier.jpg]\nThey seem pretty radically different when you think about it.",
  "data/reddit-ask/r/AskHistorians/comments/r78zxo/how_did_george_hw_bush_manage_to_lose_the_1992.json": "Desert Storm is mostly forgotten at this point, but it really is one of the\ngreatest triumphs in American history. The entire international community viewed\nIraq's invasion of Kuwait as illegitimate, and the US built a multi-nation\ncoalition to oust Saddam's forces. Everything followed…",
  "data/reddit-ask/r/AskHistorians/comments/r7bjju/howwhy_did_us_police_forces_become_so_militarized.json": "So I understand why British police forces are not armed and non-militarized. But\nhow come US police forces, particularly in the largest cities, are? And I don't\nmean just in terms of much weapons they carry, but how the very culture of\npolicing is based off of military culture in the US, such as…",
  "data/reddit-ask/r/AskHistorians/comments/r7d6n9/quebec_separatism_from_canada_was_a_significant.json": "Wondering this because I know very little about the relationship between the two\n\"nations\".",
  "data/reddit-ask/r/AskHistorians/comments/r7filw/how_accurate_is_the_fabricate_a_claim_task_in.json": "In Crusader Kings you play as a ruler during the crusades. One task you can give\nyour clergy is to Fabricate a Claim on some neighboring county. The implication\nseems to be that your bishop \"researches\" your family tree and provides forged\nevidence that you should be the true ruler of wherever. You…",
  "data/reddit-ask/r/AskHistorians/comments/r7kcv3/was_crime_up_or_down_in_the_us_in_the_years.json": "Pretty self explanatory, considering about 16 million men fought in WW2\n(according to national WW2 museum)",
  "data/reddit-ask/r/AskHistorians/comments/r7mj6a/why_were_empires_in_the_americas_high_up_in.json": "It seems empires in the Old World were lower in elevation, I'm sure there are\nseveral exceptions, I just want to know why the mountains were so important in\nthe New World.",
  "data/reddit-ask/r/AskHistorians/comments/r7tf4t/no_town_squares_outside_the_west_why_is_that.json": "This only hit me when I was driving through Turkey's Cappadocia region: town\nafter town without a single town square. We were driving and trying to find\nwhere these towns center were located (we'd guess a town square), but we simply\nfailed to find one.\n\nEven in Istanbul there are no really…",
  "data/reddit-ask/r/AskHistorians/comments/r7whzd/how_strong_was_strong_discipline_towards_children.json": "I've been researching child-rearing in the noble medieval English home (around\nthe 1300s). By today's standards, the level of physical discipline against\nchildren was very high - but what counted as \"strong\" or \"severe\" for the time?\nWas there a level of punishment which would be alarming to other…",
  "data/reddit-ask/r/AskHistorians/comments/r83p5q/did_native_americans_make_it_to_europe_before_1492.json": "I read an account where Christopher Columbus talked about men and women from\nCathay of extraordinary appearance washing up dead (I read another account that\nthey were alive) on two logs (probably canoes) in Galway in 1477 in the book\n“God’s Shadow” by Alan Mikhail. The author then goes on to…",
  "data/reddit-ask/r/AskHistorians/comments/r88qe0/how_old_is_mongolian_throat_singing_would_genghis.json": "For example, what is being depicted in this video.\nhttps://www.youtube.com/watch?v=AMndPTS0KLY",
  "data/reddit-ask/r/AskHistorians/comments/r8gw31/tsar_nicholas_ii_had_a_massive_tattoo_of_a_dragon.json": "In Tsar Nicholas II’s wikipedia page we have this passage:\n\n“In 1890 Nicholas, his younger brother George, and their cousin Prince George of\nGreece, set out on a world tour, although Grand Duke George fell ill and was\nsent home partway through the trip. Nicholas visited Egypt, India, Singapore,\nand…",
  "data/reddit-ask/r/AskHistorians/comments/r958ta/why_is_the_us_extermination_and_removal_of_the.json": "The actions of the US Government against the indigenous Native American tribes\nseem pretty clearly consistent with the accepted definition genocide (there is a\ngreat description by u/dhowlett1692 [/u/dhowlett1692]…",
  "data/reddit-ask/r/AskHistorians/comments/r986nk/sorry_if_this_breaks_the_rules.json": "As the title says, sorry if the question breaks the rules as this is more of a\nquestion about the sub than a question of history. But I joined the sub a few\nweeks ago with the hope of reading some interesting historical stuff. But every\ntime I click on a post it will say there are 10-50 comments on…",
  "data/reddit-ask/r/AskHistorians/comments/r9dy7m/robespierre_in_1791_in_on_the_death_penalty_used.json": "Edit: I should have clarified it better: Like how the image of Qing monarch in\nEurope was that of sage king not unlike that of a philospopher king unlike his\nwar self, how did European of the era \"know\" or see Japan",
  "data/reddit-ask/r/AskHistorians/comments/r9fvzw/why_1848.json": "I've always learned about the year 1848 as the \"Year of Revolutions\" and I\nunderstand why it is called so, but I've never managed to find any explanation\nas to why all this happened in 1848 specifically? Why not 10 years later or\nearlier? Were there some continent wide favourable conditions for…",
  "data/reddit-ask/r/AskHistorians/comments/r9o0ew/why_did_italian_city_states_never_attempted_to.json": "It was weird that Italian states like Genoa and Venice did not attempt to find\nnew trade routes. They had a lot of capitals to spare thanks to their banking\nand trade; they had a lot of reasons to discover new routes (as the Ottoman was\ntheir main enemy); they had the naval expertise to do so…",
  "data/reddit-ask/r/AskHistorians/comments/r9wldr/how_did_the_erroneous_association_of_mary.json": "Mary Magdalene is one of the most prominent women in the New Testament, and\nwhile she is decidedly not a sex worker in the actual text, she nevertheless is\noften described as such, a misreading of some passages which in fact refer to\nanother, unnamed woman. How did this mistake come to be and why…",
  "data/reddit-ask/r/AskHistorians/comments/ra0t4h/when_joe_medicine_crow_joined_the_us_army_at_the.json": "I would want to guess with no facts that is was prejudice against native\namericans at the time, but I'd like to know more about how draftees were\nselected for officer school to become 2nd Lt's . It seems a college degree was a\nstrong indicator for becoming an officer. Why wasn't Joe Medicine crow…",
  "data/reddit-ask/r/AskHistorians/comments/ra2bue/what_kind_of_street_clutter_would_an_ancient.json": "To preface this question and try and explain what I'm trying to ask: By \"street\nclutter\", I don't only mean trash laying on the street, though that is\ndefinitely a type of it. By street clutter, I mean all things that are randomly\nlaying on the streets, that weren't perhaps intended to be there,…",
  "data/reddit-ask/r/AskHistorians/comments/raebi7/when_and_why_did_western_generals_and_monarchs.json": "It's easy to criticize conquerors who went to war for personal fame, glory, and\nspoils. But for all of Caesar's, Alexander the Great's, and Richard the\nLionheart's faults, you do have to give them some credit for putting their own\nlives on the line to accomplish their goals. Each could easily have…",
  "data/reddit-ask/r/AskHistorians/comments/rah74a/was_paris_cheap_in_the_1920s_or_artists_well_off.json": "Hello,\n\nbeen reading a memoir of Hemingway about his life in Paris as a young writer. A\nrepeating motif is that of dining out, drinking lots of wine and rum, always\nstaying in a café/restaurant, spending money on trips and lots of \"pension\"\napartments. Hemingway himself recalls in the book that…",
  "data/reddit-ask/r/AskHistorians/comments/rakg19/the_modern_era_has_produced_some_fantastic.json": "Did ancient cultures have any intriguing visions of the future in this vein? I\nunderstand perceptions of time were different in different cultures and times,\nbut are there examples of humans imagining a technologically advanced or\n“enlightened” (etc.) point in the future?\n\nIf not, why is this…",
  "data/reddit-ask/r/AskHistorians/comments/rax9oy/in_fiction_the_idea_of_a_hidden_city_is_not.json": "I am curious because the idea of hiding the location whole city doesn't seem\nviable, but maybe I am underestimating the size of the world and/or\noverestimating the spread of information and maps.\n\nIt is a bit of a different question, but if it is not based on historical ideas,\nwhat was the first…",
  "data/reddit-ask/r/AskHistorians/comments/raysc8/im_a_woman_in_the_bronze_age_with_no_special.json": "The impression I've gotten is that copper and bronze knives were prestige items,\nnot necessarily something that every household would have used for cutting meat\nor fibers, but what about stone knives? Obsidian blades? How common a tool was a\nknife for the average person? Do we know?\n\nI've read…",
  "data/reddit-ask/r/AskHistorians/comments/rb1fi1/how_did_new_zealands_colder_climate_mountainous.json": "New Zealand isn't really a small country [https://i.imgur.com/hRNugex.jpg]\nespecially compared to the pacific islands that the Polynesian peoples settled.\n\nDid their society become more complex because the vast amount of land they could\npopulate? More complex agriculture?\n\nDid their villages become…",
  "data/reddit-ask/r/AskHistorians/comments/rb32wf/how_fluent_were_19thcentury_polyglots.json": "I've often encountered records of notable 19th-century figures being fluent in\nmultiple different languages, often with two or three living languages and a\ncouple of dead languages (Latin, Ancient Greek, etc.). A few examples:\n\n * Carl Friedrich Gauss understood most of the principal European…",
  "data/reddit-ask/r/AskHistorians/comments/rbal2y/how_did_people_come_to_a_consensus_about_what.json": "I’m not trying to stir things up about crystals and peoples’s faith, I’m just\nwondering how people in the west came to an agreement about these things. I\ncould understand if it was something like “Traditional Han culture associated\nxxxxx with xxxx”\n\nOr “in Ancient Rome, xxxx was believed to…",
  "data/reddit-ask/r/AskHistorians/comments/rbf9fb/my_grandfather_left_me_a_samurai_statue_before_he.json": "pictures of the statue [https://imgur.com/a/jwf8vbg]",
  "data/reddit-ask/r/AskHistorians/comments/rbkjsk/how_did_high_rates_of_parental_ptsd_impact_the.json": "Many baby boomers were raised by fathers who were part of the greatest\ngeneration that fought in World War II or the silent generation that fought in\nthe Korean War.\n\nGiven that so many men of these generations saw combat, it is likely that many\nof them had PTSD. How did this impact the upbringing…",
  "data/reddit-ask/r/AskHistorians/comments/rbreiy/what_was_the_public_reaction_when_in_1924_hubble.json": "I am curious to know what the public reaction was, if any, and how different\nsectors of society responded to the discovery.",
  "data/reddit-ask/r/AskHistorians/comments/rbsza3/why_did_the_kkk_burn_crosses.json": "The KKK are a Christian group, so wouldn't the burning of a cross be considered\nblasphemous? What was the significance of that act?",
  "data/reddit-ask/r/AskHistorians/comments/rbzyvg/if_it_wasnt_for_the_oil_there_would_be_no_islamic.json": "I was having a conversation with a friend and he said that the reason for\nterrorism is because the Arabs (he didn't mean Arabic speaking people, he meant\nthe actual Arabs in gulf countries more specifically Saudi Arabia) used oil\nmoney to fund the Islamic revival movement in the 70s (\"Islamic…",
  "data/reddit-ask/r/AskHistorians/comments/rc0das/whats_the_context_of_this_portrait_of_tsar.json": "Here is the portrait in question.\n[https://commons.m.wikimedia.org/wiki/File:%D0%90%D0%BB%D0%B5%D0%BA%D1%81%D0%B0%D0%BD%D0%B4%D1%80_%D0%BF%D0%B5%D1%80%D0%B2%D1%8B%D0%B9_…",
  "data/reddit-ask/r/AskHistorians/comments/rcacjf/i_read_that_the_mongols_were_mass_producing_texts.json": "Title basically says it all, came across this reading \"Genghis Kahn\" and it made\nme scratch my head. I was always taught Gutenberg took Europe from labor\nintensive manual transcription to modular type. But it appears similar\ntechnologies already existed at least among the huge and widely…",
  "data/reddit-ask/r/AskHistorians/comments/rcaj2p/im_a_rich_married_roman_noble_woman_i_live_either.json": "Is our obsession with weight another leagacy handed to us by the Romans?",
  "data/reddit-ask/r/AskHistorians/comments/rcdxe1/has_japan_ever_officially_apologised_for_their.json": "Japan has committed similar warcrimes during the time as Nazi Germany and while\nin Germany there have been major efforts (and successes) in order to\nrehabilitate their international image and educate their people to prevent any\nsimilar events in the future (accompanied by a universal regret and…",
  "data/reddit-ask/r/AskHistorians/comments/rce4g9/nsfw_condoms_suitable_for_use_as_birth_control.json": "If the availability of birth control was the main reason behind the Sexual\nRevolution, then why did condoms not spark it?",
  "data/reddit-ask/r/AskHistorians/comments/rckpo7/i_heard_an_expert_suggest_that_the_battle_of.json": "I was listening to an episode of the BBC Radio 4 show \"In Our Time,\"\n[https://www.bbc.co.uk/sounds/play/m0012141] and I heard this from James Davey,\na lecturer on naval and maritime history. He's comparing the reaction to the\nvictory from the British public (sorrow over Nelson's death, displays…",
  "data/reddit-ask/r/AskHistorians/comments/rcubmg/was_bubblegum_flavour_ever_l_supposed_to_taste.json": "The classic \"bubblegum flavour\" is distinctive but, to me, is not particularly\nreminiscent of anything in nature.\n\nWas the flavour based on something else?\n\nWould it have been recognizable as an imitation of a different food when it was\ndeveloped or became popular?",
  "data/reddit-ask/r/AskHistorians/comments/rd7tem/artillery_inflicted_6075_of_combat_casualties.json": "Specifically, were there substantial gaps in accuracy, range, firing speed,\nreliability between models? If there were differences, was any of it because of\ndoctrinal differences?",
  "data/reddit-ask/r/AskHistorians/comments/rdmppw/in_tacitus_germania_he_mentions_the_names_of_many.json": "I was inspired by coming across this map of the Roman Empire in 125CE\n[https://upload.wikimedia.org/wikipedia/commons/b/bb/Roman_Empire_125.png] and\nsaw the names of all of the Germanic tribes. I know that the suffix \"i\" or \"es\"\ncomes from Latin, and I was curious if these names would be any kind…",
  "data/reddit-ask/r/AskHistorians/comments/rdz8wy/could_you_be_unwillingly_in_the_luftwaffe_during.json": "My great-grandfather was German and was a pilot in the Luftwaffe. He died in\n1940 because his plane fell down. He had a Dutch wife and a young son at the\ntime (who was ironically born a day before the German invasion in The\nNetherlands). My family always told me that he didn't want to join the…",
  "data/reddit-ask/r/AskHistorians/comments/rdz9ku/is_genghis_khan_a_name_or_title.json": "For context, I'm doing some first-time research on the Mongol Empire. I've been\nlooking into its origin and leaders and am confused about Genghis Khan, is that\nhis name, or a title given to him? I've seen that as his name, but I've also\nseen it as a title. For example, Britannica Encyclopedia says…",
  "data/reddit-ask/r/AskHistorians/comments/re07ah/why_did_the_aristocracy_bother_themselves_with_so.json": "One could understand why a lowly baron might eye a duchy or why a duke might\ncovert a throne. But why do kings wage war? If you are a French nobleman in the\nlate middle ages, your estate already provides you with plenty of food,\nentertainment, luxury, and the opportunity for a mistress or two or…",
  "data/reddit-ask/r/AskHistorians/comments/re7tla/the_first_humans_to_arrive_in_the_americas.json": "Also, I've read that these first arrivals left remains that appear somewhat\ndifferent than later arrivals. Were they from Europe rather than Asia? Did they\nhave more neanderthal blood?",
  "data/reddit-ask/r/AskHistorians/comments/rebpnf/why_do_older_accounts_of_epidemics_often_talk.json": "In some accounts of certain epidemics, the usual symptoms are mentioned : fever,\nchills, coughing and so on (but nothing about sores or pustules). But these\naccounts often talk about a stench associated with the disease : a fetid\nsweating, or just a general foul smell about the sick person. We have…",
  "data/reddit-ask/r/AskHistorians/comments/refwjo/did_the_ancient_canaanites_really_sacrifice_their.json": "As an amateur student of history, something I’ve discovered is that claims like\n“OUR ENEMIES LITERALLY BURN BABIES ALIVE AND WORSHIP SATAN” are usually not\ntrue, or at least based on heavy exaggeration or cultural misunderstanding. How\ncommon was infant sacrifice in the Levant during this…",
  "data/reddit-ask/r/AskHistorians/comments/rem7ik/did_algeria_have_a_higher_literacy_rate_than.json": "In 1830 France invaded Algeria starting a 132 long years of French rule. A\ncommon justification used by the French at that time and even today for the\nFrench colonization was that they were in a mission to spread civilization to\nthe barbarians. Algerians will always point out that literacy rate in…",
  "data/reddit-ask/r/AskHistorians/comments/remo83/til_that_rationing_in_britain_lasted_until_1954.json": "Meat was rationed until 1954. I understand it in continental Europe which was\ndevastated by the war, but how did it take so long to restore food supply to\nBritain, after supplies from the US could now get through again?",
  "data/reddit-ask/r/AskHistorians/comments/reymxe/is_it_possible_that_the_bible_is_nothing_other.json": "When looking at the Bible it is a great piece of literature. Furthermore its a\nknown fact that the bible was written and edit by man so whats the possibility\nthat the Bible started off as Folktales?",
  "data/reddit-ask/r/AskHistorians/comments/rf2pqp/was_cunnilingus_a_common_practice_in_the_mid1700s.json": "I’m sure you’re reading that question and thinking “why would you ask that?” I\nhave been watching the Hulu original show The Great. It is wildly historically\ninaccurate in almost every way (but still hilarious), so I feel like I already\nknow the answer, but I figured I would ask anyways. In this…",
  "data/reddit-ask/r/AskHistorians/comments/rffqtb/before_dickens_was_christmas_just_a_minor.json": "It seems in recent years, especially in popular media (e.g. \"The Man Who\nInvented Christmas\"), there's this idea that Christmas wasn't important to the\naverage person. This strikes me as wrong, but I don't know much about the\nhistorical celebration of the holiday outside of other works of fiction…",
  "data/reddit-ask/r/AskHistorians/comments/rfguuv/redditors_marvel_in_the_glory_of_your_new_mods.json": "In a time of darkness, in a place devoid of hope, a few champions stood between\nhumanity and the galactic threat of the apocalypse of the forgotten past.\nWithout these purveyors of the past, these archivists of antiquity, these\nreporters of the ancient record, half the population of the redditverse…",
  "data/reddit-ask/r/AskHistorians/comments/rfjvd6/why_is_broth_clear_in_western_cooking.json": "I’ve been on a recent ramen making bender, and noticed a stark difference\nbetween the western (read:French) and Japanese broth cooking methods. In French\nstocks the bones are boiled at barely a simmer to avoid emulsifying fats and to\nmake as clear a stock as possible. In a Japanese paitan (cloudy…",
  "data/reddit-ask/r/AskHistorians/comments/rfkgml/during_the_american_and_french_revolution_salons.json": "Mike Duncan, in his Revolutions podcast, talks about their importance in many\nepisodes (notably, 3.22 about Madame Roland) and how the aristocratic women used\nsalons to counter their limited rights to participate in government. How did\nthey use the salons to shape our democratic future? How did…",
  "data/reddit-ask/r/AskHistorians/comments/rfme97/why_did_abu_bakr_decide_to_order_the_chapters_of.json": "This is one of the first thing you are told when you learn about islam and it\nhas never made much sense to me. Ordering the chapters by chronological order\nseems like the logical choice since it would make it easy for the reader to\nunderstand the \"revelation\" in the order it was \"revealed\"\n\nInstead…",
  "data/reddit-ask/r/AskHistorians/comments/rfz7ek/was_nancy_reagan_really_renown_for_performing.json": "I understand that this question is rather uncouth, but in light of current\nevents I have become curious as to the validity of rumors of Nancy Reagan's past\nsexual exploits that have been recently floating around Twitter and beyond. To\nmy knowledge most of these rumors have their roots in Kitty…",
  "data/reddit-ask/r/AskHistorians/comments/rg80ro/were_roman_toilets_unisex.json": "This is such a stupid question but I recently visited Roman ruins (more\nspecifically Vaison-la-Romaine, a beautiful spot) and you can see the remnants\nof public toilets attached to the forum, but there's just one room.\n\nSo I was wondering, what's the deal here? Were Roman toilets unisex, or…",
  "data/reddit-ask/r/AskHistorians/comments/rg8idk/was_leonardo_da_vinci_really_the_strongest_man_in.json": "I've read a few references to Leonardo da Vinci's great strength and physical\nabilities and was wondering if there were any records or history of what sort of\nworkouts he would do. How impressive was bending a horse shoe or door knocker in\nhis hand? What did Vasari mean when he said Leonardo was…",
  "data/reddit-ask/r/AskHistorians/comments/rggqva/do_we_have_any_sources_detailing_sex_lives_of.json": "Full eunuchs1 that didn't undergo male puberty were quite prominent in ancient\nand Medieval history.\n\nThe question that has been bugging me for quite some time was whether eunuchs\nenjoyed receiving anal sex. For one, even discounting the effects of rectal\nstimulation, all types of eunuchs still had…",
  "data/reddit-ask/r/AskHistorians/comments/rgpkt8/did_caracalla_actually_kill_guy_over_a_pun.json": "So I was reading How Rome Fell by Adrian Goldsworthy when I came across this\nline, “Pertinax’s son, who had been too young and unimportant to be worth\nkilling in 194, died now, because he could not resist making a pun referring to\nthe murder of Geta.” (Goldsworthy 71) and stopped. Two questions…",
  "data/reddit-ask/r/AskHistorians/comments/rgr5vq/my_professor_mentioned_the_argument_that_romantic.json": "Alternatively, am I misunderstanding the argument? It was mentioned while my\nprofessor discussed marriage among peasants in Reformation Europe.",
  "data/reddit-ask/r/AskHistorians/comments/rhdv28/why_is_romania_so_roman_they_are_the_only_country.json": "Looking at a map\n[https://upload.wikimedia.org/wikipedia/commons/0/0b/Romance_languages.png] of\nthe distribution of Romance languages in Europe, Romania is a clear outlier,\nwith Spain, Italy, and France lying far to the west and all bordering each\nother.\n\nFurther, much…",
  "data/reddit-ask/r/AskHistorians/comments/rhgz41/everything_ive_read_about_sieges_of_castles_has.json": "I've read a few answers about sieges on the sub, and they're always fantastic!\nSomething I've noted is that every answer has said that a breach of the walls\nmeant sure defeat, but also mention the besieged party preparing secondary\ndefensive positions inside the walls to continue the defense. Did…",
  "data/reddit-ask/r/AskHistorians/comments/rhokx5/meta_question_why_do_so_many_questions_here_have.json": "I’ve noticed that there are a large number of questions asked on this subreddit\nthat start with a ‘role play’ premise, e.g. ‘I am a farmer in C18th rural\nVirginia’. Is there a reason for this?\n\nI have never come across historical questions being framed in this way before\njoining this subreddit, but…",
  "data/reddit-ask/r/AskHistorians/comments/rhp57n/what_is_the_origin_of_lap_sports_being.json": "While I'm aware of exceptions (multiday ultramarathons for eg), it seems most\nlap based races are anticlockwise. Running, cycling, and ice skating spring to\nmind.\n\nIs there a distinct origin to this? I wondered perhaps if it dates back to\nchariot races - but perhaps I've just seen clips from Ben…",
  "data/reddit-ask/r/AskHistorians/comments/rhr6lv/did_pol_pots_regime_benefit_anyone.json": "Everything I have seen and read about Pol Pots Cambodia makes it seem almost\nludicrously and pointlessly evil in a way that really only benefited Pol Pot.\nSurely he must have at least accidentally done something good. Did he?",
  "data/reddit-ask/r/AskHistorians/comments/rhv66w/why_does_the_bible_translate_joshua_to_jesus_but.json": "Because Jesus would have been “Joshua ben Joseph” and “Jesus” is the Greek\ntranslation… so why translate the one and leave the others?",
  "data/reddit-ask/r/AskHistorians/comments/rhydpm/did_average_roman_slaves_really_have_more_time.json": "So... A friend of mine has a dual masters in history and US history. I'm\nsomething of a history enthusiast myself though I lack the degree. I just like\nthe books and learning about all the crazy shit humans have been up to.\n\nHim and I had an interesting conversation recently. He stated that most…",
  "data/reddit-ask/r/AskHistorians/comments/ri47pw/in_stan_rogers_song_barretts_privateers_a_royal.json": "A \"sickening sight\" with a \"list to the port\" and \"sails in rags\" that requires\nconstant pumping to stay afloat, to be precise -- with predictable results,\nnamely getting sunk in one shot by an American merchant vessel. Were letters of\nmarque really granted to vessels with such a low chance of…",
  "data/reddit-ask/r/AskHistorians/comments/ri7v2u/were_black_african_slaves_in_the_united_states.json": "I've read several accounts of what the diet of enslaved Africans in the United\nStates was like. It varied by region — rice based in rice-growing areas.\nCorn-based elsewhere. They were often allowed to garden, and their diet included\nleafy greens, beans, watermelons, and a mix of other veggies and…",
  "data/reddit-ask/r/AskHistorians/comments/rig0rv/in_europe_it_was_common_for_monarchs_and_popes_to.json": "I know that Thailands monarchy uses them since the current Monarch is Rama X\n(the 10th), so I’m guessing regnal numbers are not strictly European.",
  "data/reddit-ask/r/AskHistorians/comments/rik3u4/what_is_the_history_of_online_content_moderation.json": "Inspired by the recent META threads and seeing the mods out in force, it got me\nthinking about what the early days of moderation on the internet was like. Have\nthere always been moderators? Did the early forums and chat rooms have any kind\nof moderation or was it more of an anarchic free for all?",
  "data/reddit-ask/r/AskHistorians/comments/riq8fs/coinage_is_believed_to_have_been_invented_by_the.json": "It seems surprising that something so fundamental as currency and coinage should\nemerge so late in history. Are we perhaps biased by the lack of evidence in\nterms of coins discovered in claiming that the Lydians invented metal coinage?\nWhat did the Egyptians or the Assyrians use for trade before…",
  "data/reddit-ask/r/AskHistorians/comments/ritrky/during_the_cold_war_john_f_kennedy_received_two.json": "Of the sources I found they usually just say that these \"pupniks\" were given\naway to other dignitaries, is there any information from what happened past\nthat?",
  "data/reddit-ask/r/AskHistorians/comments/rj3jy4/it_is_widely_known_here_that_the_mediaeval.json": "How similar (or how different) were medieval European bathhouses to their Roman\ncounterparts? I am aware that the Middle Ages were long, and spanned a vast\narea, which makes it difficult to generalise things. But I'm just looking for an\noverview.",
  "data/reddit-ask/r/AskHistorians/comments/rj5ylz/the_lightbulb_conspiracy_in_europe_and_the_us.json": "So my inclination here is no, the Soviet Union wouldn't have included planned\nobsolescence into anything they did, but I'm curious if anyone noticed that\nsoviet bulbs were longer lasting, or if this was ever used as propaganda or if\nperhaps they just had inferior technology and therefore didn't…",
  "data/reddit-ask/r/AskHistorians/comments/rj6l32/when_did_the_watering_down_of_mlks_message_began.json": "By watering down, I mean stuff like the public consciousness simplifying and\ndumbing down his message to just a simple message about unity, anti-racism, etc.\n(Not mentioning much of his struggles to get a majority of Americans to care\nabout Civil rights, not mentioning much about his anti-Vietnam…",
  "data/reddit-ask/r/AskHistorians/comments/rj9mus/why_dont_we_have_different_leaders_names_for.json": "From my understanding of history, capitalism has had thought leaders as well.\nWhy don't we have Lockian capitalism or FDR capitalism? I know we have Keynesian\neconomics, but that doesn't feel like it has the same heft.\n\nI know this is probably a much bigger question than I am making it, but I…",
  "data/reddit-ask/r/AskHistorians/comments/rjb7r8/how_did_people_know_the_spanish_flu_epidemic_had.json": "The go-to historical comparison for COVID-19 has been the Spanish flu pandemic\nof the late 1910s. Given that we still have new strains of the flu every autumn,\ninfluenza obviously isn't completely under control/eradicated. So when did\npeople know they were past the danger point for the Spanish flu…",
  "data/reddit-ask/r/AskHistorians/comments/rjgc5z/israels_legal_definition_of_a_jew_is_the_same.json": "In order to immigrate to Israel, an individual has to establish his Jewish\nheritage. This can be done by proving that at least one grandparent was Jewish.\nBased on the Nuremberg Race Laws of 1935, a German would be considered a\n\"mongrel\" if he had one Jewish grandparent, and would therefore be…",
  "data/reddit-ask/r/AskHistorians/comments/rk2tvq/did_people_in_medieval_europe_really_practice.json": "According to \"Growing Up Sexually World Reference Atlas\", a secondary source\nwhich I haven't been able to find evaluations of, historical data points towards\nthe possibility that: \"Genital soothing may well have been widespread in\nMedieval Europe\". In other words, that adults would stimulate the…",
  "data/reddit-ask/r/AskHistorians/comments/rk7b9i/meta_how_did_raskhistorians_attract_historians.json": "This subreddit is something rather special in the wide ocean of the Internet -\nand while we at times complain about the strict enforcement\n[https://www.reddit.com/r/AskHistorians/comments/fsz73v/april_fools_2020_rhistoricalaita_is_in_full_swing/?utm_medium=android_app&utm_source=share],\nI dare say…",
  "data/reddit-ask/r/AskHistorians/comments/rko03c/ama_with_dr_matthew_gabriele_and_dr_david_perry.json": "Howdy! We’re 2 medieval historians and authors of the brand new (just out\nDecember 7) The Bright Ages: A New History of Medieval Europe\n[https://www.harpercollins.com/products/the-bright-ages-matthew-gabrieledavid-m-perry?variant=39299550773282] with\nHarper Books. Matthew Gabriele…",
  "data/reddit-ask/r/AskHistorians/comments/rkwdh9/did_rennaissance_people_struggle_to_read_their.json": "I sometimes come across notes written by Galileo, Copernicus and other people\nfrom centuries ago and find their handwriting extremely difficult to read.\nSometimes, book authors leave notes saying that some texts are yet to be\ndeciphered. Is it a problem associated with the ink and paper…",
  "data/reddit-ask/r/AskHistorians/comments/rl3b9k/why_did_small_cities_like_ft_wayne_rochester_and.json": "The NFL famously was founded in an auto dealership in Canton, Ohio, home of one\nof the original teams. Other early franchises included big burgs like Dayton,\nDuluth, Muncie and Tonawanda. The NBA’s history includes metropolises such as\nRochester, Syracuse, Fort Wayne and even lovely Moline,…",
  "data/reddit-ask/r/AskHistorians/comments/rl3kjo/were_the_people_who_danced_during_the_dancing.json": "were they possesed? what happened to those who survived, what did they say\nafterwards?\n\nthis is a historical event that I just don’t understand.",
  "data/reddit-ask/r/AskHistorians/comments/rlcu6y/in_chinese_feng_shui_buildings_must_be_built_with.json": "These rules seem very specific and part of me wonders if there is a practical\nand historical reasoning for these rules that had spiritual meaning layered on\ntop of it over time.\n\nAre there any Chinese historians that can shed light on the reasoning?",
  "data/reddit-ask/r/AskHistorians/comments/rld13u/why_was_churchill_so_determined_to_continue_the.json": "I understand he did not want England to lose or get invaded, so there were valid\nreasons to never surrender. I just don't know what his personal reason was for\nnot trying to sue for peace. There was several times during the second World War\nwhere Churchill could have offered peace with Germany and…",
  "data/reddit-ask/r/AskHistorians/comments/rll0d0/why_did_britain_want_to_hold_onto_ireland_so_badly.json": "Because they gave Canada and Australia and New Zealand independence, meanwhile\nthey held onto a pretty small island compared to the rest.\n\nAlso this is my first time being on this sub please let me know if I did\nsomething wrong.",
  "data/reddit-ask/r/AskHistorians/comments/rln1py/what_the_heck_was_dr_bronner_talking_about_on_the.json": "There’s a pretty famous brand of “new age” liquid soap in the US called Dr.\nBronner’s. The label has since been changed (to sell their book), but for a very\nlong time the label was end-to-end text that was, and I know I’m being blunt\nhere, totally crazy. There’s “quotes” from Muhammad, Abraham, and…",
  "data/reddit-ask/r/AskHistorians/comments/rlpdip/noam_chomsky_claims_from_the_romans_into_the_late.json": "Source: Ezra Klein Podcast interview with Chomsky\n[https://music.amazon.com/podcasts/c4a3b1da-5433-49e6-8c14-0e1da53be78c/episodes/2abbdce5-8eae-45d8-84b3-ef286c9b849d/the-ezra-klein-show-best-of-noam-chomsky's-theory-of-the-good-life].\n7:16 mark.\n\nA couple of thoughts:\n\n * Perhaps this existed as…",
  "data/reddit-ask/r/AskHistorians/comments/rlpei7/throughout_the_roman_empire_augustus_was.json": "I tend to think of Caesar alone as one of the junior emperors in Diocletian’s\ntetrarchy or the title given to the emperor’s son as presumptive heir. Why\ndidn’t the Russians, Germans, etc name their Monarchs “Augustus” rather than\n“Caesar”? Wouldn’t you want the biggest, baddest title around?",
  "data/reddit-ask/r/AskHistorians/comments/rm5avm/how_rich_did_one_have_to_be_in_the_us_in_19th.json": "So, I was listening to a podcast that was discussing the Hope Diamond and the\nMacLean family. And in mentioning the death of their son Vinson, there had been\na discussion of the expansion of household staff beforehand to include personal\nsecurity to protect him from being kidnapped.\n\nThis led me to…",
  "data/reddit-ask/r/AskHistorians/comments/rm8egb/a_common_strategy_game_trope_is_that_spearmen.json": "I understand that pike-armed infantry in close order are poor targets for\ncavalry, but didn't these only become common in the 15th Century? Before that,\nhow did spear-armed infantry perform against cavalry?",
  "data/reddit-ask/r/AskHistorians/comments/rm8pad/how_do_we_know_that_marcus_aurelius_actually.json": "The Meditations [https://en.wikipedia.org/wiki/Meditations] is a book of stoic\nwisdom purportedly to have been written by Marcus Aurelius that is popular in\nself help circles.\n\nWhile certainly a popular read, what proof do we have that this book was\nactually written and published by Marcus…",
  "data/reddit-ask/r/AskHistorians/comments/rmwkmr/was_there_actually_an_aristocratic_opposition_to.json": "It is hard to point to a specific example now, but there is something of a trope\nof an old aristocrat who has deeply conservative and anti-democratic views but\nopposes the fascists because his sense of propriety and social order is upset by\nthe grubby populism of the fascists and that buffoon,…",
  "data/reddit-ask/r/AskHistorians/comments/rn3aq7/medieval_historian_umberto_eco_believed_that_the.json": "Source\n[https://www.nytimes.com/1999/04/18/magazine/best-invention-how-the-bean-saved-civilization.html].\n\nFull quote:\n\n> \"When, in the 10th century, the cultivation of legumes began to spread, it had\n> a profound effect on Europe. Working people were able to eat more protein; as\n> a result, they…",
  "data/reddit-ask/r/AskHistorians/comments/rndl29/why_are_the_gifts_from_thetwelve_days_of.json": "I’ve just noticed the carol has pretty much birds and servants through the whole\ncarol. Why is this?\n\nThe lyrics are below\n\nOn the 12th day of Christmas My true love sent to me 12 drummers drumming Eleven\npipers piping Ten lords a-leaping Nine ladies dancing Eight maids a-milking\nSeven swans a…",
  "data/reddit-ask/r/AskHistorians/comments/rnhykn/why_is_phoenix_so_big.json": "It seems strange that in the middle of the Sonoran desert, there is a massive\nmetro area of over 4.5 million people. It's not near any major body of water.\nIt's also really really really fucking hot. So why is it so big?",
  "data/reddit-ask/r/AskHistorians/comments/rnovyu/hannah_arendts_banality_of_evil_what_is_the.json": "https://aeon.co/ideas/what-did-hannah-arendt-really-mean-by-the-banality-of-evil\n\nReading this article it seems that in recent decades more and more dissenting\nvoices of her view have come forward and that her initial analysis was flawed.\n\nIt also strikes me as peculiar how she mentions that…",
  "data/reddit-ask/r/AskHistorians/comments/rnpk0d/why_is_christmas_such_a_big_thing_in_japan_a.json": "Also, Christmas in Japan is more like a Valentine's Day-style couples' holiday.\nWhy is that?",
  "data/reddit-ask/r/AskHistorians/comments/rnwi3f/were_people_in_antiquity_aware_that_far_away.json": "When exactly did people understand that at the exact same moment it might be\nearly morning e.g. at Rome, but noon in central China? Had they understood that\nfrom planetary motions or could they have deduced it some other way?",
  "data/reddit-ask/r/AskHistorians/comments/rnwli4/was_it_common_to_discourage_being_lefthanded_in.json": "I recently mentioned something to my uncle about his being so ambidextrous and\nhe sort of shut down... My aunt said he as a kid growing up (Midwest US,\ncatholic school in the 60s) that he was HARSHLY reprimanded for using his left\nas his dominant hand. I'm so curious why it would matter to anyone,…",
  "data/reddit-ask/r/AskHistorians/comments/rnxz9l/so_farright_populists_like_eric_zemmour_in_france.json": "Is Eric Zemmour just appropriating a tradition for far-right propaganda. Was\nbonapartism always placed within the French far right tradition, cause I’ve also\nheard of bonapartism as being placed more towards the center of the French\npolitical spectrum in the 19th century?",
  "data/reddit-ask/r/AskHistorians/comments/ro231m/is_there_definitive_evidence_that_roman.json": "I assume there are no sources that outright \"expose\" it, but it wouldn't be\nsurprising if they were just protecting the kayfabe.\n\nI can see different reasons gladiator combat could make it into sources, but I\ndoubt anyone was writing with the intent of passing on the idea of how it's done\nto people…",
  "data/reddit-ask/r/AskHistorians/comments/ro8mjo/are_there_theories_of_evolution_which_predated.json": "It seems crazy that one man could come up with basically a solution to the\nriddle of human existence. I’m curious to know if there were evolutionary\ntheories before Darwinism?",
  "data/reddit-ask/r/AskHistorians/comments/roi91r/how_common_was_being_killed_by_friendly_fire_in.json": "Obviously I’ve only seen these battles on TV on The Last Kingdom and Vikings,\nbut with the number of people and the complete chaos I can’t understand how you\ncould tell one side from another. I know shields were painted differently and\nsome armies carried flags but if you aren’t holding something…",
  "data/reddit-ask/r/AskHistorians/comments/rok32v/i_heard_there_was_a_time_in_britishamerican.json": "I was reading some other stuff and found this:\n\nI can answer a bit about traditions in Sweden during the [medieval] era. [...]\nInterestingly, the sex ideas of the Victorian era (which has extended into\nmodern days) was reversed. Males were considered closer to God and thus would\neasier be able to…",
  "data/reddit-ask/r/AskHistorians/comments/rol6ic/i_was_told_once_that_ancient_egypt_censored_parts.json": "This was a passing comment in a review of game that went into a ramble about\nancient Egypt based on an account by Plutarch which alone raises red flags.\n\nhttps://www.youtube.com/watch?v=YA2UAeFMWFs&t=330s\n\nThis doesn't seem right that their own religious stories would be censored but I\ndon't know…",
  "data/reddit-ask/r/AskHistorians/comments/rorf1q/why_is_patagonia_so_underpopulated.json": "> Patagonia has wonderful summers and tolerable winters, amazing fresh water\n> resources, lots of green, plenty of land, and it is just...gorgeous. So why\n> does hardly anyone live there?\n> \n> Governance there is hardly perfect, but Chile and Argentina are hardly the\n> worst governed countries on…",
  "data/reddit-ask/r/AskHistorians/comments/rorpbf/why_is_the_latin_script_relatively_similar_across.json": "Across most Germanic and Latin based European languages, varied from Hungarian\nto English, the Latin script is used, with only very minor changes.\n\nHowever, in the Indian Subcontinent, almost all languages have their own unique\nscript. These scripts are significantly different from each other.…",
  "data/reddit-ask/r/AskHistorians/comments/rowtth/was_the_imperial_japanese_navy_as_hesitant_to.json": "In WWII, Imperial Japanese infantry surrendered at astonishingly low rates\ncompared to any other belligerent force. So was there an equal antipathy to\nletting sailors fall into Allied hands among the IJN?\n\nI can imagine that the average Japanese sailor would rather not suffer what he\nperceived to…",
  "data/reddit-ask/r/AskHistorians/comments/royrlw/missouri_has_a_1994_law_that_prohibits.json": "There was recently an update to the law to include any facility with 2000\ngallons of water inside it, further increasing my confusion.\n\nI understand that it's almost certainly a way to limit casino construction, but\nin 1994, surely it was recognized that they'd be able to flout it pretty easily.\nIs…",
  "data/reddit-ask/r/AskHistorians/comments/roz6ls/did_young_single_people_have_sex_as_frequently_as.json": "I suppose this a social history question, but watching old films you see heavily\nveiled references to this sort of thing but I just assumed everyone waited until\nmarriage although it doesn't seem that way. Does anyone know how often this\noccurred in truth up to the 1950s?",
  "data/reddit-ask/r/AskHistorians/comments/rp8vcu/at_the_turn_of_the_20th_century_my_great_great.json": "This sounds incredibly complicated to me, and stories like An American Tail\n(mice aside!) gloss over much of the minutia. Obviously, one could not simply\nask google maps to take you from Buczacz to Philadelphia! So how did he (and\nhundreds of thousands like him) do it in and what would this trip…",
  "data/reddit-ask/r/AskHistorians/comments/rphaci/when_we_hear_the_word_alien_we_think_of_this.json": "sorry if this question isn’t related to this sub.",
  "data/reddit-ask/r/AskHistorians/comments/rpiwbo/why_is_st_christopher_with_a_dogs_head_in_ancient.json": "Examples [http://studiolum.com/wang/icon/christopher/2/map.jpg]\n\nI cannot seem to find an academic answer for this but I have heard 3 claims\nfloating around online.\n\n 1. That it inspired by or was a hold-over from the Egyptian god Anubis or\n    Hermanubis (the combination of Hermes and Anubis).\n 2.…",
  "data/reddit-ask/r/AskHistorians/comments/rplrh4/how_did_spain_manage_to_go_from_being_the_richest.json": "This has always fascinated me, as Spain was an established global empire that\nhad the vast riches of the Aztecs, Mayans and the Inca empires, yet it somehow\nmanaged to be incapable of managing its finances to the point of being bankrupt.",
  "data/reddit-ask/r/AskHistorians/comments/rpru8f/did_the_first_satellite_pictures_of_earth_clear.json": "I know that mid-millennium explorers drew maps of wherever they explored, but a\nlot of those early \"new world\" maps look very different from maps we use today.\nFor example, I'm aware that some Spanish explorers falsely described California\nas an island.\n\nI'm curious if satellite images from space…",
  "data/reddit-ask/r/AskHistorians/comments/rpvh3e/was_there_a_sovieteastern_bloc_equivalent_to.json": "Did the communist world have its own tabletop RPGs?",
  "data/reddit-ask/r/AskHistorians/comments/rq0jom/i_just_read_that_the_term_toast_for_drinking_to.json": "All these articles just refer to spiced toast without explanation as if I’m not\ndying to know how to replicate this at home.",
  "data/reddit-ask/r/AskHistorians/comments/rq1bdn/how_come_the_mona_lisa_is_as_highly_regarded_as.json": "Leonardo DaVinci was a genius in his day, apart from his important\ntechnological/military innovations he painted plenty of historical significant\nworks. I cant wrap my head around why the portrait of a unknown woman is his\nmost famous work.\n\nSorry if this isn’t the right subreddit but I thought…",
  "data/reddit-ask/r/AskHistorians/comments/rq1iek/was_it_common_in_the_1800s_for_young_teenagers_to.json": "I recently found out that a distant great+ grandfather in the 1800s was 13 when\nhe had his children with his 33 year old wife. Was this a common occurrence (a\nunder aged male [or female] to have children with an older, adult wife [or\nhusband])? Or even at any point in history?",
  "data/reddit-ask/r/AskHistorians/comments/rq6w1h/in_many_classic_tv_sitcoms_upper_middle_class.json": "Examples of sitcoms include: Hazel, the Brady Bunch, Mr. Belvedere, the Fresh\nPrince, Jetsons.\n\nSince I can’t relate, so many questions cone to mind. Here are a few:\n\n * Did middle class families really have maids/butlers in the 60s, 70s, and 80s?\n   Are there any statistics on this?\n\n * Why did…",
  "data/reddit-ask/r/AskHistorians/comments/rqau26/why_isnt_the_genocide_of_native_americans_spoken.json": "As a subject, this wasn’t brought up at all in my experience at school, and in\ngeneral it isn’t talked about even comparably as often as the Holocaust is when\nit comes to historical atrocities. I find this hard to explain given\nconservative estimates of the death toll of Native American is said to…",
  "data/reddit-ask/r/AskHistorians/comments/rqpshc/how_many_american_citizens_fought_on_nazi.json": "In the show Band of Brothers when US soldiers are dropped over France, one of\nthe enemy soldiers is an American born young man with perfect American English.\nHe says he moved to Germany because the fatherland called his family and they\nwent.\n\nHow common was this? And what happened to the prisoners…",
  "data/reddit-ask/r/AskHistorians/comments/rqqv50/coffee_was_the_drink_of_choice_in_turkey_when_it.json": "https://en.wikipedia.org/wiki/Ottoman_coffeehouse\n\nTable 9 – Tea consumption in Turkey: 1998-2003, per the FAO\n[https://www.fao.org/3/j5604e/j5604e.htm]\n\n> Turkey has one of the world’s highest per capita consumption levels […] 2.97\n> kg in 1999……..\n\nHow did this change occur? Was there a reason…",
  "data/reddit-ask/r/AskHistorians/comments/rqr6pp/in_the_chinese_scifi_novel_the_three_body_problem.json": "I was especially curious as the novel and it's writer Liu Cixin are incredibly\npopular in China but the scenes describing things like Struggle Sessions, and\nthe radicalism of the Red Guards seem like scathing descriptions that one would\nassume would be censored by the CCP, yet Liu has even spoken…",
  "data/reddit-ask/r/AskHistorians/comments/rqtko5/in_braveheart_a_troop_of_irish_conscripts_are.json": "I am aware that Braveheart does not rank highly in historical terms and that\nthis event was entirely fictional, but it seems like something that could\nplausibly happen in some form.",
  "data/reddit-ask/r/AskHistorians/comments/rqujgu/how_did_people_wake_up_on_time_prior_to_electric.json": "Title says it all. So much of my life revolves around waking up at specific\ntimes (for work, school, etc.), so how did people, in say the 17th century\nmanage morning punctuality?",
  "data/reddit-ask/r/AskHistorians/comments/rqvv2i/given_the_chaos_of_the_february_revolution_in.json": "My husband (who is not a Redditor or a historian) is researching some background\non a larger-than-life figure from Bath Maine: Francois de Loche (died 1889).\nFascinating as his later history is, his early life reads something like a\nKipling novel. He appears to have been the subject of a “secret…",
  "data/reddit-ask/r/AskHistorians/comments/rr827f/did_the_ussr_fund_or_aid_insurrections_across_the.json": "I was wondering this while reading about Allende's presidency in Chile, and the\ninvolvement of the US government and its agencies in destabilising the Chilean\ngovernment, funding strikes and how, as Kissenger put it\n[https://nsarchive.gwu.edu/briefing-book/chile/2016-09-09/cia-cover-chile],\n\"they…",
  "data/reddit-ask/r/AskHistorians/comments/rrc02e/in_the_red_queen_it_is_mentioned_that_many.json": "The author brings many examples of ancient institutionalized systems of polygamy\nlike in the Inca:\n\n> In the ancient empire of the Incas, sex was a heavily regulated industry. The\n> sun-king Atahualpa kept fifteen hundred women in each of many “houses of\n> virgins” throughout his kingdom. They were…",
  "data/reddit-ask/r/AskHistorians/comments/rrcb2a/are_there_any_existing_examples_of_confucian.json": "I know their significance to the history of East Asia, but I’m curious what\nexactly they asked and how they were assessed.",
  "data/reddit-ask/r/AskHistorians/comments/rrfnrz/the_film_the_death_of_stalin_supposedly_actually.json": "I've heard that historians complaints around the film were that the film doesn't\nso much take dramitc license to make events seem more dramatic/ridiculous but\nthat the film actually presents an almost toned down version of real events.",
  "data/reddit-ask/r/AskHistorians/comments/rrn51f/do_aboriginal_australians_have_artifacts_or_folk.json": "From what I understand Neanderthals went extinct 40,000 years ago, and\naboriginal Australians were around 40,000 years ago - and their culture and\nrites and stories haven’t changed much.",
  "data/reddit-ask/r/AskHistorians/comments/rro6hn/is_there_any_evidence_physical_or_written_about.json": "This question also extends into the Middle Ages and early Renaissance periods.\nWere ,what modern medicine classifies as STIs and STDs, rife in those periods or\ndid social factors minimise their spread?",
  "data/reddit-ask/r/AskHistorians/comments/rrqbzm/what_caused_west_virginia_to_be_a_nearly_solid.json": "I know the south shifted Republican after the Civil Rights Act passed in 1964\nbut West Virginia is more of a mystery to me. It started out as a state that\nrebelled against the south and slavery, it's fairly far north and yet seems to\nhave fallen to a similar pattern.\n\nSo my question is what made it…",
  "data/reddit-ask/r/AskHistorians/comments/rrtj3z/in_1990_an_amendment_to_the_clean_air_act_was.json": "To make it even more strange, George HW Bush passed the Clean Air Amendment in\n1990 while his son, George W Bush, pulled out of Kyoto. Is this a sign of a\ngenerational differences between the Republican Party on environmentalism?",
  "data/reddit-ask/r/AskHistorians/comments/rrud9g/how_historically_accurate_was_william_du_boiss.json": "“The Souls of White Folk” is an excellent read and you can get to it by clicking\nthe link on this\npage:https://www.loa.org/news-and-views/1681-web-du-bois-the-souls-of-white-folk\n\n\n\nHere is the paragraph the quote comes from for context:\n\n\"Let me say this again and emphasize it and leave no room…",
  "data/reddit-ask/r/AskHistorians/comments/rrwpiq/have_male_sexual_slavery_existed_in_the_ancient.json": "In the movie Pompeii (2014), there is a scene in which upper class Roman women\nwere inspecting male sex slaves. Similar scenes have been depicted in the TV\nseries Spartacus.\n\nIn history, female sexual slavery is well known. Similarly, has male sexual\nslavery existed in the ancient world? Which…",
  "data/reddit-ask/r/AskHistorians/comments/rs9atk/what_would_ancient_mesopotamian_beards_look_like.json": "A lot of art and sculptures, along with text, say that in ancient Mesopotamia\npeople used oils and tongs to give their beards ringlets and texture. I don't\nthink I've ever seen this done on an actual person though, not in day-to-day nor\nmovies/historical reproductions. Was the art style just…",
  "data/reddit-ask/r/AskHistorians/comments/rs9hkm/how_do_historians_tell_the_difference_between.json": "I’m not trying to step on any toes here.\n\nIn our society, lots of people literally and earnestly believe that, for\nexample, Jesus of Nazareth was a divine being who performed various miracles and\nreturned from the dead. Everyone also knows the popular legend of King Arthur,\nwho drew the sword from…",
  "data/reddit-ask/r/AskWomen/comments/r5ycjw/whats_something_you_recently_did_or_went_through.json": "Nothing is too big or small. Let's celebrate each other!\n\nEdit: thank you for the awards!",
  "data/reddit-ask/r/AskWomen/comments/r6ofvp/what_did_you_learn_to_love_bc_of_your_partner.json": "Is there something that you didn’t like before meeting your partner but you\nstarted to like it because of them?",
  "data/reddit-ask/r/AskWomen/comments/r6pc1a/how_important_is_self_development_in_a_romantic.json": "Not necessarily just career but also hobbies, athletics, intellectual, etc.\n\nIs one of those more important than the others to you? Basically, pursuing\nsomething and growing within that something.",
  "data/reddit-ask/r/AskWomen/comments/r7a3wn/how_do_you_dress_while_at_home.json": "Do you care about being presentable when you’re at home, or prefer to be au\nnatural?\n\nEDIT: I also want to know about your makeup and hair at home!",
  "data/reddit-ask/r/AskWomen/comments/r7tyde/how_do_you_cope_with_being_a_late_bloomer_in.json": "If you never had an SO till maybe your mid-late 20s Did you feel behind in life?\nHow do you know whether you're the problem or not?",
  "data/reddit-ask/r/AskWomen/comments/r86fy9/is_the_walk_of_shame_real_why_it_is_only.json": "There is this ‘walk of shame’ in many American and British romantic comedies I\nwonder if this really usually happen and why it doesn’t apply to men",
  "data/reddit-ask/r/AskWomen/comments/r8o581/women_in_relationships_how_much_emphasis_do_you.json": "I see a lot of people doing it. Just curious if thats now a requirement in\ndating since its common\n\nI.e public posts such as You complete me, or I can't believe how much you've\nchanged my life etc",
  "data/reddit-ask/r/AskWomen/comments/r8oy2e/women_over_40_who_consider_to_have_a_healthy.json": "Maybe you see other people having health or energy issues but that is not the\ncase for you. What do you think that helped? Habits? The more details the\nbetter.",
  "data/reddit-ask/r/AskWomen/comments/r8ugdo/what_is_something_that_other_women_wear_that.json": "sometimes i'll notice shoes or jewelry and look it up right away",
  "data/reddit-ask/r/AskWomen/comments/r8ve6m/whats_something_that_wasnt_taught_to_you_during.json": "...",
  "data/reddit-ask/r/AskWomen/comments/r8vpli/what_was_the_most_horrific_compliment_a_man_has.json": "Looking for real gut grinders...",
  "data/reddit-ask/r/AskWomen/comments/r9311f/do_you_ever_feel_like_wanting_to_cook_be.json": "I was thinking about this the other day..came up with toxic femininity.. don't\nknow if its a thing or at all correct but yeah.. little thought? .",
  "data/reddit-ask/r/AskWomen/comments/r9illm/how_do_you_feel_about_being_called_a_menstruator.json": "Edit: I didn't think about the difference between mensturator and people who\nmenstruate when formulating the question, so I mean people who menstruate.",
  "data/reddit-ask/r/AskWomen/comments/r9krr8/what_are_some_butterflies_inducing_moments_youve.json": "I’m trying to live vicariously.",
  "data/reddit-ask/r/AskWomen/comments/r9n1jv/what_are_you_really_good_at_and_kinda_embarrassed.json": "I would love to see your answers :)",
  "data/reddit-ask/r/AskWomen/comments/ra86eo/how_did_you_body_change_with_weightloss.json": "Just interested!",
  "data/reddit-ask/r/AskWomen/comments/ra8eku/women_who_lost_your_mom_how_have_you_found_ways.json": "I lost my mom at 5 years old. Aside from identifying as a Disney princess and\nhaving female mentors, I’m still at a loss.",
  "data/reddit-ask/r/AskWomen/comments/rawzww/what_is_something_a_potential_partner_or_a_friend.json": "How did you realize you set the bar too low from the people in your life?",
  "data/reddit-ask/r/AskWomen/comments/rax42g/what_do_you_do_when_youre_up_late_and_dont_have_a.json": "Just wondering what others do when they really need another woman's perspective\nand friend to talk to late, and no one is around.",
  "data/reddit-ask/r/AskWomen/comments/raxb4t/what_are_things_that_make_you_feel_like_maybe.json": "You ask yourself « why am I like that? »",
  "data/reddit-ask/r/AskWomen/comments/rbqc36/women_who_have_been_the_socalled_dead_fish_in_bed.json": "I want to be clear that I mean this question as respectfully as possible.\nThere's no judgment whatsoever.",
  "data/reddit-ask/r/AskWomen/comments/rbt80v/mothers_what_is_the_most_embarrassing_thing_your.json": "What has your kid ever done in public that left you mortified? Tell the story\nand make us laugh.",
  "data/reddit-ask/r/AskWomen/comments/rbuvxu/women_who_read_frequently_what_was_a_book_that.json": "I just finished a book many people said made them cry, but I didn't react the\nsame way. I just want to hear from other women who were told \"this book will\nmake you x\" and you experienced something entirely different.",
  "data/reddit-ask/r/AskWomen/comments/rc6kcu/what_are_some_things_you_could_tell_someone_to.json": "Thanks!",
  "data/reddit-ask/r/AskWomen/comments/rch7d4/teachers_of_askwomen_what_have_been_some_of_your.json": "funny, rewarding, heartwarming... anything!",
  "data/reddit-ask/r/AskWomen/comments/rcnfc1/do_you_fake_shop_and_why.json": "Do any of you 'fake' shop or window shop online? Like view houses in your area,\nmake whole wishlists of how you'd redecorate a room/house, or put together a\nwhole new wardrobe, but never buy any if it? Do you go as far as researching\nwhat's best? If you do any if these, why do you do it, and how do…",
  "data/reddit-ask/r/AskWomen/comments/rd61jt/what_is_the_most_entitled_birthday_behavior_youve.json": "Asking because it’s my birthday today.",
  "data/reddit-ask/r/AskWomen/comments/rdh0ko/whats_something_you_have_bought_for_yourself_that.json": "It could be something important or just something silly you bought to treat\nyourself. Anything, really.",
  "data/reddit-ask/r/AskWomen/comments/rdw9u1/whats_the_most_romantic_thing_your_partner_has.json": "I’m a sucker for lovey dovey things and am in the lonely hearts club, so would\nlove to torture myself reading your cute experiences :)",
  "data/reddit-ask/r/AskWomen/comments/rf19jz/what_quirkunusual_thing_happens_to_you_after_an.json": "For me, I always laugh uncontrollably and my ears ring.",
  "data/reddit-ask/r/AskWomen/comments/rgrodb/what_is_that_one_thing_every_parent_should_teach.json": "Thank you for answering :)",
  "data/reddit-ask/r/AskWomen/comments/rigaqj/which_next_technological_breakthrough_do_you.json": "Example, discovery of reliable contraceptives has changed the lives of women for\ngood. What do you think will be the next big thing?",
  "data/reddit-ask/r/AskWomen/comments/rip63e/ladies_what_book_do_you_remember_fondly_reading.json": "and what was wonderful about it?",
  "data/reddit-ask/r/AskWomen/comments/rj7fbb/ladies_who_met_their_partner_in_their_mid_30s.json": "Ladies who met their partner in their mid 30s what's your story?",
  "data/reddit-ask/r/AskWomen/comments/rkf7h8/women_of_reddit_what_do_you_do_when_you_live.json": "I personally make a lot of noice when I come in to my apartment at night after a\nnight out just in case.",
  "data/reddit-ask/r/AskWomen/comments/rklck8/which_old_tv_shows_or_movies_have_aged_well.json": "Even some 2000s ones are filled with sexist, homophobic and racist tropes. Any\nfavorite ones that have aged well to this day?",
  "data/reddit-ask/r/AskWomen/comments/rkp2sq/what_is_something_that_makes_you_happy_without.json": "(See above)",
  "data/reddit-ask/r/AskWomen/comments/rmewdo/if_you_could_bottle_moments_to_relive_as_much_as.json": "Time in a Bottle by Jim Croce is one of my favourite songs and I'm just\nwondering what people would be willing to experience over and over again if they\nhad the option to.",
  "data/reddit-ask/r/AskWomen/comments/rmjnbb/what_changed_for_you_when_you_went_from.json": "I am losing weight currently and am so shocked at how I am treated differently\nalready. Insane.",
  "data/reddit-ask/r/AskWomen/comments/rn11v1/women_who_have_had_hysterectomy_what_was_the_most.json": "Had a hysterectomy 2 months ago at 32. They took everything but my ovaries.\nWeird random pelvic pain has been my most unexpected symptom.",
  "data/reddit-ask/r/AskWomen/comments/rn2h51/women_who_do_any_form_of_exercise_what_are_some.json": "Feel free to share goals that are qualitative, quantitative, or both",
  "data/reddit-ask/r/AskWomen/comments/rnp48d/how_do_you_feel_when_reading_all_the_mind_games.json": "I see a lot of \"play hard to get\", \"treat her this way\", \"don't be a nice guy\".\nEssentially, be fake and afraid to be your self. I'm interested to hear your\nperspective.\n\nThank you! :)",
  "data/reddit-ask/r/AskWomen/comments/ro38wm/when_did_it_sink_that_you_are_really_and_truly_an.json": "Some days it feels like I’ve always just been my age, and then others it’s as if\nI’m so old compared to the newer generations.",
  "data/reddit-ask/r/AskWomen/comments/romd7z/what_are_your_thoughts_on_non_traditional_wedding.json": "I'm talking brides wearing pant suits, a two-piece set, midi dresses, or even a\nsecond dress that is more comfortable.\n\nEDIT: To clarify, I mean if YOU were the bride! Not if you were a guest at\nsomeone else's wedding. If you were just a guest, your opinion on the bride's\ndress doesn't matter!…",
  "data/reddit-ask/r/AskWomen/comments/rq28m2/whats_the_most_surprisingly_useful_free_app_that.json": "i.e not obvious like Facebook or Google Maps.",
  "data/reddit-ask/r/AskWomen/comments/rq7iry/what_were_the_most_toxic_ideas_you_had_about_love.json": "...",
  "data/reddit-ask/r/AskWomen/comments/rqsffm/what_surprised_you_about_being_in_a_long_term.json": "Anything from financial to sharing a bed to all that’s in-between.",
  "data/reddit-ask/r/AskWomen/comments/rrkodj/whats_something_you_can_do_that_the_majority_of.json": "Personally, I can sleep with bras on. They're so comfortable to me, I don't even\nfeel them. Any and all kinds of bras.",
  "data/reddit-ask/r/AskWomen/comments/rs3wv6/women_with_high_standards_how_do_you_prioritize.json": "Asking for someone who is in the process of developing those standards.",
  "data/reddit-ask/r/AskWomen/comments/rs42qm/time_for_the_real_questions_what_suffering_have.json": "Hours without using the bathroom? Claw tracks on your leg? Arm torn off because\nyour dog saw a squirrel? Time for the tea! :3\n\nEdit for clarity: this is meant as a light-hearted question, asked for fun,\nabout the “evil” things pets do, and the fact that we love them anyway.",
  "data/reddit-ask/r/AskWomen/comments/rs66qx/how_do_you_feel_when_you_catch_a_glimpse_of.json": "Do you cover yourself as soon as you get out of the shower just to avoid seeing\nyourself naked?",
  "data/reddit-ask/r/AskWomen/comments/rsftwi/ladies_whats_the_best_book_youve_read_this_year.json": "What’s the best book you’ve read this year? Tell me about it - without spoiling\nanything of course.\n\nOh, and if you wanna recommend any books on self improvement, feel free 🤗",
  "data/reddit-ask/r/AskWomen/comments/rsgn0k/how_yall_feel_about_naps_for_real.json": "I need one.",
  "data/reddit-ask/r/NoStupidQuestions/comments/r62o2i/i_work_a_minimum_wage_job_as_a_sales_assistant_my.json": "My boss is cheap. I know he’s asking me because he’s aware of how much it\nusually costs to have batches of images edited",
  "data/reddit-ask/r/NoStupidQuestions/comments/r62wup/why_am_i_repulsed_by_the_idea_of_me_being_pregnant.json": "I’m a 17 year old girl and I’ve always been disgusted by the idea of pregnancy.\nWhen I was little and used to play house, I never wanted to pretend to be\npregnant because I thought it was repulsive. Even seeing pictures of my mom\npregnant brought me deep shame and sadness for both me and her. I…",
  "data/reddit-ask/r/NoStupidQuestions/comments/r6hfbb/will_most_men_cheat.json": "I was arguing with a Redditor about men & women. He says all men will cheat, why\nwouldn't they when there are hotter women out there? I classified him as a\nneckbeard lol.\n\nWhat do you think? Do you think men have a higher tendency to cheat in\nrelationships? Is it possible for a man to truly be…",
  "data/reddit-ask/r/NoStupidQuestions/comments/r6pnm9/why_am_i_expected_to_tip_more_if_my_meal_is_more.json": "I dislike the practice, but I always tip at least a few bucks, right? So I'm at\nthis diner with some friends/acquaintances, we get a few steaks and beers. I go\nto pay and slap a fiver on the table for the tip. This gets me a few side eyes,\nand I get to thinking \"shit, is that not enough?\"\n\nThis…",
  "data/reddit-ask/r/NoStupidQuestions/comments/r70qxe/why_do_a_lot_of_websites_with_articles_have_half.json": "No sign-in, no paywall, no page load, nothing... just an extra, completely\nunnecessary click to instantly show the rest of the text. Why even bother?\nWhat's the purpose?",
  "data/reddit-ask/r/NoStupidQuestions/comments/r75f8i/why_are_cows_so_aggressive_how_do_i_avoid_this.json": "So where I live is super rural and we have cows grazing free on open, accessible\nland. Monday was the third time I've been charged at or had serious aggression\nshown to me by these animals (flustered head shaking and running towards me and\nmy SO).\n\nI have no idea why this happens. They didn't have…",
  "data/reddit-ask/r/NoStupidQuestions/comments/r7chfa/is_it_me_or_does_it_seem_the_nft_metaverse_crypto.json": "Every where I look I see posts about NFT and crypto. But it seems like this is a\nmarketing campaign that came out of no where. Is it just me?\n\nEdit: everyone is comparing it to the internet bubble, how bill gates sounded\ncrazy talking about streaming radio from your computer lol",
  "data/reddit-ask/r/NoStupidQuestions/comments/r7j9qw/has_anyone_actually_seen_an_award_trenion_before.json": "I have never actually seen one rewarded, could someone link me somewhere where a\ntrenion all-powerful has been gifted?",
  "data/reddit-ask/r/NoStupidQuestions/comments/r7lq0w/does_anyone_else_washes_their_hands_and_change.json": "I’ve always done this since I was little(despite no one else in my household\ndoing it), I would always come and wash my hands, change clothes before getting\nin bed. I have never come home and lay down on my bed with the clothes I wore at\nschool or going out. I just think it’s gross that people…",
  "data/reddit-ask/r/NoStupidQuestions/comments/r7sj7n/why_do_people_fetishize_virgins_arent_they_the.json": "Wouldn’t it be like wanting to play a game of poker with someone who’s never\nplayed before. Sexually transmitted disease isn’t as big an issue as it used to\nbe so it can’t be that. Is it people who are bad in bed and hide their\ninsecurities by being with less experienced people who can’t tell? I…",
  "data/reddit-ask/r/NoStupidQuestions/comments/r7tbfg/why_is_it_that_anyone_can_birthfather_a_child.json": "Anyone (including irresponsible, financially unstable abusive people) can\nbirth/father a child with virtually no questions asked.\n\nIf we really are concerned with child welfare shouldn't we put people who want\nto birth/father a child through the same tough screening process, or lower the\nbars for…",
  "data/reddit-ask/r/NoStupidQuestions/comments/r7vtnl/why_are_some_impressions_of_accents_considered.json": "Why is it considered racist or bigoted when someone does a Mexican or Chinese\naccent (or anything that sounds super foreign to our colonizer ears) but it\nisn't considered racist when people do British, French, Italian, etc. accents? I\nsaw a person get called out pretty heavily on tiktok a couple…",
  "data/reddit-ask/r/NoStupidQuestions/comments/r7z4g1/why_is_paparazzi_legal_but_stalking_is_not.json": "Why is paparazi a legal paid job, but being a stalker is apprehendable/illegeal?\nFeels like the only diffrnce is one is getting paid and the other is not?\nConsidering the extrmes paparzzi go to (sitting in trees outside homes,\nfollowing them home etc) and getting paid big bucks for it.",
  "data/reddit-ask/r/NoStupidQuestions/comments/r82erh/what_would_be_a_productive_way_to_spend_two.json": "So basically I have to get two surgeries that are going to keep me in bed pretty\nmuch all of the time for about 2 months. During this time I would like to be\nable to be productive instead of wasting that time just watching TV, reading,\netc. I should also note that I should (hopefully) be lucid and…",
  "data/reddit-ask/r/NoStupidQuestions/comments/r83m4v/my_roommate_lit_a_white_candle_in_a_jar_of_salt.json": "It's exactly as it sounds and I'm sorry I do not have a picture as she has since\ncleaned up.\n\nI woke up to a lit white candle in every window sill in the house and one in\nfront of each of our rooms.\n\nThe candle was slender, white, and in a glass bottle of white salt.\n\nFrom what anime and horror…",
  "data/reddit-ask/r/NoStupidQuestions/comments/r87zq3/what_would_defunding_the_police_do_for_us.json": "This is a potentially charged question, so I'm sorry in advance if this breaks a\nrule or two that I haven't seen.\n\nI don't necessarily see the merit in defunding the police forces, but I realize\nI have some bias and I don't know a ton about the movement and its goals. I also\nhaven't been given a…",
  "data/reddit-ask/r/NoStupidQuestions/comments/r8djk2/she_did_it_againam_i_weird_for_thinking_my_wifes.json": "Edit: We have 5 kids.",
  "data/reddit-ask/r/NoStupidQuestions/comments/r8f83b/what_does_it_mean_when_americans_say_something_is.json": "Why does Mississippi divide America in east and west if it’s not centrally\nlocated?",
  "data/reddit-ask/r/NoStupidQuestions/comments/r8iuak/does_it_get_better.json": "I’m a 22 year old female who lives with her dog in a apartment. I work from home\nand probably leave the house 3 times a week. I’m single and have been for 2\nyears. I do the same thing over and over again. I would hangout with my friends\nbut I have 2 and they’re both married and one has a kid. I…",
  "data/reddit-ask/r/NoStupidQuestions/comments/r8nsac/question_to_americans_is_it_true_that_you_put.json": "In movies you often see someone get fired and put their stuff in boxes and leave\nthe building, is that the case? Also, people are terminated and are immediately\nno longer employed by the company, are there no notice periods?",
  "data/reddit-ask/r/NoStupidQuestions/comments/r8qrya/what_exactly_is_critical_race_theory.json": "I am not from the states so please keep that in mind.",
  "data/reddit-ask/r/NoStupidQuestions/comments/r8ug3y/what_is_your_most_hated_word.json": "I hate when girls call their husbands “hubby”",
  "data/reddit-ask/r/NoStupidQuestions/comments/r91tfv/is_it_normal_to_have_zero_friends_as_an_adult.json": "I'm in my late 20s and have no friends, and I have no idea if this is how it is\nfor everyone or not. I haven't had any friends in years, and I spend all of my\ntime at home sleeping when I'm not at work. I realized recently that everyone\nwho pretends to be interested in what someone else is talking…",
  "data/reddit-ask/r/NoStupidQuestions/comments/r97rjg/why_do_adults_stop_having_sleepoversslumber.json": "Not enjoy sexual encounters but just the boys hanging out playing COD and\nminecraft with pizza, entering random conversations about communism that last\nuntil 4 AM. Used to do this in high school where there were still 10+ hours of\n‘work’ equivalent during school. Why don’t adults do this as often…",
  "data/reddit-ask/r/NoStupidQuestions/comments/r98ebv/whatever_happened_to_wholesome_celebrities_like.json": "It seems like there's no such thing as \"wholesome\" celebrities who speak for\nkindness and love. Every celeb I see these days are always \"cancelled\" for being\nracist, homophobic, transphobic, sexist, etc all those gross and heartbreaking\nthings that shouldn't exist in the world. The only \"wholesome\"…",
  "data/reddit-ask/r/NoStupidQuestions/comments/r9ftq9/why_is_writing_in_english_so_hard_for_native.json": "Obligatory on mobile so forgive me.\n\nEnglish is not my first language, but I happen to notice that a lot of native\nspeakers make spelling mistakes and I just can't wrap my head around it. While\nlearning the language I've learnt how to write it and even the way I phrase\nthings is not the most…",
  "data/reddit-ask/r/NoStupidQuestions/comments/r9gjqw/is_usa_as_bad_as_it_sound_on_reddit.json": "For example: ridiculously expensive healthcare, school shooting everyday, very\nracist polices",
  "data/reddit-ask/r/NoStupidQuestions/comments/r9lou6/how_do_i_get_rid_of_a_crow_that_flew_into_my.json": "PLEASE HELP\n\nLiterally this big ass black ass bird just flew into my apartment through the\nopen window, nothing like this has ever happened to me… It went back to the\nwindow to leave… but flew back in again. I’m a bit of a pussy ngl so I dipped\nout of my living room SCREAMING and am now watching…",
  "data/reddit-ask/r/NoStupidQuestions/comments/r9r7ow/why_arent_abandoned_houses_that_havent_been.json": "I always see these mansions or even small houses that haven’t been touched but\nthey are for sale for a lot of money still. Why?",
  "data/reddit-ask/r/NoStupidQuestions/comments/r9waco/are_the_newer_generations_actually_more_sensitive.json": "I’m 29 so I’m a millennial but I’ve noticed the past few years my generation and\nthe newer ones seem to be criticized as “too sensitive.”\n\nIn my opinion, I think the statement is a bit hyperbolic and I think there are a\nlot of times when it’s not about being too sensitive, it’s just times…",
  "data/reddit-ask/r/NoStupidQuestions/comments/ra3luh/is_it_wrong_to_assumed_people_with_dye_colorful.json": "I accept people's individuality and sometimes have learned to categorized based\non my experience personally. One example, dye colorful hairs, I always assumed\nwhen people dye their hair in colorful manners it automatically resonates to me\nthat they're LGBTQ+ types and act accordingly in a matter…",
  "data/reddit-ask/r/NoStupidQuestions/comments/ra55vn/so_why_does_jesus_randomly_say_father_why_have.json": "This always struck me as odd.",
  "data/reddit-ask/r/NoStupidQuestions/comments/ragpoq/is_it_weird_for_a_straight_man_to_want_an.json": "I've been having sex with women, and I just don't feel like doing it anymore.\nI'm lonely and all I want is a genuine connection. I'm still horny, but I just\ndon't want to have sex with anyone. At least, not just random girls. I had a\ndate set up for tonight and I cancelled it.",
  "data/reddit-ask/r/NoStupidQuestions/comments/rahwq2/do_men_in_relationships_still_masturbate.json": "Edit: I’ve never been in a relationship so there’s obviously no one to help me\nwith my “urges”, but for some reason I thought that a lot of men could just do\nthe dirty with their SO and that they felt it was a lot better than doing it\nthemselves.",
  "data/reddit-ask/r/NoStupidQuestions/comments/rak96d/do_men_like_how_a_womans_face_looks_without_any.json": "I want honest answers please. Makeup is something that always made me feel\ninsecure about my face without it. I’d prefer never wearing it again.",
  "data/reddit-ask/r/NoStupidQuestions/comments/raychs/could_i_drop_dead_at_any_age.json": "Can we just die all of a sudden? Has it happened to people that they just\nrandomly died?",
  "data/reddit-ask/r/NoStupidQuestions/comments/rbdeqo/someone_claimed_americans_dont_walk_anywhere_if.json": "Is this true and if so, how do dogs get exercised?\n\nEdit: Appears to vary by region.",
  "data/reddit-ask/r/NoStupidQuestions/comments/rbgvil/is_this_mansplaining.json": "Stuck at an airport so lots of random people drinking at one of their bars.\n\nA woman comes up to the bar and orders a tall glass of Cabernet.\n\nBartender asks for $20.\n\nAnother dude and myself comment on how expensive that is.\n\nSaid woman is obviously offended, thanks us for mansplaining, and…",
  "data/reddit-ask/r/NoStupidQuestions/comments/rbke22/lets_say_a_boy_grows_up_knowing_nothing_about_sex.json": "Will he just know he has to put his penis in her vagina?",
  "data/reddit-ask/r/NoStupidQuestions/comments/rbpfwz/can_a_court_appointed_lawyer_refuse_to_defend.json": "For example; imagine a serial murderer, rapist, child rapist, arsonist etc...\nwas arrested and taken to court. The person is WELL known and has been making\nheadlines for months.\n\nCan a court appointed lawyer refuse to represent them if they simply can't stand\nto be anywhere near that person? They…",
  "data/reddit-ask/r/NoStupidQuestions/comments/rbsejj/what_comes_into_your_mind_when_you_hear_or_see_a.json": "Just a little experiment.",
  "data/reddit-ask/r/NoStupidQuestions/comments/rc1b8v/am_i_stupid_for_asking_this_question.json": "Today in math class I asked the teacher why a circle is divided into 360\ndegrees, and why they didn’t make it 100 or 500 or any other number of degrees.\nHe explained that the 3 angles of a triangle always add up to 180 and 180 is\nhalf of 360. I said “yes but why 360 degrees?” And the teacher said…",
  "data/reddit-ask/r/NoStupidQuestions/comments/rc55ly/anyone_else_just_randomly_get_really_depressed.json": "Like I’ll literally be completely fine all day and then boom crushing\ndepression. Like empty inside shit. I don’t really get it because objectively my\nlife is pretty good? I just spend like 12 hours a week spiraling and it SUCKS.\nNot really looking for advice just commiseration.",
  "data/reddit-ask/r/NoStupidQuestions/comments/rcbdfo/is_it_a_red_flag_if_a_guy_you_just_started_dating.json": "I'm trying to convince my friend that right off the bat, this is alarming\nrequests from a man she just started dating a few months ago. It's giving\ninsecure and controlling.\n\nWhat y'all think?",
  "data/reddit-ask/r/NoStupidQuestions/comments/rchdku/how_do_i_convince_my_little_brother_that_his_new.json": "Title says it all. My little brother (16) got a samsung phone for his birthday\nby my dad. He had already asked him earlier what phone he wanted for his\nbirthday to which he said \"any of them will do\" and that \"he doesn't care\". So\nmy dad bought him one of the latest Samsung and he seemed pretty…",
  "data/reddit-ask/r/NoStupidQuestions/comments/rckzpu/smoker_for_10_years_im_thinking_of_quitting.json": "Edit: Maybe \"excuse\" is a bad word choice, \"reason\" might be a better word\n\nEdit 2: Thank you for all of your encouraging words!",
  "data/reddit-ask/r/NoStupidQuestions/comments/rcn9nr/where_do_i_go_to_have_someone_photoshop_the.json": "I wanna send it to my mom but it’s pretty obviously there, is there a photoshop\nsub Reddit?\n\nEdit: I ended up blurring the background slightly and it’s hidden, thank you",
  "data/reddit-ask/r/NoStupidQuestions/comments/rcnd71/in_prison_whats_stopping_me_from_just_doing.json": "Like let's say on the first day of prison I just lay in bed all day, what\nexactly would stop me from doing that? Sure the guards would probably try to\nforce you to leave, but the worse they could do is pick me up and throw me out\nof my cell right? So what if I just immediately go limp and stay that…",
  "data/reddit-ask/r/NoStupidQuestions/comments/rcr1yy/do_abusers_walk_into_a_relationships_thinking_yep.json": "I'm confused about how much awareness is involved, or do they just act\n\"naturally\" and it happens to turn out this way?",
  "data/reddit-ask/r/NoStupidQuestions/comments/rd59sf/does_anyone_else_find_pole_dancing_more.json": "Like that core strength",
  "data/reddit-ask/r/NoStupidQuestions/comments/rd5zub/was_this_restaurant_reasonable_for_telling_me_i.json": "I'm finally graduating I think,\n\nTo celebrate I went to the restaurant that shares a building with my apartment\ncomplex, kind of semi-fancy Mediterranean place but it doesn't seem to have a\ndress code\n\nI don't know if it was about dares code, their website says \"casual upscale\"\n\nI walk in and ask…",
  "data/reddit-ask/r/NoStupidQuestions/comments/rd70i7/whats_the_deal_with_ridiculous_action_scenes_in.json": "Are they meant to be stupid? Do the audience's think they're cool? I really\ndon't get it.",
  "data/reddit-ask/r/NoStupidQuestions/comments/rdc7m2/can_i_get_rabies_from_another_person.json": "This is probably one of the stupidest questions I'll ever have to ask. My\nhusband got attacked by a raccoon and refuses to get rabies shots.\n\nCan I get rabies from him if he were to be infected?\n\nEdit: Thanks everyone. Husband doesn't believe rabies is REAL, I obviously do,\nand am deciding how to…",
  "data/reddit-ask/r/NoStupidQuestions/comments/rdddxc/do_you_think_planet_fitness_would_care_if_i_got_a.json": "Over the past year my arthritis has got so bad that i can't stand or walk\nanymore making it impossible to get in the shower with how my bathrooms are\nbuilt. The washcloth method just isn't the same a hot shower. Planet Fitness\nright next to me has a handicap shower stall i might be able to use. Do…",
  "data/reddit-ask/r/NoStupidQuestions/comments/rdjs5g/do_you_ever_get_irritated_when_someone_tells_you.json": "Either you’re already doing it or you’re about to do it. And then someone tells\nyou to do it and now that they’ve told you, you don’t even want to do it anymore",
  "data/reddit-ask/r/NoStupidQuestions/comments/rdnfvb/what_is_the_appeal_of_going_to_a_strip_club.json": "I get that there’s hot topless women there, but you go and get hard with the\nboys and then go home? I don’t understand the appeal of getting yourself all hot\nand bothered and then not having sex. So you just pay someone to give you blue\nballs before you drive home with your mates? I know the…",
  "data/reddit-ask/r/NoStupidQuestions/comments/rdznn6/is_there_a_way_to_filter_out_posts_from_people_18.json": "Like adult swim?",
  "data/reddit-ask/r/NoStupidQuestions/comments/re1t1p/if_qtips_arent_supposed_to_go_into_your_ear_how.json": "My ear is extremely clogged, I’ve tried water, but that clogged my ear even\nmore. Well?",
  "data/reddit-ask/r/NoStupidQuestions/comments/rednzh/how_do_i_break_up_with_my_girlfriend_of_4_years.json": "I’m a 25 y/o male and have been dating my SO for 4 years. I’m so torn about this\nbecause she has been so good to me and doesn’t deserve the heartbreak. For\nvarious reasons I know she is not the one I want to spend the rest of my life\nwith but I really don’t want to hurt her. She is 23 but we are at…",
  "data/reddit-ask/r/NoStupidQuestions/comments/reoagu/how_does_one_go_about_finding_lonely_elderly.json": "I remember when I was 8 years old, every week I'd go to my neighbors house, she\nwas an elderly lady who never had any visitors, all the years I lived by her, I\nnever saw a single car at her house. I remember how happy she'd be when I\nstopped by, she'd give me some candy, or make me some toast,…",
  "data/reddit-ask/r/NoStupidQuestions/comments/rep8ej/should_i_be_investing_in_some_sort_of.json": "Edit: thanks everyone. A pretty clear answer. I was really just curious more\nthan anything as seeing adverts triggered the thought. I’ll keep my money in ye\nolde currency for now",
  "data/reddit-ask/r/NoStupidQuestions/comments/res0x4/can_chocolate_milk_turn_into_chocolate_cheese.json": "Same for strawberry cheese.",
  "data/reddit-ask/r/NoStupidQuestions/comments/retzco/is_it_weird_to_become_aroused_by_yourself.json": "I sometimes get a little bit aroused from myself. Like when I’m about to get\ninto the shower, I look at the mirror and become slightly aroused. I’m not like\nfully turned on or anything, though. But I can bust out a load just looking at a\nmirror. It usually comes in waves, though. I get pretty…",
  "data/reddit-ask/r/NoStupidQuestions/comments/reus23/when_did_drinking_tap_water_become_so_stigmatized.json": "My household, like most I imagine now days, uses filtered water for drinking.\nIt's second nature now, we don't even think to drink water from the tap. (USA\nhere for reference)\n\nHowever, when I was growing up, I don't remember people making such a big fuss\nabout drinking straight from the tap. Did I…",
  "data/reddit-ask/r/NoStupidQuestions/comments/rewd0t/i_just_found_out_you_can_only_get_pregnant_6_days.json": "I’m a girl in my early twenties and have just found out about this. So how do\naccidental pregnancies happen so often if you can only get pregnant 6 days a\nmonth? Are most people not using any protection at all? Are most people having\nsex multiple times a day the entire month? Can someone explain?",
  "data/reddit-ask/r/NoStupidQuestions/comments/rf231k/what_are_you_supposed_to_do_during_the_30_minutes.json": "lord, that makes me sound like the stereotype of a teenager but like…actually?\ni’m trying to come out of a depression slump and get some of my life together so\ni was like hmm i should have a nighttime routine. so it’s all good but this is\nmy main dilemma. i guess i could read?? uhh…jumping jacks?…",
  "data/reddit-ask/r/NoStupidQuestions/comments/rf9pza/why_isnt_dissing_white_people_in_movies_racist.json": "I am asian hence I don't identify with either black or white community.\n\nSometime ago I was watching a Hollywood movie and the lead Black character\nappeared very racist to me.\n\nHe was constantly dissing the white guy for his race like\n\n> It's a black thing your white ass won't understand.\n> \n> Get…",
  "data/reddit-ask/r/NoStupidQuestions/comments/rfaiq3/do_people_outside_the_us_also_say_mississippi_to.json": "One Mississippi, two Mississippi, three Mississippi….",
  "data/reddit-ask/r/NoStupidQuestions/comments/rfozxy/if_a_random_person_has_the_resources_available.json": "I know this scenario is unlikely, but let's assume the person tells no one and\njust does it. They make it to the moon and start to build their home, with food,\nwater and oxygen tanks coming regularly. They've successfully moved to the moon\non their own accord, claiming no nation but that of…",
  "data/reddit-ask/r/NoStupidQuestions/comments/rfpt2w/can_you_taze_yourself_to_be_tazer_resistant.json": "I know over a long period of time you can develop poison resistance from\npoisoning yourself constantly. How does this apply to tazers?",
  "data/reddit-ask/r/NoStupidQuestions/comments/rftmmd/why_are_people_especially_in_the_us_not_willing.json": "Hi!\n\nMight be completely wrong bc all I know about police interactions in the U.S. is\nfrom Reddit but I often see videos where the cop is like please show me your ID\nand the other guy is like AM I UNDER ARREST???? and just asking the officer\nhundred times why he wants to see it, what gives him the…",
  "data/reddit-ask/r/NoStupidQuestions/comments/rfutqi/why_dont_people_put_urinals_in_their_house.json": "As a guy, I’ve always thought that if I build my own house I’ll put a urinal in\nit. It’s so much more convenient to pee in. I feel like girls would also\nappreciate it because the toilet would be less messy. It can’t be that much more\nexpensive and it actually saves water! I’m going to start a new…",
  "data/reddit-ask/r/NoStupidQuestions/comments/rfwrqw/my_female_friend_is_leaving_incarceration_after.json": "Like that's all there is to say. I need to know how to find a guy to bang her.\nIt won't be me because I have a GF.\n\nHer friends/family is 800Km away and she has no access to the internet, is not\nallowed personal electronics.\n\nCan't believe she asked me this today when I visited because nothing like…",
  "data/reddit-ask/r/NoStupidQuestions/comments/rfxwm2/how_do_i_attract_a_ton_of_crows_ravens_to_my_yard.json": "Me and my wife are gonna be first time home owners and we have... an odd sense\nof humor. We really really want to be that ominous house covered in birds.\n\nDoes anyone know any tricks for befriending wildlife? To be clear I'm looking\nfor ways that won't put them in danger physically or anything that…",
  "data/reddit-ask/r/NoStupidQuestions/comments/rg65p4/why_do_we_train_our_kids_to_expect_winter_break.json": "Seriously.... For the first 18 to 23 years of our lives, we get summer holidays,\nwinter break and spring break and it becomes part of normal life, but we can't\nget enough vacation to even come close to approximating it when we're adults?\n\nEdit:. The suggestions to \"work harder so you can afford it\"…",
  "data/reddit-ask/r/NoStupidQuestions/comments/rg7s21/is_walking_to_school_with_my_kids_everyday_really.json": "I live in a town that has walk ways. But barely anyone uses them! People just\ndrive everywhere, even to the store that's literally a block or two away from\nthem. Me and my husband have two cars. But one of them is overdo for an\ninspection plus has something going on in a back wheel. We think it's…",
  "data/reddit-ask/r/NoStupidQuestions/comments/rgkfdi/can_i_go_to_a_restaurant_alone.json": "I have been really lonely and depressed lately and I want to take myself on a\n“date” to see if that can boost my spirits + just get some nice food. I just\ndon’t know if the servers will think I’m weird, or if they would straight up\njust not serve me because I would be wasting a table or something?…",
  "data/reddit-ask/r/NoStupidQuestions/comments/rgkwqx/does_reddit_function_differently_for_liberals_vs.json": "I’m a left leaning Canadian. I’ve noticed that in “neutral” subreddits like\nr/politics [/r/politics] and r/news [/r/news], I ONLY see posts condemning\nconservative actions and praising liberal actions. I have quite literally never\nseen a post in r/politics [/r/politics] that paints conservatives as…",
  "data/reddit-ask/r/NoStupidQuestions/comments/rgn2vf/im_19_and_feel_like_im_missing_out.json": "I've lived in a religious family my entire life. I've never done drugs. Never\nsmoked. I've never worn a crop top or bikini. I can't show my stomach at all.\nI'll get kicked out of the house if I don't go to church with my parents. I've\nnever dated a guy in real life, only online. My curfew is 10:00…",
  "data/reddit-ask/r/NoStupidQuestions/comments/rgnza0/do_people_actually_talklisten_to_music_in_the_car.json": "Growing up, whenever my parents would drive me around they had a strict no\ntalking/playing music rule and would ground me if I said anything while they\ndrove. Now that I have my license my friends have started saying that it’s super\nweird driving with me because I don’t talk, and won’t let them…",
  "data/reddit-ask/r/NoStupidQuestions/comments/rh1sex/why_did_megamind_never_get_a_second_movie.json": "I can't be the only one who's thought about this. Megamind has to be my favorite\nDreamworks movie of all time. It's a classic that helped shape the humor and\nculture of today. It's certainly better than Trolls. That shit got like another\nmovie and 20 shows and shorts. Did the movie not have as much…",
  "data/reddit-ask/r/NoStupidQuestions/comments/rh1tau/what_is_that_really_posh_sounding_american_accent.json": "It's like the US equivalent of BBC English or RP. Here's some examples\n\n> Mass Effect - EDI [https://youtu.be/b1AN6dNgYWQ]\n> \n> Prototype 2 - Red Crown [https://youtu.be/fEBwA2LUn6k]",
  "data/reddit-ask/r/NoStupidQuestions/comments/rh4qei/how_do_overweight_people_bang.json": "Do you have to hold the flab that gets in the way?\n\nDo the romantic partners just commit to climbing on top every time?\n\nIs there a point where you just can't due to not being able to locate/reach\nthose areas?",
  "data/reddit-ask/r/NoStupidQuestions/comments/rh4v26/when_did_the_usa_start_adding_so_much_sugar_to.json": "I'm an American and pretty frustrated by how hard it is to avoid excessive\namounts of sugar. An example is I used to buy \"regular\" applesauce which has\nlots of sugar added to get kids to eat it. I switched to unsweetened applesauce\nand it tasted so bland at first! But after a few months of eating…",
  "data/reddit-ask/r/NoStupidQuestions/comments/rh67hz/do_you_flush_every_time_you_go_to_the_bathroom.json": "I always flush after I’ve gone, but I had friends that would leave #1 and\nsometimes #2 in their toilet claiming they wanted to save water. Do others do\nthis too?",
  "data/reddit-ask/r/NoStupidQuestions/comments/rh7qps/if_a_girl_randomly_sends_you_a_photo_of_her_legs.json": "Yes, attached to her body",
  "data/reddit-ask/r/NoStupidQuestions/comments/rhgikj/is_the_grinch_his_name_title_or_species.json": "Is he called the grinch because that’s his name, the name of his job, or his\nspecies?",
  "data/reddit-ask/r/NoStupidQuestions/comments/rhluwx/why_is_muhammad_such_a_common_name_among_muslims.json": "Edit: Many answers have pointed out that Jesus is in fact a common name in many\ncountries. I agree with that but still it's not as common as \"Muhammad\" (Which\nis the most popular first name in whe world with over 150 million people). I\nwant to understand this difference. Is it social, religious,…",
  "data/reddit-ask/r/NoStupidQuestions/comments/rhntid/why_do_some_overweight_people_seem_angry_that_i.json": "They often say things like \"you can do whatever because you're skinny now. (I\nstill have to lose at least 20 pounds more to be the highest range for normal\nweight)\n\nOr at worst they will try and push extra work onto me, the kind that takes more\nenergy because \"Well were fat so its just easier for…",
  "data/reddit-ask/r/NoStupidQuestions/comments/rhqkxd/what_would_happen_if_you_packed_baking_powder_so.json": "Of course eventually customs will see it and arrest you under suspicion of\nimporting controlled substances but what happens once they test the stuff and\nturns out to be just baking powder?",
  "data/reddit-ask/r/NoStupidQuestions/comments/rhr3z4/what_is_actually_ok_during_a_thai_massage.json": "Since september, instead of going to a therapist like recommended I decided to\nspend my money on thai massages.\n\nI am NOT searching for happy endings; I just want the kind of painful massages\nsince I’m struggling with my shoulders because of climbing and I think that\ncould be the cause of being…",
  "data/reddit-ask/r/NoStupidQuestions/comments/rhrt8c/do_amputees_require_less_calories_to_stay_alive.json": "In theory… there is less body, so technically wouldn’t they require less\ncalories to keep body temperature up?",
  "data/reddit-ask/r/NoStupidQuestions/comments/riesop/does_anyone_else_automatically_ignore_pinned.json": "I’m a appealing cat",
  "data/reddit-ask/r/NoStupidQuestions/comments/riev18/do_psychics_actually_believe_in_what_they_tell.json": "Do they scam people on purpose or do they actually think they’re on to\nsomething?",
  "data/reddit-ask/r/NoStupidQuestions/comments/rio7bi/if_you_found_money_on_the_street_would_you_return.json": "Found Lotta money on a street near a fast food joint..I know it came from\nthere..but is returning it going to really do anything for this fast food chain?\nI definitely could use this cash for the holidays..",
  "data/reddit-ask/r/NoStupidQuestions/comments/riutmk/people_always_say_drug_addiction_ruins_their.json": "I smoke weed nightly and look forward to it every day. I don't feel or act any\ndifferently than before I started. I'm in school and work and I'm able to not\nonly get through it but excel. Its crazy saying this but weed even increased my\nmotivation (when I'm not high) and makes me wake up…",
  "data/reddit-ask/r/NoStupidQuestions/comments/riw68a/what_do_i_do_about_my_neighbor_who_keeps_passing.json": "So twice today my neighbors smoke alarm has gone off, causing me to knock on the\ndoor and eventually just enter because she doesn't lock her door. Both times she\nhas been passed out on her bed or couch, all of her stove burners on, clearly\nbreathing but messed up enough to not be woken by a very…",
  "data/reddit-ask/r/NoStupidQuestions/comments/riwjwf/as_a_kid_what_did_you_think_was_more.json": "As an 80s kid, I thought the following things were going to be much more common\nand a threat to my adult future:\n\n 1. Quicksand I really thought it would be everywhere.\n\n 2. Death penalty by electric chair I thought this was a common punishment for\n    anything and there wasn't a death row/waiting…",
  "data/reddit-ask/r/NoStupidQuestions/comments/riwlww/what_is_the_obsession_with_chick_fil_a.json": "People are always standing in lines wrapped around the building and the line for\ndrive thru is always blocking traffic and this is every time of the day morning\nor night. What is the big deal? I've been a few times and it's just a chicken\nsandwich. I'm from LA and good food is plentiful there so…",
  "data/reddit-ask/r/NoStupidQuestions/comments/riybv7/why_are_cloaks_not_more_acceptable_in_society.json": "They also look cool af.",
  "data/reddit-ask/r/NoStupidQuestions/comments/rj0w7g/do_you_ever_feel_an_obsession_coming_on_not_in_a.json": "This has happened to me since I was a teenager. I just love things so much and I\ncan tell when it’s happening but I can’t tell if it’s reasonable.",
  "data/reddit-ask/r/NoStupidQuestions/comments/rj22d2/if_two_men_cum_in_one_woman_at_basically_the_same.json": "Just blazed af trying to think about this",
  "data/reddit-ask/r/NoStupidQuestions/comments/rj2wr4/car_parked_in_front_of_my_house.json": "Alright, here’s the story. I’m at home right now, it’s currently 12:10 AM for\nme. Now there’s been a car parked at the very end of my driveway with the front\nfacing my house for the past 3 hours. Throughout those 3 hours the headlights\nhave come on for around 3-5 minutes and then turned off at…",
  "data/reddit-ask/r/NoStupidQuestions/comments/rj9gh4/could_you_have_kevlarreinforced_breast_implants.json": "Like, imagine some guy just about to shoot you in the titties but then you\nsurvive with basically no injury and then you can say some sick one liner like\n\"I paid extra for these\" or \"I have god and modern plastic surgery on my side!\"\nor something funnier idk I'm stoned right now.\n\nasking for a…",
  "data/reddit-ask/r/NoStupidQuestions/comments/rja072/how_do_i_know_if_a_gun_is_loaded_when_its.json": "Just so I can know if the shooter is tricking me or not",
  "data/reddit-ask/r/NoStupidQuestions/comments/rjcvxq/if_your_iq_score_is_low_does_that_mean_your_stupid.json": "All my life my parents did everything they could to make sure I had the best\neducation. They always planned for the future and they have kids planned down to\nhaving my siblings 4 years apart so they wouldn’t have to pay for college\ntuition for 2 kids at one time.\n\nBut I was different. I didn’t do…",
  "data/reddit-ask/r/NoStupidQuestions/comments/rjenvl/why_is_everyone_so_scared_of_a_population_decrease.json": "elon musk said a bunch of stuff about how india's population going down would be\nhorrible, but wouldn't that be good for their horrible overcrowding issues? what\nare the long term effects of all of this?",
  "data/reddit-ask/r/NoStupidQuestions/comments/rjg3m1/how_does_chris_brown_have_a_career.json": "He's one of the most publicly terrible people yet his music still recieves a ton\nof publicity. He's a known woman abuser, yet his audience consists of plenty of\nladies",
  "data/reddit-ask/r/NoStupidQuestions/comments/rjirjf/if_trexes_had_tails_how_did_they_fuck.json": "If Mr. Tyrannosaurus rex want to pork his girl, Mrs. Tyrannosaurus Rex wouldn't\nthe tail be in the way for traditional animal humping.\n\nAnd if they have internal sex organs (like birds) between the legs they either\nwould have to have one lying on its back and with a body like that I bet it\nwould be…",
  "data/reddit-ask/r/NoStupidQuestions/comments/rjj7yv/why_do_americans_rake_the_fallen_leaves_from.json": "I don’t get it. I mean it’s what nature does, decomposes. Not to mention it’s\nputting nutrients back into the soil.\n\nWhy go through all that trouble (or even moreso, pay someone to do it) when it’s\nbest to just leave them?",
  "data/reddit-ask/r/NoStupidQuestions/comments/rjz07u/why_do_some_americans_proudly_call_themselves.json": "Or generally, Westerners. I've only seen it online, but it makes me wonder. I\ncome from a post communist Eastern European country and while I wasn't born\nduring the time, stories from my family are horrific about what a devastating\nregime it was. Why do people that come from non communist countries…",
  "data/reddit-ask/r/NoStupidQuestions/comments/rk07gx/what_expenses_are_normal_to_make_a_20_year_old.json": "my daughter hasnt had to pay for rent, insurance, cell phone. over the last week\nshe decided she needed a dog and despite asking her brother and I for our\nopinions, decided she didn't care about those and just got this dog anyway. I\nobviously fucked up by not making her pay for anything and it's…",
  "data/reddit-ask/r/NoStupidQuestions/comments/rk3x6e/why_do_many_christian_private_schools_restrict.json": "Edit: I wanted like an actual explanation, please stop with the edgy atheist\ncomments. it's not helpful",
  "data/reddit-ask/r/NoStupidQuestions/comments/rk4biz/my_11_year_old_sister_was_coerced_into_sending.json": "Recently when going through her Ipad to ensure she was being responsible online\nmy mother found explicit content of my 11 year old sister on her device.\n\nApparently somebody approached her in Roblox subgame and demanded private\npictures of her saying he knew where she was and he was gonna hurt her.…",
  "data/reddit-ask/r/NoStupidQuestions/comments/rkegv5/what_is_this_word_i_am_thinking_of_its_on_the_tip.json": "It’s something like “schematics” but it’s basically a common blanket term for\ndetails regarding events. Including dates, times, locations, etc.\n\n“Text me the (blank) surrounding the party tomorrow” would be an example, where\nthe (blank) would be multiple things including the date, time, address,…",
  "data/reddit-ask/r/NoStupidQuestions/comments/rkf4oz/nonamerican_here_when_driving_from_one_state_to.json": "Let’s say I’m from Illinois and I drove to Indiana, will I be freely allowed to\ngo to the state or will there be a place where my documents would be processed\nfirst before I’m allowed to enter Indiana?",
  "data/reddit-ask/r/NoStupidQuestions/comments/rkp277/i_live_in_an_area_that_was_hit_bad_by_the_tornado.json": "From utility company:\n\n“Your service is an old direct buried service (not in conduit) that was\ninstalled years ago. It was damaged by the tornado. You will need to contact an\nelectrician and have it replaced to code (with conduit) before we can restore\npower to your home. I believe the guys…",
  "data/reddit-ask/r/NoStupidQuestions/comments/rkrsrs/in_the_era_of_pornhub_how_are_adult_video_stores.json": "Like seriously I pass 3 on my way to work. And sometimes. Like 30% of the time.\nThey have multiple cars in front. I'm in TX BTW. Do these ppl not know pornhubs\nfree or what's going on?",
  "data/reddit-ask/r/NoStupidQuestions/comments/rkry1q/is_rantiwork_actually_a_realistic_representation.json": "I don't doubt that there's a lot of shady things that happen at jobs, but from\nmy work experience, a lot of what is complained about is fairly innocuous. Like\nthe other day someone's boss put a note up saying if anyone touches her chair\nwhile she was on vacation, they'd get fired on the spot and…",
  "data/reddit-ask/r/NoStupidQuestions/comments/rkuz8y/i_neglected_my_body_for_many_many_years_to_the.json": "I don't want to lift cause my bones or joints and a lot of other things hurt\nwhen doing that.\n\nI tried running but my lungs felt like they were on fire after like 2 minutes.\n\nHmm, what if I eventually got a bike in the future, would that be good enough\nexercise, or would it not be enough in and of…",
  "data/reddit-ask/r/NoStupidQuestions/comments/rkwkiy/why_is_lucifer_aways_shown_as_an_ugly_demon_even.json": "Always*",
  "data/reddit-ask/r/NoStupidQuestions/comments/rl02iz/do_you_ever_not_eat_supper_because_the_meal_prep.json": "My fridge and cupboards are fully stocked, so lack of food isn't an issue. I\ncould whip up a traditional U.S. Holiday meal tonight if I wanted too, but\ncooking supper is just too time consuming and right now I'm exhausted from a\nlong day at work. I live alone, so its not like I have anyone else to…",
  "data/reddit-ask/r/NoStupidQuestions/comments/rl90z2/is_it_weird_that_i_cuddle_and_give_lots_of_kisses.json": "The mother and I are separated and recently I've been getting him for 6-9 days\nat a time after not really being too active or involved before. I'm in his life\nnow and plan to keep being. It's great to teach him, watch him learn and become\nsmarter. Since I only have one bedroom for myself right now…",
  "data/reddit-ask/r/NoStupidQuestions/comments/rlcioi/do_people_who_speak_languages_with_masculine_and.json": "Considering a lot of native English speakers mix up they're, their, and there,\ndo a lot of Spanish or French speakers mix up the \"le\" or \"la\" they're putting\nin front of table or \"chambre\" and how is it viewed if you do mix it up?",
  "data/reddit-ask/r/NoStupidQuestions/comments/rldrj8/how_are_camgirls_onlyfans_girls_etc_not_afraid_of.json": "I mean there are SOME people who hide their faces but like 90% of them willingly\nshow their faces on camera and are OK with their faces being all over the\ninternet. Do they just don't care? Do they have zero to none relationships with\nfriends and family? I'm curious on how a person could decide…",
  "data/reddit-ask/r/NoStupidQuestions/comments/rlha1n/isnt_the_first_black_superhero_movie_blade_and.json": "Just confused why people all of a sudden say “Finally!” when “Black Panther”\ncame out, because “The Blade Trilogy” (at least 1 & 2) were really good.",
  "data/reddit-ask/r/NoStupidQuestions/comments/rliuvh/does_anyone_else_here_not_wanna_have_kids_out_of.json": "Anyone relate?",
  "data/reddit-ask/r/NoStupidQuestions/comments/rlkj7s/my_mom_just_died_what_do_i_do.json": "I'm 18 years old and live in my (now dead) moms basement. I got home from the\nhospital after my mom was complaining about heart problems a few minutes ago,\nand the doctor called me. They just informed me of her death. I don't know what\nto do now. I'm supposed to be the one in charge but I can't…",
  "data/reddit-ask/r/NoStupidQuestions/comments/rlmmuq/is_it_abnormal_to_not_hear_a_voice_in_your_head.json": "I made a joke to a friend the other day about how the \"internal voice\" seen in a\nlot of novels is a rather stupid storytelling tool and makes the speaker sound\nschizophrenic.\n\nHe looked at me weird and said \"It's not a storytelling tool. You don't have\nthat?\"\n\nI had no clue what to say. I've never…",
  "data/reddit-ask/r/NoStupidQuestions/comments/rlreso/is_it_normal_to_not_wash_your_feet_while_in_the.json": "My wife thinks it’s gross that I don’t bend down to wash my feet when I shower.\nNow I’m kind of embarrassed to ask friends if they do. I always figured the soap\nfrom washing your body basically cleans them naturally.",
  "data/reddit-ask/r/NoStupidQuestions/comments/rlvyqx/does_anyone_actually_use_cruise_control_on_their.json": "If so, how and when? (Not relating to Tesla autopilot).",
  "data/reddit-ask/r/NoStupidQuestions/comments/rm02is/is_santa_real.json": "My mom says santa real but my friend says he isn't.",
  "data/reddit-ask/r/NoStupidQuestions/comments/rm43pu/why_do_these_child_prodigies_disappear_after_a.json": "I mean, they don't become the next Einstein as everyone thought",
  "data/reddit-ask/r/NoStupidQuestions/comments/rm972h/does_the_german_version_of_scrabble_have_the_ß.json": "I just thought about this and I'm curious if it has it.",
  "data/reddit-ask/r/NoStupidQuestions/comments/rmbe0q/fake_medical_reason_not_to_drink_alcohol.json": "So I don't drink alcohol, for personal reasons. The company Christmas party is\nthis afternoon and it seems getting drunk is de rigueur. What sort of medical\nreason can I use not to drink that won't come back and bite me in the rear\nlater? Can I be allergic to alcohol? I'm male, 45",
  "data/reddit-ask/r/NoStupidQuestions/comments/rmmvzg/im_24_and_my_mom_does_my_laundry_takes_out_my.json": "I'm still living at home because I'm in grad school. My mom has always taken\ncare of me and I don't think she will stop until I move out",
  "data/reddit-ask/r/NoStupidQuestions/comments/rmota2/are_astronaut_allowed_to_jerk_off_in_space.json": "I know it's pretty taboo but I'll always wonder if astronauts are allowed to\njerk off in space. And how is the discharge manage?",
  "data/reddit-ask/r/NoStupidQuestions/comments/rmqlb1/is_it_annoying_or_off_putting_for_a_guy_to_have_a.json": "Today my girlfriend and I decided to take a nap together and it was my first\ntime ever cuddling and my girlfriend and I were spooning, and well…I was so\nexcited and happy that I had a boner the whole time.\n\nIs that off putting or obnoxious?",
  "data/reddit-ask/r/NoStupidQuestions/comments/rmvl0i/are_there_any_cat_subs_that_ban_posting_cats_that.json": "Man I just want to see some cute cats without every other post being about how\ntheir cat just passed away or died years ago.. just want some alive cats to awww\nover lmao",
  "data/reddit-ask/r/NoStupidQuestions/comments/rn18ee/most_schools_makes_us_learn_a_second_spoken.json": "Seems like a simple fix to me. If you have to learn Spanish in the US so you can\ncommunicate with Spanish speakers, that still leaves out the entire rest of the\nworld. So why not we all learn sign language to communicate with everyone?",
  "data/reddit-ask/r/NoStupidQuestions/comments/rn3jse/what_is_an_instant_turn_off_to_you_visually.json": "Just curious, for me the first thing that comes to mind is sagging pants.",
  "data/reddit-ask/r/NoStupidQuestions/comments/rn3pmv/why_do_men_like_boobs_so_much.json": "My boyfriend likes to hold mine every single opportunity he gets, while cuddling\nwhile sleeping while resting while I talk with him. It’s odd, why do you like\nthem!?!? TELL MEE WHYYYY i mean I get the appeal that it’s soft and round but\nit’s like touching your balls, I wouldn’t want to do it every…",
  "data/reddit-ask/r/NoStupidQuestions/comments/rn5ndd/why_dont_people_who_get_attacked_by_geese_just.json": "I haven’t been attacked by a goose (yet) but their long necks certainly seem\nlike most people could fit their hands around them.",
  "data/reddit-ask/r/NoStupidQuestions/comments/rncrqw/redditors_with_siblings_did_your_parents_ever.json": "They’re something my parents would do every now and then when I was a kid, they\nwould line me and my siblings up and pick which one of us was the ugliest.\n\nJust wondering if anybody else went through something similar.\n\nThanks!\n\nEdit: I’ve been informed by several comments that “Ugly Contests” are…",
  "data/reddit-ask/r/NoStupidQuestions/comments/rnhhcj/how_do_you_call_your_bathroom_if_you_dont_have_a.json": "Just wondering since it implies you have a bathtub in it but I only have a\nshower and toilet.",
  "data/reddit-ask/r/NoStupidQuestions/comments/rnkrpc/is_anyones_mental_health_worse_at_this_time_of.json": "I like Christmas, but I think the expectation of ‘having’ to enjoy myself puts\nunnecessary pressure on me, if that makes sense?",
  "data/reddit-ask/r/NoStupidQuestions/comments/rnmqcw/how_is_it_that_when_someone_is_very_drunk_and.json": "How does that make sense?",
  "data/reddit-ask/r/NoStupidQuestions/comments/rnmxzh/why_do_people_flex_so_hard_at_the_airport.json": "Bruh your $4k outfit makes you look like a pillow and guess what: We’re all\ngetting on the same tube with wings.\n\nIdk I just cannot seem to find the energy to dress remotely nice when flying.",
  "data/reddit-ask/r/NoStupidQuestions/comments/rnon80/why_are_so_few_people_in_the_christmas_mood.json": "Nobody ive talked to this year is in the Christmas mood, it doesnt feel like\nChristmas. Is it because of covid? Last felt really Christmassy, this one doesnt\nfeel special. How come?",
  "data/reddit-ask/r/NoStupidQuestions/comments/rnpfsi/what_should_i_do_while_the_furnace_guy_is_here.json": "It's so awkward having someone at my house to fix or work on anything. I feel\nlike I should be doing something. I'm not going to sit there and make small talk\nwith the poor guy.\n\nThis has been over 30 years of awkwardness for me. I've never known what I\nshould be doing.\n\nIt's winter, so it's not…",
  "data/reddit-ask/r/NoStupidQuestions/comments/rnrn97/why_is_canceling_student_debt_being_considered.json": "I understand that student loans programs are predatory and higher education\ncosts and arm and a leg and the system needs to be fixed.\n\nBut in terms of canceling debt.. why is it student loan debt that we are talking\nabout and not medical debt??\n\nnot trying to argue against student debt forgiveness,…",
  "data/reddit-ask/r/NoStupidQuestions/comments/rns272/how_can_the_us_govt_place_so_much_importance_on.json": "\"Join the military of the greatest military power in the world, you will\nprobably end up homeless afterwards!\"\n\nHow does this even make sense? Shouldn't a nation, which puts so much emphasis\non the might of its military, be pouring billions into ensuring that none of its\nmilitary vets end up like…",
  "data/reddit-ask/r/NoStupidQuestions/comments/ro0sc3/if_every_cell_in_your_body_is_replaced_in_7_years.json": "I gather that they’re just ink particles between our skin, but how are they not\nat least extremely deformed after every cell next to the tattoo has been\nreplaced?",
  "data/reddit-ask/r/NoStupidQuestions/comments/ro43oh/why_did_people_sound_more_intelligent_50_years_ago.json": "Whenever I watch videos from the 1960s/1970s, I notice that people had a\ndifferent speaking style. It’s like everyone was much more articulate and\nnuanced with their speech. It seems like today, everyone just speaks more\nlazily.",
  "data/reddit-ask/r/NoStupidQuestions/comments/roay9z/nsfw_back_when_pictures_had_to_be_developed_and.json": "I wasn't old enough to take naked pics of myself back when film cameras were the\nnorm so I don't know how developing these would work. I just remember going to\nthe store and handing in the roll and coming back after some time and get the\npictures inside an envelope. So if I took naked pictures of…",
  "data/reddit-ask/r/NoStupidQuestions/comments/rogj06/what_did_jesus_do_as_a_child.json": "I feel like everything I hear about the big JC - it's about his life as an adult\n- does the Bible cover his life as a child or does it just timejump like a\nnetwork TV series on AMC?\n\nEdit: I'm not religious, just curious as to what the story is",
  "data/reddit-ask/r/NoStupidQuestions/comments/rokfb9/does_anyone_else_find_their_viewing_experience_is.json": "And yes without being muted 😂",
  "data/reddit-ask/r/NoStupidQuestions/comments/ronurk/is_it_weird_to_offer_your_coat_to_a_girl_youre.json": "out with a bunch of friends getting drinks last night, was a big group so not\nlike super close with everyone obviously but i at least knew of all the people\nthere. tldr i offered my coat to a girl that was obviously cold (we had talked\nbefore on friendly terms, not a stranger nor a close friend i…",
  "data/reddit-ask/r/NoStupidQuestions/comments/roonow/when_will_i_stop_feeling_like_three_toddlers_in_a.json": "I'm 27, at my job I feel like I'm just, feel like I'm pretending I know what to\ndo and figuring it out as I go along,\n\nI sat down at the bar at a restaurant and I felt like filling behind the counter\nmight realize that I'm too young for this or I don't belong here, she was\nprobably a couple years…",
  "data/reddit-ask/r/NoStupidQuestions/comments/rowpe2/why_are_human_teeth_so_fragile.json": "Is it because of some chemical we consume in our modern food??\n\nWhenever I see wild animals especially big cats like lion, tiger they have super\nshiny and sharp teeth while on the other hand you have human teeth that just\ndon't want to remain healthy.\n\nYou didn't brush and floss .congrats now you…",
  "data/reddit-ask/r/NoStupidQuestions/comments/rox6oe/do_teens_still_have_posters.json": "I never had any kids and I’m almost 50 so I have no idea what Kids These Days™\ndo. Are posters still a thing? Reason I ask is I saw a SportsCenter tweet about\none basketball player putting another basketball player “on a poster.” For those\nwho do not follow the basketballs, this means the former…",
  "data/reddit-ask/r/NoStupidQuestions/comments/roxwrb/is_anybody_else_super_scared_when_being_on_the.json": "Everytime I'm a passenger in someones car, I get super anxious and I'm under\nconstant adrenaline. Every turn my head thinks the driver might not steer, so I\nprepare myself to jump in and steer. Everytime they brake I feel like it's way\ntoo late and we're gonna crash. Every car ride is like a…",
  "data/reddit-ask/r/NoStupidQuestions/comments/rp5igi/is_it_weird_to_go_to_the_movies_alone.json": "I'm desperate see the new spiderman movie but all of my friends are busy or have\nseen it before. is it weird to just go by myself? I know there'll be groups of\npeople there and I'm very introverted (17F), should I just wait until someone\nelse can come? I live in a small town so its likely I'll see…",
  "data/reddit-ask/r/NoStupidQuestions/comments/rpdz11/left_at_home_announced.json": "I woke up today without my mother or brother being home. I send them both a\nmessage, unanswered. It's nearly 5pm and I am considering calling the police.\nI've asked some friends of theirs and they haven't answered. I know I shouldn't\nworry but I don't know what to do.\n\nEdit: aunt picked me up. She…",
  "data/reddit-ask/r/NoStupidQuestions/comments/rpgu8o/how_do_i_shave_my_asshole_hair.json": " 1. It’s nasty\n 2. If that time comes I don’t want to get denied",
  "data/reddit-ask/r/NoStupidQuestions/comments/rplha3/brushing_teeth_in_the_shower.json": "So my girlfriend thinks I'm weird for brushing my teeth in the shower, I say\nit's a normal thing most people do, what do everyone else think? Weird or not?",
  "data/reddit-ask/r/NoStupidQuestions/comments/rpmai3/do_people_still_masturbate_the_older_they_get.json": "So I had a thought today, do most people just stop masturbating at a certain age\nlike 30s, 40s etc.\n\nYou always hear of older couples not having time for sex. Does the same thing\napply to individuals as you get older?",
  "data/reddit-ask/r/NoStupidQuestions/comments/rpq5qo/why_do_we_donate_blood_for_free_when_hospitals.json": "When I gave blood in the past, I foolishly assumed that because I DONATED it,\nwhoever received it would receive the donation for free. I guess that's pretty\ndumb, because how else do hospitals get blood?\n\nWhenever somebody desperately needs treatment in America, the first thought is\nhow much it's…",
  "data/reddit-ask/r/NoStupidQuestions/comments/rpr0kf/do_kids_in_the_us_actually_work_while_studying.json": "Recently, I watched Spiderman - No way home and noticed that MJ was working at a\nstore while waiting for the result of her college application. I have seen this\noften in so many movies and this got me thinking.\n\n 1. From what age are you allowed to work and why do teenagers work in the first\n   …",
  "data/reddit-ask/r/NoStupidQuestions/comments/rpsbnx/what_should_i_do_if_im_gonna_be_homeless.json": "I’m staying at an Airbnb right now, I have $198 in my account, I have a car, I\nhave a job. My family kicked me out because I told my brother about them\ntreating my nephew the way they treated us and fighting in front of him. I can’t\nstay with my partner, I can’t stay with any friends, my brother…",
  "data/reddit-ask/r/NoStupidQuestions/comments/rq271x/how_can_i_not_read_a_book_for_10_minutes_but.json": "imagine the amount of books i would've consumed by now",
  "data/reddit-ask/r/NoStupidQuestions/comments/rq9ofl/am_i_weird_for_thinking_mostall_marvel_superhero.json": "It’s just the same story arc with a different superhero skin placed on top.\nThere’s nothing interesting about the story or the cringe edgy teenage humour or\nthe CGI action scenes.\n\nI mean the first Captain America the first avenger was cool asf mainly because\nof the aesthetic and story.\n\nMaybe I’m…",
  "data/reddit-ask/r/NoStupidQuestions/comments/rqdxzf/how_do_i_emulate_what_streamers_do_for_my_daughter.json": "My daughter, only 6yo, loves watching influencers play games, Lanky Box being\nher favourite.\n\nI built her a PC so she could play Minecraft, and bought her a webcam. Little\ndid I know she's been making videos on the hard drive, saying crap like \"Like\nand Subscribe\" lol.\n\nHow do I do what the…",
  "data/reddit-ask/r/NoStupidQuestions/comments/rqg0e6/is_there_a_good_alternative_word_for_bitch.json": "I am trying not to cuss, and the other cuss words are easy to replace, for\nexample \"frig\" and \"crap.\"\n\nBut \"bitch,\" as in, \"that lady's a bitch,\" is really hard to replace. I've tried\nshe-devil, jerk, wench, but those words just don't have the same pizzaz, and\ndon't convey the message of a nasty,…",
  "data/reddit-ask/r/NoStupidQuestions/comments/rqnbgh/would_people_find_this_suspicious_or_sweet.json": "Im 14 and I make stuffed animals. During Christmas, I gave a stuffed animal to a\nmall Santa to thank him for making children happy during the holidays and he\nseemed very thankful. If i were to go to the mall and give out handmade stuffed\nanimals to random people (probably children since they’d…",
  "data/reddit-ask/r/NoStupidQuestions/comments/rqqc6w/why_arent_paparazzi_arrested_for.json": "Do they get a permit or something that lets them camp outside a persons house\nuntil ungodly hours or piss off someone who just wants to get a coffee all\nbecause they were in a movie? They’re such bottom feeding scum.",
  "data/reddit-ask/r/NoStupidQuestions/comments/rr0j5y/does_anyone_have_difficulty_relaxing_or_doing.json": "It could be 10am and you have an appointment at 4pm but it makes you unable to\nenjoy yourself or relax until the appointment is completed.",
  "data/reddit-ask/r/NoStupidQuestions/comments/rr3vfu/why_is_sleeping_at_night_so_hard_but_sleeping_in.json": "stole from a tweet but I still need to know the answer.",
  "data/reddit-ask/r/NoStupidQuestions/comments/rr7iot/if_cooking_is_traditionally_expected_do_be_done.json": "Just to be clear: English is not first language and i did not know how phrase it\nbetter. I do not think that women should do all the cooking or stay in the\nkitchen. I hope you can still understand my question.",
  "data/reddit-ask/r/NoStupidQuestions/comments/rr97xf/why_is_that_women_believe_in_star_signs_far_more.json": "And before you say \"oh that's so sexist!\", it's true.",
  "data/reddit-ask/r/NoStupidQuestions/comments/rrcsk4/high_paying_soul_sucking_job_vs_emotionally_great.json": "Hello internet, I’m in a fortunate situation, but could use the advice of\nstrangers to decide what to do. After months and months of trying I finally have\nheard back from some job offers.\n\nJob A pays a lot more than I’ve ever made over 100k. No health insurance,\ncontractor work, lots of OT. It…",
  "data/reddit-ask/r/NoStupidQuestions/comments/rron5m/why_does_reddit_always_put_some_sweaty_guy_in_a.json": "Its really awkward some sweaty dude staring into the camera playing drums always\non my feed why am I seeing this and why is it always the same dude",
  "data/reddit-ask/r/NoStupidQuestions/comments/rs2scx/why_are_nfts_worth_anything.json": "I’m trying to understand it, but I really can’t. You “own” a picture or video or\ngif that I can very easily take a screen shot of and have myself. So how does it\nhave any value? Not trying to sh!t on it, I’m just not understanding the logic",
  "data/reddit-ask/r/NoStupidQuestions/comments/rs4f9r/why_is_minimum_wage_not_a_ratio_based_on_cost_of.json": "This is something I’ve never understood. The reason behind the federal minimum\nwage existing is to provide a livable wage (as stated by FDR); however, the wage\nneeded varies by state and even by city.\n\nSo my question is: why isn’t this a ratio based on cost of living? If it was,\nwhen cost of living…",
  "data/reddit-ask/r/NoStupidQuestions/comments/rs4omx/do_guys_generally_give_shorter_responses.json": "Man, I need to stop overthinking about this but I need an answer. Askmen's bot\nremoved my post there so might as well ask here! :)\n\nQuick info: Among my female friends, I noticed a lot of them gave long and\ndetailed answers about a random topic or their thoughts and I do that too. But\nthe opposite…",
  "data/reddit-ask/r/NoStupidQuestions/comments/rs63ev/is_there_a_word_that_means_to_infect_but_positive.json": "This had just come up, I'd used the word in a positive way, but the other person\nfelt that word was off. And I agreed. But when we tried to think of a similar\nword with a positive connotation, we were both left at a blank, and trying to\nfind synonyms with Google was no help, with Google only…",
  "data/reddit-ask/r/NoStupidQuestions/comments/rsa6xm/why_arent_standard_king_size_beds_perfectly_square.json": "Standard king size bed is 76 inches x 80 inches. If they were perfectly square\nthen we could get more creative with bed frames, plus the ability to rotate the\nmattress 90 degrees as they wear out. It might even make more manufacturing\nsense to have interchangeable dimension.",
  "data/reddit-ask/r/NoStupidQuestions/comments/rscogc/does_anybody_else_hold_mock_conversations_in.json": "When I need to tell something just anything to someone I know, I run through a\nsimulation of it in my head. What I predict they would react with and how I\nwould respond to avoid awkward situations. Sometimes I do it when I’m bored for\nkicks\n\nDoes anybody else do this?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/r61ken/how_come_so_many_richpowerful_people_are.json": "They can have any women/men available for any kinks they have. But end up doing\nfucked up things to kids ? Like it doesn't make sense. All the women/men who\nwill perform and consent to any fantasies that is imaginable to the human mind.\nBut they end up liking kids ?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/r6f0sn/new_adult_here_how_am_i_supposed_to_pay_all_these.json": "I live very frugally, and was doing okay, but my employer just handed out open\nenrollment for health insurance and... It's so expensive. Almost $500/month just\nfor me. That's an insane amount of money, almost 25% of my income. And when you\nfactor in rent, utilities, car costs, and saving for…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/r6gcs8/im_an_17m_intern_and_my_coworker_27f_rubbed_her.json": "Story:\n\nI'm a 17M intern at a nursing home and I love it there. Today my coworker (27F)\nasked me to go with her to the basement to return some stuff, and I of course\nagreed (we used the elevator down, she said she didn't wanna go alone because\nshe is scared that the elevator would stop working)\n\nSo…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/r6pzp2/why_is_youtube_trying_so_hard_to_be_kid_friendly.json": "This doesn’t make much sense to me. If they have a separate division made\nspecifically for children, why are they pushing creators so hard to be kid\nfriendly on the normal version?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/r6ux6x/what_would_be_the_long_term_effects_of_banning.json": "Im curious about the impact it would have on the mom, dad, child and society as\na whole.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/r6zktj/why_do_i_make_up_situations_with_other_people_in.json": "Do other people do this? The thing is I would never respond that way in person\nif it actually happened.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/r72kdi/does_anyone_get_horny_when_someone_fixes.json": "I installed a new garbage disposal tonight. My partner jumps my bones. She said\nit was the fixing of the garbage disposal that turned her on. Is that a thing?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/r73rfq/is_there_a_silly_nonvulgar_slang_term_for_a.json": "This question randomly came to mind while I was talking to my boyfriend. The\nword \"pussy\" just doesn't fit the tone of most scenarios, ya know? It's just not\na word I feel comfortable dropping casually? Whereas if you say \"pp\" everyone\nwill just laugh along without it feeling too out of left…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/r785nm/why_arent_people_afraid_of_the_known_long_term.json": "Known Long term effects of covid include: trachoostomies, damage due to tube\ngoing down their throats, kidney failure, months of physical/occupational/speech\ntherapy, pneumonia, blood stream infections, pressure ulcers, header failure,\norgan failure, brain fog and stroke-like symptoms\n\nKnown Long…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/r7bwkd/why_are_people_trying_to_normalize_being.json": "If you make a comment and say someone should lose weight, then you are\nautomatically “fat phobic”.\n\nMy cousin was 23 and a 685 lb male. I didnt make comments about his weight ever\nbut one time in my life, when I saw he couldn’t walk up three steps and was out\nof breath.\n\nI told him he needed to…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/r7ftau/what_do_you_say_when_someone_sends_you_nudes.json": "A girl I met on tinder wants to sext and I have no clue what to say when she\nsends a nice pic. Like, do you send them a 🥵 or a 👌 or a 🤌. I have no idea\nand I don’t want to ask my friends so here I am.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/r7k3u0/why_are_men_outraged_that_women_sell_their_nude.json": "Why are men outraged that women sell their nude photos, but continue to buy\nthem, and condemn the woman even after the purchase?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/r7pxt0/when_a_woman_says_no_to_a_guy_asking_her_out_or.json": "Do majority of guys take “no” as a “try harder” or does “no” tend to register as\n“it’s not going to work out”? I (F26) have had guys ask me out or ask about a\nrelationship, and when I tell them straight forward it wouldn’t work out or I’m\nnot interested, they’ll usually ask another handful of times…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/r7qilu/do_you_feel_like_an_adult_or_an_overgrown_child.json": "I have my own place, pay bills and stuff but I honestly feel like I’ve just been\nwingin it, is it because I don’t have kids or is there a certain age where\nthings click?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/r7rt2v/why_do_so_many_school_shootings_happen_in_america.json": "Been wondering for a while. I've heard and seen some very fucked up shit\nregarding them. It's kinda traumatising to see that happens so much there . Why\nspecifically are they school shootings?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/r7zutf/girls_house_party_peeing.json": "Had an interesting conversation the other day and turns out a fair few of my\nfemale friends have gone and peed in empty rooms at house parties because the\nbathroom queue was too long (not to mention they were pretty drunk 😆)\n\nI was shocked that so many of them had done, is this actually that…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/r8e0ws/would_you_destroy_the_statue_of_liberty_or_your.json": "That’s it. That’s the question.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/r8khzq/is_correcting_a_poc_about_offensive_language.json": "My sister in law, who is a POC used the offensive word for developmentally\ndisabled very casually in a conversation, and my wife who is white, told her not\nto use that word around her. My sister in law later started sending text\nmessages to my wife saying that \"standing up for a marginalized group…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/r8lzuk/do_westeners_always_use_toilet_paper_even_in_the.json": "I'm from Southeast Asia and its common for us to use a bidets to wash our asses\nwith water rather than wiping it with a toilet paper unless if there is no water\naround.\n\nToilet paper is not much sellable here and only bought a few rolls of it just to\nuse as hand wipes.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/r8s993/why_do_school_shootings_happen_most_often_in_a.json": "I am NOT suggesting or advocating for violence in any institution of education.\nEver. It is just something I noticed, and am curious what others think.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/r8w22a/do_women_feel_anything_when_a_guy_finishes_in_her.json": "Besides the obvious finishing in the mouth.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/r8w398/why_are_vegans_so_toxic.json": "Please keep in mind that I don't judge as \"officially\" vegan people like that,\njust from something I experienced.\n\nSo, some hours ago I joined a vegan community to learn about veganism and\nthought I can become a member of them.\n\nI asked if I can stay there as a vegetarian. Half of them were toxic,…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/r8wtr6/a_question_for_straight_women_would_you_date_a.json": "I'm 21, and still quite new to this \"new me\" after actually coming to terms with\nwho I am..\n\nSo yeah, if you met a guy, and you really like him, and he wants to date you,\nwould him being bisexual concern you in anyway?\n\nThere are alot of false Bi stereotypes, like, we are unfaithful, and…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/r8yy24/do_some_women_intentionally_just_flirt_with_men.json": "Can any women here admit they do this?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/r96dy7/is_it_strange_if_my_friend_is_flirting_with_my.json": "My friend is staying with me for a little while and has started to flirt pretty\nheavily with my younger sister. She’s flirting back, but she’s 15 and he’s 18. I\nam uncomfortable around them.\n\nI’m not the overprotective brother who snoops into my sisters life, but I can’t\nbe the only one who thinks…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/r9amve/did_a_movie_ever_traumatize_you_as_a_child.json": "I was thinking about it but when I watched the movie Signs when I was 6yo it\nscared the shit out of me, and now as an adult the topic of aliens gives me\nanxiety. I have a hard time looking out the window or looking in the mirror at\nnight now. Am I alone in this? Does anybody else have experience…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/r9f20w/do_boys_have_vivid_fantasies_about_their_crush.json": "so i saw a tik tok made by a guy that was basically things that girls don’t know\nabout guys and he said that guys have very vivid fantasies about their crush and\nnow i’m curious\n\nif you want you can explain one that you’ve had about some one you have/had a\ncrush on",
  "data/reddit-ask/r/TooAfraidToAsk/comments/r9j0by/reporting_stuff_actually_helps_us_commenting.json": "Please report stuff instead of grandstanding in your comments but not reporting.\nThe team is active but we cannot read every post and comment. Reporting stuff\nbrings it to the top of our queue.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/r9j0dj/do_people_from_india_think_other_cuisines_are.json": "I absolutely LOVE Indian food, packed with so much flavor! Curious if people\nfrom India think other cuisines are underflavored/under-spiced by comparison. I\nrecognize that India is huge, with a wide variety of cuisines in itself, just\ncurious what you all think of other foods. Thanks!",
  "data/reddit-ask/r/TooAfraidToAsk/comments/r9jn9a/how_do_you_feel_about_women_proposing_to_men.json": "This is my first Reddit post. Please be nice. ❤️\n\nWe’ve been together for a few years now. We’re absolutely in love and have all\nthe same life goals and moral beliefs.\n\nI have been married once before and when we first got together I made it clear I\ndidn’t want to get married again. My mind started…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/r9k2of/im_lgbt_but_dont_understand_how_someone_decides.json": "Can I ask a genuine question?\n\nAs someone who’s sex is female. I grew up wanting to be a boy. I wanted my\nbreasts to not be there because they ruined the aesthetic I wanted. I had\nfeelings for girls from a young age. I felt far more comfortable around boys and\nfelt uncomfortable around girls. Being…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/r9l28z/should_i_get_my_genitals_checked.json": "I know asking the internet for medical advice is a terrible idea but there’s\nsomething I’m not sure about and need clarity on.\n\nIn late August, I accidentally masturbated with hand sanitiser. It looked and\nfelt like lotion so my horny monkey brain thought it would be the same. After I\ncame, I felt…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/r9l6ip/proposing_to_gf_on_family_trip_to_hawaii.json": "My family has very generously invited my gf of almost 3 years to join us on the\ntrip. I’ve been thinking of popping the question for the last year now and was\nwondering if this would be an appropriate time to propose? I’ve always had in\nmind that I wanted to propose to my gf while horse back riding…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/r9psb7/how_or_even_should_i_white_female_call_out_my_woc.json": "I have a brown female friend who has a thing against Asian women. She often says\nnasty things about them. Sometimes when we are out in a group it's me, her and a\nfew other white chicks and she'll start going on about Asian women. Everyone\ngets uncomfortable but I feel like noone wants to be the…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/r9u0uy/do_people_with_ugly_kids_know_they_have_ugly_kids.json": "My wife and I were discussing this tonight and we got into a little debate about\nit. Now I know being “ugly” is subjective and everyone is beautiful in their own\nway, but I’m sure everyone here has met someone where there’s a general\nconsensus that the individual is not good looking. Do the parents…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/r9v3ul/who_actually_likes_machine_gun_kelly.json": "His rap sucks. His “rock” music sucks. And I’m not even being sarcastic when I\nask is it literally possible for him to be more a douchebag than he already is\nif his life depended on it? Not to mention he’s from Ohio.\n\nI keep hearing more and more about him but don’t know anyone in real life…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/r9xibl/men_do_any_of_you_actually_use_the_fly_on_your.json": "Men’s underwear have a fly, and it is like two opposing flaps of cotton each\nwith a seam. I’m wondering how many of you use that or usually just pull it out\nover the waistband instead?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/r9xokb/why_arent_religious_people_the_most_passionate.json": "I have always been confused about this, but it’s a sensitive topic to broach.\nLike, if you believe that god made everything in the universe, that it is all\ncreation, all made with intent; wouldn’t you be the most excited to observe it\nup close? To see it in all its intricate detail and gain a…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ra1ili/why_be_in_an_open_relationship_when_you_could.json": "Pretty much what the title says. I would like to hear you guys experiences and\nsee what is really the difference between the two!",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ra856u/im_38_and_havent_done_much_in_my_life_is_it_too.json": "I'm 38 and haven't done much in my life. Is it too late?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ra9t8k/why_does_so_much_of_reddit_hate_religion.json": "I don't mean the people that just say they don't like Christians or something, I\nmean the people that say stuff like \"wow, look at these absolute idiots\nbelieving in fairy tales. What a bunch of children\", or will actively\n\nI'm agnostic myself, so I'm not personally insulted or anything, but this…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rabyz4/whats_it_like_to_be_unattractive.json": "First off, I know how insensitive and ignorant this question might come across\nas, so I apologize if this hurts anyone’s feelings. I was wondering what people\nexperience in day to day life if you’re unattractive/ugly?\n\nI never thought much about it until recently one of my friends pointed out…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rach93/a_lot_of_people_say_that_the_covid19_pandemic_and.json": "Many people (mostly from the conservative/libertarian side) keep saying that\nbecause of the ongoing Covid-19 pandemic, the government took away a lot of our\nfreedoms, or that the government used the pandemic to reduce our freedoms and\ncontrol us even more. But I don’t see where we lost any of our…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/radif3/does_most_people_worry_about_breaking_character.json": "Everyone has to act \"professional\" at work, meaning everyone basically has to\nhave a separate, fake personality at work. Or at least it seems that way to me?\nDo people worry that they'll be found out? Do people worry that everyone at work\nwill figure out that their \"professional\" personality isn't…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/raft1t/why_do_girls_make_their_lips_bigger.json": "I'm 28 and no guy I've EVER talked to has found it attractive",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rao9v1/for_those_against_abortion_what_if_i_never_want.json": "These anti-abortion arguments always bring up how “women shouldn’t be having sex\nbefore marriage anyway,” like it’s some kind of foregone conclusion that once I\nput a ring on my finger, I’m going to want kids.\n\nI am a married woman who uses protection and hates kids, but I recognize that\nprotection…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rasesc/is_this_normal_boyfriend_behavior.json": "Everytime I try to talk to my boyfriend whether it’s on FaceTime or on the phone\nor in person…about my day, about my opinion about anything, just anything after\n20 seconds he will zone out and look elsewhere and his responses to everything\nis “yeah” “wow” “crazy” or no response at all. Its like…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ravhb0/am_i_leading_them_on.json": "I 17f am very affectionate, I have a few males friends and sometimes we cuddle.\nLike I’ll encourage them to lie next to me and I’ll hold them as we watch\nsomething. But I remind then first I’m not interested in a relationship.\n\nI talked to a female friend about it who said I’m massively messing…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rb267p/why_is_reddit_so_aggressive.json": "It’s not friendly to anyone who may post something that isn’t considered a good\npost to redditors. You’re immediately downvoted, provided some snarky comments,\nand then possibly your post is removed. Rinse. Repeat.\n\nEdit: like this post is most likely going to get downvoted to oblivion.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rbcah2/will_the_pain_end_at_some_point.json": "This is my first post on reddit and first time talking about what happened\nplease forgive my formatting, any tips will be appreciated. About 3 years ago my\nson was staying at my mothers house for the weekend. He spent a weekend there at\nleast once a month. This time, however, I got a phone call…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rbdhaq/bringing_new_neighbors_cookies_weird.json": "We (29m and 27f) recently had new neighbors our age move in next door. When we\nsaw they were about our age we were very excited to have neighbors around our\nage next door. Obviously, we weren’t going to become best friends overnight but\nwe were hoping we could start talking to them and build a…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rbp5no/do_some_women_truly_just_starfish_in_bed.json": "Woman here. I have always heard this from social circles or reading online\ncontent but I find it hard to believe, it’s even a bit comical to me, that there\nare literally women who spend their sex lives like a dead fish. Does it actually\nhappen?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rbt8j3/i_am_provax_however_i_am_not_sure_what_the.json": "I don't know much about this issue and I don't pay a lot of attention to covid\nnews as it doesn't actually have a major impact on my life day-to-day.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rbxm23/is_it_weird_that_i_feel_more_comfortable_wearing.json": "Ever since the pandemic started, I feel more comfortable wearing a face mask\nthan showing my actual face. I feel like I'm too grotesque and ugly to look at\nand wearing a face mask kind of hides that. It's gotten to the point where I\nthink me wearing a face mask is my \"actual face\". Kind of like how…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rc1mpl/will_covid_ever_end.json": "So I’m sitting here in my flat, in the UK, wondering when will this pandemic\nfuck off. This new variant is looking to be spreading swiftly and we’ve now been\ntold from Monday we should be working from home again among other restrictions.\nAnother lockdown is on the horizon if things get worse, I…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rce7v9/weird_question_to_males_only_do_you_actually_like.json": "If yes, why? If no, why?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rcgjuq/why_is_this_subreddit_turning_into_an_askreddit.json": "This sub should be used for knowledge and learning about stuff you are afraid\ntoo ask irl. It's sad watching this sub devolve into a men/women/teenagers(most\ncommon) tell us about x or your story of y.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rcguo2/how_many_of_my_fellow_females_here_on_reddit_got.json": "Hello everyone, I saw a post on reddit which stated that only some women/girls\nget sexually haressed but i actally think most have experienced it at least once\nin their life.\n\nI experienced it both in rl and online (23f)\n\n(PS. I know men can also get sexually harassed which is absolutly not okay…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rcmvwt/how_common_is_rape_actually.json": "I've heard that it's really common 1 in 5 women, but I've also heard that it\nhappens much less, either way it's horrible, but I'm really curious as to how\ncommon it actually is",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rcrngj/people_with_a_vagina_while_peeing_do_you.json": "I sometimes pretend while I'm peeing that my body is dispensing lemonade from\none of those soda machines where you press the buttons to get your drink.\n\nI know this is super specific but I have to know if I'm the only one who made\nthis weird mental connection. It's not sexual, just a joke (I wasn't…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rcsemu/why_do_some_people_blame_the_other_party_when.json": "I don’t understand why they get more mad at the person their s/o cheated with.\nWhy aren’t they more angry at their s/o?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rd8tfr/whats_the_deal_with_porn_having_so_much.json": "I’ll open a porn site and most of the videos have step mom, step daughter, dad,\nand other in the title. Sometimes I get horny looking at the trailers and then I\nrealize they’re supposedly brother and sister and it turns me off, because that\nmakes me think of sex with my family and it grosses me out…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rd9tze/does_your_penis_fold_inside_of_pantsunderwear.json": "like when it’s too big to just be straight, does it fold in half like a\ndrawbridge?? where does it go?? what does it do?? so many questions from a\nvagina owner",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rda84l/why_do_guys_like_drawing_a_penis_on_everything.json": "I had lent a couple of my old books to a guy, who ended up sharing those books\nwith the rest of his group.\n\nToday, when he returned those books, all I see are dicks on each page.\n\nMy question is, why do guys feel the urge to draw dicks on everything?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rdf9eh/days_where_you_just_dont_work.json": "I think I'm a pretty productive human but sometimes I have days where I just\ncannot bring myself to do any work (like, for my job). I'll putt around, click\nthrough emails, make a to do list but generally just don't do anything. This\nhappens like once every two weeks. I feel like I'm taking…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rdndkf/should_an_airline_passenger_who_is_too_large_to.json": "It should be common sense, right?\n\n * If the airline isn't booked and there's plenty of room, I would think not.\n * If the airline is booked and he only paid for one seat, then there isn't\n   going to be room for him on the plane without someone else leaving, and so he\n   won't be able to depart,…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rdnyu5/do_guys_really_care_about_how_a_girls_vagina_looks.json": "They come in all shapes and sizes but I feel like society has made it known that\nif its not tight and tucked in and pretty pink or some crap, then its ugly. Does\nit actually matter?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rdpzfj/do_you_take_your_balls_out_of_your_pants_when_you.json": "My husband said he does, but I simply cannot fathom this being a common\nhappenstance.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rdw4nk/what_are_gypsies_and_why_are_they_so_hated_among.json": "Are they from a specific region? Are they a religious group or ideology? I'm\nalways perplexed hearing them mentioned.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rdwxyu/girl_sounds_too_young_woman_sounds_too_old_lady.json": "And I'm not saying that people in their 40+ are old either",
  "data/reddit-ask/r/TooAfraidToAsk/comments/re2dej/im_a_20_yo_male_and_i_am_just_starting_to_date.json": "I'm a 20 y/o male, and i am just starting to date for the first time.. like\never.. and i am wondering, what's the normal acceptable age gap in dating for a\nperson my age? Both up and down?? Please give me some tips on this..",
  "data/reddit-ask/r/TooAfraidToAsk/comments/recc96/is_rfemaledatingstrategy_satire.json": "No disrespect, at all, just a legit question. Are they being serious with the\nposts?\n\nI saw something posted on another sub making fun of the FDS sub and have now\nbeen there reading for a bit. I laughed pretty good at the top 2 or 3 posts,\nthen my wife came over to see what I had been giggling at.…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/redbmg/why_arent_emojis_used_on_reddit.json": "I like to use emojis sometimes and I was wondering why they are looked down on\nsometimes on reddit.\n\n\n\nEdit: Sorrry if I was annoying but didn't know other people felt the same way 😎",
  "data/reddit-ask/r/TooAfraidToAsk/comments/reeyk6/why_do_people_care_about_leaves_in_their_yard.json": "Basically what the title says. Why do people care so much about leaves in their\nyard? I don’t get it. Why would people waste their time and money on this?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rej155/im_an_atheist_and_i_started_to_read_the_bible_out.json": "Please, if you are here to spew hate and not have a civilized discussion don't\neven comment. This goes for both atheist and theists, we can coexist. Now, I am\nnot trying to convert but I always wanted to read the bible to see what it was\nabout. But some of the things I've read have been honestly…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rep38s/i_found_out_as_i_am_a_boring_person_have_not_a.json": "basically the title, just feels sad and dead inside due to it. Everyone here\nasking smart questions to each other and I feel like I am just dumb or an empty\nperson. Sorry for the sad direction of the question",
  "data/reddit-ask/r/TooAfraidToAsk/comments/reqclq/is_it_common_for_adults_to_have_no_friends.json": "I had a friendship group in school, but after going to different universities we\nall grew apart. At university I only made one really good friend who I keep in\ncontact with over social media, although she lives a long way away now.\n\nCurrently, I have an amazing fiancé and a great job, however all…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rer2ys/do_other_people_sometimes_have_extremely_romantic.json": "This probably sounds like an oddly specific question, but this happens to me\nsometimes. I’m a 25-year-old male, if that really matters, in the dreams can be\nabout pretty much any girl that I know or am even somewhat aware of. Does this\nhappen to anyone else?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/reuxqb/to_all_the_guys_how_do_you_react_when_a_girl.json": "I recently had a conversation about this with one of my girl friends. She\ninsisted that, as a girl, you should never, ever, go ahead and admit to a guy\nthat you like him, because the minute you show yourself too eager, he will back\naway. That this is some sort of reverse psychology backed up by…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rewhqf/is_it_just_me_or_do_people_not_ask_themselves_why.json": "In no way am I claiming that I do not do this at times too, but I've noticed\nthat a lot of people just make claims without explaining the reasoning behind\nthem. They don't say why they believe certain things to be correct, they don't\nlike being questioned in general. Discussing things with them…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rewolp/is_there_anything_people_in_the_usa_are_not.json": "I could list a long rant but honestly\n\nIt seems like there's nothing left people in the USA aren't desensitized to\n\nMass shooting, school shootings, political instability, company theatrics and\nbs, protests just another day\n\nSeems the only shock left people would have left that have yet to…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/reyta4/my_friends_husband_came_onto_me_as_soon_as_she.json": "A woman I'm friends with, and have been helping recently with her career\nprogression, went away to go see her parents earlier this week as they were ill.\nHer husband contacted me the day she left, saying that she left some paperwork\nfor me to look over at her house and I should come collect it.\n\nAs…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rf67li/why_is_it_such_a_big_deal_to_not_want_to_date.json": "i 100% support trans people and treat them just like normal people but when it\ncomes to who i’m attracted to, i can just not see myself dating a trans man. the\nfact that he is female just turns me off from the whole thing, and it’s not even\nsomething i can control.\n\nmaybe it’s just how females…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rf909g/who_owns_the_ducks_at_the_park.json": "Like, let’s say that I see a duck, it gets friendly, and want to take it home\nwith me. Am I committing a crime by picking up this duck? Who does it belong to?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rf9hml/there_are_actually_just_2_genders_right.json": "Like there’s male and female (trans people switch to either one) and then\nthere’s gender fluid which is basically in the middle/switching depending on\nyour mood or something. I really don’t know, not trying to come off as ignorant\nor anything I genuinely do not know",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rfgowf/getting_vaccinated_today.json": "I'm getting the Pfizer vaccine today, and my mother is freaking our on me saying\nI'm going to die, and that I'll get severe heart problems etc. I know theres a\nchance that can happen, but nowhere online can I find an actual percentage on\nthe chances of vaccine complications, does anyone have the…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rftojh/are_most_americans_unaware_that_by_definition.json": "I have noticed alot of people online using the words interchangeably.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rg01kh/do_people_really_view_christians_so_poorly_and_why.json": "This is something I am kinda only realizing now. I guess I ignored it and don't\ntell people I am christian, but I, a roman catholic always try to be as good a\nperson as I can be. I try to be nice to everyone else and I try to make sure\neveryone else is happy. And I can say the same for the other…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rg1p6g/suggestion_for_mods_not_question_can_we_please.json": "This would help for so many reasons;\n\nIt would help the reader and answerer to understand the context and grounding\nfrom which the question is asked\n\nIt would help the asker pinpoint what they're actually scared of, and may not\nfeel the need to be scared or ask the question anymore\n\nIt would help…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rg1uwg/is_it_okay_if_i_masturbate_4_times_a_day.json": "Title",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rg20zo/should_i_hire_an_escort.json": "I (34m) have been devastatingly single for at least a decade. My last girlfriend\nand real relationship was when I was 22 with only about half a dozen random\nflings thrown in here and there since. I’m an introvert for sure but I have\nlearned how to be sociable and am very comfortable being…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rg66lt/isnt_categorizing_races_into_people_of_color_and.json": "First of all I accept all races, and judge people by their personality.\n\nI've been thinking a lot about the expression \"People of color\", and I think\nit's a weird expression. I have a few thoughts about it.\n\n 1. It's basically a mild form of racial segregation, separating white people\n    from all…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rgc389/why_does_the_us_goverment_and_its_laws_seem_to.json": "I'm not American myself, but in this year through Covid i've noticed that a lot\nof discourse in US laws, restrictions, movements and what not always take a hit\nby religion, specially christianity.\n\nA huge amount of americans heavily believe that the United States were founded\non christianity when…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rgdfdj/why_are_people_surprised_that_joe_biden_is_not.json": "I think pretty much every single president, Democrat and republican, have lied\nduring their campaign in order to be elected.\n\nWhy all the surprise over Joe Biden? Lol\n\nEvery presidents lies in order to get elected in my opinion.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rgev3f/why_does_is_seem_that_companies_in_america_hate.json": "Like it tends to be pretty standard practice everywhere else, why is it such a\nbig deal?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rghx8i/do_guys_like_their_butt_grabbed.json": "Like when you’re making out with someone or doin the deed? I feel like most\nwomen enjoy it, but I’ve never heard from a dude if he likes it or not so I\nhaven’t been brave enough to do it lmaooo",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rgibny/does_sex_end_if_the_woman_orgasms_first.json": "Only had sex three times and it's been with a sex worker each time. Basically\nthe penetration part has always been over once she orgasms and the overall\nexperience ends with a blow/hand job. Just wondering if that's how it usually\ngoes..\n\n***I understand consent...of course if she doesn't want to…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rgp1mq/what_do_i_bring_to_meet_my_boyfriends_family_when.json": "I’m white, my boyfriend is Mexican and he’s bringing me to meet his entire\nfamily this weekend. I mentioned how I’d like to bring his mom a bottle of wine\nor flowers as a gesture of thank you for having me and he laughed. He said in\nhis culture you don’t do that and not to worry about it. That is…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rgrss7/why_the_hell_is_weed_still_controversial_and.json": "Preface: I don’t smoke weed. Objectively speaking, alcohol and cigarettes are\ndeadlier and cause more health and medical issues when compared to weed. Both\nare more addictive. Detoxing from alcohol abuse can be deadly. Cigarettes can\ncause cancer. But weed is the thing we want to keep illegal? Weed…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rgusnt/why_are_people_so_afraidreluctant_to_share_their.json": "A coworker just said \"oh, sorry, that's an old family recipe\" after I asked her\nfor a recipe to a vegetarian dish. Why not share the joy? I would gladly give\naway any recipe if people asked me for it.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rgx7hk/when_talking_about_the_spread_of_misinformation.json": "the above text. my state is implementing new covid19 guidelines due to concerns\naround omicron, but when I try to read the LA times or NY times, vital\ninformation is paywalled. The articles provided on some topics have a variety of\nuseful links grouped together for anyone trying to learn more about…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rgxtky/how_do_you_reconcile_the_two_facts_that_on_the.json": "Everyone precives themselves as the center of everything - not from an ego\nstandpoint, but from a perception one. In fact it's practically impossible to\nprove that anyone else actually exists.\n\nOn the other hand, according to how far our research has come, we know that the\nuniverse is vast and…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rh0ame/why_should_student_loans_be_forgiven.json": "I’m a college graduate with loans I am repaying and I really don’t understand\nthe argument for this at all.\n\nWhen you take out loans for anything, you receive that money with the\nunderstanding that you will repay it with interest over however many years.\nThere is no ambiguity to this process and it…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rh0e26/why_the_fuck_are_the_media_calling_caroline_kayll.json": "More of a rant post but curious about people's thoughts - this story has put me\nin an overall wrathful state and it's hard not to think that perhaps within the\nnext 25 years, I may be telling a son of mine \"if ANY teacher of yours' is\ntrying to be more than that, get the hell away from them\":\n\nI'm…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rh23we/why_does_saudi_arabia_punish_the_victim_of_sexual.json": "I mean, it's not the victim's fault, so why should that happen?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rh7y13/do_people_actually_get_excited_about_pictures_of.json": "I'm a child-free woman (mid-30's) so my viewpoint might be skewed. Whenever a\nco-worker shows me pics or movies of their baby, I always go \"awww!\" because I\nknow that's the reaction they want. In reality, I don't give two shits about\nthat baby and most babies aren't even that cute to me. I love my…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rh8vas/what_have_i_missed_after_waking_from_a_coma.json": "Okay so around 6 months ago I woke from a year long diabetic coma ( type 1) and\nmy friends recommended Reddit to help me catch up but I’m finding it rlly hard…\nput in the comments things that I should look into and investigate. What must I\nknow? What important things happened in the last year and a…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rha6nw/why_is_the_black_community_so_intolerant_of.json": "It feels like the black community has an idea of what it is to be black and if\nyou don’t meet a benchmark, your skin color is somehow invalid.\n\nI say this as a black person that I see this monolithic attitude all the time on\nsocial media pages when it comes to having certain hobbies, a way of…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rhiv67/so_many_men_love_eating_pussy_with_no_expectation.json": "New to Reddit and a woman. Why am I so shocked to see man after man post about\nwanting to eat endless amounts of pussy without needing anything in return? I\nlove it, but I am shocked.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rholxz/why_is_my_father_always_cranky_when_he_comes_home.json": "He's a good guy when chill but when he comes home from work he becomes mildly\nverbally abusive and very authoritative. It's annoying since he's always\nshouting.\n\nWe live in the outskirts somewhere here in the Philippines. His position is just\nlike a COO but he doesn't have a proper name for his…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rhpt3i/how_do_i_tell_a_man_im_about_to_sleep_with_that_i.json": "I have had trouble in the past telling men to stop when they’re about to have\nsex with me and to put a condom on. I always feel terrible and can’t get the\ncourage.\n\nSo tonight, for example, I just got back from a date, he was nice and we got\nalong. Things got physical and despite my knowing he was…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rhpwmv/women_with_cardi_b_like_nails_how_do_you_wipe.json": "I can't imagine anyone not cutting up thier little pucker hole with those sharp\nlong nails when they wipe. Is there an \"ice cream scoop\" thing happening here?\nAlso, how do you keep them clean and sanitary at all times? Are people afraid to\neat your cooking? I mean there is so much real estate for…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rhqsij/its_been_almost_2_years_that_weve_been_living_w.json": "FYI: you get covid through the nose so all you're really doing is protecting\nother people from you (thanks!) but you're getting no personal protection. Why\nis covering your nose so difficult?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ri1vfm/help_do_i_tell_a_woman_i_have_a_smaller_member.json": "I'm new here and I see similar things Im asking you guys and girls how do I tell\na girl or even gain confidence with a smaller than avg member downstairs and\nwhen would be a good time to do it, I'm currently 21 and always feel super\nlonely I don't go out much cause of COVID in my place and I'm just…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ri360q/what_does_ejaculation_feel_like_with_vasectomy.json": "How does an ejaculation actually feel like if you have done Vasectomy before and\nall went 100% perfectly fine (no fail). What happens to the semen while having\nan orgasm? How does it feel and how does it work exactly? Do you still feel the\nsame as before making the surgery? Does it feel weird or…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ricni7/how_to_not_get_blood_everywhere.json": "im on my period, i use the biggest pads and they get full quick and it\noftentimes stains everywhere. what the hell do i do there's not bigger pads D:",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rieku5/am_i_an_alcoholic.json": "F21, I would joke with my colleagues that I was until I realized I would be\ndrinking every day. I got even more concerned when I’d start drinking when I was\nalone/sad. I’ve blacked out numerous times this year and ended up in the\nhospital for one instance. It’s interfered with my academic needs and…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/riiw0k/why_is_it_okay_for_black_people_to_make_fun_of.json": "Please don't attack me for this y’all",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rijvjq/am_i_an_incel.json": "I have spent the majority of my young teen and adult years basically incapable\nof having any sort of emotional or sexual relationship w a woman. It’s not like\nI’m angry about, def a little downtrodden but not like angry at her or the\nworld. I got rejected again today after one of my classes which…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/riswy6/is_it_unusual_for_an_adult_to_have_no_desire_to.json": "Hi, I'll make this short. I work full time in health care and interact with\npatients constantly, see my spouse every day at home. When I'm not at work, I'm\nat home- it's either work or home and I will actively make excuses not to leave\nthe house unless I really need to. I've never been diagnosed…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/riu2gb/is_you_guys_considered_offensive_nowadays.json": "I recently got an alert from work saying the term \"you guys\" is inherently\ngendered and other terms should be used. (It was addressed to everyone, not just\nme.)\n\nI like being gender inclusive, but I'm also in my 30s, so I've been saying \"you\nguys\" since forever. I've never once meant it as \"you…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/riv9nu/im_new_to_reddit_why_is_that_considered_bad.json": "I recently joined Reddit. Someone commented that I only joined 12 days ago. It\nseemed like they were trying to dismiss my comment by saying that. Why?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rixl3q/is_it_ok_to_cut_friendships_that_dont_bring_you.json": "I have this group of friends where we meet once every year. Other than the\nyearly meet up, we don’t really talk to each other. I don’t really share my\npersonal matters with them either.. Simply to say, I’m not happy when I hang out\nwith them.\n\nI left the group chat, but they added me back in, and…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rj4461/do_i_really_need_to_care_about_lgbtq_please_read.json": "I support everyone regardless of what they are. I only judge people based on\ntheir actions.\n\nI don't care to learn about the 90 flags and the 227 genders they have. I just\nwant to accept them as human beings.\n\nBut these days I feel like that isn't even enough anymore.\n\nMaybe this post might come…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rj688u/does_it_look_like_im_staring_at_your_chest_even.json": "I'm a taller guy at around 6 ft 4. The world is not efficiently built for taller\npeople so I naturally am looking at an angle downwards to see what in doing.\nIssue is any average height breasted person in my town has there chest\ninconveniently located right where my resting point of my eyes are. I…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rj894c/why_do_people_hate_jeff_bezos_but_love_elon_musk.json": "two reasons that I always find is\n\n 1. taxes.. but so does every other billionare\n 2. harsh treatment of workers.. so does elon\n\nso is there any GENUINE reason why one is hated and the other is loved?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rjkrvj/do_i_need_to_shave_my_vagina.json": "I (18F) never have before. And honestly I’ve never given it much thought before.\nBefore I have sex with a guy is it better to shave?? I already know it’s not\nnecessary but is it better? Or expected?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rjodkh/whats_with_all_the_antiamerican_sentiment_on.json": "Here is an example of what I mean:\n\nA couple of days ago there was a post on the front page of Reddit titles “People\nleave space in the middle during traffic on the Autobahn so emergency vehicles\ncan get through directly.” As the title suggests, it’s of a lot of cars in\ntraffic making room for an…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rjrsdz/music_changing_speeds_at_certain_times_of_day.json": "I've noticed that when I listen to music at night it seems to \"speed up\"\nsomehow. It feels like the tempo is off and it goes by so much faster than from\nwhat I hear during the day. I haven't seen anyone talk about this ever, but it's\nbeen bugging me for the past year or so. Is there an explanation…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rjry7r/why_is_it_that_even_now_people_still_wear_their.json": "2-ish years into a pandemic, you’d think people have figured out how to properly\nwear a mask. I’m trying to figure out if it’s silent protest/defiance, some type\nof need to control, stupidity, poor mask fit, or genuine user error. Why wear\nthe mask at all then?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rjsge6/do_people_paralyzed_waist_down_still_get_hard.json": "I really don’t know why I’m so confused but I am",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rjstwc/why_the_us_have_school_shooting_and_the_middle.json": "I grew up in the middle east where there's no gun control at all. But I've never\nin my life heard a story of an active shooter at a school. Why does it happen in\nthe US?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rjw8q0/why_are_women_and_children_highlighted_in_the_sad.json": "Watching the news where immigrants die crossing from France to Britain. The news\npresenter said ‘x’ amount of people died including ‘x’ amount of women and\nchildren. I can get to grips with the children getting highlighted as they are\npretty much defenceless but why women aswell? Obviously I…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rjz3ne/should_i_move_on_or_ask_to_be_official.json": "There’s this guy i’ve been seeing for about 5 months now. We act like boyfriend\nand girlfriend by going on dates, having sex, talking every day, being there for\neach other at our worst moments. He tells me he doesn’t want a relationship rn\nbc his job. His job he’s constantly on call for. Sometimes…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rjzbw0/whats_an_alternative_to_ass.json": "let's say you want to reprimand your kid and you don't wanna say \"I'll teach\nyour spoiled ___ a lesson\" what else can you use as an alternative?\n\nGUYS FFS I DONT HAVE NOR INTEND TO USE THIS ON A CHILD",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rk2q4t/why_do_people_wear_a_mask_while_driving_in_their.json": "I'm sure you've seen it. People driving around (alone) wearing a face mask. Why\nis this?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rk7jju/i_am_the_most_undisciplined_person_i_dont_brush.json": "\"Today is the last day I be this way.\" I tell myself every single day. I watched\nhundreds of videos on how to fix myself, for years now. I even got to a decent\nlevel of weight before the pandemic hit and put me back to where I was. Now I'm\njust stuck. How do people do it?\n\nHow do you always sleep…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rke8xb/how_is_half_the_stuff_here_too_afraid_to_ask_half.json": "This was pretty cool when I joined. Now it’s just people asking ransom questions\nthat are very common. Am I right? Am I wrong? What do you guys think?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rkiilk/is_it_weird_if_my_ex_still_has_my_nudes_in_his.json": "So I reconnected with an ex (we’ve been apart for like 8-9 months) come to find\nout that he never got rid of folder/ album with my nudes (also regular pictures)\nthat I’ve sent him while we were in a relationship. Is that weird?\n\nEdit: My ex and I agreed to deleting nudes when our relationship…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rkjsgn/can_we_stop_pretending_like_finding_friends_is.json": "I moved to another country around 3-4 years ago, and since then I didn't manage\nto find any real friends. I am very communicative, I do well with colleagues, I\nhang out with my tennis club, and film club from time to time. But I have not\nmet people who I would be inherently interested in being…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rkkr9l/friends_son_is_being_sexually_suggestive_what_do.json": "I recently moved back to my hometown and got back in contact with an old friend\nof mine who still lives there. We helped each other out a lot over the last year\nand they kind of became a second family for me.\n\nShe’s a single mom with two kids, the one of concern being 13. Over the past few\nmonths…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rkl4jo/why_do_i_26f_stop_liking_people_when_they_like_me.json": "I had an intense crush on my best friend for long and now that he likes me back,\nI still like him but I don’t feel that intense anymore.\n\nI feel that something psychologically is deeply wrong with me. Because I see\nthem lame for liking me (FYI I’m not having the best self image)",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rkqxir/is_everyone_else_just_exhausted_by_covid_afraid.json": "Let me preface this by saying I’m 100% vaccinated and I’m getting the booster\nvery soon so I’m not just posting this stir anything up.\n\nIm visiting family a few states over from mine and recently found out that a few\nof my close friends have tested positive. I’m vaccinated so it didn’t really\nworry…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rkspoh/my_girlfriend_was_raped_how_do_we_move_on.json": "I was across the country on work travel when my girlfriend (Jane Doe) decided to\ngo out to dinner with a few of her friends. When she arrived, she noticed her ex\nboyfriend (John Doe) was also invited and had shown up. John proceeded to get\nincredibly drunk and was unable to drive home. Jane wanted…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rkszat/at_this_rate_isnt_covid_now_endemic_worldwide.json": "I’d like to preface this by saying I am fully vaxxed + booster and I wear my\nmask out in public everywhere, and I encouraged my hesitant parents to get the\nvaccine, etc. I want people to make safe choices for them and everyone around\nthem.\n\nBut its been two years now and 2022 will just be the same.…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rkzwv0/is_everyone_else_just_exausted.json": "Is everyone else have that feeling that they are tired al the time, not juzt\nphysically but also mentally?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rl4gg6/how_did_you_wish_your_parents_handled_you_having.json": "Look, I’m a dad. I get it. I was a very promiscuous teen. In fact, I had a child\nat 17. Welp, that child is now active.\n\nOnly difference here is that I didn’t have parents. No one to guide me. I needed\nto find people to love me.\n\nShe has (what I’d like to think) very loving and understanding…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rl4lsz/is_it_ok_to_spend_your_21st_birthday_with_your.json": "my birthday's in March. I live in Miami so my mom offered to drive me and my dad\ndown to key west and have my first experience at a bar w/ them there. I don't\nhave any friends that live down here they all moved for university in other\nstates so I really have no one to spend it with. But is it too…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rlf6t0/whats_wrong_with_legalizing_prostitution.json": "Legalizing prostitution will greatly undermine human trafficking and forced\nprostitution since it’s under the protection of law and state , it will lower\nthe number of sexual offenders since they can get what they want for a good\nprice and it will help some people to make money. So my question…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rlfjo8/enforcing_vegan_food_in_the_work_place.json": "Preface this, I just started a new job. I’m 20 and I’m in the UK, now anyways\n\nStarted working at this place and we’ve been told to not eat ANY food that isn’t\nvegan, in the middle of winter. I’m not a vegan and also not interested in\nbecoming vegan it feels like this is wrong? Apparently it’s a…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rlgl8x/when_my_puppy_does_his_business_it_always_snips.json": "Is this some conspiracy by Big TeePee? I’ve never seen a giraffe with a dirty\narse. Make of that, what you will.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rlj0ya/do_people_actually_feel_ashameddisgusted_after.json": "I've seen this mentioned many times, how people feel ashamed or disgusted after\nthey masturbate. But why? Is it the type of porn or just the act itself? Is it\neverytime? Personally I feel relaxed or indifferent afterwards.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rlolop/how_do_you_find_porn_on_reddit_is_there_like_a.json": "There’s so much specificity in the subs but I always just stumble upon stuff.\n\nIt took me so long to work up the courage to ask this please clap for my\nCatholic ass",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rlpx0w/why_is_dating_a_coworker_considered_a_bad_idea.json": "I understand that it would be awkward if things go bad but where else am I\nsupposed to meet people. If it is bad, is college the last stop to find a date/\nmake friends/ socialize/ etc? Edit: english is not my first language sorry for\nbad wording and grammar",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rm3a7r/how_are_people_confident_with_strangers_and_able.json": "I'm a pretty awkward and shy person when I'm not comfortable or around new\npeople. I don't have a heap of self confidence even though I'm fine around\npeople once I've met them enough or am included in a conversation. Just\nwondering how people have overcome this or made it less awkward?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rm3jdi/im_f_23_envious_of_women_who_have_big_breasts_how.json": "i honestly need help/advice with this. i’m average looking, and i’m a cup size\na. i hate how i feel about being envious of women who have big boobs, like, i\nknow it’s all about being palatable to the male gaze (and i HATE whetting the\npalate of the male gaze) but i rly rly rly can’t help but feel…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rm7fzb/muslim_sex.json": "Ok please don't come for me bc I'm asking this. I come from a region where\nthere's basically not a single Muslim in sight. As I've started traveling I'm\nseeing a ton in Europe and this question just popped in my head. I've seen what\nI would consider to be very modern Muslim (even if wearing a…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rmgl5r/why_are_there_still_many_people_antivax.json": "At this point, I just think of it like elementary school. We are all stuck in\nclass because some students are misbehaving. We can't leave the classroom until\neveryone is quiet. Unfortunately, we still have those people in class.\n\nIn all seriousness, I want to know what kind of mindset those guys…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rmi7mh/a_lot_of_places_are_short_on_staff_what_are_those.json": "I remember 10 years ago, getting a job at a grocery store / restaurant was super\ncompetitive. Now I see help wanted signs everywhere.\n\nIf there is a large portion of people now refusing to do these shitty jobs, what\nis that portion of people doing to get money?\n\nI have strong doubts that they all…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rmirgu/as_a_white_dude_if_im_doing_karaoke_rap_and.json": "It’s the only word I can think of that rhymes well enough and still fits; cracka\nhas too hard of an emphasis on the wrong syllables, but brotha fits perfectly.\n\nTrying to be politically correct while still keeping it real to the vibe of\nBiggie, is this an alright substitute?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rmixwe/is_everyone_giving_up.json": "I’ve seen so many posts about how bad this year was and how 2022 will be shitty\ntoo, it’s kinda depressing. Are people starting to just give up on life?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rmobgz/i_talked_to_someone_who_considers_them_self_an.json": "My friend introduced me to her step brother who was pretty vile. He asked me if\nI had a boyfriend and I do have a boyfriend. He accused me of making it up and I\ntold him I’ve been with the guy for years. He then goes on how he can’t get a\ngirlfriend because he’s 5’5, balding and overweight. I felt…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rmqfko/how_can_you_be_ok_with_being_in_a_polyamorous.json": "Genuinely asking as honestly I just can't wrap my head around how that works",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rmuqbf/would_you_consider_this_weird.json": "For reference, I am a 23 year old male. I will sometimes say things like \"thank\nyou sweetheart\" or \"thanks doll\" and such to female staff at a checkout line,\ngas station, etc... I never put much thought into it until I was with my friend\nthe other day and he told me I was weird for saying that…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rmy3ll/anyone_brush_their_teeth_only_once_a_day_or_none.json": "I'm 24 and still struggle to brush my teeth twice a day. It's just a difficult\nhabit for me to get into. I assume it's because of my living environment but I\njust wondered if anyone else's struggles with it too as an adult.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rn0gbq/do_girls_really_find_dad_bods_attractive.json": "I personally do not have a dad bod, but I know plenty of dads & non dads who do.\nI can’t say they have girls crawling all over them but I see online people\nsaying how much they love dad bods. I have nothing against them because I’m no\nfitness guru & I think you should be comfortable with however…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rn11zb/is_there_a_verb_for_performing_oral_on_a_woman.json": "When you give a man a blowjob, you can say you blew him or will blow him. But is\nthere a similar way of saying this if you perform cunnilingus on a girl? You\ncould say you'd eat her out, but is there a shorter way of saying it?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rn4u22/is_it_really_that_bad_if_i_prefer_phisical_dumb.json": "For some reason I became much happier person after having lets say \"honest days\nwork\" than trying to prove that I can do office work/editing (despite having\nbachelors on it)",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rn67zh/is_it_just_me_when_i_say_it_actually_doesnt_feel.json": "I know people say this EVERY year so I don’t want to ask this question. But\ngenuinely Christmas is in 3 days and it still feels like November. This isn’t\nnormal and I have never felt this way. I always get a bit “festive” in December\nbut I don’t feel any different. The christmas tree in my living…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rn7qpy/i_seem_to_almost_exclusively_attract_and_am.json": "It’s not that I’m particularly attracted to women that have mental health\nissues, but it seems that my “type”, which I guess I could vaguely describe as\nalternative, is more likely to have mental health issues and problems with\nhousing security.\n\nFor example, of the last 5 people I’ve slept with, 2…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rnl99p/when_in_the_toilet_do_any_of_you_suffer_with_the.json": "Whenever I use the toilet, I always fear that I haven't locked the door. Even\nafter locking it , I sometimes feel I haven't locked it properly and have to\ncheck again. Most times I don't use the toilet till I check at least two times.\nIt's very strange anyone else have this ?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rnn19b/is_it_rude_to_think_my_friend_is_overreacting.json": "My friend (18) had a miscarriage about two weeks ago. I lost my baby in a car\naccident on 11/08/2021. She has been comparing our situations and saying she\nunderstands what I’m going through now and it’s really hitting a nerve. Am I a\njerk for saying that? My heart and soul is gone. I gave birth to…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rnoot3/is_it_bad_to_think_things_shouldnt_be_cancelled.json": "It genuinely doesn’t make sense to me that events in places like NYC are being\ncancelled where you need to be vaccinated to go. Isn’t the whole entire point of\ngetting vaccinated to be able to live a little bit more normally after 2 years\nof being safe?\n\nThe Strokes concert on New Year’s Eve was…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rnpvi4/is_it_wrong_of_me_to_feel_bad.json": "My girlfriend of 2.5 years just posted a year end reel on instagram and I am not\neven on a single photo and all her friends and everyone are.\n\nWhile she was making the reel i did jokingly on call say i hope I'm there and\nshe said yeah ofc and now i don't know if it's wrong to feel bad.\n\nI haven't…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rnudfp/does_anyone_ever_get_so_uncomfortable_pooping.json": "Currently experiencing this right now. Bonus points if it lasts for more than 20\nminutes and you feel like throwing up at the same time 🤙🏼\n\nHappy holidays!",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rnwri0/how_are_girls_supposed_to_act_when_they_orgasm.json": "I like moaning a lot during sex, but this guy I was hooking up with told me that\ngirls shouldn’t be that vocal because then how is he supposed to know when he’s\ndoing something that feels good if I’m already making noise. He also said I\nseemed like I was overreacting/being dramatic when I came.…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rnynyl/is_it_just_normal_in_your_mid_20s_to_feel_alone.json": "I’m genuinely curious if this stage of life is just kinda like that for everyone\nor if I’m in the minority not having the time of my life in their 20s",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ro20lb/hello_white_americans_where_are_you_reallyyy_from.json": "Okay I know that sounds weird but here me out.\n\nI've recently studied that white americans are descendants of european\nimmigrants back in the day, who came to the New World to start a new life.\nHence..white Americans really do have Europeans roots.\n\nWhich country in Europe are you or your ancestors…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ro6u63/my_inner_thighs_and_the_vagina_are_much_darker.json": "Does this need to be fixed and if yes, how? I don’t have much sexual experience\nso that didn’t help either. And now that im single again idk if this is\nsomething that’s gonna turn off the guy I’m seeing.\n\nEdit: Thank you everyone who commented and reassured me it’s completely normal,\nI feel so much…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ro88v3/how_do_i_know_if_my_partner_will_cheat_on_me_or.json": "There are lot of people who fall in love and then later in between they might\nmeet someone and they do it. Even when they are in love with someone they do it\nfor the thrill. How will we know? Is there a solution for this problem?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ro9vw8/29f_struggling_any_other.json": "Please, dont throw things at me for what I am about to say (or write). I am a\nmother of a 3 years old little man. He is perfect, intelligent, beautiful... But\nI hate being a mother. I hate it so much I dont even know what to do next. I\nwish I never had him, but I love him also.\n\nIs there other…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rod7u0/does_it_just_not_feel_like_its_christmas.json": "With the whole pandemic happening, it feels like I lost a year and a half, kinda\nlike the Blip. And I know it’s Christmas right now, I just don’t feel the usual\nbuzz in the air. Anyone else share this feeling?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rohllo/my_wife_asked_me_if_i_honestly_thought_her.json": "We went to a dinner for a wedding and her friends were there. We greeted them\nand I said \"wow aren't you ladies all spiffied up\" but in a friendly way.\n\nMy wife agreed and told them they looked amazing. When we went to take our\nseats. She asked me if they looked better than her and I said no…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rop8ma/is_it_ok_that_i_really_dislike_my_brother.json": "My brother is 13 and autistic. I usually avoid saying that because he and my mom\nuse it as a scape goat for his behaviour.\n\nHe is actually a manipulative spoilt brat and I cannot stand being around him. I\ncame home for the Christmas holidays and ended up staying because I landed temp\nwork nearby…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rorh7b/is_it_bad_that_i_downvote_antivaxxers.json": "No matter what they say, the moment they start a comment with “I’m an\nanti-vaxxer”, I hit the downvote button. Sometimes it’s not explicitly stated,\nall they say is “I didn’t get vaccinated and I’m fine”.\n\nI generally consider myself open-minded and willing to listen to all opinions\nand not judge…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rowuyj/do_you_become_a_lurker_when_opinions_on_thread.json": "I’ve been on Reddit long enough to know that having an opposite opinion to the\ngroup is a sure way to get lots of notifications that I’m wrong and being\ndownvoted. Even when the group opinion is just opinion and mine are facts. It’s\nbetter to just lurk out of curiosity than get chewed out…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/royrce/men_of_reddit_when_taking_a_shit_do_you_keep_your.json": "Edit: thanks for the laughs",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rp00kg/are_there_any_other_guys_like_me_who_like_to.json": "A lot of media portrays that only girls like sensual stuff with stories about\nhow a guy approaches her and courts her etc. Well, I like that too, not the\nstraight up wam bam thank you mam bullshit. As in, I loved the fifty shades\nseries. I mean, I would like to be such a guy who knows how to handle…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rp5yaa/how_common_is_it_for_men_to_stick_random_objects.json": "I'm having an arguement with a friend, don't want to explain how we got there\nbut this dude thinks my family and upbringing was prudish because I didn't stick\na fucking garden hose up my ass when I first started masturbating.\n\nI just want a general inquiry on this, that is all.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rpccvo/how_should_i_approach_the_fact_that_my_mom_49_and.json": "My mom went on a trip cross country. My younger brothers 22 and 17 are now under\nmy supervision. We tend to eat out but when I cook they complain. I spend a lot\nof money buying groceries for them and spend hours cooking. They tend to judge\nand make fun of the food. Either saying it’s not good or…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rpdcnv/are_rich_people_mentally_ill.json": "I always wondered if having more wealth than 99% of people is due to a mental\nillness. Are there any studies on this? My boss (who owns the company) recently\nbought a $200k Mercedes car but argues with us about using too much hot water in\nthe kitchen sink that might cost him $0.10 more a day . How…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rph91u/how_can_i_know_the_porn_i_watch_is_abusefree.json": "Hey everyone.\n\nSo I'm using a side account for this one. Also, trigger warning I guess.\n\nA couple of weeks ago I read a thread on r/greentext [/r/greentext] about the\nGirlsDoPorn case. What I found was some of the most despicable things I ever\nread. Rape, doxxing, suicide and lots of awful…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rphu1g/is_it_close_minded_not_wanting_to_date_a_person.json": "i think its not",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rpi6ip/are_most_boys_like_this.json": "I 16f have a boyfriend 16m. He was over at mine, and at night whenever we’re at\neach other’s house it’s basically routine at this point I’ll lay up next to him\nand he’ll play with my hair, or hold me.\n\nBut this time he asked if we could swap things about. When I was running my\nnails on his scalp…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rpmceb/what_am_i_supposed_to_do_when_a_woman_says_shes.json": "I know she’s gonna build this up and explode and idk what she wants me to do.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rpmmmp/why_did_christians_decide_to_choose_jesus_at_his.json": "That's like having your mom post the ugliest photos of you on her facebook for\nall of your friends and relatives to see",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rpor6s/if_you_have_sex_with_someone_who_tells_you_they.json": "I would think it makes sense because if you have intercourse with someone you\nthink is of legal age, it's not your fault if you later find out that's not\ntrue. Or?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rprob0/women_of_reddit_do_you_actually_like_getting_your.json": "I am a curious and horny teenage boy please don't attack me.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rpymhw/what_is_your_honest_opinion_on_pregnant_women.json": "Currently pregnant and heading to the beach next week at 7 months along; as I\nwas packing today, I realized I pulled all two-piece bikinis (no coverage on\nstomach whatsoever I.e. “tankinis”) and was genuinely curious if it bothers some\nindividuals seeing pregnant women wear them! It’s something…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rq6p98/how_can_i_anonymously_report_a_seemingly.json": "My parents sold their house about a year and a half ago to an older man and\nwoman. They seemed a little off but were enthusiastic about the house and didn’t\ntry to lowball us. So a few paper signings and boxes later the house is now in\ntheir name. Fast forward to now and I’m bored playing around…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rq6xi8/do_u_think_that_small_boobs_are_attractive_and.json": "I'm 20y and hate my boobs, they're small and it makes me feel REALLY insecure. I\ngrew up listening guys talking about big boobs, watching on TV, and stuff like\nthat. I feel like i'm not sexy enough because of this, and i need a opinion (Pls\nbe honest, but don't be mean)",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rq8ni7/i_have_this_constant_feeling_of_waiting_for.json": "I'm not quite sure how to explain it. It's not like I'm waiting for something\nbad or good. I just have this constant feeling that I'm waiting for something.\nLike my life doesn't feel complete. I'm not sitting around doing nothing. I'm\naccomplishing some goals and making progress with life, good…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rqfmb8/do_men_really_like_giving_oral_pleasure_to_women.json": "Or they just say that? And how was your expirience with partners who are not\ngood at it (for you at least). Did you tell them and how did they react? Did\nthey wanted to improve? For years i was thinking i just don't like oral sex but\nI'm starting to think that i just had a misfortune to stumble…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rqhhze/why_is_the_chinese_government_kind_of_getting_a.json": "So from what I can gather, they railroaded WHO from investigating. They also\ncensored information about the coronavirus, they appear to be censoring\ndata/presenting wonky timelines*, and of course, they let it spread over the\nglobe. These are facts.\n\nBut there seems to be no major open criticism of…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rqizfx/i_have_this_constant_urge_to_go_home_even_if_i_am.json": "i have no idea where this home is, or what it is but i long for it.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rqjw6v/how_do_you_prepare_to_sit_on_a_guys_face.json": "He really wants me too and I have no idea how to go about doing any of that??",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rqlhel/after_going_to_the_gym_for_years_intense_therapy.json": "I dunno, just putting feelers out there. I'm turning 30 and it kinda sucks I\nstill haven't dated. Not the end of the world, there's a lot of upsides. Just\nsome downsides that kinda become grating after a while. Women will come up and\ntalk to me in public, or message me on here, but always seem to…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rqo6v1/why_is_demisexual_apart_of_the_lgbt_community.json": "I genuinely don’t mean to offend anyone with this. but demisexuals seems more\nlike a dating preference to me. if you don’t have sex until you have an\nemotional connection, that’s fine. but you are having sex with a gender. like\nyou’re still straight (or gay or any sexuality) you still have a…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rqoeqc/why_is_it_that_euthanasia_is_highly_controversial.json": "I frequently hear the reasoning that you shouldn't let your pet suffer\nneedlessly at the end of its life, and in my experience the vast majority of\ndog/cat owners (in the appropriate situation of course) opt to put them down for\nthis reason. Makes enough sense, but shouldn't that logic hold even…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rqq6cw/why_is_everyone_so_focused_on_canceling_student.json": "Look, I’m naive. I only went to university for a year before dropping out to\npursue my own business. That was 10 years ago. I’m still paying off that one\nyear. But I guess I don’t understand why everyone wants current student debt\neliminated, yet I see no conversation about a bigger plan to prevent…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rqtx23/i_cant_be_the_only_guy_who_doesnt_like_blowjobs.json": "Have never enjoyed them, not my thing, feels like I’m indirectly degrading the\nperson giving. Totally not a chad, white knight or whatever as I can be a dick\nfrom time to time but with the ol’bj, that’s the fucking line man.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rqz4cz/how_do_guys_sit_down_with_balls.json": "There just there hanging like how do you sit down comfortably with them there??",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rr0vk4/how_many_times_a_month_does_your_partner_scream.json": "I know on some level there has to be a normal amount and a non-normal amount so\nI was curious...how many times a month would you say your partner screams/yells\nat you and do you find it normal or not?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rrbzmu/what_is_the_line_between_normal_fatherdaughter.json": "Sorry if the question is confusing. But I genuinely don’t know.\n\nETA: it’s my father and I’m the daughter, just to clarify.\n\nEdit 2: here is the list.\n\n1) smacks my ass repeatedly even after I told him to stop and that it made me\nuncomfortable\n\n2) Encouraged me to get a breast augmentation when I…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rrcjqe/why_do_we_have_such_awful_random_inner_thoughts.json": "Why does our inner dialogue sometimes come up with the most horrific passing\ninner thoughts? What possible evolutionary reason is there for that for me to be\nholding the dog that I love more than anything else have a passing thought of\nwhat it would be like to stab him? Or the person I love more…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rrf5qu/do_you_rehearse_conversations.json": "I paid attention to how many times in one day I go over conversations out loud\nto myself and... it's A LOT. I rehearse conversations I'm about to have, I re-do\nconversations I just had, I practice anecdotes, I will talk as though someone\nasked me a question and answer it. These aren't big or…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rrfdb8/is_it_acceptable_for_a_grown_adult_me_m_24_to.json": "He's my wife's sisters son and is the absolute fucking worst. Fake cries\nrandomly or tries to act cute to get attention, screams at and says horrible\nthings to his mother (dad left because of you), takes his little brothers toys\nand doesn't share his, and worst of all coughed in my face yesterday…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rrj4na/why_do_so_many_extroverts_take_introversion_as_a.json": "I feel like a lot of extroverts are personally offended by people who are shy or\nintroverted or just plain quiet. It's like they take your lack of social\ndynamism as a tacit implication that you don't like them or that you're\nrejecting them on some level. Even when you meet them halfway, it's like…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rrk1qk/do_men_shave_their_privates_even_when_they_dont.json": "Like is it a personal thing or do you only do it when you know someone’s going\nto see them?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rrkvcj/yall_ever_have_those_days_where_you_look_at_your.json": "Obviously Im sure it happens to people sometimes because we all have our\ninsecurities, but this shit is like a weekly occurrence for me at this point.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rrqwo9/do_you_ever_just_stare_at_nothing_for_what_feels.json": "Several times this year I have just stared at a tile while showering and thought\nabout losing 100 lbs. then gaining it back, getting married buying a house and\nthen getting divorced and being homeless for a year.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rrso8z/what_are_you_supposed_to_say_or_do_if_you.json": "Once when I was younger I (not kidding) ejaculated in under 50 seconds and my\npartner was like “what the hell?” and so to calm the tension I jokingly said\n“hey, your pussy just felt to good. And you know what? That’s on you.” Like what\nelse am I supposed to do if I finish too fast and she’s not at…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rrtzoh/should_i_feel_bad_about_saying_no_when_asked_to.json": "Hey everyone\n\nSo I started my first job at a major drug store three months ago. With the\nholidays being extremely busy for us I’ve had more hours than I normally would,\nand I would be asked a few times a week to come in extra days when someone else\ncalls out or they need extra help. I actually…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rrzwmu/why_are_some_people_okay_with_fat_acceptance_when.json": "First of all, I know that I should mind my own business, hence why I'm asking\nthis question here.\n\nDon't get me wrong, I'm not trying to body shame or fat shame anyone either. I'm\nall about body positivity; loving yourself is important and a lot of people are\nstruggling with that.\n\nWhat concerns me…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rs7xfb/why_cant_people_question_their_religion.json": "I don’t even mean as in questioning if they believe in it. I mean questioning it\nlike “why doesn’t the Bible talk about Jesus as a kid?” or “Could anything of\nbeen lost in translation?”\n\nWhy does it make other followers so angry? Wondering about things shouldn’t be\nseen as “oh they’re a non…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rs85bv/did_i_not_do_my_job_right_with_this_girl.json": "So I had sex with this girl and I came and when I asked her if she did she said\nshe didn’t. I had given it my all during foreplay and she really enjoyed it as\nshe very explicitly told me during. After I finished I went down on her again\nand when we were done I asked if she came. She said she didn’t…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rs94vc/my_fatherinlaw_keeps_telling_me_to_get_a_boob_job.json": "As the title says, my father in law has suggested twice now in a joking fashion\nthat I should get a boob job. He will then turn to my husband and say things\nlike \"Sorry, I tried to help you out but she won't go for it\". This man is not\nmy husband's father, just a guy his mom married who happens to…",
  "data/reddit-ask/r/TrueAskReddit/comments/r63hk5/what_is_something_that_someone_you_really_hate.json": "Its like the \"never meet your heros\" but reversed like \"when you meet face to\nface with your villains\" but find out they aren't as bad as you first thought.\neven if you don't change your opinion about them and still hate them for\nexample.\n\nlike for example lets say you have a super greedy boss…",
  "data/reddit-ask/r/TrueAskReddit/comments/r8c8ns/what_exactly_is_it_that_leads_someone_to_believe.json": "I can't really comprehend the motives for school shootings. I know that stricter\ngun laws would stop them, but there needs to be a person to use a gun to kill\npeople. So what is it that convinces the person that they should shoot up a\nschool?",
  "data/reddit-ask/r/TrueAskReddit/comments/ragvpz/has_peaceful_protest_lost_its_effectiveness_in.json": "I don't know if people outside of the area realize, but there is a \"March on\nWashington\" every week. (Especially when the weather is nice.) Large crowds can\nget a permit and stake out the Washington Monument or Lincoln Memorial, smaller\ngroups protest by the Capitol, White House, or some other such…",
  "data/reddit-ask/r/TrueAskReddit/comments/rfk378/do_you_think_the_worldwide_response_to_covid.json": "Or would we still be doing all this stuff anyways to mitigate... things? If this\nwere a business decision made with smart people, or with some game theory\ninvolved in the strategizing, there would be related costs and benefits\nassociated with doing something right? Have we assumed that by throwing…",
  "data/reddit-ask/r/TrueAskReddit/comments/rl8nu1/why_arent_there_alternatives_to_ice_cream_trucks.json": "Is there a law against this type of business where only Ice Cream trucks are\nallowed? The reason i'm asking is because I remember visiting my parents home\ncountry and almost every day a guy came driving down our neighborhood ringing\nhis bell, selling the most common fruits and vegetables, parking…",
  "data/reddit-ask/r/askphilosophy/comments/r7see7/why_do_more_philosophers_tend_to_be_socialist.json": "The new Philsurvey points to a belief in socialism over capitalism.",
  "data/reddit-ask/r/askphilosophy/comments/r8tcjv/why_is_philosphical_writing_so_difficult_to_read.json": "Background: I am NOT someone who regularly reads philosophical writings, but I'm\nlearning about it and I have many issues. My field of work is in military\nintelligence, and our primary goal is to make overly complex topics simplified\nfor the regular person to understand to make critical…",
  "data/reddit-ask/r/askphilosophy/comments/r9ysvb/if_we_emerged_into_existence_once_whose_to_say_we.json": "I think about consciences and existence a lot, but one prevailing question I\nhave is why do we assume (for the most part) we only get one life? And then\nafter death there’s eternal nothingness? There was nothingness for me for over\n13 billion years and yet suddenly here I am. So how do we know that…",
  "data/reddit-ask/r/askphilosophy/comments/rdvzzh/has_anyone_ever_got_to_a_certain_point_in_reading.json": "Is there a way to get out of this without completely giving up?",
  "data/reddit-ask/r/askphilosophy/comments/rf1dw4/what_is_poststructuralisms_gripe_with_linguistics.json": "This is hard post to write, because it's a huge topic. I'll try my best though.\n\nI studied linguistics in a college that was very concerned with empirical\nresearch, quantitative analysis, and that kind of thing. The department didn't\ncare much for philosophy of language; however, I am very…",
  "data/reddit-ask/r/askphilosophy/comments/rffsli/why_do_we_still_have_to_work_when_a_fraction_of.json": "This might be a really dumb question and might end up on r/badphilosophy\n[/r/badphilosophy], but honestly, I have no starting point here and very little\nstructure at hand to examine the topic at hand, so please allow me to share a\nfew snippets of where this question is coming from.\n\n * I saw a meme…",
  "data/reddit-ask/r/askphilosophy/comments/rg9p4m/are_there_any_procapitalist_philosophers_who_are.json": "It seems that most modern philosophers are overwhelmingly socialist, and the\nonly thing I can think of here is Ludwig Von mises, who is regarded more as an\neconomist then a philosopher",
  "data/reddit-ask/r/askphilosophy/comments/rjx19n/am_i_morally_responsible_if_someone_commits.json": "If someone tells me they're gonna commit suicide if I do something that's\ninconsequential to their decision and I still do it, does that make me morally\nresponsible for their death? I didn't have a hand in their decision but they did\nwarn me that there will be a consequence to my action.\n\nThis is…",
  "data/reddit-ask/r/askphilosophy/comments/rl9dnm/what_book_would_you_recommend_for_a_15_year_old.json": "I tried diving into the deep end and start with Soren Kierkegaard’s magnum opus;\nEither/or. But I found it to be to complex for me especially in the chapter\nwhere person A kept talking about Mozart and what makes a piece of work a\nclassic. Can you give me a less complex, but still a good philosophy…",
  "data/reddit-ask/r/askphilosophy/comments/rln8pa/is_there_a_phrase_for_peoples_tendency_to_ignore.json": "Not necessarily a Strawman argument, but where you're essentially having two\ndifferent (but similar) conversations. It's like people just assume you have\nsome hidden meaning or agenda, or something.\n\nLike, random example, but if I say \"I like pineapples\" and someone responds with\n\"You don't like…",
  "data/reddit-ask/r/askphilosophy/comments/rmgegd/why_was_the_boston_tea_party_justified_but_not.json": "It just seems hypocritical.",
  "data/reddit-ask/r/askphilosophy/comments/rmnhbv/how_do_i_protect_myself_from_misuse_of_philosophy.json": "I have only recently become aware of how philosophy ….can be a fascinating way\nto interpret EVERYTHING! (Thank you Wisecrack(I’m slightly embarrassed by that\nadmission))\n\nThere is a dark side though. Well. I think there is a dark side. I watched a you\ntube video this evening (Jordan Peterson: The…",
  "data/reddit-ask/r/askphilosophy/comments/rqupvb/why_is_transracialism_seen_as_less_authentic_than.json": "If race and gender are both social constructs, categories society puts us into\nbecause of the way we look rather than biological realities about us, then why\nshould one be seen as more authentic than the other? Many of those who claim\ntransracial identities undergo surgery to look more like the…",
  "data/reddit-ask/r/askscience/comments/r6ge22/is_weatheringerosion_of_rock_by_water_more_due_to.json": "I was reading this page:\nhttps://opengeology.org/textbook/5-weathering-erosion-and-sedimentary-rocks/\n\n\n\nAnd while they indicate here that \"chemical\" weathering is the primary\nmechanism, wouldn't \"mechanical\" be the most significant factor? As in,\nmoving/falling water would cause more weathering…",
  "data/reddit-ask/r/askscience/comments/r6hkxd/do_people_respond_to_acronyms_with_the_same_part.json": "ALSO: Provided they understand both the phrase and the acronym, will a person\nrespond to an acronym of a phrase and the actual phrase in the same way?\n\nI was texting my friend about how it's weird that people find it easier to talk\nabout the treatment of POWs over the treatment of prisoners of war.…",
  "data/reddit-ask/r/askscience/comments/r6l2zd/why_does_earth_rotate.json": "Why does earth rotate ?",
  "data/reddit-ask/r/askscience/comments/r73i6d/what_are_the_current_covid_tests_in_use_that_are.json": "With the recent discovery of Omicron and it’s apparent rapid transmission and\npositive identification across the globe, how do current COVID tests determine\nwhich variant is being detected as present? Which tests have this capability? I\nhave only ever seen tests that detect the presence of a…",
  "data/reddit-ask/r/askscience/comments/r75y5g/askscience_ama_series_were_here_to_answer_your.json": "Multiple sclerosis is a complex disease that affects the central nervous system,\nincluding the brain, spinal cord, and optic nerve. Many of its symptoms are\neasily noticed, like gait, balance, tremor, and speech. But others are not\nvisible to the naked eye - like fatigue, cognitive dysfunction, and…",
  "data/reddit-ask/r/askscience/comments/r778ve/where_do_common_cold_and_flu_infections_come_from.json": "My question is about the human virome and wether you get get sick with a cold or\nflu without any human to human interaction (aka in isolation).\n\nI know that, for example, staph bacteria is normally found on the skin of\nhealthy individuals and then occasionally become pathogenic if they get…",
  "data/reddit-ask/r/askscience/comments/r7ovkg/why_dont_astronauts_on_the_iss_wear_leadlined.json": "They're weightless up there, so the added heft shouldn't be a problem.",
  "data/reddit-ask/r/askscience/comments/r7za63/how_can_3040_gps_satellites_cover_all_of_the.json": "So, I've always wondered how GPS satellites work (albeit I know the basics, I\nsuppose) and yet I still cannot find an answer on google regarding my question.\nHow can they cover so many signals, so many GPS-related needs with so few\nsatellites? Do they not have a limit?\n\nI mean, Elon is sending way…",
  "data/reddit-ask/r/askscience/comments/r8kcqa/why_are_coronaviruses_named_after_the_greek.json": "For example why is the newest variant called Omicron? Also I know these aren’t\nthe official names but they are still called that and I wanted to know why.",
  "data/reddit-ask/r/askscience/comments/r8w492/is_the_three_polarized_filter_experiment_really_a.json": "I just watched this video\n[https://www.youtube.com/watch?v=zcqZHYo7ONs&ab_channel=minutephysics] where\nI've just now learned of the polarizing filter experiment demonstrating Bell's\ntheorem. But it's done my head in a bit because my immediate thought was simply\nthat the experiment is flawed and the…",
  "data/reddit-ask/r/askscience/comments/r9g2da/if_the_body_can_naturally_dissolve_blood_clots.json": "I heard the body is able to dissolve blood clots on their own, if thats possible\nthen why do people still have long lasting blood clots/DVT? Cant the body just\nnaturally get rid of if?",
  "data/reddit-ask/r/askscience/comments/ra5txv/if_there_are_two_identical_rockets_in_vacuum_one.json": "Given that kinetic energy is the square of velocity, if both rockets' change in\nvelocity is the same, that seems to suggest that the faster rocket gained more\nkinetic energy from the same energy source (engine).\n\nHowever, if both rockets' change in velocity are not the same, this seems to…",
  "data/reddit-ask/r/askscience/comments/ra7gnl/is_there_such_a_thing_as_excess_blood_in_your.json": "I was watching a youtube let's play and after getting hit real bad one of the\ncommentators said it was fine, they had too much blood anyway. While obviously a\njoke it got me curious what would happen if that were a real thing.",
  "data/reddit-ask/r/askscience/comments/rawfr3/why_do_mosaic_humans_not_get_attacked_by_their.json": "I recently found out that genetic mosaicism exists, in which a single person has\nmultiple different sets of DNA at a time, in different groups of cells.\n\nHowever, it isn't clear to me why the body doesn't reject these cells with a\ndifferent DNA, as is the case for e.g. organ transplants, or at…",
  "data/reddit-ask/r/askscience/comments/rb1lrd/why_are_radiators_below_windows.json": "I assume it is to create a heat curtain. I saw in some buildings with big doors\nthere are vents from the insides, and this seems like a similar scenario. My\nproblem is some sources say other various explanations.",
  "data/reddit-ask/r/askscience/comments/rb1zd9/do_individuals_who_appear_older_or_younger_than.json": "I understand there are various confounding variables (ex. those appearing older\nthan stated age may smoke, drink, have a poorly balanced diet, etc.) but if\nthose factors are controlled as much as possible, is there a correlation between\nappearing age and life expectancy?\n\nLove this community,…",
  "data/reddit-ask/r/askscience/comments/rc5jos/what_would_happen_if_protons_neutrons_and.json": "I read that the heaviest elements are produced artificially. What would happen\nif there was some environment, maybe inside or a star or some weird set of\ncircumstances in space that caused particles that make an atom to keep\naccumulating “infinitely” or as long as possible. What would the…",
  "data/reddit-ask/r/askscience/comments/rclsee/does_the_human_body_do_anything_to_prepare_for.json": "Does the human body do anything to prepare for winter? Excluding behavior that\nis, unless its an instinctual behavior like a squirrel burying nuts or a bear\neating more and packing on the pounds.\n\nLike most animals will grow a thicker coat, change coat color, start hibernating\nor migrating. Is…",
  "data/reddit-ask/r/askscience/comments/rd9ldz/how_can_you_estimate_the_temperature_of_an_arc.json": "Hi everyone. I'm wondering if it is possible or if there are methods to estimate\nthe temperature of a plasma generated from an high-frequency arc discharge in\nair, like arcs generated from an arc lighter.\n\nWould it be dependant on the frequency, the distance between the electrodes or\nother things?…",
  "data/reddit-ask/r/askscience/comments/rdzncx/does_synesthesia_give_someone_extra_information.json": "For example, Richard Feynmann has color synesthesia for numbers. Did seeing\nnumbers as colors help him in any way to solve equations? How would that work?",
  "data/reddit-ask/r/askscience/comments/reir1l/can_you_have_a_non_newtonian_fluid_that_is_also_a.json": "I’ve doing some research into non Newtonian fluids specifically dilatant or\nfluids that appear to be dilatant (have an increase in viscosity when force is\napplied). I’m working on a project where I need a fluid that can be be liquid\nand easily allow a slow moving object to pass through but to…",
  "data/reddit-ask/r/askscience/comments/resnrh/what_is_muscle_soreness.json": "What's the latest research on this? I thought the \"lactic acid buildup\" theory\nwas bunk? So is it torn muscle fibers? Is it pain caused by inflammation going\non in muscle tissue? Is it okay to workout with sore muscles or is it better to\nrest?",
  "data/reddit-ask/r/askscience/comments/retekl/how_fast_does_the_electric_field_expand_around_a.json": "So if I move some charge to somewhere else, let's say very fast, will the field\naround it drag somewhat behind? Or will it move with the charge regardless of\nthe speed of motion (which would make it seem instantaneous), not being affected\nby the speed at all?",
  "data/reddit-ask/r/askscience/comments/rfe9f7/how_fast_does_a_star_collapse.json": "Obviously, it takes billions of years to get to that point, but once the\nthreshold is crossed, the tipping point, how fast is the process of collapse and\nexplosion?",
  "data/reddit-ask/r/askscience/comments/rfkqbd/can_sperm_really_live_for_5_days_in_the_uterus_at.json": "I have read a lot of posts from women (both trying to conceive and afraid of\nconception) asking whether or not it's possible to get pregnant at various times\nof their cycles.\n\nE.g., \"I had sex on Day 4 while still bleeding. Can I get pregnant?\"\n\nThe answer I always see is that \"yes you can because…",
  "data/reddit-ask/r/askscience/comments/rfunk7/is_there_a_direct_relationship_between_fat.json": "I understand that the body will produce adipose tissue when in a caloric\nsurplus, and fat is quite caloric. But is there a more direct relationship\nbetween eating fats (butter, olive oil, avocados, etc) and producing adipose\ntissue?",
  "data/reddit-ask/r/askscience/comments/rfuvb1/if_hfcs_is_fructose_and_glucose_and_raw_honey_is.json": "Honey is often hailed as having medicinal benefits (or at least being not as bad\nas table sugar), whereas HFCS is in multiple nutritional black lists\n(figuratively) and is feared by many for its harmful effects being much worse\nthan straight up table sugar.\n\nOften the explanation is that HFCS has…",
  "data/reddit-ask/r/askscience/comments/rfv5w5/why_cant_electric_vehicles_use_total_regen_braking.json": "Here is my example. A Tesla has two regen settings and you can do one pedal\ndriving to a point. My question relates to the need for physical disc brakes and\nwhether they’re really needed. What is it that prevents using the motor as the\nbrake? Is it legalities at this point? Does this generate too…",
  "data/reddit-ask/r/askscience/comments/rg8rs3/can_a_drink_actually_be_more_hydrating_than_just.json": "Basically title. How can something hydrate you more by adding electrolytes or\nsalt? Surely the amount of water you’re putting into your body is the only\nmeasurement of how hydrated you can be? I’m torn between “I don’t know enough\nabout electrolytes to question it” and generally assuming…",
  "data/reddit-ask/r/askscience/comments/rg9kzl/when_different_breeds_of_cats_reproduce.json": "Domestic Short-haired cats are considered what a “true” cat looks like once\nimposed breeding has been removed. With so many breeds of dogs, is there a\n“true” dog form that would appear after several generations?",
  "data/reddit-ask/r/askscience/comments/rgnx1n/can_you_trainexercise_your_ears_to_hear_better.json": "A while ago I heard someone I work with, who is a fairly smart person, talking\nto another coworker. He said, “I watch TV with the volume on low to train my\nears so I can hear better.”\n\nWould this work?",
  "data/reddit-ask/r/askscience/comments/rhpba8/askscience_ama_series_were_experts_working_on_the.json": "The James Webb Space Telescope (aka Webb) is the most complex, powerful and\nlargest space telescope ever built, designed to fold up in its rocket before\nunfolding in space. After its scheduled Dec. 24, 2021, liftoff from Europe's\nSpaceport in French Guiana (located in South America), Webb will…",
  "data/reddit-ask/r/askscience/comments/rij7l3/how_did_the_parker_sun_probe_manage_to_broadcast.json": "Weren't solar flares strong enough to disrupt Earth's ground infrastructure?\nI've seen the overly exaggerated articles, but at that proximity to the sun,\nwouldn't it mess with Parker's communication too?\n\nBeen wondering how we got that crystal clear video of the Milky Way, with the\nplanets…",
  "data/reddit-ask/r/askscience/comments/rimoc0/why_is_omicron_considered_a_variant_rather_than_a.json": "I'm no expert, but from what I read it seems that the omicron variant has\ndifferent symptoms and little-to-no shared immunity. At what point is it just a\nnew coronavirus like the other coronaviruses in the world as opposed to a\nvariant of Covid-19?",
  "data/reddit-ask/r/askscience/comments/riz161/has_the_belief_in_homeopathy_decreased_within_the.json": "It seems like I very rarely hear about homeopathic medicine treated as anything\nother than quackery anymore. A few years ago it seemed like the Next Big Thing\nin alternative medicine. What has caused this, or am I incorrect and it is still\nwidely believed in?\n\nDisclaimer: I know homeopathy is…",
  "data/reddit-ask/r/askscience/comments/rizdpk/how_does_a_wild_animal_population_naturally.json": "Wouldn’t a population be perpetually infected and/or die off as a result of\nSTIs? In the case of animals that engage in casual sex or polygyny, I’d expect\nSTIs would be even more easily spread.\n\nThis NCBI article Disease and the dynamics of…",
  "data/reddit-ask/r/askscience/comments/rj6vl6/is_there_a_time_frame_for_full_protection_after.json": "I've been wondering since here in Germany, literally the day you get your\nbooster, you count as having had 3 shots but I remember that for the second one\nyou had to wait 2 weeks until you were \"fully immunized\". Legalities are one\nthing, but from a virology point of view, is there such a time frame…",
  "data/reddit-ask/r/askscience/comments/rjhgud/did_every_person_with_red_hair_come_from_the_same.json": "I first posted this in r/askhistorians [/r/askhistorians] hoping for a sort of\ntime line, but it was removed for being a science question. I am no expert but\nI'd appreciate any insight someone could give here!\n\nI was reading that the people in England originate from the same group as the\nCelts. But…",
  "data/reddit-ask/r/askscience/comments/rjxjha/how_did_omicron_get_50mutations_would_this_happen.json": "In other words….you’ve got the delta variant, which I assume is the variant\nomicron has fifty different mutations from? (Or is it 50 compared to the\noriginal?)\n\nAnyhow, person A has Delta. Does delta gain 50 mutations in person A, and so it\ntransmits more and got to person B? Or does it develop 1-2…",
  "data/reddit-ask/r/askscience/comments/rjz5v2/what_causes_hair_loss_from_eating_disorders.json": "Is it a high stress level? Or lack of nutrients or something",
  "data/reddit-ask/r/askscience/comments/rkpcv0/do_viruses_from_30_years_ago_exist_for_example.json": "Does the first variant of covid still exist?\n\nI ask because no one seems to be tested for it in my country anymore.\n\nSecondly, do viruses from 100 years ago still exist?\n\nDid they disappear naturally?",
  "data/reddit-ask/r/askscience/comments/rl1rhc/what_is_the_closest_to_the_alphacentauri_system.json": "I know that the alpha-centauri system is the closest to the Earth-Sun system,\nbut that doesn’t mean we are the closest to it. What is the closest star to\nalpha-centauri that is not us?",
  "data/reddit-ask/r/askscience/comments/rl4pvj/what_produces_the_bad_smell_in_meat_that_has_gone.json": "I have found no answer to this online. When meat goes bad and it starts to smell\nlike sulfur, what is the meat releasing that smells like that?",
  "data/reddit-ask/r/askscience/comments/rletxz/is_there_any_development_on_higher_energy_density.json": "So it seems like the energy density of fossils fuels have more or less\ncompletely hit a brickwall. Is there any developments on any new fuel that has\nhigher energy density then the traditional RP1 and jet fuel?",
  "data/reddit-ask/r/askscience/comments/rm4m7t/why_did_the_space_shuttle_have_to_do_the_roll.json": "After takeoff the space shuttle always performed a roll maneuver. Why couldn't\nit be oriented on the pad to avoid having to make such an adjustment?",
  "data/reddit-ask/r/askscience/comments/rmj4yd/how_broadly_might_pfizers_new_covid_antiviral.json": "I read that Pfizer's new pill, paxlovid, is a protease inhibitor that interferes\nwith viral replication, and that they expect it to work just as well against\nomicron as it did against previous variants.\n\nWill it work against all potential sars-cov-19 variants? Might it work on other\ncoronavirus?…",
  "data/reddit-ask/r/askscience/comments/rmv7eu/askscience_ama_series_were_microbiologists_and.json": "Interested in how science and art overlap? So are we! We are scientists and\nartists who use a variety of artistic media to create works of art that showcase\nmicrobiology in our world. Some of us use combinations of microbes \"painted\" on\nnutritional agar; others use more traditional artistic…",
  "data/reddit-ask/r/askscience/comments/rn0075/how_are_people_who_test_positive_with_an_at_home.json": "I know of dozens of people who tested positive in the last week (Colorado) and\nall of them with an at home test. Case numbers are spiking like crazy in\nsurrounding counties, but I have to imagine with how many people are discovering\nthey're infected outside the medical system it has to be…",
  "data/reddit-ask/r/askscience/comments/rnpcoy/why_do_some_israeli_scientists_say_a_second.json": "Israel recently approved a fourth dose for the vulnerable citing waning immunity\nafter the first boost. Peter Hotez endorsed a second boost for healthcare\nworkers in the LA Times. This excerpt confuses me though:\n\nArticle: https://archive.md/WCGDd\n\n> The proposal to give a fourth dose to those most…",
  "data/reddit-ask/r/askscience/comments/ro3xxu/if_mrna_vaccines_produce_the_spike_protein_within.json": "What makes the vaccine antibodies more robust / diverse than the monoclonal\nantibodies produced in labs?",
  "data/reddit-ask/r/askscience/comments/ro4p2z/so_is_ice_a_rock_or_not.json": "Are ice cubes rocks?",
  "data/reddit-ask/r/askscience/comments/ro4v3x/is_it_true_that_penguins_become_insane_deranged.json": "This moment in the documentary fascinated me, where Herzog shows a penguin\nstopping in its tracks, and suddenly starts walking alone away from its home or\nhunting grounds towards the desolate mountains of Antarctica, where it will die.\nHe says that the penguin scientist he talked to (though without…",
  "data/reddit-ask/r/askscience/comments/roah1g/why_are_wet_things_much_harder_to_burn.json": "Seems like an obvious question but I was discussing this with my kids and we\ncouldn’t find a good answer.\n\nI’m hoping that the collective brains here can give us a definitive answers.\n\nThanks",
  "data/reddit-ask/r/askscience/comments/rog62g/happy_holidays_to_you_and_a_special_thanks_to_our.json": "Happy holidays to all of you from /r/AskScience! All of you make this subreddit\npossible and I want to all know how sincerely I appreciate what you do here.\n\nTo every moderator who ensures that the posts are curated and the overall\nfunction of the subreddit works. You make up the framework of…",
  "data/reddit-ask/r/askscience/comments/rozyow/why_do_some_birds_owls_eagles_have_feathers_on.json": "Is it to do with flight? Warmth? Other? Does this factor into taxonomy?",
  "data/reddit-ask/r/askscience/comments/rqib10/what_is_the_science_behind_cdc_reducing.json": "The CDC recently reduced quarantine guidelines stating: “The change is motivated\nby science demonstrating that the majority of SARS-CoV-2 transmission occurs\nearly in the course of illness, generally in the 1-2 days prior to onset of\nsymptoms and the 2-3 days after. “. Sounds good but they don’t…",
  "data/reddit-ask/r/askscience/comments/rqrgtq/are_there_viruses_that_find_sources_of_energy.json": "Self explanatory.",
  "data/reddit-ask/r/askscience/comments/rqw3f0/can_explosives_be_detonated_with_sound_waves.json": "Can explosive compounds be agitated via sound waves (or really any type) so as\nto result in an explosion? If not, then why?\n\nEdit: ultimately I'm curious if, in the future, sound waves could be used to\ndetonate minefields.",
  "data/reddit-ask/r/askscience/comments/rr656i/what_is_the_incubation_time_of_the_corona_virus.json": "Two years ago it was explained that the great danger of covid was the long\nincubation of roughly two weeks between infection and outbreak/symptoms. So you\nwould go around and spread it without realizing you were carrying it.\n\nHow is the situation now, especially regarding the new variants? Is…",
  "data/reddit-ask/r/askscience/comments/rr6mt4/how_does_my_brain_understand_where_pain_is.json": "Hi,\n\nI understand the basics of how pain and nervous system work: when something bad\nhappens, our nerves fire pain signals. However, the thing that eludes me is: how\ndoes brain know where the pain is spatially located? For example, when my\nstomach hurts, I usually can point at the location of the…",
  "data/reddit-ask/r/askscience/comments/rs163w/how_come_men_can_lose_their_hair_while_it_rarely.json": "What biological processes exist for women that make them much less likely to go\nbald?",
  "data/reddit-ask/r/askscience/comments/rs3cn1/do_we_have_evidence_that_omicron_is_more_mild.json": "I've seen this before in other topics, where an expert makes a statement with\nqualifications (for example, \"this variant right now seems more 'mild', but we\ncan't say for sure until we have more data\"). Soon, a black and white variation\nof the comment becomes media narrative.\n\nDo we really know…",
  "data/reddit-ask/r/askscience/comments/rsbeux/two_bowling_balls_are_at_rest_5_megaparsecs_apart.json": "According to Hubble's Law, at 5 Mpcs distance each bowling ball would see the\nother receding at 351.5 km/s, but the cable prevents that from happening. Does\nthat mean there's a \"cosmological stress\" in the cable induced by the expansion?"
}