{
  "data/reddit-changemyview/r/changemyview/comments/ob61pw/cmv_san_joses_new_gunowners_pay_for_gun_violence.json": "San Jose has enacted a new policy that will force everybody who wishes to\nexercise their 2nd amendment right to purchase insurance that will be used to\npay victims of gun violence.\n\nI think it's wrong. Imagine this equivalent scenario to understand why I feel\nthis way:\n\n\"Everyone who exercises their…",
  "data/reddit-changemyview/r/changemyview/comments/obbfc0/cmv_it_is_socially_acceptable_to_make_fun_of.json": "Title could have been worded better. I’m not saying it ‘should’ be socially\nacceptable, I’m saying that I believe it is currently (subconsciously) accepted,\nand it shouldn’t be. I’m asking you to convince me that it is not socially\naccepted.\n\nBefore anyone misinterprets this, this does not mean that…",
  "data/reddit-changemyview/r/changemyview/comments/obdava/cmv_inserting_nonwhite_characters_into_stories.json": "I saw a clip from frozen 2 recently and noticed a pretty significant number of\nnon white characters, to my surprise. I don’t understand the logic these\nadditions. Frozen is set hundreds of years ago In Scandinavia. Is it just\nshallow attempts at diversity?\n\nMy favorite show of all time is Avatar:…",
  "data/reddit-changemyview/r/changemyview/comments/obe27y/cmv_the_less_you_focus_on_things_out_of_your.json": "For some people they worry about sports or romantic relationships. People waste\na lot of energy hoping their favorite sports teams win the big title or that\ncute someone likes them back when it is almost always outside of their control\nof what happens there.\n\nFor me, it's the stock market, politics,…",
  "data/reddit-changemyview/r/changemyview/comments/obfpgz/cmv_social_media_is_toxic_to_society.json": "It may seem ironic for me to decry social media on a social media site, but I\nthink it's appropriate --\n\nIn my opinion, social media has been a horrific accelerator of humankind's worst\ntendecies, and is toxifying our society.\n\nChronic judgments, superficial lies, and echo chambers of misinformation…",
  "data/reddit-changemyview/r/changemyview/comments/obh4kl/cmv_piracy_can_be_justified.json": "So, yes i think piracy can be justified for various reason.\n\nFirst of all, if a person has the money to legally pay for a service (movies,\nanimes, games etc) and they don't do it because they think entertainment should\nbe free, yes, then piracy can't be justified.\n\nAlso i think pirating services…",
  "data/reddit-changemyview/r/changemyview/comments/objxpa/cmv_bidens_claim_that_you_would_need_f15s_and.json": "View is related to this statement:\n\nhttps://youtu.be/SHLHkmWoYDU\n\nRationale:\n\nAmerica pretty much lost the Iraq war. Sure they got rid of Saddam, but they\ndidnt subdue the militant Islamists and ex-Iraqi army militias at all. Once they\nleft Isis had the strength to not only conquer large swathes of…",
  "data/reddit-changemyview/r/changemyview/comments/obldx3/cmv_in_a_layman_conversation_nitpicking_on.json": "Whatever your expertise, I'm sure you've had this experience. Someone correcting\na psychologist on an inaccurate use of a term like \"fetish\". Correcting people\ndoing an economics PhD on \"you can't say free because nothing is free\". A\nphysicist on the usage of \"weight\", and so on. Or a personal…",
  "data/reddit-changemyview/r/changemyview/comments/obp7da/cmv_woman_who_demand_both_equality_and_chivalry.json": "Now to star I want to clarify what I mean by chivalry. I dont mean treating\npeople with respect or holding the door open, those are just traits of a decent\nhuman. What I mean is the man asking the woman out , having to plan the date,\npay for it and any further other(since she will hold it againts…",
  "data/reddit-changemyview/r/changemyview/comments/obt46b/cmv_in_breaking_bad_there_are_some_serious_meth.json": "1.) They are making 200 pounds of meth a week for 3 months. (source: The show)\n\n2.) The meth sells at $40 an ounce. (Source:\n\nJessie keeps saying, \"He's selling at 40 a pound\". I see 3 possibilities for\nthis:\n\nA.) He mean $40 a pound. For all the risk they are taking to make Meth, that\nseems like…",
  "data/reddit-changemyview/r/changemyview/comments/obwn05/cmv_adult_programs_and_songs_shouldnt_be_censored.json": "Corporations shouldn't have to parent your child. You are their parent and it is\nyour responsibility to raise them. If you don't want your kids to see or hear a\nprogramming then that should be on you. When I hear a song on the radio with 50\ndifferent little distorted parts it makes me laugh. If it's…",
  "data/reddit-changemyview/r/changemyview/comments/obwzwl/cmv_the_line_should_be_drawn_at_theythem.json": "I Was looking at Instagram the other day and someone im following posted on\ntheir story a post containing multiple slides with pronouns I have never heard\nof before, I swear one of them was viv/vov and one was xe/xer. I see 0 reason\nwhy we need to have these in our society and what benefit they…",
  "data/reddit-changemyview/r/changemyview/comments/obywd5/cmv_certain_hairstyles_do_not_belong_to_certain.json": "I've seen POC getting upset on youtube/tiktok for a white person wearing a\nhairstyle that they believe should only be worn by their culture and I dont\nreally understand it.\n\nI was watching a YouTube video of a European women showing how to do a\nNordic/Viking style braid. She braided two cornrows…",
  "data/reddit-changemyview/r/changemyview/comments/oc1c0n/cmv_a_person_should_not_be_able_to_be_charged.json": "When I was in college a roommate went out drinking one night, got in an\narguement with someone in the bar, and decided to leave. He realized that he had\nhad too much to drink, so he called a ride. It was mid August and super hot\noutside, so while he was waiting on his ride he sat in in his truck and…",
  "data/reddit-changemyview/r/changemyview/comments/oc1guc/cmv_people_should_not_have_received_their_drivers.json": "This is happening in the United States. I know multiple people who got their\ndriver's licenses without taking their road test. This was a ridiculous choice\nthe government made during the pandemic. Yes, it would have sucked for people\nwho couldn't get their licenses right away, but for the safety of…",
  "data/reddit-changemyview/r/changemyview/comments/oc4vkm/cmv_suicide_prevention_ralliessocial_media.json": "Full disclosure, have lost a few friends to suicide, one of which still cuts me\ndeep to this day... it is the driving force behind my view. People made\nT-shirts, had a 5k run, put up social media posts about suicide prevention and\nstuff like that. Who the hell is this helping? If someone is…",
  "data/reddit-changemyview/r/changemyview/comments/oc567x/cmv_equal_pay_pertaining_to_womens_football.json": "Don't take this out of context. Equal pay in other stuff is reasonable like\ndoing the same office job. But in the context of sports, I dont see equal pay in\nwomen's football being realistic in the current women's market.\n\nFrom my general knowledge of sports. Salary for players are usually…",
  "data/reddit-changemyview/r/changemyview/comments/ocacpo/cmv_field_sobriety_tests_should_not_be_up_to_the.json": "I understand that someone can be intoxicated on something other than alcohol, so\nI know why they're in place. However I do not like that an officer with no\ntraining gets to decide to actually charge you with the crime, I believe at most\na driver should be taken to the drunk tank and then released…",
  "data/reddit-changemyview/r/changemyview/comments/ocsila/cmv_undercover_police_and_infiltrators_and.json": "If police set out a truck of shoes with the intent of it being stolen, logically\nthat means they were giving things away to the public because it was purchased\nwith taxpayer dollars.\n\nAlso undercover cops, vans, cruisers being used for routine traffic enforcement\nseem blatantly unconstitutional…",
  "data/reddit-changemyview/r/changemyview/comments/ocvz3l/cmv_instagram_has_lost_its_edge_and_will_die_out.json": "Instagram is on the decline, and will continue to do so for the next few years\nuntil they finally die out. Here are my reasons for believing that.\n\nOne - Instagram is losing its niche\n\nInstagram had a successful niche as a photo-sharing platform, and that is still\nultimately what most creators and…",
  "data/reddit-changemyview/r/changemyview/comments/ocw144/cmv_we_should_tax_the_externalization_of_a_cost.json": "For example, it's cheaper to transport chicken from the USA to China, where it\nwill be processed (it's cheaper due to lower wages and other reasons) and\nshipped back to the USA. This is a monstrous practice, that creates a lot more\npollution due to trans-oceanic transportation and takes capital out…",
  "data/reddit-changemyview/r/changemyview/comments/ocyx3j/cmv_its_okay_to_end_relationships_friendships.json": "Contrary to popular opinion, politics is more than just a difference in what to\ndo with taxes. It's also NOT some innocuous, neutral attribute akin to\nethnicity, gender, or sexual orientation. Your political affiliation is a\nreflection of your core values, and your core values IS the content of…",
  "data/reddit-changemyview/r/changemyview/comments/od34fv/cmv_saying_thank_you_for_your_service_to_someone.json": "First off I understand it makes sense to say \"thank you\" if they were FORCED to\nbe drafted into the war, to protect their country (say for WW1 or similar, that\nwas brutal), but past that it baffles me every single time. Sometimes there are\nliterally standing ovations after someone is thanked for…",
  "data/reddit-changemyview/r/changemyview/comments/od6h1i/cmv_mlks_a_letter_from_a_birmingham_jail_is_a.json": "MLK's criticism of liberals who wish to have a false since of peace just feels\nso relevant to the world we live in today. To the point where even I a black man\nfell for the exact trap he speaks of in this letter.\n\nSo many minorities face so much oppression and one the default responses is\nalways \"if…",
  "data/reddit-changemyview/r/changemyview/comments/od8qx8/cmv_the_daily_show_and_similar_shows_do_more_harm.json": "I always enjoyed watching Jon Stewart, then Trevor Noah, for their humor. On\noccasion, they would reveal some valuable insight, engaging interviews, or\nimpressive journalism. Normally, though, most of the enjoyment came from\nwatching them lambast conservative hypocrisies.\n\nHowever... Are they…",
  "data/reddit-changemyview/r/changemyview/comments/od8z8z/cmv_i_think_that_approaching_someone_in_real_life.json": " 1. Immediate feedback. You don’t have to wonder about if you’re being rejected\n    or if she’s interested but taking forever to respond because you will get an\n    answer right then and there.\n 2. You’re not competing with all the good looking people in the world at the\n    moment you approach. You…",
  "data/reddit-changemyview/r/changemyview/comments/odausa/cmv_as_a_married_father_of_two_young_children_it.json": "I need everyone to be at the top of their game today because I really want you\nto change my view here.\n\nI have wanted to get a motorcycle since I was a teenager but I didn't have the\nmoney. Now I can afford one but I am married with two kids and I cannot help but\nthink that it is an unnecessary risk…",
  "data/reddit-changemyview/r/changemyview/comments/odavbx/cmv_peoples_outrage_over_shacarri_being_banned.json": "It seems like a lot of people are really upset over the failed drug test. It’s\ncrazy that people want there to be no consequences to her getting caught on a\ndrug test. I don’t even think it’s right that they drug test for cannabis, but\nthe standard is already there. Is it awful her mother died and…",
  "data/reddit-changemyview/r/changemyview/comments/odeibr/cmv_a_world_where_teachers_are_fired_for_their.json": "I see no reason to fire them and I think its immoral. By immoral I don't mean\nthe employer can't do it legally, I mean I will not like them if they do so. and\nmy view is coming from public schools. Here the government is the employer who\nhires teachers.\n\nA teachers ability isn't diminished because…",
  "data/reddit-changemyview/r/changemyview/comments/odgp3z/cmv_the_usa_lost_the_afghan_war.json": "This week most US soldiers left Afghanistan. And like Vietnam it has been a\ncostly disaster. The Afghan expedition was a failure by most metrics for the US:\n\n * They did not defeat the Taliban.\n * They did not win the hearts and minds of the Afghan population.\n * They did not improve the lot of…",
  "data/reddit-changemyview/r/changemyview/comments/odjq8u/cmv_smoking_weed_everyday_is_not_a_healthy_habit.json": "I know I'm gonna get a lot of flack for this but I don't believe it's healthy to\nsmoke weed everyday and would be open to changing my opinion on that as it is a\ncontentious issue in my relationship. My partner believes smoking weed everyday\nis okay but I think marijuana and alcohol are similar in…",
  "data/reddit-changemyview/r/changemyview/comments/odrdvw/cmv_many_americans_are_ungrateful_for_living_in.json": "Every 4th of July I see so many different people complaining about the fact that\nwe are celebrating our independence. Their basis for this is generally that we\nhave problems in the country, both in the present, and in the past.\n\nLiving in the United States is a privilege and denying it is, is…",
  "data/reddit-changemyview/r/changemyview/comments/odx41x/cmv_crypto_is_logistically_unworkable_and_is_thus.json": "I have yet to see a convincing answer for why Bitcoin and other currencies are\nactually the future of finance. There are a few very basic flaws that are\nobvious to me:\n\n * Devaluation of fiat. Fiat is already not in a great spot in many places due\n   to the absurd money printing for COVID relief…",
  "data/reddit-changemyview/r/changemyview/comments/oe0e2l/cmv_if_there_isnt_space_for_white_men_to_feel.json": "I think the recent growth of white supremisim is directly tied with the\nincreasing acceptance and valuing of minority groups and women. Where\nmarginalized white men see these groups be recognized for their skin color,\ngender, etc and they want the same except the only way they can feel like part\nof…",
  "data/reddit-changemyview/r/changemyview/comments/oe1apm/cmv_all_social_media_platforms_are_trying_to_copy.json": "All social media platforms are trying to integrate the full screen video, “just\nswipe”, platform and I hate it. Reddit just did it and I hate it. I don’t want\nyour shitty algorithm to try to feed me old content when I swipe on a video from\nmy home page, and I hate the new “chat” comment layout.…",
  "data/reddit-changemyview/r/changemyview/comments/oe4p16/cmv_im_tired_of_this_constant_attempt_at.json": "Let's get this out of the way: I'm pretty much a liberal regarding drugs. I\nthink they should be legalized, taxed and regularized as it looks to me that the\npros of doing that clearly outweight the cons. I am a clean guy, I don't drink\nand I don't smoke. I am curious of weed and psychedelics, but at…",
  "data/reddit-changemyview/r/changemyview/comments/oe4y7v/cmv_gmail_is_streets_ahead_of_outlook_in_everyday.json": "I have worked in corporate environments that use both Outlook and Gmail (Google\ntailors it to the specific corporate with branding etc, but it’s Gmail through\nand through). Having used both in the same type of working environment, my take\nis that Gmail is not just marginally better, but far…",
  "data/reddit-changemyview/r/changemyview/comments/oeak4c/cmv_some_parents_genuinely_deserve_to_have_their.json": "I’m not just referring to abusive parents, just any kind of overboard parents.\nNarcissistic, stubborn, narrow minded and self righteous, and all the other\nterms you can think about to describe horrible parents. Toxic parents.\n\nWhy should any kid stay to take care of their parents if they were toxic…",
  "data/reddit-changemyview/r/changemyview/comments/oehe3h/cmv_continuing_to_put_people_coming_out_as_gay_in.json": "It seems everytime a celebrity comes out is gay it is plastered all over social\nmedia calling them a hero and strong for coming out. Now if this was 20+ years\nago I'd totally agree. Nowadays though, with there being a pride month and a\nconsiderable amount of the population being accepting of gays I…",
  "data/reddit-changemyview/r/changemyview/comments/oejsee/cmv_its_not_racist_to_not_being_able_to.json": "I'll be honest that this is a response to this\n[https://www.reddit.com/r/WhitePeopleTwitter/comments/odaxhu/they_can_barely_manage_english/?utm_medium=android_app&utm_source=share]\npost on r/whitepeopletwitter [/r/whitepeopletwitter] that blew up a few days ago\nthat asserts that you're racist if you…",
  "data/reddit-changemyview/r/changemyview/comments/oem7nf/cmv_dog_breeds_such_as_pugs_dachshunds_and.json": "As the heading says, certain breeds of dogs (and other animals too), just\nshouldn’t exist for the animal’s welfare, I know so many people that have owned\na pug that have needed to take them to the vets just to fix their breathing\nbecause their face structures are just absolutely destroyed through…",
  "data/reddit-changemyview/r/changemyview/comments/oew0yl/cmv_it_should_be_illegal_for_health_insurance.json": "US based obviously. In my opinion it should be illegal for an insurance provider\nto have access to 'plan discounts' that the average consumer cannot have access\nto. An example, I have needed some blood work and imaging recently. Quest\ndiagnostics billed nearly $800 total for 2 round of blood work.…",
  "data/reddit-changemyview/r/changemyview/comments/oexrwn/cmv_the_best_years_of_your_life_are_alwaysnow_so.json": "So many people look at their life and feel that they’re too young and need to be\nolder and can’t wait, Middle Agers who always say “oh if I only knew then what I\nknow now” are wasting time thinking about regrets or how crappy their life is\nnow, but they need to appreciate that, however cliche, your…",
  "data/reddit-changemyview/r/changemyview/comments/of1s67/cmv_reddit_has_gone_from_the_front_page_of_the.json": "Been a long time lurker and occasional commenter, and first things first i just\nwanna put this out there that this obviously does not apply to everyone nor all\nof reddit. There are plenty of great subs to learn things from and its fairly\neasy to gain proper insight on those things from other helpful…",
  "data/reddit-changemyview/r/changemyview/comments/of3ttm/cmv_rachel_nichols_isnt_wrong_for_her_comments.json": "It’s been recently reported that as of now , Rachel Nichols has been removed\nfrom the NBA finals crew. For those that don’t know what’s going on , basically\n, There was a tape recording that came out of Rachel basically saying that she\nfelt she lost her lead position as an NBA finals reporter last…",
  "data/reddit-changemyview/r/changemyview/comments/of8y6f/cmv_the_united_states_is_slowly_but_totally.json": "From unsalvageable political polarization, to our undying reliance fossil fuels,\nto the mental health/healthcare crisis, to gun violence. Aside from civil rights\n(I understand that this is no small footnote and is a great improvement) it\nseems like literally nothing has gotten better/no improvements…",
  "data/reddit-changemyview/r/changemyview/comments/ofa28a/cmvtheres_a_distinct_double_standard_between.json": "So first off I just wanna say that this isn't aimed to be a jab at woman or a\nway to berate them in any way. Like the description in the sub says I understand\nmy view may be flawed and I'll except that if it is. Basically the reason I feel\nthis way stems from something from my childhood.\n\nMy mom was…",
  "data/reddit-changemyview/r/changemyview/comments/ofd9ip/cmv_men_should_not_be_expected_to_pay_on_the.json": "Well we are in 2021 and as firm believer or women’s right and equality I think\nmen should not be expected to pay on the first date.\n\nBecause those traditions are old and sexists and they date back from when women\ncouldn’t work and were dependent to her husband, but nowadays women are as\nstrong if…",
  "data/reddit-changemyview/r/changemyview/comments/ofkrg1/cmv_your_experiences_with_men_andor_woman.json": "People relate their dating experiences to an entire population. “All guys are\nasshole, All the guys I’ve been with turned out to be” or “all girls are crazy!\nEvery girl I’ve been with turned out to be crazy!” (Stereotype examples for my\npoint)\n\nThis reflects your judgment in men or woman or your own…",
  "data/reddit-changemyview/r/changemyview/comments/ofmbql/cmv_there_should_be_no_politicians_that_are_in.json": "What this means is that, if the average age of death in the United States is\n78-80, than no one above the age of 70 (to give a round number) should be\nallowed to make decisions on a wide scale.\n\nI know many divisive, politically-minded individuals will disagree with me on\nthis (especially in the…",
  "data/reddit-changemyview/r/changemyview/comments/ofnuvz/cmv_debates_are_meaningless_without_fact_checking.json": "I don’t get why people just accept when people debating pull out statistics or\n“facts” as truth. I think for major debates (especially election ones, since\nthose are so important), the participants must pre-submit verifiable facts they\nintend to rely on (such as things like unemployment rate within…",
  "data/reddit-changemyview/r/changemyview/comments/ofoq2j/cmv_many_countries_are_becoming_more.json": "This is definitely a controversial topic but as an initial disclaimer I'd like\nto say that I'm not a libertarian I'm personally more of a centrist, and I'm\nalso not someone who is anti-lockdowns or anything. I don't live in the US\neither and don't affiliate with any of the two main parties…",
  "data/reddit-changemyview/r/changemyview/comments/ofr2n0/cmv_racism_is_not_just_about_minorities_meaning.json": "If we can agree that the definition of racism is \"Discrimination against someone\nbecause of their race.\", then why does racism only get called out when it is\nagainst a group deemed to be a \"minority\" (which doesn't make sense if you look\nat global percentages instead of just country to country…",
  "data/reddit-changemyview/r/changemyview/comments/ofrp49/cmv_americans_are_insulated_to_outside_thoughts.json": "I want to start this off by saying that I haven't been to the US, nor are my\ninteraction with Americans extensive. This is mostly compiled from a lifetime of\nexperiencing American pop-culture influences and global American politics.\n\n\n\nMy view is that the US is a big country in size and population…",
  "data/reddit-changemyview/r/changemyview/comments/ofwbcr/cmv_pastors_should_not_be_allowed_to_hold.json": "Allowing pastors to become politicians inherently bridges the divide between\nchurch and state, which is sacred and should not be connected in any way.\nPastors will of course always vie for faith-based laws, see things through\nGod-tinted glasses and will generally want to connect church and state…",
  "data/reddit-changemyview/r/changemyview/comments/og7a61/cmv_on_disassociating_myself_from_politics.json": "I'm apolitical. I have views that lean both liberally and conservatively.\nHowever, I choose to not be vocal about it as I'm just not that interested in\nthe topic as a whole. I'm also a very passive person, and it's just in my best\ninterest to be passive in pretty much everything surrounding my…",
  "data/reddit-changemyview/r/changemyview/comments/oga317/cmv_homeless_people_deserve_empathy_instead_of.json": "On a road trip with my boyfriend, we had just gotten food and the homeless\npopulation was pretty rampant in that area. I had an extra sandwich and wanted\nto share it with this particular homeless person who was just sitting on the\nsidewalk with his bags, looking at the drive thru.\n\nI said “Could I…",
  "data/reddit-changemyview/r/changemyview/comments/oga4kz/cmv_anyone_should_be_able_to_opt_outleave_a_home.json": "I understand why HOAs exist and some people prefer them, and it's great (for\nthose people) when everyone involved is on the same page and things go well.\n\nHowever, anyone that doesn't wish to be bound by the ever-changing rules of the\never-changing management in a HOA should absolutely be able to…",
  "data/reddit-changemyview/r/changemyview/comments/ogaj9j/cmv_donald_trump_did_more_harm_than_good_to_the.json": "During Trump's presidency, the GOP lost both the house and the senate, he was\nimpeached twice, lost his reelection bid, was banned from social media and\narguably caused more people to distrust the GOP than any other Republican\npresident before him. It seems that any politician or political…",
  "data/reddit-changemyview/r/changemyview/comments/ogcea4/cmv_misgendering_someone_isnt_an_act_of_violence.json": "I've seen this narrative get used alot and it really makes no sense to me how\npeople can actually believe this nonsense. I'm going to be linking an article at\nthe bottom of my post to give everyone a brief idea of what I'm talking about.\nBasically this blogger wrote an article claiming that by…",
  "data/reddit-changemyview/r/changemyview/comments/ogd3tj/cmv_reddit_bots_that_reply_to_comments.json": "I've noticed a huge uptick in reddit bot activity and I think it's pretty wild\nthat these accounts are able to post all day every day, with comments that are\nin most cases nearly identical to each other.\n\nSpam is already against the reddit TOS, and that's exactly what they are. Spam.\n\nThere are some…",
  "data/reddit-changemyview/r/changemyview/comments/ogftzq/cmv_my_friends_death_in_afghanistan_was_in_vain.json": "A childhood friend of mine (US Marine Sniper) was killed in action fighting in\nAfghanistan. After 20 years, US forces are withdrawing from the region. I\nbelieve the war was a complete failure and his death was in vain. A view I\nhaven't shared with anyone else. I would like to believe that his death…",
  "data/reddit-changemyview/r/changemyview/comments/ogk3ua/cmv_the_misuse_of_the_word_objectively_has_become.json": "The title says the view for the most part. I've noticed a significant trend on\nReddit and other social media platforms over the last few years where people\nwill describe something as \"objectively funny\" or make a statement like \"minimum\nwage increases are objectively bad for low income people\". The…",
  "data/reddit-changemyview/r/changemyview/comments/ogkyj3/cmv_china_is_an_authoritarian_state_that_should.json": "Title says it all. China is actively engaging in genocide in its western part of\nthe country against their Muslim population, known only on my internet searching\nas the “Uighurs” putting them into modern day concentration…",
  "data/reddit-changemyview/r/changemyview/comments/ognwkq/cmv_protesting_on_the_highway_and_streets_is.json": "We’ve all seen videos of protesters who’ve been run over because they decided to\nstand in the street and block traffic and someone decided they weren’t going to\nwait and tried to get past them, purposely or accidentally, hitting someone or a\nfew people in the process.\n\nWhile there are definitely…",
  "data/reddit-changemyview/r/changemyview/comments/ogwixg/cmv_var_in_football_soccer_is_a_good_thing_and.json": "VAR means “video assisted referee”. It is football’s implementation of using\n“live” video playback while a game is in progress to help the referee determine\nif something had been a foul, if there had been a handball etc. I am not an\nexpert on the precise ways in which it is utilised, but the…",
  "data/reddit-changemyview/r/changemyview/comments/ogxq4o/cmv_the_clock_should_stop_in_football_soccer_when.json": "I watch soccer from time to time and something I never understood was why they\nnever stopped the clock when the play was dead. Currently they add dead time\nback onto the clock in form of added time but I have a couple of problems with\nthis.\n\nThey never add the right amount of time. A couple of times…",
  "data/reddit-changemyview/r/changemyview/comments/oh1j13/cmv_the_statecountycity_should_be_on_the_hook_for.json": "Title is pretty much my view, but is part of a larger assortment of criminal\njustice reform ideas I have been kicking around in my head that, for the sake of\nbrevity, has been reduced down to these two for now.\n\nThe overall goal is to standardize the treatment of rich and normal Americans in\nthe…",
  "data/reddit-changemyview/r/changemyview/comments/oh8zsn/cmv_the_age_of_18_is_treated_so_weirdly.json": "I see posts where people speculate whether 17/19 and 16/18 relationships are\nappropriate and if the younger parties are being groomed, and posts where people\ndefend 18/25+ relationships because they’re “adults” and should have a right to\ndo whatever they want in their personal lives. Does something…",
  "data/reddit-changemyview/r/changemyview/comments/ohelox/cmv_no_matter_how_heinous_someones_crime_they.json": "My view is that we should want this because the court system does not convict\nbased on 100% fact (even when operating to theoretical perfection). It simply\nconvicts based on 12 people (in a trial setting) deciding unanimously that one\nis guilty beyond a reasonable doubt.\n\nWith all of the convictions…",
  "data/reddit-changemyview/r/changemyview/comments/ohgj5x/cmv_i_think_that_streaming_services_that_add.json": "I’ve watched many “black voices” in my life. I was in the USAF, so Morgan\nFreeman is a distant “brother” of mine and I’ve always loved watching him (who\ndoesn’t?). Never flinched at Blade. Will Smith was the first rapper I was\nallowed to listen to as a child, and I respect and continue to respect…",
  "data/reddit-changemyview/r/changemyview/comments/ohh4ps/cmv_being_able_to_freeze_time_is_the_best.json": "I am convinced being able to freeze time is the best superpower you could have.\nI could fulfill all my dreams (both good and evil) with this power.\n\nIt’s important to mention that I’m talking about how a superpower would be\nuseful while living a ‘normal’ life. That means I’m not trying to be part…",
  "data/reddit-changemyview/r/changemyview/comments/ohr7hl/cmv_most_of_the_deaths_of_military_members_in.json": "I think about this a lot and while it's very not polite and upsetting to people\nto hear I think it's important to talk about. I think not talking about this is\nmore harmful for future victims of these wars than the harm that comes from\ntalking about it. Nothing can really be undone regarding the…",
  "data/reddit-changemyview/r/changemyview/comments/ohsuxl/cmv_human_sexuality_is_binary_by_design_with_the.json": "Hi folks, a biochemist here.\n\nThe quote in my title represents my view about human biological sex - that\nhumans are a binary species. The fact that conditions like Klinefelter/Turner\nexist doesn't imply the existence of other sexes, they're simply genetic\nvariations of a binary system.\n\nThe idea…",
  "data/reddit-changemyview/r/changemyview/comments/ohuush/cmv_if_someone_gets_repeatedly_arrested_for.json": "I keep seeing news stories about felons who have been in out and out of prisons\nmore times that they can count. Yet they continue to be released over and over\nagain until the end up committing a deadly crime. If someone makes a mistake,\nlearns their lesson and gets released into society without…",
  "data/reddit-changemyview/r/changemyview/comments/ohxrtj/cmv_prisoners_and_parolees_should_retain_their.json": "Losing one’s right to vote has always seemed like a natural consequence for a\nperson who commits a serious crime, in my mind I always figured that felons had\nbroken the rules of the game of democracy and shouldn’t be allowed to play.\nYesterday, while reading about the case of the Texas parolee…",
  "data/reddit-changemyview/r/changemyview/comments/oi0zp0/cmv_by_filling_balloons_with_helium_you_are.json": "Helium is a very limited resource expected to run out it 25-30 years with our\ncurrent useage. It is currently used as THE coolant in MRI machines and as\nradiation detection for anti-terrorist units around the world for detection of\nA-bombs and dirty bombs. Helium is only produced by nuclear fusion…",
  "data/reddit-changemyview/r/changemyview/comments/oi6bzg/cmv_obtaining_a_college_degree_today_is_an.json": "I'm a 22yr old college student who serves full-time in a restaurant to afford my\neducation. College education used to be an investment where you'd see a return\nin the form of a job/career. I think qualifications for private sector careers\nare drastically changing.\n\nI read a tweet this morning…",
  "data/reddit-changemyview/r/changemyview/comments/oi6rjn/cmv_the_british_royal_family_is_silly_and_not.json": "Trigger warning to any brits:\n\nThe obvious point here is that the idea of a monarchy is out of date. Not only\nare the successors chosen by blood rather than democratic consensus, but the\npeople of the UK get especially little in return for funding the family’s\nlifestyle given that governance is…",
  "data/reddit-changemyview/r/changemyview/comments/oimpya/cmv_men_who_reject_fatherhood_from_the_onset_of.json": "If women have their escape from the responsibility of a child (not bashing\nabortions btw) then I believe the same opportunity should be handed to the man.\nIt's unfair and frankly doesn't make much sense to say guys got to choose when\nthey decided to have sex, regardless of protection, knowing that's…",
  "data/reddit-changemyview/r/changemyview/comments/oior64/cmv_for_environmental_reasons_it_should_be.json": "The production of clothes consumes resources and generates pollution. Hence one\nof the things we can do to protect the environment is to buy less new clothes\nand use our existing clothes for longer. I am not interested in discussing what\nfraction of our environmental footprint this constitutes. This…",
  "data/reddit-changemyview/r/changemyview/comments/oirgug/cmv_millennials_are_more_techliterate_than_zoomers.json": "I don’t buy the idea of every generation being more tech-literate than the\nprevious one, especially praising zoomers as ’digital natives’. In fact, I think\nmillennials vastly outperform zoomers on this metric. Sure, we might not use\nTikTok and other recent fads, but we had to do a massive amount…",
  "data/reddit-changemyview/r/changemyview/comments/oiud13/cmv_men_should_not_automatically_be_shamed_for.json": "I often see videos with men who are being violently attacked by women and then\nonce the man tries to fight back he is slandered, and sometimes arrested. Some\nbystanders automatically assume the woman did nothing wrong and the man is just\nbeating on a poor innocent girl.\n\nShaming men for defending…",
  "data/reddit-changemyview/r/changemyview/comments/oiy4fc/cmv_socialism_and_capitalism_have_ceased_to_be.json": "These days, the terms ‘socialism’ and ‘capitalism’ are intensely polarizing and\nlead to huge disagreements on policy. They’re such lightning-rod terms that\npeople apply them as labels to anything they agree or disagree with as though\nthat descriptor alone is sufficient to decide the argument.\n\nAt…",
  "data/reddit-changemyview/r/changemyview/comments/oj5h8c/cmv_sex_work_should_be_treated_the_same_way_other.json": "Sex work has always existed in society in one form or another. Whether it be\nprostitution, domination, adult entertainment or even acting. Therefore, I\nbelieve that in our modern era, it should be held in the same regard as most\nother jobs.\n\nIf you are against sex work, it may be because you picture…",
  "data/reddit-changemyview/r/changemyview/comments/oj5p2h/cmv_calling_white_people_colonizers_and_terms_of.json": "Please help me either change my view or gain context and perspective because as\na white lesson I’m having trouble understanding, but want to listen to the\nvoices that actually matter. I’ve tried to learn in other settings, but this is\na sensitive subject and I feel like more often than not emotions…",
  "data/reddit-changemyview/r/changemyview/comments/ojg36d/cmv_if_you_rape_and_murder_two_15_year_old_girls.json": "Referencing the upcoming release of Colin Pitchfork, who raped and murder two\nschoolgirls in the 1980’s.\n\nhttps://news.sky.com/story/colin-pitchfork-man-raped-and-murdered-two-schoolgirls-to-be-released-after-government-loses-challenge-12354840\n\nThis person should never be released, no matter how…",
  "data/reddit-changemyview/r/changemyview/comments/ojj4sk/cmv_just_because_someone_gets_in_a_fight_with_a.json": "I actually want my view to be changed on this because everyone that I know acts\nlike it is an undeniable fact\n\nSo we all know the videos lately, a Karen or some other person gets in a fight\nwith a minority, video gets uploaded to the web and the person is ridiculed\nloses job etc etc for being…",
  "data/reddit-changemyview/r/changemyview/comments/ojnu9v/cmv_the_term_karen_is_used_way_too_much_to.json": "HEARMEOUT\n\nI get it. Ever since that first Karen stepped out of the woodwork, haircut and\nall, asking to immediately speak with the manager over some ridiculously minute\nissue thing while mistreating the the hardworking, we’ve all been on high alert\nfor this behavior.\n\nHowever, now I’m seeing the…",
  "data/reddit-changemyview/r/changemyview/comments/ojs045/cmv_knowledge_is_the_best_superpower.json": "Over the last week I have seen a lot of debate here over the best superpowers .\nI am here to give my opinion on the matter. The ability to know whatever you\nwant to know at any point in time is the best superpower. From a practical\nperspective you could learn a new language and how to get a better…",
  "data/reddit-changemyview/r/changemyview/comments/ojwfsu/cmv_categorizing_twitter_posts_on_reddit_by_the.json": "Give me one legitimate reason why it benefits anybody to have any category on\nReddit for what color their skin is. If we are ever going to get over racism and\nsegregation we should stop encouraging it here.\n\nIf we are going to have dedicated subs for Twitter reposts why not make\nFunnyTwitter,…",
  "data/reddit-changemyview/r/changemyview/comments/ok4y49/cmv_the_us_media_frequently_uses_propaganda_to.json": "The powers at be are terrified of what a unified lower and middle class focused\non bettering their communities are capable of. They fracture communities by\nmaking the groups of people within them believe that they are fundamentally\ndifferent and have reason to hate each other with identity politics…",
  "data/reddit-changemyview/r/changemyview/comments/ok5e8o/cmv_casting_historically_inaccurate_races_in.json": "Don't get me wrong I believe ardently in representation. I believe that it makes\na huge difference for historically disadvantaged and persecuted populations to\nsee themselves in pop culture. I also know the benefit that has on society\nbroadly, so I'm conflicted. I know that many actors of color want…",
  "data/reddit-changemyview/r/changemyview/comments/ok8v1b/cmv_there_arent_as_many_programming_jobs_as.json": "Everywhere you look everyone is telling you that programming is the best career\nchoice and that if you want a good like all you need to do is learn to code but\nthere is no way there are enough jobs for everyone. I recognize that the number\nof programming jobs are increasing but with how many people…",
  "data/reddit-changemyview/r/changemyview/comments/okfl56/cmv_the_insurrectionist_lady_deserved_to_get_shot.json": "I find it odd that the so-called \"pro-law enforcement\" crowd can't see how\ntrespassing and ransacking the Capitol and violently trying to stop the\ncertification of the nation's next President isn't something that should be met\nwith dire consequences. These same people would say that a thief being…",
  "data/reddit-changemyview/r/changemyview/comments/okg183/cmv_casual_sex_is_like_using_someone_elses_body.json": "When there is no genuine connection, no feelings, no built-up tension, no\ncourtship, and you jump right into sex, often you feel... nothing.\n\nJust the mechanical physical pleasure. Perhaps some first time awkwardness.\nMaybe some emptiness afterwards. But overall the experience of sleeping…",
  "data/reddit-changemyview/r/changemyview/comments/oklapn/cmv_influencers_should_not_be_expected_to_speak.json": "I could be totally wrong about this, but it really irks me.\n\nWhenever there's a new social issue spreading around social media, most\ninfluencer's comments are flooded with people aggressively pushing them to talk\nabout it. While it's great if the influencer does choose to spread awareness\nabout it,…",
  "data/reddit-changemyview/r/changemyview/comments/okq3dx/cmv_fur_is_no_morally_different_than_leather.json": "Edit: for practical purposes in the discussion, I am not addressing specific\ncases like people who do not have access to plant based alternatives to meat, or\nno access to clothing alternatives to fur. I am talking only about most the\nurban population with resources.\n\nIn terms of morals, there is no…",
  "data/reddit-changemyview/r/changemyview/comments/okrat2/cmv_if_worker_coopts_are_really_that_much_better.json": "Really rather simple. There is absolutely nothing forbidding worker co-opts in a\ncapitalist nation. If you and a bunch of other workers want to build your own\nfactory and own it together. Even if there is 100s of you. You are free to do\nso. In fact your rights as owners will be protected whether…",
  "data/reddit-changemyview/r/changemyview/comments/oksx5h/cmv_police_officers_should_not_be_considered_a.json": "Recently a woman in Utah was charged with hate crime for stepping on pro-police\n\"Back the Blue\" sign. I realize that officers are not a federally protected\nclass (Race, Color, Religion or creed, Sex, Age, etc.), so I will be referring\nto the state law, specifically SB 103, VICTIM TARGETING PENALTY…",
  "data/reddit-changemyview/r/changemyview/comments/oktc0i/cmv_the_royal_family_has_used_meghan_markle_as_a.json": "Prince Andrew has his involvement with Epstein seems to be completely overlooked\nand everyone forgets about how he's been protected since the scandal broke out,\nyet the media makes mincemeat out of Harry and Meghan. Are the two of those\ntogether really a coincidence?\n\nOkay, maybe Meghan is an…",
  "data/reddit-changemyview/r/changemyview/comments/oky8o0/cmv_political_affiliation_should_not_be_treated.json": "I've seen a lot of grumblings lately that \"political affiliation should be a\nprotected class\" like race, gender, etc or that people think it's \"unfair\" to\njudge someone based on political affiliation. My main issue with this is that\npolitical affiliation is not at all comparable to innocuous, often…",
  "data/reddit-changemyview/r/changemyview/comments/ol5qm4/cmv_our_lives_are_entirely_luck_and_the.json": "None of us get to choose anything about ourselves. We don't choose our parents,\nwhere we're born, or how much money we have grown up. We don't get to choose our\nbrain, our body, or any of our genetic traits. If we have the drive to work hard\nand achieve despite adversity, that motivation is also a…",
  "data/reddit-changemyview/r/changemyview/comments/ol67fz/cmv_cultural_appropriation_is_not_a_real_thing.json": "I studied Sociology for a whole year before changing Majors (it wasn't really\nfor me), and one of the ideas, that one of my teachers was more eager to teach\nus was, Hegemony and Cultural Appropriation.\n\nSince I left, I've been thinking, cultural appropriation is at least, a\ncontradictary…",
  "data/reddit-changemyview/r/changemyview/comments/ol7chi/cmv_minimum_word_requirements_are_unhelpful.json": "In this scenario, I’m referring to the situation found in school or certain\nworkplaces where essays or similar pieces of writing are rejected or fail if\nthey are not of at least a certain length. That length is sometimes expressed in\npages (X sides of A4 in Y font of Z size), or word count. There…",
  "data/reddit-changemyview/r/changemyview/comments/ol8d56/cmv_political_correctness_is_just_self_righteous.json": "PC is just a way for narcissistic people to feel better about themselves by\nacting like self righteous, better than everyone else try hards. I understand\nthat purposely trying to upset someone with racism or homophobic slurs, and\nthings like that to upset someone is uncalled for but like other…",
  "data/reddit-changemyview/r/changemyview/comments/ol91wo/cmv_i_dont_care_you_have_kids_in_the_workplace.json": "I’m in my mid 30’s and am a Sales Manager for a large company. For the record my\ncompany is fantastic and I’ve never had an issue in any way with them - but in\nmy career I’ve experienced and observed an imbalance that rarely seems to be\nspoken but it’s real: if you’re not engaged, married or have a…",
  "data/reddit-changemyview/r/changemyview/comments/olb0tk/cmv_women_only_clubs_are_discriminatory.json": "I'm a bit loss for words here. The [public middle] school has a \"technology\nclub\" that my son wanted to join. He was super excited.\n\nBut apparently he misread the flyer and it's only for girls. When I read the\nflyer, I told him he probably couldn't join.\n\nObviously he was super disappointed and…",
  "data/reddit-changemyview/r/changemyview/comments/olexr1/cmv_sizing_for_womens_clothing_should_be_based_on.json": "I'm willing to be flexible on casual wear, since things like t-shirts or sweats\nare generally sold in small, medium, etc for men's / women's / unisex styles and\nfit is usually less crucial. But for pants, dresses, formalwear - anything where\na more precise fit is important and men's clothing is…",
  "data/reddit-changemyview/r/changemyview/comments/oli0eu/cmv_there_should_be_much_stronger_regulation_of.json": "Firstly, I want to argue why I believe advertisers have become so efficient in\nthe modern age. Secondly, I want to argue why I believe they should be strongly\nregulated.\n\nThe reality is that in our current technological climate, money talks, and it\ntalks loud. Not only is it loud, but it talks…",
  "data/reddit-changemyview/r/changemyview/comments/olrc34/cmv_when_typing_a_penis_emote_it_is_better_to_use.json": "So, I'm sure, at some point, you've all typed a penis emote like this: 8=====D.\nLooks alright, right? Not to me. I much prefer typing it like this: 6=====D, and\nI have substantial evidence to back up why in this case, 6 > 8.\n\nMy reasons:\n\n 1. An 8 as balls in the emote looks like a literal…",
  "data/reddit-changemyview/r/changemyview/comments/om0fk5/cmv_democracy_in_its_current_format_does_not.json": "Given that elections happen every 4 years, parties are incentivised to make\nshort term improvements that may be at a long term detriment in order to win\nvotes and stay in power. Also on this, any long term benefits seem to get mopped\nup by the next party in power who take the credit for it. (trump…",
  "data/reddit-changemyview/r/changemyview/comments/om5fya/cmv_all_advertising_should_be_disclaimed_as_such.json": "I believe the UK already does this, requiring any advertising of any kind to\nhave big obvious disclaimers that it is in fact an advertisement. If there is\nproduct placement in a movie, disclaimer, if there is a meme or post on Reddit\nthat was created as a marketing scheme, (yes, I am particularly…",
  "data/reddit-changemyview/r/changemyview/comments/om5l3l/cmv_if_the_purge_was_real_the_population_of_the.json": "I saw the first Purge movie… and hated it. Horrible movie, the characters were\nannoyingly stupid and I think the idea as a whole was pretty moronic.\n\nIf the purge was to actually happen, I believe that a good amount (meaning\nmillions) of Americans would leave the country for the purge, wait it out…",
  "data/reddit-changemyview/r/changemyview/comments/om64fd/cmv_religiousbased_prohibitiondiscouragement_of.json": "As a high school teacher in a low income neighborhood, I have noticed that the\nprevailing religion is Roman Catholic (and other Catholic spin-offs I suppose).\n\nI’ve also noticed that many of my students do not go to college, come from big\nfamilies, and many start having kids very young. College…",
  "data/reddit-changemyview/r/changemyview/comments/om6geq/cmv_posts_from_people_under_the_age_of_18_should.json": "My main reasoning behind this is that the advice on these types of subs seems to\nbe hyperbolic at best and life ruining at worst. The users tend to give advise\nto fulfill revenge fantasies, or murdered by words fantasies, rather than advice\nthat has the poster’s best interest in mind.\n\nThere is also…",
  "data/reddit-changemyview/r/changemyview/comments/om9cfu/cmv_the_vast_majority_of_the_top_posts_on.json": "r/AmItheAsshole [https://www.reddit.com/r/AmItheAsshole/] has some genuinely\ntough situations where people seem to truly not know if they're in the wrong and\nseem to feel conflicted about difficult situations, but the vast majority of the\nones that make it to Hot and r/all [/r/all]—i.e., the most…",
  "data/reddit-changemyview/r/changemyview/comments/omd54g/cmv_cruise_ships_are_the_most_obscene_way_for.json": "Cruise ships might be the most obscene “vacations” society has come up with. To\nstart, the companies, for example Carnival or Royal Caribbean, are based in the\nUS but because of absurd maritime law, fly flags of countries with little to no\ntax responsibility (Carnival in Panama and Royal in…",
  "data/reddit-changemyview/r/changemyview/comments/omfp29/cmv_i_think_the_government_should_introduce.json": "So Glen Greenwald wrote an article detailing Nancy and Paul Pelosi’s stock\nportfolio. 75% of their stock trading over the last 2 years was in big tech\ncompanies in Silicon Valley. That has happened as major legislation is pending\nbefore the house, which is controlled by committees overseen by Nancy…",
  "data/reddit-changemyview/r/changemyview/comments/omgs2e/cmv_euthanasia_should_be_widely_legalized_for_all.json": "It's a much better alternative to more grandiose methods of suicide which can\ncause harm to other people and also stand to put the suicider's family in the\nlimelight. Since we don't get to choose to be born, I don't see why it should be\ntaboo to allow people to choose to stop being alive. And I…",
  "data/reddit-changemyview/r/changemyview/comments/omh7j0/cmv_if_you_are_opposed_to_mask_mandates_but_not.json": "I don’t like wearing a mask that covers my face. It makes talking to people more\ndifficult, sneezing in them is nasty until you can change it out. It’s not hard\nto understand not liking them. I don’t like wearing a seatbelt. It’s not as\ncomfortable as not having one on. However, the laws that…",
  "data/reddit-changemyview/r/changemyview/comments/omik3b/cmv_body_positivity_is_a_dangerous_mindset_to.json": "To be clear, I don't think body positivity is a bad thing. I think it's a\nfantastic mindset in a world where uncommonly attractive body types lead the\ncharge of modern media. Be it through a Netflix show or a perfume ad at a train\nstation, it's easy to feel undeservedly hard on yourself when you…",
  "data/reddit-changemyview/r/changemyview/comments/omkg7z/cmv_there_is_nothing_wrong_with_swearing.json": "For obvious reasons, this post will include swear words.\n\nEdit: u/bluepillarmy [/u/bluepillarmy] has successfully changed my broad view on\nswearing, on the basis that it's a formality issue where it's considered rude to\nswear around people you are not close with, and close friends tend not to…",
  "data/reddit-changemyview/r/changemyview/comments/omn37w/cmv_racism_can_never_be_fully_eradicated_it_can.json": "Racism has existed for all of human history. There has never, in the history of\nexistence, been a single person who was 100% not racist. Never. Even you reading\nthis. We are all innately prejudiced. Through how we are raised/taught, some of\nus are more outwardly racist than others, but we all…",
  "data/reddit-changemyview/r/changemyview/comments/omqxgm/cmv_the_temporarily_embarrassed_millionaire.json": "John Steinbeck once said that \"socialism never took root in America because the\npoor see themselves not as an exploited proletariat but as temporarily\nembarrassed millionaires\". Lately, I've seen a lot of people use this argument\n(mostly on reddit) when someone defends millionaires or billionaires…",
  "data/reddit-changemyview/r/changemyview/comments/omrbmc/cmv_antihunting_is_peak_human_arrogance.json": "Keep in mind, when I say this, I’m not referring to unregulated hunting or the\npoaching of endangered or threatened animals. Many of the people who hate\nhunting argue that it’s cruel to kill animals despite having no problems with\npredators killing other animals, as if we’re “above” them and no…",
  "data/reddit-changemyview/r/changemyview/comments/omveo8/cmv_every_fine_should_be_income_based_no.json": "This is the only fair way to financially punish someone, whether you should do\nthat in the first place is a topic for another day.\n\nThe only way you can make sure rich people won't just shrug and metaphorically\nthrow a moneybag at every policeman who wants justice is to make them pay a\npercentage of…",
  "data/reddit-changemyview/r/changemyview/comments/on5k26/cmv_we_should_revert_back_to_taking_the_seen.json": "While technology has made it much easier for us to connect with each other, as\nwell as reconnect with people we wouldn't have been able to contact otherwise,\nthe constant pressure of needing to reply to people instantly after reading a\nmessage does more harm than good.\n\nI feel the more this feature…",
  "data/reddit-changemyview/r/changemyview/comments/ond9ob/cmv_we_all_should_have_the_right_to_scrutinize.json": "I was raised in a Christian family and had lived in several countries in Europe,\nworked with people from every possible background. I consider myself spiritual\nbut outside of any organized religion.\n\nI believe religion should be mocked because historically religious institutions\nhave used the…",
  "data/reddit-changemyview/r/changemyview/comments/onhpyz/cmv_parents_who_refuse_to_take_their_screaming.json": "I posted this in another sub but that may have been a biased audience so I want\nto put this out to CMV for a broader sample.\n\nIt just seems as though the parent lacks empathy for others and general\ncourtesy. I would be willing to bet if you said anything to them or looked at\nthem, you would get a…",
  "data/reddit-changemyview/r/changemyview/comments/onpyo3/cmv_neopronouns_is_just_attention_seeking_with.json": "I have no problem with he/she/they (even they's a little iffy since it's plural\nbut it's not that huge deal). But I've now started educating myself on the crazy\nworld of so called \"Neo Pronouns\". If you're not in the loop these are a bunch\nof made up words for people who claim they dont fit in the…",
  "data/reddit-changemyview/r/changemyview/comments/onq03a/cmv_public_eating_areas_should_have_handwashing.json": "I live in the USA and am constantly frustrated by how public establishments only\nprovide hand-washing sinks inside of restrooms. This makes it very inconvenient\nto wash hands on a regular basis, such as before eating a meal in a restaurant.\nI can recall a single restaurant that had a sink in the…",
  "data/reddit-changemyview/r/changemyview/comments/onznld/cmv_life_is_going_to_get_progressively_worse_for.json": "Ok so just on a very basic inescapable level, climate change. Freezing winters\nand intense record breaking summer heatwaves are only set to get worse and I've\nzero faith in humanity that we'll find a solution (and implement it\nsuccessfully) in my life time.\n\nSecond is the widening economic gap…",
  "data/reddit-changemyview/r/changemyview/comments/oo4lkf/cmv_requiring_vaccines_does_not_unduly_restrict.json": "Every society enacts laws that in some way diminish individual freedoms for the\noverall good of that society.\n\nThis is why we have laws that regulate how fast you can drive, define the age of\nconsent, punish theft, etc...\n\nSure, it’s fun driving around at 100+ mph but it also creates a dangerous…",
  "data/reddit-changemyview/r/changemyview/comments/oo4v9e/cmv_penalizing_an_athlete_for_their_naturalborn.json": "I made the title pretty broad, but I am specifically referring to the cases\nwhere namibian athletes were banned\n[https://www.cnn.com/2021/07/06/us/black-women-athletes-treatment-olympics-spt/index.html]\nfrom certain races because their naturally high testosterone levels.\n\nI've been mulling it over…",
  "data/reddit-changemyview/r/changemyview/comments/oo6ysm/cmv_in_popular_destination_cities_airbnb_does_way.json": "I think it's ironic that a website that started out as a way of finding a place\nto crash, getting hosted by a local, and having a more \"authentic\" experience,\nis now the reason why you can't have an authentic experience.\n\nFirst off I should say that my first experience on AirBnB was back in…",
  "data/reddit-changemyview/r/changemyview/comments/oocl49/cmv_if_voter_id_laws_are_racist_because.json": "If the types of voter ID laws in Georgia and the kind that democrats fled from\nTexas to block are racist then why aren't we focused on making sure\ndisadvantaged groups have access to DMVs or organizations where you can get an\nID? The only thing the claims of racism seem to rest on is that minority…",
  "data/reddit-changemyview/r/changemyview/comments/ooctq5/cmv_if_you_lock_90_of_your_games_content_behind_a.json": "This is my view on the games industry. I vote with my wallet. I do not like how\nmany games lock the majority of their content behind bullshit paywalls and free\nto play tactics, it's scummy as fuck, I pay full price for a game to get all the\ncontent. If the only way for me to get to play all the…",
  "data/reddit-changemyview/r/changemyview/comments/oofhz0/cmv_while_we_should_love_disabled_people_for.json": "This might be a universal truth among all people, but I’ve never actually\ndiscussed it with others, but I feel that it’s possible to celebrate disabled\npeople and include them in as many activities as possible while also wishing\nthey were completely healthy. I understand that discussing Down…",
  "data/reddit-changemyview/r/changemyview/comments/oolkmt/cmv_the_olympics_are_becoming_increasingly_less.json": "With all the social media available we see what these athletes do 24/7 and how\nthey train. The main countries in the Olympics that consistently podium athletes\nare relatively at peace so there is little national competition. Seeing these\nathletes on social media and outside of the Olympics is like…",
  "data/reddit-changemyview/r/changemyview/comments/oorsmf/cmv_not_accepting_a_lot_of_asylum_seekers_doesnt.json": "Background: As a swede, this perspective comes primarily from the past\nimmigration politics during the 2015 refugee crisis, where Sweden were the 2nd\nhighest European country in new asylum applications per capita. The country\nfailed to integrate a lot of these people into society, and it led to a…",
  "data/reddit-changemyview/r/changemyview/comments/ooshdt/cmv_people_will_get_covid_going_forward_its_part.json": "Why are people worried so much about breakthrough COVID cases if the data says\nyou will likely be fine if vaccinated? We are not trying to 100% prevent COVID\nas that is not what vaccines do, they are just priming the immune system for\nwhen it encounters COVID. Everyone I know is adamant about…",
  "data/reddit-changemyview/r/changemyview/comments/oosv7r/cmv_minnesota_state_rep_john_thompson_should_be.json": "First of all...what does it mean for a State Representative to be censured?\n\n> Censure is a formal, and public, group condemnation of an individual, often a\n> group member, whose actions run counter to the group's acceptable standards\n> for individual behavior. In the United States, governmental…",
  "data/reddit-changemyview/r/changemyview/comments/op0gja/cmv_unless_you_are_a_white_supremacist_there_is.json": "Caucasians arent a monolith; they extend from Europe to india. There are\nHundreds of different cultures, And Hundereds of different traditions.\n\nEven in europe, the modern \"white\" there are dozens of different groups.\n\nSo whats the white cultural identity? Its not really there. And that makes…",
  "data/reddit-changemyview/r/changemyview/comments/op20at/cmv_dislikes_or_equivalents_are_good_and_most.json": "Recently, Twitter has been looking into adding dislikes to their platform. I\nthink this is actually a good idea, and in the long run will mitigate toxicity\non the platform.\n\nI know that at first it might seem like a dislike or negative rating feature\nwill exacerbate toxicity, but I believe the…",
  "data/reddit-changemyview/r/changemyview/comments/op6dll/cmv_being_attractive_is_one_of_the_most_important.json": "First off, being physically attractive doesn't mean someone looks like a model,\nbut taking care of themselves in a variety of ways such as having good hygiene,\ndressing well and not being overweight can turn a below average person into an\nattractive person. No one is saying you have to be a 10/10 to…",
  "data/reddit-changemyview/r/changemyview/comments/op93rs/cmv_being_a_member_of_a_historically_oppressed.json": "Apparently, this is a controversial view. I remember posting this on tumblr a\nwhile back and my \"friend\" wanted me to remove it. That friend later turned out\nto also be my abuser. So, I don't put much stock in certain opposing views. I\nhave a lot of reasons for why I believe in these views.\n\nI don't…",
  "data/reddit-changemyview/r/changemyview/comments/opcyut/cmv_the_us_government_rather_than_us_billionaires.json": "Defining some of the terms and clarifying the argument.\n\n\"American prosperity\" is a catch-all for progress in this case. Like people want\nto work less, have access to better healthcare, less inflation, affordable\nhousing, etc.\n\nBy \"issue\" I mean that the government is preventing prosperity and/or…",
  "data/reddit-changemyview/r/changemyview/comments/opdk5h/cmv_a_country_prioritizing_its_citizens_is_the.json": "Yesterday i made a post\n[https://www.reddit.com/r/changemyview/comments/oorsmf/cmv_not_accepting_a_lot_of_asylum_seekers_doesnt/]\nabout morality and refugees, and while there was a lot of discussion happening,\nI realized that by using a real-world example, and trying to argue about a\ntheoretical…",
  "data/reddit-changemyview/r/changemyview/comments/opdpey/cmv_people_shouldnt_lose_their_jobs_be_socially.json": "Edit : hi all, wasn't expecting quite so many responses. I will read through and\nrespond accordingly in due course! Thanks! Great discussion so far.\n\nWe often say things like 'people change' , or 'everyone should be given a second\nchance' , and yet we see countless examples of celebrities or other…",
  "data/reddit-changemyview/r/changemyview/comments/opfg96/cmv_the_catholic_church_has_no_place_in_the.json": "Sure the current Pope is kinda cool, but it's basically just a pedophilia ring\nwith a god-complex. To my mind the Catholic church has basically never done any\ngood and also started the crusades so they're actually worse than Al-Qaeda, as\nfar as terrorist organizations go. Don't even get me started…",
  "data/reddit-changemyview/r/changemyview/comments/opiukt/cmv_the_best_way_to_stop_crime_is_not_to_have.json": "Right now there is a debate over crime and the way to stop it. Certain groups\nfervently maintain that we need more police and harsher punishments. That is not\ngoing to stop crime because it does nothing to fix the cause of most crime.\n\nMost crimes are caused by circumstances and need. Making sure…",
  "data/reddit-changemyview/r/changemyview/comments/opnq5b/cmv_public_perception_of_american_law_enforcement.json": "I think this is an unspoken sentiment shared by most people who are inherently\ncritical or distrustful of the American police.\n\nWhenever I hear a news story about a police officer screaming at a four year\nold, or knocking over an old man on camera, there's always initial outrage\nfollowed by \"he's on…",
  "data/reddit-changemyview/r/changemyview/comments/opvm54/cmv_folks_need_to_recognize_that_there_are_people.json": "I see it in debates about Abortion. Pro-Choicers are often eager to say that the\nonly arguments the Pro-Life crowd can go off from is by an outdated appeal to\nreligion when there are people in the discussion who don't subscribe to said\nreligion. There are those who go as far as to claim that every…",
  "data/reddit-changemyview/r/changemyview/comments/opvuwl/cmv_convenience_charges_and_other_surcharges_are.json": "Convenience charges are a point of sale charge of around 5% of the sale,\nintended to suposedly cover \"credit and debit processing fees for non standard\nforms of payment\". In my experience as a cashier, 95% of pos transactions are in\ncards. How is that \"non-standard\"?\n\nSince debit-credit usage is so…",
  "data/reddit-changemyview/r/changemyview/comments/oq10bd/cmv_im_reluctant_to_get_an_electric_car_because.json": "I try and spend as little time as possible at the gas station because it feels\nunsafe. I understand that a lot of men won't know what that's like or even give\nit a second thought. I like to drive across the country and it doesn't seem\nsensible for a petite woman to be sat in a $80k vehicle in the…",
  "data/reddit-changemyview/r/changemyview/comments/oq2lut/cmv_playing_video_games_as_a_single_hobby_without.json": "Basically the older I get the more I realize how annoying and obnoxious the\nvideo game community is at times.\n\nThis isn’t everyone by the way, but from the past 10 years of meeting different\npeople in the video game community, the wide majority of them are obnoxious and\nuninteresting people.\n\nI’m…",
  "data/reddit-changemyview/r/changemyview/comments/oqf90h/cmv_standing_up_to_wipe_is_far_superior_to.json": "I am a man so I can not speak on how this experience is different for women so\nthis post will be directed to my fellow men.\n\nStanding up after taking a dump allows for much easier access to ones ass. In\naddition, you do not have to maneuver your hand around your junk to reach.\nPersonally I have…",
  "data/reddit-changemyview/r/changemyview/comments/oqpsf4/cmv_i_dont_think_a_distinction_should_be_made_if.json": "Sometimes if you hear a tragedy being reported… you might hear that women and\nchildren were among the victims.\n\nI’ll give children a pass… but I don’t think it is relevant to know that women\nwere also victims. I don’t think they should stand out even more.\n\nEven in works of fiction, you might have…",
  "data/reddit-changemyview/r/changemyview/comments/oqy6s6/cmv_at_this_point_people_who_claim_that_black.json": "Hello, CMV community,\n\nMy CMV is pretty much the title. I find it hard to believe that people who take\nBLM to mean that ONLY Black Lives Matter or some variation of that are either\narguing in bad faith and/or are willfully ignorant. I believe that people who\nthink this are attempting to discredit…",
  "data/reddit-changemyview/r/changemyview/comments/or04qn/cmv_the_answer_to_the_voter_id_debate_in_the_us.json": "Edit: it should say US citizen in the latter half of the CMV I didn't catch the\ntypo and Reddit doesn't allow for title edits.\n\nThis would remove the issue that the left has about access and racism and would\ngive the right the security they want.\n\nIf everyone has free access to an ID, requiring one…",
  "data/reddit-changemyview/r/changemyview/comments/or09ur/cmv_prisoners_who_sexually_abuse_molesters_arent.json": "I need to first say, I am not in support of child molesters nor am I coming to\ntheir defense. Pedophiles and molesters are utterly disgusting.\n\nLately I’ve been seeing predator vigilantes (usually 20 year olds) confronting\ndudes and instantly beating up anyone who is accused of pedophiles. They…",
  "data/reddit-changemyview/r/changemyview/comments/or3loa/cmv_any_cop_thats_caught_planting_evidence_could.json": "EDIT: title should read “should” not “could”\n\nPretty straight forward and simple. They should be federally barred from working\nin any sort of law enforcement around the country, I’d love it if they also got\nsent to to jail but that’s another CMV.\n\nThis post was spurred by this…",
  "data/reddit-changemyview/r/changemyview/comments/or8mye/cmv_choosing_to_use_both_shethey_or_hethey.json": "Singer Halsey has recently declared she will not be doing more press after a\nmagazine “deliberately disrespected” her after misusing her pronouns. The\nmagazine on the cover of her article referred to her using “she/they” as she is\nhappy with either but then only used the “she”pronoun for the rest of…",
  "data/reddit-changemyview/r/changemyview/comments/oragxs/cmv_we_need_nuclear_or_fossil_fuel_power_plants.json": "Hello,\n\nso this is something I would like to have my mind changed or updated about.\nBasically, this is the oldest argument against renewable energy. I thought and\nstill think this is a serious problem when it comes to transforming our energy\ngeneration, but it seems to be less of a concern in public…",
  "data/reddit-changemyview/r/changemyview/comments/orj12f/cmv_conspiracy_theories_run_rampant_because_our.json": "Almost every authority figure in politics is known to lie and twist the truth.\nI'M no historical scholar but it seems that has been the case for generations.\nWe allow them to lie to us and believe what we want to when we want to.\nBelieving known liars is dumber than believing conspiracy nonsense,…",
  "data/reddit-changemyview/r/changemyview/comments/orj6za/cmv_a_lot_of_ruleslawspolicies_that_are_meant_to.json": "Reddit's policy for example regarding their #1 rule is no harassment, bullying,\netc. A stipulation of the rule is that it only applies to groups that actually\nface harassment, so not white people or men (this is actually the official\nstance of reddit admins)\n\nDo rules like this not basically say…",
  "data/reddit-changemyview/r/changemyview/comments/ork9l0/cmv_americans_are_the_most_heavily_propagandized.json": "First off, I'm not saying that Americans are stupid. Seriously.\n\nI've travelled a lot and lived in a few countries (including the US) and this is\na thought that I keep coming back to. Obviously there's a huge selection bias\nhere on my part (which makes this a very changeable view)\n\nChina, for…",
  "data/reddit-changemyview/r/changemyview/comments/orlp6u/cmv_making_the_olympics_essentially_pay_per_view.json": "This is US-centric since I know many countries have easier access to watching\nthe Olympics than we do here. It is impossible to legally watch the Olympics\nwithout paying for some service first, and that absolutely wrecks any enthusiasm\nI might have had for the Games. I get that the training and…",
  "data/reddit-changemyview/r/changemyview/comments/orvnvw/cmv_psychological_tests_in_job_applications_do.json": "As a hiring manager I've been contemplating this for a while. I enjoy selecting\nmy team's candidates myself and am always looking to create a well balanced high\nperforming team. I feel these tests focus too much on potential Psychological\nproblems or fits to what the company's cultural policy is,…",
  "data/reddit-changemyview/r/changemyview/comments/orzj99/cmv_the_us_should_not_reimpose.json": "Given the Following Facts:\n\n * Nearly all COVID deaths in US are now among unvaccinated\n   [https://apnews.com/article/coronavirus-pandemic-health-941fcf43d9731c76c16e7354f5d5e187]\n * Vaccination status is highly correlated with political affiliation\n   [https://jahoo.shinyapps.io/vaxpolitics/]\n *…",
  "data/reddit-changemyview/r/changemyview/comments/os08cv/cmv_wearing_camopatterns_as_a_civilian_is_not.json": "I just bought a small shoulder bag (eastpak-classic-style) ,because it was on\nsale, for a festival i will attend this week and it has a camo pattern on it. I\nwas told this could be offensive or people may dislike it and it could kill the\nvibe in the camp for example. I was surprised by this as i…",
  "data/reddit-changemyview/r/changemyview/comments/os5z4m/cmv_dental_care_should_be_included_in_the.json": "This debate is more relevant outside the US where universal free healthcare is a\nthing, more specifically european countries that have a strong healthcare system\nthat does not include dental care\n\nApparently someone at some point decided that the mouth is not a part of the\nhuman body (?). I am…",
  "data/reddit-changemyview/r/changemyview/comments/os8pwd/cmv_nuclear_power_while_dangerous_at_times_is_as.json": "There’s been a push for decades now against nuclear power plants and the dangers\nthat come with it. Using examples such as the Chernobyl and Fukushima nuclear\ndisasters, but while these were tragic, this doesn’t represents nuclear safety\nand the benefits that nuclear power has as a whole.\n\n75% of…",
  "data/reddit-changemyview/r/changemyview/comments/oshkkh/cmv_if_your_shower_thoughts_are_your_most.json": "Shower thought are known to be these weird or interesting thoughts, that you\ncould only think about about in the shower. My friends were talking about this,\nand there was a consensus between them that their best thoughts come to them in\nthe shower. There's even a subreddit for these interesting…",
  "data/reddit-changemyview/r/changemyview/comments/oskctm/cmv_academia_isnt_biased_towards_leftwing.json": "Okay, so I am aware that this may upset some people, but hear me out.\n\nAcademia is all about observing reality as it is - as indepently as possible\nfrom cultural and societal expectations we may have - and then if these facts\ncontradict what we previously thought abandon our previous assumptions and…",
  "data/reddit-changemyview/r/changemyview/comments/osksnn/cmv_if_dressage_can_be_considered_an_olympic.json": "To me it seems that dressage is just training a horse to dance. It's about the\nrider ensuring they have trained their horse as well as they can to follow their\ncommands in order to perform the moves as accurately as possible. It doesn't\nseem to involve that much physicality from the rider. Although…",
  "data/reddit-changemyview/r/changemyview/comments/oslb6j/cmv_radical_healthcare_reform_in_america_such_as.json": "My thoughts go like this: A large (organic) reason behind anti-vax sentiment is\na distrust in the medical industry. A lot of people seem to start heading down\nthat road by having a feeling that vaccines are just a way for big pharma to\nmake more money. A lot of people in America have first hand…",
  "data/reddit-changemyview/r/changemyview/comments/osmddg/cmv_people_who_make_false_rape_claims_should_get.json": "Over the past years, false rape claims seem to be popping up everywhere with the\npeople being accused having their life ruined while the people playing victim go\nscot free.\n\nNot only do I believe they should go to prison for these false claim, but get\nthe same amount of time as the accused would…",
  "data/reddit-changemyview/r/changemyview/comments/osmu8n/cmv_every_human_on_earth_needs_a_entire.json": "Title says it all. I’m flabbergasted by the amount of people who don’t pay\nattention to what’s happening around them.\n\nI’ve witnessed many accidents involving vehicles and people just plain getting\nhurt because they aren’t paying attention to the landscape or environment\nthey’re in.\n\nThis includes…",
  "data/reddit-changemyview/r/changemyview/comments/osp0nz/cmv_here_in_the_united_states_of_americausa_adult.json": "First of all, I think every choice that doesn't affect, or harm someone should\nbe legalized. Adult prostitution(18 years old, and older) is generally a mutual\nagreement between both adults. One adult pays the other adult for intimate\nrelations, and they both agree on it. This means one adult has the…",
  "data/reddit-changemyview/r/changemyview/comments/osp1i8/cmv_the_jan_6_commission_will_not_hold_anyone.json": "It seems like the people that need to hear the commission are the ones least\nlikely to tune in. At best they’ll get cherry picked clips by their favored\nmedia source and have media personalities shape their outlook.\n\nWe saw during the impeachment trials that subpoenas can just be ignored with…",
  "data/reddit-changemyview/r/changemyview/comments/ospk4x/cmv_simone_biles_bailing_on_the_final_rotation_of.json": "BIG preface: When Naomi Osaka withdrew from the French Open instead of being\nforced to do press conferences, I was hype, and so proud of that woman for\nstanding up for mental health.\n\nI am a massive proponent of mental health awareness, and removing the stigma\naround it. This is not a 'shut up and…",
  "data/reddit-changemyview/r/changemyview/comments/ostfak/cmv_most_modern_day_movement_instill_victim.json": "i guess a major reason why i have a hard time supporting most movements is i\njust really, and i mean really dont like victim mentalities.\n\ni’ve always been at my worst as a person when i felt like a victim of someone\nelse, and felt justified of my bad actions after the fact.\n\ni’ve definitely had to…",
  "data/reddit-changemyview/r/changemyview/comments/osz59q/cmv_if_i_am_vaccinated_i_shouldnt_be_mandated_to.json": "I've done everything we were supposed to over the past year or so. I've socially\ndistanced, I've worn my mask everywhere, I've tried to stay home, and I've\ngotten the vaccine as soon as I could. The only people I know who aren't\nvaccinated, at least in my area, simply don't want it. Why should I be…",
  "data/reddit-changemyview/r/changemyview/comments/ot0zb5/cmv_the_death_penalty_should_be_given_to_people.json": "Modern day slavery is one of the biggest jokes in western democracies like the\nU.S. that advocates against slavery. Slavery never went away, it's a total joke\nthat people care more about inmates labor being exploited when they're still\nbeing treated humanly under the law compared to the families…",
  "data/reddit-changemyview/r/changemyview/comments/ot3puu/cmv_blm_movement_has_really_been_taken_over_by.json": "Ok before anything. I do believe Black Lives Matter. I just don’t support the\nmovement anymore. As a latino in 2020 seeing all the police brutality and\nmistreatment really resonated with me, so I stood with the black community\nduring the hight of the movement. But once Latinos, Muslims, Asians,…",
  "data/reddit-changemyview/r/changemyview/comments/otbfy2/cmv_microaggressions_should_take_intent_into.json": "I was required by my company to participate in DEI (Diversity Equity and\nInclusion) training that stated, \"It does not matter what the aggressor\nintended, harm was caused.\" While I understand where this logic comes from, it\nis a poor principle for the workplace, justice, or society.\n\nLet me use a…",
  "data/reddit-changemyview/r/changemyview/comments/otgata/cmv_conspiracy_theories_arent_inherently_invalid.json": "I’d like to begin with a disclaimer that the examples I use in this post are\njust examples, and may or may not reflect my personal views. I will try not to\ntake a side on any particular theory, and instead just state the theory.\n\nA conspiracy theory is a theory that explains an event or set of…",
  "data/reddit-changemyview/r/changemyview/comments/otjjxp/cmv_its_absolutely_ridiculous_that_religion_is.json": "Now don’t get me wrong, I still think that science should be challenged; that’s\nwhat science is all about, challenging hypothesis’s with other concrete ideas to\nform a theory or possibly a fact. But religion has no place what so ever in\nchallenging scientific theories and ideas.\n\nReligion was…",
  "data/reddit-changemyview/r/changemyview/comments/otmxoh/cmv_there_is_nothing_inherent_about_whiteness.json": "Conquer*\n\nThere are many people who have a misconception of native americans being one\nhomogeneous group. This was not the case. War and conflict was not something\nintroduced to the americas by the european. There were many different native\namerican tribes with conflicting ideals and interests that…",
  "data/reddit-changemyview/r/changemyview/comments/otsj77/cmv_allowing_russia_to_compete_as_roc_in_the.json": "So to start, I do not believe allowing the Russian team to compete under the\nname ROC, or Russian Olympic Committee, is a fair punishment. I believe that\nbecause Russia is still in the name they're competing under, the intended\npunishment is missed.\n\nInstead of competing under that title, I believe…",
  "data/reddit-changemyview/r/changemyview/comments/otsvkj/cmv_debating_religion_is_impossible_because_the.json": "I've tried debating reliigon many times, and one fundamental flaw is that\nreligious people always start from the the stance that gos IS real. This breaks\nthe basic rules of debate. The existance of god is a positive claim, and you\nhave to bring evidence to support the claim, else it is inherently…",
  "data/reddit-changemyview/r/changemyview/comments/otwng0/cmv_we_can_only_achieve_equality_through.json": "This generation keeps promoting what's good about certain groups and trying to\nempower them but I think all this does is swing the pendulum back the other way.\nI think the only way we will ever have true equality is by simply not caring.\n\nI think saying what's good about people is just as damaging…",
  "data/reddit-changemyview/r/changemyview/comments/otyhs5/cmv_todays_woke_culture_is_making_many_people.json": "Even though I am glad to live in a time where we more and more struggles of\nminorities and stop victim shaming. At least we try. But even though I think its\ngood that we become more understanding for people, their backgrounds and their\nindividual struggles, I hate to see how we create a society…",
  "data/reddit-changemyview/r/changemyview/comments/ou2pah/cmv_mental_health_education_has_been_neglected_on.json": "I believe, mental health education has been neglected in our society on\npurpose...\n\nWhen someone is in a negative mental health state, they tend to not see their\nown self worth and judge others due to their own insecurities. They are less\nlikely to accept new ideas.\n\nOur government needs people who…",
  "data/reddit-changemyview/r/changemyview/comments/ou3oxs/cmv_loli_is_pedophilia.json": "In my opinion, lolicon is pedophilia. Now, before you say \"oh its not real\" or\n\"oh its impossible to tell in anime\" let me explain\n\nLolicon is pedophilic because its specifically designed after a child, so by\nspecifically looking for it, youre trying to find hentai of children. If you\nstumble across…",
  "data/reddit-changemyview/r/changemyview/comments/ou3ryd/cmv_the_24hour_news_cycle_is_ruining_the_olympics.json": "NBC, its affiliate stations, and everybody else are so eager to be first with\nthe \"breaking news\" that it's nearly impossible to avoid spoilers. The winner of\nthe women's gymnastics all-around was breathlessly announced right at the start\nof NBC's afternoon programming, even though the event itself…",
  "data/reddit-changemyview/r/changemyview/comments/ou9qt9/cmv_wearing_a_mask_and_vaccine_mandates_are_not.json": "So, often I hear from Republicans that vaccine and mask mandates are about US\ngovernment control.\n\nBut this argument seems nonsensical. How can requiring wearing a mask and\ngetting a vaccine a form of government control? What does the US government\npossibly gain by giving away free vaccines and…",
  "data/reddit-changemyview/r/changemyview/comments/ou9sl8/cmv_the_us_bloated_military_budget_is_thanks_to.json": "my view is that the military has been corrupted by defense contractors.\n\nthese corporations make money off of war. former pentagon officials make up the\nstaffs of these corporations. with their connections, they’re able to skew US\nforeign policy. that foreign policy includes interventions that…",
  "data/reddit-changemyview/r/changemyview/comments/oubgfc/cmv_product_placement_advertisements_and_other.json": "Streaming TV has gotten me so spoiled on watching a constant flow of a show, as\nthe writer and director intended. When I do have to go back to live TV for\nwhatever reason, the ad breaks are so disruptive. Not just taking the time away\nfrom the show, but commercials have different volume levels,…",
  "data/reddit-changemyview/r/changemyview/comments/oudr3x/cmv_nobody_should_have_to_tailor_resumes_or_cover.json": "This also goes for forcing candidates to rewrite their entire resume in an ATS,\nthe absurdity of cottage industries that teach you to reuse words in the job\ndescription so you pass some lazily designed filter, and the idea that it's\nsomehow on you to get the attention of whoever is reviewing…",
  "data/reddit-changemyview/r/changemyview/comments/ounnoo/cmv_if_youre_taking_onlyfan_pictures_in_your.json": "Please note before anything, there is a line i'm not saying they should cat\ncall, or sexually harass you. However, if you're going to the bathroom simple\ncomments like, \"Oh you going to go punch the clock at your other job!\" or \"Don't\nforget it's a restroom, not a fan service room\" etc etc. IS well…",
  "data/reddit-changemyview/r/changemyview/comments/ourfq9/cmv_everyone_should_learn_two_foreign_languages.json": "There is strong scientific evidence that children under a certain age have a\nmuch easier time learning languages and being able to speak one is an\nincreadibly usefull tool. So in my mind, having children wait until middle or\nhigh school to start learning foreign languages is having them miss…",
  "data/reddit-changemyview/r/changemyview/comments/ouuy0m/cmv_the_way_we_treat_slurs_is_weirdly.json": "I posted on a similar subject\n[https://www.reddit.com/r/changemyview/comments/mkv0w5/cmv_normalising_the_use_of_slurs_is_bad_but_the/]\na little while ago, but didn't receive much challenge on this point in\nparticular, so I thought I should give it its own CMV. To be clear, this isn't a\npro-slurs…",
  "data/reddit-changemyview/r/changemyview/comments/ouwcvg/cmv_starting_a_post_with_throwaway_account_to.json": "I see this all the time. Someone posts a story and starts it off with \"Throwaway\naccount because I dont want anyone knowing this is me\" and then they post an\nextremely unique or specific story that will obviously be recognized by the\nperson/people they're referencing. Like do y'all really think…",
  "data/reddit-changemyview/r/changemyview/comments/ov1clv/cmv_white_people_can_experience_racism_alongside.json": "I want to start off by saying that I am not trying to downplay the racism that\nmany POC experience on a daily basis, I believe it is a huge problem and\nrequires attention to help find a solution.\n\nI often come across posts on social media of people claiming white people can't\nexperience racism. The…",
  "data/reddit-changemyview/r/changemyview/comments/ov5vt6/cmv_i_think_most_other_gender_identities_are.json": "Transgenders I’m fine with, I don’t think they’re doing it for attention other\nthan some teenage “transgenders” going through a phase\n\nBut I think a lot of non-binary people are just people who want to be special\nbecause they decided they don’t want to fit into “traditional gender roles”\nwhich is…",
  "data/reddit-changemyview/r/changemyview/comments/ov8smv/cmv_governments_are_just_organized_crime_on_a.json": "CMV: Almost everyday on the news I see articles about the government cracking\ndown on organized crime, wether it be drug cartels or cybercrime or really\nanything that isn't government owned. What they don't show you, is that your\ngovernment was probably doing these same things right behind your…",
  "data/reddit-changemyview/r/changemyview/comments/ov92pw/cmv_social_media_and_new_wave_parenting_has.json": "While I do appreciate that the younger generations are more open and accepting\nof the many ways people live life, I do think our generation has become\ninsufferably intolerant towards anyone with slightly different views.\n\nI (20M) have been raised alongside the internet and got involved in social…",
  "data/reddit-changemyview/r/changemyview/comments/ovb9rp/cmv_being_made_to_pay_taxes_to_the_government_for.json": "Universal/Socialised healthcare has greater pros than the cons, especially when\ncompared to solely privatised healthcare systems, and I really don't understand\nwhy it is not commonplace to offer universal healthcare first and foremost and\nthen have the option be able subsidise it with private…",
  "data/reddit-changemyview/r/changemyview/comments/ovepiv/cmv_as_a_vaccinated_american_telling_me_to_wear_a.json": "Vaccination is not a guarantee of not catching COVID, but the data does show\nthat the chances of hospitalization and death is negligible for vaccinated\npeople in comparison to the unvaccinated. And that’s saying a lot since many\nconsider COVID’s health risks to be negligible even before a vaccine…"
}