{
  "data/reddit-ask/r/AskHistorians/comments/n27cvw/the_science_fiction_genre_in_africa_supposedly.json": "The science fiction genre in Africa supposedly started in Cameroon with the 1932 novel Nnanga Kon and Nigeria with the 1934 novel Gandoki. What was the literary scene like in the two countries at the time? Is there any reason why those two countries in particular would be where things started?",
  "data/reddit-ask/r/AskHistorians/comments/n28ji5/was_there_an_allied_plan_for_taking_back_europe.json": "Was there an Allied plan for taking back Europe if Britain was lost to invasion? Was it to just hope the Soviets could manage it? Or to focus everything on North Africa? Both? Neither?",
  "data/reddit-ask/r/AskHistorians/comments/n2dd00/the_american_nazi_party_had_some_big_rallies_in.json": "The American Nazi Party had some big rallies in the 30s. What was the motive for its members, given how German-centric the Nazi platform was?",
  "data/reddit-ask/r/AskHistorians/comments/n2g1cd/when_did_mirrors_become_commonplace_were_people.json": "When did mirrors become commonplace? Were people cool with the idea of not really knowing what they look like day-to-day, or at all?",
  "data/reddit-ask/r/AskHistorians/comments/n2gqes/footage_of_hitlers_dead_body_im_confused_nsfw.json": "Footage of Hitler's dead body - I'm confused. (NSFW)",
  "data/reddit-ask/r/AskHistorians/comments/n2gqv3/did_american_citizens_who_identified_as_nazis.json": "Did American citizens who identified as Nazis receive treatment similar to American Japanese during WWII?",
  "data/reddit-ask/r/AskHistorians/comments/n2xzez/has_a_tornado_ever_come_into_contact_with_a_castle.json": "Has a tornado ever come into contact with a castle?",
  "data/reddit-ask/r/AskHistorians/comments/n2ykaq/how_did_georgia_and_armenia_manage_to_stay.json": "How did Georgia and Armenia manage to stay christian when they were surrounded by powerful Islamic states?",
  "data/reddit-ask/r/AskHistorians/comments/n35mkg/why_did_octavian_spare_the_children_of_cleopatra.json": "Why did Octavian spare the children of Cleopatra VII with Mark Antony in the first place?",
  "data/reddit-ask/r/AskHistorians/comments/n37v7u/what_is_up_with_this_letter_elvis_presley_wrote.json": "What is up with this letter Elvis Presley wrote to Richard Nixon about wanting to become a federal agent? Why did he write it? Was he serious? Did anyone try to stop him? How did Nixon or his staff respond, if at all?",
  "data/reddit-ask/r/AskHistorians/comments/n3bv0q/as_i_understand_it_in_the_1960s_east_germany_the.json": "As I understand it, in the 1960's, East Germany (The Deustsch Demokratic Republik) openly found evidence that Homosexuality was a natural occurrence, rather than being a mental illness. How did this affect other countries in their decisions on LGTBQ+ people, particularly in Communist nations?",
  "data/reddit-ask/r/AskHistorians/comments/n3cr0f/this_map_shows_the_empire_of_japan_at_its.json": "This map shows the Empire of Japan at it's greatest extant, what is with the small part of China that is not occupied by Japan but surrounded by it? I can't find anything about it.",
  "data/reddit-ask/r/AskHistorians/comments/n3d8tj/what_languages_might_have_been_spoken_in_britain.json": "What languages might have been spoken in Britain prior to the arrival of Celtic dialects?",
  "data/reddit-ask/r/AskHistorians/comments/n3gd4f/in_1847_the_chocktaw_nation_collected_170_to.json": "In 1847, the Chocktaw Nation collected $170 to donate to the Irish during the potato famine. Was there any correspondence shortly after?",
  "data/reddit-ask/r/AskHistorians/comments/n3tpoe/in_1975_the_un_passed_a_resolution_that_declared.json": "In 1975, the UN passed a resolution that declared Zionism racist and discriminatory. In 1991, it revoked that resolution. What happened inbetween the two dates that lead to the change in global opinion?",
  "data/reddit-ask/r/AskHistorians/comments/n3z6iz/in_1974_greece_held_a_referendum_on_whether_to.json": "In 1974, Greece held a referendum on whether to establish a republic. The former king gave televised addresses arguing for monarchy. Almost 31% of voters voted against the republic. In general, who were the Greek supporters of monarchy and what arguments or issues were important to them?",
  "data/reddit-ask/r/AskHistorians/comments/n3zy5o/the_majority_of_supreme_court_justices_appointed.json": "The majority of Supreme Court justices appointed up to Sandra Day O'Connor (1981) had held elected office. Few had been federal judges. Since 1981, no former elected officials have been appointed to the court and nearly all appointees have been federal judges. What changed?",
  "data/reddit-ask/r/AskHistorians/comments/n4b2gw/npr_is_celebrating_its_50th_anniversary_why_was.json": "NPR is celebrating its 50th anniversary, why was it created in the first place?",
  "data/reddit-ask/r/AskHistorians/comments/n4dllw/users_of_ben_franklins_postal_service_could_send.json": "Users of Ben Franklin's postal service could send a letter from Philadelphia to NYC and receive a reply within 24 hours. How did he achieve such ridiculous efficiency unmatched today?",
  "data/reddit-ask/r/AskHistorians/comments/n4e3cq/if_england_gave_its_american_colonies_some.json": "If England gave its American colonies some political representation in the House of Commons, would it have changed much? Why did they fear giving the colonies representation?",
  "data/reddit-ask/r/AskHistorians/comments/n4ilo5/is_there_a_reason_why_the_soviet_hammer_and.json": "Is there a reason why the soviet hammer and sickle was so small and tucked away in the corner of the flag?",
  "data/reddit-ask/r/AskHistorians/comments/n4l1qw/movie_characters_from_the_1930s1950s_seem_to_talk.json": "Movie characters from the 1930s-1950s seem to talk in a form of English obsolete now. Fast-talking, beautifully constructed, wise-cracking lines of dialogue we very much associate from that time. Was this vernacular confined to the fantasy of movies or did people really speak in this way back then?",
  "data/reddit-ask/r/AskHistorians/comments/n4ljtv/at_the_time_of_cleopatra_the_pyramids_and_the.json": "At the time of Cleopatra, the pyramids and the Sphynx were already truly ancient monuments. Do we know what these monuments looked like at that time, in other words did they still have the original glorious, colourful and shiny exterior and how were they perceived by the royalty and the people?",
  "data/reddit-ask/r/AskHistorians/comments/n4omew/did_columbus_prepare_linguistically_or_culturally.json": "Did Columbus prepare linguistically or culturally for his anticipated arrival in Japan, China, or India? Did they bring any dictionaries, guidebooks, ceremonial gifts, etc.?",
  "data/reddit-ask/r/AskHistorians/comments/n4p4xd/when_reading_soviet_historians_ive_seen_the_works.json": "When reading Soviet historians, I’ve seen the works of Engels cited more often than Marx. Was there a political reason for this, or did Engels contribute independent historical theories that have been overshadowed in the west by his association with Marx?",
  "data/reddit-ask/r/AskHistorians/comments/n4sc4c/polygamy_was_practiced_in_early_judaism_but.json": "Polygamy was practiced in early Judaism, but appears to have tapered off after the 2nd temple. When, why, and what changed to cause the transition to monogamy?",
  "data/reddit-ask/r/AskHistorians/comments/n4xo4u/in_the_united_states_what_is_the_most_recent_date.json": "In the United States, what is the most recent date when I could have purchased actual tin (Sn) foil?",
  "data/reddit-ask/r/AskHistorians/comments/n4yurz/guardian_forests_can_be_found_all_over_japan.json": "Guardian Forests can be found all over Japan — Little islands of the wild amid farm fields and busy city streets. What's the history and purpose of these sanctuaries? Are the Japanese unique in their creation, or are were these forest shrines build elsewhere around the world but later destroyed?",
  "data/reddit-ask/r/AskHistorians/comments/n53j49/in_tora_tora_tora_the_japanese_government_wanted.json": "In Tora! Tora! Tora! the Japanese government wanted to deliver their declaration of war before the attack on Pear Harbor, but ended up delivering it after the attack. Why was it so important that they deliver the declaration before the attack?",
  "data/reddit-ask/r/AskHistorians/comments/n55x0u/during_the_heyday_of_tv_westerns_in_the_1950s_and.json": "During the heyday of TV westerns in the 1950s and 1960s, elderly viewers could have grown up in the actual Wild West. What did they think of these shows?",
  "data/reddit-ask/r/AskHistorians/comments/n5i1c4/augustus_relationship_with_the_cult_of_isis.json": "Augustus' relationship with the Cult of Isis",
  "data/reddit-ask/r/AskHistorians/comments/n5lecn/the_1992_song_baby_got_back_implies_that_white.json": "The 1992 song \"Baby Got Back\" implies that White people in America disdained large female posteriors. Was this, in fact, the cultural norm at the time? And if so, to what degree, if any, did the song itself lead to a change in zeitgeist vis a vis derrieres?",
  "data/reddit-ask/r/AskHistorians/comments/n5oleo/apparently_the_roman_emperor_augustus_made_a_lot.json": "Apparently the Roman Emperor Augustus made a lot of bad puns and \"dad jokes\". Was this considered a part of his governing style, or just a personality quirk? Were any other emperors known for their sense of humor?",
  "data/reddit-ask/r/AskHistorians/comments/n5yoqz/why_were_none_of_the_ohio_national_guardsmen.json": "Why were none of the Ohio National Guardsmen involved in the Kent State Massacre ever convicted of manslaughter, murder, or any other crime for their actions?",
  "data/reddit-ask/r/AskHistorians/comments/n65kay/during_the_period_of_the_unification_of_germany.json": "During the period of the Unification of Germany, did the Germans think of the Czechs as fellow Germans or Slavs?",
  "data/reddit-ask/r/AskHistorians/comments/n66oiq/im_dr_robert_thompson_here_to_discuss_my_new_book.json": "I'm Dr. Robert Thompson, here to discuss my new book _Clear, Hold, and Destroy: Pacification in Phú Yên and the American War in Vietnam_. AMA!",
  "data/reddit-ask/r/AskHistorians/comments/n6gccf/mesoamerica_was_accepting_of_xochihuas_men_who.json": "Mesoamerica was accepting of \"Xochihuas\", men who identified as women and even served as concubines to kings and were \"children\" of multiple gay gods, but the Tlatoani of Texcoco banned sodomy and homosexuality. Why is this?",
  "data/reddit-ask/r/AskHistorians/comments/n6lxej/why_was_there_no_massive_public_backlash_to.json": "Why was there no massive public backlash to Napoleon essentially abandoning a whole army in Egypt? How did the friends and families of those soldiers react to Napoleon’s taking power?",
  "data/reddit-ask/r/AskHistorians/comments/n6rwfd/the_inuit_entered_greenland_centuries_after_the.json": "The Inuit entered Greenland centuries after the Norse first settled the island. Norse sagas record raids from what may possibly be the Inuit. By 1500 CE, the Norse settlements in Greenland died out completely. Did the Inuit beat the Vikings?",
  "data/reddit-ask/r/AskHistorians/comments/n6ubpp/is_there_a_reason_why_no_pope_ever_chose_the.json": "Is there a reason why no Pope ever chose the names \"Luke\" or \"Matthew\"?",
  "data/reddit-ask/r/AskHistorians/comments/n6xoym/how_accurate_is_the_notion_that_in_the_14th.json": "How accurate is the notion that in the 14th century, European women could drag their husbands into court to publicly “prove” they were impotent and couldn’t consummate the marriage in order to get a divorce?",
  "data/reddit-ask/r/AskHistorians/comments/n79f5m/why_was_there_no_civilization_with_permanent.json": "Why was there no civilization with permanent structures around the Great Lakes region and St. Lawrence Seaway prior to Colonization in the Americas?",
  "data/reddit-ask/r/AskHistorians/comments/n7at3e/in_the_13th_warrior_ahmad_ibn_fadlan_drinks_mead.json": "In the 13th Warrior Ahmad ibn Fadlan drinks mead because he believes the Arabic prohibition on alcohol is specific to wine and beer. Would this have been a common misconception amongst 10th Century Muslims?",
  "data/reddit-ask/r/AskHistorians/comments/n7c5ey/in_stories_from_the_middle_ages_and_previous.json": "In stories from the Middle Ages and previous centuries where people are executed for strange crimes like 'excessive public laughter' or 'wearing one shoe in public' are these satirical hyperbole or were people put to death for bizarre 'crimes' in days gone by?",
  "data/reddit-ask/r/AskHistorians/comments/n7gy8h/why_did_early_roman_emperors_have_so_few.json": "Why did early Roman Emperors have so few biological children?",
  "data/reddit-ask/r/AskHistorians/comments/n7iof1/why_is_turkey_so_opposed_to_accepting_that_the.json": "Why is Turkey so opposed to accepting that the Armenian Genocide happened?",
  "data/reddit-ask/r/AskHistorians/comments/n7p4ob/just_learned_that_the_roanoke_mystery_is_bs_and.json": "Just learned that the Roanoke \"mystery\" is bs and that settlers just went to live, eat, and breed with their native friends- The Croatoans. How common was this amongst these early settlements? Was there propaganda, at the time, to discourage European commoners from \"going native\"?",
  "data/reddit-ask/r/AskHistorians/comments/n7tba2/two_of_washington_states_most_influential.json": "Two of Washington State's most influential alternative rock bands (the Melvins and Nirvana) sprang up in and around Aberdeen, a small lumber town far from the state's urban centers. Did 1980's Aberdeen have any special traits that would make this fact less unlikely than it would seem on the surface?",
  "data/reddit-ask/r/AskHistorians/comments/n7z1rm/only_about_40_of_mexicos_population_spoke_spanish.json": "Only about 40% of Mexico's population spoke Spanish in 1820. Today, that number is about 94%. Was a policy of thorough linguistic Hispanicization of the country already planned at the time of independence?",
  "data/reddit-ask/r/AskHistorians/comments/n7zogu/was_the_loss_of_life_due_to_the_nuking_of_japan.json": "Was the loss of life due to the nuking of Japan in WW2 actually conservative compared to a land invasion?",
  "data/reddit-ask/r/AskHistorians/comments/n8eo4n/when_i_look_at_maps_of_napoleons_conquests_it.json": "When I look at maps of Napoleon’s conquests, it seems he mostly set up a system of puppet states to run Europe for him..... except for modern day Croatia, which he ran directly. Why?",
  "data/reddit-ask/r/AskHistorians/comments/n8fg0y/when_roald_dahl_wrote_charlie_and_the_chocolate.json": "When Roald Dahl wrote Charlie and the Chocolate Factory in 1964, did he come up with the character Augustus Gloop himself, or was he referencing an existing trope?",
  "data/reddit-ask/r/AskHistorians/comments/n8ll1j/why_was_there_no_deconfederitization_in_the_us.json": "Why was there no “deconfederitization” in the U.S. following the civil war, like there was “denazification” in Germany post ww2?",
  "data/reddit-ask/r/AskHistorians/comments/n8ny3d/why_did_no_major_trade_city_develop_at_the_mouth.json": "Why did no major trade city develop at the mouth of the Danube river?",
  "data/reddit-ask/r/AskHistorians/comments/n8ten2/after_the_fall_of_the_habsburg_empire_the_czechs.json": "After the fall of the Habsburg Empire, the Czechs and Slovaks were amalgamated into a single state, Czechoslovakia, rather than immediately forming individual nation-states. Why? What was the historical context behind the formation of Czechoslovakia?",
  "data/reddit-ask/r/AskHistorians/comments/n8vfh7/did_anybody_notice_when_different_dialects_of.json": "Did anybody notice when different dialects of Latin became mutually unintelligible?",
  "data/reddit-ask/r/AskHistorians/comments/n8vxbl/when_did_american_healthcare_begin_getting_so.json": "When did American healthcare begin getting so expensive?",
  "data/reddit-ask/r/AskHistorians/comments/n9029c/did_anyone_from_west_africa_ie_songhai_mali_etc.json": "Did anyone from West Africa, I.e Songhai, Mali etc attempt to sail west across the Atlantic before the discovery of the Americas by Columbus? What did West Africans think was beyond the ocean?",
  "data/reddit-ask/r/AskHistorians/comments/n907ac/are_german_and_austrian_soldiers_of_ww1.json": "Are German and Austrian soldiers of WW1 remembered the same way we (British, ANZACS etc) remember ours? Or are they ostracized like those of Nazi Germany?",
  "data/reddit-ask/r/AskHistorians/comments/n956bm/austria_was_occupied_by_the_uk_the_us_france_the.json": "Austria was occupied by the UK, the US, France & the Soviets from '45 to '55. Why did the Soviets choose to withdraw from Austria? Why not create an East Austria?",
  "data/reddit-ask/r/AskHistorians/comments/n96n2b/in_1961_goa_a_colony_of_portugal_at_the_time_was.json": "In 1961, Goa, a colony of Portugal at the time was attacked by India, Portugal was a member of NATO when this happened, yet the USA and NATO didn't help Portugal or invade India, why is this and what was the global reaction to this?",
  "data/reddit-ask/r/AskHistorians/comments/n9jzw1/ice_cream_has_been_around_as_early_as_persian.json": "Ice Cream has been around as early as Persian Empire, circa 500 BCE. Both Chocolate and Vanilla come from New World plants, so their use as ice cream flavorings most likely didn't happen for at least another 2000 years. What were the most popular flavors up until that point?",
  "data/reddit-ask/r/AskHistorians/comments/n9k7cg/did_alqaeda_expect_the_twin_towers_to_actually.json": "Did Al-Qaeda expect the twin towers to actually collapse?",
  "data/reddit-ask/r/AskHistorians/comments/n9mwuc/what_was_the_reaction_of_the_general_public_in.json": "What was the reaction of the general public in 1924 when Edwin Hubble announced that the spiral nebula Andromeda was actually another galaxy, and that our own galaxy was just one of many? This seems like it would have a profound effect on the world, but did anyone care?",
  "data/reddit-ask/r/AskHistorians/comments/n9ua04/in_2010_series_spartacus_in_a_scene_where.json": "In 2010 series 'Spartacus', in a scene where Spartacus fights as a gladiator while the crowd is dancing and acclaiming him, some women are shown topless. Was it common for women in Ancient Rome to be publicly topless? Otherwise, when and why was Ancient Rome so erotized in the social imaginary?",
  "data/reddit-ask/r/AskHistorians/comments/na9ran/in_born_in_the_usa_bruce_springsteen_sings_about.json": "In \"Born in the USA,\" Bruce Springsteen sings about being sent to Vietnam after getting into a \"hometown jam.\" Was there really an \"enlist or jail\" policy during the Vietnam War?",
  "data/reddit-ask/r/AskHistorians/comments/nacd8p/the_plague_of_frogs_from_the_book_of_exodus.json": "The plague of frogs from the book of Exodus sounds pretty harmless compared to the other plagues (boils, fire, hail, etc). Is there some reason why Egyptians or Israelites would have been particularly afraid of frogs?",
  "data/reddit-ask/r/AskHistorians/comments/naj07f/why_has_japan_failed_to_successfully_export_its.json": "Why has Japan failed to successfully export its train technology?",
  "data/reddit-ask/r/AskHistorians/comments/nan583/westerns_always_seem_to_have_desperados_breaking.json": "Westerns always seem to have Desperados breaking out windows to shoot at the Marshals, or tavern brawls where someone a quick exit into the street through a large window instead of the door. How hard would actually have been to replace a broken window (large or small) in the Old West?",
  "data/reddit-ask/r/AskHistorians/comments/nanuzq/today_when_i_go_out_for_dinner_i_can_choose_to.json": "Today, when I go out for dinner, I can choose to visit an Italian, Indian, or Chinese restaurant. How old is the idea of “ethnic” restaurants that specialize in the food of a particular foreign culture? Could a hungry Roman go out for some Persian takeout?",
  "data/reddit-ask/r/AskHistorians/comments/naok8f/was_frank_abagnale_lying_the_whole_time.json": "Was Frank Abagnale lying the whole time?",
  "data/reddit-ask/r/AskHistorians/comments/nb2w32/did_woody_guthrie_remove_two_verses_from_this.json": "Did Woody Guthrie remove two verses from \"This Land Is Your Land\" to avoid accusations of communism?",
  "data/reddit-ask/r/AskHistorians/comments/nb5dx1/teddy_roosevelt_sent_the_us_navy_to.json": "Teddy Roosevelt sent the U.S. Navy to circumnavigate the globe. Was this a technical and logistical achievement for the world? An attempt to win hearts and minds abroad? Intimidation? What did the U.S. get out of it, and how did foreigners react?",
  "data/reddit-ask/r/AskHistorians/comments/nb9y86/why_was_new_york_city_such_a_hellhole_in_the_1970s.json": "Why was New York City such a hellhole in the 1970s?",
  "data/reddit-ask/r/AskHistorians/comments/nba1ws/do_raskhistorians_have_any_plans_to_create_a.json": "Do r/AskHistorians have any plans to create a digital (or printed copy) of answered “Great Question” posts? (Meta)",
  "data/reddit-ask/r/AskHistorians/comments/nbb01n/who_killed_gen_x.json": "Who killed Gen X?",
  "data/reddit-ask/r/AskHistorians/comments/nbenfw/in_jane_eyre_the_girls_at_the_institute_suffer.json": "In Jane Eyre, the girls at the institute suffer from cold and hunger, to the point of getting sick and dying. How realistic is that historically speaking?",
  "data/reddit-ask/r/AskHistorians/comments/nbew9f/the_period_16481665_was_arguably_the_most.json": "The period 1648-1665 was arguably the most calamitous and tragic for the Polish people, only second to the Nazi occupation. Why was the Russo-Swedish Deluge such an incredibly destructive war and how did it lead to the long decline of the once powerful Polish-Lithuanian Commonwealth?",
  "data/reddit-ask/r/AskHistorians/comments/nbg7q3/can_someone_explain_the_history_of_the.json": "Can someone explain the history of the Israeli-Palestinian conflict?",
  "data/reddit-ask/r/AskHistorians/comments/nbgzb3/how_did_paprika_whose_primary_compound_is_pepper.json": "How did paprika, whose primary compound is pepper, a New World ingredient, become so synonymous with Hungarian cuisine?",
  "data/reddit-ask/r/AskHistorians/comments/nbi09s/in_richard_kees_the_green_flag_he_considers_the.json": "In Richard Kee's \"The Green Flag\", he considers the concepts of \"Irishness\" and Irish nationalim as products of the Enlightenment and the 1798 Rebellion. Was there really no sense of Irish national identity prior to this?",
  "data/reddit-ask/r/AskHistorians/comments/nboxcw/lets_educate_ourselves_on_the_history_of.json": "Let's educate ourselves on the history of Israel/Palestine",
  "data/reddit-ask/r/AskHistorians/comments/nc5w7e/what_made_black_sitcoms_so_common_in_the_1990s.json": "What made black sitcoms so common in the 1990s?",
  "data/reddit-ask/r/AskHistorians/comments/nc8onk/does_anyone_know_of_this_isolated_culture_in.json": "Does anyone know of this isolated culture in China that apparently had no war or rape ever?",
  "data/reddit-ask/r/AskHistorians/comments/nc9gol/did_early_european_colonizers_of_the_americas.json": "Did early European colonizers of the Americas have issues with inbreeding?",
  "data/reddit-ask/r/AskHistorians/comments/ncbgf6/european_castle_builders.json": "European Castle builders",
  "data/reddit-ask/r/AskHistorians/comments/nccltc/where_there_known_serial_killers_before_the_1800s.json": "Where there known serial killers before the 1800s and if so, how were those crimes investigated to be able to bring someone to justice? What would have been considered modern evidence for them?",
  "data/reddit-ask/r/AskHistorians/comments/nccuo5/why_did_black_southerners_in_the_60s_form.json": "Why did Black Southerners in the 60s form insurgent movements within their state Democratic Parties rather than allying with Republicans?",
  "data/reddit-ask/r/AskHistorians/comments/ncey0d/did_medieval_european_warships_ever_have_mounted.json": "Did Medieval European warships ever have mounted ballistas or other siege weapons for ship-to-ship combat, or has Dungeons & Dragons lied to me?",
  "data/reddit-ask/r/AskHistorians/comments/ncmd33/modern_english_is_as_far_as_im_aware_the_only.json": "Modern English is as far as I'm aware the only European language that uses the Latin alphabet without any diacritical marks. Is there a historical reason for this?",
  "data/reddit-ask/r/AskHistorians/comments/ncnj9q/when_john_carpenters_the_thing_was_released_in.json": "When John Carpenter's The Thing was released in 1982, it was received extremely negatively and even named the most-hated film of all time by some. Today, it's considered one of the greatest horror films of all time. What was the reason for the initial response and why did it change?",
  "data/reddit-ask/r/AskHistorians/comments/ncnjw9/fdr_had_a_gentlemans_agreement_with_the_press_not.json": "FDR had a “gentleman’s agreement” with the press not to photograph him in a wheelchair or comment on his paralysis due to the stigma of the era. Was this upheld by the foreign press during the summits negotiating the post WWII world order? Did the soviets use it in their press against him?",
  "data/reddit-ask/r/AskHistorians/comments/nd27v1/do_we_have_an_idea_what_the_carthaginian.json": "Do we have an idea what the carthaginian architecture was like in Carthage itself and in the colonies (Sicily, Spain etc.)? Was it hellenistic, or more phoenician/middle eastern?",
  "data/reddit-ask/r/AskHistorians/comments/nd8fs9/at_the_end_of_hamilton_an_american_musical.json": "At the end of \"Hamilton: An American Musical\", Jefferson says \"(Hamilton's) financial system is a work of genius. I couldn’t undo it if I tried... And I tried\". Does this refer to specific failed financial reforms during Jefferson's Presidency?",
  "data/reddit-ask/r/AskHistorians/comments/ndbyx7/nycs_book_row_had_48_bookstores_at_its_height.json": "NYC's Book Row had 48 bookstores at its height. What distinguished them and kept them in business? What sort of book culture supported such a density of booksellers?",
  "data/reddit-ask/r/AskHistorians/comments/ndkikh/pol_pots_regime_killed_300k_chinese_cambodians.json": "Pol Pot's regime killed 300k Chinese Cambodians and received extensive Chinese financial support. At one point Deng Xiaoping even invaded Vietnam in defense of a regime that genocided Chinese people. Why?",
  "data/reddit-ask/r/AskHistorians/comments/ndn6uc/aelia_eudoxia_wife_of_the_roman_emperor_arcadius.json": "Aelia Eudoxia, wife of the Roman Emperor Arcadius, was the daughter of a romanized Frank. Stilicho, a half-Vandal, married emperor Theodosius' niece. How were quasi-barbarians able to marry into the imperial family, while men like Aspar, Ricimer, and Theodoric were unable to claim the purple?",
  "data/reddit-ask/r/AskHistorians/comments/ndpx06/how_did_tracksuits_especially_the_ones_with.json": "How did tracksuits (especially the ones with stripes on their sides) become an inherent part of Russian/East Slavic culture?",
  "data/reddit-ask/r/AskHistorians/comments/ne0pk1/what_happened_to_the_medici_family_after_the_16th.json": "What happened to the Medici family after the 16th century?",
  "data/reddit-ask/r/AskHistorians/comments/ne8bcc/when_did_it_stop_being_acceptable_to_openly.json": "When did it stop being acceptable to openly conquer other nations?",
  "data/reddit-ask/r/AskHistorians/comments/nemn06/ive_heard_all_my_life_that_the_middle_east_was.json": "I've heard all my life that the Middle East was essentially peaceful coexistence between Jews and Muslims until Western mandates divided territory arbitrarily. How much of this is fact versus fiction?",
  "data/reddit-ask/r/AskHistorians/comments/nennpt/why_does_the_us_have_a_surgeon_general.json": "Why does the U.S. have a \"Surgeon General\"? Specifically, why are they a surgeon?",
  "data/reddit-ask/r/AskHistorians/comments/neq8n6/i_am_a_black_cpr_certified_man_in_1950s_alabama.json": "I am a black CPR certified man in 1950s Alabama, and a white woman is having a medical emergency nearby me. How am I treated? Am I even allowed to assist?",
  "data/reddit-ask/r/AskHistorians/comments/neslpy/im_a_merchant_in_an_ancient_roman_port_city_to.json": "I’m a merchant in an ancient Roman port city. To produce my wares, I need to import goods from distant provinces. What is that process like? Who do I talk to? What taxes and fees will I pay? Is there any paperwork?",
  "data/reddit-ask/r/AskHistorians/comments/nf3ww4/in_a_36_year_span_1865_1901_three_us_presidents.json": "In a 36 year span (1865 - 1901), three US Presidents were assassinated. No Presidents were assassinated before 1865 and only one has been (successfully) assassinated after 1901. What factors led to this period being so deadly? Was it similar in other countries during this period?",
  "data/reddit-ask/r/AskHistorians/comments/nf6aeq/has_anyone_ever_survived_execution_in_the_roman.json": "Has anyone ever survived execution in the roman arena by killing all opponents?",
  "data/reddit-ask/r/AskHistorians/comments/nf9tl3/shrek_was_widely_considered_to_be_a_parodysatire.json": "'Shrek' was widely considered to be a parody/satire of the Disney Corporation - did its release have any noticeable impact on the companies brand or operations? Did Disney attempt to retaliate against Dreamworks?",
  "data/reddit-ask/r/AskHistorians/comments/nfbzxe/what_was_the_public_reaction_in_the_uk_to_losing.json": "What was the public reaction in the UK to losing the 13 colonies and acknowledging the US?",
  "data/reddit-ask/r/AskHistorians/comments/nfk007/minoan_crete_is_one_of_the_cultures_in_history.json": "Minoan Crete is one of the cultures in history that is always portrayed as “mysterious” due to the poor understanding we have of their language. What did their contemporaries in Egypt, Akkad, Anatolia etc write about them?",
  "data/reddit-ask/r/AskHistorians/comments/nflydt/why_did_the_majority_of_the_muslim_population.json": "Why did the majority of the Muslim population living in the Palestine Mandate reject the original 1948 UN proposal for a two state solution? Did they want one multicultural state for co-existance with Jews? Did the majority of Muslims want to expel the Jews? Or is my understanding entirely off base?",
  "data/reddit-ask/r/AskHistorians/comments/nfmas7/when_i_look_up_the_history_of_mongol_women_in_the.json": "When I look up the history of Mongol women in the era of Genghis Khan and his sons/grandsons I only find information on Mongol queens and princesses. How did the other 99.9% of Mongol women live?",
  "data/reddit-ask/r/AskHistorians/comments/ng1x0h/why_is_african_history_outside_of_egypt_and_north.json": "Why is African history outside of Egypt and north Africa so poorly understood?",
  "data/reddit-ask/r/AskHistorians/comments/ng3qoa/how_come_boschs_garden_of_earthly_delights_wasnt.json": "How come Bosch's Garden of Earthly Delights wasn't seen as sacreligious? I mean, it's full of weird imagery that isn't in the bible. He's almost retconning Genesis. Was that okay at the time?",
  "data/reddit-ask/r/AskHistorians/comments/ng898r/what_were_relations_like_between_the_umayyads_in.json": "What were relations like between the Umayyads in Iberia and the Basques?",
  "data/reddit-ask/r/AskHistorians/comments/ng8fdn/what_is_keeping_a_country_from_violating_the.json": "What is keeping a country from violating the rules of war?",
  "data/reddit-ask/r/AskHistorians/comments/ngb47l/do_we_have_any_information_about_what_prehispanic.json": "Do we have any information about what Pre-Hispanic Mexican societies thought of the Monarch Butterfly gathering spot in Michoacan? If not, what are the earliest records/thoughts we have of this place?",
  "data/reddit-ask/r/AskHistorians/comments/ngebnx/in_the_grimms_fairy_tales_a_king_would_often.json": "In the Grimm's fairy tales, a King would often promise The Princess to anyone who could complete a quest, including commoners. Did this ever happen?",
  "data/reddit-ask/r/AskHistorians/comments/ngiivj/in_the_road_to_el_dorado_a_guard_tries_to_arrest.json": "In The Road to El Dorado, a guard tries to arrest the protagonists for playing with loaded dice. Was it actually illegal to cheat on games like this in 15th century Spain? What kind of trial, if any, would have awaited Miguel and Tulio had they been captured?",
  "data/reddit-ask/r/AskHistorians/comments/ngkz9g/why_was_schleswig_still_a_pagan_city_as_late_as.json": "Why was Schleswig still a pagan city as late as 965?",
  "data/reddit-ask/r/AskHistorians/comments/ngtjbe/when_the_roman_empire_gradually_lost_territory.json": "When the Roman Empire gradually lost territory, was there a “postcolonial” reckoning where former dependencies actively tried to reverse Roman cultural influence and bring back their “native” culture?",
  "data/reddit-ask/r/AskHistorians/comments/nh1625/why_was_the_khmer_empire_and_the_kingdom_of.json": "Why was the Khmer Empire and the Kingdom of Champa influenced by Indian culture despite being much closer to China?",
  "data/reddit-ask/r/AskHistorians/comments/nh98rb/prior_to_the_launch_of_global_imaging_satellites.json": "Prior to the launch of global imaging satellites, had cartographers accurately mapped the whole world? Did the first satellite images of the planet provide us with new places to explore?",
  "data/reddit-ask/r/AskHistorians/comments/nhbcg1/according_to_wikipedia_only_3_countries_do_not.json": "According to Wikipedia, only 3 countries do not recognise the DPRK : South Korea, Japan and France. I get the first two, but why doesn't France ?",
  "data/reddit-ask/r/AskHistorians/comments/nhesq7/the_preservation_of_pompeii_seems_like_an.json": "The preservation of Pompeii seems like an absolutely absurd bit of luck for archaeologists and historians studying the Roman empire at its height, are there comparable sites for other Ancient civilizations in places like China, India or the Middle East?",
  "data/reddit-ask/r/AskHistorians/comments/nhqum8/im_a_chinese_peasant_living_in_1850_how_do_i_even.json": "I'm a Chinese peasant living in 1850. How do I even find out about America or find passage to the United States?",
  "data/reddit-ask/r/AskHistorians/comments/nhsod5/its_common_knowledge_that_the_romans_adopted_many.json": "It's common knowledge that the Romans adopted many Hellenic customs, including the worship of the Greek gods and goddesses. However, what was Roman religion like before they adopted Hellenic deities?",
  "data/reddit-ask/r/AskHistorians/comments/nhtm7n/in_vietnam_war_movies_you_constantly_see_american.json": "In Vietnam War movies, you constantly see American soldiers wearing altered uniforms like torn sleeves and bandanas, and using non-standard equipment like bows and arrows. How common was this really? Why isn't it as present in WWII or Afghanistan War films / reality?",
  "data/reddit-ask/r/AskHistorians/comments/nibz10/why_in_art_in_the_middle_ages_and_renaissance_was.json": "Why, in art in the Middle Ages and renaissance, was Mary, Jesus’ mother often show in religious paintings, but Joseph, is never shown?",
  "data/reddit-ask/r/AskHistorians/comments/nif1rh/the_house_of_lords_had_100s_of_hereditary_members.json": "The House of Lords had 100s of hereditary members until 1997(cut down to 97), just how much power and influence did these families have over legislation and the government? Was there a serious political impact of stripping them from their family seats and thus reducing the number of noble HoL peers",
  "data/reddit-ask/r/AskHistorians/comments/niom5o/we_know_of_yasuke_the_african_samurai_are_there.json": "We know of Yasuke the African samurai. Are there any such figures of interest in the history of the Roman military? Perhaps a man from China or India who served in the legions?",
  "data/reddit-ask/r/AskHistorians/comments/niuskn/if_jews_didnt_acquire_last_names_until_the_late.json": "If Jews didn't acquire last names until the late modern period, then why do Jews of Eastern European descent sometimes have German place names?",
  "data/reddit-ask/r/AskHistorians/comments/niwp6z/apostrophes_used_to_spell_irish_names_in.json": "Apostrophes used to spell Irish names in newspapers in the 19th to mid 20th centuries. (M'Carthy, M'Clellan)",
  "data/reddit-ask/r/AskHistorians/comments/nix23u/why_didnt_europeans_suffer_from_american_or.json": "Why Didn't Europeans Suffer from American or Aboriginal Plagues?",
  "data/reddit-ask/r/AskHistorians/comments/nj60qb/why_didnt_most_people_in_muslimmajority_countries.json": "Why didn't most people in Muslim-majority countries grow detached from religion like they often did in Christian-majority countries?",
  "data/reddit-ask/r/AskHistorians/comments/njdtfp/meta_loaded_questions_that_are_not_exactly.json": "[META] Loaded questions that are not exactly soapboxing but have premises that cannot be verified by a historian.",
  "data/reddit-ask/r/AskHistorians/comments/njh8vo/what_is_the_history_of_pegging_sexual_practice.json": "What is the history of Pegging (sexual practice)? Does anyone know how far back it goes? Or when it was created or tried for the first time?",
  "data/reddit-ask/r/AskHistorians/comments/njohv8/one_of_the_most_iconic_lines_in_game_of_thrones.json": "One of the most iconic lines in Game of Thrones is \"the man who passes the sentence should swing the sword\". Meaning the one who condemns a man to death should be the one who carries out the execution. Is there any historical precedence for such a practice or is it just fantasy ?",
  "data/reddit-ask/r/AskHistorians/comments/njvqna/why_was_france_not_reduced_in_size_after_the.json": "Why was France not reduced in size after the defeat at Waterloo (1815)?",
  "data/reddit-ask/r/AskHistorians/comments/njyupe/how_did_medieval_people_view_the_roman_republic.json": "How did medieval people view the Roman Republic, Athenian democracy and republicanism/democracy in general ?",
  "data/reddit-ask/r/AskHistorians/comments/njzzbm/the_nanking_massacre_occurred_in_193738_but_the.json": "The Nanking Massacre occurred in 1937-38, but the Japanese continued to occupy the city until 1945. What was daily life like in the city after the massacre?",
  "data/reddit-ask/r/AskHistorians/comments/nk0kat/how_on_earth_did_gertrude_stein_the_famous_jewish.json": "How on Earth did Gertrude Stein, the famous Jewish lesbian patron of modernism, end up a Vichy collaborator?",
  "data/reddit-ask/r/AskHistorians/comments/nk95wx/did_the_average_medieval_person_know_what_year_it.json": "Did the average medieval person know what year it was?",
  "data/reddit-ask/r/AskHistorians/comments/nkfnk2/did_judaism_invent_the_taboo_on_pork_or_did_other.json": "Did Judaism invent the taboo on pork, or did other ancient religions have a pork taboo?",
  "data/reddit-ask/r/AskHistorians/comments/nkkh6b/the_california_redwoods_are_amazing_to_walk.json": "The California redwoods are amazing to walk through today, but what would it have been like in the 1700s and 1800s? How many dangerous animals were around, and what records do we have of their interactions with humans?",
  "data/reddit-ask/r/AskHistorians/comments/nknl11/what_did_highclass_victorian_brothels_in_london.json": "What did high-class Victorian brothels in London look like inside?",
  "data/reddit-ask/r/AskHistorians/comments/nkrxeu/how_many_blacksmiths_were_there_to_support_a.json": "How many blacksmiths were there to support a single medieval army and how long did it take to equip everyone sufficiently? How did they cope with the material losses after a defeat in battle?",
  "data/reddit-ask/r/AskHistorians/comments/nkx9b9/in_black_panther_killmonger_says_bury_me_in_the.json": "In Black Panther, Killmonger says \"bury me in the ocean with my ancestors that jumped from the ships because they knew death was better than bondage\" How common was it for victims of the transatlantic slave trade to commit suicide by jumping from ships?",
  "data/reddit-ask/r/AskHistorians/comments/nlybl7/the_absurdity_of_the_continued_military_use_of.json": "The absurdity of the continued military use of bolt-action rifles in a primary role post 1918",
  "data/reddit-ask/r/AskHistorians/comments/nm1emh/where_does_the_stereotypical_skull_and_crossbones.json": "Where does the stereotypical skull and crossbones flag actually originate? Pirates or Hollywood?",
  "data/reddit-ask/r/AskHistorians/comments/nm4wcd/how_much_of_the_available_world_war_1_combat.json": "How much of the available World War 1 combat footage is authentic vs. staged?",
  "data/reddit-ask/r/AskHistorians/comments/nm4yvi/its_the_victorian_era_and_my_wife_and_i_are.json": "It's the Victorian Era and my wife and I are walking in London far from our home when nature calls. How do we go about finding a restroom to use?",
  "data/reddit-ask/r/AskHistorians/comments/nm70zi/when_and_why_did_egypt_lose_its_importance_as_an.json": "When and why did Egypt lose its importance as an exporter of grains/food?",
  "data/reddit-ask/r/AskHistorians/comments/nm7snr/in_the_roman_empire_what_happened_to_geriatric.json": "In the Roman empire.. what happened to geriatric slaves? If you owned a slave that supported your household for decades and into the slaves old age.. what happened ?",
  "data/reddit-ask/r/AskHistorians/comments/nm7svh/im_a_medieval_13th_century_peasant_woman_living.json": "I'm a medieval (13th century) peasant woman living in the slums of a city, my husband joined the army in an attempt to make a fortune but he hasn't comeback after the war ended and I fear that he is dead. How can I earn money to raise my child other than prostitution?",
  "data/reddit-ask/r/AskHistorians/comments/nmj7dh/what_caused_the_deradicalization_of_the_lgbtq.json": "What caused the de-radicalization of the LGBTQ rights movement and the shift away from gay liberation towards more mainstream goals and attitudes?",
  "data/reddit-ask/r/AskHistorians/comments/nmk1sn/is_noam_chomskys_claim_that_all_postwar_us.json": "Is Noam Chomsky's claim that all postwar US presidents would be guilty of war crimes under the Nuremberg principles accurate?",
  "data/reddit-ask/r/AskHistorians/comments/nmwfkc/why_most_former_colonies_especially_brazil_are.json": "Why most former colonies, especially Brazil, are less advanced compare to Australia, USA, Canada etc? Despite the fact that Australia and Canada have hazardous climate, or geography.",
  "data/reddit-ask/r/AskHistorians/comments/nmwz7u/when_did_the_identity_of_han_become_a_meaningful.json": "When did the identity of Han become a meaningful self-identity in the mass general consciousness in China?",
  "data/reddit-ask/r/AskHistorians/comments/nn0fj8/there_were_many_small_free_imperial_cities_and.json": "There were many small free imperial cities and other tiny city-states in Medieval and Early Modern Germany, up to 300 by some counts. Why and how did only Hamburg and Bremen remain to this day as city-states in the new federal Germany?",
  "data/reddit-ask/r/AskHistorians/comments/nn2i33/caesars_german_cavalry_were_accompanied_by_light.json": "Caesar's German cavalry were accompanied by light infantrymen, \"who were accustomed to engage among them.\" Caesar famously employed similar tactics at Pharsalus, when he surreptitiously embedded infantry amongst his cavalry. Was this tactic as unique as Caesar portrays? Did it become a new norm?",
  "data/reddit-ask/r/AskHistorians/comments/nn3036/according_to_the_domesday_book_census_in_1086.json": "According to the Domesday Book census in 1086 slaves comprised 5-25% of England's population. Who were these enslaved people?",
  "data/reddit-ask/r/AskHistorians/comments/nnekqm/are_there_any_documented_historical_cases_of.json": "Are there any documented historical cases of actors becoming so involved with their characters that they are unable to distinguish their character from reality?",
  "data/reddit-ask/r/AskHistorians/comments/nnijpa/in_the_ussr_even_during_the_height_of_stalins.json": "In The USSR, even during the height of Stalin's repression, they did not dare to censor or to suppress pre-revolutionary masterpieces of Russian poetry and literature. How much do we know about availability of classic Korean literature in North Korea?",
  "data/reddit-ask/r/AskHistorians/comments/nnkqrn/my_great_grandfather_fought_in_world_war_1_as_a.json": "My great grandfather fought in World War 1 as a cavalryman; what sort of activities made up his day-to-day life? How should I keep researching him, given that my country was not yet formed in 1914?",
  "data/reddit-ask/r/AskHistorians/comments/nnnsmc/how_did_goth_go_from_referring_to_a_germanic.json": "How did \"Goth\" go from referring to a Germanic tribe in late Roman times, to referring to an aesthetic that combines, among other things, gloomy music, stylized Victorian fashion, old buildings, and punk.",
  "data/reddit-ask/r/AskHistorians/comments/nns9ty/were_there_any_losers_in_the_columbian_exchange.json": "Were there any 'losers' in the Columbian Exchange - vegetables or fruits that ended up being dropped from popular consumption in either the Americas or Europe because they were replaced by something better in their culinary niches?",
  "data/reddit-ask/r/AskHistorians/comments/nnuzpq/the_story_of_marco_polo_seems_to_have_been.json": "The story of Marco Polo seems to have been expanded significantly centuries after his journey to the east occurred. What evidence do historians have that he actually went to China and the Mongol court?",
  "data/reddit-ask/r/AskHistorians/comments/nnw6vm/before_the_creation_of_highly_processed_foods.json": "Before the creation of highly processed foods like mac n cheese and chicken nuggets in the 20th century what was considered the quintessential \"children's food\"?",
  "data/reddit-ask/r/AskHistorians/comments/nnxiht/did_mussolini_kill_off_a_paleolithic_culture_that.json": "Did Mussolini kill off a Paleolithic culture that was living in Italy?",
  "data/reddit-ask/r/AskHistorians/comments/no8psi/in_the_mid19th_century_germany_was_a_hotbed_of.json": "In the mid-19th century, Germany was a hotbed of liberalism, with the Prussian landtag overwhelmingly anti-monarchical. How did Germany become known for a culture of conservative militarist conformity by the 20th century?",
  "data/reddit-ask/r/AskHistorians/comments/noleqn/part_of_the_notoriety_of_1973s_the_exorcist_are.json": "Part of the notoriety of 1973's \"The Exorcist\" are tales of theaters full of people suffering from panic attacks, vomiting, and fainting. Was this as common as urban legends make it? Why did 1970s moviegoers had such a visceral reaction to this movie in particular?",
  "data/reddit-ask/r/AskHistorians/comments/nop4nq/where_was_everyone_getting_cigarettes_in_world.json": "Where was everyone getting cigarettes in World War 2?",
  "data/reddit-ask/r/AskHistorians/comments/np9lez/who_is_this_child_an_indigenous_history_of_the.json": "“Who is This Child?” An Indigenous History of the Missing & Murdered",
  "data/reddit-ask/r/AskReddit/comments/n1yux8/deaf_people_what_are_the_most_inadvertently_funny.json": "Deaf people, what are the most inadvertently funny accidental signs you see from people who don't know sign language?",
  "data/reddit-ask/r/AskReddit/comments/n21sg3/what_would_be_the_worst_theme_to_choose_when.json": "What would be the worst theme to choose when creating a theme park?",
  "data/reddit-ask/r/AskReddit/comments/n245dn/people_who_have_done_a_multiday_hiking_trip_such.json": "People who have done a multi-day hiking trip, such as the Appalachian Trail, what is your horror story from the trip?",
  "data/reddit-ask/r/AskReddit/comments/n24wka/long_term_10_years_married_couples_of_reddit.json": "Long term (10+ years) married couples of reddit, Whats was the worst low you've had and why didnt you leave?",
  "data/reddit-ask/r/AskReddit/comments/n271go/surgeons_of_reddit_how_do_bathroom_breaks_work_on.json": "Surgeons of Reddit, how do bathroom breaks work on a 10+ hour surgery?",
  "data/reddit-ask/r/AskReddit/comments/n29moe/what_is_a_totally_wrong_thing_that_has_become_so.json": "What is a totally wrong thing that has become so widespread it's not considered wrong anymore?",
  "data/reddit-ask/r/AskReddit/comments/n2bdc8/what_spongebob_quote_best_describes_your_sex_life.json": "What SpongeBob quote best describes your sex life?",
  "data/reddit-ask/r/AskReddit/comments/n2dvie/if_you_could_reset_your_life_to_the_age_of_6.json": "If you could reset your life to the age of 6 years, but keep your memories, skills and knowledge, would you do it? Why or why not?",
  "data/reddit-ask/r/AskReddit/comments/n2eibc/if_modern_medicine_didnt_exist_what_medical.json": "If modern medicine didn't exist, what medical condition would you have died from/been severely impacted by?",
  "data/reddit-ask/r/AskReddit/comments/n2fin8/what_question_do_you_have_that_nobody_has_been.json": "What question do you have that nobody has been able to give you a good answer to?",
  "data/reddit-ask/r/AskReddit/comments/n2kjbb/girls_what_inappropriate_questions_about_guys.json": "Girls, what inappropriate questions about guys have you always wanted answered.?",
  "data/reddit-ask/r/AskReddit/comments/n2l1f9/whats_a_quote_that_permanently_changed_the_way.json": "What’s a quote that permanently changed the way you look at things?",
  "data/reddit-ask/r/AskReddit/comments/n2rs6b/serious_doctors_of_reddit_what_is_the_rarest.json": "[Serious] Doctors of reddit, what is the rarest disease that you've encountered in your career?",
  "data/reddit-ask/r/AskReddit/comments/n2v70k/serious_conservatives_what_is_your_most_extreme.json": "[Serious] conservatives, what is your most extreme liberal view? Liberals, what is your most conservative view?",
  "data/reddit-ask/r/AskReddit/comments/n2zue9/chefs_of_reddit_what_is_that_one_dish_on_the_menu.json": "Chefs of reddit, what is that one dish on the menu you absolutely hate making?",
  "data/reddit-ask/r/AskReddit/comments/n316yf/whats_your_staying_at_a_cheap_hotel_horror_story.json": "What's your \"staying at a cheap hotel\" horror story?",
  "data/reddit-ask/r/AskReddit/comments/n3263r/if_you_could_would_you_give_up_modern_society_to.json": "If you could, would you give up modern society to be in a better societal position at an earlier time in history and why?",
  "data/reddit-ask/r/AskReddit/comments/n337bl/what_screams_im_secretly_a_great_person.json": "What screams \"I'm secretly a great person\"?",
  "data/reddit-ask/r/AskReddit/comments/n33fyd/whats_the_stupidest_thing_you_got_in_trouble_for.json": "What's the stupidest thing you got in trouble for at school?",
  "data/reddit-ask/r/AskReddit/comments/n34b7f/serious_therapists_what_is_something_people_are.json": "[Serious] Therapists, what is something people are afraid to tell you because they think it's weird, but that you've actually heard a lot of times before?",
  "data/reddit-ask/r/AskReddit/comments/n34jt6/what_was_the_most_unusual_wikipedia_article_you.json": "What was the most unusual Wikipedia article you found?",
  "data/reddit-ask/r/AskReddit/comments/n3dyvn/employees_of_mcdonalds_what_secrets_did_you.json": "Employees of Mcdonalds, what secrets did you discover while working there?",
  "data/reddit-ask/r/AskReddit/comments/n3e501/which_celebrity_has_blocked_you_on_social_media.json": "Which celebrity has blocked you on social media and why?",
  "data/reddit-ask/r/AskReddit/comments/n3euvv/nsfw_what_kink_did_you_1st_think_wtf_but_actually.json": "NSFW What kink did you 1st think wtf but actually tried and enjoyed?",
  "data/reddit-ask/r/AskReddit/comments/n3hk94/has_anyone_wrongfully_assumed_you_were_dumb_and.json": "Has anyone wrongfully assumed you were dumb and in the process made themselves look really dumb? What's your story?",
  "data/reddit-ask/r/AskReddit/comments/n3it2y/what_is_the_most_creepiest_thing_you_saw_even.json": "What is the most creepiest thing you saw even though you are very sceptical about paranormal things?",
  "data/reddit-ask/r/AskReddit/comments/n3lp2x/what_nsfw_question_have_you_always_wanted_to_ask.json": "What NSFW question have you always wanted to ask the opposite gender?",
  "data/reddit-ask/r/AskReddit/comments/n3mov8/you_wake_up_and_its_june_1st_2019_again_what_is.json": "You wake up and it’s June 1st, 2019 again, what is the first thing you do?",
  "data/reddit-ask/r/AskReddit/comments/n3tpxs/what_doesnt_need_the_hate_it_gets.json": "What doesnt need the hate it gets?",
  "data/reddit-ask/r/AskReddit/comments/n3usv0/what_movie_changes_the_plot_if_you_add_a_random_r.json": "What movie changes the plot if you add a random 'R' somewhere in the title?",
  "data/reddit-ask/r/AskReddit/comments/n3v455/what_was_your_parents_biggest_mistake_in_raising.json": "What was your parent's biggest mistake in raising you?",
  "data/reddit-ask/r/AskReddit/comments/n43t45/girls_what_do_guys_do_that_they_think_is_being.json": "Girls, what do guys do that they think is \"being manly\" but in reality is the furthest thing from it?",
  "data/reddit-ask/r/AskReddit/comments/n4gtix/so_whats_your_plan_for_seducing_bill_gates.json": "So, what’s your plan for seducing Bill Gates?",
  "data/reddit-ask/r/AskReddit/comments/n4hko2/how_do_you_ask_a_person_with_anger_issues_why.json": "How do you ask a person with anger issues why they’re angry without making them angry?",
  "data/reddit-ask/r/AskReddit/comments/n4ngl2/what_are_some_dark_secrets_about_the_porn_industry.json": "What are some dark secrets about the porn industry?",
  "data/reddit-ask/r/AskReddit/comments/n4uhjt/which_sexual_move_is_just_hyped_up_and_not_so.json": "Which sexual move is just hyped up and not so pleasurable as they say it might be?",
  "data/reddit-ask/r/AskReddit/comments/n4vf1p/what_was_your_biggestmost_regrettable_its_not_a.json": "What was your biggest/most regrettable \"It's not a phase, mom. It's my life.\" that, in fact, turned out to be just a phase and not your life?",
  "data/reddit-ask/r/AskReddit/comments/n4wvw1/what_was_your_worst_job_interview.json": "What was your worst job interview?",
  "data/reddit-ask/r/AskReddit/comments/n4yhp4/what_are_some_dark_secrets_about_the_corn_industry.json": "What are some dark secrets about the corn industry?",
  "data/reddit-ask/r/AskReddit/comments/n4z0lh/what_would_you_like_to_learn_first_from_a_girl_on.json": "What would you like to learn first from a girl on a first date?",
  "data/reddit-ask/r/AskReddit/comments/n51lqr/what_is_the_horniest_thing_youve_ever_done_nsfw.json": "What is the horniest thing you've ever done? (NSFW)",
  "data/reddit-ask/r/AskReddit/comments/n52wgc/whats_a_not_so_fun_fact.json": "What's a \"not so fun fact\"?",
  "data/reddit-ask/r/AskReddit/comments/n573rb/what_are_some_positive_things_happening_in_the.json": "What are some positive things happening in the world right now?",
  "data/reddit-ask/r/AskReddit/comments/n58m94/whats_the_stupidest_thing_youve_ever_heard.json": "What’s the stupidest thing you’ve ever heard someone say?",
  "data/reddit-ask/r/AskReddit/comments/n59c81/almost_80_of_the_ocean_hasnt_been_discovered_what.json": "Almost 80% of the ocean hasn’t been discovered. What are you most likely to find there?",
  "data/reddit-ask/r/AskReddit/comments/n5auhk/if_your_vision_had_a_hud_like_in_video_games_what.json": "If your vision had a HUD like in video games, what information would you like to be displayed?",
  "data/reddit-ask/r/AskReddit/comments/n5byci/why_did_we_start_saying_face_masks_when_masks.json": "Why did we start saying \"face masks\" when masks were already for your face to begin with?",
  "data/reddit-ask/r/AskReddit/comments/n5cjfz/what_is_the_most_terrifying_thing_youve_ever.json": "What is the most terrifying thing you’ve ever experienced while home alone?",
  "data/reddit-ask/r/AskReddit/comments/n5d0bp/whats_the_weirdest_thing_society_accepts_as_normal.json": "What’s the weirdest thing society accepts as normal?",
  "data/reddit-ask/r/AskReddit/comments/n5ei22/what_was_the_best_bathroom_poem_graffiti_youve.json": "What was the best Bathroom poem graffiti you've seen?",
  "data/reddit-ask/r/AskReddit/comments/n5empy/what_positive_changes_have_you_made_in_your_life.json": "What positive changes have you made in your life that you’d like to brag on a bit? What’s that work you’ve been putting in?",
  "data/reddit-ask/r/AskReddit/comments/n5glfj/what_gets_you_out_of_bed_in_the_morning.json": "What gets you out of bed in the morning?",
  "data/reddit-ask/r/AskReddit/comments/n5ma9r/what_movie_gets_a_lot_of_hate_but_you_actually.json": "What movie gets a lot of hate, but you actually love it?",
  "data/reddit-ask/r/AskReddit/comments/n5mj47/what_family_secret_was_finally_spilled_in_your.json": "What family secret was finally spilled in your family?",
  "data/reddit-ask/r/AskReddit/comments/n5mobb/serious_male_rape_victims_whats_your_story.json": "[Serious] Male Rape Victims, what's your story?",
  "data/reddit-ask/r/AskReddit/comments/n5np2i/what_is_socially_acceptable_in_the_us_that_would.json": "What is socially acceptable in the U.S. that would be horrifying in the U.K.?",
  "data/reddit-ask/r/AskReddit/comments/n5t4rn/what_was_the_biggest_coincidence_that_made_you.json": "What was the biggest coincidence that made you question the fabric of reality?",
  "data/reddit-ask/r/AskReddit/comments/n5xpem/what_wild_animal_is_commonly_thought_to_not_be.json": "What wild animal is commonly thought to not be dangerous, but you need to stay the HELL away from because they are dangerous?",
  "data/reddit-ask/r/AskReddit/comments/n60e5n/serious_how_do_you_know_you_have_fallen_in_love.json": "[Serious] How do you know you have fallen in love?",
  "data/reddit-ask/r/AskReddit/comments/n622tg/you_meet_god_he_gives_you_one_chance_to_ask.json": "You meet God. He gives you one chance to ask anything to Him, but it has to be a question that answers Yes or No. What question will you ask to God?",
  "data/reddit-ask/r/AskReddit/comments/n64xrn/what_can_your_brain_just_not_comprehend.json": "what can your brain just not comprehend?",
  "data/reddit-ask/r/AskReddit/comments/n65r2o/people_whose_long_term_relationship_faded_what.json": "People whose long term relationship faded, what was the final straw that made you realise it was time to call it a day?",
  "data/reddit-ask/r/AskReddit/comments/n685ip/whats_the_hardest_thing_youve_had_to_tell_someone.json": "What’s the hardest thing you’ve had to tell someone?",
  "data/reddit-ask/r/AskReddit/comments/n68cj4/what_modern_social_trend_pisses_you_off_the_most.json": "What modern social trend pisses you off the most?",
  "data/reddit-ask/r/AskReddit/comments/n6fnt6/whats_a_niche_unassuming_hobby_that_has_a.json": "What's a niche, unassuming hobby that has a surprising dark side to it?",
  "data/reddit-ask/r/AskReddit/comments/n6jjp2/what_is_the_weirdest_fact_you_know.json": "What is the weirdest fact you know?",
  "data/reddit-ask/r/AskReddit/comments/n6k2f9/siblings_of_reddit_what_does_your_sibling_do_that.json": "Siblings of Reddit, What does your sibling do that irritates you the most?",
  "data/reddit-ask/r/AskReddit/comments/n6mvui/you_are_allowed_to_replace_any_substance_with.json": "You are allowed to replace any substance with mayo. What do you pick to cause the most chaos?",
  "data/reddit-ask/r/AskReddit/comments/n6ngye/what_did_you_always_imagine_the_health_potion_in.json": "What did you always imagine the health potion in a video game would taste like?",
  "data/reddit-ask/r/AskReddit/comments/n6oho7/what_is_some_really_messed_up_things_the_united.json": "What is some really messed up things the United States has done that most people don’t know about?",
  "data/reddit-ask/r/AskReddit/comments/n6pbed/people_of_reddit_whats_something_you_wanted_to.json": "People of Reddit whats something you wanted to tell your parents but won't because it'll break their heart? (Serious)",
  "data/reddit-ask/r/AskReddit/comments/n6pn3c/what_are_some_useful_subreddits_everyone_should.json": "What are some useful subreddits everyone should be aware of?",
  "data/reddit-ask/r/AskReddit/comments/n6vgac/how_tired_are_you.json": "How tired are you?",
  "data/reddit-ask/r/AskReddit/comments/n6wp0k/how_did_you_know_you_found_the_one.json": "How did you know you found the one?",
  "data/reddit-ask/r/AskReddit/comments/n6xjr2/cheaters_of_reddit_just_one_question_why_cheat.json": "Cheaters of Reddit, just one question. Why cheat when you could've just left?",
  "data/reddit-ask/r/AskReddit/comments/n6ycjq/what_movie_do_you_never_mind_watching.json": "What movie do you never mind watching?",
  "data/reddit-ask/r/AskReddit/comments/n6ykni/whos_the_one_who_got_away.json": "Who’s the one who got away?",
  "data/reddit-ask/r/AskReddit/comments/n6ypyv/people_who_can_lip_read_what_is_the_funniest.json": "People who can lip read, what is the funniest thing you have ever heard a background character in a movie say?",
  "data/reddit-ask/r/AskReddit/comments/n707kv/what_topics_make_you_go_ughh_shut_up.json": "What topics make you go, “Ughh shut up”?",
  "data/reddit-ask/r/AskReddit/comments/n70t3v/what_are_some_tips_for_a_burnt_out_student.json": "What are some tips for a burnt out student?",
  "data/reddit-ask/r/AskReddit/comments/n789mr/what_do_you_think_queen_elizabeth_keeps_in_her.json": "What do you think Queen Elizabeth keeps in her pockets?",
  "data/reddit-ask/r/AskReddit/comments/n7c0qz/men_of_reddit_whats_the_male_equivalent_of.json": "Men of Reddit, what's the male equivalent of flowers for you?",
  "data/reddit-ask/r/AskReddit/comments/n7i54i/what_are_some_solved_mysteries.json": "What are some SOLVED mysteries?",
  "data/reddit-ask/r/AskReddit/comments/n7lob9/people_who_are_or_have_been_in_the_foster_system.json": "People who are or have been in the foster system: What would you say to someone who is considering becoming a foster parent?",
  "data/reddit-ask/r/AskReddit/comments/n7mfpn/serious_redditors_who_were_told_they_were_gifted.json": "[Serious] redditors who were told they were gifted or talented growing up, how did things go for you?",
  "data/reddit-ask/r/AskReddit/comments/n7nkan/people_of_both_sexes_often_talk_about_the_obvious.json": "People of both sexes often talk about the obvious advantages of being a guy, but what are some of the downsides?",
  "data/reddit-ask/r/AskReddit/comments/n7o3ex/whats_something_thats_not_a_cult_but_seems_like_a.json": "What's something that's not a cult, but seems like a cult?",
  "data/reddit-ask/r/AskReddit/comments/n7ona5/redditors_who_look_5_plus_years_younger_than_you.json": "Redditors who look 5 plus years younger than you are, how does it affect your life?",
  "data/reddit-ask/r/AskReddit/comments/n7rrr9/whats_normal_in_your_country_thats_considered.json": "What's normal in your country that's considered weird in others?",
  "data/reddit-ask/r/AskReddit/comments/n7v8tu/which_celebritys_death_actually_made_you_cry.json": "Which celebrity’s death actually made you cry?",
  "data/reddit-ask/r/AskReddit/comments/n7wbw5/what_is_a_little_known_warning_from_nature_that.json": "What is a little known warning from nature that can save your life?",
  "data/reddit-ask/r/AskReddit/comments/n80ygl/what_should_be_illegal.json": "What should be illegal?",
  "data/reddit-ask/r/AskReddit/comments/n843pj/whats_the_most_annoying_thing_about_having_a_penis.json": "What’s the most annoying thing about having a penis?",
  "data/reddit-ask/r/AskReddit/comments/n89oxz/whats_the_worst_thing_that_you_would_wish_on.json": "What's the worst thing that you WOULD wish on someone?",
  "data/reddit-ask/r/AskReddit/comments/n89qji/whats_the_most_annoying_thing_about_having_a.json": "What’s the most annoying thing about having a vagina?",
  "data/reddit-ask/r/AskReddit/comments/n8bk4h/would_a_cute_friendly_sleeping_cat_right_now.json": "Would a cute friendly sleeping cat right now improve your mood? Why or why not?",
  "data/reddit-ask/r/AskReddit/comments/n8dccb/what_was_completely_ruined_because_too_many.json": "What was completely ruined because too many people start doing it?",
  "data/reddit-ask/r/AskReddit/comments/n8dliq/what_mystery_would_you_like_to_see_solved_in_your.json": "What mystery would you like to see solved in your lifetime?",
  "data/reddit-ask/r/AskReddit/comments/n8eywc/people_who_exerciselift_weights_what_is_your.json": "People who exercise/lift weights: what is your secret to staying motivated when it takes a while to get results?",
  "data/reddit-ask/r/AskReddit/comments/n8f5o0/whats_the_worst_movie_youve_ever_watched.json": "What’s the worst movie you’ve ever watched?",
  "data/reddit-ask/r/AskReddit/comments/n8gubg/whats_the_most_annoying_thing_about_people_asking.json": "What’s the most annoying thing about people asking about your genitals?",
  "data/reddit-ask/r/AskReddit/comments/n8gv6x/when_you_tell_a_good_friend_make_yourself_at_home.json": "When you tell a good friend, “make yourself at home”, what is off limits?",
  "data/reddit-ask/r/AskReddit/comments/n8kvtt/imagine_you_have_an_opportunity_to_pay_1000_to_be.json": "Imagine: You have an opportunity to pay $1000 to be able to click a button that prints out a list of every single person whose ever thought about you while masturbating. Would you do it, why/why not? NSFW",
  "data/reddit-ask/r/AskReddit/comments/n8r5jl/what_shouldnt_be_considered_as_a_normal_thing_in.json": "What shouldn't be considered as a normal thing in our society?",
  "data/reddit-ask/r/AskReddit/comments/n8rncj/what_celebrity_suffered_the_worst_fall_from_grace.json": "What celebrity suffered the worst fall from grace?",
  "data/reddit-ask/r/AskReddit/comments/n8uje3/reddit_why_are_you_so_obsessed_with_whos.json": "Reddit: why are you so obsessed with who’s masturbating to you?",
  "data/reddit-ask/r/AskReddit/comments/n8z9bm/theres_a_room_in_your_house_where_time_just.json": "There's a room in your house where time just doesn't flow. You could stay in there for as long as you could possibly want, and not even a second will have passed outside that room. What would you use this room for?",
  "data/reddit-ask/r/AskReddit/comments/n903sn/whats_the_most_annoying_thing_youve_heard_from_a.json": "What’s the most annoying thing you’ve heard from a therapist?",
  "data/reddit-ask/r/AskReddit/comments/n92xx9/whats_a_polite_way_of_asking_people_to_go_fuck.json": "What's a polite way of asking people to go \"fuck themselves\" ?",
  "data/reddit-ask/r/AskReddit/comments/n93y5x/redditors_who_were_raised_in_cults_when_was_the.json": "Redditors who were raised in cults, when was the first time you realized something was wrong?",
  "data/reddit-ask/r/AskReddit/comments/n9458v/whats_a_movie_you_can_watch_several_times_and.json": "What’s a movie you can watch several times and still genuinely not understand at all?",
  "data/reddit-ask/r/AskReddit/comments/n94xyn/whats_the_most_unprofessional_thing_a_doctor_has.json": "What's the most unprofessional thing a doctor has ever said to you?",
  "data/reddit-ask/r/AskReddit/comments/n94yu9/what_makes_you_think_to_yourself_yup_im_in_love.json": "What makes you think to yourself “Yup, I’m in love with this person”?",
  "data/reddit-ask/r/AskReddit/comments/n965f5/where_can_you_go_on_reddit_to_actually_speak_to.json": "Where can you go on Reddit to actually speak to kind people?",
  "data/reddit-ask/r/AskReddit/comments/n9e99u/which_group_of_snobs_do_you_have_the_biggest.json": "Which group of snobs do you have the biggest problem with?",
  "data/reddit-ask/r/AskReddit/comments/n9lb75/people_who_upvote_but_dont_comment_why.json": "People who upvote, but don’t comment why?",
  "data/reddit-ask/r/AskReddit/comments/n9lx7p/if_elon_musk_can_tank_a_cryptocurrency_with_a.json": "If Elon Musk can tank a cryptocurrency with a lame joke, what does that say about the viability and intrinsic value of cryptocurrencies as a whole?",
  "data/reddit-ask/r/AskReddit/comments/n9rgyw/in_english_we_steal_words_like_voila_that_dont.json": "In English we steal words like “voila” that don’t have an equivalent in our language. Non-english speakers of reddit, what are some stolen words like this in your language?",
  "data/reddit-ask/r/AskReddit/comments/n9td6q/you_die_and_wake_up_in_a_valhalla_for_florida_men.json": "You die and wake up in a Valhalla for Florida men, they give you the head seat at the table. What did you do to get there?",
  "data/reddit-ask/r/AskReddit/comments/n9tr3u/what_would_you_first_do_if_you_ever_became_a.json": "What would you first do if you ever became a billionaire?",
  "data/reddit-ask/r/AskReddit/comments/n9ve5h/whats_the_most_random_fact_you_know_about.json": "What's the most random fact you know about?",
  "data/reddit-ask/r/AskReddit/comments/n9wfai/what_are_the_little_things_that_make_you_happy.json": "What are the little things that make you happy and enjoy life more?",
  "data/reddit-ask/r/AskReddit/comments/n9zzu3/what_is_your_best_chuckles_im_in_danger_story.json": "What is Your Best \"(chuckles) I'm in Danger\" Story? What Happened?",
  "data/reddit-ask/r/AskReddit/comments/na0ptq/what_if_earth_is_already_hell.json": "What if earth is already hell?",
  "data/reddit-ask/r/AskReddit/comments/na35f4/redditors_who_have_found_dead_bodies_whats_the.json": "Redditors who have found dead bodies, what’s the story?",
  "data/reddit-ask/r/AskReddit/comments/na60ls/whats_one_villain_that_was_supposed_to_be.json": "What’s one villain that was supposed to be sympathetic but failed to spark any sympathy?",
  "data/reddit-ask/r/AskReddit/comments/na89gs/people_old_enough_to_remember_life_preinternet.json": "People old enough to remember life pre-Internet, what are some less obvious things you miss about that time?",
  "data/reddit-ask/r/AskReddit/comments/nabulv/whats_the_scariest_thing_youve_ever_stood_face_to.json": "What's the scariest thing you've ever stood face to face with?",
  "data/reddit-ask/r/AskReddit/comments/nac3no/who_actually_enjoys_home_office_and_would_rather.json": "Who actually enjoys home office and would rather never go back to their office life?",
  "data/reddit-ask/r/AskReddit/comments/nac9j8/what_do_people_think_is_a_scam_but_they_just_dont.json": "What do people think is a scam but they just don't understand?",
  "data/reddit-ask/r/AskReddit/comments/nadfrn/people_who_stockpiled_toilet_paperhave_you_used.json": "People who stockpiled toilet paper-have you used it all yet?",
  "data/reddit-ask/r/AskReddit/comments/nadgd5/what_is_the_most_penny_pinching_shit_you_ever_did.json": "What is the most penny pinching shit you ever did?",
  "data/reddit-ask/r/AskReddit/comments/nadv9d/whats_your_go_to_under_5_minute_meal.json": "What's your go to under 5 minute meal?",
  "data/reddit-ask/r/AskReddit/comments/naljsw/what_quote_do_you_live_by.json": "what quote do you live by?",
  "data/reddit-ask/r/AskReddit/comments/nam7p7/people_who_download_porn_and_save_it_on_your.json": "People who download porn and save it on your computer, why do you save it as there is an endless supply of porn out there?",
  "data/reddit-ask/r/AskReddit/comments/namp80/so_america_hows_life_under_joe_biden_going.json": "So America how’s life under Joe Biden going?",
  "data/reddit-ask/r/AskReddit/comments/nanp0c/whats_a_good_sign_that_someone_isnt_as_smart_as.json": "What's a good sign that someone isn't as smart as they think?",
  "data/reddit-ask/r/AskReddit/comments/narjuk/people_who_were_caught_cheating_or_caught_someone.json": "People who were caught cheating or caught someone cheating, what is your story ?",
  "data/reddit-ask/r/AskReddit/comments/naww9e/whats_the_dumbest_thing_you_were_paid_to_do_and.json": "What's the dumbest thing you were paid to do and how much were you paid?",
  "data/reddit-ask/r/AskReddit/comments/naywgq/which_actor_was_perfectly_selected_for_his_or_her.json": "Which actor was perfectly selected for his or her respective role in a film?",
  "data/reddit-ask/r/AskReddit/comments/nazvbt/british_people_of_reddit_why_is_hell_so_bloody.json": "British people of reddit, why is hell so bloody?",
  "data/reddit-ask/r/AskReddit/comments/nb3den/what_did_you_witness_or_overhear_as_a_child_that.json": "What did you witness or overhear as a child that still haunts you today as an adult?",
  "data/reddit-ask/r/AskReddit/comments/nb5bvm/what_is_the_shittiest_way_youve_been_woken_up.json": "What is the shittiest way you’ve been woken up?",
  "data/reddit-ask/r/AskReddit/comments/nb6txz/what_is_your_most_unpopular_music_opinion.json": "What is your most unpopular music opinion?",
  "data/reddit-ask/r/AskReddit/comments/nb99ql/whats_the_best_board_game_ever.json": "What’s the best board game ever?",
  "data/reddit-ask/r/AskReddit/comments/nb9hp4/what_google_search_result_should_you_never_look.json": "What Google search result should you never look at the images for?",
  "data/reddit-ask/r/AskReddit/comments/nba5k0/people_who_discovered_their_passion_at_a_later.json": "People who discovered their passion at a later stage of life, what is it and how did you figure it out?",
  "data/reddit-ask/r/AskReddit/comments/nbaar5/those_who_have_been_to_a_ruined_wedding_what.json": "Those who have been to a ruined wedding, what happened?",
  "data/reddit-ask/r/AskReddit/comments/nbhp7e/what_is_something_you_thought_as_a_kid_was_a_sign.json": "What is something you thought as a kid was a sign someone was rich, but now realize is something that everyone does?",
  "data/reddit-ask/r/AskReddit/comments/nbj60o/what_is_a_fact_about_the_human_body_that_not_many.json": "What is a fact about the human body that not many people know about?",
  "data/reddit-ask/r/AskReddit/comments/nbl8uw/what_is_your_go_to_movie_when_you_need_a_laugh.json": "What is your \"go to\" movie when you need a laugh?",
  "data/reddit-ask/r/AskReddit/comments/nbnvks/whats_a_conspiracy_theory_that_annoys_you_due_to.json": "What’s a conspiracy theory that annoys you due to how easily disprovable it is?",
  "data/reddit-ask/r/AskReddit/comments/nbuk51/what_is_something_that_in_real_life_is_far_more.json": "What is something that in real life is far more horrific than the way it is depicted in movies?",
  "data/reddit-ask/r/AskReddit/comments/nbw0cm/whats_is_something_a_partner_wanted_to_try_that.json": "What’s is something a partner wanted to try that freaked you out at first but now you’re into it?",
  "data/reddit-ask/r/AskReddit/comments/nbzexz/people_who_have_overcome_any_addictionwhats_your.json": "People who have overcome any addiction....What's your secret?",
  "data/reddit-ask/r/AskReddit/comments/nc0yya/what_is_the_thing_that_surprised_you_the_most.json": "What is the thing that surprised you the most when you traveled to a country you had never been to before?",
  "data/reddit-ask/r/AskReddit/comments/nc7yur/what_movie_do_you_unironically_love_that_critics.json": "What movie do you unironically love, that critics hated?",
  "data/reddit-ask/r/AskReddit/comments/nc8fis/people_who_take_out_their_phones_to_record.json": "People who take out their phones to record strangers who are having bad days: Why?",
  "data/reddit-ask/r/AskReddit/comments/ncc61d/what_was_the_worst_human_invention_ever_made.json": "What was the worst human invention ever made?",
  "data/reddit-ask/r/AskReddit/comments/nce1yy/exdeaf_people_of_reddit_what_was_the_most.json": "Ex-deaf people of reddit, what was the most underwhelming sound, respective to your expectations?",
  "data/reddit-ask/r/AskReddit/comments/nchtg3/serious_people_who_have_been_fully_vaccinated.json": "[Serious] People who have been fully vaccinated will you continue to wear a mask even after the CDC told us we don’t have to? Why or why not?",
  "data/reddit-ask/r/AskReddit/comments/ncjc9w/who_is_the_creepiest_celebrity_that_has_yet_to_be.json": "Who is the creepiest celebrity that has yet to be publicly exposed for their past/current behavior?",
  "data/reddit-ask/r/AskReddit/comments/ncl7tg/what_needs_to_make_a_comeback.json": "What needs to make a comeback?",
  "data/reddit-ask/r/AskReddit/comments/nclxj6/what_is_the_rarest_thing_you_own.json": "What is the rarest thing you own?",
  "data/reddit-ask/r/AskReddit/comments/ncqsty/ex_homeless_people_what_are_some_things_people.json": "Ex homeless people, what are some things people dont know about the streets?",
  "data/reddit-ask/r/AskReddit/comments/ncrq91/to_those_who_never_want_to_have_a_child_what_are.json": "To those who NEVER want to have a child, what are your reasons?",
  "data/reddit-ask/r/AskReddit/comments/nctzok/who_here_has_gotten_so_used_to_wearing_face_masks.json": "Who here has gotten so used to wearing face masks now in your country/region you will carry on wearing them after they are no longer necessary?",
  "data/reddit-ask/r/AskReddit/comments/ncwng6/serious_why_do_you_think_its_ok_to_put_an_animal.json": "[Serious] Why do you think it’s ok to put an animal in pain/who is dying to sleep, but we cannot do the same for humans?",
  "data/reddit-ask/r/AskReddit/comments/ncywy8/what_is_your_most_shameful_sexmasturbation_story.json": "What is your most shameful sex/masturbation story?",
  "data/reddit-ask/r/AskReddit/comments/ncz8m2/people_with_no_children_or_pets_whats_your_phones.json": "People with no children or pets, what’s your phone’s background image?",
  "data/reddit-ask/r/AskReddit/comments/nczh6d/whats_something_inherently_toxic_that_is.json": "What’s something inherently toxic that is perceived as normal?",
  "data/reddit-ask/r/AskReddit/comments/nd1101/whats_something_people_dont_know_just_how.json": "What's something people don't know just how dangerous it actually is?",
  "data/reddit-ask/r/AskReddit/comments/nd16yo/seriousmale_sex_workers_what_is_something_the.json": "[Serious]Male sex workers, what is something the general population wouldn't consider thinking of, due to sex work being more female-focused?",
  "data/reddit-ask/r/AskReddit/comments/nd2p2j/nsfw_teachers_what_are_some_family_secrets_you.json": "[NSFW] Teachers, what are some family secrets you know about people because their kids told you?",
  "data/reddit-ask/r/AskReddit/comments/nd3us9/what_makes_someone_instantly_more_attractive.json": "What makes someone instantly more attractive?",
  "data/reddit-ask/r/AskReddit/comments/nd7vw3/what_are_signs_that_war_is_starting_soon.json": "What are signs that war is starting soon?",
  "data/reddit-ask/r/AskReddit/comments/nd9bpp/what_villain_do_you_actually_agree_withget.json": "What villain do you actually agree with/get?",
  "data/reddit-ask/r/AskReddit/comments/ndbi81/women_who_migrated_from_a_socially_conservative.json": "Women who migrated from a socially conservative country to a progressive country how significantly has your life changed?",
  "data/reddit-ask/r/AskReddit/comments/nddof1/what_is_something_thats_perfectly_legal_but.json": "What is something that's perfectly legal but raises a ton of red flags?",
  "data/reddit-ask/r/AskReddit/comments/ndfaf2/what_did_you_have_as_a_teenager_that_you_dont.json": "What did you have as a teenager that you don't have now?",
  "data/reddit-ask/r/AskReddit/comments/ndg6qf/what_is_something_people_dont_realise_is_actually.json": "What is something people don’t realise is actually affordable?",
  "data/reddit-ask/r/AskReddit/comments/ndjm1c/at_the_age_of_60_snoop_dogg_will_be_420_in_dog.json": "\"At the age of 60, Snoop Dogg will be 420 in dog years.\" What other useless fact do you know?",
  "data/reddit-ask/r/AskReddit/comments/ndnnzc/engineers_of_reddit_whats_the_most_ridiculous.json": "Engineers of Reddit, what’s the most ridiculous idiot-proofing you’ve had to add in your never-ending quest to combat stupid people?",
  "data/reddit-ask/r/AskReddit/comments/ndqcfr/you_are_standing_in_a_room_with_your_10yo_self.json": "You are standing in a room with your 10yo self. What’s one act of kindness you would do for them?",
  "data/reddit-ask/r/AskReddit/comments/nduhzy/what_is_something_nonsexual_that_your_partner.json": "What is something non-sexual that your partner does that really turns you on?",
  "data/reddit-ask/r/AskReddit/comments/ndusnf/what_film_were_you_way_too_young_to_watch.json": "What film were you WAY too young to watch?",
  "data/reddit-ask/r/AskReddit/comments/ndzo0e/what_are_some_relationship_black_flags_that_your.json": "What are some relationship \"black flags\" that your SO might be a pirate?",
  "data/reddit-ask/r/AskReddit/comments/ne02yg/what_question_was_so_dumb_that_you_asked_the.json": "What question was so dumb that you asked the person to repeat it because you thought you must have misunderstood?",
  "data/reddit-ask/r/AskReddit/comments/ne0ebt/when_has_a_conspiracy_theory_actually_turned_out.json": "When has a conspiracy theory actually turned out to be real?",
  "data/reddit-ask/r/AskReddit/comments/ne4niy/what_is_the_most_pain_youve_felt_in_a_video_game.json": "What is the most pain you've felt in a video game?",
  "data/reddit-ask/r/AskReddit/comments/ne8yi5/elon_musk_said_in_an_interview_my_children_didnt.json": "Elon Musk said in an interview “My children didn’t choose to be born, I chose to have children . They owe me nothing, I owe them everything.”What is your opinion on this statement?",
  "data/reddit-ask/r/AskReddit/comments/neer2e/what_is_a_random_combination_of_food_you_always.json": "What is a random combination of food you always eat but don’t tell anyone because you know it sounds nasty together?",
  "data/reddit-ask/r/AskReddit/comments/nefz6z/what_doesnt_get_enough_attention.json": "What doesn't get enough attention?",
  "data/reddit-ask/r/AskReddit/comments/neleiu/anyone_else_feel_sad_every_year_on_their_birthday.json": "Anyone else feel sad every year on their birthday? What do you think is the reason for this?",
  "data/reddit-ask/r/AskReddit/comments/nepeul/when_you_die_you_get_to_see_the_statistics_from.json": "When you die you get to see the statistics from your entire life. What statistics do you look at first?",
  "data/reddit-ask/r/AskReddit/comments/nes9hb/what_is_the_best_legal_way_to_annoy_your.json": "What is the best LEGAL way to annoy your neighbors you can think of?",
  "data/reddit-ask/r/AskReddit/comments/netx83/what_is_the_most_nsfw_thing_that_has_happened_at.json": "What is the most nsfw thing that has happened at your school that you witnessed?",
  "data/reddit-ask/r/AskReddit/comments/nevwd6/people_who_hear_that_someone_has_a_lifelong.json": "People who hear that someone has a lifelong problem (like insomnia or psoriasis) and immediately start dictating basic Google advice like this person has never bothered to help themselves before: why are you like this?",
  "data/reddit-ask/r/AskReddit/comments/new8ad/what_is_your_favorite_futurama_quote.json": "What is your favorite Futurama quote?",
  "data/reddit-ask/r/AskReddit/comments/nex4sl/whos_your_favorite_comedian.json": "Who's your favorite comedian?",
  "data/reddit-ask/r/AskReddit/comments/nex7oq/whats_the_best_name_for_a_cat_youve_ever.json": "What's the best name for a cat you've ever encountered?",
  "data/reddit-ask/r/AskReddit/comments/nezmgu/a_mysterious_man_approaches_you_offering_1000_if.json": "A mysterious man approaches you, offering $1000 if you can make him laugh. What's your joke?",
  "data/reddit-ask/r/AskReddit/comments/nf6e4j/if_all_dogs_go_to_heaven_which_animals_go_to_hell.json": "If all dogs go to heaven, which animals go to hell?",
  "data/reddit-ask/r/AskReddit/comments/nf8v3i/what_is_your_dream_vacation_destination.json": "What is your dream vacation destination?",
  "data/reddit-ask/r/AskReddit/comments/nfacjk/if_people_couldnt_handle_being_quarantined_with.json": "If people couldn’t handle being quarantined with their families, how are humans going to live on Mars, where is till be like that almost 24/7?",
  "data/reddit-ask/r/AskReddit/comments/nfe0cl/whats_a_psych_trick_you_love_to_use.json": "What's a psych trick you love to use?",
  "data/reddit-ask/r/AskReddit/comments/nfesyx/what_nonsexual_thing_feels_very_sexual.json": "What non-sexual thing feels very sexual?",
  "data/reddit-ask/r/AskReddit/comments/nffccj/which_comedian_that_other_people_seem_to_love_do.json": "Which Comedian that other people seem to love, do you find utterly unfunny?",
  "data/reddit-ask/r/AskReddit/comments/nfl689/serious_what_is_the_scariest_thing_you_have_seen.json": "[serious] what is the scariest thing you have seen ever?",
  "data/reddit-ask/r/AskReddit/comments/nfn757/which_us_state_do_you_want_to_travel_to_and_why.json": "Which U.S. state do you want to travel to and why?",
  "data/reddit-ask/r/AskReddit/comments/nfnfj9/if_james_bond_was_such_a_great_spy_why_did.json": "If James Bond was such a great spy, why did everyone know who he was?",
  "data/reddit-ask/r/AskReddit/comments/nfrs51/if_everyone_in_the_world_had_your_personality.json": "If everyone in the world had your personality, what would the world look like?",
  "data/reddit-ask/r/AskReddit/comments/nfsf4m/in_your_opinion_which_animal_is_the_most.json": "In your opinion which animal is the most suspicious, and why?",
  "data/reddit-ask/r/AskReddit/comments/nft4gs/before_you_actually_learned_how_did_you_think.json": "Before you actually learned, how did you think babies were born?",
  "data/reddit-ask/r/AskReddit/comments/ng57l2/how_has_video_games_positively_impacted_your_life.json": "How has video games positively impacted your life?",
  "data/reddit-ask/r/AskReddit/comments/ng67ln/what_is_the_biggest_scandal_thats_ever_happened.json": "What is the biggest scandal thats ever happened at your school?",
  "data/reddit-ask/r/AskReddit/comments/ng8a70/what_is_something_that_existed_before_the.json": "What is something that existed before the pandemic hit, that no longer exists?",
  "data/reddit-ask/r/AskReddit/comments/nga1vp/whats_a_hobby_thats_dying_in_popularity.json": "What’s a hobby that’s dying in popularity?",
  "data/reddit-ask/r/AskReddit/comments/ngcm9z/whats_the_most_embarrassing_date_youve_been_on.json": "What's the most embarrassing date you've been on ?",
  "data/reddit-ask/r/AskReddit/comments/ngev2u/you_suddenly_find_yourself_onstage_for_your_own.json": "You suddenly find yourself on-stage for your own TED Talk. With no prior planning, what’s a topic you can discuss for 18 minutes?",
  "data/reddit-ask/r/AskReddit/comments/ngla5u/is_there_an_actoractress_whose_movies_you_will.json": "Is there an actor/actress whose movies you will not watch? If so, who and why?",
  "data/reddit-ask/r/AskReddit/comments/ngzd4a/people_born_on_24th_july_how_does_it_feel.json": "People born on 24th July, how does it feel celebrating 24/7?",
  "data/reddit-ask/r/AskReddit/comments/nh0b4h/whats_the_one_thing_you_regret_doing_for_your.json": "What's the one thing you regret doing for your wedding day?",
  "data/reddit-ask/r/AskReddit/comments/nh2lfn/people_whove_befriended_the_quiet_kid_in_school.json": "people who've befriended \"the quiet kid\" in school, what things did you wish your other classmates knew about them?",
  "data/reddit-ask/r/AskReddit/comments/nh4f0c/you_get_to_go_into_any_fictional_universe_for_30.json": "You get to go into any fictional universe for 30 days. Anything you buy, skills acquired, etc will be transferred to the real world, with zero reprecussions. Where do you go?",
  "data/reddit-ask/r/AskReddit/comments/nh4ipu/have_you_ever_found_a_song_that_described_your.json": "Have you ever found a song that described your life situation at the time so well you thought it was made for you? What was your song?",
  "data/reddit-ask/r/AskReddit/comments/nh6n43/what_are_you_sick_and_tired_of_hearing_about.json": "What are you sick and tired of hearing about?",
  "data/reddit-ask/r/AskReddit/comments/nhbxnz/whats_the_cringiest_worst_examples_of_buttkissing.json": "What's the cringiest/ worst examples of butt-kissing you've seen at work?",
  "data/reddit-ask/r/AskReddit/comments/nhhq09/what_is_something_that_sounds_futuristic_but_is.json": "What is something that sounds futuristic but is happening now?",
  "data/reddit-ask/r/AskReddit/comments/nhjvkw/what_is_an_underrated_horror_film_more_people.json": "What is an underrated horror film more people should see?",
  "data/reddit-ask/r/AskReddit/comments/nho6g4/what_tv_series_had_an_ending_that_fans_actually.json": "What tv series had an ending that fans actually liked?",
  "data/reddit-ask/r/AskReddit/comments/nhrolu/what_is_the_worst_possible_way_to_be_rejected.json": "What is the worst possible way to be rejected?",
  "data/reddit-ask/r/AskReddit/comments/nhtdin/what_is_a_seemingly_superhuman_ability_thats.json": "what is a seemingly superhuman ability that's natural to humans?",
  "data/reddit-ask/r/AskReddit/comments/nhtdw9/what_was_the_greatest_pain_youve_experienced.json": "What was the greatest pain you've experienced?",
  "data/reddit-ask/r/AskReddit/comments/nhtjzc/what_movie_is_so_good_youd_recommend_it_to_all.json": "What movie is so good you'd recommend it to all your friends, but so emotionally traumatic that you'll never watch it again?",
  "data/reddit-ask/r/AskReddit/comments/nhuvp4/what_is_something_your_younger_self_did_that.json": "What is something your younger self did that makes your current self cringe?",
  "data/reddit-ask/r/AskReddit/comments/ni1ufk/today_is_the_21st_day_of_the_21st_week_of_the.json": "Today is the 21st day of the 21st week of the 21st year of the 21st century. This will only happen once, ever. How will you make it known that you were alive on this day?",
  "data/reddit-ask/r/AskReddit/comments/ni610a/longtime_elementary_school_teachers_which_of_your.json": "Long-time elementary school teachers, which of your former students surprised you the most by their adult life outcomes or personality?",
  "data/reddit-ask/r/AskReddit/comments/ni6brm/what_is_an_underrated_way_of_improving_your.json": "What is an underrated way of improving your appearance?",
  "data/reddit-ask/r/AskReddit/comments/ni8exd/what_tv_show_have_you_rewatched_more_than_5_times.json": "What TV show have you rewatched more than 5 times and you still find entertaining?",
  "data/reddit-ask/r/AskReddit/comments/ni8xy1/if_you_just_won_a_lifetime_supply_of_the_last.json": "If you just won a lifetime supply of the last thing you bought: what would it be?",
  "data/reddit-ask/r/AskReddit/comments/ni98gm/which_fictional_universe_would_actually_be_awful.json": "Which fictional universe would actually be awful to live in?",
  "data/reddit-ask/r/AskReddit/comments/nid073/whats_a_common_kink_that_you_just_dont_get.json": "What's a common kink that you just don't get?",
  "data/reddit-ask/r/AskReddit/comments/nif96f/what_scene_in_a_movie_really_irritated_the_shit.json": "What scene in a movie really irritated the shit out of you?",
  "data/reddit-ask/r/AskReddit/comments/nig6tt/what_do_people_learn_to_late.json": "What do people learn to late?",
  "data/reddit-ask/r/AskReddit/comments/nih9ns/overthinkers_of_reddit_what_was_it_today.json": "Overthinkers of reddit, What was it today?",
  "data/reddit-ask/r/AskReddit/comments/nihv9y/when_did_you_miss_an_obvious_hint_that_someone.json": "When did you miss an obvious hint that someone wanted to have sexual relations with you?",
  "data/reddit-ask/r/AskReddit/comments/nimtr7/whats_the_saddest_fact_you_know.json": "What’s the saddest fact you know?",
  "data/reddit-ask/r/AskReddit/comments/nin43v/whats_an_old_game_you_want_a_modern_remake_of.json": "What's an old game you want a modern remake of?",
  "data/reddit-ask/r/AskReddit/comments/nisbgl/what_fictional_character_would_you_100_screw.json": "What fictional character would you 100% screw?",
  "data/reddit-ask/r/AskReddit/comments/nisez9/people_who_are_good_at_flirting_what_are_some.json": "People who are good at flirting, what are some social cues us oblivious people should watch out for?",
  "data/reddit-ask/r/AskReddit/comments/nj15al/youll_get_paid_1000_an_hour_to_annoy_your_worst.json": "You’ll get paid $1000 an hour to annoy your worst enemy with minor inconveniences. What do you do?",
  "data/reddit-ask/r/AskReddit/comments/nj297q/without_touching_religion_politics_race_and_sex.json": "Without touching religion, politics, race and sex, what's the best way to enrage the biggest amount of people?",
  "data/reddit-ask/r/AskReddit/comments/nj550s/after_you_die_someone_takes_a_vr_headset_off_your.json": "After you die, someone takes a VR headset off your face and asks: \"how was it?\". What would be your response?",
  "data/reddit-ask/r/AskReddit/comments/nj5js1/you_wake_up_one_day_and_gain_the_ability_to_get_a.json": "You wake up one day and gain the ability to get a full night's rest in 20 minutes. How will you use the extra time you have acquired?",
  "data/reddit-ask/r/AskReddit/comments/nj5kai/if_cinderellas_shoe_fit_so_perfectly_why_did_it.json": "If Cinderella's shoe fit so perfectly, why did it fall off in the first place?",
  "data/reddit-ask/r/AskReddit/comments/nj64sd/which_dead_celebrities_are_treated_like_saints.json": "Which dead celebrities are treated like saints, but were truly awful people when they were alive ?",
  "data/reddit-ask/r/AskReddit/comments/nj7aho/what_is_your_favorite_profanityfree_insult.json": "What is your favorite profanity-free insult?",
  "data/reddit-ask/r/AskReddit/comments/nj87n3/serious_hello_scientists_of_reddit_whats_a_scary.json": "[Serious] Hello scientists of reddit, what's a scary science fact that the public knows nothing about?",
  "data/reddit-ask/r/AskReddit/comments/nja89v/what_was_the_weirdestoddestmost_shocking_thing.json": "What was the weirdest/oddest/most shocking thing you found when clearing out the things of someone who passed on?",
  "data/reddit-ask/r/AskReddit/comments/nje3ki/your_rap_name_is_lil_and_the_last_thing_you_spent.json": "Your rap name is “Lil” and the last thing you spent money on. What is your name?",
  "data/reddit-ask/r/AskReddit/comments/njeybd/what_if_f_scott_fitzgerald_came_back_up_to_earth.json": "what if f scott fitzgerald came back up to earth and said “it’s pronounced jatsby” and left?",
  "data/reddit-ask/r/AskReddit/comments/njfyku/what_job_exists_because_we_are_stupid.json": "What job exists because we are stupid?",
  "data/reddit-ask/r/AskReddit/comments/njhdh0/those_whove_never_had_to_dig_through_the_trash_to.json": "Those who’ve never had to dig through the trash to read cooking instructions on a package before, how’s life going for you?",
  "data/reddit-ask/r/AskReddit/comments/njrvgm/what_made_you_straight_up_nope_out_of_a.json": "What made you straight up \"nope\" out of a relationship?",
  "data/reddit-ask/r/AskReddit/comments/nju6u7/what_can_someone_learn_in_10_minutes_that_will_be.json": "What can someone learn in 10 minutes that will be useful for the rest of their life?",
  "data/reddit-ask/r/AskReddit/comments/njuqy4/in_what_movie_did_you_relate_more_with_the.json": "In what movie did you relate more with the antagonist?",
  "data/reddit-ask/r/AskReddit/comments/njvegv/whats_good_as_a_hobby_but_terrible_as_a_profession.json": "What's good as a hobby but terrible as a profession?",
  "data/reddit-ask/r/AskReddit/comments/njwwey/why_did_elementary_schools_just_randomly_bring_in.json": "why did elementary schools just randomly bring in a dude with a big snake. who was that man. what were his credentials?",
  "data/reddit-ask/r/AskReddit/comments/njzetq/what_genuinely_scares_you_to_the_core.json": "What genuinely scares you to the core?",
  "data/reddit-ask/r/AskReddit/comments/nk0bq4/if_you_could_give_a_1116_year_old_some_life.json": "If you could give a 11-16 year old some life advice what would it be?",
  "data/reddit-ask/r/AskReddit/comments/nk1srj/fellow_humans_of_reddit_whats_your_favorite_thing.json": "Fellow humans of Reddit, what's your favorite thing about Earth's Defense System?",
  "data/reddit-ask/r/AskReddit/comments/nk26ko/people_who_take_an_hour_showering_what_do_you_do.json": "People who take an hour showering, what do you do?",
  "data/reddit-ask/r/AskReddit/comments/nk7kep/serious_people_of_reddit_what_is_a_normal.json": "[Serious] People of reddit, what is a normal parenting tactic that shouldn't be considered normal?",
  "data/reddit-ask/r/AskReddit/comments/nka5r7/ice_cream_is_now_illegal_whats_its_street_name.json": "Ice Cream is now illegal. What‘s it‘s street name?",
  "data/reddit-ask/r/AskReddit/comments/nkfqg2/people_who_hoarded_gas_two_weeks_ago_how_are.json": "People who hoarded gas two weeks ago: how are things going for you now?",
  "data/reddit-ask/r/AskReddit/comments/nki7wg/adults_of_reddit_who_havent_been_asked_since_they.json": "Adults of reddit who haven't been asked since they were kids, what is your favorite dinosaur and why?",
  "data/reddit-ask/r/AskReddit/comments/nkrh32/what_is_something_you_say_to_scammers_instead_of.json": "What is something you say to scammers instead of hanging up?",
  "data/reddit-ask/r/AskReddit/comments/nkse2o/boys_if_it_was_considered_more_universally.json": "Boys, if it was considered more universally acceptable, what is a “girly” thing you would do?",
  "data/reddit-ask/r/AskReddit/comments/nkvjx8/serious_people_with_nightmare_siblings_whats_the.json": "[serious] People with nightmare siblings: what’s the most fucked up thing they ever did?",
  "data/reddit-ask/r/AskReddit/comments/nl3dsk/what_job_or_profession_seems_easy_but_is_actually.json": "What job or profession seems easy but is actually very challenging?",
  "data/reddit-ask/r/AskReddit/comments/nl73k9/youre_allowed_to_listen_to_one_song_before_you.json": "You’re allowed to listen to one song before you die. What song is it?",
  "data/reddit-ask/r/AskReddit/comments/nl9y9d/what_is_the_weirdest_thing_you_have_ever_heard_in.json": "What is the weirdest thing you have ever heard in a public place?",
  "data/reddit-ask/r/AskReddit/comments/nljx0q/you_can_change_your_race_gender_age_bust_dick.json": "You can change your race, gender, age, bust, dick length, thigh size, and everything about your body. What shall you do?",
  "data/reddit-ask/r/AskReddit/comments/nlnf8c/you_can_choose_any_famous_person_in_the_world_to.json": "You can choose ANY famous person in the world to show up at your funeral to cause the biggest confusion possible: who do you pick and why?",
  "data/reddit-ask/r/AskReddit/comments/nlplo9/what_is_the_most_pleasent_nonsexual_nondrug.json": "What is the most pleasent - non-sexual , non-drug - experience a human can have?",
  "data/reddit-ask/r/AskReddit/comments/nlv3xg/what_discontinued_food_do_you_wish_was_brought.json": "What discontinued food do you wish was brought back?",
  "data/reddit-ask/r/AskReddit/comments/nlxc3e/adults_of_reddit_how_did_you_cope_with_the_fact.json": "Adults of Reddit, how did you cope with the fact that your high school life is over?",
  "data/reddit-ask/r/AskReddit/comments/nlyppu/what_is_a_thing_that_a_lot_of_movies_do_that_you.json": "What is a thing that a lot of movies do that you absolutely hate?",
  "data/reddit-ask/r/AskReddit/comments/nlz62m/whats_one_phrase_that_makes_you_go_thats_just.json": "What's one phrase that makes you go \"that's just bullshit\" every time you hear it?",
  "data/reddit-ask/r/AskReddit/comments/nm2x50/left_handers_what_do_you_still_struggle_with_in.json": "Left handers. What do you still struggle with in today's age?",
  "data/reddit-ask/r/AskReddit/comments/nm99x6/what_fictional_weapon_do_you_wish_existed_and_why.json": "What fictional weapon do you wish existed and why?",
  "data/reddit-ask/r/AskReddit/comments/nma2th/what_was_the_creepiest_thing_that_ever_happened.json": "What was the creepiest thing that ever happened to you when you were at home?",
  "data/reddit-ask/r/AskReddit/comments/nmaw8z/what_are_some_small_unnoticed_ways_we_as_a.json": "What are some small, unnoticed ways we as a society have made social progress in the last two decades?",
  "data/reddit-ask/r/AskReddit/comments/nmec1v/whats_the_most_useless_talent_you_have.json": "What's the most useless talent you have?",
  "data/reddit-ask/r/AskReddit/comments/nmedwm/what_celebrity_commonly_viewed_as_attractive_do.json": "What celebrity commonly viewed as attractive do you just not see the appeal in?",
  "data/reddit-ask/r/AskReddit/comments/nmjnv7/whats_your_favorite_mitch_hedburg_joke.json": "What's your favorite Mitch Hedburg joke?",
  "data/reddit-ask/r/AskReddit/comments/nmnsux/whats_the_biggest_governmental_fuck_up_of_your.json": "What’s the biggest governmental fuck up of your country’s history?",
  "data/reddit-ask/r/AskReddit/comments/nmo5el/out_of_all_the_mythologies_that_have_ever_existed.json": "Out of all the Mythologies that have ever existed, what is your favourite god and why?",
  "data/reddit-ask/r/AskReddit/comments/nmoye3/whats_something_cool_now_that_used_to_be.json": "What’s something cool now that used to be considered uncool?",
  "data/reddit-ask/r/AskReddit/comments/nmxbor/people_who_have_been_in_a_coma_what_was_it_like.json": "People who have been in a coma, what was it like? Do you dream? Does it feel like you've been asleep for a long time?",
  "data/reddit-ask/r/AskReddit/comments/nmy1er/whats_some_popular_selfcareselflove_advice_that.json": "What's some popular self-care/self-love advice that is actually really toxic?",
  "data/reddit-ask/r/AskReddit/comments/nmzbii/if_you_were_filthy_rich_what_extremely_spoiled.json": "If you were filthy rich, what extremely spoiled convenience would you pay stupid amounts of money for?",
  "data/reddit-ask/r/AskReddit/comments/nn0r9k/chefs_of_reddit_what_are_some_obvious_signs_youd.json": "Chefs of reddit, what are some obvious signs you'd pick up on that the average joe wouldn't when you enter a restaurant that its going to be low quality?",
  "data/reddit-ask/r/AskReddit/comments/nn4a4n/serious_would_you_ever_not_date_someone_because.json": "[Serious] Would you ever NOT date someone because of their political views and stances on various social/public issues? Why, why not?",
  "data/reddit-ask/r/AskReddit/comments/nnakg2/what_are_some_productive_ways_to_let_your_anger.json": "What are some productive ways to let your anger out?",
  "data/reddit-ask/r/AskReddit/comments/nnane8/people_of_reddit_who_grew_up_on_cartoons_what_is.json": "People of reddit who grew up on cartoons what is your favorite cartoon?",
  "data/reddit-ask/r/AskReddit/comments/nnaqfr/whats_the_greatest_scam_of_all_time.json": "What's the greatest scam of all time?",
  "data/reddit-ask/r/AskReddit/comments/nngv9m/whats_the_most_creative_punishment_your_parents.json": "What's the most creative punishment your parents gave to you?",
  "data/reddit-ask/r/AskReddit/comments/nnj3w7/people_who_choose_to_be_kind_everyday_despite_of.json": "People who choose to be kind everyday despite of not receiving the same kindness back , what motivates you ?",
  "data/reddit-ask/r/AskReddit/comments/nnjyig/what_is_the_best_mental_health_advice_you_were.json": "What is the best mental health advice you were ever given?",
  "data/reddit-ask/r/AskReddit/comments/nnmw3f/whats_the_most_unsatisfying_bs_ending_to_a_tv.json": "What’s the most unsatisfying BS ending to a TV series?",
  "data/reddit-ask/r/AskReddit/comments/nnnzeg/what_was_the_weirdest_thing_youve_seen_someone.json": "What was the weirdest thing you’ve seen someone fake for attention?",
  "data/reddit-ask/r/AskReddit/comments/nns8ge/whats_the_most_fucked_up_thing_someone_has_told.json": "What's the most fucked up thing someone has told you about themselves after barely getting to know them?",
  "data/reddit-ask/r/AskReddit/comments/nnvxrz/sons_of_single_mothers_what_is_something_all_moms.json": "Sons of single mothers, what is something all moms need to know while raising a boy?",
  "data/reddit-ask/r/AskReddit/comments/no0zpk/what_is_the_ugliest_city_you_have_ever_visited.json": "What is the ugliest city you have ever visited?",
  "data/reddit-ask/r/AskReddit/comments/no7b3v/daughters_of_single_fathers_whats_something_all.json": "Daughters of single fathers, what’s something all dads need to know about raising a girl?",
  "data/reddit-ask/r/AskReddit/comments/nobiq9/parents_who_told_your_children_to_clean_their.json": "Parents who told your children to clean their room when guests were coming over, what were the guests going to be doing in your kid's room?",
  "data/reddit-ask/r/AskReddit/comments/nogos5/what_are_your_do_nots_in_a_fine_dining_situation.json": "What are your \"do nots\" in a fine dining situation?",
  "data/reddit-ask/r/AskReddit/comments/nohol0/doctors_of_reddit_what_was_the_weirdest_thing_you.json": "Doctors of Reddit, what was the weirdest thing you even seen in someone’s body?",
  "data/reddit-ask/r/AskReddit/comments/nohvkq/what_is_something_that_everyone_looks_stupid_doing.json": "What is something that everyone looks stupid doing?",
  "data/reddit-ask/r/AskReddit/comments/nol5mp/what_is_a_simple_painful_fact_that_people_need_to.json": "What is a simple, painful fact that people need to just get over and accept?",
  "data/reddit-ask/r/AskReddit/comments/nop3h9/serious_travelers_of_lonely_roads_explorers_of.json": "[Serious] Travelers of lonely roads, explorers of the great outdoors, workers of creepy jobs and late-night shifts... What's your scary story? And why?",
  "data/reddit-ask/r/AskReddit/comments/np0xcu/what_is_the_most_ridiculous_thing_that_you_have.json": "What is the most ridiculous thing that you have ever had to explain to somebody?",
  "data/reddit-ask/r/AskReddit/comments/np0z09/serious_women_of_reddit_who_were_proposed_to_by.json": "[Serious] Women of Reddit who were proposed to by their SO and said no, what's your story?",
  "data/reddit-ask/r/AskReddit/comments/np51d9/what_is_an_animals_mating_ritual_youre_glad.json": "What is an animal's mating ritual you're glad humans don't have?",
  "data/reddit-ask/r/AskReddit/comments/np8qx3/what_made_you_lose_respect_for_someone.json": "What made you lose respect for someone?",
  "data/reddit-ask/r/AskWomen/comments/n28xgb/what_are_your_best_low_maintenance_beauty_tips.json": "What are your best low maintenance beauty tips?",
  "data/reddit-ask/r/AskWomen/comments/n29x34/just_a_guy_here_with_a_question_when_youre.json": "Just a guy here with a question. When you're driving a car and wearing high heels, which part of the shoe is resting on the floor of the foot well? Is it pivoting off of the tip of the heel?",
  "data/reddit-ask/r/AskWomen/comments/n2gjck/when_have_you_wondered_if_you_are_just_too_much.json": "When have you wondered if you are just too much of an a-hole to have friends and maybe you should just be alone?",
  "data/reddit-ask/r/AskWomen/comments/n2j0hq/do_you_hear_your_voice_while_thinking_or_reading.json": "Do you “ hear” your voice while thinking or reading this question? If so, how does that voice sound?",
  "data/reddit-ask/r/AskWomen/comments/n2kkcj/did_you_and_your_so_had_a_talk_about_what_will.json": "Did you and your SO had a talk about what will happen if one of you dies? What was the outcome of that talk?",
  "data/reddit-ask/r/AskWomen/comments/n2l0ny/what_fictional_character_is_misunderstood_or.json": "What fictional character is misunderstood or deserves more sympathy?",
  "data/reddit-ask/r/AskWomen/comments/n2u8o7/what_is_a_word_that_people_have_used_to_described.json": "What is a word that people have used to described you that you absolutely hate?",
  "data/reddit-ask/r/AskWomen/comments/n30b82/what_are_the_best_self_defense_items_like_pepper.json": "What are the best self defense items (like pepper spray, key knife, etc) that are typical household items?",
  "data/reddit-ask/r/AskWomen/comments/n34z8r/what_are_some_traits_that_give_you_nice_guy_vibes.json": "What are some traits that give you nice guy vibes?",
  "data/reddit-ask/r/AskWomen/comments/n36ijq/women_of_reddit_what_are_some_things_that_you_do.json": "Women of reddit, what are some things that you do when you can't seem to pull yourself together?",
  "data/reddit-ask/r/AskWomen/comments/n3buc9/women_of_reddit_what_books_have_you_read_that.json": "Women of Reddit, what books have you read that helped you become a better person?",
  "data/reddit-ask/r/AskWomen/comments/n3cf74/what_is_one_personality_trait_you_got_told_was.json": "What is one personality trait you got told was bad growing up but has actually helped you as an adult?",
  "data/reddit-ask/r/AskWomen/comments/n3etd1/what_luxury_do_you_unapologetically_spend_too.json": "What luxury do you unapologetically spend too much money on?",
  "data/reddit-ask/r/AskWomen/comments/n3n8b0/how_do_you_set_boundaries_for_men_who_treat_you.json": "How do you set boundaries for men who treat you like a free therapist?",
  "data/reddit-ask/r/AskWomen/comments/n3s72u/how_do_you_deal_with_people_who_dismiss_your.json": "How do you deal with people who dismiss your hard-earned fit/healthy sized body as “lucky you have a fast metabolism”?",
  "data/reddit-ask/r/AskWomen/comments/n4blpi/what_is_one_thing_that_made_you_think_im_getting.json": "What is one thing that made you think “I’m getting old”?",
  "data/reddit-ask/r/AskWomen/comments/n4e50e/how_do_you_pick_yourself_up_again_when_youve_been.json": "How do you pick yourself up again when you’ve been struggling with your mental health?",
  "data/reddit-ask/r/AskWomen/comments/n4gj7a/what_female_body_features_or_types_do_you_love.json": "What female body features or types do you LOVE?",
  "data/reddit-ask/r/AskWomen/comments/n4q9ag/why_is_it_hard_to_quit_your_job_even_if_you_hate.json": "Why is it hard to quit your job, even if you hate it?",
  "data/reddit-ask/r/AskWomen/comments/n4u2jy/women_with_successful_careers_and_who_have.json": "Women with successful careers and who have anxiety, any tips?",
  "data/reddit-ask/r/AskWomen/comments/n5blqn/how_do_you_physically_and_mentally_hit_refresh.json": "How do you physically and mentally \"hit refresh\" when you feel gloomy or uncomfortable?",
  "data/reddit-ask/r/AskWomen/comments/n5v4cf/how_to_deal_with_losing_multiple_friendships_in_a.json": "How to deal with losing multiple friendships in a short amount of time? Having to start over in terms of a friend circle?",
  "data/reddit-ask/r/AskWomen/comments/n67jiw/ladies_with_anxiety_when_did_you_decide_that_your.json": "Ladies with anxiety, when did you decide that your anxiety is no longer just \"regular anxiety\" and actually needs medicinal/psychiatric attention?",
  "data/reddit-ask/r/AskWomen/comments/n68bea/women_who_grew_up_in_fundamentalist_religion_and.json": "Women who grew up in fundamentalist religion and left it, what were the biggest adjustments that you had to go through?",
  "data/reddit-ask/r/AskWomen/comments/n6ld9d/women_who_struggled_to_enjoy_receiving_oral_but.json": "Women who struggled to enjoy receiving oral but now love it, what changed?",
  "data/reddit-ask/r/AskWomen/comments/n6sgho/why_are_there_so_many_people_who_are_lonely_all.json": "Why are there so many people who are lonely all over the world?",
  "data/reddit-ask/r/AskWomen/comments/n6w67j/has_anyone_ever_received_a_warning_from_a.json": "Has anyone ever received a warning from a partner's ex? How did you respond?",
  "data/reddit-ask/r/AskWomen/comments/n77otl/what_is_the_single_hardest_lesson_for_a_parent_to.json": "What is the single hardest lesson for a parent to learn about raising kids?",
  "data/reddit-ask/r/AskWomen/comments/n79gzw/women_who_stopped_looking_for_love_why_did_you.json": "Women who stopped looking for love, why did you stop ?",
  "data/reddit-ask/r/AskWomen/comments/n7av5t/what_do_you_wish_was_more_socially_acceptable.json": "What do you wish was more socially acceptable?",
  "data/reddit-ask/r/AskWomen/comments/n7n42d/how_do_you_prevent_yourself_from_marrying_a.json": "how do you prevent yourself from marrying a douchebag who does absolutely no work around the house?",
  "data/reddit-ask/r/AskWomen/comments/n88d1w/what_is_something_you_are_currently_self.json": "What is something you are currently self conscious about?",
  "data/reddit-ask/r/AskWomen/comments/n89622/women_who_kept_their_family_name_when_they_got.json": "Women who kept their family name when they got married/didn’t take their partners family name, what were your reasons for doing so and how did others react?",
  "data/reddit-ask/r/AskWomen/comments/n8a2q4/who_doesnt_like_to_receive_flowers_on_special.json": "Who doesn’t like to receive flowers on special occasions?",
  "data/reddit-ask/r/AskWomen/comments/n8l2sa/folks_who_make_100k_a_year_what_do_you_do_for.json": "Folks who make $100k+ a year, what do you do for work and how long did it take you to get there?",
  "data/reddit-ask/r/AskWomen/comments/n94800/mothers_of_siblings_what_did_you_took_way_too.json": "Mothers of siblings, what did you took way too serious with your first child, and let go with your next child/children?",
  "data/reddit-ask/r/AskWomen/comments/n9rjsk/what_was_the_best_date_youve_ever_been_on.json": "What was the best date you've ever been on?",
  "data/reddit-ask/r/AskWomen/comments/n9tr0v/how_did_you_go_from_broke_to_having_decently.json": "How did you go from broke to having decently financially stable?",
  "data/reddit-ask/r/AskWomen/comments/na2601/how_do_you_teach_your_daughters_to_love_their.json": "How do you teach your daughters to love their bodies, when their body looks so much different than the women around them?",
  "data/reddit-ask/r/AskWomen/comments/na9pq0/what_are_the_after_effects_of_having_a.json": "What are the after effects of having a hysterectomy that aren't talked about?",
  "data/reddit-ask/r/AskWomen/comments/naqgk9/when_was_the_last_time_you_checked_your_breasts.json": "When was the last time you checked your breasts?",
  "data/reddit-ask/r/AskWomen/comments/nar2y9/how_much_money_do_you_have_in_savings_and_how_do.json": "How much money do you have in savings, and how do you feel about that amount?",
  "data/reddit-ask/r/AskWomen/comments/nay9xv/what_were_some_social_rules_you_didnt_figure_out.json": "What were some \"social rules\" you didn't figure out until you were older?",
  "data/reddit-ask/r/AskWomen/comments/nbizeq/ladies_in_what_way_did_you_win_the_genetic_lottery.json": "Ladies, in what way did you “win” the genetic lottery?",
  "data/reddit-ask/r/AskWomen/comments/nboqj9/those_who_live_with_depression_how_do_you_get.json": "Those who live with depression, how do you get yourself back?",
  "data/reddit-ask/r/AskWomen/comments/nbv8b4/lets_do_some_awareness_people_with.json": "Let’s do some awareness. People with chronic/invisible illnesses, what do a typical good day and bad day look like for you?",
  "data/reddit-ask/r/AskWomen/comments/nc0iql/how_did_you_manage_to_become_significantly_more.json": "How did you manage to become significantly more attractive?",
  "data/reddit-ask/r/AskWomen/comments/nc7v8k/at_what_point_did_you_feel_like_you_needed_to.json": "At what point did you feel like you needed to start “dressing your age” instead of following the most recent fashion trends?",
  "data/reddit-ask/r/AskWomen/comments/ncc86f/when_did_you_realize_being_single_wasnt_so_bad.json": "When did you realize being single wasn’t so bad?",
  "data/reddit-ask/r/AskWomen/comments/ncvrfj/have_you_ever_struggled_so_much_that_you_think.json": "Have you ever struggled so much that you think theres no more pages to turn in your life? And that you are never ever gonna be happy ? What did you do to achieve the opposite?",
  "data/reddit-ask/r/AskWomen/comments/ndba7k/what_would_you_do_if_your_partner_cheats_on_you.json": "What would you do if your partner cheats on you with a famous person and justifies it by saying that it was a \"once-in-a-lifetime-opportunity\" and anyone would have done it?",
  "data/reddit-ask/r/AskWomen/comments/ndhv0z/what_is_one_expectation_you_had_about.json": "What Is One Expectation You Had About Relationships That Was Shattered Once You Got Into One?",
  "data/reddit-ask/r/AskWomen/comments/ndp3nq/have_you_ever_supported_a_romantic_partner.json": "Have you ever supported a romantic partner financially when they were not earning, and if so, how did it make you feel?",
  "data/reddit-ask/r/AskWomen/comments/ndv0eu/whats_something_you_dread_doing_but_are_always.json": "What’s something you dread doing but are always glad you did afterwards?",
  "data/reddit-ask/r/AskWomen/comments/ndyco4/for_women_with_guy_friends_or_guy_besties_how_do.json": "For women with guy friends or guy besties, how do you make it clear that you are only being friendly and not flirting",
  "data/reddit-ask/r/AskWomen/comments/nef63u/women_who_take_vitamins_every_day_or_regularly.json": "Women who take vitamins every day or regularly, how do they improve your health and life?",
  "data/reddit-ask/r/AskWomen/comments/ner0tu/women_who_used_to_be_mean_girls_when_you_were.json": "Women who used to be mean girls when you were younger: what things could your parents have done to prevent you from becoming a mean girl?",
  "data/reddit-ask/r/AskWomen/comments/nf0d5g/women_that_arent_big_texters_are_you_that_way.json": "Women that aren’t big texters, are you that way with everyone? Does it bother you when people take it personally?",
  "data/reddit-ask/r/AskWomen/comments/nf7ycl/what_important_life_lessons_have_you_learned_as.json": "What important life lessons have you learned as you've gotten older?",
  "data/reddit-ask/r/AskWomen/comments/nfp2ha/have_you_ever_been_told_you_are_too_curiousask.json": "Have you ever been told you are too curious/ask too many questions? How have you felt about it?",
  "data/reddit-ask/r/AskWomen/comments/nfr2bu/how_can_you_tell_when_a_man_is_trying_to_be_your.json": "How can you tell when a man is trying to be your friend versus trying to date/sleep with you?",
  "data/reddit-ask/r/AskWomen/comments/nfuhii/besides_thrifting_where_do_you_go_for_affordable.json": "Besides thrifting, where do you go for affordable, ethically sourced/produced clothes?",
  "data/reddit-ask/r/AskWomen/comments/nfuz3d/how_to_check_our_breasts_for_lumps_how_do_they.json": "How to check our breasts for lumps? How do they feel like?",
  "data/reddit-ask/r/AskWomen/comments/ng6jc2/i_saw_online_that_if_someone_really_liked_you.json": "I saw online that if someone really liked you they’ll slow down to walk with you. Do you and your partner walk together when you’re outside or do they walk ahead of you? What is your relationship like?",
  "data/reddit-ask/r/AskWomen/comments/ngocbq/what_are_some_of_the_most_recent_instances_of_you.json": "What are some of the most recent instances of you realizing \"oh, that's actually sexist and shouldn't be normal\"?",
  "data/reddit-ask/r/AskWomen/comments/ngwgrg/what_videogames_would_you_highly_recommend_to.json": "What video-game(s) would you highly recommend to other women?",
  "data/reddit-ask/r/AskWomen/comments/ngyce6/women_with_longer_lashes_how_do_you_manage_to.json": "Women with longer lashes, how do you manage to precisely apply your eyeliner without your lashes getting in the way?",
  "data/reddit-ask/r/AskWomen/comments/nh1yik/ladies_how_often_do_you_cut_your_hair.json": "Ladies, how often do you cut your hair?",
  "data/reddit-ask/r/AskWomen/comments/nh3etx/if_you_could_use_only_1_makeup_item_for_the_rest.json": "If you could use only 1 makeup item for the rest of your life, what would it be, and why?",
  "data/reddit-ask/r/AskWomen/comments/nhp3ht/shy_women_what_hints_did_you_give_to_your_crush.json": "Shy women, what hints did you give to your crush that completely went over their heads?",
  "data/reddit-ask/r/AskWomen/comments/ni75t6/what_do_you_wear_as_business_attire_when_its_very.json": "What do you wear as business attire when it’s very hot?",
  "data/reddit-ask/r/AskWomen/comments/ni8un2/how_did_you_find_a_healthy_relationship_despite.json": "How did you find a healthy relationship despite watching an unhappy marriage between your parents?",
  "data/reddit-ask/r/AskWomen/comments/nikjr9/is_it_common_to_feel_like_your_mother_raised_you.json": "Is it common to feel like your mother raised you and your father just helped? How did you feel growing up?",
  "data/reddit-ask/r/AskWomen/comments/nj3wpf/what_are_your_lowbudget_mental_health_tips.json": "What are your low-budget mental health tips?",
  "data/reddit-ask/r/AskWomen/comments/njd5yr/women_who_genuinely_like_their_dad_and_who_have_a.json": "Women who genuinely like their dad, and who have a happy/close relationship with your dad, what is that like?",
  "data/reddit-ask/r/AskWomen/comments/njd86m/women_who_walk_around_with_glistening_baby_smooth.json": "Women who walk around with glistening, baby smooth legs, how?",
  "data/reddit-ask/r/AskWomen/comments/njiqds/to_women_that_always_wanted_to_change_their.json": "To women that always wanted to change their bodies by eating well and working out but never had the discipline ... BUT then finally did it... how did you get yourself to finally have the discipline to do it?",
  "data/reddit-ask/r/AskWomen/comments/njwg0x/what_made_you_realize_youre_emotionally.json": "What made you realize you're emotionally unavailable?",
  "data/reddit-ask/r/AskWomen/comments/njzyxg/what_is_something_that_is_stereotypically.json": "What is something that is stereotypically “masculine” that you wished you were taught when you were younger?",
  "data/reddit-ask/r/AskWomen/comments/nk0lnh/what_is_your_field_of_science_equivalent_of_its.json": "What is your field of science equivalent of \"Its never aliens?\"",
  "data/reddit-ask/r/AskWomen/comments/nki1pi/whats_the_most_irritating_thing_you_hear_as_a.json": "What’s the most irritating thing you hear as a woman?",
  "data/reddit-ask/r/AskWomen/comments/nkjyap/how_do_you_think_sometimes_women_unintentionally.json": "How do you think sometimes, Women, unintentionally promotes Toxic Masculinity?",
  "data/reddit-ask/r/AskWomen/comments/nlyjqx/women_who_were_brought_up_in_a_healthy_way_what.json": "Women who were brought up in a healthy way, what did your parents get right?",
  "data/reddit-ask/r/AskWomen/comments/nmtbfk/women_who_were_tomboys_when_they_were_younger_how.json": "Women who were tomboys when they were younger, how do you feel it has shaped you to who you are now?",
  "data/reddit-ask/r/AskWomen/comments/nn0stz/what_is_something_you_were_completely_unprepared.json": "What is something you were completely unprepared to deal with in life?",
  "data/reddit-ask/r/AskWomen/comments/nn8wwa/which_kind_of_man_terrifies_you_the_most.json": "Which kind of man terrifies you the most?",
  "data/reddit-ask/r/AskWomen/comments/nnnhgt/if_you_could_confront_a_man_of_your_choosing_with.json": "If You Could Confront a Man of Your Choosing with a Guarantee that He Would Not Verbally or Physically Retaliate Against You for Doing so, What Would You Say to Him?",
  "data/reddit-ask/r/AskWomen/comments/nnqqgm/how_do_you_get_from_being_out_of_breath_after_one.json": "How do you get from being out of breath after one flight of stairs, to being able to comfortably go for a jog?",
  "data/reddit-ask/r/AskWomen/comments/nnuhxy/to_those_of_you_who_were_pregnant_teens_howd_you.json": "To those of you who were pregnant teens, how'd you deal? Were you out of high school for the entirety of the nine months, or just 5 or 6 months? How'd your classmates react to your baby?",
  "data/reddit-ask/r/AskWomen/comments/no75hs/what_are_some_important_boundaries_that_you_have.json": "What are some important boundaries that you have? Did you always have these or did you learn them from experience?",
  "data/reddit-ask/r/AskWomen/comments/nopojz/what_is_the_first_thing_you_do_in_the_morning_and.json": "What is the first thing you do in the morning and why?",
  "data/reddit-ask/r/AskWomen/comments/np5rx2/what_is_your_opinion_on_exposing_your_sexual.json": "What is your opinion on exposing your sexual harassers'/abusers' identities on social media?",
  "data/reddit-ask/r/AskWomen/comments/np7fa3/what_is_something_that_makes_you_roll_your_eyes.json": "What is something that makes you roll your eyes every time you hear it?",
  "data/reddit-ask/r/Ask_Politics/comments/n2igsf/why_is_voter_turnout_so_low_in_american_elections.json": "Why is voter turnout so low in American elections?",
  "data/reddit-ask/r/Ask_Politics/comments/n46ajm/why_did_trump_have_a_bunch_of_acting_secretaries.json": "why did trump have a bunch of acting secretaries?",
  "data/reddit-ask/r/Ask_Politics/comments/n4vny4/why_has_the_idea_of_a_meritocracy_taken_on_a.json": "Why has the idea of a meritocracy taken on a negative connotation?",
  "data/reddit-ask/r/Ask_Politics/comments/n9xv1u/why_is_liz_cheneys_house_republican_leadership.json": "Why is Liz Cheney's House Republican Leadership position in question?",
  "data/reddit-ask/r/Ask_Politics/comments/napxaw/are_there_any_polls_showing_the_demographic.json": "Are there any polls showing the demographic breakdown of the GOP along pro- vs. anti-Trump lines?",
  "data/reddit-ask/r/Ask_Politics/comments/nc9t45/why_does_health_insurance_not_guarantee.json": "Why Does Health Insurance Not Guarantee Healthcare In the U.S.?",
  "data/reddit-ask/r/Ask_Politics/comments/neii4l/is_there_a_large_group_of_israelis_that_support.json": "Is there a large group of Israelis that support Palestine, and/or are not Zionists, and/or believe in peaceful solutions to the conflict? And if so, do they have any voice in government?",
  "data/reddit-ask/r/Ask_Politics/comments/nfmm0k/why_usa_and_other_countries_do_not_place_target.json": "Why USA and other countries do not place target sanctions on Russian oligarches instead of general sanctions?",
  "data/reddit-ask/r/Ask_Politics/comments/ng6j3k/so_the_doj_had_until_monday_to_appeal_the_release.json": "So the DOJ had until Monday to appeal the release of the Barr memo, so what happened?",
  "data/reddit-ask/r/Ask_Politics/comments/ni013h/why_did_trump_veto_the_cybersecurity_funding_bill.json": "Why did Trump veto the cybersecurity funding bill created by Congress in response to the massive SolarWinds cyberattack?",
  "data/reddit-ask/r/Ask_Politics/comments/nk1q7r/is_the_usa_a_representative_democracy_or_a.json": "Is the USA a representative democracy or a constitutional republic?",
  "data/reddit-ask/r/Ask_Politics/comments/nlxs13/why_arent_the_democrats_able_to_pass_bills_in_the.json": "Why aren't the democrats able to pass bills in the senate if kamala harris is supposed to break 50-50 ties?",
  "data/reddit-ask/r/Ask_Politics/comments/nop5e6/the_district_court_of_the_hague_ordered_royal.json": "The district court of The Hague ordered Royal Dutch Shell to cut its global carbon emissions by 45% by the end of 2030. Is this really as significant as it sounds?",
  "data/reddit-ask/r/NoStupidQuestions/comments/n2a2gi/is_it_okay_if_i_tell_someone_im_not_doing_okay.json": "Is it okay if I tell someone I'm not doing okay?",
  "data/reddit-ask/r/NoStupidQuestions/comments/n2b84r/why_is_it_that_a_single_good_deed_isnt_enough_to.json": "Why is it that a single good deed isn’t enough to pardon a life of evilness but a single act of evil is enough to condemn a life of good deeds?",
  "data/reddit-ask/r/NoStupidQuestions/comments/n2lq20/right_why_do_you_not_have_to_pay_for_the_fire.json": "Right, why do you not have to pay for the fire department to put out the fire burning your house down, but you do have to pay for an ambulance to take you to the hospital AND then the care you receive from them?",
  "data/reddit-ask/r/NoStupidQuestions/comments/n2m36f/why_do_people_who_say_sorry_for_my_english_always.json": "why do people who say \"sorry for my english\" always have near-perfect english?",
  "data/reddit-ask/r/NoStupidQuestions/comments/n2q3ag/when_did_we_all_agree_that_the_sound_of_poking_an.json": "When did we all agree that the sound of poking an animal or child on the nose is \"Boop\"?",
  "data/reddit-ask/r/NoStupidQuestions/comments/n2s9ro/jehovas_witnesses_are_sneaking_into_my_apartment.json": "Jehova's Witnesses are sneaking into my apartment building. Can I report them for trespassing?",
  "data/reddit-ask/r/NoStupidQuestions/comments/n3481d/why_isnt_alcohol_given_the_same_treatment_as.json": "Why isn't alcohol given the same treatment as cigarettes?",
  "data/reddit-ask/r/NoStupidQuestions/comments/n355g8/why_do_flies_not_fly_out_the_window_when_you_open.json": "Why do flies not fly out the window when you open it for them but then go and walk on the window when you close it?",
  "data/reddit-ask/r/NoStupidQuestions/comments/n3qtdh/why_is_friendzone_seen_as_a_bad_thing_having.json": "Why is friendzone seen as a bad thing? Having friends is fucking awesome",
  "data/reddit-ask/r/NoStupidQuestions/comments/n3xfkt/do_all_the_newborn_babies_in_american_hospitals.json": "Do all the newborn babies in American hospitals really go into a giant baby room together without the parents?",
  "data/reddit-ask/r/NoStupidQuestions/comments/n40rp6/im_permanently_disabled_and_am_therefore.json": "I'm permanently disabled and am therefore unemployed. But... I'm lonely and want love. How can I make a dating site profile that tells the truth, yet doesn't make me look pathetic and undatable?",
  "data/reddit-ask/r/NoStupidQuestions/comments/n4mrev/does_anyone_else_feel_like_their_parents_are.json": "Does anyone else feel like their parents are getting… less smart… as they age?",
  "data/reddit-ask/r/NoStupidQuestions/comments/n5181k/mixed_race_commercials.json": "Mixed race commercials",
  "data/reddit-ask/r/NoStupidQuestions/comments/n522zc/am_i_wrong_to_think_this_professor_did_us_dirty.json": "Am I wrong to think this professor did us dirty?",
  "data/reddit-ask/r/NoStupidQuestions/comments/n54kd3/can_someone_explain_to_me_stepbystep_how_you_tear.json": "Can someone explain to me, step-by-step, how you tear a piece of cling wrap without it fucking furling?",
  "data/reddit-ask/r/NoStupidQuestions/comments/n55f7o/does_anyone_else_think_its_crazy_that_kids_are.json": "Does anyone else think its crazy that kids are EXPECTED to be involved in literally everything now?",
  "data/reddit-ask/r/NoStupidQuestions/comments/n57cma/do_you_ever_sometimes_forget_how_old_you_are.json": "Do you ever sometimes forget how old you are?",
  "data/reddit-ask/r/NoStupidQuestions/comments/n59nc0/anybody_else_have_deep_well_put_thoughts_in_their.json": "Anybody else have deep, well put thoughts in their head but when you try and actually verbalize them nothing comes out right?",
  "data/reddit-ask/r/NoStupidQuestions/comments/n5bhaz/why_do_news_anchors_on_some_us_news_programmes.json": "Why do news anchors on some US news programmes share their personal opinions ? Where I live, anchors only job is to read the news in a calm, non emotional and impersonal manner. In the US, however, it feels like the anchors are in the studio to chit chat on personal level about what happened?",
  "data/reddit-ask/r/NoStupidQuestions/comments/n5lq09/people_with_no_legs_how_tall_are_you_on_your_ids.json": "People with no legs, how tall are you on your ID's?",
  "data/reddit-ask/r/NoStupidQuestions/comments/n5uz61/why_is_cultural_appropriation_a_bad_thing.json": "Why is cultural appropriation a bad thing?",
  "data/reddit-ask/r/NoStupidQuestions/comments/n5wter/would_a_sperm_donation_place_let_you_bring_a.json": "Would a sperm donation place let you bring a friend to help you out, or would that be frowned upon?",
  "data/reddit-ask/r/NoStupidQuestions/comments/n5zy1t/why_cant_robots_just_click_the_box_to_prove_they.json": "Why can't robots just click the box to prove they are not a robot?",
  "data/reddit-ask/r/NoStupidQuestions/comments/n68nau/does_anyone_else_feel_depressed_but_you_know_you.json": "Does anyone else feel depressed but you know you have nothing to be depressed about?",
  "data/reddit-ask/r/NoStupidQuestions/comments/n6bl6j/why_dont_cringey_memories_overwrite_each_other.json": "Why don't cringey memories overwrite each other instead of just adding up, but happy memories don't really add up?",
  "data/reddit-ask/r/NoStupidQuestions/comments/n6mpru/does_anyone_else_save_posts_on_reddit_only_to.json": "Does anyone else save posts on Reddit only to never view them again?",
  "data/reddit-ask/r/NoStupidQuestions/comments/n6rbx8/how_the_fuck_do_i_stop_getting_jordan_peterson_on.json": "How the FUCK do I stop getting Jordan Peterson on my YouTube recommendations and autoplay",
  "data/reddit-ask/r/NoStupidQuestions/comments/n6tvhl/does_it_seem_like_colors_pop_more_some_days_to_you.json": "Does it seem like colors “pop” more some days to you?",
  "data/reddit-ask/r/NoStupidQuestions/comments/n6xidx/why_do_some_catholic_priests_rape_boys_wouldnt.json": "Why do some catholic priests rape boys? Wouldn’t that be considered homosexual? And aren’t Catholics against homosexuality?",
  "data/reddit-ask/r/NoStupidQuestions/comments/n70rqc/as_a_black_woman_adopting_two_korean_kids_how_can.json": "As a Black woman adopting two Korean kids, how can I best teach them their culture while still fitting into my own?",
  "data/reddit-ask/r/NoStupidQuestions/comments/n71ma6/is_it_just_me_being_an_introvert_or_does_it.json": "Is it just me being an introvert or does it actually feel good to use Reddit over Facebook, Instagram and Twitter because friends, coworkers and acquaintances are not connected on this platform so that you can be yourself without being judged?",
  "data/reddit-ask/r/NoStupidQuestions/comments/n7ai8w/all_garbage_trucks_smell_the_same_but_the_garbage.json": "All garbage trucks smell the same, but the garbage inside each isn’t the same. So what makes that unique smell?",
  "data/reddit-ask/r/NoStupidQuestions/comments/n7gr0m/do_any_of_you_guys_like_mint_chocolate_ice_cream.json": "Do Any of You Guys Like Mint Chocolate Ice Cream?",
  "data/reddit-ask/r/NoStupidQuestions/comments/n7ng3g/am_i_wrong_to_find_it_hilarious_how_restaurant.json": "Am I wrong to find it hilarious how restaurant owners are going on the news to cry about having to offer their employees livable wages and health insurance to entice them into returning to work?",
  "data/reddit-ask/r/NoStupidQuestions/comments/n7tanq/can_animals_be_allergic_to_humans.json": "Can animals be allergic to humans?",
  "data/reddit-ask/r/NoStupidQuestions/comments/n7x1do/does_anyone_else_get_social_anxiety_about_posting.json": "Does anyone else get social anxiety about posting on Reddit?",
  "data/reddit-ask/r/NoStupidQuestions/comments/n85q5l/can_a_fish_die_in_a_house_fire.json": "Can a fish die in a house fire?",
  "data/reddit-ask/r/NoStupidQuestions/comments/n8d9hh/is_it_normal_to_have_massive_libido_spikes_when.json": "Is it normal to have massive libido spikes when you go from a sedentary life style to an active one?",
  "data/reddit-ask/r/NoStupidQuestions/comments/n8ein8/why_does_the_jury_system_exist_theyre_just_random.json": "Why does the 'Jury System' exist? They're just random citizens with zero legal knowledge.",
  "data/reddit-ask/r/NoStupidQuestions/comments/n8ouls/anybody_else_really_missing_their_mom_on_mothers.json": "Anybody Else Really Missing Their Mom On Mother's Day ?",
  "data/reddit-ask/r/NoStupidQuestions/comments/n8prpk/just_turned_23_m_does_anyone_else_live_a_life.json": "Just turned 23 (M) Does anyone else live a life with 0 friends?",
  "data/reddit-ask/r/NoStupidQuestions/comments/n8ti80/just_hit_and_killed_a_dog_with_my_car_it_happened.json": "Just hit and killed a dog with my car. It happened in front of the teenage girl owner and her father. What should I have done after?",
  "data/reddit-ask/r/NoStupidQuestions/comments/n8z6p3/why_losing_yourself_in_a_book_is_good_and_losing.json": "Why losing yourself in a book is good, and losing yourself in a game/social media/online is bad?",
  "data/reddit-ask/r/NoStupidQuestions/comments/n8zvzu/is_it_true_my_parents_can_see_my_search_history.json": "IS IT TRUE MY PARENTS CAN SEE MY SEARCH HISTORY WHEN PAYING THE WIFI BILL?",
  "data/reddit-ask/r/NoStupidQuestions/comments/n937y8/to_all_practicing_muslims_here_how_much_weight_do.json": "To all practicing muslims here, how much weight do you guys lose every year after ramadan?",
  "data/reddit-ask/r/NoStupidQuestions/comments/n93i1f/how_is_it_ethical_for_god_to_kill_jobs_entire.json": "How is it ethical for God to kill Jobs entire family to test his faith?",
  "data/reddit-ask/r/NoStupidQuestions/comments/n93r1r/can_you_go_to_jail_for_encouraging_rape.json": "Can you go to jail for encouraging rape?",
  "data/reddit-ask/r/NoStupidQuestions/comments/n94fp5/if_printing_more_money_causes_inflation_does.json": "If printing more money causes inflation, does burning money cause reverse inflation?",
  "data/reddit-ask/r/NoStupidQuestions/comments/n99k0x/why_is_it_acceptable_for_bags_of_flour_from_the.json": "Why is it acceptable for bags of flour from the grocery store to just casually be spilling/leaking flour all over the place, when this isn’t true of virtually any other food item?",
  "data/reddit-ask/r/NoStupidQuestions/comments/n9x8td/does_anyone_else_pick_up_items_that_fell_off_the.json": "Does anyone else pick up items that fell off the shelves in stores, even though you didn't make them fall?",
  "data/reddit-ask/r/NoStupidQuestions/comments/n9zb7c/why_is_cunt_so_offensive_in_the_us.json": "Why is cunt so offensive in the US?",
  "data/reddit-ask/r/NoStupidQuestions/comments/naeo6y/how_do_you_get_into_a_tooth_brushing_routine.json": "How do you get into a tooth brushing routine?",
  "data/reddit-ask/r/NoStupidQuestions/comments/nags8f/why_doesnt_the_frosting_on_a_poptart_melt_off.json": "Why doesn't the frosting on a poptart melt off when you toast it?",
  "data/reddit-ask/r/NoStupidQuestions/comments/najg7b/what_happens_if_you_cook_pasta_and_let_it_dry.json": "What happens if you cook pasta and let it dry? Does it go back to uncooked pasta, and can you cook it again?",
  "data/reddit-ask/r/NoStupidQuestions/comments/nak69j/why_does_the_us_support_israel_so_much.json": "Why does the US support Israel so much?",
  "data/reddit-ask/r/NoStupidQuestions/comments/nanlj7/my_partner_lost_his_childhood_dog_this_morning.json": "My partner lost his childhood dog this morning and is so distraught. I have never lost a pet so I don't know how to help him through this but I really want to. Does anyone have advice on how I should handle this?",
  "data/reddit-ask/r/NoStupidQuestions/comments/nb1and/can_astronauts_wear_whatever_underwear_they_want.json": "Can astronauts wear whatever underwear they want, or is there some special spacesuit underwear they have to use?",
  "data/reddit-ask/r/NoStupidQuestions/comments/nb1utr/anyone_else_ever_just_not_get_out_of_bed_just.json": "Anyone else ever just not get out of bed just because you don’t wanna wake up your cat/dog?",
  "data/reddit-ask/r/NoStupidQuestions/comments/nb1vkj/is_it_true_that_nestle_used_to_give_impoverished.json": "Is it true that Nestle used to give impoverished new mother's 2 weeks of free baby formula so their natural milk production dried up and they had to keep buying formula?",
  "data/reddit-ask/r/NoStupidQuestions/comments/nb7b3w/why_do_men_typically_take_so_long_to_take_a_sht.json": "Why do men typically take so long to take a sh*t?",
  "data/reddit-ask/r/NoStupidQuestions/comments/nb7mc4/sometimes_i_feel_like_i_want_to_socialise_but.json": "Sometimes I feel like I want to socialise but when I actually partake in socialising, I want to get out of that situation as soon as possible. Why is this?",
  "data/reddit-ask/r/NoStupidQuestions/comments/nbfhwc/why_are_so_many_gas_stations_mostly_in_the_usa.json": "Why are so many gas stations (mostly in the USA) even allowing customers to fill up non-approved containers with gasoline? It's literally against the law, and gas station employees are supposed to know this.",
  "data/reddit-ask/r/NoStupidQuestions/comments/nbmfkb/if_4_is_written_as_four_why_is_40_written_as.json": "If 4 is written as \"four\", why is 40 written as \"fourty\" treated a misspelling?",
  "data/reddit-ask/r/NoStupidQuestions/comments/nboq4a/how_can_i_convince_my_father_in_law_that_he_can.json": "How can I convince my father in law that he, can not, in fact cure his prostate cancer through changing his diet alone. And that while I support his new diet as part of a treatment plan he can not just forgo medical treatment",
  "data/reddit-ask/r/NoStupidQuestions/comments/nbrdao/why_does_reddit_keep_turning_off_the_show_nsfw.json": "Why does reddit keep turning off the “show nsfw content” button for me",
  "data/reddit-ask/r/NoStupidQuestions/comments/nbshie/are_we_slowly_making_better_black_flys_and.json": "Are we slowly making better black flys and mosquitoes via natural selection by swatting and killing the slower ones?",
  "data/reddit-ask/r/NoStupidQuestions/comments/nc60a9/why_do_so_many_famous_people_seem_to_end_up_as.json": "Why do so many famous people seem to end up as sex offenders?",
  "data/reddit-ask/r/NoStupidQuestions/comments/nc6aqz/what_happened_to_cloning_since_dolly_the_sheep.json": "What happened to \"cloning\" since Dolly the sheep?",
  "data/reddit-ask/r/NoStupidQuestions/comments/nc6my4/does_anyone_else_type_their_argument_in_the.json": "Does anyone else type their argument in the comments then delete the entire thing just because you think its not worth the effort?",
  "data/reddit-ask/r/NoStupidQuestions/comments/nc815q/why_is_it_illegal_to_scalp_tickets_but_perfectly.json": "Why is it illegal to scalp tickets but perfectly legal for sites like stub hub to resell?",
  "data/reddit-ask/r/NoStupidQuestions/comments/nc9mjy/saw_the_bus_driver_pump_gas_into_the_trashcan.json": "Saw the bus driver pump gas into the trashcan during my highschool band trip several years ago",
  "data/reddit-ask/r/NoStupidQuestions/comments/ncd6s8/if_a_mule_got_down_syndrome_could_it_reproduce.json": "If a mule got Down syndrome, could it reproduce with a horse?",
  "data/reddit-ask/r/NoStupidQuestions/comments/ncry18/did_people_smell_like_shit_all_the_time_before.json": "Did people smell like shit all the time before most housing had bathrooms?",
  "data/reddit-ask/r/NoStupidQuestions/comments/ncsvx0/life_is_better_when_you_keep_to_yourself_it_seems.json": "Life is better when you keep to yourself. It seems like the more people I know, the more BS there is. Anyone else feel this way?",
  "data/reddit-ask/r/NoStupidQuestions/comments/ncu64i/why_does_my_cat_want_me_to_see_him_eating.json": "Why does my cat want me to see him eating ?",
  "data/reddit-ask/r/NoStupidQuestions/comments/ncu7qt/do_boys_really_not_get_touched_often.json": "Do boys really not get touched often?",
  "data/reddit-ask/r/NoStupidQuestions/comments/ncxybp/how_many_cats_would_you_need_to_make_cat_cheese.json": "How many cats would you need to make cat cheese, from cat milk?",
  "data/reddit-ask/r/NoStupidQuestions/comments/nd07yo/why_do_americans_wear_hats_indoors.json": "Why do Americans wear hats indoors?",
  "data/reddit-ask/r/NoStupidQuestions/comments/ndez4y/why_is_it_schools_havent_devoted_a_course_how_to.json": "Why is it schools haven't devoted a course how to do basic life responsibilities? Doing taxes, building credit, creating a resume, dealing with pressure, etc. I was always under the impression school was to get us ready for life, but it misses the most important lesson of all. How to be an adult",
  "data/reddit-ask/r/NoStupidQuestions/comments/ndh2pg/anybody_else_ever_had_the_experience_where_you.json": "Anybody else ever had the experience where you feel like you have a booger cornered while picking your nose, but you're having a little trouble getting it out, and you don't want to fully take your finger out of your nose, because if you do, you might lose the booger forever?",
  "data/reddit-ask/r/NoStupidQuestions/comments/ndigqk/white_people_can_experience_racismright.json": "White people can experience racism...right?",
  "data/reddit-ask/r/NoStupidQuestions/comments/ndn7ms/did_anyone_else_as_a_kid_think_quicksand_was.json": "Did anyone else as a kid think quicksand was going to be a common danger in life?",
  "data/reddit-ask/r/NoStupidQuestions/comments/ne0kff/does_the_human_body_adjust_blood_volume_for_lost.json": "Does the human body adjust blood volume for lost limbs?",
  "data/reddit-ask/r/NoStupidQuestions/comments/ne1jcc/does_anyone_else_decide_to_wear_a_jacket_just_for.json": "Does anyone else decide to wear a jacket just for the use of pockets?",
  "data/reddit-ask/r/NoStupidQuestions/comments/neebra/everyone_is_saying_free_palestine_what_would_that.json": "Everyone is saying \"Free Palestine\". What would that entail?",
  "data/reddit-ask/r/NoStupidQuestions/comments/nej68b/can_someone_explain_how_a_business_like_in_n_out.json": "Can someone explain how a business like “In n Out” can pay their employees above minimum wage and still have their menu price lower than the competitors?",
  "data/reddit-ask/r/NoStupidQuestions/comments/nels3k/how_do_they_find_ugly_people_for_movies.json": "How do they find ugly people for movies?",
  "data/reddit-ask/r/NoStupidQuestions/comments/nelv62/why_do_green_olives_come_in_a_jar_but_black.json": "Why do green olives come in a jar but black olives come in a can?",
  "data/reddit-ask/r/NoStupidQuestions/comments/neo2cm/surely_im_not_the_only_one_who_morphs_a_tissue.json": "Surely I'm not the only one who morphs a tissue into a cone/spike, stick it in my nose and twist it around to get the boogers out, right?",
  "data/reddit-ask/r/NoStupidQuestions/comments/nf7f54/why_the_hell_do_people_on_youtube_explain_it_much.json": "Why the hell do people on youtube explain it much more clearly and perfectly, rather than your IRL teacher.",
  "data/reddit-ask/r/NoStupidQuestions/comments/nf8x1z/why_is_this_mobile_game_called_raid_so_popular.json": "Why is this mobile game called Raid so popular and has so much advertising? I tried it out its a bullshit. I also deleted it and won't recommend it",
  "data/reddit-ask/r/NoStupidQuestions/comments/nfg585/does_it_irritate_anyone_else_when_you_try_to_make.json": "Does it irritate anyone else when you try to make food and other people are in the kitchen?",
  "data/reddit-ask/r/NoStupidQuestions/comments/nfsffm/who_decided_pickles_were_pickled_cucumbers_and.json": "Who decided “pickles” were pickled cucumbers and everything else was to be referred to as “pickled ______”?",
  "data/reddit-ask/r/NoStupidQuestions/comments/ng4q0g/why_is_hearing_rain_while_falling_asleep_so.json": "Why is hearing rain while falling asleep so comforting?",
  "data/reddit-ask/r/NoStupidQuestions/comments/ngckl3/why_do_some_people_think_fish_arent_animals.json": "Why do some people think fish aren't animals?",
  "data/reddit-ask/r/NoStupidQuestions/comments/ngcobl/doss_anyone_else_have_an_irrational_fear_that.json": "Doss anyone else have an irrational fear that when they're singing up for an account with something, you'll accidentally put your password in wrong, twice and the account will never be recoverable?",
  "data/reddit-ask/r/NoStupidQuestions/comments/ngi5m7/how_come_every_cook_says_to_use_more_garlic_than.json": "How come every cook says to use more garlic than the recipe calls for? Aren't recipes written by cooks? Who is responsible for all these garlic-deficient recipes?",
  "data/reddit-ask/r/NoStupidQuestions/comments/ngjh0g/whats_the_point_of_cheering_for_your_cities.json": "Whats the point of cheering for \"your cities\" sports team when they can hire athletes who aren't from the city",
  "data/reddit-ask/r/NoStupidQuestions/comments/nh13bc/i_hope_i_can_make_this_make_sense_why_is_it_that.json": "I hope I can make this make sense... Why is it that sometimes if you're gulping down water or any drink, there's one swallow in the middle of it that feels hard and quickly painful to get down?",
  "data/reddit-ask/r/NoStupidQuestions/comments/nh3wjq/can_a_person_be_straight_and_still_get_off_to.json": "Can a person be straight and still get off to porn of the same sex?",
  "data/reddit-ask/r/NoStupidQuestions/comments/nh4c17/if_there_was_no_ocean_and_we_could_go_to_the_very.json": "If there was no ocean and we could go to the very bottom without water, would there be any negative effects on our body?",
  "data/reddit-ask/r/NoStupidQuestions/comments/nhcekm/why_is_it_widely_accepted_that_israel_has_right.json": "Why is it widely accepted that Israel has right of return for historical reasons but Native Americans and aboriginals don’t?",
  "data/reddit-ask/r/NoStupidQuestions/comments/nhkgkl/why_is_body_dysmorphia_a_mental_illness_but.json": "Why is Body Dysmorphia a Mental Illness, but Gender Dysmorphia isnt?",
  "data/reddit-ask/r/NoStupidQuestions/comments/nhpqrg/what_topic_should_i_choose_for_my_assignment.json": "What topic should i choose for my assignment?",
  "data/reddit-ask/r/NoStupidQuestions/comments/nhpvfx/why_is_it_that_when_i_wake_up_early_for_work_i.json": "Why is it that when I wake up early for work I can instantly fall back asleep, but when I wake up early and don't have obligations it's much more difficult to do so?",
  "data/reddit-ask/r/NoStupidQuestions/comments/ni73q8/usa_minimum_wage_are_there_actually_adults_living.json": "USA Minimum Wage: are there actually adults living off $7.25 per hour?",
  "data/reddit-ask/r/NoStupidQuestions/comments/niaxm6/i_got_reprimanded_at_work_a_few_years_ago_for.json": "I got reprimanded at work a few years ago for making a change.. now a new employee made that same change and is being celebrated for it. What do I do?",
  "data/reddit-ask/r/NoStupidQuestions/comments/nidq03/why_is_it_always_the_middle_of_the_night_that_we.json": "Why is it always the middle of the night that we get a sudden urge to get our shit together?",
  "data/reddit-ask/r/NoStupidQuestions/comments/niq0tc/why_isnt_alcohol_known_as_a_hard_drug.json": "Why isnt alcohol known as a hard drug?",
  "data/reddit-ask/r/NoStupidQuestions/comments/niq4tr/my_dad_just_died_he_had_cancer_and_i_have_known.json": "My dad just died. He had cancer and I have known it was coming so I am alright. What do I do now? I dont think I should call 911 because its not really an emergency, hes already dead.",
  "data/reddit-ask/r/NoStupidQuestions/comments/nj54yb/is_it_normal_to_not_enjoy_your_days_off_work.json": "Is it normal to not enjoy your days off work because you know you're going to be back in way too quickly?",
  "data/reddit-ask/r/NoStupidQuestions/comments/nj6rw8/i_was_babysitting_my_nephew_he_had_an_accident.json": "I was babysitting my nephew, he had an accident, but his mom forgot diapers. Laundry is tomorrow, so the only thing I had was a fluffy American flag towel to use as a diaper. It did the trick. But my brother is ticked at me for \"desecrating the flag.\" Its literally a towel. Did I do wrong?",
  "data/reddit-ask/r/NoStupidQuestions/comments/njglpl/why_does_reddit_keep_showing_annoying_live.json": "Why does reddit keep showing annoying live streams on my home page? I don't give a crap about some random man playing a flute on the other side of the world. How do I block this garbage?",
  "data/reddit-ask/r/NoStupidQuestions/comments/njmjbq/why_is_lobbying_legal.json": "Why is lobbying legal?",
  "data/reddit-ask/r/NoStupidQuestions/comments/njmlm0/wtf_is_going_on_with_reddit_this_weekend.json": "Wtf is going on with Reddit this weekend?",
  "data/reddit-ask/r/NoStupidQuestions/comments/njqwnk/why_am_i_always_too_weak_to_defend_myself_in.json": "Why am I always too weak to defend myself in dreams?",
  "data/reddit-ask/r/NoStupidQuestions/comments/njt6yi/since_whenever_a_guys_uses_the_toilet_to_take_a.json": "Since whenever a guys uses the toilet to take a pee, they have to wiggle their d*ck to make sure they get the last drops of pee out so it doesn’t wet their underwear. With that said, Do females do the same thing with their privates when they have to pee? Do they experience the same thing like males?",
  "data/reddit-ask/r/NoStupidQuestions/comments/njwuav/why_is_uncircumcised_called_uncircumcised_thats.json": "Why is uncircumcised called uncircumcised? That's like calling a person with no tattoos an untattooed person. Shouldn't it be called a natural penis instead of an uncut penis.",
  "data/reddit-ask/r/NoStupidQuestions/comments/njx4qv/would_a_trans_person_from_iceland_also_change.json": "Would a trans person from Iceland also change their last names when they change their first name to represent their new gender?",
  "data/reddit-ask/r/NoStupidQuestions/comments/nkceoa/how_many_of_you_shake_your_popcorn_bag_right.json": "How many of you shake your popcorn bag right after it comes out of the microwave?",
  "data/reddit-ask/r/NoStupidQuestions/comments/nkg6qj/why_do_we_vote_for_politicians_why_not_the_actual.json": "Why do we vote for politicians, why not the actual policies?",
  "data/reddit-ask/r/NoStupidQuestions/comments/nkvhsf/is_there_anything_wrong_with_waking_up_at_8am.json": "Is there anything wrong with waking up at 8am?",
  "data/reddit-ask/r/NoStupidQuestions/comments/nlbbh3/do_english_speakers_use_the_word_schadenfreude.json": "Do English speakers use the word “Schadenfreude“",
  "data/reddit-ask/r/NoStupidQuestions/comments/nlkb9m/if_you_own_a_private_island_can_you_murder.json": "If you own a private island can you murder someone there without consequences?",
  "data/reddit-ask/r/NoStupidQuestions/comments/nln8be/why_is_wearing_a_head_covering_hat_hoodie_beanie.json": "Why is wearing a head covering (hat, hoodie, beanie, etc) considered disrespectful indoors?",
  "data/reddit-ask/r/NoStupidQuestions/comments/nlvvr1/why_is_it_so_common_for_doctors_and_nurses_shifts.json": "Why is it so common for doctors’ and nurses’ shifts to be 12, 24, or sometimes 36 hours in hospital settings? That seems like a job in which you’d want the occupant to be well rested.",
  "data/reddit-ask/r/NoStupidQuestions/comments/nlyocu/does_anyone_else_press_later_every_time_when_an.json": "Does anyone else press \"later\" every time when an app asks you to rate it because \"never ask again\" sounds too harsh?",
  "data/reddit-ask/r/NoStupidQuestions/comments/nmdy62/how_do_you_not_be_obsessive_about_the_people_that.json": "How do you not be obsessive about the people that you have a romantic interest in?",
  "data/reddit-ask/r/NoStupidQuestions/comments/nmjn5g/i_grew_up_in_poor_in_the_south_we_lived_in_a.json": "I grew up in poor in the south. We lived in a camper, a shack with no door, and for a while in a tent. No matter where we lived, my parents kept our space spotless, but our neighbors trashed their yards. I noticed this trend anywhere we lived. Why do people in poverty often trash their yards?",
  "data/reddit-ask/r/NoStupidQuestions/comments/nmxs9v/why_jesus_is_painted_with_white_skin_even_though.json": "Why Jesus is painted with white skin even though he is Middle-Eastern?",
  "data/reddit-ask/r/NoStupidQuestions/comments/nmy8hg/who_was_the_einstein_before_einstein.json": "Who was the \"Einstein\" before Einstein",
  "data/reddit-ask/r/NoStupidQuestions/comments/nmyky3/does_anyone_else_clean_the_mess_they_made_at_a.json": "Does anyone else clean the mess they made at a table in a restaurant?",
  "data/reddit-ask/r/NoStupidQuestions/comments/nnelyc/why_do_people_have_kids_to_try_to_save_their.json": "Why do people have kids to try to save their failing marriages?",
  "data/reddit-ask/r/NoStupidQuestions/comments/nnitzb/ok_lets_be_real_right_now_how_many_youtubers.json": "OK let's be real right now. How many youtubers actually live off the YouTube salary? Can't find statistics for this shit",
  "data/reddit-ask/r/NoStupidQuestions/comments/nnloov/why_do_we_need_lawyers_why_cant_the_judge_just.json": "Why do we need lawyers. Why can't the judge just ask both parties their stories and decide what to do? This would eliminate people winning or losing based on how expensive their lawyer was which is an extremely stupid system",
  "data/reddit-ask/r/NoStupidQuestions/comments/nnqy70/anyone_else_get_annoyed_when_a_device_advertises.json": "Anyone else get annoyed when a device advertises a storage amount, then half that storage is taken up by system and uninstallable applications?",
  "data/reddit-ask/r/NoStupidQuestions/comments/nnw8hd/is_it_normal_to_hit_a_certain_point_of_hunger.json": "Is it normal to hit a certain point of hunger, where it feels like you are going to throw up if you eat?",
  "data/reddit-ask/r/NoStupidQuestions/comments/nnwpj0/am_i_racist_or_is_he_just_a_jerk.json": "Am I racist or is he just a jerk?",
  "data/reddit-ask/r/NoStupidQuestions/comments/no6uky/a_black_ant_has_separated_from_its_group_and_is.json": "A black ant has separated from its group and is roaming around alone for hours. What can I do to help it?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/n29sq5/is_anyone_else_not_able_to_fall_asleep_if_you.json": "Is anyone else not able to fall asleep if you have to pee even the tiniest bit?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/n2wyah/does_anyone_else_feel_like_the_pandemic_has_taken.json": "Does anyone else feel like the pandemic has taken off years of crucial time and we may never start/get on with things we were supposed to?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/n3g1zr/do_i_say_i_have_an_interview.json": "Do I say I have an interview?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/n3gcg8/men_of_reddit_when_walking_the_same_direction_as.json": "Men of reddit, when walking the same direction as a woman do you slow down your pace to seem less intimidating?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/n4hpyp/is_it_normal_to_have_no_idea_what_you_look_like.json": "Is it normal to have no idea what you look like or how attractive you really are?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/n4lm6k/why_do_people_have_an_issue_with_needing_an_id_to.json": "Why do people have an issue with needing an ID to vote?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/n4n2qu/is_it_normal_that_i_get_an_erection_every_time_i.json": "Is it normal that I get an erection every time I receive a compliment?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/n4ofi3/anyone_else_feel_like_an_attention_seeker_but.json": "Anyone else feel like an attention seeker but hate being the center of attention?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/n54es8/does_anyone_else_feel_clunky_when_they_walk.json": "Does anyone else feel “clunky” when they walk?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/n54qy6/hair_removal_in_female_nether_regions_how_on.json": "Hair removal in female nether regions? How on Earth does one navigate the flaps?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/n5ep6p/why_does_reddit_lose_its_mind_when_you_say.json": "Why does Reddit lose its mind when you say something critical about porn and the effect it has on our brains?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/n5fusl/does_anyone_else_want_to_die_because_life_is.json": "Does anyone else want to die because life is difficult, not because they are sad or depressed?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/n5hrxf/is_sexual_tension_a_real_thing_between_two_people.json": "Is sexual tension a real thing between two people who seem to not like each other?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/n5j4z5/is_it_normal_to_think_my_voice_is_cringey_in.json": "Is it normal to think my voice is cringey in voice recordings?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/n5opjh/am_i_the_only_one_that_seems_affected_by_the.json": "Am I the only one that seems affected by the movie seaspiracy on netflix?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/n5zqo8/why_is_it_okay_for_women_to_say_based_on_my.json": "Why is it okay for women to say “based on my personal experiences I feel very unsafe around men” but not for people to say something like “based on my experiences with black people, I feel very unsafe around them”?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/n6tiqn/are_women_just_as_horny_as_men.json": "Are women just as horny as men?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/n6v4is/if_lgbtq_people_are_going_to_hell_then_why_dont.json": "If lgbtq+ people are going to hell, then why don't they just let them live their lives until they're dead and suffering in hell?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/n7bz0i/does_anyone_else_hate_war_and_violence_in_general.json": "Does anyone else hate war and violence in general on a fundamental level, but still find the vehicles, machinery, and logistics of war to be just the coolest sh*t?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/n7f33v/people_who_do_not_procrastinate_much_do_you_not.json": "People who do not procrastinate much, do you not get feelings of overwhelment, laziness, uncertainty, etc. that would cause you to procrastinate or do you get them but power through them? What is it like inside your head?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/n7kjjb/why_dont_we_learn_about_the_involvement_of.json": "Why don’t we learn about the involvement of Africans in the slave trade?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/n7ruue/fds_cant_be_serious_right.json": "FDS can't be serious right?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/n7tjm7/why_do_we_have_a_tendency_to_tell_suicidal_people.json": "Why do we have a tendency to tell suicidal people that “life is beautiful” ?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/n7u97k/are_men_really_never_complimented.json": "Are men really never complimented?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/n852n8/does_anyone_else_have_an_inbetween_kind_of.json": "Does anyone else have an in-between kind of relationship with a parent where they are both good people and also responsible for a lot of the psychological issues you have now?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/n89yyy/why_people_can_see_the_inhumanity_of_hitler_with.json": "Why people can see the inhumanity of Hitler with Jews from like more than 75 years ago but Everybody is ready to be blind about what's happening in Palestine right now?! Just a genuine Question, No hate Towards anyone.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/n8d69t/my_mom_calls_me_daddy_should_i_ask_her_to_stop.json": "My mom calls me 'daddy'. Should I ask her to stop?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/n8di7k/the_top_10_of_families_own_70_of_the_stock_market.json": "The top 10% of families own 70% + of the stock market. But we also hear the stock market is where the average person has their retirement funds. Are those \"average people\"s accounts in that remaining 30%?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/n8ozua/why_is_criticizing_christianity_acceptable_in.json": "Why is criticizing Christianity acceptable in progressive circles but criticizing Islam is racist?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/n8sf9h/do_people_ever_reach_a_weight_where_they_have_to.json": "Do people ever reach a weight where they have to spread their butt cheeks themselves before they poo?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/n9aw6p/why_does_someone_asking_me_are_you_okay_make_me.json": "Why does someone asking me \"Are you okay?\" make me feel like crying?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/n9b98z/does_anyone_else_avoid_reading_posts_about.json": "Does anyone else avoid reading posts about financial success because it makes them feel ashamed?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/n9pso7/does_anyone_else_have_moments_where_they_realize.json": "Does anyone else have moments where they realize they're a real person?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/n9wu22/whats_with_all_of_the_panic_news_stories_about.json": "What’s with all of the panic news stories about declining birth rates and declining fertility? Isn’t this actually a good thing due to overpopulation, famine, etc?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/nak99s/i_have_never_seen_in_my_entire_life_neither_in.json": "I have never seen in my entire life, neither in photos nor live, a baby pigeon. Do they even exist or do they just spawn as adults?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/nal11o/jewish_people_have_dealt_with_so_much_through.json": "Jewish people have dealt with so much through history, how come they pass that on and do the same to Palestinian people?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/nb1vay/why_do_people_like_to_blame_the_schooling_system.json": "Why do people like to blame the schooling system for things they don’t know, but are not willing to do the research themselves?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/nb325f/is_it_normal_to_hate_bumping_into_people_even_if.json": "Is it normal to hate bumping into people even if I like them?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/nb40rx/why_are_womens_sports_referred_to_as_such_and.json": "Why are women's sports referred to as such and men's sports just referred to as sports?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/nbdud3/why_is_it_racist_to_call_it_wuhan_virus_or_china.json": "Why is it racist to call it \"Wuhan Virus\" or \"China virus\" but okay to call it Brazil variant, Indian variant, UK variant, etc?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/nbjk6a/do_people_care_if_their_partners_boobs_are_uneven.json": "Do people care if their partner's boobs are uneven?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/nc0grs/is_anyone_elses_sole_purpose_of_continuing_to.json": "Is anyone else's sole purpose of continuing to live that your family will be sad if you died?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/nc1k0e/who_else_is_glad_to_use_mobile_ordering_to_get.json": "who else is glad to use mobile ordering to get all the options for customizing their food they were too afraid to ask for before it was made popular?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/nc9m78/is_this_all_there_is_to_life.json": "Is this all there is to life?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ncg232/anyone_else_find_the_treatment_of_black_people_on.json": "Anyone else find the treatment of black people on TV dehumanizing?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ncu2lb/do_boys_really_not_get_touched_often.json": "Do boys really not get touched often?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ndhlxy/why_is_satan_looked_at_as_a_bad_guy_if_his_main.json": "Why is Satan looked at as a bad guy if his main thing is punishing bad people?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ndq8u8/does_anyone_else_hear_nonsense_sentences_in_your.json": "Does anyone else hear nonsense sentences in your head when you're close to falling asleep?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ndv87t/women_what_are_we_supposed_to_do_to_avoid_making.json": "Women, what are we supposed to do to avoid making you feel uncomfortable when we're alone in a dark parking lot but I'm just trying to get to my car?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ndztqy/im_clearly_ignorant_here_but_can_someone_please.json": "I'm clearly ignorant here but can someone please explain in layman's term what is happening between Israel and Palestine? I know there has been an on-going issue that has resulted in current events but it all seems fairly complex and I'd like to educate myself a bit on the issue.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/nefvjp/is_it_ok_to_do_small_amount_of_exercise_each_day.json": "Is it ok to do small amount of exercise each day if I want to start with exercise?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/nemjh8/why_do_i_want_to_die_anytime_i_make_a.json": "Why do I want to die anytime I make a mistake/disappoint someone?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/nex9tt/anyone_else_cringe_hard_when_onlineclasses.json": "Anyone else cringe hard when online-classes professors ask a question and everyone is just silent?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/nf1svd/is_it_weird_to_want_a_body_pillow.json": "Is it weird to want a body pillow?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/nfzymd/why_is_it_the_norm_that_we_have_to_be_woken_up_up.json": "Why is it the norm that we have to be woken up up by something other then our internal clock to then force feed and shit ourselves to get to a job which the majority hate for about 40 hours a week? Wasn't one of the benefits of technology to make our lives easier and more enjoyable?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ng1zhq/does_it_seem_pathetic_to_go_to_cat_cafes_alone.json": "Does it seem pathetic to go to cat cafes alone?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ngjjm3/why_is_taking_paid_time_off_pto_such_a_work_place.json": "Why is taking Paid Time Off (PTO) such a work place taboo?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ngoo0b/is_it_fair_to_assume_most_religious_people_in_the.json": "Is it fair to assume most religious people (in the U.S. at least) are usually only religious because they were raised into it and don’t put too much serious thought into their beliefs?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/nh5du0/why_are_most_people_on_reddit_antireligious.json": "Why are most people on Reddit anti-religious, nihilistic and offensive to the idea of religion?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/nh8hmp/how_can_i_tell_an_student_with_autism_that_i_work.json": "How can I tell an student with autism that I work with that I don’t want to play roblox with him anymore?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/nhaaxr/is_it_just_me_or_are_things_becoming_scarily.json": "Is it just me or are things becoming scarily expensive/unaffordable?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/nhcy84/if_sex_and_relationships_arent_that_important.json": "If sex and relationships aren’t that important then why is every single piece of media consumed by them?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/nhutvd/why_is_it_ethical_to_put_down_a_animal_whos.json": "Why is it ethical to put down a animal who’s crippled and in pain but not a human?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/nic79g/why_some_people_wear_kinky_stuff_or_inappropriate.json": "Why some people wear kinky stuff or inappropriate clothes in the pride parade ? Doesn't this make LGBTQ+ community look bad ?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/nifpfc/imagine_you_have_a_wife_whom_you_really_love_and.json": "Imagine you have a wife, whom you really love, and you somehow find out she was your long-lost sister, what would you do?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/niirfc/why_is_it_wrong_to_kill_a_human_being.json": "Why is it wrong to kill a human being?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/nip04z/why_do_cheaters_get_in_relationships_knowing.json": "Why do cheaters get in relationships knowing they’re going to cheat?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/niqmw7/how_do_adults_with_jobs_keep_their_homes_clean.json": "How do adults with jobs keep their homes clean?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/nj2q7r/does_anyone_else_feel_sad_when_they_find_a_dead.json": "Does anyone else feel sad when they find a dead subreddit that seems like to would have been great?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/njb5mh/is_it_just_me_or_is_there_an_unnecessary_amount.json": "Is it just me or is there an unnecessary amount of sex and kissing scenes in Hollywood movies, much more than is even needed?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/njf6vj/am_i_crazy_or_is_life_really_robotic.json": "Am I crazy or is life really robotic?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/njhqrh/anybody_ever_just_a_shit_and_then_turn_around_and.json": "Anybody ever just a shit and then turn around and it’s not there? It’s almost like it never existed😳",
  "data/reddit-ask/r/TooAfraidToAsk/comments/njl4z1/it_is_normal_to_be_a_masc_guy_but_im_sexually.json": "It is normal to be a masc guy but i'm sexually turned on by other masc guys?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/njlui3/what_do_you_do_after_you_use_the_bidet_but_before.json": "What do you do after you use the bidet but before you pull up your pants? Possibly NSFW",
  "data/reddit-ask/r/TooAfraidToAsk/comments/njn3zz/how_are_so_many_books_a_new_york_times_bestseller.json": "How are so many books a New York Times Bestseller?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/nk28w0/is_anyone_else_just_so_fed_up_with_what_seems.json": "Is anyone else just so fed up with what seems like an endless and constant stream of movie announcements that are just superhero movies?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/nkmn56/can_fat_girls_be_cute.json": "Can fat girls be cute?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/nknplv/are_bachelor_parties_getting_out_of_hand.json": "Are bachelor parties getting out of hand?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/nlau71/why_are_cops_allowed_to_be_fat.json": "Why are cops allowed to be fat?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/nloxrd/why_were_people_so_angry_about_the_treatment_of.json": "Why were people so angry about the treatment of migrant children under the Trump Administration but extremely quiet under Biden?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/nlr9t2/does_anyone_else_ever_have_the_urge_to_do.json": "Does anyone else ever have the urge to do something but when you decide to do something you don't know what?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/nlu5h7/what_do_you_do_in_strip_clubs.json": "What do you do in strip clubs?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/nlvckk/is_it_bad_to_want_to_die_but_you_have_zero.json": "Is it bad to want to die but you have zero intentions to kill yourself ?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/nlx3it/am_i_crazy_or_is_the_reddit_app_messed_up.json": "Am I crazy or is the Reddit app messed up?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/nm7j4k/do_people_really_not_shower_the_navy_shower_style.json": "Do people really not shower the \"navy shower\" style?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/nmaums/do_you_ever_feel_weird_when_you_walk_with_your.json": "do you ever feel weird when you walk with your hands on your side dangling?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/nmq370/is_it_bad_that_im_not_bothered_by_white_people.json": "Is it bad that i’m not bothered by white people saying the N word?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/nmr7c9/why_is_it_so_difficult_to_talk_sometimes_does.json": "Why is it so difficult to talk sometimes? Does anyone else feel like this?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/nmwmkd/is_it_sexist_to_want_a_housewife_and_why.json": "Is it sexist to want a housewife, and why?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/nmwxhe/does_anyone_else_have_the_problem_where_they_will.json": "Does anyone else have the problem where they will totally blank out on a person's name, but will remember specific details about them like something they said or did or a look, even many years later? I can't remember their name, but I know who they are and where I met them. Any tips for fixingthis",
  "data/reddit-ask/r/TooAfraidToAsk/comments/nn8rwc/why_do_i_get_extremely_obsessive_about_hobbies.json": "Why do i get extremely obsessive about hobbies for short periods of time and then stop caring about them in an instant?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/nnc08k/what_is_the_deal_with_misgendering.json": "What is the deal with misgendering?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/nndlnh/do_you_put_your_full_weight_on_someone_who_asks.json": "Do you put your full weight on someone who asks you to sit on their face?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/nnf2s4/i_see_all_over_the_internet_people_saying_that.json": "I see all over the internet people saying that music helps them when they feel depressed. Is it normal to have the opposite reaction? I cannot listen to music if I feel depressed as it might bring up feelings of nostalgia or memories of experiences that worsen my depression.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/nnh6zv/why_was_trump_called_racist_for_calling_covid_the.json": "Why was Trump called racist for calling COVID the \"Chinese virus\" even though everybody else says \"the Indian variant\"?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/nnq6jw/why_is_there_body_positivity_but_seemingly_no.json": "Why is there body positivity but seemingly no face positivity movement?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/nnuewq/turned_off_our_restrictions_for_transgender.json": "Turned off our restrictions for transgender questions and got flooded with a lot of bad faith transgender questions… so it’s back on again.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/no3r6y/why_do_people_think_the_bible_is_literal.json": "Why do people think the Bible is literal?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/no44wt/what_goes_on_in_some_guys_brains_when_they_give.json": "What goes on in SOME guys brains when they give sexual complements or catcall?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/noa2jb/why_when_im_about_to_go_to_sleep_i_get_urges_to.json": "Why when I'm about to go to sleep I get urges to pursue skills and knowledge, but when I wake up it's all gone until next evening? Can I get this motivation some time earlier (during morning or day)?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/nou3k1/why_do_americans_sexualized_the_word_daddy.json": "Why do americans sexualized the word \"daddy\"?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/nouagq/does_anyone_else_look_forward_to_death.json": "Does anyone else look forward to death?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/nowb22/could_i_have_sexual_trauma_from_my_mom_strip.json": "Could I have sexual trauma from my mom strip searching me?",
  "data/reddit-ask/r/TrueAskReddit/comments/n5qzbp/in_the_20th_century_trains_began_to_go_out_of.json": "In the 20th century, trains began to go out of fashion as air travel become more accessible. Now, rail travel is making a comeback. What things that we're phasing out could make a comeback in the next century?",
  "data/reddit-ask/r/TrueAskReddit/comments/n6hq30/how_can_i_better_say_what_i_mean.json": "How can I better say what I mean?",
  "data/reddit-ask/r/TrueAskReddit/comments/n7vzg1/with_unemployment_at_an_all_time_high_and.json": "With unemployment at an all time high and companies having trouble finding workers due to a 'hive-mind bargaining', is this a historical opportunity to unionize the working class?",
  "data/reddit-ask/r/TrueAskReddit/comments/n8o3h0/is_it_okay_for_your_so_to_freely_read_your.json": "Is it okay for your SO to freely read your messages with your friends without asking for permission first and just log into your account/phone whenever they feel like it?",
  "data/reddit-ask/r/TrueAskReddit/comments/nauiaz/do_we_actually_have_choice_or_are_we_just_a.json": "Do we actually have choice? Or are we just a bundle of chemical reactions?",
  "data/reddit-ask/r/TrueAskReddit/comments/nbj8e7/i_often_hear_about_trauma_causing_children_to.json": "I often hear about trauma causing children to grow up too quickly but I’ve also read about adolescent behavior being extended well into peoples young adult lives. What is a “good” age to leave adolescent behavior behind?",
  "data/reddit-ask/r/TrueAskReddit/comments/ncal6p/as_a_bisexual_person_how_do_your_relationships.json": "As a bisexual person, how do your relationships different dating a man vs dating a woman?",
  "data/reddit-ask/r/TrueAskReddit/comments/ne3z2o/what_would_be_the_impact_of_all_employee.json": "What would be the impact of all employee salaries/wages being public knowledge?",
  "data/reddit-ask/r/TrueAskReddit/comments/nezzpd/why_are_people_so_reluctant_to_change_their_minds.json": "Why are people so reluctant to change their minds, or even just admit fault, even when presented with compelling, sourced arguments?",
  "data/reddit-ask/r/TrueAskReddit/comments/nhduaf/whats_the_point_of_a_democracy_where_the.json": "What's the point of a democracy where the electorate doesn't truly understand what they're voting for?",
  "data/reddit-ask/r/TrueAskReddit/comments/ni0267/older_crowd_was_being_financially_responsible.json": "Older Crowd: Was being financially responsible worth it?",
  "data/reddit-ask/r/TrueAskReddit/comments/nil39p/how_do_you_really_take_a_break.json": "How do you REALLY take a break?",
  "data/reddit-ask/r/askphilosophy/comments/n2eycy/why_is_it_that_a_single_good_deed_isnt_enough_to.json": "Why is it that a single good deed isn’t enough to pardon a life of evilness but a single act of evil is enough to condemn a life of good deeds?",
  "data/reddit-ask/r/askphilosophy/comments/n2x0gx/are_there_any_philosophers_who_published_their.json": "Are there any philosophers who publish(ed) their ideas in interactive or unconventional forms?",
  "data/reddit-ask/r/askphilosophy/comments/n36a9q/how_to_come_to_terms_with_the_knowledge_that_most.json": "How to come to terms with the knowledge that most of our modern jobs are fundamentally meaningless?",
  "data/reddit-ask/r/askphilosophy/comments/n4mzqn/how_does_omniscience_interact_with_randomness.json": "How does omniscience interact with randomness?",
  "data/reddit-ask/r/askphilosophy/comments/n5btgz/is_the_current_cult_of.json": "Is the current cult of individualism/self-reliance/self-improvement contributing to the dominance of capitalism? Or are these just two sides of the same coin?",
  "data/reddit-ask/r/askphilosophy/comments/n5zryc/do_indescribable_things_exist_questions_about.json": "Do indescribable things exist? Questions about language and its unlimitedness",
  "data/reddit-ask/r/askphilosophy/comments/n68imo/is_it_true_that_good_and_evil_can_only_exist_when.json": "Is it true that Good and evil can only exist when a conscious choice is made? For instance A volcano erupting is not \"evil\". Rain falling is not \"good\". BY DEFINITION.",
  "data/reddit-ask/r/askphilosophy/comments/n6u6s7/do_we_love_the_feeling_of_being_in_love.json": "Do we love the feeling of being in love?",
  "data/reddit-ask/r/askphilosophy/comments/n776ty/how_to_justify_sexualization_fetishization_and.json": "How to justify sexualization, fetishization and objectification?",
  "data/reddit-ask/r/askphilosophy/comments/n8c8kn/why_are_there_so_few_widely_known_russian.json": "Why are there so few widely known russian philosophers?",
  "data/reddit-ask/r/askphilosophy/comments/n9lvgv/i_love_watching_philosophers_debate_can_anyone.json": "I love watching Philosophers debate. Can anyone recommend me some of their favourite debates?",
  "data/reddit-ask/r/askphilosophy/comments/nad12f/how_does_one_use_ockhams_razor_properly.json": "How does one use Ockham's Razor properly?",
  "data/reddit-ask/r/askphilosophy/comments/nar433/how_did_spinozas_ideas_about_god_challenge_the.json": "How did Spinoza’s ideas about God challenge the views of orthodox theism?",
  "data/reddit-ask/r/askphilosophy/comments/nbah76/i_have_tried_multiple_times_to_get_into.json": "I have tried multiple times to get into philosophy, but every time I start a new book I can't understand it because the words used are to big for me to understand. What should I do?",
  "data/reddit-ask/r/askphilosophy/comments/ncaylu/what_is_your_favourite_easilydigestible.json": "What is your favourite easily-digestible philosophy book?",
  "data/reddit-ask/r/askphilosophy/comments/ncsi02/was_mathematics_invented_or_discovered.json": "Was mathematics invented or discovered?",
  "data/reddit-ask/r/askphilosophy/comments/ndwdxv/why_are_people_against_determinism.json": "Why are people against determinism?",
  "data/reddit-ask/r/askphilosophy/comments/nejjma/what_did_kierkegaard_mean_when_he_said_what_if.json": "What did Kierkegaard mean when he said “What if everything in the world were a misunderstanding, what if laughter were really tears?”",
  "data/reddit-ask/r/askphilosophy/comments/nfi4w0/how_do_modern_marxists_respond_to_the_fact_that.json": "How do modern Marxists respond to the fact that communist revolutions have tended to happen not in developed capitalist economies, but rather mostly in the third world and colonial states? How would Marx himself have responded?",
  "data/reddit-ask/r/askphilosophy/comments/nht473/is_it_just_me_or_is_the_self_help_genre_a_very.json": "is it just me or is the self help genre a very simplified and filtered version of philosophy?",
  "data/reddit-ask/r/askphilosophy/comments/niv3qd/want_to_learn_philosophy_as_i_would_learn_it_in.json": "Want to learn philosophy as I would learn it in school? What YouTubers should I watch?",
  "data/reddit-ask/r/askphilosophy/comments/njutjx/does_camus_really_avoid_taking_the_leap_of_faith.json": "Does Camus really avoid taking the Leap of Faith?",
  "data/reddit-ask/r/askphilosophy/comments/nk87xq/is_there_a_philosopher_who_attempted_to_justify.json": "Is there a philosopher who attempted to justify eating meat/dairy?",
  "data/reddit-ask/r/askphilosophy/comments/nmj0l1/why_is_it_so_exceedingly_difficult_for_us_to.json": "Why is it so exceedingly difficult for us to think beyond capitalism? How have we come to embrace what one author has called “capitalist realism”? Why is it easier for us to imagine the end of the world than the end of capitalism, to quote Žižek, or whoever it is that said it?",
  "data/reddit-ask/r/askphilosophy/comments/nn55be/my_7_year_old_asked_me_if_i_ever_think_about_what.json": "My 7 year old asked me if I ever think about what it was like before you existed from your perspective. Where were we, what were we? What do I say? How do I motivate him to keep thinking deeply like this even though there isn't good answers?",
  "data/reddit-ask/r/askphilosophy/comments/nnyswm/what_is_academic_philosophy_like_as_a_profession.json": "What is Academic Philosophy like as a Profession?",
  "data/reddit-ask/r/askphilosophy/comments/nockdv/how_do_philosophers_use_logic_in_their_work.json": "How do philosophers use logic in their work?",
  "data/reddit-ask/r/askphilosophy/comments/nowvr9/can_we_trust_the_laws_of_logic_are_they_absolute.json": "Can we trust the laws of logic? Are they absolute? Why are they true, why do they work?",
  "data/reddit-ask/r/askscience/comments/n2gjxw/if_bacteria_have_evolved_penicillin_resistance.json": "If bacteria have evolved penicillin resistance, why can’t we help penicillin to evolve new antibiotics?",
  "data/reddit-ask/r/askscience/comments/n3t9tj/askscience_ama_series_we_are_tabitha_lipkin_and.json": "AskScience AMA Series: We are Tabitha Lipkin and Liv Williamson a Naui Dive Master and NBCLX host and a marine biologist respectively. Ask us anything!",
  "data/reddit-ask/r/askscience/comments/n4kwip/why_does_the_sarscov2_coronavirus_genome_end_in.json": "Why does the SARS-Cov2 coronavirus genome end in aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa (33 a's)?",
  "data/reddit-ask/r/askscience/comments/n64npm/askscience_ama_series_hey_reddit_we_are.json": "AskScience AMA Series: Hey Reddit! We are scientists working with forest and tree height data, including land cover and carbon. Many of us use a combination of satellite and ground measurements in our research with NASA and beyond. AUA about trees and how they can help us regulate climate change.",
  "data/reddit-ask/r/askscience/comments/n65cyz/why_are_75_of_the_earths_annular_lakes_north_of.json": "Why are 75% of the earth's annular lakes north of the 49th parallel when only about 1/8 of the earth's land surface is there?",
  "data/reddit-ask/r/askscience/comments/n66hnc/when_to_massive_objects_merge_the_gravitational.json": "When to massive objects merge the gravitational waves created carry insane amounts of energy. Due the conservation of mass and energy does this mean that the black holes lost mass?",
  "data/reddit-ask/r/askscience/comments/n6d5rn/when_the_antibodies_are_created_against.json": "When the antibodies are created against coronavirus, or any other similar special diseases, do they stay in body for lifetime? Or would they get destroyed when not in use?",
  "data/reddit-ask/r/askscience/comments/n6esfe/how_does_my_body_form_antibodies_against_the.json": "How does my body form antibodies against the antigens of other blood types eventhough i have never been exposed to them? ( for eg how did a person with O blood group form anti-a and anti-b?)",
  "data/reddit-ask/r/askscience/comments/n6n82i/how_do_nonplugin_hybrid_cars_actually_use_less.json": "How do non-plugin hybrid cars actually use less fuel?",
  "data/reddit-ask/r/askscience/comments/n6smiy/what_is_the_difference_between_a_mirror_and_a.json": "What is the difference between a mirror and a white object?",
  "data/reddit-ask/r/askscience/comments/n74z66/do_blue_leds_and_oleds_have_to_output_more_light.json": "Do blue LEDs and OLEDs have to output more light to compensate for our relatively low sensitivity to blue wavelengths?",
  "data/reddit-ask/r/askscience/comments/n7ay0c/would_dominoes_collapse_faster_on_a_planet_with.json": "Would dominoes collapse faster on a planet with stronger gravity than Earths?",
  "data/reddit-ask/r/askscience/comments/n8aktm/ibm_just_unveiled_their_2nm_data_processing_chip.json": "IBM just unveiled their 2nm data processing chip. Quantum effects start operating in the 5nm range, how is it possible to bypass these effects?",
  "data/reddit-ask/r/askscience/comments/n8bzrm/if_you_keep_a_metal_next_to_a_magnet_long_enough.json": "If you keep a metal next to a magnet long enough, will the metal change shape?",
  "data/reddit-ask/r/askscience/comments/n93sgv/how_to_interpret_efficiency_cruves_of_climb_and.json": "How to interpret efficiency cruves of climb and cruise propellers?",
  "data/reddit-ask/r/askscience/comments/n95qqf/does_the_visual_cortex_get_repurposed_in_blind.json": "Does the visual cortex get 're-purposed' in blind people?",
  "data/reddit-ask/r/askscience/comments/n9rrd5/is_there_a_virus_that_we_know_exists_but_havent.json": "Is there a virus that we know exists but haven't been able to isolate it?",
  "data/reddit-ask/r/askscience/comments/n9z5u0/are_there_any_animal_species_whose_gender_ratio.json": "Are there any animal species whose gender ratio isn't close to balanced? If so, why?",
  "data/reddit-ask/r/askscience/comments/nbdz24/askscience_ama_series_covid_variants_and_vaccines.json": "AskScience AMA Series: COVID Variants and Vaccines - We are a physician scientist and emergency physician, ask us anything!",
  "data/reddit-ask/r/askscience/comments/nbs5vd/why_do_most_animals_have_their_eyes_nose_and.json": "Why do most animals have their eyes, nose, and mouth clustered together in roughly the same way as other species?",
  "data/reddit-ask/r/askscience/comments/nc0f6j/what_causes_diarrhea_specifically_why_and_how_is.json": "What causes diarrhea? Specifically why and how is a virus causing the body to expel massive amounts of water?",
  "data/reddit-ask/r/askscience/comments/nccesd/why_is_the_inner_solar_system_rocky_inner_planets.json": "Why is the inner solar system rocky (inner planets), the outer solar system gas (outer planets), and the far outer solar system rocky (Oort cloud, transNeptunian objects)?",
  "data/reddit-ask/r/askscience/comments/nccg68/how_do_we_get_vitamin_d_from_sunlight.json": "How do we get Vitamin D from sunlight?",
  "data/reddit-ask/r/askscience/comments/nczjeu/can_a_mutated_virus_become_a_new_disease.json": "Can a mutated virus become a new disease?",
  "data/reddit-ask/r/askscience/comments/nd3hsq/what_is_the_difference_between_absolute_risk.json": "What is the difference between Absolute Risk Reduction(ARR) and Relative Risk Reduction(RRR) as it relates to COVID vaccines?",
  "data/reddit-ask/r/askscience/comments/ndn1er/why_major_human_body_organs_like_kidneys_and.json": "Why major human body organs like kidneys and heart weaken or stop functioning in COVID patients?",
  "data/reddit-ask/r/askscience/comments/nduhp6/how_deep_is_the_sand_in_the_sahara_desert_whats.json": "How deep is the sand in the Sahara Desert? What's underneath? Is there a flat surface?",
  "data/reddit-ask/r/askscience/comments/nedt9v/water_in_a_vacuum_why_does_the_boiling_stop.json": "Water in a vacuum, why does the boiling stop?",
  "data/reddit-ask/r/askscience/comments/nefzwy/askscience_ama_series_were_the_scientists_who.json": "AskScience AMA Series: We're the scientists who figured out cutting methane emissions can avoid 0.3°C of global warming by 2045. Ask us anything!",
  "data/reddit-ask/r/askscience/comments/nfc82t/how_do_cicadas_harden_their_exoskeleton_so.json": "How do cicada's harden their exoskeleton so quickly after molting? What is the actual bio process from soft to hard?",
  "data/reddit-ask/r/askscience/comments/ng2q1g/askscience_ama_series_i_am_a_forensic.json": "AskScience AMA Series: I am a forensic anthropologist at the University of Florida who will be excavating for human remains in Tulsa, Oklahoma during the 100th anniversary of the Tulsa Race Massacre. AMA!",
  "data/reddit-ask/r/askscience/comments/ngqj4a/if_the_fm_radio_signal_transmits_information_by.json": "if the FM radio signal transmits information by varying the frequency, why do we tune in to a single frequency to hear it?",
  "data/reddit-ask/r/askscience/comments/nhr9er/why_are_there_no_natural_proton_emissions_in.json": "Why are there no natural proton emissions in radioactive decay?",
  "data/reddit-ask/r/askscience/comments/nhrct4/if_you_already_have_antibodies_to_a_disease_would.json": "If you already have antibodies to a disease, would catching that disease afterward “boost” the antibodies allowing them to last longer than their expiration date?",
  "data/reddit-ask/r/askscience/comments/nide6a/when_is_a_defibrillator_used_and_when_is_chest.json": "When is a defibrillator used and when is chest compressions done?",
  "data/reddit-ask/r/askscience/comments/nilxo6/i_have_heardread_from_a_few_sources_that_viral.json": "I have heard/read from a few sources that viral load is one of the factors influencing severity of the infection in Covid-19. How far is this true?",
  "data/reddit-ask/r/askscience/comments/nj5ala/does_rabies_virus_spread_from_the_wound_to_other.json": "Does Rabies virus spread from the wound to other parts of the body immediately?",
  "data/reddit-ask/r/askscience/comments/nja0l0/does_catnip_affect_large_cats_like_pumas_or_tigers.json": "Does catnip affect large cats like pumas or tigers?",
  "data/reddit-ask/r/askscience/comments/njtx39/what_is_the_difference_between_photofission_and.json": "What is the difference between Photofission and Photodisintegration?",
  "data/reddit-ask/r/askscience/comments/njzi5d/why_are_studies_on_how_effective_antibodies.json": "Why are studies on how effective antibodies attained from having covid 19 are at future immunity so much more inconclusive than studies on effectiveness of the vaccine?",
  "data/reddit-ask/r/askscience/comments/nkmz9f/askscience_ama_series_im_gene_kritsky_known_as.json": "AskScience AMA Series: I'm Gene Kritsky, known as the Indiana Jones of cicadas. I'm here to present new discoveries about these \"bugs of history,\" when to expect them, what to do about them and how you can participate in mapping the next brood. AMA!",
  "data/reddit-ask/r/askscience/comments/nle2wm/how_did_the_first_atoms_come_into_existence_and.json": "How did the first atoms come into existence and how do we know that?",
  "data/reddit-ask/r/askscience/comments/nlhqcx/ask_anything_wednesday_physics_astronomy_earth.json": "Ask Anything Wednesday - Physics, Astronomy, Earth and Planetary Science",
  "data/reddit-ask/r/askscience/comments/nlqw0c/why_can_i_see_my_led_lightbulbs_flicker_when_i.json": "Why can I see my LED lightbulbs flicker when I see them in my periphery, but not directly?",
  "data/reddit-ask/r/askscience/comments/nm6wtj/askscience_ama_series_were_experts_here_to.json": "AskScience AMA Series: We're Experts Here to Discuss Zoonotic Disease. AUA!",
  "data/reddit-ask/r/askscience/comments/nmcp1w/if_looking_further_into_space_means_looking_back.json": "If looking further into space means looking back into time, can you theoretically see the formation of our galaxy, or even earth?",
  "data/reddit-ask/r/askscience/comments/nme1qp/how_much_does_personality_really_differ_between.json": "How much does personality really differ between sexes as compared to within-sex variation?",
  "data/reddit-ask/r/askscience/comments/nmvafn/askscience_ama_series_im_dr_katie_mack.json": "AskScience AMA Series: I'm Dr. Katie Mack, theoretical astrophysicist, TED Fellow, and author of The End of Everything, which describes five possible ways the universe could end. I'm here to answer questions about cosmic apocalypses, the universe in general, and writing (or tweeting) about science!",
  "data/reddit-ask/r/askscience/comments/nn0m31/i_sometimes_see_a_chicken_egg_with_two_yolks.json": "I sometimes see a chicken egg with two yolks inside. If the egg were to be fertilized, would the two yolks result in twin baby chicks?",
  "data/reddit-ask/r/askscience/comments/nn9csx/if_some_animals_can_emit_light_can_they_emit.json": "If some animals can emit light, can they emit other forms of electromagnetic radiation in useful ways (obviously, excluding infrared as escaped heat)?"
}