{
  "data/reddit-know/r/YouShouldKnow/comments/ksx5nc/ysk_if_someone_commits_a_trivial_mistake_in_their.json": "Why YSK: People often ridicule the grammatical or other mistakes in people’s\nEnglish to invalidate their point. Chances are they noticed it too and simply\ndon’t care. Their point still stands stall if it’s coherent enough, anyone going\nout of the way to comment on their mistake is either losing the…",
  "data/reddit-know/r/YouShouldKnow/comments/kt19g3/ysk_snow_should_be_removed_from_the_front_and.json": "Why YSK: Any snow left on your car can become a hazard to you or others if left\non the car while driving.\n\nSnow on the windows can block visibility.\n\nSnow on the hood can fly up and hit the windshield, blocking your view of the\nroad.\n\nSnow on the rear windshield limits your ability to see behind…",
  "data/reddit-know/r/YouShouldKnow/comments/kturp5/ysk_just_because_everyone_around_you_is_an.json": "Why YSK: there’s a saying: if everyone around you is an asshole you might be the\nactual asshole. Here’s why that’s not always the case.\n\nPeople who suffered from trauma (specifically childhood trauma) are often\nattracted to people similar to the ones they grew up with. Your brain doesn’t\ncare if…",
  "data/reddit-know/r/YouShouldKnow/comments/ku2qj6/ysk_when_youre_infatuated_with_someone_your_brain.json": "Why YSK: Because although these feelings of euphoria are exciting, they can just\nas easily leave you feeling insecure and undeserving of the person you're\ninfatuated with.\n\nDon't let your dopamine trick you into believing they're absolutely faultless\nand that you're unworthy of their love.\n\nEdit:…",
  "data/reddit-know/r/YouShouldKnow/comments/ku5a3n/ysk_how_to_be_homeless_and_not_completely.json": "Why YSK: Because homelessness is awful, and unless youre able to accomplish a\nvan dwelling sort of lifestyle, it can and will likely break you. These tips may\nwell help you mitigate that.\n\nIm approaching 5 years myself, and while these days its more of a choice for me\n(Ive lost all faith in…",
  "data/reddit-know/r/YouShouldKnow/comments/kue5p4/ysk_dont_comment_on_how_little_someone_eats_at_a.json": "Why YSK: Many people who are recovering from, have recovered from, or are\nstruggling with an illness such as anorexia, bulimia, or chronic illnesses such\nas cancer or leukemia, literally can not eat very much at all without feeling\nincredibly full and nauseous. In fact, you shouldn't comment on…",
  "data/reddit-know/r/YouShouldKnow/comments/kuhy0p/ysk_there_is_a_modern_free_and_public_domain.json": "Why YSK: Project Gutenberg is a godsend for public domain ebooks, however there\ncould be room for improvement for search and exploring ebooks by authors and\ntags.\n\nThis app at http://bookdark.com allows modern app feel with better search and\nexploration.\n\nBooks are in pdf format that has universal…",
  "data/reddit-know/r/YouShouldKnow/comments/kuie33/ysk_you_can_bypass_paywalls_article_membership.json": "Why YSK: An ever increasing number of news websites have annoying paywalls and\nsubscription memberships on their articles. This can get very frustrating when\nresearching things, of if you need to access just that one article.\n\nIt's not perfect, but you can use https://outline.com/ to access that…",
  "data/reddit-know/r/YouShouldKnow/comments/kuj8o1/ysk_suicides_do_not_increase_in_the_winter_they.json": "Why YSK: The winter has been associated with depression and suicide but most\nsuicides happen in the late spring and early summer. So don't forget to reach\nout to people in the spring to hang out.\n\n\n\nhttps://ourworldindata.org/suicide#daylight…",
  "data/reddit-know/r/YouShouldKnow/comments/kumvbb/ysk_many_dishwashers_have_filters_that_need_to_be.json": "YSK many dishwashers have filters that need to be pulled out and cleaned\nregularly, especially if you don’t rinse your dishes. Some are very easy to\naccess, a quick twist and rinse/light scrub with a brush and they’re good to go.\nOther filters are deeper in the dishwasher and require you to take…",
  "data/reddit-know/r/YouShouldKnow/comments/kunrib/ysk_you_can_transform_the_life_of_someone.json": "Why YSK: When other treatment options fail, it leaves transplantation as their\nonly hope to read a book, to drive a car, to enjoy a sunset or to watch their\nchildren grow up.\n\nTheir sight was restored because caring individuals donated their corneas after\nthey died, providing the essential tissue…",
  "data/reddit-know/r/YouShouldKnow/comments/kutxf5/ysk_studio_gonzo_a_japanese_anime_studio_uploads.json": "Why YSK: A lot of anime streaming sites still don't support the studios that\ncreate the shows we love. So if anything from Studio Gonzo isn't on Crunchyroll,\ntry their YouTube channel. Enjoy! [https://www.youtube.com/user/gonzo/videos]",
  "data/reddit-know/r/YouShouldKnow/comments/kuxgim/ysk_if_you_ever_accidentally_pocketdial_911_let.json": "Why YSK: Assuming a 911 operator can’t hear what’s going on outside of your\npocket, they may dispatch EMS to your location as a precaution",
  "data/reddit-know/r/YouShouldKnow/comments/kv849q/ysk_how_to_use_the_ivy_lee_method_to_increase.json": "Why YSK: The Ivy Lee Method is one of the oldest, simplest, and most effective\nproductivity hacks that you can apply in your life.\n\nHere is the way it works: each night before your day of work, write down your\nsix most important tasks to do the next day in order of importance. The next\nday, you…",
  "data/reddit-know/r/YouShouldKnow/comments/kvmvqv/ysk_if_youre_sending_anything_solid_in_an.json": "Why YSK: the machines that are sorting the envelopes rotate really fast so that\nthey spin around a lot. Solid objects could easily cut or tear the envelope and\nget lost in the machine. And because they are separated from the envelope they\ncould not be assigned to you or the reciever. By taping them…",
  "data/reddit-know/r/YouShouldKnow/comments/kvwbzy/ysk_the_difference_between_off_premise_and_off.json": "Why YSK: With the IT abbreviation \"On-Prem\" and \"Off-Prem\", people often want to\nbe more formal, and lengthen it. Unfortunately, they too often say \"Off Premise\"\nor \"On Premise\". Without the necessary final \"s\".\n\nA \"premise\" is a position on an opinion, an argument, etc.\n\nA \"premises\" is a…",
  "data/reddit-know/r/YouShouldKnow/comments/kw3bqj/ysk_chrome_browser_for_iphone_lets_you_use_the.json": "Why YSK: I think it’s silly to pay YouTube just so you can play music while\ndoing other things on your iPhone.",
  "data/reddit-know/r/YouShouldKnow/comments/kw6axs/ysk_it_isnt_good_to_use_laser_pointers_with_pets.json": "Why YSK: laser pointers can be a serious problem to your pets mental health. As\nfun as it seems for your pet to chase a laser pointer, it’s actually very\ndetrimental to their mental health. It causes obsessive tendencies and can cause\nanimals to feel high strung and dissatisfied. This is because…",
  "data/reddit-know/r/YouShouldKnow/comments/kw6b7z/ysk_that_if_attached_your_bank_account_to_venmo_a.json": "Why YSK: Plaid, which Venmo uses, stores your bank account password and uses it\nto record all your activity.\n\nPlaid was recently sued by a bank:\nhttps://www.ctvnews.ca/business/td-bank-files-lawsuit-against-plaid-accusing-it-of-trying-to-dupe-consumers-1.5145326\n\n> \"In reality, however, consumers…",
  "data/reddit-know/r/YouShouldKnow/comments/kwi67g/ysk_that_eu_citizens_can_take_college_courses.json": "Why YSK: it's quality education from accredited universities which can help you\nin your career or just be really interesting, while costing you nothing and not\nrequiring you to leave your house.\n\nApplications for some autumn 2021 courses are open until the 15th of January, so\ngo take a look now at…",
  "data/reddit-know/r/YouShouldKnow/comments/kwjxhr/ysk_that_there_is_an_easy_way_to_tell_if_a_aa.json": "Why YSK, batteries are often wasted when used and unused batteries are confused\nand they are thrown away. You can easily tell the difference without testing\nthem.\n\nEdit: To be clear, this method only really shows you whether a battery is used\nor unused, partially used batteries will still bounce…",
  "data/reddit-know/r/YouShouldKnow/comments/kwo7va/ysk_you_can_report_spam_texts_to_your_mobile.json": "Why YSK: this can help your mobile provider track down spam and prevent you from\ngetting more spam messages in the future. This works for AT&T, Verizon,\nT-Mobile, Sprint.",
  "data/reddit-know/r/YouShouldKnow/comments/kwxwpw/ysk_a_locksmith_can_make_a_copy_of_your_car_or.json": "I need a new key made for my car and the locksmith is coming later this week. He\nasked me to send him a photo of the front and back of the pass key and he’s\ngoing to machine it before he comes over. I was suspicious that this was a legit\nway to make keys.\n\nWhy YSK according to a busy mobile…",
  "data/reddit-know/r/YouShouldKnow/comments/kwz6mo/ysk_if_you_have_a_specific_question_about_a.json": "Why YSK: If you're struggling to understand something, or are have a very\nspecific STEM or classics related question, find an authority who's published\npapers in that field and send them a brief polite email. Most people are excited\nto talk about their research and will respond, as long as you…",
  "data/reddit-know/r/YouShouldKnow/comments/kx0vbg/ysk_you_should_know_when_looking_at_non_public.json": "Why YSK: This is important for parents who need/want to look into non public\nschools for their child. All non public schools will promise great things (\ndifferent types of therapy, community outings, personalized lessons.) It can be\nhard to determine what is real and what is just them selling you…",
  "data/reddit-know/r/YouShouldKnow/comments/kx6v57/ysk_weary_means_tired_wary_means_concerned_or.json": "Why YSK; I hear this being misused a lot and interpreted strictly they can mean\nthe direct opposite. E.g. 'I'm weary of uncooked chicken' suggests you eat so\nmuch uncooked chicken it's boring.",
  "data/reddit-know/r/YouShouldKnow/comments/kxdam9/ysk_companies_have_spent_millions_on_research_to.json": "Why YSK: This article was eye-opening for me, and helped me feel angry and\ndefensive enough to further change my buying and eating habits. If you feel like\nyou're just struggling from a lack of willpower, you should know how much\neffort, time, energy, and money has gone into trying to get you to buy…",
  "data/reddit-know/r/YouShouldKnow/comments/kxdqwx/ysk_tresemmé_is_currently_facing_a_class_action.json": "Why YSK: TRESemmé hair products have a preservative called DMDM hydantoin, It\nleeches off of formaldehyde when it comes into contact with water. formaldehyde\ncauses harmful reactions and potentially cancer when into contact with skin.\n\nDove and Sauve also contain this…",
  "data/reddit-know/r/YouShouldKnow/comments/kxg5rs/ysk_if_you_have_a_bill_unknowingly_sent_to_a_debt.json": "Why YSK: I found out a bill has been tanking my credit score from 2 years ago\nand had no idea. Called the random collection agency who said I owed $475.\nCalled the original utilities company instead and they said I owed $175 and\nwould resolve all credit issues after that.\n\nIdk how that's legal",
  "data/reddit-know/r/YouShouldKnow/comments/kxl4xq/ysk_internet_archive_wwwarchiveorg_is_a_nonprofit.json": "Why YSK: it’s all free content! And a lot of cool stuff you might not even\nconsider, like the “Wayback machine” and audiobooks/old time radio.\n\nwww.archive.org [http://www.archive.org]\n\nEdit: adding list of all the cool stuff people have posted (Thanks for posting,\nsorry if I don’t credit you):\n\n 1.…",
  "data/reddit-know/r/YouShouldKnow/comments/kxrrz3/ysk_that_you_do_not_have_to_wait_24_hours_to.json": "Not in the US:\n\n\"There is a common myth among the public that you have to wait 24 hours before\nyou report someone missing, but that’s not the case,” (NYPD\n[https://themissingny.nycitynewsservice.com/part-two/nypd-explainer/])\n\nNot in the UK:\n\n\"You do not have to wait 24 hours before contacting the…",
  "data/reddit-know/r/YouShouldKnow/comments/kxtjgu/ysk_if_you_are_indecisive_tell_a_friend_to_choose.json": "Why YSK: this tells you which one you really want more without making you try\nfirst. Just tell your friend after what you were asking them for so they don’t\nget mad at you for asking for their opinion and then ignoring it.",
  "data/reddit-know/r/YouShouldKnow/comments/kxutvr/ysk_you_can_use_anonymous_disposable_email.json": "You can use free services like Temporary Mail [https://temporarymail.com/] to\ncreate an anonymous, disposable email address instantly.\n\nWhy YSK: They're perfect for signing up on websites which require email\nverifications, but you don't want to use your real email on. Depending on the\nservice, the…",
  "data/reddit-know/r/YouShouldKnow/comments/ky184h/ysk_imslp_international_music_score_library.json": "Why YSK: The Petrucci Music Library is one of the most valuable online cultural\nresources for both classical musicians and music-lovers.\n\nhttps://imslp.org/wiki/Main_Page\n\nBeginner musicians often search questionable sites looking for specific\nclassical music pieces that charge you for their sheet…",
  "data/reddit-know/r/YouShouldKnow/comments/ky2gnq/ysk_guys_when_you_are_finished_peeing_apply.json": "Why YSK: So you can have dry pants when you’re finished. The perineum is usually\nwhere the pee stays when your finished and it slowly drips out. I stroke upwards\non the taint towards my jewels and it works every time! Happy peeing!",
  "data/reddit-know/r/YouShouldKnow/comments/kyb1fc/ysk_when_to_use_me_or_i_in_a_sentence_when_youre.json": "Test the sentence out as if you’re only talking about yourself. “Here’s a photo\nof _________ ME or I?” when you take out “grandma and” — it becomes clear that\nin this context, me is the correct choice: “Here’s a photo of grandma and ME.”\nAnother example: “Sarah and ME or I (??) went to the park.…",
  "data/reddit-know/r/YouShouldKnow/comments/kyoh3k/ysk_that_most_companies_produce_products.json": "Why YSK: Worked for a big, expensive fashion brand and it's a well known\nindustry non-secret.\n\nIt's not everything, but a lot of things have been specifically made for outlet\nstores and sales and there are ways companies get around the laws forbidding\nthis.\n\nFor example, they'll make a coat and sell…",
  "data/reddit-know/r/YouShouldKnow/comments/kyqa4p/ysk_if_you_have_good_credit_adding_your_children.json": "Why YSK:\n\nBuilding credit as a young adult can be confusing and take a long time. But if\nyou have good enough credit, adding a child as an authorized user can give them\na big boost for when they apply for loans or credit cards of their own. Most\ncredit card companies allow children over the age of…",
  "data/reddit-know/r/YouShouldKnow/comments/kyqlie/ysk_that_button_batteries_are_extremely_dangerous.json": "Why YSK: Button batteries, if swallowed, can react with the blood and cause\nerosion of the stomach or esophagus. Extremely dangerous if kids get their hands\non them because they may not just pass through their digestive system like coins\nor other small things.",
  "data/reddit-know/r/YouShouldKnow/comments/kyt3yr/ysk_you_can_view_an_online_recipe_without.json": "YSK that if you click the print icon of a recipe page you will get the recipe\nimmediately, instead of scrolling down pointless backstories.\n\nWhy YSK! Because A lot of people always complain about the stupid story when\nlooking for online recipes. Skip the nonsense and click the print button,…",
  "data/reddit-know/r/YouShouldKnow/comments/kywc03/ysk_that_using_the_bathroom_exhaust_fan_to_clear.json": "Why YSK: The colder and dryer the weather, the dryer your house will become once\nyou bring it up to temperature. Most humidifiers only help bring your home to\nthe bare minimum comfortable humidity level, so wasting that shower steam by\nusing an exhaust fan can cause you to get dehydrated and wake up…",
  "data/reddit-know/r/YouShouldKnow/comments/kzd4qy/ysk_when_an_article_says_thing_b_happened_after.json": "E.g., “Man dies after eating Subway sandwich”\n\nIf there is evidence of a connection between the two events, simply using\n“after” is weak writing. If there’s not evidence of a connection, “after” makes\nthe reader think that the two are connected, which is often more interesting\n(and clickbait-y) than…",
  "data/reddit-know/r/YouShouldKnow/comments/kzitwn/ysk_your_work_computer_is_recording_more_that.json": "Here is just some basic info on what is generally trackable by a decent IT\ndepartment.\n\nO365\n\nIf you are working somewhere with more than 100 employees and the organization\nis using O365 chances are they have something like a MS E3 or E5 license for\neach user. You would be surprised what information…",
  "data/reddit-know/r/YouShouldKnow/comments/kzqhpd/ysk_that_you_can_skip_midroll_ads_on_youtube.json": "Why YSK: because ads are annoying. Also this could save a life as i once heard\nsomebody complaing how an emergency CPR video on youtube had a midroll ad they\nhad to watch while they were trying to watch to save a life.\n\nYoutube wont show ads on a video you just watched so if you click on a video…",
  "data/reddit-know/r/YouShouldKnow/comments/kzqus4/ysk_going_to_a_mexican_supermarket_or_in_other.json": "Why YSK: most supermarkets are lame compared to mexican ones, supermercados are\njust so much better! Supermercados have fresh and high quality meat, vegetables\nand fruit; supermercados also have other cool things in them like cheap little\nmexican restaurants that are really good and way better than…",
  "data/reddit-know/r/YouShouldKnow/comments/kzvdcl/ysk_use_your_turn_signal_to_indicate_where_you.json": "Why YSK: Turn signals are your way to communicate your actions and intents to\nother drivers so they know you plan on changing lanes or take a turn. There are\nway too many drivers that start blinking when they're already changing lanes.\nThis leads to dangerous situations and accidents. You need to…",
  "data/reddit-know/r/YouShouldKnow/comments/kzxg1m/ysk_that_if_an_item_in_a_store_says_210_this_does.json": "Why YSK: This is a sales trick that I have fallen for for years. Hopefully I can\nprevent some people from packing their refrigerators full of sprite like I did.\nBe cautious when doing this though, most stores will put \"Must Buy #\" in very\nsmall print on the tag.\n\nEdit: It looks like they only do…",
  "data/reddit-know/r/YouShouldKnow/comments/l067u5/yskyou_can_cancel_your_adobe_subscription_without.json": "“Why YSK:” Because this can save you quite a bit of money and a lot of\nheadaches.\n\nSo those greedy bastards at Adobe tried to charge me 30 bucks for cancelling my\nsubscription, naturally I didn't take well to that, so I got around them by\nchanging my payment method from a debit card to Paypal, then…",
  "data/reddit-know/r/YouShouldKnow/comments/l06q1h/ysk_if_you_add_t_and_the_time_in_seconds_you_can.json": "Why YSK: its incredibly usefull when you want to show something and the video is\nlong or confusing.\n\nIf you do it right the link will take you to the video and the time you\nspecified. To do it just put the time in seconds, like this: ?t=120 at the end\nof the…",
  "data/reddit-know/r/YouShouldKnow/comments/l0gbfg/ysk_about_access_dots_an_app_that_shows_a_dot.json": "Why YSK: Privacy is important, and some apps sneakily use your microphone and\ncamera in the background. With Access dots, a dot will appear on screen when an\napp tries to use your mic or cam, similar to the IOS 14 indicators. It also\nshows an access log when the mic and cam were accessed.\n\n(To make…",
  "data/reddit-know/r/YouShouldKnow/comments/l0j0c4/ysk_if_oncoming_traffic_flashes_their_highbeams.json": "Why YSK: This may prevent you from getting a speeding ticket.\n\nIt is a common trend in the United States for people driving the opposite way on\nthe road who have just passed a police radar trap to flash their headlights to\nwarn cars coming from the opposite direction. A lot of people don’t realize…",
  "data/reddit-know/r/YouShouldKnow/comments/l0nxqa/ysk_the_greyhound_bus_doesnt_actually_have_wifi.json": "Why YSK: I'm riding it right now and there hasn't been WiFi the whole time. It\nsays on their website there is WiFi. It's the only reason I took the Greyhound.\nNever taking it again. I should of just taken the train or flew. Big regret,\nHUGE!\n\nUpdate: I asked driver about wifi. He laughed and said…",
  "data/reddit-know/r/YouShouldKnow/comments/l0o1vu/ysk_that_when_asked_for_your_address_name_phone.json": "Why YSK: I'm posting this because that has always been my answer, and more often\nthan not they look at me like I have three heads, which tells me that it's not a\ncommon response they get. While they may need that for you to get a 5% discount\nnext time you go in, the real reason they want it is to…",
  "data/reddit-know/r/YouShouldKnow/comments/l0pd7u/ysk_that_radon_gas_is_the_second_leading_cause_of.json": "Why YSK:\n\nI didn't even know about radon gas until today, but it's possible I just live\nunder a rock. Anyway, it's not something you can sense yourself, it needs to be\ntested for. I learned that it comes from the soil beneath your home, and is\nestimated to be at high levels in up to 8 million…",
  "data/reddit-know/r/YouShouldKnow/comments/l0pov5/ysk_to_help_people_shift_spending_from_amazon_to.json": "WHY YSK Despite all the calls to “support small business” that you see on TV,\nnone of them actually tell you how to do it in a way that’s actually convenient\nand on par with your normal online shopping experience.…",
  "data/reddit-know/r/YouShouldKnow/comments/l0rw7g/ysk_bumble_just_updated_their_terms_forcing_you.json": "Why YSK: It may affect your rights, and you may be able to opt-out.\n\nhttps://bumble.com/en-us/terms\n\nSection 13: Arbitration Agreement\n\nSubsections 1 and 5: You cannot bring any trial or court cases against them,\nunless it's for intellectual property, which is unlikely to be a claim you would\nmake…",
  "data/reddit-know/r/YouShouldKnow/comments/l0uuh8/ysk_a_good_chunk_of_clothing_put_into_drop_off.json": "Why YSK is because this is a good thing since the material gets a second use\nbefore going into a landfill. And the money from selling them still goes to the\ndrop bin cause. Drop bins will accept garbage/stained clothing too.",
  "data/reddit-know/r/YouShouldKnow/comments/l1jsa4/ysk_breathing_out_slowly_through_your_mouth_while.json": "Why YSK: Cleaning your tounge is a recommended approach to improve your oral\nstate of affairs and can reduce bad breath, etc.\n\nA lot of people seem to be struggeling with their gagging reflex though and\ntherefore tend not to.\n\nBreathing out through your mouth might help.",
  "data/reddit-know/r/YouShouldKnow/comments/l1noww/ysk_what_kind_of_fires_your_fire_extinguishers.json": "Why YSK- because if you have a fire at your house, you could potentially make it\nworse depending on what type of extinguisher you use.\n\nI learned this at a fire safety class at my workplace.\n\nFirst off, there are 3 elements to a fire: Heat, Oxygen, and Fuel. Remove one of\nthose, and the fire will…",
  "data/reddit-know/r/YouShouldKnow/comments/l1pqmo/ysk_for_pronouns_including_it_and_who_the.json": "It’s an increasingly common mistake, but just like “my,” “your,” “his,” “her,”\n“their,” and “our” don’t use an apostrophe, “its” and “whose” are the possessive\nforms of those pronouns. NOT “it’s” or “who’s” which are contractions and mean\n“it is” and “who is” respectively.\n\nWhy YSK: Knowing English…",
  "data/reddit-know/r/YouShouldKnow/comments/l1rujc/ysk_once_your_contract_is_up_with_your.json": "Why YSK:\n\nI've worked for multiple providers in the US, and the process is all the same:\n\nCall in, say you want to cancel, don't even entertain the first department you\nget to, just say you need to cancel and to transfer you to who can cancel your\naccount.\n\nOnce you are on the phone with \"Loyalty\"…",
  "data/reddit-know/r/YouShouldKnow/comments/l1svte/ysk_that_opening_someone_elses_mail_is_a_felony.json": "Why YSK: From abusive parents to nosy neighbors, the stuff you order is YOUR\nSTUFF. If it has your name on it and someone else opens it without your\npermission, even if they don't take anything, you can report them. It sounds\nlike a karenistic thing to do, I know, but privacy is important.\n\nOpening…",
  "data/reddit-know/r/YouShouldKnow/comments/l1trw8/ysk_in_australia_debt_collectors_can_only_get.json": "Why YSK: It’s important for people to know this, as a lot of businesses use the\nthreat of referring debt to a collector for library or parking fees, etc. fact\nis anything less than $150 cannot be legally acted upon by a debt collector, so\nyou will not receive a default or “black mark” on your credit…",
  "data/reddit-know/r/YouShouldKnow/comments/l1y5r4/ysk_how_to_apologise_without_seeking_absolution.json": "Tl;dr: Making excuses deflects blame and is self-defeating when included in an\napology.\n\nWhy YSK: I realised recently how often I and the people around me are making\n'non-apologies' which start with \"I'm sorry...\" and then digress into avoiding\nresponsibility for doing the wrong thing.\n\n\n\nOn the…",
  "data/reddit-know/r/YouShouldKnow/comments/l244mc/ysk_when_youre_waiting_or_bored_you_can_do.json": "Why YSK: They can greatly improve your mental and physical health, and some\npeople don't think they have time for them.\n\nSources:\n\nhttps://www.mayoclinic.org/tests-procedures/meditation/in-depth/meditation/art-20045858\n\nhttps://www.health.harvard.edu/staying-healthy/the-importance-of…",
  "data/reddit-know/r/YouShouldKnow/comments/l25oas/ysk_the_irs_website_has_links_to_100_free_filing.json": "Why YSK: these filing services will not advertise them as to make you use the\npay for services instead, even though you don't need to. There was even a\nlawsuit filed against them for such practices.\n\nThe basic qualification is to be under a certain income range (30-75k a year in\nincome depending on…",
  "data/reddit-know/r/YouShouldKnow/comments/l2a2wz/ysk_people_who_gossip_about_everyone_they_know.json": "This is something that isn't limited to a single gender or age group; people\nacross the world do it.\n\nIf you notice that every time you speak one-on-one with a person, they have\nnegative or salacious things to say about your mutual friends (or even people\nyou've never met!), that person has a…",
  "data/reddit-know/r/YouShouldKnow/comments/l2td8h/ysk_this_quick_tip_if_your_young_child_is.json": "My 3rd grader has been confused about how fractions work. The example we were\ndiscussing mentioned that the denominator was 5 because the shape was divided\ninto 5 equal parts. I asked what part she was confused by and she said that 5 is\nan odd number, so she didn’t understand how it could be divided…",
  "data/reddit-know/r/YouShouldKnow/comments/l310at/ysk_you_can_search_any_song_on_google_by_singing.json": "YSK if you have a song stuck on your brain but you don't know what's called you\ncan go to Google in your phone and press record and then search a song and then\nyou can sing,humm or whistle the song and Google will pick up the pitch in your\nvoice and search songs by pitch of the melody you sing.\n\nWhy…",
  "data/reddit-know/r/YouShouldKnow/comments/l32j8e/ysk_wikipedia_is_not_the_only_service_that_the.json": "Why YSK: Because Wikipedia is an extremely useful tool and I have used it\ncountless times to help study at university and in high school, to say nothing\nof providing education to so many people for free. Though, it has its limits.\nWikipedia is fantastic if you know what you're looking for, but if…",
  "data/reddit-know/r/YouShouldKnow/comments/l3amed/ysk_if_you_find_indian_food_spicy_you_should.json": "Raita is curd mixed with some spices, chopped onions and Boondi(small gram flour\npuff balls)\n\nWhy YSK ?\n\nPeople on Internet always say that they find Indian food too spicy despite them\nliking it then you should definitely order Raita also with your Indian curry\n\nRaita should ease of the hotness of…",
  "data/reddit-know/r/YouShouldKnow/comments/l3ibdf/ysk_how_to_appropriately_respond_or_act_to.json": "Really all that is needed if they verbally tell you is “that’s awesome!” Or “\ngood for you”. Even a neutral response of “oh I gotcha” or “oh I didn’t know\nthat” is fine. Most likely if the person wants to share more about their\nexperience they will take the next move verbally and open up a…",
  "data/reddit-know/r/YouShouldKnow/comments/l3jtdn/ysk_there_is_a_website_to_learn_from_experts_in.json": "bookshlf is a community of experts and enthusiasts in the space, science,\ntechnology and a few other stem topics to encourage learning and discovery.\n\nthey make it super easy to store and create shelves of your favorite internet\ntopic by categories and share to encourage curiosity on new topics to…",
  "data/reddit-know/r/YouShouldKnow/comments/l3reas/ysk_many_states_are_offering_online_classes_for.json": "WHY YSK: I have always wanted to get into hunting but due to work I couldn't\npredictably set aside a whole weekend in advance to take hunters safety. I\nrecently moved to a new state and when looking at the hunting regulations saw\nthat they offered hunters safety online. In addition they offer many…",
  "data/reddit-know/r/YouShouldKnow/comments/l3su5f/ysk_you_are_never_wasting_your_time_when_you_are.json": "Fictional reading in particular is extremely beneficial to all aspects of your\nlife. Humans have been wired with the ability to speak, as we've been doing it\nfor at least 100,000 years in some shape or form. Reading however, has only been\naround for 5,000 years or so. A baby has to be taught how to…",
  "data/reddit-know/r/YouShouldKnow/comments/l41u3l/ysk_that_any_group_that_requires_you_to_keep.json": "Why YSK: The world can be a lonely place. Many people are desperate to find\nsomewhere to belong, and this desperation is often taken advantage of by groups\nthat either have an ulterior motive or just relish fucking shit up. They do this\nby claiming feeling shitty about yourself is just what life is,…",
  "data/reddit-know/r/YouShouldKnow/comments/l46dz2/ysk_just_because_a_company_says_they_wont_sell.json": "Why YSK: Often companies still get some kind of benefit from sharing your\ninformation with third parties, even if they aren’t outright selling it.\n\nBe wary if a company touts “not selling” your information as one of their\nvirtues (e.g. “We will never sell your information.”). It is not an…",
  "data/reddit-know/r/YouShouldKnow/comments/l476pr/ysk_bumping_into_a_new_tax_bracket_will_never.json": "Why YSK: I see people getting this wrong a lot, saying things like \"If I accept\nthis extra job, I'll bump into a new tax bracket and actually make less money\".\nWhen you bump into a new tax bracket, you are taxed at that rate *ONLY* for\nincome within that bracket.\n\nFor example, if you make $15k/year,…",
  "data/reddit-know/r/YouShouldKnow/comments/l4bnek/ysk_that_asking_someone_to_help_you_move_is.json": "Why YSK:\n\nWhen you ask someone to help you move, you should have your house clean and\nfully packed. That way they can help you move boxes and stuff, drive to the new\nplace, help you unload, etc.\n\nThese people are generally not paid and are doing you a huge nightmare of a\nfavor. Making them help you…",
  "data/reddit-know/r/YouShouldKnow/comments/l4dvsl/ysk_that_many_animal_rescue_videos_are_fake.json": "Why YSK: I highly suggest watching these videos here. He explains it much better\nthan me: https://www.youtube.com/watch?v=p7nVntZpJLM\n\nHowever, what I do want to note is that this is becoming more and more dangerous\nfor the animals, and they rely on you to make money! Don't click on videos…",
  "data/reddit-know/r/YouShouldKnow/comments/l4f7uj/ysk_only_ever_loan_the_amount_of_money_that_you.json": "Why YSK: I consider loaned money basically lost money because someone can have\nall the plans in the world to pay you back and then when time comes to collect,\nthey are no where to be seen. I've seen my parents lose tens of thousands of\ndollars loaning money to family members and never receiving a…",
  "data/reddit-know/r/YouShouldKnow/comments/l4jvo3/ysk_taking_on_debt_for_a_potentially.json": "NOTE: This only applies to potentially non-profitable degrees (typically arts\nand sciences). If you're majoring in accounting or dentistry, take that loan.\n\nI'm originally from Hawaii and we have a lot of aspiring Marine Biologists.\nMarine Bio jobs pay pretty well and if you landed one, you'll surly…",
  "data/reddit-know/r/YouShouldKnow/comments/l4psn3/ysk_that_expectation_management_is_a_crucial_but.json": "Why YSK: As a career consultant, I have observed that the vast majority of\nprojects that were unsuccessful failed not because of any technical\nshortcomings, but because of bad expectation management (EM). EM is important\nfor all relationships, not just the client-consultant one.\n\nWhen you are…",
  "data/reddit-know/r/YouShouldKnow/comments/l4rllg/ysk_that_you_can_legally_import_medicines_that.json": "Why YSK: Because promising drugs developed and approved in other countries take\nyears to get approved in the US, years some US patients with serious conditions\nmay not have.\n\nMany people with conditions like ALS, Multiple Sclerosis or certain cancers who\ndon't see improvements or a slowing of the…",
  "data/reddit-know/r/YouShouldKnow/comments/l51zji/ysk_to_never_remove_a_stab_item_from_a_stab_wound.json": "Why YSK: the stab item is actually attached to held into the arteries or veins\nby adhesion due to intermolecular forces between the water in your blood and\ncells and the object. Removing it will cause you to bleed out significantly\nfaster. Leave the item in and attempt to stabilize it with clothe or…",
  "data/reddit-know/r/YouShouldKnow/comments/l5522r/ysk_that_if_your_child_has_a_favorite_toystuffie.json": "It's seen all the time on r/helpmefind [/r/helpmefind]... People looking for a\nstuffed animal that their child can't sleep without. When my best friend gave\nbirth to her child, I bought him a stuffed giraffe. He was in love with it, and\ncouldn't go to bed without it. About 6 months after his birth,…",
  "data/reddit-know/r/YouShouldKnow/comments/l5dqm8/ysk_that_our_time_is_very_precious_and_worthwhile.json": "Why YSK: As we go through life, we are molding ourselves and improving ourselves\nthe entire way. If we spend too much time trying to explain things to people who\nonly want to play devil's advocate, who aren't truly interested in their own\nself-improvement or education, we are wasting our energy. Our…",
  "data/reddit-know/r/YouShouldKnow/comments/l5ircs/ysk_how_to_buy_a_laptop_dont_use_amazon_use_a.json": "Why YSK: Manufacturers and sellers like to use lots of vague keywords that make\nit impossible to search for stuff that matters. Even as a tech literate person I\nnever seem to be able to find what I'm looking for in a laptop on amazon or\nbestbuy.\n\nWith a search engine you can enter what you want and…",
  "data/reddit-know/r/YouShouldKnow/comments/l5k6z3/ysk_about_the_youtube_channel_invisible_people.json": "Why YSK: The story of homelessness is completely different from the side of the\nunhoused than how it is portrayed in mainstream media.\n\nIf you haven't heard of it, this channel is a collection of interviews of\nunhoused people telling their stories of how they became homeless. I don't have\nany…",
  "data/reddit-know/r/YouShouldKnow/comments/l5m4fb/ysk_in_addition_to_wiping_snow_off_all_windows_of.json": "Source 23 years in northern Michigan.\n\nWhy YSK: Wiping off headlights and tail lights are to help others see you, even\nif you don't need the headlights to see. Wiping off the hood prevents snow from\nflying back up at the windshield making it hard to see even with the wipers on\nand wiping it off the…",
  "data/reddit-know/r/YouShouldKnow/comments/l5sfxh/yskbeing_on_salary_does_not_mean_you_are_not_due.json": "Why YSK:\n\nThere is a common misconception in the US that being on salary means you do not\nget overtime pay. However this is inaccurate. While a position must be a\nsalaried position in order to be exempt from overtime, this is not the only\nrequired criteria. Whether or not you are due overtime pay is…",
  "data/reddit-know/r/YouShouldKnow/comments/l5uiem/ysk_putting_things_into_a_recycle_bin_is_not.json": "Why YSK: At best, putting things into the appropriate recycle bin helps to\nseparate them from other trash, but that is where your effort ends. If no\nmanufacturers actually purchase that material and actually add it to their\nprocess, it has not been recycled.\n\nIf you really want to make a difference,…",
  "data/reddit-know/r/YouShouldKnow/comments/l6qqip/ysk_if_you_missed_the_stimulus_paychecks_because.json": "Why YSK: Many of us college kids got screwed out of the stimulus payments\nbecause we were claimed as a dependent in 2019. If you meet the requirements for\na stimulus check and were independent in 2020 you can file for a Recovery Rebate\nCredit on your 2020 tax returns using a 1040/1040-SR tax form.…",
  "data/reddit-know/r/YouShouldKnow/comments/l6uaht/ysk_that_not_all_plastic_items_should_be_put_in.json": "Why YSK: There’s a post about plastic cutlery on r/mildlyinteresting\n[/r/mildlyinteresting] where lots of people are urging others to dispose of it\nin their recycling. This is really bad advice. Plastic cutlery is too small and\nflat for most recycling plants to sort properly and it often gets sorted…",
  "data/reddit-know/r/YouShouldKnow/comments/l74lkw/ysk_robinhood_isnt_the_only_brokerage_that_offers.json": "Why YSK: Many people who joined Robinhood did so to avoid the commission fees\ncharged by other brokerage firms. However, commission-free trading is a much\nmore standard practice than it was a few years ago. While Robinhood may deserve\ncredit for this, it doesn't mean you have to stick with…",
  "data/reddit-know/r/YouShouldKnow/comments/l7ltpm/ysk_do_not_click_on_any_ads_talking_about.json": "Why YSK: Almost every ad I see on youtube is related to GME, WSB, and making\n$5,000 per day in hours. That's not how the real world works and it's too good\nto be true.\n\nThe truth is that this idea of \"getting rich quick\" has been perpetuated and\ngiven a lot of free press these past few weeks.…",
  "data/reddit-know/r/YouShouldKnow/comments/l7v53e/ysk_if_your_face_wash_has_retinol_in_it_dont_get.json": "Why YSK: I just remembered this painful story after watching an ad for\nPro-Active and felt I had to share.\n\nI used to get my eyebrows waxed fairly often. Never had any issues and we made\nsure to go to a place that used organic products. One day I decided to start\nusing Pro-Active on myself. I don’t…",
  "data/reddit-know/r/YouShouldKnow/comments/l80d78/ysk_about_stock_market_manipulation_and_how_the.json": "Why YSK : With the focus of reddit firmly affixed on the stock market currently,\nI think that it is vitally important for everyone to understand the stock market\npractices that the ultra rich used and uses to amass their wealth.\n\nThese practices in question: corporate stock buybacks.\n\nCorporate…",
  "data/reddit-know/r/YouShouldKnow/comments/l839lf/ysk_neckpain_backache_headaches_poor_sleep_and.json": "Why YSK: Most people will grind their teeth at some point and it can cause years\nof horrible nights sleep, random neck pain, back pain, stress and headaches.\n(When you known can save you a fortune on pillows, mattresses and chiropractors)\n\nAs a stopgap solution a simple nightguard can help, but the…",
  "data/reddit-know/r/YouShouldKnow/comments/l84mqg/ysk_google_ads_track_everything_you_search_and.json": "Find your customized results in Ad Settings.\n[https://adssettings.google.com/authenticated] Why YSK: You can opt to turn\nthese trackers off (so Google doesn't keep tabs on your searched terms) or learn\nabout the \"person\" Google has deduced you are. The results of your searches also\ncontribute to…",
  "data/reddit-know/r/YouShouldKnow/comments/l8w73g/ysk_that_if_a_service_dog_without_a_person.json": "Why YSK: because one day, a disabled person might be in serious danger, and this\ninformation could save there life."
}