{
  "data/reddit-ask/r/AskHistorians/comments/lulhms/the_wikipedia_for_bank_robbery_lists_the_first.json": "The wikipedia for 'Bank Robbery' lists the first example as occuring in 1798. Were there really no renaissance/medieval bank robberies? If so, why not?",
  "data/reddit-ask/r/AskHistorians/comments/luqzci/why_is_it_that_despite_almost_2000_years_of.json": "Why is it that despite almost 2000 years of Christianity in England and the English-speaking world, the days of the week all reference pagan gods?",
  "data/reddit-ask/r/AskHistorians/comments/luzzlo/did_the_burning_of_the_alexandria_library_really.json": "Did the burning of the Alexandria library REALLY set back the human race by a thousand years?",
  "data/reddit-ask/r/AskHistorians/comments/lw36by/from_the_nuremberg_trials_onward_many_former.json": "From the Nuremberg trials onward, many former Nazis were tried and found responsible for extermination of Jews, Poles, Jehovah's Witnesses, and other groups. But has anyone ever been brought to justice specifically for the murders of thousands of homosexuals by the Third Reich?",
  "data/reddit-ask/r/AskHistorians/comments/lweh5g/how_wealthy_was_the_average_conquistador_that.json": "How wealthy was the average conquistador that took part in the subjugation of the Aztec and Inca empires? How did they spend their newfound wealth? What would they usually do upon returning to Spain?",
  "data/reddit-ask/r/AskHistorians/comments/lwkb10/cocaine_went_from_a_common_ingredient_in.json": "Cocaine went from a common ingredient in beverages, cigars, lozenges (etc.) to an illegal drug generally partaken of by the wealthy. What led to this shift? Was it a long process? Did the public call for it or resist it? Just curious about this seemingly major shift.",
  "data/reddit-ask/r/AskHistorians/comments/lwwzi0/hindu_jewish_and_zoroastrian_texts_and_possibly.json": "Hindu, Jewish and Zoroastrian texts (and possibly others) claim that ancient peoples lived far longer lives than contemporary peoples. What was the cause of this belief among various groups?",
  "data/reddit-ask/r/AskHistorians/comments/lxfnj5/why_are_ancient_and_medieval_recipes_so_vague.json": "Why are ancient and medieval recipes so vague? Often lacking amounts, instructions, or times, they seem quite vague. Were they intended to be some sort of inspiration, rather than direct instructions?",
  "data/reddit-ask/r/AskHistorians/comments/lyc8yi/did_people_smoke_pot_in_the_american_old_west.json": "Did people smoke pot in the American Old West?",
  "data/reddit-ask/r/AskHistorians/comments/lyfb5n/nelson_mandela_was_arrested_in_1962_and_served_27.json": "Nelson Mandela was arrested in 1962 and served 27 years in prison, at times only being able to receive one letter every six months. How did he become internationally famous by the time of his release from prison?",
  "data/reddit-ask/r/AskHistorians/comments/lypov3/in_russian_golden_age_literature_such_as_tolstoy.json": "In Russian golden age literature, such as Tolstoy, a prince or a princess often features in the plot, being a major or a minor character, however it is evident that they are not part of the immediate royal family and sometimes have financial difficulties. Who were these princes and princesses?",
  "data/reddit-ask/r/AskHistorians/comments/lytefi/if_the_british_didnt_intercept_the_zimmerman.json": "If the British didn’t intercept the Zimmerman Telegraph and the Mexicans received it, is there any possibility they would have attacked the US and joined the Central Powers?",
  "data/reddit-ask/r/AskHistorians/comments/lyuk8u/how_would_someone_prove_they_graduated_from.json": "How would someone prove they graduated from university in the 18th and 19th century in Europe? Would France acknowledge a British or Russian diploma?",
  "data/reddit-ask/r/AskHistorians/comments/lz3rj1/why_did_the_ussr_build_such_grandiose_designs_and.json": "Why did the USSR build such grandiose designs and ornate decorations in the Moscow Metro stations as opposed to the usual bland brutalism of Soviet architecture?",
  "data/reddit-ask/r/AskHistorians/comments/lz6xw2/in_downton_abbey_theres_a_scene_during_a_ww1.json": "In Downton Abbey, there's a scene during a WW1 trench fight where a character sparks a cigarette lighter and holds his hand above the trench as a target to purposely sustain an injury and be sent home. Was this common practice, and would the enemy know what they were doing?",
  "data/reddit-ask/r/AskHistorians/comments/lzjpva/an_estimated_7095_of_polio_cases_were.json": "An estimated 70-95% of polio cases were asymptomatic. Was this understood by the general public during polio outbreaks? Were asymptomatic people quarantined? Did people dismiss polio as \"most cases have no symptoms\"?",
  "data/reddit-ask/r/AskHistorians/comments/lzl5o9/statues_for_the_renaissance_time_have_such.json": "Statues for the Renaissance time have such amazing muscular detail. Was weight training a common part of life for the models to get this much detail? Or was it the sculptors' exaggeration that made the statues have the structure that they do? When did weight training become a part of life?",
  "data/reddit-ask/r/AskHistorians/comments/lzrz1w/why_the_greek_fire_couldnt_be_replicated_by_any.json": "Why the “Greek fire” couldn’t be replicated by any other nation other than the Byzantine Empire and is still a mystery today?",
  "data/reddit-ask/r/AskHistorians/comments/lzv4e7/tiny_greek_city_states_with_1020k_in_population.json": "Tiny Greek city states with 10-20k in population managed to build grand temples, bath houses, walls, and other monumental-scale buildings. Was this level of architectural achievement at low population levels common in the ancient world?",
  "data/reddit-ask/r/AskHistorians/comments/lzxr8d/in_the_1950s_section_of_wandavision_no_one_is.json": "In the 1950’s section of WandaVision, no one is bothered by Wanda’s (fictional) Sokovian nationality; while this episode was based on sitcom logic, how would Suburban Americans actually have reacted to an Eastern European immigrant?",
  "data/reddit-ask/r/AskHistorians/comments/m0cvww/mexico_was_ruled_by_the_same_party_the_pri_for.json": "Mexico was ruled by the same party, the PRI, for over 70 years since the end of the mexican civil war until the year 2000. Including the entirety of the cold war. Did that present a concern to the US at some point?",
  "data/reddit-ask/r/AskHistorians/comments/m0cwsk/margaret_thatcher_criticized_the_gov_of_argentina.json": "Margaret Thatcher criticized the gov of Argentina for being a military junta during the Falklands War, yet she received support from Chile, which was also being run by a military dictatorship at the time. How did that work?",
  "data/reddit-ask/r/AskHistorians/comments/m0hjmk/in_the_immediate_aftermath_of_ww2_were_the.json": "In the immediate aftermath of WW2 were the American soldiers that fought in Europe viewed or treated differently than those that fought in the Pacific?",
  "data/reddit-ask/r/AskHistorians/comments/m0n52f/in_1537_the_pope_banned_the_enslavement_of_native.json": "In 1537 the Pope banned the enslavement of Native Americans and any unknown-yet people. Did this Papal Bull actually have any effect, and if not, why not?",
  "data/reddit-ask/r/AskHistorians/comments/m0scff/can_someone_explain_why_this_sub_was_temporarily.json": "Can someone explain why this sub was temporarily banned today? What made some dumbass admin decide to terminate an active sub with 1.3 million users?",
  "data/reddit-ask/r/AskHistorians/comments/m16dcr/geopolitical_debates_in_the_19th_century_were.json": "Geopolitical debates in the 19th century were often framed around “questions” (the Irish Question, the German Question, the Eastern Question, etc.). What is the origin of this terminology?",
  "data/reddit-ask/r/AskHistorians/comments/m1c39k/howwhen_did_the_color_red_become_a_recognized.json": "How/when did the color red become a recognized symbol of \"no/negative\" and green a symbol of \"yes/positive\"?",
  "data/reddit-ask/r/AskHistorians/comments/m1p57y/in_the_original_star_wars_a_new_hope_obiwan.json": "In the original Star Wars: A New Hope, Obi-Wan Kenobi instructs R2-D2 to connect to the Imperial network to gain access to the whole system. Did the concept of an interconnected vast computer network exist in 1977? What were the largest government and corporate computer systems used for in 1977?",
  "data/reddit-ask/r/AskHistorians/comments/m1zt8s/in_1792_free_people_of_colour_in_france_were.json": "In 1792, free people of colour in France were given equal rights to their white counterparts. Who were these people? What was life like for the typical French (or European more broadly) POC at this time?",
  "data/reddit-ask/r/AskHistorians/comments/m2fb93/haile_selassie_was_an_incredibly_controversial.json": "Haile Selassie was an incredibly controversial figure, seen by some as a cruel tyrant and by others as a national hero. How do today’s historians evaluate his reign?",
  "data/reddit-ask/r/AskHistorians/comments/m2z8d8/the_original_ipod_was_released_in_2001_does_that.json": "The original iPod was released in 2001, does that mean the 20 year rule now allows the discussion of historical impacts of the iPod?",
  "data/reddit-ask/r/AskHistorians/comments/m3tg3n/what_did_tolkien_think_of_the_fact_that_led.json": "What did Tolkien think of the fact that Led Zeppelin wrote several songs about the Lord of the Rings? Did he know about (or like) any of them?",
  "data/reddit-ask/r/AskHistorians/comments/m43xht/now_im_aware_of_how_racist_woodrow_wilson_was_but.json": "Now I'm aware of how racist Woodrow Wilson was but how racially tolerant or open minded were American Presidents/politicians around the turn of the century (late 19th/early 20th century)? Did any seek African-American voters? Were any quite simply, \"a friend of the Black community\"?",
  "data/reddit-ask/r/AskHistorians/comments/m45ccm/francesco_morozini_doge_of_venice_16191694_had_a.json": "Francesco Morozini, Doge of Venice (1619-1694), had a Bible with a hidden gun in it. He could fire by pulling on the bookmark. Were clandestine weapons more widespread than one eccentric doge's Bible gun? Was there good reason for powerful people in the 17th century to have weapons like this?",
  "data/reddit-ask/r/AskHistorians/comments/m4hwoh/in_feudal_japan_did_people_see_themselves_as_part.json": "In Feudal Japan, did people see themselves as part of an overarching Japanese nation headed by the Emperor (or Shogun) or did they primarily see themselves as subjects of the local daimyo, seeing neighboring (Japanese) people as foreigners?",
  "data/reddit-ask/r/AskHistorians/comments/m4k731/how_knowledgeable_would_the_romans_greeks.json": "How knowledgeable would the Romans, Greeks, Carthagians, etc. have been about the geography of Sub-Saharan Africa? Did they know about coastal west Africa, the Congo rainforest, or the African Great lakes? What about even further south?",
  "data/reddit-ask/r/AskHistorians/comments/m4vhgf/wikipedia_states_that_there_there_were_thousands.json": "Wikipedia states that there there were thousands of Black Africans in Portugal in the 15th century and the population of Medieval Lisbon then was 10% Black. What happened to them thereafter, and do their descendants still live in Portugal today?",
  "data/reddit-ask/r/AskHistorians/comments/m5nao0/why_was_julius_caesar_assassinated_on_the_ides_of.json": "Why was Julius Caesar assassinated on the Ides of March specifically? Did the conspirators pick it for any symbolic or religious reason, or was it just the day that worked best for everyone?",
  "data/reddit-ask/r/AskHistorians/comments/m66718/in_django_unchained_the_house_slave_stephen.json": "In Django Unchained, the house slave Stephen (Samuel L. Jackson) is portrayed as essentially exerting a lot of influence over his master Candie by stroking his ego. We are also shown that he has a lot of affection for him. Is this accurate? Are there actual historical examples of this?",
  "data/reddit-ask/r/AskHistorians/comments/m7u6dl/los_angeles_has_a_large_armenian_american.json": "Los Angeles has a large Armenian American population. Why Los Angeles, rather than an East Coast city? And how did there come to be such a sizeable Armenian population in the USA compared to Azeri or Georgian?",
  "data/reddit-ask/r/AskHistorians/comments/m80a5u/when_pliny_the_elder_said_that_asbestos_also.json": "When Pliny The Elder said that Asbestos \"also resists all magic potions, especially those concocted by the Magi,\" what did he have in mind?",
  "data/reddit-ask/r/AskHistorians/comments/m86q5a/how_did_glory_holes_evolve_and_when_were_they.json": "How did glory holes evolve and when were they most popular?",
  "data/reddit-ask/r/AskHistorians/comments/m8s9ch/do_we_know_of_any_specific_instances_where_a.json": "Do we know of any specific instances where a member of the Hitler Youth turned in their own parents to the Nazis for \"illegal\" activity? If so, do we have any post-war evidence of these children reflecting on what they did?",
  "data/reddit-ask/r/AskHistorians/comments/m989y1/romans_without_male_heirs_adopted_grown_men_to.json": "Romans without male heirs adopted grown men to keep their lines going. But what about the adoption of women? Do we have any accounts of women being adopted? Was this not done because there was no political value?",
  "data/reddit-ask/r/AskHistorians/comments/mbejm7/in_1005_high_king_brian_boru_of_ireland_was.json": "In 1005, High King Brian Boru of Ireland was referred to in the Book of Armagh as \"Imperator Scottorum\" - Emperor of the Gaels\". Was it common for kings to proclaim themselves \"Emperor of [cultural group]\" during this period? What would it have taken for Boru's claim to have been recognised?",
  "data/reddit-ask/r/AskHistorians/comments/mc7q6z/how_did_california_and_texas_became_so_populated.json": "How did California and Texas became so populated as American territories when they where so sparsely populated when they belonged to Mexico and Spain?",
  "data/reddit-ask/r/AskHistorians/comments/mc82oy/during_a_us_senate_meeting_today_a_senator_said.json": "During a US Senate meeting today, a Senator said that people used to have to guess the number of jellybeans in a jar to vote. Was this an actual voting test? Was it widespread?",
  "data/reddit-ask/r/AskHistorians/comments/mcav4n/were_the_viet_cong_and_the_communist_party_of.json": "Were the Viet Cong and the Communist Party of Vietnam supported by the majority of the Vietnamese (in South and North Vietnam respectively)? How widespread was support for the leadership of the South Vietnam in comparison?",
  "data/reddit-ask/r/AskHistorians/comments/mcx3n3/the_hindenburg_disaster_was_only_the.json": "The Hindenburg Disaster was 'only' the fifth-deadliest airship crash, and the last one before WW2, yet seems to have made a far greater impression on (Western) popular consciousness than earlier crashes like the Akron or the Dixmude. Why has the Hindenburg managed to be the best-remembered?",
  "data/reddit-ask/r/AskHistorians/comments/md1v64/in_the_70s90s_japans_left_wing_movement_was_one.json": "In the 70s-90s, Japan's left wing movement was one of Asia's most radical. During this period, Japanese left-wing extremists hijacked 3 planes, raided 3 embassies, massacred 24 people at Lod airport, and fired rockets at imperial residences. What can explain this level of radicalism, and why Japan?",
  "data/reddit-ask/r/AskHistorians/comments/md8u5q/in_the_1973_film_serpico_nypd_narcotics_officers.json": "In the 1973 film Serpico, NYPD narcotics officers are depicted attending a special lecture where they are given marijuana cigarettes to observe the affects of the drug in themselves: did such courses actually exist in major metropolitan police departments in the United States in the 1960s/70s?",
  "data/reddit-ask/r/AskHistorians/comments/mdg408/i_was_looking_at_the_floor_plans_to_old_sears.json": "I was looking at the floor plans to old Sears Homes from the early 1900s. At one point they go from naming things Parlors and Chambers to Living Rooms and Bedrooms. What caused this change? Was this a cultural thing? Why did we go from having parlors/chambers to living rooms and bedrooms?",
  "data/reddit-ask/r/AskHistorians/comments/mdpwoq/how_did_the_isle_of_man_end_up_as_a_crown.json": "How did the Isle of Man end up as a crown dependency while other large islands in the British Isles like Anglesey and the Isle of Wight are fully part of the UK?",
  "data/reddit-ask/r/AskHistorians/comments/me9vcm/after_watching_the_terror_tv_show_recently_i_was.json": "After watching \"The Terror\" TV show recently, I was left wondering - what motivated people to join the Royal Navy to go on such long and dangerous missions, and how did officers maintain the motivation of their crews over multiple winters stuck in the ice?",
  "data/reddit-ask/r/AskHistorians/comments/medsnw/you_bargain_for_what_youre_trying_to_buy_at_the.json": "You bargain for what you're trying to buy at the local markets in much of Asia. In the west, this is virtually unheard of except for special items, like cars. Was bargaining once the norm in the US and Europe? When and why did it fade away?",
  "data/reddit-ask/r/AskHistorians/comments/mees4j/when_coco_chanel_made_her_comeback_in_the_50s.json": "When Coco Chanel made her comeback in the 50s, would the average French person know anything about her Nazi connections? Would someone from the Resistance be more likely to know? What about someone in Tahiti or French Algeria?",
  "data/reddit-ask/r/AskHistorians/comments/mg8mve/rodrigo_diaz_aka_el_cid_is_known_as_a.json": "Rodrigo Diaz aka El Cid is known as a Christian-Spanish folk hero and subject of epic poetry of a pious, chivalrous crusader, but he also served as a mercenary for Berber and Muslim/Moorish forces. How did the Islamic literature traditions treat him?",
  "data/reddit-ask/r/AskHistorians/comments/mghwx3/for_centuries_eels_were_a_major_and_iconic_part.json": "For centuries eels were a major and iconic part of poorer Londoners' diets. What were the contemporary views of eels for eating over that time and what was the reaction to their precipitous decline?",
  "data/reddit-ask/r/AskHistorians/comments/mglcd7/how_did_the_default_ding_dong_descending_major.json": "How did the default \"ding dong\" (descending major third) doorbell sound develop and become so commonplace?",
  "data/reddit-ask/r/AskHistorians/comments/mhcsun/the_ussr_tried_to_join_nato_in_1954_which_was.json": "The USSR tried to join NATO in 1954, which was like trying to join an alliance formed to oppose them. Why did they want in, and were they surprised to be rejected?",
  "data/reddit-ask/r/AskHistorians/comments/mhgie2/a_major_method_of_advancement_in_many_rpgs_is.json": "A major method of advancement in many RPGs is loot from slain foes. Would a medieval foot soldier or levied peasant have been able to keep or use any weapons he might loot if he happened to manage to kill a knight or man-at-arms? Did any ordinary soldiers get rich from looted gear?",
  "data/reddit-ask/r/AskReddit/comments/luakt8/what_nonsexual_thing_someone_unknowingly_did_that.json": "What non-sexual thing someone unknowingly did that made your heart flutter?",
  "data/reddit-ask/r/AskReddit/comments/lui86v/whose_name_was_dragged_through_the_mud_so_much_we.json": "Whose name was dragged through the mud so much we forget they were a good/innocent person?",
  "data/reddit-ask/r/AskReddit/comments/lul60a/gamers_who_have_put_thousands_of_hours_into_many.json": "Gamers who have put thousands of hours into many different games; what is THE game that made you 'blank stare' at the credits after you beat the story?",
  "data/reddit-ask/r/AskReddit/comments/lum9el/what_one_weird_trick_actually_works.json": "What 'one weird trick' actually works?",
  "data/reddit-ask/r/AskReddit/comments/lv17nw/people_of_reddit_what_do_you_remember_being_the.json": "People of Reddit. What do you remember being the WORST thing about being a kid?",
  "data/reddit-ask/r/AskReddit/comments/lv47wo/before_hitler_who_was_the_ultimate_evil_figure.json": "Before Hitler, who was the ultimate evil figure that the whole world collectively would agree upon?",
  "data/reddit-ask/r/AskReddit/comments/lv4862/depressedsuicidal_people_of_reddit_what_keeps_you.json": "Depressed/suicidal people of reddit, what keeps you going and what would you recommend doing if those thoughts come to your mind?",
  "data/reddit-ask/r/AskReddit/comments/lv5tzk/what_is_something_that_doesnt_deserve_its_bad.json": "What is something that doesn't deserve its bad reputation?",
  "data/reddit-ask/r/AskReddit/comments/lv6q6j/what_are_some_movies_that_are_so_fucking_goodthat.json": "What are some movies that are so fucking good,that not many people know about?",
  "data/reddit-ask/r/AskReddit/comments/lvbv6v/for_five_minutes_you_get_transported_30_years.json": "For five minutes you get transported 30 years into the future, you sit in front of a computer, what information to you look up?",
  "data/reddit-ask/r/AskReddit/comments/lverhb/what_is_you_favorite_polite_way_to_tell_someone.json": "What is you favorite \"polite\" way to tell someone you don't care about what they are saying?",
  "data/reddit-ask/r/AskReddit/comments/lvg3pd/people_who_dont_believe_the_bible_is_literal_but.json": "People who don’t believe the Bible is literal but still believe in the Bible, where do you draw the line on what is real and what isn’t?",
  "data/reddit-ask/r/AskReddit/comments/lvn066/what_movie_is_so_disturbing_you_would_never_watch.json": "What movie is so disturbing, you would never watch it again?",
  "data/reddit-ask/r/AskReddit/comments/lvo5ek/what_movie_lines_are_pure_gold.json": "What movie lines are pure gold?",
  "data/reddit-ask/r/AskReddit/comments/lvte0v/what_are_american_things_that_americans_dont.json": "What are American things that Americans don’t realize are just in America?",
  "data/reddit-ask/r/AskReddit/comments/lvtluz/what_is_the_creepiestmost_disturbing_internet.json": "What is the creepiest/most disturbing internet rabbit hole you’ve gone down, and why?",
  "data/reddit-ask/r/AskReddit/comments/lw2g2z/doctors_of_reddit_what_was_the_worse_thing_youve.json": "Doctors of Reddit, what was the worse thing you've seen for a patient that another Doctor overlooked?",
  "data/reddit-ask/r/AskReddit/comments/lw3h6f/if_its_humane_to_put_an_animal_to_sleep_when_its.json": "If it's humane to put an animal to sleep when it's suffering why isn't it equally compassionate to do the same for people when they are suffering greatly with no hope of recovery?",
  "data/reddit-ask/r/AskReddit/comments/lw3u0b/serioushave_you_ever_felt_like_someone_only_kept.json": "[Serious]Have you ever felt like someone only kept you around to make them feel better about themselves? What made you realize it?",
  "data/reddit-ask/r/AskReddit/comments/lwadx4/antibragging_time_how_badly_have_you_gotten_your.json": "Anti-bragging time! How badly have you gotten your ass kicked?",
  "data/reddit-ask/r/AskReddit/comments/lwejx3/what_are_your_thoughts_on_eating_chunks_of.json": "What are your thoughts on eating chunks of parmesan cheese?",
  "data/reddit-ask/r/AskReddit/comments/lwio44/if_you_had_no_responsibilities_and_unlimited.json": "If you had no responsibilities and unlimited money, what would be the first thing you do?",
  "data/reddit-ask/r/AskReddit/comments/lwjlif/what_was_the_dumbest_rule_your_school_enforced.json": "What was the dumbest rule your school enforced?",
  "data/reddit-ask/r/AskReddit/comments/lwkezn/what_normally_not_breakfast_foods_do_you_like_to.json": "What normally “not breakfast” foods do you like to eat for breakfast?",
  "data/reddit-ask/r/AskReddit/comments/lwmy96/archaeologists_looking_at_our_trash_dumps_will.json": "Archaeologists looking at our trash dumps will find a layer of masks dated to 2020-2021. What other times created their own unique trash layers?",
  "data/reddit-ask/r/AskReddit/comments/lws35v/how_do_you_feel_about_the_fact_that_askreddit.json": "How do you feel about the fact that AskReddit sounds like Ass Credit?",
  "data/reddit-ask/r/AskReddit/comments/lwstap/elon_musk_is_now_worth_197_billion_how_do_we_sell.json": "Elon Musk is now worth $197 billion, how do we sell him?",
  "data/reddit-ask/r/AskReddit/comments/lwu4bd/what_are_dumb_things_only_redditors_say.json": "What are dumb things only Redditors say?",
  "data/reddit-ask/r/AskReddit/comments/lwvtnl/what_stupid_joke_do_you_love.json": "What stupid joke do you love?",
  "data/reddit-ask/r/AskReddit/comments/lww0ei/do_the_people_in_your_dreams_wear_masks_when_did.json": "Do the people in your dreams wear masks? When did they start?",
  "data/reddit-ask/r/AskReddit/comments/lww27k/who_was_the_scariest_person_youve_ever_met.json": "Who was the scariest person you've ever met?",
  "data/reddit-ask/r/AskReddit/comments/lx1ks7/glasses_people_of_reddit_what_is_the_worst_thing.json": "Glasses people of Reddit, what is the worst thing that’s happened to your glasses?",
  "data/reddit-ask/r/AskReddit/comments/lx492p/what_is_your_oh_shit_ive_got_to_get_the_hell.json": "What is your “Oh shit, I’ve got to get the hell outta here right now!” story?",
  "data/reddit-ask/r/AskReddit/comments/lx4nd4/teachers_of_reddit_what_is_the_strangest_thing.json": "Teacher's of Reddit, what is the strangest thing one of your students has done in your classroom?",
  "data/reddit-ask/r/AskReddit/comments/lx4zml/what_were_the_1990s_like.json": "What were the 1990's like?",
  "data/reddit-ask/r/AskReddit/comments/lx8rnp/what_song_will_you_always_relate_to_a_movie.json": "What song will you always relate to a movie?",
  "data/reddit-ask/r/AskReddit/comments/lxcfo7/have_you_ever_met_a_really_intelligent_person_who.json": "Have you ever met a really intelligent person who didn’t really know how smart they were? What was your experience with them?",
  "data/reddit-ask/r/AskReddit/comments/lxcrrp/you_are_able_to_pull_one_fictional_object_into.json": "You are able to pull one fictional object, into the real world, what do you ask for?",
  "data/reddit-ask/r/AskReddit/comments/lxejj7/whats_a_current_trend_you_cant_stand.json": "What’s a current trend you can’t stand?",
  "data/reddit-ask/r/AskReddit/comments/lxhdge/how_would_you_react_if_a_meteor_was_coming.json": "How would you react if a meteor was coming towards earth, going to kill everyone and having one week to live?",
  "data/reddit-ask/r/AskReddit/comments/lxiv19/what_is_the_scariest_thing_a_child_has_said_to_you.json": "What is the scariest thing a child has said to you?",
  "data/reddit-ask/r/AskReddit/comments/lxl807/how_would_you_be_expelled_from_willy_wonkas.json": "How would you be expelled from Willy Wonka's chocolate factory?",
  "data/reddit-ask/r/AskReddit/comments/lxmvqz/which_cultural_norms_have_been_around_for_far_too.json": "Which cultural norms have been around for FAR too long?",
  "data/reddit-ask/r/AskReddit/comments/lxn78o/what_do_you_guys_think_happens_when_we_die.json": "What do you guys think happens when we die?",
  "data/reddit-ask/r/AskReddit/comments/lxp8kj/whats_the_most_bullshit_excuse_you_ever_heard.json": "What’s the most bullshit excuse you ever heard someone say?",
  "data/reddit-ask/r/AskReddit/comments/lxpsdz/if_you_were_a_mad_scientist_with_absolutely_no.json": "If you were a mad scientist with absolutely no moral or ethical dilemmas that might trouble you, what would be an experiment you’d like to conduct to better understand humanity?",
  "data/reddit-ask/r/AskReddit/comments/lxrfl6/if_you_could_end_all_suffering_in_the_world.json": "If you could end all suffering in the world (hunger, war, disease, bigotry, etc.) but you had to die, would you do it? Why or why not?",
  "data/reddit-ask/r/AskReddit/comments/ly229e/if_you_have_ever_contemplated_suicide_why_and.json": "If you have ever contemplated suicide, why? And what saved you from going through with it?",
  "data/reddit-ask/r/AskReddit/comments/ly3972/what_is_a_song_you_cannot_listen_to_for_an.json": "What is a song you cannot listen to for an emotional reason?",
  "data/reddit-ask/r/AskReddit/comments/lyaskw/whats_the_worst_way_youve_been_embarrassed_by_a.json": "What’s the worst way you’ve been embarrassed by a child?",
  "data/reddit-ask/r/AskReddit/comments/lyc796/what_hobby_saved_you_from_your_depression.json": "What hobby saved you from your depression?",
  "data/reddit-ask/r/AskReddit/comments/lycqoc/the_last_thing_you_googled_is_what_kills_you_so.json": "The last thing you Googled is what kills you. So, how do you die?",
  "data/reddit-ask/r/AskReddit/comments/lycqqo/whats_the_best_porn_logic_you_have_ever_seen.json": "What’s the best “porn logic” you have ever seen?",
  "data/reddit-ask/r/AskReddit/comments/lycxyx/what_are_some_examples_of_its_cheaper_to_be_rich.json": "What are some examples of “it’s cheaper to be rich than poor”?",
  "data/reddit-ask/r/AskReddit/comments/lydtps/its_a_zombie_apocalypse_and_youre_10_miles_away.json": "It's a zombie apocalypse and you're 10 miles away from the nearest safe zone. What song do you play whilst you fight your way through the hordes of the undead?",
  "data/reddit-ask/r/AskReddit/comments/lygd8e/whats_a_commercial_that_is_so_awful_it_works_the.json": "What's a commercial that is so awful, it works the opposite on you and you'd NEVER buy their product?",
  "data/reddit-ask/r/AskReddit/comments/lyhz9x/college_professors_of_reddit_whats_your_im.json": "College professors of Reddit, what’s your “I’m surprised you made it out of high school” story?",
  "data/reddit-ask/r/AskReddit/comments/lypi3v/serious_whats_something_creepy_that_has_happened.json": "[Serious] What’s something creepy that has happened to you that you still occasionally think about to this day?",
  "data/reddit-ask/r/AskReddit/comments/lyrv2j/whats_a_random_act_of_kindness_that_stuck_with_you.json": "What’s a random act of kindness that stuck with you?",
  "data/reddit-ask/r/AskReddit/comments/lyx3l4/dudes_who_moan_when_shitting_or_pissing_in_a.json": "Dudes who moan when shitting or pissing in a public toilet, why?",
  "data/reddit-ask/r/AskReddit/comments/lyxdg0/nsfw_how_often_do_you_secretly_feel_the_urge_to.json": "[NSFW] How often do you secretly feel the urge to kiss, caress or just boink a random person in your day to day life?",
  "data/reddit-ask/r/AskReddit/comments/lz1bsb/what_have_you_accidentally_trained_your_pet_to_do.json": "What have you accidentally trained your pet to do?",
  "data/reddit-ask/r/AskReddit/comments/lz2bgd/what_was_your_wtf_how_do_people_not_know_this.json": "What was your \"Wtf, how do people NOT know this?\" moment?",
  "data/reddit-ask/r/AskReddit/comments/lz2hej/people_who_snooze_their_morning_alarms_more_than.json": "People who snooze their morning alarms more than once every single morning, why not just set a later alarm?",
  "data/reddit-ask/r/AskReddit/comments/lz30ok/you_are_in_a_nuclear_bunker_with_one_person_you.json": "You are in a nuclear bunker with one person you have no connections and you are the last two people alive In the world, what is the worst thing you can say?",
  "data/reddit-ask/r/AskReddit/comments/lz3kia/whats_way_more_sadistic_than_it_seems.json": "What's way more sadistic than it seems?",
  "data/reddit-ask/r/AskReddit/comments/lz8vgo/people_who_wake_up_in_the_morning_without_a.json": "People who wake up in the morning without a single snooze, what's your secret?",
  "data/reddit-ask/r/AskReddit/comments/lza7hs/whats_a_scientific_fact_that_creeps_you_out.json": "What's a scientific fact that creeps you out?",
  "data/reddit-ask/r/AskReddit/comments/lzbc0q/has_anyone_with_severely_low_selfesteem_ever.json": "Has anyone with severely low self-esteem ever managed to overcome it? What happened?",
  "data/reddit-ask/r/AskReddit/comments/lzdkxs/how_do_you_not_get_depressed_when_you_feel_like.json": "How do you not get depressed when you feel like you wasted so many years of what could have been a good life?",
  "data/reddit-ask/r/AskReddit/comments/lzft5w/if_you_were_dr_doofenshmirtz_what_kind_of_inator.json": "If you were Dr. Doofenshmirtz, what kind of -inator would you invent?",
  "data/reddit-ask/r/AskReddit/comments/lzga8o/to_the_grubhub_doordash_or_any_other_food.json": "To the Grubhub, Doordash, or any other food delivery employees, what is the strangest scenario you have had with an order?",
  "data/reddit-ask/r/AskReddit/comments/lzjahn/911_dispatchers_what_has_been_your_most.json": "911 dispatchers what has been your most creepy/unnerving call?",
  "data/reddit-ask/r/AskReddit/comments/lzkbfu/how_is_the_human_asshole_still_hairy_when_other.json": "How is the human asshole still hairy when other animals with fur got those bare asses?",
  "data/reddit-ask/r/AskReddit/comments/lzndft/for_people_who_claim_common_masks_do_not_work_why.json": "For people who claim common masks do not work, why push towards wearing no masks rather than pushing towards better masks?",
  "data/reddit-ask/r/AskReddit/comments/lznwq2/what_is_that_one_thing_your_parents_taught_you.json": "What is that one thing your parents taught you, that later turned to be totally wrong?",
  "data/reddit-ask/r/AskReddit/comments/lzr4ze/whats_something_you_should_always_keep_in_your_car.json": "What's something you should ALWAYS keep in your car?",
  "data/reddit-ask/r/AskReddit/comments/lzrdcr/what_are_the_unwritten_laws_of_reddit.json": "What are the unwritten laws of Reddit?",
  "data/reddit-ask/r/AskReddit/comments/lzs790/what_irritates_you_way_more_than_it_should.json": "What irritates you way more than it should?",
  "data/reddit-ask/r/AskReddit/comments/lzwlko/how_do_ugly_or_fat_actors_actually_feel_about.json": "How do \"ugly\" or \"fat\" actors actually feel about being cast to play known ugly or fat characters?",
  "data/reddit-ask/r/AskReddit/comments/lzybdj/reddit_what_is_the_most_cliche_message_youre_just.json": "Reddit, what is the most cliche message you’re just sick of hearing?",
  "data/reddit-ask/r/AskReddit/comments/m0069b/what_is_the_best_response_to_why_are_you_so_quiet.json": "What is the best response to \"Why Are You So Quiet\" ?",
  "data/reddit-ask/r/AskReddit/comments/m00s4f/what_are_some_less_known_darker_facts_about.json": "What are some less known, darker facts about beloved countries?",
  "data/reddit-ask/r/AskReddit/comments/m02sdn/bilingual_speakers_of_reddit_whats_one_scene_in_a.json": "Bilingual speakers of reddit, what’s one scene in a foreign show or movie, that the subtitles say something wildly different from what the character actually says?",
  "data/reddit-ask/r/AskReddit/comments/m03zx2/what_is_your_pettiest_pet_peeve.json": "What is your pettiest pet peeve?",
  "data/reddit-ask/r/AskReddit/comments/m04kcs/what_do_girls_want_guys_to_say_during_sex.json": "What do girls want guys to say during sex?",
  "data/reddit-ask/r/AskReddit/comments/m07o3f/what_movie_which_youd_expect_to_be_terrible_is.json": "What movie which you’d expect to be terrible is actually unexpectedly really good?",
  "data/reddit-ask/r/AskReddit/comments/m0bbah/once_you_were_old_enough_what_were_the_dark.json": "\"Once you were old enough, what were the dark family secrets you were finally let in on?\"",
  "data/reddit-ask/r/AskReddit/comments/m0d665/women_of_reddit_what_are_things_men_do_that.json": "Women of reddit, what are things men do that scares you but they don't realise?",
  "data/reddit-ask/r/AskReddit/comments/m0fsao/what_are_some_red_flags_when_talking_to_potential.json": "What are some red flags when talking to potential employers?",
  "data/reddit-ask/r/AskReddit/comments/m0jc8f/can_you_explain_your_favorite_movie_so_vaguely.json": "Can you explain your favorite movie so vaguely nobody can guess what it is?",
  "data/reddit-ask/r/AskReddit/comments/m0jd8y/fbicia_agents_of_reddit_whats_something_that_you.json": "FBI/CIA agents of Reddit, what’s something that you can tell us without killing us?",
  "data/reddit-ask/r/AskReddit/comments/m0kazn/what_is_a_hated_thing_that_isnt_actually_that_bad.json": "What is a hated thing that isn’t actually that bad?",
  "data/reddit-ask/r/AskReddit/comments/m0l37y/teachers_of_reddit_what_generation_did_you_like.json": "Teachers of reddit, What generation did you like teaching most? (80s, 90s, 00s) Why?",
  "data/reddit-ask/r/AskReddit/comments/m0x3hi/whats_your_most_toxic_trait_you_can_admit_to.json": "What's your most toxic trait you can admit to?",
  "data/reddit-ask/r/AskReddit/comments/m0xllf/what_would_12_yearold_you_never_believe_about.json": "What would 12 year-old you never believe about adult you?",
  "data/reddit-ask/r/AskReddit/comments/m0xpkn/what_is_the_weirdest_behavior_you_have_had_from_a.json": "What is the weirdest behavior you have had from a damaged computer?",
  "data/reddit-ask/r/AskReddit/comments/m10weq/your_spouse_calls_you_middle_of_the_day_asks_you.json": "Your spouse calls you middle of the day, asks you to trust them, don’t ask questions, grab whatever you can, grab some cash and leave the city. Don’t stop, don’t call anyone, just disappear for a few days. What do you do? Question to know more or trust and disappear? If later, how will you do it?",
  "data/reddit-ask/r/AskReddit/comments/m14yg2/if_you_had_to_make_one_animal_extinct_to_cause_as.json": "If you had to make one animal extinct to cause as much panic as possible, what one would you choose and why?",
  "data/reddit-ask/r/AskReddit/comments/m16r9s/redditors_what_is_the_worst_fit_of_gamer_rage.json": "Redditors, what is the worst fit of gamer rage you’ve seen/experienced?",
  "data/reddit-ask/r/AskReddit/comments/m180f4/therapists_and_psychiatrists_of_reddit_what_is.json": "Therapists and psychiatrists of Reddit, what is the best/most uplifting recovery journey you’ve witnessed?",
  "data/reddit-ask/r/AskReddit/comments/m189ki/what_is_something_that_is_significantly_cheaper.json": "What is something that is significantly cheaper if you 'do it yourself'?",
  "data/reddit-ask/r/AskReddit/comments/m1cu6p/people_that_lost_their_virginity_to_another.json": "People that lost their virginity to another virgin, what issues if any did the lack of experience by both parties cause?",
  "data/reddit-ask/r/AskReddit/comments/m1iyga/how_would_you_feel_if_reddit_added_a_feature.json": "How would you feel if Reddit added a feature where you could still use your normal account, but then have an option to press a button on your account and post anonymously rather then creating a throwaway?",
  "data/reddit-ask/r/AskReddit/comments/m1ms1j/lawyers_of_reddit_is_there_a_time_where_you_said.json": "Lawyers of Reddit, is there a time where you said, \"Fuck it, you are on your own.\" to a client?",
  "data/reddit-ask/r/AskReddit/comments/m1ofa2/what_are_some_annoying_things_that_people_do_to.json": "What are some annoying things that people do to sound/seem intelligent?",
  "data/reddit-ask/r/AskReddit/comments/m1qa0p/how_would_you_feel_about_a_global_no_ad_day_where.json": "How would you feel about a global No Ad Day where the entire internet is completely Advertisement free and all services must comply or be shut down?",
  "data/reddit-ask/r/AskReddit/comments/m1v2iq/what_is_surprisingly_safe_for_human_consumption.json": "What is, surprisingly, safe for human consumption?",
  "data/reddit-ask/r/AskReddit/comments/m1w4tu/whats_the_worst_thing_you_can_say_at_a_funeral.json": "What's the worst thing you can say at a funeral?",
  "data/reddit-ask/r/AskReddit/comments/m1w85c/serious_why_do_you_buy_onlyfans_content_when.json": "[Serious] Why do you buy OnlyFan’s content when adult content is available online for free?",
  "data/reddit-ask/r/AskReddit/comments/m1x8wt/what_was_your_wow_this_really_is_a_small_world.json": "What was your “wow, this really is a small world” moment?",
  "data/reddit-ask/r/AskReddit/comments/m1ykd3/whats_a_real_life_example_of_foreshadowing_that.json": "What's a real life example of foreshadowing that has happened to you?",
  "data/reddit-ask/r/AskReddit/comments/m1z655/what_are_some_nsfw_lifehacks.json": "What are some NSFW lifehacks?",
  "data/reddit-ask/r/AskReddit/comments/m20543/what_made_the_popular_guygirl_lose_their.json": "What made the popular guy/girl lose their popularity?",
  "data/reddit-ask/r/AskReddit/comments/m24tw2/people_with_jobs_that_require_you_to_go_into.json": "People with jobs that require you to go into strangers’ houses, what is the weirdest thing you’ve encountered?",
  "data/reddit-ask/r/AskReddit/comments/m25df9/you_have_to_choose_one_person_from_all_of_human.json": "You have to choose one person from all of human history to shit their pants, at a time so as to change the course of history as much as possible. Who would you choose, when and why?",
  "data/reddit-ask/r/AskReddit/comments/m2b4ld/why_did_you_pick_your_username_as_your_username.json": "Why did you pick your username as your username?",
  "data/reddit-ask/r/AskReddit/comments/m2borx/people_who_arent_exhausted_247_how.json": "People who aren't exhausted 24/7... How?",
  "data/reddit-ask/r/AskReddit/comments/m2g9on/how_do_we_know_that_cave_drawings_arent_ancient.json": "How do we know that Cave drawings aren’t ancient doodles by bored caveman kids?",
  "data/reddit-ask/r/AskReddit/comments/m2ha5f/you_are_playing_20_questions_and_are_a_fictional.json": "You are playing 20 questions and are a fictional character, and the question asked is “are you alive?” - would you answer Yes or No. please include why, or what circumstances may drive your answer?",
  "data/reddit-ask/r/AskReddit/comments/m2hlgq/what_food_was_a_disappointment_to_you_that_you.json": "What food was a disappointment to you that you were excited to try?",
  "data/reddit-ask/r/AskReddit/comments/m2led5/why_when_were_busy_do_we_get_excited_for_all_the.json": "Why when we’re busy, do we get excited for all the things we can accomplish in our free time, but when we have free time we aren’t motivated to do those things?",
  "data/reddit-ask/r/AskReddit/comments/m2s4ai/people_who_own_multiple_pets_what_is_some_drama.json": "People who own multiple pets, what is some drama going on between them right now?",
  "data/reddit-ask/r/AskReddit/comments/m2sm0o/what_online_trend_confuses_you_the_most.json": "What online trend confuses you the most?",
  "data/reddit-ask/r/AskReddit/comments/m2z1jd/whats_are_some_hard_to_swallow_pills_about.json": "What's are some 'hard to swallow pills' about relationships?",
  "data/reddit-ask/r/AskReddit/comments/m2z6ot/people_with_synesthesia_who_contracted_covid_and.json": "People with synesthesia who contracted Covid and lost some sense of taste/smell, how does it affect you?",
  "data/reddit-ask/r/AskReddit/comments/m356wy/whats_a_conspiracy_theory_youve_come_to_accept_as.json": "What’s a conspiracy theory you’ve come to accept as 100% true?",
  "data/reddit-ask/r/AskReddit/comments/m3a26z/jack_in_the_box_workers_of_reddit_do_you.json": "Jack in the Box workers of reddit, do you intentionally put one regular fry in an order of curly fries? If so, why?",
  "data/reddit-ask/r/AskReddit/comments/m3aa7h/did_you_ever_wake_up_from_a_intense_dream_so_real.json": "Did you ever wake up from a intense dream so real, one that made you happy and then sad and angry when you woke up because it wasn‘t real?",
  "data/reddit-ask/r/AskReddit/comments/m3chqa/if_white_paint_spilled_on_your_black_cat_how.json": "If white paint spilled on your black cat, how would you prevent local skunks from trying to have sex with it?",
  "data/reddit-ask/r/AskReddit/comments/m3g0pb/whats_a_line_from_a_video_game_that_only_fans_know.json": "What's a line from a video game that only fans know?",
  "data/reddit-ask/r/AskReddit/comments/m3hjuh/redditors_who_hoarded_toilet_paper_about_a_year.json": "Redditors who hoarded toilet paper about a year ago, how much toilet paper you got left?",
  "data/reddit-ask/r/AskReddit/comments/m3p71v/what_subreddits_are_notorious_for_being_awful_at.json": "What subreddits are notorious for being awful at receiving criticism?",
  "data/reddit-ask/r/AskReddit/comments/m3phtr/lawyers_of_reddit_which_fictional_villain_would.json": "Lawyers of Reddit, which fictional villain would you have the easiest time defending?",
  "data/reddit-ask/r/AskReddit/comments/m3zk83/people_who_waited_until_marriage_to_have_sex_was.json": "People who waited until marriage to have sex, was it worth it? Would you recommend it to others?",
  "data/reddit-ask/r/AskReddit/comments/m433n1/insomniacs_and_troubled_sleepers_of_reddit_when.json": "Insomniacs and troubled sleepers of Reddit, when you wake up at 3am and can’t fall back asleep, what do you do??",
  "data/reddit-ask/r/AskReddit/comments/m44qcs/what_was_your_thank_god_its_over_and_ill_never.json": "What was your \"Thank god its over and ill never have to do it again\" thing?",
  "data/reddit-ask/r/AskReddit/comments/m44xeb/if_you_could_ask_any_question_at_all_and_receive.json": "If you could ask any question at all and receive the absolute truth, what question would it be?",
  "data/reddit-ask/r/AskReddit/comments/m47rjl/what_are_you_slightly_above_average_at.json": "What are you slightly above average at?",
  "data/reddit-ask/r/AskReddit/comments/m47uvo/human_laws_now_apply_to_pets_what_is_your_pet.json": "Human laws now apply to pets, what is your pet getting arrested for day 1?",
  "data/reddit-ask/r/AskReddit/comments/m4a58z/what_are_some_respectful_things_you_can_say.json": "What are some respectful things you can say during sex? Spice things up but not make it weird?",
  "data/reddit-ask/r/AskReddit/comments/m4f2x3/people_that_have_woken_up_in_bed_with_a_stranger.json": "People that have woken up in bed with a stranger, what’s your story?",
  "data/reddit-ask/r/AskReddit/comments/m4g6yi/when_did_you_realize_you_dont_really_have_friends.json": "When did you realize you don’t really have friends?",
  "data/reddit-ask/r/AskReddit/comments/m4gc19/what_video_games_need_to_be_remastered.json": "What video games need to be remastered?",
  "data/reddit-ask/r/AskReddit/comments/m4ijez/whats_a_rich_person_hobby_you_dont_actually_need.json": "What's A Rich Person Hobby You Don't Actually Need To Be Rich To Do?",
  "data/reddit-ask/r/AskReddit/comments/m4plvj/redditors_who_called_numbers_on_bathroom_walls.json": "Redditors who called numbers on bathroom walls, how did it go?",
  "data/reddit-ask/r/AskReddit/comments/m4q952/what_are_some_nonenglish_songs_that_are_absolute.json": "What are some non-English songs that are absolute bangers?",
  "data/reddit-ask/r/AskReddit/comments/m4rygn/whats_the_worst_mistake_people_dont_realise.json": "What’s the worst mistake people don’t realise they’re making in thier 20’s ?",
  "data/reddit-ask/r/AskReddit/comments/m4uabl/nonbrits_what_is_your_favorite_british_term.json": "Non-Brits, what is your favorite British term?",
  "data/reddit-ask/r/AskReddit/comments/m4w834/what_is_one_ordinary_thing_that_you_cant_do.json": "What is one “ordinary” thing that you can’t do?",
  "data/reddit-ask/r/AskReddit/comments/m4wb71/serious_the_ascent_of_billionaires_is_a_symptom.json": "[Serious] \"The ascent of billionaires is a symptom & outcome of an immoral system that tells people affordable insulin is impossible but exploitation is fine\" - Alexandria Ocasio-Cortez. What are your thoughts on this?",
  "data/reddit-ask/r/AskReddit/comments/m4zj9e/what_was_the_best_phrase_you_found_written_on.json": "What was the best phrase you found written on public restroom walls?",
  "data/reddit-ask/r/AskReddit/comments/m52rks/what_popular_rumour_in_your_school_turned_out_to.json": "What popular rumour in your school turned out to be true?",
  "data/reddit-ask/r/AskReddit/comments/m578hh/older_generations_of_reddit_what_toys_did_you.json": "Older generations of Reddit: What toys did you have as a child that would be considered too dangerous to be given to a child today?",
  "data/reddit-ask/r/AskReddit/comments/m57i2r/people_who_search_ask_redditcreepy_or_unexplained.json": "People who search ask Reddit/creepy or unexplained late at night what’s the creepiest story out there?",
  "data/reddit-ask/r/AskReddit/comments/m57mnf/what_fictional_death_hurt_you_the_most.json": "What fictional death hurt you the most?",
  "data/reddit-ask/r/AskReddit/comments/m5ftpf/you_have_been_accepted_for_an_experiment_you_must.json": "You have been accepted for an experiment: you must stay at home with no human contact for one year. If you succeed for the whole year without giving up, you'll win €1,000,000. Will you take part? And what will you do to counteract the inevitable psychological consequences?",
  "data/reddit-ask/r/AskReddit/comments/m5ijk1/serious_whats_a_concept_you_just_cannot_grasp.json": "[Serious] what's a concept you just cannot grasp?",
  "data/reddit-ask/r/AskReddit/comments/m5iq59/a_kid_named_kuzon_comes_to_your_school_beats_up.json": "A kid named Kuzon comes to your school, beats up one of your classmates, invites you to a party in a cave, does crazy dance moves, then disappears forever, what do you do?",
  "data/reddit-ask/r/AskReddit/comments/m5iqxi/what_only_exists_to_fuck_with_all_of_us.json": "What only exists to fuck with all of us?",
  "data/reddit-ask/r/AskReddit/comments/m5o93h/people_who_had_abstinence_only_sex_education_what.json": "People who had \"Abstinence Only\" sex education, what was the most outrageous or untrue thing you were told?",
  "data/reddit-ask/r/AskReddit/comments/m5z266/people_who_still_have_things_you_rented_from.json": "People who still have things you rented from Blockbuster, how does it feel to have won that long long tug of war between you and the late fee?",
  "data/reddit-ask/r/AskReddit/comments/m66q3k/which_movie_sequel_would_have_the_weirdest_title.json": "Which movie sequel would have the weirdest title if it followed the same format as “Die Hard” to “Die Harder”?",
  "data/reddit-ask/r/AskReddit/comments/m67r71/what_is_the_most_lifechanging_piece_of_advice.json": "What is the most life-changing piece of advice you’ve received that has molded you into who you are today?",
  "data/reddit-ask/r/AskReddit/comments/m6djih/what_are_some_green_flags_early_on_in_dating_that.json": "What are some GREEN flags early on in dating that the relationship should become serious?",
  "data/reddit-ask/r/AskReddit/comments/m6io4d/women_of_reddit_what_common_insecurities_do_men.json": "Women of Reddit, what common insecurities do men have about their bodies that women don't actually care about?",
  "data/reddit-ask/r/AskReddit/comments/m6k4j0/what_is_one_netflix_series_that_you_always.json": "What is one Netflix series that you always recommend to people because of how good it is?",
  "data/reddit-ask/r/AskReddit/comments/m6oer4/of_the_people_who_are_still_alive_but_have.json": "Of the people who are still alive but have drifted out of your life, who do you wonder about the most and why?",
  "data/reddit-ask/r/AskReddit/comments/m6rgn2/youve_been_cryogenically_frozen_reanimated_and.json": "You've been Cryogenically frozen, reanimated, and the year is now 2100, what's the first question you ask?",
  "data/reddit-ask/r/AskReddit/comments/m6wvku/what_is_the_most_creepy_unexplained_event_that.json": "What is the most creepy, unexplained event that has happened in your life?",
  "data/reddit-ask/r/AskReddit/comments/m6xrma/people_who_have_stories_they_want_to_share_but.json": "People who have stories they want to share, but have not found a question relevant to them, what are your stories?",
  "data/reddit-ask/r/AskReddit/comments/m6yzjw/which_reddit_sub_is_brilliant_in_theory_but_is.json": "Which Reddit sub is brilliant in theory, but is actually crap?",
  "data/reddit-ask/r/AskReddit/comments/m74536/gamers_of_reddit_what_is_a_game_that_has_a.json": "Gamers of Reddit, what is a game that has a special meaning to you because what was going on in your life when you played it or who you played it with?",
  "data/reddit-ask/r/AskReddit/comments/m75sgt/what_are_some_names_from_your_childhood_that_no.json": "What are some names from your childhood that no one names their kids anymore?",
  "data/reddit-ask/r/AskReddit/comments/m777h8/chefs_of_reddit_whats_is_your_single_favourite.json": "Chefs of Reddit, what's is your single favourite ingredient and why?",
  "data/reddit-ask/r/AskReddit/comments/m7c4td/people_who_used_to_be_school_bullies_why_were_you.json": "People who used to be school bullies, why were you so mean and what made you realize you were mean?",
  "data/reddit-ask/r/AskReddit/comments/m7e152/youre_abducted_by_friendly_aliens_who_kindly_ask.json": "You're abducted by friendly aliens who kindly ask you to sing \"the song of your people\". What song do you sing for them?",
  "data/reddit-ask/r/AskReddit/comments/m7nz9t/what_is_that_one_book_that_absolutely_changed.json": "What is that one book, that absolutely changed your life?",
  "data/reddit-ask/r/AskReddit/comments/m7pb9l/what_made_you_realise_you_were_medically_not_okay.json": "What made you realise you were medically not okay?",
  "data/reddit-ask/r/AskReddit/comments/m7pcfz/what_companies_are_super_shitty_and_everyone.json": "What companies are super shitty and everyone should know about them?",
  "data/reddit-ask/r/AskReddit/comments/m7qio9/what_is_the_worst_song_lyric_of_all_time.json": "What is the WORST song lyric of all time?",
  "data/reddit-ask/r/AskReddit/comments/m7rle5/what_ridiculous_thing_do_people_brag_about_for.json": "What ridiculous thing do people brag about for some reason?",
  "data/reddit-ask/r/AskReddit/comments/m7sdm8/what_is_the_one_thing_you_hate_about_youtube.json": "What is the one thing you hate about YouTube?",
  "data/reddit-ask/r/AskReddit/comments/m7vaa6/redditors_with_disabilities_mental_illnesses_and.json": "Redditors with disabilities, mental illnesses and chronic illnesses: what do you wish society better understood about your life?",
  "data/reddit-ask/r/AskReddit/comments/m7vjhy/what_movie_would_end_the_fastest_if_all_the.json": "What movie would end the fastest if all the characters behaved logically?",
  "data/reddit-ask/r/AskReddit/comments/m7wdv6/if_an_alien_offered_you_a_one_week_trip_across.json": "If an alien offered you a one week trip across the galaxy and back with the catch being 15 years passes on Earth, would you accept or reject the offer and why?",
  "data/reddit-ask/r/AskReddit/comments/m7y4hv/whats_something_nonreligious_that_we_all_have_to.json": "What's something non-religious that we all have to pretend is true even though we know deep down is complete BS?",
  "data/reddit-ask/r/AskReddit/comments/m81myw/what_is_the_scariest_noise_that_youve_heard_so.json": "What is the scariest noise that you’ve heard, so scary that your body had a physical response and what made it?",
  "data/reddit-ask/r/AskReddit/comments/m88b8t/whats_the_scariest_encounter_youve_had_with_a.json": "What's the scariest encounter you've had with a total stranger?",
  "data/reddit-ask/r/AskReddit/comments/m8alhm/you_are_forced_to_take_a_bullet_which_body_part.json": "You are forced to take a bullet. Which body part do you choose?",
  "data/reddit-ask/r/AskReddit/comments/m8bzzd/what_is_the_stupidest_thing_youve_seen_your_pet_do.json": "What is the stupidest thing you’ve seen your pet do?",
  "data/reddit-ask/r/AskReddit/comments/m8ilr9/what_should_be_free.json": "What should be free?",
  "data/reddit-ask/r/AskReddit/comments/m8k8i9/if_aliens_ever_make_contact_with_humanity_how.json": "If aliens ever make contact with humanity how will we deal with the PR nightmare of explaining all the movies that depict us exterminating them?",
  "data/reddit-ask/r/AskReddit/comments/m8l011/what_is_the_most_selfless_thing_someone_is.json": "What is the most selfless thing someone is unaware they did for you?",
  "data/reddit-ask/r/AskReddit/comments/m8lzmk/have_someone_you_know_ever_tried_to_kill_you_and.json": "Have someone you know ever tried to kill you? And why?",
  "data/reddit-ask/r/AskReddit/comments/m8o6iq/what_makes_you_hopeful_that_we_can_reach_net_zero.json": "What makes you hopeful that we can reach net zero emissions by 2050?",
  "data/reddit-ask/r/AskReddit/comments/m8uabc/heterosexuals_of_reddit_what_is_a_question_you.json": "Heterosexuals of Reddit, what is a question you have for the LGBTQ+ community?",
  "data/reddit-ask/r/AskReddit/comments/m8vv1e/what_are_you_afraid_of.json": "What are you afraid of?",
  "data/reddit-ask/r/AskReddit/comments/m8zdl7/will_you_continue_to_wear_a_mask_when_the.json": "Will you continue to wear a mask when the pandemic is over? If so, why?",
  "data/reddit-ask/r/AskReddit/comments/m9456y/mjolnir_can_only_be_lifted_by_the_worthy_which.json": "Mjolnir can only be lifted by the worthy. Which fictional or even real life characters could lift it?",
  "data/reddit-ask/r/AskReddit/comments/m94odb/what_can_just_fuck_off.json": "What can just fuck off?",
  "data/reddit-ask/r/AskReddit/comments/m9571z/how_do_you_ask_for_sex_respectfully.json": "How do you ask for sex respectfully?",
  "data/reddit-ask/r/AskReddit/comments/m959ep/people_who_dont_want_to_tax_the_1_but_are_not_in.json": "People who don’t want to tax the 1% but are not in the 1%, why?",
  "data/reddit-ask/r/AskReddit/comments/m96cl0/after_death_you_wake_up_in_a_childs_body_and.json": "After death you wake up in a child's body and still have all your previous life's memory. What will you do right this time?",
  "data/reddit-ask/r/AskReddit/comments/m98pa6/what_makes_you_happy.json": "What makes you happy?",
  "data/reddit-ask/r/AskReddit/comments/m9am8z/what_screams_i_have_money_but_dont_know_how_to.json": "What screams \"I have money but don't know how to manage it\"?",
  "data/reddit-ask/r/AskReddit/comments/m9cjum/men_of_reddit_who_are_your_female_heroes.json": "Men of Reddit, who are your female heroes?",
  "data/reddit-ask/r/AskReddit/comments/m9dic7/what_is_something_that_irritates_you_that_youre.json": "What is something that irritates you that you’re also guilty of doing?",
  "data/reddit-ask/r/AskReddit/comments/m9drti/whats_legal_now_but_probably_wont_be_in_10_years.json": "What’s legal now, but probably won’t be in 10 years?",
  "data/reddit-ask/r/AskReddit/comments/m9g2m2/in_your_opinion_what_is_the_most_perfect_movie.json": "In your opinion, what is the most perfect movie ever?",
  "data/reddit-ask/r/AskReddit/comments/m9iitt/what_movie_has_an_unnecessary_conflict_or_villain.json": "What movie has an unnecessary conflict or villain?",
  "data/reddit-ask/r/AskReddit/comments/m9ipza/what_are_some_of_the_most_absurd_lies_your.json": "What are some of the most absurd lies your parents told you?",
  "data/reddit-ask/r/AskReddit/comments/m9koih/people_who_have_posted_on_rroastme_and_regretted.json": "People who have posted on r/RoastMe and regretted it, what was the comment that destroyed you?",
  "data/reddit-ask/r/AskReddit/comments/m9s0cp/people_of_reddit_who_lose_one_shoe_on_the_side_of.json": "People of Reddit who lose one shoe on the side of the road, what’s going on in your life?",
  "data/reddit-ask/r/AskReddit/comments/m9v6z2/what_is_a_tradition_in_your_country_that_makes_no.json": "What is a tradition in your country that makes no sense to the rest of the world?",
  "data/reddit-ask/r/AskReddit/comments/m9vh8a/serious_parents_who_regret_having_kids_why.json": "[SERIOUS] Parents who regret having kids: why?",
  "data/reddit-ask/r/AskReddit/comments/m9vw2s/what_is_your_best_quote_that_you_use_often.json": "What is your best quote that you use often?",
  "data/reddit-ask/r/AskReddit/comments/m9yk17/redditors_who_had_a_dying_confession_but_then.json": "Redditors who had a dying confession but then lived, what happened?",
  "data/reddit-ask/r/AskReddit/comments/ma3tvw/what_has_been_normalised_but_really_shouldnt_be.json": "What has been normalised but really shouldn’t be?",
  "data/reddit-ask/r/AskReddit/comments/ma6ap6/911_operators_of_reddit_what_are_some_of_the.json": "911 Operators of Reddit, what are some of the funniest things someone has called in for?",
  "data/reddit-ask/r/AskReddit/comments/ma7qsl/whos_a_bad_guy_from_fiction_who_was_actually_right.json": "Who’s a “bad guy” from fiction who was actually right?",
  "data/reddit-ask/r/AskReddit/comments/ma8r10/if_you_had_to_pick_would_you_rather_live_in_a.json": "If you had to pick, would you rather live in a magical fantasy universe, (Like Lord of the Rings) or live in an advanced technological universe? (Think Star Trek, Warhammer, etc) And why?",
  "data/reddit-ask/r/AskReddit/comments/maazv9/what_are_the_most_easily_provoked_fanbases.json": "What are the most easily provoked fanbases?",
  "data/reddit-ask/r/AskReddit/comments/mabb4z/people_that_have_restarted_in_a_new_city_what_are.json": "People that have restarted in a new city, what are your tips?",
  "data/reddit-ask/r/AskReddit/comments/mabs9v/who_is_the_most_unlikable_fictional_protagonist.json": "Who is the most unlikable fictional protagonist?",
  "data/reddit-ask/r/AskReddit/comments/madb4f/leftwingers_of_reddit_what_is_your_most_rightwing.json": "Left-wingers of Reddit, what is your most right-wing opinion? Right-wingers, what is your most left-wing opinion?",
  "data/reddit-ask/r/AskReddit/comments/madhz7/whats_your_comfort_movie.json": "What’s your “comfort movie”?",
  "data/reddit-ask/r/AskReddit/comments/makbxa/parents_of_reddit_what_are_your_i_looked_away_for.json": "Parents of reddit, what are your \"I looked away for ONE second\" stories?",
  "data/reddit-ask/r/AskReddit/comments/mapbxo/whats_a_movie_with_great_cinematography_but_a.json": "What’s a movie with great cinematography but a terrible story?",
  "data/reddit-ask/r/AskReddit/comments/mapi0f/whenever_you_hear_a_walks_into_a_bar_joke_is_it.json": "Whenever you hear a “walks into a bar joke”, is it always the same bar imagined in your mind? What does it look like?",
  "data/reddit-ask/r/AskReddit/comments/maryzy/what_do_you_do_secretly_when_you_are_alone_that.json": "What do you do secretly when you are alone that you would be ashamed of in front of others?",
  "data/reddit-ask/r/AskReddit/comments/mawb5n/people_of_reddit_who_was_the_dumbest_person_you.json": "People of reddit, who was the dumbest person you met?",
  "data/reddit-ask/r/AskReddit/comments/mawiau/whats_something_youd_love_to_see_but_wont_be.json": "What’s something you’d love to see but won’t be alive for?",
  "data/reddit-ask/r/AskReddit/comments/mb7tms/nsfw_what_event_if_it_happened_in_reverse_order.json": "[NSFW] What event, if it happened in reverse order, would be a horrible experience?",
  "data/reddit-ask/r/AskReddit/comments/mb82bl/which_movie_have_you_seen_more_than_7_times.json": "Which movie have you seen more than 7 times??",
  "data/reddit-ask/r/AskReddit/comments/mb98xj/whats_your_toxic_traits.json": "What’s your toxic trait(s)?",
  "data/reddit-ask/r/AskReddit/comments/mb9ltx/whats_something_you_loved_as_a_kid_but_hate_as_a.json": "What’s something you loved as a kid but hate as a adult?",
  "data/reddit-ask/r/AskReddit/comments/mbbvac/charlie_was_given_willy_wonkas_chocolate_factory.json": "Charlie was given Willy Wonka’s chocolate factory 50 years ago, he should be getting ready to retire, how will he choose his successor?",
  "data/reddit-ask/r/AskReddit/comments/mbg6q7/people_who_dont_get_stressed_during_a.json": "People who don't get stressed during a presentation, school or work, what's your secret?",
  "data/reddit-ask/r/AskReddit/comments/mbk20w/redditors_what_are_your_opinions_about_the_post.json": "Redditors, what are your opinions about the post mentioning Aimee Challenor's history getting banned in r/ukpolitics?",
  "data/reddit-ask/r/AskReddit/comments/mbk6oa/gift_guides_for_men_are_boring_and_all_the_same.json": "Gift guides for men are boring and all the same. Men of Reddit, what gifts would you actually want to receive?",
  "data/reddit-ask/r/AskReddit/comments/mbslj4/what_is_a_disturbing_fact_you_wish_you_could.json": "What is a disturbing fact you wish you could un-learn?",
  "data/reddit-ask/r/AskReddit/comments/mbtjq7/if_youre_belly_button_was_a_real_button_what.json": "If you’re belly button was a real button, what would you want it to do?",
  "data/reddit-ask/r/AskReddit/comments/mbub4e/what_do_you_miss_the_most_about_life_pre_covid.json": "What do you miss the most about life pre Covid?",
  "data/reddit-ask/r/AskReddit/comments/mc5f4z/what_are_some_great_examples_of_the_streisand.json": "What are some great examples of the Streisand Effect?",
  "data/reddit-ask/r/AskReddit/comments/mc5o3j/what_is_your_personal_line_that_you_wont_cross.json": "What is your personal \"line\" that you won't cross when it comes to associating with pedophiles?",
  "data/reddit-ask/r/AskReddit/comments/mc5u4h/in_your_opinion_how_can_large_social_media.json": "In your opinion, how can large social media platforms improve child safeguarding?",
  "data/reddit-ask/r/AskReddit/comments/mc62l5/whats_your_favorite_example_of_the_streisand.json": "What's your favorite example of the Streisand effect?",
  "data/reddit-ask/r/AskReddit/comments/mc6ayl/whats_the_worst_thing_about_reddit_recently.json": "What’s the worst thing about Reddit recently?",
  "data/reddit-ask/r/AskReddit/comments/mc8teu/what_is_your_opinion_on_aimee_challenor.json": "What is your opinion on Aimee Challenor?",
  "data/reddit-ask/r/AskReddit/comments/mc9p08/mods_of_raskreddit_what_are_your_feelings_on.json": "Mods of r/askreddit, what are your feelings on Aimee Channelor?",
  "data/reddit-ask/r/AskReddit/comments/mcbmj7/what_is_the_best_example_of_a_major_coverup.json": "What is the best example of a major cover-up backfiring?",
  "data/reddit-ask/r/AskReddit/comments/mcbulb/what_behavior_from_the_admins_would_make_you_stop.json": "What behavior from the admins would make you stop using reddit?",
  "data/reddit-ask/r/AskReddit/comments/mcc2nb/what_are_your_thoughts_on_reddit_hiring_aimee.json": "What are your thoughts on Reddit hiring Aimee Challenor?",
  "data/reddit-ask/r/AskReddit/comments/mce2ep/how_do_you_say_fuck_off_politely.json": "How do you say 'fuck off' politely?",
  "data/reddit-ask/r/AskReddit/comments/mcekby/whats_your_opinion_on_aimee_challenors_father.json": "What's your opinion on Aimee Challenor's father?",
  "data/reddit-ask/r/AskReddit/comments/mcfqoa/if_you_press_the_clit_and_the_gspot_at_the_same.json": "If you press the clit and the g-spot at the same time, does the vagina take a screenshot and where would it store the image?",
  "data/reddit-ask/r/AskReddit/comments/mcp3ad/what_would_happen_if_all_7_billion_people.json": "What would happen if all 7 billion people screamed at once?",
  "data/reddit-ask/r/AskReddit/comments/mcrdzm/what_movie_scene_made_you_say_what_the_fk.json": "What movie scene made you say \"what the f**k?\"",
  "data/reddit-ask/r/AskReddit/comments/mcuxen/what_world_record_will_never_be_beaten.json": "What world record will never be beaten?",
  "data/reddit-ask/r/AskReddit/comments/mcwezn/what_books_were_you_made_to_read_in_school_that.json": "What books were you made to read in school that you hated?",
  "data/reddit-ask/r/AskReddit/comments/mcztl6/you_are_teleported_back_to_2001_terminatorstyle.json": "You are teleported back to 2001 terminator-style (butt ass naked) and end up in the middle of Times Square. What do you do or say to convince people you’re not a stoned homeless person?",
  "data/reddit-ask/r/AskReddit/comments/md0ny3/what_nonsensical_invasive_thoughts_do_you_have.json": "What nonsensical, invasive thoughts do you have that pop up from time to time that make you question your sanity?",
  "data/reddit-ask/r/AskReddit/comments/md0su7/the_mandela_effect_is_when_a_large_group_of.json": "The Mandela effect is when a large group of people remember something differently that it occurred. What is your best example of this?",
  "data/reddit-ask/r/AskReddit/comments/mdbrqo/if_you_were_in_a_room_with_everyone_you_ever_met.json": "If you were in a room with everyone you ever met, who would be the one you’d look for?",
  "data/reddit-ask/r/AskReddit/comments/mddn1a/how_do_you_still_have_a_good_life_if_you_are.json": "How do you still have a good life if you are working 45+ hours?",
  "data/reddit-ask/r/AskReddit/comments/mdj4aq/this_might_be_a_stupid_question_but_what_is_it.json": "This might be a stupid question, but what is it like to NOT be depressed?",
  "data/reddit-ask/r/AskReddit/comments/mdjrbv/people_who_have_ghosted_friends_permanently_why.json": "People who have ghosted friends permanently: Why did you do it?",
  "data/reddit-ask/r/AskReddit/comments/mdlbrp/how_the_f_do_you_make_friends_as_an_adult_if_you.json": "How the F do you make friends as an adult if you don't drink?",
  "data/reddit-ask/r/AskReddit/comments/mdmxch/hr_personnel_of_reddit_whats_the_most_unnecessary.json": "HR personnel of Reddit, what's the most unnecessary thing you've seen in a resume?",
  "data/reddit-ask/r/AskReddit/comments/mdr2h0/if_a_burglar_breaks_into_your_house_at_3_am_what.json": "If a burglar breaks into your house at 3 AM what would your 3 AM defense strategy be?",
  "data/reddit-ask/r/AskReddit/comments/mdsp3p/who_has_ever_had_a_wet_nightmare_if_thats_even.json": "Who has ever had a wet nightmare (if that's even possible)? What was it that made it a nightmare?",
  "data/reddit-ask/r/AskReddit/comments/mdx7ks/if_everyone_disappeared_for_1_day_what_would_you.json": "If everyone disappeared for 1 day what would you do?",
  "data/reddit-ask/r/AskReddit/comments/mdz78u/what_about_your_childhood_did_you_think_was.json": "What about your childhood did you think was normal until you grew up and realized it wasn't?",
  "data/reddit-ask/r/AskReddit/comments/me0rwy/what_unhealthy_food_is_actually_healthy_serious.json": "What \"unhealthy\" food is actually healthy? (serious)",
  "data/reddit-ask/r/AskReddit/comments/me43dd/bruce_wayne_is_estimated_to_have_only_9_billion.json": "Bruce Wayne is estimated to have only $9 billion, so why aren’t the world’s current billionaires out there fighting crime?",
  "data/reddit-ask/r/AskReddit/comments/me49fr/even_if_you_are_an_adult_what_is_something_that.json": "Even if you are an adult, what is something that you are never truly too old for?",
  "data/reddit-ask/r/AskReddit/comments/me8z8j/people_who_named_their_child_daenerys_what_did.json": "People who named their child Daenerys, what did you do after season 8 of GoT came out?",
  "data/reddit-ask/r/AskReddit/comments/meccgj/what_celebrity_do_you_think_is_a_total_psychopath.json": "What celebrity do you think is a total psychopath?",
  "data/reddit-ask/r/AskReddit/comments/meh217/women_what_are_the_subtle_kinds_of_low_grade.json": "Women, what are the subtle kinds of low grade sexual harassment you face on a constant basis ?",
  "data/reddit-ask/r/AskReddit/comments/mej4by/people_who_believe_in_zodiac_signs_why.json": "People who believe in zodiac signs, why?",
  "data/reddit-ask/r/AskReddit/comments/mekv9i/whats_the_most_successful_april_fools_joke_that.json": "What's the most successful April Fool's joke that you know of?",
  "data/reddit-ask/r/AskReddit/comments/mel1c0/ex_homeless_or_anyone_in_the_know_what_advice_or.json": "Ex homeless or anyone in the know, what advice or help would you give to someone about to become homeless?",
  "data/reddit-ask/r/AskReddit/comments/menc4p/people_who_ride_ridiculously_loud_motorcycles.json": "People who ride ridiculously loud motorcycles around residential areas after midnight....Why?",
  "data/reddit-ask/r/AskReddit/comments/menzu3/serious_couples_who_still_find_each_other_sexy.json": "[Serious] Couples who still find each other sexy after years and years of marriage, what’s the secret?",
  "data/reddit-ask/r/AskReddit/comments/mepi8y/your_parents_and_the_media_were_right_video_games.json": "Your parents and the media were right. Video games do cause violence. Based on the last game you played, what are you getting arrested for?",
  "data/reddit-ask/r/AskReddit/comments/meslpp/what_is_an_adult_problem_that_you_were_not.json": "What is an adult problem that you were not prepared for?",
  "data/reddit-ask/r/AskReddit/comments/mevsux/to_surgeons_of_reddit_what_is_the_most_disgusting.json": "To Surgeons of Reddit, what is the most disgusting thing you ever had to remove from someone?",
  "data/reddit-ask/r/AskReddit/comments/mex5xq/in_which_part_of_your_life_you_switched_from.json": "In which part of your life, you switched from amazing hopes and dreams to “I just want to survive another day”?",
  "data/reddit-ask/r/AskReddit/comments/mey77p/men_what_kind_of_low_grade_sexual_harassment_do.json": "Men, what kind of low grade sexual harassment do you face on a daily basis?",
  "data/reddit-ask/r/AskReddit/comments/mez9az/once_a_cheater_always_a_cheater_what_are_your.json": "“Once a cheater, always a cheater” - What are your thoughts on this statement and what would it take to start a relationship with someone who has cheated before?",
  "data/reddit-ask/r/AskReddit/comments/mf0bx0/what_is_a_waste_of_money.json": "What is a waste of money?",
  "data/reddit-ask/r/AskReddit/comments/mf0cej/nyan_cat_turns_10_year_old_next_month_how_will.json": "Nyan Cat turns 10 year old next month. How will you be celebrating?",
  "data/reddit-ask/r/AskReddit/comments/mf4hry/if_you_suddenly_came_into_a_large_sum_of_money.json": "If you suddenly came into a large sum of money, say $1,000,000 or more, how would you turn it into passive income for the future?",
  "data/reddit-ask/r/AskReddit/comments/mf54ky/if_brands_were_brutally_honest_what_brand_would.json": "If brands were brutally honest, what brand would have what slogan?",
  "data/reddit-ask/r/AskReddit/comments/mf6ks1/what_would_happen_if_all_of_reddit_showed_up_at.json": "What would happen if all of reddit showed up at the Suez canal with plastic toy shovels & offered to help?",
  "data/reddit-ask/r/AskReddit/comments/mf6pnq/what_apparently_is_too_fucking_much_to_ask_for.json": "What, apparently, is too fucking much to ask for?",
  "data/reddit-ask/r/AskReddit/comments/mfble8/i_want_to_name_my_daughter_mayonnaise_and_shorten.json": "“I want to name my daughter Mayonnaise and shorten it to May” What other examples of everyday items can you turn into ordinary names to torture your imaginary children with?",
  "data/reddit-ask/r/AskReddit/comments/mfdhe9/what_are_the_creepiest_urban_legends_from_your.json": "What are the creepiest urban legends from your area?",
  "data/reddit-ask/r/AskReddit/comments/mfdy3j/no_offence_intended_do_people_with_prosthetic.json": "No offence intended, do people with prosthetic limbs remove or keep them on during intercouse? What would the benefits or draw backs to either be?",
  "data/reddit-ask/r/AskReddit/comments/mfj2g5/dentist_of_reddit_which_are_some_bad_advices_that.json": "Dentist of reddit, which are some bad advices that old school dentist are still giving?",
  "data/reddit-ask/r/AskReddit/comments/mflsiu/what_part_of_lockdown_will_you_miss_the_most_once.json": "What part of lockdown will you miss the most once it ends?",
  "data/reddit-ask/r/AskReddit/comments/mfnlz7/doctors_of_reddit_if_free_healthcare_for_all.json": "Doctors of Reddit, if free healthcare for all happened tomorrow in the US, what pros and cons would you see in your profession from day to day?",
  "data/reddit-ask/r/AskReddit/comments/mfnqjp/whats_the_most_dangerous_food_youve_ever_eaten.json": "What's the most dangerous food you've ever eaten?",
  "data/reddit-ask/r/AskReddit/comments/mfolgn/nsfw_if_you_suddenly_discovered_that_people_you.json": "[NSFW] If you suddenly discovered that people you had fantasized about, while masturbating, were always fully aware of this, what would your first thoughts be?",
  "data/reddit-ask/r/AskReddit/comments/mfq8wf/whats_a_nonfatal_criminal_punishment_thats_never.json": "What's a non-fatal criminal punishment that's NEVER been used anywhere in the world, but you'd like to see it implemented in your country?",
  "data/reddit-ask/r/AskReddit/comments/mfr340/whats_the_worst_thing_youve_ever_eaten_in_order.json": "What's the worst thing you've ever eaten in order to be polite?",
  "data/reddit-ask/r/AskReddit/comments/mfvnwh/master_yoda_arrives_at_your_house_and_gives_you_a.json": "Master Yoda arrives at your house and gives you a lightsaber. He tells you that Darth Vader is coming for you and you have 1 week before you must face him. What do you do?",
  "data/reddit-ask/r/AskReddit/comments/mfwp97/serious_americans_are_you_aware_of_how_much.json": "[Serious] Americans, are you aware of how much propaganda there is in your country? If so, how did you realise it?",
  "data/reddit-ask/r/AskReddit/comments/mfx7hq/since_a_bat_and_an_evergreen_boat_can_crash_the.json": "Since a bat and an evergreen boat can crash the economy, what will crash it next?",
  "data/reddit-ask/r/AskReddit/comments/mfylrf/people_who_watch_videos_and_tiktoks_at_full.json": "People who watch videos and TikToks at full volume in public places - why?",
  "data/reddit-ask/r/AskReddit/comments/mg0b38/americans_who_have_moved_abroad_how_has_it_been.json": "Americans who have moved abroad, how has it been in your new country?",
  "data/reddit-ask/r/AskReddit/comments/mg13l3/hey_people_of_reddit_whats_a_nice_way_of_telling.json": "Hey people of Reddit, what’s a nice way of telling a talkative person to shut up?",
  "data/reddit-ask/r/AskReddit/comments/mg1vox/whats_a_book_that_completely_fucked_you_up_after.json": "What's a book that completely fucked you up after reading, or that you couldn't even finish?",
  "data/reddit-ask/r/AskReddit/comments/mg2ygl/you_meet_yourself_from_10_years_in_the_future_you.json": "You meet yourself from 10 years in the future. You get to ask them 1 question. What do you ask them?",
  "data/reddit-ask/r/AskReddit/comments/mg345c/if_you_never_had_to_sleep_and_always_had_perfect.json": "If you never had to sleep, and always had perfect energy... How would you use that extra time?",
  "data/reddit-ask/r/AskReddit/comments/mg97rk/what_are_the_best_jobs_for_lazy_people.json": "What are the best jobs for lazy people?",
  "data/reddit-ask/r/AskReddit/comments/mgbxqb/whats_a_useless_talent_of_yours.json": "What's a useless talent of yours?",
  "data/reddit-ask/r/AskReddit/comments/mgdw49/have_you_ever_seen_someone_ruin_their_life_in.json": "Have you ever seen someone ruin their life in just a few seconds? How did they do it?",
  "data/reddit-ask/r/AskReddit/comments/mgf5sd/how_much_do_you_think_politics_would_change_if.json": "How much do you think politics would change if politicians were held personally and financially responsible for damage caused by their lies?",
  "data/reddit-ask/r/AskReddit/comments/mgivo7/what_is_a_home_design_trend_that_you_hate.json": "What is a home design trend that you hate?",
  "data/reddit-ask/r/AskReddit/comments/mgkp9f/what_movie_did_you_hate_as_you_were_watching_it.json": "What movie did you hate as you were watching it and couldn't wait for it to be over?",
  "data/reddit-ask/r/AskReddit/comments/mgn7e6/botanists_of_reddit_what_are_the_scariest_plants.json": "Botanists of reddit, what are the scariest plants in the world?",
  "data/reddit-ask/r/AskReddit/comments/mgnetf/historians_of_reddit_whats_a_devastating_event.json": "Historians of Reddit, what’s a devastating event that no one talks about?",
  "data/reddit-ask/r/AskReddit/comments/mgo6d3/what_is_something_that_was_actually_better_back.json": "What is something that was actually better “back in my days” ?",
  "data/reddit-ask/r/AskReddit/comments/mgsgwz/if_all_movies_ran_for_as_long_as_the_plot_spans.json": "If all movies ran for as long as the plot spans inside their respective universes, which one would be the most tedious to sit down and watch all the way through?",
  "data/reddit-ask/r/AskReddit/comments/mgsi3x/have_you_ever_separated_from_your_entire_friend.json": "Have you ever separated from your entire friend group, if so, why?",
  "data/reddit-ask/r/AskReddit/comments/mh3tuk/obgyns_of_reddit_whats_the_most_mindblowing_thing.json": "OB/GYN’s of reddit whats the most mindblowing thing a husband or boyfriend has said?",
  "data/reddit-ask/r/AskReddit/comments/mh3zns/if_16_year_old_you_could_see_you_now_what_would.json": "If 16 year old you could see you now, what would 16 year old you think about your life?",
  "data/reddit-ask/r/AskReddit/comments/mh4dh6/would_you_be_for_or_against_sign_language_being.json": "Would you be for or against sign language being taught in schools and explain why?",
  "data/reddit-ask/r/AskReddit/comments/mh5o3j/people_who_voted_for_president_biden_in_the.json": "People who voted for President Biden in the election, how do you feel about him now almost 90 days into his administration?",
  "data/reddit-ask/r/AskWomen/comments/lur0gf/women_what_do_you_wish_you_knew_about_consent_in.json": "women: what do you wish you knew about consent in your youth?",
  "data/reddit-ask/r/AskWomen/comments/luvgfq/women_who_love_women_what_is_something_unexpected.json": "Women who love women, what is something unexpected you encountered when dating women?",
  "data/reddit-ask/r/AskWomen/comments/luykkg/what_is_the_wisest_thing_youve_been_told_in.json": "What is the wisest thing you've been told in therapy?",
  "data/reddit-ask/r/AskWomen/comments/lva8t3/women_who_took_a_longer_path_to_reach_your_life.json": "Women who took a longer path to reach your life/ career goal, why do you not regret spending the extra time to figure out what you want? How do you not compare yourself with one who took a linear path to reach the same goal?",
  "data/reddit-ask/r/AskWomen/comments/lve1nc/what_is_a_choice_your_parents_made_that_you_were.json": "What is a choice your parents made that you were mad about as a kid but realized was right as an adult?",
  "data/reddit-ask/r/AskWomen/comments/lvos7x/women_how_do_you_feel_about_fitness_influencers.json": "Women, how do you feel about fitness influencers who push this idea of “normal” bodies look like this, when they have quite literally look like models?",
  "data/reddit-ask/r/AskWomen/comments/lw0cp1/women_who_have_a_hard_time_orgasming_what_has.json": "Women who have a hard time orgasming, what has helped you?",
  "data/reddit-ask/r/AskWomen/comments/lwajyq/mental_check_in_all_honesty_how_are_you_and_how.json": "Mental check! In all honesty, how are you and how is life?",
  "data/reddit-ask/r/AskWomen/comments/lwelx9/muslim_ladies_what_is_the_coolest_thing_for_you.json": "Muslim ladies: what is the coolest thing for you about living your life according to your faith?",
  "data/reddit-ask/r/AskWomen/comments/lwl4nl/calling_all_successful_relationships_with.json": "Calling all successful relationships with separate beds or rooms how do you make it work? How has the separate sleeping spaces impacted your relationship?",
  "data/reddit-ask/r/AskWomen/comments/lwvwft/what_rant_have_you_been_wanting_to_go_on_but_feel.json": "What rant have you been wanting to go on, but feel like you otherwise can't?",
  "data/reddit-ask/r/AskWomen/comments/lxbynu/ladies_of_reddit_have_you_been_so_incredibly.json": "Ladies of Reddit, have you been so incredibly frustrated and misunderstood that you start crying? What’s your story?",
  "data/reddit-ask/r/AskWomen/comments/lxvmmy/women_with_longterm_andor_chronic_mental_health.json": "Women with long-term and/or chronic mental health issues: how do you deal with life and the struggle of accepting life?",
  "data/reddit-ask/r/AskWomen/comments/ly8mrw/whats_the_cutest_thing_your_partner_does_that_the.json": "what’s the cutest thing your partner does that the world should know about?",
  "data/reddit-ask/r/AskWomen/comments/lz16ce/if_youre_a_child_of_divorce_how_old_were_you_at.json": "If you’re a child of divorce, how old were you at the time and how did it effect you?",
  "data/reddit-ask/r/AskWomen/comments/lz4rf4/women_what_character_trait_are_you_actively.json": "Women, what character trait are you actively working on developing or getting rid off?",
  "data/reddit-ask/r/AskWomen/comments/lz5ewr/married_women_how_has_your_marriage_changed_since.json": "Married women, how has your marriage changed since the start of the pandemic?",
  "data/reddit-ask/r/AskWomen/comments/lz8ybr/i_saw_a_statistic_recently_that_men_are_more.json": "I saw a statistic recently that men are more likely to leave a spouse who gets chronically ill than women are. What are your thoughts on this? Has anyone seen this?",
  "data/reddit-ask/r/AskWomen/comments/lzl4wz/what_small_decision_you_made_unexpectedly_had_a.json": "What small decision you made unexpectedly had a significant impact on your life?",
  "data/reddit-ask/r/AskWomen/comments/m03cnp/whats_your_everyday_breakfast_menu_that_keeps_you.json": "What’s your everyday breakfast menu that keeps you full for hours?",
  "data/reddit-ask/r/AskWomen/comments/m05y7w/what_was_the_juiciest_gossip_you_ever.json": "What was the juiciest gossip you ever hear/overheard/got involved in?",
  "data/reddit-ask/r/AskWomen/comments/m0jy61/to_women_who_have_close_male_friends_have_they.json": "To women who have close male friends, have they ever made comments about women (appearances, certain traits, etc.) that has made you uncomfortable? If so, how did you deal with it?",
  "data/reddit-ask/r/AskWomen/comments/m1qwp3/women_what_is_something_you_wish_you_knew_sooner.json": "Women, what is something you wish you knew sooner about your body? Or even, what is something you are ashamed to ask about your body and still don't have an answer to.",
  "data/reddit-ask/r/AskWomen/comments/m1rgpu/how_did_you_overcome_mental_illness_when_you_had.json": "How did you overcome mental illness when you had no access to a psychologist?",
  "data/reddit-ask/r/AskWomen/comments/m21f7l/lovely_women_of_reddit_how_did_you_build_your.json": "Lovely women of Reddit, how did you build your backbone?",
  "data/reddit-ask/r/AskWomen/comments/m23qaf/have_you_ever_applied_for_a_job_that_you_werent.json": "Have you ever applied for a job that you weren't really qualified for but you got it anyway? What's your story?",
  "data/reddit-ask/r/AskWomen/comments/m2opz3/fellow_ladies_fighting_mental_illness_whats_your.json": "Fellow ladies fighting mental illness, what’s your best “getting out of bed and through the day” tips for those REALLY bad episodes?",
  "data/reddit-ask/r/AskWomen/comments/m3aalj/women_of_reddit_how_do_you_distinguish_the_line.json": "Women of Reddit, how do you distinguish the line between accepting flaws in your partner and your partner simply not being a good match?",
  "data/reddit-ask/r/AskWomen/comments/m3gyy0/how_do_you_deal_with_the_grief_of_losing_a_pet.json": "How do you deal with the grief of losing a pet?",
  "data/reddit-ask/r/AskWomen/comments/m3orwl/women_who_have_experienced_a_miscarriage_what.json": "Women who have experienced a miscarriage, what were the most helpful ways you were comforted, and what were the most insensitive responses?",
  "data/reddit-ask/r/AskWomen/comments/m3tgvr/what_are_some_daily_things_you_do_to_look_and.json": "What are some daily things you do to look and feel your best that don’t cost a lot of money?",
  "data/reddit-ask/r/AskWomen/comments/m48qoi/how_do_you_receive_without_feeling_guilty_or_the.json": "How do you receive without feeling guilty or the need to reciprocate? Emotionally, sexually, materially, etc.",
  "data/reddit-ask/r/AskWomen/comments/m4b9l4/women_who_had_mental_health_issues_in_college.json": "Women who had mental health issues in college, what happened?",
  "data/reddit-ask/r/AskWomen/comments/m4njic/who_had_chronic_health_problems_that_disappeared.json": "Who had chronic health problems that disappeared after your divorce/breakup?",
  "data/reddit-ask/r/AskWomen/comments/m4qsb0/feminist_women_what_are_some_feminist.json": "Feminist women, what are some feminist beliefs/thoughts you disagree or only partially agree with? What are some societal attitudes that you wish were addressed more in feminism?",
  "data/reddit-ask/r/AskWomen/comments/m5nypm/did_your_mother_ever_make_comments_to_you_in_your.json": "Did your mother ever make comments to you in your teenage years that you’ve grown up to realize she was bitter and jealous of your youth? How did it stick with you?",
  "data/reddit-ask/r/AskWomen/comments/m79slu/for_folks_who_entered_their_first_relationship.json": "For folks who entered their first relationship 'later' in life (after 30), how did your relationship come about and what were the reasons for it being 'later' in life?",
  "data/reddit-ask/r/AskWomen/comments/m7d8t3/how_do_you_handle_men_who_feel_personally.json": "How do you handle men who feel personally attacked when the topic of female harassment is brought up?",
  "data/reddit-ask/r/AskWomen/comments/m7olzk/women_who_love_watching_tv_shows_which_ridiculous.json": "Women who love watching tv shows, which ridiculous plot point made you stop watching mid-show?",
  "data/reddit-ask/r/AskWomen/comments/m87qsl/women_who_have_been_both_larger_and_thinner_what.json": "Women who have been both larger and thinner, what is your experience with how you felt and how you were treated at both sizes?",
  "data/reddit-ask/r/AskWomen/comments/m8noru/have_you_abandonedghosted_an_unhealthy_long_term.json": "Have you abandoned/ghosted an unhealthy long term friendship without an explanation? If so, how did the other person reacted?",
  "data/reddit-ask/r/AskWomen/comments/m8zt27/for_women_who_put_their_cashapppaypalvenmo_in.json": "For women who put their cashapp/paypal/venmo in your tinder bio, does it net you money? if so, how much? why do people usually send you money?",
  "data/reddit-ask/r/AskWomen/comments/m94148/women_who_cry_when_you_are_angry_how_do_you.json": "Women who cry when you are angry how do you manage serious conversations when mad?",
  "data/reddit-ask/r/AskWomen/comments/m960lx/has_anyone_been_diagnosed_with_adhd_in_adulthood.json": "Has anyone been diagnosed with ADHD in adulthood? What was the experience like?",
  "data/reddit-ask/r/AskWomen/comments/m980g9/what_should_a_women_do_in_their_20s_to_avoid.json": "What should a women do in their 20s to avoid regrets in their 30s and 40s?",
  "data/reddit-ask/r/AskWomen/comments/m9uy28/what_are_little_things_that_keeps_you_going_after.json": "What are little things that keeps you going after being an adult working 9 to 5 with the same routine over and over again?",
  "data/reddit-ask/r/AskWomen/comments/m9yjcw/what_cheap_hobbies_do_you_have_that_dont_involve.json": "What cheap hobbies do you have that don't involve a screen (phone/computer)?",
  "data/reddit-ask/r/AskWomen/comments/madxyu/what_are_some_other_girly_subreddits_that_you.json": "What are some other girly subreddits that you enjoy?",
  "data/reddit-ask/r/AskWomen/comments/mapf22/have_you_reread_diary_entries_from_your.json": "Have you reread diary entries from your teens/twenties? If so, what do you wish you’d written more about?",
  "data/reddit-ask/r/AskWomen/comments/mavfqk/how_do_you_gather_the_courage_to_speak_up_about.json": "How do you gather the courage to speak up about sexual harassment when men joke about it and feed into rape culture?",
  "data/reddit-ask/r/AskWomen/comments/mb2kx1/whats_the_stupidest_question_youve_been_asked.json": "What's the stupidest question you've been asked about being a woman?",
  "data/reddit-ask/r/AskWomen/comments/mbbz4d/if_youre_older_and_havent_decided_yet_if_you_want.json": "If you're older and havent decided yet if you want children and/or to buy a house, how comfortable are you about potentially not doing either?",
  "data/reddit-ask/r/AskWomen/comments/mbe8qj/for_the_girls_who_live_alone_whats_your_everyday.json": "For the girls who live alone, what's your everyday routine like?",
  "data/reddit-ask/r/AskWomen/comments/mbjptg/what_did_you_learn_too_late_in_life.json": "What did you learn too late in life ?",
  "data/reddit-ask/r/AskWomen/comments/mbwckx/what_steps_do_you_think_can_be_taken_to_combat.json": "What steps do you think can be taken to combat the rise of anti-Asian violence?",
  "data/reddit-ask/r/AskWomen/comments/mbwwwm/women_who_have_had_long_term_relationships_end.json": "Women who have had long term relationships end, what were the unexpected positives of being single again?",
  "data/reddit-ask/r/AskWomen/comments/md9n5p/women_who_have_lost_their_mothers_to_cancer_how.json": "Women who have lost their mothers to cancer, how did you cope while they were nearing the end?",
  "data/reddit-ask/r/AskWomen/comments/mddnr1/women_of_reddit_how_did_you_come_to_terms_with.json": "Women of Reddit: How did you come to terms with the fact that people considered you the weird person in your friend group?",
  "data/reddit-ask/r/AskWomen/comments/mdqnn5/what_is_your_biggest_work_related_pet_peeve.json": "What is your biggest work related pet peeve?",
  "data/reddit-ask/r/AskWomen/comments/mdu9gw/what_is_the_number_one_hygiene_tip_that_you_swear.json": "What is the number one hygiene tip that you SWEAR by?",
  "data/reddit-ask/r/AskWomen/comments/mdxvwo/whats_a_bottom_tier_fruit_for_you.json": "What’s a bottom tier fruit for you?",
  "data/reddit-ask/r/AskWomen/comments/meaxlk/women_whose_family_disapprove_of_their_so_due_to.json": "Women whose family disapprove of their SO due to religious/ethnic/patriotic/racist/cultural reasons - what’s your story?",
  "data/reddit-ask/r/AskWomen/comments/mek0ll/please_share_a_time_you_thought_you_messed_up.json": "Please share a time you thought you messed up your life completely and came out the other side ok?",
  "data/reddit-ask/r/AskWomen/comments/merud6/ladies_how_do_we_keep_our_daughters_safe_what_do.json": "Ladies - how do we keep our daughters safe? What do you teach your daughter when something as simple as going to the grocery store results in men leering and staring?",
  "data/reddit-ask/r/AskWomen/comments/metlth/whats_a_male_societal_issue_you_arent_empathetic.json": "What's a male societal issue you aren't empathetic towards?",
  "data/reddit-ask/r/AskWomen/comments/meupna/how_do_you_disconnect_your_self_worth_from_your.json": "How do you disconnect your self worth from your performance at school or work?",
  "data/reddit-ask/r/AskWomen/comments/mexoaq/what_is_the_nicest_thing_a_man_that_wasnt_family.json": "What is the nicest thing a man (that wasn’t family or a potential relationship) has done for you?",
  "data/reddit-ask/r/AskWomen/comments/mez659/did_romantic_comedies_and_media_ruin_your.json": "Did romantic comedies and media ruin your perception of love? What did you learn about real life as a hopeless romantic?",
  "data/reddit-ask/r/AskWomen/comments/mf0fvp/what_is_one_thing_you_bought_that_increased_the.json": "What is one thing you bought that increased the quality of your life quite a lot?",
  "data/reddit-ask/r/AskWomen/comments/mf9us0/ladies_how_do_you_prepare_for_and_survive_a.json": "Ladies, how do you prepare for (and survive) a difficult breakup without a support system?",
  "data/reddit-ask/r/AskWomen/comments/mfrp39/ladies_what_is_one_thing_you_wish_other_women_knew.json": "Ladies, what is one thing you wish other women knew?",
  "data/reddit-ask/r/AskWomen/comments/mftrqg/which_country_are_you_from_and_what_is_one.json": "Which country are you from and what is one positive thing for women in your culture/ country?",
  "data/reddit-ask/r/AskWomen/comments/mfu1m8/ladies_has_anyone_tried_to_make_you_feel_guilty.json": "Ladies, has anyone tried to make you feel guilty for being able to afford nice things? What was your story and how did you respond to/feel about it?",
  "data/reddit-ask/r/AskWomen/comments/mfwkdu/how_have_you_learned_to_separate_your_selfesteem.json": "How have you learned to separate your self-esteem from your appearance?",
  "data/reddit-ask/r/AskWomen/comments/mgfzks/what_is_a_family_recipe_that_has_been_handed_down.json": "What is a family recipe that has been handed down over the years? And are you willing to share it?",
  "data/reddit-ask/r/AskWomen/comments/mgthvc/women_with_a_history_of_abusive_behavior_towards.json": "Women with a history of abusive behavior towards intimate partners that have now changed, what made you change and how did you do it?",
  "data/reddit-ask/r/AskWomen/comments/mgvfo8/what_are_some_questions_you_wish_your_spouse.json": "What are some questions you wish your spouse asked earlier in your relationship?",
  "data/reddit-ask/r/AskWomen/comments/mgxl9s/whats_something_you_did_recently_that_made_you.json": "What’s something you did recently that made you extremely happy?",
  "data/reddit-ask/r/NoStupidQuestions/comments/luvwwk/why_is_it_that_sometimes_when_i_claim_that_i_am.json": "Why is it that sometimes when I claim that I am not a robot the website takes my word for it and other times I need to identify six pages of bicycles?",
  "data/reddit-ask/r/NoStupidQuestions/comments/lvgpxv/why_does_reddit_after_i_click_show_me_less_of.json": "Why does Reddit, after I click \"Show me less of this\" 1000 times still force me to see the RPAN streams? No, I don't want to see an average guy playing guitar with average skill. Or dogs. Or a dude camping",
  "data/reddit-ask/r/NoStupidQuestions/comments/lwfv7r/do_other_people_get_this_feeling_when_it_turns.json": "Do other people get this feeling when it turns spring/summer and you just feel so alive and refreshed and there's something in the air?",
  "data/reddit-ask/r/NoStupidQuestions/comments/lwml9w/if_we_look_at_planet_thats_500_light_years_away.json": "If we look at planet that's 500 light years away with a telescope, does that mean we're looking at it from what it was 500 years ago?",
  "data/reddit-ask/r/NoStupidQuestions/comments/ly6y2s/why_do_government_departments_require_you_to.json": "Why do government departments require you to provide copies of documents when you apply for things eg passport, birth certificate etc when they can literally access all of this official documentation easier than we can?",
  "data/reddit-ask/r/NoStupidQuestions/comments/lyv6cx/do_you_ever_find_yourself_exiting_reddit_just_to.json": "Do you ever find yourself exiting reddit just to open reddit again in a short span of time?",
  "data/reddit-ask/r/NoStupidQuestions/comments/lyvlqm/how_do_certain_smells_like_onions_stay_on_your.json": "How do certain smells like onions stay on your fingers for so long, even after you wash your hands repeatedly?",
  "data/reddit-ask/r/NoStupidQuestions/comments/lz7iq6/whats_the_best_way_to_explain_to_someone_that.json": "What’s the best way to explain to someone that just because I’m “good at computers” doesn’t mean I know every feature of every piece of software ever created?",
  "data/reddit-ask/r/NoStupidQuestions/comments/lzga00/why_is_megan_markle_getting_investigated_for.json": "Why is Megan Markle Getting Investigated for Being a \"Bully\" to Staff Whilst Prince Andrew Is Barely Getting any Heat for Alleged Sexual Abuse of Minors?",
  "data/reddit-ask/r/NoStupidQuestions/comments/lzmgzr/who_else_isnt_looking_forward_to_working_at_their.json": "Who else isn't looking forward to working at their regular jobs again when this is all over?",
  "data/reddit-ask/r/NoStupidQuestions/comments/m0elur/why_dont_toilets_have_a_power_wash_option_to.json": "Why don't toilets have a power wash option to power wash poostains off the side",
  "data/reddit-ask/r/NoStupidQuestions/comments/m0w331/my_six_year_old_wants_to_know_what_is_the_biggest.json": "My Six year old wants to know what is the biggest man made circle in North America.",
  "data/reddit-ask/r/NoStupidQuestions/comments/m202ho/when_people_colorize_old_photos_do_they_just.json": "When people colorize old photos, do they just choose whatever colors they want/what they guess would look accurate? Is there a way to know the precise colors of the photo?",
  "data/reddit-ask/r/NoStupidQuestions/comments/m2dtzy/why_do_i_have_to_go_through_smileamazoncom_to.json": "Why do I have to go through smile.amazon.com to have proceeds donated, instead of designating a charity on my main amazon.com account? What are the technical or business reasons behind this?",
  "data/reddit-ask/r/NoStupidQuestions/comments/m2ohut/does_black_skin_only_look_different_or_does.json": "Does black skin only look different or does touching it also feel different?",
  "data/reddit-ask/r/NoStupidQuestions/comments/m2wn83/why_has_nothing_been_done_about_the_absolutely.json": "Why has nothing been done about the absolutely insane number of spam calls we all receive on a daily basis?",
  "data/reddit-ask/r/NoStupidQuestions/comments/m3oxao/does_anyone_else_get_unreasonably_self_conscious.json": "Does anyone else get unreasonably self conscious about how fast their windshield wipers are going compared to other cars during a rainstorm?",
  "data/reddit-ask/r/NoStupidQuestions/comments/m4jfdc/is_there_a_list_of_all_companies_that_run_20.json": "Is there a list of all companies that run 20+ minute ads on YouTube so I can be sure I never buy from them?",
  "data/reddit-ask/r/NoStupidQuestions/comments/m4jih4/who_else_is_so_excited_about_losing_an_hour_of.json": "Who else is so excited about losing an hour of sleep tonight? I know I am. Seriously why is this still a thing?",
  "data/reddit-ask/r/NoStupidQuestions/comments/m4w4b9/does_anybody_else_ever_say_it_would_be_800_oclock.json": "Does anybody else ever say “It WOULD be 8:00 o’clock right now” for about the next month during Day Light Savings?",
  "data/reddit-ask/r/NoStupidQuestions/comments/m5b868/is_it_normal_to_cry_every_day_for_3_months_after.json": "Is it normal to cry every day for 3 months after your mom dies?",
  "data/reddit-ask/r/NoStupidQuestions/comments/m5ry87/does_anyone_else_get_excited_to_leave_vacations.json": "Does anyone else get excited to leave vacations or trips with friends and family so they can poop in peace at home without worrying about who hears it?",
  "data/reddit-ask/r/NoStupidQuestions/comments/m5vlem/if_you_spread_chewed_gum_across_your_butthole_and.json": "If you spread chewed gum across your butthole and farted, could you blow a bubble with your butt?",
  "data/reddit-ask/r/NoStupidQuestions/comments/m5xajk/can_i_relocate_a_spider_to_a_part_of_my_house.json": "Can I “relocate” a spider to a part of my house with more bug traffic? This poor moron in my bathroom never gets anything in her web. She’d do much better in the kitchen where I leave windows open & moths often fly around. I don’t want to discombobulate her or anything though.",
  "data/reddit-ask/r/NoStupidQuestions/comments/m6zlq7/what_the_hell_happened_to_fedex_they_used_to_be.json": "What the hell happened to FedEx? They used to be the gold standard in deliveries. Now if I see that my package is coming via them, I know it will be late or banged up...probably both.",
  "data/reddit-ask/r/NoStupidQuestions/comments/m8h15x/why_is_reddit_asking_so_many_questions_about.json": "Why is reddit asking so many questions about subreddits (such as profanity and sexual content)?",
  "data/reddit-ask/r/NoStupidQuestions/comments/m8ynye/could_it_be_that_one_reason_it_is_harder_to_make.json": "Could it be that one reason it is harder to make friends when older compared to when younger, is because younger people are more open to new experiences while older people having experienced many bad relationships are much more cautious and are significantly more selective and suspicious of people?",
  "data/reddit-ask/r/NoStupidQuestions/comments/m90wq3/everyone_talks_about_nostalgic_feeling_being.json": "Everyone talks about nostalgic feeling being calming and relieving, but does anyone else get a sense of deep lament and sorrow for the past instead?",
  "data/reddit-ask/r/NoStupidQuestions/comments/m9evmd/how_do_you_explain_the_feeling_you_get_when_music.json": "How do you explain the feeling you get when music moves through you. I feel “chills” down my legs, like electric nerve endings being touched by the music",
  "data/reddit-ask/r/NoStupidQuestions/comments/m9xsja/does_anyone_here_still_order_the_cheapest_thing.json": "Does anyone here still order the cheapest thing on the menu even if the person that's paying for your meal tells you to order whatever you want?",
  "data/reddit-ask/r/NoStupidQuestions/comments/m9z6sa/im_not_old_or_dying_but_i_get_anxious_feeling.json": "I’m not old or dying but I get anxious feeling like I’m running out of time or not doing enough, is this common?",
  "data/reddit-ask/r/NoStupidQuestions/comments/ma1vfu/how_come_youtubers_can_carry_out_video_interviews.json": "How come YouTubers can carry out video interviews without any delay in sound but news reporters talking to each other in diff locations usually wait for some seconds to hear what the other said?",
  "data/reddit-ask/r/NoStupidQuestions/comments/majng2/does_anxiety_count_as_cardio.json": "Does anxiety count as cardio?",
  "data/reddit-ask/r/NoStupidQuestions/comments/mb4vhl/does_no_one_else_notice_or_just_not_care_that.json": "Does no one else notice or just not care that most of the content on Reddit is the same stuff just reposted?",
  "data/reddit-ask/r/NoStupidQuestions/comments/mbpfp0/which_dinosaur_had_the_biggest_testicles_they.json": "Which dinosaur had the biggest testicles - they looked like godzilla or a a herbivore spinosaurus?",
  "data/reddit-ask/r/NoStupidQuestions/comments/mbpywt/is_anyone_noticing_that_people_especially_your.json": "Is anyone noticing that people, especially your neighbors, are going really crazy lately in terms of very aggressive and constant rudeness, almost like something out of a movie?",
  "data/reddit-ask/r/NoStupidQuestions/comments/mbymfs/why_dont_scars_gradually_disappear_completely_as.json": "Why don't scars gradually disappear completely as our skin sheds and replaces itself?",
  "data/reddit-ask/r/NoStupidQuestions/comments/mclbcd/how_exactly_do_birds_have_sex.json": "How exactly do Birds have Sex?",
  "data/reddit-ask/r/NoStupidQuestions/comments/md1pwy/younger_men_what_kind_of_gifts_do_you_like_my.json": "Younger men, what kind of gifts do you like? My boyfriend (18) got me a 2 year anniversary present, and I didn’t get him one because I wasn’t expecting one and I feel bad.",
  "data/reddit-ask/r/NoStupidQuestions/comments/md6f92/if_endorphins_are_produced_by_exercise_and_they.json": "If \"endorphins\" are produced by exercise, and they are the body's own \"opiods\", why do I feel so terrible EVERY SINGLE TIME I exercise?",
  "data/reddit-ask/r/NoStupidQuestions/comments/mdaeo7/does_anyone_else_close_their_eyes_when_waiting.json": "Does anyone else close their eyes when waiting for something to load and think \"it will be ready.... NOW\" and open your eyes in the hope to see a difference?",
  "data/reddit-ask/r/NoStupidQuestions/comments/me8jre/why_is_it_that_when_we_want_to_pee_while_asleep.json": "Why is it that when we want to pee while asleep our mind gives us a dream that we need to pee instead of waking us up ?",
  "data/reddit-ask/r/NoStupidQuestions/comments/meolo2/how_do_prevention_percentages_work_condoms_for.json": "How do prevention percentages work? Condoms for example is about 97% successful. Does that mean that there is a 1 in 32 usages that fails right? Which seems steep.",
  "data/reddit-ask/r/NoStupidQuestions/comments/mf46b3/why_do_some_reddit_posts_say_vote_instead_of_the.json": "Why do some reddit posts say vote instead of the number of upvotes?",
  "data/reddit-ask/r/NoStupidQuestions/comments/mfhswf/am_i_the_only_one_who_likes_looking_at_cars_turn.json": "Am i the only one who likes looking at cars turn signals go perfectly in sync, go out of sync, go back in, until they turn?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/lvgm9t/to_nonamericans_do_yall_have_that_was_it_a.json": "To non-americans, do y’all have that “was it a gunshot, or fire cracker. cause ones illegal and it isn’t the gun.” moment after hearing a loud bang in the middle of the night?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/lvssnq/if_a_person_eats_spicy_food_and_later_has_anal.json": "If a person eats spicy food and later has anal sex with another person. If the guy doesn’t use a condom could he feel the spiciness?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/lwam9t/why_is_it_okay_to_bash_christians_but_when_u_say.json": "Why is it okay to bash christians but when u say anything bad about islam you’re suddenly an asshole?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/lwkfh8/is_anyone_else_having_mixed_feelings_about_the.json": "Is anyone else having mixed feelings about the world going back to “normal”? I miss my friends, family, traveling, etc... but I have almost learned to prefer life in my sweatpants Zoom bubble. Am I alone?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ly2le9/everyone_brushes_their_teeth_before_they_go_to.json": "Everyone brushes their teeth before they go to the dentist, right?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ly5038/on_a_scale_of_010_how_much_do_you_hesitate_or_how.json": "On a scale of 0-10, how much do you hesitate or how terrified are you of having to ask your boss for a leave/a day off? Trying to see if this is just an introvert thing.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/lyja2n/i_feel_like_men_acting_feminine_is_given_much.json": "I feel like men acting feminine is given much more priority than men liking men (the literal characteristic that makes a man gay) in today's gay-themed shows, thus often sweeping the butch/masculine gays under the rug. Anyone else feel the same?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/m0ebri/if_a_man_removes_the_condom_without_consent_its.json": "If a man removes the condom without consent its considered rape, why is this not the case for a woman lieing about taking the pill?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/m0fz0g/is_it_okay_to_delete_my_mom_off_social_media.json": "Is it okay to delete my mom off social media because she nags and bitches about what I post when I'm 24?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/m0w8v1/if_selling_girl_scout_cookies_is_about_teaching.json": "If selling girl scout cookies is about teaching young ladies responsibility and entrepreneurship then why do I always just see the mothers peddling the cookies for them and never the girls actually selling the cookies themselves even if the consequence is bad sales volume?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/m0yhu6/can_blind_people_be_dyslexic_when_they_read.json": "Can blind people be dyslexic when they read Braille?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/m0zb2c/my_sister_is_88_pounds_at_52_28_years_old_and_is.json": "My sister is 88 pounds at 5'2\", 28 years old, and is publishing a dieting book where you don't eat once a week every month and eat a diet of mostly raw vegetables and no starch. Am I an asshole for not wanting this to sell well?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/m1ql60/why_are_conservative_americans_attacking_megan.json": "Why are conservative Americans attacking Megan and Harry? I thought breaking free from the monarchy was a distinctly American ideal.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/m1y30m/why_do_they_censor_genitals_in_japanese_porn_what.json": "Why do they censor Genitals in Japanese Porn?? What the point? If they are against porn, why not just ban it?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/m23ch7/why_do_people_care_about_the_british_royal_family.json": "Why do people care about the British Royal Family? They are literally just the Kardashians but British",
  "data/reddit-ask/r/TooAfraidToAsk/comments/m25rc3/does_anyone_else_think_to_with_we_instead_of_i_in.json": "Does anyone else think to with “we” instead of “I” in their inner monologue?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/m2n2yp/does_anyone_else_get_disappointed_when_they_feel.json": "Does anyone else get disappointed when they feel like they’re about to sneeze but then at the last second they don’t feel like they need to sneeze anymore?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/m4h2hj/does_anyone_else_ever_set_their_alarm_2_hours.json": "Does anyone else ever set their alarm 2+ hours earlier than when you’re supposed to wake up so you can look at your phone and feel relieved that you still have time to sleep?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/m6nu3l/am_i_the_only_one_who_thought_why_would_i_use.json": "Am I the only one who thought \"why would I use Reddit\", and then it ended up being one of your most-used platforms?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/m9gp6v/cows_are_considered_sacred_in_hinduism_yet_rest.json": "Cows are considered sacred in Hinduism yet rest of the world eats them regularly. So, when people in countries like China eat dogs, why is it considered unethical? Shouldn't different cultures be allowed to eat what they want?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/mbsf1o/why_is_reddit_protecting_a_pedophile_aimee.json": "Why is reddit protecting a pedophile aimee challenor?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/mctugk/why_is_unekosune_who_is_the_girlfriend_of_aimee.json": "Why is u/nekosune who is the girlfriend of Aimee Channelor a mod of the subreddit lgtb for kids?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/md4fxz/do_women_who_have_twins_ever_dual_wield_the.json": "Do women who have twins ever dual wield the babies when breastfeeding them like 1 nipple per baby?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/mdkttq/since_many_users_would_rather_have_people_donate.json": "Since many users would rather have people donate to charity than give them rewards, why can’t reddit just make rewards that go directly to charity?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/mdyi86/since_we_the_usa_is_boycotting_xinjiang_chinas.json": "Since we the USA is boycotting Xinjiang, China's cotton for being produced with \"slave labor\", shouldn't the USA also boycott iPhones and Nike shoes for also being produced with \"slave labor\"?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/mfl4zm/after_the_past_year_how_many_of_you_feel_like_you.json": "After the past year, how many of you feel like you just don’t care about anything anymore?",
  "data/reddit-ask/r/TrueAskReddit/comments/m4s9t0/why_are_so_many_countries_going_through_a_baby.json": "Why are so many countries going through a baby bust ?",
  "data/reddit-ask/r/TrueAskReddit/comments/m91jf7/employersmiddle_management_of_reddit_how_will.json": "Employers/Middle Management of Reddit, how will your company's policies on remote work change after the pandemic's over?",
  "data/reddit-ask/r/TrueAskReddit/comments/mbvlpi/do_you_feel_the_internet_is_an_exceptionally.json": "Do you feel the internet is an exceptionally toxic place, or does it just capture the reality of the true toxicity of people and society?",
  "data/reddit-ask/r/TrueAskReddit/comments/me5dvg/how_do_you_find_hopemotivation_in_this_dying_world.json": "how do YOU find hope/motivation in this dying world?",
  "data/reddit-ask/r/askscience/comments/lv68uf/how_long_does_it_take_for_fossil_fuels_to.json": "How long does it take for fossil fuels to regenerate?",
  "data/reddit-ask/r/askscience/comments/lwknlq/what_controls_the_production_of_ear_wax.json": "What controls the production of ear wax?",
  "data/reddit-ask/r/askscience/comments/lwv2v7/if_we_can_vaccinate_chickens_against_salmonella.json": "If we can vaccinate chickens against salmonella, why haven’t we done the same for humans?",
  "data/reddit-ask/r/askscience/comments/lxhyi3/how_many_mutations_does_the_average_human_have_if.json": "How many mutations does the average human have, if <1 what % of people have at least 1 mutation present?",
  "data/reddit-ask/r/askscience/comments/ly0hq7/how_many_spikes_are_there_on_a_single_sarscov2.json": "How many spikes are there on a single SARS-CoV-2 virus? Does it vary from virus to virus?",
  "data/reddit-ask/r/askscience/comments/lyq3sz/when_you_have_antibodies_for_covid_do_repeated.json": "When you have antibodies for COVID, do repeated exposures to sources of the virus \"refresh\" the timer on your immunity?",
  "data/reddit-ask/r/askscience/comments/lz0vtw/baby_birds_are_helpless_and_mostly_drably.json": "Baby birds are helpless and mostly drably coloured to blend in. However, chicks and ducklings are walking yellow highlighters. Is there some advantage to this colouration?",
  "data/reddit-ask/r/askscience/comments/m13p2u/what_is_the_most_important_component_of_viral.json": "what is the most important component of viral structure as far as invasion is concerned?",
  "data/reddit-ask/r/askscience/comments/m1fpzy/how_does_a_river_like_the_colorado_go_from_a.json": "How does a river like the Colorado go from a dribble to this massive river that carved the Southwest?",
  "data/reddit-ask/r/askscience/comments/m387mc/do_animals_within_the_arctic_circle_have_a.json": "Do animals within the Arctic Circle have a day-night rhythm during polar nights?",
  "data/reddit-ask/r/askscience/comments/m4beaa/in_nuclear_pasta_all_the_electrons_merge_with.json": "In nuclear pasta all the electrons merge with protons so what dictates nuclear pasta’s chemical properties? Please explain in simple terms because I am not an astrophysicist :)",
  "data/reddit-ask/r/askscience/comments/m7tc0m/do_tendons_get_thicker_aswell_with_strength.json": "Do tendons get thicker aswell with strength training?",
  "data/reddit-ask/r/askscience/comments/m8ebvz/why_do_we_only_see_one_big_rainbow_instead_of.json": "Why do we only see one big rainbow instead of myriad of very small ones? Every drop of water in the air kind of creates its own small rainbow by refracting the light, so why don't we see all of those individually?",
  "data/reddit-ask/r/askscience/comments/m8iwfn/has_there_ever_been_a_study_of_how_children_of.json": "Has there ever been a study of how children of parents with advanced degrees do at poor/mediocre/average schools in K12 compared to peers at highly ranked ones? If so, what were the results?",
  "data/reddit-ask/r/askscience/comments/m8odq2/why_does_our_immune_system_need_one_or_two.json": "Why does our immune system need one or two injections to learn to fight a new threat and many injections to unlearn to fight a perceived threat (e.g. dust mite)? Thanks",
  "data/reddit-ask/r/askscience/comments/mbeq4r/how_do_rockets_burn_fuel_in_space_if_there_isnt.json": "How do rockets burn fuel in space if there isnt oxygen in space?",
  "data/reddit-ask/r/askscience/comments/mcj94u/why_do_we_have_two_of_some_organs_lungs.json": "Why do we have two of some organs (lungs, testicles,kidneys) but one of others (heart, liver etc..) ?",
  "data/reddit-ask/r/askscience/comments/mh1tmb/scientists_created_a_radioactive_powered_diamond.json": "Scientists created a “radioactive powered diamond battery” that can last up to 28,000 years. What is actually going on here?"
}