{
  "data/reddit-books/r/booksuggestions/comments/knn7de/im_a_bibliophile_who_read_only_9_books_this_year.json": "Sorry for the long-ish post :(\n\nRemember we all had a kid in our high school who used to gobble up books after\nbooks. Yeah. I was that kid. And then came college. I read 38 books last year.\nNot great, not terrible.\n\nThen came lockdown of 2020. I thought \"hmm I have all the time in the world and\nI'll…",
  "data/reddit-books/r/booksuggestions/comments/kl2xxv/what_was_the_best_book_you_read_in_2020.json": "Hi! Creating a 2021 reading list and curious to hear your favourite read in 2020\nand why! (Ideally something I can also find in a local UK bookstore so I don't\ngive Amazon more money!)\n\nEdit 1: Welp! Did not expect this response at all! Thank you so much for all\nyour recommendations, I am thrilled…",
  "data/reddit-books/r/booksuggestions/comments/klv187/i_really_enjoyed_neil_gaimons_norse_mythology_can.json": "**vein",
  "data/reddit-books/r/booksuggestions/comments/kmq6yr/looking_for_the_classics_not_written_in_english_i.json": "Context: I'm well-versed in the classic authors writing in English, but frankly\npretty ignorant when it comes to classics from Asia, or Africa, or any of the\nEuropean countries in which English isn't the first language, even.\n\nI'm hoping to change that and would appreciate any help on where to…",
  "data/reddit-books/r/booksuggestions/comments/klkbrj/im_moving_to_africa_in_18_days_i_need_books_to.json": "I'm so excited that my long-planned adventure is finally happening, but as I\npack and prepare to leave, I'm starting to panic a little bit. I would love any\nbook suggestions y'all have, fiction or non-fiction, to deal with a major\nadventure and life change. Thanks :)",
  "data/reddit-books/r/books/comments/klnepp/im_a_newbie_to_epic_scifi_literature_and_reading.json": "Ok. I know that this post is going to be downvoted to hell, although I never\nunderstood why people downvote a post that has a different opinion to theirs,\nbut I will say it anyways.. Reading DUNE did not turn out the way I thought it\nwould.\n\nI liked science fiction ideas in general ever since I was…",
  "data/reddit-books/r/books/comments/knr9n6/tomorrow_is_public_domain_day_in_the_us_what.json": "The big ones coming out of copyright tomorrow include The Great Gatsby\n(Fitzgerald), Mrs. Dalloway (Woolf), In Our Time (Hemingway) and An American\nTragedy (Dreiser). Other authors with books coming out of copyright include\nKafka, Christie, Huxley, Lewis, Dos Passos, Wharton and Maugham.\n\nLonger…"
}