{
  "data/reddit-ask/r/AskHistorians/comments/obek3n/an_extreme_supernova_lit_the_skies_1000_years_ago.json": "I was reading this science article:\n(https://www.sciencealert.com/this-supernova-discovery-could-help-explain-a-thousand-year-old-mystery)\nwhich explains a supernova lit the sky for 23 days, even in the daytime. What\ntheories dis the various world religions and cultures believe was the cause?",
  "data/reddit-ask/r/AskHistorians/comments/obfx5v/did_armies_really_played_music_during_battle.json": "Every time I hear about this I just get amazed by how ridiculous it sounds. And\nif it was a thing of like the middle Ages I can get behind that (it's still\nstupid tho).\n\nBut I've heard and seen pictures of people playing and Instrument in the front\nrow even during 19th century. I think I've even…",
  "data/reddit-ask/r/AskHistorians/comments/obq407/meta_when_and_why_did_historians_start_using.json": "In the past few years I've noticed a linguistic shift among historians,\nincluding and especially flaired users on this sub. In writeups regarding the\nantebellum South, the term \"enslaver\" is increasingly being used instead of\n\"slave owner\", and regarding western colonialism, the term \"colonist\" is…",
  "data/reddit-ask/r/AskHistorians/comments/obyikz/i_am_the_first_son_of_a_landed_gentleman_in.json": "It is the era of King George II and I am the first born son of an older,\nprestigious, but not particularly wealthy, landed gentleman in England. My\nfather has just passed and as his firstborn, I've inherited his country estate.\nHe is survived by his wife (my mother) and his sons and daughter.\n\nI'm…",
  "data/reddit-ask/r/AskHistorians/comments/ocd347/a_user_in_rhistoryporn_titled_a_photo_a_man.json": "Also, famines in British India are frequently attributed (rightfully or not) to\ncolonial policy - why was the Great Famine of 1876–1878 isolated to two\nprovinces and two princely states? Is this evidence that colonial policy was not\na sufficient factor in the 1876-78?",
  "data/reddit-ask/r/AskHistorians/comments/ocd51r/why_did_civilizations_first_start_forming_at.json": "I understand the basics of the agricultural revolution and whatnot, and what\ngenerally lead to the rise of civilizations. What I don't understand is why the\nsame thing happened at roughly the same time (relative to the time scale of\nhuman evolution) in areas that shouldn't have had any interaction…",
  "data/reddit-ask/r/AskHistorians/comments/ocdg6t/how_did_the_sidewalk_lemonade_stand_become_a.json": "So this is a question I've had for ages and have never found a proper answer to:\nwhen did lemonade stands become a sort of cliché thing kids did to earn pocket\nchange, and how? I can find lots about the history of lemonade stands being an\nindustry that popped up in cities for adults or young…",
  "data/reddit-ask/r/AskHistorians/comments/ocif5f/were_there_any_surprises_that_came_when_we_first.json": "Satellite maps are the most detailed maps we can have of our planet, and for\nmost of time our maps have been partially incomplete or inaccurate, it’s only\nrecently we’ve been able to have pretty much perfect maps.\n\nWhen the first satellite maps were being made, were there any places that…",
  "data/reddit-ask/r/AskHistorians/comments/ocnhum/when_and_why_did_the_general_political_tone_of.json": "I’m not sure if this is even objectively true, but I listen to a lot of country\nmusic and I’ve noticed in the latter half of the 20th century, any political\nnotes usually were left leaning. Steve Earle, Johnny Cash, Willie Nelson, John\nPrine, all were considered pioneers of progressivism and at…",
  "data/reddit-ask/r/AskHistorians/comments/ocx1w3/why_is_far_eastern_russia_so_underpopulated.json": "This might be a question relating to all of eastern Russia, but I focused on the\nmore clearly similar ones. Primorsky Krai\n[https://en.wikipedia.org/wiki/Primorsky_Krai] is at 12/km2 while Heilongjiang\n[https://en.wikipedia.org/wiki/Heilongjiang] is at 70/km2. Why couldn't Russia\ndevelop these…",
  "data/reddit-ask/r/AskHistorians/comments/od5ilb/were_crimes_committed_by_aztec_nobility_typically.json": "I saw this on Today I Learned, and was hoping there was a more reliable source\nthan the one cited in that post.",
  "data/reddit-ask/r/AskHistorians/comments/od5zh1/til_that_crimes_committed_by_nobility_in_aztec.json": "https://www.reddit.com/r/todayilearned/comments/od0srt/til_that_crimes_committed_by_nobility_in_aztec/",
  "data/reddit-ask/r/AskHistorians/comments/odaotg/im_a_mongolian_and_my_history_teachers_taught_us.json": "To me, this sounds very far-fetched, even in my history teacher's description,\nit was just about 10,000 horsemen using a few guns, but maybe it would have been\npossible to steal control because China was so disorganized at the time? I might\nbe wrong about the year, it's been a long time. And this…",
  "data/reddit-ask/r/AskHistorians/comments/odl72c/how_do_academics_feel_about_tom_holland_and_his.json": "Firstly, for those wondering, not Spiderman, this guy\n[https://en.wikipedia.org/wiki/Tom_Holland_(author]).\n\nSecondly, someone I know sent me some of his stuff. He basically argues (as an\natheist) that Christianity shaped the morality of the western world and has\nbecome what we generally find it to…",
  "data/reddit-ask/r/AskHistorians/comments/odp4vy/why_do_we_as_americans_celebrate_the_day_we.json": "The treaty of Paris was signed September 3, 1783. Seems like that's the better\nindependence day.",
  "data/reddit-ask/r/AskHistorians/comments/odpm23/academia_in_the_us_is_often_called_intellectual.json": "For example, was Ivory in the ‚Ivory towers’ chosen because of its then\nassociation with academia? Were academics at the time enthusiastic elephant\nhunters or something?",
  "data/reddit-ask/r/AskHistorians/comments/odu3wa/in_hbos_rome_battle_hardened_centurion_lucius.json": "Hiya,\n\nI know just enough about Roman history to appreciate how much they got right\nabout the spirit of the time. They made a lot of creative decisions sure. They\nchanged a lot of characters to make them more salacious, like Atia who iirc was\nknown for being pretty dignified irl. They used Octavia…",
  "data/reddit-ask/r/AskHistorians/comments/odx656/how_were_languages_translated_for_the_first_time.json": "Throughout history, especially during the Age of Exploration, there must have\nbeen plenty of times when two peoples met each other for the first time, and\nwhose languages had never been translated to each other. How did scholars or\nordinary citizens from both peoples go about understanding each…",
  "data/reddit-ask/r/AskHistorians/comments/oe0d6u/the_us_has_been_known_as_the_world_police_but_has.json": "For example, I've read one of the reasons South Africa pursued a nuclear weapons\nprogram was to stave off an invasion from other countries for upholding\napartheid, so when they ended apartheid, they likewise gave up nuclear weapons,\nthe only nation known to have done that.",
  "data/reddit-ask/r/AskHistorians/comments/oe3a9e/why_was_britain_seemingly_reluctant_to_outlaw_or.json": "Mercury soaked hats, arsenic (french green) dyed gowns, and the like all had\nproven to be harmful, and even deadly to wearers, but especially to workers who\nmanufactured the garments.\n\nMost wealthy nations where they were made and \"enjoyed\" outlawed the use of\nthese toxic chemicals in garment…",
  "data/reddit-ask/r/AskHistorians/comments/oe6nv6/why_is_julius_caesar_the_most_iconic_roman_in.json": "Caesar is clearly the most well-known Roman. If you ask any average person in a\nWestern country if they can name a Roman, they would likely name Caesar, and\nit's also striking that so many leaders from history referred to themselves as\nCaesars — the Prussian and Austrian Kaisers, Russian Tzars, I…",
  "data/reddit-ask/r/AskHistorians/comments/oe9f0v/monday_methods_more_unmarked_indigenous_graves.json": "This translation was collaboratively written by Laura Sánchez and Morgan Lewin (\n/u/aquatermain ), based on this earlier thread\n[https://www.reddit.com/r/AskHistorians/comments/np9lez/who_is_this_child_an_indigenous_history_of_the/]\npertaining to the discovery of a mass grave in the grounds of a…",
  "data/reddit-ask/r/AskHistorians/comments/oebj5c/is_it_true_that_the_trend_of_women_give_birth.json": "Thank you.",
  "data/reddit-ask/r/AskHistorians/comments/oekyc8/i_speak_modern_beijing_dialect_chinese_how_far.json": "By \"mutually unintelligible\", I mean that neither me nor the citizens of old\nBeijing could understand each other, even in a very weak form like Czech and\nPolish in modernity",
  "data/reddit-ask/r/AskHistorians/comments/oeolbg/how_likely_was_it_that_julius_caesar_was_not_the.json": "In Robert Garland's course \"Greece & Rome: An Integrated History of the Ancient\nMediterranean\", he mentions that there were doubts Caesarion was really his son\nwith Cleopatra as he was quote, \"likely already infertile at this point.\" Why\nwould historians assume Caesar was potentially infertile? He…",
  "data/reddit-ask/r/AskHistorians/comments/oerxvp/what_is_the_origin_of_the_square_caps_worn_for.json": "I often see the claim spread online that a Quran was placed on the flat top upon\ngraduation by scholars in Al-Andalus. However, I failed to find any sources for\nthis. Is there any truth to that popular myth? If so, does the square cap\npredate this practice?",
  "data/reddit-ask/r/AskHistorians/comments/oevba6/im_part_of_a_roman_family_in_12_bc_and_we_just.json": "I have a 9 month old and her ability to sleep through the night is probably the\nmost important thing in my life right now. Sleep training is common practice now\nand widely accepted, but was that always the case?\n\nI'm curious about Roman times. What were the expectations? Was it different for\nwealthy…",
  "data/reddit-ask/r/AskHistorians/comments/oexds6/i_recently_attended_a_discussion_about_how_native.json": "The panel called for us to turn against modern capitalism and reestablish the\ngift-giving ways of the indigenous people.",
  "data/reddit-ask/r/AskHistorians/comments/of0nk3/how_significant_was_the_uss_role_in_the_overthrow.json": "I’m from Argentina, and it’s a pretty well establish fact the military Junta\nthat terrorized our country in the 70’s had US support. I also read a little\nabout Operation Condor and the US’s involvement in Chile. Some sources argue\nthat US involvement was inconsequential and simply sped up a process…",
  "data/reddit-ask/r/AskHistorians/comments/of98iv/just_started_watching_downton_abbey_can_someone.json": "American here. I am eight episodes in and enjoying it, but I'll be danged if I\ncan say exactly what these people DO, or how they maintain an estate that huge.\n\nThe servants work to make money. Farmers farm. Royalty...does royalty things,\ngenerally rules. I understand all of that, at least enough so…",
  "data/reddit-ask/r/AskHistorians/comments/ofm2b1/clarifying_the_origin_of_a_survey_advertised_on.json": "Last night it came to our attention that an ad with the title, \"Use\nr/AskHistorians [/r/AskHistorians]? Win $100 for taking our 5 minute survey on\nhow to improve the subreddit\" was being promoted in our community. We want to\nclarify that we are not affiliated with the survey.\n\nWhile we have…",
  "data/reddit-ask/r/AskHistorians/comments/ofq01t/how_did_romans_feel_about_masturbation.json": "Were there any taboos surrounding it, was it viewed differently for men and\nwomen, was it done in private, in public?\n\nI've read a lot about Roman sexual norms but can't recall hearing anything about\ndoing the ol five knuckle shuffle.",
  "data/reddit-ask/r/AskHistorians/comments/og11fn/why_does_the_american_revolution_seem_so_much.json": "I’m working my way through Mike Duncan’s Revolutions podcast series, and I’m\nstruck by the amount of infighting, purges, coups, countercoups and\ninsurrections that seem to characterize almost every revolution covered in the\nseries, except for the American Revolution, which seems to have gone…",
  "data/reddit-ask/r/AskHistorians/comments/og1p88/why_were_west_african_blacksmiths_so_resistant_to.json": "Here’s what I understand about the West African smithing tradition. West Africa\ninvented ironworking for themselves, but their art seems to have stayed\nremarkably the same for millenia. Metalworking was regarded as magical, and only\ncertain clans did it. As a result, smiths never made maille armor…",
  "data/reddit-ask/r/AskHistorians/comments/og7p07/weimar_germany_had_laws_against_hate_speech.json": "Much of what I said can be found in this post\n[https://www.thefire.org/eric-berkowitzs-new-book-dangerous-ideas-is-a-masterpiece-but-i-have-some-quibbles/]\nby Greg Lukianoff, a co-author of the book The Coddling of the American Mind.\n\nIn this article, seems that Lukianoff is using this incident -…",
  "data/reddit-ask/r/AskHistorians/comments/oga0h5/the_slogan_they_cant_lick_our_dick_was_used_in.json": "The slogan existed since at least 1960, as found by Dave here.\n[https://skeptics.stackexchange.com/questions/28350/are-these-real-badges-for-richard-nixons-1972-presidential-campaign]\nHe also quotes a book\n[https://books.google.com/books?id=q8DWAAAAMAAJ&q=%22can%27t+lick+our%22] saying\nthat such…",
  "data/reddit-ask/r/AskHistorians/comments/ogo6kl/during_the_time_of_the_hundred_years_war_13371453.json": "The demography data I was able to come by stems from the Wikipedia page on\nMedieval Demography and the corresponding estimates. I understand that at this\ntime, far from being nationalistic, military matters were somewhat feudal and\nrelied on small professional armies, and that the House of…",
  "data/reddit-ask/r/AskHistorians/comments/ogpjg1/did_allied_powers_make_an_effort_to_humiliate.json": "I recently learned that efforts were made aboard the USS Missouri to essentially\npour salt in the wounds of the Japanese delegation to make the surrender a\nhumiliating experience. The example that was told to me involved height\nrestrictions of all sailors on the main deck. I was told that sailors on…",
  "data/reddit-ask/r/AskHistorians/comments/ogq5r7/uk_came_out_of_ww2_substantially_weakened_and_was.json": "The human cost of WW2 for UK was by Eastern Front standards, low, they did have\nto spend significant portions of their financial strength to keep the war going,\neventually becoming heavily reliant on US aid, but I have a hard time believing\nUK would spend more percentage of their capital than a…",
  "data/reddit-ask/r/AskHistorians/comments/ogw74a/how_did_office_workers_goof_off_before_computers.json": "I'm an American office drone. When I want to take a break from work, I can pull\nup anything on the internet. News, games, social media, etc. How did people goof\noff at the office before computers were common? If you want more focus, we can\nlimit the question to the United States between 1900 and…",
  "data/reddit-ask/r/AskHistorians/comments/ogy1q4/in_medieval_age_how_tavern_owners_protected.json": "I'm asking about taverns located in rural areas like crossroads etc, where \"law\nenforcement\" would be limited or very delayed. If there would be a group of\nbandits (and I guess there was a lot of them), what would stop them from raiding\nthose taverns?",
  "data/reddit-ask/r/AskHistorians/comments/oh18zw/legacy_of_ashes_by_tim_weiner_portrays_the_cia_as.json": "Also, what do academic historians think about the competence of the CIA (leaving\naside the morality of their actions)?",
  "data/reddit-ask/r/AskHistorians/comments/ohcnnu/what_led_to_the_creation_of_the_nordic_model_of.json": "Whenever I read discussions of welfare states by Marxists, they tend to claim\nthat the bourgeoisie of those countries were forced to temporarily put up with\nlower profits to quell the threat of a socialist revolution, as the events in\nRussia had inspired revolutionary communist parties across…",
  "data/reddit-ask/r/AskHistorians/comments/ohgj0w/the_b29_heavy_bomber_project_was_50_more.json": "B-29 program cost 3 billion USD in 1940s money, around 40 billion USD today\nwhile Manhattan stands at 2 billion 1940s USD. I always thought Manhattan\nProject was pretty expensive because well, it clearly created something quite\nextraordinary in immense time pressure and constraints. But just a new…",
  "data/reddit-ask/r/AskHistorians/comments/ohim7v/how_did_disraeli_become_the_first_jewish_prime.json": "From what I've read Jews were only really emancipated in the UK around the\n1830's, and European society remained broadly antisemitic until after WW2. Did\nDisraeli have to overcome a lot of prejudice or was the English political\nestablishment relatively progressive in this regard?\nI'm also curious if…",
  "data/reddit-ask/r/AskHistorians/comments/ohmfcd/why_were_people_not_supposed_to_interact_with_gdr.json": "I was recently watching a video meant for British travellers travelling by car\nfrom Helmstedt to Berlin across East Germany. The video generally explains the\nprocedure for crossing the Soviet and Alied checkpoints and what you should do\nin between, but something I found interesting was the repeated…",
  "data/reddit-ask/r/AskHistorians/comments/ohmjd3/its_often_said_that_ancient_chinese_armies_could.json": "Historical or fictional army sizes are often said to be unrealistically large,\nbut China is sometimes listed as an exception. For example, Bret Devereaux\n[https://acoup.blog/] said that medieval European armies listed as being 100,000\nor more were unrealistic, with a caveat about some Chinese armies…",
  "data/reddit-ask/r/AskHistorians/comments/ohqgp8/the_level_of_physical_activity_among.json": "Are there surviving accounts of how much these agricultural workers ate? What\nwere they eating? Pounds and pounds of rice, bread, cornmeal, or potatoes? Did\nthey have access to sources of concentrated calories like oil, nuts, lard, etc?",
  "data/reddit-ask/r/AskHistorians/comments/ohs6g2/what_actually_is_critical_race_theory.json": "Not something I encountered very much in my undergraduate education though I\nheard the term sometimes. I was wondering if one of the academic types here\ncould give me like the standard definition if one exists. Thanks.",
  "data/reddit-ask/r/AskHistorians/comments/ohuy68/what_is_the_deal_with_the_weird_style_in_which.json": "As I watch Snow White and the Seven Dwarfs with my kid I'm struck by how unusual\nthe style of singing is that Snow White uses (particularly during the \"Some Day\nMy Prince Will Come\" song).\n\nThis style of singing is one of the two things that catches my wife and I off\nguard as we watch it with her,…",
  "data/reddit-ask/r/AskHistorians/comments/ohvbl0/why_did_men_become_royal_marines_officers_during.json": "From what I have seen promotion for Royal Marines officers was rather slow, and\nthe highest rank they could usually attain was Colonel . In which case why\ndidn't they join the Navy or Army? Promotion especially in times of war was much\nfaster in the other branches and they had the chance to become…",
  "data/reddit-ask/r/AskHistorians/comments/ohz2rz/both_india_and_pakistan_gained_independence_on.json": "India also scores higher on many other metrics such as quality of life, GDP per\ncapita. What could explain this?",
  "data/reddit-ask/r/AskHistorians/comments/oi3x16/how_did_university_students_take_notes_during.json": "Or is note-taking a relatively new occurrence in the history of academia?",
  "data/reddit-ask/r/AskHistorians/comments/oihoha/how_many_wealthy_russians_escaped_in_1917_and_at.json": "I am aware that the Czar and his ministers (as the 'Stones so helpful remind me)\ndidn't fare so well, but I am interested in the broad class of Petrograd\nbankers, royal 3rd cousins, and general cocktail-party types. I assume these\nmade up the core of what was later called \"White Emigres\", but did…",
  "data/reddit-ask/r/AskHistorians/comments/oiot1x/what_kind_of_swimming_stroke_or_style_did_the.json": "It is documented that river swimming was a popular leisure activity in parts of\nthe empire, not to mention the famous baths. Legionaries were also taught to\nswim during their training. But, do we know anything of their swimming\ntechnique?",
  "data/reddit-ask/r/AskHistorians/comments/oir9sy/ama_we_are_the_staff_from_menokin_a_national.json": "Introduction: We are the staff of Menokin - a historic ruin located in\nVirginia's rural Northern Neck. Menokin, the home of Francis Lightfoot Lee (a\nsigner of the Declaration of Independence) is a National Historic Landmark, and,\nlike our country, built on the contradictions of slavery. Menokin is…",
  "data/reddit-ask/r/AskHistorians/comments/oiryai/sometimes_when_i_read_about_aztec_people_they.json": "I've heard that sometimes people had the name of the day they were born, for\nexample 15 Water would have been born in the 15th day of the month called Water\n\nBut then why did some people have names based on the calendar and others didn't?\n\nToday in Mexico there are many people with aztec names like…",
  "data/reddit-ask/r/AskHistorians/comments/ois772/how_thirsty_were_the_ancient_greek_olympics.json": "Title, basically. Did spectators go (in part) to get a kick out of watching\nnaked young athletes all day? Were sexual encounters between athletes and/or\nspectators common?",
  "data/reddit-ask/r/AskHistorians/comments/oj89l3/when_did_the_fivepointed_star_become_the_default.json": "Recently, I was looking at illustrations of the night sky and the zodiac in\nAlexander Roob's Alchemy and Mysticism. The drawings are from the 14th-17th\ncenturies, and I noticed that nearly every depiction of a star was six-pointed,\neven those not used in a religious context.\n\nArguably, in modern…",
  "data/reddit-ask/r/AskHistorians/comments/ojd338/reportedly_the_renowned_polymath_cb_fry_was.json": "Here's the source\n[https://www.historic-uk.com/HistoryUK/HistoryofEngland/CB-Fry/] of this story,\nwhich goes into detail about Fry's life as a cricketer, footballer, all-round\nathlete, aspiring politician, journalist, and speechwriter.",
  "data/reddit-ask/r/AskHistorians/comments/ojg8ys/a_four_year_term_as_president_of_the_united.json": "Did Presidents do less back then? Delegate more? Did they have unique sources of\ninformation or lines of communication? I realize I'm talking about a really\nbroad swath of time here, so I'll take what I can get.",
  "data/reddit-ask/r/AskHistorians/comments/ojhtxe/in_1864_the_confederate_states_secretly_offered.json": "It is by now common knowledge that the underlying cause of Confederate secession\nwas the South's wish to preserve slavery. But from the very start of the Civil\nWar, slavery was one of the main obstacles to the Confederacy's efforts to\nsecure diplomatic recognition from European powers.\n\nIn 1864, as…",
  "data/reddit-ask/r/AskHistorians/comments/ojqze8/i_have_no_access_to_a_university_so_how_can_i.json": "I am 24 years old guy from Somalia, I always wanted to became historian\nunfortunately, I got scholarship of computer science cause my parents could\nafford my tuition, so now I have career but in my spare time I like to learn\nmore about history\n\nmy problem is I jump back and forth on my own without…",
  "data/reddit-ask/r/AskHistorians/comments/ok1xvv/what_lead_to_the_christian_bible_being_placed_in.json": "How did such a practice become so ubitiquious in the United States? While I’m\naware the country has deep Christian roots and origins, the US is still very\nculturally diverse from state to state. And yet, in almost every hotel across\nthe country one can find a Bible in the bedside table. How did a…",
  "data/reddit-ask/r/AskHistorians/comments/ok2sgk/was_there_concern_about_star_trek_the_original.json": "We've all heard stories about (supposedly) the first TV kiss between a black\nlady and a white man. But I wonder about the show in general. It portrays future\nhumanity as a utopian society with few internal conflicts. Money is regarded as\nan anachronism, there's a Russian high-ranking officer on…",
  "data/reddit-ask/r/AskHistorians/comments/ok3u29/when_how_and_why_did_people_in_portugal_start.json": "So I’m going off an assumption that in the 12th century, cousins Alfonso VII of\nLeon and Alfonso I of Portugal both spoke the same language and general dialect,\nand that the language divide happened later over time. And my question I guess\nis kind of just “why?”\n\nSeemingly they wouldn’t have been…",
  "data/reddit-ask/r/AskHistorians/comments/ok4yyd/im_a_norse_jarl_i_want_to_raid_and_pillage_some.json": "So, its 867 and I’m itching to acquire some thralls, and some wealth overall for\nmy village. I want to visit this exotic land of England. How many guys am I\nbringing with me to make this journey? What kind of resistance am I\nanticipating? (Assume I’m avoiding the Great Heathen Army and I’m not apart…",
  "data/reddit-ask/r/AskHistorians/comments/ok646f/why_analyzing_myths_is_bad_history.json": "I’ve heard before that attempting to analyze myths from various groups to form\nconnections between different cultures, attribute them to prehistoric events,\netc. is generally considered bad history.\n\nI was wondering if someone could provide a summary of the current thinking on\nthis or good reading…",
  "data/reddit-ask/r/AskHistorians/comments/okch5e/im_a_rich_4th_century_roman_and_ive_decided_to.json": "Do I have to stop beating and sexually abusing my slaves? Stop going to the\nColiseum? Or is that all still quite acceptable? (Or for that matter, something\nthat by this time pagan aristocrats don't do either.) Those are two more\ncolourful examples, but what else might change? Diet, day-to-day…",
  "data/reddit-ask/r/AskHistorians/comments/okm8v0/how_did_sending_letters_work_in_ancient_rome_was.json": "I'm reading SPQR, and it mentions how Cicero would send letters from Cilicia\nback home to Rome. I'm so curious about the logistics how the letters went from\npoint A to point B and was delivered to the right place accurately",
  "data/reddit-ask/r/AskHistorians/comments/oko2d3/how_survivable_was_the_frontline_of_a_medieval.json": "I sometimes read about medieval battles in which armies of thousands marched at\neach other and think about what it must have felt like for those at the fronts\nof each side. In films and television, we're conditioned to regularly see our\nheroes fighting on the frontlines and surviving (especially…",
  "data/reddit-ask/r/AskHistorians/comments/okxx12/hesiod_tells_us_of_atalanta_a_fast_female_runner.json": "\"Atalanta, swift of foot, beaming eyes who rejected her equals, avoided marriage\nwith men who eat bread\" — Petrie Papyri (ed. Mahaffy), Pl. III. 3:\n\nI know athletes ate an unusual amount of meat in Ancient Greece and Rome. But I\ndoubt many ate no bread.\n\nWhat did she mean about rejecting her equals?…",
  "data/reddit-ask/r/AskHistorians/comments/olh568/did_the_japanese_government_really_plan_to_create.json": "In his book \"The Fugu Plan: The Untold Story of the Japanese and the Jews During\nWorld War II,\" Marvin Tokayer claims that Japanese people exposed to the\nProtocols of the Elders of Zion believed the anti-Semitic propaganda, but\ninterpreted it positively. They thought that, if Jewish people were…",
  "data/reddit-ask/r/AskHistorians/comments/olhhzh/in_desmond_sewards_the_hundred_years_war_the.json": "Does this word carry the same historical connotation as \"slutty\" or \"Was a\nslut\"?\n\nI've also looked up the word and apparently there is an archaic definition\nmeaning having low standards of cleanliness, e.g. \"dust left on the floor by a\nsluttish servant\".\n\nWhich meaning was the author likely going…",
  "data/reddit-ask/r/AskHistorians/comments/oliq5y/great_britain_officially_lost_the_american.json": "Did they put up a lot of structures and rules for settler colonies for Australia\nand New Zealand to limit their independent government?",
  "data/reddit-ask/r/AskHistorians/comments/olnn3k/when_and_why_did_boomers_stop_being_leftist.json": "something i’ve been wondering for awhile",
  "data/reddit-ask/r/AskHistorians/comments/olzwa1/how_can_i_prove_to_my_girlfriends_dad_the.json": "I am currently on vacation with my girlfriend’s family and her dad has always\nbeen a bit extreme. For stories sake I will call him Bill. Bill is very\nintelligent and spends most of his time studying history in the Middle East.\n\nTonight we checked into a new Airbnb and I found a stack of DVDs in the…",
  "data/reddit-ask/r/AskHistorians/comments/om5fhf/barbara_bush_spoke_about_her_support_for_abortion.json": "It looks like many of her views and causes she cared for are quite different\nfrom that of many/most of today's Republicans from what I know about American\npolitics (disclaimer: not American). Or maybe even her family. These issues must\nhave been controversial as well at the time. What informed her…",
  "data/reddit-ask/r/AskHistorians/comments/omc8oc/the_wikipedia_article_on_puyi_says_that_the.json": "Are there any extant photos of eunuchs wearing these jars?",
  "data/reddit-ask/r/AskHistorians/comments/omewir/would_people_have_gone_to_the_beach_in_medieval.json": "With all the warm weather and increased beach visits recently it got me\nthinking. Did people go to the beach for leisure in the medieval times? If they\ndid was this something that was limited to a certain class of people? I don’t\nknow if peasants for example had much leisure time. And what sort of…",
  "data/reddit-ask/r/AskHistorians/comments/omqvox/watching_deadwood_and_the_episode_in_which.json": "So, I did a quick Google and learned that stagecoaches traveled at around 10mph.\nHis wife and son were somewhere in Michigan, to calculate I assumed they caught\na ride in Chicago, since it's pretty close to the border of Illinois and\nMichigan and was the last major metropolitan hub before entering…",
  "data/reddit-ask/r/AskHistorians/comments/omr6bj/what_is_the_psychology_behind_the_holocaust.json": "Please, I want to highlight that I am not a denier here.\n\nI like to look into different sides of the argument as people and I learned that\nhow history is taught is also what it is written and interpreted.\n\nNow the evidence that we have (from what I have gathered) of the existence of\nthe Holocaust…",
  "data/reddit-ask/r/AskHistorians/comments/on6fxz/during_the_jersey_shore_shark_attacks_of_1916.json": "Currently, there are on average over 30 shark attacks a year in the United\nStates, with about one death every two years. These numbers were almost\ncertainly lower over 100 years ago, but there's no way that there were no shark\nattacks in the years before 1916. Why was a shark attack thought of as…",
  "data/reddit-ask/r/AskHistorians/comments/ondszw/theres_a_meme_going_around_alleging_that_there.json": "A popular meme [https://himbofisher.tumblr.com/post/656998028944850945] being\npassed around right now states the following:\n\n\"The samurai were officially abolished as a caste in Japanese society during the\nMeiji Restoration in 1867\n\n\"The first ever fax machine, the ''printing telegraph,' was…",
  "data/reddit-ask/r/AskHistorians/comments/onejoj/a_common_question_on_this_sub_asks_who_was.json": "Obviously those three are way more complex than the best parts of their legacy,\nbut what they stood for was selflessness, freedom, equality, and nonviolence.\nWho embodied those ideals up to say, the early 20th century? Jesus? St. Francis\nof Assissi?",
  "data/reddit-ask/r/AskHistorians/comments/onhimb/how_accurate_is_slavoj_žižeks_recent_defense_of.json": "On a recent appearance on The Jacobin Show [https://youtu.be/y9mXHUB7ocI] in\ncelebration of Bastille day, the philosopher Slavoj Žižek defended the legacy of\nthe French Revolution, particularly the radical side of it under the leadership\nof Montagnards such as Robespierre and Saint-Just. Žizek…",
  "data/reddit-ask/r/AskHistorians/comments/onyb2d/meta_why_are_so_many_questions_here_so_specific.json": "Not sure if this is allowed to ask here but I'm genuinely curious: I've visited\nthis sub a few times in the last year or so and the questions seem to be\nbecoming increasingly specific, i.e. focused on a very tiny fragment of history,\noften something you have never thought about. This is of course…",
  "data/reddit-ask/r/AskHistorians/comments/oo1dcz/why_was_the_late_roman_army_so_small_the_numbers.json": "Note that I'm talking about the Roman Empire before the fall of the Western\nhalf. This is also a more general version of my previous question regarding the\nBattle of Adrianople\n[https://www.reddit.com/r/AskHistorians/comments/onkn56/why_did_valens_field_such_a_small_army_at_the/].\nI'm also aware…",
  "data/reddit-ask/r/AskHistorians/comments/oo7wx5/matthias_corvinus_wikipedia_page_says_his_mom_was.json": "I’d just like some clarifying info. Bed-wetting sounds like a reason you can’t\ngo off to war, not oversee your sons’ education. So yeah any details would be\nnice.",
  "data/reddit-ask/r/AskHistorians/comments/oofumo/i_recently_learned_of_joseph_stalins_string_of.json": "I had never read of Stalin's time in exile with such detail until recently, nor\ndid I realize he has (likely quite a few, and definitely one proved by a DNA\ntest) direct descendants living to this day.\n\nI would be quite curious to learn a bit more about marriageable age and thoughts\naround consent…",
  "data/reddit-ask/r/AskHistorians/comments/oonglp/what_does_it_mean_to_found_a_city.json": "I've often heard that Alexander \"founded\" a number of cities during his\ncampaigns.\n\nWhat exactly does it mean to establish a city? To fortify it and provide it with\nsecurity and governance? To build residential housing for Greek settlers?\nPresumably the markets, factories, guilds etc. in the cities…",
  "data/reddit-ask/r/AskHistorians/comments/ooqaz3/was_homers_odysseus_a_representation_of_a_distant.json": "Jeffrey P. Emanuel from Harvard University thinks so.\n\n> Odysseus’ declaration that he led nine successful maritime raids prior to the\n> Trojan War; his description of a similar, though ill–fated, assault on Egypt;\n> and his claim not only of having been spared in the wake of the Egyptian raid,\n>…",
  "data/reddit-ask/r/AskHistorians/comments/ooxrjd/i_recently_learned_that_the_philippines_is_named.json": "What did the people of the Philippines islands call themselves before the\nspanish colonization? I imagine they did not see themselves as one people and\nhad miltiple names. Was there an attempt after independence from spain 1898 or\nlater america 1945 by nationalists to rename their country after…",
  "data/reddit-ask/r/AskHistorians/comments/ooy0si/the_high_priest_of_jupiter_was_not_permitted_to.json": "Also, bonus question: is this actually true? I can find lots of references to\nthese restrictions online but can't find any primary sources.",
  "data/reddit-ask/r/AskHistorians/comments/op1p6e/why_are_the_caucasus_so_incredibly_diverse.json": "Apparently in the region of the Caucasus mountains there are at least 50 notable\nethnic groups with considerable differences between each other in terms of\nthings like religion, language and customs.\n\nThe linguistic diversity seems particularly pronounced with dozens of languages\nand dialects spoken…",
  "data/reddit-ask/r/AskHistorians/comments/op8s2m/where_did_office_workers_in_the_19th_century_go.json": "So I'm reading a lot of Dickens at the moment, and one thing that stands out is\nthe amount of office work that is done by main characters. However, one thing\nthat's bugging me is the lack of toilets or commentary on sanitary habits. Did\noffice workers in the 19th Century just go \"excuse me boss I…",
  "data/reddit-ask/r/AskHistorians/comments/opa6fd/what_were_the_biggest_driving_factors_behind_the.json": "I've read that climate change was one of the biggest factors, but a recent\nthread also brought up the growth in power of coastal regions over inland\nempires as one possible reason too.",
  "data/reddit-ask/r/AskHistorians/comments/opeen0/romes_origin_story_of_a_town_founded_by_criminals.json": "I would like to ask especially in the case of the titular Romulus, who was\nsupposed to have killed his own brother in the process of the building of Rome.",
  "data/reddit-ask/r/AskHistorians/comments/ophb3r/the_year_is_1050_ad_and_im_a_decently_well_off.json": "For clarification, as I understand it at this point the majority of people\nliving around Uppsala, where the old temple was, were still pagan. Not much\nfurther south, however, the majority were Christians, and only a minority held\non to the old gods; I belong to that pagan minority. If I’m mistaken,…",
  "data/reddit-ask/r/AskHistorians/comments/opk002/people_say_they_want_historically_accurate.json": "How common was rape and child sex in Europe during the Middle Ages?\n\nIn a discussion regarding George R.R. Martin's work, the dubious claim was made\nthat the seemingly excessive and gratuitous rape scenes were to paint a\nhistorically accurate picture of medieval times.\n\nWas the average woman or…",
  "data/reddit-ask/r/AskHistorians/comments/opql2t/on_his_2000_album_the_marshall_mathers_lp_eminem.json": "The chorus famously asks for the real Slim Shady:\n\n> I'm Slim Shady, yes I'm the real Shady\n> \n> All you other Slim Shadys are just imitating\n> \n> So won't the real Slim Shady please stand up\n> \n> Please stand up, please stand up?\n\nThis was accompanied by his music video that featured dozens of…",
  "data/reddit-ask/r/AskHistorians/comments/opstg6/its_1945_im_a_japanese_kamikaze_pilot_sitting_in.json": "I'm a Japanese university student. I speak three languages and identify as a\npolitical liberal. I personally think the entire war is bullshit. I had hoped to\njust wait out the war in college. Unfortunately, my number came up. Through a\nseries of unfortunate events, I was effectively \"volunteered\" to…",
  "data/reddit-ask/r/AskHistorians/comments/opx32l/how_many_women_ended_up_in_prostitution_in.json": "Pre-covid I visited Italy and toured many ruins, and one thing that stuck out\nwas how many brothels there were. I went in one in Pompeii, and it was big. I\nthink there were 15-20 “rooms” in it. I’ve also read texts that talk about how\nprevalent it was. But this made me wonder, how many people were…",
  "data/reddit-ask/r/AskHistorians/comments/opzw2r/either_travel_to_the_dirty_crowded_city_to_work.json": "I've read [https://eh.net/encyclopedia/hours-of-work-in-u-s-history/] that\nfactory workers in the US often worked 70 + hour weeks in the 1800s. And when\nthey weren't working, they lived in cities with polluted air in crowded\ntenements. Their traditional life on the farm often wasn't viable anymore…",
  "data/reddit-ask/r/AskHistorians/comments/oq1j41/american_politics_are_extremely_polarized_with.json": "Thanks for your help",
  "data/reddit-ask/r/AskHistorians/comments/oq2o1w/what_is_the_current_state_of_jesus_mythicism.json": "The \"Jesus myth theory\", that is to say the thesis that Jesus was either not a\nreal historical figure, or if one not connected to Christianity, is certainly\nnot a new idea. However I understand that this theory has had its ups and lows\nin terms of credibility during the last century. Is there a…",
  "data/reddit-ask/r/AskHistorians/comments/oq6uqx/why_did_so_many_nations_choose_to_intervene_in.json": "I recently stumbled across the Angolan civil war of '74-'02, and it's morbidly\nfascinating.\n\nAlthough the Cold War pretty much defines ugly great-power proxy conflict, the\nAngolans seem to have been particularly 'blessed' with international attention.\n\nOver ten thousand South African, Cuban, and…",
  "data/reddit-ask/r/AskHistorians/comments/oqg4hi/disagreements_between_the_citizenry_have_caused.json": "In short, I'd like to learn how social groups of one country were so far apart\non serious issues, but instead of ending up with violence, they eventually\nworked out a solution over time.\n\nSpecial thanks to the mods for helping me tailor the topic so that it stays\nwithin the rules! Apologies for the…",
  "data/reddit-ask/r/AskHistorians/comments/oqpmi0/in_the_first_season_of_the_sopranos_one_of_the.json": "Tried not to give spoilers, but it's a 20 year old show's first season, so I\nthink it's not a big deal. But this little storyline had me confused. Was this\nsomething specific to mafia culture? Italian culture? American culture in\ngeneral?",
  "data/reddit-ask/r/AskHistorians/comments/oqq2ql/what_exactly_was_an_archduchy.json": "Austria referred to itself as an archduchy rather than just a duchy, or a\nkingdom or anything else. Is there a difference between a duchy and an\narchduchy? Or between a grand duchy and an archduchy? If not, why the special\nname?",
  "data/reddit-ask/r/AskHistorians/comments/oqqn84/did_peasants_know_who_their_rulers_were_in.json": "I was watching Monty Python and the Holy Grail and the scene where the peasants\nsay they didn't know who the King was got me thinking. Did peasants in medieval\nEurope know who their rulers were?\n\nIn such large kingdoms and Empires, would peasants living outside of cities have\nany knowledge of the…",
  "data/reddit-ask/r/AskHistorians/comments/oqsbbn/what_were_the_major_problems_in_preislamic_arab.json": "What I find striking about the rise and spread of Islam in the Arabian\nPeninsula, and to a lesser degree in the rest of the Middle East and North\nAfrica, is how incredibly fast and thorough it was. Historical commentary from\nWesterners post-9/11 would have me believe that this was due to a…",
  "data/reddit-ask/r/AskHistorians/comments/or1qhi/how_to_date_in_the_medieval_age.json": "I’m a peasant woman in my early twenties living in France/Germany/England in the\nmedieval age. There’s a really cute guy I’ve seen at Sunday mass that has caught\nmy attention, and I think I’ve caught his. What would a (first) date(s) look\nlike? Would I have to be accompanied by a trusted female…",
  "data/reddit-ask/r/AskHistorians/comments/or3ond/was_there_fan_fiction_or_offbrand_knockoffs_of.json": "For example, did other people write stories using Dickens's characters for\neither private or commercial use? Were his characters used, without his\npermission, as mascots for advertisements? Or what about derivative works such\nas stage plays? I know that illiterate people used to pay for someone else…",
  "data/reddit-ask/r/AskHistorians/comments/or3rup/in_ancient_greece_did_unmarried_pregnant_women.json": "With the number of demigod characters in Greek mythology, I'm wondering if any\nreal women claimed gods to be the fathers of their children. Also, would single\nmotherhood be frowned upon in the first place?",
  "data/reddit-ask/r/AskHistorians/comments/orh231/wikipedia_says_forced_and_mostly_public_anilingus.json": "The relevant quote from the Anilingus article,\nhttps://en.wikipedia.org/wiki/Anilingus: \"Forced and mostly public anilingus was\nused as a form of humiliation and punishment, usually of prisoners. The use of\nthe practice in the Thirty Years' War was described by Grimmelshausen in\nSimplicius…",
  "data/reddit-ask/r/AskHistorians/comments/orjjh0/i_randomly_came_across_hundreds_of_newspaper.json": "I started out clipping each one I found, but I soon realized there were\nliterally more than a hundred of them just between 1818 and 1910. They range\nfrom just a few lines to accounts that read like sworn depositions. I chucked\nthem all into an album here. https://imgur.com/a/GyaD4oU\n\nThis one was so…",
  "data/reddit-ask/r/AskHistorians/comments/ors1rn/im_closing_a_ten_year_old_internet_forum_are.json": "I hope this doesn't violate the rules, but I'm not sure who to ask about this.\nIt is a question directed at historians.\n\nI'm planning to close a web forum I made ten years ago. Am I supposed to\npreserve it somehow as part of internet history? I'm not saying I consider it\nsuper important to…",
  "data/reddit-ask/r/AskHistorians/comments/ortpxl/my_town_is_sacked_the_population_decimated_can_i.json": "I'll give a specific example, as I'm sure this varied from time-to-time and\nplace-to-place. Say I'm a villager at a neighboring hamlet, and a town nearby is\nsacked during the Hundred Years' War. The population is decimated, but many\nhouses are still there in working condition with no one living…",
  "data/reddit-ask/r/AskHistorians/comments/orvf7r/trying_to_find_a_british_sea_dragon_cult.json": "This is perhaps the most vague and unhelpful description of anything ever, but I\nstrongly, distinctly remember reading this in one of my many history/cultural\nbooks as a child. A single, tantalizing sentence, paraphrased from memory:\n\n“In Britain, a tiny cult worshipping a ‘sea dragon’ survived into…",
  "data/reddit-ask/r/AskHistorians/comments/orxwmh/monday_methods_a_shooting_in_sarajevo_the.json": "The First World War. World War I. The Seminal Tragedy. The Great War. The War to\nEnd All Wars.\n\nIn popular history narratives of the conflict with those names, it is not\nuncommon for writers or documentary-makers to utilise cliche metaphors or\ndramatic phrases to underscore the sheer scale,…",
  "data/reddit-ask/r/AskHistorians/comments/oryl45/when_and_why_did_homeowning_americans_start_to.json": "Lawn care is often a hot topic of discussion, given the environmental impact of\npesticides and fertilizers, and given looming water shortages. I am curious how\nthe image of the ideal American lawn came to exist in the first place.\n\nAlso, what did lawns look like before this ideal image become the…",
  "data/reddit-ask/r/AskHistorians/comments/os3neb/america_seems_to_have_an_obsession_with_its_own.json": "For example, before Rome reached its heyday, was there any prevailing idea that\nthey were actually on the decline? Did any Chinese dynasties know they were\nabout to meet their end as they began to decline?",
  "data/reddit-ask/r/AskHistorians/comments/oshw2l/why_is_egyptology_treated_as_a_corpus_of.json": "Hi! So, my question could be stated in 2 parts, I believe a) is Egyptology the\nsame as Archaeology of Egypt or not? b) why is there Egyptology and not\nChinaology or Mayanology or Indianology (if that makes sense)? Sorry for any\nmistakes in writing, not a native speaker here. Thank you in advance for…",
  "data/reddit-ask/r/AskHistorians/comments/oskq1o/considering_the_competition_between_islam_and.json": "I would think this would be a major difference and would have been used as a way\nof defining the \"other\"\n\nI'm assuming the language of the the Muslims in contact with Europe was Arabic\n\n\n\nNote: Re-posted after minor changes",
  "data/reddit-ask/r/AskHistorians/comments/oslywf/in_1968_one_of_the_worlds_first_successful_heart.json": "Edit: Haupt was \"coloured\" not \"black\", a very important difference explained in\nan answer by u/khosikulu [/u/khosikulu] below\n\nI found very little information on the Clive Haupt, only that he was a 24 year\nold \"a coloured man who had collapsed on a Cape Town beach the day before\"\naccording to…",
  "data/reddit-ask/r/AskHistorians/comments/osqluo/what_did_the_incas_mayans_and_aztecs_think_of.json": "Were the Incas aware of the civilizations in Mesoamerica and they did have\ndiplomatic contact with each other? What were the differences in their military\nand cultural traditions, and how did they react to these differences? Did the\nAztecs or any Mesoamerican state try to expand to South America or…",
  "data/reddit-ask/r/AskHistorians/comments/ot4lgs/did_the_nazi_state_ever_draw_an_strategy_on_how.json": "Well, to begin with, this topic always fascinated me, and I’ve never, ever,\nfound anything in regard to that until now. We know, from the Possen Speeches by\nHimmler and Goebbels’s diaries that they (the Nazis) saw their time as being the\n“perfect” one in history in order to do what, in their view,…",
  "data/reddit-ask/r/AskHistorians/comments/ot7rpv/when_i_was_a_high_school_student_in_one_of_my.json": "The story was that a Jewish merchant in Nazi Germany who was posing as non-Jews\nGermans, decided to take his family to safety in a rural place. He asks his\nchildren to inform everyone in their schools that they were going for a vacation\nin France. After some days, every person they knew, thought…",
  "data/reddit-ask/r/AskHistorians/comments/otdjle/how_many_shirts_would_the_average_person_own_in.json": "How many shirts would the average person own in the 1870s American West? How\nmany pairs of boots? Or pants? I’m very interested in knowing how many items\nthey owned.\n\nAnd, when travelling for a few weeks/months, would they just take everything\nwith them?",
  "data/reddit-ask/r/AskHistorians/comments/otrl55/did_the_ancient_egyptian_pharaoh_masturbate_into.json": "A factoid I often hear repeated on Reddit is that an ancient Egyptian ritual\ninvolved the Pharaoh publicly masturbating into the Nile River. Some variations\neven recount that all the men at the festival would simultaneously ejaculate\ninto the Nile.\n\nWhile it’s true that ancient Egyptian mythology…",
  "data/reddit-ask/r/AskHistorians/comments/otry75/why_did_swords_become_so_emblematic_of_warriors.json": "It’s seems almost universal that the warrior/soldier and the sword are\nemblematic of each other and a lot of world cultures hold the sword in high,\nalmost mythical, esteem.\n\nThis seems a little odd to me since, from what I understand, the sword is\nprimarily a side arm and weapons like bows, spears…",
  "data/reddit-ask/r/AskHistorians/comments/otv8p5/how_could_people_fight_in_armor_during_summer_in.json": "I live in the south of Italy in Brindisi, Apulia. In this hot day of july I was\nwalking In my town and I passed by the Swabian Castle built by Fredrick II of\nSwabia and then I thought came trough my mind : How could people of that age\nmanage to fight in armour during summer when I am struggling with…",
  "data/reddit-ask/r/AskHistorians/comments/otxpx2/eanasir_famously_tried_to_sell_subpar_copper.json": "The title refers to this instance\n[https://en.wikipedia.org/wiki/Complaint_tablet_to_Ea-nasir]. How was the\nquality of copper and other metals determined in the Ancient Mesopotamia? Were a\nBoard of Trade of some kind to decided the grades?",
  "data/reddit-ask/r/AskHistorians/comments/otz5mm/despite_being_able_small_minority_in_the_us.json": "I realize this question may be flirting with the 20-year-old rule, but I am\nbanking on my assumption that the causes for the over-representation of\nSikh-Americans in the trucking industry began at least 20 years ago.",
  "data/reddit-ask/r/AskHistorians/comments/ouivvt/why_is_the_bible_written_in_such_a_weird_style.json": "I recently rewatched \"Monty Python and the Holy Grail\", and the Holy Hand\nGrenade sequence reminded me of the strange quirks of the Bible texts. Long\nenumerations, very redundant phrases (think Mojo Jojo overexplaining what he\ndoes), and much more. Seems like the Pythons were also aware of these…",
  "data/reddit-ask/r/AskHistorians/comments/oukjw3/a_popular_perception_of_baby_boomers_is_that_they.json": "After all, despite occupying a prominent place in American history books talking\nabout the 1920s, flappers were not a majority. Was this the case with hippies as\nwell? Were most Baby Boomers who voted for Reagan in 1980, already socially\nconservative to begin with? How much did this differ by race…",
  "data/reddit-ask/r/AskHistorians/comments/outu3p/why_didnt_native_american_tribes_discover_alcohol.json": "So this is one that always left me wondering. Alcohol production is such a\ncommon phenomena that most cultures stumbled on it fairly early. The peoples of\nthe British Isles were known for their love of fermented drink according to\nRoman accounts.\n\nHeck, I’ve seen birds drunk from fermented berries…",
  "data/reddit-ask/r/AskHistorians/comments/oux8ac/for_medieval_peoples_was_wilderness_seen_as.json": "With our modern lens it seems that wilderness is a nice place to take a vacation\nand take pretty pictures, but I'd imagine people from the past might see it as\ndangerous and unforgiving. I'm unaware of any medieval or classical era writing\non the subject. Or from other areas like China or India. I…",
  "data/reddit-ask/r/AskHistorians/comments/ouxeya/why_did_the_lay_or_handedness_of_ropes_change.json": "So, I got in a weird clickhole and read a lot of trivia on IMBD about the Master\nand Commander movie. According to that page, the production had to specially\nmake 27 miles of rope, since modern rope would \"lay\" the opposite way of rope\nfrom the Napoleonic era and look wrong. Why would the standard…",
  "data/reddit-ask/r/AskHistorians/comments/ouy4hh/why_is_it_common_to_hear_older_people_from_former.json": "I suppose the former Soviet states turned EU member states are generally\nexcluded from this as their standard of living has reached a sufficient level\npost-Soviet, but as someone with many friends and acquaintances from countries\nlike Russia, Ukraine, Kazakhstan, I have heard this being expressed…",
  "data/reddit-ask/r/AskHistorians/comments/ov0nmt/why_was_aquitaine_24_times_poorer_than_normandy.json": "In Struggle for Mastery: Britain 1066-1284 Carpenter writes that in 1198\nNormandy brought in 24,000 pounds in revenue while Aquitaine was worth \"perhaps\na thousand or so pounds\". Looking at the map, Aquitaine seems bigger in size and\neven if Normandy was more developed, I can't see why Aquitaine…",
  "data/reddit-ask/r/AskHistorians/comments/ov43s1/during_the_war_of_1812_the_united_states_war.json": "More to the point, why were there no legal, political, or even military\nconsequences for what I would have assumed was an act of treason?",
  "data/reddit-ask/r/AskHistorians/comments/ov4nlr/why_did_cia_not_succeed_in_toppling_cubas.json": "Given the political charge of the question, it's hard to find objective answers\nand I'm reaching out to historians here for some quality discussion.",
  "data/reddit-ask/r/AskWomen/comments/obo1mt/what_are_your_best_tips_for_dealing_with.json": "Hi all the lovely women of reddit. What are your best tips to deal with\nunder-boob sweat given this heat?",
  "data/reddit-ask/r/AskWomen/comments/oboh48/which_subreddit_has_caused_you_to_spend_the_most.json": "Edit: And if you’re comfortable sharing, how much money do you think you’ve\nspent?",
  "data/reddit-ask/r/AskWomen/comments/oc76ju/what_do_you_think_about_people_that_ask_you_to.json": "Do you educate them?",
  "data/reddit-ask/r/AskWomen/comments/ochj6e/what_are_some_safe_places_to_travel_alone_as_a.json": "What are some good countries/places to travel to alone as a women where you felt\nsafe? Or any place you would not recommend?",
  "data/reddit-ask/r/AskWomen/comments/ochm53/what_emotional_labor_do_you_regret_accepting_or.json": "Studies have shown that women do the majority of emotional labor in a\nrelationship. This includes remembering birthdays/anniversaries, arranging\noutings and events, staying in touch with your SO's family, being the peacemaker\nwhen you argue. How did you get there, how did you get out?",
  "data/reddit-ask/r/AskWomen/comments/ocq77g/who_was_the_most_jealous_person_youve_ever_met.json": "Edit: Who is",
  "data/reddit-ask/r/AskWomen/comments/ocuotq/if_you_have_a_good_relationship_with_your_mom.json": "Women who have a good relationship with your mom: What is she like? Additional\nquestions: what did she do to foster the connection between you two, what do you\nadmire about her, and what qualities do you think make a good mom?",
  "data/reddit-ask/r/AskWomen/comments/odcgmb/what_can_someone_dating_someone_who_is_a_victim.json": "I know this could work in r/askreddit [/r/askreddit] but I feel like it will get\nmore attention here.",
  "data/reddit-ask/r/AskWomen/comments/oe5f5q/older_women_of_reddit_what_is_something_you_do.json": "we hear about boomers complaining about younger people , what is something you\nDO like about the younger gen ?",
  "data/reddit-ask/r/AskWomen/comments/oeof4h/therapists_whats_something_a_client_said_that.json": "Ex: If they asked you a certain question, said something they did, etc.",
  "data/reddit-ask/r/AskWomen/comments/oep09r/how_do_you_remind_someone_how_great_they_are_when.json": "When someone is made to feel worthless by the people around them how do you\nremind them they are wonderful?",
  "data/reddit-ask/r/AskWomen/comments/oexfm8/why_do_you_think_there_are_so_few_female_serial.json": "I'm super into true crime and I've always been interested in why female serial\nkillers just seem to be so rare compared to men, I have some ideas but I've been\nwondering what you all might theorize",
  "data/reddit-ask/r/AskWomen/comments/ofdojo/what_is_something_you_enjoy_doing_but.json": "This doesn’t have to be NSFW. It could be a guilty pleasure like eating an\nentire ice cream box by yourself .... I’m just curious",
  "data/reddit-ask/r/AskWomen/comments/ofgbh6/when_was_the_last_time_you_felt_as_though_you.json": "It's hard to make an impact on the whole world but inspiring one child could\nmake a huge lasting difference.",
  "data/reddit-ask/r/AskWomen/comments/oiww6a/how_much_money_would_it_take_to_quit_your_job.json": "If someone offered you x amount to leave/quit, how much would it need to be?",
  "data/reddit-ask/r/AskWomen/comments/okb659/how_often_do_you_cook_each_week.json": "Because after my 4th dinner from scratch i feel exhausted 🤣",
  "data/reddit-ask/r/AskWomen/comments/oku97t/what_are_the_pros_and_cons_of_your_pet_and_what.json": "EDIT: the reason I posted this question is because i'm thinking about getting my\nfirst pet. The answers have warmed my heart so much",
  "data/reddit-ask/r/AskWomen/comments/olbor6/how_would_you_feel_about_an_all_womens_gym.json": "This would not have to be exclusively a female gym, but definitely more geared\ntoward creating a more comfortable space for women to workout.",
  "data/reddit-ask/r/AskWomen/comments/oln9b7/how_is_your_so_not_what_you_thought_you_wanted.json": "I feel like we all have this idea of a perfect partner in our heads. But\nsometimes the person we end up with isn't who we thought we wanted, but exactly\nwho we needed.\n\nIn what ways is your partner not \"perfect\", but perfect for YOU?",
  "data/reddit-ask/r/AskWomen/comments/oly1jt/what_is_your_best_supportive_drunk_women_in.json": "I strongly believe that the most supportive women I've met in my life have been\nthe drunk women I've met in bathrooms (bars, clubs, restaurants...). So, what's\nthe best supportive drunk woman story you have?",
  "data/reddit-ask/r/AskWomen/comments/om86ox/whats_the_trope_you_cant_get_enough_of_in_books.json": "Tropes as enemies to lovers, best friends to lovers, lonely girl/popular boy and\nso on",
  "data/reddit-ask/r/AskWomen/comments/om9lkf/what_is_your_general_experience_trying_to.json": "How do you all go about befriending heterosexual men without having your\nintentions misread? Do any of you have successful, longterm platonique\nfriendships with the opposite gender? Do you guys hang out one on one and does\nit ever cause tensions with your SO?",
  "data/reddit-ask/r/AskWomen/comments/omaxs0/women_who_were_friends_with_the_pretty_girl_how.json": "Did it have impact on your personality? How you present in the world? Your\ninterests? Your mental health? How you think and view others, etc?\n\nEdit: typo",
  "data/reddit-ask/r/AskWomen/comments/omlcv0/ladies_how_much_concern_do_you_really_put_toward.json": "I'm going to preface this by saying that I'm not putting forth any moral\njudgement toward anyone one way or another. It's just, recently, I've been\nthinking about my own body count and how it feels as though society holds women\nto a different standard than men when it comes to how many people we…",
  "data/reddit-ask/r/AskWomen/comments/on1nty/mothers_what_is_the_most_embarrassing_thing_your.json": "Tell the story of what happened and make us laugh.",
  "data/reddit-ask/r/AskWomen/comments/oowg2l/what_disappointment_that_happened_in_your_career.json": "Recently got a job that's delayed my plans to immigrate and it'd be nice to hear\nother stories!",
  "data/reddit-ask/r/AskWomen/comments/opfl1v/faq_update_what_was_your_experience_with_cosmetic.json": "Hello!\n\nGiven the large amount of breast surgery questions we've been getting, we\nthought it's best to catch them all in one post for easier finding! To keep\nthings organized and easier to find, we're gonna have separate top-level\ncomments where you can reply with your experience with…",
  "data/reddit-ask/r/AskWomen/comments/opoeck/women_with_office_jobs_how_do_you_pass_the_time.json": "Especially those days when you finish your work within the first 3 hours and\nhave to find something to do for the remaining 5 hours.",
  "data/reddit-ask/r/AskWomen/comments/opy8vv/what_do_you_do_when_a_man_touches_your_waist_to.json": "I’m not really sure how else to describe it, but you probably know what I mean.\nIt’s become more well-known as of late thanks to Twitter/Instagram/etc.\n\nA guy moving around at a club or party puts his hand on your waist or the small\nof your back as they move by rather than just saying “excuse me I’m…",
  "data/reddit-ask/r/AskWomen/comments/oqog5c/whats_the_strangest_dichotomy_youve_discovered_in.json": "Have you ever met someone who regularly drowned puppies, but also donated all\ntheir time to children with disabilities? Or, have you encountered someone who\nregularly womanized, but also funded a domestic abuse hotline? Maybe someone in\nyour life was a stark, corporate lawyer that also has an…",
  "data/reddit-ask/r/AskWomen/comments/ori86g/women_who_game_what_online_video_game_has_the.json": "I am a man, I hear misogyny/sexism/harassment all the time when playing online\nand a woman is using voice chat, or says they’re a woman. What game, in your\nopinion, has the most positive/welcoming community for women. (Could even list\nbest community per genre ex: FPS, MMO, etc...)",
  "data/reddit-ask/r/AskWomen/comments/orl0h2/do_any_of_you_ladies_come_from_a_more.json": "Did you feel pressure (and if so how did you deal with pressure)? Did you feel\nguilt for \"going against the grain\"? Did you feel regret? Etc.",
  "data/reddit-ask/r/AskWomen/comments/osl3ps/what_is_your_and_your_partner_age.json": "same age or he/she is older or younger",
  "data/reddit-ask/r/AskWomen/comments/ot69d4/what_is_something_you_want_but_feel_youll_never.json": "Could be anything from a family to a new car etc.",
  "data/reddit-ask/r/AskWomen/comments/ot9104/what_do_you_do_when_you_have_to_be_focused_on.json": "Important stuff like thesis, reports, etc.",
  "data/reddit-ask/r/AskWomen/comments/otkn0s/whats_everyones_favorite_go_to_breakup_song.json": "asking for a friend 🤔",
  "data/reddit-ask/r/AskWomen/comments/ouje2t/how_do_you_take_a_bath_while_on_your_period.json": "Sorry I know this is a personal/intimate question, but it has been om my mind\nfor a while and it doesnt seem to go away.\n\nSo - would you take a bath on your period? If so, do you use a tampon or not?\nAlso, would you avoid going swimming while on your period, or is it a non issue\n(I presume one uses…",
  "data/reddit-ask/r/AskWomen/comments/ov8yhi/how_do_you_deal_with_knowing_youre_the_least.json": "Everyone’s nice to you but maybe you’re a little too used to getting the “oh we\nwent out without you because we didn’t think you’d wanna come!” text",
  "data/reddit-ask/r/Ask_Politics/comments/ob2rrl/what_are_some_of_the_simpler_changes_the_united.json": "I'm really really hoping the mods see this as a good faith question. As someone\nwho finds politics extremely complicated and confusing, but always strives for\nmore knowledge, I'd like here some thoughts on things that would simply help\npeople be happier and better off.\n\nI get that the problems this…",
  "data/reddit-ask/r/Ask_Politics/comments/oeih2c/why_hasnt_the_biden_administration_legalized_pot.json": "This issue has been in the news a lot lately because of the Sha'carri Richardson\nsituation. While I'm not sure how I feel about retroactively changing the\nOlympic code of conduct, I do think it is a no brainer that we should legalize\nat a Federal level.\n\nIsn't this like an 80/20 issue at this point?…",
  "data/reddit-ask/r/Ask_Politics/comments/ohm64q/the_us_constitution_is_the_oldest_active.json": "Thomas Jefferson said the constitution should last about 20 years. that would be\noptimal as \"the earth belongs to the living not the dead\". the average\nconstitution is 19 years (according to Google).\n\nThe US constitution is nearly 250 years old and the founding fathers couldn't\nimagine what America…",
  "data/reddit-ask/r/Ask_Politics/comments/oivk5f/yesterday_thousands_of_cubans_demonstrated_over.json": "FYI the reason for the sanctions is because the Cuban government supports the\nVenezuelan government. Is the US at war with Venezuela? There are a lot of\ncrappy governments worldwide besides Venezuela.\n\nEDIT it would appear the reason for Biden's action is to keep Sen. Menendez\nhappy. Thanks…",
  "data/reddit-ask/r/Ask_Politics/comments/oslwe5/is_biden_waiting_for_full_fda_approval_of_the.json": "I have heard that several present and former members of the military are asking\nwhy the covid-19 vaccine is not mandatory in the services, especially for close\nquarters duty such as the Navy, Coast Guard and aircraft crews of all services.\n\nI also believe that all prison inmates (especially federal…",
  "data/reddit-ask/r/Ask_Politics/comments/ot9ao3/russia_keeps_getting_banned_from_the_olympics_due.json": "https://archive.is/aSSsZ",
  "data/reddit-ask/r/NoStupidQuestions/comments/obiw9t/how_do_i_get_reddit_to_stop_showing_me_alcohol_ads.json": "Around 50% of the ads i see are alcohol and im in the early stages of quitting\nand it really bothers me to see them. Ive tried reporting and downvoting but\nthey just keep coming. Its driving me nuts.",
  "data/reddit-ask/r/NoStupidQuestions/comments/obnnlc/do_countries_outside_the_us_have_newage_names.json": "With apologies to anyone named Braxtyn, Brinley, Aidyn, Brentlee, Kaydence, etc.\nthere are names in the US where people go \"You named your child what? How is\nthat spelled? Huh.\"\n\nUsually they have too many Y's or X's, or are some weird spelling of a different\nword. I recognize that this is likely…",
  "data/reddit-ask/r/NoStupidQuestions/comments/obpgz8/how_do_i_ask_my_girlfriend_her_weight.json": "I seriously could care less how much she weighs but we're planning on skydiving\nand there's a limit. How should I approach this without hurting her feelings?",
  "data/reddit-ask/r/NoStupidQuestions/comments/obqulh/im_about_to_be_homeless_what_resources_do_i_have.json": "TL;DR - About to be homeless with ~$500 in my bank account. I'm don't smoke,\ndrink, and am drug-free. I don't do anything in my free time and am solely\nfocused on finishing school (hopefully by the end of this August) and getting my\ncareer off the ground. I've had long-term stable employment for the…",
  "data/reddit-ask/r/NoStupidQuestions/comments/oc2wia/am_i_supposed_to_tell_a_potential_romantic.json": "I'm in my early 20's and admittedly I've never dated or had sex before, partly\nbecause I was never really hot property, and then I was also quite self\nconscious.\n\nFrankly my wiener is on the smaller side, maybe 3 or 3.5 inches fully erect.\nObviously this wouldn't matter if I was paying for sex but…",
  "data/reddit-ask/r/NoStupidQuestions/comments/oc3pt6/parents_of_reddit_how_would_you_prove_that_you.json": "First off, I'm a guy. I'm sure this would apply to women/mothers as well, but I\nhave read enough \"I can't take my kid to the playground without getting stares\"\nby men to know that people often assume the worst of us.\n\nAnyway! I have nephews, but no kids of my own. So I don't know all the secrets\nof…",
  "data/reddit-ask/r/NoStupidQuestions/comments/ocnk1f/how_come_in_bdsm_porn_videos_the_guy_is_always.json": "Humor me, people.",
  "data/reddit-ask/r/NoStupidQuestions/comments/ocp5m5/ok_so_human_semen_has_iron_it_how_much_sperm_is.json": "human semen has iron it, how much sperm is needed to make an iron sword?\n\nasking for a friend, of course",
  "data/reddit-ask/r/NoStupidQuestions/comments/od52nr/am_i_the_only_one_who_goes_to_bed_hugs_a_pillow.json": "(Asking for a friend of course)",
  "data/reddit-ask/r/NoStupidQuestions/comments/odcbva/has_anybody_else_stopped_reading.json": "I'm a teenager. As a child, I LOVED reading. I'd devour enormous novels with\nfantasy and historical fiction and all that. Over the past two or three years,\nI've stopped reading almost entirely. It may just be depression but I can't get\nmyself to read books anymore, really. I don't have any disorders…",
  "data/reddit-ask/r/NoStupidQuestions/comments/odg4ic/are_rams_called_rams_because_they_ram_things_or.json": "I like rams, I like that they ram things.",
  "data/reddit-ask/r/NoStupidQuestions/comments/odrc5a/how_do_some_young_people_have_so_much_money_what.json": "I(21m) work 9-5 Monday-Friday and I live in Fort Lauderdale right now. I always\nsee people around my age with a nice car, nice clothes. I can’t tell how many\npeople that I know from my school were on boats at least 2 times a week and I\nalways see them doing things that I would never be able to do…",
  "data/reddit-ask/r/NoStupidQuestions/comments/odvbet/florida_building_collapse_what_happens_to_all_the.json": "Obviously the building is way too dangerous to allow people inside to pack up an\nentire apartment....but....will they just raze the rest of the building with\nclosets full of clothes, kitchens full of dishes, etc?\n\nIt must be terrible to know that all of your worldly possessions are \"safe\"\nRIGHT NOW,…",
  "data/reddit-ask/r/NoStupidQuestions/comments/odwk45/is_there_a_double_posting_issue_on_reddit.json": "I’ve seen a lot more double comments (2 comments from the same user with the\nsame content) recently then I ever have on reddit. Anyone else seeing this?",
  "data/reddit-ask/r/NoStupidQuestions/comments/odxl7y/why_is_illegal_immigration_actually_bad.json": "I’m a bit high and I know this question is probably really dumb, so take it easy\non me please.\n\nUsually in political arguments, I hear someone say “he’s not against\nimmigration, he’s just against ILLEGAL immigration”. The other person usually\nresponds accordingly, but I’m just sitting there like…",
  "data/reddit-ask/r/NoStupidQuestions/comments/oeebfs/why_is_ignorance_of_the_law_not_a_valid_excuse.json": "People typically learn laws by naturally becoming aware of what can and can't be\ndone. However, this is a flawed approach to obtaining such knowledge because you\nwill miss plenty of things and risk inadvertently breaking a law. For example,\nyou could easily live your life never knowing that…",
  "data/reddit-ask/r/NoStupidQuestions/comments/oell3q/can_i_hire_somebody_to_be_my_parents.json": "Long story short I was orphaned at 12 and I’m now 18 and getting absolutely\nfucked by adulting stuff. What occupation would be able to help me with all\nthis? All I know how to do is make money on the internet so how can I use that\nto pay someone to help me get a state ID/drivers school/drivers…",
  "data/reddit-ask/r/NoStupidQuestions/comments/oeltx0/how_do_i_properly_get_rid_of_a_life_size_sex_doll.json": "I bought a $1000+ sex doll which weighs almost 100 pounds and has a metal\nskeleton and silicone outside. It's like 5'3 and looks very realistic.\n\nI bought it when I was drunk like 2 years ago and didn't cancel the order the\nnext day as I forgot I even ordered it; it showed up on my doorstep like 10…",
  "data/reddit-ask/r/NoStupidQuestions/comments/oemlbq/when_given_the_death_sentence_why_do_serial.json": "I see a lot of documentaries about serial killers getting the death sentence,\nbut they say they’ve only killed like 5 people, when they’ve likely killed more?\n(like why does it matter, your gonna die anyway) There’s also the theorists that\nsay they’ve killed like 60, why do people act this way?",
  "data/reddit-ask/r/NoStupidQuestions/comments/oet6j3/if_a_site_needs_a_password_with_capital_letters.json": "Extra infuriating if after the second attempt it says, \"That username is already\nin use\".",
  "data/reddit-ask/r/NoStupidQuestions/comments/oey0xn/can_i_ever_feel_happiness_the_way_i_used_to_after.json": "I'm 17. Am I screwed?",
  "data/reddit-ask/r/NoStupidQuestions/comments/oezrrt/why_arent_rich_people_embarrassed_by_their_excess.json": "Seriously, if I had a car that cost 100k or a purse that cost 10k or any other\nridiculously excessive thing while knowing that there are so many families that\ncan't afford to feed themselves, or pay for the basics I'd be embarrassed.\nAshamed even. Like, isn't this shameful?",
  "data/reddit-ask/r/NoStupidQuestions/comments/oezrz5/does_anyone_else_constantly_have_a_semiblocked.json": "It's not like boogers or anything, just like gunk that makes it unpleasant to\nbreathe through the nose. Blowing the nose doesn't make these things disappear\neither.\n\nI have allergies but I feel this way all year long almost everyday. It's easier\nto deal with when I'm up and doing things but when I…",
  "data/reddit-ask/r/NoStupidQuestions/comments/of2cjp/whats_the_point_of_peloton.json": "My rich uncle told me about the first Peloton bike and for the life of me I\ncouldn't understand why gluing an ipad to a stationary bike was a necessary\nthing. I know they make other devices too. I also know that it's tied to their\nproprietary fitness program somehow, but I don't know why an iPad and…",
  "data/reddit-ask/r/NoStupidQuestions/comments/ofmjvp/why_dont_animal_rights_extend_to_insects.json": "Pests to be specific. My host mother when I was an exhange student was a fierce\nanimal rights activist but what baffled me was how her feelings towards animal\nlife didn't extend to insects. When she saw some weird looking spider she would\njust smash it without thinking twice and I started seeing it…",
  "data/reddit-ask/r/NoStupidQuestions/comments/og3oe9/would_it_be_weird_to_pay_300_for_a_stuffed_animal.json": "EDIT: I MEAN PLUSHIE, NOT TAXIDERMY I could write pages about that dog, but I’ll\nkeep it short.\n\nI left my understaffed job in the middle of my shift to go spend his final\nmoments with him.\n\nWhen I got there, I was still in shock, I had no idea what was wrong with him -\nit hadn’t set in. It was the…",
  "data/reddit-ask/r/NoStupidQuestions/comments/ogfljz/why_is_it_in_womens_beach_volleyball_players.json": "Okay I don't have much problem with attractive women playing volleyball in\nbikinis. That's standard for volleyball and being a straight dude, I have a\nlittle problem with that in general. I just am curious as to why men's beach\nvolleyball players aren't playing in just trunks because, in my…",
  "data/reddit-ask/r/NoStupidQuestions/comments/ogkl99/is_it_weird_that_i_unconsciously_copy_sayings.json": "I feel like I have a different personality with everyone I speak to. Like a\nchameleon I just subconsciously try to fit in with the environment.\n\nI do have autism, and quite low self esteem. But is this something many people\ndo?",
  "data/reddit-ask/r/NoStupidQuestions/comments/ogv42a/what_games_do_you_play_to_relax_and_kill_the.json": "Lately I've been super stressed at work and I wanna find something casual (or\nnot so casual) to play so I could relax. I don't want something too hard (CoD\nmultiplayer is too hard for me) or something that takes a ton of time, just\nwanna chill. Any suggestions?",
  "data/reddit-ask/r/NoStupidQuestions/comments/ogvsts/why_after_you_make_a_doctor_appointment_the.json": "I've been having stomach pains for 2 weeks. I didn't call the doctor out of\nfear, not of the results but of the tests I might need to take. Anyway, I\nfinally broke down and decided to make an appointment to see what's up. After\ndoing it my stomach stopped hurting. Now it's like what's the point…",
  "data/reddit-ask/r/NoStupidQuestions/comments/ohf132/why_do_people_act_like_external_validation_is_not.json": "Is this a new phenomenon where people act like external validation has nothing\nto do with inner happiness and self esteem? People always give me platitudes\nlike \"self love and self confidence comes from within\" when i ask for advice but\nit seems what causes people to have low self esteem in the…",
  "data/reddit-ask/r/NoStupidQuestions/comments/ohi54h/why_do_retail_customers_not_understand_that_its.json": "I work at CVS in the pharmacy, and I see at least one patient a day who blames\nme personally if there's any issue with picking up meds eg insurance, not ready\n&c. Are people really so selfish and quick to blame simply because I'm in front\nof them even though I had nothing to do with the situation?",
  "data/reddit-ask/r/NoStupidQuestions/comments/ohskh4/whats_the_deal_with_buzzfeed_straight_up_copy_and.json": "I occasionally scroll through Apple News and quite often see Buzzfeed “articles”\nthat are literally copies of the top comments on Reddit chains. This always\nstruck me as kind of sleazy on their part… then today I happened to be on Apple\nNews and saw that Buzzfeed did it again and my comment was…",
  "data/reddit-ask/r/NoStupidQuestions/comments/ohwt4x/is_anyone_else_left_exhausted_by_literally.json": "There are things that I want to do but everything I start I lose interest after\nfive minutes. I just want to stay in bed all day because doing anything is so\ntiring. I can't get anything done and I just feel like shit because I always say\nthat I'm going to be productive on the weekends and I…",
  "data/reddit-ask/r/NoStupidQuestions/comments/ohxegp/are_you_legally_responsible_for_someone_killing.json": "The relationship is highly toxic, and as much as it hurts to say, I can't\nshoulder their burden anymore. But I'm worried about them hurting themselves if\nI leave them.\n\nWould I be held legally responsible?",
  "data/reddit-ask/r/NoStupidQuestions/comments/oi42n2/what_are_arguments_against_right_to_repair.json": "So this is obviously a topic of huge interest, and likely to heat up even\nfurther. Seems pretty easy to me to vilify greedy companies/corporations and\nmake it a simple case of profit-motivated planned obsolescence vs everyone else\ntrying to reduce wasted money and resources.\n\nAre there any even…",
  "data/reddit-ask/r/NoStupidQuestions/comments/oi5pz4/is_it_possible_for_dogs_to_develop_adhd_or.json": "Just wondering cause I swear my dog has been acting kinda abnormal lately",
  "data/reddit-ask/r/NoStupidQuestions/comments/oi6gux/why_can_people_just_record_you_without_consent.json": "As someone with mental issues I'd rather not be shamed online if I have a panic\nattack on the street and seven people whip out their cameras to record and mock\nme. I've seen the very negative judgements people cast on whole entire living,\nbreathing, people over 5 seconds of footage.\n\nWhy are people…",
  "data/reddit-ask/r/NoStupidQuestions/comments/oinewb/why_do_people_post_happy_birthdays_to_others_on.json": "Ie “happy birthday baby I love you😍❤️” or “wishing a happy birthday to my\ngramma”",
  "data/reddit-ask/r/NoStupidQuestions/comments/oing6p/why_can_i_easily_watch_four_hours_of_a_tv_show.json": "Title. Why can I easily watch four consecutive hours of a TV show (not talking\nlike sitcoms, but narrative shows) but I struggle to sit through a movie that’s\nonly two hours? The only thing I can think it may be is pacing or maybe that TV\nshows are sectioned into episodes, but I’m still watching…",
  "data/reddit-ask/r/NoStupidQuestions/comments/oir7b2/i_need_to_play_a_mild_prank_on_my_girlfriend_any.json": "My girlfriend of many many years played a prank on me for the first time ever\nlike a month ago. We were walking home from dinner and unbeknownst to me she put\na few white tic tacs in her mouth - she pretended to sneeze and spit a couple\nteeth out. It shocked me for half a second and took my brain a…",
  "data/reddit-ask/r/NoStupidQuestions/comments/oirviw/how_do_ppl_in_the_us_stay_sane_with_only_1_or_2.json": "In Europe it's pretty much minimum to get 4 weeks paid vacation. I live in\nFinland and ppl who works for the gov. or county, get even more. I have 6 weeks\nand 3 days paid vacation annual. The amount you get depends on the years you\nhave worked for said employer.\n\nI cant imagine having just 1 or 2…",
  "data/reddit-ask/r/NoStupidQuestions/comments/oj2d3w/do_some_men_actually_masturbate_in_a_sock.json": "I’m a man, but I’ve never done it in a sock, is it actually a thing? I’ve been\nseeing this a lot as a joke lately on social media like TikTok, but I just\ncannot believe that some men do it.\n\nIf so, how do you do it? Do you just cum in the sock or you do the whole thing\nwith the sock on your organ?",
  "data/reddit-ask/r/NoStupidQuestions/comments/oj3ri8/are_all_sikh_people_really_this_nice_or_is_this.json": "I live in a rural area of the United States which is 99% white but I happen to\ncome across about a dozen Sikh people in the last few years and they have all\nbeen so incredible that I cannot believe the entire culture is like this. They\nare hard working, polite, generous, moral, with seeming no…",
  "data/reddit-ask/r/NoStupidQuestions/comments/oj5x01/was_i_wrong_for_towing_a_car_in_my_reserved_spot.json": "I got home after a long day of work back to my apartment that I just moved in\nto. When I arrived, the parking lot was packed and my reserved spot in front of\nmy unit was taken by someone that didn’t even have a parking pass for the\nfacility. I wasn’t about to go door to door asking everyone who’s…",
  "data/reddit-ask/r/NoStupidQuestions/comments/oje551/why_is_there_always_a_live_video_of_someone.json": "I dont watch any type of guitar playing or singer songwriter on youtube and I\ndont google about it. But every single time I press the \"home\" button on Reddit\nto scroll down, there is ALWAYS a live stream with someone playing guitar and\nsinging. WHYYYY",
  "data/reddit-ask/r/NoStupidQuestions/comments/ojl2bq/why_do_younger_teens_seem_like_they_want_to_have.json": "I don’t know if I’m tripping but it’s like teens nowadays put mental illness on\nsome sort of pedestal and are literally striving to be diagnosed with an\nillness?\n\nEDIT: does NOT apply to teens genuinely suffering and wanting to be diagnosed to\nbe treated. (also don’t intend for this to offend anyone…",
  "data/reddit-ask/r/NoStupidQuestions/comments/ojmok7/parents_restaurant_is_being_wrongfully.json": "I honestly don't know what to do with this situation. My parents immigrated from\ntheir country to escape extreme civil hardship in the land. They gave me a life\nin the US, and I'd like to think I am making the most of the opportunities I\nhave because of them.\n\nThey made a successful restaurant.…",
  "data/reddit-ask/r/NoStupidQuestions/comments/ojt6o9/if_you_enjoy_wasting_time_is_the_time_really.json": "I saw this on a car ad and it got me thinking! What do you think?",
  "data/reddit-ask/r/NoStupidQuestions/comments/ojyme1/its_my_28th_birthday_but_nobody_i_know_rememberd.json": "edit: Holy F**K this went over any expectation O_O Thank you all so much... this\nis enough to make an old man cry ;')",
  "data/reddit-ask/r/NoStupidQuestions/comments/ol0hq7/ok_so_if_the_only_part_of_womens_breasts_that.json": "I promise not high or anything",
  "data/reddit-ask/r/NoStupidQuestions/comments/ol0tgj/would_it_be_wierd_to_leave_town_and_pay_for_a.json": "Nothing wrong is happening, but it's just that I work long hours and have been\nworking from home for over 1.5 years now. I don't have a lot of free time and\ndon't leave my house often. Would it be wierd for me to stay at a motel for the\nweekend just to get away from home? Like I literally have no…",
  "data/reddit-ask/r/NoStupidQuestions/comments/ol2c8d/do_americans_actually_microwave_water_instead_of.json": "I'm talking to my girlfriend right now, and she's an American, and told me that\nno one like puts water on the stove or in a kettle, but just microwaves it for\ncoffee and hot chocolate? Do you guys actually do that?\n\nEdit: shoutout to all the Americans getting insulted by a question lmao",
  "data/reddit-ask/r/NoStupidQuestions/comments/ol4z4j/how_do_i_get_tested_for_adhd_in_my_early_20s.json": "As the title says, I have been seeing numerous things I can relate to about\npeople with ADHD but I don't want to self diagnose and straight up tell my\ndoctor.",
  "data/reddit-ask/r/NoStupidQuestions/comments/ol7nmf/legally_and_practically_what_is_stopping_me_from.json": "I don't care about drowning. I just want to know if the Navy would try to stop\nme or something.",
  "data/reddit-ask/r/NoStupidQuestions/comments/olj5mh/is_it_normal_to_turn_18_and_have_no_idea_how_to.json": "I’m so nervous about all these new things that I have to learn to do, like\nmaking appointments, taxes, how to pay bills, etc. I just want to know if I’m\nstupid or is this how lots of people feel? Am I making too big a deal out of\nnothing?",
  "data/reddit-ask/r/NoStupidQuestions/comments/olmqcz/if_a_drunk_person_cant_consent_to_sex_how_do_two.json": "I'm curious on what people think about this, as I've heard conflicting ideas\nabout drunkenness, and responsibility thereof. Some people say that if you\nwillingly get drunk, you're responsible for anything that results from it. But\nif someone gets drunk, and they come on to another person and end up…",
  "data/reddit-ask/r/NoStupidQuestions/comments/oln3x6/why_do_pc_games_require_a_launcher_what_is_it_and.json": "A few years ago I built a new PC for gaming because I switched jobs and had way\nmore free time and wanted to play some games I kept hearing about. The last PC I\nhad built before that was in like 2003, for World of Warcraft.\n\nI built the new rig in 2017, with a fairly decent gpu. (By the way,…",
  "data/reddit-ask/r/NoStupidQuestions/comments/oln688/why_dont_home_refrigerators_have_glasstransparent.json": "I'm sure I'm not the only person who checks the fridge for new snacks multiple\ntimes a day, so why not make the door clear so you don't have to open the door\nand waste the cool air and electricity?",
  "data/reddit-ask/r/NoStupidQuestions/comments/olw6ue/does_driving_really_get_less_scary.json": "Tomorrow is my first day of driving with an instructor. I’ve driven occasionally\nwith my brother and friends, but it’s always this looming feeling of dread and\nanxiety. I’m so hyper focused on not crashing, that I start to grow cold feet\nand feel numb whenever I finally get out. I know they say that…",
  "data/reddit-ask/r/NoStupidQuestions/comments/olyfq1/if_i_metaphorically_got_like_5_spiders_and.json": "I MEANT HYPOTHETICALLY",
  "data/reddit-ask/r/NoStupidQuestions/comments/om089o/does_anyone_know_why_peppa_pigs_little_brothers.json": "Peppa Pig. Suzy Sheep. Candy Cat. Zoë Zebra. Pedro Pony. Gerald Giraffe. Emily\nElephant. Danny Dog.\n\nAnd then you have: George Pig.\n\nWith the exception of the parents and grandparents, as well as the animals with\ncareers, why does George not follow the same alliterative format? This is a\ngenuine…",
  "data/reddit-ask/r/NoStupidQuestions/comments/om2kby/do_parents_in_countries_like_usa_really_kick.json": "I'm curious to see if this is true. I'm Asian and here in my country it is\ncommon for children to stay with their parents even in their 20's. In fact,\nparents usually try to make their children live with them as long as possible. I\ncan't imagine being thrown out of home at 18 when you have no idea…",
  "data/reddit-ask/r/NoStupidQuestions/comments/om758l/why_do_video_resolution_numbers_use_increments.json": "I saw a kid on the front page doing a 1080 on a skateboard in front of Tony\nHawk. I was going to Google it, but then I realized I would get a lot of noise\nabout resolutions. Got me thinking, what is the reason for the numbers being the\nsame?",
  "data/reddit-ask/r/NoStupidQuestions/comments/omaz5m/so_the_argument_against_raising_minimum_wage_was.json": "My entire life the argument against raising the minimum wage from $7.25 to\nwhatever was “PRICES ARE GONNA GO UP.” Now in the post Covid-19 vaccination\nworld and people are going back to work companies are raising wages between\n$12-$16 in my area. Retail jobs, fast food, this isn’t even talking…",
  "data/reddit-ask/r/NoStupidQuestions/comments/omn6o2/what_would_happen_if_everyone_on_the_planet.json": "Maybe this question is too hypothetical to come up with an answer but imagine\neveryone agreed not to procreate for a ten year period, what would be the long\nterm ramifications for this … if knowable.",
  "data/reddit-ask/r/NoStupidQuestions/comments/omoe6e/how_do_you_properly_shave_your_balls.json": "I just think I've been doing it the wrong way",
  "data/reddit-ask/r/NoStupidQuestions/comments/ompceh/is_it_inevitable_to_lose_any_joy_in_life_does.json": "It's a weekend and every 10 minutes I either force myself to watch another\nepisode on Netflix which I don't really want to watch, but have nothing better\nto do, or start a video game and turn it off after another 10 minutes because I\ndon't really feel like playing either.\n\nEvery day feels like a…",
  "data/reddit-ask/r/NoStupidQuestions/comments/omrjur/would_it_be_weird_to_hang_my_own_art_in_my.json": "I’m an artist, currently in school for graphic design and I do quite a bit of\nillustration work as a hobby. I’m getting my own apartment when I move back to\ncampus this fall, so I’ve been looking at furniture and decor. I’ve got some\nprints and posters from other artists that I plan to hang up, but…",
  "data/reddit-ask/r/NoStupidQuestions/comments/omyw79/why_is_transgender_not_considered_a_form_of_body.json": "Or not specifically body dismorphia disorder, but a similar vein. They are\nunhappy with a self perceived flaw within their body. If someone is anorexic,\nthe treatment isn't to let them starve themselves until they are satisfied with\ntheir appearance. Why is this the solution for trans people? Is…",
  "data/reddit-ask/r/NoStupidQuestions/comments/onanj1/my_friend_said_the_fact_that_im_disabled_is_the.json": "I’m a disabled guy with Cerebral Palsy. My emotionally abusive dad never let me\ndate. Soon I’ll be free! In the meantime I walk up to women at my uni, tell them\n“I just wanted to say you’re really pretty! Have a good day!” and walk off.\n\nIt gives me hope and I love spreading positive vibes!\n\nMy…",
  "data/reddit-ask/r/NoStupidQuestions/comments/onfnki/just_found_out_my_wife_is_pregnant.json": "I'm 30year old male, I myself have never had a father figure in my life and all\nI want is to give my child everything I didn't have. Does anyone have any type\nof advice that a majority of new parents over look?\n\nI've already ordered some books to read on and mentally I even feel different. I\nlook at…",
  "data/reddit-ask/r/NoStupidQuestions/comments/onnkz0/what_is_life_like_in_the_russian_far_east.json": "I’ve been interested for a while about what life would be like in places like\nKamchatka and deep Siberia? It looks like a whole other planet, more than places\nlike Madagascar and the oceanic islands, like it’s not even written about or\nacknowledged….why?",
  "data/reddit-ask/r/NoStupidQuestions/comments/onqexq/jerking_off_in_private_tab_on_mothers_phone.json": "Say someone used their mother's phone to jerk off on a private tab, then\naccidentally shut off the phone, locking them out of the phone. If they were to\nturn off the phone entirely, would the private tab disappear?\n\nAsking for a friend.\n\nEdit: Crisis averted, I sent a message to the phone, then…",
  "data/reddit-ask/r/NoStupidQuestions/comments/onqgxo/am_i_as_a_man_not_supposed_to_respond_to_children.json": "In my leisure time I wear almost exclusively Marvel, wrestling, and Disney\ngraphic tees. Children will often complement them when I’m grocery shopping. I\nwill thank them and continue on my way and their mothers will sometimes will\ngive me dirty looks. I feel like it’s rude to not respond to them,…",
  "data/reddit-ask/r/NoStupidQuestions/comments/onqk2u/how_hard_should_i_push_when_taking_a_crap.json": "Should I just let it fall out on its own or push it or PUSH AS HARD AS FRICKING\nPOSSIBLE UNTIL I ALMOST FAINT?!?!?!?!? [serious]",
  "data/reddit-ask/r/NoStupidQuestions/comments/onqr9s/is_the_tik_tik_sound_you_hear_when_turning_on.json": "If it's just audio, is there a speaker behind the dash specifically for this?",
  "data/reddit-ask/r/NoStupidQuestions/comments/onr5ir/socially_inept.json": "My best friend was in a car crash recently and they didn't make it, after the\nfuneral I realized I don't have other friends. I had my best friend and didn't\nneed anyone else, unfortunately now I don't know how to make new friends or\nwhere to go. If anyone has suggestions on meeting new people, I'd…",
  "data/reddit-ask/r/NoStupidQuestions/comments/onvti9/why_is_chris_brown_still_allowed_to_have_a_great.json": "He still makes music to this day despite beating the living shit out of Rihanna\nand his track record has been less than stellar since then. When did we all\ndecide it was okay for him to keep making money? Am I missing something?",
  "data/reddit-ask/r/NoStupidQuestions/comments/onx73q/its_313_am_where_i_am_and_i_just_heard_the.json": "I live alone. I went to bed at 2 and heard a loud bang that shook the whole\nhouse but I was so tired that I didn't worry about it. 2 am is way past my\nbedtime. I thought I'll just deal with whatever it is tomorrow morning but then\nit happened again around 3:12 waking me up and again a few moments…",
  "data/reddit-ask/r/NoStupidQuestions/comments/onyx49/am_i_tripping_or_does_it_seem_like_reddit_has.json": "Almost every thread/subject turns sexual.",
  "data/reddit-ask/r/NoStupidQuestions/comments/oofelf/how_does_jeff_bezos_spending_110minutes_on_the.json": "This has been bugging me all day, SPace X has been hauling heavy loads for NASA\nforever without any fanfare, so how come jeff spending 11 minutes in spaces is\nreceiving so much media coverage, and how does this help the cause of space\ncolonization?",
  "data/reddit-ask/r/NoStupidQuestions/comments/oofgzf/anyone_else_send_a_risky_text_and_then_proceed_to.json": "This might sound dumb. But yesterday I sent a girl a text asking if she wanted\nto go out to get drinks sometime. After I sent that text, I cleaned, I cooked, I\nworked out and took a shower before coming back to my phone (which was silenced\nso I couldn’t hear anything sooner).\n\nI open my phone, I…",
  "data/reddit-ask/r/NoStupidQuestions/comments/oop5mx/why_did_jeff_bezos_and_the_other_billionaires_go.json": "was it just a dick measuring contest or was there actually some sort of benefit\nto it?",
  "data/reddit-ask/r/NoStupidQuestions/comments/ooqyxc/anyone_else_just_clean_the_entire_house_and_make.json": "I noticed this other day after I got in a fight over my gf on the phone. I used\ncleaning products I have never used before, I vacuumed, made the bed, wiped the\ndesk and tables around the house and cleaned the whole bathroom literally making\nits sparkle. Not the first time this has happened. Edit:…",
  "data/reddit-ask/r/NoStupidQuestions/comments/oorkrx/why_is_everything_always_tom.json": "Uncle Tom, peeping Tom, tomboy. What did Tom do to deserve this?",
  "data/reddit-ask/r/NoStupidQuestions/comments/oou4wx/is_it_really_that_uncommon_for_men_not_to_know.json": "The first time I ever went down on a girl I knew where it was immediately. How\nare there dudes who don’t know where it is?",
  "data/reddit-ask/r/NoStupidQuestions/comments/ope7s5/why_are_vacuum_cleaners_so_much_less_powerful.json": "When I was a kid, you could pick up a basketball with a vacuum hose, put it on\nyour skin for a few seconds and leave a gnarly purple bruise. Leave the brush in\none spot too long and literally burn the carpet with friction. Suck up coins,\nkeys, pen caps, can tabs. Actually get the carpet CLEAN.\n\nNow…",
  "data/reddit-ask/r/NoStupidQuestions/comments/opk5q0/how_is_dental_insurance_not_part_of_health.json": "Like is having decent teeth not needed for a healthy life. Bad mouth bacteria\nthat goes to your stomach affects your health. Is it like cause they don’t have\nto go to med school, only dental school? Seems dumb to me.",
  "data/reddit-ask/r/NoStupidQuestions/comments/opyst2/why_dont_flat_earthers_fly_a_planesail_a_boat_to.json": "Is there a reason they haven’t? Is it too expensive an investment?\n\n * not a flat earther",
  "data/reddit-ask/r/NoStupidQuestions/comments/oq0dfa/i_am_completely_unable_to_imagine_someones_face.json": "When I think about a person I can’t even make out the slightest detail of what\nthey look like. This effects everyone, even myself.",
  "data/reddit-ask/r/NoStupidQuestions/comments/oqjspq/why_do_conspiracy_theorists_not_believe.json": "They choose not to believe actual scientists, but they gladly link \"research\" by\ninfamous Astrology-Anna, who sells orgone rocks and anti-5G protection for your\nmobile phone. Discredited former scientist Crazy Crazysson, who once was an\nactual scientist but was kicked out for his batshit insane…",
  "data/reddit-ask/r/NoStupidQuestions/comments/or381i/why_is_lgbt_keep_making_changes_to_the_name.json": "First it was “LGBT+”. Then it became “LGBTQ+”. After that, it became “LGBTQIA+”.\n\nWhy do they keep adding to it when the “+” already included?\n\nI hope this doesn’t sound rude.",
  "data/reddit-ask/r/NoStupidQuestions/comments/or6frm/why_does_there_seem_to_be_so_many_people_in_the.json": "Every time I see anything about how wages should be keeping up with the ever\nincreasing cost of living, there's always people who counter with how many jobs\nare \"unskilled\" and \"don't deserve more than minimim wage\". I can't comprehend\nwhy you wouldn't want everyone to be able to afford a roof over…",
  "data/reddit-ask/r/NoStupidQuestions/comments/orbj7d/how_come_reddit_is_so_popular_but_no_one_you_ask.json": "I asked a few of my friends about it the other day, but no one uses it, and some\ndon't even know it exists.",
  "data/reddit-ask/r/NoStupidQuestions/comments/oroz27/why_does_starbucks_coffee_always_taste_burnt.json": "Im not really a fancy coffee drinker, but if youre into those kinds of things\nStarbucks seems like the way to go. But if you walk in and ask for just a plain\nold cup of coffee you'll get a cup of liquid that tastes like a cigarette butt.\nI like my coffee strong so its not that, it just always has a…",
  "data/reddit-ask/r/NoStupidQuestions/comments/orp5zm/after_i_turn_18_could_i_just_not_work_and_sail.json": "I don’t see why not or what’s stopping me so can I just leave everything and\ndisappear?",
  "data/reddit-ask/r/NoStupidQuestions/comments/orrlzc/how_to_take_a_proper_shower.json": "I'm 16, and I can count on a single hand the amount of showers I have taken in\nmy life. Three. And I am about Ten months away from a long vacation in Spain\nwhere there is a good chance I will have to share a room with another teenager,\nso my questions are as fallows:\n\n1 What is the most basic…",
  "data/reddit-ask/r/NoStupidQuestions/comments/oschmm/is_it_normal_to_feel_just_fine_about_never.json": "Or is it just the introvert in me. During the height of the pandemic last year I\nloved using the pandemic as a reason to not attend parties or obligatory family\ngatherings for not going. Now since things are allegedly better regarding the\npandemic people are expecting to see more of me or wanting to…",
  "data/reddit-ask/r/NoStupidQuestions/comments/ostxmt/is_it_me_or_did_the_mobile_version_of_reddit.json": "Especially for loading comments, profiles, notifications, etc. I have to wait\nlike 5-10 seconds for them to load.",
  "data/reddit-ask/r/NoStupidQuestions/comments/ot68xh/why_have_sex_scenes_at_all_in_seriesmovies_if_its.json": "I think sex scenes are either to titillate, to add to the plot, or both.\n\nHowever, I've noticed with a fair amount of modern sex scenes are these\nhalf-assed sex scenes where the woman keeps on her bra, blankets are\nstrategically placed, the woman is always having her hand over her bust\nshielding…",
  "data/reddit-ask/r/NoStupidQuestions/comments/ot7ixm/do_people_actually_wake_up_feeling_awake.json": "No matter how long I sleep, the activity I did the day prior, the amount of\nalcohol or caffeine I assume, I almost always wake up feeling like I need more\nsleep. Ive tried schedules, I barely smoke pot anymore (bc that made it worse).\nI let myself naturally wake up, I use alarms, etc etc. sleeping…",
  "data/reddit-ask/r/NoStupidQuestions/comments/otde7j/dudes_who_dont_wash_their_hands_after_using_the.json": "Title",
  "data/reddit-ask/r/NoStupidQuestions/comments/otfx27/im_i_the_only_one_freaking_out_when_i_see_1014.json": "For me they’re still too young for social networks. And while I created my\nFacebook account when I was 11, and my Instagram account when I was 12 or 13, I\nfeel like they’re kind of safer websites. Reddit is wild, that’s what I love\nabout this place, but for kids? Or maybe 10 year olds aren’t kids…",
  "data/reddit-ask/r/NoStupidQuestions/comments/otigx3/anyone_notice_reddit_mobiles_loading_times_have.json": "I go on any other app/site and the internet's fine, but starting up the app\ntakes ages + loading any sort of media is c a n c e r.",
  "data/reddit-ask/r/NoStupidQuestions/comments/otjuwd/is_it_normal_to_find_sex_and_sexual_things.json": "At school around puberty, fellow students and friends usually just talk about\nsexual desires and so many aspects of it in relationships exclusivly. To this\nday people I know think the same, I'm not sure how girls think about this.\n\nWhile I only think of platonic aspects of relationships exclusivly,…",
  "data/reddit-ask/r/NoStupidQuestions/comments/otwih4/what_can_a_sober_person_order_at_a_bar.json": "I somewhat recently quit drinking alcohol (right before Covid). I have a work\nfunction at a bar this weekend for the first time since being dry and I'm not\nsure what to order without looking strange. The complicating thing is, I don't\ndrink soda either. Pretty much the only thing I drink is water…",
  "data/reddit-ask/r/NoStupidQuestions/comments/otx0uy/is_it_weird_to_not_want_to_expose_my_baby_online.json": "My GF and I are gonna be parents in two months. I told her that I didn't want\nany pictures of our girl going online. She's okay with it, but doesn't\nunderstand why.\n\nAm I the one being weird here? I don't want every step of my kid growing up\nonline, until she's at an age of deciding for herself what…",
  "data/reddit-ask/r/NoStupidQuestions/comments/otx3oj/why_can_we_sit_down_with_toys_as_children_and.json": "When I was a little girl I could spend hours pretending and used to have a vivid\nimagination. As an adult I could pretend but it’s not enjoyable nor do I get\ninto like I did as a child.",
  "data/reddit-ask/r/NoStupidQuestions/comments/ouati0/are_concrete_workers_better_at_spreading_things.json": "This is the stupidest nostupidquestion but I'm genuinely curious.",
  "data/reddit-ask/r/NoStupidQuestions/comments/ouy6qp/how_are_2000_year_old_roman_roads_still_in.json": "I just don't get it, all the machines, material science, time, resources and\nmoney in the world and we're still not making roads as durable as some Roman\nslave with rocks and an iron pickaxe in year 0.",
  "data/reddit-ask/r/NoStupidQuestions/comments/ov1wov/why_do_people_say_hello_repeatedly.json": "I'm autistic, and this is one behaviour that I really don't understand. I'm on a\nwork placement at the moment, for 10 weeks. The work environment means that\nyou're constantly moving around a big lab, and bumping into the same people over\nand over.\n\nI will always say hi, good morning at the beginning…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ob16tm/does_anyone_else_tend_to_resent_whatever_gains.json": "It’s much subconscious that deliberate. I just begin to resent when something\nhas a sudden crazy following with everyone doing it. It can be a trend, a\ncelebrity or anything.\n\nIt saddens me a little bit when something unpopular I liked suddenly explodes\nand has everyone swarming about it. Because I…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/obcqrj/does_anyone_else_think_both_democrats_and.json": "I can't stand how both parties are trying to brainwash you to follow their\nstandards, and not realistic standards.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/obnwbs/how_do_two_consenting_adults_accidentally_get.json": "I just feel like there are a lot of people who don’t want to get pregnant who\nget pregnant. I don’t want to get pregnant right now, I’m married, and ever\nsince I was sexually active I have been on birth control AND we use condoms\nevery time (yes, really). I understand that sometimes it happens…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/obw7d0/is_it_okay_to_wank_at_someones_house_if_youre.json": "Me and my family goes to my grandparents' house every year and stay there, since\nthey live far away. We normally stay for like a week but I'm planning to stay\nfor an extra month. Maybe I can handle 1 week, but over a month without wanking\nis tough as hell for a teen like me. How would you guys feel…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/oby29k/is_it_normal_to_not_like_making_long_term_plans.json": "I've been hearing my friends all talking about their long term plans and it made\nme realize that I might not be normal here. Am I just think too pessimistic?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/oc3y2h/does_anyone_else_find_the_new_video_player_on.json": "I’m finding it’s just really not very user friendly. I try to just go straight\nto the comments and then it full screens the video and starts playing it, then I\nhave to press the comment button again to view the comments. Then the video\ncontinues playing taking up half the screen so I have to swipe…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/oc6shx/why_is_it_unheard_of_and_kinda_looked_down_upon.json": "22M I work with an all-female department, they're all fairly older than me so\nthey treat me like a younger family member. More often than not they would treat\nme to lunch, I see nothing wrong with it but it was just a few weeks ago I was\ntalking with my parents and they asked how work was going. I…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ockuls/does_anyone_find_awful_weather_thunderstorms.json": "I work from home now and some of the ambience I play in the background, I've\nnoticed, is just horrible weather. If you go to YouTube and search for\n'hurricane ambience' or 'tornado ambience', or 'ocean storm', you'll see what I\nmean. I find them hauntingly beautiful.\n\nFor some reason my social…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ocwmpb/is_it_safe_to_eat_a_tumor.json": "Earlier today, I saw a post of an autopsy revealing that the person had a brain\ntumor. First thing that came into mind to me was that it looked very much like a\nmeatball.\n\nSo, Reddit. Tell me, is it safe to eat a tumor?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ocxa31/why_are_overweight_women_always_so_unnecessarily.json": "This is the third time I’ve had this happen in the span of a month! I don’t\nunderstand this mentality, I guess this is the safest place to ask…\n\nI’m a slim woman, I’m also tall (6ft) I always thought that there is absolutely\nno reason for someone to comment on other people’s bodies, but clearly…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/oczzga/does_anyone_else_feel_like_the_only_time_they_can.json": "I would definitely describe myself as an introvert, but this particular thing\nI’ve noticed isn’t really talked about too much. It’s just that whenever I’m\nalone, and alone as in empty house or empty apartment, I finally feel motivated\nenough to get things done and do things I need to do. Anyone else…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/od2sl1/why_is_it_not_considered_racism_if_white.json": "Sorry if this is a stupid question or the wrong subreddit. For background, I am\n100% Asian. My boyfriend however is 100% white. We live in a place where white\npeople are by far the minority. People here really don’t like white people to\nthe point that we have wondered if my boyfriend should instead…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/od2vbh/how_come_every_time_you_go_to_lay_down_it_takes.json": "Why does this happen? Is it just me or is sleeping hard work.\n\nEdit: find* not fine",
  "data/reddit-ask/r/TooAfraidToAsk/comments/od66vx/if_my_partner_and_i_consent_and_have_sex_what.json": "In other words, if someone were to say they didn't consent or that I raped them\nafter the fact, what the fuck would I do?? How am I supposed to defend against\nthat?\n\nIt's not really something I need to worry about since I don't have any\nexperience around it, it's just a terrifying thought that…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/odaee3/do_black_people_find_woke_white_people_to_come.json": "I live in a liberal area. I’m liberal myself but sometimes I meet these super\nwoke people and as soon as a black guy is around, they start mentioning race\nevery second. Even if it’s “us stupid white people”. And it just seems something\nslightly racist about it but idk what.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/odexkq/how_common_is_it_in_the_us_to_believe_that.json": "Are there many people in the US who are actually aware that places like Egypt,\nLibya, Algeria, and Morocco are ALSO in Africa and that the indigenous people\nthere are NOT 'BLACK' but a mixture of shades generally ranging from brown to\nlight tan?\n\nThe reason I'm asking is because I regularly see…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/odhju1/does_anybody_else_really_enjoy_lying_down_on_the.json": "I'm not even sure if this is fit for this subreddit, but I just need to know if\nI'm alone in this lmao\n\nI've always found that whenever I lie down on the floor at home, not on a\nblanket or mattress, my body and mind instantly relaxes and I fall in a\nnear-sleep/nap state even though I'm fully awake.…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/odv1c6/is_it_normal_to_not_want_kids_because_you_feel.json": "I know people keep saying that it’s different when you have your own kids, but\njust being around them, like my little brother (4 yrs) and cousins (4 and 6 yrs)\nis so draining. I’m 22 years old and I don’t want kids. I’d rather have my\nfreedom than raise kids that I couldn’t stand being around.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/oe5kz3/is_needing_8_hours_of_sleep_a_night_just_a_myth.json": "So to start off, I’m a 21/yo college student. Like the title says, my entire\nlife my parents have accustomed me to make sure I get 8 hours of sleep every\nnight. This habit has transferred over to my now adult life but occasionally I\nwill only get 6, or 7 hours of sleep. I feel like crap on those…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/oe5o3o/how_can_an_introvert_survive_a_class_with_90.json": "I'm an incoming freshman that was added to a groupchat of people with the same\nmajor. I found that most of them are pretty extroverted which kind of\nintimidates me as I am a private and introverted person. I'm afraid of being\nisolated from my peers since our campus culture demands you to be…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/oe82z1/why_does_it_seem_like_the_majority_of_police_in.json": "This is not to shame anyone but seriously i would say half the officers I see\nhave to be 250+ without muscle.\n\nEspecially the older ones, I can’t see them chasing let alone being to fight\nsomeone effectively without just putting their weight on them.\n\nIf you’re going to be cop, you don’t have to be…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/oejfcm/how_do_we_know_the_various_covid19_vaccines_wont.json": "Throwaway because 'no question is a stupid question' doesn't exist when it comes\nto the vaccines, seems either you're pro or anti and any questions seem to lump\nyou in the anti group.\n\nMy genuine question is this, how do we know there won't be complications that\narise in 10+ years? If the first…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/oemysl/where_did_the_stigma_of_giving_a_woman_head_is.json": "I always wondered this… this might not be a thing in other parts of the world\nbut where I’m from (canada) as well as in West Indian or Caribbean culture. I’ve\nheard it a lot where guys will say they would never go down on a girl or that\nit’s nasty. Or just the stigma of vaginas smelling like fish… a…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/oet34z/if_satan_is_the_bad_guy_why_does_he_punish_the.json": "I'm not very religious so a I'm not even sure if what I'm saying is even right,\nbut wouldn't Satan be doing a good thing punishing the bad people?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/oetdeq/why_are_some_lgbtq_peopl_so_obsessed_with_labels.json": "Just wondering why some are so obsessed with the correct labels and their super\nprecise descriptions.\n\nI have nothing against it or anything, I'm also part of the community. Its just\nsomething I have noticed.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/of3g3o/am_i_the_only_one_who_thinks_that_being_a_veteran.json": "There are some jobs that a military member was never put in harms way, they are\nnot owed as much reverence as they get.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/of5wne/have_you_ever_thought_of_unfriending_90_of_the.json": "I have a lot of ex-co-workers, former classmates, former bosses, people I had a\none-night-stand with etc. that I don't talk to anymore in my friends list.\n\nSo, should I?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/of8hlw/am_i_the_only_one_who_finds_inspirational_speechs.json": "I think my hatred for them started everyone said \"were all in the same boat\" at\nthe start of 2020, and now I just groan when ever I hear them because its isn't\nanything I haven't heard already like \"you deserve all the good things in life\"\nor \"you just need to work harder\"\n\nnot to mention the way…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ofelyj/am_i_the_only_one_incredibly_frustrated_wth_the.json": "No. No you are not. There are billions of people, and many, even in this\nsubreddit who will share you views or habits, which are often not very\nunpopular. Please go and seek confirmation for your less mainstream opinions and\nmanners somewhere else.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ofhpwc/is_a_feeling_of_loss_of_freedom_normal_in_a.json": "Recently moved in with my partner. I feel like I lost a huge amount of freedom\nin my life. I don’t even mean freedom in terms of sleeping with other people\n(that wasn’t happening anyway), but just little things. Her parents are in town?\nBetter drop everything and go out to dinner with them. Her show…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ofll60/does_anyone_else_have_a_cup_they_use_religiously.json": "I have two metal thermos cups that I cycle between using and fill with only\nwater. I admit I don't actually just wash them with soap as frequently as I\nshould. :( but maybe other people are gross like me? lol",
  "data/reddit-ask/r/TooAfraidToAsk/comments/og6apt/when_i_was_4_my_mom_forced_me_to_kiss_my_dads.json": "Like, it was literally just kissing it so it can't be molestation or anything,\nright? It has to be something milder, if anything at all? Does it count as\nsomething at least?\n\nMy mom snapped, threatened us with a knife, and forced me and my older brother\nto kiss my fathers dick. I'm still very…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ogcowp/am_i_the_only_one_that_watches_if_people_that.json": "Yeah just that",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ogijrk/does_anyone_else_ask_questions_they_already_know.json": "I came to realize that I often ask silly questions for no particular reason,\nespecially regarding stuff that I am somewhat knowledgeable about.\n\nJust the other day a colleague mentioned a 'new' store she had discovered and I\nended up asking all about that place despite being quite a frequent visitor…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ogkiwx/in_the_us_if_abortion_is_illegal_in_some_states.json": "Is there any legalities stopping anyone from doing this if they really want an\nabortion? It's not like this is a federal law (afaik)",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ogsn8n/is_it_normal_to_only_feel_sexualy_attracted_to.json": "I never felt much sexual attraction to others, and recently it was my first time\nhaving this feeling, and I'm really confused by it, I dont know what to think...",
  "data/reddit-ask/r/TooAfraidToAsk/comments/oh9cvk/does_anyone_else_feel_like_employment_has_become.json": "I ask this here because a lot of people are very defensive and get very angry at\nthe idea of some not working at all or not working hard at jobs even if most\npeople don't care for their jobs or get stressed. Why are we supposed to not\nquestion the idea that employment may not be for everyone? I see…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ohibtb/does_anyone_else_feel_selfconscious_about_the_way.json": "And sometimes like I'm walking wrong or in a funny way.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ohkqxp/i_dont_get_the_point_of_rwhitepeopletwitter_and.json": "The posts there are nothing specific to white people or black people. The tweets\nare just regular-ass tweets. I don't see how the inherent existence and\npopularity of these subs is not unnecessary segregation and borderline racist.\nP.S. I am neither black nor white. I am a south-east Asian that has…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ohng73/does_anyone_else_feel_like_its_almost_impossible.json": "I sometimes find myself in conversations with other people where they find\nsomething I say as clever and they ask if I came up with it. Obviously sometimes\nI’m making a reference to something but there are quite a few genuine moments\nthat I am not sure. When I find myself in those situations, I…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/oho4ym/how_is_it_legal_for_conservators_to_keep_britney.json": "How does such a law exist and why aren't people freaking out about it? Seems so\narchaic. There are millions of bipolar people who do a great job raising\nchildren.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ohq2c3/are_there_other_men_afraid_of_women_and_kids.json": "I’m always afraid that I’ll get accused of sexual abuse. I was accused of it\nbefore and it took a lot to prove that I didn’t do anything wrong. So now I’m\neven afraid to try and date someone.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ohrhz2/is_it_normal_that_i_love_to_give_but_dont_really.json": "hey yall hope this doesnt get taken down as trolling cause im real genuine here.\nso basically I (afab, they prns) am perfectly happy to get any partner (female)\nim with off, but i really dont care about receiving the same. in fact, i would\nmuch prefer to do it myself. essentially i like getting them…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/oi0irb/how_many_of_you_have_seen_or_heard_adults_compare.json": "I was a victim of this. Until I reached junior high, my dad used to spank me on\nmy bare bottom with a switch, leaving red bloody welts. He made a point of\ntelling my mom and grandparents about how when I was in trouble, he'd \"waste no\ntime getting down to the bare facts\" - meaning my bony little…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/oi3cdg/is_it_normal_for_some_men_to_be_intimidated_by_sex.json": "I have a great relationship with my wife. Moved in together in 2005 and married\nin 2010, going strong... my problem is I feel a little intimidated by sex\nbecause she can get very sexually aggressive. It was one of the things I loved\nearly on but as the years have gone by she has become very…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/oiame7/does_everyone_else_feel_overwhelmed_with_life_all.json": "For almost my entire adult life I feel like I'm always trying to play catch up -\nkeeping the house clean, looking after myself, eating well, turning up to work\nand staying on top of laundry are kinda the bare minimum. Then there's having a\nsocial life, having meaningful contact and spending time…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/oim20b/does_anyone_else_enjoy_reading_downvoted_comments.json": "It might just be a guilty pleasure of mine, but does anyone else enjoy scrolling\ndown in certain posts and seeing the most downvoted comments?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/oind2d/why_do_animal_adoption_centers_make_people_jump.json": "I've been trying to adopt a new bunny. I've tried several shelters. All of them\ncharge twice as much as a pet store (understandable as most are spade/neutered)\nrequire me to show my home, some maintain \"ownership\", as legally questionable\nas that sounds, and one was rude as shit to me because my…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/oj21dw/why_is_there_such_a_focus_on_canceling_student.json": "Background: I graduated from college 8 years ago. Upon completion, I had\nborrowed a total of $42,000. However after several false starts attempting to\nget settled into a career, I had to defer payments for a time before I had any\nsignificant and steady income. By the time I began making payments in…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/oj3jmd/is_it_normal_to_feel_bad_after_masturbating.json": "Like...I feel depressed and I lose all attraction to whatever I was getting off\nto (even if was my SO).\n\nThen half a hour later I'm fine again.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ojbqdo/why_are_mixed_black_and_white_people_seen_as_more.json": "I’m mixed race (black and white) I have skin that’s as light as most white\npeople though. If I say I’m black, nobody bats an eyelid. If I say I’m white,\neveryone says “you’re not white!”\n\nPeople always say I’m black or put me in the category with black people.\n\nHowever, I’m just as much white as I…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ojj6zv/why_are_old_people_obsessed_with_getting_up_early.json": "My grandfather gets up at 4:30 a.m. and starts texting me and has complained\nthat I'm not up when he is. He doesn't seem to grasp the idea that not everyone\nlives the way he does. He seems to expect it and gets mad that not everyone\nlives the way he does. He does have dementia but this doesn't seem…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ojkarc/how_realisticoften_could_sex_partners_cum_at_the.json": "It just seem like a stupid porn logic thing. At least to my virgin ass.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ok2qqq/is_anyone_else_tired_of_everything_being_turned.json": "I feel like everything is being turned into a race issue these days. Eating some\nfood is a racist or cultural appropriation. Wearing a hat is somehow racist or\ncultural appropriation.\n\nRecently I saw that apparently wanting to lose weight and be healthy and look\ngood is somehow perpetuating white…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ok9luz/is_it_bad_that_i_think_the_majority_of_service.json": "I know the title sounds awful, but let me explain. First, I’d like to say that I\ncompletely understand and appreciate the need for actual trained service dogs.\nSome people genuinely need them, and I respect that 100%.\n\nBut, the sheer amount of people I know personally who purchased and actively…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/okcaqk/why_do_poor_people_have_so_many_kids.json": "Idk, but usually \"poor people\" have 2+ kids, why they just don't have any kids\nuntil they get some money?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/okf8o0/does_anybody_else_think_that_labels_are_just.json": "I’m sexually attracted to both women and men, but I don’t feel the need to say\nI’m bisexual, because it just… means nothing To me? I don’t understand why\npeople need to put labels on everything.\n\nI really started to think about how annoying it was when I was out with a\nfriend, he was explaining the…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/okkzi4/does_anyone_else_pronounce_the_caribbean_and.json": "When I talk about the Caribbean, it’s said differently than when I talk about\nPirates of the Caribbean.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/okr34w/why_the_fuck_does_george_floyd_have_murals.json": "I always hear stuff like \"We don't worship Floyd\", \"We aren't saying Floyd is a\nsaint\".\n\nWell why on earth does he have things such as murals and statues which are\nthings you often dedicate to heroes? What has he actually done that was good? He\nwas an awful person in reality, how can the people who…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/okv7m9/anyone_else_tired_of_reading_every_title_here.json": "7/9 of the top posts right now are just \"does anyone else\" titles. It's lazy,\nit's boring to read and the answer is almost unequivocally \"NO, you're not the\nonly one.\"\n\nStarting today, these statements in titles are blanket banned. This doesn't mean\nthat your question is not welcome, it simply means…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ol7as9/why_are_so_many_black_men_attracted_to_fat_white.json": "I know I’m going to hell for asking this, but promise I mean no harm at all.\nIt’s just that I’ve seen this specific combo all the time; a fat white girl with\na black dude. It’s never an overweight black dude with a thin white girl. Only\nthe other way around.\n\nIs it a lack of options in dating? I…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/olficl/why_do_people_turn_mental_illness_into_a_cute.json": "I notice this on social media more than ever where people who I'm certain self\ndiagnosed themselves are saying they have whatever illness... But they paint it\nmoreso in a way to get attention, like it's some silly cute feature about their\ncharacter.\n\nI totally understand the spread of awareness, or…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/olgci0/is_it_weird_that_i_talk_to_my_dog_in_full.json": "Like “oh what is it? You found something cool? Show me!”\n\nOr even just “hot out today huh? You wanna go back home where it’s cool?”\n\nNot like I think she totally understands it but I imagine she likes hearing it",
  "data/reddit-ask/r/TooAfraidToAsk/comments/olgreu/back_in_the_day_having_an_allergy_was_quite_rare.json": "Is it just me or are there more allergies, and more people suffering from them\nthan ever before? And if so, why is it that people are more sensitive than their\nparents or grand parents?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/oloeql/if_911_is_such_a_tragedy_when_why_does_the_us_do.json": "Ive been pretty scared to ask this knowing the 9/11 is a pretty dodgy topic to\nbring up so i truly dont mean anny offense when I ask this.\n\nI was just confused as to why the US puts so much effor towards \"remembering\n9/11\" and expressing how detrimental it was when the US bombs other countries…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/oloj6f/do_you_look_inside_other_peoples_houses_when.json": "Not in a creepy way, but in a curious “I wonder how other people live” sort of\nway. If a window or front door is open, glancing through them can tell you a lot\nabout a person. The type of furniture they have, if they have any posters,\nlights, etc.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/olzv5a/do_white_supremacist_christians_realize_that.json": "If Jesus was from the Middle East and possibly a brown man, how would Christian\nwhite supremacists feel about that? If he showed up to them today, would he be\nthe saviour or still be a immigrant?\n\nEdit:- Adding to my original question, because it's a little vague and the some\ncomments are forking in…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/om6qbf/is_wrong_for_not_wanting_to_sent_a_nude_to_your.json": "So my girlfriend wants me to sent her a dick pic or a nude. Now I have never\ndone that in my entire life and I don't even know how to take a nude. Also I get\nvery uncomfortable if I see my photo in someone else phone and that's the reason\nI don't use social media at all. I only use Reddit because of…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/om9k95/why_is_everyone_just_okay_with_social_media_being.json": "We all know that it takes like 50 tries to get that perfect Instagram photo, and\nyet people treat it as if the person just wakes up that way. If we ALL know\nsocial media is so fake then why do we still compare ourselves to each other and\nget depressed over it? There's always some corporation trying…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/omccs1/i_am_genuinely_hesitant_about_getting_the_vaccine.json": "I am not an anti vaccer. I am not against the old way of vaccinating. I am\nworried about the fact that this is a new/experimental vaccine that uses RNA\nthis time. It's new and we can't be sure about the long term effects. We were\nwrong before about certain medicines being safe. I'm just scared that…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ome527/how_do_i_cope_with_the_fact_that_i_eventually.json": "I’m 19 graduated high school during the pandemic and such. I worked at Wendy’s\nfrom March of 2020 to July of 2020 and absolutely hated it. I ended up working\nat a country club with some friends until the seasonal position was over. I had\na blast those few months then didn’t work till it reopened…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/omtcre/how_can_a_person_stop_touching_themselves.json": "I M19 masturbate 2 times a day. And I'm ashamed of it. Nowadays I only do it at\nevening in bed and sometimes when I wake up.\n\nI got down from 9-4 times to 2 times so that's already good, but how can some\npeople only do it 'a few times a week' HOW??\n\nAnd how can I stop finding random stranger so…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/omv9nl/why_are_always_random_girls_on_the_internet_and.json": "Like seriously or is it just me who doesn’t find 98% of “super models” and porn\nstars attractive compared to random girls that you see in your everyday life?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/oncjlg/why_are_people_actually_happy_about_being_able_to.json": "I don't understand it so help me out. I hate working from home, I get genuinely\ndepressed. I need get out of my house, have a reason to see people, interact,\nand be outside.\n\nBeing able to commute, be out in the city gives me reason to just be outdoors\nand see the world, no matter how banal it can…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ondf08/i_struggle_to_understand_indian_accents_what_can.json": "I want to clarify that I have no ill will against anybody for any reason. My\nissue is that I struggle immensely to understand people with Indian accents when\nthey speak to me, which often leads to me having to ask them to repeat\nthemselves many times and still not understanding them.\n\nI am a good…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ondvte/is_it_incest_if_i_want_to_have_a_relationship.json": "Is it wrong? :(\n\nEdit: I guess I’ll have to keep a distance from her. It’s just hard to shut out\nthese feeling, even if it’s wrong. But I don’t want to stay with her and have a\nvoice in the back of my mind that says this is wrong. I really think she was my\nsoulmate. (sry if I sounded cringy) BTW…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/oneg64/do_black_people_who_often_have_larger_nostrils.json": "Before you come at me, I'm black with a big-ass nose lol. So, is it possible\nthat black people (especially Africans) breath in more air than everyone else?\nAnd would they have larger lungs?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/onnmsm/is_there_a_name_for_this_feeling.json": "Hi. Sometimes I get this intense feeling of everything being \"real\". Like, I'll\nmove my limbs and think \"holy fuck, I'm actually an alive person\" or if I'm with\npeople it might be \"Holy crap, these people are real\". Sometimes it's kind of a\ncool feeling but othertimes it feels quite overwhelming and…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/onsu94/does_the_queen_beequeen_ant_have_sex_just_once.json": "I dont know how else to word this. Does the queen mate just once with a single\nworker and produce all the eggs or do they all get a turn on her ass? This is a\ngenuine question.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/onsyj2/ladies_of_redditdo_you_look_at_guys_bulges.json": "I worry because of how noticeable mine seems to be. I don't even know why that's\nthe case; I'm definitely pretty average-sized, and I don't wear super tight\npants or anything, and yet I feel like it's always kinda prominent any time I\ncheck in the mirror and just get nervous that my coworkers notice…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/onubkd/is_it_really_quitting_porn_if_you_start_an_only.json": "I just read an interview with llana Rhoades about how she wishes she never did\nporn, wishes people didn't see her that way, maintained her dignity and said she\nonly had about 100k when she quit but is now a multimillionaire. I was wondering\nhow she became so wealthy if she wasn't rich after quitting…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/oo0jjl/why_do_people_act_like_if_bezos_dies_everything.json": "Yeah yeah, I know this is reddit so #killallbillionaires\n\nBut come on, nothing is going to change.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/oo35t8/why_do_many_people_say_you_wont_find_another.json": "Isn't the whole point to not want to meet another person like your ex? Or am I\nmissing something?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/oojvbz/why_do_guys_love_anal_that_much.json": "I've never tried it. I don't see the appeal over it and I'm really afraid to ask\nwhy alot of guys want it and actually seak it out?\n\nEdit. NO PMS FROM CREAPY GUYS PLEASE",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ookh7e/do_a_lot_of_people_just_end_up_settling_for_an.json": "As a 30 something single who has been in a variety of relationships over the\npast 10 years, with people who were ‘okay’.\n\nI wasn’t necessarily unhappy with them, but none of them made me particularly\nhappy either, and I couldn’t see myself living the rest of my life this way.\n\nI don’t feel as though…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/oor3wl/why_the_hell_are_we_not_still_talking_about.json": "He was literally one of the most notorious pedophiles, with connections with the\nbiggest names on the planet. Him and Donald Trump were friends? Why is it in\nthis day and age, with communication all over the world at the touch of a\nbutton, our span of things being circulated is about a month at…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ooslvu/why_dont_we_finally_just_tax_the_rich_so_we_can.json": "I am not talking about direct politics, I am talking about the whole world, we\nlive in a society where people in the world have more money than whole countries\nand states.\n\nOne would manage to make whole societies finally capable of action and viable to\ngo to work, etc..\n\nI can not understand that…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/oow8l2/is_it_embarassing_to_hike_and_take_lots_of_breaks.json": "I'm a fairly fat girl, like 5'1 and 80kg. I am in this constant denial where I\nthink I'm fit and thin (and also having constant breakdowns cause well, in\nreality ik im not)\n\nToday my friends and I went on hiking this famous mountain. To be fair its not\ntoo high (based on POV from bottom ofc) and i…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/opcq1y/if_youre_going_to_have_sex_with_a_conjoined_twin.json": "I’m concerned that this question ran across my mind this morning",
  "data/reddit-ask/r/TooAfraidToAsk/comments/opqny5/why_do_men_have_2_testicles_rather_then_one.json": "I know the question sounds stupid, but it's been stuck in my head for a week and\nI really don't wanna have to ask my biology teacher",
  "data/reddit-ask/r/TooAfraidToAsk/comments/optq2o/why_is_outing_people_and_speculating_about_the.json": "I see all the time on social media people speculating about the sexuality of\npeople who claim to be straight or bi. Confusingly, nearly every time it comes\nfrom someone who is LGBT and I frequently see it occur in LGBT dominated spaces.\n\nIt’s always “no way he/she’s straight” or “wow he/she seems a…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/oq4ipa/why_is_porn_unappealing_after_climax.json": "I've noticed this from an (unfortunately) young age and it still happens to this\nday. As soon as I (28F) climax, I'm no longer interested in watching the video\nand at times become slightly repulsed by it. Why is this? I've been able to\nclimax multiple times with a partner but never with porn. Thanks…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/oq5ecn/what_are_mens_honest_feelings_about_blue_balls.json": "Alright, to get the preface out of the way so we're all on the same wavelength\nand people don't regurgitate the things we all know:\n\n- Yes, ladies have the right to stop any time they want\n- No, us gals don't owe guys anything\n- Yes, blue balls is a real thing (there's a whole pain kink over it!),\n-…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/oq5zrq/gents_of_reddit_how_do_you_hint_your_partner_that.json": "Like seriously.. It's hard for us first-timers you know",
  "data/reddit-ask/r/TooAfraidToAsk/comments/oq7q5u/my_wife_was_hit_by_a_car_and_killed_5_weeks_ago.json": "This happened 5 weeks ago. She was out by herself in the everglades on a 2 lane\ngravel road and had her truck stopped with her hazards on. While she was walking\naround her truck, a car came speeding by and hit her, throwing her body about\n20-30 feet from her truck. Died instantly we're told. Here is…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/oqf5ae/19m_i_used_to_be_100_straight_but_i_think_being_a.json": "Before I start this post, I just want to say that I never hated women or had any\nresentment for them. I was just an extremely lonely and depressed guy with no\nself esteem.\n\nSorry for the bad grammar, I'm typing this at 3:00 am on my phone and I'm tired\naf\n\nOk, so basically, when I started high…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/oqja7f/do_you_squeegee_your_body_with_your_hands_after_a.json": "I've just always done it \"out of instinct\" but just found out that \"most\" people\ndon't... Am I a psychopath lol or are other people just inefficient?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/oql6o6/is_it_gay_to_be_sexually_attracted_to_yourself.json": "Like looking in the mirror and being turned on. Is it unusual?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/oqo4me/is_it_sexual_assault_if_you_ask_your_partner_not.json": "My monogamous partner (m) and I (m) would have unprotected sex but he was\nexclusively a top and didn’t understand how bottoming, including the preparation\nand potential… aftermath… worked at all. We both got tested regularly and\nremained monogamous, but I didn’t always want to deal with the messy…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/oqyebo/when_the_fuck_did_it_become_okay_to_take_your_dog.json": "Home improvement stores, restaurants with outdoor seating, malls, etc.\n\nI like dogs, but feel like this wasn’t a thing a few years ago.\n\nI’m not talking about service animals in any sense, I totally get that.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/oqzipn/does_anyone_on_the_reddit_dev_team_realize_how.json": "Like seriously, I can’t scroll through any videos without closing the app on my\niPhone.\n\nWtf is happening?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/or0vdq/is_it_weird_that_i_want_to_be_left_alone_but_also.json": "Like lately I've noticed i went to avoid people but when i look online i see\npeople with plans together in calls and i feel left out and alone",
  "data/reddit-ask/r/TooAfraidToAsk/comments/oraujh/could_a_teen_make_a_wish_kid_wish_for_sex.json": "Im just curious…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/orc9ln/is_virginity_a_turnoff.json": "Writing this feels weird, but I'm 24 year old girl who's never been sexually\nactive, and now I kinda feel like a freak, and I made a Tinder account and I\nwanna date someone and get it over with, but I feel insecure. I fear rejection\nor the awkwardness.\n\nI've been texting some guys on Tinder but when…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/orok1u/why_do_very_religious_people_judge_others_so_hard.json": "I’ve had a few Christian friends who were strongly opposed to gay marriage. A\nfew of them said they would kick their kids out of the house if they were gay.\nWhy? Because it’s a sin or an abomination and they go to hell for it.\n\nA few of these friends in particular, have had sex with multiple women…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/orqc5e/why_do_people_criticize_country_music_for_singing.json": "I've been pondering over this for a while but I haven't thought of an answer for\nit. Possibly because of cultures being different or something. I was raised in a\nrural area in west Virginia and everyone seemed to like country music it was\nplayed constantly, but when I ventured outside of my rural…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/orwaej/can_you_fit_an_egg_in_your_foreskin.json": "My friend has a fetish for wrapping his monumental foreskin around the largest\npossible object. He recently claimed he could fit a whole egg (chicken, inside\nshell) within his wind sock. He then proceeded to do this, but I was unable to\nverify it as it made me feel sick. Just wanted to check if…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/orxxy7/if_people_should_continue_living_because_states.json": "Everytime my mental health spirals, people remind me that my state is only\ntemporary and that I won't feel this way forever. I do feel there's truth to\nthis because sometimes, I'll feel good about life and my episodes are almost\nlike an embarrassing outburst in the past. That being said, I feel like…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/orz736/do_black_people_actually_care_about_non_black.json": "So, I'm from Iraq and I wouldn't just assume the internet is real life. We don't\nhave enough black people here for me to ask so I have no idea.\n\nI'm not even on twitter but the app is a cesspool of people whining about\nanything and everything.\n\nDoes it make a difference to you if the person has…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/oskrk6/i_still_regularly_hold_my_dads_hand_is_this_weird.json": "So I'm 14 and really just do this out of habit I think. My mom died giving birth\nto me so my daddy raised me pretty much on his own until recently where he got\nengaged to the woman who is now my stepmom (whom I love! She's always seen me as\nher own and cares about me deeply). It was just us against…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/osmi5a/how_is_it_possible_to_spend_a_full_24hrs_with_a.json": "I'm a guy and generally I need to shit about once every 12 hours. How is it\npossible that I can go on a road trip and stay in a hotel with my gf and she not\nonce takes a shit? Or when I was single and I would stay over at girl's houses.\nI would always try and be so discrete about shitting in the…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/osmydt/if_100_companies_are_responsible_for_71_of.json": "Why should I go vegan, bike to school each day, use less electronics, turn off\nthe lights every time I leave the room (besides for saving money on bills) if\nwhatever I do has such a minimal impact?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ot1bhn/mom_wants_to_know_how_to_keep_the_family_jewels.json": "My teenage son wants to start distance running. We don't have another male in\nthe home currently. Is there anything a guy needs to wear for running? I only\nrecently learned of my female friends duct taping their nipples for long runs.\nHe went on a 4 mile run one day and he said his thighs chafed. He…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ot4ioq/if_mankind_has_been_created_by_god_on_his_own.json": "I’ve always wondered about this for a while, since God is always represented as\nthe supreme being, omnipotent and perfect creature.\n\nMan is one of the most twisted being on earth, seeking domination and power over\nall (yeah, you can say there’s exceptions to this, but overall, look at the\nstate of…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ot5sjz/do_women_see_lesbians_the_same_way_men_see_gay_men.json": "For context I'm a guy and I've noticed that most of my male freinds are\nuncomfortable with gay men but have absolutely no problem when it comes gay\nwomen. Personally I think they are uncomfortable because they don't like the\nidea that a man would be attracted to them. I just wanted to know if women…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ot6bpr/how_do_you_learn_how_to_have_sex.json": "I’m a 17M and always decline sexual advances for two reasons. 1. I’m yet to find\nanyone I’m attracted to sexually (I find very few people attractive in any\nfashion) 2. I have no idea how to have sex. Ok I know the basic theory of having\nsex with a female, but nothing about how to optimise the…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ot7xjb/im_provax_but_why_is_it_considered_an_ahole_move.json": "this will get downvoted i think but this is really a too afraid to ask question\nfor me. in America its more of a choice than it is a privilege not like other\ncountries where vax supplies are still low. if people don't want to get vaxxed\nwhy bother? like its their own money if they get a high…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ot8036/how_do_women_not_get_stubble_rash_on_their.json": "When I see nsfw pics of women and pointless women are smooth, when I shave its\ncovered in little bumps where the hair follicles are. So how do these women\nachieve this?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ot91w7/why_do_people_think_simone_biles_winning_a_gold.json": "Title says it all. I'm American, and I gain nothing at all if she wins a medal.\nI lose nothing at all if she doesn't win anything. Why do people care so much\nabout her stepping down to protect her mental health? Shouldn't that be more\nimportant than anything else? I don't understand the outrage at…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/otd6o3/it_seems_a_reminder_is_necessary_that_even_though.json": "NOT A COMPLETE LIST OF FAILURE TO ADHERE TO THE RULES.\n\nsexual abuse of children\n\nIf your post implies that children:\n\nCan consent\n\nEnjoy sex with adults\n\nDeserved or otherwise asked for sexual advances\n\nDo not experience sexual trauma\n\nOr otherwise normalizes sexual activity with children, you will…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/otmnc5/do_you_feel_strangely_thankful_for_america.json": "Aussie here. Of course I can see the grand hypocrisy that the USA is as well as\nmany of the social issues over there.... but is anyone else in the rest of the\nworld thankful they exist?\n\nI mean they saved the vast majority of the Western World in WW2, they provided a\ncounter to the Soviet Union's…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/otmycr/whats_the_point_of_strip_clubs.json": "NSFW obviously\n\nNot sure how to start the post but I’m in the marine corps, here a huge part of\nthe culture is partying which includes strip clubs. It really isn’t uncommon to\ngo every weekend. I’ve always said no but the one time I did go was when my\nfriends and I were planning one of my friends…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/otnk25/how_do_you_shave_a_vagina.json": "This is coming from a girl and no carefully isn't a good answer.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/otw5g6/why_is_it_okay_for_a_morbidly_obese_person_to_be.json": "I noticed that people have started a petition to remove Eugenia Cooney from the\ninternet, one of the reasons stated as to why they want to remove her is that\nshe posts pictures of herself. But I never see the same energy towards morbidly\nobese people. They are allowed to post pictures of their…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/otw95r/why_do_people_not_trust_doctors_to_give_them_12.json": "It’s all in the title.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ou01gb/question_for_women_is_it_obvious_when_someone.json": "I have to admit I have a massive weakness, if I see boobs I have to look. I\nnever want to make anyone feel uncomfortable so I try not to have too many\nglances. If a women is showing cleavage, bending down etc. My eyes finds it\nimpossible looking any where else.\n\nSo we go back to my question above…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ou3t9a/when_do_you_start_feeling_adult.json": "I'm 27 years old, I have a husband and all, and yet I still feel like a child\naround people my age or a bit older. I always feel like I have to act polite,\nask permission, do what they tell me to do like they were some aunts and uncles\nthat u have to be careful around. I always feel like they're…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/oueu0m/for_men_do_you_flop_your_genitals_on_the_toilet.json": "I suppose this does not pertain to more ovular toilets with the cutout more\ncommonly found in public restrooms. It would be for the more slightly more\ncircular toilet seats found in homes. I think seat positioning is obviously\nimportant but just wondering what y'all do with your junk. Also, for…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ougs0k/how_do_i_tell_my_parents_that_i_came_blood.json": "This is the second time I've ejaculated with a small amount of blood in it. What\nshould I do? I feel embarassed asking my parents to take me to a urologist or\nbut what am I supposed to do?\n\nSomebody said I should say I only pissed blood and then tell the doctor what\nactually happened, but what then?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ouh1e2/can_someone_tell_me_what_to_do_if_i_find_out.json": "I’m so angry. My friend just told me that one of her “family friends” tried to\ntouch her. She was able to defend herself but she said she doesn’t know what to\ndo. We’re both minors and I live in another city. I don’t know who to call and\nIdk what to do. I really need help.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/oullll/why_do_people_suggest_killing_sex.json": "A lot of people always say sex offenders should be executed or spend life in\nprison but let’s be real here that’s not gonna happen. A lot of sex offenders\nand pedophiles are not going to spend life in prison and are not going to be\nexecuted. So instead of people repeating the same Old narrative over…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ouudhv/is_it_weird_for_a_22_year_old_to_date_a_17_year.json": "So, I've gotten to know a girl in a social group we're in, and we have a lot in\ncommon, and I'd love to ask her if she wants to hang out some time, but as a\n(very soon to be) 22 year old, I feel like I'm maybe pushing what is generally\naccepted in terms of age gaps at our age.\n\nI've never dated…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ouw69n/is_it_common_that_when_you_fantasize_about_your.json": "Alright, so I’m a teenager and a guy. Every now and then my male friends and I\nare talking and we occasionally get on the topic of girlfriends and hot girls in\ngeneral. Usually, at some point someone will suggest how nice sex would be with\nx person and such. That, or seeing them nude or playing with…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ouxhue/why_are_almost_all_cops_dicks_when_they_pull_you.json": "I may have done something wrong but they can tell me that without being a knob.\nEveryone's made mistakes.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ov0n5k/can_you_give_consent_while_drunk.json": "If two people are drunk and both give consent to have sex, is it okay because\none of them isn’t taking advantage of the fact that the other is drunk?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ova4jl/why_am_i_ridiculously_horny_after_moving_into_my.json": "I mean it's almost to a distressing level.\n\nnormally I will engage in single player mode 1 or 2 times a week..\n\nNow I felt a really strong urge to do it more than once a freaking day!",
  "data/reddit-ask/r/TrueAskReddit/comments/ocsv9q/should_we_challenge_consumerism_aka_the_trend.json": "I started a company that is a marketplace where neighbors can rent things from\none another in a safe and secure environment. Our company aims to challenge the\ntrend towards acquiring more and more stuff (AKA consumerism) by proposing an\nalternative where we can bring communities together to share…",
  "data/reddit-ask/r/TrueAskReddit/comments/od0aee/how_much_of_north_american_indigenous_culture_was.json": "I've heard of tribes where none of the young generations learned to speak their\nnative languages and had to relearn them. In parts of Canada there's native\nlanguages written on the stopsigns, are there actually people who have that as\ntheir only readable language? Are most tribes trying to fill in…",
  "data/reddit-ask/r/TrueAskReddit/comments/of4xid/do_you_personally_feel_that_some_peoples_lives.json": "Or is everyone truly equal in your eyes? Lets say a surgeon [brain or heart] and\nan artist [painter, musician, ect.] are both in danger and only one can be\nsaved. Would most people consider saving the surgeon the ''right'' thing to do?\nDoes it also depend on which one in general is a better person?",
  "data/reddit-ask/r/TrueAskReddit/comments/onl1kn/how_do_you_keep_yourself_from_feeling_burnt_out.json": "So I'm about 6 months into my first real job out of college and can already feel\nmyself getting burnt out. I really like my boss, the work isn't hard (however it\nis tedious), and I can't really explain why but I'm getting to the point that I\ndread going into work. How do you guys combat this?",
  "data/reddit-ask/r/TrueAskReddit/comments/op2fvr/if_the_us_legalized_and_taxed_marijuana_on_a.json": " * Infrastructure, improving the criminal justice system, creating jobs, etc?",
  "data/reddit-ask/r/askphilosophy/comments/obmxos/do_scientists_still_take_popperian_falsifiability.json": "Title basically says it all. I got into a thing with a friend (who is an\nengineer, not a scientist) about whether Popper is dead - they said no and\nseemed to think that Popper basically \"solved\" scientific epistemology with the\nfalsificaition criteria, but I (as a working scientist) have never…",
  "data/reddit-ask/r/askphilosophy/comments/occhh5/there_is_no_absolute_truth_is_itself_an_absolute.json": "How do you go about this? Is there absolute truth? Is absolute synonym with\nobjective?\n\n\"people see with their eyes\", could this be considered an absolute truth?",
  "data/reddit-ask/r/askphilosophy/comments/odfr04/is_the_disdain_towards_analytic_philosophy_from.json": "I've been on a continental read now (due to Bentley Hart lol) and have had some\ninteractions with continental philosophers. It seems to me that almost all of\nthem have a certain disdain for analytic philosophy, maybe more than vice versa\nfrom contemporary analytic philosophers who are more…",
  "data/reddit-ask/r/askphilosophy/comments/odon3u/why_is_eastern_philosophy_so_underrepresented_in.json": "Philosophy nowadays is concerned primarily with the works of people such as\nPlato, Aristotle, Hume, Kant, Hegel, Russell, Nietzsche, etc etc etc\n\nIt seems that most of contemporary philosophical discourse is coming out of what\nI would call the anglosphere.\n\nIs there a reason why eastern…",
  "data/reddit-ask/r/askphilosophy/comments/oer7bl/how_can_an_educated_amateur_in_philosophy_get.json": "(I hope this kind of question is allowed under the \"the state of the field\"\nclause in the rules. The lead-in to my question, and the thing prompting me to\nask it, is a personal anecdote, but I imagine the answer to the actual question\ncould be very useful to anyone else like me out there.)\n\nI have a…",
  "data/reddit-ask/r/askphilosophy/comments/ofi2uf/in_what_way_do_abstract_entities_exist.json": "There's a lot of confusion going on within me with regards to abstract entities\nand their ontology. I want to get some clarity and perhaps new ideas.\n\nWhen it comes to mathematics, I'm a very convinced formalist\n[https://en.wikipedia.org/wiki/Formalism_(philosophy_of_mathematics)], believing\nthat…",
  "data/reddit-ask/r/askphilosophy/comments/ogf4cj/what_are_some_cutting_edge_or_fashionable_ideas.json": "I graduated with a degree in philosophy a few years ago. I was planning on\npursuing a PhD, but through strange circumstances I ended up with a music\ncareer. At the time, I was mostly interested in metaphysics and philosophy of\nmind, and my professor told me that panpsychism was the all-the-rage in…",
  "data/reddit-ask/r/askphilosophy/comments/oh5pqx/do_video_games_have_the_potential_to_be.json": "I've long been of the opinion that video games have as much artistic potential\nas film and literature. This possibly extends to more analog games with less\nability to include narrative content, but that's a different concern. But\nrecently I came across this…",
  "data/reddit-ask/r/askphilosophy/comments/oimxl6/how_does_one_deal_with_the_problem_of.json": "Whenever I dive into some position or theory in philosophy, and read a book on\nit, I end up strongly sympathizing with it and think ok this was really\nplausible. But then I think that's no surprise: I just read a book-length\ntreatment on it, while having limited exposure to the whole debate outside…",
  "data/reddit-ask/r/askphilosophy/comments/ojoalj/most_absurd_thing_a_philosopher_has_genuinely_and.json": "Is there any philosophical reasoning you know of, that has led to particularly\nunacceptable conclusions the philosopher has nevertheless stood by?",
  "data/reddit-ask/r/askphilosophy/comments/ok0x5x/relevant_philosophy_books_for_software_engineering.json": "Hey, I’ve been listening to the Philosophize This podcast and I got very\ninterested in Philosophy, I just finished the Kant episodes.\n\nI want to start applying philosophy to my current profession: Software\nengineering. Questions like: “what is data?”, “how can I categorize different\nkinds of…",
  "data/reddit-ask/r/askphilosophy/comments/okhluk/i_know_my_degree_is_useful_but_do_employers.json": "We’re told as undergrad philosophy majors that we have strong oral and written\ncommunication skills and great logical and critical thinking skills.\n\nBut will hiring people know that or believe us when we say it in an interview?\n\nAlong with this question, can anyone tell about their experiences in…",
  "data/reddit-ask/r/askphilosophy/comments/ol3q57/i_spontaneously_came_into_existence_several.json": "I have wondered this for a very long time. For me to spontaneously exist; why\nwould this not be repeated again but with all prior knowledge and identity lost?\nWho am I even, what constitutes my awareness and persona?\n\nI'm probably an agnostic or atheist. I don't believe in God, never have…",
  "data/reddit-ask/r/askphilosophy/comments/oljqjr/deepfaking_the_dead_ethics.json": "In a new documentary about the life and death of Anthony Bourdain, there are a\nfew lines of dialogue in Bourdain’s voice that he might not have ever said out\nloud. Filmmaker Morgan Neville admitted using AI technology to digitally\nre-create Anthony Bourdain’s voice and have the software synthesize…",
  "data/reddit-ask/r/askphilosophy/comments/olxqsc/do_any_philosophers_touch_on_not_giving_into.json": "As I’m getting older into my mid 20’s, I’m finding myself becoming increasingly\npessimistic about politics, the state of the world, the state of humanity as a\ncollective group, and other things. I’ve always considered myself to be overly\npositive and optimistic.\n\nMuch of it seems to be based in…",
  "data/reddit-ask/r/askphilosophy/comments/om0gga/can_philosophy_help_me_overcome_my_simplistic.json": "Growing up I have never been fortunate enough to be educated by deep thinkers. I\nread a lot, but all of my books were shallow \"best-seller\" ones that never made\nme think or question anything. Therefore, most of my beliefs were constructed by\nsimplistic general \"rules\" of life such as \"work hard and…",
  "data/reddit-ask/r/askphilosophy/comments/onbt1s/criticism_of_philosophy_as_such.json": "I just wanted to know if there's any good critiques of philosophy as a field of\nstudy. I'm only speaking from gut-feeling, but sometimes I feel like philosophy,\nand hypotheticals like the trolley problem, detaches us from actual existing\nproblems we face in the material world.\n\nI noticed this…",
  "data/reddit-ask/r/askphilosophy/comments/opqc1q/should_sufficiently_intelligent_animals_that.json": "I was reading about the pre-modern european tradition of animal trials\n[https://en.wikipedia.org/wiki/Animal_trial] where animals could be tried for\nperceived crimes and thought, wait, dolphins are both the go-to example of a\nnon-human person and notorious for raping humans and each other. Should…",
  "data/reddit-ask/r/askphilosophy/comments/oq86l4/i_just_cant_understand_compatibilism_how_does_it.json": "I just can’t wrap my hand around Compatibilism. I have read the definitions and\narticles and discussions, but I still don’t understand why this should make more\nsense than hard determinism.\n\nIm not ignorant, im really open minded and want to understand but I just don’t.\n\nIf I build a simulation…",
  "data/reddit-ask/r/askphilosophy/comments/oqo860/which_philosophers_actually_lived_according_to.json": "I keep hearing that philosphers like Plato were actually full of themselves and\ndidnt actually did what they told their students, me being a noob and not\nknowing better, i came to ask here.",
  "data/reddit-ask/r/askphilosophy/comments/otmy7c/has_anyone_ever_been_afraid_of_solipsism_the_idea.json": "I've been stuck in this thought spiral about reality. Specifically, I got super\nwigged out about wondering if reality is real, etc.\n\nHas anyone ever experienced this and how did you get past it?",
  "data/reddit-ask/r/askphilosophy/comments/otxx7o/what_is_dostoyevsky_saying_about_existentialism.json": "I recently overhead a friend of a relative give their take on Crime and\nPunishment and it has me really confused. They basically said that the book is\nabout Raskolnikov exercising his freedom and trying to create his own meaning\nand values, rather than accepting what societal norms dictate, but this…",
  "data/reddit-ask/r/askscience/comments/ob6jor/what_are_the_theoretical_minimal_and_maximal.json": "I have a rudimentary understanding of pH. I understand that pH below 0 and above\n14 are possible, and that pH depends on temperature so quite different values\nare possible at some extreme temperatures.\n\nFee free to assume that we could get some substance to absolute zero, or convert\nall matter in…",
  "data/reddit-ask/r/askscience/comments/obkz5d/how_does_hawkings_area_theorem_reconcile_with.json": "Hawking's area theorem says that the area of a black hole's event horizon can\nnever decrease, only increase, similarly to entropy. Further, the radius (and\nhence, the area) of the event horizon is determined by the mass inside the\nhorizon. At the same time, Hawking's theory that quantum effects near…",
  "data/reddit-ask/r/askscience/comments/ocw0xa/does_global_warming_make_ocean_less_salty.json": "I mean, with the huge amount of ice melt, it mean amount of water on the sea\nincrease by a lot while amount of salt on the sea stay the same. That should\nresulted in ocean get less salty than it used to be, right? and if it does, how\ndoes it affect our environment in long run?",
  "data/reddit-ask/r/askscience/comments/od3r38/how_is_there_a_fire_in_the_gulf_of_mexico_and.json": "I have been looking at videos of the fire for awhile now. And I am just really\nnot understanding how it’s possible. I understand that there is a large fuel\nleak, but how would ignition even occur accidentally in the ocean?\n\nAnd then we see boats spraying more water on top. What are they trying…",
  "data/reddit-ask/r/askscience/comments/od7o2n/what_major_environment_impact_differences_are.json": "Most people have seen the video of the Pemex oil spill in the Gulf of Mexico,\nwhich is spewing flaming oil into the ocean. My first thought after that it\nlooks like CGI from a disaster movie was that maybe it being on fire could be\ngood since the crude oil is burning and won’t just sit in the ocean…",
  "data/reddit-ask/r/askscience/comments/oejr1p/what_is_a_mud_volcano_how_often_do_they_ignite.json": "Inspired by the news of a mud volcano erupting in Azerbaijan, I starting\nwondering how they form, and how they erupt. If they’re not typically associated\nwith igneous volcanoes, how do they pressurize? Under what circumstances do you\nend up with a mud volcano – or one that ignites?\n\nThank you!",
  "data/reddit-ask/r/askscience/comments/oesncf/askscience_ama_series_im_dr_kate_biberdorf_aka.json": "Hi Reddit! Let me introduce myself. I'm a chemistry professor, science\nentertainer, and author that uses a theatrical and hands-on approach to\nteaching, all while trying to inspire students across the world to fall in love\nwith science. You may have seen me in a blue lab coat and red-bottomed heels…",
  "data/reddit-ask/r/askscience/comments/oeu9z3/how_does_diborane_b2h6_exist.json": "The hydrogens having two bonds is really perplexing to me and it kinda breaks\nwhat we are taught at school about bonding and orbitals.",
  "data/reddit-ask/r/askscience/comments/oew1tx/is_the_temporary_increase_in_volume_when_a.json": "Let’s just say for example a 1x1 ft cube of a metal is heated to the point where\nit physically grows. Is there a relationship between its specific heat and the\nnew volume? Any defined formulas?",
  "data/reddit-ask/r/askscience/comments/of60qi/does_pixelated_camo_also_work_better_against.json": "I've heard that because of the way our brains process, pixelated camos are less\nvisible. I was wondering if this also applies to wildlife.",
  "data/reddit-ask/r/askscience/comments/ofen4n/do_you_get_long_versions_of_other_viruses_other.json": "Long Covid is a thing now but can there be long term versions of other viruses\nthat just don’t get talked about?",
  "data/reddit-ask/r/askscience/comments/ofo6jb/are_there_any_basic_elements_that_we_are_running.json": "I was curious, with all the expansion, and massive production across the globe,\nare there any basic elements that are become harder and harder to find? If so,\nare there any of those elements that can be manmade to act as a substitute?",
  "data/reddit-ask/r/askscience/comments/ofuvyu/what_was_on_the_other_side_of_the_world_when.json": "So the biome of water changes as we get farther away from shore. Coastlines have\ndifferent organisms than the middle of the ocean. Seemingly the farthest “out to\nsea” you could have ever been on this planet is while Pangea was just formed\n(unless there were other land masses on the other side of the…",
  "data/reddit-ask/r/askscience/comments/ogab9m/can_vaccinated_individuals_transmit_the_delta.json": "What's the state of our knowledge regarding this? Should vaccinated individuals\nreturn to wearing masks?",
  "data/reddit-ask/r/askscience/comments/oguw1w/askscience_ama_series_we_are_cosmologists_experts.json": "We are a bunch of cosmologists from the Cosmology from Home 2021 conference. Ask\nus anything, from our daily research to the organization of a large conference\nduring COVID19!\n\nWe have some special experts on\n\n * Inflation: The mind-bogglingly fast expansion of the Universe in a fraction\n   of the…",
  "data/reddit-ask/r/askscience/comments/ogynqs/if_a_hole_was_bored_through_the_center_of_the.json": "We often hear that the barometer is really measuring the weight of the column of\nair above us. This explains variations in altitude within a reasonable range\nabove the surface, but in the interior gravity drops off and eventually goes to\nzero. Is there a point where pressure ceases to increase or…",
  "data/reddit-ask/r/askscience/comments/ohie8w/what_is_the_difference_in_the_covid19_tests.json": "It seems like there are a few types of Covid-19 tests available, including a few\nrapid tests and even some at-home tests, but what are the differences,\nadvantages and disadvantages of each?",
  "data/reddit-ask/r/askscience/comments/ohqu26/what_are_the_oldest_mostlyunchanged_tools_that_we.json": "With “mostly unchanged” I mean tools that are still fundamentally the same and\nrecognizable in form, shape and materials. A flint knife is substantially\ndifferent from a modern metal one, while mortar-and-pestle are almost identical\nto Stone Age tools.",
  "data/reddit-ask/r/askscience/comments/oi1wc0/how_accurate_are_old_temperature_records.json": "I read today that temperatures in Death Valley, California hit a new record of\n130 F degrees, breaking the previous 129 F record in 1913.\n\nHow accurate were temperature readings in 1913? I’m assuming it has improved\nsince then, so what is the process for doing comparisons throughout…",
  "data/reddit-ask/r/askscience/comments/oi1xts/how_are_insane_temperatures_in_fusion_reactors.json": "There was a headline recently that china had cracked a fusion heat record and\nproduced a plasma three times hotter than the sun. How are these temperatures\nmeasured? Wouldn't any device that could do it be destroyed? Is it just like an\nassumption that is made based on how much energy is put into the…",
  "data/reddit-ask/r/askscience/comments/oin588/is_uric_acid_gout_not_handled_by_the_bloods.json": "Hello, I am on the tail end of a gout attack and was wondering if the high\nlevels of uric acid are also supposed to be regulated by the bicarbonate buffer\nsystem. If so, can that buffer be 'depleted' leading to the uric acid not being\ncompensated?\n\nThanks.",
  "data/reddit-ask/r/askscience/comments/ojk7wf/if_we_were_able_to_walk_in_a_straight_line.json": "I hope this question makes sense. I was asked by a 9 year old I teach and didnt\nhave a clue.",
  "data/reddit-ask/r/askscience/comments/ok3xhu/would_your_joint_dry_up_after_you_have_your.json": "I've been reading about synovectomys and for the life of me I cannot find any\ninformation for post operative care. How does the joint make fluid and maintain\ngood lubrication if there is no synovium? Are you just at a hugely increased\nrisk for arthritis and its just about pain management?",
  "data/reddit-ask/r/askscience/comments/okcgkn/are_there_chaotic_systems_in_the_human_body.json": "Does the body contain any systems that are unpredictable due to minute changes\nin the initial conditions?\n\nI was wondering whether there are unpredictable systems in the body akin to\nweather or planetary orbit that over longer periods of time become unpredictable\ndue to tiny differences in the…",
  "data/reddit-ask/r/askscience/comments/okgefs/will_a_transplanted_body_part_keep_its_original.json": "I've read that all the cells in your body die and are replaced over a fairly\nshort time span.\n\nIf you have and organ transplant, will that organ always have the donors DNA\nbecause the donor heart cells, create more donor heart cells which create more\ndonor heart cells?\n\nOr will other systems in your…",
  "data/reddit-ask/r/askscience/comments/okmnfk/why_is_my_body_still_able_to_feel_the_motion_of.json": "this mostly occurs right before i am about to fall asleep.",
  "data/reddit-ask/r/askscience/comments/olel36/askscience_ama_series_were_event_horizon_horizon.json": "Two years ago, we captured the first image of a Black Hole. Ask Us Anything!\nWe'll be answering questions from 11:30 AM - 1:00 PM Eastern Time!\n\nThe Event Horizon Telescope (EHT) - a planet-scale array of eleven ground-based\nradio telescopes forged through international collaboration - was designed…",
  "data/reddit-ask/r/askscience/comments/olhtiv/how_do_intercontinental_bridgestunnels_take.json": "I would assume that being attached to two continents moving away from eachother\nwould slowly but eventually tear the structure apart.",
  "data/reddit-ask/r/askscience/comments/olqi5b/does_reducing_the_swelling_on_a_injury_like.json": "Just wanted to know if its one of those things that we do just to reduce the\ndiscomfort even though the body has a purpose for it...kind of like a fever.",
  "data/reddit-ask/r/askscience/comments/om1ri2/would_a_thermonuclear_bomb_be_more_powerful_if_it.json": "So i recently read about the H-Bomb out of curiosity, and from what i understand\nthe way it works is by fusing the hydrogen nucleus, having a small percentage of\nits mass turn into a ridiculous amount of energy which becomes the explosion.\nSupposedly the reason why hydrogen is used is due to it…",
  "data/reddit-ask/r/askscience/comments/omcrl6/is_there_an_formula_that_can_measure_the.json": "For example, 1,000 upvotes and 10 downvotes would be considered much more\npopular than 5 upvotes and 0 downvotes despite the fact that the first case has\nmore downvotes.\n\nOn the other hand, 200 upvotes and 800 downvotes would be considered much less\npopular than the original 5 upvotes and 0…",
  "data/reddit-ask/r/askscience/comments/omf423/does_the_pancreas_produce_insulin_in_anticipation.json": "As a type 1 diabetic I have to administer insulin some time in advance of\neating. In the same way that someone salivates when expecting/smelling food,\ndoes a normal pancreas release insulin or “get ready” to release it?",
  "data/reddit-ask/r/askscience/comments/onbs7v/askscience_ama_series_were_ucsf_neuroscientists.json": "Hi Reddit! We're a team of neuroscientists at the University of California, San\nFrancisco (aka UCSF). We just published results from our work on technology that\ntranslates signals from the brain region that normally controls the muscles of\nthe vocal tract directly into full words and sentences. To…",
  "data/reddit-ask/r/askscience/comments/onyxkp/why_are_covid_serology_tests_not_recommended_as_a.json": "Presumably, if I have a lot antibodies for a virus floating around - I'd be\nbetter prepared (on average) to avoid infection, won't I?",
  "data/reddit-ask/r/askscience/comments/oo4wew/is_chemotherapy_better_now_than_it_was_10_years.json": "Is the process relatively unchanged or is it more effective / has less side\neffects than it would have had say 10 years ago? What might we expect it to look\nlike in 10 years from today?",
  "data/reddit-ask/r/askscience/comments/opht49/can_moths_or_butterflies_remember_experiences.json": "I was wondering if caterpillars have any sort of memory or habit forming\npatterns. Say for example they locate a really good area rich in food and other\nmates. After transformation is it possible for then to remember that location?\nOr are they completely born new and fresh and rely on instinct…",
  "data/reddit-ask/r/askscience/comments/opjssn/how_do_we_test_for_the_different_variants_of.json": "Do we look for different DNA sequences with the PCR tests, different symptoms?\nWith all the media hammering on about the variants it would be nice to actually\nknow how we identify these.",
  "data/reddit-ask/r/askscience/comments/oqxdqo/why_does_the_speed_of_light_being_constant_for.json": "I'm a layman when it comes to physics, so the question may be ill-formed and/or\nincorrectly framed. I'm trying to really grasp the nature of (flat) spacetime.\nI'm watching this video [https://youtu.be/iBTez-nTKes?t=272], and she says how\nthere's no way for the speed of light to be constant for all…",
  "data/reddit-ask/r/askscience/comments/orkssm/would_a_huge_stretch_of_completely_flat_land_be.json": "If there aren't any hills obstructing anything, and seeing for MILES on flat\nland. Would that land be a very old landform, or not as old?",
  "data/reddit-ask/r/askscience/comments/orqusa/what_do_we_mean_when_we_say_that_an_eagle_has.json": "For instance, is its “picture” just zoomed in? Is it sharper, so sharp that it\ncan so details from really far away? Are the colors brighter? Can it zoom in and\nout on command like a camera? Can it sharpen and blur like a camera? What does\n“better eyesight” mean?",
  "data/reddit-ask/r/askscience/comments/os960x/where_does_the_energy_that_causes_tides_come_from.json": "I know the moon's gravity causes it but from the looks of it, it seems to be\ncreating energy out of nothing which should be impossible, like, does it come\nfrom the energy of the moon's orbit? If so then does that mean the moon will\neventually crash into the earth in however million years?",
  "data/reddit-ask/r/askscience/comments/osnobi/is_nonbinary_presence_lower_or_different_in.json": "My question is a combination of a sociology and linguistics question. Does the\nlanguage of a region being gendered i.e. not having non-gendered pronouns (like\nGerman or Spanish) affect the prevalence of non-binary gender identity, or the\nway in which it presents?",
  "data/reddit-ask/r/askscience/comments/osp3q8/could_enigma_code_be_broken_today_without_having.json": "Obviously computing has come a long way since WWII. Having a captured enigma\nmachine greatly narrows the possible combinations you are searching for and the\npossible combinations of encoding, even though there are still a lot of possible\nconfigurations. A modern computer could probably crack the…",
  "data/reddit-ask/r/askscience/comments/otckcz/what_happens_at_a_chemical_level_when_a_bottle_of.json": "I'm curious about this and don't really see it addressed elsewhere. It's become\ncommon to allow a bottle of liquor (whisky, cognac, etc) to \"rest\" after\nopening. In fact, I just read this in a vodka review: \"It is Beluga’s philosophy\nto have this vodka rest after each step of the production,\"…",
  "data/reddit-ask/r/askscience/comments/otunaj/why_do_we_not_see_deadly_mutations_of_standard.json": "This is written like it's coming from an anti-vaxxer or Covid denialist but I\nassure you that I am asking this in good faith, lol.",
  "data/reddit-ask/r/askscience/comments/otv9wr/askscience_ama_series_we_are_scientists_studying.json": "What can microbiology tell us about life on Earth (and beyond)? Quite a lot,\nactually. Whether searching for extraterrestrial life, understanding the impact\nof extreme conditions on humans or expanding human presence in space it is the\nsmallest life forms that are central to answering some of our…",
  "data/reddit-ask/r/askscience/comments/ou1g76/why_is_light_attracted_to_black_holes_if_it_has.json": "Does light have mass? Because how can it be pulled by gravity without mass?",
  "data/reddit-ask/r/askscience/comments/ou2wkd/is_sleep_debt_from_accumulated_sleep_loss_real.json": "Hi! I'm trying to learn about sleep debt and what are it's limits. I found some\nquestions in this subreddit, but they are from many years ago, and I was\nwondering about the current understanding/latest studies in the subject. And\nwether or not it is an accepted theory.\n\nI saw a lot of info about…",
  "data/reddit-ask/r/askscience/comments/ou6wj6/what_is_the_protection_status_for_the_russian.json": "I can't seem to find statistics and comparable numbers.",
  "data/reddit-ask/r/askscience/comments/ouifcb/askscience_ama_series_we_invented_a_better.json": "We are CRISP-HR Therapeutics, Inc., an early stage biotech company which has\ndeveloped a dramatically improved CRISPR-based genetic engineering platform,\nCas9-HR. The improvements include increased editing efficiency enabling\npreviously unfeasible large edits (1000s of base pairs) at a clinically…",
  "data/reddit-ask/r/askscience/comments/oukb1c/is_there_an_index_which_identifies_the_most.json": "Out of all of the livable geographies on Earth, I expect some should be more\ncondusive to civilisation. Whether it is easier access to more natural\nresources, more fertile land, temperate climate, less geologically active, less\nchance of flooding or drought, or easier access by land, it's clear that…",
  "data/reddit-ask/r/askscience/comments/ovbop6/why_does_it_take_2_weeks_for_the_covid_vaccine_to.json": "Immune suppressing drugs such as acetaminophen, ibuprofen, alcohol, cannabis\netc. (Not seriouser stuff like chemo and steroids)\n\nETA: I’m wondering specifically about the MRNA vaccines. And I’m referring to\ncommon anti-inflammatories like the ones listed, not the immunosuppressive drugs\nused in…"
}