{
  "data/reddit-changemyview/r/changemyview/comments/luq0tn/cmv_science_and_religion_can_perfectly_coexist.json": "I feel like a lot of people think science or religion provide all the answers to\na problem, that either of them holds the 'universal truth'. I believe they just\nprovide a different viewpoint. Science will perfectly explain how I'm able to\nlive (how does my heart beat, why is the air breathable, what…",
  "data/reddit-changemyview/r/changemyview/comments/luysh4/cmv_i_would_be_offended_if_someone_did_not_assume.json": "It is of my belief that humans are naturally going to look at a person and\nsubconsciously determine that they are either male or female based on physical\ncharacteristics.\n\nHumans are sexually dimorphic and with the exception of intersex individuals,\nthe majority of people exhibit physical traits…",
  "data/reddit-changemyview/r/changemyview/comments/luz0p4/cmv_if_you_have_severe_mental_illness_you_should.json": "Before anyone accuses me of promoting eugenics let me state that this is\nactually a personal matter to me. I have ADHD, panic disorder, ocd and\ndepression. At least 3 of those were directly inherited from my father's side.\nSure, I have had some great achievements in my life, some great talents…",
  "data/reddit-changemyview/r/changemyview/comments/luzz0o/cmv_first_dates_should_go_dutch_on_the_bill.json": "Honestly after years of first dates where I was either willing, left, abandoned\nor expected to pay for the first date be it drinks or lunch or dinner, I’m a\nfirm believer in going Dutch (splitting the bill) for the first and sometimes\nthe second date. I have had a woman just eat dinner, order three…",
  "data/reddit-changemyview/r/changemyview/comments/lv362g/cmv_republicans_making_a_golden_idol_of_trump.json": "I watched this youtube video [https://www.youtube.com/watch?v=VvX3E_R8Y-Y&t=2s]\na couple of hours ago about the supposed \"prophecy\" that Trump was going to win\nthe reelection. Literally hundreds of respected prophets made this claim that\nTrump was going to be reelected because they said God himself…",
  "data/reddit-changemyview/r/changemyview/comments/lv7wem/cmv_we_should_not_pierce_babys_ears_for_jewelry.json": "Have you ever been to the mall and heard an infant baby shrieking in pain\nbecause her parents paid someone to pierce her ear? I don’t understand why we do\nthis.\n\nSome say they do it to their baby because it looks pretty, and others say it’s\nfor cultural reasons. Either way, I believe it’s a…",
  "data/reddit-changemyview/r/changemyview/comments/lvb506/cmv_forced_circumcision_of_infants_or_any_person.json": "Circumcision of infants and children is genital mutilation and child abuse. It\nshould be made illegal, notwithstanding cultural and religious pressures.\nGenital mutilation of female children has been made illegal in many nations.\nMale children deserve the same legal protections.\n\n\"Male circumcision…",
  "data/reddit-changemyview/r/changemyview/comments/lvfe12/cmv_you_are_either_for_raising_the_minimum_wage.json": "So, regardless of whether one supports the $15 Minimum Wage (I personally do for\nthe time we live in), it is fairly obvious that keeping it the same at $7.25 is\nat best ignorant or are playing the (small c) conservative position because they\nknow their real aim is unpopular.\n\nThose who support the…",
  "data/reddit-changemyview/r/changemyview/comments/lvgnwd/cmv_single_parenthood_causes_socioeconomic.json": "Whether it be cultural or systemic reasons, single parenthood in my opinion is\nthe greatest factor for socioeconomic status. Single parenthood defined as, \"a\nsingle parent is a person who lives with a child or children and who does not\nhave a spouse or live-in partner.\"\n\nThe following link is data…",
  "data/reddit-changemyview/r/changemyview/comments/lvhhja/cmv_a_lot_of_leftist_issues_are_very_important.json": "This applies to a wide range of things I see discussed in today's talking points\nput forward by the left part of the political spectrum. To give some examples\nI'd mention gender issues, the ongoing controversy around good policing or race\nissues.\n\nMaybe my view of humankind is just way too…",
  "data/reddit-changemyview/r/changemyview/comments/lvjj73/cmv_if_a_man_doesnt_pay_his_ex_child_support_on.json": "When it comes to child support, a common issue seems to be that a minority of\nfathers don't pay it on time. This can have very bad consequences for the mother\nand child, especially when you account for the fact the mother may have to go\ninto debt to cover the expenses of the child and end up paying…",
  "data/reddit-changemyview/r/changemyview/comments/lvmi3v/cmv_most_outcomes_attributed_to_race_are_actually.json": "There are racial disparities (i.e., differences in average outcomes on the basis\nof race) on many outcomes of interest in American society from mortality to\nincarceration to police violence to education. It is common to attribute these\nto racism.\n\nMy view is that this is essentially never the…",
  "data/reddit-changemyview/r/changemyview/comments/lw3fpa/cmv_the_twoparty_political_system_is_broken.json": "Just for context I'm a Brit who has an interest in American politics.\n\n\n\nIn my opinion 2016 broke politics for both the US and the UK. When the liars and\ncheats won the Brexit vote over here and the manner of politics in which Trump\nwon it set a precedent that this version of extreme politics can be…",
  "data/reddit-changemyview/r/changemyview/comments/lw3l8n/cmvi_dont_trust_the_government_with_the_death.json": "I do think some people who are like war criminals who refuse to rehabilitate\ndeserve the death penalty but shouldn't get it. Here is why. I don't trust the\ngovernment, there are many problems with the government (from a US and UK\nstandpoint) like racism and being biased against poor folk. Which when…",
  "data/reddit-changemyview/r/changemyview/comments/lw6204/cmv_us_democrats_should_push_for_a_higher_minimum.json": "So once again democrats are pushing for a $15 an hour federal minimum wage. They\nprobably have the votes in the house, the president will sign off on it, but it\nseems somewhat unlikely that it will get past the senate. I think you could make\na reasonable argument that most of America wants this…",
  "data/reddit-changemyview/r/changemyview/comments/lw6w55/cmv_making_all_new_vehicles_battery_powered_is_a.json": "Volvo just pledged to switch all their cars to electric power by 2030.\n\nI am 100% a believer in electric cars. In general, they are more efficient and\nhave better performance.\n\nHowever, batteries are a terrible energy storage method for vehicles. They don’t\nstore enough energy, they can’t hold their…",
  "data/reddit-changemyview/r/changemyview/comments/lw8ev0/cmv_poc_is_the_same_as_calling_someone_colored.json": "I’ve seen this term used a lot and it is starting to really bother me. You\nwouldn’t call someone colored, but for some reason it’s acceptable to call you a\n“person of color” instead. Like, no. If you’re white you’re a colored person\ntoo, just of a different pigmentation. Terms that separate white…",
  "data/reddit-changemyview/r/changemyview/comments/lwfv6i/cmv_affirmative_action_in_the_united_states_is.json": "Intro: If you don't know what Affirmative Action is, it's basically when you\ngive a different set of policies to a minority to increase diversity or\nemployment. This is coming from a black teenager, and after giving it a ton of\nthought. When you think about it, it's incredibly racist by textbook…",
  "data/reddit-changemyview/r/changemyview/comments/lwjh7g/cmv_you_can_be_racist_to_white_people.json": "Recently, my elementary school going brothers were learning about racism and\nanti-racism in their schools. I asked the question - can you be racist towards\nwhite people? My youngest brother (age 11), thought about it and said no. My\nother younger brother (age 15) said yes. Naturally, this led to a…",
  "data/reddit-changemyview/r/changemyview/comments/lwpnxv/cmv_im_an_exmuslim_living_in_an_islamic_country.json": "No. Hijab isn't strength, it isn't power. It's what everyone forces on you when\nyou probably become 5 and if you don't wear it, then expect to be sexually\nharassed or even killed and murdered and raped(And no one will even support you\nnor punish the rapist according to the Islamic law)\n\nNo. You…",
  "data/reddit-changemyview/r/changemyview/comments/lwpymw/cmv_medically_obese_people_should_really_try_to.json": "Recently i had this argument with multiple people when i said “health at every\nsize was bullshit and that medically obese people who are proud of being obese\nshould change their mindset”\n\nthe person grew pissed and said that i had no right to say that because i was\n“skinny”..? and that people should…",
  "data/reddit-changemyview/r/changemyview/comments/lws41l/cmv_we_as_in_western_society_have_seemingly.json": "For 100s of years it seemed appropriate to view Western society as building a\nbetter life for our children:\n\n * houses were built to last (the house I live in is from the 17th century), so\n   were a permanent improvement to the village/town\n * education systems were built and expanded in years…",
  "data/reddit-changemyview/r/changemyview/comments/lwy5ou/cmv_family_channels_on_youtube_shouldnt_exist.json": "The family channels I am talking about are the family vloggers. The main reason\nis that they exploit their children for money. Their whole channel is mainly\naround their kids and this is fucked up shit as we know that there are literally\npedos all over the internet. Also, these guys complain about…",
  "data/reddit-changemyview/r/changemyview/comments/lx035l/cmv_calling_things_racist_that_are_in_fact_not.json": "So apparently this question was too “loaded” for the other “ask” subreddits. I\ntried to phrase it in a way to not infer my opinion on the topic and just gather\nother points of view but still was removed.\n\nSo I post here, view/question is pretty simple: I am of the opinion that\nmislabeling things as…",
  "data/reddit-changemyview/r/changemyview/comments/lx0erq/cmv_obesity_wouldnt_be_such_a_big_issue_if.json": "We keep (rightfully) reminding people about the benefits of eating healthy and\nthe implications of obesity. Yet, we still see really high obesity rates. I\nthink one reason is that healthy food is more expensive and can be unaffordable\nfor the poorer section of society. I know that currently we have…",
  "data/reddit-changemyview/r/changemyview/comments/lxid5g/cmv_the_blackface_episode_of_community_s02e14.json": "I opened this post with a paragraph about the times we find ourselves in, but\nthat felt too soapbox-y and so I deleted it because this actually bothers me as\nwhat feels like a unique case that was worth openly discussing/debating. Also\nlet me just get out of the way that I don't think there is any…",
  "data/reddit-changemyview/r/changemyview/comments/lxk6jf/cmv_cancel_culture_isnt_a_new_or_uniquely_liberal.json": "In the 50s, you had to be careful about saying things that could be construed as\nsympathetic to communism. After 9/11, criticizing America became taboo. Really\nup until a few years ago, sex and sexuality wasn't something that was freely\ndiscussed. Do you think a gay person could host an event in 80s…",
  "data/reddit-changemyview/r/changemyview/comments/lxpod5/cmv_politicians_need_to_have_a_stronger_emphasis.json": "I think this is systemic on both sides of the aisle. Republicans will\nfear-mongering to drive their policies and agendas, with very little basis in\ndata. Democrats also focus heavily on pushing a \"fairness and equality\"\nnarrative that drives their policies and agendas, oftentimes ignoring…",
  "data/reddit-changemyview/r/changemyview/comments/lxvovm/cmv_black_panther_was_only_nominated_for_best.json": "Proof: The Dark Knight: 84 Metascore Black Panther: 88 Metascore\n\nThe Dark Knight: 9.0 IMDb score, #4 highest rated film on entire site Black\nPanther: 7.3 IMDb score\n\nThe Dark Knight: 94% on BOTH critic and audience scores Black Panther: 96%\ncritic score, 79% audience score\n\nThe Dark Knight: won 2/8…",
  "data/reddit-changemyview/r/changemyview/comments/lxzmo2/cmv_calling_the_use_of_comedic_gifs_involving.json": "There are 2 major issues I have with this viewpoint:\n\n 1. I think the name \"Digital Blackface\" being used to describe the use of black\n    gifs by non-black people is an overreaction and inaccurate. If someone is\n    accused of blackface, it should be because they are literally impersonating\n    a…",
  "data/reddit-changemyview/r/changemyview/comments/ly5ivm/cmvlarge_corporations_like_mcdonalds_and_walmart.json": "Large corporations are largely responsible for the middle class disappearing. I\nthink there should be a legal destination between Regular Joe’s burger shack vs.\nMcdonalds. If your mom and pop restaurant can’t afford 15/hr then they deserve\ngovernment subsidies to assist them to create a good…",
  "data/reddit-changemyview/r/changemyview/comments/ly8nas/cmv_women_largely_let_womens_sport_fail.json": "Woah, this is a spicy one. Here we go.\n\nI'm male and I watch sports that interest me such as cycling, football (soccer)\nand tennis. I also happen to play or partake in all these sports bar the last\none, I can't play tennis very well. I follow all these sports and watch them\nregardless of whether…",
  "data/reddit-changemyview/r/changemyview/comments/lyapvn/cmv_good_baseline_quality_of_life_should_be_the.json": "I believe that society should aim to have a good baseline quality of life,\nrather than income equality.\n\nFirst of all, if the baseline is good, who cares if some people far exceed that\nbaseline? Why does it matter how much income varies if the lowest in society are\nstill OK?\n\nSecondly, the richest…",
  "data/reddit-changemyview/r/changemyview/comments/lzg1uk/cmv_the_potus_doesnt_deserve_the_title_leader_of.json": "I'm not referring specifically to President Biden, but to the position of US\nPresident in general, regardless of party or political positions.\n\nTo be clear, I take issue with the idea of the leader of any country calling\nthemselves \"Leader of the Free World\". No country should be so up itself…",
  "data/reddit-changemyview/r/changemyview/comments/lzhy8w/cmv_the_international_community_should_cut_all.json": "It’s inexcusable that the vast majority of the world still maintains ties with\nChina as they do the worst mass genocide since the Holocaust, and the only mass\ngenocide that can compare to it. China needs to be held accountable and we need\nto send the message that this isn’t ok. The best way to do so…",
  "data/reddit-changemyview/r/changemyview/comments/lzjrxi/cmv_its_not_transphobic_to_not_want_to_date.json": "Probably will get a lot of hate for this but I don't find it transphobic to not\nwant to date trans-people.\n\nI don't really know why just like I can't explain why I like the women I do. To\nme it just comes off as manipulation and an attempt to guilt trip someone into\ndating people they don't want to.…",
  "data/reddit-changemyview/r/changemyview/comments/lzw0kp/cmv_republicans_only_care_about_deficit.json": "During the Reagan, Bush & Trump Administrations, the deficits skyrocketed. The\ngovernment took in less money due to massive tax cuts, and it did not adjust\nspending accordingly.\n\nOnly during Democratic administrations do Republicans clutch their pearls at the\nnational debt and demand austerity…",
  "data/reddit-changemyview/r/changemyview/comments/m0fh31/cmv_people_who_criticize_the_value_of_art_music.json": "I don't like how people say something bad about art, music and other\nentertainment. I sometimes find comments in the social media that tell how\nuseless art, fiction, and music are, and I often become devastated everytime I\nread them. I even once cried about it. Imagine how the world would be if…",
  "data/reddit-changemyview/r/changemyview/comments/m0h77y/cmv_meghan_markle_and_prince_harry_should_go_on.json": "In an interview with Oprah, Meghan Markle said that someone, presumably in the\nRoyal family, expressed concerns about how dark her baby’s skin would be. But\nshe declined to name who she alleges said that because it would be “very\ndamaging to them.”\n\nIf what she alleges is true, that is an abhorrent,…",
  "data/reddit-changemyview/r/changemyview/comments/m0m0cs/cmv_as_a_gay_person_i_find_the_idea_of_having.json": "My issue with pride parades and pride months stems from the fact that it\nseparates the LGBTQ+ community from the rest of society. Unfortunately, some\npeople look at gay/trans pride and say “Why do they get a whole month/parade for\nthemselves? Why do they have to be so different?” Instead, we should…",
  "data/reddit-changemyview/r/changemyview/comments/m0wj71/cmv_politicians_are_more_concerned_with_their.json": "I’m referring to solely American Politicians, although this may apply to other\ncountries\n\nAmericans are obsessed with the rags to riches stories. Don’t get me wrong they\ncan be powerful, but having a “tough past” doesn’t make them a good\npolitician/advocate for you. Sure they can sympathize with the…",
  "data/reddit-changemyview/r/changemyview/comments/m18oow/cmv_the_successful_disassociation_of_products_and.json": "This view has three main points, and the scenario of labeling products that\nemploy children as \"child-labor products\" is used as an example. The main points\nare:\n\n 1. Disassociation of products and the practices applied in their manufacturing\n    is a leading cause of unethical behavior,\n 2. Re…",
  "data/reddit-changemyview/r/changemyview/comments/m1dv1s/cmv_pictures_of_kids_should_not_be_shared_on_the.json": "In an age where we value consent more than ever, why do new parents still think\nit's okay to post pictures of their newborn babies on social media?\n\nTrue, babies don't understand the concept of privacy. But in a few years when\nthose babies are teenagers, they're gonna be pissed that their parents…",
  "data/reddit-changemyview/r/changemyview/comments/m1eojw/cmv_battery_swap_technology_is_essential_to_the.json": "The way EV's are being built currently, swapping the batteries is at worst\nimpossible, at best not economically feasible. This essentially means that the\nhot new EV's today, will be virtually worthless once the battery goes. How long\ndoes a battery last? Best estimates say 8 years. Well, the average…",
  "data/reddit-changemyview/r/changemyview/comments/m1g5jh/cmv_there_is_no_room_for_societal_morality_in_the.json": "Hi All,\n\nSo I'm gonna be honest, this is a pretty new view of mine and I want it to be\nchallenged prior to developing my full feelings on it. This is a sort of\noff-shoot of the dozens of \"not dating a trans person is transphobic\" threads\nwe've been seeing on the sub lately. Please forgive me if I…",
  "data/reddit-changemyview/r/changemyview/comments/m1oced/cmv_biological_males_who_have_transitioned_should.json": "Let me start off by saying I’m a fiscal conservative and a social liberal.\n\nI don’t believe the government should have any say in what folks do in their\nbedrooms and with their bodies. To each their own, and everyone deserves the\nfreedom to love and be as they please.\n\nWith that said, I find the…",
  "data/reddit-changemyview/r/changemyview/comments/m1z87y/cmv_people_shouldnt_be_upset_about_toy_aisles.json": "I’m sure everyone has seen the riveting new development in the news and online\nabout how a lot of stores are considering making toy aisles gender neutral.\n\nI was shocked to see most comments online are passionately against doing this.\n\n...what’s the big deal? I am a CIS gendered straight female but…",
  "data/reddit-changemyview/r/changemyview/comments/m20gjw/cmv_the_royal_family_should_not_be_a_public_burden.json": "The royal family is rich off of their own personal wealth and income from all\nthat they own and brand. Why do countries like Canada have to foot their lavish\nbills whenever one of them shows up to shake hands and take pictures?\n\nI get that the UK may have some cultural reasons for wanting to uphold…",
  "data/reddit-changemyview/r/changemyview/comments/m267vs/cmv_trans_sports_bans_are_a_solution_in_search_of.json": "Various states across the US are pushing new legislation aiming at banning trans\nkids from participating in sports in schools and colleges. The details of the\nbills vary, but most of them target the participation of trans kids in one way\nor another.\n\nI'll be focusing on Mississippi SB 2536, but it…",
  "data/reddit-changemyview/r/changemyview/comments/m2f4wu/cmv_much_of_modern_entertainment_is_junkfood_for.json": "Many food companies that sell processed junk food are billion dollar business\nthat sell people food that is cheap and easy to manufacture with marketing\ntactics. This food, most people would agree, is not not good for us but because\nit is so widely avalilble and it tastes good millions of people eat…",
  "data/reddit-changemyview/r/changemyview/comments/m2i9wf/cmv_mid_2000s_to_early_2010s_was_peak_internet.json": "Sites like YouTube and Newgrounds were relatively new so the creators had full\ncreative control. It was really all about the content and no bs. The Internet in\ngeneral was like this around that time. Social media was more about interacting\nwith others and keeping in touch vs who's the best looking…",
  "data/reddit-changemyview/r/changemyview/comments/m2nb1a/cmv_the_death_penalty_is_more_humane_than_life_in.json": "The more I think about it, the more I become convinced that death is a welcome\nrespite over spending more than ten years in prison. It feels like a more humane\nthing to simply execute people than to throw them into this living hell where\nrehabilitation might as well be nonexistent. I think it might…",
  "data/reddit-changemyview/r/changemyview/comments/m2q8gd/cmv_i_think_people_have_confused_multiple_genders.json": "Here's what I mean: Historically people have associated certain duties or traits\nfor each gender. Historically, men had or were expected to have the tougher or\nmore physical roles (warriors, laborers, construction, etc) and women had the\nphysically easier, though still mentally demanding, ones, such…",
  "data/reddit-changemyview/r/changemyview/comments/m2s6ga/cmv_influencer_culture_is_a_selfsustaining_system.json": "As of the last few years, we have seen an explosion of influential culture from\nTik Tok, Instagram, Youtube, and more. I believe that this creates a\nself-sustaining culture of toxicity where people are idolized and abuse the\ntrust of millions of people.\n\nBecause of their large followings, these…",
  "data/reddit-changemyview/r/changemyview/comments/m2tlm7/cmv_poc_need_to_stop_saying_they_cant_be_racist.json": "I understand what they are trying to say and agree with the point. However, this\nstatement only causes outrage in people and drives them further away from a\nuseful conversation. I have seen this come up many times in arguments and person\nthey are trying to convince just gets angry and starts to feel…",
  "data/reddit-changemyview/r/changemyview/comments/m2xe41/cmv_weed_usage_should_be_treated_with_more.json": "Preface: This opinion is not based on any real data, it is formed through my\nlife experience and what I have seen.\n\nI'm a young adult living and working in California, used to be a hardcore weed\nsmoker (everyday, including frequent dabbing) in high school. I stopped smoking\nhabitually in college. I…",
  "data/reddit-changemyview/r/changemyview/comments/m2zka8/cmv_even_if_its_racist_or_transphobic_to_only.json": "pretty much the title. i feel like amongst all this \"is it t-phobic to not date\ntrans people?\" we are forgetting something fundamental, that when it comes to\nchoosing dating or sexual partners we SHOULD be allowed to discriminate as we\nwish, and any society that shames it people for exercising that…",
  "data/reddit-changemyview/r/changemyview/comments/m39r7k/cmv_the_two_party_system_should_be_abolished_in.json": "The two party system in American politics is far from the ideal system. From its\ninception, it has been problematic and heavily criticized. George Washington\nwarned in his farewell address that a two party system in American politics\nshould be avoided, as it will inevitably lead to division.\n\nGeorge…",
  "data/reddit-changemyview/r/changemyview/comments/m3d730/cmv_waking_up_at_night_from_a_text_is_your_own.json": "It's come to my attention that some people get really pissed when they get texts\nat night. This is especially stupid when they have friends who are known night\nowls.\n\nEDIT: I think that if it's somebody who has stated to you they don't want texts\nat night, then of course it's gonna be your fault…",
  "data/reddit-changemyview/r/changemyview/comments/m3ebe4/cmv_no_amount_of_grassroots_education_or_men.json": "The murder of 33 year old marketing executive Sarah Everard here in the UK was\nbeyond tragic and I think it’s hit public consciousness particularly hard\nbecause for all intents and purposes, she took the right precautions (busy\nLondon street, wore bright clothing etc.) and yet she was abducted and…",
  "data/reddit-changemyview/r/changemyview/comments/m3luac/cmv_basic_dental_and_vision_should_be_included_in.json": "Whether it is universal or private insurance doesn’t matter. There is no reason\nfor them to be excluded or separate. I will be referring in terms of USA,\nhowever, because that’s the only place I have experience with.\n\nAs far as I’m aware the only reason they are often separated is because they…",
  "data/reddit-changemyview/r/changemyview/comments/m3nukb/cmv_people_wouldnt_turn_to_integrative_medicine.json": "Let me preface this by saying I am not a staunch advocate for integrative\nmedicine. I am an advocate for patients not being gaslighted - particularly\nwomen + POC.\n\nI (25F, white) spent the majority of my adult life disabled by pain from\nundiagnosed endometriosis. For 4 years, every single OBGYN I…",
  "data/reddit-changemyview/r/changemyview/comments/m44rm9/cmv_it_is_better_to_regret_not_having_kids_than.json": "Elsewhere on Reddit, I encountered this opinion statement: “It is better to\nregret not having kids than to regret having kids.” I’ve decided that I agree\nwith this perspective for these reasons:\n\n1) NEGATIVE IMPACT ON OTHERS Both of these types of regret could be painful for\nyou personally to live…",
  "data/reddit-changemyview/r/changemyview/comments/m4btcb/cmv_saying_not_all_men_are_rapists_when_women.json": "Seen a lot of women in the UK (after recent events) posting that it's not okay\nto say \"Not all men\". Okay. Let's see you keep that same energy next time a\nterrorist attack happens and you're screaming \"Not all Muslims\"\n\nTo clarify I think both are legitimate arguments. It's the hypocrisy I hate.…",
  "data/reddit-changemyview/r/changemyview/comments/m4g7jb/cmv_cancelingsubsidizing_any_amount_of_student.json": "In light of the U.S. considering canceling student loan debt with President\nBiden pushing $10k and Democrats pushing $50k, the focus seems to be the value\nrather than how to stop the next generation from digging that hole. Background,\njoined military, got school payed for etc. I'm borderline okay…",
  "data/reddit-changemyview/r/changemyview/comments/m4o8g4/cmv_i_should_teach_my_toddler_that_boys_have.json": "The mainstream view right now appears to be that due to the existence of people\nwho are born intersex or experience gender dysphoria, I should be teaching my\ntoddler that some people have penises and some people are boys but there's not\nnecessarily any relationship between those categories.\n\nIn my…",
  "data/reddit-changemyview/r/changemyview/comments/m4rqio/cmv_squirrels_are_evil.json": "Hello,\n\nSquirrels are evil. I know it. I can feel their tiny eyes constantly watching,\nburning with untold hatred and wily malice. I know they are out there,\nsomewhere, patiently waiting for me to drop my guard as they kill time chewing\non some hospital's electric wires.\n\nNothing can stop them from…",
  "data/reddit-changemyview/r/changemyview/comments/m4xgl6/cmv_participants_in_rantiwork_want_to_freeload.json": "Hi everyone,\n\nWas perusing Reddit and came across a subreddit called AntiWork. Their views\nseem mostly centered around flaws in the capitalist system in which they feel\nthey should not HAVE to work, that it should be voluntary.\n\nMaybe I'm mischareceterizing their views but to me it seems like a…",
  "data/reddit-changemyview/r/changemyview/comments/m50xbi/cmv_some_people_are_destined_to_not_find_love_or.json": "I really like this quote to sum it up “Remember that you are an actor in a\ndrama, of such a kind as the author pleases to make it. If short, of a short\none; if long, of a long one. If it is his pleasure you should act a poor man, a\ncripple, a governor, or a private person, see that you act it…",
  "data/reddit-changemyview/r/changemyview/comments/m58cvo/cmv_if_your_parents_paid_for_your_college.json": "I got into a heated argument with a friend who just graduated from medical\nschool. He was posting about now he earned his success on his own when in fact\nhis parents paid for the 500k tuition fees in full.\n\nI understand it isn’t easy to graduate from medical school or in any other\ncourse for the…",
  "data/reddit-changemyview/r/changemyview/comments/m5gtw0/cmv_men_who_call_themselves_alpha_are_pathetic.json": "For several reasons; the alpha theory was based on wrongful studies of wolves.\nThe man who made up the theory regretted the books he published, and went back\non his word. Wolves don't have alphas, they have parents. Proof:\nhttps://youtu.be/tNtFgdwTsbU\n\nSo when I see humans trying to apply this…",
  "data/reddit-changemyview/r/changemyview/comments/m5k3ho/cmv_the_democratic_party_is_just_as_dangerous_as.json": "The Democratic Party represents, in American mainstream popular culture the\n\"good guys\" of American politics. To a great deal of Americans, they are viewed\nas the caring and sweet souls who are always there to give speeches about how\ngreat things can be if Americans unite, who have their pronouns in…",
  "data/reddit-changemyview/r/changemyview/comments/m5lpqt/cmvwe_need_to_stop_the_practice_of_teaching_our.json": "The amount of times I've seen Reddit/Facebook posts about how a child has been\nbullied and a school does quite literally less than nothing, e.g. by not dealing\nwith said bully but in actual fact suspending both students due to a zero\ntolerance policy's. Now this does two things, first it says to the…",
  "data/reddit-changemyview/r/changemyview/comments/m5tkku/cmv_defunding_the_police_makes_zero_sense_in_the.json": "With the tragic murder of Sarah Everard, the “defund the police” crowd have come\nto the forefront of grassroots politics again (first rearing their heads in the\n2020 BLM marches, several of which I attended).\n\nI’m fairly left wing, even sympathising with communism at times. But I feel this\nis the…",
  "data/reddit-changemyview/r/changemyview/comments/m6h2j4/cmv_nonhererobinary_people_making_up_their_own.json": "I get Male and Female, and Trans pronouns. I get Non-Binary preferring\n“They/Them/Their” until we can find something more suitable, but the whole\n“Flee/Fler/Flem” thing doesn’t make sense. Putting random letters in front of\n“ee/er/em” suffixes make the individual who chooses them hard to take…",
  "data/reddit-changemyview/r/changemyview/comments/m6is1i/cmvemployees_in_noncustomer_facing_roles_should.json": "I think that if your work does not require direct contact with customers or\nworking in person with a physical product, you should be allowed to work from\nhome or at least be allowed a flex schedule where you can go into the office, if\nneeded. There are numerous benefits for both employees and…",
  "data/reddit-changemyview/r/changemyview/comments/m6kp5y/cmv_addiction_is_not_a_choice_but_rather_a.json": "I agree that there are many points in which a person can stop and go back before\n-for example- shooting up on some heroine, however, that same person does not\njust wake up one day and think to themselves \"hey, let's get addicted to\nheroine\".\n\nI mostly believe that addiction is not a choice because…",
  "data/reddit-changemyview/r/changemyview/comments/m6nlsz/cmv_there_is_nothing_morally_or_ethically_wrong.json": "This is not a meme. I am 100% serious. I unironically want to bring back the\nduel.\n\nI do not believe there to be anything wrong with two consenting adults agreeing\nto duel each other to the death. Nor do I think there is equally anything wrong\nwith a consenting audience who are willing to pay to…",
  "data/reddit-changemyview/r/changemyview/comments/m6qmbn/cmv_people_should_be_more_ashamedcritical_of.json": "A lot of sexual kinks and porn feature situations that are usually considered\npretty morally abhorrent, including rape, incest, cheating, abuse of power,\nsexism, blackmail, and more. Lots of hugely popular porn involves these things;\nin fact it’s sometimes hard to find porn without these things…",
  "data/reddit-changemyview/r/changemyview/comments/m72p9c/cmv_david_dobriks_videos_have_always_been_creepy.json": "Even as a dumb kid watching David's videos years ago I could tell something was\noff. It was always weird to me, there was always that implied pressure to say\nyes because you are on camera and it made me slightly uncomfortable.\n\nLooking back, it's even worse. Asking people to do dangerous or…",
  "data/reddit-changemyview/r/changemyview/comments/m77fwf/cmv_for_any_rapesexual_assault_allegations_there.json": "From a support standpoint, yes I think should believe all women\n\nBut when it comes to consequences, legal or otherwise such as being fired from a\njob or removed from a position, there should always be due process and an\ninvestigation prior to judgement being passed, yes even if “you know he did…",
  "data/reddit-changemyview/r/changemyview/comments/m7aq6j/cmv_properly_raised_eggs_should_be_considered.json": "While I realize by some definitions of vegan this is impossible. In terms of how\nI abstract the overarching behavior and reasonings for being vegan, it in many\nways comes down to reducing the suffering and abuse of animals as much as\nreasonable.\n\n \n\nTo me, if you raise chickens in an environment…",
  "data/reddit-changemyview/r/changemyview/comments/m7kdkh/cmv_as_a_member_of_an_marginalised_group_i_am.json": "Someone told me this is just my self hatred speaking so I guess this opinion\nneeds to change;\n\nAs an autist I think it just doesnt matter at all if an autistic character is\nportrayed by an autistic actor, they are ACTING, if they are directed wrongly\nthey might as well be a normal actor.\n\nId rather…",
  "data/reddit-changemyview/r/changemyview/comments/m7oaw1/cmv_people_wish_you_success_but_most_people_dont.json": "I’ve mainly experienced this in my family. There’s so much competition and\ninsecurity between people but you wouldn’t know by looking from the outside. I\nthink most families are like this from talking to people but I could be wrong.\nIt just seems that way.\n\nI want to believe all of this isn’t true…",
  "data/reddit-changemyview/r/changemyview/comments/m7v025/cmv_high_school_should_prepare_students_to_become.json": "I realize this has probably been done to death, but I've been thinking about\nthis a lot lately. Also, a couple of disclaimers. I'm coming from a US\nperspective, so I apologize if any terms or concepts don't correlate to other\ncultures. And, I graduated from high school ten years ago, so it could be…",
  "data/reddit-changemyview/r/changemyview/comments/m7zerb/cmv_there_is_no_benefit_to_having_the_electoral.json": "For those who don't know/don't understand how it works, the U.S. uses a system\nof electors to elect the president. Each state has a certain number of electoral\nvotes which aren't proportionate to their population (less populated states are\noverrepresented, more populous states are under represented)…",
  "data/reddit-changemyview/r/changemyview/comments/m80o3d/cmv_if_were_gonna_have_affirmative_action_it.json": "Oooooh, another AA post, hooooow originaaaal\n\n(Preface: I think \"minority\" includes Asians, but lets pretend it doesn't for\nthe purposes of the post)\n\nWhy does AA exist? Minorities in the US face greater obstacles and should not be\nexpected to be as achieving as their white and asian counterparts.…",
  "data/reddit-changemyview/r/changemyview/comments/m8htxe/cmv_people_with_autism_can_infact_learn_how_to.json": "Autistic person here, before anyone comes at me.\n\n(20F for context) I was diagnosed on the mid-high end of the spectrum when i was\n8 years old. I was considered higher functioning but it was still noticeable\nenough to get me referred for a diagnosis from my school. I struggled with a lot\nof things…",
  "data/reddit-changemyview/r/changemyview/comments/m8jesn/cmv_joel_osteen_is_a_preacher_of_demons_not_the.json": "I am not a Christian, or a believer in God. I do like to read, and I will try to\ngive my best definition to what the Christian God is.\n\n\n\nFirst, you worship God because he is the one and only true God. He is the God of\ngods. That is, while other immortal beings exist, God is the creator of…",
  "data/reddit-changemyview/r/changemyview/comments/m8ugqf/cmv_if_you_are_a_gamer_who_flames_their_teammates.json": "It is something that I genuinely can't wrap my head around. I've played sports\nfor most of my life and I believe it gave me a pretty solid sportsmanship, so\nmaybe this is what shifts my perception. But in sports, in my opinion, if my\nteammates are less good than I am, it is my job to carry them.…",
  "data/reddit-changemyview/r/changemyview/comments/m8ydr4/cmv_declawing_cats_should_be_illegal_in_every_us.json": "22 countries have already banned declawing cats. It is inhumane and requires\npartial amputation\n[https://www.humanesociety.org/resources/declawing-cats-far-worse-manicure] of\ntheir toes. Some lasting effects include weeks of extreme pain, infection,\ntissue necrosis, lameness, nerve damage, aversion…",
  "data/reddit-changemyview/r/changemyview/comments/m98zuz/cmv_while_the_recent_events_in_atlanta_are_being.json": "Attacks on Asian Americans are now being reported more frequently. Stop Asian\nHate is the trending motto and people are even planning demonstrations this\nweekend. I completely agree that all racial violence should be called out in all\nits forms. We should never ignore it. But why are we continuing…",
  "data/reddit-changemyview/r/changemyview/comments/m9ccgd/cmv_saying_that_an_autistic_person_needs_to_play.json": "Before you argue that I am saying autistic people shouldn't be in film and\nmedia, let me clarify I am not saying that. I just feel like the argument that\nthey should or have be played by neuro-atypical individuals doesn't make a whole\nlot of sense.\n\nWhen Smile was released by SIA a prevailing…",
  "data/reddit-changemyview/r/changemyview/comments/m9jmlr/cmv_student_loan_debt_shouldnt_be_forgiven_but.json": "TL;DR we shouldn’t forgive up for 50k in debt. Instead we should make all\ninterest rates 0% and let past payment count toward the original amount of debt.\n\nEdit: I realize I should’ve said cancelled instead of forgiven too keep in line\nwith the current messaging about the issue.\n\nPreface: I believe…",
  "data/reddit-changemyview/r/changemyview/comments/m9pv76/cmv_the_concept_of_believe_women_and_innocent.json": "Thought about this after reading someone I follow on Twitter regarding DeShaun\nWatson n his sexual assault allegations (back when it was just the one) about\nhow these ideas weren’t in conflict. And yea, the idea that they aren’t in\nconflict confuses me, because the idea that I am supposed to believe…",
  "data/reddit-changemyview/r/changemyview/comments/m9vbkt/cmv_its_totally_normal_to_not_be_attracted_to.json": "Disclaimer: 35M in france.\n\nI try a lot to resolve my problems:\n\n * reading about my abandonment issues (attachment theory etc, my parents\n   separated when I was 3 months old)\n * medical treatments\n * physical activity (running 60 min every 2 days)\n * pursuing projects and a schedule\n * going into…",
  "data/reddit-changemyview/r/changemyview/comments/m9vm64/cmv_hashtags_wont_defeat_racism.json": "Hi. I go to school about ten mins from where the shooting happened in Atlanta,\nnot that that makes this any more or less relevant. It's a terrible, racially\nmotivated tragedy. But nobody who's racist is going to see #stopasianhate or\n#blm or whatever and think, damn it, you know, they're right--I…",
  "data/reddit-changemyview/r/changemyview/comments/ma0p26/cmv_if_religions_cant_be_taxed_they_should_at.json": "Lately there’s been a lot of videos of priests and pastors openly talking about\npolitics in their churches and how Biden is the devil and trump is a gift sent\nfrom god or whatever. The common response to this is usually ‘tax the hell out\nof them.’ While I agree that’s what should happen I don’t…",
  "data/reddit-changemyview/r/changemyview/comments/ma1ny6/cmv_saying_that_white_people_cant_experience.json": "EDIT:I'm so glad I posted this, I have some very, very insightful answers. And I\ncan see the difference between systemic and institutional racism. However, this\ndoesn't help in the fact that racism and discrimination is considered right, no\nmatter who it's against. My view is not changed as of yet…",
  "data/reddit-changemyview/r/changemyview/comments/ma4piq/cmv_unpaid_internships_should_be_illegal.json": "Unpaid internships are essentially ways for companies to work the hell out of\nhigh schoolers/college kids for free under the guise of ‘a good experience’ and\nI’m sick of it. Yes, the experience is valuable, but there are plenty of kids\nthat cannot afford to work for free because they need money, no…",
  "data/reddit-changemyview/r/changemyview/comments/macp7m/cmv_title_king_of_the_jungle_should_belong_to_the.json": "Tigers deserve the title of king of the jungle, here are my reasons.\n\n 1. Tigers actually live in the jungle, while lions live on the open savanna.\n\n 2. A tiger would easily best a lion in a fight.\n    [https://dinoanimals.com/animals/lion-versus-tiger-fight/]\n\n 3. Tigers, especially Siberian, are…",
  "data/reddit-changemyview/r/changemyview/comments/mambhn/cmv_it_is_wrong_for_online_trolls_to_have_their.json": "It strikes me that in conversations about online trolling, where real-world\nexamples are used as illustrative material the poster’s handle is commonly\nobscured. I’ve recently watched three TV documentaries on the subject of online\ntrolling.... Caroline Flack: Her life and death, Jesy Nelson: Odd one…",
  "data/reddit-changemyview/r/changemyview/comments/maoi81/cmv_it_is_entirely_moral_to_pirate_media_that.json": "I'm speaking more of video games than anything else, but my point stands for\nmovies or anything other forms of media as well. If the original creator of\nsomething is no longer selling it, this giving me no way to support them, I\nshouldn't feel bad at all for pirating it. As an example, there is a…",
  "data/reddit-changemyview/r/changemyview/comments/mau8s0/cmv_the_greatest_threat_to_successful_first_world.json": "The select few in power (the 1%, if want to call them that) want us to believe\nour neighbors are our enemies: that the person on the left is a radical\nsocialist and that the person on the right is a nazi. This way it’s more\ndifficult to foster equity between people of differing views and among…",
  "data/reddit-changemyview/r/changemyview/comments/mb3oh8/cmv_landlords_arent_bad_and_are_just_the_same_as.json": "I don't understand all the hate toward landlords. The way I see it they are just\nlike any other investor. for example: if I had a set amount of money, say\n100000, and i wanted to invest it. There were 2 options: buy a tesla stock, or\nbuy an apartment to supplement my income. Obviously there are bad…",
  "data/reddit-changemyview/r/changemyview/comments/mbfn6q/cmv_things_do_not_happen_for_a_reason_and_the.json": "Recent events have me thinking yet again about this idea, one that has become an\nundercurrent of my 20's. Its something that sparks a mild existential crisis\npretty much every time I think about it. I tend to vacillate back and forth\nbetween the two viewpoints but I feel like believing things DO…",
  "data/reddit-changemyview/r/changemyview/comments/mbsvxe/cmv_i_dont_understand_some_arguments_or_concepts.json": "To preface: I don't consider myself inherently \"trans-phobic\". I believe\ntrans-people have rights, should not be discriminated against and have every\nright to bodily autonomy to do what they wish with their bodies.\n\nI'm hoping someone smarter/more knowledgeable than me can help de-tangle some…",
  "data/reddit-changemyview/r/changemyview/comments/mbuwmj/cmv_having_different_pronouns_whilst_not_being.json": "I'm seeing a trend of people non-transgender people talking about their\npreferred pronouns, and which pronouns make them feel either 'comfy' or\n'uncomfy', and I don't know if there is any scientific backing behind it\nwhatsoever.\n\nDoes it really cause someone distress that identifies as a girl to be…",
  "data/reddit-changemyview/r/changemyview/comments/mbyil9/cmv_banning_guns_in_the_us_wont_solve_our_issue.json": "The tragedy of the mass shooting in Boulder has everyone up in arms talking\nabout banning guns, but I think that's far from the answer to ameliorate current\ndeeply rooted issues in America with guns. Although these mass shooting deaths\nare very sad, they kind of remind me of airplane crashes -…",
  "data/reddit-changemyview/r/changemyview/comments/mc43s5/cmv_we_are_misusing_phobia_as_a_way_to_bludgeon.json": "Phobias are very specific medical conditions. According to Mirriam-Webster is is\nan exaggerated and often disabling fear usually inexplicable to the subject and\nhaving sometimes a logical but usually an illogical or symbolic object, class of\nobjects, or situation. That is all it is, that is all it…",
  "data/reddit-changemyview/r/changemyview/comments/mc52nb/cmv_you_have_to_be_straightup_ignorant_to_think.json": "The argument that criminals will get themselves a gun, no matter what, is a\nflawed way of thinking. This only works if we assume that everyone who commits a\ncrime with a gun is a complete anarchist, with no respect for any law, anywhere.\nIt also assumes that they are all very resourceful and know…",
  "data/reddit-changemyview/r/changemyview/comments/mccjeg/cmv_the_ongoing_aimee_challenor_drama_is_a_good.json": "You can read about the drama here:\n\nhttps://www.reddit.com/r/OutOfTheLoop/comments/mbzggv/why_has_r_gone_private\n\nThe tl;dr is that reddit's newest admin, a woman named Aimee Challenor, lived in\nthe same house as her father while he raped and tortured a child over 10 days\nfor which he was convicted,…",
  "data/reddit-changemyview/r/changemyview/comments/mcg2gi/cmv_rblackpeopletwitter_having_a_somewhat_race.json": "Just like the title says, I can sort of understand where they are coming from\nbut it does more harm than good. Even if the majority of Reddit is white doesn’t\nmean that comments will turn into white supremacy rants. If someone is being\nracist than I would imagine they would get reported or downvoted…",
  "data/reddit-changemyview/r/changemyview/comments/mcr3uw/cmv_dont_talk_to_the_police_usa.json": "Based on Regent Law Professor James Duane's best-selling book on the same\nsubject, You Have the Right to Remain Innocent.\n\nBy law, a prosecutor can see to it that nothing you tell the police is used in\ncourt to help you. That’s a law. Save the good stuff for your lawyer and your\nday in…",
  "data/reddit-changemyview/r/changemyview/comments/mcvyxt/cmv_mental_health_checks_for_gun_purchases_are_a.json": "I keep reading about how we need to take guns away from people with \"mental\nhealth issues\".\n\nAlmost never does anyone advocating for this think it through all the way:\n\nFirstly, it's nonsensical given the statistics. Mass shooters are not more\nlikely to have a diagnosed mental illness than anyone…",
  "data/reddit-changemyview/r/changemyview/comments/mcx6dv/cmv_the_first_woman_president_getting_there.json": "I've seen conservatives on Twitter trying to invoke the 25th Amendment after a\nclip of Joe Biden at the end of a press conference \"looking confused\" and the\nstaffers asking the reporters to leave.\n\nI don't think Kamala Harris, potentially the first female president getting to\nthat office would be…",
  "data/reddit-changemyview/r/changemyview/comments/mcy9s2/cmv_discriminating_against_asians_in_educational.json": "So, I was reading this article\n[https://quillette.com/2021/03/24/anti-asian-discrimination-is-real-and-an-attack-on-american-values/]\nand I found myself feeling absolutely flabbergasted by the fact that\nAsian-Americans are being discriminated against in education. If you don't feel\nlike clicking the…",
  "data/reddit-changemyview/r/changemyview/comments/md0ndq/cmv_the_inclusive_lgbtq_flag_isnt_actually.json": "Recently, there have been images of an \"inclusive\" pride flag which adds black\nand brown to represent people of color. While this is a nice idea, it makes\nabsolutely no sense. LGBTQ+ is a community of gays, lesbians, bisexuals,\npansexuals, omnisexuals, asexuals, aromantic people, transgender…",
  "data/reddit-changemyview/r/changemyview/comments/md585r/cmv_if_you_believe_all_men_have_a_responsibility.json": "I am a man, I concede that the violence committed by men is abhorrent. I agree\nthat there is WAY too much of it. While I agree that cultural elements probably\nplay a part but I also think some of the biological elements that lead men to\nextreme behaviors in pretty much every avenue, are also…",
  "data/reddit-changemyview/r/changemyview/comments/md6bmn/cmv_the_us_doesnt_care_about_the_impoverished_and.json": "I watched this moving video here [https://v.redd.it/pm992ctrg3p61] from a woman\nwho shared her journey and those close to her who share a similar experience of\nliving in poverty. Reading the reddit comments made me realize that no one in\npositions of power really care about the people at the bottom…",
  "data/reddit-changemyview/r/changemyview/comments/md7015/cmv_even_if_you_feel_lonely_cheating_in_a.json": "I'm not talking about when someone is abusing you or these third world contries\nwhere women are basically forced to marry men they don't love. I'm talking about\na semi normal relationship/marriage where a partnery cheats. I understand that\nyou may feel lonely and that your partner is putting enough…",
  "data/reddit-changemyview/r/changemyview/comments/mdafnf/cmv_polyamory_is_just_glorified_fomo.json": "Edit: It’s come to my attention that there’s a difference between polyamory and\nopen relationships. Due to my lack of knowledge in the topic, I wrote this post\nmostly thinking about open relationships, so maybe take that into consideration\nwhen reading this. But it also works for other non…",
  "data/reddit-changemyview/r/changemyview/comments/mdcb9m/cmv_every_letter_almost_after_lgbt_is.json": "LGBT basically covers everything\n\nL (Lesbian): women attracted to women\n\nG (Gay): men attracted to men\n\nB (Bisexual): people of either gender attracted to either gender\n\nT (Trans): people of either gender who feel they are of the other gender\n\nThe only ones I can see fitting in would be intersex and…",
  "data/reddit-changemyview/r/changemyview/comments/mdloqk/cmv_most_nutrition_claims_are_bspseudoscientific.json": "I realized I might be biased in this, as someone who has serious medical issues.\nI’ve been unbelievably irritated by diet and nutrition advice over the years,\nand have always felt it could be potentially dangerous — so I just wanted to get\nthat out in the open.\n\nI’ve heard eating healthier can…",
  "data/reddit-changemyview/r/changemyview/comments/mdnswx/cmv_we_shouldnt_boil_lobsters_alive.json": "So, it’s a common practice to boil lobsters alive - this is understood, right?\nWe do this for many reason - to maintain freshness, the. ‘aesthetics’ of\nchoosing a lobster out of a tank to eat, the difficulty of actually killing\nlobsters through others means, etc.\n\nBut I really don’t think we should…",
  "data/reddit-changemyview/r/changemyview/comments/mdo0bh/cmv_90s00s_movies_had_more_and_better_minority.json": "During that time many famous black actors were at the height of their careers.\nDenzel Washington, Will Smith, Sam Jackson, Morgan Freeman, Halle Barre to just\nname a few.\n\ni feel like nowadays you don't see many nonwhite actors in leading roles in\nblockbusters. It's almost always in movies about…",
  "data/reddit-changemyview/r/changemyview/comments/mebbxe/cmv_book_piracy_isnt_always_bad.json": "A bit of background about myself: I'm a college student with basically no\ndisposable income. I can't afford any luxuries - I only eat at the cafeteria,\ncycle through the same few outfits, etc. The only reason I can even pay tuition\nis because I was fortunate enough to be granted a scholarship.\n\nI…",
  "data/reddit-changemyview/r/changemyview/comments/mef9cu/cmv_hard_work_does_not_always_equal_success.json": "Why do some people tell those less successful then them, \"you must work hard\" or\n\"stop lazy and work hard\", or \"you must work hard like me\".\n\nI just don't believe hard work ALONE is enough for a financially successful life\nfor some people. If hard work was all it took, wouldn't many people living…",
  "data/reddit-changemyview/r/changemyview/comments/mekgpy/cmv_healthy_animals_should_never_be_put_down.json": "I understand the issue about space, accommodation and how many shelters are\nalready struggling taking care of the ones in shelter, needing 24/7 care and\nattention. But do we put down our family who are going through similar or more\npainful health issues? Family who’s fighting through cancer, or…",
  "data/reddit-changemyview/r/changemyview/comments/meoj5k/cmv_children_shouldnt_be_raised_as_a_certain.json": "I don’t think it’s right and fair to raise children and teach them a certain\nreligion growing up. Being constantly taught and told something is the truth\nwhen you don’t have the brain capacity to decide for yourself just isn’t right.\nPersonally, I was raised as a Christian. That meant every Sunday,…",
  "data/reddit-changemyview/r/changemyview/comments/mepw1c/cmv_i_dont_see_whats_wrong_with_suicide.json": "A lot of my friends have been dealing with suicidal thoughts recently. If they\ncome to me for advice, I really struggle on how to tell them/encourage them to\nkeep living. I've been in their position but I really don't understand why\npeople are so against suicide. If they don't like their life then…",
  "data/reddit-changemyview/r/changemyview/comments/mf2gzd/cmv_being_an_introvert_or_extrovert_does_not_make.json": "It's unfortunate to see a lot of people base their assumptions and opinions of\nhow great a person is based on their confidence or ability to be in social\nsettings more easily than others. If someone is generally quiet with not too\nmuch to say, they are commonly labelled as \"boring\" or \"arrogant\"…",
  "data/reddit-changemyview/r/changemyview/comments/mfeyz3/cmv_journalists_that_report_on_deathsadverse.json": "Recently there have been a number of articles on deaths and adverse reactions\nexperienced by people who have taken a Covid vaccine. It is fine to report on\nthese events, but IMO it is incredibly irresponsible (EDIT: negligent) of\njournalists to leave out the very important detail - namely the lack…",
  "data/reddit-changemyview/r/changemyview/comments/mfhekc/cmv_people_should_stop_using_the_small_penis.json": "So I have done it, maybe you have, but we have seen the douche in the big 4x4\nlifted F-450, who parks like he owns the world, doesn't tip waitresses despite\nmaking 400k a year, doesn't respect anyone, you know the rest. Well the first\nthing a lot of people like to go to for a good dig on them is…",
  "data/reddit-changemyview/r/changemyview/comments/mfpc1k/cmv_us_people_have_it_easier_and_saying_that_its.json": "Now, I'll start by saying that I don't mean that the pain and suffering that\npeople in the US is fake, not that, everyone's pain is absolutely real and they\ndeserve help. And the US DOES have their problems, mainly police brutality and\nhealth expenses. But still, my point is that, while they do have…",
  "data/reddit-changemyview/r/changemyview/comments/mfzwkj/cmv_donald_trump_supporters_are_cultlike.json": "I don’t understand why he deserves so much attention and love towards his\npersona, I never seen anything like it.\n\nI personally know people who support Trump, and their obsession with him is far\nfrom healthy (I know that my anecdotal experiences are not a complete proof to\nmy statement, but that’s…",
  "data/reddit-changemyview/r/changemyview/comments/mg9kvf/cmv_modern_gender_theory_places_way_too_much.json": "I am a woman in my mid/late 20’s and I grew up hanging out with boys all the\ntime. I dressed in boy clothes all the time and loathed anything feminine. I\nalso realised that at a young age that I am attracted to both men and women. I\nthink if I had grown up in today’s social climate, I might have…",
  "data/reddit-changemyview/r/changemyview/comments/mgj18b/cmv_theres_no_down_side_to_having_at_least_one.json": "This view comes from a recent event\n\nI think the best compromise when it comes to changing rooms and bathrooms when\nit comes to gender identity is having at least one gender neutral bathroom or\nchanging area.\n\nThere’s no downside to it that I can see. Anyone can use it it so it’s not like\nit won’t…",
  "data/reddit-changemyview/r/changemyview/comments/mglg30/cmv_folks_is_a_reasonably_inclusive_gender.json": "I just want to start by saying this might be the only instance of something that\nI would actually, unironically call \"virtue signaling\" -- a term I usually\ndisdain and find dismissive of social progress. But in this case, that's exactly\nwhat I think it is.\n\n\"Folks\" is an inclusive word. It means…",
  "data/reddit-changemyview/r/changemyview/comments/mglw01/cmv_the_individuals_that_killed_that_uber_driver.json": "It’s a sticky situation and my heart goes out to both families. But I strongly\nbelieve that these individuals that committed this crime should have to deal\nwith the consequences of their actions. I’ve seen people try and say that the\nkids didn’t mean to kill the under driver, they just wanted to…",
  "data/reddit-changemyview/r/changemyview/comments/mgnzjs/cmv_it_is_not_polite_or_normal_conversation_to.json": "I realize a certain amount of mandatory evangelism or outreach takes place, but\nambushing what was otherwise a friendly exchange is off putting and sometimes\nannoying.\n\nIt happens in the randomest of places: out for a walk in the park, overseas on\nthe beach, sometimes the person can get downright…",
  "data/reddit-changemyview/r/changemyview/comments/mgtmea/cmv_gyarados_shouldve_been_waterdragon_type_not.json": "Gyarados evolves from the weak and underwhelming Magikarp, which is what makes\nit especially memorable. Several Pokedex entries tell of its destructive\ncapability and how powerful it is. Such an awesome and frightening being should\nbe considered dragon-like, no? Here are my arguments:\n\n 1. It looks…",
  "data/reddit-changemyview/r/changemyview/comments/mgtvf3/cmv_what_the_founders_intended_doesnt_matter.json": "If you are from the United States or if you follow American politics, you’re\nprobably familiar with “the Founding Fathers” and/or “The Framers of the\nConstitution” (I’m just going to call them “the Founders” from here on) and\ntheir God-like wisdom and foresight. If you are not from the United…",
  "data/reddit-changemyview/r/changemyview/comments/mh5ckj/cmv_smoking_anything_in_public_places_should_be.json": "That is not a war on drugs or something against weed. I think all smoking,\nincluding the things that are completely legal right now, should be banned in\npublic.\n\nIt doesn't matter if its cigarettes, vapes, weed, or your fancy cigar, if that\nis a shared environment that other people are present at…",
  "data/reddit-changemyview/r/changemyview/comments/mh5tkv/cmv_reducingrestricting_legal_access_to_firearms.json": "Yes, I’m aware that a significant portion of gun violence in the USA is\ncommitted by people who had illegally obtained firearms.\n\nThese firearms do not appear out of thin air. Many of them are stolen from homes\nor vehicles via home invasions, vehicle thefts, robberies, etc. Some of them are\nobtained…"
}