{
  "data/reddit-crypto/r/CryptoCurrency/comments/tti8zf/russia_just_linked_rubles_value_to_gold_yet_there.json": "Russia's government has attempted to peg Ruble's value to gold. It has not yet\nannounced that Ruble is backed by gold, but the Russian central bank has said it\nwill exchange ruble with gold and vice versa for a fixed rate. This has resulted\nin Ruble's value stabilising, and is now above the levels…",
  "data/reddit-crypto/r/CryptoCurrency/comments/ttmlcp/eu_ban_on_private_wallets_vote_shows_greens_and.json": "The often so-called progressive forces from left-wing and green parties were the\ndriving forces in sealing the fate of the DeFi sector and crypto in general in\nthe EU. Yes, for the individual holder there will be solutions, but an industry\nhas been massacred and the EU once more gave up the…",
  "data/reddit-crypto/r/CryptoCurrency/comments/ttud87/this_sub_lack_of_financial_education_is_extremely.json": "There are no words to express the financial ignorance of the average user here.\nLiterally, I want to rant but I can’t even find the words to express myself.\n\nThere’s no notion of intrinsic value, no concept of risk management, no\nfinancial planning, no DD.\n\nHell, most of you can’t even understand…",
  "data/reddit-crypto/r/Bitcoin/comments/ttrbbb/rplace_is_live_i_think_it_would_be_nice_if_there.json": "r/place [/r/place] is live. I think it would be nice if there was a big bitcoin\nlogo prominently displayed at 63.312 . Im sure im not the only one.\n\nhttps://preview.redd.it/ltvb1375dxq81.png?width=500&format=png&auto=webp&s=b59ac7dad865b6d40188780d16210a14bbcf88d0",
  "data/reddit-crypto/r/CryptoCurrency/comments/ttpm01/why_would_anyone_comply_with_the_new_crypto.json": "As an outsider to the EU, Canada, India or wherever else unfair Crypto\nregulations are trying or have passed already I really don't get why would\nanyone abide by these laws.\n\nCrypto provides many means to stay anonymous, and the whole point is\ndecentralization, why would you not just use this…",
  "data/reddit-crypto/r/CryptoCurrency/comments/ttty5q/this_is_how_much_the_creator_of_dogecoin_earned.json": "The creator of dogecoin, Billy Markus, is often called \"salty\" online. This is\nfor good reason, he admits. He sees scammers making millions while he himself\nearned only a fraction on dogecoin. Dogecoin is consistently in the top 20 of\nall crypto currencies. The meme-coin was founded as a joke, but…",
  "data/reddit-crypto/r/CryptoCurrency/comments/ttzm52/quantum_computer_solves_bitcoins_algorithm_for.json": "New research team has built a quantum machine with 13 million qubits that\ncracked Bitcoin encryption.\n\nScientists from the University of Sussex in the UK have built quantum systems\nwith 13 million qubits, which was sufficient enough to break the cryptographic\nalgorithm (SHA-256) that secures the…",
  "data/reddit-crypto/r/Bitcoin/comments/tu146n/im_homeless_if_bitcoin_hits_500k_i_am_retiring.json": "I am homeless and I live in my car. I have had a kind of rough life.\n\nWhen I was young my father left and my whole family became homeless. For the\npast 5 years I have lived in my car and worked at the lowest paying dead end\njobs.\n\nRight now I don't have a job. You may ask why and the reason is when…",
  "data/reddit-crypto/r/CryptoCurrency/comments/tuga30/eth_hit_3500_as_market_remains_bullish_despite_eu.json": "If this doesn't make you bullish nothing will! Market experienced a brief dive\nbefore recovering to an even higher cap amid EU aggressive new regulations on\nprivate wallets. This shows how bullish the market is as it grows more and more\neven tho so many bad news (federal interest rate hike and…",
  "data/reddit-crypto/r/CryptoCurrency/comments/tukx01/inflation_is_killing_my_budget_and_my_salary_i.json": "I am not sure about you guys, but this inflation is seriously damaging my\nbudget. I am not able to stash some money from my paychecks so I can invest\nwhile the market was in a bear market...to be fair, right now I am losing money\non a monthly basis.\n\nLuckily I had some emergency funds ready, but…",
  "data/reddit-crypto/r/CryptoCurrency/comments/tuo2yt/kava_network_kava_fake_announced_their.json": "Here's last night action of charts when they announced the partnership.\n\nhttps://coinmarketcap.com/currencies/kava/\n\nPeople who don't know what KAVA is:\n\nKava is a Layer-1 blockchain that combines the speed and interoperability of\nCosmos with the developer power of Ethereum.\n\nHere's screenshot of…",
  "data/reddit-crypto/r/Bitcoin/comments/tuoh5f/im_all_in_bitcoin_the_exponential_age.json": "Thesis: Bitcoin will forever be the currency of the internet.\n\nThis write up will contain information about where we are in the world, the role\nBitcoin will play in it, and most fun - Price Predictions! I've spent over 1000\nhours trying to wrap my head around this revolution. Let's begin.\n\nThe…",
  "data/reddit-crypto/r/Bitcoin/comments/tugh06/no_more_privacy_for_bitcoin_users_in_europe.json": "EU Parliament Passes Privacy-Busting Crypto Rules Despite Industry Criticism\n\nLawmakers are set to end even the smallest anonymous crypto transactions, and\nplan measures that could see unregulated exchanges cut off.\n\nEuropean Union lawmakers voted today in favor of controversial measures to\noutlaw…",
  "data/reddit-crypto/r/CryptoCurrency/comments/tuumsi/safemoons_v1_100_tax_results_in_the_theft_of.json": "THE DUMBEST MISTAKE SAFEMOON MADE WAS THINKING THEY COULD GET AWAY WITH THEFT ON\nA PUBLIC LEDGER.\n\n--------------------------------------------------------------------------------\n\n--------------------------------------------------------------------------------\n\n\nA CATCH UP IF…",
  "data/reddit-crypto/r/CryptoCurrency/comments/tv1jl7/i_love_brave_browser_holy_cow_dont_sleep_on_this.json": "Maybe am late to this party but have to say if you're not using Brave Browser\nalready, have made $9.18 for just late night browsing for the past three months\non this browser, and it looks just like Chrome!\n\nIt's actually on the Apple and Android store with several hundrend thousand\nreviews so it's…",
  "data/reddit-crypto/r/Bitcoin/comments/tv2bip/warning_trezor_users_the_email_from.json": "Trezor users have received a malicious email that appears legitimate but these\nemails were actually sent by an attacker. Here is what the emails look like\n[https://i.redd.it/2d1872nv68r81.jpg]. The emails also contain a link to click\nand download the latest version.\n\nDo not click the link and…",
  "data/reddit-crypto/r/CryptoCurrency/comments/tv6ato/not_taking_profits_can_be_a_big_mistake_and.json": "As far as I can see, there are two types of people here:\n\n1. People who say that HODLING is the key to success\n\n2. Others who say you are wrong if you do not take a profit from time to time,\nDCA in and DCA out\n\nThe thing is, both are relatively right.\n\n\n\nI was watching top 15 coins…",
  "data/reddit-crypto/r/CryptoCurrency/comments/tv1ejs/battle_between_decentralised_stablecoins_just_got.json": "Stablecoin wars are progressing to the next stage. Stablecoins are a huge part\nof the defi infrastructure, and whoever controls stablecoin market stands to\ngain the most adoption in the space. This is why commercial banks and even\ncentral banks are interested in the crypto space so much - there is…",
  "data/reddit-crypto/r/CryptoCurrency/comments/tvmtda/idgaf_im_leaving_my_coins_on_an_exchange_where_it.json": "Last night several threads warned about Trezor phishing scam and almost on\nqueue, today I read a post by 7 year crypto veteran that he fell for it and lost\neverything, about $72,000 in Bitcoin.\n\nIt can happen to anyone. You're tired, arguing with your gf, distracted, etc...\nnobody is perfect. He…",
  "data/reddit-crypto/r/CryptoCurrency/comments/tvepaa/the_btcdominance_rate_is_falling_this_is.json": "Bitcoin dominance rate describing, the BTC market cap in comparison to the other\ncrypto market caps and how much BTC accounts for it, has been falling since last\nyear and even during this dip it did not really recover but kept falling.\n\nEven if some Bitcoin-maxis may find this annoying, it is…",
  "data/reddit-crypto/r/Bitcoin/comments/tvhu4n/i_fell_victim_to_the_trezor_phishing_scam.json": "Lost £55,000.\n\nWas not paying attention and was on autopilot, just doing what it said. Was\narguing with my gf via Telegram at the time. Bloody hell.\n\nConvincing email, convincing site. Fake programme I downloaded was identical to\nthe real thing.\n\nHook line and fucking sinker.\n\nWhat a mug I am. Had…",
  "data/reddit-crypto/r/CryptoCurrency/comments/tvsbkq/goldman_sachs_in_2017_bitcoin_is_a_vehicle_for.json": "It only took em 5 years to completely flip their stance from this\n\nhttps://www.theguardian.com/business/2017/nov/30/bitcoin-is-a-vehicle-for-fraudsters-warns-goldman-sachs-boss\n\n> \"Something that moves 20% [overnight] does not feel like a currency. It is a\n> vehicle to perpetrate fraud\"\n\nTo…",
  "data/reddit-crypto/r/CryptoCurrency/comments/tw414x/the_uk_government_just_stated_it_aims_to_make_uk.json": "The UK Government just stated they aim to make UK a hub for crypto asset. While\nit does seem like its more oriented towards stablecoin regulation, there are\nsome interesting takeaways for defi too.\n\nFirst, they aim to bring stablecoins under regulation, so it can be used as a\nform of payment! This…",
  "data/reddit-crypto/r/CryptoCurrency/comments/tw72ye/will_the_eth_20_be_the_biggest_milestone_in.json": "Ether rose for a second day on Friday, extending its week-long outperformance\nagainst Bitcoin. Since March 11, Ether has climbed by roughly 24%, while Bitcoin\nhas increased by about 16%.\n\nThe enthusiasm around a planned software upgrade that promises to minimize the\nblockchain's carbon footprint…",
  "data/reddit-crypto/r/CryptoCurrency/comments/twboh9/staking_is_not_going_to_make_anyone_rich_unless.json": "Many applaud staking as the big passive income. The big source of money during a\nbear market. But in reality staking does not help much, it won't make you rich\nthrough passive income unless you already put in very high sums to stake, then\nyou may gain some reasonable amounts.\n\nMany have that…",
  "data/reddit-crypto/r/Bitcoin/comments/twfkec/in_just_over_18_months_from_now_it_will_be_2024.json": "Bitcoin is mainstream now, the average person either doesn't recognise that fact\nyet or they are in complete denial.\n\nOver the next 18 months we will see seismic shifts in adoption. Nation states\nwill be allocating to bitcoin en masse, every financial app and bank will be\nintegrating with the…",
  "data/reddit-crypto/r/CryptoCurrency/comments/twp9ed/if_burning_is_a_greatest_utility_with_cointoken.json": "And probably if you want to hold a long term you will get rekt. Probably. Your\ndecision.\n\n\"We are going to burn 5% of our supply every 2 weeks\"\n\nIf this is the only thing developers of the project are forcing, targeting, then\nchances are high that you invested in a shitcoin.\n\nNot only that, but…",
  "data/reddit-crypto/r/CryptoCurrency/comments/twtybt/ill_take_my_idiot_of_the_day_award_make_me_feel.json": "I sent $500 worth of USDT-BEP20 on my smartchain subnet of MetaMask to my\nEthereum ERC-20 custodial wallet with Kraken. According to kraken, when a\ndeposit is sent on the Binance Smart Chain to a standard Ethereum address, the\nprivate keys would need to be exported and then imported into a Binance…",
  "data/reddit-crypto/r/CryptoCurrency/comments/twruhj/decentralized_reddit_on_blockchain_is_one_step.json": "I've written about this a few months ago when I found out that a developer\nEsteban Abaora is working on a fully blown decentralized Reddit. To put it\nshort, it's a decentralized Reddit alternative that will use public key based\naddressing and p2p subnetwork to operate.\n\nIt's pretty crazy…",
  "data/reddit-crypto/r/CryptoCurrency/comments/tx6gwv/if_you_decide_you_would_steal_from_a_wallet_you.json": "Saw a post\nhttps://np.reddit.com/r/CryptoCurrency/comments/twxeol/what_would_you_do_if_you_imported_a_wallet_worth/)\n\nIn this post so many people said they'd steal all of the funds from a wallet\nthey accidentally got access to. I think this is monumentally fucked up and\nshows how desperate and…",
  "data/reddit-crypto/r/CryptoCurrency/comments/txjbsr/ticketmaster_is_scum_i_hope_they_get_destroyed_by.json": "After missing out on concerts for 2 years due to COVID-restrictions. I was\nrecently reminded again why Ticketmaster is one of the most hated company in the\nworld. I wish them a quick bankruptcy. I bought tickets for a concert and the\ntickets fees were more than 75% of the original ticket price.…",
  "data/reddit-crypto/r/CryptoCurrency/comments/txsyfo/janet_yellen_was_preaching_last_year_about_how.json": "Janet Yellen the US Treasury Secretary started bashing on crypto from all the\nway back in 2018\n[https://www.coindesk.com/markets/2018/10/30/former-fed-chair-janet-yellen-is-not-a-fan-of-bitcoin/]\nwhen she said\n\n> \"I will just say outright I am not a fan, and let me tell you why...very few\n>…",
  "data/reddit-crypto/r/CryptoCurrency/comments/txr9jf/crypto_wont_solve_any_of_these_problems_you_think.json": "Crypto is at the end of the day a shared record ledger. That’s it.\n\nRegarding that other popular post, this doesn’t mean Ticketmaster can’t charge\nus ridiculous extra fees for facilitating concert ticket sales because they work\nwith the people who own and operate the venue. Not the artists.\n\nThis…",
  "data/reddit-crypto/r/CryptoCurrency/comments/txuwws/i_used_to_get_depressed_when_my_crypto_drops_more.json": "I don't know if this is a good or a bad thing. I don't react to crypto market\nanymore.\n\nI open my computer/phone, check the price and see it, and then close the charts.\nLike, it doesn't matter if it's in green or in red. I doesn't mean aynthing to\nme unless the price is +50% down or +90% up. I just…",
  "data/reddit-crypto/r/Bitcoin/comments/ty0nn4/someone_on_the_panel_actually_suggested_lifting.json": "It's crazy how many of the \"industry leaders\" still lack understanding of the\nbasic value proposition of BTC...",
  "data/reddit-crypto/r/CryptoCurrency/comments/txmxei/the_feel_of_exiting_crypto.json": "After 3 years I sold everything. I don't know if it is the right move\nfinancially, I still believe in the message of decentralization and freedom that\ncrypto brings. The feeling after quitting is great - not checking charts and\nnews everyday, not stressing about price action (long term, I dont mean…",
  "data/reddit-crypto/r/CryptoCurrency/comments/ty2f1g/tennessee_titans_are_the_first_nfl_team_to_accept.json": "The Tennessee Titans have become the first NFL organization to use a third-party\nconversion provider to accept bitcoin for critical investments. \n\nWith the formation of this agreement, fans will be able to pay for season\ntickets, suites, PSLs, and sponsorship options with the Titans and…",
  "data/reddit-crypto/r/CryptoCurrency/comments/ty6bnk/people_who_made_enough_profit_for_their_entire.json": "Last year, I have made enough of profit from leveraging my exposure to ETH with\nDeFI, I made profit by over-leveraging and taking extreme risk, which I'd like\nto call it gamble instead of investing, just that I was lucky enough to made\nprofit from it.\n\n(Yes, before of that I did spend a lot of time…",
  "data/reddit-crypto/r/CryptoCurrency/comments/tyg33o/kraken_shut_down_their_global_headquarters_in_sf.json": "Kraken CEO today came out with an attack on San Francisco's administration after\ntheir employees were attacked and robbed, leading to the closure of Kraken's\nglobal headquarters in San Francisco.\n\nAccording to Kraken, business partners were also afraid to visit, and crime,\ndrug abuse etc are out of…",
  "data/reddit-crypto/r/Bitcoin/comments/tyity1/game_over.json": "I have a wealthy friend who has built an online tutorial empire. His sizable\nbusiness runs on global online payments via legacy rails. We lost regular\ncontact the past year or so but recently we started talking again and bonding\nover bitcoin. He got spooked by banking and by inflation and has…",
  "data/reddit-crypto/r/CryptoCurrency/comments/tyvjgb/the_ceo_of_binance_responded_to_my_meme_and.json": "So I was half asleep drinking my coffee when I responded to cz_binance on\nTwitter this morning with a meme I made and he immediately responded and\nfollowed me back… I said “wtf” out loud and spooked my dog… what does this mean?\nBanance coming soon? Does he usually respond to people like this?…",
  "data/reddit-crypto/r/CryptoCurrency/comments/tywi29/coinbase_one_user_agreement_deep_dive_its_really.json": "So, I received an invite to trial Coinbase One for one month recently.\n\nI did a search on the sub, and apparently literally nobody actually read the\nUser Agreement. Posts of people liking the false sense of security of a\nnon-existant \"account protection\" policy up to 1 million dollars, no…",
  "data/reddit-crypto/r/CryptoCurrency/comments/tyo12p/jack_mallers_just_obliterated_altcoins_medium_of.json": "Since I assume most people here don't watch Bitcoin Conference live streams,\nI'll cut to the chase: Jack Mallers just announced that a shit ton of retailers\n(including McDonals, Walmart, Whole Foods, Starbucks, etc) will now be able to\naccept Bitcoin, dollars, yen, or any other dirty fiats,…",
  "data/reddit-crypto/r/Bitcoin/comments/tz2qin/once_again_the_market_severely_undervalues_the.json": "Bitcoin + Lightning being used as payment rails at major US retailers and\nshopify integration.\n\nFollow the signal and ignore the noise. Mallers just gave us the brightest\nsignal we have seen since El Salvador.\n\nBuckle the fuck up, the next few years are going to be very very interesting and\nif…",
  "data/reddit-crypto/r/CryptoCurrency/comments/tz6wgi/something_to_watch_is_growth_rate_of_people.json": "So over the past few months I've been studying demographics and economics.\nBasically\n\n * if someone is born today, we know they are most likely going to live until\n   80-90 years old.\n * We know people are going to want to retire somewhere around 70 because that\n   is the lie that was sold.\n * We…",
  "data/reddit-crypto/r/CryptoCurrency/comments/tzryxv/everybody_hates_ticketmaster_but_are_there_nft.json": "Everybody hates Ticketmaster and their absurd fees. This week one of the top\npost of r/cc [/r/cc] was hopeful that NFT/blockchain ticketing could disrupt the\nticketing industry. Are there any good alternatives for artists to use a\ndifferent ticketing company than Ticketmaster?\n\nKey to the success…",
  "data/reddit-crypto/r/CryptoCurrency/comments/tzmsf2/remember_to_log_into_your_exchange_accounts_once.json": "So I asked Kraken about escheatment, and they finally got back to me. They have\nmore than less the same thing as the rest of the exchanges.\n\n> Thanks for your inquiry. \n> \n> As stated in Section 12 of our Terms of Service\n> [https://www.kraken.com/legal], if a Kraken account is inactive for an\n>…",
  "data/reddit-crypto/r/CryptoCurrency/comments/tzecuf/snoop_dog_on_record_labels_you_got_to_get_fucking.json": "Music and crypto is definitely a new use case. Let's take a look at it:\n\nSnoop talks about how all music is influenced by labels and all sound the same.\nThe music industry, as you can imagine, is extremely predatory for young artists\nand even stars. Apparently even Taylor Swift is having problems…",
  "data/reddit-crypto/r/CryptoCurrency/comments/tzpg2e/were_about_a_month_away_from_releasing_our_own.json": "Myself and 6 other redditors who met on this sub have been working on an\nalgorithmic crypto trading platform for about 8 months now and we're finally\ngetting close to releasing this application in closed beta.\n\nSo we started building an algorithmic crypto trading platform that allows you…",
  "data/reddit-crypto/r/CryptoCurrency/comments/tzzc1t/the_true_dyor_is_when_you_realize_no_blockchain.json": "ETH - high cost\n\nSOL + LUNA - datacenter nodes\n\nADA - slow as fuck\n\nAVAX - using sidechains -> giving up security\n\nEDIT: ALGO - Centralized relay nodes\n\nAnd the list goes on.\n\nI'm not a religious guy but people should follow more the \"He that is without\nsin among you, let him cast the first stone…",
  "data/reddit-crypto/r/CryptoCurrency/comments/tztjla/this_is_becoming_ridiculous_now_elon_musk_replies.json": "Elon Musk responded to a tweet about Tesla's new Giga Factory in Texas:\n\nElon's Response About Hamsters\n[https://preview.redd.it/eroh6vg2ags81.png?width=902&format=png&auto=webp&s=f03d4dfd3f4c0a01902701c0ab19d734757abcc8]\n\nWhat is obviously a joke about random metrics, was used by investors to…",
  "data/reddit-crypto/r/Bitcoin/comments/tznzds/reaktions_to_jack_mallers_announcement_why_are_we.json": "I was very surprised but also disappointed to see the very mixed to even\nnegative reactions to the announcement of strike / Jack Mallers at Bitcoin 2022.\n\nStrike partnered with NCR (NCR), the world’s largest point-of-sale (POS)\nsupplier, and with Shopify to allow payments through lightning. Since…",
  "data/reddit-crypto/r/CryptoCurrency/comments/tzxje5/sec_just_had_to_release_their_emails_about_the.json": "Back in August 2021 the SEC was requested by a non-profit organization (Empower\nOversight) to release their emails about the XRP lawsuit and inner conversations\nabout it. Back then they declined, Empower Oversight filed a lawsuit and now\nthey finally released those.\n\nThat does not make the SEC look…",
  "data/reddit-crypto/r/CryptoCurrency/comments/u00e5u/most_people_treat_bitcoin_as_an_investment_and.json": "When ever there is a talk or rumors about adoption of Bitcoin by a company , I\nsee it everywhere and might even agree with it sometimes. \"Why would I spend my\nBitcoin to buy stuff , when it can go much higher in value?\" \"Why would I spend\nmy investment?\"\n\nMost people might have come to this…",
  "data/reddit-crypto/r/Bitcoin/comments/tzzcju/strike_announces_shopify_integration_partnerships.json": "Strike, a digital payments platform based on Bitcoin's Lightning Network, has\nannounced a partnership with Shopify, an e-commerce platform.\n\nStrike CEO Jack Mallers announced at the Bitcoin 2022 conference in Miami that\neligible U.S. Shopify merchants will now be able to accept bitcoin payments…",
  "data/reddit-crypto/r/Bitcoin/comments/u04zex/changelly_kyc_scam_they_are_holding_my_19800_btc.json": "Changelly is a “non-custodial” instant cryptocurrency exchange according to\ntheir twitter profile. https://mobile.twitter.com/changelly_team\n\nThe only reason i trusted them is because they are listed as a trusted partner\nof Ledger and Exodus\n\n * Summary about what happened -\n\nI tried to exchange…",
  "data/reddit-crypto/r/Bitcoin/comments/u07w9a/if_i_had_to_do_it_all_over_again_i_would_not_have.json": "Although every year I hire accountants and pay through the ass for paper gains,\nscams etc I wish I never paid taxes to begin with since I never really cashed\nout and now have to continually update any transactions in my tax year. I hate\nhow the government takes and takes while it almost impossible…",
  "data/reddit-crypto/r/CryptoCurrency/comments/u0dhtr/many_ada_holders_are_deranged_cultists_this_is.json": "ADA holders can be really weird. I want to reiterate that not all of them are\nlike this, but the Venn diagram of ADA fans and neck beards, who start\ndiscussions about the age of consent in japan, looks like the Mastercard logo.\nThose guys are also extremely idealistic and are often more interested…",
  "data/reddit-crypto/r/CryptoCurrency/comments/u06947/heads_up_for_those_that_use_metamask.json": "So, I just received an email claiming to be from Metamask saying because of new\nregulations, all users have to comply by...whatever date. It looks legit, even\nthe email address sounds right...however, a quick search shows that it is a\ncommon phishing scam.\n\nI messaged Metamask Support and they…",
  "data/reddit-crypto/r/CryptoCurrency/comments/u0g72r/investing_in_crypto_is_easy_until_it_isnt.json": "Investing in crypto is easy. Select an exchange. Put some money in, wait for a\nsubstantial amount of time, such as 5 years, and you should have a nice ROI.\nPick some good altcoins, get some ETH and BTC and the gains should be good. This\neasy, everyone can do it. But then it starts.\n\nYou notice…",
  "data/reddit-crypto/r/Bitcoin/comments/u0i0b2/been_buying_bitcoin_every_month_since_oct_2017_55.json": "The strategy is to buy every month until I can retire. It's been 4.5 years now.\nGood progress, but no idea how long its gonna last until I'm 'done'. I document\nmy journey in this blog and I think of it as some kinda blueprint for how you\ncan stack yourself into retirement with Bitcoin and how the…",
  "data/reddit-crypto/r/CryptoCurrency/comments/u0j2ac/i_cannot_stress_this_enough_hammer_your_seed.json": "https://imgur.com/a/SaRtANd\n\nthey say words are powerful. the 10 commandments were the law of the land, and\nwere so significant that God himself put them on a solid piece of medium. so why\nnot your seed phrases? you worked your ass off and put up with alot of shit to\nearn that money. and remember,…",
  "data/reddit-crypto/r/CryptoCurrency/comments/u0mfkb/the_silkroad_led_to_safer_drug_use_partially.json": "In contrast to the government’s portrayal of the Silk Road website as a more\ndangerous version of a traditional drug marketplace, it was in many respects the\nmost responsible drug marketplace in history.\n\nBy giving users cleaner drugs, off the dangerous streets, and by using\nanonymized money, it…",
  "data/reddit-crypto/r/CryptoCurrency/comments/u0szmb/the_antielizabeth_warren_super_pac_a_new_super.json": "A new Super PAC (Political Action Committee) called the Financial Freedom PAC\nhas been formed with 2 goals in mind:\n\n * Elect Bitcoin Champions\n * Kick out anti-Bitcoin politicians like Elizabeth Warren\n\n> The Financial Freedom PAC explains that it supports four political candidates\n> including the…",
  "data/reddit-crypto/r/CryptoCurrency/comments/u0nq21/and_now_the_republican_party_is_being_ridiculous.json": "The Senate Republican Policy Committee (RPC) released a paper called\nCryptocurrency Goes Mainstream\n[https://www.rpc.senate.gov/policy-papers/cryptocurrency-goes-mainstream]. The\nRPC provides analysis and research to inform the members of the party about\nvarious topics.\n\nThis specific paper is…",
  "data/reddit-crypto/r/CryptoCurrency/comments/u0qz6u/how_long_do_you_think_it_will_take_before_we.json": "Everybody says we’re early in crypto, but honestly I think we’re getting semi\nclose to not being early anymore. With Crypto.com sponsoring UFC, having the\nname rights to the Laker’s stadium, and coinbase advertising on the Super Bowl\nhalf time show, I think it’s debatable to how early we really…",
  "data/reddit-crypto/r/CryptoCurrency/comments/u0se5l/india_has_blocked_coinbase_in_just_3_days_central.json": "Last week, Coinbase held an event where their CEO announced launch of fiat\ntrading services in India using the UPI payment rails, along with other\nannouncements of hiring 1000 employees, funding other startups etc.\n\nImmediately after the event, a branch of the central bank RBI issued a…",
  "data/reddit-crypto/r/CryptoCurrency/comments/u0u81h/of_course_you_are_not_late_if_you_start_investing.json": "Some people believe that we are late. Others believe that we are early. I\nbelieve that both of those answers are wrong.\n\nTLDR: No we are not early so much that $1000 in BTC will make you rich. But also\nyou are not late to the party.\n\nBitcoin exist since 2009.\n\nBitcoin first transaction happened in…",
  "data/reddit-crypto/r/CryptoCurrency/comments/u14qd0/btc_maxi_clown_max_keiser_yet_again_shredding_usd.json": "Max Keiser has repeated his cringe fest from 2021 where he shreds USD notes for\nhis audience to make his point that fiat is worthless. Imo if you have to come\nto this level to make your point, you have already lost. This does nothing but\nfuel more hate, anger, resentment towards crypto bros,…",
  "data/reddit-crypto/r/Bitcoin/comments/u0ykod/21_million_minus_one.json": "Today I became a whole coiner. I believe in the future.",
  "data/reddit-crypto/r/CryptoCurrency/comments/u17208/btc_supporters_please_explain.json": "No hate here please, all love. This is a copy/paste I found interesting and\nwanted to see how a maxi would form a rebuttal.\n\n————————————————————\n\n> The most critical flaw in Bitcoin is its lack of privacy. If you give me your\n> Bitcoin wallet address so that I can send you a payment, you…",
  "data/reddit-crypto/r/CryptoCurrency/comments/u13kty/been_buying_bitcoin_every_month_for_the_past_45.json": "Started in October 2017. Thought I was late, everybody does. Decided to buy as\nmuch bitcoin as possible. Basically this means buying from every paycheck as\nmuch as possible. It's the FIRE type of investing but replace S&P500 with\nbitcoin. It's been going pretty well, a couple of crashes here and…",
  "data/reddit-crypto/r/CryptoCurrency/comments/u1gmw0/in_the_past_24_hours_42069_million_longs_were.json": "In the past 24 hours, 141,325 traders were liquidated, the total liquidations\ncome in at $420.69 million. The largest single liquidation order happened on\nBitmex - XBTUSD value of $10.00M.\n\n\n\nThere have been a lot of posts like this one about shorts being liquidated and\npeople in the comments…",
  "data/reddit-crypto/r/CryptoCurrency/comments/u1i9ej/those_of_us_who_started_investing_and_hodling.json": "Is there anyone in this sub that has actually made a ‘profit’?\n\nWhat an utter fucking disappointment. The more I spend time in this space, the\nmore stupid I fucking feel. I am going to wait a full year before most probably\nliquidating everything and just get pleasure from being able to call the…",
  "data/reddit-crypto/r/CryptoCurrency/comments/u12obw/average_man_in_crypto_lessons_ive_learned.json": "3 years in crypto, i would like to share my experience as a curious user of\ncrypto.\n\nMy first experience with Crypto was when someone from a different country sent\nme $100 fund to support for a business i proposed.\n\nLESN 1. Crypto closes the location gap for funding useful projects.\n\n\nFew months…",
  "data/reddit-crypto/r/CryptoCurrency/comments/u1k7uk/bitcoin_is_officially_dead_please_sell.json": "I have some very unfortunate news for all of you\n\n7D\n[https://preview.redd.it/dw1lignbazs81.png?width=865&format=png&auto=webp&s=f00f2798ab63bc107565ca531d9073a8cdc6833d]\n\nAs you can see by the technical analysis and illustration above of Bitcoin's\nhistory, it is going down to 0. Considering the…",
  "data/reddit-crypto/r/CryptoCurrency/comments/u1aen0/were_the_hedera_hbar_project_an_open_source.json": "HELLO, R/CRYPTOCURRENCY [/r/cryptocurrency]!\n\nWe’re a group of contributors to the Hedera [https://www.hedera.com/] project\n($HBAR [https://hedera.com/hbar] | #33 on CMC): A fast, carbon-negative\n[https://hedera.com/blog/going-carbon-negative-at-hedera-hashgraph], open\nsource, public network built…",
  "data/reddit-crypto/r/CryptoCurrency/comments/u1hoqe/experts_say_bitcoin_will_hit_100k_by_2021.json": "By experts, of course I mean the members of this subreddit.\n\nNow that we know for sure when it will hit $100k, it's time to take out a loan\nwhilst being unemployed and FOMO it all into Bitcoin. Not only that, but let's\ntalk to everyone we know and convince them to FOMO all their money in…",
  "data/reddit-crypto/r/Bitcoin/comments/u1ipux/finally_hit_01_bitcoin.json": "Bought todays dip and finally reached my first milestone of 0.1 Bitcoin. Might\nnot seem a lot to some people but I'm happy to get there. Now for 0.2 😊",
  "data/reddit-crypto/r/CryptoCurrency/comments/u1h1ms/white_house_bracing_for_extraordinarily_elevated.json": "https://www.washingtonexaminer.com/white-house-bracing-for-extraordinarily-elevated-inflation-ahead-of-next-report\n\nSounds like tomorrow's CPI reading is going to be painful. I'm having a hard\ntime understanding how \"we are in a better place than we were last month\" and\nyet headline inflation is…",
  "data/reddit-crypto/r/CryptoCurrency/comments/u1wdzr/60_minutes_is_pathetic_just_to_show_crypto_in_a.json": "This chart was meant to show the Bitcoin price...\n[https://preview.redd.it/zwbizaplv2t81.png?width=1070&format=png&auto=webp&s=697ca25312b10fd082ecf33146bbc4809b4f6f3c]\n\nThis is the chart that should show the Bitcoin price. But if you look there on\nthe X-axis you see how they suddenly switched from…",
  "data/reddit-crypto/r/CryptoCurrency/comments/u207fe/nancy_pelosi_works_at_coinbase.json": "16 hours ago Coinbase asset shared this medium link to their twitter.\nhttps://blog.coinbase.com/increasing-transparency-for-new-asset-listings-on-coinbase-e06f2edb095e\n\nTransparency for potential new asset listings on coinbase. There is an address\nthat bought a few of the shitcoins listed on there…",
  "data/reddit-crypto/r/CryptoCurrency/comments/u20kuz/celsius_will_no_longer_pay_interest_to_united.json": "The official Celsius twitter account just posted this news.\n\n\nNEW TRANSFERS (AFTER APRIL 15) BY UNITED STATES USERS WILL NOT EARN REWARDS.\n\nAnything you’ve deposited to Celsius before April 15th will continue to earn\nrewards but that does it for US users for any yield on future…",
  "data/reddit-crypto/r/Bitcoin/comments/u1xzic/usd_inflation_surges_to_85_on_an_annual_basis.json": "> The Consumer Price Index for All Urban Consumers (CPI-U) increased 1.2 percent\n> in March on a seasonally adjusted basis after rising 0.8 percent in February,\n> the U.S. Bureau of Labor Statistics reported today. Over the last 12 months,\n> the all items index increased 8.5 percent before seasonal…",
  "data/reddit-crypto/r/CryptoCurrency/comments/u24pdb/us_inflation.json": "Can we stop pretending that the average inflation in the US is sub 10%. We have\nall seen with our own eyes that everything has gone up 15% or more in the past\nyear. Canada is just as bad too with crazy price increases in every industry. In\nCanada, you can sell a 5 year old truck for the same price…",
  "data/reddit-crypto/r/CryptoCurrency/comments/u2f90u/there_is_serious_insider_trading_going_on_at.json": "Earlier today Coinbase made a “transparency post” naming about 50 assets that\nthey are planning to list on their exchange. Most of them are illiquid shitcoins\nthat no one can figure out why they are even listing in the first…",
  "data/reddit-crypto/r/CryptoCurrency/comments/u2e53n/looks_like_the_eth_merge_is_delayed_to_latter.json": "Tim Beiko posted this Twitter response to a query about progress of the ETH\nMerge:\n\nhttps://imgur.com/a/d9r4uK4\n\nAdditionally a pool operator has been reviewing code and running nodes on\ntestnet and in their opinion The Merge probably won't be ready until…",
  "data/reddit-crypto/r/Bitcoin/comments/u2aple/the_crypto_transaction_bill_being_pushed_through.json": "If this bill passes think about how that will change behaviour. You can sell\nyour btc in bulk through exchanges and pay CGT, or you can spend your bitcoin at\nmcdonalds and walmart when you go shopping and pay zero tax.\n\nThis is a pretty big deal. It will lead to a huge chunk of bitcoiners…",
  "data/reddit-crypto/r/CryptoCurrency/comments/u2licx/crypto_lending_these_days_one_of_the_most.json": "DeFi is one of the fastest-growing sectors within the cryptocurrency space. It\noffers numerous services to cryptocurrency investors and other market players.\nAccording to DeFi LIama, the total locked-in value (TVL) in DeFi protocols today\nis $209.2 billion.\n\nFrom lending and borrowing to yield…",
  "data/reddit-crypto/r/CryptoCurrency/comments/u2uhhd/an_overwhelming_amount_of_headlines_that_get.json": "All I see on this subreddit are misleading titles being upvoted by what seems\nlike people who have no idea what is actually going on past just reading\nmisleading headlines. Learn to think critically and for once, to actually be\nimpartial to whatever bags you may or may not have.\n\nA recent example…",
  "data/reddit-crypto/r/CryptoCurrency/comments/u2pg2i/how_many_of_you_actually_invested_only_what_you.json": "First of all; wether or not you can afford to lose money, losing money still\nsucks. Let me get that straight.\n\nI always thought I invested only what I can 'afford' to lose. I did not need the\nmoney at that time and I was working so I had a steady income as well.\n\nWhen prices started dropping I…",
  "data/reddit-crypto/r/CryptoCurrency/comments/u2xgmm/with_the_recent_news_on_conbase_are_you_switching.json": "https://preview.redd.it/cpf9x25bdct81.jpg?width=1125&format=pjpg&auto=webp&s=051094ce2a8332b972c1d0d0f4dd785ea99d1baa\n\nSo most if not all have seen the post on the front page about insider trading\ngoing on with Conbase, now to some this isn't news but to others it's been eye\nopening. So now that…",
  "data/reddit-crypto/r/CryptoCurrency/comments/u2qdpn/regarding_insider_trading_at_coinbase_the_sec.json": "For those that have investigated the Coinbase insider trading\n[https://www.reddit.com/r/CryptoCurrency/comments/u2f90u/there_is_serious_insider_trading_going_on_at/]\nincident, use this link to submit a tip to the SEC: https://www.sec.gov/tcr\n\nThe only way to change this behavior is to submit a tip.…",
  "data/reddit-crypto/r/CryptoCurrency/comments/u308hu/the_bull_run_will_come_when_we_all_expect_it_the.json": "With now months in this a lot of nothing happening many, even the best, are\nbecoming very unhopeful about a possible upturn. And that very understandable no\nhuman would like to see weeks of very red bleeding and every attempt of relief\ncompletly fail.\n\nAt such situations where everyone is just so…",
  "data/reddit-crypto/r/CryptoCurrency/comments/u2l2uw/warning_for_indian_users_if_you_have_used_a.json": "If you have used CEX in the past, they have already turned over the data of all\ntheir users to the government. So far, WazirX, Coin DCX, BitBNS, Zebpay etc have\ndone so, and the government is in possession of all your details from ID\ncards/names/PAN/Adhaar associated with the accounts, to all your…",
  "data/reddit-crypto/r/CryptoCurrency/comments/u3b7n7/fuck_robinhood_should_have_never_used_them.json": "I'm a pretty safe internet user(on my laptop), no porn on my laptop just my\nphone, no risky sites or apps etc. Never save passwords to any site...\n\nEven as careful as I am it seems that my email I have been using for the last 15\nyears has been found on an auction block on the dark web.\n\nLow and…",
  "data/reddit-crypto/r/CryptoCurrency/comments/u3ckwd/crypto_adoption_among_the_younger_generation.json": "I work as an English teacher at a school and today was test day. One of the\nquestions on the test was\n\n\"What would you do with €10,000 euros?\"\n\nOf course there were the standard answers like buy a car, go on holiday etc. but\nin a class of 20 students aged 13-17 there were 3 who said they would…",
  "data/reddit-crypto/r/CryptoCurrency/comments/u3fxl4/davinci_jeremie_a_youtuber_who_shilled_bitcoin.json": "If you don't know who he is, you probably know him by this screenshot||\n\nBTC was at $11 in 2013.\n[https://preview.redd.it/20aszvtjhht81.jpg?width=648&format=pjpg&auto=webp&s=1f3a5deefe216ff78d994656ae85fc875a743e84]\n\nHe has been involved in different pump and dump coins but the recent coin…",
  "data/reddit-crypto/r/CryptoCurrency/comments/u3jozd/the_monerun.json": "April 18th. We're withdrawing XMR from exchanges. Any exchange that hasn't\ndisabled withdraws (which many of them have already), we're pulling our funds.\n\n\"What is, this WSB meets Monero?\" you might ask. Yes indeed, and here's why:\n\nMonero's obfuscated ledger has enabled a number of exchanges to…",
  "data/reddit-crypto/r/Bitcoin/comments/u3j3xo/americans_are_getting_stronger_twenty_years_ago.json": "Henny Youngman died in 1998.",
  "data/reddit-crypto/r/CryptoCurrency/comments/u3w8vy/you_need_to_qualify_as_an_accredited_investor_to.json": "The Celsius news blocking regular Americans investors is terrible, but not\nsurprising you could sense they were tightening the screws because allowing\ncommon folk to earn 7% on stables vs the 0.3% they get in banks is soooo risky.\n\nCommon folk can however invest happily, all their savings into IPOs…",
  "data/reddit-crypto/r/CryptoCurrency/comments/u3pi0h/cardanos_vasil_hard_fork_will_arrive_on_june_29th.json": "As many of, you know, a major major major hard fork combinator event is\nhappening in June, which is the Vasil hard fork, and that is going to contain\npipelining, which will be a massive performance improvement to Cardano,\nalongside the first wave of significant Plutus enhancements since Plutus…",
  "data/reddit-crypto/r/CryptoCurrency/comments/u42oqk/dont_be_that_person_that_keep_bringing_up_crypto.json": "Reminder to not be that kind of guy who has his whole personality built around\ncrypto and talk about it everyday with people who don't care about it. If they\ncared about it, they would be learning it themselves and than reach out to you\nabout the subject.\n\nIt's never a good idea to talk anything…",
  "data/reddit-crypto/r/CryptoCurrency/comments/u42z6w/people_who_survived_multiple_bear_markets_how_did.json": "So this is my first bear market, I got into crypto at the beginning of 2020,\nwhen the bull market begin and it has been a rollercoaster of emotions and it's\nlife-changing for me. But as much as I hate to admit it, I'm bored.\n\nEverything is predictable, I know Bitcoins gonna be crabbing till it…",
  "data/reddit-crypto/r/CryptoCurrency/comments/u48ql4/stop_using_bullsht_arguments_for_the_price_of_a.json": "Honestly, like why do people do this? Since the prices are spiraling down for\nthe last couple of months, I am seeing so many clickbait articles saying 'Crypto\nX down 40%!, is this the end?'. When you look into the comments or arguments\nthey are 9/10 times absolut bullsh*t.\n\nNo it is not because a…",
  "data/reddit-crypto/r/CryptoCurrency/comments/u462pb/april_18_2022_withdraw_all_your_crypto_from_all.json": "This movement first originated in Monero community. The reason is most\ncentralised exchanges don’t allow you to withdraw XMR under fake technical\nreasons. Meanwhile, XMR deposits are always welcome and available.\n\nLater, users of other cryptos recognised they can’t withdraw their funds due to\nfake…",
  "data/reddit-crypto/r/CryptoCurrency/comments/u4hp2i/what_will_it_take_to_ignite_the_next_bull_run.json": "Just wondering peoples thoughts on what could ignite the next bull run? We have\nclearly been on a continuous downtrend for the past 6 months which has been a\nlittle depressing and bitcoin is over 30% down from this point 1 year ago. What\ncan get us out of this?\n\nCould it be the Russia invasion of…",
  "data/reddit-crypto/r/CryptoCurrency/comments/u4q05u/if_youre_trying_to_minimize_fees_when_moving.json": "You all know these gas fees are too damn high! It's pretty annoying when you're\ntrying to move a small amount of crypto and/or anything Ethereum-based from one\nexchange to another (CEX or DEX) and you're prompted to pay a fee that feels\njust ridiculous. My first suggestion to anyone trying to…",
  "data/reddit-crypto/r/CryptoCurrency/comments/u4kbyy/bitfinex_whale_has_now_filled_1600_coin_bids.json": "Link to previous posts will be in the comments.\n\nThis is a visual orderbook and shows where resting (limit) orders are, the\nbrighter the white the higher value the order is, the more blue to colour the\nlower the blue.\nAs most of you will know most of the 'whales' trade on bitfinex, and…",
  "data/reddit-crypto/r/CryptoCurrency/comments/u53kci/i_joined_crypto_last_year_and_made_a_ton_of.json": "Day traded with $100, made 5% profit in the first day: \"Holy shit if I day trade\nwith $10000 I can live without having to work ever again\"\n\nStarted by investing in Cardano and was listening to every one of Charles\nHoskinson's livestreams: \"If this goes to $100 I'll become a millionaire\"\n\nDidn't…",
  "data/reddit-crypto/r/Bitcoin/comments/u54v8y/anyone_using_bisq.json": "Do you recommend it?",
  "data/reddit-crypto/r/Bitcoin/comments/u51qqb/is_it_just_me_or_did_the_bitcoin_2022_conference.json": "Not trying to be a Negative Nancy here guys, I swear. But this past conference,\nit just really felt weak and ineffective. Many of the guests really just wanted\nto talk about their company, or their book, or whatever project they were\nworking on, and just kind of rambled on it. Far too much talk…",
  "data/reddit-crypto/r/CryptoCurrency/comments/u5je3f/how_i_accumulated_my_wealth_by_looking_at_pages.json": "Being early is everything in crypto, so it baffles me that people buy top 50\ncoins and expect to get rich. These generally have 2-3x potential at best in any\nreasonable investor timeframe, while lowcaps have 100-500x potential. Of course\nyou buy lowcaps.\n\n\"But it's so risky!\" you may object. Well,…",
  "data/reddit-crypto/r/CryptoCurrency/comments/u5kfyz/after_making_millions_on_his_last_nfts_projects.json": "Here's the screenshot of his latest NFT project which only got minted by 118\npeople out of 5000 looks like finally his fanbase has realized he is only here\nto make a bag then abandon the project.\n\n\n\nHis latest NFT…",
  "data/reddit-crypto/r/CryptoCurrency/comments/u5iue2/the_fact_that_people_are_calling_40k_btc_a_bear.json": "2 years ago in April 2020, BTC was trading at 8770$ Ethereum was 215$.\n\nMajority of you came into the scene probably around the start of 2021. You guys\nwere the exit liquidity of many old investors. But even then we're still holding\nstrong at a solid 38-40k range.\n\nAnd people calling this price…",
  "data/reddit-crypto/r/CryptoCurrency/comments/u5to4g/security_warning_if_you_use_metamask_on_an_ios.json": "TL:DR\n\nIf you have MetaMask on an iPhone or Mac, then you're likely also using iCloud\nbackup. MetaMask backup your Valut containing your seed by default, so turn that\noff from Settings\\Profile\\iCloud\\Manage Storage!\n\n\n\nSummary\n\nI have been following this developing story on Twitter about a user…",
  "data/reddit-crypto/r/CryptoCurrency/comments/u5s0fs/no_looking_at_pages_10_and_beyond_on_coingecko.json": "This is a response to the post\n[https://np.reddit.com/r/CryptoCurrency/comments/u5je3f/how_i_accumulated_my_wealth_by_looking_at_pages/]\non the front page titled ‘How I accumulated my wealth by looking at pages 10 and\nbeyond on Coingecko’.\n\nLet me just start of that his story is anecdotal and not…",
  "data/reddit-crypto/r/CryptoCurrency/comments/u5xp4o/how_i_preserved_my_wealth_by_not_listening_to.json": "This post\n[https://np.reddit.com/r/CryptoCurrency/comments/u5je3f/how_i_accumulated_my_wealth_by_looking_at_pages/]\nis at the top of the sub right now. In it, OP claims that he \"accumulated his\nwealth\" by combing through the vast sea of microcap shitcoins on CoinGecko and\npicking winners.\n\nDon't…",
  "data/reddit-crypto/r/Bitcoin/comments/u5ae4e/rich_dad_poor_dad_author_robert_kiyosaki_says.json": "https://preview.redd.it/jxm3z69y9zt81.png?width=680&format=png&auto=webp&s=2e0bc2c79f46ea648b2ef41f67ab2400ee365e44",
  "data/reddit-crypto/r/CryptoCurrency/comments/u5ygms/i_fucked_up_an_idiot_with_100k_transactions_for_a.json": "My friend made a swing trading crypto bot and I threw 10k at it and let it rip\nwith him in Beta. Cut it off after about 2 months and 4k in losses. 123k\ntransactions happened in that period on Binance.\n\nI'm also an idiot who didn't know I had to report every transaction. Everything\nI try to use is…",
  "data/reddit-crypto/r/CryptoCurrency/comments/u5mlgi/bean_a_algo_stablecoin_just_got_flash_load.json": "BEAN a algorithmic-stable coin just got drained 24,830($74,490,000 MILLION)\nEthereum by flash loan hacking\n\nhttps://etherscan.io/tx/0xcd314668aaa9bbfebaf1a0bd2b6553d01dd58899c508d4729fa7311dc5d33ad7\n\nthe transaction above ^\n\nThe Hacker took multiple flash loans upwards of 1 billion dollars, then…",
  "data/reddit-crypto/r/CryptoCurrency/comments/u5tv72/so_ive_finally_taken_the_step_to_accept_btc_at_my.json": "And no one really cares.\n\nI run a motorcycle workshop dealing with usually fairly large job such as race\nbike conversions, crash damage etc and I recently took the jump to accepting BTC\npayments.\n\nI launched this on my website along with the Facebook and Twitter pages. I also\nhave added it to my…",
  "data/reddit-crypto/r/CryptoCurrency/comments/u5gf12/after_months_of_research_im_beginning_to_think.json": "So I've been researching this for months, reading post on r/cryptocurrency\n[/r/cryptocurrency] and other similar subs. After all this research I've come to\nthe conclusion that crypto currencies are the future and possibly or only Chance\nat surviving the upcoming economic collapse.\n\nYes I said…",
  "data/reddit-crypto/r/CryptoCurrency/comments/u62h91/im_doing_my_taxes_last_minute_and_am_about_to.json": "I don't even fucking know where to begin, I am so god damned pissed off. I got\nlucky trading crypto last year and made a bit of money. I'm a full-time student\nand volunteer, so this was my only income - I made about as much as you would\nworking a minimum wage job for a year.\n\nSo I am poor as fuck,…",
  "data/reddit-crypto/r/CryptoCurrency/comments/u63dsv/senator_ted_cruz_blasts_elizabeth_warren_and.json": "Ted Cruz dragged Bitcoin into the highly publicized CPAC political rally by\nmentioning how censorship proof it was during the Canadian \"Freedom Convoy\"\nincident\n\nCruz had words for everyone from Justin Trudeau and Elizabeth Warren to even the\nChinese Communist Party for opposing Bitcoin because of…",
  "data/reddit-crypto/r/CryptoCurrency/comments/u679wt/starting_to_hate_crypto_and_cant_wait_to_leave.json": "So many scams.\n\nHard to covert money back to fiat.\n\nRelentless junk and fake emails.\n\nNFT hype, stupid .jpgs and celebrities exploiting the space.\n\nSo many shit coins.\n\nSo many pump and dumps.\n\n“Use cases” mostly bullshit.\n\n“Great community” mostly bullshit and in my opinion preys on those who seek…",
  "data/reddit-crypto/r/CryptoCurrency/comments/u68m55/if_someone_found_a_way_to_get_rich_hed_never.json": "I'm talking about crypto YouTubers promising to teach you the techniques to\nbecome a crypto millionaire or about people selling entire courses teaching you\nall the ways to find the best Shitcoins.\n\nTo me it sounds like a paradox.\n\nIf I'd found a way to make easy money I'd never share it, and I'd…",
  "data/reddit-crypto/r/CryptoCurrency/comments/u6dzd2/why_when_ted_cruz_says_i_like_btc_because_the.json": "I mean, I've been in the space for years, and I've seen a huge number of posts\nexpressing a similar sentiment. i.e. \"This is why we bitcoin\", videos showing\nincompetent politicians relishing their control of the money supply, or plebs\nlike me who are devastated by their government's wealth…",
  "data/reddit-crypto/r/CryptoCurrency/comments/u6csva/what_makes_you_stay_in_the_crypto_market_even.json": "For me only thing makes me still stay in the crypto market is that there’s not\nbetter option for me in a third world country?\n\nA job doesn’t pay enough to even make little impact on my life. I’m not looking\nto make millions in this market, I’m just looking to make some money so I could\nhave a…",
  "data/reddit-crypto/r/CryptoCurrency/comments/u61s4v/i_have_500k_of_transactions_on_my_taxes_to_report.json": "I saw a similar about people having a ton of transactions to report due to\ncrypto trading bots. I’m in the same spot.\n\nHere’s my situation\n\n * Used a bot for a long time, tax/gains to report. Have to report cost basis on\n   tokens that are too cheap. Have 500k+ transactions, max size csv exports\n\n…",
  "data/reddit-crypto/r/CryptoCurrency/comments/u6iw0x/congrats_you_made_it.json": "Yes, congratulations, today is tax day in the US and we will finally stop\nhearing people complain about their crypto tax bill. It's been a fun season of\ncomplaints, misinformation/bad advice, and subtle humble brags about large tax\nbills.\n\nAll your favorites like:\n\n * \"If you just HODL you don't…",
  "data/reddit-crypto/r/CryptoCurrency/comments/u6ptgl/safemoon_down_26_in_a_day_as_coffeezilla_video.json": "Here's the video first:\n\n--------------------------------------------------------------------------------\n\n\nI UNCOVERED A BILLION DOLLAR FRAUD [https://www.youtube.com/watch?v=CzbBi0agLNg]\n\n--------------------------------------------------------------------------------\n\nTo summarise the actions of…",
  "data/reddit-crypto/r/CryptoCurrency/comments/u6crmi/its_today_april_18_2022_withdraw_all_your_crypto.json": "This movement first originated in Monero community. The reason is most\ncentralised exchanges don’t allow you to withdraw XMR under fake technical\nreasons. Meanwhile, XMR deposits are always welcome and available.\n\nLater, users of other cryptos recognised they can’t withdraw their funds due to\nfake…",
  "data/reddit-crypto/r/CryptoCurrency/comments/u6mpao/im_realizing_crypto_might_be_the_only_way_our.json": "Honestly, the world is a mess… especially financially. Where I live, the average\nhouse is around 790k (no I don’t live in a big city like Toronto or Vancouver)\nand rent for a 1 bedroom is averaging about $1500 a month plus utilities.\n\nHave you ever heard your parents or grandparents say what they…",
  "data/reddit-crypto/r/CryptoCurrency/comments/u70jme/twitter_influencers_shill_price_leaked.json": "Credit: https://twitter.com/zachxbt/status/1516129830873583617\n\nHere is a list of some influencer price for a shill tweet/retweet or a package\ndeal. Imagine having to pay Lindsey Lohan $25k for a shill tweet for your\nshitcoin lmao. Most of the people on here do undisclosed tweets, so they don't\nsay…",
  "data/reddit-crypto/r/CryptoCurrency/comments/u70le2/are_you_willing_to_be_paid_in_crypto_at_your_job.json": "I've been thinking about this. More and more companies are adopting\ncryptocurrency as a valid method of payment.\n\nBut what if they offered to pay you, their employee, in cryptocurrency? Would\nyou accept? What questions would you have? What conditions would you stipulate?\n\nFor example, would you ask…",
  "data/reddit-crypto/r/CryptoCurrency/comments/u74r6f/1k_invested_into_the_top_10_cryptos_on_january.json": "EXPERIMENT - Tracking Top 10 Cryptos Of 2020 - Month Twenty-Seven – UP 716%\n[https://preview.redd.it/2ptfs3ejhhu81.png?width=666&format=png&auto=webp&s=64443d545bc1a23657ccfc7819a660aa02a2bb8a]\n\n\nMONTH TWENTY-SEVEN – UP…",
  "data/reddit-crypto/r/CryptoCurrency/comments/u79z2g/heres_a_wild_idea_jerktoearn.json": "I'm just throwing shit out there, but if someone actually picks up on that,\nknock yourselves out and build — the world needs this.\n\nSo, a starter pack would include an app, a fitness tracker for men or a fitness\ntracker and a dildo for ladies. Of course you'll need to mint an NFT (of\ndifferent…",
  "data/reddit-crypto/r/CryptoCurrency/comments/u7a7s7/how_to_lose_2k_in_one_click_dont_use_rubic.json": "A few days ago I got caught up in the Sphere hype and exchanged 4 ETH worth\nabout $12K for Sphere using Rubic Exchange. This was a mistake and for more\nreasons than just not buying the dip.\n\n\n\nMetaMask…",
  "data/reddit-crypto/r/CryptoCurrency/comments/u7j14t/netflix_has_just_tanked_and_dropped_more_than_50.json": "Now that the Fed isn't pumping in liquidity, it's no longer a smooth ride up.\nIt's not inconceivable for stocks to enter a period of high volatility.\n\nThere's a lot of intense action on both sides, both for bears and bulls.\n\nSome say we're entering into a bear market. But other experts are talking…",
  "data/reddit-crypto/r/CryptoCurrency/comments/u7onrk/do_people_straight_up_just_deposit_a_million_into.json": "I’ve always wondered this since I don’t understand it much nor have I been in\nthe position lol\n\nSay someone makes $500,000 off a token, decides to cash out, sends it to\ncoinbase or etc wherever, then sells it on there, do you just then deposit it\nfrom there into your bank?\n\nI mean I would assume…",
  "data/reddit-crypto/r/CryptoCurrency/comments/u7s1vv/crypto_games_arent_passive_income_if_they_require.json": "When I open my Twitter and scroll around the new tweets from people, I keep\nseeing all those passive ways of earning crypto with some play to earn\ncryptocurrency games. And in the comments you see someone explaining how they\namassed a grand with just 6 hours of hard farming a day in the game and…",
  "data/reddit-crypto/r/Bitcoin/comments/u7kwpf/mysterious_bitcoin_whale_accumulates_over.json": "The third-biggest Bitcoin [https://www.coincarp.com/currencies/bitcoin/] whale\nin the world has entered accumulation mode with huge purchases of BTC over the\nlast week as the leading crypto by market cap hovers around the $40,000 mark.\n\nThe whale is ranked number three but is the largest non…",
  "data/reddit-crypto/r/Bitcoin/comments/u7s55c/i_used_to_think_1_million_per_bitcoin_was_a.json": "Many investors who previously had 5% of their networth in gold are allocating an\nadditional 5% of their net worth to bitcoin. Investors are starting to allocate\nthe same amount of capital to bitcoin as they have allocated to gold.\n\nGolds market cap risisng from $10T to $25T is a given during a…",
  "data/reddit-crypto/r/CryptoCurrency/comments/u7z6b2/new_list_of_paid_shill_has_been_posted_altcoin.json": "Posted by the same guy who made the shill list yesterday: zachxbt on Twitter\n\n\nYOUTUBER LIST\n\nThis list doesn't include our beloved Bitboy. But his cost has been posted\nbefore.\n\nOut of this list, the only one I have heard is Altcoin Daily with 1.23M subs.\n\nI never watched any of their video, but…",
  "data/reddit-crypto/r/CryptoCurrency/comments/u808kx/safemoon_subreddit_claims_coffezilla_is_spreading.json": "This is just another example of how delusional cryptocurrency communities are.\n\nCoffezilla made a youtube video exposing SafeMoon's billion dollar fraud:\n\nSafeMoon's founders and employees are currently being investigated by the FBI,\nwhile obviously having commited fraud that is documented on the…",
  "data/reddit-crypto/r/CryptoCurrency/comments/u80jkw/class_action_lawsuit_against_plaid_if_you_used.json": "Just a heads up for those of you who may be unaware, perhaps you haven't been\ngetting the emails, or ignoring them as spam, like me. Coinbase, Gemini, and\nPublic are just three exchanges I use, and ALL are affected by this (others\ninclude Robinhood and Venmo). When you initially make an account…",
  "data/reddit-crypto/r/CryptoCurrency/comments/u8i40q/i_dont_care_what_my_family_friends_colleagues.json": "\"Colleagues, comrades, family laugh at me because I invest in crypto.\" So many\nposts about it.\n\nSo what? Who cares?\n\nIt is up to us if we want to educate people who want to learn, who are\ninterested in cryptocurrencies and their potential. There is absolutely no need\nto convince people, even if…",
  "data/reddit-crypto/r/CryptoCurrency/comments/u8vabw/we_need_to_stop_thinking_promoting_women_in.json": "Any headlines you read that say “we need to get more women in crypto” are\npromoting an ideology of equality of outcome, not equality of opportunity.\nCryptocurrency is gender neutral, it does not care how you identify.\n\nWe do not need to bring ones gender into decentralized finance or we will…",
  "data/reddit-crypto/r/Bitcoin/comments/u8fsh7/is_bitcoin_reaching_100000_just_a_matter_of_time.json": "Lightning Network payment volume and quantity. Source: Arcane Research\n[https://preview.redd.it/dt8cdgurdtu81.png?width=1520&format=png&auto=webp&s=0dcf6d009fc53292d6ffe95bc3e4566aa7cfbfe1]",
  "data/reddit-crypto/r/CryptoCurrency/comments/u8z7wv/ever_wondered_if_those_steel_backups_for_crypto.json": "I run a small brand of stainless steel crypto backups and recently I put my most\npopular one inside a ceramic furnace for 12 hours straight, with a peak\ntemperature of 1150 °C (2102 °F) which lasted 1 hour.\n\nMy backup works by converting each word of your seedphrase into its equivalent\nnumber using…",
  "data/reddit-crypto/r/CryptoCurrency/comments/u8mrh9/how_i_find_oversold_altcoins_likely_to_bounce_hard.json": "Now that the market has decided its time to mean revert it's time to find some\naltcoins that are likely to bounce hard.\n\nI know a lot of cynics troll these boards either because they are down bad in\nthe market or they just don't believe in short-term trading. But my process is\npretty simple and if…",
  "data/reddit-crypto/r/CryptoCurrency/comments/u9bwuz/average_internet_user_is_still_strongly_against.json": "If you think most people like crypto or at least are neutral and know something\nabout it you have no idea what you talk about. Minority of people know anything\nabout it.\n\nCheck you tube, tik tok, instagram or other social media. But not crypto\nchannels or sites, those are pro crypto bubble,…",
  "data/reddit-crypto/r/CryptoCurrency/comments/u9az6b/so_binance_just_admitted_the_exchange_has_86.json": "For anyone that read the recent news binance recovers $5.8m linked to axie\ninfinity hack\n[https://www.coindesk.com/business/2022/04/22/binance-recovers-58m-linked-to-axie-infinity-hack/]\nit says Binance has 86 \"North Korean\" KYC registered (in theory right?, because\nwe the mortals have to do KYC on…",
  "data/reddit-crypto/r/Bitcoin/comments/u91ga8/officially_hit_05_btc_today.json": "It took some time in a few alts, but I’m beginning to understand that Bitcoin is\nking. Not sure why it took me so long, and I had my doubts about scalability,\nbut now everything seems so clear.\n\nThe lightning network has improved the speed of transactions by using\noff-network wallets signed by 2…",
  "data/reddit-crypto/r/CryptoCurrency/comments/u9e5mi/dunno_if_anyone_noticed_but_binance_had_a_few_of.json": "4/20 is celebrated by pot heads worldwide but this date is also Hitler's\nbirthday. Coincidentally Binance had their Twitter emoji released that day and\nit was oddly similar to a nazi swastika [https://imgur.com/a/zZvbBSu].\n\nAnd as if that wasn't enough they also released a graphic saying…",
  "data/reddit-crypto/r/CryptoCurrency/comments/u9m95i/no_eth_20_will_not_reduce_transaction_fees.json": "First of all, Eth 2.0 does not exist. It is named \"The merge\" and is the second\nof 3 Ethereum upgrades. \"The merge\" and \"Shard chains\" are yet to come out. The\nfirst upgrade, \"The beacon chain\" is currently live.\n\nThe most common misconception on this subreddit is that when eth 2.0 comes…",
  "data/reddit-crypto/r/CryptoCurrency/comments/u9qgxv/everyone_here_is_seriously_missing_out_on_the.json": "Sometimes I feel that this subreddit is still stuck in 2017 talking about dead\ncoins, whereas there’s this whole wonderful world of defi and web3 filled with\nlife changing gains that I never see talked about here. But I want that to\nchange so I’m putting together this huge list of all the cool…",
  "data/reddit-crypto/r/CryptoCurrency/comments/ua67l6/my_financial_advisor_told_me_to_sell_all_my_crypto.json": "So I’m not giving financial advice, I’m actually paying someone a yearly fee to\nget some financial advice. We had our quarterly meeting today and he’s aware of\nhow much I hold in crypto and strongly advised to sell everything as he’s\nexpecting economic troubles on the horizon. He essentially said…",
  "data/reddit-crypto/r/CryptoCurrency/comments/uacuzf/this_is_how_one_bad_line_of_code_locked_away.json": "Yes, this is what decentralization looks like a single mistake in line of code\nfrom the devs team is going to cost people $34 Million.\n\n> Bid count tracker calculated incorrectly. This caused downstream validation to\n> fail permanently; preventing withdrawal of mint funds.\n\nHere's the whole thread…",
  "data/reddit-crypto/r/CryptoCurrency/comments/ua7lnp/we_are_now_1_month_away_from_bitcoin_pizzas_day.json": "On May 22, 2010, Laszlo Hanyecz agreed to pay 10,000 Bitcoins for two delivered\nPapa John's pizzas.\n\nThese 10.000 Bitcoins would today be worth $395,000,000.00 +\n\nBut do you really think he would've held that over the course of 10-12 years? Or\nwould he panicked earlier and sold at $100, $1000, or…",
  "data/reddit-crypto/r/CryptoCurrency/comments/ualbl3/no_richard_hearts_new_pulse_chain_is_not_a_game.json": "So I saw a post a couple of minutes ago about Pulse chain, which is basically a\ndirect copy of Ethereum. Everything you currently own on Ethereum is going to be\ncopied over and you will basically double your current portfolio, sounds amazing\nright?\n\nI thought so and decided to do a little digging…",
  "data/reddit-crypto/r/CryptoCurrency/comments/uasg31/tezos_to_reach_1000_transactions_per_second_with.json": "The Tezos blockchain is set to reach a new performance milestone with the\nupcoming Octez v13 release, which will enable it to perform 1000 Transactions\nPer Second (TPS).\n\nThis work has been done by the Tarides team who have a solid tech background\nincluding team members coming from University of…",
  "data/reddit-crypto/r/CryptoCurrency/comments/uavnkv/if_you_want_to_be_in_top_10_of_crypto_investors.json": "Most people in crypto will never be very successful and this is unrelated to\nluck, it is just stats, in math we call it normal distribution otherwise known\nas Laplace - Gauss distribution. You most likely had it on math in school or saw\nthose memes about IQ distribution. Generally minority of…",
  "data/reddit-crypto/r/CryptoCurrency/comments/ub0v9h/vitalik_i_feel_like_my_influence_in_ethereum.json": "Vitalik was interviewed [https://nav.al/vitalik-2] recently by Naval Ravikant\nregarding life, ETH and blockchains. There he was asked about his influence over\nthe future direction of Ethereum and V-dog had this to say\n\n> \"Naval: How much influence do you have on Eth today, especially compared to\n>…",
  "data/reddit-crypto/r/CryptoCurrency/comments/ub1ch9/if_you_knowingly_participate_in_a_rug_pull_get.json": "Basically what the title says.\n\nIf you are knowingly participating in a project and promoting it with the sole\nintention of pumping your bags so you can leave others holding a worthless\ncoin/token, you're just as shitty as the creators of said scam.\n\nI'm not saying if you unknowingly bought into a…",
  "data/reddit-crypto/r/CryptoCurrency/comments/ub1s7k/im_no_technical_analyst_but_bitcoin_has_been.json": "I have been using the same Bitcoin chart for the last 15 months, on it I have\ncoded in the 10, 50, 100, 200, 300, 400, 500, 600, 700, 800, 900, and 1000 day\nSimple Moving Averages (SMAs); calculated by adding recent price and then\ndividing by time periods. I also added the Bull Market Support Band…",
  "data/reddit-crypto/r/CryptoCurrency/comments/ub1w54/what_coin_you_own_dropped_in_value_the_most.json": "Hey guys and gals from subreddit r slash cryptocurrency, the best echo chamber\ncrypto related subreddit.\n\nI have a question for you all, what coin you own dropped in value the most\nduring this bear market?\n\nI thought that this bear market reached its bottom like a week ago, but now my\ncoins dipped…",
  "data/reddit-crypto/r/CryptoCurrency/comments/ubf4xk/in_1999_media_attacked_the_internet_a_lump_of.json": "In the early days of the internet, media hit pieces tried to blame the internet\nfor energy consumption.\n\n> Somewhere in America, a lump of coal is burned every time a book is ordered\n> on-line.\n\nhttps://www.forbes.com/forbes/1999/0531/6311070a.html?sh=12b1b1ad2580\n\n> The current fuel-economy…",
  "data/reddit-crypto/r/CryptoCurrency/comments/ubg9me/despite_what_people_say_on_this_sub_expect_crypto.json": "This sub is not a great place to get accurate information as to the state of the\ncrypto market. We are mostly hopium injecting moon farmers here.\n\nTruthfully the world is not in a good economic place right now, inflation is\nsqueezing people's budgets, war and covid are creating supply shortages,…",
  "data/reddit-crypto/r/CryptoCurrency/comments/ubilbd/previous_bitfinex_whale_who_bought_the_bottom_and.json": "This is a visual orderbook and shows where resting (limit) orders are, the\nbrighter the white the higher value the order is, the more blue to colour the\nlower the blue. If price pierces through the colour it means the order has been\nfilled, however orders can also be removed in which case the…",
  "data/reddit-crypto/r/Bitcoin/comments/ubp6ou/politicians_are_going_to_end_crypto_mining_in_new.json": "EDIT: THE VOTE/DEBATE IS STARTING RIGHT NOW (3:15PM EST). WATCH IT HERE!:\nHTTPS://NYSTATEASSEMBLY.GRANICUS.COM/MEDIAPLAYER.PHP?VIEW_ID=13&EVENT_ID=3189\n\nIf r/Bitcoin [/r/Bitcoin] works together to call their reps (they literally only\nhave to convince 17 people to vote \"no\" on the bill) then this…",
  "data/reddit-crypto/r/CryptoCurrency/comments/ubv81z/psa_my_phone_just_guessed_my_private_key_if_you.json": "So, you know how when creating a new seed phrase in a wallet some apps make you\nreenter the entire seed?\n\nYeah, predictive typing remembers your used words and will suggest the second\nword as soon as you type the first one, especially if it's a word you not\ncommonly use.\n\nIn my case my phone is in…",
  "data/reddit-crypto/r/CryptoCurrency/comments/ubv3wu/scammed_for_1200_in_eth_dont_be_me.json": "So, last year I started mining for the first time. I ended up getting around\n$1200 dollars worth of ETH, ETH which I planned to use for my fiancee and my\nwedding. Etherium that I will now.. never get back.\n\nI fell for a simple bot scam where I transferred out of my wallet. I'm too\nembarrassed to…",
  "data/reddit-crypto/r/CryptoCurrency/comments/ubk1ho/crypto_has_a_fake_news_problem.json": "...and not in the way you think. I am not talking about any \"FUD\" by the\nmainstream media - for every article making unfair attacks against crypto there\nis another one depicting it overly positive, and I feel most fall between these\nextremes and are mostly somewhat fair.\n\nI am talking about how the…",
  "data/reddit-crypto/r/Bitcoin/comments/ubl3vk/andreas_gives_a_nice_summary_of_bip119_and_how_it.json": "https://youtu.be/vAE5fOZ2Luw#t=2m10s",
  "data/reddit-crypto/r/CryptoCurrency/comments/ubmkfy/bayc_instagram_was_hacked_and_people_got_scammed.json": "Somebody just hacked Bored Ape Yacht Club's instagram account and made a post\ntrying to get people to connect their wallet to a malicious DAPP. A lot of\npeople did so and now the attacker is stealing their valuable NFTs.\n\nThe attacker has so far stolen 4 BAYC and 6 MAYC NFTs, worth millions…",
  "data/reddit-crypto/r/CryptoCurrency/comments/uc9qga/moonshots_i_analyzed_3000_cryptos_over_the_last_8.json": "All of us have at least once wished we had made a similar play to the one that\nturned $17 into ~6M\n[https://www.benzinga.com/markets/cryptocurrency/21/05/21076574/he-invested-17-in-shiba-inu-now-he-has-almost-6m]\nor had gotten into the right crypto at the right…",
  "data/reddit-crypto/r/Bitcoin/comments/ubqdei/in_1999_media_attacked_the_internet_a_lump_of.json": "In the early days of the internet, media hit pieces tried to blame the internet\nfor energy consumption.\n\n> Somewhere in America, a lump of coal is burned every time a book is ordered\n> on-line.\n\nhttps://www.forbes.com/forbes/1999/0531/6311070a.html?sh=12b1b1ad2580\n\n> The current fuel-economy…",
  "data/reddit-crypto/r/CryptoCurrency/comments/ucart7/11_years_ago_today_satoshi_shared_his_final.json": "April 26, 2011\n\nThe Final Message\n\nSatoshi sent this message to early Bitcoin developer Gavin Andresen as a\nresponse to Andresen talking about Satoshi in the press\n\n“I wish you would stop talking about me as a mysterious shadowy figure. The\npress just turns that into a pirate currency angle. Maybe…",
  "data/reddit-crypto/r/CryptoCurrency/comments/uchy35/so_i_looked_in_the_past_on_this_sub_and_this_is.json": "So I used\nhttps://redditsearch.io/?term=&dataviz=false&aggs=false&subreddits=cryptocurrency&searchtype=posts&search=true&start=1388552400&end=1420002000&size=100\n\nIt isn't good, but it is the best search tool I can find since reddit doesn't\nlet me short through oldest first.\n\n\n\n\n\nThe oldest post I…",
  "data/reddit-crypto/r/Bitcoin/comments/uchoq7/psa_please_take_your_bitcoins_off_exchanges_and.json": "See title. Thanks. Fight fiat. Spread the word.",
  "data/reddit-crypto/r/CryptoCurrency/comments/ucixf5/doge_is_gaining_because_elon_is_buying_twitter_i.json": "You remember saint Elon? AKA The Dogefather? The man who loves to creat hype\naround his beloved Doge and just when everyone is jumping the bandwagon, drop\nthe hammer on the same coin. Like in the middle of SNL? Yes. That Elon. Same man\nwho promised you can buy Tesla with Doge but always had some…",
  "data/reddit-crypto/r/CryptoCurrency/comments/uci3r4/satoshi_nakamotos_disappearance_is_no_mystery_but.json": "Today marks the 11 year-Anniversary of the Satoshi Nakamoto completly\ndisappeared till today. Today he/she/they released their last message to the\npublic, that already forshadowed the disappearance, the message was about not\ncaring much about him but Bitcoin as a whole and the Dev team that was and…",
  "data/reddit-crypto/r/CryptoCurrency/comments/uczr8m/everyone_stressed_out_by_this_red_market_maybe.json": "A lot of us are going about our lives shrugging our shoulders at the red\ncandles. We are not stressed out. We have thousands invested..\n\nThat's the crypto market.. and of you can't sit calmly even when you see your\nportfolio dips for months at a time.. then you have too much emotion invested…",
  "data/reddit-crypto/r/CryptoCurrency/comments/ud1zqr/if_you_read_this_amazing_you_are_still_in.json": "The market wears people down. Most of the retailers in the market have been\nleaving crypto, for now. Last approximate 1.5 years a lot of hype was present\nand a lot of retailers joined the party for quick gains. Now that the market\ntopped at the last all time high, and we have been in an…",
  "data/reddit-crypto/r/CryptoCurrency/comments/ud78ne/your_seed_phrase_some_of_the_worst_mistakes_you.json": "edit: try not to give clues on where you seed is stored, in your comments.\n\nOnce you get a decent amount in your bags, and it becomes more than what you\nwant to leave on an exchange, you may have to start dealing with managing your\nown wallet and your backup seed phrase, which you have to store…",
  "data/reddit-crypto/r/CryptoCurrency/comments/udcwu9/today_11_years_ago_a_bitcoin_developer_decided_to.json": "Gavin Adresen posted that he's going to visit CIA to give a presentation at an\nEmerging conference for the US intelligence community. Remember that he was\ninvited by the CIA for this conference. That means CIA I knew about Bitcoin.\n\nThis is what he posted\n\n> I want to get this out in the open…",
  "data/reddit-crypto/r/CryptoCurrency/comments/ucx9o3/texas_city_votes_for_city_government_to_start.json": "The City Council of Fort Worth, Texas, has unanimously approved BTC mining and\nwill use three ASIC Bitmain AntMiner S9 rigs donated by the Texas Blockchain\nCouncil. This makes Fort Worth the first city in the US to mine its own Bitcoin.\n\nThe city estimated that each of the mining rigs would consume…",
  "data/reddit-crypto/r/CryptoCurrency/comments/udrns8/ive_been_here_since_2013_and_sorry_but_the_bull.json": "Despite the tightening of the money supply and bleak economic outlook, crypto is\ncurrently way too undervalued for the bull run to be over yet. If BTC had hit\n150k, I'd probably agree with the sentiment here, but this is not the case. BTC\npeaked at around 70k. The market cap is way too small for…",
  "data/reddit-crypto/r/Bitcoin/comments/udtvkl/tyranny_is_when_the_government_knows_everything.json": "I was reading comments on some french newspaper article basically saying that\nBitcoin adoption in Central African Republic will lead to even more corruption\nand money laundering from the government.\n\nWe all know that this is absolutely not true, and it got me thinking about a\nvery exciting second…",
  "data/reddit-crypto/r/CryptoCurrency/comments/udxrso/edward_snowden_revealed_as_the_pseudonymous.json": "It was revealed that the identity of the 6th participant in the “trusted setup”\nceremony, who was known by the pseudonym “John Dobbertin,” was Edward Snowden.\n\nThe former United States defense contractor was among the other six\nparticipants, including Zcash creator Zooko Wilcox, Bitcoin core…",
  "data/reddit-crypto/r/CryptoCurrency/comments/udsi8a/in_2021_the_amount_of_crypto_owners_in_the_us.json": "According to a study by Insider Intelligence\n[https://www.insiderintelligence.com/insights/us-adults-cryptocurrency-ownership-stats/]\ncrypto ownership in the US reached 28 million people in 2021. Nazmul Islam,\nforecasting analyst at Insider Intelligence, attributed the increase to new apps\nthat…",
  "data/reddit-crypto/r/CryptoCurrency/comments/ue3oxt/3500000000_hedge_fund_doubles_down_on_bitcoin_btc.json": "TLDR:\n\n> SkyBridge Capital founder Anthony Scaramucci is reportedly devoting nearly\n> half of his firm’s $3.5 billion worth of assets under management to Bitcoin\n> (BTC), Ethereum (ETH), Algorand (ALGO) and crypto-related stocks.\n\nIn addition to this, the hedge fund has a lot of belief in Algorand…",
  "data/reddit-crypto/r/CryptoCurrency/comments/ue9dn3/i_asked_robinhood_what_happens_to_my_crypto_if.json": "Message Text:\n\nThanks for reaching out—I’d be happy to provide some details and peace of mind.\n\nMost importantly, there is no reason to believe that Robinhood Crypto is in any\ndanger of going bankrupt or shutting down at this time. The Robinhood Platform\ncurrently has more than 13 million…",
  "data/reddit-crypto/r/Bitcoin/comments/ue8f8s/panama_bitcoin_bill_are_zero_taxes_better_than.json": "Yes.\n\nPanama banking used to be the best in the world for secrecy. Better than\nSwitzerland. But Pablo Escobar pushed the boundaries and helped put an end to\nall that. The US drug war with Colombia and the cartel’s Panama banking\npartnership ended when the US threatened sanctions and a gray zone…",
  "data/reddit-crypto/r/CryptoCurrency/comments/ueehw6/i_tried_to_warn_people_about_a_metaverse_project.json": "Per my original post\n[https://np.reddit.com/r/CryptoCurrency/comments/twrkua/i_analysed_a_major_metaverse_project_and_believe/]\nwhere I warned everyone about SOLICE. It is now at 40c which is more than 90%\nfrom its ATH and its less than a year old.\n\nThis project has been one disaster after another.…",
  "data/reddit-crypto/r/CryptoCurrency/comments/uelepc/tether_has_missed_its_2022_q1_reserves_report.json": "BACKGROUND\n\nAs part of Tethers settlement with the NY Attorney General they are required to\npublish quarterly reserve reports.\n\nExtract from the settlement:\n\n * \"Publication of Tether’s Reserves: On at least a quarterly basis for a period\n   of two (2) years following the effective date of this…",
  "data/reddit-crypto/r/CryptoCurrency/comments/uepl7y/safemoon_down_45_in_a_day_965_from_ath_as.json": "Weirdly enough, the previous two videos detailing extraordinary allegations,\nwith proof, on the massive scale of fraud that permeates Safemoon didn't seem to\ndo it, but the truth from the latest video has finally sunk in, with a top whale\nselling off four Billion tokens (worth nearly…",
  "data/reddit-crypto/r/CryptoCurrency/comments/uez05y/messin_with_a_scammer.json": "This might be a bit lengthy just because of all the screenshots, but I wanted to\nshame this idiot of a scammer that I kept occupied for about 6 hours maybe, I\nhope you enjoy the ride as much as I did!\n\n\n\nThey started off by just saying words, nothing even made any sense so it was\nobvious what was…",
  "data/reddit-crypto/r/CryptoCurrency/comments/uf7ksq/5_red_weeks_for_btc_in_a_row_if_we_close_red.json": "Hello,\n\nIt's look like we are going to close tomorrow in red week. For the 5 weeks in a\nrow. Last time this happened was back in 2018 from 22th October to 25th\nNovember.\n\nWhat this can mean?\n\nIf this is really gonna happen and tomorrow is gonna be another bloody sunday,\nwe can look what happened in…",
  "data/reddit-crypto/r/CryptoCurrency/comments/ufav3p/this_is_how_someone_negotiated_a_16_crypto_domain.json": "He bought the domain in 2017 for $16 and sold it for half a million. True\ndiamond hands?\n\n\n\nSomeone offered $500\n[https://preview.redd.it/qcs29psd0ow81.png?width=689&format=png&auto=webp&s=2d62bffd95a006007c6cc2f1da928959cfb0a2d4]\n\nInitially he wanted 10 BTC for the domain.\n\n\n\n10 BTC…",
  "data/reddit-crypto/r/CryptoCurrency/comments/ufbmig/btc_has_held_its_ground_at_close_to_40000_for_the.json": "The stock market is crashing, inflation is at a record 40 year-high, there's a\nwar at the moment between two of the world's major countries, supply chain\nissues, interest rates are going up, etc... AND while all of this is happening,\nbtc has held its ground at close to 40k as possible for the last…",
  "data/reddit-crypto/r/CryptoCurrency/comments/uf9vdo/as_a_gamer_i_am_bullish_beyond_words_on_gamestops.json": "The mainstream medias suppression of Gamestops’ Loopring announcement is the\nmost bullish thing I’ve ever seen in the crypto space.\n\nLet me run down why for you:\n\n * GPU prices are going back closer to MSRP\n * New gens of GPU and CPU are released later this year\n * mainstream medias supression of…",
  "data/reddit-crypto/r/CryptoCurrency/comments/ufmayr/everything_is_down_sell_before_the_end_of_crypto.json": "so after checking the Crypto Fear and Greed Index which analyzes the emotions\nand sentiments from different sources and crunches them into one simple number,\nit seems that this is the end of crypto.\n\nEverybody saying that now is the time to buy are just a bunch of bag holders who\nwant you to invest…",
  "data/reddit-crypto/r/CryptoCurrency/comments/ufkt75/i_dont_get_how_solana_still_has_supporters_after.json": "Before I begin this post. I will NOT be posting hate but simply FACTS.\n\nEDIT: Solana is at 2 TPS right now and is basically down LMAO\n\nNow I’ll press ahead.\n\nYeah it’s fast and cheap since it boasts what might be the highest TPS in the\nmarket. But what use is this ultra high TPS if half of the time…"
}