{
  "data/reddit-know/r/YouShouldKnow/comments/ou7a1f/ysk_about_sugaring_the_alternative_to_waxing.json": "Why YSK: Although basically the same, sugaring less irritates the skin rather\nthan the normal waxing. With waxing, there’s more potential for ingrown hairs\nbecause the wax mixture can lead to hair breakage.\n\nWith sugaring, the paste doesn’t stick to the top layer of skin. Instead, it\nadheres to hair…",
  "data/reddit-know/r/YouShouldKnow/comments/ov25xn/ysk_bottled_water_may_have_an_expiration_date.json": "Why YSK: because that bad taste indicates you shouldn’t drink it. You will also\nknow whether it’s bad if there is an odor.",
  "data/reddit-know/r/YouShouldKnow/comments/ov6mmz/ysk_if_you_are_working_a_lot_from_home_check_that.json": "Why YSK: I've been wrestling back pain for months and this is likely the reason!\nI've added spacers to level things out more now and hopefully I don't have to\nsuffer as much anymore",
  "data/reddit-know/r/YouShouldKnow/comments/ovgdbd/ysk_that_most_locks_in_the_us_and_being_used_have.json": "Why YSK: Is because anyone using a random padlock, or any Master Lock\n(especially), on sheds, sensitive company access areas, lockers at school, work,\netc., can be easily picked or raked open by someone. This would cause less\nsound, and once open, would allow more time for the bad guy/gal to peruse…",
  "data/reddit-know/r/YouShouldKnow/comments/ovisks/ysk_dirty_hummingbird_feeders_kill_hummingbirds.json": "Why YSK: If your hummingbird feeder is cloudy or moldy please take down\nimmediately and clean it as cloudy or moldy feed can cause the hummingbirds\ntongue to swell called Hummers candidiasis. Once swollen the hummingbird cannot\neat causing it to starve to death. You can clean it by mixing a 10%…",
  "data/reddit-know/r/YouShouldKnow/comments/ovlf8x/ysk_taking_the_time_to_relearn_how_to_properly.json": "Why YSK: Our bodies have an amazing capacity to heal, but incorrectly handling\nday to day tasks can cause wear and tear leading to irreparable damage.\nSometimes not even surgery can the damage.\n\nI'm going to list below some tips that I never properly learned while growing\nup. Now I have to deal with…",
  "data/reddit-know/r/YouShouldKnow/comments/ow38fq/ysk_if_youre_stuck_in_a_pay_it_forward_situation.json": "Why YSK: Most employees will be happy to do it for you, and you can still give\nthe people behind you a favor. Or, you can just say no thanks. The people behind\nyou will never know, and if the employee judges they're an a-hole anyway, screw\nthem",
  "data/reddit-know/r/YouShouldKnow/comments/ow3fy3/ysk_expiration_dates_on_boxed_foods_with_multiple.json": "Why YSK: For example, a macaroni and cheese with a liquid/cream sauce packet\ninside might say it expires in 4 months. The sauce expires then, but the dry\npasta is 100% good much longer than that and absolutely doesn't need to be\ntossed. Pasta is usually good for a couple years.\n\nIf its dry goods,…",
  "data/reddit-know/r/YouShouldKnow/comments/ow6412/ysk_apologizing_is_not_a_weakness_it_can_be_very.json": "Why YSK: Far too many people believe apologizing is a weak thing to do and/or\nthey don't want to admit that they're wrong because that removes the possibility\nof them being perfect.\n\nNot only will someone you've wronged greatly appreciate it, it's a humbling\nthing to do and you'll likely feel good…",
  "data/reddit-know/r/YouShouldKnow/comments/owdt14/ysk_social_intelligence_is_mostly_being_able_to.json": "Why YSK:\n\nA lot of people are afraid of coming across as creepy, limiting their social\ninteractions to limit their risk. The better option is to watch for feedback in\nother people and backing off if they're not interested in your attention.\nKnowing this gives you a lot more space to be yourself.",
  "data/reddit-know/r/YouShouldKnow/comments/own2ny/ysk_that_if_your_pets_spook_you_out_by_regularly.json": "Why YSK: I’ve read multiple accounts of this on AskReddit threads (you know the\nkind), so I thought I’d mention it.\n\nI’m not saying it’s definitely not ghosts, but I have been told this by at least\nthree separate plumbers (I really don’t know why, other than the fact that I own\npets and live…",
  "data/reddit-know/r/YouShouldKnow/comments/ox1jjw/ysk_that_letting_your_dog_sniff_on_walks_is_very.json": "Why YSK: Dogs learn about their surroundings through their noses. What dog has\nbeen here? What is this interesting smell emanating from this green bin? Oh is\nthat what snails smell like? There is a great misconception about walking dogs,\nthat owners think the enriching part of the walk is the act of…",
  "data/reddit-know/r/YouShouldKnow/comments/ox3yl1/ysk_electric_razors_are_designed_to_be_cleaned.json": "Why YSK: Ever notice that your electric razor doesn't work as well as it used\nto? Have you cleaned it out? Have you changed the blades?\n\n\nCLEAN OUT YOUR ELECTRIC RAZOR\n\nIt depends entirely on the design of your razor, but ever electric razor has\nspring-loaded buttons to release the foil guard, or a…",
  "data/reddit-know/r/YouShouldKnow/comments/ox99ex/ysk_your_apartment_or_house_has_filters_and_they.json": "YSK: Most modern apartments and homes have a variety of air filters that need\ncleaned or changed regularly. Why YSK: Dirty filters can cost you money, make\nthings uncomfortable, or simply cause machines to fail/suck. Air conditioner not\ncooling well? Check the front filter (on window unit) or the…",
  "data/reddit-know/r/YouShouldKnow/comments/oxadek/ysk_switching_pesticide_brands_and_types.json": "Why YSK: Cockroaches, ants, etc. can slowly become resistant to pesticides.\nSwitching them up can prevent that. This also applies to weed killers,\nfungicides, etc.\n\nIdeally, you should use pesticides as little as possible around your home. They\nshould be a last resort. Things like diatomaceous earth…",
  "data/reddit-know/r/YouShouldKnow/comments/oxmx4g/ysk_californias_medicaid_health_plans_will_be.json": "Why YSK:. So you or people you know who would benefit from this get it.",
  "data/reddit-know/r/YouShouldKnow/comments/oxqsp8/ysk_one_punch_can_kill.json": "Why YSK: Today my BIL died from a catastrophic brain injury.\n\nHe was struck in the back of the head a few days ago during what we think was a\nfight with a drug dealer. He didn't seek medical attention in time for them to\nrelease the pressure so his brain swelled and killed him.\n\nSucker punches,…",
  "data/reddit-know/r/YouShouldKnow/comments/oy1qoo/ysk_the_weight_distribution_on_a_dollycart_matters.json": "I move heavy cartloads of stuff a lot for work and am often surprised how many\npeople don't realize how weight distribution impacts the cart's ability to roll\nwell. The next time you need to move a cart of stuff around, step back and look\nat it. Which end looks like it's probably heavier? Make sure…",
  "data/reddit-know/r/YouShouldKnow/comments/oy3goj/ysk_the_iata_have_a_very_good_tool_to_see_all.json": "Why YSK: It’s expensive to lose a flight\n\nLink to the tool: https://www.iatatravelcentre.com/world.php",
  "data/reddit-know/r/YouShouldKnow/comments/oy5f0t/ysk_if_youre_sick_of_doing_recaptchas_on_the_i_am.json": "Why YSK: If you click on the side of the box, rather than within the range, it\nusually verifies instantly. I can't exaggerate how vexing it is to constantly\nkeep my eyes peeled, especially when met with grainy, low-quality images. Sure,\nit's an efficacious tactic to ward off the ever-increasing…",
  "data/reddit-know/r/YouShouldKnow/comments/oyje4e/ysk_uk_an_nhs_dental_checkup_is_2380_treatment.json": "Dentures, crowns, bridges and mouth guards are £282.80. Your check-up cost is\nincluded in the full price for treatment. It isn’t per tooth! It’s one band\ncharge for that course of treatment from your check-up. You are exempt from\npaying if you’re on various credit benefits i.e tax credit, universal…",
  "data/reddit-know/r/YouShouldKnow/comments/oyz7rt/ysk_if_someone_is_trying_to_kidnap_or_abducting.json": "Why YSK: IF you are forced in to a vehicle. Do NOT let them get you to their\n\"Safe\" place. Don't comply, don't accept any faith, do not trust their words\nabout not harming you\n\nDo your best to attack the person, hit them in the stomach, in their private\narea, any soft area in general is good.\n\nUse…",
  "data/reddit-know/r/YouShouldKnow/comments/oz6mvk/ysk_mutual_abuse_in_a_relationship_is_a_myth.json": "Why YSK: a lot of abuse victims are stuck in an abusive relationship because\nthey believe it's their fault and don't deserve to escape.\n\nThe following link from the national domestic violence hotline has more detail.\nhttps://www.thehotline.org/resources/the-myth-of-mutual-abuse/",
  "data/reddit-know/r/YouShouldKnow/comments/oz9ist/ysk_if_you_cant_defend_your_opinion_beyond_saying.json": "Why YSK: - A belief or opinion is more valid and credible when there’s fact or\nrational, logical conclusion attached to it beyond personal bias. Being able to\nback up your thoughts will make it so that you’re believing things an honest\nbasis, and it helps encourage critical thinking and less…",
  "data/reddit-know/r/YouShouldKnow/comments/ozaovw/ysk_that_your_cat_picking_food_up_with_its_paw.json": "Why YSK:\n\nCats whiskers are not simply long hairs, they are attached to ultra sensitive\nsensory organs (proprioceptors). Repeated input can cause stress. more details\n[https://catvettucson.com/whisker-fatigue/]\n\nImagine changing your focus from near to far over and over, eventually your eyes\n(and…",
  "data/reddit-know/r/YouShouldKnow/comments/ozcpan/ysk_despite_popular_belief_most_selfdefense.json": "First and foremost, you risk dropping your keys or having them taken from you,\nwhich means you have now lost access to your vehicle and/or home. Worse, if your\nattacker gets them now THEY have access. Getting inside your home or vehicle can\nbe imperative to escaping, and you don't want to lose your…",
  "data/reddit-know/r/YouShouldKnow/comments/ozfw37/ysk_if_you_have_self_esteem_issues_regarding_your.json": "Why YSK: You can be the hottest person in the world and there'll still be people\nwho find you ugly. So you can be the ugliest person and some will consider you\nhot.\n\nI spoke to my mom the other day about attraction and showed her a few pictures\nof male celebrities that I (a queer agender person)…",
  "data/reddit-know/r/YouShouldKnow/comments/ozl3j3/ysk_use_soap_and_water_instead_of_hand_sanitizer.json": "Why YSK:\n\nHand sanitizer doesn't kill as many germs as properly washing your hands and in\naddition the use of hand sanitizer may lead to the development of resistant\nbacteria because when you use hand sanitizer it only kills some of the germs.\n\nSource: https://www.ucihealth.org/blog/2020/04/soap-vs…",
  "data/reddit-know/r/YouShouldKnow/comments/ozlt1t/ysk_if_you_ever_get_an_organ_transplant_in_the_us.json": "Why YSK: Transplant services care more about 1 year mortality than any amount of\nhuman suffering, so dying in dignity and comfort might require a fight with the\nhospital, rather than relying on the advice of medical experts.\n\nYou could literally have maggots growing out of your eye sockets (not…",
  "data/reddit-know/r/YouShouldKnow/comments/ozm9uw/ysk_the_vagina_refers_specifically_to_the_inner.json": "Edit: Please continue making jokes about my typo because I love them.\n\nWhy YSK: Way WAY too many women and/or folks with vaginas hear \"don't clean your\nvagina\" and assume this means soap should never touch your nethers. But the\nreality is this is a recipe for all sorts of gross conditions including…",
  "data/reddit-know/r/YouShouldKnow/comments/ozofyq/ysk_that_many_police_stations_in_the_us_offer.json": "Why YSK: When you're buying/selling (in-person) off of someplace like eBay,\nCraigslist, or r/hardwareswap [/r/hardwareswap], doing the trade at one of these\nplaces can ensure that you don't end up getting mugged, robbed, or scammed. On\nan unrelated sidenote, PayPal G&S also offers buyer/seller…",
  "data/reddit-know/r/YouShouldKnow/comments/ozp35g/ysk_that_the_centre_for_clinical_interventions.json": "Why YSK: Mental health problems are common, and access to therapy can be hard\nfor many reasons including time, money and waiting lists.\n\nThe Centre for Clinical Interventions provides information packs and worksheets\nyou can go through to help you deal with many common mental health problems,\nwhich…",
  "data/reddit-know/r/YouShouldKnow/comments/ozza9v/ysk_agree_with_someone_first_even_if_you_disagree.json": "WHY YSK:\n\nEven if you disagree with them, first just accepting their experience as real\nwill help them feel validated, and create a closer bond between the two of you\n\nWhereas launching into a contrary opinion before validation will make them feel\ngaslighted and attacked by someone they were seeking…",
  "data/reddit-know/r/YouShouldKnow/comments/p08m54/ysk_that_discount_tires_les_schwab_and_several.json": "Why YSK:\n\nFound this out unintentionally the other day. Ran over a nail somewhere the day\nbefore and had to take it in. Already had a bunch of money tied up this month,\nso I was dreading the cost. To my surprise, Discount got me in and fixed it for\nfree in half an hour. Found out this was a pretty…",
  "data/reddit-know/r/YouShouldKnow/comments/p0peoy/ysk_dont_think_its_wrong_to_feel_grief_over_the.json": "Why YSK: Obviously if the person was a horrible person, that is a different\nconversation. Also, having never known the celebrity, one fan's grief obviously\nprobably doesn't compare to that celebrity's close friends and family, the\npeople who really knew them.\n\nWith that said, there's nothing wrong…",
  "data/reddit-know/r/YouShouldKnow/comments/p0pwfm/ysk_that_if_your_white_dress_shirts_have_brown.json": "Why YSK:\n\nI dont know why this never crossed my mind before. Ive thrown away countless\nwhite dress shirts because of this. I have one of those korean green\nscrub/exfoliating mitts from H mart and a light scrub around my neck in the\nshower completely gets rid of any brown stains. Just make sure to…",
  "data/reddit-know/r/YouShouldKnow/comments/p0q7ub/ysk_you_are_free_to_be_sad_just_because_someone.json": "Why YSK: People will sometimes say something like: Well, just be lucky you're\nnot homeless, or that you're not in a third world country or not a single\nparent, or with an abused partner or this and that, trying to invalidate other\npeople's feelings. That is wrong.\n\nYes, there are people who have it…",
  "data/reddit-know/r/YouShouldKnow/comments/p0qd9p/ysk_colorblindness_correcting_sunglasses_do_not.json": "Why YSK: I've been seeing the videos of people reacting to 'seeing color for the\nfirst time' circulating their way through reddit once again and they never fail\nto gain alot of traction and come off as heartwarming and emotional.\n\nUnfortunately, these videos are typically staged for marketing…",
  "data/reddit-know/r/YouShouldKnow/comments/p0qfim/ysk_there_is_nothing_wrong_about_formula_fed.json": "Why YSK: There is often misconceptions about anything other then the breast\nbeing bad, but that is wrong. Sometimes the mom doesn't get enough milk, so the\nbaby becomes underfed. It is perfectly fine using formula to feed the baby.\n\nhttps://www.health.harvard.edu/blog/why-we-shouldnt-demonize…",
  "data/reddit-know/r/YouShouldKnow/comments/p0r8bk/ysk_inform_do_not_scare_or_lie_to_children_to_get.json": "Why YSK: Rather it's telling them to brush their teeth, or how to behave in\npublic, or eating healthy, a number of reasons.\n\nYes, you'll have to explain to them in a way that makes sense, and yes, they\nwill ask countless questions, which can get irritating. But being honest with\nthem, about xyz, is…",
  "data/reddit-know/r/YouShouldKnow/comments/p0up8l/ysk_blippi_made_a_harlem_shake_video_where_he.json": "Why YSK: he started out trying to make shock/grossout videos, but then realized\ntoddlers are a much easier audience to entertain, so now your kids are probably\nwatching him on youtube. Also, he's creepy.\n\nhttps://www.buzzfeednews.com/article/katienotopoulos/blippi-youtube-kids-star-harlem-shake…",
  "data/reddit-know/r/YouShouldKnow/comments/p0yjs6/ysk_a_fun_training_trick_teach_dogs_that_bark.json": "Why YSK: Most people just try to teach their pets some variation of the command\n\"quiet/shh/stop/shut up\", but they're fighting their way uphill.\n\nBarking excessively is an anxious, reactive, or bored behavior, not a random\none. If they're just prevented from barking...the pet's underlying stress…",
  "data/reddit-know/r/YouShouldKnow/comments/p0z00a/ysk_expecting_your_kids_to_fulfill_your_own.json": "Why YSK: Well, of course it is important to support Your children throughout\ntheir personal development, education, etc as best as You can. They should have\nthe option to use every resource they can reasonably have!\n\nWhat I'm rather referring to is the cases where people expect their offspring…",
  "data/reddit-know/r/YouShouldKnow/comments/p12re0/ysk_colorado_requires_employers_to_post_a_salary.json": "Why YSK: Colorado requires employers to post either the starting salary or the\nsalary range when advertising a job. If you are looking to apply and unsure how\nmuch you would make, you can search for a similar job in Colorado and see how\nmuch it pays. Obviously you'll have to do some math to adjust…",
  "data/reddit-know/r/YouShouldKnow/comments/p13852/ysk_bumps_and_rashes_on_your_skin_not_including.json": "Why YSK: There is a treatment available and you may not even realize it’s a\nproblem.\n\nI recently went for a checkup and my doc asked me about the bumps on my neck. I\nshave my head and thought they were a result of shaving. Turns out that it was\nelevated staphylococcus infection which was easily…",
  "data/reddit-know/r/YouShouldKnow/comments/p16bph/ysk_not_to_keep_a_pit_viper_bites_lower_than_your.json": "Why YSK: Kits to apply suction to snake bites and outdated information to keep\nthe bite lower than your heart are still in circulation, but now these practices\nare well-known to be ineffective and in many cases worsen the effects of the\nvenom in pit vipers specifically. Pit vipers include…",
  "data/reddit-know/r/YouShouldKnow/comments/p1aoo5/ysk_your_dogs_nails_are_quite_likely_too_long.json": "Why YSK: Dogs who have overgrown nails suffer more serious consequences than\nmost people realize.\n\nHow to tell if they're too long: When your dog is standing on all legs, fully\nupright, and they press into the ground.\n\nWhy this is bad: the more overgrown the nail, the more it pushes on the joints\nof…",
  "data/reddit-know/r/YouShouldKnow/comments/p1ek6p/ysk_most_commerical_semi_trucks_are_governed_to.json": "Why YSK: as a commercial truck driver I often get flipped the bird and other\nbeautiful sign language while driving. Most of the time it's after it's taken me\na little while to either pass a fellow truck driver or someone in a regular\npassenger vehicle that just can't find the gas pedal. We don't…",
  "data/reddit-know/r/YouShouldKnow/comments/p1kxyx/ysk_regarding_the_workplace_resilience_and.json": "Why YSK: I’ve noticed with customer facing roles some employers like to note\nthey’d like their prospective employee to show “resilience” or “ability to\nself-regulate”.\n\nIt’s important to ask what they mean by that in the interview stage or even\nprior to applying because they can be referring to…",
  "data/reddit-know/r/YouShouldKnow/comments/p1oyzz/ysk_if_you_get_something_from_amazon_twice_just.json": "If you order something, it gets delayed, but you already informed amazon that I\ngot lost in the mail. Now they sent you the thing again, and you have it twice.\nAt this point you should keep it.\n\nWhy YSK: If you give it back, it will likely go to a landfill. Even if it gets\nsold again, it will cost…",
  "data/reddit-know/r/YouShouldKnow/comments/p1r3y7/ysk_seoul_is_pronounced_seoul_just_say_soul_not.json": "Why YSK: many foreigners say 'Say-ool', when it's pronounced more like 'Soul'.\nHowever, just any time you travel to a new city, at least learn how to pronounce\nthe city's name. Just 2 seconds of Google to show a little respect. I've heard\nsomeone call Phuket 'Fuck-it' while they were there on…",
  "data/reddit-know/r/YouShouldKnow/comments/p1rawu/ysk_that_if_you_bought_gold_10_years_ago_to_this.json": "Why YSK: because it has been the narrative people in my generation and older\nhave grown up to believe. This last 10 years has seen one of the biggest bull\nruns in history and mainstream media have continued to push this naritive behind\ngold even though it has failed and other assets including…",
  "data/reddit-know/r/YouShouldKnow/comments/p1rp47/ysk_adoption_through_foster_care_usually_has_no.json": "Why YSK: So many families believe adoption is cost-prohibitive or sometimes less\nexpensive than fertility treatments or surrogacy, when there are more practical\noptions.\n\nEveryone is obviously entitled to their own belief in the right way to grow your\nfamily - my personal belief is to not…",
  "data/reddit-know/r/YouShouldKnow/comments/p1tb9d/ysk_your_citycounty_likely_has_an_interactive_map.json": "EDIT: This information is only applicable in the US.\n\nAlmost every state publicly provides this information. Just google your\ncity/town/county and \"sex offender map\" and you'll find a link to an interactive\nmap. You can click on icons that often list their:\n\n * name\n * picture\n * physical…",
  "data/reddit-know/r/YouShouldKnow/comments/p1vz61/ysk_if_you_call_someone_from_a_private_number_and.json": "Why YSK:\n\nWhen you call from a Private Number, the person has no way to return contact. In\nthe event they accidentally disconnected while answering (new and unfamiliar or\nfumbled phone, large or slippery fingers, being distracted from a\nfocus-intensive activity, etc), they cannot reach out to you to…",
  "data/reddit-know/r/YouShouldKnow/comments/p1yg9v/ysk_it_is_not_possible_to_recycle_96_of_plastic.json": "Why YSK: Contrary to popular belief, recycling is not an ideal solution to the\npollution crisis.\n\nThe pollution crisis is actually caused by overconsumption, and that is why our\nconsumerist lifestyle in western society is more detrimental than corporations\nwant us to think.\n\nSince it is not possible…",
  "data/reddit-know/r/YouShouldKnow/comments/p1yrm7/ysk_that_cremated_remains_that_are_placed_in_soil.json": "Why YSK: Cremated ashes may be harmful when placed in the soil or around trees\nor plants. Cremated remains do contain some nutrients that plants require such\nas calcium, potassium, and phosphorus. But human ashes are very salty which is\ntoxic for most plants and can be leached into the soil.\n\nFor…",
  "data/reddit-know/r/YouShouldKnow/comments/p29wmb/ysk_if_you_have_signed_up_to_be_contacted_about.json": "Why YSK: Companies pay a lot of money in advertising so that leads (such as\nyourselves) find the company and request to be contacted for a possible sale.\nBecause of this, telemarketers are told to hang on to the lead and keep calling\nfor as long as possible in order to hopefully return on the…",
  "data/reddit-know/r/YouShouldKnow/comments/p2azf5/ysk_if_a_fire_suddenly_gets_more_intense_andor.json": "Why YSK:\n\nThis is the sign of a potential oncoming explosion. When a fire reaches an\nadditional accelerant it can take a few moments for the fire to get hot enough\nfor the explosion to occur but will often very quickly ramp up in intensity\nshortly beforehand.\n\nA very extreme example is the fairly…",
  "data/reddit-know/r/YouShouldKnow/comments/p2dbns/ysk_you_dont_have_to_live_with_your_apartments.json": "Why YSK: 'Quality of life' and 'quality of shower' go hand-in-hand for many\npeople, and low water pressure can make you feel like you're showering in warm\nsweat. A high-pressure shower head can cost around $15 USD and should be able to\nbe screwed on/off. I've had the same head through three…",
  "data/reddit-know/r/YouShouldKnow/comments/p2im25/ysk_holding_the_car_remote_to_your_head_will.json": "Why YSK: Anybody who is looking for their parked car and clicks on the remote to\nsound the alarm/flash the lights will benefit by it working from further away\n\nHolding the Car Remote to Your Head Increases Its Range\n[https://www.apartmenttherapy.com/tech-myth-holding-the-care-rem-83663]",
  "data/reddit-know/r/YouShouldKnow/comments/p2k1fu/ysk_its_espresso_with_an_s_not_x_pronounced.json": "Why YSK: because apparently this is not common knowledge. I watch tons of recipe\nvideos online and I promise you, people still say expresso.",
  "data/reddit-know/r/YouShouldKnow/comments/p2me0b/ysk_anybody_who_has_been_overpunished_regularly.json": "Why YSK: be patient with somebody who has their wall up like this. Its not\nalways their fault that they don’t trust you or give in to your efforts and\nencouragement. Just be patient and slow leak the encouragement when it is\ndeserved and helpful. A person who’s been overpunished regularly will…",
  "data/reddit-know/r/YouShouldKnow/comments/p2txm2/ysk_that_exit_only_lanes_on_the_highway_have.json": "Why YSK: If you’re cruising along on the highway, keep an eye out for whether\nyou are on an exit only lane and get out of the way early if you’re not planning\non exiting, this will save you swerving into highway traffic to avoid exiting.\nEDIT: as someone said below, DO NOT SWERVE OUT OF THE EXIT…",
  "data/reddit-know/r/YouShouldKnow/comments/p2vb2k/ysk_how_to_be_courteous_at_the_drivethru.json": "Why YSK: There are a few tricks you can use to make your service better and take\nsome stress off of the workers. 1. If you have a loud car, please turn it off\nwhen you’re ordering. 2. Order EVERYTHING that you need at the voice box,\nincluding sauce, extra napkins, extra straws, salt packets. That…",
  "data/reddit-know/r/YouShouldKnow/comments/p2vew5/ysk_if_you_get_a_sudden_massive_influx_of_spam.json": "Why YSK Scammers and thieves will inundate your email with thousands and\nthousands of emails in a short period of time at an odd hour when people are\ntypically asleep. They do this to mask illegitimate purchases they are making on\nsomething like your Amazon account that they hacked.",
  "data/reddit-know/r/YouShouldKnow/comments/p31zkk/ysk_restaurants_with_large_menus_that_have.json": "Why YSK: Places with larger menus just cannot carry every item needed without\nfreezing almost everything and using premade food items. If you see a menu that\nhas pasta options, steak options, chicken options, fish options, an oddly placed\nMexican option, 10 unique salad options... you are most…",
  "data/reddit-know/r/YouShouldKnow/comments/p33pwx/ysk_sexual_assault_hotline.json": "Why YSK: This hotline is the best resource in the US for a person who has been\nsexually assaulted.\n\n1 800 656 4673\n\nFor anyone wondering, RAINN will provide free, confidential advocacy to the\nvictim. They always let the victim decide how to move forward, and will not\npressure you into taking or not…",
  "data/reddit-know/r/YouShouldKnow/comments/p355gs/ysk_the_current_labor_shortage_runs_far_deeper.json": "Background: I work in the US manufacturing industry and specialize in how to\nmanage employee workloads in a production line setting. The manufacturer that I\nwork at has increased wages twice in the last year, and every worker is making\nat least $3 more an hour, and when we started our wage increase…",
  "data/reddit-know/r/YouShouldKnow/comments/p36zhb/ysk_if_you_have_a_vehicle_that_has_a_smart.json": "Why YSK: For example, my 2015 Jeep Renegade has the UCONNECT software for the\ncenter console interface. I went to their website and found that my car was\nactually a few versions behind the latest. All I had to do was unzip a download\non a USB stick and put it in my car and turn it on. It actually…",
  "data/reddit-know/r/YouShouldKnow/comments/p38nfg/ysk_you_can_probably_mute_your_microwave.json": "Why YSK: If you don't like the beep of your microwave when you press a button or\nit finishes operating, there is a mute function on almost all modern microwaves.\n\n\n\nThis is usually accomplished on the main panel by:\n\n- Pressing and holding the 0 or 1 button for 3 seconds\n\n-Pressing and holding the…",
  "data/reddit-know/r/YouShouldKnow/comments/p38tkr/ysk_that_even_though_you_are_in_the_right_others.json": "Why YSK: I know this is obvious, but I am saying this because I have seen\nhorrible accidents because people ran a red light / stop sign. It's somewhat\neasy to avoid these types of accidents if you look both ways, regardless of your\nright to immediately go. It's sad, but there are many people who…",
  "data/reddit-know/r/YouShouldKnow/comments/p3bpjc/ysk_that_if_you_have_restless_legs_at_night_and.json": "Why YSK: RLS can be triggered by low blood sugar\n[https://diabetestalk.net/diabetes/can-high-blood-sugar-cause-restless-legs]\neven if you are not diabetic. Eating before bed, especially refined carbs, can\nmake it so that once you're waiting for sleep you end up in a period of low\nblood sugar, which…",
  "data/reddit-know/r/YouShouldKnow/comments/p3yc5t/ysk_windows_and_mac_both_have_integrated_popover.json": "Apparently I'm actually not allowed to tell you how to access these keyboards.\nUse google or check the comments below.\n\nWhy YSK: This is much easier than most other methods of finding these symbols.\n\nIt's technically an older feature from Windows 8, but it now seems to work for\nall keyboards and…",
  "data/reddit-know/r/YouShouldKnow/comments/p411kq/ysk_you_should_and_can_clean_out_the_klean.json": "We got my son a Klean Kanteen with the sport cap bite valve for summer camp. I\nnoticed by the end that while we washed the bottle and cap by hand every night\nand ran it through the dishwasher every weekend, the valve had some pretty tight\nspots that weren't getting cleaned out.\n\nWell, of course, it…",
  "data/reddit-know/r/YouShouldKnow/comments/p4iecx/ysk_all_fuel_gauges_in_cars_have_a_small_arrow.json": "Why YSK: it’s incredibly useful to have whenever you’re driving a new or\nunfamiliar car. It’ll save time and hassle when you get to a gas station.\n\nEdit: as many have pointed out, it’s just many/most cars - not all of them.\nStill potentially useful!",
  "data/reddit-know/r/YouShouldKnow/comments/p4lc6i/ysk_when_pouring_liquid_from_containers_with_an.json": "Why YSK: This will help to prevent air chugging and give a more steady\ncontrollable flow.",
  "data/reddit-know/r/YouShouldKnow/comments/p4q9gw/ysk_about_widevine_googles_drm_solution_for.json": "Why YSK: You may, for example, be paying for a UHD 4k Netflix plan but only\ngetting 540p or even 480p streams depending on your device. Check with your\nstreaming provider for their list of \"compatible devices\".",
  "data/reddit-know/r/YouShouldKnow/comments/p4ta2e/ysk_its_not_a_good_idea_to_post_a_picture_of_keys.json": "Why YSK: it is so easy to make a copy of a key from a picture.",
  "data/reddit-know/r/YouShouldKnow/comments/p55irg/ysk_that_ocean_creatures_you_may_encounter_on.json": "Why YSK: so you don't die and you don't accidentally kill sea creatures. Don't\ntouch unless you're a scientist or otherwise properly trained and have\nequipment.\n\nExamples of marine life that can kill you: - Sea Lion (a bite can lead to\nnecrosis of your flesh) - Blue Ringed Octopus - Box…",
  "data/reddit-know/r/YouShouldKnow/comments/p5jb47/ysk_any_citizen_of_a_commonwealth_nation_can_seek.json": "Why YSK: an admittedly a niche bit of information, however if you ever did need\nit, it could literally save your life one day. It's also just useful if you've\nlost your passport [https://en.wikipedia.org/wiki/British_emergency_passport]\nand can't get home.",
  "data/reddit-know/r/YouShouldKnow/comments/p5osuy/ysk_that_if_youve_attached_your_bank_account_to.json": "Why YSK When you attach your account to these services using Plaid, they store\nyour bank account password and log into your account periodically to download\nyour entire activity. They know how much you make, how much you spend, etc.\n\nWhy now? On August 9th, Plaid settled $58M lawsuit over data…",
  "data/reddit-know/r/YouShouldKnow/comments/p5vkiz/ysk_that_if_youre_using_duolingo_to_learn_a.json": "Why ysk:\n\nThe hearts system on Duolingo is quite silly if you think about it. If you get\njust 3 questions wrong on a language you obviously don’t know yet, you’re locked\nout from learning. You have to wait for hours just to be able to do any more\nlessons. This system kinda sucks if you’re like me…",
  "data/reddit-know/r/YouShouldKnow/comments/p60c5e/ysk_big_trucks_have_to_keep_space_in_front_of.json": "Why YSK: Semi trucks and big box trucks keep their distance in case of\nemergencies that require the truck to slow down. It is NOT a convenient spot for\nyou to move in to because you're in a hurry. I'm a truck driver and this is by\nfar one of the top problems I have when driving. You might be able to…",
  "data/reddit-know/r/YouShouldKnow/comments/p64v6a/ysk_you_should_never_put_used_pizza_boxes_in_for.json": "Why YSK: The grease from the pizza box can ruin a whole batch. It can cause more\nharm than good to try and recycle.\n\nHow bad are greasy pizza boxes for recycling?\n[https://recyclecoach.com/blog/how-bad-are-greasy-pizza-boxes-for-recycling/]",
  "data/reddit-know/r/YouShouldKnow/comments/p69fk1/ysk_parents_should_teach_their_children_to_be.json": "Why YSK: Let kids have their fun, let them be kids, but they should be\nresponsible as well. That responsibility will carry onto teenage and adulthood.\nThey will know how to do different things.\n\nTeach them age appropriate things, don't go overboard. And make sure to give\nthem clear instructions on…",
  "data/reddit-know/r/YouShouldKnow/comments/p6am7t/ysk_that_the_clips_of_afghani_girls_going_to.json": "Why YSK: They're more media savvy than you might expect and readily release such\nfootage as part of a campaign to soften their image. Be careful not to do their\nPR work for them and especially don't fool yourself into thinking there's really\nno cause for Afghanis to climb onto the side of a plane…",
  "data/reddit-know/r/YouShouldKnow/comments/p6fhbl/ysk_higher_education_does_not_always_mean_that.json": "Why YSK: Before deciding on your career, see what jobs get the best prices. The\njob you want, might not be worth the degree.\n\nCommunity College and Trade School are perfectly acceptable ways to get degrees\nas well. Your degree does not have to cost an arm and a leg.\n\nWhile getting a job you love…",
  "data/reddit-know/r/YouShouldKnow/comments/p6gpva/ysk_write_down_your_family_members_and_friends.json": "Why YSK: You can bond better with each other, learning things about different\npeople that you might not have known about previously.\n\nGet recipes from any family member, friend or even potentially co-workers, if\nthey're willing to share. Write them down.",
  "data/reddit-know/r/YouShouldKnow/comments/p6v5n3/ysk_people_will_often_use_different_terms_in.json": "Why YSK: You should know this because (especially in our current day and age)\npeople will intentionally use terminology to heighten or diminish the impact of\nan event. It is good to be mindful of this psychological trick in order to\nremain as objective as possible when analyzing facts and current…",
  "data/reddit-know/r/YouShouldKnow/comments/p6w110/ysk_calling_a_purchase_an_investment_is_a.json": "I read this shitty book in the 90s about how to sell stuff and make money. One\nof the suggested methods to get people to buy your product was calling the price\nan \"investment,\" because then it would seem like a smart decision. So rather\nthan saying \"Spend $50 on this vacuum cleaner and never see…",
  "data/reddit-know/r/YouShouldKnow/comments/p6y0fa/ysk_that_you_can_bypass_news_article_paywalls_for.json": "Why YSK: Tons of websites have \"subscriber only\" articles, and they'll only let\nyou sit on the page for a few seconds before an unavoidable popup appears asking\nyou to pay.\n\nTo bypass this, simply start the URL with \"https://outline . com/\" (no spaces);\nit'll parse the article and load it up with no…",
  "data/reddit-know/r/YouShouldKnow/comments/p6yzsu/ysk_a_person_from_afghanistan_is_called_an_afghan.json": "Why YSK: Lots of post and articles being circulated right now which unbeknownst\nto the author are talking about money with crazy abilities.",
  "data/reddit-know/r/YouShouldKnow/comments/p73diq/ysk_just_because_someone_has_published_a_book.json": "Why YSK: Literally anyone can publish a book about anything. Often times authors\ndespite having the appropriate credentials will publish false information\nspecifically because they know what they're saying will make them money.\nNutrition is a very predatory market, do your research people.\n\nTV and…",
  "data/reddit-know/r/YouShouldKnow/comments/p7hbae/ysk_kink_requires_consent_kink_where_others_can.json": "Why YSK:\n\nI subscribe to a few subs that show trashy videos or crazy videos and there's a\ntrend of videos of people doing pet play, shibari, bondage gear, sub/dom things,\nbig/little things, etc. in obviously public places.\n\nIf there is even one person is sitting at that restaurant or in that public…",
  "data/reddit-know/r/YouShouldKnow/comments/p7hzbp/ysk_if_an_elevator_has_problems_while_your_in_it.json": "Why YSK: yo put it simply, the elevator wants to keep you safe. Elevators\nactually have a large number of safety features, but trying to leave the cab\ncircumvents these. Most of the small number of elevator accidents that happen\nare when people left the cab or were outside the cab. In fact, you are…",
  "data/reddit-know/r/YouShouldKnow/comments/p7pwkc/ysk_if_you_sign_up_for_a_subscription_on_android.json": "When you sign up for a subscription service on an Android device, often times\nyou get the option to pay with Google play.\n\nWhy YSK: When you want to cancel cancel subscription, you can cancel it through\nGoogle play and it won't end the subscription until the day you have to pay\nagain. It allows you…",
  "data/reddit-know/r/YouShouldKnow/comments/p7qhpu/ysk_you_should_use_only_cold_water_for_drinking.json": "Why YSK: Lead is very dangerous to health. One may feel using hot water from the\ntap will save time, but it can cause serious health problems due to lead.\n\nEdit: Applies to USA. Does not matter when home was built, fixtures and\nsoldering can still leech lead, even in homes built today.\n\nBasic…",
  "data/reddit-know/r/YouShouldKnow/comments/p7r0qq/ysk_you_can_use_cheese_slicer_to_apply_cold.json": "Why YSK:Cold butter is pain in the butt to spread evenly on bread,and usually\nthe bread breaks, but slicing butter gets you even slices that you can place\nover the bread, so you dont need to spread the butter,just put the butter slices\n\nSorry english not my first language",
  "data/reddit-know/r/YouShouldKnow/comments/p7vf49/ysk_a_very_small_and_cheap_way_to_help_prevent.json": "While no measure is guaranteed to stop the most determined theifs, this is a\nsimole way to at least help prevent theft and it can be almost free if done in\nsharpie. Why YSK: Many common petty theifs rely on pawn and resale shops. This\nisnt always the case. But these shops are typically VERY…",
  "data/reddit-know/r/YouShouldKnow/comments/p8asux/ysk_grapefruit_juice_or_whole_interacts_with_many.json": "There are more than 85 drugs that interact with grapefruit 1\n[https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3589309/]\n\nHere is an incomplete list of medications that interact with grapefruit2\n[https://www.drugs.com/article/grapefruit-drug-interactions.html] :\n\n * aliskiren (Tekturna) - also apple…",
  "data/reddit-know/r/YouShouldKnow/comments/p8spnp/ysk_if_many_people_give_the_same_advice_its_not.json": "Why YSK:\n\nWhen people give you advice on what not to do, it's likely because they (or\nsomeone they know) made a mistake by not following the advice.\n\nMost advice is obvious. People don't fail to do obvious things because they are\ndumb; they fail because it's hard to do the right decision.\n\nFor…",
  "data/reddit-know/r/YouShouldKnow/comments/p8uu51/ysk_you_can_freeze_fresh_bread_and_reheat_it_in.json": "Why YSK:\n\nWhen you buy fresh bread there is often too much of it, especially if you live\nalone. If you leave the bread at room temperature it will soon go bad (mostly\ntalking about texture and taste).\n\nIf you put it in a freezer, you can take it out after many months, reheat it,\nand have crispy…",
  "data/reddit-know/r/YouShouldKnow/comments/p91w18/ysk_purchases_made_at_dispensaries_will_show_up.json": "Why YSK: I work in the fraud department at a major bank and I get SO MANY calls\ndaily from people reporting fraudulent ATM transactions with random amounts you\nnormally can't withdraw from an ATM. Legally, dispensaries cannot say they are a\ndispensary so transactions made will not show as such. Save…",
  "data/reddit-know/r/YouShouldKnow/comments/p92z4o/ysk_the_reason_why_news_organisations_refuse_to.json": "Why YSK: People seem to get unreasonably angry when the news says someone\n\"forced ___ to have sex with them\" or \"allegedly killed ___ in a traffic\nincident\" or whatnot. This is because using the words \"raped\" or \"murdered\" is\ntantamount to a public accusation. If the accused is later found not…",
  "data/reddit-know/r/YouShouldKnow/comments/p9412f/ysk_antidepressants_can_in_rare_cases_cause.json": "Specifically antidepressants that are SSRI type can cause PSSD, permanent sexual\nside effects (for both men and women). They can also have long-lasting side\neffects, so don't freak out if you have had effects for months after stopping,\nbecause they could still go away. But do see a urologist or…",
  "data/reddit-know/r/YouShouldKnow/comments/p9icx8/ysk_truck_companies_are_always_responsible_for.json": "\"Not responsible for falling objects\" is not a legal disclaimer, it's a\ndishonest way of deterring injured parties from exercising their right to sue.\n\nYou can't unilaterally indemnify yourself for damages to the public; a potential\ndamaged party has to relieve you voluntarily as consideration for…",
  "data/reddit-know/r/YouShouldKnow/comments/p9idd3/ysk_learning_disabilities_do_not_mean_the_same.json": "Why YSK: So that we can learn about the differences in neuro-divergent\nconditions and people can use this to get help that they or someone else they\nmight know needs based on this.\n\nMy sources are as follows: Mild, Moderate, Severe Learning Disability\nDifferences |…",
  "data/reddit-know/r/YouShouldKnow/comments/p9ina3/ysk_you_can_contract_hiv_by_drinking_breast_milk.json": "Why YSK: So recently I saw this post\n[https://www.reddit.com/r/Unexpected/comments/p9cuuc/shes_got_some_milk/?utm_source=share&utm_medium=ios_app&utm_name=iossmf]\nand was horrified that a woman was actually drinking a strangers breast milk.\nMost of the comments were from rightfully disgusted people,…",
  "data/reddit-know/r/YouShouldKnow/comments/p9lx2t/ysk_after_a_bath_especially_if_hot_your_limbs.json": "Why YSK: avoid being caught off-guard can prevent accidents and injuries. You've\nbeen in your tub for a bit too long staring at your phone, and when you finally\ndecide to stand up and get out, your muscles are not used to the greater weight\nof your legs, and you can potentially slip and hurt…",
  "data/reddit-know/r/YouShouldKnow/comments/p9mess/ysk_most_electronics_stores_offer_free.json": "Why ysk: Throwing away used electronics is extremely bad for the environment.\nMost recycling centers charge for accepting electronics. Stores like Microcenter\nand Best Buy will take your broken tech for free. That means things like\nbatteries, computers, screens, cables etc.",
  "data/reddit-know/r/YouShouldKnow/comments/p9nmh5/ysk_if_you_are_in_the_usa_and_you_have_a_child.json": "Why YSK: if you are struggling financially, you might feel like you have no\nhopes to get your child the medical care they need, especially if you are too\npoor to afford insurance but make too much to qualify for Medicaid. The Shriners\nwill help.\n\nI recently posted a photo of my child and his…",
  "data/reddit-know/r/YouShouldKnow/comments/pa10c5/ysk_between_a_coffee_or_a_nap_its_actually_best.json": "Why YSK: What's responsible for making you feel tired or exhausted is a molecule\nin your brain known as adenosine, a byproduct of brain activity. When it bonds\nto your brain receptors, it slows down the communication between neurons. Sleep\nis the body and brain's way of recharging and cleaning out…",
  "data/reddit-know/r/YouShouldKnow/comments/pa5d01/ysk_that_wisdom_teeth_removals_are_often_not.json": "Why YSK:\n\nIt's very common for people aged 16 to 19 years old to get their wisdom teeth\nremoved according to their dentist's recommendation, but often, this possibly\nrisky procedure isn't actually required at all.\n\nDentistry, especially in the US and Canada, is a huge money-making…",
  "data/reddit-know/r/YouShouldKnow/comments/paa0vv/ysk_that_dryer_lint_is_extremely_flammable.json": "Why YSK:\n\nI regularly use plain dryer lint as a fire starter to catch sparks from my flint\nand steel while camping. Its one of the only things fine, fluffy, and flammable\nenough to reliably ignite from a simple spark, without needing an actual flame.\n\nClean your lint screen after every load. Clean…",
  "data/reddit-know/r/YouShouldKnow/comments/pae7zk/ysk_a_simple_fan_is_one_of_the_most_effective.json": "Why YSK: Mosquitos are very irritating and people try all kinds of tricks to\nkeep them away. This one actually works.\n\nJust place a fan or two nearby outside and the mosquitos will mostly stay away\nas they can't fight the wind generated from the fan. It works really…",
  "data/reddit-know/r/YouShouldKnow/comments/pamiah/ysk_that_you_can_get_pregnant_while_breastfeeding.json": "Why YSK: While a woman's menstrual cycle is more likely to return when the kid\nis being weaned, it's still possible to get knocked up while giving milk au'\nnaturel to your child.\n\nLike stated here [https://www.llli.org/breastfeeding-info/fertility/],\nBreastfeeding (especially exclusively) can be a…",
  "data/reddit-know/r/YouShouldKnow/comments/pap2mj/ysk_if_you_are_walking_your_dog_with_tension_in.json": "Why YSK: A leash is a communication device as means to signal a certain movement\nto the dog.\n\nTension on the line should only be used if you need to communicate a cue /\naction to your dog (e.g., come closer, turn left, sit, down). Once the signal\nthrough the leash is made it should be turned of…",
  "data/reddit-know/r/YouShouldKnow/comments/pax8u3/ysk_that_derma_fillers_are_a_lot_more_permanent.json": "Why YSK\n\nFacial fillers, or derma fillers, have become immensely popular in the past\nyears with people as young as teenagers getting the procedures done, sometimes\nwith dire consequences.\n\nProfessionals lure in clients with the promise that the procedures are\ntemporary, meaning that whatever you…",
  "data/reddit-know/r/YouShouldKnow/comments/pbar45/ysk_std_tests_for_men_only_require_peeing_in_a_cup.json": "Why YSK most people don't realize that std tests for males no longer require a\ncutip to be pushed into the urethra. This stigma scares away a lot of men from\ngetting tested but it is no longer the norm. So if you're worried you may have\nan std don't hesitate to go get tested!",
  "data/reddit-know/r/YouShouldKnow/comments/pbg2z0/ysk_that_immunity_to_poison_ivy_is_a_myth.json": "Why YSK: To avoid any potentially unpleasant experiences and hopefully prevent\nany unintentional harm coming to yourself or others.\n\nInspired by a post I saw in r/IsItBullshit\n[https://www.reddit.com/r/IsItBullshit/] that I commented on and decided it is\nworth signal boosting because its surprising…",
  "data/reddit-know/r/YouShouldKnow/comments/pbgj8t/ysk_the_necessity_of_using_hand_sanitizer_at.json": "Why YSK: By the amount of men (and boys) I see coming out of bathroom urinals\nand stalls and not stopping to wash their hands, means we're all touching their\njunk (or worse) as they handle products, touch carts and counters, etc. Any\nmales notice the same lack of hygiene? - and yes, it's everywhere …",
  "data/reddit-know/r/YouShouldKnow/comments/pbk82b/ysk_stores_like_walmart_will_put_items_on.json": "Why YSK: Many people don't realize when going into the clearance section of a\nstore like Walmart, they add a yellow sticker that doesn't mention a previous\nprice. This is often to make a person believe the price is reduced but in fact\nthey just want to sell them faster without reducing first.",
  "data/reddit-know/r/YouShouldKnow/comments/pbmlih/ysk_openstreetmap_is_a_free_and_open_alternative.json": "Like Google Maps and Wikipedia, people have to edit points of interests. As more\npeople use it, the data becomes more accurate.\n\nUnlike proprietary products, the data is free to use by anyone. The only caveat\nis that there's no official mobile app (I personally use Organic Maps).\n\nWhy YSK: With more…",
  "data/reddit-know/r/YouShouldKnow/comments/pbqha8/ysk_if_you_want_to_know_whats_going_on_in_a_large.json": "Why YSK: Company communication is notorious to be shaped by marketing and public\nimage concerns. Not only actual advertising, but even shareholder letters can\npaint a rosy picture to encourage investment or act as informal promotional\nmaterial, over-emphasizing things that went well and burying…",
  "data/reddit-know/r/YouShouldKnow/comments/pcbrvp/ysk_how_to_quickly_and_easily_evaluate_whether_a.json": "Why YSK: I've seen informative (edit: country/world population) studies\ninvolving over 100 or even 1000 participants dismissed with the unbacked claim\nthat the sample size is too small to be representative of the population.\n\nLet us suppose we are discussing a peer-reviewed study claiming 79% of the…",
  "data/reddit-know/r/YouShouldKnow/comments/pch6h6/ysk_trolls_try_to_legitimize_their_reddit_accts.json": "Why YSK: Trolling is a form of propaganda used to confuse and cut off civil\ndiscussion so that no consensus is achieved (the natural desire of human\nbeings).\n\nHere is a…",
  "data/reddit-know/r/YouShouldKnow/comments/pcif8l/ysk_how_to_make_housekeepers_jobs_easier.json": "I'm a housekeeper. And a fair amount of times (not as much as I'd feared, thank\ngod) people do things that just make our job difficult or even dangerous,\nwhether they mean to or not. I know it's a job that's kind of forgotten about\nand people don't think about helping us out but we'd all greatly…",
  "data/reddit-know/r/YouShouldKnow/comments/pcvmec/ysk_you_can_recycle_propane_tanks_at_places_that.json": "Why YSK: Every store employee, if you ask them, will say \"we only take\nexchanges.\"\n\nIt took me 1 hour today to recycle a Blue Rhino propane tank that was left by\nthe previous owner of the house. First place, despite being listed on the Blue\nRhino website as a place that takes recycling, said \"we…",
  "data/reddit-know/r/YouShouldKnow/comments/pcyc48/ysk_if_youre_online_shopping_from_a_big_store_and.json": "Why YSK: A LOT of stores will put a coupon in your package (for upwards of 25%\noff your next purchase) when you buy one thing from their store. This ensures\nyou shop there again.\n\nIf you were already planning on spending a lot of money there this initial\ncoupon could really soften the blow on your…",
  "data/reddit-know/r/YouShouldKnow/comments/pd6lrg/ysk_if_you_have_raisedhandreared_your_cat_or_dog.json": "In April of 2020, I discovered a week- old kitten crying alone in my storm\ndrain, in the middle of a heavy downpour. She was in about 2 inches of\nrainwater, and I refused to leave her to drown. I bottlefed her and stimulated\npotty breaks, taught her to bathe herself and use the litter box - how to…",
  "data/reddit-know/r/YouShouldKnow/comments/pd7zth/ysk_that_a_vitamin_d_deficiency_can_make_you_feel.json": "Why YSK: Well I found out that I had a vitamin d deficiency(most likely because\nI’ve been indoors all the time) and a few days after taking my vitamin d\nsupplements, I just felt much more happier, less empty compared to before and\nI’m sure I’m not the only one with this…",
  "data/reddit-know/r/YouShouldKnow/comments/pd8w29/ysk_grapes_raisins_onions_and_garlic_are_all_very.json": "Why YSK: Your animal can die if you feed them the wrong thing.\n\nMy friend fed his dog grapes and since I knew grapes were toxic, I freaked out\nand called the vet and they said feed him some hydrogen peroxide to get him to\nvomit. Luckily this happened immediately after he fed them, but could have…",
  "data/reddit-know/r/YouShouldKnow/comments/pd9o4g/ysk_that_if_you_smoke_weed_regularly_and_are_no.json": "Why YSK:\n\nWeed use (specifically delta 9-thc) can reduce REM sleep. (Source 1\n[https://academic.oup.com/sleep/article/43/Supplement_1/A62/5846891], Source 2\n[https://ascpt.onlinelibrary.wiley.com/doi/abs/10.1002/cpt1976196782]) if you\nare still having vivid dreams every day, then congratulations,…",
  "data/reddit-know/r/YouShouldKnow/comments/pdat0g/ysk_if_someone_is_left_unresponsive_due_to_a.json": "Why YSK: I'm sure this is fairly common knowledge, it's just that I have seen\none too many videos here on reddit of some poor fella getting his lights flicked\noff and being left stiff as a post, only to have side chick #3 or whatever run\nup and start shaking the unconscious person and screaming…",
  "data/reddit-know/r/YouShouldKnow/comments/pdev6d/ysk_want_to_check_your_windows_laptop_battery.json": " 1. Click the start button and start typing Powershell. When it comes up, right\n    click it and choose to run as administrator.\n\n 2. When the prompt opens up, paste the below command and hit enter:\n    \n    > powercfg /batteryreport /output “C:\\battery-report.html”\n\n 3. Go to your C drive folder…",
  "data/reddit-know/r/YouShouldKnow/comments/pdfszo/ysk_reddits_dark_theme_can_go_darker.json": "I just went into settings and found out you can change the dark theme to a\ndarker black called, “midnight”.\n\nWhy YSK: The contrast is amazing",
  "data/reddit-know/r/YouShouldKnow/comments/pdh45l/ysk_boom_barriers_at_railway_crossings_and.json": "Why YSK: I saw a post earlier where someone got stuck in between the barriers at\na railway crossing, and they let their car get hit. This is tragic, because if\nthey'd only known a little about the design of these barriers they would have\nbeen okay.\n\nThe arms are designed to be driven through.…",
  "data/reddit-know/r/YouShouldKnow/comments/pdm585/ysk_there_are_free_college_courses_you_can_take.json": "Why YSK: During this time a lot of people might have more downtime or they want\nto continue there education but that usually cost a lot of money. While you\ncould use YouTube to look up specific topics, it can be nice to have a\nstructured course. The classes I am specifically talking about is this…",
  "data/reddit-know/r/YouShouldKnow/comments/pdncay/ysk_gentlemen_if_you_have_ache_or_pain_in_your.json": "Why YSK... I had a slight ache in my right testicle for over a year before I\nwent to my doctor. I didn't go to the doctor because if I heard the \"C\" word, I\nwas unprepared and if I didn't hear it out loud, it wasn't real (sounds silly, I\nknow)\n\nEventually, about 2 months ago, after it being on my…",
  "data/reddit-know/r/YouShouldKnow/comments/pe10dx/ysk_your_antibacterial_hand_soap_is_making_the.json": "Why YSK\n\nWhy you should know: Antibacterial hand soaps are not only unnecessary (soap and\nwater works well enough) but they’re actively contributing to antibiotic\nresistant bacteria and actually making water purification at the municipal level\nmuch harder.",
  "data/reddit-know/r/YouShouldKnow/comments/pe5gkz/ysk_that_costco_doesnt_charge_extra_to_install.json": "Why YSK: I just bought a new dishwasher from Costco after I learned that\ninstallation and haul away services were included in the price. On top of that,\nthe dishwasher I got was almost $250 cheaper at Costco than Home Depot for the\nsame model (YMMV given it was a Labor Day sale in the USA). The…",
  "data/reddit-know/r/YouShouldKnow/comments/pegzfr/ysk_that_bri_bob_ross_inc_stole_the_bob_ross_name.json": "Why YSK\n\nThe new Netflix special tells how the Kowalski family stole everything 'Ross'\nfrom his own son. The company only uses the Bob Ross name to make money.\n\nEdit: I should also say, that the special notes that BRI has forged the Ross\nsignature on paintings. They also sued, and had all of Bob's…",
  "data/reddit-know/r/YouShouldKnow/comments/peh1ok/ysk_that_getting_lemon_or_lime_juice_on_your_skin.json": "Why YSK: These burns, also called \"margarita burns\", mostly affect those with\nfair skin, and people sensitive to the sun - especially those in food service.\nYou can get burned by more than just lemons and limes (though they seem to be\nthe most common culprits). Phytophotodermatitis is also caused by…",
  "data/reddit-know/r/YouShouldKnow/comments/pei7rt/ysk_if_you_dont_believe_in_commonly_accepted.json": "Why YSK: If you don’t trust any of the doctors, then you might as well go home\nand do whatever treatments you think are best at home and open a hospital bed up\nfor someone else. If you believe the hospital is letting you or your loved one\ndie, then why waste your time and rack up medical bills…",
  "data/reddit-know/r/YouShouldKnow/comments/pejczv/ysk_spaying_fixing_a_female_dogcat_before_going.json": "Why YSK: My dog has Cancer in her Mammary Glands due to hormones from not\nSpaying her- when she was young. Spaying her could have prevented her from\ngetting cancer. No one wants to lose their pets or have them in pain. Fixing\nyour dog/cat has way more benefits than negative consequences. If I would…",
  "data/reddit-know/r/YouShouldKnow/comments/pemaqd/ysk_that_the_tik_tok_oh_no_oh_no_oh_no_no_no_no.json": "Why YSK: A lot of the people are sick of this Tik Tok remix and listening to the\noriginal song will make them feel better!\n\nAerosmith: Remember Walking in the sand [https://youtu.be/POLYGEfhQBc]\n\nEdit: From the comments even Aerosmith’s is a cover for the song with the same\ntitle by Shangri…",
  "data/reddit-know/r/YouShouldKnow/comments/peroe7/ysk_if_you_use_multistream_recycling_do_not_crush.json": "Why YSK: Unlike plastic, Aluminum is infinitely recyclable, but it can't be\nrecycled if it ends up in a landfill.\n\nIn Single-Stream recycling, where you have 1 curbside recycling bin, crushed\naluminum is more difficult to be properly sorted by the automated sorting\nmachines and can end up in the…",
  "data/reddit-know/r/YouShouldKnow/comments/pf3m48/ysk_your_early_attachment_style_can_significantly.json": "Why YSK: Because it can help shed light on some possible reasons why you feel,\nthink or behave in a particular way. An explanation like this can be quite\npowerful in that it can make you aware of the circumstances that shape who you\nbecome, especially if you’re the kind of person who thinks their…",
  "data/reddit-know/r/YouShouldKnow/comments/pf9gns/ysk_that_us_hospitals_were_required_to_comply.json": "> Report a hospital for non-compliance here\n> [https://cms.gov1.qualtrics.com/jfe/form/SV_b2fAQwrDLIC7Iyx]\n\nWhy YSK: PatientRightsAdvocate.org estimates that less than 6% of hospitals…"
}