{
  "data/reddit-crypto/r/CryptoCurrency/comments/wd8vuj/i_find_it_hilarious_that_the_most_optimistic.json": "I find it hilarious whenever I see someone say to sell and how its a sure sell\nbuy at 10k or buy at 15k, and everytime I look at their history, they got\nwrecked during the bullrun.\n\nThe article where a lot of low income individuals sold at a loss during the drop\nis really indicative in this sub…",
  "data/reddit-crypto/r/CryptoCurrency/comments/wd7lpi/eth_is_up_60_in_a_month.json": "I'd like to ask the opinion of the ETH holders in this sub, do you think this\nbull trap will persist ? I'm about breaking even and want to know if I should\ntransfer over to BTC which hasn't seen the same level of explosive growth this\npast month. Both are the only two I hold and am wondering if…",
  "data/reddit-crypto/r/CryptoCurrency/comments/wdud7n/do_not_click_on_the_coinbase_email_to_confirm.json": "I don't care who thinks this is a stupid post. I just got a scam email so I am\nsure others here did too from what looks like Coinbase. First of all,\n\"Confirmation billing account has been update\" is not a sentence. The word is\n\"updated\". The body of the email contains similar grammatical errors.…",
  "data/reddit-crypto/r/CryptoCurrency/comments/wduowx/my_6_year_crypto_journey_to_becoming_a_day_trader.json": "Obligatory this is not financial advice – read on at your own risk and make sure\nyou are comfortable with your own trades. The old age saying of only put money\ninto Crypto that you are prepared to lose is extremely valuable. This post will\naim to give you a bit of an insight into how I became…",
  "data/reddit-crypto/r/CryptoCurrency/comments/we5446/the_first_truly_decentralized_robbery_was_just.json": "At this point I am sure many of you have heard of the nomad bridge exploit.\nUnlike previous exploits, this wasnt a flashloan or even carried out by a single\ngroup of attackers. After an initial attacker struck, hundreds of separate\naccounts figured out the trick and copy pasted their way into…",
  "data/reddit-crypto/r/Bitcoin/comments/wee3hx/has_anyone_cashed_out_a_large_amount_to_their.json": "I mean from exchanges such as Coinbase, kraken or crypto.com start to their\nbanks",
  "data/reddit-crypto/r/CryptoCurrency/comments/wehf00/this_is_how_much_you_need_to_invest_during_the.json": "Been seeing a few popular post and comment asking how much you would need to\ninvest in to get 1 million dollars USD if the coin ever reaches ATH again. Here\nI calculated how much you would need to invest into a coin to net 1 million.\n\nIts just for fun and don't take it too seriously since each coin…",
  "data/reddit-crypto/r/CryptoCurrency/comments/wf4io8/vitalik_sounded_the_alarm_on_cross_chain_bridges.json": "Seems cross chain bridges have serious problems with security.\n\nBack in January 7th 2022 Vitalik posted this warning:\nhttps://nitter.net/i/status/1479501366192132099\n\nMy argument for why the future will be multi-chain, but it will not be\ncross-chain: there are fundamental limits to the security of…",
  "data/reddit-crypto/r/CryptoCurrency/comments/wfds7v/i_collected_and_curated_the_top_50_antinft.json": "They say to build something during the bear market, so I did!\n\nI wanted to make something funny to entertain my fellow crypto enthusiasts while\nthe skeptics and haters are taking victory laps about our supposed collapse.\nSomething to document the sheer hatred generated by this new tech we're…"
}