{
  "data/reddit-crypto/r/CryptoCurrency/comments/shh81u/i_see_it_now_most_of_us_are_neither_investors_nor.json": "I had a post last day advising people to be either a trader or an investor and\ngod did it get some crazy reactions! Half of you said we are both. Another half\nwere pissed (don't tell us what to do!). Out of five hundred comments and more ,\nonly a handful understood what I was actually saying.\n\nLet…",
  "data/reddit-crypto/r/CryptoCurrency/comments/shiy2o/is_ethereum_still_worth_the_investment_a_deeper.json": "ETHEREUM\n\n2021 was a fantastic year for crypto, in particular Ethereum. Ethereum reigns as\nthe second-largest blockchain despite the slew of competition from Binance SC,\nSolana, Avalanche. But it remains far ahead showcased by various metrics, and\nthere are no signs of slowing down.\n\nTOTAL…",
  "data/reddit-crypto/r/CryptoCurrency/comments/shomjg/indian_government_announces_it_will_bring_crypto.json": "Indian government just announced that crypto will be taxed at 30% of gains. This\nis the first time the Indian government is discussing crypto taxation. The tax\nwill apply to all gains on digital virtual assets, and no capital losses will be\nallowed. Business expenses will also not be…",
  "data/reddit-crypto/r/CryptoCurrency/comments/shgmmb/bored_apes_have_reached_a_floor_price_well_above.json": "Honestly, I wonder who could have seen it coming. People are spending thousands\nof dollars on Monkey jpegs, and get rewarded for this moronic behavior with\nbetter return rates than almost any other asset can provide. Maybe it's a sign\nthat instead of investing in utility and smart concepts, people…",
  "data/reddit-crypto/r/CryptoCurrency/comments/shq9na/ill_admit_it_i_didnt_trust_you_guys_about.json": "Last few days, I've been playing around on Algorand experimenting with a lot of\nstuff. AND I LOVE IT. Silvio Micali really knows his stuff. This network is an\nabsolute rocket and costs nothing.\n\nAmong other things I also tried the \"famous\" NFT on Algorand. What a crazy\nthing. It costs close to…",
  "data/reddit-crypto/r/CryptoCurrency/comments/shqevq/creators_of_nft_project_doodled_dragons_promised.json": "A Solsea-verified NFT project on the Solana Blockchain, Doodled Dragons\nannounced that they would distribute all profits \"straight to charities\nprotecting animals on the brink of extinction\".\n\nThey announced on Twitter that they would be donating $30k, \"our first donation\nto the World Wildlife…",
  "data/reddit-crypto/r/Bitcoin/comments/shnu7k/economics_professor_asked_whats_the_point_of.json": "Today at my university class, the professor asked “whats the point of bitcoin?”\nThe room was somewhat silent, then some responses about it being purely for\nspeculation pop corned around the room. I sat in silence while he proceeded to\nslander btc and state multiple points of false information, such…",
  "data/reddit-crypto/r/CryptoCurrency/comments/shw6sa/you_guys_understand_that_el_salvador_wants_13.json": "Two posts are on the front page right now: \"El Salvador angrily rejects IMF call\nto drop Bitcoin use\"\n[https://np.reddit.com/r/CryptoCurrency/comments/she2t3/el_salvador_angrily_rejects_imf_call_to_drop/]\nand El Salvador Treasury Minister Alejandro Zelaya angrily rejects IMF demand to\ndrop Bitcoin…",
  "data/reddit-crypto/r/Bitcoin/comments/shrxge/criticizing_bitcoin_for_its_high_energy_use_is.json": "Bitcoin is energy. Its high energy use is an investment. Bitcoin miners securing\na huge network is a good thing.",
  "data/reddit-crypto/r/CryptoCurrency/comments/si1abt/you_dont_need_to_convince_nor_argue_with_anyone.json": "I’ve seen a lot of opinions thrown out here, whether you should or shouldn’t\ntell your family, friends, neighbours about crypto.\n\nThe general consensus of this subreddit is always: “DCA and HODL!” Yes, the past\nalready proved that it’s one of the best if not the best strategy out there. But\ndo we…",
  "data/reddit-crypto/r/CryptoCurrency/comments/si3m4a/why_you_should_make_xmr_part_of_your_portfolio.json": "I’m sure that a lot of you have heard about Monero (XMR) and that it is\nPrivate/Untraceable [https://imgur.com/a/Skb5L4q] and most commonly used in\n“boating accidents” but there’s more to XMR then just that and it’s potential\nuse cases are solid\n\nA lot of people seem to have this understanding that…",
  "data/reddit-crypto/r/CryptoCurrency/comments/si4p19/it_will_never_sit_right_with_me_this_double_tax.json": "9-5 people, perhaps not living paycheck to paycheck, but someone who's not more\nthan half a year of unemployment away from having their life turned on its head\n- These people are not going to get much better off by working, nor by saving\nmoney in the bank. They don't have wealthy relatives so…",
  "data/reddit-crypto/r/Bitcoin/comments/shy3vj/how_many_of_you_actually_hold_only_bitcoin.json": "I understand this is a bitcoin sub, but there is no way you ONLY hold Bitcoin\nright?",
  "data/reddit-crypto/r/CryptoCurrency/comments/sib6ur/the_concept_of_nfts_is_valuable_but_a_jpeg_is_not.json": "In fact, I don’t think these JPEGs should be valued for more than 5 digits. And\nmost of the time its not the market that’s setting these prices. They’re usually\ninorganically inflated.\n\nThis is exactly why NFT like Bored Apes are so hated. I think the only valuable\nthing about Bored Apes is the…",
  "data/reddit-crypto/r/CryptoCurrency/comments/si8krl/an_addiction_will_ruin_your_crypto_trading.json": "I wanted to raise awareness on this, because I think there isn't much\ninformation out there on this topic (at least it hasn't come across me).\n\nThe thing is, when it comes to addictions, the vast majority of them trigger\ndopamine, when you do that particular activity. That's the main reason why…",
  "data/reddit-crypto/r/CryptoCurrency/comments/siicsk/teach_a_man_how_to_stake_and_he_shall_enjoy.json": "There are a lot of people who buy and only HODL your coins and tokens. This post\nis for those of you that do.\n\nWhat is staking?\n\nStaking is a mechanic where you lock up your cryptos and generate passive income\nas you are helping to secure the blockchain through said mechanic. So you don't\nhave to…",
  "data/reddit-crypto/r/CryptoCurrency/comments/sipu9k/popular_rapper_gunna_shilled_a_shitcoin_pushingp.json": "Here's the deleted tweet where he's supporting the coin.\n\nGunna's Tweet.\n[https://preview.redd.it/w7el1hargff81.jpg?width=1283&format=pjpg&auto=webp&s=e5ec1a86f4cea052f178f54d12773f9b9938e1ed]\n\nAfter shilling this shitcoin he tweeted again with \"I wunna C Everybody Win\"\nwhich is kinda ironic since…",
  "data/reddit-crypto/r/CryptoCurrency/comments/siv00k/update_to_my_country_announcing_3_years_jail_for.json": "Original\npost:https://np.reddit.com/r/CryptoCurrency/comments/sanct2/my_government_announced_1_year_jail_time_for/?utm_source=share&amp;utm_medium=ios_app&amp;utm_name=iossmf\n\nI contacted many Embassies and they didn't approve when I applied for political\nasylum.I have been staying off this Reddit…",
  "data/reddit-crypto/r/CryptoCurrency/comments/siyhjx/every_country_in_the_world_is_in_debt_the_global.json": "Every country in the world is in debt, some much more than others\n\nThe US national debt is $30 Trillion, China $7 Trillion, Russia $0.5 Trillion,\nIndia $2.3 Trillion\n\nSome smaller countries have staggering debt levels, for example Japan has debt\nof 235% it's GDP.\n\nI think most of this the debt is…",
  "data/reddit-crypto/r/CryptoCurrency/comments/sivx1j/so_wtf_happened_to_loopring_its_almost_80_down.json": "2-3 months ago it went 0.5$ to 3.7$,everyone were saying it will reach 10$ by\nEOY. Now it's around 0.70-0.90$,almost 80% down from ATH. I know most of alts\nalso crashed but not that much. Is hype finished? Did devs rugpulled? Did they\noverhyped and not deliver? I don't get it..\n\nI know LRC devs…",
  "data/reddit-crypto/r/CryptoCurrency/comments/sj0nb0/moons_are_definetly_a_sitcoin_no_utility_no.json": "This sub is very anti-shitcoin and sure why shouldn't it be, people are thinking\nsome just made shitcoins are a better investment than some utility crypto. Over\nthe longterm the utility always wins and hype leaves.\n\nBut thus subs own crypto MOONS are also, definitely, a shitcoin. It's far away\nfrom…",
  "data/reddit-crypto/r/CryptoCurrency/comments/sj013u/the_whales_arent_selling_smaller_investors_are.json": "A lot of people left the Crypto market in fear of a Crypto winter. However, the\npeople who did not leave are the ones who went through at least 2 Bitcoin bull\ncycles and the whales. A 45% steady price decrease is nothing but an\naccumulation strategy, and we can see this across the board with…",
  "data/reddit-crypto/r/CryptoCurrency/comments/sj59mf/the_irs_may_not_tax_crypto_earned_through_staking.json": "In May of last year Josh and Jessica Jarrett requested a refund of income tax\nthey paid on Tezos staking rewards in 2019. (Around $3200 for approximately 8800\nTezos tokens)\n\nToday, the IRS has decided to issue that refund.\n\nThey will not refund any amount that was sold obviously but the couple…",
  "data/reddit-crypto/r/Bitcoin/comments/sixbuk/i_did_my_first_serious_bitcoin_purchase_today.json": "I’m sure no one cares but Im happy about it.",
  "data/reddit-crypto/r/CryptoCurrency/comments/sj16yr/which_coin_gave_you_completely_lost_faith_in.json": "After a few false starts, I’ve condensed my portfolio into coins I fully believe\nin. Time will tell if they are good choices are not, but for now I’m confident.\n\nThe biggest cut i’ve made is Solana, thankfully before the January crash kicked\nin. I didn’t make any money, but I didn’t lose any…",
  "data/reddit-crypto/r/CryptoCurrency/comments/sjfad1/solana_is_the_mcdonalds_ice_cream_machine_of_the.json": "I tried to give this chain the benefit of the doubt multiple times yet it always\nseems to fail my expectations.\n\nEither it’s down cause its out of RAM, got attacked by a DDOS and now it got\nhacked. There’s always something wrong with this chain.\n\nHonestly I feel like it’s one of the most overhyped…",
  "data/reddit-crypto/r/CryptoCurrency/comments/sjgkhx/crypto_isnt_going_to_magically_make_you_rich_get.json": "This is probably a massively unpopular option.\n\nI see a lot of people on this sub saying that crypto is their path to financial\nfreedom, early retirement and a lambo. Many of these people boast a portfolio of\nup to 100% in crypto.\n\nIf you don’t have much invested to begin with, let’s say $10,000 or…",
  "data/reddit-crypto/r/CryptoCurrency/comments/sjk2i0/i_recently_acquired_80000_eth_for_a_very_very.json": "Yesterday, I was doing some good old arbitrage trading between Solana and\nEthereum, and I managed to get my hands on 80,000 ETH for a really low price -\nso low, in fact, that you wouldn't believe me if I told you how I pulled off\nthis deal.\n\nNow I don't know what to do with all this ETH. It's worth…",
  "data/reddit-crypto/r/CryptoCurrency/comments/sjfwrz/btc_mining_contributes_to_a_staggering_008_of.json": "According to digital investing firm CoinShares, BTC miners contribute to 0.08%\nof the world's Total carbon dioxide (CO2) emissions.\n\nAlthough 0.08% might seems small, we are talking about the Total CO2 emmisions\nworldwide... this is not little at all. Especially not now we are dealing with a\nharsh…",
  "data/reddit-crypto/r/CryptoCurrency/comments/sjerjo/crypto_companies_publishing_research_reports.json": "Today (maybe a few days ago? I saw it posted today), a company called\n\"CoinShares\" published a report\n[https://coinshares.com/research/bitcoin-mining-network-2022] that tries really\nhard to push the narrative that BTC is totally not bad for the environment and\nthat all of that is FUD.\n\nWho is…",
  "data/reddit-crypto/r/CryptoCurrency/comments/sjn58u/why_facebook_should_not_be_allowed_to.json": "In yesterday's Facebook earnings report of 2021 Q4, this is what they disclosed\nabout future earning projections.\n\nWe expect first quarter 2022 total revenue to be in the range of $27-29 billion,\nwhich represents 3-11% year-over-year growth. We expect our year-over-year\ngrowth in the first quarter…",
  "data/reddit-crypto/r/CryptoCurrency/comments/sjul4i/bitcoin_is_the_broccoli_of_this_sub.json": "You know Broccoli won't hurt you. On the contrary, it would be very very healthy\nto eat broccoli more often.\n\nInstead, you keep reaching for one of the thousands of sweets that seem so\ndelicious. They have such interesting names and the packaging says all sorts of\ngreat things. When you're out…",
  "data/reddit-crypto/r/CryptoCurrency/comments/sjxf29/how_can_i_acquire_moons_as_a_lurker.json": "I like the idea of moons although there seems to be absolutely no use for them\noutside of getting special features in this sub? I also don't have much to\ncontribute to the CC sub. I enjoy reading the discussions and seeing the\npanic/anger that ensues with the market fluctuations, but besides…",
  "data/reddit-crypto/r/CryptoCurrency/comments/sk0fix/since_facebookmeta_lost_237_billion_in_market.json": "Meta also said the augmented and virtual reality business at the heart of its\nmetaverse plans is generating revenue but is unprofitable. \n\nI would expect a price drop in the three following cryptos as they are\nassociated with the meta verse.\n\n-Mana -Sand -AXS\n\nI'm calling it right now, the…",
  "data/reddit-crypto/r/CryptoCurrency/comments/sk2rg0/the_320m_wormhole_hack_was_replenished_by_jump.json": "Yesterday, the Wormhole bridge one of Solana's biggest bridges lost $320m in a\nhack. Within hours, a trading desk Jump Capital agreed to replenish the entire\namount so that the liquidations calamity is avoided. The loss of the peg due to\nthe hack could have sent the network into cascading…",
  "data/reddit-crypto/r/CryptoCurrency/comments/sjwzgk/why_do_people_invest_in_sol_when_cryptocurrencies.json": "It's common knowledge here that the SOL network goes down frequently, gets\nhacked, doesn't work etc yet people still continue to invest in it. Christ if\ntraditional banking was this flakey the government would haul it over the coals\nand watch it burn.\n\nYet people still invest in this centralized…",
  "data/reddit-crypto/r/CryptoCurrency/comments/skabfn/there_is_nothing_wrong_with_paying_taxes_on_your.json": "I see it too often here that people aren't so happy with paying capital gains\ntaxes on their crypto, which is worrying because at the end of the day we want\neveryone to benefit from major crypto adoption, even those who aren't able to\ndirectly benefit hence why taxes are important.\n\nThe benefits of…",
  "data/reddit-crypto/r/CryptoCurrency/comments/skh83b/it_doesnt_matter_if_you_agree_with_your.json": "Tax Fraud is serious\n\nFirst of all no government is perfect there will always be some degree of\ncorruption and wasteful spending. As for actually agreeing with how your\ngovernment spends money, most people don’t, that’s why there are differing\npolitical parties.\n\nLive in a third world dictatorship…",
  "data/reddit-crypto/r/CryptoCurrency/comments/skhyo2/hats_off_to_kraken_who_now_let_users_verify_that.json": "While I'm not the biggest fan of centralized exchanges, I think it's still the\nbest way for noobs to learn about crypto. In this sense, the trust relationship\nbetween holders and CEXs is crucial: when you buy BTC or ETH, you want the\nexchange to actually own these tokens.\n\nThat's why I was very…",
  "data/reddit-crypto/r/CryptoCurrency/comments/sknd3a/40k_has_been_breached_repeat_40k_has_been.json": "We all know that there's such a thing as a bear market, but where is it? I don't\nsee it, that's because it's a myth from the days of old and we're men of science\nand reason now. You see, we're in a new age in the crypto world, it's called the\nbull summer, basically get your umbrella drinks out…",
  "data/reddit-crypto/r/CryptoCurrency/comments/skjq3a/over_100_million_shorts_liquidated_over_the_last.json": "According to data from Coinglass [https://www.coinglass.com/LiquidationData] 88%\nof the total liquidated positions during the last four hours were shorts. This\nfigure may change quite a bit as it was 85% when I started writing this post and\nnow it's at 88%. The 122 million figure may change as well…",
  "data/reddit-crypto/r/CryptoCurrency/comments/skm0fa/a_crypto_short_squeeze_might_be_happening_right.json": "Bitcoin seems to have shot past its $40k barrier in a matter of hours, and it is\nlikely to continue considering how many people are shorting the market right\nnow. Crypto hasn't yet lost its steam and it was dragged down by the stock\nmarket for the past few days. This has accumulated A LOT of…",
  "data/reddit-crypto/r/CryptoCurrency/comments/skm2km/you_know_the_markets_pumping_when_the_exchanges.json": "Title says it all, tried to look at my portfolio on Coinbase just now and what a\nsurprise:\n\n\nINVESTIGATING LATENCY\n\n\nWE'RE INVESTIGATING LATENCY ON COINBASE.COM AND THE MOBILE APP AND DIFFICULTY\nWITH TRADES / PAYMENTS. OUR TEAMS ARE WORKING TO RESTORE FULL SERVICE ASAP.\n\nInteresting that the…",
  "data/reddit-crypto/r/CryptoCurrency/comments/skikem/this_pump_feels_weird_to_me.json": "Bitcoin had a pretty big pump today and the chart looks pretty good lately.\nMaybe I have PTSD from all the failed rallies lately, but it's giving me a weird\nfeeling.\n\nGetting back above 40K, with an RSI above 50 is a good sign, whales have been\nbuying according to Will Clemente's on chain…",
  "data/reddit-crypto/r/Bitcoin/comments/skhyo5/does_anyone_know_the_cause_of_todays_7_pump.json": "It went from 37 to 39 in a few minutes. Any known reason? Big news or some short\nsqueeze?",
  "data/reddit-crypto/r/CryptoCurrency/comments/skxpr7/blockfi_horrible_loan_experience_fortune_lost.json": "Took out a loan for $300K and put up 600K worth of BTC as collateral. Market\nkept going down so I kept posting collateral as needed to keep the loan healthy.\n\n\n\nI got an email saying that the loan was being called back because of \"indirect\nexposure to a mixing service\"\n\n\n\nI appealed the decision…",
  "data/reddit-crypto/r/CryptoCurrency/comments/sl2kun/its_incredible_how_quickly_a_few_green_candles.json": "I don't want to come off as a killjoy; I'm as hyped as anyone here. But it was\nonly a few days ago when everyone thought we were in the middle of a bear\nmarket, a few green candles later and it's posts calling for altseason and short\nsqueezes. It's insane what one day of green does to people. Pumps…",
  "data/reddit-crypto/r/CryptoCurrency/comments/sl3h00/why_i_believe_we_are_all_still_a_decade_early_to.json": "This post is a serious one I made after reading this article. [\nhttps://moxie.org/2022/01/07/web3-first-impressions.html ]\n\n> Shout out to Moxie for actually talking about how shit has just become super\n> overcomplicated for coders to even begin to get into. This article is probably\n> the best…",
  "data/reddit-crypto/r/CryptoCurrency/comments/sl6cmh/have_you_ever_heard_an_intelligent_wellspoken.json": "Exactly. 90% of the criticism you read about blockchain, web3, etc is written by\npeople who literally do not know what it is or how it works. Obviously, if you\ndo not know how something works, you can't see potential in it in terms of what\nit can do. If you think the limits of NFTs are jpegs of…",
  "data/reddit-crypto/r/CryptoCurrency/comments/sl4zki/congrats_to_beginners_who_survived_the_dive_under.json": "Hey, to all who didn't sell under 40K, congrats!\n\nWe are still far away from ATH BUT you are not one of those who sold at a loss\nin order to swing trade. The climb is not yet achieved and we may dive further\nbut you have shown your balls of steel and deserve recognition.\n\nBonus points if you bought…",
  "data/reddit-crypto/r/CryptoCurrency/comments/sl4rdn/btc_has_just_undone_a_months_worth_of_decline_in.json": "It never closes and that's probably where the obsession lies for so many:\nthere's no weekend or nighttime reprieve from the upticks and downticks. You\nknow that when you go to bed and when you wake up in the morning something will\nhave changed in your portfolio; things jump up or fall off of a…",
  "data/reddit-crypto/r/CryptoCurrency/comments/sl9uyn/crypto_prices_may_fall_at_a_rate_the_world_has.json": "Here are some valid reasons why this may happen\n\nBecause literally anything can happen, dummy.\n\nThis is just a simple reminder that just because a post makes you feel good,\ndoesn't make it true. And just because you don't agree with a post, doesn't make\nit wrong.\n\nPrices fell for a couple months…",
  "data/reddit-crypto/r/CryptoCurrency/comments/sl84r7/i_hate_how_the_concept_of_nfts_is_now_reduced_to.json": "NFT technology is one of the best and most interesting technologies that came\nout of blockchain.\n\nIts kinda frustrating seeing how people instantly think of JPEGs once you\nmention NFTs.\n\nNFTs can be used in MANY ways. Tickets, product listing, identity verification\nand much more.\n\nAnd yes I…",
  "data/reddit-crypto/r/Bitcoin/comments/skzb2s/cnbc_bitcoin_miners_are_helping_the_texas_grid.json": "https://www.cnbc.com/2022/02/03/winter-storm-descends-on-texas-bitcoin-miners-shut-off-to-protect-ercot.html\n\nThey only post FUD about Bitcoin/Crypto, articles full of lies and\nmisinformation. But this great factual article is nowhere to be seen there:\n\n> As a major winter storm descends on Texas,…",
  "data/reddit-crypto/r/CryptoCurrency/comments/sl0gz1/imagine_how_weird_it_felt_for_an_1960s_vendor_to.json": "Imagine what it felt like accepting the first credit card payments in the world.\nThe concept of intangible money, money that can’t be physically seen, has always\nbeen a hard concept for humans to grasp.\n\nSome countries and cities now like Dubai and New York use more credit cards than\ncash. Yet the…",
  "data/reddit-crypto/r/CryptoCurrency/comments/slhkes/this_is_how_insanely_secure_the_bitcoin_network.json": "Bitcoin is the most secure network in existence. The way the network is built is\npure genius and the bigger it gets, the more secure it becomes.\n\nIn 2011, Dan Kaminsky, a leading Internet-security researcher, investigated the\ncurrency and was sure he would find major weaknesses.\n\nKaminsky is famous…",
  "data/reddit-crypto/r/CryptoCurrency/comments/skzhyx/am_i_the_only_one_that_still_has_no_idea_what_the.json": "So what on earth is it?\n\nIs it just the idea that we'll all be playing MMORPGs all day with VR? Rather\nthen chatting with someone on zoom I'll spend half an hour wiring up my VR kit\nso I can chat to their avatar in a pretend conference room? And then we'll go to\na pretend coffee bar where we'll…",
  "data/reddit-crypto/r/CryptoCurrency/comments/sl7jfh/lets_see_whether_sentiment_really_changed_that.json": "You're very welcome to explain your outlook and explain why you feel bullish or\nbearish, but please don't annoy us with nobody knowing feces about fornication.\nI'm asking in order to determine the current outlook.\n\nI'm asking about how you feel about the market at this moment in time, not to\nget…",
  "data/reddit-crypto/r/Bitcoin/comments/sl4tg0/buying_bitcoin_every_month_for_53_months_now.json": "Been buying Bitcoin every month since late 2017. Nearly always with the same\namount, few exceptions when I got a bonus from work etc. Basically, I wanted to\ngo all-in but didn't have any savings, so decided to buy with max amount that I\ncan, every month from the salary. I kinda had the idea of…",
  "data/reddit-crypto/r/CryptoCurrency/comments/sl7c30/between_8th_and_15th_of_june_2021_btc_pumped_from.json": "Please keep in mind that just seven months ago we had almost the same pump,\nwhich took BTC up to EXACTLY where it is right now. This is not the only\nsimilarity - back then BTC pumped from 35k to 39k within 14 hours, while\nyesterday we saw a pump from 37k to 41k in 9 hours.\n\nThis uptrend was short…",
  "data/reddit-crypto/r/CryptoCurrency/comments/slngcc/i_analyse_the_18_coins_in_coinbase_venture.json": "We all know Coinbase but not all of us had heard of Coinbase Venture. It is an\ninvestment arm of Coinbase to invest in early-stage cryptocurrency and\nblockchain startups. You can check the portfolio at Messari website.\n\nTheir portfolio contains 18 coins as of now:\n\n * Bitcoin (BTC) and Ethereum…",
  "data/reddit-crypto/r/CryptoCurrency/comments/slvpny/vodafone_visa_paypal_mastercard_uber_andreessen.json": "https://preview.redd.it/c0i7c2rgj7g81.jpg?width=1270&format=pjpg&auto=webp&s=1511d8c098ef56efdbe024d23c56c1b64ad7b085\n\n\n\nIt has been over 3 years after Facebook's announcement of the plans to launch\ntheir own stablecoin project Libra which has gathered more that a billion USD\nfrom various well…",
  "data/reddit-crypto/r/CryptoCurrency/comments/slvcd1/diamond_hands_isnt_just_a_meme_anyone_who_held_on.json": "People tend to forget and lose sight very fast. Many say diamond hands slightly,\nbut yet they lose hope fast and panic sell.\n\nThis was just a month and few days ago when the end of year 2021 crash happend\nand many people already panic sold their coins.\n\nIf they had hold onto it, most of them has…",
  "data/reddit-crypto/r/CryptoCurrency/comments/sly4ow/in_venezuela_1_btc_is_around_190000_bs_bolivares.json": "Hi, Venezuelan living here!\n\nPosting this for several years!\n\nAround the same amount that last week. We are looking for around 110 BTC\nmonthly. Way lower that years ago.\n\nReason? New exchanges, where Binance is king, \"the\" P2P (with all the risk\ninvolved) option to go, not only BTC but other crypto…",
  "data/reddit-crypto/r/Bitcoin/comments/sm23n9/update_i_am_a_23_yr_old_student_and_hodl_exactly.json": "So during this Dip in the Market I managed to liquidate my stonks and ETF to put\nit in Bitcoin. Bitcoin is the answer and the only asset I can trust to hold it\nfor decades. Other than corporations.\n\nWhat do you think should I do? Should I try to time the market if let‘s say the\nmarket turns really…",
  "data/reddit-crypto/r/CryptoCurrency/comments/smbhkv/algo_over_a_dollar_eth_over_3000_btc_nearing.json": "Am I right? Or am I right? Let me just be the first one to say I am SO happy\nshitposting is back. Have you guys tried sorting by new? Oh my goodness the\n“technical analysis” I’ve seen is incredible. That leads me to ask, is your coin\nof choice going up? Have you seen the triple double golden shower…",
  "data/reddit-crypto/r/Bitcoin/comments/smamcf/so_im_16_and_just_bought_my_first_bitcoin.json": "Well, 0.00001556 of a bitcoin to be exact. Planning to buy more! Wish me luck.",
  "data/reddit-crypto/r/CryptoCurrency/comments/sm7ynk/seeing_so_many_anticrypto_people_not_having_any.json": "Just looking over a few Subreddits here like r/technology [/r/technology] or\neven better twitter, you can very fastly see the mutual hatred for Crypto there.\nPosts about crypto usually get bombed with the most classic argument after its\nall a scam: \"crypto is killing the environment due to…",
  "data/reddit-crypto/r/CryptoCurrency/comments/sm2l7k/anybody_use_cryptocom_earn.json": "Looking for feedback on crypto.com earn. Most of my crypto bag is in BTC. Not\nlife changing…yet, but not chump change either. But it’s just sitting there\nriding the crypto waves up and down. Crypto.com apparently will offer 4.5% paid\nout every 7 days in the coin that you invest. It’s been in the…",
  "data/reddit-crypto/r/Bitcoin/comments/sm1mwc/how_did_these_terrible_bitcoin_youtubers_become.json": "I am so disappointed that channels such as Carl The Moon, MMCrypto, DavinciJ15,\nBitboy, and many others are the top Bitcoin youtubers. These morally bankrupt\nscumbags representing Bitcoin are making us look bad to the layman person.",
  "data/reddit-crypto/r/CryptoCurrency/comments/smko2s/brantly_has_been_fired_cancelled_and_terminated.json": "Brantly just got terminated.\n\nTweet from the head of ENS\n[https://preview.redd.it/ay8dpcpr8dg81.jpg?width=1436&format=pjpg&auto=webp&s=515731591205d58921408d145e71756e5589373b]\n\n> True Names Limited (TNL), the nonprofit that funds and organises development\n> on ensdomains…",
  "data/reddit-crypto/r/CryptoCurrency/comments/smpnx1/i_suggest_not_trying_to_learn_technical_analysis.json": "TA tries to capture market psychology and sentiment by analyzing price trends\nand chart patterns for possible trading opportunities, but it's misguided and\nlacks a theoretical basis.\n\nWhen put to scientific tests it doesn't hold up against empirical evidence.\nAnalysts consistently looking at…",
  "data/reddit-crypto/r/CryptoCurrency/comments/smuto8/one_of_the_biggest_audit_firm_in_canada_just.json": "One of the most bullish things for our ecosystem will be the adoption of crypto\nby large institutions. And today, one of Canada's largest auditing and\nverification firms announced that they have purchased BTC and ETH for the first\ntime ever!\n\nThe firm, KPMG, is a major player in Canada. It's been…",
  "data/reddit-crypto/r/CryptoCurrency/comments/sml4lx/99_of_the_airdrops_are_useless_or_scam.json": "Juste here for an obvious post that the vast majority of airdrops are useless\nand/or scams. Even if it's promoted by legit platform/website. Please remember\nthat these websites are paid by the project to promote the Airdrops, it's not a\n\"cool and exclusive discovery for our users\". Also all the…",
  "data/reddit-crypto/r/CryptoCurrency/comments/smwx3o/help_me_understand_the_recent_market_turnaround.json": "I am sitting here trying to understand and rationalize the market rebound and I\nhave come to the conclusion that I have no idea why the market is trending back\nupwards. Was there something in particular that can be attributed to the\nturnaround? Just not sure where all the current resilience and…",
  "data/reddit-crypto/r/CryptoCurrency/comments/smqnbx/head_of_microsoft_blockchain_challenges_web2_devs.json": "Yorke E. Rhodes III is Cofounder of Blockchain Microsoft and Principal Program\nManager Azure Blockchain Engineering.\n\nHe had this interesting view point:\n[https://preview.redd.it/v57a5dwk0fg81.jpg?width=1412&format=pjpg&auto=webp&s=a2c6b62ce21ab0fb81a4cc74998bf633fa86daef]\n\n> web2 engineer…",
  "data/reddit-crypto/r/CryptoCurrency/comments/smyjne/things_are_heading_back_up_and_fast_am_i_paranoid.json": "I’m just trying to gauge how confident people feel in the direction we’re moving\nright now. We’ve been here before when things improve after a dip only to find\nit dip significantly again shortly after so I’m Just trying to take a straw\npoll. Personally I’m feeling positive but that’s why I’m…",
  "data/reddit-crypto/r/CryptoCurrency/comments/smzlb7/if_youre_kicking_yourself_for_not_buying_more.json": "Stick to your original plan. And if you don't have one, try to establish one -\neven if it's a simple DCA system without much more of an end goal than\neventually having more money. Don't get caught up in the hype which is very\nrapidly flooding into every person's social media feed. The success of…",
  "data/reddit-crypto/r/Bitcoin/comments/smwoq3/meta_situation_just_shown_why_btc_is_important.json": "Mr Mark \"The Lizard Alien\" Zuckerberg just threatened he will shut down Facebook\nand Instagram for Europe due to the GDPR.\n\nShutting down FB is honestly not that bad (aside of logins associated with it on\nother sites), but it clearly shows what CEO can do to you and how much power he\ncan have. Now…",
  "data/reddit-crypto/r/CryptoCurrency/comments/sn10a6/crypto_went_from_disbelief_to_euphoria_to.json": "We are currently having a pretty damn good uptrend, after such a long time.\nAbout exactly 4 months ago end of sep/beginning Oct we were at the same cycle\nspot of disbelief. Disbelief meaning that the current rally is under disbelief\nby many as we were having so much downs and fake breakouts…",
  "data/reddit-crypto/r/CryptoCurrency/comments/sn4iaf/1225_bat_payout_this_month_12_just_for_browsing.json": "Got a significant bump in earnings this month, I think this might be the largest\ndollar value payout I've ever had from the browser!\n\nBeen using the browser for quite a while, used to get 30 or 40 BAT a month but\nas the price shot up the amount of BAT dropped. This month it’s jumped up to\n12.25 BAT…",
  "data/reddit-crypto/r/CryptoCurrency/comments/sn6igx/bitboy.json": "I like most of you newbies when I first wanted to get into crypto, hopped on\nYouTube in January 2021 and searched some newbie phrase “what should I do with\n1k crypto” and more than likely bitboy pops up with his promising titles and\ndigestible content. And at this time ETH was around 1500. So I…",
  "data/reddit-crypto/r/CryptoCurrency/comments/smxe5j/inflation_is_fucking_over_peoples_lives_and_they.json": "7% inflation rate in 2021 (USA).\n\nThat means if you had $100,000 in your bank, you’ve lost $7,000!\n\nCountries like the US are still lucky with “just” 7%.\n\nFor example turkey had an inflation rate of 40%! People lost almost half of\ntheir money!\n\nOther countries like Venezuela have also suffered the…",
  "data/reddit-crypto/r/CryptoCurrency/comments/snds3m/here_is_how_i_doxxed_the_creator_of_a_scamcoin.json": "I posted this yesterday but it was removed by reddit because I said the website\nof the scam. Now I repost it without any information so please don't ask for it.\nAnyway the website is now deleted so you can't see anything.\n\nI own a telegram group where this morning an user entered telling everyone…",
  "data/reddit-crypto/r/CryptoCurrency/comments/smz304/are_the_bulls_really_back_on_track_or_its_just.json": "The markets is flowing again and most people are already caught up with a new\nsentiment. 2 weeks ago, FUD and desperation were raging and now, it's rocking\ngreen and we're all speculating when new BTC ATH, when ETH ATH or whatever coin\nyou hodl, wen moon!\n\nStill, I'm still a bit skeptical and on my…",
  "data/reddit-crypto/r/CryptoCurrency/comments/snfbz8/listen_to_what_the_youth_are_talking_about_and.json": "Here for round 2 of why being a high school teacher has been an 'ear to the\nfloor' revelation for me.\n\nHaving taught in schools for nearly 5 years you can get a sense about what is\nimportant to kids.\n\nFacebook is not cool = Subsequent rebranding and losing relevance\n\nTik tok very cool = tik tok…",
  "data/reddit-crypto/r/CryptoCurrency/comments/snle9h/if_you_want_to_make_money_day_trading_try_this.json": "Day trade on paper for at least a month or even longer. (Without actually making\nthe trades)\n\nI got this advice a few years ago but didn't listen and was down 50%.\n\nIt sounds odd, but it'll show you how hard and unpredictable it is, especially\nwith crypto.\n\nLiterally write every trade you would…",
  "data/reddit-crypto/r/Bitcoin/comments/sngeoe/convincing_my_friend_to_buy_bitcoin_before_100000.json": "\" This is very possible \" 🤓 his loss anyway 😂\n\nhttps://preview.redd.it/ob73r2u0ykg81.png?width=899&format=png&auto=webp&s=508c9bb03143d7ae9eb679f337db10b5e5b5e2ae",
  "data/reddit-crypto/r/CryptoCurrency/comments/snmrp5/the_web3ethereum_community_is_currently_divided.json": "Since last weekend, the Ethereum community has been torn apart by an\nunprecedented culture war. Two camps have formed, and there is no indication\nthat they will find common ground anytime soon. I will not take side with this\npost, as I only want to inform people of this issue.\n\nSo... What exactly…",
  "data/reddit-crypto/r/CryptoCurrency/comments/snxksz/make_sure_to_look_for_easter_eggs_during_super.json": "We been hearing that the coming Super Bowl LVI there is going to be a bunch of\nrumored commercial from the cryptomarket including one from crypto.com\n[https://crypto.com], coinbase and may be even dogecoin . For crypto.com\n[https://crypto.com] most likely Matt Damon is going to appear again. But…",
  "data/reddit-crypto/r/CryptoCurrency/comments/snx7rw/i_read_cathie_woods_ark_invests_132_page_big.json": "If you don’t know her, Cathie Wood is a fund manager (Ark Invest) who rose to\nprominence in 2020/21 after a series of very successful investments/market bets.\n\nShe is a strong believer in disruptive technologies.\n\nThink robotics, tomorrow’s batteries and genomics as well as erm..…",
  "data/reddit-crypto/r/CryptoCurrency/comments/snh7rs/for_everyone_using_the_brave_browser.json": "Recent post from a person gaining 12.25 BAT this month gained quite some\ntraction. I noticed that many people mentioned in the comments that they are\nonly receiving 1 or 2 adds per hour.\n\nIf your Brave is updated you can navigate to Reward Settings (in the Brave\nRewards window), and from there…",
  "data/reddit-crypto/r/CryptoCurrency/comments/so8dlp/found_my_wallet_from_2013.json": "So when I was 13, I learned about bitcoin and starting mining it on my gaming\nPC. Lost interest after a while, bitcoin blows up, I lament young me’s error,\netc\n\nWent through my old google drive and found my wallet, problem is - I have\nabsolutely no idea how to access it / if I can access it. It’s a…",
  "data/reddit-crypto/r/CryptoCurrency/comments/snuhg5/people_wants_to_go_back_in_time_to_buy_btc_yet.json": "Everyone talks about missed opportunities, but sometimes the opportunities are\nright in front of them and they fail to take advantage, to recognise them.\nPeople are still sleeping on ”insert your favourite coin here”. If you want to\nbuy BTC or ETH, do it now! If you want to buy ADA, NANO, DOT,…",
  "data/reddit-crypto/r/CryptoCurrency/comments/snrvt9/metamask_should_warn_you_if_you_are_about_to_make.json": "This isn't a question about about decentralization or centralization. This is\nalso more than just a simple nice-to-have feature. Imagine you browse websites\nthat knowingly sell your I.P. address and other information to hackers and other\nmalicious actors can openly see what you're doing and your…",
  "data/reddit-crypto/r/Bitcoin/comments/so7ru7/the_russian_government_and_the_bank_of_russia.json": "The Bank of Russia wanted the Russian government to declare the use of\ncryptocurrencies illegal in Russia, but instead of banning the use\ncryptocurrencies, the Russian government and the Bank of Russian have agreed\nthat cryptocurrencies will be recognized as an analogue of currencies in Russia\nand…",
  "data/reddit-crypto/r/CryptoCurrency/comments/sode68/coinbase_have_stolen_my_eth_deposit_and_ignored.json": "I deposited ETH, from an address I have used many times, to my CB address I have\nused many times without issues. Deposit made on Christmas day 2021.\n\nI got the usual CB email saying they'd received my deposit, and the tx is\nconfirmed on etherscan.\n\nThe coins were never put into my portfolio.\n\nI…",
  "data/reddit-crypto/r/CryptoCurrency/comments/sobivz/bbc_and_crypto_media_20yearold_turned_50_into_8m.json": "There is a wholesome story going around by the BBC today, echoed by some crypto\n\"media\" about a young crypto millionaire that turned $50 into millions within\nmonths trading crypto. Okay, this sound somewhat unbelievable, but there's more\nto the story.\n\nThey report, he is giving back to the…",
  "data/reddit-crypto/r/CryptoCurrency/comments/sohojt/melania_trumps_nft_was_sold_for_170000_toherself.json": "The address (aka address #1) that minted the NFT sent 473,657.64 USDC to an\nintermediary address (#2). The intermediary address swaps some of that USDC for\n1,816.08 SOL. Then Address #2 sends 1800 SOL to a 3rd address.\n\nThe third address makes a bid and wins the NFT for 1800 SOL. That 1800 SOL…",
  "data/reddit-crypto/r/CryptoCurrency/comments/sojzqo/people_say_investing_in_crypto_is_too_risky_yet.json": "The average cost of a wedding is roughly $20,000 here in the USA. That’s just\nfor the wedding. With the divorce rate steadily increasing, a marriage is the\nmost risky, unfavorable investment one could make in his/her entire life.\n\nThen, let’s say you and your significant other decides to divorce.…",
  "data/reddit-crypto/r/CryptoCurrency/comments/sohd28/ten_years_ago_i_predicted_that_reddit_would_turn.json": "Blockchain tech is in the early stages of constructing a trustless global voting\nmachine that humanity will use to quickly reach popular consensus on current\nevents. Biometrics and facial recognition in VR headsets or AR glasses will be\nused to authenticate users to a specific wallet address,…",
  "data/reddit-crypto/r/Bitcoin/comments/soknl2/i_put_keys_to_0003_btc_in_a_vault_for_100_years.json": "Well not exactly I put it there, the city archive where I live will store\nletters for 100 years. They will open them in 2122. I wrote a letter and also\nput the private keys for 100 $ worth in BTC. What do you think are the chances\nthe network will be still up and running? What would be the block…",
  "data/reddit-crypto/r/CryptoCurrency/comments/soc2jj/are_there_any_other_upcoming_play_to_earn_games.json": "I want to invest in P2E games as early as possible so I can have my ROI fast,\nand also, while the prices aren’t high. (I’m not gonna use it as my main source\nof income so don’t come at me) Anyways, Here are some of the games that I have\nfound.\n1. Metawars\nI don't think I'm that early with this one.…",
  "data/reddit-crypto/r/CryptoCurrency/comments/soljnd/internet_users_in_1997_130m_btc_users_today_130m.json": "Internet users in 1997: 130M.\n\nBTC users today: 130M\n\nInternet was 14 years old in 1997 while BTC is 13 (?) years old this year.\n\nLooks like we're growing faster than internet did way back when but I know it's\nnot all so black and white and there's many more factors at play here:\ntechnological…",
  "data/reddit-crypto/r/CryptoCurrency/comments/soiu05/earn_interest_on_crypto_and_stablecoins_begginer.json": "Generating yield on crypto is a booming thing. There are many ways to boost your\ngains, this includes lending, staking, liquidity providing, etc. You can do this\nwith CeFi and DeFi. This is an updated attempt to provide guide for begginers,\nbut even experieneced user might find some useful…",
  "data/reddit-crypto/r/CryptoCurrency/comments/sotn2r/friendly_reminder_be_extra_careful_with_new_coins.json": "Before the removal of the Dislike Count, people like me rely on the ratio\nbetween number of thumb-ups and thumb-downs to spot scams, fake reviews, or bad\ncontent overall. Those days are gone now that YouTube has removed the Dislike\nCount.\n\nNow scammers are just out on YouTube and scam people so…",
  "data/reddit-crypto/r/CryptoCurrency/comments/soukpv/spoke_to_my_local_congressman_and_now_he_actually.json": "The title says it generally, I had a rare opportunity to actually SPEAK to my\nelected representative, and he said the only things hes heard about\ncryptocurrency are “concerning”. Im looking for help on putting together a good\nlist of reputable sources that i could provide to him so that he could…",
  "data/reddit-crypto/r/CryptoCurrency/comments/soxt6k/stop_over_leveraging_your_portfolio_into_cro_for.json": "Unpopular Opinion: CRO should not be more than 10-15% of your portfolio.\n\nLately I’ve noticed lots of people here heavily over leveraged in CRO attempting\nto obtain the next level of card. Don’t get me wrong, the benefits are great,\nbut BENEFITS ALONE could never warrant putting such a high…",
  "data/reddit-crypto/r/Bitcoin/comments/soxgdo/i_know_nobody_cares_but_after_paperhanding_10_btc.json": "I'm using a throwaway for security, and also because I know some people will\nmock me for this post, but I wanted to share my journey.\n\nAfter first learning about bitcoin in 2012, and feeling like I missed the boat\nin the 2013 bull run, I decided to start buying modest amounts in January 2014.\nIn…",
  "data/reddit-crypto/r/CryptoCurrency/comments/sp71mt/what_its_like_currently_holding_ada.json": "Hodling ADA is like you're eating at a 5 star gourmet restaurant where Gordon\nRamsey (Charles Hoskinson) is the chef. Its renouned worldwide . Bottles of wine\nstart at $500. All that to say that the food should be amazing. Only for you to\nbe served chicken tendies and soggy fries from the kids…",
  "data/reddit-crypto/r/Bitcoin/comments/sovktt/max_keiser_the_kremlin_is_mining_bitcoin_and_will.json": "source:\nhttps://twitter.com/maxkeiser/status/1491406739283259392?t=8H7ztcl9KzosIkqu51Sexg&s=19",
  "data/reddit-crypto/r/CryptoCurrency/comments/sp6f6u/this_is_why_everyone_else_hates_crypto_people.json": "From time to time I'll see people around here post thread or message in the\ndaily chat complaining about the fact that \"people are so hostile to us in other\nsubreddits\".\n\nWell, I have spent the last few months hanging out around here, and I believe I\nhave found why that is : delusion and collective…",
  "data/reddit-crypto/r/CryptoCurrency/comments/sp7pzh/binance_led_by_the_worlds_richest_crypto.json": "Binance\n[https://www.cnbc.com/video/2021/11/15/regulation-is-good-for-the-crypto-industry-says-binance-ceo.html],\nthe world’s biggest cryptocurrency exchange, is making a $200 million strategic\ninvestment in Forbes [http://www.forbes.com/?], the 104-year old magazine and\ndigital publisher, CNBC has…",
  "data/reddit-crypto/r/Bitcoin/comments/sp59sw/why_do_i_keep_seeing_theres_not_enough_btc_for.json": "There's over 50 million millionaires in the world. I've read over and over again\nthat there's not enough BTC (21 million) for each one.\n\nIs this some enduring fable that people just repeat without questioning?\n\nEdit: I think I had a stroke (kidding).\n\nI'm going to leave the post up just to watch…",
  "data/reddit-crypto/r/CryptoCurrency/comments/spetfq/it_is_tax_season_again_in_the_usa_i_am_a.json": "Hi r/Cryptocurrency [/r/Cryptocurrency],\n\nIn case you haven't caught one of my other AMA's, I am a US-based attorney\npracticing cryptocurrency law with a strong emphasis on questions of taxation.\nI've been in the cryptocurrency space as an investor since 2013, so I've seen\nmuch the development of…",
  "data/reddit-crypto/r/CryptoCurrency/comments/spnpw4/drake_bet_on_the_super_bowl_with_cryptocurrency.json": "You heard it. Drake the pop star, rap icon and certified lover boy has placed\nhis bet on the Los Angeles Rams to win the Super Bowl using bitcoin.\n\nHe bet $600,000 Canadian dollars worth of bitcoin for the Rams to win including\novertime. He bet $500,000 Canadian dollars worth of Bitcoin that Odell…",
  "data/reddit-crypto/r/CryptoCurrency/comments/spm7bj/nft_is_easily_the_most_practical_utility_for.json": "NFT is now the butt of jokes and its making crypto look bad. There is finally\nsomething that can show the world the capability of blockchains and what crypto\nis capable off, and instead it is turn into a cash grab of JPEGs and weird\nantics. It was kind of neat as a novelty but now not so much.\n\nBut…",
  "data/reddit-crypto/r/Bitcoin/comments/spjhxz/bitcoins_true_value_is_somewhere_between_500k_to.json": "Microstrategy bought bitcoin in 2020. Two years later an institutional wave of\nmoney is now entering.\n\nEl Salvador bought bitcoin in 2021, by 2023 a wave of sovereign nations will be\nbuying bitcoin to hold as reserves.\n\nBitcoins fair value is somewhere between gold and global debt which is…",
  "data/reddit-crypto/r/Bitcoin/comments/sq2kq3/my_fiances_employer_wants_to_see_my_holdings.json": "My fiance's company is requiring it's employees and anyone who lives with said\nemployees to disclose their crypto holdings. Am I legally obligated to do so?\nThey already have access to my Fidelity account and now they want my bitcoin\ntoo? Apparently they have some \"Blacklist\" and \"Bitcoin will…",
  "data/reddit-crypto/r/Bitcoin/comments/spmjzc/ontario_court_freezes_access_to_funds_to_truckers.json": "https://www.cp24.com/mobile/news/ontario-court-freezes-access-to-donations-for-truckers-protest-from-givesendgo-1.5776665\n\nThis is what happens when governments have control over the money supply. This\nis a modern day example of what occurs when the powers that be don't agree with\nyour views. This…",
  "data/reddit-crypto/r/CryptoCurrency/comments/sq5b1o/satoshi_nakamoto_disappearing_was_the_biggest.json": "13 Years ago today Satoshi said that trust is the main problem with central\nbanks. The centralized system needs you to trust all party's included. And athst\nvery hard to do nowadays.\n\nThat probably also was the reason why Satoshi Nakamoto disappeared. Crypto is\nabout being anonymous, it's about…",
  "data/reddit-crypto/r/CryptoCurrency/comments/sq8rzd/i_originally_bought_crypto_as_a_hedge_to_the.json": "I bought BTC & ETH years ago and have held ever since. Only time I add is during\n20%+ corrections, and I have never sold.\n\nWhen I originally bought cypto, it was as a hedge to the stock market. And it\nworked that way for a while.\n\nI'm not sure what happened in the last 2-3 years but now Crypto just…",
  "data/reddit-crypto/r/CryptoCurrency/comments/sqcw3a/people_call_this_dip_russian_fud_and_its_fucking.json": "I'm a little drunk rn but I'm pissed off and have to get this off my chest. I've\nseen so many comments about the Russian / Ukraine conflict. People brush it off\nas FUD, some even asked for Russia to \"just fucking do it\" so we can get over\nwith it already. Seriously what the FUCK is wrong with…",
  "data/reddit-crypto/r/CryptoCurrency/comments/sq2srq/soon_mining_on_gpus_will_be_over_intel_is.json": "Digital computing continues to enrich our lives in more ways than we can\nimagine. We acquire, consume, and create content and services with a few clicks\nor taps of our fingertips. Exponential increases in compute performance, enabled\nby Moore’s Law, play a significant role in making these…",
  "data/reddit-crypto/r/Bitcoin/comments/sq9b8z/russia_legalized_bitcoin_as_currency_to_hedge.json": "Putin supports legalizing bitcoin as currency because he’s threatening war and\nBiden’s economic sanctions would hurt the ruble. He could still transact in the\nworld economy through bitcoin. I’m wondering everyone’s opinion on this.",
  "data/reddit-crypto/r/CryptoCurrency/comments/sq5vlh/this_is_how_the_exsafemoon_coo_lives_after_a.json": "Estimates are in that this is a $12,000 jacket, a $30,000 rolex and he's flying\nin a private jet.\n[https://preview.redd.it/i321smcr0xg81.jpg?width=614&auto=webp&s=ba5ba47930228a5180f8d4a6bdc04e6f002f39ce]\n\nFurther proof that money doesn't buy style...\n\nWant some backstory? You ain't alone - Jack…",
  "data/reddit-crypto/r/CryptoCurrency/comments/sqpdpr/more_than_500_million_people_worldwide_tomorrow.json": "Tomorrow millions of viewers worldwide are sitting in front of their devices.\n\"It will be late night here in germany where i live, but i cant wait to see the\nexciting super bowl ads\", a man from Berlin says \"Who will win? CRO or FTX?\".\n\nBut viewers are complaining, there is just too much sports…",
  "data/reddit-crypto/r/CryptoCurrency/comments/sqpuhy/oc_ive_made_an_analysis_tool_for_cryptocurrency.json": "Hey r /cc,\n\nI’m working on a project that can bring more transparency to blockchain projects\nand their development. Blockchain development is usually done in an open-sourced\nway, where anyone can see what developers are working on. But this information\nis usually only accessible to people who are…",
  "data/reddit-crypto/r/CryptoCurrency/comments/sqtbjl/blackrock_wants_to_steal_all_your_crypto_dont_let.json": "Sources say BlackRock, the world’s LARGEST asset manager, is preparing to offer\ncryptocurrency trading services to investor clients. They manage over $10\ntrillion in assets via public pension schemes, family funds, endowments, and\nsovereign wealth funds. BlackRock also owns 16.3% of…",
  "data/reddit-crypto/r/CryptoCurrency/comments/sr04jy/i_strongly_believe_that_tomorrows_super_bowl.json": "Title sums it up but for those that don't know tomorrow during the Super Bowl\nthere is going to be advertisements from crypto dot com and other cryptos. This\nis going to be the single biggest advertising advent reaching the largest number\nand demographics of people that crypto has ever had.\n\nDo I…",
  "data/reddit-crypto/r/CryptoCurrency/comments/sqx6id/warning_guy_from_famous_youtube_channel_is.json": "Since the video comparing Solana vs Algo [https://youtu.be/RzucrCRGYkM] this guy\nnever stopped shilling Solana despite all the bugs and problems.\n\nEven in the last video about Phantom Wallet [https://youtu.be/zI-Xd9vVnwY] he is\nspeaking more about Solana, then the Phantom itself.\n\nIt is clear to me…",
  "data/reddit-crypto/r/CryptoCurrency/comments/sqyfdw/we_need_to_do_something_about_banks_robbing_us.json": "Banks collected $12.4 billion dollars in overdraft fees in 2020. That means\nbanks took over $12 billion dollars from people with no money during a global\npandemic.\n\nMy bank takes between $50/70 dollars in overdraft fees every quarter. Yearly APY\non my saving account is so bad that it’s actually…",
  "data/reddit-crypto/r/CryptoCurrency/comments/sr6tz4/the_super_bowl_is_not_gonna_affect_the_price.json": "A top post is just pure 'trust me bro' hopium hypenomics at work with a a title\nto entice. Here's a fact for you all, viewership of the superbowl has been\nconsistently going down for more than a decade since 2010. So less people are\nwatching the game in general. About half of those people are just…",
  "data/reddit-crypto/r/CryptoCurrency/comments/sqzyuq/no_one_wants_to_talk_to_you_sorry_but_youre_being.json": "I know, there are warnings everywhere about scams, but I just don't understand\nhow some people fall for these types of scams.\n\nA lot of scams begin with a simple conversation. If a random stranger just send\nyou a private message saying \"hi\", theres already a 99.9999% chance its a\nscammer. I'm sorry…",
  "data/reddit-crypto/r/Bitcoin/comments/sr2i2l/cash_app_activating_lightning_is_the_biggest_game.json": "Cash app now enables its 70 million active users to send money internationally\nusing lightning to any other lightning compatible wallet. Not only can users\nsend funds instantly and for free to any other cash app user but also to any\nstrike user or lightning wallet on earth.\n\nThis is how network…",
  "data/reddit-crypto/r/CryptoCurrency/comments/sr3udv/be_honest_if_you_had_the_chance_to_do_a_10x_but.json": "After a discussion with a friend, I recently found myself asking a somewhat\nphilosophical question about crypto. I like to think I'm in it for the tech, and\nI think most of my investments reflect that (I'm pretty much all in on ETH at\nthis point), but of course I'd like to make money. And as…",
  "data/reddit-crypto/r/CryptoCurrency/comments/src30m/the_2000_super_bowl_had_21_dotcom_advertisements.json": "There are some posts going around that the SuperBowl ads will start the next\nbull run. So here is some history.\n\nThe 2000 SuperBowl was known as the DotCom SuperBowl - it marked the spectacular\ntop and was followed by the crash of the entire dotcom market, sinking many of\nthe companies that…",
  "data/reddit-crypto/r/CryptoCurrency/comments/src111/2021_was_the_year_for_terra_luna_and_solana_what.json": "Hi all\n\nThis is a light hearted crystal ball shill post about the best performing crypto\nin 2022.\n\nBackstory: I bought Luna at $5.8 and Sol at $29 in around March 2021 and was\nexcited to sell a couple of days later Luna at $9 and Sol at $36. You can\nimagine how I felt when Luna topped at $100 later…",
  "data/reddit-crypto/r/CryptoCurrency/comments/sqyr3h/polygon_in_its_current_state_is_insecure.json": "I'd like to hear opinions and counter arguments of Polygon holders here. This\nguy from twitter (@Justin_Bons) is famous for his warnings about centralized\nprojects, though to be fair sometimes his views are somewhat exaggerated I\nthink. Today he made 12 posts about Polygon calling it \"one of the…",
  "data/reddit-crypto/r/CryptoCurrency/comments/srhtkb/a_glimpse_into_the_future_i_modified_these.json": "I was looking for a way to change default currency on websites to Bitcoin, but\ncouldn't find any. So, I thought it would be interesting to modify a few myself.\n\nI took some screenshots of generic websites. You're probably familiar with most\nof them, and searched common products. Then I simply…",
  "data/reddit-crypto/r/CryptoCurrency/comments/srk0w9/nfts_are_ruining_cryptos_reputation.json": "NFTs are ruining crypto's reputation.\n\n * Game developers such as UbiSoft are shoving NFTs down gamer's throats, and\n   they hate it, gamers ridicule it saying it's the worst thing that ever\n   happened to video games in recent history,\n\n * Turns out Melania Trump sold her own NFT to herself to…",
  "data/reddit-crypto/r/CryptoCurrency/comments/srl03e/coinbase_card_is_underrated_earned_over_500_in.json": "Just wanted to post this for the skeptics. I know I was very apprehensive using\nthe Coinbase card before I started using it. But it’s actually really easy. They\nmail you a card (and link a card using Apple Pay if you have an iPhone) and then\nyou simply just use that as opposed to your normal debit…",
  "data/reddit-crypto/r/CryptoCurrency/comments/sri7l5/stop_celebrating_russia_for_recognizing_crypto_as.json": "Why did everyone here celebrate that Russia is going to recognize Crypto as\ncurrency?\n\nDid anyone here actually do research on the consequences of it, or just read the\nheadlines?\n\nConsequences of it:\n\n * Crypto can only be transacted through the banking system\n\n * Transactions outside the banking…",
  "data/reddit-crypto/r/CryptoCurrency/comments/srtgv6/if_mcdonalds_announces_that_they_are_going_to.json": "Not even comedy...\n\nI've been seeing some people commenting on how they hope McDonald's big\nannouncement is that they are going to start accepting... Dogecoin?!!\n\nCan anyone give me a reason why these naive fools think this is even next door\nto the realm of possibility? A Grimace Coin announcement…",
  "data/reddit-crypto/r/CryptoCurrency/comments/srx5tk/what_did_you_think_of_coinbases_super_bowl.json": "I thought it was really unique, trackable, and relevant given how familiar\neveryone is with QR codes since Covid. I loved it.\n\nThe QR code bounced around the screen like the old school screen savers and it\nactually hit perfectly in the corner!!\n\nThe QR code takes you to a screen to sign up and get…",
  "data/reddit-crypto/r/Bitcoin/comments/srwvxh/coinbase_ad_superbowl.json": "How much did they pay for that? Wtf",
  "data/reddit-crypto/r/CryptoCurrency/comments/srzc1o/coinbase_website_sees_x14_increase_in_traffic.json": "Coinbase is currently seeing an extreme amount of traffic on their website, not\neven commonly seen during the last Crypto dips.\n\nTheir website is currently receiveing 14 times more traffic than on a good day,\nbeing flooded with new users.\n\nEven Cloudflare, the biggest content dilvery network…",
  "data/reddit-crypto/r/CryptoCurrency/comments/srx2mi/coinbase_just_shut_themselves_down.json": "Coinbase just released a floating QR code during commercial time of the Super\nBowl. It was fitting for a random 1980’s style science fiction b-roll clip.\n\nI went there and their server was down almost immediately. They basically just\nDDoS’d themselves. I hope some of you were able to enter the…",
  "data/reddit-crypto/r/CryptoCurrency/comments/ss5f5u/the_truth_about_getting_rich_in_crypto.json": "We keep forgetting one big component in all of this: luck. Let me illustrate\nthis, using some of my own life experiences as examples. Here we go:\n\n- Me and 2 friends discover something called bitcoin when it was $40 a pop and\nlitecoin at $2. Poor as church mice we collect all our money and invest…",
  "data/reddit-crypto/r/CryptoCurrency/comments/ss2icl/remember_all_you_need_is_028_btc.json": "If you have 0.28 bitcoin then let me be the first to congratulate you. Why?\nSimple. Because no more than one percent of the world population can ever own\nmore BTC than you. This is really something if you believe that BTC will reach\ngreat heights.\n\nThere are people saying BTC will eventually hit 1…",
  "data/reddit-crypto/r/CryptoCurrency/comments/ssajk9/snowden_coinbase_spending_16000000_on_a_superbowl.json": "Edward Snowden's tweet on Coinbase's superbowl Ad is a reality check for Crypto\nexchanges, how they do business.\n\nTweet\n\n> Coinbase spending $16,000,000 on a Superbowl Ad to direct people to their\n> website and $0 to make sure that website doesn't crash 10 seconds after the ad\n> starts is do very…",
  "data/reddit-crypto/r/CryptoCurrency/comments/ssgq4c/the_coinbase_ad_wasnt_just_a_qrcode_it_showed_the.json": "I see everyone here is having a good laugh over that coinbase ad and yeah I do\nalso. Spending 16M for an ad and the just putting on a QR-Code for the site,\nsomething everyone had access to, seems like a meme that they made themselves.\nBut it's actually a lot more. It's what crypto needs to…",
  "data/reddit-crypto/r/CryptoCurrency/comments/ssonim/coinbase_pro_no_longer_needed_coinbase_now_has.json": "So not sure exactly when this was released, but Coinbase original flavor now has\nadvanced trading with market and limit buys. Checking out the fees on Pro and\nthe regular site, they seem to be completely identical. I'm not sure if there is\nanything I am currently overlooking, but from what I can…",
  "data/reddit-crypto/r/CryptoCurrency/comments/ssqg25/no_a_hacker_couldnt_have_printed_unlimited_ether.json": "This is in reference about this post\n[https://np.reddit.com/r/CryptoCurrency/comments/ss8ohv/hacker_couldve_printed_unlimited_ether_but_chose/]\nwhich is trending pretty hard right now - looking through the comment section I\nsee that a terrible amount of people did NOT read the article and also…",
  "data/reddit-crypto/r/CryptoCurrency/comments/ssnwao/cryptocom_customer_support_review.json": "Hello all, the following was my experience going through a card upgrade with\nCrypto.com.\n\nI had most of my CRO locked up in the defi wallet and was in the process of\nwaiting the 28 days to move it over. I had a few more just sitting in my regular\nwallet and figured I’d put them in the 6% staking…",
  "data/reddit-crypto/r/CryptoCurrency/comments/sssvpq/canadian_gov_is_the_reason_why_you_shouldnt_hold.json": "So recently the gov of Canada enforced emergency powers and is telling banks to\nfreeze assets of people involved in the convoy. The banks of course will comply\nand can freeze assets without any court order. Im not sure if its the people\ndonating as well or if its donations over a certain sum but…",
  "data/reddit-crypto/r/CryptoCurrency/comments/ssu4dd/how_are_we_not_talking_about_the_great_crypto.json": "Canada is now allowing banks to freeze accounts at will without any legal\noversight.\n\nhttps://www.bbc.com/news/world-us-canada-60383385\n\nThis means, that at the press of a button, they can ruin someone's life\novernight. In an instant loan payments will be missed, subscriptions cancelled,\ncredit…",
  "data/reddit-crypto/r/CryptoCurrency/comments/ssxbwb/whats_the_big_deal_with_super_bowl_adverts_super.json": "Now that all the excitement from the super bowl crypto ads has died down I\nwanted to figure out why it exists in the first place.\n\nSuper bowl typically has 100-120m viewers, so clearly it’s a big event. However\nthe champions league final has a lot more, in 2021 700 million people watched\nChelsea…",
  "data/reddit-crypto/r/CryptoCurrency/comments/ssvdug/big_threat_looming_over_monero_blockchain_minexmr.json": "You would see that this has been doing rounds now since recently. MineXmr (a\nsupposedly infamous) mining pool, now owns 52% or more of network's hashrate\n[https://pools.xmr.wiki/]. Know that Monero mining is special and has been\ntouted to be more decentralized as it supports CPU mining, which has…",
  "data/reddit-crypto/r/CryptoCurrency/comments/st424u/finally_got_all_my_crypto_off_robinhood_you.json": "I'll admit it: I've kept a large sum of my crypto on Robinhood this whole\ntime... until now. To be fair, I had stopped actively buying with them a year\nago, but had decided not to sell since they had announced they were developing\ncrypto wallets. So I decided to just hodl until I could transfer…",
  "data/reddit-crypto/r/CryptoCurrency/comments/st4prt/many_popular_crypto_projects_have_not_been.json": "All software has bugs and needs to continually evolve to stay competitive.\n\nWhat's fascinating with crypto is that the code is open source. This means it's\npossible to see how active the developers for any project are.\n\nMany well known projects are incredibly popular with devs. Thousands of new…",
  "data/reddit-crypto/r/CryptoCurrency/comments/st3d08/algorand_foundation_has_just_inked_a_deal_with.json": "In a recent Twitter Spaces, Staci Warden, new CEO of the Algorand Foundation,\nannounced that the Algorand Foundation has struck a deal with one of the largest\nsmartphone manufacturers in Africa.\n\nThe CEO of the smartphone company came to the realization that Africans can\nafford smartphones but…",
  "data/reddit-crypto/r/CryptoCurrency/comments/st31pd/would_you_dca_20_in_to_btc_or_eth_every_week_long.json": "Guys the thing is, i have low income, i can only invest little by little.\nTalking about 20€ per week DCA.\n\nI want \"safe bet\", so its BTC or ETH.\n\nWich one would you pick, if you have 20€ or dollar to DCA per week for long\nterm.\n\nMy dream would be one day own 1 whole ETH, just for kicks.. to be so…",
  "data/reddit-crypto/r/CryptoCurrency/comments/st0g73/coingecko_seems_a_lot_better_than_coinmarketcap.json": "For one, Coinmarketcap pushes to the front many projects likely to be considered\n'pump and dump tokens' on their home page in the 'biggest gainers' section at\nthe very top of the page before you even see BTC at no.1 (mostly BSC) which I'm\nsure many new investors fall prey…",
  "data/reddit-crypto/r/Bitcoin/comments/std6lx/just_sold_my_house_to_buy_bitcoin_97_of_my_assets.json": "I'm gona be homless for the couple of years but its all worth it so my money\nwont get frozen by canadian banks lol",
  "data/reddit-crypto/r/CryptoCurrency/comments/st3qzp/before_you_dump_your_life_savings_into_crypto_on.json": "Title says it all, diplomacy in Europe was always going to be Russia's end goal\nand the market is responding to their first obvious step towards that goal. As\nsuch crypto had a healthy pump today in line with market investors expectations.\n\nHowever, the FED are highly like going to have to make…",
  "data/reddit-crypto/r/Bitcoin/comments/st5j39/thats_it_im_going_all_in.json": "I already had 50% of my net worth in bitcoin, soon to be 100%.\n\nI'm furious and disheartened to see the Canadian government move to disband\npatriotic protesters fighting for basic human freedom and choice. Now Trudeau\ngives them the power to seize funds from crowd-funding sites and banks if…",
  "data/reddit-crypto/r/Bitcoin/comments/st3i94/friendly_reminder_bitcoin_is_apolitical_by_design.json": "Next time you are tempted to push a political agenda, ideology or movement\n(right or left) on the back of an agnostic technology, ask yourself if you’ve\nbeen victimized by the same propaganda machines Bitcoin was originally designed\nto circumvent.\n\nNever, ever forget, the Bitcoin network runs nodes…",
  "data/reddit-crypto/r/Bitcoin/comments/stcnal/canadas_martial_law_disaster_is_the_best_thing.json": "Bitcoin is uncensorable, non confiscatable hard money without a central bank. We\nare finally focused on the non confiscatable aspects of Bitcoin and I love it!\n\nLook, I think the Bitcoin narrative as an inflation hedge and as an\ninstitutional asset is great, especially during the massive monetary…",
  "data/reddit-crypto/r/CryptoCurrency/comments/stlxai/crypto_isnt_the_only_thing_that_is_down_these.json": "In the last three months we have seen bitcoin and other crypto's take a huge\ndrop in value but at the same time r/CryptoCurrency [/r/CryptoCurrency] has\ndropped by 36.6% in participation.\n\nI know the big joke on the sub used to be that we had so many unnecessary post\nand moon farmers posting…",
  "data/reddit-crypto/r/CryptoCurrency/comments/stthta/i_dont_have_an_exit_strategy_when_the_price_goes.json": "First of all, don't be like me. You should always have an exit strategy.\n\nBut I don't. I also actually never sold for any profit.\n\nI came to the point where I would check prices of the coins I hold once in a\nweek. And I would be like \"aaahh, it is going down, I am already at loss...well\nguess I…",
  "data/reddit-crypto/r/CryptoCurrency/comments/stwn8a/influencers_are_plagues_of_the_modern_society_and.json": "A Ferrari stops and a smiling young man gets off. Everything he wears radiates\n\"rich\". Everything cries \"show off\". Yet this is exactly the point. He is coming\nto the camera, Fake smile of \"success\" still on his lips, and starts talking:\n\"You know. I was poor (like you losers). But it didn't stoped…",
  "data/reddit-crypto/r/CryptoCurrency/comments/stsim9/a_237_million_avatar.json": "Here is a pixelated avatar that was bought for $ 23.7 million with borrowed\nfunds through the Compound DeFi protocol (that's about 8,000 Ethereum. The buyer\nwas Chain CEO Deepak Thapliyal), this has broken the previous record for a\nCryptoPunk sale (the previous was which fetched $11.75 million),…",
  "data/reddit-crypto/r/CryptoCurrency/comments/su1fop/were_dealing_with_a_worldwide_hunger_pandemic.json": "I know I know. Rich people spend millions all the time, but when we are facing a\nworldwide child hunger crises that is far surpassing the annual 3,000,000 child\nhunger deaths we had pre-virus, giving this guy Clout in the media is a FK'N\nTravesty.\n\nhttps://www.aljazeera.com/news/2022/2/15/un-hunger…",
  "data/reddit-crypto/r/CryptoCurrency/comments/su32l5/no_canada_didnt_block_any_bitcoin_wallet_simply.json": "I'm seeing to many people sharing the news that Canadian government blocked 40\nBitcoin wallets because they're related to the convoy protest.\n\nWhat's really happened is that the government told every exchange in Canada to\nblock any deposit coming from those 40 wallets. That's totally different…",
  "data/reddit-crypto/r/CryptoCurrency/comments/subyqr/you_know_it_wouldnt_kill_you_to_not_be_so_bitter.json": "Someone hears about Bitcoin one day, reads about cryptocurrencies, gets on\nreddit, wow so many subreddits talking about the thing i love, and then makes\nthe mistake of joining this one.\n\nI understand you lost some money after being an \"expert\" in crypto for a year,\nlet's hate on the newbies trying…",
  "data/reddit-crypto/r/CryptoCurrency/comments/su2mo4/im_sick_of_seeing_all_the_cro_shills_crocryptocom.json": "TL;DR: There are much better alternatives for everything that CRO/CDC offers\n(see points below).\n\nThis post will probably get downvoted and buried to hell because I know there\nare a LOT of CRO holders here, but people will want to understand these points,\nadd a dash of skepticism to things they…",
  "data/reddit-crypto/r/CryptoCurrency/comments/suegcg/if_you_thought_cbdcs_are_here_to_help_people_here.json": "Many people seem to think CBDCs are the next step in crypto adoption, and\ngovernments are keen on introducing CBDCs to help people spend and invest in\ncrypto in a safe manner instead of having to rely on risky tokens like USDT.\nI’ve seen statement thrown around like “CBDC will render Bitcoin…",
  "data/reddit-crypto/r/CryptoCurrency/comments/sulh9e/serious_how_many_of_you_are_over_invested_and.json": "Title says it all! I'm not interested in how much you invested since you are\nalready invested but why did you over leveraged yourself in crypto?\n\nDid you do so to have a shot at buying your dream house, retire early and enjoy\nlife delicacies?\n\nA hedge against inflation and hate that your money in…",
  "data/reddit-crypto/r/CryptoCurrency/comments/sunvhd/this_sub_doesnt_get_nfts.json": "Because most people here haven’t made it yet.\n\nWhenever I see post like these\n\n> \"The concept of NFTs is valuable. But a JPEG is not worth millions of\n> dollars.\"\n> \n> https://np.reddit.com/r/CryptoCurrency/comments/sib6ur/the_concept_of_nfts_is_valuable_but_a_jpeg_is_not/\n> \n> \"NFT is easily the…",
  "data/reddit-crypto/r/CryptoCurrency/comments/su9fy5/ccip027_comments_with_negative_karma_should_not.json": "PROBLEM:\n\nCCIP-001\n[https://np.reddit.com/r/CryptoCurrency/comments/k12wnd/moon_proposal_double_comment_karma/]\nwas a governance poll that passed over a year ago and resulted in doubling the\nkarma earned by comments relative to posts. However a consequence of this poll\nis that comments with…",
  "data/reddit-crypto/r/Bitcoin/comments/surdhw/ukraine_just_legalised_bitcoin.json": "https://twitter.com/Blockworks_/status/1494328584969723905\n\nhttp://w1.c1.rada.gov.ua/pls/radan_gs09/ns_sh?id_fakt=3658&nom_s=7",
  "data/reddit-crypto/r/CryptoCurrency/comments/sunfok/many_people_are_hyped_about_the_ethbtc_flippening.json": "It’s actually happening right before our eyes right now. USDC’s growth in market\ncap is much higher than Tether’s.\n\nSo while USDT still has a larger market cap than USDC, it won’t stay like that\nfor long (most probably end of this year if USDC maintains this pace of growth)\n\nThe prospect of USDC…",
  "data/reddit-crypto/r/CryptoCurrency/comments/suvp7b/hey_remember_the_guy_who_sold_10k_bitcoins_for_2.json": "> offering 10 000 bitcoins in exchange for some pizza and somebody there said\n> hey i'll you know i'll take you up on that offer so i sent him the 10 000\n> bitcoin i said okay here it is you know i'm waiting for my pizza and you know\n> he phoned it in he paid with his credit card and the pizza…",
  "data/reddit-crypto/r/CryptoCurrency/comments/suyjvb/i_cracked_the_wallet_seed_phrase_in_cryptocoms.json": "TLDR; The replacement words to the commercial seed phrase are in the title and\nbasically define Lebron's life.\n\nHere is the seed phrase that showed up in the commercial\n\n\n\nhttps://preview.redd.it/ulrafaik5gi81.png?width=293&format=png&auto=webp&s=33bb6d8393876f4396a8d31a5acef7aa67eef969\n\nOf those…",
  "data/reddit-crypto/r/CryptoCurrency/comments/sv0b96/the_longer_you_are_in_crypto_the_less_you_care.json": "Just about roughly a year ago I entered crypto. And to be honest as most I just\nwent in for money, to get rich quick. Back then I did not knew shit about what\ncrypto actually is. The most I knew was that crypto is a payment system that is\nkind of anti government (decentralized).\n\nOver that one year…",
  "data/reddit-crypto/r/CryptoCurrency/comments/suyrvc/el_salvador_started_using_bitcoin_arizona_trying.json": "EVERY TIME there is good news about bitcoin its in the red. Is this not proof\nthat the whole market is manipulated by something other than adoption? Think\nabout every time there has been good or GREAT news about bitcoin. Its almost\nALWAYS red. At this point if amazon took bitcoin today I can see…",
  "data/reddit-crypto/r/CryptoCurrency/comments/surcvq/expecting_the_average_person_to_understand_crypto.json": "Title sums it up, people on this sub really need to give up on the idea that\npeople can/should/will understand crypto (and don't even get me started on\ntrying to explain defi to them as I'm sure most people on this sub would\nstruggle to do so!)\n\nThe average person still doesn't understand that they…",
  "data/reddit-crypto/r/CryptoCurrency/comments/sv3r8v/how_do_you_guys_know_so_much_about_crypto.json": "Okay so I'm just getting into crypto, and this sub has been AMAZING help! None\nof my girlfriends know anything about it, so I haven't been able to talk to\nanyone about it. I've earned a little bit of money from modeling and other\nrelated gigs, so I've built up a very small but steadily growing…",
  "data/reddit-crypto/r/CryptoCurrency/comments/sut1h2/ccip028_adjust_the_criteria_for_successful.json": "Problem\n\nWe are currently using the default criteria for all governance polls, which says\na poll passes if the Moons voting in favor represent over 50% of the\nparticipating moons and exceed the Decision Threshold\n[https://www.reddit.com/community-points/documentation/reputation-and…",
  "data/reddit-crypto/r/CryptoCurrency/comments/svahi5/i_bought_1k_of_the_top_10_cryptos_on_january_1st.json": "EXPERIMENT – Tracking 2018 Top Ten Cryptocurrencies – Month Forty-Nine – UP 4%\n[https://preview.redd.it/vp6ri27e2ji81.png?width=666&format=png&auto=webp&s=490548527c182d98a6a5b2bf68952307eea6b792]\n\nFind the full blog post with all the tables here\n[https://toptencryptoindexfund.com/tracking-2018-top…",
  "data/reddit-crypto/r/CryptoCurrency/comments/svcqaj/kraken_ceo_jesse_powell_if_you_worried_about_your.json": "There was a post by Kraken founder about new Canadian legislation and I saw one\nvery interesting and alarming reply on the comments. One of his followers just\nreplied Jesse that Kraken may be put in position to freeze our assets without\njudicial consent and will probably comply to that request.…",
  "data/reddit-crypto/r/CryptoCurrency/comments/sv4j3i/does_crypto_move_with_the_stock_market_i_did_a.json": "We hear a lot about how bitcoin moves with the US Market so here I ran a detail\nanalysis. Word of caution though, correlation does not imply causality so if two\nthings correlating we can't say for sure if they are influencing each other or\nis there another hidden variable.\n\nMethod: I download all…",
  "data/reddit-crypto/r/CryptoCurrency/comments/svk9r4/you_guys_are_sometimes_doing_the_adult_version_of.json": "Less than an hour ago, someone on here posted a story\n[https://np.reddit.com/r/CryptoCurrency/comments/svj6wk/bitcoin_miners_revived_a_dying_coal_plant_then/]\nfrom the Guardian titled \"Bitcoin miners revived a dying coal plant – then CO2\nemissions soared\". It's an interesting story, you should read…",
  "data/reddit-crypto/r/CryptoCurrency/comments/svqf0a/the_mere_fact_that_justin_trudeau_can_freeze_the.json": "Not trying to get political or anything, it's just really worrying when the\ngovernment can just freeze your assets, your money whenever they will it. I\ndon't believe that should be an option for anyone to be able to do and it holds\ntoo much undeserved power over the people.\n\nStoring a password well…",
  "data/reddit-crypto/r/CryptoCurrency/comments/svowxe/we_need_to_stop_calling_every_sign_we_see_bullish.json": "Please.\n\nIt does not make any sense.\n\nEverything today seem bullish.\n\nIs it something about Warren Buffer or perhaps John Cena, or Elon musk tweeted\nsomething?\n\nIt does not mean that it is a bullish sign so we really need to stop.\n\nLooks like we will say anything today is \"bullish\" when it is not.…",
  "data/reddit-crypto/r/CryptoCurrency/comments/svpu2p/bitcoin_was_17k_in_december_2017_a_year_later_it.json": "Patience is so important.\n\nMost people in crypto are looking for a fast way to get financial freedom and\nthat does happen but it’s all about timing.\n\nBitcoin can go up 1000% in just a year but before that it’ll be slowly\ndecreasing 10% every other week. The key is to be patient.\n\nKeep DCAing and…",
  "data/reddit-crypto/r/CryptoCurrency/comments/svuk1l/i_have_seen_so_many_people_say_buy_the_dip_but_i.json": "Previously I have written about DCA strategy + buy the dip. The DCA part does\nthe job of taking out the emotions, and the “buy the dip” is to utilize the time\nto make your cost basis even lower (DCA down). In a time like this, it’s the\nworst idea to sell low. If you want to sell and take profits,…",
  "data/reddit-crypto/r/Bitcoin/comments/svrdlr/wife_wants_me_to_stop_dcaing_and_sell_all_my.json": "I had to pretend like I hadnt seen the Munger clip all over bitcoin twitter. She\nalso then went on to say crypto is in a huge bubble and it will fizzle out and\ngold will last a 1000 years. I dunno all my instincts tell me otherwise. Any\nadvice on how to deal with this?",
  "data/reddit-crypto/r/CryptoCurrency/comments/svqtg8/anyone_see_the_new_tezos_nft_launchpad.json": "Tezos got\n[https://www.nftgators.com/smartlink-to-offer-exclusive-curated-nfts-as-it-launches-first-tezos-nft-launchpad/]\nits first NFT launchpad last week and its got some perks with it. I’m not sure\nwhat they mean by “exclusively curated NFT” launches (on what basis is it\ncurated?) but given that…",
  "data/reddit-crypto/r/CryptoCurrency/comments/sw0y2d/i_underestimated_crypto_reddit.json": "This subreddit, and frankly reddit, and the people who come on reddit, are too\nanti-libertarian, too anti-cypher punk, too anti-convoy, and too pro-KYC, you\nmake mental gymnastics that cannot be sustained coherently with crypto, it\nendangers the industry and the intended point of the technology,…",
  "data/reddit-crypto/r/CryptoCurrency/comments/svvkge/crypto_is_not_designed_to_be_free_of_any_law_nor.json": "Cryptocurrency was meant to give financial power back to individuals and reduce\nthe reliance on banks/other industries that routinely profit off of people using\ntheir money. It was designed to prevent large institutions from being “too big\nto fail” and being bailed out when economic hardships…",
  "data/reddit-crypto/r/CryptoCurrency/comments/sw3sc9/you_guys_arent_seeing_things_clearly.json": "For those of you that dont know, this is Peter Lynch:\n\n\n\nhttps://preview.redd.it/cdr62ff7jqi81.png?width=960&format=png&auto=webp&s=f5752413a7cf7e6d0ddfa796b830cfd24f0baa18\n\nHe's a legendary investor at Wall Street.\nThis man was named the head of the Magellan Fund at 1977 when he was 33 years\nold,…",
  "data/reddit-crypto/r/CryptoCurrency/comments/sw7bxf/nunchuk_bitcoin_wallet_epic_response_to_canadian.json": "Yesterday, the Ontario Superior Court of Justice sent a Mareva Injunction to\nNunchuk Bitcoin wallet software provider on behalf of the Canadian government.\n\nNunchuk was ordered to freeze and disclose information about the assets involved\nin the Freedom Convoy movement. Nunchuk responded by email…",
  "data/reddit-crypto/r/CryptoCurrency/comments/swaz33/the_white_hat_hacker_who_discovered_a_critical.json": "https://twitter.com/tree_of_alpha/status/1494951540339187714?s=21\n\nFor context this is the account of Mr. White Hat. The vulnerability in question\ncould have allowed the white hat hacker to change the order prices of\ncryptocureencies listed on Coinbase (think he can out any price for any crypto\nhe…",
  "data/reddit-crypto/r/CryptoCurrency/comments/swavd3/i_memorized_my_seed_phrase.json": "I currently have a chunk of ETH and BTC in a hardware wallet, and have memorized\nthe seed phrase. All physical copies of the seed phrase are destroyed. This\nmoney is now mine and no one else's. I could be stripped of all my possessions,\nthrown in jail, declared an enemy of the state etc... but as…",
  "data/reddit-crypto/r/CryptoCurrency/comments/swdeks/us_fed_closes_loophole_that_allowed_their.json": "I feel like all I do on here anymore is rant, but seriously? I am not from the\nUS, so not an expert on all of this, but quick summary what happened:\n\nLast October, it became public, that some Fed officials had been trading stocks\nand bonds that could be influenced at least indirectly by their…",
  "data/reddit-crypto/r/CryptoCurrency/comments/swggxe/i_am_sure_90_of_all_nft_and_metaverse_sales_are.json": "It is extremely easy to inflate a price of any NFT. Create two wallets, sell\nwith one, buy with another. You just set a price for your own NFT!\n\nThis alone is proof enough for me to doubt all sales on every NFT marketplace\nand you should too. I would stay away from all NFTs and especially…",
  "data/reddit-crypto/r/Bitcoin/comments/swd8vm/im_going_to_help_my_husband_live_his_bitcoin.json": "I’d like to first add that I don’t know much about Bitcoin mining but I’m\nlearning. My husband has been investing for several years and I was skeptical at\nfirst.\n\nHe has always talked about how he’d love to Bitcoin mine on a small scale.\nAround December, I told him we should do it. Our current home…",
  "data/reddit-crypto/r/CryptoCurrency/comments/swoel1/opensea_is_getting_exploited_right_now.json": "Opensea is getting exploited, right now\n\nReports/rumors that people who migrated their listings to their new contract are\ngetting their nfts drained right now. Doodle, Azukis, NFT Worlds, BAYC... all\nworth over 10ETH+\n\nOpensea have been advertising at the top of their website to users so they…",
  "data/reddit-crypto/r/CryptoCurrency/comments/swqo7a/revoke_opensea_access_now_opensea_is_getting.json": "This is urgent. Open sea is being hacked RIGHT NOW and peoples accounts are\ngetting drained! Over 300 ETH has been taken already!\n\nThe attacker hacker is selling the stolen NFTs to others to pull ETH out -\nCurrently they have over 300 ETH in their wallet! AND GROWING!\n\nMake sure to REVOKE ALL OS…",
  "data/reddit-crypto/r/CryptoCurrency/comments/swjdap/do_you_believe_that_btc_can_reach_1_million_in_10.json": "I know no one knows shit about fuck. But do you believe that bitcoin will reach\n1 million in 10 years time given all the slow adoption of BTC in every company.\nFidelity, Cathy woods and prominent billionaires like Michael saylors thinks and\nbelieve that BTC will reach around that price target.…",
  "data/reddit-crypto/r/CryptoCurrency/comments/swvr4p/avalanche_network_is_sweating_like_a_pig_now_with.json": "Remember when MATIC was sweating like a pig just from one sunflower game on its\nnetwork? ..well same shit is repeating now with Avalanche. According to the\nusers fees are even higher than ETH right now\n\nUser reports over 14$ gas fee for…",
  "data/reddit-crypto/r/CryptoCurrency/comments/swign1/an_nft_project_named_squiggles_bought_their_own.json": "An NFT project named Squiggles came under a bad reputation after it was linked\nto a network of NFT scams. This resulted in their project's hype almost dying\njust before the release of their NFT project (It later got removed from Open\nSea). Yet after a few hours of release they still made about 7…",
  "data/reddit-crypto/r/CryptoCurrency/comments/swnsow/crypto_taxes_are_a_shit_show.json": "(US Taxes) I’ve tried multiple tax tools trying to get my taxes straight this\nyear and none of them are coming through, either the API fails to load or CSV\nwon’t import.\n\nI have used around 10 exchanges and some of them have hundreds of transactions I\nneed to correct plus these dust drops in my…",
  "data/reddit-crypto/r/CryptoCurrency/comments/swz40j/just_got_rugged_half_my_folio_gone.json": "Just woke up in the morning, found out my coin exit-scammed. I believed in the\nproject, it wasn't a shitty dog-coin, it was a decentralized casino, which I\nthought was a novel idea. Today, the team announced they're ceasing operations,\nprice's dropped 95%, can't even withdraw coins from the staking…",
  "data/reddit-crypto/r/Bitcoin/comments/sx3zs1/i_finally_understand_bitcoin.json": "I finally understand the purpose of Bitcoin. About two weeks ago I recently won\na little bit of money gambling and couldn’t transfer it to my bank, I could\nhowever withdraw it in BTC and was just going to set up an account on Coinbase\nand withdraw it when it hit. I didn’t know anything about BTC or…",
  "data/reddit-crypto/r/CryptoCurrency/comments/sx3qhn/dont_get_too_pressed_on_eth20_vitalik_himself.json": "Chill out and take your time cause its most probable that ETH2.0 in its final\nform will take years to be completed.\n\nThis doesn’t mean that we’ll have to wait 6 years to have a highly performing\nEthereum network.\n\nThe main focus, as Vitalik stated, should be 2 things:\n\n• The move to PoS\n\n•…",
  "data/reddit-crypto/r/CryptoCurrency/comments/sx3yhs/i_tried_cardano_defi_for_the_first_time_and_it.json": "Look I'm not someone who's just dipping their toes into DeFi for the first time,\nI've used other networks and various protocols and I want to know what went so\nwrong with my first Cardano experience. So please keep an open mind.\n\nHere's my story:\n\nInstalled Nami wallet.\n\nStarted a withdrawal of…",
  "data/reddit-crypto/r/CryptoCurrency/comments/sx71xo/you_should_definitely_not_listen_to_this_sub.json": "As we are currently having some major downtrends in the crypto market its way\nmore important to stick to your plan than ever. But also major movements are the\ntime where this sub is overly bipolar.\n\nThis sub is something way more volatile than crypto. Any minor movement causes a\ncomplete shift from…",
  "data/reddit-crypto/r/Bitcoin/comments/sx4a9b/there_is_a_massive_psyop_going_on_to_poison_the.json": "They’re here. They’re trying to divide the community, splinter it, make it\neasier to control. Be vigilant.\n\nThis will be downvoted but much like the saying “The Revolution will not be\ntelevised”, “The truth will not be upvoted”\n\nBe vigilant friends. Bitcoin is not political. Bitcoin is for…",
  "data/reddit-crypto/r/Bitcoin/comments/swr7x3/the_more_i_learn_the_more_i_think_i_should.json": "My crypto investments are primarily BTC and ETH, but a solid chunk in alts as I\nthought a few of them had good potential for short-term gains. However, the more\nI learn about Bitcoin the more I want to go all in on BTC especially with the\nrecent political climate. My plan is to hold long-term (10+…",
  "data/reddit-crypto/r/CryptoCurrency/comments/sx9agt/nobody_blames_fiat_when_criminals_launder_money.json": "The same thing was happening during the beginnings of the internet era. If\nsomeone was kidnapped or murdered by someone they met on the internet, media\nblamed the internet.\n\nDecades later, people are over it because internet is a necessary part of their\nlives.\n\nThe world’s ‘regulated’ banks are…",
  "data/reddit-crypto/r/CryptoCurrency/comments/sx561g/a_coin_named_polyroll_lost_100_of_its_value_in.json": "So in less than 24 hours, a polygon-chain coin named Polyroll just rug pulled\n90,000 of its holders. Im repeating, 90 freaking thousand holders. What worrying\nis that the project (scam) was backed by ChainLink itself. They even tweeted it\non their official twitter about this coin and how this coin…",
  "data/reddit-crypto/r/CryptoCurrency/comments/sx2zxk/banano_team_quietly_passes_1_trillion_points_with.json": "I feel like this isn't getting enough credit than it deserves.\n\nBanano is a memecoin branch off Nano, but users are given free Banano when\nutilizing Folding @ Home.\n\nFor those that don't know, people can use their computing power to run\nsimulations of protein folding and movement of proteins. This…",
  "data/reddit-crypto/r/CryptoCurrency/comments/swshf5/opensea_nft_hack_explain_thread.json": " 1. 28 days ago the hacker uploads a new smart contract, he already knows well\n    that his goal is to get as many signatures as possible\n\n 2. He starts sending emails with phising websites. They tell you to sign a\n    message to login/migrate to the new Opensea smart contract\n\nInstead you are…",
  "data/reddit-crypto/r/CryptoCurrency/comments/sxc5di/credit_suisse_whistleblower_leak_bank_facilitated.json": "A whistleblower has leaked account data from Credit Suisse, which shows that\nsome of the most notorious criminals across the world maintain accounts with the\nbank, including alleged human traffickers, Venezuela officials who looted the\ncountry at the same time the people there faced massive…",
  "data/reddit-crypto/r/CryptoCurrency/comments/sxcrbv/last_week_it_was_all_bull_run_is_back_on_and_now.json": "Basically what the title says, last week many Americans were super bullish on\nthe Super Bowl and all the crypto ads where the “bull run was back on”. People\nstarted to get the BTC to 100 or 200k posts ready to go and any potential war\nbetween russia and Ukraine were dismissed as FUD.\n\nFast forward…",
  "data/reddit-crypto/r/CryptoCurrency/comments/sx5fij/what_do_you_say_to_people_who_dismiss_crypto_as_a.json": "I'll be honest, I'm always a bit flustered when this one gets levelled, because\nI never know where to begin in trying to debunk it. This is mainly because there\nare absolutely aspects of crypto investing that give off Ponzi vibes to the\nuninitiated - just look at all those rugged tokens, even the…",
  "data/reddit-crypto/r/Bitcoin/comments/sxe145/bitcoin_saved_my_life.json": "This happened about a week ago.\n\nWas heading home from a little road trip and had to stop around about 2 hours\naway from home for gas. Had the wife and kids with me. Went to fill up and my\ncards keep getting declined. Try to call the bank and they had froze my accounts\ndue to \"suspected fraudulent…",
  "data/reddit-crypto/r/CryptoCurrency/comments/sxp4n2/vitalik_buterin_confirms_bear_market_by_showing.json": "Vitalik had earlier hinted that the crypto community would welcome a long\nwinter. He said that crypto could benefit from a crash as short term speculative\nattention is not good in the long run, while builders could benefit from less\nattention from speculators.\n\nNow he has made his strongest…",
  "data/reddit-crypto/r/CryptoCurrency/comments/sxrt6h/after_losing_more_than_100k_in_leverage_and_spot.json": "Not going to be a long post fellas, but I've had my fair share of buying Doge at\n0.69 on Spot, various leverage trades on random coins, followed TG channels for\n\"signals\", needless to say, I never knew when to sell or when to buy.\n\nThere is an indicator called \"Bitcoin fear and greed…",
  "data/reddit-crypto/r/CryptoCurrency/comments/sxtqbf/dude_posts_on_rbitcoin_that_btc_saved_his_life.json": "Okay, the story\n[https://np.reddit.com/r/Bitcoin/comments/sxe145/bitcoin_saved_my_life/] is\nreally tragic, so only read if you are emotionally prepared. OP was on a little\nroad trip with his family and when he wanted to get gas his card didn't work. He\ncalled the bank and\n\n> they had froze my…",
  "data/reddit-crypto/r/CryptoCurrency/comments/sxsdqp/avalanchebased_protocol_reportedly_rugpulled.json": "I really don't understand how this is legal. Atom Protocol, was rug pulled\nwithin a day of launching. The developers posted a message on Twitter before\ndeleting all its social…",
  "data/reddit-crypto/r/CryptoCurrency/comments/sxy32g/crypto_is_not_decentralized.json": "This is really aimed specifically at the BTC maxis, but holds true for pretty\nmuch every project out there. Decentralization was the point, right? Well, it\ndidn't work.\n\nUsing BTC as the example: the proof of work concept points it towards a\ndecentralized concept - but in actual practice, it's…",
  "data/reddit-crypto/r/CryptoCurrency/comments/sxuulh/i_am_intrigued_by_bidens_executive_order_on_crypto.json": "As many of you know Biden is expected to sign an executive order on crypto\nregulation this week. I believe this is nothing but great news. Some of you\nright about now are probably thinking I am crazy because “regulation” is never a\ngood thing. But in this case it is, or should I say, could be.…",
  "data/reddit-crypto/r/CryptoCurrency/comments/sy4y4g/beginners_guide_to_cryptocurrency_all_you_need_to.json": "Hi all! This is going to be a VERY long post, I did my best to explain the\nthings I struggled with at the beginning of my Crypto journey. I am not an\nexpert by any means, but I feel I can provide valuable information to those\nnewer than me who are trying to get started but are overwhelmed by the…",
  "data/reddit-crypto/r/CryptoCurrency/comments/sydqg4/remember_the_guy_who_was_a_dogecoin_millionaire.json": "Remember the guy who was a dogecoin millionaire?\n\nThe guy got everything that he owns, even borrowed money from this parents\n(cleaning lady/truck driver) and put $250k in dogecoin at 0.05cents. Basically,\neverything that you have ever read in this subreddit of what not to do, he did\nit. Then, he…",
  "data/reddit-crypto/r/CryptoCurrency/comments/syhh08/why_is_everyone_mocking_the_dogecoin_millionare.json": "Recent posts here have mocked outright the guy who took a risk and made a\nmillion dollars on dogecoin.\n\nSo what if he is down from that million? Could it hurt anyone to congratulate\nthe guy instead of poking fun at his misfortune? I mean he is still up 250k and\nnever sold. I don't know about you,…",
  "data/reddit-crypto/r/CryptoCurrency/comments/sybsvu/an_artist_blew_up_a_250000_lamborghini_to_protest.json": "An artist, Shl0ms, blew up a $250,000 Lamborghini to protest against crypto\nculture.\nThe artist said, “This technology is incredibly promising, there are so many\ngood things we can do with it but there are so many terrible things being done\nwith it,”\n\nShl0ms said he chose blow up a Lambo because it…",
  "data/reddit-crypto/r/CryptoCurrency/comments/syp7q6/this_dude_made_an_alternative_reddit_on_a.json": "I’ve accidentally found out about this guy a few days ago and it’s quite mind\nblowing. \n\nDeveloper called Esteban Abaora has developed a serverless, adminless and\ndecentralized Reddit alternative that will run on a blockchain kind of system\n( it will actually use \"public key based addressing\" and a…",
  "data/reddit-crypto/r/CryptoCurrency/comments/sypyqs/several_altcoins_have_slipped_into_their_buy.json": "A leading crypto analytics firm says that the latest crypto market dip has\nplaced four altcoins in the ideal buying range.\n\nAccording to Santiment, 1inch (1INCH)\n[https://swapzone.io/currencies/1inch?utm_source=reddit&utm_medium=social&utm_campaign=promo],\nLoopring…",
  "data/reddit-crypto/r/CryptoCurrency/comments/syunqu/someone_is_impersonating_vitalik_on_instagram_its.json": "There's an account on IG called \"buterin_official\" with 1 MILLION FOLLOWERS\nthat's promoting a scam THROUGH INSTAGRAM PAID ADS\n\nI repeat:\n\n\n1 MILLION FOLLOWERS\n\n\n\nI can't believe this passed the instagram ads…",
  "data/reddit-crypto/r/Bitcoin/comments/syrx06/be_mentally_ready.json": "With Russia's ongoing invasion of Ukraine, the U.S and EU are imposing financial\nsanctions on Russia and will essentially attempt to exclude them from the\ninternational economy. I think Russia's response to this is pretty obvious and\ntelegraphed, they are going to embrace Bitcoin so that their…",
  "data/reddit-crypto/r/CryptoCurrency/comments/sz0fgu/most_of_you_who_bought_nfts_for_future_profits.json": "I know that NFTs are not just JPGs.\n\nI know some NFTs are art.\n\nI know that traditional art could be useless as well.\n\nI know that some people made good money from that.\n\nBut most of them are just empty promises for future gains.\n\nUnlike buying cryptocurrency which you can actually sell or pay with…",
  "data/reddit-crypto/r/CryptoCurrency/comments/syx42w/bitcoin_wallet_maker_gets_order_from_canada_to.json": "The situation in Canada is interesting for the crypto community. Namely, it\nshows how a government deals with cryptocurrencies like bitcoin (BTC) in a\nsituation where it is trying to seize financial resources. And in recent days it\nbecame clear that Canadian authorities are not so sure what to do…",
  "data/reddit-crypto/r/CryptoCurrency/comments/sysldq/fed_officials_banned_from_trading.json": "As you've probably seen the last days, there has been a headline going around\nthe internet: FED officials are banned from trading stocks, bonds and also\ncryptocurrencies.\n\nObviously there were many complaints and many that thought this should have been\nintroduced long time ago.\n\nI personally think…",
  "data/reddit-crypto/r/CryptoCurrency/comments/syhnnc/this_is_the_kind_of_protection_the_cryptosphere.json": "https://news.bitcoin.com/uk-police-return-5-4-million-to-cryptocurrency-fraud-victims/\n\nCrypto related scams are a dime a dozen and the media also attempts to blow up\nevery single one of em so that these scams have become a major stumbling block\nfor our progress.\n\nThe article above talks about how…",
  "data/reddit-crypto/r/CryptoCurrency/comments/sz29b9/just_for_fun_i_made_a_program_that_predicts_the.json": "I was bored trying to think of a python program to write and I decided to write\na bitcoin predicting program.\n\nHow it works is it looks at the price graph for the last N (cycling through\ndifferent values of N) days then tries to find the time the most similar pattern\nin price occurred in the past…",
  "data/reddit-crypto/r/CryptoCurrency/comments/sz48hw/the_market_is_red_your_investments_are_down_so.json": "> Gods Unchained is a blockchain trading card game that takes some of the best\n> features from Hearthstone, but has a unique mana system and an original favor\n> feature. It allows you to earn cards and trinkets, which you can then sell on\n> the marketplace. NFTs are stored on the Ethereum and…",
  "data/reddit-crypto/r/Bitcoin/comments/syplbh/well_it_has_been_a_long_hard_slog_but_i_am.json": "Been buying the dips as much as I could and finally reached my goal of owning 1\nBTC. Now on the the next goal of owning 2.",
  "data/reddit-crypto/r/CryptoCurrency/comments/szb56a/crypto_has_absolutely_ruined_stocks_for_me.json": "Crypto has absolutely destroyed my incentive to even look at my stock portfolio.\n\nBefore crypto I was a major stocks and options investor, who bought high\ndividend aristocrats like AT&T, then sold covered calls whenever there was an\nuptick in price on a relatively stable asset. 10% dividends plus…",
  "data/reddit-crypto/r/CryptoCurrency/comments/szjzc3/i_bought_1k_of_the_top_10_cryptos_on_january_1st.json": "EXPERIMENT - Tracking Top 10 Cryptos Of 2022 - Month One – Down -24%\n[https://preview.redd.it/llcfnowpllj81.png?width=666&format=png&auto=webp&s=4d72f368169047684e5d86e400f26521c8984887]\n\nFind the full blog post with all the tables here\n[https://toptencryptoindexfund.com/tracking-2022-top-10…",
  "data/reddit-crypto/r/CryptoCurrency/comments/sziozv/reality_check_dont_go_into_bitcoin_expecting_to.json": "We’ve all seen how the “100k EOY” influencers got rekt as we entered 2022.\n\nEven still, if Bitcoin reaches 100k that’s only 2x which is super impressive\ndon’t get me wrong, but its not enough to make you a millionaire.\n\nMost people you see who made this much money in the crypto space basically…",
  "data/reddit-crypto/r/Bitcoin/comments/szm0ac/how_do_i_wash_my_bitcoin.json": "So I’ve been stacking for a couple years now, pretty much only buying through\nCoinbase. With the recent attempts of regulation in both the US and Canada, I\nwant my crypto to be truly anonymous. How should I go about moving my Bitcoin\nfrom my current wallet to a non-kyc exchange so that I can “wash”…",
  "data/reddit-crypto/r/CryptoCurrency/comments/szoeqp/people_claiming_that_holding_is_the_easiest_thing.json": "The one thing that is said the most in crypto is HODL. Many talk about how this\nstrategy is the easiest thing and by holding rly long-term they will easily make\na ton of profit. But those are also just the people that get shacked out by some\nshort-term movement in crypto.\n\nEspecially during such…",
  "data/reddit-crypto/r/CryptoCurrency/comments/sznpv1/xrp_cant_be_kicked_out_of_top_10_by_market_cap_no.json": "Man, I remember this sub back in December '20, so many memes appearing with that\ndude laughing at the funeral near the tombstone with xR(I)P. The entire crypto\ntwitter going wild: \"XRP gonna drop out of top ten by the end of January\n'21'...\"\n\nThe \"centralized\" crap finally going out of the door,…",
  "data/reddit-crypto/r/Bitcoin/comments/szh7rk/bitcoin_is_the_freedom_test.json": "Any politician, political party, or government that is against or even\nambivalent about self-custody of bitcoin is anti-freedom and anti-democracy.\nPeriod.\n\nWhining about environmental concerns, money laundering potential, etc is just\nmisdirection. Don't fall for it. This test is simple. This test…",
  "data/reddit-crypto/r/Bitcoin/comments/szm39a/european_union_plans_to_forbid_bitcoin_and_proof.json": "So, this just happened:\nhttps://www.btc-echo.de/news/bitcoin-spd-gruene-und-linke-fordern-verbot-in-der-eu-135678/\n\nAutomated Translation:\n\nCramming crypto regulation. The European Parliament wants to prohibit the\nprovision of crypto services based on \"environmentally unsustainable…",
  "data/reddit-crypto/r/CryptoCurrency/comments/szk86n/cryptocom_kinda_sucks.json": "There’s a lot of CDC fanboys on Reddit at the moment so this will get downvoted\ninto obscurity and probably not seen by many, but I want to talk about my\nexperience anyway.\n\nI started using them about 20 days ago and have been buying around $20 usd of\ncrypto per day to farm their loot boxes, plus…",
  "data/reddit-crypto/r/CryptoCurrency/comments/szkgsr/just_made_11_off_leverage_trading_ask_me_anything.json": "Yes, I did the thing that everyone here in this sub is afraid of. I did the\nthing that no one else could. I went 25x into a certain coin and made an\nenormous 1.1$ profit. Now I can finally add professional leverage trader to my\nresume and apply for a job at some bug bank then go to a…",
  "data/reddit-crypto/r/CryptoCurrency/comments/t02blf/russia_started_bombing_all_over_ukraine_double.json": "Russia started bombing weak spots all around Ukraine during sunrise. So that\nmeans there is a full scale war now in the country. That also means worldwide\neconomic tensions caused by further supply chain shortages, war effort, and\noverall volatility from the unknown.\n\nA reminder for crypto new…",
  "data/reddit-crypto/r/CryptoCurrency/comments/t02cw3/do_not_buy_any_crypto_or_stocks_yet_straight.json": "I don't even need to say any context to the title, if you are smart enough you\nwill crack it! You can't even call it an FUD anymore. This is going for a huge\nmess and the market has fluctuated to dump huge way. Nobody knows how this will\ngo overtime, and this is my advice that look for market to…",
  "data/reddit-crypto/r/CryptoCurrency/comments/t009kf/this_russia_shit_is_out_of_control_any_russians.json": "We've all seen how this news is affecting crypto - as Ukraine keeps getting\npushed further and further toward being conquered by Putin all of our favorite\nassets are being driven down and we are all losing our asses unless we had the\nforesight to short a month ago.\n\nHere are a few questions I would…",
  "data/reddit-crypto/r/CryptoCurrency/comments/t07z90/dont_lump_sum_into_this_dip_this_is_probably_not.json": "Every time I see a recommendation on this subreddit to 'buy the dip', I remind\npeople that we don't know if this is the bottom, and that you should be patient\n- don't invest all your money at once, do it gradually. I've gained quite a few\ndownvotes for commenting this, but I think it is solid…",
  "data/reddit-crypto/r/CryptoCurrency/comments/t0a7m4/russia_invaded_ukraine_and_the_markets_were_quick.json": "As you can see, the situation with cryptocurrencies changes from hour to hour\nduring this crisis, which is extremely difficult and unfavorable. ETH falls 10%\nas a result of a larger market decline. This post on CryptoPotato caught my\nattention because I've been investing in ETH for a few…",
  "data/reddit-crypto/r/CryptoCurrency/comments/szo0b6/some_people_still_dont_realize_that_these_nft.json": "People seriously don’t realize that the vast majority of these NFTs are\nartificially overpriced by the owners himself who goes ahead and sells it to,\nyou guess it, himself again.\n\nThe reason is simply to raise more hype around the NFT making it more desirable\nto attain.\n\nIt’s such a shame how the…",
  "data/reddit-crypto/r/CryptoCurrency/comments/t0j97v/crypto_failed_to_actually_be_a_hedge_asset_during.json": "Look at this graph. While stock market and crypto crashed this morning, gold\nbecame more valuable. Crypto was supposed to be the safe haven during a time of\ncrises.\n\n\n\nhttps://preview.redd.it/21m3bmz31uj81.jpg?width=736&format=pjpg&auto=webp&s=872d806b02f8e4dd6575699961877e3ef41509cb\n\nIt's…",
  "data/reddit-crypto/r/CryptoCurrency/comments/t0gm6q/chinas_supreme_court_just_declared_bitcoin_illegal.json": "The ruling paves the way for violators to be criminally prosecuted, with a\npunishment of up to 10 years in prison and fines of up to $79,000.\n\nChina's Supreme Court ruled Thursday that virtual asset transactions constitute\n\"illegal fundraising,\" paving the way for judicial prosecution of the…",
  "data/reddit-crypto/r/CryptoCurrency/comments/t0hy9u/announcement_flexpoolio_is_halting_all_service_to.json": "As everyone has heard, Russia has launched a surprise invasion of Ukraine. The\nworld is again faced with war, which could signal the next and possibly final\nwar. This may be the biggest war since WW2, bigger than any of us, and goes\nbeyond politics or nationality. This is a war at a time of peace…",
  "data/reddit-crypto/r/CryptoCurrency/comments/t0acw9/people_telling_you_to_not_buy_the_dip_right_now.json": "Right now the narrative set by the front page is \"Don't buy the dip, you may be\ncatching a falling knife\".\n\nYeah, we are not going to wait when we have a chance to get our averages down.\nYes we are not dumb, we are not going to throw everything at the market BUT we\nare going to buy and we may keep…",
  "data/reddit-crypto/r/Bitcoin/comments/t09bwr/remember_when_that_worldwide_pandemic_happened.json": "Old mate shiney gold coin with a B in the middle dropped to 3k....\nwouldnt you have liked to have thrown 100k at it then,,,,\n\nwelcome to your second chance - best of luck in the coming months.",
  "data/reddit-crypto/r/CryptoCurrency/comments/t0pmrf/ftx_gives_25_to_every_ukrainian_on_the_platform.json": "FTX gives $25 to every Ukrainian on the platform\n\nFTX, a major cryptocurrency exchange, announced on the 25th that it would give\naway $25 to Ukrainian users of the platform. The move follows Russia's invasion\nof Ukraine, which announced a \"special military operation\" on the 24th.\n\nFTX CEO Sam…",
  "data/reddit-crypto/r/CryptoCurrency/comments/t0nm1v/lana_rhoades_has_a_meltdown_over_coffeezillas.json": "https://twitter.com/coffeebreak_YT/status/1496926039313981442\n\nFucks her fans, and then runs off with the money. She even had the audacity to\nbring current events into this.\n\nHere's her Twitter, which is as of now deactivated.\nhttps://twitter.com/LanaRhoades\n\nShoutout to Coffee if he's reading this…",
  "data/reddit-crypto/r/CryptoCurrency/comments/t0l7ib/and_just_like_that_btc_is_back_to_38k_peaking_at.json": "And just like that BTC is back to $38k, peaking at 39.9k. This is higher than\nBTC ($36.5K) was before the war was declared, How many posts did we see\nembracing crypto winter? Telling people not to catch a falling knife? Not to buy\nthe dip because the war will escalate?\n\nI'm not saying the dip is…",
  "data/reddit-crypto/r/CryptoCurrency/comments/t0q8kn/evidence_that_charles_was_involved_in.json": "This is a follow-up to\nhttps://np.reddit.com/r/CryptoCurrency/comments/szv6oc/evidence_that_charlesiohk_was_involved_in/\n\nIn that post, I gave a list of about 150 addresses that connected IOHK's wallet\nto the billion ADA unstaked wallet involved in the SundaeSwap front-running.\nNaturally, I was…",
  "data/reddit-crypto/r/CryptoCurrency/comments/t0k7tb/what_the_hell_is_happening_right_now_sudden.json": "What the hell is just happening right now... I was scrolling through the sub,\nbeing sad and upset in regards to the current Russia/ Ukraine dilemma and\nsuddenly my phone goes rogue and start vibing... Bulls are going crazy and a\nblood bath is turning into fresh Green grass ?\n\nSo, short squeeze,…",
  "data/reddit-crypto/r/CryptoCurrency/comments/t0upoc/if_you_hate_crypto_because_putin_might_use_it_you.json": "In recent comments and opinions from people involved with crypto and also from\npeople not so involved in crypto about how Cryptocurrency's image will be\ntainted if Putin uses it in future.\n\nPutin will likely use Crypto to help circumvent sanctions and ensure he has\nother financial avenues.\n\nBut If…",
  "data/reddit-crypto/r/CryptoCurrency/comments/t11mf4/please_boycott_max_keiser.json": "I made two posts regarding this in the Bitcoin subreddit.\n\nFirst post was downvoted. The second post removed.\n\nIn the Bitcoin community Kasier is seen as a hero to some.\n\nBut in reality he is a hideous human being who is a Putin sympathiser.\n\nHe appears on Russian propaganda mouthpiece RT and spews…",
  "data/reddit-crypto/r/CryptoCurrency/comments/t0xf7k/if_you_think_bitcoin_needs_government_control.json": "In the last weeks I'm seeing a lot of people saying Bitcoin should be somehow\ncontrolled by the US government, because thanks to crypto, Putin could evade\nsanctions. Same things were said about the convoy protest in Canada.\n\nI know most users joined crypto just to make some money, but Bitcoin was…",
  "data/reddit-crypto/r/CryptoCurrency/comments/t15f9f/nba_star_deaaron_fox_ditches_his_nft_project.json": "https://web3isgoinggreat.com/single/2022-02-23-1\n\n> Sacramento Kings player De'Aaron Fox announced his \"SwipaTheFox\" NFT project\n> in mid-December, and the \"high utility NFT collection\" went live on January\n> 15. The project roadmap promised a metaverse basketball court, a scholarship\n> to a…",
  "data/reddit-crypto/r/CryptoCurrency/comments/t19min/one_of_the_top_posts_on_this_sub_is_about_ftx.json": "Many companies are jumping on fhe 'let's help Ukrainians' bandwagon, but not\nbecause they actually give a fuck. Rather, they're seizing the PR initiative to\noffer 'Free calls and SMS' (EE, Vodafone). WhatsApp anyone?\n\nFTX is no different and the free PR they've been receiving for this…",
  "data/reddit-crypto/r/CryptoCurrency/comments/t0vzwx/how_does_everyone_find_36_hours_in_a_day_to.json": "Link MetaMask to your wallet. Bridge ETH to Lambochain. Wrap your ETH with\nBaconWrap and deposit BaconETH into SandwichFinance to acquire ClubSandwich LP\ntokens. Put those into DeliShop to get MeatMarket tokens. Harvest those weekly\nand put those into ButcherShop for further yield which you can…",
  "data/reddit-crypto/r/CryptoCurrency/comments/t1ec1x/no_evidence_that_charles_was_involved_in.json": "https://www.reddit.com/r/CryptoCurrency/comments/t0q8kn/evidence_that_charles_was_involved_in/\n\nhttps://twitter.com/IOHK_Charles/status/1497296939091566593\n\n\n\nHis post:\n\nThis is a follow-up to\nhttps://np.reddit.com/r/CryptoCurrency/comments/szv6oc/evidence_that_charlesiohk_was_involved_in/\n\nIn that…",
  "data/reddit-crypto/r/CryptoCurrency/comments/t12ipm/how_can_i_donate_bitcoincrypto_to_ukraine.json": "Hey. Ive seen news that people have been donating crypto to Ukraine, but I’m\nstruggling to find out how to do it (fairly new to crypto).\n\nCan I donate through and exchange like crypto.com, or do I need to transfer\nthrough a blockchain or what?\n\nIf anyone has any links or information at all on this,…",
  "data/reddit-crypto/r/CryptoCurrency/comments/t1f5oi/sometimes_hodling_is_not_the_answer_what_if_had.json": "You would have taken great profits and also been able to buy back at a lower\nprice.\n\nI know that no one can time the market or predict it, but you simply can’t\nexpect for prices to keep going up infinitely. At some point you’re gonna have\nto make the decision of taking profits and reinvesting later…",
  "data/reddit-crypto/r/CryptoCurrency/comments/t1d4zw/reddits_cryptocurrency_coin_moon_is_worth_over_5x.json": "With everything going on I saw a more lighthearted post about Roblox tokens\nbeing worth more than the Ruble and figured it'd be interesting to see if the\nreddit Moons were worth more. Was actually kind of shocked it was worth around\n5.8x more than a Ruble.\n\nThere's probably easier ways to get money…",
  "data/reddit-crypto/r/CryptoCurrency/comments/t1di3u/if_you_are_looking_to_donate_crypto_to_ukraine.json": "I see a lot of people wanting to support Ukrainians who are currently being\ninvaded by fascist Russia.\n\nFinancially supporting the Ukrainian army or people who are suffering is a\nfantastic and noble thing to do. It’s the right thing do and the least most of\nus can do.\n\nI wish I could buy the…",
  "data/reddit-crypto/r/CryptoCurrency/comments/t1us43/if_youre_looking_for_a_100x_here_then_youre.json": "Almost all 100x picks are by complete luck. It doesn’t matter how good or\ntechnically advanced the project is (as we’ve seen with zero utility coins like\nDoge and Shib).\n\nOnce a project has already gained popularity on subreddits like this one, it’s\nalmost certain that you already missed out on a…",
  "data/reddit-crypto/r/CryptoCurrency/comments/t1x698/you_cant_cry_for_decentralization_and_then_cry.json": "It just doesn’t work like that. It’s either decentralized or it’s not. You don’t\nget to pick and choose when or why it’s decentralized just because you don’t\nagree with the use case.\n\nObviously, it sucks that psychopaths take to crypto to hide illicit activity,\nand that it gets publicized in a way…",
  "data/reddit-crypto/r/CryptoCurrency/comments/t1cr4u/china_will_sentence_over_10_years_in_prison_for.json": "They're shitting their pants. They are afraid of losing their power over their\ncitizens. They are afraid of crypto because they know crypto gives freedom to\nthe people. So they ban it.\n\nWhenever I see a news about a dictator country banning crypto, I feel so bullish\nbecause if dictator countries…",
  "data/reddit-crypto/r/CryptoCurrency/comments/t1vs4y/an_nfts_game_project_pixelmon_raised_over_70.json": "This whole project was a cash grab. They tweeted their NFT project will be 3D\ncharacters which will be interactable. Well take a look at 3D modeled NFTs.\n\nWorth 3 ETH\n[https://preview.redd.it/ym536tcv46k81.jpg?width=976&format=pjpg&auto=webp&s=f137a96c705061038f7e94ae94c7ece89a05da9b]\n\nBored…",
  "data/reddit-crypto/r/CryptoCurrency/comments/t20iz5/vitalik_tweets_to_be_careful_donating_crypto.json": "UPDATE:\n\nThe wallet addresses has been verified and confirmed to be legit, but as always\n- Be careful when sending crypto, since transactions are irreversible\n\n\n\nhttps://etherscan.io/address/0x165CD37b4C644C2921454429E7F9358d18A45e14 - The\nWallet Address has also been tagged by Etherscan as…",
  "data/reddit-crypto/r/CryptoCurrency/comments/t26b00/im_uvladimirputin_and_im_asking_you_to_donate.json": "Ukraine has published official addresses\n[https://twitter.com/Ukraine/status/1497594592438497282?s=20&t=qrsqUrPZKkiucJYWRC54-A]\nto accept donations for much needed supplies. Please, I'm asking you all to dig\ndeep into your wallets and donate whatever you can.\n\nThose of you who've been around the…",
  "data/reddit-crypto/r/CryptoCurrency/comments/t2d7r3/my_kid_sucks_at_art_whats_the_cheapest_and.json": "My kid is a year and a half old. He sucks at art. Well, I mean his art looks\nlike a toddler made it. Which he kind of is, so it actually may be good for his\nage. Fuck if I know.\n\nThe point is; I figure I’m sitting on a goldmine.\n\nAll the recent “art” looks like something I drew in Mario Paint over…",
  "data/reddit-crypto/r/CryptoCurrency/comments/t27wfy/cash_transactions_in_person_are_100_decentralized.json": "Read all of it because it makes one good point here that everyone should\nrealize.\n\nYou can track Bitcoin on a public ledger. That's why when someone who got a few\nmillion stolen from them can call the FBI, and they track the wallet waiting for\na transaction to pop up, and when it does...the person…",
  "data/reddit-crypto/r/Bitcoin/comments/t23jum/runs_on_russian_banks_likely_to_start_on_monday.json": "The solvency of most Russian banks will be at grave risk. The Ruble is in a\nhistoric collapse, and their MOEX stocks can't sustain a drop further; it's down\n60% in 90-days, all while Brent tops $100, which is crazy considering most of\nthe exchange is made of gas giants. Gold is acting…",
  "data/reddit-crypto/r/CryptoCurrency/comments/t2gry8/dont_underestimate_stablecoins_those_20_apys_hit.json": "I see a lot of people (especially beginners) disregard stablecoins as a good\ninvestment just cause the price doesn’t change.\n\nThis couldn't be farther away from the truth as the true power in stablecoins in\nyield farming. Some platforms like Nacho [https://nachoxyz.com/] and…",
  "data/reddit-crypto/r/CryptoCurrency/comments/t2oit3/the_entire_moscow_exchange_is_offline.json": "The entire Moscow exchange is offline.\n\nThey halted all trades within. Even there main portal is completely offline.\nProbably also targeted by Anonymous in their effort to DDOS all state websites.\nhttps://www.moex.com/en/\n\nWe are witnissing the greatest downfall in the history of the russian…",
  "data/reddit-crypto/r/CryptoCurrency/comments/t2cdhj/apology_to_charles_hoskinson_and_rcc.json": "I made a few sensationalist posts over the past week alleging that Charles was\ninvolved with the front-running of Sundae Swap.\n\nIn one of the posts, I showed that IOHK’s wallet could be traced to a huge,\nunstaked wallet that funded another wallet used in the alleged front-running of\nSundae. The…",
  "data/reddit-crypto/r/CryptoCurrency/comments/t2pttl/most_disgusting_scam_yet_dude_comments_on_all.json": "That's pretty much all there is to say to it. u/substantialsummer634\n[/u/substantialsummer634] is mass replying to posts, saying \"Ukraine’s official\nTwitter account tweeted out a call for donations through bitcoin, Ethereum, and\nstablecoin tether on Saturday.\" and then adds an Ethereum address for…",
  "data/reddit-crypto/r/Bitcoin/comments/t2rdpx/bitcoin_pools_should_not_block_russian_users_the.json": "Miners are what keep the network alive. Regardless of the current situation the\nnetwork should not be degraded or disconnected for Russian users.\n\nRussian civilian's don't want a war. It's unlikely Russia government is using\nthe BTC network anyway.\n\nI too take Ukraine side in this disgusting act by…"
}