{
  "data/reddit-ask/r/TooAfraidToAsk/comments/shh2p2/does_anybodys_parents_charge_them_rent.json": "I'm in hs and I soon as I hit a job my mom started charging me rent, I only earn\nabout 600 a motnh during the school year.\n\nShe charges me $400, then I pay my own phone bill which is around $35 then I pay\nmy own gas for my car which is about $80 a month.\n\nMeaning I only save 85 a month, if…",
  "data/reddit-ask/r/NoStupidQuestions/comments/shh11p/did_anybody_parents_charge_them_rent.json": "I'm in hs and I soon as I hit a job my mom started charging me rent, I only earn\nabout 600 a motnh during the school year.\n\nShe charges me $400, then I pay my own phone bill which is around $35 then I pay\nmy own gas for my car which is about $80 a month.\n\nMeaning I only save 85 a month, if…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/shj5zj/completely_not_joking_am_i_the_only_person_who.json": "I’ve seen the news recently about Spotify and stuff... but I actually have no\nidea who he is at all!",
  "data/reddit-ask/r/TooAfraidToAsk/comments/shmt2m/how_much_do_you_feel_inside_your_vagina.json": "Are there any women out there besides me whose vaginas have numb walls? I can\nfeel my cervix when it's touched and my g-spot but not the rest. I can feel a\nsense of fullness when a thick dick is in me but that's it. No tingling\nsensations or however you want to describe the feeling. I cum just fine…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/shlkv2/how_is_wwii_taught_in_german_schools.json": "Title says it all. As an American, I’m genuinely curious.",
  "data/reddit-ask/r/AskWomen/comments/shmrnh/whats_something_that_people_think_is_a.json": "Title says it all.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/shpifr/what_do_girls_fantasize_about_while_masturbating.json": "recently a friend of mine told me she doesn't really imagine anything just does\nit like that.. i have hard time believing it but she doesn't really like men and\ni can kinda believe her.. is it like this only for her or mostly girls actually\ndo this with imagining scenarios or so?",
  "data/reddit-ask/r/askscience/comments/shnncq/to_what_extent_do_most_cultures_recognize_the.json": "Some cultures only have words for red, white, and black, while other cultures\nhave words for red, orange, yellow, etc.—does the same hold for emotions?\n\nPut another way: in primary schools, there are posters with cartoon faces\ncaricaturing important emotions, but would an analogous poster on the…",
  "data/reddit-ask/r/askscience/comments/shs145/covidflu_transmission_is_dont_touch_your_face.json": "Much of the public health messaging I see around COVID, Flu, and other common\nsicknesses emphasizes not touching your face with dirty hands. When I hear that,\nI hear \"don't touch your eyes, the inside of your nose, or your mouth\"/your\nmucous membranes. Is this right or is your cheek genuinely a…",
  "data/reddit-ask/r/NoStupidQuestions/comments/shws0a/is_the_us_just_stupidly_expensive_because_when.json": "I'm a student in Italy and I deliver pizza to make some bucks. My pay after tax\nis 7 € (7,9 $).\n\nI hear people complaining about 15$ an hour, maybe it's pre-tax or the US is\njust expensive af.\n\nBy living in italy my university expenses are really low, for an higher\neducation in a top 1% University…",
  "data/reddit-ask/r/AskHistorians/comments/shtqgl/the_1916_irish_proclamation_in_every_generation.json": "As above, the 1916 Proclamation invokes the 'rising in every generation' belief\nand claims 6 in the past 300 years. The 5 obvious ones seem the Confederate Wars\nof 1641, the United Irishmen of 1798, Robert Emmet in 1803, the Young Irelanders\nof 1848, the Fenians of 1867 (several of them are pushing…",
  "data/reddit-ask/r/NoStupidQuestions/comments/shxqhu/did_cavemen_know_to_pull_out.json": "A wet dark cave lit only by a fire. What else are you going to do in there than\nfuck? But would they know to pull out, when fucking for fun?",
  "data/reddit-ask/r/AskHistorians/comments/shyfjq/a_tweet_has_been_circulating_claiming_the_ussr.json": "In a few subreddits a screenshot has been posted saying that rents were capped\nat 4% of salary. This is generally used to contrast with rent costs in\npresent-day United States and other nations of the so-called \"Western Block\".\nWhile I can't find the original tweet, several others have made this…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/shsj0o/how_do_you_feel_like_you_are_a_certain_gender.json": "This has been a question that has been on my mind for quite some time so I'll\nguess I'll ask it here.\n\nHow does one \"feel\" as though they are male or female?\n\nMost humans have a sexual preference - e.g., straight, gay, bi etc. I get that.\nBut that doesn't necessarily change one's gender identity…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/si6k1t/should_i_feel_bad_because_i_genuinely_want_to.json": "I am a 16 years old male and I have always thought about having kids ever since\nI was young. I see so many people my generation talk about not wanting to have\nkids and it made me feel bad because I fell like the only one in my generation\nwho actually wants to have kids.\n\nOf course, I perfectly…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/shw3xx/why_is_it_that_muslims_calling_out_lgbt_people_is.json": "asking from personal experience. was nearly harassed by muslims for being part\nof LGBT and how it is bad. it was perfectly fine by them. and the other way\nround, by questioning their religion's values and ethics its Islamphobic.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/si5duy/is_it_bad_that_my_bf_says_this_during_sex.json": "I’m in my mid 20s and my bf is in his mid 30s. Sometimes during sex he’ll say “I\nlove fucking that tight young pussy” or something similar to it, and I could\ntell he gets off to that, and something about it makes me feel off. Should this\nbe something I should be concerned about? Or is it just…"
}