{
  "data/reddit-changemyview/r/changemyview/comments/qjy87s/cmv_being_antivax_is_inherently_selfish.json": "This excludes people who physically can not get the vaccine, I actually feel\nsorry for you and the view some people have on you…\n\nDo I understand the Liberty argument? Absolutely, even though I can’t personally\nresonate with it…\n\nRegardless of that, it’s still endangering other people, since the…",
  "data/reddit-changemyview/r/changemyview/comments/qkdatq/cmv_no_you_cant_say_women_can_wear_whatever_they.json": "TL:dr see this if you want to get a quick education for the purpose of\nconstructive debate [https://youtu.be/7Uu36ekmU3U]\n\nI am sick and tired of seeing people support the hijab without having any prior\nknowledge of what the hijab means and how it rose to ubiquity in Islamic\nnations.\n\n\nSO HERE’S A…",
  "data/reddit-changemyview/r/changemyview/comments/qkdzkm/cmv_government_scare_mongering_about_internet.json": "So in the UK after the recent murder of an MP (the second in 5 years) the\ngovernment is now considering removing anonymity in the UK for social media\nplatforms. This is the same government that also tried to make you require ID to\nview porn and that has made it illegal to cause a disruption while…",
  "data/reddit-changemyview/r/changemyview/comments/qkepxy/cmv_its_better_to_fail_to_adhere_to_a_rigorous.json": "Firstly, since I've used \"better\", in this context it is meant to describe\n\"effect change in behavior with increased frequency\" since we are discussing a\nmoral system which chiefly exists to guide conduct.\n\n\n\nQualifying statement: I am not specifically arguing for any particular system of\nmorality…",
  "data/reddit-changemyview/r/changemyview/comments/qkf2fu/cmv_some_people_rely_on_social_media_as_therapy.json": "I know, I’m not the wisest guy here since I’m literally using a social media to\nsay this. But this is less of a rant and more of a conclusion of mine.\n\nThis addresses all of the recent encounters I’ve had with some specific people\nonline. And judging by the fact of how common it is, you’ve probably…",
  "data/reddit-changemyview/r/changemyview/comments/qkhfi1/cmv_there_is_nothing_wrong_with_non_disabled.json": "Sometimes I hear from comments online and even YouTube videos dedicated to the\nsubject, that it is offensive for non-disabled actors (example: Daniel Day\nLewis, Tom Hanks) to play disabled characters. Instead we should have disabled\nactors play these roles because they truly know what it is like-…",
  "data/reddit-changemyview/r/changemyview/comments/qkka7i/cmv_the_idea_that_a_someone_like_elon_musk_or.json": "Title says it, the idea that if some rich dude just donates part of his money\nand it will fix world hunger is just, extremely stupid, naive and utopian.\n\nThe US governament alone spend more than 6 Trillion Dollars in 2020 alone.\n\nhttps://usafacts.org/state-of-the-union/budget/\n\nMoney alone won't…",
  "data/reddit-changemyview/r/changemyview/comments/qkkgyk/cmv_school_meals_should_be_free.json": "I will preface this by saying that due to the Pandemic, the USDA is reimbursing\nschool districts through the 2021-22 school year so all students are offered\nfree meals, but this should not be the exception. Though a large potion of\nschool children are already eligible for at least reduced school…",
  "data/reddit-changemyview/r/changemyview/comments/qknbyy/cmv_its_racist_to_believe_that_only_white_people.json": "It is with great fear that I am asking this and trying to reach an\nunderstanding.\n\nSomeone on Facepalm was banned for saying basically what this title says and\nmade a thread. I commented that thinking such was a great way to breed actual\nracism, not thinking much of it. I was banned from Facepalm…",
  "data/reddit-changemyview/r/changemyview/comments/qkp3fp/cmv_it_should_be_illegal_for_employers_to_ever.json": "I have seen a number of posts across Reddit (particularly r/antiwork\n[/r/antiwork]) that how employers exploit employees when it comes to calling in\nsick. One such situation I have seen mentioned a lot is that employers are\nrequiring doctors' notes on, or after taking a sick day or face punishment.…",
  "data/reddit-changemyview/r/changemyview/comments/qkqpjt/cmv_being_a_stay_at_home_parent_sahp_is_not_the.json": "First off, what I DON'T mean by this:\n\n- Parents on maternity leave of newborn children\n\n- Parents of children with special needs\n\n- Extreme scenarios, such as having 8 kids\n\nI'm talking about what the average common scenario. One parent is at home while\nthe other works, 2-3 kids, that…",
  "data/reddit-changemyview/r/changemyview/comments/qkxhww/cmv_encouraging_or_hiring_in_the_name_of.json": "First of all this isn’t a post to say we should stick to our own or that we\nshouldn’t all work together. I’m not bashing or belittling any race, sexual\norientation. This came about while i was applying for new jobs for the first\ntime in a while and i learned companies are asking when you when you’re…",
  "data/reddit-changemyview/r/changemyview/comments/ql01h6/cmv_the_objection_to_using_baby_instead_of_fetus.json": "This is not directly about the right or wrong of abortion, but rather about the\nlanguage used when discussing the issue. I’d prefer if we can keep the\ndiscussion to this narrow topic, instead of going down the oft-debated rabbit\nhole of the morality of abortion. There are enough CMV’s on that I’m…",
  "data/reddit-changemyview/r/changemyview/comments/ql3kgl/cmv_there_is_nothing_wrong_with_intentionally.json": "I've seen many dieticians claiming that all intenional weight loss is a bad\nidea. They cite studies that over 95% of people gain back the original weight\nand more after five years, and that weight cycling (losing and regaining weight)\nis worse for you than just staying fat.\n\nFirst, in the case of…",
  "data/reddit-changemyview/r/changemyview/comments/ql46zi/cmv_cancel_culture_is_just_the_consequences_of.json": "Snapchat, Instagram, and Twitter all began to blow up when I was in middle\nschool, and from the very beginning my fellow students and I were hounded to be\ncareful what we post online as it will be publicly recorded forever and there\nare consequences to negative actions. Nowadays when adults speak or…",
  "data/reddit-changemyview/r/changemyview/comments/ql8gjv/cmv_internally_i_will_always_see_trans_women_as.json": "I originally posted this is r/tooafraidtoask [/r/tooafraidtoask] and then\nr/NoStupidQuestions [/r/NoStupidQuestions] but both were removed for bad faith\narguments. There is no possible fucking way to show that I am here in good faith\nso please just take my word for it and engage me instead of…",
  "data/reddit-changemyview/r/changemyview/comments/qlbruj/cmv_dont_talk_politics_is_more_harmful_than.json": "My mother is very adamant about not talking politics at the house. One of our C\nlevel executives stated no political talk at work.\n\nI understand that politics can be heated, and people have very strong opinions.\nBut the key is to be respectful when having these conversations.\n\nI think the ban on…",
  "data/reddit-changemyview/r/changemyview/comments/qlcsj1/cmv_sales_tax_is_inherently_unjust_for_poorer.json": "I’m not talking about taxes on luxury goods or unhealthy items like tobacco. I\nthink those are just. I am also focused strictly on sales tax. While I think\nincome and property taxes is unjust too, that’s not part of this argument since\nit isn’t unjust to poorer people.\n\nI am talking about essential…",
  "data/reddit-changemyview/r/changemyview/comments/qleqxm/cmv_we_need_to_judge_plastics_based_on_their.json": "When someone says \"Plastic\" they might as well be saying \"Metal\" as in \"my car\nis made out of metal\". Well you shouldn't drive it then because Mercury is\nincredibly harmful, so is Uranium and Caesium... If you say your car is made of\nAluminium and Steel (Iron carbide alloy kind of) then everyone…",
  "data/reddit-changemyview/r/changemyview/comments/qlrnrr/cmv_trans_people_should_disclose_that_they_are.json": "Cards on the table, Although I don't feel like i have a bias against trans women\nI would feel \"ashamed\" if my friends found out. As if I was scared of the\nridicule and opinions of others.\n\nIt's also hard to say that I'm not attracted to them because I'm a straight male\nand I do believe if a man…",
  "data/reddit-changemyview/r/changemyview/comments/qlumcn/cmv_the_trans_debate_is_a_carefully_crafted.json": "After seeing quite a few posts here considdereing sexuality, abortion,\ntransgenderism etc I decided to make a CMV myself.\n\nI believe the public is being manipulated to talk about these topics because\nthey are polarizing and distracting from the real agenda of the right:\n\nWhat does the right…",
  "data/reddit-changemyview/r/changemyview/comments/qlxnai/cmv_colin_kaepernick_comparing_the_nfl_to_slavery.json": "I am honest to god not looking to just rant about how much I dislike him, I am\nreally looking to better understand or have my mind changed on why this person\nhas fans praising his bravery when he clearly seems like a fake. Why is what he\nis doing OK?\n\nLooking at Kaepernicks twitter, his fans are…",
  "data/reddit-changemyview/r/changemyview/comments/qlzmm7/cmv_there_is_no_good_reason_to_legally_require.json": "It makes no sense that humans are literally not allowed to just exist as humans.\n\nAll humans have nipples, vaginas, and/or penises. There is nothing inherently\n\"dirty\" or \"immoral\" about them.\n\nIt doesn't matter that you don't want to see a dong swinging around while you're\nout shopping at the…",
  "data/reddit-changemyview/r/changemyview/comments/qlzz1b/cmv_artifacts_in_museums_should_not_all_be.json": "There’s a big push going on right now to have artifacts currently residing in\nEuropean museums to be returned to their country of origin. I think this is a\ndangerous idea in terms of keeping the artifacts safe. In the Middle East for\nexample, we have seen ISIS on many occasions specifically seek out…",
  "data/reddit-changemyview/r/changemyview/comments/qm6hvi/cmv_any_news_organisation_that_disables_comments.json": "mean the title says it all, it's basically creating a one way media service that\ncan beam to you any information it wants, without having to listen to any of its\nviewers or anyone who disagrees. Impartial and unbiased news should always be\nviewed from every angle and it should create a respectful…",
  "data/reddit-changemyview/r/changemyview/comments/qmdvd3/cmv_middle_class_college_students_should_get_the.json": "You know how middle class college students are too rich for grants, but are too\npoor to afford college? If low-income students can often get a very large\nportion of their education covered by grants, then the same should be granted to\nmiddle class students. After all, it's only fair. Most middle…",
  "data/reddit-changemyview/r/changemyview/comments/qmegdk/cmv_expecting_individuals_to_cater_to_crazy.json": "According to Google there are 78 gender pronouns now. Thats freaking crazy. I\ncant pronounce most of them to even refer to someone even if I really wanted to\ncause I simply can't say many of them and they confuse me on how to fit into my\ngrammer and sentence structure (2 things I already struggle…",
  "data/reddit-changemyview/r/changemyview/comments/qmhvo1/cmv_the_state_should_have_no_right_to_tell_me.json": "This is a post relating to drug prohibition. To me, it seems to be a glaring\ninconsistency in the law. The State is not there to protect me from myself. Law\nis there to ensure order between people and my personal right to consume\nsomething does not necessarily harm anyone else. Bodily autonamy is a…",
  "data/reddit-changemyview/r/changemyview/comments/qmkkvr/cmv_all_news_agencies_should_be_prohibited_from.json": "Society is going to shit because \"news\" agencies and \"Journalists\" are flat out\nlying and peddling conspiracy theories to a population of gullible people to are\neasily controlled by fear.\n\nMedia organizations that lie need to be shut down and or fined heavily so that\nwe can get back to everyone…",
  "data/reddit-changemyview/r/changemyview/comments/qmlbx7/cmv_if_the_god_of_the_bible_was_actually_real_we.json": "Apologies in advance to the people this is going to piss off. For what it’s\nworth I’m not kidding and I’m not trolling.\n\nIn the Bible, God comes across as a somewhat capricious and, frankly, evil\nbeing. Imagine suddenly we discovered an old magic man in the sky - robes,\nsandals, the whole bit. Cool,…",
  "data/reddit-changemyview/r/changemyview/comments/qmpmlh/cmv_if_colleges_discriminate_on_race_when_it.json": "Recently a survey came out that more than 1/3 of white students lie about their\nrace on college applications.\n[https://thehill.com/changing-america/enrichment/education/577722-more-than-a-third-of-white-students-lie-about-their]\nThe students were heavily criticized on leftist twitter and by civil…",
  "data/reddit-changemyview/r/changemyview/comments/qmral8/cmv_there_should_be_a_child_rent_instead_of_a_pet.json": "First off, I know that child rent doesn’t exist because it’s against the law.\nThis is a “should” post.\n\nChildren are by a million miles more destructive, annoying, and overall\nunpleasant than most people’s pets. I work maintenance at an apartment and\npeople with kids get significantly more noise…",
  "data/reddit-changemyview/r/changemyview/comments/qmvw3q/cmv_tarot_is_worthless_nonsense.json": "Full disclosure, I don't normally state things this strongly, nor do I really\nfeel this strongly about tarot. But to keep it simple and be transparent, it's\nhow I really feel about tarot. I'm also not looking for a debate, though I do\nlook forward to engaging anyone willing to take on this topic. My…",
  "data/reddit-changemyview/r/changemyview/comments/qmymjg/cmv_using_the_terms_africanamerican_or.json": "I am of Mexican descent, however I was born in America. My parents were born in\nAmerica. If I go back a couple generations then the term Mexican-American can be\napplied because my great-great-grandparents came from both Mexico and Spain.\nHowever referring to me as Mexican-American does not apply…",
  "data/reddit-changemyview/r/changemyview/comments/qn0hhg/cmv_the_republican_party_of_the_us_has_become_an.json": "With the Party’s clear embracement of Qanon, a literal death cult conspiracy\ntheory, anti democratic practices such as voter suppression, the big lie of\nTrump and the rest of the party, and the attack on human rights such as the\nlimitations on Queer people’s healthcare or opposition to a minimum…",
  "data/reddit-changemyview/r/changemyview/comments/qn5ayb/cmv_a_mature_fully_developed_human_wants_to_hear.json": "You do not expand by not looking beyond that what you currently know. According\nto Nietzsche what defines an Übermensch is his quest to always expand his point\nof view. Way too many people are caught in in psychological trap, which makes\nthem ignorant and dismissive of anything that they perceive as…",
  "data/reddit-changemyview/r/changemyview/comments/qnge14/cmv_in_the_us_strong_english_writing_skills_are.json": "If you have ever seen job postings that are looking for entry-level accounting\npositions, you would likely encounter the term \"Excel\" frequently. Excel is one\nof the world's most used applications, and has become widespread even among\nnon-finance occupations.\n\nHowever, it is worth noting that…",
  "data/reddit-changemyview/r/changemyview/comments/qnhxhg/cmv_it_doesnt_count_as_emotional_labor_when_both.json": "First and foremost, I’m not trying to minimize that contribution that women\nbring to a relationship. I’ll be the first to admit that I’d be lost without the\nwomen in my life, and I’m well aware that there are a lot of men out there that\ndon’t carry their weight at home. But I’m not really talking…",
  "data/reddit-changemyview/r/changemyview/comments/qnvjb6/cmv_government_spending_should_be_referred_to_as.json": "Lets take the latest US infrastructure bill as an example: 1 trillion dollars\nspent. That is an amount I can't really grasp. However if you were to divide it\nby the US population (330 million) it would come out to be $3030 spent per\nperson living in the country. That's an amount I can actually…",
  "data/reddit-changemyview/r/changemyview/comments/qnvk6i/cmv_pornography_addiction_is_an_unchecked.json": "To start, I'm making a completely secular argument. I am not religious and I\nthink people of all belief systems should be able to agree with me.\n\nBasically, studies have shown that viewing pornography is addictive and\nactivates the same parts of your brain as addictive drugs like cocaine (if\nsomeone…",
  "data/reddit-changemyview/r/changemyview/comments/qnxi43/cmv_it_is_understandable_normal_and_biologically.json": "I believe that human beings, while they are able to think in a more abstract,\nout of the box way, still retain an underlying biological pressure to reproduce,\nand the root instinctual desire for the act of sex, and the enjoyment that comes\nfrom it, is evolutions way of “rewarding” us for…",
  "data/reddit-changemyview/r/changemyview/comments/qnyvn4/cmv_mandatory_military_service_conscription.json": "I don't see why in the 21st century we still insist on separating sexes here. I\nfeel like if there's a conscription law in a country it should be done by both\nsexes, or alternatively not having a conscription law at all.\n\nThe biggest argument I've seen against this is stuff about how males…",
  "data/reddit-changemyview/r/changemyview/comments/qo5gnp/cmv_too_many_jobs_ask_for_tips_that_shouldnt_be.json": "My personal rule for tipping is I will tip if the job that the person is doing\nfor me is a job that either:\n\n * Pays a wage that requires tipping, such as a waiter/waitress\n * Is a job that I can do myself, but am paying for someone else to do out of my\n   own laziness, such as food delivery,…",
  "data/reddit-changemyview/r/changemyview/comments/qo7zxm/cmv_advertising_of_alcohol_should_be_banned.json": "I think alcohol should be treated the exact same way that cigarettes are treated\n- as a threat to public health. Therefore, the government should take necessary\nsteps to reduce consumption without outright banning it, because that didn’t\nwork. A major component of this strategy is preventing…",
  "data/reddit-changemyview/r/changemyview/comments/qo8pwk/cmv_bitcoin_is_a_useless_commodity_and_provides.json": "Bitcoin’s run up has made a lot of millionaires over the years. People who have\nno fundamental understanding of crypto currencies are throwing their life\nsavings into Bitcoin, which does not produce any real value to society.\n\nWhen you invest in a company, let’s say a farm, you’re investing in…",
  "data/reddit-changemyview/r/changemyview/comments/qo9llo/cmv_homelessness_is_largely_misunderstood_by_the.json": "I’ve had a number of conversations with people who look down on homeless people\nin general, and these conversations almost always inevitably take the same turn,\nespecially these days with so many hiring signs out - “Why don’t they just get a\njob like a normal person and stop living on the street” or…",
  "data/reddit-changemyview/r/changemyview/comments/qoe9zu/cmv_its_possible_for_people_to_respect_views_and.json": "I made a post about this and thought it was specific to abortion but seems as\nthough I’m the odd one out in this.\n\nSo basically I feel that if there’s a mutual respect between people in regards\nto their views, that can still be respect while not wanting to associate with\neach other. In some cases I…",
  "data/reddit-changemyview/r/changemyview/comments/qoftmk/cmv_i_dont_100_agree_with_the_notion_that.json": "Mainly because of two exceptions:\n\na.) In a lot of cases the \"oppressor\" is not easy to identify, and the situation\nis not black and white. An example of this would be what is happening in Syria,\nwhere almost everyone involved from the US to Russia and ISIS has done pretty\nregrettable things. So it…",
  "data/reddit-changemyview/r/changemyview/comments/qoht03/cmv_its_okay_for_womengirls_to_initiate_a.json": "Disclaimer: I need this for a debate ; our side being assigned that its not okay\nfor girls to initiate a romantic relationship, unfortunately, as a man born in\nthis generation, I'm okay with girls initiating a relationship and I need to\nchange my views to the old traditional way that its always a…",
  "data/reddit-changemyview/r/changemyview/comments/qoirlz/cmv_taxing_unrealized_capital_gains_is_the.json": "On January 1st shares of the Progenity corporation were 6 dollars a share.\n\nIn August their shares were 1 dollar a share.\n\nCurrently they are 3.60 a share.\n\nHalf the traders think they're going up to 8 dollars a share by year's end. The\nother half think they'll be back to a dollar a share.\n\nSuppose…",
  "data/reddit-changemyview/r/changemyview/comments/qom7dr/cmv_conscription_has_no_place_in_civilised_society.json": "Or any society for that matter. I inherently disagree with war but unfortunately\nit seems to be something that will never go away, maybe I’m wrong. The\ngovernment should not be able to infringe on your civil liberties and make you\nfight, possibly to your death for your government for a war you may…",
  "data/reddit-changemyview/r/changemyview/comments/qoos93/cmv_if_youre_questioning_your_sexuality_you.json": "I recently dated an aromantic who was questioning whether or not they were\naromantic. I felt extremely used when they ended things with me and dropped the\nbomb that they felt they were aromantic since before we started dating. I had\nalready established before that I date to be in a relationship. I…",
  "data/reddit-changemyview/r/changemyview/comments/qotq46/cmv_index_funds_are_the_safest_and_most_reliable.json": "I'm making this post because my knowledge about the stock market is limited and\nI want to expand on this. One way of expanding on this is by challenging my\nassumption that index funds are the way to go. Feel free to point out any flaws\nin any part of my arguments as I am trying to strengthen my…",
  "data/reddit-changemyview/r/changemyview/comments/qov05u/cmv_raising_your_child_to_be_morbidly_obese.json": "I don’t mean to sound “fat shamey” at all. I worked as a trainer for years and\nworked with multiple obese clients to help them regain their mobility,\nconfidence, health, and ultimately their lives back. I love and respect every\none of them, I don’t view “being fat” as a moral failing or something…",
  "data/reddit-changemyview/r/changemyview/comments/qovfpx/cmv_black_people_are_shot_more_by_the_police_but.json": "Before you downvote me, please read my whole post because I have hard statistics\nfrom reputable sources to support my argument. Also, for the record, I’m black\nso please don’t accuse me of being racist.\n\nFor this argument, I will be comparing the number of police shootings to the\nnumber of arrests.…",
  "data/reddit-changemyview/r/changemyview/comments/qow4vg/cmv_high_school_students_shouldnt_be_required_to.json": "This isn't of any immediate personal relevance (that was a while ago), but I\nknow a few people who are currently in high school so it comes up occasionally.\nIt seems strange to me that the high school students I know are apparently\nworking longer hours than I do as a grad student. (I know their…",
  "data/reddit-changemyview/r/changemyview/comments/qowtws/cmv_seo_and_clickbaitish_headlinestitles_have.json": "I am done with the web and searching for content on it. It's now at the point\nthat almost any given search anywhere results in little more than clickbait(ish)\ntitles, over-SEO'd pages, sales pitches, and malicious crap on a hacked\nWordPress site. Good luck searching for something that's not pop…",
  "data/reddit-changemyview/r/changemyview/comments/qoy2dg/cmv_the_vaccine_mandate_was_strategically.json": "The entire identity of antivaxxers is this: \"I don't trust Big Pharma, I don't\ntrust the government. They want to infringe on my freedoms, and I am the Hero\nwho will stand up for what's right.\" That \"standing by the river of truth and\nsaying 'no, you move'\" thing is a massive part of conservative…",
  "data/reddit-changemyview/r/changemyview/comments/qp9me1/cmv_trust_the_science_ignores_that_science_is_not.json": "(This is semi-related to COVID as this argument comes up a lot but I’ve also\nseen this come up in responses to people that question climate change,\nevolution, etc).\n\nI understand the trusting of experts as more of a metric of probability and a\ncrutch for the inevitable fact that most people will…",
  "data/reddit-changemyview/r/changemyview/comments/qpfqh7/cmv_the_way_that_racism_and_systemic_racism_is.json": "A BIT OF BACKGROUND\n\nI am a mixed race individual, who can pass as white, having a white father and a\nmixed race mother, and I have a racially ambiguous name. I grew up in a\npredominantly black neighborhood in Detroit, MI, and while I did not recieve as\nmuch direct or indirect racism as many of my…",
  "data/reddit-changemyview/r/changemyview/comments/qpi98o/cmv_the_us_government_should_cover_vaccine.json": "Personal statement: I have been vaccinated since March. I got vaccinated because\nI interpreted the risk of getting the virus as more than getting the vaccine. I\ndid experience an adverse side effect in the form of an ugly full torso rash due\nto the second dose, luckily it only caused me a lot of…",
  "data/reddit-changemyview/r/changemyview/comments/qpmb1a/cmv_kyle_rittenhouse_will_and_probably_should_go.json": "I've followed this case fairly extensively since it happened in august of last\nyear. At the time I was fairly outraged by what I saw as the failures of law\nenforcement to arrest or even detain Rittenhouse on the spot, and I still retain\nthat particular bit of righteous anger. A person should not be…",
  "data/reddit-changemyview/r/changemyview/comments/qpp9jg/cmv_underage_employed_staff_should_be.json": "Or at least granted the option every year. (Young workers in general 16-24)\n\nSo firstly, I understand that CEO’s, business owners and managers have a\nbusiness to run. But, being human beings themselves, they should, of all people,\nunderstand the limitations of being young has on you while you still…",
  "data/reddit-changemyview/r/changemyview/comments/qpsr7v/cmv_we_need_to_stop_forcing_inclusion_into.json": "There are things I like. I enjoy those things usually because of the specific\ncommunity around it. But when that hobby decides to change in order to include\nmore people i think it’s an issue.\n\nI think the first time I experienced this was as a middle schooler playing\nfootball with the boys at…",
  "data/reddit-changemyview/r/changemyview/comments/qpwve7/cmv_diversity_inclusion_initiatives_are_harmful.json": "I work at a fast-growing, progressive software company that is very outspoken on\npolitical issues. One of the \"programs\" they're most passionate and vocal about\nis being a company with a diverse workforce. Now when I say diverse, as you\nprobably all inferred, I'm not talking about diversity of…",
  "data/reddit-changemyview/r/changemyview/comments/qq1f5y/cmv_there_isnt_going_to_be_an_event_research.json": "Climate crisis? Housing crisis? Wage crisis? Mental health crisis?\n\nAll these headlines would have you believing that some exceptionally massive\nimpetus for change is surely a headline away.\n\nThere isn’t going to be a tipping point. The goal posts will keep moving. The\nworld will keep…",
  "data/reddit-changemyview/r/changemyview/comments/qq2793/cmv_being_gay_and_being_trans_should_not_be.json": "Trans people are much less common than the gay/bi population, and much more\ncontroversial. Is it really an important priority to pursue even if it hurts the\noverall cause? My answer is no.\n\nPeople seem to get confused since most people assume being trans is the ultimate\nlevel of being gay. Most…",
  "data/reddit-changemyview/r/changemyview/comments/qq8uiu/cmv_hoas_should_not_have_legal_power_to_enforce.json": "I should start by explaining I don't have a problem with the concept of HOAs.\nThey are totally valid and if you find yourself living in one, it would be wise\nto abide by their rules for the sake of your own financial investment in your\nhome/property.\n\nThe benefits of living in an HOA will be enough…",
  "data/reddit-changemyview/r/changemyview/comments/qq9x28/cmv_saying_dm_for_credit_is_a_lazy_and_unethical.json": "We've all seen it. Probably daily. People stealing other people's content and\nbelieving they have rights to use it just because they said DM for credit.\n\nMy view it that it is unethical and lazy to steal someone else's content for\nyour own gain. I'd even go a step further and even giving credit to…",
  "data/reddit-changemyview/r/changemyview/comments/qqfd3w/cmv_it_is_bad_parenting_if_you_teach_your_kids.json": "I found it very traumatic as a kid when people (other kids and some adults) got\nin my business and told me that I was going to hell, just because I didn't\n(first of all, even know what hell was) accept their savior.\n\nIt was very confusing at first because it starts in elementary school, an age\nwhen…",
  "data/reddit-changemyview/r/changemyview/comments/qqgnsq/cmv_all_vehicles_registered_for_use_on_public.json": "Driving is literally one of the most dangerous things people do. It’s one of the\ntop ways to end a life early.\n\nSpeed doesn’t help the chance of someone walking out alive or without major\ninjuries.\n\nThere is no place where you can legally drive on a public road over 85 (in the\nUS).\n\nYou may say……",
  "data/reddit-changemyview/r/changemyview/comments/qqhorh/cmv_i_miss_the_days_when_reddit_brigading.json": "IMHO when this kind of conflict was allowed, at the very least, people would be\nopen to debate and changing their minds. at least neutrals went back and forth\nand they were exposed to information they didn't know existed.\n\nnow, reddit, youtube and the internet generally is primarily composed…",
  "data/reddit-changemyview/r/changemyview/comments/qqixbc/cmv_useful_political_discourse_in_america_is_more.json": "Here is my main example which best illustrates my point: take any publicized\nincident, a hate crime, a racist action, a robbery by a black man, even the Kyle\nRittenhouse case, and you have conservatives saying their side is screwed every\ntime and liberals saying their side is screwed every time.\n\nA…",
  "data/reddit-changemyview/r/changemyview/comments/qqpcj7/cmv_men_honour_peoples_privacy_in_a_more.json": "Gonna be straight up and accept this sounds inherently sexist. It probably is.\nIt's my view that a large majority of women have a hard time keeping things\nprivate. I come to this conclusion after spending a roughly equal amount of time\namong men and women, both in the workplace and in private, and…",
  "data/reddit-changemyview/r/changemyview/comments/qqwjju/cmv_humanity_will_self_destruct_and_the_only.json": "If we think about it, right now we're a fire that burns on nature so, logically,\nthe fuel will run out at some point because that's human nature. It's in our\nnature to want more, to believe that we're special and that drives us more and\nmore into self-delusion and self destruction.\n\nYes, maybe we'll…",
  "data/reddit-changemyview/r/changemyview/comments/qqxbv2/cmv_if_your_dog_ever_shows_real_inappropriate.json": "I have been going to a dog park with my dog for over a year now. It's a big,\nmulti-acre dog park, and he loves it. I've also found that taking a dog park is\na big decision for dog owners because of the presence of dogs that get triggered\ninto violence. IMO, these dogs that have the capacity to be…",
  "data/reddit-changemyview/r/changemyview/comments/qqy08f/cmv_there_is_no_reasonable_argument_against_mask.json": "it's been somewhat constantly surprising when I see otherwise normal-seeming\npeople and co-workers who I may have naively assumed were more logical than I\nthought railing against mandates and masks - calling it a freedoms issue and\nusing everything from abortion to slavery and diversity.\n\nI find…",
  "data/reddit-changemyview/r/changemyview/comments/qr6haa/cmv_as_a_teen_it_is_much_more_terrifying_for_a.json": "Typing this on a phone so sorry for spelling mistakes\n\nI am a 17 year old straight boy so i could be very biased/under informed,\nhowever i do believe that the stigmatizing nature of being a member of the\nlgbtq+ community is far worse for a guy than it is for a girl. Don't get me\nwrong, both receive…",
  "data/reddit-changemyview/r/changemyview/comments/qr8qnk/cmv_people_are_getting_far_too_emotional_about.json": "Just to be clear before starting this... I am a liberal. If you don't believe\nme, look through my post history. I am throwing this caveat up because too many\npeople dismiss opinions unless it's from the right people.\n\nI have seen lots and lots of attacks against Kyle and against the prosecution\nfor…",
  "data/reddit-changemyview/r/changemyview/comments/qrq6hr/cmv_he_started_it_is_a_perfectly_valid_defense.json": "Everyone knows the scenario, two kids are fighting or getting into it in some\nmanner or another and then the parent or teacher or principal or whatever breaks\nthem up and one says \"he started it\" and then the authority figures says \"I\ndon't care who started it\"\n\nI'm sure you've seen it happen in…",
  "data/reddit-changemyview/r/changemyview/comments/qrvl7n/cmv_democrats_would_have_far_more_success_in.json": "From my perspective, the woke left is essentially holding Democrats hostage.\nThis tiny, but vocal, group continues to push policies that are deeply unpopular\nto the detriment of Democrats.\n\nThe results speak for themselves-in Minneapolis, voters rejected a ballot\ninitiative that would have replaced…",
  "data/reddit-changemyview/r/changemyview/comments/qrxz6d/cmv_its_time_to_stop_the_x99_pricing_strategy.json": "I'm not from the US. In fact I'm from a country where we don't have credit cards\nand people buy brand new cars with cash and have minimal to no mortgage debt. As\nsuch, we also never have $999 instead of just $1000 for easier transactions and\nless headaches for accounting purposes.\n\nWhen I first came…",
  "data/reddit-changemyview/r/changemyview/comments/qryf4i/cmv_feminism_should_be_redefined_as_womens_rights.json": "(Edits in bold)\n\nFeminism's full definition goes as follows: \"a range of social movements,\npolitical movements, and ideologies that aim to define and establish the\npolitical, economic, personal, and social equality of the sexes\". However, in\npractice, I see that feminism is virtually completely…",
  "data/reddit-changemyview/r/changemyview/comments/qs0fvy/cmv_youtube_is_removing_dislikes_to_protect.json": "Yesterday YouTube announced that it will hide the number of dislikes a video has\nfrom the public and only the creator will be able to view the amount of dislikes\ntheir videos have, YouTube says this is because of “dislike attacks” which they\nsay harm small creators specifically, however YouTube has…",
  "data/reddit-changemyview/r/changemyview/comments/qsdgs5/cmv_privileged_people_try_to_say_all_trauma_is.json": "I think you’ve heard it all before.\n\n“Don’t invalidate someone’s trauma”\n\nOr better yet, “everyone’s trauma is the same.”\n\nAnd for some reason, I simply can’t bring myself to believe that. I think most\nof you who are reading this are very privileged in general. For the most part\nyou have food,…",
  "data/reddit-changemyview/r/changemyview/comments/qsgg83/cmv_police_should_be_required_to_carry_liability.json": "I believe police should be required to carry liability insurance just like\ndoctors carry malpractice insurance. If a cop gets sued, their rates go up. Too\nmany incidents and the insurance carriers drop their coverage and are unable to\nwork in the field. We've seen too many cops get let off because…",
  "data/reddit-changemyview/r/changemyview/comments/qso57n/cmv_americas_got_talent_needs_to_ban_people_from.json": "We already have The Voice. Any time I hear a singer on America's Got Talent, I\nask myself- would they have any shot at winning The Voice? If so, they should go\non The Voice and stop wasting everyone's time on a Talent show where there's 50\nmillion other people trying to use singing as their talent.…",
  "data/reddit-changemyview/r/changemyview/comments/qsvhlw/cmv_we_have_enough_food_to_feed_everyone_the.json": "I read on various websites that we have enough food to feed the world, the\nproblem with starvation comes from the ability to actually give the food. Now,\nit is my belief that sharing is caring. I also believe that entire concept got\nreally messed up during the Cold War. Basically, maybe I'm really…",
  "data/reddit-changemyview/r/changemyview/comments/qt1ulr/cmv_most_major_socialist_movements_are_driven.json": "The theory that I have is that most major socialist movements in history (as\nwell as many contemporary movements) are primarily driven by a loathing for the\nrich.\n\nWhile many people call the USSR/China to be \"not socialism\", IMO the founding\nprinciples and ideas that drove the Russian Revolution and…",
  "data/reddit-changemyview/r/changemyview/comments/qtccsm/cmv_taiwan_needs_to_maintain_its_dominance_in_the.json": "Taiwan Semiconductor Manufacturing Company (TSMC), a chipmaking company,\naccounts for 15% of Taiwan's GDP. The company has effectively monopolized\nsemiconductor manufacturing by having the right infrastructure and talent. Its\niron grip over the market has positioned the company as one of the most…",
  "data/reddit-changemyview/r/changemyview/comments/qtd5rm/cmv_previous_western_generations_have_been_a_lot.json": "I think the previous generations were extremely lucky to have grown up in the\nearlier decades (50s, 60s, 70s, 80s and 90s). Yes, there were problems, such as\nracism and sexism... BUT they have grown in a world where:\n\n * there was continuous economic growth with relatively few crises compared to\n  …",
  "data/reddit-changemyview/r/changemyview/comments/qtea6b/cmv_nickleback_wasnt_a_bad_band_you_just_wanted.json": "Nickelback is a Canadian rock band formed in 1995 in Hanna, Alberta. It is\ncomposed of guitarist and lead vocalist Chad Kroeger, guitarist, keyboardist and\nbacking vocalist Ryan Peake, bassist Mike Kroeger, and drummer Daniel Adair.\n\nTheir a few of their hit songs, in which are in no particular…",
  "data/reddit-changemyview/r/changemyview/comments/qthks5/cmv_there_is_no_solid_reason_or_evidence_that_men.json": "The conventional wisdom, particularly on the left, is that the gender disparity\nin a lot of industries and jobs (STEM, executive roles, politics, childcare,\netc) is entirely a result of socially enforced gender roles. Hence gender\ndisparity in, for example, STEM field, is not explained by men and…",
  "data/reddit-changemyview/r/changemyview/comments/qtj8yk/cmv_being_fat_isnt_healthy.json": "People nowadays are more and more sedentary, spending their days in cars or\nsofas, eating junk food all the time. Those are facts. Sadly, this leads to\nobesity taking over a pretty big position as one of the most common diseases in\nthe world.\n\nBeing fat puts stress over your bones and articulations,…",
  "data/reddit-changemyview/r/changemyview/comments/qtt5as/cmv_the_treatmentstatus_given_to_judges_in_the_us.json": "I've been following that one high profile trial that has been recorded and\nstreamed everywhere. This is basically my first exposure to a real US court and\na trial ever, and the one thing that has surprised me the most is the treatment\nand status that is given to the judge, the dynamics of the…",
  "data/reddit-changemyview/r/changemyview/comments/qtwaga/cmv_androids_are_better_than_the_iphone.json": "I was once one to think the iPhone was in a league of its own. It wasn’t until\nabout 6 months ago when I got my first android that I first caught a glimpse\nthat I was completely wrong. The Android cellular device is such a great phone.\nI used to think that because androids didn’t have iMessage or…",
  "data/reddit-changemyview/r/changemyview/comments/qtzbau/cmv_youtube_should_not_have_removed_the_dislike.json": "The dislike button was good for letting people know what YouTube videos are\nclickbaits/ things that will just waste their time. There are very few \"good\"\nvideos which have tons of dislikes but now with the removal of dislikes, people\nwill have a much harder time telling if something is legit or just…",
  "data/reddit-changemyview/r/changemyview/comments/qu0f8l/cmv_the_stormcloaks_are_the_right_side_to_join_in.json": "This past Thursday was the tenth anniversary of Skyrim's release date, so I\nthought this would be a good time to make this post.\n\nI am arguing that it is better to join the Stormcloaks in Skyrim than the\nEmpire, and my first and foremost argument is that the Empire has essentially\nbecome a puppet…",
  "data/reddit-changemyview/r/changemyview/comments/qu17um/cmv_life_was_better_before_social_media.json": "I'm 22 years old. Most of the time I've been alive I've known about social\nmedia. It just seems to be a toxic cesspit of negativity where people can spew\nwhatever shit they want, and has undermined the nature of human interaction, as\nwell as democracy at large. The President of the United States…",
  "data/reddit-changemyview/r/changemyview/comments/qu5kh2/cmv_its_not_a_good_thing_that_the_american_people.json": "I see this exchange happen a lot in gun debates - someone brings up the need to\nsecure a free state by the vigilance of the people, then the anti-gun guy\ncounters that some dudes with AR-15s could never fight off drone strikes and US\nMarines, so there’s no point in trying…\n\nI’m not sure if this kind…",
  "data/reddit-changemyview/r/changemyview/comments/qu9gbg/cmv_refusing_to_engage_with_someone_who_has.json": "I am someone who really enjoys discussions and I can find myself on either side\nof an argument depending who I am talking to. I will often play the devils\nadvocate, and if I'm talking to someone who is (for example) pro-choice, then\nI'll take the pro-life perspective, and viceversa.\n\nBecause I do…",
  "data/reddit-changemyview/r/changemyview/comments/qugxd9/cmv_with_enough_money_you_can_buy_your_way_out_of.json": "The common pattern I've seen in many criminal and civil cases including the\nrecent tragedy at Astroworld shows how much money dictates if you'll ever see a\nday in jail or how long of a sentence you'll serve. The details of the\nAstroworld investigation are still ongoing, but so far I've yet to see…",
  "data/reddit-changemyview/r/changemyview/comments/quh21y/cmv_the_concept_of_nonbinary_genders_is_rooted_in.json": "First things first, I am very much the live and let live sort. The way I see it,\npeople can live their lives in whatever way they please. As long as they aren't\nnegatively impacting anyone else then I don't see why it matters. I've never met\nany NB people in \"real life\" but I've encountered some…",
  "data/reddit-changemyview/r/changemyview/comments/quhdxv/cmv_leds_hids_and_halogens_should_be_illegal_for.json": "Basically what I mean is that any blue/white light headlights should be illegal.\n\nPersonally in my experience, most blue/white light headlights are so bright that\nthey prevent me from seeing anything while they're shining in my eyes from on\ncoming traffic.\n\nI really don't feel that any extra…",
  "data/reddit-changemyview/r/changemyview/comments/quk0vb/cmv_female_police_officers_should_do_the_same.json": "Being a police officer isn't a game. It isn't a sport either. It's such a\ndifficult career you need to be very capable to survive. Or very lucky.\n\nWomen shouldn't have easier physical tests to become a police officer. By making\nit so weaker people can become officers, you are actively sabotaging the…",
  "data/reddit-changemyview/r/changemyview/comments/quo9at/cmv_the_criminal_records_of_those_killed_by_kyle.json": "Across the internet I've seen a great amount of discussions over the Kyle\nRittenhouse case, to me both sides have some good points. I personally haven't\ncome to a conclusion on the matter as a whole yet.\n\nHowever I can safely say that the dumbest argument I've seen from Rittenhouse\ndefenders is when…",
  "data/reddit-changemyview/r/changemyview/comments/quszx2/cmv_i_believe_that_promoting_the_normalization_of.json": "A FEW DISCLAIMERS:\n\nI'm not coming at this from a bigoted point of view, I'm super open to changing\nmy perspective. I know this is going to trigger some very visceral, emotional\nreactions, READ ENTIRELY BEFORE RESPONDING WITH SOME KNEE-JERK COMMENT, I'M VERY\nNUANCED ABOUT IT. While it certainly…",
  "data/reddit-changemyview/r/changemyview/comments/quz2wb/cmv_thomas_binger_should_be_disbarred.json": "Thomas Binger is the lead prosecutor on the Rittenhouse case. So far, it has\nbeen shown that he has done the following:\n\n1: Attempted to coerce a defense witness into amending their statement to\ninclude events they were not present for.\n\n2: Blatantly violated Rittenhouse’s 5th amendment rights by…",
  "data/reddit-changemyview/r/changemyview/comments/qv9gqv/cmv_cupcakes_and_muffins_are_two_different_baked.json": "Hope this is a fun one! I would like to argue that cupcakes and muffins are two\ndistinctly different baked treats. Growing up in the United States, I've been\nexposed to both, and it's simple to spot the difference. Muffins tend to have a\ndenser texture while cupcakes are looser in texture for the…",
  "data/reddit-changemyview/r/changemyview/comments/qvdnbv/cmv_i_like_asian_women_and_theres_nothing_wrong.json": "I’ve always had a strong preference for Asian and Pacific Island women. One of\nmy first childhood crushes was Lucy liu and when we talked about cute girls I\nwas always the odd one out because I liked Asians. As a non Asian I’ve be shamed\nfor it with people saying it’s fetishizing and assuming…",
  "data/reddit-changemyview/r/changemyview/comments/qvfzv8/cmv_kyle_rittenhouse_will_go_free_on_all_charges.json": "First, let me state I am a progressive and very pro BLM.\n\nThe bar for conviction of criminal charges is set extremely high in the United\nStates. After the charges for minor weapon possession were dropped on a\ntechnicality regarding barrel length, there was nothing left to convict on. It\ncan be very…",
  "data/reddit-changemyview/r/changemyview/comments/qviozz/cmv_culture_accounts_for_significantly_more_than.json": "Recently it's become \"not PC\" to talk about culture and its effects, especially\nin the US. I suspect this is because culture can be closely related to race.\n\nHowever, many realities in the US are clearly influenced by culture. The most\nobvious example being the wealth disparities among different…",
  "data/reddit-changemyview/r/changemyview/comments/qvo3c5/cmv_anarchy_is_not_a_valid_worldview.json": "My friend is a self-described Anarchist and also Libertarian somehow and when we\ndiscuss societal issues and world affairs, he tends to fall back on the argument\nthat if there were no systems or structures or rules, everything would sort\nitself out and humanity would be as it should be. I become…",
  "data/reddit-changemyview/r/changemyview/comments/qvqqoa/cmv_the_politicization_of_covidis_setting_us_up.json": "Globalization, rural expansion, and other factors have led to an increased\nability for human-carried viruses to emerge and spread with unprecedented pace\nand scale. Clearly COVID-19 is not the worst possible version of Coronavirus;\none day a more virulent and deadly Flu, Coronavirus, or other virus…",
  "data/reddit-changemyview/r/changemyview/comments/qvtxuk/cmv_its_perfectly_acceptable_for_dogwalkers_to.json": "I never thought this was actually an issue until I saw a Facebook status tonight\nabout it, arguing the opposite. Also, please let me know if this is better\nsuited for a different subreddit.\n\nBasically the title. Dog-owners/walkers should be responsible and pick up after\ntheir dogs, but it shouldn’t…",
  "data/reddit-changemyview/r/changemyview/comments/qw0jcr/cmv_there_are_few_phrases_more_inaccurate_and.json": "CMV: There are few phrases more inaccurate and culturally insensitive than\ncalling the US president \"The Leader of the Free World\", but somehow the\nmajority of the US population doesn't bat an eye when it's used thousands of\ntimes a day in the media, and in daily conversation. This must…",
  "data/reddit-changemyview/r/changemyview/comments/qw1vhy/cmv_mac_windows_management_system_is_inferior.json": "This is a CMV about this specific feature which in my opinion is key to\nproductivity not about Mac in general vs Windows in general\n\n 1. In windows you can hover over the application icon in the taskbar and see\n    all the windows open for a given application.\n\nBut wait Mac expose does this too…",
  "data/reddit-changemyview/r/changemyview/comments/qw2q2g/cmv_the_usworld_is_headed_in_a_direction_that.json": "Maybe it’s the media, from Reddit to cable news, but it seems like a lot of\nyoung adults like myself, and younger teens, are distraught and hopeless.\nHousing, jobs, government, climate, etc. we all know the “tone” for the future\nbased on the present narrative. It’s bleak. Or seems so.\n\nI’d love for…",
  "data/reddit-changemyview/r/changemyview/comments/qw3eyd/cmv_bitcoin_is_bullshit.json": "Before it became popular among the masses, bitcoin was exclusively used for\nmoney laundring (edit: i may be wrong about that) and as a black market\ncurrency. It's still used for money laundring and black markets to this day of\ncourse, and it's great at that , but for some reason people actually…",
  "data/reddit-changemyview/r/changemyview/comments/qw4z1d/cmv_fascism_is_different_than_generic_right_wing.json": "First off, I want to say that I am not a Trump supporter and I am not a Biden\nsupporter so I'm not trying to defend them.\n\nSo one day I came across this Mussolini quote and that's what got me interested\nin learning about what else I don't know. I wound up running into biased source\nafter biased…",
  "data/reddit-changemyview/r/changemyview/comments/qw66hl/cmv_the_dog_breath_punishment_would_be.json": "I've heard about this seemingly informal \"punishment\" in a few contexts now.\nThought it was a joke at first, but apparently it's a real thing.\n\nA friend of mine who had a friend who spend a year in prison, said that if\nofficers found drugs in your cell, they'd often retaliate by conducting…",
  "data/reddit-changemyview/r/changemyview/comments/qw98wk/cmv_wanting_to_change_the_term_pedophile_to_minor.json": "Also, let me make this crystal clear, I think sexualizing kids is wrong whether\nyou are a virtuous pedophile or not, but my main point is not that, it is that\nit seeks to normalize pedophilia, and normalizing pedophilia makes pedophiles\nmore comfortable with thoughts they really should not indulge…",
  "data/reddit-changemyview/r/changemyview/comments/qwbj5m/cmv_political_correctness_causes_more_prejudice.json": "Firstly, I want to clarify what I mean by political correctness as I see it as a\nspectrum to some extent. I have no problem with everyone agreeing with the fact\nthat certain terms are offensive and we should try not to use them in polite\nconversation.\n\nI even respect people's right to use those…",
  "data/reddit-changemyview/r/changemyview/comments/qwdyy1/cmv_networking_is_just_a_more_socially_acceptable.json": "I think we’ve heard many iterations of what networking is and how it should be\ndone. Ultimately, when you’re at a networking event, you’re there because you're\nhoping to meet people who are already at a certain level of their career, and\nyou plan to try to impress them just enough so that they…",
  "data/reddit-changemyview/r/changemyview/comments/qwig45/cmv_spaghetti_is_objectively_the_worst_pasta.json": "It sucks at holding sauce, it doesn't mix well in the dish itself (you'll get a\nbite of a bunch of noodles, or you'll get a bite of the sauce and whatever else\nyou have in your dish, but never both simultaneously), it's long and gangly and\nhard to scoop onto your plate without making a mess, no…",
  "data/reddit-changemyview/r/changemyview/comments/qwmjia/cmv_the_subreddit_called_female_dating_strategies.json": "So I stumbled upon this subreddit called Female Dating Strategies just to see\nwhat it is about.\n\nWell the views there seem extremely radical and the women seem to be the female\nversion of incels. There are tips like \"date other people and brag about it to\nhis face while your with him\" or things like…",
  "data/reddit-changemyview/r/changemyview/comments/qwoybr/cmv_a_loving_god_would_not_send_people_to_hell.json": "I’m basing this off of conversations that I’ve had with a lot of born-again\nChristians. And this post is directed at them. I’m not sure how many I will find\non Reddit, though.\n\nI want to start by saying that I’m not an atheist and I’m actually very much\ninterested in religion in general, but one…",
  "data/reddit-changemyview/r/changemyview/comments/qwrg0f/cmv_crabs_are_one_evolution_away_from_the.json": "Crabs have developed at least six separate times on earth. That's six separate\nlineages all settling on armored shells, molting, regeneration, pincers, etc.\n\nYou could say that crabs are like living tanks, except tanks have guns. If crabs\nwere ever to obtain a biological ranged feature, they would…",
  "data/reddit-changemyview/r/changemyview/comments/qwx5z0/cmv_when_people_mention_biblical_marriage_they.json": "The Bible makes it very clear that polygamy and marrying your sister or family\nmembers is perfectly moral. When having discussions about marriage with\nChristians we should really consider the entire context of the Bible to get a\nbetter understanding of its VERY open view of marriage.\n\nThe Bible…",
  "data/reddit-changemyview/r/changemyview/comments/qx1km6/cmv_the_finnish_siding_with_the_nazis_to_defend.json": "The Finnish were invaded by the soviet union for refusing to trade territory,\nand no countries helped. Imagine the situation: Your country gets invaded by one\nof the most powerful nations at the time. You are winning during the start, but\nthat's simply because of a minor flaw in your enemy's…",
  "data/reddit-changemyview/r/changemyview/comments/qx5q37/cmv_revenge_is_not_worth_the_time_or_energy_even.json": "Is this a test from the world to see if I will give attention to getting down on\nanother persons level?\n\nOr is it the world giving me a green light to deliver a returned favor?\n\nThe philosophy behind this is that the biggest revenge you can get is making\nyour enemies watch you be…",
  "data/reddit-changemyview/r/changemyview/comments/qx6l87/cmv_the_very_people_zoomers_and_millennials_who.json": "I'm GenX, but it happened upon me one day that if any of us were afforded the\nsame opportunities and luxuries that the boomers were able to take advantage of,\nwe would have as well, it's human nature. It's not like humans evolved; we are\nthe exact same. It's just that time passed and culture…",
  "data/reddit-changemyview/r/changemyview/comments/qx8ach/cmv_i_cant_help_but_believe_that_the_belief_that.json": "Why do I think this? Well in simple terms, I've don't think I've ever heard a\ngood reason to think humanity will die out...I know that we are amazing\nsurvivors and have reached incredible levels of success and security, especially\nin the last 200 years.\n\nFactors such as our initial rise from cave…",
  "data/reddit-changemyview/r/changemyview/comments/qx8d6o/cmv_18_is_too_young_to_do_pornonlyfans.json": "So personally I don’t slut shame. I don’t think sleeping around is bad if you\ndon’t have a boyfriend and make your intentions clear and don’t manipulate. And\nI’m fine with sex work, and all for legal prostitution. BUT, despite all that I\njust think that 18-20 is too young, especially being a…",
  "data/reddit-changemyview/r/changemyview/comments/qxkpi9/cmv_most_selfidentified_great_drivers_are_the.json": "Actual good, safe drivers never state themselves to be \"good drivers\" because\nit's not a skill that needs to be spotlighted, while those who do claim to be\n\"great drivers\" are more likely to be the nutjob swerving between lanes and\nfrequently cause near crashes which only entrenches their own belief…",
  "data/reddit-changemyview/r/changemyview/comments/qxo5rw/cmv_antiwork_is_completely_impractical_in_practice.json": "For starters, I like the general idea of antiwork. I’m fairly big on leanFIRE,\nand I think a lot of the same general principles go hand in hand. I think basic\nthings like a living wage, financial independence and scaleable careers are\nimportant.\n\nThat said, it feels as though a lot of antiwork…",
  "data/reddit-changemyview/r/changemyview/comments/qxsxdr/cmv_western_nations_should_start_making_plans_to.json": "INTRODUCTION\n\nI've been to both the PRC and Taiwan, and I've enjoyed my visits to both. But\nconsidering current geopolitical trends, I believe that Taiwan's days are\nnumbered. I am very pro-democracy, but considering current geopolitical trends,\nI think our nations are well in decline, and that we…",
  "data/reddit-changemyview/r/changemyview/comments/qy6288/cmv_no_uterus_no_opinion_is_a_bad_argument_to_use.json": "I get that the point of the argument is to place emphasis on the fact that since\nmen do not have uteruses, they could never sympathise with the experience of\nwomen who have gone through an abortion (or might go through one in the future).\n\nThere's two problems with this argument:\n\n• It \"encourages\"…",
  "data/reddit-changemyview/r/changemyview/comments/qy8o1y/cmv_there_is_no_justification_to_destroy_innocent.json": "I understand the rage, I understand the sense of injustice. But that innocent\nperson had nothing to do with it.\n\nI don’t care what the reason is. You do not have a right to burn down someone’s\nbusiness who had nothing to do with the injustice being protested. You do not\nhave a right to burn their…",
  "data/reddit-changemyview/r/changemyview/comments/qybcgz/cmv_there_is_nothing_wrong_or_unethical_about.json": "You can get around 100k to 150k kcal from a single hunted large animal (wild\nboar, deer, etc.)\n\nI don't see a way to get that many calories from eating plants without killing\nsignificantly more animals and causing significantly more suffering.\n\nMost plant foods are currently produced with the help…",
  "data/reddit-changemyview/r/changemyview/comments/qyf80z/cmv_the_rittenhouse_verdict_was_correct_but.json": "There was a phrase popular in the Trump era that \"Facts don't care about your\nfeelings\", but the only standard for self-defense is that you \"feel\" your life\nwas in danger. If two people both threaten each other, both their lives are in\ndanger and both are privy to self-defense from one…",
  "data/reddit-changemyview/r/changemyview/comments/qym2xw/cmv_you_have_to_be_a_fucking_dumbass_to_let_a.json": "I understand if a running zombie gets you. Not everyone can run fast. But a\nwalking zombie, you gotta be a dumbass. Not everyone is in shape. Not everyone\nis fast. There are fat people that can't run as fast as skinny people and\nchildren can't run as fast as adults. Elderly people can't run as fast…",
  "data/reddit-changemyview/r/changemyview/comments/qyo085/cmv_it_feels_weird_that_a_woman_can_sue_the_dad.json": "I'm definitely pro choice and think it is clearly the woman's decision not the\nman's.\n\nAnd I think I understand why requiring parents to support their children even if\nthey end up leaving is a good thing for society.\n\nBut together these seem at odds with a hypothetical situation where a…",
  "data/reddit-changemyview/r/changemyview/comments/qyum3l/cmv_i_trust_a_doctor_on_tik_tok_as_much_as_doctor.json": "My girlfriend has started following people who claim to be doctors on Tik Tok.\nShe’s started telling me things like “did you know women aren’t provided any\nkind of pain medication after giving birth?”. That just sounds ridiculous, so I\nasked her where she learned it from. I told her any doctor that…",
  "data/reddit-changemyview/r/changemyview/comments/qyw74x/cmvpeople_who_work_extra_hard_at_minimum_wage.json": "I work in fast food. For a long time I gave a fuck about what I did, I tried.\nEven when we had call outs, We’re understaffed, ext. I would pick up extra slack\nto ensure that the company ran good and that my co workers felt happy in the\nenvironment we were in. Others would too in the name of the “The…",
  "data/reddit-changemyview/r/changemyview/comments/qywcv2/cmv_everyone_has_the_right_to_request_that_others.json": "Edit: to clarify, I'm referring to the LEGAL right.\n\nAs long as neither request nor refusal results in or calls for physical harm to\neither party, both are strictly matters of social contract, and fall outside the\npurview of law.\n\nPersonal interpretation: a reasonable person should try their best…",
  "data/reddit-changemyview/r/changemyview/comments/qz72s0/cmv_if_rittenhouse_was_black_this_wouldnt_of.json": "I see so many comments bring his race into the reason he got off, but if you\nreally look at everything it’s because down to the data: he didn’t break any\nlaws.\n\nSo while I agree it was a bad situation to be in, and that how things played out\nis a tragedy, he still was held accountable to the extent…",
  "data/reddit-changemyview/r/changemyview/comments/qzane6/cmv_forcing_teachers_to_put_pronouns_in_their.json": "I'm trans and I use whether or not someone have their pronouns in their\nsignature as a sign of if they're safe to come out to or not. People that don't\nhave their pronouns in their signature aren't guaranteed to be transphobic, but\nit's impossible to tell without additional context and information…",
  "data/reddit-changemyview/r/changemyview/comments/qzf123/cmv_nuclear_power_is_the_best_source_of_energy_in.json": "Nuclear energy gets some bad press, but most of this is unfounded. Nuclear\nenergy has unfortunately suffered some pretty large PR disasters in the past\n(Chernobyl, Fukushima etc) and this has understandably shaken public trust in\nits safety. Despite its bad rep, nuclear energy has consistently been…",
  "data/reddit-changemyview/r/changemyview/comments/qzgy25/cmv_the_republican_establishment_isnt_really_for.json": "IMO, a “smaller government” would have a reduced foreign military presence,\nstrive for decreased incarceration and recidivism rates, (including the removal\nof privatized prison systems which drain resources and cost the states a lot of\n$$$) less police presence, end the war on drugs, remove laws…",
  "data/reddit-changemyview/r/changemyview/comments/qzjnnk/cmv_at_the_very_least_the_united_states_should.json": "Ultimately, I think this doesn't go far enough; I think we ought to have\nsocialized healthcare for everyone. But I do understand the arguments against\nit. However, I don't think that any of these arguments hold up when we're\ntalking about children. Since children can't hold jobs, no amount of hard…",
  "data/reddit-changemyview/r/changemyview/comments/qzkc84/cmv_its_not_unreasonable_or_ethnocentric_to.json": "Until two years Ago I used to live in a neighborhood in Germany with a lot of\nTurkish and Russian immigrants.\n\nMost of them are very nice people. Regardless of their language skills.\n\nBut I don't get why someone would live in a foreign country for 10 plus years\n(or even in second generation) and not…",
  "data/reddit-changemyview/r/changemyview/comments/qzlq44/cmv_the_media_was_intentionally_misleading_the.json": "So I did not follow the Rittenhouse case on the news. I don’t watch live news, I\ndon’t watch streams, I tend to, in general, steer clear of this kind of stuff.\n\nMy only real understanding of what was going on with the Rittenhouse case was\nthe few threads I read on here and a couple clips I saw/heard…",
  "data/reddit-changemyview/r/changemyview/comments/qzn2tm/cmv_if_you_walk_around_a_us_city_open_carrying_a.json": "Under normal circumstances, the only reason to do this is to either prove a\npoint (i.e., it's 'merica and we got our right to our gun) or to intimidate\npeople. If there is active unrest and you want to sit on the roof of your own\nstore or something like that with a rifle (like many of the Korean…",
  "data/reddit-changemyview/r/changemyview/comments/qzpvy1/cmv_the_response_to_the_rittenhouse_verdict_is_a.json": "As a longtime proponent and donor to Criminal Justice Reform initiatives, I am\nextremely distraught by the reaction to the verdict by so called \"liberals\" who\nspent much of last year praising BLM protests and have, at times, done some\nactual good work in terms of criminal justice (Campaign…",
  "data/reddit-changemyview/r/changemyview/comments/qzs6nb/cmv_telling_an_incel_to_get_laid_only_does_more.json": "I have noticed that on social media, those who argue with incels tell them to\nget laid out of spite of making the incel mad. I will agree, making incels mad\nis quite funny. However, telling them to get laid will not stop them from hating\nwomen.\n\nThe creation of incels goes far deeper than the…",
  "data/reddit-changemyview/r/changemyview/comments/qzw2xq/cmv_terms_and_conditions_should_be_simplified_for.json": "Most products/services involve endless paragraphs of legal jargon and\nterminology which simply cannot be described as accessible for the average\nconsumer hence, as many surveys on the matter suggest, most consumers skim read\nor do not acknowledge, to any extent, said T&C's despite their acceptance…",
  "data/reddit-changemyview/r/changemyview/comments/r02c3e/cmv_its_bigoted_to_describe_certain_suspects_but.json": "I’m not sure how common it is around the US but you can usually tell when a\ncrime is committed by a minority by the lack of description given. My local news\nwill give a description of white people no problem even when it doesn’t\nnecessarily matter. But when it’s a minority group it’s extra…",
  "data/reddit-changemyview/r/changemyview/comments/r079eh/cmv_regardless_of_your_political_views_people_in.json": "I believe that actions speak louder than words. If you are aware of and complain\nabout the practices of a corporation - or even just a small business, I suppose\n- but you continue to spend your money there, then what you’re really saying is\nthat the value of those goods and services outweigh the…",
  "data/reddit-changemyview/r/changemyview/comments/r0bn13/cmv_the_is_nothing_paranormal_or_supernatural.json": "Ghosts, demons, deities, mythical creatures all of these claim to exist all of\nwhich are only propped up by anecdotal evidence. Video surveillance everywhere,\neveryone with a video recorder in their pockets, yet no evidence of anything\nabnormal. Mediums and psychics always being exposed as fruads.…",
  "data/reddit-changemyview/r/changemyview/comments/r0fzsx/cmv_no_one_is_entitled_to_anyones_attraction_and.json": "So my title may be a bit confusing. But there's a lot of anti-incel posts on\nreddit. Incels whine all day about how women don't date short men how women see\nshort men as \"not real men\" etc etc. People, rightfully call them out and tell\nthem to stop whining.\n\nHowever, I've seen people talk about how…",
  "data/reddit-changemyview/r/changemyview/comments/r0iojg/cmv_any_opposition_to_the_covid_vaccine_is_almost.json": "I hold this view because EVERY source I've seen that casts doubt on the safety\nor efficacy of the Covid vaccine goes right back to right-wing politics. They're\npolitical sources, they're published on political websites, they're bloggers who\nalso post right-wing political view.\n\nAny non-political…",
  "data/reddit-changemyview/r/changemyview/comments/r0pepa/cmv_all_rational_adults_have_a_right_to_die.json": "I believe that all rational agents have a right to bodily autonomy, and are\nallowed to alter or engage their own body in whatever way they see fit so long\nas it doesn't infringe on the rights of others. This would somewhat exclude\nyoung children, infants, and animals which is why we do certain…",
  "data/reddit-changemyview/r/changemyview/comments/r0pfxc/cmv_morbidly_obese_people_shouldnt_get_to.json": "As a fat person, I’m tired of seeing morbidly obese people embrace body\npositivity and glorify their horrible health choices.\n\nI understand a lot of things come into play with gaining weight. I’m not talking\nabout 200 lb people, but people who are 300+ lbs believing they are healthy and\nthat there’s…",
  "data/reddit-changemyview/r/changemyview/comments/r0s6xc/cmv_its_silly_even_stupid_from_a_business.json": "With a near 50/50 split in politics amongst Americans, taking a strong political\nstance is flat out foolish, why would you potentially eliminate half your\ncustomer base? Business and politics has no reason to be in association.\nCompanies today taking strong progressive stances are being blackballed…",
  "data/reddit-changemyview/r/changemyview/comments/r17skt/cmv_anarchy_would_make_society_worse.json": "Imagine if tomorrow, the government said that they would be removing all\nindicators of \"control\" on roads! No more lines separating lanes, no more stop\nsigns, speed limits, red lights, green lights, pedestrian crossing signs etc...\nnothing! You have total freedom to drive how YOU want to drive…",
  "data/reddit-changemyview/r/changemyview/comments/r17vby/cmv_if_the_us_doesnt_do_anything_to_its_electoral.json": "I’m sure you’ve heard of everything that’s going on in the US right now, and I\ncan’t help but ask myself what the country will look like in a few years.\n\nAs you probably know, gerrymandering allows a party (both Democrats and\nRepublicans do this) to essentially determine election results ahead of…",
  "data/reddit-changemyview/r/changemyview/comments/r1af45/cmv_even_if_he_technically_didnt_break_the_law.json": "I'll start by saying that I know most of Reddit agrees with me, but the common\nbelief among right-wing folks seems to be that Kyle Rittenhouse was doing the\nright thing during the Kenosha unrest, and that his acquittal is a victory for\nthe right to self defense in the US, so I want to give those…",
  "data/reddit-changemyview/r/changemyview/comments/r1atb1/cmv_cmv_any_company_that_requires_employees_to.json": "This isn't going to be long. If a company requires an employee to be an unpaid\nintern before becoming a paid employee, they should be required to house them\nand feed them. Simple as that. It's basically indentured servitude otherwise.\n\nAll volunteer work that is 40 hours a week or 3 full days or…",
  "data/reddit-changemyview/r/changemyview/comments/r1g6ww/cmv_reddit_outside_of_humor_and_informational.json": "This happens to include this sub, although as per Rule D I am not talking about\nthis sub in particular (and I DO still think it is entirely possible to change\nmy mind--see below.)\n\nAnyway, this is how it goes on any sub not devoted to humor or neutral topics\n(i.e. without any political, social or…",
  "data/reddit-changemyview/r/changemyview/comments/r1ofg3/cmv_ive_always_hated_work_and_will_always_hate.json": "I (41F) have worked since I was 15 and hated every minute of it. Work just takes\naway from stuff I would rather be doing and honestly it depresses me and angers\nme so much that even during my off time I often don't end up doing what I want\nto do because I'm so pissed that I had to work and dread…",
  "data/reddit-changemyview/r/changemyview/comments/r1uupq/cmv_people_that_enjoy_seeing_criminals_getting.json": "I'll never enjoy seeing someone getting hurt or killed no matter how \"bad\" of a\nperson they are. even if they were literally Hitler.\n\nIt happens often on reddit that I see posts about vigilante violence, or for\nexample bikes being left unsupervised and trapped to hurt the thief, and people\nin the…",
  "data/reddit-changemyview/r/changemyview/comments/r20cye/cmv_the_lack_of_substantial_reporting_from_many.json": "When I google \"Darrell Brooks\" and look at news in the past 24 hours, the only\nmajor outlets having any stories about this are Fox News and New York Post. CNN,\nMSNBC, NBC, ABC, Washington Post, New York Times are all missing. There are also\nsome local smaller outlets reporting on this.\n\nThis should…",
  "data/reddit-changemyview/r/changemyview/comments/r26rmb/cmv_smash_and_grabs_are_dangerous_and_should_not.json": "This attitude is especially prevalent on twitter: \"Nordstrom is a multi-billion\ndollar company, who cares if they lose a few thousand dollars worth of\ninventory, they can just replace it.\" The way people frame it, the people who\nare against smash and grabs are the problem because they aren't talking…",
  "data/reddit-changemyview/r/changemyview/comments/r27gug/cmv_as_long_as_there_is_a_risk_of_executing.json": "For a while I have supported the death penalty, but I now realise that the\nargument of executing innocent people is above all.\n\nAs long as there is a risk of executing innocent people, the death penalty\nshould not exist in society.\n\nIt is estimated that at least 4% of people on death row are…",
  "data/reddit-changemyview/r/changemyview/comments/r2bcqc/cmv_real_communism_has_never_been_tried_is_a.json": " 1. Real communism may have not ever been achieved, but it has certainly been\n    attempted, and to ignore that ignores the real and tangible contributions of\n    real people to the theory and practice of socialism. Mao, Lenin, Castro and\n    Stalin all read and wrote extensively about Marxist…",
  "data/reddit-changemyview/r/changemyview/comments/r2kckj/cmv_crypto_in_general_is_a_glorified_gambling.json": "Now hear me out before. I really REALLY lack and proper education on the subject\nbut I’ve heard from many their disapproval to the concept and at the same time\nheard friends speaking of it as ”get rich quick” schemes, which imo sounds to\ngood to be true. Now I really want to become knowledgeable on…",
  "data/reddit-changemyview/r/changemyview/comments/r2l172/cmvdoctors_are_totally_justified_to_request_exams.json": "It got me thinking about it after I read the testimony of this black woman from\nSouth Africa. She moved to another country and went to the doctor. Although the\nwoman didn't show any related symptoms, the doctor requested her do an HIV test\n\"because she is from Africa\". The patient sees this as…",
  "data/reddit-changemyview/r/changemyview/comments/r2rlkn/cmv_nuns_habits_are_not_equivalent_to_the_hijab.json": "Nowadays, women who enter religious orders must be eighteen and leaving at any\ntime is permissible, even if you've sworn your vows. Dispensation is a very real\nthing and even then, fully joining takes years (I know someone who just got her\nfinal vows and she started in 2007). There are dozens of…",
  "data/reddit-changemyview/r/changemyview/comments/r2tdvu/cmv_the_blind_hug_trend_and_others_arent.json": "Imagine you’re walking down the street and see someone with a sign that says “If\nyou’re having a bad day, you can hug me”. You hug the person, maybe talk to them\nabout your troubles and go on about your day.\n\nExcept then they stop you and say “hey this is actually a social experiment. Can\nI use you…",
  "data/reddit-changemyview/r/changemyview/comments/r2yy3g/cmv_video_games_have_saved_millions_of_lives_by.json": "Video games have surely prevented death and injury to millions of people in the\nworld by distracting their players and preventing them from drug\nrelapses/suicide/depression, possibly assault, alcoholism, drunk driving, and\npossibly hundreds more generally-death or injury prone circumstances. I…",
  "data/reddit-changemyview/r/changemyview/comments/r3d82x/cmv_forcing_people_to_identify_by_their_race.json": "Racism is inherently a collectivist ideology: people from one group are taught\nto view themselves as inherently superior to another group based on their\ncollective identity and the positive attributes they associate it with at the\nexpense of another group whom they view as inferior. White supremacy…",
  "data/reddit-changemyview/r/changemyview/comments/r3g7pc/cmv_allowing_racism_on_twitter_against_whites.json": "Simple and short. Twitter allows all sorts of racism, and race baiting against\n\"whites\" like it's perfectly fine. All this does is creates an even deeper\ndivision\n\nHow many tweets, that still exist today, did you see about the Christmas parade\nvictims deserving it. Or it being karma.\n\nHow many…",
  "data/reddit-changemyview/r/changemyview/comments/r3mh61/cmv_showers_are_better_than_baths_when_the.json": "I totally understand there are valid reasons to take a nice warm bath. If you're\nlooking to relax, or soothe your muscles for instance, then I get the whole bath\nthing. I'm pretty sure baths are really good for exfoliating skin as well.\nHowever when we are talking about cleanliness I would argue…",
  "data/reddit-changemyview/r/changemyview/comments/r3myrg/cmv_its_totally_normal_to_want_to_be_with_someone.json": "It's funny these posts I see like. \"I told a guy I wouldn't date him and now he\nwon't talk to me??\"\n\nIt's such a strange perspective. I have friends because we share specific\nhobbies or have known each other since we were kids. Romantic relationships are\na different thing. I've had women say they…",
  "data/reddit-changemyview/r/changemyview/comments/r3sjsb/cmv_the_term_privilege_is_toxic_and_not_conducive.json": "Firstly I have to preface that although i did face bullying/harassment based on\nmy sexual orientation, size and general physical appearance, I've never faced\nracial discrimination. So i only have a partial experience of the things I'll be\ntalking about.\n\nI also wanna say that i entirely acknowledge…",
  "data/reddit-changemyview/r/changemyview/comments/r40wos/cmv_mask_mandates_are_necessary_as_people_are.json": "For context, I live in Scotland, which does have mask mandates from the\ngovernment, and recently traveled to England, which does not (I think they might\nhave starting yesterday because of the decepticon varient or whatever, but they\ndidn't when I travelled a month or so ago). In Scotland, 95% of…",
  "data/reddit-changemyview/r/changemyview/comments/r454ng/cmv_we_should_stop_using_the_term_latinx.json": "I admit it will be very difficult to change my view as I feel very strongly on\nthis but I am open to reconsidering my view.\n\n 1. The term is completely unpronounceable in Spanish the way that people intend\n    for it to be pronounced. If the people for whom the word is intended cannot\n    even…",
  "data/reddit-changemyview/r/changemyview/comments/r4f7ps/cmv_the_us_government_should_prefill_all_tax_forms.json": "I have been a volunteer tax preparer and seen firsthand how the bureaucratic\nminutia can overwhelm some people (especially low-income folks) and lead to late\nfees and other penalties when they fill out their taxes incorrectly. I'm not\nsure what good reason there is to make everyone do it themselves…",
  "data/reddit-changemyview/r/changemyview/comments/r4ouc3/cmv_it_is_by_no_means_obvious_that_intelligent.json": "For the purpose of this post I will be defining intelligent life as an organism\nwith comparable or superior mental capabilities to our own.\n\nI feel like it's a fairly commonly held belief especially among relatively young\npeople that not only is there probably some intelligent life out there, but…",
  "data/reddit-changemyview/r/changemyview/comments/r4t3e8/cmv_transitional_kindergarten_and_kindergarten_45.json": "T-K (transitional Kindergarten) students, and I would argue kindergarten as\nwell, probably through most of early elementary, should not receive homework at\nall, especially graded homework.\n\nMy son is 5 years old, as of yesterday, but he’s been enrolled in a transitional\nkindergarten program at the…",
  "data/reddit-changemyview/r/changemyview/comments/r4xge3/cmv_paying_child_support_if_you_find_out_that_you.json": "Some time ago, a friend of mine found out through DNA test is not the father of\neither his son and daugther. Both of them are relatively young.\n\nHe filed for divorce and obtained it, but since then he has to pay child support\nwhich comes out as more than half his paycheck. Plus he has rent and bills…",
  "data/reddit-changemyview/r/changemyview/comments/r5548e/cmv_signatures_are_an_antiquated_useless_system.json": "TO BE CLEAR, By useless I mean \"Ineffective at doing what they intend to do\". In\nthis context, that means identifying the person in question\n\nBasically any time a signature is used. it's purpose is useless. Here are some\nexamples:\n\n 1. A signature at the bottom of a formal email, next to their name…",
  "data/reddit-changemyview/r/changemyview/comments/r55cz4/cmv_the_best_way_to_combat_the_gender_pay_gap_is.json": "I should preface this by saying I have absolutely no background in economics. I\nhaven't arrived at the view I'm about to outline through research, but simply\nthrough thinking about it. The reason I'm making this post is to hopefully hear\nfrom people who have a better grasp on this stuff than me. I'm…"
}