{
  "data/reddit-ask/r/TooAfraidToAsk/comments/ru93cu/why_are_the_covid_variants_promoted_as_a_bad.json": "<!-- SC_OFF --><div class=\"md\"><p>From what I understand, a virus needs a host\nin order to replicate. If the virus is killing the host, it has less of a chance\nof being transmitted.</p> <p>So in subsequent mutations the virus will become\nless deadly but more easily spread.</p> <p>After a number of…",
  "data/reddit-ask/r/askscience/comments/rubcq6/where_does_gut_bacteria_come_from_and_how_does_it.json": "My understanding\n\nGut bacteria is single cell bacteria of foreign DNA, that interacts with the\nfood we have chewed and broken down with stomach acid. It breaks down the food\ninto more basic compounds that are easily absorbed into the walls of the\nintestines.\n\nThe bacteria species are different at…",
  "data/reddit-ask/r/askscience/comments/rud4gd/is_a_single_vertical_propeller_enough_for_full.json": "I’ve seen a toy floating around my advertisements that looks like a small ball\nwith a fan on the inside. You’re supposed to be able to toss it and it will come\nback to you. It’s called the fly orb.\n\nMy question is though, is this single “propeller” enough to give this toy full\nflight capabilities…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rumot4/why_is_there_a_gay_accent.json": "Why is there a stereotypical gay accent? What causes it? And is there any major\nchange between regions or is it semi static?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ruf0jw/why_do_a_lot_of_people_think_black_people_cant_be.json": "Full disclosure: I am not American, I live in America however and I believe that\nI understand the history of this country to some degree and the sensitivity that\ncomes with this topic.\n\nThat being said, I am genuinely trying to understand why a lot of people have\nthat notion (title). Do people mean…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rultma/if_i_wanted_to_experiment_with_prostate.json": "The idea of having a fake penis in my butt doesn’t exactly get my motor going.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rut46t/why_is_anal_so_popular.json": "IMO anal seems so gross and useless when you have a vagina right next to it. Why\nwould anyone want to have anal?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rugano/why_do_so_many_weed_smokers_seem_to_have_a_need.json": "I realize there is far more that don't. And I have nothing against smoking, it\njust seems odd to me.\n\nEDIT: thankyou all for your time responding, I have learned a fair bit thanks to\nyou all sharing your opinions and experiences. It seems it is mainly due to a\nmixture of the legalization of…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/run3n9/are_we_just_waiting_out_covid_at_this_point.json": "If you’re going to respond about how covid is fake or vaccines are about\ncontrol, don’t bother responding.\n\nBut at this point, most everyone is eligible to get vaccinated. While the\nvaccine does not prevent the spread of Covid, it does reduce risk of\nhospitalization. People who do not get…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rusxdb/why_dont_people_google_things_they_want_to_know.json": "For example: I just saw someone ask in this sub what OP means on reddit. But\nthis extends into bigger things like climate change, politics, social issues,\nscience, etc. Even simple things like is this image I see on Facebook\nphotoshopped, or what's a substitute for butter in a recipe.\n\nI'm not…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ruifo6/what_if_youve_been_following_the_wrong_religion.json": "This is probably a more opinion based questions but... What do you think happens\nwhen someone has been following \"the wrong religion\"?\n\nAs in if someone is of religion X and has been good according to the teachings,\nbut then dies and ends up being judged in the way of religion Y... Would they go\nto…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ru7spr/do_guys_actually_care_if_a_girl_has_the_lower.json": "i’m kinda insecure about it and becoming intimate with a s/o because of it so i\njust wanna know what guys really think of it",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ruq2wu/why_are_the_changes_in_the_voting_laws_in_the_us.json": "I'm European, and every voter has to show his or her ID to be able to vote. I\ncan't wrap my head around the idea that identity of a person trying to vote\nisn't verified before they can vote.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ru7ika/why_does_rich_celebrities_gather_money_for.json": "All i mean is, you are a celebrity or an streamer or something else, why do you\ngather money from other people and give it to charity by your name! This is\nweird for me! I don't get it!",
  "data/reddit-ask/r/NoStupidQuestions/comments/ruonri/a_question_for_men.json": "basically when women are out walking alone at night, and there’s a guy walking\nbehind, we usually get nervous ans panic a bit and hope it’s not a murderer or a\nkidnapper or something like that\n\ndo you guys usually think ”damn how can i make myself not scary when heading the\nsame direction as…",
  "data/reddit-ask/r/NoStupidQuestions/comments/ruc9al/is_reddit_kinda_toxic_i_really_feel_that_always.json": "It's like people always wanted to villanize you. If I ask in a parenthood group,\nI sucks as a father, \"you should've done....\" If I ask in a relationship advice\ngroup \"find new friends\"\n\nEdited: thanks a lot guys for your answers, they gave me a better view.",
  "data/reddit-ask/r/NoStupidQuestions/comments/rul8ln/apple_pear_grape_orange_cranberry_etc_juices_are.json": "I have literally never seen pure strawberry juice being sold at a grocery store\n- it's always mixed in with other fruits such as cranberries or kiwis.\n\nIs there a reason why strawberry juice is never sold on its own?",
  "data/reddit-ask/r/NoStupidQuestions/comments/rutcnu/why_cant_porn_just_have_a_believable_and.json": "Like I can't be the only one who either skips through the plot part of straight\nup mutes it, right?\n\nEdit: I probably should have mentioned that I search by specific porn stars. I\nhave many people replying that normal porn does exist and that I'm just not\nlooking hard enough for it, and that's…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ruqd0v/why_do_people_post_the_same_obvious_shit_on_here.json": "I dont come on here to wage comment wars and get empty likes for saying things\npeople just agree with.",
  "data/reddit-ask/r/askscience/comments/ruzsp7/when_a_huge_piece_of_ice_calves_off_a_glacierice.json": "I hope this lengthy question makes sense. Essentially, I have always wondered\nwhether sea levels around the world rise simultaneously when something large\nenters the ocean (e.g. an iceberg forms in Greenland and sea levels in the\nPacific rise immediately once the initial wave caused by the falling…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ruzyuy/i_cant_find_one_of_my_balls_please_help.json": "So I was beating my meat and usually my right ball goes inside of me and I can\neasily push it back out but this time it’s my left one. I can’t push it out\ncause idk where it’s at. I only have one right now!!!!!",
  "data/reddit-ask/r/AskWomen/comments/ruvdmg/what_is_your_goto_depression_meal.json": "Mine is fried fish fingers with rice and mayonnaise",
  "data/reddit-ask/r/NoStupidQuestions/comments/rv1oxp/would_i_be_able_to_win_a_fight_with_a_silverback.json": "I‘m a pretty built guy with 220lbs at a height of about 5‘10 and I‘ve been\nboxing/kickboxing for over 9 years. I also did some Karate when I was 8 (lol).\n\nDo you think I would be able to defeat a Silverback Gorilla if I had a baseball\nbat?",
  "data/reddit-ask/r/AskHistorians/comments/rutbd2/how_did_native_americans_protect_themselves_from.json": "Like I'm sure it varies from civilization to civilization, but even now with all\nthe protective measures we have in place we're pretty vulnerable, and they\ndidn't have cars to drive to safety",
  "data/reddit-ask/r/AskHistorians/comments/rv2lho/monday_methods_why_are_there_letters_in_the_ogham.json": "Happy New Year to all, and a special thanks to the mods for this brief foray\ninto some philology!\n\nI have attempted to write this in a way that is accessible and comprehensible to\na general reader, as well as attempting to remain relatively concise, and thus\nthere are, of course, areas upon which I…",
  "data/reddit-ask/r/AskHistorians/comments/rv081l/is_there_any_truth_to_the_story_that_paypal.json": "I've heard semi-knowledgable people state that PayPal effectively sourced a\nsubstantial portion of its early funds by accepting payments from customers, but\nthen would not pass on the funds to the recipients. The idea was that targeted\nusers would be given 'payment error' notices that implied that…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rv5s7t/men_of_reddit_do_you_look_at_other_women_despite.json": "I love my partner and would never do or dream of doing anything. However, I\ncan't help but look at other women and think wow she has a gorgeous face or wow\nthat's a nice butt (and stare a bit too long). I don't vocally say anything and\nI don't think it affects my relationship but I'm wondering if…",
  "data/reddit-ask/r/NoStupidQuestions/comments/rv59ef/damn_so_im_19_and_i_inherited_120k_from_my.json": "Like i don't wanna drink it away. Even tho I'm tempted.",
  "data/reddit-ask/r/NoStupidQuestions/comments/rv6hwv/why_do_old_people_stand_in_everyones_way_in_the.json": "I ask this not to be rude, but out of genuine curiosity. There has been many a\ntime where I’ve been at the grocery store, and old people are standing in the\nmiddle of the aisle with their carts either talking to someone or shopping, and\nthey make no effort to move out of the way, and appear…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rv3785/if_people_think_abortion_is_murder_why_do_they.json": "I am serious. I really can’t figure out why people believe that these women are\nmurders, and why on earth they would want that same “murderer” to birth a child\nand raise it.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rv2ukl/why_is_jk_rowling_so_hated_all_of_a_sudden.json": "What did she say that make people treat her like Satan?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ruwmqi/how_the_fuck_do_you_smalltalk.json": "i can’t do it. i just genuinely can’t hold conversations with anyone that\nrequires small chat. not only that but i am visibly awkward during these\nconversations, i can’t form sentences and i start stuttering and just nod in\nsilence. it’s embarrassing. what the hell are you even meant to talk…",
  "data/reddit-ask/r/askphilosophy/comments/ruzpvj/is_there_a_point_in_reading_criticism_of.json": "Now obviously there literally are things I can do such as vote, treat people\nbetter, limit my usage of certain things but I hope you can understand what I'm\nsaying here. I can't really see a way to fundamentally change the human\ncondition I live under\n\nIt worries me that many theorists such as…",
  "data/reddit-ask/r/AskWomen/comments/rus494/what_movie_always_turns_you_into_a_sobbing_mess.json": "Update: thanks for the award and all the responses! And by the way mine is\nLegends of the Fall. Quality ugly cry guaranteed every time 👌",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rvcfi4/22f_black_i_do_not_support_black_lives_matter_as.json": "As a black woman, I hate Black Lives Matter as a movement, but love it as a\nsimple message. I do not believe funding or time is being spent to actually\nfurther the ENTIRE black community but only make a very small percentage richer.\n\nIm tired of the organizations saying their goal is to help black…",
  "data/reddit-ask/r/NoStupidQuestions/comments/rv2v4j/why_do_we_have_the_bad_feeling_before_returning.json": "I’m returning to work tomorrow and for the life of me, I’m having the bad\nexistential stomach churning experience. I’m in my late 20’s now and I know from\nthe past it’s nothing, I will show up to work and it will be like before I left\nat Christmas. Same as when we used to return back to school.\n\nSo…",
  "data/reddit-ask/r/AskHistorians/comments/rv9tew/does_anyone_have_any_info_about_the_mythical.json": "Ok, the headline sounds insane, but this Vanity Fair article\n[https://www.vanityfair.com/news/2008/05/jewish200805] has the following quote:\n\n> The last stop of this meditation is Zagorsk, Russia, where, troubled by the\n> anti-Semitism he encountered there, my friend Andrew Solomon asked a local\n>…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rvh4ai/is_it_judgmental_if_i_lose_interest_in_being.json": "My best friend is almost 30 years old, never had a job, and plays video games\n24/7.\n\nI’ve tried helping her find a job and live a healthy lifestyle, and she always\nacts like she wants to but doesn’t put in any effort, I even wrote her resume\nfor her once. (I had to make it up because she had no…",
  "data/reddit-ask/r/askscience/comments/rvepm4/when_you_successfully_fight_off_a_mutated.json": "This question is geared towards the Omicron Covid-19 outbreak, but really\nextends to the immune system in general.\n\nAfter receiving a booster of the Covid-19 vaccine, your body will produce\nantibodies targeting the original strain of the virus. Even though the potency\nof the antibodies against the…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rvfzc6/girls_why_do_you_do_this.json": "I’ve slept/made out with a few girls that had a habit of not just gently\nsqueezing my balls but literally crushing them. It really hurts and isn’t even\nsexy painful. Even when I bring tell them “hang on”, they stop but as soon as\nthey touch me again they hurt me. One even blamed their nails instead…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rvj3j7/what_is_more_exhausting_than_arguing_about_covid.json": "Is anyone else just sick and tired of arguing about the same shit everyday? Can\nwe just argue about fun things like is TB12 the GOAT or should Bonds and Clemens\nbe in the HOF? Is Christmas better than Thanksgiving? What’s better drakes or\nlittle Debbie’s?\n\nCome on people life should be fun not…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rvkwfr/waitso_people_dont_talk_to_themselves.json": "Howdy, ever since I was a kid i would talk to myself, not in the I have an\nimaginary friend or split personalities sense but more of narration. I'll say,\n\"okay, got my phone, keys, wallet, oh and I can't forget those papers for the\ndoctor\" or at work I'll say \"okay I need 16 packages of 11487 where…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rvpvml/are_most_men_plagued_with_skid_marks_in_their.json": "So I’m honestly just not sure at this point. I once lent some white basketball\nshorts to my dad when he wasn’t doing so great financially, and was living with\nme at my apartment. When I finally got them back after literal weeks (he’s the\nopposite of a punctual person) there were… um… well 💩 stains…",
  "data/reddit-ask/r/AskWomen/comments/rvk4v7/for_those_of_you_with_careers_you_actually_enjoy.json": "Edit: Wow! Thank you so much to everyone who shared their responses. I woke up\nto so many lovely answers. I might not be able to respond to them all but I will\ndefinitely read and appreciate them when I get back from work. Have a great\nday/night wherever you are in the world!",
  "data/reddit-ask/r/NoStupidQuestions/comments/rvqqfu/do_people_actually_prefer_to_not_wear_pants_when.json": "Ever since the pandemic started, I've heard jokes about people going on a Zoom\nmeeting without any pants and looking professional from the waist up. Hell, even\nbefore covid, I've heard about people walking around the house with no pants on,\nparticularly when they're home alone.\n\nIs this an actual…",
  "data/reddit-ask/r/NoStupidQuestions/comments/rvr1x2/am_i_wasting_my_life.json": "So I’m 19, and I have a lot of regrets.\n\nI was always a socially awkward kid, but I was pretty ok until high school where\nI got a lot more socially isolated and my grades stated slipping.\n\nNow I’m a college student.Except I don’t even go to campus and do college\nonline.This means I live at home and…",
  "data/reddit-ask/r/AskHistorians/comments/rvskca/the_famous_rumble_in_the_jungle_fight_between_ali.json": "Even accepting the fight was the biggest sporting event in the world, that\nnumber has to be way off right?\n\nThat would mean that over a quarter of the world population would have to be:\n\ninterested in the fight\n\nAwake\n\nNot working\n\nWith access to a television\n\nThat seems hard to believe to me, yet…",
  "data/reddit-ask/r/askscience/comments/rvuohl/does_repeated_exposure_to_covid_after_initial.json": "I’ve read that viral load seems to play a part in severity of COVID infection,\nmy question is this:\n\nSay a person is exposed to a low viral load and is infected, then within the\nnext 24-72 hours they are exposed again to a higher viral load. Is there a\ncumulative effect that will cause this person…",
  "data/reddit-ask/r/NoStupidQuestions/comments/rvsg11/when_exactly_does_water_become_unsafe_to_consume.json": "Let's say I fill up a clean glass with clean filtered water. I set it on a clean\ncoffee table of a clean, well maintained home, that's always kept at 72°F\n(22°C). The home is well insulated and there are no pets or insects inside.\nLet's say that 2 people live there. Life goes on and the glass just…",
  "data/reddit-ask/r/AskHistorians/comments/rvrssg/when_did_women_stop_working.json": "Hello everyone! I was listening to some ultra conservative guy talking about\ntraditional gender roles and how women should not go out to work and it made me\nwonder, how traditional is that really? In my head I have this image of women\nworking in the medical period and up to the 19th century, then…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rvizu2/is_it_acceptable_to_cut_ties_with_siblings.json": "For context: I am the youngest, 12 years gap between my older sister. I have 4\nsisters, but only one is greedy, manipulative and self-serving. I have witnessed\nhow she almost manipulated my parents into signing off land to her name, never\npaid debts she owed my parents, almost always causing them…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rvupw0/are_there_men_out_there_actually_fucking_with.json": "We all know how it’s a fun gift at a birthday for one of your friends in a dry\nspell. Or letting them sit on your shoulder during a music festival and they\n“die” within a few hours after your first beer.\n\nBut the thing I’m very affraid to ask, but very curious about.. Are there\nactually men…",
  "data/reddit-ask/r/AskWomen/comments/rw14k5/what_happened_when_you_found_a_reddit_post.json": "As in, did you ever find a post written about you from a friend, peer, (ex) SO,\netc.? What happened?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rw2c08/what_gives_predominantly_black_male_music_artists.json": "I noticed on social media and im interviews mainly black male artists refer to\nwomen as bitches or females. Even as far as calling their past or current wives\ngfs their bitch. Yet there is no outrage, but I never see other races refer to\nwomen in this way.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rw5yh0/is_adult_life_really_as_miserable_as_people_make.json": "Everyone on Reddit once they have reached 18 makes it seem that living the adult\nlife is awful. That we are all dirt poor, living paycheck to paycheck, working\nevery day of your life, never having time for hobbies, being more aware of the\nshit world around us.\n\nThat's the pattern I see around me…",
  "data/reddit-ask/r/askscience/comments/rvuzcv/many_emojis_have_taken_on_their_own_meanings_from.json": "For example if we were to keep seeing a picture of an animal, how would we know\nthey mean that animal, instead of perhaps that meaning something completely\ndifferent due to a cultural meme at the time.\n\nIt could instead be related to virtually anything, just as many of our emojis\nhave already taken…",
  "data/reddit-ask/r/AskHistorians/comments/rvz8y1/what_actually_is_the_origin_of_the_half_your_age.json": "A Google search\n[https://www.google.com/search?q=half+your+age+plus+seven+origin&hl=en] reveals\na variety of results:\n\n> In the 1950s, Nation of Islam leader Elijah Muhammad “taught that a wife's\n> ideal age was half the man's age plus seven”;\n> \n> Half your age plus seven is an unofficial rule of…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rvzcv0/i_find_reddits_humor_exhausting_is_this_common.json": "No, they are not exactly offensive but they are just too repetitive and so\nunoriginal. I swear I know what the top 5 comments are going to be just from the\ntitle and content.\n\nI'm not a funny guy, not gonna lie and I don't try to be at all. I don't do\nhumor and I might be genuinely the least funny…",
  "data/reddit-ask/r/NoStupidQuestions/comments/rw5cfz/over_the_years_lol_and_lmao_have_prevailed_in.json": "I remember seeing ROFL a lot more about a decade ago, along with the other two\nmentioned. But it seems like over the years it’s been getting used less.\n\nWhy do we think this one was left behind?",
  "data/reddit-ask/r/NoStupidQuestions/comments/rw7c2m/why_in_the_fucking_hell_do_companies_refuse_to.json": "It makes no sense to me. I'm not talking about burger flipping jobs either, I\nmean jobs that require a degree or years of experience in a certain field.\nPeople who already have experience (i.e. already have a fucking job) aren't\ngoing to apply to another job if they don't know how much money they…",
  "data/reddit-ask/r/AskHistorians/comments/rvx4q1/its_time_to_vote_for_the_best_of_askhistorians.json": "2021 has concluded, and that means it is time to look back and reflect on all\nthe amazing content that was written on the subreddit this past year.\n\nAnd while every single answer, and writer, who contributed over the past year\ndeserves recognition for the part they played in making this such an…",
  "data/reddit-ask/r/AskHistorians/comments/rvvpuf/from_1824_to_the_1980s_nycs_ticker_tape_parades.json": "The first major parade in NYC was for the returning revolutionary war hero, the\nMarquis de Lafayette in 1824.\n\nYou an read the full list of honorees here\n[https://en.wikipedia.org/wiki/List_of_ticker-tape_parades_in_New_York_City].\n\nBut it's striking how the parades go from mostly honoring…",
  "data/reddit-ask/r/AskHistorians/comments/rw9ef2/in_the_game_return_of_the_obra_dinn_the_titular.json": "For example, the ship's carpenter and his mate are Americans, the Bosun and his\nmate are from Austria and France, respectively. There are also New Guinean,\nRussian, Chinese, Danish, Swedish, etc topmen and seamen serving as crewmates.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rw6ybb/if_god_gave_us_free_will_why_would_he_condemn_us.json": "Seems to me a bit manipulative. Like when a bf/gf says “do whatever you want,”\nbut really they expect a certain outcome. Either God is not whom we think he is\nor he just doesn’t care and the idea of sin/free will is a human concept.\n\nEdit: For context, I am an ex charismatic/evangelical Christian…",
  "data/reddit-ask/r/AskHistorians/comments/rwee8b/how_prevalent_was_nazi_sympathizing_in_germany_in.json": "With society’s current struggles against disinformation, I’m wondering how\ndifficult it was to convince people who were subjected to a totalitarian state\nand it’s propaganda for over a decade that everything they’d been led to believe\nabout race, the government, their leaders, the war, etc was…",
  "data/reddit-ask/r/AskHistorians/comments/rw7a1o/what_caused_the_tokugawa_shogunate_to_stop_within.json": "At the start of the 1600s the country had a strong modern military, with tons of\nexperience and was newly United.\n\nHowever after a failed invasion of Korea they retreated into military isolation.\nWhy? Why didn’t they ever try expanding again?",
  "data/reddit-ask/r/AskHistorians/comments/rwf4fu/how_did_other_nations_besides_japan_and_the_usa.json": "Hey so I'm just curious, how did other nations of the world react to the atomic\nbombings of Japan? Were these nations shocked by the power of the bomb or were\nthey aware of it's development more than we were lead to believe?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rvw5fo/i_earned_money_from_crypto_and_idk_how_to_tell_my.json": "I recently joined an airdrop for a new crypto and was able to sell it for about\n140 USD i was able to use it to get amazon pay gift cards and i used it to buy a\nheadset and a ps5 controller.\n\nNow the hard part my package arrives in 3 days but I as a 15 yo teen boy dont\nknow how to tell my parents…",
  "data/reddit-ask/r/NoStupidQuestions/comments/rw7obw/im_canadian_visiting_usa_for_the_first_time_ive.json": "I'm visiting Alaska to meet my girlfriend's family and there was this big family\ngathering. I made blueberry cheesecake from scratch, even boiled down\nblueberries to make a syrup. It was nice. Maybe a couple people had a piece. I\nended up picking at it over the next few days but ended up throwing…",
  "data/reddit-ask/r/AskHistorians/comments/rw3eqj/why_do_we_surf_the_internet.json": "When did the metaphor of “surfing” the Internet come about? How did early\nnetizens conceptualize using the Internet, and were there competing metaphors?",
  "data/reddit-ask/r/NoStupidQuestions/comments/rwet8u/can_i_put_regular_bacon_in_the_microwave.json": "I don’t have time to cook it I am not sober and I am starving I want to make it\nquick PLEASE TELL ME J CAN HEAT IT UP\n\nFor all of you who told me I couldn’t make boiled eggs in the microwave I have\nsuccessfully finished bacon and boiled eggs in the microwave for 10 minutes!!",
  "data/reddit-ask/r/askscience/comments/rwmkru/are_there_any_organisms_that_consume_viruses.json": "Not thinking multicellular likely a marine plankton or small single called\nprotists",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rwk7fq/how_is_it_so_common_for_people_on_internet_to.json": "I'm european and I work around 40h a week and in american dollars I'm making\nlike 19k a year (I'm not very far from minimum wage) but making 100k would be\nlike making 8.3k a month which would mean, even if you work 60 hours a week,\nthat you make four times more than me for the same time worked, and…",
  "data/reddit-ask/r/NoStupidQuestions/comments/rwk2j4/what_do_americans_say_before_eating.json": "I am from germany and we say \"Guten Appetit\"- \"good appetite\", what do smerican\nor in generall english people say before eating something?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rwnrb8/is_turning_a_decent_guy_into_a_stalker_funny_to.json": "Yesterday night, two friends of mine (L and K) pranked me but I think it went\ntoo far. I didn't get mad at them or anything because they seemed like they\nreally meant it as a joke but it'll be hard for me to trust them again in the\nfuture.\n\nBasically, there's this guy (I'll call him B) who has a…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rwqro5/is_everyone_else_really_poor_right_now.json": "My wife and I make roughly 125k a year. She makes about 75, and I make 50.\n\nWe have two kids, a $1,600 mortgage, two cars, and I work from home (pre\npandemic)\n\nThe past few months I'm noticing our monthly expenses and bills have really gone\nup. I felt like we went from being a middle class family…",
  "data/reddit-ask/r/NoStupidQuestions/comments/rwpz7m/what_logical_reason_is_there_to_wear_shoes_in_the.json": "Even though im American born, my parents are immigrants and grew up never\nwearing shoes in the house. When I walked into friends houses, I find it so\ndisgusting they walk anywhere like on carpet or even to bed. To my knowledge it\nseems to be very American thing. Everyone else seemed to have the…",
  "data/reddit-ask/r/AskHistorians/comments/rwpz4q/why_do_the_german_and_english_wikipedia_articles.json": "It's interesting how different the English and German wiki are when it comes to\nthe fifth column. The German one cites Historian Jochen Bohler\n[https://de.wikipedia.org/wiki/Jochen_B%C3%B6hler] saying local German sabatoge\ncannot be…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rwo9hh/should_i_have_sex_with_my_friend.json": "Backstory: This girl and me, we are friends now for at least 15 years, probably\nlonger. We met each other in an online chat game for kids. And since then, we\nkept staying in contact, it definetly got less year after year, but still. In\nall this time we never met each other irl tough.\n\nMaybe it's…",
  "data/reddit-ask/r/NoStupidQuestions/comments/rwr2g3/what_would_happen_if_you_submerged_your_poop_in.json": "Would all (99%) of the germs die? Would it be effectively sanitized? Could you\nrub it on an open wound and be fine??\n\nThese questions keep me up at night.",
  "data/reddit-ask/r/NoStupidQuestions/comments/rwos73/is_it_okay_to_walk_around_in_pajamas_or.json": "I've always considered it acceptable that if I want a soda at 1AM, it's okay to\ngo to the vending machine in \"movie sleepover\" level clothes. Or if I'm up in\nthe morning but not ready to go yet.\n\nBut I'm starting to wonder if that's really weird, lol. The more I've stayed at\nhotels, I've noticed…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rwawkg/should_i_26f_throw_away_my_spongebob_bed_sheets.json": "I don't know. As I am getting older will people judge me to be immature? The\nsheets are in good condition and I don't want to throw them away for the sake of\ngrowing up. What are you guy's opinion?",
  "data/reddit-ask/r/NoStupidQuestions/comments/rx13qx/do_people_actually_party_and_have_sexone_night.json": "Serious question. Is this something that actually happens?\n\nI'm in 3rd year of my college and I've never seen any parties or sex, or heard\nabout people hooking up.\n\nI'm a virgin and was hoping college would allow me to get out there and gain\nsome experience, but it doesn't seem like that actually…",
  "data/reddit-ask/r/NoStupidQuestions/comments/rws8wv/does_anybody_else_automatically_hate_places_that.json": "Everybody has their right to choose who they voted but when they have stickers\nor have MAGA flags or Biden flags then I automatically assume their products\nsuck and they aren't focused on the quality of service as much as their need to\nadvertise their political views",
  "data/reddit-ask/r/NoStupidQuestions/comments/rwxw63/my_boyfriend26m_thinks_i_23_f_am_stupid_and_i.json": "So my boyfriend is highly educated in the field of science. We started dating a\nfew month ago. I have no university degree and I never wanted to study or\nanything. But somehow being around him and his friends who are all scientists I\nfelt I want to do something with my life too. Right now I work at…",
  "data/reddit-ask/r/askscience/comments/rwzzju/do_hormones_in_toddler_boys_and_girls_really.json": "As a parent I have heard people repeatedly make comments about how boys are so\nmuch harder to raise because of their hormones. I’m not talking about pubescent\nkids, people make this kind of comment about my 3 year old and even my 1 year\nold. I always assume this is just sexist thinking but is there…",
  "data/reddit-ask/r/AskHistorians/comments/rwy8b9/why_was_there_not_a_bigger_issue_when_the_final.json": "I was only 12 at the time, but I didn’t even know until last year that Gore won\nFlorida. All I remember is hanging chads, recounts, but nothing about Gore being\nthe rightful winner. From a child’s perspective, it must have been swept under\nthe rug because I remember nothing about it and don’t…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rx27nt/should_we_keep_going_while_a_girl_is_having_an.json": "I know that you should stop when they’re done because it becomes uncomfortable\nbut ive never known - when you’re going down on a girl and she starts to orgasm\nshould you stop right then or keep going until it’s complete? Cuz it takes a\ncouple seconds from start to finish.",
  "data/reddit-ask/r/askscience/comments/rx1zvb/when_sliding_a_pipe_into_another_pipe_thats_a.json": "Like the title says, when sliding a tightly fit pipe into another one, why do we\noften rotate them to push in further? Why is it often easier to do so rather\nthan to just push straight in?\n\nI was speculating that this might have something to do with static/kinetic\nfriction, and that by rotating the…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rx65z2/how_do_people_go_to_work_the_same_95_job_every.json": "Okay yea this already is clearly a pessimistic question, but i’ve been very\ndepressed lately and anxious about my future being bleak and eventful. I’m 19,\nmy childhood was extremely dramatic and stressful, I grew up with abusive\nparents in a poor neighborhood, so needless to say I was never bored,…",
  "data/reddit-ask/r/NoStupidQuestions/comments/rx5iv3/why_tf_is_my_bed_shaking.json": "For the past couple of weeks or so I've started feeling my bed shake as I'm\nlying in it, I can't think of anything to explain it. I live alone so it's not\nsomeone else, I live in England so it's not earthquakes and I'm pretty cynical\nso I'm going to rule out spirits too, it 100% feels like someone…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rx6twg/is_it_ok_to_sexually_experiment_compare_sizes.json": "Please no rude comments I’m trying to figure myself out!",
  "data/reddit-ask/r/AskHistorians/comments/rx5p3p/saladin_and_richard_the_lionheart_had_an.json": "They exchanged letters, debated theology, sent gifts. Saladin sent his personal\nphysician when Richard was unwell. Meanwhile Richard tried several times to meet\nup and hang out with Saladin.\n\nHow common would this type of enemy commander relationship be at the time? Was\nit common knowledge; if so,…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rxdcm6/why_do_i_have_to_brush_my_teeth_daily_but_yet.json": "I know damn well they weren’t brushing their teeth 50kya",
  "data/reddit-ask/r/NoStupidQuestions/comments/rxddum/at_what_point_in_history_did_homosexuality_become.json": "The Greeks seemed to accept homosexuality, as did the Romans if I'm correct?\nThis whole question came about when I thought what did cavemen think of gay men\nand lesbian women after seeing evidence of a gay cavemen, so at what point did\ngays become shunned by society?",
  "data/reddit-ask/r/NoStupidQuestions/comments/rxepc7/pornhub_seems_to_remember_me_even_though_i_watch.json": "I'd prefer to keep my porn habits private. I wouldn't want anyone to visit\nPornhub on my computer, and deduce what I watch based on the recommendations.\n\nI want to stop Pornhub from doing anything to personalize their site for me. I\nwant zero recommendations based on prior watch history. How do I…",
  "data/reddit-ask/r/AskHistorians/comments/rxhth4/my_grandmother_once_said_that_as_a_young_woman_in.json": "This was certainly true of my grandmother and grandfather. They were middle\n(later upper-middle) class Jews in New York, born around the end of World War\nOne. My grandfather spoke fluent German and Russian, while my grandmother only\never learned French. Neither of them ever spoke any Yiddish (which…",
  "data/reddit-ask/r/AskHistorians/comments/rxf8oq/recipes_in_the_ancient_roman_cookbook_de_re.json": "This site has a full translation of the cookbook,\n[https://penelope.uchicago.edu/Thayer/e/roman/texts/apicius/home.html] written\nby one \"Apicius.\" I'm not necessarily looking for a breakdown of each individual\ningredient, but I'm interested to know just how developed Roman culinary trade\nwas around…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rxfbjo/what_do_guys_get_out_of_sending_random_dick_pics.json": "Or what’s the endgame? What do they expect will happen",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rxi3uw/do_people_with_darker_skin_tones_use_sleep_masks.json": "Do their darker toned eyelids block more light when closed compared to\ncaucasians? Or is all eyelid skin too thin too block out light?",
  "data/reddit-ask/r/NoStupidQuestions/comments/rxdshn/what_if_you_smuggled_cocaine_through_a_border.json": "Either inside the cast or the cast itself is made out of it.\n\n(I got the idea from the show “Archer”)",
  "data/reddit-ask/r/NoStupidQuestions/comments/rxfsvh/how_do_i_explain_to_my_little_siblings_that_their.json": "My mother has been battling cancer for a long time now and the day before her\npassing we all laid next to her. Mostly everyone knows now and now it’s just the\nkids who know nothing. I don’t know how I should explain her passing to them in\na calm reasonable manner.",
  "data/reddit-ask/r/NoStupidQuestions/comments/rxfr43/why_would_you_ever_pay_a_breeder_for_a_dog.json": "I don’t mean to be mean and I have plenty of friends who have done it. I just\nseriously don’t get it. I’ve wanted to ask but I don’t mean to offend.\n\nWith so many dogs in shelters, why would you ever pay out the ass for a purebred\nfrom a breeder? For a dog with higher chances of medical problems?…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rxhsad/i_just_dont_understand_the_influencer_culture.json": "I guess this is a question…. As I’ve been traveling I’ve seen a lot of\ninfluencer stuff. More times than not they are rapid shooting pictures and then\nmoving on. I was on top of a mountain in Lake Como watching the absolute most\ngorgeous sunset I’ve seen in my life. I look over and this girl and…",
  "data/reddit-ask/r/AskWomen/comments/rxl9mw/women_with_addadhd_primarily_inattentive_what_are.json": "Especially because people often think of the hyperactive/combined type. The\nprimarily inattentive type is more common in girls and women which means less\nrecognition and knowledge about it.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rxn3at/are_fat_pussies_attractive.json": "All pussies are different but I often get self conscious with the lights on with\na new partner. I definitely have a fat pussy for lack of a better term. Is this\nokay? Do guys really care?",
  "data/reddit-ask/r/NoStupidQuestions/comments/rxpg9x/how_tf_do_i_use_reddit.json": "Hi. I’m new to Reddit and all I want to do is ask questions but HOW THE FUCK can\nI do that with no karma?! I can’t post anything anywhere. I probably can’t even\npost on here without karma. This is probably a waste of my time.\n\nI feel like I’m trying to get an entry level job but I have no prior…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rxly4t/why_do_i_feel_hurt_when_my_best_friend_says.json": "When she says this the other girls laugh and I go quiet and feel awful. She then\nsometimes goes \"not you though\" to me but still I feel hurt. I don't know if\nthis is just me who feels this way? I have been sexually harassed by 2 of my X's\nin the past so maybe that has something to do with it. As…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rxp3nz/is_it_bad_that_i_only_poop_once_a_week.json": "I've been like this for years and I'm too afraid to bring it up to my doctor. I\nwill literally only poop like once a week, sometimes I'll even go once every\nweek and a half. When I finally do take a shit it's not painful or hard and it's\nnot a lot of poop???\n\nEDIT: OKAY APPARENTLY THIS IS BAD, lol.…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rxprap/is_it_sexist_that_my_boss_has_openly_said_she.json": "I work in what was once a male dominant profession. It is now more women than\nmen especially at the management level. My boss has clearly stated that she will\nonly hire women for diversity/equality reasons. I didn’t have an issue with that\nbut in the last 3 years I have watched her pass over more…",
  "data/reddit-ask/r/NoStupidQuestions/comments/rxtl22/whatsapp_just_downloaded_12k_photos_of_other.json": "So, I just bought a new phone. When I installed whatsapp, it automatically\nstarted restoring a media backup from my Google drive.\n\nLooking to clean things up, I just found 12000 pictures on my phone of which\nover half are RANDOM PEOPLE's personal photos. I'm talking photos of IDs,\nselfies,…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rxgscs/what_is_the_end_game_for_covid.json": "No one ever seems to talk about how and when the pandemic will end. I don't\nthink Covid will ever be eliminated. We are way past that point. It is too\nwidespread. Are we just waiting and hoping it will mutate into a less dangerous\nstrain and then it will become just a flu and then we stop caring…",
  "data/reddit-ask/r/askscience/comments/rxgil4/do_my_thoughts_feel_like_they_come_from_my_head.json": "Or have inner monologues always felt like they're in our head? And of that's the\ncase, isn't it obvious that your brain is the originator of thought? Why did it\ntake Alcmaeon of Croton to come along and tell us all the brain is where thought\ncomes from?\n\nI asked this question yesterday on another…",
  "data/reddit-ask/r/NoStupidQuestions/comments/rx3xo1/why_is_mc_donalds_coke_so_much_better.json": "At least in europe mc donalds coke just tastes way more refreshing than bottled\ncoke.",
  "data/reddit-ask/r/AskHistorians/comments/rxc32d/how_did_people_around_the_world_sleep_in_the_past.json": "Over here (South Asia) it's really warm, even during the night and there are\nmosquitoes so keeping the windows open isn't really an option. Like that I'm\npretty sure everywhere around the world there are many little issues which made\nsleeping really hard. I can't imagine how they delt with these,…",
  "data/reddit-ask/r/NoStupidQuestions/comments/ry0cnr/downloaded_whatsapp_on_a_new_phone_and_after.json": "I just got my new android in the mail and began setting it up. One of the apps I\ninstalled was WhatsApp. During the initial setup process, there was a screen\nthat asked if I wanted to upload recent back-ups from my account.\n\nI hit yes as I wanted to save everything from my last phone. After a…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ry2dvm/i_really_am_too_aftaid_to_ask_but_is_4_liters_of.json": "So hi everyone, I have been addicted to coke as long as i can remember in my 30\nyears of life and for the last 3-4 years, i have been drinking 3-4 liters a day\nof diet coke. Should i be worried about my health?",
  "data/reddit-ask/r/askscience/comments/rxzhnp/what_happens_to_the_lungs_after_death.json": "Do bodies really exhale like on TV? Can you die with a full breath inside your\nlungs? If you can die with air inside, how long does the remaining air last?\nDoes your diaphragm need to move to empty the lungs?",
  "data/reddit-ask/r/TrueAskReddit/comments/rxqlfl/why_are_we_so_bored_despite_having_so_many_things.json": "This holiday week was really slow for me, I didn't really do much. I stared out\nthe window, paced around and spent a lot of time in bed oversleeping.\n\nHowever, I have hundreds of Steam games, the Internet is full of movies and\ndocumentaries to watch, I have some of my projects to work on, and even…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ry2pyn/should_a_18_year_old_have_a_bedtime.json": "So im currently living with my parents, I am forced to go to sleep at 9pm, I\ncan't even just stay awake they tell me to sleep or else they threaten to break\nmy stuff (tv, console etc) which I have bought with my money. Is this normal?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ry6llp/is_heroin_something_you_get_addicted_to_on_the.json": "Disclaimer: I AM NOT TRYING HEROIN OR ANYTHING LIKE THAT but I read about\nanother Reddit user who DID try heroin once because he was bored or done stupid\nshit like that and it completely ruined his life for I think 7 years until he\ngot clean.\n\nAll because of a stupid whim.",
  "data/reddit-ask/r/NoStupidQuestions/comments/ry2p1i/how_in_the_fuck_do_you_report_a_porn_website.json": "I was recently using nameflix to come up with names for a dropshipping\nwebsite/product I was going to launch. The product was a shaving stick (with\nextra features). Just to note, I am NOT saying my store name or promoting\nmyself.\n\nAnyway, found a name that I thought would be swell - vortex... (not…",
  "data/reddit-ask/r/AskHistorians/comments/ry78an/why_was_the_use_of_lead_and_asbestos_so.json": "The metanarrative/received wisdom - at least in the UK - surrounding\nlead/asbestos and their general phase-out in contemporary society generally goes\nsomething like this: 'Lead/asbestos was really useful because it corrodes\nslowly/is really good at stopping fire and is found everywhere, but like…",
  "data/reddit-ask/r/askscience/comments/ry8gf7/is_there_realworld_data_showing_boosters_make_a.json": "There were a lot of models early on that suggested that boosters stopped\ninfection, or at least were effective at reducing the severity.\n\nAre there any states or countries that show real-world hospitalization metrics\nby vaccination status, throughout the current Omicron wave?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ry7dbb/is_asking_your_partner_to_watch_their_table.json": "I love this man with all my heart… but he eats food like no one else I know.\nOpen mouth crunching, lip smacking, huge mouthfuls of food, loud finger sucking,\nhe gets sauces & bits all over his mouth… it drives me crazy and grosses me out.\nHe does it in restaurants as well. I realize we were brought…",
  "data/reddit-ask/r/askphilosophy/comments/rxtgx2/why_study_hegel_and_what_makes_him_so_important.json": "Hegel is often brought up in philosophy circles as the final-boss of\nphilosophical readings. But I don’t understand why. I can’t explain any of\nHegel’s ideas in concrete terms (admittedly I don’t know much about it) and it\ndoesn’t seem to have a call to action (like Stoicism) or revelations…",
  "data/reddit-ask/r/AskHistorians/comments/ry7wy8/16001660_what_is_green_bacon_and_is_it_the_same.json": "Currently diving deeper into recipes from the days of old specifically “The\nCloset of Sir Kenelm Digby Knight”. I’ve run into references of “green bacon”\nfor a dish I’m quite tickled to re-create. After looking up this green bacon\nI’ve found a couple recipes on it but I’d like to make sure this is…",
  "data/reddit-ask/r/AskWomen/comments/rxz85d/what_is_the_most_toxic_thing_someone_has_said_to.json": "Or the most toxic thing you’ve heard ?",
  "data/reddit-ask/r/AskWomen/comments/ry2j6q/for_the_women_that_were_straight_and_now_are.json": "Edit: WOMEN WHO USED TO EXLUSIVELY DATE MAN, WHAT DIFFERENCES DID YOU OBSERVE\nAND EXPERIENCE WHEN STARTING TO DATE WOMEN?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ry5qfg/trump.json": "What makes his die hard supporters love him as much as they do?\n\nDo you disagree with anything he’s ever said or done?\n\nEDIT: I see I got some downvotes. This isn’t meant to upset some of you who are\nunsure how to answer this question. I’m just trying to learn.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ryd4im/sex_made_him_want_to_punch_things.json": "I (24f) was getting intimate with (23m). While we were doing it he abruptly\nstopped and darted away from me and sat there heavily breathing. When I asked\nhim what was wrong he said he had to stop because it was making him want to\npunch things. What the hell is that about?",
  "data/reddit-ask/r/AskHistorians/comments/rxzuz7/when_did_corporations_begin_using_kinship_terms.json": "Was this patterned after similar uses in religious/political contexts? And what\nabout those uses? (fatherland, motherland, brotherhood, etc.)",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ryflb5/i_made_mouth_contact_with_a_cockroach_what_will.json": "No, I didn't kiss the roach. It was on a wall and I tried to kill it, but I\nmissed and it fell, landing on the spot between my lower lip and my tongue. It\nmight have touched some teeth too. I have not washed my teeth, and generally my\nmouth yet, because I forgot. What will happen?",
  "data/reddit-ask/r/AskHistorians/comments/rydc8e/wlgeorge_in_1922_a_sight_of_the_world_today_would.json": "I apologize if this question is a too broad and speculative, but I found the\nthought interesting and hopefully someone else will too.\n\nIn this column from 1922, \"What the World Will be Like In a Hundred Years\"\n[https://www.loc.gov/resource/sn83045774/1922-05-07/ed-1?sp=87], English…",
  "data/reddit-ask/r/AskHistorians/comments/ryenir/how_valuable_would_an_ok_modern_kitchen_knife_be.json": "The technological advancements over centuries are often hard to grasp. Sometimes\nI like to wonder if a basic tool, such as a kitchen knife would be a good\nbenchmark for it.\n\nIf we consider an OK everyday knife, e.g. Ikea\nhttps://www.ikea.com/us/en/p/ikea-365-3-piece-knife-set-90341170/ worth…",
  "data/reddit-ask/r/NoStupidQuestions/comments/ryeac1/what_do_you_call_a_house_that_isnt_new.json": "Was having a conversation with my co worker about houses and I’m pretty sure I\nmade an idiot out of myself. I called it a “used house” and she starting\nlaughing. I was thinking like a “used car,” but now I feel like maybe I offended\nher and I’m embarrassed. Is there a word for a non-new house?",
  "data/reddit-ask/r/AskWomen/comments/ryg1hs/women_with_high_selfesteem_how_do_you_do_that.json": "It’s become pretty clear to me recently that I need to work on my self-esteem\nbut don’t know how to.",
  "data/reddit-ask/r/NoStupidQuestions/comments/ryki63/i_just_accidentally_ate_some_raw_egg_will_i_be_at.json": "maybe I'm worrying too much but I realized that the egg wasn't fully cooked when\nI bit into it (sunny side up)",
  "data/reddit-ask/r/askscience/comments/rycoep/how_would_a_nuclear_explosion_in_space_differ.json": "I'm just wondering if vacuum of space and lack of gravity would change the\nexplosion? I'm guessing because of the conservation of energy, more of the\nenergy would be released as light or other electromagnetic waves, than a similar\nexplosion on earth, where the energy is also distributed as sound…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ryb9ox/how_much_do_women_share_with_their_friends_about.json": "Like do they really tell everything even if it’s not good?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ryoma1/does_anyone_ever_really_know_what_the_fuck_is.json": "When I (19M) was a lot younger I thought y'all adults had shit figured out, but\nnow it seems like everyone is winging it. Does anyone know how the world is even\nstill functioning?",
  "data/reddit-ask/r/askscience/comments/rym2cn/why_does_fallen_fruit_begin_to_grow_mold_while.json": "My guess is that the tree as some form of defense against fungi but I am at a\nloss to what mechanisms make up that defense.",
  "data/reddit-ask/r/askphilosophy/comments/ryefrk/what_did_søren_kierkegaard_mean_when_he_said_this.json": "\"People commonly travel around the world to see rivers and mountains, new stars,\nbirds of rare plumage, queerly deformed fishes, ridiculous breeds of men – they\nabandon themselves to the bestial stupor which gapes at existence, and they\nthink they have seen something.\"",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rys0hg/is_rape_a_lot_more_common_than_i_thought.json": "I just wanna start out by saying I don’t want this to come across like I don’t\nvalidate the person who was raped. I just feel like I often see posts about\npeople who were raped on Reddit and Twitter and I guess I just thought it wasn’t\nthat common but I feel like I see this all the time on social…",
  "data/reddit-ask/r/AskHistorians/comments/rypomg/how_did_ancient_civilizations_clean_up_after.json": "TIL that something like 70,000 people died in the Battle of Carthage. In a world\nwithout much in the way of technology or machinery, what do you DO with that\nmany corpses? Did they attempt to retrieve (presumably valuable) armor and\nweapons? Did they bury them in mass graves somewhere?",
  "data/reddit-ask/r/askscience/comments/rywkb7/how_can_gravity_escape_a_black_hole.json": "If gravity isn't instant, how can it escape an event horizon if the space-time\nis bent in a way that there's no path from the inside the event horizon to the\noutside?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ryw4u0/why_arent_there_women_sending_random_vagina_pics.json": "I figured if there are man willing to do this, why the fuck on earth haven't I\never heard about a woman randomly sending a vagina pic to someone?? I mean bro,\nif women would do this instead of man, it would most likely have a success rate\nof 99%, yet I haven't ever heard about a single woman that…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ryxdyh/so_i_lost_a_usb_stick_with_some_videos_i_would.json": "USB stick has some stuff on it of me and my partner and i left it at an airbnb 9\nhours away.\n\nDoesn’t have any names but does have faces.\n\nCan this get back to me and ruin my life at some point?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rz28s6/does_anyone_actually_like_the_taste_of_cum.json": "Is there anyone out there that actually enjoys swallowing semen? Or is everyone\nwho says it tastes good just trying to boost their partners ego?",
  "data/reddit-ask/r/NoStupidQuestions/comments/rz1hsj/why_are_new_mothers_charged_40_in_hospital_for.json": "If the parents don't pay are they not allowed to hold their child?",
  "data/reddit-ask/r/askscience/comments/ryecal/is_it_be_possible_for_a_moon_to_be_gaseous.json": "I am legitimately curious.\n\nAlso let's assume the object the moon is orbiting and the moon has significant\nenough mass to remain gaseous",
  "data/reddit-ask/r/AskHistorians/comments/rz4rcy/roosevelt_used_the_wpa_and_us_forest_service_to.json": "First off, do we have reason to think the tree planting worked? Or did the\ndrought just end?\n\nHow many trees were planted? Did they survive? Were they planted on Public land?\nDegraded farms?\n\nWhere would we find these trees today?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rz4zgb/my_wife_has_asked_me_to_talk_dirty_to_her_during.json": "Happily married for 10+ years to a wonderful woman. We have a very healthy and\nactive sex life. She has asked me to talk dirty to her during sex and I'm not\nsure what to say. She's about 40 years old and is an esthetician (specializing\nin Brazilian waxing). She's a hard-core Cat lover and Harry…",
  "data/reddit-ask/r/NoStupidQuestions/comments/rz61wz/can_men_be_overly_friendlyhelpful_to_women.json": "For example: I tried playing DnD for the first time, and someone in the party\nspent 3 hours after the session helping me build a character and explaining the\ngame in depth. He explained things step by step in a way that I could\nunderstand, which usually takes a lot of patience.\n\nI’ve always heard…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rz2k79/is_it_rude_to_hit_no_tip_on_the_card_reader.json": "Tip culture is getting out of hand. I used to tip 10% as a button on the\nmachine. A few months ago, I noticed the lowest option was 15%. Still, I tipped,\nbecause I was brought up to believe that it was rude not to tip. However, last\nnight I was getting my $7 pretzel and $4 Dasani bottle of water at…",
  "data/reddit-ask/r/askscience/comments/rz3ebm/can_prions_from_contaminated_meat_remain_on.json": "I read that iatrogenic cjd can be transmitted through contaminated surgical\ninstruments after contact with contaminated tissue, so can variant cjd be\ntransmitted in this way, but through the kitchen utensils that were used to cook\nthis meat? For example, if contaminated meat is cooked in a frying…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ryzmqy/why_does_anything_exist_at_all.json": "I've just had a bit of an existential panic attack. I thought, why does anything\nexist at all? Why does this reality exist? Why is there even a space for the\nuniverse? Why isn't there just nothing? But why is there even a concept of\nnothingness? What the fuck even am I? Is this even real? But if it…",
  "data/reddit-ask/r/AskHistorians/comments/rz6o5u/why_did_president_bush_call_senator_biden_during.json": "I just finished a tour of the George W. Bush Presidential Center. One exhibit is\nabout the September 11th attack, and you can read the minutes of President Bush\nduring that day.\n\nWhile going through the minutes, they have reported that President Bush called\nand talked to Senator Biden, but it…",
  "data/reddit-ask/r/askscience/comments/rz4ogd/the_green_sahara_period_ended_5000_years_ago_when.json": "Would rainfall in the Sahara/Sahel increase if the Sahara borderlands were\nreforested?",
  "data/reddit-ask/r/NoStupidQuestions/comments/rzewl2/my_69_yr_old_neighbors_alarm_clock_has_been_going.json": "-She has a hard time balancing without her walker.\n\n-Last night I had to help bring her laundry to her apartment because she\ncouldn't do it herself.\n\n-I knocked on her door multiple times and called out her name. I couldn't hear\nanything except the alarm clock.\n\n-I called 911 to ask for a welfare…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rz6ppn/my_step_makes_up_lies_of_physical_abuse_when.json": "My 6 year old stepson has behavioral issues, the most concerning is the\nincessant lying. His lies have gotten increasingly serious. It seems to be a\nresult of when myself or others put him in time out or take away his tablet when\nhe is naughty. His dad and grandma raised him and they did not…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rz34yi/first_time_gay_sex_what_should_we_know_beforehand.json": "I (19m) and my boyfriend (20m) are both virgins, have never been with anyone\nelse besides each other, and are practically unexperienced when it comes to gay\nsexual activities. We haven't done anything besides kissing, but we'd like to\ntry certain things in the (near) future. But before we begin,…",
  "data/reddit-ask/r/AskHistorians/comments/rzg2yh/in_catch22_major_majors_father_makes_a_living_by.json": "Or, in other words, was there any genuine US government policy of the 1930s that\nwould result in anybody receiving monetary compensation for refraining from\ngrowing a crop? And was it really lucrative enough that somebody would do what\nthe character is described doing, and buying up as many acres…",
  "data/reddit-ask/r/askscience/comments/rzhatv/why_is_covid_testing_so_much_easier_than_a_year.json": "Originally to get tested you had to stick the swab like 2 inches into your nose.\nNow you can just swab around the opening.\n\nHas tests gotten better, or were we just not great at understanding how Covid\nworks so sticking it really far up you nose was a cautious measure to ensure\naccuracy.",
  "data/reddit-ask/r/AskHistorians/comments/ryz8pu/did_hidden_villages_actually_exist_in_japan.json": "Have there ever been any villages that were hidden from outsiders and kept\nsecret?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rzm2wi/why_wont_unvaccinated_people_just_shut_the_fuck_up.json": "Look, it’s their decision at the end of the day & they’ve made it. They don’t\ntrust the gov. They don’t trust the pharmaceutical industry. They don’t trust\nhealth authorities. They think it’s tyranny. That it’s literally 1984. That it’s\nexperimental gene therapy & everyone who’s been vaccinated is…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rznhow/what_is_wrong_with_nonblack_people_wearing_box.json": "Posting this on my secret account bc i feel like this question will get a lot of\nhate.\n\nAnyway, I believe that culture is meant to be shared. Box braids being apart of\nmy african culture, i love sharing it with other people. I dont see anything\nwrong with non-black people wearing braids from my…",
  "data/reddit-ask/r/AskHistorians/comments/rzhiwl/how_did_healthcare_systems_in_ancient.json": "I posed the Aztecs as an example, but I'm curious in general how other societies\nhave structured healthcare, especially prior to a lot of the concepts that\nmodern western healthcare is based on.",
  "data/reddit-ask/r/NoStupidQuestions/comments/rzkg7e/do_you_ever_look_at_housesapartments_online_and.json": "Just searching for houses as if I’m not some broke 23 year old dude still living\nwith his parents.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rzrhci/can_anybody_give_me_some_tips_here_this_is.json": "Everytime I meet my girl in public and we touch, I get a boner. It's fucking\ndifficult to do any activity with her besides sitting. And the worst part is she\nenjoys holding hands and taking long walks together. It's been six months\nalready. Her being really pretty just adds to my suffering. She…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rzfzxn/is_it_weird_to_ask_your_bartender_for_her_number.json": "Basically the title. She's flirted with me a couple of times, but that's just\nbartender etiquette. I think she's cute, and I think she thinks I'm cute. If she\nsays no, I'm still gonna keep coming in here, is that weird?",
  "data/reddit-ask/r/AskHistorians/comments/rzs5hn/i_just_read_a_medieval_text_in_which_a_man_claims.json": "So for a internship I am working through a Latin text from the 11th century Low\nCountries: De Diversitate Temporum ('On several things of this time') by\nAlpertus of Metz.\n\nIn it, Alpertus tells of a man in an inn who supposedly said the\nfollowing:\"...that the human soul amounts to nothing and that…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rzoy7n/im_27_m_i_cant_even_do_a_single_pushup_and_im.json": "Edit: Sorry the question was not too clear. I want to do both, get over the\nshame and accept the reality, and also get myself to do pushups. The thing now\nis, I avoid going to the gym because I don't want to show people that I can't do\na pushup. That's the biggest challenge I'm dealing with rn",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rzrwwo/how_come_people_always_draw_graffiti_of_dicks_and.json": "I never seen a vag graffiti before. I always see dick drawings in washrooms at\nschool, alley lanes, etc...",
  "data/reddit-ask/r/NoStupidQuestions/comments/rztu10/why_are_womens_tshirt_sleeves_so_much_shorter.json": "Like.. Wouldn't it make more sense to have women's sleeves be longer, if\nanything? Since they usually get cold easier and also don't usually care about\nshowing off their biceps or anything lol And I know that there are different\nlength sleeves.. but why are the standard and most common ones for t…",
  "data/reddit-ask/r/NoStupidQuestions/comments/rzx991/in_american_houses_why_is_the_toilet_in_the_same.json": "Wouldn't it be better to have the toilet in a seperate room, so that one person\ncan shower and the other can use the toilet at the same time?",
  "data/reddit-ask/r/askscience/comments/rzn5xf/why_are_prions_so_hard_to_destroy.json": "Most proteins denature below boiling temperature. Prions, as far as I know, are\njust a type of protein.\n\nIs there a specific reason why prions are so hard to destroy? And is it in any\nway linked to the diseases they cause? Or is it just pure coincidence?",
  "data/reddit-ask/r/NoStupidQuestions/comments/rzyuz0/serious_if_in_the_us_you_can_legally_require.json": "Title, asking from a legal standpoint.",
  "data/reddit-ask/r/askscience/comments/rzkovi/evidence_for_biological_age_acceleration_and.json": "Source of the title: https://www.mdpi.com/1422-0067/22/11/6151/htm",
  "data/reddit-ask/r/AskHistorians/comments/rzx8jf/why_did_the_jewish_people_name_their_new_country.json": "As far as I'm aware, the region of modern Israel was divided into two countries,\nJudea and Israel, before it was conquered by the Persians. Since Judea was the\nkingdom containing Jerusalem and also the one ruled by King David, I would think\nthat it would have higher significance to the Hebrews, so…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/rzvzqo/do_guys_care_if_a_girl_has_been_sa.json": "Some guys seem to be bothered by the fact I've been sexually assaulted. They've\ntold me I'm dirty. Do ppl actually care?",
  "data/reddit-ask/r/askscience/comments/s087cf/what_kind_of_bonds_do_virus_protein_spikes_form.json": "Covalent? Polar covalent? Ionic?",
  "data/reddit-ask/r/NoStupidQuestions/comments/s06h8o/why_do_people_comment_this_in_a_thread_if_it_adds.json": "It’s been my biggest pet peeve since I got on here",
  "data/reddit-ask/r/NoStupidQuestions/comments/s0ammn/why_are_people_so_obsessed_with_their_rights_but.json": "For example I have friends who will not wear masks and they do not agree with\nthem but if you wear a mask they will bash you about it. is that not your right?\nOr if a store requires a mask they will be jerks and put in on their shoulder or\non the top of their head because the rights of the store do…",
  "data/reddit-ask/r/AskWomen/comments/s043a5/what_is_your_holy_grail_skincare_item.json": "Mine is: Laneige lip mask.",
  "data/reddit-ask/r/AskWomen/comments/rzyg6t/ladies_what_is_your_secret_to_being_happy_with.json": "edit: I should probably clarify that the looks is not what Im asking about, I\nmean the whole ordeal like menstruation and so on. I just feel that guys got all\nthe advantages.",
  "data/reddit-ask/r/AskHistorians/comments/s02d52/if_slavery_in_japan_was_banned_by_toyotomi.json": "Watching the new season of Kimetsu no Yaiba, set during the 1910s-1920s I\nbelieve, and the character Tengen Uzui is explaining how poor families sell\ntheir girls to brothels. Given that brothels operate legally/openly in this\nperiod, my assumption is that the sale of daughters to brothels must be…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/s0epol/does_anyone_actually_like_broccoli.json": "I feel like adults are just expected to put up with vegetables, but broccoli\nstinks and it's an all round shit vegetable.",
  "data/reddit-ask/r/AskHistorians/comments/s0bymd/i_read_that_the_uss_texas_was_able_shell_farther.json": "(title)",
  "data/reddit-ask/r/NoStupidQuestions/comments/s0de4u/do_people_carry_their_social_security_cards_with.json": "I'm asking because I recently misplaced my wallet for like a week and my brother\nin law was telling me I needed to get a new social security card. My response\nwas I don't carry my social security card in wallet. I asked him does he carry\nhis he said yes. I then asked more of my family do they carry…",
  "data/reddit-ask/r/AskWomen/comments/rzrw32/for_those_who_found_a_career_that_they_lovelike.json": "Saw a post about what careers people are glad they didn’t pursue so I wanted to\nhear about what careers people are happy they chose.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/s0d0qu/just_found_out_my_best_friends_bf_does_not_wipe.json": "My best friend is incredibly nice, too nice for her own good. She has stayed\nwith her bf (let’s call him Ned) who has cheated on her twice, because she can’t\nbreak up. He also smells HORRRID. Like really really awful. While hanging out\nwith one of his friends he told that Ned does not wipe after…",
  "data/reddit-ask/r/NoStupidQuestions/comments/s0gdbk/i_keep_hearing_about_people_in_america_completely.json": "Are they just going into debt super quickly or moving back to their parents\nhouse or something? How does this work?",
  "data/reddit-ask/r/NoStupidQuestions/comments/s0gxp8/is_it_normal_to_want_to_sleep_just_because_you.json": "I was playing video games with my friends and mentioned I was getting off so I\ncan go to sleep (it was around 8pm) and they asked whether I was tired from\nsomething I did earlier that day and when I explained I just didn’t want to be\nawake they told me it was weird and something they never heard…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/s0jqsq/why_are_americans_so_shocked_when_you_tell_them.json": "Edit: i somehow always forget to say that but when I say Americans I don't mean\never single US citizen... I mean in general Americans do it much more than\nothers\n\nI was sitting together with a few people, some of them Americans on their Europe\nholiday, and somehow the topic came up and I simply…",
  "data/reddit-ask/r/askscience/comments/s0aa32/are_goodbad_smells_a_learned_behavior.json": "If humans tried alien cuisine, would the good/bad smelling foods necessarily\ncorrelate with healthy/poisonous foods?",
  "data/reddit-ask/r/AskHistorians/comments/s0i2q3/as_an_historian_what_did_the_tv_series_vikings.json": "And any other thoughts, or opinions about this show. Also, what's the best\nreference for learning about vikings?",
  "data/reddit-ask/r/NoStupidQuestions/comments/s0fp2i/sent_a_dick_pic_to_a_catfish_should_i_be_worried.json": "Last night I was horny just like every other 18 year old out there. I get a\nmessage complementing one of my posts and then they immediately say they have a\ncuckold fetish. I agree to play along and do the dirty stuff for a bit. They ask\nme to send a dick pic in which I do like the idiot that I am…",
  "data/reddit-ask/r/AskHistorians/comments/s0luz3/in_the_tv_show_seinfeld_which_takes_place_in_the.json": "Edit: Seinfeld wasn't a small time comedian, sorry about that. I think asking\nabout Kramer or George would have been better",
  "data/reddit-ask/r/TooAfraidToAsk/comments/s0kfvs/calling_it_non_consensual_sex_is_it_sugarcoating.json": "Referring to rape as non consensual sex- is it sugarcoating the action taken, or\nhas it another meaning altogether?",
  "data/reddit-ask/r/askscience/comments/s0iqkg/have_scientists_decided_what_the_first.json": "Once the telescope is fully deployed, calibrated and in position at L2 do\nscientist have something they've prioritized to observe?\n\nI would imagine there is quite a queue of observations scientists want to make.\nHow do they decide which one is the first and does it have a reason for being\nfirst?",
  "data/reddit-ask/r/AskHistorians/comments/s0kvq4/why_do_western_historians_use_dynasty_to_refer_to.json": "I know that there ARE European dynasties that are referred to as such, but more\noften than not they are referred to as 'houses'. To make things more\ninconsistent, Mongol political factions are often also called 'houses', i.e.\n'House of Ogedai', so I'm confused as to what historians had in mind when…",
  "data/reddit-ask/r/AskWomen/comments/s0k0tu/what_do_u_feel_when_female_animated_characters.json": "Edit- Also about unrealistic movement of breast for no reason added in anime",
  "data/reddit-ask/r/TooAfraidToAsk/comments/s0o305/wife_just_admitted_that_im_right_what_do_i_do_now.json": "Got in an argument with my wife, details not important, for the first time she\nhas conceded that I am right. Never got this far before. What do I do now?",
  "data/reddit-ask/r/NoStupidQuestions/comments/s084na/am_i_the_only_nonamerican_sick_of_american.json": "We get it, they have shootings and the country is not doing enough to deal with\nit but making the joke about it is so over used that it feels like a cheap shot\nat America\n\nEdit: Yeah I know. “cheap shot” might not have been the best phrasing. Maybe a\nway to get easy laughs at Americas expense?",
  "data/reddit-ask/r/askscience/comments/s0llh2/what_if_any_differences_exist_between_delta9_thc.json": "The past couple years, delta-8 THC was being screwed as a legally produced\nalternative to conventional delta-9 THC products. Recently, I've seen new\nproducts marketed as containing delta-9 THC, somehow legalized under the same\nprovision.\n\nWhat's the difference between this hemp-derived d9-THC and…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/s0a2kn/to_all_cat_people_your_cat_scratches_you_to_the.json": "I always hear cat ppl joke like “oh he scratched my finger haha!! That’s just\nthe way he is! It’s a love hate relationship” but what if the cat just out of\nthe blue just hates you?",
  "data/reddit-ask/r/AskWomen/comments/s0hpyt/what_was_the_most_absurd_thing_you_did_in_the.json": "In only 21 and this state of mind in which we are raised its hard af to get rid\noff.",
  "data/reddit-ask/r/NoStupidQuestions/comments/s0rmev/should_i_rethink_our_4_year_relationship_if_my.json": "So I (23F) and boyfriend (35M) have been dating for four years. We started\ndating right after I joined campus, and throughout I've never asked him for\nanything. While at school, my parents were not able to give me a pocket money,\nbut I had a part-time job as a waitress and most of my fees was paid…"
}