{
  "data/reddit-know/r/YouShouldKnow/comments/l5qgss/ysk_that_being_lonely_isnt_the_same_thing_as.json": "Why YSK: Fear of being alone sets you up to stay is relationships that are not\ngood for you. You could make yourself miserable because you think being alone\nwould be wors.\n\nLove yourself and be your own friend. Then everyone else in your life is an\nawesome bonus. You don't have to be lonely if you…",
  "data/reddit-know/r/YouShouldKnow/comments/l5sx1r/ysk_if_you_have_to_stop_and_think_when_the_last.json": "Why YSK: that’s basically it. The CDC recommends 2-3 cups of vegetables per day\nfor an adult.",
  "data/reddit-know/r/YouShouldKnow/comments/l5teob/ysk_that_your_medical_records_can_be_accessed_by.json": "Obligatory disclaimer - I am in the US and this is based on my experience, but\nI'm sure its similar in other countries. The US has very strict HIPAA laws that\nprotect any info we share with a Dr and our medical records.\n\n--\n\nI was glad when medical records went online. Easy to access all my Dr's…",
  "data/reddit-know/r/YouShouldKnow/comments/l6l9b1/ysk_jehovahs_witnesses_are_collecting_your_data.json": "YSK: Jehovah’s witnesses are collecting your data and you can stop them\n\nWhy YSK: It’s an invasion of privacy and you can make it harder for them to send\nyou unwanted mail and call you\n\nI’m a former witness and after I left certain people have tried finding out my\naddress and other personal…",
  "data/reddit-know/r/YouShouldKnow/comments/l6phxp/ysk_to_contact_google_and_speak_to_a_real_human.json": "Google HQ/the googleplex has a phone number staffed by real people @\n1-650-253-0000\n\nWhy YSK: In-case you need help with google products/services.",
  "data/reddit-know/r/YouShouldKnow/comments/l78xr2/ysk_many_terms_of_services_have_a_forced.json": "Why YSK: This is an easy and important step to protect your legal rights.\n\nMany Robinhood users are seeking legal action against Robinhood (e.g. as a class\naction suit) for suspending trading on GME, AMC, etc. However, every Robinhood\nuser agreed to Arbitration, as per the customer…",
  "data/reddit-know/r/YouShouldKnow/comments/l7d1eo/ysk_that_you_can_easily_transfer_your_music_from.json": "Why YSK: Based on the recent news that Spotify secured a patent to monitor\nusers' speech\n[https://consequenceofsound.net/2021/01/spotify-patent-monitor-users-speech/],\nyou may find yourself in the situation that you want to switch to a different\nstreaming service or back-up your music playlists.\n\nAs…",
  "data/reddit-know/r/YouShouldKnow/comments/l7ftds/ysk_to_take_high_quality_photos_of_yourself_and.json": "Why YSK: I know this tip is helpful for a few different reasons, but this post\nis specifically about obituaries. After working at a small town newspaper for\nnearly a decade, I've noticed that many people submit low-quality, unflattering\nphotos of their deceased relatives. You never know when you or…",
  "data/reddit-know/r/YouShouldKnow/comments/l99qbx/ysk_if_you_decide_to_visit_familyfriends_that_are.json": "Why YSK: during rough times even small extra tasks/errands can create stress\n\nMe and my GF are going through a real hard time, own little baby is in hospital.\nOur family came to visit from out of town for a day (much appreciated moral\nsupport obviously) but we had to pick them up from the airport…",
  "data/reddit-know/r/YouShouldKnow/comments/l9h3pm/ysk_that_operating_rooms_handle_their_own_code.json": "Why YSK: I work in an Operating Room, and many times when a “Code blue” is\ncalled, I’ve seen family members in the waiting room look worried. Even my own\nfamily members have done this during their child’s surgery. When I explained\nthat the “Code Blue” you hear isn’t for the operating room, it helps…",
  "data/reddit-know/r/YouShouldKnow/comments/l9jm66/ysk_to_keep_you_distance_from_any_car_with_snow.json": "Why YSK: if the snow has been given enough time, it can melt and refreeze,\ngiving the car a layer of ice that can fly off at highway speeds.\n\nWhen you have a sheet of ice flying at you at 65 mph, you can either dangerously\nswerve and potentially lose control or hit another car, or you can tank the…",
  "data/reddit-know/r/YouShouldKnow/comments/l9tsri/ysk_advertisers_on_reddit_are_charged_per_click.json": "Why YSK: Perhaps there are advertisers you do not support but would nonetheless\nlike to drive up advertising costs for by clicking (and immediately closing)\ntheir link? 🚀",
  "data/reddit-know/r/YouShouldKnow/comments/la6l28/ysk_how_to_coexist_with_wildlife.json": "Why YSK not to feed, touch, or try to own wildlife (may sound obvious but\napparently it isn’t)\n\nHumans stress wildlife out... By feeding them, They will start trusting people\n(even ones who will kill or injure them). From an employee of a wildlife\nrehab/sanctuary: ‘People think because they love…",
  "data/reddit-know/r/YouShouldKnow/comments/la8adw/ysk_you_dont_have_to_shake_or_wave_around_instant.json": "Why YSK: Each picture contains the chemicals needed to process it in little\npouches at the bottom edge of the film. When the photo is ejected from the\ncamera it is squeezed between two rollers which burst the bags and smear the\nchemicals onto the photo, developing it. Laying the photo flat on a…",
  "data/reddit-know/r/YouShouldKnow/comments/la8mni/ysk_no_matter_what_headspace_youre_in_you_are_not.json": "Why YSK : many are suffering with mental health issues especially now and i just\nwant to remind everyone that it’s ok to talk, it’s ok to not be ok. There’s\nalways hope, don’t give up, don’t let it win",
  "data/reddit-know/r/YouShouldKnow/comments/laenb3/ysk_if_you_did_not_receive_the_us_stimulus_checks.json": "Why YSK:\n\nThe US stimulus checks were based off of 2019 tax returns, but due to this, many\npeople who should have gotten the money in 2020 did not qualify, as they were\neither dependents in 2019 and now independents, or were above the salary\nthreshold in 2019 but laid off in 2020, or merely did not…",
  "data/reddit-know/r/YouShouldKnow/comments/lai4hb/ysk_that_when_it_snows_you_should_shovel_a_3x3.json": "Why YSK: when there is enough snow to block fire hydrants it’s very difficult\nfor firefighters to connect hoses to the hydrants without removing the snow. It\ntakes anywhere from five to ten minutes to shovel the snow and it could mean the\ndifference between someone’s house being a complete loss in a…",
  "data/reddit-know/r/YouShouldKnow/comments/layr4p/ysk_that_when_driving_on_wet_winter_roads_that.json": "Why YSK: You should know this because controlling your speeds and being aware of\nother other vehicles speeds as well as movements are very important aspects of\ndriving in inclement weather and/or icy roads. Being able to predict what is\nabout to happen or what could possibly happen could help you…",
  "data/reddit-know/r/YouShouldKnow/comments/lbdjrg/ysk_if_you_think_you_are_being_followed_turn.json": "Why YSK: if you’ve been driving for a long time and you continue to see the same\ncar behind you even though you’ve taken a few turns, it’s possible that you’re\nbeing followed. The best advice\n[https://skyguard.co.uk/what-to-do-if-youre-being-followed/] you can follow\nis to stay calm and turn right…",
  "data/reddit-know/r/YouShouldKnow/comments/lbuxrs/ysk_when_applying_to_companies_abroad_adapt_the.json": "When applying to a company abroad, make sure that the information you present is\nunderstandable for someone from that country.\n\nThis includes: * Adding the country codes to your phone number (+1 for US) *\nAdding the country to places you worked / studied instead of only states *\nAdding the country /…",
  "data/reddit-know/r/YouShouldKnow/comments/lbw6uu/ysk_that_41_of_the_population_have_a_vitamin_d.json": "https://pubmed.ncbi.nlm.nih.gov/21310306/\n\nWhy YSK: According to PubMed, 41.6% of the U.S. population is vitamin D\ndeficient.\n\nThis vitamin is created when the system is in contact with UV rays via the sun,\nwhich means that almost half of the population is deficient in winter.\n\nThe most common…",
  "data/reddit-know/r/YouShouldKnow/comments/lc74ab/ysk_ordinary_white_mushrooms_are_amazing_sources.json": "Why YSK: Vitamin D deficiencies are shown to dramatically impact your health in\na number of ways. You get most of your Vitamin D from the sun, but if you're\nunable to get what you need from sun exposure, mushrooms are a great\nreplacement. White mushrooms are cheap and available in most supermarkets…",
  "data/reddit-know/r/YouShouldKnow/comments/lcfaga/ysk_if_you_threaten_violence_against_guys_who.json": "Why YSK:I know three different girls who have been abused by their boyfriends,\nand didn't tell their family about it. Their reason is that they don't want\ntheir protective older brothers/fathers/uncles to hurt the guy and end up in\nprison. You may think that by being overly protective you are…",
  "data/reddit-know/r/YouShouldKnow/comments/lcqfb7/ysk_old_people_do_not_often_feel_old_treating.json": "Why YSK: As I get older, I realised that people call me old, treat me old, and\ngenerally think that because I am old, that I think certain things.\n\nWhen I go out to dinner with other people from the company, or am around younger\npeople in general, there is often an unspoken moment that people try to…",
  "data/reddit-know/r/YouShouldKnow/comments/lcyem5/ysk_craving_ice_is_a_symptom_of_iron_deficiency.json": "Why YSK: If you like crunching ice after you finish your soda, you might be\nsuffering from anemia\n[https://bestlifeonline.com/middle-age-health-warning-signs/]. Also known as\n\"pagophagia,\" the compulsive eating of ice may not just be a nervous tick, but a\nway of cooling inflammation in the mouth…",
  "data/reddit-know/r/YouShouldKnow/comments/ld6e1g/ysk_that_you_can_use_vlc_player_to_play_youtube.json": "VLC Player is a very popular app for PCs, but is also available for mobile. You\ncan play most online videos and streams by pasting the link to them into the\napplication. It will play without ads and you can use such features as sleep\ntimer, background playing, only audio etc. It's a bit slower,…",
  "data/reddit-know/r/YouShouldKnow/comments/ldfbn9/ysk_most_customer_service_livechat_agents_can_see.json": "Why YSK: People tend to incriminate themselves by typing one thing out and then\nerasing it, then sending something else. Additionally, some people will type out\ninsults or swears and even though they never send it, the agent saw it and will\nstop taking them seriously.",
  "data/reddit-know/r/YouShouldKnow/comments/ldjynx/ysk_that_the_irs_is_offering_tax_relief_and.json": "WHY YSK: This is for anyone who has accumulated tax debt from the hardships we\nfaced in 2020. The IRS is offering multiple programs to help people consolidate\ntheir tax debt. You can compromise with them to settle with a small sum or be\nput on a payment plan. They have multiple options.\n\nA lot of…",
  "data/reddit-know/r/YouShouldKnow/comments/ldk0yj/ysk_in_your_phone_settings_you_can_change_over.json": "Why YSK; AT&T and Tmobile (at the least) are currently pretending they have\nlegitimate 5G. But it's clearly inferior. A simple setting adjustment will put\nyou back on track however. Settings>connections>mobile networks>network mode.\nThen choose one down from the \"magical 5G\". Link to article that…",
  "data/reddit-know/r/YouShouldKnow/comments/ldn0v0/ysk_topping_off_your_vehicle_at_the_fuel_pump_is.json": "Why Ysk; topping off your vehicle at the fuel pump can damage your vehicles\nevaporative emissions system. At the very least it could cause an annoying check\nengine light and or hard starting after filling up. Worse, it could cause the\npurge valves and solenoids in the system to fail or the charcoal…",
  "data/reddit-know/r/YouShouldKnow/comments/ldn5wj/ysk_if_you_are_experiencing_a_lot_of_static.json": "Why YSK: Dry air causes static. Static discharge can damage electronics if they\naren’t properly grounded. But mostly static shocks are annoying.\n\nThe static is just one of the annoyances of overly dry air. For me I also\nexperience dry skin and occasionally sinus discomfort if the air is…",
  "data/reddit-know/r/YouShouldKnow/comments/le5v6d/ysk_that_the_symptoms_of_a_heart_attack_may_be.json": "As someone who had a heart attack less than 6 months ago, the symptoms and signs\nmay not be what you expect. You also don’t need to be what people stereotype as\nthe ‘high-risk’ category or have had indicators or warnings that you could be at\nrisk.\n\nThe chest pain, arm pain, shoulder pain were there…",
  "data/reddit-know/r/YouShouldKnow/comments/le78aw/ysk_teleflora_is_a_scam.json": "Why YSK: It's almost valentines day, and you might be ordering flowers soon or\nhave relatives (especially elderly) who might. Don't order from Teleflora. Tell\nyour grandma this as well.\n\nI ordered from them a few months ago, and I was completely ghosted by them. I’ve\nbeen looking into them ever…",
  "data/reddit-know/r/YouShouldKnow/comments/lecpti/ysk_that_at_will_employment_does_not_mean_your.json": "Why YSK: Many illegal behaviors by American employers are tolerated by employees\nwho have been told something to the effect of \"at-will employment means that\neven if they can't fire you for reporting them, they'll just fire you the next\nday for no reason at all\", but that isn't actually true. If an…",
  "data/reddit-know/r/YouShouldKnow/comments/ledo0m/ysk_most_people_who_use_wheelchairs_arent.json": "Why YSK: because insulting disabled people in person or online by accusing them\nof faking makes you look like an ignorant jerk AND perpetuates a mindset that’s\nreally harmful to disabled people.\n\nOkay, this might seem obvious to most of you, but disabled folks I know get\naccused of faking whenever…",
  "data/reddit-know/r/YouShouldKnow/comments/leill8/ysk_if_you_use_canvas_for_your_online_classes.json": "Why YSK: Canvas may be showing your exact address to your classmates, which is a\nprivacy/security issue.",
  "data/reddit-know/r/YouShouldKnow/comments/leofmb/ysk_if_you_use_the_free_ad_supported_version_of.json": "I don't know why, I'm not tech savvy at all but I've been doing this for about 2\nyears now. The interface always starts off asking you to click to enable ads but\ndon't, just wait for about 10 seconds and your show/movie will start. At every\nscheduled break where there's supposed to be an ad, it gets…",
  "data/reddit-know/r/YouShouldKnow/comments/lepym2/ysk_its_means_it_is_and_its_shows_belonging_or.json": "Why YSK: Your written expressions will look more educated if you correctly use\nthose two (really three) words. For example, at my neighborhood diner the\noutdoor sign should read \"Country cooking at its best\" because the diner claims\nthe best cooking in the area for itself. The \"its\" is a possessive…",
  "data/reddit-know/r/YouShouldKnow/comments/leuo32/ysk_if_you_hear_koreans_say_neegah_in_converation.json": "Why YSK: There was a post in a Korean forum warning users to be careful to avoid\nsaying Nee-gah around non-Koreans because they had an experience where a\nbystander misinterpreted the conversation as being about them when it wasn't and\nattacked them. It literally just means \"you\".",
  "data/reddit-know/r/YouShouldKnow/comments/leux99/ysk_in_regards_to_disabled_toilets_just_because.json": "Why YSK : I often get people making comments about this to me, my little brother\nis autistic and in the uk we have a thing called radar keys which allow you to\nunlock disabled toilets in restaurants and public areas. You have to have this\nkey to get access to these toilets and you have to have a…",
  "data/reddit-know/r/YouShouldKnow/comments/ley7ic/ysk_that_you_should_prepare_for_your_death_even.json": "Every person that has a family needs to begin this process now!\n\nWhy YSK: Imagine dying as the sole source of income for your loving family and\nburdening them with debt.\n\nYou can get into a life insurance policy as a young healthy person quite cheep.\n\nLook it up and do it, at least pay for your own…",
  "data/reddit-know/r/YouShouldKnow/comments/lf1mfj/ysk_all_animals_deserve_to_be_treated_with.json": "Why YSK : So many animals are treated horribly because they aren’t deemed cute\nfor example people getting judgement for having unusual pets from reptiles to\narachnids. They all deserve your respect",
  "data/reddit-know/r/YouShouldKnow/comments/lfe3sy/ysk_zipper_merging_waiting_to_merge_until_the.json": "Why YSK: It may seem counter-intuitive, or that people are being selfish by\ncontinuing to drive in that lane, but it helps traffic by using all the\navailable space and it reduces the likelihood of accidents!\n\nhttps://www.trafficsafetystore.com/blog/the-zipper-merge-could-impolite-drivers-be-in-the…",
  "data/reddit-know/r/YouShouldKnow/comments/lfkezy/ysk_if_you_are_driving_long_distances_in.json": "Why YSK: Slush gets tossed from the car in front of you, your headlights become\ncovered over time. Within just 60 minutes, you can fully occlude your\nheadlights. The problem is, if you're sitting the driver seat you wont realize\nyour lights are covered. You should be proactively checking.\n\n\n\nDrive…",
  "data/reddit-know/r/YouShouldKnow/comments/lfmmbw/ysk_if_you_find_yourself_in_dire_financial.json": "This can be a lifesaver to someone struggling/worrying how in the world they’ll\npossibly make that next payment. There’s forbearance, forgiveness, abatement,\netc. If you’ve previously made payments in a timely manner, there’s a multitude\nof options. Even if you’ve previously had issues, there’s…",
  "data/reddit-know/r/YouShouldKnow/comments/lg4wpi/ysk_automotive_basics_at_least_a_rough_idea_of.json": "Why YSK: not everyone is expected to be a professional mechanic, but if you own\nor drive a car you’ll eventually have to take it to one. Aside from being able\nto tell if a bad mechanic is taking advantage of you, it will also stop you from\ntreating EVERY mechanic/tech like they’re trying to take…",
  "data/reddit-know/r/YouShouldKnow/comments/lg5n0o/ysk_that_rub_your_chest_your_arms_will_take_care.json": "In the movie, Batman Begins, a younger Bruce Wayne is in training learning to be\nBatman. He is learning to fight on top of a frozen lake and ends up falling\nthrough the ice. After getting out of the water and freezing to death he is\nsitting in front of a fire rubbing his arms trying to keep warm. He…",
  "data/reddit-know/r/YouShouldKnow/comments/lgetui/ysk_when_youre_feeling_ashamed_for_complaining.json": "Why YSK: At a time when mental health is at an all-time low for so many, the\nfeelings of guilt for not being “worse off” add fuel to the flames of degrading\nmental resiliency and healthy processing of our issues. You deserve to know that\nyou don’t have to bottle up your feelings and fail to fully…",
  "data/reddit-know/r/YouShouldKnow/comments/lh09z9/ysk_local_libraries_usually_have_movies_tv_series.json": "Why YSK: I was talking to a co-worker the other day and evidentially this isn't\ncommon knowledge. I have been using my local library as a GREAT source of free\nentertainment. There is so much more than just books there. I also love donating\nto the library. Whenever I am thinning out my movie/TV…",
  "data/reddit-know/r/YouShouldKnow/comments/lh44cw/ysk_plan_b_at_costco_does_require_a_membership.json": "Why YSK: I work in the pharmacy at Costco and these last several months we have\nhad dozens of people come up to us asking for Plan B. It is true that you do not\nneed to be a member to use the pharmacy; but that is limited exclusively to\nprescriptions, not over the counter medications. We have to…",
  "data/reddit-know/r/YouShouldKnow/comments/lhch9e/ysk_that_not_all_abuse_is_physical_or_visible.json": "WHY YSK: Emotional and mental abuse leaves hidden scars that no one can see by\nlooking at someone. They can be seen in certain actions or words. Constant\napologizing is a big red flag as is fear of making a mistake or upsetting their\npartner. People who have been emotionally and/or mentally abused…",
  "data/reddit-know/r/YouShouldKnow/comments/lhjx3w/ysk_how_to_perform_cpr_on_household_pets.json": "Why YSK: It is a lifesaving asset in an emergency where your pets needs\nimmediate first aid, and you get to spend more time with your fluffy friends if\nyou ever need to use it.\n\nEdit: Useful link-\nhttps://www.pdsa.org.uk/taking-care-of-your-pet/looking-after-your-pet/all-pets/giving-cpr-to-pets",
  "data/reddit-know/r/YouShouldKnow/comments/lhoapl/ysk_organic_foods_are_not_inherently.json": "Why YSK: The preconceived notion that organic food products are healthier is a\nmisconception. Organic foods are simply free of hormones and antibiotics.\nOrganic produce is grown using fewer synthetic fertilizers and pesticides.\nOrganic foods have really no nutritional advantage over non-organic…",
  "data/reddit-know/r/YouShouldKnow/comments/lhqg72/ysk_pharmacies_can_charge_wildly_different_prices.json": "Why YSK: A family member has a certain medication that needs to be refilled\nevery month. For many years, we were paying $600 / month out of pocket at our\nregular pharmacy - even though we are lucky enough to have very good insurance.\nWe just assumed all pharmacies would charge roughly the same price…",
  "data/reddit-know/r/YouShouldKnow/comments/lhztdo/ysk_it_is_totally_fine_to_want_a_quiet_simple.json": "Why YSK: It’s okay if you want to just read a book on the weekends or play video\ngames or go on hikes. it’s okay to just live. I know that sometimes we think\nabout all of the grand ways we can change the world and we get down on ourselves\nwhen we feel like we don’t live up to our own standards, but…",
  "data/reddit-know/r/YouShouldKnow/comments/li5p6i/ysk_you_dont_have_to_call_to_cancel_a.json": "Some companies make you jump through hoops to cancel a subscription. Rather than\nletting you cancel on their website, they make you call them on the phone, wait\non hold, talk to a representative, explain your reason for canceling, get\ntransferred to the loyalty department, etc.\n\nCalifornia passed a…",
  "data/reddit-know/r/YouShouldKnow/comments/lig3fd/ysk_if_your_power_goes_out_in_the_winter_and_your.json": "During that time, your hot water heater will have heated a new tank of water,\nand you can drain your tub and repeat the process.\n\nWhy YSK: During winter, a lot of people have problems with power due to snow or\nice. Don’t do something dangerous that might lead to carbon monoxide…",
  "data/reddit-know/r/YouShouldKnow/comments/lihvzp/ysk_maintaining_food_storage_is_a_major_help_in.json": "Why YSK: Everyone talks about having an emergency fund, but given the run on\nsupermarkets that happened in early 2020 I think this is a topic worth\ndiscussing. Even if you are simply unemployed temporarily, having food storage\nwill extend the life of your emergency fund because you can just draw…",
  "data/reddit-know/r/YouShouldKnow/comments/liq5wv/ysk_that_if_a_cashier_has_their_light_off_you.json": "Why YSK: The cashier most likely has their light off because they have other\nthings to go do around a store, they need go to break, or they need to clock out\nfor the day. Nowadays, most retail stores have policy that do not allow cashiers\nto say no/that they are closed, even if you ask “are you…",
  "data/reddit-know/r/YouShouldKnow/comments/lis00l/ysk_when_it_comes_time_to_put_your_pet_to_sleep.json": "Why YSK: A trip to the vets office is probably not the place your pet wants to\nhave their last memory, or enjoys being at. Let their last memory be of a\ncomfortable and familiar place.\n\nCall around, there is likely a vet who will make a house call. I’ve put 7\nanimals down this way in my lifetime and…",
  "data/reddit-know/r/YouShouldKnow/comments/liyiwu/ysk_that_if_you_see_a_large_bright_meteor_or.json": "Why YSK: reporting a fireball on the website is easy and you can see (if enough\npeople report it) the path the meteor took and how far away it was visible from.\nIf you have not seen one recently than you can just scroll through reports by\nother users.\n\nP.S. despite being named \"The American meteor…",
  "data/reddit-know/r/YouShouldKnow/comments/lj0zqe/ysk_just_because_the_money_shows_in_your_account.json": "If you are selling something or taking money from a stranger, the bank still has\nthe right to take the money back out of your account if the check bounces, they\nfind fraud, etc. If you are ever unsure, ask the bank when the check will\ntotally clear. That can take up to 5 business days.\n\nWhy YSK:…",
  "data/reddit-know/r/YouShouldKnow/comments/ljbriu/ysk_despite_all_the_flack_you_get_from_your.json": "Why YSK:\n\nI see so many people on reddit making jokes about themselves and being insecure\nabout being a virgin after all their friends have already had sex. I understand\nthe negativity attached to that label. I was a teenager and in my early 20s too.\nI get it you guys.\n\nOf our friend group in high…",
  "data/reddit-know/r/YouShouldKnow/comments/ljd533/ysk_that_candle_wax_is_extremely_flammable_and.json": "Why YSK: If candle wax reaches its flash point (appx 400F) and catches fire,\nblowing on it will create a larger flame and spread droplets of flaming molten\nwax everywhere. Pouring water on the candle will create an explosive ball of\nflame that can reach up to 6ft in height, spreading the fire…",
  "data/reddit-know/r/YouShouldKnow/comments/ljekzj/ysk_if_you_have_dry_scaly_hands_you_should_use.json": "Why YSK:\n\nMore people are suffering dry skin than ever due to excessive use of hand\nsanitizer and washing your hands.\n\nYou should know that 99% of lotions contain alcohol to make them dry quicker,\nbut this can literally sting and make your hands drier when you are getting\ncracked skin.\n\nOur skin…",
  "data/reddit-know/r/YouShouldKnow/comments/ljghlj/ysk_you_can_use_laser_pointers_with_cats_but_you.json": "Why YSK: Dogs are much more tactile animals when compared to cats and they need\nsomething physical to play with, in order to properly understand it.\n\nUsing a laser pointer might seem like fun because it can exercise them without\nany work, but it is actually causing them anxiety and potential issues…",
  "data/reddit-know/r/YouShouldKnow/comments/ljpb4m/ysk_it_is_highly_unethical_for_someone_to.json": "Whether it's Jewelry, Art, Property, or whatever it may be, it is unethical for\nsomeone to give you an appraisal and then immediately offer to buy it from you.\nThat's a giant red flag that you should go to someone else for an appraisal,\nperhaps even getting multiple appraisals from different…",
  "data/reddit-know/r/YouShouldKnow/comments/ljrja0/ysk_that_if_you_are_suffering_from_an_unusual.json": "Why YSK: There are lots of folks out there not getting help from their\nregular/local doctors who often have debilitating and obscure conditions. Even\nnearby specialist can be a fluke at times. Searching the authors/cobtributors of\nrecent pubmed articles can often put you in touch with true experts…",
  "data/reddit-know/r/YouShouldKnow/comments/lk15tl/ysk_if_a_small_business_hooks_you_up_with_free.json": "Why YSK: This can attract the wrong type of customer to the business, and lead\npeople to expect things that are not advertised.\n\nIf you want to help the business mention things like \"went above and beyond\"\n\"came in under the estimate\" \"always willing to work with my needs.\" This can\ndrive traffic to…",
  "data/reddit-know/r/YouShouldKnow/comments/lkctvj/ysk_win10_users_can_press_the_windows_key_and_tab.json": "Why YSK: This is mostly relevant for gamers who're used to opening task manager\nto close games that have crashed but won't close properly. Sometimes task\nmanager won't open properly because the game is taking up the entire screen and\nno matter what you do you can't access task manager. Using this…",
  "data/reddit-know/r/YouShouldKnow/comments/lke7yo/ysk_dating_is_not_about_impressing_its_about.json": "Why YSK: This is in light of Valentine’s Day and what I’ve noticed some of my\nown friends struggling with in the dating sphere.\n\nInstead of worrying about whether you’re good enough for them, flip the script\nand ask yourself whether they’re a good fit for what you’re looking for. You’re\nvetting for…",
  "data/reddit-know/r/YouShouldKnow/comments/lkennz/ysk_you_should_close_all_the_doors_in_your_house.json": "Why YSK: if a fire ignites in any compartment, having the doors closed delays\nflames and smoke spread to other compartments, wich can give you time to notice\nit, get out and call firefighters. As a firefighter for only over 5 years, I've\nseen major differences on house fires with both doors open and…",
  "data/reddit-know/r/YouShouldKnow/comments/lkfppm/ysk_that_snow_shoveling_is_a_real_trigger_for.json": "Why YSK: I've seen a lot of people jokingly try to get out of yard work by\nreferencing the physical stress of it, but the truth is that snow shoveling,\nespecially when dealing with wet & heavy and/or thick snowfalls, is a very real\ntrigger for heart attacks (here's one source: the Cleveland…",
  "data/reddit-know/r/YouShouldKnow/comments/ll96n1/ysk_you_can_search_a_movie_on_google_drive_by.json": "Why YSK: It's very useful to find a movie which can be unfindable on YouTube",
  "data/reddit-know/r/YouShouldKnow/comments/llgc0j/ysk_when_talking_to_anyone_dont_only_bring_up_the.json": "Why YSK Even if the good news you have is small, share it with others. We don't\nlike listening to people only complaining.\n\nDon't use your friends/family/co-workers as therapy outlets.",
  "data/reddit-know/r/YouShouldKnow/comments/llhelq/ysk_the_irs_will_never_call_you_they_will_never.json": "Why YSK: Scammers are constantly trying to steal from people under the guise of\nthe IRS. The IRS will almost always reach out to you by mail first. Do not trust\nanyone claiming to be from the IRS if you were unaware of the call - they will\nnot surprise you! They will always tell you before they…",
  "data/reddit-know/r/YouShouldKnow/comments/llm4tv/ysk_that_when_you_have_no_heat_in_your_house_and.json": "If it’s cold enough to freeze your pipes, turn on your taps, just a trickle is\nenough for keeping away minor freezing. For colder temperatures, open the faucet\nmore. Water is very good at transferring heat to the metal and the flow will\nlikely keep the pipes from seizing up completely. Also don’t…",
  "data/reddit-know/r/YouShouldKnow/comments/llndj9/ysk_your_job_is_important_but_not_as_much_as_your.json": "Why YSK: You can't keep your money when you're long gone. You need to take\nbetter care of yourself mentally and physically. Your body and mind will thank\nyou for it!",
  "data/reddit-know/r/YouShouldKnow/comments/lltbpa/ysk_if_youre_sitting_in_your_car_and_running_it.json": "Why YSK: If you run your car while the tailpipe is covered in snow, carbon\nmonoxide can back up into your car and you can die, similar to running it in a\ngarage. This was hounded into me from a young age growing up where we get a lot\nof snow every year, but it occurred to me that it may not be…",
  "data/reddit-know/r/YouShouldKnow/comments/llyfn2/ysk_how_to_shelter_in_place_from_the_cold.json": "Why YSK: Evidently many of you were unaware that temperatures below 50 degrees\nexist untill recently. This storm is not a freak event; there will be more.\n\nNOTE: This is for sheltering IN PLACE. This is not advice on how to trek across\na frozen landscape for any reason.\n\nI'm gonna list some things…",
  "data/reddit-know/r/YouShouldKnow/comments/lm5816/ysk_just_because_you_forgive_someone_doesnt_mean.json": "Why YSK: Too often, people expect that everything will return to the way it was\n\"before\" when they do something horrible to you or treat you badly. Some people\nexpect that as their preordained right and some even bother to apologize. To be\nlet \"back into\" your life is not a given. Just because you…",
  "data/reddit-know/r/YouShouldKnow/comments/lm7c9r/ysk_if_you_ever_have_to_collect_water_from_an.json": "Why YSK: When you boil water you kill off any parasites, germs, or other living\nthings in the water that can kill you or make you sick enough for death to be a\nconcern. However, boiling water doesn't remove chemicals or heavy metals\ncollected in the water supply. To make sure that you are only…",
  "data/reddit-know/r/YouShouldKnow/comments/lm8c62/ysk_whitening_toothpaste_is_usually_more_abrasive.json": "Why YSK: Switching from a regular toothpaste to one branded \"whitening\"\ntoothpaste is like switching from a fine grit sandpaper to a coarse grit\nsandpaper. The coarser grit allows it to more effectively scrape away stains, as\nwell as tartar and plaque.\n\nThis can be fine for strong, healthy teeth,…",
  "data/reddit-know/r/YouShouldKnow/comments/lmjq8x/ysk_add_outlinecom_before_a_url_to_bypass_the.json": "Why YSK: trying to debug code / find new information becomes painful when you\nhave to sign up to every website to see the information. It is also helpful to\nignore inappropriate or click-baity ads",
  "data/reddit-know/r/YouShouldKnow/comments/lmlhhr/ysk_today_nasas_perseverance_rover_lands_on_mars.json": "Why YSK: Today Persererance Rover will land itself on Mars. It's another\nincredible feat for humanity. Flying on another planet is set off to happen for\nthe first time today, which is very cool and will be a test of how it will work!\nEveryone should be very excited for this.\n\n-----------------------…",
  "data/reddit-know/r/YouShouldKnow/comments/lmnz4b/ysk_if_you_suspect_someone_is_following_you_go_to.json": "Why YSK: Your fist instinct may be to go home where you can be “safe” and lock\nthem out. However, you are leading them to your home for one. Also even if you\nlive with family they may be gone. So now you are alone with a threat. By going\nto a police station you are going to definitely find people…",
  "data/reddit-know/r/YouShouldKnow/comments/lmrv48/ysk_not_shoveling_your_sidewalks_will_impede.json": "Why ysk: I didn’t completely understand the gravity of not shoveling sidewalks\nbut my blind friend just FaceTimed me completely lost because people didn’t\nshovel and she got lost. Thankfully, there seemed to be little ice. I’ve also\nheard of more than one wheelchair bound person who have tipped over…",
  "data/reddit-know/r/YouShouldKnow/comments/lmsusb/ysk_whence_means_from_where_and_similarly_hence.json": "Why YSK: people frequently use \"from whence\" which is redundant since the \"from\"\nis already baked in.",
  "data/reddit-know/r/YouShouldKnow/comments/ln2fyy/ysk_if_you_cant_afford_to_pay_for_mindfulness.json": "Why YSK:\n\nTimes are tough, dudes, and we all need some help sometimes. When you're in a\nplace where you can't afford therapy, or need a little extra support between\ntherapy appointments, mental health apps can help fill those gaps.\n\nNot all mental health apps are legit, though, and outside of the…",
  "data/reddit-know/r/YouShouldKnow/comments/ln6pds/ysk_that_leaving_water_running_will_help_prevent.json": "Why YSK: People living in normally warm areas like Texas are not familiar with\nsome of the ways you can prevent cold weather disaster. On top of that, home\nconstruction there wont be designed to protect against freezing temps.\n\nWith prolonged sub-freezing temperatures the water in your pipes can…",
  "data/reddit-know/r/YouShouldKnow/comments/lnfndu/ysk_to_keep_water_in_your_toilets_and_pour_some.json": "Why YSK: For those without water it's important to know you need to leave water\nin the bottom of your toilet, and put some form of liquid in your sinks\noccasionally (Preferably water or melted snow). There is part of the plumbing\ncalled a P-trap that holds water and stops sewer gases from coming…",
  "data/reddit-know/r/YouShouldKnow/comments/lnoh5d/ysk_poison_dart_frogs_arent_actually_poisonous.json": "Why YSK : Many people who see these exotics kept as pets often are confused as\nto why you would risk it. I personally have had this many times with my darts\nand i don’t think people realise that the frogs themselves aren’t actually\npoisonous",
  "data/reddit-know/r/YouShouldKnow/comments/lnrsbn/ysk_if_you_watch_south_park_with_subtitles_you.json": "Why YSK: Because Kenny says all kinds of dirty stuff all that time. Dirty stuff\nis fun.",
  "data/reddit-know/r/YouShouldKnow/comments/lns3x2/ysk_dont_hangup_on_robocalls_fight_back_put_the.json": "Why YSK: If you're like me, you get a LOT of robocalls. Some just hang-up a soon\nas you answer, others are dead air. There is an easy way to fight back! Instead\nof hanging-up, put the call on hold. For every second that the call is on hold,\nthat's one less second that they can robocall someone else.…",
  "data/reddit-know/r/YouShouldKnow/comments/lnutgt/ysk_if_your_vehicle_is_ever_totaled_make_the.json": "Why YSK: If you are ever in an accident that results in a total loss you\ninsurance will appraise your vehicle so as to know what to pay you out for the\nsettlement. Especially if your vehicle is newer, there may not be many\ncomparables in the area to give an accurate representation of what your…",
  "data/reddit-know/r/YouShouldKnow/comments/lny54u/ysk_that_when_you_speak_to_someone_who_is_hard_of.json": "Why YSK: For most hearing impaired people, consonant sounds are muddled and\ncannot easily be distinguished if pronounced quickly. Vowels are heard more\nclearly because they carry most of the sound of a word, but consonants happen\nquickly in speech and aren't as audible or distinguishable. It's easy…",
  "data/reddit-know/r/YouShouldKnow/comments/loggqz/ysk_positive_reinforcement_goes_a_long_way.json": "Why YSK: praise is one of the main drivers in human psychology. We focus too\noften on scolding or pointing out the wrongs, but very rarely make others notice\ntheir rights. In arguments, take time to acknowledge and praise intellectual\nhonesty or the admission of a mistake. It will make the…",
  "data/reddit-know/r/YouShouldKnow/comments/loje55/ysk_that_up_to_1_in_5_people_experience_random.json": "Why YSK: because it's very painful, very scary, very common, yet nobody talks\nabout it because it's embarrassing. People should know that this has a name,\nhappens to a lot of us, there is no cure, but there are ways to manage the pain.\nWhich is btw, the most intense pain you can imagine, and it…",
  "data/reddit-know/r/YouShouldKnow/comments/lopiih/ysk_that_if_your_vehicle_gas_pedal_gets_stuck.json": "Why YSK: Although this maybe a rare occurrence, it’s always safe to know how to\nperform certain things in unsafe situations. It just might save your life one\nday.",
  "data/reddit-know/r/YouShouldKnow/comments/lopq32/ysk_that_negative_reinforcement_doesnt_mean.json": "Why YSK: Too often the term negative reinforcement is used to describe removing\na preferred item or activity as punishment for unexpected behavior. However,\nnegative reinforcement is the practice of removing a negative stimulus (in my\nchild’s case, eating cauliflower) as a reward and reinforcer for…",
  "data/reddit-know/r/YouShouldKnow/comments/lozk0a/ysk_if_you_are_an_employer_or_employee_in.json": "Why YSK:\n\nAs of January 01, 2021 the Equal Pay for Equal Work Act requires that Employers\ndisclose pay and benefits with a job posting.\n\nAs an employee (or job hunter):\n\nThat means you now have the ability to see what new hires would be paid.\n\nYour employer must also disclose any promotion…",
  "data/reddit-know/r/YouShouldKnow/comments/lp504p/ysk_if_you_have_asthma_symptoms_after_exercise_it.json": "Regardless of what shape you’re in, if you experience asthma-like symptoms\n(coughing, wheezing, tightness in the chest, hyperventilating) this may be\nwhat’s known as EIB or exercise-induced bronchoconstriction. It’s made worse in\ncold or dry air. You may notice that breathing through a sleeve helps…",
  "data/reddit-know/r/YouShouldKnow/comments/lpen0m/ysk_the_150_plus_feet_45_meters_of_space_and_more.json": "Why YSK - It is called the “kill zone” and its supposed to act as a buffer zone\nbetween a car and the truck. Trucks when fully loaded (which is often) can take\naround two American football field lengths (600 feet or 182 meters) to slow to a\ncomplete stop even when applying full braking pressure.…",
  "data/reddit-know/r/YouShouldKnow/comments/lpp5nn/ysk_when_you_worry_about_what_the_others_think.json": "Why YSK: many people get very unhappy because, in their heads, they believe\nothers don't like them. In reality, everyone thinks about what others think\nabout them.\nIt is worthwhile looking closer into this, and slowly practicing the art of not\ngiving a fuck. It will lead to a happier life. There are…",
  "data/reddit-know/r/YouShouldKnow/comments/lpsx29/ysk_if_you_see_a_plastic_bag_in_the_ocean_do_not.json": "Why YSK: While picking up litter is a service to all, it may not be a plastic\nbag. Jellyfish can look a LOT like plastic bags in the ocean, and some can even\nbe deadly.\n\nEdit: I’m not advocating littering",
  "data/reddit-know/r/YouShouldKnow/comments/lq64g1/ysk_that_you_probably_have_cheaper_options_on.json": "Why YSK- As a former representative/manager at a wireless carrier, I know first\nhand that most carriers do not tell you that you have options when it comes to\nprotecting your device. Often times you will only be given the most expensive\ncoverage option as it generates the most revenue. And this…",
  "data/reddit-know/r/YouShouldKnow/comments/lqaw5w/ysk_that_walmart_sells_regular_and_7030_insulin.json": "YSK that Walmart sells vials of regular (human) insulin for $24.88 apiece over\nthe counter (from the pharmacist) without a prescription OTC, and $42.88 for\n70/30 pens, under its ReliOn brand.\n\nMost diabetics generally should not substitute it for rapid-acting insulin\nwithout a healthcare provider's…",
  "data/reddit-know/r/YouShouldKnow/comments/lqqkze/ysk_that_if_you_arent_getting_a_2_raise_every.json": "Why YSK: The annual inflation rate for the USA is about 2%\n[https://www.statista.com/statistics/244983/projected-inflation-rate-in-the-united-states/].\nEvery 5 years, you’ll have 10% less purchasing power, so make sure you’re\ngetting those raises whether it be asking your boss or finding a new job…",
  "data/reddit-know/r/YouShouldKnow/comments/lqsti5/ysk_you_can_dislocate_your_jaw_by_yawning_too.json": "Why YSK: I'm just letting you know this is a thing , I recently discovered it\ntoo and it happened to me a few times , it's preety scary at first.",
  "data/reddit-know/r/YouShouldKnow/comments/lrek8g/ysk_if_someone_you_know_is_going_through_some.json": "Why YSK: it's really nice to check on people when they have some medical\nemergency or are going through some really tough time (and of course is\nunderstandable that you may be worried) but be aware that the people you are\ntexting (either the person in trouble or the immediate family members)…",
  "data/reddit-know/r/YouShouldKnow/comments/lrh65x/ysk_yelp_filters_nonrecommended_reviews_has_been.json": "Why YSK: Scroll down to the bottom of each business page and click on “reviews\nthat are not recommended.”",
  "data/reddit-know/r/YouShouldKnow/comments/lrkggb/ysk_if_you_struggle_with_when_to_use_whowhom_if.json": "Why YSK:\n\nThis might be only be relevant to a small portion of Reddit.\n\nHow can you tell when your pronoun is the object of a verb or preposition? Try\nsubstituting “he” or “she” and “him” or “her.” If “he” or “she” fits, you should\nuse who. If “him” or “her” fits, you should use whom. Keep in mind…",
  "data/reddit-know/r/YouShouldKnow/comments/lrrsaq/ysk_dont_share_those_missing_persons_posts.json": "Well-meaning strangers often share and repost \"My 16 year old ran away last\nnight! Help me find her!\" or \"My sister has been MIA since last week! Here's her\npicture!\" or \"Help me find my baby boy! Last seen near X!\" posts hoping they'll\nhelp find and protect an endangered person. And everyone should…",
  "data/reddit-know/r/YouShouldKnow/comments/lrya1z/ysk_if_youre_calling_someones_cell_phone_during_a.json": "Why YSK: this can save you in an emergency when you need to get in touch with\nsomeone later than you might typically call.",
  "data/reddit-know/r/YouShouldKnow/comments/lslo8y/ysk_you_are_allowed_to_do_things_and_have_fun.json": "Why YSK: Be aware of the potential red flags of different forms of abuse. They\ndon't let you talk to the opposite gender? They become jealous easily? They ask\nyou for your passwords, or accuse you of cheating? They isolate you away from\nyour family or friends and yet they are allowed to hang out…",
  "data/reddit-know/r/YouShouldKnow/comments/lsmxa3/ysk_if_you_live_in_america_and_cant_afford_a_down.json": "Why YSK: Google \"USDA Rural Development Loan\". Search your area and find a home\nin a qualifying area to buy. I have personally used this loan twice. The loan is\nfor 100% of the home's cost and can even include certain items like closing\ncosts. The last home I purchased cost me $495 out of pocket and…",
  "data/reddit-know/r/YouShouldKnow/comments/lsqvwu/ysk_if_your_partner_says_you_dont_have_to_wear_a.json": "Why YSK: Even if your partner is on birth control (Or says that they are). It\ncan still fail, a condom will make extra sure you don't have an oopsie baby.\n\nNot only that, but it also helps with STD prevention as well.\n\nAnd if your partner says that: \"Oh my doctor said I probably can't…",
  "data/reddit-know/r/YouShouldKnow/comments/lsui9g/ysk_if_you_like_music_from_a_particular.json": "Why YSK: at times when you want to listen to songs of a genre or if you want to\nsearch for artists/bands who make music similar to your favourites, you can go\nto this website and get a ton of recommendation.",
  "data/reddit-know/r/YouShouldKnow/comments/lswfxj/ysk_a_very_common_cause_of_bad_breath_andor_bad.json": "Why YSK: there could be a simple solution to fixing a very common problem. If\nthe stones won’t come out, speak with your doctor or dentist. More information.\n[https://www.webmd.com/oral-health/guide/tonsil-stones-tonsilloliths-treatment-and-prevention]",
  "data/reddit-know/r/YouShouldKnow/comments/lszqse/ysk_that_living_with_toxic_people_affects_not.json": "Why YSK: If you're having acne, hairloss, eating disorders, migraines or you\nfeel something is wrong with your body despite being physically active, eating\nhealthy, meditating and just having overall good habits, check your environment,\nliving with toxic people will give you major health issues. It…",
  "data/reddit-know/r/YouShouldKnow/comments/lszy6n/ysk_if_someone_comes_out_to_you_saying_they_have.json": "Why YSK: They told you because they trust you and it wasn't an easy thing to do\nfor them. You shouldn't act like they don't have anything but treat them\ndifferently when they actually need it, not all the time. What they need is\nreassurance.\n\nEdit: sorry for the title",
  "data/reddit-know/r/YouShouldKnow/comments/lt6btc/ysk_you_might_not_actually_hate_vegetables_you.json": "Why YSK: Many people don't know how to properly cook vegetables outside of\nsteaming them, or adding a little salt/butter/oil, etc. Steaming is easy to\noverdo and works best with fresh seasonal vegetables.\n\nAnything that is frozen, canned, or even just spent more than a few days on the\nshelf will…",
  "data/reddit-know/r/YouShouldKnow/comments/ltf28u/ysk_if_you_received_boosted_unemployment_checks.json": "Why YSK: It's not fun to find out, but you will have until April 15th to pay the\namount due so its far better to have 6+ weeks to save up rather than find out\nthat refund you were expecting is actually a hidden $1k+ expense. You don't have\nto file right away, but you should definitely at least use…",
  "data/reddit-know/r/YouShouldKnow/comments/ltnyy5/ysk_what_people_make_an_effort_to_apologize_about.json": "Why YSK: By paying attention to what people apologize to us for, we can get to\nknow them better, learn their pet peeves, what they value most and what they are\nmost sensitive to. This is especially true for things that don’t seem like a big\ndeal to most people, and even more true if that other…",
  "data/reddit-know/r/YouShouldKnow/comments/ltxls0/ysk_that_after_easter_animal_shelters_are_often.json": "Why YSK: Easter is coming up, and a bunny is a common gift. If you are planning\nto give someone a bunny, please make sure they're prepared to care for it. Being\nforced to give the bunny to a shelter will spoil the gift.\n\nBunnies live for 8-12 years, so they're a long term commitment. They…",
  "data/reddit-know/r/YouShouldKnow/comments/ltysr0/ysk_make_sure_to_take_pictures_when_you_move_into.json": "Why YSK: The owner or the person in charge of rent might try to screw you over,\nby having you fix things or making it difficult for you to move out that were\nalready messed up when you moved in. So having evidence can help you.",
  "data/reddit-know/r/YouShouldKnow/comments/lu2jcq/ysk_there_is_a_text_based_phishing_campaign_to.json": "Why YSK: There is currently text bot sending very convincing texts claiming to\nbe Venmo's fraud service. They ask you to follow a link that looks like it's\nVenmo's and sign in. The link uses \"venmo\" as its third level domain so it\nappears legit, but the second level domain is something else meaning…"
}