{
  "data/reddit-projects/r/SideProject/comments/pz354b/from_delusions_of_grandeur_to_a_simple_mvp_my.json": "Today I finally launched my first mobile app, Cinevite\n[https://www.cinevite.com?utm_source=reddit&utm_medium=web]. Cinevite is a\nsimple app that lets you create event cards for movies and shows that can easily\nbe shared on social. The idea is simple but it sure didn't start that way. Like\nthe…",
  "data/reddit-projects/r/SideProject/comments/pz80ls/how_to_make_an_ondemand_grocery_delivery_app_a.json": "Hi there folks!\n\nI wrote an in-depth guide for product managers and serial entrepreneurs. It's\nabout developing a grocery delivery app. There you will find:\n\n 1. Why is now the most relevant time to develop a food delivery app?\n\n 2. what does the cost of developing a food delivery app depend on?\n\n…",
  "data/reddit-projects/r/SideProject/comments/pzlvrh/anyone_self_taught_successfully_turn_a_side.json": "Hoping to hear some insight about peoples experience with CS/coding and how they\ngot to the point where they have the expertise to create such cool projects\n(sorry if this isn't an appropriate type of post for this sub). I browse posts\non here regularly and am always blown away by what you people…",
  "data/reddit-projects/r/SideProject/comments/q00wa0/bot_to_do_reverse_image_search_of_tweeted_images.json": "I've made a Twitter Bot that can do reverse image search of Tweeted Images.\n@SearchThisImage [https://www.twitter.com/searchthisimage]. You can reply to any\ntweet that contains an image by mentioning the Bot. It will search for the image\nin Google and reply to your tweet with the first URL returned.…",
  "data/reddit-projects/r/SideProject/comments/q0i3vu/how_to_increase_your_local_audience_reach_in_less.json": "Hey there r/SideProject [/r/SideProject]\n\nEvery now and then I do a full-on guide for small businesses on matters relating\nto SEO and Digital Marketing. This one is going to be a bit long but trust me\nwhen I say that you can tackle the majority of the points I am going to discuss\nwithin a day. I…",
  "data/reddit-projects/r/SideProject/comments/q0ja0d/do_you_have_any_questions_about_selling_a_micro.json": "Hey r/SideProject [/r/SideProject]\n\nMonth ago I sold my micro SaaS business I was working on for the last 5 years\nvia MicroAcquire. Now I'm writing an article about selling it.\n\nDo you have any specific questions about selling micro SaaS? Thanks 🙌",
  "data/reddit-projects/r/SideProject/comments/q0mtje/easily_post_youtube_videos_to_instagram.json": "Hello guys,\n\nI have developed a little MVP that allows you to easily post YouTube videos to\nInstagram.\n\nIt's called YT2IG.com [https://www.yt2ig.com/]\n\nYT2IG.com - Post YouTube videos to…",
  "data/reddit-projects/r/SideProject/comments/q113kc/an_app_that_converts_sql_database_file_into_a.json": "Hello, I just launched APIArtisan.com [https://APIArtisan.com], it's an app that\ncan instantly convert a Database Structure into a working, ready-to-deploy\nLaravel API Application.\n\nThis way, anyone can build a full application without worrying about the backend\nside and only focus on the frontend…",
  "data/reddit-projects/r/SideProject/comments/q1u8eg/camping_culture_in_india.json": "Hey guys, two of my friends and I are hardcore camping enthusiasts. We have been\nresearching on a concept for Ecotourism and decided to promote the amazing\ncamping culture in India as a part of our College Project. I have created a\nsurvey to better understand our interests in camping adventures.\n\nIf…",
  "data/reddit-projects/r/SideProject/comments/q2l7cp/ive_released_calmbridge_a_place_that_helps_with.json": "Welcome to CalmBridge [https://calmbridge.com/] - a safe and anonymous community\nto deal with stress, anxiety, and depression.\n\nThe idea for CalmBridge [https://calmbridge.com/] started to grow in me in 2013\nwhen I had a massive depression caused by long-term stress and anxiety. It was a\ndark time…",
  "data/reddit-projects/r/SideProject/comments/q35dh6/how_to_develop_a_fintech_app_in_2021_a_guide_to.json": "Hi folks!\n\nI wrote another in-depth guide for an investor, a tech executive, and a product\nmanager. It's about building a fintech app. You will find there:\n\n 1. Steps in creating your FinTech app\n\n 2. What are  the  costs involved in developing a FinTech app\n\n 3. Why now is a good time to develop…",
  "data/reddit-projects/r/SideProject/comments/q36vv4/ive_just_released_redactphoto_a_free_web_app_to.json": "Redact.photo [https://Redact.photo] is a site where you can quickly\nredact/censor images in your browser. All editing happens in the browser so\nnothing is sent to the server, this means editing is 100% private which I think\nis important when redacting sensitive information.\n\nEnjoy!",
  "data/reddit-projects/r/SideProject/comments/q374bf/just_finished_the_mvp_of_kiroo_its_a_decision_log.json": "Hi everyone. I just finished the MVP (https://kiroo.herokuapp.com/landing/) of\nmy little side project that I use to log and track my decisions on a daily\nbasis. The main idea is to log your choices and be able to go back and see how\nhappy were you with your decision at any time. You can also add…",
  "data/reddit-projects/r/SideProject/comments/q3mdy8/made_a_database_of_top_startup_opportunities.json": "I wanted to make it easier for anyone to find top startups. So I built a\ndatabase of startups and jobs [https://topstartups.io/?utm_source=reddit]\nexclusively backed by top investors.\n\nSome context: I've always found researching startups to be a real pain, bouncing\nbetween LinkedIn, Crunchbase,…",
  "data/reddit-projects/r/SideProject/comments/q3rnfj/ive_launched_pigeonmail_to_help_you_send_hundreds.json": "Personalised email outreach is a core part of any marketing/growth\nprofessional's job.\n\nWhile email marketing tools such as Mailchimp, SendInBlue are great to send\nMarketing Campaigns to thousands of recipients, sending personalised emails have\na different impact on end users.\n\nIf you're looking to…",
  "data/reddit-projects/r/SideProject/comments/q3ux3i/a_tool_to_help_software_engineers_better_manage.json": "https://preview.redd.it/e7yjvutxc7s71.png?width=872&format=png&auto=webp&s=c5d6318a51583fc421b14b56383f8e8b86aa5254\n\nHello!\n\nWe are happy to announce the launch of Caribou, a tool to help software\nengineers manage technical debt! The product is currently in beta, available for\nfree and we’re looking…",
  "data/reddit-projects/r/SideProject/comments/q40lgf/i_created_a_concept_app_merging_productivity_with.json": "Hi there! I'm the creator of ThinkFit (https://www.thinkfit.app/), the\nlast-minute solution for getting things done, instilling healthy habits,\nfighting sedentary behaviour and keeping energy levels up the entire day!\n(bold.... ;-)\n\nRecently I added the gamification feature so Users can move more…",
  "data/reddit-projects/r/SideProject/comments/q422zw/requestflow_rest_testing_for_human_beings.json": "https://www.producthunt.com/posts/requestflow\n\nhttps://preview.redd.it/v3lunatnd9s71.png?width=1637&format=png&auto=webp&s=f305fff489371dac7a4b7596d9b3f1a4c289ed4e\n\nhttps://preview.redd.it/1udfvatnd9s71.png?width=1637&format=png&auto=webp&s=d58fc4b25c2663543a2c20f4cb97c6f963b7856a\n\nhttps://preview.…",
  "data/reddit-projects/r/SideProject/comments/q53lu1/tabworkx_keep_browser_tabs_overload_at_bay.json": "I’ve finally gotten the MVP for my side project ready...it's a chrome extension\nthat helps you organize and switch context between windows of tabs. It's up on\nthe Chrome store.\n\nWatch the demo or Down load the MVP here: www.tabworkx.com\n[http://www.tabworkx.com/]\n\nTabWorkx is “git checkout” for your…",
  "data/reddit-projects/r/SideProject/comments/q5db2l/how_do_you_find_a_sponsorsad_providers_for_email.json": "I'm making a newsletter in the travel related industry and I was wondering how I\ngo about finding sponsors or ad providers?\n\nAre there sponsors and ad providers that deal with just email newsletters?\n\nShould I grow my subscriber count before even considering sponsors? Or can I set\none up early and…",
  "data/reddit-projects/r/SideProject/comments/q5gumq/a_marketplace_to_find_projects_to_buy_and_invest.json": "Heyo!\n\nMy name is Arvind, I'm an indie hacker and maker of this app I've been working\nway too hard on my side projects and few of them actually worked. While building\nthe projects, I realised that if I could get some support from the community, I\ncan bring many more ideas to life and earn some…",
  "data/reddit-projects/r/SideProject/comments/q5l7sn/the_biggest_mistake_that_new_entrepreneurs_make.json": "I'm making a podcast that finds product ideas by doing interviews with people,\npeople who could become your customers, about what delights and pains them about\ndifferent problem areas.\n\nWant free insights into your target customers? Comment suggestions for problem\nareas and I'll do my best to make…",
  "data/reddit-projects/r/SideProject/comments/q5qq89/built_a_hub_for_learning_any_hobbyfast_free_and.json": "Hey all, I'm Vibh a no-code developer and marketer. I've built Hobbitual\n(hobbitual.softr.app [https://hobbitual.softr.app]) —ultimate hub for learning\nhobby.\n\nJust launched an MVP version of Hobbitual. Find and learn any hobby—free, fast,\nand easy.\n\nUltimate hobby learning hub designed and curated…",
  "data/reddit-projects/r/SideProject/comments/q61aku/automatic_manga_and_comic_translation_from_any.json": "What's up, a few weeks ago I created an open-source prototype to translate manga\nand comic image text, only using free resources... since that, I recreated\neverything using paid resources (better results) and this is the first result I\ngot, from left to right: original image in Korean, human…",
  "data/reddit-projects/r/SideProject/comments/q64gp2/3d_body_scanning_app_create_your_3d_avatar_dress.json": "Hi everyone! I'm working on in3D [https://in3d.io/] project. With our app\n[https://apple.co/3m0Oep0], anyone can create their realistic 3D avatar with\njust a phone camera spending no more than 30 seconds. Once scanned, users can\nanimate their avatars, make funny videos in AR, try on cool digital…",
  "data/reddit-projects/r/SideProject/comments/q65fc7/botmenot_testing_websites_bot_protection.json": "Hello, r/SideProject [/r/SideProject]\n\nI've (relatively) recently started working on BotMeNot [https://botmenot.com/],\na service that runs tests on a chosen website and lets you know how protected it\nis against (malicious) bot activity. Some of the potential negative outcomes of\nbots crawling a…",
  "data/reddit-projects/r/SideProject/comments/q67w4u/pay_attention_to_you_competitors_design.json": "Hey everyone I would like to share a project I have been working uxanalytic.com.\nIt’s a tool for getting an overview of the major websites/app layouts.\n\nWe have broken down digital products into pattern components so that you do have\na micro-level view of the building blocks that shape our favorite…",
  "data/reddit-projects/r/SideProject/comments/q6fle4/foodswipr_a_fun_way_to_look_for_food_around_you.json": "Hey everybody!\n\nI made FoodSwipr, an app that shows you restaurants in your area, one at a time.\nYou can swipe through restaurants with ratings, price points, and pictures from\nYelp for a fun way to decide what to eat. There are inclusive dietary filters,\nplaces filters, as well as looking for a…",
  "data/reddit-projects/r/SideProject/comments/q6ftaz/as_a_19_year_old_idk_if_i_am_doing_this_side.json": "Hello fellow ambitious folks,\n\nFirst time posting on Reddit, so this is a little scary. Here I go, I am a\n19-year-old university student that has been working on a side project idea over\nthe summer: students do cheap labor in their fields/major for experience.\nBusinesses/students can use this labor…",
  "data/reddit-projects/r/SideProject/comments/q6i562/150_illustrations_in_4_different_styles.json": "I just came across this cool project from DotYeti:\nhttps://www.dotyeti.com/illustration-library/\n\nThis multi-purpose illustration library is 100% for free. Every illustration is\navailable in the following styles: outline, base, flat & gradient.\n\nAvailable in PNG & .AI format.\n\nIt's a great addition…",
  "data/reddit-projects/r/SideProject/comments/q6lgxz/communityvalidated_discover_validated_product.json": "Hey all,\n\n\n\nSome weeks ago I launched my free newsletter\n[https://communityvalidated.substack.com/] and wanted to share it with all of\nyou. In the weekly newsletter, I share validated product ideas that I found\nthrough community research.\n\n\n\nI spend hours each week in online communities and identify…",
  "data/reddit-projects/r/SideProject/comments/q6r2t1/thread_stitcher_read_twitter_threads_without_the.json": "Hey builders,\n\nI'm currently building https://threadstitcher.com in public (you can see\nprogress updates here: (https://twitter.com/ThreadStitcher) as I wanted a way to\nsave threads and export that data to other platforms such as medium and notion.\nI'm building this because Twitter has a limited way…",
  "data/reddit-projects/r/SideProject/comments/q73jwy/domain_purchase_to_code_complete_in_one_weekend.json": "Read the dev notes [https://spreadsheettimeline.com/dev_notes/], or just try out\nthe app [https://spreadsheettimeline.com]!\n\nTL/DR:\n\n * No database or server-side code. All static files.\n * Actually, just two files total :)",
  "data/reddit-projects/r/SideProject/comments/q77imt/get_your_side_project_built_for_you_for_free.json": "We’re entering the alpha stage of our no-code app builder\nhttps://www.railsrocket.app/ and we’re looking for apps to build on it to put it\nthrough its paces.\n\nWe’re looking for smallish web apps where you have a clear idea of what you want\n(ideally some mockups or designs) and ideally want it built…",
  "data/reddit-projects/r/SideProject/comments/q77s2s/productivity_tool_for_freelancers_and_small.json": "It’s nice to meet you\n\nI've just joined this subreddit, and I'm thrilled to see so many people having\ngreat ideas and actually doing something about them.\n\nI'm a programmer having my own small software company. A few years ago, I had\nsome issues with my time: I was working all day long, but at the…",
  "data/reddit-projects/r/SideProject/comments/q7etiz/nextjs_and_supabase_saas_starter_kit.json": "Over the past 2 years I built (and mostly failed) a couple of SaaS projects. I\nreally like creating cool side projects, but I end up having to write a lot of\nboilerplate code each time I start a new project - every project requires\nauthentication, login, registration, billing etc. Sometimes I lost…",
  "data/reddit-projects/r/SideProject/comments/q7lkth/made_ease_attendance_a_free_attendance_tracker.json": "Hey,\n\nI have been working on Ease Attendance [https://www.easeattendance.com/] for a\nwhile now (Started March 2021), and have grown to a user base of over 1500\nteachers. The idea of this project came to me when I saw that my teachers would\nspend the first 5-10 minutes taking attendance and waiting…",
  "data/reddit-projects/r/SideProject/comments/q7or35/check_out_createmyresumeio_today.json": "CreateMyResume.io [http://createmyresume.io/] aids job prospects in every aspect\nof the application process. Our easy to use resume and cover letter formatter\nallows even the least tech savvy applicant to create a resume that stands out\nfrom the pack. But where we truly differentiate ourselves from…",
  "data/reddit-projects/r/SideProject/comments/q7xo3z/3d_body_scanning_app_create_your_3d_avatar_dress.json": "Hi everyone! I'm working on in3D project. With our app, anyone can create their\nrealistic 3D avatar with just a phone camera spending no more than 30 seconds.\nOnce scanned, users can animate their avatars, make funny videos in AR, try on\ncool digital looks and play as themselves in GTA V, Second…",
  "data/reddit-projects/r/SideProject/comments/q7zlaj/im_building_a_chrome_extension_that_finds_out.json": "Hey there, the names Jojo Duke.\n\nSo basically, as a web developer, anytime I'd surf the web, go to a website,\nproduct landing page, or the like I always realized that most websites use the\nmost beautiful and unique fonts for their web designs, and a lot of times I\nalways wondered what font/typeface…",
  "data/reddit-projects/r/SideProject/comments/q808rs/hi_i_recently_launched_pictapic_to_streamline.json": "Hi!\n\nI'm looking for some advice?:\n\n 1. What actions would you recommend as the next step?\n 2. Should I look for a co-founder with marketing knowledge?\n 3. Does it even make sense to apply to accelerator/incubators at this point?\n\nSome Intro: I do technology and my passion is entrepreneurship, I…",
  "data/reddit-projects/r/SideProject/comments/q81ypq/10000_clear_jars_must_sell_asap.json": "Reddit, do your thing:\n\nBecause of a failed production run, I now have 10,000 transparent jars (with\nmatching caps and airtight heat-induction seals) sitting in a warehouse. I'm\nlooking for someone who might be willing to take these jars off my hands.\nThey're incredible quality - made of 100%…",
  "data/reddit-projects/r/SideProject/comments/q8567z/tiny_acquisitions_devs_makers_sell_side_projects.json": "TinyAcquisitions.com [https://TinyAcquisitions.com] is a two sided marketplace\nthat allows makers & devs to sell their tiny project/ side projects for $10k or\nless. Several acquisitions have taken place so far, it is completely free to\nlist and we feature a few projects every week in our \"hand…",
  "data/reddit-projects/r/SideProject/comments/q868y8/3_min_design_tip_on_how_to_use_the_font_koho_for.json": "Hi everyone! I write a newsletter called FontDiscovery. Every week I create a\ndigestible visual guide about a new font with examples and case studies to help\nfounders, creators, and makers step - up their creativity and marketing game.\nThis week, I covered Koho, a font perfect for attention-grabbing…",
  "data/reddit-projects/r/SideProject/comments/q8kbyk/my_friend_and_i_have_made_a_tweet_generator_that.json": "Hey there Redditors!\n\nI am excited to share with you a project that was super fun to build - TweetyAI.\nTweetyAI uses prediction algorithms to generate (believable) tweets based on\nyour past Twitter activity. All you have to do is write down your (or any other)\nTwitter username and generate a tweet…",
  "data/reddit-projects/r/SideProject/comments/q8nunm/built_a_simple_website_to_show_live_bullion_rates.json": "Hi all,\n\nI made this simple website to show live bullion rates in multiple currencies and\nweights.\n\nPlease do check it out and provide feedback.\n\nhttps://livebullionrates.com",
  "data/reddit-projects/r/SideProject/comments/q8q4lo/i_made_a_website_to_capture_screenshots_of_tweets.json": "Hi Everyone,\n\nI made the website https://sketchpilot.com/ to capture screenshots of tweets\nwithout having to login to twitter. It has the ability to show/hide retweets,\nreplies and likes count. Timestamp of the tweet can also be shown or hidden.\n\nI would love your feedback and thoughts :)",
  "data/reddit-projects/r/SideProject/comments/q8qx6k/unshortitcom_is_online.json": "Hello r/SideProject [/r/SideProject]!\n\nThis is https://unshortit.com/, my side project.\n\nI get a lot of mails with short links and can't tell if the links are good or\nnot. So with this site I can see the preview of the remote connection without\nbrowsing. Sounds cool!\n\nThis also allowed me to delve…",
  "data/reddit-projects/r/SideProject/comments/q8x209/its_been_a_very_long_time_since_i_launched.json": "People normally say: just ship it. No matter how small.\n\nSo I did.\n\nMaybe it couldn't even be considered a side-project. Maybe a\ntiny-little-micro-side-project.\n\nBut it solves my problem of having to cmd + click to open Wikipedia external\nlinks in a new tab, every single…",
  "data/reddit-projects/r/SideProject/comments/q9bxsu/developers_vs_marketing.json": "Hello r/SideProject [/r/SideProject] !\n\nI've recently created Developers vs. Marketing - a marketing coaching dedicated\nto programmers.\n\nI am a marketer of 14 years that for 7 years have also been working as a\nfull-stack developer.\n\nI've noticed over the years that many developers are struggling…",
  "data/reddit-projects/r/SideProject/comments/q9f781/i_made_noted_a_realtime_notetaking_app_with.json": "Noted is a Nuxt 2 app for note-taking in markdown format with syntax\nhighlighting. It works offline and keeps data on-device. I attempted to use\nneumorphism design and do all the styles by hand.\n\nYou can try it out at noted.yeger.eu [https://noted.yeger.eu] or check the\nsource code at…",
  "data/reddit-projects/r/SideProject/comments/q9t4d2/i_made_a_twitter_bot_to_save_tweets_to_notion.json": "Btw: it is live on PH https://www.producthunt.com/posts/slideit\n\n\n\nhttps://preview.redd.it/f6nivltfdyt71.png?width=800&format=png&auto=webp&s=47efd33009e07e835120316e074cb8deac4fe1b5",
  "data/reddit-projects/r/SideProject/comments/q9w02y/i_made_an_app_that_suggests_which_side_project_to.json": "hey guys!\n\nYesterday I built an app that suggests you which side project you can build.\n\nThe idea came from analysis of side projects launched on PH/HN. I noticed that\nmost of the projects have similar patterns in their positioning/angle. That's\nwhy I decided to try and 'generalise' the idea behind…",
  "data/reddit-projects/r/SideProject/comments/q9zb7r/simple_molarity_calculator_find_and_record_your.json": "Hello r/SideProject [/r/SideProject] !We are excited to introduce our novel\nmolarity calculator!\n\nAs a researcher, we dissolve various chemical drugs for in vitro and in vivo\nexperiments.However, searching molecular weight every time and remembering how\nmuch drug was dissolved last time is highly…",
  "data/reddit-projects/r/SideProject/comments/qagmkv/me_and_my_friend_created_a_peertopeer_file.json": "Demo Video [https://reddit.com/link/qagmkv/video/juaib3kkf5u71/player]\n\nSo, we have been working on this peer to peer webRTC based file sharing website\nfor the past few months (super slowly) and finally after a lot of research into\nwebRTC and trial and testing we finally have a product that we can…",
  "data/reddit-projects/r/SideProject/comments/qahu2e/coworking_discord_channel.json": "I have created this Discord channel so if you're working alone at home, you can\njoin to work alongside other people (soon to be friends).\n\nMy Channel has:\n\n 1. A lounge for talking and helping each other out\n 2. A voice channel to hang out while working on your projects\n 3. An individual space for…",
  "data/reddit-projects/r/SideProject/comments/qaj2r8/succeedsmart_connecting_corporations_with_the.json": "SucceedSmart [https://www.facebook.com/SucceedSmartUS/] revolutionizes the\ntraditional executive search industry, restoring control of the process back to\ncorporations and executives. With AI-powered solutions, including rich\nalgorithms and proprietary matchmaking processes, SucceedSmart is poised…",
  "data/reddit-projects/r/SideProject/comments/qakwo4/made_a_telegram_bot_that_lets_you_set_price.json": "Link to the bot: https://telegram.me/PriceA1ertBot\n\nA Telegram chatbot that helps you set price alerts for amazon products. The bot\nchecks the price of your watchlisted products every hour and sends you an alert\nmessage when it reaches the target price. It is developed using the\npyTelegramBotAPI…",
  "data/reddit-projects/r/SideProject/comments/qamvkp/i_made_a_low_code_landing_page_builder_available.json": "PageSandbox - Low code landing page builder.\n\nNPM : https://www.npmjs.com/package/pagesandbox-cli\n\nMainly used Vue and Vuetify.\n\nFor now, It provides only one template. I have recreated the demo version of the\nVuetify Theme - Zero as template on which you can make changes. I plan to add\nmore…",
  "data/reddit-projects/r/SideProject/comments/qan3d9/how_to_value_your_saas_startup.json": "HOW TO VALUE YOUR SAAS STARTUP\n\nCalculating a private SaaS company’s valuation can be tricky, but one formula\nusing just four metrics can help you estimate the value of your SaaS business.\n\nTools like profit and revenue multiples can be useful to estimate valuations of\nprivate companies – most SaaS…",
  "data/reddit-projects/r/SideProject/comments/qaodfa/say_hello_again_to_my_nocode_website_builder.json": "Launchweb [https://launchweb.me] is a very easy to use no-code website builder.\nI created this keeping an average internet user in mind. You need ZERO coding or\ndesign knowledge to create and launch your websites on Launchweb.\n\nHow is Launchweb different from other website builders?\nTraditional…",
  "data/reddit-projects/r/SideProject/comments/qar7n4/appwrite_announces_version_011_of_its_opensource.json": "Hey, this is Aditya, I'm a maintainer at Appwrite, an open-source Firebase\nreplacement, and I’m extremely happy to share that Appwrite 0.11 has just been\nreleased with some interesting features, new SDKs and new and updated Cloud\nFunctions!\n\nThis release was also one where our open source…",
  "data/reddit-projects/r/SideProject/comments/qaubbk/i_found_three_useful_resources_maybe_they_could.json": "Hi everyone! I write a newsletter called Indiegrow where I send subscribers\nthree tweets to comment daily so we can grow on Twitter together. On the last\nissue, I shared some startup resources with my subscribers. thought I can also\nshare here in case it is helpful.\n\n\nMAP OF…",
  "data/reddit-projects/r/SideProject/comments/qawe9m/feedback_please_created_a_new_board_to_promote.json": "what do you guys think, would this be useful to you?\n\n———\n\nflyrboard.com [http://flyrboard.com/] a promotional platform that lets you\npromote at the national level or at a local level like your home town and state.\nYou can promote almost anything, your side project, a new feature in an…",
  "data/reddit-projects/r/SideProject/comments/qb73ld/10_landing_page_tips_to_increase_your_conversion.json": "I will share with you 10 hands-on tips for your (SaaS) landing page:\n\n#1 Have a sticky CTA in the menu\n\n#2 Have CTA Button in every section\n\n#3 Powerful CTA\n\n#3 Social proof section\n\n#4 Headline matters (aim for 6 words headlines)\n\n#5 Conversational tone\n\n#6 Keep the copy short and easy to…",
  "data/reddit-projects/r/SideProject/comments/qb7jwf/game_improve_your_own_stock_trading_intuition.json": "Howdy folks!\n\nI've recently published this game to the app stores. Curious to know your\nopinion. The main games' objective is to improve stocks and crypto trading\nintuition for amateurs. It's originally designed for people to overcome some\nhesitation or even fear to start trading with real…",
  "data/reddit-projects/r/SideProject/comments/qbpvx8/the_worlds_fastest_startups_are_working_on_just.json": "We're talking Loom, Canva, Figma, Uber and more\n\nForget Ads, CPC, LTV or any of that jargon.\n\nThe most important key metric is TTV\n\nLet's dig into this.\n\n\n\n1) Time to value. i.e, the time from when a customer invests into your product\n\"by signing up\" to the time they get the outcome (their pain…",
  "data/reddit-projects/r/SideProject/comments/qbwrr7/are_you_currently_fundraising_for_your_tech.json": "If you're a first-time early-stage founder, you can probably relate to the fact\nthat fundraising for your startup is one of the hardest things to do. Especially\nif you lack the relevant network and industry know-how. As ex-entrepreneurs and\ninvestors ourselves, we noticed a need to address this gap…",
  "data/reddit-projects/r/SideProject/comments/qcg7vu/a_tool_to_check_the_traffic_of_any_website_and.json": "Hey Reddit,\n\nI've been working on a personal project of mine for about 3 weeks now and I'd\nlike to show you guys/get your opinions on it. The site is live on\nwww.zavixs.com [https://www.zavixs.com]\n\nWhat is Zavixs?\n\nZavixs is a free tool that analyzes any website and displays data in a\nmeaningful…",
  "data/reddit-projects/r/SideProject/comments/qchu08/finished_working_on_my_project_would_love_some.json": "Synko: sync application configurations and settings file across multiple devices\n\nFeatures:\n\n * Sync application settings and configuration files across multiple devices\n   (Linux and macos)\n * User gets the freedom to add path to the configuration and setting files.\n * Freedom to sync specific set…",
  "data/reddit-projects/r/SideProject/comments/qcmwod/need_a_website_for_your_idea_ill_design_and.json": "Hello founders, entrepreneurs, investors, dreamers, doers\n\nI am writing this post to offer my services to anyone who is ready to launch\ntheir product and needs a website to do so.\n\nI am currently in the process of setting up my own website development service\nfor startups ( foamy.cool…",
  "data/reddit-projects/r/SideProject/comments/qcomib/project_collaboration_possibility.json": "Does our subreddit 'SideProject' also allow people to collaborate and build\nprojects?\n\nCan someone guide me around the process on how to collaborate with people on\nReddit for potential side projects?",
  "data/reddit-projects/r/SideProject/comments/qd0ksk/sharing_an_evergreen_font_i_use_for_multilingual.json": "Hi everyone! I write a newsletter called FontDiscovery. Every week I create a\ndigestible visual guide about a new font with examples and case studies to help\nfounders, creators, and makers step - up their creativity and marketing game.\nThis week, I covered Noto, a great open-sourced font with a…",
  "data/reddit-projects/r/SideProject/comments/qd92mz/lowcost_brain_computer_interface_for_everyday_use.json": "I spent 2 years, but finally paper with explanation was published.\n\nHere we describe a compact, low-cost EEG device suitable for daily use. The data\nare transferred from the device to a personal server using the TCP-IP protocol,\nallowing for wireless operation and a decent range of motion for the…",
  "data/reddit-projects/r/SideProject/comments/qdari1/a_news_aggregator_to_mitigate_against_journalism.json": "The motivation:\n\n- I don’t like journalism bias, each media would often report events from their\nown interest & profit.\n\n- Giant news media monopolies would easily control how an event is being\nreported, I would like to hear the voices from smaller/independent journalistic\nplatforms.\n\n- I would like…",
  "data/reddit-projects/r/SideProject/comments/qdd3gd/letting_users_pay_and_withdraw_money.json": "For the sake of this example, imagine I am creating a website where users can\npay money to participate in a competition. If they win, they will receive some\nmoney. Now, if a user wants to withdraw their money, what's the best way to\nimplement this?\n\nUsing Stripe it's easy for a user to pay, but for…",
  "data/reddit-projects/r/SideProject/comments/qdekjf/fullstack_monitoring_downtime_prevention_solution.json": "Hello guys!\n\nWorking with an already happened issue isn’t an option anymore. That's why\norganizations need an all-in-one solution to predict downtimes and monitor IT\necosystems.\n\nWe recently launched our full-stack monitoring solution - InsightCat. It aims to\nobtain observability, predict downtimes…",
  "data/reddit-projects/r/SideProject/comments/qdg8ft/free_sustainable_web_design_checklist_english.json": "For everyone interested in making their website more sustainable/environmentally\nfriendly, then I have made a FREE sustainable web design checklist you can use\nto ensure a certain standard.\n\nhttps://sustainablewww.org/sustainable-web-design-checklist",
  "data/reddit-projects/r/SideProject/comments/qdk2kx/looking_for_testers_for_habits_introducing_app.json": "Hey guys!\n\nWho strives to read more or wants to build the \"reading habit\"?\n\nWe've launched an app Practiqa that helps you to integrate new habits and I want\nto offer you to try it out and build your habit for free :)\n\nPractiqa is based on behavioral science, it works like a habit coach who helps\nyou…",
  "data/reddit-projects/r/SideProject/comments/qdkqz9/a_collection_of_wfh_desk_setups.json": "When the pandemic started more and more people began sharing their workspaces on\ntwitter. I became obsessed with these spaces and set out to find as many as\npossible.\n\nSince then I have curated ~100 spaces from amazing creators with many more in\nthe queue. The list has also grown to 2,500+…",
  "data/reddit-projects/r/SideProject/comments/qdq2mm/the_results_of_six_months_of_work_on_my_side.json": "I haven't worked on a project in the last three months, and here are the results\nof all time.\n\n– 1384 views on Gumroad\n– 384 downloads on Gumroad\n– 8 reviews on Gumroad\n– Earned $122 on Gumroad\n– 16 followers on IH\n– 15 followers on Twitter\n– 32 subscribers on Launchoice.com…",
  "data/reddit-projects/r/SideProject/comments/qdq879/anki_flashcards_generator_for_leetcode.json": "A while ago I decided to automate my leetcoding process. I've been doing it\nquite a lot, and by now I have almost 800 problems solved.\n\nI've already been using Anki (a tool for spaced repetition of flashcards), so\nthe solution was quite obvious: create Anki cards for all leetcode questions and\nuse…",
  "data/reddit-projects/r/SideProject/comments/qdu1hi/personal_project_to_find_cheap_europe_trip_flights.json": "Try it out:\n\ntriptumbler.com [https://triptumbler.com]\n\nWhy is planning a multi-city European vacation so annoying?\n\nI've done a lot of traveling in Europe and (cliché) it's really close to my\nheart. I routinely encourage my friends and family to go there - due to the ease\nof travel and points of…",
  "data/reddit-projects/r/SideProject/comments/qe4mrz/we_went_into_a_crowded_market_and_got_to_9000.json": "Hey Guys 👋\n\nAnan here, Founder & CEO of Listnr Tech (https://www.listnr.tech/) and Listnr FM\n(https://www.listnr.fm/) - we build SaaS tools to help users create Podcasts\neasily without spending a ton of cash and time.\n\nHere are my key learnings while launching Listnr 👇\n\n 1. Mistake - Launched too…",
  "data/reddit-projects/r/SideProject/comments/qe76t0/legitmailbox_an_affordable_email_verification_api.json": "Hi Everyone,\n\nRecently launched this small side project (commercial) :\nhttps://legitmailbox.com/ . It's an Email Verification API offered via RapidAPI\nto detect invalid emails in real-time. Can be used in SAAS products to prevent\nfake signups or detect misspelled user emails. Monthly reports are…",
  "data/reddit-projects/r/SideProject/comments/qeussu/a_command_line_utility_which_lets_you_navigate.json": "In general I find it annoying to cd and ls command multiple times so made a CLI\nwhich let's you navigate through terminal like a pro 😎.\n\ncheck it out: link [https://github.com/souvikinator/lsx]\n\nStill in development, more features will be introduced eventually.\n\nFeel free to give feedback. drop a…",
  "data/reddit-projects/r/SideProject/comments/qexp4q/launched_my_podcast_to_video_clips_ios_app_this.json": "Hi all,\n\nI'm excited to have released SocialWave\n[https://apps.apple.com/us/app/id1586634158] this week. It's an iOS app that\nlets you convert podcast audio clips to video.\n\nIt includes a story/post editor where you can add waveforms, progress bar/pie,\ntext, etc..\n\nI created a TestFlight using…",
  "data/reddit-projects/r/SideProject/comments/qfhqpi/ideasy_is_the_ai_search_engine_for_idea_research.json": "Hi everyone,\n\nOur product [https://www.idea-research.com/?ref=rsideproject] allows validating\nyour ideas with the extensive database and powerful analytics tools. Identify\nyour competitors' strengths and weaknesses and get a visual representation of\nthe market.\n\nAlso, you can easily integrate us via…",
  "data/reddit-projects/r/SideProject/comments/qfu56w/the_worst_house_on_the_internet.json": "Remember when you went trick-or-treating and there was always that one house on\nthe block that gave out the worst treats? Now everyone on the Internet can\nre-experience that same feeling of Halloween disappointment. You’re welcome!\n\nwww.theworsthouseontheinternet.com…",
  "data/reddit-projects/r/SideProject/comments/qg24c9/add_dark_mode_on_your_website_within_3_mins.json": "Heyy r/SideProject [/r/SideProject]!!\n\nMade a simple application to add dark mode on any website - https://darkmode.to/\n\nPlease let me know what you think.\n\n * Once you add your domain, it'll fetch all the colors from your website and\n   auto-generate the dark mode colors. You'll get a small snippet…",
  "data/reddit-projects/r/SideProject/comments/qg3nyq/made_a_website_listing_jobs_with_a_4_day_work_week.json": "I started building this at the start of the year and recently hit 50 tech\ncompanies which have a 4 day work week (i.e. 32 hours per week with no drop in\npay)\n\nJobs are updated daily:http://4dayweek.io/\n\nHope you like and all feedback welcome :)",
  "data/reddit-projects/r/SideProject/comments/qg4gol/looking_to_support_some_projects_that_have.json": "It’s a little difficult to sort projects people are working on vs ones that are\nready to be used by the public (even if some features are missing)\n\nI’m looking to sign up for some projects that are ready to be used (or almost\nready..) and could use a little motivation by having someone sign…",
  "data/reddit-projects/r/SideProject/comments/qgbype/made_an_nft_gallery_app_that_runs_seamlessly_on.json": "I've built an app [https://apps.apple.com/us/app/nft-art-gallery/id1585837631]\nfor NFT lovers to discover and browse artwork in one seamless experience on all\ntheir Apple devices from Watch to TV:\n\n * Explore top-selling and top-traded NFTs on OpenSea (more platforms to be\n   added soon)\n * Display…",
  "data/reddit-projects/r/SideProject/comments/qgcifx/i_created_a_tool_to_schedule_http_requests.json": "In my last project, I was struggling to create and monitor cron jobs.\n\nSo, instead of creating hundreds of standalone scrips and executing them with\ncron, I decided to turn those scripts into multiple endpoints. Next, I created a\nsingle service that I could schedule HTTP requests to those endpoints…",
  "data/reddit-projects/r/SideProject/comments/qgeugu/denigma_is_an_ai_that_reads_and_explains_code_in.json": "https://denigma.app\n[https://denigma.app/?fbclid=IwAR2J4tBQkKp9IS_JiWo4VTyj5gJMqOWbBKT6NQuLyGcm0s5zMcOthN8Bseg] is\nan AI that reads and explains code in understandable English and documents\ncodebases. In a few days, we're launching with:\n\n * A VS Code extension \n * The ability to explain files on…",
  "data/reddit-projects/r/SideProject/comments/qgf90g/a_personal_assistant_bot_in_telegram.json": "Hey guys,\n\nI'm developing a personal assistant bot for telegram. I just made version 0.1\npublic. If you want to give it a shot you can read more about it at\nhttps://ambrosio.nunodonato.com/ and see the current features it supports.\n\nMore on the way, and would love your feedback and suggestions on…",
  "data/reddit-projects/r/SideProject/comments/qgqqib/opensource_is_eating_the_world_exfirebase.json": "Appwrite started out as our side project over a year back and we're super\nthrilled on reaching this exciting milestone.\n\nAppwrite is an open-source, self-hosted alternative to Firebase that provides\ndevelopers with all the core APIs and services required to build any kind of\nmodern software no…",
  "data/reddit-projects/r/SideProject/comments/qgu9qa/one_shopping_cart_to_rule_them_all_access.json": "Universal shopping cart with one click checkout that lets users save for later,\nbuild lists, share and checkout easily. Built to combat cart abandonment and to\nmake consumers lives easier. Beta en route.\n\nFeedback needed and appreciated. Checkout the overview vid tis short :) and\nsign-up for early…",
  "data/reddit-projects/r/SideProject/comments/qgv0lh/how_we_made_it_to_4_product_of_the_day_on_product.json": "Hey!\n\nOn 15th October 2021 me and my friend launched on ProductHunt for the first\ntime. I decided to share an aftermath of BlogAudio [https://blogaudio.co/]’s\nlaunch. I really hope that some of you will find it helpful.\n\nIt’s a bit lengthy so feel free to skip to the part that you find…",
  "data/reddit-projects/r/SideProject/comments/qgwt9q/im_making_botmenot_a_tool_that_tests_websites_bot.json": "Hello, r/SideProject [/r/SideProject]\n\nAfter working on multiple eCommerce-related projects, I've now decided to\ndevelop BotMeNot [https://botmenot.com/] - a SaaS that tests websites' bot\nprotection levels.\n\nIt has been in the making for some time now, but there's still a couple of more\nthings that…",
  "data/reddit-projects/r/SideProject/comments/qh36ej/we_are_live_on_product_hunt_today_currently_in.json": "Hi everyone! After many cups of coffee and many more hours of hard work, my\nco-founder and I launched our free coding font tool! It is a fun mini tool to\nhelp select a font for your coding editor through an exciting tournament-style\ngame! ⚔️ (Squid Games, anyone?)\n\nWhy we did it\nWe are both…",
  "data/reddit-projects/r/SideProject/comments/qhlosl/my_notion_to_help_centerdocumentation_tool_just.json": "After almost two months since launching on Twitter, my SaaS HelpKit\n[https://www.helpkit.so/] just reached $100 MRR ($122 to be precise) which is a\nbig milestone for me a solo bootstrapped founder.\n\nThere are now 3 customers on the Premium Plan for $29/month and 2 customers on\nthe Essential Plan for…",
  "data/reddit-projects/r/SideProject/comments/qhpjau/how_to_launch_on_product_hunt_a_detailed_guide.json": "Product Hunt is probably the most knowledgeable and visited website in the\nstartup ecosystem. All founders, entrepreneurs, VC keep an eye on it to see what\nare the new trends. So, having a product that hits the top #5 of the day will\nbring you thousands of visits, some attention from all over the…",
  "data/reddit-projects/r/SideProject/comments/qi2jug/an_app_that_reveals_trends_for_every_city_in_the.json": "I spent years developing this huge app to reveal trends for every city in the\nworld, using data that's never been seen before.\n\nThe app is based on place geofences, which do not exist anywhere in the world,\nand are created within this app by the community.\n\nImagine hundreds of thousands of people…",
  "data/reddit-projects/r/SideProject/comments/qichs3/automatic_windows_configuration_with_ansible.json": "Hi!\n\nRecently I was migrating one of my home machines to the new Windows 11. In the\nprocess of reinstalling, I decided it was time to automate the configuration and\ncreated an ansible playbook that does most of the work of preparing the system\nfor software development.\n\nCurrent Capabilities:\n\n *…",
  "data/reddit-projects/r/SideProject/comments/qifpz7/3_years_making_and_i_have_finally_launched_a.json": "Hi there!\n\nDuring the last 3 years, on my free time, I have put a lot of effort into\nbuilding a personal finance app. Why? I did not like the ones that existed and\nalso, as a developer, I wanted to study some technologies. So, here it is:\nhttps://www.finansiapp.com\n\nA new personal finance, expense…",
  "data/reddit-projects/r/SideProject/comments/qinosz/im_launching_a_motivational_text_message_service.json": "Hi!\n\nI'm looking to build a variety of \"clubs\" that offer daily, handcrafted text\nmessages around a specific topic - this concept can apply to news, memes,\nadvice, facts, etc. Myself and a few partners are starting off with a Motivation\nClub, which offers daily motivational texts, which just…",
  "data/reddit-projects/r/SideProject/comments/qiq6ex/stock_trading_bots.json": "Here is a tool that allows you to build and test stock trading bots quickly. Has\na decent collection of examples and live community.\n\nhttp://breakingequity.com/",
  "data/reddit-projects/r/SideProject/comments/qizb45/backend_as_a_service.json": "I am trying to understand if it worthwhile to create another BaaS since there\nare at least 3 similar services: Parse, Firbase and AWS Amplify.\n\n 1. Did you try to use any of these BaaS?\n 2. What were the pain points? Installing cli, configuring?\n 3. Was it costly for you?\n 4. Which functionality was…",
  "data/reddit-projects/r/SideProject/comments/qj0a4y/my_first_project.json": "I have been doing my first project in my spare time for several months.\n\nMeet Snappy Form [https://snappy-form.com/], build beautiful online forms for\nfree. I will be glad to receive feedback and suggestions to make the platform\neven better.\n\n\nFEATURES\n\n * Integrations\n * Email notifications of new…",
  "data/reddit-projects/r/SideProject/comments/qj3wjs/get_notified_on_discord_when_your_blog_is.json": "I wanted to study Typescript so I wrote this quick side project that lets you\nsend Discord messages of Hacker News submissions that match your blog domain.\nThis can be handy to be notified when others submit some of your content to\nHacker News.\n\nhttps://github.com/louisguitton/hn-notifier\n\nIt's…",
  "data/reddit-projects/r/SideProject/comments/qjc5at/meet_4_slack.json": "Excited to share my first product, a powerful Google Meet <> Slack integration.\n\nSimply generate Google Meets by using /meet command in any DM, group or channel.\n\n🚀 Google Meet links will open with the correct Google Account (selected when\nfirst using the app). This means you no longer have to…",
  "data/reddit-projects/r/SideProject/comments/qjhqwi/during_my_last_summer_break_i_developed_realsteer.json": "https://youtu.be/QNfSx_NinQs",
  "data/reddit-projects/r/SideProject/comments/qjk3oy/p2p_file_sharing_utility.json": "I created https://dropall.stream/ as a universal simple p2p files sharing\nservice. Think something like airdrop but universal to any device.\n\nMy goal was to make a service where anyone could share a file in not more than 3\nclicks. There are no file limits, data is transferred from peer to peer…",
  "data/reddit-projects/r/SideProject/comments/qjodsc/api_creation_pricing.json": "Hi, I assume that a lot of you work with APIs for your side-projects.\n\nas freelancers that are asked to create an API for a client (or as a client\noffering a freelancer work)\n\nhow much do you think is fair to charge/pay for creating an API (Code is\nprovided by the requestor, the work is setting it…",
  "data/reddit-projects/r/SideProject/comments/qjublf/i_built_a_platform_allowing_businesses_and.json": "Hello there Reddit!\n\nI just wanted to share with you a product I've been working on for a while. The\nproduct is called GetMyMfa and is accessible at https://get.mymfa.io. The\nobjective of this project is to allow organizations to safely and easily share\nMulti-Factor Authentication codes for their…",
  "data/reddit-projects/r/SideProject/comments/qjwq0i/socialboat_no_code_platform_for_fitness_creators.json": "https://www.producthunt.com/posts/socialboat\n\nHi everyone!\n\nI wanted to share a product with the community that initially started as a side\nproject. Today we launched it on ProductHunt.\n\nSocialBoat is a no code platform for fitness creators that creates a full\ndigital suite for fitness…",
  "data/reddit-projects/r/SideProject/comments/qk00h9/how_i_made_a_wireless_fastchange_set_of.json": "https://reddit.com/link/qk00h9/video/703wicvi0vw71/player\n\nThe story of modern headphone reliability and convenience is a poem of two words\n– it sucks. Headphones wield quite the reputation for being not only rebels in\nthe behavior of their wire-attachments, but are also quite lousy as…"
}