{
  "data/reddit-crypto/r/CryptoCurrency/comments/rts1w2/got_compromised_and_lost_over_120k_in_crypto_ama.json": "<!-- SC_OFF --><div class=\"md\"><p>As I sit here on the first day of the new\nyear, writing this post, I think to myself how much can one human take before\nit&#39;s just too much? The world can just be an absolutely awful, awful\nplace.</p> <p>I read these &quot;stolen or hacked crypto&quot; posts all…",
  "data/reddit-crypto/r/CryptoCurrency/comments/ru0vww/some_just_drained_tinyman_of_its_gobtc_and_goeth.json": "<!-- SC_OFF --><div class=\"md\"><p>Someone had just found an exploit on\nAlgo&#39;s Tinyman liquidity pools for both goBTC and goETH. Some how they\nfigured it out and a bunch of projects have pulled their liquidity out to\nprotect it, Tinycharts for example, which I have stake in. </p>…",
  "data/reddit-crypto/r/CryptoCurrency/comments/rtomon/ethereums_gas_fees_are_a_problem_no_matter_what.json": "<!-- SC_OFF --><div class=\"md\"><p>Trust me, I’m an Ethereum fan more than\nanyone. But what I hate is that people aren’t ready to hear hate about their\nfavorite crypto.</p> <p>Even at a low of $5 right now. Ethereum’s fees are way\ntoo high than it should be - like Vitalik once said “the internet of…",
  "data/reddit-crypto/r/CryptoCurrency/comments/rtwdh7/i_didnt_realize_that_you_have_to_pay_tax_on_every.json": "<!-- SC_OFF --><div class=\"md\"><p>Before you read: Every transaction was made\nwith usdt and other coins. I basically only payed out fiat once. About 3 months\nago i got into crypto and turned 7k into 11k with a lot of transactions. I then\nput that money in my bank account and wanted to pay the tax…",
  "data/reddit-crypto/r/CryptoCurrency/comments/rtvy02/the_crypto_market_might_be_making_things.json": "<!-- SC_OFF --><div class=\"md\"><p>It&#39;s hard. Red day after day, small gain,\nthen large drop, small recovery, then another drop. I understand. We here are\nall experiencing it together. </p> <p>But remember, this sub is an echochamber\nthat makes crypto appear that adoption is almost ubiquitous.…",
  "data/reddit-crypto/r/CryptoCurrency/comments/rtonm1/cosmos_why_you_should_research_the_ecosystem.json": "<!-- SC_OFF --><div class=\"md\"><p><a\nhref=\"https://cosmos.network/gravity-dex/\">https://cosmos.network/gravity-dex/</a></p>\n<p>Cosmos ecosystem and why it is the most important/undervalued aspect to the\ncrypto space..</p> <h1><strong>Look into the cosmos ecosystem</strong></h1>\n<p>It’s simply…",
  "data/reddit-crypto/r/CryptoCurrency/comments/ru5yrc/anyone_else_saving_in_crypto_and_completely.json": "<!-- SC_OFF --><div class=\"md\"><p>Whenever someone talks about depositing or\nsaving money, most people instantly think about banks for some reason. IMO they\nare the worst way to save money, not only do they offer interest rates that are\nterrible and lower than the inflation rate, they&#39;re also…",
  "data/reddit-crypto/r/CryptoCurrency/comments/rtqqcp/tell_us_about_your_past_years_experience_in.json": "<!-- SC_OFF --><div class=\"md\"><p>Now that even the last places of our beautiful\nplanet have entered the new year, I think it&#39;s a good time to ask you guys\nhow you experienced year 2021 in crypto. In one word only. Hopefully we see some\ngood stuff here to make us bullish for 2022. </p> <p>I gave…",
  "data/reddit-crypto/r/CryptoCurrency/comments/rtv2n2/a_good_portfolio_should_contain_a_big_portion_of.json": "<!-- SC_OFF --><div class=\"md\"><p>If you are here for the long run, you should\nreally hedge your risky bets on some bluechip crypto. </p> <p>Yes BTC won&#39;t\nbring you a 100* nor will ETH but they are a promise of good returns. Heck even\nif you are chasing some *1000 you should still invest in ETH…",
  "data/reddit-crypto/r/CryptoCurrency/comments/ru5txa/zkrollups_thoughts_for_2022.json": "<!-- SC_OFF --><div class=\"md\"><p>zkRollups: what are your predictions for\n2022?</p> <p>It seems this may well be an area for sustained growth in 2022. It\ndoesn’t seem that many zkRollups have tokens yet … it seems to me that Loopring\nis one of the few. Who else is looking at this area?</p> <p>Given…",
  "data/reddit-crypto/r/CryptoCurrency/comments/rucrcr/im_into_crypto_for_hookers_and_cocaine_happy_new.json": "<!-- SC_OFF --><div class=\"md\"><p>We&#39;re all here in this community of crypto\nfor different reasons mine just happens to be the pleasures of hookers and\ncocaine.</p> <p>This world is rough we all know it and I am genuinely into\ncrypto for hookers and cocaine like the title says. Maybe dinner…",
  "data/reddit-crypto/r/Bitcoin/comments/rtqiat/so_whos_buying_right_now_market_is_tired_google.json": "<!-- SC_OFF --><div class=\"md\"><p>I just bought. </p> <p>Let&#39;s start the\nyear right!</p> </div><!-- SC_ON -->",
  "data/reddit-crypto/r/Bitcoin/comments/rtr68p/can_bitcoin_held_in_a_hardware_wallet_be.json": "<!-- SC_OFF --><div class=\"md\"><p>I work in legal services and this question has\noften occurred to me while watching proceedings. Say I hold a substantial\nportion of my net worth in bitcoin, I lose a civil suit, and the amount I owe in\ndamages exceeds the amount I hold in checking accounts, physical…",
  "data/reddit-crypto/r/CryptoCurrency/comments/ruaynz/whats_the_most_profit_youve_made_from_a_single.json": "Which coin or token was it and how much profit did you make? Was it a memecoin?\nWas it an airdrop that you forgot about and found years later?How long did you\nhold it in your portfolio and what made you take profits at the time that you\ndid?\n\nObviously the folks who have been in for years and years…",
  "data/reddit-crypto/r/CryptoCurrency/comments/rugdyg/robinhood_launching_cryptocurrency_wallets_why.json": "As many of you know, Robinhood is launching cryptocurrency wallets\n[https://news.bitcoin.com/trading-platform-robinhood-launch-cryptocurrency-wallets/]\nsoon.\n\nYou also may be familiar with the fact that on January 28, 2021, Robinhood\ninfamously restricted the trading of various…",
  "data/reddit-crypto/r/CryptoCurrency/comments/ruep0r/finally_did_it_i_made_a_crypto_trading_bot_that.json": "So I've been working on this project for over 6 months now, and I've learned\nquite a bit about how new listings behave, and how important the Binance and\nKucoin Annoucement pages are.\n\nMy initial idea was to create a crypto trading bot in Python, that constantly\nchecks if a new listing is added on…",
  "data/reddit-crypto/r/CryptoCurrency/comments/rum4o2/back_in_july_people_didnt_buy_btc_at_28k_because.json": "This happens on every drop people wait for a bottom before buying. Which sounds\nlike a good idea… save money for dips and a little more for any crazy market\ncorrections. After all there isn’t much of a difference between buying Bitcoin\nat the bottom at 28k and waiting and catching 30k. But often…",
  "data/reddit-crypto/r/CryptoCurrency/comments/rusdrr/8_and_a_half_years_ago_a_youtuber_by_the_name_of.json": "On May 9th, 2013 youtuber Davincij15 made a 6 minute video going over what\nBitcoin is, and it’s potential, in his opinion at the time and pleaded with his\naudience to just buy $1 worth and leave it in a wallet.\n\n> A lot of you don’t believe in the Bitcoin system and that’s fine. You can stay\n> on…",
  "data/reddit-crypto/r/CryptoCurrency/comments/rup09v/this_is_what_the_top_10_looked_like_in_january.json": "In 1st January 2020, the top 10 looked like this:\n\n 1.  Bitcoin ($7.2k)\n 2.  Ethereum ($130.80)\n 3.  XRP ($0.19)\n 4.  Tether ($1)\n 5.  Bitcoin Cash ($204.40)\n 6.  Litecoin ($42.02)\n 7.  EOS ($2.60)\n 8.  Binance Coin ($13.69)\n 9.  Bitcoin SV ($97.20)\n 10. Tezos ($1.37)\n\nThis is what the top 10…",
  "data/reddit-crypto/r/CryptoCurrency/comments/rucza6/78_of_crypto_investors_believe_in_fake_statistics.json": "Recently many people post news which cite statistics, most of these statistics\nare often misleading.\n\nAs example:\n\n11% of people within the United States are Invested into Crypto\n[https://www.fool.com/the-ascent/cryptocurrency/articles/youll-never-guess-how-many-americans-invest-in…",
  "data/reddit-crypto/r/CryptoCurrency/comments/ruffjq/dont_fomo_with_these_if_you_invested_1000_posts.json": "Yes there are many trains you may have missed this past year, but here are some\nbullets you may have dodged. Here are some top 100 as of Jan 2021.\n\n\n\nCoin/token price Jan 21 price Jan 22 percent loss value today Jan 22 AAVE $264\n$260 -.015% $984 SNX $17.47 $6.17 -64% $353 XEM $0.21 $.013 -38% $629…",
  "data/reddit-crypto/r/CryptoCurrency/comments/ruhs3r/happy_13th_birthday_bitcoin.json": "It was on this day, 13 years ago, that the genesis block was minted by Satoshi\nNakamoto and the rest is history.\n\nHe understood the corrupt state of our financial ecosystem and foresaw that\ndecentralisation and internationality could solve this pervasive corruptness\nwhich had besieged us here.\n\nIt…",
  "data/reddit-crypto/r/Bitcoin/comments/ru8ibm/bitcoiners_are_living_10_years_in_the_future.json": "Having to turn your bitcoin into fiat, put it inside a bank and use a plastic\ncard to be able to spend it anywhere is like owning a sports car but being\nrequired to turn off the engine and get a horse to pull it for you every time\nyou want to go anywhere.\n\nWaiting for the rest of the world to catch…",
  "data/reddit-crypto/r/CryptoCurrency/comments/rui2wl/most_successful_people_in_this_sub_dont_tell.json": "Why people in this sub don't tell truth about their portfolios? Because many\nmembers are average or terrible investors so success trigger them. And of course\na lot of scammers too. Everyone else need to lower the bar if they want to be\ntreated equally and don't have spam in DMs.\n\nPeople are jealous…",
  "data/reddit-crypto/r/CryptoCurrency/comments/rv0u98/algo_is_garbage_im_explaining_why.json": "I'm totally aware that this will be probably the most downvoted post in the\nhistory of this sub. But I don't care.\n\nAlgo is the most shilled coin on reddit. I am the unlucky one and took the bait\nand bought Algo because of the shill. I did the research and on paper everything\nlooked great. Fast,…",
  "data/reddit-crypto/r/CryptoCurrency/comments/rum365/loopring_dev_says_matic_isnt_competition_instead.json": "A Loopring developer shared some very ambiguous plans on Discord. I want to hear\nwhat your thoughts are on it. Is it at all possible or are we in for another\nmassive rug pull?\n\nHere's the Tl:Dr: We are building a futuristic, secure Smart Wallet and the\ndApps to give users a true All-in-one solution…",
  "data/reddit-crypto/r/Bitcoin/comments/ruzrj1/i_know_i_still_got_a_long_way_to_go_but_i_finally.json": "I’ve been striving for almost a year now to achieve something, and finally I was\nable to stack 0.1BTC. I know it’s still small and I still have to grind more to\nreach 1BTC, but I feel so giddy realizing that I have this. I want to continue\ndoing this so that I can buy a house and hopefully become…",
  "data/reddit-crypto/r/CryptoCurrency/comments/ruyhge/what_is_one_coin_youll_never_turn_your_back_on.json": "What's a coin or token that bears a rather negative connotation in the crypto\nspace, but you believe in its future despite the controversy surrounding it?\n\nMine wouldn't exactly be a specific crypto but more of a category - memecoins.\n\nEveryone always hates on memecoins because of how \"disgraceful\"…",
  "data/reddit-crypto/r/CryptoCurrency/comments/rv3u6b/good_news_the_market_dominance_of_tether_is_in.json": "I don't think I need to explain all over again why Tether (USDT) is the\nshittiest of all stablecoins. It's not backed-up by cash or cash equivalent, it\noperates as a unregulated money printing machine and the company behind it\nhasn't even answered to basic questions\n[https://tokenist.com/tether…",
  "data/reddit-crypto/r/CryptoCurrency/comments/rv8cgs/im_not_in_it_for_the_money_such_bs_we_are_all.json": "Every one of us here hold coins and tokens, regardless if they're BTC or a\nShitcoin.\n\nSo many times people on here put people down for being just here for the money.\nThose same people always have their Reddit vaults open and are farming with\npassive aggressive comments 10x an hour.\n\n\"Cociane and…",
  "data/reddit-crypto/r/CryptoCurrency/comments/rvbjbq/the_irs_has_a_625000_cash_bounty_on_whoever_can.json": "If privacy in the crypto world is of any importance to you, it really doesn't\nget more \"private\" than Monero(XMR) .. In fact it is so private that the IRS\ndesperately published a $625,000 bounty\n[https://www.interactivecrypto.com/irs-625-000-bounty-for-breaking-monero-and-lightning]\nfor breaking…",
  "data/reddit-crypto/r/CryptoCurrency/comments/rv5xdw/investing_2_into_500_altcoins.json": "Alright, so this is going to sound dumb, and probably is dumb, but I thought I'd\nask anyway.\n\nSay I've got $1000 to blow and I'm already investing in the bigger coins, why\nnot take a chance and put $2 into 500 random altcoins that no ones talking\nabout?\n\nThe reason I ask is because $2 in a certain…",
  "data/reddit-crypto/r/CryptoCurrency/comments/rut2f5/the_more_research_i_do_the_more_it_seems_like.json": "Pretty new to this space but seeing TAs on places like here, YouTube or\nTradingview, just makes me think people are analyzing in a way that supports\nwhat they want. Youtube seems like the worst as it is just people with\nridiculous thumbnails predicting crypto crash or BTC to $1,000,000! Also,…",
  "data/reddit-crypto/r/CryptoCurrency/comments/rvf2fo/ben_cowen_blocked_me_on_twitter_for_challenging.json": "It all started with this reply sent to Ben:\n\nhttps://preview.redd.it/4kz6nk4q0k981.png?width=1518&format=png&auto=webp&s=e1cd7d25e4bf2dc2d8d520d8c3bcdbedb6b0b035\n\nBen replies:\n\nhttps://preview.redd.it/nzbr3ne31k981.png?width=1473&format=png&auto=webp&s=b6ede6cdab9c50128c0b671ebe6f83aa93abd4a9\n\nIt…",
  "data/reddit-crypto/r/Bitcoin/comments/rv3nji/we_are_at_least_20_years_away_from.json": "I spent most of the second half of 2021 trying to orange pill my social circle\nand I only managed to succeed with my very closest friends.\n\nI noticed that most people either don't care or cannot wrap their heads around\nit. It's almost like you need to have certain genes or personality type to be…",
  "data/reddit-crypto/r/Bitcoin/comments/rv2m4u/buying_bitcoin_every_month_for_52_months_in_a_row.json": "I buy Bitcoin every month with the max amount I can from my salary. Its\nbasically the FIRE way of investing but instead of S&P I buy Bitcoin. Started to\nbuy in October 2017 and have bought every month ever since. I did not have any\nmeaningful savings so the only way to get Bitcoin was to work for…",
  "data/reddit-crypto/r/CryptoCurrency/comments/rvakhh/if_eminem_buys_an_nft_for_05m_he_spends_less_than.json": "Most of the celebrities who are buying BAYC NFTs are spending less than a % of\nwhat they own because they know that NFTs are at this point a gamble. At face\nvalue, those numbers might look great ($0.5m which will appreciate with time)-\nbut when you dig a little down- these guys are just playing…",
  "data/reddit-crypto/r/Bitcoin/comments/rv5pjk/the_upper_class_is_cruising_at_economic_escape.json": "Bitcoin is the ticket out of this mess.",
  "data/reddit-crypto/r/CryptoCurrency/comments/rvgvf5/someone_is_currently_logged_into_satoshi.json": "https://p2pfoundation.ning.com/profile/SatoshiNakamoto\n\nThe green dot is showing, meaning someone is currently logged into the account\nright now. I do believe it is hacked, as it posted a link advertising a scam NFT\na few days prior. It's been known for a long time that this account, and one of\nhis…",
  "data/reddit-crypto/r/CryptoCurrency/comments/rvjd7o/six_months_ago_i_gave_my_kids_100_each_and_asked.json": "Six months ago, I made a post about giving my kids $100 in crypto and asking\nthem to choose three cryptos each. I was asked by many in the thread to post a\nmonthly update. I only have the time about every two months, so, here are the\nresults after six months.\n\nAlso, two of the kids have since had…",
  "data/reddit-crypto/r/CryptoCurrency/comments/rvnzp3/solana_went_down_again_on_4th_jan_morning_utc_8.json": "Another year.. and another episode of Solana going down.\n\nToday it went down for a few hours in the early morning Asia time, and it took\nalmost 4 hours to bring it back up.\n\nThe Solana community blames it on a DDOS attack. Lol\n\nSolana…",
  "data/reddit-crypto/r/CryptoCurrency/comments/rvktc1/what_are_zkrollups_and_why_theyre_the_best.json": "First of all, what are ZK-Rollups?\n\nWell, simply put, zero-knowledge rollups or zk-rollups is a Layer 2 scalability\nsolution that allows blockchains to validate transactions faster while also\nensuring that gas fees remain minimal. Zk-rollups manage to perform better than\ntraditional Layer 1…",
  "data/reddit-crypto/r/Bitcoin/comments/rvbkdy/btc_has_set_me_free.json": "I have sold my sats for a very important reason personally, to completely\neliminate all my long and short term debts.\n\nNow I am completely free from the shackles of the Fiat regime.\n\nI plan to continue to accumulate sats, and be my own bank moving forward.\n\nEvery month a significant portion of my…",
  "data/reddit-crypto/r/CryptoCurrency/comments/rvkllt/algo_is_not_garbage_its_one_of_the_most_user.json": "As you should be aware, this post\n[https://np.reddit.com/r/CryptoCurrency/comments/rv0u98/algo_is_garbage_im_explaining_why/]\nis currently trending and much of the information there is absurd, OP is clearly\nhating on…",
  "data/reddit-crypto/r/CryptoCurrency/comments/rvtzm3/crypto_isnt_a_passive_income_if_you_spend_the.json": "Most of us are in crypto so we can make money and someday live off passive\nIncome. Apart from that have a comfortable life without worrying about money .\n\nGazing at charts the entire day defeats the purpose . In the long run Crypto is\ngoing up at least BTC and eth are. Buy a coin you believe in ,…",
  "data/reddit-crypto/r/CryptoCurrency/comments/rvr52s/what_is_that_one_coin_that_youll_never_buy.json": "So, what is that one coin or token that everyone loves and you think there's\nsomething horribly wrong with it?\n\nWhat is the coin that rustles your jimmies?\n\nWhat is your crypto principle that this coin so blatantly breaks, that you're\nfine with missing 20x on possible profits, just to maintain your…",
  "data/reddit-crypto/r/CryptoCurrency/comments/rvq7d5/many_people_believe_that_cryptocurrency_will_kill.json": "I just saw this article\n[https://www.newsbtc.com/news/company/could-crypto-adoption-represent-a-compliance-opportunity-for-banks/]\nand I was thinking about how banks and crypto can work together.\n\nSince the first merchants in history, banks have existed in some form. They\nbecame the religious…",
  "data/reddit-crypto/r/CryptoCurrency/comments/rvxoyk/solana_did_not_go_down_yesterday_it_was_still.json": "I'm not sure what is up with the modding here but it allows completely incorrect\nFUD to persist here. Solana never went down yesterday but did suffer from being\na lot slower than normal, with bot spam of high compute transactions crowding\nblockspace. Blocks included votes as usual and less…",
  "data/reddit-crypto/r/CryptoCurrency/comments/rw0v99/if_all_cryptocurrency_fell_to_0_tomorrow_how.json": "Hello fellow crypto enjoyers.\n\nWe all know the rules of crypto investments. One of those rules, for the new\npeople around here, is « You shall only invest what you are not afraid to\nloose ».\n\nBut realistically, we all know there’s a lot of people that invest a lot more\nthan what they can afford to…",
  "data/reddit-crypto/r/Bitcoin/comments/rvyxw9/many_experts_have_started_predicting_two_or_three.json": "Dubai has to be the next top contender for making Bitcoin legal tender. Here are\na few reasons I could think of as to why.\n\n1) Their currency is stuck pegged to the US dollar which with inflation rising\nis horrible for them, they need an alternative to use along side their existing\ncurrency.\n\n2)…",
  "data/reddit-crypto/r/CryptoCurrency/comments/rw0mky/matic_is_sweating_like_a_pig_with_over_580_gwei.json": "ZK rollup solution to reduce the gas fees and improve transactions is something\nthat I'm really bullish on. I've been in MATIC since it was worth only a quarter\nof a dollar and I support the project wholeheartedly.\n\nRight now, MATIC Polygon is sweating like a pig on a roast, because one one\nsmall…",
  "data/reddit-crypto/r/Bitcoin/comments/rvszor/stop_being_aholes.json": "This needs to be said here. Bashing people for not understanding or adopting BTC\nlike you might doesn’t help to turn them in your corner.\n\nMore BTC people need to think about this as getting people “over to your team”\nand realize people will have vastly different reasons than yours on why…",
  "data/reddit-crypto/r/CryptoCurrency/comments/rw3924/ergo_erg_is_a_prime_example_of_why_you_shouldnt.json": "Around 4-5 months ago, this subs favorite low market cap coin was Ergo (ERG).\n\nDuring its hype it was hovering around $14-$18, a few months later and it’s down\nat $4 - down more than 70% from its ATH.\n\nThis is an even better post about this…",
  "data/reddit-crypto/r/Bitcoin/comments/rw2een/is_anyone_else_terrified_of_cbdcs_and_their.json": "Look into CBDCs and the amount of control they give to central banks.\n\n * they are fully centralized\n * transparent, every transaction is subject to surveillance.\n * transactions are directly taxable.\n * endless money printing ie. inflation.\n * negative interest rates.\n * expiry dates on money…",
  "data/reddit-crypto/r/CryptoCurrency/comments/rw2atb/only_1_of_the_world_owns_crypto_it_is_silly_to.json": "There are currently approximately 100 million blockchain wallets out there. This\nis an extremely small amount considering that is only 1.28% of the 7.8 Billion\npeople we have on earth. The $2.2 Trillion Crypto market is extremely\nundervalued. In the future when digital currencies start gaining…",
  "data/reddit-crypto/r/CryptoCurrency/comments/rw9smd/learning_how_to_invest_in_crypto_has_been.json": "I have been working in digital for over twenty years, and the first time I heard\nabout crypto was from one of my fellow devs who was mining Doge in 2014. I\nbought about $50 worth of it back then and ended up losing access to wherever it\nwas stored at the time. No big deal, it was my first lesson in…",
  "data/reddit-crypto/r/CryptoCurrency/comments/rw4j5a/algorand_governance_distribution_breakdown_50000.json": "Those that signed up for the first round of governance will have received their\nrewards now.\n\n50,000 transactions took just 20 minutes, with $100 million worth of ALGO\ndistributed. The total transaction fee costing 50 ALGO.\n\nNow whether you have a bag of ALGO or not, its good to see what is…",
  "data/reddit-crypto/r/CryptoCurrency/comments/rw3vsz/dont_be_like_your_parents_invest_now_so_your_kids.json": "I've been in crypto for a while and no im not rich yet. but what i been noticing\nbesides the price flux lol, is the amount of people that is getting into crypto\nas a whole. if its not investing its NFT games, or using it to buy something at\na discount at somewhere like the Dallas Mavericks stadium,…",
  "data/reddit-crypto/r/CryptoCurrency/comments/rwcou2/am_i_the_only_one_that_has_never_had_a_problem.json": "I see countless posts everyday about how Coinbase has been terrible for people.\nTheir Coinbase account got hacked, they got scammed, Coinbase support won’t get\nback to them, etc…\n\nI started with Coinbase early last year. I did lumpsum investments, weekly\nrecurring investments, monthly recurring,…",
  "data/reddit-crypto/r/CryptoCurrency/comments/rwhxvb/be_honest_which_coins_did_you_buy_just_because_it.json": "Have you ever seen coins that are being or have been shilled nonstop? Ehem ERG\nALGO LRC\n\nEveryone always say DO YOUR OWN RESEARCH, but we all know that there are times\nwhen we are too lazy to do this tedious part of investment and we're like ahh\nfuck it, what could possibly go wrong and just put in…",
  "data/reddit-crypto/r/CryptoCurrency/comments/rwlo57/nfts_wont_ruin_computer_games_greedy_game.json": "As the title says, there was a post recently in the gaming subreddit that was\nclaiming that NFTs will ruin computer gaming further just like microtransactions\ndid.\n\nHowever, I disagree with that statement. If NFTs were in DnD they would be a\nlawful neutral force, they are not good or evil they are…",
  "data/reddit-crypto/r/CryptoCurrency/comments/rwcosl/did_your_altcoin_just_moon_great_now_sell_15_of.json": "It's so easy to get stuck on, \"oh no, I shouldn't sell the whole bag because\nwhat if it goes up more!\" And dammit, you're right to wanna hold.\n\nBut this is a game of making money, and if that's your goal you need to sell\ninto euphoria\n\nWhen you're seeing double digit percent gains on your coin,…",
  "data/reddit-crypto/r/CryptoCurrency/comments/rwjwly/things_i_wish_i_did_earlier_when_investing_in.json": "Hi everyone! Today marks the anniversary of my first ever crypto transaction! My\nfirst purchase was of Ethereum, and since then it has been nothing else but a\nlearning journey.\n\nThere were a lot of things I learnt later than what I wished, so here are a few\nof the things I wish I did earlier when…",
  "data/reddit-crypto/r/Bitcoin/comments/rwlkd0/heads_up_and_be_safe_i_just_lost_btc_because_of.json": "I just lost a significant amount of BTC (to me at least, I can only save\n~100$/month). I had my last BTC (sats, really) purchases sitting in my exchange\nand wanted to move them to my (software) wallet that I use on my phone. So I\ncopied/pasted it the address on a secure notepad app that syncs with…",
  "data/reddit-crypto/r/Bitcoin/comments/rws5ye/anyone_else_experience_this_told_my_friend_at.json": "He said he downloaded Coinbase and bought a bunch of random coins some youtuber\nsuggested. I asked him if he bought any Bitcoin, he said \"nope, it was too\nexpensive\".\n\n🤦🤦🤦🤦🤦🤦🤦🤦🤦",
  "data/reddit-crypto/r/CryptoCurrency/comments/rwpfkx/zeroknowledge_proof_explained_like_you_are_5.json": "Hi kids!\n\nSo, you're interested in cryptocurrencies, and you've heard about those\nso-called \"zero-knowledge proofs\" (ZK) used by projects such as Loopring, zkSync\nand StarkWare.\n\nNow you're wondering : what are zero-knowledge proofs and why are they so\nimportant? Good news, champ, I am here for…",
  "data/reddit-crypto/r/CryptoCurrency/comments/rwo2sy/wives_crypto.json": "In another post, I read countless users saying that if crypto all of a sudden\nwent to $0, their wives would divorce them, take the kids, etc etc. How does\nthat work?\n\nIf you have some business that you invested in, and it goes to crap, does the\nfamily give up on you?\n\nAre you using you wife's money…",
  "data/reddit-crypto/r/CryptoCurrency/comments/rwluuk/looping_smart_wallet_is_now_free_to_activate_on.json": "Update your iOS app, it will let you activate the L2 wallet completely free as\nthe fee gets passed onto Loopring.\n\nYou can then add funds via L2 networked friends or buy via the RAMP fiat on-ramp\nto fund the L2 Wallet.\n\nTo have full functionality (social recovery, L1 funds etc) you’ll need…",
  "data/reddit-crypto/r/Bitcoin/comments/rweo0a/whats_the_best_bitcoin_quote_you_have_ever_heard.json": "\"Their ignorance is your opportunity.\" -Michael Saylor\n\nThat one is my favorite- surely an homage to Bezos famous quote",
  "data/reddit-crypto/r/Bitcoin/comments/rwnj33/i_just_threw_all_my_savings_into_bitcoin_and_idk.json": "Some background information, im from a newly 3rd world country ( Lebanon) and\nive saved 730$, dont have a job and im 23, i just threw a 700$ into btc and im\nexcited yet nervous, i would never sell at a loss, I'd kill my self before\ntaking a loss but idk i have butterflies in my stomach.\n\nInsert…",
  "data/reddit-crypto/r/CryptoCurrency/comments/rwj21h/cryptoland_this_is_real_its_disgusting_and_its_a.json": "This is cryptoland, just be warned you won’t get the 10 minutes back after\nwatching this video.\n\nhttps://youtu.be/jf3ajS5me78\n\nFor those who did not want to watch the video here is the rub. Cryptoland is the\nphysical manifestation of the metaverse. Created by two brain dead visionaries\nto sell you…",
  "data/reddit-crypto/r/CryptoCurrency/comments/rx0ati/if_you_cant_handle_the_50_dump_you_dont_deserve.json": "If you can’t handle the 50% dump you don’t deserve the 500% pump…\n\nWords (insert eg x% )that was used years ago as the go to for panic posts-\n\nSince we are seeing a bit of volatility today and I’m starting to see panic\nposts some words from veterans here from years ago to keep the chin up and…",
  "data/reddit-crypto/r/CryptoCurrency/comments/rwyvgy/selling_when_your_coin_crashes_is_plain_stupid.json": "With the recent crash I'm sure there are a lot of people selling, but it doesn't\nmake any sense to me as if you've bought reliable coins, and not some low\nmarketcap coin that came out yesterday, they will all climb back up and you'll\nforget about this crash.\n\nBitcoin crashed to 28k but climbed back…",
  "data/reddit-crypto/r/CryptoCurrency/comments/rwywij/anybody_else_excited_no_im_not_this_sucks_and_i.json": "It takes weeks upon weeks to slowly climb in the charts, then within a few hours\nit we're right back to where we were months ago? Yeah, that blows. The fact that\ncrypto is just some game for rich people to dip out of the microsecond something\nthreatening from the Fed happens sucks. The fact that…",
  "data/reddit-crypto/r/CryptoCurrency/comments/rwvac8/banks_in_germany_tell_customers_to_take_their.json": "Banks in Germany have started charging customers negative interest, meaning that\nthey want you to pay them in exchange for you storing your money in an account.\n\nNo joke, they literally tell their customers to take their money elsewhere\n[https://www.wsj.com/articles/banks-in-germany-tell-customers…",
  "data/reddit-crypto/r/CryptoCurrency/comments/rwq3mg/would_you_still_buy_crypto_if_you_couldnt.json": "Earlier today, I saw someone on here commenting that they would never sell some\ncoin they held - nothing too unusual, there are people saying that every day.\nBut it got me thinking: if you could never sell your crypto for fiat, would\npeople still buy it?\n\nThis is a thought experiment. In this…",
  "data/reddit-crypto/r/CryptoCurrency/comments/rwyti0/yet_again_over_666000000_worth_of_positions_were.json": "Yet again over $650,000,000 worth of positions were wiped from the market.\n\nMost of them were long positions.\n\nIn the past 24 hours, 175,705 traders were liquidated.\n\nThe largest single liquidation order happened on Bitmex - XBTUSD value $10.00M\n(damn!)\n\nInterestingly this time around majority of…",
  "data/reddit-crypto/r/CryptoCurrency/comments/rx4fje/725_million_in_crypto_liquidation_in_last_24_hours.json": "In last 24 hours while we all are waiting for a breakout, $725 million US\nDollars have been liquidated.\n\nLast week were in 'extreme fear' at 48k. Today, if we reach the same price\npoint, we all will be bullish.\n\nIn my honest opinion, I know this is quite a rough start to the year, but 42,500\nprice…",
  "data/reddit-crypto/r/CryptoCurrency/comments/rwvpye/crypto_has_made_me_obsessed_about_money_and.json": "I always planned on going through life being a decent man making a decent living\nand playing by the rules. Making sure everything I did was safe and calculated\nand non stressful. Just meander through and die. Such is life and what can you\ndo about it.\n\nThen enter crypto.\n\nI’m 29 and have been semi…",
  "data/reddit-crypto/r/CryptoCurrency/comments/rx6zdf/i_cant_be_the_only_one_who_thinks_that_most_of.json": "Before you say OP is just mad because he is in the red: I am well in the green\nand I don't care even if there is a 90% flash crash, I only invest what I can\nafford to lose.\n\nEvery single time there there is a small correction this sub gets bombarded with\n\"Did you buy the dip? Oh man you better buy…",
  "data/reddit-crypto/r/Bitcoin/comments/rwyn1x/bitcoin_is_down_10_percent_this_year_in_the_first.json": "Every 4 years there’s a nasty bear market. Looking to stack some cheap sats end\nof the year time 💰💰💰",
  "data/reddit-crypto/r/CryptoCurrency/comments/rxa8er/are_you_ready_to_hodl_everything_you_have_for_the.json": "Personal antidote; in April I asked my older brother if he held any crypto. He\nsaid yes, that he sold some Eth and made a few hundred. I told him no sell only\nhold. He said he was 'opportunistic' and 'didn't have diamond hands'. - Just\nlast week we were driving in the car together and he said 'All…",
  "data/reddit-crypto/r/Bitcoin/comments/rx4tt1/the_great_readjustment_understanding_where_we_are.json": "On November 10th, 2021, Bitcoin reached a high around $69,000. As I type this,\nthe current price is $42,948. But this post isn't about the price. It's about\nwhere we are and where we're headed, in terms of the 4 year halving-to-halving\ncycle.\n\nWe're almost halfway to the next Halving.\n\nYou probably…",
  "data/reddit-crypto/r/Bitcoin/comments/rx2ekf/my_goal_for_2022_is_to_get_to_01_btc.json": "It ain't much but it's an honest goal. Gonna stack!",
  "data/reddit-crypto/r/CryptoCurrency/comments/rxefap/wtf_is_going_on.json": "Ive watched the stock market, crypto market, and precious metal market for a the\npast 5ish years. One thing I always found fascinating is the way the markets\nmove together, most common example, one going up while another goes down and the\nthird not doing anything noteworthy.\n\nSince this whole GME…",
  "data/reddit-crypto/r/CryptoCurrency/comments/rxb7hg/red_days_are_the_true_fomo_but_you_need_to.json": "Prices are down, and you can't buy?\n\nDo you feel the fear of missing out a good buying opportunity?\n\nYeah, then you should control yourselves. People will tell you to buy the dip\nand they may be right BUT your investments shouldn't be driven by FOMO.\n\nIf you have a plan, stick to your plan. If you…",
  "data/reddit-crypto/r/CryptoCurrency/comments/rxfs5n/yesterday_a_scammershiller_who_masqueraded_as_an.json": "On January 5, a user made a post here on cryptocurrency about a new NFT game\nthey “discovered”. The game has its own token on the Binance Smart Chain.\n\n\nTHE POST WAS SWIFTFULLY AND RIGHTFULLY DELETED BY THE MODS BEFORE IT COULD DO\nMUCH DAMAGE, BUT NOT BEFORE IT GOT TO THE FRONTPAGE OF THIS SUB.\n\nIn…",
  "data/reddit-crypto/r/CryptoCurrency/comments/rxlcm5/what_causes_both_crypto_and_stock_market_to_drop.json": "I hear many reasons like Covid or other factors, such as regulations but what\nabout this time? It affects both markets so it doesn't have anything to do with\nonly crypto, which we could blame on regulations being implemented or being\nconsidered.\n\nAnd it definitely isn't whales since stocks dropped…",
  "data/reddit-crypto/r/CryptoCurrency/comments/rxbtwh/technical_analysis_the_camel_theory_this_bullrun.json": "So as you may already know... Bitcoin dipped a little, which of course isn't the\nfirst time in cryptocurrency history. As a crypto veteran (hodling since\nNovember 2021) I'm still very bullish right so I figured doing some technical\nanalysis for my fellow r/cryptocurrency [/r/cryptocurrency]…",
  "data/reddit-crypto/r/CryptoCurrency/comments/rxoj2i/a_crash_course_on_what_changing_the_us_bond_rate.json": "INTRO\n\nYesterday, somebody in the comments of some thread asked for an ELI5 on why US\nbond rates matter and what their relationship is with markets and economies.\nWhat I wrote ended up being more like an ELI12, and also ended up being quite\nlong; in any case, I have decided to modify it a bit and…",
  "data/reddit-crypto/r/CryptoCurrency/comments/rxmjwh/matic_brought_down_by_some_flowers.json": "I was bullish on MATIC since I got into crypto, a few days ago I decided to\nactually use their network to mint some NFTs my brother and I came up with and\noh man has my view on MATIC changed fast!\n\nNot only was it a pain just getting into and established on the network, some\ndamn sunflower game…",
  "data/reddit-crypto/r/CryptoCurrency/comments/rxspkh/ethereum_is_down_and_im_on_my_3rd_beer.json": "I received a 5 figure end of year bonus, and I'm ready to \"pull the trigger\"\n(figuratively speaking). Are we near the bottom of this mini-dip, or is it go\ntime? They make it so easy to buy crypto in seconds on Coinbase!\n\nAre there other coins I should consider? I like the big 2 but I'm open…",
  "data/reddit-crypto/r/CryptoCurrency/comments/rxp6zb/can_you_all_stop_posting_exchange_bitcoin.json": "I'm tired of people sharing exchange addresses saying that a whale bought or\nsold a large amount of BTC.\n\nAll the biggest bitcoin wallets belong to exchanges. By looking at inputs and\noutputs it's very easy for anyone to check that.\n\nThe top hot post right now shared the fourth ranked address which…",
  "data/reddit-crypto/r/CryptoCurrency/comments/rxxz8y/i_love_crypto_but_it_is_too_complicated.json": "I was fiddling with my hardware wallet today trying to move all my CRO off the\nexchange. I noticed a high fee for the move so I had to do some research on how\nnot to pay so much in gas.\n\nWhile getting slightly frustrated at the lack of simplicity i realized that the\naverage joe is in no way going…",
  "data/reddit-crypto/r/CryptoCurrency/comments/rxxcxv/new_folks_please_do_yourself_a_favor_and_dont.json": "And when I say anyone that means other than me on this post. I’ve been a\ncontributor on this sub and other crypto subs for the past 4+ years.\n\nI’ve made plenty of profit because of the time I’ve been invested in this market\nbut like many others, I’ve made some investments at times that I shouldn’t…",
  "data/reddit-crypto/r/CryptoCurrency/comments/ry3nhu/a_lot_of_retail_investors_have_moved_on_already.json": "If you're still here, well done, you are more resilient than a lot of folk who\nhave already left the crypto space. Ben Cowen has estimated 70% of his viewers\nhave already left, which is completely insane! They'll be back in future, and\nthe daily thread will be full of moonbois once more, buying…",
  "data/reddit-crypto/r/CryptoCurrency/comments/rxn1lj/if_you_live_paycheck_to_paycheck_would_you_really.json": "I live paycheck to paycheck don’t get me wrong I love crypto more than anything\nbecause this is truly a hope for me to make out of my country but I still\nwouldn’t accept my salary in crypto because I’m not in the situation to lose\neven a dollar from my paycheck.\n\nI would rather get paid in FIAT…",
  "data/reddit-crypto/r/Bitcoin/comments/rxz0me/panicking_ps.json": "As if BTC didn’t slip below 30k in July. The panic is exhausting to hear about.\nEverything is going to be fine! Act like you’ve been here before…",
  "data/reddit-crypto/r/CryptoCurrency/comments/ry6dbo/people_who_call_bear_market_on_every_2030_drop_i.json": "We had these types of corrections in previous bull runs too, I won’t talk about\n2017 even if you go back to May 2021 or March 2020 look how much we dropped you\nwill see this correction is nothing like we have not seen before. In March 2020\nand May 2021 we had almost 50% correction, was it a bear…",
  "data/reddit-crypto/r/CryptoCurrency/comments/rydqsa/this_isnt_a_20_correction_this_is_a_40_bear_market.json": "BTC is at $41-42k. ATH was at $69k. That’s a 40% drop from ATH, and that drop\nhas just been growing and growing for more than two months now.\n\nThat’s a bear market. Yeah, it’s not a crypto winter, but multiple months of\nfalling prices qualifies as a bear market, even if it’s short. Just like…",
  "data/reddit-crypto/r/CryptoCurrency/comments/ryfl8u/lrc_lets_people_mint_an_nft_for_just_250_over.json": "Loopring Layer 2 can now mint NFT's for just 100 gwei, or $2.50. This is\nextremely cheap compared to what creators would have to pay on ETH L1 (~$300).\n\nThis removes a massive barrier to entry and is a huge step in the right\ndirection for crypto to get more mainstream adaption. Most artists don't…",
  "data/reddit-crypto/r/CryptoCurrency/comments/ry8rsx/facts_retail_is_not_interested_in_btc_retail_is.json": "First of all, its wrong to say retail is not in crypto anymore - Anecdotal, I\nwas just in an NFT free mint that got sold out in literally 10 mins. Its a\nlittle obscure project which might very well go to zero in about 2 weeks, but\neven this one's discord server has over 10k users in just about 3…",
  "data/reddit-crypto/r/CryptoCurrency/comments/rybq06/why_your_20_buy_order_does_matter.json": "I’ve been noticing recently that people are saying “the ones saying buy the dips\nare only throwing $20 at it”\n\nSo what? There buying crypto not every single person can throw a couple hundred\ndollars at every dip, some people don’t have the luxury of having expendable\nfiat to throw into crypto if…",
  "data/reddit-crypto/r/CryptoCurrency/comments/ryh5oj/to_everyone_still_holding_let_me_see_those.json": "This post is intended to be a bit of a wellness check and morale boost during\nthese red days.\n\nI know many are really disappointed that we didn’t quite see 100K EOY as many so\ncalled “experts” have been predicting. And now we’re seeing a lot of red to\nstart the new year. Which is a good reminder…",
  "data/reddit-crypto/r/Bitcoin/comments/rygur8/ive_been_living_in_el_salvador_for_the_past_5.json": "I’m an Italian podcaster and I’ve been traveling in the whole country to report\nthe state of Bitcoin adoption. You can read my chronicles on my website. We post\nin English as well as in Italian. Hope u guys enjoy. 👊🏻",
  "data/reddit-crypto/r/CryptoCurrency/comments/ry42r2/can_we_take_a_moment_to_appreciate_harmony_one.json": "I sincerely dont want to sound like another shill, but their roadmap is speaking\nvolume!\n\n\nBITCOIN BRIDGE\n\nStill planning to have the launch this month. It should be an external launch so\nonboarding externals for running vaults. Some minor details to take care of\nstill, but the launch is still…",
  "data/reddit-crypto/r/Bitcoin/comments/ryca5o/apps_to_report_payments_over_600_per_year_to_the.json": "https://www.dailymail.co.uk/news/article-10372327/Venmo-PayPal-Cash-App-report-transactions-totaling-600-IRS.html\n\nIs the way forward to buy using cash on local stores?",
  "data/reddit-crypto/r/CryptoCurrency/comments/rympyj/youve_invested_more_than_you_can_afford_to_lose.json": "It seems like every post in this sub lately is trying to convince people what to\ndo with their money.\n\nWhether it’s “buying the dip”, “it’s just a dip”, or something like “who else is\nstill hodling”, it seems like we have some people here panicking.\n\nYou made the decision to buy what coin and how…",
  "data/reddit-crypto/r/CryptoCurrency/comments/rytehw/with_the_fear_and_greed_indicator_at_10_today_and.json": "For those you aren't aware, the Crypto Fear and Greed index uses 5-6\nmeasurements to assess the current sentiment of the market and then rates that\nlevel of emotion on a scale of 1 to 100. 1 is extreme fear and 100 is extreme\ngreed.\n\nThose measurements are objective of course - they look at…",
  "data/reddit-crypto/r/CryptoCurrency/comments/rytkcq/why_is_eth_btc_dropping_like_its_hot.json": "According to Time, the big drops this week to Ethereum and Bitcoin have followed\na disappointing December jobs report, and the release of minutes from the\nFederal Reserve Board's December meeting, which signaled the central bank would\nbegin slowing down measures to prop up the economy as it…",
  "data/reddit-crypto/r/CryptoCurrency/comments/ryw1sr/the_european_bank_unicredit_threatens_to_close.json": "Everything started on Twitter when a user showed a screenshot of a conversation\nwith Unicredit customer support. He complained that he couldn't send money to\nFTX or Crypto.com\n\nThe support told him to not do it because it's against the bank's policy. He\nasked where this policy was written and the…",
  "data/reddit-crypto/r/CryptoCurrency/comments/ryweqj/bitcoin_fear_greed_index_is_at_10_as_of_march.json": "The Bitcoin Fear & Greed Index is at 10 today. The lowest level since March\n2020. At that time, the COVID-19 pandemic had just started to spread around the\nworld, and we had a liquidity crisis in all liquid markets.\n\nThis caused the price of Bitcoin to drop by more than 50% in a few hours to a\nlow…",
  "data/reddit-crypto/r/CryptoCurrency/comments/ryyj5w/just_stake_your_assets_and_calm_the_fk_down.json": "I understand that the greed & fear meter is all the way down to 10.\n\nI also understand this dip is not what people expected after so many ExPeRtS\nclaimed BTC would reach 100k and ETH 10k lmfao\n\nI also also do understand that any newcomer will be scared af if they just put\ntheir Xmas money into…",
  "data/reddit-crypto/r/CryptoCurrency/comments/ryspiw/remember_a_public_ledger_is_public_forever_dont.json": "In most countries (including the US, contrary to popular opinion) there is no\nstatute of limitations on intentional tax fraud. Governments will eventually\ncatch up and easily scrape blockchains for any transactions you make that\noriginated from KYC exchanges (and all of the companies you…",
  "data/reddit-crypto/r/CryptoCurrency/comments/ryzs07/bitboy_has_been_involved_in_7_crypto_scams_in_the.json": "You might have already seen the flyer of his rates, I'm going to mention again\nif someone have not seen it yet.\n\nThis is what he charges for his videos:\n\nDedicated Review: $35,000\n\nLivestream Mention: $20,000\n\nYouTube Interview: $40,000\n\nTelegram AMA: $10,000\n\nWebsite Article: $2,500.\n\nI have no…",
  "data/reddit-crypto/r/CryptoCurrency/comments/rz7vqj/just_sell_it_all.json": "Absolute panic every second or third post. Everything from \"It's just a dip\" -\n\"bear market/crypto winter\" - \"Everything but Bitcoin and Ethereum is going to\nzero\". Lol calm down.\n\nIf you're sweating, just sell everything. Cryptocurrencies in general are\nextremely volatile and if this makes you…",
  "data/reddit-crypto/r/CryptoCurrency/comments/rz65o0/bitcoin_looks_on_track_to_close_a_7th_consecutive.json": "Bitcoin looks on track to close a 7th consecutive day in red and we need to go\nback all the way to 2018 to see a similar occurrence. That time, the 7-day\ndowntrend started on 29th July at a price of around $8500 (not the peak of the\nrun just like right now). After 7 days of falling back then, it…",
  "data/reddit-crypto/r/CryptoCurrency/comments/rz00vl/if_you_bought_and_hodl_every_top_10_coin_for.json": "Let's put things in perspective, imagine you invested in and still holding every\ncoin from top 10 exactly 5 years ago until today. The ranking is based on the\nHistorical Snapshot - 08 January 2017 by CMC\n\n\n\nCoin Price in USD 08 Jan 2017 Price in USD 08 Jan 2022 Percentage change 1.\nBitcoin 911.20…",
  "data/reddit-crypto/r/Bitcoin/comments/rz5xom/how_will_strippers_be_tipped_in_a.json": "Serious question! One of the enjoyable features of physical cash, is that you\ncan gently place it in the stripper's thong, to tip her. The stripper enjoys it\n(or at least acts like she does), and you get to feel benevolent and loving.\nIt's just, a great feature. But, it's a whole lot less sexy, to…",
  "data/reddit-crypto/r/Bitcoin/comments/rz3ubb/why_i_think_were_in_a_supercycle.json": "BTC supply is growing at less than 2%.\n\nPrevious cycles it was ~ 4 or 8 %.\n\n90% is mined.\n\nBTC is now more scarce than gold, before it wasn’t due to the supply growth.\n\nThat’s it, that’s the reason. No TA or anything dumb speculation over whether\nanother country will adopt.\n\nMoon eventually 🌗",
  "data/reddit-crypto/r/Bitcoin/comments/ryvni4/bitcoin_as_a_retirement_account.json": "I am 31, and wondering if anyone else around this age has chosen to not put\nmoney into a retirement account at work and instead put it into Bitcoin instead?\nObviously this isn’t a very traditional or risk-off approach but I believe in\nthis thing and I think it could work. It’s been amazing watching…",
  "data/reddit-crypto/r/CryptoCurrency/comments/rz67m3/being_a_little_kind_towards_newbies_wont_take.json": "A lot of newbies entered the market when it was pumping, and seeing the value of\nyour investment plummet like this really scares the hell out of everyone. It\ndoesn’t help anyone to scold and taunt newbies asking about the bear market and\nbelittling them by saying shit like “if you needed your money…",
  "data/reddit-crypto/r/CryptoCurrency/comments/rzg6i1/this_sub_2_months_ago_you_will_never_see_bitcoin.json": "Two months ago when Bitcoin hit its all time high of $69k, pretty much all you\nwould hear from people around here was that the days of Bitcoin below $50k was a\nthing of the past--with members posting all these astrological TA charts\nproclaiming how the 'maximum pain' from here on forward was around…",
  "data/reddit-crypto/r/Bitcoin/comments/rzbhpp/never_selling.json": "I wonder how many Bitcoiners, like me, are truly never selling (in any\nmaterially relevant way)? Genuinely? How many people here are in it for their\ngrandkids for example? I feel a little intense and crazy when I think that way\nbut that’s just the truth",
  "data/reddit-crypto/r/CryptoCurrency/comments/rzicfg/are_rcc_users_overly_enthusiastic_in_posting.json": "An unexpected trend I noticed recently is that posts with low upvote counts\nroutinely make it to the frontpage.\n\nThis is common in smaller communities, but there are 4 million+ subscribers\nhere. You’d expect posts on the frontpage would have a couple thousand upvotes\ninstead of a few hundred…",
  "data/reddit-crypto/r/CryptoCurrency/comments/rzm6s3/there_will_not_be_a_8090_correction_this_isnt_2017.json": "Like the title says, and in response to many posts I see here telling people to\nprepare for such a dip, or the others that gain appropriate Notoriety saying\nthey held through the last dip, it’s not applicable nowadays. Apple and…",
  "data/reddit-crypto/r/CryptoCurrency/comments/rzoq1i/this_sub_is_the_best_place_for_entertainment_and.json": "Today, one half of the experts of this sub seem sure that we have entered a bear\nmarket while the other half is sure this dip is nothing but a tiny hiccup and\nare advising everyone to BTFD. In the coming days, when one of the two things\nwill play out, one half of our r/cc [/r/cc] experts will jump…",
  "data/reddit-crypto/r/CryptoCurrency/comments/rzmssf/crypto_has_a_major_problem_and_thats_poor_user.json": "I see great potential in crypto to be the next paradigm shift that transforms\nthe global economy. Though, as a UI Designer and UX Researcher, most crypto\nproducts make no sense to the average user—they're complex, cumbersome, and\nrequire a ton of focused knowledge to not lose money.\n\nMany of my…",
  "data/reddit-crypto/r/CryptoCurrency/comments/rzpxwr/this_down_market_shows_why_hamsters_are_better.json": "Mr Goxx the crypto trading hamster had performed better than most human\ninvestors at the same time period.\n\nHow did a fukin hamster was able to bit your average crypto investors ? What'\nthe secret ?\n\nJust look at the reactions of most cryptonuts of this sub during the ongoing\nmarket carsh and you…",
  "data/reddit-crypto/r/CryptoCurrency/comments/rzu4kl/so_we_are_firmly_in_stage_4_of_the_markets.json": "Stage 1: People refer to a large, sudden, and unexplainable drop in price as a\n'correction', anyone referring to it as a crash gets shunned.\n\nStage 2: People start responding to any question with 'just don't look at the\ncharts all the time' and get offended when people want to talk about crypto on…",
  "data/reddit-crypto/r/Bitcoin/comments/rzn269/forgot_my_old_wallet_turns_out_it_had_1btc_inside.json": "Found the seed of my old wallet (before coldstorage)\n\nI'm ecstatic, I thought I emptied everything our to my cold wallets\n\nValue in 2020 was just under 10k, value now it's over 40k!\n\n30k profit just by hodling (forgetting ;)) your coins. Why are people being\nscared they'll lose some fiat? Just wait…",
  "data/reddit-crypto/r/CryptoCurrency/comments/rzlpre/in_less_than_4_words_describe_your_game_plan_in.json": "Title is super self explanatory, i just thought this would be interesting. Here\nare 5 top crypto strategies worth noting. Good Luck!\n\nDay Trading - As a digital asset investor, you should be familiar with various\nresources and strategies. Basically, there are two types of trading strategies\nyou can…",
  "data/reddit-crypto/r/CryptoCurrency/comments/rzvnqd/yes_people_can_be_too_poor_to_invest_in_crypto.json": "and it's weird that I have to state this. But a few minutes ago one of these \"3\nposts and 50 comments a day exactly\" moon farmers on here made a\npseudo-wholesome post saying that nobody is too poor to buy crypto and \"Crypto\nis for everyone regardless how poor or wealthy they are\". And of course you…",
  "data/reddit-crypto/r/CryptoCurrency/comments/rzuu3f/say_what_you_will_but_i_still_believe_in_100k_btc.json": "Title says it all, I can't believe that anyone would genuinely be ignorant of\n100k BTC by end of year 2021 just because of a tiny, little fact like that\ncalendar changing.\n\nThere was just sooooooo much TA and graph lines, did you see those lines?! They\nall went upwards. Now maybe if they only went…",
  "data/reddit-crypto/r/Bitcoin/comments/rzu9b4/would_you_live_off_bitcoin_with_the_fundamental.json": "I’m 30, single. I’ve been to 3 jobs and I’ve always hated my field. Jumping from\none job to another hoping to feel any different, never did.\n\nI’ve accumulated 11 bitcoins, my living expenses is $3,000 per month.\n\nIf Bitcoin remains in the 40ish, I could possibly live off it for little over…",
  "data/reddit-crypto/r/Bitcoin/comments/rzxx16/selling_property_offered_a_bitcoin_when_asking.json": "I have no idea about crypto, was offered a bitcoin or 40k of the 49k I'm asking.\nI have been researching bitcoin a bit and must say this is above my pay grade.\nIt looks like a roller coaster ride, though profitable in the long term. Would\nany of you wonderful geniuses out there offer a suggestion?…",
  "data/reddit-crypto/r/CryptoCurrency/comments/rzujgw/stop_being_deluded_80_correction_is_always.json": "> There will not be a 80-90% correction, this isn’t 2017.\n\nThis also reads as:\n\n> Muh, this time will be different!!1\n\nWe often say ''moonboys never learn\". Let me hit you with some facts:\n\nNov 2013. Bitcoin hits ATH of 1154$ and corrects to 227$ in Aug 2015. hitting\nnew ATH Apr 2017.\n\nDec 2017.…",
  "data/reddit-crypto/r/CryptoCurrency/comments/rzwtm7/dont_blame_newbies_for_using_centralized.json": "Crypto veterans sometimes can be pretty harsh judging newbies or anyone in\ngeneral that is using Centralized Exchanges like Binance, Crypto.com\n[https://Crypto.com] etc. The saying \"Not your keys, not your Crypto\" is valid\nargument against these exchanges but sometimes for the Average Joe this is…",
  "data/reddit-crypto/r/CryptoCurrency/comments/rzzlnb/comment_something_negative_about_a_cryptocurrency.json": "As the title says, comment something negative about any cryptocurrency and see\nif people can guess which cryptocurrency you are talking about.\n\nI see so many of the same types of posts right now so thought I would change it\nup and see if people are on the same page of the negatives of…",
  "data/reddit-crypto/r/CryptoCurrency/comments/rzt5mo/do_not_touch_leverage_unless_you_have_money_to.json": "2021 was a great year for me. I 10x'd my money investing into ATOM, SYS, HOT,\nLUNA, LRC etc. and I was way over the moon. I thought I was fucking\ninvincible...\n\nI was going around suggesting people to set stop limits, do not invest more\nmoney than you can afford and of course, I shilled for coins…",
  "data/reddit-crypto/r/CryptoCurrency/comments/rzqh7o/gentle_reminder_pulse_x_pulse_chain_hex_and.json": "Crypto HEX Founder is Actually Notorious Criminal ‘Spam King’\n\nRichard Heart, aka Richard J. Schueler, aka, J. Richard, aka James Hart is\nlinked to a Panama criminal network which included corrupt lawyers and judges.\nHeart also sold anti-aging cures in between roles as Spam King and Bitcoin\nthought…",
  "data/reddit-crypto/r/CryptoCurrency/comments/s02x75/whats_the_best_crypto_advice_youve_been_given_on.json": "I know it’s mentioned a lot that you shouldn’t take advice from people on this\nsub, and I’m a huge believer in doing your own research.\n\nHowever, since joining this sub my Crypto portfolio is definitely performing a\nlot better than it was beforehand. Yes, this is largely due to this being a\nmajor…",
  "data/reddit-crypto/r/CryptoCurrency/comments/s07u00/do_you_think_lrc_is_a_good_long_term_investment.json": "Curious what people outside of the Loopring subreddits think about it. There's a\nlot of sentiment that it has a good chance to multiply in its value overtime as\nmore partnerships and NFT's get announced down the road to be using loopring,\nwhether it is for Gamestop or otherwise.\n\nPersonally its…",
  "data/reddit-crypto/r/CryptoCurrency/comments/s091pn/doublecheck_all_addresses_before_hitting_send.json": "So today, I wanted to introduce a friend to a certain cryptocurrency and asked\nhim to copy-paste his metamask and send it to me via chat. Having this constant\nparanoia and fear of sending crypto to wrong addresses, I decide to look up the\naddress he sent to me on etherscan, and I find quite a large…",
  "data/reddit-crypto/r/Bitcoin/comments/s051aw/this_dip_is_a_blessing_for_those_who_believe_in.json": "If you actually believe in ₿Itcoin’s inherit value in a world of infinitely\nprinted fiat with a user-base growing at twice the speed of the internet’s\nuser-base growth, a majority of all are dollar cost averaging their income of\ninfinitely printed fiat into ₿Itcoin’s finite Satoshi supply, then you…",
  "data/reddit-crypto/r/CryptoCurrency/comments/s049st/why_im_going_to_start_taking_profit_and_you.json": "+205%\n\nThat's how much my portfolio had gained at one point last year.\n\nLife was really looking up. I had hit my goal for crypto gains for the year and\nI considered taking some profits.\n\n\"Maybe just my initial investment,\" I thought to myself.\n\nBut no, I'm a HODLer. I believe in the tech long term.…",
  "data/reddit-crypto/r/Bitcoin/comments/rzzq32/so_we_have_an_upcoming_eventual_mega_market_crash.json": "So US Government decides to increase yield on bonds , reduce reckless money\nprinting and a bunch of other decisions that will eventually make stock\ninvestors move a lot of their money from stocks to bonds. Basically stocks\nbecome kind of a risky and uncertain assets while bonds become the…",
  "data/reddit-crypto/r/CryptoCurrency/comments/s0fqa7/warning_dont_use_deso_allegedly_a_decentralised.json": "DeSo is supposedly a decentralised social media platform that has recently\nlaunched its token without even a platform yet.\n\nWhen creating an account, it asks to enter your seed to login.\n\nSign up with…",
  "data/reddit-crypto/r/CryptoCurrency/comments/s0jy5e/if_bitcoin_was_at_100k_right_now_people_would_be.json": "As the title says now that we are under 50k people are waiting to buy under 40k.\nPeople always panic to buy when market is at extreme fear while the extreme fear\nis what we wished for when market was pumping like crazy.\n\nEvery 40-50% correction people panic to buy thinking what if it’s a bear…",
  "data/reddit-crypto/r/CryptoCurrency/comments/s0jqoy/im_scared_and_im_tired_of_pretending_im_not.json": "I know, I know, this will be seen as FUD. But it's not. I firmly believe we will\nget better in the mid to long term.\n\nBut this is just reminding me of 2018 too much. Day after day, week after week,\nmy portfolio is losing a few %. With no end in sight. And the reasons are pulled\nout of thin air.…",
  "data/reddit-crypto/r/Bitcoin/comments/s09lc6/is_028_btc_still_an_nobleachievable_goal_for_the.json": "In terms of long term wealth building, eventual payoff, and safety net?\n\nThe 0.28 number seems to always be thrown around, but is there a consensus on\nwhether it's still relevant?\n\nWhen people ask me questions about BTC, I always respond with \"one if you can\nafford it, or as much as you can until…",
  "data/reddit-crypto/r/CryptoCurrency/comments/s0mpq3/who_else_stopped_giving_a_fuck_about_their_losses.json": "This will be seen as Hopium. But it's not. This volatility will be just a blip\nin the long run.\n\nI still believe in crypto no matter how many FUDs and bearish post got upvoted\nto frontpage. This is a rare chance to get a life changing wealth and I will\nnever forgive myself if I didn't take my…",
  "data/reddit-crypto/r/CryptoCurrency/comments/s0j4bp/cryptocurrencies_will_not_kill_fiat_and_people.json": "Many \"advocates\" of cryptocurrencies often say that the revolution is coming to\nus and that cryptocurrencies will take down Fiat.\n\nSometimes individuals remind us that the whole purpose of cryptocurrencies is\nthat a decentralized financial system allows us freedom and independence from a\nthird…",
  "data/reddit-crypto/r/CryptoCurrency/comments/s0lmal/bitcoin_just_dipped_below_where_it_was_a_year_ago.json": "Edit: some people seem to misunderstand the title, let's pretend I wrote\n\"Bitcoin just dipped below where it was a year earlier for the first time in 16\nmonths\", maybe that's more understandable?\n\nEdit2: many of you still don't understand what I'm doing here, I'll try again:\nwhen I wrote the post,…",
  "data/reddit-crypto/r/CryptoCurrency/comments/s0p455/wise_token_and_wisb_token_are_scamming_investors.json": "WISE token and WISB are scamming investors of their money and lining their\npockets under the pretense of \"development\" of over 2 million dollars so far.\nWhen in fact they've been turning it into BUSD, USDC, and various other\ncryptocurrencies.\n\nhttps://www.youtube.com/watch?v=VJVkgGHt33c&t=343s here…",
  "data/reddit-crypto/r/CryptoCurrency/comments/s0oa0j/forget_crypto_the_entire_stock_market_could_crash.json": "As much as I'd love all these signals to be FUD, the truth is, it's not. Even\nthe Crypto market dipping for the two months is largely due to the stock market\ntrending down along with energy prices all over the world. People can say what\nthey want, but the FED has printed way too much money over the…",
  "data/reddit-crypto/r/Bitcoin/comments/s0lrl4/if_you_cant_keep_bitcoin_while_its_down_80_you.json": "So this is one of my favourite quotes that keep my diamond hand HODLing BTC,\nleave yours!\n\nEdit: Yo guys! Thanks for the responses, no matter showing criticism or support.\nI don't really know why people are comparing this situation to being in a toxic\nrelationship, so I will provide another analogy…",
  "data/reddit-crypto/r/CryptoCurrency/comments/s0nzhn/bull_markets_make_you_money_bear_markets_make_you.json": "While everyone enjoys bull markets, green candles and the weekly increasing net\nworth as it pads their ego, bull markets aren't where you get rich. Bear markets\nare the rare opportunity for wealth transfers, and are where crypto millionares\nare made. If you loaded up on $90 ETH and $4K BTC during…",
  "data/reddit-crypto/r/Bitcoin/comments/s0t64w/stop_fcking_crying_already.json": "I went through the same thing in 2018 as what you guys are going through right\nnow. I bought my coins in the hype of 2017, and watched my portfolio decline in\nearly 2018. A 80% decline.\n\nFast-forward now, 4 years later, I have no stress at all and my portfolio is\nstill greener than green.\n\nIn…",
  "data/reddit-crypto/r/CryptoCurrency/comments/s13kkd/every_crypto_sub_is_the_same_post_over_and_over.json": "Please for the love of God stop lecturing imaginary people about not buying\nimaginary past dips and then imaginarily chickening out and not buying this one\neither. This is all happening in your mind. You are delusional. You are talking\nto yourself. And you are making every crypto sub an annoying…",
  "data/reddit-crypto/r/CryptoCurrency/comments/s0wlru/if_you_picked_up_eth_between_29003100_that_is_a.json": "Title says it all, but I know I have to write a bunch of shit here for the post\nto get some traction.\n\nLike many of you, I bought this delicious dip. I'm out of money now, but I have\nan average ETH buy price of $2984...which I think is pretty good. I'm hodling\nthis for the intermediate term because…",
  "data/reddit-crypto/r/CryptoCurrency/comments/s0zv4y/while_were_all_feeling_pain_whats_everyones_worst.json": "Mine was a shitcoin dex aggregator rugpull called octofi. Got cocky from easy\nbull run gains, put about 2k in and sold at about a 90% loss after hodling and\nhoping too long.\n\nThe signs were there that the project was dead. But I was fooled by getting an\nentry 50% below ATH, and seeing a quick 50%…",
  "data/reddit-crypto/r/CryptoCurrency/comments/s13mx2/a_bitcoin_death_cross_is_coming_up_just_a.json": "So once again, we have a \"Death Cross\" looming in the Bitcoin chart.\n[https://www.coindesk.com/markets/2022/01/10/bitcoin-approaches-death-cross-as-goldman-foresees-4-fed-rate-hikes-this-year/]\nThis is a \"bearish\" indicator that occurs when the 50 day MA dips below the 200\nday MA.\n\nI just want to…",
  "data/reddit-crypto/r/CryptoCurrency/comments/s0u545/bitcoin_can_do_whatever_it_wants_im_never_selling.json": "Bitcoin could go up to $150,000 or down to $1,000, either way I’m never going to\nsell it. Bitcoin can go to $1,000,000 or down to $0.50, either way I’m never\ngoing to sell it. This is not an asset you sell.\n\nI’m going to get a lot of slack from people who will retort ‘It’s okay to take\nprofits!’…",
  "data/reddit-crypto/r/CryptoCurrency/comments/s0zny8/its_official_ive_mentally_reached_the_point_of.json": "At the beginning of 2021 I got into crypto and like most newbies I was fomoing\nat the top and panic selling on the dips. I eventually got into a good DCA\nschedule but that’s when the May crash happened and I ended up down a lot. I\nkept buying but I definitely felt sad, defeated, like I might not…",
  "data/reddit-crypto/r/CryptoCurrency/comments/s1a7ft/can_someone_explain_to_me_how_people_fall_for.json": "Seriously I have seen an alarming amout of posts where people have come to this\nsub crying about their mistake/greed after falling for these scams. I am much\nyounger than the average user of this subreddit and I know for a fact that I\nwould never fall for such scams.\n\nSo these scams go something…",
  "data/reddit-crypto/r/CryptoCurrency/comments/s1azjd/alright_i_admit_it_i_work_in_tech_i_have_been_in.json": "Edit to clarify: I like crypto myself, got a punk rock vibe to it. I just don't\nknow what all it gets used for. Also the job in tech is internal tools dev at a\nmedium sized game publisher.\n\nYep. I think about this constantly, I understand the use case for something like\nBitcoin. Transfer money with…",
  "data/reddit-crypto/r/CryptoCurrency/comments/s19tiq/top_10_crypto_stereotypes.json": " 1. Bitcoin maximalist.\n\nDude lives in 2012 and still believes that all coins that aren’t bitcoin are\nscams. He can’t see value in any other project outside bitcoin and worship\npeople like Michael Saylor. Brags about understanding Austrian school of\neconomics but never really read Mises. Constantly…",
  "data/reddit-crypto/r/CryptoCurrency/comments/s1ek6i/calling_everything_in_crypto_a_coin_is_going_to.json": "Title says it all, the 90s were dominated by a singular games console, the\nNintendo to the point where they had almost the entire market share of the home\nvideo games field. It go the point where Nintendo became THE word for a games\nconsole for those that had only a passing knowledge of the…",
  "data/reddit-crypto/r/Bitcoin/comments/s1eo2p/lessons_ive_learned_after_7_years_of_hodling.json": "Back in late 2014 I bought my first coins, here’s what I’ve learned since…\n\n 1.  Hodling is simple, but it isn’t easy.\n 2.  When you get rich very few will be genuinely happy for you. Try to keep\n     your success as quiet as possible.\n 3.  Consistency is key.\n 4.  DCA + smash buying helps soothe…",
  "data/reddit-crypto/r/CryptoCurrency/comments/s1lnoy/youtube_just_terminated_bitcoin_magazines_account.json": "Bitcoin Magazine's youtube account that has been around since 2011 just got\nnuked by Youtube\n\nhttps://www.youtube.com/channel/UCtOV5M-T3GcsJAq8QKaf0lg\n\nBitcoin Magazine\n[https://preview.redd.it/ess5t73m34b81.jpg?width=1330&format=pjpg&auto=webp&s=61777d9442bb83f87477da4a1f3b277e6f8015f5]\n\nThe…",
  "data/reddit-crypto/r/CryptoCurrency/comments/s1k62t/people_dont_want_to_hear_this_but_were_investing.json": "As much as you love the technology behind cryptocurrencies and various projects,\n99% of people are here for money.\n\nAnd as much as they are supporters of cryptocurrencies, 99% of people do it to\nhave more money in fiat currencies so they can achieve their goals.\n\nWhen trading with cryptocurrencies,…",
  "data/reddit-crypto/r/CryptoCurrency/comments/s1kpo1/can_we_all_agree_that_facebook_definitely.json": "Connecting with anyone , anywhere on a completely virtual world sounds like a\ndream, but the reality is far from that. All these metaverse games, Sandbox\n(yes, I know its in alpha, but still) and Decentraland feel like cheap Roblox\nclones, except that you can buy some virtual land for real housing…",
  "data/reddit-crypto/r/Bitcoin/comments/s1w43p/all_hell_is_about_to_break_loose_500k_100_of_my.json": "https://preview.redd.it/m5tw25x8b6b81.jpg?width=1800&format=pjpg&auto=webp&s=a6d98a65a43a4646795b73789b8f0963894b0638\n\n\n\nI've watched on-chain data for years. I'd argue that currently, it's the most\nbullish I've ever seen it, and the micro backdrop looks the same. I'm calling\nfor $500k in the next…",
  "data/reddit-crypto/r/CryptoCurrency/comments/s1oa3l/what_powell_said_today.json": "He said two less hawkish things today that apply to crypto (Yes, I actually\nlistened to the entire stream).\n\nThe first and probably most specific to crypto is that he wasn't against\nstablecoins continuing to exist even if they began to issue a CBDC USD-meaning\nthere's less of a threat that…",
  "data/reddit-crypto/r/CryptoCurrency/comments/s1r20v/whenever_the_cryptocurrencies_i_held_rose_sharply.json": "I died of embarrassment today. Following conversation on Discord:\n\nMe: I've been holding Ethereum since last January and I'm currently up 250%, but\nthat's also because I've sold it and bought it again many times when it was\nrising strongly.\n\nMy friend: Huh? Why is that?\n\nMe (honorary math…",
  "data/reddit-crypto/r/CryptoCurrency/comments/s22aa5/someone_just_took_pictures_of_himself_every_day.json": "Long story short there's OpenSea Collection named \"Ghozaly Everyday\"\n\nhttps://opensea.io/collection/ghozali-everyday\n\nWhich contains photo of literally him sitting behind the computer from 18 to 22\nyears old ( 2017 - 2021 ).\n\nSurprisingly there's a lot of demand and buyers which generate a lots of…",
  "data/reddit-crypto/r/CryptoCurrency/comments/s22ret/fed_has_too_much_power_over_crypto_and_that_was.json": "I've been thinking about this lately.\n\nCrypto was supposed to be decentralized so it would not have a single entity\ncontrolling it. We would not be bond to the whims of a single centralized\ngovernment or private entity.\n\nAnd as of late i've seen crypto being controlled by the fed. They say they…",
  "data/reddit-crypto/r/CryptoCurrency/comments/s24btr/i_would_rather_lose_all_my_money_than_miss_the.json": "The fear is real these days with many people calling that the bull market is\nover. Nobody knows that is going to happen but personally I don't think so and\nin any case I am not selling at all. If anything, I am buying more as I have not\ninvested more than I can afford to lose so I don't care what…",
  "data/reddit-crypto/r/CryptoCurrency/comments/s26ujr/pakistan_is_about_to_ban_crypto_what_will_happen.json": "As the world is rapidly adopting technology, Pakistan keeps banning them. Now\nthey have decided to permanently ban crypto currency.\n\nTo be very honest, they have fucking no clue the fuck they are doing. They are\nbunch of crackpots holding higher grade offices.\n\nNow Im too worried as of every…",
  "data/reddit-crypto/r/Bitcoin/comments/s27apy/how_many_of_you_are_actually_using_bitcoin_as_a.json": "History has shown us from time to time how great it has turned out if a dollar\nwas invested 10 years ago. An asset class coming from less than a 1c to reaching\na 69K$ mark is just insane and with its halving , low supply and higher demand\njust makes the best investment class available for everyone…",
  "data/reddit-crypto/r/CryptoCurrency/comments/s2eh5i/the_mass_adoption_wont_happen_until_apple_of.json": "It's pretty simple really. To get mass adoption to the levels we want, we need\nan iPhone style event into the market, by some massive and already\nwell-established company. Sure LG and other companies made touch screen phones\nbefore Apple did, but Apple did it better and they made it much more…",
  "data/reddit-crypto/r/CryptoCurrency/comments/s29852/if_you_want_mass_adoption_being_an_elitist_to.json": "The past few days I keep seeing people advising not to keep crypto in exchanges\nor stake in them.\n\nThat's fine, they both have pros and cons. But what I hate is how these are\nwritten in a hostile manner like \"You deserve to lose money!\".\n\nNo. nobody deserves to lose money, let alone being laughed…",
  "data/reddit-crypto/r/Bitcoin/comments/s2ajn3/understanding_the_upcoming_inflation_and_why_it.json": "You have probably heard of the money printer going BRRRRRR during the pandemic\nand the currently high inflation resulting from that. You may have also heard\nthat the US federal reserve Bank (FED) and probably also the European Zentral\nBank (EZB) are going to raise interest rates in the coming years…",
  "data/reddit-crypto/r/CryptoCurrency/comments/s2bjdt/if_you_have_more_than_4059_moons_youre_in_the_top.json": "This is an update to This post\n[https://www.reddit.com/r/CryptoCurrency/comments/oovcsk/if_you_have_more_than_617k_moons_youre_in_the_top/]\nI made 6 months ago when the top 1% was at 6.8k\n\nHere are the stats\n\n * 148,288 addresses on the list.\n * 81,571,823 Moons in total.\n * If you have more than…",
  "data/reddit-crypto/r/CryptoCurrency/comments/s2c1wz/to_cro_or_not_to_cro.json": "So i had a shower thought a couple of days ago BTC was floating around £30k and\ni wanted to know your options.\n\nWould you rather own 1 BTC at £30k Stake it at around 6.5% (what you can get on\nthe crypto and other apps) hope it goes to 100k this year and mabey eventually\nafter years x10 and get to…",
  "data/reddit-crypto/r/Bitcoin/comments/s2hvnv/do_you_think_peoples_psychology_of_investing_in.json": "I was just thinking that if someone just learned about Bitcoin and wanted to\ninvest that the price of 44k (at the time of writing) for 1 BTC might deter some\npeople from investing since they might think there's no way I'll ever own 1 BTC.\nBut if the price was being presented and talked about in…",
  "data/reddit-crypto/r/CryptoCurrency/comments/s2gs4z/microsoft_has_a_patent_on_humancryptomining_you.json": "So apparently Microsoft has a real patent on a cryptocurrency mining system that\nuses human body data. No, it's not a joke or clickbait. See for yourself:\n\nhttps://patentscope.wipo.int/search/en/detail.jsf?docId=WO2020060606&tab=PCTBIBLIO\n\nHoly shit.\n\nStraight out of a sci-fi movie. This implies…",
  "data/reddit-crypto/r/CryptoCurrency/comments/s2m2zp/im_genuinely_curious_which_generation_dominates.json": "I assumed back when coins were making new ATHs that my high school students\nwould be talking about it like the release of a new hit Netflix series. No\nstudents would make a passing comment though; however, when talking about the\nnews and Elon, they refer to him jokingly as the Dogecoin guy. So…",
  "data/reddit-crypto/r/CryptoCurrency/comments/s2hjmx/if_you_asked_me_to_lose_money_investing_in_crypto.json": " 1.  See a coin has pumped 5-10% in a day, go all in on that bad boi before the\n     inevitable dip that follows takes you back down to where the price started\n     and you 5-10% lower.\n 2.  Get a random bunch of coins in your wallet, DEFINETELY try and sell them\n     because they are a scam and…",
  "data/reddit-crypto/r/CryptoCurrency/comments/s2xf3b/never_let_them_call_you_lucky_for_becoming.json": "And I speak from experience, once they will know that working became optional\nfor you, they will tell you that you’re lucky of having invested in crypto\nearly.\n\nI started in 2017 and saw my portfolio plummet to next to nothing after the big\npump we all know.\n\nI was in debts but I made it anyway and…",
  "data/reddit-crypto/r/CryptoCurrency/comments/s2xcou/i_do_believe_that_cro_has_finally_delivered_what.json": "I want to point out that I'm not shilling CRO, I have a tiny bag of it, not even\nenough to get the first tier of their debit card. I also want to add that they\nare far from perfect, their app is so ridiculously slow and I hate that I have\nto use a mobile phone instead of a desktop, both drive me…",
  "data/reddit-crypto/r/CryptoCurrency/comments/s30bsi/i_bought_1k_of_the_top_10_cryptos_on_january_1st.json": "EXPERIMENT – Tracking 2018 Top Ten Cryptocurrencies – FOUR YEAR REPORT – UP +34%\n[https://preview.redd.it/dzzes3g8ngb81.png?width=666&format=png&auto=webp&s=4e29ebda29cda106029c3f762a91b8b7d815d509]\n\nFind the full blog post with all the tables here\n[https://toptencryptoindexfund.com/tracking-2018…",
  "data/reddit-crypto/r/CryptoCurrency/comments/s2zvsa/i_am_digging_through_old_posts_and_articles_with.json": "Note: The Article (link below) was published in September 2019, 5 months before\nthe Covid Crash. The Price was around 10 000 USD. The Author called:\n\n * the price will reach $100 000 per bitcoin no earlier than 2021 and no later\n   than 2028. After 2028, the price will never drop below $100 000\n *…",
  "data/reddit-crypto/r/CryptoCurrency/comments/s33a70/kazakhstan_didnt_decide_to_suddenly_shut_off.json": "And surprise you need internet for crypto…\n\n\n\nComing from a person living in Lebanon (a country on the verge of political,\neconomical, and civil collapse) I can tell you that only a self centered asshole\nwill look at what's going on Kazakhstan and just think of Bitcoin.\n\n\n\nThey're having much…",
  "data/reddit-crypto/r/CryptoCurrency/comments/s35jr7/elizabeth_warrens_ex_staffer_has_filed_a_lawsuit.json": "A chap named Kent had invested $10 in a protocol called 'PoolTogether' which\nessentially gamifies the process of saving by offering them a chance to win\nawards from the interest generated by collected funds.\n\nA point to note here is- he was a part of Sen. Warren's team during 2020\npresidential…",
  "data/reddit-crypto/r/CryptoCurrency/comments/s2ybyc/federal_reserve_unfairly_shutting_out_wyomings.json": "To established a Crypto Bank,a company needs SDPI charter from the local\nauthorities then a master account with Federal Reserve to arrange payments with\nCentral Bank and to conduct settlements with other financial institutions.\n\nKraken and Avanti are two entities active in Crypto business ,both…",
  "data/reddit-crypto/r/CryptoCurrency/comments/s35hya/visa_reports_25_of_companies_want_to_accept.json": "Adoption of cryptocurrencies such as bitcoin (BTC) is already well underway.\nHowever, research from Visa\n[https://www.reuters.com/technology/quarter-small-businesses-across-nine-countries-plan-offer-crypto-payments-visa-2022-01-12/]\nshows that 2022 has even more in store for mainstream crypto…",
  "data/reddit-crypto/r/CryptoCurrency/comments/s328qt/polygon_has_announced_that_its_long_awaited.json": "Yesterday, Polygon has announced that it’s long awaited EIP-1559 upgrade is set\nto take place by January 18 (about 8a.m UTC). This upgrade is set to change the\nentire fee market operations on the Ethereum network, as it will be bringing a\ndiscrete fee base that is burned instead of being paid to…",
  "data/reddit-crypto/r/CryptoCurrency/comments/s2tpmx/i_got_scammed_yesterday_from_something_that_i_did.json": "Months ago, when I was new to crypto, I connected my Metamask wallet to a site\nto withdraw some funds. I did this a few times actually without issues. It\nseemed as reliable as any exchange - pancake swap, 1inch, uniswap, raydium,\netc...\n\nThe site was even verified by Haze crypto when I used it…",
  "data/reddit-crypto/r/CryptoCurrency/comments/s3exuk/i_hate_the_fact_that_facebook_a_company_known_for.json": "Or at least used to thrive off of privacy now that there are things like KYC on\nalmost every centralized exchange.\n\nBut still, no centralized exchange will ever be as bad as Facebook’s Meta.\n\nI despise them. They steal our private info to sell to companies for ad\ntargeting.\n\nWatch how the market…",
  "data/reddit-crypto/r/CryptoCurrency/comments/s3fzes/fidelity_is_one_of_the_largest_asset_managers_in.json": "> We also think there is very high stakes game theory at play here, whereby if\n> bitcoin adoption increases, the countries that secure some bitcoin today will\n> be better off competitively than their peers. Therefore, even if other\n> countries do not believe in the investment thesis or adoption of…",
  "data/reddit-crypto/r/Bitcoin/comments/s3fpwd/one_of_the_biggest_events_in_history_has_just.json": "https://investor.ncr.com/news-releases/news-release-details/ncr-completes-acquisition-cryptocurrency-leader-libertyx\n\n\n\nNCR Corp. is one of the most dominate publicly traded fortune 500 companies in\nUS history. They have been traded on the NYSE since 1925 and are worth billions.\nThey are the…",
  "data/reddit-crypto/r/Bitcoin/comments/s3awze/i_invested.json": "I’m 18 years old, working a fast food job I hate. Started investing $50 every\npaycheck. Do you think this is enough? Too little? Any suggestions or tips for\nsomeone new to bitcoin?",
  "data/reddit-crypto/r/CryptoCurrency/comments/s3fwib/as_much_as_i_hate_to_admit_it_the_anti_moon.json": "So After Spending time on this sub for a couple of months and seeing people\ncomplain about moon farmers and constant repost, I am finally going to have to\nagree that the same thing does get posted over and over again. I sort by New due\nto wanting to read and comment on brand new post and I have now…",
  "data/reddit-crypto/r/CryptoCurrency/comments/s35m78/ripple_lawyer_accuses_sec_of_intentional_delay.json": "One of the top lawyers in the Ripple (XRP) camp, Stuart Alderoty, recently\nlashed out at the US Securities and Exchange Commission (SEC) on Twitter.\nAccording to Alderoty, the SEC would deliberately try to delay the lawsuit\nbetween themselves and Ripple as long as possible.\n\n\n\nRipple…",
  "data/reddit-crypto/r/CryptoCurrency/comments/s3qrsk/i_hate_to_say_it_but_a_lot_of_the_newer_crypto.json": "Most newbies think that Crypto is something that will make you rich overnight,\nand they end up investing in low market cap coins before they \"moon\". Of course\na few of them might have the potential to give you great returns, but a lot of\npeople completely end up ignoring the risk…",
  "data/reddit-crypto/r/CryptoCurrency/comments/s3qy01/very_bullish_for_bat_the_amount_of_ad_campaigns.json": "The newest numbers detailing the amount of ad campaigns that are currently\nrunning on Brave worldwide are staggering!\n\nToday there are 5525 campaigns effectively running and being seen by the users!\n\nThese number is a new…",
  "data/reddit-crypto/r/CryptoCurrency/comments/s3nknw/harmony_one_is_down_and_i_hate_it.json": "As of this morning, the Harmony network grinded to a halt yet again. See\nhttps://explorer.harmony.one/blocks/shard/0 for proof. I'm super conflicted on\nhow I feel about this. I have been a ONE supporter and fan from early 2021\nonward, and I'm super excited for the future since amazing dApps are…",
  "data/reddit-crypto/r/Bitcoin/comments/s3saqk/bitcoin_is_digital_gold_history_if_not_repeats.json": "https://preview.redd.it/i5o29ekxmnb81.png?width=700&format=png&auto=webp&s=c25fe2c48eec3268d3b9c99dd34fb083e286ea25\n\nThe IRS revealed earlier this year that it has seized $3.5 billion in the fiscal\nyear 2021. According to reports, the US government has seized 170,000% more\ncryptocurrency this year…",
  "data/reddit-crypto/r/CryptoCurrency/comments/s3zv3b/loopring_a_deep_dive.json": "Hey guys, Im Spragg, I do deep dives into various different coins/tokens on\nyoutube (SpraggTalksMoney), I thought since I’ve already written the scripts for\nmy video anyway I’d post the summary on here too.\n\nIf anyone’s interested in the full un-summarized version the link is…",
  "data/reddit-crypto/r/Bitcoin/comments/s3xhfl/i_opened_a_company_that_rents_private_planes_and.json": "I have been traveling the world for 5 years on a small income from my medical\nretirement from the military and met an amazing woman in South America.\n\nWe just opened a private charter jet company (she has been working in this space\nfor 6 years). And we proudly accept BTC.\n\nI once saw the power in…",
  "data/reddit-crypto/r/CryptoCurrency/comments/s4268h/would_you_take_a_guaranteed_50000_a_year_salary.json": "So let's say you saved this old man's life and he turned out to be rich but he\nalso likes to play with people so as a gift he offers you a yearly salary of\n$50,000 until you die with the condition that you cannot invest any of it, or\n$1,000,000 in any crypto currency you want that cannot be…",
  "data/reddit-crypto/r/CryptoCurrency/comments/s4871s/tesla_will_not_be_accepting_doge_thats_the.json": "So as usual the DOGE moon boys are ecstatic that Messiah Elon posted one of his\npointless tweets... to announce that Telsa would effectively NOT be accepting\nDOGE as payment for any Tesla vehicles.\n\nHere's what Tesla will be accepting DOGE for:\n\n> Tesla Inc (TSLA.O) will accept meme-based…",
  "data/reddit-crypto/r/Bitcoin/comments/s43xq7/congress_to_have_hearing_on_bitcoins_energy_useoh.json": "Congress Announces Hearing on Bitcoin’s Energy Use - CryptoShameless\n[https://cryptoshameless.com/2022/01/congress-announces-hearing-on-bitcoins-energy-use/]\n\nSo the hearing starts next Thursday, Jan 20th. Who's going to be the complete\nfool up there on capitol hill during these hearings? How much…",
  "data/reddit-crypto/r/CryptoCurrency/comments/s41z1x/a_beginners_guide_to_cryptocurrency.json": "What is a blockchain?\n\nIt is an “immutable ledger.” Think about it like a book that lives in the sky.\nEvery time something changes, its written down with magic ink, that when dries,\nnever changes. And there are thousands of copies of these books, all getting\nupdated at the same time. If one is ever…",
  "data/reddit-crypto/r/CryptoCurrency/comments/s4adpl/if_you_hold_solana_accountable_for_going_down_but.json": "I don’t hold any SOL or ONE and I don’t plan to do it (at least not soon) but I\nknow that the majority of this sub is scared of Solana, so scared that they’re\ntrying to spread FUD all the time, as if this sub actually has any influence on\nthe market (you really think 5k upvotes will have literally…",
  "data/reddit-crypto/r/CryptoCurrency/comments/s4hk9c/ticketmaster_watch_out_nft_tickets_are_about_to.json": "Benefits of NFT tickets include:\n\n\n\n * Preventing scams and fake tickets: The blockchain provides a single source of\n   truth for both organisers and ticket holders. The transfer of NFTs from\n   initial sale to any subsequent resale is recorded immutably on the\n   blockchain, so all parties…",
  "data/reddit-crypto/r/CryptoCurrency/comments/s4iozd/remember_nano_this_subs_former_favorite_coin_it.json": "Remember Nano? That coin that really shot up from, like, $0.15 in November 2017\nto $33 two months later? It even was in the top 20 for a bit. Well, I suppose\nmany people on here must have bought close to ATH back then, because they always\nREALLY wanted it to go there again and talked about their…",
  "data/reddit-crypto/r/Bitcoin/comments/s4beq9/am_i_the_only_one_who_hates_using_satoshi_as_the.json": "like, i get that “satoshi” is homage to bitcoin’s creator (even though that\nprobably isn’t their name), but it just doesn’t feel like it fits well.\n“bitcoin” is such a beautiful, logical, and ingenious name thats rolls of the\ntongue (as i would expect from the genius that invented and named it)…",
  "data/reddit-crypto/r/CryptoCurrency/comments/s4hj2z/watched_the_big_short_yesterday_and_was_shocked.json": "If you've never seen the movie I definitely recommend it! This text might\ncontain some spoilers.\n\nI've always heard of the movie 'the big short' but never watched it before. I\nwas shocked at what went down and how totally ignorant people, banks, hedge\nfunds etc were to giving loans or investing in…",
  "data/reddit-crypto/r/CryptoCurrency/comments/s4kuct/who_else_is_ignoring_the_fud_and_feeling_really.json": "Title covers it in a sentence, I've been in crypto for a few years and I'm\nhearing the same tired excuses this January that are repeated every time the\nmarket dips/corrects/crashes.\n\n\"This time it's over\"\n\n\"The experts are saying that the stock markets are going to crash any day now\"\n\n\"BTC was…",
  "data/reddit-crypto/r/Bitcoin/comments/s4m4kc/01.json": "Just hit 0.1 BTC. It is a small achievement, but an achievement nonetheless.\n\nI am using Coinbase Pro.\n\nHODL\n\nAm I doing this right?",
  "data/reddit-crypto/r/CryptoCurrency/comments/s4e68d/i_can_tell_a_lot_of_people_have_lost_hope_towards.json": "I’ve been locked inside for the past 18months and this community has helped me\nso much. It’s not about moon farming, it’s about engagement, learning, writing,\nand community.\n\nBut I can tell people have lost hope, engagement is down, sentiment is negative,\npositive outlooks are low, and that’s okay,…",
  "data/reddit-crypto/r/CryptoCurrency/comments/s4r422/stop_gatekeeping_crypto_adoption.json": "The salty, highly upvoted post mocking dogecoin being accepted at Tesla for some\nitems - the sixth largest company in the world in market cap, and undoubtedly\none of the most visible companies in the world, accepting the purchase of items\nwith cryptocurrency - priced in cryptocurrency and not fiat …",
  "data/reddit-crypto/r/CryptoCurrency/comments/s4vtk9/ripple_is_funding_propaganda_against_bitcoin_by.json": "Ripple labs has been funding \"research\" along with government entities to spread\npropaganda against Bitcoin and mining.\n\nIn 2021, they funded a hit piece that claims energy prices for consumers in New\nYork has increased by $6 per month because of mining.\n\nClaim: Mining drives up household…",
  "data/reddit-crypto/r/CryptoCurrency/comments/s4ulz9/why_we_need_decentralisation_my_youtube_account.json": "I'm a crypto YouTuber, and content writer, but before you start throwing rocks\nat me and call me a shill, I teach people how to build and test cryptocurrency\ntrading algorithms as a means of automating their trading strategies, or simply\nto experiment with algo trading in a safe, testing…",
  "data/reddit-crypto/r/CryptoCurrency/comments/s4g4ay/filmmaker_behind_dont_look_up_and_the_big_short.json": "In an interview\n[https://www.nytimes.com/2022/01/13/opinion/tech-congress-subpoenas.html], Kara\nSwisher asked Adam McKay: “What do you imagine a cryptocurrency-centered movie\nwould look like?”, and this was his answer:\n\n> “It would be about a cryptocurrency that, rather than existing on the\n>…",
  "data/reddit-crypto/r/CryptoCurrency/comments/s5232l/16844_crypto_currencies_80_of_them_are_pure.json": "According to Coin Market cap there are 16,844 cryptos out on the world market\nalthough Coin Gecko shows 12,463. Still, that's a shitload. No wonder some of my\nnon crypto friends think crypto is simply a penny stock market. Those of us in\nthe space know some project have very good intentions and…",
  "data/reddit-crypto/r/CryptoCurrency/comments/s51xy9/i_created_an_application_to_receive_airdrops_on.json": "For the past few months I have been building an application/website where I plan\nto offer different tools to ASA owners in the Algorand network, and I have been\nquite successful in terms of visits and \"customers\" so to speak.\n\nCurrently there are several active airdrops on the site, thousands of…",
  "data/reddit-crypto/r/CryptoCurrency/comments/s552ks/ive_lived_and_breathed_defi_for_over_a_year_now.json": "Defi, decentralized finance, is often referred to as the Wild Wild West of\nCrypto. But after journeying in Defi for over a year, I've learned that the West\nis only 'wild' for the cowboys and mercenaries—they are known as 'degens' around\nthese parts. For this post, I'll provide ways for you to…",
  "data/reddit-crypto/r/Bitcoin/comments/s4w2xn/the_bitcoin_rabbit_hole.json": " 1.  Hear people talk about it for some time, but brush it off\n 2.  Hear about it again and again, be intrigued\n 3.  Search \"What is Bitcoin\" - don't understand shit\n 4.  Invest small amount because why tf not\n 5.  Invest in other coins in top 50 because cool name and logo\n 6.  Yeah value go up,…",
  "data/reddit-crypto/r/Bitcoin/comments/s4lt7r/inflation_the_hard_way.json": "Pepsi guy came into my work, walked over to our vending machines and told me.\n“You might want to make an announcement- bottles are no longer $1.50. Going to\n$1.75.”\n\nLiterally reminded me of hearing “Back in my day soda pop was .50 cents.” This\nhappened right in front of my face. I feel violated…",
  "data/reddit-crypto/r/CryptoCurrency/comments/s5cvhv/why_deflationary_money_can_be_both_a_store_of.json": "Tl;dr/conclusion:\n\nLooking at it from the level of the individual, a deflationary form of money is\nfundamentally a superior form of money to an inflationary currency. The rational\nmove would be to hold such a deflationary form of currency, and to swap into\ninflationary currencies as needed. Given…",
  "data/reddit-crypto/r/CryptoCurrency/comments/s5bmu2/11_ways_cardano_will_scale_in_2022_parameter.json": "On-chain solutions\n\nBlock size increase\n\nThe bigger the block, the more transactions it can carry. Block size was\nrecently increased by 8KB to 72KB (a 12.5% increase); further increases will be\napplied over time based on ongoing system monitoring and overall network health.\n\nPipelining\n\nImproves…",
  "data/reddit-crypto/r/CryptoCurrency/comments/s5hd3q/loopring_has_been_steadily_dumping_with_no_bottom.json": "It seems pretty clear the exponential price action last year was all based on\nhype surrounding GME rumours, there was no actual substance to it therefore the\nprice isn't holding up. The market cap to TVL ratio is still high at 4.5 so I\ndon't see this downtrend ending anytime soon without any new…",
  "data/reddit-crypto/r/CryptoCurrency/comments/s5kyu4/someone_created_1100_nfts_of_herself_wearing.json": "What a time to be living in, you can click pics of yourself, call it a \"DAO\" and\nraise millions of dollars in hours.\n\nThats what Irene did.\n\nIreneDAO selling \\\"Tribe passes\\\". Spend your valuable coins to join her tribe\ni.e private…",
  "data/reddit-crypto/r/CryptoCurrency/comments/s5ca41/im_gonna_say_it_doge_is_not_likely_to_have.json": "A lot of people will get triggered by this but women lie, men lie, numbers\ndon’t. And right now the numbers aren’t on the side of DOGE.\n\n\n\nDOGE is sitting at a whopping $22 billion market cap meaning that any chance at\na pump is very thin and other coins like ELON with a much small market cap…",
  "data/reddit-crypto/r/CryptoCurrency/comments/s5g5ue/btc_isnt_anonymous_if_something_finds_your.json": "There’s more to decentralization than using BTC\n\nI see these people all the time, and I’m sure you do as well. People who think\nthat once they’ve moved on to using BTC, they’re forever freed of taxes,\ninstitutions, the government, and ‘big brother’. Well it doesn’t work that way,\nand those a little…",
  "data/reddit-crypto/r/CryptoCurrency/comments/s5n15p/dont_forget_to_include_income_from_illegal.json": "As if working out your tax for crypto wasn't hard enough, the IRS now want us to\ninclude income from illegal activities as well as report any stolen property you\nmay have,.\n\nAccording to IRS publication 17, the Internal Revenue Service wants taxpayers to\ninclude on their forms “income from illegal…",
  "data/reddit-crypto/r/CryptoCurrency/comments/s5iezf/nfts_just_replaced_shitcoinsmemecoins_as_the_new.json": "I'm talking non-technical wise - meaning I'm not referring about tech the here\nof NFTs or utilities etc. Only the gambling factor of both entity.\n\nSo first off with simple google search of NFT news, you'll see ridiculous\nnumbers floating around here and there.\n\n * Konami Sold This Castlevania NFT…",
  "data/reddit-crypto/r/CryptoCurrency/comments/s588se/what_would_you_do_if_the_bear_market_hits.json": "I for one don’t think it’s here yet but all those bearish posts got me thinking.\nWhat would the majority do during it? We all say we will buy the dip like madmen\nbut do we all really have the balls to do that when we see our portfolio going\n-90%?\n\nI have been in 2 crashes and been DCAing in the…",
  "data/reddit-crypto/r/Bitcoin/comments/s5d6fn/if_you_have_money_in_coinbase_take_it_out.json": "I’m so frustrated and disappointed with Coinbase with what appears to be gross\nnegligence in basic security and customer service.\n\nI opened an account in December and within a week was hacked. The hacker somehow\nwas able to change my phone number for two-factor authentication therefore I am\nunable…",
  "data/reddit-crypto/r/CryptoCurrency/comments/s5ayve/why_an_earth_should_we_pay_such_unfair_amounts_of.json": "Let me preface this post by saying I am NOT ANTI TAX and I know each country has\nit's own taxation laws. I am specifically talking about the USA and the taxation\nsystem generally.\n\nWe must all pay our taxes to keep the world going round. But what really really\ngrinds my gears is the cheek of our…",
  "data/reddit-crypto/r/CryptoCurrency/comments/s5iq18/moodys_has_downgraded_el_salvador_sovereign_debt.json": "When all these rating agencies are in line to issue OR have already issued their\nlatest ratings to companies/countries/states/etc holding cryptocurrency in their\nbalance sheet, this could be a good time to remind ourselves that these rating\nagencies have shown their true colours once when they had…",
  "data/reddit-crypto/r/Bitcoin/comments/s5h87g/were_still_early_evidence.json": "Recently on a financial sub somebody asked how he should invest his money\n(didn’t remember the exact amount, doesn’t matter). I just proposed him in\ncomments to have a look to bitcoin without saying he has to invest or something,\njust look. My answer got -10 votes within minutes and somebody…",
  "data/reddit-crypto/r/CryptoCurrency/comments/s5e39o/2022_just_started_and_ive_already_fucked_up_my.json": "So how did you manage to fuck your portfolio up this year?\n\nI'm not gonna name the coin, but it's one of the few that made some nice profits\nduring this dip.\n\nI owned a nice bag of it and sold a few days before it did those nice gains\nthinking I'd be better off with fiat during the dip.\n\nUsually I…",
  "data/reddit-crypto/r/CryptoCurrency/comments/s5zcma/cryptocom_is_under_hacker_attack_all_withdrawals.json": "During the night some hackers apparently found a way to bypass password and 2FA\nand managed to withdraw coins from some users account.\n\nSome users woke up this morning with their balances empied.\n\nCrypto.com temporarily suspended all withdrawals for all users and it's\ninvestigating.\n\nOfficially…",
  "data/reddit-crypto/r/CryptoCurrency/comments/s5ubnr/if_you_are_wondering_why_celebrities_are_tweeting.json": "Check out what these email offers look like here:\n\nhttps://twitter.com/DisguisedToast/status/1482117771177517056\n\nOf all the #ads and #sponsorships deals out there, NFTs and Crypto pays very\nhigh thanks to how much growth its gotten over the year.\n\nSo if you see shit like…",
  "data/reddit-crypto/r/CryptoCurrency/comments/s5ye9i/to_all_the_lrc_holders_panicking_no_way_you_would.json": "First of all, let me start off by saying I don’t hold Loopring and never bought\nit. Right now I’m seeing some sentiment about holding LRC and panicking because\nit keeps dipping and is not going up.\n\nBreaking news: cryptocurrency are highly volatile and it not only goes up, but\nit may go down…",
  "data/reddit-crypto/r/CryptoCurrency/comments/s60856/yes_we_are_early_in_crypto_but_not_1000_in_btc.json": "Saying that we are early in crypto is not totally true if you are a new investor\nthinking that with $1000 in BTC you will become a millionaire in next couple of\nyears. We are not that early, and I hate when people are leaving that imperssion\non new investors.\n\nWe are early from perspective of…",
  "data/reddit-crypto/r/CryptoCurrency/comments/s63s5x/a_guy_lost_135k_trying_to_trade_feeswtf_tokens.json": "This is literally WTF! Imagine risking your 42 ETH for a newly created token\nthat is not even known much.\n\nA guy lost over $135k while trying to purchase a token named \"fees.Wtf\"\n\nThe user accidentally swapped 42ETH for 0.00004 WTF. ,the actual value of the\ntoken was just $0.000005\n\nThis happened…",
  "data/reddit-crypto/r/CryptoCurrency/comments/s64hwj/gamers_arent_against_nfts_theyre_against.json": "Last year, several gaming studios announced plans to roll-out NFTs on their\nplatforms, and the backlash was swift. Gamers threatened to cancel their Discord\nmembership, Square Enix got criticized for introducing NFTs in Kingdom Hearts,\nUbisoft got panned for a similar NFT program last month...\n\nAt…",
  "data/reddit-crypto/r/CryptoCurrency/comments/s67do4/cryptocoms_immediate_suspension_of_withdrawals.json": "I’ve been a customer of CDC since just after the MCO days and I’ve always been\nbullish on their token and wrote as much on this sub more than once. Also have\nan Icy White and a LOT of crypto staked on The Exchange, in Crypto.com Earn and\n(due to my CRO entry price being well under $0.10) a six…",
  "data/reddit-crypto/r/CryptoCurrency/comments/s68363/bullish_on_cardano_ada_becomes_5th_largest.json": "These news are awesome. Cardano is now the 5th crypto by market cap surpassing\nSolana by more than $6billion.\n\nADA lost about 75% from ATH and is now up 41% in a week! Still a long road to\ngo, but... it is in the right direction: GREEN\n\nThere have been lots of great news around the ecosystem and I…",
  "data/reddit-crypto/r/CryptoCurrency/comments/s6a47p/i_dont_think_the_cryptocomhack_shows_that_you.json": "By now, we've all heard about the crypto.com hack. About 12 hours ago, they\ntweeted that a \"small number of users\" reported suspicious activity on their\naccounts and that they would disable withdrawals for a bit, just to be safe.\nJust ten minutes ago, they tweeted \"Update: Withdrawal services have…",
  "data/reddit-crypto/r/CryptoCurrency/comments/s68z2v/i_almost_got_a_heart_attack_due_to_cdc_hack.json": "Reading all the posts about Crypto.com hack, I quickly login to my CDC app to\ncheck. Sure enough, my funds was down a few thousand dollars as compared to this\nmorning when I last checked them!\n\nI can feel my heart beat rising, knees getting weak, arms are sweaty. I took a\ndeep breath and thought…",
  "data/reddit-crypto/r/CryptoCurrency/comments/s6f0m2/its_pretty_interesting_when_you_get_to_the_point.json": "It puts things into perspective. What even is money if it can come and go so\neasily? Crypto is so relentless in how volatile it is, sometimes you wonder if\nyou'll wake up and be more successful than you ever could imagine.\n\nDoes anyone else relate? I got back into this ages ago, and I've gotten so…",
  "data/reddit-crypto/r/CryptoCurrency/comments/s6bkip/making_sense_of_the_recent_price_movements_where.json": "In this analysis, we will be mainly looking at Bitcoin/USD chart, as that's a\npretty good index for the overall price action in the crypto market, just like\nthe S&P-500 is for the stock markets.\n\nAs we know the Crypto markets and BTC/USDT have been in a clear downtrend for\nthe past few weeks, 10…",
  "data/reddit-crypto/r/CryptoCurrency/comments/s6la2c/taxes.json": "Taxes suck, we all know that.\n\nHere is my pro tip for all of you. I made lots of trades, lots. Not only did I\ndo that, I used mutiple exchanges and even more wallets. So my transaction count\nis quite high.\n\nHere is the real bear though. When you sit here and import everything into your\ncoin tracker…",
  "data/reddit-crypto/r/CryptoCurrency/comments/s6fdgk/remember_the_evidence_that_the_market_is_going_to.json": "Title says it all, for all you new investors that are probably holding\nportfolios in the red right now and are worried about continuing to DCA into\nyour coins because there are people claiming that 'the markets are absolutely\ngoing to crash' were probably the same people that predicted that BTC…",
  "data/reddit-crypto/r/CryptoCurrency/comments/s6fatj/the_crypto_investors_who_are_actually_sticking.json": "We've seen this happen almost every time Crypto dipped in the past. Those who\nfollowed their original strategy and didn't panic, were the ones who eventually\ngot the most out of the market. People that panic not only leave the market with\nlosses, they kill off future potential gains…",
  "data/reddit-crypto/r/CryptoCurrency/comments/s6pwmt/for_those_of_you_not_yet_earning_passive_income.json": "Look no further!\n\nI've created a resource that details interest rates paid on almost 200 different\ncoins by some of the leading exchanges, lenders, and wallets.\n\nIf you're familiar with earning a yield on your coins, jump to the end of this\npost for the link.\n\nIf you're not familiar with earning a…",
  "data/reddit-crypto/r/CryptoCurrency/comments/s6kgk7/eth_fees_are_too_damn_high.json": "Yes, this is a great coin and it is a top technology, and maybe ETH will be\nnumber one but those damn fees..\n\nI say this from the perspective of the average user.\n\nHow to explain to a newcomer who wants to buy, say, an ERC-20 token that he has\nto pay hundreds of dollars to perform ordinary…",
  "data/reddit-crypto/r/CryptoCurrency/comments/s6ug9m/when_bitcoin_goes_to_10k_ill_go_all_in_and_other.json": "I've seen it many times: Bitcoin is at 60K, people say: I wish I could buy at\n40K! Then it goes to 40K and they say: Oh it's going to 30K. When it goes to\n30K, I'll go all in!\n\nThen it reaches 30K and they hope for 10K.\n\nThe opposite also happens, with people saying: When Bitcoin reaches 50K,…",
  "data/reddit-crypto/r/CryptoCurrency/comments/s6vgdr/as_statistically_most_of_you_out_there_have.json": " 1.  I have a drinking problem (made more convincing if you actually have one\n     which if the market keeps dropping you probably will soon).\n 2.  I have a drug problem but I'm getting help.\n 3.  I have a drug problem and I'm never getting help.\n 4.  I have a gambling problem (the best lies are…",
  "data/reddit-crypto/r/CryptoCurrency/comments/s6xtxm/the_scammer_who_received_the_single_largest.json": "So recently a person fell prey to a Bitcoin doubling scam and sent the single\nlargest payment of 26BTC to the scammer.\n\nI found the scammers wallet address and found that the scammer has received a\nwhooping total of 87 BTC(Worth a total of 3.6 mil).\n\nHis bitcoin address has been reported on scam…",
  "data/reddit-crypto/r/CryptoCurrency/comments/s6yn0o/influencers_who_are_paid_to_promote_scamshitcoins.json": "Influencers who are paid to promote Scam-/Shitcoins to their audience on Twitter\nor Instagram deserve to be sued by victims of these rugpulls/ pump and dumps.\n\nInfluencers like Kim Kardashian have promoted Shitcoins like EthereumMax (has\nnothing to do with the actual Ethereum), which dumped hard…",
  "data/reddit-crypto/r/CryptoCurrency/comments/s6zs0q/if_you_dont_have_an_enormous_sum_of_money_in.json": "All of the detailed minutia of crypto is fascinating. Using native wallets,\nstaking, airdrops, cold storage, etc is all great. But if you are trading in the\nhundreds, or even in the thousands....you really don't need to worry about all\nthat.\n\nBetween gas fees, human error, scams, and hackers, you…",
  "data/reddit-crypto/r/CryptoCurrency/comments/s6wiz0/1k_into_the_top_10_cryptos_on_january_1st_2019.json": "EXPERIMENT – Tracking 2019 Top Ten Cryptocurrencies – Three Year Report – UP\n504%\n[https://preview.redd.it/ew27r4nzwfc81.png?width=666&format=png&auto=webp&s=5431713457e57a324bdff53a552b2b845f22823f]\n\n\n\nThe full blog post with all the tables is here\n[https://toptencryptoindexfund.com/tracking-2019…",
  "data/reddit-crypto/r/CryptoCurrency/comments/s7390l/intel_announces_that_its_entering_the_bitcoin.json": "The ISCCC Conference is one of the most prestigious events in the chip industry.\nAt this years conference Intel is set to outline a new \"Bonanza Mine\" processor,\na new chip described as an \"ultra-low-voltage energy-efficient Bitcoin mining\nASIC.\n\nThis means that they will soon compete with the…",
  "data/reddit-crypto/r/CryptoCurrency/comments/s798gh/doge_has_a_single_wallet_with_more_than_2317_of.json": "For comparison, the largest Bitcoin wallet is the Binance coldwallet and it\nholds approximately 1.40% of the current circulating supply while the largest\nEthereum wallet is the Eth2 Deposit Contract which holds 7.6% of all Ethereum.\n\nThe largest Dogecoin wallet, which currently holds $5 Billion in…",
  "data/reddit-crypto/r/CryptoCurrency/comments/s79mzy/crypto_secrets_what_no_one_tells_you.json": "TLDR:\n\nYou're not gonna make it in crypto unless you know the bullshit & secrets that\ngo on beyond the scenes. In this thread i will tell you what you need to know.\nYou may not like it, but it's important if you want to level up.\n\nINTRODUCTION\n\nForget everything you think you know about…",
  "data/reddit-crypto/r/CryptoCurrency/comments/s75lfm/its_criminal_that_youtube_hasnt_put_more_effort.json": "This is getting out of hand. I have been in this space for over two years and\nlearned about scams EARLY on, but just today I saw an advertised live chat\nbetween two well known crypto people and clicked it, saw 9k 'other people'\nwatching, was like wow, sent it to my friend but then thought, oh…",
  "data/reddit-crypto/r/CryptoCurrency/comments/s744jl/now_we_need_to_be_10x_more_careful_of_scams_since.json": "As you all know, Youtube removed dislikes and it's harder to know if a video is\nscam or not. Before youtube removed dislikes, we could understand if a video is\nlegit or scam by it's dislike ratio. Now it has become impossible to determine.\nNow you need to be 10x more careful of possible scam videos…",
  "data/reddit-crypto/r/CryptoCurrency/comments/s7b5mw/which_coin_are_you_certain_will_be_dead_by_2030.json": "So we all know the score, nobody knows fuck about fuck. And on a long enough\ntimescale there’s a good chance 80-90 percent of the current coins will be dead.\n\nBut if you had to put money on it, which one would are you certain will be dead\nby the next decade?\n\nMy choice is Solana, because whilst…",
  "data/reddit-crypto/r/CryptoCurrency/comments/s7l623/why_is_everyone_so_sure_that_crypto_will_always.json": "This isn't fud or anything. I actually have most of my money in crypto so I make\nposts like these somewhat in part for my own sanity too and the discussions on\nthese topics.\n\nI notice a lot of smart people who analyze the market seem to think there's\nalways a strong likelihood of reaching new highs…",
  "data/reddit-crypto/r/CryptoCurrency/comments/s7fwun/types_of_moon_farmers.json": "The Shiller Driller - Comments just one word, \"ALGO\", \"LRC\", \"ONE\" or other\nfavourites on this sub but if asked probably can't explain what it does.\n\nThe Portfolio Updater - Creates a portfolio of coins, based off some theme or\npoint in time (sometimes picked by their child or dog) and provides…",
  "data/reddit-crypto/r/CryptoCurrency/comments/s7pjy5/12_reasons_cardano_cant_scale_in_2022.json": "This post is a reality check on IOHK's latest investor disinformation campaign:\nhttps://iohk.io/en/blog/posts/2022/01/14/how-we-re-scaling-cardano-in-2022/\n\nTldr: It's great to see they are starting to acknowledge Cardano's scalability\nproblem, or at least pumping the brakes on their…",
  "data/reddit-crypto/r/CryptoCurrency/comments/s7pvg2/goldman_sachs_in_2017_only_criminals_use_bitcoin.json": "Goldman Sachs in 2017:\n\n * Predicts that Bitcoin will not work and die\n   \n   * Bitcoin would only be used for fraud and by criminals\n\nGoldman Sachs in 2022:\n\n * Bitcoin is competing with Gold\n\n * Bitcoin could reach for $100,000\n\n * Bitcoin is a legitimate investment\n\nWhat has changed? Bitcoin is…",
  "data/reddit-crypto/r/CryptoCurrency/comments/s7ykio/when_to_buy_and_when_to_sell_bitcoin_an.json": "If you wish to trade Bitcoin, and not just HODL, here is how based on historical\ndata.\n\n\nBUY BITCOIN:\n\nWhen price is below 2 Year Moving Average\n\n\n\n2y MA Buytimes\n[https://preview.redd.it/77o6wlya8mc81.png?width=1326&format=png&auto=webp&s=f63540876c57c395eb0154d84f40734dbc3322fe]\n\nWhen Puell Year…",
  "data/reddit-crypto/r/CryptoCurrency/comments/s7no13/welcome_to_the_crypto_internet_of_sexual.json": "I make £10,000 a month pumping my breast milk for perverts on Onlyfans … now\nI’ve banished ALL my debt\n[https://www.thesun.co.uk/news/17351138/onlyfans-mum-banishes-debt-selling-breastmilk/]\n\n90 Day Fiancé star switches to selling fart jar NFTs\n[https://www.dexerto.com/entertainment/90-day-fiance…",
  "data/reddit-crypto/r/Bitcoin/comments/s78nri/el_salvador_president_to_hold_meeting_with.json": "El Salvador President to hold meeting with Turkey’s President this Thursday.\nWhat would you suggest he tell him?",
  "data/reddit-crypto/r/CryptoCurrency/comments/s81j7j/snoop_dogg_nfts_will_replace_all_ticketing.json": "Benefits of NFT ticketing\n\n\n\n * Preventing fake tickets and scams\n   Blockchain provides a single source of truth for both ticket holders and\n   organizers. The transfer of NFTs from the initial sale to resale is stored on\n   the blockchain immutably so that all parties can prove the ticket’s\n  …",
  "data/reddit-crypto/r/Bitcoin/comments/s7x851/first_time_buyer.json": "So today I set up a Coinbase account and decided to purchase some bitcoin, very\nquickly realised that I’m broke so sadly I couldn’t put any kind of serious\nmoney into it, wish me luck, once I’m working again I’ll be able to invest more\neach time.\n\nI think I should clear something up, when I say…",
  "data/reddit-crypto/r/CryptoCurrency/comments/s7rq0f/why_wall_street_attempts_to_suppress_bitcoin.json": "WallStreet owns, operates, and controls all the clearing houses that trade gold\n(financial institutions that exchange payments, securities, or derivatives).\nThere are more WallStreet paper claims to gold (future contacts and whatnot)\nthan actual gold, so WallStreet and central banks just…",
  "data/reddit-crypto/r/CryptoCurrency/comments/s87rez/cryptocom_fully_reimburses_all_400_people_who_got.json": "Crypto.coms CEO admitted that 400 accounts were breached in a recent hack, and\nthe funds possibly stolen.\n\nHe added that they reimbursed all stolen funds, so there would be no loss for\ncustomers.\n\n> We very quickly stopped it, we paused withdrawals, we fixed it [and] we were\n> back online in about…",
  "data/reddit-crypto/r/CryptoCurrency/comments/s7srty/crypto_scams_how_not_to_fall_for_them_what_to_do.json": "This post is about crypto scams. How not to fall for them. What to do if you\nhave fallen for one. I made a promise with intentions to keep it.\n[https://np.reddit.com/r/CryptoCurrency/comments/s6xtxm/the_scammer_who_received_the_single_largest/] There\nwere money people who commented on my post…",
  "data/reddit-crypto/r/CryptoCurrency/comments/s7ppjp/why_do_people_think_that_the_ban_of_mining_will.json": "Yes it us true that mining crypto consumes a lot of energy, but so do other\napplications and services. Social media platforms and streaming services run on\nhuge server networks that consume way more energy than the crypto mining farms.\nYet crypto gets all the hate? It's especially stupid because…",
  "data/reddit-crypto/r/CryptoCurrency/comments/s89et8/most_people_here_are_in_the_acceptance_stage_now.json": "So 5 stages of grief.\n\n\n\n * Denial\n\n\"nah it's just a correction\"\n\n\"It happens all the time\"\n\n\"Nah it's an extended cycle\"\n\n\n\n * Anger\n\n\"fuck off! It's normal in a bull market, it's not always green! Are you new\nhere?!\"\n\n\"FUD! Gtfo here\"\n\n*A mention of bear market gets downvoted to oblivion\n\n\n\n *…",
  "data/reddit-crypto/r/CryptoCurrency/comments/s8eaoz/cryptocom_introduces_worldwide_account_protection.json": "Just read the security report from Crypto.com in an official press release\nissued barely 3 days after the recent hacking.\n\nI think this is impressive not just for CDC but for the crypto market in\ngeneral, in building confidence in cryptocurrency. This is so vital considering\nhow crypto is still…",
  "data/reddit-crypto/r/Bitcoin/comments/s8cmxt/my_uncle_is_the_best_indicator.json": "My uncle fomos at every top and sells at every bottom. If I purchase when is sad\nand sell when he is happy, I think I can make some serious cash.\n\nRight now, he is depressed...\n\nBuy signal.\n\nThis isn't finance advice do you own research and see for yourself my uncle\nindictor.",
  "data/reddit-crypto/r/Bitcoin/comments/s885am/were_here_to_remind_you_that_the_us_congress_will.json": "The BTC mining industry running on renewable power grew by 1% to 58.5% in 2021.\nBitcoin is going green!",
  "data/reddit-crypto/r/CryptoCurrency/comments/s8dq31/ccip025_algorithmic_moons_pricing_for_reddit.json": "——————————————————————————\n\nProblem\n\nCurrent Special Membership (Paid in MOONs) is not being used due to the simple\nfact that: price is 1,000 MOONs or 5$, no one will choose to pay 1,000 Moons -\nequivalent to paying ~118$!.\n\n——————————————————————————\n\nSolution\n\nRealistic Special Membership Cost,…",
  "data/reddit-crypto/r/CryptoCurrency/comments/s8e9p7/this_is_not_even_close_to_a_bear_market_yet_and.json": "For a bear market to happen, it would take a lot more than just -42% over a\nperiod of 2 months. We've seen as much as -41% being wiped off the market in\n2017 in a matter of weeks, yet the bull run kept continuing for months. It is\nnot unrealistic to expect the same thing could happen now in…",
  "data/reddit-crypto/r/CryptoCurrency/comments/s8hd8o/a_bear_market_is_a_real_financial_term.json": "Some of you here are so delusional. At least daily I see someone saying some\nvariation of \"it hasn't dipped below -irrelevant support- so its not a bear\nmarket!\"\n\nNo. A bear market is an ACTUAL financial term, with an actual definition.\n\n> a bear market has a very specific definition: when the…",
  "data/reddit-crypto/r/CryptoCurrency/comments/s8l23s/i_dont_care_what_meta_facebook_is_doing_for_the.json": "How can I put this🤔\n\nFacebook is like a really invasive stalker or ex who plants bugs and uses tech\nto know your every move, you do like it but every time they get into trouble\nthere you are with your check book bailing them out of jail.\n\nThat's what META is, they are that invasive stalker who…",
  "data/reddit-crypto/r/CryptoCurrency/comments/s88hbt/ccip026_increase_the_time_to_hide_comment_scores.json": "There is a subreddit setting called \"Minutes to hide comment scores\" which does\nexactly what it says. The idea behind this setting is to hide comment scores to\nreduce the bandwagon effect [https://en.wikipedia.org/wiki/Bandwagon_effect].\nThat is to say, visible comment scores introduce cognitive…",
  "data/reddit-crypto/r/CryptoCurrency/comments/s8jsxv/a_cardano_roadmap_cc_style.json": "Cardano is just a whitepaper (2017)\n\nCardano is vaporware (2017)\n\nCardano doesnt even have light wallets (2018)\n\nCardano is centralised ( July 29, 2020)\n\nCardano cannot support NFT (1 March 2021)\n\nno one is developing on cardano, (March 2021 - plutus poineers)\n\nWhat happened to their plan to sign…",
  "data/reddit-crypto/r/CryptoCurrency/comments/s8pw3m/what_was_said_in_the_crypto_hearing_in_congress.json": "The hearing: https://www.youtube.com/watch?v=HWg731-3id8\n\nTLDR: Bullish and interesting\n\nQuestion 1 from Diana Degette to Ari Juels\n\nIs there a way to do Proof of work without wasting energy or electronic waste?\n\nHe answers that there is no other way but there is always Proof of Stake (he\nshills it…",
  "data/reddit-crypto/r/CryptoCurrency/comments/s8x9m1/what_the_hell_happened_this_time.json": "I was drinking coffee with a friend today and one of the conversations was about\ncryptocurrencies and how prices have been dropping lately. I checked on my\nportfolio during the conversation and I saw that everything was green, COSMOS\nwas even up double digits. Great, I said. Maybe this is the start…",
  "data/reddit-crypto/r/CryptoCurrency/comments/s905gr/fill_your_bags_now_last_chance_to_get_btc_over_40k.json": "Alright guys, the time has come and the true crash is about to happen! With\nBitcoin right at the $40k mark, this will be the last time in the foreseeable\nfuture you’ll be able to buy it this high a price. It’s time to go all-in and\nprove that you truly have diamond hands.\n\nSo what is my strategy…",
  "data/reddit-crypto/r/CryptoCurrency/comments/s90grm/expect_to_see_posts_from_people_who_have_over.json": "Bitcoin dropped around to 39k and it was another drop people really didn't\nexpect since earlier today Bitcoin had hit 43k and the whole market was green,\nhell, we even entered a bull market there for a short while. Like 5 minutes.\n\nSo of course everyone who have invested more than they could afford…",
  "data/reddit-crypto/r/CryptoCurrency/comments/s8xsgm/how_to_talk_to_your_friendsrelatives_during_a.json": "Greetings, here are some tried and proven methods on how to talk to people in\nyour life who know you are holding crypto during a bear market.\n\n1. Feign ignorance.\n\nScenario: In a facetime call with your father and he asks you how \"that bitmoney\nof yours is doing\".\n\nResponse: \"Bitmoney? Haha (fake…",
  "data/reddit-crypto/r/CryptoCurrency/comments/s92lhb/over_the_next_2448_hours_dont_make_any_rash.json": "The sub is blowing up as BTC has dropped to a low we were not expecting etc\netc.. FUD is dropping from left right and center and we are expecting a further\ncontraction in the global markets.\n\nYes the BTC $100k dream is long dead for now but that doesn’t mean your\ninvestment isn’t a good one. You…",
  "data/reddit-crypto/r/CryptoCurrency/comments/s96hlv/whats_happening_right_now_a_quick_explanation.json": "WHAT IS GOING ON RIGHT NOW?\n\nOK the price is low right now, prices have been falling and the whole market is\nfearful. Some people much smarter than me would say that this the time to buy,\nbecause this is when people get rich. Buy when there is blood on the street. Be\ngreedy when others are fearful.…",
  "data/reddit-crypto/r/CryptoCurrency/comments/s97zb8/bitcoin_was_supposed_to_be_the_solution_to_big.json": "To be honest, this makes me sad.\n\nAs far as I remember, Bitcoin was thought to be the solution of the fact that\ninstitutions, wall street and big money control the financial world and the\npennies of the simple people from the normal population. And it was more or less\nlike this, in the first…",
  "data/reddit-crypto/r/CryptoCurrency/comments/s98fhs/the_market_is_crashing_and_so_is_crypto.json": "The harsh truth is, the Fed is tightening its monetary policies and they're\ngoing to be raising interest rates very soon. The inflation rate is now too much\nto ignore as the people realize that their buying power is deteriorating faster\nand faster with little being done about it. As money is harder…",
  "data/reddit-crypto/r/CryptoCurrency/comments/s968ad/its_crazy_how_fast_people_lose_faith_in_a_long.json": "Any investor that’s been in the market and made money knows that nothing matters\nbut time. It is a fact that bitcoin trends higher with time. Therefore in a year\nor so we will be laughing at these prices.\n\nWe all say we’re long term investing, but I don’t think people know what a long\nterm…",
  "data/reddit-crypto/r/Bitcoin/comments/s99qu9/bought_560_680_720_it_went_up_to_19000_then_it.json": "My bitcoin journey",
  "data/reddit-crypto/r/Bitcoin/comments/s9algs/bought_at_60k_and_panicking.json": "ok so I was very new to crypto and a victim of thanksgiving dinner,but I need\nhelp should I sell or hold.\n\nok guys I'll HODL but I cant afford to buy a lot more rn,ill just be using the\nDCA strategy 4 now.",
  "data/reddit-crypto/r/CryptoCurrency/comments/s9ad4u/selling_the_rally_is_just_as_important_as_buying.json": "We would all be millionaires if we had a dollar each time someone told us to\nHODL forever. I won't be surprised if some people didn't take profits just for\nthe fear of having \"Paper hands\". I can't vouch for other communities cause I\njust lurk around in this sub, and you will agree with me when I…",
  "data/reddit-crypto/r/CryptoCurrency/comments/s8wmnk/daily_discussion_january_21_2022_gmt0.json": "Welcome to the Daily Discussion. Please read the disclaimer and rules before\nparticipating.\n\n--------------------------------------------------------------------------------\n\n \n\n\nDISCLAIMER:\n\nConsider all information posted here with several liberal heaps of salt, and\nalways cross check any…",
  "data/reddit-crypto/r/Bitcoin/comments/s9atbf/if_youre_not_a_trader_theres_no_point_in_spending.json": "The price of Bitcoin has fallen back below $40K and is currently around $38.5K.\n\nExtreme fear is still prevalent in the market, and some people will still waste\ntheir day watching the Bitcoin price constantly.\n\nIf you're in the Bitcoin world for the long haul, and you've chosen to be a\nHODLer,…",
  "data/reddit-crypto/r/CryptoCurrency/comments/s99yer/we_can_officially_stop_looking_at_5_minute_charts.json": "I am trying to see a positive thing in whats happening now, and my experience\nwith stocks in the past showed me. Bear markets at least are good for getting\nyour life back and stop being agitated or excited about your money, cause its\ndown anyway lol.\n\nWith bitcoin going down to 30k we wont see any…",
  "data/reddit-crypto/r/CryptoCurrency/comments/s9g59n/with_crypto_down_by_40_in_the_last_3_months_if.json": "I'm fairly new in the crypto world, bought most of my portfolio at the ATH of\nNovember and I'm now stuck with an ever shrinking crypto account. I'm also new\nto investment in general, so when I learned about bull and bear markets last\nyear, I thought I understood what they meant. Bull is when people…",
  "data/reddit-crypto/r/CryptoCurrency/comments/s9jitz/i_took_this_subs_advice_today_and_it_was_the.json": "With everything being in the red this week I started listening to all the post\nthat said take a break and enjoy life, stop looking at the charts and go\noutside.\n\nThat's when I made the worst mistake of my life, I Listened to people on\nr/CryptoCurrency [/r/CryptoCurrency].\n\nI put the phone down and…",
  "data/reddit-crypto/r/Bitcoin/comments/s9f5jx/my_average_is_58k_and_i_am_not_selling_until_2030.json": "I am just posting this to make others feel better who are panicking. Trust me if\nyou truly understand what BTC is then you won’t care about short term price\naction. Traditionally 2014 and 2018 had negative returns for BTC and chance is\n2022 will give negative returns but if you plan to hold for 4…",
  "data/reddit-crypto/r/CryptoCurrency/comments/s9n1q3/el_salvador_just_bought_410_bitcoins.json": "Yes, Nayib Bukele has just announced that El Salvador just bought an aditional\n410 Bitcoins, for a total of 15,000,000 USD.\n\n\n\nNayib Bukele Tweet.\n[https://preview.redd.it/k1n842gqb4d81.png?width=742&format=png&auto=webp&s=c561b4fe99afe4235ea1712c0c0afe9a9f00f7e0]\n\nWhen you have an actual country…",
  "data/reddit-crypto/r/CryptoCurrency/comments/s9kmch/five_good_reasons_to_be_bullish_even_tho.json": "Hear ye, hear ye, my dear friends.\n\nToday it hurts, I won't lie. Months and months of unrealized profits, poof,\ngone. We can spend all day moping around, but it won't get us anywhere. Nothing\nhas changed our investment thesis: crypto will improve our world, so in the long\nrun, we'll be rewarded.\n\nI…",
  "data/reddit-crypto/r/CryptoCurrency/comments/s9ll3i/i_read_the_26_page_russian_central_bank_report_on.json": "Tldr: The Russia Federation is not proposing to ban Russian citizens from\nbuying, selling, trading, transferring or hodling crypto (on exchanges outside\nthe Russian Federation).\n\nDisclaimer: Ya ne Russki, nu ya mogu govorite i chitat Russki yazik (I'm not\nRussian, but I can speak and read the…",
  "data/reddit-crypto/r/CryptoCurrency/comments/s9421n/dont_listen_to_anyone_telling_you_to_brave_it_out.json": "The staggering number of posts saying that to be a millionaire you need to brave\nit out stinks of MLM schemes. Half these posts sound like they want to sell me a\ntime share. Everyone should do what is best for them and not listen to others\ntrying to protect their own stack. If those people actually…",
  "data/reddit-crypto/r/CryptoCurrency/comments/s9orf4/where_did_all_the_buy_the_dip_posts_go_that_were.json": "I remember this sub in November was euphoric and was going crazy with buy the\ndip posts when there were 5-15% dips. Why stop the posts now?\n\nNow is the chance to buy that juicy dip. We are almost down 50% from all time\nhighs. What has changed your mind from buying the dip at -15% than -50%?…",
  "data/reddit-crypto/r/Bitcoin/comments/s9j2n3/too_many_people_in_this_sub_who_still_dont_get_it.json": "Bitcoin wasn’t made to be another Wall Street instrument, or an “investment” if\nyou will. It was always about making sound money with predictable and fair\nrules. You don’t make money with Bitcoin, because it is “money”.\n\nJust like gold, first people have to believe it’s a store of value, then a…",
  "data/reddit-crypto/r/CryptoCurrency/comments/s9mpe0/when_to_buy_this_dip_more_dippage_incoming.json": "The market has been tanking like a mother fucker for the past 48 hours. I'm sure\nsome of us are wondering where the bottom is and when to start stocking up on\nshit while it's super low priced.\n\nA big question also is- what will Wednesday look like, more chaos in the market\nor some kind of…",
  "data/reddit-crypto/r/CryptoCurrency/comments/s9ql09/some_good_news_for_today_usdcs_current_supply_on.json": "While many are interested in the ETH/BTC flippening, I think the USDC/USDT one\nis just as important since it signifies that slowly but surely, USDT will lose\nits powerful grip over the centralized exchanges.\n\nWould feel much safer knowing that the market isn’t controlled by a shady coin\nlike USDT…",
  "data/reddit-crypto/r/CryptoCurrency/comments/s9x2ar/the_truth_is_crypto_prices_will_go_even_more_down.json": "This crash is triggered by many factors. Bitcoin is already at 35k$.\n\nWe are yet to see Feds increasing the interest rates which they have to increase\nto curb the inflation\n\nPrediction is that this decision will come by march so during Feb to March the\nchances that crypto prices will increase…",
  "data/reddit-crypto/r/CryptoCurrency/comments/s9yfhs/its_actually_impressive_how_fast_people_lose.json": "Down by 50% ? Rip the crypto market is dead and stocks are superior since they\nonly went down by 2%.\n\nOh crypto is up by 100%? God damn I should yolo my life savings.\n\nOh shit I just lost the mortgage cuz crypto went down by 40% again.\n\nSeriously, why do people get shocked when this happens? If…",
  "data/reddit-crypto/r/CryptoCurrency/comments/s9xsdg/if_youre_in_for_the_long_term_then_these_prices.json": "If you are in the tech for the future, and are building for several years, a\ndrop of 20% should be celebrated. It's weird to think about it, and can even be\ndifficult to look at the sea of red, but its true.\n\nWhether its caused by cascading liquidations rippling across the entire market,\nor a ban…",
  "data/reddit-crypto/r/CryptoCurrency/comments/s9xdgq/and_solana_is_down_again_people_are_unable_to.json": "As liquidations cascaded, Solana went down again.\n\nhttps://status.coinbase.com/incidents/nd9hh1yz3dk3\n\nCoinbase says network wide degraded performance\n\nOne of the main oracles of Solana, Pyth Network is broken and is not able to\ntell the prices of assets across the…",
  "data/reddit-crypto/r/CryptoCurrency/comments/s9xk4w/dont_be_in_denial_this_is_what_bear_market_looks.json": "I’m seeing a lot of posts here and on Twitter, people promoting “buy the dip” or\n“hold tight it’ll bounce back”. Truth is no one knows how far down market will\ngo and if or when it will bounce back. Interest rates are tipped to rise, we are\non brink of a war, Omicron is out of control and the bad…",
  "data/reddit-crypto/r/CryptoCurrency/comments/s9z1k2/this_is_the_best_thing_to_happen_to_crypto_for_a.json": "Yes you read my title right. this market crash and burn is the best thing to\nhappen to crypto for a while.\n\nsure most of us are down over 30%. sure it sucks seeing your investment of hard\nearned money (or not in some cases) capitulate.\n\nhowever that being said, the joy of watching all the armchair…",
  "data/reddit-crypto/r/CryptoCurrency/comments/s9khb0/another_youtube_ark_livestream_scam_450k_stolen.json": "This is out of control.\n\nThis is like the July 2020 twitter hack again, but no media coverage and all\nwithin 2 hours, and 4x as much money.\n\nhttps://www.youtube.com/watch?v=B2AgP4QUxOI ( video #1 this one made 11+ btc in\nan hour)\n\nhttps://www.youtube.com/watch?v=BJclqJ2dbKU…",
  "data/reddit-crypto/r/CryptoCurrency/comments/s9zctz/this_bear_market_actually_revealed_how.json": "For the record I am not including those who were in it since the beginning of\nJuly of last year.\n\nOne bear market was all that it took to send crypto users into total disarray.\nThere are panic sellers, those that fearmonger --HOLY SHIT IT IS GOING TO $0.\nEVERYONE SHOULD PANIC SELL-- and there are…",
  "data/reddit-crypto/r/CryptoCurrency/comments/sa2ezw/this_is_my_first_crypto_crash_and_im_sure_im_not.json": "I'm into Crypto for about 6 months now and this is my first ever serious crash.\nI've never seen such dip before, these double digit red percentages are\nstaggering and hurting my soul. I'm sure it's not only me as most of the people\nentered crypto in 2021.\n\nEveryone has its own strategy to handle…",
  "data/reddit-crypto/r/CryptoCurrency/comments/sa3ywx/if_you_are_panic_selling_instead_of_accumulating.json": "In tough times like these, it’s important to take a BIG step back and remember\nthe plan. It’s pretty simple: buy low, sell high.\n\nI’ve been around the block a few times and let me tell you that the LAST thing\nyou want to be is the last seller in a crash. Those people are the ones who give\ntheir…",
  "data/reddit-crypto/r/CryptoCurrency/comments/sa3wfm/i_will_never_trust_any_of_you_cowards_ever_again.json": "I trusted all of you. You said you would HODL.\n\n\n\nInstead you SODL.\n\nYour bloodlines will be forgotten in history. The gene pool will weed you out as\ninadequate. The future generations, while they last, will be poor and dumb.\n\nIs that what you want for your children and their children? Poor and…",
  "data/reddit-crypto/r/Bitcoin/comments/s9u2wy/if_bitcoin_gets_to_345k_itll_be_the_5th_time_i.json": "I've experienced multiple ≥50% dips in Bitcoin:\n\n1st one: $6k-$3k\n\n2nd one: $13.8k-$6.4k\n\n3rd one: $10.5k-$3.8k\n\n4th one: $64.9k-$28.8k\n\n5th one: $69.1k-$33.9k\n\nWhat did I do every time? I bought and accumulated.\n\nWould I buy again? Already bought and will keep buying if we keep going lower.\n\nWhat…",
  "data/reddit-crypto/r/CryptoCurrency/comments/s9ou6s/daily_discussion_january_22_2022_gmt0.json": "Welcome to the Daily Discussion. Please read the disclaimer and rules before\nparticipating.\n\n--------------------------------------------------------------------------------\n\n \n\n\nDISCLAIMER:\n\nConsider all information posted here with several liberal heaps of salt, and\nalways cross check any…",
  "data/reddit-crypto/r/CryptoCurrency/comments/sa3qe3/el_salvador_never_invest_more_than_your_people.json": "I am pro-crypto for sure, but I see many people in here praising the El\nSalvador/Crypto \"saga\" and I don't understand why?\n\nA week ago, the Credit Rating Agency \"Moody\" downgraded El Salvador's sovereign\nbonds due to their irresponsible and crappy implementation of crypto. Do you\nknow how president…",
  "data/reddit-crypto/r/CryptoCurrency/comments/sa7uqb/the_solana_network_is_rekt_and_unusable_the_sub.json": "The Solana network is totally congested and unusable in anyway right now.\n\nWhen people try send coins out of the wallet it gives 404 error lmao. Tryna\nundtake some coins? Transaction fails. Explorer says 404 error. Some people\nstill wanna take some risk and add collateral and the transactions…",
  "data/reddit-crypto/r/CryptoCurrency/comments/sa8sug/the_market_has_dropped_48_from_its_90_day_high.json": "source: coinbase API. They only have data starting 2016, Jan 1st so this is\nwhere I start my analysis.\n\nsince 2016 this even has occurred 14 times in monthly bins.\n\nmethod:\n\n * I calculated the lagging 90 day high closing price and then figure out how\n   many days and months it took to recover.\n *…",
  "data/reddit-crypto/r/CryptoCurrency/comments/sa8zfr/crypto_will_go_to_5_trillion_in_2022.json": "Yes you heard me it may be half of its ATH right now but Crypto will go to 5\ntrillion dollars this year that’s right in 2022 in fact I guarantee it and this\nIS financial advice.\n\nI don’t know shit about fuck? You are wrong I know this because I did the TA and\nit is set for a massive massive super…",
  "data/reddit-crypto/r/CryptoCurrency/comments/sabao9/el_salvador_irresponsible_for_buying_bitcoin_dips.json": "First let's get something right.\n\nEl Salvador is not down 15 million on Bitcoin investment. That's fake news. El\nSalvador will more than make up for it from mining.\n\nEl Salvador is also not \"investing\" in Bitcoin. El Salvador is looking to\nleverage it's rich natural geothermal energy resources to…"
}