{
  "data/reddit-stocks/r/investing/comments/ufsnuy/warren_buffett_says_markets_have_become_a.json": "https://www.wsj.com/articles/warren-buffett-says-markets-have-become-a-gambling-parlor-11651340230?mod=hp_lead_pos2\n\n“It’s a gambling parlor,” Mr. Buffett said Saturday of the markets over the past\nfew years. He added that he blamed the financial industry for motivating risky\nbehavior among…",
  "data/reddit-stocks/r/stocks/comments/ufxal8/the_stock_market_is_the_greatest_tool_to_build.json": "Look everyone's portfolio is likely looking red, so here's what you need to do:\nLikely doing nothing for now is the right move. Don't sell at a loss. Work more\nhours so you have more money to buy solid, economy defining stocks at a fraction\nof their price they once were and build your retirement…",
  "data/reddit-stocks/r/stocks/comments/ufsocn/warren_buffett_says_markets_have_become_a.json": "https://www.wsj.com/articles/warren-buffett-says-markets-have-become-a-gambling-parlor-11651340230?mod=hp_lead_pos2\n\n“It’s a gambling parlor,” Mr. Buffett said Saturday of the markets over the past\nfew years. He added that he blamed the financial industry for motivating risky\nbehavior among…",
  "data/reddit-stocks/r/stocks/comments/ufy5e8/buffet_finally_starting_his_buying_spree.json": "After watching Berkshire hold their massive cash pile without significantly\ndeploying for years, we are now seeing Buffett make some significant moves. As a\nBerkshire holder I’m excited to see big guys outside of share buybacks. I think\nit’s also worth noting that the notorious value hound is…",
  "data/reddit-stocks/r/stocks/comments/ug3sdi/just_a_friendly_reminder_that_nobody_knows_what.json": "Hello guys!\n\nThe last weeks have been stressful for a lot of folks out there. Some are\nalready calling the bottom, and some are already calling an incoming 30%\ncorrection of SPY. Even the best funds and individuals underperform in the last\nsix months - starting from Nancy's calls to Ackman's…",
  "data/reddit-stocks/r/investing/comments/ufxrja/anyone_investing_in_ev_battery_industry_etfs.json": "The global electric vehicle battery market is projected to grow from $27.30\nbillion in 2021 to $154.90 billion in 2028 at a CAGR of 28.1% in forecast\nperiod.\n\nSauce:https://www.fortunebusinessinsights.com/industry-reports/electric-vehicle-battery-market-101700\n\nSo, I'm looking to park some cash for…",
  "data/reddit-stocks/r/stocks/comments/ufxovr/can_a_true_squeeze_really_happen_with_circuit.json": "I'm not into memes but I'm just curious how this works. I've seen several stocks\nstart to squeeze then get halted. Once they're trading again people tend to sell\noff, so they lose momentum. I'm thinking even the best set up for a short\nsqueeze can't happen with them getting halted like this. Maybe…",
  "data/reddit-stocks/r/stocks/comments/ug7ce0/elon_musk_has_583_of_his_entire_net_worth_pledged.json": "He has over 159 million Tesla shares pledged as collateral for loans. $140\nBillion USD. 58.3% of his net worth. If there is an extreme drop in Tesla's\nshare price those loans will be called and depending on the price of Tesla at\nthe time it could financially ruin him.\n\nDiscuss.",
  "data/reddit-stocks/r/investing/comments/ug94nb/how_does_a_stock_split_help_the_company_if_it_has.json": "I keep seeing the explanation that a stock split is useful for a company because\nit lowers the share price to a level where more people are willing / able to\ntrade it.\n\nMy question is how does this affect the company in any way? I thought IPOs raise\nmoney in the original offering, and then…",
  "data/reddit-stocks/r/investing/comments/ug90qf/portfolio_of_factset_sp_500_predictions_of.json": "See S&P 500 Predictions Weekly chart at the bottom of the\nhttps://insight.factset.com/through-the-looking-glass-predicting-sp-500-constituent-changes\n\nI do not have access to this API but is there any other way to invest in that\nportfolio for a retail investor?",
  "data/reddit-stocks/r/Bogleheads/comments/ug1qww/hedging_against_the_building_and_construction.json": "u/The_SHUN [/u/The_SHUN] brought up an interesting idea of hedging against his\nindustry and I thought about it overnight.\n\nAs an architect (who survived the dotcom and great recession busts) I'm keenly\naware about how this industry is tightly tied to the wider economic health.\n\nI've already done…",
  "data/reddit-stocks/r/investing/comments/uge3lf/the_old_saying_of_sell_in_may_and_go_away.json": "The effect is real, and violates the efficient market hypothesis\n\nhttps://en.wikipedia.org/wiki/Sell_in_May\n\nSell in May and go away is an investment strategy for stocks based on a theory\n(sometimes known as the Halloween indicator) that the period from November to\nApril inclusive has significantly…",
  "data/reddit-stocks/r/Bogleheads/comments/ug76kh/why_did_you_pick_your_certain_fund_provider.json": "NEW to Bogle-ism.\n\nWhen it comes to a \"three fund portofolio\"... is there any diffference between\ngoing with vehicles from Vanguard vs Schwab vs Fidelity... etc.\n\nI know the MF vs ETF debate, and I understand differences in fees, but when it\ncomes to the mix of the funds, anyone have a favorite…",
  "data/reddit-stocks/r/Bogleheads/comments/ugb6uc/permanently_make_treasurydirect_password_field.json": "I can only speak for Greasemonkey and Firefox though I assume that this would\nwork the same with Tampermonkey on Chrome and maybe Edge.\n\nI've seen other posts in the sub about making the password field pasteable but I\nlike this as it's permanent and set and forget.\n\n 1. Get greasemonkey\n   …",
  "data/reddit-stocks/r/investing/comments/ug9eeh/any_investing_books_by_experienced_investors_with.json": "I feel like a successful investment has so many key elements: good business\nmodel, good management team, good (underpriced) valuation, good industry\ntailwinds, and the potential for other investors to realize the same things\nafter you. (You may find a hidden gem, but if no one else realizes it, you…",
  "data/reddit-stocks/r/Bogleheads/comments/ugg8tv/my_target_date_fund_is_down_about_as_much_as_the.json": "I guess I'm looking for some advice here. My Roth IRA is totally in FDKLX\n(Fidelity Freedom Index 2060). It's down -13.39% YTD (and down -8.88% over the\nprevious 1 year period), while the S&P 500 is down -13.86% (and actually down\n-1.45% over the previous 1 year period). I assumed that a target…",
  "data/reddit-stocks/r/wallstreetbets/comments/ug3xvl/student_loan_debts_are_going_to_be_cancelled_just.json": "So joe biden is getting more butt fucked at the polls than an average wsb trader\nis getting fucked at the stock market.\n\nits kinda helping that the media has stopped broadcasting his speeches much of\nit doesn't make absolutely any sense\n[https://www.youtube.com/watch?v=XYu6RgA8yis]. Democrats are…",
  "data/reddit-stocks/r/stocks/comments/uglthk/rumour_apple_and_intel_booked_all_tsmc_n3_2023.json": "DigiTimes is the source of the rumour, an usually well informed Taiwanese\nsemiconductor newspaper. AMD is selling 7 nm Zen 3 since 2020 and is expected to\nlaunch N5 Zen 4 later this year. If AMD N3 production capacity is delayed they\ncould decide to produce Zen 5 on N5 or N4.\n\nAMD reports 2022Q1…",
  "data/reddit-stocks/r/stocks/comments/ugnsb9/european_stock_market_flash_crash_this_morning.json": "I haven't seen a thread on the brief 'flash crash' that hit some European\nmarkets this morning. Particularly the Nordic markets:\n\n\n\n> The OMX Stockholm 30 Index slumped as much as 8% in just five minutes before\n> recovering most of the losses shortly after. The index was trading 1.1% lower\n> as of…",
  "data/reddit-stocks/r/stocks/comments/ughgxt/is_there_any_positive_news_this_coming_week.json": "I need to sell some msft and apple asap for personal reasons. I have about 4\nweeks during which this needs to happen.\n\nShould incur losses Monday and run? I am wondering if there will be any positive\nnews this week to stabilize things. I know that markets take into consideration\nthe coming…",
  "data/reddit-stocks/r/Bogleheads/comments/ugobvk/when_putting_my_emergency_fund_into_ibonds_im.json": "title",
  "data/reddit-stocks/r/stocks/comments/ugo67f/hot_takes_from_berkshirehathaway_shareholder.json": "In their 90s and still kicking. Buffett and Munger gave their best \"I told you\nso\" talks at Berkshire Hathaway’s annual shareholders meeting this weekend.\n\nBuying the dip? Berkshire scooped up $51.1 billion of US stocks during the\nmarket sell-off in Q1.\n\nFollow the money: Here's what they're…",
  "data/reddit-stocks/r/investing/comments/ugpunm/selling_stocks_in_a_high_inflation_environment.json": "Cash is a guaranteed to lose buying power.\n\nDo the sellers just think that they can time the market even though they will\nalways be late?\n\nI was talking to someone in a bar the other day and they just sold their house\nbecause they wanted to \"sell at the top\".\n\nThere are a ton of new jobs coming to…",
  "data/reddit-stocks/r/wallstreetbets/comments/ugoc3x/if_ericks_position_moves_0001_up_he_gets_a.json": "Last time TSLA rally of 7 days made it go up 34.4%. He could potentially make\n$34.4Tn in the span of a week.\n\nWhich would realistically make him the first trillionaire on this planet.\n\nBecause he bought calls.. for the company… of the guy.. that’s almost the first\ntrillionaire.\n\n…\n\nI’m buying TSLA…",
  "data/reddit-stocks/r/Bogleheads/comments/ugsceh/this_sub_has_completely_changed_my_life_thank_you.json": "I found out about index investing at the age of 20, a few months before my first\ninternship. After I found out, I put every penny of money into different index\nfunds and let it sit while i continuously invested. I worked part time for the\nsame company during my junior year of college, and then full…",
  "data/reddit-stocks/r/stocks/comments/ugtlv5/after_amzn_released_its_earnings_report_the_stock.json": "AMZN reported a first-quarter loss of $3.84 billion, or $7.56 a share. In the\nfirst quarter of last year, Amazon reported a profit of $8.1 billion, or $15.79\na share.\n\nAMZN said Thursday that it expects second-quarter revenue to be in the range of\n$116 billion to $121 billion, below the average…",
  "data/reddit-stocks/r/Bogleheads/comments/ugfe33/questions_about_the_effect_of_buybacks_on_the.json": "Okay, this might be a silly question, but I've been thinking about this for a\nfew days:\n\nLet's stick with SP500. Since 1982, companies started returning value to\nshareholders by share repurchasing (buying back their own stock) in addition to\ndistributing dividends. My understanding is that when…",
  "data/reddit-stocks/r/stocks/comments/ugvnef/eighteen_months_laterback_where_i_started.json": "I started investing in October 2020, using dollar cost averaging strategy over\nthe last several months. My profits peaked several months ago at +16k. Now it's\ndown to 1k, nearly all my profits gone. A savings account would've been better.\nTell me this is fine. I don't need the money now, and QQQ is…",
  "data/reddit-stocks/r/stocks/comments/ugxkm0/russia_looking_to_close_out_their_conflict_in_may.json": "> US intel reports Russia will try to annex Donetsk and Luhansk regions by\n> \"mid-May,\" ambassador says\n> \n> The US has “highly credible” intelligence reports that Russia will try to\n> annex the separatist-occupied regions of Donetsk and Luhansk “some time in\n> mid-May,” and that there are plans to…"
}