{
  "data/reddit-ask/r/AskHistorians/comments/ovi5ug/why_didnt_the_vikings_progress_to_building_bigger.json": "Why didn't the Vikings progress to building bigger, multi-deck ships (as did the Greeks and Romans)? After all those trips to England in open rowboats, how come a Sven never balked and said, \"Screw this, Bjorg, we need a bigger boat.\"",
  "data/reddit-ask/r/AskHistorians/comments/ovilbc/ive_read_the_master_and_margarita_by_mikhail.json": "I've read \"The Master and Margarita\" by Mikhail Bulgakov was written in response to the aggressive censorship of art by the Russian Government. Was the book itself subject to any censorship and if so, what was censored and why?",
  "data/reddit-ask/r/AskHistorians/comments/ovmwof/was_tipping_culture_always_a_thing_in_the_usa_how.json": "Was tipping culture always a thing in the USA? How and why did it start, and why is it primary only for restaurant workers?",
  "data/reddit-ask/r/AskHistorians/comments/ovtntf/how_did_gold_silver_and_bronze_become_the.json": "How did gold, silver, and bronze become the standard first, second, and third place medals?",
  "data/reddit-ask/r/AskHistorians/comments/ow2l8l/is_there_a_reason_only_a_few_european_cuisines.json": "Is there a reason only a few European cuisines incorporated the spiciness of chili peppers after they were introduced to Europe? Are there spicy French, German, out English dishes I'm just unaware of?",
  "data/reddit-ask/r/AskHistorians/comments/owboi7/missionaries_to_ming_china_reported_that_even.json": "Missionaries to Ming China reported that even beggars lived like kings did in Europe. Assuming this to be hyperbole, how prosperous was China under the height of Ming power?",
  "data/reddit-ask/r/AskHistorians/comments/owmiz6/i_often_hear_jokes_or_halfjokes_that_masculinity.json": "I often hear jokes or half-jokes that \"masculinity is always in crisis\" from historians. What does this mean and how has this crisis manifested historically?",
  "data/reddit-ask/r/AskHistorians/comments/owvi7g/the_regions_of_africa_once_labelled_by_colonizers.json": "The regions of Africa once labelled by colonizers as the Pepper/Grain Coast, Gold Coast and Slave Coast were all renamed as they became independent and are now the countries Ghana, Liberia, Togo, Benin and Nigeria. Why did the Ivory Coast never change its name?",
  "data/reddit-ask/r/AskHistorians/comments/ox1wcz/the_popes_rebuilt_rome_during_the_renaissance.json": "The Popes rebuilt Rome during the Renaissance, creating massive basilicas like St. Peter's, funding amazing sculptures and paintings, and importing expensive marble and precious metals. But Rome was not a rich city. Where did they find the money?",
  "data/reddit-ask/r/AskHistorians/comments/ox4muw/why_do_communist_revolutions_historically_tend_to.json": "Why do communist revolutions historically tend to result in totalitarian regimes? Are there any exceptions to this process?",
  "data/reddit-ask/r/AskHistorians/comments/oxs4av/do_you_have_your_askhistorians_digital_conference.json": "Do you have your AskHistorians Digital Conference swag yet?",
  "data/reddit-ask/r/AskHistorians/comments/oxu987/in_1980_the_usa_led_a_66nation_boycott_of_the.json": "In 1980 the USA led a 66-nation boycott of the Summer Olympics in Moscow in protest of the Soviet invasion of Afghanistan. Was the USA was genuinely motivated by moral outrage over the invasion, or was it merely a pretext to boycott as an expression of Cold War propaganda?",
  "data/reddit-ask/r/AskHistorians/comments/oxyyf1/before_the_invention_of_corrective_lenses_what.json": "Before the invention of corrective lenses, what would someone with very bad vision do to make a living/survive?",
  "data/reddit-ask/r/AskHistorians/comments/oxzjfi/in_1911_kanno_sugako_was_executed_for_her_role_in.json": "In 1911, Kanno Sugako was executed for her role in a plot to bomb the emperor. She advocated for gender equality and overturning the political hierarchy as a means to do it. What was the state of contemporary socialist and anarcha-feminist thought, and who were some influential predecessors?",
  "data/reddit-ask/r/AskHistorians/comments/oy8xde/ive_heard_that_the_i_was_only_following_orders.json": "I’ve heard that the “I was only following orders” excuse is a bad excuse the nazis on trial used, so I’m curious what did happen to people who didn’t follow the orders in the nazi regime?",
  "data/reddit-ask/r/AskHistorians/comments/oz6rrn/why_does_christianity_forbid_polygamy_and_islam.json": "Why does Christianity forbid polygamy and Islam allow it? Does it go back to pre-abrahamic traditions in Europe vs. the Middle East?",
  "data/reddit-ask/r/AskHistorians/comments/oz8xmt/how_did_timbuktu_become_one_of_the_goto_far.json": "How did Timbuktu become one of the go-to \"far away/exotic\" places to reference in Western/Anglo popular consciousness?",
  "data/reddit-ask/r/AskHistorians/comments/ozjau5/im_looking_to_read_ten_books_that_will_cover_all.json": "I'm looking to read ten books that will cover \"all\" of world history from its beginning; what ten books should I read?",
  "data/reddit-ask/r/AskHistorians/comments/ozybu5/president_andrew_jackson_had_a_pet_parrot_poll.json": "President Andrew Jackson had a pet parrot \"Poll\" who famously had to be removed from the funeral for swearing. My question is , whatever happened to Poll?",
  "data/reddit-ask/r/AskHistorians/comments/p00mv1/how_did_mint_become_the_predominant_breath.json": "How did mint become the predominant breath freshening flavor?",
  "data/reddit-ask/r/AskHistorians/comments/p011dc/in_rome_powerful_men_would_brag_about_how_many.json": "In Rome, powerful men would brag about how many clients they had as a way of showing off their influence. How many was it normal to accrue? Did clients double-dip and sign up with multiple patrons? Was it prestigious to sign up the poorest citizens, or only those of at least modest means?",
  "data/reddit-ask/r/AskHistorians/comments/p04foa/detroit_tried_to_get_the_summer_olympics_from.json": "Detroit tried to get the summer Olympics from 1952 through 1972. Why did Detroit try to get the Games (unsuccessfully) for so many years and why did they stop after 1972?",
  "data/reddit-ask/r/AskHistorians/comments/p07175/how_fast_did_news_travel_in_ancient_times_for.json": "How fast did news travel in ancient times? For example, in 1066, how long did it take everyone in England to find out that there was a new king?",
  "data/reddit-ask/r/AskHistorians/comments/p0v0m6/how_did_athletes_from_around_the_globe_get_to_the.json": "How did Athletes from around the globe get to the Olympic host nation in 1896?",
  "data/reddit-ask/r/AskHistorians/comments/p130gk/during_the_london_blitz_were_there_people_who.json": "During the London Blitz, were there people who kept their buildings lit insisting that it was “my building, my right”?",
  "data/reddit-ask/r/AskHistorians/comments/p1oj44/someone_on_an_ask_reddit_thread_claimed_research.json": "Someone on an Ask Reddit thread claimed research indicates that prior to Ptolemy VIII exiling academics from the Library of Alexandra, \"they were only about ~300 years from full on industrialization.\" Is this true? If so, where can I learn more about it?",
  "data/reddit-ask/r/AskHistorians/comments/p1yk21/how_did_escaping_slaves_and_jews_during_the.json": "How did escaping slaves and Jews during the Holocaust keep their babies quiet when hiding? As a new parent, there seems little that could be done in an emergency situation.",
  "data/reddit-ask/r/AskHistorians/comments/p2476l/lee_harvey_oswald_applied_to_work_at_the_texas.json": "Lee Harvey Oswald applied to work at the Texas School Book Depository over 2 months before Kennedy's assassination. How did he know to do this? Was JFK's motorcade route announced several months in advance?",
  "data/reddit-ask/r/AskHistorians/comments/p2aw26/were_living_in_an_age_where_atheism_is_slowly.json": "We're living in an age where Atheism is slowly becoming mainstream and replacing religiousness, has this ever happened in the past or are the last two centuries' behaviors novelty for history?",
  "data/reddit-ask/r/AskHistorians/comments/p2cnx3/a_professor_of_mine_said_the_concept_of_boredom.json": "A professor of mine said the concept of boredom was a 19th century \"invention\" of the bourgeoisie. What does this mean exactly?",
  "data/reddit-ask/r/AskHistorians/comments/p2ekha/after_the_rape_of_nanking_japanese_troops.json": "After the Rape of Nanking, Japanese troops continued to occupy the city for almost eight years. What was life like in the city during the years after the massacre while still under Japanese occupation?",
  "data/reddit-ask/r/AskHistorians/comments/p2lgyu/how_did_marriage_come_to_be_a_universal_tradition.json": "How did marriage come to be a universal tradition, that almost all cultures have, even before the modern era?",
  "data/reddit-ask/r/AskHistorians/comments/p3a8lu/how_comparable_is_the_european_concept_of_divine.json": "How comparable is the European concept of 'Divine Right' in the Early Modern period and the most standard Chinese interpretation of the 'Mandate of Heaven'? If they are not comparable, what differentiates them?",
  "data/reddit-ask/r/AskHistorians/comments/p3twsz/gordon_lightfoot_released_his_hit_song_the_wreck.json": "Gordon Lightfoot released his hit song \"The Wreck of the Edmund Fitzgerald\" less than a year after the ship sank. Was there any controversy at the time surrounding the quick release? Was the song viewed as exploitative?",
  "data/reddit-ask/r/AskHistorians/comments/p3z4j1/what_was_stalinss_end_goal_with_the_ethnic.json": "What was Stalins's end goal with the ethnic cleansing of Crimean Tatars, Balkars, Chechens, Meskhetian turks etc? Did he fear the connection between these Caucasus groups and Turkey due to the Islamic common ground?",
  "data/reddit-ask/r/AskHistorians/comments/p47bj6/ive_seen_japanese_artwork_from_the_edo_era_and.json": "I’ve seen Japanese artwork from the Edo era and before depicting Tigers. Did tigers ever inhabit the islands of Japan? If not, how might a Japanese person encounter a tiger before the Meiji era?",
  "data/reddit-ask/r/AskHistorians/comments/p4jxyu/death_squads_throughout_1980s_central_america_are.json": "Death squads throughout 1980s central america are known to have received money from the US government and counterinsurgency training from its military. Was the US military aware that its training was used on civilians? Was the training designed specifically to be used on civilians?",
  "data/reddit-ask/r/AskHistorians/comments/p54wwy/soap_was_first_invented_around_2800_bce_this_was.json": "Soap was first invented around 2800 BCE. This was literal thousands of years before we discovered bacteria and viruses or came up with germ theory. Did we just get really lucky that soap kills these microorganisms?",
  "data/reddit-ask/r/AskHistorians/comments/p5kefr/tent_cities_are_increasingly_common_in_the_us_but.json": "Tent cities are increasingly common in the US, but I don't remember any from when I was a kid (80s-90s); I know they were common also at the heights of the Depression (or was this a myth?); how was this remedied then? Was it addressed by government action, private actors, or a mix?",
  "data/reddit-ask/r/AskHistorians/comments/p5r73n/in_the_disney_film_frozen_the_king_and_queens.json": "In the Disney film Frozen, the king and queen's ship disappears in a storm (fandom sleuths suggest it was 1840) and Princess Elsa is coronated three years later. In the mid-1800s, how long would a ship need to be \"missing\" before the passengers were presumed dead?",
  "data/reddit-ask/r/AskHistorians/comments/p5xgqa/has_there_ever_been_a_major_society_with_no.json": "Has there ever been a major society with no religious beliefs/ cult beliefs/ spirituality of any kind?",
  "data/reddit-ask/r/AskHistorians/comments/p6559y/given_that_they_had_been_together_for_over_15.json": "Given that they had been together for over 15 years, why did Hitler bother getting married to Eva Braun when they both had just 40 hours to live? Was it genuine affection, just something on his bucket list, or was there some legal consequence of dying a married man?",
  "data/reddit-ask/r/AskHistorians/comments/p66hxs/with_the_talibans_takeover_of_afghanistan_some.json": "With the Taliban's takeover of Afghanistan some newspapers wrote as their heading 'Afghanistan back to Medieval times' or something alike. Now we all know that the Taliban and the Afghanistan situation are a modern fenomenon. But what was Afghan Medieval society really like?",
  "data/reddit-ask/r/AskHistorians/comments/p6jo5g/did_bosses_really_just_go_to_their_employees_for.json": "Did bosses really just... Go to their employees' for supper in 1950s America, like in sitcoms?",
  "data/reddit-ask/r/AskHistorians/comments/p7585m/did_the_distinction_between_heavy_and_light.json": "Did the distinction between \"heavy\" and \"light\" infantry/cavalry exist in history, or is this a modern designation applied in hindsight?",
  "data/reddit-ask/r/AskHistorians/comments/p8btrf/why_did_the_green_movement_end_up_so_opposed_to.json": "Why did the Green movement end up so opposed to nuclear energy?",
  "data/reddit-ask/r/AskHistorians/comments/p8svqr/how_do_historians_combat_the_false_idea_that.json": "How do historians combat the false idea that Hitler and Mussolini were left wing? What resources are there to refute this?",
  "data/reddit-ask/r/AskHistorians/comments/p8tg5l/why_were_chariots_such_a_battlefield_advancement.json": "Why were chariots such a battlefield advancement? Wouldn’t a horseman shooting arrows from on horseback be equally effective, if not more, because a chariot’s wheels could get stuck in obstacles?",
  "data/reddit-ask/r/AskHistorians/comments/p911g1/in_the_movie_nuremberg_when_footage_of_the.json": "In the movie “Nuremberg”, when footage of the Holocaust is shown during the trial, there is pin-drop silence in the courtroom. Then one judge abruptly gets up to leave and vomit, followed by the rest. Is this dramatization or did the Allies have this strong of a gut reaction to the Holocaust?",
  "data/reddit-ask/r/AskHistorians/comments/p99jas/nowadays_we_look_back_at_victorian_capitalists.json": "Nowadays we look back at Victorian capitalists like Vanderbilt or Morgan in a pretty negative light. \"Robber Barons\", etc. But at the time, did they have \"fans\" like Elon Musk does today? Were they as visible in the media as people like Musk or Bezos are today?",
  "data/reddit-ask/r/AskHistorians/comments/p9o7o2/reading_about_american_slavery_i_am_struck_by_how.json": "Reading about American slavery, I am struck by how much enslaved people resisted their condition. This many sound ignorant, but how did they know there was an alternative? E.g. in Mauritania one of the cited problems of ending slavery is that slaves in isolated villages cannot imagine another life.",
  "data/reddit-ask/r/AskHistorians/comments/p9prsx/what_would_native_americans_do_when_a_tornado_came.json": "What would Native Americans do when a tornado came?",
  "data/reddit-ask/r/AskHistorians/comments/p9s8s7/i_often_wonder_what_historically_has_happened.json": "I often wonder what historically has happened near my home, or places I visit. Is there a \"Google Maps\" of Local History?",
  "data/reddit-ask/r/AskHistorians/comments/p9wr87/during_the_20th_century_were_the_decades_of_the.json": "During the 20th Century, were the decades of the 1800s remembered as distinctively as the decades of the 1900s are now?",
  "data/reddit-ask/r/AskHistorians/comments/p9xpe1/nepal_is_considered_to_have_been_never_colonized.json": "Nepal is considered to have been \"never colonized\" while Kuwait is accepted as having been a British colony, yet both were British protectorates. Why is this? What were the differences?",
  "data/reddit-ask/r/AskHistorians/comments/pac4bg/the_popular_understanding_of_ww1_holds_that_in.json": "The popular understanding of WW1 holds that, in 1914, the major powers had no idea how brutal, costly, and prolonged the war would be. Were the expectations really that unrealistic, or is this narrative inaccurate?",
  "data/reddit-ask/r/AskHistorians/comments/padztg/if_the_ancient_romans_considered_the_pyramids_of.json": "If the Ancient Romans considered the Pyramids of Giza to be ancient, what did the people who build the Pyramids consider ancient?",
  "data/reddit-ask/r/AskHistorians/comments/paldnc/china_is_overwhelmingly_han_but_was_ruled_by_the.json": "China is overwhelmingly Han, but was ruled by the minority Manchu group until 1917. What is the legacy of this ethnic mismatch? Does modern China have Manchu people disproportionately holding high offices, the way that former European nobility does?",
  "data/reddit-ask/r/AskHistorians/comments/pbbpj6/slovakia_was_under_hungarian_rule_for_almost_one.json": "Slovakia was under Hungarian rule for almost one thousand years. How could they maintain their culture, language and nationality?",
  "data/reddit-ask/r/AskHistorians/comments/pbf83u/ive_heard_that_george_washington_mandated_his.json": "I've heard that George Washington mandated his troops get vaccinated for smallpox, but this must have been well before the germ theory of disease was invented. How did people think that vaccines worked and how were they administered? Was technology advanced enough to make needles?",
  "data/reddit-ask/r/AskHistorians/comments/pbkwye/xpost_reddits_unwillingness_to_properly_contain.json": "[X-Post] Reddit's unwillingness to properly contain COVID-19 misinformation is part of a broad trend of inadequate action by the Admins against bad faith actors. We stand with our fellow mod teams in calling on reddit to improve.",
  "data/reddit-ask/r/AskHistorians/comments/pbsty7/incels_seem_like_a_modern_emergent_phenomenon_but.json": "Incels seem like a modern emergent phenomenon but their problems aren't uniquely modern. Is there evidence of incel-like groups or behaviour in older civilizations?",
  "data/reddit-ask/r/AskHistorians/comments/pc3b81/what_made_akira_such_a_groundbreaking_and.json": "What made Akira such a groundbreaking and influential animated film?",
  "data/reddit-ask/r/AskHistorians/comments/pc98iv/in_1848_the_milanese_planned_to_quit_smoking_and.json": "In 1848, the Milanese planned to quit smoking and gambling in order to starve their Austrian overlords of tax revenues, who in turn sent in thousands of soldiers with 6 cigars each with orders to 'smoke provocatively'. Why did anyone take any of this bizarre plan seriously?",
  "data/reddit-ask/r/AskHistorians/comments/pcorgh/john_wayne_called_high_noon_1952_the_most.json": "John Wayne called High Noon (1952) the most \"un-American\" thing he had ever seen. What was the cultural significance of this movie that prompted him to say this?",
  "data/reddit-ask/r/AskHistorians/comments/pcyt3z/how_did_early_people_get_the_idea_to_smelt_metal.json": "How did early people get the idea to smelt metal",
  "data/reddit-ask/r/AskHistorians/comments/pd9fq0/happy_10th_birthday_askhistorians_thank_you.json": "Happy 10th Birthday AskHistorians! Thank you everyone for a wonderful first decade, and for more to come. Now as is tradition, you may be lightly irreverent in this thread.",
  "data/reddit-ask/r/AskHistorians/comments/pdioeo/star_wars_the_empire_strikes_back_was_initially.json": "'Star Wars - The Empire Strikes Back' was initially released to mixed reviews. What were the criticisms of the film, and why did the reception change over time to where it is now considered to be one of the best films ever made?",
  "data/reddit-ask/r/AskHistorians/comments/pdq37w/why_is_the_spanish_inquisition_more_wellknown.json": "Why is the Spanish Inquisition more well-known than e.g. the Portuguese or Roman inquisitions? Was it larger or more influential on world history or both?",
  "data/reddit-ask/r/AskHistorians/comments/pejk27/how_old_is_the_game_of_peekaboo_have_humans.json": "How old is the game of peek-a-boo? Have humans always enjoyed messing with babies’ lack of object permanence?",
  "data/reddit-ask/r/AskHistorians/comments/pejv5c/how_did_the_story_of_the_extinction_of_the_dodo.json": "How did the story of the extinction of the Dodo become so famous, compared to other animals that might have gone extinct due to human hunting or similar reasons?",
  "data/reddit-ask/r/AskHistorians/comments/pfeb9w/how_much_money_actually_was_the_30_pieces_of.json": "How much money actually was the 30 pieces of silver that Judas was paid for betraying Jesus? Was this the price of a new pair of sandals or are we talking a nice house in downtown Jerusalem?",
  "data/reddit-ask/r/AskReddit/comments/ov6d2b/if_you_could_insert_a_single_rubber_duckie_into.json": "If you could insert a single rubber duckie into any moment in history, where & when would it cause the most chaos?",
  "data/reddit-ask/r/AskReddit/comments/ovbclv/people_who_stay_awake_late_in_the_middle_of_the.json": "People who stay awake late in the middle of the night, what are you doing?",
  "data/reddit-ask/r/AskReddit/comments/ovciok/what_are_the_best_adult_jokes_that_are_hidden_in.json": "What are the best adult jokes that are hidden in kids movies?",
  "data/reddit-ask/r/AskReddit/comments/ovf71n/what_is_something_future_humans_will_despise_us.json": "What is something future humans will despise us for?",
  "data/reddit-ask/r/AskReddit/comments/ovfori/what_is_the_weirdest_foreign_object_your_friend.json": "What is the weirdest foreign object \"your friend\" has put inside of \"themselves\"?",
  "data/reddit-ask/r/AskReddit/comments/ovh5nt/which_celebrity_is_hated_for_absolutely_no_reason.json": "Which celebrity is hated for absolutely no reason at all?",
  "data/reddit-ask/r/AskReddit/comments/ovihp9/what_city_would_you_never_ever_ever_live_in.json": "What city would you never, ever, EVER live in?",
  "data/reddit-ask/r/AskReddit/comments/ovj3bf/you_all_know_what_a_bucket_list_is_what_is_on.json": "You all know what a bucket list is, what is on your “fuck no, not ever list”?",
  "data/reddit-ask/r/AskReddit/comments/ovjcrd/what_would_you_do_if_you_had_a_pocket_watch_that.json": "What would you do if you had a pocket watch that could stop time with NO consequences?",
  "data/reddit-ask/r/AskReddit/comments/ovnbun/make_a_wish_employees_what_was_the_most_strangest.json": "Make a wish employees What was the most strangest thing a make a wish kid asked for and actually received?",
  "data/reddit-ask/r/AskReddit/comments/ovojo8/what_surprised_you_about_your_first_sexual.json": "What surprised you about your first sexual experience?",
  "data/reddit-ask/r/AskReddit/comments/ovrfu0/if_your_walls_could_talk_what_would_they_say.json": "If your walls could talk, what would they say?",
  "data/reddit-ask/r/AskReddit/comments/ovs3nj/whats_the_best_insult_youve_heard_without_swearing.json": "What’s the best insult you’ve heard without swearing?",
  "data/reddit-ask/r/AskReddit/comments/ovvkni/chefs_of_reddit_whats_one_rule_of_cooking.json": "Chefs of Reddit, what’s one rule of cooking amateurs need to know?",
  "data/reddit-ask/r/AskReddit/comments/ovweeh/serious_have_you_ever_known_someone_whos_gone.json": "[Serious] Have you ever known someone who’s gone missing? If so, what’s the story?",
  "data/reddit-ask/r/AskReddit/comments/ovxm1k/serious_people_who_used_to_be_anti_lgbtq_but_are.json": "[serious] People who used to be anti LGBTQ+ but are now supportive, what changed your mind?",
  "data/reddit-ask/r/AskReddit/comments/ovy53n/what_would_you_say_are_the_biggest_advantages_of.json": "What would you say are the biggest advantages of being male?",
  "data/reddit-ask/r/AskReddit/comments/ovyobz/nonamericans_whats_the_florida_of_your_country.json": "Non-Americans, what’s the Florida of your country?",
  "data/reddit-ask/r/AskReddit/comments/ow09te/whats_the_most_disturbing_scene_from_a_movie.json": "What’s the most disturbing scene from a movie?",
  "data/reddit-ask/r/AskReddit/comments/ow3zdp/whats_the_dumbest_way_youve_managed_to_get_laid.json": "What’s the dumbest way you’ve managed to get laid?",
  "data/reddit-ask/r/AskReddit/comments/ow6x7w/serious_which_song_if_any_gives_you_goosebumps.json": "[SERIOUS] Which song, if any, gives you goosebumps when you listen to it?",
  "data/reddit-ask/r/AskReddit/comments/ow80sd/what_is_the_most_likely_to_cause_humanitys.json": "What is the most likely to cause humanity's extinction?",
  "data/reddit-ask/r/AskReddit/comments/ow91l2/men_of_reddit_what_is_an_instant_turnoff_to_you.json": "Men of Reddit, what is an instant turn-off to you?",
  "data/reddit-ask/r/AskReddit/comments/ow92hq/if_your_reddit_username_became_your_official.json": "If your Reddit username became your official government name, what career would you excel at?",
  "data/reddit-ask/r/AskReddit/comments/ow9ovq/men_of_reddit_when_was_the_last_time_you_got_a_hug.json": "Men of reddit, when was the last time you got a hug?",
  "data/reddit-ask/r/AskReddit/comments/ow9u3u/theres_toxic_masculinity_but_what_are_examples_of.json": "There's toxic masculinity but what are examples of toxic femininity?",
  "data/reddit-ask/r/AskReddit/comments/owar5v/frederick_douglass_said_that_it_is_easier_to.json": "Frederick Douglass said that 'It is easier to build strong children than to repair broken men'. How do you build strong children?",
  "data/reddit-ask/r/AskReddit/comments/owdapb/what_is_an_item_that_can_be_life_changer_and_you.json": "What is an item that can be life changer and you can buy for less than $50?",
  "data/reddit-ask/r/AskReddit/comments/owezxa/serious_whats_the_most_traumatizing_thing_you.json": "[Serious] What's the most traumatizing thing you experienced as a child?",
  "data/reddit-ask/r/AskReddit/comments/owge42/what_gets_worse_with_age.json": "What gets worse with age?",
  "data/reddit-ask/r/AskReddit/comments/owgtle/people_who_dont_ever_want_to_have_kids_why.json": "People who don’t ever want to have kids, why?",
  "data/reddit-ask/r/AskReddit/comments/owgz50/serious_what_are_some_places_on_earth_that_remain.json": "[SERIOUS] What are some places on earth that remain unexplored because they are too dangerous or difficult to enter?",
  "data/reddit-ask/r/AskReddit/comments/owm3l1/whats_the_best_porn_logic_you_have_ever_seen.json": "What's the best “porn logic” you have ever seen?",
  "data/reddit-ask/r/AskReddit/comments/owt9fa/who_in_your_opinion_is_the_most_overrated_band.json": "Who (in your opinion) is the most overrated band, singer or musician?",
  "data/reddit-ask/r/AskReddit/comments/oww819/bipolar_people_of_reddit_how_do_you_deal_with.json": "Bipolar people of Reddit, how do you deal with being sexually attracted to male and female polar bears?",
  "data/reddit-ask/r/AskReddit/comments/ox5d2q/whats_a_low_effort_job_with_a_surprisingly_high.json": "What’s a low effort job with a surprisingly high salary?",
  "data/reddit-ask/r/AskReddit/comments/ox5mzs/which_historical_tragedy_were_you_weirdly.json": "Which historical tragedy were you weirdly obsessed with as a child?",
  "data/reddit-ask/r/AskReddit/comments/ox622e/what_really_makes_no_sense.json": "What really makes no sense?",
  "data/reddit-ask/r/AskReddit/comments/ox6ktp/whats_the_most_fucked_up_thing_someone_has_ever.json": "What's the most fucked up thing someone has ever said to you?",
  "data/reddit-ask/r/AskReddit/comments/ox6w50/what_is_the_kinkiest_fetish_you_or_people_you.json": "What is the kinkiest fetish you or people you know have?",
  "data/reddit-ask/r/AskReddit/comments/oxentn/what_80s_movie_still_holds_up_today.json": "What 80's movie still holds up today?",
  "data/reddit-ask/r/AskReddit/comments/oxh4au/whats_your_drug_of_choice.json": "What’s your drug of choice?",
  "data/reddit-ask/r/AskReddit/comments/oxhlhu/what_is_extremely_hard_to_resist.json": "What is extremely hard to resist?",
  "data/reddit-ask/r/AskReddit/comments/oxiym2/what_makes_a_person_truly_great_in_bed.json": "What makes a person truly great in bed?",
  "data/reddit-ask/r/AskReddit/comments/oxjqh7/what_conspiracy_theory_do_you_believe_in.json": "What conspiracy theory do you believe in?",
  "data/reddit-ask/r/AskReddit/comments/oxpgj1/without_telling_the_name_of_you_country_where_do.json": "Without telling the name of you country, where do you live?",
  "data/reddit-ask/r/AskReddit/comments/oxql9f/how_far_did_you_go_in_a_game_of_truth_or_dare.json": "How far did you go in a game of truth or dare?",
  "data/reddit-ask/r/AskReddit/comments/oxr5xn/what_is_a_hygiene_tiptrick_that_everyone_should.json": "What is a hygiene tip/trick that everyone should know?",
  "data/reddit-ask/r/AskReddit/comments/oxrx4d/men_of_reddit_what_do_you_wish_was_as_acceptable.json": "Men of Reddit; what do you wish was as acceptable for you to do as it is for women?",
  "data/reddit-ask/r/AskReddit/comments/oxv8nq/you_are_transformed_into_your_username_what_are.json": "You are transformed into your username. What are you?",
  "data/reddit-ask/r/AskReddit/comments/oxz7xb/what_food_or_drink_sucks_even_if_most_people_wont.json": "What food or drink sucks even if most people won’t admit it?",
  "data/reddit-ask/r/AskReddit/comments/oy3gx6/what_are_the_best_harmless_pranks_you_can_pull.json": "What are the best harmless pranks you can pull ?",
  "data/reddit-ask/r/AskReddit/comments/oy78by/if_you_could_spend_one_night_with_any_pornstar.json": "If you could spend one night with any pornstar past or present in their prime, who would it be?",
  "data/reddit-ask/r/AskReddit/comments/oy8fa5/whats_the_creepiest_unsolved_mystery_you_know.json": "What’s the creepiest unsolved mystery you know?",
  "data/reddit-ask/r/AskReddit/comments/oy9dwz/what_video_game_will_always_be_nostalgic_for_you.json": "What video game will always be nostalgic for you?",
  "data/reddit-ask/r/AskReddit/comments/oyairg/fathers_of_reddit_who_went_out_for_some_milk_and.json": "Father's of reddit who went out for some \"milk\" and never came back, how'd you move on with life?",
  "data/reddit-ask/r/AskReddit/comments/oyay3z/what_is_nsfw_but_should_be_sfw.json": "What is NSFW, but should be SFW?",
  "data/reddit-ask/r/AskReddit/comments/oye601/whats_the_most_ridiculous_fact_you_know.json": "What’s the most ridiculous fact you know?",
  "data/reddit-ask/r/AskReddit/comments/oyet4z/who_is_a_fictional_character_you_disliked_at.json": "Who is a fictional character you disliked at first but eventually grew to love?",
  "data/reddit-ask/r/AskReddit/comments/oyf3nk/what_is_your_guilty_sexual_pleasure_and_why.json": "What is your guilty sexual pleasure and why?",
  "data/reddit-ask/r/AskReddit/comments/oyglj7/nsfw_which_is_the_dirtiest_joke_you_know.json": "[NSFW] which is the dirtiest joke you know?",
  "data/reddit-ask/r/AskReddit/comments/oyhf7q/how_do_you_respond_to_tell_us_an_interesting_fact.json": "How do you respond to “tell us an interesting fact about you”?",
  "data/reddit-ask/r/AskReddit/comments/oyk213/if_you_could_cancel_anything_what_would_you_cancel.json": "If you could cancel anything, what would you cancel?",
  "data/reddit-ask/r/AskReddit/comments/oymrf5/whats_a_sexual_kink_that_you_were_into_but_not.json": "What’s a sexual kink that you were into but not anymore?",
  "data/reddit-ask/r/AskReddit/comments/oyn6hy/what_made_you_quit_a_job_on_the_spot.json": "What made you quit a job on the spot?",
  "data/reddit-ask/r/AskReddit/comments/oys70e/whats_a_good_way_to_start_caring_about_life_again.json": "What's a good way to start caring about life again?",
  "data/reddit-ask/r/AskReddit/comments/oyudvd/what_is_the_worst_form_of_torture.json": "What is the worst form of torture?",
  "data/reddit-ask/r/AskReddit/comments/oywxtj/men_of_reddit_what_disgusting_things_do_you_think.json": "Men of reddit, what disgusting things do you think of not to cum early when having sex? [NSFW]",
  "data/reddit-ask/r/AskReddit/comments/oyzaqg/whats_the_worst_smell_youve_ever_experienced.json": "What's the worst smell you've ever experienced?",
  "data/reddit-ask/r/AskReddit/comments/oz0rrm/you_have_to_fuck_the_last_video_game_character.json": "You have to fuck the last video game character you killed What is it?",
  "data/reddit-ask/r/AskReddit/comments/oz1c7c/whats_a_disturbing_fact_you_wish_you_never_knew.json": "Whats a disturbing fact you wish you never knew?",
  "data/reddit-ask/r/AskReddit/comments/oz1ez4/what_is_an_incredibly_fake_sounding_history_fact.json": "What is an incredibly fake sounding history fact, that is 100% true?",
  "data/reddit-ask/r/AskReddit/comments/oz2ogb/a_man_walks_up_to_you_hands_you_a_briefcase.json": "A man walks up to you, hands you a briefcase containing a million dollars, winks and walks away. Your username explains how you got the money. How did you get a million dollars?",
  "data/reddit-ask/r/AskReddit/comments/oz4lrb/you_create_a_virus_similar_to_the_zombie_virus.json": "You create a virus similar to the zombie virus, but instead of zombies, what do people become?",
  "data/reddit-ask/r/AskReddit/comments/oz51lf/who_is_a_celebrity_you_used_to_admire_but_no.json": "Who is a celebrity you used to admire, but no longer do, and why?",
  "data/reddit-ask/r/AskReddit/comments/oz9a33/what_is_the_worst_advice_youve_ever_received.json": "What is the worst advice you’ve ever received?",
  "data/reddit-ask/r/AskReddit/comments/oz9pzr/should_sex_work_be_regardedrespected_the_same_as.json": "Should sex work be regarded/respected the same as any other job? Why or why not?",
  "data/reddit-ask/r/AskReddit/comments/ozeco4/what_are_your_thoughts_on_circumcision.json": "What are your thoughts on circumcision?",
  "data/reddit-ask/r/AskReddit/comments/oziaez/who_is_your_favorite_fictional_cat.json": "Who is your favorite fictional cat?",
  "data/reddit-ask/r/AskReddit/comments/ozksxb/whats_the_worst_business_idea_youve_seen_someone.json": "What’s the worst business idea you’ve seen someone try to execute?",
  "data/reddit-ask/r/AskReddit/comments/ozm7y8/what_is_the_worst_candy_ever_made.json": "What is the worst candy ever made?",
  "data/reddit-ask/r/AskReddit/comments/oznm9q/you_have_a_knife_you_need_to_hide_it_30_minutes.json": "You have a knife. You need to hide it. 30 minutes later FBI will come and search all your home. Where will you hide it?",
  "data/reddit-ask/r/AskReddit/comments/ozoac4/nsfw_you_went_to_a_busy_public_restroom_because.json": "[NSFW] You went to a busy public restroom because you suddenly want to shit so bad. After taking a massive dump, you realized that the toilet bowl won't flush or is broken but there are a lot of people lined up outside. What will you do?",
  "data/reddit-ask/r/AskReddit/comments/ozoe7n/what_was_the_worst_physical_pain_youve_been.json": "What was the worst (physical) pain you’ve been through?",
  "data/reddit-ask/r/AskReddit/comments/ozpw7y/people_who_have_killed_someone_in_self_defense.json": "People who have killed someone in self defense what is your story?",
  "data/reddit-ask/r/AskReddit/comments/ozq074/what_sport_should_be_in_the_olympics_but_isnt.json": "What sport should be in the Olympics but isn't?",
  "data/reddit-ask/r/AskReddit/comments/ozsg5x/what_unimportant_hill_are_you_willing_to_die_on.json": "What unimportant hill are you willing to die on?",
  "data/reddit-ask/r/AskReddit/comments/ozxi8w/which_actor_seemed_miscast_in_a_role_but_ended_up.json": "Which actor seemed miscast in a role but ended up killing it?",
  "data/reddit-ask/r/AskReddit/comments/ozy37p/what_is_the_most_successful_propaganda_effort_in.json": "what is the most successful propaganda effort in history?",
  "data/reddit-ask/r/AskReddit/comments/ozzeih/serious_what_is_the_creepieststrangestscariest.json": "[SERIOUS] What is the creepiest/strangest/scariest experience you ever had in your life?",
  "data/reddit-ask/r/AskReddit/comments/p02ibn/what_should_exist_but_doesnt.json": "What should exist, but doesn’t?",
  "data/reddit-ask/r/AskReddit/comments/p03s5y/meat_eaters_of_reddit_what_is_your_favorite.json": "Meat eaters of reddit, what is your favorite vegetarian/vegan dish?",
  "data/reddit-ask/r/AskReddit/comments/p04ca4/what_can_women_do_and_no_one_bats_an_eye_but_if.json": "What can Women do and no one bats an eye, but if Men do it everyone loses their minds?",
  "data/reddit-ask/r/AskReddit/comments/p057uq/which_snack_you_cant_stop_eating_until_its_all.json": "Which snack you can't stop eating until it's all gone once you started?",
  "data/reddit-ask/r/AskReddit/comments/p08t9e/what_is_the_weirdest_thing_you_find_extremely.json": "What is the weirdest thing you find extremely attractive?",
  "data/reddit-ask/r/AskReddit/comments/p096eg/currently_high_people_of_redditwhat_are_you.json": "Currently high people of Reddit,what are you thinking about?",
  "data/reddit-ask/r/AskReddit/comments/p0a7mn/how_would_you_prefer_to_die.json": "How would you prefer to die?",
  "data/reddit-ask/r/AskReddit/comments/p0c3oz/what_is_one_useless_fact_that_the_world_needs_to.json": "What is ONE USELESS FACT that the world needs to know?",
  "data/reddit-ask/r/AskReddit/comments/p0crhs/when_did_you_realise_you_were_attractive.json": "When did you realise you were attractive?",
  "data/reddit-ask/r/AskReddit/comments/p0cx9s/what_sequel_feels_like_a_fanfiction_of_the.json": "What sequel feels like a fanfiction of the original?",
  "data/reddit-ask/r/AskReddit/comments/p0elww/what_fictional_characters_death_hit_you_the.json": "What fictional character’s death hit you the hardest?",
  "data/reddit-ask/r/AskReddit/comments/p0fy6h/forget_irrational_fears_whats_your_perfectly.json": "Forget irrational fears, what's your perfectly rational fear?",
  "data/reddit-ask/r/AskReddit/comments/p0gmgh/if_your_bedroom_could_only_smell_like_one_thing.json": "If your bedroom could only smell like one thing, what would it be?",
  "data/reddit-ask/r/AskReddit/comments/p0guzc/you_are_now_a_chicken_and_the_only_way_to_turn.json": "You are now a chicken and the only way to turn back into a human is by assassinating Gordon Ramsey, how do you do it?",
  "data/reddit-ask/r/AskReddit/comments/p0hn2x/what_is_one_invention_that_wed_be_better_off.json": "What is one invention that we'd be better off without?",
  "data/reddit-ask/r/AskReddit/comments/p0k9vw/whats_the_movie_that_represents_your_country_of.json": "What's the movie that represents your country of origin the best way possible?",
  "data/reddit-ask/r/AskReddit/comments/p0kqe6/if_someone_were_going_to_kill_you_what_would_be.json": "If someone were going to kill you what would be your last words if you wanted to really mess with their head?",
  "data/reddit-ask/r/AskReddit/comments/p0mu4r/whats_the_most_nsfw_thing_youve_accidentally.json": "What's the most NSFW thing you've accidentally shown someone while using your phone or computer?",
  "data/reddit-ask/r/AskReddit/comments/p0ocf4/what_punishment_does_the_person_who_choose_the.json": "What punishment does the person who choose the size of the x on ads deserve?",
  "data/reddit-ask/r/AskReddit/comments/p0rzpc/whats_are_some_sentences_that_sound_like.json": "What's are some sentences that sound like compliments at first, but turn out to be insults once you think it over?",
  "data/reddit-ask/r/AskReddit/comments/p0s34d/people_who_fall_asleep_within_few_minutes_how_do.json": "People who fall asleep within few minutes, how do you it?",
  "data/reddit-ask/r/AskReddit/comments/p0vwnb/bam_youre_suddenly_dead_what_were_your_last_words.json": "Bam! You're suddenly dead, what were your last words?",
  "data/reddit-ask/r/AskReddit/comments/p0xt5r/what_is_the_worst_feeling_ever.json": "What is the worst feeling ever?",
  "data/reddit-ask/r/AskReddit/comments/p10ptu/what_would_you_do_if_you_saw_somebody_you_know_on.json": "What would you do if you saw somebody you know on a porn website?",
  "data/reddit-ask/r/AskReddit/comments/p11cob/covid_vaccinated_redditors_what_was_your.json": "Covid Vaccinated Redditors. What was your experience? How were the side effects, if there were any?",
  "data/reddit-ask/r/AskReddit/comments/p11jw8/aliens_have_announced_that_they_exist_and_they.json": "Aliens have announced that they exist and they are already living on this planet, What animal do you think it is?",
  "data/reddit-ask/r/AskReddit/comments/p12pzq/which_video_game_franchise_should_be_revived.json": "Which Video game franchise should be revived?",
  "data/reddit-ask/r/AskReddit/comments/p13d1i/where_was_the_most_public_place_you_have_had_sex.json": "Where was the most public place you have had sex?",
  "data/reddit-ask/r/AskReddit/comments/p14paz/when_youre_using_a_public_bathroom_and_someone.json": "When you’re using a public bathroom and someone jiggles the handle, what do you say?",
  "data/reddit-ask/r/AskReddit/comments/p14z7j/teachers_whats_the_worst_thing_a_kid_brought_for.json": "Teachers, what’s the worst thing a kid brought for show and tell?",
  "data/reddit-ask/r/AskReddit/comments/p15xsr/what_do_some_people_take_way_too_seriously.json": "What do some people take WAY too seriously?",
  "data/reddit-ask/r/AskReddit/comments/p1erxn/which_show_did_you_drop_due_to_the_second_season.json": "Which show did you drop due to the second season being terrible?",
  "data/reddit-ask/r/AskReddit/comments/p1f1gn/what_single_human_has_done_the_most_damage_to_the.json": "What single human has done the most damage to the progression of humanity in the history of mankind?",
  "data/reddit-ask/r/AskReddit/comments/p1gicw/if_you_could_replace_one_word_in_any_famous_movie.json": "If you could replace one word in any famous movie quote with the word “Anal” what would it be? (Nsfw)",
  "data/reddit-ask/r/AskReddit/comments/p1h792/night_owls_what_things_do_you_do_to_have_fun_by.json": "Night owls, what things do you do to have fun by yourself at 3am?",
  "data/reddit-ask/r/AskReddit/comments/p1lqjn/what_are_you_in_the_1_of.json": "What are you in the 1% of?",
  "data/reddit-ask/r/AskReddit/comments/p1mqxi/australian_people_of_reddit_how_big_does_a_spider.json": "Australian people of reddit, how big does a spider have to be for you to consider it big?",
  "data/reddit-ask/r/AskReddit/comments/p1n0vo/you_have_been_cursed_by_a_witch_to_say_only_one.json": "You have been cursed by a witch to say only one short phrase for the rest of your life, but you get to choose what it is. What is your phrase?",
  "data/reddit-ask/r/AskReddit/comments/p1ob8m/what_is_your_real_life_experience_with_its_hard.json": "What is your real life experience with “It's hard to win an argument with a smart person, but it's damn near impossible to win an argument with a stupid person.”?",
  "data/reddit-ask/r/AskReddit/comments/p1pma0/you_can_implement_one_new_feature_to_the_human.json": "You can implement one new feature to the human body what is it?",
  "data/reddit-ask/r/AskReddit/comments/p1qas3/why_do_you_like_potatoes.json": "Why do you like potatoes?",
  "data/reddit-ask/r/AskReddit/comments/p1qqfr/what_is_clever_way_to_save_money_that_most_people.json": "What is clever way to save money, that most people don't realize?",
  "data/reddit-ask/r/AskReddit/comments/p1t0ky/men_of_reddit_what_is_a_great_sex_tip_you_have_to.json": "Men of reddit, what is a great sex tip you have to share with other men of reddit?",
  "data/reddit-ask/r/AskReddit/comments/p1t4pv/what_do_you_do_to_get_rid_of_stress.json": "What do you do to get rid of stress?",
  "data/reddit-ask/r/AskReddit/comments/p1wgmx/what_has_a_0_chance_of_happening.json": "What has a 0% chance of happening?",
  "data/reddit-ask/r/AskReddit/comments/p220cf/what_is_the_most_believable_conspiracy_theory.json": "What is the most believable conspiracy theory?",
  "data/reddit-ask/r/AskReddit/comments/p23b4j/you_just_coughfarted_in_an_elevator_full_of.json": "You just cough-farted in an elevator full of people. What do you say to ease the tension?",
  "data/reddit-ask/r/AskReddit/comments/p259f1/what_piece_of_clothing_on_the_opposite_sex_is.json": "What piece of clothing on the opposite sex is your biggest weakness?",
  "data/reddit-ask/r/AskReddit/comments/p25tuk/doctors_of_reddit_what_do_you_do_if_a_patient_has.json": "Doctors of reddit, what do you do if a patient has an erection during a checkup?",
  "data/reddit-ask/r/AskReddit/comments/p2cbn8/what_terrible_product_sells_by_the_millions.json": "What terrible product sells by the millions?",
  "data/reddit-ask/r/AskReddit/comments/p2czsw/the_goverment_gives_you_1b_dollars_you_got_3.json": "The goverment gives you 1B dollars, you got 3 hours to spend it all, if you dont, you get killed, what do you do to spend it all?",
  "data/reddit-ask/r/AskReddit/comments/p2ddfg/dear_redditors_what_innocent_search_on_google.json": "Dear redditors, what innocent search on Google turn out to be porn?",
  "data/reddit-ask/r/AskReddit/comments/p2efuy/what_thing_is_secretly_just_one_giant_scam.json": "What thing is secretly just one giant scam?",
  "data/reddit-ask/r/AskReddit/comments/p2ffa6/what_are_some_fucked_up_movies_to_watch.json": "What are some fucked up movies to watch?",
  "data/reddit-ask/r/AskReddit/comments/p2jlyx/what_is_the_first_video_game_you_remember_playing.json": "What is the first video game you remember playing?",
  "data/reddit-ask/r/AskReddit/comments/p2l4kd/what_is_something_alot_of_people_believe_in_that.json": "What is something alot of people believe in, that is actually a myth?",
  "data/reddit-ask/r/AskReddit/comments/p2lh9t/what_outdated_slang_do_you_still_use.json": "What outdated slang do you still use?",
  "data/reddit-ask/r/AskReddit/comments/p2po08/what_tastes_good_both_warm_and_cold.json": "What Tastes Good Both Warm and Cold?",
  "data/reddit-ask/r/AskReddit/comments/p2smjd/what_song_is_stuck_in_your_head_now.json": "What song is stuck in your head now?",
  "data/reddit-ask/r/AskReddit/comments/p2t61c/whats_a_fact_thats_real_but_sounds_completely_fake.json": "What’s a fact that’s real, but sounds completely fake?",
  "data/reddit-ask/r/AskReddit/comments/p2u3fe/if_we_could_set_up_a_truman_show_scenario_where.json": "If we could set up a Truman Show scenario where Trump thinks he’s President again and the public send in scenarios for him to deal with, what would you suggest?",
  "data/reddit-ask/r/AskReddit/comments/p2vtzs/whats_considered_normal_in_europe_but_horrific_in.json": "What's considered normal in Europe but horrific in America?",
  "data/reddit-ask/r/AskReddit/comments/p2y5vf/whats_the_worst_sexual_experience_you_had.json": "What’s the worst sexual experience you had?",
  "data/reddit-ask/r/AskReddit/comments/p2yad8/whats_your_proudest_fart.json": "What’s your proudest fart?",
  "data/reddit-ask/r/AskReddit/comments/p32nyg/how_do_you_say_fuck_you_without_actually_saying.json": "How do you say \"fuck you\" without actually saying fuck you?",
  "data/reddit-ask/r/AskReddit/comments/p3344w/what_food_is_just_impossible_to_eat_in_a.json": "What food is just impossible to eat in a civilized manner?",
  "data/reddit-ask/r/AskReddit/comments/p360eo/what_is_the_worst_us_state_and_why.json": "What is the worst US state and why?",
  "data/reddit-ask/r/AskReddit/comments/p37btf/what_is_something_that_everyone_should_have_in.json": "What is something that everyone should have in their home?",
  "data/reddit-ask/r/AskReddit/comments/p39t6j/what_is_your_favourite_insult.json": "What is your favourite insult?",
  "data/reddit-ask/r/AskReddit/comments/p39v42/whats_the_worst_pain_youve_experienced_and_what.json": "What’s the worst pain you’ve experienced and what caused it?",
  "data/reddit-ask/r/AskReddit/comments/p3bor9/if_you_have_to_name_your_genital_a_movie_what.json": "If you have to name your genital a movie, what would it be?",
  "data/reddit-ask/r/AskReddit/comments/p3dc1w/what_is_a_super_popular_tv_show_or_movie_that_you.json": "What is a super popular TV show or movie that you can’t stand?",
  "data/reddit-ask/r/AskReddit/comments/p3e5jl/how_would_you_describe_your_state_without_saying.json": "How would you describe your state without saying the name?",
  "data/reddit-ask/r/AskReddit/comments/p3fqmt/what_is_one_kink_you_cannot_get_behind.json": "What is one kink you cannot get behind?",
  "data/reddit-ask/r/AskReddit/comments/p3fry7/why_wont_the_hackers_hack_into_the_systems_to.json": "Why won’t the “hackers” hack into the systems to erase student loan debt?",
  "data/reddit-ask/r/AskReddit/comments/p3h3wx/if_reddit_existed_back_in_medieval_times_what.json": "If reddit existed back in medieval times, what questions would asked here?",
  "data/reddit-ask/r/AskReddit/comments/p3j7zl/what_would_hitler_do_in_todays_world.json": "What would Hitler do in today's world?",
  "data/reddit-ask/r/AskReddit/comments/p3kwct/who_is_the_most_overrated_person_in_history.json": "Who is the most overrated person in history?",
  "data/reddit-ask/r/AskReddit/comments/p3lpnu/whats_a_red_flag_that_someone_is_very_bad_with.json": "What's a red flag that someone is very bad with their money?",
  "data/reddit-ask/r/AskReddit/comments/p3m42q/what_series_started_of_strong_but_then_later_went.json": "what series started of strong but then later went completely down hill afterwards?",
  "data/reddit-ask/r/AskReddit/comments/p3m49q/what_is_something_they_taught_you_in_elementary.json": "What is something they taught you in elementary school that is not true anymore?",
  "data/reddit-ask/r/AskReddit/comments/p3nhog/what_profile_picture_screams_i_am_a_complete.json": "What profile picture screams \"I am a complete douchebag\"?",
  "data/reddit-ask/r/AskReddit/comments/p3p8ja/your_username_is_now_a_store_what_do_you_sell.json": "Your username is now a store. What do you sell?",
  "data/reddit-ask/r/AskReddit/comments/p3vbiy/what_do_you_think_about_what_is_happening_in.json": "What do you think about what is happening in Afghanistan?",
  "data/reddit-ask/r/AskReddit/comments/p3vkig/nsfw_men_of_reddit_how_long_do_you_actually_last.json": "[NSFW] Men of Reddit, how long do you actually last in bed?",
  "data/reddit-ask/r/AskReddit/comments/p3w5k9/whats_the_weirdest_thing_youve_seen_happen_at_a.json": "What's the weirdest thing you've seen happen at a friend's house that they thought was normal?",
  "data/reddit-ask/r/AskReddit/comments/p3wckq/process_servers_whats_the_most_bizarre_scenario.json": "Process servers, what’s the most bizarre scenario in which you’ve served someone?",
  "data/reddit-ask/r/AskReddit/comments/p3wqrp/every_person_and_animal_on_earth_is_now_extremley.json": "Every person and animal on earth is now extremley attracted to you. How do you avoid the hoarde of horny?",
  "data/reddit-ask/r/AskReddit/comments/p3xrus/what_would_the_world_be_better_off_without.json": "What would the world be better off without?",
  "data/reddit-ask/r/AskReddit/comments/p407v5/what_are_some_myths_people_still_strongly_believe.json": "What are some myths people still strongly believe?",
  "data/reddit-ask/r/AskReddit/comments/p43cci/without_saying_the_movie_what_is_a_famous_line.json": "Without saying the movie, what is a famous line?",
  "data/reddit-ask/r/AskReddit/comments/p4453s/lawyers_of_reddit_what_is_the_most_fucked_up_case.json": "Lawyers of reddit, what is the most fucked up case that you have fought or seen?",
  "data/reddit-ask/r/AskReddit/comments/p44r4z/what_comes_to_mind_when_you_think_of_australia.json": "What comes to mind when you think of Australia?",
  "data/reddit-ask/r/AskReddit/comments/p45vlj/whats_something_that_seems_hot_in_porn_but.json": "What's something that seems hot in porn but actually isn't that hot?",
  "data/reddit-ask/r/AskReddit/comments/p47gki/what_do_you_consider_the_biggest_threat_to.json": "What do you consider the biggest threat to humanity?",
  "data/reddit-ask/r/AskReddit/comments/p49ns3/you_are_the_last_man_on_earth_with_the_remaining.json": "You are the last man on earth with the remaining women. What would that be like?",
  "data/reddit-ask/r/AskReddit/comments/p4azsk/what_do_you_dip_your_fries_in.json": "What do you dip your fries in?",
  "data/reddit-ask/r/AskReddit/comments/p4f5sq/what_fetish_were_you_most_surprised_to_find_out.json": "What fetish were you most surprised to find out you had/developed out of nowhere?",
  "data/reddit-ask/r/AskReddit/comments/p4fyrg/women_of_reddit_what_do_you_wanna_hear_most.json": "Women of reddit, what do you wanna hear most during sex from your partner?",
  "data/reddit-ask/r/AskReddit/comments/p4gsiz/whats_one_thing_men_do_way_more_often_than_women.json": "What’s one thing men do way more often than women?",
  "data/reddit-ask/r/AskReddit/comments/p4h8xd/if_you_had_the_option_to_know_the_truth_the_whole.json": "If you had the option to know the truth the whole truth and nothing but the truth regarding everything in the universes existence would you want to know and what would you want to know first?",
  "data/reddit-ask/r/AskReddit/comments/p4hpuj/what_is_stopping_you_from_going_out_for_a_jog.json": "What is stopping you from going out for a jog?",
  "data/reddit-ask/r/AskReddit/comments/p4iklk/what_movie_had_a_great_concept_but_was_executed.json": "What movie had a great concept but was executed poorly?",
  "data/reddit-ask/r/AskReddit/comments/p4j7s5/which_sports_would_cheerleaders_be_weird_to_have.json": "Which sports would cheerleaders be weird to have during games?",
  "data/reddit-ask/r/AskReddit/comments/p4k4jc/whats_a_food_youre_not_allergic_to_but_find.json": "What’s a food you’re not allergic to but find disgusting?",
  "data/reddit-ask/r/AskReddit/comments/p4ld1t/what_is_your_call_me_old_fashioned_but.json": "What is your \"call me old fashioned but...\"?",
  "data/reddit-ask/r/AskReddit/comments/p4m5zd/what_is_something_that_happened_a_long_time_ago.json": "What is something that happened a long time ago and you’re still mad about it?",
  "data/reddit-ask/r/AskReddit/comments/p4nd1q/what_is_the_goriest_thing_you_have_seen_in_real.json": "What is the goriest thing you have seen in real life?",
  "data/reddit-ask/r/AskReddit/comments/p4o4kp/serious_whats_something_you_found_on_the_internet.json": "[Serious] What's something you found on the internet that traumatized you?",
  "data/reddit-ask/r/AskReddit/comments/p4r0ac/whats_everyones_thoughts_on_whats_happening_in.json": "What's everyone's thoughts on what's happening in Afghanistan? [Serious]",
  "data/reddit-ask/r/AskReddit/comments/p4r3px/surgeons_of_reddit_what_is_the_most_fucked_up.json": "Surgeons of Reddit, what is the most fucked up thing seen in someone's body?",
  "data/reddit-ask/r/AskReddit/comments/p4sjw0/whats_your_biggest_fantasy_nsfw.json": "What’s your biggest fantasy? [NSFW]",
  "data/reddit-ask/r/AskReddit/comments/p4tl5j/what_comes_to_mind_when_you_think_of_mexico.json": "What comes to mind when you think of Mexico?",
  "data/reddit-ask/r/AskReddit/comments/p4tmco/women_of_reddit_what_is_a_100_myth_about_women.json": "Women of Reddit, what is a 100% myth about women?",
  "data/reddit-ask/r/AskReddit/comments/p4uit5/whats_your_opinion_on_abortion.json": "What’s your opinion on abortion?",
  "data/reddit-ask/r/AskReddit/comments/p4vf1y/whats_an_example_of_toxic_positivity_that_people.json": "What's an example of \"toxic positivity\" that people don't seem to realise?",
  "data/reddit-ask/r/AskReddit/comments/p4wrq6/what_comes_to_mind_when_you_think_of_canada.json": "What comes to mind when you think of Canada?",
  "data/reddit-ask/r/AskReddit/comments/p4xjt5/whats_the_appropriate_response_to_seeing_boobs.json": "what’s the appropriate response to seeing boobs?",
  "data/reddit-ask/r/AskReddit/comments/p4z1d9/what_comes_to_mind_when_you_think_of_poland.json": "What comes to mind when you think of Poland?",
  "data/reddit-ask/r/AskReddit/comments/p516ld/people_who_served_militarily_in_afghanistan_since.json": "People who served militarily in Afghanistan since 2001; what are your thoughts on the current events, and therefore the previous 20 years? [Serious]",
  "data/reddit-ask/r/AskReddit/comments/p51v6r/someone_breaks_into_your_house_what_are_they.json": "Someone breaks into your house, what are they definitely NOT stealing?",
  "data/reddit-ask/r/AskReddit/comments/p524it/is_having_racial_preferences_in_dating_racist_and.json": "Is having racial preferences in dating racist? And why?",
  "data/reddit-ask/r/AskReddit/comments/p56sxv/what_is_the_most_painful_thing_you_have_ever.json": "What is the most painful thing you have ever experienced?",
  "data/reddit-ask/r/AskReddit/comments/p57ny9/people_of_reddit_what_is_better_than_sex.json": "People of reddit, what is better than sex?",
  "data/reddit-ask/r/AskReddit/comments/p589mo/you_are_given_2_trillion_and_20_years_to_build.json": "You are given $2 trillion and 20 years to build something in the USA. What do you build?",
  "data/reddit-ask/r/AskReddit/comments/p5cc8z/what_is_your_i_dont_care_if_its_awful_i_still.json": "What is your “I don’t care if it’s awful, I still love it” movie?",
  "data/reddit-ask/r/AskReddit/comments/p5cg8u/in_your_opinion_which_movies_are_overrated.json": "In your opinion, which movies are overrated?",
  "data/reddit-ask/r/AskReddit/comments/p5gflp/what_are_the_american_peoples_thoughts_on_the.json": "What are the American peoples thoughts on the recent news in Afghanistan?",
  "data/reddit-ask/r/AskReddit/comments/p5h13y/what_movie_death_scene_is_burned_into_your_memory.json": "What movie death scene is burned into your memory?",
  "data/reddit-ask/r/AskReddit/comments/p5itjj/whats_the_worst_thing_that_can_be_shoved_up_your.json": "What's the worst thing that can be shoved up your ass?",
  "data/reddit-ask/r/AskReddit/comments/p5j24w/911_operators_what_call_scares_you_till_this_day.json": "911 operators what call scares you till this day?",
  "data/reddit-ask/r/AskReddit/comments/p5jnpb/what_game_have_you_spent_over_1000_hours_on.json": "What game have you spent over 1000 hours on?",
  "data/reddit-ask/r/AskReddit/comments/p5jshh/whats_the_most_disturbing_thing_you_know_happened.json": "What's the most disturbing thing you know happened in real life that sounds like a horror movie?",
  "data/reddit-ask/r/AskReddit/comments/p5mxq9/men_of_reddit_whats_a_100_myth_about_men.json": "Men of Reddit, what’s a 100% myth about men?",
  "data/reddit-ask/r/AskReddit/comments/p5oyd7/afghans_of_reddit_how_are_you_holding_up.json": "Afghans of Reddit, how are you holding up?",
  "data/reddit-ask/r/AskReddit/comments/p5qkm9/whats_your_controversial_music_opinion.json": "What’s your controversial music opinion?",
  "data/reddit-ask/r/AskReddit/comments/p5smnt/what_old_game_should_be_remade_with_2021_graphics.json": "What old game should be remade with 2021 graphics?",
  "data/reddit-ask/r/AskReddit/comments/p5uyr1/what_is_a_secret_that_you_will_never_tell_anyone.json": "what is a secret that you will never tell anyone?",
  "data/reddit-ask/r/AskReddit/comments/p5wm8d/what_fictional_character_do_you_want_to_fuck.json": "What fictional character do you want to fuck?",
  "data/reddit-ask/r/AskReddit/comments/p5y3j0/what_is_a_simple_thing_everyone_should_know.json": "What is a simple thing everyone should know?",
  "data/reddit-ask/r/AskReddit/comments/p5zthl/what_is_the_freakiest_thing_you_ever_did_or_let.json": "what is the freakiest thing you ever did or let someone do to you?",
  "data/reddit-ask/r/AskReddit/comments/p62cti/what_is_something_a_lot_of_people_find_attractive.json": "What is something a lot of people find attractive that is actually a turn off for you?",
  "data/reddit-ask/r/AskReddit/comments/p6bdi0/tattoo_artists_of_reddit_who_was_your_worst.json": "Tattoo Artists of Reddit, who was your worst \"tattoo virgin\"?",
  "data/reddit-ask/r/AskReddit/comments/p6bow5/what_is_your_disability_and_how_do_you_manage.json": "What is your disability and how do you manage?",
  "data/reddit-ask/r/AskReddit/comments/p6k8qc/game_developers_what_is_something_gamers_on_the.json": "Game developers, what is something gamers on the internet always claim to be easy to do or fix, when in reality it's a real pain in the ass?",
  "data/reddit-ask/r/AskReddit/comments/p6ky8q/serious_what_do_you_do_to_reward_yourself_after_a.json": "[Serious] What do you do to reward yourself after a stressful or anxious day?",
  "data/reddit-ask/r/AskReddit/comments/p6ml75/what_advice_did_someone_give_you_that_changed.json": "What advice did someone give you that changed your life?",
  "data/reddit-ask/r/AskReddit/comments/p6pb4e/whats_the_most_corrupt_thing_youve_witnessed_your.json": "What's the most corrupt thing you've witnessed your employer do?",
  "data/reddit-ask/r/AskReddit/comments/p6q2cb/serious_what_is_a_victimless_crime.json": "[Serious] What is a victimless crime?",
  "data/reddit-ask/r/AskReddit/comments/p6qb47/what_is_a_supernatural_event_that_happened_in.json": "What is a supernatural event that happened in your life that just can not be explained?",
  "data/reddit-ask/r/AskReddit/comments/p6r81x/people_who_shave_or_wax_private_parts_for_a.json": "People who shave or wax private parts for a living - what are your horror stories?",
  "data/reddit-ask/r/AskReddit/comments/p6vwwh/what_is_one_fruit_that_no_one_would_miss_if_it.json": "What is one fruit that no one would miss if it disappeared?",
  "data/reddit-ask/r/AskReddit/comments/p70u63/what_is_the_correct_way_to_approach_a_guy.json": "what is the correct way to approach a guy??",
  "data/reddit-ask/r/AskReddit/comments/p71j9x/what_do_you_have_too_much_of.json": "What do you have too much of?",
  "data/reddit-ask/r/AskReddit/comments/p72j6x/what_is_an_unwritten_law_you_abide_by.json": "What is an unwritten law you abide by ?",
  "data/reddit-ask/r/AskReddit/comments/p73zyh/whats_the_best_porno_title_youve_ever_seen.json": "What's the best porno title you've ever seen?",
  "data/reddit-ask/r/AskReddit/comments/p74fni/what_is_your_favorite_swear_word_or_phrase.json": "What is your favorite swear word or phrase?",
  "data/reddit-ask/r/AskReddit/comments/p76smq/whats_the_worst_human_name_youve_ever_encountered.json": "Whats the worst human name you’ve ever encountered?",
  "data/reddit-ask/r/AskReddit/comments/p77jvw/what_is_an_ordinary_item_that_is_overly_sexualized.json": "What is an ordinary item that is overly sexualized?",
  "data/reddit-ask/r/AskReddit/comments/p78rla/whats_something_that_you_can_say_during_sex_but.json": "What’s Something That You Can Say During Sex, But Also At A Job Interview?",
  "data/reddit-ask/r/AskReddit/comments/p79j8o/what_do_you_think_wont_exist_in_2030.json": "What do you think won’t exist in 2030?",
  "data/reddit-ask/r/AskReddit/comments/p7czvj/which_celebrity_would_you_let_do_anything_to_you.json": "Which celebrity would you let do anything to you?",
  "data/reddit-ask/r/AskReddit/comments/p7dack/whats_the_most_elaborate_scam_you_fell_for.json": "What's the most elaborate scam you fell for?",
  "data/reddit-ask/r/AskReddit/comments/p7eg8c/what_are_some_purse_essentials_when_going_to_a.json": "What are some purse essentials when going to a guy's house for the night?",
  "data/reddit-ask/r/AskReddit/comments/p7ewxx/what_is_the_most_damage_youve_ever_done_with_a.json": "What is the most damage you've ever done with a typo?",
  "data/reddit-ask/r/AskReddit/comments/p7h2k4/whos_an_actor_you_find_sexy_and_you_hate_yourself.json": "Who's an actor you find sexy and you hate yourself for it?",
  "data/reddit-ask/r/AskReddit/comments/p7ijle/what_was_the_very_first_psychological_trick_you.json": "What was the very first psychological trick you learned that blew your mind?",
  "data/reddit-ask/r/AskReddit/comments/p7j1eb/your_username_is_now_your_phobiaworst_fear_what.json": "Your username is now your phobia/worst fear. What are you afraid of?",
  "data/reddit-ask/r/AskReddit/comments/p7jrfs/what_is_something_you_have_that_your_pretty_sure.json": "What is something you have, that your pretty sure no one else has?",
  "data/reddit-ask/r/AskReddit/comments/p7k3yg/what_song_do_you_100_believe_is_actually_about.json": "What song do you 100% believe is actually about drugs?",
  "data/reddit-ask/r/AskReddit/comments/p7q2jx/men_whats_the_first_thing_you_notice_when_you_see.json": "Men, what’s the first thing you notice when you see a woman?",
  "data/reddit-ask/r/AskReddit/comments/p7qhst/whats_the_most_toxic_fan_base_youve_ever_seen.json": "What's the most toxic fan base you've ever seen?",
  "data/reddit-ask/r/AskReddit/comments/p7s0al/whats_the_worst_thing_to_put_ketchup_on.json": "What's the worst thing to put ketchup on?",
  "data/reddit-ask/r/AskReddit/comments/p7u0n9/which_celebrity_can_we_all_agree_is_attractive.json": "Which celebrity can we all agree is attractive?",
  "data/reddit-ask/r/AskReddit/comments/p7vfb0/what_is_addictive_like_drugs_but_not_drugs.json": "What is addictive like drugs but not drugs ?",
  "data/reddit-ask/r/AskReddit/comments/p7wfbp/who_would_you_bang_thats_over_50.json": "Who would you bang that’s over 50?",
  "data/reddit-ask/r/AskReddit/comments/p7xa4p/you_have_the_ability_to_get_rid_of_all_of_one.json": "You have the ability to get rid of all of one single thing on earth, what are you getting rid of?",
  "data/reddit-ask/r/AskReddit/comments/p7xluj/whats_one_thing_youre_always_willing_to_pay_the.json": "what’s one thing you’re always willing to pay the extra price for?",
  "data/reddit-ask/r/AskReddit/comments/p7xnwt/what_is_something_you_can_say_during_sex_and_at_a.json": "What is something you can say during sex and at a BBQ?",
  "data/reddit-ask/r/AskReddit/comments/p7y1gl/people_who_got_bullied_their_whole_life_how_are.json": "People who got bullied their whole life. How are you now?",
  "data/reddit-ask/r/AskReddit/comments/p85541/what_tv_show_trope_needs_to_retire.json": "What TV show trope needs to retire?",
  "data/reddit-ask/r/AskReddit/comments/p8580k/what_should_be_off_limits_in_comedy.json": "What should be off limits in comedy?",
  "data/reddit-ask/r/AskReddit/comments/p85uu7/what_seems_complicated_but_is_actually_dead_simple.json": "What seems complicated but is actually dead simple?",
  "data/reddit-ask/r/AskReddit/comments/p88drn/what_would_you_say_to_someone_who_says_money_cant.json": "What would you say to someone who says 'money can't buy happiness'?",
  "data/reddit-ask/r/AskReddit/comments/p89tag/what_is_something_that_sounds_safe_but_actually.json": "What is something that sounds safe but actually isn't?",
  "data/reddit-ask/r/AskReddit/comments/p8bo4h/what_phrase_grinds_your_gears.json": "What phrase grinds your gears?",
  "data/reddit-ask/r/AskReddit/comments/p8hr91/what_is_the_best_song_to_have_sex_to.json": "What is the best song to have sex to?",
  "data/reddit-ask/r/AskReddit/comments/p8k50a/whats_a_word_that_just_sounds_weird_to_you.json": "What's a word that just sounds weird to you?",
  "data/reddit-ask/r/AskReddit/comments/p8kio3/what_is_the_most_worthless_movie_you_have_ever.json": "What is the most worthless movie you have ever watched?",
  "data/reddit-ask/r/AskReddit/comments/p8kpvw/whats_something_normal_thats_been_sexualized.json": "What’s Something Normal That’s Been Sexualized?",
  "data/reddit-ask/r/AskReddit/comments/p8kxvd/what_weirdly_turns_you_on.json": "What weirdly turns you on?",
  "data/reddit-ask/r/AskReddit/comments/p8lezi/if_you_cant_use_a_knife_what_would_you_grab_from.json": "If you can't use a knife, what would you grab from a kitchen draw to fend off an attacker?",
  "data/reddit-ask/r/AskReddit/comments/p8ll78/aliens_invade_earth_tomorrow_they_ask_to_meet.json": "Aliens invade earth tomorrow. They ask to meet with one rep for mankind. Who are we sending?",
  "data/reddit-ask/r/AskReddit/comments/p8o1w0/whats_the_worst_possible_song_that_someone_can.json": "What’s the worst possible song that someone can play during funeral?",
  "data/reddit-ask/r/AskReddit/comments/p8qz2h/whats_the_biggest_fuck_you_without_talking.json": "What’s the biggest ‘fuck you’ without talking?",
  "data/reddit-ask/r/AskReddit/comments/p8rtro/what_is_a_smart_thing_that_looks_dumb.json": "what is a smart thing that looks dumb?",
  "data/reddit-ask/r/AskReddit/comments/p8smty/what_is_that_normal_thing_that_turns_you_off.json": "What is that normal thing that turns you off during sex?",
  "data/reddit-ask/r/AskReddit/comments/p8uigm/whats_a_movie_that_teaches_a_really_bad_lesson.json": "What's a movie that teaches a really bad lesson?",
  "data/reddit-ask/r/AskReddit/comments/p8umnj/what_tastes_worse_the_more_you_eat_it.json": "What tastes worse the more you eat it?",
  "data/reddit-ask/r/AskReddit/comments/p8xs4r/what_would_you_like_to_buy_for_your_self_but_cant.json": "What would you like to buy for your self, but can't afford it?",
  "data/reddit-ask/r/AskReddit/comments/p90chd/what_will_it_take_to_make_malls_in_america_cool.json": "What will it take to make malls in America cool again?",
  "data/reddit-ask/r/AskReddit/comments/p90ffb/what_internet_video_when_uncovered_100_years_in.json": "What internet video, when uncovered 100 years in the future, will make historians say \"what the fuck?\"",
  "data/reddit-ask/r/AskReddit/comments/p92ume/if_you_could_bitch_smack_one_person_with_no.json": "If you could bitch smack one person with no consequences, who would it be and why?",
  "data/reddit-ask/r/AskReddit/comments/p93m94/what_are_some_movies_where_the_bad_guy_wins.json": "What are some movies where the bad guy wins?",
  "data/reddit-ask/r/AskReddit/comments/p94bhp/you_accidently_step_on_a_wasp_when_suddenly_you.json": "You accidently step on a wasp when suddenly you see 1000 of them flying towards you. What do you do?",
  "data/reddit-ask/r/AskReddit/comments/p98a1d/what_do_you_think_is_the_most_universally_hated.json": "What do you think is the most universally hated thing in all of human history?",
  "data/reddit-ask/r/AskReddit/comments/p9bdgn/if_an_apocalypse_was_to_begin_tomorrow_and_money.json": "If an apocalypse was to begin tomorrow and money lost all of its value, what new thing would take over as the new currency and why?",
  "data/reddit-ask/r/AskReddit/comments/p9bzfm/if_you_could_eliminate_one_profession_from_the.json": "If you could eliminate one profession from the world, which would it be and why?",
  "data/reddit-ask/r/AskReddit/comments/p9c8vr/whats_a_friendly_gesture_in_one_country_but_a_big.json": "What’s a friendly gesture in one country but a big no-no in another?",
  "data/reddit-ask/r/AskReddit/comments/p9da4p/what_surprised_you_the_most_about_sex_when_you.json": "What surprised you the most about sex when you lost your virginity?",
  "data/reddit-ask/r/AskReddit/comments/p9fd5f/what_is_your_reason_for_not_having_a_child.json": "What is your reason for not having a child?",
  "data/reddit-ask/r/AskReddit/comments/p9foo2/if_you_were_god_what_would_you_do_to_fuck_with.json": "If you were God, what would you do to fuck with people?",
  "data/reddit-ask/r/AskReddit/comments/p9g2y2/what_are_some_paradoxes_that_make_your_brain_hurt.json": "What are some paradoxes that make your brain hurt?",
  "data/reddit-ask/r/AskReddit/comments/p9h29g/what_is_humans_greatest_invention.json": "What is humans greatest invention?",
  "data/reddit-ask/r/AskReddit/comments/p9h43e/who_just_really_doesnt_deserve_to_be_a_celebrity.json": "Who just really doesn't deserve to be a celebrity?",
  "data/reddit-ask/r/AskReddit/comments/p9hnhb/people_who_say_theyll_arrive_at_500_and_come.json": "People, who say they'll arrive at 5:00 and come knocking at exact 5:00, what's your secret?",
  "data/reddit-ask/r/AskReddit/comments/p9ic0l/what_was_the_greatest_pain_you_have_ever_felt.json": "What was the greatest pain you have ever felt?",
  "data/reddit-ask/r/AskReddit/comments/p9j9vd/why_in_the_absolute_fuck_are_animators_able_to.json": "Why in the absolute fuck are animators able to make Pixar Quality porn of Overwatch?",
  "data/reddit-ask/r/AskReddit/comments/p9mizr/what_is_a_food_opinion_that_you_stand_by.json": "What is a food opinion that you stand by?",
  "data/reddit-ask/r/AskReddit/comments/p9n11w/what_instantly_ruins_someones_first_impression.json": "What instantly ruins someone’s first impression with you?",
  "data/reddit-ask/r/AskReddit/comments/p9ow0v/what_kills_a_relationship_other_than_cheating.json": "What kills a relationship, other than cheating?",
  "data/reddit-ask/r/AskReddit/comments/p9plz3/nsfw_if_you_could_poop_anything_other_than_poop.json": "[NSFW] If you could poop anything other than poop, what would you poop?",
  "data/reddit-ask/r/AskReddit/comments/p9skl9/whats_keeping_you_up_right_now_why_arent_you.json": "What’s keeping you up right now? Why aren’t you asleep?",
  "data/reddit-ask/r/AskReddit/comments/p9vyin/what_can_people_start_doing_now_that_will_help.json": "What can people start doing now that will help them a lot in about five years?",
  "data/reddit-ask/r/AskReddit/comments/p9zjg7/what_was_the_greatest_pleasure_you_ever_felt.json": "What was the greatest pleasure you ever felt?",
  "data/reddit-ask/r/AskReddit/comments/pa0vgz/whats_the_best_bassline_ever_made.json": "What’s the best bassline ever made?",
  "data/reddit-ask/r/AskReddit/comments/pa0wm0/what_is_an_illegal_thing_most_people_dont_know_is.json": "What is an illegal thing most people don't know is illegal?",
  "data/reddit-ask/r/AskReddit/comments/pa0xi7/what_are_some_of_the_most_iconic_lines_in_movie.json": "What are some of the most iconic lines in movie history?",
  "data/reddit-ask/r/AskReddit/comments/pa2mah/if_you_could_legalize_one_crime_what_would_you.json": "If you could legalize one crime, what would you legalize and why?",
  "data/reddit-ask/r/AskReddit/comments/pa6495/whats_a_tv_show_that_you_used_to_love_but_not.json": "What’s a TV show that you used to love but not many people remember?",
  "data/reddit-ask/r/AskReddit/comments/pa9nbg/what_famous_person_is_impossible_to_hate.json": "What famous person is impossible to hate?",
  "data/reddit-ask/r/AskReddit/comments/pa9s7y/whats_a_typically_unattractive_trait_that_you.json": "What's a \"typically unattractive\" trait that you actually find to be attractive?",
  "data/reddit-ask/r/AskReddit/comments/pa9ttf/what_series_has_a_theme_song_you_never_skip.json": "What series has a theme song you never skip?",
  "data/reddit-ask/r/AskReddit/comments/pabntp/whats_a_boring_fact_about_yourself.json": "What's a boring fact about yourself?",
  "data/reddit-ask/r/AskReddit/comments/padooq/whats_the_best_name_for_a_restaurant_that_could.json": "What’s the best name for a restaurant that could also be a strip club?",
  "data/reddit-ask/r/AskReddit/comments/pagx93/what_is_the_most_hilarious_yo_mama_joke_you_ever.json": "What is the most hilarious 'Yo mama' joke you ever heard?",
  "data/reddit-ask/r/AskReddit/comments/pah8av/whats_your_biggest_turn_off.json": "What’s your biggest turn off?",
  "data/reddit-ask/r/AskReddit/comments/paji4j/if_you_were_attacked_by_3_five_year_olds_at_a.json": "If you were attacked by 3 five year olds at a time and they came in endless waves, how many waves could you survive until you were eventually overwhelmed?",
  "data/reddit-ask/r/AskReddit/comments/pamk79/what_would_you_rename_america_if_you_could_rename.json": "What would you rename America if you could rename it ?",
  "data/reddit-ask/r/AskReddit/comments/pamtco/what_food_isnt_worth_the_effort_to_be_home_made.json": "What food isn't worth the effort to be home made?",
  "data/reddit-ask/r/AskReddit/comments/paoaye/not_horny_teenage_boys_on_reddit_how_tired_are.json": "Not horny teenage boys on reddit, how tired are you of the sex questions on this subreddit?",
  "data/reddit-ask/r/AskReddit/comments/papgaf/mental_health_professionals_of_reddit_what_is_the.json": "Mental health professionals of Reddit, what is the most disturbing case you have personally encountered?",
  "data/reddit-ask/r/AskReddit/comments/paqodl/what_is_your_strangest_wrong_number_story.json": "What is your strangest wrong number story?",
  "data/reddit-ask/r/AskReddit/comments/parnjm/without_naming_the_show_whats_the_one_quote_that.json": "without naming the show, what's the one quote that gives it away?",
  "data/reddit-ask/r/AskReddit/comments/pau5il/people_who_dont_support_marijuana_use.json": "People who don’t support marijuana use recreationally at a federal scale, why?",
  "data/reddit-ask/r/AskReddit/comments/pavx6s/do_you_smoke_weed_why_or_why_not.json": "Do you smoke weed? Why or why not?",
  "data/reddit-ask/r/AskReddit/comments/pawpim/without_naming_the_youtuber_whats_the_one_quote.json": "without naming the YouTuber, what's the one quote that gives it away?",
  "data/reddit-ask/r/AskReddit/comments/payu9v/whats_a_political_hill_youre_willing_to_die_on.json": "What’s a political hill you’re willing to die on?",
  "data/reddit-ask/r/AskReddit/comments/payudw/whats_a_1st_world_problem_thats_a_3rd_world_luxury.json": "What’s a 1st world “problem” that’s a 3rd world luxury?",
  "data/reddit-ask/r/AskReddit/comments/paz9s6/should_lsd_be_decriminalised_for_use_in_research.json": "Should LSD be decriminalised for use in research in curing depression and trauma? Why or why not?",
  "data/reddit-ask/r/AskReddit/comments/pb1k9g/what_actoractress_was_completely_100_wrong_for.json": "What actor/actress was completely 100% wrong for the role?",
  "data/reddit-ask/r/AskReddit/comments/pb47yq/what_piece_of_music_do_you_find_hauntingly.json": "What piece of music do you find \"hauntingly beautiful\"?",
  "data/reddit-ask/r/AskReddit/comments/pb4rod/without_naming_the_video_game_whats_a_quote_that.json": "Without naming the video game, what's a quote that gives it away?",
  "data/reddit-ask/r/AskReddit/comments/pb5jjm/without_telling_the_name_of_your_country_where_do.json": "Without telling the name of your country where do you live ?",
  "data/reddit-ask/r/AskReddit/comments/pb7c6k/what_is_a_simple_thing_that_makes_you_very_happy.json": "What is a simple thing that makes you very happy?",
  "data/reddit-ask/r/AskReddit/comments/pbb2rs/what_is_something_that_you_were_warned_about_when.json": "What is something that you were warned about when you were younger that you now feel was exaggerated?",
  "data/reddit-ask/r/AskReddit/comments/pbbjqr/if_suddenly_every_woman_wanted_to_have_sex_with.json": "If suddenly every woman wanted to have sex with you, what would you do on day 1?",
  "data/reddit-ask/r/AskReddit/comments/pbd8v6/whats_an_insignificant_thing_that_triggers_the.json": "What's an insignificant thing that triggers the shit out of you?",
  "data/reddit-ask/r/AskReddit/comments/pbdv25/what_pisses_you_off_about_reddit.json": "What pisses you off about reddit?",
  "data/reddit-ask/r/AskReddit/comments/pbe6k7/have_you_ever_seen_a_dead_body_not_at_a_funeral.json": "Have you ever seen a dead body? (Not at a funeral) How did you cope?",
  "data/reddit-ask/r/AskReddit/comments/pbfhgt/you_die_according_to_the_last_song_you_listened.json": "You die according to the last song you listened to. What is your cause of death?",
  "data/reddit-ask/r/AskReddit/comments/pbg9km/ex_drinkers_of_reddit_what_was_your_damn_i_need.json": "Ex drinkers of Reddit, what was your “Damn I need to stop” moment?",
  "data/reddit-ask/r/AskReddit/comments/pbh60m/whats_something_you_thought_youd_have_by_now.json": "What’s something you thought you’d have by now?",
  "data/reddit-ask/r/AskReddit/comments/pblfxl/nonusa_redditors_which_american_restaurants_have.json": "Non-USA Redditors: which American restaurants have you always wanted to try?",
  "data/reddit-ask/r/AskReddit/comments/pbp8re/whats_that_one_embarrassing_moment_that_keeps.json": "What’s that one embarrassing moment that keeps coming back to haunt you?",
  "data/reddit-ask/r/AskReddit/comments/pbptag/whats_a_happier_feeling_than_an_orgasm.json": "What's a happier feeling than an orgasm?",
  "data/reddit-ask/r/AskReddit/comments/pbs0ls/whats_a_completely_normal_word_that_annoys_you.json": "What's a completely normal word that annoys you every time you hear it?",
  "data/reddit-ask/r/AskReddit/comments/pbs2cl/now_that_onlyfans_is_taking_back_its_ban_on.json": "Now that OnlyFans is taking back it’s ban on sexual content, what other company bankrupted itself (or nearly bankrupted itself) through poorly thought-out and/or unnecessary decisions?",
  "data/reddit-ask/r/AskReddit/comments/pbyxz8/what_do_you_think_is_the_worst_method_of_torture.json": "What do you think is the worst method of torture?",
  "data/reddit-ask/r/AskReddit/comments/pbzt5b/what_improved_your_quality_of_life_so_much_you.json": "What improved your quality of life so much, you wish you did it sooner?",
  "data/reddit-ask/r/AskReddit/comments/pc0k0f/taxi_drivers_whats_the_deepest_secrets_youve.json": "Taxi drivers, what's the deepest secrets you've overheard in your car?",
  "data/reddit-ask/r/AskReddit/comments/pc7rzp/what_screams_out_early_2000s.json": "What screams out early 2000s?",
  "data/reddit-ask/r/AskReddit/comments/pc91np/you_get_001_dollars_everytime_someone_says_your.json": "You get 0,01 dollars everytime someone says your word. What is it?",
  "data/reddit-ask/r/AskReddit/comments/pc98qv/what_game_has_made_you_rage_like_no_other_game_has.json": "What game has made you rage like no other game has?",
  "data/reddit-ask/r/AskReddit/comments/pc9hpg/whats_the_simplest_thing_that_makes_you_happy.json": "What’s the simplest thing that makes you happy?",
  "data/reddit-ask/r/AskReddit/comments/pcawuf/flight_attendents_what_are_some_of_your_craziest.json": "Flight Attendents, What Are Some Of Your Craziest Stories?",
  "data/reddit-ask/r/AskReddit/comments/pcbu9j/what_is_a_completely_rational_sentence_you_could.json": "What is a completely rational sentence you could speak today, that if you said 20 years ago, people would think you were insane?",
  "data/reddit-ask/r/AskReddit/comments/pcdzxr/at_this_time_what_is_your_view_of_joe_biden.json": "At this time, what is your view of Joe Biden?",
  "data/reddit-ask/r/AskReddit/comments/pcfrxa/exantivaxxers_of_reddit_what_made_you_change_your.json": "Ex-antivaxxers of Reddit, what made you change your mind?",
  "data/reddit-ask/r/AskReddit/comments/pcgm9j/what_will_never_not_be_funny.json": "What will never not be funny?",
  "data/reddit-ask/r/AskReddit/comments/pciohd/whats_the_creepiest_thing_youve_seen_at_your.json": "What's the creepiest thing you've seen at your relatives house?",
  "data/reddit-ask/r/AskReddit/comments/pcno9d/in_school_what_were_you_famous_for.json": "In School, what were you famous for?",
  "data/reddit-ask/r/AskReddit/comments/pcoc3f/what_is_a_sure_sign_that_someone_is_new_to_your.json": "What is a sure sign that someone is new to your hobby?",
  "data/reddit-ask/r/AskReddit/comments/pcva2j/what_are_peoples_best_responsescomebacks_to_when.json": "What are peoples best responses/comebacks to when someone tells you that they f****d your mother?",
  "data/reddit-ask/r/AskReddit/comments/pcwx1k/girls_of_reddit_what_is_the_hardest_thing_to.json": "Girls of Reddit, what is the hardest thing to explain to a males?",
  "data/reddit-ask/r/AskReddit/comments/pd0cfr/a_child_who_is_not_embraced_by_the_village_will.json": "“A child who is not embraced by the village will burn it down to feel its warmth.” What examples do you have of this that you have seen?",
  "data/reddit-ask/r/AskReddit/comments/pd1rdt/where_were_you_and_what_were_you_doing_when_911.json": "Where were you and what were you doing when 9/11 happened?",
  "data/reddit-ask/r/AskReddit/comments/pd21ha/which_fictional_creaturevillain_traumatized_you.json": "Which fictional creature/villain traumatized you in your childhood?",
  "data/reddit-ask/r/AskReddit/comments/pd2uhj/what_was_the_most_disturbing_thing_found_in_a.json": "What was the most disturbing thing found in a video game?",
  "data/reddit-ask/r/AskReddit/comments/pd4285/only_using_food_where_do_you_live.json": "Only using food, where do you live?",
  "data/reddit-ask/r/AskReddit/comments/pd4ndw/what_conspiracy_theory_is_just_bullshit.json": "What conspiracy theory is just bullshit?",
  "data/reddit-ask/r/AskReddit/comments/pd62cr/whats_the_biggest_turn_off_during_sex.json": "What's the biggest turn off during sex?",
  "data/reddit-ask/r/AskReddit/comments/pd65so/what_is_your_favorite_word_in_the_english.json": "What is your favorite word in the english vocabulary?",
  "data/reddit-ask/r/AskReddit/comments/pd89m6/people_who_wear_glasses_what_are_things_non.json": "People who wear glasses. What are things non glasses wearing people will never experience/understand about wearing glasses?",
  "data/reddit-ask/r/AskReddit/comments/pd8h2e/what_would_you_like_to_to_remove_from_the_earth.json": "What would you like to to remove from the Earth?",
  "data/reddit-ask/r/AskReddit/comments/pd931j/men_of_the_reddit_how_did_it_feel_the_first_time.json": "Men of the reddit. How did it feel the first time you got a blowjob?",
  "data/reddit-ask/r/AskReddit/comments/pda1q5/married_couples_how_do_you_turn_down_sex_without.json": "Married couples. How do you turn down sex, without offending your spouse?",
  "data/reddit-ask/r/AskReddit/comments/pdc6hb/what_is_a_nonlife_threatening_illnessdisease_that.json": "What is a non-life threatening illness/disease that you fear of the most?",
  "data/reddit-ask/r/AskReddit/comments/pdhzc2/whats_an_instance_where_the_movie_was_better_than.json": "What's an instance where the movie was better than the book?",
  "data/reddit-ask/r/AskReddit/comments/pdlqc9/if_someone_asks_you_to_tell_them_a_joke_whats.json": "If someone asks you to tell them a joke, what's your go to?",
  "data/reddit-ask/r/AskReddit/comments/pdnze2/what_object_would_be_impossible_to_kill_someone.json": "What object would be impossible to kill someone with?",
  "data/reddit-ask/r/AskReddit/comments/pdod9j/which_fictional_character_would_you_fuck_if_they.json": "Which fictional character would you fuck if they were also interested?",
  "data/reddit-ask/r/AskReddit/comments/pdpa3u/why_are_you_still_awake.json": "Why are you still awake?",
  "data/reddit-ask/r/AskReddit/comments/pdpj8s/how_is_batman_allowed_to_drive_an_unregistered.json": "How is Batman allowed to drive an unregistered, uninsured, custom super car around with no issue?",
  "data/reddit-ask/r/AskReddit/comments/pdre62/hospital_workers_of_reddit_whats_the_creepiest.json": "Hospital workers of Reddit, what’s the creepiest thing you’ve ever seen?",
  "data/reddit-ask/r/AskReddit/comments/pdzzrw/what_is_the_most_disturbing_thing_to_know.json": "What is the most disturbing thing to know?",
  "data/reddit-ask/r/AskReddit/comments/pe192w/how_can_you_tell_if_a_person_is_a_douchebag.json": "How can you tell if a person is a douchebag?",
  "data/reddit-ask/r/AskReddit/comments/pe1wxj/what_is_expensive_for_no_reason_at_all.json": "What is expensive for no reason at all?",
  "data/reddit-ask/r/AskReddit/comments/pe2b65/the_entire_world_agrees_to_allow_you_to_choose.json": "The entire world agrees to allow YOU to choose one leader to unite all of the countries of the world. You can select anyone living or dead but they must be a celebrity. Who did you choose to rule the United Earth?",
  "data/reddit-ask/r/AskReddit/comments/pe4eq4/what_tastes_better_cold_rather_than_it_being_hot.json": "What tastes better cold rather than it being hot?",
  "data/reddit-ask/r/AskReddit/comments/pe52xj/redditors_who_remember_life_preinternet_what_the.json": "Redditors who remember life pre-internet. What the heck did you occupy your time with?",
  "data/reddit-ask/r/AskReddit/comments/pe69f1/circumcised_people_of_reddit_whats_your_stance_on.json": "Circumcised people of Reddit, what’s your stance on the practice? Would you prefer to be uncut?",
  "data/reddit-ask/r/AskReddit/comments/pe7v3h/what_fast_food_chain_has_the_best_burger.json": "What fast food chain has the best burger?",
  "data/reddit-ask/r/AskReddit/comments/pe8rzr/what_outfituniform_really_turns_you_on.json": "What outfit/uniform really turns you on?",
  "data/reddit-ask/r/AskReddit/comments/pe9wly/men_of_reddit_if_you_dont_give_oral_to_your.json": "Men of reddit, if you don't give oral to your female partner, why? [NSFW]",
  "data/reddit-ask/r/AskReddit/comments/pea4u6/how_the_f_do_you_make_new_friends_as_an_adult.json": "How the F* do you make new friends as an adult?",
  "data/reddit-ask/r/AskReddit/comments/pea82s/forget_boobs_and_butt_what_other_parts_of_a_woman.json": "Forget boobs and butt, what other parts of a woman are sexy?",
  "data/reddit-ask/r/AskReddit/comments/pediry/people_of_reddit_what_is_the_scariest_thing_you.json": "People of Reddit, what is the scariest thing you think mankind has ever created?",
  "data/reddit-ask/r/AskReddit/comments/pedut8/people_who_ask_sexual_questions_on_this_sub_why.json": "People who ask sexual questions on this sub, why? Also - can you stop?",
  "data/reddit-ask/r/AskReddit/comments/pefk4j/what_made_the_high_school_legend_become_a_legend.json": "What made the “high school legend” become a legend?",
  "data/reddit-ask/r/AskReddit/comments/pegwo4/people_who_buy_physical_copies_of_porn_why.json": "People, who buy physical copies of porn, why?",
  "data/reddit-ask/r/AskReddit/comments/pegzlb/what_seems_harmless_but_could_actually_kill_you.json": "What seems harmless but could actually kill you?",
  "data/reddit-ask/r/AskReddit/comments/peitai/whats_something_in_your_routine_that_you_know_is.json": "What's something in your routine that you know is unhealthy, but you still choose to do it?",
  "data/reddit-ask/r/AskReddit/comments/pejjwt/whats_the_most_intellectual_joke_you_know.json": "What's the most intellectual joke you know?",
  "data/reddit-ask/r/AskReddit/comments/pelihr/what_problem_is_often_overlooked_in_apocalyptic.json": "What problem is often overlooked in apocalyptic movies/TV shows that could kill you?",
  "data/reddit-ask/r/AskReddit/comments/pelk4n/what_is_an_epic_scene_from_a_movie_or_tv_show_you.json": "What is an epic scene from a movie or TV show you constantly re-watch?",
  "data/reddit-ask/r/AskReddit/comments/pembl3/what_famous_quote_is_complete_bs.json": "What famous quote is complete BS?",
  "data/reddit-ask/r/AskReddit/comments/pen4j4/stoners_of_reddit_whats_the_best_idea_youve_come.json": "Stoners of Reddit, what’s the best idea you’ve come up with while stoned?",
  "data/reddit-ask/r/AskReddit/comments/pes2ug/whats_with_all_these_sex_questions.json": "whats with all these sex questions?",
  "data/reddit-ask/r/AskReddit/comments/pesq9t/how_do_we_stop_the_rising_obesity_rate_with_half.json": "How do we stop the rising obesity rate with half the US population projected to be obese by 2030?",
  "data/reddit-ask/r/AskReddit/comments/petzjp/what_food_should_you_never_order_on_a_first_date.json": "What food should you never order on a first date?",
  "data/reddit-ask/r/AskReddit/comments/peu9vu/if_masturbation_became_illegal_how_would_you.json": "If masturbation became illegal, how would you respond?",
  "data/reddit-ask/r/AskReddit/comments/pew2bd/which_fictional_character_do_you_think_would.json": "Which fictional character do you think would definitely have an OnlyFans?",
  "data/reddit-ask/r/AskReddit/comments/pew801/what_true_nonparanormal_story_gives_you_chills.json": "What true, non-paranormal story gives you chills?",
  "data/reddit-ask/r/AskReddit/comments/pewsvo/what_was_cool_when_you_were_young_but_isnt_cool.json": "What was cool when you were young but isn’t cool now?",
  "data/reddit-ask/r/AskReddit/comments/pf4lio/what_leaked_sex_tape_would_completely_break_the.json": "What leaked sex tape would completely break the internet?",
  "data/reddit-ask/r/AskReddit/comments/pf560d/if_you_could_train_any_animal_in_the_world_to_be.json": "If you could train any animal in the world to be your pet and protector, what would it be and why?",
  "data/reddit-ask/r/AskReddit/comments/pfbzo6/what_songs_did_you_sing_along_to_as_a_kid_only_to.json": "What songs did you sing along to as a kid only to realize as an adult the lyrics are full of sexual innuendo?",
  "data/reddit-ask/r/AskWomen/comments/ovdzdh/when_did_you_realize_people_started_to_see_you_as.json": "When did you realize people started to see you as an object of desire and no longer a little girl?",
  "data/reddit-ask/r/AskWomen/comments/ovi4yl/when_did_you_realize_that_sexual_harassmentsexual.json": "When Did You Realize That Sexual Harassment/Sexual Assault Was Commonplace for Women?",
  "data/reddit-ask/r/AskWomen/comments/ovlcex/how_young_were_you_when_you_first_saw_porn_how.json": "How young were you when you first saw porn? How did it shape your perception of sex?",
  "data/reddit-ask/r/AskWomen/comments/ovpdq2/whats_your_favorite_anime.json": "What's your favorite anime?",
  "data/reddit-ask/r/AskWomen/comments/ovsjjn/if_laws_about_nipplebreast_exposure_became_the.json": "If laws about nipple/breast exposure became the same for women as men, would you go topless in the same situations that men do? Why or why not?",
  "data/reddit-ask/r/AskWomen/comments/ow0o8c/how_do_you_differentiate_between_stepping_out_of.json": "How do you differentiate between stepping out of your comfort zone and forcing yourself to do things you don't want?",
  "data/reddit-ask/r/AskWomen/comments/ow1vff/has_a_gay_guy_ever_been_sexist_towards_you_and_how.json": "Has a gay guy ever been sexist towards you? And how?",
  "data/reddit-ask/r/AskWomen/comments/ow5wpc/how_would_you_feel_if_a_trans_woman_looked_up_to.json": "How would you feel if a trans woman looked up to you as a role model?",
  "data/reddit-ask/r/AskWomen/comments/ow6hqg/how_old_are_you_and_how_many_serious.json": "How old are you and how many serious relationships have you had?",
  "data/reddit-ask/r/AskWomen/comments/owir0f/how_have_you_changed_over_the_last_five_years_if.json": "How have you changed over the last five years, if at all?",
  "data/reddit-ask/r/AskWomen/comments/owj54i/how_do_you_handle_times_when_youre_with_a_man_and.json": "How do you handle times when you're with a man and you're both talking to someone and they don't acknowledge your presence?",
  "data/reddit-ask/r/AskWomen/comments/owmyu4/what_do_you_think_of_antiabortion_laws.json": "What do you think of Anti-Abortion Laws?",
  "data/reddit-ask/r/AskWomen/comments/owsbga/when_was_the_last_time_you_sat_and_gave_yourself.json": "When was the last time you sat and gave yourself credit for how much you’ve grown and how far you’ve come? When was the last time you celebrated a relatively small win, just because? When was the last time you just sat down and said out loud, “I'm really really proud of myself?”",
  "data/reddit-ask/r/AskWomen/comments/ox5zcl/what_have_you_learned_about_yourself_during_the.json": "What have you learned about yourself during the pandemic?",
  "data/reddit-ask/r/AskWomen/comments/ox9xxq/what_is_something_thats_clearly_a_scam_but_women.json": "What is something that's clearly a scam, but women have been conditioned to believe its normal?",
  "data/reddit-ask/r/AskWomen/comments/oxkkdt/without_the_weird_societal_pressure_and.json": "Without the weird societal pressure and regardless of money, how would you feel about having a surrogate baby that is totally biologically yours but you didn’t give birth to said baby?",
  "data/reddit-ask/r/AskWomen/comments/oxpebj/what_was_it_like_the_first_time_you_fell_in_love.json": "What was it like the first time you fell in love?",
  "data/reddit-ask/r/AskWomen/comments/oxr0og/what_do_you_think_about_the_notion_that_your.json": "What do you think about the notion that your spouse should be number one person in your life?",
  "data/reddit-ask/r/AskWomen/comments/oxtk47/ladies_with_multiple_income_streams_what_type_of.json": "Ladies with multiple income streams, what type of work are you involved in?",
  "data/reddit-ask/r/AskWomen/comments/oxvqdn/which_movie_is_a_good_example_of_the_female_gaze.json": "Which movie is a good example of the ‘Female Gaze’ ?",
  "data/reddit-ask/r/AskWomen/comments/oy59bf/ladies_what_do_you_think_about_as_you_perform.json": "Ladies, what do you think about as you perform oral sex?",
  "data/reddit-ask/r/AskWomen/comments/oy5slb/what_is_the_funniest_nastiest_or_most_ridiculous.json": "What is the funniest, nastiest, or most ridiculous thing a random man has ever said to you on the street?",
  "data/reddit-ask/r/AskWomen/comments/oy8ouf/what_are_your_funniest_bad_date_stories.json": "What are your funniest bad date stories?",
  "data/reddit-ask/r/AskWomen/comments/oydvdg/to_those_who_are_the_eldest_daughters_of_their.json": "To those who are the eldest daughters of their homes, how did you find the courage to be independent?",
  "data/reddit-ask/r/AskWomen/comments/oyf904/were_just_shy_of_150_days_until_2022_so_what_are.json": "We're just shy of 150 days until 2022 so what are you planning to achieve before the year ends?",
  "data/reddit-ask/r/AskWomen/comments/oyh60r/what_do_you_think_about_the_there_are_no_women_on.json": "What do you think about the \"there are no women on reddit/on the internet\" joke?",
  "data/reddit-ask/r/AskWomen/comments/oyjhx2/women_of_reddit_who_dont_have_a_dream_job_or.json": "Women of Reddit who don’t have a “dream job” or “dream career,” how are you doing mentally and job-wise?",
  "data/reddit-ask/r/AskWomen/comments/oyrhlp/at_what_point_did_you_realize_you_were_actually.json": "At what point did you realize you were actually kind of a cool person?",
  "data/reddit-ask/r/AskWomen/comments/oysh6u/what_was_your_happiest_moment_in_the_past_year.json": "What was your happiest moment in the past year?",
  "data/reddit-ask/r/AskWomen/comments/oywwai/what_nail_polish_brand_is_actually_longlasting.json": "What nail polish brand is ACTUALLY long-lasting?",
  "data/reddit-ask/r/AskWomen/comments/oza7dq/women_who_watched_sex_and_the_city_what_were_the.json": "Women who watched Sex and the City, what were the most toxic things you remembered being represented as \"normal\"",
  "data/reddit-ask/r/AskWomen/comments/ozcxlx/do_believe_right_person_wrong_time_is_a_real.json": "Do believe 'right person, wrong time' is a real thing? What are your experiences of this?",
  "data/reddit-ask/r/AskWomen/comments/ozpqt6/why_is_it_so_difficult_not_to_be_insecure_of.json": "Why is it so difficult not to be insecure of other girls?",
  "data/reddit-ask/r/AskWomen/comments/oztax8/what_do_you_do_when_you_want_a_hug_really_bad_but.json": "What do you do when you want a hug really bad but have no one to hug?",
  "data/reddit-ask/r/AskWomen/comments/ozx0oq/do_you_perpetually_feel_like_you_are_dieting_need.json": "Do you perpetually feel like you are dieting, need to diet, or constantly judgmental of your diet? Is this a huge part of your life? When did it start? What are the inner tapes? How does it make you feel?",
  "data/reddit-ask/r/AskWomen/comments/ozyi9o/women_who_dont_post_their_social_life_on_social.json": "Women who don't post their social life on social media, why?",
  "data/reddit-ask/r/AskWomen/comments/p0cbn3/women_who_are_in_a_long_term_relationshipmarriage.json": "Women who are in a long term relationship/marriage (8+ years), is there a decay in your sex life/ partner chemistry, desire etc? How you cope with it?",
  "data/reddit-ask/r/AskWomen/comments/p0n9hy/if_axe_is_associated_with_middle_school_boys_what.json": "If axe is associated with middle school boys, What perfume was associated with middle school girls?",
  "data/reddit-ask/r/AskWomen/comments/p0ya21/south_asian_women_what_are_some_things_about_our.json": "South Asian women, what are some things about our bodies that you would like to normalise for other South Asian women here?",
  "data/reddit-ask/r/AskWomen/comments/p10tlz/what_are_some_unspoken_rules_of_sis_code.json": "What are some unspoken rules of sis code ?",
  "data/reddit-ask/r/AskWomen/comments/p1234f/what_was_cool_when_you_were_young_but_isnt_cool.json": "What was cool when you were young but isn’t cool now?",
  "data/reddit-ask/r/AskWomen/comments/p1gifn/what_are_some_of_the_things_we_canshould_cheap.json": "What are some of the things we can/should cheap out on?",
  "data/reddit-ask/r/AskWomen/comments/p1hy8c/women_of_reddit_what_is_the_dumbest_way_you_were.json": "Women of Reddit, what is the dumbest way you were \"mansplained\" something?",
  "data/reddit-ask/r/AskWomen/comments/p1m0xk/has_anyone_who_didnt_want_children_at_all.json": "Has anyone who didnt want children at all actually changed their mind when they met their partner. If so why?",
  "data/reddit-ask/r/AskWomen/comments/p1qtrj/women_who_regretted_ending_a_relationship_after.json": "Women who regretted ending a relationship after some months or years later, why do you regret?",
  "data/reddit-ask/r/AskWomen/comments/p1s5zs/what_was_the_best_aspect_of_your_worst.json": "What was the best aspect of your worst relationship? What’s the worst aspect of your best?",
  "data/reddit-ask/r/AskWomen/comments/p1t6fj/how_do_you_remain_calm_and_not_react_when_your.json": "How do you remain calm and not react when your blood is boiling?",
  "data/reddit-ask/r/AskWomen/comments/p209yi/women_who_work_out_how_do_you_motivate_yourself.json": "Women who work out, how do you motivate yourself even on days you feel terrible and can’t stop comparing yourself to others?",
  "data/reddit-ask/r/AskWomen/comments/p21mz7/women_with_male_friends_what_are_your_thoughts_on.json": "Women with male friends, what are your thoughts on having to give up a good friend because his wife doesn't trust him?",
  "data/reddit-ask/r/AskWomen/comments/p2fmxy/have_you_had_an_i_deserve_better_moment_in_a.json": "Have you had an “I deserve better” moment in a relationship? What was it?",
  "data/reddit-ask/r/AskWomen/comments/p2kzmh/what_are_some_things_that_you_and_your_partner.json": "What are some things that you and your partner absolutely need to be on the same page about before getting married?",
  "data/reddit-ask/r/AskWomen/comments/p2mxab/whats_the_most_grossed_out_youve_been_from.json": "What's the most grossed out you've been from visiting a potential partner's home for the first time? Was it a deal-breaker?",
  "data/reddit-ask/r/AskWomen/comments/p2nttf/what_are_your_favorite_screening_questions_for.json": "What are your favorite screening questions for red flags on first dates?",
  "data/reddit-ask/r/AskWomen/comments/p2wx14/whats_your_best_method_for_clearing_your_mind_and.json": "What’s your best method for clearing your mind and feel stronger and more resilient emotionally when you’re worried, stressed, or upset?",
  "data/reddit-ask/r/AskWomen/comments/p33v57/what_do_you_think_about_when_you_exercise.json": "What do you think about when you exercise?",
  "data/reddit-ask/r/AskWomen/comments/p3ag09/whats_the_most_embarrassing_youve_been.json": "What's the most embarrassing you've been hospitalized for?",
  "data/reddit-ask/r/AskWomen/comments/p3anm2/women_who_catch_themselves_thinking_misogynistic.json": "Women who catch themselves thinking misogynistic thoughts - how do you stop and correct yourself when this occurs?",
  "data/reddit-ask/r/AskWomen/comments/p3hmun/what_do_a_lot_of_parents_do_that_screws_up_their.json": "What do a lot of parents do that screws up their kid?",
  "data/reddit-ask/r/AskWomen/comments/p3lowy/whats_the_longest_amount_of_time_youve_not_had.json": "What's the longest amount of time you've not had sex with your long term partner?",
  "data/reddit-ask/r/AskWomen/comments/p3nkom/what_is_a_timeless_female_name_one_that_works_for.json": "What is a timeless female name, one that works for both a baby girl and an old lady?",
  "data/reddit-ask/r/AskWomen/comments/p3qj81/have_you_ever_been_called_difficult_because_you.json": "Have you ever been called difficult because you have standards? How did you work on accepting it?",
  "data/reddit-ask/r/AskWomen/comments/p3r3ji/women_what_is_your_so_insecure_about_that_you.json": "Women, what is your SO insecure about that you actually love about them?",
  "data/reddit-ask/r/AskWomen/comments/p3y0wb/what_beautyskincare_routine_is_a_myth.json": "What beauty/skincare routine is a myth?",
  "data/reddit-ask/r/AskWomen/comments/p40l0e/what_seems_like_a_good_thing_in_a_relationship.json": "What seems like a good thing in a relationship, but you've learned is really a red flag?",
  "data/reddit-ask/r/AskWomen/comments/p44dwt/do_you_watch_porn_if_no_why_not.json": "Do you watch porn? If no, why not?",
  "data/reddit-ask/r/AskWomen/comments/p44tri/women_how_do_you_deal_with_huge_crushes_when_in_a.json": "Women, How do you deal with huge crushes when in a relationship. Those that were crushes before you met your partner and also those that become crushes after and are persistent on you?",
  "data/reddit-ask/r/AskWomen/comments/p451ed/what_cool_things_have_you_bought_yourself_lately.json": "What cool things have you bought yourself lately?",
  "data/reddit-ask/r/AskWomen/comments/p47ftn/how_often_do_you_have_explicit_sexual_fantasies.json": "How often do you have explicit sexual fantasies about people you arent dating?",
  "data/reddit-ask/r/AskWomen/comments/p4c3s1/to_women_who_are_very_comfortable_being_single.json": "To women who are very comfortable being single, what would lead you to pursue a committed relationship?",
  "data/reddit-ask/r/AskWomen/comments/p4cll6/whats_something_you_refuse_to_accept_or_put_up.json": "What’s something you refuse to accept or put up with?",
  "data/reddit-ask/r/AskWomen/comments/p4ddnp/what_would_you_like_to_change_in_this.json": "What would you like to change in this world/society to make it a better place to live for women?",
  "data/reddit-ask/r/AskWomen/comments/p4e804/whats_your_favorite_underappreciated_movie.json": "What’s your favorite under-appreciated movie?",
  "data/reddit-ask/r/AskWomen/comments/p4hkfv/what_do_you_do_when_you_notice_men_staring_at_you.json": "What do you do when you notice men staring at you?",
  "data/reddit-ask/r/AskWomen/comments/p4o23q/what_physical_feature_do_you_humblebrag_about.json": "What physical feature do you humble-brag about?",
  "data/reddit-ask/r/AskWomen/comments/p4sqzr/what_was_the_most_frustrating_thing_to_happen_to.json": "What was the most frustrating thing to happen to you?",
  "data/reddit-ask/r/AskWomen/comments/p4v8us/serious_what_do_you_think_the_future_is_going_to.json": "[Serious] What do you think the future is going to be like for people who refuse to have instagram, facebook, snapchat, tiktok and the like?",
  "data/reddit-ask/r/AskWomen/comments/p4y70s/women_who_typically_need_30_minutes_of_forplay.json": "Women who typically need 30+ minutes of forplay before you can have an orgasm with a partner, how long does it take you to have an orgasm alone if you masturbate? Does it still take a similar amount of lead up time or do you typically orgasm faster when you do it by yourself while alone?",
  "data/reddit-ask/r/AskWomen/comments/p509gs/how_old_were_you_when_you_first_gave_your_heart.json": "How old were you when you first gave your heart fully away and went all in on a relationship?",
  "data/reddit-ask/r/AskWomen/comments/p54nir/women_married_to_the_person_they_love_most_in_the.json": "Women married to the person they love most in the world...what's it like?",
  "data/reddit-ask/r/AskWomen/comments/p5eazs/who_is_the_most_annoying_character_in_a_tv_show.json": "Who is the most annoying character in a Tv show according to you?",
  "data/reddit-ask/r/AskWomen/comments/p5jlk4/how_do_you_feel_okay_about_working_how_do_you.json": "How do you feel okay about working? How do you stop feeling that horrible sense of dread when you're sitting in the car before entering the building?",
  "data/reddit-ask/r/AskWomen/comments/p5m01o/whats_in_your_room_right_now_that_most_people.json": "What's in your room right now that most people probably don't have in theirs?",
  "data/reddit-ask/r/AskWomen/comments/p5ot4l/what_is_one_of_the_dumbest_reasons_youve_been.json": "What is one of the dumbest reasons you’ve been called a slut?",
  "data/reddit-ask/r/AskWomen/comments/p5zg0f/women_and_girls_in_afganistan_are_losing_their.json": "Women and girls in Afganistan are losing their freedom and rights. How do you cope with the rage and the feeling of being helpless in the face of this injustice?",
  "data/reddit-ask/r/AskWomen/comments/p6badf/what_is_your_i_know_it_sounds_weird_but_just_try.json": "What is your \"I know it sounds weird, but just try it\" thing?",
  "data/reddit-ask/r/AskWomen/comments/p6cu1o/women_with_toxic_neglectful_mothers_how_did_you.json": "Women with toxic, neglectful mothers, how did you learn to cope with your poor relationship with your mom? How did it change how you viewed women in general? Did it change which women you let into your life?",
  "data/reddit-ask/r/AskWomen/comments/p6k7s7/women_who_have_taken_back_partners_who_cheated_on.json": "Women who have taken back partners who cheated on you, how did it work out in the long run?",
  "data/reddit-ask/r/AskWomen/comments/p6n6q8/what_is_something_you_thought_you_liked_about.json": "What is something you thought you liked about your partner untill you started living with them?",
  "data/reddit-ask/r/AskWomen/comments/p6n8fb/what_are_some_notverycostly_self_care_practices.json": "What are some not-very-costly self care practices?",
  "data/reddit-ask/r/AskWomen/comments/p6tapf/what_was_the_best_time_youve_ever_had_with_your.json": "What was the best time you’ve ever had with your mom?",
  "data/reddit-ask/r/AskWomen/comments/p6tvl5/whats_something_youre_better_at_than_anyone_you.json": "What's something you're better at than anyone you know?",
  "data/reddit-ask/r/AskWomen/comments/p6u29y/have_you_ever_cried_during_sex_what_happened_how.json": "Have you ever cried during sex? What happened, how did your partner take it?",
  "data/reddit-ask/r/AskWomen/comments/p73ret/if_you_didnt_have_to_worry_about_money_what_would.json": "If you didn’t have to worry about money, what would you do with your time?",
  "data/reddit-ask/r/AskWomen/comments/p75ji0/what_actors_are_you_always_excited_to_see_in_a.json": "What actor/s are you always excited to see in a show or movie?",
  "data/reddit-ask/r/AskWomen/comments/p78of9/whats_the_best_documentary_you_have_seen_on.json": "What’s the best documentary you have seen on Netflix?",
  "data/reddit-ask/r/AskWomen/comments/p7dr4n/women_of_reddit_what_makes_you_regret_the_most_in.json": "Women of Reddit, what makes you regret the most in your 20s?",
  "data/reddit-ask/r/AskWomen/comments/p7e28o/what_are_normal_things_youve_been_shamed_for.json": "What are normal things you’ve been shamed for because you’re a woman (e.g. hairy armpit, boob sweat)?",
  "data/reddit-ask/r/AskWomen/comments/p7moq5/whats_something_that_no_amount_of_peer_pressure.json": "What's something that no amount of peer pressure will make you do?",
  "data/reddit-ask/r/AskWomen/comments/p7mpog/who_is_your_favorite_female_singer.json": "Who is your favorite female singer?",
  "data/reddit-ask/r/AskWomen/comments/p7ngq8/what_is_a_movie_you_can_watch_again_and_again.json": "What is a movie you can watch again and again?",
  "data/reddit-ask/r/AskWomen/comments/p7rim8/whats_something_that_youre_genuinely_surprised.json": "What's something that you're genuinely surprised hasn't been invented yet?",
  "data/reddit-ask/r/AskWomen/comments/p7sam2/serious_onlyfans_content_creators_of_reddit_what.json": "[Serious] OnlyFans content creators of Reddit: what will you be doing once OnlyFans bans adult content this October? And what are your thoughts on the ban?",
  "data/reddit-ask/r/AskWomen/comments/p82wcl/whats_your_all_time_pickmeup_movieshow.json": "What's your all time pick-me-up movie/show?",
  "data/reddit-ask/r/AskWomen/comments/p8aa4n/high_libido_ladies_how_does_it_affect_you_when.json": "High libido ladies, how does it affect you when you are not getting any?",
  "data/reddit-ask/r/AskWomen/comments/p8ak50/whats_something_you_like_about_your_body_as_you.json": "What's something you like about your body as you get older?",
  "data/reddit-ask/r/AskWomen/comments/p8fwdp/which_city_left_a_mark_in_your_heart_deeper_than.json": "Which city left a mark in your heart deeper than the others? And why?",
  "data/reddit-ask/r/AskWomen/comments/p8r18z/what_initially_attracted_you_to_your_partner.json": "What initially attracted you to your partner?",
  "data/reddit-ask/r/AskWomen/comments/p8x06z/ladies_who_refer_to_yourselves_and_others_as.json": "Ladies who refer to yourselves and others as “females,” why?",
  "data/reddit-ask/r/AskWomen/comments/p8zeq0/what_is_a_trait_your_partner_must_have_whatsoever.json": "What is a trait your partner must have whatsoever to make the relationship work?",
  "data/reddit-ask/r/AskWomen/comments/p95ppu/ladies_if_youre_going_to_sit_at_a_bar_alone_what.json": "Ladies, if you’re going to sit at a bar alone, what are some must-do’s and never-do’s?",
  "data/reddit-ask/r/AskWomen/comments/p9druv/ladies_who_are_desired_sexually_more_than_they.json": "Ladies who are desired sexually more than they are romantically: how do you cope? How has it affected you in general?",
  "data/reddit-ask/r/AskWomen/comments/p9gd1c/what_is_something_that_you_didnt_realize_other.json": "What is something that you didn’t realize other people did until you lived with someone else?",
  "data/reddit-ask/r/AskWomen/comments/p9jlav/what_sexist_bullshit_are_you_sick_of_seeing_on.json": "What sexist bullshit are you sick of seeing on Reddit?",
  "data/reddit-ask/r/AskWomen/comments/p9potv/what_small_things_have_you_come_to_appreciate.json": "What small things have you come to appreciate about your life as you’ve gotten older?",
  "data/reddit-ask/r/AskWomen/comments/p9xqht/what_is_your_least_favourite_colour_too_wear.json": "What is your least favourite colour too wear ?",
  "data/reddit-ask/r/AskWomen/comments/pa7iku/what_chore_do_you_dread_doing.json": "What chore do you dread doing?",
  "data/reddit-ask/r/AskWomen/comments/pa8tpb/whats_something_you_saw_coming_from_miles_away.json": "What's something you saw coming from miles away that other people didn't?",
  "data/reddit-ask/r/AskWomen/comments/paj9pn/what_habitsinterests_of_your_partner_would_you.json": "What habits/interests of your partner would you have found awful in someone before you started dating your significant other but now it's kind of \"it is what it is\" ?",
  "data/reddit-ask/r/AskWomen/comments/pajvw4/women_what_are_some_redflags_in_another_woman.json": "Women, what are some redflags in another woman that wouldn't make you want to befriend them?",
  "data/reddit-ask/r/AskWomen/comments/pamv78/how_much_do_you_actually_share_with_your_friends.json": "How much do you actually share with your friends about sex with your partner or with someone you hooked up with?",
  "data/reddit-ask/r/AskWomen/comments/paoo6f/which_proven_beauty_tip_you_have_tried_that.json": "Which proven beauty tip you have tried that actually works?",
  "data/reddit-ask/r/AskWomen/comments/paqmnf/what_is_something_you_genuinely_dont_give_a_fuck.json": "What is something you genuinely don't give a fuck about?",
  "data/reddit-ask/r/AskWomen/comments/pashan/women_of_reddit_what_do_you_wish_you_knew_about.json": "Women of Reddit, what do you wish you knew about buying a house before you bought your house?",
  "data/reddit-ask/r/AskWomen/comments/patm2s/what_is_something_that_you_wish_was_free.json": "What is something that you wish was free?",
  "data/reddit-ask/r/AskWomen/comments/pb1qx7/ladies_which_celebrities_according_to_you_are.json": "Ladies, which celebrities according to you are criticised unjustly and why?",
  "data/reddit-ask/r/AskWomen/comments/pb2v2y/why_do_you_think_reddit_is_more_common_among_men.json": "Why do you think reddit is more common among men as opposed to women? Around 70% of users are men...I find reddit very informative.",
  "data/reddit-ask/r/AskWomen/comments/pb7d5v/whats_a_piece_of_media_that_you_think_gets.json": "What’s a piece of media that you think gets unfairly disrespected because it doesn’t appeal to men?",
  "data/reddit-ask/r/AskWomen/comments/pbcedd/what_do_you_do_when_you_feel_a_depressive_episode.json": "What do you do when you feel a depressive episode coming?",
  "data/reddit-ask/r/AskWomen/comments/pbf2bb/how_would_you_feel_about_finding_out_that_someone.json": "How would you feel about finding out that someone you just started dating was in therapy?",
  "data/reddit-ask/r/AskWomen/comments/pbghqn/what_do_you_consider_to_be_a_sign_of_weakness_in.json": "What do you consider to be a sign of weakness in a person?",
  "data/reddit-ask/r/AskWomen/comments/pbl92u/when_did_you_realize_your_standards_needed_to_be.json": "When did you realize your standards needed to be higher?",
  "data/reddit-ask/r/AskWomen/comments/pbyak3/whats_something_even_when_its_bad_is_still_good.json": "What's something even when it's bad is still good ?",
  "data/reddit-ask/r/AskWomen/comments/pbz50y/how_do_you_recognize_red_flags_in_yourself_what.json": "How do you recognize red flags in yourself? What red flags have you noticed and how did you address them, if at all?",
  "data/reddit-ask/r/AskWomen/comments/pc1fc0/whats_something_that_improved_your_quality_of.json": "What's something that improved your quality of life so much, you wish you did it sooner?",
  "data/reddit-ask/r/AskWomen/comments/pc89qd/women_who_train_to_get_a_semimuscled_physique_how.json": "Women who train to get a semi-muscled physique, how do you keep up with eating appropriate protein so as to not lose muscle mass?",
  "data/reddit-ask/r/AskWomen/comments/pcd0rt/which_animal_scares_you_most.json": "Which animal scares you most?",
  "data/reddit-ask/r/AskWomen/comments/pcg6k6/at_what_age_did_you_move_out_on_your_own.json": "At what age did you move out on your own?",
  "data/reddit-ask/r/AskWomen/comments/pcitsh/how_do_you_feel_about_putting_pineapple_on_pizza.json": "How do you feel about putting pineapple on pizza?",
  "data/reddit-ask/r/AskWomen/comments/pcjzak/what_morning_routine_has_helped_you_with_your.json": "What morning routine has helped you with your mental health tremendously?",
  "data/reddit-ask/r/AskWomen/comments/pclq0j/what_item_have_you_carried_in_your_purse_the.json": "What item have you carried in your purse the longest but never used?",
  "data/reddit-ask/r/AskWomen/comments/pcn85t/what_depiction_of_women_in_the_media_made_you.json": "What depiction of women in the media made you eye-roll the hardest?",
  "data/reddit-ask/r/AskWomen/comments/pcxife/what_mental_health_cliche_do_you_hate.json": "What mental health cliche do you hate?",
  "data/reddit-ask/r/AskWomen/comments/pczrs5/what_is_the_most_ridiculous_fashion_trend_you.json": "What is the most ridiculous fashion trend you have ever seen?",
  "data/reddit-ask/r/AskWomen/comments/pd2pjk/independent_single_women_whats_your_ideal.json": "Independent single women, what's your ideal relationship like?",
  "data/reddit-ask/r/AskWomen/comments/pd6eqh/whats_a_hard_decision_you_made_that_worked_out.json": "What's a hard decision you made that worked out for the best looking back on it?",
  "data/reddit-ask/r/AskWomen/comments/pd78r0/what_is_the_age_gap_between_you_and_your_so.json": "What is the age gap between you and your SO?",
  "data/reddit-ask/r/AskWomen/comments/pdf0mc/women_who_realized_how_codependent_they_were_on.json": "Women who realized how codependent they were on their partners, how did you learn to step back and regain your independence?",
  "data/reddit-ask/r/AskWomen/comments/pdj0ar/what_are_some_things_you_wish_you_were_taught_in.json": "what are some things you wish you were taught in sex ed?",
  "data/reddit-ask/r/AskWomen/comments/pdjz3c/what_is_the_income_gap_between_you_and_your_so.json": "What is the income gap between you and your SO?",
  "data/reddit-ask/r/AskWomen/comments/pdlnv7/what_was_the_worst_timing_where_you_got_your.json": "What was the worst timing where you got your period?",
  "data/reddit-ask/r/AskWomen/comments/pdqyjp/what_makes_you_feel_better_when_you_are_very.json": "What makes you feel better when you are very depressed?",
  "data/reddit-ask/r/AskWomen/comments/pds8l2/whats_a_small_thing_that_feels_like_a_luxury_to.json": "What’s a small thing that feels like a luxury to you but isn’t really?",
  "data/reddit-ask/r/AskWomen/comments/pdt0jq/women_whove_been_proposed_to_were_to_actually.json": "Women who’ve been proposed to, were to ACTUALLY surprised?",
  "data/reddit-ask/r/AskWomen/comments/pdtrfl/what_are_things_that_women_on_the_spectrum_would.json": "What are things that women on the spectrum would like others to know about them?",
  "data/reddit-ask/r/AskWomen/comments/pduhcu/what_style_do_you_love_but_feel_you_cant_pull_off.json": "What style do you love but feel you can’t pull off?",
  "data/reddit-ask/r/AskWomen/comments/pe4gjx/women_who_know_how_to_look_put_together_whats_one.json": "Women who know how to look \"put together\", what's one thing that really ups your game?",
  "data/reddit-ask/r/AskWomen/comments/pe5ip4/whats_the_thing_as_you_got_older_started_to.json": "What's the thing as you got older started to gradually realise about your mom?",
  "data/reddit-ask/r/AskWomen/comments/peevzb/how_can_we_stop_the_gender_bias_in_research_for.json": "How can we stop the gender bias in research for how diseases and symptoms present themselves in women?",
  "data/reddit-ask/r/AskWomen/comments/pef4q5/childfree_women_what_is_the_thing_you_cherish_the.json": "Child-free women: what is the thing you cherish the most about being child-free?",
  "data/reddit-ask/r/AskWomen/comments/pegr89/women_who_have_lost_a_parent_at_a_young_age_how.json": "Women who have lost a parent at a young age, how do you feel it has affected you in the long run?",
  "data/reddit-ask/r/AskWomen/comments/pejych/women_of_reddit_what_are_some_of_the_most.json": "Women of Reddit, what are some of the most beneficial small changes you’ve made in your life?",
  "data/reddit-ask/r/AskWomen/comments/petkyp/how_do_you_cope_with_never_feeling_like_you.json": "How do you cope with never feeling like you belong anywhere—that you're always out of place?",
  "data/reddit-ask/r/AskWomen/comments/pew6i8/how_do_you_get_yourself_to_get_up_early.json": "How do you get yourself to get up early?",
  "data/reddit-ask/r/AskWomen/comments/pewuq4/those_who_are_comfortable_going_braless_in_public.json": "Those who are comfortable going bra-less in public, how do you do it?",
  "data/reddit-ask/r/AskWomen/comments/pf19jt/women_who_have_given_up_on_makeup_how_did_you_do.json": "Women who have given up on makeup, how did you do it?",
  "data/reddit-ask/r/AskWomen/comments/pf27f6/childfree_women_what_are_the_downsides_to.json": "Child-free women: what are the downsides to choosing this kind of life (if there are any)?",
  "data/reddit-ask/r/AskWomen/comments/pf9n57/whats_a_piece_of_clothing_item_for_women_that_you.json": "What’s a piece of clothing item for women that you hate?",
  "data/reddit-ask/r/NoStupidQuestions/comments/ov588d/which_would_be_better_a_million_dollar_computer.json": "Which would be better, a million dollar computer from the year 2000, or a $2000 dollar computer from today?",
  "data/reddit-ask/r/NoStupidQuestions/comments/ovjvd5/i_got_fired_from_my_job_because_they_told_me_im.json": "I got fired from my job because they told me I’m ‘no spring chicken’. Can I file a lawsuit for unfair dismissal?",
  "data/reddit-ask/r/NoStupidQuestions/comments/ovyn2q/is_there_a_reason_why_the_official_branded_rubiks.json": "Is there a reason why the official, branded, Rubik's Cube is the stiffest and most difficult to align and twist? Why don't they improve it?",
  "data/reddit-ask/r/NoStupidQuestions/comments/ow5s3n/if_you_slathered_yourself_in_oil_and_then_swam.json": "If you slathered yourself in oil and then swam laps in a pool, would you swim faster or slower, and why?",
  "data/reddit-ask/r/NoStupidQuestions/comments/owe7dm/do_women_get_periods_during_a_coma.json": "Do women get periods during a coma ?",
  "data/reddit-ask/r/NoStupidQuestions/comments/ownusa/do_surgeons_actually_have_casual_conversations.json": "Do surgeons actually have casual conversations about their personal lives (or anything else really) while operating on someone, like it's often shown in movies and TV shows?",
  "data/reddit-ask/r/NoStupidQuestions/comments/ox69dh/why_do_only_humans_need_to_brush_their_teeth_this.json": "why do only humans need to brush their teeth? This may sound stupid but don't other animals eat food that has sugars like starch in them? Why don't they get cavities?",
  "data/reddit-ask/r/NoStupidQuestions/comments/ox9305/how_come_once_and_twice_are_commonly_used_but.json": "How come \"once\" and \"twice\" are commonly used but \"thrice\" isn't?",
  "data/reddit-ask/r/NoStupidQuestions/comments/oxlksc/if_i_grew_tired_of_physically_drinking_water.json": "If I grew tired of physically drinking water, could I just be hooked up to IV fluids for the rest of my life?",
  "data/reddit-ask/r/NoStupidQuestions/comments/oxsb1o/ladies_does_a_bulge_in_mens_pants_draws_your_gaze.json": "Ladies, does a bulge in mens' pants draws your gaze the same way nipples poking through a woman's shirt draws ours ?",
  "data/reddit-ask/r/NoStupidQuestions/comments/oxv4qx/is_training_a_bird_to_bring_me_money_it_finds_on.json": "is training a bird to bring me money it finds on the street illegal?",
  "data/reddit-ask/r/NoStupidQuestions/comments/oy1z1b/why_is_liberalism_seen_as_bad_when_more_liberal.json": "Why is liberalism seen as bad when more liberal countries are generally more developed?",
  "data/reddit-ask/r/NoStupidQuestions/comments/oy5zhx/does_every_sport_use_a_different_ball_are_there.json": "Does every sport use a different ball? Are there any examples of different sports that use the same ball?",
  "data/reddit-ask/r/NoStupidQuestions/comments/oyf8rk/my_wife_listens_to_podcasts_247_not_exaggerating.json": "My wife listens to podcasts 24/7 (not exaggerating). It’s not really bothering me but it’s reached a point where she gets angry/snaps when me or one of our kids tries to get her attention. Is this healthy behaviour? (She uses headphones)",
  "data/reddit-ask/r/NoStupidQuestions/comments/oygcsq/does_anyone_else_rotate_their_cups_plates.json": "Does anyone else rotate their cups, plates & silverware periodically so the bottom/back ones don’t feel left out?",
  "data/reddit-ask/r/NoStupidQuestions/comments/oylid2/if_i_train_crows_to_collect_money_around_my_city.json": "If I train crows to collect money around my city in exchange for food do I have to pay taxes on it?",
  "data/reddit-ask/r/NoStupidQuestions/comments/oynp39/if_you_made_a_bathroom_air_tight_could_you_use.json": "If you made a bathroom air tight, could you use the door to plunge the toilet?",
  "data/reddit-ask/r/NoStupidQuestions/comments/oyovv9/does_anyone_else_look_at_your_most_upvoted.json": "Does anyone else look at your most upvoted comments months after you've made them and think to yourself \"man I'm so funny\"",
  "data/reddit-ask/r/NoStupidQuestions/comments/oz4ooq/do_hentai_artists_draw_in_the_dick_then_censor_it.json": "Do hentai artists draw in the dick then censor it or just draw it in pixelly?",
  "data/reddit-ask/r/NoStupidQuestions/comments/oz7bcw/why_is_calling_asians_yellow_offensive_but.json": "Why is calling Asians “yellow” offensive but calling Africans “black” isn’t?",
  "data/reddit-ask/r/NoStupidQuestions/comments/ozck75/if_prostitution_is_illegal_but_porn_is_legal_why.json": "If prostitution is illegal but porn is legal, why don't the prostitutes and customers carry a camera? Instead of asking how much for sex ask how much to perform in a video? (USA)",
  "data/reddit-ask/r/NoStupidQuestions/comments/oze2gg/why_is_it_so_much_more_of_a_commitment_to_watch_a.json": "Why is it so much more of a commitment to watch a 2 hour long film than it is to binge-watch 5 hours of a TV Series?",
  "data/reddit-ask/r/NoStupidQuestions/comments/oznxoc/what_is_it_like_to_be_older_than_thirty_does_it.json": "What is it like to be older than thirty? Does it feel the same as when u were in your early twenties? Do you feel any different?",
  "data/reddit-ask/r/NoStupidQuestions/comments/ozq6qb/why_do_people_in_the_same_professional_circle.json": "Why do people in the same professional circle marry each other? doctor with doctor, teacher with teacher, lawyer with lawyer etc.",
  "data/reddit-ask/r/NoStupidQuestions/comments/ozxqm7/why_isnt_caffeine_included_in_nutrition_facts.json": "Why isn't caffeine included in nutrition facts?",
  "data/reddit-ask/r/NoStupidQuestions/comments/ozxxq1/if_animals_followed_human_laws_eg_dont_kill_steal.json": "If animals followed human laws (eg don't kill, steal, commit adultery, etc.), which animals would be morally outstanding and which animal would be most immoral?",
  "data/reddit-ask/r/NoStupidQuestions/comments/p08hle/how_can_i_stop_reddit_from_suggesting_similar.json": "How can I stop reddit from suggesting similar communities that I don’t want in my feed?",
  "data/reddit-ask/r/NoStupidQuestions/comments/p098tr/is_it_still_considered_reading_if_im_listening_to.json": "Is it still considered ‘Reading’ if I’m listening to an audiobook while following along in a physical book?",
  "data/reddit-ask/r/NoStupidQuestions/comments/p09it0/after_decapitation_how_long_do_you_have_control.json": "After decapitation, how long do you have control over your facial muscles?",
  "data/reddit-ask/r/NoStupidQuestions/comments/p09zxx/what_happens_if_the_bag_of_cocaine_breaks_when.json": "What happens if the bag of cocaine breaks when you’re smuggling it in your butt?",
  "data/reddit-ask/r/NoStupidQuestions/comments/p0j8g2/when_people_get_surgery_to_have_an_organ_removed.json": "When people get surgery to have an organ removed is there just empty space left where the organ was? If yes, how do other organs not move into the space?",
  "data/reddit-ask/r/NoStupidQuestions/comments/p0ozbr/the_ufc_is_cool_and_all_but_where_can_i_watch.json": "The UFC is cool and all, but where can I watch some fat girls fight?",
  "data/reddit-ask/r/NoStupidQuestions/comments/p0q022/humans_kill_flies_because_they_annoy_us_not_for.json": "Humans kill flies because they annoy us, not for food. Do any other animals kill other species for reasons other than food or defense?",
  "data/reddit-ask/r/NoStupidQuestions/comments/p0qlhu/does_anyone_else_get_mad_about_imaginary.json": "Does anyone else get mad about imaginary situations that never happened?",
  "data/reddit-ask/r/NoStupidQuestions/comments/p0vkly/why_cant_most_jobs_pay_20_an_hour_so_anyone_whos.json": "Why can't most jobs pay $20+ an hour so anyone who's willing to work 40 hours a week can at least keep a roof over their head and eat everyday?",
  "data/reddit-ask/r/NoStupidQuestions/comments/p12cn3/if_spice_is_the_key_to_interstellar_travel_and.json": "If Spice is the key to interstellar travel and Arrakis is the only source of it, how did they find Arrakis?",
  "data/reddit-ask/r/NoStupidQuestions/comments/p16lgp/do_teachers_in_the_usa_really_buy_school_supplies.json": "Do teachers in the USA really buy school supplies for students? Why? Why don't student buy their own? For how many grades do teachers buy those supplies?",
  "data/reddit-ask/r/NoStupidQuestions/comments/p1cetj/is_there_anyway_to_stop_the_livestreams_of.json": "Is there anyway to stop the livestreams of pretentious musicians playing instruments appearing on my reddit feed?",
  "data/reddit-ask/r/NoStupidQuestions/comments/p1efiq/anyone_else_stay_up_really_late_just_to_be_alone.json": "Anyone else stay up really late just to be alone?",
  "data/reddit-ask/r/NoStupidQuestions/comments/p1m635/born_too_late_to_explore_the_earth_and_born_too.json": "\"Born too late to explore the Earth and born too early to explore the universe.\" Why don't we explore the oceans? More than 80% of the oceans are undiscovered/unmapped.",
  "data/reddit-ask/r/NoStupidQuestions/comments/p1rcn7/does_anyone_else_hate_being_in_the_kitchen_with.json": "Does anyone else hate being in the kitchen with other people? I love being in it by myself without anyone else.",
  "data/reddit-ask/r/NoStupidQuestions/comments/p1u1hb/im_lonely_but_i_want_to_be_alone_does_anybody.json": "I'm lonely but I want to be alone. Does anybody else experience this feeling?",
  "data/reddit-ask/r/NoStupidQuestions/comments/p1xfxs/is_it_possible_for_an_animal_to_develop_ptsd_like.json": "Is it possible for an animal to develop PTSD? Like a deer after a forest fire or something",
  "data/reddit-ask/r/NoStupidQuestions/comments/p2126h/not_saying_i_am_a_saint_but_how_is_it_possible.json": "Not saying I am a saint, but how is it possible for people to do the most immoral stuff like burn people alive/dismember/drown like psychologically i don’t get how it’s possible to be evil like that?",
  "data/reddit-ask/r/NoStupidQuestions/comments/p250xo/if_a_bug_flies_inside_my_car_and_then_i_drive_100.json": "If a bug flies inside my car and then I drive 100 miles..does the bug realize this (or anything) when it gets out?",
  "data/reddit-ask/r/NoStupidQuestions/comments/p2bcfk/imagine_a_wire_as_long_as_the_universe_with_a.json": "Imagine a wire as long as the universe with a person on each end, could they communicate instantly by pushing and pulling the wire? Could the transmission of a message thus be faster than the speed of light?",
  "data/reddit-ask/r/NoStupidQuestions/comments/p2bzx6/is_it_also_called_homophobia_if_someone_has_an.json": "Is it also called \"homophobia\" if someone has an actual fear of homosexuals instead of discriminating them?",
  "data/reddit-ask/r/NoStupidQuestions/comments/p2c6su/if_nonus_citizens_in_the_us_have_to_pay_taxes_but.json": "If non-US citizens in the US have to pay taxes but can’t vote, wouldn’t it be taxation without representation?",
  "data/reddit-ask/r/NoStupidQuestions/comments/p2hi9k/why_do_people_drink_nonalcoholic_beer_it_tastes.json": "Why do people drink non-alcoholic beer? It tastes like piss, it doesn’t get you drunk what’s the appeal? Why not have a soda instead?",
  "data/reddit-ask/r/NoStupidQuestions/comments/p2ja3n/if_you_raised_a_heterosexual_man_for_his_entire.json": "If you raised a heterosexual man for his entire life without ever seeing a woman, what would he sexually fantasize about? And when you finally showed him a woman, would everything snap into place immediately?",
  "data/reddit-ask/r/NoStupidQuestions/comments/p2mh0m/whenwhy_did_nudity_go_from_something_we_sculpt_in.json": "When/why did nudity go from something we sculpt in the town square to something we only view behind closed doors?",
  "data/reddit-ask/r/NoStupidQuestions/comments/p2rf5b/reddit_has_been_down_for_over_an_hour_how_did_you.json": "Reddit has been down for over an hour, how did you cope?",
  "data/reddit-ask/r/NoStupidQuestions/comments/p2rjgm/how_exactly_are_overfilled_dumptrucks_flinging.json": "How exactly are overfilled dumptrucks flinging rocks around on the highway \"not responsible for windshield damage\"?",
  "data/reddit-ask/r/NoStupidQuestions/comments/p2u8sn/if_you_get_heart_attack_when_having_a_boner_does.json": "If you get heart attack when having a boner does the boner stay?",
  "data/reddit-ask/r/NoStupidQuestions/comments/p2ym5w/how_do_women_not_constantly_get_camel_toe.json": "How do women not constantly get camel toe whenever they're wearing tight shit?",
  "data/reddit-ask/r/NoStupidQuestions/comments/p32bjz/why_dont_usa_include_taxes_in_their_prices_of.json": "Why don't USA include taxes in their prices of goods pre-calculated?",
  "data/reddit-ask/r/NoStupidQuestions/comments/p34c9o/when_cats_lick_to_clean_their_assholes_are_they.json": "When cats lick to clean their assholes, are they eating their own shit",
  "data/reddit-ask/r/NoStupidQuestions/comments/p36v6z/relatively_new_to_reddit_and_still_figuring.json": "Relatively new to Reddit and still figuring things out. How come sometimes there is an actual up/downvote number and other times it just says “Vote” with arrows but no number?",
  "data/reddit-ask/r/NoStupidQuestions/comments/p38e53/i_often_take_a_coffee_into_the_bathroom_when_i.json": "I often take a coffee into the bathroom when I take a shit. My wife thinks this is gross, since poo particles will get into my coffee. I figure if I'm smelling poo, it's getting into my mouth/nose/lungs anyway. Who's right?",
  "data/reddit-ask/r/NoStupidQuestions/comments/p39p9c/afghanistan_is_being_taken_again_by_the_taliban.json": "Afghanistan is being taken again by the Taliban. It appears to be incredibly easy - where have they been hiding for the last 20 years?? How is it happening so quickly?",
  "data/reddit-ask/r/NoStupidQuestions/comments/p3dos5/does_lifting_a_20lb_weight_ten_times_give_the.json": "Does lifting a 20lb weight ten times give the same benefit as lifting a 10lb weight twenty times?",
  "data/reddit-ask/r/NoStupidQuestions/comments/p3er3p/six_years_ago_gordon_ramsay_offered_a_redditor.json": "Six years ago, Gordon Ramsay offered a Redditor work experience in one of his restaurants. Does anyone know what came of it?",
  "data/reddit-ask/r/NoStupidQuestions/comments/p3jvhs/does_anyone_else_randomly_get_sad_because_you.json": "Does anyone else randomly get sad because you know that people you care about will pass away some day or that there are animals who are living their last days (in animal shelters) without being loved.",
  "data/reddit-ask/r/NoStupidQuestions/comments/p3noib/what_is_the_purpose_of_having_sex_except.json": "What is the purpose of having sex except procreation and pleasure?",
  "data/reddit-ask/r/NoStupidQuestions/comments/p3pmaq/what_was_americas_purpose_for_occupying.json": "What was America's purpose for occupying Afghanistan for 20 years if the Taliban is on the path to take control of the whole country as soon as they left?",
  "data/reddit-ask/r/NoStupidQuestions/comments/p3qoav/the_war_in_afghanistan_cost_us_taxpayers_24.json": "The War in Afghanistan cost US taxpayers $2.4 trillion. If Kabul falls to the Taliban, was it literally all for nothing?",
  "data/reddit-ask/r/NoStupidQuestions/comments/p47kyt/as_sea_levels_rise_do_mountains_get_shorter_since.json": "As sea levels rise, do mountains get \"shorter\", since their height is measured from sea level? Or will sea level be \"below\" the sea?",
  "data/reddit-ask/r/NoStupidQuestions/comments/p484pl/why_do_people_offer_prayers_after_natural.json": "Why do people offer prayers after natural disasters when God would be the one causing it in the first place?",
  "data/reddit-ask/r/NoStupidQuestions/comments/p4amse/i_took_a_shower_last_night_but_masturbated_this.json": "I took a shower last night but masturbated this morning. My mom is asking me why I’m taking another shower…..what is the best response?",
  "data/reddit-ask/r/NoStupidQuestions/comments/p4k9zn/does_anyone_else_feel_extreme_mental_fatigue_when.json": "Does anyone else feel extreme mental fatigue when you’re around a lot of people for a long time",
  "data/reddit-ask/r/NoStupidQuestions/comments/p4szjg/do_owners_of_subreddits_get_paid_or_are_they_just.json": "Do owners of subreddits get paid or are they just hours of time and effort doing it for some sweet sweet karma?",
  "data/reddit-ask/r/NoStupidQuestions/comments/p4wof1/im_getting_a_blood_test_tomorrow_and_im_really.json": "I'm getting a blood test tomorrow and I'm really nervous about it. Can someone please explain the entire procedure in as much detail as possible?",
  "data/reddit-ask/r/NoStupidQuestions/comments/p508e1/if_there_are_first_world_countries_and_a_third.json": "If there are first world countries and a third world countries, what and where are the second world countries? :D",
  "data/reddit-ask/r/NoStupidQuestions/comments/p5eubf/everyone_has_heard_of_area_51_but_where_are_areas.json": "Everyone has heard of Area 51, but where are areas 1 to 50 and are there areas 52 and above?",
  "data/reddit-ask/r/NoStupidQuestions/comments/p5hftr/whats_a_polite_alternative_way_to_say_none_of.json": "What’s a polite/ alternative way to say none of your business?",
  "data/reddit-ask/r/NoStupidQuestions/comments/p5nr4x/why_did_boomers_have_it_so_easy_what_made_it_so.json": "Why did boomers have it so easy? What made it so housing was affordable and jobs well paid?",
  "data/reddit-ask/r/NoStupidQuestions/comments/p64q9x/what_if_man_eventually_gets_to_say_the_63.json": "What if man eventually gets to, say, the 63 trillionth digit of PI, and it's discovered that there actually is a repeating pattern? What would that mean? How important would it be?",
  "data/reddit-ask/r/NoStupidQuestions/comments/p6keca/abandoned_as_a_child_youd_think_40_years_later_i.json": "Abandoned as a child, you'd think 40 years later I would have gotten over it by now, but I still have abandonment issues. I cry and get heartbroken and extremely oversensitive when people come and go in my life. When they go. Absolutely crushes me. Tears for weeks. How to deal with this as an adult?",
  "data/reddit-ask/r/NoStupidQuestions/comments/p6mv20/what_are_some_fun_mobile_games_that_dont_have.json": "What are some fun mobile games that don't have many ads, are actually fun, and are not just all scams with low production values and misleading ads?",
  "data/reddit-ask/r/NoStupidQuestions/comments/p6n3b3/instead_of_ladies_and_gents_bathrooms_why_dont_we.json": "Instead of ladies and gents bathrooms, why don't we have Stalls and Urinals as separate rooms? Stalls give you the privacy if needed and urinals can be for those just have the specific equipment required.",
  "data/reddit-ask/r/NoStupidQuestions/comments/p6t3o1/when_emailing_customer_service_is_it_annoying_to.json": "When emailing customer service, is it annoying to respond “thank you” in email if they’re helpful because it just adds you back to their queue or do they actually appreciate it?",
  "data/reddit-ask/r/NoStupidQuestions/comments/p6vu9i/if_i_bought_a_house_where_the_previous_owners_had.json": "If I bought a house where the previous owners had allowed in a vampire, is the vampire grandfathered in or would I need to allow it in again?",
  "data/reddit-ask/r/NoStupidQuestions/comments/p77quv/how_do_people_have_a_full_time_job_maintain.json": "How do people have a full time job, maintain romantic and social relationships, but also do various hobbies/interests? How?",
  "data/reddit-ask/r/NoStupidQuestions/comments/p7bygy/do_lawyers_hire_lawyers_to_defend_them_or_do_they.json": "Do lawyers hire lawyers to defend them, or do they defend themselves in court?",
  "data/reddit-ask/r/NoStupidQuestions/comments/p7cjan/is_it_possible_for_ones_sexuality_to_change_over.json": "Is it possible for one's sexuality to change over time, or is it fixed from birth?",
  "data/reddit-ask/r/NoStupidQuestions/comments/p7gp0w/are_there_calories_in_nonedibles_like_a_lump_of.json": "Are there calories in non-edibles, like a lump of coal or a block of iron?",
  "data/reddit-ask/r/NoStupidQuestions/comments/p7i2lv/why_doesnt_expensive_military_equipment_have_a.json": "Why doesn’t expensive military equipment have a kill switch or at least need a code to work that can render it useless if it falls into the hands of the enemy? A €50 phone seems to have more protection that a €1.4M drone!",
  "data/reddit-ask/r/NoStupidQuestions/comments/p83c12/since_there_are_light_frequencies_that_we_cant.json": "Since there are light frequencies that we can't see, does that mean that a rainbow is actually a wall of different colours, while we can only see a small fraction of it?",
  "data/reddit-ask/r/NoStupidQuestions/comments/p84vtk/does_anybody_actually_snore_like_shnoooor.json": "Does anybody actually snore like \"shnoooor mimimimimi\" ?",
  "data/reddit-ask/r/NoStupidQuestions/comments/p8fc8c/why_did_latin_die_it_seems_like_it_was_a_very.json": "Why did Latin die? It seems like it was a very important and wide spread language.",
  "data/reddit-ask/r/NoStupidQuestions/comments/p8hv72/was_there_a_karen_0_like_the_original_video_of_a.json": "Was there a Karen 0? Like the \"original\" video of a woman named Karen doing that typical Karen thing?",
  "data/reddit-ask/r/NoStupidQuestions/comments/p8j7oz/my_mental_health_is_degrading_and_i_have_nowhere.json": "My mental health is degrading, and I have nowhere to go. What do I do?",
  "data/reddit-ask/r/NoStupidQuestions/comments/p8ot6q/why_is_person_of_color_ok_but_colored_person_is.json": "Why is \"person of color\" OK but \"colored person\" is not?",
  "data/reddit-ask/r/NoStupidQuestions/comments/p8y656/has_there_ever_been_a_recorded_case_where_someone.json": "Has there ever been a recorded case where someone received a skin graft or and organ transplant involving skin where the skins were very different colors? Like a black person recieving a white person's hand? I understand they would like to get the pigments to match, but if you desperately need it?",
  "data/reddit-ask/r/NoStupidQuestions/comments/p91mvi/why_did_our_parents_tell_us_it_was_illegal_to.json": "Why did our parents tell us it was illegal to turn on the interior light in the car ?",
  "data/reddit-ask/r/NoStupidQuestions/comments/p93k9n/if_i_dip_my_dick_in_liquid_nitrogen_and_then_hit.json": "If I dip my dick in liquid nitrogen and then hit it with a hammer would it shatter like glass?",
  "data/reddit-ask/r/NoStupidQuestions/comments/p9cz2v/does_the_name_poland_have_anything_to_do_with_the.json": "Does the name “Poland” have anything to do with the polish word “pole” which means “fields”, since the country has lots of fields, or is it a coincidence?",
  "data/reddit-ask/r/NoStupidQuestions/comments/p9gpv3/are_pets_called_pets_because_we_pet_them_or_is.json": "Are pets called pets because we pet them, or is petting called petting because we pet our pets?",
  "data/reddit-ask/r/NoStupidQuestions/comments/p9mtrq/if_i_am_unconscious_for_some_reason_and_someone.json": "If i am unconscious for some reason and someone calls the ambulance for me in America and they transport me to a hospital. Am i forced to pay the bill even though i didn’t want or need the ambulance?",
  "data/reddit-ask/r/NoStupidQuestions/comments/p9nyx1/if_someone_masturbates_thinking_about_you_is_it.json": "If someone masturbates thinking about you is it offensive?",
  "data/reddit-ask/r/NoStupidQuestions/comments/p9oaax/why_are_bicycle_seats_so_uncomfortable_i.json": "Why are bicycle seats so uncomfortable? I literally feel like they go out of their way to make them hurt us lol",
  "data/reddit-ask/r/NoStupidQuestions/comments/p9ohz8/does_anyone_else_eat_penne_pasta_by_sliding_the.json": "Does anyone else eat penne pasta by sliding the tines of their fork through the pasta tubes rather than stabbing them or am I just weird?",
  "data/reddit-ask/r/NoStupidQuestions/comments/p9tnz7/is_it_normal_to_wake_up_in_the_morning_and_dread.json": "Is it normal to wake up in the morning and dread going to school? But when I'm there I really don't mind it.",
  "data/reddit-ask/r/NoStupidQuestions/comments/p9vfss/is_it_bad_that_im_only_getting_into_self.json": "Is it bad that I’m only getting into self improvement to impress women to get laid?",
  "data/reddit-ask/r/NoStupidQuestions/comments/pa5usj/how_does_cardi_b_have_a_show_on_facebook_after.json": "How does Cardi B have a “show” on Facebook after she admitted to drugging and robbing men before she was famous?",
  "data/reddit-ask/r/NoStupidQuestions/comments/pa68ke/if_i_fully_submerged_myself_in_a_liquid_but_i_was.json": "If I fully submerged myself in a liquid but I was hooked up to a blood transfusion machine to give me a constant supply of oxygenated blood, would I drown? Would I still have the breathing reflex and breathe in liquid?",
  "data/reddit-ask/r/NoStupidQuestions/comments/pabub6/does_everyone_else_have_the_not_dirty_but_not.json": "Does everyone else have the 'not dirty' but 'not clean' clothes chair in their room?",
  "data/reddit-ask/r/NoStupidQuestions/comments/papryf/why_do_people_want_children_when_it_requires_so.json": "Why do people want children when it requires so much work, time, money, etc… And creates so much stress and exhaustion? What is the point when you can avoid this??",
  "data/reddit-ask/r/NoStupidQuestions/comments/pb30sg/do_ma_r_rated_film_actors_pretend_to_have_sex_or.json": "Do MA / R rated film actors pretend to have sex, or do they actually have sex for the sake of an authentic sex scene?",
  "data/reddit-ask/r/NoStupidQuestions/comments/pb8bod/why_do_doctors_and_nurses_work_super_long_shifts.json": "Why do doctors and nurses work super long shifts. Wouldn’t they be mentally fresher working 8 hour shifts?",
  "data/reddit-ask/r/NoStupidQuestions/comments/pb92fl/what_is_it_that_makes_people_die_when_they_get.json": "What is it that makes people die when they get burnt alive?",
  "data/reddit-ask/r/NoStupidQuestions/comments/pbdt46/why_are_companies_pushing_the_return_to_office.json": "Why are companies pushing the \"return to office agenda\" if people have been working from home perfectly fine?",
  "data/reddit-ask/r/NoStupidQuestions/comments/pblrvo/what_is_it_with_everybody_commenting_nah_he.json": "What is it with everybody commenting “nah he tweakin” on Instagram?",
  "data/reddit-ask/r/NoStupidQuestions/comments/pbnape/if_you_get_pulled_over_and_arrested_while_you.json": "If you get pulled over and arrested while you have your dog with you, what happens to your dog?",
  "data/reddit-ask/r/NoStupidQuestions/comments/pbrzfb/why_do_caucasian_people_love_sun_tanning_so_much.json": "Why do caucasian people love sun tanning so much if we clearly know how damaging the sun can be to our bodies?",
  "data/reddit-ask/r/NoStupidQuestions/comments/pbt3x0/does_anyone_else_have_an_irrational_fear_of.json": "Does anyone else have an irrational fear of accidentally \"sharing\" a p*rn video when watching to other social media?",
  "data/reddit-ask/r/NoStupidQuestions/comments/pbwmvg/if_the_joker_from_the_dark_knight_was_real_how_do.json": "If the Joker from the Dark Knight was real, how do you think the US Government would be a ble to deal with his threats?",
  "data/reddit-ask/r/NoStupidQuestions/comments/pc6xwr/anyone_else_not_want_to_hang_out_with.json": "Anyone else not want to hang out with bosses/co-workers outside of work? Not because you dont like them(well,maybe) but you just want to keep work and home life totally seperate",
  "data/reddit-ask/r/NoStupidQuestions/comments/pcdxyu/am_i_a_simpleminded_idiot_for_liking_music_simply.json": "Am I a simple-minded idiot for liking music simply because I like the way it sounds and the emotions I feel when I listen to it?",
  "data/reddit-ask/r/NoStupidQuestions/comments/pciqm7/if_an_agent_is_working_undercover_and_in_the_role.json": "If an agent is working undercover, and in the role of the undercover agent, has to be, say, a McDonald's worker, will he get both salaries?",
  "data/reddit-ask/r/NoStupidQuestions/comments/pcnukt/why_is_ireland_so_wellknown_around_the_world.json": "Why is Ireland so well-known around the world despite having a low population and being geographically isolated?",
  "data/reddit-ask/r/NoStupidQuestions/comments/pd2dz0/is_it_weird_that_when_i_first_see_a_man_i_look_at.json": "Is it weird that when I first see a man, I look at the face then I look down at the man’s crotch when he’s wearing tight jeans, thin shorts or gray jogging pants?",
  "data/reddit-ask/r/NoStupidQuestions/comments/pd2w13/i_have_a_little_dime_size_house_spider_bro_in_the.json": "I have a little dime size house spider bro in the corner. I found a house fly my cat killed and put it in his web. He cut it out instead of saying thanks. Was is too big? Too dead? Too easy?",
  "data/reddit-ask/r/NoStupidQuestions/comments/pd4jba/can_you_describe_the_feeling_of_an_orgasm.json": "Can you describe the feeling of an orgasm?",
  "data/reddit-ask/r/NoStupidQuestions/comments/pd5pm1/people_who_think_kids_shouldnt_get_free_school.json": "People who think kids shouldn't get free school lunches, or other such \"socialist\" programs, what is it you are opposed to?",
  "data/reddit-ask/r/NoStupidQuestions/comments/pd6afp/whats_the_protocol_for_when_fire_alarms_happen_in.json": "What’s the protocol for when fire alarms happen in hospitals during operations? For example, a long operation with the patient being under anaesthesia, surely you can’t use lifts and you need to be sterile?",
  "data/reddit-ask/r/NoStupidQuestions/comments/pdiv3d/do_you_guys_talk_with_inanimate_objects_while.json": "Do you guys talk with inanimate objects while alone like they are actual people?",
  "data/reddit-ask/r/NoStupidQuestions/comments/pdks1m/why_is_it_okay_for_alcohol_in_the_us_to_not.json": "Why is it okay for alcohol in the US to not display any nutritional facts, especially the sugar content?",
  "data/reddit-ask/r/NoStupidQuestions/comments/pdmco9/why_do_70s_boobs_look_different.json": "Why do 70s boobs look different",
  "data/reddit-ask/r/NoStupidQuestions/comments/pdqc3l/why_do_americans_leave_the_teabag_in_their_cup_of.json": "Why do Americans leave the teabag in their cup of tea when they drink it?",
  "data/reddit-ask/r/NoStupidQuestions/comments/pdrj5j/do_you_know_anyone_who_puts_on_rubber_gloves.json": "Do you know anyone who puts on rubber gloves before they poo?! A buddy of mine does this, it seems very odd to me",
  "data/reddit-ask/r/NoStupidQuestions/comments/pe1v6x/do_men_take_condoms_with_them_on_every_night_out.json": "Do men take condoms with them on every night out?",
  "data/reddit-ask/r/NoStupidQuestions/comments/pe5i0e/where_can_i_a_common_citizen_get_my_hands_on.json": "Where can I, a common citizen, get my hands on large amounts of holy water?",
  "data/reddit-ask/r/NoStupidQuestions/comments/pe6k4p/im_14_getting_my_wisdom_teeth_pulled_out.json": "I'm 14 getting my wisdom teeth pulled out Wednesday. I'm so scared cuz like I saw a bunch of people on YouTube exposing their secrets and not trying to do that cuz, my mom....my mom is something else. Just wanted to know If I can control what I say",
  "data/reddit-ask/r/NoStupidQuestions/comments/pe6pf4/amazon_delivery_drivers_of_reddit_when_i_fill_out.json": "Amazon delivery drivers of Reddit, when I fill out the little survey post-delivery, do you get any kind of perks, or just meaningless internet points bestowed by your employer?",
  "data/reddit-ask/r/NoStupidQuestions/comments/pe815z/why_is_meghan_markle_hated_so_much.json": "Why is Meghan Markle hated so much?",
  "data/reddit-ask/r/NoStupidQuestions/comments/peivn5/if_everyone_knows_tony_stark_is_iron_man_then.json": "If everyone knows Tony Stark is Iron Man, then what's the problem with Peter Parker when everyone knows his identity",
  "data/reddit-ask/r/NoStupidQuestions/comments/peuz9m/anyone_else_feel_like_doing_daily_tasks_is_a.json": "Anyone else feel like doing daily tasks is a project, and takes away from other tasks?like if i clean my car im too tired to clean my home for a while, if i clean my home im too tired to take a shower, if i take a shower im too tired to do dishes and laundry. Why is this?",
  "data/reddit-ask/r/NoStupidQuestions/comments/pf0r93/how_come_mothers_and_fathers_dont_absolutely_lose.json": "How come mothers (and fathers) don’t absolutely lose their **** to newborns/babies screaming on and off on a daily basis??",
  "data/reddit-ask/r/NoStupidQuestions/comments/pf5g5z/lawyers_of_reddit_how_does_it_feel_to_work_for_an.json": "Lawyers of reddit, how does it feel to work for an obviously wrong side?",
  "data/reddit-ask/r/NoStupidQuestions/comments/pfak3f/this_girl_ignored_me_when_i_was_poor_and_while.json": "This girl ignored me when i was poor and while studying to get where Im supposed to and now she's reaching out since I'm in the news, making money and such. Would you ignore her?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ovht4n/does_your_woman_massage_your_balls_when_my_woman.json": "Does your woman massage your balls? When my woman and I go to bed she plays with my balls, more of a rubbing/massaging than sexual. It's gotten to the point (8 yrs now) where I have trouble sleeping without it. Just curious if others have experienced this.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ovud8q/why_do_so_many_people_have_issues_with_showing.json": "Why do so many people have issues with showing compassion and empathy? Why is it so difficult to treat everyone the same way?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ow3uai/why_are_conservatives_antivax_antilockdowns.json": "Why are conservatives anti-vax, anti-lockdowns, anti-masks? Are they anti-authority? If so, why do they support police at all?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/oxixmk/is_it_creepy_my_cousin_sleeps_with_her_13_year.json": "Is it creepy my cousin sleeps with her 13 year old son in bed every night?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/oxpojx/how_the_fuck_do_people_have_the_time_and_energy.json": "How the fuck do people have the time and energy to work and have hobbies? Or you know, work and do anything whatsoever?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/oxtk3u/why_is_it_considered_racist_to_mimic_the_accents.json": "Why is it considered racist to mimic the accents from China or Uganda(And more obviously)but doing Scottish, Irish, Australian (And more obviously) accents is not frowned upon?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/oy5h4g/why_am_i_supposed_to_be_outraged_at_billionaires.json": "Why am I supposed to be outraged at Billionaires paying for space vacations with their own money but feel pride when Nasa fucks around in Mars with my Tax Money?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/oymxgl/people_who_have_anal_sex_givers_and_receivers.json": "People who have anal sex (givers and receivers) - what’s the real talk/etiquette about the prep I need to do as a receiver? I’m talking hair removal and clean up (I of course shower with soap around and a little inside v thoroughly) - it’s my first time!",
  "data/reddit-ask/r/TooAfraidToAsk/comments/oz0hl8/do_people_with_partners_ever_mastubate_when_their.json": "Do people with partners ever mastubate when their partners are in the house or in bed?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/oz3wah/why_people_are_asking_a_hell_lot_of_am_i_being.json": "Why people are asking a hell lot of \"am i being sexually assaulted\" questions on this sub ? Why not contact the police or CPS directly ?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/oz9cul/how_normal_is_it_to_ask_someone_to_wear_a_condom.json": "how normal is it to ask someone to wear a condom before having intercourse/ ask them to get tested before having sex?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ozc8h8/do_straight_females_find_men_gay_porn_hot_like.json": "Do straight females find men gay porn hot like men do with lesbians?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ozu8i5/do_women_genuinely_enjoy_blowjob_or_is_it_a.json": "Do women genuinely enjoy blowjob or is it a forced obligation? Are guys being asshole for refusing to kiss after they are done with BJ?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/p08wzf/how_do_people_talk_regularly_everyday_or_at_least.json": "How do people talk regularly (everyday or at least twice a week) for hours on phone with friends, siblings, parents and/or partners? What do you talk about for so long?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/p0cckg/would_you_date_someone_who_said_god_comes_first.json": "Would you date someone who said god comes first in their life?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/p0dv5w/if_vegansvegetarians_all_dislike_meat_so_much_why.json": "If vegans/vegetarians all dislike meat so much why does everything have to resemble meat dishes, why is there fake bacon for example?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/p0k81b/what_parts_of_a_guys_body_peak_the_interest_of.json": "What parts of a guys body peak the interest of women? I honestly can't think of anything on us that's attractive.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/p0th6n/if_there_is_a_chip_shortage_in_the_world_wouldnt.json": "If there is a chip shortage in the world, wouldn't it make it difficult to get chips for billions of Vaccines?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/p10qxr/what_is_so_hard_about_wearing_masks_anyway.json": "What is so hard about wearing masks anyway?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/p1o44n/why_dont_any_of_the_plans_to_combat_climate.json": "Why don’t any of the plans to combat climate change involve human population control?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/p21kd9/why_the_fuck_is_everybody_asking_questions_about.json": "Why the fuck is everybody asking questions about if people masturbate?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/p2osbf/do_you_believe_that_lesbians_are_more_accepted_in.json": "Do you believe that lesbians are more accepted in society than gay men are?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/p2yywq/is_it_illegal_to_inseminate_yourself_with_semen.json": "Is it illegal to inseminate yourself with semen from a condom you find in a trash can?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/p30ycw/why_is_there_a_ban_on_plastic_straws_and_not.json": "Why is there a ban on plastic straws and not billionaires living out an astronaut fetish they all seem to have?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/p4k7e4/my_wife_told_me_to_be_open_if_i_ever_felt_the.json": "My wife told me to be open if I ever felt the urge to want to sleep with someone else… So I was open, and I told her I had the urge to… Now there doesn't seem to be any taking it back, and she hates me… What do I do?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/p5rgtu/are_squirts_real_or_just_pee.json": "Are squirts real or just pee?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/p5yms7/why_does_american_preferred_to_take_their_dogs.json": "Why does American preferred to take their dogs with them, and abandoned their Afghan allies?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/p5yxie/why_do_so_many_people_post_questions_here_when.json": "Why do so many people post questions here when they can Google it and get an answer instantly?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/p6p6t2/genuinely_not_trolling_why_has_it_been_ok_to_say.json": "Genuinely not trolling: why has it been ok to say a habit (nuns outfit) in black and white makes nuns look like a penguin for decades, but say a burkha looks like a postbox and everybody loses their minds? It’s just clothing!",
  "data/reddit-ask/r/TooAfraidToAsk/comments/p7eig8/why_is_it_acceptable_to_speak_in_a_fake_british.json": "Why is it acceptable to speak in a fake British, Australian, Irish, or Russian accent, but not an Asian accent?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/p7g45q/why_the_hell_do_people_pay_for_porn_when_there.json": "Why the hell do people pay for porn when there are millions of videos and pictures free online?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/p7tf6m/when_someone_asks_about_your_dick_size_do_they.json": "When someone asks about your dick size do they mean when it’s erect or flaccid?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/p83ndb/third_world_guy_here_do_you_guys_living_in_the.json": "Third world guy here, do you guys living in the first world ever feel privileged or thankful that you were born in a first world country?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/p85bxi/what_is_the_point_of_flavoured_condoms.json": "What is the point of flavoured condoms?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/p8ltlz/why_there_has_been_a_sudden_influx_of_sex_related.json": "Why there has been a sudden influx of sex related questions on this sub?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/p8q5m9/is_it_weird_to_rinse_shampoo_out_of_your_hair.json": "Is it weird to rinse shampoo out of your hair while showering with one eye open cause you think you’re about to get murdered?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/p8vs9z/why_do_so_many_people_drink_alcohol_before_sex.json": "Why do so many people drink alcohol before sex?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/p9dc7j/men_get_morning_wood_do_women_get_something.json": "Men get morning wood ,do women get something equivalent to that in the morning?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/p9u9so/if_you_completely_stop_masturbation_what_are.json": "if you completely stop masturbation, what are affects on your body?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pa6ol1/should_i_get_the_covid_vaccine.json": "Should I get the Covid Vaccine?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/paxyol/when_i_graduated_in_98_my_first_job_paid_35k_and.json": "When I graduated in '98, my first job paid 35k and my first home cost 214k. Today folks are still making 35k yet the same home costs 800k. How are you younger folks making it work?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pbqitk/why_does_it_feel_like_everything_went_to_shit.json": "Why does it feel like everything went to shit after the 90s?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pc9xh2/if_there_is_god_which_punishes_the_evil_and_bad.json": "If there is god which punishes the evil and bad people. How come he waited for 6 million deaths before killing hitler. How come small children have crippling disabilities and murderer politicians walk free?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pcabiu/why_is_it_important_for_lgbtq_characters_to_be.json": "Why is it important for LGBTQ+ characters to be played by LGBTQ+ Actors? It's acting for a reason right?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pcet7m/are_there_gay_incels.json": "Are there gay incels?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pcg34z/in_the_future_if_covid_has_disappeared_and_a_new.json": "In the future, if COVID has disappeared and a new disease appears, will the world be better prepared now or do you all think it will be another massive shit show?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pd328e/when_i_know_my_girlfriend_is_poopingwiping_and.json": "When i know my girlfriend is pooping/wiping and she exits without washing her hands, am i a dick for asking her to PLEASE wash her hands?!",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pdf6j2/how_are_so_many_women_religious_support_religion.json": "How are so many women \"religious\" (support religion) even after being fully aware that their religion is openly sexist against women?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pdrn9q/how_many_of_you_have_racist_thoughts_only_to_let.json": "How many of you have racist thoughts only to let your brain take over and tell you off for thinking of something like that?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pebm9v/why_the_hell_they_make_us_think_that_it_does_not.json": "Why the hell they make us think that it does not matter if someone is ugly or handsome since they will have the same opportunities? but that is a lie, people treat handsome people better than ugly people. What do you think about that?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/peh0et/any_other_women_out_there_ever_wondered_what_an.json": "Any other women out there ever wondered what an erection for a guy feels like or have been curious to see what he feels like when he experiences one ?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pepmya/im_not_trying_to_start_a_political_conversation.json": "I'm not trying to start a political conversation, just curious, why are those people who are poisoning themselves with horse wormer not being evaluated by a psychiatrist? Wouldn't that be considered a risk of hurting or killing yourself?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/pf2rf3/why_cant_we_make_misinformation_in_social_media.json": "Why can't we make misinformation in social media and news a crime? It's not a freedom of speech; it's a new form of terrorism.",
  "data/reddit-ask/r/askphilosophy/comments/oxs80r/is_it_morally_wrong_to_own_smartphones_given_the.json": "Is it morally wrong to own smartphones given the questionable(to say the least) treatment of their workers in every part of manufacturing.",
  "data/reddit-ask/r/askphilosophy/comments/p50d4f/in_superman_iii_the_dumb_blonde_is_shown_reading.json": "In Superman III, the “dumb blonde” is shown reading Kant's Critique of Pure Reason. She says “How can he say that pure categories have no objective meaning in transcendental logic? What about synthetic unity?” Having no familiarity with Kant, I always wondered if her comments have actual meaning?",
  "data/reddit-ask/r/askphilosophy/comments/p7mvnk/which_philosopher_scientist_mathematician_doctor.json": "Which philosopher, scientist, mathematician, doctor, or academic who are currently alive is considered the leading expert on research about consciousness?",
  "data/reddit-ask/r/askphilosophy/comments/pa04ro/undergrad_who_failed_some_philosophy_courses_due.json": "Undergrad who failed some philosophy courses due to depression, other grades merely okayish but really passionate in philosophy and want to spend my life in research and to do a PhD. Do I have a shot? How should I achieve my goal?",
  "data/reddit-ask/r/askphilosophy/comments/pceqal/if_someone_were_born_with_no_senses_sight_smell.json": "If someone were born with no senses (sight, smell, taste, touch, hearing), would they know that they exist?",
  "data/reddit-ask/r/askscience/comments/owkwtr/does_the_halflife_of_atoms_change_depending_on.json": "Does the half-life of atoms change depending on the molecule they are in? So for example can the half-life of any uranium isotope be any different if it's bound in uranium fluoride or sth.?",
  "data/reddit-ask/r/askscience/comments/ownwrz/sarscov2_has_been_found_in_dogs_deer_primates.json": "SARS-Cov-2 has been found in dogs, deer, primates, bats, etc. is it common for a virus to be so widely spread between species?",
  "data/reddit-ask/r/askscience/comments/oxu7tx/how_did_the_suez_canal_and_the_panama_canal.json": "How did the Suez Canal and the Panama Canal affect the local ecosystem in their area?",
  "data/reddit-ask/r/askscience/comments/ozh9mi/is_the_delta_variant_a_result_of_covid_evolving.json": "Is the Delta variant a result of COVID evolving against the vaccine or would we still have the Delta variant if we never created the vaccine?",
  "data/reddit-ask/r/askscience/comments/ozhtbl/why_doesnt_the_atmosphere_settle_into_different.json": "Why doesn't the atmosphere settle into different layers of the same gas molecules, seeing as how they have different densities?",
  "data/reddit-ask/r/askscience/comments/p221e8/whats_stopping_continents_today_from_breaking_off.json": "What's stopping continents today from breaking off and forming other continents like it did before? Or is it happening now and we just don't notice it?",
  "data/reddit-ask/r/askscience/comments/p232bk/does_fluoride_in_tap_water_really_have_any.json": "Does fluoride in tap water really have any noticeable effect on houseplants?",
  "data/reddit-ask/r/askscience/comments/p2pl62/does_the_delta_variants_higher_viral_load_have_an.json": "Does the Delta Variants higher viral load have an effect on the accuracy of quick swab antigen testing?",
  "data/reddit-ask/r/askscience/comments/p2ykcg/do_rockets_have_to_account_for_the_gravitational.json": "Do rockets have to account for the gravitational pull of the Sun?",
  "data/reddit-ask/r/askscience/comments/p3d3u3/do_other_monogamous_animals_ever_fall_out_of_love.json": "Do other monogamous animals ever \"fall out of love\" and separate like humans do?",
  "data/reddit-ask/r/askscience/comments/p3klux/ive_looked_everywhere_and_i_cant_find_an_answer.json": "I've looked everywhere and I can't find an answer. Can the shamwow absorb mercury?",
  "data/reddit-ask/r/askscience/comments/p3mobu/will_a_organ_that_was_donated_from_a_younger.json": "Will a organ that was donated from a younger person to an older person help minimize the aging process? Also, will the organ age faster due to the already aged organs around it?",
  "data/reddit-ask/r/askscience/comments/p4q0ho/what_purpose_does_inflammation_serve_in_immune.json": "What purpose does inflammation serve in immune response",
  "data/reddit-ask/r/askscience/comments/p5qz8m/are_there_viruses_who_can_replicate_in_the_human.json": "Are there viruses who can replicate in the human body without damage?",
  "data/reddit-ask/r/askscience/comments/p6apgk/this_may_sound_like_a_silly_question_but_how_is.json": "This may sound like a silly question but how is it, when a seed is planted in the ground, that it knows which way to grow? How can a seed, buried down in the darkness, know where the sun is so as to grows upwards and similarly know where the water is so as to grow the roots downwards?",
  "data/reddit-ask/r/askscience/comments/p6k52x/why_is_everyone_computing_tons_of_digits_of_pi.json": "Why is everyone computing tons of digits of Pi? Why not e, or the golden ratio, or other interesting constants? Or do we do that too, but it doesn't make the news? If so, why not?",
  "data/reddit-ask/r/askscience/comments/p6w2un/will_this_new_hiv_vaccine_moderna_is_starting.json": "Will this new HIV vaccine Moderna is starting trials will be just for people without HIV or people already with HIV will also ve able to take it (in case it gets available), therefore ending daily medication?",
  "data/reddit-ask/r/askscience/comments/p77ho4/whats_magnesium_role_in_the_human_body.json": "What’s magnesium role in the human body?",
  "data/reddit-ask/r/askscience/comments/p7ey5j/can_we_detect_relative_high_groundlevels_of.json": "Can we detect relative high ground-levels of radiation from Orbit? Would an Astronaut on the ISS holding a geiger-counter into the general direction of Earth when passing over Tschernobyl or Fukushima get a heightened response compared to the Amazon rainforest?",
  "data/reddit-ask/r/askscience/comments/p7h7ci/does_the_immune_system_help_fight_bacteria_along.json": "Does the immune system help fight bacteria along with antibiotics or do antibiotics do 100% of the 'work'?",
  "data/reddit-ask/r/askscience/comments/p7rism/what_is_actually_happening_in_the_brain_when_we.json": "What is actually happening in the brain when we trip out on mushrooms or LSD?",
  "data/reddit-ask/r/askscience/comments/p7sqpj/why_can_some_meats_eg_beef_be_eaten_raw_while.json": "Why can some meats (e.g beef) be eaten raw while others (chicken) need to be cooked?",
  "data/reddit-ask/r/askscience/comments/p86br5/how_does_thinking_about_breathing_turn_it_from_an.json": "How does thinking about breathing turn it from an automatic to a conscious act?",
  "data/reddit-ask/r/askscience/comments/p9bu8l/how_much_does_a_covid19_vaccine_lower_the_chance.json": "How much does a covid-19 vaccine lower the chance of you not spreading the virus to someone else, if at all?",
  "data/reddit-ask/r/askscience/comments/pa0yx6/why_doesnt_our_moon_rotate_and_what_would_happen.json": "Why doesn’t our moon rotate, and what would happen if it started rotating suddenly?",
  "data/reddit-ask/r/askscience/comments/pa1x5v/since_allergies_are_caused_by_immune_response_do.json": "Since allergies are caused by immune response, do immunocompromised individuals have less allergies?",
  "data/reddit-ask/r/askscience/comments/pb3k3k/why_are_there_so_many_islands_between_canada_and.json": "Why are there so many islands between Canada and Greenland? What natural process occurred to make that land formation?",
  "data/reddit-ask/r/askscience/comments/pc1akj/why_are_the_mirrors_of_the_james_webb_telescope.json": "Why are the mirrors of the James Webb telescope yellow?",
  "data/reddit-ask/r/askscience/comments/pcc5wa/in_space_two_pieces_of_metal_of_the_same_type.json": "In space, two pieces of metal of the same type will \"cold weld\" if they touch. Why does this happen, and what do space agencies do to avoid or prevent this?",
  "data/reddit-ask/r/askscience/comments/pczo25/why_do_legumes_mainly_thinking_about_peanuts_and.json": "Why do legumes (mainly thinking about peanuts and soybeans) seem to be more allergenic than other foods?",
  "data/reddit-ask/r/askscience/comments/pdeczd/how_do_white_blood_cells_or_any_immune_cell_move.json": "How do white blood cells or any immune cell move specifically towards the bacteria, virus, etc ?",
  "data/reddit-ask/r/askscience/comments/pdnuy5/a_concorde_has_a_pointy_nose_but_a_747_has_a.json": "A Concorde has a pointy nose, but a 747 has a round nose. At what speed and/or size is it better to have one shape than the other?",
  "data/reddit-ask/r/askscience/comments/pdvjum/has_a_tropical_storm_ever_crossed_central_america.json": "Has a tropical storm ever crossed Central America from the Atlantic to the Pacific and reformed to become a tropical storm again? Is it even possible?",
  "data/reddit-ask/r/askscience/comments/pe05cl/is_there_any_kind_of_an_upper_limit_for_how_many.json": "Is there any kind of an upper limit for how many planets can be in a solar system? I assume that there are plenty of systems with zero, but are there others with hundreds or thousands, or is there some kind of clear maximum?",
  "data/reddit-ask/r/askscience/comments/pf6cx7/does_electricity_pass_through_a_magnetised.json": "Does electricity pass through a magnetised substance in the same way as through an unmagnetised?",
  "data/reddit-ask/r/askscience/comments/pf9dlt/the_johnsonjohnson_oneshot_vaccine_never_seems_to.json": "The Johnson&Johnson one-shot vaccine never seems to be in the news, or statistics state that “X amount of people have their first shot”. Has J&J been effective as well? Will a booster be needed for it?"
}