{
  "data/reddit-stocks/r/stocks/comments/ttdukk/the_gme_dividend_stock_split_and_you.json": "Disclaimer: I do not currently hold ANY GameStop stock and haven’t for over a\nyear.\n\nOk so by now you may know GME is considering a stock split in the form of a\ndividend. We need to take a closer look at why the dividend matters.\n\nIn the case of a normal stock split, all shares and positions are…",
  "data/reddit-stocks/r/Bogleheads/comments/ttf4m5/vanguard_taking_in_nearly_1b_each_day.json": "Saw this tweet from Rick Ferri mentioning it and initially did a double take on\nit saying no way, but I guess when your managing what ... now $8T or so total, I\nguess a billion a day is another day at the office for the Vanguard Group\nemployees. Kudos to Jack for laying the…",
  "data/reddit-stocks/r/Bogleheads/comments/tthmda/is_a_03_expense_ratio_on_1000000_just_300.json": "Hi, am I understanding expense ratios correctly?\n\nIf I invest in VTI and the value of my investment reaches $1,000,000 then I\nessentially have paid $300?",
  "data/reddit-stocks/r/investing/comments/ttpttj/us_job_growth_solid_in_march_unemployment_rate.json": "From the article:\n\n> U.S. job growth continued at a brisk clip in March, with the unemployment rate\n> falling to a new two-year low of 3.6% and wages re-accelerating, positioning\n> the Federal Reserve to raise interest rates by a hefty 50 basis points in May.\n> \n> The Labor Department’s closely…",
  "data/reddit-stocks/r/investing/comments/ttpour/china_considers_giving_us_full_audit_to_alibaba.json": "Welp. There it goes again.\n\nThis was my post 10 days ago:\nhttps://www.reddit.com/r/investing/comments/tk3mvm/alibaba_stock_the_steal_of_a_lifetime/\n\n\n\nToday, China has announced it is considering giving the US FULL audit to Alibaba\n\nhttps://www.bloomberg.com/news/articles/2022-04-01/china-weighs…",
  "data/reddit-stocks/r/stocks/comments/ttpmv4/payrolls_rose_431000_in_march_despite_worries.json": "https://www.cnbc.com/2022/04/01/jobs-report-march-2022-.html\n\nAmid soaring inflation and worries about a looming recession, the U.S. economy\nadded slightly fewer jobs than expected in March as the labor market grew\nincreasingly tighter.\n\nNonfarm payrolls expanded by 431,000 for the month, while the…",
  "data/reddit-stocks/r/stocks/comments/ttw5xc/cannabis_bill_passed_the_house_220204.json": "https://thehill.com/news/house/3256370-house-approves-bill-legalizing-marijuana/amp/\n\nJust a few minutes ago, the bill passed the house 220-204 with 3 republicans\njoining all but 2 democrats\n\nThe measure now goes to the Senate, where Majority Leader Charles Schumer\n(D-N.Y.) is working with fellow…",
  "data/reddit-stocks/r/stocks/comments/ttsxe8/are_cannabis_stocks_a_buy_they_are_priced_so_low.json": "I used to own various companies in the cannabis industry a few years back and\ndecided randomly to sell them conveniently before they ultimately plummeted.\nObviously Congress getting ready to vote on this, biggest traction I believe\nthis bill has is it will essentially wipe out almost if not all…",
  "data/reddit-stocks/r/stocks/comments/ttrb18/should_i_sell_dis_and_put_the_cash_in_something.json": "So I have invested around 1k in Disney with average 178-177. Yeah, for the past\nyear this stock has been nothing but a disappointment for me - it serves me\nright I hardly did and DD on it, I just thought hey it's Disney even if it\ncrashes it will bounce back quickly. Lately I have been thinking of…",
  "data/reddit-stocks/r/Bogleheads/comments/ttpjz7/a_mental_exercise_to_realize_the_folly_of_dollar.json": "We all know that trying to time the market is a losing game. However,\nironically, I often see the advice to \"DCA your investment into the market over\nX period.\" This is irrational advice. The example below illustrates why using\nDCA is illogical.\n\n[EDIT]: In the context of this post, I'm talking…",
  "data/reddit-stocks/r/Bogleheads/comments/tu25gh/maxed_out_ira_for_first_time.json": "I just turned 20 and I maxed out my Roth IRA for 2021 now I’m starting to\ncontribute to 2022. My portfolio is 70% US and 30% International. Posting here\nbecause I have no one else to tell!!",
  "data/reddit-stocks/r/Bogleheads/comments/tu1bp4/how_do_i_handle_it_when_people_ask_me_for_money.json": "With everyone investing long term here, I could only imagine there are people in\nyour families who have come to you for money. Maybe even friends. I’m 22 years\nold and have a higher net worth than 90% of all family members, including aunts\nand uncles. I’m also the first person in my family to…",
  "data/reddit-stocks/r/investing/comments/ttuqer/financial_advisor_advises_not_to_invest_cash.json": "My girlfriend let me look at her finances recently, and I saw she had a lot of\ncash set aside in her account managed by her financial advisor. She is a medical\nstudent currently and won't be touching that money for the next 3.5 years due to\nher being in school; she was planning to use part of that…",
  "data/reddit-stocks/r/Bogleheads/comments/tu7roi/100k_year_into_vti.json": "Are you comfortable with investing 100-150 per year into VTI? At any point did\nyou feel like payoff house?",
  "data/reddit-stocks/r/wallstreetbets/comments/tu3p40/resigning_as_head_mod_of_rwallstreetbets.json": "This is not a joke. [https://i.imgur.com/fiP0MmV.png]\n\n--------------------------------------------------------------------------------\n\nAfter over 7 years of moderating r/wallstreetbets [/r/wallstreetbets], I have\nmade the difficult decisions to step down as head mod.\n\nIt has recently come to…",
  "data/reddit-stocks/r/stocks/comments/ttyn6y/why_is_china_suddenly_more_cooperative_about.json": "Chinese stocks have been a bloodbath last year with concerns of delisting. But\nthere seems to be a small turnaround from Chinese government\n[https://www.finews.asia/finance/36531-could-beijing-s-audit-concessions-mark-a-turnaround-for-chinese-stocks]:\n\n> Beijing is preparing to make concessions on…",
  "data/reddit-stocks/r/stocks/comments/tudm9d/deceased_friends_mom_has_paper_shares_of_ibm_from.json": "I am going to pay cash for these old paper shares. If I ever redeem them I have\nno problem if they are in what condition? I heard of framing these too?\n\nI feel like I am doing a service IBM is up 7% last week but I never traded paper\nonly electronically over the phone honestly.\n\nCan you believe she…",
  "data/reddit-stocks/r/investing/comments/tu8hsw/mega_cap_marketweighted_idea.json": "I’m just looking for advice, questions, recommendations, etc\n\nI did some back tests which revealed that the top 5-10 S&P stocks tend to\noutperform the market over the long term.\n\nWhat if you made a portfolio 50% vti (or vt) and the rest the top 5-10 stocks\nweighted by market cap?",
  "data/reddit-stocks/r/investing/comments/tujxgn/safe_1015_year_investments.json": "My parents recently sold their home and downsized. At Christmas they gave each\nof us kids $1,000 for each grandkid (our kids) to be given to them on their 18th\nbirthday. I’d like to put this somewhere for each of my kids that will make it\nworth close to $1,000 when they take it out (keep up with…",
  "data/reddit-stocks/r/Bogleheads/comments/tucu0g/how_offen_do_your_check_your_longterm_investment.json": "hey , I a new boglehead. I can't stop to check my account from time to time.\nWhat's your experiences as your were a new boglehead? As I became a boglehead\nonly half a year, I didn't suffer the pandemic market crash. I can't imagin what\nI would have thought , If I had invested all I had. What did…",
  "data/reddit-stocks/r/stocks/comments/tumycz/tesla_delivers_310048_electric_vehicles_in_the.json": "TESLA TO THE MOON! Apparently y’all thought this was a hit job on Tesla? I’m\nbullish\n\nTesla delivered 310,048 electric vehicles in the first quarter of 2022, below\nanalysts estimates.\n\nDeliveries are the closest approximation to sales numbers reported by Tesla.\n\nAfter a rough start to 2022, Tesla…",
  "data/reddit-stocks/r/Bogleheads/comments/tuhk62/vanguard_2045_fund.json": "So, I use target date funds for my Roth, I'm lazy and not smart and this might\nbe further proof of me not being smart but -\n\nDo these funds seem solid over the long term? Or am I better off doing something\nelse?",
  "data/reddit-stocks/r/stocks/comments/tumsf5/softbank_liquidates_most_of_portfolio_at_nasdaq.json": "SoftBank has liquidated almost all of the positions in its abortive internal\nhedge fund SB Northstar after racking up between $6bn and $7bn in losses in the\nunit behind the notorious “Nasdaq whale” trades.\n\nThe future of the Japanese technology conglomerate’s buccaneering trading unit\nhas been in…",
  "data/reddit-stocks/r/Bogleheads/comments/tugdfv/a_neighbor_showed_me_his_portfolio_from_a.json": "A neighbor of mine and I were talking about investing and he showed me briefly\nthe list of his investments as recommended by his Fidelity Financial Planner.\nWOW! A huge long list of stocks, bonds, mutual funds, and ETFs.\n\nI did not want to push too hard but it would have been great if I could make…",
  "data/reddit-stocks/r/Bogleheads/comments/tugv77/too_much_bonds_60_retiring_in_4_months_allocation.json": "I've been helping my wife's parents with their portfolio for the last couple of\nyears. They just turned 60 and since they started working early on are now\neligible for the State's pension.\n\nThe pension amounts to €30k/year net of taxes, which is half what they used to\nmake on an average year. They…",
  "data/reddit-stocks/r/Bogleheads/comments/tuqf0g/why_vti_over_voo_long_term.json": "I’m early 20s with plenty of time so why not go voo over vti?\n\nUpdate: to clarify it holding both with VTI 40% VXUS 30% BND 15% and VOO 15% but\nI want to consolidate that to a 3 fund portfolio hopefully. I know about VT but\nI’d rather have more control over my international investing percentage. I…",
  "data/reddit-stocks/r/wallstreetbets/comments/tumdex/deep_dive_into_the_market_cycle_and_how_it.json": "First and foremost, I am not financial advice and this is not a financial\nadvisor. I don't know shit about fvck - I literally lick windows for a living. I\npity the fool who takes anything I say to heart.\n\nTLDR: $GMEs price, just like every other stock in the US Equities market, is\ncontrolled by the…",
  "data/reddit-stocks/r/stocks/comments/tuojch/for_those_waiting_on_the_sideline_what_indicators.json": "I understand someone will definitely say “time in the market beats timing the\nmarket”.\nThanks for the advice, but I would like to hear from those on the sideline.\n\nWhat indicators and metrics do you follow and watch?\n\nThank you.",
  "data/reddit-stocks/r/Bogleheads/comments/tun9fo/when_is_the_vanguard_fee_taken.json": "So I understand that BND has a 0.035% fee. Is that fee taken quarterly or more\nfrequently? I can't seem to find the information or I'm not looking hard enough.\nCould be either one. I'm attempting to create a spreadsheet w/current balances\nincluding the fee and my sheet and Vanguard don't match up.…",
  "data/reddit-stocks/r/stocks/comments/tu6rv4/wall_street_week_ahead_for_the_trading_week.json": "Good Friday evening to all of you here on r/stocks [/r/stocks]! I hope everyone\non this sub made out pretty nicely in the market this past week, and are ready\nfor the new trading week ahead. :)\n\nHere is everything you need to know to get you ready for the trading week\nbeginning April 4th,…",
  "data/reddit-stocks/r/stocks/comments/tutww0/amazon_warehouse_unionized.json": "Surprised this isn’t being discussed here so I figured I’d make the thread.\n\nhttps://www.aljazeera.com/economy/2022/4/1/amazon-union-maintains-commanding-lead-in-new-york-election\n\nMainstream Media take is that it’s a big win for “the people” and a knock on\n“evil big tech”.\n\nMy expectation is that…",
  "data/reddit-stocks/r/investing/comments/tuyr0s/vti_and_voo_should_i_invest_in_both_or_just_one.json": "I’ve recently started automatically investing about $250 each week split between\nVTI and VOO. I thought the diversity would be beneficial but im reading that\nthey are composed of essentially the same stocks. Should i just pick one and\ninvest $500 in it each week? And which one would you recommend?…",
  "data/reddit-stocks/r/stocks/comments/tup35r/european_inflation_soars_to_record_75_in_march.json": "Source:\nhttps://uk.news.yahoo.com/charting-global-economy-european-inflation-090000565.html\n\nEuro-zone inflation surged to a record 7.5% in March from a year ago as Russia’s\nwar in Ukraine further boosted already soaring energy costs.\n\nWhile that’ll cost consumers about 230 billion euros ($254…",
  "data/reddit-stocks/r/stocks/comments/tv20la/one_year_ago_i_wrote_a_bear_case_for_amd_lets.json": "About me: I like to write about semiconductor companies and tech stocks. My\nprevious analysis (examples:…",
  "data/reddit-stocks/r/stocks/comments/tumrfy/china_allows_onsite_inspections.json": "Monday should be a very interesting day for Chinese stocks:\n\nhttps://www.bloomberg.com/news/articles/2022-04-02/china-removes-major-hurdle-to-allow-u-s-full-access-to…",
  "data/reddit-stocks/r/Bogleheads/comments/tv93tz/considering_pensions.json": "I’m one year away from vesting in the pension system for my public school based\njob in Texas (TRS-teachers retirement system). A recent article I read said that\nretired teachers in Texas had not received a cost of living adjustment since\n2004. Someone receiving $2000 in 2004 should now be receiving…",
  "data/reddit-stocks/r/Bogleheads/comments/tvac39/if_you_are_34_years_old_and_only_want_to_have_one.json": "Edit: preferably ETFs, not necessarily a fund but one position",
  "data/reddit-stocks/r/stocks/comments/tvdgay/how_many_of_you_saw_the_warning_signs_and_shifted.json": "Due to inflation and international economic struggles, there was a clear winner\nin the equity markets the last quarter.\n\nDid many of you move your assets to the energy sector, and are others who\nhaven't yet going to move assets that direction for the year?",
  "data/reddit-stocks/r/stocks/comments/tvfbln/tim_in_the_market_is_better_than_timing_the.json": "What’s your experience been with “time in the market is better than timing the\nmarket” philosophy? I’m a young investor (mid 20’s) and just keep buying VTI\nevery other week or so. How has it worked for you veterans in the long run?\nShould I change anything?",
  "data/reddit-stocks/r/investing/comments/tv99zz/how_many_people_actually_read_the_investor_reports.json": "Once I found my winning stock I like to research comparable stocks in the sector\nand dive into the latest financial report or two including the M and D. How\noften do people actually read through everything verse not doing any research? A\ncouple friends suggested they pick up stocks based on…",
  "data/reddit-stocks/r/investing/comments/tvavdl/etfs_to_invest_in_the_world.json": "Hi guys, I'm learning about finance and would like to ask if given 10 choices,\nwhich ETFs would you invest in to have the most wide-reaching coverage across\ndifferent asset classes and countries? (Given that the returns don't matter)\n\nI'm taking a theoretical standpoint in a sense that I want…",
  "data/reddit-stocks/r/investing/comments/tvc9yg/inflation_and_its_effect_on_the_stock_market.json": "While reading a bit on the ideas to protect money from inflation, I noticed many\npeople have the idea to move their money into the general stockmarket (e.g.\nindexes, managed-funds, S&P, NASDAQ). The idea behind this is that the money is\n\"save\" in the market due to companies in general profiting…",
  "data/reddit-stocks/r/stocks/comments/tv3zcj/advice_on_starting.json": "I am 23 and more or less financilally illiterate. I grew up in a paycheck to\npaycheck home and never really learned I should be thinking about my money\nbesides paying bills and saving. I was quite literally taught nothing about\nfinances in highschool or college. Now I hear the only way anyone will…",
  "data/reddit-stocks/r/stocks/comments/tvn72q/safest_stock_in_the_world.json": "Let's play a game: what is the safest stock in the world?\n\nI mean, if the world was to collapse, undergo a prolonged period of depression,\nif the US dollar was to lose its' hegemony, or any other depressing event that\nyou might think of.\n\nWhich stock/company do you think will survive these hard…",
  "data/reddit-stocks/r/Bogleheads/comments/tvibg7/does_the_amount_of_shares_u_get_matter_with_the.json": "Ifeel so stupid asking this but lets say I bhave 50$ to invest every month (i’m\nonly 15 im getting a job sometime soon so i can invest more) into voo even\nthough its 416$? it shouldn’t change anything right? ill still get the roi\ncorrect since overtime it will add up?",
  "data/reddit-stocks/r/wallstreetbets/comments/tvgb6i/but_amc_is_cheaper_than_gme_proven_wrong_with_data.json": "INTRO\n\nRecently, I've been arguing with internet finance professionals over the\noverused and misunderstood argument of \"POPCORN is a cheaper stock to own than\nGME\" or \"Why would I buy 1 GME share when I can have 10 POPCORN shares?\" or my\npersonal favorite \"if both stocks go to $10,000 at one point…",
  "data/reddit-stocks/r/wallstreetbets/comments/tvnuao/gme_stock_dividend.json": "Stock dividend isn’t a normal stock split. It has the same effect of a stock\nsplit but the mechanism is different.\n\nStock split: if there is 100 shares worth $10 each, a stock split, say 2:1 will\nmake 200 shares each worth $5. In this case Hedgies etc don’t have to do\nanything. Life stays the same.…",
  "data/reddit-stocks/r/wallstreetbets/comments/tvnxir/i_hate_you_gme_fucktards.json": "I work for a UK broker and all you GME dweebs are the bane of my life. You are\nliterally fucking clueless on how trading and settlement works, we get bombarded\nwith stupid fucking questions by you motherfuckers who think the whole world is\nagainst you when in reality the more money you make the…",
  "data/reddit-stocks/r/investing/comments/tvpf7l/the_2y30y_yield_curve_is_inverted.json": "At the time of this writing, the 2y/30y yield is inverted (1-2 basis points).\n\nSource: https://www.cnbc.com/quotes/30Y2YS\n\nIt's historically rare and usually happens near the end of a rate hike cycle by\nthe Fed. I know it's preceded some significant contractions in the economy, but\nthe inversion…",
  "data/reddit-stocks/r/stocks/comments/tvrjxt/why_do_some_gold_industry_stocks_plummet_during_a.json": "I’ve been searching for stocks in the gold industry to help me hedge against\nrising inflation. Because these stocks tend to be inverse the market, I just\nassumed that they would thrive or at least hold up well during a recession.\n\nAfter searching through about 40 gold stocks I noticed that a good…",
  "data/reddit-stocks/r/wallstreetbets/comments/tvw3yv/i_love_you_gme_fucktards.json": "I work for a US broker and all you GME chads are the highlight of my life. You\nare literally fucking spot on how trading and settlement works, we get bombarded\nwith amazing fucking questions by you beautiful bastards who think the whole\nworld is on your side when in reality the more money you make…",
  "data/reddit-stocks/r/Bogleheads/comments/tvqzw6/how_to_build_a_portfolio_step_by_step.json": "I see lots of questions about how do I go about putting together my portfolio. I\nam going to give you some resources below. These are just guidelines and your\nspecific situation can change these. The steps below describe how to build your\nportfolio.\n\nAnd the optimal portfolio can only be known in…",
  "data/reddit-stocks/r/stocks/comments/tvyoxd/elon_musk_takes_92_passive_stake_in_twitter.json": "Elon Musk has taken a 9.2% passive stake in Twitter, according to a 13G filing,\nBloomberg News reports. Twitter rose about 26% in pre-market trading.\n\nMore information is available on the Bloomberg Terminal.\n\nhttps://www.bloomberg.com/news/articles/2022-04-04/elon-musk-takes-9-2-passive-stake-in…",
  "data/reddit-stocks/r/investing/comments/tvyx7l/twitter_is_up_26_premarket_as_elon_musk_reveals_a.json": "Per Bloomberg data, Musk’s 9.2 per cent Twitter stake would make him the largest\nshareholder in the company. Notably it’s more than quadruple the 2.25 per cent\nposition of founder Jack Dorsey. At pixel time, Twitter’s stock is up 25 per\ncent in pre-market trading to…",
  "data/reddit-stocks/r/stocks/comments/tvz5um/elon_musk_takes_99_stake_in_twitter.json": "Elon Musk has taken a 9.2% passive stake in social media company Twitter Inc\n(TWTR), according to a Bloomberg report.\n\nMusk, the CEO of car company Tesla Inc (TSLA) and SpaceX, often uses Twitter to\ndispel his views. Shares of Twitter jumped over 26% to $49.79, while shares of\nTesla were up 1% in…",
  "data/reddit-stocks/r/investing/comments/tvude8/everyone_talks_about_the_strong_job_growth.json": "I’m talking about people that do Uber, Lyft, Doordash, Postmates, Ebay, Amazon,\nEtsy, etc. Let’s say someone gets a full time job at Walmart and also starts\ndoordash on the weekends and sells random things on eBay. Does the government\ncalculate that 3 jobs were “created” that month? Is there a…",
  "data/reddit-stocks/r/stocks/comments/tvuyvz/are_index_funds_really_in_a_bubble_pls_help_me.json": "Long story short, I repeatedly heard the notion that Index Funds have crossed\nthe bubble territory based on the continuous Inflow of funds without a valid\nprice finding mechanism behind it.\n\nI‘m an avid Warren Buffet fan who repeatedly praised investment in the broad\nmarket as a fairly good…",
  "data/reddit-stocks/r/wallstreetbets/comments/tvylmu/elon_takes_92_stake_in_twtr.json": "Damn. That SOB is really going to do it guy. Hostile takeover of TWTR?\n\nAll this time we were thinking he is starting a competitor. Well played sir!!\n\nhttps://www.streetinsider.com/dr/news.php?id=19866072",
  "data/reddit-stocks/r/stocks/comments/tvwgct/elon_musk_says_tesla_aiming_at_30_gross_margin.json": "CEO Elon Musk said on Sunday that the electric vehicle maker is aiming at a 30%\ngross margin or about 10% profitability including all costs for its Supercharger\nnetwork business.\n\nWhat Happened: Investor Ross Gerber had asked Musk if Tesla works on “a 50%\ngross margin on the energy cost,” and “if…",
  "data/reddit-stocks/r/Bogleheads/comments/tvzpp2/how_much_do_you_usually_spend_or_save_or_invest.json": "As for me after taxes I roughly Spend: 40% (food,rent,bills and etc) Invest: 27%\nSave: 20% Donate: 13%\n\nAlthough experts recommend to invest 15-20% of your income but I think we all\ngot our own different situations here\n\nWhat about you guys?",
  "data/reddit-stocks/r/stocks/comments/tvuobp/tesla_delivered_310000_in_the_first_quarter_a.json": "Tesla delivered 310,000 vehicles in the first quarter, compared with an\nestimated 309,200; in the first quarter, it produced 305,400 vehicles, compared\nwith an estimated 311,900.\n\nDuring the same period, traditional automakers such as GM, Ford, and Chrysler\ndeclined year-on-year.\n\nOn Friday, Tesla…",
  "data/reddit-stocks/r/stocks/comments/tw3u2l/musk_held_twitter_stock_then_twitter_stock_soared.json": "It was announced that Musk held more than 73.48 million shares of Twitter,\nholding a 9.2% stake. Twitter shares rose to 20% after Tesla CEO Musk reported\nhis stake in Twitter.\n\nIt seems like it's a strange law that Musk owns a certain stock, they all go up.\n\nWhat do you think will happen to Twitter…",
  "data/reddit-stocks/r/stocks/comments/tw8tjw/amd_to_buy_cloudservices_provider_pensando_for_19.json": "https://www.barrons.com/articles/amd-stock-price-pensando-51649075903\n[https://www.barrons.com/articles/amd-stock-price-pensando-51649075903?mod=hp_DAY_Theme_2_1]\n\nAdvanced Micro Devices [https://www.barrons.com/market-data/stocks/amd]reached a\ndeal to acquire cloud-services provider Pensando…",
  "data/reddit-stocks/r/Bogleheads/comments/tw5ntj/project_i_bond_rate_on_51.json": "I'm curious if there's a way to know what the new I bond rate published on May\n1st will be? Is it worth it to buy $10k worth of bonds now for 2022, or wait\nuntil May? Still figuring out how these bonds work.",
  "data/reddit-stocks/r/Bogleheads/comments/tw9wm7/am_i_doing_too_much_pretax_investing.json": "My wife and I make about $175,000/year ($187,000/year if you add PERS) as\nfollows:\n\nMe: Government Attorney — $66,000 salary plus $12,000 PERS (retirement like a\ntIRA) Me: Solo Law Practice on Side — $30,000 salary (S corp employee) plus\n$50,000 distribution Wife: Part-Time Home Health —…",
  "data/reddit-stocks/r/stocks/comments/twh4ap/hertz_to_buy_up_to_65000_electric_vehicles_from.json": "> Hertz (HTZ) is turning up the wattage on its push to have a mostly electric\n> rental car fleet.\n> \n> The company said Monday it will purchase 65,000 electric vehicles from upstart\n> Tesla rival Polestar. Mostly consisting of the sporty Polestar 2 sedan, the\n> purchases will occur over five years.…",
  "data/reddit-stocks/r/stocks/comments/twctej/i_have_20000_usd_and_i_want_you_opinion_on_what_i.json": "I have 2,000 in investments that aren’t particularly safe but they are not\nstupid. I have been heavily debating taking the rest of my savings and investing\nit into an extremely safe company for the long term. Do you think this is a good\nidea and if so any good companies in mind?",
  "data/reddit-stocks/r/Bogleheads/comments/twgze5/ameritrade_vtsax_75_transaction_fee.json": "I’m trying to purchase just over $1000 in VTSAX and they are quoting me a $74.95\ntransaction fee. I feel like I’m doing this wrong.\n\nSuggestions?",
  "data/reddit-stocks/r/investing/comments/twhu4v/hertz_to_buy_up_to_65000_electric_vehicles_from.json": "WASHINGTON (Reuters) -Rental car firm Hertz Global Holdings said on Monday it\nwould buy up to 65,000 electric vehicles over five years from Swedish EV maker\nPolestar, the latest move by the rental car firm to add zero-emission models.\n\nHertz said Polestar cars would be available beginning this…",
  "data/reddit-stocks/r/stocks/comments/twc13f/are_school_stock_competitions_good_for_teaching.json": "After seeing another post about a school stock competition, it reminded me of\nthe \"feud\" on whether YouTuber boxing is good for the sport.\n\nOn one hand, introducing kids to finance and stocks is good because it\n(hopefully) destigmatize fears and misconceptions about the stock market. This\ncould…",
  "data/reddit-stocks/r/stocks/comments/twm05p/how_did_elon_musk_by_almost_10_million_shares_of.json": "Just like the title says. THIS is one thing I haven't the slightest clue about\nwhen it comes to stock. How in TF do you buy almost 10 percent of a company 21\ndays ago but NOW today it goes up the way it does. Dark pool? Elon Musk magic?\nStock share gnomes that only come out when the headlines hit?…",
  "data/reddit-stocks/r/investing/comments/twhh3d/if_roth_contributions_can_be_accessed_anytime_why.json": "Hello, so lately, I've been thinking of liquidating my regular taxable account\nand putting all my money from now in a roth account. My reasonings are:\n\n 1. dividend and profit are not taxed at all, so I don't have to worry about\n    selling or accruing dividends (without withdrawing, of course)\n 2.…",
  "data/reddit-stocks/r/investing/comments/twk20t/after_seeing_dark_waters_would_you_invest_in.json": "“DuPont started conducting cancer studies in 1988. The company’s own studies\nshowed that exposure to C8 killed rats, dogs and monkeys, by causing testicular\ncancer, liver disease and pancreatic disease. Not only did DuPont continue to\nmanufacture Teflon, but it also continued to dump the chemical…",
  "data/reddit-stocks/r/Bogleheads/comments/twmxg0/why_do_bonds_make_sense_at_40.json": "Using the rule of 120, I should have 20% of my portfolio in bonds. If I’m\ninvesting money I don’t need for 20-25 years, why does it make sense to have any\nportion in bonds at my age? Isn’t it safe to assume that the S&P is going to be\nhigher 20 years from now, so even if we experience a massive…",
  "data/reddit-stocks/r/stocks/comments/twu6o5/twitter_ceo_parag_agrawal_im_excited_to_share.json": "Full tweet is \"I’m excited to share that we’re appointing @elonmusk to our\nboard! Through conversations with Elon in recent weeks, it became clear to us\nthat he would bring great value to our Board.\"\nHe goes on to say.\n\"He’s both a passionate believer and intense critic of the service which…",
  "data/reddit-stocks/r/wallstreetbets/comments/twexv3/lost_over_100_grand_in_a_couple_months_on_my_dads.json": "i told him he was getting a call and just say yea when they needed to approve\nthe account for options lol. Dad has no idea what options are, been in mutual\nfunds his whole life from a manager who i told to drop because he charged 300$\nper quarter when I can just manage his money for no payment. Mom…",
  "data/reddit-stocks/r/investing/comments/twudj4/twitter_ceo_parag_agrawal_im_excited_to_share.json": "Full tweet is \"I’m excited to share that we’re appointing @elonmusk to our\nboard! Through conversations with Elon in recent weeks, it became clear to us\nthat he would bring great value to our Board.\"\nHe goes on to say.\n\"He’s both a passionate believer and intense critic of the service which…",
  "data/reddit-stocks/r/Bogleheads/comments/twla4r/avoid_target_date_retirement_funds_in_taxable.json": "lesson learnt by me the hard way while preparing 2021 taxes. I always thought\ntarget date funds were, an easy way to simplify retirement investments . This\nyear vanguard converted a significant portion of target retirement 2045 while\nrebalancing , which shows up as capital gains. Of course the…",
  "data/reddit-stocks/r/stocks/comments/tw8u4i/att_april_5th_split_t_disca_disck_wbd_and_wbdwv.json": "https://www.fool.com/investing/2022/04/02/heres-what-will-happen-to-att-and-discovery-commun/?source=eptyholnk0000202&utm\\_source=yahoo-host&utm\\_medium=feed&utm\\_campaign=article\n[https://www.fool.com/investing/2022/04/02/heres-what-will-happen-to-att-and-discovery…",
  "data/reddit-stocks/r/Bogleheads/comments/twx4ut/roth.json": "So I thought I was a smart guy and last year wanted to start my boglehead\njourney. Opened a self directed ROTH and made $6k contribution for 2020 and\n2021. Total $12k.\n\nNow Im finding out I am ineligible to open a ROTH if my income was over $120k.\nThat I need to close the ROTH, open a traditional…",
  "data/reddit-stocks/r/investing/comments/twtlxv/why_is_borrowing_to_invest_frowned_upon.json": "I get it, but I don’t. People take out $50k loans to purchase a vehicle like\nit’s no big deal. If you took out that same amount to put in the stock market\npeople would think you’re insane. Like a vehicle will most certainly lose value,\nwhile a stock has at least a chance to go up in value while…",
  "data/reddit-stocks/r/stocks/comments/tx1pu5/natural_gas_prices_will_increase_at_a_greater.json": "With Biden planning on releasing 1 million b/day of oil from the strategic\nreserves I think that natural gas producing companies will do very well. With\nthe US government supplementing the market with a ton of oil for 6 months, but\nnot doing the same with natural gas the total supply of natural gas…",
  "data/reddit-stocks/r/stocks/comments/twyyxy/i_might_be_naïve.json": "Did I just find a loophole? Can you take out a loan with say 2.5 APR and then\nput it into a stock with a higher yield in dividends such as AT&T which has\naround 7% this means that you could pocket 5% of the yield off of your loan.\nPlease let me know if I can do this.",
  "data/reddit-stocks/r/stocks/comments/twye3y/feds_brainard_sees_balance_sheet_reduction_soon.json": "> Federal Reserve Governor Lael Brainard, who normally favors loose policy and\n> low rates, said Tuesday that the central bank needs to act quickly and\n> aggressively to drive down inflation.\n> \n> In a speech for a Minneapolis Fed discussion, Brainard said that policy\n> tightening will include a…",
  "data/reddit-stocks/r/Bogleheads/comments/tx9vzf/any_other_bogleheads_believe_capitalism_is.json": "The bogleheads forum nukes any post related to climate change so maybe we can\ntalk about it here?\n\nI am super concerned about climate change and believe our economic system that\npursues endless economic growth is madness. I think most corporations treat\nemployees and the planet like crap and…",
  "data/reddit-stocks/r/Bogleheads/comments/tx6x2h/terrible_advice_from_an_angle_investoruniversity.json": "I am taking a software business class in college taught by a professor who used\nto be an angel investor and is now a multi-millionaire. Today in class he gave a\nlecture on personal finance and said some things that really did not sit right\nwith me. In fact, I think he was 100% wrong about a few…",
  "data/reddit-stocks/r/stocks/comments/tww359/if_you_have_1_million_in_cash_would_dumping_it.json": "If you have $1 million in cash right now, would putting all of it into a S&P500\nIndex Fund and adding $20,000 yearly into it make you a multi-millionaire in 30\n- 40 years?\n\nWould that be a better investment method (in terms of effort, time and risk)\ncompared to something like real estate investing?",
  "data/reddit-stocks/r/stocks/comments/tx5u21/what_was_the_dip_today_about.json": "Just generally confused about such a steep dip today after such a strong rally\nyesterday. I made the classic noob move of trying to buy in too late with fear\nof missing out when there wasn't a gap down at market open and bought in only to\nbe left seeing red. I know there was talks from the Fed, but…",
  "data/reddit-stocks/r/stocks/comments/tx9kf1/aercaps_aer_35b_loss_of_aircraft_to_russia_could.json": "Aercap, the world’s largest aircraft leasing company, has submitted an insurance\nclaim for 3.5 billion worth of aircraft and engines that Russia refuses to\nreturn.\n\nHowever, even if they do get the entire insurance claim (unlikely as the claim\nis going to be fought in court, Loyds of London…",
  "data/reddit-stocks/r/stocks/comments/txcetq/inputting_each_individual_transaction_in_your.json": "First time trader in 2021, luckily I only did like 30 transactions, I think the\ntaxes and upgrading from \"simple return\" options to one that included\nindependent investments probably wiped most my stock earnings. The tax program\nrecommended I use a different site that would charge $50 to compile my…",
  "data/reddit-stocks/r/stocks/comments/txdzdm/tomorrow_i_go_80_cash_there_is_no_hope_im_serious.json": "So after another depressing night of reading nothing but bad news about years of\nwar with Russia, threats from China, inflation, watching Cramer say to sell\ntonight on Mad Money, Tim Seymour and Dan Nathan and Karen laying out the case\nfor below 4000 level and just generally not seeing any hope in…",
  "data/reddit-stocks/r/stocks/comments/tx3hnz/jet_blue_offers_36b_for_spirit_airlines_stock_up.json": "Breaking news:\nhttps://www.cnbc.com/2022/04/05/spirit-airlines-shares-spike-20percent-on-report-jetblue-has-made-bid-to-buy-airline.html\n\nBreaking news as the trading day comes to a close.. Jet Blue has offered to buy\nSpirit Airlines for $3.6B.\n\nEarlier in the year, an announcement of Spirit…",
  "data/reddit-stocks/r/stocks/comments/tx9qy6/what_are_the_strategies_to_reduce_capital_gain_tax.json": "Do you sell at a loss to lower taxes?\n\nI recently started buying stocks. And learnt about capital gain tax.\n\nFor example, I sell 100 stocks and make gain of $1000. Do I have to sell some\nstock which is not giving me any gain to counter the capital gain tax?\n\nWhat are the strategies to minimize…",
  "data/reddit-stocks/r/stocks/comments/txhdc3/be_honest_how_many_of_you_are_actually_beating.json": "Reading the daily discussion thread, I'd be stunned if more than 2 out of 20\npeople who. post here are actually beating the S&P and DOW this year.\n\nI'm about 1-2% pts off from the S&P but beating the Nasdaq. Given how many\ngrowth names and tech names that are beloved here (which have NOT been in…",
  "data/reddit-stocks/r/investing/comments/txitan/im_confused_which_should_i_choose_dividends_or.json": "My parents are convincing me to invest together as a family. They want us to\nsplit the cost and try our luck in either real estate or dividend investing, but\nwe can't decide which. We are weighing the benefits and drawbacks of both\noptions.\n\nMy father suggested that we consider real estate…",
  "data/reddit-stocks/r/wallstreetbets/comments/tx6je3/gamestop_share_record_date_april_8_2022.json": "Broker Wealthsimple stated Gamestop will have a share record date of April 8,\n2022 in preparation for an upcoming shareholder meeting and will thus halt\ndirect registration requests as of April 5, 2022 until April 11, 2022. Do with\nthis knowledge what you will.",
  "data/reddit-stocks/r/stocks/comments/txo96r/the_fed_has_more_money_on_its_balance_sheet_89.json": "5 trillion of that was added to the Fed’s balance sheet since Feb. 2020:\nhttps://fred.stlouisfed.org/series/WALCL\n\n401k balances: https://www.ici.org/401k\n\n——\n\nBut oh ya, inflation is only happening because the ships and ports and all that\njazz. Definitely not because of the largest instance of…",
  "data/reddit-stocks/r/stocks/comments/txmctj/what_is_the_least_volatile_stock.json": "My bank is running a promo where I receive a cash prize if I make a trade for a\ncertain amount on their platform. I don’t really intend to stay with them so .\nAny recommendations for which stock to look at? Not really looking to make any\ngains but just to minimize my downside as I will be closing…",
  "data/reddit-stocks/r/investing/comments/twyyg5/labor_shortage_boomers_retiring_and_how_it_will.json": "To me the biggest effect of the pandemic is just how many boomers decided to\nretire and how it’s affecting labor shortage.\n\nAlmost no one wants to take a low wage job since they can work anywhere and can\nchoose. Articles claiming trucking companies have a shortage of truck drivers\nwhile other…",
  "data/reddit-stocks/r/Bogleheads/comments/txq2yq/why_do_bogleheads_constantly_say_stocks_are_on.json": "It doesn't make any sense to me.\n\nBogleheads believe 1) information is reflected in the current prices at all\ntimes (efficient market basically), 2) one can not time the market or pick\nstocks consistently, 3) higher expected returns come with higher risk. Fair\nenough.\n\nThen why are there so many…",
  "data/reddit-stocks/r/investing/comments/txr4c5/former_ny_fed_pres_bill_dudley_fed_might_need_to.json": "It's rare to see a Fed official, even a former one, be this explicit about the\nwealth effect going the other direction. The Fed relied on the wealth effect to\nboost the economy when stocks were on the way up. (Bernanke famously said so in\n2010). Now Dudley says the Fed wants equities lower to slow…",
  "data/reddit-stocks/r/stocks/comments/txpf2u/the_us_fed_will_force_stocks_down.json": "> In contrast to many other countries, the U.S. economy doesn’t respond directly\n> to the level of short-term interest rates. Most home borrowers aren’t\n> affected, because they have long-term, fixed-rate mortgages. And, again in\n> contrast to many other countries, many U.S. households do hold a…",
  "data/reddit-stocks/r/Bogleheads/comments/txkghv/how_to_think_about_investment_decisions.json": "I recently read this\n[https://old.reddit.com/r/Bogleheads/comments/ttpjz7/a_mental_exercise_to_realize_the_folly_of_dollar/]\npost by u/Dubs13151 [/u/Dubs13151] on how to think about DCA-ing a windfall in a\nway that such that intuition matches with the optimal path as suggested by\nstatistics and…",
  "data/reddit-stocks/r/investing/comments/txwfi8/what_happens_during_a_recession.json": "Simply that, I’m 20 this year and if we do reach a recession, what happens to\nthe stock market? Are there any sectors or stocks that perform or does the whole\nmarket tank?\n\nIf everything does go down, maybe you can’t time the bottom but that means you\nshould just sell now, lock in profits and wait…",
  "data/reddit-stocks/r/stocks/comments/txi7d4/rstocks_daily_discussion_wednesday_apr_06_2022.json": "These daily discussions run from Monday to Friday including during our themed\nposts.\n\nSome helpful links:\n\n * Finviz [https://finviz.com/quote.ashx?t=spy] for charts, fundamentals, and\n   aggregated news on individual stocks\n * Bloomberg market news [https://www.bloomberg.com/markets]\n *…",
  "data/reddit-stocks/r/investing/comments/txkrxv/balance_sheet_to_be_focus_of_fed_minutes_amid.json": "Shedding light on US central bankers’ hawkish stance, minutes from the Federal\nReserve March meeting are expected to reveal a committee leaning towards more\naggressive monetary tightening.\n\nLikely to mirror post-meeting rhetoric, the Fed minutes are set to reinforce an\nurgency to frontload policy…",
  "data/reddit-stocks/r/stocks/comments/ty9lkc/anyone_familiar_with_sex_toys_companies_listed_on.json": "I might be a bit late, but Im sure this business will only grow larger the\ncoming years. However Im completely unfamiliar with the companies. Can anyone\nprovide some basic information or where to look?",
  "data/reddit-stocks/r/stocks/comments/ty4z33/how_often_do_you_buy_stocks_when_they_didnt_dip.json": "How often do you buy stocks when they DIDN'T dip?\n\nI tend to prefer to buy stocks whenever they are on a down day (3-5% etc), but I\nwas wondering how people who buy stocks on the \"up and up\" do when they buy\nstocks that are up for the day or week etc..\n\nAs an example, stocks like PLD, LNTH or even…",
  "data/reddit-stocks/r/investing/comments/ty9l1e/50k_invested_for_20_years_robo_investor_or_doing.json": "Heeya investment people!\n\nI want to invest $50.000 into an overall passive investment strategy, and hold\nit for +20 years.\n\nI'm okay with the risk involved in a 100% stock portfolio, now that my goal is\nto hold for so many years.\n\nNow I have two main options for this:\n\n 1. Robo investor with SoFi…",
  "data/reddit-stocks/r/investing/comments/tyb0ef/portfolio_for_a_rising_interest_rate_and_high.json": "I'm thinking about how to position myself for a high inflation and rising\ninterest rates environment. My current thesis is this:\n\n * Rising interest rates, and thereby a rising risk-free rate, are going to\n   compress multiples in the broad stock market. This makes investing in broad\n   index ETFs…",
  "data/reddit-stocks/r/stocks/comments/ty81uf/hps_stock_rockets_after_berkshire_hathaway.json": "Shares of HP Inc. surged in after-hours trading Wednesday after Warren Buffett’s\nBerkshire Hathaway Inc. disclosed that it had taken a large stake in the Silicon\nValley maker of personal computers and printers.\n\nBerkshire BRK.A, +0.19% BRK.B, -0.03% disclosed in a late Wednesday filing that\nit…",
  "data/reddit-stocks/r/investing/comments/tyii6f/dutch_housing_market_first_drop_in_average.json": "\"After years of steadily rising house prices, the housing market shows the first\nsign of cooling. Homebuyers, on average, paid 2.1 percent less for an existing\nhouse in the first three months of 2022 than in the previous quarter, realtors'\nassociation NVM reports. That's the first quarterly price…",
  "data/reddit-stocks/r/Bogleheads/comments/tyhxjy/dazed_and_confused_first_timer_roth_401k_need.json": "Background: 36 yr old been in the bar business since 21, left that side of the\nthings recently and moved to a corporate distributing company that has Schwab\n401k and Roth. Been reading the Bogle wiki and I’m just not retaining the info\nbc I’m sleep deprived from our week old newborn, just need…",
  "data/reddit-stocks/r/stocks/comments/tyb8xe/ways_congress_may_be_about_to_pump_up_qualcomm.json": "Biden just held a meeting to hurry lawmakers to approve the $52billion CHIPS Act\nhttps://www.congress.gov/bill/116th-congress/house-bill/7178\n\nBut that’s just one of several acts to fund the semiconductor industry. Some are\nsignificantly larger.\n\nhttps://www.commerce.senate.gov/2022/3/senate…",
  "data/reddit-stocks/r/stocks/comments/tyk3a6/what_are_some_popular_stocks_you_think_are.json": "Do you think there are popular stocks that are overvalued? If so, what is your\ntheory about why it is overvalued and do you expect it/them to see correction\nsoon? What would it look like? What do you consider the fair market value of the\nstock to be?",
  "data/reddit-stocks/r/wallstreetbets/comments/tyey2l/can_mods_lower_the_15b_market_cap_limit_for.json": "I understand why mods have this rule in place but I think 1B is a better\nseparator of shit penny stock companies and ones with real growth potential. May\nnot seem like a huge difference, but 1B to 1.5B is a 50% growth which can happen\nin days, and us reetards NEED these gains to offset our…"
}