{
  "data/reddit-stocks/r/investing/comments/v23roa/what_am_i_missing_about_best_buy.json": "Just as the title states, I’m confused at the price action of BBY since its\nearnings report. They missed earnings and lowered guidance so I’m not sure why\nthe stock is up $10+ since then. I know they stated they’ve been handing\ninventories issues better than expected but when it comes down to…",
  "data/reddit-stocks/r/investing/comments/v25zvg/yellen_says_i_was_wrong_last_year_on_the_path_of.json": "https://www.bloomberg.com/news/articles/2022-05-31/yellen-says-i-was-wrong-last-year-on-the-path-of-us-inflation\n\nIn case you reached your article limit, here is the full article:\n\nTreasury chief says she didn’t fully understand circumstances\n\nBy Christopher Condon\n\nMay 31, 2022, 6:36 PM EDT…",
  "data/reddit-stocks/r/stocks/comments/v266fb/morgan_stanley_warns_stock_market_rally_will.json": "Wilson expects the S&P will trade close to 3,400 by the end of the\nsecond-quarter earnings season in mid-August. That would mark an 18% drop from\ncurrent levels and a 29% decline from the beginning of the year.\n\n\"The primary rationale ascribed to this particular rally beyond just an oversold\nbounce…",
  "data/reddit-stocks/r/Bogleheads/comments/v265nw/what_is_the_go_to_way_to_buy_bonds_ie_for_stocks.json": "As my question states, what is the idiot proof way to diversify into bonds. I\nknow for \"stocks\" its usually VT or VTI/VXUS thats most recommended. Is it as\nsimple as just buying BND or buying bonds directly some other way?",
  "data/reddit-stocks/r/stocks/comments/v264o1/yellen_says_i_was_wrong_last_year_on_the_path_of.json": "https://www.bloomberg.com/news/articles/2022-05-31/yellen-says-i-was-wrong-last-year-on-the-path-of-us-inflation\n\nIn case you reached your article limit, here is the full article:\n\nTreasury chief says she didn’t fully understand circumstances\n\nBy Christopher Condon\n\nMay 31, 2022, 6:36 PM EDT…",
  "data/reddit-stocks/r/stocks/comments/v2bul9/feds_quantitative_tightening_is_about_to_arrive.json": "The Federal Reserve’s almost $9 trillion portfolio is about to be reduced\nstarting on Wednesday, in a process intended to supplement rate hikes and\nbuttress the central bank’s fight against inflation.\n\nWhile the precise impact of “quantitative tightening” in financial markets is\nstill up for…",
  "data/reddit-stocks/r/stocks/comments/v26tm3/apple_and_amazon_as_your_only_stocks.json": "So my brother’s portfolio is over 50k with only amazon and apple (no index\nfunds, options , etc). How safe do y’all think this is for the next couple of\nyears? I know that you are not supposed to keep all your money in one basket and\natleast have a good chunk of your portfolio in index funds, but…",
  "data/reddit-stocks/r/Bogleheads/comments/v2hji4/first_max.json": "I'm a high school teacher in his 20s who's long had an IRA in addition to the\npension plan, and after years, I finally maxed out my contributions!\n50% VFIAX\n25% VSMAX\n25% VTIAX\nHere's to more to come!",
  "data/reddit-stocks/r/stocks/comments/v2ijze/jpmorgan_chase_ceo_jamie_dimon_says_brace.json": "https://www.cnbc.com/2022/06/01/jamie-dimon-says-brace-yourself-for-an-economic-hurricane-caused-by-the-fed-and-ukraine-war.html\n\nJPMorgan Chase CEO Jamie Dimon says he is preparing the biggest U.S. bank for an\neconomic hurricane on the horizon and advised investors to do the same. “You\nknow, I…",
  "data/reddit-stocks/r/stocks/comments/v2i1x6/aapl_plans_to_transfer_some_ipad_production_to.json": "AAPL is moving some of its iPad production from China to Vietnam after strict\nCovid-19 lockdowns disrupted Apple's supply chain and product distribution.\n\n\n\nLast year, the tech giant shipped about 58 million iPads worldwide, the vast\nmajority of them from China, and the shift in production points…",
  "data/reddit-stocks/r/investing/comments/v2jufa/why_does_the_federal_reserve_always_lower_or.json": "Surely the Federal Reserve has excellent economists and mathematicians on staff.\nPeople who can compute double integrals in their sleep and find a matrix's\neigenvalues without using pen and paper. Surely there exist mathematical\nequations and numerical models based on huge datasets that attempt to…",
  "data/reddit-stocks/r/stocks/comments/v2rnyn/elon_musks_ultimatum_to_tesla_execs_return_to_the.json": "Tesla Inc. Chief Executive Officer Elon Musk sent an email late Tuesday to\n“Everybody” at his electric-car company, “Everyone at Tesla is required to spend\na minimum of 40 hours in the office per week,” Musk wrote in an email titled “To\nbe super clear.”...Musk went on to write, “Moreover, the…"
}