{
  "data/reddit-know/r/YouShouldKnow/comments/ltpl7d/ysk_typing_i_dont_own_the_rights_to_this_music_in.json": "Why YSK: In the USA, a sync license (a license that allows you to use a song\nalong with a video) is not compulsory. That means the copyright holder is not\nlegally required to give you a license like they would be if, for example, you\nperformed a cover of the song live, or played the song in a…",
  "data/reddit-know/r/YouShouldKnow/comments/ltt1xg/ysk_when_doordash_messages_restaurant_is.json": "Why YSK: DoorDash is passing the blame of untimely delivered food onto local\nsmall businesses with incorrect messaging. Hopefully awareness of this will\nensure that reputation of these restaurants is not hurt by DoorDash.",
  "data/reddit-know/r/YouShouldKnow/comments/ltzzro/ysk_the_difference_between_chromes_incognito_mode.json": "Why YSK: because recently a lot of people were crying murder when told that they\ncan still be tracked in incognito mode.\n\nFirst, let's undestand what is the incognito mode meant for?\n\nThe incognito mode was introduced when people getting caught based on their\nbrowser history was a thing. Iirc, it…",
  "data/reddit-know/r/YouShouldKnow/comments/lum5hv/ysk_that_shaming_people_for_being_fat_actually.json": "Why YSK:\n\nA lot of well-intentioned people stigmatize being fat, believing that it will\nhelp encourage healthy weight loss. Many people justify fat shaming by saying\nit's for the person's health. People perpetuate stereotypes that fat people are\n\"lazy, weak-willed, unsuccessful, unintelligent, lack…",
  "data/reddit-know/r/YouShouldKnow/comments/lup7y5/ysk_people_often_do_things_that_they_wouldnt.json": "Why YSK: I've seen people read, or look up random pieces of information when\nthey were bored. Helping them remember it, even years later.\n\nNot saying it'll work for everyone, of course. But get a globe or a map of the\nworld. Get encyclopedias, get random books to read, or puzzles/crossword…",
  "data/reddit-know/r/YouShouldKnow/comments/lutbcr/ysk_if_you_have_an_adjusted_gross_income_under.json": "Why YSK: I made $40 on stocks last year, and when I tried to insert my 1099 B\nform it said I had to use Premier and pay $70. Since I made less than 39k, I was\neligible to use the TurboTax IRS Free File Program.\n\nhttps://apps.irs.gov/app/freeFile/browse-all-offers",
  "data/reddit-know/r/YouShouldKnow/comments/lvlgwy/ysk_just_because_someone_is_related_to_you_does.json": "Why YSK: Don't blame the person for going no contact or leaving a family member.\nYou don't know what they went through. And don't tell them to reconsider, odds\nare good that they have tried to make things work. Leaving/going no contact is\nusually a last resort.",
  "data/reddit-know/r/YouShouldKnow/comments/lvnhqj/ysk_when_you_submit_a_negative_survey_for.json": "Why YSK: I was a Manager in the Customer Service/E-Commerce industry for over a\ndecade, companies will almost always blame the low-level employees for a\nnegative survey, even if the customer is upset about things completely out of an\nagent's control.\n\nIf you've got an issue with the company or their…",
  "data/reddit-know/r/YouShouldKnow/comments/lvrpgx/ysk_if_your_headlights_are_illuminating_any.json": "Why YSK: I think people simply may not realize when they’re blinding other\ndrivers. If you can tell that your lights are lighting any of their mirrors,\nthis means the driver is blinded, and it could make it extremely hard for them\nto see (especially the side mirrors that don’t have a tinted mode).…",
  "data/reddit-know/r/YouShouldKnow/comments/lw060c/ysk_when_someone_is_talking_about_their_problems.json": "Why YSK: Because it's such a simple rule and SO many people need to follow this.",
  "data/reddit-know/r/YouShouldKnow/comments/lw3ajl/ysk_if_you_know_that_someone_doesnt_celebrate_a.json": "Why YSK: There are many reasons someone may choose to not participate in a\nspecific celebration (religious reasons, conscientious, personal choice, etc).\nThat is a decision they have made and asked you to respect. You may have good\nintentions and don't want them to feel left out, but it's that…",
  "data/reddit-know/r/YouShouldKnow/comments/lw90hg/ysk_the_microwave_isnt_ruining_your_food_you.json": "Why YSK: If you’re wondering why your food is always coming out of the microwave\nrubbery, tough, and otherwise gross, it’s probably because you reheated your\nfood improperly.\n\nThe “time cook” and “power level” settings are your best friend. If reheating\nsomething that you don’t want to ruin (like a…",
  "data/reddit-know/r/YouShouldKnow/comments/lwhuq3/ysk_puppies_and_young_children_make_terrible.json": "Why YSK: Right now, many unsuspecting parents of young kids are bringing home\npuppies, only to realize that raising them all together is a Herculean task.\n\nDogs are man’s best friend, and we have a romanticized idea of puppies “growing\nup with our kids.” Ironically, puppies and young children…",
  "data/reddit-know/r/YouShouldKnow/comments/lwp117/ysk_to_have_your_dog_chase_you_when_it_slips_its.json": "Why YSK: When your dog gets away from you, chasing it is not always the best\nidea because they can run fast and far and easily get away from you. Instead,\ncall your dogs name in a playful voice, and say something like “come and get me”\nand make them think it’s a game, and run in the safest direction…",
  "data/reddit-know/r/YouShouldKnow/comments/lwp6js/ysk_you_can_take_full_page_screenshots_on_iphone.json": "(1) Take a regular screenshot, (2) tap on the preview, (3) click on “Full Page”\nat the top right corner.\n\nWhy YSK: Instead of taking multiple screenshots to get the entire content of an\narticle or for recipes; having to take one screenshot of the ingredients and\nthree screenshots of the step-by-step…",
  "data/reddit-know/r/YouShouldKnow/comments/lwv8ip/ysk_the_fcc_just_approved_a_50_a_month_subsidy.json": "Why YSK: This is great for those struggling to pay for internet. Hopefully this\nsubsidy will help reduce the number of people having to choose between paying\nfor groceries and internet access.\n\nHere’s who qualifies:\n\nTo be eligible, at least one member of the household must meet one of the\nfollowing…",
  "data/reddit-know/r/YouShouldKnow/comments/lxeb99/ysk_that_if_youre_in_public_and_in_a_rush_to_find.json": "Why YSK: Because in this situation most people will look for a gas station or\nrestaurant first but because of current world situations those places have shut\ntheir restrooms down. Home depot and target are all over the place and can be\neasily found. To that extent walmart qualifies for this post too…",
  "data/reddit-know/r/YouShouldKnow/comments/lxkait/ysk_if_you_are_ever_at_work_and_need_to_take_your.json": "Why YSK: I work an engineering job and occasionally get a room to myself to run\na plating machine. Here I can freely work with my mask off and place it in my\nback pocket like I normally do. I had chipotle the night before and was omitting\na higher frequency of deadly gas without even realizing my…",
  "data/reddit-know/r/YouShouldKnow/comments/lxo6gv/ysk_wettingsoaking_your_nails_before_clipping.json": "Why YSK Just a helpful tip for avoiding those rogue clippings you step on.",
  "data/reddit-know/r/YouShouldKnow/comments/ly14r0/ysk_that_if_you_made_less_than_72000_in_2020.json": "Why YSK: tax filing companies claim you can file taxes for free but then force\nyou to upgrade to a paid product if there is any complexity to your finances.\nYou are 100% entitled to filing for free, but it’s just not widely communicated.\n\nTurboTax claims it can file your taxes for free but that’s…",
  "data/reddit-know/r/YouShouldKnow/comments/lydb30/ysk_if_you_are_struggling_and_below_200_of_the.json": "Why YSK: Computers are typically expensive, and with the economic issues\nchallenging the country right now. Having access to a solid computer for school\n/ work purposes can be challenging. A lot of schools went online recently, and\npeople living in underserved communities struggled to provide…",
  "data/reddit-know/r/YouShouldKnow/comments/lyexts/ysk_when_you_get_a_call_saying_your_credit_card.json": "WhyYSK - Even if the person on the phone knows the first 8 numbers on the card,\nyour bank, and your last name, it’s probably a Phishing scam.\n\nLegitimate calls will encourage you to hang up and call the number on the back\nof your card. Phishing calls encourage you NOT to hang up and to stay on…",
  "data/reddit-know/r/YouShouldKnow/comments/lyjps9/ysk_if_you_ever_decide_to_play_monopoly_play_the.json": "Why YSK: This version actually has an ending! The game includes an extra piece\nthat you place on the board, the One Ring. On one of the die the 1 is replaced\nwith the eye of Sauron. Every time a player rolls this particular die\neye-side-up, the ring moves forward one space. If the ring makes its way…",
  "data/reddit-know/r/YouShouldKnow/comments/lyps6n/ysk_therapists_will_often_offer_a_sliding_scale.json": "Why YSK:\n\nTherapy seems like a luxury because the rates for people without insurance are\ncrazy high, but a lot of therapists recognize this and will offer you a heavily\ndiscounted rate if you talk to them about it.\n\nI know with everything that’s happening in the world a lot more people are\nrealizing…",
  "data/reddit-know/r/YouShouldKnow/comments/lz5dws/ysk_there_are_people_out_there_looking_to_give_a.json": "Why YSK: There are many people out there who are willing to give a chance,\nbecause they feel like they were given a chance. However, they expect the ones\nin front of them to be aware of it, and ask for it.\n\nI have been given a chance by my first manager, after a 1h interview, in a\ndifferent country.…",
  "data/reddit-know/r/YouShouldKnow/comments/lzgp93/ysk_make_sure_to_properly_clean_out_your_vacuum.json": "Why YSK: Some people seem to remain oblivious to this and just throw it out and\nbuy a new one when all you need to do is clean it out occasionally. Yes, it's a\npain. But a lot better than wasting money.",
  "data/reddit-know/r/YouShouldKnow/comments/lzitlj/ysk_there_are_websites_that_can_assess_true_and.json": "Why YSK: I have purchase inferior products many times based mainly on rating\nalone until I wised up. Internet literacy (the ability to discern between truth\nand falsehood, gossip and vital information [I'll leave this for another post])\nis going to play a critical part in humanity for decades to…",
  "data/reddit-know/r/YouShouldKnow/comments/lzizu9/ysk_not_to_inflate_a_life_jacket_in_a_plane_until.json": "Why YSK: An inflated life jacket takes up more space than a non-inflated life\njacket, making it harder to fit through the emergency exits and leading to\ncongestion when trying to escape. Also you run the risk of drowning as the life\njacket floats to the top of the cabin. A textbook example of this…",
  "data/reddit-know/r/YouShouldKnow/comments/lzof8r/ysk_that_you_should_label_your_house_or_mailbox.json": "Why YSK: I work for a huge package delivery company and I cant tell you how many\npackages I have had to take back because its unclear if your house is 1906 or\nyour neighbors is. Turn by turn directions are not supposed to be used where I\nwork. Just put a larger version of your house number in the…",
  "data/reddit-know/r/YouShouldKnow/comments/m04kpr/ysk_you_should_base_your_product_review_on_the.json": "Why YSK: Writing helpful product reviews helps out manufacturers, sellers, and\nconsumers. Unless you are able to rate each step in the purchasing process\nindividually (sales advice, website, pricing and purchase, product, shipping\netc.) you should base your review on the product's own merit.\n\nI see…",
  "data/reddit-know/r/YouShouldKnow/comments/m07p59/ysk_just_because_you_did_something_wrong_or_said.json": "Why YSK: Doesn't make you a hypocrite. People grow and become better than they\nused to.",
  "data/reddit-know/r/YouShouldKnow/comments/m0c6m3/ysk_adults_shouldnt_hate_or_be_rude_to_kids.json": "Why YSK: It’s good to bring awareness on this topic and can hopefully help lead\nto more positive relationships.\n\nI understand kids can be very frustrating to deal with or even annoying at\ntimes. However I see a lot of young adults or older people who have a super\nstrong disliking toward kids for…",
  "data/reddit-know/r/YouShouldKnow/comments/m0jzt2/ysk_the_aspca_has_printable_cards_you_can_keep_in.json": "Why YSK: Especially if you live alone, this is important. If you're in an\naccident and unable to communicate, or god-forbid worse, it might be a while\nbefore anyone considers checking on your home. Your animals will need to be\ntaken care of and fed.\n\nhttps://www.aspca.org/pet-care/pet…",
  "data/reddit-know/r/YouShouldKnow/comments/m0nfzd/ysk_cheaper_items_in_supermarkets_are_always.json": "Why YSK: Whenever people are shopping, they don't pay attention to the items\nlocated on the bottom of the racks; they just look directly in front of them to\nsearch for products they need. However, lets say that you are looking for corn.\nThe corn that is located in front of you (if you look straight)…",
  "data/reddit-know/r/YouShouldKnow/comments/m169lr/ysk_that_if_youre_using_a_budget_or_midrange.json": "Why YSK: Major updates like this one come with a slew of new features, tweaks,\nand security updates. Head into settings and press \"Last Update\". Even if\nthere's no notificaiton there, press it and a long list of details of the update\nwill be present. The update will download automatically, so you…",
  "data/reddit-know/r/YouShouldKnow/comments/m19jrg/ysk_that_pocket_in_the_door_of_your_ford_transit.json": "https://www.youtube.com/watch?v=X4fSfNeF-II\n\nMy friend had this happen today! There is a pocket in in the door of the Ford\nTransit van that looks like it is MADE for cell phones (it otherwise does not\nappear to have any purpose). Yes there was a little sticker that looked like a\nno smoking…",
  "data/reddit-know/r/YouShouldKnow/comments/m1gwb6/ysk_that_you_should_replace_your_deadbolt_strike.json": "Why YSK that the screws that come with most deadbolt strike plates are\nridiculously small. We rent a house, so it’s hard to justify investing in a home\nsecurity system or new locks. However, the screws for the deadbolt strike plates\nwere only about 1/2” long. I replaced them all with much thicker 4”…",
  "data/reddit-know/r/YouShouldKnow/comments/m1xr88/ysk_when_buying_a_suit_its_generally_expected.json": "Why YSK: it’s common to buy suits for an event like weddings or interviews, but\nunless you’re dropping a boatload of money on the suit it is unlikely to fit you\nvery well. Tailoring also isn’t expensive like you might think and it really\nadds an extra level to your presentation. Here (nyc) I can get…",
  "data/reddit-know/r/YouShouldKnow/comments/m2apya/ysk_that_scam_callers_are_posing_as_texas_police.json": "My elderly mother received a call the other day from a man claiming to be a\nTexas State Police Officer. He claimed that her social security number had been\nidentified in a number of fraud cases in the state and asked for her social and\nother information to confirm.\n\nWe called the social security…",
  "data/reddit-know/r/YouShouldKnow/comments/m2h6q2/ysk_if_youre_having_issues_with_stripping_ikea.json": "Note: this YSK is mostly for Americans Why YSK: By knowing the right tool to use\nfor one of the best known furniture chains, you can avoid wasting time needless\nreplacement parts or repairs.\n\nSo after nearly ruining a patio chair, I did some research and discovered that\nfor a lot of their screws…",
  "data/reddit-know/r/YouShouldKnow/comments/m2i8f3/ysk_honey_doesnt_expire.json": "Why YSK: so that you don't waste honey! Honey does not go bad. In fact, it's\nrecognized as the only food that doesn't spoil. It will, however, crystallize\n(becoming thick and cloudy) over time.",
  "data/reddit-know/r/YouShouldKnow/comments/m2mw66/ysk_when_you_get_something_that_has_a_hole_that.json": "Why YSK: That way the animal won't get caught in it.",
  "data/reddit-know/r/YouShouldKnow/comments/m2xzxh/ysk_that_screaming_at_people_in_your_family_is.json": "Edit: If you want a book recommendation I recommend “How to Deal with\nEmotionally Explosive People” by Albert Bernstein. I read this as a 19 year old\ntrying to understand why my dad exploded at us so much and it made me realize I\nwas also headed down that path of exploding at people. I read a bunch…",
  "data/reddit-know/r/YouShouldKnow/comments/m32xqw/ysk_toothpaste_and_sugarfree_candy_can_kill_your.json": "Why YSK: Xylitol is poisonous to dogs, even in small amounts.\n\nhttps://www.pethealthnetwork.com/dog-health/dog-toxins-poisons/popular-xylitol-products-can-poison-your-dog",
  "data/reddit-know/r/YouShouldKnow/comments/m33ckj/ysk_the_international_sign_for_help_me.json": "https://en.wikipedia.org/wiki/Signal_for_Help\n\nWhy YSK: in case you ever need help, or come across someone pleading for help",
  "data/reddit-know/r/YouShouldKnow/comments/m36wc0/ysk_not_everyone_is_fit_for_college_and_thats.json": "Why YSK \"Do what you love and it'll never feel like work\" Might fit some people,\nbut they are a minority. It's good to be realistic about your goal. Research\njobs in your area that you're interested in and see what they are paid for\nbefore going to college.\n\nHave a clear idea, you don't want to get…",
  "data/reddit-know/r/YouShouldKnow/comments/m39zlf/ysk_those_spiderwebs_exposed_as_the_snow_melts.json": "Why YSK: Snow mold is often overlooked or confused with insect activity. It can\ncause hay fever like symptoms as well as damage to the grass. Like with any\nallergy, knowledge is powered and understanding what is is cause you to react\nbefore anything is in bloom can put your mind at…",
  "data/reddit-know/r/YouShouldKnow/comments/m3a768/ysk_the_business_of_body_donation_for_science_can.json": "Why YSK: Your donations should be better informed. if you're considering\ndonating yours or your loved ones' body to science, you should be aware that you\ncan't really dictate where it actually goes.\n\nThe hospital will let an outside broker sell the body for a profit. There is\nvery little regulation…",
  "data/reddit-know/r/YouShouldKnow/comments/m3r7yh/ysk_that_veterinarians_have_one_of_the_highest.json": "Why YSK: If you are contemplating becoming a veterinarian, it is important for\nyou to know what you are getting into. There are unique stressors in our\nprofession that make it very difficult emotionally.\n\nIf you are a pet owner, you need to understand that veterinarians are there\nbecause they want…",
  "data/reddit-know/r/YouShouldKnow/comments/m3td74/ysk_the_wording_is_just_as_important_as_the.json": "Why YSK: people are getting more and more divided on almost every topic and\nstrong emotions can arise very easily. To avoid that and create a much healthier\npublic discourse, pay close attention on how you pose the question. The best way\nto generate a productive confrontation is to be empathetic in…",
  "data/reddit-know/r/YouShouldKnow/comments/m40zd4/ysk_that_you_need_to_define_an_acronym_before_you.json": "Why YSK: An acronym can stand for multiple things, depending on your frame of\nreference.\n\nCASA for example stands for the Canadian Alliance of Student Associations, The\nCanadian Agricultural Safety Association, the Canadian Automatic Sprinkler\nAssociation, and a whole host of other things.",
  "data/reddit-know/r/YouShouldKnow/comments/m47995/ysk_that_you_can_take_people_and_friends_and.json": "Here’s why YSK: This great idea is especially wonderful for anyone with an older\nor elderly person in their life:\n\nTake them on a tour of all their old haunts! Using Google Maps Street View, you\ncan take them almost anywhere in the world where they used to live, go to\nschool, favourite theatres,…",
  "data/reddit-know/r/YouShouldKnow/comments/m4akth/yskwhen_buying_cheap_faked_electronic_accessories.json": "Why YSK : it will save money",
  "data/reddit-know/r/YouShouldKnow/comments/m4hd07/ysk_that_touching_your_dog_messing_with_their.json": "Why YSK: Some dog owners can look at their dog while they are in the middle of a\nhealth crisis and not KNOW it is a health crisis, especially with things like\ndog bloat. Messing with your dog's ears, paws, tail, stomach, etc. will also\nhelp you with grooming them, as they will be used to you…",
  "data/reddit-know/r/YouShouldKnow/comments/m4o80i/ysk_children_of_abusive_households_literally_do.json": "Why YSK: Abused kids have nothing to compare the lives to besides fiction (tv,\nbooks) and they literally cannot comprehend that the way parents/patental\nfigures treat them is unacceptable. It is normal to them, even if it feels wrong\n& they can't put their finger on it. It is usually not until…",
  "data/reddit-know/r/YouShouldKnow/comments/m4t1rm/ysk_that_being_able_not_to_get_aggressive_when.json": "Why YSK: Aggression during arguments is very dangerous and often leads to much\nmore damage and problems than the original cause of the conflict. Threatening to\nhurt people or damage things, or worse, to actually hurt people and damage\nthings will get no one anywhere. Aside from direct injuries and…",
  "data/reddit-know/r/YouShouldKnow/comments/m4y4x6/ysk_our_brain_is_also_made_to_forget_and_memories.json": "Why YSK: Many people fuck it up because of this. They miss chances, they miss\nexperiences, and they miss on discovering themselves or the world.\n\nIt will be hard to deal with this, I know, but there is beauty to it.\n\nAnd I know it's not easy, but you have to be aware of it.\n\n * When you don't want…",
  "data/reddit-know/r/YouShouldKnow/comments/m5bqm0/ysk_it_is_common_advice_to_make_your_password.json": "Why YSK: everyone has probably received the advice saying that your password\nshould be something like 8*^iHs89%>l7. However, not only is this hard to\nremember, it is actually less secure than \"The tall horses joyfully galloping\nacross the wide meadow quickly became thirsty\".\n\nAssuming that you only…",
  "data/reddit-know/r/YouShouldKnow/comments/m5dxyc/ysk_food_pranks_arent_pranks_they_are_felony_food.json": "Why YSK: Its very easy to ruin your life in various ways, but a lot of possibly\nyounger people here seem to think its a very minor thing.\n\nIntentionally forcing things into other peoples bodies, through deception or\nforce, its extremely serious. Your intention is irrelevant. Warped humour under\nthe…",
  "data/reddit-know/r/YouShouldKnow/comments/m5jqdg/ysk_quite_a_few_generic_products_are_the_same_as.json": "Why YSK:\n\nI have worked in a few factories. In a chocolate factory I worked in we would\nalso do liquorice and lollies. We would do a whole batch of liquorice and change\nthe packaging to another brand which was cheaper and bigger package size. But it\nwas the exact same product. Multiple lolly…",
  "data/reddit-know/r/YouShouldKnow/comments/m5nvik/ysk_if_youre_going_to_get_a_heartbeat_tattoo_not.json": "Why YSK: Because the last thing you want is to get your cute matching tattoo\nwith your SO (which I dont recommend) only to find out from your medical minded\nfriend that the rhythm on your tattoo is a lethal one\n\nFor those that don't know, the little boop.... boop.. machine that prints out\nyour heart…",
  "data/reddit-know/r/YouShouldKnow/comments/m5u4c0/ysk_not_all_mattresses_or_anything_similar_with_a.json": "Why YSK: A family in my state is experiencing a nightmare come to life because a\nmother simply wanted to wash her kids new mattress 'covers' before use. She\nawoke to her children complaining of itchiness, discomfort, and trouble\nbreathing. The covers were not meant to be removed (despite having an…",
  "data/reddit-know/r/YouShouldKnow/comments/m6e81u/ysk_that_not_all_water_filters_that_advertise_the.json": "Why YSK: If you go to buy 3rd party water filter replacements for your fridge/\nbrita they'll tell you they can remove harmful metals like lead but aren't\nactually certified to do so unless they have NSF 53 certification.\n\nFull story:\n\nI live in Newark, NJ, so even though there's no lead pipes in my…",
  "data/reddit-know/r/YouShouldKnow/comments/m6ffkb/ysk_the_worlds_largest_data_breach_happened_a.json": "Why YSK: On February 2 2021, a compilation of at least 3.2 billion unique\nemail/password combos were released on a popular hacking forum (as per\nCyberNews). Known as COMB (Compilation of Many Breaches), the data includes\ncredentials from past leaks and spans websites across the internet in…",
  "data/reddit-know/r/YouShouldKnow/comments/m6fr62/ysk_to_use_this_google_search_trick_to_find_open.json": "Why YSK:\n\nThere's a simple trick you can use on your Google searches to find all the\nopenly available spreadsheets out there. The only thing you need to do is write\nthe following syntax in your google search:\n\n * site:docs.google.com/spreadsheets intitle:[anything you want]\n\nHowever, there are a…",
  "data/reddit-know/r/YouShouldKnow/comments/m6gb78/ysk_if_you_lose_your_iphone_in_a_room_or_house.json": "Why YSK: saved many occasions of being late for leaving the house. I yell this\nonce a week around my house. If you have AirPods you get better range. Works\neven if silent.",
  "data/reddit-know/r/YouShouldKnow/comments/m6gb8c/ysk_water_heaters_have_an_anode_rod_that_prevents.json": "Why YSK: Water heaters use an anode rod to attract and remove sediments from the\nwater being heated. An anode rod will corrode and deteriorate over time until\nit’s no longer capable of functioning and has to be replaced. This part\nliterally sacrifices itself to keep the tank in optimal condition.…",
  "data/reddit-know/r/YouShouldKnow/comments/m7026q/ysk_that_your_aboverange_microwave_likely.json": "Why YSK: The purpose of the charcoal air filter is to remove odors from the air\nas you cook. Most people know about the metallic grease filters on the bottom\nwhere the air gets sucked in, but not the charcoal filter inside the top-front\npanel where the air gets blown out.\n\nIf you live in an…",
  "data/reddit-know/r/YouShouldKnow/comments/m7878z/ysk_small_talk_is_a_very_important_preface_to_a.json": "Why YSK: you should know this because nowadays, nearly everyone skips small\ntalk, which is why so many conversations can quickly go south, as people have\nnot properly guaged the mood and or personality of the person they are talking\nto.",
  "data/reddit-know/r/YouShouldKnow/comments/m7b1zc/ysk_that_there_is_an_excellent_interactive.json": "Why YSK: If you would like to get into song writing or producing, it can be hard\nto know where to start. When learning online you often gather information about\nmusic theory and tips for producing without any context, exercise or link\nbetween them.\n\nThis [https://learningmusic.ableton.com/] is the…",
  "data/reddit-know/r/YouShouldKnow/comments/m7ca8d/ysk_that_when_calling_emergency_services_in_most.json": "Why YSK: If you are ever in the situation to need help from any emergency\nservice you should be aware that it doesn't matter how long the call takes and\nhow many questions are being asked. The operator will already have sent help\nonce they know what is happening and where. Stay calm and just answer…",
  "data/reddit-know/r/YouShouldKnow/comments/m7d85c/ysk_that_if_you_know_a_kid_struggling_to_learn_to.json": "Why YSK: CI is often misdiagnosed as ADD or Dyslexia.\n\nhttps://www.optometrists.org/vision-therapy-for-children/convergence-insufficiency-2/",
  "data/reddit-know/r/YouShouldKnow/comments/m7ezdd/ysk_when_making_your_bed_9_times_out_10_the.json": "Why YSK: Knowing where the tag is at and keeping it in the bottom right corner\nwill prevent you from having to readjust the sheet or quilt multiple times while\nmaking the bed.",
  "data/reddit-know/r/YouShouldKnow/comments/m7gxys/ysk_if_you_get_mad_when_someone_respectfully.json": "We can't be right 100% of the time and that is totally okay. If you get mad when\nsomeone respectfully disagrees with you/proves you wrong, that could be an\nindication of narcissism.\n\nWhy YSK? Because no one likes being around someone who can't handle being wrong\nor takes offense to it.\n\nEdit: oh boy…",
  "data/reddit-know/r/YouShouldKnow/comments/m7m6q1/ysk_that_most_videos_featuring_animals_being.json": "Why YSK: It's not only saving from animal attacks, also cought up in traps, with\nsome sort of rope around their neck and so much more. Search for animal rescue\nfake and look for yourself what once was awww is now quityourbullshit. If these\nguys get the clicks and ad revenue they will never stop…",
  "data/reddit-know/r/YouShouldKnow/comments/m7t09u/ysk_that_if_you_make_under_72k_the_irs_provides.json": "Why YSK: All you need to do is go here:\nhttps://www.irs.gov/filing/free-file-do-your-federal-taxes-for-free Fill out\nyour info and the IRS will give you many links to fill out your taxes for free.\nTurboTax typically costs money to file your state return or will charge you if\nyou try to put anything…",
  "data/reddit-know/r/YouShouldKnow/comments/m7urt6/ysk_that_if_you_have_a_hornet_wasp_or_yellow.json": "I've posted this before, but it didn't get a lot of attention and I think it's\nimportant. We're also coming into spring when those little assholes are more\nactive.\n\nMy husband is allergic to wasps and a couple years ago we found in our large\nRhododendron bush in our yard a bald-faced hornets nest.…",
  "data/reddit-know/r/YouShouldKnow/comments/m84onz/ysk_if_you_have_muscle_pain_that_wont_go_away_get.json": "Why YSK: I just got a massage and they found the source of my chronic pain,\nwhich were knots in my muscles from lifting weights. The masseuse said to do\nstretches after exercise to prevent knots.\n\n/u/LordCongra adds: \"The literature supports stretching for 30 second to 1\nminute 2-4 times daily and…",
  "data/reddit-know/r/YouShouldKnow/comments/m85hbk/ysk_that_for_over_50_of_the_united_states.json": "Why YSK:\n\nWe often underestimate how much information we're really sharing online. It\nmight not feel like we're identifying ourselves by sharing a few generic pieces\nof information about ourselves. But given just how easily identifiable we become\nafter sharing just a few pieces of information, it…",
  "data/reddit-know/r/YouShouldKnow/comments/m861lj/ysk_in_the_usa_the_recent_relief_bill_included_a.json": "If you received unemployment benefits in 2020, then you should NOT file your\ntaxes until your chosen tax preparation site/software has been updated or else\nyou will overpay and have to amend your return later.\n\nFor those who have already filed their taxes, the IRS has not yet provided\ninformation on…",
  "data/reddit-know/r/YouShouldKnow/comments/m8813b/ysk_anything_worth_it_in_life_takes_effort.json": "Why YSK To better yourself, you need to stick with it. Some people do like\nexercising, but I still don't like it, even after doing it for a while. But I\nstill do it, because I know that it's good for me.\n\nI don't like drinking ordinary water, because it's too plain tasting. But I know\ndrinking more…",
  "data/reddit-know/r/YouShouldKnow/comments/m8uz3x/ysk_you_dont_save_as_much_time_as_you_think_if.json": "Why YSK: Because speeding causes accidents. Also it's silly to freak out about\nsomething you have little control over. Your commute to work, for example, is\ngoing to be pretty much the same length of time if you're late and you speed to\ncompensate.\n\n1 ÷ (speed limit) - 1 ÷ (your speed) = time…",
  "data/reddit-know/r/YouShouldKnow/comments/m8xi09/ysk_when_your_sex_toys_expire.json": "I noticed recently that my set of silicone dilators has an expiration date on\nthe box that’s coming up very soon. I would have presumed they would last a lot\nlonger if cleaned properly, since they are nothing but a smooth, solid shape,\nbut the date was only about two years after I bought them. I’d…",
  "data/reddit-know/r/YouShouldKnow/comments/m8yavt/ysk_customer_service_might_be_able_to_give_you_a.json": "Why YSK: So you understand how customer service works and how to get what you\nwant so both parties are happy.\n\nI work customer service, I won't say for what company. But we have a protocol to\nfollow. Which involves customer service offering credit to your account with\n*insert company* first.…",
  "data/reddit-know/r/YouShouldKnow/comments/m9dx6u/ysk_on_subscription_based_services_you_can.json": "Why YSK: I just had this happen to me. My wife and I both have satellite radio\nenabled cars. I don't have mine active because I don't listen to music often\nenough (I prefer podcasts, audibooks, etc). I still get special advertisements\nall the time about restarting my service. I happened to get one…",
  "data/reddit-know/r/YouShouldKnow/comments/m9fdnu/ysk_check_your_local_salvation_army_or_goodwill.json": "Why YSK: Depending on your neighborhood, you can get lots of essentials\ndirt-cheap.\n\nAlso have gotten:\n\n * Microwaves\n * French Presses\n * Cast Iron Skillets",
  "data/reddit-know/r/YouShouldKnow/comments/m9ibis/ysk_you_may_have_unclaimed_property_waiting_for.json": "Why YSK: Anything from gift cards to insurance claims to uncashed checks, the\nstate is obligated to hold on to it until it's claimed by the rightful owner.\nGoogle unclaimed property in whatever state it's in and search your name. Some\nfind thousands, good luck!",
  "data/reddit-know/r/YouShouldKnow/comments/m9qkye/ysk_that_when_asked_for_your_address_name_phone.json": "Why YSK: I'm posting this because that has always been my answer, and more often\nthan not they look at me like I have three heads, which tells me that it's not a\ncommon response they get. While they may need that for you to get a 5% discount\nnext time you go in, the real reason they want it is to…",
  "data/reddit-know/r/YouShouldKnow/comments/m9wbgz/ysk_if_you_buy_a_house_in_a_state_with_eviction.json": "Why YSK: In states with eviction moratoriums there have been a few cases of\nsellers refusing to leave the house after the buyer has purchased it, and\nlegally no one can do anything about it until the moratorium is lifted. If\nyou’re a buyer this would be terrible for you. If you’re the seller maybe…",
  "data/reddit-know/r/YouShouldKnow/comments/m9yqva/ysk_that_when_you_write_a_personal_check_youre.json": "Why YSK: A lot of people don’t utilize their bank’s online bill pay feature,\nmyself included up until about a year ago. Not only does it save time, the bank\nusually provides this service for free and will even mail your check for free to\nthe designated payee (so no paying for postage either). When…",
  "data/reddit-know/r/YouShouldKnow/comments/ma3i8x/ysk_if_you_know_someone_who_has_a_hard_time.json": "Why YSK: I deliver for a living. If I know someone is older, I put their\npackages on a table/chair if they have one in front of their house. I get a lot\nof compliments for thinking of that. A little patio table can be found for\n$20-$40 at Walmart or similiar stores. Or even cheaper second hand. You…",
  "data/reddit-know/r/YouShouldKnow/comments/macbux/ysk_almost_all_fishbowls_are_cruel_and_inhumane.json": "You should know that fishbowls are cruel and inhumane. why YSK know this is\nbecause of many reasons.\n\nFirst is the area of the bowl. For some fish like the common goldfish, this is\nimportant because they can get up to a foot. Cramming them in a small space\nmeans there body grows while their organs…",
  "data/reddit-know/r/YouShouldKnow/comments/mafb13/ysk_if_you_make_less_than_72000_a_year_adjusted.json": "Why YSK: (US Only) The program is a partnership between the IRS and popular tax\nfiling software's like TurboTax, TaxSlayer, TaxAct, etc... that allows you to\nfile your entire return for free if you make less than the $72,000 AGI cutoff.\n\nHere's the link to IRS Free…",
  "data/reddit-know/r/YouShouldKnow/comments/maikv8/ysk_rubbing_your_eyes_a_lot_can_actually_make.json": "Why YSK: you should know so you can avoid any further damage to your eyes.\n\nChronically rubbing your eyes can have multiple effects on the health of the\neye. 2 consequences in particular can actually affect your vision long term.\n\n 1. Continuous eye rubbing can lead to thinning of the corneal…",
  "data/reddit-know/r/YouShouldKnow/comments/malse0/ysk_you_could_easily_estimate_the_charge_of_aaaaa.json": "This is true for all disposable battery cells, alkaline, and salt-based. The\nmore depleted the battery, the higher it bounces. It doesn't applies to\nrechargeable cells.\n\nWhy YSK: sometimes you have a mess in your stack of disposable batteries which\nneeds to be sorted out quickly, or you just need to…",
  "data/reddit-know/r/YouShouldKnow/comments/mauown/ysk_the_average_life_span_is_7854_us.json": "Why YSK the average life span in the US is 78.54?\n\nIf your mother or father is current 60 plus reflect on the amount of time you\nspend with them each month. I would bet most people rarely see their parents 1\ntime a month. Meaning most people will have less then 100 of these moments left\nsome less…",
  "data/reddit-know/r/YouShouldKnow/comments/mb05az/ysk_prepare_your_teenagers_to_be_an_adult_better.json": "Why YSK: That way your child(ren) have a better idea of what is in store.\n\nWhen they become teenagers, talk to them about being an adult. Bills/saving\nmoney/different ways to get financial help, investing in money, etc.\n\nTeenage years are the awkward years. Not quite a kid, but not quite an…",
  "data/reddit-know/r/YouShouldKnow/comments/mb3jgr/ysk_always_get_three_estimates_for_any_large.json": "Why YSK: People who come to your house and give you a free estimate are often\nunder pressure to win jobs that will make a big return. What most homeowners\ndon't realize is that many construction projects aren't profitable for the\ncompany, and some will actually lose money.\n\nThe point of the free…",
  "data/reddit-know/r/YouShouldKnow/comments/mb7y1w/ysk_that_if_your_android_is_crashing_today.json": "Why YSK: Android's latest update has been causing apps to crash constantly.\n\nSimply go to Settings->apps, click the three dots and \"Show system apps\". Then,\nopen Android Webview or Chrome and uninstall updates. Hope this helps!\n\nSource: https://www.androidauthority.com/android-apps-crashing-1210994/",
  "data/reddit-know/r/YouShouldKnow/comments/mbin3p/ysk_there_are_many_reasons_a_persons_hands_might.json": "Why YSK: Hand tremors can be caused by many different things and almost none of\nthem are any of your business. Anxiety, a neurological disorder, drug/alcohol\nwithdrawals, and brain damage are a few possible causes. The only one that can\nbe improved by relaxing is anxiety. But calling attention to…",
  "data/reddit-know/r/YouShouldKnow/comments/mbpcl5/ysk_forever_chemicals_or_chemicals_that_dont.json": "It's a slow motion disaster that may potentially wipe out humanity.\n\n> The chemicals to blame for this crisis are found in everything from plastic\n> containers and food wrapping, to waterproof clothes and fragrances in cleaning\n> products, to soaps and shampoos, to electronics and carpeting. Some of…",
  "data/reddit-know/r/YouShouldKnow/comments/mc0xo5/ysk_if_your_job_doesnt_offer_overtime_payment.json": "Why YSK: It should be obvious, but too many people work overtime without getting\nthe proper payment/paid to do it. You shouldn't be guilted into doing over-time\nif you don't get paid for it.",
  "data/reddit-know/r/YouShouldKnow/comments/mc71jy/ysk_if_you_all_of_a_sudden_start_receiving.json": "Why YSK:\n\nThis happened to me this morning (and is still occurring right now). I received\nan alert this morning from Chase advising me of a purchase for $2400 for two\nlaptops from Sams Club for pickup locally within 15 miles of my home.\nImmediately afterwards I started receiving hundreds of…",
  "data/reddit-know/r/YouShouldKnow/comments/mc9lfl/ysk_a_foam_roller_costs_about_the_same_or_less_as.json": "Why YSK: lots of people complain about sore muscles, but many simply either do\nnothing, or load up on OTC painkillers.\n\nFor a more thorough rundown of the benefits and why you should use one, here's a\nlist from a chiropractic / rehab center:\nhttps://www.thorpechiropractic.com/new/index.php/blog/28…",
  "data/reddit-know/r/YouShouldKnow/comments/mcanaw/ysk_wolfram_alpha_exists_wolfram_alpha_is_an.json": "WHY YSK:. I used it in college to double check my work in stats 1 and 2. I use\nit to this day to relearn different formula solutions to help my kids with\nhomework. It helps refresh the long forgotten by going through how Wolfram Alpha\nCalculator got the solution. It will even graph a line.",
  "data/reddit-know/r/YouShouldKnow/comments/mcn3e4/ysk_most_key_fobs_for_vehicles_that_have_keyless.json": "WHY YSK: I'm a tow truck op / roadside assistance tech. A job today reminded me\nof a not so known detail that almost every keyless start vehicle fob has a\nphysical key on the inside. How you access them is different for every\nmake/model vehicle. So if your battery dies on your vehicle and it's…",
  "data/reddit-know/r/YouShouldKnow/comments/mcrnc0/ysk_its_okay_not_to_like_any_kind_of_music_35_of.json": "Why YSK: many people with this condition feel permanently left out because they\ncan't relate to having a favorite song or a playlist for a particular mood. I\nthink it's important for these people to know that it's okay.\n\nThe condition is called specific musical anhedonia. it affects anywhere from…",
  "data/reddit-know/r/YouShouldKnow/comments/md1sz7/ysk_that_if_youre_watching_a_youtube_video_with.json": "Note: I should mention that this won't work if one of your headphone speakers\nare simply just broken. The reason this happens is not a hardware issue but an\nissue with how the YouTuber/content creator edited the audio files, making the\nsound completely pan to either the right or left side.\n\nWhy YSK:…",
  "data/reddit-know/r/YouShouldKnow/comments/md21p2/ysk_your_cars_side_mirrors_are_probably_not_set.json": "Why YSK: It can save you from an accident!!\n\nYour cars side mirrors are not for seeing behind you, but to cover your blind\nspots! If you can see the driver behind you at a red light, they aren't set\nproperly.\n\nTo set them correctly get into the car while parked. Look in the rear view\nmirror while…",
  "data/reddit-know/r/YouShouldKnow/comments/md2q9i/ysk_starting_424_988_is_the_us_national_suicide.json": "Why YSK: the suicide hotline is now easier to remember (similar to 911), which\nmeans it will be easier for people to access when they need it.\n\nHow I know. Literally got this message 5 minutes ago:\n\n> T-Mobile: The FCC has adopted 988 as a 3-digit number to be used nationwide to\n> reach the National…",
  "data/reddit-know/r/YouShouldKnow/comments/md6g9a/ysk_that_youre_worthy_of_love_and_who_you_are.json": "Why YSK: because it is easy to forget this, no external validation will\ncompensate for a lack of self-love, and no matter what mistakes you think you’ve\nmade you are beautiful and wonderful and I love you",
  "data/reddit-know/r/YouShouldKnow/comments/mdj0ml/ysk_just_saying_there_is_a_big_surprize_shocking.json": "Why YSK: Because although you want to attract their attention by increasing\ntheir expectations, you'll ruin their experience. When some idiot tells me \"you\nwill love it, you will not guess the big twist ending\" I immediately find myself\nthinking about the finale instead of focusing the moment and…",
  "data/reddit-know/r/YouShouldKnow/comments/mdx4az/ysk_about_doesthedogdiecom_you_can_look_up_books.json": "Why YSK: Some scenes can be distressing, especially for people with PTSD or who\nhave suffered a loss. Googling a work of fiction is a good way to have it\nspoiled. This site has a list of trigger warnings for works of fiction and won't\nspoil anything.\n\nhttps://www.doesthedogdie.com\n\nThe site tracks…",
  "data/reddit-know/r/YouShouldKnow/comments/mdxlzh/ysk_eliminating_the_words_so_and_very_as.json": "Why YSK: Words like \"so\" and \"very\" are intensifiers and don't carry any real\nmeaning or further description.\n\nSomething \"very hot\" could be anything from a hot day to the center of the\nEarth, so be specific to say what you mean! Instead of \"very hot\", try\n\"boiling\", \"searing\", \"baking\", or…",
  "data/reddit-know/r/YouShouldKnow/comments/mednvq/ysk_that_your_music_taste_may_change.json": "Why YSK: Often times, people listen to a specific type of music to compensate\ncertain feelings. Me for example liked to listen to latin beats and sea shantys\nduring months when I suffered from depression because those kinds of music were\nvery uplifting and helped me forget the grueling everyday…",
  "data/reddit-know/r/YouShouldKnow/comments/meg435/ysk_that_the_ftc_has_a_webpage_to_report_fraud.json": "Why YSK: it assists them in tracking scam and fraud trends, aids in better\npreparing the public to protect themselves against fraudulent solicitations, and\nin some cases helps victims get lost money back.\n\nIf you’re a victim of fraud and lost money, you should definitely report any\ninformation you…",
  "data/reddit-know/r/YouShouldKnow/comments/mejddq/ysk_storing_your_potatoes_next_to_your_onions.json": "Why YSK: I just recently learned that onions produce a gas that makes your\npotatoes sprout eyes and go bad much faster. I had to get a new bag ever 2 weeks\nbefore I moved them, now that they are located elsewhere I'm going over a month\nand a half and they are still fine. Don't waste your potatoes,…",
  "data/reddit-know/r/YouShouldKnow/comments/meoks1/ysk_friendship_is_a_5050_relationship_we.json": "Why YSK: No one likes being ghosted. Though I can understand why you might.\nFeeling guilty about not talking to them can eat at you, ironically enough,\nmaking you not want to contact them. But you either need to end the friendship\npeacefully or make more of an effort. Even if all you do is text and…",
  "data/reddit-know/r/YouShouldKnow/comments/meyjbn/ysk_your_mom_was_right_staring_at_a_screen_all.json": "Yes, those sweet times sitting in front of our TV or PC. Ignoring our parent's\ncalls to go outside. 20 years later I work on the medical research team for\npupillary.org [https://pupillary.org/] and read a lot of papers on this\ntopicbehavioral. And, oh, boy, were they right. Here're just a few small…",
  "data/reddit-know/r/YouShouldKnow/comments/mf001z/ysk_joking_about_suicide_is_a_sign_of_a_crisis.json": "Why YSK: it's rarely a joke this is a sign that someone is reaching out for\nhelp, they don't necessarily want to die but may not see a way out and are\nlooking for help but with all the stigma associated with mental illness it can\nbe hard to come out and say exactly what's going on.\n\nIt's important…",
  "data/reddit-know/r/YouShouldKnow/comments/mf3vjt/ysk_a_symptom_of_depression_is_pushing_people_away.json": "Why YSK: To help stop a friend’s depression becoming even worse.\n\nIf you have a friend who may be depressed, it’s natural for them to ignore texts\nand cancel plans. The golden rule is to never take it personally. Keep on\ntrying. It’s no time to lose friends. Getting angry or thinking ‘well fuck…",
  "data/reddit-know/r/YouShouldKnow/comments/mfguip/ysk_when_a_person_cuts_out_someone_from_their.json": "Why YSK: Everyone comes from a different background.\n\nSometimes if you come from a good family, you can't understand why someone might\ncut out a relative. \"You'll regret it when they're gone!\" Is a pretty common\nsentence, for people who don't understand.\n\nIt could stem from different variety of…",
  "data/reddit-know/r/YouShouldKnow/comments/mfk5da/ysk_there_is_a_website_called_haveibeenpwned.json": "Why YSK, lots of people don't know what companies have leaked or lost your\npersonal data, including email-address and passwords. This way you can check if\nyour data has been leaked so you can change passwords if you use those passwords\non other sites in combination with that email-address. It won't…",
  "data/reddit-know/r/YouShouldKnow/comments/mg2jgk/ysk_some_people_are_covertly_abusive_manipulative.json": "Why YSK: learning to recognise the techniques and patterns of behaviour will\nhelp you protect yourself and better support friends or family suffering\npsychological or emotional abuse. A significant amount of harm has already been\ndone if you have to learn this the hard way.\n\nAbusive power and…",
  "data/reddit-know/r/YouShouldKnow/comments/mgikth/ysk_if_youre_a_college_student_make_sure_you_set.json": "Why YSK: because in many cases you won’t have access to that school email\nanymore or will just forget to check it but you’ll often receive emails to it\nfrom the school long after you’ve left.\n\nAnd sometimes these emails are VERY important (example: “you actually owe us\nmore tuition and if you don’t…",
  "data/reddit-know/r/YouShouldKnow/comments/mgtuci/ysk_burger_den_and_melt_down_on_food_delivery.json": "Why YSK - \"Dennys\" is re-listing portions of thier menu virtually as \"Burger\nDen\" for burgers and \"Melt Down\" for sandwiches to trick you into ordering\n\"Dennys\" in case you thought you were trying something new or supporting a new\nbusiness.\n\nCan confirm the quality is still \"Dennys\" quality.",
  "data/reddit-know/r/YouShouldKnow/comments/mgwzwi/ysk_that_in_parenting_how_you_talk_to_your_child.json": "Why YSK: Parents should know this because there is a widespread misunderstanding\nabout the connection between parental education/income level and child brain and\nlanguage development. Namely, that higher income parents teach their kids more\nwords, and this then leads to better brain language…",
  "data/reddit-know/r/YouShouldKnow/comments/mh093h/ysk_how_to_get_scientific_research_papers_for_free.json": "Why YSK: The $35 that scientific journals charge you to read a paper goes 100%\nto the publisher, 0% to the authors.\n\nIf you just email the authors to ask for their papers, they are allowed to send\nthem to you for free and will be genuinely delighted to do so.",
  "data/reddit-know/r/YouShouldKnow/comments/mh65fn/ysk_richard_jewell_was_arguably_a_hero_who_was.json": "Why YSK: it is important to remember that we can not rush to judgement with\npeople and must be smart and objective. Richard Jewell was a hero whose life was\nultimately ruined by a combination of irresponsible reporting and government\nofficials needing a \"quick win\" to get people comfortable with…",
  "data/reddit-know/r/YouShouldKnow/comments/mhgxvi/ysk_if_youre_a_smoker_nonsmokers_dont_want_to_be.json": "Why YSK: so many times I've been in friends houses or cars with them while\nthey're smoking cigarettes and it's honestly the worst thing, it makes me not\nwant to hang out with those people or go to their houses at all. That kind of\nthing could be affecting your friendships and you may not even know…"
}