{
  "data/reddit-projects/r/SideProject/comments/vonapd/ukrainian_developers_reaching_out.json": "Hey, redditors of the world!\n\nDue to the war in Ukraine thousands of developers have lost their jobs. I with\nmy fellow coworkers from Ukraine have created a community of more than 1200 mid\nto senior level developers (DeFi, web-dev, ML, etc.). We are actively engaged in\nsupporting our citizens and…",
  "data/reddit-projects/r/SideProject/comments/vosz6b/i_interviewed_30_microstartup_founders_ama.json": "Hi SideProject\n\nI just recently interviewed 30 founders who are building their startups (or as I\ncall them: microstartups) as solo developers. I covered these four questions:\n\n- How did you come up with the microstartup idea?\n- How did you find your first customers?\n- How are you finding your…",
  "data/reddit-projects/r/SideProject/comments/vp0ptf/just_launched_my_first_product_on_product_hunt.json": "Hey everyone! It’s been a long journey building AVID to date. Luckily I have an\namazing team to have overcome all the challenges together! Our mission is to\nenable effective knowledge transfer.\n\nLooking at my own experience, I wouldn’t be who I am today if it wasn’t for\naudio learning - back then…",
  "data/reddit-projects/r/SideProject/comments/vpk9vr/how_react_events_are_different_from_javascript.json": "Recently I was asked about this question in an interview and didn't have enough\nknowledge to explain it in depth. After some research I finally understood the\ndifference between react events and JavaScript addeventlisteners and when to use\neach of them based on the use case scenario in react. Its…",
  "data/reddit-projects/r/SideProject/comments/vpo0ey/i_build_an_app_for_asking_and_answering_questions.json": "Hello guys, first time here 😄\n\nSo i build this web app called Qwestions (is hosted here\n[https://qwestions.vercel.app/]), which i describe it as \"an headless\napplication for asking and answering questions of all kinds\". Quite similar to\nReddit.\n\nBasically you can explore Trendings, Popular or…",
  "data/reddit-projects/r/SideProject/comments/vpu2p5/i_got_tired_of_spending_80_on_gas_so_i_built_my.json": "No idea why Google Maps doesn't already have this feature.\n\nI made a chrome extension that takes my multi-stop route on Google Maps and\nrearranges it to give the fastest, most optimal route. It basically tells me\nwhat stops I should go to in what order to ensure that I’m spending the least\namount…",
  "data/reddit-projects/r/SideProject/comments/vqai5p/i_built_a_job_offer_comparison_toolvisualizer.json": "I'm a new grad and recently was recently comparing job offers out of college. I\nhad offers from different companies in different locations and wanted an easy,\nvisual way of comparing offers adjusted by taxes and cost of living. So, I made\nhttps://budget-estimator.vercel.app/ to do just that.\n\nJust…",
  "data/reddit-projects/r/SideProject/comments/vqerd1/i_built_a_chrome_extension_that_summarizes.json": "Hey guys! 👋🏽\n\nSo I've always been pretty lazy. Some months ago, I was working on a pretty\nboring report that consisted mainly of summarizing articles. As a good hacker, I\nrealized that I could automate it. So I made a very simple script using GPT-3 to\nsummarize texts. It worked well. Actually,…",
  "data/reddit-projects/r/SideProject/comments/vq2tgf/the_worlds_first_placebased_social_media_app.json": "The world's first place-based social media app\n\n 1. Create polygon geofences\n 2. Post content within them\n\nConnect with the world like never before.\n\nhttps://play.google.com/store/apps/details?id=com.places.android\n\nUpdate:\n\nMy end goal is to provide users with statistics about every city in the…",
  "data/reddit-projects/r/SideProject/comments/vqd4pe/my_side_project_devobserver_app_for_each_developer.json": "I’ve been working on DevObserver [https://devobserver.com] for a while. Its an\napp where anyone can stay tuned with the latest programming news. Currently it\nis available for iOS [https://apps.apple.com/hu/app/devobserver/id1575198748]\nand as Chrome…",
  "data/reddit-projects/r/SideProject/comments/vr35a4/my_little_side_project_a_browser_extension_that.json": "Hello everyone!\n\nI am posting this post to demonstrate this tool that can export various Discord\nchats. The link to it on the google store is here:\n\nDiscordmate - Discord Chat Exporter\n[https://chrome.google.com/webstore/detail/discordmate-discord-chat/ofjlibelpafmdhigfgggickpejfomamk]\n\nI actually…",
  "data/reddit-projects/r/SideProject/comments/vr59lp/how_our_b2b_startup_got_240_paying_customers_in_3.json": "The times when it was possible to create a useful service, wait for people to\nfind it themselves and start using it, are long gone. Now companies spend a lot\nof effort, time, and money on finding new customers, engaging them, and\ncollecting feedback.\n\nI want to share the story of how we came up…",
  "data/reddit-projects/r/SideProject/comments/vrsltq/how_we_built_an_effective_project_management.json": "I’m Alex, the founder of Krock.io.\n\nYears ago, I founded an animation studio that creates various types of content\nfor many clients worldwide. And I definitely know that every creative project\nmust accomplish the specific goal set by the client. ☝️ It's not just about\ncommercial video making. We…",
  "data/reddit-projects/r/SideProject/comments/vsmfnw/bookmark_an_web_article_and_listen_to_them_later.json": "Hey guys,\n\nI drive to work a lot, spending on average of 2 hours each day. So I have plenty\nof time to listen to Podcast and audiobook on my ride. And I think it would be\nnice to be able to do the same with my reading list, but I couldn't find any\ndecent app on the market that doing this. So I set…",
  "data/reddit-projects/r/SideProject/comments/vsflg5/internshipnew_grad_search_guide.json": "Hello,\n\nI have found many resources that have improved my search for internships and new\ngrad opportunities and decided to combine them into a single guide for any and\nall to use.\n\nI have published this guide here:\nhttps://github.com/TStansel/Internship_and_NewGrad_SearchGuide\n\nPlease feel more…",
  "data/reddit-projects/r/SideProject/comments/vsuob5/we_built_a_tiktoktinder_for_finding_gifts_or.json": "Hey makers, founders and people who thinks that shopping gifts for our loved\nones REALLY sucks. Yes, we love them, but we hate the process - the time, the\nhassle and the stress.\n\nMy co-founder, Cole, and I found buying a gift today hard because:\n\n * It’s hard to find unique gifts that’s…",
  "data/reddit-projects/r/SideProject/comments/vte3rz/i_made_little_etf_funds_screener.json": "Hi r/SideProject [/r/SideProject]! I made a site that lets Europeans find and\ncompare ETF funds easily:\nPH 🚀: https://www.producthunt.com/posts/greatetf\nSite 🌐: https://greatetf.com/funds/",
  "data/reddit-projects/r/SideProject/comments/vtihjz/we_built_a_tiktoktinder_for_finding_gifts_or.json": "Hey makers, founders and people who thinks that shopping gifts for our loved\nones REALLY sucks. Yes, we love them, but we hate the process - the time, the\nhassle and the stress.\n\nMy co-founder, Cole, and I found buying a gift today hard because:\n\nIt’s hard to find unique gifts that’s personalized…",
  "data/reddit-projects/r/SideProject/comments/vu8w3u/nsfw_i_made_a_web_based_reddit_nsfw_client_to.json": "I usually find it a bit inconvenient to browse NSFW content via Reddit itself,\nbecause it forces you to either login or use their mobile app. That's why I made\nmy own NSFW client to comfortably browse NSFW content.\n\nIt features a responsive design and you can browse new, hot and top content…",
  "data/reddit-projects/r/SideProject/comments/vu5ya9/marketing_tool_for_promoting_startups_and_new.json": "Ok guys,\n\nWe’ve launched a product that’s promoting your startups and businesses and\nactually giving you a shot to compete against millions of other businesses out\nthere.\n\nRight now you can:\n\n· Increase your site SEO performance\n\n· Gain valid backlinks (dofollow and nofollow)\n\n· Get early feedback…",
  "data/reddit-projects/r/SideProject/comments/vvxgti/the_easiest_way_to_buy_sell_side_projects.json": "Hi Guys,\n\nI've been working on a marketplace [https://secondfounder.com] where you can buy\nand sell side projects. If you have anything to sell please post it here\n[https://secondfounder.com/submit-project]. My main goal to build this product\nis to make it easier than other platforms like…",
  "data/reddit-projects/r/SideProject/comments/vwe67o/nocode_website_builder_for_ui_and_ux_designers.json": "Hi everyone!\n\nToday we release a new project on Product Hunt, called Siter.io\n[https://siter.io/]. It’s a no-code website builder that allows you to design\nand publish websites without any code. It works by designing directly in the\nbrowser, freehand, using tools you already know (as Figma or…",
  "data/reddit-projects/r/SideProject/comments/vw79p9/app_readybotio_rss_feed_to_discord_a_newly.json": "Our website - https://readybot.io/\n\nWe are in early alpha release targeting a really specific use case with RSS.\nSending RSS feeds straight to your discord server!\n\nAll for free! We do have a paid option, but that's more targeted towards power\nusers and mostly everyone else should be able to use…",
  "data/reddit-projects/r/SideProject/comments/vwupmx/roomie_a_tasksharing_app_for_roommates_in_a.json": "I built a full-stack app: Roomie [https://roomiee.netlify.app/home] to manage\nhousework for roommates in a shared apartment. The app allows users to create\ntasks and assign them to apartment members. Then, from the calendar, every user\ncan view what all members need to do in the selected week. Here…",
  "data/reddit-projects/r/SideProject/comments/vwv506/sidehustle_turned_into_successful_product.json": "What started as a pain in the ass (talking about debugging without proper bug\nreports) turned into a sideproject during the pandemic.\n\nFast forward ---> 2 years later\n\nSuccessful 2nd Producthunt launch! https://www.producthunt.com/posts/disbug-2-0\n\nDisbug 2.0 for you! A visual feedback tool that…",
  "data/reddit-projects/r/SideProject/comments/vx3zuk/master_web_development_by_building_realworld.json": "Hello folks 👋,\n\nI have been following this subreddit for a while and I think some of you might\nbe interested in my side project.\n\nSo, there are many ways to learn Web Development. Most people start with a\ntutorial, but that's not enough. You need to build your own projects in order to\ngain…",
  "data/reddit-projects/r/SideProject/comments/vx0vi6/tachyoncmsorg_a_zero_install_localfirst_cms_open.json": "Hello all! I just wanted to share my side project now that it's progressed to\nbeing useful.\nTake a look and tell me what you think.\n\n * Web based - Just visit the website load the app, close your browser and its\n   gone.\n * Local First - your content never leaves your computer, you don't need…",
  "data/reddit-projects/r/SideProject/comments/vxxag4/launched_sellscale_personalize_cold_outreach_at.json": "SellScale generates hyper-personalized cold outreach by scraping data on\nprospects from across the web. We generate emails prospects actually want to\nread - far from {{First Name}} swaps. With SellScale, we've seen up to a 10x\nconversion on cold outreach.\n\nCheck it out over here: SellScale…",
  "data/reddit-projects/r/SideProject/comments/vy0dpz/ive_built_a_tool_to_attach_files_in_google_sheets.json": "FileDrop is a free Google Sheets add-on that allows you to insert a file into a\nspreadsheet cell [https://getfiledrop.com/attach-pdf-file-google-sheets-cell/]\nwith automatic linking and adding it to Google Drive. You can add images, pdf's,\nword documents or any other file.\n\nSee it working…",
  "data/reddit-projects/r/SideProject/comments/vy1mq3/i_made_a_free_course_directory_for_indie_makers.json": "Good morning r/SideProject [/r/SideProject]!\n\nI made Course Monkey [https://coursemonkey.co/] to help organize all the awesome\ncourses by makers. I noticed a lot of fragmentation between courses with their\nown sites and the ones on larger platforms.\n\nIt took 4 days to build and I'm really happy…",
  "data/reddit-projects/r/SideProject/comments/vy7nar/bringing_the_sharing_economy_tolaundry.json": "My friend and I are building an app called Shwap (www.shwap.app\n[https://www.shwap.app?utm_source=Reddit&utm_medium=Organic+Post&utm_campaign=r%2Fsideproject_An+app+that+brings+the+sharing+economy+to%E2%80%A6laundry%21%3F%21%3F]).\nOur idea is to allow folks to rent a neighbor’s washing machine, or…",
  "data/reddit-projects/r/SideProject/comments/vy8434/passedboxcom_like_dead_man_switch_for_sensitive.json": "Hi guys, I built https://passedbox.com/ as an alternative to dead man switch\nthat supports encrypted files. With this in mind you'll have to share your box\npassword to your beneficiary. The box won't be accessible until you stopped\nresponding to your keep alive messages. For people who wants to…",
  "data/reddit-projects/r/SideProject/comments/vyaoue/i_made_an_app_that_plays_clicking_sounds_when_you.json": "I always loved the sounds that keyboards and mice make and ever since I've\ndiscovered Mechvibes [https://github.com/hainguyents13/mechvibes] I've been\nusing it all the time when coding or browsing the internet.(you should check\nMechvibes [https://github.com/hainguyents13/mechvibes] out if you like…",
  "data/reddit-projects/r/SideProject/comments/vypi4r/a_platform_i_am_building_for_developers_to_build.json": "This is my biggest project as of yet and has been in the making for 18 months!\nPERN (NextJS) on AWS and Azure (for Serverless).\n\nskillShack(⚡️); [https://skillshack.dev/] is a community for software\nprofessionals looking to share the projects they are working on and get\nfeedback. From side projects…",
  "data/reddit-projects/r/SideProject/comments/vz37sg/i_built_a_chrome_extension_to_save_jobs_directly.json": "Hey all - I built a Chrome extension\n[https://chrome.google.com/webstore/detail/resumary-oneclick-save-jo/mkjedhephckpdnpadogmilejdbgbbdfm?hl=en]\nthat adds a button to LinkedIn, Indeed, and Lever to autosave the job's title,\ncompany, and link in a Google Sheet so you can organize all your…",
  "data/reddit-projects/r/SideProject/comments/vz4aho/i_released_a_new_app_and_i_need_your_feedback.json": "Hello!\n\nIn June 2022, I launched an android app and since then I have been updating it.\nThe app is intended to be like a forum social app. Lets say a mix between 9gag,\nand reddit. (With obviously fewer features).\n\nThe app content is divided by countries, so you can have posts from…",
  "data/reddit-projects/r/SideProject/comments/vzn0uk/business_idea_a_brand_of_gag_gifts_that_doesnt.json": "Hey guys! Every week I post a few business ideas on here for you all to chat\nabout. If you’d like to see our archive of past ideas at the bottom.\n\n\nBACKGROUND\n\nI hate gag gifts. But not because I don’t like the idea of them. I hate them\nbecause they always boil down to “Oh wow, you got me garbage!…",
  "data/reddit-projects/r/SideProject/comments/vzspq4/i_trained_an_ai_to_play_super_smash_bros_melee.json": "Hey all, over the past couple of months I’ve been working on making a Super\nSmash Bros: Melee, and I turned my results into a video. The bot learns through\nimitation learning based off of a simplified version of replays of tournament\ngames. This is probably one of the most ambitious projects I’ve…",
  "data/reddit-projects/r/SideProject/comments/vzy5jj/morning_brew_meets_ladbible.json": "So for a while I’ve been working on a media/content business on the side, called\nThe Hedge.\n\nI’ve always had to be a bit vanilla with the content due to my full time job,\nbut that’s recently changed and now I can actually do what I want.\n\nThe result I’m going for is a cross between Morning Brew and…",
  "data/reddit-projects/r/SideProject/comments/vzw9gm/time_to_giveaway_made_345885_since_adding_paid.json": "It's been 3 months since Pieter Levels from NomadList & RemoteOK sent me a DM\nsuggesting including paid options to Job Board Search 🔎\n[https://jobboardsearch.com/] , made $3458.85 💵 since…",
  "data/reddit-projects/r/SideProject/comments/w00tjm/trajectry_smash_your_outreach_with_unrivaled.json": "I'm building Trajectry, a service that monitors and compiles a monthly database\nof the fastest-growing businesses and prospects who have the resources to become\nyour next paying clients.\n\nThe membership includes in depth personalization research on each target that is\ndone to ensure your cold…",
  "data/reddit-projects/r/SideProject/comments/vzzyxf/i_was_buying_too_much_online_so_i_made_a_chrome.json": "Hi all, during the first part of the pandemic, I realized I was buying way too\nmuch online on impulse. I started reading about all the psychological and\nneurological tricks and \"hacks\" that online sellers use to get people to buy.\nAll the terminology really turned me off--seeing people as \"clicks\"…",
  "data/reddit-projects/r/SideProject/comments/w0ml1a/quotes_app_with_an_offline_database_of_over.json": "Hi,\n\nI made the Instant Quotes app, an offline database of 808,689 quotes by 28,675\nauthors. You can use it to search for a quote with the desired keyword or browse\nquotes by a selected author.\n\nThe Quote database is on your device, so there is no need for an internet\nconnection, thus there is an…",
  "data/reddit-projects/r/SideProject/comments/w0schy/apply_to_jobs_faster_with_automation_lazyapply.json": "hey folks,\n\nwe made a chrome extension called lazyapply to automatically apply for 1000's of\njobs posted on job portals like linkedin , indeed and ziprecruiter in single\nclick\n\nwhat's your thought about it ?\n\nGive it a try",
  "data/reddit-projects/r/SideProject/comments/w1npre/nonprofit_career_consulting_platform.json": "Hello everyone,\n\nWe recently started a nonprofit career consulting platform called Best Foot\nForward (BFF) that aims to guide prospective professionals navigate the job hunt\nprocess.\n\nAlong with my Partners, we provide free coffee chats as well as resume reviews\nand mock interviews in exchange for…",
  "data/reddit-projects/r/SideProject/comments/w1d0xk/my_masterpiece_is_complete.json": "5 years of development\n\nI have finally created the world's first app to connect you with society based\non place data.\n\nHere's how it works:\n\n 1. Create geofences\n 2. Check into these (and other) geofences\n 3. Join post boards based on rank (and statistics)\n\nThis app is especially for travelers.…",
  "data/reddit-projects/r/SideProject/comments/w1tpo9/get_in_front_of_your_target_audience_with_free.json": "With billions of other startups and businesses out there, getting seen by your\ntarget audience gets harder and harder every day. You probably think, if my\nproduct is good enough, I'm sure it'll build its way through the market.\nUnfortunately, it doesn't work like that. Nowadays, people spend a…",
  "data/reddit-projects/r/SideProject/comments/w20028/there_are_200_form_builders_but_none_of_them_can.json": "So according to G2 there are 225 form builders\n[https://www.g2.com/categories/online-form-builder]. I have not tried every\nsingle one, but I did try the top 20 with a free plan. None of them could do\nwhat I needed them to do, which was build a form that could produce a quote or\nestimate for a…",
  "data/reddit-projects/r/SideProject/comments/w1arlj/find_out_how_much_time_you_spend_on_netflix_with.json": "Ever wondered how much time you spend on Netflix? Now you can easily find out\nwith https://netflixcalculator.com.",
  "data/reddit-projects/r/SideProject/comments/w1zvhz/just_launched_my_first_web_app_free_homepages.json": "Hey!\n\nI just deployed https://sty.re, and would love any feedback you might have on it\n:)\n\nThe web app lets users create their own homepages, which they can populate with\nlinks to their social media profiles, or other content they may have on the\nworld wide web. Theres no paid plan, and its all…",
  "data/reddit-projects/r/SideProject/comments/w24znk/unlimited_webflow_development_service.json": "Today I've launched with a partner my dream-come-true unlimited Webflow\ndevelopment agency - https://Forever.so\n\n\n\nWhy dream-come-true? Well, I always wanted to start an agency in a new yet\nestablished and fast-growing market.\n\nWhile Webflow has been around for years, and I've been working with it…",
  "data/reddit-projects/r/SideProject/comments/w26azb/decipad_storytelling_with_numbers_its_like_notion.json": "I've been working on Decipad. It's a low-code notebook to tell stories with\nnumbers and build interactive models. It's like Notion with spreadsheet-like\ncapabilities. You can build and publish interactive notebooks for things like:\nforecasting, burn rate, a mortgage calculator, or just something…",
  "data/reddit-projects/r/SideProject/comments/w22b42/maïka_my_side_project_to_help_you_find_cafés_to.json": "As a digital nomad, I sometimes struggle finding suitable place to work from. So\nI decided to create an app to list these places - mainly coffee shops: Maïka\n[https://maika.coffee/download.html].\n\nIt’s community based. Every user can add their favorite cafés (we're getting\nclose to 400, in more…",
  "data/reddit-projects/r/SideProject/comments/w33f3o/side_project_for_finding_side_project_cofounders.json": "There's tons of stuff to find cofounders for your typical venture-backed startup\n(ycombinator, on deck, etc). But I haven't found anything good for finding a\n\"side project\"-cofounder, or a nights & weekends cofounder.\n\nI'm hoping this can help: https://weekendcofounder.com/\n\nThe goal: match people…",
  "data/reddit-projects/r/SideProject/comments/w3mmj8/are_you_good_at_english_lets_try_harfer_guess_the.json": "We are happy to announce the first mobile game of Etrexio! Harfer - Guess the\nWord is a mobile game that was developed by Etrexio team and made with #flutter\n[https://twitter.com/hashtag/flutter?src=hashtag_click].\n\nWe started with a simple game engine and design. With The Harfer our main focus\nis…",
  "data/reddit-projects/r/SideProject/comments/w3zez0/introducing_lexopcitcom_the_collected_book_and.json": "Thrilled to finally have enough to share. After countless half-baked side\nprojects, I am old man who learned some new tricks in Django, and dusted off\nHTML knowledge from the late 90's. LexOpCit [https://www.lexopcit.com] is the\nresult.\n\nAny Lex fans hopefully find some value, others, let me have…",
  "data/reddit-projects/r/SideProject/comments/w3ln0c/boomerang_an_easier_way_to_switch_between_your.json": "Hey Reddit! My name is Mitchell Mark-George and I'm a developer from Ottawa,\nCanada. Today I am launching my Chrome extension Boomerang.\n\nBoomerang is a simple, lightweight, and fast extension that allows you to switch\nbetween your previous and current tab at the speed of thought. Simply…",
  "data/reddit-projects/r/SideProject/comments/w3zz5h/how_do_you_say_it_i_built_a_game_for_my_girls.json": "I usually play this game with my 4 and 6 year old girls who are learning\nEnglish. I ask them how to say X word in English and they really enjoy trying to\nanswer the correct word and I also encourage them to learn new words with each\nattempt. We have a great time as a family with this little…",
  "data/reddit-projects/r/SideProject/comments/w3vnol/i_built_a_linktree_alternative_for_indie_authors.json": "Tl;dr: the website is 1link [https://1link.st/] and the HTML template is\navailable for free on Gumroad [https://scastiel.gumroad.com/l/author-link-page].\n\nHi 👋\n\nI released the first version of 1link [https://1link.st], and it is now possible\nto sign up, create a beautiful link page, showcase books…",
  "data/reddit-projects/r/SideProject/comments/w3wlyo/i_will_develop_the_api_you_need.json": "Hi,\n\nI am a web developer and I will develop an API that you need but it:\n\n- doesn't exists\n\n- it's not good enough\n\n- it's too expensive.\n\n\n\nIf you have any ideas put them in comments :)",
  "data/reddit-projects/r/SideProject/comments/w50gvc/i_built_a_guide_for_people_who_climb_to_the.json": "I've been climbing state highpoints for ten years now. Whenever I planned a\nclimb, I had to visit several old & clunky websites to gather route details,\npermits, and so on. I wanted a single, user-friendly starting point when\nplanning my trips, so I built a guide that other people could use…",
  "data/reddit-projects/r/SideProject/comments/w56dan/ramenlist_i_made_a_list_with_the_latest_mrr_posts.json": "👋 Hey there,\n\nI'm enjoying watching all the founders & indie hackers hitting their MRRs.\nThat's why I made this list, where anyone can submit the revenue. 👉\nhttps://ramenlist.co/\n\nThe revenues are grouped by day, similarly to producthunt.com or betalist.io\n[https://betalist.io/].\n\nTuan,\n\nfeel…",
  "data/reddit-projects/r/SideProject/comments/w5fk4n/i_made_a_tool_that_makes_serverless_functions.json": "https://reddit.com/link/w5fk4n/video/lttiv8dqh5d91/player",
  "data/reddit-projects/r/SideProject/comments/w5ni5t/web_app_idea_project_management_platform_thats.json": "Just looking for a little feedback/suggestions on my incomplete idea. After\nworking on engineering project teams that are lead by typical engineering\nmanagers with no project management background, I've noticed a few trends\n(disorganization and confusion) and potential gaps in the current…",
  "data/reddit-projects/r/SideProject/comments/w5ygpp/officerbreaker_pptxdocxxlsx_password_remover.json": "Hi everyone!\n\nIn case you ever forget the password for any Microsoft Office file\n(pptx/xlsx/docx) you locked I built a tool\n[https://github.com/nedlir/OfficerBreaker] that removes the password from the\nfile without cracking it.\n\n\nHOW DOES IT WORK?\n\nAll pptx/xlsx/docx files are part of the Office…",
  "data/reddit-projects/r/SideProject/comments/w6wsj4/im_a_broke_college_student_that_cant_keep.json": "No idea why Google Maps doesn't already have this feature.\n\nI made a chrome extension that takes my multi-stop route on Google Maps and\nrearranges it to give the fastest, most optimal route. It basically tells me\nwhat stops I should go to in what order to ensure that I’m spending the least\namount…",
  "data/reddit-projects/r/SideProject/comments/w7e7bj/kpi_dashboard_mboardxyz.json": "v1.0.5 is coming soon\n\nhttps://preview.redd.it/matv0k0zvmd91.png?width=1440&format=png&auto=webp&s=40c0512c58ae9680c0ec0a59572d337644f9ba1c",
  "data/reddit-projects/r/SideProject/comments/w7jg57/i_built_an_opensource_browser_start_page_for.json": "Hi all, I built a browser start page for developers with all the tools and\nservices frequently used. It is optimized to load faster and be responsive on\nmobile and desktop. Navigate to your browser setting and change the start page\nto https://mydash.fun\n\nLink- www.mydash.fun…",
  "data/reddit-projects/r/SideProject/comments/w7old4/startup_ideas_to_inspire_your_next_side_project.json": "Here are 7 cool startups I came across when researching for my newsletter\n[http://theranking.co/]. I started writing it for myself, as I found that\nlearning about other's ideas helps identify problems and possible businesses\naround me. I hope it does the same for you:\n\n1.- Hintsa: high-performance…",
  "data/reddit-projects/r/SideProject/comments/w7m9pn/daily_fact_or_fiction.json": "Hi all!\n\nI have made my first side project that I have not made alone! I teamed up with a\nfriend to provide content and it feels so good to have someone on the content\nside.\n\nThe project is basically a daily Fact or Fiction trivia, done in the\nWORLDE-esque fashion - one question a day + stats to…",
  "data/reddit-projects/r/SideProject/comments/w7x855/i_built_a_website_of_my_moms_recipes_of_bosnian.json": "https://maminabosanskakuhinja.com/en/\n\nI built this website together with my mom to share her recipes and way of\ncooking various Bosnian traditional and every day food.\n\nCheck it out and let me know what you think.",
  "data/reddit-projects/r/SideProject/comments/w87e5p/updated_offer_for_fully_managed_websites_its.json": "A week ago, I posted in r/SideProject [/r/SideProject] about my take on the\nWebflow development agency. I've garnered quite a few upvotes, some comments,\nand a few PMs.\n\nI've also posted in a few groups on Facebook as well.\n\nI've got a few messages that were similar - it'd be great if I could use…",
  "data/reddit-projects/r/SideProject/comments/w88h2j/i_made_an_events_service_and_wanted_to_share.json": "Think EventBridge without max number of rulesets, Event Grid or Eventarc but you\ncan integrate with anyone, or SQS without limiting DelaySeconds on events.\n[https://preview.redd.it/zkip052zvtd91.png?width=756&format=png&auto=webp&s=5a41aad779dc88fb2f9e92c088f241148025410d]\n\nI made a service to make…",
  "data/reddit-projects/r/SideProject/comments/w7vflr/so_i_just_built_an_upvote_board_application.json": "So I just built an Upvote board application inspired by 50hacks.co\n[https://50hacks.co/]\n\nThe link is https://board.linksight.app/ so you can try it out.\n\nHere are my ideas on how to make SAAS from it:\n\n- Employee feedback board - a place where bigger companies can hear their\nemployees and their…",
  "data/reddit-projects/r/SideProject/comments/w8gesc/building_an_app_which_converts_google_sheets_into.json": "Hello everyone,\n\nI recently acquired a side project Chartmat.com\n[https://chartmat.com/?utm_source=reddit&utm_medium=nocode] which is a simple no\ncode tool to build apps on top of Google Sheets and you can host it on a custom\ndomain . You can use prebuilt templates or your google sheet as backend…",
  "data/reddit-projects/r/SideProject/comments/w8paqy/merlin_exchange_what_do_you_think_about_this.json": "Following my previous posts about Merlin Exchange, what would you think about\nthis concept?",
  "data/reddit-projects/r/SideProject/comments/w9arnt/i_created_a_bike_app_to_connect_cyclists_with.json": "Bike app Cyclope [https://reddit.com/link/w9arnt/video/ekei8oqzd3e91/player]\n\nThe bike app Cyclope [https://www.cyclope.dev] allows, in addition to the\nclassic functions of a bike computer, to connect the cyclists in them.\n\nYou can know the position of the other riders, have the time gap, create…",
  "data/reddit-projects/r/SideProject/comments/w9mapi/i_made_a_crowdsourced_cdn_for_more_ethical.json": "Been working on this for a while, but the general idea is that it can give users\nsubscriptions to digital platforms by paying them to transfer third-party video\ncontent rather than selling their user data for targeted ads.\n\nCheck it out if you want at www.apiara.net…",
  "data/reddit-projects/r/SideProject/comments/w9okze/my_newsletter_is_making_2000_per_month_with_6500.json": "Hi everyone!\n\nRoughly two years ago when the pandemic had people shifting to a WFH\nenvironment, I started a twice-weekly newsletter called Workspaces\n[https://www.workspaces.xyz/] that gives readers a behind the scenes tour of\ntheir favorite entrepreneurs, designers, developers, etc. new desk…"
}