{
  "data/reddit-ask/r/AskHistorians/comments/ttdo9f/i_am_famed_naturalist_historian_politician_and.json": "Salvete! I am here sitting on the shores of the bay of Naples enjoying a calm\nevening at rest, between my busy life as an imperial administrator, writer,\nacademic, natural philosopher, natural historian, military commander,\nrhetorician, etc... As I can gaze across the bay at the rolling slopes of…",
  "data/reddit-ask/r/NoStupidQuestions/comments/tthehn/should_puerto_rico_be_granted_statehood_to_become.json": "What do you think? Statehood for Puerto Rico?",
  "data/reddit-ask/r/NoStupidQuestions/comments/ttiojj/why_is_it_bad_to_be_a_socialist.json": "I’m so confused on why it’s a bad thing in America and other parts of the world\nto be a socialist.\n\nI live in Sweden and I get free Heath care that works very well. Just the other\nday I got a free x-ray. Wait times are no problem. I also got to visit a\ntherapist for free after my grandfather died.…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ttfij5/why_does_it_take_45_minutes_for_me_to_climax.json": "Does having a condom on prevent some men from climaxing? This is a recurring\nenough issue to where I’ve realized I’ll never fuck someone and be done in under\nhalf an hour. It’s better than lasting 5 minutes, but by the end it’s kinda\npainful for both of us. I just don’t understand",
  "data/reddit-ask/r/AskHistorians/comments/ttdhdm/april_fools_alert_askhistoricalfiguresanything.json": "Hi everyone!\n\nAs is tradition, for April Fools we let our hair down a bit and allow some\nfrivolity to infest the subreddit. This year we are doing r/HistoricalAMA\n[/r/HistoricalAMA], inviting historical figures from throughout the centuries to\nanswer questions from their legions of fans.\n\nUntil…",
  "data/reddit-ask/r/askscience/comments/ttk7ay/is_there_enough_density_change_in_a_trees_growth.json": "Hearing that in order to work out the age of a tree you need to either take a\ncore sample or cut down the whole tree, opening it up to infection or even\ndeath, couldn't Ultrasound be adapted to peek at the rings without needing to\ndamage the tree?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ttjkc1/why_is_person_of_color_considered_okay_but.json": "I'm black and even I don't understand this.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ttm3qe/is_it_bad_that_i_dont_like_to_think_of_myself_as.json": "It leaves such a bad taste in my mouth. It just feels like such a strong word.\nAnd whenever I think of it in those terms, it’s like it becomes… real. This\nprobably doesn’t make any sense but I don’t know how to describe it. It doesn’t\nalways feel like I was raped. Even though technically it was non…",
  "data/reddit-ask/r/AskHistorians/comments/ttgh1p/i_am_the_true_sacred_sovereign_on_earth_the.json": "Proof\n[https://media.discordapp.net/attachments/761189757761749003/958214626091348039/Hong_AMA.png?width=1702&height=1404]\n\nGreetings to my brothers and sisters over the Internet. I, the true sacred\nsovereign, have deigned to speak candidly beyond the walls of my mighty palace\nto those who would…",
  "data/reddit-ask/r/NoStupidQuestions/comments/ttfe7a/why_is_it_so_hard_to_buy_a_new_car_with_manual.json": "I keep trying. Nissan said it was possible but would take a year and would cost\nme more. I remember when you paid extra for automatic. What gives?",
  "data/reddit-ask/r/AskHistorians/comments/ttmep9/i_am_leonidas_king_of_sparta_ask_me_anything.json": "GREETINGS, REDDIT! I AM LEONIDAS, THIRD SON OF KING ANAXANDRIDAS AND FIRST IN\nFAME OF THE AGIAD HOUSE! THE EPHORS HAVE DECREED A RARE DAY OF OPENNESS TO THE\nCURIOSITY OF FOREIGNERS!\n\nPROOF! [https://imgur.com/az1mAT5]",
  "data/reddit-ask/r/AskHistorians/comments/ttfaqw/explorer_governor_of_new_york_vice_president.json": "Proof: https://imgur.com/S5nmQBV",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ttkglm/housing_bubble_burstgood_thing.json": "If the housing bubble bursts, that's means people who are investing in\nproperties will loose their profits and potentially the money they invested in\nthe first place, but in the end it will mean housing is more affordable,\nbenefiting people struggling to own a modest single family home...right or…",
  "data/reddit-ask/r/NoStupidQuestions/comments/ttkcdr/im_genuinely_curious_but_why_does_the_republican.json": "I’m neutral, but see way too many articles that mention Republicans voting\nagainst anything that can help American citizens live a better life that’s\nnormal anywhere outside the US.",
  "data/reddit-ask/r/AskHistorians/comments/ttnktq/i_am_the_honorable_andrew_oliver_esq_the_assigned.json": "Honorable gentlemen,\n\nSome of you might know my name and person, but for those who are unaware, my\nname is Andrew Oliver Esq., Secretary of the Province of Massachusetts Bay. In\nthe early months of the year of our lord seventeen-sixty-five, I was\ncommissioned as stamp distributor for the Province…",
  "data/reddit-ask/r/AskHistorians/comments/ttpm8n/we_are_the_wives_of_henry_viii_king_of_england.json": "Greetings! Here be our proof. [https://imgur.com/a/MHCMep3]\n\nWe, the six wives of King Henry VIII, shall jointly share this account to answer\nyour questions about our lives and our tumultuous times. We shall individually\nintroduce ourselves:\n\n> I am Katherine, daughter of Isabel of Castile and…",
  "data/reddit-ask/r/AskHistorians/comments/ttplom/i_am_sokrates_son_of_sophroniskos_of_the_deme.json": "But do not wonder if I ask you questions in return.",
  "data/reddit-ask/r/NoStupidQuestions/comments/ttqck9/republicans_of_reddit_can_someone_please_explain.json": "I just read a Fox News article and it seems this issue has resurfaced in\nright-wing media. The article is titled “Gaetz sends Nadler hard drive\ncontaining contents of Hunter Biden’s laptop.” Since this controversy’s\ninception, I’ve been unable to find any evidence of wrongdoing or illegality…",
  "data/reddit-ask/r/NoStupidQuestions/comments/ttpjyp/im_a_21_year_old_male_and_i_feel_my_memory_is.json": "I feel like as a 21 year old, my memory seriously should not be this bad, and\nI’m not sure if it’s always been this bad or if it’s been declining recently\n(see. Shit memory) I often forget things I’ve just read and have just been\noverall slow it feels; am I going crazy? Also, not sure if there is…",
  "data/reddit-ask/r/AskHistorians/comments/ttmq1h/i_am_jeane_dixon_famed_medium_psychic_and.json": "Proof. [https://imgur.com/a/4yK4Px5]\n\nIt is I - the one, the only, the incomparable Jeane Dixon, renowned psychic,\nauthor and close confidante of the 40th President of the United States, Nancy\nReagan. I've written multiple best-selling books, including an autobiography, a\ncookbook and of course my…",
  "data/reddit-ask/r/AskHistorians/comments/tteaqz/hello_i_am_rebecca_gratz_a_charitable_organizer.json": "Proof [https://imgur.com/hjwTrGS]\n\nI was born in Philadelphia in 1781, soon after the founding of our great nation.\nMy parents raised us to be devout Jews, but also gave us excellent educations,\nand my father's income allowed us to mingle with society. As such, while only an\namateur poet myself, in…",
  "data/reddit-ask/r/AskHistorians/comments/ttl2vn/i_am_an_soe_wireless_operator_broadcasting_from.json": "... --- ...\n\nGreetings! This message is coming to you over the airwaves from a secret\nlocation in Nazi-occupied Paris. I can't stay broadcasting for too long before\nthe Gestapo track me down, so get your questions in before I have to go off air\nand hide.\n\nedit: I will decode these at the end of…",
  "data/reddit-ask/r/NoStupidQuestions/comments/ttstre/why_does_every_website_now_have_massive_annoying.json": "I hate companies tracking my activities as much as the next guy but why do\nwebsites have to be so obnoxious about notifying us that they're tracking us?\nSeems excessive and pointless.",
  "data/reddit-ask/r/NoStupidQuestions/comments/tthk65/crotch_staring.json": "I just have this automatic habit of looking crotch area on men . In a split\nsecond , I just look down there and sometimes I get caught doing it and I don’t\nknow why I do it ?! It’s automatic, I don’t even realize I’m doing it most of\nthe time. Anyone else ? Why ?",
  "data/reddit-ask/r/NoStupidQuestions/comments/ttxi72/how_can_i_see_who_voted_no_on_the_insulin_bill.json": "I live in Arkansas and completely believe that our representatives voted no for\nthis bill, but I want to make sure before I go writing letters to every level of\nmy government up to my governor.",
  "data/reddit-ask/r/NoStupidQuestions/comments/ttvdqa/when_i_say_im_deaf_whats_the_first_thing_that.json": "First question, not first thing, sorry, can’t edit title. Doing this for a\nschool assignment. Feel free to ask questions (I am deaf)",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ttyxzs/how_can_smallboobed_girls_gain_confidence.json": "I’m insecure about my small boobs and always have been. I’m a B-cup and I’ve\nlooked into implants and fat transfers for awhile. That being said, this\ninsecurity makes me hesitant to take off my shirt when my bf and I have sex. I\nreally try to avoid it as much as possible honestly. I told my bf…",
  "data/reddit-ask/r/AskHistorians/comments/ttw68k/i_am_henry_curtmantle_king_of_england_duke_of.json": "I am Henry, by the grace of God, King of England, Duke of Normandy and\nAquitaine, Count of Anjou and Maine. Son of Empress Matilda, and Geoffrey\nPlantagenet, Count of Anjou.\n\nIn light of my connection with the murder of Archbishop Thomas Becket, my former\nchancellor and friend, and the recent…",
  "data/reddit-ask/r/askscience/comments/tu24t5/would_the_insulin_of_the_1920s_be_acceptable_for.json": "In the 1920s, insulin co-inventors James Collip and Charles Best sold the rights\nto the University of Toronto. Since that time I believe the formulations of\ninsulin and its manufacturing method have changed quite a bit. My question: If\nyou were able to transport the insulin from the 1920s to…",
  "data/reddit-ask/r/askscience/comments/tty6fr/not_sure_if_this_is_exactly_a_science_question.json": "I’m talking about records detailing what we now know could’ve been significant\nradioactive sources or radioactivity-related injuries, any time between the\nfirst written record up until the first industrial revolution.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/tu5vz5/for_guys_if_i_a_female_were_to_walk_up_to_you_on.json": "For context, I live in a not-so-great city but have to walk home at night all\nthe time, and sometimes I don’t feel safe. I want to go up to an unassuming guy\nand do the whole “oh my god Matt there you are, I’ve been looking all over for\nyou!” but I feel that a guy would either not get it or I’d be…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/tu3f2c/is_cereal_for_dinner_an_acceptable_meal_for_an.json": "My roommate thinks that adults should not eat cereal with the slim exception of\neating it for breakfast. I’m definitely going to eat cereal whenever/wherever I\nwant regardless of what anyone thinks, just wanted to know y’all’s thoughts on\nit.\n\nEdit - Clarification: not sure how much it matters but…",
  "data/reddit-ask/r/NoStupidQuestions/comments/tu50kb/do_other_guys_actually_enjoy_watching_a_girl_blow.json": "I consider myself an average male with average taste in porn, but for the life\nof me I can’t figure out who thought it was hot when a girl sucks on a toy as if\nit’s a real dick. Are there guys out there that enjoy watching these scenes?\nIt’s sort of a mood killer for me because all I can think…",
  "data/reddit-ask/r/NoStupidQuestions/comments/tu9b41/what_would_you_call_a_chocolate_chip_cookie.json": "They are technically not sugar cookies, as those have different amount of flour\nand use only white sugar, while chocolate chip cookie recipes call for both\nwhite and brown. Dough cookie maybe?",
  "data/reddit-ask/r/AskHistorians/comments/tu10hl/i_am_harry_truman_failed_haberdasher_piano_player.json": "It does my heart good to be here. Best get all your questions in before I strike\na blow for liberty this afternoon, though, although I may come back and answer\nwhat I can later.\n\nI'm joined by my press secretary, /u/therealcharlieross, who often advises me to\nsay 'no comment' among other…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ttqs5r/why_do_people_smoke_cigarettes.json": "I mean it is not like weeds or drugs , it doesn't drug you or make you feel good\n? Am i missing something ?",
  "data/reddit-ask/r/AskHistorians/comments/tug62y/what_is_the_basis_for_the_stereotypical_cartoon.json": "Just about every animated depiction of a bomb that I’ve ever seen is the same -\na black sphere with a fuse sticking out of it, like this.\n[https://cdn4.vectorstock.com/i/1000x1000/12/73/a-classic-cartoon-style-black-round-bomb-lit-vector-20631273.jpg]\nIs that based on any actual explosives that…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/tui3nr/is_not_having_enough_sex_a_good_enough_reason_to.json": "This recently happened to a buddy of mine.\n\nThey were together for about 2 years, and after countless of efforts from his\nside to talk about the lack of sex in their relationship (and things not\nchanging) he decided to break up with her.\n\nNow everyone thinks he's the bad guy, because everything…",
  "data/reddit-ask/r/NoStupidQuestions/comments/tuaof9/what_does_it_mean_that_will_smith_resigned_from.json": "Like are his movies no longer able to be nominated? Can he no longer attend the\nOscar's? Did he previously have a vote on something that he doesn't now?",
  "data/reddit-ask/r/NoStupidQuestions/comments/tuh5x3/why_arent_you_required_to_retake_your_driving.json": "Cant think of any other licence where you're operating machinery that doesnt\nrequire regular renewal.",
  "data/reddit-ask/r/NoStupidQuestions/comments/tuiclq/why_is_platonic_marriage_not_a_thing.json": "hear me out. let’s take marriage for what it essentially is- a legal and\nfinancial binding. By no means does marriage heighten or deepen a romantic\nconnection.. therefore it makes me think- someone you have a bond with and\nestablished deep trust for that can support a life you both want is someone…",
  "data/reddit-ask/r/NoStupidQuestions/comments/tuj2op/my_girl_is_dogsitting_at_someones_house_for_a.json": "The clients are an older couple, I'm guessing the guy signed into his google\n(edit seems to be amazon) account from 2007 and it's connected. My first thought\nwas to report it but that's either really ruining someone's life (if he's not\nactually a pedo) or If they determine there's nothing they can…",
  "data/reddit-ask/r/AskWomen/comments/tugpqc/whats_a_big_mood_killer_something_that_really.json": "EDIT: thanks for the replies!",
  "data/reddit-ask/r/NoStupidQuestions/comments/tuvdeu/your_telling_me_that_there_are_billions_of_stars.json": "I can’t even comprehend how big the universe is. And that’s just the observable\nuniverse….",
  "data/reddit-ask/r/NoStupidQuestions/comments/tuxk46/who_actually_feels_that_money_would_solve_all_of.json": "I feel like I would pay for the top notch medical care",
  "data/reddit-ask/r/TooAfraidToAsk/comments/tuyrn9/why_do_so_many_men_simply_dont_give_women_oral.json": "Do they not know what the heck they are all doing or Seriously, this is one of\nthe most frequently talked about things in sex threads on female related\nsubreddits. It also seems to be an experience that my IRL female friends very\nmuch share: dudes just stick it in your mouth, then your vagina, then…",
  "data/reddit-ask/r/AskHistorians/comments/tusp1l/did_welldigging_technology_improve_or_change_in.json": "I know the question is very general. I am interested in any technological\nimprovements to water wells. Regardless of place or general time.",
  "data/reddit-ask/r/NoStupidQuestions/comments/tuzh35/did_anyone_else_used_to_think_ftw_meant_fuck_the.json": "I thought it was the inverse of WTF, and I thought it was just a phrase you said\nwhen something good happened. Like, \"hell yeah man, fuck the what.\" Did anyone\nelse think this? I think some other kids used it like that growing up, so I feel\nlike I might not be the only one.",
  "data/reddit-ask/r/NoStupidQuestions/comments/tuya8r/any_dudes_out_there_get_easily_teary_eyed_during.json": "I remember I once got teary eyed during Nacho Libre of all films when he got\nkicked out the orphanage but he walked away with his head high because he knew\nhis path was righteous. Fuck getting teary just thinking about it now lol.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/tv1hgb/anyone_get_sad_when_no_one_asks_about_a_bandaid.json": "I got a lil cut on my finger and put a bandaid on it. My lady and mom didn’t\nnotice. I waited for them to notice. Maybe they did. I’m a grown man but it\nstill bothers me on a superficial level 🤷",
  "data/reddit-ask/r/AskWomen/comments/tv08u9/women_what_is_something_you_have_stopped_buying.json": "What is something you have decided to stop buying for whatever reason?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/tv4tw0/how_do_i_tell_my_bf_this_news.json": "My bf told me from the very beginning that we will always be living with his mom\nor she will always be living with us. (I was only 18 and She’s an entitled\nnarcissist who thinks she can’t live without her son) I don’t want to live with\nthis woman. I can’t think of anything unhappier than that,…",
  "data/reddit-ask/r/AskHistorians/comments/tutd5b/how_do_contemporary_academics_who_say_that_race.json": "In the ancient world, there seem to be numerous examples of writers and artists\nacknowledging that groups of humans have shared physical and cultural\ncharacteristics and labeling them with specific group names, in some cases\nstereotyping them negatively. How does this differ from what we now call…",
  "data/reddit-ask/r/AskHistorians/comments/tv5p6z/the_catholic_church_held_all_its_rites_in_latin.json": "The Catholic Church held all its rites (including the Mass) in Latin until\nSecond Vatican Council (1962-65), and prohibited translations of the Bible until\nquite late. Was it an intentional obscurantism to not let the believers\nunderstand the Bible and liturgy (so that the Church could manipuate…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/tv3i6d/why_is_our_society_built_in_a_way_that_we_have_to.json": "If life is so precious and we should take advantage of everyday we have, why is\nit that our “normal” is to have to work so hard for things we should already\nhave. I think the way our society is built makes it too stressful to be able to\ntake advantage of how lucky we are to be alive, and instead…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/tv7dhn/if_you_spank_someones_ass_really_hard_and_they.json": "The skin can’t heal itself if you’re dead, right?\n\nEdit: I don’t mean they die from the spanking, if they die from something\nunrelated.",
  "data/reddit-ask/r/AskHistorians/comments/tv8rh8/the_popular_sea_shanty_what_shall_we_do_with_a.json": "I'm thinking about women in particular here, since I imagine it must have been a\nvery male-dominated environment. Did they face a lot of harassment? Also, was\nsocializing with the crew permitted? And if not, what did they do for fun?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/tv7xlv/why_do_so_many_black_women_wear_wigs.json": "For context, I live in the Netherlands, so I'm not sure how it is in other\ncountries but I am assuming is not exclusive from here.\n\nIt seems that many black women wear wigs or fake hair, and there are several\nshops that focus on this market. I don't know the reason. I guess it can be\nbecause of…",
  "data/reddit-ask/r/AskHistorians/comments/tv9gz2/dantes_divine_comedy_features_8_verses_written_in.json": "My question was prompted by this wonderful video\n[https://www.youtube.com/watch?v=p8qdqAE5ZKA].\n\nI can think of two factors:\n\n1.) Occitan-speaking regions' absorption into France following the Albigensian\nCrusade and the reduction of its cultural prominence (and that of cities like\nBordeaux's…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/tv88l1/boys_watch_lesbian_porn_do_girls_also_watch_gay.json": "lesbian logic :- 2 girls are better than one\n\nso do girls also follow the same logic ?",
  "data/reddit-ask/r/NoStupidQuestions/comments/tva0zh/is_it_true_that_in_some_western_countries_like.json": "#I don't mean flushing, but about cleaning your bottom after the business is\ndone.\n\nNo judgement here as I believe in you do you, but my friend who has lived in all\nthree places told me so. I am just wondering if it is true or is he just pulling\nmy leg?\n\nHere in Sri Lanka, we use a hand bidet, so…",
  "data/reddit-ask/r/askscience/comments/tv8af5/what_determines_where_the_poles_are_on_a_ball.json": "On a bar magnet, one end is north and the other is south. What exactly\ndetermines which end is which?\n\nWhat about a sphere magnet? They would be on opposite sides obviously but what\ndetermines where the north and south are on something that doesn't have ends?\n\nCouldn't really find an answer from…",
  "data/reddit-ask/r/AskWomen/comments/tvdqcm/women_who_live_with_their_so_which_year_in_your.json": "How has it been so far in terms of emotional and sexual health?",
  "data/reddit-ask/r/NoStupidQuestions/comments/tvj5jo/is_it_natural_to_feel_like_the_covid19_pandemic.json": "I feel like it’s changed me. I don’t even recognise who I am anymore.",
  "data/reddit-ask/r/askscience/comments/tv4jgc/why_is_a_french_curve_set_sufficient_for_drawing.json": "The instrument in question is this: https://en.m.wikipedia.org/wiki/French_curve\n\nIt seems to be based on euler curves, and its use is to take a number of points,\nfind the part of the toolset that best lines up with some of them and using that\nas a ruler.\n\nWhat I can't wrap my head around is…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/tvoiar/why_are_women_more_likely_to_believe_in_astrology.json": "I’ve noticed that more women bring this subject up than men, and every time it\nis referenced in media the people who believe in it are referred to as ‘rock\ngirls’ or some variant. I’m not knocking it, I’m just wondering if it’s\nsomething to do with how women’s vs. men’s brains work biologically?…",
  "data/reddit-ask/r/AskHistorians/comments/tvk1ad/why_did_coastal_parts_of_west_africa_never_take.json": "I understand on a general level, a large part of it is probably due to the mass\ncolonization and dicing up of African regions which led to/increased turmoil\nacross the continent, but is there more to it than that or more specifics?\n\nWhat I mean is, for US folks (I can’t speak to other countries),…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/tvqaqn/do_people_actually_think_babies_are_cute_or_is_it.json": "Not even gonna lie, babies are kinda just ugly. All of them. But people get\noffended when I say so. I find it hard to believe that they would actually think\na baby is cute.",
  "data/reddit-ask/r/NoStupidQuestions/comments/tvwlxl/the_us_visa_form_asks_you_if_you_are_planning_to.json": "I'm really struggling to wrap my head around why this question exists. If I was\na terrorist then I'd just click no. Surely this has caught NO terrorists ever.\nBut I'm sure people have accidentally clicked yes a few times\n\nSo why on earth do they ask it",
  "data/reddit-ask/r/AskHistorians/comments/tvv0z9/now_that_the_us_has_released_the_data_from_the.json": "I understand it's a broad question; I'm just curious about anything specific\nthat might be of interest for historians of the USA.",
  "data/reddit-ask/r/AskHistorians/comments/tvzz6i/what_led_the_welsh_english_to_unite_against_the.json": "Hello! As the title asks, I wish to know what led to an Anglo-Welsh alliance\n(Mercia, Wessex & The Cymru proper, I believe) against the Vikings.\n\nWeren't the Welsh & Anglo-Saxon factions historically hostile with one another\nalso, or did the presence of the Vikings strike both groups as…",
  "data/reddit-ask/r/NoStupidQuestions/comments/tvxid4/i_met_all_my_boyfriends_on_dating_apps_and_guys.json": "I consider myself a fairly attractive woman, and I hear it from people quite a\nlot. But guys never approach me in public, meanwhile I constantly hear from my\nfriends how they get approached in bars, cafes, public transport, streets etc.\nAlso, all of them met their boyfriends in real life and they…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/tw1l1z/is_reddit_basically_just_trolling_us_with_its.json": "So many complaints have been made for many years and the reddit video player is\nstill the same complete rage inducing garbage that never plays videos without\nlagging, stopping, not reacting or lowering the quality after 1 second...\n\nI think reddit developers just don't care and despite never ending…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/tw4wun/how_do_women_get_bigger_boobs.json": "I’m 24 and I’ve been made fun of for having small boobs since high school. I’m a\ntiny A cup and just want to grow one cup bigger. I’m just so done having small\nboobs and want to look good in certain clothes.",
  "data/reddit-ask/r/NoStupidQuestions/comments/tw5t5p/would_the_librarians_get_mad_if_i_just_waltz_in.json": "I've been struggling to find a decent way to study and the first thing that\ncomes to mind is a change of scenery. I'm lucky to have a city with a pretty\ngood library in place. My concern is: would it be rude to just plop down like\nthat? I'm planning on using my headphones to listen to music and…",
  "data/reddit-ask/r/AskHistorians/comments/tw4yyr/vikings_and_varangians_left_scandinavia_roughly.json": "Additionally, can any of the cultural differences between Western and Eastern\nEuropean cultures be partly attributed to differences in these two groups (a la\nthe argument made in Albion's Seed)?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/twjpus/is_it_ok_for_a_26yo_to_date_a_17yo.json": "My 17yo friend is dating a 26yo. I'm the only person she's told. Furthermore\nthey've already had sex (initiated by the 26yo) and that would be breaking the\nlaw.\n\nI don't feel right about it. I don't think a 26yo should be dating a 17yo\nbecause I don't think an adult should be dating a minor. That…",
  "data/reddit-ask/r/askscience/comments/twlkd9/how_do_you_determine_the_age_of_living_plants.json": "We recently visited Namibia , where the Welwitschia\n[https://en.m.wikipedia.org/wiki/Welwitschia] grows. Supposedly to ages of >2000\nyears. How would they establish this for a living example? It doesn’t have a\nstem where you could count rings.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/twrrce/why_is_reddit_full_of_snarky_commentors.json": "I’m honestly hesitant to post/comment sometimes because I know there’ll be one\narsehole who has to rush in to reply something snarky and unhelpful.\n\nYes i’m setting myself up.",
  "data/reddit-ask/r/NoStupidQuestions/comments/tws8st/i_just_rescued_4_kittens_from_the_street_what_do.json": "My neighbor abandoned 4 kittens in boxes in my neighborhood and I found them and\ntook them to a vet the vet gave them a clean bill of health but now I'm left to\nlook after them.\n\nMy friend wants to adopt 2 of them but they're so young I don't know what to do.\n\nI also have a mama cat (not their mama…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/twv138/accidentally_gave_my_boyfriend_head_with_a_cold.json": "Yesterday morning I got elbowed in the face and my lips were really tender. By\nmidday a painful lump started forming on my lip, but I was still chalking it up\nto getting elbowed. Last night, I performed unprotected oral sex on my\nboyfriend--just for a couple minutes, and he didn't cum.\n\nThis…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/twnzz6/is_being_a_single_parent_really_that_much_off_a.json": "I (30, M) am a single father of two girls (4, 2.5). I have a good head on my\nshoulders, stable career, and own my own home. I haven’t (really) tried to get\nback into the dating scene recently, but when I have in the past I was brushed\noff a LOT because I have kids. No that’s fine. I understand a…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/twthyp/why_did_the_word_retarded_become_a_slur_but_other.json": "It's a question that's been on my mind once in a while and hearing someone go\noff about its usage reminded me of it once again and thought i'd ask this time\naround. Moron, idiot, stupid, were all medical terms at some point and still in\nnormal use, and noone seems to associate it or treat it the…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/twwlzs/i_dont_understand_the_argument_for_being_born_as.json": "I’ve heard people say that they were “born gay” or something along those lines\nand they take the nature vs. nurture argument to be 100% nature and that\nsocietal influences didn’t effect their decision to come out and “if I were born\nin the 1300s Middle East I still would have been gay just…",
  "data/reddit-ask/r/NoStupidQuestions/comments/twx5bk/why_do_people_assume_that_the_way_things_are_is.json": "This constantly frustrates me. People all over seem to think that the only way\nthings can be is the way they are.\n\nI was talking to one of my coworkers about cars. He literally cannot imagine a\nworld without cars. We lived for millennia without cars and now he can't imagine\nwhat life would be like…",
  "data/reddit-ask/r/askscience/comments/twuv6l/does_the_length_of_sleep_affect_the_perceived.json": "Time in dreams is a bit scooty, but I'm sure it's a pretty common experience\nthat we sometimes have dreams which seem to go on for much longer than others.\n\nIs this at all related to the amount of time we're asleep? Can we have dreams\nwhich feel like they're longer than the time we actually slept…",
  "data/reddit-ask/r/NoStupidQuestions/comments/tx3fwc/why_do_we_say_verbally_o_instead_of_0_for_dates.json": "For example, people say 19O1 (nineteen-O-one) instead of saying 1901\n(ninteen-zero-one)? It just seems weird considering O is a letter and 0 is the\nnumber. We use them backwards verbally... which is just weird to me.",
  "data/reddit-ask/r/askscience/comments/tx3run/will_there_ever_be_a_point_in_time_on_earth_when.json": "Another phrasing: will there ever be a point in time where the beginnings of the\ngeologic record will be wiped away by geologic forces?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/tx58r3/why_people_afraid_to_say_islam_is_a_dangerous.json": "I'm living in a Islamic country. I was a Muslim till 3 years ago, and now I'm an\natheist. I have read quran verse by verse.\n\nIn an Islamic country, if you drink water in street in Ramadan, you can get\narrested and they can imprison you, and beat you just because you were thirsty.\n\nin Quran, a man…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/tx50rq/if_i_feed_wild_crows_and_eventually_teach_them_to.json": "I mean they aren't really \"mine\"",
  "data/reddit-ask/r/AskHistorians/comments/twyzgr/according_to_the_recent_news_reports_russia_seems.json": "Besides recent attempts by groups like ISIS, do we have documented cases where\nerasing cultural heritage was something intentionally done by other empires or\nnations? I've heard about Napoleon shooting off noses of statues but I'm not\nsure if that was true or not",
  "data/reddit-ask/r/NoStupidQuestions/comments/tx3ycx/my_family_wants_to_get_another_pet_but_im_scared.json": "My last pet of 18 years (my whole life) we had to put down due to renal/liver\nfailure and the trauma of that was horrifying. To watch my best friend\ndisintegrate and suffer and after 2 weeks of misery for the poor guy he had to\nbe put down, I’ll never get past it. How can people do this over and…",
  "data/reddit-ask/r/AskHistorians/comments/tx83rw/what_is_the_current_most_heated_debate_on_a_topic.json": "A question a little bit outside of the box, hopefully it won't be deleted. What\nis the current controversial discussion happening in academia, over your\ndifferent fields of study. For example, in Linguistics, the recursion debate\nrages on, but the average Joe isn't particularly aware of it. Perhaps…",
  "data/reddit-ask/r/NoStupidQuestions/comments/txasnd/is_it_okay_to_ask_if_a_person_is_clean_of_stis.json": "I feel like this is such an awkward question. Also before having sex i kind of\nwant to know someones body count and if theyve ever been tested before, but this\nseems like such an awkward exchange if you're about to get hot and heavy with a\nrando.",
  "data/reddit-ask/r/AskWomen/comments/twma7d/women_who_used_to_be_too_selfconscious_and.json": "Edit: I am sooo happy for you all <33",
  "data/reddit-ask/r/TooAfraidToAsk/comments/tx5ad5/how_can_a_fat_dude_go_to_the_gym_without_feeling.json": "I'm 20yo, and I'm 100kg (220pounds if my math is correct). I really need to go\nto the gym, both because of my physical and mental health. But I can't stop\nthinking about the fact that everyone's going to be looking at me? I also have\nno experience, so that's another issue as a whole",
  "data/reddit-ask/r/AskHistorians/comments/tx9gwr/was_stealing_a_base_in_baseball_a_deliberate.json": "What's the history behind stealing a base? It seems like an strange thing to\nallow? Was it a deliberate inclusion and if so what does it add to the game?\n\nOr did it evolve from an oversight in the rules that they decided to make an\nofficial part of the game?\n\nIt just seems so random to me and I'm…",
  "data/reddit-ask/r/NoStupidQuestions/comments/txbl2m/are_people_just_not_interested_in_climate_change.json": "So the new IPCC report on climate change is out. As expected, bad news. The\nworld has around 3 years to drastically reduce emissions to avoid the worst\neffects of climate change in a few decades. Sea levels rising (1-8 feet,\ndisplacing millions in just the US alone), droughts, more powerful…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/txcxw4/why_is_the_stereotype_that_muslims_are_terrorists.json": "Both of these prejudices are harmful to a lot of people. I am neither Muslim nor\nCatholic by the way",
  "data/reddit-ask/r/AskHistorians/comments/twy2h2/how_well_regarded_is_an_indigenous_peoples.json": "Curious to know what this group thinks about the book An Indigenous Peoples'\nHistory of the United States\n(https://www.penguinrandomhouse.com/books/237686/an-indigenous-peoples-history-of-the-united-states-by-roxanne-dunbar-ortiz/)\n\nI’m interested in a perspective like this, but googling it mostly…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/tx73oi/why_is_that_when_man_dosent_want_to_have_sex.json": "They question his sexuality\n\nQuestion his tetostorone levels\n\nQuestion if he is asexual\n\nQuestion if he has trauma\n\nHowever when it is a girl in question she can simply just not be in a mood.\nHowever when it is a guy, there has to be a certain issue. So why is that?",
  "data/reddit-ask/r/askscience/comments/tx7vn1/how_come_covid_vaccines_that_are_variant_specific.json": "Moderna is now in phase 2 of their omicron booster shot.\n\nhttps://www.clinicaltrialsarena.com/news/moderna-omicron-specific-booster/\n\nNo word on Pfizer. But why the wait? Why not just submit for an EUA right away?\nIs the vaccine that different that it would need much data to support it? Will\nthis…",
  "data/reddit-ask/r/NoStupidQuestions/comments/txgdp6/can_people_really_picture_things_in_their_head.json": "My friend told me to close my eyes and imagine a zebra in a green field. I\nobviously know what both things look like, and it registers in my mind but… I\ndon’t literally see a zebra standing in a field… do some people actually have\nthat ability?\n\nedit; and please guys don’t fuck with me I’m having a…",
  "data/reddit-ask/r/NoStupidQuestions/comments/txd3e1/do_you_ever_feel_like_you_wish_you_could_cry_but.json": "If you know what I mean, how do you deal with that feeling? I think it's been\nyears since I was able to cry no matter what situation I find myself in...\n\nEdit** I really appreciate all of yalls comments. It's nice to hear random\npeople talk about this instead of makin someone I actually know have…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/txasfy/how_does_people_like_matt_gaetz_remain_in_the.json": "From what I can gather he has been caught multiple times with underage people,\nhe constantly contradicts himself and is usually against anything that seems\ntotally sane. He voted against a sex trafficking law, against sactions against\nrussia and against capping the price of insulin at 35 dollars.…",
  "data/reddit-ask/r/askphilosophy/comments/tx2gfx/when_plato_mentions_god_is_he_talking_about_zeus.json": "What or who does Plato mean by God? As in the Timaeus when he ascribes the\ncreation of the universe to God.",
  "data/reddit-ask/r/NoStupidQuestions/comments/txigru/there_are_hundreds_of_religions_that_claim_they.json": "For example Islam claims christian and Jews even if you were good, are going to\nhell cuz you don’t believe in islam same with Jews an other religions. Why did\nyou make it so hard, there’s so many good people I know that don’t follow x\nreligion, it’s very hard to figure out what would be true and…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/txk7xb/is_the_us_medical_system_really_as_broken_as_the.json": "Do you really have to pay for an Ambulance ride? How much does 'regular\nmedicine' cost, like a pack of Ibuprofen (or any other brand of painkillers)?\nAnd the most fucked up of all. How can it be, that in the 21st century in a\nfirst world country a phrase like 'medical expense bankruptcy' can even…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/txkwpt/why_post_nut_clarity_make_me_crave_for_gay_porn.json": "Do most men has this because every time i nutted to girl porn, i start wanting\ndick in my mouth or ass. Is it gay if you want to have sex with a man but still\nfap to women in porn ?.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/txiyd4/how_do_you_figure_out_if_you_want_to_have_kids_or.json": "I've asked a few close people in my life who say you'll know when you know. But\nI haven't gotten there yet. I'm 26 and every girl my age I know has had at least\n1 but I've been thinking about it for years now and just can't pin down feeling\none way or there other I've never felt like such a fence…",
  "data/reddit-ask/r/NoStupidQuestions/comments/txjoyd/is_the_blm_global_network_foundation_really.json": "Just to clarify, I am not asking this question in bad faith. I support the BLM\nmovement (which can be separated from the foundation) and I donated money\nmyself. But I’ve been reading a few articles from reputable sources saying that\n$6 million of the donation was used to secretly buy a mansion for…",
  "data/reddit-ask/r/AskHistorians/comments/txl15c/why_did_the_voters_of_ukraine_vote_82_to_stay.json": "The Ukrainian electorate, in March 1991, voted 82% to stay Soviet\n[https://en.wikipedia.org/wiki/1991_Soviet_Union_referendum#Ukraine]. 9 months\nlater, in December, a second referendum was held (the USSR was still around at\nthis point, it wouldn't collapse until 3 weeks later) but Ukraine…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/txg4vf/do_women_like_men_with_chest_hair.json": "I feel a bit insecure about the amount of hair that i have. I usually shave it\nand let it grow a little but some times i just say \"fuck it\" and let it grow all\nthe way until I can run my fingers through the hair.\n\nEdit: thanks for the answers! I guess it is subjective.\n\nI guess a follow up question…",
  "data/reddit-ask/r/askscience/comments/txn0ia/what_are_parrots_trying_to_achieve_by_mimicking.json": "Don't know how much Animal Behaviour fits this subreddit, but I think it is a\nscientific question nonetheless.\n\nI like watching videos of domestic parrots making dozens of different sounds,\nand sometimes it's hard to think they're being made at random. When a parrot\nmimics a sound, what are they…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/txnnz8/why_do_people_want_men_to_be_emotional_yet_the.json": "Never really understood why men are told to be emotional if the only thing they\nget in return is a horrible attitude and be told to \"man up\". How come people\nwant one thing, yet be against that very same thing? Like I've heard both\nconservatives, liberals, feminists and men's rights activists say…",
  "data/reddit-ask/r/NoStupidQuestions/comments/txp81j/why_are_conservatives_opposed_to_government.json": "Sincere question. Conservatives consider mask and vaccination mandates as\nviolations of people’s rights. But forcing a woman to have baby is considered to\nbe acceptable.\n\nThe “best” justification I’ve heard is that an unborn baby shouldn’t have to be\nkilled because the mother was irresponsible. But…",
  "data/reddit-ask/r/AskWomen/comments/txo1vf/how_many_times_did_you_attempt_to_leave_your.json": "Whether it be because of personal or external reasons. The abuse can be\nphysical, mental, emotional, sexual, etc.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/txw0wu/its_2022_why_are_legislators_and_faith_leaders.json": "I'm a male. But as a progressive and a humanitarian I find it creepy and\npathetic as well as sickening.\n\nHarsh new anti-abortion laws that completely disregard the expectant mother's\nhealth, safety, and well-being. The continued criminalization of sex work\nbetween consenting adults. Those creepy…"
}