{
  "data/reddit-books/r/books/comments/ovf9e9/just_finished_the_bell_jar_by_sylvia_plath_and_im.json": "This book has been on my TBR for a long time, and the description on the back\nkept me from reading it (perhaps it struck too close to home, not sure). But I\nabsolutely adored Plath’s writing, her descriptions of New York in the 1950s,\nand the way I felt as if I were Esther herself. I look forward to…",
  "data/reddit-books/r/books/comments/ovfwdb/catch_and_kill_by_ronan_farrow_i_thought_i_knew.json": "TW; subject includes sexual assault\n\nQuick summary of the book: Catch and Kill is predominantly Ronan Farrow's\njourney to uncovering and making the public aware of Harvey Weinstein's decades\nof predatory sexual assault and harassment against the women he worked with. He\nfollows this with a look at…",
  "data/reddit-books/r/books/comments/ovo3ct/is_its_normal_thing_to_finish_a_book_and_have.json": "Hi there,\n\nAs a kid and through high school, I read maybe 10 books, I pretty much refused\nto read. Even since then, I haven’t read much but I’m trying to get into it now.\n\nI just finished Man’s Search for Meaning and while I was reading I’d pick out a\nfew things here and there which I thought I…",
  "data/reddit-books/r/books/comments/ovor34/just_finished_neuromancer_for_the_first_time_it.json": "What a ride, seriously. Aside from the fantastic story, it's just incredible\nwhat an influence Neuromancer was on culture as a whole. It's like every page\nheld some passage that made me think, \"no way, so that's where that comes from\".\nI was aware that it was an influential novel and birthed the…",
  "data/reddit-books/r/books/comments/ovt663/do_you_think_that_we_should_seperate_the_books.json": "As an example, I really like the work of H. P. Lovecraft. Lovecraft is known as\nquit a racist,would you think less of his work because of that if he was\nalive?certainly if he was posting stuff on social media then our opinion\ncouldn't remain completely unbiased but the stories would still be good or…",
  "data/reddit-books/r/books/comments/ovzduv/so_i_started_the_pillars_of_the_earth_by_ken.json": "...and wow, why didn't I discover it earlier. As a brit who loves history, this\nmakes me want to go out and visit medieval villages in England. The way medieval\nlive is described through different POVs with characters coming from various\nsocial backgrounds gives us amazing insight into their lives,…",
  "data/reddit-books/r/books/comments/ow0bgl/i_just_finished_fear_and_loathing_in_las_vegas.json": "On the recommendation of my friend, I read Fear and Loathing in Las Vegas by\nHunter S. Thompson (1971). I read the book with absolutely no context other than\nthat it is supposedly autobiographical, and I really have no idea what to make\nof what I just read. I have several questions and would love to…",
  "data/reddit-books/r/books/comments/ow5s6b/does_anyone_get_hung_up_on_certain_lines_and.json": "First off, I have obsessive-compulsive disorder, to which I have always\nattributed my obsessive behaviour. But I'm just wondering if anyone else\nexperiences this problem. I've heard some think of it more like a \"thought\ncycle\" where they constantly reread some lines because they feel like it…",
  "data/reddit-books/r/books/comments/owbmgj/war_and_peace_and_oh_my_gosh_tolstoy_who_are_you.json": "Started reading W&P on Saturday (Briggs penguin), I finished the first volume\nyesterday and I have to say, I can’t be the only person getting lost about who\nis who? I had to reread a chapter once I realised Rostov was Nikolai and I’d\nmanaged to somehow make him an entirely new character in my head.…",
  "data/reddit-books/r/books/comments/owh7g3/the_last_book_that_pissed_you_off.json": "So, this is a very specific topic, because I've just finished a book that really\njust pissed me off.\n\nPoor dude is burned out and depressed when his wife passes away in a plane\ncrash... Except his \"best friends\" (and family!) are sacred that he'll kill\nhimself so they all lie to him, tell him she…",
  "data/reddit-books/r/books/comments/owixbn/what_is_the_most_beautiful_book_youve_ever_read.json": "I was re-reading Giovanni's Room and I marveled at the strength of James\nBaldwin's prose, and how effortlessly beautiful it is, although the book as a\nwhole has a fragile quality. Giovanni's Room in itself is a masterpiece. I think\nthat you can definitely associate an aesthetic quality with a book,…",
  "data/reddit-books/r/books/comments/owrqxp/guide_to_getting_it_on_and_books_that_can.json": "I figured this book would have been mentioned a bunch of times already, but\nsearching didn't turn up many results, so here it goes.\n\nThe 'Guide to Getting It On', by Paul Joannides\n[https://www.goodreads.com/book/show/72834.Guide_to_Getting_It_On_?ac=1&from_search=true&qid=whEaHexXdF&rank=1]\nis, I…",
  "data/reddit-books/r/books/comments/owv082/currently_reading_crime_and_punishment_what_do.json": "Im currently reading Crime and Punishment by dostoevsky and i can say with\nconfidence that this is on of the best books i have ever read (if not the best).\n\nThe way you are welcomed into the charecters mind and the harsh realistic nature\nof the book is just fascinating, the depth that every living…",
  "data/reddit-books/r/books/comments/ox2eti/the_broken_earth_trilogy_was_really_good.json": "No, I don't know who \"they\" is.. . just that my general impression had been that\npeople generally though N.K. Jeminsen was amazing and her books lovely. Of\ncourse, I read the Inheritance Trilogy on reading similar praise but have to\nadmit I didn't care for it as much. While I completely appreciated…",
  "data/reddit-books/r/books/comments/ox3qum/taking_books_out_at_a_library_vs.json": "I was having a dispute with a colleague of mine that taking books out of a\nlibrary is not the same as torrenting them. Their stance was \"you are not paying\nfor them either way, what is the difference?\". I really didn't know what to say\nto this in terms of hard library numbers so I had to get back to…",
  "data/reddit-books/r/books/comments/ox6pmh/for_those_who_use_public_libraries_what_do_you.json": "There are 2 libraries close to me and they belong to 2 different counties. One\nhas overdue fines and other doesn't. It didn't make any difference whatsoever in\nchoosing which book to finish first and never paid late fee .\n\nDo you think this overdue fine system encourage the on-time return of…",
  "data/reddit-books/r/books/comments/ox7ard/if_a_fictional_universe_has_dragons_and_magic_in.json": "I think the idea of fantasy worlds are so cool. I love seeing dragons and magic\nand struggles between good and evil. It's all amazing to me. But when some\npeople get their panties in a twist about forced diversity because one\nbackground character is darker than others it just makes me think that…",
  "data/reddit-books/r/books/comments/oxbfrp/cant_get_it_out_of_my_head_the_beauty_of_some.json": "So I read The Great Gatsby around a month ago and...\n\nHow absolutely hauntingly beautiful is the whole Green Light element of the\nstory!! Can't stop thinking about it. Gatsby pusued her with such intensity that\nhis whole universe revolved around it, nothing else mattered and it became the\nonly…",
  "data/reddit-books/r/books/comments/oxpa7q/never_let_me_go_an_excellent_start_to_my_kazuo.json": "Right off, I very much liked the narrative style. I cannot recall if I've ever\nread a book that focuses primarily on the narrator recalling their own memories.\nIn that sense it was very accurate. Sometimes Kath would focus on trivial\ndetails like the colour of her blouse, or the shadow falling on…",
  "data/reddit-books/r/books/comments/oxqsue/if_theres_a_book_that_you_want_to_read_but_it.json": "Above is a quote by Toni Morrison. When i saw this quote i found it deeply\npoignant and moving. Also, sometimes, you see exactly what you need to see when\nyou need to see it. I have a particular story that I’ve wanted to tell for a\nvery long time but I’ve found the idea of writing a book rather…",
  "data/reddit-books/r/books/comments/oxtle0/i_claudius.json": "What a fantastic historical fiction, and I base that on the fact it reads like a\nGame of Thrones story. The fact I feel bad for a Caesar who holds slaves etc,\nmakes me wonder if these stories are far from the truth. How screwed up was\nsociety only 2000 years ago, the grand scale of cultures mixed,…",
  "data/reddit-books/r/books/comments/oxvak5/reading_on_a_mountaintop.json": "So I have something to vent about. My friend recently went hiking and when he\ngot to the summit of the mountain, he says he saw a young man reading a book.\nThe mountain was busy, with the nice weather and all, and everyone else was\nenjoying the wonderful view they had. My friend telling this story…",
  "data/reddit-books/r/books/comments/oxvywb/i_hate_sex_scenes.json": "As the title says, I hate sex scenes in novels. This is mostly it's because it's\nalways so perfect. Even if it's the first encounter between teen virgins, they\nalways feel each other's bodies perfectly, they're so in synchrony, every touch\nhas to send a thousand electric volts through their flesh…",
  "data/reddit-books/r/books/comments/oxy1c1/main_characters_arent_often_peoples_favorite.json": "I remember reading a post where they said that “Harry Potter is no one’s\nfavorite character in Harry Potter”, and although funny, it made me think. Which\nmain characters are actually the best to me?\n\nThe only one that currently comes to mind is Percy from Percy Jackson. And Billy\nfrom Where the Red…",
  "data/reddit-books/r/books/comments/oy4v04/what_is_a_book_you_had_really_low_expectations.json": "We all know those books: the ones that you HAVE to read because of school, or\nthe ones that you pick up on an absolute whim without knowing much about. The\nones we don’t really expect much for. However, once you start getting into them,\nyou realize that they’ve far surpassed any expectation you had…",
  "data/reddit-books/r/books/comments/oy74p9/just_finished_reading_the_shining.json": "I have never had a book scare me like this before. I love horror movies/books\nand am not easily frightened, but holy this book has really given me the\nheeby-jeebies!\n\nI find myself turning on every light and hesitating to draw back my shower\ncurtain as if I’m gonna see a dead body in my tub!\n\nI’m…",
  "data/reddit-books/r/books/comments/oy7tdi/just_finished_reading_lord_of_the_flies_and_after.json": "Once I finish reading a book I tend to search around to read reviews or watch\nvideos about it just so that I can let the story sink in. After reading Lord of\nthe flies, I did just this.\n\n[spoiler warning]\n\nA lot of the reviews (negative ones) mention that this story is unrealistic in\nthe sense that…",
  "data/reddit-books/r/books/comments/oy9ycp/just_finished_the_green_mile_and_dang_that_last.json": "“We each owe a death, there are no exceptions, I know that, but sometimes, oh\nGod, the Green Mile is so long.”\n\nI think that last line of the book is my favorite final line I’ve ever read.\nLike HOLY CRAP. Wouldn’t even say the book was my favorite ever, although I did\nenjoy. But man that last line…",
  "data/reddit-books/r/books/comments/oycx4x/have_you_ever_read_a_book_that_is_so_good_you.json": "The feeling of being so immersed in a book is one of my favourite things. I've\nalmost finished Starsight by Brandon Sanderson and I just can't. I'm not ready\nto say goodbye to the characters or the world yet and the closer I get to the\nend the less I want to carry on! (I have pre-ordered book…",
  "data/reddit-books/r/books/comments/oyfdcv/just_finished_reading_middlemarch_by_george_eliot.json": "This was my first 900 page+ book and holy hell it felt like I was taken on a\njourney with the characters on each page of the book.\n\nIt was fascinating to witness the plot unravel, I felt great satisfaction with\nthe outcome of some of the events as a reader.\n\nEliot’s social commentary is sometimes so…",
  "data/reddit-books/r/books/comments/oyh1vo/the_mistborn_trilogy_by_brandon_sanderson.json": "I finished the first trilogy and was blown away by the ending. Branderson is a\nlegendary world builder. What I loved the most about the books (other than the\nstory itself) was the magic system. It was almost scientific with all the rules\ncarefully given to us throughout all the books. The epigraphs…",
  "data/reddit-books/r/books/comments/oyi0od/how_many_of_you_make_a_conscious_effort_to_read.json": "I ask because this year is the first time I've attempted the 52 book challenge\nand I've found that because I'm tracking my reading, I'm paying closer attention\nto the backgrounds of the various authors whose work I'm engaging with.\n\nI recently reached 59 books (over-achieving!) and decided to go…",
  "data/reddit-books/r/books/comments/oykgo1/whats_it_like_to_read.json": "I'm really sorry, I know it's a stupid question. I don't enjoy reading..\n\nI have aphantasia.\n\nI'm on my phone so sorry about the formatting. Until recently I thought things\nlike \"a book taking you away\" was just a figure of speech.\n\nMy partner and I enjoy sharing weird facts with eachother when ever…",
  "data/reddit-books/r/books/comments/oynbhr/what_ruins_a_book_for_you_for_me_i_hate_it_when.json": "Nothing ruins the twist more in a book than someone telling me it has one. Now\nthat I know it has one I’ll spend the entire time thinking about it and trying\nto figure it out. If I figure it out correctly it has less of an impact and\nmakes me appreciate it less.\n\nWhat other things about books do you…",
  "data/reddit-books/r/books/comments/oyzpe3/finished_the_god_of_small_things.json": "So, last month I read this book and I am in awe of Roy's writing. Her writing is\nso beautiful and expressive, and I'm short of words to explain how I loved the\nlittle metaphors spread across the book.\n\nThe world of Estha and Rahel is so beautifully woven Also, why this book hits\nhome, is because of…",
  "data/reddit-books/r/books/comments/oz3xcw/station_eleven_what_an_extraordinary_book_and.json": "I read Emily St. John Mandel's Station Eleven yesterday. Could not put it down.\nCried about a dozen times.\n\nFor context, I've been in iso on and off since March 2020. I was a student at a\nforeign university before Covid hit, and I had to leave it all behind and come\nhome. I've mostly been alone…",
  "data/reddit-books/r/books/comments/oz9fbr/how_do_people_read_a_300_page_book_in_one_day.json": "Even if you had a day off from work, I can't see how some people have the mental\nstamina to read 100k words in a day. I remember hearing teenagers in 2007\ngetting The Deathly Hallows opening day and reading until midnight. Unlike TV\nshows where it's more of a passive medium to absorb, reading…",
  "data/reddit-books/r/books/comments/oz9ss2/im_science_fiction_author_kb_wagers_ask_me.json": "Hi all! I'm K.B. Wagers, non-binary author of the Indranan and Farian War\ntrilogies from Orbit Books and the NeoG Adventures from Harper Voyager -\nincluding the recently released Hold Fast Through the Fire. I write about the\nNear-Earth Orbital Guard's Interceptor teams as they patrol the space in…",
  "data/reddit-books/r/books/comments/ozeqqa/finally_finished_dune_book_one.json": "And boy was it a journey. I decided to pick up this bad boy after the movie\nannouncement because I thought it already looked great. In reality, it was on my\nlist forever having read about how prolific a novel it is and I was not\ndisappointed! Not only did it feel like an insane achievement to read…",
  "data/reddit-books/r/books/comments/ozgs4v/how_to_tell_the_difference_between_a_competent.json": "How do I do it? It feels like every time I read a book featuring a strong,\ninteresting female protagonist, there’s always a million reviews calling her a\nMary Sue. Wikipedia tells me a Mary Sue is “unrealistically free of weaknesses,”\nbut I have trouble understanding how big a weakness has to be…",
  "data/reddit-books/r/books/comments/ozir8q/longest_book_youve_ever_read.json": "What’s the longest book you’ve ever read? Stand-alone, not in a series. How many\npages was it? I feel like on average the books I read are 300-400 pages long. To\nbe quiet honest I think one of the longest books I’ve ever read was one from HP.\nAre longer books preferred? Is there such thing as a book…",
  "data/reddit-books/r/books/comments/ozolup/what_novel_is_extremely_comprehensive_of_the.json": "also: one that is rich in psychology and philosophy.\n\ninb4 someone rebukes that the human condition doesn't exist. I can't give a\nprecise definition of it but there's some vague family resemblance cluster of\nqualities in \"the human condition\" that we all know of. And novels obviously CAN\nbe more…",
  "data/reddit-books/r/books/comments/ozp523/just_finished_the_ones_who_walk_away_from_omelas.json": "I heard the premise and decided to pick it up because I was intrigued. And I\nabsolutely loved the book! The writing is brilliant. My layman interpretation of\nthe work was that it could mean that there is no ethical consumption in a\ncapitalist society.\n\nThis is the first time I'm reading her work,…",
  "data/reddit-books/r/books/comments/ozt02w/in_praise_of_john_irving.json": "I know he is often (rightly or wrongly) lambasted as ‘airport fiction’ or\nwhatnot, but I’ve just started The Cider House Rules by John Irving this morning\nand I really do think he is one of the most truly joyful writers to read - at\nleast in his earlier work.\n\nThe World According To Garp is…",
  "data/reddit-books/r/books/comments/ozwr24/is_it_just_me_or_is_100_years_of_solitude_hard_to.json": "Reddit seems to be unanimously excited about Gabriel Garcia Marquez’ 100 years\nof solitude, which is why I bought it and started reading it, but I’m not so\nsure yet. The timeline is complicated, family tree is hard to follow (with all\nthe same names) and the lack of dialogues make it difficult to…",
  "data/reddit-books/r/books/comments/ozyfj4/every_year_4chan_ranks_their_100_best_books_of.json": "This took like 30-40 hours of mind-numbing grunt work, so I really hope some of\nyou enjoy it. It's a really rather interesting list, and it's always fascinated\nme how despite 4chan's reputation, whenever their book lists come out each year\nthey are always relatively respected and spark meaningful…",
  "data/reddit-books/r/books/comments/p03puf/does_anybody_else_who_loves_to_read_sometimes.json": "I love to read but I recently realized that sometimes I avoid reading because it\nscrews up my sleep. Not just staying up late to read “one more chapter,” but\nalso not being able to fall asleep because I’m thinking about the plot or\ncharacters, and all my dreams seem be vividly related to whatever…",
  "data/reddit-books/r/books/comments/p04pt9/finally_finished_reading_the_divine_comedy.json": "Been reading the book during my lunch breaks at work over the past couple years,\nfinally finished it now. Truly a beautiful book, one of the few books to make me\nfeel, see and even hear everything within the book. It feels like the journey\nDante undertakes is one that the reader takes himself. The…",
  "data/reddit-books/r/books/comments/p0atw5/how_much_do_you_read_each_day_and_when.json": "Alot of articles say to read for 30 minutes a day or maybe an hour a day or a\ncertain amount of pages ... Maybe before bed or in the morning ,etc...\n\nBut when do you read each day and how much do you read. Whether it's in time or\npages it doesn't matter! Just wondering what your habits and routines…",
  "data/reddit-books/r/books/comments/p0b61e/milk_and_honey_is_absolute_trash.json": "Milk and Honey is the worst thing I have ever read.\n\nAm I missing something? Am I too stupid to comprehend? Do I not understand\npoetry?\n\nIt's litterally just fragmented sentences.\n\n\"I was hungry.\"\n\n\"I opened the fridge.\"\n\n\"It was empty.\"\n\n\"I am strong.\"\n\nI must say though I am not the biggest fan of…",
  "data/reddit-books/r/books/comments/p0fs4w/do_you_look_at_a_books_ratings_in_goodreads_first.json": "I don't know if it's just me but I have prejudices over books that are rated\nlower than 4 in Goodreads. I tend to be wary of picking up books that do not\nhave an average rating of at least 4. I know the high rating does not really\ndetermine my enjoyment with the book. I have read books that have…",
  "data/reddit-books/r/books/comments/p0ggpb/why_are_book_clubs_mostly_women.json": "I went to a book club yesterday as the only guy. It was fun. We talked about the\nbook and the pros and cons of the book and it was what I wanted. It just felt\nodd that the stereotype of a book club, that's its dominated by women members\ncame to be true. I know men read, but I have no idea why the…",
  "data/reddit-books/r/books/comments/p0gy6q/tribute_to_the_local_bookseller_of_my_childhood.json": "We all have those special bookstores, I hope. The ones from before Amazon\nwrecked them all. I'm not a Luddite, but I do have a soft spot for a place where\nyou can come in browse for hours.Maybe even sit and read. Enough preamble;\nhere's my favorite.\n\nWhen I was 12 or 13, around 1995 or 1996, a new…",
  "data/reddit-books/r/books/comments/p0j384/why_is_the_bible_often_considered_a_well_written.json": "Full disclosure, I've never read the bible cover to cover. But I do work at a\nChristian summer camp and have for the past 7 years. We do daily bible lessons\nand will often read several passages a day.\n\nThis year I decided to pay a little more attention to the actual writing and\ntranslation and I…",
  "data/reddit-books/r/books/comments/p0jyaj/whats_the_worst_book_that_youve_read_that_you.json": "I’ll start. I recently read Ruby’s Palace by Kerry Barnes. It’s actually the\nsecond part of a trilogy (I didn’t know this before I started reading) about a\nfearsome family of east end gangsters that are trying to go straight. It’s\npoorly written, characters are introduced and built up only to…",
  "data/reddit-books/r/books/comments/p0mnjx/i_am_not_feeling_catch_22.json": "I am at page 100 and am simply not getting this book. Its just not coherent\nenough for me to enjoy it. The author jumps from thing to thing and honestly I\ndon't know what's going on half the time. I know that this book is\nnon-chronologically narrated but I still feel that its too confusing. And…",
  "data/reddit-books/r/books/comments/p0qlkg/reading_my_deceased_grandmas_favorite_book.json": "My grandma passed away on Thursday after a lengthy battle with Alzheimer's. I\nmiss her terribly because she and I were so close. When they announced she\ndidn't have long to live, I got the idea to buy her favorite book, Tom Sawyer,\nand try to read it to her. I had never read the book before, but…",
  "data/reddit-books/r/books/comments/p0sbvv/where_am_i_meant_to_put_my_bible_on_my.json": "So, recently I was gifted my first bible. I am not Christian, nor did I grow up\nin a Christian household, so I am not aware where you're meant to keep a bible,\nbut I wish to put it on my bookshelf.\n\nReceiving this gift has made me wonder, where exactly am I meant to place a\nbible on a bookshelf?…",
  "data/reddit-books/r/books/comments/p0uxbk/how_many_depressed_english_professor_novels_are.json": "“Bad books on writing tell you to \"WRITE WHAT YOU KNOW\", a solemn and totally\nfalse adage that is the reason there exist so many mediocre novels about English\nprofessors contemplating adultery.” - Joe Haldeman\n\nI mean, don't get me wrong, it's a great quote, but how many novels do you know\nof that…",
  "data/reddit-books/r/books/comments/p0wcwe/unpopular_opinion_where_the_crawdads_sing_is.json": "I heard a lot of hype around the book and decided to read it this summer for\nfun. I thought that it was super overrated. First off, I thought that the climax\nof the book was all around underwhelming. Specifically, I thought that the trial\nand murder of Chase Andrews was too predictable which…",
  "data/reddit-books/r/books/comments/p0x2tg/does_anyone_actually_like_dust_covers_on.json": "Every time I find myself reading a hardcover book that has a dust cover/jacket,\nI always take it off until I'm done with the book. On most, if not all,\nhardcover books, the addition of a dust jacket just seems pointless.\n\nSure, they can be used as a built in bookmark, and contain the blurb…",
  "data/reddit-books/r/books/comments/p0xkyz/the_god_of_small_things_is_the_most_miserable.json": "I dont even know why I have such an absolute visceral feeling of disgust towards\nthe book.\n\nIt's not even cause it's depressing because depressing shit is my bread and\nbutter.\n\nIs it cause its akin to trauma porn?\n\nI think it's because everyone in the book is absolutely miserable and no one\ntakes…",
  "data/reddit-books/r/books/comments/p0zfp4/just_finished_anne_frank_the_diary_of_a_young_girl.json": "The Definitive Edition.\n\nAs a kid, I knew about her, and learned about the Holocaust.\n\nNow, I’m 30. I was able to finally get to purchase and read this book. I did\nread this book a little in school, but never an edition such as this, as well,\nnow with much understanding.\n\nI just finished it after…",
  "data/reddit-books/r/books/comments/p154r5/just_finished_herberts_dune_what_a_captivating.json": "I have just finished Herbert's Dune, and what a captivating story it was!\n\nA TV show based on Asimov's Foundation and a movie based on Herbert's Dune both\ncome out this fall, so I figured I should read the books first — I used to read\na lot of sci-fi as a kid, but somehow missed these two series. I…",
  "data/reddit-books/r/books/comments/p16r19/happy_national_book_lovers_day.json": "Reading has always been a significant part of my life, my parents instilled a\nlove of the written word by encouraging me to read on my own, reading to me and\nmy siblings each night, helping us pick out books at Scholastic Book Fairs & my\nlocal Library, helping us track books we read each summer to…",
  "data/reddit-books/r/books/comments/p1d7ak/why_do_people_say_its_a_red_flag_if_someones.json": "I just finished reading it and the book was pretty fine imo. Yes the narrator is\na bit annoying at times and can come off as arrogant. But even if you say that\nHolden Caulfield is your favorite main character I don’t see how that’s a\nproblem. He really exemplified the type of character he was…",
  "data/reddit-books/r/books/comments/p1d8ya/i_see_a_lot_of_discussion_on_taking_care_of_books.json": "I'm continuously hearing people discussing babying their libraries, replacing\ndust jackets, and generally treating books like sacred art as if they weren't\njust purchased online for $11.99.\n\nI don't intentionally damage them, but put literally zero effort in keeping them\nperfect. It's paper; it's…",
  "data/reddit-books/r/books/comments/p1e0c4/spoiler_involved_i_finished_reading_frankenstein.json": "I expected the novel to be horrifying. I expected a brutal, evil, apathetic\nmonster. But the 'monster' turned into a 'creature' in my head, implying the\nimpact of the words or adjectives we use and assign to other people, and the\nsignificance of parenting. I cried several times because of this…",
  "data/reddit-books/r/books/comments/p1lqpf/is_the_whole_dune_series_worth_reading.json": "Hello guys, I'm planning to get my self some Dune books to try out the Sci-fi\ngenre. But I've been wondering if the whole Dune series worth reading because I\nhave heard many different opinions about this series. Some says Dune is great as\na stand alone, some says the last 3 is not really worth it…",
  "data/reddit-books/r/books/comments/p1nyqj/has_anybody_else_been_mentally_stuck_inside_the.json": "I've been powering through a lovely dense fantasy series as of late, and I'm\nabout three books and 2000 pages in. I want to take a little break due to the\nmental effort of making it this far, but any time I crack open another book I\nfind myself disinterested within 10 pages and unable to disentangle…",
  "data/reddit-books/r/books/comments/p1pzz9/whats_the_one_book_youve_tried_to_read_many_times.json": "For me, it's House of Leaves by Mark Z. Danielewski. It's a big book; dense,\nwith lots of interesting formatting. I make it through the first 30 or so pages\nbefore I either give up or start on something else or 'backburner' it for\nanother day. I must have read those first pages a dozen times. It was…",
  "data/reddit-books/r/books/comments/p1rm28/why_do_so_many_people_think_dan_brown_books_are.json": "To start, I'm actually trying to make this a learning experience for me.\n\nI'm a huge movie critic and only can name a few which I think are extremely well\ndone.\n\nAs far as books, I'm not as big a reader, but I did read Angels and Demons and\nThe Da Vinci Code and I really enjoyed them.\n\nWhat is it…",
  "data/reddit-books/r/books/comments/p1sohf/the_perks_of_being_a_wallflower_is_catcher_in_the.json": "I noticed several posts about Catcher in the Rye lately, so I thought I'd chip\nin my two cents.\n\nI read Catcher in eleventh grade around 2010, and I honestly didn't get why it\nwas considered good. At all. I found it to be an exhausting slog with an awful\nPOV character that didn't make any sense.…",
  "data/reddit-books/r/books/comments/p1v9nk/ive_been_rereading_the_culture_series_by_iain_m.json": "They are genre fiction, which is often looked down on, but they are far more\nliterary than most pew pew scifi.\n\nThe characters are fleshed out and compelling, the style is creative, there's\nusually a twist ending, the society envisioned is aspirational. And it still\nmanages to have exciting action…",
  "data/reddit-books/r/books/comments/p1vywm/what_was_your_biggest_letdown_of_a_book.json": "Either due to recommendation hype or it coming from a favorite author or\nanything else, what book were you really looking forward to that ended up being\na big fat disappointment?\n\nFor me, the most recent one is Malice by John Gwyne. I'd heard it was an amazing\nsubversion of tropes, that he wrote…",
  "data/reddit-books/r/books/comments/p1wyfp/the_character_sarah_harding_in_michael_crichton_s.json": "Sarah Harding from Michael Chriton’s the Lost World is one of the best and most\nhardcore protagonists out there.\n\nThere is a part where she pre-meditatedly murders a man with a Tyrannosaurus rex\nvia Indian leg-wrestling. (He did try to kill her earlier, so there was\nhistory).\n\nAlso when she’s trying…",
  "data/reddit-books/r/books/comments/p22amd/midnight_library_by_matt_haig_and_the_fundamental.json": "I finished Midnight Library by Matt Haig today, released in August 2020. Not\nlong into the book I discovered a major flaw with the execution of the book's\npremise. To sum up, the protagonist of the book wakes up and is trapped in an\notherworldly library, where she can choose from an infinite number…",
  "data/reddit-books/r/books/comments/p2awbn/i_just_reread_alex_garlands_the_beach_and_it_was.json": "I first read The Beach when I was about 20 and, like the protagonist, was doing\nlots of traveling and backpacking. When I read it the first time I thought\nRichard was a really cool, intelligent and interesting dude who just went a bit\nbonkers. I'm 32 mow and I've reread the book or the first time…",
  "data/reddit-books/r/books/comments/p2cx5h/there_is_no_such_thing_as_forced_diversity_there.json": "Just to be frank, it really annoys me so much when people complain about forced\ndiversity or, having diversity forced down our throats, or trying to find a\nreason to \"justify\" the diversity in whatever book they are reading. Like your\nfavorite book is litterally set in a world with dragons, magic,…",
  "data/reddit-books/r/books/comments/p2dmve/what_is_your_favorite_example_of_world_building.json": "For me it has to be from ASOIAF. A continent that would otherwise be\nunconquerable was taken over by dragons. However, the dragons died off and from\nthen on the kings had to keep their realm together through political\narrangements. Plotlines nearly a century in the making are coming to a head…",
  "data/reddit-books/r/books/comments/p2elo1/weir_and_crichton.json": "I've been a fan of Michael Crichton's books for many years; the aspect I\nappreciate most about much of his work is that it's kind of sci-fi but heavier\non the \"sci\" than the \"fi\". I've been trying to find other authors that scratch\nthat same itch and have mostly fallen short. A couple of years ago I…",
  "data/reddit-books/r/books/comments/p2fmzr/ive_been_reading_brandon_sandersons_stormlight.json": "So I've been trying to acquaint myself more with the fantasy genre as I'm not\nsuper well-read on it. Have read a few new ones that I really loved (Realm of\nthe Elderlings, Book of the New Sun, The First Law, Discworld) and some that I\ndisliked (Wheel of Time). I've also gone through a lot of the…",
  "data/reddit-books/r/books/comments/p2hkas/i_no_longer_find_it_easy_to_grasp_what_i_am.json": "For some reason, it feels as though each time I try to read, my brain is\nbrimming with fog. I feel that I do not take my time to thoroughly understand a\nbook, I am not sure why.\n\nThis is ironic, since I am planning on majoring in English Literature. It should\nbe easy, but it isn’t. I struggle…",
  "data/reddit-books/r/books/comments/p2l9vh/what_book_had_an_excellent_premise_but_completely.json": "I just finished Death with Interruptions by José Saramago.\n\nThe premise: What if one day everyone stopped dying?\n\nThe execution: Read like a dry philosophy book that I didn't find interesting or\nengaging.\n\nGot any good examples of something that sounded fantastic as a concept but ended\nup being…",
  "data/reddit-books/r/books/comments/p2sn74/robert_mccammons_swan_song_is_one_of_the_best_i.json": "During the quarantine of 2020, I did not read a single book. Or one that I can\nremember.\n\nThis, of course, was bad. Spending all of your time on social media, especially\na website like Twitter, will erode your mental health like spending your free\ntime in a radioactive crater. Eventually, you will…",
  "data/reddit-books/r/books/comments/p2wskg/very_brief_chaotic_thoughts_on_the_grapes_of.json": "I apologize in advance for the format of this post - I wrote it after finishing\nthe book at about midnight, and couldn’t be bothered to write formally. Now on\nto my thoughts…\n\nWhat an amazing book. Almost ripped my heart to shreds. Doubtlessly one of the\nmost difficult, heavy yet beautiful books…",
  "data/reddit-books/r/books/comments/p2y4er/tried_to_support_my_local_bookshop_had_to_wait_11.json": "There's only 1 bookshop in my town (small town in Spain) and they're always\npromoting in Facebook that we have to shop locally and support them.\n\nI tried to do so by ordering a just released book from them. I had to pay\nupfront and noticed the book was 5€ more expensive than in Amazon.\n\nThey told me…",
  "data/reddit-books/r/books/comments/p34mto/upton_sinclairs_the_jungle_was_not_about_meat.json": "Just finished reading and I have to be honest. It was not an easy book for me to\nread. I never thought about reading it before because in history class they give\nyou a raw summation of it's contents. It is used as a reason why Theodore\nRosevelt created the FDA, this is in American schooling. My…",
  "data/reddit-books/r/books/comments/p35hik/who_is_your_favorite_author_of_your_country.json": "As with most of Reddit, the sub is filled with english speaking authors but I\nbelieve authors in other countries might not get the recognition they deserve.\nFor example, Colombia's Garcia Marquez has one of the most amazing stories ever\nwritten in spanish. In my country, Huasipungo by Jorge Ycaza, a…",
  "data/reddit-books/r/books/comments/p3ho45/godfather_is_one_of_the_most_fantastic_books_i.json": "I’ll start by saying that I haven’t seen the movie. Most of what I knew prior to\nthe book was pop culture references. Unfortunate that was my introduction to the\nbook and, upon reading it, how much misconception I was given about. Especially\nwhen it came to The Godfather himself, Don Corleone.\n\nThis…",
  "data/reddit-books/r/books/comments/p3jfjl/just_finished_stardust_by_neil_gaiman_spoilers.json": "So I ended up picking up Stardust by Neil Gaiman yesterday since I love the\nmovie so much and wow.... I don't think I've finished a book that fast in\nforever lol! To be fair it wasn't a very long book, but I seriously couldn't put\nit down all day today.\n\nIt just had such a fantasic whimsical vibe,…",
  "data/reddit-books/r/books/comments/p3kb0x/reading_shouldnt_be_a_marathon.json": "Okay, this sounds controversial but hear me out. Recently I've seen a surge in\ntrends like '100 books a year' or '10 books a months' I don't know if it been\nthis way since a long time or just recently but all I know is it's tiring. As a\nnon native English speaker and a student it's difficult to keep…",
  "data/reddit-books/r/books/comments/p3p0o8/if_a_plan_is_mentioned_that_plan_will_fail.json": "I want to be clear that I understand the goal of many writers is to subvert\nexpectations and surprise their audience. But lately, I can't help but notice\nthis trend across books, TV, and movies. If a character explains or mentions\ntheir plans, either outwardly to other characters or expressed as…",
  "data/reddit-books/r/books/comments/p3p5oy/finished_the_man_in_the_high_castle_by_philip_k.json": "Winner of the Hugo Award in 1963 (the only K. Dick book that won an Hugo Award).\nI never got disappointed by Philip K. Dick book, and so not by this one. Germany\n& Japan have won World War II and the world is now in total fascism. North\nAmerica is split between Japan & Germany and there is kind of…",
  "data/reddit-books/r/books/comments/p3qf2m/why_isnt_we_well_regarded_like_bnw_and_1984.json": "So I just finished reading 'We' and was curious why it doesn't seem as well\nregarded as 'Brave New World', '1984', or other dystopian novels. The ending hit\nme like a brick, and the prose throughout does an excellent job of conveying\nD-503's thoughts and emotions as they change. The last chapter as…",
  "data/reddit-books/r/books/comments/p3v6zg/what_was_the_first_book_to_make_you_cry.json": "Kinda a weird question but I'm just thinking about the books I've read, which as\na dyslexic who was never terribly invested in books isn't many but I'm getting\nback into them now. But I'm just thinking there's only been one book in my life\nas far as I can remember I cried at which was Kensuke's…",
  "data/reddit-books/r/books/comments/p3v943/death_of_the_author_is_a_literary_analysis.json": "Lately, I have most often seen \"Death of the Author\" used synonymously with\nplatitudes like \"you gotta separate the artist from the art\", thrown around in\nculture war nonsense, on the defensive side of whether this or that book is\n\"problematic\".\n\nWhich is a shame, because the original literary…",
  "data/reddit-books/r/books/comments/p3vj6w/just_finished_reading_the_screwtape_letters_by_cs.json": "I started out with the intent of highlight and marking good quotes and after the\nfirst ten pages I had to stop because I realised I was essentially just\ncolouring the book in. Every page was gold and it moved me to tears multiple\ntimes. It has changed my outlook on the world and I’ve never been…",
  "data/reddit-books/r/books/comments/p3ysak/first_time_readthrough_of_a_hitchhikers_guide_to.json": "- Finished Hitchhiker's Guide a day or two ago, book one at that, and have had a\nchance to mull it over. Obviously, I've seen it on tons of \"Best Books\" lists\nand had it recommended to me several times. I knew going in it was a bit\nslapstick and whimsical, and it was fantastically so. But, somehow,…",
  "data/reddit-books/r/books/comments/p4658t/unpopular_opinion_reading_a_book_in_one_sitting.json": "Unpopular opinion: reading a book in one sitting is not necessarily a sign of\nits quality. It can simply mean that an author is very good at establishing and\nmainting tension. Sometimes such books heavily prioritise destination over\njourney and have weaker characters. The re-readability might also…",
  "data/reddit-books/r/books/comments/p48gli/just_finished_re_reading_fear_and_loathing_in_las.json": "Reminds me of what a hell of a writer Hunter s Thompson was.\n\n“No sympathy for the devil; keep that in mind. Buy the ticket, take the\nride...and if it occasionally gets a little heavier than what you had in mind,\nwell...maybe chalk it up to forced consciousness expansion: Tune in, freak out,\nget…",
  "data/reddit-books/r/books/comments/p4a3j7/an_unexpected_amazing_surprise.json": "I really just wanted to share this with other book lovers because most people in\nmy life wouldn’t understand the significance and joy of the following:\n\nSince Carlos Ruiz Zafón’s death last summer, I’ve been collecting his\nbibliography (seven published works and one posthumous release scheduled…",
  "data/reddit-books/r/books/comments/p4a8rw/i_thought_everyone_was_lying_to_me_about_the.json": "I would like to formally apologize to Alexandre Dumas for underestimating him. I\nlooked at the date and length and thought it would be boring, and I even made\nsure to download a few other books before I started reading it on the assumption\nthat I would need a break during the tedious parts.\n\nThere??…",
  "data/reddit-books/r/books/comments/p4c68i/which_is_the_book_that_made_you_fall_in_love_with.json": "I've realized that the first book you really like from a particular genre ends\nup being really formative and influences what you later like, dislike and look\nfor the other books from the genre. Shirley Jacksons haunting of hill house and\nthe lottery made me fall in love with reading horror and I…",
  "data/reddit-books/r/books/comments/p4jws7/my_journey_from_tv_addict_to_book_enthusiast.json": "I grew up in a household that always had the tv on and it was natural for the tv\nto be on all night every night. Books didn’t feature much in my childhood except\nfor goosebumps and Harry Potter.\n\nWhen I moved into a place of my own with my wife we to would have the tv on when\nwe were at home unless…",
  "data/reddit-books/r/books/comments/p4m2pe/do_you_have_a_favorite_place_to_read_in_public.json": "I recently discovered my public reading spot.\n\nIt's a small cafe tucked away on a side street of my equally small Appalachian\ntown in Virginia. Rather, it's a courtyard with a metal table and lawn chairs\nadjacent to the cafe, shaded by a bradford pear tree at all times of day. I can\nsit at the…",
  "data/reddit-books/r/books/comments/p4mku0/i_just_finished_rereading_the_animorphs_and.json": "Seriously, kids fantasy books about fighting aliens with your cool animal\npowers, and it's 63 books of emotional termoil, ptsd, depression, torture, the\nhorrors of war and everyone is a bastard.\n\nThere's even one book were Rachel (who is 13 at the time) straight up nearly\ngets raped, and Marco is…",
  "data/reddit-books/r/books/comments/p4s6hy/reading_has_become_my_favorite_hobby.json": "I'm 17. In the last year I picked up reading again with books like The Haunting\nOf Hill House, Dune and Ender's Game. And I love it. I've been reading for at\nleast 1 hour every 4 out of 7 days. And in the last 4 days, since I have a few\nholidays, I've reading for about 3-5 hours a day. At first I…",
  "data/reddit-books/r/books/comments/p4sd9i/thoughts_on_giving_up_on_a_book.json": "I'm usually the type to finish something once I have started it but I'm\ncurrently considering giving up on American Psycho - for reference I'm only 30\npages in.\n\nReally thought it would stick with my personal taste but it feels like a chore\nto read and I'm a bit disappointed in myself. Perhaps I…",
  "data/reddit-books/r/books/comments/p4tch1/i_thought_you_were_lying_about_agatha_christie.json": "So, I recently started taking reading seriously, after three years of not\ntouching a book. I got a list of recommendations from r/booksuggestions\n[/r/booksuggestions] and r/suggestmeabook [/r/suggestmeabook] but even I knew I\nwould not be able to get back into reading that quickly.\n\nSeriously, it…",
  "data/reddit-books/r/books/comments/p4tmh5/i_started_reading_the_great_gatsby_and_i_find_it.json": "I started reading it and finished the first chapter. But it takes a lot of time\nto even understand a single line. Is its supposed to be like that or I am just\ndumb? With this speed it is gonna take me a long time to finish this book which\nis rather short. The lines feel poetic and deeper than usual…",
  "data/reddit-books/r/books/comments/p4w5az/just_finished_where_the_crawdads_sing.json": "I know I'm late to the discussion, this book was given to me as a gift a year\nand a half ago and has always taken a backseat to life. Finally decided it was\njust time to read it and I have to say it was awful. A day and a half of reading\nI wish I had spent on another book since I do have such…",
  "data/reddit-books/r/books/comments/p4zgvi/what_is_the_worst_book_youve_ever_read_and_why.json": "People come on here all the time to talk about fantastic books and to give some\ngreat advice on what to read, but what is the worst you’ve ever read.\n\nMine is Age of Iron by JM Coetzee. It’s supposed to be a great book by an award\nwinning author, but honestly I hated every second of it. The writing…",
  "data/reddit-books/r/books/comments/p59orc/what_book_did_you_not_get_until_you_were_older.json": "I'm curious to hear what book, if any, you didn't understand/appreciate/enjoy\nuntil you were older (or until you reread it).\n\nFor me, I read 'Carol' when I was 16 when the movie was first announced and\nthought it was just boring and whiney. I read it again when I turned 19 (the\nsame age as the main…",
  "data/reddit-books/r/books/comments/p59vr3/book_app_the_will_make_you_cancel_your_audible.json": "Hey guys just wanna share this app called Libby its a very cool app and only\nrequires a library card (you can make one online) it has a great collection of\nbooks and audiobooks you can listen/read the books by your favorite author and\nits all free and if the book is not available you can put it on…",
  "data/reddit-books/r/books/comments/p5a53v/i_hate_mukarami_and_dont_understand_the_hype.json": "I don't understand the amount of infatuation of readers with Mukarami at all. I\nhave read about 5 books of Mukarami. All of his books are the same: it's like\nsomeone keeps retelling you their dreams which don't make sense at all but with\nthe same themes in each one. These books sure feel mystical,…",
  "data/reddit-books/r/books/comments/p5cobn/books_to_help_understand_whats_happening_in.json": "Edit 2: Holy hell, this is not a request for books to help understand. It's my\npush for a great book to others!\n\nEdit: This is a recommendation, not a request. I cannot edit the title of the\npost, but it’s been pointed out that the title looks like a request while\nobviously the post is a…",
  "data/reddit-books/r/books/comments/p5e974/has_any_book_ruined_you.json": "I used to be an ardent reader. I used to always be in the middle of some book,\nfinishing at least one a month. I loved reading. Then I read \"Half of a yellow\nsun\" by Chimamanda. And it broke me.\n\nI've never been so emotionally wrung out by a book before. I cried. I was\nexhausted when I finished it.…",
  "data/reddit-books/r/books/comments/p5eaqo/man_dune_is_freaking_stressful.json": "I'm reading Dune and sometimes I have to stop for awhile because the\ninteractions between characters give me anxiety.\n\nEvery conversation is a battle, every meeting is like scouting out a new enemy.\nThe characters analyze every movement, word and intonation. It's impressive and\nfascinating but the…",
  "data/reddit-books/r/books/comments/p5jf63/i_just_finished_the_cemetery_of_forgotten_books.json": "I've seen many readers suggest the series on this sub so I gave it a try and I\nwas absolutely hooked! Carlos Ruiz Zafon was an incredible writer and I was so\nsad to see that he passed last year. My favorite of the series is probably The\nShadow of the Wind followed by The Angel's Game. I was so…",
  "data/reddit-books/r/books/comments/p5kst0/have_you_ever_felt_a_book_review_is_annoying_or.json": "I was reading the book \"a Man called Ove\" and I haven't finished it yet but it's\ninteresting so far and I love the build up. However, when buying it I saw a lot\nof reviews about it on amazon saying the book was inherently a racist and\nprejudiced book. I'm sorry if it offends anyone who agrees with…",
  "data/reddit-books/r/books/comments/p5mhgg/thinking_of_the_women_of_afghanistan_today_and.json": "Published in 2008, it tells the story of a woman who lived through the take-over\nof Afghanistan by the Taliban after the Soviet withdrawal. It's both a tragedy\nand a hero story, I think.\n\nAnybody else been thinking about it and what's going on in the news today? I\nfeel like the narrator of the book…",
  "data/reddit-books/r/books/comments/p5xyzw/after_not_reading_for_over_3_years_ive_finished_a.json": "I'm so proud of myself, and that's not something that usually happens. I read a\npost yesterday about someone reading Agatha Christie for the first time and how\nshe was so excited during the twists. So I thought, that's it! I immediately\nwent a bought \"And Then There Were None\".\n\nI'm obsessed\n\nI'm…",
  "data/reddit-books/r/books/comments/p5zfe1/what_is_your_all_time_favorite_book_quote.json": "I have started reading a lot more lately and have started to fall in love with\nit. There are so many beautiful quotes out there, I’d like to hear everyone’s\nfavorite. I am currently rereading The Kingkiller Chronicles by Patrick Rothfuss\nand these are my favorite quotes from them.\n\n“Bones mend.…",
  "data/reddit-books/r/books/comments/p65bgv/gillian_flynn.json": "I loved all three of her books and urge everyone to read them even if you aren’t\nparticularly into mysteries/thrillers. They have beautiful writing and extremely\ninteresting plots. She is my favorite author of the genre she does for sure and\nhaven’t really found anyone who lives up to her, in my…",
  "data/reddit-books/r/books/comments/p6axef/a_quick_thank_you_to_this_sub.json": "Like many of the users on here, i was pretty much a non reader for most of my\nlife. 3 years ago i came across this sub after a post reached r/all [/r/all]. I\nhad reached a point where i was tired of social media, but couldnt find a way to\nbreak free. After scrolling through a few posts, i found the…",
  "data/reddit-books/r/books/comments/p6gfqi/out_of_all_the_things_ive_thrown_away_in_life.json": "…I really wish I would have kept all the books.\n\nThey’re always the heaviest boxes to move. For me, they were the first thing\nthat went into the trash when I downsized in 2008. I regret throwing them away.\n\nI have hundreds of books once again. But I really miss all the books I threw\naway.\n\nI don’t…",
  "data/reddit-books/r/books/comments/p6i6si/i_just_read_the_time_travelers_wife_and_i_dont.json": "Spoiler alert.\n\nThere is a specific line that destroyed me, and every time I think about it, my\nheart aches. It's after Clare makes dinner for the first time and it's already\nbeen established that Henry is going to die. Alba & Henry are telling Clare how\ngood the meal is, when Clare & and Henry…",
  "data/reddit-books/r/books/comments/p6ldbw/journal_about_every_book_you_read.json": "Tonight on a flight across the US, I sat next to a wonderful older lady who was\nthe perfect amount of talkative, as far as strangers next to you on flights are\nconcerned. I asked her what her biggest regret was in life. She responded with…\n\n“Well I’m a librarian, and I’ve had the joy of reading many…",
  "data/reddit-books/r/books/comments/p6rtjg/mother_night_by_kurt_vonnegut.json": "I just finished Vonnegut's Mother Night and can't stop thinking about it. First,\nif you haven't read the book, I highly highly recommend it. Its a very quick\nread with short chapters. I don't want to give too much of the plot away because\nI went into it blind and really enjoyed reading the story…",
  "data/reddit-books/r/books/comments/p6wozu/cs_lewis_dedication_in_the_lion_the_witch_and_the.json": "\"My Dear Lucy,\n\nI wrote this story for you, but when I began it I had not realised that girls\ngrow quicker than books. As a result you are already too old for fairy tales,\nand by the time it is printed and bound you will be older still. But some day\nyou will be old enough to start reading fairy…",
  "data/reddit-books/r/books/comments/p77s26/i_recently_read_the_kite_runner.json": "I’m in high school and for my AP Lit reading, our teacher had us pick between\nthree books. I picked The Kite Runner by Khaled Hosseini. Essentially, it tells\nthe story about a young boy Amir, who lives in Kabul, Afghanistan. I decided to\nread it because the story seemed interesting and I also wanted…",
  "data/reddit-books/r/books/comments/p7adwm/roald_dahl.json": "Was he the original horror/thriller writer for children!? Adults!? I LOVED all\nthe books and stories as a kid but goddamn, they scared and intrigued the shit\noutta me. What a talent he had on portraying what unnerving, immoral, and also…\nhear me out… beautiful human life can be. The Omnibus of his…",
  "data/reddit-books/r/books/comments/p7eh3w/reading_too_deep_into_books.json": "I'm not a bookworm but I enjoy reading. One of the biggest problems that I face\nis trying to grasp the inner meaning or the underlying theme, parallels between\ncharacters or something that is not really spelled directly out in a book. The\nreason I believe is because I tend to think about whether the…",
  "data/reddit-books/r/books/comments/p7fobp/the_house_in_the_cerulean_sea.json": "My god. What a book. It’s about a man in a society where there are magical\ncreatures and they have registered. He goes around from orphanage to orphanage\nto check on children and make sure they are okay. He doesn’t have any family or\nfriends really and lives a humdrum life until he sent chosen to…",
  "data/reddit-books/r/books/comments/p7g5kl/the_situation_in_afghanistan_makes_me_think_about.json": "My mom showed me the film which stars Sally Fields when I was a kid but I didn’t\nreally remember the details of it. Then one day I was walking by a little free\nlibrary and saw the book and took it. That’s how I spent my lasik surgery\nrecovery at the beginning of 2019.\n\nIt’s a fantastic memoir about…",
  "data/reddit-books/r/books/comments/p7h4gj/construction_worker_tackling_a_top_100_list.json": "I have missed fiction. I have missed reading, and I have realized just how fast\nlife is ticking by with me having not experienced some of the greatest works of\nall time. Maybe it’s because I’m turning 30 this winter, who knows, but after\nseeing this…",
  "data/reddit-books/r/books/comments/p7hh10/and_then_there_were_none_by_agatha_christie.json": "I've been looking for a good mystery novel and I saw lots of people recommend\n\"And then there were none\" by the amazing Agatha Christie. I had never read\nanything of her works, but boy, did I love it! I admit I had a bit of a hard\ntime understanding some parts (since I'm not a native English…",
  "data/reddit-books/r/books/comments/p7l8oh/i_accidentally_ruined_a_library_book_what_do_i_do.json": "I'm not sure if this is the right place to post...\n\nAs the title says, without meaning to I've quite badly damaged a library book\nwithout realising. It was in the back of my car and water has got in through the\nwindow seals and made the book soaked. I tried to dry it out but the pages have\nturned to…",
  "data/reddit-books/r/books/comments/p7s660/rabbit_run_by_john_updike.json": "I had no idea what I was getting into with this book. I had been reading\n\"Moneyball\" by Michael Lewis, and at one point he mentioned that he wanted to\nwrite as well as John Updike.\n\nSeeing as how that book was about MLB, I got into my audible app, and chose the\nUpdike title that had a basketball on…",
  "data/reddit-books/r/books/comments/p7tw5h/i_need_to_talk_about_project_hail_mary.json": "I just finished Andy Weir's latest book, Project Hail Mary. Unfortunately, I\ndon't have any friends who have read it but I need to talk about it.\n\nIt's been awhile since I felt that kind of sad, empty feeling after reaching the\nend of a good book. I've been looking for something to get me hooked…",
  "data/reddit-books/r/books/comments/p7uing/the_long_way_to_a_small_angry_planet_by_becky.json": "Anybody read this? It came up on my Kindle and thought \"Eh, why not?\" Man, I\nenjoyed this. A multi-species crewed ship on a minor mission, trying to make it\ninto the big times. They take an ambitious job and have adventures along the\nway.\n\nI have no idea why this book affected me so much. I'm an old…",
  "data/reddit-books/r/books/comments/p7wngp/opinions_watching_the_movie_after_reading_the.json": "Reading first, watching second - YES PLEASE. I love watching movies. & I\nespecially love watching movies based on books that I enjoyed. It's a chance to\ncompare it to what I had imagined while reading. Knowing what happens doesn't\nbother me at all. In fact, it just makes me more interested in…",
  "data/reddit-books/r/books/comments/p81g0n/uglies_pretties_specials_and_extras_scott.json": "I've recently reread these four books and while I'm not the targeted audience\nfor this Young Adult series, I really enjoy them.\n\nThe books are around 300 pages each and pretty light reading. They introduce\nconcepts of \"What is free will?\", \"What is our place in the world?\", the value\nof friendship…",
  "data/reddit-books/r/books/comments/p83b8g/online_reviews_are_a_complete_mess_im_usually.json": "DISCLAIMER (because there's always that one person who doesn't understand): The\nfollowing is my very personal opinion/experience. I don't expect you to have a\nsimilar experience since it probably really depends on your personal taste. Your\npersonal taste isn't wrong, but neither is mine, so please…",
  "data/reddit-books/r/books/comments/p84ova/favorite_description_of_human_beings.json": "A lot of authors have witty ways to describe human beings. My favorite is from\nTerry Prattchett.\n\nSmall thinking bags of water, held upright by fragile accumulations of calcium,\nwho are enjoy breaking large rocks in to smaller pieces and then putting them\nback together in much more complex…",
  "data/reddit-books/r/books/comments/p852mv/what_are_some_things_that_annoy_you_about_your.json": "So I’ve only recently been getting back into reading and I’ve gone through about\n3 Stephen King books so far. I love how accessible he is. However, if I took a\nshot for how many times a character has to hold back laughter for something they\nthought to themselves or how often a female character is…",
  "data/reddit-books/r/books/comments/p8c56e/so_i_just_finished_flowers_in_the_attic.json": "I read this book expecting a fun horror/escape thriller. I guess it ticks some\nof those boxes (I wouldn’t call it fun), but not really in the cathartic way I\nassumed it would. I sort of want to hate this book, because it’s so disturbing,\nbut I can’t help but be impressed by it. I’m not sure that…",
  "data/reddit-books/r/books/comments/p8cmrk/help_i_inherited_a_ton_of_very_old_very_rare.json": "TW: profanity hahah. I’m at my wits end\n\nHi guys! Praying the modbots don’t shoot me down for being too new. I just\ninherited a TON of books from my late grandmother, and some of them are very\nrare and expensive. However, they come with a caveat- she was an insane pack\nrat. These books were full of…",
  "data/reddit-books/r/books/comments/p8gj6l/what_older_work_of_fiction_most_closely_forecast.json": "Reading Heinlein’s 1961 “Stranger in a Strange Land” now (for the first time—\ntag spoilers if you must!), and it has me thinking about many things including\nhow people of the past wrote about the future and future technology.\n\nCurious if anyone has read an older work of science fiction that…",
  "data/reddit-books/r/books/comments/p8lze3/is_there_anything_more_satisfying_than_dropping.json": "Whenever I finish a book I can’t wait to drop it off. If the book was really\ngood I’m excited for the next person who happens to grab it from the box. I also\nget excited about what books may be left for me. I know I could sell (or keep)\nthe books I’ve read but there’s something so satisfying about…",
  "data/reddit-books/r/books/comments/p8m8h1/my_favorite_moment_in_kingkiller_chronicles.json": "I love Name of the Wind and even really like the somewhat fairly maligned\nsequel. In fact, my favorite scene in the series and one of my all time favorite\nmoments in any book is in Wise Man's Fear. In chapter 7 Kvothe has been drugged\nmaking him emotionally unstable. This results in him hiding in…",
  "data/reddit-books/r/books/comments/p8obf4/read_shogun_by_james_clavell_after_seeing_it.json": "Loved the characters, most of all Toranaga. He kills it imo. Funny in a dry way,\nwitty, deep understanding of human nature and the politics and schemes of his\ntimes. Love how Clavell wrote that man. Based on the historic Tokugawa Ieyasu\n[https://en.wikipedia.org/wiki/Tokugawa_Ieyasu] I read.\n\nFound…",
  "data/reddit-books/r/books/comments/p8oiir/notes_from_a_retired_tiny_free_librarian.json": "(The library is tiny and free—not me.)\n\nAfter making up a proposal and presentation to the HOA, I got a Tiny Free\nLibrary [https://littlefreelibrary.org/] installed at my HOA park. In gratitude,\nI took it upon myself to become the “librarian” for the library. Here’s what\nthat meant to me:\n\n * Take…",
  "data/reddit-books/r/books/comments/p8ujqc/what_is_a_book_you_are_excited_to_read.json": "New or old! Doesn't matter. I am so very excited to read House Of Leaves but i\nunfortunately do not possess the funds to purchase the book at the moment so\nI'll have to wait a little longer till i get my fingers on it. I've heard so\nmany great things about this novel ( the format alone was enough to…",
  "data/reddit-books/r/books/comments/p8uvr4/any_love_for_james_michener_in_this_sub.json": "I remember reading Mexico and Hawaii from my dads book shelf as a teen. Too long\nago to remember much on plot, but I remember feeling like this guy must do an\nincredible amount of research to write these novels. They also had the feel that\nthe location itself was a character so to speak, maybe even…",
  "data/reddit-books/r/books/comments/p8vqqk/lord_of_the_rings.json": "Just started reading The Lord of the Rings and I can't believe I waited till I\nwas 34 to read it. The writing is magic - beautiful turns of phrase, poetry,\ndiction, Tolkien did it all - and even though there's lots of peril, I find it\ncalming to read. This series is like comfort food and I think I…",
  "data/reddit-books/r/books/comments/p8xo73/i_read_all_twelve_of_salman_rushdies_novels.json": "TLDR...\n\nMy personal favorites...\n\nThe Moor's Last Sigh (1975)\n\nThe Ground Beneath Her Feet (1999)\n\nThe essential Rushdie Novels...\n\nMidnight's Children (1981)\n\nShame (1983)\n\nShalimar the Clown (2005)\n\nQuichotte (2019)\n\nFor the Rushdie enthusiast only...\n\nGrimus (1975)\n\nThe Satanic Verses…",
  "data/reddit-books/r/books/comments/p8y3wn/best_summer_reading_experience.json": "This summer, I reread Jurassic Park. I turned my bed into the ultimate cozy\nreading nest, closed the blinds, and read this on my computer in dark screen\nmode. I lit a candle, and turned on an 8 hour YouTube ambient noises ofJurassic\nPark video. I had SO MUCH FUN reading this book. I first read this…",
  "data/reddit-books/r/books/comments/p9714z/finally_read_a_full_book.json": "I posted a few months back about not having read anything since high school and\nwanting to improve my reading ability in order to tackle difficult non-fiction\ntexts. I realized that most of the time that I did try starting to read, I gave\nup because the book was too difficult or dry for me stick…",
  "data/reddit-books/r/books/comments/p99ste/little_women_not_just_for_women.json": "I had never heard of the book, \"Little Women\"\n[https://www.penguinrandomhouse.com/books/292496/little-women-by-louisa-may-alcott-with-an-introduction-by-regina-barreca-and-an-afterword-by-susan-straight/9780593198025],\nbut was just browsing the classics section at a B&N with an eye for the…",
  "data/reddit-books/r/books/comments/p9c5ut/what_are_the_best_pandemicrelated_books_in.json": "I think we have all heard this saying by now: the most unrealistic thing about\nzombie movies is that there aren't a bunch of people rushing toward the zombies\nto get bitten while shouting \"It's all a hoax!\"\n\nI haven't read The Stand in a while, but I think that's probably the best known\npandemic…",
  "data/reddit-books/r/books/comments/p9drs6/nietzsche_on_what_lovers_and_young_people_get.json": "I recently read Beyond Good and Evil. Here are some interesting ideas that stuck\nto mind!\n\nFind out the problem with thinking in absolutes, Nietzsche's writing tips, why\nmen and women fight, and more.👇👇 👇\n\n 1. Thinking in B/W. The young think in absolutes - and pay a terrible price.\n    The young…",
  "data/reddit-books/r/books/comments/p9hkuj/i_just_completed_eleanor_oliphant_is_completely.json": "Once in a blue moon I'll read a book that just gains access to my heart and\nleaves an impact. Eleanor Oliphant is completely fine is one of those books. At\nfirst i hated the protagonist, Eleanor, but as the story progressed I managed to\nnot only understand her but fully empathise with her. She went…",
  "data/reddit-books/r/books/comments/p9iegi/i_dont_get_the_fuss_about_the_great_gatsby.json": "I read the book cover to cover, twice, years apart. I don’t get the hype about\nit. I can see how it’s an interesting story. It’s in the Roaring Twenties, the\nage of jazz, there is love and hate, and a rollercoaster of emotions and events\nthat keeps going till the very end. Even the hook is great: a…",
  "data/reddit-books/r/books/comments/p9ilhu/john_green.json": "I am a huge John Green fan. Yesterday I was in heaven (Barnes and Noble) and I\nsaw a signed copy of John Green’s The Anthropocene Reviewed. Ofc I bought it,\nI’m so excited.\n\nI read The Fault in Our Stars in middle school, and I was instantly drawn to his\nwriting. He seems to get inside of the…",
  "data/reddit-books/r/books/comments/p9nc76/shadow_and_bone_series_is_crap_compared_to_tv_show.json": "Ok I'm usually on the side of \"the book is better than the movie!\" Because... it\nis..... like by a lot. BUT. BUT BUT.\n\nI watched the show and decided to read the book - it's not usually a problem for\nme bc my own imagination will take over despite already having a visual in my\nhead- and, to put it…",
  "data/reddit-books/r/books/comments/p9u0x0/reader_shaming_i_need_to_know_if_anyone_else_does.json": "When I'm really enjoying the book... I turn to the last page and read the last\nline, sometimes even the last paragraph. I don't know why I do this, but I hate\nmyself afterwards because then I've literally just ruined the book for myself\nand the ending always stays in my mind as I read the rest of…",
  "data/reddit-books/r/books/comments/p9uym0/the_meg.json": "I read the first four books of the Steve Alten's \"The Meg\" series, and I was\nshocked. It is so well written, and even has scientific moments explained very\ncarefully so many people can understand it. I read these books after I watched\nthe movie and I understood, that the movie is awful and he didn't…",
  "data/reddit-books/r/books/comments/p9uz6n/dave_berry_is_hilarious.json": "edit: i managed to put a typo in the title, of course it's \"Dave Barry\"\n\nI really dislike books that are supposed to be funny. I think the last book that\nwas intentionally funny and that actually made me laugh and that I enjoyed was\nHitchhiker's Guide, and I read that 20 years ago. Doubtful if I'd…",
  "data/reddit-books/r/books/comments/pa07tu/which_book_taught_you_not_to_judge_a_book_by_its.json": "It is hard not to judge a book by its cover, hence the cliche.\n\nBut, are there any books you've put off reading because of how their covers\nlooked? For me, it was Terry Pratchett's Discworld novels. I found the covers\noften looked like a fantasy convention attendee's daydreams. I ignored quite a\nfew…",
  "data/reddit-books/r/books/comments/pafomx/posts_from_men_expressing_surprise_and_delight.json": "Yes, this is partly in response to the recent Little Women post, but more\nbroadly about similar posts I have seen here that always seem to get a lot of\nattention and praise and many comments I’ve seen over the years.\n\nLike so many other teenage girls in high school, I had to read and relate to…",
  "data/reddit-books/r/books/comments/pag4nd/confession_i_just_cannot_get_into_lotr.json": "I have tried many times over the years, and it just bores the crap out of me.\nBombadil, the songs that take forever, the slow pacing. I read for fun, it\nshouldn't feel like it is a slog, right?\n\nImmensely enjoyed The Hobbit, and the LOTR films, and stuff like Steven\nErikson's epic fantasy.\n\nBut this…",
  "data/reddit-books/r/books/comments/pahf5e/jane_austen_is_really_funny_and_im_glad_im.json": "Recently I've been feeling like I should have read Jane Austen by now. I read\nPride and Prejudice in high school for a class, but I hated it because\nliterature classes suck at teaching literature, so I don't really count that.\n\nSo I found a Jane Austen box set on Amazon and started with Sense…",
  "data/reddit-books/r/books/comments/pajrrf/addicted_to_reading.json": "I think I'm in need of serious help. Generally people ask \"how to read books\"\nbut well I'm asking \"how to NOT read books\". All i wanna do is read, like 24/7!\nIn the starting it felt amazing but it's becoming a problem now. I don't\nremember when was the last time i slept before 3 or 4 in the morning,…",
  "data/reddit-books/r/books/comments/pam3ul/some_books_you_can_pick_up_and_start_reading_some.json": "For me, I've got The Stand by Stephen King and Pachinko sitting on my shelf,\nlooming over me. I just read 3 SK books in a row and now I'm reading a short\nnovella by a different author as sort of a pallet cleanser. I'm heading to the\nbeach in Mid-September for a long weekend and thought that The…",
  "data/reddit-books/r/books/comments/paqd4d/i_find_sherlock_holmes_incredibly_unsatisfying_to.json": "I bought the complete collection on Audible because it hit a bunch of things I\nwas enjoying at once; mystery/crime stories and Stephen Fry for the most part.\n\nI'm up to \"The Final Problem\" at the moment, the story where Moriarty gets\nintroduced. At this point it's been roughly 2 extended novels and…",
  "data/reddit-books/r/books/comments/parojy/after_a_long_time_of_not_reading_books_are_really.json": "For context, I am a 21 year old dude who, outside of class assignments, hadn't\nvoluntarily touched a book since high school until last month.. I have always\nbeen a fitness junkie, and I have never been able to set aside time for reading\ndue to exercising, work, cooking protein-packed meals, and…",
  "data/reddit-books/r/books/comments/paswbs/just_finished_neuromancer.json": "First off, I was totally blown away by this book. The world that Gibson creates\nhere is so enthralling I found it impossible to put down, especially the last\nthird. He does a great job of creating memorable characters and scenes that\nstick with you. While some of the prose can be confusing…",
  "data/reddit-books/r/books/comments/paupm1/i_think_most_people_are_comfortable_quitting_a.json": "I'm currently reading an author's debut fantasy novel in a finished series and\nthe beginning of it blew my mind in how compelling it was; it was well-written,\nwell-fleshed out, and had me on board with the MC from the first few pages. As\nsomeone who recently came to terms with not forcing myself to…",
  "data/reddit-books/r/books/comments/pauzjk/how_do_you_think_anne_frank_would_feel_to_know.json": "I read Anne Frank: The Diary of a Young Girl multiple times when I was growing\nup and was always really fascinated with Anne's story. Now I'm 32 and the other\nday, I bought a copy of the Definitive Edition of her diary and was just as\nexcited to read the parts that were omitted from the other…",
  "data/reddit-books/r/books/comments/pb0udy/the_seven_husbands_of_evelyn_hugo_is_one_of_the.json": "A nice little subversion of the usual “character with ruthless ambition wants to\nhave their cake and eat it too.” See I thought Evelyn would be this\nMachiavellian character who as I stated above would always believe “More power,”\nwas the solution to get what she wanted and like a lot of “anti…",
  "data/reddit-books/r/books/comments/pb9e7y/a_little_life.json": "so i just completed reading 'a little life' by hanya yanagihara, and i have to\ntalk about it. i'll be honest i've never cried so much reading a book, this book\nis so devastating, the characters so amazing and different and so beautiful in\ntheir own ways, their relations with each other, the…",
  "data/reddit-books/r/books/comments/pbb8s8/on_science_fiction_being_serious_literature.json": "I was reading the Wikipedia page on Mary Doria Russell\n[https://en.wikipedia.org/wiki/Mary_Doria_Russell] and nearly choked on my\ncoffee when I came across this line, about her book The Sparrow\n[https://en.wikipedia.org/wiki/The_Sparrow_(novel)]:\n\n> Because of the quality of its writing, and the…",
  "data/reddit-books/r/books/comments/pbf6rw/what_are_some_books_that_you_really_wanted_to.json": "I find so often there are books that have been on my to-read list for so long\nand I get so excited about them and then they're just... incredibly\nunderwhelming. I recently finished reading The Secret Life of Bees which had\nbeen on my list to read for years and I was so worried it would fall short…",
  "data/reddit-books/r/books/comments/pbhlfr/book_loving_parents_can_we_talk_about_terrible.json": "My child loves horses so we have a series of fiction books about horse riding.\nThe author, a former sports celebrity, is an absolute horse bore. You might\nthink that would help in this scenario but the result is just lists of famous\nhorses, important race course names and the titles of important…",
  "data/reddit-books/r/books/comments/pbokfk/tuck_everlasting_and_bridge_to_terabithia.json": "I knew I liked these books when I was a kid but I just re-read them as an adult\nand they're tearing me up the way the best books do. People forget about what\nit's like to be a kid. I think we leave too much behind when we \"put away\nchildish things.\" Another quote that comes to mind is something like…",
  "data/reddit-books/r/books/comments/pbtzl3/a_closed_circle_mystery_is_not_a_locked_room.json": "In the last year I’ve read blurbs for several modern mystery novels that are set\nin an isolated location with a limited number of suspects. The blurbs\nincorrectly call these kind of books locked room mysteries. But they are not:\nthey are closed circle mysteries, which is a mystery with a limited…",
  "data/reddit-books/r/books/comments/pbw5di/dyslexia_put_me_off_of_reading_found_the_kindle.json": "I started with the Harry Potter series I so desperately wanted to read as a\nchild and flew through them. I always loved books but found reading through the\nsame page 4-5 times daunting. With this font paired with the dark mode option,\nI’ve even read an entire 345 book in one day!\n\nDyslexia prevented…",
  "data/reddit-books/r/books/comments/pc3o5x/i_am_nyt_bestselling_author_tj_klune_who_writes.json": "Hello! I'm TJ Klune. Since 2011, I have published over twenty novels in\ndifferent genres, including contemporary to science fiction to fantasy. The main\nthroughline for all of my books is that they are about queer people from all\nwalks of life. In 2020, I released my first novel with Tor called The…",
  "data/reddit-books/r/books/comments/pc5pno/do_you_buy_books_from_your_favorite_book_store_to.json": "I asked because the Barnes and Nobles near me are really nice and I like being\nthere, sitting at the cafe and reading a book I purchased, or else researching\nnew books or Manga. But the prices are almost always worse than, say, Amazon. So\nit’s hard for me to choose whether to keep buying stuff there…",
  "data/reddit-books/r/books/comments/pc6er9/catch22_one_of_the_best_books_ever_written.json": "I read it again last weekend.\n\nThat was the book that always made me laugh along with Hitchhiker's guide to\nGalaxy.\n\nNow all I think is :John just wants to complete his missions and come home.\n\nHis goal keeps getting farther and farther but He doesn't give up,he is trying\nhis best(the best ) he can…",
  "data/reddit-books/r/books/comments/pcdrmv/i_just_finished_no_country_for_old_men_spoilers.json": "I watched the movie and detected so much thematic substance that I knew I had to\ndig in deeper and read the book. I've been reading about 50 pages a day for the\npast few days and I just finished it. I am sitting here in a total daze, hardly\neven able to think. Not only was it an incredible narrative…",
  "data/reddit-books/r/books/comments/pcjfec/why_are_so_many_goodreads_reviews_simply_recaps.json": "Just like the title says. This seems to be rampant for less popular books and it\nenrages me to no end. Like, dude, I just read the whole book and came to hear\nsomeone else's thoughts on it. What even motivates people to leave 'reviews'\nlike this (for example I just finished '7 years in Tibet' and…",
  "data/reddit-books/r/books/comments/pclqul/musashi.json": "This book is really good. I don’t have many folks that into the same type of\nbooks or read like I do or at least started to. I am about half way through the\nbook. He is starting to learn to live and it seems like he is taking in more and\nmore of his surroundings. I like where this book is going.…",
  "data/reddit-books/r/books/comments/pcmqvj/why_do_some_people_need_to_relate_to_a_character.json": "I've seen people criticize books with the excuse that they couldn't relate to\nthe protagonist. Sometimes ive seen people completely stop midway through a book\nfor that same reason. I get that one element is to live vicariously in this\nfictional world through a character of similar mind to you, but…",
  "data/reddit-books/r/books/comments/pcnnwy/a_book_genre_you_just_couldnt_get_into.json": "Have you ever had a book genre you just couldn’t get into, no matter how many\ntimes you tried. It could be horror, crime, sci fi anything.\n\nFor me it’s got to be any kind of fantasy. I just couldn’t get with the ten book\nseries and the thousands of pages and the numerous characters with odd names…",
  "data/reddit-books/r/books/comments/pcpmrg/i_just_finished_the_stand_by_stephen_king.json": "Oh. My. God. This is the first SK work I have ever read, and let me tell you, it\nwon’t be the last. This book had me on the edge of my seat the entire time,\ncheering for the characters and flat out crying by the end of it. The chapter\nnear the end when Stu is laying in the ravine, getting ready to…",
  "data/reddit-books/r/books/comments/pcqh6a/recently_slowed_down_my_reading_and_its_changed.json": "Hi everyone!\n\nA college prep class, taught by the university, that I took when I was 18 had a\nspeed reading course. Since then, 13 years have passed, I’ve seen the trend of\nspeed reading skyrocket and have tried multiple times to learn speed reading.\n\nHowever, recently I had a realization that I had…",
  "data/reddit-books/r/books/comments/pcw8et/blood_meridian_spoilers_i_know_what_happened_to.json": "I know because McCarthy tells us. Holden takes the kid \"in his arms against his\nimmense and terrible flesh.\" The secret of Blood Meridian is this: it is exactly\nwhat it appears to be. There is no mystery. After many readings, I've learned\nthat the answers are on the page.\n\nWhat do we know about the…",
  "data/reddit-books/r/books/comments/pcww5t/do_you_keep_your_unread_books_separate_from_those.json": "I’ll be reorganising my shelves soon and I’m thinking about different styles of\norganisation.\n\nCurrently I keep a separate shelf for unread books and I was wondering how\ncommon that was.\n\nDo you usually mix your read and unread books, or do you keep unread books\nseparate and only add them to your…",
  "data/reddit-books/r/books/comments/pd2g8k/wow_reading_is_actually_fun_and_it_saved_my_life.json": "I never liked reading growing up. And being forced to read was excruciating. And\nwhen I did read, I had a lot of difficulty comprehending what was being read. It\nwould take me forever to finish a book because I would lose attention too\nfrequently and have to reread passages.\n\nI’m currently going…",
  "data/reddit-books/r/books/comments/pd49b1/have_you_ever_been_taken_aback_by_a_minor_event.json": "White Teeth by Zadie Smith introduces Archie Jones in the beginning of the book\nand for some reason I was really thrown back for the fact that his story, his\nlife as we know, it begins at the age of 45.\n\nIt begins with him trying to end his life, but couldn't go through with it\nbecause of a the…",
  "data/reddit-books/r/books/comments/pdbmi8/i_will_no_longer_read_anything_in_an_ongoing.json": "I saw a recommendation of a comic book by none other than GRRM himself. The\ncomic is called Saga and it's very good. It's star wars meets game of thrones in\na way. Annd I thought it was a complete series since it started in 2012 but it's\non hiatus as of 2018 and only 50% complete. Any book or series…",
  "data/reddit-books/r/books/comments/pdnm9m/i_finished_reading_les_miserables_with_my.json": "I’m new to Reddit and thought this was the perfect story to share, so here goes!\nMy great-grandmother was born and partly raised in France before moving to\nAmerica with her family in her teenage years. When she became older, reading Les\nMis was always on the top of her bucket list as multiple of her…",
  "data/reddit-books/r/books/comments/pdsobl/is_ennui_just_a_synonym_for_boredom.json": "I often see the word used in a way similar to this:\n\n> It is wonderful how much time good people spend fighting the devil. If they\n> would only expend the same amount of energy loving their fellow men, the devil\n> would die in his own tracks of ennui\n> \n> - Hellen Keller, The Story of My Life\n\nSo if…",
  "data/reddit-books/r/books/comments/pdswmw/your_top_reads_of_the_year_so_far.json": "I've been reminiscing about the books I've read so far this year, trying to pick\nmy favorites.\n\nAlthough I've enjoyed most of them, some definitely stood out:\n\nRebecca by Daphné du Maurier (A new all time favorite)\n\nGiovanni's Room by James Baldwin (The writing is EXQUISITE!)\n\nThe portrait of Dorian…",
  "data/reddit-books/r/books/comments/pdtzxy/sir_arthur_conan_doyles_the_valley_of_fear_is.json": "The second half without Holmes is a little eh and in retrospect can make you\nwince with Doyle’s political inexperience . But you get a brilliant murder\nmystery in the first half. While I found the Hound of the Baskerville to be an\nexcellent novel, I do feel this one is superior.\n\nIt’s criticized as…",
  "data/reddit-books/r/books/comments/pdvzu2/what_books_should_be_required_reading.json": "I’m curious to what books people think should fall under required reading. We\nall know most required reading is hit and miss especially for adolescent and\ngrowing audiences without much experience; what book would you say got to your\ncore and actually had an effect on you?\n\nFor me personally it was…",
  "data/reddit-books/r/books/comments/pdx9lq/to_the_people_who_spoil_endings_and_major_plot.json": "May the chocolate chips in your cookies always turn out to be raisins.\n\nMay the people who come to talk to you in your room leave the door slightly\najar, so that you have to get up and close it.\n\nMay your article load that extra little bit as you're about to click a link so\nyou click an ad…",
  "data/reddit-books/r/books/comments/pdxe8s/how_do_you_feel_about_rereading_books.json": "I like to go back to books I haven't read for a year or two or even more because\nit really helps me identify my growth. It reminds me what parts of the novel I\nfound striking, therefore what I valued at the time, if that makes sense. I also\ngain a deeper understanding of the book itself as well,…",
  "data/reddit-books/r/books/comments/pdym1j/the_first_200_pages_of_war_peace_are_a_slog_that.json": "About a month ago I finished War & Peace by Leo Tolstoy after trying to get into\nit on 3 separate occasions before. The book is absolutely incredible and\ngenuinely does deserve the recognition it has as one of the greatest books of\nall time. What really did shock me however, was that once I got over…",
  "data/reddit-books/r/books/comments/pdz975/im_44_years_old_and_ive_just_discovered.json": "I'm old enough that I remember when audiobooks were called books on tape, and\nthey were on a carousel in the bookstore at the mall. Then they appeared on\ncompact disc.\n\nI never thought there was anything wrong with them, or that they weren't \"real\nreading\", I just never got into them. Maybe the…",
  "data/reddit-books/r/books/comments/pe8u32/never_knew_reading_is_something_i_need_to_make.json": "I used to just pickup a book and read whenever I get time when I was in\nuniversity but now that I'm out and been busy with job hunting and all, I don't\nget that much time and the books that I have ordered is just piled up on my\ntable. Only then I realised that I'm not reading like I used to and I…",
  "data/reddit-books/r/books/comments/pegpqh/what_do_you_enjoy_about_the_classics.json": "When I was younger I read a lot. Mostly YA and I read the hungergames and Harry\nPotter series. Then I stopped reading somewhere around my early twenties. Around\ntwo years ago I wanted to pick up the reading habit again and raided my mothers\nbookcase. I borrowed and read Jane eyre, wuthering heights…",
  "data/reddit-books/r/books/comments/peiw7o/do_people_who_proudly_hate_on_catcher_in_the_rye.json": "I just finished reading Catcher in the Rye for the first time. We’ve all heard\nthat liking this novel is a “red flag” and folks seem to talk a lot of shit when\nmen and young boys like this novel especially. I knew this book resonated with\nsome real criminals who enacted awful acts of violence, so I…",
  "data/reddit-books/r/books/comments/pej7u7/i_feel_numb_after_finishing_lord_of_the_rings.json": "well, i just finished reading (and watching) the lord of the rings and now i am\nsad. i love it so much and i can’t bear to say goodbye to all these characters\nthat i journeyed with in what felt like years. to be honest, i did not expect to\nget this emotionally invested with this book at all. i…",
  "data/reddit-books/r/books/comments/pekya2/why_are_people_so_obsessed_with_character_and.json": "The most common criticism I see on this sub of all fiction is that people found\nthemselves unable to ‘like’ or ‘identify’ with any of the characters. This\ngenuinely perplexes me. I don’t mean this as a critic but why does that matter?\nNor am I trying to blanket say that my taste is better but in…",
  "data/reddit-books/r/books/comments/penabl/what_happened_to_cheap_books.json": "I used to be able to find old paperbacks for $1 on sites like half.com, ebay, or\nothers. Shipping would be a few dollars, but many times books could be bundled\nform one seller – 10 books for $15-18, something like that. Half Price Books\nused to have a $1 clearance section in their stores, but it was…",
  "data/reddit-books/r/books/comments/pf167k/i_read_andy_weirs_project_hail_mary_and_ill.json": "As someone who reads alot of sci-fi literature, this might be the best science\nstory I've ever read till now.\n\nA lot of sci-fi I've read till now uses sci-fi elements - spaceships, suits,\naliens to tell plot driven or character driven stories. It's rare to find\nstories with science and discovery at…",
  "data/reddit-books/r/books/comments/pf5wn8/i_started_reading_books_out_loud_with_friends.json": "The past year, I started reading books out loud together with friends and I love\nit. We usually just read a few chapters, not the whole book because that would\nbe too much. Although we did manage to read \"Beowulf\" in one go during the\npandemic. Things I've noticed:\n\n * Having a book read to me…",
  "data/reddit-books/r/books/comments/pf8wtc/the_similarities_between_the_novels_by_dan_brown.json": "I have completed reading all the books by Dan Brown. After the completion, it\ncame to my mind that they are strikingly similar, even the non-Langdon ones. So\nlet's discuss about the striking similarities (keep in mind that there are\nexceptions) ...\n\n * Death - Someone dies; probably someone…",
  "data/reddit-books/r/books/comments/pfalmq/i_finally_reached_100_books.json": "I'm dyslexic but I love reading so much (ironic I know) so reading a book takes\na lot longer than normal and I find it hard to focus or fully remember what i\nread sometimes. However I try to do a book track every year to practice and I\nnever got more that 20 books but I finally reached 100 books and…",
  "data/reddit-books/r/booksuggestions/comments/ovhgqt/is_six_of_crows_any_good.json": "Just started it but i dont have very high hopes about it, bought it after\nsomeone recommended it to me but now idk what to think of it cus i’ve also heard\npeople say they thought it was boring. Im still in the first 50 pages so i dont\nknow much, kinda hard to follow cus there’s lots of fantasy terms…",
  "data/reddit-books/r/booksuggestions/comments/ovo9u4/looking_for_a_book_like_the_movie_the_matrix.json": "One of my favorite films of all time. I am a deep thinker and have always been\nintrigued by the idea of simulated reality. Looking for a book involving\nsimulations similar to the matrix .",
  "data/reddit-books/r/booksuggestions/comments/ovs7zc/any_books_about_thieves.json": "preferably set in the medieval age though if you think any non medieval age\nthief story is really good feel free to recomend it, it can be a lone thief or\nan entire thieves guild, i just need fiction/fantasy stories with focus on\nthievery, i dont expect many people here to be familiar with these…",
  "data/reddit-books/r/booksuggestions/comments/ovtpec/japanese_mythologyfolklore.json": "Im really interested in japanese culture and mythology and i was wondering if\nsome of you guys know any good books that covers the mythology of japan. Thanks\nin advance",
  "data/reddit-books/r/booksuggestions/comments/ovwdx4/stories_like_netflixs_love_death_robots.json": "The Giant episode made me want to seek out similar stories. Need me a book that\nhas short stories similar (or not) to Love, Death, & Robots please. Thanks",
  "data/reddit-books/r/booksuggestions/comments/ovxiyk/any_novel_where_the_protagonist_loses_and_regains.json": "Maybe they experience a great loss or a massive betrayal. Either way, that\nexperience or series of them makes them lose their faith in the world, making\nthem a shadow of the person they once were. But one day, maybe through someone\nthat decides to give them a hand or a new purpose, they…",
  "data/reddit-books/r/booksuggestions/comments/ovz4ly/hot_and_sexy_book_recommendation_with_good_plot.json": "yeah thats about it i really like fantasy and would prefer it if the characters\nweren't older than 30",
  "data/reddit-books/r/booksuggestions/comments/owcov7/books_with_major_lgbtq_characters_that_dont_make.json": "It’s kind of hard to find anything that has good trans/queer representation that\ndoesn’t make the fact that the character is LGBT the whole point of the novel\n(i.e. Love Simon). Even a queer romance is fine, but I’d like a something with\nless angst for the sake of it. A dark or depressing book is…",
  "data/reddit-books/r/booksuggestions/comments/owny3v/a_book_about_how_to_deal_with_the_concept_of_death.json": "A good friend of mine is going through a bit of an existential crisis, with the\ncenter of it being the fact that one day they'll die, and they won't be able to\nbe with the people they love or do the things they love afterwards. We're both\navid readers, so I suggested looking for a book that talks…",
  "data/reddit-books/r/booksuggestions/comments/ox1e6n/books_to_read_when_you_are_feeling_a_little_bit.json": "I am making a big decision soon, and I am feeling a little lost. I got the\nopportunity to work for a great company but there are some drawbacks to the\noffer and it has me a bit confused as to what I should decide to do. I am\nleaning towards taking it even though I am not fully happy with the offer…",
  "data/reddit-books/r/booksuggestions/comments/oxca6l/spyespionage_novels_in_a_high_fantasy_setting.json": "By \"high fantasy\" I mean secondary worlds with magic, so series like Lord of the\nRings or the Stormlight Archives series or The First Law trilogy.\n\nSpy/espionage set in the modern world, but with magic -- like Charles Stross'\nLaundry Files series of Lovecraftian espionage -- is not what I'm looking…",
  "data/reddit-books/r/booksuggestions/comments/oxgwaa/what_book_should_i_still_read_even_though_ive.json": "Ive often wondered this about shows or movies ive seen but am reluctant to pick\nup the book after, but which ones do you think are still definately worth it?",
  "data/reddit-books/r/booksuggestions/comments/oxq32w/im_looking_for_books_for_handling_grief_ot.json": "Maybe Trigger warning?\n\nSo I'm 21 and found out the other day my dad has stage 4 cancer and im not\ntaking it too great. Doc says he has maybe a year to live. I threw up a couple\ntimes from the anxiety and am just all around having trouble pulling myself\ntogether. Everytime I think I have a handle on…",
  "data/reddit-books/r/booksuggestions/comments/oxqu16/can_someone_who_hasnt_read_any_greek_mythology.json": "I really want to read it and see what the hype’s all about but I’m scared I\nwon’t get any Greek references cos I haven’t read any BUT would really love to\nget into. Should I read it or nah?\n\nTHANKS Y’ALL!",
  "data/reddit-books/r/booksuggestions/comments/oy67r6/comedy_story_books_for_4yo.json": "My 4yo son and I have just finished The Hobbit and are now beginning Harry\nPotter.\n\nHe roared with laughter when (1) various dwarves kept showing up at Bilbo’s\nhouse and interrupting his tea; and (2) dozens of letters from Hogwarts were\narriving under the door & through the chimney at while Vernon…",
  "data/reddit-books/r/booksuggestions/comments/oy76n4/suggestions_for_comfort_reads.json": "I’m going through a tough time right now and I’m looking for books that are\nlight hearted/childlike/nostalgic. Any recommendations?",
  "data/reddit-books/r/booksuggestions/comments/oyk354/something_like_wheel_of_timestandard_farmboy.json": "Gave up on WoT at the fifth book. Currently reading the Mistborn trilogy and I'd\nlike something like it, just less depressing. Just some good magic, action,\nstory, fantasy setting, and romance subplot.\n\nFeel free to suggest even mainstream stuff... The only fantasy I've read is\nInheritance Cycle and…",
  "data/reddit-books/r/booksuggestions/comments/oyscon/is_the_song_of_achilles_good.json": "So, I've been seeing this book get recommended here quite a few times, and it\nseems like a great book.\n\nI've been thinking about giving it as a gift to my father, who really likes\nGreek Mythology and has even read the Odyssey. My only concern is weather the\nbook has some teen vibes to it. So I guess…",
  "data/reddit-books/r/booksuggestions/comments/oyyxqv/posts_in_this_sub_be_like.json": "I need a new good book to read. It MUST be set in an alternate medieval history\nwhere steam engines and gunpowder are common place. It HAS TO HAVE a\nlovers-to-enemies-to-lovers arc and preferably should have a golden retriever as\na side character (but not a talking one, as that would be…",
  "data/reddit-books/r/booksuggestions/comments/ozevev/murakamis_atmosphere_and_surrealism_but_without.json": "Any suggestions?",
  "data/reddit-books/r/booksuggestions/comments/ozujum/books_you_couldnt_put_down.json": "Looking to continue my streak. I enjoy most genres My recent favorites include\nMaster and Margarita, cloud Atlas, educated, sapiens, ocean art the end of the\nLane",
  "data/reddit-books/r/booksuggestions/comments/p05x0b/does_anyone_as_an_adult_ever_read_ya_books_what.json": "Admittedly, aside from obvious books like Harry Potter, I've read some others\nlike Percy Jackson and Miss Peregrines Home for Peculiar Children and enjoyed\nthem. Sometimes I enjoy YA books because they are easy and not long winded like\nsome books can be. Does anyone else do this? What are some good…",
  "data/reddit-books/r/booksuggestions/comments/p0fyyq/just_finished_1984_any_other_good_books_like_that.json": "Recommend some books for me please",
  "data/reddit-books/r/booksuggestions/comments/p0km7l/please_suggest_me_books_which_you_absolutely.json": "For example, I loved 'A fine balance' and 'A little life'. But both of them\nhandle themes which might be a little too much for some to handle. Likewise,\nplease recommend books which you are generally wary about before recommending.",
  "data/reddit-books/r/booksuggestions/comments/p0oa2z/just_finished_watching_altered_carbon_on_netflix.json": "considering starting dune or neuromancer but after some more suggestions. thanks",
  "data/reddit-books/r/booksuggestions/comments/p0xlxa/book_for_my_girlfriend.json": "Hello!\n\nMy girlfriend is going to study abroad for 6 months... She is not only my\ngirlfriend but also best friend and those 6 months will be hard. Because i am\nnot good in expressing feelings about how much she means to me I would like to\n\"express\" it with a book. I know it sounds silly but if…",
  "data/reddit-books/r/booksuggestions/comments/p13ox8/happy_national_book_lovers_day.json": "If someone asked you “What’s your favorite book? And why?” What’s your answer?",
  "data/reddit-books/r/booksuggestions/comments/p17w30/the_charm_of_this_subreddit.json": "My new year resolution this year was to read 25 books. Bought a Kindle and\nslowly cultivated the habit which I had forgotten over these past few years as\nsocial media slowly drew me in armed with knowledge of my acute weakness - a\nvery short attention span.\n\n8 months in and I am more than half way…",
  "data/reddit-books/r/booksuggestions/comments/p1ovfw/books_to_pick_up_for_20_minutes_at_a_time_instead.json": "I want to get rid of the \"pick up phone, scroll through shit I've already seen,\nrepeat\" cycle by replacing that habit with picking up a book for 20-30 minutes!\nWhat are some good books that suit being read in small chunks? I haven't read a\nbook in like 6 months and the last one I read was graphic…",
  "data/reddit-books/r/booksuggestions/comments/p26mig/i_recently_finished_bad_blood_by_john_carreyrou.json": "I'm not a really good reader, and i've always had trouble getting into books.\nI've probably picked up more books that i haven't finished compared to the ones\nI have finished.\n\nMy friend recommended the BAD BLOOD book and I figured I'd like it since I'm\nsort of into intense real life events like this…",
  "data/reddit-books/r/booksuggestions/comments/p2g82a/iso_mystery_or_police_procedural_that_doesnt_rely.json": "I love mysteries and police procedurals, but I’m finding that, especially with\nbooks in a series, authors write more and more violence and torture into their\nstories. These series almost always take a very dark turn.\n\nA quick example that comes to mind is Patricia Cornwell. Her early works…",
  "data/reddit-books/r/booksuggestions/comments/p2g9zy/the_song_of_achilles.json": "Has anyone here read the Song of Achilles and if so, would u recommend it?",
  "data/reddit-books/r/booksuggestions/comments/p2u89i/any_novels_similar_to_supernatural.json": "I loved the show and, although I think it was unnecessarily lengthened, I was\nintrigued at how they managed to squeeze religious lore (among others) for all\nit was worth. If possible, I would like your suggestions be more epic or maybe\neven have a pinch of cosmic horror, since it was something that…",
  "data/reddit-books/r/booksuggestions/comments/p2zvef/im_looking_for_books_exploring_religion.json": "I’m looking for a book that explores religion and shows its positive and\nnegative sides. It will also help if the book has parts that discuss history or\ncompare it with other religions or mythology (like Greek mythology or the\nEgyptian cosmology). I’m doing it for research.\n\nThank you for your…",
  "data/reddit-books/r/booksuggestions/comments/p3h6cg/im_looking_for_books_to_regain_my_love_for_reading.json": "Yeah, so I'm a university student, and as you know, I've come to hate books so\nmuch, that I stopped reading. Last thing I enjoyed reading was Lord of the flies\nand Dante and Aristoteles in search of the universe secrets (it's a gay love\nstory in Spanish as far as I know).\n\nSo I was wondering if…",
  "data/reddit-books/r/booksuggestions/comments/p3ogel/just_read_princess_bride_need_more_like_it.json": "As the grandfather in Princess Bride describes it: Fencing. Fighting. Torture.\nRevenue. Giants. Monsters. Chases. Escapes. True Love. Miracles. I’ll add male\nprotagonist and romance to that list! I know Stardust is often recommended but\nsurely there are others that have this sense of adventure and…",
  "data/reddit-books/r/booksuggestions/comments/p3qote/is_mistborn_trilogy_worth_reading_for_a_beginner.json": "I mean I mostly read Non-Fiction books..\n\nBut I have read Harry Potter, The Hobbit, The Silent Patient, A Monster Calls\netc etc in Fiction...",
  "data/reddit-books/r/booksuggestions/comments/p48mj6/what_are_your_favorite_lighthearted_reads_that.json": "I always find myself reading rather heavy material (I love to learn and am a\nhuge nonfiction fan) but I really need some lightness in my life.",
  "data/reddit-books/r/booksuggestions/comments/p4jlzm/what_are_you_favourite_10_pages_or_less_short.json": "What are you favourite 10 pages or less short stories?",
  "data/reddit-books/r/booksuggestions/comments/p4sdb9/can_agatha_christie_books_be_enjoyed_by_a_modern.json": "If yes, then please recommend some of her books!:-)",
  "data/reddit-books/r/booksuggestions/comments/p50xlt/hitchikers_guide_to_the_galaxy_worth_reading.json": "Recently I saw some people talking about the novel series and it seemed\ninteresting. Wondering if its worth getting",
  "data/reddit-books/r/booksuggestions/comments/p5kk2p/suggest_me_books_from_our_time_that_you_think.json": "We're still reading authors and books from many years ago, ranging from\nShakespeare to Charles Dickens and Edgar Allan Poe. But what books and authors\nfrom our time people will still read in the future? Suggest me your books,\nfellow redditors!",
  "data/reddit-books/r/booksuggestions/comments/p5pgsr/books_for_9_yo_who_reads_on_post_high_school_level.json": "Hello! I’m new to this community and I need some help. My niece, who’s 9, loves\nreading. Since last year during the COVID-19 lockdown, she’s been devouring\nbooks faster than we can provide. However, now that she’s returning to school,\nshe took one of those standardized placement tests. On the…",
  "data/reddit-books/r/booksuggestions/comments/p5u3xb/need_a_book_to_keep_me_on_the_edge_of_my_seat.json": "Big fan of the Red Rising series, love how they’re full of action and don’t shy\naway from violence. I’m looking for more books like that. Does matter if it’s\ndystopian, historical, sci fi fantasy, etc. Just as long as I can’t put the book\ndown",
  "data/reddit-books/r/booksuggestions/comments/p610po/scifi_thrillers_hard_to_put_down.json": "Looking for some nice book recommendations that are mind-bending and hard to put\ndown.\n\nI absolutely love Dan Browns books but also enjoy when it's a bit flavored with\nsome sci-fi/mystery and plot twists and potentially implements astrophysics\n(Like in the film Interstellar by Christopher…",
  "data/reddit-books/r/booksuggestions/comments/p69948/is_there_anything_like_the_bunnicula_series_but.json": "I loved James Howe's Bunnicula series as a kid, especially Howliday Inn; the\nhumor, the creepiness, animals vs the paranormal -- it basically ticked every\nbox for me. Is there anything at all like that for adults?\n\n(I've read Meddling Kids and enjoyed it, but I'd really be stoked to find\nsomething…",
  "data/reddit-books/r/booksuggestions/comments/p6nid9/what_is_the_most_unputdownable_book_youve_ever.json": "Some common ones I hear are: Misery by Stephen King, And Then There Were None\nand The Murder of Roger Ackroyd by Agatha Christie, The Martian and Project Hail\nMary by Andy Weir\n\nwhat should I add to that list?",
  "data/reddit-books/r/booksuggestions/comments/p747l5/what_are_your_favorite_short_stories.json": "And what did you like about them?",
  "data/reddit-books/r/booksuggestions/comments/p7bkwv/whats_your_favorite_feelbad_book.json": "Those books that after reading it you realize how awful the world is. Everyone\nis evil. Dogs die. Life sucks. Mine is Gone Girl by Gillian Flynn.",
  "data/reddit-books/r/booksuggestions/comments/p7i6ac/thank_you_to_the_people_of_this_sub_reddit.json": "New Years resolution to read more this year so had a look on this sub for\nsuggestion. So far this year I’ve read; The Stormlight Archive 1-4, Dune and\nStation 11. Just finished station 11 - beautiful book, finished it in two days.\nDark matter, A man called Ove, Into thin air and Night all arrived…",
  "data/reddit-books/r/booksuggestions/comments/p7s9kc/historical_fiction_thats_historically_accurate.json": "like a POV of living in that time. even a completely made up story, but for\nexample it takes place in gold rush era USA, and includes historically accurate\ndetails like clothing, language and phrases, setting, etc.",
  "data/reddit-books/r/booksuggestions/comments/p83kp5/book_around_greek_mythology.json": "I've been playing Hades on PlayStation and I've loved the Greek mythology\nstoryline woven through it- any books which tell a good story with this theme\nwould be great, thanks!",
  "data/reddit-books/r/booksuggestions/comments/p87xjv/nonfiction_books_about_unethical_experimentation.json": "Hello all!\n\nI’ve recently changed jobs to a clinical trials office, and in the training the\nNuremberg trials were briefly mentioned. Do any of you have recommendations on\nnonfiction books that detail the Nuremberg trials specifically or any other\nprevious unethical experimentation? I’m morbidly…",
  "data/reddit-books/r/booksuggestions/comments/p8ltrj/books_about_moving_to_a_small_town_and_starting.json": "This doesn’t have to be the books entire storyline but strong elements of this\nis what I’m looking for.",
  "data/reddit-books/r/booksuggestions/comments/p8ty81/native_american_books_from_native_american_pov.json": "Seeking a book(s) from the POV of Native Americans. Either historical fiction or\nbiographies. Don’t really care on the setting or time period. Just trying to\nbecome more understanding of their culture and suffering.",
  "data/reddit-books/r/booksuggestions/comments/p9chu9/books_set_in_the_70s_80s_90s_about_drug_use_among.json": "Some examples would be Candy, Monkey Grip and Praise, all in the grunge lit\ngenre. All the above are set in Australia but im open to any setting.",
  "data/reddit-books/r/booksuggestions/comments/p9dh9m/book_where_a_group_of_people_solve_stuff_together.json": "i’m looking for books where group of people solve new mysteries together, it\ncould be a friend group or a school club or something. i was reading this book\ncalled project loki then i remembered how much i used to love this kind of\nsetting. i really thought this was a common trope so i was surprised…",
  "data/reddit-books/r/booksuggestions/comments/p9hzg7/suggest_me_the_trippiest_book_youve_ever_read.json": "A book that is the literary equivalent of a psychedelic trip",
  "data/reddit-books/r/booksuggestions/comments/p9mkc3/is_percy_jackson_and_the_olympians_worth_reading.json": "I’ve never read the books but the reviews seem to be that they’re good but are\nthey any good for an adult?",
  "data/reddit-books/r/booksuggestions/comments/p9yd4p/what_books_made_you_upset_because_you_wish_you.json": "Fictional or nonfictional it doesn't matter.\n\nWhat about those books made you feel that way?",
  "data/reddit-books/r/booksuggestions/comments/pa1iev/a_book_like_dead_poets_society_and_season_1_of.json": "I want a very fall-vibe book. If anyone has seen season one of Gilmore Girls it\nstarts at the beginning of school and the fall energy is unmatched. Also much\nlike the Dead Poet's Society! Doesn't necessarily have to take place at a school\nbut that's a plus!\n\nPs. Also, has anyone read the Dead Poet's…",
  "data/reddit-books/r/booksuggestions/comments/pa29lb/i_feel_lost_in_life_i_need_to_read_something_to.json": "I'm a 21 year old female and I'd like to read something that could change my\nlife or make it better.\n\nI have food in my fridge and a place to sleep, but things are not okay in my\nhouse. I live with my parents, and my relationship with my father is awful\nbecause we hate each other.\n\nPlus, I feel…",
  "data/reddit-books/r/booksuggestions/comments/pa2l91/most_fkd_up_book_suggestion.json": "Hi all. I'm from the UK. I'm looking for suggestions of the most messed up book\nyou know of? Could be crime? Science fiction? factual? Any really. I'm fed up\nbuying crime or horror books and they're don't scare or shock me in the least.",
  "data/reddit-books/r/booksuggestions/comments/pa6zzn/195_countries_195_authors_195_novels_please.json": "I'm looking to read one book from authors born in each of 195 countries. Please\nrecommend.",
  "data/reddit-books/r/booksuggestions/comments/pakity/tell_me_the_most_overrated_book_you_know.json": "I recently got into a bit of a muddle when I didn't know why some people seem to\nhate author Brandon Sanderson.\n\nAfter asking around I learnt that nobody really hates him, they just dislike\nseeing him pop up in every book recommendation, he's not as good as some people\nclaim, and there are other…",
  "data/reddit-books/r/booksuggestions/comments/paujva/lgbtq_book_for_a_gay_fella.json": "Recently finished an lgbtq+ book after 2 years of not reading anything *physical\nsince the pandemic happened. I was so giddy reading it from finish to end, I\neven put sticky tabs for the scenes i liked!\n\nanyways, hit me with the best lgtbq+ book you got, can be mainstream, cliche,\nany tropes really,…",
  "data/reddit-books/r/booksuggestions/comments/pauqjs/loved_terry_prachetts_guards_guards_where_to_go.json": "Love hitchhikers guide to the galaxy too reminded me a lot of that",
  "data/reddit-books/r/booksuggestions/comments/pazoin/hey_guys_new_here_i_want_to_surprise_my_mom_with.json": "I was thinking it would be fun to have a reason to talk to my mother once a week\nabout something. I'm a 32 year old man that's into sifi. I'm not sure what to\nchoose to read with her at all. Any ideas? Doesn't have to be sifi at all.",
  "data/reddit-books/r/booksuggestions/comments/pbcqc4/books_that_are_retellings_of_classic_myths.json": "I recently read Song of Achilles and Circe by Madeline Miller and it's like it\npulled me out of my reading slump. And now I'm all about the Greek mythology, I\nalways have been. I would like more myths told from the perspective of the\ncharacters instead of just as a tale from an outside perspective.…",
  "data/reddit-books/r/booksuggestions/comments/pbic1d/i_want_a_scifi_series_that_feels_something_like.json": "Like 'spaceship tycoon', the novel. (not a real book (at least, I don't think\nso)).",
  "data/reddit-books/r/booksuggestions/comments/pbvgdy/beginner_to_fantasy.json": "I want to get into fantasy because it seems fun and i love getting lost in a\nstory. Where is a good place to start. ( i have never read a fantasy book\nbefore)",
  "data/reddit-books/r/booksuggestions/comments/pc7dlr/i_need_a_book_to_help_me_fall_in_love_with_life.json": "Ok me a very unhappy person, but not because of any external circumstances. For\nthe longest time, I thought it was because I just wasn't meant to be happy. Like\nI'm just not built for that. But tjen I realized how stupid that idea is. It's\nnot that I can't feel happiness. It's that I don't know how…",
  "data/reddit-books/r/booksuggestions/comments/pcn5d8/book_with_neurodivergent_character.json": "So, as the title suggests, I am looking for a book where one (or more) of the\ncharacters has ADD/ADHD/Autism, etc. I got diagnosed with ADD a little while\nago, and I kinda just want to see what forms of representation are out there,\nand see how other people experience it.\nI prefer fictional books,…",
  "data/reddit-books/r/booksuggestions/comments/pctl92/im_looking_for_the_most_depressing_book.json": "I need a book that will make me question my life. Something depressing, with a\nlot of thoughts about human behaviors ig?",
  "data/reddit-books/r/booksuggestions/comments/pcxjv2/bridgertonlike_book_but_not_as_much_of_an_erotica.json": "I LOVE just about anything by Julia Quinn. I think her writing is beautiful and\nI love the way she writes her characters. I’m really wanting more romance novels\nlike hers, but without all the gory details. I’m not talking about a prudish, YA\nnovel, I just don’t want to feel like I’m reading total…",
  "data/reddit-books/r/booksuggestions/comments/pdckxt/just_finished_reading_all_5_asoiaf_books_what.json": "Reading all 5 ASOIAF books was a monumental task for me, but I really enjoyed\nthem. I am a slow reader, and I often fall asleep after reading just a few\npages, so this took me a couple years. After I finished them, I read A Knight of\nthe Seven Kingdoms which I also really enjoyed. I am now looking…",
  "data/reddit-books/r/booksuggestions/comments/pdd84i/i_would_like_a_book_that_makes_me_giggle.json": "It doesn’t have to be the best writing, or mean that much in the end, I just\nwant something full of light and joy.",
  "data/reddit-books/r/booksuggestions/comments/pduq7d/adult_fantasy_series.json": "I've been trying to find good/long fantasy series to read after I finish my TBRs\non my bookshelf. Most of what I stumble upon is YA, and I'd like to read from\nmore mature character perspective. I've enjoyed Mass, Harkness, Bardugo,\nAveyard, and Tahir recently, just to give an example of past series…",
  "data/reddit-books/r/booksuggestions/comments/pdv13e/a_book_that_will_make_me_question_reality.json": "I'm running out of books to read. Love books that keep you up at night",
  "data/reddit-books/r/booksuggestions/comments/pe280t/murder_mysteriesthrillers_that_are_actually_well.json": "I’m looking for page turners that are also well written. I love murder mysteries\nin particular, but have found that many (if not most) books in the genre are\nquite poorly written.\n\nAny recommendations for plot-driven murder mysteries or thrillers that also\nstand on their own as literature would be…",
  "data/reddit-books/r/booksuggestions/comments/peebq3/any_thriller_books_with_major_twists.json": "I loved behind her eyes and was looking for something similar.",
  "data/reddit-books/r/booksuggestions/comments/peu1yq/like_a_court_of_thorns_roses_but_worse.json": "I’m sorry if this has been asked before, but I picked up this series as a fun\nquick escape, and got hooked. Now when I say worse… if you know what I mean, you\nknow what I mean.\n\nEveryone made it out to be so scandalous and maybe I’m desensitized but… I was\nkind of hoping for more? I love the fantasy…",
  "data/reddit-books/r/booksuggestions/comments/pfbapx/okay_this_is_going_to_sound_really_strange_but_im.json": "As the title states, I'm looking for certain kinds of book; the vibe that I want\nto feel is something like cottagecore aesthethic. I know it my sounds crazy but\nif you look up on google images \"cottagecore aesthetic\" different pictures will\npop up with plants, tea cups, nice country houses and stuff…"
}