{
  "data/reddit-top/r/LifeProTips/comments/k3ywxq/lpt_no_matter_how_much_your_workplace_pushes_team.json": "Unfortunately, I learned this the hard way. I work for a small business who put\nhuge emphasis on everyone being friends and building a strong team, but it just\nmeans it hurts more when someone inevitably stabs you in the back. I'm not\nsaying go around and be a dick to people for no reason, but it's…",
  "data/reddit-top/r/LifeProTips/comments/k79gxn/lpt_dont_wait_around_for_others_make_your_own.json": "This was a hard lesson I recently came to terms with in life. I am fairly young\n(26) so don’t really have any hard feelings about it. I always felt I needed\nothers to enjoy the same hobbies as me to actually enjoy doing them. This made\nme miss a lot of opportunities to just enjoy life.\n\nIf you want…",
  "data/reddit-top/r/LifeProTips/comments/kck6gx/lpt_a_marriage_proposal_should_not_come_as_a_big.json": "Lots of TV and films depict a proposal as this dramatic, surprising moment where\nsomeone finally realizes their true feelings. While it may make for good\nentertainment, in real life your significant other should be well aware of where\nthe relationship is heading.",
  "data/reddit-top/r/LifeProTips/comments/kew20n/lpt_if_a_loved_one_is_taken_in_an_ambulance_do.json": "As a medic, whenever I was loading a patient in the ambulance, a family member\nwould inevitably run up to me, keys in hand saying “I’ll follow you to the ER”.\n\nNo.\n\nPeople in an emotional state following another vehicle will develop tunnel\nvision and forget all traffic laws. You will blow stop…",
  "data/reddit-top/r/LifeProTips/comments/kfottr/lpt_do_not_work_through_your_lunch_hour_an_hour_a.json": "So I had a conversation with a coworker yesterday. According to him, the only\nway to get anything done around our place of work is to work through your lunch\nhour. I did the math on how much time you are giving for free and I found that\nit added up to 32.5 work days, assuming you work 8 hour days…"
}