{
  "data/reddit-changemyview/r/changemyview/comments/ov9foo/cmv_i_think_celebrities_should_be_more_open_about.json": "If someone is a gym shark athlete, IFBB pro, or just an actor who gained 20lb of\nmuscle from eating \"chicken, rice, and broccoli\" The reality is that most if not\nall are probably on steroids yet so many people think that these people are\nnatural and if they just train hard enough and diet they can…",
  "data/reddit-changemyview/r/changemyview/comments/oviv9x/cmv_reddit_makes_money_off_of_mentally_ill_people.json": "\"They do it for free\"\n\nI don't know if you are familiar with the meme but it's a referance to internet\nmoderators and what they do for no monetary compensation. On the surface it\nseems like a negative thing to say, and I would agree, but I would also agree\nwith the point.\n\nThere are countless of…",
  "data/reddit-changemyview/r/changemyview/comments/ovkd6d/cmv_funeral_directors_and_funeral_industry.json": "When people die of COVID, where do you think they go? People die every day\nanyways, but funeral homes have been absolutely swamped since the start of this\nwhole thing. The only thing you’ve probably heard about is the sheer number of\nbodies, having to be put into refrigerated trucks because the…",
  "data/reddit-changemyview/r/changemyview/comments/ovmgkt/cmv_extremely_overpowered_characters_especially.json": "I honestly like one punch man for this because it knows that Saitama being an\nunkillable god is boring so it does all kinds of other crazy stuff with the\nstory.\n\nCompare that to DBZ or JoJo where characters have insane unbearable power and\nit's just kind of... boring. You pretty much know how every…",
  "data/reddit-changemyview/r/changemyview/comments/ovnnye/cmv_white_collar_dress_codes_have_no_practical.json": "Blue collar workers wearing protective gear makes sense. You don't need any\nspecial suit to make a spreadsheet. Some of the common arguments I've seen to\ncontradict this go along the lines of: studies show that wearing a suit makes\npeople more productive. But it seems that these studies were only…",
  "data/reddit-changemyview/r/changemyview/comments/ovr20r/cmv_pop_tarts_should_have_individually_labeled.json": "Tone Edit: While this really is my view it is a light hearted one. I’m not angry\nor upset at Kellogg’s just genuinely of the view that food should be\nrecognizable and identifiable even when out of the box and I’m equally perplexed\nas to why this particular item isn’t labeled as such. That said I’m…",
  "data/reddit-changemyview/r/changemyview/comments/ovvyys/cmv_heroin_should_not_be_a_drug_legally.json": "There are absolutely recreational drugs that should decriminalized/legalized.\nMarijuana is the most known example.\n\nHeroin is one that I have heard some people should be legal because when used\nresponsibly, is no problem.\n\nThe main reason I take issue with it is from personal expierience. One time…",
  "data/reddit-changemyview/r/changemyview/comments/ovxkci/cmv_if_we_need_covid_lockdowns_then_we_need_the.json": "Edit for clarification: this is an anti-lockdown CMV, not stricter border\ncontrol. Our elected government should not remove legal citizens liberties “for\ntheir own safety” if the government exhibits willful misconduct in preventing\nthe spread of Covid due to illegal border crossings. Again, I’m not…",
  "data/reddit-changemyview/r/changemyview/comments/ovyyii/cmv_fast_fashion_is_the_cause_of_severe_negative.json": "Fast fashion brands like Shein, Zara, Topshop are major contributors to\nenvironmental problems progressing as a result of mass production of cheap, poor\nquality, disposable clothing. The fashion industry as a whole creates 80 billion\ngarments a year which is over 10 for each person on earth. The…",
  "data/reddit-changemyview/r/changemyview/comments/ovziw0/cmv_cnn_is_at_a_point_where_it_should_no_longer.json": "So let me start by saying CNN is not the only source guilty of this- the\nmajority of American news sources have the same problem I'm about to describe.\nBut over the last 4 years, CNN has become the worst, and I check over all the\nmajor sources on a daily basis (fox, CNN, NYT, Reuters, ABC, MSN, AP,…",
  "data/reddit-changemyview/r/changemyview/comments/ow1amu/cmv_christianity_and_all_its_branches_have.json": "Yeah, pretty much the title. I feel religion really but Christianity in\nparticular has created just large amounts of close minded people who take their\nbible as fact. If you have something they disagree with and they can find\nsomething in the bible that backs them up theres no changing their mind. I…",
  "data/reddit-changemyview/r/changemyview/comments/ow1uq2/cmv_not_revealing_transgender_status_regardless.json": "Inspired by an argument made with a user on here.\n\n\n\nLet's completely disregard the fact that currently I don't believe a surgically\nconstructed sex organ is unidentifiable compared to a \"natural\" one, but lets\ndisregard this and pretend there is no way to tell the difference at all.\n\n\n\nSo let's…",
  "data/reddit-changemyview/r/changemyview/comments/ow2n0t/cmv_jordan_peterson_is_the_most_willfully.json": "My interest in him started in 2016 when I saw headline after headline likening\nhim to Hitler, countless articles referring to him as racist, misogynist,\ntransphobic, homophobic, the list of epithets endless. \"This is going to be an\ninteresting read\" i thought to myself, and so I began watching full…",
  "data/reddit-changemyview/r/changemyview/comments/ow58xl/cmv_mental_health_awareness_usually_focuses_on.json": "Pretty much what it says. Whenever I hear phrases like “raise awareness about\nmental health” or “taking care of mental health” and things of that nature, it\nfeels like they really only mean anxiety, stress, and mild depression (not\nintending to diminish these at all) Mental illnesses I feel like…",
  "data/reddit-changemyview/r/changemyview/comments/ow6eh8/cmv_the_vitriol_towards_simone_biles_is_complete.json": "Isn't it amazing how when it comes to masks, a large cross section of America\nclaims it causes mental distress. When it comes to mass shootings, a large cross\nsection of America will quickly point to the mental health status of the\nshooter....even if the shooter had no previously diagnosed…",
  "data/reddit-changemyview/r/changemyview/comments/owfwpy/cmv_many_people_who_support_diversity.json": "So firstly, notice the word \"many\" if my title, because this will obviously not\napply to everyone. But I do think it applies to many.\n\nI think many of the people you see who support concepts such as \"no human is\nillegal\" and \"no borders\" are hypocrites, and only believe this for countries\nfor which…",
  "data/reddit-changemyview/r/changemyview/comments/owhxzx/cmv_aliens_are_not_the_most_likely_explanation.json": "Since the USAF declassified a bunch of UFO reports and admitted that\nunidentified aerial phenomena are a real thing that the government knows about\nand tracks, I have listened to a veritable buttload of podcasts and read a bevy\nof articles on the subject. The thing that is so frustrating to me about…",
  "data/reddit-changemyview/r/changemyview/comments/owi1kf/cmv_its_understandable_that_the_church_of_jesus.json": "They have another book of scripture called the book of mormon, they have\nchurches and then temples that only faithful members can enter and believe that\nGod, Jesus christ and the holy spirit are three separate beings. There are many\nother things that are a part of their faith that are unique to it…",
  "data/reddit-changemyview/r/changemyview/comments/owl8q3/cmv_my_wife_shouldnt_get_the_2nd_dose_of_the.json": "The title already says most of it. We’re in early pregnancy and are trying to\ndecide if the missus should get her second dose of the Pfizer vaccine while\nshe’s still in the first trimester.\n\nWe’re UK based, are both working from home and not seeing many people socially\nat the moment and can continue…",
  "data/reddit-changemyview/r/changemyview/comments/owptbx/cmv_there_is_no_evidence_that_the_officer_who.json": "One of the top news stories on r/news [/r/news] right now is about an officer\nwho committed suicide last week\n[https://www.cnn.com/2021/08/02/politics/dc-metropolitan-police-officer-suicide-january-6-capitol-riot/index.html].\nThe CNN article gives no indication of motive but they heavily imply that…",
  "data/reddit-changemyview/r/changemyview/comments/owt3tc/cmv_if_naturopaths_chiropractors_and_osteopaths.json": "All three 'alternative' health practitioners utilise a combination of both\nwestern evidence based medicine and pseudoscience. If they only utilised proven\neffective therapies they would no longer practice pseudoscience.\n\nWithout these pseudoscience's their scope of practice would match that of…",
  "data/reddit-changemyview/r/changemyview/comments/owts1z/cmv_if_you_are_an_adult_male_living_alone_you.json": "I mean this is a pretty basic one so essentially what it says above. But my\nthree main reasons are the following:\n\n\n\nEasy to clean right after, soap is right there (urine while not actually sterile\nhas very low bacteria levels).\n\n\n\nNo \"missing\" because its right at crotch height\n\n\n\nSaves a ton of…",
  "data/reddit-changemyview/r/changemyview/comments/ox63re/cmv_it_doesnt_make_sense_to_compare_the_george.json": "I remember a few months ago there were a few posts on this sub about how the\nriots that followed the murder of George Floyd were worse than the January 6\nstorming of the U.S. Capitol. Usually, the logic went something like this, “Only\nfive people died in Capitol on January 6 and very little actual…",
  "data/reddit-changemyview/r/changemyview/comments/ox73e0/cmv_who_you_go_on_holiday_with_is_more_important.json": "Even if you go to your dream country, a lavish resort or a big vibrant city,\nyour company matters. Imagine going on holiday with a bunch of people who have a\nlist that includes everything they wish to do, but you disagree with it and\nwould rather roam around the place spontaneously (or vice versa).…",
  "data/reddit-changemyview/r/changemyview/comments/ox7mp8/cmv_we_should_not_allow_media_companies_to_run.json": "Here are the main reasons I believe this:\n\n 1. The current Presidential debate format is a joke and is an embarrassment to\n    our country. Participants should not be allowed to interrupt, participants\n    should not be asked more questions than another, and participants should not\n    be allowed to…",
  "data/reddit-changemyview/r/changemyview/comments/ox7og9/cmv_no_scrap_yard_or_buyer_should_be_allowed_to.json": "No scrap yard should be legally allowed to buy Catalytic converters without the\nscrapper providing ID and a vehicle title matching the Catalytic converter. Too\nmany people are getting their cars robbed of Cat converters which leads to\nexpensive repairs that can be $100s of dollars. It causes cars to…",
  "data/reddit-changemyview/r/changemyview/comments/ox8lj0/cmv_there_is_no_such_thing_as_mansplaining_people.json": "FYI I'm a male dude that almost everyday at work roll my eyes as people try to\nexplain to me something I already know / argue in a topic they don't have ANY\nknowledge at all even I'm being a specialist at (UX/UI/design).\n\nThus I realized that, even it probably happens more with women, it's…",
  "data/reddit-changemyview/r/changemyview/comments/oxa6cu/cmv_when_public_companies_are_convicted_of_crime.json": "Every time a company is issued a fine for criminal behavior, it's just accepted\nas the cost of doing business. Marginal profits are slightly diminished, or\nsometimes the fines are already anticipated and pre-allocated no differently\nthan a simple bribe. What's the point of having laws at all, if the…",
  "data/reddit-changemyview/r/changemyview/comments/oxabk3/cmv_i_shouldnt_have_to_wear_a_mask_if_im.json": "I shouldn't be expected to wear a mask if I'm vaccinated. I got my shots so I\ndidn't have to. I wore a mask under our state mask mandate. I played by the\nrules during the first year or so of the pandemic.\n\nClearly those who won't mask or get vaccinated don't care if they get sick.\nThey've shown that…",
  "data/reddit-changemyview/r/changemyview/comments/oxde88/cmv_removing_an_artist_from_music_festivals_youve.json": "(post uncensored for rhetorical effects as the subject matter pertains to it) So\nthis is directly in response to multiple festivals cancelling Dababy. Let me\nstart by saying, I don't care where you land ideological about his statements,\nthat's not the basis for my view. This is purely about charging…",
  "data/reddit-changemyview/r/changemyview/comments/oxf4hd/cmv_changing_homeless_people_to_unhoused_people.json": "I'm in college debate and just moved on to uni where it's aggressively liberal.\nOne of the things I've already been yelled at for is referring to homeless\npeople as such. They want me to say unhouse individuals or people without\nhousing. Which I found very semantic and nit-picky. The stated reason…",
  "data/reddit-changemyview/r/changemyview/comments/oxjabt/cmv_politicians_should_all_be_given_the_same.json": "So I’ve had this idea since I was a teenager - another recent cmv about\npolitical debates reminded me of it.\n\nIt’s pretty widely known that money buys a lot of elections. This doesn’t always\nmean that the richest candidate always wins, or that a shitty candidate with a\nlot of money will always do…",
  "data/reddit-changemyview/r/changemyview/comments/oxjr0k/cmv_if_reddit_is_going_to_ban_subs_like_rmgtow.json": "I understand why reddit would ban mgtow tbh, it was full of alt righters spewing\nhate. However mgtow2 was also banned which did not have that on any level at\nall. Regardless to my point, if reddit wants to ban these subs for being sexist\nor saying negative things about the other sex or whatever…",
  "data/reddit-changemyview/r/changemyview/comments/oxr10e/cmv_the_problem_isnt_that_lizard_people_are.json": "I've become aware of a fascinating conspiracy theory that Lizard People run\nvarious governments--the United States of America, etc.\n\nAlways, the operating assumption is that this is bad specifically because they\nare Lizard People. I find this close minded and offensive. We shouldn't be\nbiased…",
  "data/reddit-changemyview/r/changemyview/comments/oxruv5/cmv_the_amount_of_black_peoplesites_on_social.json": "I'm black myself. I follow a lot of what you'd call \"black twitter\". And\nfrankly, its disgusting to me how many sites are basically saying how wrong it\nis that DaBaby is getting booted from music festivals. They are citing freedom\nof speech, blah blah blah.\n\nThe fact that he went on a rant that was,…",
  "data/reddit-changemyview/r/changemyview/comments/oxw38p/cmv_nycs_vaccine_mandate_on_restaurants_gyms_is.json": "Governments enact laws in order to keep its citizens safe. In this case, the\ngovernment is justified in requiring vaccines in these settings in order to both\nstop the spread of covid overall and to protect patrons of these establishments.\n\nThere is an analogy to seatbelts. There are laws where you…",
  "data/reddit-changemyview/r/changemyview/comments/oy0u2v/cmv_driving_tests_should_be_required_every_2.json": "While old age alone is not a reason to revoke a person’s drivers license, those\nwith age-related physical and cognitive challenges such as slower reflexes or\nvision troubles pose a danger to the public and to themselves. As of right now\nin the United States, drivers are required to reapply for their…",
  "data/reddit-changemyview/r/changemyview/comments/oy2cxm/cmv_ubi_is_a_good_idea_and_should_be_implemented.json": "Before the industrial age, anyone could use their hands and feet and grow things\nor make things, sell them, trade them for food, etc. and live. However, the\nworld is changing fast, becoming exponentially more efficient and causing people\nto lose jobs, having no way to make a living. This is not…",
  "data/reddit-changemyview/r/changemyview/comments/oy33e4/cmv_video_games_should_not_restrict_people_from.json": "Honestly I saw a post about the Sims and someone killing the kids in their game\nso they could have more space and I thought it was funny. However I then found\nout that they removed kids dying after the first generation and replaced it with\nchild services taking the kid a way and all I could think is…",
  "data/reddit-changemyview/r/changemyview/comments/oy8oy6/cmv_if_the_government_wasnt_so_untrustworthy_we.json": "I keep seeing everyone beat on the other guy, like we created this situation for\nourselves. I understand there is the science and the push to get everyone\nvaccinated so we can ALL have a better life and get back to normal. However, I\ncan’t help but think that this is also the fault of governments…",
  "data/reddit-changemyview/r/changemyview/comments/oy8zsi/cmv_eviction_is_not_violence.json": "Video [https://twitter.com/TeamAOC/status/1422287825521844225?s=20]\n\nAOC claims that eviction is violence.\n\nI disagree. Can an eviction turn violent? Sure.\n\nHowever, removing someone from a property that they do no own is not an act of\nviolence. An eviction can be simple… a letter or verbal…",
  "data/reddit-changemyview/r/changemyview/comments/oyay4x/cmv_private_businesses_requiring_proof_of.json": "People really don’t have the right to complain about private businesses and\nstores requiring either a mask or proof of vaccination. Businesses helping\npromote vaccination by refusal of service to those who won’t wear a mask or\nprovide a vaccination card is a good step towards ending the pandemic. I…",
  "data/reddit-changemyview/r/changemyview/comments/oyhysw/cmv_no_one_should_be_canceled_for_a_past_mindset.json": "We shouldn't cancel first, but educate first. Seems like everyone would agree,\nright? Some examples here may skew liberal just because it's most familiar to me\npersonally—it's not my intent to make this a political argument, but rather the\ngeneral topic of instantaneous cancel…",
  "data/reddit-changemyview/r/changemyview/comments/oyk6lq/cmv_cultural_appropriation_is_not_a_thing_and_we.json": "Some will get auto-triggered but hear me out:\n\nHere's what I mean: I *constantly* see people trying to call out \"cultural\nappropriation\" without understanding what it really is, and acting as if they're\nthe \"defenders\" of whatever culture is supposed to be offended. It's typically\nsome SJW with…",
  "data/reddit-changemyview/r/changemyview/comments/oynfn0/cmv_companies_who_ask_to_receive_a_bailout_should.json": "To expand on my full idea, this stock held by the federal government becomes\nnon-transferable for some extended period of time, say 25yrs. For example, if GM\nwere to be bailed out right now for the same amount it has received\n($50,744,648,329) the federal government would own ~931,436,276 of the…",
  "data/reddit-changemyview/r/changemyview/comments/oyo3q6/cmv_love_is_a_decision.json": "I've been ruminating on the meaning of love here lately, and I've come to the\nconclusion that love is a decision you make every day to elevate someone or\nsomething above your own self in terms of importance.\n\nDiscussions with other folks has shown me how diverse the colloquial definitions\nof love…",
  "data/reddit-changemyview/r/changemyview/comments/oysc4o/cmv_i_am_right_to_be_cynical_about_democracys.json": "I am very, very, very cynical about democracy's prospects in the US. Every day\nthat passes feels like a checkmark on a countdown to the end of democracy. The\ndefense of democracy is, to me, the single most important issue of the time, bar\nnone. And I think that defense is... pathetic? Token? Less…",
  "data/reddit-changemyview/r/changemyview/comments/oysool/cmv_police_vehicles_should_not_be_allowed_to_be.json": "When police cars are black with dark lettering making it difficult to identify\nthe car, to me, it says that police are not there to prevent crime but to catch\npeople in the act of it. I have no issue with undercover police who are in\ncompletely unmarked vehicles, but a traffic cop sitting on the…",
  "data/reddit-changemyview/r/changemyview/comments/oz1r0w/cmv_democracy_doesnt_work_because_people_are.json": "Just wanna preface this by saying I don't want this to be a political debate of\nany kind. More of just a general discussion about the concept of democracy.\nTheoretically, a misinformed or ignorant public can do massive damage to itself\nand others by voting in a government or administration that is…",
  "data/reddit-changemyview/r/changemyview/comments/oz8dvj/cmv_almost_all_our_decisions_involve_some.json": "Update: a better title would be \"some degree of manipulation doesn't make a\ndecision non consensual\"\n\nWhenever I see people on the internet saying something like \"oh, but (he/she)\nwas in a position of power, so it wasn't really consensual\" whether that's about\nsex or some other decision doesn't…",
  "data/reddit-changemyview/r/changemyview/comments/ozalh9/cmv_hyperloops_or_other_sort_of_tracked.json": "I do not believe any sort of ground based transportation (railed or tubed) will\ntake the place of flying in the US any time soon (next century or so).\n\nI am specifying the US and I am basing that off of the struggles we face with\nsmaller projects. Politics, environmental studies, unions &amp; land…",
  "data/reddit-changemyview/r/changemyview/comments/ozczlt/cmv_claw_machines_and_similar_should_disclose_odds.json": "I had this thought yesterday after seeing a bunch of these machines, and want to\nknow if there's any reason why they shouldn't disclose odds. IIRC claw machines\nwork by only grabbing the toy at full strength a fraction of the time to ensure\nthat the machine earns a profit. If, for example, the…",
  "data/reddit-changemyview/r/changemyview/comments/ozjrix/cmv_police_turning_of_body_camera_should_be.json": "If it could be shown that the video or audio of an officer’s body cam was turned\noff manually especially during an active scene with injuries/death, the first\nviolation should be a strict no pay suspension for many months. Second time it\nshould be automatic termination and a charge of tampering with…",
  "data/reddit-changemyview/r/changemyview/comments/oztnxg/cmv_the_extended_policy_that_landlord_cant_evict.json": "I would be fine if this was for one month, or two months, but this policy has\ngone on too long. I personally am not a landlord and only own one home, but I\nfeel if you own another property, e.g. you payed for it, then you should be able\nto control who lives there.\n\nIf a tenant does not pay rent,…",
  "data/reddit-changemyview/r/changemyview/comments/ozttfn/cmv_guns_are_not_the_cause_of_crime.json": "So I believe that guns by themselves do not make places worse. I do not think\nthey make it more dangerous.\n\nI think guns on top of other social and health issues becomes a bigger problem.\nGuns do not make a problem on their own though.\n\nLet’s look at the most dangerous US cities: Detroit, St. Louis,…",
  "data/reddit-changemyview/r/changemyview/comments/ozwh82/cmv_there_should_be_an_age_limit_after_which_you.json": "It is great seeing kids as young as 12 participating and winning in the\nOlympics, but I believe that it shouldn't be allowed. Olympics are a lot of\npressure and it might not be good for them to go against way more experienced\nathletes.\n\nI have seen countries where the atheletes need to train for…",
  "data/reddit-changemyview/r/changemyview/comments/p00954/cmv_theres_nothing_wrong_or_unhealthy_with_living.json": "I suffer from high functioning autism and while there are people out in the\nworld with my disability who can make friends and socialize, not everyone wants\nto or cares.\n\nBasically I’m an introverted person and I’m not interested in people. When I\ntried to force myself to socialize I came across as…",
  "data/reddit-changemyview/r/changemyview/comments/p0139j/cmv_people_shouldnt_consider_religion_as_part_of.json": "So, I am probably going to get downvoted for this, but I genuinely don't\nunderstand this whole concept.\n\nWhy would anybody consider religion to be part of their identity? It is a set of\nclaims about the universe, spirituality, ethics, God, supernatural elements etc.\n\nWhy would anybody make a bunch…",
  "data/reddit-changemyview/r/changemyview/comments/p01ajm/cmv_most_people_in_our_society_still_look_down_on.json": "It is my opinion that most people in society still look down on others who\nsuffer from mental illness(es)... while they're alive. But if someone dies by\nsuicide because of their mental illness(es), only then do most people in society\nsuddenly and sincerely feel bad.\n\nTo elaborate further on my view,…",
  "data/reddit-changemyview/r/changemyview/comments/p052ob/cmv_collecting_unemployment_and_bypassing.json": "From my understanding, unemployment exists to prevent a tidal wave of job loss\nand keep money flowing through our society.\n\nBut it’s also an insurance policy. That people pay for.\n\nIf I had a 2021 Mercedes-Benz, it got totaled due to natural events that were\ncovered in my contract it would be…",
  "data/reddit-changemyview/r/changemyview/comments/p06twi/cmv_i_dont_think_its_always_justified_to_cancel.json": "I'll start with Kevin Hart. In 2018, when Kevin Hart was set to host the Oscars,\na series of homophobic tweets from 2009-2011 resurfaced, which eventually caused\nhim to step down. I don't know if this was justified. He made those comments 7-9\nyears prior and he may very well have changed. Was their…",
  "data/reddit-changemyview/r/changemyview/comments/p0aa72/cmv_its_the_retail_restaurant_and_fast_food.json": "My opinion here goes both ways: People that collected PUA while moving back in\nwith their parents, who used that money to better themselves somehow, and now no\nlonger need to work retail/fast food/in a restaurant, and people who are\nstraight up hoarding all of the money they got from PUA, and…",
  "data/reddit-changemyview/r/changemyview/comments/p0dx3w/cmv_cannabis_should_be_legalized.json": "Okay a classic: I am aware that this is a popular opinion. I want to use this\npost, to maybe get a different perspective on things, because for me it’s very\nclear that: cannabis should be legalized, especially if alcohol and Cigarettes\nare so fetishized. Or everything should be banned.\n\nHere are the…",
  "data/reddit-changemyview/r/changemyview/comments/p0e1le/cmv_attempts_by_americaeurope_to_instill.json": "The 21st century has been defined by the catastrophic failure of Western powers\nto spread democracy. The invasion of Iraq and the interventions in Libya used\nvague and poorly defined notions of freedom to engage in the destruction of\nstate apparatuses, leading to outpourings of sectarian…",
  "data/reddit-changemyview/r/changemyview/comments/p0gce8/cmv_the_death_penalty_should_be_abolished_for.json": "View is pretty simple - I believe that no citizen should be subject at birth to\nthe death penalty, but those who choose to accept state authority &\nresponsibility ought to be held to a higher standard. By that, I mean that they\nshould not only receive the death penalty for capital crimes, but a…",
  "data/reddit-changemyview/r/changemyview/comments/p0gwds/cmv_animal_cruelty_negligence_and_especially.json": "I've seen videos of animals either being neglected, abused, and sometimes even\ntortured. It's awful. I can't believe that the punishment is slim to nothing.\nThere was a video of a man torturing animals and all he got was 2 months of jail\ntime.\n\nI still can't believe that you can get more jail time…",
  "data/reddit-changemyview/r/changemyview/comments/p0ify4/cmv_any_religion_that_touts_its_leaders_as.json": "So many people since Covid for example, are talking about how they “prayed to\ngod, who told them they shouldn’t get the vaccine”\n\nCorrect me if I’m wrong, but aren’t bishops, elders, cardinals and priests\n“special” because they talk to god? Why are they so special if everyone does it?\nWhy do we need…",
  "data/reddit-changemyview/r/changemyview/comments/p0lldy/cmv_the_atomic_bombings_were_the_correct_move_and.json": "The bombings were from anyway you look at it, morally, or militarily, the right\nmove,\n\nFrom a moral standpoint, it is better to kill 200k Japanese than let 2 million\nChinese die. The Japanese were committing war crimes on a massive scale, and\neven if you use the low end estimates, it’s still…",
  "data/reddit-changemyview/r/changemyview/comments/p0s7c5/cmv_i_am_the_only_being_in_the_universe.json": "Lately it has dawned on me that I am the only thing that might actually exist.\nEveryone else is quite possibly just a figment of my imagination. If I die\ntomorrow, the whole universe will end with me.\n\nNo one has ever been able to change my view about this - I have not seen one\nthing that would make…",
  "data/reddit-changemyview/r/changemyview/comments/p0svp1/cmv_universal_health_care_can_and_should_be.json": "I really want to hear a logical counterpoint to this. It just seems so practical\nand basic. 99% of the industrialized world has implemented some form of it.\n\nI have lived a good portion of my life outside the US in both Germany and Japan\n(countries with Universal health care) and have found it…",
  "data/reddit-changemyview/r/changemyview/comments/p0ujg4/cmv_simone_biles_opting_out_of_the_all_around.json": "I’ll start by saying that I understand why she did it, and I support it.\nGymnastics is a very dangerous sport, and being in the wrong mindset can be\nlethal. On top of that, judges underscoring her difficulty must be so\ndemoralizing and would be a drain on any person. Were I in her situation, I…",
  "data/reddit-changemyview/r/changemyview/comments/p0y5i6/cmv_employment_gaps_shouldnt_be_looked_so_down.json": "I’d understand if you had a 2yr-6yr employment gap that would literally have\nsome explaining to do and if you are in no position to not be working I don’t\nthink anyone should be doing that unless you became super successful or found\nways of never having to work again and then suddenly needed…",
  "data/reddit-changemyview/r/changemyview/comments/p12pwc/cmv_fat_acceptance_is_the_same_as_enabling_an.json": "I am an alcoholic in recovery (almost 6 years sober) and one thing that really\nsets me off is seeing articles and posts about how overweight people need to be\nbetter accommodated/catered to.\n\nWhile I consider myself to be an empathetic person and I would never be vocally\ncruel to anyone, this really…",
  "data/reddit-changemyview/r/changemyview/comments/p16f0e/cmv_apple_is_building_the_very_1984esque.json": "With the recent Apple announcement of uploading encrypted hashes of all of your\npictures to check for confirmed (CSAM) child pornography and reporting\n„affected“ users to authorities; Apple is building the very foundation of\ninternational surveillance they swore to combat.\n\nMy view: This will cause…",
  "data/reddit-changemyview/r/changemyview/comments/p18atk/cmv_the_be_the_bigger_person_mentality_is_stupid.json": "I can't tell y'all the amount of posts I read on Reddit where someone is asking\nif they were in the wrong for being cruel towards their abusers (especially\nvictims of child abuse) and being told they were, and to \"be the bigger person\".\n\nNot only is that mentality a roundabout way of saying, \"you…",
  "data/reddit-changemyview/r/changemyview/comments/p18gnp/cmv_you_can_support_body_positivity_and_still_be.json": "It’s really frustrating to me seeing online communities and mainstream media\npushing a narrative that you can still be healthy and obese when that’s\ncompletely false. When you’re overweight (but more so when you’re obese) fat\nbuilds up around your organs such as your heart and lungs which create…",
  "data/reddit-changemyview/r/changemyview/comments/p1bfmy/cmv_the_if_the_roles_were_reversed_argument_is_a.json": "let’s say if a black woman calls a white woman “Stacy” if their name isn’t such\nsimply bc of their skin color is equivalent to a white woman calling a black\nwoman “kisha” bc their skin. And I just think saying it’s not a valid argument\nis just to defect the idea, bc people can’t answer it. How can u…",
  "data/reddit-changemyview/r/changemyview/comments/p1emzb/cmv_the_wealthy_are_parasites_who_hoard_wealth.json": "I see how much the wealthy have broken down society and turned us into cold\nhustling sociopaths to better work for them and to kill ourselves or be killed\nwhen we become worthless in their eyes. I fully believe stealing from the rich\nisn't morally wrong... They're hoarding wealth they earned by…",
  "data/reddit-changemyview/r/changemyview/comments/p1if07/cmv_americans_fetishize_a_shitty_constitution.json": "I'm not even going to talk about the electoral college or senate representation\nbecause opinions on their reform are popular.\n\nEvery fucking year, children in America are indoctrinated that their country has\nthe greatest political system ever crafted by genius statesmen. When in reality,\nthose…",
  "data/reddit-changemyview/r/changemyview/comments/p1jn77/cmv_the_government_should_not_just_be_focused_on.json": "First of all, I'm not saying we shouldn't \"go green\" or try to stop our\ndestruction of the environment, but the ship to \"stop before irreversible\ndamage\" has long sailed.\n\nWe can't just suck the CO2 and undo everything, the change is already underway\nand no human intervention can stop that.\n\nInstead…",
  "data/reddit-changemyview/r/changemyview/comments/p1rok6/cmv_theres_a_lot_to_proud_about_in_us_history.json": "I've been hearing a lot of individuals (especially young people) who have grown\na sense of hatred and shame for this country based on the dark parts of its\nhistory and what they're up to currently. However, I feel like not as much\nacknowledgement has been put towards the countless positive things…",
  "data/reddit-changemyview/r/changemyview/comments/p1tnqi/cmv_there_is_no_good_reason_for_movies_and_tv.json": "You know the scene. A main character is pulled out of the water. Are they dead?\nOMG. Another main character starts doing chest compressions right away, and\nsuddenly the person is coughing up water. They're OK. Hurray!\n\nOf course, that's not how it works. The person administering CPR didn't…",
  "data/reddit-changemyview/r/changemyview/comments/p1u1fj/cmv_going_vegan_is_unsustainable_and_dangerous_to.json": "I think the entire world (less specific communities) eats too much meat. Science\nsupports that fact that certain amino acids only available in meat (with the\ntechnology we have now) are necessary for neurological development. Even bone\nbroth soup a few times a year is plenty for a grown adult.…",
  "data/reddit-changemyview/r/changemyview/comments/p21oro/cmv_the_top_100_billionaires_could_maybe_pay_for.json": "The 2021 budget for the US is about 6.8 trillion. The top 100 billionaire range\nfrom ~$130B to $18B. On a rough average let's say $75B x 100 is $7.5T. So even\nif we took 100% of there wealth we may be able to solve our problems for a year.\nMost of this isn't even cash, it is net worth based of the…",
  "data/reddit-changemyview/r/changemyview/comments/p223ky/cmv_africanamericans_shouldnt_get_a_pass_for.json": "It is well-documented that 20th-century medical experiments in the US used\nAfrican-Americans as guinea pigs in the Tuskegee syphilis study while telling\nthem falsely that they were getting important medicine. This has been broadly\ncited as a reason that African-Americans do not trust the government…",
  "data/reddit-changemyview/r/changemyview/comments/p24vjr/cmv_all_of_this_vaccine_hesitancy_is_really_just.json": "Whether it’s because your candidate lost an election, or more simply because\nit’s “magnetic”, or because you view the current administration as evil, or it’s\ngoing to ruin our country, or it’s not safe because it’s “untested” or whatever\nlame reason is still yet to be heard, the real reason for the…",
  "data/reddit-changemyview/r/changemyview/comments/p2d796/cmv_the_average_american_would_lose_to_a_goose_in.json": "Hi all, after reading this link\n[https://www.google.com/amp/s/www.thelondoneconomic.com/lifestyle/eight-per-cent-of-americans-think-they-could-beat-an-elephant-in-a-fight-269759/%3famp]\nI put a lot of thought into the average American’s fighting ability unarmed and\nfound them… wanting. Now I know…",
  "data/reddit-changemyview/r/changemyview/comments/p2epoz/cmv_womens_safety_advice_isnt_victim_shaming.json": "I see a lot of posts that are like \"don't tell women to \"insert common safety\nprecaution at night\", tell men not to rape\" and i AGREE, its fucked up 100% we\nhave to do this\n\nBut it is fucked up times we live in, so advising women to take ear phones out\nor to have a emergency contact dialed up or to…",
  "data/reddit-changemyview/r/changemyview/comments/p2fy1m/cmv_covid_will_become_endemic_and_thus_masks.json": "We all made sacrifices over the course of 2020 and the first part of 2021 as a\nresult of the global pandemic. I struggled a great deal, but was able to pull\nthrough because there was a light at the end of the tunnel: vaccines and a\nreturn to normal life. I wore my mask. I stayed isolated to the…",
  "data/reddit-changemyview/r/changemyview/comments/p2kr1z/cmv_useless_higher_level_math_classes_calc_trig.json": "Grades K-12 are intended to teach students the basic information that most\npeople should know by adulthood. It is agreed upon that certain subjects be\nrequired in order to graduate. This is to ensure students are well educated on\nthings a school board has deemed important like: their country’s…",
  "data/reddit-changemyview/r/changemyview/comments/p2nlem/cmv_having_a_gun_in_the_home_does_not_make_me.json": "More broadly, I feel like many statistics are reduced to uselessness when\napplied on an individual level.\n\nIt is often said that having a gun in the home doubles, triples, etc your\nlikelihood of being a victim of gun violence.\n\nThis sort of thing is not useful information when applied to…",
  "data/reddit-changemyview/r/changemyview/comments/p2uujh/cmv_the_concept_of_men_having_to_be_the_pursuer.json": "Its forces men and women to form life and morals around a societal idea that is\ndesigned to force people into roles. If you want to be approached by anyone,\nyou've got to play this Alpha Male Dance, and force people into being\ninterested. I've talked to many a person, after being friends with them…",
  "data/reddit-changemyview/r/changemyview/comments/p2w05b/cmv_punishing_a_child_for_swearing_is_a_stupid.json": "NOTE: I’m not including slurs, as those are tied to trauma and are a completely\ndifferent league from “Fuck”, “Shit”, “Ass”, etc as they were made to demean\ncertain demographics.\n\nEdit: Perhaps the better title might be “The current social standards regarding\nswearing need a serious overhaul, as…",
  "data/reddit-changemyview/r/changemyview/comments/p2z5zj/cmv_the_idea_of_forced_diversity_doesnt_make_much.json": "As far as media creation goes, the goal is generally to be appealing to\npotential audiences (viewers, readers, players, etc.), so it’s pretty much\nimpossible to point at examples of “forced diversity” as uniquely cynical.\nCreative choices are either all legitimate or all “forced”. Even if someone…",
  "data/reddit-changemyview/r/changemyview/comments/p33u1x/cmv_if_my_body_my_choice_alone_is_an_insufficient.json": "I am not anti-vax (I had both) and I am not pro-life, but I have always felt\nthat the 'my body, my choice - and the buck stops there' argument was weak ass.\n\nThere are many good arguments on the pro-choice side, I just don't think this is\none of them.\n\nIf you think the bodily-autonomy argument is…",
  "data/reddit-changemyview/r/changemyview/comments/p35qki/cmv_businesses_struggling_to_hire_minimum_wage.json": "A true capitalist economy creates wage growth through very, very low\nunemployment. When businesses struggle to hire or retain employees because there\nare better options elsewhere, then their only options are to make the job more\nattractive through wages or incentives, or go out of business.\n\nIn our…",
  "data/reddit-changemyview/r/changemyview/comments/p39qfd/cmv_parents_who_believe_their_children_owe_them.json": "It was the household policy I grew up in, my mother raise us(me and my little\nbro and sis) by herself. She believes that since she raised us we owe it to her.\nI know others have lived the same thing. I believe being a parent is a selfish\nchoice (I am a dad of two girls). And therefore it is the job…",
  "data/reddit-changemyview/r/changemyview/comments/p3eabx/cmv_nuclear_is_the_way_forward.json": "I believe that we need to start investing more resources into the nuclear energy\nindustry very soon if we want to have any chance at stopping climate change. It\nis the only energy source we have right now that is reliable AND carbon neutral.\nIt may not be perfect as it produces nuclear waste which…",
  "data/reddit-changemyview/r/changemyview/comments/p3h4uz/cmv_the_average_us_american_is_uneducated.json": "First off, I don't blame them, it seems that their situation is deliberately\nexternally imposed upon them. But the objective reality is that the average\nAmerican person lacks a basic critical understanding of history, politics,\ngeography, physical and natural sciences, philosophy, and language.\n\nI…",
  "data/reddit-changemyview/r/changemyview/comments/p3h6pz/cmv_the_climate_change_movement_has_been_greatly.json": "In a nutshell, I think that the campaigning of climate change action in\nconjunction with other leftist policy has been extremely detrimental to the\nmovement. I shall speak from the perspective of an Australian, though I'm sure\nthis is analogous to other national experiences. In Australia, the third…",
  "data/reddit-changemyview/r/changemyview/comments/p3im6q/cmv_hiring_poc_to_play_white_characters_is_just.json": "The Netflix series for Witcher hired Anya Chalotra to play Yennefer. She is from\nEngland but she is half Indian and POC. As well as actress Anna Schaffer who\nplays Triss, from Germany but also POC.\n\nBoth characters originally are from a slavic descent and are not described as\nPOC in the books and…",
  "data/reddit-changemyview/r/changemyview/comments/p3uhuo/cmv_batmans_recruitment_of_robin_as_a_fellow.json": "In the Batman comics, Robin (a role that is taken on by various individuals) is\na youngster, sometimes even a pre-teen, but more recently between 13-15.\n\nHere is another Redditor's informed opinion on the ages of Batman characters,\nincluding…",
  "data/reddit-changemyview/r/changemyview/comments/p3zkfu/cmv_people_who_post_photos_of_their_children_on.json": "Children and babies don’t/rarely get the chance to tell their parents and family\nmembers that they don’t want their photos taken or that they don’t want them\nposted online.\n\nI’ve heard people say that “It’s for the memories.” But photos getting posted\nonline don’t disappear and what if your child…",
  "data/reddit-changemyview/r/changemyview/comments/p3znl8/cmv_the_us_government_should_waive_any_visa.json": "Afghanistan is a lost cause and countless thousands of afghans have grown up in\na democracy and are going to be plunged into a handmaid's tale dystopia very\nsoon. I met an all girls law school team of afghan women at an event a few years\nago, and I can't imagine what they must be going through right…",
  "data/reddit-changemyview/r/changemyview/comments/p405gl/cmv_born_in_the_wrong_body_doesnt_make_sense.json": "I've seen the following argument a few times now: some evidence is provided to\ndemonstrate that trans people's brains are, on average, more similar to the\ngender they identify with than you'd expect from an average member of their\ngenetic sex. This illustrates they're on to something when they…",
  "data/reddit-changemyview/r/changemyview/comments/p42z45/cmv_there_is_no_valid_reason_for_supporting.json": "There are countless flawed arguments used by people who support maintaining or\nbringing back the death penalty, but almost all of these fall apart upon closer\nscrutiny.\n\n\"Screw them, they deserve it!\"\n\nHumans are flawed and make mistakes, and there is no way to design a 100%\nfullproof justice…",
  "data/reddit-changemyview/r/changemyview/comments/p48g7e/cmv_the_united_states_senate_is_going_to_cause.json": "I personally do not see a use for the Senate. In theory, the senators are\nsupposed to enact the interests of the state but in reality the senators pander\nto their political party. Representation is based entirely on States and not\npopulation so we end up having a backwards system where less people…",
  "data/reddit-changemyview/r/changemyview/comments/p4bjib/cmv_if_americans_dont_want_to_get_vaccinated_we.json": "We could give people a warning, a last chance to get vaccinated, before sending\nthe inoculation abroad. After that, resources will not be wasted on them. These\nstories of thousands of vaccines going bad because people refuse to get\nvaccinated demonstrates a mismatch in supply and demand. Since a…",
  "data/reddit-changemyview/r/changemyview/comments/p4bni0/cmv_dr_anthony_fauci_is_a_reliable_and.json": "I realize that many of you may need to take a devil's advocate stance on this,\nbut with so much hatred towards him online from the political right I just have\nto try and understand where the anger comes from. I've seen him labeled a\ncriminal, liar, and a terrorist for seemingly no reason.\n\nI…",
  "data/reddit-changemyview/r/changemyview/comments/p4dk6p/cmv_if_a_grilled_cheese_sandwich_has_anything.json": "I see people all the time call things grilled cheese that aren't and I don't\nunderstand it. How the hell is a sandwich with ham, turkey or even brisket a\ngrilled cheese when the primary ingredients are not cheese. Cheese cannot be an\nafter thought or an accent in something something called \"grilled…",
  "data/reddit-changemyview/r/changemyview/comments/p4iedx/cmv_conservatism_and_many_rightwing_beliefs_are.json": "By fear I mean all the fear-mongering rhetoric right-wing speakers use to\npresent an idea. It's always in opposition to something, always presented as a\ndefense of our values which the left, blacks, jews or any other minority want to\n\"take away\".\n\nBy primary instincts, I mean judging and making…",
  "data/reddit-changemyview/r/changemyview/comments/p4lgzp/cmv_with_the_exception_of_medical_conditions_or.json": "I’ve been seeing countless posts by people who choose not to be vaccinated for\nmyriad reasons. The thing they all have in common is the lack of reasonable\njudgement. There's seemingly this denialism of how disruptive the pandemic has\nbeen for everyone on the planet and yet the refusal to do their…",
  "data/reddit-changemyview/r/changemyview/comments/p4lthd/cmv_interpretation_of_back_the_blue_or_the_thin.json": "I don’t think it means that they have each other’s back because job is hard\n(more jobs are dangerous), they are big community that wants close knit\ncommunity, hard job that needs support and all that other good jazz like every\nother profession has. I literally think it is about protecting bad apples…",
  "data/reddit-changemyview/r/changemyview/comments/p4owhc/cmv_nonprofit_institutions_should_have_their.json": "Churches are included in this.\n\nMy line of thought is that too many incidents have occurred, especially in\nchurches, where people have put money into these institutions expecting it to be\nspent for noble purposes only for it to be embezzled into the preacher’s pocket.\n\nHaving every cent you put in…",
  "data/reddit-changemyview/r/changemyview/comments/p4p2ou/cmv_banning_incel_subreddits_is_a_bad_idea.json": "The people on those subs are simply mentally ill. Banning their communities\nsimply moves a majority of those users to more fringe websites or message boards\nwhere those toxic ideals can be echoed in an even more isolated environment. I\nthink most of the “incel subs” tend to stay in their own bubble…",
  "data/reddit-changemyview/r/changemyview/comments/p4s3ju/cmv_prolifers_and_prochoicers_both_want_abortions.json": "There's this notion that pro-lifers want abortion reduced to almost zero, while\npro-choicers prefer that there continue to be around 1 million abortions per\nyear in America every year. But as I see it, both sides actually want abortion\nto be reduced to near zero.\n\nPro-lifers, of course, want…",
  "data/reddit-changemyview/r/changemyview/comments/p4zuwk/cmv_the_united_states_abandonment_of_afghanistan.json": "I believe that in abandoning Afghanistan, the United States is doing an immoral\ninjustice to the Afghan people. I will go over the reasons I see most often\ncited as a justification for pulling out and explain why each of them is wrong\nin my opinion. 1. The US shouldn’t have been in Afghanistan in…",
  "data/reddit-changemyview/r/changemyview/comments/p4zve4/cmv_latinos_will_be_grouped_in_with_white_people.json": "And Greeks and the Irish. It’s a known fact that throughout history certain\ngroups have been assimilated into white American culture. The most prominent\nbeing the Italians. Italian immigration to the US was a huge cultural event that\nstarted in the 19th century. Millions of them would move to…",
  "data/reddit-changemyview/r/changemyview/comments/p53er2/cmv_the_government_should_pay_interest_on_our_tax.json": "Most Americans are familiar with the process by which you overpay your taxes\nthroughout the year from each paycheck, and then come tax filing time, you\nreceive a refund from the government equal to the amount you overpaid.\n\nBut if you think about it, all you did was loan your money to the government…",
  "data/reddit-changemyview/r/changemyview/comments/p540hv/cmv_women_contribute_to_toxic_masculinity_and.json": "Like the title says you always see the feminists talk about how patriarchy hurts\nmen just as much as women, which I agree with only powerful rich men, usually\npoliticians truly thrived for most of human history. However nowadays we have\nmade many strives towards egalitarianism in the west, but far…",
  "data/reddit-changemyview/r/changemyview/comments/p591nj/cmv_the_offensiveness_of_slurs_should_be_solely.json": "Me and my friends were discussing about how some celebrity said a slur within a\nanother persons song at 16, she apologised at 18.\n\nMy friends stance was “She should have known better at 16, she knew it was\nracist, she is racist for saying it and only cares know because she is getting\ncancelled”\n\nMy…",
  "data/reddit-changemyview/r/changemyview/comments/p5dfib/cmv_extremely_loud_vehicles_such_as_motorcycles.json": "When choosing a vehicle to purchase or when choosing how to customize your\nvehicle, you have options. You could buy an old 1990s sedan and replace the\nancient FM radio with a Bluetooth receiver, you could buy a reliable SUV and\ninstall spill-proof seat covers for your messy kids, or you could buy a…",
  "data/reddit-changemyview/r/changemyview/comments/p5hf32/cmv_new_nuclear_reactors_are_not_going_to_form_a.json": "Because this is a topic with a lot of really fervent advocates whose attention\nI'm likely to draw, let me clarify some things about what I'm not saying:\n\n 1. I am espousing a PREDICTIVE view, not a normative view. I am not arguing\n    whether nuclear power is good or bad, necessary or unnecessary.\n\n…",
  "data/reddit-changemyview/r/changemyview/comments/p5jocr/cmv_the_concept_of_islamophobia_misses_the_bigger.json": "After watching people leave their cars with the keys on in a traffic jam and\nliterally cling on to an airplane to escape the ISLAMIC Emirate of Afghanistan,\nthere’s no way to not see that Islam is not a religion of peace.\n\nLet’s do a quick history exercise looking at religions with major…",
  "data/reddit-changemyview/r/changemyview/comments/p5n8uk/cmv_it_is_not_ok_to_make_posts_making_fun_of.json": "I understand that they are the ones causing the continuous spread of covid and\ncomedy is an outlet. As someone with a younger brother who is against the\nvaccine it bothers me to see posts celebrating the death of victims. He has been\nfor lack of a better term “brainwashed” by the media and my family…",
  "data/reddit-changemyview/r/changemyview/comments/p5pga8/cmv_the_rise_of_onlyfans_is_an_overall_net.json": "I am genuinely looking for new perspectives on this, because I have thought long\nand hard about my position but my opinion on this still seems to be at odds a\nbit with several of my close friends.\n\nTo begin, I am not anti-sex work. I technically have a job in the sex industry-\nmy last year of…",
  "data/reddit-changemyview/r/changemyview/comments/p5xihg/cmv_pulling_out_of_afghanistan_was_the_right.json": "I am 100% convinced that Biden made the correct decision. This is a war that has\nbeen going on for 20 years, and for what? Billions of dollars and thousands of\nlives wasted. I'm so tired of hearing the same old excuses about why we (the\nU.S.) needed to stay. Yes, of course, entering the war was a…",
  "data/reddit-changemyview/r/changemyview/comments/p5yzxn/cmv_it_is_justifiable_to_include_religion_of_most.json": "UPDATE: I have changed my view.\n\nI have seen in one post that the Taliban group in Afghanistan should not be\nlabelled as 'Muslim' terrorists because it will further endanger and stigmatize\nthe good Islam people. The religion should be left out of the conversation, says\none citizen.\n\nI do think that…",
  "data/reddit-changemyview/r/changemyview/comments/p60fm0/cmv_it_is_as_bad_for_a_girl_to_slap_a_guy_as_the.json": "Unfortunately, society still clings on to sexist views. One of which is that it\nis not that bad for a girl to slap a guy, but it is terrible if a guy slaps a\ngirl.\n\nViolence is wrong. Regardless of gender. Any other view is sexist.\n\nEven though guys are stronger, this advantage is offset by the fact…",
  "data/reddit-changemyview/r/changemyview/comments/p62vmz/cmv_pedophilic_fanfiction_and_fanart_shouldnt_be.json": "I'm in online spaces where this is a hot button issue and everyone is very vocal\nabout their opinions.\n\nKey point: When I say pedophilic fanfiction and fanart, I specifically mean that\nwhich includes an adult having sex with a minor who is below the age of 16. \nThis number is near-universally…",
  "data/reddit-changemyview/r/changemyview/comments/p6f14k/cmv_there_is_literally_nothing_racial_whatsoever.json": "The people - people of all races, colors, creeds, economic statuses, education\nlevels, and morals - who pay their share of taxes do so because that is what\nthey need to do in order to financially secure all of the benefits that being a\ncitizen of the USA provides.\n\nWhen you pay taxes, that means…",
  "data/reddit-changemyview/r/changemyview/comments/p6ifnt/cmv_choosing_a_career_you_dont_enjoy_just_for_the.json": "Our interests don’t always align with good paying jobs. If yours do, good for\nyou, but you’re an exception. That’s why there are so many starving musicians\nand freelance writers. So many people decide to choose a job that they enjoy\nwhen in reality, the job they enjoy is unrealistic and pays like…",
  "data/reddit-changemyview/r/changemyview/comments/p6r7ot/cmv_giving_babies_soda_is_child_abuse.json": "Okay now that I hooked you with the most blatant point time for the argument.\n\nBabies has 1-2 cups of blood in their body, you have to be a complete moron\n(which the biggest loser sized parents are to get that big in the first place)\nto put soda or sweet ice tea in the babies sippy cup. That is pure…",
  "data/reddit-changemyview/r/changemyview/comments/p6uqks/cmvtheres_nothing_wrong_with_not_wanting_to.json": "I like being introverted and by myself. I feel like whenever someone tells me\nthey’re worried about my lack of friendships it’s unhealthy.\n\nBut what if I don’t want friends? Back in college I kind of realized I was an\nannoying person and now that I’m older, I’m more laidback but I don’t have…",
  "data/reddit-changemyview/r/changemyview/comments/p6wivp/cmv_there_should_be_a_separation_between_state.json": "Just as in the past, and specifically in this country to ensure religious\nfreedoms, there was a clear and distinct separation between church and state,\nnow there needs to be an updated view on this to ensure separation between state\nand private, corporate interests.\n\nIt's no conspiracy to state that…",
  "data/reddit-changemyview/r/changemyview/comments/p6y01i/cmv_leaving_afghanistan_was_always_going_to_be_a.json": " 1. I know the videos of people clinging to planes is tragic and that the\n    Taliban is evil but the fact of the matter is that out departure from\n    Afghanistan was always going to be chaotic and we cant get out everyone who\n    wants to flee the country. We could have waited another 6 moths and…",
  "data/reddit-changemyview/r/changemyview/comments/p70z1n/cmv_leashes_for_small_children_are_in_general_a.json": "Most of us have seen them — a toddler wearing a backpack with a leash attached\nto it, which is either being held by their guardian, or, better yet, attached to\na belt around the guardian's waist. And I think most of us are aware of the\nnegative reactions a lot of people give to these leashes,…",
  "data/reddit-changemyview/r/changemyview/comments/p78lqa/cmv_cultural_appropriation_is_not_wrong_because.json": "I wanted to make this post after seeing a woman on twitter basically say that a\nwhite woman shouldn't have made a cookbook about noodles and dumplings because\nshe was not Asian. This weirded me out because from my perspective, I didn't do\nanything to create my cultures food, so I have no greater…",
  "data/reddit-changemyview/r/changemyview/comments/p7eqst/cmv_pedophilia_should_be_treated_as_a_mental.json": "Let me first clarify that I am in no way trying to justify the sexual assault of\nchildren. It is, of course, disgusting and immoral. Having said that, I feel\nthat my argument is primarily predicated upon my belief that treating pedophilia\nas a mental illness will lead to a decrease in the number of…",
  "data/reddit-changemyview/r/changemyview/comments/p7odzz/cmv_implying_that_breastfeeding_promotion_shames.json": "We are allowed to promote and encourage choices that can lead us to live\nhealthier lives. If you choose not to do these things, it is fine, that's your\nchoice to make. This doesn't mean that information regarding these things is an\nattack on your right to choose whether or not to partake in them. It…",
  "data/reddit-changemyview/r/changemyview/comments/p7qsyv/cmv_at_the_rate_were_going_the_lockdowns_and_mask.json": "During the initial lockdowns we were told that we had to wait for vaccines.\nThose vaccines are here now and the rate of new vaccinations is slowing down.\nWashington state just announced that there will be another mask mandate due to a\nrise in cases.\n\nNow what are we holding out for? Are we hoping…",
  "data/reddit-changemyview/r/changemyview/comments/p7ttgc/cmv_islam_is_fundamentally_more_dangerous_than.json": "Most religions in fundamentalist form are dangerous. However Islam adds another\nlayer to this, by preaching how to govern people, and clearly dictates what laws\nare and are not to be implemented.\n\nThis is directly contradictory to the concept of developing laws by public\nforum, considering the views…",
  "data/reddit-changemyview/r/changemyview/comments/p7wyfb/cmv_exams_should_be_open_booknotes.json": "As an engineering student I find this to be very crucial in learning. Memorizing\nthe material for an exam is not a good way in learning the material whereas\nhaving an open book exam makes learning the materials much easier.\n\nAll exams should be open resources. It increases note taking skills that…",
  "data/reddit-changemyview/r/changemyview/comments/p7xbyn/cmv_people_into_the_extreme_parts_of_bdsm_have.json": "I can already see the comments now “Dur, you’re an incel” “reee you must be fun\nin the bed”.\n\nThis whole thing stems from a relationship I had where my then girlfriend\nintroduced me to legit bdsm. At first it seemed kind of erotic, but then I\nrealized how dark it has gotten. It’s not just leather…",
  "data/reddit-changemyview/r/changemyview/comments/p833ga/cmv_i_should_support_nuclear_energy_over_solar.json": "Nuclear energy is cheap, abundant, clean, and safe. It can be used industrially\nfor manufacturing while solar cannot. And when people say we should be focusing\non all, I see that as just people not investing all we can in Nuclear energy.\n\nThere is a roadmap to achieve vast majority of your nation's…",
  "data/reddit-changemyview/r/changemyview/comments/p855z6/cmv_men_wearing_shoe_lifts_shouldnt_be.json": "Shorter men are widely considered as less attractive on average (all things\nbeing equal) to taller men. There’s nothing they can do about this, short of leg\nlengthening which is very expensive, high-risk, painful and can necessitate many\nmany months of recovery time. Other than lifts there isn’t an…",
  "data/reddit-changemyview/r/changemyview/comments/p8qjn8/cmv_depression_related_subreddits_serve_no.json": "I suffer from depression, am at the stage of suicide idealization, and generally\nspeaking I have more or less accepted that I will die by my hand eventually. Not\ntoday and probably not tomorrow, but I can see the trend in my life and I don't\nsee it getting better. Truth is that some people are dealt…",
  "data/reddit-changemyview/r/changemyview/comments/p8s694/cmv_anarchocommunism_cannot_support_any.json": "I've been fascinated recently with historical attempts at structurelessness and\nthe effect that has on human behaviour given that hierarchies of one form or\nanother have historically been an inevitable part of basically any large human\nsociety. The story of Tony Hseih's dream of a structureless…",
  "data/reddit-changemyview/r/changemyview/comments/p8ueaz/cmv_going_out_and_getting_drunk_every_weekend_is.json": "I’m almost 25 years old and am starting to realize going out and getting drunk\nkind of sucks. I have a great time in the moment obviously but always wake up\nwith less money and a big ass headache. I wonder if there’s more I could be\ndoing. I like to make music, but always feel more pressured to go…",
  "data/reddit-changemyview/r/changemyview/comments/p8xik8/cmv_babies_shouldnt_be_circumcised.json": "A person should be given as much control over their body as possible and a man\ncan decide to get a circumcision later on in life instead of the decision being\nmade for him by his parents. From a religious standpoint as a parent you have to\nbe aware that there is a chance that your child won't follow…",
  "data/reddit-changemyview/r/changemyview/comments/p8zfvt/cmv_any_argument_of_hurry_or_youll_be_left_out.json": "I'm absolutely open to having my view changed on bit or whatever coins, but\nafter a comment response I just made to someone trying to defend NFTs,\nstablecoins, smart contracts, I've realized a very specific thing that can clue\nyou in to the fact that they're a type of Ponzi scheme or scam: \"if you…",
  "data/reddit-changemyview/r/changemyview/comments/p94unc/cmv_holding_opinions_so_dearly_that_you_consider.json": "Changing opinions is usually seen as a sign of weakness or incompetence, and\nmost people are subconsciously terrified of being wrong.\n\nWith that being said, I believe that the reason why the split between the\npolitical community is so much larger than before isn’t solely because if echo\nchambers,…",
  "data/reddit-changemyview/r/changemyview/comments/p97any/cmv_reddit_is_not_a_great_place_to_get_advice_in.json": "Reddit has a reputation wherein its users are generally introverted and have\ndifficulty in making and maintaining relationships with people. After sometime\nhere, it's pretty evident in subreddits i've seen and some people that I have\ntalked to. It's not wrong to be intoverted, don't get me…",
  "data/reddit-changemyview/r/changemyview/comments/p984mu/cmv_women_demanding_toilet_seat_to_be_kept_down.json": "While I do not mind keeping the seat down and have been doing so whenever I\nshare a bathroom with women, be it with familly, roomates, or at work, I always\nconsidered it a courtesy, like holding a door open. What I take issue with is\nwomen demanding or thinking that it should just be like that.\n\nIn…",
  "data/reddit-changemyview/r/changemyview/comments/p9a96d/cmv_firsttrimester_abortion_is_not_immoral.json": "I first want to say that I don't think abortion is moral in all circumstances\nhaving an abortion after 9 months clearly isn't. I don't think human life in\nitself is valuable, I think that sentience is the most important factor which\ngives intrinsic value.\n\nSentience = the ability to experience. For…",
  "data/reddit-changemyview/r/changemyview/comments/p9c6x2/cmv_voluntarily_unvaccinated_people_should_be.json": "I firmly believe that healthcare should be denied to no one regardless of their\neconomic or social conditions.\n\nHowever, what boils my blood the most is that we have so many perfectly good\nvaccines against Covid that are readily available and accessible in most\nfirst-world countries, and yet people…",
  "data/reddit-changemyview/r/changemyview/comments/p9p91m/cmv_person_of_color_sounds_wrong.json": "Listen if its a catch all term for minorities i can understand it.\n\nBut my friend described me as a person of color and that shit just sounds alien?\n\nLike im black i cant even fully articulate why its bothers me maybe it has\nsomething to do with how blacks were talked about in jim crow\n\nBut…",
  "data/reddit-changemyview/r/changemyview/comments/p9qm78/cmv_men_and_women_are_not_the_same_there_are.json": "For some reason, many leftists have bought into the idea that men and women are\nthe same and therefore every disparity is the result of sexism despite the fact\nthat there is not a single study that has found no difference between the brains\nof men and women and several that have found clear…",
  "data/reddit-changemyview/r/changemyview/comments/p9sbcz/cmv_different_outcomes_do_not_imply_discrimination.json": "I found out the other day about Disparate Impact in the United States and was\nkind of concerned. Here [https://www.investopedia.com/disparate-impact-5114526]\ndefines disparate impact as:\n\n>Disparate impact refers to the result of the application of a standard,\nrequirement, test or other screening…",
  "data/reddit-changemyview/r/changemyview/comments/p9vzkv/cmv_stablecoins_are_not_a_new_innovation_they_are.json": "If I have 10 dollars in a bank account, I do not in fact own 10 dollars. I own\n10 IOUs from my bank. I can redeem these IOUs for cash at my local bank, or I\ncan use them for payment directly in a bank transfer and let someone else redeem\nthem.\n\nIf the bank goes under, I can rest assured that my…",
  "data/reddit-changemyview/r/changemyview/comments/pa1hux/cmv_any_free_market_given_enough_time_will.json": "Following a great discussion with u/joopface [/u/joopface], I'll downgrade\n'inevitable' to 'likely to inevitable, depending on specific sector and length\nof time'! (Can you tell I still hate markets?) Thanks for the discussion all,\nI'm going for the bike ride I wanted to take an hour ago :')\n\n\n\nSo,…",
  "data/reddit-changemyview/r/changemyview/comments/pa2vcs/cmv_circumcision_is_an_evil_practice_that_is_no.json": "Circumcision is unequivocally an outdated, unnecessary, and barbaric practice.\nThe only reason it is done is because the Jews invented it for religious reasons\nand pushed it on the rest of the goyim. It is clearly genital mutilation, and I\nfeel horribly violated that it happened to me. It’s one of…",
  "data/reddit-changemyview/r/changemyview/comments/pa3hvk/cmv_people_who_say_it_is_impossible_for_them_to.json": "First I want to say that empathy for people feel that way and can fully\nunderstand that someone is frustrated about it.\n\nBut I cant understand the claim that \"its over\" in terms of a relationship just\nbecause of your looks.\n\nI dont see effidence for that in real life, I see unattractive people in a…",
  "data/reddit-changemyview/r/changemyview/comments/padj2r/cmv_an_opened_relationship_is_not_an_actual.json": "I'm not talking about the religious relationships where people have multiple\nspouses or whatever. I mean the people who are in relationships but then go out\nfucking other random people all the time. How is that a relationship? You aren't\nexactly being loyal to your partner now are you. It also seems…",
  "data/reddit-changemyview/r/changemyview/comments/pahsjk/cmv_woodrow_wilson_was_the_worst_president_in_us.json": "He was a overt racist, introduced segregation in the Federal Government, and Jim\nCrow in to Washington, D.C.\n\nHe did nothing to limit lynching's in the South and appeared to out and out\nsupport the Ku Klux Klan (KKK).\n\nHe and his administration set back racial relations by at least 50 years in…",
  "data/reddit-changemyview/r/changemyview/comments/pao8zt/cmv_we_should_have_more_movies_and_books_with_a.json": "Entertainment culture abounds in noble protagonists who fight the forces of\nevil, who seek to improve their flaws and who are ultimately seen as heroes who\nsave the world. There are relatively few books or movies that feature a villain\nin the foreground, and that's a bad thing.\n\nFirst, the audience…",
  "data/reddit-changemyview/r/changemyview/comments/paoet6/cmv_out_of_school_suspension_for_high_schoolers.json": "Public schools have multiple functions: keeping kids off the street,\nsocialization for kids, imparting lessons of society on them, and obviously\neducation. According to Lawyers.com\n[https://www.lawyers.com/legal-info/research/education-law/what-kinds-of-behavior-can-lead-to-suspension-from…",
  "data/reddit-changemyview/r/changemyview/comments/papieo/cmv_republicans_value_individual_freedom_more.json": "Let's use the examples of gun policy, climate change, and COVID-19 policy.\nRepublican attitudes towards these issues value individual gain and/or freedom\nat the expense of collective safety.\n\nIn the case of guns, there is a preponderance of evidence showing that the more\nguns there are in…",
  "data/reddit-changemyview/r/changemyview/comments/paqlx8/cmv_everyday_people_will_have_to_make.json": "So I completely understand that major corporations are the cause of a majority\nof carbon issues and should be taking a lot of the blame for climate change. And\nI definitely think for us to actively combat climate change we need legislation\nthat would restrict the use of fossil fuels and wastefulness…",
  "data/reddit-changemyview/r/changemyview/comments/pas5eo/cmv_a_woman_slapping_a_man_is_abusedomestic.json": "It has been normalized for decades that it is acceptable for women to slap men\nwhen they are angry or feel emotionally attacked. Physical violence should never\nbe an appropriate response for non-physical violence.\n\nI somewhat equate this to the fact that it is never acceptable for a man to\npunch…",
  "data/reddit-changemyview/r/changemyview/comments/pasw8n/cmv_immigration_benefits_the_rich_but_not_the_poor.json": "Many like to claim that immigration is beneficial for the Economy and the\nPeople. It is claimed that everyone profits. Yet if one looks at the European\nMigrant Crisis of 2015/16 where in 2021 around half of all migrants still dont\nhave a job - and most of the other half only low skill/low wage jobs …",
  "data/reddit-changemyview/r/changemyview/comments/pazebm/cmv_it_is_perfectly_fine_to_only_want_to_date.json": "The title pretty much sums up the view. I'm intentionally being pretty inclusive\nwith what I'm talking about: it could be \"I won't date Republicans/Democrats,\"\nor it could be \"I won't date anyone who doesn't love Star Wars.\"\n\nI don't see any problem with wanting someone to be compatible with you…",
  "data/reddit-changemyview/r/changemyview/comments/pb2v4p/cmv_most_people_would_be_okay_living_under_a.json": "First of all, I'm not saying that most people want a dictatorship or will try to\nbring about one. Sure there are more people like this now and we've seen it.\nHowever, most people on some level want peace on some level and don't want to\nmake waves. That being said, if a dictatorship were to be in…",
  "data/reddit-changemyview/r/changemyview/comments/pba7o1/cmv_all_healthcare_employees_and_public_sector.json": "This is the perfect opportunity to purge these very important professions of the\ncrazed, deluded, dangerous, and unintelligent.\n\nMedical personnel should be required to follow medical science point blank,\ndoctors and nurses should not be allowed to keep their jobs if they are anti\nvaccine because it…",
  "data/reddit-changemyview/r/changemyview/comments/pbahj5/cmv_there_is_nothing_morally_wrong_with_eating_an.json": "Context: I’ve been considering trying veganism out for moral reasons, but I feel\nthat it would be too hard to give up omelettes in the morning. My parents have\nchickens which are kept free-range, and they lay enough eggs to support our\nfamily (and then some). These chickens are not kept specifically…",
  "data/reddit-changemyview/r/changemyview/comments/pbcmt1/cmv_feminism_should_be_renamed.json": "Okay so bear with me. Let me get this out of the way: I consider myself a\nfeminist (I'm using this term to mean a supporter of the idea that women should\n'have the same rights and opportunities as men' as per the Oxford dictionary).\nHOWEVER, I much prefer to use the term Gender-Egalitarianism…",
  "data/reddit-changemyview/r/changemyview/comments/pbd8xk/cmv_if_we_really_care_about_structural_inequality.json": "Most of the discussions around inequality tends to focus on income. In my\nopinion this has limited meaning in a world where cost of basic stuff like\nShelter, Healthcare and Education are inflating at extremely high rates. The\nbetter way to genuinely tackle the issue is to utilize technological know…",
  "data/reddit-changemyview/r/changemyview/comments/pbepyr/cmv_the_lack_of_a_dislikedownvote_button_on_major.json": "My view: The most popular social media platforms in the West, namely Facebook,\nInstagram, and Twitter, all lack the equivalent of a \"downvote\" reaction. As\nReddit has shown us over the past decade+, content which receives far more\nupvotes than downvotes moves up in the algorithm's ranking and is…",
  "data/reddit-changemyview/r/changemyview/comments/pbfchx/cmv_it_is_irresponsible_to_have_children_when.json": "I’m not saying it’s horrible. It’s just irresponsible. If finances are tight,\nthen having kids will make finances tighter. If you are living in a rural area,\nI’d say it’s better to have kids when the entire household income exceeds 80k/yr\n(both people making 40k/yr) if you are living in an expensive…",
  "data/reddit-changemyview/r/changemyview/comments/pbhj3v/cmv_what_we_learned_during_the_pandemic_leads_to.json": "Ok, this is a big one for me emotionally, but I want to try to be as objective\nand reasonable as possible. Also I'd like to point out that I'd like nothing\nmore than to be convinced here that my view is wrong, because I want to be more\nhopeful.\n\nThe View:\n\n 1. It is the opinion of most experts on…",
  "data/reddit-changemyview/r/changemyview/comments/pbontx/cmv_censoring_and_banning_social_media_antivaxx.json": "Defining antivaxx as people who are against all vaccines. The true original\ndefinition before COVID ever happened.\n\nI truly believe that we're past the point of censoring the outspoken to unknown\nplatforms, because they are now everywhere. It's not just reddit, or Facebook,\nor Twitter. It's…",
  "data/reddit-changemyview/r/changemyview/comments/pby7dy/cmv_genocides_arent_worse_than_other_genocides.json": "There's no such thing as ranked genocides. The extermination of natives,\nreligions, countrymen, etc., are all just as horrible as the other. The\nHolocaust was not \"better\" or \"worse\" than the genocides of the Americas.\n\nCambodians, Rwandans, Greeks, and so many more have genocides.\n\nI wouldn't be…",
  "data/reddit-changemyview/r/changemyview/comments/pbzkp5/cmv_within_the_scope_of_deliberations_on_public.json": "In this country, the United States, there is supposedly an intentional wall\nbetween church and state. The state is capable of wielding enormous power and\ninfluence in public and private lives of citizens. The separation between church\nand state is to protect each body from the other. The state…",
  "data/reddit-changemyview/r/changemyview/comments/pc1eam/cmv_blackwater_evacuating_people_from_afghanistan.json": "There are a lot of people in an uproar because Blackwater is evacuating Afghan\nrefugees who are willing and able to pay $6,500. I understand that this seems\nlike evil profiteering by Blackwater, and maybe it is, but the truth is the\nworld is a better place for them doing this. They are not going to…",
  "data/reddit-changemyview/r/changemyview/comments/pc20ch/cmv_albums_of_live_performances_are_the_worst_of.json": "This is not about studio albums being better than gigs or vice versa. Both are\namazing and bring different aspects to music.\n\nStudio albums provide highly polished and produced versions of songs, which is\ngreat. If a band whats to use effects or have members playing multiple\ninstruments it allows…",
  "data/reddit-changemyview/r/changemyview/comments/pc2l9d/cmv_the_us_prison_system_is_broken_and_doesnt.json": "Let's get this out of the way, the purpose of a prison is to punish someone for\ntheir actions and teach them not to repeat it. The US prison system does not\naccomplish any of this, it doesn't even come close. Look at the European\n(specifically Norway/Scandinavia) prisons, they treat prisoners like…",
  "data/reddit-changemyview/r/changemyview/comments/pc318e/cmv_we_should_normalize_males_working_in.json": "My nephew recently started pre-k and I just had a passing thought, I don’t think\nI’ve ever seen a male pre-k teacher. How can a man have a role in a field\nrequiring care for children if he is not trusted with children’s basic care?\nFathers often change diapers, help children use the toilet, and put…",
  "data/reddit-changemyview/r/changemyview/comments/pc8t95/cmv_theres_nothing_wrong_with_having_a_60_height.json": "I’m a 5’9 male, so I don’t fit the bill for that standard, but don’t have an\nissue with it. Physical attraction is a huge part of a relationship and is very\nimportant (looks do matter). Anytime a woman says she prefers or will only date\n6’0+ men, short men will get pissed and act like she’s the…",
  "data/reddit-changemyview/r/changemyview/comments/pcawwd/cmv_social_media_are_ruining_my_generation.json": "I'm a 20 years old male and I think social media are more bad than good for my\ngeneration, hear me out. They don't teach inclusivity cause several races are\nleft out from the equation and also thinner/normal body types. They help glorify\nsex work in an ill way and encourage it, which is degrading…",
  "data/reddit-changemyview/r/changemyview/comments/pcba0l/cmv_assisted_suicide_by_euthanasia_should_be.json": "if a person is suffering from a serious mental or physical illness and cant live\na happy life they should have the choice of peaceful assisted suicide their own\nterms. its selfish to keep these people alive and the only people who are\nagainst it are people who have never met these people before or…",
  "data/reddit-changemyview/r/changemyview/comments/pcbc52/cmv_mandatory_resort_fees_at_hotels_should_be.json": "Resort fees are an additional fee you are required to pay for a room at a hotel\nwhich in theory entitles you to certain amenities the hotel offers. I think this\nsort of fee should be banned as a bait and switch tactic, and any mandatory fee\nwhatsoever should be built into all advertised prices. I am…",
  "data/reddit-changemyview/r/changemyview/comments/pcd1ml/cmv_its_hypocritical_for_western_nations_to_trade.json": "Saudi Arabia is the biggest funder and supporter of terrorism in the Middle east\nand likely around the world. They created ISIS and fund the terrorist group.\nSaudi Money funds the Islamic state, Saudi citizens fight for them in mass, and\nthe Wahhabism government turns a blind eye because their…",
  "data/reddit-changemyview/r/changemyview/comments/pcd4u5/cmv_it_may_still_be_too_early_to_say_whether.json": "The US is looked as an example of a success of democracy, but US was actually\nvery undemocratic for most of its history. In fact, women could only start\nvoting in the 1920s. There were more limits on who could vote depending on local\npolicy. As we all know also, early America only (white) male…",
  "data/reddit-changemyview/r/changemyview/comments/pcfkev/cmv_onlyfans_is_not_distasteful_because_of_the.json": "As far as I know, it's not controversial to say that parasocial relationships\nare destructive.\n[https://www.pbs.org/wgbh/nova/article/parasocial-relationships/]\n\nThese relationships often take the form of celebrity worship or extreme fandom,\nwherein a person will become obsessed with a public figure…",
  "data/reddit-changemyview/r/changemyview/comments/pcjmrq/cmv_calling_upon_reddit_to_delete_blatant.json": "Reddit as a whole tends to allow controversial or even downright incorrect\ninformation on this site. This is demonstrated time and time again within\nsubreddits such as sino, which argues/believes tianmen massacre never happened.\nThis is arguably dangerous as well as it gives them more ammo again the…",
  "data/reddit-changemyview/r/changemyview/comments/pcl3rj/cmv_its_desirable_for_youth_to_incur_minor_but.json": "Been seeing a lot of videos lately of younger drivers driving like lunatics thru\ntraffic, a lot of them ending in fiery, sometimes deadly crashes. As someone who\nwas hit by a truck at 15 due to my own stupidity, it made me much more aware of\nthe fact that it only takes one accident to thoroughly…",
  "data/reddit-changemyview/r/changemyview/comments/pclw4n/cmv_children_have_absolutely_no_obligation.json": "A lot of parents [especially in Asian culture (I am Asian)] where parents expect\ntheir children to take care of them when they are old, and throw around excuses\nsuch as “We sheltered you, fed you, clothed you, so you need to do the same when\nwe are older.”\n\nYea I absolutely do not believe in that.…",
  "data/reddit-changemyview/r/changemyview/comments/pcpxvu/cmv_its_perfectly_fine_better_even_to_crack_an.json": "I watch a lot of cooking videos on YouTube, and it seems that the chefs always\ncrack their eggs on the countertop, and some will come right out and say that\nit's the right way. Maybe they're doing it differently from how I do it, but\nevery time I try I get a worse result.\n\nCounter crack: I get a…",
  "data/reddit-changemyview/r/changemyview/comments/pcqisj/cmv_businesses_should_use_rolling_periods_to.json": "So for example, if you are an employee of a car dealership, you may have a goal\nto sell, say, 30 cars a month and if you sell more, you get a bonus of, say $500\nper car above 30. I believe this kind of things encourages employees and\ncustomers to act in ways that are damaging to the business and…",
  "data/reddit-changemyview/r/changemyview/comments/pcrynf/cmv_i_see_lots_of_people_on_reddit_talk_about_how.json": "Whenever discussions about twitter comes up, people seem to absolutely hate that\nsite. And yet, there are several tweets on the front page right now, not to\nmention the subreddits specifically about posting twitter screenshots. I don't\nuse twitter frequently, so I'm confused about what people on…",
  "data/reddit-changemyview/r/changemyview/comments/pcvcn5/cmv_its_ok_to_use_the_word_decimate_as_a_synonym.json": "No one gets upset when we call December the 12th month even tho December\nliterally means \"tenth month\". So why do others get so pissed off over\n\"decimate\" being used to describe something that has been vanquished to a great\ndegree?\n\nLanguage changes over time. The word \"deer\" for instance once…",
  "data/reddit-changemyview/r/changemyview/comments/pcz5to/cmv_blueberries_are_the_best_berry.json": "Versatility\n\nPies, jams, smoothies, muffins and more, I can't think of a single berry with\nmore uses than the humble blueberry. Strawberries do have the advantage of\nmaking a sick ice cream but when's the last time you saw a strawberry muffin? I\nthought not. I suppose cranberry juice is pretty nice…",
  "data/reddit-changemyview/r/changemyview/comments/pd58lk/cmv_the_concept_of_the_friendzone_being_some.json": "I think getting rejected sucks just as much as the next person, but it’s the\nrisk you take when you decide to make an advance on your friend, especially your\nbest friend. You know what lies in wait for you when you do it. You should know\nwhether or not you can handle being friends with someone who…",
  "data/reddit-changemyview/r/changemyview/comments/pd8kuo/cmv_the_world_would_be_better_off_if_mosquitoes.json": "It’s towards the end of summer and thankfully the end of mosquito season. Every\nyear goes by and I have to slather myself in deet, to avoid tons of bites, and\ngod knows what disease.\n\nMosquitoes exist on planet earth, simply to be parasites and spread…",
  "data/reddit-changemyview/r/changemyview/comments/pdcacs/cmv_men_should_not_be_forced_to_support_their.json": "A woman can decide not to be a mother and have all the responsibilities that\ncome with it after conception. They can choose (where i live) to have an\nabortion or put their kid up for adoption. They can decide whether or not they\nwant to be a parent after conception. A man has no choice, after…",
  "data/reddit-changemyview/r/changemyview/comments/pddibd/cmv_debates_are_better_online_because_you_cant.json": "A person puts up a table and a sign that says “Pro Life, change my view”. As\nmore people join the conversation, members of the crowd yell “sexist pig”, “my\nbody my rights”, and generally get more aggressive with their heckling. The\npoint of the debate was to truly change a persons mind, but it has…",
  "data/reddit-changemyview/r/changemyview/comments/pddz0n/cmv_affirmative_action_for_college_admissions.json": "Title. I'll use myself as an example to start. I'm Lumbee Indian\n(card-carrying), and thus college is free for me from many instutions.\n\nThe issue arises from the fact that I don't live in Robeson County, North\nCarolina, where much of my family does, and where the Lumbee tend to be poorer\nthan white…",
  "data/reddit-changemyview/r/changemyview/comments/pdjhk3/cmv_do_your_own_research_is_antithetical_to_the.json": "The main reason that we have the society we have today can mainly be attributed\nto the fact that humans can compartmentalize work.\n\nAt some point (Ancient Greece? Idk), we realized that not every single person\nneeds to know every single thing. We can specialize and have jobs in a\nparticular space of…",
  "data/reddit-changemyview/r/changemyview/comments/pdon9h/cmv_if_smokers_can_be_refuse_lung_transplants_in.json": "Hospitals are so full that people are coming in and being denied care for other\nmedical stuff. A veteran died because of an appendicitis because the beds were\nso full of unvaccinated Covid patients. Enough is enough! I lost sympathy for\npeople who are risking a mutant covid that makes vaccinated…",
  "data/reddit-changemyview/r/changemyview/comments/pdr4hy/cmv_automated_banning_of_people_who_participate.json": "I just got banned from a subreddit I hadn't participated in for several years\n(/r/pokemongo) because I made a single comment in another subreddit I don't\nactively participate in (/r/conspiracy). I happened by /r/conspiracy and mocked\na covid conspiracy theory. Instantly banned for \"participating in…",
  "data/reddit-changemyview/r/changemyview/comments/pdv8vz/cmv_if_a_man_discovers_he_is_not_the_father_he.json": "After seeing so many different Reddit Post about stories with the below as the\nstory and the comments in response, I am not sure if I am the one who is being\nthe butt about this kind of issue.\n\nMan raises child\n\nDiscovers woman cheated, lied about paternity\n\nMan asks what to do\n\nReddit Hivemind says…",
  "data/reddit-changemyview/r/changemyview/comments/pdx5hb/cmv_it_is_not_wrong_to_think_religious_people_are.json": "Personally I do not believe in any religion I was raised by very heavy\nchristians however. Some of the arguments I heard was \" you can't prove god\nisn't real.\" Well I can't prove the tooth fairy isn't real either doesn't mean I\ncan't think you're delusional if you believe it is. It's like religious…",
  "data/reddit-changemyview/r/changemyview/comments/pdyqxj/cmv_americans_really_need_to_get_on_the_bidet.json": "Last year when there was a run on toilet paper I ordered bidets instead of\nfighting over paper. As a result, I use less toilet paper, my butthole is much\ncleaner and I have to touch my butthole far less than when I was using toilet\npaper.\n\nBidets are superior, affordable and the far better option…",
  "data/reddit-changemyview/r/changemyview/comments/pdz4ll/cmv_when_interviewing_members_of_the_taliban_it.json": "With all the important news coming out of Afghanistan, lots of people are\ndesperate for information on the status of the evacuation, etc, going on in\nKabul.\n\nThe BBC, ABC, Al-Jazeera, and others, all have female lead reporters on the\nground who are trying to interview Taliban leaders for critical…",
  "data/reddit-changemyview/r/changemyview/comments/pe3f3c/cmv_politicians_spreading_vaccine_disinformation.json": "Politicians are elected to lead us especially during major events like the\ncurrent pandemic. Ignoring scientific data from experts and telling citizens not\nto trust vaccines is literally killing people. These people have influence\nsocially and in the legislation they support. I’m not talking about…",
  "data/reddit-changemyview/r/changemyview/comments/pe6x4m/cmv_there_should_be_an_age_limit_for_us_president.json": "I’m sick that all our choices the last few elections have all been super old,\nand not representative of our county. I think we need some young blood, most\npeople retire at 65-70. Why should they be running the country, when we’ve 100%\nhad presidents before that had started their cognitive decline…",
  "data/reddit-changemyview/r/changemyview/comments/peh7oq/cmv_it_should_be_illegal_to_market_nonpermanent.json": "Edit: Since I probably wasn't clear what I mean, I don't target the words\nspecifically, but the meaning they convey. I'll try to explain by using a\nconcrete example.\n\nA commonly used way of saying stuff is \"Get GAME on PLATFORM\".\n\n\"Get Transport Fever 2 on GOG Galaxy\" means I can get the game and…",
  "data/reddit-changemyview/r/changemyview/comments/pelbp2/cmv_tipping_culture_is_toxic_and_needs_to_be_done.json": "We live in a society where if you do not tip your server or delivery driver,\nyou’re immediately branded as entitled, selfish, or rude. There are servers who\nthreaten to spit in or tamper with food, intentionally provide terrible service,\nor refuse to deliver an order due to non-tipping…yet we as a…",
  "data/reddit-changemyview/r/changemyview/comments/pem04k/cmv_the_educationlabor_system_in_the_united.json": "I am combining Education and Labor as the same because they go hand in hand, the\npurpose of education is not only to teach the under generations so people become\nknowledgeable but also so that people can get careers and live productive lives.\nSo I am going to split this into 3 parts.\n\nPart 1. K…",
  "data/reddit-changemyview/r/changemyview/comments/pemlsq/cmv_religious_exemptions_to_lawsregulations.json": "As I see it, religious exemptions boil down to, \"If you have a firmly held\nbelief that you should not have to follow this rule, then you don't have to\nfollow the rule.\" But only if you belong to a pre-approved group of people who\nalso feel strongly that they shouldn't have to follow that rule.\n\nI…",
  "data/reddit-changemyview/r/changemyview/comments/percty/cmv_if_youre_antivax_because_you_believe_in_my.json": "It all stems from this response I keep hearing from the anti-vax camp \"my body\nmy choice\", which sounds an awful lot like something we've been hearing from the\npro-choice movement for a long time. I think that if you believe in that\nstatement as an argument for being anti-vaccination that you have…",
  "data/reddit-changemyview/r/changemyview/comments/pey51f/cmv_steve_irwin_regularly_took_stupid_risks_with.json": "I'll start by saying that Steve Irwin seems like he was a genuinely nice guy\nwith a big heart. He clearly loved animals and dedicated his life to protecting\nthem.\n\nThis has understandably made him a hero in the eyes of most Redditors. I'm not\ntrying to attack him as a person. He didn't deserve to…",
  "data/reddit-changemyview/r/changemyview/comments/pf7x1g/cmv_raita_is_a_place_for_people_to_get_their.json": "90% of the AITA posts I see are people posting morally questionable\ndecisions/actions, then getting fawned over for those actions.\n\nI see few posts that actually call out the poster for their actions, and even\nfewer that try to see both sides of a conflict.\n\nEven more, the consequences of some of…",
  "data/reddit-changemyview/r/changemyview/comments/pfamvb/cmv_if_it_makes_your_life_better_and_doesnt_cause.json": "I think there are far too many words written about whether God exists and not\nenough written about whether it is rational to believe in God. I'm going to\nwrite this under the assumption that God doesn't exist because I think that will\nresonate with the average Reddit user better though I don't…",
  "data/reddit-changemyview/r/changemyview/comments/pfbcp1/cmv_silencing_covid_antivaxxers_etc_isnt_the.json": "After seeing many subreddits go private in an attempt to force Reddit's hand so\nthey ban subs such as NoNewNormal and other such communities, it's made me start\nto think about how we treat people and communities with these controversial view\npoints, Reddit has always been bad for echo-chambers,…"
}