{
  "data/reddit-ask/r/NoStupidQuestions/comments/ufo23t/is_dating_soulcrushing_for_everyone_or_am_i_just.json": "I’ve only started dating recently and I’m ready to delete all the apps and just\ndie alone. I hate going on pointless first dates.\n\nI was also starting to feel more confident in myself until I started dating, now\nI just have a whole lot of self-doubt. If a guy doesn’t want a second date I…",
  "data/reddit-ask/r/AskHistorians/comments/ufs52y/islamic_sources_describe_the_vikings_rus_as_very.json": "The 10th-century Muslim traveler Ahmad ibn Fadlan had this to say about the\nvikings. “They are the filthiest of all Allah's creatures: they do not purify\nthemselves after excreting or urinating or wash themselves when in a state of\nritual impurity after coitus and do not even wash their hands after…",
  "data/reddit-ask/r/NoStupidQuestions/comments/uft96f/is_it_alright_to_ask_my_dad_not_to_kiss_me_anymore.json": "Okay some context, my (31f) family has a lot of issues when it comes to\nboundaries. Touching, joking, giving advice when not asked, and so on. Well my\nbiggest issue is that my dad likes to kiss my neck or back. I hate it. It\nliterally makes my stomach knot and I have told him on multiple occasions…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ufp206/what_does_it_mean_when_a_girl_tell_me_i_fuck_like.json": "asking For a friend...",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ufvz6i/how_do_i_politely_tell_the_owner_of_the_gym_i_go.json": "So I go to a gym. In said gym, there's a VERY small tank that houses a very sick\nBetta fish. The tank is filthy and has no filtration whatsoever. It doesn't take\na fish expert to see that this fish is dying. I have a tank at home and whenever\nI go to the gym and see the Betta, all I want to do is…",
  "data/reddit-ask/r/NoStupidQuestions/comments/ufoosa/does_anyone_else_use_the_word_we_when_thinking.json": "I caught myself randomly, I had this thought when asking myself if I ought to\nhave some chocolate ice cream; “well, we’re home alone, it’s the perfect time to\nsneak some ice cream before dinner.” Let’s disregard the fascinating and\nplan-to-unpack-later quandary that I’m an adult married woman who…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ufy2k4/why_is_it_considered_offensive_for_white_people.json": "i know if its not done properly or taken care of the right way it can harm your\nscalp or hair. but when done properly, whats the harm in having them?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ufziz2/why_are_people_more_focused_on_forgiving_student.json": "I understand that forgiving student loans would change a lot of people’s lives,\nbut it just seems like it’s not addressing the core of the problem. Forgiving\nexisting loans doesn’t change that people will continue to go to college and\naccumulate the same massive amounts of debt that we’re seeing…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/uftr4d/how_do_you_actually_know_if_you_are_attractive_or.json": "Simply put i either look great or terrible on photos because I know my angles.\nI'm usually the center of attention when it is a flirtatious situation.\n\nThing is I dont feel like I'm not attractive but I also don't think im really\nattractive. I do feel like people tell me I'm beautiful out of pity…",
  "data/reddit-ask/r/askscience/comments/ug0an2/why_cant_we_reproduce_the_sound_of_very_old.json": "What exactly stops us from just making a 1:1 replica of a Stradivarius or\nGuarneri violin with the same sound?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ug1c9g/why_should_i_respect_peoples_religious_views_if.json": "I'm talking mainly about Islam, Judaism, Christianity and any other religion\nthat has doctrine that perpetuates hatred. I would never look at, say, a Muslim\nand beat the crap out of them just because of what they believe. But I would\njudge them and treat them with suspicion because they are at a…",
  "data/reddit-ask/r/NoStupidQuestions/comments/ug1q4s/isnt_im_in_love_with_you_different_than_i_love_you.json": "Edit: As a non native speaker, it's always so confusing to me when people in\nmovies say \"I'm in love with you\" and then the other person says \"I love you\ntoo\".",
  "data/reddit-ask/r/AskHistorians/comments/ufv2vr/more_indian_movies_sold_over_20_million_tickets.json": "According to Wikipedia's list of highest grossing movies in the Soviet Union\n[https://en.wikipedia.org/wiki/List_of_highest-grossing_films_in_the_Soviet_Union],\n50 Indian movies sold over 20 million tickets, ahead of the US's 41 and France's\n38. Given the ostensible popularity of Indian movies, how…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ufx32n/as_a_man_should_i_be_prioritizing_my_partners.json": "I know the common answer will probably be, \"just talk to your partner\". I don't\nhave one right now, but I'd like some input or understanding on this, since I\nsee a lot of discrepancy regarding this.\n\nI have a small penis, and suffer poor body image because of the shaming of it.\nThe one refrain I…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ufy6kx/why_are_jews_so_hated_around_the_world.json": "What is the reason behind the jew hate? It wasn’t just that 1 specific ww2\nmoment. From my understanding jews have been hated and looked down upon for a\nvery long time, before and after ww2. Why? There must be a reason for such\nenormous groups of people to all hate the jews.\n\nEdit: please keep it…",
  "data/reddit-ask/r/NoStupidQuestions/comments/ufybwz/why_do_people_think_germans_wouldnt_talk_about.json": "I just watched an episode of Family Guy where, as in so many other movies and\nseries, the joke is made that Germans won't talk about their past. But where\ndoes this stupid idea come from? When you turn on the TV in Germany it is almost\nimpossible not to see something about the Second World War, in…",
  "data/reddit-ask/r/AskHistorians/comments/ug1yzt/how_common_were_comfort_girls_during_slavery_in.json": "I’m doing an essay about what life would have could’ve been like during slavery\nin the 1800s. I’m a mixed (black/white) woman so life would have obviously been\nrather.. interesting. I’m trying to cover every option of what could’ve become\nof mixed woman and I was wondering if Django Unchained was…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ug25x9/is_it_weird_to_ask_a_girl_to_help_find_her_clit.json": "Weird title but I (20M) have been some issues recently. So I broke up with me a\nex gf of 2 years recently enough. I always was so confident during sex as you\nlearn alot about someone for 2 years. I never had issues finding her clit.\n\nSo I've been with a few one night stands now and for some of them…",
  "data/reddit-ask/r/NoStupidQuestions/comments/ug2dch/would_it_be_illegal_for_me_to_follow_paparazzi.json": "Paparazzi can follow around celebrities for no reason and photograph them like\nwalking around. i heard once they get away with this because they can argue it’s\na “public service” or something. So could i get away doing the same to them?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ufzo08/im_straight_but_disgusted_by_vaginas.json": "(16M). I'm turned on by every other part of a woman but not the vagina. This was\nespecially a problem yesterday when I was making out with a girl and she was\nhinting me to finger her but i was like not a chance.\n\nLater in the night I got a condom (because somehow do tolerate the possibility\nof…",
  "data/reddit-ask/r/AskHistorians/comments/ug5nxq/the_film_the_northman2022_has_been_criticized_in.json": "I’m interested in the subject of historical diversity in general. Fiction\nusually depicts medieval Europe as a place where only white people exist; in\nrecent years, I’ve seen claims that this is inaccurate, and Europe was\nhistorically more diverse than we tend to imagine in pop culture.\n\n“The…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ug7s1h/im_a_34_year_old_who_has_never_been_to_a_concert.json": "What's more, I'm going alone.",
  "data/reddit-ask/r/NoStupidQuestions/comments/ug68zf/what_would_happen_if_you_ate_a_piece_of_cancer.json": "Like you cut it off/out/whatever and ate it?\n\nETA: I’m just curious if you could get cancer from it or if you’d be relatively\nunharmed?\n\nSecond edit: Getting some good answers! Thanks! Btw, I haven’t, nor do I ever,\nplan on eating cancer specifically but I’ve been watching TWD and remembered…",
  "data/reddit-ask/r/askscience/comments/ufy1jk/is_it_true_that_fasting_makes_our_cells_age_at.json": "Title itself.",
  "data/reddit-ask/r/TrueAskReddit/comments/ufx74n/why_modern_american_politicians_dont_assasinate.json": "Please guys, no funny obvious racist replies like \"Cuz we're not savages like\nyou\" lol. As a citizen in a 3rd world country, politicians \"eliminating\"\ncompetitions before, during and after elections is so common like a morning\ncoffee.Its also possible even duringnthe their term. Lots of times, its…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ugfv7h/if_a_woman_rapes_a_man_and_gets_pregnant_should.json": "Just a philosophical question I was having with a buddy of mine today.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ug1dli/why_do_so_many_people_prefer_to_get_plastic.json": "Do they not realize that people who get too much plastic surgery all end up\nlooking the same? It's confusing to me because really no one looks at those\npeople and thinks \"Wow they look great!\" everyone knows what they did and\nacknowledges it didn't really work. So if someone knows that when…",
  "data/reddit-ask/r/NoStupidQuestions/comments/ughhmq/why_are_the_people_who_go_on_about_free_speech.json": "I guess this might be a US specific post.\n\nBut for example, getting banned on social media, removed from a private\nbusiness, or losing your job for saying certain things or causing a disturbance\nare all things that can legally happen under our first amendment, which only\nprevents being arrested and…",
  "data/reddit-ask/r/NoStupidQuestions/comments/ugmwev/question_for_boob_enjoyers.json": "hello, I am currently figuring out my sexuality. I am male and I have a question\nabout boobs.\n\ndo people actually like them? like, do you see a boob and think that's hot or\nyou want to touch it or something.\n\ni don't really understand the appeal for them and I'm wondering if this is\nsomething…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ugog0s/why_do_americans_care_that_they_are_10_irish_and.json": "In Europe, I have never heard someone casually tell you this information because\nI guess it is irrelevant that one ancestor came from another country.\n\nI have heard people talk about how they're descendants from dark ages royalty\nbut that's about it.",
  "data/reddit-ask/r/NoStupidQuestions/comments/ugnrqz/anyone_else_think_fuck_it_ill_let_future_me_deal.json": "Future me fucking hates me",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ugijqd/is_struggling_with_mental_health_a_new_cool_thing.json": "I understand that as a society we’ve been opening up a lot more on topics\nrelated to mental health in the past few years, and admitting depression or\ngoing to therapy sessions has become much more common and accepted. Which is\nwonderful! But why does it feel that every second relationship related…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ugpn54/would_fucking_schrodingers_cat_be_necrophilia_or.json": "If I don't observe it and I fuck it would it be Necrophilia or Beastiality or\nboth?",
  "data/reddit-ask/r/NoStupidQuestions/comments/ug545q/i_wasnt_born_yet_i_want_to_know_what_was_it_like.json": "Were there a lot of headlines mentioning stuff about entering a new millennia in\nnewspapers, were people making a lot of conversations about what might be\ndifferent? Was it a talking point at get-togethers? Did people make jokes about\n\"see you next millennia\" or \"it's going to be weird not writing…",
  "data/reddit-ask/r/AskHistorians/comments/uge2eu/john_wilkes_booth_was_a_famous_actor_in_his_day.json": "I just got to thinking about Booth's occupation the other day and a lot of\nquestions came to mind. I didn't see them answered previously and wanted to know\nif anyone had any information about this sort of stuff.",
  "data/reddit-ask/r/AskHistorians/comments/ugr0ds/to_what_extent_if_any_did_abraham_lincoln_know.json": "Apologies if this is a rather strange question but it's been on my mind lately.\nLiving in the South, I've met a wide variety of people but I recently met some\n\"Lost Cause\" neo-Confederate sympathizers and what they had to say about\nPresident Lincoln was very strange. Aside from their obvious hatred…",
  "data/reddit-ask/r/NoStupidQuestions/comments/ugu9xa/when_i_look_in_a_mirror_thats_3_ft_away_from_me.json": "Basically does the light going to the mirror and bouncing back to me make it as\nthough I'm twice as far away as I actually am?",
  "data/reddit-ask/r/AskHistorians/comments/ugm65a/throughout_the_history_of_muslim_rule_over.json": "Wikipedia\n[https://en.wikipedia.org/wiki/Islamization_of_Jerusalem#Islamization_of_Jerusalem_under_Jordanian_rule],\nquoting 3 different sources:\n\n> Tourists [i.e. non-Israelis] entering East Jerusalem had to present baptismal\n> certificates or other proof they were not…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ugx3xw/if_incels_are_so_convinced_that_women_only_care.json": "This is something I never got about the movement. If incels are so convinced\nthat women only ever exclusively want to date or hook up with attractive or good\nlooking men what’s stopping them from working out, working on their style, and\nmaking themselves more attractive to women?\n\nWhy are incels…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/uh1buo/why_do_people_get_offended_on_behalf_of_my.json": "I’m thai, me and I know a lot of other Thai people that like it when foreigners\nwear our traditional clothes, get involved in our holidays and cultural\ngatherings. Why do people seem to think it’s cultural appropriation when someone\nwears our traditional clothing when they are on holiday in…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/uh3qw2/besides_her_being_unfunny_why_do_people_hate_amy.json": "People literally fantasize about her death on Reddit & Twitter and I’m just so\nout of the loop. It seems super disturbing to hate a comedian that much but\nmaybe there’s something I don’t know?",
  "data/reddit-ask/r/AskHistorians/comments/uh5sup/the_great_roman_general_scipio_africanus_liked_to.json": "Modern men often look ridiculous on the dance floor. There are many memes about\nthis, so it's fun to see the topic come up in Seneca's work\n\nThe men of Seneca's day, \"mince and wriggle with more than effeminate\nvoluptuousness,\" when they're just walking around.\" Dances, we must assume, were\neven…",
  "data/reddit-ask/r/NoStupidQuestions/comments/uh3zmj/if_gender_and_sex_are_different_why_do_people.json": "I see people denying the “a woman is someone who identifies as a woman” all the\ntime. Instead, I imagine it’s like identifying as a conservative or liberal,\nyour beliefs make you that. Can we please talk about this without getting\nbanned?",
  "data/reddit-ask/r/askscience/comments/uh5re6/do_we_have_a_wider_field_of_view_when_our_pupils.json": "In the dark our pupils get wider, which I would imagine means there is a larger\nangle of light that we can see, and the opposite for our pupils shrinking in\nbrightness. Is this actually how it works?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/uh4mdb/whi_arent_female_condoms_talked_about_more_and.json": "https://www.plannedparenthood.org/learn/birth-control/internal-condom",
  "data/reddit-ask/r/TooAfraidToAsk/comments/uh5m7d/how_is_artificially_raising_the_price_of_drugs.json": "For example I see stuff all the time about how insulin is ridiculously expensive\nonly because the company’s raised the price for profit. How is there no law\nmaking something like that illegal, or is it like some loophole?",
  "data/reddit-ask/r/AskWomen/comments/uh4103/how_do_you_feel_when_guys_try_to_impress_you_by.json": "We all know the meme of the kid trying to carry a ton of chairs to impress\ngirls. Have you ever noticed someone doing this around you irl and what was your\nreaction?\n\nEdit: 16K views and 16 upvotes good lord",
  "data/reddit-ask/r/NoStupidQuestions/comments/uh79tu/do_people_still_use_lol.json": "I've started feeling old when using it....\n\nGirls keep messaging me with \"hhh\" and for months I didn't realize it meant ha\nha ha.... I'm only 30 damn it.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/uh7ke8/is_it_okay_to_feel_annoyed_about_sitting_next_to.json": "Their flab encroaches on my space and makes my trip uncomfortable. Why should I\nhave to suffer?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/uh5co0/with_the_supreme_courts_opinion_can_i_still_get.json": "I’m 16 and I’m terrified that I won’t be able to get an abortion if I’m raped or\nsomething else terrible happens.\n\nAlso, what’s next for the anti choice people? Will they go after doctors who\noffer birth control next?\n\nEdit: I’m from Iowa.",
  "data/reddit-ask/r/NoStupidQuestions/comments/uh9jd2/how_did_overturning_roe_v_wade_even_come_about.json": "THIS IS A QUESTION ABOUT THE AMERICAN SUPREME COURT SYSTEM. NOT THE MORALITY OF\nABORTIONS.\n\nI feel like I am out of the loop when this morning my feed is full of\n\"overturning Roe v Wade\" posts.\n\nI thought the job of the supreme court was to set precedent, by hearing out\ncases that are escalated to…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/uhd6vt/why_shirtless_chris_hemsworth_full_of_sexy.json": "I really can not grasp my head around this extremely popular things. I mean\npeople want to see most attractive things on screen. And anytime I mention this\nI get a massive backlash with 0 explanation of \"how and why\" that involves both\nsides.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/uha5pe/why_are_people_suddenly_siding_with_johnny_depp.json": "Rewind 2 years and it was a totally different atmosphere. People were shitting\non Depp so hard, even though virtually all the damning evidence was already out\nthere. We knew about the finger, we knew about the audio recordings, and yes we\nabsolutely knew she took a dump in his bed. So what gives? I…",
  "data/reddit-ask/r/AskHistorians/comments/uhh2j1/megathread_abortion_in_america.json": "Late last night, the website Politico announced they had a draft copy of the\nruling in the Thomas E. Dobbs, State Health Officer Of The Mississippi\nDepartment Of Health, Et Al, Petitioners V. Jackson Women's Health Organization.\nThe draft is attributed to Justice Alito and court…",
  "data/reddit-ask/r/AskWomen/comments/uh9l02/ladies_living_alone_what_do_you_do_when_you_get.json": "How do people deal with being unsettled or creeped out, even scared when there's\nno one else in the house? Specifically with the horror medium, like scary movies\nor unsettling games. Even just feeling like there's something in the corner in\ngeneral. Not situations where you might actually be in…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/uhfhhf/why_is_all_porn_with_people_of_colour_relegated.json": "Any time you're on a porn site different ethnicities have their own category,\nlike 'Asian', 'ebony', 'Indian' etc., but porn with white performers doesn't\nhave to be searched for under 'white' even though the category does exist. But\nit's almost like they push the other races to their own…",
  "data/reddit-ask/r/AskWomen/comments/uhhvs3/abortion_rights_and_access_megathread.json": "What are your thoughts and experiences about abortion rights and access? What\nresources would you recommend to people regarding these topics?\n\n * This post is in contest mode and only top level responses are permitted. Do\n   not reply to someone else's comment and do not leave a top level comment\n …",
  "data/reddit-ask/r/TooAfraidToAsk/comments/uhddar/do_people_really_care_which_way_the_toilet_paper.json": "Do people care or is it just something to \"be right about\"",
  "data/reddit-ask/r/TooAfraidToAsk/comments/uhgqmk/why_do_so_many_people_think_danny_devito_is_sexy.json": "I have nothing against him as a person, but I don’t see what everyone else sees.",
  "data/reddit-ask/r/askscience/comments/uh9s9e/why_do_so_many_new_drug_names_end_in_umab.json": "Just wondered what it’s derived from. I’ve seen many drugs ending in umab or\nmab, especially in clinical trials.",
  "data/reddit-ask/r/askscience/comments/uhlfvw/what_would_be_observed_by_two_objects_moving_at.json": "From how I understand it, all velocities are relative, and nothing can surpass\nthe speed of light. So I would assume this means you can't observe anything move\nfaster than C, but what I can't grasp is what an object moving at, say, 99% of C\nwould observe if another object was moving at the same…",
  "data/reddit-ask/r/askscience/comments/uhjsee/why_isnt_apparent_gravity_greater_at_the_poles.json": "If centifugal force increases with the radius of rotation (all else staying the\nsame), why doesn't our apparent weight vary depending on our relative distance\nfrom the equator i.e. if there is less centrifugal force at the North/South Pole\nto balance the constant gravity, why don't we feel like we…",
  "data/reddit-ask/r/Ask_Politics/comments/uha3w1/before_roe_v_wade_is_overturned_what_is_stopping.json": "The draft Supreme Court opinion was just leaked / shared; Roe and Casey will\nlikely be reversed. What is stopping the current Democratically controlled\nCongress (the Senate is split 50-50, but VP Harris could cast a tie breaking\nvote) from passing a federal law protecting abortion patients and…",
  "data/reddit-ask/r/NoStupidQuestions/comments/uhpsvw/why_is_the_us_supreme_court_overwhelmingly.json": "A quick preface: I am not American, I am not seeking an argument, I am not\ndebating the legality or morality of any individual topic.\n\nI am interested in the recent history that led to this trend. Wikipedia says\nthat as many as seven of the justices are Catholic; definitely six. Is there a\nroot to…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/uhr8f3/heterosexual_people_regularly_say_that_person_is.json": "I don't mean this in a negative way at all, but it happens. I'm just wondering\nif it goes both ways.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/uhguxi/why_are_christian_conservatives_such_hypocrites.json": "Whenever we ask them trust science it's always \"Never believe everything youre\ntold. Don't ask question\", but whenever we ask them why did God let slavery\nhappen then it's always \"God works in mysterious ways. Who are you to question\nhim?\" What's up with that?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/uhsr68/can_people_really_just_not_have_sex.json": "Maybe it’s just me being a massive virgin but is it really that hard to just not\nhave sex. I see all these relationship post about not being able to have sex\nwith their wife or husband and they want a divorce. Like just wank one out and\nmove on. Yeah I know it’s a natural biological want but damn…",
  "data/reddit-ask/r/NoStupidQuestions/comments/uhsc8h/isnt_the_q_in_lgbtq_a_bit_redundant.json": "Wikipedia describes queer as an umbrella term for anyone not heterosexual or\ncis. Those both get covered by the LGBT in the name, so why is it included? I'm\nnot about excluding groups of people but it seems like the abbreviation already\nhas every base covered. EDIT: added the \"not\" in between \"I'm…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/uhzbd9/why_do_so_many_people_caregive_a_shit_about_depp.json": "I mean its not like we don’t have more important news to cover. Why do we even\ncare about this so much. Is there going to be any huge changes to the law or\nsomething due to this case?. Will either of them be jailed after this?",
  "data/reddit-ask/r/AskHistorians/comments/ui0dm6/what_was_student_life_like_at_a_medieval_european.json": "I have absolutely no idea what medieval universities were like and especially in\nwhat way they differ from modern universities. I read quite a bit about\nuniversities in the early modern period but I imagine that they were quite\ndifferent before printed books became available. So roughly from 12th…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ui2z2q/the_homosexual_people_who_marry_straight_people.json": "So a lot of gay/lesbian people marry straight people, have children and then\ncome out. They are then lauded as brave. But their SO, who lived a life of lie\nare forced to not only accept it, but also appreciate their brave decision. It\nalways confuses me. Isn't it better to stay single than hurting…",
  "data/reddit-ask/r/askscience/comments/uhxele/is_crying_an_inflammatory_process.json": "After I cry, especially for a while, my eyes feel sore and my eyelids get puffy\nand red, and they can take almost a day to feel back to normal. I also feel\ntired for the next +/-12 hours.\n\nIs there an inflammatory feedback mechanism from crying?\n\nAlso, this brings up another question: does anyone…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ui4njz/why_do_so_many_people_list_their_mental_health.json": "Honestly don't understand it myself but I'm genuinely curious about the\nmotivation. Is it to get sympathy? Is it to brag? Is it to obtain power through\nvictimhood? Is it seen as their direct personhood? Something else entirely?\nAnyone who does this and can shed some light on it, I would very much…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ui4nxb/how_much_does_having_a_baby_cost_in_the_united.json": "To clarify, I mean giving birth",
  "data/reddit-ask/r/askscience/comments/ui7vwy/does_the_original_strain_of_covid_still_exist_in.json": "What do we know about any kind of lasting immunity?\n\nIs humanity likely to have to live with Covid forever?\n\nIf Covid is going to stick around for a long time I guess that means that not\nonly will we have potential to catch a cold and flu but also Covid every year?\n\nI tested positive for Covid on…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/uhxryu/how_am_i_supposed_to_find_happiness_and_joy_in_a.json": "I know it's bad that I see more evil in the world than good, but it just seems\nlike the more realistic way to see things. It's impossible to avoid it. If I\nturn off all news and media information and keep myself away from reddit, I'm\nlooked at differently because I'm uninformed. Yet if I keep…",
  "data/reddit-ask/r/AskWomen/comments/ui2nv5/whats_your_favourite_dinosaur_and_why.json": "Mine is a megalodon, because they’re the biggest sea creature.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ui7xwm/have_you_ever_looked_in_the_mirror_and_instantly.json": "It’s almost like a disassociation feeling. Idk but it's really bizarre when it\nhappens.",
  "data/reddit-ask/r/NoStupidQuestions/comments/uib4cc/how_did_bullshit_become_the_premier_animal_shit.json": "When you feel as if someone is lying you would say \"bullshit\". So how did the\nbull become the premier animal for shit? Why not \"hipposhit\" or \"lionshit\" or\nmaybe even \"sharkshit\". I guess it flows off the tongue better.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ui7pqu/is_the_usa_really_that_bad_of_a_place_to_live_in.json": "Every USA post mentioned:\n\n * Unlivable wage\n * No Vacation days\n * No healthcare\n * Political divide",
  "data/reddit-ask/r/TooAfraidToAsk/comments/uiglf1/why_is_it_hard_for_guys_to_get_hard_around_me.json": "So I'm 21 and a woman. I've also noticed that sometimes the first time I have\nsex with a guy they can't get hard. I think I'm hot, I've been told that's not\nthe problem. But I don't understand why it keeps happening. Like it's happened\nwith 7 different guys. It's only the first time and after that…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/uikbum/why_do_i_love_penis_so_much_does_this_make_me_a.json": "Is this weird? I love the way they look. Some people say they are so gross, but\nI love looking at them?? Is this weird?\n\nAnd given the opportunity, if one of my guy friends whipped one out, I wouldn’t\nbe opposed to giving a bj?? It’s never happened before btw, but I don’t want to\nbe a whore for…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/uihoi5/when_people_talk_about_student_debt_cancellation.json": "It seems like a more palatable middle ground and maybe even a stepping stone to\nfull cancellation?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/uij8f5/would_a_man_be_considered_in_some_way_rude_if_he.json": "I was literally just wondering this the other day thinking about how I've been\nin a relationship for the last 10 years so I've never had to experience online\ndating apps, I'm also a women but I've just obviously noticed the heavy\nfiltering on everyone's pictures nowadays, and I was just wondering…",
  "data/reddit-ask/r/NoStupidQuestions/comments/uig4tg/if_we_somehow_all_ignored_the_kardashians_would.json": "Like one day everyone un follows them, no one even looks their way in the\nstreet, they're just ignored like they don't exist. Would they stop being\nfamous??",
  "data/reddit-ask/r/NoStupidQuestions/comments/ui9c88/could_joining_them_satanic_temple_actually.json": "I’ve seen people mentioning joining TST to protect their right to an abortion. I\nhonestly don’t entirely know what is happening right now, I don’t know what\nsources to follow and who to listen to. I’ve heard people mentioning TST and how\njoining and being a member could protect my reproductive…",
  "data/reddit-ask/r/askscience/comments/uim2zz/are_bird_songs_learned_or_built_into_the_birds_dna.json": "If a bird (the type who has distinct recognizable calls) is hatched/raised in\nisolation, will it still know how to do it's distinct bird song? Or are these\nsongs always learned and just passed down generation to generation?",
  "data/reddit-ask/r/AskHistorians/comments/uiodn0/has_there_ever_been_a_genocide_against_dumb_people.json": "I mean this in the sense of how Cambodia under the Khmer Rouge there was a\ngenocide against intellectuals I wanted to know has the opposite ever happened?\n\nThis isn’t a means to hate anyone I just had this question in my head for a few\nmonths. This isn’t meant to hate just to learn",
  "data/reddit-ask/r/TooAfraidToAsk/comments/uiomw9/i_live_with_someone_i_truly_hate_if_say_he_needed.json": "Guys please know that I will call the paramedics if need be. I was just curious\nthat's all.",
  "data/reddit-ask/r/NoStupidQuestions/comments/uilivy/if_face_masks_are_completely_useless_then_why.json": "Many people today refuse to wear masks because they say it's completely useless\nand it doesn't work. But here's the funny thing, before the pandemic, I would\nget sick 1-2 times per year during Fall/Winter. I would get bad colds or the\nflu. It's been that way since I was a kid. I just catch sickness…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/uih1cp/has_anybody_noticed_that_our_society_hops_from.json": "The title says it all. As far back as I can remember, every few weeks or so our\nsociety hops onto a new \"important\" subject, while the previous fixation\ncasually fades from memory. Seemingly with no resolution. We just conveniently\nforget once the next thing comes to our table to consume.\n\nMaybe…",
  "data/reddit-ask/r/AskHistorians/comments/uirq6s/do_modern_largescale_organized_hooligan_fights.json": "We've all seen film depictions of medieval or ancient battles where everyone\ngets chaotically intermingled after the first charge and start fighting with\nabsolutely no cohesion, much less a battle line. It never makes much sense,\nexcept maybe to show how heroically badass the main character is. But…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/uix3jd/people_who_refuse_to_move_out_of_the_passing_lane.json": "All 50 states have (seldom enforced) laws that prohibit left lane travel unless\npassing to some degree, its obnoxious, and having to pass on the right is\ndangerous. Why do you refuse to stay in the proper travel lane?",
  "data/reddit-ask/r/askphilosophy/comments/uido7y/recent_philosophy_graduates_what_did_you_end_up.json": "STUDYING PHILOSOPHY\n\nI'm currently a junior, and I've been studying philosophy for about a semester\nnow. Originally, I was a computer science major, yet I realized two years into\ncollege that I didn't want to do software. (1) I'm really not passionate about\nit, as I thought I was. (2) I don't want…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/uitzh7/if_stds_were_eliminated_and_there_was_a.json": "I recently overheard two blokes chatting. One was saying about that his\ngirlfriend wasn't adventurous in the bedroom. So his friend asked why he was\nstill with her. Shallow, I know. And his response was \"I know she's clean, and\non the pill\".\n\nSo if these factors were eliminated, would more people…",
  "data/reddit-ask/r/NoStupidQuestions/comments/uitgjt/why_does_reddit_want_me_to_make_a_user_avatar_so.json": "I think they're all ugly and prefer having my own profile picture. Yet I always\nget free gift notifications for randomized avatars.",
  "data/reddit-ask/r/NoStupidQuestions/comments/uivja9/why_is_saying_i_love_you_portrayed_as_having_a.json": "Is it a US thing or a Hollywood thing?\n\nSure, \"I love you\" is a serious thing to say. But a premature confession of love\nending a relationship right there and then is taking it a bit too seriously IMO.",
  "data/reddit-ask/r/askscience/comments/uiuz92/i_got_a_new_deodorant_recently_that_says_that_it.json": "I.e. when you consider the concentration that they're in in deodorant and when\nyou consider that people use a tiny amount of deodorant once or twice a day, are\nthose amounts of aluminum and parabens harmful to humans?",
  "data/reddit-ask/r/NoStupidQuestions/comments/uj4xkv/why_do_male_doctors_choose_gynecology_as_their.json": "What is it that draws them to this part of medicine more than other\nspecialities?",
  "data/reddit-ask/r/askscience/comments/uj2gdt/can_your_immune_system_create_resistance_against.json": "Say you got a bacterial chest infection and was prescribed antibiotics to treat\nit. Would your immune system create some kind of resistance to it if you were to\ncome in contact with someone else who had the same infection after you'd\nrecovered?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/uj99fj/what_happens_to_people_who_died_with_contact.json": "Edit: Thank you kind stranger for the first award I've ever had!!",
  "data/reddit-ask/r/NoStupidQuestions/comments/uj4mjv/how_does_1_million_covid_deaths_not_make_a.json": "https://www.worldometers.info/coronavirus/country/us/",
  "data/reddit-ask/r/TooAfraidToAsk/comments/uj7y3i/do_fat_people_struggle_to_have_sex.json": "I don't know how to word this and not sound rude, reality I am just curious, I'm\nfairly middle sized, as well as my partner and even tho we don't exercise much,\nwe do some, and more often than not it comes to a point in sex were we have to\nchange whatever we are doing and leave it to the other…",
  "data/reddit-ask/r/NoStupidQuestions/comments/uj0zrc/am_i_crazy_or_is_there_a_culture_on_reddit_where.json": "I've only had my reddit account for about a week, but I feel like I'm always\nseeing people bickering in comment sections, constantly trying to one-up each\nother in terms of knowledge over stupid things that they search up on google\nwhile pretending to have 30 years of experience in whatever stupid…",
  "data/reddit-ask/r/AskHistorians/comments/uj12ew/what_did_the_native_americans_think_about_tornados.json": "I'm assuming that the so called \"tornado alley\" has been a long standing weather\npattern and could have affected any tribes living in the area.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ujcpai/if_phones_are_a_driving_distraction_why_do_cops.json": "Distracted driving by cell phone causes 1.6 million crashes every year. Why do\ncops get a free pass?",
  "data/reddit-ask/r/NoStupidQuestions/comments/ujbplr/do_your_music_tastes_stop_evolving_as_you_get.json": "I hope I'm not being disrespectful in the title, but I wanted to be as direct as\npossible.\n\nI've had the privilege of working with 'older' to elderly people under different\nsettings, and I notice that, without fail they all listen to music that's at\nminimum 15 years out of the times. The older they…",
  "data/reddit-ask/r/askscience/comments/ujbqj4/is_there_a_consensus_in_the_scientific_community.json": "Sights & sounds can be measured in terms of brightness or loudness. Periods of\ntime can be measured by length - e.g. minutes or months.\n\nPeople with time blindness\n[https://obeythetimer.com/#34a2c878-d58c-4ff8-a8f4-b027aa459de7] cannot\naccurately sense or measure the passing of time without…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ujir0u/why_are_so_many_questions_posted_in_this_sub.json": "like seriously why don't people just take 2 seconds to google it and find out if\nthey're so curious?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ujf0sw/am_i_weird_for_wanting_to_move_out_of_the_united.json": "I feel like this country isn't true for me and after traveling many times to\nother locations, I found way more opportunities for me. So many opportunities. I\nfeel like I don't need to be here or my time is up. Time to move on to a\ndifferent country and start a new life.\n\nI'm not planning now but…",
  "data/reddit-ask/r/AskHistorians/comments/ujlsbf/what_did_the_habsburgs_think_about_the_habsburg.json": "I'm curious if there are any records of what the Habsburgs thought about their\ndistinctive 'Habsburg jaw'. Did they notice that it was prevalent in their\nfamily, or did they think it was normal? If they did notice, what did they think\ncaused it?\n\nAn additional question I have is, what did…",
  "data/reddit-ask/r/AskHistorians/comments/ujci8l/ancient_roman_elites_and_historians_discussed.json": "Roman war-gaming and speculations about fighting an alt!history war against\nAlexander and the Macedonian Empire is discussed in Barnett, G. (2017)\n\"Emulating Alexander: How Alexander the Great’s Legacy Fuelled Rome’s Wars With\nPersia\".",
  "data/reddit-ask/r/NoStupidQuestions/comments/ujc4an/is_it_ok_if_i_dont_watch_or_read_about_the_news.json": "Idk I used to watch my local news every day but then I stopped and it honestly\ndoesn’t feel that bad. I know that people say news are really important because\nit informs you but is it really worth it? I don’t feel like keeping up on it\nbecause it’s just too toxic and it’s not even related to me and…",
  "data/reddit-ask/r/NoStupidQuestions/comments/ujjwid/a_friend_of_mine_passed_away_recently_and_now_his.json": "A dear friend of mine (and of so many others) recently passed away. I've been\ncoping by listening to his Spotify playlists. I know this sounds dumb, but his\nusername is now just a series of numbers, rather than his name. I want to be\nsure this isn't some indication his account is going to be…",
  "data/reddit-ask/r/AskWomen/comments/ujliyl/ladies_who_watch_anime_what_are_your_least.json": "Character types? Plot points? Overly common occurrences?\n\nI love anime but there’s definitely certain things I don’t care for. What are\nyours?",
  "data/reddit-ask/r/NoStupidQuestions/comments/ujn7ia/my_entire_apartment_has_just_started_to_smell.json": "Edit: Never mind. My foreign room mate had durian fruit in the fridge. I could\nsmell it up two flights of stairs amd through two doors. That shit is rank.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ujl5em/serious_what_are_some_of_the_benefits_of_having_a.json": "I mean someone around ~4.5in",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ujmi9k/why_is_it_more_important_to_over_turn_r_v_w_than.json": "I just read there's a major shortage of baby formula in the US, basically\nshelves are empty and moms across the country are freaking out. Nearly half of\nall babies in the US are bottle fed.\n\nEdit: That's around 1.8 million bottle fed babies in the US as of May 2022. The\nshortage is currently 31%…",
  "data/reddit-ask/r/AskHistorians/comments/ujf24v/how_much_was_the_demise_of_american_streetcars.json": "I was rewatching a Climate Town video [https://youtu.be/oOttvpjJvAo], the thesis\nof which is that GM et al. killed mass transit in a deliberate and successful\nattempt at creating car centric development and selling more cars. However, I've\nheard elsewhere, without detail, that the fuller story is…",
  "data/reddit-ask/r/NoStupidQuestions/comments/ujkuoy/what_should_one_be_thinking_about_when_trying_to.json": "Whenever I go to bed I start thinking about negative things from my past or any\nanxious thoughts I've about the future, they just unintentionally pop up in my\nhead. So I end needing hours to fall asleep because I've all these dilemmas,\nconservations and scenarios going on in my head.\n\nAny way of…",
  "data/reddit-ask/r/TrueAskReddit/comments/ujl5r2/non_american_here_why_are_so_many_republic_anti.json": "Not trying to be political, just looking to understand how your system works.",
  "data/reddit-ask/r/AskHistorians/comments/ujwm0b/why_does_italy_seem_to_get_a_pass_in_wwii_for_be.json": "If I mention the Italians in WWII bombed my mom’s country non-stop for about two\nyears and tried to starve the people there, Italian Americans look at me like I\njust kicked their dog, while they have no issue talking about what Germany or\nJapan did. In fact, in the US, it seems we acknowledge Italy…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ujy47x/why_is_it_that_whenever_someone_shows_me_the.json": "I am a 30M. Over the last several years of my life, I had kids, got divorced,\nand live by myself now. I felt physically starved for affection from my wife\nthroughout the entire duration of our marriage and she would always just say \"it\nfeels unnatural for me to want to touch you\" or \"that's just…",
  "data/reddit-ask/r/NoStupidQuestions/comments/ujym7h/who_the_actual_fuck_is_keeping_black_liquorice.json": "I have yet to meet another human being that tastes the equivalent of a\ngangrenous haemorrhoid and is like \"this is some serious gourmet shit\". It's the\nDomino's pizza of candy, the most egregious use of the word \"food\" and yet it's\nproduced worldwide with profits evidently.\n\nThere is unholy amount…",
  "data/reddit-ask/r/AskHistorians/comments/uk1p8d/a_recent_slate_article_claims_that_to_colonial.json": "The Slate article can be read here\n[https://slate.com/news-and-politics/2022/05/ben-franklin-american-instructor-textbook-abortion-recipe.html].",
  "data/reddit-ask/r/askscience/comments/ujm4z3/are_lobsters_lives_limited_only_by_their_ability.json": "So, what I've heard is that lobsters keep growing throughout their life, getting\nbigger with each moult. I've also heard that the reason lobsters will die at a\ncertain age is not because of internal processes, but because they are unable to\neffectively moult and die as a result.\n\nFirstly, is this…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/uk1lq9/do_you_also_have_no_opinion_on_the_johnny.json": "The internet comments of this trial are reminiscent of anti-vaxxers where the\nentire comment section has one opinion which would lead someone impressionable\nto form the same opinion without any evidence.\n\n.... i also have no opinion on Jeffrey Epstein's death for the same reason\n\nunless i watch the…",
  "data/reddit-ask/r/AskWomen/comments/uk7nda/what_screams_entitlement_in_a_man.json": "As a woman, when you meet a man, what does he do or say that makes you instantly\nrealize that he is a spoiled brat?\n\n*Idea taken from AskMen sub.",
  "data/reddit-ask/r/AskHistorians/comments/ukarat/why_have_humans_been_around_for_200000_years_yet.json": "What happened the whole 194,000 years before that?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ukbou3/why_do_westerners_focus_so_much_on_white.json": "It seems they all focus on how bad white people are and how these “colonizers”\nare evil for taking land from native Americans. But virtually every culture has\ndone that to each other and everybody else has just left it as history and moved\non.\n\nLike even native Americans invaded each other for…",
  "data/reddit-ask/r/NoStupidQuestions/comments/ukcodc/do_most_adults_go_to_bed_at_8_pm_like_my_parents.json": "So I constantly have this conversation with my parents and thought I would ask\nhere as well. My parents (moreso my dad) goes to bed at 8 p.m. and gets up at 4\na.m. because he starts work at 6 a.m. I know that's really early and so him\ngoing to bed when he does makes sense. My mom goes to bed later…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ukdprx/why_is_america_considered_the_land_of_the_free.json": "Not only the largest on the planet, but we have the largest incarcerated\npopulation in the history of our entire species. No joke, we have more people in\nprison/jail than any other time or civilization ever has. Last year alone we\npassed 120,000 laws on the local, state, and federal levels. Isn't…",
  "data/reddit-ask/r/AskHistorians/comments/ukju68/in_1973_the_southern_baptist_conventions_news.json": "The SBC used to be very pro-Choice in its outlook (compared to now). According\nto polls conducted by baptist organziations, most baptist pastors were in favor\nof allowin abortions in certain circumstances.\n\n> In 1970, a poll conducted by the Baptist Sunday School Board found that 70\n> percent of…",
  "data/reddit-ask/r/AskWomen/comments/ukf14n/women_of_reddit_what_is_your_ideal_occupation_for.json": "I am just curious if a majority of women have a preference on occupation when\nlooking for a spouse. If so, what is the occupation and what is the reasoning\nbehind it?",
  "data/reddit-ask/r/NoStupidQuestions/comments/ukpvwr/my_girlfriend_goes_on_2448hr_long_drug_alcohol.json": "I'll go out for drinks with my girlfriend, well have fun then she would\ngenerally want to stay out. At about 3-3:30am, I'll go home to bed, I feel like\nthat's a solid night & she would choose to stay out because she doesn't want the\nnight to end. She's already been drinking heaps of alcohol &…",
  "data/reddit-ask/r/askscience/comments/ukey9p/if_allergies_can_come_from_repeated_exposures_why.json": "Correct any assumptions I may have made, but I have read about how allergies can\ncome from repeated exposures to something. For example, I've read the story\nabout how cockroach researchers eventually become allergic to them, and in turn\nhave an allergy to instant coffee.\n\nHow come we aren't…",
  "data/reddit-ask/r/NoStupidQuestions/comments/ukq6xr/is_the_thin_blue_line_flag_considered_a.json": "I know that it's become a symbol for Blue Lives Matter, but is the black, white,\nand blue flag considered a desecration of the American flag? And is law\nenforcement legally allowed to fly it while on duty without being considered a\nterrorist group? I don't really understand how it's legal to fly…",
  "data/reddit-ask/r/askscience/comments/ukp3eb/why_does_a_camera_exist_for_infrared_visible_and.json": "What is the difference between these waves that allows something like a camera\nto work or not work?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ukrccq/what_feminine_products_are_needed_in_workplace.json": "I (M50) run a business office with all female employees ranging in age from\n23-50yrs. I think I need to stock the restroom with \"female\" things, but I have\nno clue what, how much, where to put, etc.\n\nWhat should I buy, where should I keep it, etc.?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ukx3kv/why_arent_skinny_menwomen_celebrated_in_the_body.json": "EDIT my mistake for not elaborating in the title or wording it better, people\nseem to be only focusing on the skinny women aspect. What about larger men,\nshort men, people with scars and deformities, they aren't celebrated or\nrepresented in this either and it does damage them also. I'd like to…",
  "data/reddit-ask/r/AskHistorians/comments/ukuraf/is_it_true_that_maternal_death_in_childbirth.json": "I read a recent viral Twitter thread\n[https://twitter.com/RafaellaMarcus/status/1522866190321950721?s=20&t=SQVjLPTkRhtXkeckDauChA]\nwith this eye-catching claim and was wondering if anyone here could verify it\nand/or could provide some more context to the state of maternal death…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ul0gbt/why_do_neopronouns_even_matter.json": "Okay, so today I was reading a Wattpad book and at the introduction/about the\nauthor section, the writer said, “I go by xem/them,” and then said, “Please\ndon’t call me by she/he, queen, king, girl, boy.”\n\nAnd I seriously wanted to know: Why?\n\nI got the vibes of “Don’t or else”.\n\nWhy not just go by…",
  "data/reddit-ask/r/NoStupidQuestions/comments/ul1phf/why_does_the_majority_of_americans_seem_to_hate.json": "Growing up in Germany and being used to the fact that in my country, everybody\ncontributes to healthcare and social benefits so people in need can at least\nhave a decent form of livelihood, I just don't get why - at least in my view -\nthe consensus of Americans don't get along with this idea and…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ul1hsy/is_it_wrong_to_sexualize_people_i_know_in_my.json": "I have been doing this for a long time with some friends I am attracted to. I\ndon't treat them any differently, unless I have a crush on them. But I just like\nto imagine myself dating and having sex with some people, and it feels normal\nand wrong at the same time.",
  "data/reddit-ask/r/NoStupidQuestions/comments/ul0aou/do_you_think_sex_education_should_be_an_entire.json": "I ask this question as I feel like the education system did a poor job of\nteaching sex education in my primary and secondary education school.\n\nI don't want to blame them. However, I remember the two instances where I learn\nabout sex. Once in primary school, where it talked about puperty, and once…",
  "data/reddit-ask/r/askscience/comments/ukxqb1/why_are_so_many_of_the_worlds_deepest_caves_in.json": "7/45 of the worlds biggest caves are in Georgia, including the top 4. Why is\nthis? What is so special about the geology of such a small country that in\ncontains such deep caves?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ul2z9l/why_is_dissing_christians_not_considered_racist.json": "Last I checked both Christianity and Islam are religions, not races... So what's\nthe deal here? (Please don't cancel me I'm asking out of pure curiosity)",
  "data/reddit-ask/r/NoStupidQuestions/comments/ul401f/just_got_a_letter_from_rip_medical_debt_org.json": "They paid like 80k worth? Is this legit? I looked them up online and they seemed\nto be but this can’t be real",
  "data/reddit-ask/r/AskHistorians/comments/ul1vvd/when_did_english_noble_titles_stop_being.json": "Like most Americans whose exposure to feudalism is mostly through GoT and\nCrusader Kings, I had just assumed that the \"Duke of York\" had a domain over all\nlands within the Duchy of York.\n\nAnd it seems like at some point in English history this might have been true?\nBut then later they seem to be…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ul3kyv/why_do_people_praise_the_outfits_celebrities_wear.json": "Entirely possible and totally valid if the answer is just that I'm too stupid\nand uncultured to appreciate art or something, but some of these outfits look\nreally ridiculous and unflattering and appear to be made just to attract\nattention without actually looking good",
  "data/reddit-ask/r/NoStupidQuestions/comments/ul3kty/whats_the_proper_etiquette_for_using_a_gift_card.json": "My wife and her family claim that when someone gives you a gift card to wherever\nyour obligated to spend on something considered a gift. Like if you get a gift\ncard for Amazon you have to use it to buy something like a movie or game, you’re\nnot supposed to use it for like groceries or normal…",
  "data/reddit-ask/r/askphilosophy/comments/ukufbr/is_logic_invented_or_discovered.json": "Is logic something humanity made as a product of human conceptualization or was\nit discovered to be a property of reality or both?\n\nIf it was discovered to be a property of reality, what might a reality with\ndifferent logical properties look like and how might it function?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ul94lj/can_yall_help_me_get_10_karmas.json": "This thread is called ‘too afraid to ask,’ and I am afraid to ask for help here.\nI need 10 Karmas to participate in a local thread and I’m not sure how to get\nthere organically. Any help from the community would be great!",
  "data/reddit-ask/r/NoStupidQuestions/comments/ul5sov/i_was_mistakenly_arrested_for_child_porn_charges.json": "In college, I shared an apartment with several people. Everyone used my\ncomputer. One day someone went somewhere they should not have on the internet\nand \"it\" happened.\n\nSince the computer was mine, I was charged. But during the investigation, I was\nable to prove it wasn't me because I was out of…",
  "data/reddit-ask/r/NoStupidQuestions/comments/uldalj/do_you_ever_stay_up_way_too_late_just_so_you_can.json": "I'm doing this more and more with exam season coming up. How do I stop?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ulgqiu/why_not_have_sleepovers_as_adults.json": "Remember when you were a kid? How fun sleep overs were? Staying up all night,\nplaying games with your friends? Talking until the sun came up and then falling\nasleep in the living room mid conversation…At what age did you stop doing that?\nWhy? Why does being an adult have to mean losing fun?…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ulf2vw/do_you_also_forget_nearly_everything_about_the.json": "I can get completely absorbed by the plot in a movie, series, videogame or book\n- only to forget it completely some time later. I don't mean forgetting specific\ndetails - I mean I can rewatch/replay/re-read the same thing some months later\nand be surprised (again) by major plot twists or simply…",
  "data/reddit-ask/r/NoStupidQuestions/comments/ulh7i6/lets_say_that_someone_you_cared_about_very_very.json": "ETA: Thanks to everyone who's replied so far. Needed a little faith in humanity\nrestored tonight.",
  "data/reddit-ask/r/askscience/comments/uldard/where_was_the_hawaiian_islandshotspot_located_in.json": "Where was the Hawaiian islands/hotspot located in the Mesozoic? I believe that\nthe current islands didn’t exist until the Cenozoic, and that the oldest of the\nEmperor Seamounts existed during the Cretaceous period, but I have no idea where\nthe hotspot was located or when it was created.\n\nAlso, I’m…",
  "data/reddit-ask/r/AskHistorians/comments/ul8l7k/the_median_age_of_death_in_many_cemeteries_in_6th.json": "I've read that once you account for infant mortality, the average lifespan of a\nmedieval human isn't too different from a modern human. But I also ran into the\nfact that apparently the median age of death was very low in the 6th century.\nHow can we reconcile this difference?",
  "data/reddit-ask/r/NoStupidQuestions/comments/ulgbkt/why_is_it_required_that_most_cashiers_have_to_be.json": "Would seeing a cashier sitting down bother you at all? If cashiers had stools to\nsit down on, what harm would that do?\n\nWhy do most companies make cashiers stand?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ulkmoq/why_do_some_gun_owners_seem_to_fantasize_about.json": "I know this is not every single person that owns a gun, however I have met more\nthan one person who thinks this way. It's like they almost hope that something\nlike this happens to them because the want to kill a human being without\nconsequences. It's one thing to own a gun but it seems like such a…",
  "data/reddit-ask/r/askscience/comments/ukzfir/why_do_ion_engines_prefer_high_molecular_weight.json": "I've recently reading about new advances in rocket propulsion technology.\nLeaving aside other considerations like ionizability, chemical stability, etc.,\nwhy does either propulsion system prefer the \"opposite\" extreme of propellant\nmolecular weight? From what I gather online, ion engines tend…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ulh880/what_is_so_hard_to_understand_about_calories_in.json": "As someone who has lost about 60lbs, I get lots of questions from friends da\nabout how to go about loosing weight. I tell them it is simple math where your\ncalories in need to be less than your calories out in order to lose weight. But\nthey are so caught up on teas and keto that this doesn’t make…",
  "data/reddit-ask/r/NoStupidQuestions/comments/ulid0t/if_dogs_have_such_a_keen_sense_of_smell_how_come.json": "Like seriously, it's right there, I'm telling her it's there come eat it, and\nshe's sniffing and she takes like 20 seconds to find it!",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ulr6vh/will_girls_tell_their_friends_that_im_small_down.json": "Just always wondered!",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ulrtew/why_arent_johnny_deppamber_heard_prosecuted_for.json": "So I apologize if this is a stupid question… but in the JD/AH trial, both sides\nare giving evidences of using illegal substances like cocaine, MDMA and shrooms.\n\nWouldn’t this make them both guilty of using illegal drugs? Does this not matter\nbecause it’s not related to the current trial? And would…",
  "data/reddit-ask/r/AskWomen/comments/ultix0/in_your_opinion_what_is_the_dumbestsilliestmost.json": "Manufactured beauty concern meaning something media or the powers that be have\nmade (“made”) women feel concerned about. Examples include but are not limited\nto: hip dips, strawberry legs, stretch marks, etc.\n\nThe female body is way too micromanaged! We know that all the “manufactured\nbeauty…",
  "data/reddit-ask/r/askscience/comments/ultkcv/are_there_any_extinct_animals_recorded_in_cave.json": "Could there be cave paintings containing animals we haven't found fossil records\nfor yet? And if there were, how would we tell if the animal being depicted was\nactually real and not some made up creature?",
  "data/reddit-ask/r/NoStupidQuestions/comments/ulvnka/bf_proposed_said_exs_name.json": "So tonight my bf(34) and I (28) went to my parents house to ask for their\nblessing.\n\nand he said his ex’s name before correcting himself and saying my name.\n\nHe hasn’t been with her for over 10years and has been married since her.\n\nI know she was a big part of his life a very long time ago. So I…",
  "data/reddit-ask/r/NoStupidQuestions/comments/uluvqy/do_you_wash_the_bottoms_of_your_feet_in_the_shower.json": "After a confrontation with a flatmate over dirty water stains on the bathroom\nfloor, he confessed that he never washes the soles of his feet when he's\nshowering. I spoke to my other flatmate and he also says he doesn't either...\n\nThis completely baffles me, I wash the soles of my feet without…",
  "data/reddit-ask/r/NoStupidQuestions/comments/ulqms9/why_does_timereality_feel_so_different_nowadays.json": "Ever since the pandemic I feel like reality or time itself has been really\nweird. I feel like as if we've entered another dimension/universe. For instance,\nlast week seems like a month ago even though it passed fast. Am I crazy or\nwhaaat?",
  "data/reddit-ask/r/AskHistorians/comments/ullmea/have_there_been_any_wars_in_which_the_aggressor.json": "Apologies if this is a slightly vague question or not appropriate to the study\nof history. There seem to be several wars such as the world wars in which, while\nhardly universal, there is nonetheless often considered to be ‘good guys’ and\n‘bad guys’ by modern western media and perception. As far as…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ulvuc7/why_the_fuck_doesnt_flint_have_clean_water_yet.json": "That’s pretty much the whole question. It’s been 8 years what the fuck is going\non.",
  "data/reddit-ask/r/AskHistorians/comments/ulhnpg/im_the_son_of_an_ancient_chinese_emperor_my.json": "I saw this question asked before, but I don't believe it was answered.\n\nRegardless, I've read a bunch of stories about how various ambitious members of\nthe nobility--in multiple cultures, but I'm going to focus on ancient China--in\nline of succession would be having each other assassinated.\n\nIt…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ulsmms/why_is_there_no_word_for_someone_from_the_us_that.json": "In Spanish they are called \"Estadounidenses\", which refers to the country itself\nnot the continent",
  "data/reddit-ask/r/AskHistorians/comments/um1px6/hiroo_onoda_the_japanese_ww2_holdout_who.json": "Here's the link:\n\nhttps://www.theguardian.com/world/2005/may/28/secondworldwar.japan",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ulv78t/do_girls_really_get_complimented_that_much.json": "I’m a girl, and I don’t get compliments like at all. The most I get is my other\nfemale coworkers pointing out when do something different with my look. I\nthought this was normal and the whole “women get complimented all the time and\nmen don’t” was just incel stuff, but apparently it’s true?? All my…",
  "data/reddit-ask/r/AskHistorians/comments/um16rg/cornwall_was_a_major_source_of_tin_for_the.json": "I was reading this mentalfloss article\n[https://www.mentalfloss.com/article/86338/8-trade-routes-shaped-world-history]\nabout ancient trade routes, and am stumped by this unsourced paragraph:\n\n> One such tin route flourished in the 1st millennium BCE. It stretched from the\n> tin mines in Cornwall in…",
  "data/reddit-ask/r/AskHistorians/comments/um5otm/in_1374_the_knights_hospitallers_of_rhodes_took.json": "Were the Knights responsible for defending the city from other forces, such as\nthe Ottomans, or bandits? Did they act as a guard force? Accounts of the siege\nin 1402 mention that Timur's forces slaughtered the Christian population; was\nthat population already present, or were the Hospitallers…",
  "data/reddit-ask/r/NoStupidQuestions/comments/um9qej/how_do_male_pornstars_let_loose_so_much_love_fluid.json": "If this question is to NSFW point me towards the right subreddit. I've been\ndating this girl for a little over two and she is disappointed by the amount I\ncreate. I'm getting her across her finish line but since I'm not flooding her\ncaves she isn't completely satisfied. Another question I have. Has…",
  "data/reddit-ask/r/NoStupidQuestions/comments/ulul9x/what_do_you_do_with_your_wet_anus_after_using_a.json": "Like, are you supposed to just pull up your pants and soak them? Do you use a\ntowel? Do you sit there and wait until it's dry? Is there some kind of hairdryer\nfor your butt?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/umd3rf/what_is_the_proper_housekeeping_etiquette_for.json": "I’m newly married and get nervous about what to do with dirty sheets if we are\nstaying another night at a hotel. Airbnb’s often have a washing machine, but\nwhat do I do if we dirty our hotel sheets and need them changed? Do they do it\nautomatically or do I need to strip the bed so they put new ones…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/umenh7/how_long_could_i_survive_on_a_diet_of_nothing_but.json": "I’ve been wondering about this for a while. Assume I have unlimited buckets full\nof cum at my disposal. How much cum would I have to drink a day in order to get\nenough calories to survive? How long would I be able to live like that before\ndying of malnutrition? Also, what would my waste products…",
  "data/reddit-ask/r/NoStupidQuestions/comments/ume93r/do_people_who_stayed_virgins_till_marriage_but.json": "This isn't necessarily directed at people who won't have sex for religious\npurposes, but if you have input I'd love to hear it!",
  "data/reddit-ask/r/NoStupidQuestions/comments/umcqwi/how_do_i_stop_mansplaining.json": "So I am 16M and I have adhd. Unfortunately that comes with info dumping on\npeople. I genuinely do not have ill intention, I get excited about certain facts\nand I want to share them with everyone and I do this regardless of gender, if\nyou got ears and will listen, I will tell you all about flamingos…",
  "data/reddit-ask/r/NoStupidQuestions/comments/um559q/why_dont_they_sell_larger_tubs_of_pudding_cups.json": "I hate having to eat out of a bunch of these tiny cups when I eat my weekly\nserving of pudding.",
  "data/reddit-ask/r/AskHistorians/comments/uly622/how_did_the_rank_of_captain_in_the_army_and_navy.json": "In the US Army/Marines/Air Force, a captain is an O3, but in the Navy a captain\nis an O6. Were these ranks more comparable in responsibilities at some point in\nthe past?",
  "data/reddit-ask/r/askscience/comments/umhb2t/how_did_we_find_out_that_covid19_was_a_new.json": "With the symptoms being so close to the common cold or a flu, wouldn't most\ndoctors have simply assumed that the first patients were suffering from one of\nthose instead? What made us suspect it was a new virus, and not an existing one?",
  "data/reddit-ask/r/NoStupidQuestions/comments/umkzjk/whats_that_hand_gesture_in_old_cartoons_like_tom.json": "I don’t even know what to call it but in these cartoons if the characters\nreceive applause, they clasp their hands together and shake them beside their\nhead. What is that called?",
  "data/reddit-ask/r/AskHistorians/comments/umgzqk/are_gothic_buildings_supposed_to_be_scary.json": "A lot of gothic buildings, especially churches and mansions, look eerie or\nscary. Was this intentional? Or was that style just popular at the time and the\narchitects would be surprised that we (maybe just me) would see them that way?",
  "data/reddit-ask/r/AskHistorians/comments/um3nk0/how_did_the_world_outside_of_mexico_react_to_the.json": "Context: Ever since the end of the mexican revolution (civil war) until the year\n2000, the PRI party ALWAYS won EVERYTHING. Mexico was essentially a one-party\nstate. Such party surprisingly lasted MORE than the Soviet Communist Party in\npower. Some reforms in the 90s allowed for other parties to…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/uml3xs/is_it_cringe_to_go_alone_in_a_bar_to_speak_to.json": "(sorry for my poor English) I want to go in a bar to try to speak with strangers\nbut maybe they will find it weird. It's like a guy you don't know spontaneously\nwalks towards you and try to be friendly but he came with no friends. Same with\ngirls can I start flirting if I am alone? I just want to…",
  "data/reddit-ask/r/AskHistorians/comments/umqsfd/why_do_we_say_union_army_instead_of_american_or.json": "I know the answer is probably “to make it easier to differentiate” or “the Lost\nCause” but I’m wondering why we say Union rather than American when discussing\nthe US civil war. Union vs Confederates rather than American/US vs.\nConfederates? And for those who teach history, have you ever thought…",
  "data/reddit-ask/r/AskHistorians/comments/umh2js/tuesday_trivia_urbanisation_this_thread_has.json": "Welcome to Tuesday Trivia!\n\nIf you are:\n\n * a long-time reader, lurker, or inquirer who has always felt too nervous to\n   contribute an answer\n * new to /r/AskHistorians and getting a feel for the community\n * Looking for feedback on how well you answer\n * polishing up a flair application\n * one of…",
  "data/reddit-ask/r/NoStupidQuestions/comments/umvv12/why_dont_we_give_people_aged_7090_cocaine.json": ". I mean like if we really just let are bodies rot and are tired/sore all the\ntime just fucking load em up on some uppers and get the boomers active with some\nefficient coke use.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/umwsz6/my_husband_wont_have_sex_with_me_help.json": "We were just married in February. Before I got off birth control about two years\nago - I would say our sex life was relatively decent like maybe once a week or\nmore sometimes. However, he claimed he didn’t want me to get pregnant before our\nwedding which was understandable, so we had sex like once…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/umnujf/whats_the_worst_name_ever_given_to_a_boy.json": "Just wondering",
  "data/reddit-ask/r/TooAfraidToAsk/comments/umy0u3/will_a_guy_care_about_my_saggy_boobs.json": "I have saggy boobs and it’s infected my confidence SO much.. I want a lift but I\ncan’t afford it, I never see girls my age with saggy boobs. If I were to get\nintimate with a man, would he care? Would he dislike it or maybe even shame me\nfor it? Talk to his friends about how a girl had saggy boobs..",
  "data/reddit-ask/r/TooAfraidToAsk/comments/umvmbh/can_you_get_in_trouble_for_being_high_on_weed.json": "Having some back pains related to a recent medical condition and might need an\nER, took a delta 8 edible (legal here) earlier though but hasn’t hit yet. Sorry\nif it’s a dumb question.\n\nEdit: at the ER now, thank you for all the answers. I appreciate it, everyone!\n\nEdit 2: got the answers I needed,…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/umzefx/is_it_bad_i_am_a_mom_who_enjoys_being_away_from.json": "I do enjoy spending time with my kids don’t get me wrong. When everyone is happy\nand getting along it’s wonderful. Yet I also enjoy breaks from my kids. My\nfavorite time of day is dropping them off at school in the morning. Being a\nsingle working mom of four it’s tough and after going at it for a…",
  "data/reddit-ask/r/NoStupidQuestions/comments/un3kx8/does_anyone_else_absolutely_love_bad_weather.json": "When I wake up in the morning I immediately feel happier if it's raining. If\nthere's a storm I'm immediately exited. I hate working, but if it's pouring with\nrain I enjoy going to work. Wind, rain and snow just make me feel positive.\n\nI'll even go out for walks if there is heavy rain. Am I just an…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/un8s52/do_some_women_intentionally_do_things_to_make.json": "My girlfriend recently admitted that some of our past disagreements she set up\non purpose because she believes that the sex is better when I'm angry or\nannoyed. She also made the claim that most women do this. I was curious as to\nwhy this is the case.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/un8qxf/is_it_socially_acceptable_for_me_28m_to_go_to_a.json": "I'm a big dude that looks like he would never have a Teddy Bear, and people\nprobably just assume I would be at a Build-A-Bear for nefarious reasons.\n\nI'm really just a softy, and I want to buy my wife a bear while she recovers\nfrom surgery. I'm sure I might get some side eyes and stuff, but is it…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/un6j9z/why_do_people_even_like_elon_musk.json": "Yeah I get it, he funny meme guy, but are there other reasons or it’s just that?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/un8wqx/nsfw_in_regards_to_sex_what_is_something_taboo.json": "There are some things that, despite being considered taboo, are done wildly,\nwhere as others won't even be mentioned in unpolite company. Yet time is moving\non. Take anal for example. At one point, you would be considered disgusting for\neven mentioning it. Now, some people will quite happily talk…",
  "data/reddit-ask/r/NoStupidQuestions/comments/un74f2/anyone_else_still_having_schoolrelated_nightmares.json": "It's been 10 years last March since I graduated college, but I still have that\noccasional nightmare of me coming into class one day totally unprepared for a\ntest, me realizing I've been skipping one particular class all semester and now\nwill have to retake it, or me forgetting about a project…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/umpyzs/what_mature_people_3550_years_old_looks_for_in_a.json": "I'm 25 years old, and I think I have a thing for older women, but I think that\nmaybe I'm too childish and inmature to attract the person I would want to hook\nup with.",
  "data/reddit-ask/r/NoStupidQuestions/comments/un6e9q/why_are_you_allowed_to_mention_the_illegal_things.json": "I’ve always wondered this but now that the Johnny Depp and Amber Heard case has\nbecome popular it arose the question again. Why are they allowed to say things\nlike the jar of cocaine Johnny had or that they did MDMA together on an airplane\nwithout getting in trouble for it? I don’t know/think it’s…",
  "data/reddit-ask/r/askscience/comments/un8cgg/is_there_any_validity_to_the_hypothesis_that.json": "I recently saw an article claiming that right and left wing people have the\nareas of the brain responsible for fear and empathy developed differently and\nthat this was the cause of their political differences. Does this hypothesis has\nany merit among neuroscientists?",
  "data/reddit-ask/r/askscience/comments/unaikd/ask_anything_wednesday_biology_chemistry.json": "Welcome to our weekly feature, Ask Anything Wednesday - this week we are\nfocusing on Biology, Chemistry, Neuroscience, Medicine, Psychology\n\nDo you have a question within these topics you weren't sure was worth\nsubmitting? Is something a bit too speculative for a typical /r/AskScience post?\nNo…",
  "data/reddit-ask/r/NoStupidQuestions/comments/unenoh/can_yall_tell_me_to_just_send_the_text.json": "A new girl at my job asked for my number Friday and we haven’t texted since\nthen. Today I wanna text her just a simple “what’s up?” But I always overthink\nwhen talking to new people to the point my stomach aches. I never start\nconversations like the and it feels weird. Can y’all give me so peace of…",
  "data/reddit-ask/r/NoStupidQuestions/comments/unf29r/is_it_just_me_or_have_we_become_too_comfortable.json": "I see so many videos online that are like “I gave this random stranger money and\nCHANGED THEIR LIVES” or “look how cute my elderly neighbour is” or “Look how\nmuch my neighbours play with my dog” etc you get the idea. But a lot of the\nvideos seem to be taken without the consent of those being…",
  "data/reddit-ask/r/NoStupidQuestions/comments/unhb6s/is_it_rude_to_open_a_drink_in_a_store_before_i.json": "Update: I have officially learned my lesson yall <3 thank you for all the input!\nNever again shall I sip bug juice before paying for it 👍",
  "data/reddit-ask/r/AskWomen/comments/unmyd3/what_is_something_a_good_partner_would_never_do.json": "So I misread another question on askwomen and now I have this one in mind. What\nare your thoughts ladies?",
  "data/reddit-ask/r/NoStupidQuestions/comments/unvkga/gamer_bf.json": "I don't play games so I'm not really familiar with what's normal and what isn't.\nMy boyfriend (22) plays valorant with a random 14 year old girl. They've had a 2\nhour call on discord. Then she messages him few days later saying she's bored\nand wants to call which he does and it was 5 mins long. Is…",
  "data/reddit-ask/r/NoStupidQuestions/comments/unwy2l/why_do_american_houses_seem_like_theyre_made_of.json": "Everytime I see a video of something crashing into a American house it just\nflies through like its nothing.\n\nThen I watched some videos of people refurbishing/renovating a house ans most of\nthem are just some wooden planks and plasterboards and Isolating Material in\nbetween.\n\nWhy are the houses…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/unymph/why_isnt_it_a_requirement_to_put_baby_changing.json": "I was out and about with my kid yesterday, and he’s just under 1. We were at a\nfast food joint and, lo and behold, he had a messy diaper. I take a quick trip\nto the men’s room only to discover there isn’t a changing table.\n\nAn employee in the bathroom so me searching and he said, “Yeah, sorry, the…",
  "data/reddit-ask/r/askscience/comments/unyg77/askscience_ama_series_were_event_horizon.json": "Three years ago, we revealed the first image of a black hole. Today, we announce\ngroundbreaking results on the center of our galaxy.\n\nWe'll be answering questions from 1:30-3:30 PM Eastern Time (17:30-19:30 UTC)!\n\nThe Event Horizon Telescope (EHT) - a planet-scale array of eleven ground-based\nradio…",
  "data/reddit-ask/r/AskHistorians/comments/unldhj/how_did_thomas_jefferson_reconcile_saying_all_men.json": "When Thomas Jefferson penned the ever famous:\n\n\"We hold these truths to be self-evident, that all men are created equal, that\nthey are endowed by their creator with certain unalienable rights, that among\nthese are life, liberty, and the pursuit of happiness\".\n\nI understand full well that Thomas…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/uny0p8/do_you_ever_sit_with_your_phone_speaker_on_in.json": "There are millions of redditors, there must be someone out there who does this\nand can shine some light on this matter.\n\nWhat goes through your head when you are on a bus or public place and watch\nvideos or play music on your phone speaker? Why do you do this?",
  "data/reddit-ask/r/AskHistorians/comments/uo4apa/how_accurate_is_david_graebers_claim_that_the.json": "Hello r/AskHistorians [/r/AskHistorians],\n\nI recently finished reading David Graeber and David Wengrow's Dawn of\nEverything. In the book, they make an interesting claim: that the European\nEnlightenment was, in many ways, started by Native American philosophers\ncriticizing European customs. They…",
  "data/reddit-ask/r/NoStupidQuestions/comments/uo14j3/my_boyfriend_keeps_punching_wallshow_do_i_get_him.json": "As title says, my boyfriend keeps punching walls and it’s freaking me out.\n\nI want him to stop, but he keeps doing it. He does it when he walking around the\nhouse. The walls are pretty thick and\n\nThis started maybe 3 weeks to a month ago. He does it everyday so far….\n\nHe said he used to use a…",
  "data/reddit-ask/r/askscience/comments/uo2mel/is_there_anything_really_special_about_our_sun.json": "There are systems with multiple stars, red and blue giants that would consume\nour sun for a breakfast, stars that die and reborn every couple of years and so\non. Is there anything that set our star apart from the others like the ones\nmentioned above? Anything that we can use to make aliens jealous?",
  "data/reddit-ask/r/askscience/comments/uo5y00/is_bar_soap_a_breeding_ground_for_bacteria.json": "I’m tired and I need answers about this.\n\nSo I’ve googled it and I haven’t gotten a trusted, satisfactory answer. Is bar\nsoap just a breeding ground for bacteria?\n\nMy tattoo artist recommended I use a bar soap for my tattoo aftercare and I’ve\nbeen using it with no problem but every second person…",
  "data/reddit-ask/r/AskWomen/comments/uo4xa7/a_strong_and_independent_women_most_likely_means.json": "Just wanna see how many different ideas there are and how many people shares\nthem.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/unr5l3/is_kissing_actually_enjoyable_for_people.json": "I’m genuinely curious because I’ve done it multiple times and it’s just\nuncomfortable for me and I really just don’t see the appeal.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/uo9hee/why_do_protesters_block_roads_wouldnt_that_make.json": "Wouldn’t that just make people hate them and what they stand for? You could\nargue that well it gets attention, goes on the news and it spreads their protest\nto the nation etc, but wouldn’t that just make people aware of them and hate\nthem even more?\n\nPeople have work, school, doctors appointment,…",
  "data/reddit-ask/r/AskHistorians/comments/uo4tzq/were_white_people_enslaved_in_the_antebellum_south.json": "I'm not just trying to start a flame war, I promise. I recently found out that\nPlessy in the famous Plessy V Ferguson was seven eighths white. That Plessy\nlooked looked Caucasian (I heard he basically looked Caucasian). However because\none of his great grandparents was African, he was determined to…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/uog14x/am_i_the_only_person_that_never_heard_of_amber.json": "Heard of Johnny Depp plenty of times in the past, but when this trial became\nnews was the first time I ever heard of Amber Heard.",
  "data/reddit-ask/r/NoStupidQuestions/comments/uof42f/i_am_autistic_and_cant_understand_one_of_my.json": "[English is my third language]\n\nHi everyone, I’m a 30 F autistic woman. Joined the « office 9 to 5 » world 3\nyears ago. Started at the really bottom and was able to move internally to a\nbetter position but I have a problem with something my boss said during my\nevaluation.\n\nI had very positive…",
  "data/reddit-ask/r/AskHistorians/comments/uo79x3/hemiunu_the_purported_architect_of_the_great.json": "Wikipedia says Hemiunu is believed to be the architect of the Great Pyramid of\nGiza, and consistently refers to him as a man. His page even says \"Hemiunu's\nfeatures are only lightly stylized and clearly based on his appearance. He is\ndepicted as obese, with notable accumulation of fat in the…",
  "data/reddit-ask/r/AskHistorians/comments/uojxeq/huey_newton_gave_a_famous_gay_rights_speech_in.json": "Text of Newton's speech\n[https://www.blackpast.org/african-american-history/speeches-african-american-history/huey-p-newton-women-s-liberation-and-gay-liberation-movements/]",
  "data/reddit-ask/r/TooAfraidToAsk/comments/uogf4f/am_i_a_bad_boyfriend_for_thinking_other_girls_are.json": "Ok listen I love my gf and all but she is obviously not the prettiest girl in\nthe world. Like sometimes I will see a hot girl and think \"wow she has nice\neyes, I wish my gf had her eyes\" How do I stop this? Should I tell myself she is\nthe hottest girl in the world and not look at any other women ?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/uopnch/do_people_really_think_im_sad_for_eating_alone_in.json": "So I enjoy being alone so I can listen to music, go for a walk or just alone. I\ngo to eat at different places so I can chill and not have to talk to anyone, I\neat, browse Reddit and just read the news.\n\nSo I’m at this restaurant I’m at quite frequently, the music they have on is on\nlow so I can…",
  "data/reddit-ask/r/NoStupidQuestions/comments/uo10ut/is_you_clean_up_nicely_a_compliment_or_an_insult.json": "For context, I’ve gotten this comment quite a few times at weddings or when I\nneed to go business professional for work (normally casual.) I know people are\nbeing nice, but I can’t help but feeling like they’re just insulting how I\nnormally look.",
  "data/reddit-ask/r/askscience/comments/uoli0e/a_meter_is_defined_as_the_distance_light_would_go.json": "The length of a meter is defined by the speed of light, and not the other way\naround. So where/why specifically did we divide a second by 299,792,458 segments\nand then measure the distance light traveled in a one of those segments and\ncalled it a meter? Where did 299,792,458 come from?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/uo9ync/why_do_i_get_embarrassed_about_every_little.json": "Ever since I was a kid—walking to the lunch table with my lunchbox:\nembarrassing. Waiting in line in the cafeteria: embarrassing. Carrying my violin\neverywhere: embarrassing. Getting up to use the bathroom: embarrassing.\nAnswering a question in class: embarrassing.\n\nNow, as an adult—getting up at…",
  "data/reddit-ask/r/NoStupidQuestions/comments/uovuhy/is_it_weird_for_a_guy_to_envy_girls_because_they.json": "I'm a heterosexual guy, but for some reason, I find armpit hair repulsive. Arm\nand leg hair on myself, I'm ok with, but armpit hair just feels gross. Whenever\nI see girls with their hairless armpits, I envy them because it looks so neat\nand clean. I wish I could have hairless armpits like them but…",
  "data/reddit-ask/r/AskWomen/comments/uoqhz1/what_do_you_feel_when_a_person_youre_interested.json": "Could be any kind of looking from eye contact or just a quick glance to\nblatantly checking you out.",
  "data/reddit-ask/r/askscience/comments/uoraop/what_are_the_effects_of_drinking_alcohol_before.json": "I have to imagine lots of people drink alcohol before finding out that they are\npregnant. Shouldn't this cause more issues with the baby's development? Isn't\nthis the critical time for development when it could have the most effect on the\nbaby?",
  "data/reddit-ask/r/AskHistorians/comments/uogwfh/was_having_kids_less_expensive_hundredsthousands.json": "In the present day we hear about how people are having less kids because they\ncan't afford them.\n\nBut what about the old days when it was normal for people to have like 5 or 10\nkids? Poverty was more rampant back then, so wouldn't it have been even harder\nto afford 10 kids in the past?",
  "data/reddit-ask/r/askscience/comments/uowy2z/is_a_black_hole_necessarily_a_singularity_and.json": "My superficial knowledge of what black holes are and how they work tell me the\nanswer to the question is yes (yes), but I'm not sure.\n\nI guess I understand that if you have a black hole, the mass must be in a\nsingularity since, if you have gravity strong enough to bend space entirely\ninwards so…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/up5gv9/do_u_guys_like_hearing_girls_moan_during_sex.json": "i’ve always wondering if guys like hearing girls moan personally I think it’s\nsexy but I see how it could be annoying if girl was being super loud but maybe\nthat’s a good thing I don’t know",
  "data/reddit-ask/r/TooAfraidToAsk/comments/uowlby/how_can_i_ask_my_wife_if_she_is_still_in_love.json": "I’ve been with my wife for 10 years, 5 of which married. We have 3 kids\ntogether.\n\nI am still madly in love with with, I still love her deeply. But as of recently\nshe has had a new obsession that seems to have replaced her love and affection,\nand mental energy towards our relationship her words…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/up97mj/does_any_adult_here_get_times_when_they_cannot.json": "Like, I'm going to a theme park tomorrow and I literally cannot sleep no matter\nhow hard I try because I'm really excited",
  "data/reddit-ask/r/AskHistorians/comments/up7b94/the_kingdom_of_chimor_9001470_recorded_that_its.json": "According to Wikipedia (https://en.m.wikipedia.org/wiki/Chimor)\n\n> According to legend, its capital of Chan Chan was founded by Taycanamo, who\n> arrived in the area by sea.",
  "data/reddit-ask/r/askscience/comments/up48bo/does_the_reflection_of_light_change_its_energy.json": "I remember learning about how solar sails work, with it being reflective and\nusing the momentum that light has due to its De Broglie’s wavelength and using\nthe law of conservation of momentum to increase its own momentum and hence\nvelocity. My question here is how is the conservation of energy…",
  "data/reddit-ask/r/NoStupidQuestions/comments/up70ln/what_are_some_socially_acceptable_excuses_for_a.json": "Title says it. I'm 23 years old, and I just don't like drunk people. I hate\nbeing around drunk people and I just feel put off by the results of drinking.\nHowever, whenever I get invited for a drink, I always get interrogated when I\njust say I don't like it. I think due to my age maybe? Are there…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/up12w0/why_are_middle_aged_men_loud_as_fuck_in_public.json": "Like seriously, I go in there, sit down on a seat, get ready to just relax and\nBANG goes the door like they're trying to break it off the hinges.\n\nIf they're going for the urinal, you better believe they're already unzipped,\nmeat in hand read to piss an unhealthy shade of dark orange.\n\nOr if they…",
  "data/reddit-ask/r/askscience/comments/up5d1y/about_covid_rapid_tests_does_the_colour_intensity.json": "By intensity I'm referring to (for example) the case when the positive test\nstripe is very faint when compared to the control stripe.",
  "data/reddit-ask/r/askscience/comments/up5rf2/is_sagittarius_a_actually_at_the_gravitational.json": "Since it makes up almost none of the galaxy's total mass, I'm wondering if it\noccupies the exact gravitational center, or if it too orbits that point.\n\nBonus question, since SagA revolves, is it's equator parallel to the galaxy's\nplane, or completely off-axis?",
  "data/reddit-ask/r/askscience/comments/upczxp/are_there_any_parasites_that_inhabit_a_valuable.json": "Do we need parasites? Are leeches and ticks necessary? If we eradicated botfly\nwould another species suffer?",
  "data/reddit-ask/r/NoStupidQuestions/comments/upewyc/why_dont_people_go_for_the_balls_more_often_when.json": "I understand In competitive fighting that it can be penalised. But in bar\nfights, or random attacks, why not go for the testicles. Like if your fighting\nfor your life, are you really going to honour some stupid bro code?",
  "data/reddit-ask/r/NoStupidQuestions/comments/upgi9o/at_what_point_did_elon_musk_switch_from_being_a.json": "I remember a point where reddit was obsessed with how brilliant Elon Musk was\nand everything he did. Now he seems to be the villain that no one likes. what\nhappened? Was the turning point in 2018, after the rescue of the soccer team\nsuck in the cave in Thailand, where he got mad for not using his…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/upj481/is_it_weird_of_me_to_want_the_man_in_the.json": "I don't mean that the man should be controlling and toxic. I just sometimes feel\ntired and want someone to take care of me. But wanting it feels like I'm\nbetraying my values of being strong and independent. Is this common with women?",
  "data/reddit-ask/r/AskWomen/comments/up96vt/women_that_wear_a_hijab_or_similar_garments_how.json": "Hello! Fellow female here, I just had this idea on a whim, how do y’all swim?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/upl2ju/why_dont_people_who_are_prolife_mind_their_own.json": "As a person who use to be pro life, I can't say this enough that it's literally\nnobody's but the pregnant person's business.\n\nSo many babies out here born into poverty or into a terrible home.\n\nI don't get it.",
  "data/reddit-ask/r/AskHistorians/comments/upmtgb/how_do_you_fight_historical_revisionism.json": "Hello, I am from the Philippines and I am very concerned about historical\nrevisionism.\n\nJust a background, we recently held our elections and the person who won was the\nson of the late dictator Ferdinand Marcos.\n\nNow I am not a historian myself, but all I know is that he stole around 10\nbillion USD…",
  "data/reddit-ask/r/AskHistorians/comments/upmaum/peter_john_james_nathaniel_andrew_thomas_matthew.json": "Is this because they are too associated with Christianity, and so Jews stopped\nusing them over time? Or were they even banned from using them by Christians?\n\nOr is it that the Anglicised versions of these names are ones popular in Britain\nand America, while there are non-Anglicised versions more…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/uporba/why_do_people_force_introverts_into_social.json": "Now listen, I think isolating people is BAD, but I also think forcing introverts\nto be social when they don’t want to is also bad. They’re both bad and mentally\ndraining in my opinion, but why is it so normal for people to push introverts\ninto situations that make them uncomfortable?",
  "data/reddit-ask/r/NoStupidQuestions/comments/upjvim/why_is_therapy_so_expensive_i_feel_like_we_could.json": "I know there is probably a reason I just can not figure it out.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/upq7gt/do_people_actually_believe_in_astrology.json": "A coworker keeps throwing astrology into conversations about people (friends/\nfamily/ coworkers). it seems like she actually thinks that zodiac signs\ndetermine what a person is capable of or how they act.\n\n\"I cant date him because he's a leo. there's room for one leo only in a\nrelationship! he's a…",
  "data/reddit-ask/r/askscience/comments/uplt4d/is_it_possible_that_an_ancestor_of_a_species_has.json": "I was wondering about how the amount of chromosomes were affected by evolution.\nLike is it possible that one ancestor has more chromosomes or less chromosomes?\n\nSo basically: how does the amount of chromosomes correlate to evolution?",
  "data/reddit-ask/r/NoStupidQuestions/comments/upp77m/im_19_and_my_mother_just_explicitly_told_me_im.json": "For context, In my entire life I have never once gone out that front door unless\nit was to go to school or if we were all going out, and I always had this vague\nsense that I wouldn't be allowed to just walk through that door. Every time I\nbring it up on reddit people said I should just go out the…",
  "data/reddit-ask/r/NoStupidQuestions/comments/upvl3c/do_muslim_women_have_high_rates_of_vitamin_d.json": "Just a thought that popped up in my head, the Middle East is a pretty hot sunny\nplace so you’d think vitamin D deficiency wouldn’t be a big problem, but then I\nremembered about the niqab and the fact that whenever women go outside they\nessentially expose 0 skin, does that create high levels of…",
  "data/reddit-ask/r/askscience/comments/upy2kq/why_does_the_coneshaped_flaring_out_of_brass.json": "All brass instruments (and some others) seem to have a cone-shaped flaring to\nmake the sound louder? As well as old record players. What is the reason for\nthis?",
  "data/reddit-ask/r/askscience/comments/upytir/oily_skin_type_where_does_the_oil_come_from.json": "Related-\n\n 1. Dry skin type: Where does the oil go?\n 2. Can oily skin type people do anything to make their skin less oily?\n    \n\nEdit: I meant what is the raw material using which oil is produced? What happens\nto these raw materials in case of people with dry skin type?",
  "data/reddit-ask/r/AskHistorians/comments/upw2jk/what_caused_christian_denominations_originating.json": "Today, things such as a literal interpretation of the Bible, young Earth\ncreationism, skepticism over science, and other things like that are largely\nassociated with Christian denominations that originated in America (even if such\ndenominations have gained footholds worldwide). By contrast,…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/upygdc/do_people_actually_get_naked_to_poop.json": "I have recently met quite a few people who seem to agree with the fact they need\nto get naked to poop properly and I’m baffled. Is this really that popular? What\nis it about the lack of clothes that makes one go more efficiently?",
  "data/reddit-ask/r/NoStupidQuestions/comments/upy1y5/are_zoos_a_kid_thing.json": "I went to the zoo with my GF the other day, and I was so bored. I thought that\nmaybe she was enjoying it so I wasnt saying anything, but after seeing the Lions\nshe was like... 'nothing's happening, you wanna go'. It was a propper zoo as\nwell, had all the animals.\n\nAre they something you just grow…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/upvokh/is_having_kids_as_bad_as_you_all_make_it_out_to.json": "As a young person who won’t be having kids for some years yet I gotta say young\nparents make it sound terrible. Multiple coworkers who have kids always just\nshare stories about how their kids are hectic or they were late because of X\nthat their kid did. Even on Reddit it seems like it is just…",
  "data/reddit-ask/r/NoStupidQuestions/comments/uq1qff/why_do_vegans_try_to_mimmick_things_they_refuse.json": "My wife's best friend is a vegan. She asked if the grocery store near us had\nvegan mac and cheese. When we were shopping, we checked, didn't find any, but my\nwife insisted on looking for another 30 minutes. After 30 minutes I lost my\ncool. \"If she's so vegan, why tf does she want mac and CHEESE?!\"",
  "data/reddit-ask/r/AskHistorians/comments/upslhu/the_marvel_show_moon_knight_features_multiple.json": "(Spoilers for the finale coming up I guess)\n\nThe one usage that comes to mind is in the finale, when Steven/Marc, Layla and\nKhonshu are imprisoning Ammit within Harrow. It certainly sounded foreign to my\nuneducated european ears but I have no idea if it was genuine language or just\nsome vaguely…",
  "data/reddit-ask/r/NoStupidQuestions/comments/uq44so/not_being_political_but_am_actually_curious_how.json": "It’s weird right? I mean, we hear about police abuse so much and over nothing to\nsmaller crimes like drugs that it feels like the majority of them are untrained\nand scared. However when a mass shooting comes up, so many cops become tactical,\npatient. Pulling away from big emotional issues or…",
  "data/reddit-ask/r/AskHistorians/comments/uq5ldj/its_1868_and_im_a_northerner_from_new_england_who.json": "Would it just be mostly guard duty? How would my day-to-day look like?\n\nHow much interaction would I have with locals be they former Confederates or\nex-slaves?\n\nWould I possibly see some action against former Confederates who were part of\nthe Ku Klux Klan?\n\nWould it be equivalent to being stationed…",
  "data/reddit-ask/r/NoStupidQuestions/comments/uq5hkf/do_people_actually_call_their_aunts_and_uncle.json": "I've seen all the shows (Most of them happen in the US) and in all of them when\na someone sees their aunt or uncle they say aunt and then their name, or uncle\nand then their name. But I was wondering if it's actually like that. Because I\nnever said it like that, and neither anyone I know.",
  "data/reddit-ask/r/AskHistorians/comments/upto48/multiple_old_looney_tunes_cartoons_involve_gags.json": "Example 1 [https://youtu.be/F449mQvXWZ4?t=6]\n\nExample 2 [https://youtu.be/tNXt0DyINTc?t=125]",
  "data/reddit-ask/r/askscience/comments/uq7g48/is_there_any_evidence_that_prehistoric_man.json": "Fighting with my teenage daughter to wash her face. Her defense included her\nreasoning that prehistoric man didn’t have face wash, since no cave drawings\ndepict acne, so she doesn’t need to wash her face. I know, I know. Ridiculous.\nI’ve already countered with the fact that they didn’t have…",
  "data/reddit-ask/r/askscience/comments/uq41zi/how_long_do_omicron_aerosols_linger_in_a_room_or.json": "I'm having a hard time finding updated information on this. Basically, if\nsomeone shedding the virus is in a room for say, 20 minutes, then leaves, how\nlong would the virus be suspended in the air for? And at what point would it be\nsafest to enter the room with a mask after they have left?",
  "data/reddit-ask/r/NoStupidQuestions/comments/uq843x/is_it_normal_to_do_like_23_hours_of_actually_work.json": "I've been working an office job for 3 years now and it's my first one of that\nkind. I used to work Foodservice which was busy for pretty much my entire shift.\n\nNow I work the standard 9-5 and I have to say I only spend about 3 hours a day\ndoing things relevant to my job.\n\nMy boss gives me…",
  "data/reddit-ask/r/AskWomen/comments/upom7s/what_is_a_reasonsituation_you_were_turned_down.json": "Other than being tired/not in the mood",
  "data/reddit-ask/r/TooAfraidToAsk/comments/uq9fpm/why_do_smokers_throw_cigarette_butts_on_the_ground.json": "Looking for an honest answer from smokers. I assume you don't throw your trash\nin your front yard. Do you not realize cigarette butts are also trash?",
  "data/reddit-ask/r/AskWomen/comments/uq5u4i/how_did_you_accidentally_kill_the_mood_during.json": "And if you were able to salvage it, how did you?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/uq5jyy/is_normal_for_a_woman_to_watch_gay_porn.json": "Hi , im a straight woman and i get excited watching gay porn Is ir weird?",
  "data/reddit-ask/r/NoStupidQuestions/comments/uq8n8u/men_would_you_hook_up_with_a_woman_you_know_is.json": "Curious as to how many people would/wouldn't and why. No judgement.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/upxp9n/does_a_rough_phase_in_life_change_our_personality.json": "I used to be a very bubbly and optimistic person. But the last few years have\nbeen extremely rough. And now that things are getting better I just can’t seem\nto believe that good things are happening for me. I never used to be this\ncynical and I just want to be happy again",
  "data/reddit-ask/r/TooAfraidToAsk/comments/uqczsm/why_is_no_one_focusing_on_the_fact_that_mass.json": "The motivation behind an attack matters but the even bigger picture is that\ndespite any motivations, none of this would happen if ending male violence and\nradicalization was actually prioritized. Instead we ignore it and wonder why it\nkeeps happening. We’ll blame guns, Fox News, video games,…",
  "data/reddit-ask/r/NoStupidQuestions/comments/uq7gnl/should_i_knock_on_my_neighbors_door_to_see_if_hes.json": "I moved into an apartment in the city about a month ago. I live on the top floor\nof a three-story walk up, and I only have one neighbor who lives in an identical\nunit across from mine.\n\nI’ve never formally met him, only occasionally bumped into him when leaving. Our\ninteractions never went beyond…",
  "data/reddit-ask/r/AskHistorians/comments/uq6xxq/montreal_was_the_financial_and_industrial_centre.json": "Was it because industries left due to Quebec nationalism/separatism? If yes,\nthen what caused many Quebecouis to suddenly become separatists?",
  "data/reddit-ask/r/NoStupidQuestions/comments/uqdb6t/with_the_formula_shortage_in_the_us_why_wont_they.json": "I know that it mostly comes down to money, but I feel like it’s doubtful that\nmany people would continue to make their own formula at home once the shortage\nis over. Surely, losing some money is better than babies being starved, not\ngiven an adequate amount of formula, watered down formula, or some…",
  "data/reddit-ask/r/AskWomen/comments/uq8bfa/which_womens_health_issues_are_understudied.json": "A woman scientist without a medical background was thinking about which aspects\nof women's health are understudied ( I know there is a lot but don't want my\npersonal experience to colour my opinion)",
  "data/reddit-ask/r/NoStupidQuestions/comments/uqjv3i/my_friend_is_complaining_they_are_ugly_whats_the.json": "My friend isn't ugly, he just has a haircut that doesn't suit him. Puts no\nthought into how he dresses (no colour coordination and his clothes don't fit\nhim properly) and he slouches a lot, he has a patchy, bushy beard that looks\nlike pubes. Like it isn't him that's ugly, he just puts zero effort…",
  "data/reddit-ask/r/NoStupidQuestions/comments/uqgwav/anyone_else_not_really_shocked_by_shootings_in.json": "I used to think like \"that's awful\" whenever I heard about a shooting, but it\nhappens so often in the USA I barely read it as news, more like \"oh another\none\".\n\nOf course this is horrible and shouldn't be normal.",
  "data/reddit-ask/r/NoStupidQuestions/comments/uqndbw/is_it_normal_to_have_random_recurring_thoughts.json": "Like I will be having a good day and then a random thought about how someone\nmade fun of me or mistreated me in the past will pop up and it will make me\nextremely angry. When I talked to therapists about this in the past they called\nit \"intrusive thoughts\" and said it was normal. I have these kinda…",
  "data/reddit-ask/r/TrueAskReddit/comments/uqgqjr/is_trying_to_experience_authenticity_while.json": "I just got back from a vacation a little while ago and I've still been mulling\nthis over and I'm curious as to what people think. I'm not the biggest traveler,\nbut I'm in my late 30s and have been on international trips a good amount, over\n10 times now. I'm kind of fascinated at how the appeal of…",
  "data/reddit-ask/r/askscience/comments/uqs0zm/how_is_a_virus_like_chicken_pox_able_to_remain.json": "I apologise if my understanding is incorrect, but I've watched a few videos on\nthe Immune system and the really basic takeaway I got on how it works is\nsomething like:\n\nVirus detected > Immune system battles virus > Recovery\n\nFrom my understanding there is also something involving Memory cells and…",
  "data/reddit-ask/r/AskWomen/comments/uqi24x/women_of_reddit_straight_or_gay_how_would_you.json": "Does that change how you view her?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/uqsmvp/few_questions_about_my_first_time_how_does_it_work.json": "I m a 19 (M) and I ll be probably having sex soon with a girl I ve been meeting\nfew weeks ago.\n\nI m quite nervous and I have a few questions:\n\n 1. In foreplay, when she masturbates me, what should I do if i cum? Should i\n    get up and go to the toilet or maybe just cum while we keep on with\n   …",
  "data/reddit-ask/r/TooAfraidToAsk/comments/uqsyws/when_a_spouse_cheats_why_are_so_many_people_angry.json": "A friend of mine had his GF cheat. He got in a fight with the guy. Why was his\nanger directed at the guy and not his GF?\n\n*not asking him because it’s non of my business and he is still getting over it",
  "data/reddit-ask/r/TooAfraidToAsk/comments/uqcry4/am_i_too_late_as_a_30f.json": "Am I too late to date, start a relationship, and find a life partner? I can’t\nhelp but feel like I’m too late, everyone is paired off, and men would prefer a\nyounger woman",
  "data/reddit-ask/r/NoStupidQuestions/comments/uqsy7j/why_did_my_doctor_ask_me_if_im_sexually_active.json": "I was too afraid to say \"what does that have to do with anything\"\n\n\n\nRoughly 200 comments about pregnancies later, i'll edit this post to let you all\nknow i'm a dude. I went to the doctor for a mental health matter.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/uqsuqm/should_i_walk_in_on_my_friend_masturbating.json": "My friend (girl), woke me up in the middle of the night. I can hear her moan and\nI can hear porn. And I want to sleep. I don't know if I should walk in or no.\n\nEdit 1: I sent her a text and she said she'll try being quiet. I'll edit you in\n6-8 hours.",
  "data/reddit-ask/r/AskHistorians/comments/uqugbk/are_these_real_restoration_england_sex_terms.json": "In Diana Norman's novel The Vizard Mask, the main character is a Puritan\nseamstress in a brothel, and\n\n> She tried to shut her ears against the stream of professional secrets poured\n> into them, tried not to show her nausea at the undreamed-of variations on the\n> sexual act demanded by the girls'…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/uqgao9/why_do_redditors_hate_conservatives_so_much.json": "It's not just normal hate, it's too an extreme. People have made some delusional\nposts about how conservatives are going to destroy democracy and set up a\nfascist Christian dictatorship. You can get called a shitty person for voting\nconservative. These posts or comments are just as delusional as…",
  "data/reddit-ask/r/AskHistorians/comments/uqxvgm/is_the_victorian_cure_for_hysteria_a_myth_nsfw.json": "I have heard it said a lot in the early 2010s that Victorian Doctors came up\nwith the \"pelvic massage\" technique in order to cure women of hysteria. After a\nwhile the massage became so tiresome for doctors they invited the first electric\nvibrator.\n\nThis has always struck me as a myth, it plays too…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ur350n/is_our_government_really_gonna_just_ignore_4_mass.json": "I’m tired man honesty. I’m not anti-gun I’m not anti conservatives or any of\nthat but I am anti people getting slaughtered for no reason.\n\nThis can’t be ignored and I’m just so afraid that it will be.\n\nMost times a mass shooting happens it’s usually one at a time so Tucker Carlson\nhas time to spin…",
  "data/reddit-ask/r/AskHistorians/comments/uqyhhh/when_the_ottoman_caliphate_was_abolished_in_1924.json": "Purely anecdotally (i.e. tell me if I'm wrong on this), most Sunni Muslims\nnowadays do not hold the late Ottoman Caliphate in particularly high regard,\nviewing it as more a political position than a religious one.\n\nBut was it regarded as such in the 1920s? Or did many Sunni Muslims still\nconsider…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ur71q8/do_you_think_americans_will_ever_wake_up_to_the.json": "It seems all over America more and more poor people are killing other poor\npeople based on perceived exaggerated differences, with mouth pieces on Fox, CNN\nand elsewhere encouraging these perceived divisions. Will the average American\n(and Canadian, since this stuff is happening more and more where…",
  "data/reddit-ask/r/Ask_Politics/comments/uqwg2d/why_are_both_sides_blaming_the_baby_formula.json": "I hear both sides saying this is on the government. Why? They manufacture a very\nexpensive product for what it is, BECAUSE they have to have a lot of QC as they\nare feeding infants.\n\nI keep hearing how the government didn't come down on them hard enough earlier,\nbut why TF when they got caught,…",
  "data/reddit-ask/r/AskHistorians/comments/ur3tcw/at_their_peak_what_did_the_insides_of_the_most.json": "Today, castles seem to just be giant fortresses but I would like to know how\nthey looked when they were fully furnished. How were they decorated? What\ntreasures were stored there? Are there a few castles that were especially\nbeautiful?",
  "data/reddit-ask/r/AskHistorians/comments/ur8qy7/what_was_the_deal_with_the_important_of_cleaning.json": "I can't find any examples, because every Google query I have about cleaning\nbehind the ears just pops up with a million WebMD articles about ear cleaning.\n\nI was wondering if there was a historical reason why cleaning behind the ears is\nsuch a big deal?",
  "data/reddit-ask/r/AskHistorians/comments/ur761y/how_much_of_a_threat_did_the_black_panthers.json": "My understanding is that the FBI spent significant time and resources\ndismantling the Black Panther Party, up to and including assassinating Fred\nHampton. I know there were some incidents where Panthers fought with police, and\nthat their community organizing efforts may have created a significant…",
  "data/reddit-ask/r/askscience/comments/ur1ha8/why_does_a_bigger_brain_not_equal_more.json": "I understand that the size of a cell is almost constant regardless of what\nanimal it makes up. A whale brain for instance weighs more than a human brain\nhence it must have more neurons, if it can make more neural connections, why\nisn't it smarter, I would expect intelligence to be somewhat…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ur5nl3/if_i_fart_do_i_get_lighter_or_heavier.json": "On one hand, I'm expelling mass - so I should get lighter\n\nOn the other hand, if the gas was lighter than air, I should actually get\nheavier right?",
  "data/reddit-ask/r/askphilosophy/comments/ur6tg7/coauthoring_a_paper_when_i_disagree_with_its.json": "I’ve been working with a professor on a paper they are writing regarding the\ntopic of para consistent logic. The professor feels that I’ve made enough of an\nintellectual contribution that I should be the second author. The problem is\nthat despite my best efforts, I’m still mostly convinced that the…",
  "data/reddit-ask/r/NoStupidQuestions/comments/urngfe/why_doesnt_the_green_party_advocate_for_more.json": "I believe that nuclear power is the most reliable form of energy. They aren't\nresponsible for any carbon emissions, they are safer than most people think, and\nrecent models actually use most of its waste as energy. I agree with the green\nparty quite a lot, but solar panels and wind energy can only…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/urk8wr/do_nuns_masturbate.json": "Where can I watch?",
  "data/reddit-ask/r/askscience/comments/uro4gl/how_can_our_brain_recognize_that_the_same_note_in.json": "I don't know a lot about how sound works neither about how hearing works, so I\nhope this is not a dumb question.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/uro9y4/ignorance_of_the_rules_is_not_a_defense_telling_a.json": "Edit: this is not up for debate\n\nYour job before using a Subreddit is to be familiar with the rules to ensure you\ndo not end up having your content removed (mild) to being on the receiving end\nof a ban (severe).\n\nGiven the nature of the offense, this type of infraction is not liable for a\nwarning…",
  "data/reddit-ask/r/AskWomen/comments/urlxyz/how_often_do_you_smoke_weed_and_why.json": "Because you enjoy it? It helps you sleep? All of the above?? Or not at all!?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/urkrkt/do_women_generally_know_when_their_nipples_are.json": "Like, I'm sure if they don't wear a bra, they're aware its a possibility, but\nwhen they are wearing a bra, do they notice when their nipples get hard enough\nto see?\n\n\n\nEdit: I'm not judging, I'm just honestly curious.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/urs3pc/why_do_people_who_suggest_sharing_dishes_at.json": "Why the hell do people seem offended when you don’t want to share dishes when\ngetting a takeaway or heading out for a meal? I’ve ordered what I wanted, if you\nwould like it, you too can order this dish. If I wanted some of your mediocre\nchoice, I would’ve ordered that bland mess myself. WHY???",
  "data/reddit-ask/r/AskHistorians/comments/urqce9/with_debt_cancellation_so_common_in_ancient.json": "I keep reading about Hammurabi and others cancelling citizens' debts, and how\nthis was a regular feature of Mesopotamian politics for thousands of years, but\nI'm having trouble understanding how the credit system could continue\nfunctioning despite that. It doesn't sound like the state was making…",
  "data/reddit-ask/r/AskWomen/comments/urm4p4/how_do_you_get_rid_of_your_irritation_from_the_day.json": "All the little or big things that irritate you in life that build up at the end\nof the day, how do you release that?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/urrgxn/why_is_height_attractive.json": "I'm about 6'3\"—6'4\" , and almost every woman I've met makes it a point to talk\nabout my height being attractive to them sooner or later. (I guess I need a\nbetter personality or something 🥲)\n\nEdit: I should clarify that I'm okay with my height and my personality. It's\njust that I get more comments…",
  "data/reddit-ask/r/askscience/comments/uruuh8/if_spaceships_actually_shot_lasers_in_space.json": "Imagine you're an alein on space vacation just crusing along with your family\nand BAM you get hit by a laser that was fired 3000 years ago from a different\ngalaxy.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/us063q/can_you_get_someone_charged_for_farting_in_your.json": "My friend’s wife used to make up a sandwich every evening for him to take to\nwork the following day. Recently he found out that whenever they had an argument\nshe would fart into the sandwich multiple times as she was making it. The only\nreason he found out is because she let it slip to a friend…",
  "data/reddit-ask/r/AskWomen/comments/uryj59/what_if_you_get_sick_on_your_wedding_day.json": "Has this happened to anyone? And i dont mean like sniffles but if one got sick\nto their stomach or things like thar. Do you cancel the wedding",
  "data/reddit-ask/r/TooAfraidToAsk/comments/urz7rb/am_i_a_douchebag_for_stealing_food_that_wouldve.json": "Hi peoples of reddit. I’m currently living out of my car and have been for a few\nmonths. There’s a Panera in my area and a few nights a week (I’m talking two or\nthree MAX), I’ll go in there and silently take an online order from the shelf if\nI see it has been sitting for a few hours (I check the…",
  "data/reddit-ask/r/askscience/comments/urvfif/how_can_biologists_or_entemologists_definitively.json": "Some insects can just lie dormant for days, and don't visibly look alive. Are\nthere things like EKG's for insects? Or are other signs used to determine this?\n\nJust for background, I have absolutely no background in advanced biology or\nentemology, but I looked up for answers online and didn't find…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/urt08f/how_are_women_okay_with_having_a_baby_inside.json": "Maybe its cause I'm a man but I don't understand how females are willing to be\npregnant even after knowing how painful and time consuming the whole process is.\nAlso the idea of another human being living inside your tummy for 9 months just\nseems outright terrifying. And yet I've heard so many ppl…",
  "data/reddit-ask/r/AskWomen/comments/us6yz4/whats_the_pettiest_reasons_you_wont_date_someone.json": "Sometimes we have a petty reason why we can't fall for someone right? Let's know\nthem.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/us949n/would_it_be_better_to_keep_it_a_secret_that_i.json": "Throwaway here. I’ve had a guy best friend for a few years now and we hang out\npretty much every week. We’ve always kept it strictly platonic.\n\nThing is, I had multiple wet dreams about him over the course of the last few\nmonths. They’re always super hot. Plus, I’ve found myself fantasizing about…",
  "data/reddit-ask/r/AskHistorians/comments/us87uf/how_did_caucasians_survive_in_the_colonies_before.json": "As a milk white guy I realised moving to Australia was against two million years\nof evolution, bearly surviving walking to the mailbox without getting sunburnt.\n\nHow did early settlers protect against getting turned into lobsters before noon?\nWas there some kind of a trick, aside from wearing a…",
  "data/reddit-ask/r/AskWomen/comments/urzox9/what_is_your_favourite_smell.json": "Or just a smell that makes you feel happy. Smell really affects my mood, and I'm\ncurious.",
  "data/reddit-ask/r/NoStupidQuestions/comments/uscnvf/were_people_a_few_decades_ago_really_able_to.json": "Edit. Thank you for all the insightful answers. I guess the better question\nwould have been:\n\nWhy hasn't income increased proportionally to reflect the increased cost of\nliving of today?",
  "data/reddit-ask/r/NoStupidQuestions/comments/us9lfb/when_i_kiss_my_cat_does_he_think_im_trying_to_eat.json": "I mean he doesn't seem to care but what if he's just accepted his presumed fate\n:/",
  "data/reddit-ask/r/askscience/comments/usa7yp/askscience_ama_series_were_the_team_behind.json": "Before NASA's Artemis [https://www.nasa.gov/specials/artemis/] astronauts head\nto the Moon, a microwave oven-size spacecraft will help lead the way. The\nCislunar Autonomous Positioning System Technology Operations and Navigation\nExperiment, or…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/usarx9/what_should_i_be_doing_when_a_woman_sits_on_my.json": "Whenever there's a woman (or image of a woman) with a nice ass, it will get\nflooded with guys commenting the desire for the woman to sit on his face.\n\nSure, a nice ass is nice to look at, nice to touch, and even do more than that.\n\nBut what the hell am I suppose to do when a woman sits on my…",
  "data/reddit-ask/r/askscience/comments/usdbk9/can_depression_affect_your_memory.json": "Im doing my exams n I know the topics pretty well but I keep making small\nmistakes while writing down my formulae even when I know the correct one it's\nlike my head is somewhere else when I'm noting it down. Sometimes I forget the\nnames of the topics. I've never been this way and this is happening…",
  "data/reddit-ask/r/AskHistorians/comments/usbjrr/has_the_role_of_the_romans_in_killing_jesus_ever.json": "Famously, the supposed role of Jews in Jesus's death has long been used to\njustify antisemitism. However, given that the Romans were the ones who actually\nexecuted him, has this ever been used as propaganda against Italians, or other\nsuccessor states to the Roman Empire?",
  "data/reddit-ask/r/askscience/comments/usf5hw/how_does_acid_burn_skin_on_a_molecular_level.json": "Burn doctors please share your wisdom!\n\nWe already tried googling it and got very surface level info. Our super awesome\nbiochemist suggested we ask a burn doctor.\n\nDrug scientists here! We are wondering how exactly acids burn skin. Like why\ndoes it hurt? What part is corroded and how? After a quick…",
  "data/reddit-ask/r/AskHistorians/comments/usexr0/to_what_extent_did_romanobritish_culture_survive.json": "I’m interested in the fate of the Romano-Britons and the vestiges of Roman\nculture on the island of Great Britain in the period following the departure of\nRoman authorities and during the formative years of Anglo-Saxon settlement. My\nrough understanding drawn from media such as The Last Kingdom and…",
  "data/reddit-ask/r/AskHistorians/comments/usi7yf/theres_been_a_lot_of_talk_here_about_how_medieval.json": "I assume that by the Renaissance there would be plenty of Portuguese and Spanish\nmerchants in Western Africa, but I wonder how likely it would be to see someone\nof European descent in, say, Mali during Mansa Musa's reign.",
  "data/reddit-ask/r/NoStupidQuestions/comments/uskmpy/this_is_going_to_sound_awful_but_is_there_an.json": "Before you judge me! Greek family tree. That’s it. I just want extra credit and\nI don’t want to draw it out. Unfortunately it’s basically a recycling sign and\nancestry.com does not like that at all",
  "data/reddit-ask/r/TooAfraidToAsk/comments/usisk0/do_girls_automatically_think_ugly_guys_are_creepy.json": "Like if an ugly guy comes up to them in a respectful way and leaves her alone\nafter he’s rejected, is she automatically going to perceive the interaction as\ncreepy because she wasn’t attracted to him?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/usc6j0/men_do_you_noticecare_when_a_first_date_is.json": "I have a date coming up after a long and tiring breakup, and although I have\nfull body pictures on Hinge, I always have this irrational fear that the person\nwill be really put off by my size. I'm not obese or super overweight, but I am\n\"bigger\" than girls my height. How much of the success of the…",
  "data/reddit-ask/r/AskHistorians/comments/uskcay/as_an_english_speaker_it_is_generally_much_easier.json": "I lived in Sri Lanka for a while, and studied both Sinhalese (a North Indian\nlanguage) and Tamil (South Indian). By the end of a year I could carry on a\ndecent conversation in Sinhalese, but had barely gotten past the Tamil\nequivalent of good morning. Did the officers of the British Raj notice…",
  "data/reddit-ask/r/NoStupidQuestions/comments/usmf54/anyone_else_smell_something_random_and_remember.json": "Earlier, an old guy passed by me. For a split second I got a whiff of what my\ngrandpa used to smell like and suddenly all these memories I didn't know I had\nstarted coming back to me. I also felt a strong surge of emotions.",
  "data/reddit-ask/r/NoStupidQuestions/comments/usp87c/is_everybody_becoming_more_unhinged.json": "I feel like nearly everybody I know is being strangled by either mental illness,\naddiction, paranoia, etc.\n\nI can barely hold a conversation with any of my friends anymore due to their\nanxiety or anger or ambivalence.\n\nMost of the people I've trusted my whole life are succumbing to insane\nright…",
  "data/reddit-ask/r/askscience/comments/us8vul/does_antimicrobial_resistance_amr_apply_to.json": "I understand the general concept of AMR and how it arises when microorganisms\ngain resistance against antibiotics. It seems many AMR cases involve bacteria\nthough, like E. coli. Can and do viruses also become resistant to\nantimicrobials?",
  "data/reddit-ask/r/askscience/comments/ussma3/why_do_we_get_tired_and_how_does_sleep_fix_it.json": "There's something that's been bothering me for some months and I can't find the\nright answer to: Why do we get tired?\n\nWhat is this tiredness actually? When we sleep, my body still works. Heart still\npumps, brain still thinks, so how does me being unconscious result in energy in\nthe morning? What…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/uss7g4/what_surprised_you_most_about_a_healthy.json": "What was the most surprising thing you found about being in a heathy\nrelationship after being in a toxic one? Or what was the hardest thing to learn?",
  "data/reddit-ask/r/NoStupidQuestions/comments/usze26/does_it_piss_anyone_else_off_that_there_are_3.json": "Alien spaceships, bigfoot, ghosts, demons, leprechauns, etc.",
  "data/reddit-ask/r/askscience/comments/usm9t3/why_is_the_man_o_war_jelly_fish_considered_a.json": "I'm trying to understand the functional difference between the various zooids in\nthis siphonophore. It seems as though all zooids branch from the same egg (I\nthink? ) so theoretically they should share the same DNA. If they do share the\nsame DNA and essentially differentiate into a few different…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ut0jno/confidentiality_in_therapy_is_void_if_the.json": "I believe this is the law in most countries regarding confidentiality. If\nsomeone says to their therapist that they have been fantasizing the idea of\nhurting other people, they might get sent to a facility, which makes the process\nintimidating to start with. How will they get help to prevent the…",
  "data/reddit-ask/r/askscience/comments/ut0u4d/askscience_ama_series_we_are_mental_health.json": "Hi reddit!\n\nMy name is Dr. Patricia Deldin and I am the founder and CEO of Mood Lifters LLC\nand a Professor at the University of Michigan (UM). I am the Deputy Director of\nthe UM Eisenberg Family Depression Center and I have published nearly 120\npeer-reviewed articles on depression, bipolar…",
  "data/reddit-ask/r/AskHistorians/comments/ut3dwh/in_us_history_were_slaves_ever_bought_for_the.json": "I understand that there is a pretty dark and storied history of rape between\nwhite men and black women in the Antebellum South. This made me wonder, did\nslave masters ever buy women for the sole purpose of pimping them out to other\nmen? While we’re at it, let’s also open this up to the rest of the…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ut20fn/is_it_okay_to_want_a_housewife.json": "I just want a wife that has no ambitions beyond being a good mother and wife.\nNow I understand how this might be construed as me trying to undermine womens\nprogress but I promise I DO NOT think all women should be like this. Everyone\nregardless of gender should be able to chase whatever ambitions…",
  "data/reddit-ask/r/askscience/comments/ut3182/could_a_moon_be_gaseous.json": "Is it possible for there to be a moon made out of gas like Jupiter or Saturn?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ut1zb6/how_the_hell_can_anybody_even_entertain_the_idea.json": "Having to pay medical bills and dealing with mass shootings should not be on the\nminds of anybody who lives in a developed nation. And that is only the tip of\nthe iceberg. Yet people say how it's the greatest country in the world. I just\ndon't see it.\n\nEdit: Reddit care resources? What the hell?",
  "data/reddit-ask/r/NoStupidQuestions/comments/ut2zpl/how_do_i_get_my_attention_span_back.json": "For the past 2 years, I noticed a severe deterioration in my attention span. I\nused to binge watch TV shows, movies, and listen to hours of podcasts. These\ndays I notice myself reaching for my phone 2-3 minutes into a video/podcast. If\nI didn't have my phone, I would switch between videos rapidly…",
  "data/reddit-ask/r/NoStupidQuestions/comments/ut7lr7/if_masturbation_is_good_but_porn_is_bad_should_i.json": "I've always heard that masturbation can be beneficial in moderation, like\nreducing prostate cancer and stress, but that porn is definitely overstimulating\nand bad for the brain. Does this mean I should just be using my imagination or\nwhat? I don't see any other way aside from having a partner who…",
  "data/reddit-ask/r/AskHistorians/comments/ut7ui9/im_at_a_rowdy_frat_party_in_1970s_america_was_the.json": "Visit a house party in 2022 and the music isn't representative of what you hear\non the radio. The tracks have heavier bass, they're simpler, more aggressive.\n\nCan the same be said for parties of the 1970s?\n\nWhat were the \"bangers\" of this era, and did it differ from what was played on\nthe…",
  "data/reddit-ask/r/AskHistorians/comments/ut7evr/how_did_dutch_end_up_being_the_only_germanic.json": "Another example would be the Dutch \"Peter de Wit\" compared to the German \"Peter\nWeiß\" or English \"Peter White\".\nScandinavian names are mostly patronyms so I understand why articles are\nuncommon there, but German, English, and Dutch surname patterns seem very\nsimilar in all other respects.\nObviously…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/utdhi4/does_anyone_feel_grossed_out_by_how_many_humans.json": "When I think about how there are 8billion people just roaming earth, taking\n8billion poops a day, eating 8billion meals, and using so many resources… it\njust really grosses me out. There’s too many people on this planet.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/utbauc/do_people_who_earn_real_doctorates_get_annoyed_by.json": "I see Taylor Swift has received an honorary doctorate, and her fans are blasting\n“Dr. Taylor Swift” everywhere. I mean good for her, but if I were at that\ncommencement also receiving my doctorate that I spent 4-8 years of post-grad\nworking towards, writing and defending a thesis along the way, not…",
  "data/reddit-ask/r/askscience/comments/utafni/why_cant_a_human_body_heal_teeth_in_case_if_it.json": "Everything in a human body can heal except for the teeth. Why did evolution\nleave that part. It perfectly makes sense to heal the part that plays a vital\nrole in consuming food and surviving.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/utkvj0/why_arent_assassinations_against_the_rich_and.json": "Edit for clarity: I am not wishing the death on anyone or condoning violence in\nany capacity. FBI agents reading this, it was just a question.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/uthfs6/does_the_world_seem_like_its_going_downhill.json": "I mean, I was born in the 80's, so not the oldest guy here but it just seems\nwith the scale of the wars being fought, the way the world seems to be split\nvery distinctly between left or right, and anyone in the grey areas are either\nrecruited shamelessly or badgered until falling off the fence. The…",
  "data/reddit-ask/r/AskHistorians/comments/ut5myv/why_did_some_mid20th_century_english_writers.json": "A number of prominent English writers in the mid-20th century, such as George\nOrwell and Ernest Hemingway, were quite notorious for favouring \"Anglo-Saxon\"\nwords for their perceived simplicity, and against \"Latinate\" and/or\nforeign/borrowed words for being too complicated and elitist. For…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/utghcz/is_it_socially_acceptable_for_me_as_a_white_guy.json": "Basically the title of this post. There’s this really fancy black-owned barber\nshop in my city that I want to try out because the only other barbers in my area\nare chains that aren’t very consistent with their services.\n\nI know I probably sound ignorant but I ask because racial tensions in my…",
  "data/reddit-ask/r/NoStupidQuestions/comments/utmou6/why_do_servers_get_mad_at_nontipping_customers.json": "[removed]",
  "data/reddit-ask/r/TooAfraidToAsk/comments/utx176/why_do_smokers_get_so_offended_when_you_say_that.json": "I have in my dating profile that I don't date smokers because I'm severe\nasthmatic. Even just smelling it on people's clothes can give me an asthma\nattack. But guys who smoke don't read my profile and message me anyway. I used\nto try to be nice if they sent a nice message and at least give them a…",
  "data/reddit-ask/r/NoStupidQuestions/comments/utuh2e/why_preface_a_question_with_am_i_the_only_one_or.json": "Especially when, odds are, you are NOT the only one who believes/think as such.\nSeriously, why bother? And if it does indeed make a difference, why does it make\na difference? Why would prefacing as above make some people more receptive to\nthe question?",
  "data/reddit-ask/r/NoStupidQuestions/comments/uttnfz/how_were_people_so_thin_in_the_70s_and_80s.json": "I’m a normal bmi but as I’ve aged and had to sit 40 hours a week for work my bmi\nhas jumped from 20 to 24. My waist is 31”. I look at old movies and they have\nwaists that are so so tiny. Even the men. They had office jobs back then. How\ndid they stay so thin?",
  "data/reddit-ask/r/NoStupidQuestions/comments/utj0gw/does_anyone_feel_grossed_out_over_how_many_things.json": "Sometimes I feel grossed out knowing that half the things I own no longer bring\nme any joy or satisfaction and will eventually end up in landfills. I know\ncapitalism plays a big part in the way we mindlessly consume. Even people with\ncollections weird be out. Why buy so many squish mellows when you…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/utw0w8/older_people_on_reddit_will_i_regret_not_going_to.json": "Im currently graduating high school and i haven't been to one party nor have any\nfriends. I really enjoy having this lifestyle but im afraid if it will have\nimpact on my life later on.",
  "data/reddit-ask/r/TrueAskReddit/comments/uttvi2/serious_how_can_people_live_without_being.json": "Disclamer: this is not me whining, I legit do not understand the things I will\nlist below and I seek answers, blunt answers to be precise, I dont need nor want\nto see a single \"im so sorry you feel that way\" or stuff like that\n\nHello, Im a 24yo guy, I have been depressed since I was 11yo so more…",
  "data/reddit-ask/r/NoStupidQuestions/comments/uu2pi5/do_you_think_cows_enjoy_grass.json": "Do you think cows are more like \"aw fuck yeah gonna go eat some fuckin GRASS\" or\nare they more like \"guess I need to eat some more grass :/\"",
  "data/reddit-ask/r/TooAfraidToAsk/comments/uu67vx/dads_of_reddit_why_do_you_act_differently_to_your.json": "Note: I'm Asian (this could probably be a cultural thing, or not, I don't know).\n\nI remember feeling loved by my Dad so much, until I hit puberty. I remember the\nvivid look of disappointment on my Dad's face the first time my Mum told him\nI've gotten my first period. To remember it still breaks my…",
  "data/reddit-ask/r/NoStupidQuestions/comments/uu82h4/i_might_go_to_prison_for_5_years_i_get_one.json": "In dec 2021 I was caught with marijuana(5-10lbs), I was 19, now 20. I’m in WI,\nwith very strict laws, very conservative DA. Yesterday was read a guilty\nverdict(poss with intent to distribute), with Sentencing on June 1.\n\nI grew up poor, couldn’t afford opportunity, and I made a bad decision rooted…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/uu9wi7/is_it_ok_to_want_a_provider.json": "I want a husband that has no other ambitions beyond being a good provider who\nearns money for the family to financially support me and our future children\ntogether.\n\nI do not think all men should be like this. I just want a man that wants this\nfor his life. I want him to earn money for our bank…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/uu5plx/why_do_therapists_automatically_force_you_to_go.json": "I seriously don't understand this. If someone has Major Depressive Disorder and\ntells their therapist they're suicidal, and then they're forced to go to a\ninpatient ward against your will, wont that cause significantly more mental\nstress and cause the person to just lie?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/uucfrm/should_i_break_up_with_my_girlfriend_before_or.json": "Basically, I'm questioning if I really am attracted to my girlfriend or if I\njust really liked her as a friend and thought she was attractive. I'm thinking I\n(16F) may just be straight after all (or just not into her), but I am unsure\nwhat to do.\n\nI feel like breaking up before prom (which is…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/uue2mh/can_someone_truly_vanish_in_todays_connected_world.json": "I am trying to find out what happened to my husband’s best friend. Several years\nago the friend, Wyatt (not his real name) went through an ugly divorce from an\nequally ugly woman. Shortly after the finalization of the divorce, Wyatt just\nstopped existing. He stopped answering the phone. Online…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/uuelms/why_do_boomers_hate_research_and_looking_up_stuff.json": "Like, I may be talking with my dad or an uncle, and where there's something we\ndon't know, I look it up and they all go from snarky at best to genuinely angry\nat worst for me looking up info.\n\nAnd not only in a \"phones bad\" kind of discourse, but also if I go for one of\ntheir so beloved…",
  "data/reddit-ask/r/AskHistorians/comments/uudy1r/what_was_happening_to_the_rest_of_the_world.json": "We mainly hear about how the US was impacted by the stock market crash of 1929\nand the Great Depression that followed. We sometimes hear about Germany’s hyper\ninflation and economic downturn and how that led to Hitler’s claim to power. But\nwhat about the rest of the world? How was the rest of…",
  "data/reddit-ask/r/AskHistorians/comments/uugz52/do_we_have_any_information_on_how_ancient_people.json": "Thank you in advance.",
  "data/reddit-ask/r/AskHistorians/comments/uuim58/were_ancient_warriors_actually_jacked.json": "It's always in the statues, movies and pictures but given the lack of resistance\ntraining equipment that we have today and the advancement of exercise science,\nwere Spartans, Romans, Persians etc actually shredded?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/uucm0i/how_is_paying_off_accusers_not_seen_as_admission.json": "If someone accused me of fucking goats, and i paid them $1000 to be quiet, you\nwould probably assume i fuck goats, right?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/uu834w/why_am_i_perceived_a_bad_person_for_not_liking.json": "Why do people instantly think I’m a bad person because I don’t like dogs? For\nexample I’m walking through the park and a dog runs up me, I simply move out the\nway and avoid it. The owners then proceed to give me a dirty look because I\ndon’t coo and fuss, stroke it or pay it any attention. When I…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/uufudp/should_i_ask_my_boyfriend_if_he_has_ever_slept.json": "They have been friends for about 25 years. She is around all the time, stops in\nto see him randomly and use to sleep over in the guest room up until a few weeks\nafter we dated. They seem close and I can’t help but wonder if they have any\nsexual history together. I want to ask him but I’m nervous to…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/uukohy/do_you_ever_weigh_yourself_before_and_after.json": "Mine was 1.2 kg today, I was impressed.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/uuluj9/what_happened_to_the_woman_who_killed_a_cyclist.json": "Several years ago an American woman was driving on the wrong side of the road in\nthe UK when she hit and killed a cyclist. As she was part of a military base or\nsomething, she cried diplomatic immunity and fled back to the US. I haven't\nheard anything beyond that she fled. Can anyone tell me what…",
  "data/reddit-ask/r/NoStupidQuestions/comments/uumjsn/why_do_we_only_feel_consciousness_near_our.json": "e.g. I don't feel my consciousness in my ear/hand/foot/leg etc. These body parts\nfeel only like extra appendages to me.\n\nI might be phrasing my question incorrectly, but I hope someone will understand\nwhat I meant because I don't know how else to explain it.\n\nEdit: If someone asked you where you…",
  "data/reddit-ask/r/AskHistorians/comments/uuln8h/why_did_biblically_accurate_angels_fall_out_of.json": "Whenever most people now imagine angels, they most likely picture a kind\nlooking, humanoid angel with wings on the back not the terrifying abominations\nthat are said to be biblically accurate. Why is that?",
  "data/reddit-ask/r/askscience/comments/uunjjn/why_did_we_stop_inoculating_against_smallpox.json": "I understand the amazing human achievement that the disease was eradicated. That\nsaid, we have an effective method against keeping people from getting sick from\nany possible accidental or other recurrence of the disease, so why don’t we\ncontinue using it widely just in case? I’ve also seen that it…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/uuqt97/why_are_people_with_one_black_parent_and_one.json": "I mean... they are half one and half the other. I used to think Meghan Markle\nwas a tan white woman, until the racism discussion kicked off.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/uupd2n/how_hard_is_it_to_quit_opiatesnarcotics_cold.json": "Currently going through the first 24hrs of withdrawal. I don't think I've\nreached peak symptoms yet I'm pretty uncomfortable and my mind keeps\nrationalizing giving in to the cravings. If anyone has gone through this before\nplease share what you did to make it through and how long till the…",
  "data/reddit-ask/r/NoStupidQuestions/comments/uuoqli/is_it_too_late_for_me.json": "I'm almost 24 years old, I am so disorganized and my weight has skyrocketed to\nalmost 300lbs. Everywhere I look in my life is a mess, my house, my car, my\nbrain. I have attempted to lose weight and failed numerous times in the last\nyear. I feel like a prisoner and I'm at a loss for what to do with…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/uunurz/im_about_to_go_on_my_first_date_with_a_boy_any.json": "Never dated anyone before and we’re going to see a movie. Any advice?",
  "data/reddit-ask/r/NoStupidQuestions/comments/uus9qe/americans_do_you_think_that_in_certain_areas_of.json": "I got into an argument on Reddit where someone kept insisting that it’s\nimpossible for some Americans to eat healthy because they live in an area with\nno stores nearby or possibly that someone is too busy to eat healthy?",
  "data/reddit-ask/r/AskWomen/comments/uul624/what_is_something_you_do_not_expect_your_partner.json": "Something that might be seem as common/desirable by other people.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/uv0npg/why_does_everyone_write_ages_the_wrong_way_on.json": "I always see posts like “My (29M) girlfriend (30F) left me for the milkman.”\n\nIt should be written “My girlfriend (30F) left me (29M) for the milkman.”",
  "data/reddit-ask/r/AskWomen/comments/uum11h/women_of_reddit_do_you_like_eating_out_alone_why.json": "I had lunch by myself today. It’s not something I do a lot so I noticed how\nthere weren’t as many women eating alone as there were men. I am just wondering\nwhy that is? Do you as a woman eat out alone or do you go out in pairs/groups?\nWhy?",
  "data/reddit-ask/r/askscience/comments/uunwne/is_it_possible_for_two_relatively_unrelated.json": "For example, whales evolve to the point that they are able to reproduce with\nhippos. Or even more narrow, if a species of monkey that is currently unable to\nreproduce with another evolves to the point they are able to?",
  "data/reddit-ask/r/NoStupidQuestions/comments/uupvor/people_who_see_raccoons_where_they_live_do_you.json": "I wish I could see them! They do not live in my country. 😔\n\nI read they are very resourceful and cheeky—like nimble little bandits.",
  "data/reddit-ask/r/AskHistorians/comments/uv1lr4/haitian_slaves_rebelled_against_france_in_1804.json": "The Haitians paid France $560 million in today's dollars, according to the New\nYork Times\n[https://www.nytimes.com/2022/05/20/world/haiti-wall-street-us-banks.html].\nwhich the impoverished country could hardly afford. It crippled the island for\ngenerations.\n\nSince they'd kicked the French out…",
  "data/reddit-ask/r/NoStupidQuestions/comments/uv68ox/so_people_really_care_what_phone_i_have_my_date.json": "It works fine, I don’t use it other than to message, check email, YouTube etc.\nI’m not going to upgrade for another year or two as long as it’s working fine.\nTo be fair I havnt seen another person with an iPhone 8 anymore.\n\nShe also added that “I see you’re not a spender”, I was shocked and didn’t…",
  "data/reddit-ask/r/NoStupidQuestions/comments/uv7kd5/why_do_men_get_so_offended_if_women_ignore_their.json": "I am a single 30yr (f) and consider myself average looking. When I go out with\nthe girls I buy my own drinks I generally avoid men as I am not looking and\ngenuinely want to spend time with who I came with. I had on more than a few\noccasions men make a move on me which I nicely reject the first time…",
  "data/reddit-ask/r/askscience/comments/uv4llt/how_does_the_body_determine_how_high_to_raise_a.json": "Is it simply just based on the severity of the illness?",
  "data/reddit-ask/r/NoStupidQuestions/comments/uv9sch/why_has_elon_musk_sexual_harassment_story_died.json": "2 days ago almost every newspaper posted the story of Sexual Harrashment of\nflight attendant by Elon Musk. However, it seems that he won't be facing any\nrepercussion for it. There is no calls for his resignation from any of the\npublic companies he's leading. Also, no discussion or opinion in any of…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/uv962u/why_do_politicians_not_have_to_take_weeklymonthly.json": "I understand they do not operate heavy machinery; however, the do need to be in\nlots of meetings and read lots of bills, etc, and if they're coming off a\ncoke-binge weekend then their metal capabilities are vastly diminished for at\nleast a few days(weeks) and would compromise their decision making.",
  "data/reddit-ask/r/AskHistorians/comments/uvcf0m/roland_was_a_warrior_from_the_land_of_the.json": "In his song Roland the Headless Thompson Gunner, Warren Zevon tells a tale of a\nfamed Norwegian mercenary, betrayed and killed by a fellow mercenary at the\nbehest of the CIA. Headless, his body roams conflict zones, eventually getting\nrevenge on his killer.\n\nIs the basis for Zevon's song rooted at…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/uv7mww/is_it_okay_to_get_a_guy_flowers.json": "I have a crush and I really want to give him flowers is it okay if I do ? I’m a\nfemale and he’s a male?",
  "data/reddit-ask/r/askscience/comments/uv1hx8/would_wires_made_of_antimatter_have_the_same.json": "Would the right hand rule still apply or would it be the left hand rule? Would\nelectricity be propagated with positrons and would this change how the magnetic\nfields would be generated?\n\nIs it the same, but opposite or the same in general?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/uuy7yz/do_older_married_couples_still_find_each_other.json": "Wrinkles, balding, getting fat etc.. I know it’s a vain thing to ask but I’m\ncurious.",
  "data/reddit-ask/r/NoStupidQuestions/comments/uvddsu/why_does_it_seem_like_every_reddit_live_feed_is.json": "Is there not anything else to stream?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/uv66pf/why_do_vegetarianvegan_restaurants_have_to_be_so.json": "I have always considered myself a \"meat and potatoes\" person.\n\nAbout a year ago, I wanted to try incorporating veggie-only dishes into my diet\nonce a week. For funsies.\n\nThe recipes that I have tried have been absolutely amazing, and FILLING. I'm\nshocked, but loving it.\n\nI am to the point now that…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/uvbtdb/do_couples_really_kiss_after_getting_up_in_morning.json": "I was watching a movie and couple where kissing in bed after waking up, I mean\nthe breath stings and you have to pee how could anyone do that. Is that even\nrealistic?",
  "data/reddit-ask/r/askscience/comments/uvfyht/has_there_ever_been_a_known_case_about_your_bodys.json": "I have read something that says your eyes have a different immune system than\nthe rest of your body and if your body's immune system found out, than it will\nattack and you will go blind.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/uva30a/shouldnt_there_be_more_cruel_punishment_for_rape.json": "It really irritates me whenever i hear about rape. Shouldn't there be a\npunishment like cutting their di*ks off or something cruel so that people would\nthink ten times before raping. I understand some are mentally ill but why is\nthere not a cruel punishment for the people who are not mentally ill?…",
  "data/reddit-ask/r/NoStupidQuestions/comments/uvfqxq/arent_people_who_are_having_gender_identity.json": "I live in a city of 50,000 and if I went and wandered downtown, out of the\nhundreds and hundreds of people I'd come across, I will see maybe a handful, if\nthat. Probably not even that much.\n\nI am not bashing, it just doesn't make sense to me the amount of resources and\ntime spent on the topic. If…",
  "data/reddit-ask/r/NoStupidQuestions/comments/uvbta7/do_people_genuinely_enjoy_sex_scenes_in.json": "When I was like 12, I thought \"maybe I'll like it when I'm older\"\n\nWhen I was 18, I thought \"maybe I'll like it when I'm older\"\n\nNow that I'm engaged, I still don't see the appeal at all. I think it's always\nawkward, and especially those 3-4 minute sex scenes completely ruin the mood of\nthe movie…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/uvhmxe/ate_out_a_stripper_yesterday_could_i_possibly_be.json": "(18M) So yesterday was my 18th birthday, and it had been the plan for over 2\nyears that me and my squad would all go to a strip club when I turned 18. Got\nthere, everybody from the bouncer to the dancers were extra nice, ordered a\nbottle of ciroc (this is important for later) and we started talking…",
  "data/reddit-ask/r/NoStupidQuestions/comments/uvj4el/how_are_homeless_people_supposed_to_help.json": "Virtually no jobs are cash-in-hand now. You need a bank account to get paid.\nWithout an address, you have no bank account. So even if a homeless person\nmanages to find work, they're not getting paid because they have no address thus\nno bank account.",
  "data/reddit-ask/r/AskHistorians/comments/uvg2fp/was_karl_marx_really_popular_amongst_cowboys.json": "I'm reading Bullshit Jobs, where Graeber quotes EP Goodwin, a missionary from\n1880:\n\n“You can hardly find a group of ranchmen or miners from Colorado to the Pacific\nwho will not have on their tongue’s end the labor slang of Denis Kearney, the\ninfidel ribaldry of [atheist pamphleteer] Robert…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/uvikak/why_does_people_care_if_others_are_lgbt_or_not.json": "Im not LGBT, i don’t go to LGBT rally support them, i just really don’t care if\nyou are LGBT are not. Why do people care so much? Why don’t you care about poor\npeople instead?",
  "data/reddit-ask/r/askscience/comments/uvbleg/how_does_electric_eels_discharge_electricity_into.json": "My very basic understanding is that electric eels stack their electricytes in\nseries similar to many many tiny batteries together to generate hundreds of\nvolts. But wouldn't the electric current just flow within their eletricity\ngenerating organ from one direction to the other? How does it circuit…",
  "data/reddit-ask/r/AskHistorians/comments/uv8l9u/when_did_people_start_eating_every_day.json": "I was wondering when people started eating every day. I saw a youtube video\nabout fasting that said that some Amazonian tribes eat only when they felt\nhunger, which was not every day. Were people, say, in France in the 1800s\nalready having daily meals? If not, how often would they eat?",
  "data/reddit-ask/r/NoStupidQuestions/comments/uvm7np/why_do_ads_say_do_not_take_drug_x_if_youre.json": "Who is this disclaimer for? Are there really people stupid enough that would\nknowingly take a drug to which they are allergic? Is all personal responsibility\ngone in our society?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/uvnb6r/can_men_and_women_really_be_platonic_friends_even.json": "Can men be good platonic friends with a woman even if they had sex before? No\nmatter how long ago it was.",
  "data/reddit-ask/r/NoStupidQuestions/comments/uvrj02/its_unhealthy_for_my_parents_to_still_track_my.json": "I'm having trouble thinking through this, and I'd really appreciate some\ndifferent perspectives and advice. I'm 20F, in college, and live on my own in an\napartment. It's relatively safe, and my parents live an hour and a half away. I\ndon't go out late at night or drink or anything, and they know…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/uvlbfv/what_is_the_difference_between_a_300_prostitute.json": "I watched a documentary about some prostitutes making 6 figures a year and party\nwith millionaires. But they don’t look that different than $300 ones you can\njust Google around your area.\n\nSo what differentiates them to climb that ladder? Luck?",
  "data/reddit-ask/r/AskWomen/comments/uvozyx/how_do_you_deal_with_being_the_weird_black_girl.json": "Title pretty much sums it up how did and do you still deal with being the \"oreo\"\nor the \"white washed\" black girl simply because you don't fit into the racial\nstereotype as to what you're supposed to act like?",
  "data/reddit-ask/r/AskHistorians/comments/uvrlnf/did_paid_laborers_build_the_pyramids_of_egypt.json": "I just stumbled upon a thread talking about how the pyramids were actually built\nby paid artisans and not slaves. Is this true? I was always taught that they\nwere built using slave labor.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/uvutrf/what_are_the_benefits_of_being_a_man.json": "To avoid saying anything wrong I shall not elaborate. What are the benefits of\nbeing a man?",
  "data/reddit-ask/r/AskWomen/comments/uvw2se/what_are_you_grateful_for.json": "Today I thought I shat blood but I actually just started my period. That is what\nI am grateful for today.",
  "data/reddit-ask/r/askscience/comments/uw2iss/any_three_digit_multiple_of_37_is_still_divisible.json": "This is a \"fun fact\" I learned as a kid and have always been curious about. An\nexample would be 37 X 13 = 481, if you rotate the digits to 148, then 148/37 =\n4. You can rotate it again to 814, which divided by 37 = 22.\n\nIs this just a coincidence that this occurs, or is there a…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/uvw221/what_its_like_to_be_unemployed_in_your_country.json": "I live in Finland, and i've been unemployed nearly 10 years (altough i worked\nfor 2 years between).\n\nI live in a new apartment house (built in 2018). 60 square meters, two rooms,\neverything new. My rent is 800 euros and that includes sauna, 50mb internet (i\npay 20 euros extra for 600mb), laundry…",
  "data/reddit-ask/r/NoStupidQuestions/comments/uw4rfl/women_have_three_holes.json": "Overheard a conversation and I don’t know if I misheard.\n\nSo, apparently women have three different holes.\n\nOne for pee, one for poop and one for blood.\n\nIs that true?",
  "data/reddit-ask/r/AskHistorians/comments/uw3lni/is_mark_felton_a_reliable_source.json": "The popular YouTuber, Mark Felton [https://youtube.com/c/MarkFeltonProductions],\nmakes many videos serving as quick and concise documentaries on varying\nsubjects, primarily related to World War 2.\n\nI’ve heard some conflicting opinions on his work. Initially, all I came across\nwas praise - looking…",
  "data/reddit-ask/r/NoStupidQuestions/comments/uw6lom/how_can_we_let_our_neighbours_know_that_their.json": "We have windows over our kitchen counter that face in their direction. The\nblinds on her window are normally shut, but when they're not, we can see into\nher room. Our house is more elevated than theirs, so we can see quite a lot of\nthe room too. She probably mostly sees our ceiling, so maybe that's…",
  "data/reddit-ask/r/AskHistorians/comments/uw1z0u/pacific_island_settlers_journeying_between.json": "I'm struck at just how geographically isolated, say, the archipelago of Hawai'i\nis, for how it was first settled ca. 1000-1200 CE. The Wikipedia article gives\nthe origin points for the first settlers as the Marquesas islands, which are\nover 3000km away from Hawaii, citing a paper by Patrick Kirch…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/uw0olo/do_yall_reuse_towels.json": "I have always used towels for 3-4 showers. I mean im clean after i leave the\nshower and unless the towel is super dirty ill reuse it.\n\nEdit: this isnt meant as a judgement towards people who only use them once, i\nunderstand there are reasons for it and respect everyones towel routines.",
  "data/reddit-ask/r/AskHistorians/comments/uvzxki/how_did_vatican_come_to_accept_democracy_rather.json": "The Catholic Church had very few reasons to sympathize with the French\nRevolution. So how did the Church gradually accept that democratic secular\nstates (where church and state are separated) are no less legitimate than\nmonarchies, in which kings are anointed and the clergy had substantial…",
  "data/reddit-ask/r/AskHistorians/comments/uw9z5i/why_didnt_japanese_cities_have_town_squares.json": "I looked at a lot of maps of Tokyo from the Edo period and before, and I never\nsee town squares or plazas depicted. Why is that? What were the public spaces\nthat these people occupied instead?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/uwd553/can_i_bring_indian_food_to_a_black_cookout.json": "So we are Indian and invited to a black cookout, friends of my teenage son. Can\nI bring samosas? I don’t know what to take? Also any etiquette I should know?",
  "data/reddit-ask/r/NoStupidQuestions/comments/uwbwu2/do_you_ever_whine_or_cry_to_yourself_as_an_adult.json": "I'm a 30 year old woman and I regularly find myself sobbing or whining because\nI'm just so over adulthood.\n\nOr is this abnormal and should I seek help?",
  "data/reddit-ask/r/AskHistorians/comments/uvya3i/at_the_founding_meeting_of_nottingham_forest_fc.json": "Fun fact: when Arsenal FC was founded (as Dial Square FC) in 1886, two of its\nfounding members were former Forest players who had moved to Woolwich for work.\nThey wrote home for help with founding the new club, and Nottingham Forest FC\nsent them a set of kit and a ball. Because of that, Arsenal…",
  "data/reddit-ask/r/NoStupidQuestions/comments/uw5vrk/genuine_question_why_is_it_not_ok_to_want_to_cure.json": "I think that almost every autistic person will agree that having autism can make\nday to day life more challenging, so why are people so against research/science\nthat looks into curing or preventing autism? And why is this ok to do for other\nillnesses or disorders, but not autism?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/uwaick/do_other_people_eat_the_melted_cheese_on_food.json": "Like if you had a cheeseburger and part of the cheese stuck to the wrapper, are\nyou eating that? The cheese, that is, not the wrapper. That would just be weird\nand abnormal behavior. I mean, I have accidentally eaten some wrapper but that’s\nnever the goal.",
  "data/reddit-ask/r/AskWomen/comments/uw7nn1/women_with_low_self_esteem_or_social_anxiety_have.json": "Like they see you more positively than you thought or they thought you were\nconfident",
  "data/reddit-ask/r/AskHistorians/comments/uwdkwu/how_far_back_does_jody_go_did_redcoats_fret_about.json": "In case you're unfamiliar: \"Jody\" is a common American military slang term for a\nman who stays behind at home while a soldier, sailor, marine, or airman is off\nfighting. Jody gets to enjoy all the pleasures of home, including, usually, the\ngirlfriends and wives of those overseas.\n\nI'd imagine this…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/uwk900/why_is_suicide_considered_bad.json": "Like what's the problem if someone doesn't want to live anymore?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/uwjnqj/how_is_zelenskys_request_to_receive_10_billion_a.json": "Firstly, I am 100% opposing Russia's actions against Ukraine.\n\nAs you may have heard, Zelensky gave a 25 minute speech at the world economic\nforum requesting $10 billion a month to rebuild Ukraine.\n\nI understand that the country got destroyed big times and that it will cost a\nfortune to get back to…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/uwfey4/can_i_cum_inside_her_with_no_worries_if_she_takes.json": "Update: I actually came in her nostril lmao because she got up last second and\ntried putting it in her mouth.",
  "data/reddit-ask/r/askphilosophy/comments/uw7rub/how_much_should_we_question_our_sexual_desires.json": "I was reading this piece by Amia Srinivasan and it got me thinking about how the\naverage person is aware of and critically engages with their own sexual desire.\n\nSrinivasan’s main argument is that we have made a mistake by placing such an\nemphasis on consent when it comes to sex. We have positioned…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/uwppw0/is_what_my_dad_does_normal.json": "I'm (21F) deeply terrified of men since I got raped and mentally abused and my\ndad is part of the reason, he has always ignored me but since a year or two ago\nhe started doing a lot of gross things like touching my legs and hips, kissing\nmy neck and ears or touching my ass while I sleep. He has…",
  "data/reddit-ask/r/NoStupidQuestions/comments/uwonuh/my_boss_just_asked_for_my_original_resume_after.json": "As title says, Ive worked here for 10 years, the last 8 months I've been on\ncompensation after a safety incident where my head was severely injured, I'm\ndoing quite well now, but why would my boss ask for my resume after all this\ntime ?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/uwqo4e/why_do_people_romanticise_mental_illness_so_much.json": "I’ve been housebound for six years because of mental illness. Seeing people on\nTikTok saying they have it too, but having their hair and makeup done perfectly\nwhile recording themselves making jokes about it, makes me feel really\nuncomfortable. It’s like they’re happy to have it and show it off…",
  "data/reddit-ask/r/NoStupidQuestions/comments/uwpvlf/why_is_the_term_midget_considered_derogatory_but.json": "Edit:\n\nI want to just be clear here because a few people seem to mistake my intention.\nI'm not trying to advocate for the reclaiming of the term midget. Nor am I\ntrying to say that I should be able to use that term. I'm happy to use the term\nlittle person that that is the preference. I just hear…",
  "data/reddit-ask/r/AskHistorians/comments/uwu6av/if_tsar_nicholas_ii_was_so_desperate_for_an_heir.json": "A female Tsar of Russia wasn't unheard of before and the Tsar was second only to\nGod in Russia from an authority standpoint. So if he just one day decided to\nmake his eldest daughter his official heir, could anyone even question him?\n\nAfter seeing the turmoil the quest for a male heir, and the…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/uwql1a/why_are_people_proud_of_their_skin_color.json": "I just don’t get it. I see everyone online is so proud of their skin. I’m black,\nI’m white etc etc. which brings me to the ultimate question.\n\nWhy are you proud of something you had absolutely no control over???? It’d be\nlike I’m so proud of my brown hair, so proud… lol",
  "data/reddit-ask/r/TooAfraidToAsk/comments/uwxj1f/why_do_gay_guys_sound_gay.json": "I know, i know, its a stereotype and alot of the time you wouldn't be able to\ntell if a fella was gay just by speaking to him but it certainly exists in most\ngay chaps ive ever met.\n\nIs it a biological thing perhaps? Is it an act or persona?\n\nThey also tend to speak really fast, whats that about?",
  "data/reddit-ask/r/NoStupidQuestions/comments/uwsbap/my_therapists_says_its_okay_to_ask_people_what.json": "I struggle with social cues and understanding what other people are feeling\noften. It makes me quite anxious, because I can't really tell how I'm supposed\nto react to things, and sometimes that ends with me hurting people without\nmeaning to.\n\nMy therapist says it's okay to just ask. Go \"hey, I…",
  "data/reddit-ask/r/NoStupidQuestions/comments/uwz7km/anyone_else_think_tik_tok_is_honestly_just_dumb_af.json": "I’ll be honest, I don’t dislike the app or anything, and there is some funny\nstuff on it. But the trends are honestly just so goddamn dumb idk how people\nthink it’s entertaining/cool.",
  "data/reddit-ask/r/AskHistorians/comments/uwy40j/did_archers_shoot_at_an_angle_or_straight_on.json": "I recently watched a video of a historian (not a youtube \"historian\" but a\nhistorian on youtube) talking about the battle of Agincourt and how the archers\nwere firing basically straight on from maybe 40-80m out. He was saying the force\nof impact, especially with large arrows which lose momentum…",
  "data/reddit-ask/r/AskHistorians/comments/ux1wi0/neville_chamberlain_famously_sold_out.json": "Should we blame Chamberlain if his delaying tactic bought the allies time to\nrearm?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/uwxxfq/am_i_a_21yearold_male_weird_for_dating_an.json": "We met online a couple months before she turned 18. We ended up meeting in real\nlife a couple months after she turned 18. I am 21, in my first year of\nuniversity. She is 18, just graduated HS and about to start university.\n\nA couple of my close friends know but I have not told most people because I…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ux1x68/why_dont_women_do_mass_shootings_despite_having.json": "It seems like every single mass shooting is done by a male. Women have just as\nmuch access to military style weaponry yet don’t do mass shootings. What gives?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ux3pio/why_do_mass_shooters_target_elementary_schools.json": "Obviously they’re mentally deranged and want to hurt people, but why little\nkids? Can anyone explain the logic?\n\nFor example, someone who shoots up his own high school is often motivated by a\ndesire to hurt people he knows. Someone who targets a gathering place of a\ncertain race is motivated by…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/uwsut3/why_do_i_feel_more_confident_and_empowered_after.json": "Edit: also why is masturbating looked down upon. Especially men?",
  "data/reddit-ask/r/askphilosophy/comments/uwore8/i_wanna_read_all_of_nietzsche_what_should_be_the.json": "Edit - By 'all' I mean I wanna read every work of Nietzsche ever documented.\n(Only recently I read almost all of Franz Kafka's work). I feel like without\nreading everything I wouldn't really understand Nietzsche as a person and as a\nphilosopher.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ux8u50/how_does_an_artist_like_lizzo_workout_and_perform.json": "I love lizzo and do not come from a place of fat phobia or anything. I have had\na high metabolism all my life so I don’t understand how weight loss works. I\nenvy how she can move and dance so well. I just know how much cardio that has to\nbe and don’t understand how someone doing so much doesn’t…",
  "data/reddit-ask/r/AskWomen/comments/uxe4vy/how_has_childhood_trauma_affected_you_as_an_adult.json": "have any of you reached middle age and had those \"glass shattering\" moments when\nyou realise how trauma has affected you and your behaviours?",
  "data/reddit-ask/r/NoStupidQuestions/comments/uxczgx/why_dont_we_have_a_fat_layer_around_our_head_to.json": "I was reading that TWO kings of france died because they banged their head\nagainst doorframes, thus making this seemingly innocent object deadlier than the\nguillotine to french kings.\n\nIt seems quite easy die because you bumped you head on some stuff. So why is\nthat, during evolution we never…",
  "data/reddit-ask/r/AskHistorians/comments/ux6enr/identifying_my_relatives_clothing_from_the_1920s.json": "Hi all,\n\nI recently did a deep dive into my matrilineal line and after finding a few old\nphotos of my mom's family, I started to wonder about the clothing. The family\nwas from Louisiana, and these photos are taken there in the 1920s. The woman is\nmy great grand mother (the man on the other side of…",
  "data/reddit-ask/r/AskHistorians/comments/uxgg2a/is_there_an_historical_reason_as_to_why_catholic.json": "Clergy in Protestantism, Judaism and Islam are allowed allowed to marry, so the\nCatholic rule seems like an aberration. Given how intertwined the Catholic\nChurch was with politics, it makes sense that there would be a secular reason as\nto why priests couldn't marry. Didn't it have something to do…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/uxh0ta/do_women_find_mens_butts_attractive.json": "It's something my sister said and I'm still puzzled over it... Is this true?",
  "data/reddit-ask/r/NoStupidQuestions/comments/uxfvg4/if_i_buy_a_house_whats_to_stop_me_from.json": "I want to get a 4 bedroom house and rent out at least two of the rooms to help\noffset the cost of living a bit, do you have to fully own the house to do this?",
  "data/reddit-ask/r/AskHistorians/comments/uxii3i/collaborative_panel_ama_with_raskbiblescholars.json": "Panel members from r/AskHistorians [/r/AskHistorians] and r/AskBibleScholars\n[/r/AskBibleScholars] are here to take your questions regarding religious\nhistory and reception history.",
  "data/reddit-ask/r/AskHistorians/comments/uxghz4/when_it_became_clear_that_bismarck_and.json": "Both ships found themselves in situations where they couldn't outmaneuver,\noutrun, or fight off their pursuers, yet they both seemed to fight until they\nwent under, with terrible loss of life.\n\nWouldn't the British have allowed them to surrender, and possibly save the crew?\nWhy wouldn't that have…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/uxn3xv/do_you_think_wed_be_in_a_better_place_had_bernie.json": "*Edit to clarify: The 2016 Election.",
  "data/reddit-ask/r/NoStupidQuestions/comments/uxmdrj/will_my_cat_still_remember_and_love_me_if_i_go.json": "I have to go away for work for a week soon. We have two cats but one in\nparticular is my snuggle buddy. Every morning and every night he comes to get\nsnuggles with me, bring his toys to me, follows me most places, usually comes\nand meows at me for attention - he especially likes to play fetch and…",
  "data/reddit-ask/r/NoStupidQuestions/comments/ux5jl0/if_there_are_3_random_points_on_a_plane_will.json": "Im only 13 so im not very smart but im also very curious about these things",
  "data/reddit-ask/r/TooAfraidToAsk/comments/uxohp6/can_someone_walk_me_through_the_logistics_of_just.json": "So, let’s just say the US bans all firearms and/or does a buyback program. How\nwould they go about seizing everyone’s guns? Would local police officers (often\npro-2A themselves) be forced to go from house to house with metal detectors? Or\nwould we bring in the military to do that? Would thousands…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/uxpw1a/what_is_your_stance_on_spanking_your_kids.json": "Okay, I don’t have children of my own, but I have had experiences when I was\nlittle. I was raised by a very loving single mother. She worked extremely hard,\nand even though we didn’t have much, she gave everything she had to my brother\nand I. Sometimes, we would misbehave (an example being running…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/uy1eyu/why_did_americans_start_a_worldwide_riot_about.json": "I genuinely don't get it.",
  "data/reddit-ask/r/AskHistorians/comments/uy4m93/how_did_martin_luther_go_from_advocating_better.json": "He's been called one of the church fathers of antisemitism, and people have\ndrawn a line from his writings all the way to the Holocaust. But early on he\ncondemned cruelty towards the Jewish people as unchristian. So what happened?",
  "data/reddit-ask/r/NoStupidQuestions/comments/uy2y6x/do_american_children_really_swear_allegiance_to.json": "It just seems so... Cult-y, Y'know?",
  "data/reddit-ask/r/NoStupidQuestions/comments/uy0nm1/people_who_bike_everywhere_how_do_you_not_reach.json": "I really wanna start biking more to reduce my own personal carbon footprint, but\nI live in FL and if I biked to work, it’d take around 30-40 mins, it would be\nscorching hot, and I would get there a mess of ‘outside smell’.\n\nI just don’t understand how people bike to school, work, etc., because even…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/uy5kzw/should_there_be_a_maximum_age_requirement_for.json": "There is a minimum age because you aren't considered mature enough but maybe\nyou'd need one for the other extreme, like 70 or something, because I feel\npeople in power should be open to change and that happens way too rarely in old\npeople (like look at any of your grandparents or…",
  "data/reddit-ask/r/askscience/comments/uyaogu/how_did_the_water_disappear_on_mars.json": "So, I know it didn't disappear per say, it likely in some aquifer.. but..\n\nI would assume:\n\n1) since we know water was formed by stars and came to earth through meteors or\ndust, I would assume the distribution of water across planets is roughly\nproportional to the planet's size. Since mars is…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/uy8xh6/how_do_politicians_justify_being_prolife_but.json": "I don't want the genuine reason why they think these things or vote the way they\ndo, but how do they justify it publicly and maintain the loyalty of their base\nand get them to agree that these seemingly conflicting ideas (to me at least)\ncan and should coexist?\n\nDo they just not connect them?\n\nDo…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/uy8ck5/what_am_i_as_a_male_supposed_to_do_if_i_am.json": "It feels like anything I would say in that situation would seem fake and\nincriminate me further.",
  "data/reddit-ask/r/NoStupidQuestions/comments/uyd1lh/are_some_people_just_not_meant_to_drive_a_car.json": "It's just such a difficult thing, no matter how much I try I just don't get how\nI should drive in traffic, maybe it's a good thing because I won't kill anyone.\n\nThe rules are just way too complex and difficult for me, I'm probably just very\nvery dumb though.",
  "data/reddit-ask/r/NoStupidQuestions/comments/uy34sg/why_has_no_one_noticed_that_ubers_are_now_just_as.json": "A big thing that made Uber popular is that they were cheaper and quicker than\ntaxis. I just saw the pricing for a taxi yesterday while I was in an uber did\nthe math and realized the trip was now the same price as my Uber.",
  "data/reddit-ask/r/AskHistorians/comments/uy6ibz/was_there_a_period_when_europeans_had_their_guns.json": "American here, wondering how Europe has managed to have so few guns.\n\nI'm no expert on the history of guns, but I assume that muskets were relatively\nwidespread among Americans in the 18th century. Was that the case in Europe? If\nnot, is there a reason for that difference?\n\nIf a lot of Europeans…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/uyg8im/how_come_people_catch_so_much_crap_when_they_say.json": "Why can’t I hate both? Both options suck. How is that my fault or problem? Make\nbetter political parties, I don’t know what to tell ya.\n\nAlso mental midgets will come in saying “you’re just right wing because if you\nhate both parties you’re actually just right wing.” It’s like, oh gee wiz…",
  "data/reddit-ask/r/askscience/comments/uyg2rj/is_there_a_psychological_or_any_kind_of_test_for.json": "It seems to me like a lot of bad stuff happens because people who are supposed\nto be in positions of authority (e.g. police) end up acting cowardly.\n\nMy gut feeling is that this behavior is a predictable personality trait and\ntherefore able to be tested for, to weed out cowards from jobs that…",
  "data/reddit-ask/r/AskHistorians/comments/uyfkol/striggling_did_it_exist.json": "When I was in college (many years ago), I took a history class that covered\naspects of ancient Greece and Rome. My professor offhandedly mentioned the\npractice of \"striggling\" one day that caught my attention. I just googled and\nspent some time trying to find more information about it, but there…",
  "data/reddit-ask/r/AskWomen/comments/uyk5kx/what_is_your_favorite_movie_of_all_time.json": "and why ?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/uylt4e/is_it_bad_to_set_a_boundary_that_i_do_not_want.json": "My boyfriend has a long time female friend and when I first dated him she stayed\novernight on and off at his house. I believe their relationship is completely\nplatonic but they have a sexual past from years ago. I have no issues with them\nhanging out but her staying overnight even once in a while…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/uyi4ti/do_you_think_homophobia_will_ever_end_in_africa.json": "I am a human rights defender, and refugee rights advocate living in Kakuma\nrefugee camp Kenya. I'm facing extreme persecutions and Homophobia. My parents\nchased me away from home after they discovered that am Lgbti. I have gone\nthrough the worst. I was pushed into a long ditch by Homophobic…",
  "data/reddit-ask/r/NoStupidQuestions/comments/uynb5e/does_anyone_else_prefer_room_temperature_water_to.json": "I should preface this by saying I don’t drink water, I chug it as rapidly as I\npossibly can until my stomach is full. However, this means that I hate cold\nwater. One sip is alright but it doesn’t really quench your thirst, just makes\nyour mouth cold and prevents you from drinking any more for a few…",
  "data/reddit-ask/r/askscience/comments/uymx8i/why_do_black_holes_increase_in_size_if_the.json": "In alot of online articles they state that the singularity has infinite density.\n\nSo when a black hole consumes an object (goes past the event horizon) why does\nthe size of the black hole increase?\n\nWouldn't the mass just be squeezed infinitely without altering the size of the\nblack hole?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/uysb1a/why_do_some_parents_think_they_own_their_children.json": "I see this often where I live though it's mostly the mothers",
  "data/reddit-ask/r/AskWomen/comments/uyq311/what_are_the_best_rom_coms_to_watch.json": "I’m looking for something wholesome to watch. What are some of your fav romantic\ncomedies?",
  "data/reddit-ask/r/NoStupidQuestions/comments/uyrgxd/why_is_it_okay_to_use_a_vibrator_or_dildo_and_why.json": "My husband and I were talking about how different the social perception of\nsexual aids is and we both came to the conclusion that somehow the fleshlight\nseems to be much less socially accepted than dildos and vibrators, but we can't\nreally articulate why that is. What do you think?",
  "data/reddit-ask/r/AskHistorians/comments/uyze2i/forget_columbus_forget_lief_erikson_why_does.json": "I’m reading the book Who ate the First Oyster right now (highly recommend). Each\nchapter goes into historical & scientific detail of an important “first” in\nhistory. The last chapter is on the first person to set foot in Hawaii, but it\ntalks about Polynesian exploration in general really.\n\nIt…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/uyu9r5/is_it_wrong_to_be_upset_my_fiance_wants_a_open.json": "The title says it all my fiance said she feels like she's missing out on life\nand wants to be able to see other people even with us starting slow so she had\ntime before we got official to do all that.. She didn't really like me saying no\nand kept asking to at least flirt with and lead guys on even…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/uyw7oo/what_is_something_you_firmly_believe_but_cant.json": "For example, I believe that human brain has the capacity to do crazy things like\nspeak by telepathy with other humans or animals, but we just don't know how to\ndevelop our brain enough to use this abilities.",
  "data/reddit-ask/r/TrueAskReddit/comments/uynyab/for_nearly_all_of_human_civilization_weve_tried.json": "I can understand intellectually about how humanity has evolved to a point where\naverage every day life for someone in a developed Western culture can be\ncounterproductive to both physical and mental health. I can understand how we've\nlost touch with nature, and don't move around as much. I get why…",
  "data/reddit-ask/r/AskHistorians/comments/uyycvg/in_don_quixote_cervantes_claims_that_even_if_the.json": "For context, in case anyone is curious, “The landlord shouted to them to leave\nhim alone, for he had already told them that he was mad, and as a madman he\nwould not be accountable even if he killed them all” (p. 31). And similar\nsentences are written throughout the novel.\n\nI just find it remarkable…",
  "data/reddit-ask/r/NoStupidQuestions/comments/uywmbs/im_an_extremely_anxious_person_would_i_fail_a_lie.json": "I tend to feel guilty or nervous about things I haven't even done. If I were to\ntake a lie detector test would I fail? Or am I understanding it wrong?",
  "data/reddit-ask/r/NoStupidQuestions/comments/uz1m9y/is_america_actually_as_bad_as_the_media_makes_out.json": "I am from over the pond, I’ve always wanted to move to America. I have friends\nthere but life seems to be very different state to state and it’s hard to get a\nbroad consensus from only a couple of people.\n\nIs life actually as bad as the media portrays? Comes across as some third world\ndumpster…",
  "data/reddit-ask/r/AskWomen/comments/uz6drx/in_a_recent_post_about_turnoffs_so_many_women.json": "Honestly I was shocked that it was mentioned so often. I thought showered,\ntrimmed, clean clothes when not working, and tidy was common sense and should go\nwithout mention. So I am at a loss imagining an unhygienic date or partner. What\nhas been the worst thing you have experienced in regards to…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/uzfhze/what_can_i_buy_my_wife_for_16.json": "It’s our anniversary tomorrow. My wife got sick after our honeymoon and it’s\nbeen tough. I don’t want to give you all my sob story since there’s probably\nworse situations people find themselves in. I just want to provide some context\nI’m not a cheap bastard, it’s just been a struggle since she has…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/uzcryb/am_i_a_homophobe.json": "I dont think i m homophobic. I have no problem with people being with other\npeople whom they love. But whenever i watch a movie with gay or lesbian leads\nand a steamy scene comes up, i can't make myself watch it. Somehow i feel creepy\nand lowkey uncomfortable. I may get downvoted smh but is it…",
  "data/reddit-ask/r/askscience/comments/uzbamm/how_is_the_atmosphere_affected_by_trees_that_go.json": "When certain trees lose their oxygen-producing leaves in winter, Does the\natmosphere lower in oxygen? Rise in CO2? Balance out with species like\nevergreen?",
  "data/reddit-ask/r/AskHistorians/comments/uzh9c0/why_is_the_transmediterranean_slave_trade_left.json": "I am not talking about the Barbary slave trade here, but the transmediterranean\none which does not even have a wikipedia page for English speakers :\nhttps://fr.m.wikipedia.org/wiki/Traite_transm%C3%A9diterran%C3%A9enne\n\n\"Salvatore Bono, professor at the University of Perugia, estimates the number…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/uzhads/why_are_so_many_men_okay_with_being_bad_at_sex.json": "Basically, never trying to make a woman finish.\n\nI have a friend who has had sex with many men and she’s said that not ONE man\nhas ever made her finish. They basically just hump until they cum and then it’s\ndone.\n\nI was with my ex for a long time and he was my first. I never finished with him,\nand…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/uzmypo/why_is_it_when_ukrainians_are_defending_their.json": "It’s just mind boggling the world that we live in. Are Palestinians lives worth\nless than Ukrainians ?",
  "data/reddit-ask/r/NoStupidQuestions/comments/uzmm00/instead_of_canceling_10000_in_student_loans.json": "I mean if they do that people will be able to afford to pay back every single\ndollar they borrowed AND be able to climb out of the debt. It's the interest\nthat kills everyone, and the government loses nothing by changing the rate to\n0%.",
  "data/reddit-ask/r/AskHistorians/comments/uzndw0/im_a_roman_naval_officer_why.json": "From an outsider's glance, it seems there are a variety of benefits from joining\nthe Roman Army as a member of the equestrian class, with opportunities for\nbattle, prestige, and even a chance for political power or in the imperial\nperiod, the Emperorship!\n\nMeanwhile, the navy seemed relegated to a…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/uzmnro/was_it_wrong_of_me_to_glance_at_a_girls_tits.json": "I’m 15[M] and I’m starting to realize I’m in a constant state of horny, from the\nmoment I stepped outside I seen this girls nips hard I was like damn, but as I’m\nwalking my dog we go in that direction she goes down to pet him but she was\nwearing like a shirt that shows 85% so I had a look but I…",
  "data/reddit-ask/r/askscience/comments/uzjv10/do_specific_nerves_have_a_set_purpose_or_do_all.json": "What I mean is: In nerve grafting, they typically harvest a nerve (let's say the\nsural nerve) in order to reconstruct another nerve.\n\n\n\nDo nerves have actual specific purposes (on their own) or is it the location of\nthe nerve itself that is responsible for it's job? (i.e. a sural nerve is the\nsame…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/uzdohb/why_do_people_get_so_bothered_about_women_wearing.json": "I saw this post of this celeb influencer with her kid at the water park and she\nwas wearing a normal bikini suit and she has a big ass. Everyone in the comments\nare saying how inappropriate it was for her to be wearing a bikini bathing suit\nto a kids water park but honestly what little kid is…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/uzt464/does_anyone_want_to_just_live_their_lives.json": "As many issues as there in the world, knowing you can help, how many people out\nthere just want to bury their faces and want to just not care anymore?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/uzbqoh/the_accumulation_of_all_those_little_rules_all.json": "It's so close to making me quit reddit.\n\nI'm fucking done editing a perfectly normal Post 100 times because of stupid\nlittle rules that aren't even implemented how they were intended.\n\nEdit: Fuck of course I have a missed Word in the title, but I'm too lazy to\nRepost it. No but i'm Not too lazy to…",
  "data/reddit-ask/r/AskHistorians/comments/uzq5rr/i_get_the_impression_that_across_history_form.json": "When I read the Gallic Wars I was surprised by Julius Caesar just arriving\nsomewhere and recruiting a new army out of nowhere. It sounds like his soldiers\njust went to towns and cities, forcing the men there to join his army without\nmuch of a choice\n\nAnd apparently the same thing kept happening for…",
  "data/reddit-ask/r/AskHistorians/comments/uzx73j/who_is_the_earliest_person_for_whom_we_have_a.json": "I'm thinking beyond hieroglyphics, and beyond a portrait stamped on a coin. A\nreasonably accurate visual depiction like a contemporaneous painting, drawing,\nor sculpture where we can actually observe a reasonably accurate visual\ndepiction.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/uzzpa9/what_if_i_get_hard_at_a_nude_beach.json": "The idea of me being around other naked people is enough for me to get hard.\nBasically I get hard easily. If in the future I want to go to a nude beach is it\na problem? For example I go in the water and for some reason I come out hard. Am\nI seen as a creep?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/v003jp/as_a_poc_have_you_ever_been_educated_on_your.json": "I'm a 31 African American woman. I have worn my natural hair, braids,\nstraightened, etc. Recently because of the whole Will Smith slapping Chris Rock\nthing one of my woke white woman friends started going on about how words are\nviolence and she started EDUCATING ME on what black women have gone…",
  "data/reddit-ask/r/NoStupidQuestions/comments/uzm5zb/how_do_people_decide_they_are_nonbinary.json": "I'm a girl and was raised in the 90's/00's being taught that it's fine to be\nfeminine and masculine. I played with my brother playing star wars and soldiers\nand football and cricket and getting messy outdoors, I played barbies with my\nsister and loved makeup and netball and doing my hair and…",
  "data/reddit-ask/r/AskHistorians/comments/uzznal/were_there_any_asian_or_african_expeditions_to.json": "We hear almost exclusively about the European expeditions and conquest of the\nNew World after its discovery. Was there any such expeditions done by Asians or\nAfricans?",
  "data/reddit-ask/r/askphilosophy/comments/uzvl5u/why_is_suicide_a_bad_thing.json": "if someone decides that they don’t want to live their life, which belongs to\nthem only, why should they be forced to? i mean if a person is responsible for\ntheir own actions and their own body, why aren’t they responsible for their life\nand can decide when to get off the ride? (metaphorically…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/v053aq/why_do_i_never_wake_up_full_of_energy.json": "I [F20] slept 10,5 hours tonight. If I sleep 7, I am really really tired. If I\nsleep 8 I am tired, 9 I am tired. I am always tired.\n\nYesterdaynight I slept 9,5 hours. I woke up at 10.15. That evening I went to bed\nat 21.15, slept around 21.30 and woke up tired at 7.45\n\nWhy???\n\nWhat can I do to wake…",
  "data/reddit-ask/r/AskHistorians/comments/v062ok/the_immigration_act_of_1918_gave_the_us.json": "Specifically this. https://en.m.wikipedia.org/wiki/Immigration_Act_of_1918",
  "data/reddit-ask/r/NoStupidQuestions/comments/v04kpw/i_think_i_messed_up_does_this_girl_like_me.json": "I (15m) was in a somewhat heated argument yesterday with a acquaintance (15f)\nabout whether it is possible to have a meaningless kiss. She was heavily arguing\nthat it was impossible to kiss someone without it meaning anything (even if it\nwas really small) and I argued otherwise. After a few minutes…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/v06o0q/should_we_just_break_up.json": "I (26F) have been together with my boyfriend (34M) for around 3 years now.\nEverything was going great and I was deeply in love with this person. He said he\nwas too and we were planning to get married, have kids in the future etc.\n\nLast year I’ve had a surgery and gained a lot of weight cause I was…",
  "data/reddit-ask/r/NoStupidQuestions/comments/v03r71/are_there_more_eyes_or_legs_in_the_world.json": "My friends are having a debate. One says if you include the legs of chairs and\ntables and such then there would be more legs. Another says fish have eyes but\nno legs which is a huuuuge bonus because there are many fish in the ocean,\nobviously. But my idea is tardigrades and such minuscule bacteria…",
  "data/reddit-ask/r/NoStupidQuestions/comments/v0ae54/is_it_weird_that_i_really_dont_want_to_have_sex.json": "I’m a teenager and I’m male, my friends often talk abut sex being something they\nwant to do, but personally I really don’t want to have sex whit anyone anytime\nsoon. I don’t know why, but I just really don’t want to. Is this weird?",
  "data/reddit-ask/r/askscience/comments/v09ecx/what_will_you_find_in_a_typical_cubic_meter.json": "Is it absolutely nothing? Or are there any traces of gases or whatsoever? Thank\nyou!",
  "data/reddit-ask/r/TooAfraidToAsk/comments/v0efoo/why_do_straight_horny_men_slut_shame_women.json": "As a straight dude who enjoys sex (not uncommon) I cannot for the life of me\nfigure out why dudes in my position would want to make a woman feel bad for\nhaving sex. Straight women would be much more likely to sleep with men if men\ndidn't make them feel bad about it constantly, which is in our best…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/v0ecke/why_is_kink_at_pride_even_debatable.json": "Its a public parade, why add sex to it? Go to something catered to that at an\nafter party..but not at a place where families could be there and onlookers.\n\nI just never understood how people would debate on such thing, it seems\nborderline creepy.\n\nWhats up with that?",
  "data/reddit-ask/r/NoStupidQuestions/comments/v0loms/you_cant_drink_at_18_but_you_can_buy_a_ar15_in.json": "Im from europe i just read about this. Isnt this weird af? Why is the law so\nweird?\n\nEdit: I think i get it now thanks, Idk why people assume i want the age of\ndrinking to be lower im just comparing the ages",
  "data/reddit-ask/r/NoStupidQuestions/comments/v05uwm/how_exactly_am_i_supposed_to_meet_women_at_bars.json": "People always say \"go to bars to meet women\" but that just seems insane to me.\n\nEveryone is already with their own friend groups. Either a mix of girl and guy\nfriends, girls' night out or whatever\n\nI'm just supposed to butt into their conversation and hope they invite me to\njoin them?",
  "data/reddit-ask/r/askscience/comments/v07yfh/is_there_a_term_or_specific_rule_sort_surrounding.json": "Many signs and labels use a sort of ‘shortened grammar’ in which certain words\nsuch as ‘the’ are omitted where their use should be obvious.\n\nI can think of a few common examples off the top of my head, although I have\nseen some signage where many more qualifying words are omitted: “Do Not…",
  "data/reddit-ask/r/askscience/comments/v0m24k/were_any_viruses_or_diseases_eradicated_during.json": "If so, which ones?\n\nIf not, how did they manage to survive nearly a year of lockdowns? How did they\nadapt?\n\nEdit: spelling",
  "data/reddit-ask/r/NoStupidQuestions/comments/v075yq/do_you_ever_look_in_a_mirror_and_go_wow_thats_me.json": "As well as other family members for example and say “that person right there,\nthat’s my mom/dad” for example",
  "data/reddit-ask/r/AskHistorians/comments/v0ki6b/why_would_you_join_the_roman_navy_over_the_roman.json": "(Posting because the last thread was removed for being a word-for-word copy of a\nprevious post, which never got an answer\n[https://www.reddit.com/r/AskHistorians/comments/u1kk1k/im_a_roman_naval_officer_why/])\n\nIt seems like being a member (especially an officer) of the Roman army came with\na lot…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/v0oz29/why_does_jaret_leto_keep_getting_work.json": "The guy is creepy as hell. A bunch of rape allegations, has a personal cult on a\nprivate island, reportedly a total douche to work with.\n\nWhy does he keep getting lead roles and AAA movies?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/v0u6nj/my_boyfriend_wont_initiate_sex_what_do_i_do.json": "Throwaway.\n\nMy (23F) boyfriend (23M) have had very little sex recently.\n\nMy boyfriend and I have been dating for 4 years. Our sex drive and sex life has\nalways been good. He is usually the one who initiates sex and that’s how it’s\nalways worked for us.\n\nHowever, about a month ago, we had a…"
}