{
  "data/reddit-ask/r/NoStupidQuestions/comments/ufo23t/is_dating_soulcrushing_for_everyone_or_am_i_just.json": "I’ve only started dating recently and I’m ready to delete all the apps and just\ndie alone. I hate going on pointless first dates.\n\nI was also starting to feel more confident in myself until I started dating, now\nI just have a whole lot of self-doubt. If a guy doesn’t want a second date I…",
  "data/reddit-ask/r/AskHistorians/comments/ufs52y/islamic_sources_describe_the_vikings_rus_as_very.json": "The 10th-century Muslim traveler Ahmad ibn Fadlan had this to say about the\nvikings. “They are the filthiest of all Allah's creatures: they do not purify\nthemselves after excreting or urinating or wash themselves when in a state of\nritual impurity after coitus and do not even wash their hands after…",
  "data/reddit-ask/r/NoStupidQuestions/comments/uft96f/is_it_alright_to_ask_my_dad_not_to_kiss_me_anymore.json": "Okay some context, my (31f) family has a lot of issues when it comes to\nboundaries. Touching, joking, giving advice when not asked, and so on. Well my\nbiggest issue is that my dad likes to kiss my neck or back. I hate it. It\nliterally makes my stomach knot and I have told him on multiple occasions…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ufp206/what_does_it_mean_when_a_girl_tell_me_i_fuck_like.json": "asking For a friend...",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ufvz6i/how_do_i_politely_tell_the_owner_of_the_gym_i_go.json": "So I go to a gym. In said gym, there's a VERY small tank that houses a very sick\nBetta fish. The tank is filthy and has no filtration whatsoever. It doesn't take\na fish expert to see that this fish is dying. I have a tank at home and whenever\nI go to the gym and see the Betta, all I want to do is…",
  "data/reddit-ask/r/NoStupidQuestions/comments/ufoosa/does_anyone_else_use_the_word_we_when_thinking.json": "I caught myself randomly, I had this thought when asking myself if I ought to\nhave some chocolate ice cream; “well, we’re home alone, it’s the perfect time to\nsneak some ice cream before dinner.” Let’s disregard the fascinating and\nplan-to-unpack-later quandary that I’m an adult married woman who…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ufy2k4/why_is_it_considered_offensive_for_white_people.json": "i know if its not done properly or taken care of the right way it can harm your\nscalp or hair. but when done properly, whats the harm in having them?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ufziz2/why_are_people_more_focused_on_forgiving_student.json": "I understand that forgiving student loans would change a lot of people’s lives,\nbut it just seems like it’s not addressing the core of the problem. Forgiving\nexisting loans doesn’t change that people will continue to go to college and\naccumulate the same massive amounts of debt that we’re seeing…"
}