{
  "data/reddit-crypto/r/CryptoCurrency/comments/v2c9h5/a_fact_ignored_by_most_crypto_investors_profits.json": "How often did I read something like \"crypto can help the little men to escape\npoverty\" or \"it could make us all financially independent\". Yesterday (I\nbelieve) someone posted a study claiming that the average crypto investor knows\na lot about crypto, but a lot less about our financial system than…",
  "data/reddit-crypto/r/CryptoCurrency/comments/v2ewy6/fake_tickets_lead_to_riots_before_cl_final.json": "On Saturday night Liverpool played the Champions League final against Real\nMadrid in Paris. The final in Paris was briefly delayed due chaotic scenes\noutside the Stade de France. The French police tear gassed fans (including\nfamilies) that showed up to stadium with fake tickets.\n\nAccording to the…",
  "data/reddit-crypto/r/CryptoCurrency/comments/v2moky/and_the_solana_network_has_been_halted_yet_again.json": "Solana network is currently down yet again and is not producing blocks.\n\nAccording to Solscan, the last block was produced 5 hours ago. This is the 4th\nor 5th time the network is going down in recent months.\n\nSolscan - 5 hours…",
  "data/reddit-crypto/r/Bitcoin/comments/v2i64h/bitcoin_is_hope.json": "I'm a guy in my late 20's from Germany. Growing up I never forgot how they gave\nus the Euro when I was a kid in the early 2000s. Initially for every 'deutsche\nmark' we got 0.5 Euros, but I was super confused when my parents told me that\ntheir salary got divided by 2 (x0.5), but consumer prices went…",
  "data/reddit-crypto/r/CryptoCurrency/comments/v2mokc/aaaaaand_its_gone_nearly_500000000_worth_of.json": "Nearly $500,000,000 worth of positions got wiped in the last 24h and the numbers\nkeep going up.\n\nWhen will people learn? The market recovered slightly for one day and people\naped into long positions again immediately. Why not wait a bit longer to see if\nthis is just a dead cat…",
  "data/reddit-crypto/r/CryptoCurrency/comments/v2kb9t/ust_how_i_lost_1m_because_of_kucoins_manipulation.json": "Disclaimer: sorry for my poor language, English is not my mother tongue.\n\nUpdate #1: Initial post\n\nAt the beginning of May 2022, investors in Anchor protocol panicked and withdrew\ntheir funds ($15B) during a bank run. UST (Terra stable coin) unpegged. The\nTerra ecosystem collapsed. 50 billion has…"
}