{
  "data/reddit-ask/r/AskHistorians/comments/ttdo9f/i_am_famed_naturalist_historian_politician_and.json": "Salvete! I am here sitting on the shores of the bay of Naples enjoying a calm\nevening at rest, between my busy life as an imperial administrator, writer,\nacademic, natural philosopher, natural historian, military commander,\nrhetorician, etc... As I can gaze across the bay at the rolling slopes of…",
  "data/reddit-ask/r/NoStupidQuestions/comments/tthehn/should_puerto_rico_be_granted_statehood_to_become.json": "What do you think? Statehood for Puerto Rico?",
  "data/reddit-ask/r/NoStupidQuestions/comments/ttiojj/why_is_it_bad_to_be_a_socialist.json": "I’m so confused on why it’s a bad thing in America and other parts of the world\nto be a socialist.\n\nI live in Sweden and I get free Heath care that works very well. Just the other\nday I got a free x-ray. Wait times are no problem. I also got to visit a\ntherapist for free after my grandfather died.…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ttfij5/why_does_it_take_45_minutes_for_me_to_climax.json": "Does having a condom on prevent some men from climaxing? This is a recurring\nenough issue to where I’ve realized I’ll never fuck someone and be done in under\nhalf an hour. It’s better than lasting 5 minutes, but by the end it’s kinda\npainful for both of us. I just don’t understand",
  "data/reddit-ask/r/AskHistorians/comments/ttdhdm/april_fools_alert_askhistoricalfiguresanything.json": "Hi everyone!\n\nAs is tradition, for April Fools we let our hair down a bit and allow some\nfrivolity to infest the subreddit. This year we are doing r/HistoricalAMA\n[/r/HistoricalAMA], inviting historical figures from throughout the centuries to\nanswer questions from their legions of fans.\n\nUntil…",
  "data/reddit-ask/r/askscience/comments/ttk7ay/is_there_enough_density_change_in_a_trees_growth.json": "Hearing that in order to work out the age of a tree you need to either take a\ncore sample or cut down the whole tree, opening it up to infection or even\ndeath, couldn't Ultrasound be adapted to peek at the rings without needing to\ndamage the tree?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ttjkc1/why_is_person_of_color_considered_okay_but.json": "I'm black and even I don't understand this.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ttm3qe/is_it_bad_that_i_dont_like_to_think_of_myself_as.json": "It leaves such a bad taste in my mouth. It just feels like such a strong word.\nAnd whenever I think of it in those terms, it’s like it becomes… real. This\nprobably doesn’t make any sense but I don’t know how to describe it. It doesn’t\nalways feel like I was raped. Even though technically it was non…",
  "data/reddit-ask/r/AskHistorians/comments/ttgh1p/i_am_the_true_sacred_sovereign_on_earth_the.json": "Proof\n[https://media.discordapp.net/attachments/761189757761749003/958214626091348039/Hong_AMA.png?width=1702&height=1404]\n\nGreetings to my brothers and sisters over the Internet. I, the true sacred\nsovereign, have deigned to speak candidly beyond the walls of my mighty palace\nto those who would…",
  "data/reddit-ask/r/NoStupidQuestions/comments/ttfe7a/why_is_it_so_hard_to_buy_a_new_car_with_manual.json": "I keep trying. Nissan said it was possible but would take a year and would cost\nme more. I remember when you paid extra for automatic. What gives?",
  "data/reddit-ask/r/AskHistorians/comments/ttmep9/i_am_leonidas_king_of_sparta_ask_me_anything.json": "GREETINGS, REDDIT! I AM LEONIDAS, THIRD SON OF KING ANAXANDRIDAS AND FIRST IN\nFAME OF THE AGIAD HOUSE! THE EPHORS HAVE DECREED A RARE DAY OF OPENNESS TO THE\nCURIOSITY OF FOREIGNERS!\n\nPROOF! [https://imgur.com/az1mAT5]",
  "data/reddit-ask/r/AskHistorians/comments/ttfaqw/explorer_governor_of_new_york_vice_president.json": "Proof: https://imgur.com/S5nmQBV",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ttkglm/housing_bubble_burstgood_thing.json": "If the housing bubble bursts, that's means people who are investing in\nproperties will loose their profits and potentially the money they invested in\nthe first place, but in the end it will mean housing is more affordable,\nbenefiting people struggling to own a modest single family home...right or…",
  "data/reddit-ask/r/NoStupidQuestions/comments/ttkcdr/im_genuinely_curious_but_why_does_the_republican.json": "I’m neutral, but see way too many articles that mention Republicans voting\nagainst anything that can help American citizens live a better life that’s\nnormal anywhere outside the US.",
  "data/reddit-ask/r/AskHistorians/comments/ttnktq/i_am_the_honorable_andrew_oliver_esq_the_assigned.json": "Honorable gentlemen,\n\nSome of you might know my name and person, but for those who are unaware, my\nname is Andrew Oliver Esq., Secretary of the Province of Massachusetts Bay. In\nthe early months of the year of our lord seventeen-sixty-five, I was\ncommissioned as stamp distributor for the Province…",
  "data/reddit-ask/r/AskHistorians/comments/ttpm8n/we_are_the_wives_of_henry_viii_king_of_england.json": "Greetings! Here be our proof. [https://imgur.com/a/MHCMep3]\n\nWe, the six wives of King Henry VIII, shall jointly share this account to answer\nyour questions about our lives and our tumultuous times. We shall individually\nintroduce ourselves:\n\n> I am Katherine, daughter of Isabel of Castile and…",
  "data/reddit-ask/r/AskHistorians/comments/ttplom/i_am_sokrates_son_of_sophroniskos_of_the_deme.json": "But do not wonder if I ask you questions in return.",
  "data/reddit-ask/r/NoStupidQuestions/comments/ttqck9/republicans_of_reddit_can_someone_please_explain.json": "I just read a Fox News article and it seems this issue has resurfaced in\nright-wing media. The article is titled “Gaetz sends Nadler hard drive\ncontaining contents of Hunter Biden’s laptop.” Since this controversy’s\ninception, I’ve been unable to find any evidence of wrongdoing or illegality…",
  "data/reddit-ask/r/NoStupidQuestions/comments/ttpjyp/im_a_21_year_old_male_and_i_feel_my_memory_is.json": "I feel like as a 21 year old, my memory seriously should not be this bad, and\nI’m not sure if it’s always been this bad or if it’s been declining recently\n(see. Shit memory) I often forget things I’ve just read and have just been\noverall slow it feels; am I going crazy? Also, not sure if there is…",
  "data/reddit-ask/r/AskHistorians/comments/ttmq1h/i_am_jeane_dixon_famed_medium_psychic_and.json": "Proof. [https://imgur.com/a/4yK4Px5]\n\nIt is I - the one, the only, the incomparable Jeane Dixon, renowned psychic,\nauthor and close confidante of the 40th President of the United States, Nancy\nReagan. I've written multiple best-selling books, including an autobiography, a\ncookbook and of course my…",
  "data/reddit-ask/r/AskHistorians/comments/tteaqz/hello_i_am_rebecca_gratz_a_charitable_organizer.json": "Proof [https://imgur.com/hjwTrGS]\n\nI was born in Philadelphia in 1781, soon after the founding of our great nation.\nMy parents raised us to be devout Jews, but also gave us excellent educations,\nand my father's income allowed us to mingle with society. As such, while only an\namateur poet myself, in…",
  "data/reddit-ask/r/AskHistorians/comments/ttl2vn/i_am_an_soe_wireless_operator_broadcasting_from.json": "... --- ...\n\nGreetings! This message is coming to you over the airwaves from a secret\nlocation in Nazi-occupied Paris. I can't stay broadcasting for too long before\nthe Gestapo track me down, so get your questions in before I have to go off air\nand hide.\n\nedit: I will decode these at the end of…",
  "data/reddit-ask/r/NoStupidQuestions/comments/ttstre/why_does_every_website_now_have_massive_annoying.json": "I hate companies tracking my activities as much as the next guy but why do\nwebsites have to be so obnoxious about notifying us that they're tracking us?\nSeems excessive and pointless.",
  "data/reddit-ask/r/NoStupidQuestions/comments/tthk65/crotch_staring.json": "I just have this automatic habit of looking crotch area on men . In a split\nsecond , I just look down there and sometimes I get caught doing it and I don’t\nknow why I do it ?! It’s automatic, I don’t even realize I’m doing it most of\nthe time. Anyone else ? Why ?",
  "data/reddit-ask/r/NoStupidQuestions/comments/ttxi72/how_can_i_see_who_voted_no_on_the_insulin_bill.json": "I live in Arkansas and completely believe that our representatives voted no for\nthis bill, but I want to make sure before I go writing letters to every level of\nmy government up to my governor.",
  "data/reddit-ask/r/NoStupidQuestions/comments/ttvdqa/when_i_say_im_deaf_whats_the_first_thing_that.json": "First question, not first thing, sorry, can’t edit title. Doing this for a\nschool assignment. Feel free to ask questions (I am deaf)",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ttyxzs/how_can_smallboobed_girls_gain_confidence.json": "I’m insecure about my small boobs and always have been. I’m a B-cup and I’ve\nlooked into implants and fat transfers for awhile. That being said, this\ninsecurity makes me hesitant to take off my shirt when my bf and I have sex. I\nreally try to avoid it as much as possible honestly. I told my bf…",
  "data/reddit-ask/r/AskHistorians/comments/ttw68k/i_am_henry_curtmantle_king_of_england_duke_of.json": "I am Henry, by the grace of God, King of England, Duke of Normandy and\nAquitaine, Count of Anjou and Maine. Son of Empress Matilda, and Geoffrey\nPlantagenet, Count of Anjou.\n\nIn light of my connection with the murder of Archbishop Thomas Becket, my former\nchancellor and friend, and the recent…",
  "data/reddit-ask/r/askscience/comments/tu24t5/would_the_insulin_of_the_1920s_be_acceptable_for.json": "In the 1920s, insulin co-inventors James Collip and Charles Best sold the rights\nto the University of Toronto. Since that time I believe the formulations of\ninsulin and its manufacturing method have changed quite a bit. My question: If\nyou were able to transport the insulin from the 1920s to…",
  "data/reddit-ask/r/askscience/comments/tty6fr/not_sure_if_this_is_exactly_a_science_question.json": "I’m talking about records detailing what we now know could’ve been significant\nradioactive sources or radioactivity-related injuries, any time between the\nfirst written record up until the first industrial revolution.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/tu5vz5/for_guys_if_i_a_female_were_to_walk_up_to_you_on.json": "For context, I live in a not-so-great city but have to walk home at night all\nthe time, and sometimes I don’t feel safe. I want to go up to an unassuming guy\nand do the whole “oh my god Matt there you are, I’ve been looking all over for\nyou!” but I feel that a guy would either not get it or I’d be…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/tu3f2c/is_cereal_for_dinner_an_acceptable_meal_for_an.json": "My roommate thinks that adults should not eat cereal with the slim exception of\neating it for breakfast. I’m definitely going to eat cereal whenever/wherever I\nwant regardless of what anyone thinks, just wanted to know y’all’s thoughts on\nit.\n\nEdit - Clarification: not sure how much it matters but…",
  "data/reddit-ask/r/NoStupidQuestions/comments/tu50kb/do_other_guys_actually_enjoy_watching_a_girl_blow.json": "I consider myself an average male with average taste in porn, but for the life\nof me I can’t figure out who thought it was hot when a girl sucks on a toy as if\nit’s a real dick. Are there guys out there that enjoy watching these scenes?\nIt’s sort of a mood killer for me because all I can think…",
  "data/reddit-ask/r/NoStupidQuestions/comments/tu9b41/what_would_you_call_a_chocolate_chip_cookie.json": "They are technically not sugar cookies, as those have different amount of flour\nand use only white sugar, while chocolate chip cookie recipes call for both\nwhite and brown. Dough cookie maybe?",
  "data/reddit-ask/r/AskHistorians/comments/tu10hl/i_am_harry_truman_failed_haberdasher_piano_player.json": "It does my heart good to be here. Best get all your questions in before I strike\na blow for liberty this afternoon, though, although I may come back and answer\nwhat I can later.\n\nI'm joined by my press secretary, /u/therealcharlieross, who often advises me to\nsay 'no comment' among other…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ttqs5r/why_do_people_smoke_cigarettes.json": "I mean it is not like weeds or drugs , it doesn't drug you or make you feel good\n? Am i missing something ?",
  "data/reddit-ask/r/AskHistorians/comments/tug62y/what_is_the_basis_for_the_stereotypical_cartoon.json": "Just about every animated depiction of a bomb that I’ve ever seen is the same -\na black sphere with a fuse sticking out of it, like this.\n[https://cdn4.vectorstock.com/i/1000x1000/12/73/a-classic-cartoon-style-black-round-bomb-lit-vector-20631273.jpg]\nIs that based on any actual explosives that…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/tui3nr/is_not_having_enough_sex_a_good_enough_reason_to.json": "This recently happened to a buddy of mine.\n\nThey were together for about 2 years, and after countless of efforts from his\nside to talk about the lack of sex in their relationship (and things not\nchanging) he decided to break up with her.\n\nNow everyone thinks he's the bad guy, because everything…",
  "data/reddit-ask/r/NoStupidQuestions/comments/tuaof9/what_does_it_mean_that_will_smith_resigned_from.json": "Like are his movies no longer able to be nominated? Can he no longer attend the\nOscar's? Did he previously have a vote on something that he doesn't now?",
  "data/reddit-ask/r/NoStupidQuestions/comments/tuh5x3/why_arent_you_required_to_retake_your_driving.json": "Cant think of any other licence where you're operating machinery that doesnt\nrequire regular renewal.",
  "data/reddit-ask/r/NoStupidQuestions/comments/tuiclq/why_is_platonic_marriage_not_a_thing.json": "hear me out. let’s take marriage for what it essentially is- a legal and\nfinancial binding. By no means does marriage heighten or deepen a romantic\nconnection.. therefore it makes me think- someone you have a bond with and\nestablished deep trust for that can support a life you both want is someone…",
  "data/reddit-ask/r/NoStupidQuestions/comments/tuj2op/my_girl_is_dogsitting_at_someones_house_for_a.json": "The clients are an older couple, I'm guessing the guy signed into his google\n(edit seems to be amazon) account from 2007 and it's connected. My first thought\nwas to report it but that's either really ruining someone's life (if he's not\nactually a pedo) or If they determine there's nothing they can…",
  "data/reddit-ask/r/AskWomen/comments/tugpqc/whats_a_big_mood_killer_something_that_really.json": "EDIT: thanks for the replies!",
  "data/reddit-ask/r/NoStupidQuestions/comments/tuvdeu/your_telling_me_that_there_are_billions_of_stars.json": "I can’t even comprehend how big the universe is. And that’s just the observable\nuniverse….",
  "data/reddit-ask/r/NoStupidQuestions/comments/tuxk46/who_actually_feels_that_money_would_solve_all_of.json": "I feel like I would pay for the top notch medical care",
  "data/reddit-ask/r/TooAfraidToAsk/comments/tuyrn9/why_do_so_many_men_simply_dont_give_women_oral.json": "Do they not know what the heck they are all doing or Seriously, this is one of\nthe most frequently talked about things in sex threads on female related\nsubreddits. It also seems to be an experience that my IRL female friends very\nmuch share: dudes just stick it in your mouth, then your vagina, then…",
  "data/reddit-ask/r/AskHistorians/comments/tusp1l/did_welldigging_technology_improve_or_change_in.json": "I know the question is very general. I am interested in any technological\nimprovements to water wells. Regardless of place or general time.",
  "data/reddit-ask/r/NoStupidQuestions/comments/tuzh35/did_anyone_else_used_to_think_ftw_meant_fuck_the.json": "I thought it was the inverse of WTF, and I thought it was just a phrase you said\nwhen something good happened. Like, \"hell yeah man, fuck the what.\" Did anyone\nelse think this? I think some other kids used it like that growing up, so I feel\nlike I might not be the only one.",
  "data/reddit-ask/r/NoStupidQuestions/comments/tuya8r/any_dudes_out_there_get_easily_teary_eyed_during.json": "I remember I once got teary eyed during Nacho Libre of all films when he got\nkicked out the orphanage but he walked away with his head high because he knew\nhis path was righteous. Fuck getting teary just thinking about it now lol.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/tv1hgb/anyone_get_sad_when_no_one_asks_about_a_bandaid.json": "I got a lil cut on my finger and put a bandaid on it. My lady and mom didn’t\nnotice. I waited for them to notice. Maybe they did. I’m a grown man but it\nstill bothers me on a superficial level 🤷",
  "data/reddit-ask/r/AskWomen/comments/tv08u9/women_what_is_something_you_have_stopped_buying.json": "What is something you have decided to stop buying for whatever reason?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/tv4tw0/how_do_i_tell_my_bf_this_news.json": "My bf told me from the very beginning that we will always be living with his mom\nor she will always be living with us. (I was only 18 and She’s an entitled\nnarcissist who thinks she can’t live without her son) I don’t want to live with\nthis woman. I can’t think of anything unhappier than that,…",
  "data/reddit-ask/r/AskHistorians/comments/tutd5b/how_do_contemporary_academics_who_say_that_race.json": "In the ancient world, there seem to be numerous examples of writers and artists\nacknowledging that groups of humans have shared physical and cultural\ncharacteristics and labeling them with specific group names, in some cases\nstereotyping them negatively. How does this differ from what we now call…",
  "data/reddit-ask/r/AskHistorians/comments/tv5p6z/the_catholic_church_held_all_its_rites_in_latin.json": "The Catholic Church held all its rites (including the Mass) in Latin until\nSecond Vatican Council (1962-65), and prohibited translations of the Bible until\nquite late. Was it an intentional obscurantism to not let the believers\nunderstand the Bible and liturgy (so that the Church could manipuate…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/tv3i6d/why_is_our_society_built_in_a_way_that_we_have_to.json": "If life is so precious and we should take advantage of everyday we have, why is\nit that our “normal” is to have to work so hard for things we should already\nhave. I think the way our society is built makes it too stressful to be able to\ntake advantage of how lucky we are to be alive, and instead…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/tv7dhn/if_you_spank_someones_ass_really_hard_and_they.json": "The skin can’t heal itself if you’re dead, right?\n\nEdit: I don’t mean they die from the spanking, if they die from something\nunrelated.",
  "data/reddit-ask/r/AskHistorians/comments/tv8rh8/the_popular_sea_shanty_what_shall_we_do_with_a.json": "I'm thinking about women in particular here, since I imagine it must have been a\nvery male-dominated environment. Did they face a lot of harassment? Also, was\nsocializing with the crew permitted? And if not, what did they do for fun?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/tv7xlv/why_do_so_many_black_women_wear_wigs.json": "For context, I live in the Netherlands, so I'm not sure how it is in other\ncountries but I am assuming is not exclusive from here.\n\nIt seems that many black women wear wigs or fake hair, and there are several\nshops that focus on this market. I don't know the reason. I guess it can be\nbecause of…",
  "data/reddit-ask/r/AskHistorians/comments/tv9gz2/dantes_divine_comedy_features_8_verses_written_in.json": "My question was prompted by this wonderful video\n[https://www.youtube.com/watch?v=p8qdqAE5ZKA].\n\nI can think of two factors:\n\n1.) Occitan-speaking regions' absorption into France following the Albigensian\nCrusade and the reduction of its cultural prominence (and that of cities like\nBordeaux's…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/tv88l1/boys_watch_lesbian_porn_do_girls_also_watch_gay.json": "lesbian logic :- 2 girls are better than one\n\nso do girls also follow the same logic ?",
  "data/reddit-ask/r/NoStupidQuestions/comments/tva0zh/is_it_true_that_in_some_western_countries_like.json": "#I don't mean flushing, but about cleaning your bottom after the business is\ndone.\n\nNo judgement here as I believe in you do you, but my friend who has lived in all\nthree places told me so. I am just wondering if it is true or is he just pulling\nmy leg?\n\nHere in Sri Lanka, we use a hand bidet, so…",
  "data/reddit-ask/r/askscience/comments/tv8af5/what_determines_where_the_poles_are_on_a_ball.json": "On a bar magnet, one end is north and the other is south. What exactly\ndetermines which end is which?\n\nWhat about a sphere magnet? They would be on opposite sides obviously but what\ndetermines where the north and south are on something that doesn't have ends?\n\nCouldn't really find an answer from…",
  "data/reddit-ask/r/AskWomen/comments/tvdqcm/women_who_live_with_their_so_which_year_in_your.json": "How has it been so far in terms of emotional and sexual health?",
  "data/reddit-ask/r/NoStupidQuestions/comments/tvj5jo/is_it_natural_to_feel_like_the_covid19_pandemic.json": "I feel like it’s changed me. I don’t even recognise who I am anymore.",
  "data/reddit-ask/r/askscience/comments/tv4jgc/why_is_a_french_curve_set_sufficient_for_drawing.json": "The instrument in question is this: https://en.m.wikipedia.org/wiki/French_curve\n\nIt seems to be based on euler curves, and its use is to take a number of points,\nfind the part of the toolset that best lines up with some of them and using that\nas a ruler.\n\nWhat I can't wrap my head around is…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/tvoiar/why_are_women_more_likely_to_believe_in_astrology.json": "I’ve noticed that more women bring this subject up than men, and every time it\nis referenced in media the people who believe in it are referred to as ‘rock\ngirls’ or some variant. I’m not knocking it, I’m just wondering if it’s\nsomething to do with how women’s vs. men’s brains work biologically?…",
  "data/reddit-ask/r/AskHistorians/comments/tvk1ad/why_did_coastal_parts_of_west_africa_never_take.json": "I understand on a general level, a large part of it is probably due to the mass\ncolonization and dicing up of African regions which led to/increased turmoil\nacross the continent, but is there more to it than that or more specifics?\n\nWhat I mean is, for US folks (I can’t speak to other countries),…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/tvqaqn/do_people_actually_think_babies_are_cute_or_is_it.json": "Not even gonna lie, babies are kinda just ugly. All of them. But people get\noffended when I say so. I find it hard to believe that they would actually think\na baby is cute.",
  "data/reddit-ask/r/NoStupidQuestions/comments/tvwlxl/the_us_visa_form_asks_you_if_you_are_planning_to.json": "I'm really struggling to wrap my head around why this question exists. If I was\na terrorist then I'd just click no. Surely this has caught NO terrorists ever.\nBut I'm sure people have accidentally clicked yes a few times\n\nSo why on earth do they ask it",
  "data/reddit-ask/r/AskHistorians/comments/tvv0z9/now_that_the_us_has_released_the_data_from_the.json": "I understand it's a broad question; I'm just curious about anything specific\nthat might be of interest for historians of the USA.",
  "data/reddit-ask/r/AskHistorians/comments/tvzz6i/what_led_the_welsh_english_to_unite_against_the.json": "Hello! As the title asks, I wish to know what led to an Anglo-Welsh alliance\n(Mercia, Wessex & The Cymru proper, I believe) against the Vikings.\n\nWeren't the Welsh & Anglo-Saxon factions historically hostile with one another\nalso, or did the presence of the Vikings strike both groups as…",
  "data/reddit-ask/r/NoStupidQuestions/comments/tvxid4/i_met_all_my_boyfriends_on_dating_apps_and_guys.json": "I consider myself a fairly attractive woman, and I hear it from people quite a\nlot. But guys never approach me in public, meanwhile I constantly hear from my\nfriends how they get approached in bars, cafes, public transport, streets etc.\nAlso, all of them met their boyfriends in real life and they…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/tw1l1z/is_reddit_basically_just_trolling_us_with_its.json": "So many complaints have been made for many years and the reddit video player is\nstill the same complete rage inducing garbage that never plays videos without\nlagging, stopping, not reacting or lowering the quality after 1 second...\n\nI think reddit developers just don't care and despite never ending…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/tw4wun/how_do_women_get_bigger_boobs.json": "I’m 24 and I’ve been made fun of for having small boobs since high school. I’m a\ntiny A cup and just want to grow one cup bigger. I’m just so done having small\nboobs and want to look good in certain clothes.",
  "data/reddit-ask/r/NoStupidQuestions/comments/tw5t5p/would_the_librarians_get_mad_if_i_just_waltz_in.json": "I've been struggling to find a decent way to study and the first thing that\ncomes to mind is a change of scenery. I'm lucky to have a city with a pretty\ngood library in place. My concern is: would it be rude to just plop down like\nthat? I'm planning on using my headphones to listen to music and…",
  "data/reddit-ask/r/AskHistorians/comments/tw4yyr/vikings_and_varangians_left_scandinavia_roughly.json": "Additionally, can any of the cultural differences between Western and Eastern\nEuropean cultures be partly attributed to differences in these two groups (a la\nthe argument made in Albion's Seed)?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/twjpus/is_it_ok_for_a_26yo_to_date_a_17yo.json": "My 17yo friend is dating a 26yo. I'm the only person she's told. Furthermore\nthey've already had sex (initiated by the 26yo) and that would be breaking the\nlaw.\n\nI don't feel right about it. I don't think a 26yo should be dating a 17yo\nbecause I don't think an adult should be dating a minor. That…",
  "data/reddit-ask/r/askscience/comments/twlkd9/how_do_you_determine_the_age_of_living_plants.json": "We recently visited Namibia , where the Welwitschia\n[https://en.m.wikipedia.org/wiki/Welwitschia] grows. Supposedly to ages of >2000\nyears. How would they establish this for a living example? It doesn’t have a\nstem where you could count rings.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/twrrce/why_is_reddit_full_of_snarky_commentors.json": "I’m honestly hesitant to post/comment sometimes because I know there’ll be one\narsehole who has to rush in to reply something snarky and unhelpful.\n\nYes i’m setting myself up.",
  "data/reddit-ask/r/NoStupidQuestions/comments/tws8st/i_just_rescued_4_kittens_from_the_street_what_do.json": "My neighbor abandoned 4 kittens in boxes in my neighborhood and I found them and\ntook them to a vet the vet gave them a clean bill of health but now I'm left to\nlook after them.\n\nMy friend wants to adopt 2 of them but they're so young I don't know what to do.\n\nI also have a mama cat (not their mama…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/twv138/accidentally_gave_my_boyfriend_head_with_a_cold.json": "Yesterday morning I got elbowed in the face and my lips were really tender. By\nmidday a painful lump started forming on my lip, but I was still chalking it up\nto getting elbowed. Last night, I performed unprotected oral sex on my\nboyfriend--just for a couple minutes, and he didn't cum.\n\nThis…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/twnzz6/is_being_a_single_parent_really_that_much_off_a.json": "I (30, M) am a single father of two girls (4, 2.5). I have a good head on my\nshoulders, stable career, and own my own home. I haven’t (really) tried to get\nback into the dating scene recently, but when I have in the past I was brushed\noff a LOT because I have kids. No that’s fine. I understand a…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/twthyp/why_did_the_word_retarded_become_a_slur_but_other.json": "It's a question that's been on my mind once in a while and hearing someone go\noff about its usage reminded me of it once again and thought i'd ask this time\naround. Moron, idiot, stupid, were all medical terms at some point and still in\nnormal use, and noone seems to associate it or treat it the…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/twwlzs/i_dont_understand_the_argument_for_being_born_as.json": "I’ve heard people say that they were “born gay” or something along those lines\nand they take the nature vs. nurture argument to be 100% nature and that\nsocietal influences didn’t effect their decision to come out and “if I were born\nin the 1300s Middle East I still would have been gay just…",
  "data/reddit-ask/r/NoStupidQuestions/comments/twx5bk/why_do_people_assume_that_the_way_things_are_is.json": "This constantly frustrates me. People all over seem to think that the only way\nthings can be is the way they are.\n\nI was talking to one of my coworkers about cars. He literally cannot imagine a\nworld without cars. We lived for millennia without cars and now he can't imagine\nwhat life would be like…",
  "data/reddit-ask/r/askscience/comments/twuv6l/does_the_length_of_sleep_affect_the_perceived.json": "Time in dreams is a bit scooty, but I'm sure it's a pretty common experience\nthat we sometimes have dreams which seem to go on for much longer than others.\n\nIs this at all related to the amount of time we're asleep? Can we have dreams\nwhich feel like they're longer than the time we actually slept…",
  "data/reddit-ask/r/NoStupidQuestions/comments/tx3fwc/why_do_we_say_verbally_o_instead_of_0_for_dates.json": "For example, people say 19O1 (nineteen-O-one) instead of saying 1901\n(ninteen-zero-one)? It just seems weird considering O is a letter and 0 is the\nnumber. We use them backwards verbally... which is just weird to me.",
  "data/reddit-ask/r/askscience/comments/tx3run/will_there_ever_be_a_point_in_time_on_earth_when.json": "Another phrasing: will there ever be a point in time where the beginnings of the\ngeologic record will be wiped away by geologic forces?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/tx58r3/why_people_afraid_to_say_islam_is_a_dangerous.json": "I'm living in a Islamic country. I was a Muslim till 3 years ago, and now I'm an\natheist. I have read quran verse by verse.\n\nIn an Islamic country, if you drink water in street in Ramadan, you can get\narrested and they can imprison you, and beat you just because you were thirsty.\n\nin Quran, a man…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/tx50rq/if_i_feed_wild_crows_and_eventually_teach_them_to.json": "I mean they aren't really \"mine\"",
  "data/reddit-ask/r/AskHistorians/comments/twyzgr/according_to_the_recent_news_reports_russia_seems.json": "Besides recent attempts by groups like ISIS, do we have documented cases where\nerasing cultural heritage was something intentionally done by other empires or\nnations? I've heard about Napoleon shooting off noses of statues but I'm not\nsure if that was true or not",
  "data/reddit-ask/r/NoStupidQuestions/comments/tx3ycx/my_family_wants_to_get_another_pet_but_im_scared.json": "My last pet of 18 years (my whole life) we had to put down due to renal/liver\nfailure and the trauma of that was horrifying. To watch my best friend\ndisintegrate and suffer and after 2 weeks of misery for the poor guy he had to\nbe put down, I’ll never get past it. How can people do this over and…",
  "data/reddit-ask/r/AskHistorians/comments/tx83rw/what_is_the_current_most_heated_debate_on_a_topic.json": "A question a little bit outside of the box, hopefully it won't be deleted. What\nis the current controversial discussion happening in academia, over your\ndifferent fields of study. For example, in Linguistics, the recursion debate\nrages on, but the average Joe isn't particularly aware of it. Perhaps…",
  "data/reddit-ask/r/NoStupidQuestions/comments/txasnd/is_it_okay_to_ask_if_a_person_is_clean_of_stis.json": "I feel like this is such an awkward question. Also before having sex i kind of\nwant to know someones body count and if theyve ever been tested before, but this\nseems like such an awkward exchange if you're about to get hot and heavy with a\nrando.",
  "data/reddit-ask/r/AskWomen/comments/twma7d/women_who_used_to_be_too_selfconscious_and.json": "Edit: I am sooo happy for you all <33",
  "data/reddit-ask/r/TooAfraidToAsk/comments/tx5ad5/how_can_a_fat_dude_go_to_the_gym_without_feeling.json": "I'm 20yo, and I'm 100kg (220pounds if my math is correct). I really need to go\nto the gym, both because of my physical and mental health. But I can't stop\nthinking about the fact that everyone's going to be looking at me? I also have\nno experience, so that's another issue as a whole",
  "data/reddit-ask/r/AskHistorians/comments/tx9gwr/was_stealing_a_base_in_baseball_a_deliberate.json": "What's the history behind stealing a base? It seems like an strange thing to\nallow? Was it a deliberate inclusion and if so what does it add to the game?\n\nOr did it evolve from an oversight in the rules that they decided to make an\nofficial part of the game?\n\nIt just seems so random to me and I'm…",
  "data/reddit-ask/r/NoStupidQuestions/comments/txbl2m/are_people_just_not_interested_in_climate_change.json": "So the new IPCC report on climate change is out. As expected, bad news. The\nworld has around 3 years to drastically reduce emissions to avoid the worst\neffects of climate change in a few decades. Sea levels rising (1-8 feet,\ndisplacing millions in just the US alone), droughts, more powerful…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/txcxw4/why_is_the_stereotype_that_muslims_are_terrorists.json": "Both of these prejudices are harmful to a lot of people. I am neither Muslim nor\nCatholic by the way",
  "data/reddit-ask/r/AskHistorians/comments/twy2h2/how_well_regarded_is_an_indigenous_peoples.json": "Curious to know what this group thinks about the book An Indigenous Peoples'\nHistory of the United States\n(https://www.penguinrandomhouse.com/books/237686/an-indigenous-peoples-history-of-the-united-states-by-roxanne-dunbar-ortiz/)\n\nI’m interested in a perspective like this, but googling it mostly…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/tx73oi/why_is_that_when_man_dosent_want_to_have_sex.json": "They question his sexuality\n\nQuestion his tetostorone levels\n\nQuestion if he is asexual\n\nQuestion if he has trauma\n\nHowever when it is a girl in question she can simply just not be in a mood.\nHowever when it is a guy, there has to be a certain issue. So why is that?",
  "data/reddit-ask/r/askscience/comments/tx7vn1/how_come_covid_vaccines_that_are_variant_specific.json": "Moderna is now in phase 2 of their omicron booster shot.\n\nhttps://www.clinicaltrialsarena.com/news/moderna-omicron-specific-booster/\n\nNo word on Pfizer. But why the wait? Why not just submit for an EUA right away?\nIs the vaccine that different that it would need much data to support it? Will\nthis…",
  "data/reddit-ask/r/NoStupidQuestions/comments/txgdp6/can_people_really_picture_things_in_their_head.json": "My friend told me to close my eyes and imagine a zebra in a green field. I\nobviously know what both things look like, and it registers in my mind but… I\ndon’t literally see a zebra standing in a field… do some people actually have\nthat ability?\n\nedit; and please guys don’t fuck with me I’m having a…",
  "data/reddit-ask/r/NoStupidQuestions/comments/txd3e1/do_you_ever_feel_like_you_wish_you_could_cry_but.json": "If you know what I mean, how do you deal with that feeling? I think it's been\nyears since I was able to cry no matter what situation I find myself in...\n\nEdit** I really appreciate all of yalls comments. It's nice to hear random\npeople talk about this instead of makin someone I actually know have…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/txasfy/how_does_people_like_matt_gaetz_remain_in_the.json": "From what I can gather he has been caught multiple times with underage people,\nhe constantly contradicts himself and is usually against anything that seems\ntotally sane. He voted against a sex trafficking law, against sactions against\nrussia and against capping the price of insulin at 35 dollars.…",
  "data/reddit-ask/r/askphilosophy/comments/tx2gfx/when_plato_mentions_god_is_he_talking_about_zeus.json": "What or who does Plato mean by God? As in the Timaeus when he ascribes the\ncreation of the universe to God.",
  "data/reddit-ask/r/NoStupidQuestions/comments/txigru/there_are_hundreds_of_religions_that_claim_they.json": "For example Islam claims christian and Jews even if you were good, are going to\nhell cuz you don’t believe in islam same with Jews an other religions. Why did\nyou make it so hard, there’s so many good people I know that don’t follow x\nreligion, it’s very hard to figure out what would be true and…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/txk7xb/is_the_us_medical_system_really_as_broken_as_the.json": "Do you really have to pay for an Ambulance ride? How much does 'regular\nmedicine' cost, like a pack of Ibuprofen (or any other brand of painkillers)?\nAnd the most fucked up of all. How can it be, that in the 21st century in a\nfirst world country a phrase like 'medical expense bankruptcy' can even…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/txkwpt/why_post_nut_clarity_make_me_crave_for_gay_porn.json": "Do most men has this because every time i nutted to girl porn, i start wanting\ndick in my mouth or ass. Is it gay if you want to have sex with a man but still\nfap to women in porn ?.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/txiyd4/how_do_you_figure_out_if_you_want_to_have_kids_or.json": "I've asked a few close people in my life who say you'll know when you know. But\nI haven't gotten there yet. I'm 26 and every girl my age I know has had at least\n1 but I've been thinking about it for years now and just can't pin down feeling\none way or there other I've never felt like such a fence…",
  "data/reddit-ask/r/NoStupidQuestions/comments/txjoyd/is_the_blm_global_network_foundation_really.json": "Just to clarify, I am not asking this question in bad faith. I support the BLM\nmovement (which can be separated from the foundation) and I donated money\nmyself. But I’ve been reading a few articles from reputable sources saying that\n$6 million of the donation was used to secretly buy a mansion for…",
  "data/reddit-ask/r/AskHistorians/comments/txl15c/why_did_the_voters_of_ukraine_vote_82_to_stay.json": "The Ukrainian electorate, in March 1991, voted 82% to stay Soviet\n[https://en.wikipedia.org/wiki/1991_Soviet_Union_referendum#Ukraine]. 9 months\nlater, in December, a second referendum was held (the USSR was still around at\nthis point, it wouldn't collapse until 3 weeks later) but Ukraine…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/txg4vf/do_women_like_men_with_chest_hair.json": "I feel a bit insecure about the amount of hair that i have. I usually shave it\nand let it grow a little but some times i just say \"fuck it\" and let it grow all\nthe way until I can run my fingers through the hair.\n\nEdit: thanks for the answers! I guess it is subjective.\n\nI guess a follow up question…",
  "data/reddit-ask/r/askscience/comments/txn0ia/what_are_parrots_trying_to_achieve_by_mimicking.json": "Don't know how much Animal Behaviour fits this subreddit, but I think it is a\nscientific question nonetheless.\n\nI like watching videos of domestic parrots making dozens of different sounds,\nand sometimes it's hard to think they're being made at random. When a parrot\nmimics a sound, what are they…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/txnnz8/why_do_people_want_men_to_be_emotional_yet_the.json": "Never really understood why men are told to be emotional if the only thing they\nget in return is a horrible attitude and be told to \"man up\". How come people\nwant one thing, yet be against that very same thing? Like I've heard both\nconservatives, liberals, feminists and men's rights activists say…",
  "data/reddit-ask/r/NoStupidQuestions/comments/txp81j/why_are_conservatives_opposed_to_government.json": "Sincere question. Conservatives consider mask and vaccination mandates as\nviolations of people’s rights. But forcing a woman to have baby is considered to\nbe acceptable.\n\nThe “best” justification I’ve heard is that an unborn baby shouldn’t have to be\nkilled because the mother was irresponsible. But…",
  "data/reddit-ask/r/AskWomen/comments/txo1vf/how_many_times_did_you_attempt_to_leave_your.json": "Whether it be because of personal or external reasons. The abuse can be\nphysical, mental, emotional, sexual, etc.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/txw0wu/its_2022_why_are_legislators_and_faith_leaders.json": "I'm a male. But as a progressive and a humanitarian I find it creepy and\npathetic as well as sickening.\n\nHarsh new anti-abortion laws that completely disregard the expectant mother's\nhealth, safety, and well-being. The continued criminalization of sex work\nbetween consenting adults. Those creepy…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/txl7mn/do_other_people_put_a_piece_of_toilet_paper_in.json": "Im probably just weird i guess.\n\nEdit: wow im not the only one 👍",
  "data/reddit-ask/r/AskHistorians/comments/txvzxs/in_ancient_rome_would_you_be_able_to_get_a_drink.json": "In the first episode of “Thermae Romae Novae”, young Lucius and his grandpa get\na drink to go from a street vendor.\n\nThis got me thinking, could you actually grab a drink to go considering that\ndisposable cups were obviously not available for cheap?\n\nIt’s probably a silly question, but it’s…",
  "data/reddit-ask/r/AskWomen/comments/ty3syc/women_who_are_daydreamers_what_situations_do_you.json": "For example being a super famous pop singer, celeb, detective, supercop etc",
  "data/reddit-ask/r/AskHistorians/comments/txx0g9/theres_a_scene_in_boardwalk_empire_where_two.json": "like did the anti-Italian sentiment that existed at the time extend to food?",
  "data/reddit-ask/r/AskHistorians/comments/txp4r1/in_675ad_japanese_emperor_temmu_banned_the.json": "I understand that not all animals were forbidden by this ban, and that people\nwere free to continue eating fish as well. And that similar mandates were made\nby other emperors afterwards. Were these strictly followed, or did the rich or\nthose far from centers of power get to ignore them?",
  "data/reddit-ask/r/AskHistorians/comments/ty8dhr/the_mongols_exterminated_60_million_people_during.json": "Did the Mongols have, for lack of a better term, a specialised 'genocide' or\n'extermination' department? Where did they acquire enough manpower to carry out\nthese genocides?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ty8z12/is_it_okay_if_i_tell_my_gay_friend_previously.json": "25 M here.\n\nI’m not sure if it is meant to be flirtatious but a part of me assumes not,\nsince he knows I’m in a long term relationship with my girl.\n\nI’m in no way homophobic but I just feel weirdly uncomfortable getting my hands\ntouched by a guy in that way. I gently pull it away without making…",
  "data/reddit-ask/r/AskHistorians/comments/txxjnt/what_were_the_extent_of_tsar_nicolas_iis.json": "I have read that pre-1917 Tsarist Russia and Eastern Europe were often horrific\nplaces filled with genocidal policies and mass murder, anti-democratic\nrepression and censorship, secret police, and famine. I have read and been told\nby certain Russians that Tsar Nicolas II upheld jewish segregation…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/tydfd5/if_1_in_6_women_have_been_raped_and_80_of_rapes.json": "Or are there just a few super rapey dudes out there that never get caught? But\neven if it's just one dude doing a bunch of rapes, we would all have to know him\nfor the statistics to add up, right? And chances are, he's around even if he\nhasn't done it yet?\n\nThis question is fucking me up this…",
  "data/reddit-ask/r/NoStupidQuestions/comments/tyc9rk/why_do_people_believe_that_its_hard_to_get_out_of.json": "I'm asking just incase I misunderstood the meaning behind \"getting out of the\nhood\". Does it mean I have to become a wealthy millionaire or something? Cause I\nain't no millionaire.\n\nI grew up in Compton. I'm also black. I grew up with people of all different\nraces, TV shows, movies, and social…",
  "data/reddit-ask/r/NoStupidQuestions/comments/tyexid/why_do_us_students_take_out_large_student_loans.json": "I've seen complaints about student loans ever since I started using Reddit. US\nprivate universities are ridiculously expensive, but they aren't the only\nuniversities on earth; I'm pretty sure there are much cheaper options in the US.\nIt sounds entitled to do something stupid, like taking on life…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/tyiuv6/why_is_amber_heard_still_working_but_johnny_depp.json": "We know the scandal. However, I can't wrap my head around the fact that Johnny\nDepp's career took a nosedive even after he was proven innocent, for the most\npart. As I understand they were in a very toxic relationship.\n\nYet Amber Heard is still working and profiting, despite all the evidence of…",
  "data/reddit-ask/r/NoStupidQuestions/comments/tylvi2/why_is_it_okay_were_conditioned_for_nonownership.json": "From monthly subscriptions to the gig economy to the shared economy to NFTs, it\nseems like we're being conditioned to not actually own anything tangible, and\nit's kinda scary to me. If you are someone who willingly accepts this, why? Your\nparents owned everything they bought, why not you?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/tyqpfo/is_it_just_me_or_is_woke_rasicm_against_whites.json": "I wanna speak out against blatant rasicm against whites at least on social media\nbut it can happen in real life too but the way certain blacks talk about whites\nboggles my mind. They've even got their own bigoted woke language. Things like\nsnowbunny, white tears, white fragility. I mean it's…",
  "data/reddit-ask/r/NoStupidQuestions/comments/tyhrlm/why_is_straight_men_liking_pretty_things_like.json": "Don't men feel attracted to women because they find them beautiful? So\ntechnically shouldn't it be seen as masculine to like stereotypically beautiful\nthings because women are the more stereotypically beautiful sex?\n\nWith the logic that mEN ARE ViSuaL CReaTurES shouldn't men be celebrated…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/tysx2y/why_is_the_oversexualizationfetishization_of.json": "Just what the title says. The fanservice in so much anime is just so\nunapologetically in your face. I understand that it's a largely male-dominated\nform of media, but you could say that about practically any form of media from\nmusic to art to video games to movies/tv. As far as I can tell, pretty…",
  "data/reddit-ask/r/askphilosophy/comments/tycvfs/is_eating_shit_morally_wrong.json": "What the title says: it is morally wrong to eat literal shit?\n\nI mean if you like it, you might eat it but then people will be disgusted.\n\nShould these certain people only eat it in private? Why shouldn’t they be able\nto eat what they like in public?",
  "data/reddit-ask/r/NoStupidQuestions/comments/typ9x3/why_do_people_hate_dry_weddings_so_much.json": "multiple members of my family have problems with alcohol, so i grew up going to\nweddings with no liquor. now that i am an adult, i hear nothing but complaints\nabout dry weddings. but why? why do people care that much?",
  "data/reddit-ask/r/NoStupidQuestions/comments/tyquac/how_do_i_bring_up_my_that_its_my_birthday_without.json": "It’s no fun saying its your birthday to people you’re not exactly close with\n(especially if you’re telling them on the day of). Now if I was having a party,\nI’d bring it up by inviting them, but that’s not the case. I don’t expect\nanything, just that minor acknowledgement from people I interact…",
  "data/reddit-ask/r/NoStupidQuestions/comments/tysbmt/how_many_2_inch_plastic_easter_eggs_would_you.json": "Don't ask why.",
  "data/reddit-ask/r/AskHistorians/comments/typ2l4/what_did_people_think_of_static_electricity.json": "There had to be people who built up a charge and shocked someone else from time\nto time - what did people think of this?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/tywz8j/i_hope_i_dont_get_banned_for_this_in_this.json": "Why isn't the misandry, men-hating, sub called FemaleDatingStrategy not banned?\nI thought reddit was against sexism and other bad stuff?",
  "data/reddit-ask/r/NoStupidQuestions/comments/tyzkda/why_dont_femcels_and_incels_date_one_another.json": "They're both lonely and think nobody wants them, and that everyone is out of\ntheir league. Wouldn't that make both groups be in one another's league? They\nhave similar ideologies, so why do they hate one another instead of dating?",
  "data/reddit-ask/r/NoStupidQuestions/comments/tyv1qz/why_does_view_all_comments_never_show_all_comments.json": "When looking at responses to my comments I sometimes want to view the rest of\nthe thread to see how it's progressed. Anytime I click \"View All Comments\" it\ndoes absolutely nothing. Any ideas?",
  "data/reddit-ask/r/askscience/comments/tys1dn/are_there_any_examples_of_species_that_have_gone.json": "If humans went extinct, could we come back in a billion years in our exact\ncurrent form?",
  "data/reddit-ask/r/NoStupidQuestions/comments/tytfog/why_do_people_leave_the_tap_on_while_brushing.json": "Like, I just don't get it. Do you turn the faucet on to rinse the toothbrush\nbefore brushing, and then just leave it on from then on? Or is it a conscious\nthing to turn it on once you commence brushing? Just... why??\n\nEdit: Many people are saying something along the lines of \"water is…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/tz45y1/why_is_the_term_female_now_offensive.json": "Idk if I missed something but two different people tried to cancel me after I\nused it. I'm super confused as when I tried to ask why it was offensive I\nreceived nothing constructive back.\n\nEdit: In case anyone is wondering got a really good answer. Incels frequently\nuse female as an insult. Because…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/tz1nr7/when_and_why_was_it_decided_that_formal_wear_must.json": "Why, for formal events and meetings and such, do men wear stiff, uncomfortable,\nimpractical suits and ties? Why do women wear dresses with no pockets that are\nso tight around the legs they can barely walk, along with high heels?\n\nWhy does formal attire have to be expensive, impractical, and…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/tz2ezj/are_there_any_adults_who_actually_like_the_real.json": "I'm only 21, I had my first \"real\" job (not as a student) and I absolutely hated\nit. How can people actually enjoy this life? Where you just wake up, go to work,\nwork for 8+hours, go back home, clean, make dinner, eat, have only 2-3h of free\ntime, shower, go to sleep, just to do it all over again…",
  "data/reddit-ask/r/askscience/comments/tz564t/is_there_an_electronic_component_that_can_change.json": "Basically satisfying the following equation: R(q) = C * sum(q) where R is the\nresistance, C is an arbitrary constant and q is the charge that traveled trough\nthe device with a negative and a positive direction.",
  "data/reddit-ask/r/AskHistorians/comments/tz5yix/did_the_nazis_originally_plan_for_hitler_to_be.json": "Hitler's actual successor, Karl Doenitz, was pointedly not given the status of\nfuhrer, but only president of the Reich. But suppose things had gone to plan for\nthe Nazis. If the Reich was meant to last a thousand years, and the Reich needed\na Fuhrer, was the plan for future rulers to have equal…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/tz5vxc/what_is_the_best_reaction_to_someone_calling_you.json": "Or homophobic slur, etc.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/tz7cc8/why_dont_modern_women_want_to_be_housewives.json": "I'm a 20 year male and speaking from my point of view I think it's awesome that\nif i had the opinion I would want to be a stay at home parent. I don't have to\ndeal with stressful managers or a toxic workplace, cleaning a regular sized home\nis very easy and efficient with all the technology we have…",
  "data/reddit-ask/r/askphilosophy/comments/tyvix4/is_it_normal_to_leave_philosophy_more_confused.json": "I have studied many philosophy topics in epistemology, philosophy of mind, and\nphilosophy of math. I started my investigations to find the correct answers. Now\nI have completed my studies and left more confused about the correct answers\nthan when I started. Admittedly, I have learned a lot about…",
  "data/reddit-ask/r/askscience/comments/tz42zp/are_amputees_affected_in_the_hematopoietic.json": "If an individual has 1 or more long bones amputated, is the body put under\nstress directly in effect of loosing a percentage of the site of blood cell\nproduction?\n\nWould they be deficient in blood cells, or would the rate of hematopoiesis\nincrease in the remaining bone marrow in order to…",
  "data/reddit-ask/r/NoStupidQuestions/comments/tz2zqu/im_not_american_and_english_is_not_my_first.json": "When talking about wealth and rich people, a lot of times someone will say \"oh,\nthey have a 'forowan key' so they have a good life\". Is it a policy? Some kind\nof job achievement position? I've tried google but i can't seem to find an\nanswer\n\nEdit: its actually called \"401(k)\" and its a pension…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/tz5h6h/as_a_black_guy_is_it_bad_that_i_sorta_dont_care.json": "Here’s my pov on this: its just a word, as long as you’re not using it to\ndirectly be racist to someone it doesn’t really matter. Last I checked we have\nfree speech. Other people may be offended by it but I’m not",
  "data/reddit-ask/r/NoStupidQuestions/comments/tz50ig/with_jobless_claims_now_at_the_lowest_since_1968.json": "Or maybe they returned to education and living with their parents during the\npandemic.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/tz2faz/whats_so_wrong_about_being_sheltered.json": "I know some people talk down to me because I lived in a middle class\nneighborhood in the suburbs. Apparently that means I know nothing about the real\nworld. Sometimes I think I'm just stupid.",
  "data/reddit-ask/r/NoStupidQuestions/comments/tzg5e5/whats_the_point_of_a_air_fryer_if_you_already.json": "One of my friends just bought a airfryer and he says that its the 'best thing\never' however he already has a oven, wich also uses hot air... than whats the\ndifference between those 2?",
  "data/reddit-ask/r/NoStupidQuestions/comments/tzjb8q/i_need_help_naming_my_wifi.json": "Just moved into my new apartment after couch surfing for a year and I need a\nfunny wifi name to troll my neighbors",
  "data/reddit-ask/r/NoStupidQuestions/comments/tzfucc/how_come_most_people_will_agree_astrology_is.json": "It’s pretty widely accepted that astrology is just a bunch of crap, but doesn’t\nit have as much weight as the bible, quaran, etc? Why is it so much more\nacceptable to not believe astrology but so many people are still religious",
  "data/reddit-ask/r/NoStupidQuestions/comments/tzjucl/why_do_kids_scream_absolute_bloody_murder_when.json": "I remember shouting when I was a kid, but the kids outside my apartment are full\non screaming...like repeated, loud, \"I'm being stabbed\" kind of screaming. I've\nchecked on them several times because I was concerned, but they're just throwing\ngrass and mud at each other like normal kids.",
  "data/reddit-ask/r/AskWomen/comments/tzcw21/what_is_your_reaction_if_you_found_out_your.json": "Would you have an abortion?",
  "data/reddit-ask/r/AskHistorians/comments/tzeojd/when_and_why_did_zoroastrianism_stop_accepting.json": "As a religion started by a charismatic founder, one would assume it was\noriginally vigorously proselytized and spread mainly through conversion.\nNowadays, there is a policy that not only are converts not accepted, but both\nparents have to Zoroastrian for their children to be raised as such. This…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/tznh5o/whats_the_point_of_underwear.json": "22 F here, I'm expecting a lot of \"ewwwww\" and other things in the comments but\nI typically don't wear underwear. Mind you, I only wear pants. I don't wear\nskirts or dresses or anything that would usually require having underwear on. I\ndon't wear them mainly because I have extremely sensitive skin…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/tzkeca/men_who_have_taken_penis_enlargement_pills_what.json": "(Serious replies only)",
  "data/reddit-ask/r/TooAfraidToAsk/comments/tzp90t/is_not_being_circumcised_in_the_us_really_a_big.json": "In the U.S. circumcision is supposedly the norm. My husband is circumcised, and\nI don't mind....that being said, I fought a lot with my husband about not\ncircumcising our son. My husband was adamant that we should and felt that\nbecause he has a penis he should get to decide.\n\nAfter a lot of…",
  "data/reddit-ask/r/askphilosophy/comments/tzhxzu/are_there_any_philosophy_subreddits_or_forums.json": "I enjoy philosophy but I am not an academic. My perspective of both the\nr/philosophy [/r/philosophy] and r/askphilosophy [/r/askphilosophy] subreddits\nis that it is mainly populated by individuals with either college degrees in\nphilosophy or academics who are actively publishing papers or faculty…",
  "data/reddit-ask/r/AskWomen/comments/tzsenk/what_are_your_big_sister_tips_for_life.json": "For those of us who don’t have one :)",
  "data/reddit-ask/r/AskHistorians/comments/tztfqc/how_extensive_was_the_purposeful_destruction_of.json": "> “The works of the roots of the vines, of the trees, must be destroyed to keep\n> up the price, and this is the saddest, bitterest thing of all. Carloads of\n> oranges dumped on the ground. The people came for miles to take the fruit, but\n> this could not be. How would they buy oranges at twenty…",
  "data/reddit-ask/r/AskHistorians/comments/tzstam/why_is_ancient_greece_not_considered_a_cradle_of.json": "After visiting this Wikipedia page\n[https://en.wikipedia.org/wiki/Cradle_of_civilization#China] about the cradle of\ncivilization, Ancient Greece is not included with Ancient China, India, Egypt,\nand Mesopotamia on indepedent cradles of civilization developed when they are\nconsidered as the…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/tzr9zx/gym_goers_do_you_ever_judge_someone_who_is_new_to.json": "I am genuinely curious as this is something which does put people off from going\nto the gym.",
  "data/reddit-ask/r/askscience/comments/tztmku/whats_the_difference_between_vitamin_a_retinol.json": "I've been looking into skin care products and became interested in retinol for\nits supposed benefits. Something that's confusing for me though, is why couldn't\nI use pure vitamin A oil for the same purpose? It's generally only marketed as a\ndietary supplement, but it's often much cheaper and…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/tzrtny/what_do_sex_scenes_even_bring_to_movies_like_even.json": "I never understood what they try to achieve from this apart from luring in\npeople to see the actress naked or something for marketing point of view but is\nthere any other reason to have sex scenes?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/tzupdw/why_isnt_having_gender_dysphoria_considered_a.json": "Or maybe I'm misunderstanding something. if you feel that you can't go on with\nyour life unless you transition, isn't that s mental illness? I don't think we\nshould be mean to people with mental illness but simply saying they don't have\nit doesn't make all that much sense to me. Like if I had my…",
  "data/reddit-ask/r/NoStupidQuestions/comments/tzvmwz/how_do_i_save_a_voicemail_permanently_my_mother.json": "She passed away suddenly a couple of weeks ago, a few days after surgery. It was\none of the last times she told me she loved me and I never want to lose that. I\ntried doing a screen recording of the call but that didn't work. Any help would\nbe appreciated. Thank you.",
  "data/reddit-ask/r/NoStupidQuestions/comments/tzzt0a/are_there_any_reddit_communities_new_users.json": "I almost feel stupid for even asking because I've never had to ask this for any\nother social media platform.\n\nWho designed this ridiculously bad catch 22 system anyway.\n\nEdit: ironically I can post here, hurray, so I guess I'll rephrase a little,\nwhat communities do you know of, that let, evil new…",
  "data/reddit-ask/r/NoStupidQuestions/comments/tzrc5p/do_drunk_people_in_the_usa_tend_to_punch_a_wall.json": "I mean if you punche a wall in Germany you really learn the lesson to not do\nthat again because it's like sacrificing your hands to the brickwall gods.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/u00cgt/is_my_mom_playing_dumb_or_is_she_being_serious.json": "Lmao this has been on my mind for weeks and I actually find it pretty funny but.\n\nMy mom was helping me decorate my room a while back and found where I keep my\nsex toys under my bed. They’re in a makeup case type thing with a mini padlock\non the zip. Trying to keep it as inconspicuous as…",
  "data/reddit-ask/r/AskHistorians/comments/tzsa8b/how_were_tall_women_viewed_in_ancient_greece.json": "Is there any mention of women taller than average in ancient Greek history? I am\nasking because I wonder if this would be a hinder or a gain in term of marriage\nand cultural life of tall women.\n\nWould it have been the opposite way, where the husband would be mocked for\nhaving a taller wife?\n\nAre…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/u01i04/what_is_an_undeniable_truthfact_nobody_wants_to.json": "In other words, what is a total lie that everybody prefers to live with because\nit is easier to do?\n\nEDIT: 1. \"Death\" seems to be the most adequate example that fits with this\nquestion.\n\n 1. i am surprised how often people really take their own opinion as an absolute\n    truth. But i guess i should…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/u03a31/not_to_be_a_d_but_if_the_us_government_decides_to.json": "Grew up lower middle class in a Midwest rust belt town. Stayed close to my\nhometown. Went to a regional college, got my MBA. Worked hard (not in a preachy\nsense, it's just true, I work very hard.) I paid off roughly $70k in student\nloans pretty much dead on schedule. I have long considered myself a…",
  "data/reddit-ask/r/askscience/comments/tzx87t/why_do_canaries_show_symptoms_of_poisonous_gas.json": "In elementary school, I was told by the teacher that canaries have smaller lungs\nthan humans, making them more susceptible to poisonous gas but that answer never\nsat well with me because smaller lungs should take in less total poison dose.\nAlso birds are smaller than humans so the poison…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/u00oft/do_americans_actually_pledge_to_the_american_flag.json": "And if it is one big inside joke, did you get inspo from the hunger games?",
  "data/reddit-ask/r/NoStupidQuestions/comments/u07q6t/how_to_convince_my_son_to_not_pay_for_college.json": "I have a benefit through work that will give my son a free ride to 1 of 50\ncolleges and he can choose from 25 degrees. It will cover 100% of costs Food\nfrom cafeteria, books, tuition, housing, and provide a weekly $250 allowance. It\nwill cover for Certifications, associates, bachelors, and masters…",
  "data/reddit-ask/r/NoStupidQuestions/comments/u06feu/why_do_people_bother_to_get_married_if_all_they.json": "It’s a giant stereotype that has lived on forever. That once you’re married life\nsucks, you’re not happy and you’re miserable. If this stereotype has been around\nso long why do people even BOTHER marrying? Just be happy being single or in a\nnon-marriage relationship.\n\nWhy do people put themselves…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/tzqrc2/is_it_possible_to_make_a_relationship_between_an.json": "I recently went out with someone I’m really interested in, we have a lot in\ncommon and they seem very genuine, funny, and intelligent. The only “issue” is\nthat I’m sexual, and they’re ace and sexually repulsed.\n\nI don’t really have a huge issue with this right now, as I can’t really be\nphysical…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/u02kmg/am_i_gross.json": "(F17) first time oral with my bf (M17) and said he didn't like giving it and\napologized. Even though he tried a few times he said he didn't really enjoy it.\nHe said it was a bit sour. Is there sth wrong with \"down there\"?\n\nEdit: thanks for all the comments i feel much better about myself <3",
  "data/reddit-ask/r/TooAfraidToAsk/comments/u0727b/do_men_prefer_doggy_so_they_can_imagine_someone.json": "Saw on tiktok that some men prefer doggy style so it’s easier to think of\nsomeone else, or to get off quicker. Someone in the comments mentioned they’ve\nbeen told they “have a face for back shots” and I’ve been wondering about it\nsince.\n\nEDIT: Thanks for all the responses, I’m relieved to know that…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/u0efun/how_is_the_outlawing_of_stuff_like_holocaust.json": "Don't get me wrong, I'm not a Holocaust denier, but shouldn't everyone be\nallowed to articulate their opinions and ideas without fear of retaliation,\ncensorship, or legal sanction? Regardless of how stupid those ideas and opinions\nare.\n\nI should be able to say the earth is flat, or that giraffes…",
  "data/reddit-ask/r/NoStupidQuestions/comments/u07kju/what_kinda_new_scam_is_this.json": "Over the past couple of days i have been getting group text messages from\nunknown numbers. They keep saying the same thing “Your bill is paid for March.\nThanks, here’s a little gift for you.[some random ass website]”. I keep blocking\nthe number but it is not stopping. The numbers that texted me…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/u0gzl3/why_do_so_many_people_want_to_live_in_la_despite.json": "I (from Europe) just visited LA for the first time and why there is many cool\nthings about it, I felt no regret to leave. In my opinion, there are so many\ncons to LA that would outweigh all the benefits. Starting from the air quality,\nbut also the lack of public transport, the traffic, the lack of…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/u0fxj4/why_do_those_who_falsely_claim_someone_raped_them.json": "edit- I want to be clear, Im not referring to cases where the victim is unable\nto prove that the rapist committed the heinous act, Im asking about cases when\nthe claimant has been proven to have lied about having this disgusting act done\nto them.",
  "data/reddit-ask/r/NoStupidQuestions/comments/u0l7sx/is_there_any_benefit_to_showering_with_hot_water.json": "I was in the shower and thought of this. Is it actually cleaner to shower with\nhot water or is it just a comfort thing?",
  "data/reddit-ask/r/NoStupidQuestions/comments/u0gpb0/if_youre_prescribed_fentanyl_are_you_done_for.json": "My mom has been battling cancer for close to 4 years now. She's been prescribed\nthese batches with fentanyl in them for pain relief.\n\nGiven Fentanyl's reputation, is this a sign that the doctors don't think it's\nworth worrying about side effects and withdrawal?\n\nI know this isn't a funny or meta…",
  "data/reddit-ask/r/askscience/comments/u0k6ie/do_toxic_substances_all_share_a_similar_sort_of.json": "I know that for most of human history, we discovered toxic substances by having\nDave try them, and if he died then we all knew not to eat it. But, if we were to\nhave aliens bring us a cuisine or be on an alien world with vegetation, could we\ntest for certain molecular structures to know if the item…",
  "data/reddit-ask/r/NoStupidQuestions/comments/u0m97a/is_it_weird_to_go_into_a_cafe_buy_a_drink_then.json": "I want to start frequenting a cafe near me just to get outside more and have a\nplace where I can sit down and chill for a while. I know most people go to cafes\nto study or go on their computer or something but would it be weird if I just\nwent on my phone or read a book instead?",
  "data/reddit-ask/r/AskWomen/comments/u0naed/3_months_into_a_happy_relationship_you_find_out.json": "Everything is great thus far. 3 months in one day they mention they’re voting\nfor your parties opposition. What would you do?",
  "data/reddit-ask/r/NoStupidQuestions/comments/u0jm3k/how_do_i_have_a_quick_shower.json": "UPDATE BELOW\n\n(OP)I have OCD and I’m avoiding showering because it takes me so long with all\nthe repetitive actions etc. and also I have bad skin which flares up when I\nshower so it makes it worse.\n\nPlease help I need to shower and wash my hair I stink but I’m dreading getting\nin there, it’s…",
  "data/reddit-ask/r/AskHistorians/comments/u0pyr8/in_homer_and_arabian_nights_there_are_repeated.json": "I’m currently reading Arabian Nights and especially in some of the earlier\nstories (Lyons’ English translation), characters mix wine with water. Reminds me\nof similar things in Homer. Was that done to dilute the wine because it was\nstrongly flavored (or maybe it tasted bad)? To reduce alcohol…",
  "data/reddit-ask/r/AskWomen/comments/u0mpsy/dear_women_of_reddit_what_surprising_revelations.json": "And relationships could mean personal, professional, or romantic.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/u0wj17/why_is_there_little_to_no_repercussions_when_a.json": "A lady at work told me point blank that she’s old enough for me to fuck her. I\nreported her and nothing.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/u0vi0q/how_much_of_my_bush_should_i_be_shaving_reddit.json": "I'm dead serious, my mother never taught me anything about personal hygiene and\nI've had to learn on my own. I don't even know if I'm shaving properly- and I'm\n28 and incredibly embarrassed to ask my friends because they're all beauty pro's\nand pretty judge-y about this stuff.\nI usually just shave…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/u0tgvt/is_it_too_late_to_restart_my_life_in_my_30s.json": "Basically I made a lot of poor choices well into my 20s that have left me with\nzero local friends and no social life to speak of. While I've worked really hard\non improving myself I need to move soon and have no idea where I should go or\nhow I'll meet people since I work from home. I'm hitting a…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/u0v1kq/for_americans_seriously_asking_do_you_really.json": "Or MOST Americans think that? Like, I’m not asking if it really IS the best (no\ncountry is the best, that’s subjective) but do most Americans think that it is?\nLike, I know the idea of American exceptionalism is taught to kids at a young\nage, but as you grow up and learn about other countries with…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/u0sa2k/why_do_so_many_guys_defend_porn_use_with_their.json": "This idea just blows my mind that guys are so supportive of their need for porn\nyet are so against the idea of supporting women who make it. It seems beyond\nhypocritical to me.\n\nIf somebody else wants to spend money on ethical porn, why are you even mad?\n\nEdit: I sell content. This is purely based…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/u0tvhi/whats_the_safest_way_for_an_older_42_man_to.json": "I have always been conscious and aware of the woman around me. I typically\nnotice new hair styles, shoes, and other things that I know boosts their\nself-esteem when complimented. I’ve always loved being able to smile and offer a\nsimple compliment.\n\nHowever, as I am married with children, and…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/u0zyr4/if_felons_cant_vote_then_why_do_they_have_to_pay.json": "That’s taxation without representation. The United States was founded after we\nfought a war over that issue.",
  "data/reddit-ask/r/AskHistorians/comments/u0qf7v/is_there_an_asian_christopher_columbus.json": "I was talking with my 13-year old daughter about the European discovery of the\nAmericas and we began to wonder: is there an Asian equivalent? I.e. a person who\nsailed across the Pacific, found land, and returned to tell about it?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/u11loa/why_are_western_countries_so_obsessed_with_the.json": "Most other places if you have an idiotic opinion you’d just be labelled as an\nidiot and everyone just moves on with their lives. Why this idea that someone\nwho has absolutely no experience or real knowledge on a subject can be entitled\nto have an opinion of it?",
  "data/reddit-ask/r/NoStupidQuestions/comments/u1441g/why_are_some_people_so_bothered_by_cultural.json": "I’ve seen posts on the internet of white guys wearing dreads and getting\nattacked and doxxed on twitter, someone wearing a native american war bonnet and\ngetting harassed, etc. I’m Croatian, and I personally would be overjoyed if\nsomeone who isn’t Croatian wore a traditional dress/suit. To me it’s…",
  "data/reddit-ask/r/AskHistorians/comments/u0viwr/the_cavendish_family_duke_of_devonshire_in.json": "During the Irish revolutionary period in the early 20th century, many of the\ncountry houses of the Anglo-Irish were deliberately burned down or destroyed.\nNaturally, some of these homes survived. Today, Ireland is now a republic, which\nmeans these homes shifted from physically belonging to the…",
  "data/reddit-ask/r/NoStupidQuestions/comments/u14md8/is_it_a_problem_if_someone_cant_have_dinner.json": "We’re at a mall and they don’t seem to sell beer or wine anywhere. My mom is\nthrowing a huge tantrum about it and now went to a super cheap pizza place bc\nit’s the only food place that sells beer while I’m having dinner alone at a\nramen place.\n\nIs this addictive behavior? She would never eat cheap…",
  "data/reddit-ask/r/AskHistorians/comments/u16nky/are_there_known_events_where_a_court_jester.json": "Ive often read about how important court jesters were in the kingdom. Important\nbecause they could say or communicate things nobody else in the kingdom could or\nwould say in front of royalty, and also get away with it. For this reason they\nwould actually have quite a lot of influence.\n\nIs this just…",
  "data/reddit-ask/r/NoStupidQuestions/comments/u0yum7/is_it_just_me_or_does_72_degrees_with_ac_on_feel.json": "72 degrees is 72 degrees… but why does A/C acquire it a cold 72 degrees and heat\nmake it a more hot 72 degrees? Or am I just crazy? Cause that’s 100% a\npossibility.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/u18jm9/why_is_advice_for_men_improve_yourself_but_for.json": "I've noticed when men are having problems in life, all the advice is to improve\nthemselves, workout, they have to earn a better life, it won't be handed to\nthem.\n\nBut for women, the advice is about how the rest of the world should accept them\nfor the perfect person they already are.\n\nI just don't…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/u17xxr/are_there_support_groups_for_partners_of_rape.json": "Hi,\n\nMy girlfriend was raped in her previous relationship and I dont know what to do.\nI feel exhausted. I feel like I have to constantly put my needs to the side\nbecause you can't compromise with trauma. I know that none of this is her fault\nand thats what sucks, I feel like I can't talk about this…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/u19fwm/why_do_we_all_act_like_everythings_okay_food.json": "We have multiple world ending/changing events happening in the next 10-20 years\nand everyone just goes to Starbucks and watches Netflix as if we’re all going to\nbe okay through it all. We learned the past couple years that our leaders don’t\ngive a shit whether we live or die, they just want the…",
  "data/reddit-ask/r/NoStupidQuestions/comments/u139k1/how_would_you_spend_1200us.json": "No strings attached however saving, investing, bills, and maintenance costs are\nnot allowed. The money is fully liquid and completely disposable. How would you\nspend it?",
  "data/reddit-ask/r/NoStupidQuestions/comments/u19yy4/why_is_nudity_not_allowed_on_the_front_page_of.json": "Feels like America level censorship (I say this as an American). I’d rather see\na pair of tits or a massive dong than someone with their insides on their\noutsides or a dead dog who had no choice in war on the front page.",
  "data/reddit-ask/r/NoStupidQuestions/comments/u195w8/what_is_considered_cooltrendypopular_but_you_dont.json": "I’ll start: Cars and trucks with the exhausted modified to be louder.\n\nWhat about you?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/u1bh7a/why_do_we_often_hear_boys_say_all_tits_are.json": "Please don’t hate me just random shower time question",
  "data/reddit-ask/r/NoStupidQuestions/comments/u1av2x/does_it_look_bad_if_i_get_an_engagement_ring_for.json": "I love my gf and we've been together over 5 years and I'm going to pop the\nquestion, we've been discussing the future so honestly it's not like she's going\nto say no. But I've heard the jewellery industry scams people by trying to say\nthe ring should cost atleast 3 months salary of the guy? I find…",
  "data/reddit-ask/r/AskWomen/comments/u15veg/doctorsnurses_whats_the_most_ridiculous_thing_a.json": "Have you ever had a moment where you thought \"how has this person got to this\nage not knowing this?\"\n\nOr \"how is this person still alive?\"",
  "data/reddit-ask/r/AskWomen/comments/u1crl1/what_is_the_creepiest_confession_a_friend_made_to.json": "Edit: Mods — get a CW flair here plz",
  "data/reddit-ask/r/AskWomen/comments/u1f8ty/what_are_the_unspoken_experiences_and.json": "If \"fat girl\" sounds offensive (as it is often used an insult) just highlight\nthe issue in the comments.",
  "data/reddit-ask/r/NoStupidQuestions/comments/u1g5nc/does_every_lowes_hardware_store_have_a_small.json": "Every time I walk into a Lowe’s, BJs or other large warehouse-style store that\nhas high ceilings there seems to be birds flying around near the ceiling and\nchilling on the rafters. Like they came in from outside and are now in the\nstore. The stores can’t really do shit since they’re way the fuck up…",
  "data/reddit-ask/r/NoStupidQuestions/comments/u1jbzz/why_are_people_on_reddit_so_rudemean.json": "I'm constantly seeing responses to posts where people on Reddit are just\nunnecessarily cruel. I rarely post or ask questions because I know that people\nwill be inexplicably brutal in their responses. What's the go, Redditors? Is\nthis a hub for all the angry people of the interwebs?",
  "data/reddit-ask/r/NoStupidQuestions/comments/u1irtd/how_do_i_tell_my_parents_im_pregnant.json": "I'm 26-years-old, still live with parents and currently 16 weeks pregnant. I'm\nnot very big but I'm beginning to show. I stupidly got pregnant after having a\none-night stand without using protection.\n\nI'd rather not tell them because of how awkward it would be having to explain\nmyself but sooner or…",
  "data/reddit-ask/r/NoStupidQuestions/comments/u1mc1u/nsfw_why_is_it_that_we_can_shit_huge_girthy_logs.json": "Yes I'm referring to anal sex",
  "data/reddit-ask/r/AskHistorians/comments/u18kbn/monday_methods_black_death_scholarship_and_the.json": "In the coming years and decades, many histories of the Covid-19 pandemic will be\nwritten. And if Black Death scholarship is any indicator of how historical\npandemics are studied, those histories may suck. In this Monday Methods we’re\ngoing to look at the Black Death and how current scholarship…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/u1jbkn/whats_the_point_of_separation_of_church_and_state.json": "Everytime I listen to these arguments, one side is \"people deserve this right\"\nwhile the other side is \"the Bible says\"-\n\nAm I misunderstanding what the separation of church and state means or are we\njust ignoring that rule when trying to dictate how people who might not share\nthose religious…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/u1d48c/why_do_some_women_act_so_insulted_when_approached.json": "Even if he’s respectful and it’s an appropriate setting like a bar or nightclub,\nI’ve seen women be awfully dismissive to the point of mockery.\n\nWhy do they seem to think they’re above being approached by those men?\n\nIt’s not hard to say no politely.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/u1khn9/wouldnt_it_make_sense_to_move_the_upvotedownvote.json": "With right handed people being the majority, wouldn’t it make more sense and\nincrease voter turnout?\n\nEdit: I am also left handed, but I scroll through reddit with my right hand. I\njust thought most people did this.",
  "data/reddit-ask/r/AskWomen/comments/u1l7af/what_fashion_trend_from_the_past_did_you_refuse.json": "Ponchos? Low-rise jeans? Frosted tips?",
  "data/reddit-ask/r/AskHistorians/comments/u1ank9/in_the_classic_bugs_bunny_cartoon_little_red.json": "https://www.youtube.com/watch?v=0TwubBMMAQQ",
  "data/reddit-ask/r/TooAfraidToAsk/comments/u1q8gj/throwaway_for_obvious_reasons_why_am_i_a.json": "I am not an actual practicing necrophiliac nor will I ever try to be. I also\ndon’t JO to actual dead people either as it scares me. There may be another term\nfor this but I get off to people “dying” whether it be a scene in a movie or a\nporn where they pretend to kill someone. I don’t really like…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/u1ug4p/the_countries_where_military_service_is_mandatory.json": "Apologies if I sound rude, but I want as many details as possible, this is a\nquestion that has always bothered me",
  "data/reddit-ask/r/TooAfraidToAsk/comments/u1obe9/my_kid_correctly_told_his_teacher_that_his_dad.json": "My child and I are not in danger. My husband gets unreasonably loud when upset\nor frustrated and it's not fun. I try to protect my son, who is smart,\nsensitive, and very observant. My husband is actively trying to be more patient\nand less yelly. I'm not looking for judgment on my marriage.\n\nSo, my…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/u1q0d1/so_why_are_butts_and_breasts_attractive.json": "I do not know why I and other people see these mounds of fat and find them\nattractive. I’ve heard the argument that large butts and breasts signal\nfertility so we’ve evolved to be attracted to that to reproduce better… but then\nwhy are some people into smaller breasts? Why do some people like feet…",
  "data/reddit-ask/r/AskHistorians/comments/u1weyd/blackbeards_ship_was_famously_called_the_queen.json": "I'm really into pirates right now but I don't get the name of the ship",
  "data/reddit-ask/r/TooAfraidToAsk/comments/u1gwsh/how_do_yall_find_a_weed_dealer.json": "I’m in the “Bible Belt” (newish here) and I’ve tried my local vape shops, apps,\nleafed in. I’ve never had this much of an issue trying to buy weed lol. I’ve got\ndelta 8 but it’s meh. ***forgot to add weed is illegal here in my state!",
  "data/reddit-ask/r/TooAfraidToAsk/comments/u1ubj3/shouldnt_we_make_job_hiring_anonymous_when_it.json": "Edit\n\nAlso the name. I've read a lot of about black women struggling to get a job\nbecause of their name.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/u1gwsh/removed_by_reddit.json": "[ Removed by reddit on account of violating the content policy\n[/help/contentpolicy]. ]",
  "data/reddit-ask/r/NoStupidQuestions/comments/u1xl2m/why_do_some_african_americans_pronounce_askasked.json": "Not a native english speaker and also not living in America, but this always\ninterested me.\n\nEdit: ANSWERED, thanks!",
  "data/reddit-ask/r/NoStupidQuestions/comments/u1ya98/every_gun_should_be_treated_as_loaded_which_means.json": "Every time people discuss guns on reddit somebody will bring up this rule, and\nothers tell stories about guns that seemed unloaded, with magazine removed, but\nstill had a cartridge in the chamber, and somebody got killed or almost got\nkilled. Which means gun design doesn’t make it obvious whether a…",
  "data/reddit-ask/r/askscience/comments/u20p1c/is_it_true_that_babies_see_upside_down_for_a.json": "I Heard this claim multiple time ex.:\nhttps://www.reference.com/world-view/babies-see-upside-down-2c7003b02ae612ed\n\nI understand that the image is upside down on the Retina but I dont understand\nhow that coressponds to the percievied image.\n\nThe way I understand it the brain hast to somehow make…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/u212dz/is_it_okay_that_i_dont_really_have_any_friends.json": "We're getting married. I have 1 friend. She is a really good friend, but I am\nnot that good. I can only take her in small doses. I invited two other high\nschool friends, but I just invited them because we were good friends and I don't\nhave any other friends. We don't even really talk anymore. I…",
  "data/reddit-ask/r/NoStupidQuestions/comments/u2029x/i_am_very_happily_marriedbut_just_realizing_i_am.json": "TLDR the title, but I’ll give more context.\n\nI grew up in a conservative, fundamentalist Christian home. Went to small,\nprivate, and VERY conservative fundamentalist Christian schools from 4th grade\nall the way through grad school (my MA has nothing to do with religion but I did\nget it from a…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/u210cl/how_do_i_give_good_blowjobs.json": "Is there any technique to it? I know everyone says so long as you’re not using\nteeth your fine, but how do you keep your jaw open enough for that, and still be\nable to close your lips?\n\nMaybe I’m just nervous because I haven’t given many, but I really like giving\nthem, and I want to get better at…",
  "data/reddit-ask/r/NoStupidQuestions/comments/u20xb3/why_did_people_stop_making_their_own_website.json": "I remember back during the late 90s and the early 2000s of the internet, i used\nto run into plenty of website that was created by individuals, mostly fan pages\nfor a band or artist, but also alot of interesting stuff. How and when did this\ntrend died? I remember myspace was a thing and that is…",
  "data/reddit-ask/r/NoStupidQuestions/comments/u21k2g/why_does_all_porn_of_women_seem_to_be_teen_or.json": "It seems like in porn the titles and popular search terms are all about either\nMILFs (which could technically be any age but I think it’s usually women around\nlate 30s to 40s) or teens. Why is that? What about women between those\ncategories, so like 20s and 30s?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/u25gyi/why_do_americans_have_such_nice_white_teeth.json": "What are they doing that Europeans and others are not?! Or do they all have\nveneers?",
  "data/reddit-ask/r/AskHistorians/comments/u2agqz/i_could_imagine_the_first_generation_of_children.json": "So my impression is that today few people resent their parents for giving birth\nto them in the place they did. It seems to me that it's understood that everyone\ntries to life their best life.\n\nHowever, when I imagine the future and colonisation of space, e.g., Mars, Moon,\nasteroids, other solar…",
  "data/reddit-ask/r/AskWomen/comments/u2cy35/what_would_you_do_if_your_partner_asks_you_to.json": "Hypothetically in this scenario, they make enough to support both themselves and\nyou. Would you still want to work or stay home/be involved in hobbies?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/u2b5ac/why_is_fat_shaming_bad.json": "I’m not talking about harassing a fat person. But like why do we have to pretend\nit’s beautiful (aware beauty is objective but a minority of the world population\nfinds obesity beautiful) so it seems silly to pretend",
  "data/reddit-ask/r/TooAfraidToAsk/comments/u28tog/why_are_lgbt_lumped_together.json": "So, I don't feel that there's anything wrong with any of these and wanted to put\nthat out there right off the bat.\n\nThat being said, LGB is a completely different thing than T. It's apples to\noranges. Sexual orientation vs gender identity.\n\nSo why do they get lumped together like they do?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/u2dohp/why_dont_incels_just_pay_for_pussy.json": "Or just lower their standards",
  "data/reddit-ask/r/AskHistorians/comments/u1qoc7/what_made_fascism_fascism.json": "I'm curious because the answers i've been given seems too broad or not enough\nspecific for me to understand.\n\nI'm asking because I am increasingly witnessing people here on Reddit labeling\nsome current Republicans in the USA as \"fascists\".\n\nAnd it just seems wrong to me, but to be sure i'd like to…",
  "data/reddit-ask/r/NoStupidQuestions/comments/u29lj0/fun_pranks_to_do_after_getting_brain_surgery.json": "I'm getting brain surgery soon, it's pretty low risk and I'm not particularly\nworried, but some of my friends and family are making a bigger deal out of it\nthan they need to. Of course I'm grateful that they care about me but sometimes\nit gets annoying to deal with their constant nervousness.\n\nWhat…",
  "data/reddit-ask/r/AskWomen/comments/u27efe/for_women_in_long_term_relationships_what_keeps.json": "Edit: these replies make me believe in love and i love it so much",
  "data/reddit-ask/r/AskHistorians/comments/u2895n/my_boyfriend_says_that_in_the_18th_century_part.json": "He suggests sailors couldn’t afford all the alcohol they were given when out of\nthe Navy so stayed on ships for their daily rum ration. I think they just drunk\ngrog to get through the terrible conditions and because it didn’t spoil.\n\nWe’re watching master and commander and trying to work out why…",
  "data/reddit-ask/r/NoStupidQuestions/comments/u2fun9/do_shooting_victims_in_america_have_to_pay_their.json": "Just as the title says",
  "data/reddit-ask/r/askscience/comments/u2e9li/how_can_prion_diseases_be_genetic.json": "I have a question regarding genetic prion diseases, FFI as an example. Sorry if\nthis question doesn't make a lot of sense I have no formal scientific education,\njust interest. So if prions contain no genetic material such as DNA, how can a\nparent pass down a prion disease? My understanding is each…",
  "data/reddit-ask/r/askscience/comments/u2j597/are_dna_mutations_due_to_mistakes_during_cell.json": "In regards to genetic mutations which occur \"by chance\" or \"by mistake\" during\nmitosis and disregarding the effect of carcinogens or environmental factors:\n\nHow do we know that genetic mutations leading to cancerous cells are \"mistakes\"\nduring cell division?\n\nHow do we know that cells aren't…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/u2lx6n/why_suicide_is_illegal.json": "It is your body should able to do what you want with your body, still it is\npunishable offence in some countries.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/u2mk7k/are_americans_less_attached_with_their_families.json": "I see that most of the Americans in movies are living on their own when they\nattained the age of 18 or something. But in Asia we tend to live with our\nparents/larger family for life. This makes me sad that why Americans live alone?\nWhat is the reason? Is it the cultural reason? Or something else?…",
  "data/reddit-ask/r/askscience/comments/u2hi0y/why_are_so_many_oil_deposits_located_in_dry_areas.json": "I wondered this while looking at a map of oil deposits, regions like Central\nAlgeria or the American Southwest , are mostly desert or dry areas where life\ncannot thrive and thus barely any lifeforms are turned into petroleum by natural\nprocesses. Also other dry places like Alaska might not be…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/u2ndnn/to_the_theists_of_reddit_why_do_you_believe_in_god.json": "Both my parents are pretty religious which is why I thought they'd be able to\ngive me some insight into why it is people believe in God. But, instead, they\nshut me down, almost appalled that I'd even ask such a thing.\n\nPersonally, I'm not very religious but was brought up to believe in a…",
  "data/reddit-ask/r/NoStupidQuestions/comments/u2r0y1/is_russia_truly_doing_such_a_poor_job_in_the.json": "Propaganda is certainly in full swing on both sides but the narrative, from a\nwestern perspective, is that Russia has royally screwed the pooch during this\ninvasion. If we are to believe what is being spoken it seems like they are just\nthrowing meat and materials into the grinder in Ukraine and…",
  "data/reddit-ask/r/NoStupidQuestions/comments/u2ej3z/what_the_fck_happened_to_all_the_fireflies.json": "When I was a kid I remember there were fireflies all over the place at night. I\nfeel like I haven’t seen a single firefly in like ten years",
  "data/reddit-ask/r/TooAfraidToAsk/comments/u2ih3k/why_do_doctors_in_western_media_always_asks_if.json": "I live in an eastern country, and generally doctors here wouldn't ask about if\nyou're sexually active and I am genuinely wondering what purpose it helps in the\ndiagnosis process.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/u2tad9/why_do_women_have_nails_so_long_that_they_cant_do.json": "I get that they want to be pretty. But I’ve never met a man who likes it. Not\none. I’ve been asking. The other day I saw a coworker try to type and I was like\nwatching chickens eat. I just don’t get it. Will someone please shed some light.",
  "data/reddit-ask/r/askscience/comments/u2tdx2/does_the_brain_really_react_to_images_even_if.json": "I just thought of the movie \"Fight Club\" (sorry for talking about it though) and\nthe scene, where Tyler edits in pictures of genetalia or porn for just a frame\nin the cinema he works at.\n\nThe narrator then explains that the people in the audience see the pictures,\neven though they don't know /…",
  "data/reddit-ask/r/AskHistorians/comments/u2ec39/in_older_poetry_the_words_eye_and_die_are_often.json": "Anyone with even a passing interest in poetry (like me!) will have seen at least\na few examples. Three off the top of my head are \"Death, be not proud\"\n[https://www.poetryfoundation.org/poems/44107/holy-sonnets-death-be-not-proud]\nby John Donne (1633; rhymes eternally/die), \"The…",
  "data/reddit-ask/r/AskWomen/comments/u2oepr/what_would_you_do_if_the_person_youre_flirting.json": "I’m not an English native speaker so I’m sorry if the question is badly wrote",
  "data/reddit-ask/r/NoStupidQuestions/comments/u2wz09/is_there_an_uptick_in_porn_bots_following.json": "Id say last week, a obvious porn bot started following me and it seems like ive\nbeen getting one every 1-2 days. Is anyone else out there experiencing the same\nthing?\n\nEdit- Please also list when you remember this starting. I believe for me, I\nstarted getting spammed daily about a week ago.\n\nUpdate…",
  "data/reddit-ask/r/NoStupidQuestions/comments/u2r89u/how_do_people_get_up_and_work_everyday.json": "Seriously? I literally have no idea how others around me do it. I end up\nbecoming so severely depressed that I quit after 2 weeks, the longest I've ever\nhad a job is 3 months. Whenever I tell/ask others irl they just say \"nobody\nlikes working\" but that doesn't really explain it to me\n\nedit: I…",
  "data/reddit-ask/r/NoStupidQuestions/comments/u2sctd/if_the_swat_team_broke_down_my_front_door_and.json": "I’m just wondering, been juggling this for a bit",
  "data/reddit-ask/r/TooAfraidToAsk/comments/u366rv/how_to_feel_after_a_woman_aborts_your_child.json": "A few months ago I had a casual sexual encounter with a woman where the condom\nburst at the worst possible time.\n\nShe assured me that she was taking the pill and there’d be no issue.\n\nWe went on a date soon after that, but realised we had little in common and\nparted ways.\n\nA few weeks ago she calls…",
  "data/reddit-ask/r/AskHistorians/comments/u35eid/how_did_we_go_from_addressing_people_by_their.json": "How did the pattern of title + surname (Mr. Brown, Ms. Jackson, etc.) begin? And\nhow/why did it go away?\n\nEven as a child in the 90s I was taught to call adults by their first\nnames—excluding teachers and doctors only. I've never been expected to call a\nwork superior by anything but their first…",
  "data/reddit-ask/r/AskWomen/comments/u2trvi/when_do_you_drop_a_bombshell_on_a_potential.json": "What would you do if you had something you generally don’t talk about to others\nbut would be essential for your partner to know? It doesn’t define you, but it\nwill affect the relationship one way or another. Things like infertility,\nlifelong STD, life threatening disease, victim of SA, panic…",
  "data/reddit-ask/r/AskHistorians/comments/u343te/what_professions_can_i_pursue_with_a_history.json": "I’m a third year history student in university right now, and I’m looking for\nsome guidance. Aside from teaching, what jobs can I pursue with my history\ndegree?\n\nI’m kind of going through a bit of a crisis here and I have no idea what I’m\ngoing to do when I graduate. Can you give me some career…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/u3a7ub/are_you_supposed_to_clean_the_inside_of_your.json": "like when i was 6 my mom has always used soap to clean the inside of my vagina\nand admittedly it hurts, and my family does encourage us to do it but after a\nquick research it is said that youre not supposed to?\n\n\n\nedit: there's alot of responses that i didnt expect to get, but I just want to\nsay…",
  "data/reddit-ask/r/NoStupidQuestions/comments/u3alv3/if_you_have_a_solid_bar_of_metal_say_1_light_year.json": "i saw a yt vid explaining this a long time ago, but i dont remember and google\ndoesnt help",
  "data/reddit-ask/r/NoStupidQuestions/comments/u3eb3i/why_is_people_of_color_not_considered_ultra_racist.json": "When I was young, saying \"colored people\" in english countries was considered\nracist as fuck. I live in a french speaking place and we just say \"black people\"\n(une personne noire), always been this way and still today.\n\nBut now english-speaking countries have started saying \"people of color\" and…",
  "data/reddit-ask/r/AskHistorians/comments/u32hvc/given_the_yakuzas_strong_ties_to_japanese_history.json": "Wikipedia says that the Yakuza is about 30% Korean. The statistics I could find\nsay that Japan as a whole is ~0.5% Korean. So why are there so many in the\nYakuza?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/u3d17b/why_do_people_want_apologies_from_the_government.json": "I don't want to offend anyone, I am just really curious. In my point of view\n(not related to a slavery-past as far as I know) history is history. And it's\nimportant to acknowledge that there has been (and still is) slavery. But I don't\nsee how the now governments apologies can soften the pain from…",
  "data/reddit-ask/r/askphilosophy/comments/u2u3qi/why_do_philosophers_like_aristotle_value_virtue.json": "Wouldn’t not believing in anything after life give you reason to live by your\ndesires, if not for purely surviving but to enjoy life in the fullest?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/u3g3xb/how_do_i_stop_being_racially_biased_when_a.json": "I am a white 22F living in Washington, D.C. Nearly every day in my neighborhood\nI am aggressively catcalled by black men - I've been spit on, followed, and\ngroped, all solely by black men. I've realized it's now gotten to a point where\nmy subconscious reaction to a black man looking at me is fear…",
  "data/reddit-ask/r/AskHistorians/comments/u3fsni/seventh_day_adventists_jehovahs_witness_and.json": "Would this idea have been held among Millerites for example? Was there anyone\nholding this view before the 19th century? Would it have been controversial?",
  "data/reddit-ask/r/NoStupidQuestions/comments/u3hyd2/what_happens_when_two_people_with_hyphenated_last.json": "I get that they could just keep their last names individually or pick one of\ntheir last names, but given they already have an inclination to hyphenate, are\nthere people with 4 last names? If so, where does it end?\n\nExample: Hector Plazas-Rodriguez gets married to Wanda Smith-Wesley. Would they\nbe…",
  "data/reddit-ask/r/NoStupidQuestions/comments/u3feis/why_dont_adults_talk_about_how_surreal_aging_is.json": "I'm 23, 24 this year and thinking about how it's literally been six years since\nI finished school & I've done nothing really notable (no one to blame but\nmyself) But it just happened so quick, I don't even remember anything important\nthat's happened in this time and it's just sad.. I'm aging and…",
  "data/reddit-ask/r/NoStupidQuestions/comments/u3788r/im_applying_for_an_apartment_the_application_is.json": "I’ve applied for apartments before, and I’ve never had an application ask for\nthis before. It’s asking for the name of my bank and account number so I just\nwant to know if I’m being overly paranoid.",
  "data/reddit-ask/r/AskHistorians/comments/u3t93m/the_multiocular_o_appears_in_only_a_single_old.json": "In other words: is there any reason to believe that this glyph’s presence points\nto anything more significant than one 15th century Eastern European guy’s\nhandwriting quirks?",
  "data/reddit-ask/r/AskHistorians/comments/u3guy7/how_did_a_british_person_get_a_job_as_a_servant.json": "I was watching Bridgerton (I know, not a font of historical accuracy) and one\nthing that stood out to me was how many staff the London upper class employed.\nThey did the expected stuff like making and serving their food or cleaning the\nmanors, but more powerful people had them doing pretty much…",
  "data/reddit-ask/r/NoStupidQuestions/comments/u3rzbo/why_isnt_russia_absolutely_clobbering_ukraine.json": "Don’t get me wrong, I’m glad they are not! But isn’t their military massive\ncomparatively? Why aren’t they sending in hundreds of bombers and just leveling\neverything? All we see are these little Ukranian victories here and there, and\nit surprises me that Putin is just watching this happen.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/u3h22w/question_for_the_womenbut_all_can_engage.json": "I, (M37) was talking with my wife (F36) about our teenage days and sexual\nexperiences. She made a statement that I found interesting… she stated that she\nnever got any pleasure in her teenage years from fooling around with boys and it\nwas done to keep the guy interested in her. She went on to state…",
  "data/reddit-ask/r/NoStupidQuestions/comments/u3whjr/if_weed_isnt_addictive_then_why_do_so_many_people.json": "Even if it's not every person who smokes, you guys can't deny that a lot of\npeople who smoke weed have their whole personality revolve around weed and being\nhigh. I'm not talking about laziness or whatever. How did weed culture evolve\ninto what it is today if weed isn't addictive?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/u3wo9j/do_many_americans_use_paper_plates_just_because.json": "I constantly see posts on food subs with people posting food pics on paper\nplates. The consensus is that 'nobody has time for dishes'. Is this common or am\nI just seeing loads of kids posting on Reddit?",
  "data/reddit-ask/r/askphilosophy/comments/u3jq3u/if_the_right_thing_to_do_is_to_reduce_suffering.json": "Negative utilitarianism is the ethical view that the right action is the one\nthat reduces suffering most. The action that, not only reduces suffering, but\nactually eliminates it is: death. Furthermore, if the view isn¨'t limited to\none's self, but also encompasses all other life-forms, then the…",
  "data/reddit-ask/r/AskWomen/comments/u40j8g/what_movie_do_you_love_despite_being_so.json": "I’m currently rewatching High Fidelity and I can’t not love it, but I know how\nproblematic it is now.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/u41mqi/do_pet_birds_crap_everywhere_when_people_let_them.json": "Lots of people with pet birds let them fly around but I'm sure the birds arent\npotty trained so are people just ok with bird crap everywhere?",
  "data/reddit-ask/r/NoStupidQuestions/comments/u3y35l/what_does_this_novelty_mug_mean.json": "Please help, my dad sent it to me and I want him to think I figured it out\n\nhttps://ibb.co/5WqXSbh\n\nEdit: thank you everyone I think I made my dads day",
  "data/reddit-ask/r/askscience/comments/u45i29/askscience_ama_series_we_are_seven_leading.json": "Hey there! We are a group of scientists specializing in computational\nneuroscience and machine learning. Specifically, this panel includes:\n\n * Konrad Kording [https://en.wikipedia.org/wiki/Konrad_K%C3%B6rding]\n   (/u/Konradkordingupenn): Professor at the University of Pennsylvania,\n   co-director…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/u46ubf/how_do_you_wash_your_ass_with_an_unmovable_shower.json": "So for starters because I know it'll be asked yes I wash my ass when I'm at home\nbecause there I have a handheld shower head but I'm currently staying at a hotel\nfor a convention and the shower head they have here is only attached to the\nshower wall. I'm also a bigger guy so bending over isn't…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/u3zk3e/what_happens_to_my_custody_payments_if_my_ex_quit.json": "I'm not sure where to ask this but a judge court ordered my ex wife to pay me\nchild support starting May 1st with two months back pay.\n\nI found out she quit her job of over 8 years and I think it's so she doesn't\nhave to pay me. Will this delay my payments before they even start?\n\nI'm already…",
  "data/reddit-ask/r/NoStupidQuestions/comments/u422xq/is_it_a_bad_idea_to_honestly_tell_a_guy_that_im.json": "I’m 23F, weigh 78kg, height is 164cm. I’m mostly insecure about my belly fat and\narm fat",
  "data/reddit-ask/r/TooAfraidToAsk/comments/u43ras/how_did_people_handle_surgery_before_anesthesia.json": "I recall having to have others pull glass or a pin out, and having to sit still\nwas nearly impossible. This compared to like, a broken bone, diseased node,\nknife cut, etc is a pretty small pain. So like- how could anyone just handle\nthat? There's no way people could just grit their teeth and feel…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/u49lii/girl_matched_on_tinder_and_wants_to_be_bruised.json": "I'm a 28 M and she's a 28 F. She said she's a masochist and is hoping to be\n\"bruised\" but that might just be her kind of flirting/dirty talk. She said she\nwouldn't care if a belt was used. I told her I've done light spanking and light\nchoking, but never hit hard enough for bruises or used a…",
  "data/reddit-ask/r/NoStupidQuestions/comments/u46shd/having_a_girl_over_to_watch_a_movie_we_both.json": "Yeah, if you couldn't tell, it's my first time doing this.\n\nAnd yeah, it's pretty clear we're gonna be doing more than watching a movie.\nThings have already happened between us and I'm not misinterpreting things.\n\nSo, how do I make the move? I'm kinda nervous if you couldn't tell.",
  "data/reddit-ask/r/AskHistorians/comments/u47jxq/in_catholic_tradition_poncius_pilatus_met_jesus.json": "In the \"clock\" of death (I'm not sure if it's called this way in English).\nChrist was judged by Pilatus 5 a.m. Was the governor likely awake already? The\nsun was barely risen. And even if he was likely awake, are there any sources\nabout what hours should these administrative decisions happen?",
  "data/reddit-ask/r/AskHistorians/comments/u486k2/as_far_ask_i_know_smoking_was_introduced_to.json": "From the video \"5 most dangerous jobs in history\"\n[https://www.youtube.com/watch?v=adeILCOb08U=752] at 9:53 you can see a corpse\ncollector from the black death smoking a pipe. Was smoking other substances\ncommon place at this time? From a quick google search, smoking from pipes such\nas the one in…",
  "data/reddit-ask/r/askscience/comments/u46m8i/why_do_some_flowers_close_their_petals_at_night.json": "I was leaving for work this morning in the early hours as usual, and the flowers\nin the planters were all closed up as usual, but it has never occurred to me\nbefore to wonder why.\n\nI tried searching for an answer, but can only find explanations of the mechanism\n(nyctinasty). I can't find any…",
  "data/reddit-ask/r/NoStupidQuestions/comments/u4cn2d/why_isnt_the_confederate_flag_banned_in_the_us.json": "European here. As far as I know the confederate flag represents slavery and\nwhite supremacy. So why is it not banned? Is ot because of the „American\nfreedom“?",
  "data/reddit-ask/r/AskHistorians/comments/u443t3/could_the_average_person_in_the_middle_ages.json": "I am wondering if my perception of the life in the middle ages is skewed by all\nthe historical fiction and podcasts I consumed or if there really never was a\nchance to life a peaceful life for the average peasant or merchant.\n\nFor example I am currently listening to the podcast \"History of…",
  "data/reddit-ask/r/AskHistorians/comments/u49m3u/whats_the_deal_with_milk_doors.json": "I mean, I understand how they work, but why? Why couldn't the milkman just leave\nit on the porch? And why was very specifically milk delivery so important that\nhomes were built to accommodate that one delivery, and a whole occupation\ndedicated to delivering one specific item? Why didn't people get…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/u4cyeq/be_honest_have_you_ever_had_a_breakup_so_bad.json": "Or you wished the other person felt harm or some type of pain\n\nEdit: not you harming them, but wishing they suffered or feel how you felt.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/u4harg/is_my_daughters_name_weird.json": "I named my daughter “Indigo” and she goes by Indi by most people. I adore her\nname but often when older people ask what her name is they scoff at me 😂 either\nway I like it but I don’t think it’s that strange since Scarlett and violet are\nnormal names.\n\nJust curious what the general consensus is…",
  "data/reddit-ask/r/askscience/comments/u4lxua/do_lactose_intolerant_people_have_less_of_a_blood.json": "Lactose is a sugar, so that got me thinking: if we don’t have an enzyme to\ndigest it, do we have less sugar intake and, therefore, less of a blood sugar\nincrease?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/u4mb2n/did_my_girlfriends_butt_give_me_tonsillitis.json": "So I was eating my girlfriend’s bootyhole the other day. She had just gotten out\nof the shower and after a thorough examination, I had decided it was clean (as\nclean as buttholes get anyways) a few days later, I had a sore throat that got\nworse as the days went on. After a trip to the Urgent Care,…",
  "data/reddit-ask/r/NoStupidQuestions/comments/u4m9kr/before_einstein_who_did_people_consider_the.json": "When somebody wants to describe somebody as smart, it is common to call them\n\"Einstein\". Before Einstein, was there a similar person people were compared to?\n\nEdit: I'm not asking who were geniuses like Einstein. Rather, I'm asking if\nthere was one person who was so popular, they became part of our…",
  "data/reddit-ask/r/NoStupidQuestions/comments/u4nouy/how_come_we_cant_tax_billionaires_heavily_because.json": "Is there a different \"form\" of money required to buy Twitter as opposed to\npaying taxes?",
  "data/reddit-ask/r/NoStupidQuestions/comments/u4jxc5/tried_having_sex_for_the_first_time.json": "Okay so this might be crazy but I don’t know.\n\nSo me and my girlfriend (her being 18 and I am 17) tried having sex for the\nfirst time. It was the first time for both of us so we were a little lost.\n\nIt went normal to start and then I got nervous and was not hard which was very\nembarrassing even…",
  "data/reddit-ask/r/NoStupidQuestions/comments/u4qixj/is_it_sexist_that_im_scared_of_men.json": "i'm a teenage girl, and i'm pretty uneasy around strangers that are grown men\nwhen i'm alone. today someone told me that's 'wildly sexist'...is it? i have\nnothing against men, i just know they're bigger/stronger and will win in an\naltercation if they want to.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/u4ic8s/too_afraid_to_ask_because_im_afraid_of_the_answer.json": "My parents were obsessed with using homelessness as a discipline tool.\n\nMy 20 year-old half-sister had her house and car keys snatched out her hands and\nwas told to get the fuck out at 2 a.m., ultimately because she was caught in a\nlie about having sex.\n\nMy 21 year-old half-sister got similar…",
  "data/reddit-ask/r/AskHistorians/comments/u473y3/feudal_monarchs_in_fantasy_often_have_a_royal.json": "Was there an analog, for example, of the Kingsguard of Game of Thrones fame? Did\nthe huscarls of the kings of Scandinavia or Saxon England measure up?",
  "data/reddit-ask/r/askscience/comments/u4l6hu/if_you_plant_the_same_species_of_tree_in.json": "For example, if you plant a cherry tree in the southern hemisphere, will it\nstill flower in march-april? or in semptember-october (spring)?",
  "data/reddit-ask/r/askscience/comments/u4o5st/why_does_it_take_so_long_for_our_eyes_to_adjust.json": "Walking outside you blink a few times and then can see but if you turn off a\nlight, you can't see as well as if you were in the dark for awhile. Are we just\nevolved to see in bright situations?",
  "data/reddit-ask/r/AskHistorians/comments/u4w4vv/ive_heard_a_lot_about_refugees_duringafter_world.json": "The European refugee crisis is listed as the largest-ever in world history on\nWikipedia and by a bunch of other sources, and I've read about it before -\nmassive upheaval, population transfers of Germans and others, etc etc.\n\nBut what about Asia and the Pacific? I can find some few references to a…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/u4ws5z/are_women_more_predisposed_to_be_bisexual.json": "I’m 23M and almost every woman I meet is bisexual. I think it can be societal as\nguys saying they’re bisexual can just end up being profiles as not manly enough\nor gay. So maybe they are more afraid of this? Thoughts?",
  "data/reddit-ask/r/askscience/comments/u4xqut/help_me_answer_my_daughter_does_every_planet_have.json": "She read an article about Mars and saw that it has “marsquakes”. Which lead her\nto ask a question I did not have the answer too. Help!",
  "data/reddit-ask/r/TooAfraidToAsk/comments/u4z31m/im_a_physically_small_woman_how_should_i_defend.json": "Is my only option a gun? But I would rather not use a gun, as that may cause\nlegal problems (outside of the US). I'm not from the US so I would rather not\nuse the gun at all.\n\nWhat other options do I have if I ever get attacked by a bigger guy? I know for\nsure I cant fight them off physically - I…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/u4ufv3/am_i_actually_weird.json": "I’m 15[M] and I am basically the opposite of my family.\n\nI love anime and playing games for example genshin impact and csgo. My family\ndon’t make it a secret and they always call me weird and make fun of me for\nbeing like this whenever I am practicing coding they call me a weirdo. Am I\nactually…",
  "data/reddit-ask/r/AskHistorians/comments/u4mjr9/as_far_as_i_am_aware_the_bible_is_not_just_one.json": "To add on to this, I learned earlier today that the Ethiopian Bible has 84\nbooks, whereas the Bible we use in the West only has 66. Did they just have\naccess to documents that the early Church did not? Or were those books excluded\nfor a reason?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/u4zvfb/why_does_elon_musk_have_such_a_passionate_fan.json": "I've never noticed that before (yes I've been living under a rock) until now\nwith the whole Twitter thing. Every time I see a post about it there's people\nsaying how smart he is and how he's owned everyone with this smart move, or\nresponding to negative comments and defending him. Some (jokingly I…",
  "data/reddit-ask/r/askscience/comments/u4z4du/does_hair_actually_absorb_vitamins_proteins_from.json": "A lot of shampoos contain biotin, vitamin E, Q10, wheat protein, zinc,\npanthenol, coffein, different kinds of oils and all kinds of stuff. But does\nhair actually absorb this stuff? Will it make my hair better or it is just a\nmarketing trick? I'm not a expert but I think that hair is basically…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/u4yxoo/is_this_cringe.json": "My boss at work refers to himself as a “king”.\n\nHe has artwork of kings all over his office: Alexander the Great, Genghis Khan,\nMansa Musa etc.\n\nHe often quotes “The Art of War” and has a collection of Katana’s he keeps\nshowing me.\n\nHis dad owns the company and he’s always creepy around the women…",
  "data/reddit-ask/r/NoStupidQuestions/comments/u541dy/in_the_us_why_are_things_like_fire_departments_or.json": "I understand people will say things like “we can’t afford it” but that’s a\nquestion about proper budgeting. I just want to understand the disconnect\nbetween a fire department and healthcare.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/u51wuh/i_think_i_might_have_masturbated_too_much_and_now.json": "Edit: I MEANT RIGHT ARM NOT HAND",
  "data/reddit-ask/r/AskHistorians/comments/u4zqus/how_did_terms_first_second_and_third_world.json": "As most of you probably know, these terms were originally meant to represent the\nalignment during the Cold War.\n\nFirst world being NATO countries, second world being countries of the Warsaw\npact and third world were those who were unaligned with either side.\n\nHere's a map…",
  "data/reddit-ask/r/NoStupidQuestions/comments/u537bf/would_walking_a_lot_help_me_to_lose_weight.json": "I get told to run a lot but I'm just not fit enough to do that and it gives me\nso much dread. Can I just start walking for awhile? I really like walking",
  "data/reddit-ask/r/NoStupidQuestions/comments/u53jrz/does_anyone_else_completely_forget_moviebook.json": "I can remember and talk about it for like a day or two obviously, but any longer\nthan that, it's like I've never seen it. You can start a conversation with 'you\nknow that scene where...' etc. and even though I've seen the movie, I will not\nknow what scene you're talking about.\n\nBefore you wonder, I…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/u562sb/why_the_heck_is_assisted_suicide_not_legal.json": "I wanna know. Like if an adult is consenting and wants to do so, you know he/she\nis going to find a way. Wouldn't it be better to provide an option of a painless\nway than to let people do so by jumping of a bridge etc? Why keep people here\nlike it's a prison?\n\nSerious question. I wanna know because…",
  "data/reddit-ask/r/NoStupidQuestions/comments/u59m2t/why_do_people_like_my_parents_hate_critical_race.json": "But when I asked them what it is, or what exactly it teaches they don’t even\nknow? Why do so many people hate it? And not even know what it is. I was\ngoogling it a little, but can I get an answer to what it is?",
  "data/reddit-ask/r/NoStupidQuestions/comments/u5adwe/how_do_people_manage_to_shower_every_day.json": "It's such a gargantuan task. Taking off your clothes, scrubbing your whole body,\nfinding a NEW set of clothes which brings you a step closer to the\nmountain-moving task of doing laundry.\n\nAny day I do shower it takes all my energy and I can't do anything else that\nday. I get the feeling most people…",
  "data/reddit-ask/r/AskHistorians/comments/u54g8e/when_historians_say_19th_century_irish_peasants.json": "I guess it's quite different for me whether you're eating just potatoes in milk\nor potatoes and kale in milk.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/u581g4/why_do_gay_men_often_have_a_noticeably_different.json": "I’m just wondering why gay men have developed such a distinct tone of voice but\nlesbians have not? What purpose does this serve from an evolution stand point if\nany? Thanks in advance!",
  "data/reddit-ask/r/NoStupidQuestions/comments/u50ni6/why_do_people_always_say_how_much_their_baby.json": "Why do people share that information when they announce their baby? I never know\nwhat I'm supposed to do with that information.",
  "data/reddit-ask/r/AskHistorians/comments/u5etoh/as_someone_who_is_nonreligious_i_find_it_unlikely.json": "Sorry for the long title. Also, I’m not trying to talk down on anyone’s\nreligious beliefs. If you believe that Jesus really was resurrected, I won’t\nargue with you.\n\nThat being said, I want to explore an alternate view. My understanding is that\nthe consensus among historians is that Jesus was a…",
  "data/reddit-ask/r/NoStupidQuestions/comments/u5cct8/if_im_god_and_im_all_powerful_how_does_making_a.json": "I’m trying to understand the moral significance of Easter. The deepest I get is\nstuff saying that in the old days, sacrifices were ways to absolve sin. So\nessentially Jesus sacrificed his own life in order to save everyone from sin, or\nsomething like that?\n\n(Sorry if I have it really wrong)\n\nBut…",
  "data/reddit-ask/r/AskHistorians/comments/u5bweq/when_archeologists_open_something_thats_been.json": "If you look on Twitter, you can find tons of joking and not-so-joking\ndiscussions about how we should leave the metal sarcophagus discovered under\nNotre Dame alone since opening a coffin and releasing an ancient curse is a\nstereotypical horror movie plot.\n\nI also remember an episode of House with a…",
  "data/reddit-ask/r/askscience/comments/u5cd8m/what_happens_when_a_long_covid_patient_catches.json": "Does the person get a more severe case of covid or does it just extend the long\ncovid period further?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/u5g9ne/can_a_child_under_10_really_be_gay.json": "Many tv shows are depecting very young kids as gay.",
  "data/reddit-ask/r/askscience/comments/u5nd7n/do_birds_sing_in_certain_keys_consisting_of.json": "For instance, do they use certain standards between frequencies like we have\nwhole steps, fifths, octaves, etc? Do they use different tunings? If so is there\na standard for certain species, with all the birds using the same? Are there\ndialects, with different regions of the same species using…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/u5ifyu/can_someone_explain_how_nonbinary_works.json": "I don’t mean to offend anybody, but I don’t really understand the concept of it\nand I want to learn.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/u5jc0k/do_you_think_its_possible_that_popular_reddit.json": "For example, due to the American system having a lot of faults, subreddits like\nr/antiwork [/r/antiwork] have taken off recently. However, some posts on that\nsub seem to be really pushy with the whole communism thing. I'm not really\nagainst socialism, as my country has adopted some socialist…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/u5koeq/when_you_close_your_eyes_and_try_to_imagine.json": "There's a condition where you are unable to imagine things, remember memories\nlike you were there, and fantasize... I can do those things but all I really\n\"see\" is black. I can remember that there was a table in front of me or\nwhatever, but it's not like I could describe it in detail because...…",
  "data/reddit-ask/r/NoStupidQuestions/comments/u5p7m4/is_it_distracting_if_i_wear_a_low_cut_top_to_a.json": "So I'm a college student in Philly studying English. I have a regular crew of\nabout 5 that I've studied with basically all semester (since January). We are 2\ngirls and 4 guys Since it's been chilly I've usually worn hoodies and also we're\njust studying. We've been a kick ass study group and gotten…",
  "data/reddit-ask/r/AskHistorians/comments/u5q4eh/the_incan_empire_was_the_most_successful.json": "https://en.wikipedia.org/wiki/Economy_of_the_Inca_Empire\n\n\n\nThe Incan empire did not use coins or markets, it was centrally planned. \"Taxes\"\nwere paid via labor to the state. The state provided key services, \" People of\nthe Inca Empire [https://en.wikipedia.org/wiki/Inca_Empire] received…",
  "data/reddit-ask/r/AskHistorians/comments/u5qr75/the_japanese_ate_meat_with_gusto_until_675_ad.json": "Japan is an island nation, so how much fish was the average person eating during\nthe ban? Was fish affordable for peasants?\n\nThe ban was based on Buddhist doctrine. Was there a reason fish were categorized\nas different than land animals?\n\nDid the nobility not hunt in Japan or keep livestock like…",
  "data/reddit-ask/r/AskHistorians/comments/u5r04s/an_author_claims_there_was_a_300_year_old_stew_in.json": "So this is kind of a Theseus' ship (or rather Theseus' caldron) thing. A single\npot of soup or stew that was constantly being revitalized with new ingredients\nbut kept going to concentrate flavour. But I can't find any other sources who\nsupport the claim.\n\nIs anyone aware of such a perpetual stew ?…",
  "data/reddit-ask/r/NoStupidQuestions/comments/u5uc98/if_albert_einstein_were_alive_today_and_had.json": "I’m wondering how much of his genius was constrained by lack of technology and\nif having access to computers means he could have developed warp drive or a\nworkable time machine",
  "data/reddit-ask/r/NoStupidQuestions/comments/u5zonf/am_i_the_only_one_who_finds_this_super_creepy.json": "r/FauxBait [https://www.reddit.com/r/FauxBait/] is a literal subreddit full of\nporn of legal girls who look super young. Like some of these women actually\ncould pass as 12/13. I'm so confused on why this still or exists or why no one\ncalls it out. There's literally no way the people who jerk off to…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/u5ppr9/why_dont_men_compliment_each_other.json": "I often see highly upvoted comments/posts about men who were complimented once\n10 years ago and remembering it vividly because they never receive compliments\nand they wish it was more normal. But often this is aimed at women and wanting\nwomen to compliment men the way they compliment each other.…",
  "data/reddit-ask/r/NoStupidQuestions/comments/u60x0w/as_a_teenager_can_i_still_buildabear.json": "This is probably weird, but I can't find an answer on Google. I just turned 17\nand I wanna celebrate it by going to a city and I discovered there's a build a\nbear right where I'm going. I really wanna make a bear, will they let me? I\nhaven't been there since I was like 8 since the local one shut…",
  "data/reddit-ask/r/AskWomen/comments/u6451n/let_the_secrets_flow_whats_one_secret_about_your.json": "I’ll go first. In housekeeping we do not change out the big comforter on top.\nJust the sheets underneath 😬 enjoy your next stay!",
  "data/reddit-ask/r/TooAfraidToAsk/comments/u62huw/why_is_satan_seen_as_the_bad_guy_despite_god.json": "EDIT:\n\nI don't believe in God, as I'm not religious by any means and this isn't meant\nto be offensive, I am just genuinely curious, as to why people have this mindset\nthat God is and should be worshipped when all of these problems occur in the\nworld.\n\nPeople say he accepts everybody and he's even…",
  "data/reddit-ask/r/NoStupidQuestions/comments/u614v6/my_girlfriend_and_i_get_into_the_stupidest.json": "I say the rattle comes from the plates clicking together when it wiggles. She\nsays the rattle happens \"internally,\" so it would still make noise without\nactually bending.\n\nSomeone please settle this dumb argument so we can get back to fighting over\nwhether or not manatees can swim out to sea.",
  "data/reddit-ask/r/askscience/comments/u5u6v4/how_much_does_our_skull_change_how_we_actually.json": "According to Brightside\n[https://brightside.me/wonder-curiosities/why-do-we-hear-our-own-voice-differently-the-real-reason-will-surprise-you-146705/]:\n\n> But when we hear our voice when we're actually speaking, we hear it in two\n> different ways - externally and internally. First, you hear the…",
  "data/reddit-ask/r/askphilosophy/comments/u5lo9v/should_i_reconsider_my_reductionist_beliefs.json": "In high school, exposure to the idea that chemistry and physics produce complex\nphenomena in biology has basically produced in me a belief that everything can\nbe reduced to the level of chemistry and physics.\n\nAs I learn more about the brain through formal study, this view has\nconveniently,…",
  "data/reddit-ask/r/AskHistorians/comments/u68xuh/before_desegregation_did_people_believe_that.json": "Okay, it's a really weird question, I know. And I hope I'm in the right sub to\nask.\n\nBut the other day I was listening to the audiobook of \"Little House In The Big\nWoods\" by Laura Ingalls Wilder, and she recalled her father playing a tune on\nhis fiddle with some lyrics about a Black man that ended…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/u67o2x/do_you_ask_for_consent_every_step_of_the_way.json": "Like to kiss I’m assuming you ask first.\n\nTo French kiss do you ask first.\n\nIf you want to feel each other’s body up do you ask first\n\nIf you want to remove clothes do you ask first\n\nIf you want to like tease their nipples do you ask first\n\nSex you obviously ask first\n\nTo change positions do you…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/u68ve3/why_is_tanning_socially_acceptable_but_skin.json": "“Skin bleaching is dangerous!” but so are tanning beds..",
  "data/reddit-ask/r/NoStupidQuestions/comments/u697f7/if_you_had_to_fight_every_animal_to_the_death_in.json": "No weapons,you are fully clothed,it’s an enclosed area.\n\nMarine animals still require to be beaten\n\nYou are at your physical peak (25 give or take a few years)\n\nA fight must end in death",
  "data/reddit-ask/r/TooAfraidToAsk/comments/u6avto/i_stopped_having_dreams_is_that_normal.json": "It’s been more than a year since I had a dream. Not even nightmares nothing at\nall. I just go plank and wake up the next morning",
  "data/reddit-ask/r/TooAfraidToAsk/comments/u6crn1/what_are_you_called_when_youre_not_a_dom_or_a_sub.json": "What is the technical fuck name for that?",
  "data/reddit-ask/r/askscience/comments/u6eona/does_your_mouth_have_a_biome_of_flora_and_can_it.json": "I recently had a lower endoscopy done where I needed to consume a ton of Miralax\nand Gatorade, and ever since then my mouth has seemed off. I've had a bad taste\nin my mouth, and feel like I get bad breath quicker.\n\nIt's made me wonder if, just like the gut, does my mouth have a system that can\nbe…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/u6czp8/why_are_there_never_questions_about_how_should.json": "A lot of men on here are horrible and frustrated and agressive and constantly\nsay that women have it easier when it comes to friendships and sex and\nrelationships which is not true. A lot of women struggle but if I ask on advice\nof relationships for advice I will be downvoted ( had an older account…",
  "data/reddit-ask/r/NoStupidQuestions/comments/u6ebrt/why_are_there_antismoking_campaigns_but_no.json": "So this sounds hypocritical to ask as I do drink, but I have relatives who died\nfrom drinking. I don’t smoke at all (I never vaped but I did smoke a cigarette\nonce when I was a kid but I was coerced to by a “friend”, suffice it to say that\nI stopped being friends with her after that) because I know…",
  "data/reddit-ask/r/NoStupidQuestions/comments/u6h47s/is_it_okay_to_give_my_dad_a_fake_address_and_tell.json": "Parents are extreme conservatives, having daily arguments with a family member\nabout adding a new member to the family who happens to be trans, if they find\nout their kid is trans this is going to blow the heck up.\n\nMy plan is to rent a virtual mailbox which is a mailbox where they email you…",
  "data/reddit-ask/r/NoStupidQuestions/comments/u6lne4/my_cousin_said_a_guy_was_soft_because_he_was.json": "I’d like some opinions on this if that’s cool with y’all. So yesterday I went to\na family dinner yesterday with some of my extended family for my grandmother’s\nbirthday and I got to see a few of my cousins and while we’re catching up one of\nmy cousins who was now in college says that she stopped…",
  "data/reddit-ask/r/NoStupidQuestions/comments/u6lff9/where_do_i_find_true_info_about_the_ukraine.json": "I am a Russian, living near the Ukrainian border, who hangs out on Western\nsocial media. I am very worried about this situation, and I want to know the\ntruth about what's happening right now, but I can't find any. Russian media is\nfilled with rather blatant propaganda, and Western media is…",
  "data/reddit-ask/r/TrueAskReddit/comments/u6ds6t/why_do_parents_really_want_everybody_else_to.json": "I'm talking about the US if this isn't a universal thing. I've seen this with a\nlot of my friends who become parents. Once it happens, they become much more\nvocal about how everyone our age should become parents, and how it's the most\nrewarding thing and how there be another purpose in life besides…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/u68hz4/showers_with_your_kids.json": "So here’s a thing. Spent the afternoon in the garden with my 18 month old\ndaughter getting covered in mud, so we came inside and went straight into the\nshower. At what point is it weird to be naked with your kids? We’re not prudes\nand we want to make an environment in our house where we’re open and…",
  "data/reddit-ask/r/NoStupidQuestions/comments/u6po22/do_people_actually_check_their_toilet_paper_after.json": "I was just randomly discussing this with my family during the holiday visit.\nApparently it's very odd to not look at your toilet paper after taking a dump,\nit's just never occurred to me to do that. Honestly the idea of it grosses me\nout, why would I want to bring a ball of shit paper up close…",
  "data/reddit-ask/r/AskHistorians/comments/u6t634/historians_of_raskhistorians_which_podcast_in.json": "So I've gotten into history podcasts recently and gotten into Dan Carlin's\nHardcore History. While I personally really enjoyed a few episodes and find it\nvery entertaining, I've heard that they are not always accurate and that he\ncouches too much of his own bias into the storytelling. So I'm…",
  "data/reddit-ask/r/NoStupidQuestions/comments/u6uhrj/seriously_why_are_all_printers_just_straight_up.json": "I remember inkjet printers when I was young, they were trash. Constantly broke,\nnever lasted more than a year or two, always issues, never connected right,\ndriver issues... All of it. 10 years later? Trash. Same issues. 10 years later?\nStill trash. No matter the brand, no matter the model... I've…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/u6ugzs/why_are_people_slamming_illhan_omar_over.json": "I mean I don’t think she is wrong I respect other people’s beliefs and such but\ntbh if it was Muslims preaching they would’ve probably been arrested for\nterrorism.\n\nFlying sucks enough without anyone shoving their beliefs in my face. Embrace\nyour faith but respect other people’s space",
  "data/reddit-ask/r/TooAfraidToAsk/comments/u6qlyq/as_a_woman_why_do_i_still_have_horny_brain_after.json": "This is embarrassing, but last week I [22F] made friends with an extremely\nattractive [24M] guy, and today all of a sudden I can’t stop thinking about him\nand feeling extremely aroused. I masturbated in hopes that it would clear my\nthoughts and prevent me from impulsively saying anything to him,…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/u69kvx/why_is_having_a_partner_so_important_why_is.json": "Not a question for myself, but to understand this social convention of finding a\nsexual partner to be with the rest of your life, of finding \"the one\".\n\nIt might be the ultimate reason to bear life society has invented. It might be\nan attempt not to die alone. It might be the need of \"owning\"…",
  "data/reddit-ask/r/askscience/comments/u6v0su/why_does_the_perception_of_taste_seem_to_be.json": "Note: I am not asking about why orange juice tastes bad after eating something\nminty for example. These causes can be easily pinned down to what we already\nknow about taste buds.\n\nWhat I am curious about is: if you were to give me bread with mustard and mayo,\nmy reaction would be somewhere between…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/u6wfye/why_in_the_us_does_the_irs_need_me_to_tell_them.json": "Like it seems to me like they already know but they like to play a game where I\ngo through a bunch of tedious, hard to understand forms or pay some one else to\nhopefully do it right.\n\nI also don’t understand tax returns, like, Is it money that I paid too much? If\nso, why did I have to overpay?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/u71rot/why_westerners_show_so_much_support_to_ukraine.json": "What is happening in Europe right now is happening in Syria, Iraq, Afghanistan\nbut the support for Ukrainian that poured in has suprised me, do we not consider\nthem as people and btw it was United States and NATO that did the deed. I just\nwanna know from a westerners prospective that what do you…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/u706kk/is_it_okay_to_wear_hoodies_in_the_gym.json": "It’s been a few years since I last been to the gym and I’ve definitely put on a\nfew pounds it’s not much but it’s enough for me to feel a bit uncomfortable to\ngo in just a T-shirt, is it okay to just wear a hoodie over my shirt and shorts",
  "data/reddit-ask/r/NoStupidQuestions/comments/u6ylje/scammer_has_a_video_of_me_jacking_it_and_is.json": "So I was stupid and jerked it on cam and showed my face. Now the scammer wants\n400$ and is threatening to send it to all my 500 instagram followers. I’m\nfucking shaking. Help\n\nEdit. It’s a couple of hours later. I’ve called my closest family and explained\nthe situation. They are understanding. He…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/u73ifh/so_are_we_not_gonna_talk_about_the_racial.json": "EDIT: i am a Hispanic American and really not conservative, so if you're gonna\nuse this post as a platform to be racist, I'm gonna delete it. The problem I'm\npointing out comes from media and their racial discrimination. Please be kind no\nmatter what your opinion in the comments so it doesn't get…",
  "data/reddit-ask/r/NoStupidQuestions/comments/u74vx6/does_anyone_else_think_google_search_quality_has.json": "I feel like SEO (search engine optimization) has ruined Google. Unless you are\nlooking for something obvious, all the search results are websites that are\nbarely tangential to your search terms.",
  "data/reddit-ask/r/AskHistorians/comments/u74afm/how_did_christianity_move_from_a_belief_that.json": "From this recent thread:\nhttps://www.reddit.com/r/AskHistorians/comments/u68xuh/before_desegregation_did_people_believe_that/\n\n> In the early colonial period, Protestants in America and Europe wondered\n> whether race would even exist in Heaven. They mostly agreed that Heaven was a\n> kind of…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/u7a7xt/ill_be_nice_but_why_in_gods_holy_name_do_some.json": "I work in banking. A lady today didn’t know how to use an ATM and wanted to make\na transaction. The problem was that WE WERENT OPEN YET. She yelled at us and\ncomplained.\n\nEdit: if Im snarky in the comments, it’s because I’m not actually taking this\npost super seriously. I’m not actually angry or…",
  "data/reddit-ask/r/NoStupidQuestions/comments/u71d63/what_are_you_supposed_to_do_when_your_roommate.json": "Hi. So I'd like to avoid joke answers like make a move or shit like that because\nit's a pretty awkward situation right now. I've just gone out to get takeout for\ndinner for us.\n\nBut my roommate brought this girl over last night from Sydney. Slept with her\nand they're going to he staying here for a…",
  "data/reddit-ask/r/AskHistorians/comments/u7adzd/why_did_english_speakers_start_saying_conqustador.json": "This only happens with spanish as far as I'm aware. People don't say\n\"veroveraar\" to refer to the dutch conquerors of Indonesia, no one says\n\"Eroberung\" to refer to the Nazi conquest of France, and in general english\nspeakers don't use words from other languages to refer to the history of…",
  "data/reddit-ask/r/NoStupidQuestions/comments/u7hy68/why_do_most_people_advocate_for_canceling_student.json": "I feel like canceling the debt is short sited assuming it actually happens\neveryone who goes into college via the same method of acquiring large amounts of\nloans afterwards is just as fucked as previously, but no one seems to discuss\nthat fact.",
  "data/reddit-ask/r/AskHistorians/comments/u7gbfl/what_was_seen_as_old_people_music_to_young_adults.json": "I was talking to my girlfriend about which artists or genres we see as dated\nnowadays, for reference we are both in our early 20s. We then began to wonder\nwhat people 100 years ago saw as dated or old people music. Not exactly what was\npopular to old people of the 1920s, but what songs or genres…",
  "data/reddit-ask/r/AskHistorians/comments/u79yoa/what_sort_of_lives_did_vestal_virgins_live_after.json": "I have read that they were selected as young children and that they only served\na term of 30 years, I had always assumed it was a lifetime appointment before.\nWhat did they do after they were retired? Did they resume lives as ordinary\nfemale citizens? Did they get married? Did they continue to be…",
  "data/reddit-ask/r/NoStupidQuestions/comments/u7ki1z/how_do_people_actually_sleep_at_night.json": "I can never fall asleep. I swear if I sit in bed for 6 hours I won't fall\nasleep. I have to either run / lift or take sleeping medicine (prescribed by my\ndoctor). Do normal people just.. fall asleep?",
  "data/reddit-ask/r/NoStupidQuestions/comments/u76fmw/im_30_and_have_had_a_phone_since_11th_grade_what.json": "Walk to pay phone? Other options",
  "data/reddit-ask/r/AskHistorians/comments/u7l508/what_most_likely_happened_to_my_great_grandmother.json": "If anyone would be able to shed some light to what most likely occurred, that\nwould be amazing. My Czech grandfather remembers being sick in bed with the\nmeasles at 8yo in about 1941, possibly in Brno. His mother was dragged out of\nthe house and disappeared for 2 years. He has absolutely no idea…",
  "data/reddit-ask/r/askscience/comments/u7mcxr/wikipedia_states_the_human_nose_is_extremely.json": "It rained in Northern California last night for the first time in what feels\nlike the entire year, so everyone is talking about loving the smell of rain\nright now.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/u7eg68/why_did_we_stop_raising_minimum_wage_in_2008.json": "How come after the crashes in 2008 and all those people lost their jobs, why did\neveryone decide minimum wage should stay there?",
  "data/reddit-ask/r/AskWomen/comments/u7cc20/ladies_what_car_are_you_driving_and_is_it_good.json": "Is there something special about that particular car that makes you attached to\nit?",
  "data/reddit-ask/r/AskWomen/comments/u7ex0b/women_who_feel_like_they_dont_fit_into_any.json": "*do?",
  "data/reddit-ask/r/NoStupidQuestions/comments/u7iw9k/americans_and_the_c_word.json": "Why do Americans find \"cunt\" so offensive? As a born and raised British\nnational, THAT word is used in nearly every day language, both as a compliment\nand an insult depending on context- but when it comes to Americans, they take\nmajor offence to it and I cannot understand why? It is seen as *the*…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/u7qhbx/if_its_a_womans_choice_to_have_a_baby_or_abort.json": "Choosing to walk away is basically the men’s equivalent to choosing abortion.\n\nDisclaimer: I’m all for women’s right to choose but this just popped into my\nhead.?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/u7o6ii/am_i_causing_damage_by_farting_in_my_cats_face.json": "Clickbait title, I know, but for context: I like to sleep with multiple fans on\nat night and cuddle up under my blankets. I usually sleep on my back with my\nknees bent so they form a kind of tent under my legs which my cat likes to sleep\nin for warmth right.\n\nSo at night when I’m laying down trying…",
  "data/reddit-ask/r/AskWomen/comments/u7p28j/lonely_women_how_are_you_feeling.json": "Loneliness is usually portrayed as a \"male\" problem on Reddit. I thought it\nwould be interesting to hear about it from the other side and to give space to\nexpress those feelings.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/u7qq5o/can_someone_tell_me_what_my_husband_is_doing.json": "If my husband and I are arguing and I'm trying to use my phone to ignore him and\nhe takes it away from me physically because he pays the bills, what is that\ncalled?\n\nI told him I'm an adult and he can't do that to me but he says he pays the bills\nand I'm a SAHM so that means he can. I don't think…",
  "data/reddit-ask/r/NoStupidQuestions/comments/u7tgpg/my_gf_told_me_about_her_last_relationships_and.json": "By the way, I’ve knows her for a long time and I do love her. I’ve done\neverything possible to reassure me that she loves me too, but idk.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/u7rjj2/why_dont_big_companies_accept_that_having.json": "not exactly too afraid to ask but genuinely dont know the answer. every place i\nwork at its the same: refuse to hire more people and/or cut hours, no one feels\nlistened to or appreciated and people end up leaving. i know theres probably\nalways gonna be a rotating door of job seekers but i think a…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/u7tl1w/should_men_hide_their_emotions_if_they_dont_want.json": "Ive never been in a relationship before but my brother says he has heard loads\nabout women dumping guys because of showing emotions to them. He said that\nsubconsciously women will not be attracted to men who cry or “aren’t strong” He\nsaid you should only ever expose those feelings to them if you’ve…",
  "data/reddit-ask/r/NoStupidQuestions/comments/u7vaas/do_american_school_children_really_get_made_to.json": "So, i knew the pledge of allegiance was a thing in the USA, but when i heard\nabout it i figured \"Oh, OK, it's the kind of thing they make you swear at those\nweird ceremonies at the beginning of the year.\"\n\nBut now i'm being told that that's a daily thing? Like seriously? And if it's\nindeed real and…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/u7s0le/how_can_i_stop_wetting_the_bed_at_night.json": "I (F19) have occasionally wet the bed my whole life. It has come to the point\nwhere I cannot drink any liquid after 7pm or I will 100% have an accident. I do\nnot drink much during the day at all and feel that I cannot even fully hydrate\nmyself in fear of peeing myself. When I do wet myself at…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/u7w9hj/why_is_everyone_on_reddit_convinced_that_amber.json": "I'm not taking any sides but in the news articles I read (I live in Europe) they\nmade Depp look very guilty and I was wondering what the media here is leaving\nout.",
  "data/reddit-ask/r/askscience/comments/u7neb5/are_compounds_that_contain_radioactive_elements.json": "Asked another way: is radioactivity affected by the fact that the radionuclide\nis bound with other atoms in a compound?",
  "data/reddit-ask/r/askscience/comments/u7x6ke/ask_anything_wednesday_economics_political.json": "Welcome to our weekly feature, Ask Anything Wednesday - this week we are\nfocusing on Economics, Political Science, Linguistics, Anthropology\n\nDo you have a question within these topics you weren't sure was worth\nsubmitting? Is something a bit too speculative for a typical /r/AskScience post?\nNo…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/u7u6yu/do_some_people_pretend_to_be_lgbtq_for_attention.json": "My friend the other day wore a shirt with 2 LGBTQ+ flags that she had designed\nherself with a title reading: \"the only choice I ever made\". She's been an\nattention seeker the whole time I've known her and she has had it difficult,\nabsolutely, but I don't understand how one's sexuality is a choice?…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/u7xwl3/are_there_others_who_feel_like_theyve_found_they.json": "It might just be the area I live in and my family in general but I used to think\nI am a lot more liberal or left leaning than others but after joining reddit\nI've started to think I'm more conservative than I thought in alot of aspects",
  "data/reddit-ask/r/NoStupidQuestions/comments/u82xd5/how_is_the_johnny_depp_trial_televised_but_the.json": "One is two people having personal problems and a beef with one another.\n\nThe other is a worldwide sex trafficker who sold children to rich and famous\npeople.\n\nExplain this to me? Am I missing something?",
  "data/reddit-ask/r/askscience/comments/u82nxe/how_do_unhatched_chicks_breath_through_the_shell.json": "They need oxygen but they can't get it from the mother like a mammal..",
  "data/reddit-ask/r/NoStupidQuestions/comments/u821u3/i_legitimately_dont_understand_dad_strength_how.json": "I don’t get it. How are dads so strong?\n\nI’m 26, basically in my physical prime. I hit the gym 4ish days a week, do\nplenty of strength training, and jog regularly. I wouldn’t say I’m the next\nSchwarzenegger, but I definitely take care of myself.\n\nMy dad is pushing 60, and while he’s not obese by…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/u87tm6/how_do_i_deep_clean_years_of_bad_oral_hygiene.json": "I’m so embarrassed but I’ve dealt with depression all my life and I’ve done well\nwith my hygiene but I just couldn’t get myself in the routine to brush my teeth.\nMy mouth is in a bad state, my teeth aren’t bad looking but it’s over all just\nvery dirty. Especially my tongue\n\nI have a tongue scraper…",
  "data/reddit-ask/r/NoStupidQuestions/comments/u89t0h/if_someone_wants_the_pronouns_theythem_do_you.json": "In other words, if it’s a single individual and not a group, should I write:\n\nA) They is going to the park.\n\nor\n\nB) They are going to the park.",
  "data/reddit-ask/r/askscience/comments/u882ok/is_the_covid19_mrna_vaccine_species_specific_what.json": "I've been wondering if the mRNA based CoVID19 vaccines (from Pfizer and Moderna)\nare specific only to humans but I can't really find anything about it.\n\nIs the mRNA vaccine specific to only the human species? What would happen if a\ndifferent species, like a dog or cat, received the vaccine?",
  "data/reddit-ask/r/NoStupidQuestions/comments/u8dko9/why_dont_open_tears_cuts_on_your_butthole_get.json": "all that bacteria touching my torn tissue paper but no infection. weird.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/u8g68o/broke_up_with_an_ex_5_months_ago_but_i_just_found.json": "As far as I know she is single, we aren’t on bad terms, but we haven’t talked\nsince. She made the coupons for Valentines day among other things, but it\nspecifically says “no expiration” on the back. Should I cash it in? How should I\ngo about it?",
  "data/reddit-ask/r/AskWomen/comments/u8c8n6/what_do_you_think_about_clothing_styles_that_are.json": "What do you think about clothing styles that are popular today?",
  "data/reddit-ask/r/AskHistorians/comments/u8b06y/given_the_hatred_and_vitriol_seen_in_the_yugoslav.json": "I have recently become somewhat fascinated by the apparent disdain for\nneighboring nations seen in the Balkan states (a term I use somewhat\ninterchangeably with post-yugoslav states, sometimes including Greece, Bulgaria,\nRomania, and Turkey due to similar nationalist rhetoric seen online).…",
  "data/reddit-ask/r/AskHistorians/comments/u8lpmx/if_dwight_eisenhower_felt_the_militaryindustrial.json": "As president, Dwight Eisenhower famously coined the term \"military–industrial\ncomplex\" in his 1961 farewell address. In context, it's typically described as a\nwarning to the American people. Given that Eisenhower served eight years as\npresident, and was the first entirely post war president, did he…",
  "data/reddit-ask/r/AskHistorians/comments/u8kcjo/in_the_first_world_war_what_was_the_difference.json": "I’ve read a few books on WW1, and often the author will mention the quality of\ncertain divisions. For example, John Keegan writes about the German Army in 1918\n“Having left forty second-rate infantry divisions in the east…Ludendorff could\ndeploy 192 divisions in the west….They included most of the…",
  "data/reddit-ask/r/askscience/comments/u8jp7c/how_does_overthehorizon_radar_work_bounces_off.json": "or what?",
  "data/reddit-ask/r/NoStupidQuestions/comments/u8o986/my_brother_wants_to_confess_to_his_crush_during.json": "My brother has a crush on this girl since junior year and he never got the\nchance to confess to her. He is the valedictorian of his class and he’s thinking\nhe do it during the ceremony speech because if she doesn’t like him back, he\nwouldn’t have to see him again.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/u8tjb0/where_the_fuck_do_guys_get_confidence_from.json": "I’ve noticed this so many times that girls just don’t have as much confidence\nthan guys. LIKE WHY. And that includes me. I know girls with so much potential\nbut just don’t have enough confidence. And a guy will literally be saying shit\nand acting like shit but come off as if he rules the fucking…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/u8vly3/do_guys_care_about_what_pussy_looks_like.json": "Do guys care if its hairy or not? Or not perfect enough, or labia is uneven? Im\njust actually curious.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/u8tbsk/why_does_the_lgbtq_community_use_so_many_labels.json": "Like, I thought the whole point was to break free from the constraints of labels\nand be your own person. Instead it seems like they're segregating themselves\nwith labels instead of living free.\n\nEdit: It appears in the span of 3hrs I have offended many a person. This was not\nmy intention but so be…",
  "data/reddit-ask/r/askscience/comments/u8ojy9/did_wwi_impact_european_genetics_at_all.json": "I've got enough of a grasp on biology to understand that if there were genetic\nchanges driven by the war it would most likely be isolated to the Y chromosome,\nor perhaps in recessive genes on other chromosomes if the expressed/heterozygous\nallele/genotype had some effect adverse to survival in a…",
  "data/reddit-ask/r/NoStupidQuestions/comments/u8u68v/a_guy_at_the_bar_gave_me_this_acronym_to_solve.json": "G.I.A.G.I.M.B.A.S.T.\n\nHe said the first letter is something a cow eats (I’m guessing grass)\n\nHe also said that this is probably something you’ve thought many times but\nyou’ve probably never said it.\n\nEDIT: “Grass is always greener…” seems to be the most reasonable start.",
  "data/reddit-ask/r/AskHistorians/comments/u8w6o2/why_did_mikhail_gorbachev_do_the_1998_pizza_hut.json": "Was he in need of the money, did he want publicity, was he just bored during his\nretirement, was Pizza Hut his favorite chain restaurant, why?",
  "data/reddit-ask/r/NoStupidQuestions/comments/u8wiuz/as_an_adult_do_you_still_do_really_childish_or.json": "(27m here) I find myself still doing “childish” things that are just dumb and\nsilly. For example, I’ll walk around our tile floors with socks on and slide to\nthe bathroom or pantry. Or I’ll ride on the back of the shopping cart when I’m\ntaking it to the drop off area.\n\nI haven’t decided if I’m on…",
  "data/reddit-ask/r/NoStupidQuestions/comments/u982f4/why_cant_you_just_squeeze_balls_to_make_cum_come.json": "Why can’t you squeeze balls like a go-gurt or something to make the cum come\nout? Other than the fact it might hurt obviously.\n\nEdit: I’m a girl so I can’t test it myself",
  "data/reddit-ask/r/AskHistorians/comments/u8zmop/were_the_rosenburgs_actually_guilty_of_espionage.json": "When reading various history overviews of the Cold War, I often stumble upon\nsnippets of the execution of Julius and Ethel Rosenburg. They were executed in a\ntime of high paranoia in the USA, and the books somewhat leave the impression\nthat their conviction and execution might have more a product…",
  "data/reddit-ask/r/NoStupidQuestions/comments/u99fas/why_does_everyone_on_reddit_sound_like_the_same.json": "I’ve been on Reddit for a few months and it’s the absolute most bizarre\nexperience I’ve ever encountered.\n\nI read through comment threads and posts etc etc a lot and it’s mind boggling to\nme how everyone appears to be the same. Sometimes I feel like I’m in some\nbizarre “place” where everyone has…",
  "data/reddit-ask/r/AskHistorians/comments/u8xj8x/why_is_donald_duck_way_more_popular_than_mickey.json": "When I used to read strips when I was younger I always used to skip Mickey Mouse\nstories because I found them boring. I heard this from more people around me So\nI think it is a popular opinion in the Netherlands. Generaly the strip is called\nDonald Duck and 80% of the stories is about the Donald…",
  "data/reddit-ask/r/AskHistorians/comments/u9a98z/evidence_shows_that_hinduism_is_over_4000_years.json": "To be clear, this is not a leading question or a question that seeks to call\ninto doubt how old Hinduism is as a practise. I am just curious as to why the\noldest recognised Hindu temple (Mundeshwari) only dates back to around 635 CE,\nWas temple construction not a thing in Hinduism before that? Were…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/u9b1s0/why_are_ukrainian_refugees_being_given_so_much.json": "Don't get me wrong, I'm not some /r/conspiracy pro-Russian troll or anything\nlol, I 100% am on the side of Ukrainians in this conflict and see them as\nvictims of a war of aggression.\n\nWhat I don't see however, is something implied to exist by the widely disparate\nlevels of media coverage - which is…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/u9bjo5/since_the_opposite_keeps_getting_asked_here_women.json": "There's a lot a dude can't hide besides just the obvious size of it. A cock\ncould be permanently bent left for no reason. It could be bruised to death and\nhave chaffing. He could be circumsized. How much does any of these factors\nmatter to you?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/u9brse/why_is_johnny_depp_being_boycotted_by_hollywood.json": "This is infuriating. The public believes Johnny and like 90-95% supports him but\nstill somehow he's the one getting blacklisted and the woman most of the public\ndon't wanna see is getting the biggest roles that she's ever gotten.",
  "data/reddit-ask/r/AskWomen/comments/u9c3zq/what_surprised_you_in_a_negative_when_you_had.json": "Hey, was wondering if theres any moms out there who were willing to share which\nnegative thing about life with children surprised you and you wish you knew\nbefore?",
  "data/reddit-ask/r/NoStupidQuestions/comments/u9gxk4/why_do_people_online_believe_that_just_because.json": "Let's say I explain why some people litter. I'll get tons of negative replies\nand downvotes because people think that I'm standing up for littering. Are\npeople really so [redacted] that they can't see the difference between someone\nexplaining a concept and someone who supports a concept?",
  "data/reddit-ask/r/AskHistorians/comments/u9ce0t/why_does_almost_every_village_in_england_have_a.json": "This\n[https://www.reddit.com/r/CasualUK/comments/u8nblk/this_made_me_smile_its_so_true/]\npost got me thinking, why actually is it that almost every village in England\nhas a village hall, and all of them look pretty much exactly like this? Whose\nidea was it? When were they all built? Why did it seem…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/u9innb/straight_people_of_reddit_are_you_repulsed_by_the.json": "same question for gay men/women about the opposite gender.\n\nalways been curious about this as a bi dude.",
  "data/reddit-ask/r/NoStupidQuestions/comments/u99q4h/why_dont_rich_people_have_a_submarine.json": "They always have a nice car and a yacht but no submarine? Are subs hard to come\nby and make? seems like only research facilities have one. If I was rich I would\ndefinitely buy one.",
  "data/reddit-ask/r/AskHistorians/comments/u9lp9n/are_cargo_cults_a_genuine_spiritual_movement_to.json": "I recently heard about cargo cults [https://en.wikipedia.org/wiki/Cargo_cult]\nfor the first time, and I must admit I was immediately skeptical. The idea of\nindigenous islanders “performing parade ground drills with wooden or salvaged\nrifles” and “[waving] landing signals while standing on runways”…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/u9og8u/if_you_are_in_a_serious_relationship_with_someone.json": "I completely understand & respect that a past divorce is often a very sensitive\nsubject for a person. I acknowledge this.\n\nIf I’m considering marrying someone and committing my entire life to them, I’d\nwant to know how they conduct themselves during marriage difficulties. I think\nwe all accept the…",
  "data/reddit-ask/r/NoStupidQuestions/comments/u9nfoq/is_it_normal_that_my_balls_hurt_after_a_makeout.json": "I (m19) had a makeout session with my gf. It was a solid 1-2 hours and i got\nbricked up a few times. Now my balls feel numb and heavy. Any way to relieve\nsome pain?\n\nI has this before and I went to sleep. I had a wet dream and that was it it was\ngone.\n\nAny other way to relieve some of the…",
  "data/reddit-ask/r/askscience/comments/u9qipy/could_identical_twins_catch_cancer_from_each_other.json": "I know cancer normally won't infect anyone because the cells are too different.\nBut could a twin be infected if they were in close contact/got a transplant that\nunknowingly contained cancerous cells?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/u9ny8g/does_anyone_find_long_fake_fingernails_attractive.json": "So one thing that REALLY turns me off is long fake nails. I’m just curious if\nanyone finds long fake nails attractive? I’m sure someone does. Thanks for\ncoming to my TED talk.\n\nEdit: I should have specified… Like. Really LLLLOOOOOOOOOOOOONNNNNNGG nails.\n\nEdit 2: I never thought about a lot of what…",
  "data/reddit-ask/r/askscience/comments/u9r3bn/do_animals_avoid_their_own_kind_if_the_animal_is.json": "If a raccoon was rabid, would other raccoons avoid it?",
  "data/reddit-ask/r/AskHistorians/comments/u9v7z2/did_leadlaced_wine_jugs_contribute_to_the_fall_of.json": "I came across this quote in my textbook, \"The fall of the Roman Empire has been\nblamed on the consumption of wine...because wine at the time was fermented and\nstored in vessels made of lead, and a lead-based additive was used to enhance\nflavour. It is believed most of the Roman nobility suffered…",
  "data/reddit-ask/r/AskWomen/comments/u9r1uf/in_your_opinion_what_is_the_reason_that_netflix.json": "As of this quarter or so, Netflix is losing more subscribers than it is gaining,\nfor the first time. What do you think is the reason for this?",
  "data/reddit-ask/r/NoStupidQuestions/comments/u9y87r/should_i_kick_my_roommate_out_for_starving_my_dogs.json": "I was away for 3 weeks and she offered to look after my pets. I left her like 15\ncans of dog food, frozen dog food and like 15kgs of dry food.\n\nNone of the cans or frozen food were touched, and only a small amount of the dry\nfood was used.\n\nMy dogs are extremely skinny. I'm amazed they aren't worse…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ua2dut/directed_to_the_women_of_reddit_it_looks_like.json": "Most of the people I know are very comfortable with speaking about this subject,\ngenerally, but it’s still very private for a woman to disclose that she’s on her\nperiod, for the most part.\n\nHopefully this is completely normalised and the stigma disappears completely,\nbecause I have a baby daughter…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/u9ybqg/im_white.json": "So there’s a black guy at my work who has some strange theories.\n\nHe says that black people are the only humans, and other races are “mutants”.\n\nHe called me a “white boy” even though I’m Pakistani.\n\nHe said Pakistanis descend from Caucasians, so I have a “white mans skull”.\n\nI was flabbergasted…",
  "data/reddit-ask/r/NoStupidQuestions/comments/ua2n9b/how_come_most_people_here_on_reddit_view_18_as.json": "I even asked my health education teacher couple days ago, and she said she feels\nthe current age is fine.\n\nBut oh my, most people here view a 19yo dating a 17yo as very disturbing.\n\nIt's seems really weird, since in finland it's legal for a 16yo to have sex with\nanyone, unless their in a position…",
  "data/reddit-ask/r/AskHistorians/comments/u9zft2/which_factors_decide_if_a_foreign_citys_name_is.json": "I live in the Netherlands and when on international news or on the internet\nthere is talk about the city Den Haag the name is almost always translated to\nThe Hague. However the few times that other cities are named their name is\nrarely translated. Sometimes that is not needed as the translated name…",
  "data/reddit-ask/r/AskWomen/comments/ua5f90/daughters_of_reddit_what_does_it_feel_like_to.json": "I suppose you can’t miss what you’ve never had but I find myself wanting to know\nwhat it feels like to have a father that loves you.",
  "data/reddit-ask/r/NoStupidQuestions/comments/ua6688/is_it_weird_if_i_take_a_nap_with_my_daughter.json": "Hello. I have a 8month baby. She is the most important thing in my life. I\nsometimes come home from work pretty tired, and if my daughter is in our bed\nsleeping i usually just lie in bed with her. Some relatives of my girlfriend\ntold me that is weird, that dads shouldnt sleep with their daughters.…",
  "data/reddit-ask/r/NoStupidQuestions/comments/ua5w1e/if_a_priest_blesses_a_vessel_of_water_that_makes.json": "Edit since yall are in the mood to be mean:\n\nOne, I'm not religious and this post was entirely theoretical. Two, I don't care\nif you believe in higher powers or not, not the point of this post. Be nice.",
  "data/reddit-ask/r/NoStupidQuestions/comments/uaafpu/wtf_is_netflix_doing.json": "Raising prices, ads, planning a crack down on shared accounts, spamming users\nwho left to convince them to subscribe again. Like I'm not an expert on business\nbut what the f is Netflix trying to achieve?",
  "data/reddit-ask/r/askscience/comments/ua6mp6/do_automobiles_provide_any_evolutionary_pressure.json": "Its unfortunate but you see them in the streets quite often, especially in well\ntraveled but still somewhat rural areas. Is this the kind of thing that would\ncause evolutionary pressure on the development of squirrels?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ua6xpr/am_i_a_bad_person_for_not_liking_dogs_i_dont_hate.json": "What I hate are dog owners if anything. I am afraid of big dogs. And not brining\na leash in public places where the law requires the person to leash the dog is\nsomething I encounter often. Then I hear its my fault for being afraid of them\nand I should change. I don't go to places where a dog can be…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/uadj5t/why_do_people_expect_others_to_know_what_random.json": "I notice a lot of posts on Reddit and other social media where people will use\nvarious acronyms with little to no context for what they’re referring to. How\nare people supposed to keep track of all of these acronyms? Why can’t we just\ntake two seconds longer to type out the whole phrase?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/uac6eb/do_loose_vaginas_really_exist_or_is_it_just.json": "I often read comments from some men saying “it was like throwing a hot dog down\na hallway” I just find that extremely hard to believe since the vagina literally\ntightens onto whatever is in there.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/uacfql/why_bullying_doesnt_have_legal_consequences.json": "I can’t figure this out. Why if an adult gets beaten it’s assault, but if it’s a\nkid it’s fine? Why taking things from an adult is theft, but if it’s a kid it’s\nfine? Why touching a woman’s breasts against her will is SA, but if it’s a girl\nit’s fine?\n\nIs there really no legal protection for…",
  "data/reddit-ask/r/AskHistorians/comments/ua4ho3/how_the_hell_did_japan_lose_the_battle_off_samar.json": "Taffy 3 was hopelessly outgunned. Yamato alone outweighed the entire force, and\nthe IJN had nearly 20 other ships with it. So Taffy 3 made what they thought was\na last stand.\n\nYet when the smoke cleared, the Americans had won a decisive victory. How did\nthis happen?",
  "data/reddit-ask/r/AskHistorians/comments/uafhke/how_did_patronyms_ever_make_it_to_a_second.json": "If I’m John and I give my son Peter the last name Johnson, wouldn’t that name go\naway for my grandson (who would get the last name Peterson)?",
  "data/reddit-ask/r/NoStupidQuestions/comments/uakzr4/how_do_i_tell_my_boyfriend_i_dont_want_to_have.json": "Listen, sex to me isn’t #1 in a relationship. I might be able to go without it\nfor a bit. MIGHT. I know my boyfriend probably wouldn’t, but still. He’s just SO\nbad at sex. It’s genuinely embarrassing. I don’t know how to tell him this\nwithout him immediately dumping me. He has never given me an…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ualhx1/should_i_go_to_this_wedding.json": "11 years ago, when I was 16, I had a crush on a girl in my biology class.\n\nMy best friend also had a crush on her, the girl was aware of this and proposed\nsomething.\n\nMy best friend and I had to physically fight one another, the winner could be\nher boyfriend.\n\nAs stupid 16 year old boys, we both…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/uat14w/why_dont_we_let_people_with_absurdly_long_prison.json": "Why don't we have a system in place for people who are sentenced to prison terms\nlonger than any human can live, a system in which they are given the choice of\nsimply commitiing suicide?\n\nThis could be used even for violent criminals who can get out at an old age. If\nthey believe they can't be…",
  "data/reddit-ask/r/NoStupidQuestions/comments/uajgix/does_anyone_else_think_of_people_they_havent.json": "Sometimes when I'm bored I would have weird thoughts about people I use to be\nclose friends with in middle school and high school, and I would think about\nthem and wonder how they are doing in life.\n\nI look them up on Google occasionally to see what they're up to and most of them\nare doing alright…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/uavgt4/is_it_a_red_flag_for_a_girl_to_lie_about_her.json": "I found out recently that my wife had lied to me about many things including\nthat shes a virgin, and never had a first kiss. When I confronted her about it,\nwe ended having a week long fight and in the end she said she did it to protect\nherself. I have no idea how she protects herself like that..",
  "data/reddit-ask/r/AskWomen/comments/uakl1m/what_are_those_little_moments_in_life_with_your.json": "Re-Upload: (Sorry, the bot didn't recognise my correction in the comments.\nThanks for those that answered before though!)",
  "data/reddit-ask/r/NoStupidQuestions/comments/uard8p/is_it_cringe_for_a_guy_in_his_30s_to_join_kpop.json": "I'm 33 and fell in love with k-pop again after years of not listening it. I\nabsolutely love choregraphy of modern k-pop groups. I was itching to do\nsomething physically demanding for some time, because I feel I have a lot of\nunspent energy. So naturally I began thinking about trying joining some k…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/uay3gd/brits_how_do_you_feel_about_brexit_after_2_years.json": "From what i remember, Many weren't happy shortly it happened, But what about\nnow? really want to know.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ub123e/why_do_people_want_to_label_sex_workers_in_a.json": "I see people encouraging women to go into sex work because it's their body and\nhow bad ass it is, yet men who use those services are losers and are made fun\nof. How does that make sense?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/uaz723/why_dont_we_just_stop_printing_money.json": "If printing money causes inflation, why cant we just stop printing it, and solve\ninflation that way (not only am i not an economist, i am also not smart)",
  "data/reddit-ask/r/askscience/comments/uavhrr/with_respect_to_gödels_first_incompleteness.json": "I have an undergraduate degree in math but I’m more of an enthusiast. I’ve\nalways been interested in Gödel's incompleteness theorems since I read the\npopular science book Incompleteness by Rebecca Goldstein in college and I\nthought about this question the other day.\n\nUltimately, I’m wondering if,…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/uazn2g/how_can_i_a_girl_compliment_guys_platonically.json": "I’ve heard for the longest time that most men do not receive as many compliments\nas girls do, and that when they do they cherish it forever, but I also hear that\nthey may take it that I fancy them. I want to normalize complimenting men in my\nschool but I worry they will think that I want to date…",
  "data/reddit-ask/r/NoStupidQuestions/comments/ubaad6/how_do_people_afford_to_live.json": "I’m 21 and I work full time at a food place. (Not the best job I know but I feel\nlike it’s my only option at the moment) I get paid about $1500-1700 a month. The\naverage rent in my city is about $1200. I’m currently living with my\ngrandparents and I feel so stuck. I want to break the cycle I’m in…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ubfdtl/do_people_sleep_sober.json": "How do you do it?",
  "data/reddit-ask/r/NoStupidQuestions/comments/ubb7ag/was_anyone_else_not_taught_to_clean_very_well_in.json": "grew up in a pretty dirty home, taught myself how to clean but I feel like I’m\ndoing it all wrong. Anyone have just random cleaning tips for counters, floors,\nlaundry …etc?",
  "data/reddit-ask/r/TrueAskReddit/comments/ub2nls/is_it_fine_to_live_in_a_daydream_instead_of.json": "If the only things that bring you joy are within your own imagination, would it\nbe acceptable to spend all your time daydreaming? Reality would be\noverwhelmingly desolate and debilitating, resulting in the negligence of basic\nnecessities, such as eating. Meanwhile, pleasant fantasies would provide…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ubfbqv/how_is_1kg_over_on_luggage_too_much_but_no_weight.json": "I just checked in to my airport and I was just barely 1kg over on my weight\nallowance for my checked-in luggage. If I didn't remove items I'd have to pay an\noverage charge. Now I personally weigh 58kg wet. How is it the person behind me\nthat weighs more than twice mine allowed on with no questions…",
  "data/reddit-ask/r/AskHistorians/comments/ubcfj4/when_and_why_did_christians_catholics_in.json": "Apologies if this has been asked before, but I searched and only found one\nunanswered post.\n\nIt's my understanding that the idea of life beginning at conception is a\nrelatively recent one, especially since until recently, no one even really knew\nexactly what conceiving a child actually meant, in…",
  "data/reddit-ask/r/NoStupidQuestions/comments/ube30z/how_do_you_get_rid_of_a_fear_of_spiders_very_fast.json": "there is a spider in the corner of my room and i cannot sleep because of it.\nit's like 1 am, i have school in 5 hours, yet it has been hours of me just\nstaring at this spider (that seems to move everytime i look away from it) in\nparalyzing worry that it'll charge across the wall and do whatever it…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ubhuk0/when_underwater_do_you_also_block_your_nostrils.json": "It has occured to me that I've never seen or heard of someone else doing this,\nbut personally I can't be underwater for longer than 3 seconds without having my\nnostrils blocked by my upper lip to prevent water from entering the nose.\n\nWhat the f***",
  "data/reddit-ask/r/askscience/comments/ubig8q/askscience_ama_series_we_are_human_genetics.json": "Happy DNA Day, Reddit! We're a group of scientists who study human genetics, and\nhave expertise in pharmaceuticals, precision medicine, cancer genetics,\npharmacogenetics, policy and advocacy.\n\nThis year is the 200th anniversary of Gregor Mendel's birth. Known as the\n\"Father of Human Genetics,\" he…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ubitvo/have_you_ever_been_disappointed_when_the_clothes.json": "This is one of my worst worries at the moment. To give a little context, I have\nbody dysmorphia and i find it really hard to reveal myself. I do have a partnner\nbut he hasnt seen me naked much, he has seen every part of me but in very\nlimited angles and not much still. I feel like he doesnt know my…",
  "data/reddit-ask/r/NoStupidQuestions/comments/ubkn71/my_dad_died_this_morning_and_i_feel_nothing_am_i.json": "Like the title says, my dad passed away this morning.\n\nIt was a long time coming, he was diagnosed with cancer three years ago and to\nbe honest, we were surprised he hung on as long as he did.\n\nThe last few days have been full of close calls, being called to the hospice by\nthe doctors and such and…",
  "data/reddit-ask/r/AskWomen/comments/ubo2cv/too_much_negative_in_the_world_whats_your.json": "Mines that I can create a blanket cave on my bed and binge my fav show for hours\nwile eating cereal and no one can stop me",
  "data/reddit-ask/r/NoStupidQuestions/comments/ubqdbt/how_is_it_legal_to_homeschool_children.json": "If I can’t walk in off the street to a school and start teaching even one\nsubject, how is it legal to allow parents to teach an entire curriculum without\nqualifications?",
  "data/reddit-ask/r/askscience/comments/ubrekq/before_flemings_accidental_discovery_of.json": "The title is the TL;DR, but I'll also add my personal interest in this question\n(a family legend), and some preliminary Googling that makes me believe this is\nplausible.\n\n\n\nMy grandfather was born in 1906 in Poland (bordering Russia, so sometimes\nRussia, but that's another story.) It was a tiny…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/uc0j6c/conservatives_can_you_guys_pick_someone_else.json": "I don’t like Biden so before you guys use “hE’s bETtEr tHaN bIDeN🤡”, Try and\njust think for a second as to who you think would be better.\n\nFor the love of god this country can do better",
  "data/reddit-ask/r/NoStupidQuestions/comments/uc0xwx/is_my_fiancé_wrong_for_not_letting_me_have_guy.json": "So I have a guy best friend who lives in another state (I’ve known him since\nchildhood) and he’s coming here to visit family. He also asked if me and him\ncould hang out since we haven’t seen each other for many years. My fiancé isn’t\nhappy about me hanging out with another guy and he is literally…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/uc47ik/why_should_i_care_that_elon_musk_bought_twitter.json": "It feels like people think there’s an impending doom that happens because of\nElon Musk bought twitter. I don’t get it. What am I missing? How is Twitter\ngoing to be different now?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/uc4rgr/why_do_we_say_im_taking_a_shit_when_were_giving.json": "Why wouldn’t it be called giving a shit?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/uc3el8/do_people_in_the_rfuckcars_movement_not.json": "I keep seeing this sub pop up in my feed despite not being subscribed to it, and\nit makes me feel like the whole movement is a bunch of city dweelers with great\naccess to public transportation.\n\nWhich I get it, they want to see improvements to public transport. But is it\nfeasible for every road in…",
  "data/reddit-ask/r/AskHistorians/comments/ubwf4p/at_what_point_in_europe_and_the_americas_did.json": "So in a lot of developed cities and in rural places all over the world\nencountering a couple rodents in a subway station or in the barn is not at all\nunusual even if personally or economically undesirable and is generally handled\nby the city or the farmer as just the cost of living life or doing…",
  "data/reddit-ask/r/AskHistorians/comments/uc69bv/lavrenti_beria_is_treated_as_one_of_the_great.json": "I am wondering if Beria truly was likely guilty of being the mass murderer,\npedophile, and rapist he was accused of, or if after Stalin's death, he\nfunctioned as a convenient scapegoat for blame as the country went through\nDe-Stalinization.",
  "data/reddit-ask/r/NoStupidQuestions/comments/ubzc84/is_there_a_way_to_block_any_post_with_the_words.json": "I'm just so sick of all the posts about Mr Apartheid Emerald Mine Trust Fund\nBaby I wanna spit.",
  "data/reddit-ask/r/NoStupidQuestions/comments/uc2lsy/whats_wrong_with_wanting_a_simple_life.json": "For example, I am a carousel operator. It pays the bills so I don’t feel the\nneed to further my job or find a “better” job (at least not right now). I like\njust being able to go to work and then coming home to my studio where I can\nwatch anime/movies, listen to music or work on my screen play.…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/uc9hp0/why_is_step_sister_porn_common.json": "I know you aren’t supposed to shame people for what they’re into, but this is\nweird to me.\n\nI know step siblings aren’t technically related, but you’re still family. It’s\nweird.",
  "data/reddit-ask/r/AskHistorians/comments/ubtrn7/what_were_chinese_gangs_in_the_american_west_like.json": "I am currently teaching a unit on the Chinese Exclusion Act in my 10th grade\ncultural studies class and as I've been looking for material on the expulsion of\nChinese from west coast cities (We're near Tacoma) I notice that in the Eureka\nexpulsion the triggering event as a shootout between two…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ucab5p/was_it_wrong_of_me_to_delete_some_girls_nudes.json": "We're very chill about letting each other use our phones/laptops, so it's not\nlike I secretly took it in the first place. I needed to find some old pics of\nmine which he probably has in his gallery, so I asked whether he can look for\nthem, and he told me to do it myself while he's taking a shower,…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/uc781x/how_should_one_ask_for_help_when_they_want_to.json": "I’ve planned suicide, I’ve messed it up, I’ve decided to live because my dog\nwon’t leave me alone and he deserves my having to fight to stay with him.\n\nI want to ask my parents for help because no one else is around. We’ve been\nfighting the last few weeks and I want it to be a one time action. I…",
  "data/reddit-ask/r/NoStupidQuestions/comments/uc9v0r/i_went_to_the_hospital_today_and_the_bill_is_5300.json": "Tonight I went to the emergency room for chest pains, and other symptoms that\npointed towards a heart attack. I was lucky that this wasn't the case, and it\nwas due to other problems that are non emergency. All they did was a blood test\nand an EKG test. They showed me the bill, which is about…",
  "data/reddit-ask/r/askphilosophy/comments/ubshde/are_there_any_solved_topics_in_philosophy.json": "Okay. So, first, folks do forgive me if my post contains erroneous\nmisassumptions regarding philosophy. I don't know much about it, but my\n(possibly wrong) impression of the field is that it's very, well, diverse. Lots\nof different viewpoints regarding different problems and questions - so…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/uc9901/how_can_i_make_women_feel_more_comfortable.json": "I am a large man (6’5” 270ish) and I feel that I make people, but especially\nwomen, uncomfortable or scared when I walk near them or just try to talk to\nthem. I do my best to avoid these situations, but you never fully can and I feel\nterrible when I can visibly see that I’m making someone…",
  "data/reddit-ask/r/NoStupidQuestions/comments/uc7o3a/what_is_the_free_speech_that_elon_musk_is_going.json": "What is the “free speech” that Elon Musk is going to allow on Twitter that isn’t\nalready permitted on the platform?\n\nI see tweets and comments like this\n[https://twitter.com/elonmusk/status/1518677066325053441] and it has me\nconfused.\n\nWhat types of free speech are currently being stifled by…",
  "data/reddit-ask/r/NoStupidQuestions/comments/ucc861/why_is_it_considered_rude_to_speak_another.json": "I'm a bilingual (Spanish/English) Latina born and raised in Texas. I've noticed\nthat sometimes if I'm speaking in Spanish out in public with another Spanish\nspeaker people nearby who only speak English will get upset and tell us, \"this\nis America, we speak English here and you have to learn the…",
  "data/reddit-ask/r/askscience/comments/uc9w5t/askscience_ama_series_been_watching_the_dropout.json": "Anyone who has visited a doctor knows that medical diagnostic tests (which\nanalyze biomarkers contained in fluids like blood, urine and saliva) are\ncritical in helping to diagnose and interpret a whole variety of signs of\nhealth. But did you know that there are roughly 13 BILLION diagnostic…",
  "data/reddit-ask/r/AskHistorians/comments/ucccr0/why_are_unions_such_a_political_bogeyman_in_the.json": "When on holiday in Nashville, I noticed that Kroger is actually a union shop,\nand my grandfather-in-law is a trucker and in the trucker's union which has\nensured he has decent conditions, pension, benefits, etc. So it's not like\nUnions are that uncommon. I'm not sure they're really less powerful or…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ucbg1n/how_exactly_does_66_billion_end_world_hunger.json": "There are numerous posts suggesting Elon Musk could have donated $6.6 billion to\nthe UN to end world hunger. How exactly would that work? Can there really be a\npermanent solution to world hunger?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/uceppa/why_is_johnny_depps_trial_being_broadcasted_like.json": "Not knocking on Depp and his situation, but on the contrary you have a\nmastermind child predator that managed a stringent child grooming network of\npowerful and influential figures.\n\nMaxwell's case was kept in the dark, while Depp vs. Head is some global\nspectacle constantly trending on social…",
  "data/reddit-ask/r/AskHistorians/comments/ucc6hg/is_this_study_guide_for_a_college_level_us.json": "Assignment [https://imgur.com/a/UC70W12]",
  "data/reddit-ask/r/AskHistorians/comments/uccivd/to_what_extent_would_modern_judaism_be.json": "My impression is that a Jew of the Second Temple period would find a Judaism not\nrevolving around the Temple and its priests quite strange, but I wondered what\nelse would be different, and whether there would be the same difference between\na Jew one thousand years later (so also long after the…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/uchvsd/is_the_word_trauma_being_over_used.json": "Example: Amy Schumer said she was traumatized by the Oscar slap.\n\nI mean, I like you Amy but come on. Traumatized?\n\nThat's just one example. I see this word thrown around when referring to simply\nuncomfortable situations. I know people process things in vastly different ways,\nbut biting into a…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/uc6w0p/is_it_getting_harder_and_harder_to_meet_new.json": "(considering factors other than covid)",
  "data/reddit-ask/r/askphilosophy/comments/ucbzt6/what_the_heck_is_a_dialectic.json": "Hey, sorry that this is probably a very basic and common question that no one\nwants to answer anymore. But everytime I try to read philosophy from people like\nNietzsche, Hegel, or Marx I can't actually grasp their meaning. And when I try\nto find what dialectics are or what Hegelian dialectic or…",
  "data/reddit-ask/r/askscience/comments/ucgg0f/is_holding_your_breath_as_an_infant_a_learned.json": "Got into a heated argument with my biology teacher whether or not it's one you\nare born with. She says that it is learned because when a baby gets water in\nit's lungs it \"learns\" to not do so again.",
  "data/reddit-ask/r/AskHistorians/comments/ucnjua/bread_was_incredibly_labor_and_energyintensive_to.json": "I realize there are some specific circumstances — like the urban poor of ancient\nRome who lacked access to a fire/kitchen — where bread makes more sense.\n\nBut I've ground grain by hand. It's incredibly time-consuming and monotonous.\nEven if you could outsource it to a miller, you're going to pay…",
  "data/reddit-ask/r/NoStupidQuestions/comments/ucr1nf/are_people_turning_their_cars_off_every_time_they.json": "I've been at stoplights and I'll hear a vehicle cut off when it stops and then\nrestart the engine when the light turns green. Today I was next to a crossing\nguard and heard a car on the road start up when he opened the road back up. Is\nthis something people are doing to save gas or something new…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ucpwxm/is_it_wrong_being_a_relationship_with_somebody.json": "...and does it change the situation if I'm honest with them about it?",
  "data/reddit-ask/r/askscience/comments/ucu8jw/is_there_an_animal_that_migrates_towards_the.json": "I am writing a literary project that involves the theme of migration, and I was\nwondering if there are any animals that migrate towards colder regions instead\nof a warmer one. I know this goes against the intuitive description and\nreasoning behind animal migrations but I thought I might ask around…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ucygym/why_is_everyone_so_scared_or_mad_about_sharing.json": "I am a Hispanic male and I’ve grown up in the Mexican culture my whole life with\nme I have never been offended by someone eating a taco or a tamale, a white or\nblack person celebrating cinco de mayo or wearing a sombrero. I actually\nencourage it! I love to see other adopting the culture! Why don’t…",
  "data/reddit-ask/r/AskHistorians/comments/ucpkg4/in_the_modern_west_the_fruit_adam_and_eve_ate_is.json": "I'm curious if there are any ancient Christian or Jewish works of art that have\nthe fruit appear to be something different.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ucyg9j/is_music_becoming_more_crass_or_am_i_just_getting.json": "Im 22f and at work we have a radio that is always on and turned to the top hits.\nSometimes it gets uncomfortable sitting in a room with my coworkers and hearing\nlyrics about doing it doggy style or songs with women moaning in the track, but\nthese are the regular family radio stations and thats just…",
  "data/reddit-ask/r/NoStupidQuestions/comments/ucvapy/can_i_report_someone_for_their_headlights.json": "I live in a bottom floor apartment. Somewhere in this complex, lives someone who\nparks outside of my window at night, and leaves their lights on.\n\nI've gone outside to speak to them, but oddly, they aren't in their car?\n\nThey'll leave them on for a couple of hours, with their car running. I honest…",
  "data/reddit-ask/r/NoStupidQuestions/comments/uczhr3/why_are_all_of_my_comments_being_removed.json": "Did a shadowban check and it turns out all of my posts from a different\nforum/board(not sure what separate places are called) are being removed? Fail to\nunderstand why since I haven't violated any of their terms.",
  "data/reddit-ask/r/NoStupidQuestions/comments/ud2ijh/as_a_kid_i_used_to_hear_if_you_think_teachers.json": "I'm 25, been working since I was 19, and yet despite hearing that phrase\nrepeatedly during my school years, I've never had a boss who would even come\nclose to being as bad as my worst middle and high school teachers.\n\nWhat gives? Have I just been very lucky, or is that phrase part of the…",
  "data/reddit-ask/r/askscience/comments/uct13z/why_are_african_americans_more_at_risk_for.json": "African Americans are more likely to die, contract, and have more severe cases\nof prostate cancer. Why is this the case?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ud1mi1/do_you_guys_believe_in_the_once_a_cheater_always.json": "I was discussing this with my friends and all of them seem to think that it’s\nnot possible for someone to change when it comes to cheating. You can cheat as a\nteen and they’ll still believe you’ll be the same until the day you die. I\ndidn’t think so many people thought this way so I wanted to hear…",
  "data/reddit-ask/r/AskHistorians/comments/ud5udl/holy_roman_empire_is_often_made_fun_of_for_being.json": "Duchy of Burgundy, a vassal of France was essentially a rival state of France\n(from what I understand) from middle of 14th to middle of 15th century with the\nDuke of Burgundy occassionally being the real power behind the French throne.\nFrench vassals in general were also very independent minded…",
  "data/reddit-ask/r/askscience/comments/ud5dj5/is_there_any_other_place_in_our_solar_system.json": "I know that a full solar eclipse looks the way it does because the sun and moon\nappear as the same size in the sky. Is there any other place in our solar system\n(e.g. viewing an eclipse from the surface of another planet’s moon) where this\nhappens?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ud5qnj/why_are_guys_with_big_boobs_arent_expected_to.json": "Just curious",
  "data/reddit-ask/r/AskHistorians/comments/ud43th/in_the_ottoman_empire_there_were_rulings_for_or.json": "One very famous example of the Ottoman case is of Khalil al-Sarmini, whose\nmarriage to a female jinn was tacitly approved by the Shafi'i mufti of Aleppo.\nConsidering the folklore surrounding youkai and them being able to marry and\nbreed with humans, were there similar cases happening in early…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ud84jp/how_do_you_respond_to_someone_playfully_saying_i.json": "To clarify, im talking about someone who isn't family or a loved one, but\ninstead a friend who says it platonically.\n\nI made a joke to someone today and they laughed and said I love you, and I\ndidn't really know how to respond.\n\nI'm definitely over thinking this, but if someone could help me out,…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ucvfvi/is_it_a_bad_sign.json": "About 80% percent of the time, when I am on Reddit replying to posts or\ncomments, right before I tap send, I read and think to myself, 'ya... mmm....\nprobably shouldn't say.' delete.",
  "data/reddit-ask/r/NoStupidQuestions/comments/udasi9/is_it_weird_that_i_laid_with_my_dog_after_she_died.json": "My dog passed away almost 3 years ago. She was having a surgery to have some\nmast cell tumors removed and during the surgery, her heart stopped, and they\ncouldn't bring her back. The first thing I did was drive to the vet after I got\nthe call, and ask to see her. They brought me into a room and…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/uddyb7/why_is_my_boyfriend_so_much_more_handsome_to_me.json": "So the title basically says it all. Recently I've found that my boyfriend looks\nso much more handsome to me for no reason. Like I literally can't stop staring\nat him every time I see him around. It's interesting to me because when I first\nmet him, I thought he was below average in looks. I know…",
  "data/reddit-ask/r/NoStupidQuestions/comments/udgxfk/am_i_wrong_for_being_a_bit_bothered_when_i_hear.json": "This is something I frequently hear, especially considering peers my age\n(teenagers). While I absolutely see the hardships that women go through for\nsimply being women, especially in a high school setting where there are a\nnumerous amount of simps and weirdos that don't just view women as other…",
  "data/reddit-ask/r/NoStupidQuestions/comments/udcvfe/i_have_a_genuine_question_about_race.json": "I really would like to educate myself on a term I heard today. This is not bait.\nI’m an older white male and had to go to the Apple store at the mall for a\nreturn of a purchase I made online. ( I HATE THE MALL ) I haven’t been in years.\nWhile I was standing outside there was this ridiculously…",
  "data/reddit-ask/r/NoStupidQuestions/comments/udlql3/does_men_still_find_women_hot_if_they_have_no.json": "Yes I know not all men work the same but in the general sense is it a deal\nbreaker for you if a girl has no boobs? Like actually no boobs. We're talking\nsmaller than A cup. Sorry. I'm just feeling really insecure about my body (I'm\n22) and I'm scared that no men is going to ever find me attractive…",
  "data/reddit-ask/r/AskHistorians/comments/ud5fu5/i_was_recently_struck_by_the_ubiquity_of_multiple.json": "I would really value any insights any historians could share. Thank you!",
  "data/reddit-ask/r/AskWomen/comments/udhi44/women_who_pursued_single_motherhood_by_choice_how.json": "Wins, losses, regrets or fulfillment. Want to hear it all!",
  "data/reddit-ask/r/TooAfraidToAsk/comments/udob4g/does_anyone_feel_like_they_hope_they_get_in_an.json": "Like not wanting to die, just so I don’t have to go in.",
  "data/reddit-ask/r/askscience/comments/udscjl/askscience_ama_series_im_dr_richard_johnson_a.json": "Hi, Reddit. I'm Dr. Richard Johnson, a professor of medicine specializing in\nrenal health and hypertension at the University of Colorado School of Medicine.\nI'm also an adjunct professor at the University of Florida. I'm board certified\nin internal medicine, infectious diseases and kidney…",
  "data/reddit-ask/r/AskHistorians/comments/udsc43/why_did_spain_so_easily_give_up_roussillon_and.json": "Roussillion was a region in north-eastern Catalonia that was ceded to France in\nthe Treaty of the Pyrenees. But I can't seem to find anything on whether or not\nSpain attempted to take the province back. You'd think that at the Congress of\nVienna in 1815 that Spain would attempt to push for the…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/uds6ci/why_does_body_positivity_seem_so_toxic.json": "I haven’t really seen this on Reddit (might not follow the right subs, or the\npeople I’m Talking about don’t use Reddit), but I have very much seen this on\nTikTok\n\nThere are some very obese women (this seem to be mostly women this happens with)\nposting TikTok’s about their body, how they’re…",
  "data/reddit-ask/r/askphilosophy/comments/udfkrt/are_there_any_documented_cases_of_children_or.json": "I've heard about cases of this happening in disciplines like Mathematics or\nPhysics, but never in Philosophy or other Humanities/Social Sciences fields. I'm\nnot sure if this happens a lot and doesn't receive any media coverage or if it\ndoesn't happen at all.\n\nI'm referring to cases like that of…",
  "data/reddit-ask/r/AskHistorians/comments/udol9y/on_this_ancient_egyptian_ostracon_burying_the_god.json": "This is the ostracon in question\n[https://www.britishmuseum.org/collection/object/Y_EA5634]",
  "data/reddit-ask/r/AskWomen/comments/udcj6e/what_is_one_thing_that_you_will_always_do_no.json": "Edit: And how do you muster up the energy to do it??",
  "data/reddit-ask/r/AskHistorians/comments/udvt6u/the_early_seinfeld_episode_the_limo_involves_a.json": "I know that David Duke is mentioned in the episode in passing as a joke about\njust how extreme the Paramount Theater speaker is (since even David Duke\ndenounces him as too extreme, despite having pretty much the same ideology), but\nwas there anything beyond Duke's Republican presidential primary…",
  "data/reddit-ask/r/AskWomen/comments/udxefm/what_made_you_stop_masturbating.json": "What made you stop masturbating for a long period of time such as weeks or\nmonths?",
  "data/reddit-ask/r/NoStupidQuestions/comments/udwqb8/isnt_the_phrase_actually_couldnt_care_less.json": "Instead of \"could care less\". For example: \"I couldn't care less what you had\nfor lunch today\". As in, the amount that I care is so little, that it's\nimpossible to care less than I currently do.\n\nI really am not the type of person to nitpick spelling or pronunciation but I\nsee \"could care less\" so…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ue0tnn/why_do_i_always_wanna_add_much_more_garlic_than_a.json": "Whenever I make a recipe, it’ll usually say something like “2 cloves of garlic,”\nand then I end up using way more garlic because it just tastes better;\napparently a ton of other people do this, and I was wondering why that is.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ue72m4/do_doctors_just_not_take_womens_reproductive.json": "Two people in my life now have had severe issues with endometriosis and it took\nthem ages to diagnose/cure.\n\nA friend of mine, 26, had to insist the doctors remove a fibroid in her uterus.\nIf she hadn’t pushed, it would have been way worse. It took her two years to get\nsurgery and the fibroid was…",
  "data/reddit-ask/r/NoStupidQuestions/comments/ue4mdb/do_people_working_undercover_jobs_get_paid_twice.json": "For the sake of argument if someone in a police/security profession was sent\nundercover in a legitimate job, for example a financial institution, and was\nrequired to perform the job to a satisfactory standard to remain undercover\nwould they be entitled to the wage they were drawing while undercover…",
  "data/reddit-ask/r/NoStupidQuestions/comments/ue73tc/are_amber_heards_lawyers_really_that_bad_or_does.json": "Yes I am serious. Using bullshit 'proof' like \"He drank a lot/did drugs\" and \"We\nhave a video of him slamming cabinets to prove he can be aggressive\".\n\nI think they may have thought this would be a simple cut and dry case and that\nAmber would win by a landslide simply because DV cases tend to be so…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/udtyl8/why_do_medical_professionals_hate_chiropractors.json": "This probably came out due to the recent chiropractor memes, but why does\neveryone hate on them so much?\n\nI would regularly go to a chiropractor for a number of things and they always\nhelped me out, even when PTs couldn't.\n\nReally curious about the background on this.\n\nEdit: These stories are…",
  "data/reddit-ask/r/NoStupidQuestions/comments/ue9vhx/what_do_couples_do_when_they_shower_together.json": "I’m trying to understand, is it supposed to be a romantic activity? Or just for\ngeneral bonding purposes? Tagging NSFW just in case it’s more of the former.\n\nIf it’s the former I imagine it isn’t as sexy as most imagine since most of us\ndon’t look like the cast of Baywatch; and, water makes for…",
  "data/reddit-ask/r/AskHistorians/comments/udvhjf/what_did_japan_do_in_the_three_days_between_the.json": "How did they respond to the first nuclear bomb before they were hit with the\nsecond one?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ue55mk/my_brother_is_dying_from_cancer_what_the_f_do_i_do.json": "Stomach cancer with metastasis. His condition is getting worse by the day and\ndespite him being in a study with experimental chemotherapy and anti bodies, the\ntherapy hasn’t brought any feasible improvement. He cannot eat, and looks like\nsomebody who has been left to starve for months. I could…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/uea5fe/does_life_actually_get_any_better.json": "Basically what the title says. I’m 30-years-old in the United States and I can’t\nhonestly convince myself life is worth living. I work 50 hours a week just to\nbarely afford an apartment, I spend the little free time I do have to try to get\nhousework done and maybe recoup enough to feel better than…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ue398a/how_do_i_tell_my_roommate_to_make_sure_all_his.json": "Long story short, my roommate will jerk off in the shower (who doesn’t). He\nmoved in about 3 months ago.\n\nAbout a month ago i took a shower and while i was washing my foot, i saw the\nstringy cum stuck to it. I shit you not i literally almost vomited in the\nshower. I let it go because i thought…",
  "data/reddit-ask/r/NoStupidQuestions/comments/ue79f0/do_all_these_people_really_think_reeses_pieces_is.json": "No shade to them, I’m just genuinely wondering if people who pronounce it that\nway have ever thought about this and made a conscious decision to continue doing\nso.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ue76uf/why_does_reddit_allow_cheering_on_violence_as.json": "I've seen multiple posts on the front page throughout time that show videos or\nimages or people getting assaulted and the comments cheering it on. From what\nthe ToS states, encouraging or glorifying violence is against them so why are\nthese posts still allowed?",
  "data/reddit-ask/r/AskWomen/comments/ue48ge/are_you_happy_whywhy_not.json": "I was wondering if you are happy and why or why not ? I have no intention so\nfeel free to understand the question as you like",
  "data/reddit-ask/r/AskHistorians/comments/uehz5r/garbed_as_princes_early_indian_sojourners_to.json": "I daresay the 1857 rebellion is to blame, but I await the expert for details.",
  "data/reddit-ask/r/askscience/comments/uecon3/how_do_we_fall_asleep.json": "How does our body go from conscious to unconscious?",
  "data/reddit-ask/r/AskHistorians/comments/uefdrt/what_happened_to_alexander_the_greats_cloak.json": "Alexander the Great supposedly wore a cloak.\n\nMithridates supposedly had this cloak in his possession and wore it both for fun\nand for appealing to potential allies.\n\nAccording to Plutarch, Pompey supposedly got the cloak after defeating\nMithridates, and allegedly wore it during his Triumph in 61…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/uek1of/russian_oligarch_vs_american_wealthy_businessmen.json": "Why are Russian Rich businessmen are called oligarch while American, Asian and\nEuropean wealthy businessmen are called just Businessmen ?\n\nBoth influence policies, have most of the law makers in their pocket, play with\ntax policies to save every dime and lead a luxurious life.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/uejsvd/why_does_the_internet_have_a_strong_presence_of.json": "I live in Asia (GMT+8), they are half way across the world but I still see quite\na lot of American presence. The thing I noticed is that other online users\nassume that I am American (or any person outside of the US for that matter)\nwithout any sort of confirmation or evidence. All the units used…",
  "data/reddit-ask/r/AskHistorians/comments/uem8pt/what_made_microsoft_add_solitaire_to_their.json": "I realise that Microsoft wanted a way to show off their GUI, however what in\nparticular made them pick Solitaire over another card game? Was solitaire\nalready popular at that point? Or was it quite obscure?",
  "data/reddit-ask/r/NoStupidQuestions/comments/ueid4f/i_hate_to_put_it_like_this_but_why_do_a_lot_of.json": "Again I know that sounds really insensitive, but I don't know how to put it.\nWorking class white people in the USA often vote against left-wing and\nprogressive politicians who promise free healthcare and college. I don't get it.\nWhy don't they want these things? I don't understand how it would be a…",
  "data/reddit-ask/r/askscience/comments/uenpo7/if_the_jwst_tried_to_take_a_picture_of_earth_and.json": "Could it take a picture of my house? Of the ants on the ground?\n\nThis is probably a stupid question.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/uetdyy/is_my_art_project_offensive.json": "I will absolutely die if anyone from my class sees this but here it goes.\n\nI’m making an art project for class. I’m making these fake cakes (using spackle,\nfoam, and cardboard) that spell out the word “starve”. It looks like a vintage\ncake and it’s pink and red.\n\nA person in my class said that it…",
  "data/reddit-ask/r/askscience/comments/uem8ri/will_we_get_color_images_from_the_james_webb.json": "So far the only images we've seen are from calibration and they're\nmonochromatic. Does JWST have different filters or sensors for different\nwavelengths of light that can be combined to generate a color or false color\nimage?",
  "data/reddit-ask/r/AskHistorians/comments/ueklia/why_isnt_russia_part_of_the_west_what_constitutes.json": "For the past few months, there has been headline after headline talking about\nthe \"west\"'s collective action to support Ukraine and counter Russian\naggression. One thing that stood out to me is, despite the country essentially\nbeing European (technically Eurasian, but the majority of the population…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ueydnr/if_prostitution_gets_legalized_shouldnt_the.json": "I was just thinking about this earlier. If prostitution is legalized, theres now\na slightly bigger risk for diseases like HIV getting passed. Should prostitutes\nget paperwork and verification every 3 months?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ueukeo/my_fiancé_f26_confesses_to_not_wearing_underwear.json": "She states it as feeling comfortable and ‘airy’ down there, and that she’s been\ndoing this since years (I have luckily only ever found her wearing one)\n\nUsually she takes my feedback very constructively, but this is one of the few\ntimes she was adamant on being in the right. I’m now conflicted…",
  "data/reddit-ask/r/NoStupidQuestions/comments/uep12t/help_literally_stuck_in_an_apartment_complex.json": "Not a lease!! I gave an English class in an apartment in Madrid and now i can't\nfigure out how to get out of the complex!! All the exterior doors won't open\n(maybe they need a key or a card?) I can't squeeze through the bars and there's\nseemingly no reception with security which is how i usually…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/uf0ddr/why_did_god_create_homosexuals_if_he_didnt_like.json": "I want to come out to my parents soon, but there Christian, and i know there is\nsome anti homosexual relations with the bible so ive been researching a lot\nabout it and ive always had this question in the back of my mind and it seems\nthis question should've been answered already but after looking…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/uf1weh/with_everything_thats_going_on_im_the_us_how_come.json": "I feel like every post I read, everyone is in agreement that the rich are\ngetting richer, companies are destroying the planet and literal pedophiles are\ngetting off Scott free because they’re billionaires or friends with\nbillionaires. How come more people aren’t taking to the streets.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/uf3h6h/theres_not_a_moment_that_i_am_around_my.json": "It's not even those thoughts, just being around her gives me a hard on, and\nwe've been dating two years. I am 23.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/uevm1t/what_makes_russias_doings_to_ukraine_to_be_seen.json": "Is it cause of the biased media exposure or is it really worse? Why is doing\nevil acts judged upon the offending country? Is it so or Am I wrong?",
  "data/reddit-ask/r/NoStupidQuestions/comments/uf36sj/why_does_everyone_use_the_term_gaslighting_now.json": "I notice people using this word everywhere now, almost to the point of overusing\nit.\n\nA Google Trends search confirms this.\n[https://trends.google.com/trends/explore?date=today%205-y&q=Gaslighting,Manipulation]\nIts use has skyrocketed in the past 5 years, recently reaching an all-time peak\nlast…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/uf9ajm/why_do_i_have_poop_coming_out_after_cleaning.json": "This is a problem I have been facing for a month now, every time I poop I wipe\nuntill it's white and I also use wet wipes. After like few hours (and it always\nhappens when I am outside) my butt starts itching. When I wipe I find very small\nleftover poop like colored water. Also to mention it…",
  "data/reddit-ask/r/askscience/comments/ufa7b9/what_is_the_mechanism_in_which_neurons_change.json": "For example, in neuroplasticity, how are the neurons able to 'move' themselves\nto undo connections and create new connections with other neurons? I remember\nseeing a microscopic picture of a few neurons not very well connected between\neach other, and in the 'after' picture (after learning…",
  "data/reddit-ask/r/AskHistorians/comments/uf9yzx/why_didnt_european_powers_convert_the_middle_east.json": "I know there were some missionary efforts, but it seems that in the middle east\nEuropean powers were not very successful at converting the population to\nChristianity, especially when compared to their success in sub Saharan Africa.\n\nDid they just not see converting Muslims as important? Are there…",
  "data/reddit-ask/r/AskHistorians/comments/ufbleg/was_life_as_violent_as_depicted_in_the_movie_the.json": "The year depicted is 895. The action is mainly in Scandinavia, Russia and\nIceland.\n\nIn the movie, 100% of the people live a violent life (men, women, children,\nadults, kings, slaves, soldiers, farmers... everyone!). Everyone is on the brink\nof being beheaded, raped, tortured, enslaved. Everyone is…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ufbrjx/should_i_tell_my_date_im_subscribed_to_her.json": "Going on a tinder date tonight, and the woman in question has a decent following\non IG and has an OF account.\n\nCoincidentally, I’ve been subscribed to her OF for about three months (prior to\nmatching her).\n\nI haven’t interacted with her much on OF, and she did ignore a DM I sent through\nInsta a few…",
  "data/reddit-ask/r/askscience/comments/ufc5e6/would_a_rail_gun_in_space_produce_recoil_on_the.json": "Was randomly thinking of space battles in sci fi and it occurred to me that\ntraditional kinetic weapons like fire arms would to some extent be pushing the\nship they are mounted on which got me wondering if a rail gun would have the\nsame result.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ufggrn/why_are_westerners_offended_when_people_try_to.json": "I'm from India and there is nothing I like more than foreigners trying out\nIndian clothes, traditions and everything related to my culture. Every Indian I\nknow feels the same, but somehow people in the west (especially North America\nand especially white folks) get offended on our behalf and have…",
  "data/reddit-ask/r/NoStupidQuestions/comments/ufii8l/why_are_shy_people_told_to_become_more_outgoing.json": "As a shy person, I've been told many times that I need to be more outgoing.\nHowever, I overthink conversations and think, \"if I say this, where does that\nlead this person to say\". However, outgoing people are never told to be more\nquieter or just shut up. I've been on the receiving end of many…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ufjwc6/why_am_i_expected_to_respect_religions_that_says.json": "Just to be clear, I'm making a distinction between respect for a religion (an\nideology, a belief system) and its adherents, the latter I acknowledge should\nnot all be generalized and castigated simply for their religious beliefs. Some\nreligions such as Christianity, Islam, Judaism say that if you…",
  "data/reddit-ask/r/AskHistorians/comments/ufdl43/how_did_the_toyota_hilux_become_the_vehicle_of.json": "If there's one thing that's burned into my brain when seeing videos of armed\nconflicts in the developing world, whether latin america or central asia or\nsubsaharan africa... it's that they're all using Toyota pickup trucks, often\nwith a machine gun in the truck bed. I'm sure I am not alone in…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ufavm4/isnt_balancing_race_in_school_racist.json": "I saw some universities with a \"diverse\" community only allowing a certain\namount of each race into the school. If we're all equal why aren't we all just\nin the same contest instead of having to be balanced?",
  "data/reddit-ask/r/askscience/comments/ufd626/how_genetically_related_are_you_to_your_ancestors.json": "Edit for the title: from a thousand years ago\n\nBy that I mean if we found a genetic sample of one of my ancestors from a\nthousand years ago and compared it to mine using modern methods, could you be\nable to tell we are directly related, as in he is my grand grand grand -...\nfather?\n\nAlso this may…",
  "data/reddit-ask/r/AskHistorians/comments/uf8uly/how_did_upper_class_women_watch_games_at_the.json": "Looking at a diagram of who sat where in the event of a game at the Colosseum,\nsave for the Vestal Virgins who sat at the bottom along with the upper echelons\nof society, women of all classes had to sit at the very top, along with the\npoor, foreigners, non-citizens, and slaves. Apparently this was…",
  "data/reddit-ask/r/NoStupidQuestions/comments/uf8y8r/does_anybody_feels_just_overwhelmed_by_life.json": "some times, I want to do everything and feel empowered; other times I need a\nbreak from life without anything stressful going on in my life. But I dont want\nto do anythiing and feel like I cant do anything, applying for a job, getting a\nhealth insurance, doing uni tasks, hosting a friend whos…",
  "data/reddit-ask/r/NoStupidQuestions/comments/ufkqvt/whats_the_little_thing_in_life_that_makes_you_the.json": "As a Boomer, it would be very interesting to me for the younger generation to\nshare with me a bit of themselves. Floating on a sea of positive vibes instead\nof getting weighed down with negative ones!!"
}