{
  "data/reddit-ask/r/TooAfraidToAsk/comments/v23vyl/how_do_i_report_a_discord_server_for_child.json": "i do youtube videos, i wanted to join random discord servers and troll for a\nyoutube video, to find servers i went onto twitter and searched \"discord\" and\nwent to newest first, i found a link to a server captioned \"Crazy Leaks\" or\nsomething like that, i didnt think much of it, and entered the…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/v274xn/if_people_cant_use_mental_illness_as_an_excuse.json": "I'm not saying people should use mental health issues as an excuse, but at least\nwith that it isn't their choice to be unwell. Unlike religion, which is a\nchoice.\n\nCan anyone explain this?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/v29we0/is_antiracism_simply_thinly_veiled_racism.json": "I’ve seen “anti racists” talk about how white men shaped this world, but when\nyou tell them that Arab and Chinese empires contributed vastly they act like you\nare lying.\n\nOne woman said Christin Europe established a patriarchy in the Middle Ages, but\nI told her the Abbasid caliphate was the…",
  "data/reddit-ask/r/askscience/comments/v29pew/what_determines_the_ideal_number_length_width_and.json": "I notice that wind turbines have only three very long blades, yet windmills and\nwater pump windmills have many more. Likewise, home fans can have three, five,\nor more blades, and there is a lot of variation in the lengths available. How do\nyou determine what's optimized for a given usage?",
  "data/reddit-ask/r/NoStupidQuestions/comments/v24yuw/do_unattractive_people_find_other_unattractive.json": "Throwaway because I don’t want the people who know my main to know I’m a petty\nbitch, but really…\n\nWe all know that some people are more attractive than others, and some people\nare significantly less attractive. I feel like the less attractive people KNOW\nthey’re less attractive, right? Despite…",
  "data/reddit-ask/r/AskHistorians/comments/v2dv17/to_what_extent_did_normans_identity_as_norse.json": "In the mid-9th Century, the French king decided that the best way to prevent\nvikings raiding up the Seine was to permanently station some vikings of his own\nat the mouth, buying their loyalty with land and titles. Thus, the Normans. The\nNormans would go on to be fairly successful, going on to form…",
  "data/reddit-ask/r/NoStupidQuestions/comments/v2e999/is_it_possible_to_shit_yourself_while_delivering.json": "When you squeeze your hole while delivering a baby, does it also squeeze your\nanus? and has it happened before?",
  "data/reddit-ask/r/AskHistorians/comments/v2ca2i/did_frontier_people_in_ancient_times_speak_hybrid.json": "I watched \"Kingdom of Heaven\" and in this movie you can see Crusader knights\ngreeting by saying \"Salam alaykum\". The first thing I thought was: \"is this\nhistorically accurate, did they talk like that?\" I'm Spanish and in the very\nSouth where Spain and Morocco really intertwine, it's not rare that…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/v29xlb/is_it_homophobic_or_whatever_to_dislike_the_lgbtq.json": "I couldn’t care less about the LGBTQ people themselves, if they’re good people,\nI like them. If they’re bad people, I don’t like them. I just don’t like the\ncommunity as a whole. Kinda toxic and I just don’t like groups in general.\n\n(Groups as in the idea of the group not the people in it)\n\nAnd…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/v2gguh/why_do_so_many_people_believe_that_you_cant_be.json": "I’ve seen this idea of ‘you can’t be racist to white people’ for a while now.\nConfused on why so many people believe in it. When I debate this, they always\ngroup white folks into being American or English? When there’s many many\ncountries other than that. ? They also tend to believe that there’s…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/v2cs44/if_someone_is_homophobic_racist_sexist_etc_and.json": "Like if you go on any social media you will find a lot of people trying to\nprotray each other like that. My question is why should I care that some random\nstranger in their mom's basement is homophobic or racist. If you keep it to\nyourself then my opinion on your thoughts about some community…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/v2npfu/why_are_half_the_questions_on_this_subreddit_just.json": "\"Why are people angry at Chris Rock? Isn't Will Smith just being overly\nsensitive?\" \"I agree\"\n\n\"Does anyone else feel there are too many superhero movies?\" \"Yeah, I do\"\n\n\"Why does Donald Trump do this dumb thing?\" \"Because he's an idiot\"\n\n\"Is it ok if I believe [politically incorrect opinion]?\"…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/v2kgzk/how_can_someone_be_both_nonbinary_and_gay.json": "A person I graduated high school with now identifies as \"gay non-binary.\" If\nnon-binary means you don't identify as either gender and gay means you're\nattracted to the same gender, how can you be both at the same time?",
  "data/reddit-ask/r/askscience/comments/v2glh3/why_arent_the_subspecies_of_brassica_rapa_just.json": "I guess the question is, what's the difference between subspecies and species,\nat least in the plant world? Is there even a clear distinction?",
  "data/reddit-ask/r/AskWomen/comments/v2gpmm/what_is_sex_after_a_hysterectomy_like.json": "Are orgasms still satisfying? Are you able to have rough sex after healing\nfully? If so, how long did it take to get to that point? Are there any positions\nyou find uncomfortable or have to avoid now? Did you ever get over the fear of\nthe cuff tearing? Did you have any complications?",
  "data/reddit-ask/r/AskHistorians/comments/v2ohrp/why_did_someone_put_a_shoe_in_the_wall_of_a_200.json": "During a renovation, we found an old shoe in the wall of a 200 year old house in\nNew England. I'm looking for information on why it was put in the wall in the\nfirst place. Failing that, what other subreddits should I try, because r/shoes\n[https://www.reddit.com/r/shoes/] doesn't seem like the right…",
  "data/reddit-ask/r/NoStupidQuestions/comments/v2s3bm/was_the_80s_really_as_nice_as_stranger_things.json": "I'm only 21, so I wasn't born in the 80's. But I love the general aesthetic of\nthe 80's in general, there's just something oddly nostalgic about it even though\nI'm not from the era? Like the way shows portray that time period, there was a\nmuch bigger sense of community, and people acted like…",
  "data/reddit-ask/r/askscience/comments/v2eaob/askscience_ama_series_im_futurist_amy_webb_and_i.json": "We can now program cells as if they were tiny computers. What happens when\nanyone can manipulate organisms - or even create new ones? My new book, The\nGenesis Machine\n[https://www.amazon.com/Genesis-Machine-Rewrite-Synthetic-Biology/dp/1541797914],\ngives you the background you need to think…",
  "data/reddit-ask/r/askscience/comments/v2waae/dogs_can_smell_covid_infections_in_patients_with.json": "You'd just have to build a detector sensitive to the specific molecule or group\nof molecules that cause the smell, right? And while we are at it, can't we have\na bomb-sniffing and drug-sniffing machine, the same way dogs do? Or is there\nsomething about dog morphology that allows them to detect…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/v2mrbw/why_do_we_not_require_driving_tests_again_after.json": "Genuinely so concerning the way that some elderly folk drive with zero\nawareness.\n\nEDIT: my apologies— no I don’t consider 60 years old to be old/elderly. In my\narea we have tons of retirement communities that are 55+ so I guess in my area\n55+ seems “old” however, my mom is 55 and if I ever called…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/v2vwff/i_understand_that_womens_vaginas_cannot_get.json": "If we are having sex regularly, I don't have an issue with being too tight and\nhe can enter easily after a little bit of foreplay, but as soon as a couple\nweeks go by without penetration, no matter how turned on and lubricated I am, it\nhurts and he has to slowly work his way in. Sometimes we just…",
  "data/reddit-ask/r/AskHistorians/comments/v2pplv/the_ancient_indian_epic_mahabharata_mentions_a.json": "EDIT: I’ve been now told that only 1% of threads here even get a response, and\neven then it’s very Eurocentric - usually threads about Hitler or Ancient Rome.\nCan someone direct me to a sub about Asian history so I might contact some\npeople who are motivated to answer? Thank you.\n\nSo for those who…",
  "data/reddit-ask/r/AskHistorians/comments/v2tl2x/in_the_us_the_emergency_number_911_was_created_in.json": "This has interested me for a while. In most 911 emergency situations, the people\ninvolved are unable to go to the hospital or police station. If someone is\nhaving a heart attack, they often won't be able to make it to the hospital. And\nif someone is the victim of a crime, they likely won't be able…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/v2eqzw/is_it_true_that_people_in_usa_walk_inside_house.json": "No one does in Europe as i know, so like is it movie thing or true?",
  "data/reddit-ask/r/NoStupidQuestions/comments/v2yw8l/why_is_the_statement_dont_have_kids_if_you_cant.json": "I thought it was a solid statement, like it would be risky to purposely have\nkids if you don’t have enough money to provide for them in the beginning. I\nthought you have to be really prepared for kids before having one. Just to\nclarify, I’m not counting accidental pregnancies.\n\nI’m saying this as…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/v2zo0i/why_are_a_lot_of_feminists_victim_blaming_johnny.json": "Surprised to see how many feminists on Reddit are blaming Johnny Depo for being\nabused. I don’t hate feminists and have huge respect for them, but all I kept\nseeing from them were comments like “Depp is a piece of shit” and things like\nthat when asked about the Depp/Heard trial. In fact this was…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/v324bg/is_it_some_sort_of_stockholm_syndrome_that_we.json": "thoughts?",
  "data/reddit-ask/r/TrueAskReddit/comments/v2vyre/my_wife_has_serious_email_anxiety_but_i_cant.json": "I have experienced lots of kinds of executive dysfunction, but I don’t\nunderstand e-mail anxiety at all. The concept of someone expecting a\ncommunication and relying on you for that makes me feel anxiety about not\nsending emails, even if they’re difficult or anxiety-inducing.\n\nI don’t at all…",
  "data/reddit-ask/r/NoStupidQuestions/comments/v37reh/please_dont_kill_me_guys_out_of_genuine.json": "Doesn't it make the added letters seem more important than the others? Don't\npeople of other letters feel it's unfair to not be represented? Doesn't adding\nnew letters lead to eventually include them all and end up with a ridiculous\nunpronounceable word?",
  "data/reddit-ask/r/AskHistorians/comments/v2y26b/it_is_1791_and_the_2nd_amendment_has_just_been.json": " * Are there restrictions to purchasing a firearm if I am a land-owning white\n   man? What if I am a white woman, or a free black person, or indigenous, or\n   don't own any land?\n * Is there an age limit?\n * Are there special gun stores, or would I be going to the local general store?\n * What kind…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/v30ycm/do_you_ever_feel_like_picking_a_fight_with_rude.json": "Sometimes I post because I’m desperate and need advice on something or need to\ntalk to someone or whatever the fuck and there’s always someone that come with\narrogance ready to ruin your already bad day.\n\nI had made a post about having just feeling anxious about a new dog we got and\njust figure out…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/v3boue/biracial_daughter_gets_called_fake_black_by_the.json": "To be fair she’s 1/4 black 3/4 white, but she doesn’t look white, she has the\ncurly hair and all, but is tan, she’s very beautiful (and I’m not just saying\nthat as her mama). The kids at her middle school call her “ghetto” and “fake\nblack”, like she’s pretending to be black. They don’t accept her.…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/v3lye9/update_post_i_took_the_leap_of_faith_and_accepted.json": "So yesterday I posted that my chosen parents had let me know they had a desire\nto legally adopt me.\n\nI’ve spent the last 24 hours on a roller coaster of emotions, and Reddit helped\nand hindered that experience for me. Some of you were a huge help and support\nand some others made me feel I had no…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/v3je88/how_do_i_not_let_myself_slip_into_inceldom.json": "I(21M) find myself flipping back and forth between trying to be an ally to women\nand believing in TRP or BP stuff.\n\nI often feel frustrated and bitter towards women a lot because of my failures in\ndating. I’ve never had a girl like me and I’m still a virgin at 21 both of these\nmake me feel awful…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/v3eamb/why_are_so_many_answers_in_rtooafraidtoask.json": "If r/TooAfraidToAsk [/r/TooAfraidToAsk] is for asking controversial questions,\nwhy do so many commenters shame or belittle the OP? The OP asked the question\nbecause they recognize that they need to hear new perspectives to have a healthy\nview of the issue at hand, so why the hostile responses?",
  "data/reddit-ask/r/NoStupidQuestions/comments/v39pb1/why_is_it_offensive_to_suggest_that_woman_could.json": "I was adamantly told by my friends that telling woman that can’t have children\nthat “she could adopt” is extremely offensive and something you should never do.\n\nfor the life of me I don’t understand why. even in casual conversation you can’t\neven say “would you adopt?”. i’m not trying to offend i’m…",
  "data/reddit-ask/r/AskHistorians/comments/v3j4a3/im_a_roman_naval_officer_why.json": "I never got an answer to my question so I thought I'd bring it up again!\n\nFrom an outsider's glance, it seems there are a variety of benefits from joining\nthe Roman Army as a member of the equestrian class, with opportunities for\nbattle, prestige, and even a chance for political power or in the…",
  "data/reddit-ask/r/AskHistorians/comments/v3oyln/would_it_have_been_taboo_to_climb_a_pyramid_in.json": "I came across this post in r/museum\n[https://www.reddit.com/r/museum/comments/v3kzu6/adrien_dauzats_18041868_the_great_pyramid_giza/]\ndepicting several people climbing up the Great Pyramid at Giza, and it brought\nto mind the scene in the 2022 film Death on the Nile in which Hercule Poirot…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/v3nwid/why_did_lgbtq_change_to_lgbtqia_wouldnt_the_plus.json": "Text (optional)",
  "data/reddit-ask/r/TooAfraidToAsk/comments/v3xnx5/how_to_tell_my_girl_she_looks_worse_with_makeup.json": "Title says it all. I hate the Barbie doll completely fake look, and I’m just not\nattracted to the heavy makeup. If we’re going to a play, or concert or important\nevent I get it, but she does it EVERY occasion. She’s beautiful without the\nmakeup and ive told her that but she still insists. I’m not…",
  "data/reddit-ask/r/NoStupidQuestions/comments/v3vedx/how_do_i_a_poc_deal_with_racism_from_other_people.json": "I’ve faced racism 7-8 times and it’s only been twice that it was a white person.\nI’ve been called a terrorist, told to go back to my country and told that I\ndon’t belong here by black people. For some reason when I talk about it tho, its\nkinda dismissed and not talked about enough or being told…",
  "data/reddit-ask/r/NoStupidQuestions/comments/v3yekw/can_i_pepper_spray_tik_tokers_who_are_pulling_a.json": "I keep seeing videos on reddit of douche bag tokers doing stuff like moaning in\npeople's ears, or taking stuff out of their shopping carts, so they can film\ntheir reactions. I always wondered what I'd do in that situation and realized\nI'd just prefer to pepper spray them. Cause they're assholes. I…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/v3yrfu/am_i_going_crazy_spouse_of_13_years_keeps.json": "Background - My wife and I have been together since Jr. High. We are both in our\n30's at this point. We started off very poor, but agreed prior to getting\nmarried that we wanted a large family, that she wanted to be a stay at home mom,\nand that I wanted to provide for us financially. Our first year…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/v45snq/im_sure_youre_all_tired_of_my_updates_but_i_just.json": "So I accepted my parents offer to legal adopt me. Part of that was I wanted to\ntake their last name, but also due to the abuse from my biological parents I\ndidn’t want to keep my middle since since it was my biological mothers first\nname.\n\nI told my new parents I wanted them to choose a name for my…",
  "data/reddit-ask/r/AskHistorians/comments/v485ju/what_were_the_precursors_to_rock_paper_scissors.json": "It's such a simple game, I'd imagine that before Scissors were around the game\nexisted just under different names. Potentially the same for paper. Do we have\nrecords of the game, and where it originated from?",
  "data/reddit-ask/r/NoStupidQuestions/comments/v4eduw/does_anyone_else_replay_conversations_theyve_had.json": "Talked to my boss earlier. Decent conversation. After getting back to my desk I\nstart to think, \"why did I say that one thing I said? She probably thinks I'm so\nweird.\"\n\nHad a conversation with my landlord earlier. Seemed fine. Got home and started\nthinking, \"I probably sounded stupid when I…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/v4cqyh/why_arent_loud_obnoxious_people_told_to_shut_the.json": "I own a retail business. I grew up in the retail and restaurant industry. I'm in\nmy thirties. I only encounter these types of people at work. I think I just\ndon't deal with them in my personal life because I can just walk away and avoid\nthem.\n\nThere seems to be this personality type of people that…",
  "data/reddit-ask/r/AskHistorians/comments/v4dkru/was_porn_produced_in_andor_by_the_soviet_union.json": "Or maybe to broaden things what is the history of porn financing and\ndistribution being used as a form of subversive psyop?\n\nI’ve basically been investigating alleged Russian oligarchy financing of\nspecific subversive porn genres over the last 8 years-15 years that appears to\nbe tied to their…",
  "data/reddit-ask/r/AskHistorians/comments/v41rmj/why_wasnt_andorra_annexed_into_france_or_spain.json": "It’s only 180 square miles and was formed in 1278, so why did no one during this\ntime formally annex it?",
  "data/reddit-ask/r/AskHistorians/comments/v4fhgp/where_did_the_medieval_water_myth_come_from.json": "Clearly, the idea that medieval people drank alcohol because water was unsafe is\nfalse. Where did this myth come from? Is it a recent invention? Is there a\nparticular author or source we can trace it back to?",
  "data/reddit-ask/r/AskHistorians/comments/v4knt6/in_a_1994_episode_of_the_simpsons_they_make_a_lot.json": "In the 1994 episode “Sideshow Bob Roberts” the republicans are shown to be\nmeeting in a large stormy castle, with unambiguously evil characters like Mr.\nBurns and Dracula, and they have secret chant.\n\nhttps://m.youtube.com/watch?v=oSLJKoqwMV4\n\nhttps://en.m.wikipedia.org/wiki/Sideshow_Bob_Roberts\n\nI…",
  "data/reddit-ask/r/AskHistorians/comments/v4hnpf/is_it_more_accurate_to_look_at_the_second_world.json": "I've been doing some research into the Second Sino-Japanese War and noticed how\na lot of the militarization and nationalism in Japan seemed to have grown as an\nisolated incident from Germany's rise of militarizim and nationalism but each\ntheater of the war(European and Pacific) would in there own…",
  "data/reddit-ask/r/askphilosophy/comments/v46haa/does_late_wittgenstein_pose_problems_for_the.json": "I've begun reading some Philosophical Investigations, and it strikes me that\nWittgenstein's critique of the strict rules of meaning, in terms of use as\nmeaning in a language-game and furthermore family resemblance of word\ndefinitions poses some problems for a super intelligent AI that works…",
  "data/reddit-ask/r/askscience/comments/v4lcfg/why_are_rockets_spacecraft_corrosion_resistant_if.json": "I was reading about the different types of alloys used in rockets, and many of\nthem are labeled as 'corrosion resistant'; does this actually matter or is it\njust a useless byproduct of the alloys that rockets use? (btw, sorry if I used\nthe wrong flair.)",
  "data/reddit-ask/r/NoStupidQuestions/comments/v4omgf/do_any_of_you_rehearse_hypothetical_conversations.json": "Hey all, for as long as I can remember I've been a \"think out loud\" type when\nI'm on my own (or even a mutter if people are slightly in earshot.)\n\nThe thing is that usually it goes a step further and I'm kind of monologuing my\nthoughts, as if I'm rehearsing my part of a conversation, but it's…",
  "data/reddit-ask/r/askscience/comments/v4qg7n/is_there_any_scientific_evidence_or_reason_that.json": "I almost exclusively eat late, ranging anywhere from 9pm to 11pm. I just need to\nbe relaxed and have time to enjoy eating. When my kids are awake I have to be\nalert and take care of them,so I don't eat just a few bites with them and\nprepare dinner after they are asleep. People who know about of…",
  "data/reddit-ask/r/NoStupidQuestions/comments/v4phww/why_the_fuck_are_legos_so_expensive.json": "I must already know the answer to this, but I wanna have a discussion about it.\n\nIt's because they're popular, ain't it?\n\n\n\nI just want to buy some Lego star wars stuff, I want to feel like a kid again.\n\nI never had them, cuz they were expensive, and now since I'm an adult with money\nI can buy my…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/v4xqh4/do_anyone_find_skinny_and_small_boobs_attractive.json": "people here make fun of me bc of it (even if they were jokes, it hits hard). i\nfear no one will like me bc of it",
  "data/reddit-ask/r/askscience/comments/v4o42c/how_are_the_columbian_hippos_escobars_hippos_not.json": "As per title, even if hippos don't suffer from inbreeding to the same extent,\nsurely over so many generations it has to have some effect? Estimates put the\npopulation at around 100 with potential to grow higher.",
  "data/reddit-ask/r/AskHistorians/comments/v4udl8/did_every_early_civilization_decide_to_name_their.json": "It just seems surprising that all early civilizations would independently come\nto the conclusion that a city needs a name, when it’s more or less a more\ndensely populated area than the rest of the area.\n\n(I guess what I’m saying is that I can see why a peoples or a culture or a\ngeneral land would…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/v4unm2/how_long_after_eating_pineapple_does_it_change.json": "My friend was eating pineapple at lunch because she was going out that night and\nshe said she wanted her pussy to taste good. Does it change how you taste that\nfast?",
  "data/reddit-ask/r/askscience/comments/v4xy3e/when_is_a_rock_considered_to_be_born.json": "You often hear that a rock is 1 billion years old or 300 million years old or\nwhatever age it may be. What is the starting point for a rock’s age? I assume it\nmight vary based on the type of rock, like maybe volcanic rocks are “born” when\nthey emerge from a volcano, or sedimentary rocks are “born”…",
  "data/reddit-ask/r/NoStupidQuestions/comments/v4yeid/should_i_respond_to_someone_i_declined_a_job_to.json": "I had an interview with someone and decided to go with another candidate. I sent\na decline message (respectfully). That person is sending me emails asking what\nthey could’ve done better and why they were not selected. They were not selected\nbecause they didn’t even know what the job they were…",
  "data/reddit-ask/r/AskWomen/comments/v4oz05/if_you_can_feel_yourself_about_to_fall_into_a.json": "Do you resign yourself to bed until it's over? Do you try and pull yourself out\nof it and continue with all the social events etc. you had planned to do before\nit hit?",
  "data/reddit-ask/r/NoStupidQuestions/comments/v53h5n/whats_to_say_that_romcoms_are_not_as_damaging_as.json": "Im not trying to justify porn, I just want to know why romantic movies/tv is\nconsidered perfectly ok, not porn is not? I feel like both forms of media can\ncreate an unrealistic expectation in a relationship.\n\nFor example, take the movie Titanic, what’s to say that after watching that,\nsomeone…",
  "data/reddit-ask/r/AskHistorians/comments/v50taw/why_does_italy_have_such_an_enormous_diversity_of.json": "I do a lot of cooking and... In Italian cuisine, there are more kinds of pasta\nthan I can even keep track of the name of. So many cuts, styles, ingredients...\nstuffed, cut, extruded, etc. So many custom tools for making different kinds\nlike stamps (including custom designs), custom boards for…",
  "data/reddit-ask/r/NoStupidQuestions/comments/v5avr1/im_a_fat_male_i_want_to_jog_to_lose_weight_but_it.json": "I just googled and supposedly sports bras for men do exist. Do you think if I\nwore one under a shirt that anyone would notice?\n\nOtherwise, I was thinking of wearing a really tight compression shirt.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/v5axo0/why_is_i_want_to_have_money_to_be_alive.json": "Isn't that the truth? Most people don't like what they do in their job, but they\ndo it anyway 'cause they help keep the lights on",
  "data/reddit-ask/r/AskHistorians/comments/v5csf8/doortodoor_salesmen_were_still_among_the_best.json": "According to Wikipedia, after The Great Books series flopped on launch,\nEncyclopedia Britannica turned to traveling door-to-door salesmen, who did much\nbetter.\n\n> ...through that method, 50,000 sets were sold in 1961...According to Alex\n> Beam, Great Books of the Western World eventually sold a…",
  "data/reddit-ask/r/AskHistorians/comments/v5kw1v/why_is_old_writing_pre_20th_century_so_tedious.json": "Aurelius's \"Meditations\", Plato's \"Republic\" and Smith's \"Wealth of Nations\" are\nvery similar in that they are written in a very abstract language. There are\neither no introductions to various ideas or arguments the authors wish to make.\nAnd if examples are being given, they are long winded and…",
  "data/reddit-ask/r/askscience/comments/v5kd1y/i_read_that_there_are_high_concentrations_of.json": "Likewise, would the same apply to a planet within a nebula? If the affect\nwouldn’t be enough to make a difference visible to the naked eye, are we inside\na nebula or some gas “cloud” ourselves?",
  "data/reddit-ask/r/NoStupidQuestions/comments/v5ngsb/are_bars_allowed_to_confiscate_prescriptions.json": "Not sure where to post but -\n\nI went out last night to a club in DC. I'd walked there and picked up some\nantibiotics from a CVS on the way because I have a UTI. The bouncer looked in my\npurse and saw the orange prescription bottle and took it away. I tried to make\nhim see that the tablets matched…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/v5qw35/is_it_true_that_men_are_only_friends_with_women.json": "I had a male friend (he’s early 30s and I’m mid 20f) tell me that men are only\nfriends with women they would be interested in hooking up with and not because\nthey just like them for who they are.\n\nHe proceeded to tell me that men don’t understand complex emotion and because of\nbiology, are only…",
  "data/reddit-ask/r/NoStupidQuestions/comments/v5qsq6/why_do_i_feel_like_im_getting_dumber.json": "I’m 23, living on my own, going to school. I’m fairly isolated most of the time.\nI feel like there is a heavy “fog” clouding my ability think clearly or\ncommunicate effectively. I used to feel smart, I’d be able to think quickly and\ncarry out conversations but now I feel like I’ve lost that…",
  "data/reddit-ask/r/AskWomen/comments/v5rf6w/women_who_own_guns_why_have_you_made_that_choice.json": "NO JUDGEMENT HERE. I am genuinely curious.",
  "data/reddit-ask/r/askscience/comments/v60um3/askscience_ama_series_summer_is_tick_season_we.json": "Lyme disease, an infection caused by the bacterium Borrelia burgdorferi that is\nprimarily transmitted by Ixodes scapularis (also known as blacklegged or deer\nticks), affects between 30,000 and 500,000 Americans every…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/v61oiy/my_mum_keeps_telling_me_i_should_never_tell_my.json": "I was sexually assaulted a few years ago when I was 18 and I reported it. Most\npeople know he was accused but no one knows that I am the victim.\n\nI come from a strict religious background and even though my mum supports me,\nshe keeps repeating to me about how I shouldn’t ever tell anyone especially…",
  "data/reddit-ask/r/NoStupidQuestions/comments/v61959/why_are_people_collectively_pretending_covid_just.json": "It can't just be me who's noticing that people are just...pretending like COVID\nnever happened out in public, right? No masks anywhere to be seen outside of\nmedical facilities, people sneezing and coughing into their hands to spread\ntheir germs everywhere, cramming into places like a sardine can.…",
  "data/reddit-ask/r/NoStupidQuestions/comments/v65tst/why_is_johnny_depp_getting_so_much_praise_when_he.json": "Amber Heard definitely deserved to pay up but there's a reason he had to throw\nin a nice chunk of money too. I'm glad that everyone is starting to see that men\ncan be DV victims too but people are acting like he was a saint when they both\nclearly showed abusive tendencies in the trial?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/v624be/if_body_shaming_should_not_be_tolerated_then_why.json": "Edit:\n\nYes i do understand that those could just be preferences but guys get more hate\nwhen they say “i would not date her cause she’s fat” vs when girls say “i would\nnot date him cause he’s short”\n\nand most of the time this is what people say when rejecting(based on what I’ve\nheard and seen…",
  "data/reddit-ask/r/AskWomen/comments/v5waqi/women_who_have_been_bullied_and_isolated_in.json": "How did you get through it, and what support helped you/what support did you\nwant?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/v626dm/are_mobile_users_really_the_minority_on_reddit.json": "I always see posts with some sort of disclaimer along the lines of “sorry for\nformatting, I’m on mobile” but I’ve genuinely never met someone that uses Reddit\noutside of on their mobile device. Obviously there’s nothing wrong with using\nReddit through some other means, I’ve just never met someone…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/v64vcy/how_common_is_it_really_for_women_to_lose_respect.json": "I apologize if the question is comming across as if I don't believe people when\nthey say this, because I do, I am just wondering HOW common it is. I see this\nall over reddit. Anytime the topic of men showing emotion comes up, there will\ninevitably be a highly upvoted comment about how when they…",
  "data/reddit-ask/r/AskHistorians/comments/v62uzx/when_did_it_stop_being_normal_for_leaders.json": "Lately I have been seeing lots of news stories about Generals being killed on\nthe front lines in Eastern Europe. I know this must have been quite common\nbefore modern communication technology came into being, but when was that? Was\nthis common in the 18th century? 19th? Did it vary by region? Or…",
  "data/reddit-ask/r/AskHistorians/comments/v69ix5/why_did_france_decriminalize_homosexuality.json": "I want to preface this by saying I am in no way questioning the wisdom of this\ndecision (I am queer myself), just questioning the historical reasoning.\n\nIt is my understanding that homosexual activity has been legal in France since\n1791, when sodomy was not included in the new revolutionary penal…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/v6bcja/was_what_happened_to_me_rape.json": "Please tell me i'm not crazy and that what happened is fucked up, i was always\nupfront to my ex that i did not want to have sex and will remain a virgin till\nmarriage. I don't judge people for that but its just my personal choice. I just\nturned 20 and during the entire rs he would constantly ask me…",
  "data/reddit-ask/r/AskHistorians/comments/v6d7cr/was_zoroastrianism_founded_as_an_inversion_of.json": "It has recently come to my attention that the good deities in Zoroastrianism\n(Ahuras) are etymologically relayed to the evil ones in hinduism (Asura) and the\ninverse applies to (Daevas to Devas). It's been theorized that Zoroastur\ninverted the morality and cosmology of hinduism. But it seems to me…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/v6bk8f/why_do_people_get_so_triggered_by_a_person_asking.json": "I see so many posts where someone talks about how their significant other asked\nthem to lose weight because they do not find their partner attractive with the\nextra weight on and all the comments are like \"lose him/her\" or \"dump that piece\nof shit\" \"go find a person who will love you no matter…",
  "data/reddit-ask/r/NoStupidQuestions/comments/v6dmma/what_are_the_ceiling_boobies_lights_actually.json": "Just moved into a new place and the light boobie is missing the nipple that\nscrews the boob into the ceiling.\n\nObviously I can’t tell my landlord that sentence, so what are the actually\ncalled??",
  "data/reddit-ask/r/askscience/comments/v6d2b9/did_all_winged_insects_evolve_from_a_common.json": "For example, are winged beetles related to wasps through a winged common\nancestor?",
  "data/reddit-ask/r/AskHistorians/comments/v68s2v/what_happens_to_boring_ancient_artifacts.json": "I'm talking stuff that's historical but not particularly unique or wow enough\nfor museums to want to display, like pottery sherds and lumpy lithics that are\njust like a thousand other pieces. Will a museum take them regardless, or does\nsomething else happen to them?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/v6bqm1/how_do_you_cope_with_nobody_ever_doing_anything.json": "I’ve been thinking about it and I know I can’t be the only one. Nobody has ever\ndone anything really nice for me, surprised me, or ever really gone out of their\nway for me. I had 2 birthday parties total when I was a kid because my birthday\nwas so close to Christmas that my parents always said it…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/v6gnhc/do_you_ever_worry_about_your_partner_killing_you.json": "I have a coworker who's husband tried to kill, Her marriage was \"Perfect\" no\nwarning signs, he met someone else and thought death was easier than divorce.\n\nI had a conversation with my husband after that, asked him if his ever done he\nwill be free to walk away but to please never kill me..you can…",
  "data/reddit-ask/r/NoStupidQuestions/comments/v5ziwq/does_anyone_actually_watch_live_performances_back.json": "It’s like those weirdos that record fireworks, I stopped doing when I was a teen\nbecause I realised it’s so less interesting the night after. I never understood\nwhy people recorded live performances because it’s all about the moment to me.\nSo ya, does anyone actually watch them after recording?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/v6jlyo/am_i_wiping_my_ass_wrong.json": "I am so grateful that I have a place to ask this. Poop details below.\n\nSo after I defecate, I wipe my butt with toilet paper until the paper comes up\nclean. But sometimes, especially if the poop has been uh, well-hydrated, I can\nwipe until the paper is clean and later get an itchy butt after…",
  "data/reddit-ask/r/NoStupidQuestions/comments/v6a54p/in_america_why_cant_the_citizens_of_the_usa_vote.json": "Like I know we have a certain government, but why can’t we change it? Would that\neven be a good idea?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/v6ix2i/in_backshots_or_doggy_do_men_stare_at_the_butthole.json": "About to get my back blown out for the first time and I literally bought new\nunderwear in hopes that it will cover my asshole (it does not) so now I’m scared\nhe’s going to be staring at my you-know-what the whole time.\n\nMy question is is do men care? Like, obviously they know it’s there but is it…",
  "data/reddit-ask/r/NoStupidQuestions/comments/v6nffm/why_is_a_girlwoman_dressing_manly_and.json": "I've been confused by this for quite a bit. You'd see a little girl walk around\nwearing a monster trucks t-shirt, wearing \"boys\" clothes, playing with \"boys\"\ntoys, and just wearing Halloween costumed typically made for boys and no one\nreally batted an eye to it. Specifically in elementary, there'd…",
  "data/reddit-ask/r/AskWomen/comments/v6r97t/women_of_reddit_what_do_you_think_of_being.json": "As a queer woman, I'm curious as to how other women perceive this situation.\nAlso, would you change infront of them?\n\nEdit: I was asking because my past roommate had no problem changing in front of\nme even if we were not that close, I discussed this to my female friends and\nsome said it was weird…",
  "data/reddit-ask/r/AskHistorians/comments/v6twwv/im_alex_von_tunzelmann_author_of_five_books_most.json": "I’m a historian with specialisms in international Cold War politics, imperialism\nand post-imperialism, and forms of historical storytelling: including film and\nTV, and of course statues. I’m also a screenwriter working mostly on historical\ndrama – so I am extremely interested in both the making and…",
  "data/reddit-ask/r/AskHistorians/comments/v6sdj6/bill_clinton_has_been_described_as_having_an.json": "I saw a Reddit comment last night that was a reply to someone saying their wife\nsaw Bill Clinton on a commercial flight and the comment was joking \"Be glad she\ndidn't leave you. I've been in his presence once, and I don't have the words to\ndescribe it.\" and it got me thinking: Clinton, Kennedy, and…",
  "data/reddit-ask/r/AskHistorians/comments/v6t0u7/why_is_it_that_the_cia_interfered_with_south.json": "My brother and I were talking about this the other day, and he suggested they\nwere afraid of MI6, but I'm not so sure that would've been enough to keep them\nout of literally every country. Obviously the Soviet Union had the eastern\nblock, but former Soviet nations don't really have the policies I'm…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/v6rz8v/gun_owners_always_say_they_need_that_for.json": "I get the world is scary and crime is everywhere but I don't get why they need\nAssult rifles, sniper rifles, shotguns and all sorts of instruments of war.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/v6tfsa/why_do_we_have_to_wake_up_early_and_work_jobs_we.json": "I understand how the world works with careers and money etc. but still, why is\nit the way it is. I cannot stand waking up in the morning. I hate working in\ngeneral. I wish I can just spend my days with people I love and being in nature.\nBut unfortunately that’s not how life works.",
  "data/reddit-ask/r/askscience/comments/v6rre8/i_know_there_is_a_correlation_between.json": "The fact that I have to choose one \"flair\" for this question pisses me off.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/v6ft6x/if_i_am_only_thinking_about_selfharm_or_suicide.json": "My depression has been much worse than usual and I’ve been having thoughts about\nhurting myself or worse. Do I actually need to go to the hospital? I don’t want\nthe staff to feel like I’m wasting time and space by being there or for them to\nthink I’m faking it. For context I live in the US. Mods…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/v6u2pw/how_do_i_tell_my_partner_i_dont_want_them_on_my.json": "So I go on work trips to cities across the country every so often and my partner\nalways wants to come. It’s generally quite short notice so only time for me to\nbook and arrange things for me.\n\nNow I have a work trip that is in about a month.\n\nThe thing is, I don’t want her to come with me. Granted,…",
  "data/reddit-ask/r/askphilosophy/comments/v6puw9/arguments_against_back_in_the_day_people_were.json": "Some time ago i had a \"conservative\" classmate who used to talk about these\ntypes of views a lot and constantly argued that \"people nowadays are dumber and\nweaker than people in the past\" and seemed to believe the \"weak men create hard\ntimes --> hard times create strong men\" type view which i feel…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/v7021a/what_is_a_girl_code_that_every_girl_should_know.json": "You know how there’s a bro code? What are the the unwritten rules for girl’s\nfriendship?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/v6yib0/in_all_these_gun_threads_about_the_us_defending.json": "Even if you had a small militia of gun owners, or even a large one, the US\nmilitary has superior man power and tech. They could outnumber your militia or\nsimply bomb it with drones. I am not trying to make a statement about gun\nownership, I am simply trying to know why so many gun owners think they…",
  "data/reddit-ask/r/AskWomen/comments/v75vs9/what_is_the_thing_you_saw_other_women_doing_that.json": "I want to ask the question as broadly as possible, hence the NSFW tag",
  "data/reddit-ask/r/askscience/comments/v7857j/if_inflammation_is_bad_why_does_our_body_do_it.json": "I constantly see \"anti-inflammatory properties\" listed as a health benefit of\nvarious nutrients in healthy foods, but my understanding is that inflammation is\na natural process of the human body. So anti-inflammatory foods are basically\ninhibiting a normal biological process.\n\nWhy do we need to do…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/v77rtb/how_do_i_tell_my_girlfriend_to_stop_hitting_me.json": "It has kind of got to the point where it is normal for her to hit me. It is not\ndamaging, and she only hits me on body parts that are not the face or balls. I\ndo not want to seem like I am a \"pussy\" but she just gets frustrated and it's\nstarting to get to the point where I'm sick of it. It's…",
  "data/reddit-ask/r/NoStupidQuestions/comments/v73ed7/why_is_cooking_so_enjoyable_for_many_people.json": "I find cooking to be very boring and very inefficient actually. Think about it.\nYou have to go buy all of the ingredients. Prepare them for the meal. Then cook\nit. Then you eat it in like 15 minutes. Lastly, you have to clean everything.\nSeems to be a very inefficient activity.",
  "data/reddit-ask/r/AskHistorians/comments/v7a0f0/piggy_banks_how_did_pigs_become_the_standardmost.json": "I haven’t posted here before, so I hope I have followed the rules. As the title\nindicates, I’m curious as to why piggy banks came to be pig-shaped, as I can’t\nthink of an obvious explanation for it despite how common they are. This is\nmainly directed at historians of the United States and Western…",
  "data/reddit-ask/r/AskHistorians/comments/v6vy3c/why_did_the_us_keep_puerto_rico.json": "In 1918, Congress granted US citizenship to Puerto Ricans. The popular\nexplanation for this event was that is was a way to recruit soldiers for WWI.\nNevertheless, there is evidence that the act was a way to quell the growing\nsympathy for independence. Congress at the time must have foreseen that…",
  "data/reddit-ask/r/AskHistorians/comments/v6sqev/is_it_possible_to_ask_for_feedback_about_removed.json": "Let me preface this by saying that I love this subreddit and I understand that\nthe rules of this sub contribute a lot to the quality of the answer one can\nexpect for it .\n\nYesterday I checked , using another subreddit , if any of my comments were\ndeleted and I found out that seven of my answers on…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/v7bb6f/do_men_care_if_it_pulls_out_dirty.json": "I’ve never really been sure. As girls should we be expected to douche every time\nbefore he might use the back door, or does it not matter? Last week a guy I was\nseeing asked if he could finish in there and I did warn that he would have to be\nprepared that I couldn’t guarantee how it would look when…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/v76hkp/do_guys_care_when_a_girls_boobs_are_asymmetrical.json": "It has literally always bothered me to the point when I will not wear an unlined\nbra. Im super freaked out people will notice. I had a guy point it out one time\nand I have never been able to get the thought out of my head since. FML\n\nSorry i changed it for more context.",
  "data/reddit-ask/r/NoStupidQuestions/comments/v7atdg/what_do_women_fantasize_about_when_they_masturbate.json": "Do you fantasize about anyone in particular or any random people?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/v7ffrw/how_come_that_dogs_like_pitbulls_are_ilegal_in.json": "Mexican redditor here, looking to satisfy my curiosity, I looked it up on the\ninternet but found nothing, and I find this pretty disturbing since a dog can be\nowned to defend your home, same with a gun, and yes, I know what Pitbulls are\nused for and why having one is prohibited, but when it comes…",
  "data/reddit-ask/r/NoStupidQuestions/comments/v6xckl/why_do_i_always_fantasise_about_a_relationship_as.json": "Like I could just have a random interaction with a girl, and then my brain will\nlater have random monemts where I guess I \"fantasise\" over being in a\nrelationship (not sexual, just like, romantic and soft I guess).\n\nObviously I know I'm probably not going to date them. But theres that small…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/v7d0nm/i_am_afraid_of_women_how_can_i_conquer_this_fear.json": "I am terrified of women that I’m not related to. I cannot talk to them. Ican’t\nbe around them. I can’t even look at them without panicking.\n\nI’m a college student. When I go to class I do my best to avoid being around\nthem. I cross the street when they’re walking near me. If the only seat in…",
  "data/reddit-ask/r/askscience/comments/v7mv9w/askscience_ama_series_were_a_global_nonprofit.json": "OceanX scientists have had rare encounters with a giant purpleback flying squid,\nidentified a potentially region-altering tsunami risk in the Red Sea, and come\nface-to-face with the elusive sixgill shark, descended from animals that roamed\nthe planet over 200 million years ago. We're currently on…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/v7ihj9/what_does_my_gf_mean_by_got_used_to_loving_each.json": "My gf of 4y told me she feels like we just got used to loving each other and i\nhave no idea how to respond, apparently its been like this for a while? Like a\nweek or two. She also started telling me about this guy at work that she really\nlikes talking to and he is so funny and charming but idk if…",
  "data/reddit-ask/r/AskHistorians/comments/v7oq25/i_was_born_on_a_pirate_ship_whats_the_origin_of.json": "When I was a kid in the 1980s - call it 1982 as a rough estimate - a popular\nschoolyard trick was to convince someone to inset their fingers into their\nmouth, pull their lips sideways, and attempt to say \"I was born on a pirate\nship\".\n\nThis comes out as \"I was born on a pile of shit\" - peak…",
  "data/reddit-ask/r/AskWomen/comments/v7nw2v/what_makes_you_miss_being_single.json": "Say only one thing _ choose wisely ;)",
  "data/reddit-ask/r/TooAfraidToAsk/comments/v7l79p/is_it_ok_to_pause_when_having_sex.json": "I'm male, sometimes the excitement rises up and to avoid an orgasm I pull out\nand wait those 5-10 seconds to regain control, this is my way to last longer.\n\nIs it bad for you girls?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/v7p16b/what_the_hell_is_cool_whip.json": "I’m from England and have seen it mentioned all over the place in American\nmedia. Seriously, what is it? Is it Mayo? Yogurt? Ice Cream? I cannot work it\nout from context at all",
  "data/reddit-ask/r/TooAfraidToAsk/comments/v7pfpz/how_are_gas_companies_posting_record_profits_when.json": "I've seen a lot of posts about the insane gas prices. Plus people arguing over\nwho caused them and how Joe Biden and the war in Ukraine are the cause of our\ngas prices.\n\nHowever, gas companies are currently posting record profits. I learned this from\nKatie porter, whose a democratic representative,…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/v7sjwn/life_is_mostly_doing_things_you_dont_want_to_do.json": "For instance, I work twelve hour days. I wake up early, I work with strangers, I\ngo home, I pay for gas, I drive, I cook, I clean, I do dishes, I brush my teeth\nI do my laundry on my days off I have to do chores -- visits, appointments, etc.\nThen when I finally have any time to myself I just don't…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/v7san0/i_keep_watching_a_streamer_i_dont_particularly.json": "She's not boring, there are just a million things I'd prefer watching. However,\nI'm her only viewer, and I wanna give her more motivation to keep going, as she\nseems to really enjoy this. I can't figure out if this is morally wrong or not -\nit's a lie in a way, but one that helps. Should I keep…",
  "data/reddit-ask/r/AskHistorians/comments/v7zj25/why_do_americans_and_british_people_have.json": "I love watching cooking videos. Something that these videos usually account for\nis the different measurement systems and kitchen terminology between American\nand British audiences - cups vs ml, grill vs broiler, etc. But when dealing with\ncuts of meat, I've seen there's also a difference between…",
  "data/reddit-ask/r/askscience/comments/v7tk9k/if_twins_are_born_via_ivf_are_those_twins_any.json": "Either via genetics, epigenetics or any other factors.",
  "data/reddit-ask/r/AskHistorians/comments/v8448c/if_back_to_the_future_was_about_someone_from_the.json": "For instance, was there as stark a difference in pop culture, fashion and slang?\nI'm curious to know if Marty would be met with equal bewilderment if he played\nsomething at an 1850s dance that would only become popular 30 years later",
  "data/reddit-ask/r/AskHistorians/comments/v7yrev/where_does_the_phrase_pardon_my_french_originate.json": "My parents used to say this a lot before they would cuss \"pardon my French\" what\ndoes it mean? Were the French perceived as vulgar at some point? I thought\nFrench society was always highly regarded throughout the world. Thanks!",
  "data/reddit-ask/r/askphilosophy/comments/v7oo1n/is_gender_a_real_thing.json": "When it comes to gender identity, I find it very difficult to answer ‘What is it\nto be a woman/man’ without either appealing either to physical sex, or a set of\ntraits, characteristics or actions which aren’t shared by all.\n\nI think that if we have to say, to be a woman is to be a caregiver, a…",
  "data/reddit-ask/r/askscience/comments/v8e901/askscience_ama_series_hi_reddit_we_are_group_of.json": "TL;DR: A year ago, we did an AMA\n[https://www.reddit.com/r/askscience/comments/m5i6g5/askscience_ama_series_hi_reddit_we_are_group_of/]\nanswering science or technology questions on any topic from Reddit. We had a\nblast and so we're back again! So please ask us any questions any of you have to\ndo…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/v88wmv/my_dog_bit_a_mouse_one_time_and_left_the_mouse.json": "My dog is large, and took a single chomp on a small mouse/Vole. the hind legs\nwere unusable.\n\n\n\ni came back 10 minutes later to find it curled up, laying in the same spot. It\nran away like 3 feet and stopped, and could move pretty fast but its hind legs\nstill didnt look to be functioning.\n\n\n\nI…",
  "data/reddit-ask/r/askscience/comments/v803cc/how_do_things_like_arteries_stay_watertight_after.json": "When something like an artery is repaired and stitched together how does it\nbecome sealed? Is it just regular clotting the way blood repairs skin cuts etc\nor something else?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/v8edxj/is_it_just_me_or_is_inflation_making_me_not_care.json": "What's the point? Our wages aren't going up. Everything's expensive. It's\ndepressing ASF.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/v8eu0e/why_is_it_so_uncommon_to_see_older_women_in.json": "There's definetly a greater distribution of men dating women half their age than\nwomen doing the same. I've met plenty of women dating men at 10-20+ years their\nown age, but have never in my life met a man dating a woman older than himself\nby a similar gap. I'm sure there are plenty of men and…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/v8ad45/why_is_the_fashion_industry_dominated_by_gay_men.json": "It's something that I've always wondered. Why is there a natural gravitation of\ngay men towards fashion?",
  "data/reddit-ask/r/NoStupidQuestions/comments/v8g818/why_do_people_rag_on_usps_so_much_i_never_have.json": "Is it the hassle of the post office I guess? I don’t go often so that’s the only\nthing I can think of.\n\nIt’s ironic because people talk about it (at least people I’ve talked to) so\nnegatively, but out of FedEx, UPS, and USPS, I would pick USPS over all of them.\n\nMy ranking is USPS, FedEx, and then…",
  "data/reddit-ask/r/NoStupidQuestions/comments/v8dex9/why_is_flour_always_sold_in_a_paper_package_and.json": "- Sir, so we've got the flour you asked for.\n- Great, pack it in the shittiest paper packing you can get.\n- ???\n- And don't care too much about sealing the opening so it could spill a bit. Our\ncustomers will love it.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/v8knud/why_are_only_rich_white_countries_blamed_for.json": "I am from south Asia and this is something I've observed and find very\ninteresting.\n\nBy any standard rich Asian countries like Japan and Korea are incredibly racist.\nCompared to the racism experienced in the US and Europe the racism in these\ncountries is on a whole other level. People who are not…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/v8ntle/why_is_society_so_determined_to_not_let_people.json": "If we all die anyway why does it matter if some people choose to go earlier?\nSure, offer support services but at the end of the day what someone chooses to\ndo with their own life isn’t of anyone else’s concern.",
  "data/reddit-ask/r/NoStupidQuestions/comments/v8pegy/nsfw_whats_the_right_age_to_cuss.json": "My 2 sons (15) (13) came up to me and asked permission to be able to say s, d\nand b****. I don’t really have a problem with cuss words. I use them all the\ntime, and so does my wife. My boys made a presentation and explained that all\ntheir friends cuss, and they would like permission to be able to…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/v8okh2/why_is_it_okay_for_nonwhite_people_to_cosplay.json": "Genuinely curious. I just saw a white girl doing an amazing cosplay for Moana on\ninstagram and the comments were destroying her.\n\nEdit: I'm not talking about blackface, which I know it's wrong",
  "data/reddit-ask/r/TooAfraidToAsk/comments/v8opjj/why_its_so_hard_to_convince_communists_who_never.json": "Speaking as someone who lived under communism. Same story goes for Americans who\nlive in suburbs telling me that apartments are better, while I get 3 hours of\nsleep because apartments are shitty and you can hear every possible fart.\n\nJust tired of arguing with people who never experienced something…",
  "data/reddit-ask/r/NoStupidQuestions/comments/v8pysk/carbonated_water_tastes_bitter_and_horrid.json": "Carbonated water beverages seem to have been a hit lately. Parrier, bubly, other\nbrands.\n\nThey all taste absolutely horrible to me, even the ones with added flavorings.\nThey taste extremely bitter and chemically. Maybe it's the carbonic acid, but I\ndon't get this taste when I drink something like…",
  "data/reddit-ask/r/NoStupidQuestions/comments/v8kszi/does_anyone_else_remember_torturing_bugs_as_a_kid.json": "I was talking with some friends and we both had distinct memories of opening ant\nhills and throwing other insects in there just to see them get eaten alive. We\nalso talked of \"bug fights\" where we would get 2 bugs in a box and attemp to\nmake them fight. Did anyone else do fecked up stuff like that,…",
  "data/reddit-ask/r/AskHistorians/comments/v8m1s7/is_atheismagnosticism_a_purely_modern_phenomenon.json": "Do we have any information on how common it was for someone to believe religion\nas purely fiction in ancient times? Did humans just at some point start to doubt\nthe veracity of religious texts or were there always people thinking \"nah, this\nis just metaphors\"?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/v8vten/why_isnt_lobbying_illegal.json": "Isn't it literally legalized bribery?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/v92zwj/why_doesnt_anyone_care_that_the_wealth_of.json": "i just don’t understand. the fact that some people have been making $1.5 million\ndollars a DAY over the course of the pandemic while millions of people have\nstarved to death at alarming rates and died due to the effects of the climate\ncrisis. US homelessness has increased to a worse level than the…",
  "data/reddit-ask/r/askscience/comments/v94nzm/how_did_complex_systems_like_our_circulation.json": "I have a scientific background mainly in math and computer science and some\nparts of evolution make sense to me like birds evolving better suited beaks or\nviruses evolving to spread faster. These things evolve in small changes each of\nwhich has a benefit.\n\nBut a circulation system needs a number of…",
  "data/reddit-ask/r/TooAfraidToAsk/comments/v94dfs/is_it_true_that_other_inmates_kill_pedophiles_if.json": "I've seen some stories on here that say pedos are killed in prison and even the\nsecurity doesn't interfere, is it true?\n\nIf it is then yeah we should send all of them to prison and just let people who\nhave nothing to lose do the work. Cuz they the government doesn't give death\nsentences to them and…",
  "data/reddit-ask/r/AskHistorians/comments/v945pn/what_the_heck_happened_in_södertälje_sweden_in.json": "I recently moved from the US to Sweden and bought a house in Södertälje, a\nbeautiful city in Stockholm county with a lot of history. However, one of the\nbuildings in the city center has this mural [https://imgur.com/a/7kndcNs] on a\nkeystone. Clearly, something big went down that year but I haven't…"
}