{
  "data/reddit-know/r/YouShouldKnow/comments/pehyao/ysk_a_few_notes_for_those_who_wish_to_donate.json": "Why YSK: Your stuff isn't always valuable to someone in need or newcoming\nrefugees. Here's a few guidelines that will help your items get to its\nwell-intended destination:\n\n 1. If it's super used, falling apart, dirt covered - don't donate it. It will\n    end up in the trash! If you wouldn't donate…",
  "data/reddit-know/r/YouShouldKnow/comments/pf6ece/ysk_airport_police_can_jump_your_car_battery.json": "Why YSK: So recently, my wife and I flew back home from a week-long vacation.\nOur last flight home had gotten delayed three times. We were getting more and\nmore frustrated and tired.\n\nAfter 9 hours of traveling we finally land, grab our bags from baggage, and head\nto the car. My wife presses the…",
  "data/reddit-know/r/YouShouldKnow/comments/pf6y4y/ysk_that_breastfeeding_requires_learning_patience.json": "Why YSK:\n\nBreastfeeding initiation rates are reasonably high (e.g. 81% in UK), but they\nfall dramatically, by the end of the first day of life, they are already at 69%\n(again, UK based statistic). There is so much encouragement to initiate\nbreastfeeding, but often very little support to actually…",
  "data/reddit-know/r/YouShouldKnow/comments/pf9owz/ysk_the_ads_on_mobile_games_can_be_disabled_by.json": "Why YSK: i thought it was well known but my sister hadn't realised this, and\nneither had a few other people I told so just thought I'd share the ad-free joy\non here",
  "data/reddit-know/r/YouShouldKnow/comments/pfc8n8/ysk_if_grandparents_provide_child_care_while_you.json": "Why YSK- childcare in the US is often prohibitively expensive and family members\nthat provide free childcare might be able to get paid.\nhttps://reasonstobecheerful.world/helpr-app-employer-pays-babysitters-friends-family/",
  "data/reddit-know/r/YouShouldKnow/comments/pfgqfp/ysk_you_dont_need_to_meet_every_qualification_to.json": "Why YSK: most companies write job listings for perfect people that don't exist\nwith the intention of lowering their expectations as time goes on. This is\nprobably why your resume is being tossed out.\n\nI understand the title may seem like \"no duh\" thing to say, but I promise this\npost is worth…",
  "data/reddit-know/r/YouShouldKnow/comments/pfgtg0/ysk_someone_can_get_ptsd_or_ptrs_posttraumatic.json": "Why YSK: I was emotionally abused by my ex for around 8 months, at the end of it\nI always felt awful and had intrusive thoughts over which I practically had no\ncontrol over, my sleep was a mess, I couldn't enjoy daily activities and I felt\nlike I had no control over my mood. I think its important to…",
  "data/reddit-know/r/YouShouldKnow/comments/pg2zas/ysk_that_follow_onstage_2_formula_milks_are_not.json": "Why YSK:\n\nFirst stage/stage 1/newborn formula is fine for your baby up until 12 months and\nbeyond, if you wish. There are little, if any, differences between them and\nstage 2/follow on milks... The only reason milks such as stage 2/follow\non/hungry baby/growing up milks exist is to get around infant…",
  "data/reddit-know/r/YouShouldKnow/comments/pg6422/ysk_you_absolutely_can_use_soap_on_a_cast_iron_pan.json": "My mother, as well as the parents of everyone I know who cooks, instilled in me\nfrom an early age to NEVER ever use soap on the cast iron. I just discovered\ntoday that is not true. Lodge, a well known and well trusted cast iron brand,\nsays on their website that you absolutely can use a bit of soap…",
  "data/reddit-know/r/YouShouldKnow/comments/pg7gog/ysk_of_spotmute_an_android_app_that_automatically.json": "Why YSK: Spotify ads can be quite annoying, and this apps makes your listening\nexperience just a tad better.",
  "data/reddit-know/r/YouShouldKnow/comments/pgl6dt/ysk_that_you_dont_have_to_be_on_the_verge_of.json": "Why YSK: There is the stigma around suicide prevention that, you must be\npractically on the brink of death in order to call the suicide hotline. But the\nfact is they want you to call if you're even having thoughts about it. I called\na friend who works at a hospital. And before anyone answered the…",
  "data/reddit-know/r/YouShouldKnow/comments/pgm558/ysk_that_tomahawk_steaks_are_a_scam.json": "Why YSK: Tomahawk steaks are just ribeye steaks with extra bone, which looks\nneat in pictures, but you're generally paying a 40 to 80 dollar upcharge for\nthat piece of bone that does nothing to enhance the flavor of the steak. It's\nnot like you can eat that extra 12 inches of bone, it exists only to…",
  "data/reddit-know/r/YouShouldKnow/comments/pguobi/ysk_if_someone_is_6_weeks_pregnant_it_means_they.json": "Why YSK: In light of yet Texas’ insane abortion law, more people should\nunderstand just how restrictive it is…because I had no clue what ‘6 weeks’ meant\nuntil I was trying myself to conceive. When the 6 week abortion law is mentioned\nit often goes with the phrase “before many women even know they’re…",
  "data/reddit-know/r/YouShouldKnow/comments/pgznzq/ysk_you_can_cancel_pesky_monthly_subscriptions_by.json": "Why YSK:\n\nAlthough many monthly subscriptions can be easily cancelled in an account\nmanagement menu, others are much more difficult. A common tactic is a \"cancel my\naccount\" button that opens a popup with a phone number to call. The phone number\nmay involve confusing menus, long holds, or attempts…",
  "data/reddit-know/r/YouShouldKnow/comments/ph2ikd/ysk_the_satanic_temple_has_been_working_to.json": "Why YSK:\n\nJust like the majority of us, the Satanic Temple (TST) was well aware of the\ngovernment's momentum in contesting Roe v. Wade long before this mess in Texas\nhappened. Based on the precedent ironically set by the decision allowing Hobby\nLobby to deny birth control to their employees, TST has…",
  "data/reddit-know/r/YouShouldKnow/comments/ph671i/ysk_that_infants_tylenol_and_childrens_tylenol.json": "Why YSK: The concentration of actual medicine (acetaminophen) in both bottles\nare the same (160mg per 5ml). The dosage directions given on both bottles are\nthe same based on children's age and weight. Both packages will state \"ask a\ndoctor\" for kids under 2 years old. Which you should be doing, to…",
  "data/reddit-know/r/YouShouldKnow/comments/ph8fi0/ysk_that_when_in_heavy_traffic_and_a_lane_is.json": "Why YSK: It can be frustrating to be stuck in traffic when there is a lane that\nhas room and nobody seems to use it for fear of \"cutting in line,\" but if you\nuse it you are actually helping the flow of traffic!\n\nExerpt from the Missouri Department of Transportation…",
  "data/reddit-know/r/YouShouldKnow/comments/phb0e5/ysk_abortion_pill_access_available_by_mail_to_any.json": "YSK that if you are a person who wants to re-gain their period in the U.S., you\ncan get the abortion pill by mail up to 10 weeks pregnant for $110 from Europe\n(Aid Access). It is a legitimate doctor. You will have to answer some questions,\nthen pills will be prescribed to you and mailed from a…",
  "data/reddit-know/r/YouShouldKnow/comments/phehf3/ysk_a_permanent_and_reversible_male_contraceptive.json": "Why YSK: A lot of people are concerned about becoming pregnant, and the main\nnon-permanent birth control options that are over 90% effective\n[https://www.plannedparenthood.org/learn/birth-control] must be implemented by\nthe person with the uterus. For men a vasectomy is an option, but they…",
  "data/reddit-know/r/YouShouldKnow/comments/phgt6l/ysk_that_plan_b_and_female_condoms_might_be.json": "Why YSK: Free Plan B (morning after pill) and female condoms! Plan B is not an\nabortion pill. It prevents pregnancy before implantation.\n\nMy shitty insurance covered female condoms and Plan B (8/year). A doctor need to\nprescribe it.\n\nThe best success I’ve found is getting it prescribed from the pill…",
  "data/reddit-know/r/YouShouldKnow/comments/phm2t5/ysk_that_the_term_militarygrade_means_cheapest.json": "Why YSK: When normal civilians hear the term military-grade, they think that it\nis going to be a lot better than others (e.g. military-grade jackets are better\nthan other jackets) when that is not at all what it means.\n\nhttps://melmagazine.com/en-us/story/what-does-military-grade-mean-marketing",
  "data/reddit-know/r/YouShouldKnow/comments/pi1ync/ysk_if_you_get_a_refund_check_from_college_its.json": "Why YSK: If you do get a refund check, it's not free money, its just extra loan\nmoney that you're paying interest on - so don't waste it on $300 sneakers (as\nI've seen people do) or other frivolous things. Either spend it on school\nsupplies you need or save it as emergency funds and plan to pay it…",
  "data/reddit-know/r/YouShouldKnow/comments/pi2muz/ysk_it_can_take_upwards_of_2060kg_of_force_50125.json": "That's according to this study I found.\n[https://www.resuscitationjournal.com/article/S0300-9572(15]00145-8/pdf)\n\nWhy YSK: If you ever have to perform chest compressions (say, for an unconscious\nchoking victim or during CPR), you can't just rely on your upper arm strength.\nEspecially since you'll…",
  "data/reddit-know/r/YouShouldKnow/comments/pi626l/ysk_bobby_pins_are_designed_to_be_inserted_teeth.json": "Why YSK: Many people falsely believe they go in your hair \"teeth up\" and I was\none of those people until several years ago. They are very ineffective this way,\nbecause they are designed to hold hair with the \"teeth\" (ridged side, not the\nflat side) facing down, against your scalp. You will get a…",
  "data/reddit-know/r/YouShouldKnow/comments/pia37d/ysk_that_plan_b_is_not_a_pill_that_causes.json": "Why YSK: In light of recent events in Texas, I’ve seen a lot of people here on\nReddit confusing Plan B with abortion pills. They are not one and the same.\n\nPlan B, or Levonorgestrel, is a dose of hormonal birth control taken within 72\nhours of unprotected sex to prevent pregnancy, which is why it’s…",
  "data/reddit-know/r/YouShouldKnow/comments/pikdqz/ysk_that_if_youre_a_man_suffering_from_male.json": "Why YSK: The hair loss treatment industry is rife with scams such as topicals\nand supplements with no scientific backing whatsoever. The only FDA approved\ntreatments for treating androgenic alopecia (male pattern baldness) are\nFinasteride and Minoxidil. The latter however does not prevent further…",
  "data/reddit-know/r/YouShouldKnow/comments/pim9tf/ysk_you_can_save_a_lot_of_electricity_and_money.json": "Why YSK: It can save you lots of money each month.\n\n<30% humidity causes there to be a bigger heat difference between sunny and\nshady areas. You might get a better result from not allowing in direct sunlight\nthan if you had your AC blasting. If you are in a high humidity area, using a\ndehumidifier…",
  "data/reddit-know/r/YouShouldKnow/comments/pin9m7/ysk_you_take_out_the_other_person_in_a_sentence.json": "Why YSK: It's common for people to just think the sentence is \"and I\", but it\ncan also be \"and me\". For example, \"Marie and I went to the store\" take out\nMarie, \"I went to the store\" makes sense whereas if you say \"Would you like to\ncome to the store with Marie and I?\" it's incorrect because when…",
  "data/reddit-know/r/YouShouldKnow/comments/piopj0/ysk_there_are_inconspicuous_abortion_pill_options.json": "Why YSK - The state of the US is beyond crazy rn. Our rights as women are being\ncrushed .\n\nThere are mail options for plan c etc. You are not alone and we will get through\nthis . Two links below. Love to all of you women.\n\nhttps://www.plancpills.org/guide-how-to-get-abortion…",
  "data/reddit-know/r/YouShouldKnow/comments/pis3sb/ysk_a_crash_at_30mph_is_not_twice_as_bad_as_15mph.json": "Why YSK: The dangers of speeding are worse than you might expect, and, on the\nsame note, your odds at surviving a crash increase greatly at lower speeds.\n\nThis is because kinetic energy is proportional to velocity2 . So, when you\ndouble your speed, you quadruple your kinetic energy.\n\nWhen your car…",
  "data/reddit-know/r/YouShouldKnow/comments/pitrx1/ysk_you_can_grow_your_own_magic_mushrooms_in_most.json": "Why YSK: mushrooms have been used by civilisations throughout a long period of\nhuman history. They offer a profound, meaningful experience and are nearly\nthrough clinical studies to be used in psilocybin assisted therapy for\ndepression, PTSD, anxiety and much more. I could go on forever on the why…",
  "data/reddit-know/r/YouShouldKnow/comments/piwnff/ysk_nih_provides_free_access_to_scientific.json": "Why YSK: Just because someone did a web search and found an article with an NIH\n(National Institutes of Health) domain does not mean it is research done by the\nUS government agency. Look closely at the article. Near the title of the article\nyou will find the name of the journal that published it,…",
  "data/reddit-know/r/YouShouldKnow/comments/pixko0/ysk_you_can_view_your_listening_history_on_spotify.json": "Yesterday, I picked out some random playlist on Spotify which I liked the sound\nof. I decided to play it at my housewarming party. Unfortunately, I didn't have\nthe chance to save a lot of the songs I really enjoyed listening to while I was\nthere, however, I was pleasantly surprised to find one of…",
  "data/reddit-know/r/YouShouldKnow/comments/pixx5e/ysk_there_is_a_file_called_rockyoutxt_that.json": "Link to download the text file (133 MB):\nhttps://github.com/brannondorsey/naive-hashcat/releases/download/data/rockyou.txt\n\nWhy YSK: when trying to brute force your password, hackers will resort to lists\nof common passwords, and rockyou.txt is the most exhaustive and well-known\nsource. Those lists…",
  "data/reddit-know/r/YouShouldKnow/comments/pj2jzq/ysk_the_kitchen_garbage_disposal_rubber_drain.json": "WHY YSK: The underside of the garage disposal rubber flap that is at the\nentrance to the blades in a garbage disposal, periodically needs cleaned with\nbleach or other disinfectant solution due to build up of food and/or mold\ngrowing. I realized this today when I decided to clean mine. I'll never let…",
  "data/reddit-know/r/YouShouldKnow/comments/pj7hp3/ysk_fillio_will_allow_you_to_upload_pdfs_complete.json": "Why YSK: Adobe is a pain in the ass. Coming across this website today made my\nlife a lot easier and may help you too!",
  "data/reddit-know/r/YouShouldKnow/comments/pj7uug/ysk_do_not_let_your_cat_eat_rodents.json": "Perhaps you have heard about the scary disease that people can get from their\ncats: toxoplasmosis. Well the cats don't just get it from the air. They get it\nfrom eating infected rodents\n\nWhy YSK: To protect the health of you and your cat.\n\nhttps://pets.webmd.com/cats/toxoplasmosis-cats",
  "data/reddit-know/r/YouShouldKnow/comments/pjl69c/ysk_that_every_day_does_not_mean_everyday.json": "Why YSK: Knowing the difference in meaning here is not hard, but the difference\nis importance, especially when you are writing for work, where you want to make\nas few errors as possible, or even better no errors at all.\n\nEvery day means \"each day,\" as in \"Walking your dog every day for at least…",
  "data/reddit-know/r/YouShouldKnow/comments/pjn6ot/ysk_that_the_oft_cited_study_claiming_100.json": "How it is misunderstood: Many see the cited numbers and believe some greedy\ncabal is tanking the planet all by themselves. In some cases, it seems some even\nbelieve these companies are emitting for no demand-related reason at all. The\nreport, however, includes Scope 3…",
  "data/reddit-know/r/YouShouldKnow/comments/pjrila/ysk_that_if_your_apple_device_doesnt_bring_you_to.json": "Why YSK: Sometimes your Apple device doesn’t bring up the WiFi login portal.",
  "data/reddit-know/r/YouShouldKnow/comments/pjsvon/ysk_of_givedirectly_a_nonprofit_that_lets_donors.json": "Why YSK: people living in poverty deserve the dignity to choose for themselves\nhow best to improve their lives — cash enables that choice.",
  "data/reddit-know/r/YouShouldKnow/comments/pkdfeh/ysk_there_is_a_way_you_can_opt_out_of_preapproved.json": "Why YSK: If you are sick of receiving pre-approved credit card and personal loan\noffers, then there is an easy online tool that will prevent these companies from\nbeing able to send you these daily/weekly advertisements. You can find this tool\nonline by running a search for OptOutPrescreen. The tool…",
  "data/reddit-know/r/YouShouldKnow/comments/pkmeoo/ysk_we_are_able_to_limit_the_progression_of.json": "Why YSK: Myopia, or nearsightedness, is often the result of an eye that is too\nlong. The longer the eye, the higher the prescription, and the higher the risk\nof things like retinal detachment, glaucoma, and a certain type of macular\ndegeneration. This lengthening of the eye occurs as children grow.…",
  "data/reddit-know/r/YouShouldKnow/comments/pkoady/ysk_a_lot_of_newer_cars_have_a_soft_turn_signal.json": "The ‘soft’ signal is when you pull the turn signal before it clicks and it\nblinks just a few times (versus when you pull the lever fully you need to turn\nfor it to stop).\n\nWhy YSK: Signals are really helpful to alert other cars and pedestrians that\nyou’re going to change direction, which helps…",
  "data/reddit-know/r/YouShouldKnow/comments/pl16ke/ysk_dmachoiceorg_is_a_tool_you_can_use_to_opt_out.json": "Why YSK: In the US, an estimated 64.1 billion pieces of junk mail are sent each\nyear. It's all very wasteful. If you like getting marketing mail, great, but if\nyou don't please opt out.\n\n\n\nwww.dmachoice.org [https://www.dmachoice.org/index.php#]",
  "data/reddit-know/r/YouShouldKnow/comments/plbpxe/ysk_a_lot_of_the_volunteer_abroad_companies_are.json": "There are many companies that talk about how you can go to South America, Asia,\nand even Hawaii to help out but the truth is that they’re just money grabs for\nmiddle class young adults.\n\nUsually the programs have you pay them for “lodging and meals” but if you were\nto go to the place on your own you…",
  "data/reddit-know/r/YouShouldKnow/comments/pledlh/ysk_there_is_nothing_wrong_with_reminiscing_and.json": "Why YSK: It seems very common for people (myself included) to daydream about\npast accomplishments and experiences. When I used to do this a lot, it\ndefinitely held me back from seeking more. I seemed so content just reliving my\npast experiences in my head, I had no desire to achieve more!\n\nIt's not…",
  "data/reddit-know/r/YouShouldKnow/comments/plhwp0/ysk_deactivate_your_authenticators_when_getting_a.json": "Why YSK: if someone gets your old phone number, they will have access to your\n2FA and thus the accounts they are affiliated with. For example if this is your\nMicrosoft account, they would have access to your files in OneDrive, etc.\n\nFull credit: to…",
  "data/reddit-know/r/YouShouldKnow/comments/plnb5n/ysk_the_public_library_is_amazing.json": "WHY YSK: The public library is amazing. My family and I recently started going\nto the public library, and found out many unknown things about it. On top of\nrenting books you can rent movies on DVD and Blu-Ray, use the computers for\ninternet access, 3D print things for a tiny fee, rent video games…",
  "data/reddit-know/r/YouShouldKnow/comments/ploax4/ysk_insects_are_declining_at_a_precipitous_rate.json": "Why YSK: Insects are essential\n[https://www.nytimes.com/2018/11/27/magazine/insect-apocalypse.html] to most\nlife on earth, including our own. 75-95% of flowering terrestrial plants require\ninsects to procreate. Losing all of those plant species would be devastating to\nhumans.\n\nWhy we need insect…",
  "data/reddit-know/r/YouShouldKnow/comments/plphyk/ysk_that_how_your_partner_treats_their_family.json": "Why YSK: This goes way beyond gender and the phrase of “Watch how a man treats\nhis mother.”\n\nPay attention to the little things that they do or say around their family. It\ngoes a long way and can either save or hurt you.\n\nWhether they are raising voices or blowing up over tiny things or making…",
  "data/reddit-know/r/YouShouldKnow/comments/pls2kz/ysk_these_websites_if_you_are_a_broke_college.json": "Why YSK: I regret paying hard copies of all my books, especially after an online\nyear. Here is where you can usually find them.\n\n\nLIBRARY GENESIS\n\nThis is the go-to site for most ebooks. Some of the engineering textbooks comes\nwith the solution manual as well. Searching for the title + \"solution…",
  "data/reddit-know/r/YouShouldKnow/comments/plz7gk/ysk_the_us_national_park_service_uses_sled_dogs.json": "Why YSK: Awesome wholesomeness and fun watching of working dog puppies.\n\nhttps://www.nps.gov/dena/learn/photosmultimedia/webcams-pups.htm",
  "data/reddit-know/r/YouShouldKnow/comments/pm3bu1/ysk_women_can_have_different_kinds_of_orgasms.json": "Women can have orgasms through clitoral, G-spot, and anal stimuli, all of which\nfeel different. For men, yes, they do have a G-spot in their prostate, as well\nas penis related nerves that can cause orgasms.\n\nWhy YSK: Being aware of this can definitely help improve your sexual\nrelationship with your…",
  "data/reddit-know/r/YouShouldKnow/comments/pm8w0t/ysk_that_if_you_googlesearch_for_a_gift_card.json": "Why YSK: This morning I found a Target gift card in my closet. I Googled \"Target\ngift card balance\" so that I can see if it actually has money in it. The first\nresult was an ad, and I noticed that the website domain was totally unrelated,\nbut when I clicked on it, the page looked exactly the same as…",
  "data/reddit-know/r/YouShouldKnow/comments/pma25r/ysk_you_can_fight_deportation_in_court_with.json": "Why YSK: If you are a resident alien, you may be able to stop deportation. To\nqualify, you must be a nonpermanent resident alien, live in the US for at least\n10 years, show good moral character, and have a spouse, parent, or child that is\nlegal permanent resident whomst will be brough extreme or…",
  "data/reddit-know/r/YouShouldKnow/comments/pmcqhk/ysk_dont_use_a_highlighter_to_censor_information.json": "Why YSK: It doesn't work.\n[https://www.reddit.com/r/ios/comments/e25b7h/here_is_why_you_shouldnt_censor_sensitive_info/]\n\nThe opacity needs to be 100%, otherwise people can increase the contrast and see\nthe information you are trying to obscure.",
  "data/reddit-know/r/YouShouldKnow/comments/pmdhs5/ysk_that_if_you_put_4_spaces_in_starting_of_any.json": "Why YSK: Because it makes your text looks like typewriter and that looks cool.\nTry it out here\n",
  "data/reddit-know/r/YouShouldKnow/comments/pme1ee/ysk_coconut_oil_is_the_perfect_shaving_cream.json": "If you are anything like me and get cuts everywhere when shaving, applying\ncoconut oil (or other oil) generously beforehand really transforms the\nexperience. I have used shaving cream and foam before, but none have ever worked\nas well as this. Literally no cuts, no irritation - it's a game…",
  "data/reddit-know/r/YouShouldKnow/comments/pmexyk/ysk_bologna_hot_dog_and_bacon_have_been_linked_to.json": "Why YSK: Because these products are still readily available at the grocery\nstores and are being sold to you. If you see sodium nitrite as an ingredient on\nthe packaging label - don't buy it!\n\nEdit Source: 1) https://utswmed.org/medblog/cancer-processed-meat/\n\n2)\nhttps://www.who.int/news-room/q-a…",
  "data/reddit-know/r/YouShouldKnow/comments/pml6r6/ysk_that_you_can_watch_all_anime_on_crunchyroll.json": "Why YSK: Cruchyroll has like 3 ads brakes with each ad break having 3 ads for a\nsingle episode of any anime which is very annoying also cruchyroll has no policy\nagainst using vpn so why not enjoy more anime without getting region blocked.\n\nUBlock…",
  "data/reddit-know/r/YouShouldKnow/comments/pmpe3g/ysk_autism_can_manifest_in_many_different_ways.json": "Why YSK: There are a lot of stereotypes surrounding autism and autistic people,\nmany of which are exaggerated and negative, and trying to understand that autism\ncomes in different forms is an important step to removing the unnecessary\nstigmas surrounding the condition.\n\nEvery autistic person is…",
  "data/reddit-know/r/YouShouldKnow/comments/pmspz9/ysk_all_iphones_have_imei_numbers_in_both_their.json": "Why YSK: if you ever buy a used iPhone anywhere, there’s an extremely high\nchance it’s either stolen, someone’s old phone they don’t remember the info for,\nor not paid off. If you ask for the IMEI, you can make sure everything’s good\nand working on the phone. If the seller says they can’t access…",
  "data/reddit-know/r/YouShouldKnow/comments/pmus2g/ysk_not_all_power_strips_are_surge_protectors.json": "Why YSK: Power strips often look like surge protectors (aka “surge suppressors”)\nbut won’t protect your gadgets. Regular power strips are basically extension\ncords that will provide no more protection than your wall outlet.\n\nhttps://www.howtogeek.com/337896/whats-the-difference-between-a-power-strip…",
  "data/reddit-know/r/YouShouldKnow/comments/pmzgrr/ysk_that_in_the_united_states_it_is_illegal_for.json": "Why YSK: Pursuant to 29 U.S.C. §§ 151-169 it illegal for your employer to:\n\n 1. Discourage discussion between employees about their wages by saying things\n    like “here’s your raise, don’t talk about it to anyone”\n 2. Threaten to write an employee up for discussing their wages with coworkers\n 3.…",
  "data/reddit-know/r/YouShouldKnow/comments/pn0p9c/ysk_that_if_you_go_to_an_animal_shelter_you.json": "Why YSK:\n\nI started volunteering and they had us in this orientation - One big point was\nthat the kittens are in cages specifically to limit the chance that disease can\nspread. Even if one cat gets sick, it doesn't necessarily spread to the rest of\nthe room and won't carry to the other rooms.\n\nThis…",
  "data/reddit-know/r/YouShouldKnow/comments/pn5i1k/ysk_paraffin_candles_release_toxic_chemicals_into.json": "Why YSK: this. Paraffin candles are made from petroleum waste that has to be\ndeodorized and chemically bleached before it can be made into a candle. When\nparaffin candles are burned they release up to 20 different toxins into the air,\n2 of which are known carcinogens. Some examples include; toluene,…",
  "data/reddit-know/r/YouShouldKnow/comments/pn8vvm/ysk_how_to_wake_up_fast.json": "Why YSK It helps when you want to leave bed but you're still sleepy, lazy and\nall... Just hold your breath for a few moments and all the sleepiness will fade\naway.",
  "data/reddit-know/r/YouShouldKnow/comments/pnfj2s/ysk_you_dont_need_a_degree_in_any_science_field.json": "Why YSK: A lot of people are intimidated by critiquing science because they\ndon't have a degree. This video explains how to tell if an experiment in any\nfield is valid or not by spending only 17 days studying it. I use the field of\nPhysics and Einstein's theory of spacetime as an example, even…",
  "data/reddit-know/r/YouShouldKnow/comments/pngp2a/ysk_988_will_be_available_to_all_americans_in.json": "Why YSK: “Once fully implemented, 988 will save lives and is a critical\ncomponent to ensuring people in crisis are diverted from involvement in the\ncriminal justice system and connected to appropriate services and supports,”\nsaid Daniel H. Gillison, Jr, NAMI CEO. “The FCC has done it’s part. Now,…",
  "data/reddit-know/r/YouShouldKnow/comments/pngwuz/ysk_lightning_kills_more_people_than_tornadoes.json": "Why YSK:\n\nBe careful with lighting too. Its more dangerous than ppl give credit.\n\nJokes apart: On average, lighting kills more people per year than tornadoes.\nLighting can happen very randomly and we cannot hear or see the one that will\nhit. I wish there is more education about it\n\nPlease take…",
  "data/reddit-know/r/YouShouldKnow/comments/pnhe0n/ysk_is_your_amazon_prime_order_running_late_you.json": "It doesn’t sound like much, but it adds up… I’ve probably gotten around $100\nworth of promotional credits doing this, over the life of my Amazon account.\nNormally things arrive on time, but it’s not uncommon for them to take a few\nextra days.\n\nWhen the item doesn’t arrive, I just contact support and…",
  "data/reddit-know/r/YouShouldKnow/comments/po666y/ysk_type_1_diabetes_is_an_autoimmune_disorder.json": "Why YSK: People who live with type 1 diabetes constantly deal with\nmisconceptions which revolve around type 2 diabetes, which is much more\nprevalent in adults and the overweight. It's really a different disease, and the\nlack of understanding can be frustrating, especially when someone is…",
  "data/reddit-know/r/YouShouldKnow/comments/po8mpk/ysk_never_compliment_someone_on_weight_loss.json": "Why YSK: In most cases, best practice is just to never comment on someone's\nweight, even if you think you're giving them a compliment. This is for a couple\nreasons-\n\n 1. They might be losing weight not because they're trying to, but because they\n    are sick (be it physical or mental illness).…",
  "data/reddit-know/r/YouShouldKnow/comments/poazwa/ysk_a_prenuptial_agreement_doesnt_mean_you_think.json": "Why ysk. Most people think of prenups as an impending sign of divorce. Meant to\nprotect assets. It's not. Its just a detailed contract pertaining to marriage.\n\nMarriage is a contract not just a commitment to love each other, but also a\ncommitment to be together for life. That can take different…",
  "data/reddit-know/r/YouShouldKnow/comments/poc8e1/ysk_if_you_were_ever_in_a_car_accident_in_a.json": "Why YSK: I am an insurance adjuster, and I’ve seen way too many people just\nshare their information and Move on. Allowing people to change their stories\nlater on. But a police report with statements is admissible in court, and super\nhelpful for your insurance company during that investigation and…",
  "data/reddit-know/r/YouShouldKnow/comments/poozij/ysk_to_never_use_glue_traps_to_killtrap_pests.json": "Why YSK: As the weather begins to cool down this fall, little rodent, lizard,\nand snake friends might try and seek shelter in your home. Please don't set\nsticky traps for them if you notice their presence, as they are incredibly\ninhumane and lead to a slow agonizing death of starvation while…",
  "data/reddit-know/r/YouShouldKnow/comments/posue7/ysk_catnip_is_not_a_drug_and_it_is_not_dangerous.json": "People like to jokingly compare catnip to weed, crack, etc, because of cats'\nsometimes funny behavior after smelling or eating it. This widespread joke has\nled some people to mistakenly assume that catnip literally has the same effects\nas illicit drugs, and is therefore bad for a cat's health.…",
  "data/reddit-know/r/YouShouldKnow/comments/pou6ki/ysk_that_if_you_ever_find_an_animal_stuck_in_a.json": "Why YSK: Sometimes people set glue traps without realizing that anything can get\nstuck in them, and that it is a slow and agonizing death for the animal. But if\nyou ever do find an animal stuck in one, vegetable oil or any other oil found in\nyour kitchen can be used to loosen the glue and free the…",
  "data/reddit-know/r/YouShouldKnow/comments/povbt5/ysk_that_your_credit_card_statements_include_a.json": "Why YSK: Credit cards have really high interest rates, often that are variable\ndepending on your credit status, payment history, and spending habits. The\nminimum payment is mostly designed to cover interest on the purchases, with very\nsmall amount going toward principle. If you view your credit card…",
  "data/reddit-know/r/YouShouldKnow/comments/poyad7/ysk_what_social_anxiety_is_like.json": "Why YSK: It is a very common thing that a lot of people struggle with. And I\npersonally feel that it’s important to spread awareness regarding mental health\nas a way to reach out to those who are hurting, and also educate those who want\nto learn about it.\n\nHi everyone! So before I get into this I…",
  "data/reddit-know/r/YouShouldKnow/comments/pp23wl/ysk_that_women_often_endure_several_negative_side.json": "Why YSK: people often throw around taking birth control like it’s no big deal\nbut it actually can have a lot of bad side effects that can have a negative\nimpact on a women’s lives. Yes, we know it’s better than an unwanted pregnancy.\nBut it can be pretty brutal!",
  "data/reddit-know/r/YouShouldKnow/comments/pp4es7/ysk_to_always_read_service_dogs_vests.json": "Why YSK: Legitimate Service dog (SD) handlers often go to great lengths to keep\ntheir most important FAQ on patches of the SD's vest. If its important enough\nmore than likely the vest will say it somewhere. There are always exceptions but\nbelow is at least one example on why this may be really…",
  "data/reddit-know/r/YouShouldKnow/comments/ppep4p/ysk_keeping_appliances_and_other_items_plugged.json": "Why YSK: If you're on a tight budget, you can save up to $165 a year by\nunplugging appliances and other items when they're not being used (as opposed to\nsimply turning them off). This could include things like phone chargers, hair\ndryers, blenders, computers, rarely used lamps, etc.\n\nIt might be a…",
  "data/reddit-know/r/YouShouldKnow/comments/ppoxn3/ysk_to_book_a_vacation_rental_directly_with_its.json": "Why YSK: You can save significant booking fees by reserving a vacation rental\ndirectly through its property management company (if there is one), which\ntypically adds up to ~10% in savings.\n\n 1. Find a vacation rental on any website.\n 2. Reverse image search one of the listing photos to find all…",
  "data/reddit-know/r/YouShouldKnow/comments/ppsiin/ysk_that_if_you_ever_have_to_give_a_speech.json": "Why YSK? It can be tempting to tell your favorite stories about a person, but\nthey can sometimes be stories more about you than them and you may not realize\nit. In a formal setting this can very cringe and I don't think people realize\nit.",
  "data/reddit-know/r/YouShouldKnow/comments/ppu0bd/ysk_that_if_you_have_been_talking_for_some_time.json": "Why YSK: Because the other person is really just being nice and can't find a way\nout of the conversation without it being awkward especially if you are unloading\nyour life story to a person you just met for no more than 5 minutes. In work\nsettings, they are there to perhaps to do a job and on a…",
  "data/reddit-know/r/YouShouldKnow/comments/ppukup/ysk_proper_studies_only_provide_the_facts_proven.json": "Note: to keep it neutral, all hypothetical studies and arguments are made up\nnonsense. If I say something factually wrong in an example, it’s because I\nliterally made it up.\n\nI see this a lot and it really bothers me. If someone has an argument on say\nskin care that goes “hydroelectric massage…",
  "data/reddit-know/r/YouShouldKnow/comments/pq374m/ysk_educating_yourself_before_having_kids_can.json": "Why YSK: You should decide to have them because you want them, not because it's\nexpected of you or because you assume your kids will take care of you when\nyou're elderly.\n\nHaving kids is a blessing, but it's also expensive and takes a lot of time and\neffort.\n\nhttps://theconversation.com/baby-bust-5…",
  "data/reddit-know/r/YouShouldKnow/comments/pq5tn4/ysk_you_should_look_into_living_wills_dnrs_and.json": "Why YSK: Living wills and other advance directives are written, legal\ninstructions regarding your preferences for medical care if you are unable to\nmake decisions for yourself. Advance directives guide choices for doctors and\ncaregivers if you're terminally ill, seriously injured, in a coma, in the…",
  "data/reddit-know/r/YouShouldKnow/comments/pqlfdo/ysk_if_you_are_planning_to_add_more_flammable.json": "Why YSK: if you pour a flammable liquid such as lighter fluid, alcohol, or\ngasoline onto a fire, the flame is able to follow the fumes from the fire all\nthe way up to the bottle causing an explosion. This will lead to a bigger fire\nand…",
  "data/reddit-know/r/YouShouldKnow/comments/pqqi3y/ysk_that_you_should_always_look_at_your_poop.json": "Why YSK: I know, it's nasty and it smells and you just wanna see it gone, but\neven a person with no medical training at all can easily notice some early signs\nof very serious health problems by just taking a second to look at their own\npoop.\n\nCertain unusual smells, consistencies and most…",
  "data/reddit-know/r/YouShouldKnow/comments/pqubtu/ysk_the_oils_in_hot_peppers_like_jalapenos_or.json": "Why ysk: hot peppers oils can cause skin irritation and even burns. They can\nirritate the eyes, mucous membranes and genitals causing severe pain.",
  "data/reddit-know/r/YouShouldKnow/comments/pr2vtb/ysk_most_youtube_sponsorships_last_for_roughly_1.json": "Why YSK: most sponsorships on youtube last for 1 minute because that's the\naverage amount the sponsor usually requests, and you can just skip 1 minute\nahead confidently without missing out on much of the video.",
  "data/reddit-know/r/YouShouldKnow/comments/pr4xeb/ysk_most_car_bluetooth_phones_are_extremely_loud.json": "Why YSK: Because everyone outside of the car, walking by or even standing\noutside can hear everything you're saying regardless of if the windows are up.\n\nDefinitely don't discuss banking or any other confidential subjects or\ninformation on a bluetooth car phone because it is easy for someone outside…",
  "data/reddit-know/r/YouShouldKnow/comments/prki3o/ysk_the_heimlich_maneuver_for_your_animals_before.json": "Why YSK: when your animal is choking, it is extremely distressing and upsetting.\nYou don’t want to have to be googling how to help them while it’s happening.\nFamiliarize yourself so you’re prepared in case you are ever in a situation\nwhere your dog or cat is choking.\n\nThere are a few ways to perform…",
  "data/reddit-know/r/YouShouldKnow/comments/prtvle/ysk_that_alcoholic_drinks_are_freakishly_caloric.json": "Why YSK: Because if you want to stay healthy you have to be doubly careful about\nalcohol. Not only because of it's intoxicating and because drinking to excess\ncan damage organs. But it can also make you fat. So if you care about your\nweight, watch out how much you drink.\n\nI kind of always knew that…",
  "data/reddit-know/r/YouShouldKnow/comments/pryyoj/ysk_amazon_keeps_delivery_instructionsnotes_until.json": "Why YSK: First if you want to put gate codes, extra driving directions, where to\nput packages, safety concerns(dogs/roosters/theft), house descriptions,\napartment floor or things of that nature that don’t change you can type it only\nonce and never worry about it again because it’ll be on every…",
  "data/reddit-know/r/YouShouldKnow/comments/przt2w/ysk_have_an_allowance_for_yourself_have_it_be_a.json": "Why YSK: You can get into hobbies because of this, exercising because of this or\nwhatever. It can help you not to overspend on things while also letting you have\nsome fun.\n\nPut things on an Amazon Wish list and wait a week. See if you truly want those\nitems or not. Sometimes you might delete some of…",
  "data/reddit-know/r/YouShouldKnow/comments/ps3ha7/ysk_when_were_on_standard_time_and_when_were_not.json": "Why YSK: So you don't embarrass yourself at work, and so you can meet with\npeople at the right time.\n\n2-3 times a week I get an email from someone who wants to set up a meeting on\nEastern Standard Time. Half the year, that's cool. The other half the year,\nthose people don't know what they're talking…",
  "data/reddit-know/r/YouShouldKnow/comments/ps3yes/ysk_compose_longer_posts_and_comments_in_word.json": "Why YSK: When composing any internet post longer than a few sentences, don't\nrely on the forum's editor to hold your precious words and thoughts as you\nprogress. A careless button press, or connection issue, or editor bug WILL\neventually eat your work and leave you frustrated.\n\nType it in a word…",
  "data/reddit-know/r/YouShouldKnow/comments/ps82ym/ysk_if_you_have_a_fsa_account_you_can_donate_what.json": "Why YSK: Every year employees don't max out their FSA reimbursement, giving the\ncompanies money that you could use to help other people.\n\nFSA is a flex spending an account, a pool of money some employers have as a\nbenefit to reimburse medical related purchases. Typically they have a yearly\namount…",
  "data/reddit-know/r/YouShouldKnow/comments/pt72nn/ysk_if_a_coworker_comes_to_you_to_talk_about.json": "Why YSK: those persons do not discriminate, you are not different just because\nthey come to you.",
  "data/reddit-know/r/YouShouldKnow/comments/pt90q2/ysk_that_if_you_ever_have_a_disagreement_with.json": "Why YSK: If they say no, then nothing you can say or do will change their mind\nso there's no point in trying. You'll just be spinning your wheels so to speak.\n\nIf they say, \"I'm not sure, but I'm open to looking at whatever proof/evidence\nyou have.\" that's a completely valid response. Some people…",
  "data/reddit-know/r/YouShouldKnow/comments/ptb8dr/ysk_if_you_are_in_the_us_and_have_health.json": "Why YSK: If one of your procedures has been denied, it might be worth talking to\nwhoever is in charge of benefits in HR to change it in the future.\n\nIn 2020, 67% of covered workers in the U.S. were receiving coverage through a\nself-funded plan. (Linked source)\n[https://www.kff.org/report…",
  "data/reddit-know/r/YouShouldKnow/comments/ptdv0u/ysk_that_if_you_are_indoors_and_an_earthquake.json": "It is a common misconception that, due the risk of building collapse, you should\nattempt to leave the building when you feel shaking. This is EXACTLY WHAT YOU\nSHOULD NOT DO.\n\nThe official guidance is unanimous. In the event of an earthquake, do one thing\nand one thing ONLY:\n\n 1. DUCK beneath a…",
  "data/reddit-know/r/YouShouldKnow/comments/pte645/ysk_mortified_means_embarrassed_not_terrified.json": "Why YSK: Cuz I've seen the two confused a mortifying amount of times.",
  "data/reddit-know/r/YouShouldKnow/comments/ptfyoz/ysk_that_its_about_to_be_raptor_season.json": "Raptor Season is when adult hawks, owls, and eagles push this years babies from\ntheir territory.\n\nWhy YSK: young hawks, eagles, or owls may become more desperate and go after\nbarn kittens, chickens, or end up in your yard stranded\n\nEach year raptors have babies. But each raptor, or breeding pair,…",
  "data/reddit-know/r/YouShouldKnow/comments/ptuulu/ysk_people_will_respond_much_better_to_your_small.json": "Why YSK: Many people feel awkward when initiating small talk. It's also often\nawkward to have someone initiate small talk with you, at least initially.\nMentioning a time constraint gives both of you an out, reducing the pressure and\nrelaxing both of you into an easier conversation. If it goes well,…",
  "data/reddit-know/r/YouShouldKnow/comments/ptwcm2/ysk_your_dishwasher_is_far_more_energy_water.json": "Why YSK: This tip will save you time and money while helping the environment.\nDepending on the detergent you use, you don't even have to rinse the dishes\nbefore loading them, which saves you even more (just make sure to clean your\nfilter often).\n\nBonus: if you have an Energy Star dishwasher, it is…",
  "data/reddit-know/r/YouShouldKnow/comments/ptyi0a/ysk_in_the_eyes_of_a_delivery_driver_your_dog_is.json": "Why YSK: Dog bites are a very big problem when it comes to delivery drivers, And\nsimply saying your dog is friendly means nothing because essentially it's a\nstranger walking on your property that your dog does not know and it's behavior\nis not predictable in that situation.\n\nIt experienced driver…",
  "data/reddit-know/r/YouShouldKnow/comments/pu41p9/ysk_about_the_site_httpswwwdoesthedogdiecom.json": "Why YSK: On this site you can search for a movie or series and look if there is\nany content that might be hard for you to watch. As the name suggests you can\nlook if a dog dies in a movie/serie but it also covers other topics like\nspiders, vomit, torture, rape or cancer. The site collects…",
  "data/reddit-know/r/YouShouldKnow/comments/pu4srn/ysk_about_fundamental_attribution_error_and_how.json": "YSK about Fundamental Attribution Error which is the tendency for humans to\njustify our own behaviour or situation because we know the environmental factors\nthat have caused them, but to assume another person’s behaviour or situation is\nindicative of who they are as a person without consideration to…",
  "data/reddit-know/r/YouShouldKnow/comments/pu7y8k/ysk_that_apples_new_mail_privacy_protection.json": "If you use the Apple Mail App and enable MPP, here’s what happens: Apple first\nroutes emails through a proxy server to pre-load message content—including\ntracking pixels—before serving it to you. This happens even if you don’t\nactually open those emails.\n\nThis means that when you open an email, you…",
  "data/reddit-know/r/YouShouldKnow/comments/puaq66/ysk_that_you_should_not_rinse_your_mouth_out.json": "Why YSK: in movies and tv people always rinse their mouth out after brushing\ntheir teeth. But rinsing your mouth after you brush rinses away all the good\nstuff that protects them like fluoride. If you must rinse, take a small sip of\nwater and swish it around your teeth like mouthwash and…",
  "data/reddit-know/r/YouShouldKnow/comments/puhs4j/ysk_how_to_avoid_killing_animals_with_your_car.json": "why YSK: avoid death, suffering, guilt, a potential car accident, and potential\nvehicle damage.\n\n\n\nthe first thing you need to know about how to avoid hitting an animal is to\nexpect the animal to be on the road before it's on the road. complacency is the\nthing that kills most animals that wander…",
  "data/reddit-know/r/YouShouldKnow/comments/puq9gv/ysk_if_someone_offers_you_a_breath_mintgum_you.json": "Why YSK: They may be hinting that your breath is offensive and needs to be\naddressed. The worst that happens is you get a few extra calories (or they\npoison you idk).",
  "data/reddit-know/r/YouShouldKnow/comments/pusbj0/ysk_if_youre_given_a_school_or_countybased.json": "Why YSK: Us students know schools go absolutely overboard on website\nrestrictions. Completely locked down with browser management extensions and\nadmin blocks. For gosh-sake sometimes I just wanna scroll Reddit or watch Twitch\nwhen there's nothing else going on. And for those of you who a school…",
  "data/reddit-know/r/YouShouldKnow/comments/puvoxb/ysk_how_to_measure_with_an_accuracy_of_a.json": "Why YSK: Many things that you will need to cut with scissors, a knife, or a saw\nwill need to be precisely measured first. In many trades and professions in the\nUnited States, a sixteenth of an inch is accurate enough to be considered exact.\n\nIt's extremely difficult to explain in text how to read a…",
  "data/reddit-know/r/YouShouldKnow/comments/pv537y/ysk_that_calling_out_someone_as_having_a_logical.json": "Why YSK I have had a few attempts recently to talk to groups about controversial\ntopics, and instead of discussion just got a lot of accusations about being a\ntroll and had everything I said labeled as a logical fallacy, effectively\nshutting down the conversation.\n\nTry not to use these terms and…",
  "data/reddit-know/r/YouShouldKnow/comments/pv857p/ysk_if_a_company_makes_a_mistake_in_charging_you.json": "Why YSK: Coupons are designed in the interest of the company not you. You're\nprobably getting a bad deal from it.\n\nSome restaurant tried to reimburse the \"mistake\" in overcharging us with\ncoupons.\n\nMight look nice on the surface but its not. Aside from expiry date, there are\nmany huge limitations…",
  "data/reddit-know/r/YouShouldKnow/comments/pvaqms/ysk_these_websites_to_get_free_textbooks_and.json": "Why YSK: I regret paying hard copies of all my books, especially after an online\nyear. Here is where you can usually find them without paying a cent.\n\n\nLIBRARY GENESIS\n\nThis is the go-to site for most ebooks. Some of the engineering textbooks comes\nwith the solution manual as well. Searching for the…",
  "data/reddit-know/r/YouShouldKnow/comments/pvbrsh/ysk_not_liking_something_doesnt_mean_disliking_it.json": "Why YSK: often people ask questions like “Do you like X?” and many people will\nautomatically assume you dislike X when you say no. Sometimes it just means you\nare neutral, don’t care or don’t know enough to either like or dislike something\nor someone.\n\nI think people should know because we live in a…",
  "data/reddit-know/r/YouShouldKnow/comments/pvciam/ysk_human_resources_is_not_resources_for_humans.json": "Why YSK: Your company views you as a commodity and has an HR team to ensure that\nthe company stays in compliance with all laws and they do not get sued by their\npossessions. If you're bringing a complaint to HR they will immediately look to\nprotect themselves legally. They will NOT instinctively…",
  "data/reddit-know/r/YouShouldKnow/comments/pvee8e/ysk_you_can_bring_a_tab_in_your_browser_back_if.json": "Why YSK: I have accidentaylly closed so many tabs in my lifetime and it seems\nquite common for people to not know that you can just hit:\n\nShift control T\n\nIf you're on Mac it's\n\nShift command T\n\nToo many people seem to accept it's gone forever and spend a lot of time getting\nback to the website they…",
  "data/reddit-know/r/YouShouldKnow/comments/pviwo5/ysk_while_trying_on_clothes_in_a_store_make_sure.json": "Why YSK, it's easy to see and feel whether clothes fit while standing... so I\nused to think when I was younger. But to make sure that clothes fit and are\ncomfortable, make sure to sit down while you are trying them on",
  "data/reddit-know/r/YouShouldKnow/comments/pvrtfo/ysk_3000_mile_oil_changes_that_are_still_so.json": "Why YSK. I'm a British expat who moved to the USA 5 years ago. On every street\ncorner is a quick oil change place and I found out almost everyone changes their\noil at 3000 miles.\n\nWhy is this a waste?\n\n 1. This is a myth purported from the 60s and 70s, car engine technology and oil\n    technology…",
  "data/reddit-know/r/YouShouldKnow/comments/pw27nj/ysk_putting_soap_into_a_public_water_fountain_to.json": "Every year we see posts with some kids or drunks deciding it would be fun to\nthrow a little soap into a public fountain, and watch the chaos ensue. Sounds\nsilly and fun, and an impromptu suds dance party will just take a little extra\nwater to clean up so no harm, right?\n\nFountains use specialized…",
  "data/reddit-know/r/YouShouldKnow/comments/pw3dqc/ysk_before_you_decide_you_dont_like_a.json": "Why YSK: most fruits and vegetables sold in supermarkets are mass farmed\nvarieties and are picked well before they’re ripe, then shipped across the\ncountry, or world.\n\nCommonly sold fruits and vegetables, such as red delicious apples and carrots,\nare devoid of flavor and turn lots of people off of…",
  "data/reddit-know/r/YouShouldKnow/comments/pw3m1h/ysk_if_your_tooth_gets_knocked_out_you_can_save.json": "Why YSK: I’m a dentistry student and it came to my attention that not a lot of\npeople know you can save your tooth if it gets knocked out and it can grow back\nalive. For example in a fight or (sport)accident. If you don’t follow these\nsteps it reduces the chance of survival of your tooth…",
  "data/reddit-know/r/YouShouldKnow/comments/pwejx8/ysk_if_you_want_to_make_sure_your_egg_is_hard.json": "Why YSK: If it spins quickly it means that the inside is now solid and your egg\nis done. If it spins slowly and/or wobbles that means part of it is still liquid\nand you should boil it for longer.",
  "data/reddit-know/r/YouShouldKnow/comments/pwf508/ysk_you_shouldnt_hold_too_rigid_opinions_of_the.json": "Why YSK:\n\nInteracting with a closed and supposedly static population results in very rigid\nworld views and misconceptions that make you close minded even though the new\ninformation may actually be in your favour.\n\n——\n\nSocieties pass on information to younger generations through education…",
  "data/reddit-know/r/YouShouldKnow/comments/pwfb0m/ysk_just_because_you_are_not_a_kid_doesnt_mean.json": "Why YSK: adults can learn things faster than what they believe, and learning new\nthings and skills can be a very satisfying process on its own, but many people\nwished they had learned to play an instrument or some other skill but never do\nsomething about it because they feel that “it is too late”.…",
  "data/reddit-know/r/YouShouldKnow/comments/pwj4k1/ysk_reddit_is_not_a_substitute_for_a_therapist.json": "Wish someone had told me this earlier. Why YSK: If you’re having issues, go talk\nto someone who has the proper training to deal with whatever issue you’re\nhaving, not some random person on the internet. More often than not you will get\nunhelpful or wrong advice (or none at all, which only makes the…",
  "data/reddit-know/r/YouShouldKnow/comments/pwkw2g/ysk_you_should_avoid_using_dryer_sheets_or_fabric.json": "Why YSK: Many people use fabric softener and/or dryer sheets with every load of\nlaundry. This is not advisable when cleaning athletic wear in order to keep the\nathletic wear in optimal working condition.\n\nhttps://www.latimes.com/bestcovery/best-dryer-sheets",
  "data/reddit-know/r/YouShouldKnow/comments/pwuvxl/ysk_that_the_chrome_browser_now_tracks_if_youre.json": "Why YSK: This is a setting that is enabled by default with the latest release.\nThe concern here is that knowing you're not looking at a particular screen is a\nsignal that sites can use on you, for good (pausing a video when you're not\nwatching), or bad (your job using it to track your activity).\n\nIf…",
  "data/reddit-know/r/YouShouldKnow/comments/pwwc6b/ysk_the_rule_of_3s_for_survival.json": "As a general rule of thumb you can survive…\n\n3 minutes without oxygen\n\n3 hours without shelter in harsh environments\n\n3 days without water\n\n3 weeks without food\n\n3 months without rescue\n\n3 years without hope\n\nWhy YSK: This rule of 3s helps you remember what are priorities in times of\nsurvival and…",
  "data/reddit-know/r/YouShouldKnow/comments/pwypd6/ysk_there_is_a_breathing_technique_that_some.json": "Why YSK: While being able to sleep at will might come easy to some people, to\nothers (such as myself) it's very difficult. It's my hope that people who suffer\nfrom chronic insomnia or issues falling asleep might be able to use this\ntechnique to sleep more consistently. I also think it may prove a…",
  "data/reddit-know/r/YouShouldKnow/comments/px2aze/ysk_emails_received_that_look_like_they_are_from.json": "Why ysk: Scammers are plentiful on the Internet. I have recently been receiving\ne-mails claiming that my account has been compromised or that they have noticed\nsome suspicious activity on my account or whatever else these scammers come up\nwith. If you open their e-mail it looks legitimate, but it's…",
  "data/reddit-know/r/YouShouldKnow/comments/px6pwi/ysk_if_youre_looking_to_buy_a_smart_thermostat.json": "Why YSK: Here in Illinois we have ComEd that supplies our electricity. On their\nwebsite [https://secure.comed.com/marketplace/category/comed_smart_thermostats]\nthey also have a marketplace with a bunch of products that have instant rebates.\nRight now you can get a Nest thermostat for $1 and most…",
  "data/reddit-know/r/YouShouldKnow/comments/px9hfr/ysk_uber_eats_no_longer_refunds_cash_for_missing.json": "WHY YSK: Normally restaurants will correct their mistake by giving you the right\nfood, taking something off the bill, or refunding a portion of your money. Real\ncash is of course far more useful and less restrictive.\n\nBut Uber eats now only gives small Uber cash credits that can only be used…",
  "data/reddit-know/r/YouShouldKnow/comments/pxfpha/ysk_the_rules_for_driving_with_semi_trucks.json": "Why YSK: The semi truck is an unforgiving and deadly beast, and failing to pay\nrespect to it may be the last thing you ever do. If something goes wrong (which\nit does), and you are caught in the crossfire, you will die.\n\nRule #1: The semi always wins. Always.\n\nRule #2: When on the freeway, keep your…",
  "data/reddit-know/r/YouShouldKnow/comments/pxqiuy/ysk_that_staring_straight_and_far_ahead_can.json": "Growing up I got super car sick all the time. Any drive over 10mins I would feel\nnauseous and anything over 30 I would usually throw up. But a super helpful tip\nI learned to combat it is looking straight ahead, this helps balance the fluids\nin your ear that otherwise would cause car sickness. It…",
  "data/reddit-know/r/YouShouldKnow/comments/pxqvzd/ysk_that_most_helmets_for_biking_skateboarding.json": "Why YSK: so you and your kids don't die.\n\nHelmets are filled with what's called EPS foam (expanded polystyrene). EPS is a\nvery light but stiff foam similar to styrofoam. Once you deform or crush it, it\nstays that way.\n\nFrom epsindustry.org:\n\n> Unlike other types of padding, EPS foam does not bounce…",
  "data/reddit-know/r/YouShouldKnow/comments/pxtjse/ysk_assume_that_the_company_you_work_for_can_see.json": "Why YSK: This information can be used to fire you, and to deny your\nraise/promotion. Shortsighted HR departments are increasingly using this\nsoftware as the leading indicator of your value to the company above all else.\n\nSee the bottom of this post for things you can do to protect yourself from…",
  "data/reddit-know/r/YouShouldKnow/comments/py0fbz/ysk_that_men_very_rarely_are_on_the_receiving_end.json": "Why YSK: as a woman, I love lifting other women up. I make it a personal goal to\ngive 10 compliments per day either in person or online BUT I very very rarely\ncompliment men due to past trauma from the hands of a man and now I have a\ngeneral fear of them. I am in therapy and working on it. Anyway,…",
  "data/reddit-know/r/YouShouldKnow/comments/py0sv5/ysk_that_in_most_jurisdictions_the_crime_of.json": "Every time there is a video of an idiot punching someone for no good reason or\nspitting on them or otherwise making unlawful contact, all the comments yell\nout: \"That's assault!\"\n\nI know it's incredibly pedantic of me to be bothered by this, but that is a\nbattery. Yes, some jurisdictions have…",
  "data/reddit-know/r/YouShouldKnow/comments/py6pi7/ysk_bags_are_like_lottery_tickets_for_thieves_and.json": "Why YSK: Leaving backpacks, purses, briefcases, or other bags in your car is an\nopen invitation for window-smashing thieves. You can avoid having to replace\nyour windows, bags, and other stolen valuables by taking your bag with you or\nputting it in your trunk instead – the few seconds it takes to do…",
  "data/reddit-know/r/YouShouldKnow/comments/py6zmk/ysk_if_i_dont_have_the_right_of_way_dont_yield_to.json": "I know you are trying to be nice but your unpredictable driving can put other\npeople at risk.\n\nWhy YSK: While people not yielding when they should yield is much more common,\nseveral times now since moving out to California when I've been waiting to pull\nout from a parking lot I've had people hard…",
  "data/reddit-know/r/YouShouldKnow/comments/pybhf0/ysk_that_silent_pauses_are_normal_in_a.json": "Why YSK: Silence is considered to be negative by some people, but we need to\nthink of silence more as a way to slow down and think about our responses. It\nhelps if we can accept other people's silences as \"time to think\" instead of\n\"judgement\" or \"disagreement.\" Some of us tend to chatter when we're…",
  "data/reddit-know/r/YouShouldKnow/comments/pykc5x/ysk_your_employer_can_see_everything_you_do_on.json": "Why YSK: The bigger your employer, the bigger their security budget and\nregulatory compliance requirements AKA they have to keep more records, which\nincludes everything you do on your computer. I work in Cybersecurity &\nCompliance, and the number of people who simply don't realize the…",
  "data/reddit-know/r/YouShouldKnow/comments/pym44m/ysk_that_if_you_struggle_with_extremely_cold.json": "Why YSK: I've struggled with numb/cold hands in quite literally any ambient\ntemperature less than 10C (50F) for most of my adult life. I had to use a\ncombination of mittens and chemical hand warmers for winter, because my hands\nstill wouldn't stay warm in regular gloves. I thought this was just a…",
  "data/reddit-know/r/YouShouldKnow/comments/pyqcze/ysk_if_youre_ever_in_a_plane_that_crashes_into.json": "Why YSK: During the safety demonstrations on aircraft equipped for overwater\noperations flight attendants will tell you to not inflate your lifevest until\noutside the aircraft. This is not only because doing so in the aircraft will\ntake up space for other evacuees, but because in a rapidly filling…"
}