{
  "data/reddit-crypto/r/CryptoCurrency/comments/shh81u/i_see_it_now_most_of_us_are_neither_investors_nor.json": "I had a post last day advising people to be either a trader or an investor and\ngod did it get some crazy reactions! Half of you said we are both. Another half\nwere pissed (don't tell us what to do!). Out of five hundred comments and more ,\nonly a handful understood what I was actually saying.\n\nLet…",
  "data/reddit-crypto/r/CryptoCurrency/comments/shiy2o/is_ethereum_still_worth_the_investment_a_deeper.json": "ETHEREUM\n\n2021 was a fantastic year for crypto, in particular Ethereum. Ethereum reigns as\nthe second-largest blockchain despite the slew of competition from Binance SC,\nSolana, Avalanche. But it remains far ahead showcased by various metrics, and\nthere are no signs of slowing down.\n\nTOTAL…",
  "data/reddit-crypto/r/CryptoCurrency/comments/shomjg/indian_government_announces_it_will_bring_crypto.json": "Indian government just announced that crypto will be taxed at 30% of gains. This\nis the first time the Indian government is discussing crypto taxation. The tax\nwill apply to all gains on digital virtual assets, and no capital losses will be\nallowed. Business expenses will also not be…",
  "data/reddit-crypto/r/CryptoCurrency/comments/shgmmb/bored_apes_have_reached_a_floor_price_well_above.json": "Honestly, I wonder who could have seen it coming. People are spending thousands\nof dollars on Monkey jpegs, and get rewarded for this moronic behavior with\nbetter return rates than almost any other asset can provide. Maybe it's a sign\nthat instead of investing in utility and smart concepts, people…",
  "data/reddit-crypto/r/CryptoCurrency/comments/shq9na/ill_admit_it_i_didnt_trust_you_guys_about.json": "Last few days, I've been playing around on Algorand experimenting with a lot of\nstuff. AND I LOVE IT. Silvio Micali really knows his stuff. This network is an\nabsolute rocket and costs nothing.\n\nAmong other things I also tried the \"famous\" NFT on Algorand. What a crazy\nthing. It costs close to…",
  "data/reddit-crypto/r/CryptoCurrency/comments/shqevq/creators_of_nft_project_doodled_dragons_promised.json": "A Solsea-verified NFT project on the Solana Blockchain, Doodled Dragons\nannounced that they would distribute all profits \"straight to charities\nprotecting animals on the brink of extinction\".\n\nThey announced on Twitter that they would be donating $30k, \"our first donation\nto the World Wildlife…",
  "data/reddit-crypto/r/Bitcoin/comments/shnu7k/economics_professor_asked_whats_the_point_of.json": "Today at my university class, the professor asked “whats the point of bitcoin?”\nThe room was somewhat silent, then some responses about it being purely for\nspeculation pop corned around the room. I sat in silence while he proceeded to\nslander btc and state multiple points of false information, such…",
  "data/reddit-crypto/r/CryptoCurrency/comments/shw6sa/you_guys_understand_that_el_salvador_wants_13.json": "Two posts are on the front page right now: \"El Salvador angrily rejects IMF call\nto drop Bitcoin use\"\n[https://np.reddit.com/r/CryptoCurrency/comments/she2t3/el_salvador_angrily_rejects_imf_call_to_drop/]\nand El Salvador Treasury Minister Alejandro Zelaya angrily rejects IMF demand to\ndrop Bitcoin…",
  "data/reddit-crypto/r/Bitcoin/comments/shrxge/criticizing_bitcoin_for_its_high_energy_use_is.json": "Bitcoin is energy. Its high energy use is an investment. Bitcoin miners securing\na huge network is a good thing.",
  "data/reddit-crypto/r/CryptoCurrency/comments/si1abt/you_dont_need_to_convince_nor_argue_with_anyone.json": "I’ve seen a lot of opinions thrown out here, whether you should or shouldn’t\ntell your family, friends, neighbours about crypto.\n\nThe general consensus of this subreddit is always: “DCA and HODL!” Yes, the past\nalready proved that it’s one of the best if not the best strategy out there. But\ndo we…",
  "data/reddit-crypto/r/CryptoCurrency/comments/si3m4a/why_you_should_make_xmr_part_of_your_portfolio.json": "I’m sure that a lot of you have heard about Monero (XMR) and that it is\nPrivate/Untraceable [https://imgur.com/a/Skb5L4q] and most commonly used in\n“boating accidents” but there’s more to XMR then just that and it’s potential\nuse cases are solid\n\nA lot of people seem to have this understanding that…",
  "data/reddit-crypto/r/CryptoCurrency/comments/si4p19/it_will_never_sit_right_with_me_this_double_tax.json": "9-5 people, perhaps not living paycheck to paycheck, but someone who's not more\nthan half a year of unemployment away from having their life turned on its head\n- These people are not going to get much better off by working, nor by saving\nmoney in the bank. They don't have wealthy relatives so…",
  "data/reddit-crypto/r/Bitcoin/comments/shy3vj/how_many_of_you_actually_hold_only_bitcoin.json": "I understand this is a bitcoin sub, but there is no way you ONLY hold Bitcoin\nright?",
  "data/reddit-crypto/r/CryptoCurrency/comments/sib6ur/the_concept_of_nfts_is_valuable_but_a_jpeg_is_not.json": "In fact, I don’t think these JPEGs should be valued for more than 5 digits. And\nmost of the time its not the market that’s setting these prices. They’re usually\ninorganically inflated.\n\nThis is exactly why NFT like Bored Apes are so hated. I think the only valuable\nthing about Bored Apes is the…",
  "data/reddit-crypto/r/CryptoCurrency/comments/si8krl/an_addiction_will_ruin_your_crypto_trading.json": "I wanted to raise awareness on this, because I think there isn't much\ninformation out there on this topic (at least it hasn't come across me).\n\nThe thing is, when it comes to addictions, the vast majority of them trigger\ndopamine, when you do that particular activity. That's the main reason why…",
  "data/reddit-crypto/r/CryptoCurrency/comments/siicsk/teach_a_man_how_to_stake_and_he_shall_enjoy.json": "There are a lot of people who buy and only HODL your coins and tokens. This post\nis for those of you that do.\n\nWhat is staking?\n\nStaking is a mechanic where you lock up your cryptos and generate passive income\nas you are helping to secure the blockchain through said mechanic. So you don't\nhave to…",
  "data/reddit-crypto/r/CryptoCurrency/comments/sipu9k/popular_rapper_gunna_shilled_a_shitcoin_pushingp.json": "Here's the deleted tweet where he's supporting the coin.\n\nGunna's Tweet.\n[https://preview.redd.it/w7el1hargff81.jpg?width=1283&format=pjpg&auto=webp&s=e5ec1a86f4cea052f178f54d12773f9b9938e1ed]\n\nAfter shilling this shitcoin he tweeted again with \"I wunna C Everybody Win\"\nwhich is kinda ironic since…",
  "data/reddit-crypto/r/CryptoCurrency/comments/siv00k/update_to_my_country_announcing_3_years_jail_for.json": "Original\npost:https://np.reddit.com/r/CryptoCurrency/comments/sanct2/my_government_announced_1_year_jail_time_for/?utm_source=share&amp;utm_medium=ios_app&amp;utm_name=iossmf\n\nI contacted many Embassies and they didn't approve when I applied for political\nasylum.I have been staying off this Reddit…",
  "data/reddit-crypto/r/CryptoCurrency/comments/siyhjx/every_country_in_the_world_is_in_debt_the_global.json": "Every country in the world is in debt, some much more than others\n\nThe US national debt is $30 Trillion, China $7 Trillion, Russia $0.5 Trillion,\nIndia $2.3 Trillion\n\nSome smaller countries have staggering debt levels, for example Japan has debt\nof 235% it's GDP.\n\nI think most of this the debt is…",
  "data/reddit-crypto/r/CryptoCurrency/comments/sivx1j/so_wtf_happened_to_loopring_its_almost_80_down.json": "2-3 months ago it went 0.5$ to 3.7$,everyone were saying it will reach 10$ by\nEOY. Now it's around 0.70-0.90$,almost 80% down from ATH. I know most of alts\nalso crashed but not that much. Is hype finished? Did devs rugpulled? Did they\noverhyped and not deliver? I don't get it..\n\nI know LRC devs…",
  "data/reddit-crypto/r/CryptoCurrency/comments/sj0nb0/moons_are_definetly_a_sitcoin_no_utility_no.json": "This sub is very anti-shitcoin and sure why shouldn't it be, people are thinking\nsome just made shitcoins are a better investment than some utility crypto. Over\nthe longterm the utility always wins and hype leaves.\n\nBut thus subs own crypto MOONS are also, definitely, a shitcoin. It's far away\nfrom…",
  "data/reddit-crypto/r/CryptoCurrency/comments/sj013u/the_whales_arent_selling_smaller_investors_are.json": "A lot of people left the Crypto market in fear of a Crypto winter. However, the\npeople who did not leave are the ones who went through at least 2 Bitcoin bull\ncycles and the whales. A 45% steady price decrease is nothing but an\naccumulation strategy, and we can see this across the board with…",
  "data/reddit-crypto/r/CryptoCurrency/comments/sj59mf/the_irs_may_not_tax_crypto_earned_through_staking.json": "In May of last year Josh and Jessica Jarrett requested a refund of income tax\nthey paid on Tezos staking rewards in 2019. (Around $3200 for approximately 8800\nTezos tokens)\n\nToday, the IRS has decided to issue that refund.\n\nThey will not refund any amount that was sold obviously but the couple…",
  "data/reddit-crypto/r/Bitcoin/comments/sixbuk/i_did_my_first_serious_bitcoin_purchase_today.json": "I’m sure no one cares but Im happy about it.",
  "data/reddit-crypto/r/CryptoCurrency/comments/sj16yr/which_coin_gave_you_completely_lost_faith_in.json": "After a few false starts, I’ve condensed my portfolio into coins I fully believe\nin. Time will tell if they are good choices are not, but for now I’m confident.\n\nThe biggest cut i’ve made is Solana, thankfully before the January crash kicked\nin. I didn’t make any money, but I didn’t lose any…",
  "data/reddit-crypto/r/CryptoCurrency/comments/sjfad1/solana_is_the_mcdonalds_ice_cream_machine_of_the.json": "I tried to give this chain the benefit of the doubt multiple times yet it always\nseems to fail my expectations.\n\nEither it’s down cause its out of RAM, got attacked by a DDOS and now it got\nhacked. There’s always something wrong with this chain.\n\nHonestly I feel like it’s one of the most overhyped…",
  "data/reddit-crypto/r/CryptoCurrency/comments/sjgkhx/crypto_isnt_going_to_magically_make_you_rich_get.json": "This is probably a massively unpopular option.\n\nI see a lot of people on this sub saying that crypto is their path to financial\nfreedom, early retirement and a lambo. Many of these people boast a portfolio of\nup to 100% in crypto.\n\nIf you don’t have much invested to begin with, let’s say $10,000 or…",
  "data/reddit-crypto/r/CryptoCurrency/comments/sjk2i0/i_recently_acquired_80000_eth_for_a_very_very.json": "Yesterday, I was doing some good old arbitrage trading between Solana and\nEthereum, and I managed to get my hands on 80,000 ETH for a really low price -\nso low, in fact, that you wouldn't believe me if I told you how I pulled off\nthis deal.\n\nNow I don't know what to do with all this ETH. It's worth…",
  "data/reddit-crypto/r/CryptoCurrency/comments/sjfwrz/btc_mining_contributes_to_a_staggering_008_of.json": "According to digital investing firm CoinShares, BTC miners contribute to 0.08%\nof the world's Total carbon dioxide (CO2) emissions.\n\nAlthough 0.08% might seems small, we are talking about the Total CO2 emmisions\nworldwide... this is not little at all. Especially not now we are dealing with a\nharsh…",
  "data/reddit-crypto/r/CryptoCurrency/comments/sjerjo/crypto_companies_publishing_research_reports.json": "Today (maybe a few days ago? I saw it posted today), a company called\n\"CoinShares\" published a report\n[https://coinshares.com/research/bitcoin-mining-network-2022] that tries really\nhard to push the narrative that BTC is totally not bad for the environment and\nthat all of that is FUD.\n\nWho is…",
  "data/reddit-crypto/r/CryptoCurrency/comments/sjn58u/why_facebook_should_not_be_allowed_to.json": "In yesterday's Facebook earnings report of 2021 Q4, this is what they disclosed\nabout future earning projections.\n\nWe expect first quarter 2022 total revenue to be in the range of $27-29 billion,\nwhich represents 3-11% year-over-year growth. We expect our year-over-year\ngrowth in the first quarter…",
  "data/reddit-crypto/r/CryptoCurrency/comments/sjul4i/bitcoin_is_the_broccoli_of_this_sub.json": "You know Broccoli won't hurt you. On the contrary, it would be very very healthy\nto eat broccoli more often.\n\nInstead, you keep reaching for one of the thousands of sweets that seem so\ndelicious. They have such interesting names and the packaging says all sorts of\ngreat things. When you're out…",
  "data/reddit-crypto/r/CryptoCurrency/comments/sjxf29/how_can_i_acquire_moons_as_a_lurker.json": "I like the idea of moons although there seems to be absolutely no use for them\noutside of getting special features in this sub? I also don't have much to\ncontribute to the CC sub. I enjoy reading the discussions and seeing the\npanic/anger that ensues with the market fluctuations, but besides…",
  "data/reddit-crypto/r/CryptoCurrency/comments/sk0fix/since_facebookmeta_lost_237_billion_in_market.json": "Meta also said the augmented and virtual reality business at the heart of its\nmetaverse plans is generating revenue but is unprofitable. \n\nI would expect a price drop in the three following cryptos as they are\nassociated with the meta verse.\n\n-Mana -Sand -AXS\n\nI'm calling it right now, the…",
  "data/reddit-crypto/r/CryptoCurrency/comments/sk2rg0/the_320m_wormhole_hack_was_replenished_by_jump.json": "Yesterday, the Wormhole bridge one of Solana's biggest bridges lost $320m in a\nhack. Within hours, a trading desk Jump Capital agreed to replenish the entire\namount so that the liquidations calamity is avoided. The loss of the peg due to\nthe hack could have sent the network into cascading…",
  "data/reddit-crypto/r/CryptoCurrency/comments/sjwzgk/why_do_people_invest_in_sol_when_cryptocurrencies.json": "It's common knowledge here that the SOL network goes down frequently, gets\nhacked, doesn't work etc yet people still continue to invest in it. Christ if\ntraditional banking was this flakey the government would haul it over the coals\nand watch it burn.\n\nYet people still invest in this centralized…",
  "data/reddit-crypto/r/CryptoCurrency/comments/skabfn/there_is_nothing_wrong_with_paying_taxes_on_your.json": "I see it too often here that people aren't so happy with paying capital gains\ntaxes on their crypto, which is worrying because at the end of the day we want\neveryone to benefit from major crypto adoption, even those who aren't able to\ndirectly benefit hence why taxes are important.\n\nThe benefits of…",
  "data/reddit-crypto/r/CryptoCurrency/comments/skh83b/it_doesnt_matter_if_you_agree_with_your.json": "Tax Fraud is serious\n\nFirst of all no government is perfect there will always be some degree of\ncorruption and wasteful spending. As for actually agreeing with how your\ngovernment spends money, most people don’t, that’s why there are differing\npolitical parties.\n\nLive in a third world dictatorship…",
  "data/reddit-crypto/r/CryptoCurrency/comments/skhyo2/hats_off_to_kraken_who_now_let_users_verify_that.json": "While I'm not the biggest fan of centralized exchanges, I think it's still the\nbest way for noobs to learn about crypto. In this sense, the trust relationship\nbetween holders and CEXs is crucial: when you buy BTC or ETH, you want the\nexchange to actually own these tokens.\n\nThat's why I was very…",
  "data/reddit-crypto/r/CryptoCurrency/comments/sknd3a/40k_has_been_breached_repeat_40k_has_been.json": "We all know that there's such a thing as a bear market, but where is it? I don't\nsee it, that's because it's a myth from the days of old and we're men of science\nand reason now. You see, we're in a new age in the crypto world, it's called the\nbull summer, basically get your umbrella drinks out…",
  "data/reddit-crypto/r/CryptoCurrency/comments/skjq3a/over_100_million_shorts_liquidated_over_the_last.json": "According to data from Coinglass [https://www.coinglass.com/LiquidationData] 88%\nof the total liquidated positions during the last four hours were shorts. This\nfigure may change quite a bit as it was 85% when I started writing this post and\nnow it's at 88%. The 122 million figure may change as well…",
  "data/reddit-crypto/r/CryptoCurrency/comments/skm0fa/a_crypto_short_squeeze_might_be_happening_right.json": "Bitcoin seems to have shot past its $40k barrier in a matter of hours, and it is\nlikely to continue considering how many people are shorting the market right\nnow. Crypto hasn't yet lost its steam and it was dragged down by the stock\nmarket for the past few days. This has accumulated A LOT of…",
  "data/reddit-crypto/r/CryptoCurrency/comments/skm2km/you_know_the_markets_pumping_when_the_exchanges.json": "Title says it all, tried to look at my portfolio on Coinbase just now and what a\nsurprise:\n\n\nINVESTIGATING LATENCY\n\n\nWE'RE INVESTIGATING LATENCY ON COINBASE.COM AND THE MOBILE APP AND DIFFICULTY\nWITH TRADES / PAYMENTS. OUR TEAMS ARE WORKING TO RESTORE FULL SERVICE ASAP.\n\nInteresting that the…",
  "data/reddit-crypto/r/CryptoCurrency/comments/skikem/this_pump_feels_weird_to_me.json": "Bitcoin had a pretty big pump today and the chart looks pretty good lately.\nMaybe I have PTSD from all the failed rallies lately, but it's giving me a weird\nfeeling.\n\nGetting back above 40K, with an RSI above 50 is a good sign, whales have been\nbuying according to Will Clemente's on chain…",
  "data/reddit-crypto/r/Bitcoin/comments/skhyo5/does_anyone_know_the_cause_of_todays_7_pump.json": "It went from 37 to 39 in a few minutes. Any known reason? Big news or some short\nsqueeze?",
  "data/reddit-crypto/r/CryptoCurrency/comments/skxpr7/blockfi_horrible_loan_experience_fortune_lost.json": "Took out a loan for $300K and put up 600K worth of BTC as collateral. Market\nkept going down so I kept posting collateral as needed to keep the loan healthy.\n\n\n\nI got an email saying that the loan was being called back because of \"indirect\nexposure to a mixing service\"\n\n\n\nI appealed the decision…",
  "data/reddit-crypto/r/CryptoCurrency/comments/sl2kun/its_incredible_how_quickly_a_few_green_candles.json": "I don't want to come off as a killjoy; I'm as hyped as anyone here. But it was\nonly a few days ago when everyone thought we were in the middle of a bear\nmarket, a few green candles later and it's posts calling for altseason and short\nsqueezes. It's insane what one day of green does to people. Pumps…",
  "data/reddit-crypto/r/CryptoCurrency/comments/sl3h00/why_i_believe_we_are_all_still_a_decade_early_to.json": "This post is a serious one I made after reading this article. [\nhttps://moxie.org/2022/01/07/web3-first-impressions.html ]\n\n> Shout out to Moxie for actually talking about how shit has just become super\n> overcomplicated for coders to even begin to get into. This article is probably\n> the best…",
  "data/reddit-crypto/r/CryptoCurrency/comments/sl6cmh/have_you_ever_heard_an_intelligent_wellspoken.json": "Exactly. 90% of the criticism you read about blockchain, web3, etc is written by\npeople who literally do not know what it is or how it works. Obviously, if you\ndo not know how something works, you can't see potential in it in terms of what\nit can do. If you think the limits of NFTs are jpegs of…",
  "data/reddit-crypto/r/CryptoCurrency/comments/sl4zki/congrats_to_beginners_who_survived_the_dive_under.json": "Hey, to all who didn't sell under 40K, congrats!\n\nWe are still far away from ATH BUT you are not one of those who sold at a loss\nin order to swing trade. The climb is not yet achieved and we may dive further\nbut you have shown your balls of steel and deserve recognition.\n\nBonus points if you bought…",
  "data/reddit-crypto/r/CryptoCurrency/comments/sl4rdn/btc_has_just_undone_a_months_worth_of_decline_in.json": "It never closes and that's probably where the obsession lies for so many:\nthere's no weekend or nighttime reprieve from the upticks and downticks. You\nknow that when you go to bed and when you wake up in the morning something will\nhave changed in your portfolio; things jump up or fall off of a…",
  "data/reddit-crypto/r/CryptoCurrency/comments/sl9uyn/crypto_prices_may_fall_at_a_rate_the_world_has.json": "Here are some valid reasons why this may happen\n\nBecause literally anything can happen, dummy.\n\nThis is just a simple reminder that just because a post makes you feel good,\ndoesn't make it true. And just because you don't agree with a post, doesn't make\nit wrong.\n\nPrices fell for a couple months…",
  "data/reddit-crypto/r/CryptoCurrency/comments/sl84r7/i_hate_how_the_concept_of_nfts_is_now_reduced_to.json": "NFT technology is one of the best and most interesting technologies that came\nout of blockchain.\n\nIts kinda frustrating seeing how people instantly think of JPEGs once you\nmention NFTs.\n\nNFTs can be used in MANY ways. Tickets, product listing, identity verification\nand much more.\n\nAnd yes I…",
  "data/reddit-crypto/r/Bitcoin/comments/skzb2s/cnbc_bitcoin_miners_are_helping_the_texas_grid.json": "https://www.cnbc.com/2022/02/03/winter-storm-descends-on-texas-bitcoin-miners-shut-off-to-protect-ercot.html\n\nThey only post FUD about Bitcoin/Crypto, articles full of lies and\nmisinformation. But this great factual article is nowhere to be seen there:\n\n> As a major winter storm descends on Texas,…",
  "data/reddit-crypto/r/CryptoCurrency/comments/sl0gz1/imagine_how_weird_it_felt_for_an_1960s_vendor_to.json": "Imagine what it felt like accepting the first credit card payments in the world.\nThe concept of intangible money, money that can’t be physically seen, has always\nbeen a hard concept for humans to grasp.\n\nSome countries and cities now like Dubai and New York use more credit cards than\ncash. Yet the…",
  "data/reddit-crypto/r/CryptoCurrency/comments/slhkes/this_is_how_insanely_secure_the_bitcoin_network.json": "Bitcoin is the most secure network in existence. The way the network is built is\npure genius and the bigger it gets, the more secure it becomes.\n\nIn 2011, Dan Kaminsky, a leading Internet-security researcher, investigated the\ncurrency and was sure he would find major weaknesses.\n\nKaminsky is famous…",
  "data/reddit-crypto/r/CryptoCurrency/comments/skzhyx/am_i_the_only_one_that_still_has_no_idea_what_the.json": "So what on earth is it?\n\nIs it just the idea that we'll all be playing MMORPGs all day with VR? Rather\nthen chatting with someone on zoom I'll spend half an hour wiring up my VR kit\nso I can chat to their avatar in a pretend conference room? And then we'll go to\na pretend coffee bar where we'll…",
  "data/reddit-crypto/r/CryptoCurrency/comments/sl7jfh/lets_see_whether_sentiment_really_changed_that.json": "You're very welcome to explain your outlook and explain why you feel bullish or\nbearish, but please don't annoy us with nobody knowing feces about fornication.\nI'm asking in order to determine the current outlook.\n\nI'm asking about how you feel about the market at this moment in time, not to\nget…",
  "data/reddit-crypto/r/Bitcoin/comments/sl4tg0/buying_bitcoin_every_month_for_53_months_now.json": "Been buying Bitcoin every month since late 2017. Nearly always with the same\namount, few exceptions when I got a bonus from work etc. Basically, I wanted to\ngo all-in but didn't have any savings, so decided to buy with max amount that I\ncan, every month from the salary. I kinda had the idea of…",
  "data/reddit-crypto/r/CryptoCurrency/comments/sl7c30/between_8th_and_15th_of_june_2021_btc_pumped_from.json": "Please keep in mind that just seven months ago we had almost the same pump,\nwhich took BTC up to EXACTLY where it is right now. This is not the only\nsimilarity - back then BTC pumped from 35k to 39k within 14 hours, while\nyesterday we saw a pump from 37k to 41k in 9 hours.\n\nThis uptrend was short…",
  "data/reddit-crypto/r/CryptoCurrency/comments/slngcc/i_analyse_the_18_coins_in_coinbase_venture.json": "We all know Coinbase but not all of us had heard of Coinbase Venture. It is an\ninvestment arm of Coinbase to invest in early-stage cryptocurrency and\nblockchain startups. You can check the portfolio at Messari website.\n\nTheir portfolio contains 18 coins as of now:\n\n * Bitcoin (BTC) and Ethereum…",
  "data/reddit-crypto/r/CryptoCurrency/comments/slvpny/vodafone_visa_paypal_mastercard_uber_andreessen.json": "https://preview.redd.it/c0i7c2rgj7g81.jpg?width=1270&format=pjpg&auto=webp&s=1511d8c098ef56efdbe024d23c56c1b64ad7b085\n\n\n\nIt has been over 3 years after Facebook's announcement of the plans to launch\ntheir own stablecoin project Libra which has gathered more that a billion USD\nfrom various well…",
  "data/reddit-crypto/r/CryptoCurrency/comments/slvcd1/diamond_hands_isnt_just_a_meme_anyone_who_held_on.json": "People tend to forget and lose sight very fast. Many say diamond hands slightly,\nbut yet they lose hope fast and panic sell.\n\nThis was just a month and few days ago when the end of year 2021 crash happend\nand many people already panic sold their coins.\n\nIf they had hold onto it, most of them has…",
  "data/reddit-crypto/r/CryptoCurrency/comments/sly4ow/in_venezuela_1_btc_is_around_190000_bs_bolivares.json": "Hi, Venezuelan living here!\n\nPosting this for several years!\n\nAround the same amount that last week. We are looking for around 110 BTC\nmonthly. Way lower that years ago.\n\nReason? New exchanges, where Binance is king, \"the\" P2P (with all the risk\ninvolved) option to go, not only BTC but other crypto…",
  "data/reddit-crypto/r/Bitcoin/comments/sm23n9/update_i_am_a_23_yr_old_student_and_hodl_exactly.json": "So during this Dip in the Market I managed to liquidate my stonks and ETF to put\nit in Bitcoin. Bitcoin is the answer and the only asset I can trust to hold it\nfor decades. Other than corporations.\n\nWhat do you think should I do? Should I try to time the market if let‘s say the\nmarket turns really…",
  "data/reddit-crypto/r/CryptoCurrency/comments/smbhkv/algo_over_a_dollar_eth_over_3000_btc_nearing.json": "Am I right? Or am I right? Let me just be the first one to say I am SO happy\nshitposting is back. Have you guys tried sorting by new? Oh my goodness the\n“technical analysis” I’ve seen is incredible. That leads me to ask, is your coin\nof choice going up? Have you seen the triple double golden shower…",
  "data/reddit-crypto/r/Bitcoin/comments/smamcf/so_im_16_and_just_bought_my_first_bitcoin.json": "Well, 0.00001556 of a bitcoin to be exact. Planning to buy more! Wish me luck.",
  "data/reddit-crypto/r/CryptoCurrency/comments/sm7ynk/seeing_so_many_anticrypto_people_not_having_any.json": "Just looking over a few Subreddits here like r/technology [/r/technology] or\neven better twitter, you can very fastly see the mutual hatred for Crypto there.\nPosts about crypto usually get bombed with the most classic argument after its\nall a scam: \"crypto is killing the environment due to…",
  "data/reddit-crypto/r/CryptoCurrency/comments/sm2l7k/anybody_use_cryptocom_earn.json": "Looking for feedback on crypto.com earn. Most of my crypto bag is in BTC. Not\nlife changing…yet, but not chump change either. But it’s just sitting there\nriding the crypto waves up and down. Crypto.com apparently will offer 4.5% paid\nout every 7 days in the coin that you invest. It’s been in the…",
  "data/reddit-crypto/r/Bitcoin/comments/sm1mwc/how_did_these_terrible_bitcoin_youtubers_become.json": "I am so disappointed that channels such as Carl The Moon, MMCrypto, DavinciJ15,\nBitboy, and many others are the top Bitcoin youtubers. These morally bankrupt\nscumbags representing Bitcoin are making us look bad to the layman person.",
  "data/reddit-crypto/r/CryptoCurrency/comments/smko2s/brantly_has_been_fired_cancelled_and_terminated.json": "Brantly just got terminated.\n\nTweet from the head of ENS\n[https://preview.redd.it/ay8dpcpr8dg81.jpg?width=1436&format=pjpg&auto=webp&s=515731591205d58921408d145e71756e5589373b]\n\n> True Names Limited (TNL), the nonprofit that funds and organises development\n> on ensdomains…",
  "data/reddit-crypto/r/CryptoCurrency/comments/smpnx1/i_suggest_not_trying_to_learn_technical_analysis.json": "TA tries to capture market psychology and sentiment by analyzing price trends\nand chart patterns for possible trading opportunities, but it's misguided and\nlacks a theoretical basis.\n\nWhen put to scientific tests it doesn't hold up against empirical evidence.\nAnalysts consistently looking at…",
  "data/reddit-crypto/r/CryptoCurrency/comments/smuto8/one_of_the_biggest_audit_firm_in_canada_just.json": "One of the most bullish things for our ecosystem will be the adoption of crypto\nby large institutions. And today, one of Canada's largest auditing and\nverification firms announced that they have purchased BTC and ETH for the first\ntime ever!\n\nThe firm, KPMG, is a major player in Canada. It's been…",
  "data/reddit-crypto/r/CryptoCurrency/comments/sml4lx/99_of_the_airdrops_are_useless_or_scam.json": "Juste here for an obvious post that the vast majority of airdrops are useless\nand/or scams. Even if it's promoted by legit platform/website. Please remember\nthat these websites are paid by the project to promote the Airdrops, it's not a\n\"cool and exclusive discovery for our users\". Also all the…",
  "data/reddit-crypto/r/CryptoCurrency/comments/smwx3o/help_me_understand_the_recent_market_turnaround.json": "I am sitting here trying to understand and rationalize the market rebound and I\nhave come to the conclusion that I have no idea why the market is trending back\nupwards. Was there something in particular that can be attributed to the\nturnaround? Just not sure where all the current resilience and…",
  "data/reddit-crypto/r/CryptoCurrency/comments/smqnbx/head_of_microsoft_blockchain_challenges_web2_devs.json": "Yorke E. Rhodes III is Cofounder of Blockchain Microsoft and Principal Program\nManager Azure Blockchain Engineering.\n\nHe had this interesting view point:\n[https://preview.redd.it/v57a5dwk0fg81.jpg?width=1412&format=pjpg&auto=webp&s=a2c6b62ce21ab0fb81a4cc74998bf633fa86daef]\n\n> web2 engineer…",
  "data/reddit-crypto/r/CryptoCurrency/comments/smyjne/things_are_heading_back_up_and_fast_am_i_paranoid.json": "I’m just trying to gauge how confident people feel in the direction we’re moving\nright now. We’ve been here before when things improve after a dip only to find\nit dip significantly again shortly after so I’m Just trying to take a straw\npoll. Personally I’m feeling positive but that’s why I’m…",
  "data/reddit-crypto/r/CryptoCurrency/comments/smzlb7/if_youre_kicking_yourself_for_not_buying_more.json": "Stick to your original plan. And if you don't have one, try to establish one -\neven if it's a simple DCA system without much more of an end goal than\neventually having more money. Don't get caught up in the hype which is very\nrapidly flooding into every person's social media feed. The success of…",
  "data/reddit-crypto/r/Bitcoin/comments/smwoq3/meta_situation_just_shown_why_btc_is_important.json": "Mr Mark \"The Lizard Alien\" Zuckerberg just threatened he will shut down Facebook\nand Instagram for Europe due to the GDPR.\n\nShutting down FB is honestly not that bad (aside of logins associated with it on\nother sites), but it clearly shows what CEO can do to you and how much power he\ncan have. Now…",
  "data/reddit-crypto/r/CryptoCurrency/comments/sn10a6/crypto_went_from_disbelief_to_euphoria_to.json": "We are currently having a pretty damn good uptrend, after such a long time.\nAbout exactly 4 months ago end of sep/beginning Oct we were at the same cycle\nspot of disbelief. Disbelief meaning that the current rally is under disbelief\nby many as we were having so much downs and fake breakouts…",
  "data/reddit-crypto/r/CryptoCurrency/comments/sn4iaf/1225_bat_payout_this_month_12_just_for_browsing.json": "Got a significant bump in earnings this month, I think this might be the largest\ndollar value payout I've ever had from the browser!\n\nBeen using the browser for quite a while, used to get 30 or 40 BAT a month but\nas the price shot up the amount of BAT dropped. This month it’s jumped up to\n12.25 BAT…",
  "data/reddit-crypto/r/CryptoCurrency/comments/sn6igx/bitboy.json": "I like most of you newbies when I first wanted to get into crypto, hopped on\nYouTube in January 2021 and searched some newbie phrase “what should I do with\n1k crypto” and more than likely bitboy pops up with his promising titles and\ndigestible content. And at this time ETH was around 1500. So I…",
  "data/reddit-crypto/r/CryptoCurrency/comments/smxe5j/inflation_is_fucking_over_peoples_lives_and_they.json": "7% inflation rate in 2021 (USA).\n\nThat means if you had $100,000 in your bank, you’ve lost $7,000!\n\nCountries like the US are still lucky with “just” 7%.\n\nFor example turkey had an inflation rate of 40%! People lost almost half of\ntheir money!\n\nOther countries like Venezuela have also suffered the…",
  "data/reddit-crypto/r/CryptoCurrency/comments/snds3m/here_is_how_i_doxxed_the_creator_of_a_scamcoin.json": "I posted this yesterday but it was removed by reddit because I said the website\nof the scam. Now I repost it without any information so please don't ask for it.\nAnyway the website is now deleted so you can't see anything.\n\nI own a telegram group where this morning an user entered telling everyone…",
  "data/reddit-crypto/r/CryptoCurrency/comments/smz304/are_the_bulls_really_back_on_track_or_its_just.json": "The markets is flowing again and most people are already caught up with a new\nsentiment. 2 weeks ago, FUD and desperation were raging and now, it's rocking\ngreen and we're all speculating when new BTC ATH, when ETH ATH or whatever coin\nyou hodl, wen moon!\n\nStill, I'm still a bit skeptical and on my…",
  "data/reddit-crypto/r/CryptoCurrency/comments/snfbz8/listen_to_what_the_youth_are_talking_about_and.json": "Here for round 2 of why being a high school teacher has been an 'ear to the\nfloor' revelation for me.\n\nHaving taught in schools for nearly 5 years you can get a sense about what is\nimportant to kids.\n\nFacebook is not cool = Subsequent rebranding and losing relevance\n\nTik tok very cool = tik tok…",
  "data/reddit-crypto/r/CryptoCurrency/comments/snle9h/if_you_want_to_make_money_day_trading_try_this.json": "Day trade on paper for at least a month or even longer. (Without actually making\nthe trades)\n\nI got this advice a few years ago but didn't listen and was down 50%.\n\nIt sounds odd, but it'll show you how hard and unpredictable it is, especially\nwith crypto.\n\nLiterally write every trade you would…",
  "data/reddit-crypto/r/Bitcoin/comments/sngeoe/convincing_my_friend_to_buy_bitcoin_before_100000.json": "\" This is very possible \" 🤓 his loss anyway 😂\n\nhttps://preview.redd.it/ob73r2u0ykg81.png?width=899&format=png&auto=webp&s=508c9bb03143d7ae9eb679f337db10b5e5b5e2ae",
  "data/reddit-crypto/r/CryptoCurrency/comments/snmrp5/the_web3ethereum_community_is_currently_divided.json": "Since last weekend, the Ethereum community has been torn apart by an\nunprecedented culture war. Two camps have formed, and there is no indication\nthat they will find common ground anytime soon. I will not take side with this\npost, as I only want to inform people of this issue.\n\nSo... What exactly…",
  "data/reddit-crypto/r/CryptoCurrency/comments/snxksz/make_sure_to_look_for_easter_eggs_during_super.json": "We been hearing that the coming Super Bowl LVI there is going to be a bunch of\nrumored commercial from the cryptomarket including one from crypto.com\n[https://crypto.com], coinbase and may be even dogecoin . For crypto.com\n[https://crypto.com] most likely Matt Damon is going to appear again. But…",
  "data/reddit-crypto/r/CryptoCurrency/comments/snx7rw/i_read_cathie_woods_ark_invests_132_page_big.json": "If you don’t know her, Cathie Wood is a fund manager (Ark Invest) who rose to\nprominence in 2020/21 after a series of very successful investments/market bets.\n\nShe is a strong believer in disruptive technologies.\n\nThink robotics, tomorrow’s batteries and genomics as well as erm..…",
  "data/reddit-crypto/r/CryptoCurrency/comments/snh7rs/for_everyone_using_the_brave_browser.json": "Recent post from a person gaining 12.25 BAT this month gained quite some\ntraction. I noticed that many people mentioned in the comments that they are\nonly receiving 1 or 2 adds per hour.\n\nIf your Brave is updated you can navigate to Reward Settings (in the Brave\nRewards window), and from there…",
  "data/reddit-crypto/r/CryptoCurrency/comments/so8dlp/found_my_wallet_from_2013.json": "So when I was 13, I learned about bitcoin and starting mining it on my gaming\nPC. Lost interest after a while, bitcoin blows up, I lament young me’s error,\netc\n\nWent through my old google drive and found my wallet, problem is - I have\nabsolutely no idea how to access it / if I can access it. It’s a…",
  "data/reddit-crypto/r/CryptoCurrency/comments/snuhg5/people_wants_to_go_back_in_time_to_buy_btc_yet.json": "Everyone talks about missed opportunities, but sometimes the opportunities are\nright in front of them and they fail to take advantage, to recognise them.\nPeople are still sleeping on ”insert your favourite coin here”. If you want to\nbuy BTC or ETH, do it now! If you want to buy ADA, NANO, DOT,…",
  "data/reddit-crypto/r/CryptoCurrency/comments/snrvt9/metamask_should_warn_you_if_you_are_about_to_make.json": "This isn't a question about about decentralization or centralization. This is\nalso more than just a simple nice-to-have feature. Imagine you browse websites\nthat knowingly sell your I.P. address and other information to hackers and other\nmalicious actors can openly see what you're doing and your…",
  "data/reddit-crypto/r/Bitcoin/comments/so7ru7/the_russian_government_and_the_bank_of_russia.json": "The Bank of Russia wanted the Russian government to declare the use of\ncryptocurrencies illegal in Russia, but instead of banning the use\ncryptocurrencies, the Russian government and the Bank of Russian have agreed\nthat cryptocurrencies will be recognized as an analogue of currencies in Russia\nand…",
  "data/reddit-crypto/r/CryptoCurrency/comments/sode68/coinbase_have_stolen_my_eth_deposit_and_ignored.json": "I deposited ETH, from an address I have used many times, to my CB address I have\nused many times without issues. Deposit made on Christmas day 2021.\n\nI got the usual CB email saying they'd received my deposit, and the tx is\nconfirmed on etherscan.\n\nThe coins were never put into my portfolio.\n\nI…",
  "data/reddit-crypto/r/CryptoCurrency/comments/sobivz/bbc_and_crypto_media_20yearold_turned_50_into_8m.json": "There is a wholesome story going around by the BBC today, echoed by some crypto\n\"media\" about a young crypto millionaire that turned $50 into millions within\nmonths trading crypto. Okay, this sound somewhat unbelievable, but there's more\nto the story.\n\nThey report, he is giving back to the…",
  "data/reddit-crypto/r/CryptoCurrency/comments/sohojt/melania_trumps_nft_was_sold_for_170000_toherself.json": "The address (aka address #1) that minted the NFT sent 473,657.64 USDC to an\nintermediary address (#2). The intermediary address swaps some of that USDC for\n1,816.08 SOL. Then Address #2 sends 1800 SOL to a 3rd address.\n\nThe third address makes a bid and wins the NFT for 1800 SOL. That 1800 SOL…",
  "data/reddit-crypto/r/CryptoCurrency/comments/sojzqo/people_say_investing_in_crypto_is_too_risky_yet.json": "The average cost of a wedding is roughly $20,000 here in the USA. That’s just\nfor the wedding. With the divorce rate steadily increasing, a marriage is the\nmost risky, unfavorable investment one could make in his/her entire life.\n\nThen, let’s say you and your significant other decides to divorce.…",
  "data/reddit-crypto/r/CryptoCurrency/comments/sohd28/ten_years_ago_i_predicted_that_reddit_would_turn.json": "Blockchain tech is in the early stages of constructing a trustless global voting\nmachine that humanity will use to quickly reach popular consensus on current\nevents. Biometrics and facial recognition in VR headsets or AR glasses will be\nused to authenticate users to a specific wallet address,…"
}