{
  "data/reddit-books/r/books/comments/pyzj39/it_bothers_me_when_fantasy_and_historical_fiction.json": "It seems like so many authors don't have a good grasp on how long it would take\nto cross a country or a continent on foot or by horse, especially in situations\nwhere there aren't decent roads. In many scenarios, you would be lucky to make\nit 20 miles a day (probably less if you have to stop to hunt…",
  "data/reddit-books/r/books/comments/pz7naz/anyone_else_struggle_with_actually_getting.json": "I used to read loads. I could devour a 700 page book in a day, now I struggle\nwith even 30 pages. I pick up a book and read for an hour, then never go back to\nit. I'm so tired of it. I have so many amazing books still to read but I just\ncan't do it.\n\nI also find my ability to remember what I've read…",
  "data/reddit-books/r/books/comments/pz9la1/john_kennedy_tooles_a_confederacy_of_dunces_is_a.json": "If you haven't read A Confederacy of Dunces yet, Mrgreen37 heartily recommends\nit. It's an absolutely hilarious novel focusing on one Ignatius J Reilly and his\ninteractions with the inhabitants of the city of New Orleans after his mother\ndecides he has to go to work to pay off a car the two of them…",
  "data/reddit-books/r/books/comments/pza10r/i_know_im_late_but_the_fifth_season_trilogy_are.json": "It took me a few tries to get into the first book over the last year. I read the\nsame first chapter or two a couple times and just didn’t find anything that\ngrabbed me so would go read something else. Finally I finished a book in the\nmiddle of the night while trying to read myself through a bout of…",
  "data/reddit-books/r/books/comments/pzcxcg/phantom_of_the_opera_is_the_timeless_classic_of.json": "Happy Spooktober!\n\nGaston Leroux's Phantom of the Opera. A classic that has been adapted into\ndozens of films and decades of stage productions. Horror beyond imaginable\nhorror abounds at the Paris Opera House as the \"O.G.\" Opera Ghost wreaks\nnon-threatening havoc and plays spooky pranks on the new…",
  "data/reddit-books/r/books/comments/pzf438/im_tired_of_adventure_books_furthering_the_theme.json": "I love Halloween and I love my somewhat childish Halloween adventure books with\nkids saving the world from some unknown evil. But a common theme among so many\nHalloween adventure books that I’ve read over the years is kids trying to get\nhelp from adults and the adults fobbing it off as their wild…",
  "data/reddit-books/r/books/comments/pzjkms/tolstoy_and_dostoevsky.json": "I know those two are giants and arguably the greatest writers since Homer. But\nto my mind they differ quite a bit. Tolstoy is an outward-looking observer, a\nrealist with acesses of philosophy, but not huge on feelings, instead he is\nquite content with immediate reactions and the narrative itself.…",
  "data/reddit-books/r/books/comments/pzlpy7/finished_slaughterhousefive_feeling_some_type_of.json": "-Damn. Fucking hell this book was good. I have read Vonnegut before and\nappreciated his wit and storytelling ability, but this was my first go at\nSlaughterhouse-Five. I feel speechless.\n\n- I am in the military. I have deployed myself, but never off to something so\npowerful as a World War. So, I…",
  "data/reddit-books/r/books/comments/pzmiwt/i_couldnt_put_down_rebecca_but_ended_up.json": "I couldn't put this book down, but I ended up being disappointed. Not\nnecessarily because of the ending, but because of a lack of character\ndevelopment. The protagonist stays painstakingly shy and self conscious for a\nvery long time, to the point of becoming annoying. When she does gain\nconfidence,…",
  "data/reddit-books/r/books/comments/pzu2u6/how_gendered_is_your_reading.json": "I'm a woman in my thirties. I did a quick count of the books I've read this\nyear, and they've been broadly 50/50 male and female authors.\n\nBut when I broke it down by fiction vs non-fiction, I overwhelmingly read\nfiction by female authors and non-fiction by male authors, which interested me.\n\nNot…",
  "data/reddit-books/r/books/comments/pzxpb3/if_you_liked_jude_the_obscure_youll_really_like.json": "My last boss was an English teacher and I’m slowly working my way through his\nrecommendations. This isn’t one of them…\n\nStoner by John Williams is a desolate novel about the life of a Midwestern\ncollege professor. It’s not a book about a great man who accomplishes the\nimpossible in the face of…",
  "data/reddit-books/r/books/comments/pzyrvy/the_brothers_karamazov_appreciation_post.json": "Let me start off by saying that this is my first time reading a novel outside of\nan academic setting and I am absolutely blown away.\n\nI’m only about 300 pages in and I feel like I just discovered gold, there are\ntimes that I have to stop reading because I’m so overwhelmed, not so much by the\nstory…",
  "data/reddit-books/r/books/comments/q03vri/this_is_how_you_lose_the_time_war_is_beautiful.json": "This is How You Lose the Time War by Amal El-Motar and Max Gladstone is a\nbeautiful epistolary novella. It was a little hard to sort out at first but once\nI got the feel for it I was totally absorbed.\n\nIt's so abstract in several ways and even had me looking up a few definitions as\nI read it.\n\nThe…",
  "data/reddit-books/r/books/comments/q08qd6/which_books_pair_well_together_as_unofficial.json": "I had this idea from a post by u/puncmunc [/u/puncmunc] on r/movies [/r/movies].\n\nI was wondering if anyone has a two or more books that pair nicely together.\nThey could be fiction or non-fiction!\n\nI recently read The Song of Achilles by Madeline Miller, and A Thousand Ships by\nNatalie Haynes - I…",
  "data/reddit-books/r/books/comments/q09sbd/do_you_notice_peoples_scents_in_real_life_like.json": "The title pretty much says it all. For context: if you've done a good bit of\nreading, particularly in romance novels, authors love to use a person's scent as\na descriptor or way that another character identifies that person. For instance,\nI just read a book where the male character was obsessed with…",
  "data/reddit-books/r/books/comments/q0fjrz/how_international_is_your_bookshelf.json": "I recently saw a thread polling readers how gender balanced their bookshelf is.\nThis made me go through mine. In doing so, I noticed that there are 4 nations\nwhose authors are disproportionately represented on my shelf:\n\n 1. Germany\n 2. US\n 3. England\n 4. France\n\n(In case you are wondering, yes, I'm…",
  "data/reddit-books/r/books/comments/q0ga2i/secret_codes_in_books.json": "I'm fascinated with all things codes within books. I remember when David Blaine\nreleased his book, Mysterious Stranger, he offered something like $100,000 to\nanyone who could crack the code and find the hidden treasure. There was a\nsimilar book released in 1979 filled with clues that led to a golden…",
  "data/reddit-books/r/books/comments/q0itnh/members_of_the_sub_what_determines_whether_youd.json": "I have just finished a book that dealt with several important themes and as a\nway of exploring these themes, the book delved into pedophilia, sexual assault,\ncannibalism and more such disturbing matters. Personally, I loved the book for\nit's brave narrative structure and for making me pause and…",
  "data/reddit-books/r/books/comments/q0n63b/anybody_noticed_new_books_come_with_uncomfortable.json": "I've noticed that many of the books I order recently have a matte type cover,\nbut it feels a bit like suede. I have an aversion to cotton wool, and touching\nthese covers gives me the same feeling. Not only that they attract dust, and\nfingerprints, and I haven't yet found anything that cleans…",
  "data/reddit-books/r/books/comments/q0o99g/meet_storygraph_an_alternative_to_goodreads.json": "I migrated to Storygraph not too long ago to track my reading habits and to-read\nbook list, and am glad I did. Storygraph gives great recommendations, more data\non the types of books I like to read, and it's also nice to have an alternative\nto Goodreads that is not owned/managed by Amazon. I thought…",
  "data/reddit-books/r/books/comments/q0qrmy/my_local_library_has_closed_apparently_due_to.json": "I live in rural North Carolina, USA, and habitually make a weekly trip to the\nnearest sizeable town every Friday. Last Friday I was shocked to find the local\nlibrary has closed, with a sign on the door saying the problem is a lack of\nfunding. I gather there is a an issue with Federal budget spending…",
  "data/reddit-books/r/books/comments/q0qz2d/becky_chambers_is_pretty_fantastic.json": "I've read a bunch of Becky Chambers books lately and they were all really good.\nThey tend toward short, highly enjoyable, character driven books. They're highly\naccessible with a fair amount of depth\n\nMost recently was A Psalm for the Wild Built which largely revolved around\nenvironmental themes. It…",
  "data/reddit-books/r/books/comments/q0rexm/psa_for_ebook_lovers.json": "You all probably already know about Project Gutenberg. I love it too, but have\nyou ever gotten annoyed by the myriad formatting of those ebooks? This website\nstandardizes public domain books with good paragraph/line spacing, chapter\nlinks, etc: https://standardebooks.org/\n\nI am not affiliated with…",
  "data/reddit-books/r/books/comments/q0wwb3/what_genres_are_popular_in_another_language_but.json": "I'm bilingual in English and Chinese. Most people know about Wuxia genre. Wuxia\nis so hard to translate into another language because it is so tied to the\nhistory and culture of China. You almost need a Encyclopedia to reference all\nthe terms. The authors already expects you to be familiar with…",
  "data/reddit-books/r/books/comments/q0wz6m/another_project_hail_mary_post.json": "I know there are a few of these already but I have so many feelings and the raw\nemptiness of just having finished the book.\n\nFirst, I have advanced degrees in physics and engineering and I’m amazed at how\nwell-researched the book is. I think sci fi similar to historical fiction in a\nway. There’s a…",
  "data/reddit-books/r/books/comments/q13guo/do_androids_dream_of_electric_sheep.json": "I just finished this book today and wanted to know what questions or thoughts it\nprovoked in you guys and if you guys gained any insight while reading this? A\nfew things I would like feedback on are-\n\n 1. The title of the book, 'Do Androids Dream Of Electric Sheep?', the question\n    does Android,…",
  "data/reddit-books/r/books/comments/q191l6/to_redditors_who_are_poc_how_do_you_really_feel.json": "I'm curious how you felt in school hearing the N-word being read out loud,\npossibly by white students or the teacher, or when the real horrors of slavery\nwere being discussed. And if you are currently an adult, has your view changed?\nDid it make a difference who the author was?\n\nAs a white person…",
  "data/reddit-books/r/books/comments/q1c6mq/what_book_had_the_biggest_potential_but_fell_flat.json": "Earlier this year I read Before the Coffee Gets Cold, a Japanese short novel\nabout a coffee shop that lets you time travel. I was so excited about it but was\nlet down by the very repetitive writing and all of the annoying characters. I\nknow there's a sequel, but I have no interest in it.\n\nAnother…",
  "data/reddit-books/r/books/comments/q1cup8/book_samples_that_really_arent_samples.json": "Every time I read a sample it’s 20-30 pages long, but half+ of that sample is\nspent on book cover, the “credits” page, table of contents, acknowledgements &\nauthor notes, advertising, etc. In the end you get maybe ten pages of the actual\nbook.\n\nJust… why? People don’t walk into a book store and read…",
  "data/reddit-books/r/books/comments/q1gvtl/does_philip_k_dick_always_write_women_like_this.json": "I read \"Do Androids Dream of Electric Sheep?\" and as much as I liked the story\n(making me interested in reading more of his books), the way Philip K Dick wrote\nwomen in this made me quite uncomfortable. Here's an example:\n\n\" 'Welcome back, Mr. Quail', she fluttered, her melon-shaped breasts -…",
  "data/reddit-books/r/books/comments/q1sq8m/are_there_any_authors_you_refuse_to_read_no.json": "To me the number one author I refuse to read another word from is Elizabeth\nGilbert. She tricked me, she really did with Eat, Pray, Love. The reviews I\nfirst came across were quite promising and I had high hopes. A friend of mine\nand I read it together as our sort of private bookclub read. There…",
  "data/reddit-books/r/books/comments/q1xijr/psa_tor_publishing_has_a_monthly_book_club_where.json": "Title says a lot - sign up for free monthly ebooks. Caveat, Tor publishes\nscience fiction and fantasy, so that is generally what you will have access to.\n\nGideon the Ninth is a glorious (and also kind of pulpy) book. I would recommend\nit to anyone with a fondness for a good murder mystery, that…",
  "data/reddit-books/r/books/comments/q25vf5/finally_got_around_to_reading_the_mistborn_series.json": "For the longest time I've kinda just put off reading Brandon Sanderson works,\neven though everyone mentioned him! I guess I thought his work was \"over-hyped\"\n\nSo I finally got around to reading the the first 3 books and was just blown away\nbut them.\n\nThe world building, the storylines, the character…",
  "data/reddit-books/r/books/comments/q298wu/yall_ever_read_a_book_slow_so_that_it_wont_be_over.json": "I’m reading All the Pretty Horses by Cormac McCarthy. It’s the best goddamn book\nI’ve ever read in my life. Usually when I’m super into a book, I won’t put it\ndown. But this one, I’ve been savoring 20-30 pages at a time. I hate the idea of\nfinishing it because then I won’t be able to read it…",
  "data/reddit-books/r/books/comments/q2dvva/what_are_some_movie_adaptations_that_are_superior.json": "I recently finished the whole southern reach trilogy, and I felt that the movie\nwas better than both its namesake and the trilogy as a whole. It felt like Alex\nGarland had a better grasp on how to best convey his vision for the story. The\nbook was great too, just think the movie is a tad bit…",
  "data/reddit-books/r/books/comments/q2lbtm/my_61yearold_father_asked_me_last_night_what_is.json": "After I laughed in his face, I realized it was an earnest question. A sincere\nversion of Bill Hicks' \"What you readin' for?\" bit. I kind of bounced all over\nthe place because I'm 31 and have never been asked something like that. Upon\nelaboration, I gathered that he mostly meant novels. I essentially…",
  "data/reddit-books/r/books/comments/q2qqwe/im_former_cia_officer_david_mccloskey_author_of.json": "I’m a former CIA analyst and former consultant at McKinsey ＆ Company. While at\nthe CIA, I wrote regularly for the President’s Daily Brief, delivered classified\ntestimony to Congressional oversight committees, and briefed senior White House\nofficials, Ambassadors, military officials, and Arab…",
  "data/reddit-books/r/books/comments/q2qy6r/out_of_all_the_fantasy_books_youve_read_what.json": "Personally for me it would have to be the chronicles of the imaginarium\ngeographica, I know not many have read this series, I would highly recommend you\nto read these gems. There just something very nostoglic about the ships, the\nkeep of time, the dragons, the caretakers of the imaginarium…",
  "data/reddit-books/r/books/comments/q2t2eu/should_public_libraries_charge_late_fees_for.json": "The New York Public Library recently announced that it will not charge late fees\nfor overdue materials. Most Americans (61%) say public libraries should charge\nlate fees for overdue books, compared to a quarter (24%) who say they should\nnot.\n\nExplore the…",
  "data/reddit-books/r/books/comments/q2ymjt/a_slightly_different_my_relative_doesnt_read_post.json": "I was lucky enough to know my Grandpa for my entire childhood. Despite living\nquite a ways away from him and my Grandma, I always saw them multiple times a\nyear for days at a time.\n\nI never saw my grampa read a book. I saw him use a thick magnifying glass to\npore, slowly, over a newspaper, sure. But…",
  "data/reddit-books/r/books/comments/q348pf/carl_sagan.json": "Hello! I recently started reading Cosmos by Car Sagan and the dedication page\nleft me crying because he worded his love for his wife marvelously. Just wanted\nto share with anyone who might never read it. :)\n\nFor Ann Druyan\n\nIn the vastness of space and the immensity of time, it is my joy to share…",
  "data/reddit-books/r/books/comments/q3a2ze/the_count_of_monte_cristo_remains_my_best_classic.json": "Most of you readers have definitely read The Count of Monte Cristo by Alexandre\nDumas. despite having many classics and modern thrillers, none excites me as\nmuch as this book. The plot, the language, the intrigue, the twists and turns in\nthe book will always entertain me. Apart from Edmond Dantes…",
  "data/reddit-books/r/books/comments/q3er62/hi_im_karen_m_mcmanus_author_of_young_adult.json": "Hi Reddit, I'm Karen M. McManus, author of young adult thrillers including the\nOne of Us Is Lying series, Two Can Keep a Secret, The Cousins, and You'll Be the\nDeath of Me. One of Us Is Lying has been turned into a television series that\nstarts streaming on Peacock on October 7, 2021. My books have…",
  "data/reddit-books/r/books/comments/q3ewb6/theres_something_really_cool_about_helping.json": "I’m at the airport and wanted to buy a new book for the trip (not like I didn’t\nbring one already lol) and while picking one out I started talking to this guy\nwho’s never really been much of a reader but has a 9 hour flight so wanted to\nget something. After a minute or so of talking we found one he…",
  "data/reddit-books/r/books/comments/q3jfhn/after_listening_to_what_this_subreddit_was.json": "I must say it's absolutely phenomenal, I don't know how but it lived up to the\nglowing praise it recieved in every aspect, a genuine masterpiece. I must've\nread through the scene where Dantes returns to If and prays at the Abbe's bed a\nfair few times, the whole book was absolutely remarkable - I…",
  "data/reddit-books/r/books/comments/q3mqqg/does_amazon_poorly_package_your_books_too.json": "Today I ordered 5 books from Amazon. 4 of them arrived damaged and 3 of them\nwere collector's items. It's so frustrating. All 5 were just tossed into a box\nwithout any bubble wrap or anything to protect it. What the fuck do you expect\nto happen? At this point, I'm no longer ordering my books from…",
  "data/reddit-books/r/books/comments/q3py4s/lincoln_in_the_bardo.json": "Just finished reading this one - wow! Had zero expectations and it blew me away.\nVery inventive and confident work and also very poignant. Highly recommend.\n\nI still can’t get over the style of the two narrators parts - they speak of\nevents as they are happening in the past tense. The “judgment”…",
  "data/reddit-books/r/books/comments/q3vdzk/the_five_the_untold_lives_of_the_women_killed_by.json": "Like all the best non-fiction, this book gave me a lot to think about.\n\nI usually avoid true crime because so many TV shows, podcasts and books are\nheavily sensationalised and rarely victim focused. In the case of media focused\non the Ripper specifically, there's a tendency to mythologise the killer…",
  "data/reddit-books/r/books/comments/q3whjm/read_my_first_jane_austen_novel.json": "For my first book I decided to read Northanger Abbey. I know it is not her most\npopular book but I picked it because of the length. My expectation initially was\nthat it was going to be a boring and tedious read but when finished I was\npleasantly surprised. Being educated in America, I have a little…",
  "data/reddit-books/r/books/comments/q45tyq/today_i_started_to_read_my_first_sherlock_holmes.json": "I don't know what else to say, but that the story writing was insanely well\ndone. I've always held off reading this because I've never really gotten the\ntime to, but growing up I've been watching and catching up to the manga series\n\"Detective Conan\" and it features many aspects of Sherlock Holmes.…",
  "data/reddit-books/r/books/comments/q493gd/is_this_a_standard_bookstore_practice.json": "Earlier today I went to the local bookstore (one I go to kinda frequently). I\ngrabbed a couple of books and as I was preparing to pay them, I see there's an\nOctober promotion where they give away a book if you buy for more than 25$.\nSure, why not! So I pay for my books and the lady gives me a book,…",
  "data/reddit-books/r/books/comments/q4bmn3/if_youve_made_it_through_house_of_leaves_raise.json": "I have to be in the right mood to even pick up the book. I've read Danielewski's\nnovel a few times over the years, though most people I know that have tried to\nread it gave up before finishing. Is it a spoiler to say it gets weird?\n\nThe book has always stuck with me, hard, and to this day I imagine…",
  "data/reddit-books/r/books/comments/q4dr1l/afterwords_for_old_books_always_make_me_tear_up.json": "Afterwords are always a reflection of the author at the time the book is\nfinished. I think my two favourite afterwords are one from Sir Arthur Conan\nDoyle in one of the Sherlock Holmes anthologies I read, and one by Boris\nStrugatsky in Roadside Picnic. In the Sherlock Holmes afterword Sir Arthur…",
  "data/reddit-books/r/books/comments/q4he9f/my_mom_died_in_the_uk_and_has_nearly_4000_books.json": "I've catalogued most of the books she has here but not sure how to go about\ngetting rid of them. My mom always wanted to sell them but always found it\ndifficult, particularly with passable but not amazing computer skills and\nrestrictions in her mobility, to make that happen.\n\nI've asked friends to…",
  "data/reddit-books/r/books/comments/q4i35l/i_dislike_challenges_such_as_52_books_in_52_weeks.json": "Maybe it's just me but it really saps the joy out of reading for me. I'm in full\ntime education and in part time work and for me reading is an escape from that.\nThe moment I start putting goals and numbers on it, it stops being fun and just\nbecomes another deadline and stresser in my life.\n\nI've…",
  "data/reddit-books/r/books/comments/q4jdgo/lpt_when_looking_for_buying_books_online_add.json": "This is a general tip as well. If you want a certain keyword to be excluded in\nany of your search results when looking up on google, just add a hyphen and then\nthat keyword. This will tell google that you're looking for a specific thing but\n'this' word should not appear in any links or paragraphs I…",
  "data/reddit-books/r/books/comments/q4k16z/just_finished_lonesome_dove.json": "Incredible character arcs and development. Consistently hilarious dialogue, with\nintermittent profound insight. McMurtry was sublty clever when it came to\nphilosophizing, and inserting profundity, often without dialogue.\n\nI won't spoil anything, but will say that the conclusion left some wanting…",
  "data/reddit-books/r/books/comments/q4pr6l/do_you_ever_contact_authors_to_give_thanks.json": "The last couple of years, I've gotten in the habit of reaching out to authors to\nlet them know I really enjoyed their work and they wrote something that really\nstuck with me.\n\nI'm sure the Stephen King's and the JK Rowling's of the world get a lot of mail,\nbut I've actually gotten responses from…",
  "data/reddit-books/r/books/comments/q4qv45/the_priory_of_the_orange_tree.json": "It’s happening again, I finally found another fantasy book with a world so rich,\ndiverse and fantastical that I touch it with my very own fingertips. I just\nfinished reading ‘the hating game’ which killed me (and not in a good way, I do\nnot want to read about a 5’0 female protagonist ever again,…",
  "data/reddit-books/r/books/comments/q5044a/has_reading_changed_the_way_you_speak_andor_think.json": "I assume it's had a substantial influence on your writing (which subsumes\nthinking to be fair) but I'm curious whether it's altered the way you speak w/\nfriends, colleagues etc? Do you find yourself using more obscure words or poetic\nphrasing or (unnecessary) analogies and rhetoric and stuff?\n\nHas…",
  "data/reddit-books/r/books/comments/q53g97/holy_shit_i_finished_a_book_in_a_day.json": "I never expected myself to be such a book lover, growing up reading books was a\npunishment which put me off them for a long while. I've picked up the foundation\nseries of Asiimov and yesterday I was reading the last part, Forward the\nFoundation. I woke up, started reading and got so invested (was…",
  "data/reddit-books/r/books/comments/q54auk/if_theres_one_author_youd_choose_to_come_back_to.json": "We all have favourite authors who revolutionised literature with their master\nworks from Hemingway's \"A Moveable Feast\" to J.D Salinger's \"The Catcher In The\nRye\". But if there's one author you'd choose to come back to life and write one\nmore masterpiece who would you choose!? I'd personally choose…",
  "data/reddit-books/r/books/comments/q56klj/has_there_been_a_particular_book_youve_read_that.json": "Is there any book which you've read that you cannot stop thinking about? It\nmight be a few months down the line, heck even a year or two. The book just\nstayed with you, because of the ending, the plot, maybe you just really related\nto the characters, maybe it just messed you up..\n\nI think for me it…",
  "data/reddit-books/r/books/comments/q571ko/the_house_in_the_cerulean_sea_what_a_book.json": "After binge reading for 2 days, I finally completed the house in the cerulean\nsea and it's one of the most heart warming books I've ever read! Though it's\nextremely predictable and sticks to classic pattern, what makes the book amazing\nis the characters. It's great how TJ Klune was able to write…",
  "data/reddit-books/r/books/comments/q583l7/what_has_happened_to_classic_lit_in_my_school.json": "First of all, I hope this is the right place to post this.\n\nSecond of all, I might have an opinion to which y’all disagree, that’s fine. Let\nus have a discussion, maybe y’all can change my mind.\n\nI am trying to understand what has happened to my large, decently rated, Houston\n(Tx) suburb school…",
  "data/reddit-books/r/books/comments/q5biwz/as_i_was_reading_vonneguts_timequake_outside_this.json": "It's gorgeous outside today and I've been particularly stressed as of late. I'm\nnot always aware of those little happy moments, so I'm glad that Vonnegut\nreminded me to notice it today. I'll try to be better at noticing them from now\non.\n\n\"And I urge you to please notice when you are happy, and…",
  "data/reddit-books/r/books/comments/q5muvc/i_read_harlan_cobens_the_stranger_today_and_i.json": "Full disclosure: I listened to this book on Audible as I was on a road trip\ntoday. I knocked out the whole book in one go which isn't a difficult thing to\ndo considering it's only 5 hours long.\n\nTo give a brief (spoiler-free) summary, a man goes to a school meeting on his\nwife's behalf only to be…",
  "data/reddit-books/r/books/comments/q5r8m9/i_finally_read_the_song_of_achilles_and_had_more.json": "So I read this book because of the hype. It was supposed to be gut wrenching,\nand I’d cry and get all the feels! So sign me up. Maybe I had my expectations\ntoo high because of reading all the reviews…\n\nUltimately I’d say this is a good book and I had a good time reading it. But I\ndidn’t find it…",
  "data/reddit-books/r/books/comments/q5s24q/loved_norse_mythology_by_neil_gaiman_is_there_a.json": "Basically the title, I liked the book especially because of how easy it was to\nread and how simple and condensed everything felt. I'm really interested in some\nGreek mythology and tales, but I don't feel like reading complicated long texts\nlike Ilias and Odyssea etc. Is there similar book with the…",
  "data/reddit-books/r/books/comments/q5s4j8/east_of_eden_i_thank_all_those_on_reddit_who.json": "It's amazing how creatively Steinback portrayed the cruelness of human nature\nwith his characters. His depictions of characters touch both the extremes of\nhuman nature. It's a challenging but not a difficult read. Although it's a\nlittle slow going at some moments, the book as a whole makes the…",
  "data/reddit-books/r/books/comments/q5t9y9/can_books_actually_be_scary.json": "I've started reading a horror fiction book every October. So far I've got\nthrough Salem's Lot, Pet Sematary and I've just started The Shining. Next year\nwill be someone other than Stephen King\n\nMost people say The Shining is the King book to go to if you want to wee your\npants, but I guess I'll see…",
  "data/reddit-books/r/books/comments/q5w5jr/today_would_have_been_james_clavells_100th.json": "I just discovered the Asian Saga last year and it already one of my favorite\nbook series. My personal favorite is Shogun but Tai-Pan is a close second.\n\nToday marks the 100th birthday of James Clavell, who himself led a life like a\nnovel. During WW2 Clavell, who was Australian, fought for the…",
  "data/reddit-books/r/books/comments/q6hbtk/just_finished_flowers_for_algernon.json": "And I’m sobbing right now. It's the most depressing story, ending, everything. I\ndon't know why I put myself trough it because I was feeling so bad for Charlie\nthroughout the entire novel. It breaks me, the way he’s been treated by everyone\nespecially himself is the most depressing shit ever put…",
  "data/reddit-books/r/books/comments/q6hc4g/just_finished_reading_my_first_ever_book_at_30.json": "I feel so accomplished right now, I know it might sound silly to some but at age\n30 I managed to see my first book through from start to finish within 2 weeks!\n\nI have ADHD so keeping my attention span is very difficult at the best of times\nbut I feel like something finally clicked with me and I…",
  "data/reddit-books/r/books/comments/q6v90k/came_to_appreciate_a_part_of_harry_potter_i.json": "Just a few thoughts about a story that accompanies me since I was 9 years old\n(or for the last 22 years):\n\nI read Harry Potter when it was first published (in my country) and re-read it\nseveral times in my life. And every time I discovered some new aspects or read\nthings different. Now there is one…",
  "data/reddit-books/r/books/comments/q6xcvy/most_sentimentally_valuable_book_you_own.json": "As above, which is the book you own with the most sentimental value to you? Mine\nwould have to be the hardcover of Grimm's complete fairy tales my Grandad (a\nnotoriously selfish though well-meaning man who never bothered to have a real\nrelationship with me and only ever bought me two worthwhile…",
  "data/reddit-books/r/books/comments/q71ybv/john_le_carres_final_novel_silverview_came_out.json": "Hi all,\n\nI just thought I'd throw a very strong recommendation on here that you check out\nthe new novel by the late John le Carre. It was in a mostly completed state when\nhe passed away, and his son (writer Nick Harkaway) ran it the last few steps to\npublication.\n\nI've just now finished it, and I'll…",
  "data/reddit-books/r/books/comments/q73m29/we_have_always_lived_in_the_castle_by_shirley.json": "I just finished this book a couple of days ago and had an interesting experience\nwith it. I didn’t really love the book while I was reading it and didn’t really\nfeel like I was fully processing what I was reading, but once it was over and I\nstarted to unpack the story, I found it really…",
  "data/reddit-books/r/books/comments/q788qr/should_books_be_kept_in_the_same_condition_as_you.json": "I have been reading books for my own enjoyment for 5 years now and I have\nnoticed something that I do which apparently is very weird among my friends who\nalso read a lot.\n\nThe thing is I am obsessed with taking care of my books and I always want to\nkeep them in perfect conditions (If you saw my…",
  "data/reddit-books/r/books/comments/q79uxt/reading_the_his_dark_materials_series.json": "Hey bookies,\n\nLong time lurker. I watched the \"his dark materials\" tv show and it really got\nme inspired to read the books. When I was in middle school I read the Subtle\nKnife not realizing it was part of a series.\n\nComing back as an adult--man oh man! I don't claim to be a book scholar so…",
  "data/reddit-books/r/books/comments/q7qgkp/outliers_by_malcolm_gladwell_so_much_for.json": "Why are some people super successful that the whole world knows who they are?\nWhat separates them from the rest? Why aren't YOU that person? Easy, they just\nwork harder than you. LOL no. I love the opening chapters of this book because\nit gives you the familiar synopsis \"This self made man was born…",
  "data/reddit-books/r/books/comments/q7uuef/ive_read_4_books_in_the_last_45_weeks_and_im.json": "I'm proud of myself, because I'd done that a long time ago. I have difficulties\nwith starting new things (including reading new books), and I'm starting to\nfight it down.\n\nWhat I've been reading: Wings of Fire by Tui T. Sutherland - the first five\nbooks. I'm on book 5, \"The Brightest Night\".\n\nThese…",
  "data/reddit-books/r/books/comments/q7w9n1/i_just_finished_reading_the_seven_husbands_of.json": "This book was widely recommended so it shot at the top of my TBR, and it did not\ndisappoint! I know a lot of people talk about really falling in love with\ncharacters in books and to some extent while I always liked certain characters,\nI never had that \"love\" for them that I see other people…",
  "data/reddit-books/r/books/comments/q7wxun/whats_a_word_you_would_not_know_if_it_werent_for.json": "I saw a similar discussion in r/fantasy [/r/fantasy] and I wanted to put my two\ncents in.\n\nFor me it was sweetmeats. For years, reading historical fiction and the likes\nthere were characters eating this apparently widely spread delicacy whose appeal\nI couldn't figure out. Why did so many authors…",
  "data/reddit-books/r/books/comments/q8bkld/i_did_not_expect_pride_and_prejudice_to_be_so.json": "I knew absolutely nothing about this book when I started it, and for some reason\nmy prejudice was that it was going to be an old, not-terribly-interesting\n\"classic\" book.\n\nInstead, I'm finding that in addition to the characters themselves being witty\nin their dialogue, the narrator is also mocking…",
  "data/reddit-books/r/books/comments/q8f067/the_idiot_by_dostoevsky_i_was_diagnosed_with.json": "I see myself so much in the main character, Prince Mushkin. I've always heard\nthe phrase 'representation matters', but I never applied it to myself because it\nwas \"meant for books for kids\" and I \"didn't need it.\" Turns out, I did. I was\ndiagnosed with a seizure disorder a couple of years ago and it…",
  "data/reddit-books/r/books/comments/q8kgsf/it_annoys_me_when_females_protagonists_behaves.json": "I encounter this constantly in more lighthearted fiction, like those\n(urban)fantasy books with that female protagonists on the cover. The\nprotagonists has a mentor/love interest who she gives the role of a father\nfigure, and she is constantly whining, pouting, crying, nagging and throwing\ntantrums &…",
  "data/reddit-books/r/books/comments/q8v9v8/i_just_finished_the_mistborn_trilogy_and_enjoyed.json": "Hello, everyone. I went on a Mistborn Trilogy marathon and finished all the\nthree books one after another. For the most part I was not bored but I was\ngrowing tired of it in the third book. Regardless, I really liked the series. I\nthought the ending was very satisfying. I really liked the direction…",
  "data/reddit-books/r/books/comments/q8ytg1/what_are_some_books_that_you_enjoyed_but_wouldnt.json": "I got thinking on this subject because I recently read the \"Hellenic Traders\"\nseries by Harry Turtledove. It follows two cousins who operate a trading ship\nfor their family's business in the late 4th century BCE, starting about 12 years\nafter the death of Alexander the Great and into the wars of his…",
  "data/reddit-books/r/books/comments/q9apna/which_books_written_by_men_do_you_think_are_good.json": "Sorry, this is my first post, so try to go easy on me.\n\nI’ve read a lot of articles (and books for that matter) that say that a lot of\nmen can’t write women in a realistic way, and I agree almost wholly (from what\nI’ve read). So I want to know those that you’ve liked! I usually read\nfeminine-centric…",
  "data/reddit-books/r/books/comments/q9as11/we_need_to_talk_about_kevin.json": "I just finished We Need to Talk About Kevin, and now I feel a need to talk about\nit.\n\nHow did you interpret it? Was Kevin really born evil? Or did he become evil?\n\nWhen reading reviews I feel like most intrepted Kevin as evil or at least a mean\nchild. But with the exception of the murders at the…",
  "data/reddit-books/r/books/comments/q9bve3/ants_invading_my_pretty_hardcover_book_help.json": "One of my rare very beautiful hardcover books had somehow been invaded by ants.\nI pulled it out and realised there were ants coming from somwhere. I shook it on\nthe floor and ants fall out. I realised they had quite a small army nestled in\nthe neck of the book. When i open it the space between the…",
  "data/reddit-books/r/books/comments/q9itxe/a_few_words_on_anxious_people_by_fredrik_backman.json": "Have I ever been more annoyed by all the characters in a book? Probably not.\nHave I ever sympathised more with all the characters in a book? Also probably\nnot. This book created such situations when I didn't know what I should feel for\nsomeone, one page I was enraged with them, the next one I was…",
  "data/reddit-books/r/books/comments/q9jt71/so_we_all_know_we_hate_a_completely_incompetent.json": "I always love when the heroine in my books get into some life or death situation\nand I’m sure a lot of people feel the same. I also know the large majority don’t\nlike heroines who can’t think for themselves and make stupid decisions, almost\ngetting themselves killed until the hero swoops in and…",
  "data/reddit-books/r/books/comments/q9q5tq/your_favorite_random_find.json": "Not books picked up because you had the author recommended to you or because you\nrecognize the title, but geniune random picks off the shelf of a bookstore or\nlibrary that you found yourself gravitating to for whatever reason and just\nwanted to read, sight unseen.\n\nThere have been plenty of duds in…",
  "data/reddit-books/r/books/comments/q9vb1m/so_most_people_learn_new_words_by_simply_reading.json": "That's amazing to me and I'm jealous. If I don't know a word that I've just read\nI'll look it up and figure out it's meaning and then move on past it to continue\nreading. I'm unable to learn words that way because I'll simply forget whatever\nword I looked up in a short time.\n\nIf I wanted to learn a…",
  "data/reddit-books/r/books/comments/q9vdri/emily_st_john_mandels_is_the_closest_to_kurt.json": "I've read Station Eleven and The Glass Hotel so far, and loved both, especially\nthe latter.\n\nThe way she writes reminds me so much of Kurt Vonnegut\n\n * the books are mainly about characters - the setting is a side point, even if\n   it is the future or post-apocalypse as in Station Eleven\n * all of…",
  "data/reddit-books/r/books/comments/q9xl1n/why_are_so_many_absolutely_horrible_books.json": "If you don’t know booktok is TikTok but focused on books and reading.Which in\nitself is great-a lot of my friends are on it and they seem into it and hey more\nand more people are reading so thats all good BUT ….\n\nLiterally 8 in 10 books ‘recommended’ are complete and honest trash.I decided to\ntry a…",
  "data/reddit-books/r/books/comments/q9yszy/i_finished_the_hitchhikers_guide_to_the_galaxy_in.json": "I'm so proud of myself. I finished the entire Hitchhiker's Guide to the Galaxy\nseries in 6 days. There are 6 books in the entire series so one book per day.\nNever thought I'd be able to achieve this. But I did and I'm very happy.\n\nJust wanted to let someone know about this.\n\nTo those of you who…",
  "data/reddit-books/r/books/comments/qa6okr/will_reading_improve_my_grammar.json": "Like the title says will reading improve grammar? My grammar is honestly\nterrible and I need to improve it since I’m in year 11 now. I already have books\nand I enjoy reading. But stoped reading books about 2 years ago. I’m planning to\nread a book (Sherlock Holmes) for 30 minutes a day. If I read for…",
  "data/reddit-books/r/books/comments/qajs5q/which_book_or_author_is_your_bestkept_secret.json": "a book or author you absolutely love but not that many others seem to know about\n\nfor example, I love Magda Szabo, highly recommend her work! she's very famous in\nHungary, I believe, but I haven't come across that many people who know of her\n(I'm British, found out about her because an American…",
  "data/reddit-books/r/books/comments/qammxy/what_is_your_opinion_on_translations.json": "The topic of translations is something that has been discussed many times and\nstill interests me. How much of a work, and which parts, are lost when reading\nit in translation?\n\nFor instance, plot and themes tend to translate pretty well. You'll have\nessentially the same experience reading 1984 or…",
  "data/reddit-books/r/books/comments/qanyiy/just_finished_wuthering_heights.json": "I can totally see why this book is either a love it or hate it with no in\nbetween. But personally, I loved the book for how much there is going on. Here\nare just some of my general thoughts and insights:\n\n * I loved Catherine's character a LOT considering how I primed myself to\n   dislike her given…",
  "data/reddit-books/r/books/comments/qapocm/i_want_to_try_reading_books_but_i_feel_like_i.json": "For years I've been neglecting various common areas of my life (health/self care\netc), and I know this isn't the subreddit for that stuff, but I hope this post\nabout my struggles with reading is okay, as I've recently been trying to\ncapitalize on these small moments when I want to make change.\n\nTo…",
  "data/reddit-books/r/books/comments/qaqarl/my_favorite_book_probably_isnt_good.json": "So my favorite book is a Week of Mondays. It's a YA novel so it's basically a\nwritten teen movie. It's about a girl who has a fight with her boyfriend and the\nnext day she gets broken up with. She has to repeat that day 7 times til she\n\"gets it right.\" Spoiler alert she ends up with her bestfriend…",
  "data/reddit-books/r/books/comments/qaqwzt/i_am_alice_hoffman_im_the_author_of_the_practical.json": "I’m a New York Times bestselling author. I wrote my first book in 1974 when I\nwas twenty-one, while at Stanford. Some of my notable novels include Aquamarine,\nPractical Magic, The Museum of Extraordinary Things, The Marriage of Opposites,\nand Faithful. Reese Witherspoon picked, The Rules of Magic,…",
  "data/reddit-books/r/books/comments/qare16/happy_halloween_here_are_100_free_ebooks_of_ghost.json": "Project Gutenberg [http://www.gutenberg.org/ebooks/search/?sort_order=downloads]\nis a great online resource for free public domain ebooks. These books are mostly\nolder text since they are no longer under copyright.\n\nIf you'd like more free books check out r/FreeEBOOKS [/r/FreeEBOOKS]\n\n * 1 - Famous…",
  "data/reddit-books/r/books/comments/qb2zsa/a_worrying_trend_among_popular_discussion_posts.json": "Something I've noticed lately are highly trafficked low karma threads that all\nhave titled along the lines of \"X popular work is garbage\", and the OP generally\nmakes huge and sweeping generalizations about the genre of the work, the people\nwho enjoyed it, and really anything they can. The OP…",
  "data/reddit-books/r/books/comments/qbcdqv/going_bovine_by_libba_bray.json": "Has anyone else read this one? I’ve never hear anyone mention it, and that’s\ndisappointing, because this is one of the most unique and fun books I’ve ever\nread. It really did give me the same feeling as Hitchhiker’s Guide and\nDiscworld, while also standing on its own. I’m surprised with all the…",
  "data/reddit-books/r/books/comments/qbdqxn/im_thinking_of_ending_things.json": "Does anyone know what the driving instructor scene in the book is supposed to\nmean? The girl is telling the story so does that mean that Jake doesn’t\nremember? Jake also doubts the memory and thinks it’s mostly falsified.\n\nIs this scene about someone who abused Jake? There’s also a call in this…",
  "data/reddit-books/r/books/comments/qbeef0/you_can_find_nk_jemisins_broken_earth_series_in.json": "Why is that the case? Jemisin is a relatively prevalent author. I can see no\nreason why her series would not be readily published in hardcover, much less why\nprices would be so astronomical. Does anyone have any insight regarding this,\n(or any obscenely overpriced books for that matter)?\n\nI should…",
  "data/reddit-books/r/books/comments/qbgz0c/why_would_a_book_say_is_authorized_for_sale_or.json": "A friend of a friend knew that I was approaching an application for a PhD in\ncomputational linguistics and their roommate had a bunch of similar books they\nwere looking to get rid of.\n\nTheir extra books turned out to be about $538 in books that I don’t have to buy\nbut many of them say authorized…",
  "data/reddit-books/r/books/comments/qbif95/audiobooks_are_quite_something_too.json": "Reading books has always been a joy to me and during my life, it seems to me\nthat I have found many gems in every field, but only recently have I plunged\ninto audiobooks. Before that, I needed time and a suitable silent environment to\nenjoy reading. Chores which previously were occupying my time are…",
  "data/reddit-books/r/books/comments/qbkpy3/piranesi_by_susanna_clarke_is_a_masterpiece.json": "(No spoilers) Piranesi by Susanna Clarke is a deep, wonderful, page-turner of a\nfantasy novel that evokes feelings of loneliness, liminality, and tension at the\nsame time. The novel is largely about one’s connection with the world around\nthem, about slowing down and appreciating the world, whatever…",
  "data/reddit-books/r/books/comments/qbvsdj/the_long_way_to_a_small_angry_planet_by_becky.json": "I wanted to toss this recommendation out there, because I saw Chambers getting\nrecommended over in PrintSF for like a few years now. I finally gave a few of\nher books a shot and they're among the best I've read all year.\n\nShe deals in smaller-scale stuff--no grand space operas, no worlds at…",
  "data/reddit-books/r/books/comments/qbxz9r/about_anna_kareninas_translations.json": "I have read the first page of Anna Karenina in five different translations now\n(Bartlett, Garnett, Garnett revised, Maude and P&V) and I have realized that the\noriginal Garnett translation is the only one that does not read like a\ntranslation but rather as a book originally written in English. And I…",
  "data/reddit-books/r/books/comments/qbyzw9/what_are_the_worst_books_youve_ever_read.json": "Not only bad books, with a weird writing style, bad plot and horrible\ncharacterisation, but also books that you’ve started thinking they were going to\nbe great, and were instead quite underwhelming.\n\nI’ve had a few of those recently, and it always makes me so unreasonably upset.\nBooks that were…",
  "data/reddit-books/r/books/comments/qc72sd/i_always_thought_james_and_the_giant_peach_by.json": "I did not expect such abuse and cruelty to be written out so plainly. Even the\ndeath of Aunt Spiker and Aunt Sponge by literally crushing them was not on\ncourse with my expectations.\n\n\"There was a crunch. And then there was silence. The peach rolled on. And behind\nit, Aunt Sponge and Aunt Spiker lay…",
  "data/reddit-books/r/books/comments/qcby9k/im_rereading_pride_prejudice_for_the_first_time.json": "Who was going to tell me this book is hilarious? I'm only in chapter 21, but\nEliza and Darcy unconsciously flirting by screwing with each other; the straight\nman comedy duo of Mr. and Mrs. Bennett; Mr. Collins' pomposity and just\nbullheaded self assurance (i.e.deciding he totally can introduce…",
  "data/reddit-books/r/books/comments/qclte8/books_reviews_by_my_nephew_from_belarusian_jail.json": "My nephew (23 yo) is now in the Minsk jail. I received a letter from him where\nhe wrote mini-reviews of the books that he read. I thought that someone might be\ninterested in his thoughts about books and I could pass on your comments to him.\n\n\n\nJohann Wolfgang Goethe - \"Faust\"\n\nImmortal classic of…",
  "data/reddit-books/r/books/comments/qcrdz2/a_lot_of_negative_book_reviews_are_given_in_bad.json": "Question 1: What if I read Catcher in The Rye, didn't understand that it was\nabout a mentally ill child, and hated it because of how 'whiny' Holden was?\n\nQuestion 2: What if I read Dune, didn't understand that it was about the ethical\nramifications of the actions of 'great and powerful men' and…",
  "data/reddit-books/r/books/comments/qcs440/did_i_read_lolita_correctly.json": "Soooo I finished Lolita, and I gotta say... it's easily a 7 or 8 out of 10 (it\nemotionally fucked me up), buuuuut I don't understand how people can possibly\nmisconstrue this book. Humbert Humbert was an egotistical, manipulative asshole,\nand I just don't understand how he can draw in real life…",
  "data/reddit-books/r/books/comments/qcv9et/anybody_who_is_excited_for_sometime_of_apocalypse.json": "I just finished listening to The Road and damn I have not had a book consume me\nlike that in a long time! I literally started it during my morning workout,\nlistened to it on my commute to work, and listened to it while at work, and\nfinished it when I got home. I literally sat in silence for 30…",
  "data/reddit-books/r/books/comments/qcvbqk/if_you_had_a_hidden_room_behind_a_bookshelf_which.json": "I am actually planning to build a hidden door with a bookshelf (don't tell\nanyone!) and I'm looking for recommendations that make a clever comment with the\nauthor / title combo like No one here gets out alive by Jim Morrison or\nsomething that only makes sense to those that have read the book like…",
  "data/reddit-books/r/books/comments/qcvwzu/just_read_fahrenheit_451_and_cant_get_something.json": "Something that has really jolted me is the realization that how similar our\nworld is to the dystopia Bradley has created, it's almost prophetic. We don't\nhave firemen burning books sure, but don't we all spend so much of our leisure\ntime simply scrolling down a screen, with no apparent motivation,…",
  "data/reddit-books/r/books/comments/qd1pln/i_just_finished_eat_pray_love.json": "And y'all, I'm not going to lie, it was hard to finish. I liked the overall\nconcept of her story, but and I didn't mind the first part (Italy). Well, the\nfirst half of the first part. After that, I found her to be incredibly annoying\nand entitled- like when she wanted to be level 2 of her Italian…",
  "data/reddit-books/r/books/comments/qdbhuk/literary_conspiracy_theories.json": "Growing up in the global south, a lot of my exposure to literature was either\ncommercial fiction or required reading in school. I never really delved deep\ninto world literature until I was grown. So that's when I started finding all\nthese conspiracies like Shakespeare not having written his own…",
  "data/reddit-books/r/books/comments/qddqdm/how_do_yall_deal_with_books_with_too_many.json": "…and no I’m not referring to different POVs like ASoIaF. Those are bearable.\nCurrently reading King’s The Stand and for those who have read the book, I think\nyou get the picture here. As I move from chapter to chapter, my mind was like\n\"Okay, now who’s this?\" \"Are you the preggy girl?\" etc. and…",
  "data/reddit-books/r/books/comments/qded7q/reading_1984_helped_me_understand_myself_a_lot.json": "I ran out of data so I started reading again on my morning commute and I figured\nI might as well read 1984 so I can have my own opinion.\n\nIt's a really horrible world. I don't really see much hope for humanity,\nalthough there's obviously a lot we don't know. The fact it gave such a visceral\nreaction…",
  "data/reddit-books/r/books/comments/qdh57y/hatchet_gary_paulson.json": "Read it as a 28 year-old Swede, I've heard it's very common in American schools.\nChecked it out due to living (almost) in the wilderness myself. I also read\nsomewhere that it inspired Ellie’s chapter in The Last of Us. Got through it in\ntwo nights and really enjoyed it. Sympathetic main character…",
  "data/reddit-books/r/books/comments/qdjr0t/crime_and_punishment_is_a_fantastic_book_it_made.json": "Lots of people are discouraged by the Russian setting and hard topic of this\nclassic, but I must admit it's actually genius. It is ambitious and hard to read\nat times, but it really pays off. The themes through the book, which cover not\nonly the titular problem of evil and punishment, but also our…",
  "data/reddit-books/r/books/comments/qdk6sm/anxious_people_by_fredrick_backman.json": "I just want to know how many of you all have read that book.\n\nI read it couple of months ago and every now and then I smile to myself when I\nremember the plot. The plot is so simple yet so fun. Use of vocabulary is\namazing and dialogues are beautifully written. Its truly a fun read with a…",
  "data/reddit-books/r/books/comments/qdlhfl/this_might_be_such_an_unpopular_nitpicky_thing_but.json": "Books that drop real life celebrity names or brands or pop culture completely\ntake me out of the moment. I can’t even explain why, you would think these\nthings would make the story feel more grounded in reality, but for me I just\nlose interest. Maybe it’s because it has the potential of becoming…",
  "data/reddit-books/r/books/comments/qdmzt9/i_hate_when_books_describe_a_characters.json": "They present a character, I get a rough idea of what he might look like and then\n40 pages later they describe him in detail and it's nothing like the person I've\nbuilt in my head. Now I have to consciously try to change the character's\nappearance when it's too late and the unfitting visual I've…",
  "data/reddit-books/r/books/comments/qdo2ha/dan_browns_angels_and_demons_has_been_on_the.json": "Just curious which titles everyone comes across while browsing for secondhand\nbooks. Dan Brown novels in general can be found there, but Angels and Demons in\nparticular seems available anywhere books are sold for a dollar, at least in my\narea.\n\nI also regularly see copies of The Pillars of the Earth…",
  "data/reddit-books/r/books/comments/qdo5wl/the_silmarillion_was_a_roller_coaster_for_me.json": "So I just finished reading silmarillion and it was definitely a book which gave\nme mixed emotions..\n\nThere were parts that made me want to stop reading it, I nearly fell asleep\nduring the first few chapters. It was a difficult read at times if I'm honest.\n\nBUT there were parts where I was like oh…",
  "data/reddit-books/r/books/comments/qdq10t/following_on_from_the_post_about_books_commonly.json": "I live in New Zealand (hence op shop) and at uni I studied Wednesday's Children\nby New Zealand author Robin Hyde. The book is no longer in print and in order to\nstudy it we had to purchase an A4 sized photocopy of the entire book (obviously\ndone legally for study purposes). I had always looked out…",
  "data/reddit-books/r/books/comments/qe1tg8/pro_tip_for_getting_more_from_libby.json": "Pro tip to save money on ebooks/audiobooks by more effectively using Libby:\nQueue up a bunch of books that you’re interested in. You can set a hold as\ninactive and say to not check it out until 30 days later, change your settings\nto not auto checkout so that you can choose to “Deliver later” even if…",
  "data/reddit-books/r/books/comments/qe2xh9/what_book_do_you_wish_you_could_read_again_for.json": "You know when you read a really good book or series and you just feel like\nyou’re life is over once you’ve finished… and you’d give anything to relive it\nagain as if it’s the first time. Maybe it’s the twists or the emotions or the\ncharacter interactions. What’s a book you wish you could experience…",
  "data/reddit-books/r/books/comments/qe33qi/the_shining_is_phenomenal.json": "This was my first book written by Stephen King and my first horror book in\ngeneral. I really liked this book. It really creeped me out and I had a\nperpetual sense of unease while reading it. I felt like I was being watched for\na long time after I was done reading the book. The characters were great.…",
  "data/reddit-books/r/books/comments/qe70m2/i_never_have_a_clear_picture_of_a_character.json": "Does anybody else have the issue where they can never really /visualise/ a\ncharacter? Like they can tell me that the nose is tall and his eyes turn\ndownwards and I just won’t be able to create a face in my mind. I feel like it\nhas never been an issue bc I am more in tune with the vibe of the…",
  "data/reddit-books/r/books/comments/qed667/anyone_here_read_nos4a2_by_joe_hill.json": "Honestly man, this book, I've only read one of his other books, heart shaped box\n(which was amazing) but man oh man, nos4a2 has me fucking hooked!!! I'm about\n3/4 through the book and I've never been more gripped on any other book (I\nhaven't read a lot, only hunger games, hobbit and lotr) but guys…",
  "data/reddit-books/r/books/comments/qedei2/anyone_else_always_read_the_introduction_after.json": "I read a lot of classics. In fact, I'd say that it's my favorite \"genre\" (using\nthe term loosely as obviously classics are of all different genres), but it\nalways seems as though the introductions are aimed at people who are rereading\nand picking up a new edition or translation, rather than first…",
  "data/reddit-books/r/books/comments/qedky3/the_trial_is_something_else_and_it_has_a_unique.json": "I just recently finished reading the \"The Trial\" by Franz Kafka after two months\nreading through it, believe it or not. I trudged through the novel is because I\nfound it difficult to keep engaged on the story for its long winded, indirect\nstory-telling, which I made a…",
  "data/reddit-books/r/books/comments/qeeyk5/buy_your_books_early.json": "Germany faces a paper shortage so acute one of the country’s largest publishers\nhas warned Christmas shoppers to buy books now in case they run out over the\ncoming weeks\n\nA perfect storm of turbulence in global supply chains has led to the shortage.\n\nThe price of wood, which is pulped for printing…",
  "data/reddit-books/r/books/comments/qehow3/slaughterhouse_5_kurt_vonnegut_jr.json": "My uncle in Japan gave me this book last time I saw him over 3 years ago, and\ntold me that he read it while he was learning English. I’ve never been into\nbooks so I only recently got around to reading it. The nonlinear storytelling\nwas a little disorienting at first but eventually it became…",
  "data/reddit-books/r/books/comments/qeinij/i_finished_a_child_abuse_and_neglect_class_some.json": "So, I read the book \"No Language but a Cry\" by Dr.Richard D'Ambrosio. The name\nof \"Laura\" was supposedly used in the game \"Fatal Frame\" as inspirartion from\nthe book. I don't think the memoir is read a lot. It just left a huge impact on\nme about the struggles of human nature but also the inner…",
  "data/reddit-books/r/books/comments/qeloq8/what_is_a_series_you_think_should_have_been_huge.json": "I feel like the Dark Tower series should be known by all and I feel like if it\ncame out later with the internet in every house and better effects for the\nmovies to be made earlier it might have but you never know. It’s big in its own\nright but not like Harry Potter. What series do you think should…",
  "data/reddit-books/r/books/comments/qeutwc/whats_the_one_line_that_stuck_with_you_after.json": "And do you think it reflects more about you and the values you actually already\nhad while you were reading it?\n\nFor me, i read brothers karamazov and in the gajillion words it contain, the\nsentence i automatically remember from it was ivan's line: i respectfully return\nthe ticket. When i read it i…",
  "data/reddit-books/r/books/comments/qewsku/why_are_people_annoyed_by_the_encyclopedic.json": "Having read all 4, it seems to me that there the digressions on Waterloo &\nAbbeys in Les Miserables and the Cetology of Moby Dick were essentially the\nequivalent of world building that we would see in a lot of 20th century genre\nfiction such as Lord of the Rings with the descriptive songs and lore…",
  "data/reddit-books/r/books/comments/qezgk6/what_feels_annoyingly_repetitive_over_the_course.json": "For me it is when the (typically) fantasy protagonists has to face more than\nthree enemies at once in some kind of a fight for life. One of the most\nrepetitive playouts of this kind of scene is that the protagonist is said to\nknow better than to believe he could get alive out of this and a few…",
  "data/reddit-books/r/books/comments/qf3r8o/if_you_read_lots_of_books_what_job_do_you_have.json": "I know that a lot of different jobs technically give you enough time to read\nbooks, but I am interested in an anecdotal and completely unscientific poll of\nwhat jobs/careers you have as avid readers. Occupations which don't stress you\nout in the evenings and allow you to maximse your reading…",
  "data/reddit-books/r/books/comments/qf44rn/the_egg_by_andy_weir_is_a_concise_summary_of.json": "Siddhartha was a difficult read for me as I would put the book down after\nreading a few pages. There are pages that really strike you but I felt dumb as I\nthink I wasn't grasping the real message that was being conveyed (Another read\nis on the cards)\n\nThe Egg by Andy Weir is a great summary of sorts…",
  "data/reddit-books/r/books/comments/qf651e/the_three_musketeers_is_really_great.json": "I'm about 200 pages in, and enjoying the straightforward, concise writing. Its\nword use is artful without being overly flowery, and its efficiency in setting\nscenes, establishing motivations, carrying the plot forward while hooking the\nreader with intrigues for the future is almost unbelievable.…",
  "data/reddit-books/r/books/comments/qf8tzg/movies_better_than_the_book.json": "While the old adage that “the book is always better” is usually true I’ve\ninterestingly come off two reads recently where I thought the movie was done\nbetter: The Life of Pi and, The Prestige\n\nGranted I watched the movies first and didn’t get the true book experience,\nhowever with the prestige in…",
  "data/reddit-books/r/books/comments/qfcs5e/an_underrated_line_from_to_kill_a_mockingbird_by.json": "“There are just some kind of men who—who’re so busy worrying about the next\nworld they’ve never learned to live in this one, and you can look down the\nstreet and see the results.”\n\nAfter reading this line, it’s easily been my favorite book. What’s that specific\nline or quote that made you say, “Yup.…",
  "data/reddit-books/r/books/comments/qff110/diagnosed_with_adhd_years_ago_i_finished_my_first.json": "Just read The Shining by Stephen King and I gotta say, wow! Haven’t had a book\nkeep me that engaged for a very long time. I love how in the book Jack actually\ncared about his family, versus the movie where he looked like he wanted to kill\nthem in the first scene lol. Loved seeing the slow…",
  "data/reddit-books/r/books/comments/qfnetm/unpopular_opinion_poems_and_songs_within_novels.json": "I read a fair bit of fantasy, and it seems as though quite a few fantasy authors\nfancy themselves as poets as well. I don't have an intrinsic problem with poetry\n-- I have several favorites that I find are wonderful. However, when they are\ninserted into books, I pretty much universally hate them.…",
  "data/reddit-books/r/books/comments/qfv2yz/flowers_for_algernon.json": "So it's been a couple of weeks since I read Flowers for Algernon. I'm really\nthinking that it's my favorite book of all time. I know some may think it's not\nthat profound, but for me I definitely believe it is a literary masterpiece,\nespecially for it's time. I guess it's the whole concept of a lab…",
  "data/reddit-books/r/books/comments/qg3cce/the_most_disappointing_book_youve_ever_read.json": "Here's a question. Which is the most disappointing book you've read and why\nwould you not recommended it to anyone?\n\nSo after all the hype and talk, I grabbed The Midnight Library by Matt Haig and\nThe Push by Ashley Audrain.\n\nUnpopular opinion but the Midnight Library disappointed me. The entire…",
  "data/reddit-books/r/books/comments/qgi4fy/i_struggle_to_read_fiction_because_of_how_women.json": "It seems like in every novel I read women are sexualised? Like can they not\nexist in any other context? Can they not have more plot than romance?? So many\nmale characters go by without any real reference to how attractive they are. But\na woman appears and immediately we must know: is she hot? Almost…",
  "data/reddit-books/r/books/comments/qgtdbv/how_does_the_current_generation_view_the_flashman.json": "I was going through my kindle library and came across my collection of Flashman\nnovels. I enjoyed these immensely, and am about to start reading them again.\n\nIt did make me wonder, though; although these books are a savage lampoon of the\nupper echelons of Victorian society at the height of the…",
  "data/reddit-books/r/books/comments/qgv90y/i_dont_think_the_a_song_of_ice_and_fire_will.json": "I did a little math. George R. R. Martin is 73 years old. His a song of ice and\nfire books were realeased from 1996 until today. His longest time to release a\nbook was book 5 (I haven't taken book 6 because it is not released). If we take\ndistance of time the book we waited for longest (because…",
  "data/reddit-books/r/books/comments/qh4381/we_are_rclassicbookclub_join_us_for_a_reading_of.json": "Hello r/Books [https://www.reddit.com/r/Books/]! We are a small reading\ncommunity called r/ClassicBookClub [https://www.reddit.com/r/ClassicBookClub/],\nand we read and discuss a chapter of a classic book each day in a dedicated\nspoiler free discussion thread.\n\nOur readers nominate and vote on the…",
  "data/reddit-books/r/books/comments/qh5o84/i_finished_reading_the_book_piranesi_by_susanna.json": "and it was amazing. I loved the mystery and atmosphere of the world she built.\nAfter reading it I could just imagine exploring that place, discovering new\nstatues, finding my way through the labyrinth.\n\nI'd say the first half of the book was my favorite, as the story unfolded it was\nstill good, but…",
  "data/reddit-books/r/books/comments/qhes0y/discovered_exhalation_stories_by_ted_chiang.json": "I really love science fiction like Snowcrash and Hyperion. The librarian around\nthe corner recommend Exhalation, citing a philosophical underpinning.\n\nI also love short stories and this explores short stories. The ones I've read so\nfar deal with regret, coping with mortality, the incompleteness…",
  "data/reddit-books/r/books/comments/qhhlvw/should_i_read_classics_if_i_dont_necessarily.json": "As a younger reader, I am interested in reading the classics and have read some\nof them eg.1984, The Outsiders, Catcher in the Rye, Lord of the Flies etc. I\nknow classics become classics because they bring new ideas to the table or have\nsome deep allegorical meaning, and after reading some of these…",
  "data/reddit-books/r/books/comments/qhizpf/what_genres_do_you_avoid_and_why_readers_of_that.json": "Lots of genres come loaded with assumptions and stereotypes. Sci-Fi and fantasy\nare for \"nerds\" Romance books are for women etc. Because of this there must be\nloads of good books people miss out on.\n\nPersonally, I avoid political/spy thrillers because I stereotype them as \"dad\nfiction\" and assume…",
  "data/reddit-books/r/books/comments/qhkvgg/who_else_like_to_jump_between_unfinished_books.json": "In the past I honestly hated to jump between books while reading them, mostly\nbecause I loved the feeling of finishing one so much.\n\nBut, I also had to fight myself through a whole book sometimes, otherwise I\nfelt..., like leaving the book behind, incomplete.\n\nBut nowadays it feels nice to jump…",
  "data/reddit-books/r/books/comments/qhmduc/im_roger_luckhurst_and_ive_got_a_new_illustrated.json": "I’ve been teaching the Gothic and Science Fiction at university for over 25\nyears here in London, and I’ve edited classics such as Stevenson’s Dr Jekyll and\nMr Hyde, Bram Stoker’s Dracula and H. G. Wells’s The Time Machine. I’ve written\nbooks about topics that range from the invention of the concept…",
  "data/reddit-books/r/books/comments/qhq6a4/im_really_sad_that_ive_missed_out_on_all_the.json": "I saw a bunch of people raving about this book in a book suggestion thread so I\ngot the audio book from my library.\n\nMy God.... it's like Eric Cartman dropped out freshman year, pounded out an\nincel manifesto and drowned it in Deus ex machina.\n\nHow is every female character a manic pixie dream girl?…",
  "data/reddit-books/r/books/comments/qhtxng/the_remains_of_the_day_is_a_subtle_masterpiece.json": "A slow read, not too dissimilar to Stoner (another incredible book), Kazuo\nIshiguro's \"The Remains of the Day\" is a great read. You wouldn't imagine having\nso many things in common with a Butler, but so many of his thoughts ended up\nresonating me in one way or another.\n\nThe scene of his heartbreak…",
  "data/reddit-books/r/books/comments/qi7hhl/i_feel_so_crappy_when_finishing_a_book.json": "The more I liked a book, the more bad I feel when I finish it. It's like there\nis an emptiness inside of me and suddenly a part of me is missing. I realize the\nworld that I \"came back\" to and I feel so disappointed. I imagine how the world\ncould be if we lived inside a world from the books,…",
  "data/reddit-books/r/books/comments/qi8ehs/inaccurate_representation_is_a_weird_selfcentered.json": "Whatever the subject is in books (or any other media) You read reviews talking\nabout how inaccurate and unrealistic that insert group of people here is.\n\nYou see that criticism on books written by authors of that group or not.\n\nMy problem with that type of criticism is how self centered it is. To…",
  "data/reddit-books/r/books/comments/qi9wya/what_book_series_did_you_enjoy_so_much_that_youd.json": "I love massive book series, especially sci-fi/fantasy. I really wish I could\nforget about and read The Wheel Of Time again for the first time. A few others\nwould be Harry Potter, Runelords, The Culture series or Discworld books.\n\nI want to hear which books made you so emotionally invested in the…",
  "data/reddit-books/r/books/comments/qia9xy/how_do_you_guys_finish_reading_52_books_per_year.json": "I am a full time student and I generally try to read a book when I can but I\nnever can finish even 5 books a year. I am pursuing Mechanical Engineering so\nthat can be why I am too afraid to give more time to reading other books than\ncourse books due to the course load. So I want to know how do you…",
  "data/reddit-books/r/books/comments/qif57w/just_finished_the_shadow_lands_by_elizabeth.json": "No spoilers, just looking to talk about the quality of the book.\n\nI was blown away by this book. Her prose is so evocative and elegant, the\ndescriptions so vivid, the pacing quick yet not rushed.\n\nThe main characters are complex and layered in such a way that you become hungry\nto know them more…",
  "data/reddit-books/r/books/comments/qinqcn/does_a_book_have_to_say_something_to_be_good.json": "Does a book need an actual message to be good? To have something to say?\n\nOf course \"goodness\" is subjective, in the eye of the beholder etc...\n\nBut still, does a book about nothing have less value than something that\nactually has a message?\n\nCan a book about nothing, just pure power fantasy or wish…",
  "data/reddit-books/r/books/comments/qiu1rx/ive_read_3_murakami_books_and_cant_get_over_how.json": "I’ve now read Norwegian Wood, Wind-Up Bird Chronicle, and Colorless Tsukuru\nTazaki by Murakami. I generally enjoy his writing style and I feel pulled in by\nhis stories which has kept me coming back to his works. I just cannot get over\nhow he writes women. They seem to solely exist as sex objects to…",
  "data/reddit-books/r/books/comments/qiunni/the_amount_of_views_you_can_read_frankenstein_is.json": "I recently read and finished Frankenstein and it was one of the best pieces of\nliterature I have ever read.\n\nThe way It was written was so unique and the amount of perspectives you can read\nit in is extremely impressive. Some perspectives I don't really comprehend\ncompletely yet. Especially the…",
  "data/reddit-books/r/books/comments/qj19hj/i_have_finished_my_first_book_in_years.json": "The book was Halo: Cryptum by Greg Bear\n\nReading lost its appeal for me a long time ago, and it was hard to stay focused\non words on a page for years, but today I finished my first book in years and I\nam so happy. It's a small achievement, but an achievement nonetheless. I'm going\nto start reading…",
  "data/reddit-books/r/books/comments/qj3nwl/rereading_the_great_gatsby_and_i_love_it.json": "I believe three years ago, back when I was in 11th grade, I read The Great\nGatsby (it was one of three choices) for my English work. I liked it a lot back\nthen, but I don't recall grasping it all. There were times when I was confused\nreading the story. Since I decided a week ago that I was going to…",
  "data/reddit-books/r/books/comments/qj5hpn/reading_addiction.json": "So many people post about reading their first book in years, or having a hard\ntime getting back in the habit of reading. This post is IN NO WAY a knock on\nthem and I have nothing but respect for those who have been trying to pick it\nback up.\n\nThat being said, though, I just can’t imagine not…",
  "data/reddit-books/r/books/comments/qjcakx/so_i_recently_started_rereading_house_of_leaves.json": "I recently started try to re-read House of Leaves...and I had honestly forgotten\nthat the book is a friggin' acid trip in writing, to the point that I am\ngenuinely wondering if I should let that beast lie. However, trying to take\nanother bite at this beast got me thinking about a question to ask you…",
  "data/reddit-books/r/books/comments/qjg8jt/alternate_platform_to_goodreads.json": "I have been using goodreads as a source for books for many years now, but the\ndeclining quality of the website, lack of maintenance and the still lacking\nsupport of a night mode (which I require to actually survive looking at the page\nin the dark) hare driving me away from it more and more.\n\nAnother…",
  "data/reddit-books/r/books/comments/qjofr6/an_english_professors_perspective_on_the_modern.json": "Hi everyone, English professor here. I got motivated to make this post because\nthis weekend I finally finished an undertaking that you would think would be\ncommon in my profession but actually is not: I finished reading every book on\nthe Modern Library's list of the 100 greatest English language…",
  "data/reddit-books/r/books/comments/qjona3/does_your_reading_ruin_your_sleep.json": "Just looking for others that understand my woes! If I start reading a book and I\nlike it I can't stop until I finish it which means I don't go to bed until late.\nOr once I finish one if I can start the next one in the series I have to start\nthat one \"a little bit\".\n\nIf I do manage to sleep without…",
  "data/reddit-books/r/books/comments/qju8mq/whats_your_weird_book_behavioropinion.json": "I've often been told not to judge a book by it's cover, but I'm curious: How\nelse are you supposed to choose? Something must grab you in order for you to\nchoose a book to read. Sometimes it makes logical sense; for example, you might\nchoose a book because you've read the author before and enjoyed…",
  "data/reddit-books/r/booksuggestions/comments/pz9vtj/i_need_some_suggestions.json": "I want a female protagonist. She should be successful in her career. Also, she\nshould not be with men. I don’t care about her sexual orientation but I just\ndon’t want a woman’s love story. I want more.\n\nI’m okay with both modern or classics but you should know that I’m not a native\nenglish speaker.…",
  "data/reddit-books/r/booksuggestions/comments/pzqxzf/japanese_literature.json": "I’m planning on buying the sailor who fell from grace today but i want some more\nJapanese literature, i don’t want some murakami i’ve read about his works and\nit’s not for me",
  "data/reddit-books/r/booksuggestions/comments/q01qoc/looking_for_a_new_addicting_bingeworthy_scifi_or.json": "I've really gotten into sci-fi and fantasy books lately and I'm looking for some\nmore series (at least 3 books, preferably longer) that I can sink myself into.\nI've read and thoroughly enjoyed the following, so I would love some more\nsuggestions that fit in the same realm of these series:\n\n *…",
  "data/reddit-books/r/booksuggestions/comments/q0fxo5/any_good_book_about_the_different_political.json": "I am looking for a non-fiction book to introduce me to politics, I would like to\nlearn what are the different political ideologies that exist, where they come\nfrom or what exactly they defend.",
  "data/reddit-books/r/booksuggestions/comments/q0ke3q/is_there_a_book_where_the_protagonist_is_sent_to.json": "Not Narnia.\n\nAnd i prefer if the protagonist got to be an adult in the fantástical world.\n\nTy.",
  "data/reddit-books/r/booksuggestions/comments/q0nxop/what_is_the_scariest_book_youve_ever_read.json": "Hey all! October is starting and I am planning to read a horror book...cliché, I\nknow, but it is the first time I do it....\n\nI have read some Edgar Alan Poe and Stephen King books, and while they are\nscary, I can manage to sleep at night.\n\nI'm still looking for a scary book that will haut me for the…",
  "data/reddit-books/r/booksuggestions/comments/q0qbcq/which_stephen_king_book_should_i_start_with.json": "I'm kind of new to the world of reading, these are the books I've read: 1984,\nAnimal Farm, Brave New World, Flowers For Algernon, Lord of the Flies, The\npicture of Dorian Gray.\n\nI've heard that Stephen King's books are really good, so I want to read one, I\nhope you guys can help me decide. Thanks!",
  "data/reddit-books/r/booksuggestions/comments/q1464x/most_disturbing_books_youve_read.json": "I love to read some dark, twisted stories, but I'm never too sure where to look.\nThese could be horror, just plain messed up, nonfiction, or even just weird to\nthe point it's off-putting. I'd love to see your recommendations!\n\nQuick edit: Great recommendations! I'm gonna start reading some of these,…",
  "data/reddit-books/r/booksuggestions/comments/q1sumy/a_book_in_which_the_internet_stops.json": "Inspired by the #FacebookDown I tried to imagine a world where the internet\nwould just stop and we would reinvent ourselves. Is there a book about this kind\nof thing? (I realize that it's a very specific question).",
  "data/reddit-books/r/booksuggestions/comments/q25zn2/any_dark_books_where_characters_have_to_make.json": "I’ve just watched Squid Game and I have some movies/shows to watch but I’d love\nany books with similar themes or stories.\n\nNamely the idea of people having to make these big moral decisions, life or\ndeath, and weighing up pragmatism vs emotions.",
  "data/reddit-books/r/booksuggestions/comments/q2jdwu/what_are_the_best_octavia_butler_books.json": "I have read Kindred, and Bloodchild and Other Short Stories, but I wanted to\nknow what are the best Octavia Butler books?",
  "data/reddit-books/r/booksuggestions/comments/q2nae1/a_book_without_violence_crimes_or_love_sex_just_a.json": "I know some people might say that those ingredients are the salt and pepper of a\nfiction book but I do not find that. It takes a great amount of talent to\ncaptivate the reader with pure and common events, with style and humour.\n\nI can give you some examples:\n\nMeasuring the world by Daniel Kehlmann…",
  "data/reddit-books/r/booksuggestions/comments/q318r6/a_hilarious_bookseries_with_a_30s40s50s_aged.json": "I feel like many books with women as protagonists in the comedy fiction genre\neither are about a burned out mother or someone trying to make it in Manhattan.\nI would love to find a series that is easy and fun to read with women being more\nthan mother/fashion guru.",
  "data/reddit-books/r/booksuggestions/comments/q3nfuq/looking_for_a_book_that_reads_like_a_feverdream.json": "The trippier the better. Fine with gore, psychological thriller, etc.",
  "data/reddit-books/r/booksuggestions/comments/q42pc0/circe_but_with_norse_mythology.json": "I absolutely adored the book Circe by Madeleine Miller. As awesome as Greek\nmythology is, I like Norse mythology more. Any books out there similar to Circe,\nbut with Norse gods? (Odin, Freya, Thor, Loki, etc)",
  "data/reddit-books/r/booksuggestions/comments/q48rya/apocalyptic_and_postapocalyptic_novels_that_are.json": "Can someone recommend some apocalyptic or post-apocalyptic books are for adults\nand have more mature themes that those found in the young adult genre? Thank\nyou.\n\nEdit: Butchered the title. I meant not in the Young Adult genre*",
  "data/reddit-books/r/booksuggestions/comments/q4mwm0/non_anti_left_right_leaning_books_that_summarize.json": "I am a left leaning person, but want to read about the perspective of the right,\nonly issue is most right leaning authors are \"Liberals stupid and bad\". Any\nperson that can just summarize their beliefs without insulting. Like a rosa\nluxemburg but on the right. I don't mind if they're solely…",
  "data/reddit-books/r/booksuggestions/comments/q4xtvb/which_really_good_books_that_had_really_bad_film.json": "I know that most books have poor film adaptation, however there are some movies\nthat not only do not do justice to the books but also do the opposite of\npublicity by changing the story, skipping important events, introducing really\nunnecessary parts or just being bad.",
  "data/reddit-books/r/booksuggestions/comments/q51loh/whats_a_book_that_had_an_excellent_movie.json": "I know this is dumb, but for the longest time I put off reading The Lord of the\nRings, simply because I figured \"Well the movies are great, so the books must\njust be like the movies.\"\n\nBut after reading the books, and having other examples like 'Do Androids Dream\nof Electric Sheep' and…",
  "data/reddit-books/r/booksuggestions/comments/q57404/a_book_where_someone_out_grows_their_demons_or.json": "Hi guys, I was recently dumped and haven't had the easiest of times coping ever\nsince. I believe that even though I loved my partner very much and they weren't\nperfect in any sense, certain qualities within me did make me a horrible person\nto be with sometimes (overthinking, passive aggressiveness…",
  "data/reddit-books/r/booksuggestions/comments/q5ad5s/what_are_some_books_that_helped_you_grow_more.json": "The kind of books I want are philosophies that solidified your world view. I\nwant a book that would help me truly see the world for it's beauty and become\nmore moral. I want a book to help me see past the earth but see the bigger\npicture. Exactly like the way Carl Sagan views the world in the pale…",
  "data/reddit-books/r/booksuggestions/comments/q5tohy/slightly_spooky_mindfck_fall_vibes_book.json": "Seeking suggestions for extremely enthralling fall vibes / spooky and mindfucky\nbooks. The kind of book where you want to snuggle under a blanket and read all\nday sipping on some tea. Nothing too scary (like not straight up horror lol) bc\nthen I’ll have nightmares lol.\n\nWill take any and all…",
  "data/reddit-books/r/booksuggestions/comments/q5w5w0/books_about_families_dealing_with_children.json": "We lost our 6 year old angel Serena to cancer 8 months and 18 days ago. She\nloved books and the two years she spent fighting cancer, we read to her every\nnight. After months of grieving, my husband and I decided to continue the the\ntradition, and now we read a chapter or two together every night.…",
  "data/reddit-books/r/booksuggestions/comments/q63m3l/1950s_housewives_drugs.json": "I’m curious if anyone knows of any books, fiction or non-fiction, that delve\ninto the topic of housewives in the 50’s & 60’s and their use of drugs like\namphetamines and barbiturates?",
  "data/reddit-books/r/booksuggestions/comments/q6e69h/religious_horror_where_evil_hides_in_a_small.json": "Something similar to Netflix’s Midnight Mass or the lindenfeld arc of\ncastlevania season 3. Or the entire Rachel sanctuary storyline if you’ve ever\nplayed ragnarok online. Also the more lovecraftian, the better!",
  "data/reddit-books/r/booksuggestions/comments/q6j4lq/whats_a_good_book_to_have_a_physical_copy_of.json": "I’m a hardcore kindle simp but my brother got me a gift card for a book store so\nI’m wondering if there are any books that are just better to have a physical\ncopy version of ??? Whether it’s good to take notes in, has key visual\ncomponents, or maybe I’ll impress some hot person on public transport…",
  "data/reddit-books/r/booksuggestions/comments/q6yy74/i_could_really_use_a_book_that_helps_me_get_over.json": "I love reading, and I’ve often turned to them when it feels like life is hard.\nMy twenties didn’t quite go as I thought they would— health issues, parental\ndeath, career took a turn.\n\nBut I want to take on this decade with hope. But a lot of books I read have\nprotagonists who are mid twenties and it…",
  "data/reddit-books/r/booksuggestions/comments/q7cl0h/being_lost_in_life.json": "Hi this is my first post here. I am looking for a fictional novel (not ya) where\nthe protagonist is lost in life and is not sure what he wants to do. I am\ncurrently going through this phase, so I want a book I can relate to. I also\nsuffer from anxiety and suicidal thoughts sometimes.",
  "data/reddit-books/r/booksuggestions/comments/q7g7d8/suggest_me_a_gripping_book_that_will_get_me.json": "I’m looking for a book that will literally be a page turner. I want to be\nthinking about it when I’m not reading it. A book that I’ll want to tell\neveryone about and seek out podcasts/YouTube videos about it. Something so\ngripping that it will make me wonder what secondary characters are thinking…",
  "data/reddit-books/r/booksuggestions/comments/q8635u/queer_adult_romcoms.json": "I'm looking for some recs for cute queer adult romance books. I am LOVING the\nproliferation of queer YA books in the last couple years, but I'm 39 years old\nand reading about teen romance feels a little squicky to me. I'm looking for\nsomething more on the cute & sweet side - I'm fine with sexual…",
  "data/reddit-books/r/booksuggestions/comments/q8ixe8/a_book_must_be_the_axe_for_the_frozen_sea_inside.json": "What books made you feel that way?",
  "data/reddit-books/r/booksuggestions/comments/q8oscl/dystopian_scifi_novels_like_do_androids_dream_of.json": "or something similar to them But one single Novel (no series if possible)",
  "data/reddit-books/r/booksuggestions/comments/q8p99y/great_scifi_books_that_are_not_fantasy_focused.json": "Everybody always suggests Dune, or Hyperion as some of the best sci-fi books out\nthere, but these lean more towards fantasy imo. I want some space focused books\nthat portray things in a realistic way that also offer some cosmic-horror vibes.\nCan also include first-contact type books.\n\nBooks i’ve…",
  "data/reddit-books/r/booksuggestions/comments/q92paz/life_has_been_super_depressing_lately.json": "& there's not much more in the world that's been able to take my mind away from\nthe everyday nuisances and struggles of life, than reading a great book. Just\nhere looking for any suggestions? I typically enjoy non-fiction,\nautobiographies, history, but also fiction as far as having a realistic…",
  "data/reddit-books/r/booksuggestions/comments/q9epz9/should_i_buy_girl_with_dragon_tattoo.json": "Hard back for $2 at thrift",
  "data/reddit-books/r/booksuggestions/comments/q9u4lr/time_travel_please.json": "Looking for some solid time travel recommendations.\n\nI’ve read: Doors of Sleep, In Times Like These Series, Threshold Series, Paradox\nBound, Here and Now and Then, Recursion, and The Midnight Library.\n\nWould love something similar. Hit me with them.",
  "data/reddit-books/r/booksuggestions/comments/qa7aqa/looking_for_books_that_happen_during_a_heavy.json": "Can be anything, but winter, snow and cold have to play some role in it. Not\njust be there, but also doesn't have to be the main thing. Like it was in\nPandemic by Jana Wagner.\n\nEdit: thank you to everyone in comments. Looked through your recommendations and\nsome look really good",
  "data/reddit-books/r/booksuggestions/comments/qamfx2/book_about_mass_panic_preapocalypse.json": "I really loved the World War Z because it tells stories before and during the\noutbreak. There were tense moments where society was on the brink of a total\ncollapse. And boy I really love the panic and dread on a society scale.\n\nIs there any book that are great at depicting such situations, whether…",
  "data/reddit-books/r/booksuggestions/comments/qb15ff/baby_girl_on_the_way_need_to_build_a_library.json": "I’ve got a baby girl on the way in January. (I’m dad) I want to build a small\nlibrary of books to read to her as she grows and hopefully cultivate a love of\nreading in her as well. I love fantasy, such as the princess bride and the last\nunicorn. I’d love suggestions from any genre though. Mostly…",
  "data/reddit-books/r/booksuggestions/comments/qb6ipi/whats_a_book_you_still_cant_stop_thinking_about.json": "I want to read any and all.",
  "data/reddit-books/r/booksuggestions/comments/qbl7eu/is_brandon_sanderson_a_good_author_for_someone.json": "Mistborn: The Final Empire is on sale for Kindle, so I am debating whether to\nbuy it or not.",
  "data/reddit-books/r/booksuggestions/comments/qbzg28/books_for_someone_in_which_someone_close_in_their.json": "Books that tackle such longing, such feeling of worthlessness. Books that change\none's point of view, mind-blowing.\n\n((Very specific situation ofc I'm referring to a friend pffff))",
  "data/reddit-books/r/booksuggestions/comments/qc65l0/a_plotdriven_story_that_takes_place_across_decades.json": "Looking for a story that takes place across 80-100 years, specifically one that\neffectively jumps long periods of time while maintaining the plot's momentum.",
  "data/reddit-books/r/booksuggestions/comments/qc6dwk/books_and_writers_from_less_represented_african.json": "I have read several books by Nigerian authors and loved them. Also recently I\nread Yaa Gyasi who has Ghanaian roots, have some idea about South African\nauthors, Egyptian. Beyond this, I haven't read much while Africa is a vast\ncontinent with diverse cultures and dynamic histories.\n\nPlease suggest…",
  "data/reddit-books/r/booksuggestions/comments/qcjsu2/i_usually_read_books_in_the_horrorthriller_genre.json": "I usually read horror/thriller books, or crime mysteries. I'm currently reading\nhideaway by dean koontz and I think after this one I've had my fill of being\ndisturbed for a while lol.\n\nThe books I've enjoyed the most had a lot of action and suspense. Especially\ncrime mysteries, psychological…",
  "data/reddit-books/r/booksuggestions/comments/qcwtlz/books_to_go_into_blind.json": "Looking for fiction books that are best read without reading the synopsis first\nor knowing anything about it. Someone recommended I read We Need to Talk About\nKevin this way, and the added mystery/shock value was super satisfying.",
  "data/reddit-books/r/booksuggestions/comments/qd0k6x/gift_idea_for_my_nana_who_told_me_she_always.json": "I don’t really read books so it’s so hard for me to gift a book.\n\nShe is a historian at the library, British humour, like shows like: mrs browns\nboys, doc Martin, outlander/Harry Potter (read the books too)",
  "data/reddit-books/r/booksuggestions/comments/qdgek6/a_fantasy_book_something_like_pirates_of_the.json": "Some pirate-y fun stuff like that. Not the Gentlemen Bastards tho. That one was\nokay to me. Anything else :)",
  "data/reddit-books/r/booksuggestions/comments/qdhoyg/for_a_girl_in_her_early_twenties_living_alone.json": "Hi! I used to read a lot more than I do, books that I would hide under my desk\nand read through class. I’m looking to find that feeling again of being really\ninvested in a book so I turn to it instead of my phone when I have downtime.\nSome things I like (generally) - strong female leads - tame…",
  "data/reddit-books/r/booksuggestions/comments/qdvbol/suggest_me_a_book_you_could_not_put_down.json": "OR a book you accidentally stayed up all night reading. I just read An American\nMarriage by Tayari Jones and Under the Whispering Door by TJ Klune and couldn't\nput either of them down. I'm open to anything - just suggest me the last (or\nany) book you read that you couldn't put down!",
  "data/reddit-books/r/booksuggestions/comments/qe3sq4/bookshop_library_setting_in_fiction_books.json": "I would love to read books set in a book store or library please let me know if\nyou have any good suggestions thank you!\n\nI have read : Midnight library and Mr penumbra 24 hour bookstore",
  "data/reddit-books/r/booksuggestions/comments/qe7sbq/books_with_a_really_satisfying_ending.json": "So many books are enjoyable along the way with good characters but leave me\nfeeling like the ending was mediocre. I love Stephen King but he is especially\nguilty of this.\n\nCan you recommend a book that felt like it really wrapped up well? I’m open\nminded genre wise.",
  "data/reddit-books/r/booksuggestions/comments/qecmbi/books_that_changed_your_life.json": "what are book that changed your life that aren’t like self help books",
  "data/reddit-books/r/booksuggestions/comments/qed9dx/novels_with_female_equivalent_of_hannibal_lecter.json": "I want to read novels with a character like Hannibal Lecter but, make it female.\nBasically, if you know any female characters that are literally the female\nversion of Hannibal(yes, the cannibalism and everything), please suggest the\nbook!\n\nThank you in advance!!",
  "data/reddit-books/r/booksuggestions/comments/qepfzp/in_need_of_books_bored_of_reading_ya_scififantasy.json": "Looking to build my library. I have extremely enjoyed the works of frank Herbert\n(dune series) as well as \"the name of the wind\" by Patrick rothfuss. I also plan\nto read the \"briar king and \"art of ice and fire\" series. I am looking for\nhigher reading level books that are either sci-fi or fantasy, I…",
  "data/reddit-books/r/booksuggestions/comments/qevpqr/fiction_that_was_so_good_you_didnt_know_what_to.json": "I’ve read a lot of books, but here are some of ones that have done this for me:\n\n * The Book Thief\n\n * The Stormlight Archive\n\n * Princess Bride\n\n * Red Rising\n\n * Project Hail Mary\n\n * It\n\n * Frankenstein\n\n * The Catcher In the Rye\n\n * The Forever War\n\n * The King in Yellow\n\n * Beneath a Scarlet…",
  "data/reddit-books/r/booksuggestions/comments/qf5i6u/laughoutloud_books_to_help_me_escape_real_life.json": "Going through a full life upheaval, uncertainty everywhere, broke up with\nsomeone I thought I’d share a future with, and things feel pretty dark and\nhopeless. I’m looking for something to cheer me up and make me feel hopeful and\ntake my mind off reality. Preferably engaging fiction, WITHOUT any…",
  "data/reddit-books/r/booksuggestions/comments/qfehqg/good_fantasy_book_without_characters_that_are_17.json": "I really love this genre but i can barely empathize with the protagonist when\nthey're 17 I feel I wasn't that \"mature\" at their age and it just feel weird idk\nif you know about fantasy books with characters +20 years",
  "data/reddit-books/r/booksuggestions/comments/qfp5fk/need_an_immersive_sprawling_apocalypse.json": "My mom just died and I need an escape. Some of my favorite books/trilogies to\ndisappear into have been:\n\nOryx and Crake by Margaret Atwood\n\nThe Stand by Stephen King\n\nThe Passage by Justin Cronin\n\nWanderers by Chuck Wendig\n\nBook of the Unnamed Midwife by Meg Elison\n\nWool by Hugh Howey\n\nHis Dark…",
  "data/reddit-books/r/booksuggestions/comments/qfu357/is_cosy_dystopia_a_genre.json": "I suppose what I'm looking for is more like a post-apocalyptic society, where\npeople are having to re-form communities and get by as best they can. Nothing\ntoo dark, more uplifting if anything. I've read (and loved) Station Eleven, so\nthat's a bit of a guide.\n\nThanks!",
  "data/reddit-books/r/booksuggestions/comments/qfz0t0/japanese_literature_thats_not_disturbing.json": "MINI SPOILERS FOR: Kafka on the shore and The Sailor who Fell from Grace with\nthe Sea. Hi my favorite work of art of all time is Vagabond by Takehiko Inoue |\nLOVE this manga it's beautifully written eye candy. | love the whole\nphilosophical element to it and how it has a “Japanese Vibe” | thought…",
  "data/reddit-books/r/booksuggestions/comments/qg5mo0/a_book_in_which_the_main_character_goes_from.json": "Google isn't helping me out much so I decided to try here.\n\nI'm searching for a book in which the reader can follow along and get immersed\nin the character's life, from when they're a child all the way until they die\n(or get older)\n\nI want it to be meaningful and heart wrenching in a beautiful way.…",
  "data/reddit-books/r/booksuggestions/comments/qggxrg/best_books_under_200_pages.json": "I just read two pretty dense books back to back and would like a short easy to\nread book as a break",
  "data/reddit-books/r/booksuggestions/comments/qgwcum/looking_for_a_bookauthor_that_writes_like.json": "Stephen King and Murakami are among my favorite authors. I would like to read\nsomething that marries the two writing styles. I’ve read all of McCarthy, and\nlove him.",
  "data/reddit-books/r/booksuggestions/comments/qh0w61/looking_for_books_with_lots_of_vulgarsexual_taboo.json": "Hi! I'm working on my undergraduate thesis analysing vulgarity/sexual terms, do\nyou guys have any suggestion of books with lots of sexual terms (or swearing\nwords with sexual terms), something like 'cunt', 'pussy', 'dickhead', 'little\nprick'? Not necessarily sexual books tho.\n\nThanks!",
  "data/reddit-books/r/booksuggestions/comments/qhbzw4/looking_for_books_along_the_lines_of_dune_and.json": "Thank you!",
  "data/reddit-books/r/booksuggestions/comments/qhn1dn/a_tea_novel.json": "I’d love to read a novel around a small tea shop. Urban fantasy or a cozy\nmystery would be great, but I’m open to anything.\n\nOther tea related novels are welcome too.\n\nThank you so much!",
  "data/reddit-books/r/booksuggestions/comments/qhsr5x/a_book_for_an_older_child_who_is_less_favoured.json": "A strange request!\n\nI have a family friend whose daughter has confided in me about feeling left out\nof everything. She herself is 13, and her younger sibling 7. Her younger sibling\nhas additional needs and so gets more attention. She is also forced to stay at\nhome during the holidays and look after…",
  "data/reddit-books/r/booksuggestions/comments/qib55l/world_war_one_stories.json": "As the title says I'm looking for some World War One stories: this can be either\nin the diary format from an actual accounting - like Eugene Sledge or Robert\nLeckie from World War Two - or a work of fiction that is heavily historically\naccurate and includes real events as part of the narrative.\n\nI'd…",
  "data/reddit-books/r/booksuggestions/comments/qilg7h/recommend_me_a_book_or_more_that_will_destroy_me.json": "Yeah, so... I think this kind of story is necessary. I just came across a mini\ncomic (6 pages long) of Spider-Man, where he finds a homeless little girl that\nwas a fan of his, and... Well, I guess there's no right way to put it. It's 6\npages long, and barely has any dialog, so you can read it in two…",
  "data/reddit-books/r/booksuggestions/comments/qixiys/a_book_to_help_teach_a_child_that_the_world_is.json": "My daughter is 5 and has begun to encounter things in the world that are scary\nand broken, like death and infertility. I don't try to hide things from her. I\nwant her to grow up understanding that the world is broken and that sometimes\nbrokenness is beautiful. That we need to let ourselves feel…",
  "data/reddit-books/r/booksuggestions/comments/qjefei/books_to_expand_the_views_of_a_conservative.json": "[edit] Thanks guys, some really great suggestions here. Enough to keep me busy\nfor a while haha. I really appreciate all you input. I've added all your recs to\nmy goodreads account 'want to read' list.\n\nHi friends,\n\nI would consider myself fairly conservative. I am a christian, and my faith is\nvery…",
  "data/reddit-books/r/booksuggestions/comments/qjgtq8/good_erotic_literature.json": "Please, don’t say fifty shades of grey."
}