{
  "data/reddit-ask/r/AskHistorians/comments/l9fa0h/why_did_northern_states_oppose_slavery_in_the.json": "Why did northern states oppose slavery in the United States? Was it simply for a moral purpose or were there economic/political aspects of it?",
  "data/reddit-ask/r/AskHistorians/comments/l9q90x/how_realistic_is_the_depiction_of_kgb_spies_in.json": "How realistic is the depiction of KGB spies in 'The Americans'?",
  "data/reddit-ask/r/AskHistorians/comments/l9r1as/i_love_this_sub.json": "I love this Sub",
  "data/reddit-ask/r/AskHistorians/comments/l9vxcp/what_was_the_role_of_male_sex_workers_in_the_wild.json": "What was the role of male sex workers in the 'wild west'?",
  "data/reddit-ask/r/AskHistorians/comments/la5qdd/how_is_russia_a_country_far_north_with_freezing.json": "How is Russia, a country far north with freezing temperatures, so heavily populated?",
  "data/reddit-ask/r/AskHistorians/comments/la6n9o/it_seems_as_though_black_boxers_were_accepted.json": "It seems as though black boxers were accepted much sooner than black athletes in most other sports. Is my perception correct, and if so, why was this the case?",
  "data/reddit-ask/r/AskHistorians/comments/la7vfe/what_role_does_the_roman_empire_play_in_the.json": "What role does the Roman Empire play in the culture of the Islamic world?",
  "data/reddit-ask/r/AskHistorians/comments/laajmm/we_all_know_the_story_of_wotjek_the_bear_who_was.json": "We all know the story of Wotjek the bear, who was befriended by an Iranian boy and eventually was given to a Polish military unit -- What in God's name was the Polish military doing in Iran prior to WW2?",
  "data/reddit-ask/r/AskHistorians/comments/ladun6/during_the_days_of_the_gold_standard_what_stopped.json": "During the Days of the Gold Standard, What Stopped Countries From Lying About How Much Gold They Had?",
  "data/reddit-ask/r/AskHistorians/comments/las02k/hi_im_interested_in_learning_more_about_sex.json": "Hi, I'm interested in learning more about sex workers in espionage. How did the CIA recruit and train sex workers for Operation Midnight Climax?",
  "data/reddit-ask/r/AskHistorians/comments/lauzwa/i_specialise_in_the_history_of_vasectomy_in.json": "I specialise in the history of vasectomy in Britain and, more broadly, histories of eugenics, contraception, reproductive rights, and masculinity. AMA!",
  "data/reddit-ask/r/AskHistorians/comments/lb4901/when_japanese_american_internment_happened_in_the.json": "When Japanese American Internment happened in the USA during WW2, are there recorded instances of non-Japanese families hiding Japanese families in their own home from internment? If the non-Japanese family was caught, were they legally punished by the government in any way?",
  "data/reddit-ask/r/AskHistorians/comments/lb8c9p/what_have_west_africans_historically_had_to_say.json": "What have West Africans historically had to say about Back-to-Africa movements? Have they supported it, or did they find it silly? Or worse, insulting?",
  "data/reddit-ask/r/AskHistorians/comments/lba57n/did_stalin_actually_kill_60_million_people_and.json": "Did Stalin actually kill 60 million people and Genghis Khan actually kill 40 million people? I have noticed that neo-Nazis usually bring this up to minimize Hitler's atrocities.",
  "data/reddit-ask/r/AskHistorians/comments/lbas89/where_does_the_american_culture_of_leaving_the.json": "Where does the american culture of leaving the parents' house at a very young age come from?",
  "data/reddit-ask/r/AskHistorians/comments/lbba10/how_did_kansas_city_become_a_hub_of.json": "How did Kansas City become a hub of African-American culture, and then seemingly fade away?",
  "data/reddit-ask/r/AskHistorians/comments/lbvbux/was_there_any_particular_reason_that_native.json": "Was there any particular reason that Native American subjects and characters and actors were so popular in 1990s film and television? And why did it all seem to stop in the aughts?",
  "data/reddit-ask/r/AskHistorians/comments/lc3ea6/until_1977_israels_leaders_were_consistently_left.json": "Until 1977, Israel's leaders were consistently left wing if not outright socialist. Since then, the Israeli political climate seems much more right leaning. What happened to the Israeli left?",
  "data/reddit-ask/r/AskHistorians/comments/lccnqi/why_are_the_12_disciples_typically_depicted_as.json": "Why are the 12 disciples typically depicted as middle aged men, when they are most likely teenagers/yound adults?",
  "data/reddit-ask/r/AskHistorians/comments/lcene5/george_wallace_was_synonymous_with_southern.json": "George Wallace was synonymous with Southern racism for decades, but after apologizing, he won a final term as Alabama governor with a majority of the black vote. Why did blacks forgive and vote for him given his lengthy track record?",
  "data/reddit-ask/r/AskHistorians/comments/lcoqrk/why_do_figures_in_16th18th_century_paintings.json": "Why do figures in 16th-18th century paintings frequently seem to be pointing at something to the side of the frame, other than to tell us \"shit's on fire, yo\"?",
  "data/reddit-ask/r/AskHistorians/comments/lctstf/first_nations_is_an_unusually_poetic_name_for_an.json": "\"First Nations\" is an unusually poetic name for an indigenous group. How did it come to be the official term for those peoples, ahead of something more clinical like \"Native\" or \"Indigenous\" Canadians?",
  "data/reddit-ask/r/AskHistorians/comments/lcvvp8/could_edgar_the_butler_from_the_aristocats_have.json": "Could Edgar the butler from The Aristocats have lived on the fortune left to the cats while fulfilling the wills demands.",
  "data/reddit-ask/r/AskHistorians/comments/lcwyox/how_did_ancientmedieval_people_explain_the.json": "How did ancient/medieval people explain the mechanisms of sexual reproduction prior to the discovery and understanding of sperm cells, egg cells, and fertilization? What did they think what was going on in a woman's body during pregnancy?",
  "data/reddit-ask/r/AskHistorians/comments/ld84do/how_did_so_many_jews_end_up_in_eastern_europe.json": "How did so many Jews end up in Eastern Europe, especially Russia? When did they arrive and where did they come from? Were they migrants or local converts?",
  "data/reddit-ask/r/AskHistorians/comments/ldda7d/what_would_1950s_america_have_found_obscene_about.json": "What would 1950s America have found obscene about the word \"pregnancy\" in the context of I Love Lucy's two married characters having a baby?",
  "data/reddit-ask/r/AskHistorians/comments/ldwcqz/the_manichean_prophet_mani_regarded_axum_as_one.json": "The Manichean prophet Mani regarded AXUM as one of the four great powers of his time, the others were Persia, Rome and China. How much did these three empires know about Axum and what was their relationship with them?",
  "data/reddit-ask/r/AskHistorians/comments/ldyq6r/ethiopia_and_nubia_were_two_of_the_worlds_oldest.json": "Ethiopia and Nubia were two of the world's oldest Christian nation. What were their involvement in the Crusades?",
  "data/reddit-ask/r/AskHistorians/comments/le79wz/when_and_why_did_former_us_presidents_start.json": "When and why did former US presidents start receiving intelligence briefings after their term had ended?",
  "data/reddit-ask/r/AskHistorians/comments/le813j/if_a_bodybuilder_was_to_walk_around_medieval.json": "If a bodybuilder was to walk around medieval Europe how strange would they look to the average person?",
  "data/reddit-ask/r/AskHistorians/comments/le92pj/when_the_hippy_movement_started_how_did_all_these.json": "When the hippy movement started, how did all these people, all of a sudden, find all those incredibly flamboyant, colourful and unique clothes and accessories to wear?",
  "data/reddit-ask/r/AskHistorians/comments/leblbk/i_am_scheduled_to_have_my_2nd_surgery_this_month.json": "I am scheduled to have my 2nd surgery this month. My intervertebral disc has slipped into my left sciatic nerve. Last surgery was same except disc slipped into my right sciatic nerve. The pain is excruciating, unimaginable. What would I have done 300+ years ago?",
  "data/reddit-ask/r/AskHistorians/comments/lemt78/why_was_roman_text_on_coins_and_other_media_often.json": "Why was Roman text on coins and other media often so janky and misaligned? Today we would see that as unprofessional, especially since it was meant to represent the emperor.",
  "data/reddit-ask/r/AskHistorians/comments/lenxxo/there_was_apparently_a_legend_that_nero_would.json": "There was apparently a legend that Nero would return again after his death, and a few \"false Neros\" who pretended to be him in popular uprisings. His reputation overall seems to have been poor; why would people have wanted him to come back?",
  "data/reddit-ask/r/AskHistorians/comments/leo7a6/how_were_ships_of_the_line_in_the_18th_to_19th.json": "How were ships of the line in the 18th to 19th centuries still able to be combat effective (if at all) after receiving a single full broadside?",
  "data/reddit-ask/r/AskHistorians/comments/ler9c8/in_the_breakfast_club1984_shermer_illinois_claire.json": "In \"The Breakfast Club\"(1984, Shermer, Illinois), Claire (Molly Ringwald) brings out sushi and soy sauce for lunch. None of the other students have heard of sushi, a clear example to the audience of how prissy she is. Why did sushi for lunch= prissy? Was Japanese food not a staple takeout food yet?",
  "data/reddit-ask/r/AskHistorians/comments/lf6r74/the_tokyo_stock_exchange_was_in_operation_all_the.json": "The Tokyo Stock Exchange was in operation all the way through WWII until the atomic bombings of Hiroshima and Nagasaki. What were the conditions of the Japanese stock market like during the war, especially as Japan began to lose and Tokyo and other major cities were firebombed?",
  "data/reddit-ask/r/AskHistorians/comments/lf8l59/given_that_the_majority_of_original_italian.json": "Given that the majority of original Italian immigrants to America came from the South, how come most of the popular Italian dishes in America (Lasagne, Bolognese, Baloney, Alfredo/creamier sauce, Pollo/Vitello/Melanzane Parmigiana, Tiramisu) are far more Northern in origin?",
  "data/reddit-ask/r/AskHistorians/comments/lfb75k/was_captain_von_trapp_a_fascist_what_were_the.json": "Was Captain von Trapp a fascist? What were the political beliefs of non-Jewish Austrians who were against Nazism and the Anschluss?",
  "data/reddit-ask/r/AskHistorians/comments/lfcz3m/was_jerry_seinfelds_suggestion_that_babu_bhatt.json": "Was Jerry Seinfeld's suggestion that Babu Bhatt open a Pakistani restaurant actually as innovative in early 90s NYC as suggested by that show? Were famously-cosmopolitan New Yorkers unfamiliar with Pakistani food in 1991?",
  "data/reddit-ask/r/AskHistorians/comments/lfe4p8/in_the_1985_film_the_princess_bride_the_character.json": "In the 1985 film \"The Princess Bride\", the character of Vizzini (Wallace Shawn) warns against the prospect of becoming involved in a land war in Asia, dubbing it \"one of the classic blunders\". How valid is his assessment and would this view have been shared by Europeans in the medieval period?",
  "data/reddit-ask/r/AskHistorians/comments/lfphn2/just_how_different_is_olive_oil_of_the_ancient.json": "Just how different is Olive oil of the Ancient Roman world from the Olive Oil we can find in supermarkets today?",
  "data/reddit-ask/r/AskHistorians/comments/lg3xq6/jesus_christ_preached_of_an_imminent_apocalyptic.json": "Jesus Christ preached of an imminent apocalyptic judgment within the lifetimes of his followers. When the world did not end, why were his teachings not abandoned and instead his follower base only grew?",
  "data/reddit-ask/r/AskHistorians/comments/lg6wo6/the_storm_before_the_storm_similarities_of_the.json": "The Storm Before the Storm: Similarities of the Roman Republic and the United States",
  "data/reddit-ask/r/AskHistorians/comments/lghw3g/in_1345_ibn_battuta_boarded_a_chinese_ship_and.json": "In 1345 Ibn Battuta boarded a Chinese ship and admired their size, 5 decks & private cabins with their own lavatories which can be reserved. This all seems unexpectedly modern and luxurious. What was it like to travel on sea as a wealthy merchant? What other Amenities were offered?",
  "data/reddit-ask/r/AskHistorians/comments/lgmw3w/in_the_americans_soviet_agents_are_given_full.json": "In \"The Americans\", Soviet agents are given full American identities and live undercover in plain sight. Do we have any evidence for the reverse also happening, i.e. Americans living in Russia under assumed identities as \"average\" citizens?",
  "data/reddit-ask/r/AskHistorians/comments/lgqxyq/does_the_youth_of_today_really_read_less_books.json": "Does the youth of today really read less books than the previous generation ?",
  "data/reddit-ask/r/AskHistorians/comments/lgr5wv/how_fluid_was_cultural_identity_before_the_advent.json": "How fluid was cultural identity before the advent of modern nation states? Especially in the 17th and 18th century?",
  "data/reddit-ask/r/AskHistorians/comments/lgs7iy/how_did_the_english_manage_to_kill_almost_half_of.json": "How did the English manage to kill almost half of the population of Ireland during the British Civil Wars?",
  "data/reddit-ask/r/AskHistorians/comments/lgzebb/what_is_the_history_behind_why_england_has_such.json": "What is the history behind why England has such diverse accents, even though the distance between the areas is so close together?",
  "data/reddit-ask/r/AskHistorians/comments/lhbh5q/in_ancient_mesopotamia_how_big_were_each_familys.json": "In Ancient Mesopotamia, how big were each family's farm?",
  "data/reddit-ask/r/AskHistorians/comments/lhcmpe/how_is_the_american_revolution_covered_in_history.json": "How is the American Revolution covered in history in Britain? What sort of light is it portrayed in, and what areas are focused on vs less so with others?",
  "data/reddit-ask/r/AskHistorians/comments/lhd6t9/chomsky_states_that_if_the_nuremberg_principals.json": "Chomsky states that if the Nuremberg Principals were applied, every post-WWII POTUS would be indictable. Based on other developed nations' post-WWII Heads of State, are the NPs simply too ambitious, or can developed nations' HoS still reasonably fulfill their responsibilities without violating them?",
  "data/reddit-ask/r/AskHistorians/comments/lhdg0f/what_electric_lamp_is_bram_stoker_referring_to.json": "What electric lamp is Bram Stoker referring to?",
  "data/reddit-ask/r/AskHistorians/comments/lhefiv/how_did_dresses_come_to_be_womens_clothing.json": "How did dresses come to be \"women's clothing\"?",
  "data/reddit-ask/r/AskHistorians/comments/lhlzcc/if_hard_drugs_were_commonly_available_as_medicine.json": "If hard drugs were commonly available as medicine back in the day, why wasn't drug addiction more of an issue?",
  "data/reddit-ask/r/AskHistorians/comments/lhmsym/im_a_low_class_ancient_greek_adolescentyoung.json": "I'm a low class Ancient Greek adolescent/young adult man. There's this girl of similar class on the other side of the polis/village to me who's just my type, and I'd like to get conjugal with her. What romantic conventions are there that i should be thinking about and planning?",
  "data/reddit-ask/r/AskHistorians/comments/lhoqpj/when_frederick_douglas_toured_great_britain_he.json": "When Frederick Douglas toured Great Britain he was surprised to find not a hint of racism, discrimination, or segregation. How had the UK managed to so quickly leave behind all vestiges of racial inequality?",
  "data/reddit-ask/r/AskHistorians/comments/lhr36x/is_there_a_feigned_amnesia_over_british_and.json": "Is there a 'feigned amnesia' over British and European Imperialism in academia?",
  "data/reddit-ask/r/AskHistorians/comments/li1d1r/did_mccarthy_legitimately_believe_in_soviet.json": "Did McCarthy legitimately believe in Soviet infiltration of Hollywood, or was it merely a convenient excuse to attack liberal, West Coast elites?",
  "data/reddit-ask/r/AskHistorians/comments/li9m8v/i_am_a_veteran_line_infantryman_during_the.json": "I am a veteran line infantryman during the Napoleonic Wars. What sort of advantages would I hold over 'greener' or less experienced troops and how would my commander utilise me in battle (both in terms of positioning and when I would be inserted into combat)?",
  "data/reddit-ask/r/AskHistorians/comments/liblr7/how_surprised_were_the_ussr_officials_after.json": "How surprised were the USSR officials after Hitler started invading the country? Like, did they really think that the Molotov–Ribbentrop Pact would last despite what Germany already did with Czechoslovakia?",
  "data/reddit-ask/r/AskHistorians/comments/libxuu/when_in_western_culture_did_female_nipples_become.json": "When in western culture did female nipples become considered taboo, and why are male nipples not taboo?",
  "data/reddit-ask/r/AskHistorians/comments/lim9r9/in_bernard_cornwells_sharpe_series_the_95th.json": "In Bernard Cornwell’s Sharpe series, the 95th rifles are considered/treated like a special forces unit often operating behind enemy lines or on special missions. Although the real 95th served with distinction, were they really deployed as a kind of special forces of the time?",
  "data/reddit-ask/r/AskHistorians/comments/lipuz6/why_was_the_union_crippled_by_such_incompetent.json": "Why was the union crippled by such incompetent generals during the early stages of the Civil War?",
  "data/reddit-ask/r/AskHistorians/comments/liu41i/the_fictional_captain_jack_aubrey_rn_captures_a.json": "The fictional Captain Jack Aubrey, RN, captures a slave ship and is so appalled by the conditions he finds that he chains the captain and officers to the ship and then has his squadron use it for gunnery practice until it sinks. Were the Royal Navy very harsh with slave traders they captured?",
  "data/reddit-ask/r/AskHistorians/comments/liutxi/how_common_were_close_friendships_between.json": "How common were close friendships between different genders (or sexes) prior to modern times?",
  "data/reddit-ask/r/AskHistorians/comments/lj34zm/the_chinese_and_persian_zodiacs_are_identical.json": "The Chinese and Persian zodiacs are identical, except the latter swaps the dragon for a whale. What is the origin of this cultural link?",
  "data/reddit-ask/r/AskHistorians/comments/lj3l7e/what_did_slave_ships_carry_on_their_return_trips.json": "What did slave ships carry on their return trips?",
  "data/reddit-ask/r/AskHistorians/comments/lj465t/the_historical_record_implies_that_ancient_romans.json": "\"The historical record implies that ancient Romans did not smile spontaneously when they were happy.\" What do we know about the ancient Roman lexicon of facial expressions?",
  "data/reddit-ask/r/AskHistorians/comments/lj4fz6/did_anyone_living_in_west_berlin_ever_escape_to.json": "Did anyone living in West Berlin ever \"escape\" to East Berlin?",
  "data/reddit-ask/r/AskHistorians/comments/lj8d2n/why_does_christianity_ignore_all_other_jewish.json": "Why does Christianity ignore all other Jewish texts, except the Old Testament?",
  "data/reddit-ask/r/AskHistorians/comments/lj9fup/one_of_the_arguments_given_against_puerto_rican.json": "One of the arguments given against Puerto Rican and DC statehood is that they would permanently alter the balance of power in the Senate. Was that same argument made against Hawaiian and Alaskan admission to the US?",
  "data/reddit-ask/r/AskHistorians/comments/ljaxvc/who_were_enslaved_africans_precapture.json": "Who were enslaved Africans pre-capture?",
  "data/reddit-ask/r/AskHistorians/comments/ljgrg8/considering_crucifixion_victims_were_executed.json": "Considering crucifixion victims were executed without clothing, did early crucifixes of Christ depict him without the loin cloth? If so, when was the loin cloth introduced?",
  "data/reddit-ask/r/AskHistorians/comments/ljic4y/how_would_an_average_young_american_couple.json": "How would an average young American couple, pre-Sexual Revolution and pre-reliable contraception, have approached sexual intimacy as their relationship became more committed and serious?",
  "data/reddit-ask/r/AskHistorians/comments/ljpfmo/in_the_1994_simpsons_episode_bart_gets_an.json": "In the 1994 Simpsons' episode \"Bart Gets an Elephant\" a gag shows the Democrats declaring that they \"hate life and ourselves\" and \"can't govern\", while the Republicans say that they \"want what's worst for everyone\" and they're \"just plain evil\". How and when did these political stereotypes develop?",
  "data/reddit-ask/r/AskHistorians/comments/ljq6zu/the_sutton_hoo_burial_mound_was_from_the_english.json": "The Sutton Hoo burial mound was from the English dark ages, but contained items from Byzantium, the Middle East, and Asia. Does this mean England maintained a vast trade network even after the western Roman Empire had withdrawn and barbarians had seized much of the territory on western Europe?",
  "data/reddit-ask/r/AskHistorians/comments/ljslg1/why_do_so_many_white_american_families_have_very.json": "Why do so many white American families have very long traditions of claiming Native American ancestry?",
  "data/reddit-ask/r/AskHistorians/comments/ljw0om/has_dna_evidence_completely_upended_any_area_of.json": "Has DNA evidence completely upended any area of history? How has it changed your area of expertise?",
  "data/reddit-ask/r/AskHistorians/comments/lk03cp/england_controlled_territory_in_france_until_the.json": "England controlled territory in France until the 16th century. How \"English\" did places like Calais become by the Tudor period?",
  "data/reddit-ask/r/AskHistorians/comments/lk89fn/how_many_pitched_battlescampaignssieges_would_an.json": "How many pitched battles/campaigns/sieges would an average soldier see in their career in different time periods?",
  "data/reddit-ask/r/AskHistorians/comments/lk9l9u/ian_flemings_james_bond_is_often_depicted_wearing.json": "Ian Fleming’s James Bond is often depicted wearing a Rolex, driving a Bentley (or Aston Martin) and drinking the finest drinks in the finest places. But in the 1950s and 1960s what would a secret agent’s wage actually be and would there be all the perks that James Bond enjoys?",
  "data/reddit-ask/r/AskHistorians/comments/lkbib5/was_dungeons_and_dragons_popular_behind_the_iron.json": "Was Dungeons and Dragons popular behind the Iron Curtain in countries like Poland, East Germany, and the Soviet Union? Or was it purely a Western phenomenon?",
  "data/reddit-ask/r/AskHistorians/comments/lkmcsg/henry_viii_created_the_church_of_england_in_order.json": "Henry VIII created the Church of England in order to leave his wife. When did this motivation became widely known among Anglicans, and why did they continue with Anglicanism?",
  "data/reddit-ask/r/AskHistorians/comments/lknph1/was_paul_revere_a_good_silversmith_do_we_have_any.json": "Was Paul Revere a good silversmith? Do we have any extant reviews of his products?",
  "data/reddit-ask/r/AskHistorians/comments/lkqv5y/what_was_the_usa_governments_strategy_for.json": "What was the U.S.A government's strategy for disseminating information on the atomic bombs and The Manhattan Project to the public?",
  "data/reddit-ask/r/AskHistorians/comments/lkwq7m/have_humans_always_infantilized_their_pets_eg.json": "Have humans always infantilized their pets (e.g. referring to their dog as \"baby\" or themselves as \"mom\"), or is this a relatively recent phenomenon?",
  "data/reddit-ask/r/AskHistorians/comments/llam67/its_the_fifth_century_and_im_living_in_the.json": "It's the fifth century and I'm living in the province of Britannia. Roman troops are beginning to leave and cities are being left to fend for themselves. If I stay in Britain, how drastically will my day-to-day life change in the coming years?",
  "data/reddit-ask/r/AskHistorians/comments/lldc9d/unions_in_the_united_states_seem_much_weaker_and.json": "Unions in the United States seem much weaker and more conciliatory now than 100 years ago. How has their relationship to capital changed? Why do their goals and tactics seem so much less grand now?",
  "data/reddit-ask/r/AskHistorians/comments/llt8ue/just_how_liberalprogressive_was_iran_prior_to_the.json": "Just how liberal/progressive was Iran prior to the 1979 revolution?",
  "data/reddit-ask/r/AskHistorians/comments/llv6z5/in_the_show_derry_girls_a_teenager_living_in.json": "In the show “Derry Girls”, a teenager living in Northern Ireland in the early 90’s comes out as gay. Many of her peers and the adults in her life act notably nonchalant and accepting of her announcement. Is this an accurate portrayal of public opinion on homosexuality in this setting?",
  "data/reddit-ask/r/AskHistorians/comments/lm4pdp/what_happened_to_all_the_perpetual_mass.json": "What happened to all the \"perpetual mass\" endowments from the Late Middle Ages? Are people still praying for those souls? If not, when did they stop?",
  "data/reddit-ask/r/AskHistorians/comments/lmhefi/why_did_the_etruscans_hardly_ever_sculpt_in_hard.json": "Why did the Etruscans hardly ever sculpt in hard stone?",
  "data/reddit-ask/r/AskHistorians/comments/lmio13/what_exactly_was_a_march_they_were_defensive.json": "What exactly was a \"march\"? They were defensive border regions, sure, but what was different about them that merited a special political designation?",
  "data/reddit-ask/r/AskHistorians/comments/lmm62r/what_is_the_wealth_equivalent_in_todays_terms_for.json": "What is the wealth equivalent in today's terms for how much would be needed to finance construction of a castle during the High or Late Middle Ages? Was it more tied to your title and lands, or could any one with sufficient wealth build and maintain a castle?",
  "data/reddit-ask/r/AskHistorians/comments/lmu3cl/what_was_the_sewage_and_waste_removal_system_like.json": "What was the sewage and waste removal system like 2000 years ago in cities like Pompeii? Is it true that the reason they had foot-high sidewalks and elevated crosswalk stones was because the streets ran deep with everyone’s shit?",
  "data/reddit-ask/r/AskHistorians/comments/lmwikp/zapotec_cultures_have_muxes_people_born_male_at.json": "Zapotec cultures have \"Muxes\", people born male at birth but dress and behave as women which is described as a third gender. Was this rooted in Mesoamerican culture and if it is, what their view on gender an outlier among Mesoamerica?",
  "data/reddit-ask/r/AskHistorians/comments/lmzgpc/i_was_taught_that_the_us_power_grid_is.json": "I was taught that the US Power Grid is dangerously outdated. What is the history of that?",
  "data/reddit-ask/r/AskHistorians/comments/ln2ulw/how_did_europeans_especially_northern_deal_with.json": "How did Europeans, especially Northern, deal with settling and colonizing warm, tropical places? For example, how did a 17th Dutchman cope with the intensely different climate of Indonesia, or did they just sweat constantly?",
  "data/reddit-ask/r/AskHistorians/comments/ln6cms/this_list_of_causes_of_death_for_1632_londoners.json": "This list of causes of death for 1632 Londoners has some familiar causes (consumption, drowned, etc.) and others that are not so familiar, such entries for \"Rising of the Lights\" killing 98, and \"Planet\" killing 13. When did death records start being collected systematically in standardized form?",
  "data/reddit-ask/r/AskHistorians/comments/lnelfl/a_lot_of_attention_is_often_given_to_irish_and.json": "A lot of attention is often given to Irish and Italian immigration during the 20th century, but Germans make up the overwhelming amount of immigrants in most of the US and very little focus is given to the experiences of German immigrants during the 20th century. Why is this?",
  "data/reddit-ask/r/AskHistorians/comments/lnf3h6/scottish_blackhouses_had_no_chimneys_but_burned.json": "Scottish \"blackhouses\" had no chimneys but burned peat inside, the smoke apparently escaped through cracks in the thatching. This seems...unhealthy. Did the crofters who lived in these houses have extremely high rates of lung disease?",
  "data/reddit-ask/r/AskHistorians/comments/lnlj58/the_last_kingdom_a_tv_show_about_the_viking.json": "\"The Last Kingdom\", a TV show about the Viking conquest of England, often portrays Christian clergymen actively fighting and participating in battles and military campaigns. Did so-called \"warrior monks\" actually exist in the Middle Ages?",
  "data/reddit-ask/r/AskHistorians/comments/lo0k5f/millennials_in_the_us_widely_believe_that_getting.json": "Millennials in the US widely believe that getting hired was easier for their parents & grandparents, who are known such stories as “I walked right up to manager and said, ‘I’d like a job, when can I start?’ He hired me on the spot!” How true was this in, say, 1970?",
  "data/reddit-ask/r/AskHistorians/comments/loaco6/was_scientology_really_founded_as_a_bet_between_l.json": "Was Scientology really founded as a bet between L Ron Hubbard and Robert Heinlein?",
  "data/reddit-ask/r/AskHistorians/comments/loj4in/why_do_americans_and_europeans_use_cutlery_in.json": "Why do Americans and Europeans use cutlery in different ways?",
  "data/reddit-ask/r/AskHistorians/comments/loka1p/where_were_hispanic_and_asians_during_us.json": "Where were Hispanic and Asians during US segregation?",
  "data/reddit-ask/r/AskHistorians/comments/lon6u3/when_and_why_did_the_word_overmorrow_fall_out_of.json": "When and why did the word \"overmorrow\" fall out of usage?",
  "data/reddit-ask/r/AskHistorians/comments/lov0g9/in_mad_men_the_admen_are_always_depicted_with_a.json": "In Mad Men the ad-men are always depicted with a decanter of whiskey in their offices and taking drinks in the afternoon. When did alcohol become a “thing” in the workplace and when did it stop becoming such a thing?",
  "data/reddit-ask/r/AskHistorians/comments/lp0b5h/especially_before_the_industrial_revolution.json": "Especially before the industrial revolution, parents had sex while their children were (presumably) sleeping in the same room. When and by whom, then the claim that children witnessing sex or pornography traumatising children has come from?",
  "data/reddit-ask/r/AskHistorians/comments/lpdc46/when_did_oral_sex_become_common.json": "When did oral sex become common?",
  "data/reddit-ask/r/AskHistorians/comments/lpopda/why_did_international_support_during_the_nigerian.json": "Why did international support during the Nigerian Civil War (1967-1970) not fall along cold war geopolitical lines?",
  "data/reddit-ask/r/AskHistorians/comments/lpqozq/the_ancient_olympics_were_just_one_of_four.json": "The ancient Olympics were just one of four important games festivals in ancient Greece, along with the Pythian, the Nemean, and the Isthmian Games. I've never heard of any of these. Why did only the Olympics go the distance and last 2500 years?",
  "data/reddit-ask/r/AskHistorians/comments/lpssp0/in_paradox_grand_strategy_games_england_and_great.json": "In Paradox grand strategy games, England and Great Britain are depicted with a red color. France is blue, Spain yellow, Portugal green, the Netherlands orange, Germany dark blue or grey, Austria white. Was this scheme a cartographical standard, say, by the 1880s, or did it come about later?",
  "data/reddit-ask/r/AskHistorians/comments/lpt3yg/would_peasants_in_medieval_europe_go_through.json": "Would peasants in medieval Europe go through cyclical weight change throughout the year?",
  "data/reddit-ask/r/AskHistorians/comments/lpu6al/was_there_any_noted_culturetechnology_shock_in.json": "Was there any noted 'culture/technology shock' in those who lived through the late 1800s to the moon landing?",
  "data/reddit-ask/r/AskHistorians/comments/lpzz8u/the_mughal_empire_is_considered_one_of_the.json": "The Mughal Empire is considered one of the \"gunpowder empires\" alongside Safavid Persia and the Ottoman Turks. What is so \"gunpowder\" about the Mughals when they relied so heavily on old school cavalry armed with lance and bow?",
  "data/reddit-ask/r/AskHistorians/comments/lq0c4b/black_panther_members_once_openly_carried.json": "Black Panther members once openly carried firearms and would stand nearby when the police pulled over a black person. They would shout advice, like the fact that the person could remain silent, and assured them that they'd be there to help if anything went wrong. Why did this stop?",
  "data/reddit-ask/r/AskHistorians/comments/lqfahw/im_the_daughter_of_a_16thcentury_noble_and_im.json": "I'm the daughter of a 16th-century noble and I'm concerned that an extramarital tryst may have resulted in pregnancy. Do I have access to a \"pregnancy test\"? Before it became obvious (and potentially damning), what folk methods would I have to determine whether I was pregnant?",
  "data/reddit-ask/r/AskHistorians/comments/lqn29w/why_did_the_us_government_name_its_states_after.json": "Why did the US Government name its states after Native American tribes it was actively trying to wipe out?",
  "data/reddit-ask/r/AskHistorians/comments/lqs4gn/this_list_of_causes_of_death_for_1632_londoners.json": "This list of causes of death for 1632 Londoners has some familiar causes (consumption, drowned, etc.) and others that are not so familiar, such entries for \"Rising of the Lights\" killing 98, and \"Planet\" killing 13. When did death records start being collected systematically in standardized form?",
  "data/reddit-ask/r/AskHistorians/comments/lr3syz/during_the_formation_of_the_un_security_council.json": "During the formation of the UN Security Council, the US wanted Brazil as a 6th permanent member. What was going on with Brazil at the time?",
  "data/reddit-ask/r/AskHistorians/comments/lr60n1/i_am_a_veteran_of_sullas_legions_i_have_just.json": "I am a veteran of Sulla’s legions. I have just finished fighting a bloody civil war, and the proscriptions by Sulla have left a lot of empty land. I am given a plot of land in Etruria as a reward for my service. How do I travel to that land, and how will I get it up and running?",
  "data/reddit-ask/r/AskHistorians/comments/lram98/a_strange_thing_i_noticed_about_us_states_is_that.json": "A strange thing I noticed about US states is that usually, the capital of the state is not the largest city in it. Why is that?",
  "data/reddit-ask/r/AskHistorians/comments/lrc1f8/why_did_the_nazis_have_such_interest_in_the.json": "Why did the Nazis have such interest in the Basque people?",
  "data/reddit-ask/r/AskHistorians/comments/lrfbzf/roman_emperors_often_had_idealized_statues_of.json": "Roman emperors often had idealized statues of their physique made, but Nero let it all hang out. His coinage and statues feature a fleshy face and double chin. Do we know why he didn't have artists \"photoshop\" his appearance? Was this fidelity to reality unusual in emperors?",
  "data/reddit-ask/r/AskHistorians/comments/lrlh0v/some_allied_leaders_like_churchill_and_patton.json": "Some Allied leaders, like Churchill and Patton, were advocating immediately attacking the Soviet Union after Germany was defeated. Were there any Soviet leaders trying to convince Stalin to attack the Western Allies after Germany was defeated?",
  "data/reddit-ask/r/AskHistorians/comments/lrlyoo/in_the_movie_gladiator_russell_crowes_character.json": "In the movie Gladiator, Russell Crowe's character Maximus is taken as a slave from his own villa. What recourse did Roman Citizens and others have against being kidnapped and sold into slavery within the Roman Empire?",
  "data/reddit-ask/r/AskHistorians/comments/ls2cco/did_people_ever_worship_titans_exclusively.json": "Did people ever worship Titans exclusively?",
  "data/reddit-ask/r/AskHistorians/comments/ls63rd/how_did_the_stereotype_of_an_alien_being.json": "How did the \"stereotype\" of an alien being physically grey, big eyed, creature came to life ?",
  "data/reddit-ask/r/AskHistorians/comments/ls6mbo/if_european_explorers_of_the_new_world_were.json": "If European explorers of the New World were looking for gold, why didn't they go conquer Mali which was known for its gold for centuries by that point?",
  "data/reddit-ask/r/AskHistorians/comments/ls7oys/get_the_best_askhistorians_content_beamed.json": "Get the Best AskHistorians Content Beamed Directly to Your Brain with the AskHistorians Newsletter! Sign Up for It Here!",
  "data/reddit-ask/r/AskHistorians/comments/lsbyd3/foot_binding_in_china_would_have_limited_mobility.json": "Foot binding in China would have limited mobility for numbers of women and was practiced for centuries. Were there any changes in Chinese architecture or infrastructure to account for this?",
  "data/reddit-ask/r/AskHistorians/comments/lsdgrb/judaism_christianity_and_islam_have_a_number_of.json": "Judaism, Christianity, and Islam have a number of things in common and have interacted with each other extensively. Has there ever been an effort to develop a \"Pan-Abrahamism\" to unite followers all three religions under some common cause?",
  "data/reddit-ask/r/AskHistorians/comments/lse7l0/how_to_avoid_dodgy_school_education.json": "How to avoid dodgy school education?",
  "data/reddit-ask/r/AskHistorians/comments/lsoxiv/as_a_single_young_professional_in_new_york_city_i.json": "As a single, young professional in New York City, I currently rent a small studio apartment in a building built in the 1930s. Would the person who rented the exact same apartment in the 1930s be someone like me? Or would this small space have been shared by multiple people?",
  "data/reddit-ask/r/AskHistorians/comments/lswi69/why_did_the_nation_of_islam_reject_christianity.json": "Why did the Nation of Islam reject Christianity as the religion of the colonizers, while embracing Islam as a “black” religion, when Islam was brought to Africa by Arab conquerors?",
  "data/reddit-ask/r/AskHistorians/comments/lt40l3/between_things_like_heated_floors_and_public.json": "Between things like heated floors and public baths, Roman Cities seemed to require a lot of firewood. What did the timber industry look like in the Classical Mediterranean? Was deforestation a major issue? How far away did wood need to be imported from?",
  "data/reddit-ask/r/AskHistorians/comments/lt6kms/did_the_nazis_really_spare_aryan_soldiers_the.json": "Did the Nazis really spare “Aryan” soldiers the worst of war for reproduction purposes? - Oral history says they did",
  "data/reddit-ask/r/AskHistorians/comments/ltf98m/today_you_can_find_many_us_government_footage.json": "Today, you can find many U.S. government footage from the 1950s depicting nuclear tests on YouTube. Considering the contemporary secrecy around these tests, who was the primary audience for these films when they were created?",
  "data/reddit-ask/r/AskHistorians/comments/lthm04/at_the_conclusion_of_the_chinese_civil_war_how.json": "At the conclusion of the Chinese Civil War, how exactly did ~800,000 people manage to retreat to Taiwan?",
  "data/reddit-ask/r/AskHistorians/comments/ltir74/did_cowboys_smoke_weed_back_in_the_times_of_the.json": "Did cowboys smoke weed back in the times of the Wild West?",
  "data/reddit-ask/r/AskHistorians/comments/ltjlwe/in_the_german_tv_show_babylon_berlin_we_see_two.json": "In the German tv show Babylon Berlin, we see two young women share an apartment with a man— the lease says he has it all day, they have it 7 pm-7 am. Was this type of agreement common, or even legal? Was there a shortage of affordable housing in the Weimar Republic?",
  "data/reddit-ask/r/AskHistorians/comments/lucfcp/despite_the_black_death_starting_in_asia_ive.json": "Despite the Black Death starting in Asia, I've never seen any accounts describing it's impact on any Asian countries, yet there are plenty of records describing the impact of the outbreak in Europe, Northern Africa, and the Middle East. Why is this?",
  "data/reddit-ask/r/AskMen/comments/l9x42g/how_do_i_deal_with_losing_my_best_friend_to_his.json": "How do I deal with losing my best friend to his girlfriend?",
  "data/reddit-ask/r/AskMen/comments/la6srl/what_do_men_do_that_people_dont_realise_takes_a.json": "What do men do that people don’t realise takes a lot of courage.",
  "data/reddit-ask/r/AskMen/comments/laca0t/how_do_you_stop_yourself_from_cringing_hard_at.json": "How do you stop yourself from cringing hard at the idiot you were in your early twenties/ late teens?",
  "data/reddit-ask/r/AskMen/comments/laycrm/how_to_deal_with_toxic_siblings.json": "How to deal with toxic siblings?",
  "data/reddit-ask/r/AskMen/comments/lazviu/what_is_the_proper_paying_etiquette_when_your.json": "What is the proper paying etiquette when your girlfriends parents take you to dinner",
  "data/reddit-ask/r/AskMen/comments/lb2jrh/men_of_reddit_how_do_i_get_a_life.json": "Men of Reddit, how do I “get a life”?",
  "data/reddit-ask/r/AskMen/comments/lb6meh/what_was_your_im_the_ugly_friend_moment.json": "What was your \"I'm the ugly friend\" moment?",
  "data/reddit-ask/r/AskMen/comments/lbigii/what_was_your_i_need_new_friends_moment.json": "What was your “I need new friends,” moment?",
  "data/reddit-ask/r/AskMen/comments/lbijtt/are_yall_open_to_women_shooting_their_shot_any.json": "Are y’all open to women shooting their shot ? Any tips on how to approach a guy first?",
  "data/reddit-ask/r/AskMen/comments/lbxnix/30f_i_usually_swipe_left_on_guys_who_post.json": "[30F] I usually swipe left on guys who post shirtless pics on dating apps. Is there any eqivalent dealbreakers that you guys have when looking at women's dating profiles?",
  "data/reddit-ask/r/AskMen/comments/lcaqdu/what_dad_red_flags_from_your_dads_do_you_have.json": "What Dad red flags from your Dads do you have that you won't be passing down to your children?",
  "data/reddit-ask/r/AskMen/comments/lceeqf/men_of_reddit_what_is_the_difference_between_love.json": "Men of Reddit, What is the difference between love Signs and lust Signs that you feel for a woman.",
  "data/reddit-ask/r/AskMen/comments/lcik08/why_is_she_your_girlfriend.json": "Why is she your girlfriend?",
  "data/reddit-ask/r/AskMen/comments/lcjzas/when_did_you_turn_into_your_dad.json": "When did you turn into your dad?",
  "data/reddit-ask/r/AskMen/comments/lczhx2/how_put_off_would_you_be_if_your_gf_didnt_like.json": "How put off would you be if your gf didn’t like physical touch",
  "data/reddit-ask/r/AskMen/comments/lczoho/what_do_men_get_nervous_about_during_a_first_date.json": "What do men get nervous about during a first date?",
  "data/reddit-ask/r/AskMen/comments/ld2aq9/how_did_dating_become_a_rocket_science.json": "How did dating become a rocket science?",
  "data/reddit-ask/r/AskReddit/comments/l92amj/people_who_are_40_what_is_your_advice_to_people.json": "People who are 40+, what is your advice to people in their 20s?",
  "data/reddit-ask/r/AskReddit/comments/l9eouj/what_is_illegal_but_should_be_legal.json": "What is illegal but should be legal?",
  "data/reddit-ask/r/AskReddit/comments/l9jesx/what_is_a_song_lyric_that_hits_you_hard.json": "What is a song lyric that hits you hard?",
  "data/reddit-ask/r/AskReddit/comments/l9kfy9/whats_something_your_body_did_that_you_thought.json": "What's something your body did that you thought was normal, until you were told otherwise?",
  "data/reddit-ask/r/AskReddit/comments/l9mkg5/serious_male_victims_of_sexual_assault_harassment.json": "[Serious] Male victims of sexual assault, harassment, or rape, to clear some common misconceptions, what were your experiences like?",
  "data/reddit-ask/r/AskReddit/comments/l9o440/amazon_workers_of_reddit_amazon_is_on_record_as.json": "Amazon workers of reddit: Amazon is on record as being dehumanizing to work for and for treating employees very poorly, what are some examples of this?",
  "data/reddit-ask/r/AskReddit/comments/l9qgcs/you_get_100_every_time_youre_rejected_for.json": "You get 100$ every time you’re rejected for anything ( favors, dating, money ). What do you do to make money?",
  "data/reddit-ask/r/AskReddit/comments/l9t6mc/they_say_a_person_truly_dies_when_their_name_is.json": "They say a person truly dies when their name is spoken for the last time. Whose names do you want to live on in this post?",
  "data/reddit-ask/r/AskReddit/comments/l9t6pd/what_small_subreddits_deserve_more_attention.json": "What small subreddits deserve more attention?",
  "data/reddit-ask/r/AskReddit/comments/l9t8rt/people_that_are_always_in_relationships_how_do.json": "People that are always in relationships: How do you skip from one relationship to the next? Where do you meet these people??",
  "data/reddit-ask/r/AskReddit/comments/l9w8q5/if_bullshit_means_fake_and_apeshit_means_going.json": "If \"Bullshit\" means fake and \"Apeshit\" means going crazy, what do the other \"shits\" of the animal kingdom mean?",
  "data/reddit-ask/r/AskReddit/comments/l9wewv/serious_redditors_from_myanmar_burma_how_are_you.json": "[SERIOUS] Redditors from Myanmar (Burma), how are you after the army seizing power in a Coup today?",
  "data/reddit-ask/r/AskReddit/comments/l9yno0/what_perfectly_innocent_search_turned_out_to_be.json": "What perfectly innocent search turned out to be porn?",
  "data/reddit-ask/r/AskReddit/comments/la3rqr/serious_victims_of_bullying_what_happened_and_how.json": "[SERIOUS] Victims of bullying, what happened and how did it affect your life?",
  "data/reddit-ask/r/AskReddit/comments/la4wx4/what_old_video_games_do_you_still_play_regularly.json": "What old video games do you still play regularly?",
  "data/reddit-ask/r/AskReddit/comments/la89jm/you_are_the_head_of_a_notorious_disorganised.json": "You are the head of a notorious Disorganised Crime Family. What crimes are you committing?",
  "data/reddit-ask/r/AskReddit/comments/labepm/what_was_the_best_thing_the_quiet_kid_has_said_or.json": "What was the best thing the “ quiet kid “ has said or done in class?",
  "data/reddit-ask/r/AskReddit/comments/lae4tt/if_it_costs_you_your_peace_its_too_expensive_when.json": "“If it costs you your peace, it’s too expensive.” When has that advice held true for you?",
  "data/reddit-ask/r/AskReddit/comments/lai522/redditors_how_would_you_feel_if_reddit_added_a.json": "Redditors, how would you feel if Reddit added a feature to create folders for all your different saves?",
  "data/reddit-ask/r/AskReddit/comments/lalzbx/how_would_you_feel_about_removing_horny_virgin.json": "How would you feel about removing horny virgin questions from askreddit?",
  "data/reddit-ask/r/AskReddit/comments/lapd3p/who_here_sleeps_with_the_fan_on_in_their_room.json": "Who here sleeps with the fan on in their room, regardless of the weather outside?",
  "data/reddit-ask/r/AskReddit/comments/lapmwa/who_was_crazy_until_they_were_right_all_along.json": "Who was crazy until they were right all along?",
  "data/reddit-ask/r/AskReddit/comments/laqzfs/people_who_go_to_page_2_of_a_google_search_whats.json": "People who go to page 2 of a Google search, What's your life like?",
  "data/reddit-ask/r/AskReddit/comments/larnup/if_you_had_1000000000_dollars_but_only_could.json": "If you had $1,000,000,000 dollars but only could spend 1% on yourself, what would you do with the other 99%?",
  "data/reddit-ask/r/AskReddit/comments/lawq7j/you_have_the_power_to_spawn_an_infinite_amount_of.json": "You have the power to spawn an infinite amount of baguettes. How would you use this power?",
  "data/reddit-ask/r/AskReddit/comments/laz3fu/students_whats_the_funniest_thing_that_happened.json": "Students, what's the funniest thing that happened in Remote Learning?",
  "data/reddit-ask/r/AskReddit/comments/lazflz/what_was_the_worst_job_interview_youve_had.json": "What was the worst job interview you've had?",
  "data/reddit-ask/r/AskReddit/comments/lazslq/when_did_you_realize_that_hard_work_does_not.json": "When did you realize that hard work does not always pay off?",
  "data/reddit-ask/r/AskReddit/comments/lb7tyu/whats_the_strangest_conversation_that_youve_ever.json": "What’s the strangest conversation that you’ve ever overheard?",
  "data/reddit-ask/r/AskReddit/comments/lba5oj/serious_if_you_could_learn_the_truth_of_any_one.json": "[Serious] If you could learn the truth of any one mystery, urban legend or conspiracy theory. What would you choose?",
  "data/reddit-ask/r/AskReddit/comments/lbbk7u/how_you_react_if_someone_said_they_masturbated_to.json": "How you react if someone said they masturbated to you?",
  "data/reddit-ask/r/AskReddit/comments/lbbp8w/what_is_your_nobody_will_ever_believe_this_story.json": "What is your “nobody will ever believe this” story?",
  "data/reddit-ask/r/AskReddit/comments/lbd0hh/hr_and_recruiters_what_is_an_instant_well_this.json": "HR and Recruiters, what is an instant \"Well, this person isn'tgetting the job\" thing a candidate can do during a job interview for you?",
  "data/reddit-ask/r/AskReddit/comments/lbfk4b/what_common_product_has_a_feature_youre_not_sure.json": "What common product has a feature you’re not sure everyone is aware of?",
  "data/reddit-ask/r/AskReddit/comments/lbgdre/bologna_is_just_a_thicc_hot_dog_cut_into_pancakes.json": "Bologna is just a thicc hot dog cut into pancakes, what else is a bastardization of another product?",
  "data/reddit-ask/r/AskReddit/comments/lbh7oo/serious_redditors_of_russia_what_is_the_real.json": "[Serious] Redditors of Russia, what is the real situation on the streets and how can we help?",
  "data/reddit-ask/r/AskReddit/comments/lbk0ou/if_2_mind_readers_read_each_others_minds_whos.json": "If 2 mind readers read each others minds, who's mind would they be reading?",
  "data/reddit-ask/r/AskReddit/comments/lbnc6y/twins_of_reddit_in_what_ways_did_you_take.json": "Twins of reddit: In what ways did you take advantage of having a twin?",
  "data/reddit-ask/r/AskReddit/comments/lbogir/what_is_your_nsfw_fun_fact_about_yourself.json": "What is your NSFW fun fact about yourself?",
  "data/reddit-ask/r/AskReddit/comments/lbyl4s/what_are_your_worst_nightmare_neighbour_conflict.json": "What are your worst nightmare neighbour conflict stories?",
  "data/reddit-ask/r/AskReddit/comments/lc1xuc/what_is_a_seemingly_mundane_question_you_can_ask.json": "What is a seemingly mundane question you can ask somebody that will tell you a lot about their personality?",
  "data/reddit-ask/r/AskReddit/comments/lc5ium/school_is_100_virtual_but_they_just_declared_a.json": "school is 100% virtual but they just declared a snow day for tomorrow and cancelled it. how do you explain that?",
  "data/reddit-ask/r/AskReddit/comments/lc92c9/your_grandma_forms_a_new_thrash_metal_band_called.json": "Your Grandma forms a new thrash metal band called Titanium Hip which is faster than her previous band and will soon be releasing the first album “You've Fallen and You Won't Get Up”. What should be the lyrical theme of the album?",
  "data/reddit-ask/r/AskReddit/comments/lc9kay/what_are_things_that_everyone_loves_but_you_hate.json": "What are things that everyone loves but you hate?",
  "data/reddit-ask/r/AskReddit/comments/lcazhz/what_if_the_god_of_religions_christianity_islam.json": "What if the God of religions (Christianity, Islam, Hindu, etc) was actually the devil and his greatest success was convincing millions of people that he was the one true god?",
  "data/reddit-ask/r/AskReddit/comments/lceg8v/women_of_reddit_do_you_also_hold_your_own_boobs.json": "Women of Reddit, do you also hold your own boobs sometimes just because you can? Why do we do that?",
  "data/reddit-ask/r/AskReddit/comments/lcgqny/doctors_of_reddit_what_is_your_how_is_this_guy.json": "Doctors of reddit, what is your \"how is this guy still alive?\" moment?",
  "data/reddit-ask/r/AskReddit/comments/lchbbv/americans_whos_been_overseas_whats_one_thing_that.json": "Americans who's been overseas, what's one thing that made you go \"oh shit, we're not in America anymore\"?",
  "data/reddit-ask/r/AskReddit/comments/lche6o/students_of_reddit_whats_a_polite_way_of_telling.json": "Students of Reddit, what's a polite way of telling people to fuck off when they ask you for answers to online homework?",
  "data/reddit-ask/r/AskReddit/comments/lckq4y/what_movie_scene_was_super_exaggerated_or_wrong.json": "What movie scene was super exaggerated or wrong based on your own knowledge?",
  "data/reddit-ask/r/AskReddit/comments/lcnwj4/people_who_watch_anime_what_is_an_anime_youd.json": "People who watch anime, what is an anime you'd recomnend to someone who is just starting to get into it?",
  "data/reddit-ask/r/AskReddit/comments/lcoe7s/former_homicide_detectives_of_reddit_what_was_the.json": "Former homicide detectives of reddit, what was the case that made you leave the profession?",
  "data/reddit-ask/r/AskReddit/comments/lcp1d5/how_do_you_commit_all_seven_deadly_sins_at_the.json": "How do you commit all seven deadly sins at the same time?",
  "data/reddit-ask/r/AskReddit/comments/lctvk8/what_is_the_best_forgotten_80s_song.json": "What is the best “forgotten” 80’s song?",
  "data/reddit-ask/r/AskReddit/comments/lcvgjt/whats_that_expensive_item_thats_100_worth_it.json": "What’s that expensive item that’s 100% worth it?",
  "data/reddit-ask/r/AskReddit/comments/lcxdq6/people_who_met_their_partners_after_30_how_did_it.json": "People who met their partners after 30, how did it happen? Do you wish you had met earlier?",
  "data/reddit-ask/r/AskReddit/comments/lcyyl9/people_that_put_potato_chips_on_sandwiches_what.json": "People that put potato chips on sandwiches, what are your favorite combos?",
  "data/reddit-ask/r/AskReddit/comments/ld4f3k/how_do_you_guys_combat_loneliness.json": "How do you guys combat loneliness?",
  "data/reddit-ask/r/AskReddit/comments/ld4n04/security_guards_of_reddit_what_is_the_creepiest.json": "Security guards of reddit, what is the creepiest thing you've seen/experience during your shift?",
  "data/reddit-ask/r/AskReddit/comments/ld4pu8/after_almost_1_year_are_you_satisfied_with_your.json": "After almost 1 year, are you satisfied with your national government's response to the COVID-19? If not, what could have been done in your opinion?",
  "data/reddit-ask/r/AskReddit/comments/ld5svg/have_you_ever_told_a_joke_at_a_job_interview_how.json": "Have you ever told a joke at a job interview, how did it go down?",
  "data/reddit-ask/r/AskReddit/comments/ld7qu4/what_is_your_catchphrase.json": "What is your catchphrase?",
  "data/reddit-ask/r/AskReddit/comments/ld8f8v/people_of_reddit_what_is_something_that_is_over.json": "People of Reddit, what is something that is over stereotyped that typically isn't true?",
  "data/reddit-ask/r/AskReddit/comments/ld8z2b/serious_what_makes_your_life_worth_living.json": "[SERIOUS] What makes your life worth living?",
  "data/reddit-ask/r/AskReddit/comments/ldf9bc/people_who_exercise_on_a_constant_basis_how_do.json": "People who exercise on a constant basis, how do you stay motivated?",
  "data/reddit-ask/r/AskReddit/comments/ldga62/what_is_a_song_that_you_hate_with_a_burning.json": "What is a song that you hate with a burning passion and what made you do so?",
  "data/reddit-ask/r/AskReddit/comments/ldgahy/pregnant_women_of_reddit_what_is_something_you.json": "Pregnant women of reddit, what is something you wish you knew BEFORE you got pregnant?",
  "data/reddit-ask/r/AskReddit/comments/ldnea1/whats_the_worst_hr_is_not_your_friend_story_youve.json": "What's the worst \"HR is not your friend\" story you've witnessed/experienced?",
  "data/reddit-ask/r/AskReddit/comments/ldqvpx/americans_of_reddit_why_do_you_body_slam_through.json": "Americans of Reddit, why do you body slam through folding tables at house parties?",
  "data/reddit-ask/r/AskReddit/comments/ldshhw/serious_whats_an_advice_that_everyone_should_know.json": "[SERIOUS] What's an advice that everyone should know if they're battling with poor self-esteem?",
  "data/reddit-ask/r/AskReddit/comments/le3of3/what_are_the_best_jobs_for_introverts.json": "What are the best jobs for introverts?",
  "data/reddit-ask/r/AskReddit/comments/le4l5o/what_is_something_you_lost_as_you_got_older.json": "What is something you lost as you got older?",
  "data/reddit-ask/r/AskReddit/comments/lea2f3/seriouswhos_one_person_you_wish_you_never_knewmet.json": "[SERIOUS]Who's one person you wish you never knew/met?",
  "data/reddit-ask/r/AskReddit/comments/lec25l/how_would_you_feel_about_a_tv_show_similar_to.json": "How would you feel about a TV show similar to \"Undercover Boss\", but instead of companies they secretly infiltrate and film police forces?",
  "data/reddit-ask/r/AskReddit/comments/leci2h/doctors_who_have_given_a_second_opinion_diagnosis.json": "Doctors who have given a \"second opinion\" diagnosis, what is the worst \"first opinion\" you've ever encountered?",
  "data/reddit-ask/r/AskReddit/comments/lelgtt/what_killed_your_motivation_to_complete_an.json": "What killed your motivation to complete an otherwise good videogame?",
  "data/reddit-ask/r/AskReddit/comments/lem1jq/to_people_who_wear_shoes_inside_their_homes_why.json": "To people who wear shoes inside their homes, why?",
  "data/reddit-ask/r/AskReddit/comments/lengey/window_cleaners_of_reddit_what_the_weirdest_thing.json": "Window cleaners of reddit, what the weirdest thing you've seen?",
  "data/reddit-ask/r/AskReddit/comments/leo238/what_is_it_like_to_live_alone.json": "What is it like to live alone?",
  "data/reddit-ask/r/AskReddit/comments/lercn2/to_those_who_think_to_themselves_i_should_do_this.json": "To those who think to themselves, \"I should do this today,\" and then end up doing it: is it possible to learn this power?",
  "data/reddit-ask/r/AskReddit/comments/let1yo/serious_what_is_the_creepiest_or_most_unexplained.json": "[SERIOUS] What is the Creepiest or most Unexplained thing that’s happened to you that you still think about to this day?",
  "data/reddit-ask/r/AskReddit/comments/lex6wx/girls_what_inappropriate_questions_about_guys.json": "Girls, what inappropriate questions about guys have you always wanted answered?",
  "data/reddit-ask/r/AskReddit/comments/lexyii/satan_appears_and_tells_you_that_you_are_to.json": "Satan appears and tells you that you are to design a new Ben and Jerry's Ice cream, The catch is that if anyone buys it... You go straight to hell. What is your best worst flavour to save your soul?",
  "data/reddit-ask/r/AskReddit/comments/lfaml0/do_people_like_karl_pilkington_actually_exist_and.json": "Do people like Karl Pilkington actually exist? And if you know one, what's your craziest/funniest story?",
  "data/reddit-ask/r/AskReddit/comments/lfb9hm/whats_a_today_is_going_to_suck_red_flag.json": "What’s a “Today is going to suck” red flag?",
  "data/reddit-ask/r/AskReddit/comments/lfc976/what_did_a_teacher_do_that_made_you_automatically.json": "What did a teacher do that made you automatically gain respect for them?",
  "data/reddit-ask/r/AskReddit/comments/lfd978/when_someone_thinks_highly_of_you_do_you_wonder.json": "When someone thinks highly of you, Do you wonder how long it will take them to feel disappointed in you?",
  "data/reddit-ask/r/AskReddit/comments/lfdyt2/what_videogame_have_you_played_the_most_and_why.json": "What videogame have you played the most, and why?",
  "data/reddit-ask/r/AskReddit/comments/lfe84m/lucid_dreamers_of_reddit_how_did_you_learn_about.json": "Lucid dreamers of reddit, how did you learn about lucid dreaming, are there any tips you'd advise people that want to start, and are they actually as realistic as described?",
  "data/reddit-ask/r/AskReddit/comments/lfiaxz/irl_friends_of_social_media_influencers_what_is.json": "IRL friends of social media “influencers”: what is it like?",
  "data/reddit-ask/r/AskReddit/comments/lfkk4y/have_you_ever_known_anyone_who_has_changed_from.json": "Have you ever known anyone who has changed from who they were to practically a different person?",
  "data/reddit-ask/r/AskReddit/comments/lflmu8/if_you_half_ass_something_it_means_it_was_done.json": "If you \"half ass\" something it means it was done poorly, so if you whole ass something is that better or worse ?",
  "data/reddit-ask/r/AskReddit/comments/lfoebe/how_are_you_dealing_with_depression_restlessness.json": "How are you dealing with depression, restlessness, and burnout during the pandemic?",
  "data/reddit-ask/r/AskReddit/comments/lfpx21/whats_something_you_want_people_to_know_about.json": "What’s something you want people to know about yourself, but you can’t tell anyone in real life?",
  "data/reddit-ask/r/AskReddit/comments/lfq5lh/whats_something_you_accidentally_learned_from_a.json": "What's something you accidentally learned from a video game?",
  "data/reddit-ask/r/AskReddit/comments/lfrdjo/colourblind_people_of_reddit_what_is_one_of_the.json": "Colourblind people of Reddit, what is one of the most unexpected problems related to colour you face often?",
  "data/reddit-ask/r/AskReddit/comments/lftv4u/people_who_just_up_and_left_one_day_and_started_a.json": "People who just up and left one day and started a new life, what was your experience like?",
  "data/reddit-ask/r/AskReddit/comments/lfx30z/how_did_smoke_breaks_become_socially_acceptable.json": "How did smoke breaks become socially acceptable during the work day, but not breaks for other reasons?",
  "data/reddit-ask/r/AskReddit/comments/lg0wq3/whatever_job_the_main_character_had_of_the_last.json": "Whatever job the main character had of the last show you watched is now yours. What is it?",
  "data/reddit-ask/r/AskReddit/comments/lg13j4/when_you_are_sad_and_crying_would_you_enjoy_a.json": "When you are sad and crying. Would you enjoy a cute cat cuddling and purring on your lap to cheer you up? Why or why not?",
  "data/reddit-ask/r/AskReddit/comments/lg4for/when_did_you_realise_that_teacher_you_loved_was.json": "When did you realise that teacher you loved was actually an ass?",
  "data/reddit-ask/r/AskReddit/comments/lg4q3m/people_who_take_massive_war_crime_level_dumps_in.json": "People who take massive war crime level dumps in public bathrooms but don't flush. Why?",
  "data/reddit-ask/r/AskReddit/comments/lg6axq/whats_a_sexual_desire_of_your_partner_that_you.json": "What's a sexual desire of your partner that you simply don't want to fulfill?",
  "data/reddit-ask/r/AskReddit/comments/lga1q8/people_who_can_get_out_of_bed_in_the_morning_with.json": "People who can get out of bed in the morning with energy and without feeling like death, how do you do that?",
  "data/reddit-ask/r/AskReddit/comments/lgar01/is_it_possible_that_some_of_the_people_still.json": "Is it possible that some of the people still listed as missing from 09/11 were actually not in the building and took advantage of the opportunity to vanish and start a new life? If so, why?",
  "data/reddit-ask/r/AskReddit/comments/lgc6c8/mark_twain_once_said_it_is_better_to_keep_ones.json": "Mark Twain once said “It is better to keep one's mouth shut and be thought a fool than to open it and remove all doubt.” When did someone you know open their mouth and remove all doubt?",
  "data/reddit-ask/r/AskReddit/comments/lgcnn7/what_infamous_plot_hole_is_just_the_result_of_the.json": "What infamous \"Plot Hole\" is just the result of the audience not thinking for more than ten seconds?",
  "data/reddit-ask/r/AskReddit/comments/lgjjkb/have_you_ever_dreamed_so_hard_that_the_next_day.json": "Have you ever dreamed so hard that the next day you thought your dream was reality? If yes, what was your dream?",
  "data/reddit-ask/r/AskReddit/comments/lgl46l/who_is_the_worst_person_you_would_willingly_but.json": "Who is the worst person you would willingly, but secretly, have sex with?",
  "data/reddit-ask/r/AskReddit/comments/lgmppy/is_it_normal_to_feel_like_everyone_secretly.json": "Is it normal to feel like everyone secretly dislikes you, being your friend only out of pity or kindness? If so, how did you over come this?",
  "data/reddit-ask/r/AskReddit/comments/lgp7vl/people_who_have_been_bullied_in_their_childhood.json": "People who have been bullied in their childhood, how did that effect your life?",
  "data/reddit-ask/r/AskReddit/comments/lgpl00/people_have_lost_a_single_shoe_on_the_side_of_the.json": "People have lost a single shoe on the side of the road, how did you lose it? Why did you not go back for it and what did you do with the shoe that you didn't lose?",
  "data/reddit-ask/r/AskReddit/comments/lgpy1k/who_here_fucking_hates_life.json": "Who here fucking hates life?",
  "data/reddit-ask/r/AskReddit/comments/lgqp9d/redditors_who_live_in_places_where_it_snows_in.json": "Redditors who live in places where it snows in winter, can you describe what that is actually like for those of us who have never experience it?",
  "data/reddit-ask/r/AskReddit/comments/lgtm4u/whats_the_first_thing_youre_gonna_do_when_this.json": "What's the first thing you're gonna do when this COVID thing is all over?",
  "data/reddit-ask/r/AskReddit/comments/lgutcm/how_did_your_high_school_crush_turn_out_as_an.json": "How did your high school crush turn out as an adult?",
  "data/reddit-ask/r/AskReddit/comments/lgwroa/whats_your_current_reason_for_being_happy.json": "What's your current reason for being \"happy\"?",
  "data/reddit-ask/r/AskReddit/comments/lgy034/serious_redditors_who_believe_they_have_thrown.json": "(Serious) Redditors who believe they have ‘thrown their lives away’ where did it all go wrong for you?",
  "data/reddit-ask/r/AskReddit/comments/lgyhbm/soldiers_of_reddit_whats_something_you_wish_you.json": "Soldiers of Reddit, what’s something you wish you knew before you enlisted?",
  "data/reddit-ask/r/AskReddit/comments/lh0lov/what_geography_fact_blows_your_mind.json": "What geography fact blows your mind?",
  "data/reddit-ask/r/AskReddit/comments/lh3f3t/what_is_something_popular_now_but_everyone_will.json": "What is something popular now, but everyone will look back at five years from now and think it is stupid and embarrassing?",
  "data/reddit-ask/r/AskReddit/comments/lh5ud6/redditors_who_personally_knew_someone_go_missing.json": "Redditors who personally knew someone go missing , what happened?",
  "data/reddit-ask/r/AskReddit/comments/lh5vkp/what_are_the_creepiest_ask_reddit_threads.json": "What are the Creepiest Ask Reddit threads??",
  "data/reddit-ask/r/AskReddit/comments/lh6m94/serious_when_did_a_gut_feeling_save_your_life.json": "(Serious) When did a gut feeling save your life?",
  "data/reddit-ask/r/AskReddit/comments/lhbs6n/what_is_the_holy_grail_of_the_thing_youre_a.json": "What is the \"holy grail\" of the thing you're a collector of?",
  "data/reddit-ask/r/AskReddit/comments/lhdek2/would_you_pay_5000_to_be_extremely_physically.json": "Would you pay $5000 to be extremely physically attractive? Why or why not?",
  "data/reddit-ask/r/AskReddit/comments/lhdyjk/why_on_earth_would_you_say_half_a_dozen_when_you.json": "Why on Earth would you say 'half a dozen' when you can literally say 'six'?",
  "data/reddit-ask/r/AskReddit/comments/lhq537/how_would_12500_affect_your_life_right_now.json": "How would $12,500 affect your life right now?",
  "data/reddit-ask/r/AskReddit/comments/lhqsg9/if_you_could_bring_back_any_cancelled_tv_show.json": "If you could bring back any cancelled TV show, what would it be?",
  "data/reddit-ask/r/AskReddit/comments/lhs0x8/what_are_some_jobhunting_or_career_red_flags_high.json": "What are some job-hunting or career red flags high school seniors should know before getting into the world?",
  "data/reddit-ask/r/AskReddit/comments/lhsx3c/what_are_your_cringey_im_not_like_other_girls.json": "What are your cringey “I’m not like other girls” stories that you’re embarrassed about or were unfortunate enough to witness?",
  "data/reddit-ask/r/AskReddit/comments/lhw318/serious_as_a_kid_what_was_the_creepiest_most_wtf.json": "(Serious) As a kid, what was the creepiest, most WTF thing you ever noticed about another kid's family?",
  "data/reddit-ask/r/AskReddit/comments/lhxkmf/males_of_reddit_what_is_something_you_like_that.json": "Males of reddit, what is something you like that is generally considered feminine or \"for girls\"?",
  "data/reddit-ask/r/AskReddit/comments/li3ms0/should_sex_work_be_legal_in_the_us_why_or_why_not.json": "Should sex work be legal in the US? Why or why not?",
  "data/reddit-ask/r/AskReddit/comments/li4s2d/girls_of_reddit_what_is_something_you_wish_guys.json": "Girls of Reddit: What is something you wish guys knew?",
  "data/reddit-ask/r/AskReddit/comments/li5etq/how_and_when_should_women_with_very.json": "How and When Should Women With Very Unattractive/Deformed Breasts Warn/Prepare Men They’re Dating?",
  "data/reddit-ask/r/AskReddit/comments/li62kr/teachers_of_reddit_when_i_was_at_school_we_used.json": "Teachers of Reddit, when I was at school we used to get told \"you won't carry around a calculator all the time when you're older.\" Now that we do carry literal super computers at all times, what's your excuse?",
  "data/reddit-ask/r/AskReddit/comments/li99bl/what_would_you_do_if_every_human_vanished_but_you.json": "What would you do if every human vanished but you?",
  "data/reddit-ask/r/AskReddit/comments/li9xo8/solo_travelers_what_is_your_creepiest_travel_story.json": "Solo travelers, what is your creepiest travel story?",
  "data/reddit-ask/r/AskReddit/comments/lia8hx/lockdown_is_causing_serious_boredom_and_is_hard.json": "Lockdown is causing serious boredom and is hard for everyone’s mental health. So, what positive things do we have to look forwards to?",
  "data/reddit-ask/r/AskReddit/comments/lia9k9/at_what_point_did_you_decide_you_were_never_going.json": "At what point did you decide you were never going to be rich. Never going to be exceptional but that was ok?",
  "data/reddit-ask/r/AskReddit/comments/lib1kf/what_are_some_signs_that_you_are_being_manipulated.json": "What are some signs that you are being manipulated?",
  "data/reddit-ask/r/AskReddit/comments/lic3xn/whats_the_most_im_turning_into_my_parents_moment.json": "What’s the most “I’m turning into my parents” moment for you?",
  "data/reddit-ask/r/AskReddit/comments/licp0e/what_theory_do_you_100_believe_in_without_having.json": "What theory do you 100% believe in without having any evidence?",
  "data/reddit-ask/r/AskReddit/comments/lidyf8/what_is_one_thing_you_always_wanted_as_a_kid_but.json": "What is one thing you always wanted as a kid, but now as an adult, it seems really shitty?",
  "data/reddit-ask/r/AskReddit/comments/lie0t6/how_do_you_convince_yourself_to_finally_get_out.json": "How do you convince yourself to finally get out of bed?",
  "data/reddit-ask/r/AskReddit/comments/lierbn/what_is_the_stereotype_about_you_that_you_hear.json": "What is the stereotype about you that you hear the most and how much do you love/hate it?",
  "data/reddit-ask/r/AskReddit/comments/ligx8c/people_who_fuck_up_youre_and_your_why.json": "People who fuck up \"you're\" and \"your\", why?",
  "data/reddit-ask/r/AskReddit/comments/lijy00/adolf_hitler_has_ruined_a_mustache_style_once.json": "Adolf Hitler has ruined a mustache style once deemed to be hip and desirable. What other fashion trends have been flogged to death by celebrities, dictators, or Derek from HR?",
  "data/reddit-ask/r/AskReddit/comments/lik2l4/germans_of_reddit_what_cultural_and_linguistic.json": "Germans of Reddit, what cultural and linguistic differences are there between former East and West Germany?",
  "data/reddit-ask/r/AskReddit/comments/lim8ax/we_already_have_curse_words_starting_with_ad_and.json": "We already have curse words starting with A-D and then we skip to F. What’s the E word?",
  "data/reddit-ask/r/AskReddit/comments/linozt/americans_with_2_weeks_holiday_a_year_how_in_gods.json": "Americans with 2 weeks holiday a year, how in Gods name do you do it?",
  "data/reddit-ask/r/AskReddit/comments/lipmyn/if_you_could_instantly_be_fluent_in_a_new.json": "If you could instantly be fluent in a new language, which one would you pick and why?",
  "data/reddit-ask/r/AskReddit/comments/lips9g/keep_hearing_that_most_americans_couldnt_cover_a.json": "Keep hearing that most Americans couldn't cover a $500 emergency. What would you do if you got a medical bill beyond your means?",
  "data/reddit-ask/r/AskReddit/comments/liq1n0/what_first_date_behavior_is_a_dealbreaker.json": "What first date behavior is a dealbreaker?",
  "data/reddit-ask/r/AskReddit/comments/liqjjo/whats_an_underrated_third_ingredient_to_go_with.json": "What's an underrated third ingredient to go with mac & cheese?",
  "data/reddit-ask/r/AskReddit/comments/liro1t/what_do_you_do_when_you_just_dont_enjoy_anything.json": "What do you do when you just don't enjoy anything anymore?",
  "data/reddit-ask/r/AskReddit/comments/list7t/what_was_the_weirdest_or_creepiest_neighbor_you.json": "What was the weirdest or creepiest neighbor you had?",
  "data/reddit-ask/r/AskReddit/comments/lj0dby/which_celebrity_got_cancelled_and_you_genuinely.json": "Which celebrity got cancelled and you genuinely felt bad for them?",
  "data/reddit-ask/r/AskReddit/comments/lj1v78/whats_the_most_delusional_belief_you_held_as_a.json": "What's the most delusional belief you held as a child?",
  "data/reddit-ask/r/AskReddit/comments/lj7uwk/people_with_autism_how_would_you_describe_what.json": "People with Autism: how would you describe What Autism feels like to someone who doesn’t have it?",
  "data/reddit-ask/r/AskReddit/comments/lj9jim/whats_a_cold_harsh_fact_youve_come_to_realize.json": "Whats a cold harsh fact you've come to realize?",
  "data/reddit-ask/r/AskReddit/comments/lj9kop/serious_what_historical_event_from_way_back_is.json": "[Serious] What historical event from way back is just plain bizarre to you?",
  "data/reddit-ask/r/AskReddit/comments/ljbo68/people_who_dont_want_to_tax_the_1_but_are_not_in.json": "People who don’t want to tax the 1% but are not in the 1%, why?",
  "data/reddit-ask/r/AskReddit/comments/ljfwm5/why_cant_mobile_game_developers_just_make_their.json": "Why can't mobile game developers just make their games as good as the false ads they use?",
  "data/reddit-ask/r/AskReddit/comments/ljhggg/how_would_you_feel_if_people_arrested_for.json": "How would you feel if people arrested for domestic violence had to register like sex offenders do?",
  "data/reddit-ask/r/AskReddit/comments/ljmil5/what_is_the_biggest_red_flag_you_had_overlooked.json": "What is the biggest red flag you had overlooked because the sex was good?",
  "data/reddit-ask/r/AskReddit/comments/ljn46y/whats_a_red_flag_that_screams_drop_this_class.json": "What’s a red flag that screams “drop this class immediately”?",
  "data/reddit-ask/r/AskReddit/comments/ljn7xj/what_is_the_saddest_truth_about_smart_people.json": "What is the saddest truth about smart people?",
  "data/reddit-ask/r/AskReddit/comments/ljocok/if_people_came_with_a_warning_tag_what_would.json": "If people came with a warning tag, what would yours be?",
  "data/reddit-ask/r/AskReddit/comments/ljq4eh/whats_something_you_didnt_realize_was_optional.json": "What's something you didn't realize was optional?",
  "data/reddit-ask/r/AskReddit/comments/ljx8b6/whats_the_worst_thing_youve_ever_seen_in_a_public.json": "What's the worst thing you've ever seen in a public toilet?",
  "data/reddit-ask/r/AskReddit/comments/ljxqe8/what_was_your_i_guess_i_am_the_villain_in_someone.json": "What was your “I guess I am the villain in someone else’s story.”?",
  "data/reddit-ask/r/AskReddit/comments/ljyz93/almost_all_fanbases_are_toxic_what_are_some.json": "Almost all fanbases are toxic, what are some fanbases are that are actually quite wholesome?",
  "data/reddit-ask/r/AskReddit/comments/lk02ca/elder_millennials_what_stereotype_aggravates_you.json": "Elder millennials, what stereotype aggravates you the most?",
  "data/reddit-ask/r/AskReddit/comments/lk1a8h/what_tv_show_had_the_best_finale.json": "What tv show had the best finale?",
  "data/reddit-ask/r/AskReddit/comments/lk2fql/what_is_the_one_song_that_regardless_of_your_mood.json": "What is the one song that, regardless of your mood, you will 100% never ever skip?",
  "data/reddit-ask/r/AskReddit/comments/lk7ziv/if_sex_was_a_game_what_would_be_some_loading.json": "If sex was a game, what would be some loading screen tips?",
  "data/reddit-ask/r/AskReddit/comments/lk9by8/if_animals_could_talk_which_would_be_the_rudest.json": "If animals could talk, which would be the rudest?",
  "data/reddit-ask/r/AskReddit/comments/lkcxth/what_animal_has_the_most_interesting_skills_in.json": "What animal has the most interesting skills in your opinion?",
  "data/reddit-ask/r/AskReddit/comments/lkd7rk/what_is_the_stupidest_way_you_got_a_scar.json": "What is the stupidest way you got a scar?",
  "data/reddit-ask/r/AskReddit/comments/lkdyjg/whats_something_you_found_out_about_your_so_years.json": "What's something you found out about your S.O years into the relationship that made you reevaluate the whole relationship?",
  "data/reddit-ask/r/AskReddit/comments/lkf6pb/people_who_are_stopped_at_a_red_light_for_1.json": "People who are stopped at a red light for 1 minute but creep forward a few feet every 10 seconds... Why?",
  "data/reddit-ask/r/AskReddit/comments/lkitqv/teachers_of_reddit_what_amusing_family_secrets.json": "Teachers of Reddit, what amusing family secrets did you accidentally learn from your overly talkative students?",
  "data/reddit-ask/r/AskReddit/comments/lkm1r7/what_do_you_miss_the_most_about_the_prepandemic.json": "What do you miss the most about the pre-pandemic world?",
  "data/reddit-ask/r/AskReddit/comments/lkp25c/what_is_something_you_refuse_to_buy_the_cheap.json": "What is something you REFUSE to buy the cheap version of?",
  "data/reddit-ask/r/AskReddit/comments/lkqpe6/what_is_the_absolute_dumbest_reason_youve_seen.json": "What is the absolute dumbest reason you've seen someone who isn't a child freak out?",
  "data/reddit-ask/r/AskReddit/comments/lkr3d5/whats_the_scariest_moment_in_a_video_game_youve.json": "What's the scariest moment in a video game you've ever had?",
  "data/reddit-ask/r/AskReddit/comments/lkvz8e/whats_a_fact_from_history_that_sounds_completely.json": "Whats a fact from history that sounds completely fake?",
  "data/reddit-ask/r/AskReddit/comments/lkzunt/if_you_could_take_a_pill_to_skip_sleep_allowing.json": "If you could take a pill to skip sleep, allowing you to feel fully rested with no side effects, would you do it? What would you do with a full 24 hours?",
  "data/reddit-ask/r/AskReddit/comments/ll1187/what_subreddits_you_should_never_visit.json": "What subreddits you should NEVER visit?",
  "data/reddit-ask/r/AskReddit/comments/ll3ddz/what_are_some_socially_acceptable_things_that.json": "What are some socially acceptable things that *shouldn't* be?",
  "data/reddit-ask/r/AskReddit/comments/ll5zk7/what_kind_of_person_do_you_absolutely_not_trust.json": "What kind of person do you absolutely NOT trust at all?",
  "data/reddit-ask/r/AskReddit/comments/ll9iwl/serious_have_you_ever_broken_off_a_relationship.json": "[serious] Have you ever broken off a relationship with someone you really loved because their family was absolutely nuts? What was their family like?",
  "data/reddit-ask/r/AskReddit/comments/llansy/if_before_having_a_child_the_couple_had_to_pass.json": "If before having a child, the couple had to pass an exam on 'how to raise a child', will we be better off?",
  "data/reddit-ask/r/AskReddit/comments/llawp7/what_is_something_youre_convinced_people_only.json": "What is something you’re convinced people only pretend to like?",
  "data/reddit-ask/r/AskReddit/comments/lljike/how_would_you_feel_if_the_us_dollar_bills_were.json": "How would you feel if the US dollar bills were redesigned and it including pictures of US’ greatest achievements such as the moon landing?",
  "data/reddit-ask/r/AskReddit/comments/llkp32/people_who_were_the_weird_or_quiet_kids_in_high.json": "People who were the \"Weird\" or \"Quiet\" kids in high school, what's your side of the story?",
  "data/reddit-ask/r/AskReddit/comments/llsy4i/waiterswaitresses_of_reddit_whats_the_most.json": "Waiters/waitresses of Reddit, what’s the most awkward first date you had to witness first hand?",
  "data/reddit-ask/r/AskReddit/comments/llv6lo/what_part_of_your_personality_do_you_fake.json": "What part of your personality do you fake?",
  "data/reddit-ask/r/AskReddit/comments/llwur2/dont_brag_about_morals_until_you_have_money_to.json": "“Don’t brag about morals until you have money to fund your temptations.There are many things hidden in poverty.” ~ Ancient Sage, what temptations usually emerge when you get rich?",
  "data/reddit-ask/r/AskReddit/comments/llyot3/fellas_whats_not_as_attractive_or_sexy_as_women.json": "Fellas, what's not as attractive or sexy as women think it is?",
  "data/reddit-ask/r/AskReddit/comments/lm3ngp/you_have_an_incredible_nights_sleep_wake_up_and.json": "You have an incredible night's sleep, wake up and the world is infested by zombies (9 out of 10 people). They are not lethal. Instead they're painfully boring, obsessed with politics and smell like off codfish. What do you do?",
  "data/reddit-ask/r/AskReddit/comments/lm3w8z/redditors_who_at_any_point_have_been_in_such_a.json": "Redditors who at any point have been in such a deep state of depression that you didn't want to DO anything, what is something that helped you get out of it?",
  "data/reddit-ask/r/AskReddit/comments/lm7abp/which_tv_show_got_too_big_for_its_boots.json": "Which TV show got too big for its boots?",
  "data/reddit-ask/r/AskReddit/comments/lma6pg/ladies_whats_not_as_attractive_or_sexy_as_men.json": "Ladies, what's not as attractive or sexy as men think it is?",
  "data/reddit-ask/r/AskReddit/comments/lmgcr5/have_you_ever_read_a_book_that_changed_your.json": "Have you ever read a book that changed your perspective on life? What book?",
  "data/reddit-ask/r/AskReddit/comments/lmgqaz/whats_a_sentence_that_would_sound_like_utter.json": "What's a sentence that would sound like utter gibberish to anyone that doesn't share your hobby or line of work?",
  "data/reddit-ask/r/AskReddit/comments/lmj1fi/what_thing_you_must_experience_at_least_once_in.json": "What thing you must experience at least once in life?",
  "data/reddit-ask/r/AskReddit/comments/lmkjfs/why_would_somebody_shoot_a_man_before_throwing.json": "Why would somebody shoot a man, before throwing them out of the plane?",
  "data/reddit-ask/r/AskReddit/comments/lmktus/theres_a_minimum_age_for_certain_political_jobs.json": "There's a minimum age for certain political jobs. How would you feel if there was a maximum age limit?",
  "data/reddit-ask/r/AskReddit/comments/lmmsdv/how_would_you_feel_knowing_that_someone_is.json": "How would you feel knowing that someone is masturbating to you ?",
  "data/reddit-ask/r/AskReddit/comments/lmugas/users_who_read_the_terms_and_conditions_what_are.json": "Users who read the terms and conditions, what are some of the worst things we've agreed to without paying attention?",
  "data/reddit-ask/r/AskReddit/comments/lmw88h/serious_what_is_your_creepiestmost_unnerving.json": "[Serious] What is your creepiest/most unnerving experience?",
  "data/reddit-ask/r/AskReddit/comments/ln0tbd/how_did_the_popular_asshole_of_your_school_get.json": "How did the popular asshole of your school get the taste of their own medicine?",
  "data/reddit-ask/r/AskReddit/comments/ln8pz0/redditors_who_live_on_their_own_what_is_an.json": "Redditors who live on their own, what is an essential thing you don't realise is essential, when you are moving out of your parents' house?",
  "data/reddit-ask/r/AskReddit/comments/lnax21/people_who_have_had_encounters_with_ufos_or.json": "People who have had encounters with UFOs or Aliens. What's your story?",
  "data/reddit-ask/r/AskReddit/comments/lnb5qd/parents_of_reddit_what_surprised_you_most_when.json": "Parents of Reddit, what surprised you most when your child moved out?",
  "data/reddit-ask/r/AskReddit/comments/lncra7/what_redditism_makes_you_roll_your_eyes_and_think.json": "What Redditism makes you roll your eyes and think \"oh fuck off\"?",
  "data/reddit-ask/r/AskReddit/comments/lnemyf/would_you_live_in_a_van_for_6_months_for_100000.json": "Would you live in a van for 6 months for $100,000 and why?",
  "data/reddit-ask/r/AskReddit/comments/lni47f/people_of_reddit_in_virtual_classes_what_was_the.json": "People of Reddit in virtual classes, what was the worst, “oops I left my camera/mic on” moment?",
  "data/reddit-ask/r/AskReddit/comments/lnoiwq/what_mandela_effect_fucked_you_up_the_most.json": "What Mandela effect fucked you up the most?",
  "data/reddit-ask/r/AskReddit/comments/lnoz1w/serious_how_do_we_deal_with_people_who_are_so.json": "[Serious] How do we deal with people who are so neck deep in conspiracy theories that any evidence or attempt to convince them otherwise results them in basically saying \"Nuh uh\" and ignoring everything?",
  "data/reddit-ask/r/AskReddit/comments/lnpvf9/physical_strength_is_more_commonly_admired_than.json": "Physical strength is more commonly admired than mental strength. Having the strength to overcome mental illness is something to be extremely proud of, yet these private battles aren't often shared and recognized. What mental battle are you most proud to have overcome or are currently overcoming?",
  "data/reddit-ask/r/AskReddit/comments/lnql7m/what_film_made_you_notice_an_actor_was_betterhad.json": "what film made you notice an actor was better/had more range than you originally thought?",
  "data/reddit-ask/r/AskReddit/comments/lnwf43/would_you_do_something_incredibly_easy_for_a.json": "Would you <do something incredibly easy> for <a large amount of money> and why?",
  "data/reddit-ask/r/AskReddit/comments/lnxq3f/did_you_ever_stop_watching_a_movie_midway_because.json": "Did you ever stop watching a movie midway because it was simply awful? Which one and at what moment?",
  "data/reddit-ask/r/AskReddit/comments/lo0a6i/redditors_how_often_do_you_write_long_replies_to.json": "Redditors, how often do you write long replies to Posts only to delete it half way through because you believe nobody will care what you think?",
  "data/reddit-ask/r/AskReddit/comments/lo5paf/what_is_the_thing_that_everyone_believe_is_true.json": "What Is the thing that everyone believe is true but it's actually false?",
  "data/reddit-ask/r/AskReddit/comments/lo5wcx/serious_children_and_grandchildren_of_nazi_war.json": "[Serious] Children and grandchildren of Nazi war criminals, how did it feel knowing they were part of the Nazi regimes and how did you find out?",
  "data/reddit-ask/r/AskReddit/comments/lo8bg6/garbage_menwoman_of_the_world_whats_the_bestworst.json": "Garbage men/woman of the world. What's the best/worst thing you have found \"thrown away\" ??",
  "data/reddit-ask/r/AskReddit/comments/lobvqr/what_game_will_replace_bingo_in_the_nursing_homes.json": "What game will replace BINGO in the nursing homes in 30 years?",
  "data/reddit-ask/r/AskReddit/comments/loj7my/people_who_care_even_remotely_about_the.json": "People who care even remotely about the Kardashians, why?",
  "data/reddit-ask/r/AskReddit/comments/lojpuy/what_movie_villains_quote_is_your_favourite.json": "What movie villains quote is your favourite?",
  "data/reddit-ask/r/AskReddit/comments/lomn6s/whats_something_you_saw_as_a_kid_that_looked.json": "What’s something you saw as a kid that looked harmless but if you witnessed it now it would horrify you?",
  "data/reddit-ask/r/AskReddit/comments/lonmy3/you_get_paid_100kyr_to_do_whatever_you_want_for.json": "You get paid $100k/yr to do whatever you want for 40 hours a week. The only catch is, you must do the same thing every day. What's your new job?",
  "data/reddit-ask/r/AskReddit/comments/loo05u/what_changed_in_your_life_that_made_it_so_much.json": "What changed in your life that made it so much better?",
  "data/reddit-ask/r/AskReddit/comments/lovnsu/tourists_of_reddit_what_was_the_most_fucked_up.json": "Tourists of Reddit, what was the most fucked up think you saw in another country?",
  "data/reddit-ask/r/AskReddit/comments/loyh0g/kids_whose_parents_used_to_put_them_on_leashes_at.json": "Kids whose parents used to put them on leashes at the grocery store or at the amusement park how are you now?",
  "data/reddit-ask/r/AskReddit/comments/loyljq/what_movie_do_you_have_to_watch_more_then_once_to.json": "What movie do you have to watch more then once to understand it?",
  "data/reddit-ask/r/AskReddit/comments/lp03r7/whats_a_question_you_absolutely_hate_being_asked.json": "What's a question you absolutely hate being asked?",
  "data/reddit-ask/r/AskReddit/comments/lp0eot/every_toothpaste_advert_claims_910_dentists_use.json": "Every toothpaste advert claims 9/10 dentists use that brand. So, dentists of Reddit, what toothpaste do you personally use?",
  "data/reddit-ask/r/AskReddit/comments/lp5bqa/whats_a_video_game_you_enjoyed_that_most_people.json": "What's a video game you enjoyed that most people disliked?",
  "data/reddit-ask/r/AskReddit/comments/lp96cb/whats_a_cool_fact_about_dinosaurs_you_know.json": "What's a cool fact about dinosaurs you know?",
  "data/reddit-ask/r/AskReddit/comments/lpcnnq/what_gives_you_anxiety.json": "What gives you anxiety?",
  "data/reddit-ask/r/AskReddit/comments/lpcors/whats_the_weirdest_sex_thing_your_partner_has.json": "What’s the weirdest sex thing your partner has asked you to do, and did you do it?",
  "data/reddit-ask/r/AskReddit/comments/lpdcfs/what_is_the_worst_piece_of_advice_youve_seen.json": "What is the worst piece of advice you've seen on/used from Reddit?",
  "data/reddit-ask/r/AskReddit/comments/lpdf82/whats_something_from_the_2000s_that_desperately.json": "What’s something from the 2000’s that desperately needs a comeback in the 2020’s? And why?",
  "data/reddit-ask/r/AskReddit/comments/lpdhhy/what_do_you_think_about_adults_that_dont_eat.json": "What do you think about adults that don’t eat vegetables?",
  "data/reddit-ask/r/AskReddit/comments/lpeb9r/what_says_youre_stupid_without_saying_youre_stupid.json": "What says you’re stupid without saying you’re stupid?",
  "data/reddit-ask/r/AskReddit/comments/lpgrh7/the_last_game_you_played_is_where_youre_living.json": "The last game you played is where you’re living for the next year. How screwed are you?",
  "data/reddit-ask/r/AskReddit/comments/lpkaym/what_two_videogames_would_make_a_great_game.json": "What two videogames would make a great game combined?",
  "data/reddit-ask/r/AskReddit/comments/lpkcll/what_is_something_that_the_younger_generations.json": "What is something that the younger generations will never get to experience that was instrumental to you growing up?",
  "data/reddit-ask/r/AskReddit/comments/lpmamq/what_are_some_facts_that_can_actually_save.json": "What are some facts that can actually save someone’s life?",
  "data/reddit-ask/r/AskReddit/comments/lpmgf9/if_school_was_a_videogame_what_would_the_loading.json": "If school was a videogame what would the loading screen tips be?",
  "data/reddit-ask/r/AskReddit/comments/lpnbyr/if_you_werent_on_reddit_right_now_what_would_you.json": "If you weren't on Reddit right now, what would you be doing?",
  "data/reddit-ask/r/AskReddit/comments/lpostw/hacky_sackers_that_used_to_just_hang_out_in_the.json": "Hacky sackers that used to just hang out in the common areas at school and hacky sack all the time, where are you today?",
  "data/reddit-ask/r/AskReddit/comments/lpqamu/what_actoractress_was_completely_100_wrong_for.json": "What actor/actress was completely 100% wrong for the role?",
  "data/reddit-ask/r/AskReddit/comments/lpqswn/what_did_you_learn_too_late_in_life.json": "What did you learn too late in life?",
  "data/reddit-ask/r/AskReddit/comments/lpuh8m/depressed_people_how_do_you_motivate_yourself_to.json": "Depressed people, how do you motivate yourself to do things, even small tasks? [Serious]",
  "data/reddit-ask/r/AskReddit/comments/lpyk3f/which_movie_is_the_biggest_waste_of_potential.json": "Which movie is the biggest waste of potential?",
  "data/reddit-ask/r/AskReddit/comments/lq4fu3/whats_something_thats_secretly_been_great_about.json": "What’s something that’s secretly been great about the pandemic?",
  "data/reddit-ask/r/AskReddit/comments/lq4h7m/if_they_found_ancient_human_skeletal_remains_on.json": "If they found ancient human skeletal remains on mars , what would your first theory be?",
  "data/reddit-ask/r/AskReddit/comments/lq7btk/people_that_work_in_the_wedding_industry_have_you.json": "People that work in the wedding industry, have you ever seen a couple and immediately thought “this ends in divorce”? Why?",
  "data/reddit-ask/r/AskReddit/comments/lqe2py/whats_the_longest_youve_been_awake.json": "What’s the longest you’ve been awake?",
  "data/reddit-ask/r/AskReddit/comments/lqeygf/for_men_who_used_to_be_creepy_towards_women_and.json": "For men who used to be \"creepy\" towards women and have since stopped, what was it that made you realize you were creepy that prompted you to change?",
  "data/reddit-ask/r/AskReddit/comments/lqfy71/every_problem_has_a_solution_what_problem_has_no.json": "Every problem has a solution, what problem has no solution?",
  "data/reddit-ask/r/AskReddit/comments/lqg49j/people_who_did_badly_in_school_what_are_you_doing.json": "People who did badly in school. What are you doing today?",
  "data/reddit-ask/r/AskReddit/comments/lqh0b8/what_does_it_feel_like_to_grow_up.json": "What does it feel like to grow up?",
  "data/reddit-ask/r/AskReddit/comments/lqivct/quiet_kids_at_school_how_do_you_feel_about_people.json": "Quiet kids at school, how do you feel about people making jokes about the “quiet kid” shooting up a school”?",
  "data/reddit-ask/r/AskReddit/comments/lqk9gy/in_what_way_is_it_expensive_to_be_poor.json": "In what way is it expensive to be poor?",
  "data/reddit-ask/r/AskReddit/comments/lqnubh/whats_the_best_free_mobile_game_youve_ever_played.json": "What’s the best free mobile game you’ve ever played?",
  "data/reddit-ask/r/AskReddit/comments/lqu9ar/if_sex_wasnt_an_act_of_pleasure_what_would_have.json": "If sex wasn't an act of pleasure, what would have been the world's population?",
  "data/reddit-ask/r/AskReddit/comments/lqviv1/whats_a_deeply_unsettling_fact.json": "What's a deeply unsettling fact?",
  "data/reddit-ask/r/AskReddit/comments/lqzvd8/redditors_how_would_you_feel_about_a_basic_life.json": "Redditors how would you feel about a “Basic Life Skills” class in High School that teaches you how to not post the exact same questions to Reddit fifty times everyday?",
  "data/reddit-ask/r/AskReddit/comments/lr3ozq/what_is_your_best_ghostparanormal_experience_story.json": "What is your best ghost/paranormal experience story?",
  "data/reddit-ask/r/AskReddit/comments/lr90yh/people_who_ended_a_relationship_because_reddit.json": "People who ended a relationship because Reddit told them to, do you regret it? [serious]",
  "data/reddit-ask/r/AskReddit/comments/lreesb/redditors_who_have_to_be_adults_and_do_stuff_but.json": "Redditors who have to be adults and do stuff but only want to lay in bed and play video games all day, how do you do it?",
  "data/reddit-ask/r/AskReddit/comments/lreopg/people_who_help_fight_human_trafficking_what_are.json": "People who help fight human trafficking: what are some tips you have for spotting illegal activity, and reporting it?",
  "data/reddit-ask/r/AskReddit/comments/lrf541/you_are_tasked_with_creating_a_fake_heaven_that.json": "You are tasked with creating a fake heaven that secretly tortures people. What unnoticeable inconveniences would you add to torture your victims without them figuring out they aren't in heaven?",
  "data/reddit-ask/r/AskReddit/comments/lriqwb/you_are_trying_to_sell_cabbages_but_a_group_of.json": "You are trying to sell cabbages, but a group of kids and their weird animals keep destroying them. What do you do?",
  "data/reddit-ask/r/AskReddit/comments/lro4l5/jfk_said_too_often_we_enjoy_the_comfort_of.json": "JFK said \"Too often, we enjoy the comfort of opinion without the discomfort of thought\". Lets assume we are all guilty. So what is something you have an opinion on without having put much thought into it?",
  "data/reddit-ask/r/AskReddit/comments/lrq9fk/which_franchise_do_you_think_is_very_overrated.json": "Which franchise do you think is VERY overrated?",
  "data/reddit-ask/r/AskReddit/comments/lrwpaf/what_food_do_you_just_completely_despise_and_why.json": "What food do you just completely despise and why?",
  "data/reddit-ask/r/AskReddit/comments/lryi5j/serious_people_whove_had_sex_with_their.json": "[serious] People who've had sex with their SO/ex/friend's parent, how the hell did you get to that point? What happened after?",
  "data/reddit-ask/r/AskReddit/comments/ls0jqp/what_is_a_fact_that_you_thought_everybody_knew.json": "What is a fact that you thought everybody knew but apparently you were the only one?",
  "data/reddit-ask/r/AskReddit/comments/ls0vln/people_who_clean_up_after_festivals_and_similar.json": "People who clean up after festivals and similar events, what's the best and worst things you have found left behind?",
  "data/reddit-ask/r/AskReddit/comments/ls5oeh/nurses_and_midwives_of_reddit_have_you_ever_tried.json": "Nurses and midwives of Reddit, have you ever tried to talk new parents out of a baby name? What was it?",
  "data/reddit-ask/r/AskReddit/comments/ls7s4o/change_a_single_word_in_a_famous_quote_with_penis.json": "Change a single word in a famous quote with penis, how does it turn out?",
  "data/reddit-ask/r/AskReddit/comments/ls8lcn/whats_your_workplace_scandal.json": "What's your workplace scandal?",
  "data/reddit-ask/r/AskReddit/comments/lsdkob/people_of_reddit_what_stupid_rule_at_your.json": "People of Reddit, What stupid rule at your work/school backfired beautifully?",
  "data/reddit-ask/r/AskReddit/comments/lsiwp8/how_tired_of_you_of_seeing_the_same_post_multiple.json": "How tired of you of seeing the same post multiple times as you scroll through reddit?",
  "data/reddit-ask/r/AskReddit/comments/lsnlgi/what_screams_im_insecure.json": "What screams “I’m insecure”?",
  "data/reddit-ask/r/AskReddit/comments/lspj6z/would_you_enjoy_a_cute_friendly_purring_cat_sit.json": "Would you enjoy a cute friendly purring cat sit right next to you to keep you company right now? Why or why not?",
  "data/reddit-ask/r/AskReddit/comments/lsukte/whats_the_creepiest_thing_an_ex_has_done.json": "What's the creepiest thing an ex has done?",
  "data/reddit-ask/r/AskReddit/comments/lsuuw4/what_life_changing_item_can_you_buy_for_less_than.json": "What life changing item can you buy for less than $10?",
  "data/reddit-ask/r/AskReddit/comments/lsvvkp/babysitters_of_reddit_what_screams_well_this_kid.json": "Babysitters of reddit, what screams \"well, this kid is fucked when they grow up\"?",
  "data/reddit-ask/r/AskReddit/comments/lsyhdg/what_fake_thing_that_happens_in_movies_pisses_you.json": "What \"fake\" thing that happens in movies pisses you off?",
  "data/reddit-ask/r/AskReddit/comments/lt0qob/what_are_you_sick_of_trying_to_explain_to_people.json": "What are you sick of trying to explain to people?",
  "data/reddit-ask/r/AskReddit/comments/lt2x0s/you_find_yourself_on_a_version_of_earth_thats.json": "You find yourself on a version of earth that’s never heard music. You have the complete catalogue. What’s the first piece you introduce humans to?",
  "data/reddit-ask/r/AskReddit/comments/lt3aid/whats_the_most_fucked_up_thing_someone_has_told.json": "What's the most fucked up thing someone has told you about themselves after barely getting to know them?",
  "data/reddit-ask/r/AskReddit/comments/ltco0b/without_revealing_your_age_what_was_the_1st_video.json": "Without revealing your age, what was the 1st video game you remember playing?",
  "data/reddit-ask/r/AskReddit/comments/ltdfay/what_is_a_common_skill_you_just_cant_seem_to.json": "What is a common skill you just can’t seem to master?",
  "data/reddit-ask/r/AskReddit/comments/ltgf53/like_how_a_hotdog_tastes_better_at_a_baseball.json": "Like how A hotdog tastes better at a baseball game, what other foods are improved by eating them at a specific event/location?",
  "data/reddit-ask/r/AskReddit/comments/ltikks/people_of_reddit_what_is_the_worst_thing_a.json": "People of Reddit, what is the worst thing a therapist, psychiatrist, or mental health professional has ever said to you?",
  "data/reddit-ask/r/AskReddit/comments/ltksoi/what_crimes_do_you_think_should_have_a_more.json": "What crimes do you think should have a more severe punishment?",
  "data/reddit-ask/r/AskReddit/comments/ltmerx/whats_the_most_disturbing_text_message_you_got.json": "What's the most disturbing text message you got?",
  "data/reddit-ask/r/AskReddit/comments/ltpfe3/snoop_dogg_pays_someone_to_roll_his_joints_if_you.json": "Snoop Dogg pays someone to roll his joints. If you were Snoop Dogg rich, what frivolous things would you pay people to do for you?",
  "data/reddit-ask/r/AskReddit/comments/ltpuiv/what_is_the_most_fucked_up_thing_you_did_that.json": "What is the most fucked up thing you did that still haunts you to this day?",
  "data/reddit-ask/r/AskReddit/comments/ltx1wv/dog_owners_of_reddit_would_you_accept_that_you.json": "Dog owners of reddit: would you accept that you will die when you are 60 if it meant your dog would remain alive and healthy until you died?",
  "data/reddit-ask/r/AskReddit/comments/ltxpc8/whats_a_terrible_lyric_in_an_otherwise_great_song.json": "What's a terrible lyric in an otherwise great song?",
  "data/reddit-ask/r/AskReddit/comments/ltz79s/what_is_something_that_seems_basic_but_that.json": "What is something that seems basic, but that humanity figured out surprisingly recently ?",
  "data/reddit-ask/r/AskReddit/comments/lu0smq/serious_those_of_you_who_have_been_disowned_what.json": "[Serious] Those of you who have been disowned, what was your side of the story?",
  "data/reddit-ask/r/AskReddit/comments/lu0zrx/whats_something_from_10_years_ago_that_doesnt.json": "What’s something from 10 years ago that doesn’t exist now?",
  "data/reddit-ask/r/AskReddit/comments/lu1rp7/what_was_your_most_embarrassing_sexual_experience.json": "What was your most embarrassing sexual experience?",
  "data/reddit-ask/r/AskReddit/comments/lu454n/if_you_could_own_any_one_nondomesticated_animal.json": "If you could own any one non-domesticated animal as a pet, guaranteed safe and tamed, which one would you have?",
  "data/reddit-ask/r/AskReddit/comments/lu5gek/what_did_you_think_youd_always_enjoy_doing_until.json": "What did you think you'd always enjoy doing, until the day came when you realized the spark was totally gone?",
  "data/reddit-ask/r/AskReddit/comments/lu6eal/one_day_you_woke_up_and_found_out_you_are_back_in.json": "One day, you woke up and found out you are back in your elementary school years and have to live your life all over again. How will you live your life the second time and what different choices will you be making?",
  "data/reddit-ask/r/AskReddit/comments/lu7ozh/if_the_oceans_were_drained_what_would_be_the.json": "If the oceans were drained, what would be the first thing you would go looking for?",
  "data/reddit-ask/r/AskReddit/comments/lubove/you_accidentally_put_in_an_hour_more_community.json": "You accidentally put in an hour more community service than needed, now you have to do 1 hour of community disservice. What do you do?",
  "data/reddit-ask/r/AskReddit/comments/luddci/whats_a_small_achievement_you_would_like_a_pat_on.json": "What's a small achievement you would like a pat on the back for?",
  "data/reddit-ask/r/AskReddit/comments/luf0ki/serious_what_is_it_like_to_have_children_you_dont.json": "[Serious] What is it like to have children you don’t want?",
  "data/reddit-ask/r/AskWomen/comments/l9egpu/how_would_you_feel_about_courts_mandating_one.json": "How would you feel about courts mandating one year of waiting after filing/before marriage rather than one year of waiting after filing/before divorce? Would that have changed your life at all if it was the case?",
  "data/reddit-ask/r/AskWomen/comments/l9qvh6/for_women_who_dont_wear_makeup_what_are_some_perks.json": "For women who don’t wear makeup, what are some perks?",
  "data/reddit-ask/r/AskWomen/comments/la5v0h/do_you_ever_feel_like_youre_living_a_mediocre.json": "Do you ever feel like you're living a mediocre life? And how does it make you feel?",
  "data/reddit-ask/r/AskWomen/comments/la7fdu/women_who_have_dealt_with_trauma_how_do_you_deal.json": "Women who have dealt with trauma: How do you deal with those quiet moments when the memories start flooding back?",
  "data/reddit-ask/r/AskWomen/comments/la96dc/women_who_have_climbed_your_way_up_the_corporate.json": "Women who have climbed your way up the corporate ladder, what are things you wish you knew looking back on your journey?",
  "data/reddit-ask/r/AskWomen/comments/lax2gv/are_you_having_difficulty_finding_people_you_find.json": "Are you having difficulty finding people you find physically attractive, particularly with online dating? What’s your experience?",
  "data/reddit-ask/r/AskWomen/comments/lbbjt8/women_whove_taken_a_partners_last_name_when_that.json": "Women who've taken a partner's last name when that name doesn't match your own culture/ethnicity: What has been your experience with your new name? Have you ever regretted taking it?",
  "data/reddit-ask/r/AskWomen/comments/lc447t/ladies_what_is_a_difficult_part_of_a_relationship.json": "Ladies, what is a difficult part of a relationship that is completely normal?",
  "data/reddit-ask/r/AskWomen/comments/lc7ica/women_who_previously_didnt_enjoy_sex_but_came.json": "Women who previously didn't enjoy sex, but came around to loving it. What changed? Please share your stories.",
  "data/reddit-ask/r/AskWomen/comments/lcc2p8/what_are_things_you_grew_up_thinking_were.json": "What are things you grew up thinking were completely normal, but later realized they weren't?",
  "data/reddit-ask/r/AskWomen/comments/lcdnbl/what_superstition_do_you_believe_in.json": "What \"superstition\" do you believe in?",
  "data/reddit-ask/r/AskWomen/comments/lcg2z1/what_single_scene_from_a_movie_is_an_absolute.json": "What single scene from a movie is an absolute masterpiece?",
  "data/reddit-ask/r/AskWomen/comments/lcydgv/how_do_you_make_yourself_feel_better_after_being.json": "How do you make yourself feel better after being catcalled?",
  "data/reddit-ask/r/AskWomen/comments/lcyirr/ladies_do_you_deal_with_imposter_syndrome_at.json": "Ladies do you deal with imposter syndrome at workplace/ academics? If yes how do you cope with the nerve wrecking anxiety often accompanying it?",
  "data/reddit-ask/r/AskWomen/comments/ld0pvr/women_of_reddit_have_you_ever_considered_ending.json": "Women of Reddit, have you ever considered ending it all? How have you gotten through this feeling and/or how do you continue to feel like you're worth it?",
  "data/reddit-ask/r/AskWomen/comments/ld6m3v/how_do_you_get_out_of_a_rut_when_everyday_feels.json": "How do you get out of a rut when everyday feels like Groundhog Day?",
  "data/reddit-ask/r/AskWomen/comments/ldmu71/if_you_had_a_friend_who_spoke_to_you_in_the_same.json": "If you had a friend who spoke to you in the same way you sometimes speak to yourself, how long would you allow this person to be your friend?",
  "data/reddit-ask/r/AskWomen/comments/le0916/what_attribute_of_your_partner_makes_you_still.json": "What attribute of your partner makes you still fall in love with them?",
  "data/reddit-ask/r/AskWomen/comments/le4dx7/women_who_have_outgrown_their_partners_in_what.json": "Women who have “outgrown” their partners: In what ways did you outgrow them, and how did you handle it?",
  "data/reddit-ask/r/AskWomen/comments/le6cip/women_who_have_been_in_multiple_relationships.json": "Women who have been in multiple relationships, what things did you realize as genuine problems with yourself as a partner? And how did you fix them?",
  "data/reddit-ask/r/AskWomen/comments/lehxxt/how_do_you_live_instead_of_just_existing.json": "How do you ‘live’ instead of just existing?",
  "data/reddit-ask/r/AskWomen/comments/lek2h3/women_who_love_living_alone_and_always_want_to.json": "Women who love living alone and always want to; how did you come to realise this and do others have trouble accepting you’re genuinely happy, if not happier than married couples/ big families?",
  "data/reddit-ask/r/AskWomen/comments/leteig/what_are_some_words_which_infantilize_women_that.json": "What are some words which infantilize women that you are so sick of people using in relation to you and other women?",
  "data/reddit-ask/r/AskWomen/comments/leyr6o/women_who_dealt_with_hardshipmental_illness_how.json": "Women who dealt with hardship/mental illness, how did you come out of it and improve your life in terms of the 'adult world' (graduating college, finding a job, marriage, kids, etc.)?",
  "data/reddit-ask/r/AskWomen/comments/lf928z/women_of_reddit_how_do_you_deal_with_complete.json": "Women of reddit, how do you deal with complete lack of motivation/drive caused by anxiety/low self esteem?",
  "data/reddit-ask/r/AskWomen/comments/lfafb7/deaf_women_of_reddit_what_would_make_you_more.json": "deaf women of reddit, what would make you more comfortable during conversation? All answers are welcome.",
  "data/reddit-ask/r/AskWomen/comments/lfax5q/what_was_the_most_unexpected_plot_twist_of_your.json": "What was the most unexpected plot twist of your life?",
  "data/reddit-ask/r/AskWomen/comments/lfrl9s/women_of_reddit_when_did_you_realise_you_didnt.json": "Women of reddit, when did you realise you didn’t have to be agreeable and how did that impact your life?",
  "data/reddit-ask/r/AskWomen/comments/lg0gma/women_of_reddit_does_your_experience_of_romantic.json": "Women of reddit, does your experience of romantic love feel like how it's portrayed in mainstream media (films, song lyrics etc.)? Why/why not?",
  "data/reddit-ask/r/AskWomen/comments/lg4mwa/what_is_it_like_growing_up_with_a_father_serious.json": "What is it like growing up with a father? (serious)",
  "data/reddit-ask/r/AskWomen/comments/lgacwh/how_do_you_cope_with_workdays_where_you_get.json": "How do you cope with workdays where you get nothing done?",
  "data/reddit-ask/r/AskWomen/comments/lgjgly/what_was_the_most_supportive_thing_friends_did.json": "What was the most supportive thing friends did for (or gave) you when you were grieving the loss of a loved one?",
  "data/reddit-ask/r/AskWomen/comments/lgptlo/have_you_said_andor_heard_women_say_vagina_jokes.json": "Have you said and/or heard women say vagina jokes similar to how men say penis jokes? What were they?",
  "data/reddit-ask/r/AskWomen/comments/lgs5yo/what_foreign_non_indian_women_think_of_sari.json": "What foreign (Non Indian) women think of sari?",
  "data/reddit-ask/r/AskWomen/comments/lgyoz4/serious_ladies_whos_sos_cant_talk_about_their.json": "[Serious] Ladies who's SO's can't talk about their jobs due to the sensitivity of their work (government, military, what have you), how do you make the relationship work with the nessesary secrecy?",
  "data/reddit-ask/r/AskWomen/comments/lh0eqb/do_you_ever_feel_like_you_have_no_personality.json": "Do you ever feel like you have no personality? What do you do to overcome this?",
  "data/reddit-ask/r/AskWomen/comments/lh0oqc/women_whove_been_to_strip_clubs_not_as_performers.json": "Women who've been to strip clubs, not as performers, but as customers, what was it like? Why'd you go?",
  "data/reddit-ask/r/AskWomen/comments/lhi5y3/what_are_your_happiness_triggers.json": "What are your happiness triggers?",
  "data/reddit-ask/r/AskWomen/comments/lhlvmv/if_youre_on_the_fence_about_having_kids_why_is.json": "If you’re on the fence about having kids - why is that?",
  "data/reddit-ask/r/AskWomen/comments/lhql1s/what_is_the_weirdest_side_effect_of_having_your.json": "What is the weirdest side effect of having your period?",
  "data/reddit-ask/r/AskWomen/comments/li8dzd/as_an_introvert_how_do_you_feel_about_this_quote.json": "As an introvert, how do you feel about this quote by Jim Carrey? “Solitude is dangerous. It’s very addictive. It becomes a habit after you realize how calm and peaceful it is. It’s like you don’t want to deal with people anymore because they drain your energy.”",
  "data/reddit-ask/r/AskWomen/comments/libn8f/women_who_overcame_the_i_dont_know_what_im_doing.json": "Women who overcame the “I don’t know what I’m doing or what I want” phase of your careers and are now thriving and fulfilled, how did you get there?",
  "data/reddit-ask/r/AskWomen/comments/liy002/women_who_have_had_ovarian_cancer_what_were_your.json": "women who have had ovarian cancer, what were your symptoms/how did you find out?",
  "data/reddit-ask/r/AskWomen/comments/lj56dw/to_girls_that_are_way_into_their_20s_but_still.json": "To girls that are way into their 20s but still look like teenagers: what are your tips on how to appear more mature/woman?",
  "data/reddit-ask/r/AskWomen/comments/lja4ns/in_what_ways_have_you_learned_to_be_nicer_to.json": "In what ways have you learned to be nicer to yourself over the past year?",
  "data/reddit-ask/r/AskWomen/comments/ljcmvs/how_has_your_attractiveness_level_andor_choice_of.json": "How has your attractiveness level and/or choice of femininity expression affected the kind of friendships you have, especially with other women?",
  "data/reddit-ask/r/AskWomen/comments/ljlrlx/women_who_have_learnt_to_be_more_assertive_what.json": "Women who have learnt to be more assertive, what are your tips?",
  "data/reddit-ask/r/AskWomen/comments/ljrvud/have_you_stayed_in_a_relationship_longer_than_you.json": "Have you stayed in a relationship longer than you should have because your SO had a bad upbringing and poor behavior \"wasn't their fault?\" What finally made you leave/see the light?",
  "data/reddit-ask/r/AskWomen/comments/ljv7nq/what_makes_you_wonder_do_other_women_experience.json": "What makes you wonder \"do other women experience this too?\"",
  "data/reddit-ask/r/AskWomen/comments/ljzcds/whos_a_stranger_you_will_never_forget.json": "Who’s a stranger you will never forget?",
  "data/reddit-ask/r/AskWomen/comments/lk3g3t/whats_the_loneliest_thing_youve_ever_done.json": "What’s the loneliest thing you’ve ever done?",
  "data/reddit-ask/r/AskWomen/comments/lkex72/those_who_grew_up_poor_or_poorish_what_are_good.json": "Those who grew up poor or poor-ish, what are GOOD things you get nostalgic for about your childhood? What ways did you and your family have fun even when you didn’t have means to do much?",
  "data/reddit-ask/r/AskWomen/comments/lkkxsi/for_those_of_you_that_suffer_debilitating_chronic.json": "For those of you that suffer debilitating chronic pain: Do you ever worry that everyone in your life secretly thinks you’re faking it or ‘just being dramatic’? How do you deal with those feelings or other feelings of guilt?",
  "data/reddit-ask/r/AskWomen/comments/lkplco/women_who_used_to_be_or_were_labeled_as_mean.json": "Women who used to be or were labeled as “mean girls”, what was the turning point/event that made you realize you were being mean or being perceived as a mean person and want to change that?",
  "data/reddit-ask/r/AskWomen/comments/lkyuoa/women_whove_had_kids_and_expected_their_partners.json": "women who’ve had kids and expected their partners to step up to the role but didn’t, what’s your experience?",
  "data/reddit-ask/r/AskWomen/comments/lla88h/what_are_some_views_and_opinions_youve_pulled_a.json": "What are some views and opinions you've pulled a complete 180 in?",
  "data/reddit-ask/r/AskWomen/comments/llbw3o/if_your_friend_or_partner_was_replaced_with_a.json": "If your friend or partner was replaced with a nearly perfect pod person, how do you think you'd figure out it wasn't them?",
  "data/reddit-ask/r/AskWomen/comments/lles2w/what_trait_do_you_find_attractive_but_dont_find.json": "What trait do you find attractive but don't find in many people?",
  "data/reddit-ask/r/AskWomen/comments/llic2b/how_did_you_work_through_that_early_20s_hump.json": "How did you work through that early 20’s hump?",
  "data/reddit-ask/r/AskWomen/comments/lljmyi/what_are_you_favourite_parts_about_being_a_mother.json": "What are you favourite parts about being a mother?",
  "data/reddit-ask/r/AskWomen/comments/lls70h/a_woman_on_tiktok_said_she_realized_her_bf_loved.json": "A woman on tiktok said she realized her bf loved her when she asked him why her printer never ran out of ink. He said he saw her using it a lot, so he subscribed to a monthly printer ink service and had been replacing the ink for her. What are things that made you realize your partner loves you?",
  "data/reddit-ask/r/AskWomen/comments/lmaci1/what_is_your_favourite_memory_that_youve_shared.json": "What is your favourite memory that you’ve shared with your SO?",
  "data/reddit-ask/r/AskWomen/comments/lmczun/women_who_work_out_daily_how_do_you_maintain_a.json": "Women who work out daily: How do you maintain a hair-care routine?",
  "data/reddit-ask/r/AskWomen/comments/ln74cg/how_do_some_women_make_adult_friends_so_easily_im.json": "How do some women make adult friends so easily? I’m scared to ask other women out for drinks or dinner in fear of coming off as creepy or flirty when my only intentions are to make friends.",
  "data/reddit-ask/r/AskWomen/comments/lns9wb/women_what_is_something_that_women_experience_and.json": "women, what is something that women experience and is seen as “normal” but is actually very wrong/shouldn’t be as accepted as it is?",
  "data/reddit-ask/r/AskWomen/comments/lnwi4q/why_do_older_women_usually_have_shorter_hair_than.json": "Why do older women (usually) have shorter hair than younger women? If you are an older woman with short hair, why did you cut it?",
  "data/reddit-ask/r/AskWomen/comments/lo7auk/women_who_have_witnessed_male_friends_treating.json": "Women who have witnessed male friends treating their wives and children badly, but not said anything, why?",
  "data/reddit-ask/r/AskWomen/comments/lo7e3d/women_who_are_in_a_relationship_with_someone_who.json": "Women who are in a relationship with someone who wasn't interested in you at first, what's your story?",
  "data/reddit-ask/r/AskWomen/comments/lo7xpd/what_are_things_that_people_ask_that_make_you.json": "What are things that people ask that make you feel uncomfortable?",
  "data/reddit-ask/r/AskWomen/comments/loa60s/single_women_who_did_artificial_insemination_what.json": "Single women who did artificial insemination, what acts of care or support would you have appreciated receiving from your closed ones?",
  "data/reddit-ask/r/AskWomen/comments/loakw2/what_are_signs_of_healthy_vs_unhealthy_boundaries.json": "What are signs of healthy vs unhealthy boundaries?",
  "data/reddit-ask/r/AskWomen/comments/lobwof/whos_that_one_person_you_dislike_but_youd_never.json": "Who's that one person you dislike, but you'd never admit it to the world?",
  "data/reddit-ask/r/AskWomen/comments/loel60/how_often_in_your_life_have_those_with_authority.json": "How often in your life have those with authority over you (parents, teachers, bosses, etc) willfully admitted their shortcomings and apologized for mistakes they've made?",
  "data/reddit-ask/r/AskWomen/comments/lorbrn/women_that_get_a_feeling_of_dread_the_night.json": "Women that get a feeling of dread the night before their first day back at work, how do you deal with it?",
  "data/reddit-ask/r/AskWomen/comments/lox9j2/how_would_you_react_if_someone_you_knew_came_out.json": "How would you react if someone you knew came out as Asexual?",
  "data/reddit-ask/r/AskWomen/comments/lpb8hd/mental_fatigue_can_be_draining_especially_in_the.json": "Mental fatigue can be draining, especially in the long term so what are some great exercises/ tips to have a healthy and strong mindset?",
  "data/reddit-ask/r/AskWomen/comments/lpc47o/what_are_some_small_things_you_do_to_romanticize.json": "What are some small things you do to romanticize mundane daily life?",
  "data/reddit-ask/r/AskWomen/comments/lpmi0l/what_are_some_subtle_red_flags_in_platonic_female.json": "What are some subtle red flags in platonic female friendships?",
  "data/reddit-ask/r/AskWomen/comments/lptdoa/whats_the_most_stupid_way_that_youve_disregarded.json": "What’s the most stupid way that you’ve disregarded your safety? What have you learned from it?",
  "data/reddit-ask/r/AskWomen/comments/lpu713/has_someones_offhanded_comment_really_stuck_with.json": "Has someone's off-handed comment really stuck with you or changed your life in some way? If so, what was it and why?",
  "data/reddit-ask/r/AskWomen/comments/lqc7ev/saw_a_comment_on_youtube_that_said_people_who_say.json": "Saw a comment on YouTube that said \"People who say 'I'm the nicest person until you cross me' are usually mean all the time\". Thoughts?",
  "data/reddit-ask/r/AskWomen/comments/lqz57x/to_the_women_who_wear_their_hair_down_at_the_gym.json": "To the women who wear their hair down at the gym, how and why?",
  "data/reddit-ask/r/AskWomen/comments/lrf8oo/women_who_have_dated_someone_only_for_them_to.json": "Women who have dated someone only for them to choose someone else over you: how did you manage at the time, and how are you now?",
  "data/reddit-ask/r/AskWomen/comments/lrolt7/fellow_asian_women_to_what_extent_have_you_been.json": "Fellow Asian women, to what extent have you been personally impacted by the rise of hate crimes against Asian-X due to the pandemic?",
  "data/reddit-ask/r/AskWomen/comments/lrzibk/hey_ladies_what_are_some_good_hair_care_tips_for.json": "Hey ladies, what are some good hair care tips for those that are new to long hair?",
  "data/reddit-ask/r/AskWomen/comments/ls53n9/to_all_homecooks_how_do_you_create_a_weekly_meal.json": "To all homecooks, how do you create a weekly meal plan for the family and where do you keep all your recipes/meal ideas?",
  "data/reddit-ask/r/AskWomen/comments/ls5qxb/avid_readers_how_do_you_make_reading_a_priority.json": "Avid readers, how do you make reading a priority in your busy life?",
  "data/reddit-ask/r/AskWomen/comments/ls6ju1/do_you_weigh_yourself_regularly_and_how_does_the.json": "Do you weigh yourself regularly, and how does the number on the scale affect your mood?",
  "data/reddit-ask/r/AskWomen/comments/lsaai8/what_are_some_common_toxic_traits_or_habits_most.json": "What are some common toxic traits or habits most people don’t realize they have or do?",
  "data/reddit-ask/r/AskWomen/comments/lsj8v5/how_do_you_learn_how_to_deal_with_your_peers.json": "How do you learn how to deal with your peers doing better than you? Career, relationships, etc.",
  "data/reddit-ask/r/AskWomen/comments/lsk2zu/women_of_reddit_who_are_in_their_late_twenties_or.json": "Women of reddit who are in their late twenties or thirties but don't yet feel grown up, what would have to change in your life (or how you live) in order for you to begin feeling like an \"adult\" in how you think of yourself?",
  "data/reddit-ask/r/AskWomen/comments/lskyu2/for_those_of_you_who_moved_back_in_with_your.json": "For those of you who moved back in with your parents after living on your own, how did it go? If you have a parent that’s manipulative, controlling or can’t admit to being wrong as well, how did you deal with that?",
  "data/reddit-ask/r/AskWomen/comments/lspqaf/anyone_who_found_themselves_completely_friendless.json": "Anyone who found themselves completely friendless as an adult, how did you deal with this and/or overcome this?",
  "data/reddit-ask/r/AskWomen/comments/lsyhv2/why_is_that_one_friend_terrible_with_dating.json": "Why is that one friend terrible with dating?",
  "data/reddit-ask/r/AskWomen/comments/lt5dk3/what_fake_thing_that_happens_in_movies_pisses_you.json": "What \"fake\" thing that happens in movies pisses you off?",
  "data/reddit-ask/r/AskWomen/comments/lt6ved/what_are_your_biggest_dating_regrets_from_your_20s.json": "What are your biggest dating regrets from your 20s?",
  "data/reddit-ask/r/AskWomen/comments/ltjaad/women_in_late_thirties_fourties_fifties_what_do.json": "Women in late thirties / fourties / fifties... what do you wish you knew about entering your thirties ?",
  "data/reddit-ask/r/AskWomen/comments/ltnhu1/elderly_women_and_those_who_know_about_elderly.json": "Elderly women (and those who know about elderly women's experience), how did you handle periods and body hair back in time of your youth?",
  "data/reddit-ask/r/AskWomen/comments/ltp0wc/women_who_used_to_be_insecure_with_weak.json": "Women who used to be insecure with weak personalities, how did you overcome your insecurities to become a strong woman?",
  "data/reddit-ask/r/AskWomen/comments/lu4127/what_products_do_you_like_to_use_that_were.json": "What products do you like to use that were intended for men?",
  "data/reddit-ask/r/AskWomen/comments/lu7tw7/women_who_are_at_a_better_but_lonelier_place_what.json": "Women who are at a better but lonelier place— what do you do when unwanted thoughts and feelings from imagining what you could have had in previous toxic relationships, friendships, and situations invade your mind?",
  "data/reddit-ask/r/Ask_Politics/comments/l9huof/why_do_trump_supporters_think_mike_pence_and.json": "Why do Trump supporters think Mike Pence and William Barr betrayed Trump?",
  "data/reddit-ask/r/Ask_Politics/comments/la8tge/why_has_the_2000_dollar_relief_check_been_held_up.json": "Why has the 2000 dollar relief check been held up?",
  "data/reddit-ask/r/Ask_Politics/comments/lay87q/whats_the_best_way_to_keep_informed_during_the.json": "What’s the best way to keep informed during the Biden Presidency?",
  "data/reddit-ask/r/Ask_Politics/comments/lbrlgl/if_the_federal_minimum_wage_were_raised_to_15_or.json": "If the federal minimum wage were raised to $15 or anything else, who would it directly apply to and who wouldn't it apply to? Also, could individual states still set their own minimum wage higher or lower than the federal one if they wanted to?",
  "data/reddit-ask/r/Ask_Politics/comments/lcggwy/has_the_republican_party_irreconcilably.json": "Has the Republican party irreconcilably splintered into conservative and “Q-anon”?",
  "data/reddit-ask/r/Ask_Politics/comments/ldjhx3/what_else_does_bidens_stimulus_package_have_to_go.json": "What else does Biden's stimulus package have to go through until it's passed?",
  "data/reddit-ask/r/Ask_Politics/comments/le2jv2/has_a_vp_ever_vote_against_a_president_in_a.json": "Has a VP ever vote against a president in a tie-breaking vote in the Senate?",
  "data/reddit-ask/r/Ask_Politics/comments/lfe7ov/how_can_we_explain_our_collective_pessimism_on.json": "How can we explain our collective pessimism on the functionality of our democracy, and what does it mean for us moving forward?",
  "data/reddit-ask/r/Ask_Politics/comments/lgltsy/why_isnt_the_entire_world_or_even_a_few_countries.json": "Why isn’t the entire world, or even a few countries outraged by the Uighur Concentration camps in China?",
  "data/reddit-ask/r/Ask_Politics/comments/libpxn/if_a_state_loses_electoral_votes_when_the.json": "If a state loses Electoral Votes when the population decreases does it also lose representatives?",
  "data/reddit-ask/r/Ask_Politics/comments/lj0v6d/how_did_democratic_party_manage_to_retain_the.json": "How did Democratic party manage to retain the majority in the house for so long from 1930's until mid- 90's?",
  "data/reddit-ask/r/Ask_Politics/comments/lk0kui/what_does_biden_mean_by_banning_assault_weapons.json": "What does Biden mean by banning assault weapons?",
  "data/reddit-ask/r/Ask_Politics/comments/lkn6sf/how_has_us_student_debt_improved_since_2010_when.json": "How has US student debt improved since 2010 when the government took over student loans?",
  "data/reddit-ask/r/Ask_Politics/comments/ll1ulb/why_hasnt_the_uk_fallen_into_a_2_party_system.json": "Why hasn't the UK fallen into a 2 party system (like the US) even though they both use FPTP?",
  "data/reddit-ask/r/Ask_Politics/comments/lm3mjg/what_federal_mandates_did_texas_avoid_by_refusing.json": "What Federal Mandates did Texas Avoid by refusing to connect ERCOT to the rest of the national electrical grid?",
  "data/reddit-ask/r/Ask_Politics/comments/ln1pex/ted_cruz_has_recently_been_scrutinized_for.json": "Ted Cruz has recently been scrutinized for traveling to Mexico while the state of Texas is experiencing infrastructure issues due to snow storms. Is it deserved?",
  "data/reddit-ask/r/Ask_Politics/comments/lnpv1z/minimum_wage_debate_question_if_studies_say.json": "Minimum wage debate question: if studies say minimum wage should be set to about 60% of the median wage, would this be a self driving upward force on the median wage and thus on the minimum? Would it eventually even out?",
  "data/reddit-ask/r/Ask_Politics/comments/lot4hc/how_do_people_running_for_congressetc_just_know.json": "How do people running for Congress/etc just know how to start/organise a campaign and hire staff?",
  "data/reddit-ask/r/Ask_Politics/comments/lprtmp/is_a_15_minimum_wage_just_another_bandaid_for_a.json": "Is a 15$ minimum wage just another band-aid for a larger issue? Will it even fix the problems Americans face?",
  "data/reddit-ask/r/Ask_Politics/comments/lqjpjv/voting_question_how_would_the_united_states.json": "(Voting question) How would the United States defend against the worst kinds of populism (or extremism) if it got rid of the Electoral College?",
  "data/reddit-ask/r/Ask_Politics/comments/lsznrh/people_who_work_in_politics_what_do_you_wish_you.json": "People who work in Politics; what do you wish you knew before you joined that career",
  "data/reddit-ask/r/NoStupidQuestions/comments/l9wmpy/if_you_see_a_really_dumb_question_on_this.json": "If you see a really dumb question on this subreddit, do you upvote it or downvote it?",
  "data/reddit-ask/r/NoStupidQuestions/comments/l9yabh/is_it_common_to_finally_have_some_really.json": "Is it common to finally have some really interesting happen and decide to write about it on reddit, then as you excitedly compose the post in your mind and start realizing how fucking lame it actually is?",
  "data/reddit-ask/r/NoStupidQuestions/comments/la7568/do_yall_have_parents_who_think_youre_some_diy.json": "Do y'all have parents who think you're some DIY handyman, IT computer wizard when you really just google how to do stuff?",
  "data/reddit-ask/r/NoStupidQuestions/comments/lamk6i/do_people_not_see_the_same_posts_over_and_over_or.json": "Do people not see the same posts over and over or do I just browse reddit too often?",
  "data/reddit-ask/r/NoStupidQuestions/comments/lar777/why_arent_unsolicited_nudes_treated_the_same_as.json": "Why aren’t unsolicited nudes treated the same as flashers?",
  "data/reddit-ask/r/NoStupidQuestions/comments/lb15ax/is_anyone_else_stuck_in_a_place_where_you_dont.json": "Is anyone else stuck in a place where you don't have any goals, ambitions and passions?",
  "data/reddit-ask/r/NoStupidQuestions/comments/lb2byy/would_you_watch_a_tv_show_where_rich_people_have.json": "Would you watch a TV show where rich people have to live on $15/hr?",
  "data/reddit-ask/r/NoStupidQuestions/comments/lb4818/does_anyone_else_have_an_irrational_fear_of.json": "Does anyone else have an irrational fear of answering the phone?",
  "data/reddit-ask/r/NoStupidQuestions/comments/lb9b1t/does_anyone_else_always_add_reddit_at_the_end.json": "Does anyone else always add \"Reddit\" at the end when Googling stuff because you get good answers?",
  "data/reddit-ask/r/NoStupidQuestions/comments/lbknyx/is_there_a_subreddit_or_a_post_that_lists_serial.json": "Is there a subreddit or a post that lists serial reposters so regular users can block them for a better Reddit feed?",
  "data/reddit-ask/r/NoStupidQuestions/comments/lbrldn/is_it_bad_that_i_dont_really_care_when_lgbtq.json": "Is it bad that I don't really care when LGBTQ+ people are coming out?",
  "data/reddit-ask/r/NoStupidQuestions/comments/lbwlqw/why_do_american_shows_always_show_mexico_with_a.json": "Why do American shows always show mexico with a yellow tint?",
  "data/reddit-ask/r/NoStupidQuestions/comments/lca1hf/am_i_the_only_person_that_really_struggles_to.json": "Am I the only person that really struggles to recognize the fact that everyone who is alive and who has ever lived is experiencing this world the same way I am?",
  "data/reddit-ask/r/NoStupidQuestions/comments/lcdi2c/does_anyone_else_order_or_purchase_too_much_food.json": "Does anyone else order or purchase too much food out of fear of not having enough and feeling satisfied and then regularly storing it for a “second meal” because you couldn’t eat it all?",
  "data/reddit-ask/r/NoStupidQuestions/comments/lcheph/cops_run_away_the_moment_i_report_them_on_waze.json": "Cops run away the moment I report them on waze. Why do they do that?",
  "data/reddit-ask/r/NoStupidQuestions/comments/lcwsjp/does_anyone_else_when_reading_a_book_think_about.json": "Does anyone else when reading a book think about something but keep on reading just to realise that you didn't remember anything you read?",
  "data/reddit-ask/r/NoStupidQuestions/comments/ld6n4e/what_does_a_ceo_actually_do_on_a_daytoday_basis.json": "What does a CEO actually do on a day-to-day basis?",
  "data/reddit-ask/r/NoStupidQuestions/comments/ld7l64/is_it_actually_okay_for_me_to_be_gay.json": "Is it actually okay for me to be gay?",
  "data/reddit-ask/r/NoStupidQuestions/comments/ldbgql/why_are_there_no_native_american_restaurants.json": "Why are there no Native American restaurants?",
  "data/reddit-ask/r/NoStupidQuestions/comments/ldf2v3/if_someone_ghosts_you_are_they_the_ghost_because.json": "If someone Ghosts you, are they the ghost because they disappeared, or are you the ghost, because they treat you like you're invisible?",
  "data/reddit-ask/r/NoStupidQuestions/comments/ldgwd1/my_idiot_boyfriend_spent_my_college_fund_on_dog.json": "My idiot boyfriend spent my college fund on dog coins how do I get it back???",
  "data/reddit-ask/r/NoStupidQuestions/comments/ldrk7r/why_do_savoury_aromas_sharp_cheese_garlic_etc.json": "Why do savoury aromas (sharp cheese, garlic, etc.) only smell good in the context of food, but sweet aromas (fruit, vanilla, etc.) smell pleasant in any context?",
  "data/reddit-ask/r/NoStupidQuestions/comments/ldrl95/are_there_anti_allergies_where_people_can_eat.json": "Are there \"anti allergies\" where people can eat food that is normally considered toxic to humans?",
  "data/reddit-ask/r/NoStupidQuestions/comments/ldwj9j/is_this_recipe_telling_me_to_use_1lb_of_ground.json": "Is this recipe telling me to use 1lb of ground beef or 1 and a half pounds?",
  "data/reddit-ask/r/NoStupidQuestions/comments/ldxbq4/is_it_ok_for_men_to_sit_down_on_the_toilet_to_pee.json": "Is it ok for men to sit down on the toilet to pee?",
  "data/reddit-ask/r/NoStupidQuestions/comments/ldxvs0/why_are_there_so_many_different_forms_of_screw.json": "Why are there so many different forms of screw driver heads (slotted, philips, torx etc.)? If one is better than the others, why can't we find the optimal one and fit all screws with that type?",
  "data/reddit-ask/r/NoStupidQuestions/comments/le7k5j/did_reddits_algorithm_get_changed_or_something.json": "Did reddit's algorithm get changed or something?",
  "data/reddit-ask/r/NoStupidQuestions/comments/le8u87/why_dont_men_use_toilet_paper_to_dab_their.json": "Why don’t men use toilet paper to dab their penises after they pee.",
  "data/reddit-ask/r/NoStupidQuestions/comments/le91il/why_is_privacy_not_considered_in_mens_restrooms.json": "Why is privacy not considered in men's restrooms?",
  "data/reddit-ask/r/NoStupidQuestions/comments/leegqr/how_is_it_even_possible_for_people_to_work_60_or.json": "How is it even possible for people to work 60 or 70 hour weeks?",
  "data/reddit-ask/r/NoStupidQuestions/comments/lehjj1/nsfw_does_anal_sex_feel_like_when_you_take_a_nice.json": "NSFW- Does anal sex feel like when you take a nice big poop?",
  "data/reddit-ask/r/NoStupidQuestions/comments/leire6/i_am_having_horrible_nightmares_about_panthers.json": "I am having horrible nightmares about panthers, either they kill me or someone i know, and it is terrifying. Please tell me how can i beat a panther in 1v1 battle with no tools",
  "data/reddit-ask/r/NoStupidQuestions/comments/lf163x/who_else_doesnt_care_about_the_super_bowl.json": "Who else doesn't care about the Super Bowl?",
  "data/reddit-ask/r/NoStupidQuestions/comments/lfejt2/is_it_normal_as_a_guy_to_be_absolutely_unable_to.json": "Is it normal as a guy to be absolutely unable to withstand sad things? Like hurt or hungry animals, poor children (poverty in general wrecks my heart). I don't mean like it just makes me sad or cry, I mean I have to actively block such subjects from my mind and avoid them cause it hurts.",
  "data/reddit-ask/r/NoStupidQuestions/comments/lffjjs/if_you_sit_on_your_own_voodoo_doll_can_you_ever.json": "If you sit on your own voodoo doll, can you ever get up again?",
  "data/reddit-ask/r/NoStupidQuestions/comments/lfv5ut/how_the_fuck_can_every_book_be_best_selling.json": "How the fuck can every book be best selling?",
  "data/reddit-ask/r/NoStupidQuestions/comments/lg20ul/is_there_a_reason_captcha_tests_are_so_american.json": "Is there a reason CAPTCHA tests are so American?",
  "data/reddit-ask/r/NoStupidQuestions/comments/lg2lgx/do_headphones_with_active_noise_cancelling_help.json": "Do headphones with active noise cancelling help protect your ears from loud noises or make it worse because they're also playing the negative sound? I'm assuming that double the sound waves means double the risk",
  "data/reddit-ask/r/NoStupidQuestions/comments/lg5fnq/why_on_gods_green_earth_do_job_listings_not_list.json": "Why on God’s green earth do job listings not list the salary? Why are we still pretending like the only reason any of us work isn’t for money?",
  "data/reddit-ask/r/NoStupidQuestions/comments/lghrxz/if_i_discovered_a_new_species_of_whatever_could_i.json": "If I discovered a new species of whatever, could I put profanity in its name?",
  "data/reddit-ask/r/NoStupidQuestions/comments/lginwc/how_often_do_you_type_out_a_response_to_a_reddit.json": "How often do you type out a response to a Reddit question or comments, stare at it for a minute, then delete it and leave the thread?",
  "data/reddit-ask/r/NoStupidQuestions/comments/lgkj39/anyone_else_wear_socks_with_their_house_slippers.json": "Anyone else wear socks with their house slippers so they don’t end up smelling like King Kong’s nutsac in 2 weeks?",
  "data/reddit-ask/r/NoStupidQuestions/comments/lgrolj/have_you_ever_read_a_does_anyone_else_question.json": "Have you ever read a \"Does anyone else....\" question and think; wow, this person might be the only one?",
  "data/reddit-ask/r/NoStupidQuestions/comments/lgrwfq/how_can_hackers_try_thousands_of_passwords_when.json": "How can hackers try thousands of passwords when trying to hack something, but my account gets locked after 5 tries when I do it?",
  "data/reddit-ask/r/NoStupidQuestions/comments/lgtpee/are_there_any_recipe_sites_that_dont_give_you_an.json": "Are there any recipe sites that don't give you an aneurism?",
  "data/reddit-ask/r/NoStupidQuestions/comments/lgv7yp/is_it_racist_to_want_white_friends.json": "Is it racist to want white friends",
  "data/reddit-ask/r/NoStupidQuestions/comments/lgw9cu/if_marijuana_is_illegal_in_texas_and_even.json": "If marijuana is illegal in Texas and even possessing a single joint can get you 180 days why is Joe Rogan openly smoking marijuana on his podcast and why hasn't he been arrested yet?",
  "data/reddit-ask/r/NoStupidQuestions/comments/lh2j35/does_being_blind_eliminate_a_fear_of_heights_can.json": "Does being blind eliminate a fear of heights? Can blind people perceive heights in any way?",
  "data/reddit-ask/r/NoStupidQuestions/comments/lhaojp/is_it_just_me_or_are_the_number_of_youtube_ads.json": "Is it just me or are the number of YouTube ads becoming much more frequent?",
  "data/reddit-ask/r/NoStupidQuestions/comments/lhhdcv/if_elephants_went_extinct_along_with_the.json": "If elephants went extinct along with the dinosaurs, would we have known about their trunks?",
  "data/reddit-ask/r/NoStupidQuestions/comments/lhicpr/is_it_offensive_to_give_the_homeless_food.json": "Is it offensive to give the homeless food?",
  "data/reddit-ask/r/NoStupidQuestions/comments/lhjvo9/in_america_do_you_have_to_pay_for_police_services.json": "In America, do you have to pay for police services? For example, if you're the parent of a missing child and the police are conducting the search?",
  "data/reddit-ask/r/NoStupidQuestions/comments/li045v/can_i_take_control_of_a_small_country_and_then.json": "Can I take control of a small country, and then rename it to a name of a country that already exists?",
  "data/reddit-ask/r/NoStupidQuestions/comments/li1zn3/people_who_live_where_there_are_foxes_do_they.json": "People who live where there are foxes, do they just cruise around like stray dogs? Are they aggressive? Do you feed them?",
  "data/reddit-ask/r/NoStupidQuestions/comments/li4o8m/if_im_allergic_to_cats_am_i_also_allergic_to.json": "If I'm allergic to cats, am I also allergic to Lions, Tigers, Cougars, Jaguars, and other big cats?",
  "data/reddit-ask/r/NoStupidQuestions/comments/liau4s/why_are_dead_people_always_seen_as_good_people.json": "Why are dead people always seen as good people?",
  "data/reddit-ask/r/NoStupidQuestions/comments/libht9/why_are_humans_innately_funny.json": "Why are humans innately funny?",
  "data/reddit-ask/r/NoStupidQuestions/comments/liebjj/why_do_people_struggle_when_they_are_being_put.json": "Why do people struggle when they are being put into a police car? cuz they think the officers are just going to say \"this is too much aggravation right now You go free\"?",
  "data/reddit-ask/r/NoStupidQuestions/comments/ligjm2/why_is_it_gross_for_women_to_have_body_hair.json": "Why is it “gross” for women to have body hair despite the fact that every adult woman's body naturally grows hair (only prepubescent girls don't have body hair yet), but when a guy has hair on his body and armpits it's okay?",
  "data/reddit-ask/r/NoStupidQuestions/comments/liie80/how_do_food_companies_add_iron_to_their_healthy.json": "How do food companies add iron to their healthy products? Do they just grind up the raw metal and throw them into our food?",
  "data/reddit-ask/r/NoStupidQuestions/comments/liihzr/anyone_else_get_extremely_realistic_dreams_and.json": "Anyone else get extremely realistic dreams and confuse them with reality?",
  "data/reddit-ask/r/NoStupidQuestions/comments/lijf1q/why_cant_i_watch_anything_slightly_awkward_on_the.json": "Why can’t I watch anything slightly awkward on the TV?",
  "data/reddit-ask/r/NoStupidQuestions/comments/linn4f/how_do_you_set_your_life_goals.json": "How do you set your life goals?",
  "data/reddit-ask/r/NoStupidQuestions/comments/liqf25/how_did_misogyny_and_sexism_in_several_cultures.json": "How did misogyny and sexism in several cultures around the world even develop when everyone had to have come out of a woman and mostly be raised by them. If anything shouldn't women be the ones with the say and power?",
  "data/reddit-ask/r/NoStupidQuestions/comments/lir9lp/do_people_really_not_refer_to_their_partners_by.json": "Do people really not refer to their partners by their first name?",
  "data/reddit-ask/r/NoStupidQuestions/comments/lirpiv/is_cake_day_just_a_karma_bait_or_are_there_actual.json": "Is cake day just a karma bait or are there actual benefits?",
  "data/reddit-ask/r/NoStupidQuestions/comments/lisbf3/is_sand_called_sand_because_its_between_sea_and.json": "Is sand called sand because it's between sea and land?",
  "data/reddit-ask/r/NoStupidQuestions/comments/lizvea/why_is_it_so_hard_for_older_generations_to.json": "Why is it so hard for older generations to understand that depression is real?",
  "data/reddit-ask/r/NoStupidQuestions/comments/lj18y8/what_is_this_karma_stuff.json": "What is this karma stuff?",
  "data/reddit-ask/r/NoStupidQuestions/comments/lj1haa/40_year_old_iraq_war_veteran_here_anybody_wanna.json": "40 year old Iraq War Veteran here. Anybody wanna help keep my mind busy?",
  "data/reddit-ask/r/NoStupidQuestions/comments/lj4l9f/do_butchers_ever_find_tumors_when_processing_meat.json": "Do butchers ever find tumors when processing meat? And if so, do they just throw it out?",
  "data/reddit-ask/r/NoStupidQuestions/comments/lj6blq/if_you_donate_an_organ_but_the_receiver_dies_in.json": "If you donate an organ but the receiver dies in an unrelated way, are you allowed/entitled to getting your organs back?",
  "data/reddit-ask/r/NoStupidQuestions/comments/lj6ruy/how_do_i_pet_my_cat_without_zapping_it.json": "How do I pet my cat without zapping it?",
  "data/reddit-ask/r/NoStupidQuestions/comments/lj7o1b/is_it_weird_to_ask_for_a_female_therapist_over_a.json": "Is it weird to ask for a female therapist over a male one?",
  "data/reddit-ask/r/NoStupidQuestions/comments/lj9gno/does_anyone_else_like_learning_new_things_not.json": "Does anyone else like learning new things, not because you need to, but because it's a good way to fill the void in your life?",
  "data/reddit-ask/r/NoStupidQuestions/comments/ljmteo/do_turtles_sometimes_knock_the_back_of_their.json": "Do turtles sometimes knock the back of their heads against their shells and think, “dammit”?",
  "data/reddit-ask/r/NoStupidQuestions/comments/ljo6li/why_was_i_taught_cursive_in_school_in_the_late.json": "Why was I taught cursive in school in the late 90s when I've never actually used it in my life outside of elementary school and writing my own signature? In fact, I don't know anyone who writes in cursive.",
  "data/reddit-ask/r/NoStupidQuestions/comments/ljulc4/why_do_phones_let_you_switch_between_autorotate.json": "Why do phones let you switch between auto-rotate and no-rotate but not manual-rotate?",
  "data/reddit-ask/r/NoStupidQuestions/comments/ljymnc/when_somebody_is_admitted_to_hospital_unconscious.json": "When somebody is admitted to hospital unconscious or has to be put into a medically induced coma, do staff check if they’re wearing contact lenses/tampon or something else that could cause damage if left in the body for too long?",
  "data/reddit-ask/r/NoStupidQuestions/comments/lk6eyt/what_the_fuck_does_it_mean_when_a_sign_says_speed.json": "What the fuck does it mean when a sign says “speed enforced by aircraft”?",
  "data/reddit-ask/r/NoStupidQuestions/comments/lk7jvd/anybody_else_ever_watch_cooking_videos_despite.json": "Anybody else ever watch cooking videos despite knowing fully well you'll probably never even attempt to make the recipes or utterly lack the skill necessary to prepare it.",
  "data/reddit-ask/r/NoStupidQuestions/comments/lkgh08/are_americans_the_bad_guys_in_russian_movies.json": "Are Americans the bad guys in Russian movies?",
  "data/reddit-ask/r/NoStupidQuestions/comments/lkn5h7/if_its_illegal_to_do_false_advertising_why_are.json": "If it’s illegal to do false advertising, why are politicians allowed to make false claims on the campaign trail?",
  "data/reddit-ask/r/NoStupidQuestions/comments/lkpypg/people_say_things_like_mandatory_im_on_mobile.json": "People say things like \"Mandatory, I'm on mobile, sorry for formatting\" yet I've browsed Reddit both on a lap top and mobile and do not see any difference. What am I missing?",
  "data/reddit-ask/r/NoStupidQuestions/comments/ll53n6/has_else_actually_enjoyed_wearing_masks_in_the.json": "Has else actually enjoyed wearing masks in the cold winter?",
  "data/reddit-ask/r/NoStupidQuestions/comments/ll7boc/why_is_there_so_much_nuance_for_ethnic_identities.json": "Why is there so much nuance for ethnic identities on forms, such as 'South Asian', 'Middle Eastern', 'African', 'Black', 'Caribbean', but there's only 'White' for people with white skin?",
  "data/reddit-ask/r/NoStupidQuestions/comments/ll8ohc/why_is_there_such_a_stigma_against_single_people.json": "Why is there such a stigma against single people?",
  "data/reddit-ask/r/NoStupidQuestions/comments/lljkr8/why_is_prostitution_illegallike_adults_can_have.json": "Why is prostitution illegal?Like adults can have sex,and they also can give as much money as they want to whoever they want,at any time.Yet in majority of worlds countries doing this at the same time is a crime.Why?",
  "data/reddit-ask/r/NoStupidQuestions/comments/llobt4/if_an_undercover_agent_works_a_job_that_requires.json": "If an undercover agent works a job that requires them to be “employed” somewhere that would pay them, do they get their agent pay as well as the pay of the place they are “working” at, or would that extra money be donated?",
  "data/reddit-ask/r/NoStupidQuestions/comments/llq271/yall_ever_punch_the_shower_curtain_at_2_am_just.json": "Y'all ever punch the shower curtain at 2 a.m. \"just to be sure\"?",
  "data/reddit-ask/r/NoStupidQuestions/comments/llqbfv/ive_sucked_my_own_dick_and_have_been_having_back.json": "I've sucked my own dick and have been having back pain since and want to visit a chiropractor but I'm afraid of being embarrassed if I say the reason of my back pains, what do I say if I visit one?",
  "data/reddit-ask/r/NoStupidQuestions/comments/llqxwj/stupid_question_how_screwed_is_this_ant_after_i.json": "Stupid question: How screwed is this ant after I accidentally moved it 30 miles away?",
  "data/reddit-ask/r/NoStupidQuestions/comments/lm3ygz/when_i_went_to_america_i_was_shocked_at_the.json": "When I went to America, I was shocked at the portion sizes and ended up sharing one main course between two people. Do people from the US come to England and leave restaurants hungry because the portions are tiny compared to what they are used to?",
  "data/reddit-ask/r/NoStupidQuestions/comments/lm4w2n/why_dont_our_hearts_get_tired.json": "Why don't our hearts get tired?",
  "data/reddit-ask/r/NoStupidQuestions/comments/lm731r/do_the_dominoes_pizza_workers_really_get_the.json": "Do the dominoes pizza workers really get the words of encouragement I give them via online tracker screen or am I just wasting my time sending them?",
  "data/reddit-ask/r/NoStupidQuestions/comments/lmk7ln/do_blind_people_ever_turn_the_lights_on_at_home.json": "Do blind people ever turn the lights on at home or do they walk around in the dark?",
  "data/reddit-ask/r/NoStupidQuestions/comments/lmmlwu/amazon_deliverers_of_reddit_does_amazon_actually.json": "Amazon deliverers of Reddit: does Amazon actually do anything with the feedback/compliments you're invited to leave after a package is delivered, and if so which is the most helpful/positive ones customers can select?",
  "data/reddit-ask/r/NoStupidQuestions/comments/lmmtub/why_does_everyone_forget_that_at_the_end_of.json": "Why does everyone forget that at the end of \"Grease\" they fly away into the sun in a car.",
  "data/reddit-ask/r/NoStupidQuestions/comments/lmpfuk/do_any_of_you_sometimes_travel_to_different.json": "Do any of you sometimes \"travel\" to different exotic locations in Google Maps and look around in street view, wishing you could just be teleported there for a few hours?",
  "data/reddit-ask/r/NoStupidQuestions/comments/lmps6q/if_the_judge_asks_do_you_swear_to_tell_the_truth.json": "If the judge asks, \"Do you swear to tell the truth, the whole truth, and nothing but the truth\" and you say yes, how does the judge know that wasn't a lie.",
  "data/reddit-ask/r/NoStupidQuestions/comments/lnd6po/why_do_americans_clubs_have_people_in_the_toilet.json": "Why do Americans clubs have people in the toilet who ‘help’ me wash my hands?",
  "data/reddit-ask/r/NoStupidQuestions/comments/lnr0m9/conservative_dad_is_checking_my_internet_history.json": "Conservative Dad is checking my internet history.",
  "data/reddit-ask/r/NoStupidQuestions/comments/lnsbhk/trying_to_understand_non_binary.json": "Trying to understand 'Non binary'",
  "data/reddit-ask/r/NoStupidQuestions/comments/lntrig/why_are_chihuahuas_always_vibrating_like_theyre.json": "Why are Chihuahuas always vibrating like they’re about to explode?",
  "data/reddit-ask/r/NoStupidQuestions/comments/lnudzo/my_boyfriend_passed_away_in_2014_february_13th_is.json": "My boyfriend passed away in 2014 (February 13th). is it normal i still feel really upset about it and I've been thinking of him a lot lately?",
  "data/reddit-ask/r/NoStupidQuestions/comments/lnz5jd/anyone_else_feel_suffocated_by_the_repetitiveness.json": "Anyone Else Feel Suffocated by the Repetitiveness of Every Fucking Day?",
  "data/reddit-ask/r/NoStupidQuestions/comments/lo5e69/does_anyone_else_when_reading_a_book_not_actually.json": "Does anyone else when reading a book not actually read the characters names and just kind of skip over them and know that that combination of letters is that guy.",
  "data/reddit-ask/r/NoStupidQuestions/comments/lo9uxn/is_there_a_place_to_learn_social_skills_for.json": "Is there a place to learn social skills for people who have anxiety autism or who were abused or had other problems?",
  "data/reddit-ask/r/NoStupidQuestions/comments/lobmkq/if_i_shit_is_the_turd_my_property.json": "If I shit, is the turd my property?",
  "data/reddit-ask/r/NoStupidQuestions/comments/log15z/how_long_could_a_human_live_off_of_cucumber_only.json": "How long could a human live off of cucumber only?",
  "data/reddit-ask/r/NoStupidQuestions/comments/lol8ur/is_it_sad_that_my_dream_job_is_something_that.json": "Is it sad that my dream job is something that doesn’t require a college degree or any type of education beyond high school?",
  "data/reddit-ask/r/NoStupidQuestions/comments/lop0bx/is_it_too_late_for_me_i_will_turn_40_this_year_my.json": "Is it too late for me? I will turn 40 this year. My dad died at 53 of a heart attack. I'm in much worse shape than he was at my age. I'm obese, I've been sedentary, my diet has been the worst. If I were to start now, can I reverse damage done, and live longer? Or is it truly too late?",
  "data/reddit-ask/r/NoStupidQuestions/comments/lop7ju/why_is_walking_upstairs_from_a_dark_basement.json": "Why is walking upstairs from a dark basement scary even though we know for a fact nothing is behind us?",
  "data/reddit-ask/r/NoStupidQuestions/comments/low7vu/i_have_autism_and_tiny_changes_or_adjustments_in.json": "I have autism and tiny changes or adjustments in things or life can really upset me or make me feel very uncomfortable, even if the changes are not bad and I'm starting to feel like it's forcing me to live life like a broken record.. does anybody have any ideas or advice to help with this mind set",
  "data/reddit-ask/r/NoStupidQuestions/comments/loyxz4/why_is_everyone_depressed.json": "Why is everyone depressed?",
  "data/reddit-ask/r/NoStupidQuestions/comments/lozyy1/why_are_eggs_white_in_america_i_live_in_ireland.json": "Why are eggs white in America? I live in Ireland and all my life the only eggs I have ever seen are a kind of sandy brown colour but in any films I've ever seen eggs in America are white??",
  "data/reddit-ask/r/NoStupidQuestions/comments/lp3pnw/is_it_just_me_or_does_every_printer_i_ever_buy.json": "Is it just me or does every printer I ever buy, including expensive ones, just flat out suck?",
  "data/reddit-ask/r/NoStupidQuestions/comments/lp4ejm/why_is_terraforming_mars_such_a_topical_agenda.json": "Why is terraforming Mars such a topical agenda with agencies and companies spending vast amounts of money on research and development to achieve it, instead of using the same resources to improve the planet we already have?",
  "data/reddit-ask/r/NoStupidQuestions/comments/lpfhn8/if_two_people_who_spoke_a_different_language_were.json": "If two people who spoke a different language were stuck on an island with each for two years, would they eventually learn each other's language?",
  "data/reddit-ask/r/NoStupidQuestions/comments/lphvw6/why_do_people_buy_sports_video_games_when_they.json": "Why do people buy sports video games when they are literally the exact same every year?",
  "data/reddit-ask/r/NoStupidQuestions/comments/lpkx8k/what_kind_of_feminine_hygiene_products_should_i.json": "What kind of feminine hygiene products should I keep on hand?",
  "data/reddit-ask/r/NoStupidQuestions/comments/lplszz/will_prince_phillip_get_a_special_card_from_the.json": "Will Prince Phillip get a special card from the queen when he turns 100?",
  "data/reddit-ask/r/NoStupidQuestions/comments/lpypvj/does_everyone_on_reddit_assume_everyone_is_male.json": "Does everyone on Reddit assume everyone is male?",
  "data/reddit-ask/r/NoStupidQuestions/comments/lq1nes/is_the_upvote_arrow_orange_or_red.json": "Is the upvote arrow orange or red?",
  "data/reddit-ask/r/NoStupidQuestions/comments/lqfvhv/ive_just_been_made_homeless_at_18_are_there_any.json": "I've just been made homeless at 18, are there any tips or tricks to help me survive on what little income I have?",
  "data/reddit-ask/r/NoStupidQuestions/comments/lqg3b7/is_it_normal_to_be_afraid_of_living_only_a.json": "Is it normal to be afraid of living only a ordinary, basic, plain, common life ?",
  "data/reddit-ask/r/NoStupidQuestions/comments/lqim9e/after_watching_a_movie_does_anybody_else_head.json": "After watching a movie, does anybody else head over to wikipedia and read the plot all the way through to make sure they understood everything correctly?",
  "data/reddit-ask/r/NoStupidQuestions/comments/lqttmr/who_else_wants_this_to_end_but_doesnt_want_to_go.json": "Who else wants this to end, but doesn't want to go back to work?",
  "data/reddit-ask/r/NoStupidQuestions/comments/lqz0f8/are_black_people_in_canada_called_african.json": "Are black people in Canada called African Canadians?",
  "data/reddit-ask/r/NoStupidQuestions/comments/lr9ybm/do_people_on_reddit_normally_upvote_everything.json": "Do people on reddit normally upvote everything they like while they're browsing?",
  "data/reddit-ask/r/NoStupidQuestions/comments/lrcpuc/do_the_names_of_chinese_restaurants_usually.json": "Do the names of Chinese restaurants usually translate or are they just Oriental sounding buzz words?",
  "data/reddit-ask/r/NoStupidQuestions/comments/lrgtek/why_is_american_niceness_often_considered_fake.json": "Why is American niceness often considered \"fake\" but Canadian niceness is just considered nice by Europeans?",
  "data/reddit-ask/r/NoStupidQuestions/comments/ls0nwi/does_anyone_else_entertain_themselves_by.json": "Does anyone else entertain themselves by scrolling down to downvoted comments and reading the drama?",
  "data/reddit-ask/r/NoStupidQuestions/comments/ls9o02/does_anyone_else_find_themselves_randomly_cupping.json": "Does anyone else find themselves randomly cupping their balls while relaxing?",
  "data/reddit-ask/r/NoStupidQuestions/comments/lsdvd6/why_some_people_like_me_make_stupid_bets_with.json": "Why some people (like me) make stupid bets with themselves? (Like, if a car don't turn this street corner on 5 seconds i'll die [even though I won't], or if I don't hold my breath until that teacher stop laughing I'll need to slap myself 3 times)?",
  "data/reddit-ask/r/NoStupidQuestions/comments/lsi9cv/does_anyone_else_use_reddit_as_their_small_beacon.json": "Does anyone else use Reddit as their small beacon of light?",
  "data/reddit-ask/r/NoStupidQuestions/comments/lsjsbf/do_protection_dogs_who_have_to_bite_people_in.json": "Do protection dogs, who have to bite people in bite suits, end up hating fat people?",
  "data/reddit-ask/r/NoStupidQuestions/comments/lsxgo9/why_does_youtube_allow_blatant_scams_to_advertise.json": "Why does YouTube allow blatant scams to advertise on their platform? Why are there no US or EU laws which force YouTube to regulate their ads?",
  "data/reddit-ask/r/NoStupidQuestions/comments/lsyzfi/my_friends_told_me_that_im_transphobicbut_am_i.json": "My friends told me that I'm transphobic...but am I?",
  "data/reddit-ask/r/NoStupidQuestions/comments/lt1r3s/how_do_i_block_rnextfuckinglevel.json": "How do I block r/nextfuckinglevel?",
  "data/reddit-ask/r/NoStupidQuestions/comments/lt7m17/what_does_the_bacon_industry_have_against.json": "What does the bacon industry have against re-sealable packaging?",
  "data/reddit-ask/r/NoStupidQuestions/comments/ltbe57/youtube_has_more_ads_recently_right.json": "YouTube has more ads recently, right?",
  "data/reddit-ask/r/NoStupidQuestions/comments/ltcl6r/can_you_slow_blink_to_a_lion_to_tell_it_you_want.json": "Can you slow blink to a lion to tell it you want to be friends like you can with a cat?",
  "data/reddit-ask/r/NoStupidQuestions/comments/ltf1t7/while_watching_breaking_bad_i_found_myself_asking.json": "While watching Breaking Bad, I found myself asking something: Why is the purity of meth such a big deal to in the show? Do people using it in real life actually care about that?",
  "data/reddit-ask/r/NoStupidQuestions/comments/lthcnk/why_do_they_call_the_mafia_organized_crime_but.json": "Why do they call the mafia “organized crime” but other groups gangs?",
  "data/reddit-ask/r/NoStupidQuestions/comments/lthh76/does_anyone_else_get_in_those_moods_where.json": "Does anyone else get in those moods where everything seems dull and boring?",
  "data/reddit-ask/r/NoStupidQuestions/comments/ltieib/why_are_us_tuition_solutions_focused_on_family.json": "Why are US tuition solutions focused on family income when not all families pay for their child's college?",
  "data/reddit-ask/r/NoStupidQuestions/comments/lttk7v/does_anyone_else_ever_fantasize_magically.json": "Does anyone else ever fantasize magically disappearing and starting a fresh new life as a completely different person?",
  "data/reddit-ask/r/NoStupidQuestions/comments/ltv4u1/if_you_put_a_polar_bear_in_antarctica_would_it.json": "If you put a polar bear in Antarctica, would it know it doesn't belong there?",
  "data/reddit-ask/r/NoStupidQuestions/comments/lu36wb/my_parents_died_and_i_dont_know_what_to_do_what.json": "My parents died and I don't know what to do. What do I do?",
  "data/reddit-ask/r/NoStupidQuestions/comments/lucx82/why_is_the_reddit_search_bar_so_useless_seriously.json": "Why is the Reddit search bar so useless? Seriously though, I've never seen a worse search bar in my entire life. It's embarrassing for a site of the size of Reddit",
  "data/reddit-ask/r/TooAfraidToAsk/comments/l9vxza/is_it_bad_that_i_have_to_create_fake_scenarios_in.json": "Is it bad that I have to create fake scenarios in my head in order to fall asleep? These scenarios span a large amount of types, from romantic to sci fi \"stories\" I have to create",
  "data/reddit-ask/r/TooAfraidToAsk/comments/la0lxh/is_it_just_me_or_reddit_is_a_bit_racist_to_indians.json": "Is it just me, or reddit is a *bit* racist to Indians?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/labp6w/am_i_the_only_one_who_doesnt_give_my_reddit_to.json": "Am I the only one who doesn’t give my Reddit to other people, like friends and close people?! I use Reddit to participate in some personal discussions and ask questions I wouldn’t ask in person.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/lao6ax/does_anyone_else_get_anxious_about_people.json": "Does anyone else get anxious about people watching them do things? Like going on runs/exercising",
  "data/reddit-ask/r/TooAfraidToAsk/comments/laqy81/is_it_just_me_or_are_youtubers_incredibly.json": "Is it just me or are youtubers incredibly overrated?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/lax636/anybody_else_just_escaping_from_reality_and.json": "Anybody else just escaping from reality and Ignoring their problems as long as they can?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/lbouy7/does_anyone_else_get_that_deep_feeling_of_needing.json": "Does anyone else get that deep feeling of needing to go ‘home’ ?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/lca385/does_everyone_feel_like_life_was_better_when_they.json": "Does everyone feel like life was better when they were younger?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/lcdf0j/why_should_someone_keep_living_if_depression_can.json": "why should someone keep living if depression can not get better(treatment-resistant)? whats the point of keep suffuring? Of watching others' happiy life and his/her disabilty to have one?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/lcevjz/why_is_rain_portrayed_as_some_sort_of_negative_or.json": "Why is rain portrayed as some sort of negative or depressing effect in shows and cartoons?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/lct1o3/can_a_person_be_protrans_rights_while_still.json": "Can a person be pro-trans rights while still believing that trans women/girls should not compete against cis women/girls in sports?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/lczo09/anyone_one_else_hate_it_when_unnecessary_music_is.json": "Anyone one else hate it when unnecessary music is played over a video?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ld8431/does_anybody_else_struggle_with_lefts_and_rights.json": "Does anybody else struggle with lefts and rights? I know which one is which it just takes me a few seconds.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ldflwg/why_is_porn_legal_but_prostitution_isnt_legal.json": "Why is porn legal but prostitution isn't legal?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ldkcgs/i_may_have_found_a_reddit_account_distributing.json": "I may have found a reddit account distributing child porn, what do i do about it?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/le5s0y/redditors_with_a_noticeable_disability_what_is.json": "Redditors with a noticeable disability, what is the etiquette when it comes to acknowledging said disability?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/lec6i6/anyone_else_enjoy_a_song_way_more_when_it.json": "Anyone else enjoy a song WAY more when it randomly plays on the radio instead of manually playing it yourself?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/lek27k/does_anyone_else_get_the_urge_to_start_learning.json": "Does anyone else get the urge to start learning new things, read, do exercise, meet new people but they end up procrastinating?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/levpv2/does_anyone_else_ever_write_down_what_they_want.json": "Does anyone else ever write down what they want to talk about before calling or meeting up with a friend?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/lex93x/i_broke_down_in_front_of_all_my_male_friends_what.json": "I broke down in front of all my male friends what do I do?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/lf7jxi/men_of_reddit_when_shaving_have_you_ever_left_the.json": "Men of reddit. When shaving, have you ever left the middle of your upper lip for last to see what you would look like with the hitler mustache before going clean shaven?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/lfbocg/does_anybody_else_hate_how_unrealistically.json": "Does anybody else hate how unrealistically intelligent high schoolers in movies/TV shows are?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/lfdfcn/does_anyone_else_feel_like_theyre_going_to_drive.json": "Does anyone else feel like they're going to drive themselves crazy one day?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/lfyb03/does_anyone_else_think_that_gay_characters_are.json": "Does anyone else think that gay characters are forcefully pushed into many series just so the series could be politically correct on the expense of characters and plot?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/lg9670/is_anyone_else_only_anxiety_free_when_they_are.json": "Is anyone else only anxiety free when they are completely alone and free from being interacted with? I daydream all day about being by myself to be creative or learn with zero distractions.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/lg9kwg/does_anybody_else_feels_burntout_and_has_no.json": "Does anybody else feels burnt-out and has no mental energy whatsoever?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/lgb3rl/anyone_else_straight_up_unable_to_hear_song_lyrics.json": "anyone else straight up unable to hear song lyrics???",
  "data/reddit-ask/r/TooAfraidToAsk/comments/lgnqb6/does_anybody_else_feel_like_does_anybody_else.json": "Does anybody else feel like \"does anybody else\" questions should all be redirected to r/doesanybodyelse?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/lgrae4/do_you_ever_not_eat_for_so_long_you_just_stop.json": "Do you ever not eat for so long you just stop getting hungry?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/lh64k3/why_are_driver_seat_selfies_so_prevalent_among.json": "Why are driver seat selfies so prevalent among conservatives?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/lhhe2x/is_it_me_or_are_people_who_work_really_hard_in.json": "Is it me or are people who work really hard in their jobs or at school mostly rewarded with....more work?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/lhvxat/why_am_i_teaching_my_kids_to_be_good_people_when.json": "Why am I teaching my kids to be good people when it seems like it's the worst people who are most successful in this world?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/li0wa9/is_it_weird_that_im_really_enjoying_quarantine.json": "Is it weird that I'm really enjoying quarantine but am too afraid to tell it to anyone ?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/liemg1/anyone_else_gag_while_brushing_their_teeth_to_the.json": "Anyone else gag while brushing their teeth to the point of vomiting?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/lin1jg/does_anyone_else_check_their_reddit_to_see_if.json": "Does anyone else check their Reddit to see if your post has unexpectedly blown up? It never does and I feel no shame in admitting I have high expectations and get disappointed a lot. But it’s cool, whatever.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/liyy5m/do_the_potency_of_nukes_expire_or_are_they.json": "Do the potency of Nukes expire? Or are they constantly being maintained to be launched at any second?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/lj1079/why_does_nobody_seem_to_care_about_the_fact_that.json": "Why does nobody seem to care about the fact that China literally has concentration camps in which they put \"undesirable minorities\" and subject them to constant torture and propaganda?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/lj819s/does_anyone_else_feel_like_this_sub_is_mostly.json": "Does anyone else feel like this sub is mostly just people feigning ignorance to push forward a specific viewpoint?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ljkpsz/why_is_society_obsessed_with_sexuality.json": "Why is society obsessed with sexuality?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ljncoj/why_are_those_who_question_the_accuracy_of_what.json": "Why are those who question the accuracy of what we are told by the mainstream media so quick to be labeled “conspiracy theorists” as opposed to critical thinkers?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ljsct4/if_the_united_states_president_cannot_be_held.json": "If the United States President cannot be held accountable for inciting a riot that killed 5 Americans and inured 140 Police Officers, then is that not a King?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ljssj9/why_do_people_waste_time_making_the_same_comments.json": "Why do people waste time making the same comments on Reddit/why do all the users here sound the same?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ljt2dz/a_question_for_vegans_why_is_it_wrong_to_eat_eggs.json": "A question for vegans, why is it wrong to eat eggs?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ljx8dk/if_the_phrase_im_sorry_you_feel_this_way_is_rude.json": "If the phrase, “I’m sorry you feel this way,” is rude and condescending, what’s the right way of expressing the sentiment, “I understand you are upset and genuinely empathize with how you feel, but I don’t consider myself at fault and will not apologize or accept blame for it?”",
  "data/reddit-ask/r/TooAfraidToAsk/comments/lkd4p4/why_are_some_people_so_rude_to_people_who_dont.json": "Why are some people so rude to people who don't talk much?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/lkes1v/do_guys_who_were_circumcised_at_birth_without_a.json": "Do guys who were circumcised at birth without a medical reason resent the fact that it was done to them?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/lko9wo/why_are_anorexic_people_treated_like_victims_but.json": "Why are anorexic people treated like victims but obese people are treated like burdens in society who have no one to blame but themselves?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/lktrh4/why_are_some_people_just_itching_to_get_back_to.json": "Why are some people just itching to get back to the office during a disaster?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/lkwb78/does_anyone_here_creates_a_parallel_world_inside.json": "Does anyone here creates a parallel world inside their heads and use it as a coping mechanism against reality?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ll6swb/why_does_christianity_get_criticized_so_much_and.json": "Why does Christianity get criticized so much and it’s fine, but when somebody criticizes Islam it’s “racist”?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/llfk16/is_anybody_else_getting_the_bug_where_you_scroll.json": "Is anybody else getting the bug where you scroll past a few posts and then scroll past the exact same posts?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/llu8r0/am_i_the_only_one_who_thought_that_mary_kate_and.json": "Am I the only one who thought that Mary Kate and Ashley were three people at first?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/lm3vub/is_it_bad_that_i_want_to_work_in_food_service_my.json": "Is it bad that I want to work in food service my whole life?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/lm52zu/if_someone_changes_gender_its_unacceptable_to.json": "If someone changes gender it's unacceptable to refer to them as who they presented as years before: you accept them as they are now, so why is it acceptable to refer to an unsavoury tweet from 10 years ago and not accept the person has changed since then and isn't the same person they are now?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/lmlyc7/if_someone_is_in_a_coma_do_they_still_get_their.json": "If someone is in a coma do they still get their periods?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/lmmi2g/is_rrelationships_the_worst_place_to_get.json": "Is r/relationships the worst place to get relationship advice? It seems to me no relationship would have ever survived if everyone listened to these guys!",
  "data/reddit-ask/r/TooAfraidToAsk/comments/lnczi5/why_is_the_infantile_behavior_of_girls_sexualized.json": "Why is the infantile behavior of girls sexualized in Japanese culture?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/lnf28n/do_identical_twins_ever_worry_that_may_not_have.json": "Do identical twins ever worry that may not have the right name? That maybe they where accidently swapped at one point and noone noticed. Is there a chance of this happening or are parents really careful/ good at remeber faces?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/lngj2o/am_i_worrying_too_much_that_the_fact_we_can.json": "Am I worrying too much that the fact we can always just google everything is basically making asking things to people undesirable?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/lo0szx/why_couldnt_the_government_just_give_people.json": "Why couldn’t the government just give people financial assistance during this time?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/lo3g29/why_are_people_dying_in_texas_cant_the_huge_well.json": "Why are people dying in Texas? Can't the huge well funded military just come in and help everyone? They can literally build a city in a war zone, whats stopping them now?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/lof4iv/how_come_its_animal_abuse_to_have_an_overweight.json": "How come it's animal abuse to have an overweight pet but not child abuse to have an overweight kid?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/lok8uf/did_anyone_else_love_being_on_lockdown_having_a.json": "Did anyone else love being on lockdown? Having a reason to isolate",
  "data/reddit-ask/r/TooAfraidToAsk/comments/low8yo/does_anyone_else_have_trouble_understanding_what.json": "Does anyone else have trouble understanding what someone is saying on a phone call?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/loylau/why_do_i_feel_compelled_to_do_things_but_have_no.json": "Why do I feel compelled to do things but have no motivation to do them?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/lpbssy/why_cant_car_companies_make_vintage_looking_cars.json": "Why can’t car companies make vintage looking cars but with modern technology inside?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/lpgfm5/why_does_instagram_allow_female_nipples_that_are.json": "Why does Instagram allow female nipples that are clearly visible through thin clothing, and allow breasts with the nipples barely pixellated out, but the moment a woman posts her bare exposed nipples that's suddenly against the rules?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/lpyx1w/why_brands_like_gucci_versace_balenciaga_and.json": "Why brands like Gucci, Versace, Balenciaga and others are so expensive yet so ugly?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/lq2yj9/am_i_the_only_who_thinks_that_all_the_different.json": "Am I the only who thinks that all the different types of genders and pronouns and what not, are a little bit too much?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/lq8k85/does_anyone_else_have_a_constant_urge_to_sink.json": "Does anyone else have a constant urge to sink away from their current world and have a fresh start somewhere far away from here?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/lqhap7/why_are_trans_woman_saying_that_they_can_have.json": "Why are Trans Woman saying that they can have their period just like a regular woman? when in fact they can't.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/lqycrj/is_anyone_else_still_absolutely_loving_being_at.json": "Is anyone else still absolutely loving being at home all the time?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/lqydxy/am_i_the_only_one_who_wants_to_beg_everyone_to.json": "Am I the only one who wants to beg everyone to not visit their friends every week or refrain from doing so for just a month so we can get this shit under control?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/lqzvs3/am_i_the_only_one_who_thinks_that_people_pretend.json": "Am I the only one who thinks that people pretend to come here in good faith about trans people and pronouns but really come here to complain?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/lr3brf/am_i_wrong_for_not_being_okay_with_this.json": "Am I wrong for not being okay with this?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/lr5d00/i_hate_going_to_sleep_but_i_love_sleeping_is_this.json": "I hate going to sleep but I love sleeping is this weird?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/lrp714/my_grandfathers_brother_left_me_most_of_his.json": "My Grandfather's brother left me most of his inheritance, nothing to his children and now they expect me to give it to them. What should I do?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ls7li9/why_are_medical_gofundmes_not_the_most_obvious.json": "Why are medical GoFundMes not the most obvious sign for a failing healthcare system?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ls85ia/does_anyone_else_get_really_scared_by_the_will_i.json": "Does anyone else get really scared by the \" Will I have to do this FOREVER\" thought while traveling to work in the morning?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/lseq3m/once_a_man_gets_a_boner_does_he_have_to_cum_like.json": "Once a man gets a boner does he have to cum ? Like I mean HAVE too or else it hurts or effects them in some way ? Serious answers only because my bf makes me feel bad when I don't want sex.",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ltdjyo/does_anyone_else_feel_like_they_had_too_many.json": "Does anyone else feel like they had too many interests when they were younger, and as a result feel like you are “okay” at a lot of things, but not particularly great at any of them because of spreading the time between them all?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ltr769/is_it_just_me_or_are_a_lot_of_people.json": "Is it just me or are a lot of people unnecessarily hostile online?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/lttmn6/does_anyone_else_ever_fantasize_magically.json": "Does anyone else ever fantasize magically disappearing and starting a fresh new life as a completely different person?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ltua8d/is_it_normal_to_play_like_a_kid_as_an_adult.json": "Is it normal to play like a kid as an adult?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ltumv9/do_overweight_gay_men_tittyfuck_their_boyfriends.json": "Do overweight gay men tittyfuck their boyfriends like big breasted women sometimes do?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ltvtqa/do_you_think_that_the_rise_in_lgbqt_is_due_to.json": "Do you think that the rise in LGBQT+ is due to social acceptance, or that mankind has always been this way?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/ltyz6f/what_the_fuck_do_astronauts_do_when_they_are_horny.json": "What the fuck do astronauts do when they are horny?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/lu36y2/if_there_was_a_cure_to_gender_dysphoria_which.json": "If there was a cure to gender dysphoria which didn't require transition, would it be accepted?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/lu5f05/in_britain_do_they_call_website_cookies_website.json": "In Britain do they call website cookies website biscuits ?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/luet7h/why_is_raising_your_children_religious_not_widely.json": "Why is raising your children religious not widely considered to be indoctrination?",
  "data/reddit-ask/r/TooAfraidToAsk/comments/luj1bb/does_anyone_else_turn_on_the_subtitles_to_hear.json": "Does anyone else turn on the subtitles to hear the movie/show better?",
  "data/reddit-ask/r/TrueAskReddit/comments/lc6jb6/how_do_you_decide_what_the_correct_way_to_spend.json": "How do you decide what the correct way to spend money is?",
  "data/reddit-ask/r/TrueAskReddit/comments/ldkc5h/how_do_you_learn_to_forgive_yourself_for_past.json": "How do you learn to forgive yourself for past mistakes?",
  "data/reddit-ask/r/TrueAskReddit/comments/lgxznl/why_are_sexual_crimes_generally_considered_by.json": "Why are sexual crimes generally considered by society to be worse than murders/physical assault?",
  "data/reddit-ask/r/TrueAskReddit/comments/lhj78h/do_you_think_the_afterlife_exists_recently_im.json": "Do you think the Afterlife exists? Recently I'm getting a slight panic attacks because I've been more aware of my existence.",
  "data/reddit-ask/r/TrueAskReddit/comments/ljs05s/why_is_child_abuse_on_boys_played_for_laughs_in.json": "Why is child abuse on boys played for laughs in so many movies & TV series? And why does no one try to stop this trend?",
  "data/reddit-ask/r/TrueAskReddit/comments/lkoh6j/what_is_the_moral_responsibility_of_a_factory.json": "What is the moral responsibility of a factory worker making military weapons?",
  "data/reddit-ask/r/TrueAskReddit/comments/llg19z/when_did_you_miss_out_on_a_great_opportunity_and.json": "When did you miss out on a great opportunity and later realize you dodged a bullet?",
  "data/reddit-ask/r/TrueAskReddit/comments/llwomt/if_you_are_punished_for_being_an_efficient_and.json": "If you are punished for being an efficient and fast worker (e.g. pay cut, more unpaid works, etc.), is it then morally acceptable to stop giving your best, as long as you still fulfill all responsibilities and meet deadlines?",
  "data/reddit-ask/r/TrueAskReddit/comments/ln8vql/if_you_are_the_only_one_reaching_out_are_you.json": "If you are the only one reaching out, are you actually friends?",
  "data/reddit-ask/r/TrueAskReddit/comments/lptk7r/why_do_we_have_such_a_strong_drive_to_become.json": "Why do we have such a strong drive to become popular?",
  "data/reddit-ask/r/TrueAskReddit/comments/lqtoxt/why_are_summer_camps_for_children_common_in_the.json": "Why are summer camps for children common in the United States?",
  "data/reddit-ask/r/TrueAskReddit/comments/lsf909/how_would_we_actually_react_to_the_discovery_of.json": "how would we actually react to the discovery of alien life?",
  "data/reddit-ask/r/askphilosophy/comments/la4rgk/does_kants_view_that_space_and_time_are_merely.json": "Does Kants view that Space and Time are merely intuitions, not properties of a Things in Themselves, compatible with contemporary views in Physics on Space-Time?",
  "data/reddit-ask/r/askphilosophy/comments/lbd6kb/did_st_thomas_aquinas_believe_that_it_is_possible.json": "Did St. Thomas Aquinas believe that it is possible to comprehend the essence of beings which are not God?",
  "data/reddit-ask/r/askphilosophy/comments/lbndxf/are_descartess_meditations_and_spinozas_ethics.json": "Are Descartes's Meditations and Spinoza's Ethics good entry points in philosophy?",
  "data/reddit-ask/r/askphilosophy/comments/lcd4uv/in_a_new_paper_s_bobzien_provides_overwhelming.json": "In a new paper, S. Bobzien provides overwhelming evidence that Frege significantly and repeatedly plagiarized the Stoics. Does this diminish Frege's reputation and standing as one of the most important philosophers?",
  "data/reddit-ask/r/askphilosophy/comments/ld4mgv/does_the_language_we_use_affect_the_conclusions.json": "Does the language we use affect the conclusions we make and the subjects we talk about?",
  "data/reddit-ask/r/askphilosophy/comments/ldyb4i/how_to_get_involved_in_philosophy_without_joining.json": "How to get involved in philosophy without joining academia?",
  "data/reddit-ask/r/askphilosophy/comments/ledkqn/the_myth_of_sisyphus_albert_camus_and_some.json": "The Myth of Sisyphus, Albert Camus and some questions",
  "data/reddit-ask/r/askphilosophy/comments/lelqu1/if_philosophers_really_determine_their_position.json": "If philosophers really determine their position by evaluating the best available arguments and evidence, why do so many defend the same position for their entire career and so few change camps?",
  "data/reddit-ask/r/askphilosophy/comments/lf5fm6/is_there_much_written_on_the_philosophy_of_the.json": "Is there much written on the philosophy of the stockmarket?",
  "data/reddit-ask/r/askphilosophy/comments/lgbgqz/how_can_i_read_philosophers_without_getting_roped.json": "How can I read philosophers without getting roped in to their beliefs?",
  "data/reddit-ask/r/askphilosophy/comments/lgt6d1/would_kierkegaard_be_impressed_or_terrified_by.json": "Would Kierkegaard be Impressed or Terrified by Buddhism?",
  "data/reddit-ask/r/askphilosophy/comments/lh8xku/how_do_people_accept_the_uncertain_foundation_of.json": "How Do People Accept the Uncertain Foundation of Moral Philosophy?",
  "data/reddit-ask/r/askphilosophy/comments/lhmpdj/how_does_a_dumb_person_read_about_philosophy.json": "How does a dumb person read about philosophy?",
  "data/reddit-ask/r/askphilosophy/comments/liy3g0/is_having_a_job_slavery.json": "Is having a job slavery?",
  "data/reddit-ask/r/askphilosophy/comments/ljonr9/covid_forced_many_academics_to_work_from_home.json": "COVID forced many academics to work from home. What are some freely available online philosophy courses and other educational resources? (Lectures, Podcasts, etc.)",
  "data/reddit-ask/r/askphilosophy/comments/lkc7w7/what_different_philosophers_mean_by_wisdom.json": "What different philosophers mean by \"wisdom\"?",
  "data/reddit-ask/r/askphilosophy/comments/ll83hm/undergraduate_level_resources_for_high_school.json": "Undergraduate level resources for high school student",
  "data/reddit-ask/r/askphilosophy/comments/lle4j6/what_are_some_actually_good_atheist_philosophers.json": "What are some actually good atheist philosophers?",
  "data/reddit-ask/r/askphilosophy/comments/lmnr1y/why_so_much_spinoza.json": "Why so much Spinoza?",
  "data/reddit-ask/r/askphilosophy/comments/lnetbl/is_it_ethical_to_feel_happy_and_not_to_care_about.json": "Is it ethical to feel happy and not to care about horrible injustices in the world if you can’t change them?",
  "data/reddit-ask/r/askphilosophy/comments/loip83/how_does_the_burden_of_proof_work_exactly_so.json": "How does the Burden of Proof work exactly? So confused.",
  "data/reddit-ask/r/askphilosophy/comments/lp0rgq/can_a_person_born_w_0_senses_form_a_concept_for.json": "Can a person born w 0 senses form a concept for anything in their environment?",
  "data/reddit-ask/r/askphilosophy/comments/lpn2jf/is_it_possible_that_a_computer_could_become_so.json": "Is it possible that a computer could become so powerful that it could not only predict the future with 100% accuracy, but also be able to look back into the past?",
  "data/reddit-ask/r/askphilosophy/comments/lq8n4h/is_a_degree_in_philosophy_worth_it.json": "Is a degree in philosophy worth it?",
  "data/reddit-ask/r/askphilosophy/comments/lquvmq/what_paper_or_other_work_of_philosophy_backfired.json": "What paper or other work of philosophy backfired for you?",
  "data/reddit-ask/r/askphilosophy/comments/lrd2zp/what_does_aristotle_mean_by_this.json": "What does Aristotle mean by this?",
  "data/reddit-ask/r/askphilosophy/comments/ls1upx/is_it_possible_to_actually_be_a_nihilist.json": "Is it possible to actually be a nihilist?",
  "data/reddit-ask/r/askphilosophy/comments/ls72h1/were_foucault_sartre_and_simone_de_beauvoir.json": "Were Foucault, Sartre, and Simone de Beauvoir pro-pedophilia?",
  "data/reddit-ask/r/askphilosophy/comments/ltb45f/should_you_always_aim_to_improve_society_when.json": "Should you always aim to improve society when society doesn't seem to care?",
  "data/reddit-ask/r/askphilosophy/comments/ltq5q1/ive_been_reading_japanese_philosophy_a_sourcebook.json": "I've been reading Japanese Philosophy: A Sourcebook and there's a notable absence of political philosophy prior to Meiji period. Why? Is there a Japanese political philosophy?",
  "data/reddit-ask/r/askscience/comments/la1azg/if_you_dug_a_hole_straight_down_to_the_other_side.json": "If you dug a hole straight down to the other side of the earth, what would happen if you dropped something through it?",
  "data/reddit-ask/r/askscience/comments/la21s1/how_do_we_know_if_sound_cames_from_behind_or_from.json": "How do we know if sound cames from behind or from front?",
  "data/reddit-ask/r/askscience/comments/lap0zq/when_tissue_is_grafted_how_do_the_blood_vessels.json": "When tissue is grafted, how do the blood vessels in the graft find and connect to the blood vessels in the graft site?",
  "data/reddit-ask/r/askscience/comments/lbarcf/how_does_north_koreas_handling_of_covid19_affect.json": "How does North Korea's handling of COVID-19 affect the development and eradication of the pandemic? Will vaccines be available there?",
  "data/reddit-ask/r/askscience/comments/lbqk3n/why_does_covid_have_neurological_effects_on_the.json": "Why does Covid have neurological effects on the brain/sense of smell?",
  "data/reddit-ask/r/askscience/comments/lbqzwl/what_kind_of_material_are_those_sticky_hand_toys.json": "What kind of material are those sticky hand toys made of and why is it able to be washed and continued to be tacky?",
  "data/reddit-ask/r/askscience/comments/lcg8l0/askscience_ama_series_updates_on_covid_vaccines.json": "AskScience AMA Series: Updates on COVID vaccines. AUA!",
  "data/reddit-ask/r/askscience/comments/ld31as/are_the_vaccine_efficacies_for_covid_vaccines.json": "Are the vaccine efficacies for COVID vaccines able to be directly compared?",
  "data/reddit-ask/r/askscience/comments/ld548f/how_does_the_storing_of_qubits_work_in_quantum.json": "How does the storing of Qubits work in Quantum Computing and what materials are used for these semi conductors?",
  "data/reddit-ask/r/askscience/comments/ldjt14/covid_vaccine_effectiveness_and_different_covid.json": "COVID vaccine effectiveness and different COVID variants.. why do the variants have different effectiveness?",
  "data/reddit-ask/r/askscience/comments/ldx6lc/when_will_people_under_16_be_able_to_get_a_vaccine.json": "When will people under 16 be able to get a vaccine?",
  "data/reddit-ask/r/askscience/comments/le6jsk/what_do_nonhuman_primates_do_with_their_dead_how.json": "What do non-human primates do with their dead? How do they mourn them? What do they do with their bodies?",
  "data/reddit-ask/r/askscience/comments/lemdqb/if_the_coronavirus_keeps_mutating_to_evade_our.json": "If the coronavirus keeps mutating to evade our vaccines, like the South African mutation, and we keep on updating vaccines to protect against the new variants, would the virus ever “run out” of new mutations to try?",
  "data/reddit-ask/r/askscience/comments/lfacyi/askscience_ama_series_we_are_bechara_choucair.json": "AskScience AMA Series: We are Bechara Choucair, Carole Johnson, and Tim Manning, the vaccine, testing, and supply coordinators for the White House COVID-19 Response Team. AUA!",
  "data/reddit-ask/r/askscience/comments/lfxjbj/which_planet_has_the_best_moonlight.json": "Which planet has the best \"moonlight\"?",
  "data/reddit-ask/r/askscience/comments/lfz2qm/what_happens_to_noise_energy_once_you_can_no.json": "What happens to noise energy once you can no longer hear the noise?",
  "data/reddit-ask/r/askscience/comments/lgdac4/what_is_the_science_behind_the_nfls_policy_of.json": "What is the Science behind the NFL's policy of adjusting medical diagnosis by racial factors when determining insurance payouts for concussion injuries?",
  "data/reddit-ask/r/askscience/comments/lggp4d/what_does_the_measurement_stand_for_when.json": "What does the measurement stand for when measuring antibodies?",
  "data/reddit-ask/r/askscience/comments/lgs68h/askscience_ama_series_im_david_pogue_tech_and.json": "AskScience AMA Series: I'm David Pogue, tech and science writer, and host of NOVA PBS' new series Beyond the Elements. AMA!",
  "data/reddit-ask/r/askscience/comments/lgsgc1/would_it_be_possible_to_cultivate_crops_in_lunar.json": "Would it be possible to cultivate crops in Lunar regolith?",
  "data/reddit-ask/r/askscience/comments/lgywrv/in_late_spring_2020_several_researchers_around.json": "In late Spring 2020 several researchers around the world found traces of COVID in samples of things like sewage that were taken before the outbreak. Have any studies followed up on this?",
  "data/reddit-ask/r/askscience/comments/lhfuip/why_do_some_people_experience_more_sideeffects.json": "Why do some people experience more side-effects from vaccines than others?",
  "data/reddit-ask/r/askscience/comments/lhja9h/askscience_ama_series_im_jason_schwartz_an_expert.json": "AskScience AMA Series: I'm Jason Schwartz, an expert on vaccine policy and COVID vaccination rollout, and a professor at the Yale School of Public Health. AMA!",
  "data/reddit-ask/r/askscience/comments/li8fwl/why_are_people_with_poultry_at_home_barred_from.json": "Why are people with poultry at home barred from working in the vaccines industry?",
  "data/reddit-ask/r/askscience/comments/lit2c6/why_do_scientists_bombard_specific_elements_to.json": "Why do Scientists Bombard Specific Elements to Create New Ones?",
  "data/reddit-ask/r/askscience/comments/lj3rtu/is_there_a_theoretical_limit_to_the_energy.json": "Is there a theoretical limit to the energy density of lithium ion batteries?",
  "data/reddit-ask/r/askscience/comments/ljf9cl/why_do_animals_have_different_lifespans.json": "Why do animals have different lifespans?",
  "data/reddit-ask/r/askscience/comments/lk2air/is_coughing_an_evolutionary_advantage_if_so_why.json": "Is coughing an evolutionary advantage? If so, why do we try to suppress it with cough syrup ?",
  "data/reddit-ask/r/askscience/comments/lk5lhj/how_are_blood_vessels_connected_in_a_partial.json": "How are blood vessels connected in a partial liver transplant?",
  "data/reddit-ask/r/askscience/comments/lkeguh/askscience_ama_series_we_are_evolutionary.json": "AskScience AMA Series: We are evolutionary biologists from the University of Tennessee celebrating Darwin Day. Ask Us Anything!",
  "data/reddit-ask/r/askscience/comments/lkfqqg/how_significant_is_fever_in_suppressing_virus.json": "How significant is fever in suppressing virus outbreaks?",
  "data/reddit-ask/r/askscience/comments/ll2dms/askscience_ama_series_were_an_international_team.json": "AskScience AMA Series: We're an international team of astronomers and engineers working to directly image planets in the habitable zones of nearby stars. Ask Us Anything!",
  "data/reddit-ask/r/askscience/comments/llm7gd/why_cannot_countries_mass_produce_their_own.json": "Why cannot countries mass produce their own vaccines by “copying the formulae” of the already approved Moderna and Pfizer vaccines?",
  "data/reddit-ask/r/askscience/comments/lmar2c/how_does_heat_dissipation_work_in_space_feel_free.json": "How does heat dissipation work in space (feel free to be technical)?",
  "data/reddit-ask/r/askscience/comments/lml7bh/askscience_ama_series_we_are_geoscientists.json": "AskScience AMA Series: We are geoscientists, emergency managers and communication specialists working on the ShakeAlert earthquake early warning system in CA, OR and WA. Ask us anything!",
  "data/reddit-ask/r/askscience/comments/lmrm3k/why_do_we_use_gold_instead_of_silver.json": "Why do we use gold instead of silver?",
  "data/reddit-ask/r/askscience/comments/ln1aja/how_exactly_do_you_winterize_a_power_grid.json": "How exactly do you \"winterize\" a power grid?",
  "data/reddit-ask/r/askscience/comments/lnh6h9/can_dolphins_and_whales_sense_depth_and_do_they.json": "Can dolphins and whales sense depth, and do they know when they've gone too deep?",
  "data/reddit-ask/r/askscience/comments/lnjkx4/will_babies_who_have_experienced_their_first_year.json": "Will babies who have experienced their first year of life within the pandemic see long term immune system effects?",
  "data/reddit-ask/r/askscience/comments/lnq539/was_the_seasonal_flu_a_phenomenon_before_the_1918.json": "Was the \"seasonal flu\" a phenomenon before the 1918 Flu Pandemic?",
  "data/reddit-ask/r/askscience/comments/lo8wtt/is_baby_weight_at_birth_indicative_of_later_frame.json": "Is baby weight at birth indicative of later frame size as an adult?",
  "data/reddit-ask/r/askscience/comments/louis7/how_did_sinovac_develop_an_inactivated_vaccine.json": "How did sinovac develop an inactivated vaccine faster than the the new rna vaccines?",
  "data/reddit-ask/r/askscience/comments/lp20h0/what_protocols_does_nasa_use_to_communicate_long.json": "What protocol(s) does NASA use to communicate long distances?",
  "data/reddit-ask/r/askscience/comments/lpcguy/do_covid19_vaccines_prevent_long_covid.json": "Do COVID-19 vaccines prevent Long COVID?",
  "data/reddit-ask/r/askscience/comments/lptvr4/how_do_two_metals_in_space_bond_together.json": "How do two metals in space bond together?",
  "data/reddit-ask/r/askscience/comments/lpx9pq/the_mars_perseverance_rovers_parachute_has_an.json": "The Mars Perseverance Rover's Parachute has an asymmetrical pattern to it. Why is that? Why was this pattern chosen?",
  "data/reddit-ask/r/askscience/comments/lqgs7a/askscience_ama_series_we_are_rare_disease_experts.json": "AskScience AMA Series: We are rare disease experts and directors with the NIH, ask us anything!",
  "data/reddit-ask/r/askscience/comments/lqnv37/how_has_the_flu_been_affected_by_the_lack_of.json": "How has the flu been affected by the lack of people getting it?",
  "data/reddit-ask/r/askscience/comments/lrb6kq/askscience_ama_series_hello_reddit_for_medscape.json": "AskScience AMA Series: Hello Reddit! For Medscape Education, we are Dr. Fatima Cody Stanford, Dr. Rachel M. Bond, Dr. John Whyte, and Michael Sapienza ready to answer your questions about Health Equity in the Time of COVID. Ask Us Anything!",
  "data/reddit-ask/r/askscience/comments/lrijdh/why_do_vaccines_provide_longer_immunity_from_a.json": "Why do vaccines provide longer immunity from a virus than natural infection?",
  "data/reddit-ask/r/askscience/comments/lrzljj/is_it_a_legitimate_claim_to_say_that_random.json": "Is it a legitimate claim to say that random, erratic weather is a result of climate change?",
  "data/reddit-ask/r/askscience/comments/ls1zrp/is_it_possible_to_scale_down_a_linear_accelerator.json": "Is it possible to scale down a linear accelerator for it to fit into a spacecraft to power it by firing particles out of the other end?",
  "data/reddit-ask/r/askscience/comments/lsbir8/why_do_young_healthy_people_have_more_intense.json": "Why do young, healthy people have more intense vaccine reactogenicity but get less sick when they catch a virus?",
  "data/reddit-ask/r/askscience/comments/lsdn7i/why_do_giraffes_only_live_for_25_years_but.json": "Why do Giraffes only live for 25 years but Elephants live upto 70 years even though they both share similar diets, size and live in the same parts of the world?",
  "data/reddit-ask/r/askscience/comments/lt0e0o/can_a_photon_release_a_portion_of_its_energy.json": "Can a photon release a portion of its energy?",
  "data/reddit-ask/r/askscience/comments/ltk3dx/questions_about_radon_gas_and_cancer.json": "Questions about radon gas and cancer?",
  "data/reddit-ask/r/askscience/comments/ltp2hq/can_years_long_chronic_depression_irreversibly.json": "Can years long chronic depression IRREVERSIBLY \"damage\" the brain/ reduce or eliminate the ability to viscerally feel emotions?",
  "data/reddit-ask/r/askscience/comments/lu1no5/what_percentage_of_genes_are_purely_human.json": "What percentage of genes are purely human?",
  "data/reddit-ask/r/askscience/comments/lul7nu/what_type_of_porcelain_glaze_reduces_surface.json": "What type of porcelain glaze reduces surface tension?"
}